{"2020-07-29T16:44:37.000Z": "NEWS FLASH: National publication @bizfacilities gives Alabama high marks for business climate, workforce training & auto manufacturing strength.\n\nBirmingham and Huntsville earn ratings as top cities for business climate. https:// bit.ly/3hRO9k1", "2020-07-29T16:07:55.000Z": "Alabamians, I thank you for your understanding, for your patience, for your support and for your willingness to help us get through these difficult days. We're in this #TogetherAL . #alpolitics", "2020-07-29T16:06:38.000Z": "While a majority of the #SaferAtHome order will remain the same, there's one addition to this order that will impact those schools providing in-class instruction. They'll now be required to wear masks whenever practical from second grade to college. #TogetherAL  #alpolitics", "2020-07-29T16:05:23.000Z": "We must remain vigilant if we're going to get our kids back in schools & keep our economy open. Wearing a mask can't hurt but can only help. It's a way to protect yourself as well as others you work with, care about & even love. #TogetherAL  #MaskUpAL  #alpolitics", "2020-07-29T16:04:50.000Z": "The new order includes extending our statewide mask ordinance until August 31. While no one likes having to wear a mask, I believe we are making progress in this area. #TogetherAL  #MaskUpAL  #alpolitics", "2020-07-29T16:03:58.000Z": "Today, with the support of Dr. Harris, I am extending our current #SaferAtHome order until the end of August with a few minor modifications. Learn more here: https:// governor.alabama.gov/newsroom/2020/07/governor-ivey-issues-amended-safer-at-home-order-5/  . @ALPublicHealth  #TogetherAL  #alpolitics", "2020-07-29T15:11:33.000Z": "Today, I'm holding a joint press conference with Dr. Scott Harris to provide an update on our state's #COVID19 efforts. You can watch it live at 11 a.m. via http:// facebook.com/KayIveyAL/ or your local news stations. #alpolitics  #TogetherAL  @ALPublicHealth", "2020-07-28T22:08:58.000Z": "I want to recognize @TCSBoardofEd & their partners for creating \"Leaders are Readers,\" a community-wide initiative to encourage students to make time for reading. Visit https:// tuscaloosareads.org/leaders/ to check out the initiative; you may just see some familiar faces! @AlabamaAchieves Leaders ARE Readers! \"Leaders are Readers\" is a community-wide initiative to encourage students to make time for reading. Tuscaloosa City Schools in partnership with Tuscaloosa Education Foundation, Cadence Bank, Unite tuscaloosareads.org", "2020-07-28T14:09:22.000Z": "This plan will allow for grant funding opportunities that expand access to EV charging stations along heavily traveled areas of our state & invest in AL's future by supporting consumers' choice to adopt electric vehicles. @ADECA  @ALCleanFuels  #alpolitics  http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=14032  Quote Tweet ADECA @ADECA . @GovernorKayIvey has announced that @ADECA has partnered with @ALCleanFuels to create a statewide plan to provide more electric vehicle charging stations throughout the state. Show this thread", "2020-07-26T22:43:29.000Z": "Today, we pay tribute to Alabama's son, a humble public servant for all people. Congressman Lewis you will be dearly missed in this world, but your legacy will continue to guide us and inspire future generations. #GoodTrouble  #BelovedCommunity  #HumanDignity", "2020-07-26T22:41:44.000Z": "From Troy to Selma to Montgomery, Alabama is honored to welcome Rep. John Lewis back home to celebrate his life & to lie in state at the State Capitol. 55 years ago, this very act could not have been imagined yet alone carried out. #GoodTrouble  #BelovedCommunity  #HumanDignity", "2020-07-24T15:19:26.000Z": "Stay strong, Alabama. #MaskUpAL  #TogetherAL  #alpolitics", "2020-07-23T21:45:40.000Z": "This afternoon, I joined the Alabama Legislative Black Caucus for an important discussion regarding law enforcement. I appreciate the caucus & officers for sharing their input on how we can better support our men & women in uniform and strengthen our communities. #alpolitics", "2020-07-23T16:00:33.000Z": "Celebrate Christmas in July by filling out your Census! @uscensusbureau  @AlabamaCounts  @GovernorKayIvey", "2020-07-23T16:44:35.000Z": "Thank you to everyone that participated in our Sweet Grown Alabama Day event yesterday! I hope the @Sweet_Grown_AL brand has a lasting impact on our state as we work to increase awareness of our local farmers & their great products. Gov. Ivey Proclaims Sweet Grown Alabama Day Gov. Ivey proclaimed July 22, 2020 as Sweet Grown Alabama Day in the state of Alabama. Gov. Ivey joined state leaders and members of the agriculture communit... youtube.com", "2020-07-23T15:35:45.000Z": "Ever wanted to be a superhero? Here's your chance to help save lives!  #MaskUpAL  #TogetherAL  https:// governor.alabama.gov/newsroom/2020/07/governor-ivey-issues-amended-safer-at-home-order-4/ ", "2020-07-23T14:02:06.000Z": "For general #COVID19 questions, call 1-800-270-7268 or email covid19info@adph.state.al.us. Calls are answered from 8 a.m. - 6 p.m. daily. Find your nearest #COVID19 testing location by visiting https:// dph1.adph.state.al.us/covid-19/ & selecting the \"Test Sites\" tab. @ALPublicHealth  #TogetherAL", "2020-07-22T17:15:20.000Z": "Today we're celebrating Sweet Grown Alabama Day! @Sweet_Grown_AL is a statewide brand that creates awareness of, & increase demand for, Alabama grown goods through purposeful & focused public relations. We are proud to support our farmers! #ThankAFarmer  https:// sweetgrownalabama.org", "2020-07-22T13:16:24.000Z": "Don't forget about @ReviveAlabama , a grant program designed for Alabama small businesses impacted by COVID-19. This is the last week to apply, and applications close Saturday, July 25 at midnight. Revive Alabama REVIVE ALABAMA: COVID-19 Cash Grants for Alabama Small Businesses Alabama small businesses are a vital component of our communities and our state's economy. Unfortunately, the ongoing COVID-19... revenue.alabama.gov", "2020-07-22T14:13:01.000Z": "Small business owners don't forget to participate in the Revive Alabama grant program, which will reimburse businesses up to $15,000 for expenses related to #COVID19 . The application is open until midnight on July 25. Apply at: https:// revenue.alabama.gov/revive-alabama/ . #TogetherAL  @AlabamaRevenue", "2020-07-21T20:40:12.000Z": "Congratulations @MarionMilitary for being ranked the #1 community college in Alabama and #7 in the nation by @NicheSocial . @ACCS_Education  #MarionMade Marion Military Institute Receives Top Honors - Alabama News From the West Alabama Newsroom- A community college in West Alabama is voted the top community college in the state of Alabama - and one of the top ten community colleges in the country. Marion... alabamanews.net", "2020-07-21T20:00:36.000Z": "Now is not the time to become complacent. We are a team, Alabama. We are in this #COVID19 battle together, and we need everyone's help. #MaskUpAL  #TogetherAL", "2020-07-21T19:00:40.000Z": "AL driver license holders will now be allowed to renew online a second time during a 12-year period. We want to lift burdens & ensure the health and safety of every Alabamian as we battle #COVID19 . Thank you, @ALEAprotects for this extension. #alpolitics Governor Ivey Announces Statewide Online Driver License Renewal Extension - Office of the Governor... MONTGOMERY - Governor Kay Ivey on Tuesday announced Alabama driver license holders will now be allowed to renew online a second time during a 12-year period. Until now, driver license holders were... governor.alabama.gov", "2020-07-21T18:29:10.000Z": "I'm proud Alabama will be a part of the @NatlGovsAssoc & @Comm_College Reskilling and Recovery Network. We look fwd to working with our counterparts across the U.S. to develop strategies to help our businesses & workers recover & succeed in a post-pandemic economy. #alpolitics Quote Tweet NGA @NatlGovsAssoc In conjunction with @Comm_College , we launched a network to help identify fast strategies to give workers the skills necessary to succeed in an economy reshaped by the #COVID19 pandemic. 20 states committed. @sfoundation  @LuminaFound  https:// nga.org/news/press-rel eases/20-states-join-network-to-identify-and-scale-strategies-to-help-workers-succeed-in-a-post-pandemic-economy/ ", "2020-07-21T16:19:35.000Z": "We've updated our #SaferAtHome mask requirement FAQ. See below or visit https:// governor.alabama.gov/assets/2020/07 /BPPS.Coronavirus.MaskOrderFAQ.1.0720na.pdf  . @ALPublicHealth  #MaskUpAL  #TogetherAL  #alpolitics", "2020-07-21T16:00:32.000Z": "Spread the word that kids can enjoy up to two FREE healthy meals every weekday at locations across Alabama! Find a location near you at http:// breakforaplate.com/participate . #BreakforaPlate  #SummerMeals  #NoKidHungry  #Alabama", "2020-07-21T15:45:42.000Z": "Low participation will reduce federal funding for:\n\n Education\n Free & reduced-price school lunches\n Housing assistance\n Roads & infrastructure\n Health Care\n\nMake sure #ALCounts by completing the census online at http:// my2020Census.gov or call 1-844-330-2020!", "2020-07-21T15:44:09.000Z": "I had a productive call with the @uscensusbureau , @ADECA & members of the media. The #2020Census is critical to the future of our state. We're currently around a 60% participation rate which is about 2 points behind the national average. We must do better, Alabama. @AlabamaCounts", "2020-07-21T14:05:19.000Z": "Our friends at @LifeSouth need convalescent plasma donations from anyone that has fully recovered from #COVID19 . These donations will help critically ill patients fight the virus. Visit http:// lifesouth.org or call 888-795-2707 to schedule an appointment. #TogetherAL", "2020-07-21T13:41:44.000Z": "We're proud to stand behind @AldiUSA 's commitment to bringing value to the people of Alabama & the Gulf Coast region, & we welcome the company's plans for a regional headquarters & distribution hub in Loxley that'll create jobs for our hardworking citizens. #MadeinAL  #alpolitics Quote Tweet Made in Alabama @MadeinAL BREAKING: Grocery retailer @AldiUSA plans to invest $100M in Alabama regional HQ & distribution hub, creating 200 jobs in Baldwin County https:// bit.ly/2ZN22K0", "2020-07-20T21:54:13.000Z": "Alabama, we have to step it up. Complete the #2020Census NOW at http:// my2020Census.gov or call 1-844-330-2020! #ALCounts  @AlabamaCounts 1.5 million Alabama households have completed 2020 census - Alabama NewsCenter Alabama's 59.7% lags the national response rate but tops most Southern states. alabamanewscenter.com", "2020-07-20T16:20:32.000Z": "Alabama's  citizens  and visitors are highly encouraged to help slow the spread of #COVID19 by wearing a mask/face covering when out in public. #MaskUpAL  #TogetherAL Learn more: https:// governor.alabama.gov/newsroom/2020/07/governor-ivey-issues-amended-safer-at-home-order-4/  .", "2020-07-20T19:24:20.000Z": "I'm pleased to award $70 million to support the Alabama State Department of Education's Education Health and Wellness Grant Program & $100 million to support the Educational Remote Learning Devices Grant Program. #alpolitics  #aledchat Learn more - https:// governor.alabama.gov/newsroom/2020/07/governor-ivey-announces-170-million-for-health-care-and-remote-learning-in-alabama-public-schools/ ", "2020-07-20T15:29:30.000Z": "Today is the 51st anniversary of the #Apollo11 moon landing. I'm so proud of @NASA_Marshall & our Alabama companies - @Dynetics , @ulalaunch , @blueorigin - that are helping @NASA reach the moon once again for a 2024 launch! #SpaceExplorationDay  @WhiteHouse  https:// madeinalabama.com/2020/04/alabam a-connections-run-strong-in-nasa-picks-for-moon-lander-systems/ ", "2020-07-18T16:52:22.000Z": "As a mark of respect, I've directed flags be flown at half-staff across Alabama to honor Congressman John Lewis. https:// governor.alabama.gov/assets/2020/07 /Flag-Memo-for-Congressman-John-Lewis-.pdf ", "2020-07-18T16:22:05.000Z": "America owes a debt of gratitude to Rep. John Lewis for his lifelong work to build a better, more equal nation. Quote Tweet Governor Kay Ivey @GovernorKayIvey Our country has lost one of its most beloved Civil Rights leaders. I join my fellow Alabamians & the nation in mourning the death of Rep. John Lewis. He dedicated his life to serving his community & advocating for others. We'll forever remember his heroism & his enduring legacy.", "2020-07-18T12:40:13.000Z": "Our country has lost one of its most beloved Civil Rights leaders. I join my fellow Alabamians & the nation in mourning the death of Rep. John Lewis. He dedicated his life to serving his community & advocating for others. We'll forever remember his heroism & his enduring legacy.", "2020-07-17T20:46:05.000Z": "Wayne Farms, @EnterpriseState , & @LBWCC have launched AL's first accredited workforce development apprenticeship program. This is a fine example of the partnerships we hope to spur across our state to reach our workforce attainment goal. @ACCS_Education Wayne Farms and Alabama Community College System launch first apprenticeship program The education and industry partnership between Wayne Farms and two area community colleges was developed to focus on hard-to-fill mechanical, electrical and technical positions. wtvy.com", "2020-07-17T19:42:46.000Z": "The #RebuildAL Act continues to positively impact our state's roads & bridges. As you drive across AL, you'll notice more of these signs are up - showcasing areas where ALDOT is building a safer & more modern infrastructure system. Here's the newest one in Montgomery. #alpolitics", "2020-07-17T19:26:08.000Z": "ICYMI: Here's my interview on @realtalk995 from this morning. It's always a pleasure to talk to Matt & Aunie! \n\nWe need all of our people to take personal responsibility & wear a mask.  #MaskUpAL  #TogetherAL 07/17 Matt & Aunie Morsel: Governor Kay Ivey An Audioboom post by Matt & Aunie audioboom.com", "2020-07-17T16:54:31.000Z": "We are counting on our business community to help us slow the spread of #COVID19 by abiding by the new, statewide mask order. We've created free graphics for businesses to print & share in their stores. Download them here: https:// governor.alabama.gov/assets/2020/07 /2020-Mask-Mandate-Graphics-ALL.pdf   #MaskUpAL  #TogetherAL", "2020-07-17T15:22:09.000Z": "Responding to the #2020Census is your civic duty. Just 6 minutes will fund the next 10 years of life in Alabama. #ALCounts  @AlabamaCounts Complete the census via: : http:// My2020Census.gov  : 1-844-330-2020 : Mail form", "2020-07-17T13:02:18.000Z": "Tune in to the @MAShow995 this morning at 9:30! I'll be discussing Alabama's latest efforts in our fight against #COVID19 and our current #SaferAtHome order with @mattmurphyshow & @AunieLindenberg . #TogetherAL  #alpolitics", "2020-07-16T19:16:34.000Z": "Great name, Margo! Quote Tweet Margo Gray @MargoGray48 My superhero name is \"Maskidon\" and my super power is dodging coughs and sneezes!!!", "2020-07-16T18:59:15.000Z": "Today, I'm awarding $2.9 million in grants to seven projects across our state to continue providing more Alabamians with access to high-speed internet services. @ADECA  #alpolitics  https:// governor.alabama.gov/newsroom/2020/07/gov-ivey-awards-broadband-grants-for-7-projects-in-alabama/ ", "2020-07-16T18:24:57.000Z": "Alabama's statewide mask order takes effect at 5 p.m. today. Citizens & visitors are highly encouraged to help slow the spread of #COVID19 by wearing a mask/face covering when out in public. #MaskUpAL  #TogetherAL  #alpolitics Learn more: https:// governor.alabama.gov/newsroom/2020/07/governor-ivey-issues-amended-safer-at-home-order-4/  .", "2020-07-16T17:01:17.000Z": "AL's sales tax holiday starts tomorrow at 12:01 a.m. & ends Sunday, July 19 at midnight. Whether you're doing school in the classroom or at home, you'll still need to stock up on supplies. View tax exempt items --> https:// revenue.alabama.gov/wp-content/upl oads/2017/05/STHolidayQuickRefSheet20.pdf  . @AlabamaRevenue Diapers, clothing among items included in Alabama's sales tax holiday Alabama's annual back-to-school sales tax holiday is Friday through Sunday. wsfa.com", "2020-07-16T14:58:11.000Z": "DEADLINE EXTENDED TO JULY 31! ADPH joins @ACESedu , @AuburnU and @aumontgomery for the Alabama Food Access and Food Security During COVID-19 Survey. This survey helps understand how #COVID19 affects food buying and access for Alabamians. Take the survey at http:// go.usa.gov/xwuCk .", "2020-07-16T16:42:38.000Z": "#MadeinAL Quote Tweet Made in Alabama @MadeinAL Alabama's #econdev pipeline remains active, with new projects set to create nearly 400 jobs Revere to add 120 jobs https:// bit.ly/38F2A7q  Pinnacle $95M wood pellet plant: https:// bit.ly/3fu7gzE  SiO2 plans $163M expansion https:// bit.ly/3ghRfgl", "2020-07-16T15:56:30.000Z": "REMINDER: The application portal for the Revive Alabama grant program opens up today at NOON & runs through midnight on July 25. Business owners may access the grant application via @AlabamaRevenue 's website: https:// revenue.alabama.gov/revive-alabama/ . #alpolitics  #TogetherAL", "2020-07-16T15:08:25.000Z": "Today, I'm proud to announce the creation of the Alabama Innovation Commission, our first statewide commission for innovation, technology and entrepreneurship. #InnovateAlabama  #alpolitics  https:// governor.alabama.gov/newsroom/2020/07/governor-ivey-announces-creation-of-the-alabama-innovation-commission-to-promote-entrepreneurial-growth/ ", "2020-07-16T12:14:38.000Z": "\"According to Chief Barber, the plan is to encourage compliance and each officer will carry extra masks to help people out.\" Good plan, Chief Barber! That is the attitude we need. We can only get past this by working together. #WearAMask  #TogetherAL Police Chiefs in Baldwin County differ on enforcement of state mask order Alabama Governor Kay Ivey's mask order is proving controversial to the public and within law enforcement agencies tasked with upholding it. Spanish Fort Police Chief John Barber said officers will... mynbc15.com", "2020-07-15T20:46:28.000Z": "#TogetherAL  #alpolitics  #powerofgood Quote Tweet alabamapower @alabamapower JumpStartAL is a new workforce initiative that uses leading edge VR training solutions to develop Alabama's next generation of highly skilled workers. We are thrilled to work alongside public-private partners on this innovative program.  Learn more. https:// bit.ly/2DLQyhl", "2020-07-15T19:05:56.000Z": "I agree, Judy! We all have to do our part! #TogetherAL Quote Tweet Judith Adams @ASPAJadams Holy maskers, Batman!  Let's all be superheroes and wear our mask!  Squashing this virus is good for public health - good for Alabama's economy and jobs! twitter.com/LeahCGarner/st", "2020-07-15T16:36:42.000Z": "Here's a FAQ to go along with the amended #SaferAtHome order. #MaskUpAL  #TogetherAL  #alpolitics", "2020-07-15T16:08:38.000Z": "We are going to need everyone's help if we are going to slow the spread and turn these trends into a different direction. We are asking everyone to do a better job practicing social distancing, personal hygiene and, now, wearing face masks. #TogetherAL  #alpolitics", "2020-07-15T16:05:42.000Z": "To help our fellow citizens, we've created graphics for our businesses & stores to download for free that can be printed & displayed in a window letting the public know you require a mask. These graphics are available at http:// governor.alabama.gov ! #TogetherAL  #alpolitics", "2020-07-15T16:04:54.000Z": "However, as I have stated - this mask order is hard to enforce - so once again, I am calling on everyone in our state to practice personal responsibility & wear a mask. I continue to believe that personal responsibility is everyone's responsibility. #TogetherAL  #alpolitics", "2020-07-15T16:04:25.000Z": "This will be in addition to our #SaferAtHome order that expires July 31. Nothing else in the order changes & at this time we will not be further limiting capacity nor restricting events from operating. @ALPublicHealth  #TogetherAL  #alpolitics", "2020-07-15T16:03:04.000Z": "Today, with the support of Dr. Harris, the medical community & many in the business community, I'm announcing a statewide mask order effective Thursday, July 16 to be in place until the end of the month. \nRead: https:// governor.alabama.gov/newsroom/2020/07/governor-ivey-issues-amended-safer-at-home-order-4/   @ALPublicHealth  #TogetherAL  #alpolitics", "2020-07-15T15:24:08.000Z": "JumpStartAL will help ensure that we are positioned to attract the jobs of tomorrow by educating and training Alabamians to take advantage of the opportunities those jobs will provide. ... @MadeinAL ... ... @alabamapower  ... @ALWorksSystem  JumpStartAL launches innovative workforce initiative in Alabama - Alabama NewsCenter Public-private partnership uses VR-technology, job strategy to train and place participants. alabamanewscenter.com", "2020-07-15T15:02:46.000Z": "I'm hosting a press conference with Dr. Scott Harris today at 11 a.m. to provide an update on our state's #COVID19 efforts. You can watch it live at http:// facebook.com/KayIveyAL/ or your local news stations. #alpolitics  #TogetherAL  @ALPublicHealth", "2020-07-14T21:22:14.000Z": "Listen to @BoJackson , wear it!  #MaskUpAL  #TogetherAL  #BoKnows", "2020-07-14T20:30:00.000Z": "We welcome the growth plans of Pinnacle & Alabama Pellets in our state. My administration has made it a priority to develop rural Alabama & this manufacturing facility will create meaningful new opportunities for many citizens in Marengo County. #MadeinAL  #alpolitics Quote Tweet Made in Alabama @MadeinAL NEWS FLASH: Canada's Pinnacle Renewable Energy is teaming with 2 Alabama companies to construct a $95M industrial wood pellet plant in Demopolis, creating at least 45 jobs in Marengo County. #FDI  https:// bit.ly/3fu7gzE", "2020-07-14T15:07:14.000Z": "I'm honored the @NatlGovsAssoc selected Alabama as one of the state case studies in their comprehensive workforce guide. We're proud to showcase our workforce efforts as a model to the rest of the nation. #alpolitics  https:// governor.alabama.gov/newsroom/2020/07/alabama-highlighted-in-national-governors-association-guide-for-building-a-resilient-workforce-amid-technological-disruption/ ", "2020-07-13T20:54:49.000Z": "Great weekly column, @RepMarthaRoby ! Thanks for sharing these resources with our constituents. @al_labor  @nfib_al  @SBAgov  #alpolitics Available COVID-19 Support for Alabamians The Coronavirus (COVID-19) pandemic continues to present challenges to individuals and businesses across our state and country. It is no secret that many have struggled as a result of this novel... roby.house.gov", "2020-07-13T20:26:01.000Z": "The extended tax deadline is only two days away. Don't forget to file your tax return! @AlabamaRevenue  https:// revenue.alabama.gov/2020/07/aldor- reminds-income-taxpayers-of-approaching-july-15-deadline/ ", "2020-07-10T22:36:51.000Z": "President Trump has approved my emergency disaster declaration requests for several AL counties affected by severe storms & tornadoes in mid-April of this year. Thank you @POTUS & @fema for supporting our affected communities as they work to recover. @WhiteHouse  #alpolitics", "2020-07-10T20:42:13.000Z": "In partnership with ACGLR leaders, we've developed a call to action for Alabama Children's Policy Councils. #aledchat  #alpolitics Alabama Campaign for Grade-Level Reading Call to Action Governor Kay Ivey on Friday, July 10, 2020 announced the final report and recommendations of the Alabama Campaign for Grade-Level Reading. Governor Ivey and ... youtube.com", "2020-07-10T19:28:53.000Z": "I'm excited to share the final report and recommendations of the Alabama Campaign for Grade-Level Reading. Review their findings here: https:// governor.alabama.gov/newsroom/2020/07/governor-ivey-announces-alabama-campaign-for-grade-level-reading-final-report-and-recommendations/   #aledchat  #alpolitics", "2020-07-10T16:22:59.000Z": "Today, I want to highlight the Jones Valley Teaching Farm for all that they are doing to assist their students & community in the Birmingham area during this #COVID19 crisis. Take a look! Thank you for being a bright spot in our state, @jvteachingfarm . #TogetherAL", "2020-07-09T23:49:16.000Z": "NEWS FLASH: Michigan-based Revere Plastics Systems plans to expand its manufacturing footprint to Alabama, creating 120 jobs in Auburn. https:// bit.ly/38F2A7q", "2020-07-10T15:34:49.000Z": "Gov. Ivey awards grant for new system to aid child abuse victims. http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=13993 ", "2020-07-08T22:57:02.000Z": "In an effort to assist military families who are relocating to AL, the Alabama Military Stability Foundation recently launched the Heroes Welcome Initiative. The initiative provides a full range of resources for families transitioning to AL. #alpolitics  https:// heroeswelcome.alabama.gov", "2020-07-08T19:45:11.000Z": "Great progress, @Toyota ! #MadeinAL Quote Tweet Made in Alabama @MadeinAL NEWS FLASH: Milestones bring Toyota Alabama closer to increased engine production at automaker's Huntsville plant.\n\nThe $288M expansion project is poised for completion next year, resulting in 450 new jobs. https:// bit.ly/2Cgh7uo", "2020-07-08T15:29:41.000Z": "Today, I'm launching the Revive Alabama grant program to support small businesses in our state that have been impacted by #COVID19 . Revive Alabama will reimburse small businesses up to a combined $100M for pandemic-related expenses. https:// governor.alabama.gov/newsroom/2020/07/governor-ivey-announces-100-million-small-business-grant-program-revive-alabama/   #alpolitics  #TogetherAL", "2020-07-07T21:36:13.000Z": "Thank you @SecretaryRoss & @US_EDA for supporting our East Alabama Regional Planning & Development Commission with this critical funding! #alpolitics  #COVID19 Quote Tweet EDA @US_EDA . @CommerceGov invests $400,000 in #CARESAct funding to boost economic development programs critical to helping 10-county East #Alabama region respond to #COVID19 : https:// go.usa.gov/xfaZK", "2020-07-07T19:12:16.000Z": "It's #CleanBeachesWeek , which means we need to make sure our beautiful coast is kept litter free. If you're visiting the shoreline, remember to pick up after yourself so we can all enjoy our sparkling waters & white sand. Don't forget our #SaferAtHome order remains in effect.", "2020-07-07T14:25:23.000Z": "The number of COVID-19 cases and deaths in Alabama continue to rise, but you have the power to change this. A few simple steps can greatly reduce your chances of being exposed and exposing others to #COVID19 . Learn more at http:// go.usa.gov/xv8zp . Protect Yourself & Others (COVID-19 PSA) The number of COVID-19 cases and deaths in Alabama continue to rise, but you have the power to change this. A few simple steps can greatly reduce your chance... youtube.com", "2020-07-07T16:05:12.000Z": "Thank you to these famous Alabamians for joining our state's efforts to remind our fellow citizens of the importance of wearing a mask. #MaskUp , Alabama! #TogetherAL  #SaferAtHome  @blkfootwhtfoot  @BoJackson  @TheAlabamaBand  @StP_BrokenBones  @AlabamaFTBL Famous Alabamians Encourage Mask Use Gov. Ivey's office rolled out several PSAs on June 30, 2020, featuring famous Alabamians, to encourage mask use in the state during the COVID-19 pandemic. youtube.com", "2020-07-07T15:22:23.000Z": "I'm awarding $18.27 million of the Coronavirus Relief Fund to provide baseline testing for #COVID19 & proactive surveillance of the virus for health care personnel & residents of nursing home facilities across AL. #alpolitics  #TogetherAL  @ANHAtweets Governor Ivey Awards $18.27 Million For Coronavirus Testing for Alabama Nursing Homes - Office of... MONTGOMERY - Governor Kay Ivey on Tuesday awarded $18.27 million of the Coronavirus Relief Fund to provide baseline testing for coronavirus and proactive surveillance of the virus for health care... governor.alabama.gov", "2020-07-07T13:55:32.000Z": "Alabama small business owners, the Paycheck Protection Program has been extended to August 8. More information about the PPP, including a loan application, is available at: https:// home.treasury.gov/policy-issues/ cares/assistance-for-small-businesses  . @nfib_al  @USTreasury  @ALBankers  #TogetherAL  #alpolitics", "2020-07-06T15:00:25.000Z": "I'm pleased to award $48 million of the Governor's Emergency Education Relief Fund to @AlabamaAchieves & up to $50 million to higher education in response to challenges related to #COVID19 . Learn more: https:// governor.alabama.gov/newsroom/2020/07/governor-ivey-awards-48-million-to-alabama-department-of-education-up-to-50-million-for-higher-education/#alpolitics   #aledchat  @ALHigherEd  @ACCS_Education Governor Ivey Awards $48 Million to Alabama Department of Education, Up to $50 Million for Higher... MONTGOMERY - Governor Kay Ivey on Monday awarded $48 million of the Governor's Emergency Education Relief Fund (GEERF) to the Alabama State Department of Education in response to challenges related... governor.alabama.gov", "2020-07-04T18:37:16.000Z": "ICYMI: Please watch a video that I hope you'll find encouraging as we celebrate #IndependanceDay May we be mindful that while our country is not perfect, we are according to President Lincoln \"the last best hope on earth.\" God bless the #USA Gov. Ivey Shares Encouraging Fourth of July Message Governor Kay Ivey shares an encouraging Fourth of July message with her fellow Alabamians. (Governor's Office, Lori Davis Jhons) youtube.com", "2020-07-03T18:52:49.000Z": "Our @ALEAprotects troopers will be out in full force this holiday weekend as part of the national Drive Sober or Get Pulled Over campaign, which is designed to end DUIs. Please be safe on the roads & waterways! #DriveSafeAlabama  #DriveSober  #ArriveAlive  https:// bit.ly/2VESSwy", "2020-07-03T16:49:30.000Z": "As we celebrate America's independence this weekend, remember we're still battling a pandemic. AL's #SaferatHome order remains in effect until July 31: https:// governor.alabama.gov/newsroom/2020/06/governor-ivey-issues-amended-safer-at-home-order-3/  . Now is not the time to let our guard down. Our state & nation are depending on you. #TogetherAL", "2020-07-03T15:15:00.000Z": "The @YMCA CEOs of Alabama recently put together this inspiring message. Thank you for Standing For All and for being strong pillars in the communities you serve across our state. This truly echoes my sentiment and message earlier. #alpolitics", "2020-07-03T14:18:01.000Z": "As we approach the Fourth of July weekend, I want to share this special message with my fellow Alabamians.  #alpolitics Gov. Ivey Shares Encouraging Fourth of July Message Governor Kay Ivey shares an encouraging Fourth of July message with her fellow Alabamians. (Governor's Office, Lori Davis Jhons) youtube.com", "2020-07-02T21:56:32.000Z": "Important @al_labor Update #alpolitics Quote Tweet ADOL @al_labor We are changing the way we see people for claims assistance. Beginning July 6, you must have an appointment. We will take 300 appointments per day. Register at http:// LABOR.ALABAMA.GOV/CLAIMSCHEDULER beginning Friday, July 3 at 5:00 p.m. Note the new location. @GovernorKayIvey  @ADOLSecretary", "2020-07-02T20:39:47.000Z": "Keep up with our progress! Check out our July issue: https:// governor.alabama.gov/newsletter/ . #alpolitics", "2020-07-02T15:04:55.000Z": "That's right, Charles!  #MaskUp Alabama. #TogetherAL  #alpolitics", "2020-07-01T22:10:04.000Z": "Thank you to @USPS workers for ensuring essential mail & packages make it safely to our doors each day, especially now when our nation relies on these services even more. #PostalWorkerDay  #TogetherAL", "2020-07-01T19:02:12.000Z": "SiO2 Materials Science plans to invest $163 million in an expansion at its @CityofAuburnAL facility after securing a major contract to supply the federal government with vials to support the #COVID19 vaccine effort. @MadeinAL  #alpolitics Learn more: https:// governor.alabama.gov/newsroom/2020/07/governor-ivey-announces-sio2s-163-million-expansion-in-auburn-creating-220-jobs/ ", "2020-07-01T16:17:01.000Z": "Today marks a milestone in American history-the implementation of #USMCA ! This 21st century trade agreement is critical to fairer trade & economic growth in NA. With Mexico & Canada being 2 of our top trading partners, this deal will greatly benefit AL. @WhiteHouse  #alpolitics", "2020-07-01T15:50:40.000Z": "I'm proud to appoint Dr. Barbara Cooper as secretary of @AL_DECE ! Dr. Cooper has spent her professional career dedicated to helping students achieve their greatest potential. I have no doubt that she'll cont. the impressive work of this dept. https:// governor.alabama.gov/newsroom/2020/07/governor-ivey-appoints-dr-barbara-cooper-as-secretary-of-alabama-department-of-early-childhood-education/   #alpolitics", "2020-06-30T15:06:10.000Z": "Personal responsibility means it is everyone's responsibility. If we continue going in the wrong direction, and our hospitals are not able to handle the capacity of patients, then we're going to reserve the right to come back in & reverse course. #TogetherAL", "2020-06-30T15:05:44.000Z": "I urge you, in the strongest way I know how, to incorporate #COVID19 precautions into your daily routine. You are strongly encouraged to maintain a 6-foot distance & to wear a mask when out in public. #TogetherAL", "2020-06-30T15:05:13.000Z": "#alpolitics The extended Safer at Home Order.", "2020-06-30T15:04:15.000Z": "Today, I am announcing that our current #SaferatHome order is being extended from the July 3 expiration date to July 31 at 5 p.m. Learn more: https:// governor.alabama.gov/newsroom/2020/06/governor-ivey-issues-amended-safer-at-home-order-3/   #TogetherAL  #alpolitics 3/5 Governor Ivey Issues Amended Safer at Home Order - Office of the Governor of Alabama MONTGOMERY - Governor Kay Ivey on Tuesday issued an amended Safer at Home Order to be applied statewide. The current order, which took effect on May 22, was previously set to expire on Friday, July... governor.alabama.gov", "2020-06-30T15:01:48.000Z": "In the last few weeks, the #COVID19 cases have continued to rise & currently there are over 33,000 Alabamians who've contracted this disease today. Over 800 have died. The fact is, folks, we are still in the thick of it. #TogetherAL", "2020-06-30T15:01:04.000Z": "Folks, in a couple of weeks, it'll mark 4 months that our state has responded to #COVID19 . I'm fully aware of the physical, mental & emotional toll this has taken on AL. This is indeed an unprecedented year for not only our state, but the entire country & world. #TogetherAL", "2020-06-30T14:44:49.000Z": "Take a listen to this special message from @BoJackson ! #BoKnows  #TogetherAL  #alpolitics", "2020-06-30T14:10:40.000Z": "I'm hosting a press conference with Dr. Scott Harris & local officials today at 10 a.m. to provide an update on our state's #COVID19 efforts. You can watch it live at http:// facebook.com/KayIveyAL/ or your local news stations. #alpolitics  #TogetherAL  @ALPublicHealth", "2020-06-29T22:49:47.000Z": "Be sure to check out Commerce Sec. @gregcanfield 's interview with @fDiIntelligence where he underlines our pride in our #MadeinAL workforce & products! #alpolitics  @MadeinAL Read: 'Made in Alabama' is not just a slogan Commerce secretary Greg Canfield outlines how state has adjusted during pandemic fdiintelligence.com", "2020-06-29T18:47:42.000Z": "ADOL announced today the state will begin offering Extended Benefits for those who qualify and have exhausted previous benefits. This is separate from the PEUC program enacted under the CARES Act. https:// labor.alabama.gov/news_feed/News_Page.aspx   @GovernorKayIvey  @ADOLSecretary", "2020-06-29T15:28:55.000Z": "Today, I'm awarding $30 million of #CARESAct money to establish #COVID19 testing & safety development programs. The two programs will be implemented by a coalition led by @ALPublicHealth & @UABNews . #alpolitics  #TogetherAL Learn more: https:// governor.alabama.gov/newsroom/2020/06/governor-ivey-awards-30-million-of-cares-act-money-for-covid-19-testing-safety-development-programs/ ", "2020-06-25T21:00:33.000Z": "I'm proud to establish a Broadband Working Group to gather input & provide guidance on allocation of CARES Act monies to address serious gaps in broadband coverage across our state. Learn more: https:// governor.alabama.gov/newsroom/2020/06/governor-ivey-announces-broadband-working-group-for-cares-act-funding/   @ADECA  #apolitics Governor Ivey Announces Broadband Working Group for CARES Act Funding - Office of the Governor of... MONTGOMERY - Governor Kay Ivey on Thursday announced a Broadband Working Group to gather input and guidance on allocation of CARES Act monies. The group will be facilitated by the Alabama Department... governor.alabama.gov", "2020-06-25T19:42:55.000Z": "I enjoyed meeting with the @huntsvillealcoc virtually this afternoon. The Huntsville/Madison County Chamber sets a great example for chambers across our state, and I'm sincerely thankful for all that they do each day to make Alabama better. #alpolitics  #TogetherAL", "2020-06-24T22:18:56.000Z": "I had a good conversation with spiritual leaders in the community today ranging from racial reconciliation to getting our citizens to complete the #2020Census . I appreciate their support, leadership & prayers as we all work to make Alabama a better place to live. #TogetherAL", "2020-06-24T16:21:59.000Z": "The @USDA has declared Baldwin, Mobile & surrounding SW counties as disaster areas due to recent drought. Those affected in the farming community can apply for assistance through the @usdafsa : https:// offices.sc.egov.usda.gov/locator/app?st ate=al&agency=fsa  . @AlaAgriculture  @AlfaFarmers USDA declares southwest Alabama counties a disaster area due to drought United States Secretary of Agriculture Sonny Perdue has designated Mobile and Baldwin Counties as primary natural disaster areas due to yellowhammernews.com", "2020-06-24T15:04:27.000Z": "The last few months have created a challenging learning environment for our youth. It's important that we offer students engaging activities throughout the summer months to prevent a #summerslide . @AlabamaAchieves has a list of resources here: https:// alsde.edu/sec/comm/pages /summer-learning.aspx  . #aledchat", "2020-06-23T19:04:49.000Z": "Here are some mistakes that claimants make when filing their claims that can stop payments:", "2020-06-23T19:03:53.000Z": "Here are some common issues that claimants see on their tracker and what they mean.", "2020-06-23T19:16:11.000Z": "Our unified workforce leadership have placed Alabama in position to recover economically & to pursue a talent development strategic plan that provides ladders of opportunity to all Alabamians. Thank you all! #alpolitics", "2020-06-23T19:15:41.000Z": "On June 4, our WIOA State Plan was approved by the @USDOL & includes AL's career & technical education programs for the first time. #alpolitics", "2020-06-23T19:15:14.000Z": "The 2020 Combined Workforce Innovation & Opportunity Act State Plan, or WIOA, is providing the foundation for the delivery of career & training services that'll help folks overcome benefit cliffs & enter the workforce. #alpolitics", "2020-06-23T19:14:45.000Z": "Recap from today's workforce leadership meeting:\n\nWith the help of the AWC, AWIB & GOEWT, we're finding innovative ways to cont. our previous workforce momentum to reach AL's goal of adding 500,000 high-skilled workers to the workforce by 2025, despite #COVID19 . #alpolitics", "2020-06-23T15:09:31.000Z": "#Summer is here and we want you to enjoy it---safely! Continue practicing #SocialDistancing and limit your interactions with other people. Learn more about how to do your part to limit the spread of #COVID19 : http:// go.usa.gov/xw3eT .", "2020-06-23T14:20:35.000Z": "Pollinator species, such as birds & insects, are essential partners of farmers & ranchers in producing much of our food supply. I join the @EPA & other agencies across our nation in celebrating #PollinatorWeek ! https:// epa.gov/newsreleases/e pa-administrator-signs-proclamation-marking-national-pollinator-week ", "2020-06-23T01:22:55.000Z": "Excited our Pathways for AL Computer Science Initiative kicked off today with our first teacher training! TY @usedgov & our state partners for your support. #StrongStartStrongFinish  #CS4AL  @AlabamaAchieves  @AMSTI4all  @AplusCR  @UofAlabama  @TuskegeeUniv UA to help bring computer sciences to Alabama high schools TUSCALOOSA, Ala. - A collaborative project between The University of Alabama and several statewide partners was awarded a nearly $4 yellowhammernews.com", "2020-06-22T15:26:19.000Z": "This morning, I met with several of AL's mayors & police chiefs. I've been proud to work with many of these leaders & others to find ways to ease the burdens our communities are facing, in the wake of the #COVID19 pandemic, so we can safely put our state back to work. #TogetherAL", "2020-06-22T13:58:33.000Z": "I am shocked and appalled to hear of yesterday's vile act against @BubbaWallace in Talladega - there is no place for this disgusting display of hatred in our state. Full statement: https:// governor.alabama.gov/newsroom/2020/06/governor-ivey-issues-statement-regarding-incident-in-talladega/ ", "2020-06-21T14:01:32.000Z": "Wishing all fathers & father figures, a special #FathersDay ! Thank you for all that you do every day. Happy Father's Day, Dad!", "2020-06-20T14:28:27.000Z": "Today officially marks the start of summer! I know we're all excited to enjoy the summer weather, but remember to stay safe as you visit our amazing parks, beaches & other tourist attractions. Learn more here: https:// alabama.travel/my-trip/stayin g-safe  . #TogetherAL  @TweetHomeAla", "2020-06-18T16:51:14.000Z": "Governor's Survey of Employer Competencies is live using the link below!\n\nALL business owners are highly encouraged to take less than 15 minutes to help identify in-demand jobs and skills! https:// universityofalabama.az1.qualtrics.com/jfe/form/SV_42 EUK1Eg7Zliak5   @GovernorKayIvey Quote Tweet Alabama NewsCenter @alnewscenter Survey seeks to identify Alabama in-demand jobs and skills https:// alabamanewscenter.com/2020/06/16/sur vey-seeks-to-identify-alabama-in-demand-jobs-and-skills/ ", "2020-06-18T17:08:52.000Z": "During National Fresh Fruit and Vegetable Month, visit http:// SweetGrownAlabama.org to find high-quality fruits & veggies grown right here in Alabama by farmers you can trust. @Sweet_Grown_AL  @AlfaFarmers  #SupportLocalFarmers", "2020-06-18T15:57:42.000Z": "CALLING ALL STUDENT ARTISTS: @FLOTUS is seeking youth art to be included in her \"Building the Movement: America's Youth Celebrate 100 Years of Women's Suffrage\" exhibit. Applications are open to 3-12 grade students until July 6. Learn more: Building the Movement: America's Youth Celebrate 100 Years of Women's Suffrage | The White House First Lady Melania Trump is excited to announce Building the Movement: America's Youth Celebrate 100 Years of Women's Suffrage, an exhibit honoring the cen whitehouse.gov", "2020-06-18T15:07:29.000Z": "Great news for the Port of Mobile-the Mobile Harbor Modernization Project agreement has been signed by the @USACEMobile & the Alabama Port Authority! This is yet another giant step forward in supporting our industries in the Americas & beyond. #alpolitics Mobile District Signs Partnership Agreement with Alabama State Port Au The U.S. Army Corps of Engineers, Mobile District is pleased to announce it has entered into a Project Partnership Agreement with the Alabama State Port Authority, to deepen and widen the Mobile sam.usace.army.mil", "2020-06-17T23:19:23.000Z": "#OpportunityNow  #alpolitics  @cityofbhamal Quote Tweet Ben Carson @SecretaryCarson In Alabama, @GovernorKayIvey worked with the state legislature to push through legislation which led to the transformation of the American life building in Birmingham from a decades long vacant building into 140 units of workforce housing. #OpportunityNow  http:// OpportunityZones.gov Show this thread", "2020-06-17T19:51:23.000Z": "Even during these unprecedented times, I'm proud that the Trump Admin continues to prioritize strengthening our country's infrastructure & working to ensure that we're prepared to be resilient in the face of natural disasters. Thank you, @POTUS & @SecretaryRoss ! #alpolitics Quote Tweet Sec. Wilbur Ross @SecretaryRoss The Trump Administration is committed to improving the country's economic resilience in the wake of natural disasters. The new stormwater drainage system in Muscle Shoals, #Alabama will provide the critical infrastructure needed to protect the local biz community from flooding. twitter.com/US_EDA/status/", "2020-06-17T16:28:18.000Z": "Folks, #COVID19 is still a threat. I cannot emphasize enough that we must all practice social responsibility. Alabamians are encouraged to abide by the #SaferAtHome order, which remains in effect until July 3. #TogetherAL  https:// governor.alabama.gov/assets/2020/05 /Safer-at-Home-Order-FINAL-5.21.2020.pdf ", "2020-06-14T14:31:13.000Z": "Happy 245th Birthday to the @USArmy ! Thank you to all our soldiers, domestic and abroad, for protecting and serving our country. #Hooah", "2020-06-14T14:00:36.000Z": "Happy Birthday, Mr. President! @POTUS  @realDonaldTrump", "2020-06-14T13:34:23.000Z": "Happy Flag Day! Here's a special memory from my visit to @VaughnRoadMPS last year: https:// youtu.be/oFe-7AXbnUI . @libertylearning  #FlagDay Gov. Ivey Encourages Students to Be Good Citizens On January 23, 2019, Gov. Ivey visited Vaughn Road Elementary School in Montgomery. She was selected as one of the second graders' community heroes. Gov. Ive... youtube.com", "2020-06-12T19:36:34.000Z": ". @ALMentalHealth highlights include offering telehealth services to students enrolled in the School-based Mental Health Collaboration, providing crisis center support, & training therapists on best practices for youth & family therapy during the pandemic. @FLOTUS  #BeBest", "2020-06-12T19:36:00.000Z": "DHR has also taken action to assist our youth in foster care by:\n\nProviding WI-FI to foster homes in #RuralAL for online schooling\n\nDistributing food bags to families without transportation\n\nAssisting former foster youth with accessing unemployment benefits #BeBest  @FLOTUS", "2020-06-12T19:35:08.000Z": "I'd like to recognize Chickasaw City Schools for recently hosting a learning session on virtual counseling & academic advising for 100+ AL educators. Thank you for providing great mental health resources during the #COVID19 pandemic! #BeBest  #TogetherAL  @FLOTUS  @AlabamaAchieves", "2020-06-12T19:34:39.000Z": "I'm proud of our Alabama agencies & schools that are actively supporting @FLOTUS ' #BeBest initiative. During these unprecedented times, it's important for us to assist families with techniques that teach children how to recognize, understand, & manage their emotions. #TogetherAL", "2020-06-12T17:27:46.000Z": ". @Outdoor_Alabama is hosting a FREE Fishing Day for our state tomorrow. Enjoy the outdoors with your friends & family, but don't forget about our #SaferAtHome order. Looking for a good spot to cast a line, learn more at https:// outdooralabama.com/articles/free- fishing-day-june-13  .", "2020-06-11T16:00:30.000Z": "1 in 4 Alabama children live in families with food hardships. Break for a Plate is fighting child hunger in Alabama by offering two FREE healthy meals every weekday this summer. Find a location near you at http:// breakforaplate.com/participate . #BreakforaPlate  #SummerMeals  #NoKidHungry", "2020-06-11T14:56:53.000Z": "Your responses to the #2020Census are safe, secure, & protected by federal law. Your answers are critical to Alabama obtaining $13 billion in funding for our state's future. Visit http:// my2020census.gov , call 1-844-330-2020 or fill out the paper form today! @AlabamaCounts", "2020-06-10T20:10:23.000Z": "Please assist our efforts to fill coverage gaps in broadband service across Alabama by taking a moment to complete @ADECA 's speed survey. #RuralAL  #alpolitics Quote Tweet ADECA @ADECA State seeks feedback from Alabamians on broadband internet service https:// adecablog.tumblr.com/post/620551148 652331008/state-seeks-feedback-from-alabamians-on-broadband#.XuEAU4WOvGo.twitter  Show this thread", "2020-06-10T14:40:19.000Z": "The Alabama Department of Revenue has extended the time for obtaining March, April, May and June 2020 motor vehicle registrations to July 17, 2020. To view ADOR's full press release, visit: https:// revenue.alabama.gov/wp-content/upl oads/2020/06/200609_ORDER_VehRegExttoJuly172020_signed.pdf   #ALEA", "2020-06-10T14:24:35.000Z": "If you have recently experienced a job loss, you may have also lost your employer-sponsored health insurance.\n\nThis guide will help you navigate your options if you're unsure about where to start looking for new coverage.\n\nSee more: https:// aldoi.gov/currentnewsite m.aspx?ID=1099 ", "2020-06-10T14:13:54.000Z": "Alabamians, I encourage you to submit your input on how AL should disburse our portion of the $1.8 billion #CARESAct allotment: https:// contact.governor.alabama.gov/contact_cares_ act.aspx  . My office will take every recommendation into consideration to ensure this funding is spent as intended. #TogetherAL", "2020-06-10T13:35:40.000Z": ". @al_labor is continuing to serve customers M-F from 8-5 at the Dunn-Oliver Acadome on the Alabama State University Campus in Montgomery, 915 S. Jackson Street. Please wear a face covering & bring any documents associated with your claim. https:// labor.alabama.gov . #TogetherAL", "2020-06-09T21:54:54.000Z": "Complete your #2020Census today! @AlabamaCounts Quote Tweet ADECA @ADECA Low census participation could cost Alabama, but it's not too late to be counted. Complete your #2020Census today online at http:// my2020census.gov , toll-free 844-330-2020 or  by returning your paper form. Thanks to @dothannewsdean and @WTVYNews4 for the spotlight on #ALCounts .", "2020-06-08T20:23:38.000Z": "\"The AWC remains committed to the people of Alabama. We will continue to focus our efforts on how we can best ensure businesses, their employees & the recently unemployed have the resources they need during this time of crisis.\"\n\nvia @thisisalabama Despite hurtles, Alabama's workforce has a bright future - This Is Alabama The impact of the COVID-19 pandemic on Alabama's workforce has been significant. Businesses, both large and small, are hurting. Nearly 100,000 people applied for unemployment benefits during the... thisisalabama.org", "2020-06-08T20:54:20.000Z": "Way to go @jelcosafety ! Thank you for stepping up to assist your community and country in supplying #MadeinAL PPE to health care workers in need. #TogetherAL Quote Tweet Made in Alabama @MadeinAL IMPACT: Cullman manufacturer JELCO is adding a new dimension with the production of PPE for health care workers.\n\nIt's another Alabama company making a contribution to the fight against COVID-19. https:// bit.ly/2Uk08gM", "2020-06-08T15:05:16.000Z": "Today, I've ordered flags be flown at half-staff for Moody Police Sgt. Stephen Williams. We're grateful for his 23 years of service in law enforcement. Please join me in praying for his wife & children, his fellow officers & his community. #ThinBlueLine  https:// governor.alabama.gov/newsroom/2020/06/moody-police-sgt-stephen-williams/ ", "2020-06-06T12:39:43.000Z": "Today, I honor the memory of my father and the brave Allied soldiers who fought for freedom. Thank you for your sacrifice. #DDay", "2020-06-05T15:07:21.000Z": "#COVID19 has disrupted lives in many ways & in varying degrees. Today, I'm awarding more than $17 million to provide relief for Alabamians who've faced unemployment & economic difficulties as a result of the pandemic. #TogetherAL  #alpolitics  https:// governor.alabama.gov/newsroom/2020/06/governor-ivey-awards-grants-to-assist-community-agencies-in-covid-19-recovery/ ", "2020-06-04T19:26:47.000Z": "My office has developed a Coronavirus Relief Fund Expenditure Request Form for the public to submit for reimbursement for expenses incurred from the Coronavirus Disease 2019. #alpolitics  #CARESAct Learn more: Governor Ivey Announces Development of Coronavirus Relief Fund Expenditure Request Form - Office of... MONTGOMERY - Governor Kay Ivey on Thursday announced a Coronavirus Relief Fund Expenditure Request Form has been developed for the public to submit for reimbursement for expenses incurred from the... governor.alabama.gov", "2020-06-03T21:18:04.000Z": "We're all in this together. Please keep following guidelines to #WashYourHands and keep your distance so we can stop the spread. Learn more at http:// go.usa.gov/xw3eT . #COVID19", "2020-06-04T14:04:07.000Z": "I'm pleased to award $1.7 million to cities & counties across Alabama for various local road & bridge projects. This funding is made possible through the #RebuildAL Act. https:// governor.alabama.gov/newsroom/2020/06/governor-ivey-announces-1-7-million-for-local-road-and-bridge-projects/   #alpolitics Governor Ivey Announces $1.7 Million for Local Road and Bridge Projects - Office of the Governor of... MONTGOMERY - Governor Kay Ivey and the Alabama Department of Transportation on Thursday announced that $1.7 million in funding is being awarded to cities and counties for various local road and... governor.alabama.gov", "2020-06-03T18:27:48.000Z": "We're getting ready to launch our newsletter soon! Scroll down & subscribe to our quarterly updates here: http:// governor.alabama.gov . #alpolitics", "2020-06-03T16:29:00.000Z": "As we go about our daily routines, please remember to take precautions to #StoptheSpread of #COVID19 & stay informed. http:// altogetheralabama.org/health-orders/  #TogetherAL  #SaferAtHome Health Updates - ALtogether Alabama Stop the Spread. Stay Informed. Wash your hands with soap for 20+ seconds Disinfect all frequently used surfaces, appliances, and door handles Practice social distancing and stay 6 feet apart from... altogetheralabama.org", "2020-06-03T12:05:08.000Z": "I am deeply saddened to hear Sergeant Stephen Williams, of the Moody Police Department, was killed in the line of duty last night. I ask the people of Alabama to join me in prayer for his family, friends and his brothers in arms. #ThinBlueLine Full statement below.", "2020-06-02T16:57:33.000Z": ". @GovernorKayIvey awards grant to renovate Vernon building leading to 100 new jobs. http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=13937 ", "2020-06-02T21:32:16.000Z": "We've redesigned our how-to documents regarding what types of claims are available and how to apply for them.  This info is also available on our reorganized website,to make it easier for you to find information. http:// labor.alabama.gov  @GovernorKayIvey  @ADOLSecretary  @NASWAORG", "2020-06-02T13:58:12.000Z": "Congratulations, Class of 2020!  #TogetherAL Quote Tweet MontgomeryAdvertiser @MGMAdvertiser The Class of 2020 is the generation born in the wake of 9/11, and they are the generation entering adulthood amid another world crisis, COVID-19. https:// montgomeryadvertiser.com/story/news/edu cation/2020/06/02/congratulations-class-2020-central-alabama-seniors-before-graduation/5210646002/?utm_campaign=snd-autopilot ", "2020-06-01T18:00:23.000Z": ". @NOAA is predicting an above-normal hurricane season, which officially begins today. I want to remind all Alabamians that it's critical to make sure you're prepared, especially amid the #COVID19 pandemic. I encourage you to visit https:// ready.gov/hurricanes . #HurricanePrep  #ALwx", "2020-06-01T16:14:24.000Z": "The first Monday in June is designated as Alabama Lineman Appreciation Day. Anytime severe weather strikes we can always count on our linemen to get our electricity up & running as expeditiously as possible, often under dangerous circumstances. Thank you, linemen! #ThankALineman", "2020-06-01T15:55:18.000Z": "While there is no immediate need for us to deploy our @AlabamaNG , I have given authorization to Adjutant General Sheryl Gordon to be on standby, should our local and state law enforcement need additional support. Full statement: https:// governor.alabama.gov/newsroom/2020/06/governor-ivey-issues-statement-on-authorization-of-alabama-national-guard-on-as-needed-basis-2/   #alpolitics Governor Ivey Issues Statement on Authorization of Alabama National Guard on As Needed Basis -... MONTGOMERY - Governor Kay Ivey announced today that she has given authorization to Adjutant General Sheryl Gordon with the Alabama National Guard to activate up to 1000 guardsmen, should the need... governor.alabama.gov", "2020-06-01T14:38:00.000Z": "I'll always support the right of the people of Alabama to peacefully lift your voices in anger & frustration. We will show respect to ourselves & to each other through this process. Full statement: https:// governor.alabama.gov/newsroom/2020/06/governor-ivey-issues-statement-in-response-to-birmingham-protests/ ", "2020-05-28T20:13:07.000Z": "The @AlabamaNG has been so helpful in fighting #COVID -19. Thank you!@POTUS @realDonaldTrump  #alpolitics Quote Tweet Donald J. Trump @realDonaldTrump The men and women of the National Guard have been doing a great job fighting the CoronaVirus. This week, I will extend their Title 32 orders through mid-August, so they can continue to help States succeed in their response and recovery efforts.", "2020-05-28T16:02:38.000Z": "Thank you to @iHeartMedia for partnering with Alabama to amplify our #COVID19 resources. We encourage all Alabamians to visit http:// altogetheralabama.org . @CDCgov  #TogetherAL  #SaferAtHome  #StoptheSPRD Don't stop doing what you love, just #StoptheSpread .", "2020-05-27T18:16:37.000Z": ". @GovernorKayIvey has awarded grants totaling $46,960 to help state law enforcement agencies and the University of Alabama Police Department equip officers with new bulletproof vests. http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=13928 ", "2020-05-26T21:23:11.000Z": "Today @GovernorKayIvey & @BodyByJake named the 3 winning schools of a $100K DON'T QUIT! Fitness Center.  Congrats to @SaralandMiddle , @BhamCitySchools (L.M. Smith MS) & @crenshawschools (Highland Home School). https:// natgovfit.org/2020/05/26/ala bama-announcement-of-winning-schools/ ", "2020-05-26T19:13:12.000Z": "As some of the largest employers in AL, I'm pleased with the new safety measures our state's auto manufacturers are taking to mitigate the spread of #COVID19 . We all have a responsibility to adhere to the #SaferAtHome order & these automakers are great examples to follow. Quote Tweet Made in Alabama @MadeinAL HORSEPOWER: How Alabama's automakers are adopting new safety measures against COVID-19 as production ramps up https:// bit.ly/2XyuCMO", "2020-05-26T18:19:19.000Z": "Broadband has always been a priority of my admin, but the #COVID19 pandemic compounded just how necessary these services are to residents in rural & underserved areas of AL. Today, I'm awarding nearly $5.1M to support 15 broadband projects in AL. http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=13925   @ADECA", "2020-05-26T15:17:54.000Z": "We are proud of Jeffrey Neill, a graduate of @CalhounCollege , for representing Alabama & the auto manufacturing industry as part of the @WhiteHouse celebration honoring the Class of 2020! Congrats to all graduates! https:// enewscourier.com/news/local_new s/calhoun-graduate-attends-white-house-graduation-ceremony/article_aed940fe-9eda-11ea-8c05-b719c13a63b2.html   @Toyota  @ACCS_Education Quote Tweet The White House @WhiteHouse Congratulations, Class of 2020!", "2020-05-25T13:34:50.000Z": "On this #MemorialDay , let us pause to remember our nation's fallen warriors. The flags will be flown at half-staff until noon today in honor of their sacrifice and service. https:// governor.alabama.gov/newsroom/2020/05/memorial-day-2020-flag-memo/ ", "2020-05-23T20:20:56.000Z": "Made in Alabama products scored big growth in exports to China Q1 2020 vs Q1 2019. @MadeinAL  @GovernorKayIvey Quote Tweet Made in Alabama @MadeinAL DYK that Alabama's auto exports to China rose 170% in the first three months of the year? Commerce Sec. @gregcanfield speaks to Bloomberg ( @business ) about the rise: https:// bloomberg.com/news/features/ 2020-05-22/as-virus-raged-china-snapped-up-luxury-cars-made-in-america ", "2020-05-23T14:05:11.000Z": "As a mark of solemn respect, we join our fellow Americans in remembering every life lost to #COVID19 by lowering our flags to half-staff, in accordance with the proclamation issued by @POTUS . https:// governor.alabama.gov/newsroom/2020/05/flag-memo-for-victims-of-the-novel-coronavirus-pandemic/   #TogetherAL", "2020-05-22T20:41:35.000Z": "As we go into this Memorial Day weekend, please practice social responsibility. Maintain social distancing & take necessary precautions to protect yourself & others, especially if you're visiting our beautiful beaches. Stay safe, Alabama! #TogetherAL", "2020-05-22T20:04:38.000Z": "In addition to complying with the new health order, child day care facilities are strongly encouraged to implement these guidelines: http:// go.usa.gov/xvhuy . #SaferAtHome  #TogetherAL  @ALPublicHealth", "2020-05-22T20:04:01.000Z": "View the recommended guidelines for entertainment venues & tourist attractions that accompany the #SaferAtHome order: http:// go.usa.gov/xvhzf . #TogetherAL  @ALPublicHealth", "2020-05-22T20:03:13.000Z": "In addition to the #SaferAtHome mandates, the following practices are strongly recommended for all camps serving children & teens: http:// go.usa.gov/xvhuQ . #TogetherAL  @ALPublicHealth", "2020-05-22T20:02:00.000Z": "In partnership with @ALPublicHealth , we've issued further guidance on how to apply the amended #SaferAtHome order to adult & youth athletic activities: http:// go.usa.gov/xvhu6 . #TogetherAL  @ALPublicHealth", "2020-05-22T15:30:22.000Z": "Our expanded #SaferAtHome order takes effect today at 5:00 p.m. Review the updates below & read the full order here: https:// governor.alabama.gov/newsroom/2020/05/governor-ivey-issues-amended-safer-at-home-order-2/  . #TogetherAL  #alpolitics", "2020-05-21T20:20:26.000Z": "Here's the latest updates to the amended #SaferAtHome Order. #TogetherAL  #alpolitics  @ALPublicHealth", "2020-05-21T19:53:36.000Z": "Congrats to 3 Alabama students for being selected by @usedgov as 2020 U.S. Presidential Scholars! We're proud to celebrate the achievements of these remarkable young people.\n\nKittson Hamill, Huntsville HS \nIsaac Walter Stubbs, Wetumpka HS \nLawrence Zhang, James Clemens HS Quote Tweet U.S. Department of Education @usedgov Congratulations to the 56th class of U.S. Presidential Scholars: 161 remarkable high school seniors from all 50 states, DC, PR, and Americans Abroad honored for accomplishments in academics, the arts and career and technical education. https:// ed.gov/news/press-rel eases/us-secretary-education-betsy-devos-names-161-students-2020-us-presidential-scholars ", "2020-05-21T19:08:25.000Z": "Effective Friday, May 22 at 5 p.m. & running until July 3, we're going to expand our #SaferAtHome order to allow more businesses to open while still maintaining social distancing & taking precautions. https:// governor.alabama.gov/newsroom/2020/05/governor-ivey-issues-amended-safer-at-home-order-2/   #TogetherAL", "2020-05-21T19:06:56.000Z": "It is now time that we move forward & further open our state & live with the new normal of incorporating #COVID19 precautions into our routine. #TogetherAL", "2020-05-21T19:06:02.000Z": "The drastic measures of the last 2 ½ months have been out of a need to slow the spread & help prevent a surge of our hospital ICU beds. Statewide we've not exceeded capacity & everyone who needed a ventilator has been able to receive one. #TogetherAL", "2020-05-21T19:04:57.000Z": "This week @ALPublicHealth inked a deal with @Apple & @Google , to use their contact tracing app to track those who may have been exposed to #COVID19 using Bluetooth signals. We're proud AL has the opportunity to be 1 of the first 3 states to utilize this resource. #TogetherAL", "2020-05-21T19:02:04.000Z": "In the next week, my administration will be announcing some different ways where all the members of the Legislature - as well as the people of Alabama - will have direct input into some of the different options that might be available. #TogetherAL", "2020-05-21T19:00:55.000Z": "I'm grateful the AL Legislature was able to get the budgets approved Monday & agree on a pathway forward to make certain CARES Act moneys will get to Alabamians who've been economically hurt by #COIVD19 &, obviously, who need & deserve the help. #TogetherAL", "2020-05-21T18:11:44.000Z": "Today at 2 p.m., I'll be hosting a press conference with Dr. Scott Harris to give an update on our state's #COVID19 efforts. You can watch it live at http:// facebook.com/KayIveyAL/ or your local news stations. @ALPublicHealth  #alpolitics  #TogetherAL", "2020-05-20T18:53:24.000Z": "ALL children in Alabama 18 and younger can receive two FREE healthy meals each day until school reopens through #BreakForAPlate . Find a site near you by texting 'FOOD' to 877-877 or visiting http:// breakforaplate.com . #SchoolClosureMeals  #endchildhunger  #kidseatfree  #ALSDE", "2020-05-20T16:01:42.000Z": "Alabamians, I urge you to continue to abide by the #SaferAtHome order to protect yourself & those you interact with. You're encouraged to wear masks around people from other households, disinfect commonly used items/areas & maintain social distancing. #TogetherAL  @ALPublicHealth", "2020-05-20T15:01:28.000Z": "AL will receive an additional $3M in CARES Act funding to provide economic relief to our state's seafood industry due to the pandemic & $8.6M from @NOAA for fishery disaster funding as a result of flooding in the Gulf of Mexico in 2019. https:// bit.ly/2zgsFwj  @Outdoor_Alabama Governor Ivey Announces Economic Relief Available to Alabama's Seafood Industry in Coming Months -... MONTGOMERY - Governor Kay Ivey announced today that Alabama will receive $3,299,821 in Coronavirus Aid, Relief, and Economic Security Act (CARES Act) funding to provide economic relief to qualifying... governor.alabama.gov", "2020-05-20T13:57:21.000Z": "Good luck to our high school girls competing in the @GGCyberStart National Championship taking place today & tomorrow. We have 33 girls from 10 high schools representing our state this year. Alabama is rooting for you! @AlabamaAchieves  #CS4AL", "2020-05-19T19:03:00.000Z": "In partnership with @AL_DECE , we're proud to announce our nationally-recognized, high quality Alabama First Class Pre-K program will add 55 new classrooms to 25 counties this fall! https:// governor.alabama.gov/newsroom/2020/05/governor-ivey-announces-alabama-first-class-pre-k-program-adding-55-new-classrooms-in-25-counties/   #StrongStartStrongFinish  #aledchat Governor Ivey Announces Alabama First Class Pre-K Program Adding 55 New Classrooms in 25 Counties -... MONTGOMERY - Governor Kay Ivey and the Alabama Department of Early Childhood Education are proud to announce that the nationally-recognized, high quality Alabama First Class Pre-K program will add 55... governor.alabama.gov", "2020-05-19T17:25:51.000Z": "Big News! @AirbusInTheUS has just kicked off production in their newly-built A220 Final Assembly Line hangar & have started production of the first U.S.-built A220 for @JetBlue . We're proud of these significant achievements! @MadeinAL  #alpolitics   http:// bit.ly/3dZX3tD", "2020-05-18T20:36:18.000Z": "I've signed the GF, the ETF & the PSCA bond bills - I appreciate the hard work by the Legislature during these unprecedented times. We've yet to know full impact of #COVID19 , but these budgets ensure continuity of government, while being fiscally responsible. #alpolitics", "2020-05-18T19:56:56.000Z": "This friendly amendment ensures the CARES Act money will be immediately available to Alabamians & put to use under the intent of the U.S. Congress & @POTUS . I assure the people of AL that we'll be with them at every step moving forward. Full statement: Governor Ivey Issues Statement on Legislature's Support of Executive Amendment to SB161 - Office of... \"I commend the Alabama Legislature for their cooperation by supporting my Executive Amendment to SB161. This friendly amendment ensures the CARES Act money will be immediately available to the people... governor.alabama.gov", "2020-05-18T19:53:18.000Z": "I commend the members of the Alabama House for concurring with my amendment to SB161. I'm grateful for their cooperation in working with my office to help our citizens & businesses affected by the #COVID19 crisis. @AlHouseInfo  @ALHouseGOP  @ALHouseDems  #alpolitics", "2020-05-18T18:47:46.000Z": "Thank you to the Alabama Senate for supporting my amendment to SB161. I appreciate our senators for voting to move this process forward; we can quickly get this much-needed CARES Act funding into the hands of the good people of Alabama. #alpolitics  @ALSenateRepubs  @ALSenateDems", "2020-05-18T15:50:57.000Z": "@GovernorKayIvey awards $2.27 million for research projects. http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=13895 ", "2020-05-18T15:05:06.000Z": "ICYMI: I sat down w/ @CBS_42 's Capitol Reporter @ReshadHudson to discuss how I worked w/ the Legislature to get the CARES Act funds quickly & directly into the hands of those impacted by #COVID19 . Be sure to check out his story. #alpolitics 1-on-1 with Gov. Ivey on state's fight against COVID-19 MONTGOMERY, Ala. (WIAT) - In her first sit down interview since the pandemic, CBS 42 spoke with Gov. Kay Ivey about a wide-range of COVID-19 topics. Since the coronavirus pandemic, more than  cbs42.com", "2020-05-16T13:10:42.000Z": "Thank you to all members of the U.S. Armed Forces!  https:// governor.alabama.gov/newsroom/2020/05/national-military-appreciation-month/   #ArmedForcesDay  #MilitaryAppreciationMonth  @AlabamaNG  @ALSDVA", "2020-05-15T23:23:24.000Z": "I'm honored @VP Pence re-nominated me for the National Space Council Users' Advisory Group. I look forward to serving a second term & to working with these distinguished professionals to advance our nation's space exploration objectives. http:// spaceref.com/news/viewpr.ht ml?pid=55710   @NASA  #alpolitics", "2020-05-15T21:29:33.000Z": "Going into this weekend, I want to remind Alabamians to stay smart and vigilant as we continue practicing social distancing guidelines to combat this #COVID19 virus. #SaferAtHome  #TogetherAL  #alpolitics", "2020-05-15T20:37:37.000Z": "Be sure to watch my interview with @DonDaileyAPT tonight on @CapitolJournal at 7:30! Quote Tweet Capitol Journal @CapitolJournal Tonight at 7:30 & Sun. at noon on @CapitolJournal , Gov. Ivey discusses her proposal for spending $1.8 billion in federal stimulus funding. AL Health Officer Scott Harris talks a spike in virus cases, & Rep. Bill Poole covers passage of a record $7.2 billion school-spending plan.", "2020-05-15T16:34:01.000Z": "\"Education is economic development,\" says @MadeinAL Secretary of Commerce Greg Canfield.\n\nOur children are our future. High quality early childhood education is the foundation of our state's growth and success. #PreK4AL  #StrongStartStrongFinish Quote Tweet StartingatZeroFilm @StartingatZero_ Did you know that high-quality #ece is a key driver of our country's economic growth and success? #Governors and #earlyed leaders explore why in #StartingAtZeroFilm .", "2020-05-15T17:56:18.000Z": "In need of help or want to lend a hand? Visit our state's #COVID19 resource hub: http:// altogetheralabama.org . #TogetherAL", "2020-05-15T16:30:46.000Z": "Congratulations to the Class of 2020! Although graduation looks different this year, we are proud to celebrate each and every one of our graduates.  #TogetherAL  @AlabamaAchieves  @ALHigherED  @ACCS_Education Gov. Ivey Congratulates the Class of 2020 Governor Kay Ivey shares a special congratulatory message with the Class of 2020! (Governor's Office, Lori Davis Jhons) youtube.com", "2020-05-15T13:57:14.000Z": "Absolutely! And they will - I appreciate you for your support and suggestion! Nursing homes are on the frontline battlefield of COVID-19 and small business cannot be forgotten. Thank you, Will. Quote Tweet Will Ainsworth @willainsworthAL I would like to commend the Governor for her thoughtful list. However, I would like to see Nursing Homes and Small Businesses prioritized and given appropriate funds as well.Nursing homes are treating our most vulnerable and will need significant resources and help going forward.", "2020-05-15T13:30:00.000Z": "I've directed flags be flown at half-staff today in honor of Peace Officers Memorial Day. We are proud to show our support for the brave men & women who protect our communities, state & nation each day. https:// bit.ly/2AzGmXP  #NationalPoliceWeek  #BackTheBlue  @ALEAprotects", "2020-05-14T20:46:22.000Z": "COVID-19 Quicklinks:\nWebsite: http:// go.usa.gov/xvkJD Table: http:// bit.ly/ALCOVID19Table Dashboard: http:// bit.ly/ALCOVID19Dashb oard  Mobile Dashboard: http:// bit.ly/ALCOVID19Mobile Emergency Orders: http:// go.usa.gov/xv3HB Info Hub: http:// covid19.alabama.gov", "2020-05-14T15:00:48.000Z": "There are several #COVID19 testing centers available across the state. Go to https:// dph1.adph.state.al.us/covid-19/ & select \"Test Sites\" to find a location near you. For general COVID-19 questions, call 1-800-270-7268 or email covid19info@adph.state.al.us. #TogetherAL  @ALPublicHealth", "2020-05-13T22:34:50.000Z": "Thank you for your partnership! Quote Tweet ALRuralElectricAssn @ALRuralElectric Thank you @GovernorKayIvey for making sure electric cooperatives have the ability to be responsive to their members by the protections you enacted in the latest Executive Order.  You're always there to help us provide affordable, reliable power to the citizens of rural Alabama.", "2020-05-13T15:03:04.000Z": "Here's a general guideline sheet for safeguarding all businesses. @ALPulicHealth #TogetherAL", "2020-05-13T15:02:39.000Z": "The @ALPublicHealth has released five guideline flyers to help Alabamians adjust to the amended #SaferAtHome order. Please visit http:// alabamapublichealth.gov/covid19/ for additional information. #TogetherAL", "2020-05-13T13:58:17.000Z": "Thank you to the 70,000+ Alabama grocery workers for being our #SupermarketSuperheroes during these challenging times! #TogetherAL  @AlabamaGrocers Gov. Ivey Applauds Grocery Retailers Gov. Kay Ivey applauds Alabama grocery retailers during the COVID-19 crisis. (Governor's Office, Lori Davis Jhons) youtube.com", "2020-05-12T21:15:40.000Z": "As we ease back into more social interactions this week, please remember to take all health precautions. You're encouraged to wear face coverings around people from other households, practice safe hygiene & maintain 6-foot distancing. #TogetherAL  @ALPublicHealth", "2020-05-11T20:00:13.000Z": "Thank you @GovernorKayIvey for proclaiming this week as #NationalPreventionWeek . During this week we will work to raise awareness of youth substance use issues and the importance of substance use prevention. Thank you Gov. Ivey for making our communities a better place to live.", "2020-05-11T17:38:32.000Z": "ALNG parachute riggers from 20th Special Forces Group have shifted from producing life-saving parachutes to life-saving surgical masks. The riggers have used their training time, materials and skills to produce more than 2,000 masks thus far for #COVID19 responders. #TogetherAL", "2020-05-11T15:24:49.000Z": "Learn what this means for you and your family: https:// governor.alabama.gov/newsroom/2020/05/governor-ivey-issues-amended-safer-at-home-order/  . #TogetherAL  @ALPublicHealth", "2020-05-10T15:00:27.000Z": "All Alabamians are encouraged to show support for our #HospitalHeroes this #NationalHospitalWeek by displaying #RibbonsofHope at your home & businesses. @ALhospitals  #TogetherAL Governor Ivey Announces Ribbons of Hope Campaign - Office of the Governor of Alabama MONTGOMERY - Governor Kay Ivey on Tuesday announced her \"Ribbons of Hope\" campaign at a ceremony at the Alabama State Capitol. During the duration of the COVID-19 (Coronavirus) pandemic, Governor... governor.alabama.gov", "2020-05-10T14:59:55.000Z": "In partnership with @ALhospitals , I want to express my sincere gratitude to the thousands of health care workers across our state. We appreciate your sacrifices & devotion to serving your fellow Alabamians. #NationalHospitalWeek  #HospitalHeroes Gov. Ivey Shares National Hospital Week Message Governor Ivey encourages health care professionals during National Hospital Week May 10-. (Governor's Office, Lori Davis Jhons) youtube.com", "2020-05-10T14:02:58.000Z": "Wishing all mothers, a wonderful day! #HappyMothersDay", "2020-05-09T15:11:50.000Z": "ALNG leaders toured a BHM site yesterday which is home to a new tool that can decontaminate 80,000 N95 masks per day, so healthcare workers may reuse them and not run out. The system was installed by an ALNG crew and equipment as part of #TogetherAL efforts against #COVID19 .", "2020-05-09T17:54:51.000Z": "Where would we be without the public sector? Thank you to the extraordinary people that work so hard to keep our state and country going strong, especially now during the #COVID19 crisis. #PSRW  #TogetherAL", "2020-05-09T16:09:21.000Z": "Thank you to our friends at @MercedesBenzUSA , here in AL, for donating thousands of #PPE to @ALPublicHealth & other agencies in need. Way to be a great neighbor!  #TogetherAL  #MadeinAL Quote Tweet Made in Alabama @MadeinAL A special shout-out to Mercedes-Benz's Alabama operation for delivering 100,000 surgical masks and 7,000 N95 masks to the Alabama Department of Health.\n\nThe facility also donated supplies to other organizations involved in the fight against COVID-19.", "2020-05-09T14:21:25.000Z": "Alabama #SmallBiz , #PPPLoans are still available. I urge you to contact your financial institution & visit https:// home.treasury.gov/policy-issues/ cares/assistance-for-small-businesses  for the latest Paycheck Protection Program info. Apply today! #alpolitics  @SBAgov  @USTreasury  @ALBankers  @nfib_al", "2020-05-08T21:14:39.000Z": "Thank you, Katie, for your and @BCAToday efforts on behalf of AL businesses! #alpolitics Quote Tweet Business Council of Alabama @BCAToday \"BCA applauds Governor Ivey for taking this important step to stand up for Alabama jobs. As we all navigate this unprecedented time, today's order adds much-needed clarity and reassurance. Our state's businesses, workers and families will benefit as a result.\" - @KatieBoydBritt Show this thread", "2020-05-08T16:07:37.000Z": "Our folks - & Dr. Harris' team - are continuing to work today - & throughout the coming days - to give additional details & guidance.  Our goal will be to announce the next phase of our reopening, hopefully by the middle of next week. #TogetherAL", "2020-05-08T16:07:20.000Z": "Gyms, athletic facilities and athletic classes may resume - and this is key - but they will be under strict guidance that they practice intense cleaning methods and social distancing. #TogetherAL", "2020-05-08T16:06:44.000Z": "Barber shops, hair and nail salons and other similar-type establishments will be allowed to open up with restrictions, again with guidelines that were developed by the State Board of Cosmetology. #TogetherAL", "2020-05-08T16:06:27.000Z": "Beginning next Monday, restaurants will be allowed to reopen at a 50% occupancy rate with a 6 foot spacing between tables and other guidance that has been agreed upon by the Alabama Restaurant and Hospitality Association. #TogetherAL", "2020-05-08T16:06:04.000Z": "Our new, amended #SaferAtHome Order that has expanded reopenings will still require social distancing & urge everyone to continue taking all health precautions as we return to whatever normal might look like in the near future. #TogetherAL", "2020-05-08T16:05:13.000Z": "400,000+ unemployment claims have been filed w/ @al_labor . These are innocent people whose lives have been turned upside down & it's not their fault. We hear your voices, your frustrations, your fears. Today's order will hopefully begin providing some hope again. #TogetherAL", "2020-05-08T16:02:40.000Z": "Starting on Monday, May 11th  this order is amended with expanded openings that will go into effect during this next phase of Safely Reopening Alabama. Picture of ORDER Graphic with all three. #TogetherAL", "2020-05-08T16:01:37.000Z": "On May 15th, our current Safer at Home Order is set to expire. However, today I am announcing that we are amending and EXPANDING the list of what reopens under the #SaferAtHome Order. https:// governor.alabama.gov/newsroom/2020/05/governor-ivey-issues-amended-safer-at-home-order/   #TogetherAL  @ALPublicHealth 2/9 Governor Ivey Issues Amended Safer at Home Order - Office of the Governor of Alabama MONTGOMERY -Governor Kay Ivey on Friday issued an amended Safer at Home Order to be applied Statewide. The order which includes an expanded list of items to reopen will be effective Monday, May 11,... governor.alabama.gov", "2020-05-08T16:01:13.000Z": "Let me first take a moment to say a special word of thanks to each & every Alabamian. I know this has been tough on you; it hasn't been a joy ride for us either. I so appreciate the personal sacrifices you've made to keep yourself & others healthy. #TogetherAL  @ALPublicHealth", "2020-05-08T15:14:24.000Z": "I'm hosting a press conference today with Dr. Scott Harris to provide an update on our state's #COVID19 efforts. You can watch it live at 11 a.m. at http:// facebook.com/KayIveyAL/ or your local news stations. #alpolitics  #TogetherAL  @ALPublicHealth", "2020-05-08T15:07:43.000Z": "I want to do everything within my authority to protect businesses as AL's economy gets up & running again. I've issued two supplemental State of Emergencies. #alpolitics  #TogetherAL 8th SOE: https:// governor.alabama.gov/newsroom/2020/05/eighth-supplemental-state-of-emergency-coronavirus-covid-19/  9th SOE: Ninth Supplemental State of Emergency: Coronavirus (COVID-19) - Office of the Governor of Alabama Download governor.alabama.gov", "2020-05-08T13:31:36.000Z": "Let's pause to reflect on the selfless work that ordinary Americans accomplished 75 years ago. \n\nRead my op-ed on why we should consider our past & honor \"the Greatest Generation\": https:// montgomeryadvertiser.com/story/opinion/ 2020/05/08/kay-ivey-remembering-my-father-and-greatest-generation/5178930002/  . #VEDay  #alpolitics", "2020-05-07T18:07:45.000Z": "With the leadership of Commerce Sec. @gregcanfield , the Business & Manufacturing Alliance (BAMA) has identified around 50 companies that have the potential to produce PPE to meet emergency demand & beyond. @MadeinAL  #alpolitics  #TogetherAL Learn more: https:// bit.ly/2YH2w49 .", "2020-05-07T15:01:02.000Z": "Anyone needing to file an unemployment claim with @al_labor can visit http:// labor.alabama.gov or call 1-866-234-5382.\n\nCheck the status of a claim here: https:// uiclaimstracker.labor.alabama.gov .\n\nPlease remember to practice patience. #TogetherAL", "2020-05-07T15:00:15.000Z": "The @al_labor has worked nonstop to process 400,000+ unemployment claims throughout this crisis. These unsung heroes are certainly working hard to get benefits to those who need them. To our friends at ADOL, keep your heads up & keep doing your best. Alabama Department of Labor works overtime to process 400K unemployment claims The work has been so overwhelming, Alabama Labor Secretary Fitzgerald Washington had to bring in additional personnel to help with the load. wsfa.com", "2020-05-07T13:30:16.000Z": "Today, Alabama joins the rest of the country in observing the 69th #NationalDayofPrayer . In light of the #COVID19 pandemic, I can think of no better time to pray for our country, our state, & one another. #TogetherAL  Gov. Ivey Delivers National Day of Prayer Message Gov. Kay Ivey delivers a special message to support the 69th National Day of Prayer. (Governor's Office, Lori Davis Jhons) youtube.com", "2020-05-06T21:45:02.000Z": "Congrats to 2 AL students-Lindsey Wood, of Thorsby, & Brooke Bennett, of Montgomery-for being recognized by @NASSP & @KristenBell as Prudential Spirit of Community Awards recipients! They'll each receive $2,500 to donate to #COVID19 relief efforts.  https:// bit.ly/3b5DHBr", "2020-05-06T17:44:48.000Z": "Over the last couple of months, our teachers have had to make many adjustments to how they teach, but they've done so with great skill. To all our teachers, thank you for all that you do for our students, schools & communities! #TeacherAppreciationWeek", "2020-05-06T17:44:00.000Z": "Looks good, @tatereeves ! Blessings to you and Elee. I know the folks in Mississippi will join you in a successful #RibbonsofHope campaign! #StayHealthyMS  #alpolitics  #TogetherAL  @firstladyofms Quote Tweet Tate Reeves @tatereeves . @firstladyofms and I are honored to join our friend @GovernorKayIvey 's #RibbonsofHope campaign as a reminder to pray for our healthcare heroes, first responders, and one another!\n\nWe're all in this fight together. #StayHealthyMS", "2020-05-06T16:33:58.000Z": "Census Update Make sure #AlabamaCounts by completing the #2020Census today! http:// my2020census.gov Quote Tweet AlabamaCounts @AlabamaCounts The @uscensusbureau announced field activities have resumed in Alabama. Learn more: https:// bit.ly/3c9Nesv", "2020-05-06T13:30:10.000Z": "The UK and Alabama have a strong relationship in trade in transportation and aerospace. A free #trade agreement can build on an already strong foundation by creating more trading opportunities. @EDPAlabama  @GovernorKayIvey  @MadeinAL", "2020-05-05T17:56:12.000Z": "Thank you, ma'am. We're proud and honored to be able to give this small show of support to the many, MANY Alabamians who have given so much to help us all get through this. #WeSaluteAlabama and we are #InThisTogether . Quote Tweet Governor Kay Ivey @GovernorKayIvey Thank you to the @AlabamaNG for taking to the skies to thank & encourage Alabamians on the front lines of this #COVID19 battle. This was a wonderful tribute to our state & and a true display of the American spirit. @usairforce  #WeSaluteAlabama  #AirForceSalutes  #TogetherAL", "2020-05-05T17:53:50.000Z": "Thank you to the @AlabamaNG for taking to the skies to thank & encourage Alabamians on the front lines of this #COVID19 battle. This was a wonderful tribute to our state & and a true display of the American spirit. @usairforce  #WeSaluteAlabama  #AirForceSalutes  #TogetherAL", "2020-05-05T15:59:59.000Z": "Support #GivingTuesdayNow by helping those in need of assistance across our state. Whether you want to donate PPE supplies, blood/plasma, or your time volunteering, visit http:// altogetheralabama.org/#provide-help . #TogetherAL  #COVID19 ALtogether Alabama | Get help or lend a hand during the COVID-19 crisis Need help? COVID-19 can affect all Alabamians. ALtogether is a one-stop-shop where you can ask for help or lend a hand during the COVID-19 crisis. altogetheralabama.org", "2020-05-05T15:37:02.000Z": "Way to go, @AL_DECE ! #StrongStartStrongFinish  #BornReadyMovement Quote Tweet Alabama Department of Early Childhood Education @AL_DECE Today, our team is distributing more than 20,000 at-home @BornReadyOrg learning kits to all Alabama First Class Pre-K and First Teacher Home Visiting programs across the state, in all 67 counties! #PreK4AL  #ALPreKContinues  #TogetherAL  #StrongStartStrongFinish  #BornReadyMovement Show this thread", "2020-05-05T14:47:47.000Z": "I look forward to seeing the @AlabamaNG fly over Alabama later today! Take a look at the flight times here: https:// bit.ly/2YAGRL5 . @usairforce  #WeSaluteAlabama  #AirForceSalutes  #TogetherAL", "2020-05-04T18:34:55.000Z": "ADOL Has Disbursed $503 Million in Unemployment Benefits; Payments Represent 84% of Claims Paid https:// labor.alabama.gov/news_feed/News_Page.aspx?id=230   @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem  @NASWAORG", "2020-05-04T17:08:35.000Z": "DYK: 91% of Alabama's farms are family owned and produce almost $6 billion in Ag products each year?\n\nFor those in the farming community needing financial assistance, please visit @SBAgov 's website below. #alpolitics  #StillFarming  @AlfaFarmers Quote Tweet Jovita Carranza, SBA @SBAJovita Today, @SBAgov will begin accepting applications on a limited basis to provide relief to U.S. agricultural businesses. We encourage agricultural businesses with 500 or fewer employees to apply  https:// sba.gov/page/disaster- loan-applications  Show this thread", "2020-05-01T18:26:26.000Z": "Alabama is proud of our innovative companies supporting @NASA 's mission, led by @NASA_Marshall , to put #Artemis astronauts on the Moon by 2024! @Dynetics  @ulalaunch  @blueorigin  #MadeinAL  #alpolitics Quote Tweet Made in Alabama @MadeinAL ICYMI: As NASA selects companies to develop a human landing system for a return trip to the Moon, the Alabama connections are strong. https:// bit.ly/2VNZTf8", "2020-05-01T15:00:58.000Z": "As our state transitions to the #SaferAtHome phase, it's imperative that we all continue to do our part to stop the spread of #COVID19 . Stay safe, Alabama! #TogetherAL  https:// governor.alabama.gov/assets/2020/04 /Safer-At-Home-Order-Signed-4.28.20.pdf ", "2020-04-30T20:49:16.000Z": "Our ALtogether Alabama website now features a new \"How To\" page for businesses & nonprofits seeking financial assistance during the #COVID19 crisis. https:// bit.ly/2SidxoH This guide communicates resources through tutorials in written, video & step-by-step formats. #TogetherAL", "2020-04-30T16:23:35.000Z": "Proud for Alabama to be featured in this award winning documentary film, \"Starting at Zero: Reimagining Education in America!\" Quote Tweet StartingatZeroFilm @StartingatZero_ What if every child had the opportunity to succeed and every #earlyeducator had the resources to make that happen? Starting at Zero explores the importance of an equitable education for every child in the U.S. http:// startingatzerofilm.com", "2020-04-30T18:02:01.000Z": "Do you need to get tested? \n\nFind your nearest #COVID19 testing location here: https:// bit.ly/35imjIG . #TogetherAL  @ALPublicHealth", "2020-04-30T15:06:50.000Z": "The 2019 economic development report is in-new investment topped $7 billion across AL! I'm confident that the robust economic development activity we recorded in 2019 will help spur growth as we move fwd on the road to full recovery. https:// governor.alabama.gov/newsroom/2020/04/gov-ivey-new-investment-across-alabama-topped-7-billion-in-2019/   @MadeinAL  #alpolitics", "2020-04-30T14:04:23.000Z": "Alabama's #SaferAtHome order takes effect TODAY at 5 p.m. We all have a responsibility to stay informed & prevent the spread of #COVID19 . #TogetherAL Learn more: https:// governor.alabama.gov/newsroom/2020/04/governor-ivey-issues-safer-at-home-order/ ", "2020-04-29T21:21:36.000Z": "My fellow Alabamians, the threat of #COVID19 is not over. Make sure you're doing everything you can to stop the spread. Keep yourself & others safe by following these steps. #TogetherAL", "2020-04-29T21:11:11.000Z": "Way to go, Tigers! #ALThanksYou  @AuburnU for rising to the challenge to support Alabamians. For more info on how to help, visit http:// aub.ie/auoutreachmasks . #TogetherAL This Tweet is unavailable.", "null": "", "2020-04-29T13:02:25.000Z": "Perry County Schools, #ALThanksYou for helping provide Wi-Fi access to students every day from 10 a.m.-3 p.m. using parked buses. Helping families continue their children's education during #Covid19 is a great example of #TogetherAL .", "2020-04-29T16:01:48.000Z": "Important reminder of patience during this crisis from Pastor Jay Wolf: \"God has given us wisdom & common sense. So sometimes you have to use patience, delay til the storm is over, & then you go ahead and have that ministry.\" @montgomeryfbc  #TogetherAL How Gov. Ivey's safer at home order impacts churches Under Gov. Kay Ivey's safer at home order, churches still won't be able to congregate. wsfa.com", "2020-04-28T16:15:27.000Z": "Alabamians, let me be abundantly clear, the threat of #COVID19 isn't over. We're still seeing the virus spread & our people are susceptible to the infection. Folks, we must continue to be vigilant in our social distancing both today & for the foreseeable future. #TogetherAL", "2020-04-28T16:14:43.000Z": "Our beaches will be open - providing people abide by social distancing & the gatherings guidelines. I trust the people of AL to practice personal responsibility while enjoying the Gulf. #TogetherAL", "2020-04-28T16:09:31.000Z": "You're urged to wear face coverings around people from other households when you leave your house. Please continue proper hand washing & other good, common-sense hygiene. #TogetherAL", "2020-04-28T16:08:41.000Z": "All individuals-and especially vulnerable persons-are encouraged to exercise personal responsibility in slowing the spread of #COVID19 by minimizing travel outside the home. See the Safer at Home guidelines: #TogetherAL", "2020-04-28T16:07:41.000Z": "On April 30 at 5:00 p.m. the #StayAtHome Order will expire and our Safer at Home Order will go into effect. Learn more: https:// governor.alabama.gov/newsroom/2020/04/governor-ivey-issues-safer-at-home-order/   #TogetherAL 3/7 Governor Ivey Issues Safer at Home Order - Office of the Governor of Alabama MONTGOMERY -Governor Kay Ivey on Tuesday issued a Safer at Home order to be applied Statewide. The order will be effective Thursday, April 30, 2020 at 5:00 p.m. and will expire on Friday, May 15,... governor.alabama.gov", "2020-04-28T16:06:27.000Z": "Today, I'm announcing that we'll, once again, enter a \"Safer at Home\" Order that'll still require social distancing & urge our people to continue taking all health precautions necessary as some folks will return to the workplace. #TogetherAL", "2020-04-28T16:06:01.000Z": "I've sought counsel from many avenues & received many recommendations. The Exec. Committee of my Coronavirus Task Force have been diligently working to help me incorporate all these good ideas. I truly appreciate everyone's hard work & partnership. #TogetherAL", "2020-04-28T15:34:16.000Z": "Tune in to my press conference today at 11 a.m. for an important #COVID19 update. I'll be joined by Dr. Scott Harris & the Executive Committee of my Coronavirus Task Force. Watch it live at http:// facebook.com/KayIveyAL/ or your local news stations. #TogetherAL  @ALPublicHealth", "2020-04-27T20:40:52.000Z": "ADOL is now paying claims for all three programs under the CARES Act. More than $372 million has been disbursed.\nTomorrow, you can access the PUA form and submit income documents through the tracker. https:// labor.alabama.gov/news_feed/News_Page.aspx?id=228   @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem  @NASWAORG", "2020-04-27T14:32:12.000Z": "Attention: Small Business Owners The @SBAgov will resume accepting Paycheck Protection Program applications today. @NFIB_al  #PPPLoans  #alpolitics Learn how to apply here: https:// sba.gov/funding-progra ms/loans/coronavirus-relief-options/paycheck-protection-program  View FAQs here: https:// sba.gov/sites/default/ files/2020-04/Paycheck-Protection-Program-Frequently-Asked-Questions_04%2026%2020.pdf  Paycheck Protection Program An SBA loan that helps businesses keep their workforce employed during the Coronavirus (COVID-19) crisis. sba.gov", "2020-04-27T13:00:36.000Z": "As we reflect on this devastating event, I encourage you to support the Governor's Emergency Relief Fund. GERF provides assistance to Alabamians recovering from severe weather & helps build storm shelters across AL. To learn more, visit https:// servealabama.gov/governor-s-eme rgency-relief-fund  . @ServeAlabama Governor's Emergency Relief Fund | servealabama servealabama.gov", "2020-04-27T12:59:54.000Z": "On this day, nine years ago, 62 tornadoes swept across Alabama killing more than 250 people & destroying over 11,000 homes. Let us remember those we lost & the countless others affected by this horrible tragedy.", "2020-04-24T16:02:37.000Z": "Our guardsmen & women always show up when we need them most. I commend Task Force 31 of the @AlabamaNG for taking on this #COVID19 mission & serving our most vulnerable Alabamians. #TogetherAL  #ALThanksYou Quote Tweet AL National Guard @AlabamaNG \"This is the utmost pinnacle of what we do as the National Guard in service to [our] community.\" \n\nWatch AL Guardsmen in action as they continue the mission to disinfect #COVID19 -affected nursing homes and assisted living facilities throughout the state. #GuardItAL  #TogetherAL", "2020-04-24T15:02:57.000Z": "I'm pleased to announce auto insurers are returning over $100 million in premium to AL policyholders during the ongoing #COVID19 crisis. Thank you auto insurance companies for stepping up during this difficult time. @AlabamaDOI  #alpolitics  #TogetherAL  https:// governor.alabama.gov/newsroom/2020/04/governor-ivey-announces-auto-insurers-return-more-than-100-million-in-premium-to-alabama-policyholders/ ", "2020-04-23T19:12:42.000Z": "Need help or want to help others during this #COVID19 crisis? Visit http:// altogetheralabama.org ! This platform is dedicated to helping Alabamians get access to critical resources for their families, businesses & communities. #TogetherAL", "2020-04-23T15:07:43.000Z": "Sporadic reports of downed trees and damage to homes have occurred in south Alabama. Thunderstorms will redevelop late morning in west Alabama and spread eastward. The potential for straight-line winds and a couple of tornadoes exist. Learn more at https:// ema.alabama.gov/2020/04/23/sig nificant-damage-sunday-with-more-storms-thursday/ ", "2020-04-22T22:11:25.000Z": "Great news to report from the @USDA ! I appreciate @SecretarySonny for approving AL for the Pandemic EBT program. It's critical that our children have access to healthy food during the #COVID19 crisis & this program will certainly help accomplish that. #TogetherAL  #alpolitics Quote Tweet Dept. of Agriculture @USDA Alabama has been approved to operate Pandemic Electronic Benefit Transfer (EBT) to feed children during the #COVID19 National Emergency https:// usda.gov/media/press-re leases/2020/04/22/usda-approves-program-feed-kids-alabama ", "2020-04-22T18:51:32.000Z": "Taking the #2020Census is your civic duty. Can we count on you? #ALCounts  @AlabamaCounts Complete the census by: : http:// my2020census.gov  : 1-844-330-2020 : Mail form The following media includes potentially sensitive content. Change settings View", "2020-04-22T17:35:33.000Z": "Celebrate the 50th anniversary of #EarthDay by visiting our beautiful #AlabamaStateParks ! Hit the trails, ride the bikes & enjoy the sunshine responsibly practicing social distancing. @ALStateParks  @Outdoor_Alabama Learn more at: https:// outdooralabama.com/COVID-19 .", "2020-04-22T16:05:15.000Z": "Child Nutrition Programs are still providing meals to Alabama students. To find a location near you, text FOOD to 877-877 or visit http:// BREAKFORAPLATE.COM .\n. #childnutrition  #alsde  #alabamaachieves  #altogether  #educationmatters  #socialdistancing  #distancelearning  #virtualschool", "2020-04-22T14:00:24.000Z": "I'm proud to announce NIEER ranks Alabama First Class Pre-K as the nation's highest quality state pre-kindergarten program for the 14th consecutive year! https:// governor.alabama.gov/newsroom/2020/04/governor-ivey-announces-alabama-first-class-pre-k-continues-leading-the-nation-in-quality-increases-pre-k-enrollment/   @PreschoolToday  @AL_DECE  @JeanaRoss4kids  #StrongStartStrongFinish  #aledchat Governor Ivey Announces Alabama First Class Pre-K Continues Leading the Nation in Quality, Increa... MONTGOMERY - Governor Kay Ivey on Wednesday announced that the National Institute for Early Education Research (NIEER) ranks Alabama First Class Pre-K as the nation's highest quality state pre-kind... governor.alabama.gov", "2020-04-21T13:02:03.000Z": "Are you a recently retired, part-time health professional, medical student or work in a related profession? Is your office closed due to #COVID19 ? #AlabamaReadyOp is looking for you! Please visit https:// servealabama.gov/alabamareadyop to volunteer. @ALPublicHealth  @GovernorKayIvey Alabama ReadyOp | ServeAlabama This is the State of Alabama's online system for managing public health and medical disaster volunteer responders. This system supports personnel who may be utilized during disasters, all-hazard... servealabama.gov", "2020-04-21T21:01:36.000Z": "This #TakeOutTuesday , let's remember to support our great Alabama restaurants! Visit http:// carryoutal.com to learn more. @arhaonline  #TogetherAL", "2020-04-21T16:06:38.000Z": "My fellow Alabamians, you've truly given new meaning to the words #TogetherAL . It's been a challenging month. We've said goodbye to too many of our loved ones, & our way of life has been turned upside down. Better days are ahead; I'm confident of that. #TogetherAL", "2020-04-21T16:05:59.000Z": "Every good idea deserves to be considered. Together, Dr. Harris & I will be working closely with our Executive Committee to get Alabama's economy back up and running again. #TogetherAL  @ALPublicHealth  #TogetherAL", "2020-04-21T16:05:34.000Z": "Tomorrow, we'll hear from our federal House delegation. We've also had numerous suggestions from legislators, mayors & private citizens alike. #TogetherAL", "2020-04-21T16:05:10.000Z": "My office & I have been in touch with our Congressional delegation because we want to see Congress replenish the funds in the Paycheck Protection Program. This program is absolutely critical right now, especially to our small businesses. #PPPLoans  #alpolitics  #TogetherAL", "2020-04-21T16:04:47.000Z": "The Exec Committee of my Coronavirus Task Force has been hard at work reviewing recommendations to safely reopen AL. I'm as eager as anyone to get our economy spinning on all cylinders again, but we must make sure we're doing it in a smart & productive way. #TogetherAL", "2020-04-21T16:04:28.000Z": "This week is the projected peak of the illness in our state. What the people of Alabama are doing is working, & we need to keep at it! As a reminder, our current #StayAtHome order stays in effect until April 30. #TogetherAL  @ALPublicHealth", "2020-04-21T15:27:51.000Z": "I'm hosting a press conference today with Dr. Scott Harris & several members of my cabinet to provide an update on our state's #COVID19 efforts. You can watch it live at 11 a.m. at http:// facebook.com/KayIveyAL/ or your local news stations. #alpolitics  #TogetherAL  @ALPublicHealth", "2020-04-20T22:18:23.000Z": "I join @POTUS , @senatemajldr , @GOPLeader & small businesses across AL & around the U.S. desperately in need of assistance in urging Democrats to immediately replenish the #PPPLoans . I look fwd to Congress taking action this week. AL small businesses, I stand with you. #alpolitics", "2020-04-20T18:50:30.000Z": ". @AirbusInTheUS & @UofSouthAlabama have teamed up to produce 3D-printed, reusable face masks & mask tension release bands for medical personnel battling #COVID19 . Thank you for supporting your fellow Alabamians in the Mobile area! #TogetherAL  @MadeinAL Airbus and the University of South Alabama Health producing 3D printed facemasks MOBILE, Ala. (WKRG) - Unedited Press Release. Airbus' production and engineering teams in Mobile have teamed up with the University of South Alabama to produce 3D-printed, reusable face masks wkrg.com", "2020-04-20T17:59:18.000Z": "The new @QuestDX & @Walmart drive-thru testing sites are located in the Walmart parking lots at:\n\n 6495 Atlanta Hwy, Montgomery, AL 36117\n\n 2473 Hackworth Rd, Adamsville, AL 35214 \n\nSchedule a #COVID19 appointment at: http:// MyQuestCOVIDTest.com . @ALPublicHealth (2/2)", "2020-04-20T17:58:24.000Z": "Folks living in/near Montgomery & Adamsville, I want to remind you @Walmart & @QuestDX opened 2 new drive-thru #COVID19 testing centers near you. The appointment only drive-thrus are open daily from 9 AM - 4 PM. Learn more: https:// governor.alabama.gov/newsroom/2020/04/governor-ivey-launches-new-covid-19-drive-thru-testing-sites/  . @ALPublicHealth (1/2) Governor Ivey Launches New COVID-19 Drive-Thru Testing Sites - Office of the Governor of Alabama MONTGOMERY - Governor Kay Ivey on Thursday announced the launch of new COVID-19 drive-thru testing sites in Adamsville and Montgomery. The testing sites are supported by Walmart and Quest Diagnostics... governor.alabama.gov", "2020-04-20T17:41:38.000Z": "It's humbling to see this #smallbusiness in the Wiregrass area supporting #RibbonsofHope in such a compassionate way. Thank you @DLHarrelson82 & Wildflowers for spreading hope & reminding Alabamians to pray for those on the front lines. #TogetherAL  #ALThanksYou  @CityofElba Quote Tweet DeLonda Harrelson @DLHarrelson82 Stop by @WildflowersElba for a complimentary #RibbonsofHope bow!! Stay safe #TogetherAlabama", "2020-04-20T17:00:43.000Z": "To the @AlabamaNG Service Members in the Infection Control Teams, #ALThanksYou  #TogetherAL", "2020-04-20T16:30:24.000Z": "Please read the following instructions to check on the status of your debit card.  Note that this company is separate from ADOL. \nRemember, the debit card should mail AFTER your first payment processes - then it takes 5-7 business days to arrive. @GovernorKayIvey  @ADOLSecretary", "2020-04-20T14:04:47.000Z": "Since the events of that tragic day, AL has worked with other Gulf states & federal partners to repair the ecological, environmental & economic damages that were inflicted in the Gulf of Mexico & along our shorelines. That work continues today & will continue for years to come.", "2020-04-20T14:02:43.000Z": "Today we commemorate the passing of 10 years since the Deepwater Horizon oil spill. We remember the 11 men we lost & those injured, their loved ones and the many communities that were severely affected in coastal Alabama. @Outdoor_Alabama  #alpolitics Governor Ivey Marks a Decade of Environmental Progress Since Deepwater Horizon - Office of the... Montgomery - Today Governor Kay Ivey commemorates the passing of 10 years since the Deepwater Horizon oil spill. On April 20, 2010, the Deepwater Horizon oil rig exploded in the Gulf of Mexico,... governor.alabama.gov", "2020-04-19T16:45:05.000Z": "Folks, we are going to continue to see severe weather across our state throughout the day. Be sure to tune in to your weather news source and stay weather aware. We will continue monitoring on the state level for any updates. #alwx  #alpolitics", "2020-04-19T13:03:32.000Z": "The first wave of storms is moving across northern Alabama.  Afterward, supercell storms are expected to form in Mississippi and enter western Alabama after 2 pm.  This will likely be followed by a line of potentially intense storms.  Learn more at https:// ema.alabama.gov/2020/04/19/sev ere-weather-and-flooding-rains-likely-sunday-into-monday-morning/ ", "2020-04-18T19:03:29.000Z": "Great call today w/ Southeastern Governors discussing safely reopening our states! Health & safety remain our priority. Grateful for our frontline workers/citizens who are fighting this #COVID19 battle! #TogetherAL  @tatereeves  @henrymcmaster  @GovKemp  @GovRonDeSantis  @GovBillLee", "2020-04-17T19:53:00.000Z": "Listen up, Alabama - @AlabamaAchieves is conducting a survey to determine how AL will use federal funding to assist our edu system in the midst of this pandemic. Public input is strongly encouraged. Those interested must complete the survey by April 20. #alpolitics  #aledchat Quote Tweet Alabama State Department of Education @AlabamaAchieves We need your input on how CARES Act dollars allocated to Education in Alabama should be distributed. We have developed a survey which is intended to help the state prioritize the use of these federal funds. To complete the survey, please click https:// forms.office.com/Pages/Response Page.aspx?id=xR8fNaFG3EW3EUPMffG2K4RwpTczKoFDu8csFH4tvOlUREhKTUZYWFI5NzBTREVDSFdOWUQzVEZDWC4u ", "2020-04-17T18:41:24.000Z": "| Resource Reminder\n\nBe sure to visit http:// covid19.alabama.gov to get real-time answers to your #COVID19 questions. You can also use the symptom tracker, find testing locations or even apply for available jobs. @Yext  @ALPublicHealth  #TogetherAL  #alpolitics Alabama COVID19 Information Hub Use our resources to learn more about COVID19 in Alabama. covid19.alabama.gov", "2020-04-17T18:19:05.000Z": "ICYMI: Watch my exclusive interview with @JeromeJonesTV below. People must continue to follow the #StayAtHome order & social distancing guidelines until a plan to reopen the economy is finalized. Just be patient, we're going to get there! #TogetherAL  #alpolitics Quote Tweet Alabama News Network @ALNewsNetwork Governor Ivey Discusses Coronavirus Pandemic and Alabama Economy https:// alabamanews.net/2020/04/16/gov ernor-ivey-discusses-coronavirus-pandemic-and-alabama-economy/ ", "2020-04-17T16:58:16.000Z": "As we continue to #StayAtHome , here are a few reminders of things you can safely do during quarantine. #TogetherAL  @ALPublicHealth", "2020-04-17T15:36:14.000Z": "March's rate is a reflection of the #COVID19 crisis. To the recently unemployed, I'm committed to working with leaders from across our state & nation to revive our economy & get you working again. We'll gradually work our way out of this #TogetherAL . Quote Tweet ADOL @al_labor Alabama's March unemployment rate rises to 3.5%. https:// labor.alabama.gov/news_feed/News_Page.aspx?id=224   @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem", "2020-04-16T22:05:40.000Z": "I thank the people of Alabama for taking to heart, truly taking to heart, the #COVID19  #StayAtHome order and responding as well as they have. I assure you, we've got a plan on the way! #TogetherAL  #alpolitics  @BreitbartNews Alabama Governor on Reopening Economy: 'We've Got a Plan on the Way' Alabama Gov. Kay Ivey spoke with Breitbart News on Thursday about the state's economy and the progress being made to reopen it. breitbart.com", "2020-04-16T16:09:02.000Z": "Alabamians that need help filing their unemployment claims can utilize this NEW @al_labor tool!  #alpolitics  #TogetherAL Quote Tweet ADOL @al_labor NEW! Just launched! ADOL has a new CLAIMS TRACKER that will help you get answers to questions about your claim.  You will need to go to the ADOL homepage to access this tool! \nAccess it here: https:// uiclaimstracker.labor.alabama.gov  @GovernorKayIvey  @ADOLSecretary  @NASWAORG  @ALWorksSystem", "2020-04-16T15:14:50.000Z": "I'm pleased to announce new #COVID19 drive-thru testing locations in Adamsville & @CityofMGM . I greatly appreciate the efforts by @Walmart & @QuestDX to provide additional testing sites that are secure & easily accessible to Alabamians. https:// governor.alabama.gov/newsroom/2020/04/governor-ivey-launches-new-covid-19-drive-thru-testing-sites/   #alpolitics", "2020-04-16T12:24:56.000Z": "We are seeing signs it is time to bring the economy back again. Thank you, Secretary Canfield! #COVID19  #alpolitics Quote Tweet Greg Canfield @gregcanfield Sec. of Commerce Greg Canfield on COVID-19 impact on economy https:// cbs42.com/news/local/sec -of-commerce-greg-canfield-on-covid-19-impact-on-economy/   @madeinal  @governorkayivey", "2020-04-15T18:37:57.000Z": "I'm thrilled to announce the @SecAFOfficial has chosen the @AlabamaNG 187th Fighter Wing as the 6th operational location for the F-35s! This is an exceptional honor for AL, & I sincerely thank all those involved with making this project possible. Governor Ivey Announces 187th Fighter Wing Officially Selected as Location for F-35s - Office of... MONTGOMERY - Governor Kay Ivey on Wednesday announced that the Secretary of the Air Force officially selected the 187th Fighter Wing at Dannely Field in Montgomery as the Air National Guard's 6th... governor.alabama.gov", "2020-04-15T16:28:48.000Z": "ATTENTION PUA CLAIMANTS!", "2020-04-15T16:28:10.000Z": "ICYMI: @ALWorksSystem has released the AL COVID-19 Workforce Response Survey. This tool will help us better understand the impact of #COVID19 & develop a clear path forward for AL's workforce. If you own a business, please take the survey by April 21: https:// bit.ly/3cod7Vw .", "2020-04-15T15:53:11.000Z": "I'm grateful for @FirstNet & @ATTPolicyAL 's support of Alabama FirstNet. For nearly 3 years, they've assisted AL, & now they're providing additional assets & technology to help our first responders & health care institutions during the #COVID19 crisis. #TogetherAL  #alpolitics", "2020-04-15T14:27:13.000Z": "The famous quilters of Gee's Bend are using their unique skills for an urgent cause! Read more here about their goal of sewing a face mask for each person in their small #Alabama town: The Famed Quilters of Gee's Bend Are Using Their Sewing Skills to Make a Face Mask for Every... In Gee's Bend, an isolated community of several hundred people in southern Alabama, artists are working to combat the coronavirus pandemic. news.artnet.com", "2020-04-14T22:46:45.000Z": "COVID-19 Unemployment Compensation. @GovernorKayIvey  @ADOLSecretary  @NASWAORG  @ALWorksSystem", "2020-04-14T22:12:57.000Z": "I love this #RibbonsofHope tree! Well done.  #TogetherAL Quote Tweet Kathryn Lanier @TheChemistryKat I have the best neighbors   #RibbonsOfHope  #TogetherAlabama", "2020-04-14T20:12:27.000Z": "I applaud @back40beer , in Gadsden, for modifying their operations to package hand sanitizer. They're willing to ship bulk hand sanitizer to any municipalities or government agencies in need in AL. Send an email to the owner at jason@backfortybeer.com to learn more. #TogetherAL", "2020-04-14T19:02:05.000Z": "The response from the biz community to #COVID19 has been nothing short of remarkable. @Hyundai is a vital part of AL's economy & an invaluable partner to the River Region. I offer my sincerest gratitude to HMMA for their donation & for their ongoing commitment to AL. #TogetherAL Quote Tweet Made in Alabama @MadeinAL IMPACT: Hyundai's Alabama plant is helping support increased COVID-19 screening in the Montgomery area with 10,000 test kits from a South Korean firm. https:// bit.ly/2XzpIRt", "2020-04-14T18:10:34.000Z": "Our Capitol Press Corps members play an integral role in sharing important updates about #COVID19 . I want to point out one of our media veterans, @lyman_brian , for his great coverage today: https:// montgomeryadvertiser.com/story/news/202 0/04/14/gov-kay-ivey-stay-home-order-appears-working-stop-coronavirus/2988103001/  . \n\nI also want to wish you a Happy Birthday, Brian! #alpolitics Gov. Kay Ivey: Stay-at-home order appears to be working to stop coronavirus But at a press conference on Tuesday, Ivey stressed the need to maintain social distancing and montgomeryadvertiser.com", "2020-04-14T17:47:06.000Z": "Great job, Ainsworth family! Thanks for reminding Alabamians of #RibbonsofHope . #TogetherAL Quote Tweet Will Ainsworth @willainsworthAL @GovernorKayIvey the kids put up our #RibbonsofHope today.  Numbers continue to improve everyday and it's because of the great work of the people of Alabama practicing social distancing.  Keep it up Alabama and let's get back to work soon.", "2020-04-14T17:18:04.000Z": "Thank you @ALHigherEd & SGA presidents for partnering with me to encourage Alabamians to donate blood. Show your support by clicking the link below or visit https:// altogetheralabama.org/go-out-and-ser ve/project-two-xyfnk  to find local blood donation sites. #TogetherAL Quote Tweet HigherEd Partnership @ALHigherEd Student presidents from Alabama's universities are collaborating with @GovernorKayIvey to ask you to donate blood. Find out more in the video or by visiting http:// higheredpartners.org/blooddonors", "2020-04-14T16:07:26.000Z": "My fellow Alabamians, we can take both the economic health & well-being of our state seriously just as we can look after the safety & well-being of our people. That's what #TogetherAL is really all about. That is our task at hand, & I'm confident we're capable of doing both. 7/7", "2020-04-14T16:06:11.000Z": "These recommendations will be carefully integrated with advice from Dr. Harris & our team of medical experts. By April 28, Dr. Harris & I will review these suggestions & provide an updated plan of action before the #StayAtHome order expires on April 30. #TogetherAL", "2020-04-14T16:05:24.000Z": "My staff & I are looking at every suggestion in earnest. I intend to ask six members of my Coronavirus Task Force to serve as an Executive Committee to vet these ideas & develop a well-planned timetable for us to open our economy back up. #TogetherAL", "2020-04-14T16:04:54.000Z": "My office has also reached out to each of our congressional members to look at this from a district point of view. They were all eager to help and will be presenting their suggestions by April 22. #TogetherAL", "2020-04-14T16:03:45.000Z": "I've asked @willainsworthAL & the Small Business Commission to begin looking for ways where we can restart the economic engine of our state. They will present a set of recommendations by this Friday. #TogetherAL", "2020-04-14T16:02:55.000Z": "While some of the modeling suggests our efforts are paying dividends, many around the state are beginning to ask what our plans are to begin reopening parts of our economy. #TogetherAL", "2020-04-14T16:02:33.000Z": "While all indicators suggest AL's #StayAtHome order is working, I can't over-emphasize how imperative it is to keep doing what we are doing. Now is not the time to let our guard down. We must all continue to do our part to #StopTheSpread of #COVID19 . #TogetherAL", "2020-04-14T15:29:13.000Z": "This morning at 11, I'll be hosting a #COVID19 press conference with Dr. Scott Harris to give an update on where Alabama stands in our crisis response efforts. You can watch it live at http:// facebook.com/KayIveyAL/ . @ALPublicHealth  #alpolitics  #TogetherAL", "2020-04-14T14:55:13.000Z": "During this #COVID19 public health emergency, I encourage people to visit http:// altogetheralabama.org for reliable information. Businesses & individuals across Alabama can access this information hub to ask for help or lend a hand. Visit ALtogether today! #TogetherAL  #alpolitics", "2020-04-13T21:15:56.000Z": "First responders are helping with last night's storms, so please avoid impacted areas to give them space. If you want to volunteer, join an organization that is working in the area. Learn how by dialing 211, emailing info@211connectsalabama.org, or visit http:// servealabama.gov", "2020-04-13T23:27:43.000Z": "| Important Update\n\nRead @al_labor 's release below. Unemployment claims can be filed through http:// labor.alabama.gov or by calling 1-866-234-5382. Our team at ADOL is working nonstop to assist Alabamians process their claims. Please remember to practice patience. #alpolitics Quote Tweet ADOL @al_labor ADOL is beginning to process the Pandemic Unemployment Assistance (PUA) claims. PLEASE CLICK THE LINK TO READ THE NEWS RELEASE. https:// labor.alabama.gov/news_feed/News_Page.aspx?id=221   @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem  @NASWAORG", "2020-04-13T20:26:25.000Z": "For EMPLOYERS: We have updated our site to include detailed instructions for filing bulk partial claims for your employees.  \nVisit: https:// labor.alabama.gov/uc/partials/uc -partials.aspx   @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem  @NASWAORG", "2020-04-13T19:13:48.000Z": "Over the last week, I've seen so many beautiful #RibbonsofHope line AL neighborhoods. Thank you Alabama for such a great response & for following suit. Let's continue to pray for the health & protection of our front line workers & loved ones. #TogetherAL  https:// governor.alabama.gov/newsroom/2020/04/governor-ivey-announces-ribbons-of-hope-campaign/ ", "2020-04-13T15:51:19.000Z": "", "2020-04-13T14:08:18.000Z": "On w/ @MAShow995 this morning, following last night's storms - AL was fortunate that we did not see a loss of life. It was a tough Easter weekend, but our state was prepared as possible. Let recovery crews do their work. Thanks to meteorologists, first responders & utility crews!", "2020-04-13T13:34:17.000Z": "Thinking of our friends in Georgia @BrianKempGA as the reports are coming in about the severe weather last night. Offering our neighbor state any assistance if needed! Praying for you all.", "2020-04-13T13:00:03.000Z": "We're waking up this morning after rounds of severe weather impacted the SE, leaving behind significant damage. Unfortunately, our neighbors in MS saw a loss of life. @tatereeves , we're thinking about all of you & praying for you during this recovery process. AL is with you!", "2020-04-12T20:33:20.000Z": "Shelters and community safe rooms should remain open and accessible to all individuals seeking refuge from this severe weather, while implementing reasonable practices and procedures to prevent the spread of #COVID19 among those seeking shelter. #alpolitics  #alwx", "2020-04-12T18:16:32.000Z": "EF2+ tornadoes are possible statewide as well as significant wind damage and hail.  Make a plan by identifying your safe location and receiving alerts from at least two methods (outdoor sirens are NOT a reliable method!).  Learn more at https:// ema.alabama.gov/2020/04/12/pot ential-outbreak-of-severe-weather-easter-sunday/ ", "2020-04-12T13:11:15.000Z": "He is Risen, friends! ICYMI: Quote Tweet Governor Kay Ivey @GovernorKayIvey My fellow Alabamians, I know it is easy to be discouraged with everything that is happening right now. Friends, Jesus' death on the cross is the promise that Christ will make all things new & He can work all things for His good. \n\n\"This too shall pass.\" https:// youtu.be/hePYYTppwzU", "2020-04-12T12:35:24.000Z": "Happy Easter - I hope everyone is staying safe and enjoying celebrating at home this year. Today is a great opportunity to connect virtually with friends and family, spreading hope during this time. #EasterSunday  #HeIsRisen", "2020-04-11T16:30:20.000Z": "Potential severe storms are expected for areas of our state tomorrow. We encourage our customers to stay weather aware and prepare all safety plans.", "2020-04-11T17:00:23.000Z": "Our state stands ready to face whatever Mother Nature brings, even amidst a health pandemic. Remember that the use of shelters & other resources takes precedent, should the need arise. Stay weather aware, & stay safe this holiday weekend. #alwx  #alpolitics", "2020-04-10T22:56:59.000Z": "Alabama is proud of our friends at @boeing for leading a strong effort to manufacture face shields for health care professionals across the country. @HHSgov accepted Boeing's first shipment of 2,300 masks this morning! @fema  #ALThanksYou  #TogetherAL Boeing Delivers First 3D-Printed Face Shields for COVID-19 Response Boeing [NYSE: BA] today delivered the first set of reusable 3D-printed face shields to support healthcare professionals working to stop the spread of COVID-19. boeing.mediaroom.com", "2020-04-10T21:28:57.000Z": "Way to go, Elizabeth! #ALThanksYou  #TogetherAL Quote Tweet Serve Alabama @ServeAlabama Thanks to Elizabeth with @girlscoutssa Troop 9081 for being in this #TogetherAL ! She's working toward her Silver Award by sewing masks for healthcare workers. This is #TogetherAL during #Covid19 . #ALThanksYou  @GovernorKayIvey  @ALPublicHealth", "2020-04-10T17:59:55.000Z": "Amidst challenging times, Alabamians have always stepped up to the plate. Not for fame or glory, but to earnestly help their fellow neighbors. Thank you to every AL business that is creating PPE for those on the front lines. #TogetherAL  #COVID19  @MadeinAL Alabama businesses shifting production to help with PPE shortage Commerce Secretary Greg Canfield said HomTex is one of several manufacturers in Alabama adjusting production to try to meet the demand for personal protection equipment. wbrc.com", "2020-04-10T16:57:54.000Z": "\"I encourage you to be consistent in your efforts to stay at least 6 feet away from other people and avoid situations that would increase the risk of spreading COVID-19.\" Read the full State Health Officer Message for April 2020 at http:// go.usa.gov/xvW5k . #covid19  #coronavirus", "2020-04-10T14:00:15.000Z": "My fellow Alabamians, I know it is easy to be discouraged with everything that is happening right now. Friends, Jesus' death on the cross is the promise that Christ will make all things new & He can work all things for His good. \n\n\"This too shall pass.\" Gov. Ivey Shares Encouraging Easter Message Governor Kay Ivey shares an encouraging Easter message with her fellow Alabamians during the COVID-19 public health emergency. (Governor's Office, Lori Davis... youtube.com", "2020-04-10T00:18:49.000Z": "The phone lines are open and experts are there to answer your questions. Call 1-833-BCA4BIZ (1-833-222-4249) or email smallbusiness@bcatoday.org #livewithBCA", "2020-04-10T00:27:40.000Z": "We will get through this #TogetherAL Quote Tweet Mountain Lakes Chamber @MTLakesChamber Thank you @GovernorKayIvey and @BCAToday for your leadership to ensure Alabama's economy comes back stronger than ever, by connecting businesses to answers that will allow them to stay open. #TogetherAL  @APTV", "2020-04-09T23:09:49.000Z": "Alabama recognizes the selfless acts of service performed by its members of the U.S. military & their families, especially now during this pandemic. I've proclaimed April as Military Child Month to pay tribute to them, because when their parents serve our country, they do too.", "2020-04-09T21:44:45.000Z": "Looking good @huntsvillealcoc ! Thanks for encouraging everyone to participate. #RibbonsofHope  #TogetherAL  Quote Tweet huntsvillealcoc @huntsvillealcoc Let's see your ribbons! @GovernorKayIvey has asked Alabamians to hang #RibbonsofHope to support medical workers, first responders, and each other. We hung ours on our front column today. Any size, any color - hang one at home or work. We're all in this together... six feet apart.", "2020-04-09T17:25:12.000Z": "We've also posted some FAQ's regarding the CARES Act programs on our website.  Visit: https:// labor.alabama.gov/COVID/CARES%20 Act%20FAQ.pdf   @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem  @NASWAORG", "2020-04-09T15:08:45.000Z": "I sincerely appreciate the hard work & collaboration of @Yext , @ALPublicHealth , @reginabenjamin , @al_labor , @UABnews & our various partners in building this site. Alabamians, please utilize these great resources. #TogetherAL  #alpolitics", "2020-04-09T15:07:19.000Z": "This service is free of charge and can be accessed either through http:// altogetheralabama.org or directly at http:// covid19.alabama.gov . #TogetherAL  #alpolitics  @yext Alabama COVID19 Information Hub Use our resources to learn more about COVID19 in Alabama. covid19.alabama.gov", "2020-04-09T15:06:37.000Z": "My priority as governor is making sure every Alabamian has the most accurate, up-to-date information about COVID-19, so we can keep our families safe. #TogetherAL  #alpolitics Gov. Ivey Launches New COVID-19 Search Engine Tool Governor Kay Ivey, in partnership with Yext, announced a new search engine tool that enhances the state's official resource site, altogetheralabama.org. The ... youtube.com", "2020-04-09T15:06:19.000Z": "In partnership w/ @Yext , I'm excited to launch a new search engine tool to help AL in the fight against #COVID19 ! Alabamians can visit http:// covid19.alabama.gov to get real-time answers to questions ranging from symptoms to testing locations. #TogetherAL Governor Ivey Launches New COVID-19 Search Engine Tool - Office of the Governor of Alabama MONTGOMERY - Governor Kay Ivey on Thursday announced the launch of a COVID-19 search engine tool that enhances the state's official resource site, altogetheralabama.org. Through a public-private... governor.alabama.gov", "2020-04-09T14:13:35.000Z": "| Important Update\n\nAlabama has begun paying the Federal Pandemic Unemployment Compensation (FPUC) benefit that was established with the passing of the federal CARES Act on March 27, 2020. Learn more below. #alpolitics Quote Tweet ADOL @al_labor Alabama began paying the $600 FPUC stimulus benefit last night.  More than $40 million was paid out yesterday. Click the link the see the news release. https:// labor.alabama.gov/news_feed/News_Page.aspx?id=219   @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem  @NASWAORG", "2020-04-08T20:44:51.000Z": "ADPH is seeking donations of #facemasks for home health care patients. Contact Dr. Choona Lang, Homecare Division Director of the Bureau of Home Health and Community Services ( http:// alabamapublichealth.gov/homehealth ) at 334-206-5696 or by email Choona.Lang@adph.state.al.us. #COVID19  #coronavirus", "2020-04-08T21:01:12.000Z": "ALEA's Highway Patrol Division has received a high volume of calls in regards to \"rumors\" about closing Alabama's borders and setting up checkpoints. These are only rumors. ALEA State Troopers will continue to patrol roadways, promote public safety and enforce the law. #ALEA", "2020-04-08T21:25:14.000Z": "#RibbonsofHope is off to a great start! Keep spreading hope & sharing your photos. #TogetherAL  Quote Tweet City of Pelham, Alabama @CityofPelham We hope you'll join us and participate in @GovernorKayIvey 's #RibbonsofHope campaign. Place a ribbon on a tree or pole in your front yard or on your mailbox. The ribbons symbolize faith, hope, love and prayer. Pray for our community and those on the front lines. #WeArePelham", "2020-04-08T20:50:10.000Z": "Beautiful! #TogetherAL  #alpolitics Quote Tweet Alabama Hospital Association @ALhospitals #RibbonsofHope symbolize hope and prayer for our front-line personnel during the COVID-19 pandemic. Let's all take a moment to say a word of thanks for these wonderful people. Thank you, @GovernorKayIvey for honoring these heroes in such a special way! #ALHospitals  #AlwaysThere", "2020-04-08T19:02:30.000Z": "I also want to thank @UABnews for creating the symptom tracker featured at http:// altogetheralabama.org . They've requested that people visit the site & volunteer their health status/symptoms as a way to identify potential hotspots to help our @ALPublicHealth officials. #TogetherAL ALtogether Alabama | Get help or lend a hand during the COVID-19 crisis Need help? COVID-19 can affect all Alabamians. ALtogether is a one-stop-shop where you can ask for help or lend a hand during the COVID-19 crisis. altogetheralabama.org", "2020-04-08T19:01:57.000Z": "We appreciate our friends at @Yext for collaborating with our team to provide this helpful, fact-finding resource to Alabamians. We're proud to be one of the first states to offer such an extensive database of #COVID19 information from federal, state & local partners. #TogetherAL", "2020-04-08T19:01:21.000Z": "We want Alabamians to visit http:// altogetheralabama.org for all their #COVID19 needs ranging from finding a test center to #smallbusiness assistance to volunteering. You can even find a list of over 11,000 essential job openings here. @Yext  @ALPublicHealth  #TogetherAL  #alpolitics ALtogether Alabama | Get help or lend a hand during the COVID-19 crisis Need help? COVID-19 can affect all Alabamians. ALtogether is a one-stop-shop where you can ask for help or lend a hand during the COVID-19 crisis. altogetheralabama.org", "2020-04-08T19:00:44.000Z": "Earlier this week, I launched http:// altogetheralabama.org as AL's official #COVID19 resource hub. In partnership with @Yext , I'm excited to share we've added a new search engine tool where Alabamians can get accurate answers to their questions. #TogetherAL Gov. Ivey Launches New COVID-19 Search Engine Tool Governor Kay Ivey, in partnership with Yext, announced a new search engine tool that enhances the state's official resource site, altogetheralabama.org. The ... youtube.com", "2020-04-08T17:01:18.000Z": "Are you a medial professional in #Alabama looking for a #volunteer opportunity during the #COVID19 pandemic? Please consider volunteering through #AlabamaReadyOp , a joint project with @GovernorKayIvey and @ALPublicHealth . To register, follow this link: Alabama ReadyOp | ServeAlabama This is the State of Alabama's online system for managing public health and medical disaster volunteer responders. This system supports personnel who may be utilized during disasters, all-hazard... servealabama.gov", "2020-04-08T16:54:39.000Z": "Thank you @EnterpriseState for spreading hope in our state. Beautiful display! #RibbonsofHope  #TogetherAL Quote Tweet Enterprise State @EnterpriseState ESCC is proud to honor medical professionals by taking part in @GovernorKayIvey 's \"Ribbons of Hope\" campaign. Our ribbons at the entrance to our campus are symbols of support for and faith in our first responders and medical personnel taking care of others during this time. Show this thread", "2020-04-07T20:11:09.000Z": "We are reporting case characteristics on Alabama's #COVID19 cases on our website at http:// go.usa.gov/xvcx2 . Download this 2-page document: http:// go.usa.gov/xvbnJ .", "2020-04-07T22:57:40.000Z": "One of our terrific Capitol Press Corps reporters Karen Goldsmith & her husband Kenny are proudly displaying #RibbonsofHope outside their home. Thank you Karen & Kenny for helping us spread hope to all of those on the frontlines combatting #COVID19  #alpolitics  #TogetherAL", "2020-04-07T20:59:25.000Z": "Want to help our health care professionals? The @almedassoc has a special PPE Donation Day coming up!  #WorldHealthDay  #TogetherAL Quote Tweet Medical Association of the State of Alabama @almedassoc We are hosting a statewide PPE donation day on April 13th! Alabamians are encouraged to donate any extra PPE they might have to help our physicians on the front lines and keep the virus from spreading. Visit our website for a list of donation sites: https:// bit.ly/3bXC2Pb", "2020-04-07T17:37:16.000Z": "For those on the front line who are fighting to help keep us safe, thank you. #WarEagle | #WorldHealthDay", "2020-04-07T17:41:21.000Z": "Due to #COVID19 , blood & plasma centers are experiencing a drop in donations. If you're healthy & able, please consider donating. @RedCross  @LifeSouth  @PlasmaProteins Blood centers: https:// rcblood.org/2JJHjht  https:// bit.ly/39PFkTs Plasma centers: https:// bit.ly/2VbogC0", "2020-04-07T15:20:19.000Z": "I hope you'll show your support! https:// governor.alabama.gov/newsroom/2020/04/governor-ivey-announces-ribbons-of-hope-campaign/   #RibbonsofHope  #TogetherAL  #alpolitics Governor Ivey Announces Ribbons of Hope Campaign - Office of the Governor of Alabama MONTGOMERY - Governor Kay Ivey on Tuesday announced her \"Ribbons of Hope\" campaign at a ceremony at the Alabama State Capitol. During the duration of the COVID-19 (Coronavirus) pandemic, Governor... governor.alabama.gov", "2020-04-07T15:14:47.000Z": "This morning, several members of the faith community joined me to launch my \"Ribbons of Hope\" campaign to remind everyone to pray for medical personnel, first responders, & for one another. #RibbonsofHope  #TogetherAL  #alpolitics", "2020-04-06T19:12:03.000Z": "Today, I'm excited to launch http:// altogetheralabama.org , an online resource that will serve as a hub of info for the AL's response to the #COVID19 crisis. I encourage you to explore this great tool: https:// governor.alabama.gov/newsroom/2020/04/governor-ivey-launches-states-guide-to-covid-19-relief-efforts/  .  https:// youtu.be/fw797VguUh8  #alpolitics  #ALtogether ALtogether Alabama | Get help or lend a hand during the COVID-19 crisis Need help? COVID-19 can affect all Alabamians. ALtogether is a one-stop-shop where you can ask for help or lend a hand during the COVID-19 crisis. altogetheralabama.org", "2020-04-05T23:35:19.000Z": "Great message Baldwin County! We are ALL in this #TogetherAL . @BCCommission Quote Tweet Baldwin County Emergency Management Agency @BaldwinEMA The Baldwin County Commission and Mayors from all cities in Baldwin County have a message for you about our collective fight to stop the spread of COVID-19.", "2020-04-05T17:11:42.000Z": "The Governor's Office of Volunteer Services has launched the AL ReadyOp program. It's an online system for managing public health & medical disaster volunteer responders. GOVS works w/ @ALPublicHealth to get volunteers on the ground wherever needed.  http:// servealabama.gov/alabamareadyop .", "2020-04-05T16:30:27.000Z": "In partnership with @ALPublicHealth , we've created these two documents to assist individuals & businesses with Frequently Asked Questions regarding the #StayAtHome order. You can download these & review other resources at https:// governor.alabama.gov/newsroom/covid -19/  . #TogetherAL  #alpolitics", "2020-04-04T18:31:52.000Z": "AL's automakers have always gone above & beyond to support our communities. Now they're stepping up again in our fight against #COVID19 . Thank you @Toyota , @Hyundai , @HondaAlabama & @MercedesBenzUSA ! Your efforts are much appreciated. @MadeinAL  #MadeinAL  http:// bit.ly/2Jzh8tx", "2020-04-04T17:55:23.000Z": "AL's #StayAtHome Order takes effect at 5 p.m. TODAY & will expire April 30 at 5 p.m. We all have a duty to take this seriously. Wash your hands frequently, disinfect commonly used items often & practice social distancing. Stay safe, Alabama. #TogetherAL Governor Ivey Issues Stay at Home Order - Office of the Governor of Alabama MONTGOMERY - Governor Kay Ivey on Friday issued a Stay at Home order to be applied statewide. The order will be effective beginning Saturday, April 4, at 5:00 p.m. and will expire Thursday, April 30,... governor.alabama.gov", "2020-04-03T21:40:40.000Z": "Thank you, Will, for your assistance. We'll get through this, #TogetherAL ! Quote Tweet Will Ainsworth @willainsworthAL I fully support Governor Ivey's decision to issue a statewide shelter in place order. \n\nRead my full statement below.", "2020-04-03T21:14:38.000Z": "My fellow Alabamians, I plead with you to do your part to #StopTheSpread of #COVID19 . We've got to take this order dead serious; otherwise, the fact is more people will end up dying. #alpolitics  #TogetherAL  @ALPublicHealth", "2020-04-03T21:12:27.000Z": "You CAN still go get groceries & medicines.  You're ENCOURAGED to still order food out from your favorite restaurants, but the stores will be required to institute more stringent rules to keep a safe number of customers shopping at any one time. #alpolitics  #TogetherAL", "2020-04-03T21:12:03.000Z": "I can't say this anymore clearly- #COVID19 is an imminent threat to our way of life, & you need to understand that we're past urging people to stay home. It is NOW the law. #alpolitics  #TogetherAL", "2020-04-03T21:11:34.000Z": "Since March 6, we've taken several aggressive actions to reduce the spread of #COVID19 . Dr. Harris & I have tried everything we knew to do to keep from having to take this next step. But late yesterday, it became obvious that more had to be done. #alpolitics  #TogetherAL", "2020-04-03T21:07:15.000Z": "My fellow Alabamians, effective at 5 p.m. TOMORROW, I am mandating a #StayAtHome order for our entire state. Read the order here: https:// governor.alabama.gov/newsroom/2020/04/governor-ivey-issues-stay-at-home-order/  . #alpolitics  #TogetherAL Governor Ivey Issues Stay at Home Order - Office of the Governor of Alabama MONTGOMERY - Governor Kay Ivey on Friday issued a Stay at Home order to be applied statewide. The order will be effective beginning Saturday, April 4, at 5:00 p.m. and will expire Thursday, April 30,... governor.alabama.gov", "2020-04-03T20:34:57.000Z": "I'll be hosting a press conference with Dr. Scott Harris, @AGSteveMarshall , & Rev. Cromwell Handy TODAY to provide an update on our #COVID19 efforts. You can watch it live at 4 p.m. at http:// facebook.com/KayIveyAL/ . Media outlets will also be carrying it live. #alpolitics  #TogetherAL", "2020-04-03T18:45:33.000Z": "#smallbusiness  @BCAToday  @nfib_al Quote Tweet Atlas Alabama @AtlasAlabama Attention small business owners! There is now detailed COVID-19 information available on http:// atlasalabama.gov . You can find federal, state, and local services. Check back periodically for updated information as it becomes available.", "2020-04-03T17:37:05.000Z": "I'm so glad to hear our friends at @AirbusInTheUS have donated 40,000 masks to protect city & health care professionals in Mobile & Baldwin Counties. Thank you for helping Alabamians in the fight against #COVID19 . #TogetherAL  #alpolitics", "2020-04-02T22:48:04.000Z": "If you'd like to donate PPE to support our health care workers, please reach out to @ALPublicHealth . #TogetherAL  #alpolitics Quote Tweet Alabama Public Health @ALPublicHealth The ADPH Office of Oral Health is accepting donations of personal protective equipment such as masks, gloves, and gowns for distribution to local healthcare personnel. See our flyer at http:// go.usa.gov/xvYg3 for details on how you can donate! #covid19  #coronavirus  #ppe", "2020-04-02T21:53:07.000Z": "Alabama educators get registered for this awesome #STEM opportunity. The free webinar is Wednesday, April 8,\n9:30 to 10:30 a.m. Thank you @Boeing for hosting this @LearningBlade event! #TogetherAL  #aledchat  @AlabamaAchieves Quote Tweet AMSTI @AMSTI4all *Alabama teachers, THIS. IS. ONLY. FOR. YOU! @GovernorKayIvey & @Boeing have made @LearningBlade available for ALL Alabama students.  This webinar is customized for you to understand this STEM learning tool & share it with students as they homeschool. https:// conta.cc/3aBHmrp", "2020-04-02T19:25:23.000Z": "Mrs. Sieu Tang Wood, a good friend of mine & owner of Tang's Alterations, has donated 3,000 disposable non-medical grade masks. These will be distributed to essential service personnel that are not health care workers. Thank you, Sieu! #TogetherAL  #alpolitics", "2020-04-02T19:12:34.000Z": "The @NFWFnews recently awarded nearly $24 million from its Gulf Environmental Benefit Fund (GEBF) to four new projects in the state of Alabama! I appreciate the work of the ADCNR & our partnership with NFWF as we continue to build a more resilient coast. https:// governor.alabama.gov/newsroom/2020/04/governor-ivey-announces-national-fish-and-wildlife-foundation-projects-in-alabama/ ", "2020-04-02T18:05:58.000Z": "Thanks for the great questions! #TogetherAL  #AskGovIvey", "2020-04-02T17:52:56.000Z": "Commerce Sec. @gregcanfield is also leading a group, called the Business & Manufacturing Alliance (BAMA), to find AL companies with the resources to meet our PPE demands. #AskGovIvey  @MadeinAL  #alpolitics", "2020-04-02T17:51:57.000Z": "In addition to working with @VP Pence & our federal partners, I set up a Strategic Assets Team (SAT), made up of leaders in the private sector, to identify sources of PPE. #AskKayIvey Quote Tweet K i m b e r @we8kings How many ventilators have you ordered for our state and how and when will those orders be fulfilled, and when will our healthcare workers have enough PPE? #AskGovIvey", "2020-04-02T17:34:50.000Z": "The @al_labor is receiving a record number of unemployment claims and the website is not able to withstand the traffic. I assure the people of Alabama that our folks at ADOL are working overtime to ensure that these claims are being verified and processed. #AskGovIvey Quote Tweet Amy Thomley @amy_thomley #AskGovIvey , what is your administration doing to ensure all Alabamians that need unemployment to feed their families recieve their benefits in a timely manner?", "2020-04-02T17:25:53.000Z": "My team is in constant contact with all levels of government to ensure the safety of Alabamians. I fully support our municipalities in implementing more aggressive measures when necessary. #AskGovIvey Quote Tweet Jay Waters @jaywaters #AskGovIvey Did your office or anyone in state gov't push back against municipalities in Alabama who have been more aggressive in issuing stay at home orders?", "2020-04-02T17:22:10.000Z": "Each state has to weigh their own set of factors. I'm in communication with local, state & federal officials on a daily basis. We are taking a measured approach to keep Alabamians healthy, safe & working, wherever possible. #alpolitics  #AskGovIvey Quote Tweet LW @184nosliwae #AskGovIvey  @GovernorKayIvey All surrounding states have issues a stay at home order to protect their citizens.  Why don't you want to protect Alabamians?", "2020-04-02T17:17:24.000Z": "All health care options are being considered & evaluated to ensure the safety & wellbeing of the people of Alabama. Quote Tweet Jonathan Tew @JonTew Replying to @GovernorKayIvey Has this virus brought you any closer to changing your mind about expanding Medicaid? If not, can you explain to us why? #AskGovIvey", "2020-04-02T17:14:42.000Z": "The health & wellbeing of the people of Alabama is paramount. My office continues discussions with state leaders about feasible health care options. All options remain on the table & will be evaluated with prudence. Quote Tweet olivia singleton @LivyLouLou @GovernorKayIvey Low wage workers have been hit the hardest by COVID-19 and many don't have health care. Will you you expand Medicaid to help them? (Also tbt to 1 year ago today!) #AskGovIvey  #CoverAlabama", "2020-04-02T16:55:11.000Z": "It's almost Noon! Reply below or tweet #AskGovIvey Join the Q&A! Tweet #AskGovIvey", "2020-04-02T15:16:17.000Z": "Alabamians, I want to hear from you! \n\nDon't forget to participate in my live #COVID19 Q&A from noon to 1 p.m. \n\nBe sure to tweet #AskGovIvey or reply below, so I can see your questions!", "2020-04-02T15:04:33.000Z": "Health care providers interested in collaborating with the Samuel Ginn College of Engineering during the current public health emergency can click here http:// eng.auburn.edu/reinvent  #TogetherAL  #COVID19 THE AUBURN RE-INVENT PROJECT Auburn University engineering professors alumni have successfully re-purposed a CPAP machine into a functional ventilator for hospitals coping with supply shortages during the COVID-19 crisis. eng.auburn.edu", "2020-04-02T15:02:49.000Z": "What exciting news! War Eagle! We are all in this #TogetherAL  #COVID19 \"Auburn design adapts CPAP machines into emergency ventilators\" Auburn design adapts CPAP machines into emergency ventilators A group of Auburn engineers has developed a way to quickly and inexpensively convert CPAP machines into ventilators, one of the most important tools hospitals have for helpingand#160;COVID-19and#16... ocm.auburn.edu", "2020-04-01T19:50:42.000Z": "The @DeptVetAffairs has issued a resource guide for veterans to review their health care options during this #COVID19 health emergency. See below or visit https:// va.alabama.gov to get connected with the @ALSDVA . #alpolitics  #TogetherAL", "2020-04-01T19:01:21.000Z": "I'm excited to participate in @Twitter 's #AskTheGov project tomorrow! \n\nI'll be hosting a live Q&A from 12 to 1 p.m. to answer my fellow Alabamians questions related to #COVID19 . \n\nBe sure to use #AskGovIvey to participate! #alpolitics", "2020-04-01T18:44:01.000Z": "Thank you, John Parker! #ALcounts Quote Tweet Alabama Athletics @UA_Athletics The State of Alabama is counting on you. Impact our state's health care, food, education, roads and bridges, congressional representation, and much more. Complete your 2020 Census to secure a brighter future for not only your community but our state. #ALCounts", "2020-04-01T18:24:34.000Z": "While much of our attention has rightfully been focused on the #Coronavirus outbreak, the #2020Census remains as important as ever to AL. I encourage you to visit http:// my2020census.gov , call 1-844-330-2020 or fill out the paper form today! https:// youtu.be/COo3wN0ZItQ  @AlabamaCounts Gov. Ivey Encourages Alabamians to Complete 2020 Census Gov. Ivey encourages Alabamians to complete the 2020 Census. Learn more at https://alabama2020census.com/. (Governor's Office, Lori Davis Jhons) youtube.com", "2020-04-01T18:22:34.000Z": "Today, is National Census Day! The #2020Census is NOW more important than ever. It is an unprecedented time in Alabama; however, we must remain committed to Census participation. https:// governor.alabama.gov/newsroom/2020/04/gov-kay-ivey-census-2020-now-more-important-than-ever/   #alpolitics  #ALCounts  @uscensusbureau  @AlabamaCounts  @ADECA", "2020-04-01T17:36:17.000Z": "#TogetherAL  #alpolitics Quote Tweet Alabama Bankers @ALBankers Need information about the Payroll Protection Program and how it can help your small business? Check out this document from ABA: https:// bit.ly/3dInW6h", "2020-04-01T17:30:23.000Z": "Staying on top of what's going on across the nation on a call with my fellow governors. We continue to provide each other with updates, tips and suggestions to mitigate the spread of #COVID19 . We're all #InThisTogether . #TogetherAL  #alpolitics  @NatlGovsAssoc", "2020-03-31T17:46:45.000Z": "Finding sites serving FREE school closure meals near you is easier than ever. Simply text 'FOOD' to 877-877 to receive locations from No Kid Hungry or visit http:// breakforaplate.com . @nokidhungry  #BreakforaPlate  #NoKidHungry  #KidsEatFree  #SchoolClosureMeals", "2020-04-01T15:45:48.000Z": "Thank you to the @USDA for approving the ALSDE Child Nutrition Programs waiver request, which will allow food authorities & community organizations to operate in non-area eligible locations to provide children safe, nutritious meals during the #COVID19 emergency school closures.", "2020-04-01T14:52:54.000Z": "IMPACT: The @SBAgov Paycheck Protection Program will help small businesses across Alabama keep their workers on the payroll. \n\nIt's expected to launch later this week, and small businesses need to be prepared to apply quickly. https:// bit.ly/3dLKrHh", "2020-04-01T15:03:20.000Z": "#COVID19 has disrupted life as we know it, including the critical economic role played by AL small businesses. I urge business owners to act today & be prepared to apply for @SBAgov assistance. #alpolitics  #TogetherAL  @USTreasury Learn more here: https:// governor.alabama.gov/newsroom/2020/04/governor-ivey-urges-alabama-small-business-owners-to-prepare-now-by-applying-for-federal-financial-relief/  .", "2020-04-01T01:57:30.000Z": "More information regarding who can file under the CARES Act. This information will be updated as we receive more guidance from federal authorities. @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem  @NASWAORG  https:// labor.alabama.gov/news_feed/News_Page.aspx?id=208 ", "2020-03-31T23:38:04.000Z": "REVISED: Important Unemployment Assistance Update  #alpolitics  #TogetherAL Quote Tweet ADOL @al_labor Revised: NEW INFORMATION. PLEASE READ CAREFULLY. CORRECTED TO SAY WEEKS FILED INSTEAD OF CLAIMS FILED. \nWe will be posting more instructions as we are able, but hopefully this will help in the meantime. @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem", "2020-03-31T15:14:26.000Z": "Availability of high-speed internet has always been vital, but #COVID19 has magnified just how imperative it is that all Alabamians have access to broadband. I'm pleased to award 20 grants to provide #broadband to numerous communities in AL. #alpolitics  https:// governor.alabama.gov/newsroom/2020/03/gov-ivey-awards-9-5-million-in-broadband-expansion-grants/ ", "2020-03-30T14:30:21.000Z": "Folks, don't get out if you don't have to. Avoid interacting with others as much as possible. Everyone - at every age - is vulnerable. With faith and perseverance, we'll get through this, #TogetherAL . #COVID19  #alpolitics Gov. Ivey Reminds Alabamians to Practice Social Distancing Gov. Ivey reminds Alabamians to practice social distancing during the Coronavirus pandemic. Learn more at governor.alabama.gov. (Governor's Office, Lori Davi... youtube.com", "2020-03-29T22:21:54.000Z": "The Alabama Department of Public Health would like to thank Apple & @tim_cook for the donation of 100,000 surgical masks and 100,000 N95 masks for Alabama's front line. \nOur heroes are those on the front line. Thanks to Tim for helping us protect them.", "2020-03-29T18:16:37.000Z": "ALEA's Marine Patrol reminds everyone about social distancing and water safety: https:// alea.gov/news/aleas-mar ine-patrol-division-reminds-everyone-about-social-distancing-water-safety   #ALEA  #TogetherAL", "2020-03-29T01:10:39.000Z": "I commend @CalagazGroup , a print shop in Mobile, for transforming their daily operations to make face shields to protect our health care workers. Not only are they assisting our frontline, but they're helping their employees. https:// alabamanewscenter.com/2020/03/27/ala bama-printer-making-face-shields-for-health-care-workers/   #TogetherAL  #alpolitics Alabama printer making face shields for health care workers - Alabama NewsCenter The company's owner says an \"outside the box\" idea became a reality quickly. alabamanewscenter.com", "2020-03-28T20:45:00.000Z": "Thank you @Apple and @tim_cook for donating about 63,000 N-95 masks!My team and I will continue to pursue these needed supplies to combat #COVID19 and we will get thru this #TogetherAL", "2020-03-28T13:37:43.000Z": "Effective TODAY at 5 p.m. all non-work related gatherings of 10 persons or more, or non-work related gatherings of any size that can't maintain a consistent six-foot distance between persons, are prohibited. @ALPublicHealth  #TogetherAL  #alpolitics Read: https:// governor.alabama.gov/assets/2020/03 /Amended-Statewide-Social-Distancing-SHO-Order-3.27.2020-FINAL.pdf ", "2020-03-27T23:07:39.000Z": "In cooperation with @GovernorKayIvey , we have created these Safer at Home FAQs: http:// go.usa.gov/xvcYg addressing the most-asked questions related to the latest emergency order: http:// go.usa.gov/xvcY4 which goes into effect March 28 at 5 p.m. #COVID19", "2020-03-27T20:34:05.000Z": "", "2020-03-27T21:24:36.000Z": "Tonight @ 7:30 on @CapitolJournal : @ALPublicHealth Officer Dr. Scott Harris & @ALhospitals CEO Dr. Don Williamson on virus growth; @AlabamaAchieves Supt. @egmackey on school closures; @AGSteveMarshall on virus mandate guidance; @MacDistrict25 on legislative plans. #alpolitics", "2020-03-27T20:20:20.000Z": "Clarification Update:\n\nThe amount of funding for our state has not yet been reached; however, we appreciate @Robert_Aderholt for working to get us this much needed broadband support. #RuralAL  #alpolitics", "2020-03-27T20:10:17.000Z": "Thank you @Robert_Aderholt for advocating for broadband funding to be included in the CARES ACT. Increasing broadband access for #RuralAL is more important NOW than ever, especially as our state finishes the school year remotely & as we step-up telehealth services. #alpolitics", "2020-03-27T17:58:01.000Z": "While practicing social distancing, I want to encourage you to support your local restaurants by ordering in or picking up curbside. Visit https:// carryoutal.com to find open restaurants near you during the #COVID19 outbreak. @arhaonline  #TogetherAL  #alpolitics Takeout, Delivery and Curbside Restaurants in Alabama, AL Carryout Find which of your favorite restaurants are offering takeout, carryout, curbside pickup, and delivery in Alabama. Search by city and cuisine. carryoutal.com", "2020-03-27T17:37:52.000Z": "Alabamians practicing social distancing can explore #AlabamaHistoryAtHome through a new @AlabamaArchives website: https:// alabamahistoryhome.org . Parents will be especially interested in the many free activities for children, but learners of all ages will benefit. #TogetherAL  #aledchat Alabama History@Home Explore Alabama's history from the comfort of your couch. alabamahistoryhome.org", "2020-03-27T17:00:19.000Z": "Are you a dislocated worker? @ALWorksSystem has created an informative handout outlining assistance from the state's Rapid Response team. Check it out  https:// madeinalabama.com/assets/2020/03 /Handout.pdf ", "2020-03-27T16:10:58.000Z": "Folks, this is incredibly disappointing news to deliver, but this is a matter of life & death. If you can stay home, you are SAFER AT HOME. @ALPublicHealth  #alpolitics  #TogetherAL  #COVID19", "2020-03-27T16:10:34.000Z": "Rather than shutting the entire state down, I propose a different solution. Today, I join Dr. Harris in announcing a specific list of businesses that will close until April 17. View the amended State Health Order: https:// governor.alabama.gov/newsroom/covid -19/  . #alpolitics  #TogetherAL  @ALPublicHealth", "2020-03-27T16:05:35.000Z": "#COVID19 is a global crisis. There's just no owner's manual on how to do this. This will be hard, but I'm more confident than ever that we'll get through this TOGETHER. That's why from this point forward, I want us all to think of this effort as #TogetherAL . #alpolitics", "2020-03-27T16:04:14.000Z": "As of this morning, 538 people in AL have been diagnosed with #COVID19 & 3 Alabamians have passed. I can't stress to you enough that we must take this deadly virus seriously. I assure you I'm doing everything in my power & using every available resource to protect AL. #alpolitics", "2020-03-27T15:39:04.000Z": "Tune in to a joint press conference with Dr. Scott Harris & me about #COVID19 TODAY at 11 a.m. You can watch it live at https:// bit.ly/3dxokEv . @ALPublicHealth  @wsfa12news  #alpolitics", "2020-03-27T01:01:40.000Z": "During these challenging times, you need accurate information to make informed decisions. Stay up to date with the latest #COVID19 news by visiting: https:// governor.alabama.gov/newsroom/covid -19/  . There you will find links to trusted sources & resources to help you & your family. #alpolitics COVID-19 News and Resources - Office of the Governor of Alabama Coronavirus Disease 2019 (COVID-19) News & Resources Public Health | Unemployment Resources | Business Resources | Child Assistance | Volunteer / Donate Blood | Stay Informed \"Alabamians - and... governor.alabama.gov", "2020-03-26T22:00:09.000Z": "| STAR ID Update\n\nAlabamians, the STAR ID deadline has been extended until next year; however, you're still encouraged to obtain one. Please review the important information below & be aware of the current changes to ALEA operations during the #COVID19 pandemic. #alpolitics Quote Tweet Alabama Law Enforcement Agency @ALEAprotects The U.S. Department of Homeland Security, at the direction of @realDonaldTrump , is extending the REAL ID enforcement deadline to Oct. 1, 2021, in response to COVID-19. Alabama's version of the federal REAL ID program is STAR ID. \nFor more info, visit: https:// alea.gov/news/alea-conf irms-star-id-deadline-extension-further-limits-person-driver-license-services ", "2020-03-26T21:14:06.000Z": "Today, I signed a supplemental SOE that would allow Dr. Mackey & @AlabamaAchieves to provide instruction from home starting April 6 for the remainder of the school year. This decision has been made with a tremendous amount of concern & discussion. Fourth Supplemental State of Emergency: Coronavirus (COVID-19) - Office of the Governor of Alabama DOWNLOAD governor.alabama.gov", "2020-03-26T20:40:18.000Z": "I'm holding a press conference TODAY at 4 p.m. with Dr. Scott Harris & Dr. Eric Mackey. We will be providing updates on Alabama's efforts to combat #COVID19 . You can watch it live here: https:// bit.ly/3bqyyEK . #alpolitics  @ALPublicHealth  @AlabamaAchieves  @wsfa12news", "2020-03-26T16:55:13.000Z": "I joined my fellow governors today on a call with ... @POTUS  ...and ... @VP  I appreciate their leadership and their accessibility during the #COVID19 pandemic. We will get through these challenging days, Alabama!", "2020-03-26T01:47:51.000Z": "It is with profound sadness that I confirm that one of our citizens has passed away from the COVID-19 virus. Together, we will overcome these challenges and difficult days. #COVID19", "2020-03-25T22:36:26.000Z": "The Alabama Department of Public Health (ADPH)  has not confirmed a death from COVID-19 at this time.  ADPH continues to investigate cases of #COVID19 in Alabama.", "2020-03-25T02:05:27.000Z": "Our FAQ page: http:// go.usa.gov/xdhZ9 provides answers to your most-asked questions about the #COVID19 outbreak.", "2020-03-25T16:17:28.000Z": "Thank you to these #workforce leaders for taking the time to share this valuable information with our constituents. Be sure to watch their webinar! #alpolitics  #COVID19 Quote Tweet AlabamaWorks @ALWorksSystem Excellent #COVID19 resource for our state's #workforce on this webinar. Topics include: unemployment insurance, small business assistance, & immediate benefits provided by new federal laws. Thanks to all the participants! Give it a listen and share! https:// vimeo.com/399931154", "2020-03-24T21:44:22.000Z": "We hear your concerns regarding difficulties filing unemployment compensation claims. We are continuing to implement solutions to help make this process easier for you. Please note that you can file online 24 hours a day, with the exception of Friday night and Saturday.", "2020-03-24T21:37:56.000Z": "Thank you, Coach Saban! #InThisTogether Quote Tweet Alabama Football @AlabamaFTBL A special message from Head Coach Nick Saban. #StayHomeStaySafe  #InThisTogether", "2020-03-24T20:20:01.000Z": "Currently hosting a joint conference call with Dr. Scott Harris to address #COVID19 questions from the media. We appreciate the work our media outlets are doing to get important messages & resources to our constituents about #Coronavirus . #alpolitics  @ALPublicHealth", "2020-03-24T17:21:08.000Z": ". @wsfa12news has put together a great list of resources our state agencies & local organizations are providing during the #COVID19 pandemic. Scroll through to learn more about the different types of assistance being offered. #alpolitics  #InThisTogether Coronavirus: Data and resources for assistance If you are looking for food, work or other assistance during the coronavirus pandemic, check out these resources. wsfa.com", "2020-03-24T17:16:38.000Z": "What a fun way to teach our little ones! #borntowashchallenge  @AL_DECE Quote Tweet Jennifer @JenForAU We were challenged by @coachblackmon and family to do the #killcorona  #washyourhands challenge! Here ya go! We challenge @TheEllenShow  @Thesupercole and the Nicholas Family!!!", "2020-03-23T22:55:08.000Z": "For general #COVID19 questions, call 1-800-270-7268 or email covid19info@adph.state.al.us. Telephone calls are answered from 7 a.m. to 9 p.m. daily.", "2020-03-24T16:01:00.000Z": "As governor, I want to take a moment and plead with all of you to please respect all health recommendations and orders and work them in to your daily lives. The temporary adjustments can be truly lifesaving as we work to #FlattenTheCurve of #COVID19 . Gov. Kay Ivey: Help us help you. It's time to show our 'Alabama Resolve' I say all of this as a reminder that Alabama is a family and there is no better time, than now, for our family to come together, be strong and stand united. montgomeryadvertiser.com", "2020-03-23T19:35:42.000Z": "ADPH, again, urges the public NOT to seek a test if you do not have symptoms. \n\nState officer: \"It uses up a lot of very valuable supplies and makes it difficult for us to test\" those who are acutely ill. #alabama  #COVID19", "2020-03-23T19:28:03.000Z": "@VP also assured me the administration was NOT discussing/issuing a shelter in place. Thank you, Mr. Vice President and Mr. President! @potus", "2020-03-23T19:22:41.000Z": "On a call with ...... @VP  and the governors - asked him if the admin had plans for national shelter in place & if we are focusing more on virus/ignoring economy. He assured me that @potus was focused on slowing the spread & doing everything to get our economy moving again!", "2020-03-23T17:31:00.000Z": "ADPH will provide an update on #COVID19 at 2:30 p.m. CT. In an effort to maintain social distancing, starting today we will offer video footage only by a remote pool feed, & will not allow any other video cameras into the update briefing. Watch it live at http:// alabamapublichealth.gov/alphtn .", "2020-03-23T18:17:41.000Z": "ICYMI: The Governor's Office of Volunteer Services & the AL Voluntary Organizations Active in Disaster (ALVOAD) has released guidelines for #COVID19 volunteers. View them here: http:// ow.ly/1ChQ50yQteQ & at http:// servealabama.gov . #alpolitics  @ServeAlabama  @ADECA  @ALPublicHealth Home | ServeAlabama servealabama.gov", "2020-03-23T15:51:29.000Z": "Business owners: The @SBAgov is automatically deferring payments on existing disaster loans through Dec. 31, 2020.\n\nDetails: https:// sba.gov/about-sba/sba- newsroom/press-releases-media-advisories/carranza-implements-automatic-deferment-existing-sba-disaster-loans-through-end-2020 ", "2020-03-23T17:26:31.000Z": "Everyone can do their part to prevent the spread of #COVID19 by washing your hands often, disinfecting common areas/items, & practicing social distancing. Visit the @ALPublicHealth website for more resources: http:// alabamapublichealth.gov/infectiousdise ases/2019-coronavirus.html  . #alpolitics  @CDCgov  #InThisTogether", "2020-03-23T17:23:26.000Z": "Anyone experiencing #COVID19 symptoms should consult their doctor or call 1-888-264-2256 for assistance. Our health care providers are doing their best to help Alabamians. As we ramp up supplies, let's remember to practice patience with one another. https:// youtube.com/watch?time_con tinue=21&v=oGruT7Fd54E&feature=emb_title ", "2020-03-23T16:28:09.000Z": "A donor (who wishes to remain anonymous) has donated 100,000 masks/ PPE's to our state. We are working to provide resources to our healthcare workers who are on the frontlines of #COVID19 It truly takes a team effort as we seek to flatten the curve! #alpolitics", "2020-03-23T15:48:52.000Z": "This morning, I signed a supplemental SOE to allow the @AlabamaRevenue to extend state tax filings until July 15, 2020 to match the @USTreasury . No interest or penalties will be charged for filings during this extended period. https:// governor.alabama.gov/newsroom/2020/03/governor-ivey-delays-state-tax-filings/#alpolitics   #COVID19 Governor Ivey Delays State Tax Filings - Office of the Governor of Alabama MONTGOMERY - Governor Kay Ivey and the Alabama Department of Revenue announced today that the state income tax filing due date is extended from April 15, 2020, to July 15, 2020. Taxpayers can also... governor.alabama.gov", "2020-03-23T15:37:22.000Z": "Currently on a call with legislators, cabinet members and Dr. Scott Harris sharing updates on what the administration is doing to assist the people of Alabama during this #Coronavirus pandemic. We'll get through this, folks! @ALPublicHealth  #alpolitics", "2020-03-22T15:42:22.000Z": "I am grateful for your organization as you help us dissimenate critical messages to our citizens during these challenging days. The public relies upon honest, forthright messaging. To all journalists and media outlets out there, thank you! Quote Tweet Alabama News Network @ALNewsNetwork Thank You! Alabama News Network says thank you to those working in government, both elected leaders and their staff, for responding to this pandemic.\nWho are you thankful for? #thankyou  #government", "2020-03-21T02:08:53.000Z": "Due to the large amount of speculation regarding #COVID19 , this is a reminder to rely on OFFICIAL sources for accurate information.\n\nHelp control the spread of rumors by sharing this page: https:// fema.gov/coronavirus-ru mor-control ", "2020-03-22T15:26:44.000Z": "We are with you, Mr. President! #Teamwork Quote Tweet Donald J. Trump @realDonaldTrump Working very well with States and our Nation's Governors. #TEAMWORK", "2020-03-21T21:26:53.000Z": "We have a lot of resources on our COVID-19 resource page.  We just updated our unemployment compensation FAQ's and added info regarding federal paid leave and FLMA expansion.\nClick the link below. https:// labor.alabama.gov/covid19resourc es.aspx   @ADOLSecretary  @GovernorKayIvey  @NASWAORG  @ALWorksSystem", "2020-03-21T15:12:25.000Z": "Small businesses across our state have taken a hard hit from the #Coronavirus outbreak. The @SBAgov is now accepting loan applications for small businesses needing assistance during this pandemic. https:// governor.alabama.gov/newsroom/2020/03/gov-ivey-alabama-small-businesses-can-seek-sba-covid-19-disaster-loans/   #alpolitics  @POTUS  @MadeinAL  @nfib_al  @BCAToday  @EDAAinfo Gov. Ivey: Alabama small businesses can seek SBA COVID-19 disaster loans - Office of the Governor... MONTGOMERY - Governor Kay Ivey announced today that small businesses across Alabama negatively impacted by the coronavirus pandemic are eligible for assistance under the U.S. Small Business Adminis... governor.alabama.gov", "2020-03-20T22:44:13.000Z": "I have authorized the @AlabamaNG to activate up to 100 guardsmen, should the need arise to combat #COVID19 . There is no plan for the Guard to operate as any type of law enforcement of public health orders. Read my full statement here: https:// governor.alabama.gov/newsroom/2020/03/governor-ivey-issues-statement-on-authorization-of-alabama-national-guard-on-as-needed-basis/  . #alpolitics", "2020-03-20T21:47:15.000Z": "Be sure to watch @CBS_42 at 5 p.m. today to see Commerce Secretary @gregcanfield 's live interview regarding the impact #Coronavirus is having on Alabama's economy. @MadeinAL  #alpolitics", "2020-03-20T19:52:41.000Z": "ADOL is aware of issues regarding online filing. We are working to correct the issue as quickly as possible. Thank you for your patience.", "2020-03-20T20:31:45.000Z": "Tonight @ 7:30 was on @CapitolJournal : @ALPublicHealth Officer Dr. Scott Harris on a doubling of AL coronavirus cases; @al_labor Secretary Fitzgerald Washington on virus-related jobless claims; @alasecofstate  @JohnHMerrill on postponing runoff elections. #alpolitics", "2020-03-20T19:13:41.000Z": "As events continue to unfold at a rapid pace, I want to remind all Alabamians that we are family; there is no better time, than now, for our family to come together, be strong & stand united. https:// youtu.be/RwWqY7Iw0UM  #Coronavirus  #alpolitics  #COVID19 Gov. Ivey Encourages Alabamians Amid Coronavirus Pandemic Gov. Ivey provides Alabamians with an encouraging message amid the Coronavirus pandemic. (Governor's Office, Lori Davis Jhons) youtube.com", "2020-03-20T19:10:16.000Z": "#alpolitics", "2020-03-20T19:06:13.000Z": "As our state works in overdrive to respond to the #Coronavirus pandemic, we're making decisions based on the best information we have in the moment. Please read my full statement regarding an update to the state health order: https:// governor.alabama.gov/newsroom/2020/03/governor-ivey-issues-statement-on-updated-statewide-public-health-order/  . #alpolitics  @ALPublicHealth Governor Ivey Issues Statement on Updated Statewide Public Health Order - Office of the Governor of... MONTGOMERY - Governor Kay Ivey and the Alabama Department of Public Health (ADPH) on Friday issued an update to the statewide health order to aid in Alabama's efforts to contain the spread of the... governor.alabama.gov", "2020-03-20T18:55:29.000Z": "My team & I continue to work with @SBAgov to get our small businesses the assistance they need during this pandemic. We're still awaiting final approval on our request for Disaster Assistance. We'll update our stakeholders on any new developments. @MadeinAL  @nfib_al  @EDAAInfo", "2020-03-20T17:16:52.000Z": "Being at home doesn't mean learning has to slow down. Our #BornReady initiative has a list of resources available for parents to use to teach their children & keep them engaged with educational opportunities at home. #StrongStartStrongFinish  @AL_DECE COVID-19 Resources Helping Families Talk with Their Children About COVID-19 bornready.org", "2020-03-20T16:14:53.000Z": "While much of our attention has rightfully been focused on the #Coronavirus outbreak, the #2020Census remains as important as ever to AL. I encourage you to visit http:// my2020census.gov , call 1-844-330-2020 or fill out the paper form today! @AlabamaCounts  @ADECA  #AlabamaCounts", "2020-03-20T15:13:52.000Z": "What a lovely idea! Let's remember those who can be the most isolated during the #COVID19 pandemic. #alpolitics Quote Tweet Trisha Powell Crain @Trish_Crain 'This letter will cheer you up': Alabama students write nursing home residents notes of encouragement. Keep up the great work, friends. https:// al.com/news/2020/03/t his-letter-will-cheer-you-up-alabama-students-write-nursing-home-residents-notes-of-encouragement.html ", "2020-03-19T21:54:54.000Z": "Thank you @ALPowerFdn & the Alabama Business Charitable Trust Fund for stepping up to help your fellow Alabamians. This is a great example of neighbors helping neighbors during this challenging time. #Coronavirus  #COVID19  #alpolitics Quote Tweet Alabama NewsCenter @alnewscenter Alabama Power Foundation, ABC Trust pledge $1 million to support COVID-19 relief efforts https:// alabamanewscenter.com/2020/03/19/ala bama-power-foundation-abc-trust-pledge-1-million-to-support-covid-19-relief-efforts/   @alabamapower  @ALPowerFdn  @spann  @ALWorksSystem  @MadeinAL  #powerofgood", "2020-03-19T19:06:33.000Z": "Despite our best efforts, the threat of the #COVID19 virus continues to spread &, unfortunately, we've not yet reached peak impact. Therefore, I've issued a statewide health order to aid our efforts to contain the spread of #Coronavirus . @ALPublicHealth Governor Ivey Issues Statement on Statewide Public Health Order - Office of the Governor of Alabama MONTGOMERY - Governor Kay Ivey and the Alabama Department of Public Health (ADPH) on Thursday issued a statewide health order to aid in Alabama's efforts to contain the spread of the Coronavirus... governor.alabama.gov", "2020-03-19T17:16:19.000Z": "Tune in for an Alabama #Coronavirus update at 2 p.m. today. #alpolitics  #COVID19  @CDCgov Quote Tweet Alabama Public Health @ALPublicHealth State Health Officer Dr. Scott Harris will provide an update on #COVID19 in Alabama during a news conference at 2 p.m. CT today. Watch it live at http:// alabamapublichealth.gov/alphtn .", "2020-03-19T17:09:10.000Z": "Here's a helpful map regarding the new primary election date of July 14, 2020. Take a look below to make sure you are prepared for the elections in your county. @alasecofstate  #alpolitics  https:// governor.alabama.gov/newsroom/2020/03/governor-ivey-announces-new-primary-runoff-election-date/ ", "2020-03-19T15:05:28.000Z": "The link below is a great resource about our nation's #Coronavirus response. It covers what small businesses, seniors, & workers need to know about recently passed Congressional legislation & what @POTUS has done to help Americans fight this pandemic. FAQ: Coronavirus Legislation - Ways and Means Republicans Ways and Means Republicans assembled a comprehensive FAQ to help explain how the federal government is responding to the coronavirus pandemic. It covers what small businesses, seniors, and workers... gop-waysandmeans.house.gov", "2020-03-18T21:14:28.000Z": "During the short-term closure of Alabama schools, students in need of breakfast & lunch can receive them free at sites across the state until April 6. No paperwork is required. Learn more here: http:// breakforaplate.com . @AlabamaAchieves  #alpolitics  #COVID19 Summer Food Service Program Alabama | Kids Free Lunch | Break for a Plate Alabama kids eligible for free school lunch programs can eat healthy meals through the free summer food service program Break for a Plate. breakforaplate.com", "2020-03-18T15:32:57.000Z": "Exercising my powers under the Emergency Management Act, I'm setting AL's Primary Runoff Election for July 14. The ability to hold free & fair elections is an inherent right as American citizens, but the safety & wellbeing of AL citizens is paramount. https:// governor.alabama.gov/newsroom/2020/03/governor-ivey-announces-new-primary-runoff-election-date/ ", "2020-03-17T20:38:51.000Z": "My team & I are working closely w/ @SBAgov to activate the Economic Injury Disaster Loan (EIDL) program in our state. We stand by #SmallBusiness & are ready to help. Grateful for the response by @POTUS & the SBA. #alpolitics Coronavirus (COVID-19) SBA Disaster Assistance in Response to the Coronavirus sba.gov", "2020-03-17T14:32:41.000Z": "To be cautious, @ALPublicHealth issued updated guidelines to aid in AL's efforts to flatten the curve amidst #COVID19 . I'm encouraged to see many of our citizens voluntarily self-regulating. Adhering to smart protocol & practicing a little patience will pull us through this.", "2020-03-17T01:44:18.000Z": "The Alabama Department of Labor is modifying existing unemployment compensation rules to allow workers to file a claim for unemployment compensation benefits who are affected by #COVID19 ... @al_labor  #alpolitics Alabama announces support for workers impacted by COVID-19 The Alabama Department of Labor is modifying existing unemployment compensation rules to allow workers to file a claim for unemployment compensation benefits who are affected by COVID-19. wsfa.com", "2020-03-16T20:47:48.000Z": "https:// labor.alabama.gov/news_feed/News_Page.aspx?id=201  Please click above for more information about filing for unemployment compensation benefits for workers impacted by COVID-19.", "2020-03-16T21:27:23.000Z": "Many changes are happening quickly with regards to Alabama's workforce, and it's important to ensure that we are offering as many available options to those who find themselves in different employment situations. #alpolitics  #COVID19 ... @al_labor  What happens if you lose your job due to coronavirus? Alabama officials provide some answers The Alabama Department of Labor is out with a FAQ for workers worried about their possible next steps. al.com", "2020-03-16T21:04:27.000Z": "More helpful #COVID19 information is available at https:// cdc.gov/coronavirus/20 19-ncov/index.html  . \n\nYou can also visit the @ALPublicHealth website http:// alabamapublichealth.gov/infectiousdise ases/2019-coronavirus.html  . @CDC  @POTUS  #alpolitics Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-03-16T20:56:03.000Z": ". @POTUS just released further recommendations regarding #COVID19 . Please help spread this important information. Remember, if you feel sick, stay home.  Do not go to work. Contact your medical provider. @ALPublicHealth  @CDCgov  #alpolitics Quote Tweet Donald J. Trump @realDonaldTrump", "2020-03-16T20:29:46.000Z": "I ask all Americans to band together and support your neighbors by not hoarding unnecessary amounts of food and essentials. TOGETHER we will stay STRONG and overcome this challenge!", "2020-03-16T18:30:59.000Z": "Thank you, Pastor ... @Chris_Hodges , for the efforts of @highlandsAL during the #COVID19 pandemic. You are ministering to the physical, emotional and spiritual well-being of Alabamians. God bless you and the many members of The Church of the Highlands! https:// al.com/news/2020/03/c hurch-of-the-highlands-opens-covid-19-testing-site.html ", "2020-03-16T18:21:00.000Z": "As we all adapt to taking precautions for #Coronavirus , I want to remind our citizens that grocery stores aren't shutting down. Let's all be responsible & only get what is needed. Grocers are doing their best to restock, but we mustn't let fear cause a panic. #alpolitics  @POTUS", "2020-03-16T13:39:01.000Z": "https:// labor.alabama.gov/news_feed/News_Page.aspx ", "2020-03-16T16:05:42.000Z": "Alabamians, please review @ALPublicHealth 's latest recommendations regarding #COVID19 . Stay informed & practice good hygiene. #alpolitics  @CDCgov Quote Tweet Alabama Public Health @ALPublicHealth ADPH is offering new recommendations regarding public gatherings in response to #COVID19 . Read our full #NewsRelease at http:// go.usa.gov/xdeQu . #coronavirus", "2020-03-15T22:08:25.000Z": "Employees should plan to return to regular work schedules on Monday, April 6. For more information, please contact your immediate supervisor or department head. While out of the office, please continue the practice of sound hygiene and social distancing. #COVID19  #alpolitics", "2020-03-15T22:06:10.000Z": "Effective on Monday, March 16, I will be authorizing agency directors to implement telework, flexible work schedules and practice social distancing for the next three weeks. #alpolitics  #COVID19", "2020-03-15T22:04:44.000Z": "Departments providing public safety, direct care, and other essential services must plan and schedule their activities accordingly, with the directors of depts determining the staffing to ensure the continued operation of essential and emergency services. #alpolitics  #COVID19", "2020-03-14T12:57:27.000Z": "If a person has questions about being tested for #COVID19 , they should call their doctor to make arrangements for testing. If you don't have a healthcare provider, please call 1-888-264-2256, starting today at 8:00 a.m. @ALPublicHealth  @CDCgov  #alpolitics  http:// alabamapublichealth.gov/infectiousdise ases/2019-coronavirus.html ", "2020-03-14T01:14:46.000Z": "ICYMI: Earlier today, I held a press conference to provide Alabamians with an update about the #Coronavirus . You can view the State of Emergency I issued here: https:// governor.alabama.gov/newsroom/categ ory/state-of-emergency  . @ALPublicHealth  @AlabamaAchieves  @AlabamaEMA  @CDCgov  #alpolitics  https:// youtube.com/watch?v=wMsa5i ecf6A ", "2020-03-13T22:29:05.000Z": "Alabamians should not be fearful, but instead, use commonsense to watch out for themselves & others. We'll remain engaged & continue to closely monitor the situation to help keep Alabamians informed on all of the facts. @ALPublicHealth  @AlabamaAchieves  @AlabamaEMA  #alpolitics", "2020-03-13T22:24:12.000Z": "I'm issuing a State of Emergency to strengthen AL's efforts & plans already in place to deal with the #Coronavirus . This will help to alleviate our health care facilities & providers, our schools, & in turn, citizens across the state. @ALPublicHealth  @AlabamaAchieves  #alpolitics", "2020-03-13T21:44:43.000Z": "Tune in for an official #Coronavirus update at 5 p.m. today. Quote Tweet Alabama Public Health @ALPublicHealth . @GovernorKayIvey is holding a joint press conference on #COVID19 with ADPH and @AlabamaAchieves at 5 p.m. (CT) today. You can watch it live at http:// alabamapublichealth.gov/alphtn . Several news stations will be providing a live feed on television, as well as, their Facebook pages.", "2020-03-13T14:55:24.000Z": "Alabama has confirmed its first #Coronavirus case. Please see my full statement below. Learn more here: https:// governor.alabama.gov/newsroom/2020/03/governor-ivey-releases-statement-on-alabamas-first-confirmed-coronavirus-case/  . @ALPublicHealth will have a live press conference at 10 a.m. today. @CDCgov  @WhiteHouse  #alpolitics", "2020-03-13T00:00:28.000Z": "This is awesome news for the future of Alabama's workforce! #StrongStartStrongFinish  #alpolitics  @ALWorksSystem  @MadeinAL  @aidtedu  @al_labor Quote Tweet Josh Laney @LaneyWorks And just like that, the Alabama Office of Apprenticeship is now a federally recognized State Apprenticeship Agency! I am sincerely thankful for all the help and support from the many individuals who made this possible. @GovernorKayIvey  @ALWorksSystem  @aidtedu  @SenatorAOrr", "2020-03-12T20:06:05.000Z": "I'm asking that each & every Alabamian do their part not only by filling out their own census forms, but by urging their family members, friends, & neighbors to do the same. Let's make sure #AlabamaCounts in the #2020Census ! #alpolitics  @AlabamaCounts  @uscensusbureau  @ADECA", "2020-03-12T20:05:03.000Z": "An accurate #2020Census count will have a direct impact on our state's representation in Congress, as well as billions of dollars in federal funding that affect schools, community programs, health care, & job opportunities in Alabama. #AlabamaCounts  #alpolitics  @AlabamaCounts", "2020-03-12T20:02:48.000Z": "Next week, Alabamians will begin receiving letters from the @uscensusbureau telling them that it's time to participate in the #2020Census . I can't emphasize enough the importance of what a full & accurate count means for our state. #ALCounts  #alpolitics  https:// governor.alabama.gov/newsroom/2020/03/gov-kay-ivey-formally-launches-census-2020-in-alabama/ ", "2020-03-12T15:57:24.000Z": ". @ALPublicHealth has helpful information about the #Coronavirus on its website. Please review, stay aware of the latest news & take extra measures to reduce the risk of being exposed to #COVID19 . Share these resources! @CDCgov  @WhiteHouse  #alpolitics  http:// alabamapublichealth.gov/infectiousdise ases/2019-coronavirus.html ", "2020-03-12T14:47:25.000Z": "Over the last year, several tragedies have reminded us of the danger & sacrifices those in the public safety community face. Today, I've joined the AL Public Safety Leadership Academy to encourage them to continue being exemplary citizens & to thank them for their service.", "2020-03-12T14:00:45.000Z": "Today marks one year since I signed the #RebuildAL Act! With the support of the Legislature, AL is already reaping the benefits. When fully implemented, it'll generate about $300 M a year that'll be directly invested in our roads & bridges. #alpolitics Governor Ivey Signs the Rebuild Alabama Act - Office of the Governor of Alabama Governor Kay Ivey on Tuesday, March 12, 2019, held a bill signing ceremony for the Rebuild Alabama Act, which was passed by the Alabama Senate earlier in the day and the Alabama House of Representa... governor.alabama.gov", "2020-03-11T19:17:13.000Z": "Welcome to the Capitol, Leadership Huntsville! It's always important for local leaders to make their way to the Capital City to not only see how their state government works but to be a part of the process. Keep up the great work in @huntsvillecity ! @huntsvillealcoc", "2020-03-11T17:23:50.000Z": "I'm pleased to address the @huntsvillealcoc today! For many decades, @huntsvillecity & @MadisonAlabama alike have experienced unprecedented growth in a variety of sectors. These cities play a big part in AL's success, & I'm excited to continue growing this partnership.", "2020-03-11T16:43:03.000Z": "The @NatlBlueRibbon School flag is widely recognized as a symbol of exemplary teaching & learning. I'm proud to join the @4PCAPanthers to celebrate this distinguished designation. From their Idea Lab to their resource program, PCA is committed to growing our future leaders.", "2020-03-11T15:26:43.000Z": "As the U.S. monitors #COVID19 , I want to thank @POTUS & @VP Pence for their quick response to states' efforts. AL has no known #COVID19 cases, but we've established a #Coronavirus Task Force to facilitate any needed response. The safety of all Americans is paramount. #alpolitics", "2020-03-10T22:00:38.000Z": "Be sure to tune it to the @MAShow995 for my interview tomorrow morning at 8:30. We'll be discussing Alabama's newly formed Coronavirus Task Force & our ongoing #Coronavirus preparation efforts. #alpolitics", "2020-03-10T15:00:01.000Z": "We're inching closer to the October 1, 2020 STAR ID deadline. Get yours today by visiting an @ALEAprotects exam office. Save time by registering for an appointment. Learn more here: https:// waff.com/2020/02/06/ale a-trooper-answers-your-star-id-questions/?fbclid=IwAR20uGhzw2Bk1syEgfPcjTdUAOrrB-8HPrMDfFfhxaVwGA7jCIqvqZt17jc  . #alpolitics", "2020-03-09T21:53:45.000Z": "Amazing rescue, @ALEAprotects ! Great job to your team & everyone that helped assist, including members of the Gurley Police Department, Huntsville Fire & Rescue, & Huntsville Emergency Medical Services Inc. @huntsvillecity Quote Tweet Alabama Law Enforcement Agency @ALEAprotects On March 7th, ALEA's Aviation Unit rescued a paraglider who was stranded in a tree for 4 hours near Gurley. Check out this video to see ALEA's Aviation Unit in action & the rescue of the paraglider. For more information on Saturday's rescue, visit https:// tinyurl.com/qufq97d . #ALEA", "2020-03-09T20:39:36.000Z": "The #2020Census is coming! Are you ready? https:// alabamanewscenter.com/2020/03/09/get -ready-2020-census-is-headed-your-way/   #AlabamaCounts  @ADECA  @AlabamaCounts  @uscensusbureau Get ready: 2020 census is headed your way - Alabama NewsCenter Census is being mailed out beginning this week. alabamanewscenter.com", "2020-03-09T17:13:40.000Z": "I also enjoyed touring Career Academies of Decatur, which is giving students the chance to earn industry-recognized credentials. This is exactly what my #StrongStartStrongFinish education initiative is all about - making sure our youth are ready for careers after graduation.", "2020-03-09T16:35:16.000Z": "At my second stop in @CityofDecaturAL , I got to see how the Learning Blade program is preparing students at Austin Middle School for exciting careers in #STEM & #CS . Thank you @boeing for investing in the future of Alabama! #GovIveyforCS", "2020-03-09T15:48:50.000Z": "I just wrapped up my tour of the @cookmuseum , & I see why it's one of the @10Best new museums! It provides students with an opportunity to explore natural science and develop #STEAM skills. I encourage everyone to visit it in @CityofDecaturAL ! @TweetHomeAla", "2020-03-08T15:22:18.000Z": "Over the past 200 years, Alabama has proudly produced many trailblazing women. As only the second female governor of our state, I'm proud to proclaim that sometimes the best man for the job is a woman! Happy #InternationalWomensDay ! #IWD2020  #WomensHistoryMonth", "2020-03-06T16:25:13.000Z": "To honor his heroism, I presented Ensign Watson's family with the Governor's Medal Cross. This is one of the highest honors one can receive for going above the call of duty & is the first time I've ever presented it. @USNavy  @AlabamaNG", "2020-03-06T16:24:34.000Z": "Today, I've joined the family of Ensign Joshua Kaleb Watson to ceremoniously add his name to the Alabama Fallen Heroes Memorial. On Dec. 6, 2019, Ensign Watson died trying to protect his fellow service members during the Naval Air Station Pensacola shooting. @USNavy  @AlabamaNG", "2020-03-06T16:00:49.000Z": "While there are no known cases in AL, I've gathered the experts in an effort to be as prepared as possible should the Coronavirus affect AL. The safety of Alabamians is paramount, & we'll do everything we can to limit exposure to this illness. #alpolitics  https:// governor.alabama.gov/newsroom/2020/03/governor-ivey-establishes-coronavirus-covid-19-task-force/ ", "2020-03-05T19:16:27.000Z": "It's always great to spend time with my @AuburnU family! Auburn helped prepare me to be where I am today, and I'll forever be grateful. I'm proud to see so many passionate young folks in our Capital City advocating for this fine institution of higher learning. #WarEagle", "2020-03-05T18:28:58.000Z": "These retired Tuskegee Airmen deserve the highest praise for their service to our country. Their names are Lt. Col. George Hardy, Lt. Col. James Harvey and Lt. Col Ted Lumpkin. We salute your service! @usairforce  @TuskegeeUniv  @NatlParkService", "2020-03-05T18:27:51.000Z": "The Tuskegee Airmen are the epitome of bravery & excellence. Alabama is proud to be the home of this distinguished group of WWII service members. It's my honor to meet these veterans & to proclaim Tuskegee Airmen Day as March 7. https:// governor.alabama.gov/newsroom/2020/03/tuskegee-airmen-day/   @TuskegeeUniv  @usairforce", "2020-03-04T22:13:33.000Z": "Way to go, Alabama! These Top 10 rankings are a direct result of the hard work of our economic development team, our pro-business climate & our strong workforce programs. We had a great deal of success in 2019, & we are focused on continuing that in 2020. #MadeinAL  @SiteSelection Quote Tweet Made in Alabama @MadeinAL Alabama earns two Top 10 rankings in @SiteSelection 2019 Governor's Cups http:// bit.ly/2x60FtT", "2020-03-04T16:46:16.000Z": "Establishing AL's Center of Excellence marks a milestone in AL's ongoing recovery from the 2010 Deepwater Horizon Oil Spill. This center will be a great resource for keeping our Gulf & beaches healthy & prosperous. #alpolitics  @Outdoor_Alabama  @USTreasury  @mobilebaynep Quote Tweet Dauphin Island Sea L @disealab We are honored to announce the Dauphin Island Sea Lab is home to Alabama's Center of Excellence. http:// ow.ly/Qq6u50yCL7X", "2020-03-04T15:39:00.000Z": "It's my pleasure to join the Bates family in Greenville this morning to celebrate the 50th anniversary of Bates House of Turkey! For 70 years, the Bates family has generously provided the turkeys for our annual Thanksgiving turkey pardoning ceremony.", "2020-03-04T12:22:47.000Z": "Great news! @SenShelby Quote Tweet Richard Shelby @SenShelby Today I met with Col. Sebastien Joly with the US Army Corps of Engineers, Mobile District. As we discussed the deepening & widening of the #PortofMobile , he let me know that everything is on schedule. This project will revolutionize the entire state! Looking forward to it.", "2020-03-03T18:18:21.000Z": "Thank you for remembering those we lost, Mr. President. Praying for our neighbors.  @POTUS  @GovBillLee  #PrayForNashville  #NashvilleStrong  #LeeCountyStrong Quote Tweet Donald J. Trump @realDonaldTrump #PrayForNashville", "2020-03-03T15:10:54.000Z": "Today's the day - join me in voting #Yes4Amendment1 ! Let's take the FIRST step in lifting up Alabama's schools from LAST in the nation. #alpolitics  #aledchat  #SBOE  #ALSBOE", "2020-03-03T14:47:32.000Z": "#LeeCountyStrong   @POTUS  @RealDonaldTrump  @FLOTUS  @WhiteHouse  @AlabamaEMA  @LeeCountyEOC  @SmithsStationAL  @fema  @femaregion4  @SecretaryCarson  @SenShelby  @SenDougJones  @RepMikeRogersAL President Trump's Remarks at Lee County Neighborhood Lee County, Alabama youtube.com", "2020-03-03T14:46:29.000Z": "https:// governor.alabama.gov/newsroom/2020/03/march-3-2019-day-of-remembrance/   #LeeCountyStrong  @LeeCountyEOC  @lcsoal @SmithStationAL @AlabamaEMA March 3, 2019 Day of Remembrance - Office of the Governor of Alabama governor.alabama.gov", "2020-03-03T14:46:09.000Z": "I've ordered flags be lowered in AL today for March 3, 2019 Day of Remembrance. One year ago, devastating tornadoes struck Lee Co., killing 23 people. I encourage all Alabamians to reflect upon the memory of those we lost & to keep Lee Co. in your prayers. Gov. Ivey Tours Tornado Damage in Beauregard Governor Kay Ivey on Wednesday, March 6, 2019 did a flyover and walking tour of the destruction caused by the devastating storms and tornadoes on March 3, 20... youtube.com", "2020-03-03T14:07:00.000Z": "It's time to #GoVote in the Alabama primary! Make it a priority for you and everyone you know to head to the polls today before 7 p.m. Find your polling place here: https:// myinfo.alabamavotes.gov/VoterView/Regi strantSearch.do  . #alpolitics  #Vote  #Yes4Amendment1  #SuperTuesday", "2020-03-03T12:50:01.000Z": "I'm incredibly sad to wake up to the news of the deadly storm that moved through Nashville late last night. Alabama will be praying for our neighbors in TN in the days to come. #tnwx  #nashvilletornado  @GovBillLee", "2020-03-03T04:19:59.000Z": "#Yes4Amendment1  #alpolitics Quote Tweet Alabama Policy Institute @alabamapolicy \"If the team is losing you fire the coach. If the war is being lost you fire the general. And if you rank last among all 50 states in education you look for transformative change in education leadership.\"\n\nThe latest from @SenPhilWilliams :\n\n--> https:// bit.ly/2PDYmoA  #alpolitics", "2020-03-02T20:08:22.000Z": "AL is tired of being last in the nation in education. Let's take a step in the right direction by voting #Yes4Amendment1 tomorrow! Thank you to @alfaFarmers & members of the \"Yes for the Best Education\" committee for your support. #alpolitics  #aledchat ALFA urges Alabamians to vote 'Yes' on Amendment One The Alabama Farmers Federation (ALFA) is urging the citizens of Alabama to vote \"Yes\" on Amendment One when they go yellowhammernews.com", "2020-03-02T18:17:47.000Z": "Don't forget to #GoVote in tomorrow's primary election! Polls will be open from 7 a.m. to 7 p.m. Find your polling place here: https:// myinfo.alabamavotes.gov/VoterView/Regi strantSearch.do  . #alpolitics  #Vote  #Yes4Amendment1  #SuperTuesday", "2020-03-02T16:21:06.000Z": "It's #ReadAcrossAmericaDay ! Time to celebrate by picking up a book & promoting the importance of literacy. Establishing good reading habits now is essential to helping our youth reach their full potential! #StrongStartStrongFinish  #aledchat", "2020-03-02T15:52:07.000Z": ". @GovernorKayIvey has awarded grants totaling $86,874 to assist four police departments in south Alabama with equipment upgrades. http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=13705 ", "2020-03-02T15:09:19.000Z": "Secretary of State @JohnHMerrill partners with @GovernorKayIvey and the AL Department of Transportation to promote participation in Super Tuesday Election. - https:// mailchi.mp/sos/secretary- of-state-works-with-other-state-agencies-to-promote-voter-participation-in-march-3-election-nei93a0mzw ", "2020-03-02T15:00:53.000Z": "Amendment One ends political campaigning for State School Board seats by replacing the Board with a Commission of nine term-limited members. Our children deserve better. Vote #Yes4Amendment1 tomorrow! #alpolitics  #aledchat  #SBOE  #ALSBOE", "2020-03-01T19:32:30.000Z": "Amendment One specifically requires the new Commission to adopt education standards to replace the common core. It's written in the Amendment. Read it here: http:// arc-sos.state.al.us/ucp/B19151AA.A K7.pdf  . \n\nVote #Yes4Amendment1 on March 3! #alpolitics  #aledchat  #SBOE  #ALSBOE", "2020-03-01T16:05:12.000Z": "Let's put our children first by voting #Yes4Amendment1 on March 3! Instead of campaigning for Board seats, the nine term-limited members are appointed by the governor & approved by the Senate. #alpolitics  #aledchat  #SBOE  #ALSBOE", "2020-03-01T15:26:18.000Z": "Today commemorates the 55th Anniversary of #BloodySunday . Let us never forget this pivotal moment in our nation's history and the sacrifices of the heroes that pressed forward despite such adversity. http:// alabamalegacy.org/selma-montgome ry-march/   #Selma55  #BridgeCrossingJubilee Selma-Montgomery March | Alabama Legacy Moments The 1965 Selma to Montgomery March was the climactic event of the Selma voting rights movement. On February 18 Jimmie Lee Jackson was shot and killed by police during demonstrations [more] alabamalegacy.org", "2020-02-29T21:21:52.000Z": "Yes vote on Amendment 1 gives AL a chance to finally improve education for our children.  We cannot keep doing the same thing and expect a different result. It's not about anyone's rights, it's about what's best for students! #Yes4Amendment1 Quote Tweet Governor Kay Ivey @GovernorKayIvey Alabama cannot afford to continue down the same road, if we truly want to improve our education system. The time is NOW to take control of our children's future. Vote #Yes4Amendment1 on March 3! #alpolitics  #aledchat  #SBOE  #ALSBOE", "2020-02-29T19:46:47.000Z": "Alabama cannot afford to continue down the same road, if we truly want to improve our education system. The time is NOW to take control of our children's future. Vote #Yes4Amendment1 on March 3! #alpolitics  #aledchat  #SBOE  #ALSBOE", "2020-02-29T17:15:36.000Z": "Vote #Yes4Amendment1 ! #alpolitics  #ALSBOE  #SBOE  #aledchat Amendment One puts kids first, politicians last When Alabamians take the to the polls on Super Tuesday, they will either be concerned with the Democratic nominee for yellowhammernews.com", "2020-02-29T16:04:28.000Z": "Vote #Yes4Amendment1 on March 3! The new members serve for six-year terms & can serve no more than two terms unlike current Board members, including one who has been on the Board for over 25 years. https:// al.com/opinion/2020/0 2/vote-yes-on-amendment-i-keep-alabamas-schools-progress-alive-says-former-schools-board-member.html   #alpolitics  #aledchat  #SBOE  #ALSBOE  @MaryScottHunter Vote 'Yes' on Amendment I says former State School Board Member An elected board tends to be swayed by a few special interests, tends to be chaotic, and has failed to keep pace with states whose students are getting educational advantages that our kids are not. al.com", "2020-02-29T00:54:13.000Z": "Congratulations to Acclinate Genetics on being selected as one of @EDPAlabama 's winners of the Alabama Launchpad 2020 event! We're proud of your work & for teaming up with @AlabamaGOMA to support our Alabama HBCU Co-Op Program. @AcclinateG  #alpolitics Two companies win Launchpad Montgomery pitch contest Two companies won a total of $150,000 in the finale pitch competition Thursday in Montgomery. al.com", "2020-02-28T20:18:12.000Z": "AL is one of only six states to still hold elections for State School Board. All our neighboring states have already ended the practice of letting elected politicians run for the Board. We need stability & accountability. Vote #Yes4Amendment1 on March 3! #alpolitics  #aledchat", "2020-02-28T20:03:24.000Z": "Tune in to @ALReporter 's \"The V\" this Sunday at 11 a.m. to catch my interview with Bill Britt. We'll be discussing the legislative session and our bipartisan priorities of criminal justice reform, mental health accessibility & gambling policy. #alpolitics", "2020-02-28T14:59:52.000Z": "Voting #Yes4Amendment1 assures rural communities & minorities Board representation since the new members must reflect the geographic, gender, & racial composition of AL's students in public K-12 education. It's in writing; read it -> http:// arc-sos.state.al.us/ucp/B19151AA.A K7.pdf  . #alpolitics  #aledchat", "2020-02-28T14:21:02.000Z": ". @BEAAlabama is spot on. My admin is doing everything we can to provide Alabamians with more career opportunities, but we need help & funding, if we're going to reach AL's post-secondary attainment goal. #StrongStartStrongFinish  #alpolitics  @ALWorksSystem  @PARCAlabama  @aplusala Quote Tweet BEA Alabama @BEAAlabama Alabama Voices: More collaboration, alignment needed to reach state workforce goals https:// montgomeryadvertiser.com/story/opinion/ 2020/02/27/alabama-voices-more-collaboration-alignment-needed-reach-state-workforce-goals/4896526002/  via @mgmadvertiser", "2020-02-27T22:13:14.000Z": "I tasked the Criminal Justice Study Group with the mission of finding data-driven solutions to our longstanding challenges in our prison system. I'm proud of their efforts, & I'm proud to support their recommendations through this bill package. https:// governor.alabama.gov/newsroom/2020/02/governor-ivey-announces-support-for-bill-package-of-study-group-for-criminal-justice-policy-recommendations/   #alpolitics", "2020-02-27T21:02:39.000Z": "For us to prepare today's students for tomorrow's opportunities, it is time we get serious: It's time for creativity. It's time for accountability. It's time for stability. It's time to vote #Yes4Amendment1 on March 3! #alpolitics  #aledchat  #SBOE  #ALSBOE  @AlfaFarmers Quote Tweet Yellowhammer News @yhn . @AlfaFarmers ' Jimmy Parnell: Vote 'Yes' for better education #alpolitics  https:// yellowhammernews.com/jimmy-parnell- vote-yes-for-better-education/ ", "2020-02-27T20:40:55.000Z": "#Yes4Amendment1 Quote Tweet The Chamber @chambertusc On March 3, Alabama voters will vote on changing our state board of education to appointed, rather than elected. Today, the Chamber's Board of Directors unanimously endorsed Amendment One, and encourages you to vote yes on Tuesday. #Education  #Workforce  #Progress", "2020-02-27T18:46:31.000Z": "AL's 14 public colleges & universities are essential to the future of our state! I'm pleased to see so many students committed to helping their institutions grow & thrive. I'm proud of what they're accomplishing, & I encourage them to bring that same commitment to our workforce.", "2020-02-27T18:13:31.000Z": "We're celebrating #ArborDay by planting a tree on the capitol grounds to serve as a reminder of the importance of caring for our environment. Congratulations to these young folks for winning the 2020 @ACESedu poster contest & for being conservation advocates! @AlabamaAchieves", "2020-02-27T15:08:11.000Z": "Amendment One will bring much-needed, stable leadership to the Alabama Department of Education which has seen five state superintendents in the last four years. It's time to take control of our children's future by voting #Yes4Amendment1 on March 3! #alpolitics  #aledchat  #SBOE", "2020-02-27T00:11:15.000Z": "#yes4Amendment1 Quote Tweet huntsvillealcoc @huntsvillealcoc Tuesday's ballot in Alabama will include a proposal to change our state board of education from elected to appointed. The Huntsville/Madison County Chamber announces our support of Amendment One: https:// hsvchamber.org/huntsville-mad ison-county-chamber-announces-support-of-amendment-one/ ", "2020-02-26T20:17:09.000Z": "Amendment One improves education by requiring the new Commission to develop programs for teacher certification, professional development, student assessment and accountability. #Yes4Amendment1  #alpolitics  #aledchat  #SBOE  #ALSBOE", "2020-02-26T20:16:17.000Z": "Voting #Yes4Amendment1 is the FIRST step in lifting up Alabama's schools from LAST in the nation. Local school boards will still control their districts & decision-making. This will not change. Vote #Yes4Amendment1 on March 3! #alpolitics  #aledchat  #SBOE  #ALSBOE", "2020-02-26T19:02:45.000Z": "I'm honored to be in @tuscaloosacity to celebrate one remarkable woman. Lt. Kayla Freeman is the first African-American woman helicopter pilot to serve in the @AlabamaNG . After flying 250 missions in Iraq, I'm proud to present her with the 2019 Veteran of the Year Award.", "2020-02-26T17:03:15.000Z": "It's centers like this that are going to help us reach our goal of adding 500,000 highly credentialed workers to the labor force by 2025. @Pickens4C  #StrongStartStrongFinish  @ACCS_Education  @ALWorksSystem  @alabamacte  @sealaworks", "2020-02-26T17:02:39.000Z": "I'm grateful I had the opportunity to visit the Pickens County College & Career Center this morning. From agriscience to health care, I was impressed to see these high school students engaged in a variety of CTE programs. @Pickens4C  #StrongStartStrongFinish", "2020-02-26T14:58:09.000Z": "Our @ADOLSecretary did a great job promoting our awesome Department of Labor! If you're a job seeker, visit one of the 50 career centers around the state or check out https:// labor.alabama.gov/CareerCenters. aspx  to get help finding a rewarding career. @al_labor  #WeHaveJobs  #alpolitics Quote Tweet ADOL @al_labor Secretary Washington talks about Alabama's economy and services available at your local Career Center. https:// wsfa.com/video/2020/02/ 25/adol-talks-unemployment-career-centers/   @wsfa12news  @ADOLSecretary  @GovernorKayIvey  @ALWorksSystem", "2020-02-25T15:41:12.000Z": "\"Vote \"Yes\" on Amendment 1 & give our kids the opportunity for the education they need and deserve.\" #alpolitics Thanks for your support ... @MaryScottHunter  #Yes4Amendment1 Vote 'Yes' on Amendment I says former State School Board Member An elected board tends to be swayed by a few special interests, tends to be chaotic, and has failed to keep pace with states whose students are getting educational advantages that our kids are not. al.com", "2020-02-24T18:05:58.000Z": "The men & women who serve in our military have a special calling. They're pillars of our communities & serve as examples of selflessness & patriotism. Today, I'm proud to join Blount County officials & residents in dedicating a bridge in honor of our veterans. @BlountCommish", "2020-02-24T17:36:02.000Z": "The #2020Census is vitally important to Alabama's future for funding of community programs, as well as congressional representation. I encourage everyone to use & share these toolkit items to help our state achieve a maximum count. @AlabamaCounts  @ADECA  #ALCounts  #alpolitics Quote Tweet ADECA @ADECA Alabama 2020 Census toolkit now available online http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=13686   @AlabamaCounts", "2020-02-23T20:36:29.000Z": ". @realDonaldTrump called to assure me that this plan will not move forward. I thanked him for his support of AL! We always want to help our fellow Americans, but this wasn't fully vetted. Thank you @SenShelby  @RepMikeRogersAL for advocating on our behalf! #alpolitics  #teamwork Quote Tweet Richard Shelby @SenShelby I just got off the phone with the President. He told me that his administration will not be sending any victims of the Coronavirus from the Diamond Princess cruise ship to Anniston, Alabama. Thank you, @POTUS , for working with us to ensure the safety of all Alabamians.", "2020-02-21T22:12:26.000Z": "Registration for the 2020 @cyberfasttrack cybersecurity competition is now open for college students. Take a look at the flyer below & get registered before March 22! https:// cyber-fasttrack.org/?utm_source=fl yer&utm_medium=digital&utm_campaign=state-coord ", "2020-02-19T19:19:08.000Z": "Deputy Secretary of Workforce Development and Director of AIDT Ed Castile  shares information about the resources available to help you navigate the Workforce Superhighway and stay clear of  malfunction junction --- The Workforce Superhighway - Stay clear of malfunction junction As you merge onto the Workforce Superhighway in search of that dream career, don't venture into dead ends or get yellowhammernews.com", "2020-02-20T16:01:03.000Z": "Alabama's Severe Weather Preparedness Sales Tax Holiday starts tomorrow! Build your severe weather kits & stock up on important preparedness items this weekend, Feb. 21-23. @AlabamaEMA  @AlabamaRevenue  #alwx  #ReadyAL Severe Weather Preparedness Week begins in Alabama wsfa.com", "2020-02-20T14:48:09.000Z": "I appreciate the Senate Majority Caucus for joining me for a breakfast discussion today. Alabama has a lot of serious issues facing our state, & we must remember that we work the strongest for the people of Alabama when we work together. @ALSenateRepubs  #alpolitics", "2020-02-19T16:44:32.000Z": "It was an honor to host the Alabama Federation of Republican Women for breakfast earlier today. As we work to make improvements across our state, I appreciate this group for encouraging women to be actively involved in the political process. @NFRW  #alpolitics", "2020-02-19T14:38:37.000Z": "College students don't forget to apply for our summer internship program! Learn more by visiting https:// governor.alabama.gov/administration /internship-program/  . #alpolitics  #aledchat", "2020-02-18T23:46:47.000Z": "Woohoo, just reached the 40,000 follower mark! Be sure to follow all my platforms via http:// governor.alabama.gov . Next stop - 50K!", "2020-02-18T20:08:49.000Z": "The significant amount of rain that has fallen across AL recently has caused flooding in several portions of the state. We assured our citizens that we'd be prepared to help however needed, which is why I have issued a State of Emergency. https:// governor.alabama.gov/newsroom/2020/02/governor-ivey-issues-state-of-emergency-to-aid-in-alabama-flooding-recovery-efforts/   #alwx  @AlabamaEMA", "2020-02-18T19:22:04.000Z": "It's truly my honor to present retired @USArmy Master Sgt. Brandon Lloyd the Alabama Legislature Medal of Honor. He served as a sniper, special ops combat medic & was an instrumental part of the special forces team that captured Saddam Hussein. Alabama salutes this American hero!", "2020-02-17T19:25:56.000Z": "Let's take the politics out of our  schools. Let's add term limits and accountability for our board members. Vote yes on Amendment One on March 3. #alpolitics  https:// al.com/news/2020/02/a labama-to-vote-on-whether-to-fire-the-state-school-board-here-are-the-facts.html ", "2020-02-17T14:21:16.000Z": "Thank you @GovernorKayIvey for declaring 16-21 Feb #SevereWeather Awareness Week to strengthen community resilience to survive & thrive in AL!\nWe are partnering with @NWS & state partners to educate citizens & increase awareness of our threats- @AlabamaEMA  @ALEmergencyMgrs", "2020-02-17T14:35:50.000Z": "I hope everyone has a wonderful Presidents' Day, especially @POTUS  @realDonaldTrump !", "2020-02-16T16:01:52.000Z": "Alabama formally adopted our state flag on Feb. 16, 1895. Our flag is a symbol of the love & strength of Alabamians, both past & present. \n\n\"Flag of Alabama I salute thee. To thee I pledge my allegiance, my service, and my life.\" #alpolitics", "2020-02-15T17:29:08.000Z": "My admin is committed to improving mental health across AL, which is why I've proposed the creation of 3 mental health crisis centers. @ALMentalHealth is hosting regional meetings to get the public's input on this matter. #alpolitics  @RepLedbetter24  https:// wsfa.com/2020/02/15/law -enforcement-supports-proposed-mental-health-crisis-centers/ ", "2020-02-14T19:06:47.000Z": ". @GovernorKayIvey has awarded grants totaling $138,851 to help six law enforcement offices in north-central Alabama purchase needed equipment. http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=13672 ", "2020-02-14T16:29:16.000Z": "I've issued EO 719, which forms the Study Group for Gambling Policy. I'm committed to, once & for all, getting the facts so that the people of AL can make an informed decision on what has been a hotly debated topic for many years. #alpolitics  https:// governor.alabama.gov/newsroom/2020/02/governor-ivey-signs-executive-order-719-forming-study-group-for-gambling-policy/ ", "2020-02-13T17:29:36.000Z": "AL is proud to be one of the 6 states selected to participate in the @NatlGovsAssoc Education Dual & Concurrent Enrollment Workshop! We look forward to collaborating with other states, @CollegeinHS & @jfftweets to expand edu opportunities across the U.S. #WeTheStates  #alpolitics Quote Tweet JFF @jfftweets CHSA and @NatlGovsAssoc are excited to welcome teams from AL, CT, KY, LA, NV, VT and DC to a College in High School Workshop to explore equitable expansion of #collegeinhighschool programs like #dualenrollment . Learn more: https:// bit.ly/2vSlWqF", "2020-02-13T16:27:46.000Z": "Thank you members of the Alabama Senate for confirming Leigh Gwathney as Chair of the Board for AL Pardons and Paroles. With your efforts today, we will make needed change together! @ALSenateDems  @ALSenateRepubs  #alpolitics", "2020-02-13T15:02:11.000Z": "Alabama's career & technical education programs are preparing students for a lifetime of success by providing them opportunities to earn industry recognized credentials, workplace experience & college credit while still in HS. #StrongStartStrongFinish  @AlabamaAchieves", "2020-02-13T15:01:03.000Z": "I'm proud to proclaim February as Career & Technical Education Month in AL! I encourage educators & industry leaders to participate in this celebration by hosting activities that demonstrate the importance of CTE. #StrongStartStrongFinish  @AlabamaAchieves Career and Technical Education Month - Office of the Governor of Alabama governor.alabama.gov", "2020-02-13T14:39:36.000Z": "Thank you @TODAYshow for the story on AL legend @HenryLouisAaron A Mobile native, he became one of the greatest players in @MLB Crediting God for his talent, he used baseball to cross racial divides and inspired change in the hearts and minds of America. Hank Aaron on the Negro Leagues: 'There was so much talent' Thursday marks 100 years since the founding of the first Negro League, a place for black and Hispanic baseball players, then barred from the Major Leagues. One of them was eventual Hall of Fame... today.com", "2020-02-12T21:19:57.000Z": ". @GovernorKayIvey awards grants to create safe neighborhoods. http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=13669 ", "2020-02-11T19:47:21.000Z": "Andrew Brasher's confirmation to the US Court of Appeals for the 11th Circuit is a testament to his vast legal ability & commitment to upholding the rule of law. He's served w/integrity & purpose as a district judge & I'm confident he'll continue to do so. Shelby: Judge Andrew Brasher Confirmed to U.S. Court of Appeals for the Eleventh Circuit WASHINGTON, D.C. - U.S. Senator Richard Shelby (R-Ala.) today applauded the Senate confirmation of Judge Andrew Brasher of Montgomery to sit on the U.S. Court of Appeals for the Eleventh Circuit.... shelby.senate.gov", "2020-02-11T20:32:53.000Z": "Thank you, Governor Bush for your kind words. A strong workforce begins with a strong education system! @JebBush  #StrongStartStrongFinish  #alpolitics Quote Tweet Jeb Bush @JebBush Check out the student-centered policies being championed by governors from coast to coast to give the next generation pathways to the American dream. https:// excelined.org/news/icymi-sta te-of-the-states-recap/  Show this thread", "2020-02-10T22:27:02.000Z": "Great news for Alabama! Thank you @SenShelby for your leadership and commitment to our state. #alpolitics Quote Tweet Richard Shelby @SenShelby Grateful to the Army Corps of Engineers for allocating the full federal share of the project cost and to the state of Alabama for providing the required matching funds. I look forward to its completion and the resulting impact. https:// shelby.senate.gov/public/index.c fm/2020/2/shelby-army-corps-of-engineers-allocates-274-3-million-to-complete-port-of-mobile-project  Show this thread", "2020-02-10T22:25:25.000Z": "We've had a long, wet winter! #alwx  #alpolitics See my full statement below regarding this week's heavy rainstorms:", "2020-02-10T14:42:13.000Z": "On this somber day, we remember the life of Kimberly Police Officer Nick O'Rear. We will lift his loved ones, comrades & the city of Kimberly in prayer, as Officer O'Rear is laid to rest. #ThinBlueLine", "2020-02-10T02:19:18.000Z": "I am deeply saddened to hear of the passing of Tom Collins, the husband of Representative Terri Collins. @RepTerriCollins  #alpolitics My full statement here:", "2020-02-08T23:12:47.000Z": "\"In fact, until last year, Alabama had NEVER experienced an unemployment rate below 3.0%. We hit that mark three times last year.\" #alpolitics Quote Tweet The Cullman Tribune @CullmanTribune AL Labor Sec. Fitzgerald Washington: 2019 economic wrap-up @al_labor  @ADOLSecretary  https:// cullmantribune.com/2020/02/07/al- labor-sec-fitzgerald-washington-2019-economic-wrap-up ", "2020-02-08T16:08:53.000Z": "Here's a great @WTVYNews4 story that explains the different kind of alerts @ALEAprotects sends out! #alpolitics Difference between emergency cell phone alerts Many were not aware of exactly what a \"Blue Alert\" was when they received it on their phones in the wee hours of Wednesday morning. wtvy.com", "2020-02-08T15:55:05.000Z": "We've added a new \"Citizens Alerts\" feature to our website! Click below to get signed up for @ALEAprotects alerts & newsroom alerts. This is a free service aimed at keeping the public informed. #alpolitics  @AMBERAlert  @AMBERAlert_AL  https:// contact.governor.alabama.gov/citizen_alerts .aspx ", "2020-02-08T15:00:01.000Z": "I've proclaimed today as \"Honor the Descendants of the Clotilda Day\" in the state of Alabama. It is important that we reflect on the history surrounding this ship & honor the enduring legacy of those aboard the Clotilda. #BlackHistoryMonth  @TweetHomeAla", "2020-02-07T20:50:03.000Z": "AL has experienced considerable tragedy over the years. Traditionally, we've honored distinguished individuals by lowering our flags for their service. Visit our homepage to see the current Flag Status, which is located in the top right corner. https:// governor.alabama.gov  #alpolitics", "2020-02-07T20:02:00.000Z": "Tune in to @CapitolJournal tonight at 7:30 p.m. to hear my interview with @DonDaileyAPT ! From Amendment One to prison reform, we're discussing many of the major issues my administration is planning to take on during the 2020 legislative session. #alpolitics", "2020-02-07T16:37:27.000Z": "Applications are now available for the 2020 Hire Vets Medallion program.  Click  the link for more info: https:// labor.alabama.gov/news_feed/News_Page.aspx?id=197   @GovernorKayIvey  @ADOLSecretary  @SSVeterans  @ALSDVA", "2020-02-07T15:49:40.000Z": "I've proclaimed today National Wear Red Day in the state of Alabama to raise awareness about cardiovascular disease. Visit https:// goredforwomen.org/en to learn more! @American_Heart  @GoRedForWomen  #WearRedDay  #GoRedforWomen", "2020-02-06T22:29:14.000Z": "ICYMI - Kristina Scott, of @alabamapossible , joined the @MAShow995 this morning to explain the importance of completing the #2020Census . Take a listen below & be sure to text \"Count\" to 205-304-5505! @AlabamaCounts  #ALCounts  #alpolitics  https:// bit.ly/3besu2S", "2020-02-06T20:23:46.000Z": "If you missed my State of the State Address, watch my post SOTS interview with @ReshadHudson below! #alpolitics Ivey discusses need for better prisons, education in Alabama following State of the State address MONTGOMERY, Ala. (WIAT) - Following her State of the State address Tuesday night, Alabama Gov. Kay Ivey sat down with CBS 42 to discuss the issues that will likely dominate the legislative se cbs42.com", "2020-02-06T19:03:30.000Z": "This is great information about Alabama's STAR ID!  #alpolitics Quote Tweet Alabama Law Enforcement Agency @ALEAprotects https:// waff.com/2020/02/06/ale a-trooper-answers-your-star-id-questions/#ALEADriverLicense   @GovernorKayIvey", "2020-02-06T16:43:47.000Z": "Whether you have a quick question or want to request a proclamation, visit our NEW website's contact page for all your needs. My team is happy to assist you! Don't forget to sign up for our newsletter while you're there! #alpolitics  https:// governor.alabama.gov/contact/", "2020-02-05T15:02:10.000Z": ". @GovernorKayIvey announced a working group to study the potential expansion of gambling in Alabama during her #StateOfTheState speech. She also promoted mental-health crisis centers and a pilot program to bring health care to medically underserved areas. Governor Ivey's State of the State Address - Office of the Governor of Alabama Governor Kay Ivey delivered the annual State of the State Address to a Joint Session of the Alabama Legislature on Tuesday, February 4, at 6:30 p.m. (CST) in the Old House Chamber of the State... governor.alabama.gov", "2020-02-05T21:40:14.000Z": "Tonight @ 10:30 on @CapitolJournal : AL Senators split on convicting the president; @GovernorKayIvey reacts to another police killing; former Justice Champ Lyons on prison reform. #alpolitics", "2020-02-05T22:08:20.000Z": "We're excited to host the @MAShow995 tomorrow at the State Capitol for a full lineup of Ivey administration guests & legislators! Tune in from 6-10 a.m., as these state officials elaborate on some of the goals & challenges mentioned during my SOTS. #alpolitics", "2020-02-05T21:45:20.000Z": "It's National Girls & Women in Sports Day! Let's encourage young girls to realize their full potential in all areas of activity, including sports. #NGWSD  #LeadHerForward  @WomensSportsFdn", "2020-02-05T19:42:15.000Z": "As we kick off our 2020 legislative session, there's no better time to visit our new website's newsroom than NOW! Check in daily for new updates. While you're there, feel free to download any photos & share any of our publications. #alpolitics  https:// governor.alabama.gov/newsroom/", "2020-02-05T16:16:17.000Z": "I have just spoken with the fallen Kimberly Police officer's family and offered them my deepest sympathies for their tragic loss. See my full statement below. #ThinBlueLine  #alpolitics", "2020-02-05T15:17:14.000Z": "Thank You! | Leadership @GovernorKayIvey proposed a $25 million increase in state funding for the nationally-recognized Alabama First Class Pre-K, currently available to only about 40% of eligible children.\n\nRead more: https:// bit.ly/2tBNhfW  #PreK4AL  #StrongStartStrongFinish Ivey proposes $1 billion school bond, teachers' raise Gov. Kay Ivey gave her third state of the state address tonight at the State Capitol, kicking off the 2020 legislative session. al.com", "2020-02-05T01:20:16.000Z": "You see, I truly believe this is our moment as we step confidently into our third century to do the things that need to be done, for both today and in the years to come. Together, let's make this moment count. #ALpolitics", "2020-02-05T01:17:37.000Z": "To the people of Alabama \"I promise you this - I'm going to do all I can to help lead our state to solve tough problems and realize our untapped potential. Serving as your governor has been the utmost honor and privilege of my life.\" #ALpolitics", "2020-02-05T01:14:20.000Z": "Regarding the working group on gaming: \"My challenge to the Legislature is: give us some time to get the facts and then, together, we will give the people of Alabama the information they need to make the most informed decision possible.\" #ALpolitics", "2020-02-05T01:13:27.000Z": "I will be signing an Executive Order to establish a working group of some of Alabama's most distinguished citizens, to begin working, to gather all the facts on how much money we could really gain if some form of gaming expansion occurred. #ALpolitics", "2020-02-05T01:10:47.000Z": "We have the lowest unemployment rate in our 200-year history at 2.7 percent! #ALpolitics", "2020-02-05T01:10:20.000Z": "We are starting our new century enjoying the best economy our state has ever had. Thanks to the hard work @MadeinAL Secretary @gregcanfield - as well as @al_labor  @ADOLSecretary - these are unquestionably the best of times. #ALpolitics", "2020-02-05T01:10:01.000Z": "Special thanks go to House Majority Leader Ledbetter and the members from both parties and both chambers who have been working with him to lead the charge to put additional emphasis on this important area of public service. @RepLedbetter24  #ALpolitics", "2020-02-05T01:09:36.000Z": "I am also calling on the Legislature to provide funding to build 3 new crisis centers. These centers will be a safe haven for people facing mental health challenges; they can be stabilized and treated without being sent to a jail or the hospital. @ALMentalHealth  #ALpolitics", "2020-02-05T01:09:05.000Z": "Another sign of our commitment to improving the lives of those who live in #ruralAlabama is my full support for a pilot program to incentivize primary care physicians and nurse practitioners to establish services in medically underserved areas. #ALpolitics", "2020-02-05T01:05:06.000Z": "Important areas that are being worked on daily by my administration: Access to broadband; it is a top priority to continue increasing the availability of high-speed internet throughout the state, especially in #ruralAlabama , through the Broadband Accessibility Fund. #ALpolitics", "2020-02-05T01:03:32.000Z": "Since coming into office, I have made no secret of the fact that one of the most critical issues we face - one that will affect every single Alabamian - is the upcoming Census in March.  2020 will be a make or break year for our state. #ALpolitics  @AlabamaCounts  #ALCounts", "2020-02-05T01:02:50.000Z": "Under the solid leadership of Secretary Hal Taylor, the Alabama Law Enforcement Agency has increased protection on our state's roads and waterways. My budget will include additional funding to hire and train 50 additional sworn officers. #ALpolitics  @ALEAprotects", "2020-02-05T01:00:12.000Z": "2019 was an especially difficult year for those who wear a badge. 7 Alabama Law Enforcement members were killed in the line of duty. Representing these families, we have Mrs. Joanne Williams, widow of Lowndes Co. Sheriff Big John Williams, with us. #ThinBlueLine  #ALpolitics", "2020-02-05T00:59:25.000Z": "The AL Department of Human Resources, led by our dedicated Commissioner Nancy Buckner, led the nation two years in a row in placing foster children in a permanent, loving home.  It's one thing to talk about helping a child; it's another thing to actually do it. #ALpolitics", "2020-02-05T00:58:56.000Z": "I am also calling on our Legislature to provide a 2% increase for all state employees.  This is the third straight year our state employees will see an increase in their paychecks. #ALpolitics", "2020-02-05T00:58:28.000Z": "Carl helped John work on his résumé, helped him apply for jobs, and most importantly, helped him restore confidence in his skills and abilities. With the Career Center's help, John landed a job at LG Electronics @LGUS  #ALpolitics", "2020-02-05T00:58:14.000Z": "Last year, an unemployed Army veteran, John Carroll, came to the Decatur Career Center hoping to turn his life around.  He was going through some personal troubles and was out of work. That's when Carl Flemons, a veteran's representative at @al_labor stepped in. #ALpolitics", "2020-02-05T00:57:33.000Z": "While no state in the nation has had more success in recent years attracting new investment and new industry, Alabama must redouble our efforts to ensure that we will have the most sought after and qualified workforce in the country. #ALpolitics", "2020-02-05T00:56:21.000Z": "Mrs. Hickey is one of the reasons I stand here as governor! Teachers in our state deserve to be compensated for their hard work. That is why I am proposing a 3% pay raise for all teachers: pre-k through community college. #ALpolitics", "2020-02-05T00:54:06.000Z": "Growing up in Camden, my first-grade teacher was Mrs. Elise Hickey and she was a favorite. She created within me a passion for reading. It was because of her that led me to believe that if a child can learn to read, they can learn to do anything. #ALpolitics", "2020-02-05T00:53:02.000Z": "My education budget that I am proposing will provide an additional $25 million dollars to expand our nationally recognized First Class Pre-K program. This significant increase will expand the program by another 193 classrooms! #ALpolitics  @AL_DECE", "2020-02-05T00:50:41.000Z": "For us to prepare today's students for tomorrow's opportunities, it is time we get serious: It's time for creativity. It's time for accountability. It's time for stability. It's time to vote YES for Amendment One on March 3rd! #ALpolitics", "2020-02-05T00:48:19.000Z": "An even better investment...is building a world-class public education system. The Legislature gave the voters of Alabama an opportunity...to vote on AMENDMENT ONE, which will be on the March 3rd primary ballot. #ALpolitics", "2020-02-05T00:46:17.000Z": "Brandie worked with Ingram's job placement team to locate a job where she could use her newly acquired skills...She landed a job at Wright Way Staffing in Fairfield, where she quickly moved up the ranks to become an office administrator and staff recruiter. #ALpolitics", "2020-02-05T00:45:47.000Z": "Ingram State, where I visited recently, is the only postsecondary institution in the country that exclusively serves the incarcerated population. Y'all, this partnership is changing lives. Just ask Brandie McCain. @amfun1  @ACCS_Education  #ALpolitics", "2020-02-05T00:45:05.000Z": "I tasked Commissioner Dunn to spearhead the efforts to build three new prisons that will transition our facilities from warehousing inmates to rehabilitating people. @ADOCDunn  #ALpolitics", "2020-02-05T00:44:27.000Z": "I am exceptionally proud of Justice Champ Lyons, @Clyde_Chambliss , @SenCamWard , @bsingle362 , @reprowe13 , Rep. Hill, & @RepEngland70 - for their willingness to put any preconceptions aside and work together. #ALpolitics", "2020-02-05T00:42:55.000Z": "Over the past seven months, the Criminal Justice Study Group I appointed last year analyzed many of the crucial components necessary to address the needs to rehabilitate those within our prison system. #ALpolitics", "2020-02-05T00:42:11.000Z": "One of my top priorities for this upcoming session is tackling ... our longstanding challenges within our criminal justice system...we simply cannot afford to wait any longer to tackle this problem... and failure is not an option. #ALpolitics", "2020-02-05T00:41:34.000Z": "Recently, \"We have announced the state's portion of $122 million worth of road and bridge projects in more than 48 of Alabama's 67 counties...And the good news is Alabama still has one of the lowest gas prices of any state in the nation!\" #ALpolitics", "2020-02-05T00:40:43.000Z": "Early on, I made one of the most important decisions I would make as your governor and that was to begin regular meetings with the bipartisan leadership of both the House and Senate...A prime example of the benefit of working together was #RebuildAlabama . #ALpolitics", "2020-02-05T00:38:55.000Z": "I am proud and extremely pleased to report to you tonight that the State of our State is strong and growing! #ALpolitics", "2020-02-05T00:37:54.000Z": "Shortly after becoming your governor in April 2017, I realized that our great state had ignored too many problems for far too long.  We had put band aids and duct tape on old ideas, old roads and bridges, and tired old prisons long enough. #ALpolitics", "2020-02-05T00:36:55.000Z": "Our 3rd century begins with a strong, robust economy and a renewed commitment to look for new opportunities to answer old challenges, many of which have been around for decades. #ALpolitics", "2020-02-05T00:36:14.000Z": "Referencing the 100 years since Governor Kilby spoke to the 1920 special session: \"As the old saying goes, 'the more things change, the more they stay the same.'\" #ALpolitics", "2020-02-05T00:35:36.000Z": "Governor Thomas Kilby, Alabama's 36th governor, stepped onto this very spot - in this historic chamber - one hundred years ago to speak to the people of our state about what Alabama's second century might look like. #ALpolitics", "2020-02-04T23:53:56.000Z": "Lawmakers and other dignitaries are filing into the Old House Chamber for @GovernorKayIvey 's State of the State Address. Speech starts at 6:30. Watch on APT or at http:// governor.alabama.gov . #alpolitics", "2020-02-04T22:01:46.000Z": "Tonight, Paul Morrow is representing Alabama at the State of the Union. As an Army veteran working to build a new business, he embodies the best of our state! Thank you, @potus for highlighting one of AL's finest! #alpolitics  @WhiteHouse  #StateOfTheUnion  @POTUS", "2020-02-04T20:25:07.000Z": "Tune in to my State of the State Address today at 6:30 p.m. via our new site: https:// governor.alabama.gov/newsroom/2020/02/governor-iveys-state-of-the-state-address/  . @APTV is also carrying it live, with pre-speech coverage beginning at 6 p.m. \n\nYou don't want to miss it! #alpolitics Governor Ivey's State of the State Address - Office of the Governor of Alabama Governor Kay Ivey delivered the annual State of the State Address to a Joint Session of the Alabama Legislature on Tuesday, February 4, at 6:30 p.m. (CST) in the Old House Chamber of the State... governor.alabama.gov", "2020-02-04T18:55:28.000Z": "New Website Alert | We've updated our website with more resources to help you stay informed with everything our administration is doing. Take a look & spread the word! Be sure to sign up for our newsletter & follow us on social media! #alpolitics  https:// governor.alabama.gov", "2020-02-03T20:23:59.000Z": "We've come a long way. Alabama: History in the Making | Site Selection Magazine https:// siteselection.com/issues/2020/ja n/alabama-history-in-the-making.cfm?utm_source=InvestorWatch&utm_medium=email&utm_campaign=Editorial   @madeinal  @governorkayivey Alabama: History in the Making | Site Selection Magazine Automotive, tech and tourism drive Alabama's future. siteselection.com", "2020-02-01T20:53:55.000Z": "Congrats to these AL schools - recipients of the College Board AP CS Female Diversity award (only 818 from 20,000 selected). AL ranks 6 overall for AP CSP (not counting population!). @AlabamaCsta  @AMSTI4all  @AplusCR @ALSDEdotEDU @GovernorKayIvey  @ECEP_CS  @CSforALL  @CSforAllTchrs", "2020-02-01T21:34:57.000Z": "Alabama K-12 CS team: Our schools are doing very well, comparatively in AP CS Diversity! Top-6 for AP CSP and top-10 overall (not adjusted for population).\n\nCheck out data at: http:// bit.ly/apcs--female-2 019   @AlabamaCsta  @AplusCR @ALSDEdotEDU @GovernorKayIvey  @AMSTI4all  @egmackey", "2020-01-31T19:06:35.000Z": "I'm honored to address @PARCAAlabama, to talk about AL's Third Century and honor a former mentor of mine, Governor Albert Brewer. PARCA's thorough research supports many of our state's most important initiatives. #alpolitics", "2020-01-30T21:18:38.000Z": "While visiting @ClaytonHomes today in Russellville, Alabama, I announced several updates to manufactured housing construction and safety standards. Learn more https:// hud.gov/press/press_re leases_media_advisories/HUD_No_20_016  .", "2020-01-30T22:37:37.000Z": "Manufactured housing plays an increasingly vital role in meeting the nations's affordable housing needs. As part of the #DrivingAffordableHousing tour I visited ... @claytonhomes  in Russellville and saw their manufacturing process firsthand.", "2020-01-30T23:08:08.000Z": "Thank you @GovernorKayIvey for welcoming us to Alabama! #DrivingAffordableHousing Quote Tweet Governor Kay Ivey @GovernorKayIvey Thank you @SecretaryCarson for stopping in AL to visit @claytonhomes as part of your #DrivingAffordableHousing bus tour! We hope to continue having productive discussions with @HUDgov about affordable housing options. Thanks to you & @POTUS for making this a priority. #alpolitics", "2020-01-30T21:32:41.000Z": "What does the future in economic development look like for Alabama? @GovernorKayIvey and Commerce Sec. @gregcanfield share their thoughts http:// bit.ly/3aW2n0m via @alnewscenter", "2020-01-30T17:25:05.000Z": "Thank you @SecretaryCarson for stopping in AL to visit @claytonhomes as part of your #DrivingAffordableHousing bus tour! We hope to continue having productive discussions with @HUDgov about affordable housing options. Thanks to you & @POTUS for making this a priority. #alpolitics", "2020-01-30T15:51:17.000Z": "@GovernorKayIvey awards grant to retain jobs in Eufaula http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=13657 ", "2020-01-29T17:23:51.000Z": "What an exciting day for our country as @POTUS officially signs #USMCA ! Alabama is grateful for the hard work & leadership of @realDonaldTrump & all involved for bringing this monumental deal to fruition. Thank you for supporting the American people! @WhiteHouse  #alpolitics Quote Tweet The White House @WhiteHouse LIVE: President @realDonaldTrump signs USMCA! https:// pscp.tv/w/cQGl3DFxTFFH VnJ5UkFKRUp8MUJSSmpRenFtT2FHdwX1Zm8wfqzu8vu-SIBI2DZMO2-F3o5gjEndJ_vuBr1t ", "2020-01-28T21:24:24.000Z": "We thank @GovernorKayIvey for her leadership in leading Alabama to do more than setting a goal of 500,000 highly trained workers by 2025 but supporting a roadmap to get there. http:// beaalabama.com/wp-content/upl oads/2020/01/Education-Matters-2020-BEA-Report.pdf ", "2020-01-28T21:03:55.000Z": "In order to give all Alabamians a #StrongStartStrongFinish , it's imperative that we look at workforce data to see where we can improve. I'm grateful for the Alabama Workforce Council's & @BEAAlabama 's leadership & collaboration in undertaking this task. @ALWorksSystem  #alpolitics Quote Tweet BEA Alabama @BEAAlabama Alabama headed for jobs crisis as skills disappear, study says https:// montgomeryadvertiser.com/story/news/202 0/01/28/alabama-headed-jobs-crisis-skills-disappear-study-says/4592698002/  via @mgmadvertiser", "2020-01-28T18:22:47.000Z": "Economic development is the lifeblood of our state. Since the 1960s, the Economic Development Association of AL has been one of our state's biggest supporters. I'm proud to share with @EDAAInfo our latest economic successes & a preview of our priorities for 2020. #alpolitics", "2020-01-28T16:30:56.000Z": "It's always a pleasure to speak with ACAE because they represent the most involved organizations in AL! Today, I enjoyed attending their legislative issues seminar & our discussion about important challenges facing our great state. @joinACAE  #alpolitics", "2020-01-28T00:55:47.000Z": "I'm proud to host several of the mayors of our largest metros for dinner to foster good communication & strengthen our partnerships. I enjoyed hearing about their cities & their ideas for tackling some of AL's biggest issues. #alpolitics", "2020-01-27T17:21:25.000Z": ". @GovernorKayIvey has awarded an $82,831 grant to help the Alabama Department of Insurance's Criminal Investigations Division purchase new equipment to aid in investigations. http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=13654 ", "2020-01-27T15:16:20.000Z": "I have reached out to Rep. Jim Carns to offer our condolences on the passing of his wife, Judy. My heartfelt prayers go out to ALL grieving today, especially Rep. Carns, their children & grandchildren. #alpolitics  @ALGOP", "2020-01-25T01:12:58.000Z": "Big shout out to Alabama's very own Huntsville International Airport for being voted as the nation's #1 Best Small Airport in a @USATODAY poll! Congratulations, @FlyHSV !  https:// 10best.com/awards/travel/ best-small-airport/ ", "2020-01-24T20:54:53.000Z": "Alabama has the fifth lowest unemployment rate in the nation! #ALjobs  #wehavejobs  @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem", "2020-01-24T15:31:07.000Z": "Alabama workforce development program recognized as one of nation's best, will now mentor other states #alpolitics By @HenryThornton95 Alabama workforce development program recognized as one of nation's best, will now mentor other... The National Governor's Association on Thursday announced Alabama would be among a choice group of states that will mentor other yellowhammernews.com", "2020-01-24T14:39:13.000Z": "I'm so proud to be able to close out this decade with record-breaking economic measures. Earlier this year, Alabama had never reported an unemployment rate lower than 3.0%, and now we've had one for the last three months! Way to go Alabama!  #WeHaveJobs  #alpolitics Quote Tweet ADOL @al_labor Alabama ends 2019 by Maintaining Record Low Unemployment Rate; Nearly 84,000 More People Working; Wages at Record High\nClick the link for more information! https:// labor.alabama.gov/news_feed/News_Page.aspx?id=194   #wehavejobs  #ALjobs  @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem", "2020-01-23T22:18:41.000Z": "Congratulations to the Sylacauga Alliance for Family Enhancement, Inc. for being named as one of four national winners of the 2020 @ChickfilA True Inspiration Award! We're proud of the work you're doing to promote workforce development & economic security in AL. #alpolitics", "2020-01-22T22:43:33.000Z": "Our state's economy depends on our roads & bridges - by investing in them, we're continuing to say, \"AL is open for business!\" I'm thrilled to unveil the first of many #RebuildAL signs to come. They'll stand as a reminder of our promise to invest in infrastructure. #alpolitics", "2020-01-22T16:41:29.000Z": "For three years, I've worked with @ADECA to spread the word about the importance of our upcoming #2020Census . I applaud them & these folks for the tremendous work they're doing, as part of the @AlabamaCounts subcommittees, to make sure #AlabamaCounts when it matters most.", "2020-01-21T18:30:24.000Z": "Alabama is excited to participate as a mentor state in the third phase of @NatlGovsAssoc 's work-based learning policy academy! We are eager to share our remarkable successes from phase two & learn from the best practices of other states. #WeTheStates  #alpolitics Quote Tweet NGA @NatlGovsAssoc Alabama will mentor other states on how to blend work experience and applied learning to better prepare students for good careers. @GovernorKayIvey : \"We are eager to share our successes.\" https:// nga.org/news/press-rel eases/national-governors-association-names-6-states-to-mentor-peers-on-work-based-learning/ ", "2020-01-20T14:36:40.000Z": "Today we celebrate the life & legacy of one of the world's greatest leaders. Dr. Martin Luther King Jr. once said, \"Everybody can be great, because anybody can serve.\" This powerful quote reminds us all how we can make a difference in this world through service. #MLKDay", "2020-01-19T14:56:50.000Z": "Today marks one year since a devastating tornado tore through the city of Wetumpka. We were fortunate no lives were lost, but the city was hit hard. The rebuilding process may take some time, but I'm hopeful it will continue to strengthen this community. Gov. Ivey Tours Tornado Damage in Wetumpka Governor Kay Ivey, on January 21, 2019, toured damage in Wetumpka caused by an EF-2 tornado on Saturday, January 19, 2019. (Governor's Office, Lori Davis Jhons) youtube.com", "2020-01-17T21:01:57.000Z": "Today is an exciting day for the @cityofbhamal , as we celebrate the reopening of the I-20/I-59 bridges! These bridges are 45+ years old & needed rehabilitation to accommodate increased traffic & economic productivity. Thank you to everyone involved with this project. #alpolitics", "2020-01-17T16:16:44.000Z": "We're proud @CondoleezzaRice is helping spread the word about all AL has to offer startup companies. The AL Incentives Modernization Act is one of the newest economic development vehicles we're using to attract top companies to our state. #alpolitics  @GoBillPoole  @alabamapower Quote Tweet Yellowhammer News @yhn Condoleezza Rice: Tech companies, startups can find success in Alabama \nBy @sean_yhn  https:// yellowhammernews.com/condoleezza-ri ce-tech-companies-startups-can-find-success-in-alabama/ ", "2020-01-17T15:37:53.000Z": "Alabama's had its highest job growth rate in November 2019 (the most recent data available). #ALjobs  #wehavejobs  @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem", "2020-01-17T00:41:59.000Z": "This evening, I'm honored to address members of the Blackburn Institute. AL needs strong future leaders that understand the issues facing our state, & the @BlackburnUA is doing an exceptional job ensuring that these students get the experience needed to keep AL moving forward.", "2020-01-16T22:07:04.000Z": "I'm excited to join employers & members of the business & industry community to launch our Commitment to the Alabama Worker! Everyone here pledges to do their part to connect edu to the economy to ensure we're eliminating barriers for those entering our workforce. #alpolitics", "2020-01-16T18:44:51.000Z": "Thank you @US_EDA for supporting our efforts to establish economic development strategies to promote job creation in all regions of our state. #alpolitics", "2020-01-16T18:44:33.000Z": "The @US_EDA has awarded a total of $630,000 to the Alabama-Tombigbee Regional Commission, the Northwest Alabama Council of Local Governments, & the South Central Alabama Development Commission to develop & implement a comprehensive economic development strategy. #alpolitics", "2020-01-16T17:56:09.000Z": "Great News! Thank you @POTUS for delivering on this promise. This is a major win for our state & the American people. We are glad #Congress has passed the #USMCA & look forward to the many benefits of this all-important, 21st century agreement. #alpolitics Quote Tweet The White House @WhiteHouse For years, politicians-both Democrat and Republican-have promised to replace NAFTA with a deal that better protects American jobs and workers.\n\nPresident @realDonaldTrump delivered, and the Senate just passed USMCA with an overwhelming 89-10 vote!\n\nPromise MADE, Promise KEPT!", "2020-01-16T15:12:42.000Z": "In partnership with ALDOT, I'm pleased to announce $7 M in funding is being awarded to cities & counties for various local road & bridge projects. I'm proud AL will be able to make these much-needed improvements because of the #RebuildAL Act. https:// governor.alabama.gov/press-releases /governor-ivey-announces-7-million-for-local-road-and-bridge-projects/   #alpolitics", "2020-01-15T15:27:51.000Z": "Today | Pre-Registration\n\nOnline pre-registration for the nation's highest quality Alabama First Class Pre-K begins today!\n\nClick here to pre-register for the 2020-2021 school year: http:// bit.ly/3ak1cb0  #PreK4AL  #StrongStartStrongFinish", "2020-01-15T22:04:06.000Z": "Secretary Taylor is one of the best! Quote Tweet Alabama Law Enforcement Agency @ALEAprotects Whether it's their first day on the job or they are the head of the agency, all levels of ALEA personnel are ready to serve! Pictured is ALEA Sec. Hal Taylor helping a stranded motorist in Montgomery on Jan. 14th. #ALEA", "2020-01-15T18:07:59.000Z": "I applaud @POTUS for signing Phase 1 of the U.S. trade deal with China. This comprehensive agreement is going to help our nation's economy & our state tremendously. We are proud to have Commerce Sec. @gregcanfield represent Alabama at this historic ceremony. @MadeinAL  #alpolitics", "2020-01-15T16:22:50.000Z": "The Governor's Office Internship Program is accepting applications for our summer sessions! I encourage interested college students to apply by March 15. Learn more at https:// governor.alabama.gov/internship-pro gram/  . #alpolitics  #aledchat", "2020-01-14T14:52:36.000Z": "One year ago, today, I had the privilege of taking the Oath of Office as the 54th Governor of AL. Serving the remarkable citizens of AL, in this capacity, is undeniably the highest honor of my life. As we embark on a new decade, let's continue to work together & keep AL growing!", "2020-01-13T17:54:09.000Z": "Research released today by The Alabama Counts! 2020 Census Committee reveals early indications of both county likelihood in filling out Census forms, as well as top motivating factors influencing participation. https:// census.alabama.gov/research-shows -likelihood-of-county-participation-ahead-of-2020-census/ ", "2020-01-13T23:53:40.000Z": "Godspeed, Governor! It was a pleasure working alongside you on behalf of our great states! #alpolitics  #msleg Quote Tweet Phil Bryant @PhilBryantMS It has been an amazing ride. #mississippiworks", "2020-01-13T18:41:12.000Z": "I'm excited to join my friend, Dr. Swaid, for the opening of a medical & surgical center! The $21 M facility is intended to be a \"one-stop shop,\" where patients can see their doctor, receive a diagnosis & have outpatient surgery, all in the same location. #alpolitics", "2020-01-13T17:19:58.000Z": "6 trends fueling Alabama's economic growth in 2020 and beyond https:// madeinalabama.com/2020/01/6-tren ds-fueling-alabamas-economic-growth-in-2020-and-beyond/#.XhymnKAkwLI.twitter   @MadeinAL  @GovernorKayIvey", "2020-01-12T16:08:04.000Z": ". @GovernorKayIvey reacts to those killed during severe weather in Pickens County Saturday.", "2020-01-12T15:47:28.000Z": "\"My thoughts and prayers are with the victims of Saturday's severe weather. Alabama has lost three of her citizens as a result of the serious round of storms to move through Pickens County yesterday. #alpolitics  #alwx See my full statement here:", "2020-01-11T18:31:44.000Z": "𝗗𝗮𝗻𝗴𝗲𝗿𝗼𝘂𝘀 𝗘𝘃𝗲𝗻𝘁 𝗨𝗻𝗳𝗼𝗹𝗱𝗶𝗻𝗴 - 𝗙𝗮𝘁𝗮𝗹𝗶𝘁𝗶𝗲𝘀 𝗖𝗼𝗻𝗳𝗶𝗿𝗺𝗲𝗱 \n\nAn embedded tornado within a long line of intense thunderstorms has resulted in three fatalities near Carrollton in Pickens County. Learn more at https:// ema.alabama.gov/2020/01/11/wid espread-and-significant-severe-weather-saturday-with-flooding-rains-into-next-week/ ", "2020-01-11T12:45:37.000Z": "An intense line of thunderstorms will move from west to east across the state with some gusts of 70+ mph and embedded strong tornadoes (EF2 or higher) are possible.  Learn more at https:// ema.alabama.gov/2020/01/11/wid espread-and-significant-severe-weather-saturday-with-flooding-rains-into-next-week/ ", "2020-01-10T23:20:15.000Z": "At the state level, we continue to closely monitor the approaching storm system, while making all necessary preparations. I encourage Alabamians to do the same, stay weather aware & heed all local warnings. https:// governor.alabama.gov/press-releases /governor-ivey-prepares-state-resources-ahead-of-potential-severe-weather/   @AlabamaEMA  #ALwx Governor Ivey Prepares State Resources Ahead of Potential Severe Weather - Office of the Governor... MONTGOMERY - Governor Kay Ivey on Friday announced that the state of Alabama is making necessary preparations ahead of the potential severe weather. The threat of impact is anticipated for Saturday,... governor.alabama.gov", "2020-01-10T17:27:54.000Z": "Great news for Lawrence County! CCI Manufacturing USA Corp. & Progressive Pipe Fabricators are opening new industrial facilities in Trinity, creating 78 new jobs for this area of the state! #MadeinAL  #alpolitics Quote Tweet Made in Alabama @MadeinAL BREAKING: An auto supplier and a pipe fabricator will open manufacturing facilities in Lawrence County, creating 78 jobs http:// bit.ly/2TaK2pX", "2020-01-10T14:03:24.000Z": "Human trafficking is a very real problem facing the world today. On #HumanTraffickingAwarenessDay , I want to remind folks to stay vigilant & call your local authorities, if you see any suspicious activity. You can also make a tip at @ALEAprotects ' website https:// app.alea.gov/SAR/ .", "2020-01-09T17:44:47.000Z": "Thank you, Governor! I'm indeed blessed. Grateful for your kind words and friendship. Quote Tweet Governor Larry Hogan @GovLarryHogan I'd like to extend my heartfelt congratulations to @GovernorKayIvey on joining the cancer-free club! The First Lady and I are praying for your continued good health.", "2020-01-09T16:48:51.000Z": "Today's news of the ... @Airbus  expansion is a big vote of confidence in the quality and caliber of the Alabama workforce! #alpolitics ... @MadeinAL  https:// al.com/business/2020/ 01/airbus-adds-275-new-jobs-ahead-of-tariff-deadline.html ", "2020-01-09T15:34:01.000Z": "In 2019, we lost seven of our brothers in blue. These tragedies are near to our hearts & remind us of the sacrifices made for our protection. On National Law Enforcement Appreciation Day, let us pause to remember the lives of those we've lost & thank those who serve. #BackTheBlue", "2020-01-08T23:03:25.000Z": "Thank you, Congressman! To God be the Glory! Quote Tweet Robert_Aderholt @Robert_Aderholt I'm thankful to hear that @GovernorKayIvey had a great doctor's report and is considered cured. Let's keep the Governor and her team in our prayers for continued healing.", "2020-01-08T22:55:30.000Z": "Alabama is making history! #alpolitics  @AerojetRdyne  @BoeingSpace Quote Tweet NASA_SLS @NASA_SLS History in the making! Together with @BoeingSpace and @AerojetRdyne , @NASA has loaded the first SLS rocket core stage for #Artemis 1 onto NASA's Pegasus barge in preparation for its delivery to @NASAStennis for the Green Run test series. MORE >> http:// go.nasa.gov/35DzzG6", "2020-01-08T16:47:45.000Z": "Apprenticeships are opportunity multipliers. The AOA is going to have a major impact on AL reaching our Success+ goal of adding 500,000 skilled workers to the workforce by 2025. I look forward to working with this group in the years to come. #alpolitics  #StrongStartStrongFinish", "2020-01-08T16:47:24.000Z": "At the start of this year, we find AL's economic engine running at full speed & firing on all cylinders! I'm happy to join the AL Apprenticeship Council for their first meeting & charge them with building on our success as they develop the AL Office of Apprenticeship. #alpolitics", "2020-01-07T22:07:43.000Z": "I look forward to talking with @NewsTalkWANI 's Zac Blackerby & Auburn Councilman Brett Smith about AL's booming economy & the importance local cities, like @CityofAuburnAL , play in this success. Tune in to \"News Talk 98.7 FM\" tomorrow morning at 8:45! #alpolitics", "2020-01-07T21:46:12.000Z": "I'm pleased to appoint Dr. Tommie Stewart to represent District 5 on the State Board of Education. I look forward to serving alongside her as we work to build a stronger future for our state. https:// governor.alabama.gov/press-releases /governor-ivey-appoints-dr-tommie-stewart-to-state-board-of-education/   #alpolitics  #aledchat  #SBOE @ALSDEdotEDU", "2020-01-07T20:51:19.000Z": "For ten months in a row, Alabama has met or surpassed the nation's annual job growth! #ALjobs  #wehavejobs  @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem", "2020-01-06T16:20:02.000Z": "From technology education to the various STEM fields represented here in our state, I'm proud of the progress Alabama has made in technology. #NationalTechnologyDay", "2020-01-04T20:00:05.000Z": "Congrats to AL's Tourism Dept. for winning a major, international award for its marketing campaign of the U.S. Civil Rights Trail. We are excited to share with everyone that AL is the \"Best Regional Destination\" in the world!  @TweetHomeAla  #alpolitics Alabama wins international tourism award wsfa.com", "2020-01-03T16:34:07.000Z": ". @GovernorKayIvey has awarded grants totaling $46.2 million to assist low-income families in Alabama with energy bills. http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=13635 ", "2020-01-02T21:44:27.000Z": "The countdown is on! Oct. 1, 2020, is the deadline for STAR IDs and it will be here before we know it. Click on the following links for more information on what documents are needed to obtain a STAR ID and frequently asked STAR ID questions.  (1/2)", "2020-01-02T16:07:26.000Z": "As we enter into 2020, we are gearing up at the state and local levels for a successful #2020Census in Alabama! #AlabamaCounts Alabama bucks red state trends; boosts Census awareness Alabama is one of the few states in the U.S. that is controlled by Republicans that is investing in Census awareness this year. The efforts are trickling down to the local levels where city and... al.com", "2020-01-01T14:11:21.000Z": "2019 was a year full of excitement, triumph & challenges. As we chart a new course, I hope that you'll join me in keeping our momentum going strong. It's my sincere wish that 2020 brings each of you & our great state much joy & prosperity. Happy New Year! Governor Kay Ivey's New Year Message 2020 Alabama Governor Kay Ivey's New Year Message 2020 (Governor's Office, Lori Davis Jhons) youtube.com", "2019-12-31T19:11:38.000Z": "As 2019 comes to a close, I want to share my top 200 photos to reflect on AL's bicentennial year. If you see an image you like or are pictured in, feel free to download it via my Flickr page & share it with your friends! #HappyNewYearsEve  #alpolitics 123119 Year in Review View the album on Flickr. flickr.com", "2019-12-26T21:55:56.000Z": "The gifts are still coming this season! Alabama had the 5th lowest unemployment rate in the nation! #ALjobs  #wehavejobs  @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem  @NASWAORG", "2019-12-25T14:14:28.000Z": "On this joyous day, we celebrate the gift of our Savior! I pray that during this beautiful season, we are reminded of the love we receive from Jesus & extend that to our neighbors, family & friends. I pray you have a very, Merry Christmas! Governor Kay Ivey's Christmas Message 2019 Alabama Governor Kay Ivey's Christmas Message 2019 (Governor's Office, Lori Davis Jhons) youtube.com", "2019-12-23T15:34:09.000Z": "Thankful for the service of so many Alabamians. Merry Christmas! Quote Tweet AL National Guard @AlabamaNG Merry Christmas, Happy Holidays and a blessed New Year from our family to yours.", "2019-12-22T15:01:40.000Z": "Flags across AL are being flown at half-staff today to honor @USNavy Ensign Joshua Kaleb Watson, who died as a hero trying to protect his fellow service members on Dec. 6. His act of bravery will always be remembered. May God comfort his family & friends, as he is laid to rest.", "2019-12-20T18:17:57.000Z": "Alabama has the largest unemployment rate decrease in the country! #ALjobs  #wehavejobs  @ADOLSecretary  @GovernorKayIvey  @ALWorksSystem", "2019-12-20T18:22:18.000Z": "Congratulations to #MissAmerica2020 Camille Schrier of Virginia! On top of winning, she's a biochemist focused on showing kids that science is fun.  @MissAmericaVA , you are welcome to visit Alabama anytime! #STEM  #GirlsInSTEM  #GovIveyforCS  @MissAmerica Camille Schrier Just Won Miss America 2020 With a Little Help From Explosive Colorful Foam That's science time.com", "2019-12-20T18:02:23.000Z": "@GovernorKayIvey awards two grants to provide broadband access http:// media.alabama.gov/AgencyTemplate s/adeca/adeca_pr6.aspx?id=13630 ", "2019-12-20T14:32:24.000Z": "Just in time for Christmas - Alabama has set a NEW, historic low unemployment rate of 2.7%! For 7 consecutive months, we've continued to break records & beat expectations. All this data combines to paint a picture of economic health in Alabama. @al_labor  #WeHaveJobs  #alpolitics Quote Tweet ADOL @al_labor Another month, another NEW record low unemployment rate! Alabama continues to break records: more jobs , more people working, fewer people counted as unemployed, and more people in the workforce. #ALjobs  #wehavejobs  @GovernorKayIvey  @ADOLSecretary  @ALWorksSystem", "2019-12-20T00:07:51.000Z": "Thank you @BetsyDeVosED & @usedgov for awarding the Alabama College of Osteopathic Medicine an Emergency Assistance to Institutions of Higher Education grant to help assist our teachers and students in Dothan. https:// ed.gov/news/press-rel eases/department-education-announces-recovery-assistance-students-schools-impacted-natural-disasters   @ACOMEDU  #alpolitics", "2019-12-19T23:37:48.000Z": "Construction of the Birmingham Northern Beltline will resume soon thanks to legislation passed in Congress today! This is great news for the Birmingham region & our entire state. We thank @SenShelby for his leadership in securing this funding. #alpolitics Governor Ivey Says Birmingham Northern Beltline Construction to Continue - Office of the Governor... MONTGOMERY - Governor Kay Ivey on Thursday announced that construction of the Birmingham Northern Beltline will resume soon thanks to funding secured by U.S. Senator Richard Shelby. Funding for the... governor.alabama.gov", "2019-12-19T22:41:03.000Z": "Be sure to tune in to @wsfa12news at 6 tonight to watch my exclusive, end-of-the-year interview with @LydiaNusbaum ! We had a great time reviewing the legislative progress we've made in 2019 & discussing what's ahead for our state in 2020. #alpolitics", "2019-12-19T22:33:16.000Z": "I'm excited to announce the Dept. of Early Childhood Education was awarded $33 million by @HHSGov & @usedgov for a renewal of AL's Preschool Development Grant Birth Through Five initiative over the next three years! https:// governor.alabama.gov/press-releases /governor-ivey-announces-33-million-renewal-grant-awarded-to-early-childhood-education/   #StrongStartStrongFinish  #alpolitics", "2019-12-18T19:49:23.000Z": "I'm excited to attend the ACCCP's inaugural meeting & look forward to this team helping AL to reach our state's post-secondary attainment goal of adding 500,000 highly-skilled Alabamians to the workforce by 2025. #alpolitics  #AlabamaWorks  @ACCS_Education @ALSDEdotEDU", "2019-12-18T19:48:47.000Z": "AL's economic future depends on education & workforce development. With the help of community stakeholders & the legislature, we established the Alabama Committee on Credentialing & Career Pathways during the 2019 session. #alpolitics  #AlabamaWorks  @ACCS_Education @ALSDEdotEDU", "2019-12-18T16:25:09.000Z": "Thank you @WHhistoryPres & @WhiteHouseHstry for honoring Alabama's history this holiday season. Merry Christmas! Quote Tweet White House History @WhiteHouseHstry ...and on @GovernorKayIvey 's tree in Alabama. twitter.com/WHhistoryPres/", "2019-12-18T16:10:01.000Z": "Deadline Reminder | \n\nI encourage K-12 students interested in computer programming & design to take on my #GovAppChallenge ! Get registered before Dec. 20 to compete for a chance to participate in the 2020 Alabama Computer Science Summit. http:// bit.ly/19-20AppChallR eg   #GovIveyforCS", "2019-12-18T15:41:06.000Z": "News from the @WhiteHouse : @POTUS has announced his intent to nominate Anna Manasco of #Birmingham to serve as a District Judge for the Northern District of #AL . Anna is an impressive nominee, & I am confident that, if confirmed, she will work to uphold the rule of law.", "2019-12-18T02:08:43.000Z": "This evening, I'm proud to host the team that makes our annual Candlelight Tours possible. They put in so much time & effort to make sure everyone feels at home when they visit here. Thank you to the Friends of the Governor's Mansion, Master Gardeners, Docents & Designers!", "2019-12-17T19:32:17.000Z": "While many of us are preparing for the holidays, some of our fellow Alabamians are struggling to keep a roof over their heads & others don't have a place to call home at all. I'm pleased to award $2.5 M for emergency housing assistance to families in need. https:// governor.alabama.gov/press-releases /gov-ivey-awards-more-than-2-5-million-for-emergency-housing-assistance-across-alabamagov-ivey-awards-more-than-2-5-million-for-emergency-housing-assistance-across-alabama/ ", "2019-12-17T18:57:12.000Z": "@Boeing is partnering with @MadeinAL and @GovernorKayIvey to make @LearningBlade STEM career exploration tool available to Alabama students in grades 5-9.\n\n>> AL SCHOOLS (GRADES 5-9) REGISTER FOR A FREE LICENSE HERE: http:// ow.ly/iDoi50xCsRO  http:// ow.ly/GEik50xCsRN  @yhn", "2019-12-17T15:03:51.000Z": "I urge everyone to remember those affected by last night's storm, whether it be those who have lost family members, those who were injured or those who lost their homes. We must support our neighbors & remind them they're not alone. Full statement: https:// governor.alabama.gov/statements/gov ernor-ivey-issues-statement-following-severe-weather-impact/   #ALwx", "2019-12-17T01:09:25.000Z": "The Christmas season is always such a special time at the mansion. Tonight, I enjoyed meeting hundreds of Alabamians as they strolled through each room observing the elegant arrangements of ornaments & garland throughout this beautiful home.", "2019-12-16T22:09:56.000Z": "Currently, it looks like Alabama could see impact soon, and the threat remains overnight and into the morning. We all must stay weather aware, and tune into our local forecasts. #alpolitics  #ALWX (2/2)", "2019-12-16T22:09:31.000Z": "My team at @AlabamaEMA and I are watching this storm system closely and stand ready to respond to however it may impact the state. #alpolitics  #ALWX (1/2)", "2019-12-16T17:23:06.000Z": "Don't forget tonight's the last night of our annual Christmas Candlelight Tours! Come by between 5:30 - 7:30 p.m. to see the beautiful decorations & listen to the sweet sounds of musicians, Kimberley & Darrell Glover. I look forward to seeing you here!", "2019-12-15T15:08:41.000Z": "I also want to extend a special thanks to all the #AL200 sponsors! This was a team effort. We appreciate all that you did for AL's 200 birthday. @alabamapower  @RegionsNews  @PoarchCreek  @CocaCola  @Toyota  @ATTPolicyAL  @BCBSofAlabama  @Hyundai  @MercedesBenzUSA  @Verizon  @HondaAlabama", "2019-12-15T15:05:54.000Z": "AL sure knows how to throw a party! This three-year celebration wouldn't have been possible w/o the time & effort put forth by the Bicentennial Commission. Thank you to the #AL200 Commission, @SenatorOrr & the student committee for spearheading this endeavor. Job well done!", "2019-12-14T21:37:42.000Z": "If you haven't made your way to Montgomery, there is still time to participate in Alabama's 200th birthday celebration. You don't want to miss the FINALE, following our terrific concert lineup! http:// al200finale.org  #AL200  @AL200", "2019-12-14T20:31:02.000Z": "Let us now go into our third century confident of thisour future is guaranteed to be brighter if we travel this road together! #AL200  @al200", "2019-12-14T20:30:03.000Z": "One of the first & most lasting ways that we acknowledge both our history & our future is through the unveiling of Alabama Bicentennial Park today. Thank you to the AL Legislature & to artist Caleb O'Connor for making this legacy park possible. #AL200  @al200", "2019-12-14T20:27:38.000Z": "Today is a special day! It's the culmination of years of anticipation, hard work & planning to honor AL & her people on her 200th birthday. I'd like to assure Alabamians of the future that we're carrying fwd the legacy of the past & continuing to seek ways to make AL even better.", "2019-12-14T16:03:40.000Z": "The bicentennial parade is so much fun! Come celebrate #AL200 with us! #alpolitics", "2019-12-14T14:26:21.000Z": "Today's the big day - Happy 200th Birthday, Alabama! Take a look at our triumphant history: https:// youtube.com/watch?v=kBxDR5 Q1kJw&t=132s  . I commend @WBRCnews , @wsfa12news , @waff48 , and @WTVYNews4 for their collaboration on this special tribute to #AL200 . @al200 Alabama Bicentennial: The Stories of Our People Video Courtesy of WBRC FOX6 News. youtube.com", "2019-12-14T01:44:09.000Z": "Tonight, it's my privilege to introduce one of Alabama's most accomplished citizens, @CondoleezzaRice ! I look forward to hearing her keynote address for @al200 's \"Remembering the Past, Shaping the Future\" event. #AL200  #alpolitics", "2019-12-14T01:43:32.000Z": "Since kicking off our #AL200Countdown in 2017, I've been on a mission to spread #AL200 excitement to all 67 counties of our great state. This weekend's events are a culmination of the hard work & creativity of many Alabamians. @al200", "2019-12-13T21:03:18.000Z": "On the eve of our state's bicentennial celebration, I want to make a special presentation to my hometown of Camden. I'm proud to present these flags from the mansion to Mayor Creswell to display in the Wilcox Co. Courthouse for years to come. #AL200Countdown  #AL200  @al200", "2019-12-13T17:44:45.000Z": "The @USDA has announced the availability of a 2nd round of $550 M in their ReConnect Pilot Program. Thank you @SecretarySonny for investing in broadband infrastructure in #RuralAmerica . Applications are available starting Jan. 31, 2020. https:// usda.gov/media/press-re leases/2019/12/12/usda-make-550-million-funding-available-2020-deploy-high-speed   @usdaRD  #alpolitics USDA to Make $550 Million in Funding Available in 2020 to Deploy High-Speed Broadband Internet... STANTON, Iowa, Dec. 12, 2019 - U.S. Secretary of Agriculture Sonny Perdue today announced the availability of a second round of $550 million in United States Department of Agriculture (USDA) Reconn... usda.gov", "2019-12-13T15:59:33.000Z": "I'm saddened to hear of the news coming out of Ozark this morning, where a police officer was shot in the line of duty. I'm praying for this member of the Ozark Police Department and his family during this difficult time. @EverythingOzark  #alpolitics  #BackTheBlue  #ThinBlueLine", "2019-12-13T15:48:26.000Z": "Happy Birthday, @USNationalGuard ! Today, we say thank you to our very own @AlabamaNG service members for living up to the Guard's motto \"Always Ready Always There.\" During difficult times, our state & country have always been able to turn to the ALNG to execute the mission.", "2019-12-12T23:28:21.000Z": "Today @SenDougJones & I proudly introduced a resolution that passed the Senate recognizing the 200th anniversary of the entry of #Alabama into the Union as the 22nd state. What better time to remember Alabama's history & celebrate all we have accomplished! Shelby, Jones Honor Alabama Bicentennial With Senate Resolution WASHINGTON, D.C. - U.S. Senators Richard Shelby (R-Ala.) and Doug Jones (D-Ala.) today introduced a Senate resolution recognizing and celebrating the 200th anniversary of the entry of Alabama into... shelby.senate.gov", "2019-12-12T21:00:05.000Z": "Did you know? Over 850,000 #STEM occupations will be needed in #Alabama by 2026. That's why @GovernorKayIvey 's Advisory Council for Excellence in STEM, led by #HudsonAlpha 's @neillamb developed the Roadmap to STEM Success. Learn more #workforce  #inspire  https:// buff.ly/2Kbmf3Z", "2019-12-12T21:08:16.000Z": "During #CSEdWeek , I want to remind HS girls that registration is open for the #GirlsGoCyberStart competition. It's a free, online series of challenges that teaches students the basics of cybersecurity & offers scholarships & prizes to the top performers. https:// governor.alabama.gov/press-releases /governor-ivey-announces-alabamas-participation-in-the-2020-girls-go-cyberstart-challenge/ ", "2019-12-12T20:19:01.000Z": "Our success as a state comes from the cooperation of organizations like @powersouth that know what it means to work as a team to get the job done. During this holiday season, I want to thank them for their support of state initiatives like #RebuildAL , which will help AL move fwd.", "2019-12-12T18:15:34.000Z": "AL's long tradition in metals manufacturing ignited in the @cityofbhamal . During the Industrial Revolution, Birmingham was the fastest-growing industrial city in the U.S. Now, Vulcan sits atop of Red Mountain as a symbol of the Magic City's storied history. #AL200Countdown  #AL200", "2019-12-11T21:50:05.000Z": "Gov. Albert Brewer celebrated Alabama's 150th birthday in 1969 by writing a letter to the AL governor of 2019. He wrote that AL would have \"unparalleled growth\" in the years to come. He was spot on! I will celebrate #AL200 by writing my own letter to AL's governor in 2069. @al200", "2019-12-11T19:09:11.000Z": "It's time for the 2019 #GovAppChallenge ! I was impressed w/ last year's participants & want to encourage even more students to take on the challenge. Get registered before Dec. 20 at http:// bit.ly/19-20AppChallR eg  . Our top teams will be recognized in the Spring! #GovIveyforCS  #CSEdWeek", "2019-12-11T17:40:36.000Z": "Throughout our #AL200 history, Alabama has played a central part of some our nation's most memorable sports moments. Alabamians embrace our sports culture & take pride in knowing that we've produced some of the greatest coaches & athletes of all time. #AL200Countdown  @al200", "2019-12-10T21:57:55.000Z": "Thank you to the team at Accordia Health Clinic for showing me around your new facility in Rockford. Providing Alabamians with access to quality health care is critical in all parts of our state, especially #ruralAL . @AltaPointeHS  #alpolitics  @Clyde_Chambliss", "2019-12-10T20:07:55.000Z": "Recap | @CBS_42 Alabama's P-3 initiative builds upon student success and narrows the achievement gap by expanding access to the nationally recognized high quality First Class Pre-K model.\n\nLearn more: https:// bit.ly/2YCJKsU  #PreK4AL  #StrongStartStrongFinish Alabama expanding education to younger students with P-3 MONTGOMERY, Ala. (WIAT) - You maybe familiar with the state's pre-kindergarten program, but there's now an extension of that called the Alabama Pre-K- 3rd Grade Integrated Approac cbs42.com", "2019-12-10T18:24:08.000Z": "As part of the #AL200Countdown , I'm proud to honor our state's rich Native American history, which dates back before AL was even a state. Native Americans were AL's first inhabitants & deserve to be recognized for their many contributions. https:// youtu.be/g_MtU96N8vc  #AL200  @al200 Gov. Ivey Hosts Native American History Celebration Alabama Governor Kay Ivey hosted a bicentennial flag ceremony recognizing the contributions Native Americans have made to the state of Alabama's history over... youtube.com", "2019-12-10T16:53:53.000Z": "I've directed flags be flown at half-staff in AL today to honor @HsvPolice Officer Billy Clardy. His many years of admirable service to his state & country are to be commended. I extend my deepest sympathies & prayers to Officer Clardy's family & to @huntsvillecity . #BackTheBlue", "2019-12-10T02:30:44.000Z": "Great news! Quote Tweet Alabama Department of Corrections @ALCorrections K-9 JEWEL HAS BEEN FOUND\n\nAfter a 3-Day search, K9 Handlers and the Escambia County Sheriff's Department found Jewel along the trail of the manhunt they conducted on Friday. She has been taken to the veterinarians and is expected to make a full recovery.", "2019-12-10T00:57:03.000Z": "One thing I've learned through my time of service, is that we are only successful, when we are successful together. It's my pleasure to join @AlfaFarmers for their annual meeting tonight and to publicly express my appreciation for their support of #RebuildAL . #alpolitics", "2019-12-09T20:33:54.000Z": "The #AL200 celebration is quickly approaching! Make plans to attend this weekend and participate in a variety of festivities by going to http:// al200finale.org . #AL200Countdown  @al200", "2019-12-09T19:53:09.000Z": "Sometimes the best man for the job is a woman! In honor of ALEA Chief Deena Pregno's retirement, we decided to gather our women in blue to recognize her. I commend Chief Pregno for her dedicated 33 years of service to AL, & for serving as a role model to her fellow officers.", "2019-12-09T18:59:11.000Z": "During our annual #WreathsAcrossAmerica ceremony, we join folks across the country in honoring the great sacrifices of our fallen service members by laying a wreath here at the Fallen Heroes Memorial. We also remember to keep those serving overseas in our prayers this Christmas.", "2019-12-09T16:39:04.000Z": "Don't forget about our Candlelight Tours this month at the mansion! Come out tonight between 5:30-7:30 to see the festive decorations & listen to the tunes of Albertville High School's Show Choir. https:// wtvy.com/content/news/G overnors-Mansion-open-for-candlelight-tours-565692041.html   @TweetHomeAla Governor's Mansion open for candlelight tours Gov. Kay Ivey will open the Governor's Mansion for candlelight tours on the first three Monday nights in December. wtvy.com", "2019-12-08T16:23:13.000Z": "Alabama's history is heavily rooted in agriculture. From timber to poultry, AL is key to our nation's Ag industry. Now more than ever, it is critical that we invest in our future farmers. Thank you to all of our agriculturalists! #AL200  #AL200Countdown  @AL200  @AlaAgriculture"}