{"2020-07-30T14:47:50.000Z": "#COVID19 testing is available at more than 370 sites across Arizona. \n\nInformation on these testing opportunities, including locations, hours of operation and pre-registration requirements, can be found here: http:// azhealth.gov/testing  @AZDHS AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-29T19:00:02.000Z": "NWS has issued an Excessive Heat Warning for 13 counties: Cochise & Santa Cruz, 7/29 11AM - 7/30 10AM Coconino, Graham, Greenlee, Maricopa, Pima, and Pinal, 7/29 10AM - 8/1 8PM Gila, La Paz, Mohave, Yavapai, and Yuma, 7/30 10AM - 8/1 8PM https:// 1.azdhs.gov/2P4HBls  #AZheat", "2020-07-29T22:00:00.000Z": "Yesterday, Arizona launched a task force to ensure our seniors being cared for in long-term care facilities are safe and able to stay connected with their loved ones. See more via @azfamily", "2020-07-29T21:29:14.000Z": "These health and safety precautions are simple, but effective. And they protect you, your loved ones and our communities. GIF", "2020-07-29T21:20:32.000Z": "REMINDER: Resources and assistance for businesses during #COVID19 has been made available via @azcommerce and can be found here: https:// azcommerce.com/covid-19/ 2/2 COVID-19 Arizona Business Resources | Arizona Commerce Authority Under Governor Doug Ducey's leadership, the State of Arizona is prioritizing the health and safety of its residents. The Arizona Commerce Authority has gathered resources to support businesses and... azcommerce.com", "2020-07-29T21:19:58.000Z": "Today we had a call with business leaders and entrepreneurs to hear an update from them. We know this has been a sacrifice for many and are grateful for the continued cooperation and patience from our business community. @drcarachrist  @SandraWatsonAZ  @DebJohnsonAz", "2020-07-29T18:14:37.000Z": "#Arizona : protect your #health in the heat, protect others when you #MaskUp .\n\nCare for yourself, care for your community. #MaskUpAZ  #COVID19  #Coronavirus Quote Tweet Doug Ducey @dougducey #MaskUpAZ", "2020-07-29T17:43:41.000Z": "#MaskUpAZ", "2020-07-29T17:15:09.000Z": "Proud to see Mayo Clinic Hospital in Arizona made the \"Best Hospitals Honor Roll\" by @usnews .\n\nArizona is grateful to the hardworking nurses, doctors and staff at @MayoClinic and across our state for all they do to protect the health & safety of Arizonans. Mayo Clinic No. 1 in Phoenix and Arizona on U.S. News & World Report's 'Best Hospitals' rankings Arizona hospital in the nation's top 20 and 11 of its specialty areas ranked nationally   PHOENIX - Mayo Clinic [...] newsnetwork.mayoclinic.org", "2020-07-29T17:00:41.000Z": "We'll continue to monitor this situation closely and make all support available. 3/3", "2020-07-29T17:00:27.000Z": "The State of Arizona, including @Arizona_DPS , @ArizonaDOT and @ArizonaDEQ , are actively coordinating with local responders. I've also reached out to Tempe Mayor Corey Woods to express the State's full support in this response. @mayorcoreywoods", "2020-07-29T17:00:01.000Z": "I commend the quick actions of first responders this morning to protect lives and property. Our focus is on protecting public safety and providing any and all resources and assistance necessary to aid Tempe. @Tempegov", "2020-07-29T15:53:47.000Z": "It's time to #MaskUpAZ . @AZDHS is providing free face masks for vulnerable and high risk populations. Order yours today! #keepingarizonahealthy Quote Tweet AZ Dept of Health @AZDHS Free cloth face masks: Last week we launched this new order form for Arizona's vulnerable populations - individuals 65 years and older or otherwise high risk for #COVID19 . If you need masks, please order yours today https://", "2020-07-29T15:13:24.000Z": "Thank you to all first responders battling this fire. @TempePolice  @Arizona_DPS Quote Tweet Tempe Police @TempePolice Multiple agencies are hard at work battling this 2nd alarm fire. Additional road closures are now in place including 202 from 101 to the SR143. @Arizona_DPS Show this thread", "2020-07-28T22:49:43.000Z": "@quintinboyce  @BuckeyeESD  @KwilsonBESD33  @BASISed  @AMSSchools  @KimChayka  @ASUPrepAcademy  @JulieYoungEDU  @Supt_Hoffman  @drcarachrist  @AZDHS  @ArizonaDES  @azedschools", "2020-07-28T22:49:21.000Z": "My thanks to all our school officials for their continued leadership and commitment to our students. @chadgestson  @PhoenixUnion  @AvondaleESD  @ChandlerUnified  @CamilleCasteel  @YUHSD  @gthompsonyuhsd  @mpsaz  @TollesonESD  @LupitaHightower  @vailschools  @Florenceusd  @RSDNo66", "2020-07-28T22:49:03.000Z": "Arizona's education leaders are working hard to ensure all students have a successful academic year. \n\nWe joined superintendents and charter school leaders to continue discussions on providing safe, high quality learning opportunities and options for families. 1/", "2020-07-28T20:22:15.000Z": "Phoenix was ranked in the top 10 for #STEM job growth by @RCLCO ! https:// bizjournals.com/phoenix/news/2 020/07/28/phoenix-named-top-10-metro-for-stem-job-growth.html   @phxbizjournal Phoenix named among top 10 metros for STEM job growth The report measured 38 urban areas according to a \"STEMdex\" that focuses on population and economic growth, workforce quality, quality of life and the cost of doing business. bizjournals.com", "2020-07-28T20:05:33.000Z": "Just updated @VP and fellow governors on Arizona's work to protect health and safety, including our \"Open For Learning\" school plan, surge testing in Maricopa County, and the extended pause on high-risk activities. Thank you to the Administration for the continued support.", "2020-07-28T19:39:32.000Z": "More on the Task Force On Long-Term Care: https:// azgovernor.gov/governor/news/2020/07/governor-ducey-announces-task-force-long-term-care  5/5 Governor Ducey Announces Task Force On Long-Term Care PHOENIX⁠ - Governor Doug Ducey today announced the establishment of the Task Force On Long-Term Care. The task force will focus on developing recommendations and metrics on how and when visitation... azgovernor.gov", "2020-07-28T19:39:06.000Z": "Thank you to the task force members for your participation. @KateMcGeeAZ  @TylerPaceAZ  @JoanneOsborne8  @recobbforazrep  @CCorieri  @colbybower  @AHCCCSgov  @ArizonaDES  @kennedydana  @AZHealthAssoc  @LeadingAgeAZ  @Joseph_La_Rue  @SunHealthAZ  @Dcslaz32Living", "2020-07-28T19:38:46.000Z": "The task force will focus on developing recommendations and metrics on how and when visitation can be safely resumed and what steps facilities can take before then to help long-term care residents and their loved ones maintain contact. 3/", "2020-07-28T19:38:20.000Z": "Today I'm announcing the Task Force On Long-Term Care, bringing together public health officials, medical experts, senior advocates, private sector leaders, legislators and family members to help us develop sound policy as it relates to long-term care facilities. 2/", "2020-07-28T19:37:47.000Z": "Throughout #COVID19 , Arizona has focused on protecting those most at risk, especially our seniors and vulnerable adults. Many of us have family and loved ones in long-term care facilities and are looking for guidance on when it may be safe to visit them again. 1/", "2020-07-28T18:18:25.000Z": "Please share: Today is the last day for  #COVID19 surge testing. Learn more & pre-register here: http:// azhealth.gov/surgetesting  @AZDHS  @dougducey  @9thFloorAZ Quote Tweet Doug Ducey @dougducey Today is the last day to take advantage of FREE #COVID19 testing operated by @HHSGov at sites in Maryvale and South Mountain. \n\nThose interested in getting tested can get details and pre-register here: http:// azhealth.gov/surgetesting  @AZDHS", "2020-07-28T17:46:41.000Z": "Grateful for the leadership of President Cheng at @NAU . Our universities have been tackling #COVID19 with innovative and thoughtful responses to ensure students can access a quality education in a safe environment. @NAUPresident", "2020-07-28T17:40:09.000Z": "Thank you, @Arizona_DPS ! #AZTroopers Quote Tweet Dept. of Public Safety @Arizona_DPS On July 22, 2020, District 5 troopers delivered boxes of donated food & supplies to the Foundation for Senior Living (FSL) in Phoenix. Concerned for the well-being of seniors during the pandemic, #AZTroopers from many districts came together to donate food & essential items.", "2020-07-28T14:53:20.000Z": "Free #COVID19 saliva testing in partnership with @AZDHS is available this morning, 7/28 until 12pm at @statefarmstdm .\n\n- Register below (use agency code FvCmy1fGe when prompted)\n- Arrive at your scheduled time \n- Have QR code + ID ready https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-saliva-testing ", "2020-07-28T14:00:01.000Z": "Today is the last day to take advantage of FREE #COVID19 testing operated by @HHSGov at sites in Maryvale and South Mountain. \n\nThose interested in getting tested can get details and pre-register here: http:// azhealth.gov/surgetesting  @AZDHS AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-27T22:45:04.000Z": "Free #COVID19 saliva testing will be available tomorrow and Aug. 1 at @statefarmstdm . Testing is also available Wednesday, July 29, in Tucson. @ASUBiodesign  @AZDHS Get more information and pre-register here: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-27T20:00:00.000Z": "#COVID19 saliva testing in partnership with @AZDHS will be available Tuesday, 7/28 from 7am-12pm at @statefarmstdm .\n\n- Register below (use agency code FvCmy1fGe when prompted)\n- Arrive at your scheduled time \n- Have QR code + ID ready ASU Biodesign/AZDHS Saliva testing registration azdhs.gov", "2020-07-27T18:22:53.000Z": "These simple health and safety precautions make a big difference. We all have a role in containing the spread of #COVID19 . GIF", "2020-07-27T16:19:28.000Z": "Tomorrow is the last day to take advantage of free #COVID19 surge testing operated by @HHSGov at sites in Maryvale and South Mountain.\n \nInformation on locations, hours of operation, and pre-registration can be found here: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-26T21:40:50.000Z": "Pre-register for free #COVID19 testing at sites in Maryvale and South Mountain: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-26T20:00:09.000Z": "Thank you @AZNationalGuard ! Quote Tweet Air National Guard @AirNatlGuard The @AZNationalGuard partnered with the Whiteriver Indian Health Services Unit to provide free #COVID19 testing for White Mountain Apache Tribe members. During the pandemic, AZNG Airmen & Soldiers are responding to tribal governments' requests for relief. TSgt. Michael Matkin", "2020-07-26T16:15:00.000Z": "#MASKUP : @ScottGottliebMD tells @margbrennan widespread mask mandates and closures of businesses, similar to Arizona Gov. @dougducey 's actions, were \"instrumental\" in helping tamp down spread of #COVID19 in the sunbelt region of the U.S.", "2020-07-25T20:16:05.000Z": "Santa Cruz County would like to extend a huge thank you to @drcarachrist and Governor Ducey @dougducey for supporting the SCC testing blitz and for the ELC grant.  As of 9:30 am, we have tested more than 300 community members with an approximate wait time of 17 minutes.", "2020-07-26T15:54:00.000Z": "For an idea of just some of the good Mike did in his life, watch this video: https:// youtu.be/c53ZDNheArg Quote Tweet Doug Ducey @dougducey Yesterday, Arizona lost Mike McQuaid Sr., one of our brightest lights and champions for good. A 50-year resident of Phoenix, Mike turned a successful business career into a passion for serving others, especially those experiencing homelessness. 1/ Show this thread", "2020-07-26T15:52:56.000Z": "My prayers and deepest sympathies go out to Mike's family, loved ones and all who knew him. He will be deeply missed, but his legacy and spirit of service will live on. 4/4", "2020-07-26T15:52:40.000Z": "Since 2004, Mike also has provided scholarships to students in need through his foundation, the McQuaid Family Foundation. He's someone who made miracles happen everyday; someone whose heart of kindness & compassion has improved the lives of countless men, women and children. 3/", "2020-07-26T15:52:09.000Z": "After years of volunteering w/ his family at @andrehouseaz , Mike was a driving force behind the creation of @HSCPhx in DT Phoenix, a site that serves over 1,000 homeless men and women a day providing food, shelter, & medical care, as well as employment and housing assistance. 2/", "2020-07-26T15:51:01.000Z": "Yesterday, Arizona lost Mike McQuaid Sr., one of our brightest lights and champions for good. A 50-year resident of Phoenix, Mike turned a successful business career into a passion for serving others, especially those experiencing homelessness. 1/", "2020-07-25T20:35:41.000Z": "More than 300 #COVID19 testing sites are available across the state. More here: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-25T20:34:51.000Z": "Free #COVID19 testing is available at sites in Maryvale and South Phoenix! Pre-register: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-25T17:46:50.000Z": "Thank you Governor Ducey and Dr.Christ for approving the Santa Cruz County testing grant!", "2020-07-25T16:00:01.000Z": "On July 25, 2018, Trooper Tyler Edenhofer was killed when he & another trooper were shot by a suspect who obtained a service weapon during a physical altercation along I-10. Both troopers were taken to the hospital, where Trp Edenhofer died of his wounds. #WeWillNeverForget  #LODD", "2020-07-25T15:31:26.000Z": "On July 25, 2018, AZ lost Trooper Tyler Edenhofer, who was killed in the line of duty. He had graduated from the academy less than 3 months earlier and served in the Navy before that. \n\nWe send our prayers to Trooper Edenhofer's loved ones. His sacrifice will not be forgotten.", "2020-07-24T23:44:21.000Z": "Happy #OpeningDay ! @Dbacks Quote Tweet Arizona Diamondbacks @Dbacks Our 2020 #OpeningDay starting lineup! #RattleOn", "2020-07-24T01:10:00.000Z": "Baseball doesn't just teach us life lessons, it helps us through life.\n\nIt's been there to unite us, to distract us, and to push us forward.\n\nTogether we #RattleOn . The following media includes potentially sensitive content. Change settings View", "null": "", "2020-07-24T20:01:00.000Z": "Cubrebocas de tela gratuitos: La semana pasada lanzamos este formulario para pedidos para las personas vulnerables de Arizona: personas de 65 años o más o de alto riesgo para #COVID19 . Si necesita cubrebocas, pida las suyas hoy https://", "2020-07-24T20:00:01.000Z": "Free cloth face masks: Last week we launched this new order form for Arizona's vulnerable populations - individuals 65 years and older or otherwise high risk for #COVID19 . If you need masks, please order yours today https://", "2020-07-24T19:57:55.000Z": "Education and community leaders across the state have voiced their support for Arizona's \"Open For Learning\" plan. Here's what they have to say Support For Arizona's \"Open For Learning\" Plan azgovernor.gov", "2020-07-24T18:42:33.000Z": "#PonteLaMascarillaAZ  #UsaCubrebocas", "2020-07-24T15:46:40.000Z": "Thank you @dougducey for prioritizing public health and taking continued action to reduce the spread of #COVID19 . #KeepingArizonaHealthy  #MaskUpAZ Quote Tweet Doug Ducey @dougducey Over recent weeks, Arizona has made significant progress to contain the spread of #COVID19 , but we cannot let up.\n\nThat's why today I'm extending a pause on gyms, bars, movie theaters, water parks and tubing, as well as continuing to prohibit large gatherings. 1/ Show this thread", "2020-07-24T17:50:51.000Z": "\"Arizona Gov. Doug Ducey is kicking in $440 million in federal funding to help Arizona's K-12 public schools begin the 2020-2021 academic school year.\" @phxbizjournal Ducey unveils back-to-school plan with $440M federal funds The back-to-school plan requires that schools provide on-site learning and support services for students who need a place to learn in order to qualify for this funding. bizjournals.com", "2020-07-24T11:07:26.000Z": "There are actions we can all take to protect ourselves and those around us from #COVID19 . #COVIDStopsWithMe From U.S. Surgeon General", "2020-07-24T16:30:43.000Z": "Free #COVID19 testing is available thanks to a partnership between @AZDHS , @HHSGov & Arizona DEMA. Testing sites: \n\nSouth Mountain Park, 10919 S. Central Avenue, Phoenix, AZ 85042\nMaryvale High School, 3415 N. 59th Avenue, Phoenix, AZ, 85033\n\nPre-register: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-24T04:20:57.000Z": "En las próximas semanas, compartiremos otras campañas en colaboración con nuestros socios. 2/2", "2020-07-24T04:20:23.000Z": "\"Más Fuerte Que COVID\" fue creada por @RIESTERAgency para promover el uso de mascarillas y combatir la propagación del coronavirus. #PonteLaMascarillaAZ - somos más fuertes que COVID. #UsaCubrebocas", "2020-07-24T02:34:15.000Z": "On Saturday @Arizona_ASA asked @dougducey & @Supt_Hoffman to use metrics to guide the reopening of schools for in-person learning. Today they did just that.  Thanks for listening and responding. @AzSBA", "2020-07-24T03:39:53.000Z": "Thank you @dougducey for continuing #AZ mitigation efforts to help slow the spread of #COVID19  #MaskUpAZ  #healthcareheroes Quote Tweet Doug Ducey @dougducey Over recent weeks, Arizona has made significant progress to contain the spread of #COVID19 , but we cannot let up.\n\nThat's why today I'm extending a pause on gyms, bars, movie theaters, water parks and tubing, as well as continuing to prohibit large gatherings. 1/ Show this thread", "2020-07-24T00:59:08.000Z": "Governor Ducey Announces Additional Dollars, Flexibility and Clarity To Arizona Schools https:// bit.ly/2CxPjSP .  \nWe appreciate the collaboration @dougducey and @Supt_Hoffman and support for our needs. Governor Ducey Announces Additional Dollars, Flexibility and Clarity To Arizona Schools PHOENIX - Governor Doug Ducey today announced additional resources, flexibility and clarity for the start of the 2020-2021 school year.This \"Arizona: Open for Learning\" plan provides maximum options... azgovernor.gov", "2020-07-24T01:53:17.000Z": "Today's #MaskUpAZ feature: \"Tougher Than COVID\" developed by @RIESTERAgency . Additional campaigns will be featured over the coming weeks, all developed in-kind by our creative partners on this collaborative effort. #MaskUpAZ - we're tougher than COVID.", "2020-07-24T01:11:00.000Z": "Senator @SylviaAllenAZ on Arizona's Open for Learning Plan. \n\nRead the plan here: http:// bit.ly/2CxPjSP", "2020-07-24T01:06:10.000Z": "Representative @michudall on Arizona's Open for Learning Plan. \n\nRead the plan here: http:// bit.ly/2CxPjSP", "2020-07-24T01:00:02.000Z": "We want to ensure all Arizonans have access to washable, reusable cloth masks. We are providing packs of 5 masks to our most vulnerable populations and those who may not otherwise have access to cloth masks. If needed, please order yours today: https://", "2020-07-24T00:57:43.000Z": ". @Supt_Hoffman on Arizona's Open for Learning Plan https:// bit.ly/2CxPjSP", "2020-07-24T00:38:12.000Z": "Thank you  for your leadership Gov. Ducey @dougducey & Superintendent Hoffman @Supt_Hoffman . We look forward to continuing to work together on behalf of AZ students. Governor Ducey Announces Additional Dollars, Flexibility and Clarity To Arizona Schools PHOENIX - Governor Doug Ducey today announced additional resources, flexibility and clarity for the start of the 2020-2021 school year.This \"Arizona: Open for Learning\" plan provides maximum options... azgovernor.gov", "2020-07-23T22:38:09.000Z": "Read more about Arizona's plan HERE: https:// azgovernor.gov/governor/news/2020/07/governor-ducey-announces-additional-dollars-flexibility-and-clarity-arizona  5/5 Governor Ducey Announces Additional Dollars, Flexibility and Clarity To Arizona Schools PHOENIX - Governor Doug Ducey today announced additional resources, flexibility and clarity for the start of the 2020-2021 school year.This \"Arizona: Open for Learning\" plan provides maximum options... azgovernor.gov", "2020-07-23T22:37:25.000Z": "We know this pandemic has upended the lives of students, parents and teachers. That's why we're focused on providing students the closest thing to normality and consistency in learning as possible, while prioritizing their health and safety. 4/", "2020-07-23T22:35:56.000Z": "It was developed in consultation with school leaders from across the state, school advocates and @Supt_Hoffman . I'm grateful to all the education stakeholders, leaders, parents, students and more for their continued advocacy for the children of our state. 3/", "2020-07-23T22:35:37.000Z": "This plan provides maximum options for Arizona families, ensures students receive a full academic year of education, and gives local school leaders the flexibility, resources and public health guidance to make the best decisions for their students. 2/", "2020-07-23T22:35:02.000Z": "From academics to health and nutrition, to social and emotional development and child safety, schools are the backbone of our communities. \n\nToday, we're announcing details of a new plan that ensures Arizona is opening for learning this school year. 1/", "2020-07-23T22:23:46.000Z": "Thank you to our partners, @lavidgeco , @RIESTERAgency , @UriasComm , @OffMadisonAve , @rrpartners , @LaneTerralever , @OHAdvertising , @HMA_PR and Highnoon for their creative and strategic approach to share this important message statewide. 2/2", "2020-07-23T22:22:57.000Z": "Together, we can contain the spread of #COVID19 by taking precautions we know work - like wearing a mask. We're launching a new effort in partnership with Arizona's leaders in advertising to promote the use of masks to protect public health. #MaskUpAZ", "2020-07-23T22:20:40.000Z": "Now is not the time to get complacent. We must press on and keep doing the things that are working: wearing a mask, staying physically distant, avoiding congregating and activities that lead to congregating, and staying home as much as possible. 3/3", "2020-07-23T22:19:55.000Z": "This decision is not made lightly. Businesses and employees have sacrificed and they've had to make big adjustments. We're grateful for the compliance we've seen across the state and the responsible actions to protect public health. 2/", "2020-07-23T22:19:23.000Z": "Over recent weeks, Arizona has made significant progress to contain the spread of #COVID19 , but we cannot let up.\n\nThat's why today I'm extending a pause on gyms, bars, movie theaters, water parks and tubing, as well as continuing to prohibit large gatherings. 1/", "2020-07-23T21:59:57.000Z": "NOW: I'll be sharing the latest on #COVID19 and Arizona's actions to protect public health and safety.\n\nWatch Doug Ducey @dougducey Arizona COVID-19 Briefing with Governor Ducey, Dr. Christ, Maj. Gen. McGuire - July 23, 2020", "2020-07-23T18:21:31.000Z": "It was a beautiful morning celebrating the groundbreaking of Nikola Motor with my friend @TJShopeforAZ . This amazing company will produce up to 35,000 electric vehicles per yr. 1000's of jobs = an absolute win 4 Coolidge & AZ. Let's keep this momentum of the last few years going.", "2020-07-23T19:22:18.000Z": "Arizona is proud to be home to Nikola's new facility that will produce its zero-emissions Class 8 semi-trucks and create thousands of new jobs. Congrats, @nikolamotor ! Quote Tweet Nikola Motor Company @nikolamotor When does construction begin on the Coolidge, AZ manufacturing facility you ask? Today! The first phase of construction is scheduled for completion in 2021. At full production, the facility will reach approximately 35,000 units annually. https:// nikolamotor.com/press_releases /nikola-corporation-breaks-ground-on-coolidge-multi-product-factory-4-0-manufacturing-facility-86   #Groundbreaking", "2020-07-23T18:08:07.000Z": ". @stmarysfoodbank is accepting water donations to help Arizonans in need as temperatures rise. Those interested in donating can get more information here: Donate Food - St. Mary's Food Bank firstfoodbank.org", "2020-07-23T17:30:04.000Z": "More than 370 #COVID19 testing sites are available across Arizona. View the @AZDHS list with details on locations, hours of operation and more: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-23T15:47:42.000Z": "Register today to get tested! Quote Tweet AZ Dept of Health @AZDHS Free diagnostic #COVID19 tests are available! Pre-register today: https://", "2020-07-23T14:31:31.000Z": "Today is probably the biggest day in the history of my hometown as we break ground for @nikolamotor ! It was great working with @azcommerce & @SandraWatsonAZ to bring thousands of jobs and new technology to #LD08 ! @nikolatrevor  #Coolidge", "2020-07-23T15:50:36.000Z": "Wearing a mask makes a difference. We can't let up. #MaskUpAZ", "2020-07-23T00:10:30.000Z": ". @CPLCdotORG & @equalityhealth encourages everyone to attend. Pre-registration & ID is NOT required, no one will be turned away. Onsite registration is available & each person tested will get 5 masks. Test results available within 48 hrs. Pre-register: https:// bit.ly/2WNIkfb", "2020-07-22T23:39:31.000Z": "Equality Health Foundation & @CPLCdotORG encourages everyone to attend. Pre-registration & ID is NOT required, no one will be turned away. Onsite registration is available. Each person tested gets 5 masks. Results available within 48 hrs. Pre-register https:// bit.ly/2WNIkfb", "2020-07-22T23:25:44.000Z": "Just had a productive call with tribal leaders from all over AZ to discuss #COVID19 on the tribal nations. I'm grateful to all tribal leaders and community members, frontline medical personnel and law enforcement for their continued partnership and work to keep communities safe.", "2020-07-22T22:17:04.000Z": "Arizona is committed to making sure Arizonans can cast their ballots safely and securely on Election Day. I'm grateful to @SecretaryHobbs for her continued partnership and leadership to ensure a successful election in 2020. Quote Tweet The 9th Floor @9thFloorAZ TODAY: Gov. @dougducey issued an Executive Order in coordination with @SecretaryHobbs to bolster election efforts by making available additional state assets. MORE: https:// azgovernor.gov/governor/news/2020/07/governor-ducey-issues-executive-order-improving-voting-safety-staffing ", "2020-07-22T17:32:16.000Z": "Need a COVID-19 test? Free tests are available today. Pre-register at the link below. #KeepingArizonaHealthy  #MaskUpAZ Quote Tweet AZ Dept of Health @AZDHS Free diagnostic #COVID19 tests are available! Pre-register today: https://", "2020-07-22T16:31:11.000Z": "Pre-register for free #COVID19 testing at sites in Maryvale and South Phoenix HERE: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-22T15:30:44.000Z": "Gov. @dougducey sent a letter to Arizona's Congressional Delegation providing his input on the #COVID19 relief package being discussed in Congress. Governor Ducey Provides Recommendations On Congressional COVID-19 Relief Package PHOENIX⁠ - Governor Doug Ducey sent a letter to the Arizona Congressional Delegation providing his input on the next phase of the COVID-19 relief package being discussed in Congress. In the letter,... azgovernor.gov", "2020-07-22T15:23:41.000Z": "Today, Arizona recognizes Glioblastoma Awareness Day to raise awareness of this cancer and honor those who lost their lives to Glioblastoma. #GBMDay", "2020-07-22T03:01:00.000Z": "¡Las pruebas de diagnóstico gratuitas # COVID19 están disponibles! Preinscríbase hoy: AZDHS | Highlighted Infectious Disease for Arizona - Coronavirus Disease 2019 (COVID-19) Español Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-22T03:00:01.000Z": "Free diagnostic #COVID19 tests are available! Pre-register today: https://", "2020-07-22T00:00:01.000Z": "We want to ensure all Arizonans have access to washable, reusable cloth masks. We are providing packs of 5 masks to our most vulnerable populations and those who may not otherwise have access to cloth masks. If needed, please order yours today: https://", "2020-07-21T21:34:39.000Z": "We need help from clubs, companies, church groups, and other community organizations to distribute food to our neighbors.  Can you bring YOUR team?  Groups with members 16 and older are needed Tues and Thurs mornings. Email volunteer@communityfoodbank.org @whatsuptucson", "2020-07-22T14:52:08.000Z": "Free #COVID19 saliva testing will be available this Saturday from 7 AM - 11 AM at @StateFarmStdm . Get more information and pre-register here: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-saliva-testing   @AZDHS  @ASUBiodesign AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-19T05:02:40.000Z": "#AZNG is proud to stand with our local, state & federal partners in this whole-of-community effort to fight the spread of #COVID19 . #InThisTogether First day of free, federal COVID-19 testing sees short wait times in Maryvale https:// azcentral.com/story/news/loc al/phoenix/2020/07/17/first-day-free-covid-19-testing-sees-short-wait-times-maryvale/5460567002/  via @azcentral First day of free, federal COVID-19 testing sees short wait times in Maryvale Hundreds of people showed up for the first day of free, federal COVID-19 testing at Maryvale High School in Phoenix with little wait times. azcentral.com", "2020-07-18T18:01:05.000Z": "Have you recovered from COVID-19? Vitalant is leading a study for convalescent plasma therapy, which uses the antibodies in your blood to fight the virus and set the world on a path to recovery. Learn more: http:// Vitalant.org/covidfree", "2020-07-21T22:48:18.000Z": "For Surge Site Testing, pre-registration is not required and you do not need a state-issued ID. No one will be turned away. https:// 1.azdhs.gov/39lyiHs  #COVID19", "2020-07-21T22:50:28.000Z": "We have more work to do when it comes to education funding. We will continue to prioritize our public schools and students. 4/4", "2020-07-21T22:49:58.000Z": "These dollars also have helped improve our facilities and fund programs that lead to better learning outcomes, such as technology, curriculum and textbooks. This decision protects these critical resources, now and into the future. 3/", "2020-07-21T22:49:26.000Z": "Prop 123 is fast-tracking $3.5 billion to public schools in Arizona. These dollars have had an immediate impact in the classroom, providing more resources for students and boosting teacher salaries across the state. 2/", "2020-07-21T22:49:09.000Z": "Good news for Arizona! Today, the U.S. Court of Appeals for the Ninth Circuit overturned the U.S. District Court decision on Prop 123. This decision is a victory for our public schools and students and the people of Arizona. 1/", "2020-07-21T22:15:01.000Z": "Need a #COVID19 test? There are short wait times and plenty of available appointments at South Mountain Park and Maryvale High School.", "2020-07-21T22:16:00.000Z": "¿Necesita una prueba para #COVID19 ? Hay tiempos cortos de espera y muchas citas disponibles en South Mountain Park y Maryvale High School. https://", "2020-07-21T20:40:32.000Z": "@HSCPhx  @SVdP  @phxmission  @CPLCdotORG  @UMOM  @ANewLeafAZ  @GRMTucson  @OurFamilyTucson  @PrimaveraTucson  @FlagShelterOrg  @CRMISSION", "2020-07-21T20:40:12.000Z": "My thanks to the individuals, businesses and organizations who have generously donated to the AZ Coronavirus Relief Fund - all contributions make a big difference in helping our communities. MORE: https:// azgovernor.gov/governor/news/2020/07/governor-ducey-announces-975000-az-coronavirus-relief-fund-support-homeless  2/ Governor Ducey Announces $975,000 From AZ Coronavirus Relief Fund To Support Homeless Arizonans PHOENIX - Governor Ducey today announced $975,000 from the AZ Coronavirus Relief Fund has been allocated to 12 organizations in Arizona that provide shelter for those experiencing homelessness. The... azgovernor.gov", "2020-07-21T20:39:33.000Z": "NEW: \n\nWe're announcing nearly $1 million to 12 organizations across Arizona that provide shelter and services to families and individuals experiencing homelessness. These dollars will support our most vulnerable and help protect public health. 1/", "2020-07-21T19:44:38.000Z": "This Saturday from 7 AM - 11 AM: #COVID19 saliva testing will be available at @StateFarmStdm thanks to a partnership between @AZDHS and @ASUBiodesign . \n\nPre-register: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-21T16:48:10.000Z": "The summer heat is in full swing and access to clean water is crucial for the homeless population and families with budgets stretched. Please donate water at our Phoenix or Surprise locations or make a monetary donation to http:// firstfoodbank.org today! #stayhydrated", "2020-07-21T13:00:01.000Z": "ADOT is looking at public-private partnerships to expand broadband coverage along highways and create more wired and wireless connectivity in rural communities. Learn more at https:// bit.ly/30AikF8 .", "2020-07-21T16:35:00.000Z": "Wearing a cloth face covering correctly can help prevent the spread of #COVID19 to others. When you go out on essential trips, follow these \"do's\". If you have a child, remember those under age 2 should not wear a face covering. See https:// bit.ly/2R9av5m .", "2020-07-21T17:43:04.000Z": "HAPPENING NOW: FREE diagnostic #COVID19 testing at sites in high-need, underserved communities in #Arizona . Daily from 6:00 AM-2:00 PM REGISTER South Mountain Park https:// bit.ly/392nxcK Maryvale  https:// bit.ly/2DTdWK1", "2020-07-21T17:38:09.000Z": "We all have a role in containing the spread of #COVID19 and protecting our communities. #MaskUpAZ", "2020-07-21T17:36:37.000Z": "Free #COVID19 testing is available! Pre-register: http:// azhealth.gov/SurgeTesting Quote Tweet Troy Hayden @troyhaydenfox10 Surprising to me. Just did a live report at South Mountain surge COVID testing site. The most people they've seen here in a day is 500. They have a capacity of 3,000 per day. Test is free. You can just drive up and get one. Where is everybody?", "2020-07-21T03:00:01.000Z": "Looking for a #COVID19 test with a minimal wait time? Free diagnostic testing is available in Maryvale and South Phoenix. https://", "2020-07-21T03:44:57.000Z": "Through July 28, free #COVID19 surge testing is available at South Mountain Park and Maryvale High School.\n\nPre-register at http:// azdhs.gov/surgetesting", "2020-07-20T19:51:42.000Z": "Happening NOW: Surge testing at South Mountain Park and Maryvale High School. Pre-register today. http:// azdhs.gov/surgetesting  #Covid19  #testing Quote Tweet Doug Ducey @dougducey Drive-thru surge #COVID19 testing is NOW available at South Mountain Park and Maryvale High School from 6AM - 2PM. Testing is easy and accessible to everyone. Get more info and pre-register today. http:// azdhs.gov/surgetesting", "2020-07-20T20:49:31.000Z": ". @AZDHS has free face masks available for Arizonans 65 years or older and vulnerable individuals. Details: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-order-masks   #MaskUpAZ AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-17T20:51:47.000Z": "The Arizona Department of Health Services is making free masks available to anyone who is part of a vulnerable population, including individuals with medical conditions and those age 65 or older. More details http:// ow.ly/pTDN50ABxFm", "2020-07-20T18:52:36.000Z": "I'm very excited to welcome Nikhil Dave as the newest student regent on the @AZRegents . Our student regents provide a critical voice and perspective to our state university system, and I look forward to serving alongside him. Quote Tweet Arizona Board of Regents @AZRegents ABOR welcomes @ASU student @NikhilDave as the new student regent, following Gov. Ducey's appointment today. Nikhil is a Flinn Scholar majoring in Neuroscience and Innovation in Society & plans to pursue a Master of Science and Technology Policy. Welcome! http:// ow.ly/GuGO50ABE6g", "2020-07-20T19:04:37.000Z": "Spoke with @VP , the White House Coronavirus Task Force and fellow governors for an update on #COVID19 . We're grateful for the continued support including supplies, medical personnel and surge testing.", "2020-07-20T17:37:46.000Z": "Drive-thru surge #COVID19 testing is NOW available at South Mountain Park and Maryvale High School from 6AM - 2PM. Testing is easy and accessible to everyone. Get more info and pre-register today. http:// azdhs.gov/surgetesting", "2020-07-20T15:50:42.000Z": "Let's remember to continue wearing our face coverings when out in public, or when in close proximity to others. We must keep each other safe during #COVID19 and remember to look out for our friends and family.  \n\nTogether we can help stop the spread. Quote Tweet AZ Dept of Health @AZDHS We are proud to partner with @Hanes to provide free cloth face masks to Arizona's most vulnerable residents to prevent the spread of COVID-19. Get more info on our website: https://", "2020-07-20T14:35:04.000Z": "Through July 28, @AZDHS is offering 5,000 free, drive-through, COVID-19 tests per day at two locations in the Phoenix metro area, Maryvale and South Mtn. Park. You must pre-register at http:// ow.ly/PPLX50ABzbZ .", "2020-07-20T00:03:38.000Z": "Congratulations to @ASU alum @JonRahmpga on his victory at #theMemorial and his new rank as the #1 player in the world! Go Devils!", "2020-07-20T00:57:25.000Z": "We will get through this, and we will get through this together. \n\nOne of the best things you can do to help contain the spread of #COVID19 is wearing a mask #MaskUpAZ", "2020-07-19T19:40:56.000Z": "Opportunities to donate blood  @VitalantAZ Quote Tweet Vitalant - Arizona @VitalantAZ Did you know: we need at least 600 donations each day in Arizona to meet the needs of patients in our community and beyond. \n\nSchedule your donation today to ensure blood is always available when patients need it: http:// vitalant.org", "2020-07-19T16:14:12.000Z": "Pre-register for a free test here: http:// azdhs.gov/surgetesting Quote Tweet Michael Chow @photochowder Short lines this AM for free #COVIDー19 test on third day of 12-day surge testing at Maryvale High. Registration helps but also taking walk-ups until 2pm. #coronavirus  @thawthornephoto  @azcentral", "2020-07-18T18:00:01.000Z": "Drive-thru #COVID19 testing is available at South Mountain Park and Maryvale High School. Get more info and pre-register today. https://", "2020-07-18T16:19:20.000Z": "For a list of more than 300 testing sites around the state, visit @AZDHS HERE: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-18T16:18:29.000Z": "There is #COVID19 surge testing available and happening NOW for Maryvale and South Phoenix. \n\nPre-register HERE: http:// azdhs.gov/surgetesting Individuals will also receive five free masks. @AZDHS  #MaskUpAZ", "2020-07-18T04:44:54.000Z": "Civil rights icon. Presidential Medal of Freedom recipient. 33-year U.S. Representative from Georgia, who was often referred to as the \"conscience\" of Congress. #RIP Congressman John Lewis. Rep. John Lewis, who 'risked his life and his blood' as a giant of the civil rights movement, dies... The Georgia lawmaker and son of sharecroppers had been suffering from Stage IV pancreatic cancer since December. He was 80. usatoday.com", "2020-07-17T23:12:54.000Z": "Need a mask? The @AZDHS is now offering free, reusable cloth face masks for people 65 years and older, as well as other identified vulnerable populations. More details: https:// bit.ly/39bhXFc", "2020-07-17T21:30:06.000Z": "DYK: To ensure people 65+ and vulnerable populations can protect themselves, @AZDHS will provide free face masks to anyone who meets that criteria. Order face masks at http:// ow.ly/U6X050ABwwV", "2020-07-17T21:35:01.000Z": "Preregister now for #COVID19 testing at South Mountain Park or Maryvale High School. Results will be available within 24-48 hours from the time specimens arrive at the lab. https://", "2020-07-17T21:35:13.000Z": ". @VitalantAZ is accepting blood donations, and they are following health and safety precautions to protect donors and staff. \n\nThose interested in donating can learn more and schedule an appointment here: https:// vitalant.org", "2020-07-17T19:03:55.000Z": "Aryeh regularly demonstrates his commitment to Arizona and Maricopa County through his accomplishments and dedication to service. I'm pleased to appoint him to the Maricopa County Superior Court and look forward to his work. Quote Tweet The 9th Floor @9thFloorAZ Gov. @dougducey today announced the appointment of Aryeh D. Schwartz to the Maricopa County Superior Court. This appointment fills the vacancy created by the retirement of Judge George H. Foster, Jr. https:// azgovernor.gov/governor/news/2020/07/governor-ducey-appoints-aryeh-d-schwartz-maricopa-county-superior-court ", "2020-07-17T17:02:34.000Z": "Order free masks from @AZDHS at http:// azdhs.gov/ordermasks . Masks are available for the vulnerable population including, but not limited to, individuals with medical conditions or individuals age 65+. #MaskUpAZ  #UseCubrebocas", "2020-07-17T17:00:00.000Z": "We are all in this together, Sun Devils. #ForksUp  #MaskUpAZ", "2020-07-17T18:01:35.000Z": "Wearing a mask protects you.\n\nIt protects your loved ones.\n\nAnd it will help contain the spread of #COVID19 . #MaskUpAZ", "2020-07-17T16:43:40.000Z": "STARTING TODAY:\n\nFree #COVID19 testing is available at South Mountain Park and Maryvale High School. Up to 5,000 tests will be provided each day for 12 consecutive days, serving up to 60,000 Arizonans.\n\nInformation on locations and pre-registration: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-17T13:17:52.000Z": "COVID-19 TESTING ALERT  60,000 tests available 5,000 tests a day 2 Locations - West Valley & South Phoenix 12 days straight 48-72 hour test result delivery \n\nPre-register now: http:// azdhs.gov/surgetesting Quote Tweet AZ Dept of Health @AZDHS Preregistration is now available for these testing sites: http:// azhealth.gov/surgetesting  #COVID19", "2020-07-16T21:20:00.000Z": "Surge testing starts tomorrow. 2 locations 5,000 free #COVID19 tests each day. Pre-registration is encouraged. https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-surge-testing ", "2020-07-16T22:47:07.000Z": "We'll continue working with our partners at the county and local levels to make resources and assistance available for all those impacted by #COVID19 . 5/5", "2020-07-16T22:46:42.000Z": "This order ensures renters impacted by #COVID19 will be able to stay in their homes while extending the time to access assistance programs. We're also adding $5 million in financial assistance to individuals who rely on income from tenants to help them avoid foreclosure. 4/", "2020-07-16T22:46:20.000Z": "This week, we announced nearly $6 million for organizations that combat homelessness and help ensure families and individuals stay in their homes. Today we're also announcing $250,000 for @CPLCdotORG 's Statewide Housing Program, which finds housing for homeless individuals. 3/", "2020-07-16T22:45:26.000Z": "With more than $80 million available in state and local rental assistance, we're also providing $650,000 for community action agencies to increase staffing to help these programs get resources out to families and individuals faster. 2/", "2020-07-16T22:44:43.000Z": "NEW:\n\nI've signed an Executive Order extending a moratorium on residential evictions until October 31, 2020, providing continued protections for renters who are facing economic hardship as a result of #COVID19 . https:// azgovernor.gov/governor/news/2020/07/governor-ducey-extends-covid-19-eviction-protections-expands-rental-assistance  1/ Governor Ducey Extends COVID-19 Eviction Protections; Expands Rental Assistance Access PHOENIX - Governor Doug Ducey today signed an Executive Order extending a moratorium on residential evictions until October 31, 2020, providing continued protections for renters who are facing... azgovernor.gov", "2020-07-16T22:04:06.000Z": "NOW: I'm joining @AZDHS Director @drcarachrist and Arizona DEMA Director Maj. Gen. McGuire to provide updates on #COVID19 and Arizona's efforts to contain the spread and support our communities. \n\nWATCH Doug Ducey @dougducey Arizona COVID-19 Briefing with Governor Ducey, Dr. Christ, Maj. Gen. McGuire - July 16, 2020", "2020-07-16T19:29:37.000Z": "STARTING TOMORROW:\n\nFree #COVID19 testing will be available at sites in Maryvale and South Phoenix thanks to a partnership between @AZDHS , Arizona DEMA and @HHSGov . \n\nPre-register here: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-16T19:07:43.000Z": "#UsaCubrebocas", "2020-07-16T18:00:07.000Z": "Let's all do our part to slow the spread of #COVID19 . #MaskUpAZ  https://", "2020-07-16T16:28:18.000Z": "We must not let up. Everyone has a role to contain the spread of #COVID19 . #MaskUpAZ", "2020-07-16T00:51:47.000Z": "The University and @AZDHS partnered to provide saliva-based testing to Arizonans - and we will continue to work together to protect public health. \n\nAnd thanks for the @ASU care package! 2/2", "2020-07-16T00:51:19.000Z": "Thank you @ASU President @MichaelCrow for meeting today to discuss the expansion of #COVID19 testing in Arizona and ways to continue supporting students and our communities. 1/", "2020-07-15T21:13:59.000Z": "@LupitaHightower  @vailschools  @Florenceusd  @VCP_AZ  @drcarachrist", "2020-07-15T21:12:47.000Z": "My thanks to @Supt_Hoffman , superintendents and school leaders for joining the call today to discuss next steps and the well-being of Arizona kids. @chadgestson  @PhoenixUnion  @AvondaleESD  @CamilleCasteel  @ChandlerUnified  @YUHSD  @gthompsonyuhsd  @mpsaz  @TollesonESD", "2020-07-15T21:12:17.000Z": "School leaders across Arizona have worked hard to plan and prepare for the upcoming school year. In partnership with @Supt_Hoffman , we have worked closely with education leaders to provide resources and flexibility. 1/", "2020-07-15T19:04:08.000Z": "@BrentHodges  @PhxChristian  @MaestriKyle  @TrinityAZ_2003  @drcarachrist", "2020-07-15T19:04:01.000Z": "Thank you to all who joined the call and provided input, questions and feedback. We will continue to work together to ensure a safe, effective and successful school year. @PhoenixDiocese  @Ogbaziknnanna  @DioceseofGallup  @BrophyNews  @vcschoolsaz  @gcsknights  @SC_Eagles", "2020-07-15T19:03:23.000Z": "The health and safety of all Arizona teachers, staff and students remains a top priority. We had a productive call with private school leaders to discuss the needs of their students and families as the new school year approaches. 1/", "2020-07-15T17:43:24.000Z": "The new #COVID19 sites in Maryvale and South Phoenix kick off this Friday, July 17. Up to 5,000 tests per day will be provided for 12 consecutive days, serving up to 60,000 Arizonans. Information on locations and pre-registration: http:// azhealth.gov/SurgeTesting", "2020-07-15T00:00:01.000Z": "Two new #COVID19 testing sites at South Mountain Park and Maryvale High School will provide up to 5,000 free diagnostic tests per day. A link to preregister will be available in the next few days. Read more: https://", "2020-07-15T00:33:15.000Z": "#MaskUpAZ", "2020-07-14T23:40:35.000Z": ". @foodbanktucson has information on ways to support the Southern Arizona community, host virtual food drives and more: https:// communityfoodbank.org/Get-Involved/G ive ", "2020-07-14T20:15:33.000Z": "This rapid surge in testing will have an immediate impact in containing #COVID19 & help us to increase testing in communities where it's needed most. My thanks to our federal partners for their continued partnership & for continuing to step up to aid public health in Arizona. 4/4", "2020-07-14T20:14:08.000Z": "This test involves a self-administered nasal swab in a drive-thru stall. Results will be available within 24-48 hours from the time specimens arrive at the lab. Those tested will receive the results through an online portal. 3/", "2020-07-14T20:13:17.000Z": "Testing begins this Friday, July 17, at the following locations:\n\nSouth Mountain Park: 10919 S. Central Avenue, Phoenix, AZ 85042\nMaryvale High School: 3415 N 59th Ave, Phoenix, AZ 85033\n\nInformation on pre-registration: http:// azhealth.gov/SurgeTesting", "2020-07-14T20:12:18.000Z": "#COVID19 testing in Maryvale and South Phoenix is ramping up. @AZDHS , Arizona DEMA and @HHSgov have teamed up to provide up to 5,000 tests per day for 12 consecutive days at sites in these high-need communities. This will serve up to 60,000 Arizonans. 1/ Quote Tweet AZ Dept of Health @AZDHS Beginning Friday, July 17, two new testing sites will be launched to provide free diagnostic testing for #COVID19 in high-need, underserved communities. Preregistration will be available shortly - get the details here: https://", "2020-07-14T18:25:38.000Z": "Thanks Governor @dougducey , these funds will provide critical services during this unusually challenging times.  The Mohave County veterans  and families deserve to be honored.  The Jerry Ambrose Veteran Council does amazing work and Pat Farrell has been warrior for veterans.", "2020-07-14T17:59:38.000Z": "We're working to make sure first responders across Arizona have the mental health support they need during #COVID19 . @KVOA", "2020-07-14T16:18:17.000Z": "We are grateful and proud to be recipients of a portion of these funds. Quote Tweet Doug Ducey @dougducey A total of $4.35 million will be distributed to shelters, programs and services that help homeless individuals and families throughout Arizona, including dollars for homeless shelters, domestic violence victims services, mental health support and more. 2/ Show this thread", "2020-07-14T17:28:57.000Z": "The new cold storage unit at the Mariposa Port of Entry will help Arizona move more goods like produce through our ports - bolstering cross-border trade, growing jobs and boosting economic growth. @PortNogales  @AzMxCom Quote Tweet Greater Nogales Santa Cruz County Port Authority @PortNogales Excited to annouce the Port Authority is in receipt of $700k from the state for the cold-rooms project at the Mariposa port of entry. Thank you @dougducey & State Legislature for supporting Arizona's economic development. AZ continues to set the standard for cross-border trade.", "2020-07-14T16:50:41.000Z": "Our prayers are with Officer Jason Judd's loved ones, his fellow officers and the Peoria community today. @PeoriaPoliceAZ Quote Tweet FOX 10 Phoenix @FOX10Phoenix REST IN PEACE: A funeral service is being held for Peoria Police Officer Jason Judd who died in a motorcycle crash at Liberty High School. https:// bit.ly/30a9Cxd Thank you for your service", "2020-07-14T16:15:15.000Z": "I am grateful to the men, women and organizations working to support Arizonans in need. My thanks also to the @HUDgov for this Emergency Solutions Grant funding to provide aid throughout the state. 4/4", "2020-07-14T16:14:49.000Z": "A total of $1.6 million of the funding will be distributed to services and programs that work to prevent homelessness in Arizona, including dollars for rental assistance, guidance for independent living and more. 3/", "2020-07-14T16:14:08.000Z": "A total of $4.35 million will be distributed to shelters, programs and services that help homeless individuals and families throughout Arizona, including dollars for homeless shelters, domestic violence victims services, mental health support and more. 2/", "2020-07-14T16:13:33.000Z": "We want all Arizonans to have access to resources that keep them safe and help them thrive. These dollars will go toward shelter for domestic violence victims and families in need, programs leading to independent living, and much more. 1/ Quote Tweet The 9th Floor @9thFloorAZ TODAY: Gov. @dougducey announced a plan to distribute nearly $6M from the @HUDgov 's Emergency Solutions Grant program to organizations that combat homelessness and help ensure families and individuals keep a roof over their heads. https:// azgovernor.gov/governor/news/2020/07/governor-ducey-announces-nearly-6-million-prevent-homelessness-support-those ", "2020-07-13T23:54:11.000Z": "Thank you @RepCesarChavez for your continued advocacy for Arizonans and for your partnership to get resources and relief to areas hit hard by #COVID19 . Quote Tweet Arizona House Democrats @AZHouseDems PRESS RELEASE: Chavez Praises West Valley COVID Testing Surge #azleg", "2020-07-13T21:26:32.000Z": "Just updated @VP and health officials on Arizona's latest action to contain the spread of #COVID19 , including limiting indoor dining capacity to 50% and expanding testing capacity. My thanks to the Administration for the continued support as we work to protect public health.", "2020-07-13T21:18:45.000Z": "TOMORROW from 7 AM - 11 AM: #COVID19 saliva testing will be available at Ak-Chin Pavilion thanks to an innovative partnership between @AZDHS and @ASUBiodesign . \n\nMore: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-13T20:23:33.000Z": ". @StMarysFoodBank needs volunteers to help pack and distribute food boxes. See how you can help: https:// volunteer.firstfoodbank.org Quote Tweet St. Mary's Food Bank @StMarysFoodBank We need help at all 3 of our locations -\nWe have lost the majority of our volunteer groups and are now relying on individual volunteers. By registering for one of our shifts, you can make a huge impact! Please visit us at http:// volunteer.firstfoodbank.org and sign up today!", "2020-07-13T14:22:27.000Z": "Wearing a face covering and staying six feet apart doesn't just protect you, it protects those around you. Learn more about doing your part during #COVID19 : https:// bit.ly/304qbdX  #COVIDStopsWithMe", "2020-07-13T17:26:47.000Z": "#COVID19 saliva testing in partnership with @ASUBiodesign will be available tomorrow July 14 at Ak-Chin Pavilion: 7am-11am. Pre-register now (agency code jdzkkww6): https://", "2020-07-13T16:51:57.000Z": "Good news for Arizona as 361 cases of Remdesivir, an antiviral drug shown to treat severe cases of #COVID19 , are on their way. @12News  @HHSGov", "2020-07-13T16:37:54.000Z": "First responders and those on the frontlines work around the clock to serve our communities and protect others. These dollars will support Heal the Hero Foundation's efforts to build stress resilience for those who do so much to protect our communities. Quote Tweet The 9th Floor @9thFloorAZ NEW: Gov. @dougducey today announced $120,000 for Heal the Hero Foundation, supporting its work to mitigate the mental health impacts facing first responders during #COVID19 . https:// azgovernor.gov/governor/news/2020/07/governor-ducey-announces-120000-support-first-responder-mental-health ", "2020-07-13T00:32:07.000Z": "NEW: Gov. Doug Ducey says Arizona will be getting 361 cases of the experimental antiviral drug Remdesivir, which appears to help patients with COVID-19 recover faster. Arizona will use experimental drug to help COVID-19 patients Gov. Doug Ducey says Arizona will be getting 361 cases of the experimental antiviral drug Remdesivir, which appears to help patients with COVID-19 recover faster. kgun9.com", "2020-07-12T20:15:22.000Z": "#MaskUpAZ Quote Tweet AZ Dept of Health @AZDHS #MaskTip  : Don't forget to wash your hands or use hand sanitizer before and after touching your mask. #MaskUpAZ  #COVID19  https://", "2020-07-12T19:37:07.000Z": ". @VitalantAZ is accepting blood donations, and they are doing it safely.\n\nPlease consider a donation to ensure our hospitals have the life-saving blood they need  http:// vitalant.org", "2020-07-12T17:59:30.000Z": "Help contain the spread of #COVID19 .\n\nWear a mask.\n\nStay physically distant.\n\nYou are safer at home. Quote Tweet CDC @CDCgov You can help slow the spread of #COVID19 . Practice #socialdistancing . Keep at least six feet of physical distance between yourself and others. Wear a cloth face covering when in public. More tips at http:// cdc.gov/coronavirus .", "2020-07-12T02:55:19.000Z": "We'll continue working with our local and federal partners to get resources where they're needed, and we need everyone to continue doing their part: \n\nWear a mask.\n\nStay physically distant.\n\nAnd remember you are safer at home.", "2020-07-12T02:54:42.000Z": "Thank you to @HHSGov and the administration for their continued partnership and support to Arizona. Working together, we've been able to secure additional medical and testing supplies, PPE, health care personnel, ventilators and more to aid in Arizona's COVID-19 response.", "2020-07-12T02:53:47.000Z": "NEW:\n\nArizona is receiving 361 cases of Remdesivir, a promising antiviral drug shown to lessen the effects of #COVID19 & even save lives, from @HHSGov . The shipment will bolster state supplies with added capacity to treat thousands of additional patients, if needed.", "2020-07-11T15:03:10.000Z": "#COVID19 testing game changer compliments of @ASUBiodesign . \n\nThe saliva based test is painless, returns results faster, and keeps testers safer. \n\nFirst of its kind and it's right here in Phoenix.", "2020-07-11T14:55:36.000Z": "There are #ExcessiveHeatWarnings in areas throughout the state this weekend. Don't forget to check weather reports, stay hydrated and dress for the heat.\n\nMore information on the heat warnings and ways to stay safe: https:// azdhs.gov/preparedness/epidemiology-disease-control/extreme-weather/heat-safety/index.php#heat-illness   @AZDHS AZDHS | Epidemiology & Disease Control - Heat Safety Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-11T00:02:15.000Z": "For those with questions about #COVID19 and testing opportunities, there are resources available:", "2020-07-10T23:07:55.000Z": ". @AZDHS , @SonoraQuestLabs and @PerkinElmer teamed up to get Arizonans a quick turnaround on their #COVID19 test results - and Sonora Quest plans to exponentially increase processing capacity in the weeks and months ahead. Sonora Quest Collaborates with State and Health Care Leaders to Vastly Expand COVID-19 Testing... PHOENIX - Governor Doug Ducey announced today a strategic collaboration with Sonora Quest Laboratories, the market share leader in diagnostics laboratory testing in Arizona, the Arizona Department of... azgovernor.gov", "2020-07-10T22:00:01.000Z": "Excessive Heat Warnings through Monday: Coconino, Gila, Graham, Greenlee, Maricopa, Pima, & Pinal from 7/10 - 7/13 and Cochise, La Paz, Mohave, Santa Cruz, Yavapai, & Yuma from 7/11-7/13. High temps ranging from 105° F to 120° F expected 10 AM - 8 PM AZDHS | Epidemiology & Disease Control - Heat Safety Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-10T20:37:32.000Z": "We have partnered with @ASUBiodesign to provide #COVID -9 saliva testing tomorrow morning at @AkChinPavilion . Get details and pre-register: https://", "2020-07-10T18:16:45.000Z": "I'm thankful for Evan's willingness to serve Arizonans in this important role, and I look forward to working together to ensure Arizona returns stronger from this pandemic and its economic impact. Quote Tweet The 9th Floor @9thFloorAZ Gov. @dougducey appointed Evan Daniels as director of the @AZInsuranceDept. Daniels has served at @arizonaago since 2015, where he led oversight of AZ's first-in-the-nation regulatory fintech \"sandbox.\" The program has been recognized as a national model. https:// azgovernor.gov/governor/news/2020/07/governor-ducey-announces-evan-daniels-director-arizona-department-insurance ", "2020-07-10T17:28:01.000Z": "The state has continued efforts to increase access to #COVID19 testing. If you have symptoms, call your doctor and find your nearest testing location here: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-10T16:14:53.000Z": "Simple precautions like these will make a big difference in containing the spread of #COVID19 and protecting fellow Arizonans. GIF", "2020-07-10T15:22:09.000Z": "Phillip Blanks and D'Artagnan Alexander are heroes. Their bravery saved two lives last week. A former high school football player dove and caught a child dropped from the balcony of a burning... Moments later, another bystander ran into the deadly fire to save the child's sister. The men now say they're bonded for life. washingtonpost.com", "2020-07-10T00:25:32.000Z": "Governor Ducey announced partnerships to enhance testing and a new Executive Order requiring restaurants with indoor seating to operate at less than 50% capacity. More information Quote Tweet Doug Ducey @dougducey Today we're announcing additional actions to reduce the risk of #COVID19 transmission, boost testing in underserved areas, get test results to Arizonans faster, and further enhance hospital staffing and capacity. 1/ Show this thread", "2020-07-10T01:01:40.000Z": "Learn how PerkinElmer is supporting @SonoraQuestLabs with complete SARS-CoV-2 workflow solutions, allowing them to reach their goal of having test results available within 24 hours. Read on here: http:// ms.spr.ly/6016TmwaK  #coronavirus  #SARSCoV2", "2020-07-10T00:03:41.000Z": "NEW: Working with @AZDHS and local officials, @ASU will provide free, saliva-based #COVID19 testing in high-need underserved communities around the state.\n\nTests are by appointment only and can be scheduled by visiting http:// ow.ly/gktp50AutBb . ADHS, ASU announce partnership to increase COVID-19 testing in Arizona July 13 update: An additional date has been added: 7-11 a.m. Tuesday, July 14. Appointments can be made at the same link below, with the same agency code. Please check azhealth.gov/testing for future asunow.asu.edu", "2020-07-09T22:50:38.000Z": "#COVID19 remains widespread in our communities. These additional actions, combined with continued compliance with public health guidance can help contain the spread. I'm grateful to Arizonans for their continued cooperation and patience. We must all continue to do our part. 8/8", "2020-07-09T22:50:01.000Z": "Through this partnership, @SonoraQuestLabs expects to increase processing capacity to 35,000 diagnostic tests per day by the end of July, and up to 60,000 tests per day by the end of August. 7/", "2020-07-09T22:49:28.000Z": "We've also heard of unacceptable delays in test results. That's why Arizona is partnering with @SonoraQuestLabs and @PerkinElmer to boost processing capability for diagnostic testing - getting test results to Arizonans faster. 6/", "2020-07-09T22:48:42.000Z": "Through this partnership with @ASU , @AZDHS has committed up to $12.7 million to fund the expansion of testing sites to serve up to 100,000 Arizonans. 5/", "2020-07-09T22:47:25.000Z": ". @AZDHS is also partnering with @ASU to provide free saliva-based #COVID19 testing to Arizonans. The first drive-through site will be offered on Saturday, July 11 in the West Valley, while expanding to additional sites and dates in the coming weeks and months. 4/", "2020-07-09T22:46:18.000Z": "We must continue to ramp up access to testing. That's why @AZDHS is partnering with @CDCgov and @HHSGov to offer up to 5,000 free #COVID19 tests per day at sites in Maryvale and South Phoenix. This increase in testing includes 12 days of surge testing. 3/", "2020-07-09T22:45:35.000Z": "Today, I signed an Executive Order that requires restaurants with indoor seating to operate at less than 50 percent capacity. These actions will help protect the health and safety of restaurant patrons and staff and further reduce the risk of transmission. 2/", "2020-07-09T22:44:54.000Z": "Today we're announcing additional actions to reduce the risk of #COVID19 transmission, boost testing in underserved areas, get test results to Arizonans faster, and further enhance hospital staffing and capacity. 1/", "2020-07-09T22:03:32.000Z": "NOW: I'm joining @AZDHS Director @DrCaraChrist and Arizona DEMA Director Major General Michael T. McGuire to provide the latest on #COVID19 and Arizona's actions to contain the spread of the virus. WATCH: This broadcast has ended. Doug Ducey @dougducey Arizona COVID-19 Briefing with Governor Ducey, Dr. Christ, Maj. Gen. McGuire - July 9, 2020", "2020-07-09T18:02:32.000Z": "#MaskUpAZ Quote Tweet AZ Dept of Health @AZDHS #MaskUpAZ : Your mask should fit snugly and fully cover your nose and mouth. Do your part to help slow the spread of #COVID19 . https://", "2020-07-09T17:54:35.000Z": "#COVID19 is widespread in Arizona. We need everyone to take it seriously and do their part to contain the spread:", "2020-07-09T15:08:03.000Z": "It's important to stay hydrated, especially when temperatures rise. @StMarysFoodBank is accepting water donations to help Arizonans in need. \n\nInformation on locations and ways to donate: https:// firstfoodbank.org Quote Tweet St. Mary's Food Bank @StMarysFoodBank Thanks to the dozens of folks who made water donations today! With record temperatures coming this week, the homeless and families with budgets stretched will need it. Please donate at our Phoenix or Surprise locations or make a monetary donation to http:// firstfoodbank.org .", "2020-07-09T00:00:18.000Z": "#COVID19 testing is available at sites across the state. For information on locations, hours of operation and more, visit the @AZDHS website: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-08T15:55:15.000Z": "If you've been in close contact with a person who has #COVID19 , a public health worker may call to let you know you've been exposed. Answer the call to #SlowTheSpread . Learn what happens during contact tracing: https:// bit.ly/2ZkyWjJ .", "2020-07-08T20:56:54.000Z": "NEW: Arizona is providing $600,000 to @ASBA to provide training for small businesses that will help them navigate the assistance and resources available during #COVID19 . $600,000 For Arizona Small Business Support PHOENIX - Governor Doug Ducey today announced $600,000 to fund the launch of Arizona Small Business Association's (ASBA) Live Local program, training small businesses to find and navigate resources... azgovernor.gov", "2020-07-08T18:06:48.000Z": "This morning, I joined fellow governors on a call to discuss the latest on #COVID19 , including potential action at the federal level and how states can continue to support those harmed economically by this pandemic. @NatlGovsAssoc", "2020-07-08T16:57:14.000Z": "We are very proud of all Special Olympics athletes throughout the state. These dollars and want to ensure they can continue to safely practice the sports they love and participate in other activities during #COVID19 . @SOArizona Quote Tweet The 9th Floor @9thFloorAZ NEW: Gov. @dougducey announced $250,000 for Special Olympics Arizona, a nonprofit organization supporting Arizonans with intellectual disabilities and offering physical activity and art programs. https:// azgovernor.gov/governor/news/2020/07/governor-announces-250000-arizonans-intellectual-disabilities   @SOArizona", "2020-07-08T16:23:09.000Z": "As we work together to fight #COVID19 , we are continuing to boost testing in Arizona. We're working with our federal partners and the @WhiteHouse to get a @CDCgov strike team to increase testing in Phoenix. This will provide additional testing in Maryvale and West Phoenix.", "2020-07-08T04:13:14.000Z": "In honor of Bryan's life, I'm ordering flags at all state buildings lowered to half-staff tomorrow, Wednesday, July 8. @TontoForest Quote Tweet Doug Ducey @dougducey Arizona is heartbroken to learn of the death of Bryan Boatman, a helicopter pilot fighting the #PollesFire in Gila County. Our prayers are with his family and loved ones during this difficult time. twitter.com/TontoForest/st", "2020-07-08T04:12:23.000Z": "Arizona is heartbroken to learn of the death of Bryan Boatman, a helicopter pilot fighting the #PollesFire in Gila County. Our prayers are with his family and loved ones during this difficult time. Quote Tweet Tonto NF @TontoForest A helicopter working on the #PollesFire crashed earlier today. We can confirm 1 fatality-the pilot, was the only person on the aircraft. The incident is under investigation; additional info will be released as available. Press brief 7:30p at http:// fb.me/TontoNationalF orest/  Show this thread", "2020-07-08T00:46:14.000Z": "Wearing a mask protects you and your loved ones. #MaskUpAZ", "2020-07-07T22:59:49.000Z": "Arizona is grateful for the women and men on the frontlines of this pandemic. We're grateful for all of our citizens who are being responsible and for our local partners working to ensure everyone follows the guidance to slow the spread. Quote Tweet Doug Ducey @dougducey READ: Doctors praise Arizona's mitigation strategies and ask for continued enforcement.", "2020-07-07T22:52:58.000Z": "READ: Doctors praise Arizona's mitigation strategies and ask for continued enforcement.", "2020-07-07T19:38:06.000Z": ". @uarizona and Arizona have partnered to expand antibody testing and make 250,000 tests available to first responders and health care workers across the state. #COVID19 antibody testing opportunities: https:// covid19antibodytesting.arizona.edu  @UArizonaPres  @UAZHealth", "2020-07-07T17:54:51.000Z": "Thank you to @USDA Secretary Sonny Perdue for your continued partnership with Arizona, dedication to responsible forest management and support to our communities. @SecretarySonny", "2020-07-07T17:54:21.000Z": "Addressing the threat of wildfires is a team effort that requires collaboration across local, state & federal levels. Today, we're with @SecretarySonny signing an MOU to further these key partnerships & better protect Arizona communities. @USDA  @azstateforestry  @forestservice", "2020-07-07T16:35:11.000Z": "Just had a call with @VP and fellow governors to receive an update on #COVID19 and hear from other states. We continue to coordinate closely with the federal government and appreciate the Administration's continued partnership.", "2020-07-07T16:08:13.000Z": "#OTD in 1981, President Ronald Reagan nominated Arizona's own Sandra Day O'Connor to the Supreme Court.\n\n\"She is truly a person for all seasons, possessing those unique qualities of temperament, fairness, intellectual capacity and devotion to the public good.\" - Pres. Reagan", "2020-07-06T23:56:55.000Z": "Protect yourself. Protect others. #MaskUpAZ", "2020-07-06T22:35:42.000Z": "Arizona Today is the last day to register to vote for the August 4th Primary Election. Take the time. It's easy. Get registered here: https:// servicearizona.com/VoterRegistrat ion/selectLanguage ", "2020-07-06T20:55:10.000Z": "Temperatures are rising in counties throughout the state this week. Stay hydrated, dress for the heat and check weather reports. \n\nMore information on heat safety from @AZDHS  AZDHS | Epidemiology & Disease Control - Heat Safety Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-06T19:51:13.000Z": "#COVID19 testing is available at nearly 300 sites across Arizona. @AZDHS has a list of locations, along with hours of operation, contact information, pre-registration requirements and more: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-07-06T19:00:08.000Z": "We have record-breaking numbers of #COVID19 in Arizona. Help slow the spread of #COVID19 in our communities, wear a mask when you are in public. https://", "2020-07-06T18:39:49.000Z": "Wash your hands, stay home when sick, practice physical distancing and #MaskUpAZ . \n\nThese are simple, but effective, steps to contain the spread of #COVID19 .", "2020-07-06T15:48:35.000Z": "We all have a role in containing the spread of #COVID19  GIF", "2020-07-06T15:18:56.000Z": "There is widespread transmission of #COVID19 with the nat'l no. of cases approaching 3 million & AZ surpassing 100,000 cases. Arizonans are safer at home, prevent the spread of this disease by washing your hands & wearing a mask #SaferAtHome  #MaskUpArizona  https://", "2020-07-05T17:28:58.000Z": "Contact tracing helps contain the spread of #COVID19 . \n\nIf public health calls your phone, answer. It will help keep you and fellow Arizonans safe and healthy.", "2020-07-04T17:31:55.000Z": "Over 244 years and many trials, America has been tested, but never broken; challenged, but never defeated. Through it all, the American spirit has persevered; it has endured; and it has always triumphed.\n\nHappy #4thofJuly", "2020-07-04T14:00:01.000Z": "Happy #4thofJuly ! Please remember all those serving on the frontlines-whether it's patrolling our streets, caring for those sick, or defending our nation abroad-and continue to make safe and responsible choices. #MaskUpAZ", "2020-07-04T12:00:00.000Z": "Wishing all Arizonans a safe and happy #4thofJuly . #IndependenceDay", "2020-07-03T20:57:51.000Z": "If you get a call from public health, answer. Contact tracing helps contain the spread of #COVID19 .", "2020-07-03T19:14:45.000Z": "\"We share the Governor's vision of a strong and vibrant arts sector acting as an engine for innovation and healing.... and we continue to find inspiration in the resilience and creativity of Arizona artists and arts workers.\" https:// azarts.gov/news/governor- announces-2-million-in-relief-funding-for-arizonas-arts-culture-sector/ ", "2020-07-03T20:02:00.000Z": "We have work ahead of us, but we can contain the spread and help Arizona return stronger by all doing our part:\n\nWear a mask. \n\nAvoid larger gatherings. \n\nRemember to physically distance.\n\nAnd you are safer at home. 3/3", "2020-07-03T20:01:20.000Z": "I also thank everyone in our business community who's being responsible in light of rising #COVID19 cases. I talked earlier this week abt patience & perseverance. I know this is a real sacrifice but it's one that will make a real difference as we work to protect public health. 2/", "2020-07-03T20:00:39.000Z": "This pandemic has brought incredible challenges, but Arizonans are strong and tough. And we come together to support each other.\n\nI'm grateful to all Arizonans doing their part to contain the spread of #COVID19 ; for wearing masks, avoiding large gatherings, and staying home. 1/", "2020-07-03T16:58:18.000Z": "Important steps to follow when removing your face covering  @CDCgov  #MaskUpAZ", "2020-07-03T16:01:23.000Z": "AZ's vibrant arts community is fundamental to our state's cultural identity & expression. These dollars will support organizations that provide cultural programming through community activities, foster partnerships that strengthen arts education for students & more. @AZartscomm Quote Tweet The 9th Floor @9thFloorAZ NEW: Gov. @dougducey announced $2 million for the Arizona Commission on the Arts, supporting grants for arts and education programs across the state. https:// azgovernor.gov/governor/news/2020/07/governor-announces-2-million-arizona-arts-commission   @AZartscomm", "2020-07-03T14:32:12.000Z": "Celebrating #FourthOfJuly weekend responsibly will help contain the spread of #COVID19 .\n\nYou are safer at home. If you do go out, #MaskUpAZ .", "2020-07-03T02:00:02.000Z": "COVID-19 is widespread in Arizona, you are safer at home. Avoiding unnecessary trips out is one of the simplest ways you can fight this virus. https:// 1.azdhs.gov/3dVvYY2  #COVID19", "2020-07-02T23:46:52.000Z": "Had a productive meeting w/ Senate Pres. Fann & House Speaker Bowers to discuss #COVID19 updates and AZ's latest mitigation efforts. I'm grateful for their thoughtful communication & dedicated partnership as we work to contain the virus & provide relief to Arizonans. @FannKfann", "2020-07-02T23:23:23.000Z": "Please keep Coach Lou Holtz and the Holtz family in your prayers today. Beth Holtz, Wife of ND Coach Lou Holtz, Passes Away at 83 Beth Holtz, the wife of legendary University of Notre Dame head football coach Lou Holtz, passed away on June 30, 2020 after a long battle with throat cancer at 83 years old.", "2020-07-02T22:34:52.000Z": "Wearing a mask protects you, your loved ones and fellow Arizonans. #MaskUpAZ", "2020-07-02T21:00:02.000Z": "The best way to prevent illness is to avoid being exposed. Stay home and help contain the spread of #COVID19 . https://", "2020-07-02T21:54:30.000Z": ". @Surgeon_General : \"Now we must continue to take personal responsibility to protect ourselves and our loved ones.\" #MaskUpAZ", "2020-07-02T21:01:48.000Z": "Just had a call with Congressman David Schweikert to discuss the latest on #COVID19 and Arizona's actions to contain the spread of the virus. I'm grateful for his continued partnership and support as we work to protect public health and safety. @RepDavid", "2020-07-02T18:01:48.000Z": "#COVID19 is widespread in Arizona. A reminder to all Arizonans to be responsible and make smart choices this 4th of July weekend.\n\nAvoid large gatherings.\n\nMask up.\n\nYou are safer at home.", "2020-07-02T15:47:39.000Z": "We are announcing #AZVoteSafe today - a plan that invests $9 million in CARES Act Funding to keep voting safe and secure in Arizona during the 2020 election season. \nREAD MORE: http:// go.azsos.gov/mzwy", "2020-07-02T15:36:03.000Z": "We want all Arizona voters to stay safe and healthy when exercising their right to vote. My thanks to @SecretaryHobbs , election departments and county recorders across the state, and everyone working to make sure Arizonans are protected when voting this year. 5/5", "2020-07-02T15:35:32.000Z": "Additionally, @SecretaryHobbs issued the 2020 AZVoteSafe Guide, which includes recommendations like bringing a pen to the polls and maintaining safe distances from other voters. https:// azgovernor.gov/sites/default/ files/the_azvotesafe_guide0.pdf ", "2020-07-02T15:34:47.000Z": "With this funding, county recorders and elections departments across Arizona will receive:", "2020-07-02T15:33:27.000Z": "These dollars will help county recorders and election departments build #COVID19 response efforts, increase early voting in rural and tribal communities, help inform voters of their options to vote safely on Election Day, and fund the purchase of PPE for polling stations. 2/", "2020-07-02T15:32:44.000Z": "In partnership with @SecretaryHobbs , Arizona is investing $9 million in CARES Act funding to support safe and secure voting this election. #AZVoteSafe", "2020-07-02T00:57:13.000Z": "Gov. @dougducey ordered flags at all state buildings be lowered to half-staff today from sunrise to sunset to honor @PeoriaPoliceAZ Department Officer Jason Judd. Governor Ducey Orders Flags At Half-Staff To Honor Peoria Police Officer Jason Judd PHOENIX - Governor Doug Ducey today ordered flags at all state buildings be lowered to half-staff from sunrise to sunset tomorrow, July 2, 2020, to honor Peoria Police Officer Jason Judd. Officer... azgovernor.gov", "2020-07-02T00:54:01.000Z": "Arizona is saddened by this tragic loss, and our prayers go out to Officer Jason Judd's family, loved ones and the entire @PeoriaPoliceAZ community. In honor of Officer Judd's life and service, I have ordered flags be lowered to half-staff tomorrow, July 2, 2020. #RIP Quote Tweet Peoria Police (AZ) @PeoriaPoliceAZ The men and women of the @PeoriaPoliceAZ are mourning the loss of one of our own. Officer Jason Judd tragically lost his life today in the line of duty in a single vehicle motorcycle accident. Officer Judd is a 20+ year veteran of the Department #PeoriaPDAZ  #PeoriaPoliceAZ", "2020-07-01T22:10:34.000Z": "On Monday, @dougducey took decisive action in response to the increased spread of COVID-19 across Arizona. We know these are difficult decisions that impact individuals and families, but we are at a critical juncture where we can change the trajectory of this virus.", "2020-07-02T00:07:27.000Z": "Dr. Birx: \"Thank you to your health team and the brilliant Dr. Christ. It's just been a pleasure to spend time with you and your amazing county public health leaders\" @DrCaraChrist  @AZDHS", "2020-07-01T22:25:09.000Z": "Thank you, Governor @dougducey for today's briefing and your strong leadership to Slow the Spread in Arizona. Our Message to Arizona: President @realDonaldTrump & I are With You & We Will Make Sure Arizona has What You Need When You Need It. We will get through this...together.", "2020-07-01T22:35:32.000Z": "Help is on the way for our amazing health care workers in Arizona and around the Country. We will spare no expense to provide the kind of reinforcement needed to care for the American people.", "2020-07-01T22:33:48.000Z": "To the people of Arizona: We're with you and we'll make sure you have whatever you need to meet this moment.", "2020-07-01T21:51:17.000Z": "Thank you @VP , Dr. Birx, @DHS_Wolf and the Administration for your continued partnership and support in helping Arizona protect public health and contain the spread of #COVID19 .", "2020-07-01T21:30:19.000Z": "Dr. Birx: \"Governor Ducey's directives to not only increase our respect for one another, but that clear communication coming from his health team that made it clear that wearing a mask will change the spread of this virus.\"", "2020-07-01T20:57:19.000Z": ". @VP : \"We want to make it clear that we fully support the steps that Governor Doug Ducey and local health officials are implementing here across the state of Arizona to slow the spread.\"", "2020-07-01T20:11:43.000Z": ". @VP : \"I want to make it clear we fully support the steps Governor Doug Ducey and local health officials are implementing here across the state of arizona to slow the spread.\"", "2020-07-01T18:34:52.000Z": "As our frontline healthcare workers fight to save lives inside our hospitals everyday from COVID we thank @dougducey for working hard to slow the spread of COVID. #MaskUpAZ", "2020-07-01T18:22:12.000Z": "HonorHealth appreciates the Governor taking steps to help slow the spread of #COVID19 and ease the heavy strain on our caregivers. Please do your part to help care for our ENTIRE community, including the caregivers and #healthcareheroes ! Quote Tweet Doug Ducey @dougducey We must be clear-eyed. The next few weeks will be hard. But these steps combined with stepped-up compliance with public health guidance can make a difference, and we're grateful to Arizonans for their cooperation. \n\nStay home. \n\nWear a mask. \n\nBe responsible. 8/8 Show this thread", "2020-07-01T19:28:53.000Z": "@thejointstaff  @AZDHS  @DHSgov  @WhiteHouse  @valleywise_az  @Maricopahealth", "2020-07-01T19:28:38.000Z": "Thank you for making Arizona a priority, @VP . We spoke with Dr. Birx, @DHS_Wolf , @DrCaraChrist , Maj. Gen. McGuire & local health leaders about ways to continue partnering with the federal government to respond to this pandemic, get supplies where they're needed, & protect health.", "2020-07-01T18:50:16.000Z": "Welcome back to Arizona, @VP ! Thank you for your continued partnership to help protect health and safety in Arizona.", "2020-07-01T17:39:16.000Z": "Contact tracing helps Arizona contain the spread of #COVID19 . If public health calls your phone, make sure you answer. Here's what to expect:", "2020-07-01T16:50:24.000Z": "The 2020 Census Challenge starts today! AZ cities & towns are stepping up to drive response to the #2020Census to ensure every Arizonan is counted. Thank you to the TOP TEN cities & towns currently leading census response in Arizona! #AZCounts", "2020-07-01T16:21:59.000Z": "This 4th of July weekend, please make smart choices and remember, you are safer at home. #MaskUpAZ", "2020-07-01T15:12:51.000Z": "This virus is widespread and we must take it seriously. Containing the spread will not be easy, but it can be done and we can protect our family and loved ones if we all do our part.\n\nMask up. \n\nBe responsible. \n\nAnd remember: you are safer at home. Quote Tweet AZ Dept of Health @AZDHS Today Arizona will be reporting record highs for reported new #COVID19 cases and deaths. The virus is widespread in Arizona. Please follow all public health guidance to keep yourself and others safe and help contain the spread. #MaskUpAZ  #SaferAtHome", "2020-07-01T14:18:41.000Z": "Mexico is Arizona's # trading partner. With $17.5 billion in trade in 2019, the implementation of the #USMCA will strengthen these ties for mutual economic prosperity!  @AzMxCom", "2020-07-01T14:09:03.000Z": "Today, #Arizona celebrates two momentous occasions: the implementation of the #USMCA and #CanadaDay . With Canada as our # trading partner - totaling $3.6 billion in bilateral trade and services - that relationship will be further strengthened under the #USMCA .  @AzMxCom", "2020-07-01T14:00:49.000Z": "TODAY: #USMCA takes effect! \n\nArizona is already a trade juggernaut. This 21st century trade agreement sets the stage for a new generation of closer economic ties with our North American partners and will create more jobs throughout the state.  @AzMxCom GIF", "2020-07-01T06:06:38.000Z": "#MaskUpAZ", "2020-06-30T20:07:42.000Z": "Sat down w/ @uarizona Pres. Dr. Robbins to discuss the latest on #COVID19 & our universities' work to protect public health & provide flexibility to students in the coming months. A medical doctor, @UArizonaPres has worked with AZ to combat this virus and expand antibody testing.", "2020-06-30T20:02:04.000Z": "Returning The Favor, a series hosted by Mike Rowe, featured The Wildland Firefighter Guardian Institute in 2018. It was an honor to join @mikeroweworks , family of #Yarnell19 and supporters two years ago at the Granite Mountain Hotshots Memorial State Park to honor the fallen.", "2020-06-30T19:14:49.000Z": "@SonoraQuestLabs  @BannerHealth  @DignityHealthAZ", "2020-06-30T19:14:32.000Z": "We're grateful for the continued partnership from our health leaders. @AZDHS  @navajodephealth  @Maricopahealth  @CPLCdotORG  @DavidAdameCPLC  @HealthSystemsAZ  @azhospitalassn  @ArizonaMedicine  @ArizonaNurses  @ASUResearch  @UArizonaPres", "2020-06-30T19:13:33.000Z": "We were joined by Dr. Birx and health and community leaders from around the state to discuss continued efforts to contain the spread of #COVID19 . Arizona's focused on expanding testing and amplifying contact tracing, while pausing high-risk activities. 1/", "2020-06-30T18:38:46.000Z": "Flags at all state buildings are at half-staff today to honor the 19 Granite Mountain Hotshots. #Yarnell19", "2020-06-30T17:02:16.000Z": "She led the fight against the HIV/AIDS epidemic, and has received international recognition for her work in HIV/AIDS immunology, vaccine research and global health. We're grateful for her continued advice & partnership and that of the entire Administration to combat #COVID19 . 2/2", "2020-06-30T17:00:51.000Z": "We're proud to welcome Dr. Deborah Birx to Arizona. Dr. Birx is the Coronavirus Response Coordinator for the @WhiteHouse Coronavirus Task Force. She's a world-renowned medical expert with more than three decades of public health experience at the highest levels. 1/", "2020-06-30T15:27:45.000Z": "We will not forget. Rest In Peace. #granitemountainihc", "2020-06-30T15:00:01.000Z": "Arizona remembers the #Yarnell19 :", "2020-06-30T12:00:00.000Z": "Seven years ago, on a day AZ will never forget, 19 Granite Mountain Hotshot Firefighters lost their lives protecting fellow Arizonans and their communities. Our hearts are with their families, fellow firefighters and the community of Yarnell on this solemn anniversary. #Yarnell19", "2020-06-29T22:44:35.000Z": "Today's announcement from Gov @dougducey delays in-person instruction until August 17th but allows schools to offer distance learning per their regular schedules. This will allow all of us to continue to monitor the spread of COVID-19 and plan appropriately.", "2020-06-29T22:45:58.000Z": "We must be clear-eyed. The next few weeks will be hard. But these steps combined with stepped-up compliance with public health guidance can make a difference, and we're grateful to Arizonans for their cooperation. \n\nStay home. \n\nWear a mask. \n\nBe responsible. 8/8", "2020-06-29T22:45:23.000Z": "Today's actions follow recent steps to boost diagnostic testing, including expanding rapid testing; amplify contact tracing; fund additional PPE for long-term care settings; and enhance guidance for establishments to limit congregating and enforce mitigation policies. 7/", "2020-06-29T22:44:22.000Z": "In addition, we're announcing a new grant program for long-term care facilities. Through the partnership, facilities will receive $10,000 for the purchase of electronic devices to facilitate video conferencing with residents and their families. @AZ_AARP", "2020-06-29T22:43:42.000Z": "Starting today, the Arizona Department of Liquor Licenses and Control shall cease issuing special event licenses for the period between June 29, 2020 and July 27, 2020. 5/", "2020-06-29T22:43:10.000Z": "The first day of school for in-person learning will be delayed until August 17, 2020. Distance learning can begin before then. This delay allows additional time for schools to implement safety precautions, including making available remote learning options. 4/", "2020-06-29T22:42:34.000Z": "Effective today, organized events of more than 50 people are prohibited. Arizonans should celebrate the 4th of July responsibly this weekend, including by staying home, avoiding larger gatherings, and wearing a mask if you do go out. 3/", "2020-06-29T22:41:52.000Z": "Effective at 8:00 p.m. tonight, we are instituting a month-long pause on the operations of bars, gyms, movie theaters, waterparks and tubing rentals. This will help relieve stress on our health care system and give time for new transmissions to slow. 2/", "2020-06-29T22:41:23.000Z": "Today, I'm announcing additional actions to contain the spread of #COVID19 in Arizona. 1/", "2020-06-29T22:00:43.000Z": "NOW: I'm joining @AZDHS Director @DrCaraChrist and Arizona DEMA Director Maj. Gen. McGuire to provide the latest on #COVID19 and discuss new actions to contain the spread of the virus. \n\nWATCH Doug Ducey @dougducey Arizona COVID-19 Briefing with Governor Ducey, Dr. Christ, Maj. Gen. McGuire - June 29, 2020", "2020-06-29T14:45:33.000Z": "Did you know a sneeze can produce 40,000 droplets and travel at 100 mph? By wearing a mask, we can prevent the spread of germs caused by sneezing! Show us how you #MaskUpAZ", "2020-06-29T19:11:52.000Z": "#COVID19 antibody testing is available for health care workers and first responders. @uarizona and Arizona have partnered to provide 250,000 tests to these frontline workers across the state. @UAZHealth  @UArizonaPres Testing opportunities: https:// covid19antibodytesting.arizona.edu", "2020-06-29T17:24:36.000Z": "Testing is available at sites across Arizona.\n\nFind #COVID19 testing sites along with hours of operation, contact information, pre-registration requirements and more: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-06-29T16:45:28.000Z": "Had a call this morning with @VP and fellow governors to discuss the latest on #COVID19 . We appreciate the continued partnership with the Administration as we continue to take action to contain the spread of COVID-19, expand testing and speed up processing of test results.", "2020-06-29T15:55:47.000Z": "Staying home and wearing a mask are some of the simplest and most effective ways to contain the spread of #COVID19 .", "2020-06-28T18:57:30.000Z": "Contract tracing helps contain the spread of #COVID19 . If you get a call from public health, answer.", "2020-06-28T17:41:07.000Z": "On this day in 1950, Staff Sgt. Joe Campos-from Globe, Arizona-made the ultimate sacrifice for the cause of freedom. He was one of the first American servicemembers to die serving in the #KoreanWar .  @azcentral", "2020-06-27T06:15:36.000Z": "The Evacuation Center for the #AvondaleFire is now OPEN at the Avondale City Hall, 11465 Civic Center Dr. in Avondale.", "2020-06-27T06:39:10.000Z": "An evacuation center for the #AvondaleFire has been established by @RedCrossAZ at the Avondale City Hall located at 11465 Civic Center Dr, Avondale, AZ 85323 Please check http:// maricopa.gov for the cross roads and current evacuation area. Use caution and Drive with care.", "2020-06-27T19:37:16.000Z": "Help us & prevent fires. Do not burn or use equipment that can throw sparks. Secure tow chains & check tires before getting on the road. Never pull off into tall grasses. It takes all of us to working together to decrease fire activity. #AZFire  #AZForestry Quote Tweet Matt Pace @MattPaceWeather Red Flag Warning in effect for nearly the entire state Sunday and Monday as critical fire weather conditions move into the region. Use extreme caution not to create any sparks, as any fires that start will be capable of quickly spreading! #azwx  #azfire", "2020-06-27T19:09:11.000Z": "Mantén distanciamiento físico, lávate las manos y #UsaCubrebocas . \n\nHace la diferencia.", "2020-06-27T16:43:43.000Z": "REMEMBER: #COVID19 is widespread.\n\nYou are safer at home this weekend.\n\nIf you do go out, wear a mask.", "2020-06-26T22:58:27.000Z": ". @uarizona and Arizona have partnered to expand #COVID19 antibody testing throughout the state, including providing 250,000 tests for health care workers and first responders. Details on testing opportunities  @UArizonaPres  @UAZHealth  https:// covid19antibodytesting.arizona.edu", "2020-06-26T22:49:54.000Z": "We've been speaking with hospital leaders from across Arizona today. We're grateful for their continued partnership as we work together to ensure proper aid and care for all who need it. @YumaRegional  @HonorHealth  @valleywise_az  @MayoClinic  @BannerHealth", "2020-06-26T21:26:34.000Z": "Some have announced they plan to voluntarily close. For others, investigators are coordinating with local authorities and will be on alert all weekend. For the safety of all, let's be responsible this weekend. Thank you for your cooperation. 5/5", "2020-06-26T21:25:51.000Z": "We are looking at you, bars. Violate these guidelines and you will be held accountable. We've called out the bad actors, and we will continue to take action and work with local authorities to enforce. 4/", "2020-06-26T21:24:59.000Z": "To our business community: public health guidance MUST BE FOLLOWED. Local authorities have been empowered to enforce these guidelines set forth through Executive Order and by public health. This has the power of law. 3/", "2020-06-26T21:24:09.000Z": "So this weekend, remember: You are safer at home. If you do go out, wear a mask. We can't stress this enough. COVID19 is widespread in Arizona, and you need to protect yourself and others. 2/", "2020-06-26T21:23:21.000Z": "We must contain the spread of #COVID19 in Arizona. The current increase in cases and hospitalizations is unacceptable. All our efforts must be focused on this, and we are asking all Arizonans to help. 1/", "2020-06-26T20:46:34.000Z": "Cuídate a ti mismo. \n\nCuida a los demás.\n\nAyuda a contener la propagación del #COVID19 .\n\nUsa un cubrebocas. #UsaCubrebocas", "2020-06-26T19:17:24.000Z": "Today we held a call with business leaders to discuss guidelines to protect public health. We're grateful to those who have taken action to protect employees and customers, and we'll continue to hold bad actors accountable. @DrCaraChrist  @SandraWatsonAZ  @DebJohnsonAZ", "2020-06-26T18:00:14.000Z": "Dr. Birx provides an update and context on Arizona, Florida and Texas.", "2020-06-25T20:38:10.000Z": "Gov @dougducey invests $700K in #BTOAcademy to Support School Leaders in Arizona via AZCares Plan. Read statement by @arizonafuture President & CEO @SybilFrancisCFA : http:// ow.ly/C1Lo50Ai2kz  @Supt_Hoffman  @NISLorg", "2020-06-26T17:04:43.000Z": "Wearing a face covering properly is one of the most important things we can do to contain the spread of #COVID19 . #MaskUpAZ", "2020-06-26T16:35:06.000Z": ". @AZDHS has information on #COVID19 testing sites, hours of operation, pre-registration requirements and more. Details HERE: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-06-26T16:00:57.000Z": "The pandemic has affected everyone. We're proud to join other major employers and donors with a contribution of $50,000 to Gov. Ducey's AZ Coronavirus Relief Fund. Learn more about how the fund is helping those impacted: http:// ow.ly/Wido50AiQTI  @dougducey  @azcommerce  @phxchamber", "2020-06-26T16:00:35.000Z": "Thank you @EPCORUSA for the generous $50,000 donation to the AZ Coronavirus Relief Fund! This support to Arizona families, medical professionals and those in need will protect public health and help Arizona #ReturnStronger . #AZTogether  @EPCOR", "2020-06-25T21:27:52.000Z": "As representatives of the largest health systems representing 80% of care provided in Arizona, we recognize the challenges our State and nation are facing as we continue to manage the COVID-19 pandemic. 1/8", "2020-06-25T22:46:21.000Z": "We know #COVID19 is widespread, and has been for some time. We all have a role and responsibility:\n\nTo protect ourselves. \n\nTo protect others. \n\nTo protect those on the frontlines like our health care workers. \n\nAnd to contain the spread. Let's all continue to do our part. 6/6", "2020-06-25T22:45:08.000Z": "And we're holding bad actors accountable. Last week, we increased guidance for establishments and gave local law enforcement clear authority to ensure compliance. And we're already seeing action. 5/", "2020-06-25T22:44:03.000Z": "Arizona is also continuing to ramp up efforts to contain the spread: More testing. New resources to process tests faster. Increased manpower for contact tracing. A continued focus on long-term care facilities and our most vulnerable. Additional dollars for PPE and more. 4/", "2020-06-25T22:43:04.000Z": "There are other questions to ask if going out:\n\nHow many people will you interact with? \n\nCan you keep 6 feet of distance between you? \n\nWhat's the length of time you will be out? 3/", "2020-06-25T22:42:05.000Z": "If you must go out, wear a mask. We know masks work. They protect you, and they protect those around you. #MaskUpAZ", "2020-06-25T22:41:25.000Z": "We can contain the spread of #COVID19 , but we've got work to do, Arizona.  \n\nOne thing is for sure: you are safer at home. Avoiding unnecessary trips out is one of the simplest ways you can fight this virus. 1/", "2020-06-25T22:02:04.000Z": "I'm joining @AZDHS Director @DrCaraChrist and Arizona DEMA Director Maj. Gen. McGuire to share the latest on public health and safety in Arizona. #COVID19 Doug Ducey @dougducey Arizona COVID-19 Briefing with Governor Ducey, Dr. Christ, Maj. Gen. McGuire - June 25, 2020", "2020-06-25T20:10:51.000Z": "Thank you, @AZNationalGuard . #MaskUpAZ Quote Tweet ArizonaNationalGuard @AZNationalGuard Protecting the force is protecting our communities. #InThisTogether", "2020-06-25T20:03:00.000Z": "Great job #Arizona for utilizing the #CARESAct funds to fuel innovative solutions, provide extra supports in high-need schools and improve distance learning options. Learn more from @ExcelinEd : State Spotlight: Arizona Students, Educators Receive Strong Support from Governor Ducey's CARES Act... Arizona is using its CARES Act funds to fuel innovative solutions, provide extra supports in high-need schools and improve distance learning options. Background In March, Congress passed the Corona... excelined.org", "2020-06-25T00:01:59.000Z": "Thank you @dougducey and @Supt_Hoffman !  This is a tremendous help for schools to plan safe reopenings.\n\nDucey unveils aid package to help keep Arizona's K-12 schools afloat during pandemic https:// azcentral.com/story/news/pol itics/arizona-education/2020/06/24/arizona-schools-get-regulatory-flexibility-funding-pandemic/3251209001/  via @azcentral Ducey unveils aid package to help keep Arizona's K-12 schools afloat during pandemic The bulk of the funding  - about $200 million - will help schools expand remote learning and not lose more than 2% of the funding they received last year. azcentral.com", "2020-06-25T18:30:40.000Z": "Thank you to the firefighters and safety officials battling the #AquilaFire . Arizona is grateful for your work to protect people, pets and property. @azstateforestry Quote Tweet AZ State Forestry @azstateforestry #AZForestry 's Engine 461 working structure protection on the #AquilaFire Tuesday. The fire is now 75% contained & remains at 893 acres. The fire started NE of I-17 & the Carefree Highway. #AZFire", "2020-06-25T18:00:18.000Z": "We all have a role in preventing the spread of #COVID19 . https://", "2020-06-25T17:40:00.000Z": "Protect yourself. Protect others. When you leave the house, bring your mask. #MaskUpAZ", "2020-06-25T17:02:22.000Z": "As schools make plans for the coming school year, they will have flexibility and resources and our families will have options. MORE via @12News", "2020-06-25T15:34:48.000Z": "On the 70th anniversary of the start of #KoreanWar , we honor the women and men who served and remember those that made the ultimate sacrifice to preserve freedom & democracy. More than 36,000 Americans, including 280 Arizonans, lost their lives & many are still unaccounted for.", "2020-06-25T01:32:03.000Z": "Just flat out wrong. Despicable doesn't go far enough.  The final words of George Floyd should NEVER be invoked like this. Anyone who mocks the murder of a fellow human has no place in public office. Period. Quote Tweet Lorraine Longhi @lolonghi Scottsdale Council member Guy Phillips just addressed the crowd by saying, \"I can't breathe,\" the last words of George Floyd before he died at the hands of Minneapolis police, before taking off his mask at this protest. @azcentral", "2020-06-25T00:46:14.000Z": "Thank you @Supt_Hoffman for your continued leadership and prioritization of the health and safety of our students and educators. Quote Tweet Kathy Hoffman @Supt_Hoffman Today's executive order represents an important step towards stability for public schools, which are vital to the health and success of our communities. https:// azcentral.com/story/news/pol itics/arizona-education/2020/06/24/arizona-schools-get-regulatory-flexibility-funding-pandemic/3251209001/  Show this thread", "2020-06-24T21:09:04.000Z": "CVS adds 15 more drive-thru sites for COVID-19 testing, bringing Arizona locations total to 64 CVS adds 15 more drive-thru sites for COVID-19 testing, bringing Arizona locations total to 64 CVS is expanding its COVID-19 testing in Arizona to a total of 64 drive-thru self-swab test sites. azcentral.com", "2020-06-25T00:16:42.000Z": "Expanding immediate access to schools that are proving worthy of their students-especially those who need them most- is a great move right now. Well done. @AforArizona  @dougducey  @TBRPF  @GullyoftheSun Quote Tweet A for Arizona @AforArizona Today, A for Arizona's Expansion and Innovation Fund, focused on serving Arizona's most vulnerable students with the highest quality schools, was awarded $1 million from the Governor's Emergency Education Relief (GEERs) fund through federal CARES Act monies. Show this thread", "2020-06-25T00:06:50.000Z": "@FlowingWellsHS  @MadisonAZ  @qrkellis  @DysartUSD  @dr_sadorf  @jsmeyerson  @VCP_AZ  @KimChayka  @AMSSchools  @BASISed  @JulieYoungEDU  @ASUPrepAcademy", "2020-06-25T00:06:37.000Z": "@vailschools  @gthompsonyuhsd  @YUHSD  @Florenceusd  @csd83super  @CartwrightSD  @PaulHStanton  @WESDschools  @SaddleMtUSDSupt  @mpsaz  @LupitaHightower  @TollesonESD  @quintinboyce  @RSDNo66  @FlagstaffUSD1  @DrFinchDVUSD  @DVUSD  @BuckeyeESD  @KristiSandvik  @sunnysideusd  @AmphiSchools", "2020-06-25T00:05:50.000Z": "Thank you to all the education and health leaders who have worked with us and provided input to ensure families have options and students have the tools they need to succeed. @Supt_Hoffman  @chadgestson  @PhoenixUnion  @AvondaleESD  @Gabriel18839216  @CamilleCasteel  @ChandlerUnified Quote Tweet The 9th Floor @9thFloorAZ Gov. @dougducey and @Supt_Hoffman hosted a conference call with superintendents and education leaders today to discuss plans to provide schools flexibility and resources. Read that plan here: https:// azgovernor.gov/governor/news/2020/06/governor-ducey-superintendent-hoffman-announce-azcares-flexibility-and-funding ", "2020-06-24T23:46:15.000Z": ". @dougducey is the first governor so far to leverage #CARESAct funding for innovation grants. This money will provide school leaders the funding needed to accelerate their plans to redesign their school model and better serve vulnerable students. @aforarizona  @9thfloorAZ", "2020-06-24T23:45:05.000Z": "The initiatives unveiled today by @dougducey come after a lot of work by school leaders, @Supt_Hoffman , @azedschools and @9thFloorAZ staff. The commitment to provide at least 98% enrollment of FY20 enrollment for schools is vital to making this year work. https:// azgovernor.gov/sites/default/ files/flexibility_and_funding_for_schools.pdf ", "2020-06-24T23:36:40.000Z": "We thank @dougducey for his bold leadership and vision for what's possible for more Arizona students and families. #AforAZ Read the full release here: https:// aforarizona.org/2020/06/24/a-f or-arizona-receives-1-million-for-innovation-fund-micro-grants/ ", "2020-06-24T23:36:37.000Z": "Families need educational options in order to meet the unique needs of their children. Arizona is leading the way through the new \"AZ Cares\" flexibility and funding project. Thank you, @dougducey and @Supt_Hoffman ! #loveyourschool  #Azcares  #schooloptionsAZ Quote Tweet Doug Ducey @dougducey BREAKING: We're partnering with @Supt_Hoffman to provide flexibility and funding for schools and families. This plan ensures Arizona students continue to receive a quality education ⁠- whether through distance learning or in the classroom, and provides parents w/ options. 1/ Show this thread", "2020-06-24T22:45:07.000Z": "Thank you @dougducey and @Supt_Hoffman . A very important priority for our local school districts. These guidelines & #CARESAct dollars will help give our schools flexibility with their digital learning options as they plan to re-open starting next month. Quote Tweet Doug Ducey @dougducey BREAKING: We're partnering with @Supt_Hoffman to provide flexibility and funding for schools and families. This plan ensures Arizona students continue to receive a quality education ⁠- whether through distance learning or in the classroom, and provides parents w/ options. 1/ Show this thread", "2020-06-24T23:12:54.000Z": "Thank you to @dougducey and @Supt_Hoffman for your leadership during these extraordinary times. We look forward to our continued partnership on behalf of Arizona students. Quote Tweet Doug Ducey @dougducey BREAKING: We're partnering with @Supt_Hoffman to provide flexibility and funding for schools and families. This plan ensures Arizona students continue to receive a quality education ⁠- whether through distance learning or in the classroom, and provides parents w/ options. 1/ Show this thread", "2020-06-24T22:13:13.000Z": "Read the plan HERE: https:// azgovernor.gov/governor/news/2020/06/governor-ducey-superintendent-hoffman-announce-azcares-flexibility-and-funding   #ReturnStronger 6/6 AZCares: Flexibility And Funding For Schools And Families Includes $270 Million To Help Protect Schools During COVID-19 azgovernor.gov", "2020-06-24T22:12:27.000Z": "Thank you to @Supt_Hoffman , @AZDHS Director @DrCaraChrist , and the dozens of education leaders whose hard work and input made this plan possible. We will continue to work together to ensure schools have resources and flexibility, and that parents have options for their family. 5/", "2020-06-24T22:11:01.000Z": "Today's announcement follows weeks of listening sessions with superintendents and school leaders. And it will enable schools to operationalize the different recommendations made in @azedschools ' Roadmap to Reopening guidance. 4/", "2020-06-24T22:10:28.000Z": "Additionally, today I signed an Exec. Order streamlining the purchasing process for schools to obtain PPE & other #COVID19 related needs. It also provides flexibility to schools to offer virtual learning opportunities for families that choose not to return to the classroom. 3/", "2020-06-24T22:09:22.000Z": "The plan includes nearly $300 million in funding to give schools the tools needed to reopen safely at the start of the school year. In total, $850 million in one-time new funding is going to education in Arizona as a result of the CARES Act. 2/", "2020-06-24T22:08:45.000Z": "BREAKING: We're partnering with @Supt_Hoffman to provide flexibility and funding for schools and families. This plan ensures Arizona students continue to receive a quality education ⁠- whether through distance learning or in the classroom, and provides parents w/ options. 1/", "2020-06-24T19:46:36.000Z": "Last fall, U.S. National Security Advisor @robertcobrien announced that the raid that killed ISIS leader al-Baghdadi was named after Arizona's very own Kayla Mueller. Thank you, Mr. O'Brien, for honoring Kayla and her family and for working to keep our nation safe. @WHNSC", "2020-06-24T18:57:54.000Z": "Gov. @dougducey mentions Loop 202 South Mountain Freeway during @NatlGovsAssoc infrastructure panel: \n\n\"Last year we finished the largest highway project in state history. It was a public-private partnership that saved taxpayers more than $100 million & opened three years early.\" From Doug Ducey", "2020-06-24T19:00:25.000Z": "@LouisianaGov  @GovernorBullock  @GovernorGordon  @GovernorVA  @GIIA_news  @Cintra_USA  @Macquarie  @IFM_Investors", "2020-06-24T19:00:12.000Z": "Arizona continues to focus on innovative ideas, growing partnerships and responsible investments to grow infrastructure across our state. I'm proud to host a discussion today on financing infrastructure with fellow governors and industry leaders. @GovLarryHogan  @NatlGovsAssoc", "2020-06-24T17:02:42.000Z": "Arizona and @AZDHS continue to work with our health care partners and private testing labs to expand #COVID19 testing throughout the state. MORE: Arizona Working With Health Care And Federal Partners To Expand COVID-19 Testing Testing Capacity Continues To Increase In ArizonaPHOENIX - Governor Doug Ducey and the Arizona Department of Health Services (ADHS) today announced continued efforts to increase access to COVID-19... azgovernor.gov", "2020-06-24T16:07:26.000Z": "Arizona is a team, and teammates protect each other. #MaskUpAZ  #UsaCubrebocas  @PHXRisingFC  @jcali10  @jonbakero7", "2020-06-24T00:35:49.000Z": "Aquila Fire - A Red Cross Evacuation center will be open at Boulder Creek High School, 40404 N. Gavilan Peak Pkwy, Anthem, AZ 85086, at 5:30 pm today in response to evacuations caused by the Aquila Fire.  Those evacuated may go to the high school for information and assistance.", "2020-06-24T00:58:04.000Z": "Per @MaricopaEmerg , Evac info for #AquilaFire  #AZFire  #AZForestry . @RedCrossAZ", "2020-06-23T22:12:35.000Z": "NEW: @SonoraQuestLabs will be receiving this @Roche equipment, helping to continue the expansion of testing capacity in #AZ . Grateful to our healthcare and federal government partners for their advocacy and partnership in getting this done. \n\ncc: @VaughnHillyard Quote Tweet Vaughn Hillyard @VaughnHillyard AZ Gov's COO @AZDanielRuiz : \"We're working to get a Roche 8800, or multiple, to Sonora Quest-thru FEMA & other federal partners to get the resources we need. These are in high demand. But Arizona continues to be a priority from a national standpoint.\" https:// twitter.com/VaughnHillyard /status/1275432313329872897?s=20  Show this thread", "2020-06-23T19:15:17.000Z": "For years, Arizonans heard empty talk about the border. With @realDonaldTrump , we are seeing action. \n\nArizona is grateful for this Administration's focus on border security and the partnership we've had, including Arizona's Border Strike Force, to keep our citizens safe.", "2020-06-23T18:51:35.000Z": "NOW: @dougducey joins @realDonaldTrump , @DHS_Wolf , @CBP officials, @SenMcSallyAZ  @RepDLesko , @MayorNicholls and more for a roundtable briefing on border security in Yuma.", "2020-06-23T16:58:22.000Z": "Contact tracing helps Arizona contain the spread of #COVID19 .\n\nIf you get a call from public health, answer.", "2020-06-23T15:09:30.000Z": "#MaskUpAZ  @CDCgov guidance on how to safely wear a face covering", "2020-06-22T21:28:49.000Z": "@CoronadoNF  @pimaarizona  @PimaSheriff  @Sheriff_Napier  @forestservice  @GRFDAZ  @NorthwestFire", "2020-06-22T21:28:38.000Z": "To all the firefighters, safety and fire officials, @RedCrossAZ volunteers and everyone working to contain the #BighornFire and support fellow Arizonans - THANK YOU! We will continue to pray for those battling this fire and wildfires across the state. @azstateforestry  @inciweb", "2020-06-22T21:10:09.000Z": "#AZForestry Chief Steve Millert briefing media & @dougducey on current fire sit. across #Arizona . This year, we have already burned more than 3x the amount of acres than 2019 YTD. Please do your part; obey fire restrictions & stay alert. One spark is all it takes #AZFire", "2020-06-22T20:36:18.000Z": "NOW: Gov. @dougducey meets with @forestservice and @azstateforestry to discuss the latest on the #BighornFire and wildfire activity around the state.", "2020-06-22T20:35:36.000Z": "@inciweb  @CoronadoNF  @pimaarizona  @PimaSheriff  @Sheriff_Napier  @RedCrossAZ  @GRFDAZ  @NorthwestFire", "2020-06-22T20:35:23.000Z": "Joining @forestservice and @azstateforestry to receive a briefing on the #BighornFire in the Catalina Mountains. It is currently at 58,599 acres and 16% containment. I'm grateful to everyone working around the clock to contain this wildfire and protect our communities. 1/", "2020-06-22T18:53:01.000Z": "Feel sick? Stay home and rest  @AZDHS  @DrCaraChrist Quote Tweet AZ Dept of Health @AZDHS Stay home as much as possible and avoid close contact with others in public. Feeling sick? STAY HOME. https:// 1.azdhs.gov/30Y8cbh  #COVID19", "2020-06-22T17:28:26.000Z": "Whether you're looking to advance your career or find a new one, @ARIZONAatWORK 's tools & training will help you return to the workforce with a mindset for a new start.\n\nFind the tools you need to prepare to #ReturnStronger . Visit >> https:// azcommerce.com/returnstronger/", "2020-06-22T16:51:31.000Z": "Had a call with @VP & fellow governors to discuss the latest on #COVID19 . Arizona continues to focus on containing the spread, continuing to increase testing & contact tracing, & prioritizing those most vulnerable. We're grateful to the Administration for the continued support.", "2020-06-22T16:28:50.000Z": ". @AZDHS has a list of #COVID19 testing sites and locations. Find more information HERE: AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-06-21T19:26:51.000Z": "#BushFire update from @TontoForest  Thank you to the many firefighters battling wildfires around the state and working to keep communities safe. Quote Tweet Tonto NF @TontoForest #BushFire Morning Update for June 21, 2020\nAcreage 184,531 acres Containment 15% Resources 846 #BushFireTontoNF  #BushFire  #AZFire  @azstateforestry  @wildlandfireAZ  https:// bit.ly/BushFireInciNe ws ", "2020-06-21T16:30:00.000Z": "This #FathersDay , many dads across Arizona are working hard to preserve public safety, battle wildfires and protect public health. We wish them and all dads a safe, healthy and happy Father's Day.", "2020-06-21T14:30:00.000Z": "Happy #FathersDay to all the dads out there! I'm proud to be a dad to three exceptional boys.", "2020-06-20T20:16:39.000Z": "#MaskUpAZ", "2020-06-19T22:58:13.000Z": "Gov. @dougducey has ordered flags be lowered to half-staff tomorrow from sunrise to sunset to honor the life and service of Navajo Police Department Officer Michael Lee. https:// azgovernor.gov/governor/news/2020/06/governor-ducey-orders-flags-half-staff-honor-navajo-police-department-officer   @Navajopd", "2020-06-19T22:52:57.000Z": "Arizona is grateful to all our frontline public health and safety workers keeping us safe during this pandemic. In honor of Police Officer Lee's life and service, flags at all state buildings will be lowered to half-staff tomorrow from sunrise to sunset. Quote Tweet Juan Magaña @PhxJuanTVNews @Arizona_DPS & @Navajopd working together in the procession for Navajo Police Officer Michael Lee who died of #COVID19 . NPD confirms this is the first officer line of duty death as a result of COVID. Procession will go from @BannerHealth to @CityOfGallup More @ 4pm on #azfamily", "2020-06-19T22:00:01.000Z": "Contact tracing is an important tool to help slow the spread of #COVID19 . Please pick up the phone when #publichealth calls. https://", "2020-06-19T19:29:39.000Z": "#Bushfire Update: Quote Tweet Tonto NF @TontoForest #BushFire Morning Update for June 19, 2020\nAcreage 151,075 Containment 7% Resources 855\n\nPDF @bit .ly/2BktDsc #AZFire  @TontoForest  @azstateforestry", "2020-06-19T16:46:31.000Z": ". @ArizonaDEQ 's first-in-the-nation wildfire smoke forecast provides essential information to our communities on air quality, outdoor activity recommendations and more. https:// pinalcentral.com/arizona_news/a rizona-becomes-first-state-to-issue-wildfire-smoke-forecast/article_8aef345e-6273-59aa-879e-dd233251222c.html   @PinalCentral  #BighornFire  #BushFire Arizona becomes first state to issue wildfire smoke forecast PHOENIX - Arizona Department of Environmental Quality officials have announced a new wildfire smoke forecast, the first forecast of its kind in the country. pinalcentral.com", "2020-06-19T16:19:09.000Z": "Small steps can make a big difference. \n\nWash your hands for at least 20 seconds, stay home when sick, practice physical distancing and #MaskUpAZ .", "2020-06-19T15:00:23.000Z": "Public health is reporting increased numbers of #COVID19 cases in Arizona. Do your part to prevent the spread of the virus - wear a cloth face cover when you have to go out in public. @AZDHS  #MaskUpAZ  http:// azhealth.gov/MaskUpAZ", "2020-06-19T13:15:00.000Z": "#Juneteenth celebrates the day in 1865 when union troops landed in Galveston, Texas to share the news of the signing of the Emancipation Proclamation. Gov. @dougducey has issued a commendation recognizing the importance of this day and Arizona's African American heritage.", "2020-06-19T13:00:01.000Z": "Arizona joins the nation in celebrating #Juneteenth , a day when the promise of freedom was fulfilled for all Americans. Arizona celebrates our African American heritage today and every day, and I encourage all Arizonans to join in a day of celebration, education and reflection.", "2020-06-18T23:06:34.000Z": "To slow the spread of #COVID19 , Arizonans should continue to stay physically distant, stay home when sick and WEAR MASKS. More tips on the right way to wear a mask can be found here: http:// azhealth.gov/MaskUpAZ  #MaskUpAZ", "2020-06-18T22:00:00.000Z": "Everyone can do their part to help stop the spread of #COVID19 . #MaskUpAZ  #UsaCubrebocas Quote Tweet Doug Ducey @dougducey We need everyone to #MaskUpAZ and do their part.", "2020-06-18T17:03:43.000Z": "Thank you @Dbacks  @AZCardinals  @Suns  @PhoenixMercury  @ArizonaCoyotes  @dougducey  #MaskUpAZ Quote Tweet Doug Ducey @dougducey Arizona, let's see your game face. #MaskUpAZ  @DBacks  @AZCardinals  @Suns  @PhoenixMercury  @ArizonaCoyotes", "2020-06-18T20:41:53.000Z": "Let's #MaskUpAZ ! #KeepingArizonaHealthy Quote Tweet Doug Ducey @dougducey Arizona, let's see your game face. #MaskUpAZ  @DBacks  @AZCardinals  @Suns  @PhoenixMercury  @ArizonaCoyotes", "2020-06-18T20:00:07.000Z": "Reduce the risk of infection to yourself and the people you care about. Stay home as much as possible and avoid close contact with others in public. Feeling sick? STAY HOME. https:// 1.azdhs.gov/2YgawZv  #COVID19", "2020-06-18T19:19:52.000Z": "#wewearmasks ⁣\n⁣-to protect all who live, work, and play in the City of Phoenix⁣\n-to protect ourselves.⁣\n-to minimize the transmission of COVID-19.⁣\n⁣ #MaskUpAz ⁣", "2020-06-18T22:58:31.000Z": "Congratulations, @DrPanch ! @ASU  @NSF Quote Tweet National Science Foundation @NSF Today, the Senate unanimously confirmed Sethuraman Panchanathan as the new @NSF Director. \n\nWe are looking forward to having you onboard, Dr. Panchanathan! : @ASU", "2020-06-18T21:51:25.000Z": "Great to hear, @GovLarryHogan ! Very happy for you and your family. Quote Tweet Governor Larry Hogan @GovLarryHogan Five years ago today, I was diagnosed with a very advanced, very aggressive cancer that had rapidly spread throughout my body. Today, I had my final, five-year anniversary PET scan at UMMS, which confirmed that I am still 100 percent cancer free! Show this thread", "2020-06-18T19:46:34.000Z": "@GovNedLamont  @GovPritzker  @GovTimWalz  @GovParsonMO  @GovRicketts  @GovMikeDeWine  @GovernorBullock  @NatlGovsAssoc", "2020-06-18T19:46:19.000Z": "Had a productive, bipartisan discussion with fellow Council of Governors members to discuss top defense and security issues, including cybersecurity. I look forward to furthering this discussion during our virtual plenary meeting later this summer. @AsaHutchinson  @GovHawaii", "2020-06-18T18:05:20.000Z": "Arizona will continue to take a smart, responsible approach to water.\n\n\"Use of Colorado River water in the three states of the river's lower basin fell to a 33-year low in 2019...\" @circleofblue Quote Tweet Ian James @ByIanJames Arizona, California and Nevada used less water from the Colorado River than they have in any year since 1986. The drop in water use in recent years shows conservation efforts have been helping prevent reservoirs from reaching critically low levels. ... https:// circleofblue.org/2020/world/rem arkable-drop-in-colorado-river-water-use-a-sign-of-climate-adaptation/  Show this thread", "2020-06-18T16:48:06.000Z": "GO! -  Evacuate The general boundaries of the zone are the Lower Catalina Highway/Lower Mt. Lemmon Communities from Organization Ridge Road to South Willow Canyon. Full release: https:// bit.ly/30VqPfK Interactive Map: https:// bit.ly/PCBigHornFire  #BigHornFire", "2020-06-18T16:43:45.000Z": "Arizona, let's see your game face. #MaskUpAZ  @DBacks  @AZCardinals  @Suns  @PhoenixMercury  @ArizonaCoyotes", "2020-06-18T01:49:20.000Z": "We are fortunate to be able to spend some of our CARES funding from @dougducey to help our small businesses. #togetherwearesuperioraz Quote Tweet Bryan Seppala, AZED Pro @seppala_bryan Exciting news as the Town of Superior and @LocalFirstAZ have launched a $97,000 grant fund for small business relief! Great to hear @LizaNoland on the weekly COVID update with @Mayor_Mila as she announces and promotes this program!", "2020-06-18T04:17:54.000Z": "Our thoughts continue to be with those working around the clock to protect our communities and give aid to those who have been displaced from their homes. @azstateforestry  @RedCrossAZ Quote Tweet KVOA News 4 Tucson @KVOA SPEECHLESS: Check out this video that captured smoke from the Bighorn FIre piling into the sky near Summerhaven. https:// bit.ly/2YJ6Wpz?utm_me dium=social&utm_source=twitter_KVOA ", "2020-06-17T23:11:00.000Z": "#MaskUpAZ", "2020-06-17T23:46:03.000Z": "We need everyone to #MaskUpAZ and do their part.", "2020-06-17T22:45:36.000Z": "We remain one hundred percent focused on protecting public health and saving lives. We all have a role and need to continue to prioritize health and safety. I'm grateful for Arizona's continued cooperation and partnership.  8/8", "2020-06-17T22:44:57.000Z": "ENHANCED GUIDANCE:\n\nWe need businesses to continue to protect customers and employees. Enhanced guidance from @AZDHS will require physically distancing, face covers whenever possible, symptom checks for employees and increased cleaning and disinfecting. 7/", "2020-06-17T22:44:19.000Z": "FOCUSED ON LONG-TERM CARE SETTINGS: \n\nWith testing of all residents and staff recently completed, we're providing an additional $10 million for more PPE and masks in long-term care settings. @AZDHS will continue to prioritize ongoing testing of residents and staff. 6/", "2020-06-17T22:43:44.000Z": "ENHANCED EDUCATION CAMPAIGN:\n\nWe're moving forward on the next iteration of a public awareness campaign, and expanding it. All Arizonans should continue to stay physically distant, stay home when sick and WEAR MASKS. #MaskUpAZ", "2020-06-17T22:42:39.000Z": "ENABLING LOCALIZED MITIGATION EFFORTS: @AZDHS today released updated guidance allowing local governments to implement mask and face covering policies, allowing local authorities to tailor mitigation efforts specific to the local public health need. 4/", "2020-06-17T22:42:05.000Z": "CONTACT TRACING:\n\nI'm signing an Executive Order providing @AZDHS authority to implement a consistent, statewide system for contact tracing & making available 300 @AZNationalGuard to increase manpower. ADHS is also providing $37M to boost contact tracing locally & statewide. 3/", "2020-06-17T22:39:16.000Z": "TESTING:\n\nWe're continuing to ramp up testing through a partnership with @ASU to scale up saliva-based testing. The less invasive test will allow for more rapid & accurate results while requiring less PPE & facilitating greater usage at workplaces & health care facilities. 2/", "2020-06-17T22:38:37.000Z": "With #COVID19 transmission increasing in Arizona and around the country, I'm announcing enhanced actions to contain the spread and protect those most vulnerable. These actions build on Arizona's substantial efforts to boost testing, expand contact tracing, secure PPE and more. 1/", "2020-06-17T22:02:24.000Z": "NOW: I'm joining @AZDHS Director @DrCaraChrist and Arizona DEMA Director Major General McGuire to share the latest on #COVID19 . Doug Ducey @dougducey LIVE: Governor Ducey, Dr. Christ, Maj. Gen McGuire Provide Arizona COVID-19 Briefing", "2020-06-17T19:41:06.000Z": "Cuídate a ti mismo. \n\nCuida a los demás.\n\nAyuda a contener la propagación del #COVID19 .\n\nUsa un cubrebocas. #UsaCubrebocas", "2020-06-17T18:58:50.000Z": "Thank you to the more than 2,000 brave firefighters battling wildfires across the state. Please keep them in your thoughts as they work day and night to protect people, pets and property. @azstateforestry", "2020-06-17T17:30:10.000Z": "These health and safety precautions are simple, but very important. We can all do our part to contain the spread of #COVID19  GIF", "2020-06-17T16:58:16.000Z": "Protect yourself.\n\nProtect others.\n\nHelp contain the spread of #COVID19 .\n\nWear a mask. #MaskUpAZ", "2020-06-17T02:30:01.000Z": "Wear a cloth face covering in public, regardless of whether you feel sick or not. Do your part to keep yourself and others healthy. https:// 1.azdhs.gov/37zesr4  #COVID19", "2020-06-17T00:12:59.000Z": ". @RedCrossAZ has set up 3 Emergency Evacuation Centers across the state as many in the path of wildfires have had to evacuate their homes. Arizona is grateful to the many volunteers stepping forward to provide aid and support during this time.", "2020-06-16T22:47:56.000Z": "Bighorn Fire - Per request of the Pima County Office of Emergency Mgmt. and the Pima County Sheriff's Office, we have opened an evacuation center for Summerhaven evacuees at Sahuaro High School, 545 N. Camino Seco, Tucson, 85710. #koldnews  #kvoa  #kgun9  #bighornfire  #pcsheriff", "2020-06-16T21:08:56.000Z": "Help slow the spread of #COVID19 by staying at least six feet away from others in public settings. Wear a cloth face covering when out in public. https://", "2020-06-16T20:33:59.000Z": "GO! - Evacuate The general boundaries of the zone are Mt. Lemmon/ Mt. Bigelow north of Organization Ridge Rd, including Summerhaven are asked to EVACUATE NOW. Full release here https:// bit.ly/3hCCnuj . Interactive Map here http:// pima.gov/Bighorn  #BighornFire", "2020-06-16T20:36:03.000Z": "Virtual career fair on Thursday, June 18 starting at noon Quote Tweet Arizona Commerce Authority @azcommerce Mark Anthony Brewing, maker of @WhiteClaw and the fastest growing & 4th largest beer company in the U.S, is hosting a virtual career fair from 12-3 PM, June 18 in @GlendaleAZ ! \n\nThe team is recruiting brewers, engineers, maintenance technicians and more: https:// app.brazenconnect.com/events/1JbMuq", "2020-06-16T18:43:27.000Z": "ATTENTION: EVACUATE NOW A \"Go\" notice has been issued in the area of Sunflower due to the Bush Wildfire burning along State Route 87. Residents in the Sunflower area should #evacuate now. Grab your emergency Go-kit and go to your relocation area or with friends/family.", "2020-06-16T18:02:34.000Z": "We all have a role to contain the spread of #COVID19 :", "2020-06-16T17:32:56.000Z": "Per the @TontoForest - #BushFire is 64,513 acres determined after infrared flight. Fire is being driven by high winds & heavy, continuous, dry grass & brush. Pic taken from Punkin Center. More info can be found on @inciweb  #AZFire  #AZForestry  #BushFireTontoNF", "2020-06-16T15:57:12.000Z": "Today we're reporting a record number of #COVID19 cases. Please do your part to help slow the spread: Maintain physical distancing Thoroughly wash your hands Wear a face covering when out in public Cover your cough or sneeze Stay home when sick", "2020-06-16T16:01:35.000Z": "It's #MonsoonAwarenessWeek and it's important all Arizonans know what to do when a storm hits: Pay attention to weather reports Pull over when caught in a dust storm Remain indoors for at least 30 minutes after a storm passes\n\nMore from @AzEIN : https:// ein.az.gov/monsoon-awaren ess#:~:text=Monsoons%20are%20created%20when%20moisture,through%20the%20end%20of%20September ", "2020-06-15T22:40:59.000Z": "As AZ works to contain the spread of #COVID19 , I'm thankful to @VP for connecting this weekend to offer additional @CDCgov assets. Leadership across AZ continues to protect public health, including @ASU Pres. @michaelcrow 's preparation in returning students to campus this fall.", "2020-06-15T22:00:02.000Z": "Find #COVID19 testing sites, hours of operation, and information about pre-registration here: https://", "2020-06-15T21:45:51.000Z": "\"More than 35,000 calls have come into the statewide COVID-19 Hotline, administered by 2-1-1 Arizona and the Crisis Response Network, since it opened March 22.\" @211Arizona provides important #COVID19 related information in English & Spanish. https:// azcentral.com/story/news/loc al/karinabland/2020/06/14/states-2-1-1-system-offers-help-coronavirus-pandemic/3179834001/   @azcentral Questions keep 2-1-1 operator busy, but sometimes it's enough to listen Some of the questions coming into the statewide COVID-19 hotline are easy, others challenging. Some are heartbreaking. azcentral.com", "2020-06-15T17:44:37.000Z": "Arizona and @uarizona are partnering to protect the health and safety of those who take care of us, providing 250,000 #COVID19 antibody tests for health care workers and first responders.\n \nSign up here: https:// covid19antibodytesting.arizona.edu  @UAZHealth  @UArizonaPres  @UAZPublicHealth", "2020-06-15T17:13:59.000Z": "Arizona has #COVID19 testing sites available across the state. Access information on locations, pre-registration requirements and more HERE: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing   @AZDHS AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-06-15T15:57:58.000Z": "Per @GilaCountySO , GO notice in effect for the Tonto Basin & Punkin Center communities due to the #BushFire . The @RedCrossAZ will be opening a shelter at Lee Kornegay HS in Miami. Please follow the advice of law enforcement & evacuate. #AZFire  #AZForestry  #BushFireTontoNF", "2020-06-15T15:16:42.000Z": "Latest #BighornFire update from @CoronadoNF  Quote Tweet Coronado NF @CoronadoNF Bighorn Fire is 14,675 acres at 22% containment. Fire was active overnight. Crews strengthening thinning work done around Summerhaven. Full update at https:// inciweb.nwcg.gov and http:// facebook.com/bighornfireinfo", "2020-06-15T01:52:11.000Z": "Bighorn Fire:  Set Alert for the Mt. Lemmon/ Mt. Bigelow north of Organization Ridge Road Area, including Summerhaven Read full story here: https:// bit.ly/2AAuQvw Interactive Map: https:// bit.ly/PCBigHornFire", "2020-06-14T18:07:13.000Z": "Every morning, I rise and hoist my American flag on my balcony. Old Glory serves as a welcome reminder that we're always striving to become a more perfect union. Today and every day, let us remember all the men and women who've fought valiantly to defend it. #flagday2020", "2020-06-14T17:33:04.000Z": "Happy birthday, @USArmy ! #ArmyBday", "2020-06-14T16:40:50.000Z": "Thank you to all the crews and first responders battling the #BighornFire and fires around the state @azstateforestry  @forestservice  @PimaSheriff Quote Tweet Melissa Egan @_MelissaEgan This was on the roof of a family's home in the pre-evacuation, or 'SET - Be Alert' area, for the #BighornFire .   Aerial crews can see it as they continue to battle the blaze.  \n\nPhoto provided by @PimaSheriff . #ThankYou", "2020-06-14T15:04:06.000Z": "On this day 243 years ago, the Second Continental Congress established \"Old Glory\" as America's national symbol.\n\nEver since, it has waved o'er the land of the free and the home of the brave. #FlagDay", "2020-06-13T17:45:33.000Z": "Another Red Flag Warning issued by the @NWSFlagstaff for Saturday from 11am-7pm for most of N. #AZ . Please use extreme caution! Secure tow chains, don't pull off into tall grass, no campfires & avoid burning. Do your part - don't let a start. #AZFire  #AZForestry", "2020-06-13T03:05:18.000Z": "GO! - Evacuate! The general boundaries of the zone are the forest service boundary on the south and east. Southerland Trail on the west, and Rollins Road on the north. Refer to the interactive map https:// bit.ly/PCBigHornFire for greater detail. Full Release: https:// bit.ly/37qSTJf Bighorn Wildfire Alert Zones Bighorn Wildfire Alert Zones pimamaps.maps.arcgis.com", "2020-06-12T23:48:12.000Z": "@drcarachrist  @azcorrections", "2020-06-12T23:48:00.000Z": "We held a conference call today with leaders of Arizona's faith-based community. Thank you Father Tellez and all our faith leaders for your work to support Arizonans' well-being during #COVID19 . @azbishop  @azdiocese  @HunterRuffin  @revandyburnette  @RockFremont  @VIPphx", "2020-06-12T23:00:50.000Z": "In Arizona, we stand on the shoulders of giants. Happy 40th Anniversary of the Groundwater Management Act! #GMA40thAnniversary  #DCP  @azwater Quote Tweet ADWR @azwater \"We will continue to be guided by a spirit of collaboration and cooperation as we build on the work of those who came before us and secure Arizona's water future for generations to come.\" - Governor @dougducey  http:// ow.ly/ok9r50A6C7v  #GMA40thAnniversary", "2020-06-12T17:03:02.000Z": "Happy Arizona Women Veterans Day! Join us in honoring the service & sacrifice of our women veterans and their families. #AZVETS  #WomenVeteransDay", "2020-06-12T19:03:35.000Z": "We had a very productive discussion around economic development, education, equal justice & more with leaders  on the Arizona Commission of African American Affairs. I'm grateful for their continued counsel and input. We'll be working together to move these ideas forward. @azcaaa", "2020-06-12T18:20:31.000Z": "#COVID19 testing is available throughout the state for those who think they have been exposed to the virus.\n\nLocations, hours of operation and more: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing   @AZDHS AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-06-12T17:40:10.000Z": "Throughout U.S. history, women have courageously answered the call to serve our nation. Arizona is grateful for the tremendous sacrifices women in uniform have made to protect our liberties and keep us safe. #WomenVeteransDay", "2020-06-12T16:31:42.000Z": "Latest update from @CoronadoNF on the #BighornFire .\n\nEvacuations are in place. A cooling center is set up at Canyon del Oro High School. Evacuation questions: (520) 351-FIRE(3473) @pimaarizona  @OroValleyPD  @OroValleyAZGov Quote Tweet Coronado NF @CoronadoNF Bighorn Fire is 6,200 acres, 10% containment. Crews conducted burnouts from Pima Canyon eastward. Aircraft supported the with retardant drops. Some foothills areas were evacuated. Full update at https:// inciweb.nwcg.gov and http:// Facebook.com/CoronadoNF", "2020-06-11T20:40:16.000Z": "Southern AZ-based @RaytheonTech has been named the '2020 Project of the Year' in @AreaDevelopment 's Annual Shovel Awards!\n\nFor the 2nd consecutive year, an #Arizona project has been recognized for the award! Congrats, Raytheon Missile Systems! https:// areadevelopment.com/Gold-Shovel-Ec ondev-Awards/Q2-2020/raytheon-keeps-growing-in-tucson.shtml  Quote Tweet Area Development @AreaDevelopment 2020 Gold & Silver Shovel Awards Recognize State and Local Economic Development Efforts https:// areadevelopment.com/Gold-Shovel-Ec ondev-Awards/Q2-2020/recognize-state-and-local-economic-development-efforts.shtml   #econdev  #manufacturing  #siteselection", "2020-06-11T21:36:12.000Z": "Protecting public health during this pandemic has been our highest priority, & it will continue to be. We know this is a marathon, not a sprint, & we need everyone to continue to follow the public health & safety guidance. I'm thankful to all Arizonans for their cooperation. 7/7", "2020-06-11T21:35:34.000Z": "We're continuing to focus on protecting those most vulnerable to the virus, including administering testing in our nursing homes and prison settings and ensuring proper infection control techniques continue to be utilized. 6/", "2020-06-11T21:34:22.000Z": "And businesses need to continue to follow the public health guidance from @AZDHS and @CDCgov to keep employees and customers safe: https:// azgovernor.gov/governor/reope ning-guidance  5/ Reopening Guidance Guidance from the Arizona Department of Health Services, tips to do your part and other resources. azgovernor.gov", "2020-06-11T21:33:35.000Z": "Arizonans need to continue to do their part to slow the spread. That means physically distancing, washing your hands, using cloth face coverings when physical distancing is not an option, and staying home when sick. 4/", "2020-06-11T21:32:49.000Z": "As our state gradually reopens & more people move about, we're seeing increased transmission, which is to be expected. This is happening around the country. To be clear, however: our hospitals have capacity & anyone who might need health care due to #COVID19 has access to it. 3/", "2020-06-11T21:31:56.000Z": "Today, we are prepared. We've grown the supply chain for PPE, stocked up on critical medical supplies like ventilators, built out more capacity at our hospitals and added additional surge beds on top of that, if needed, which today it is not. 2/", "2020-06-11T21:30:45.000Z": "Over 90 days ago, Arizona declared a public health emergency related to #COVID19 . Since then, we've worked aggressively to secure PPE, expand hospital capacity, ramp up testing, slow the spread of the virus and save lives. 1/", "2020-06-11T21:00:34.000Z": "NOW:\n\nI'm joining @AZDHS Director @DrCaraChrist and Arizona DEMA Director Maj. General Michael T. McGuire to provide #COVID19 updates. Doug Ducey @dougducey Governor Ducey, Dr. Christ, Maj. Gen. McGuire Share COVID-19 Updates", "2020-06-11T20:05:49.000Z": "Health care workers play a critical role in supporting a healthy community, especially those on the front lines of the COVID-19 response worldwide. We can't thank them enough for their patience, hard work and compassion displayed every day. Quote Tweet HSAAZ @HealthSystemsAZ We are well prepared to manage an increase in patient volume. Read our full statement here: https:// hsaaz.com/statement-from -arizona-hospital-leaders-regarding-covid-19-response-and-preparedness/  Show this thread", "2020-06-11T20:00:01.000Z": "We appreciate our collaboration with @dougducey and local experts and other health care organizations to make sure AZ health systems continue to effectively meet the all the healthcare needs of our communities. https:// hsaaz.com/statement-from -arizona-hospital-leaders-regarding-covid-19-response-and-preparedness/ ", "2020-06-11T19:48:14.000Z": "HonorHealth would like to thank our physicians, nurses and staff for their dedication, flexibility and focus to deliver the best care to all our patients. Their work is exceptional, and they all have our deepest gratitude. Quote Tweet HSAAZ @HealthSystemsAZ We are well prepared to manage an increase in patient volume. Read our full statement here: https:// hsaaz.com/statement-from -arizona-hospital-leaders-regarding-covid-19-response-and-preparedness/  Show this thread", "2020-06-11T19:44:02.000Z": "Recently there have been local and national media reports regarding the increase in confirmed positive COVID-19 cases in Arizona and how our state is managing the COVID-19 crisis.", "2020-06-11T18:23:21.000Z": "Thank you @UnitedHealthGrp for your continued support of our communities' health and well-being. Quote Tweet UnitedHealth Group @UnitedHealthGrp We're committing $500,000 to @foodbanksaz to help Arizona's network of nearly 1,000 food pantries and organizations during the #COVID19 crisis. Learn more: http:// uhg.co/UnitedPartners AZ1 ", "2020-06-11T18:18:53.000Z": "We are grateful to those fighting the #BighornFire and fires around the state. We ask everyone in the area to follow the directions of local fire and safety officials as updates are made. Quote Tweet Official Pima County @pimaarizona The Evacuation Order issued by the County Sheriff's Department in coordination with the Coronado National Forest is for the purposes of a back burn that will be conducted in the area to protect property and residents in the area.", "2020-06-11T18:17:05.000Z": "All Arizona kids deserve to live and learn in a safe and nurturing environment. This grant funding will support organizations that serve families in rural communities, provide educational resources for kids, help families in need and much more. @AZGOYFF Quote Tweet Arizona Governor's Office of Youth, Faith & Family @AZGOYFF NEW: Through the License Plate Program we are awarding $375K in grant funding to 10 #AZ orgs to support victims of child abuse and neglect. Grateful for the critical services & support these orgs continue to provide for our most vulnerable. Thank you! https:// bit.ly/3cVqrjT", "2020-06-11T16:42:18.000Z": "Arizona is working to get hundreds of millions in critical resources to local governments faster. READ MORE: Getting More Dollars To Local Governments Faster azgovernor.gov", "2020-06-10T23:56:05.000Z": "A big congratulations to @ASU_Baseball infielder Spencer Torkelson! @MLB  @Tigers  @SpennyT  #MLBDraft  Quote Tweet MLB @MLB The @Tigers select Arizona State 1B Spencer Torkelson. #MLBDraft", "2020-06-10T22:30:17.000Z": "Today, Arizona remembers and celebrates our first female Governor, Rose Mofford - who was born on this day in 1922. @AZHistSociety Quote Tweet Arizona Historical Society @AZHistSociety #OTD in 1922, Rose Mofford was born in Globe, Arizona. Her long career in government and politics began at an early age. Before becoming the first female governor of Arizona, Rose Perica (as she was known then) was the first female student body president at Globe High School! 1/ Show this thread", "2020-06-10T21:13:11.000Z": "Food banks across Arizona provide nutritious meals to individuals and families in need. @foodbanksaz has information on volunteer opportunities, emergency food options and more: http:// azfoodbanks.org/index.php/food bank/index/?gclid=EAIaIQobChMIo8LjvZmx6AIVBJyzCh1tjQddEAAYAiAAEgKkhvD_BwE ", "2020-06-10T19:49:03.000Z": "The #2020Census is happening now! Responding online is safe, easy and important. Learn more and respond now at http:// azcensus2020.gov . @AZCensus2020", "2020-06-10T18:24:01.000Z": "Every motorist on Arizona's roads can do their part to reduce the risk of wildfires. #AZTroopers  #CourteousVigilance", "2020-06-10T18:38:57.000Z": "Joined my fellow governors for a call today to get an update from a few businesses across the country on their work to prioritize public health and safety during #COVID19 . @NatlGovsAssoc", "2020-06-10T17:10:00.000Z": ". @CDCgov guidance for individuals:", "2020-06-10T16:35:45.000Z": ". @TaronisFuels selected Peoria for its advanced manufacturing operations - creating 400+ jobs! https:// ktar.com/story/3255019/ taronis-fuels-to-locate-corporate-headquarters-in-peoria/   @KTAR923  @azcommerce  @MayorCCarlat  @PeoriaAZ Taronis Fuels to locate corporate headquarters in Peoria Taronis Fuels will be locating its corporate headquarters and advanced manufacturing operations in Peoria, the company announced in a press release. ktar.com", "2020-06-10T16:03:31.000Z": "Businesses play an important role in helping Arizona #ReturnStronger . @CDCgov has guidance for employers to help keep customers and employees safe. MORE:", "2020-06-10T00:48:47.000Z": "Thank you @RaytheonDefense for your support to @foodbanktucson and @FeedingAmerica ! @Raytheon Quote Tweet Raytheon Missiles & Defense @RaytheonDefense As food banks across the U.S. work to provide meals for those in need, aid from our recently announced $5 million donation to @FeedingAmerica is now starting to arrive to food banks in 15 regions across the U.S., including @foodbanktucson . @kgun9 reports: https:// rtxdefense.co/37gGXtr", "2020-06-09T22:39:09.000Z": "I'm grateful to meet with Janelle Wood, founder of the Black Mothers Forum. Keeping our kids and communities safe is a priority we all share. We've got work to do, and I look forward to building on the ideas discussed today.", "2020-06-09T20:28:28.000Z": ". @ArizonaDOT 's new dust detection and warning system on I-10 will warn drivers of hazardous driving conditions from windblown dust and keep more Arizonans safe! Details Quote Tweet Arizona DOT @ArizonaDOT Technology is helping detect and warn drivers about dust storms on I-10 ... just in time for monsoon season: https:// bit.ly/3dRBdsS  #I10  #aztraffic  #azwx", "2020-06-09T18:00:02.000Z": "As the state reopens in phases, it's important for Arizonans to understand that #COVID19 is widespread and still circulating in our community, so taking precautions like handwashing and staying home especially when sick remains critical. https://", "2020-06-09T18:42:20.000Z": "Congratulations to Magee Middle School and these incredible students! #STEM Quote Tweet Sandra Watson @SandraWatsonAZ Awesome work by Tucson's Magee Middle School students! Not only did a team of six girls win the world championship in one division, Magee was also the only middle school globally to enter all 5 categories & place in the top 15 in each! #TheArizonaWay  #STEM  https:// tucson.com/news/local/thi s-all-girl-engineering-team-from-tucson-took-1st-place-in-an-international-contest/article_d5f3b0d9-087e-55fe-9f7e-59bbaa3712b9.html ", "2020-06-09T16:27:45.000Z": "Important reminder:\n\nIt is illegal and highly dangerous to fly drones near wildfires. @azstateforestry Quote Tweet AZ State Forestry @azstateforestry If you fly, we can't. You're jeopardizing the safety of everyone in the air & on the ground. Fire suppression efforts have to stop, aircraft gets grounded & the potential for a fire to spread increases. #AZFire  #AZForestry twitter.com/Crossfire923/s", "2020-06-09T15:33:45.000Z": "We all play a role in protecting public health and safety. \n\nWash your hands Stay home when you are sick Disinfect frequently touched surfaces", "2020-06-09T00:06:32.000Z": "Thank you, @Supt_Hoffman , for your continued partnership and leadership and for putting the health and safety of our kids first. Quote Tweet Kathy Hoffman @Supt_Hoffman Last week, @azedschools released our Recommendations for Reopening Schools. Today, school leaders from across the state provided me, Gov. @dougducey , and @drcarachrist feedback on their re-opening plans, ongoing challenges, and what they're hearing from their communities.", "2020-06-08T23:22:49.000Z": "The citizen-soldiers of @AZNationalGuard have been crucial in the fight against #COVID19 , distributing PPE, supporting our food banks, and assisting our tribal nations. I'm grateful to @realDonaldTrump for extending Title 32 orders so they can continue this life-saving work.", "2020-06-08T23:10:31.000Z": "@DrCaraChrist  @azedschools  @AZDHS  @DVUSD  @DrFinchDVUSD  @KwilsonBESD33  @BuckeyeESD  @sunnysideusd  @AmphiSchools  @FlowingWellsHS  @MadisonAZ  @qrkellis  @DysartUSD  @dr_sadorf  @jsmeyerson  @VCP_AZ  @KimChayka  @AMSSchools  @BASISed  @JulieYoungEDU  @ASUPrepAcademy  @asuprepdigital", "2020-06-08T23:10:21.000Z": "I'm grateful for the continued collaboration with Arizona's school leaders to prioritize public health and safety. We'll continue working together to ensure kids, educators and staff can return safely to the classroom when the upcoming school year begins. @Supt_Hoffman", "2020-06-08T21:26:21.000Z": ". @uarizona is expanding #COVID19 antibody testing, including partnering with the state to provide 250,000 tests for first responders and health care workers. \n\nThose interested in getting tested can learn more and sign up here: https:// covid19antibodytesting.arizona.edu  @uarizonapres  @UAZHealth", "2020-06-08T18:06:52.000Z": "For the past 8 days, we've seen Arizonans exercise their Constitutional Rights in a peaceful manner. With this approach, Arizona can continue to be a good example of how First Amendment rights and public safety will be prioritized. 4/4", "2020-06-08T18:04:57.000Z": "With the curfew expiring, @Arizona_DPS will remain vigilant, working with local law enforcement leaders to ensure they have the tools necessary to keep our streets safe and protect the rights of all residents to make their voices heard. 3/", "2020-06-08T18:03:31.000Z": "I'm also thankful to all Arizonans for their patience during this time. Our state and nation are facing multiple challenges, and I'm very appreciative for how the citizens and leaders of our state are conducting themselves during this historic moment. 2/", "2020-06-08T18:02:19.000Z": "I want to thank both the peaceful protestors and law enforcement professionals for their cooperation during Arizona's statewide curfew. Arizona has avoided much of the violence we've seen in other states and large metro areas. 1/", "2020-06-08T16:42:06.000Z": "Arizona continues to reenergize our economy, expand testing & follow @CDCgov guidance to protect public health & safety. Thank you to Secretary @BetsyDeVosED for providing insight on returning to the classroom safely & @VP for the continued support as AZ works to #ReturnStronger .", "2020-06-08T16:16:11.000Z": "We all have a role in preventing wildfires. Make sure your campfire is completely out before walking away Never park in tall grass Clean out your gutters More safety precautions from @azstateforestry : https:// dffm.az.gov/fire/informati on/tips ", "2020-06-06T19:00:00.000Z": "Considered the beginning of the end of #WWII in Europe, #DDay was one of the largest military undertakings in history. Today, we remember and honor the courage and sacrifices of all those who risked their lives to turn back the tide of tyranny.", "2020-06-06T17:00:00.000Z": "From @USNatArchives : \n\nGeneral Eisenhower, commander of #DDay operations, sent this statement to the troops of the Allied Forces.", "2020-06-06T15:00:00.000Z": "President Franklin D. Roosevelt led a prayer on a national radio broadcast on #DDay . \n\nLISTEN  @FDRLibrary", "2020-06-06T13:00:01.000Z": "On this day 76 years ago, 160,000 brave Allied troops launched the attack to retake the continent of Europe.  \n\n\"Full victory - nothing else\"  General Dwight D. Eisenhower #DDay", "2020-06-05T22:40:37.000Z": "Arizona's team at the State Emergency Operations Center has worked day and night to protect people and property, keep Arizona informed, and help us prepare for challenges head-on. I met with the team today and had the opportunity to thank them for their hard work.", "2020-06-05T22:13:52.000Z": "Facing unprecedented public health and economic challenges due to #COVID19 , Arizona once again showed this year how to put politics aside and come together. I'm grateful to all members of the legislature for putting public health and safety first this session. Quote Tweet The 9th Floor @9thFloorAZ Gov. @dougducey today took action on all remaining legislation on his desk, signing a total of 32 bills. These include legislation to expand the Arizona Teachers Academy, increase accountability at boards and commissions, enhance suicide prevention training, and more.", "2020-06-05T21:19:39.000Z": "Arizona activated our Health Emergency Operations Center on January 27. Since then, more than 160 team members have put 48,000+ combined hours, working around the clock to protect health and safety. It was my pleasure to thank them personally for all that they do.", "2020-06-05T18:32:54.000Z": "Top 10 Markets include Phoenix-Mesa-Scottsdale, Arizona for Millennial Buyers During the Pandemic | Realtor Magazine Top 10 Markets for Millennial Buyers During the Pandemic \"As states and cities begin to reopen, millennials will play a significant role in the housing market's recovery,\" says NAR President Vince Malta. magazine.realtor", "2020-06-05T18:21:02.000Z": "A productive discussion with legislators from both sides of the aisle on keeping Arizonans safe and returning stronger. @seanbowie  @frankpratt  @VinceLeach  @beckynutt3  @JeffWeninger  @michudall  #ReturnStronger", "2020-06-05T15:45:09.000Z": "Arizona DEMA Director Maj. Gen. Michael T. McGuire on Arizona's citizen-soldiers' service across the state. @AZNationalGuard From Doug Ducey", "2020-06-05T05:28:39.000Z": "It is a honor and pleasure to be able to work in partnership with @dougducey . Quote Tweet Shaley Sanders @ShaleyKOLD @dougducey says Arizona will protect peace and order to protect the memory of #GeorgeFloyd . He thanked law enforcement across the state including @ChiefCMagnus and @Sheriff_Napier  #Breaking  #BreakingNews", "2020-06-04T21:50:54.000Z": "The Community Food Bank and Arizona National Guard are teaming up for another fresh produce giveaway, this one planned for 8-11 a.m. on Friday, June 5, at the Rio Rico High School athletic field parking lot. Drive through and have a free box of food loaded into your vehicle.", "2020-06-03T18:01:07.000Z": "Arizona is facing a critical blood shortage. We need volunteer blood donors like you to ensure blood is available when patients need it. Help patients here at home by scheduling your next donation now: http:// vitalant.org", "2020-06-04T23:00:02.000Z": "NWS has extended Excessive Heat Warnings for Cochise, Graham, Greenlee, Pima, and Santa Cruz until 6/5. Daytime highs up to 109° F are expected. Heat Warnings will expire on 6/4 for Gila, La Paz, Maricopa, Mohave, Pinal, Yavapai, & Yuma. Stay safe! #AZheat  https://", "2020-06-05T00:09:12.000Z": "I'm grateful for the dedicated women and men of the Governor's Office, who have put in a tremendous effort over the last few weeks and beyond. Today was opportunity for me to say \"thank you\" over sandwiches from @WMSacksSandwich and ice cream from @ColdStone .", "2020-06-04T22:07:22.000Z": ". @AZDHS Director @DrCaraChrist provides #COVID19 testing update: From Doug Ducey", "2020-06-04T21:48:36.000Z": ". @Arizona_DPS Director Col. Heston Silbert: \"They care about this cause, they care about what's going on, they care about the improvement. And, we care.\"", "2020-06-04T21:35:10.000Z": "Arizona and the entire nation are facing challenges and being tested. Throughout, Arizonans have come together, and I'm very grateful.", "2020-06-04T21:02:48.000Z": "I'm joining @drcarachrist for a briefing to provide health and safety updates. WATCH: Doug Ducey @dougducey LIVE: Governor Ducey Provides Updates On COVID-19 In Arizona", "2020-06-04T17:37:23.000Z": "We are working to make sure Arizonans have the tools and support they need to reenter the workforce. Thank you to American Enterprise Institute President @RobertDoar for inviting me to speak about Arizona's policy efforts on today's call with @AEI .", "2020-06-04T16:07:55.000Z": "Blood donation opportunities  @VitalantAZ Quote Tweet Vitalant - Arizona @VitalantAZ Arizona is facing a critical blood shortage. We need volunteer blood donors like you to ensure blood is available when patients need it. Help patients here at home by scheduling your next donation now: http:// vitalant.org", "2020-06-03T23:59:01.000Z": "There are excessive heat warnings all over Arizona through tomorrow, so please be mindful and prepared when heading out to hike! Read hiking safety tips and take steps to prevent heat-related illness: https:// bit.ly/2LxyvyV  : @ tiffcwilkinson", "2020-06-03T20:05:01.000Z": "Although the #AZTestingBlitz has ended, there are still #COVID19 testing locations available for those who think they may have COVID-19. Visit our website for details. https://", "2020-06-03T20:30:40.000Z": "Responding to the 2020 Census is our civic responsibility. It's safe, easy and important! Please take a moment to respond soon: https:// azcensus2020.gov  #AZCounts  @AZCensus2020", "2020-06-03T19:45:28.000Z": "Arizona is working to ensure kids and teachers can return to the classroom safely this fall. We also remain focused on providing aid and resources to the Navajo Nation and all tribal neighbors. We are grateful to @VP & the Administration for the continued support. #ReturnStronger", "2020-06-03T18:53:56.000Z": "REMINDER As camping gets underway for the summer, don't forget to: Inspect your vehicle Drown campfires And much more! \n\nGuidance from @AZStateParks : Arizona State Park Fire Restrictions and Info | Arizona State Parks Arizona State Park Fire Restrictions, fire safety and wildfire information center. azstateparks.com", "2020-06-02T23:11:53.000Z": "Use this link to help find emergency food and free meals available throughout southern Arizona. Call ahead because schedules change frequently in these COVID times. https:// communityfoodbank.org/Get-Help/Find- Food ", "2020-06-03T15:55:30.000Z": "BLOOD DRIVE TOMORROW: Our local hospitals are facing a severe blood shortage right now and healthy donors can save a life.  #GilbertAZ Blood Drive with @VitalantAZ  Thursday, June 4th | 9:30AM - 2:30PM Southeast Regional Library (1/3)", "2020-06-03T16:12:53.000Z": "Thank you to law enforcement around the state and to all making their voices heard peacefully and respectfully. Quote Tweet Troy Hayden @troyhaydenfox10", "2020-06-02T22:07:23.000Z": "Thank you @RepCesarChavez and @AZRobertMeza for taking the time to meet and share your perspectives on moving Arizona forward together.", "2020-06-02T21:56:42.000Z": "Thank you to all our firefighters and safety officials! #OcotilloFire  @azstateforestry Quote Tweet AZ State Forestry @azstateforestry The #OcotilloFire in #CaveCreek is now 100% contained & the remaining evacuation order has been lifted. Thanks to all of our cooperators, @mcsoaz , @CaveCreek_AZ , @apsFYI , & all our local & fed. fire depts. for all of your hard & fast work. #AZFire  #AZForestry", "2020-06-02T21:53:58.000Z": "Best of luck in Navy Boot Camp, Cody. Thank you for supporting @OroValleyPD ! Quote Tweet Oro Valley Police @OroValleyPD Talk about a boost for morale! Cody, this 18 yr old just stopped by the station w/ treats for the officer to say thank you! He has always had good experiences when he had contact with OVPD & wanted to let us know he supports us! Cody, Good luck in Navy boot camp! #FeelingGood", "2020-06-02T17:35:06.000Z": "Reminder - Curfew Notice\n8:00 p.m. - 5:00 a.m.\nExpires - June 8, 2020\n\nThe Governor's Executive Order for the Declaration of Emergency - Curfew can be found here: https:// azgovernor.gov /governor-ducey-issues-statewide-de.\n\nBe safe El Mirage!", "2020-06-02T19:50:25.000Z": "Great to see this support for @Goodyearpolice ! Quote Tweet Goodyear Police Dept @Goodyearpolice Here's some #MondayMotivaton ...Thank you Pizza Hut at Estrella & Roosevelt for lunch! We appreciate your support! #GYPDCares  @pizzahut", "2020-06-02T17:03:24.000Z": "Arizonans can access guidance on career pathways, training programs and available certifications here: https:// azcommerce.com/returnstronger/  #ReturnStronger  @azcommerce  @ARIZONAatWORK Return Stronger The Arizona Commerce Authority (ACA) is the state's leading economic development organization with a streamlined mission to grow and strengthen Arizona's economy. azcommerce.com", "2020-06-02T02:12:23.000Z": "Thank you to Chief Jeri Williams and all her officers, along with Sheriff Penzone, Sheriff Napier and Chief Magnus and the men and women of @mcsoaz  @PimaSheriff & @Tucson_Police for their work last tonight and beyond. Arizona is grateful @PhxPDChief  @Sheriff_Napier  @ChiefCMagnus Quote Tweet The Mike Broomhead Show on KTAR News @BroomheadShow PHX Police @PhxPDChief tells @broomheadKTAR that @dougducey 's curfew order gave PHX PD the tools they needed to identify violent rioters Sunday night. \n\nLISTEN: https:// omny.fm/shows/the-mike -broomhead-show/jeri-williams-phoenix-police-chief-1 ", "2020-06-02T02:08:43.000Z": "I also thanked the men and women operating the DPS emergency operations center. They've put in long hours these last few nights and we're grateful for their vigilance. @Arizona_DPS", "2020-06-02T01:24:07.000Z": "Thank you Governor @dougducey for visiting with our troopers today and for your continued support. Quote Tweet Doug Ducey @dougducey Speaking with our State Troopers before they deploy to keep our streets safe and peaceful tonight. Thank you, @Arizona_DPS . Show this thread", "2020-06-02T01:03:59.000Z": "Speaking with our State Troopers before they deploy to keep our streets safe and peaceful tonight. Thank you, @Arizona_DPS .", "2020-06-01T21:54:01.000Z": "Just spoke to Congressman Tom O'Halleran to provide updates on Arizona's response to #COVID19 on the Navajo Nation. I appreciate @RepOHalleran 's continued support as we work to provide aid and resources to our tribal neighbors. #ReturnStronger", "2020-06-01T20:46:26.000Z": "Good news for #CaveCreek residents. Evacuation orders will be lifted tomorrow at noon. Crews have 67% containment on the 980-acre fire. #AZFire  #AZForestry  #CaveCreek  @MaricopaEmerg  #MaricopaCounty  @CaveCreek_AZ  @mcsoaz", "2020-06-01T19:10:52.000Z": "Thank you, @Supt_Hoffman , for your continued leadership. We're grateful for the collaboration from your office and education leaders around the state as we work to get kids safely back in the classroom this fall. @azedschools Quote Tweet Kathy Hoffman @Supt_Hoffman Today, @azedschools released reopening guidance to help our school communities make critical decisions about the upcoming school year. This guidance is a roadmap that is flexible and adaptable to local needs. Each school may look different based on their community's needs. Show this thread", "2020-06-01T18:31:38.000Z": "Updated @POTUS , @VP and fellow governors on Arizona's partnership with local leaders and law enforcement to keep our communities, businesses and property safe.", "2020-06-01T16:10:33.000Z": "I also want to say a big thanks to all the mayors and police chiefs throughout the state for their cooperation, coordination and leadership. Appreciate their public service during these very difficult and challenging times. Quote Tweet Doug Ducey @dougducey I salute all our law enforcement professionals across the state for their work last night. Lots of preparations, long hours and late nights for these men and women. We saw it statewide. Thank you for your service and vigilance. 1/3 Show this thread", "2020-06-01T16:00:24.000Z": "I know this has required patience from Arizonans. Thank you for following the curfew and allowing law enforcement to do their jobs and protect public safety. 3/3", "2020-06-01T15:59:38.000Z": "We are also very appreciative of the work of our @AZNationalGuard for supporting these efforts. Their strong presence has been a real force multiplier. 2/3", "2020-06-01T15:59:14.000Z": "I salute all our law enforcement professionals across the state for their work last night. Lots of preparations, long hours and late nights for these men and women. We saw it statewide. Thank you for your service and vigilance. 1/3", "2020-06-01T02:16:32.000Z": "This afternoon, I met with faith and community leaders to listen and discuss how Arizona and our country can move forward together. I'm grateful for their time. It was a frank, open and honest conversation, and we need more of them.", "2020-05-31T21:48:01.000Z": "See more details about the declaration of emergency and 8:00 p.m. curfew HERE: Emergency Declaration, Curfew In Place Declaration Also Authorizes An Expanded National Guard MobilizationPHOENIX - Governor Doug Ducey today issued a statewide Declaration of Emergency, including putting in place a curfew starting at... azgovernor.gov", "2020-05-31T20:09:32.000Z": "Today's declaration also authorizes an expanded National Guard mobilization to protect life and property throughout the state. Our office will continue to communicate with local law enforcement to provide whatever resources we can. 3/", "2020-05-31T20:08:45.000Z": "This gives law enforcement an additional tool to prevent the lawlessness we've seen here and in cities nationwide. Police will be equipped to make arrests of individuals who are planning to riot, loot or cause damage and unrest. 2/", "2020-05-31T20:08:10.000Z": "NOTICE:\n\nAt the request of local leaders and in coordination with state and local law enforcement, I'm issuing a statewide Declaration of Emergency, with a curfew in place starting at 8:00 p.m. tonight and effective for one week. 1/", "2020-05-31T20:01:52.000Z": "Been contacting mayors across Arizona today to ensure they have proactive plans to prevent looting and violence in their cities tonight and in days to come. This is why we sought public office. It's time for leadership, vigilance and action.", "2020-05-31T18:07:35.000Z": "This kind of leadership from law enforcement, working with community leaders, will get us through. But we cannot, and will not stand for violence, looting, and criminal activity. 8/8", "2020-05-31T18:06:23.000Z": "In Arizona, we will listen ⁠- and this was demonstrated by the leadership DPS Colonel Heston Silbert displayed on Thursday night as he engaged with protestors at the Capitol. 7/", "2020-05-31T18:05:50.000Z": "The death of George Floyd is tragic and abhorrent. It should be condemned by leaders at all levels ⁠- and we should listen to those who seek to have a civil dialogue on how to ensure it never happens again. 6/", "2020-05-31T18:05:02.000Z": "What we are seeing is happening in cities and states everywhere in America, and Arizona leaders need to be on high alert. They need a plan. Today should be a working day for every local elected leader, city manager, police chief and sheriff in every jurisdiction in the state. 5/", "2020-05-31T18:04:24.000Z": "I'll be speaking w/ mayors around the state to ensure plans are in place to prevent this kind of lawlessness tonight & beyond. The state will provide all resources we can, through DPS, Nat. Guard, & coordination of local law enforcement. Every community needs to be prepared. 4/", "2020-05-31T18:03:48.000Z": "The looting and violence we saw last night, especially in Scottsdale, simply cannot be tolerated. And it won't be. Destruction of property does not qualify as freedom of expression. 3/", "2020-05-31T18:03:19.000Z": "One thing is clear: The more aggressive approach downtown was needed, and it worked. Now, more needs to be done, in more places around the state, to protect law and order and public safety.  2/", "2020-05-31T18:02:50.000Z": "I want to commend our law enforcement officers on their work last night, especially @Arizona_DPS , @PhoenixPolice & all the supporting agencies involved in protecting downtown & major targets, like our freeways. The @AZNationalGuard also played a critical role in this response. 1/", "2020-05-31T02:45:33.000Z": "...AND don't forget our frontline medical workers who continue staffing our hospitals. THANK YOU to ALL these heroes. Arizona is grateful for your public service! (2/2) @azstateforestry  @AZNationalGuard  @PhoenixPolice  @Arizona_DPS  @ArizonaDOT  @Tucson_Police  @ScottsdalePD  @MesaPD", "2020-05-31T02:44:20.000Z": "Arizona's finest are working overtime tonight: Firefighters and first responders fighting the #OcotilloFire . The fine men and women of the @AZNationalGuard , assisting the brave officers of @PhoenixPolice , @Arizona_DPS , @ArizonaDOT and agencies across the state... (1/2)", "2020-05-30T22:49:28.000Z": "Evacuation Center now open at Cactus Shadow High School, 5802 E. Dove Valley Rd., Cave Creek, AZ where American Red Cross representatives will assist evacuees and provide information. @wildlandfireAZ  #aztogether  #redcrossaz", "2020-05-31T00:59:59.000Z": "Latest update from @AZStateForestry on the #OcotilloFire .\n\nWe urge residents to remain alert and follow orders from public safety officials and continue to pray for the safety of everyone in the area. Quote Tweet AZ State Forestry @azstateforestry #OcotilloFire at 750 acres. Crews working against hot temps, very day conditions, wind gusts & low RH. In turn, fire is exhibiting signs of extreme fire behavior. ... @RedCrossAZ  set up a shelter at high school.  ...... @mcsoaz  will have evac info. #AZFire  #AZForestry", "2020-05-30T19:51:49.000Z": "Congratulations @NASA and @SpaceX on a successful launch! A historic day  #LaunchAmerica Quote Tweet NASA @NASA We have liftoff. History is made as @NASA_Astronauts launch from @NASAKennedy for the first time in nine years on the @SpaceX Crew Dragon:", "2020-05-30T17:55:25.000Z": "I've personally reached out this morning to @PhxPDChief Jeri Williams and Tucson Police @ChiefCMagnus to offer the full support of the state and assure them that we've got their backs! 4/4", "2020-05-30T17:54:16.000Z": "It's important that elected leaders at all levels make this very clear. Here, we will enforce the rule of law. @Arizona_DPS Colonel Heston Silbert is coordinating closely with law enforcement leaders across the state to ensure this remains a priority tonight and beyond. 3/", "2020-05-30T17:52:51.000Z": "In Arizona, we will always respect the 1st Amendment rights of citizens to peacefully assemble and make their voices heard. We will not, however, tolerate rioting, looting, violence, destruction of property or any behavior that endangers the safety or rights of others. 2/", "2020-05-30T17:51:42.000Z": "I want to compliment our law enforcement officers on their professional and valiant work the last two nights in protecting public safety and defusing the situations in downtown Phoenix and Tucson. 1/", "2020-05-30T13:00:00.000Z": "Today: #COVID19 testing is available across the state as part of the #AZTestingBlitz . Get info and pre-register here: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing-blitz   @AZDHS AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-29T22:34:00.000Z": "#COVID19AZ  #testingblitz continues this weekend. Registration may be required. Locations available on @AZDHS website. AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-29T21:00:00.000Z": "Tomorrow: The #AZTestingBlitz will help those who want to be tested for #COVID19 , get tested. Find a location and pre-register now: https:// 1.azdhs.gov/36I2sDf . AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-29T22:19:06.000Z": "Arizona is partnering with @uarizona to make #COVID19 antibody tests available, including 250,000 tests for health care workers and first responders!\n\nArizonans interested in getting tested can sign up here: https:// covid19antibodytesting.arizona.edu  @UArizonaPres  @UAZHealth", "2020-05-29T20:00:10.000Z": "Health and safety guidance for places of worship", "2020-05-29T18:17:26.000Z": "The #AZTogether website has information on meals for Arizona seniors, kids and families in need: Arizona Together Resources, information, and community support in our fight against COVID-19. arizonatogether.org", "2020-05-29T15:58:14.000Z": "TOMORROW: #COVID19 testing will be available at sites across the state as part of the #AZTestingBlitz . Get details and pre-register: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing-blitz   @AZDHS AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-29T02:15:59.000Z": "Michael Wiseheart is a dedicated public servant. He brings brains, heart and talent to a very tough job. I worked with him closely on the CARE Team, which stood up DCS. Looking forward to working with him in his new role! Quote Tweet The 9th Floor @9thFloorAZ Governor Ducey today announced the appointment of Michael Wisehart as the Director of the Department of Economic Security. MORE: https:// azgovernor.gov/governor/news/2020/05/governor-ducey-announces-michael-wisehart-director-arizona-department-economic   @ArizonaDES", "2020-05-28T22:03:01.000Z": "Going forward, we'll continue making decisions that are guided by public health and the data. We know this pandemic has asked a lot of all of us, and we're grateful to all Arizonans for their cooperation and responsible behavior as we work to #ReturnStronger . 10/10", "2020-05-28T22:02:14.000Z": ". @ArizonaDES continues to get needed assistance to those out of a job or hurting financially because of #COVID19 . Since April, nearly $1.5 billion has been provided to serve more than 700,000 Arizonans impacted, with more to come. 9/", "2020-05-28T22:01:05.000Z": "Lastly, we're announcing public health guidance for organized youth sports and activities to resume. That full guidance can be found here: https:// azgovernor.gov/sites/default/ files/guidance_for_organized_youth_events.pdf ", "2020-05-28T21:59:11.000Z": "Next, we're planning ahead to get kids and teachers safely back in the classroom for the start of the fall school year. We've worked closely with @Supt_Hoffman , school leaders, teachers, parents and public health experts. More details will be announced next week. 7/", "2020-05-28T21:56:47.000Z": "Second, we're announcing a responsible plan developed by @AZDHS that protects the health of kids in school-based child care, while allowing for increased child care capacity. This plan is a direct result of our meeting with school superintendents this week. 6/", "2020-05-28T21:56:05.000Z": "We're working closely w/ leaders in health care, business, education & more. Today we're taking additional action based on their feedback. The first is a new order increasing collaboration among our hospitals & ensuring patient transfers can take place smoothly & efficiently. 5/", "2020-05-28T21:54:56.000Z": "Yesterday, we announced nearly $600 million that's going to support local governments and nonprofit entities on the frontlines of #COVID19 . These dollars are designed with flexibility and speed in mind - so more resources can get where they're needed faster. 4/", "2020-05-28T21:53:55.000Z": "We also continue to expand testing throughout our prisons, including making available antibody tests for all correctional officers. And @AZNationalGuard continues to coordinate with tribal leaders throughout AZ to supply the necessary PPE, medical supplies, food, water & more. 3/", "2020-05-28T21:52:46.000Z": "With the #AZTestingBlitz in place, testing continues to be a priority. @AZDHS continues to test all residents and staff in our nursing homes and long-term care facilities. We know they are our most vulnerable and they are our top priority. 2/", "2020-05-28T21:51:18.000Z": "Arizona continues to move forward with a calm and steady approach. This includes closely tracking the data, following the guidance of public health officials, and continuing to put health and safety first. 1/", "2020-05-28T21:35:01.000Z": "Additionally, I'm thankful to Tom Betlach and Dr. Cara Christ for stepping in to provide leadership at the Department during a time of great need. Arizona is grateful for their exceptional service. 3/3", "2020-05-28T21:34:38.000Z": "From leading the development and distribution of benefits during #COVID19 to his instrumental role in creating @ArizonaDCS , Michael has the depth of knowledge and vision to lead this crucial agency. I am grateful for his willingness to continue serving Arizonans. 2/", "2020-05-28T21:33:58.000Z": "Today, I'm pleased to announce I have appointed Michael Wisehart to Director of @ArizonaDES . With 20 years of experience at DES, Michael brings unmatched leadership experience, including in the areas of operations, budgeting and direct service. 1/ Quote Tweet The 9th Floor @9thFloorAZ Governor Ducey today announced the appointment of Michael Wisehart as the Director of the Department of Economic Security. MORE: https:// azgovernor.gov/governor/news/2020/05/governor-ducey-announces-michael-wisehart-director-arizona-department-economic   @ArizonaDES", "2020-05-28T21:00:23.000Z": "Today at 2 P.M., I'll be providing updated guidance on our efforts to #ReturnStronger Doug Ducey @dougducey LIVE: Governor Ducey Provides Updates On COVID-19 In Arizona", "2020-05-28T19:00:00.000Z": "As #Arizona retail establishments are resuming operations, we've collected guidance from the @CDCgov , @OSHA_DOL , @AZDHS and industry leaders to help your business safely #ReturnStronger . Access resources here: https:// bit.ly/3fv16jl", "2020-05-28T19:15:32.000Z": ". @FreedomFamily 's Consumer Financial Helpline assists those facing hardship during #COVID19 . The line is available Monday thru Friday, 8 AM - 4 PM, and provides guidance on potential unemployment assistance, small business programs and more. \n\nDetails: https:// helpline.freedomfinancialnetwork.com", "2020-05-28T17:26:59.000Z": "Arizona is grateful to CVS Health for making more drive-through sites available for Arizonans to get tested. https:// azcentral.com/story/news/loc al/arizona-health/2020/04/27/coronavirus-testing-cvs-to-expand-free-covid-19-tests-arizona-nationwide/3036864001/   @CVSHealth CVS adds 15 more drive-thru sites for COVID-19 testing, bringing Arizona locations total to 64 CVS is expanding its COVID-19 testing in Arizona to a total of 64 drive-thru self-swab test sites. azcentral.com", "2020-05-28T16:17:46.000Z": "From @ALEC_states : \n\n\"... Arizona can expect to see additional economic growth and an increasingly vibrant state economy at the expense of its high-tax neighbors.\" MORE  https:// alec.org/app/uploads/20 20/05/TCR-2019-final_pdf.pdf ", "2020-05-28T16:11:10.000Z": "My thanks to @VinceLeach , @RepBenToma and all our legislative partners for working with us to provide tax relief and keep our state strong and competitive. @ALEC_states", "2020-05-28T16:10:39.000Z": "After federal tax reform was passed in 2017, there was a lot of debate about how Arizona would conform to changes. Some states rushed before the full impact was known. Arizona took a more measured and comprehensive approach - and Arizona taxpayers are benefitting. 2/", "2020-05-28T16:09:40.000Z": "NEW REPORT: Arizona is one of six states being recognized for enacting substantial net tax relief for its residents last session, according to a recent @ALEC_states report  https:// alec.org/app/uploads/20 20/05/TCR-2019-final_pdf.pdf ", "2020-05-28T15:44:35.000Z": "Thank you @DougandWolf987 for having me on-air this morning. @AZSports  #ReturnStronger", "2020-05-28T14:14:45.000Z": "We're proud to have supported HB2702 last year which made substantial improvements to both sales and income taxes. Kudos to  Gov @dougducey + Leg leaders @RepBenToma & @VinceLeach Great recognition from @Taxeconomist Quote Tweet American Legislative Exchange Council @ALEC_states ALEC has listed clear principles for sound tax policy. Every year we take a look and see which states were smart, and which weren't.\nCheck out this year's new ALEC report: https:// alec.org/publication/st ate-tax-cut-roundup-2019/  Show this thread", "2020-05-28T13:39:38.000Z": "My thanks to Governor @dougducey for his work to streamline the AZCares funding, so we can put it to use quickly and efficiently in our community. @PeoriaPoliceAZ", "2020-05-28T15:03:51.000Z": "Thank you so much for your time...you are always welcome on @AZMorningNews ! Quote Tweet Doug Ducey @dougducey Thank you @JimSharpe and Jayme West for having me on-air to discuss the latest on #COVID19 and Arizona's efforts to #ReturnStronger . @KTAR923  @NEWS923", "2020-05-28T15:10:31.000Z": "Thank you Gov @dougducey and his staff for providing a path to get these critical resources to #Arizona cities and towns. Outstanding leadership! #CARESAct  #DouglasAZ", "2020-05-28T15:02:39.000Z": "Thank you @JimSharpe and Jayme West for having me on-air to discuss the latest on #COVID19 and Arizona's efforts to #ReturnStronger . @KTAR923  @NEWS923", "2020-05-28T14:50:00.000Z": "I'm joining @DougandWolf987 LIVE at 8:00 AM.\n\nTune in on 98.7 or listen here: https:// arizonasports.com/listen-live/  @AZSports Listen Live - Arizona Sports arizonasports.com", "2020-05-28T14:15:00.000Z": "LIVE at 7:30 AM:\n\nI'm joining @JimSharpe and Jayme West on @KTAR923 . Tune in on 92.3 or listen here: http:// ktar.com/streams/ktarfm .php?ref=reg   @NEWS923 Listen Live. - KTAR.com ssgate.bonnint.com", "2020-05-28T02:42:18.000Z": "Thank you @AZNationalGuard for your continued work to get PPE where it's needed. #ReturnStronger Quote Tweet ArizonaNationalGuard @AZNationalGuard #AZNG used 13 tractor trailers to collect 10 million #PPE masks and nearly 500,000 face shields from California this weekend, which will go to various #AZ counties to be distributed to longterm-care facilities and hospitals. #InThisTogether", "2020-05-28T01:10:23.000Z": "Arizona's cities, towns and counties have been on the frontlines protecting public health and restarting our economy. Here's how these new resources will bolster their efforts. @FOX10Phoenix The following media includes potentially sensitive content. Change settings View", "2020-05-28T00:07:52.000Z": "Thank you, Governor @DougDucey .  CARES Act allocations will help counties protect public health and safety during the COVID19 pandemic. @9thFloorAZ Quote Tweet Doug Ducey @dougducey We've been meeting with local leaders. We've listened. And with their feedback, today we're proud to announce the #AZCares Fund, which will provide over $440 million to cities, towns & counties across Arizona.  \n\nThese dollars will have maximum flexibility w/ minimal red tape. 1/ Show this thread", "2020-05-27T22:30:31.000Z": "This program will be overseen by the Arizona Department of Emergency and Military Affairs - with employees standing by to aid local entities through the reimbursement process. More information on the Express Pay Program and other grant resources: http:// ArizonaTogether.org . 3/3", "2020-05-27T22:28:14.000Z": "We know many nonprofit hospitals, local & tribal governments, schools & more will need FEMA reimbursements for Coronavirus-related costs - which could take months to process.\n \nThat's why we're creating the Arizona Express Pay Program to get federal relief dollars out faster. 2/", "2020-05-27T22:20:46.000Z": "We've been meeting with local leaders. We've listened. And with their feedback, today we're proud to announce the #AZCares Fund, which will provide over $440 million to cities, towns & counties across Arizona.  \n\nThese dollars will have maximum flexibility w/ minimal red tape. 1/", "2020-05-27T21:38:48.000Z": "Gov. @DougDucey announced $441M in direct, flexible funding to cities, towns and counties that did not receive direct #AZCARES funding.\n\nThe Chandler City Council has been strong a advocate for financial support for our community thru this pandemic. More details to come. Quote Tweet Doug Ducey @dougducey Thanks to all our local leaders for their partnership, feedback and dedication to protect public health, restart our economy & ensure Arizona will #ReturnStronger . We look forward to getting #AZCares funding to local communities quickly & efficiently. @MayorCCarlat  @PeoriaAZ 1/ Show this thread", "2020-05-27T21:22:25.000Z": "@Russ_McCloud  @yumacountyaz  @Sahuarita_Az  @CityofMaricopa  @CityofKingman  @GilbertJenn  @GilbertAZMayor  @GilbertYourTown  @KevinHartke  @chandlerazmayor  @GMMOPAZ", "2020-05-27T21:22:02.000Z": "Thanks to all our local leaders for their partnership, feedback and dedication to protect public health, restart our economy & ensure Arizona will #ReturnStronger . We look forward to getting #AZCares funding to local communities quickly & efficiently. @MayorCCarlat  @PeoriaAZ", "2020-05-27T21:15:50.000Z": "Had a productive phone call with fellow governors to discuss potential legislation in Congress, the latest on #COVID19 and updates from other states. #ReturnStronger  @natlgovsassoc", "2020-05-27T17:11:48.000Z": "Appreciate great dialogue with @dougducey , @Supt_Hoffman , Dr. Christ and Mr. Foust to help prepare for a safe reopening of schools.  They truly listened to concerns with safety, financial stability, liability, PPE, technology, transportation, and more.  Great state leadership! Quote Tweet Doug Ducey @dougducey AZ is stronger because of the continued partnership & work w/ public health officials & school leaders to ensure students & teachers can make a safe return to classrooms this fall. Thank you to @Supt_Hoffman & our schools leaders for your continued partnership during #COVID19 . 1/ Show this thread", "2020-05-27T14:36:26.000Z": "REMINDER: @UnitedFoodBank & @CITYOFMESA hold two weekly food distributions at Mesa Convention Center with support from the Mesa CARES Feeding Mesa program. \n\nDrive-thru food distributions are Wednesdays from 2-6 p.m. and Fridays from 7-11 a.m. More at  http:// social.mesaaz.gov/d96", "2020-05-27T17:13:07.000Z": "The #ReturnStronger website includes resources for veterans, adult education, career readiness and more.  @azcommerce Return Stronger The Arizona Commerce Authority (ACA) is the state's leading economic development organization with a streamlined mission to grow and strengthen Arizona's economy. azcommerce.com", "2020-05-27T14:45:06.000Z": "Via @dougducey : \"The #ReturnStronger website is a tool Arizonans can use to get back to work with the support they need. Career pathways Training programs Available certifications\n\nMORE: https:// azcommerce.com/returnstronger/  @azcommerce  @ARIZONAatWORK \" Return Stronger The Arizona Commerce Authority (ACA) is the state's leading economic development organization with a streamlined mission to grow and strengthen Arizona's economy. azcommerce.com", "2020-05-27T00:18:57.000Z": "@TollesonESD  @quintinboyce  @RSDNo66  @FlagstaffUSD1  #ReturnStronger", "2020-05-27T00:18:44.000Z": "@drcarachrist  @ArizonaDCS  @chadgestson  @PhoenixUnion  @AvondaleESD  @Gabriel18839216  @tucsonunified  @CamilleCasteel  @ChandlerUnified  @vailschools  @Florenceusd  @gthompsonyuhsd  @YUHSD  @csd83super  @CartwrightSD  @PaulHStanton  @WESDschools  @SaddleMtUSDSupt  @mpsaz  @LupitaHightower", "2020-05-27T00:18:04.000Z": "AZ is stronger because of the continued partnership & work w/ public health officials & school leaders to ensure students & teachers can make a safe return to classrooms this fall. Thank you to @Supt_Hoffman & our schools leaders for your continued partnership during #COVID19 . 1/", "2020-05-26T22:21:56.000Z": "Thank you @USAmbMex Christopher Landau for taking time today to discuss #COVID19 and continued collaboration between Arizona and Mexico. #ReturnStronger  @gcalmontey  @eliaenith  @AzMxCom", "2020-05-26T22:00:47.000Z": "Great news! Governor @dougducey announced a significant investment from the AZ Coronavirus Relief Fund, allocated to organizations that provide out-of-school child care in the state! Read more: http:// ow.ly/KdIC50zQMHi  @AZDHS  @StateOfArizona  #azstrong  #greatfutures  #arizona", "2020-05-26T22:00:00.000Z": "Great reminder from @AZDHS as #Arizona starts heating up for summer. Quote Tweet AZ Dept of Health @AZDHS Feeling thirsty is a sign of dehydration! Drink water before thirst to stay hydrated this summer. Remember not to  share personal items, such as your water bottle, as it can spread germs to others. https:// 1.azdhs.gov/2A3jm2O  #azheat  #azwx", "2020-05-26T18:55:48.000Z": "I look forward to continuing to work together in this spirit to address Arizona's economic and budgetary needs, while protecting public health and all of our state's citizens. 3/3", "2020-05-26T18:55:12.000Z": "But Arizona once again demonstrated what's possible when we put partisan differences & personal agendas aside. Republicans and Democrats were able to join together in March to approve a budget & provide emergency dollars to properly manage the public health needs of our state. 2/", "2020-05-26T18:54:40.000Z": "I thank the Legislature for coming together this session in the face of a global pandemic and major economic challenges. When the session began in January, none of us could have anticipated what was ahead. 1/", "2020-05-26T18:40:07.000Z": "Arizona is grateful to the Administration for its continued support & guidance. Just spoke to @VP and the Coronavirus Task Force about Arizona's work to meet with cities, towns & counties to discuss their needs & how the CARES Act funding could best support them. #ReturnStronger", "2020-05-26T17:34:58.000Z": "The #ReturnStronger website is a tool Arizonans can use to get back to work with the support they need. Career pathways Training programs Available certifications\n\nMORE: https:// azcommerce.com/returnstronger/  @azcommerce  @ARIZONAatWORK Return Stronger The Arizona Commerce Authority (ACA) is the state's leading economic development organization with a streamlined mission to grow and strengthen Arizona's economy. azcommerce.com", "2020-05-26T16:00:55.000Z": "#AZTestingBlitz   #COVID19 testing will be available at more than 40 sites across Arizona this Saturday, May 30!\n\nGet details and pre-register here: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing-blitz   @AZDHS AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-25T18:00:00.000Z": "May we honor their sacrifices by fiercely guarding the liberties for which they gave their lives. #MemorialDay", "2020-05-25T16:00:01.000Z": "President @RonaldReagan . Arlington National Cemetery. #MemorialDay", "2020-05-25T14:00:00.000Z": "Arizona remembers the women and men in uniform who sacrificed everything to defend the freedoms we hold dear. #MemorialDay", "2020-05-25T12:00:01.000Z": "More than one million Americans have laid down their lives to make and keep America free. To the fallen and all who mourn them, we are eternally grateful. Thank you #MemorialDay", "2020-05-24T23:29:40.000Z": "Businesses across Arizona are following @CDCgov guidance to protect the health and safety of customers and employees. Don't forget to #SupportLocalAZ as we breathe life back into our economy and #ReturnStronger .", "2020-05-23T14:01:36.000Z": "Did you know? Now you do. Hitting the highway this Memorial Day Weekend? Secure those tow chains & never pull off the roadway into tall brush! One spark is all it takes @ArizonaDOT  #AZFire  #AZForestry", "2020-05-22T20:14:34.000Z": "As we head into #MemorialDay weekend, see continued @CDCgov health and safety guidance for individuals and businesses:", "2020-05-22T18:57:25.000Z": "Unlike other states, AZ has protected places of worship from closure throughout #COVID19 . They are Constitutionally protected under the 1st Amendment. Many chose to close on their own, and many are opening back up. For full guidance on reopening, see here: https:// azgovernor.gov/sites/default/ files/guidance_for_places_of_worship.pdf  Quote Tweet The Associated Press @AP BREAKING: President Trump says he considers houses of worship 'essential,' calls on governors to allow them to reopen this weekend. http:// apne.ws/I7VaJJu", "2020-05-22T18:20:53.000Z": "Arizona is proud to be home to @LucidMotors !  https:// bloomberg.com/news/articles/ 2020-05-22/electric-cars-are-about-to-start-rolling-out-of-the-arizona-desert   @business Electric Cars Are About to Start Rolling Out of the Arizona Desert Lucid Motors expects to start car production by year-end. bloomberg.com", "2020-05-22T17:35:55.000Z": "Summer means a heightened threat of wildfires. There are commonsense precautions we can take to minimize risk  @azstateforestry", "2020-05-22T16:45:00.000Z": "Arizona restaurants like @origchopshop are implementing enhanced health and safety precautions to keep customers and employees safe. #ReturnStronger", "2020-05-22T16:09:54.000Z": "TOMORROW: \n\nThe #AZTestingBlitz continues tomorrow at sites across the state. \n\nArizonans who think they have been exposed to #COVID19 can pre-register to get tested here: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing-blitz   @AZDHS AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-22T00:43:19.000Z": "With new physical distancing & sanitation measures in place, patrons are returning to AZ restaurants safely & at one of the fastest rates in the nation. I'm grateful to AZ's restaurant owners & staff for prioritizing public health as we #ReturnStronger . State of the Industry | OpenTable See the impact of coronavirus on the restaurant industry. Data updated daily by country, state, and city. Find ways to support restaurants. opentable.com", "2020-05-21T22:10:06.000Z": "The #ReturnStronger website helps Arizonans get back to work and provides guidance on: Career pathways Training programs Available certifications\n\nMORE  https:// azcommerce.com/returnstronger/  @azcommerce  @ARIZONAatWORK Return Stronger The Arizona Commerce Authority (ACA) is the state's leading economic development organization with a streamlined mission to grow and strengthen Arizona's economy. azcommerce.com", "2020-05-21T20:26:31.000Z": "#AZTestingBlitz  #COVID19 testing will be available at sites across the state this Saturday, May 23 and next Saturday, May 30.\n\nGet details and pre-register here: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing-blitz   @AZDHS AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-21T20:08:32.000Z": "Thank you Governor @dougducey for meeting with #AZCounties from across the state we are grateful for your partnership. Quote Tweet Doug Ducey @dougducey I'm grateful to to meet with mayors and local leaders again this week to discuss CARES Act funding and ways the state and local governments can continue to partner to #ReturnStronger . @PeoriaAZ  @raymalnar  @ClintLHickman  @maricopacounty  @MayorJimLane  @scottsdaleazgov  @Russ_McCloud Show this thread", "2020-05-21T19:54:06.000Z": "Thanks to this $250,000 relief grant for our rental assistance program, we can prevent further homelessness in our community. Thank you Governor @DougDucey for supporting our community and families economically impacted by COVID-19. Governor Ducey Announces $300,000 For Arizonans In Need PHOENIX - Governor Doug Ducey today announced $300,000 in grant funding to organizations providing Arizonans in need with rental assistance, telehealth and transportation to health services. The... azgovernor.gov", "2020-05-21T19:29:19.000Z": "@yumacountyaz  @Sahuarita_Az  @CityofMaricopa  @GlendaleAZ  @SierraVistaAZ  @AltonJoeShephe1  @CityofKingman  @MayorCCarlat", "2020-05-21T19:29:00.000Z": "I'm grateful to to meet with mayors and local leaders again this week to discuss CARES Act funding and ways the state and local governments can continue to partner to #ReturnStronger . @PeoriaAZ  @raymalnar  @ClintLHickman  @maricopacounty  @MayorJimLane  @scottsdaleazgov  @Russ_McCloud", "2020-05-21T19:23:03.000Z": "Western Alliance Bank donated $150,000 to the AZ Coronavirus Relief Fund. This generous donation will support our medical professionals and those in need - and will help Arizona #ReturnStronger . Thank you, Western Alliance Bank! #AZTogether", "2020-05-21T17:54:36.000Z": "AZ hasn't stopped there. Since then we've seen 20% teacher raises w/ the #20x2020 plan, the extension of #Prop301 , a restoration of additional assistance dollars & hundreds of millions more for targeted priorities that support school improvements & better student outcomes. 2/2", "2020-05-21T17:53:40.000Z": "Four years ago, AZ voters passed #Prop123 , a historic funding measure that ended a years-long lawsuit & era of education cuts while injecting $3.5 billion into our public schools - without raising taxes. These dollars made an immediate difference & continue to be important. 1/", "2020-05-21T15:55:15.000Z": "We're grateful to the men and women of the @GlendaleAZPD and all the law enforcement and first responders who rushed to the scene last night. Their fast response no doubt saved lives. Arizona continues to offer our full support. Quote Tweet Glendale Police @GlendaleAZPD Still out on scene gathering evidence and working through the investigation Show this thread", "2020-05-21T04:26:57.000Z": "Our hearts and prayers are with the individuals and families impacted tonight, as well as the first responders and police officers who are on the scene. The state is here to continue to offer its full support to the victims and to the community. Quote Tweet Doug Ducey @dougducey We are monitoring this closely. @Arizona_DPS has been in contact with @GlendaleAZPD throughout the situation and the state stands ready to support. twitter.com/SeanOnTV/statu", "2020-05-21T03:17:14.000Z": "We are monitoring this closely. @Arizona_DPS has been in contact with @GlendaleAZPD throughout the situation and the state stands ready to support. Quote Tweet Sean McLaughlin 3TV/CBS5 @SeanOnTV #UPDATE shooting at @Westgate_AZ one suspect in custody- @GlendaleAZPD say no longer an active shooting situation-area now closed to public. twitter.com/SenQuezada29/s", "2020-05-20T22:22:11.000Z": ". @drcarachrist , the director of @AZDHS says the department will partner with @uarizona to get antibody testing for all correctional officers in our state prisons. @KVOA", "2020-05-20T22:34:15.000Z": "Arizona is making progress, and we must remain focused on public health. That's our number one priority. We'll continue to follow the guidance of @CDCgov and @AZDHS . Thank you to all Arizonans for your continued partnership as we work to stay healthy and #ReturnStronger . 10/10", "2020-05-20T22:33:35.000Z": "We have a continued urgency to ensure Arizonans needing support have access to the social safety net. Since April, over $770 million in unemployment benefits have been paid, in addition to over $355M in pandemic unemployment assistance. This will continue to be a priority. 9/", "2020-05-20T22:32:28.000Z": "Led by the @AZNationalGuard , Arizona continues to send support and resources to the #NavajoNation . This includes dedicated air support for emergency evacuations; standing up alternate care sites; medical personnel support; and coordinating food, water and supply donations. 8/", "2020-05-20T22:31:59.000Z": "And we're expanding testing within our prisons for inmates and correctional officers, including partnering with @uarizona to provide antibody testing to all correctional officers. 7/", "2020-05-20T22:30:35.000Z": "We remain laser-focused on protecting those most at-risk, including our seniors. We've begun testing all residents and staff in long-term care and skilled-nursing facilities, while taking steps to ensure infection control assistance is in place and guidance is being followed. 6/", "2020-05-20T22:29:58.000Z": "And our hospitals continue to have capacity. We're not taking any chances and will continue to make sure Arizona is prepared and that those who need health care can access it. 5/", "2020-05-20T22:29:19.000Z": "Both diagnostic and antibody testing has steadily ramped up over recent weeks thanks to efforts like the #AZTestingBlitz , which is being extended. Arizonans who think they have been exposed to #COVID19 can pre-register to get tested here: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing-blitz ", "2020-05-20T22:28:30.000Z": "Positive #COVID19 tests as a percentage of all tests continues its downward trajectory: 3/", "2020-05-20T22:27:16.000Z": "Arizona continues to meet the gating requirements put forward by @CDCgov to guide states during reopening, and we remain solidly in PHASE 1: Reported cases of COVID and influenza-like symptomatic cases continue to decline: 2/", "2020-05-20T22:26:23.000Z": "We've seen encouraging signs over the past week. As our economy gradually reopens, businesses are implementing the public health guidance. People are acting responsibly. And Arizona continues to trend in the right direction. #ReturnStronger", "2020-05-20T22:02:10.000Z": "WATCH: I'm joining @AZDHS Director @DrCaraChrist and Major General McGuire to share #COVID19 updates. #ReturnStronger Doug Ducey @dougducey LIVE: Governor Ducey Provides Updates On COVID-19 In Arizona", "2020-05-20T21:23:07.000Z": "Arizona is proud to support @SVdP and @OpenHeartsAZ in their work to help Arizonans with rental assistance, telehealth and transportation to health services during #COVID19 . MORE: https:// azgovernor.gov/governor/news/2020/05/governor-ducey-announces-300000-arizonans-need   #ReturnStronger Governor Ducey Announces $300,000 For Arizonans In Need PHOENIX - Governor Doug Ducey today announced $300,000 in grant funding to organizations providing Arizonans in need with rental assistance, telehealth and transportation to health services. The... azgovernor.gov", "2020-05-20T20:07:19.000Z": "CONGRATULATIONS Class of 2020  #AZClassof2020", "2020-05-20T19:41:35.000Z": "Spoke with governors and CEOs from across the country about best practices for reopening in a way that is safe and follows public health guidance. @NatlGovsAssoc  #ReturnStronger", "2020-05-20T19:34:49.000Z": "Many organizations across Arizona have stepped up to offer child care to kids of essential workers and families in need. These dollars will help these programs continue into summer - ensuring kids have safe and secure options to learn and engage with others. Quote Tweet The 9th Floor @9thFloorAZ NEW: Organizations that provide out-of-school child care will receive $500,000 from the AZ Coronavirus Relief Fund. These dollars will be used to support extended hours, help keep students on track academically and more. https:// azgovernor.gov/governor/news/2020/05/governor-ducey-announces-500000-further-expand-child-care   @ClubzonaBGC  @BGCT  @bgcarizona Show this thread", "2020-05-20T18:04:43.000Z": "The #ReturnStronger site will help Arizonans get back to work with the tools and support they need. Enhance existing skills Access learning opportunities\n\nMORE: https:// azcommerce.com/returnstronger/  @azcommerce  @ARIZONAatWORK Return Stronger The Arizona Commerce Authority (ACA) is the state's leading economic development organization with a streamlined mission to grow and strengthen Arizona's economy. azcommerce.com", "2020-05-20T17:08:14.000Z": "To all Class of 2020 graduates -\n\nArizona is proud of your success and we wish you the very best in your next endeavor! #AZClassof2020", "2020-05-20T15:27:15.000Z": "Happy birthday, @CindyMcCain ! Thank you for all you do for Arizona!", "2020-05-19T21:30:10.000Z": "@AZDHS has extended the COVID-19 testing blitz. Find a location near you at the link below and get tested on May 23 or May 30. Some community health centers (CHC) are participating and you may need to pre-register to get tested. #ValueCHCs AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-19T23:00:46.000Z": "#News : Arizona has been awarded an additional $150 million from @CDCgov to help with the #COVID19 outbreak response. https://", "2020-05-19T22:46:55.000Z": "Thank you Governor @dougducey for your leadership and for including us in a critical discussion on reenergizing the economy and supporting relief efforts. #ReturnStronger  #YumaStrong Quote Tweet Doug Ducey @dougducey Arizona mayors and county supervisors have worked to protect public health and keep our economy going during #COVID19 . Thank you to all the local leaders who provided their insights today on reenergizing our economy and supporting relief efforts. #ReturnStronger Show this thread", "2020-05-19T22:42:00.000Z": "@GilbertJenn  @GilbertAZMayor  @GilbertYourTown  @GMMOPAZ  @PresTweets  @MayorNicholls  @cityofyuma  @townofmarana  @SanLuisAZGov  @chandlerazmayor  @KevinHartke  @cityofchandler  @mohavecounty", "2020-05-19T22:41:43.000Z": "Arizona mayors and county supervisors have worked to protect public health and keep our economy going during #COVID19 . Thank you to all the local leaders who provided their insights today on reenergizing our economy and supporting relief efforts. #ReturnStronger", "2020-05-19T21:52:52.000Z": "This is great news for Arizona farms and dairies - which are crucial to our food supply, export market and agricultural sector. Thank you, @SecretarySonny ! @USDA  #ReturnStronger Quote Tweet Dept. of Agriculture @USDA The Coronavirus Food Assistance Program (CFAP) will provide up to $16 billion in direct payments to deliver relief to America's farmers & ranchers impacted by the coronavirus pandemic. Applications will be accepted through @usdafsa beginning May 26 - https:// go.usa.gov/xvJTa", "2020-05-19T21:08:58.000Z": "The new podcast is up, with special guest AZ Gov. @dougducey talking about re-opening and recovery. Arizona Gov. Doug Ducey: Reopening and Recovery - Ricochet Since February, Arizona Gov. Doug Ducey has focused on the COVID-19 pandemic. This month, he methodically began re-opening the state's economy. Jon asks him about what the near-term future holds, his... ricochet.com", "2020-05-19T20:43:52.000Z": "This is a great opportunity to #ReturnStronger ! Quote Tweet Arizona Commerce Authority @azcommerce Under the leadership of Governor @DougDucey , we've launched the Return Stronger Upskilling website in partnership with @ARIZONAatWORK . Workers can virtually connect with a career counselor and explore training opportunities to #ReturnStronger . https:// bit.ly/ReturnStronger", "2020-05-19T20:03:05.000Z": "Under the leadership of Governor @DougDucey , we've launched the Return Stronger Upskilling website in partnership with @ARIZONAatWORK . Workers can virtually connect with a career counselor and explore training opportunities to #ReturnStronger . https:// bit.ly/ReturnStronger", "2020-05-19T20:11:07.000Z": "Arizona is continuing to focus on protecting public health as we gradually reenergize our economy. #ReturnStronger See continued @CDCgov guidance for individuals and businesses:", "2020-05-19T19:31:51.000Z": "Arizona is grateful to all military personnel and their families for their strength and bravery, and for the sacrifices they make every day to protect our nation. #MilitaryAppreciationMonth", "2020-05-19T18:31:17.000Z": "AZ Enrichment Centers offer prioritized child care for first responders & grocery store, food bank, health care & essential public sector workers. Prioritized care & scholarships will be available to eligible families through at least end of July. MORE: http:// arizonaenrichmentcenters.az.gov", "2020-05-19T17:40:19.000Z": "The women and men of Emergency Medical Services are on frontlines protecting the health, safety and well-being of our communities. Arizona is grateful for all you do to serve others. #EMSWeek", "2020-05-19T17:01:04.000Z": "The #AZTestingBlitz will be up and running at sites across the state this Saturday, May 23 and next Saturday, May 30 Get details and pre-register here: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing-blitz   @AZDHS  #COVID19 AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-19T16:31:15.000Z": "We are also grateful to the Ben & Catherine Ivy Foundation for its $5 million donation to the AZ Coronavirus Relief Fund to fund the purchase of PPE. Thank you, @IvyFoundation , for your work to support fellow Arizonans and those working on the frontlines. #ReturnStronger", "2020-05-19T16:30:38.000Z": "#TheArizonaWay Throughout #COVID19 , researchers at the Ivy Brain Tumor Center have continued to serve patients & further their mission. Brain tumors don't stop for anything, & Arizona is grateful for @IvyBrainTumCtr 's dedication to supporting patients. #BrainTumorTough  #BTAM", "2020-05-19T13:31:50.000Z": "Tuesday AM UPDATE- Very minimal activity overnight. #EastDesertFire holding at 1,492 acres & 50% contained. Today's winds will be problematic again w/gusts up to 30 mph. Crews continue to provide structure protection for nearby homes. Evacs still in place. #AZFire  #AZForestry", "2020-05-18T15:47:07.000Z": "Reminder: ADOR has moved the deadline for filing and paying state income taxes from April 15 to July 15, 2020 following direction by Governor Doug Ducey. http:// bit.ly/39D2e00", "2020-05-19T00:12:02.000Z": "@MariaDadgar  @DiscoverSR  @CocopahTribe  @stephenroelewis  @GRIC_Official  @sc_apache  @TheHopiTribe  @AZNationalGuard", "2020-05-19T00:11:52.000Z": "Arizona will continue to work with our tribal communities to get them the aid & support they need during #COVID19 . My thanks to our tribal partners who joined the call today to discuss continued efforts to keep our communities safe and healthy. @8bburnette  @CRTribes  @NNPrezNez", "2020-05-18T22:10:59.000Z": "Grateful for the support of @POTUS  @realDonaldTrump , @FLOTUS & @VP in responding to #COVID19 , including First Lady Melania Trump's priority of mental health & safety of children. We also discussed responsibly reopening, and @TWSemicon 's selection of #AZ for its new plant.", "2020-05-18T17:36:35.000Z": "Ability360 would like to thank the AZ Coronavirus Relief Fund for the generous donation to support our youth members during this time. We are grateful and honored. #AZTogether  #TheArizonaWay  #ReturnStronger", "2020-05-15T15:13:22.000Z": "A HUGE thank you to Arizona's leadership for awarding us with this vital funding to support our continued efforts to deliver services to our clients! We're extremely grateful for the outpouring of generosity we've received from our  community, even in the most unique times Quote Tweet Doug Ducey @dougducey ANNOUNCEMENT: \n\nOrganizations supporting kids with special needs will receive $100,000 from the AZ Coronavirus Relief Fund. This funding will help these organizations continue to meet the needs of Arizona kids during #COVID19 . https:// azgovernor.gov/governor/news/2020/05/new-governor-announces-100000-organizations-supporting-kids-special-needs   @ability360  @SWAutismCenter", "2020-05-18T19:59:39.000Z": "NEW: SRP has donated $100,000 to the AZ Coronavirus Relief Fund!\n\nThis generous contribution will support those in need and help Arizona #returnstronger from #COVID19 . Thank you, @SRPConnect ! #AZTogether", "2020-05-18T19:24:22.000Z": "ANNOUNCEMENT: Organizations supporting Arizona's kids in out-of-home care will receive $100,000 from the AZ Coronavirus Relief Fund. These dollars will be used for supplies, educational needs and more. https:// azgovernor.gov/governor/news/2020/05/governor-ducey-announces-100000-support-children-out-home-care   @AFFCF  @boostafosterfam Governor Ducey Announces $100,000 To Support Children In Out-Of-Home Care PHOENIX - Governor Doug Ducey announced today $100,000 in funding from the AZ Coronavirus Relief Fund has been allocated to organizations that support foster families. The funding will be used to... azgovernor.gov", "2020-05-18T18:23:29.000Z": "UPDATE:\n\nThe #AZTestingBlitz has been extended an additional two weeks! https:// azdhs.gov/director/publi c-information-office/index.php#news-release-051520   #COVID19  @AZDHS AZDHS | Public Information Office ADHS is committed to providing the public and the media with health information in a timely, accurate and helpful manner. azdhs.gov", "2020-05-18T16:19:47.000Z": "These crews have been working around the clock. We're grateful to all firefighters working hard to protect people and property. #EastDesertFire Quote Tweet AZ State Forestry @azstateforestry Morning briefing on #EastDesertFire . Additional resources ordered including 6 shot crews, 10 engines, & aircraft. ... @TontoForest  ... @BLMAZFire  ... @PeoriaFire  ... @DaisyMtnFire  ... @PHXFire  & #RuralMetro  #CaveCreek  #NorthPhoenix", "2020-05-18T16:10:55.000Z": ". @uarizona is expanding #COVID19 antibody testing to all health care and first responders in Arizona! Those interested in receiving testing can sign up here: https:// covid19antibodytesting.arizona.edu  @UArizonaPres  @UAZHealth", "2020-05-15T23:06:12.000Z": "#UPDATE : The Arizona Testing Blitz has been extended an additional two weeks! See how you can get tested for #COVID19 . https:// 1.azdhs.gov/2z0Xipy  #AZTestingBlitz", "2020-05-17T20:13:03.000Z": "Arizona is partnering with @uarizona to expand antibody testing to all health care workers and first responders in the state. Thank you @UArizonaPres and @UAZHealth for your continued support of those working to combat #COVID19 . https:// azcentral.com/story/news/loc al/arizona/2020/05/15/university-arizona-expands-antibody-testing-healthcare-workers-and-first-responders-covid-19/5204234002/   @azcentral UA expands antibody testing to health care workers and first responders for COVID-19 The University of Arizona announced on Friday that it will expand the availability of antibody tests to health care workers and first responders who potentially contracted COVID-19 at one point. azcentral.com", "2020-05-16T15:00:01.000Z": "Today and every day, Arizona is grateful to the women and men in uniform-and their families-who have sacrificed so much to protect our freedom. #ArmedForcesDay  @USNavy  @USArmy  @USMC  @usairforce  @USCG", "2020-05-15T21:56:56.000Z": "Congratulations to all the @uarizona graduates! #BearDownLife Quote Tweet Univ. of Arizona @uarizona Congratulations to the Class of 2020! Please join us in celebrating this evening at our 156th Annual Commencement Ceremony. Streaming Live tonight at 6pm MST/PDT. http:// Commencement.arizona.edu", "2020-05-15T21:23:12.000Z": "Pre-register for the #AZTestingBlitz ! #COVID19 testing will be available TOMORROW at more than 60 sites across the state. \n\nDetails: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing-blitz   @AZDHS AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-15T21:04:22.000Z": "For more guidance from @AZDHS , visit http:// azgovernor.gov/guidance 4/4 Reopening Guidance Guidance from the Arizona Department of Health Services, tips to do your part and other resources. azgovernor.gov", "2020-05-15T21:03:42.000Z": ". @CDCgov guidance for individuals", "2020-05-15T21:02:53.000Z": ". @CDCgov guidance for employers", "2020-05-15T21:01:59.000Z": "As we gradually breathe life back into our economy, it's important that Arizonans continue to act responsibly and make smart decisions. Arizona is following @CDCgov guidance to ensure we protect public health as we #ReturnStronger . 1/", "2020-05-15T19:31:28.000Z": "NEW: Organizations supporting AZ's seniors, homebound and medically fragile will receive $300,000 from the AZ Coronavirus Relief Fund! This funding will help these organizations continue to protect those most at risk. https:// azgovernor.gov/governor/news/2020/05/governor-ducey-announces-300000-support-seniors-individuals-medical-needs   @FSLcares  @BenevillaAZ  @AsterArizona Governor Ducey Announces $300,000 To Support Seniors, Individuals With Medical Needs PHOENIX - Governor Doug Ducey announced today $300,000 in funding from the AZ Coronavirus Relief Fund has been allocated to organizations across the state that support senior citizens, the homebound... azgovernor.gov", "2020-05-15T18:01:06.000Z": "Today is about the peace officers who gave their all to carry out their duties. Their sacrifices will never be forgotten. #PeaceOfficersMemorialDay", "2020-05-15T16:23:57.000Z": "TOMORROW: \n\nThe #AZTestingBlitz continues at more than 60 sites across Arizona.\n\nAccess details, pre-register and get tested: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing-blitz   #COVID19  @AZDHS AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-15T15:42:38.000Z": "\"The facility will use TSMC's 5-nanometer technology for semiconductor wafer fabrication and have the capacity to produce 20,000 wafers per month.\" https:// azcentral.com/story/money/bu siness/tech/2020/05/14/reports-taiwan-chipmaker-plans-build-major-plant-arizona/5195660002/   @azcentral  @TWSemicon  @azcommerce Taiwan chipmaker plans to build $12 billion plant in Phoenix, create more than 1,600 jobs A Taiwan-based maker of silicon chips intends to build a major manufacturing plant in Phoenix that could bring more than 1,600 jobs, Gov. Doug Ducey confirmed late Thursday. azcentral.com", "2020-05-15T03:58:50.000Z": "The U.S. welcomes TSMC's intention to invest $12B in the most advanced 5-nanometer semiconductor fabrication foundry in the world. This deal bolsters U.S. national security at a time when China is trying to dominate cutting-edge tech and control critical industries.", "2020-05-15T15:14:03.000Z": "Tomorrow is the last day for @AZDHS 's drive-thru COVID-19 diagnostic testing blitz. #GilbertAZ testing location  Saturday, May 16th 10 AM - 1 PM 965 E Germann Rd Pre-registration required: 844-549-1851\n\nMore locations: http:// azdhs.gov/testingblitz", "2020-05-15T12:04:17.000Z": "Arizona is forever grateful to our fallen officers and their families. Their sacrifices will never be forgotten. #PeaceOfficersMemorialDay", "2020-05-15T02:21:00.000Z": ". @SecretaryRoss praised today's announcement by Taiwan Semiconductor Manufacturing Company of plans to invest approximately $12 billion to construct a new 5-nanometer semiconductor production facility in Arizona. https:// commerce.gov/news/press-rel eases/2020/05/us-secretary-commerce-wilbur-ross-praises-plans-taiwan-semiconductor ", "2020-05-15T02:33:40.000Z": "This plan is the result of years of close collaboration among TSMC, Governor @dougducey of AZ and his staff, and the Administration, particularly our Assistant Secretary of Commerce Ian Steff. → https:// commerce.gov/news/press-rel eases/2020/05/us-secretary-commerce-wilbur-ross-praises-plans-taiwan-semiconductor ", "2020-05-15T02:25:33.000Z": "MORE: TSMC To Build Advanced Semiconductor Factory In Arizona PHOENIX - Governor Doug Ducey today announced that following a national search, Taiwan Semiconductor Manufacturing Company (TSMC) has selected Arizona for its new U.S. advanced semiconductor factory.... azgovernor.gov", "2020-05-15T02:24:26.000Z": "With our unbeatable business climate, already thriving tech sector and ready access to an international supply chain, AZ has long been a hub for advanced manufacturing & semiconductor industries. This project will further cement Arizona's global leadership in tech manufacturing!", "2020-05-15T02:23:51.000Z": "HUGE NEWS FOR AZ The world's largest semiconductor manufacturer chose ARIZONA to build its new $12 BILLION advanced manufacturing factory. This is a project with global significance. Thank you @TWSemicon  @realDonaldTrump  @CommerceGov  @SecretaryRoss  @SelectUSA and @azcommerce !", "2020-05-14T23:00:01.000Z": "As part of the #AZTestingBlitz , testing will be available to anyone who thinks they have been exposed to and could be infected with #COVID19 . Testing criteria is set by each testing site. https://", "2020-05-14T22:47:56.000Z": "Arizona will continue to follow public health guidance and work with businesses across the state as we reopen our economy. Thank you to @drcarachrist , @SandraWatsonAZ , @DebJohnsonAz and all the business leaders who joined the call today. #ReturnStronger", "2020-05-14T21:00:55.000Z": "Thank you @AZNationalGuard for your continued support to the Navajo Nation. #AZTogether Quote Tweet ArizonaNationalGuard @AZNationalGuard An #AZNG medical response team flew to Navajo Nation yesterday to set up a drive-thru #COVID19 testing site where they administered dozens of tests for staff in the fight against the pandemic. #InThisTogether  #WeGotThisAZ", "2020-05-14T20:31:15.000Z": "Great meeting with the Governor and other friends for lunch. Thank you also to @pitajungle for the delicious meal. Quote Tweet Doug Ducey @dougducey Great lunch with some good friends! Thank you @pitajungle for implementing health precautions to keep customers and staff safe - and thank you for the excellent service!  #ReturnStronger  @KateMcGeeAZ  @AZRobertMeza  @TJShopeforAZ  @JeffWeninger", "2020-05-14T20:01:00.000Z": "Gov. @dougducey joined Arizona legislators for lunch today at @pitajungle  Quote Tweet Doug Ducey @dougducey Great lunch with some good friends! Thank you @pitajungle for implementing health precautions to keep customers and staff safe - and thank you for the excellent service!  #ReturnStronger  @KateMcGeeAZ  @AZRobertMeza  @TJShopeforAZ  @JeffWeninger", "2020-05-14T19:53:28.000Z": "Great lunch with some good friends! Thank you @pitajungle for implementing health precautions to keep customers and staff safe - and thank you for the excellent service!  #ReturnStronger  @KateMcGeeAZ  @AZRobertMeza  @TJShopeforAZ  @JeffWeninger", "2020-05-14T19:06:04.000Z": "ANNOUNCEMENT: \n\nOrganizations supporting kids with special needs will receive $100,000 from the AZ Coronavirus Relief Fund. This funding will help these organizations continue to meet the needs of Arizona kids during #COVID19 . https:// azgovernor.gov/governor/news/2020/05/new-governor-announces-100000-organizations-supporting-kids-special-needs   @ability360  @SWAutismCenter NEW: Governor Announces $100,000 For Organizations Supporting Kids With Special Needs PHOENIX - Governor Doug Ducey announced today a $100,000 grant from the AZ Coronavirus Relief Fund to programs across the state supporting Arizona kids with special needs who have been impacted by... azgovernor.gov", "2020-05-14T18:36:52.000Z": "Thank you to all our partners across the state working to expand testing to more Arizonans. \n\nIf you think you've been exposed to #COVID19 , sign up to get tested this Saturday: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing-blitz   #AZTestingBlitz", "2020-05-14T17:49:04.000Z": "Spoke with Sonora Governor Claudia Pavlovich to discuss the strong Arizona-Sonora partnership and how to continue bringing businesses to our region through new opportunities. #returnstronger  @ClaudiaPavlovic  @AzMxCom", "2020-05-14T17:47:15.000Z": "Welcome to Arizona, @zoom_us ! Quote Tweet Sandra Watson @SandraWatsonAZ Arizona's talent, business climate and quality of life continue to attract industry-leading tech companies. Excited to welcome @zoom_us to our state! #techjobs  #econdev  https:// reuters.com/article/us-zoo m-video-commn-tech/zoom-to-expand-in-us-with-engineering-centers-in-phoenix-pittsburgh-idUSKBN22Q21O ", "2020-05-14T17:10:41.000Z": "Arizona Enrichment Centers will continue to offer prioritized care and scholarships to eligible families through the end of July. #COVID19", "2020-05-14T17:10:16.000Z": "NEW: While grocery store and food bank employees work to serve others, we want to make sure they have access to safe and secure child care. Arizona Enrichment Centers are expanding to offer prioritized child care for these hardworking Arizonans. MORE: https:// arizonaenrichmentcenters.az.gov", "2020-05-14T15:55:01.000Z": "The #AZTestingBlitz continues this Saturday, May 16 at more than 60 sites across the state.\n\nBoth drive-thru and onsite testing will be available. Get details and pre-register here: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing-blitz   @AZDHS AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-13T22:30:08.000Z": "FREE #COVID19 testing this Saturday, May 16. Testing will take place at various locations across the state. Register at http:// ow.ly/f1Sl50zFueX . #COVID29Testing  #TestingBlitz AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-13T21:29:44.000Z": "The AZ Coronavirus Relief Fund committee is very proud to help prevent hunger and provide nutrition assistance by supporting food banks in all 15 Arizona counties through @foodbanksaz ! Grateful for the donations that made this grant possible. #TheArizonaWay  #AZTogether Quote Tweet Doug Ducey @dougducey NEW: AZ food banks will receive $500K from the AZ Coronavirus Relief Fund.\n\nThis will help food pantries in all 15 counties make more food deliveries & implement protocols to enhance physical distancing like drive-thru pick-ups. https:// azgovernor.gov/governor/news/2020/05/governor-ducey-announces-500000-food-banks-fight-hunger   #AZTogether  @foodbanksaz", "2020-05-13T22:31:58.000Z": "This is wonderful news! Quote Tweet Michelle Pabis @mcpabis Great news for Arizona food banks & communities, ... @dougducey  ! ... @HonorHealth  Desert Mission Food Bank has continued to serve hundreds of families and seniors during this unprecedented time like they have since 1927. #foodismedicine   https:// azgovernor.gov/governor/news/2020/05/governor-ducey-announces-500000-food-banks-fight-hunger ", "2020-05-13T22:14:52.000Z": "The #AZTestingBlitz continues this Saturday, May 16. Testing is available at sites across the state. \n\nArizonans can get details and pre-register to get tested here: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing-blitz   @AZDHS AZDHS | Epidemiology & Disease Control - Highlighted Infectious Disease for Arizona Working to monitor, prevent and control diseases in Arizona through education, immunization and research. azdhs.gov", "2020-05-13T21:26:14.000Z": "GOOD NEWS: @GrandCanyonNPS will gradually reopen beginning this weekend, taking steps to protect the health of visitors and park staff. Thank you, @NatlParkService ! More important info if you're planning to visit: https:// nps.gov/grca/learn/new s/grand-canyon-national-park-is-beginning-to-increase-access-to-south-rim-viewpoints.htm ", "2020-05-13T21:00:01.000Z": "Arizonans can find their nearest #AZTestingBlitz location and hours of operation, as well as pre-register, here: https:// 1.azdhs.gov/3cszLMQ  #COVID19", "2020-05-13T20:11:01.000Z": "NEW: AZ food banks will receive $500K from the AZ Coronavirus Relief Fund.\n\nThis will help food pantries in all 15 counties make more food deliveries & implement protocols to enhance physical distancing like drive-thru pick-ups. https:// azgovernor.gov/governor/news/2020/05/governor-ducey-announces-500000-food-banks-fight-hunger   #AZTogether  @foodbanksaz Governor Ducey Announces $500,000 For Food Banks To Fight Hunger AZ Coronavirus Relief Dollars Going To Nearly 1,000 Food Pantries In All 15 Counties azgovernor.gov", "2020-05-13T18:53:42.000Z": "Thank you Governor @dougducey for proclaiming this week #ArizonaCharterSchoolsWeek and helping us celebrate the extraordinary efforts of our state's charter schools to go above and beyond for kids and communities in these extraordinary times. #AboveAndByondAZ  #ClosedNotClosed Quote Tweet Doug Ducey @dougducey Charter schools throughout Arizona continue to teach, serve and engage our kids during #COVID19 . Thank you to the charter school students, families, teachers and leaders for your creativity, innovation and resilience while kids learn from a distance. #CharterSchoolsWeek", "2020-05-13T18:57:28.000Z": "Arizona's #COVID19 testing blitz continues this Saturday May 16th. Visit ADHS at https:// azdhs.gov/testingblitz to find the location nearest you and pre-register. \n\nYou can also request a test from your healthcare provider. #AZTogether", "2020-05-13T18:24:20.000Z": "God bless the men and women of law enforcement. Quote Tweet Dept. of Public Safety @Arizona_DPS This year, 307 new names are added to the walls of the National Law Enforcement Officers Memorial in Wash., DC. @NLEOMF will livestream a virtual Candlelight Vigil at 5pm MST today to honor the fallen. Learn where to watch at http:// nleomf.org/programs-event s/national-police-week/candlelight-vigil   #WeWillNeverForget  #AZTroopers", "2020-05-12T23:45:19.000Z": "Thank you @proseboutiques for following safety guidelines and setting the cosmetology industry standard on how to resume operations and #ReturnStronger ! https:// bit.ly/2LjLeSW", "2020-05-13T17:17:09.000Z": "Charter schools throughout Arizona continue to teach, serve and engage our kids during #COVID19 . Thank you to the charter school students, families, teachers and leaders for your creativity, innovation and resilience while kids learn from a distance. #CharterSchoolsWeek", "2020-05-12T22:39:21.000Z": "Arizona's stay at home order expires on May 15. @dougducey says we must continue to be smart and safe. @azfamily", "2020-05-12T23:36:24.000Z": "Exciting news for #Arizona 's tourism industry as Gov. @dougducey announces new guidance for the continued re-energization of Arizona's economy, which allows for reopening tomorrow of pool facilities, fitness centers & spa services. DETAILS HERE: https:// bit.ly/3dGaHSK", "2020-05-12T22:48:31.000Z": "I'm grateful to all Arizonans for their partnership and cooperation during these trying times. By continuing to follow the data and recommendations of public health officials, we can continue to move forward safely and responsibly together. #ReturnStronger", "2020-05-12T22:48:01.000Z": "In addition, Arizona is accelerating plans to test all staff & residents of long-term care facilities & individuals within Arizona's prisons. @AZDHS will partner w/ private-sector labs to expand testing to 147 LTC facilities & provide antibody tests for correctional officers. 9/", "2020-05-12T22:47:28.000Z": ". @AZDHS has released health and safety guidance for businesses and customers as partial operations resume. This includes: pools, gyms, spas and places of worship. https:// azgovernor.gov/governor/news/2020/05/governor-ducey-announces-next-phase-arizona-recovery  8/ Governor Ducey Announces Next Phase Of Arizona Recovery Stay At Home Order To Expire On May 15; Replaced By New Guidance For Economic Recovery That Prioritizes Health And Physical Distancing azgovernor.gov", "2020-05-12T22:46:03.000Z": "Today, I'm announcing that pools, gyms and spas can reopen this Wednesday, May 13. Major league sports can resume limited reopening, without fans, this Saturday, May 16. 7/", "2020-05-12T22:45:18.000Z": "With Arizona trending in the right direction it is time to move forward with the next steps of economic recovery - while continuing to make health and safety our number one priority. That's why, on May 15, the Stay at Home Order will expire and be replaced by new guidance. 6/", "2020-05-12T22:43:30.000Z": "Gating criteria 4: Testing Arizona has expanded both diagnostic and antibody testing, and has accelerated plans to test all residents and staff of long-term care facilities, as well as those within our prisons. 5/", "2020-05-12T22:42:00.000Z": "Gov. @dougducey : We have many employers who are hiring TODAY. If you want more info on job opportunities go to http:// arizonatogether.org for more details. Arizona Together Resources, information, and community support in our fight against COVID-19. arizonatogether.org", "2020-05-12T22:42:36.000Z": "Gating criteria 3: Hospitals With new hospital beds and surge capacity ready, Arizona continues to have more than ample hospital capacity and treat all patients without crisis care. 4/", "2020-05-12T22:38:40.000Z": "Gating criteria 2: Cases As testing has rapidly expanded, Arizona is experiencing a four-week downward trajectory of positive cases as a percentage of total diagnostic tests. 3/", "2020-05-12T22:37:43.000Z": "Gating criteria 1: Symptoms Arizona has experienced a five-week downward trajectory of COVID and Influenza-like symptoms reported at our hospitals. 2/", "2020-05-12T22:36:39.000Z": "Arizona has taken a calm and steady approach to protecting health and slowing the spread of #COVID19 . We're following the guidance and gating criteria established by the White House and @CDCgov . And we're tracking the data closely. Here's what it says: 1/", "2020-05-12T22:02:12.000Z": "NOW: I'm joining @DrCaraChrist and Major General McGuire to share #COVID19 updates and discuss Arizona's continued efforts to breathe life back into our businesses while following public health guidance. #ReturnStronger Doug Ducey @dougducey LIVE: Governor Ducey Provides Updates On COVID-19 In Arizona", "2020-05-12T17:52:57.000Z": "With dine-in operations resuming across the state yesterday, restaurants are acting responsibly and taking precautionary measures to keep staff and customers safe. #ReturnStronger @bevvyaz", "2020-05-12T17:01:02.000Z": "Arizona's law enforcement personnel put their lives on the line to protect our communities. Thank you to our police officers for your strength, valor and sacrifice. #NationalPoliceWeek", "2020-05-12T16:10:48.000Z": "MORE: https:// azgovernor.gov/governor/news/2020/05/update-over-8-million-donated-coronavirus-relief-efforts   #AZTogether Over $8 Million Donated For Coronavirus Relief Efforts PHOENIX - The Office of Governor Doug Ducey today announced that more than $8.2 million has been donated to the AZ Coronavirus Relief Fund to support COVID-19 relief efforts. azgovernor.gov", "2020-05-12T16:10:10.000Z": "NEW: The AZ Coronavirus Relief Fund has received more than $8.2 MILLION since March. These dollars will directly support businesses, individuals & families in need, including through support for food banks, digital learning opportunities & assistance to vulnerable populations. 1/", "2020-05-12T04:13:24.000Z": "While other states act totalitarian we applaud sane+sensible Governor @dougducey who understands we can walk and chew food at same time.", "2020-05-12T13:41:03.000Z": "#returnstronger Great dinner at the Living Room-DC Ranch, thanks @DougDucey for opening up restaurants and great actions by owners and employees at the Living Room to keep us safe!  Time to support our restaurant workers and owners, eat out often!", "2020-05-11T23:22:00.000Z": "As it gets hotter, the risk of wildfires grows. There are commonsense precautions we all can take to minimize risk. @azstateforestry", "2020-05-11T19:17:24.000Z": "Governor @dougducey 's data-driven plan will allow Arizona to reopen safely and #ReturnStronger . Quote Tweet Doug Ducey @dougducey WATCH: As our economy comes back, we need to be smarter and safer - while following public health guidance to keep customers and employees healthy. Businesses across Arizona are doing just that. @origchopshop  #ReturnStronger", "2020-05-11T19:16:23.000Z": "Great work, @aioliburgers ! #ReturnStronger  #SupportLocalAZ Quote Tweet Aioli Gourmet Burger @aioliburgers We are excited to be open and following the CDC Guidelines and Governor @dougducey 's plan! #supportlocal . We still have curbside pick up 602-971-5555", "2020-05-11T18:27:16.000Z": "WATCH: As our economy comes back, we need to be smarter and safer - while following public health guidance to keep customers and employees healthy. Businesses across Arizona are doing just that. @origchopshop  #ReturnStronger", "2020-05-11T17:31:14.000Z": "As part of Governor @DougDucey 's gradual and responsible plan to reenergize Arizona's economy, restaurants & coffee shops can resume dine-in services Today, May 11th.\n \nWe have collected guidance to help these businesses #ReturnStronger : https:// bit.ly/3fv16jl", "2020-05-11T17:30:00.000Z": "Tomorrow, Tuesday, May 12, #AZForestry & @BLMAZFire will implement Stage II fire restrictions across #Arizona . For #AZ State Lands: restrictions include all state-owned/manged lands, except in @CoconinoCounty , SOUTH of the Grand Canyon. https:// bit.ly/2WKwHVJ  #AZFire  #BLMAZ", "2020-05-11T17:16:53.000Z": "Just had a productive call with @VP and fellow governors to discuss Arizona's work to continue expanding testing and partially reopen businesses while following public health guidance.", "2020-05-11T16:41:39.000Z": "Mayo Clinic in Phoenix was one of more than 40 health care sites offering #COVID19 testing as part of the #AZTestingBlitz this weekend! Thank you @MayoClinic and all partners. \n\nMore testing is available Saturday, May 16. Pre-register: https:// azdhs.gov/preparedness/epidemiology-disease-control/infectious-disease-epidemiology/index.php#novel-coronavirus-testing-blitz ", "2020-05-11T15:54:32.000Z": "Congratulations to all the @ASU graduates. Go Sun Devils!  #ASUGrad  #ForksUp Quote Tweet Arizona State University @ASU TUNE IN: @ASU commencement is about to begin! Facebook http:// ow.ly/8mv250zCkXD  YouTube http:// ow.ly/dkP550zCkXC  Online http:// ow.ly/q8bV50zCkXE  #ASUgrad  GIF", "2020-05-10T15:00:00.000Z": "This day and every day, we're grateful to the women who have given us so much - whether they are our mothers by birth, adoption or foster care. Happy #MothersDay !", "2020-05-10T13:30:00.000Z": "Today, we celebrate the women who love, guide and support us unconditionally.\n\nHappy #MothersDay to all the mothers across Arizona!", "2020-05-09T18:49:40.000Z": "Thank you @UnitedFoodBank , @CITYOFMESA , @MayorGiles and everyone who came together to serve Arizona's families in need! #TheArizonaWay Quote Tweet Mayor John Giles @MayorGiles Stopped by the @UnitedFoodBank and @CITYOFMESA food distribution at the Convention Center this morning. Great job to everyone who helped make the transition to indoor prep and carline delivery seamless. #wefeedaz  #inspiremesa  #mesacares"}