{"2020-07-29T18:30:34.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update from Russellville (7.29.20): LIVE: Governor Hutchinson Provides COVID-19 Update From Russellville... Governor Asa Hutchinson will provide an update to media in Russellville Wednesday, July 29, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-29T15:26:14.000Z": "Today I announced Fiocchi Ammunition will be acquiring and expanding Blackstone Ammunition in Little Rock. This $15 million investment will support over 80 jobs & will strengthen our state's position as a destination for ammunition manufacturing. Fiocchi to establish a new industrial platform to boost growth in the United States Fiocchi of America, the United States subsidiary of Fiocchi Group, announced plans to establish a new manufacturing facility in Little Rock. arkansasedc.com", "2020-07-29T15:01:07.000Z": "LIVE: Governor Hutchinson, Commerce Secretary Preston Make Economic Development Announcement (7.29.20): LIVE: Governor Hutchinson, Commerce Secretary Preston Make Economic... Governor Asa Hutchinson will be joined by Secretary of Commerce Mike Preston for an economic development announcement Wednesday, July 29, 2020. youtube.com", "2020-07-29T12:30:37.000Z": "Since 1979, Arkansas Governor's School has hosted some of the brightest minds in the state. I was honored to give the keynote address yesterday, as students wrap up their unconventional Governor's School experience through Arkansas Tech. I can't wait to see what they accomplish!", "2020-07-28T22:02:41.000Z": "I want to say thank you to the Arkansas Legislative Council for approving the much-needed funding for increased efforts in minority communities who have been disproportionately affected by COVID-19. This is critical to our state's efforts in combatting this virus.", "2020-07-28T18:29:53.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.28.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.28.20) Governor Asa Hutchinson provides an update to media on Tuesday, July 28, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-27T21:49:29.000Z": "Today I announced a $10 million agreement between the Arkansas Department of Education & AT&T and T-Mobile to provide Wi-Fi Access Points to K-12 schools. Arkansas students need access to internet in the event they must complete their course work at home. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-announces-10-million-for-wi-fi-access-devices-for-arkan ", "2020-07-27T18:28:48.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.27.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.27.20) Governor Asa Hutchinson provides an update to media on Monday, July 27, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-27T16:26:50.000Z": "The data continue to show that wearing a mask is effective in slowing the spread of COVID-19. Ensuring your mask covers your mouth and nose helps your neighbors and your community as we continue to battle this invisible enemy.", "2020-07-26T20:54:02.000Z": "See my statement on the failure of the Legislature to approve funding for more resources to fight COVID-19 in minority communities.", "2020-07-26T12:57:00.000Z": "Have a blessed Sunday.", "2020-07-25T18:32:00.000Z": "If you are experiencing symptoms or have been exposed to someone who has tested positive for COVID-19, call your county health unit or consult your primary care physician for a test. https:// healthy.arkansas.gov/local-health-u nits ", "2020-07-25T14:16:32.000Z": "As we continue to see high numbers of COVID-19 cases throughout Arkansas, we need to remain vigilant about masks. Wearing a mask protects your friends and neighbors and will help us ensure students can receive in-person instruction next month.", "2020-07-24T21:46:54.000Z": "Arkansas needs to improve its census response rates. The census has never been easier to complete, and it is critical every Arkansan participate. This will determine federal funding, redistricting, and much more for the next decade. See below for the different ways to respond!", "2020-07-24T20:43:38.000Z": "Today we received a donation of 10,000 N95 masks from President Tsai Ing-wen's government in Taiwan, in addition to their donation of 100,000 in May. We are grateful to President Tsai for her administration's generosity and assistance during the COVID-19 pandemic.", "2020-07-24T18:30:42.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.24.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.24.20) Governor Asa Hutchinson provides an update to media on Friday, July 24, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-24T16:34:57.000Z": "I was honored to host the Arkansas 4-H Governor's Awards Luncheon yesterday at the Governor's Mansion. As an alumnus of 4-H, I appreciate the work ethic and life skills that are instilled into these students, and I know they will carry these lessons throughout their lives.", "2020-07-23T22:32:00.000Z": "I'm excited to appoint Solomon Graves Secretary of the Department of Corrections. His experience is crucial during this difficult time in Arkansas, & I am grateful for his knowledge of the prison system & compassion for those in correctional institutions. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-appoints-solomon-graves-secretary-of-department-of-corr ", "2020-07-23T18:31:02.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.23.20): LIVE: LIVE: Governor Hutchinson Provides COVID-19 Update (07.23.20) Governor Asa Hutchinson provides an update to media on Thursday, July 23, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-22T22:27:24.000Z": "Today I was able to meet with frontline healthcare workers from Washington Regional Medical Center, one of the hardest hit hospitals in the state. Their courage and dedication reminded me yet again of the importance of slowing the spread and the necessity of wearing a mask.", "2020-07-22T18:30:28.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update from Fayetteville (7.22.20): LIVE: Governor Hutchinson Provides COVID-19 Update from Fayetteville... Governor Asa Hutchinson provides a COVID-19 update to media in Fayetteville on Wednesday, July 22, 2020, regarding Arkansas's COVID-19 response youtube.com", "2020-07-21T21:59:34.000Z": "SCA Pharma is an Arkansas-based, Arkansas-founded company, and we're excited to see their expansion. Their $10 million investment and 180 new jobs will benefit Arkansas, and their continued work in pharmaceuticals will help people across the country. SCA Pharma to Expand Production Facility in Little Rock SCA Pharma announced that it will expand its operations in Little Rock with a $10 million investment. arkansasedc.com", "2020-07-21T18:30:45.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.21.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.21.20) Governor Asa Hutchinson provides an update to media on Tuesday, July 21, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-21T15:58:10.000Z": "The Low-Income Home Energy Assistance Program (LIHEAP) has received over $8 million of CARES Act funding to assist low-income households who are having difficulties paying their energy bill due to loss of income because of COVID-19. http:// adeq.state.ar.us/energy/", "2020-07-21T00:01:00.000Z": "The Air National Guard base at Fort Smith makes the short list for a new military flight training center to serve U.S. allies. This is a vital national security mission, & I'm confident Fort Smith & the River Valley are ready to take on this task. Ft. Smith Airport Potential Host of Singapore Air Force, F-35 Aircraft cotton.senate.gov", "2020-07-20T18:29:53.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.20.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.20.20) Governor Asa Hutchinson provides an update to media on Monday, July 20, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-20T12:15:00.000Z": "Beginning today, face coverings are required in public. This is a critical step to combatting the spread of COVID-19 and ensuring students can have in-person instruction beginning next month. https:// governor.arkansas.gov/images/uploads /executiveOrders/EO_20-43.pdf ", "2020-07-19T12:57:00.000Z": "", "2020-07-18T20:11:29.000Z": "This morning, President Trump ordered flags to flown at half-staff to honor the life and legacy of Rep. John Lewis. Because of this proclamation, Arkansas state flags will be flown at half-staff as well in accordance with the Presidential Proclamation. Proclamation on the Death of John Lewis As a mark of respect for the memory and longstanding public service of Representative John Lewis, of Georgia, I hereby order, by the authority vested in me by the Constitution and the laws of the... whitehouse.gov", "2020-07-18T15:57:00.000Z": "Be sure and take advantage of some of the great outdoor opportunities Arkansas has to offer this weekend! If you're fishing on the White River, you may be able to catch a rare Golden Rainbow Trout! https:// agfc.com/en/news/2020/0 5/06/anglers-can-find-additional-golden-rainbows-in-white-river/ ", "2020-07-18T15:56:56.000Z": "I am deeply saddened to hear of the passing of Representative John Lewis. During my time in Congress, I grew to have a strong admiration for him and the battles he fought during the Civil Rights Era. We will miss him.", "2020-07-17T19:14:38.000Z": "Once again, we are seeing the Arkansas economy rebound. Unemployment for June dropped to 8% from 9.6% in May. Arkansas is three points below the national average of 11.1%, and this is an encouraging sign that means people are getting back to work and receiving a paycheck.", "2020-07-17T18:30:07.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.17.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.17.20) Governor Asa Hutchinson provides an update to media on Friday, July 17, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-17T16:25:28.000Z": "I was delighted to see my good friend @CanaanSandy yesterday and for him to bring me a delicious Cave City Watermelon! His vibrant spirit and positive outlook can't help but bring a smile to your face whenever you're around him. Thanks for the watermelon, Canaan!", "2020-07-16T22:18:32.000Z": "Today, @realDonaldTrump highlighted the importance of licensing reform and regulatory innovation. This allows projects to be done quicker and helps eliminate barriers to entry for American workers. We cut regulations in Arkansas, & I am grateful to see this at the federal level.", "2020-07-16T18:29:46.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.16.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.16.20) Governor Asa Hutchinson provides an update to media on Thursday, July 16, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-16T01:00:58.000Z": "Companies across the country continue to make decisions to protect employees & customers from the spread of COVID-19. @Walmart 's decision to require masks does just that. This supports our public health goal of increasing the use of masks & social distancing to fight this virus. Quote Tweet Walmart @Walmart To best serve our communities and protect the health and safety of our shoppers and associates, face coverings will be required in all stores beginning Monday, July 20. For more on our decision and policy, please see here: https:// bit.ly/3h34FNK", "2020-07-15T21:36:30.000Z": "Today, we were able to provide the COVID-19 update from the campus of the University of Central Arkansas in Conway. I'm grateful for the work that's being done by local leaders and for the UCA Bears mask! Quote Tweet University of Central Arkansas @ucabears Thank you Governor @AsaHutchinson for visiting our campus today. We appreciate the work you and your team are doing to keep Arkansas safe.", "2020-07-15T18:29:43.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update from Conway (7.15.20): LIVE: Governor Hutchinson Provides COVID-19 Update from Conway... Governor Asa Hutchinson provides an update to media from Conway on Wednesday, July 15, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-14T18:29:30.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.14.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.14.20) Governor Asa Hutchinson provides an update to media on Tuesday, July 14, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-14T16:45:53.000Z": "The University of Arkansas continues to strengthen its position as a leading public research institution. Thank you to the @WaltonFamilyFdn for your generous investment in research and technology, which will benefit the entire state of Arkansas. Quote Tweet University of Arkansas @UArkansas A $194.7M grant from the Walton Family Charitable Support Foundation expands the #UARK research mission through collaborative clusters, driving commercialization, entrepreneurship education & the new Institute for Integrative and Innovative Research (I3R) http:// ow.ly/f9ZT50AxoZ0", "2020-07-13T20:44:25.000Z": "As I mentioned during today's COVID Update, Senator David Pryor has been hospitalized with COVID-19. This virus is no respecter of persons, & we should continue to wear a mask to stop the spread. Please join me in lifting up Senator Pryor, Barbara Jean, & family in your prayers.", "2020-07-13T18:31:23.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.13.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.13.20) Governor Asa Hutchinson provides an update to media on Monday, July 13, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-12T13:00:00.000Z": "", "2020-07-12T00:35:41.000Z": "The record number of new cases is very concerning and may be the result of the July 4th celebrations. Regardless, it is a reminder of the challenge we continue to face.  As we dig deeper into the data, I will have further comments on Monday.", "2020-07-11T01:42:03.000Z": "Thank you, @realDonaldTrump , for granting my request for a Disaster Declaration for the 11 counties that suffered extensive damage due to the April 12 storms.This assistance will help these communities to recover, rebuild, & come back stronger than before. President Donald J. Trump Approves Arkansas Disaster Declaration | The White House Today, President Donald J. Trump declared that a major disaster exists in the State of Arkansas and ordered Federal assistance to supplement State and loca whitehouse.gov", "2020-07-10T23:01:04.000Z": "Today we provided the COVID-19 update from De Queen. Sevier County has been one of the hardest hit counties by COVID-19, and I am grateful for the hard work and dedication of community leaders and healthcare workers in their response.", "2020-07-10T18:31:30.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update from De Queen (7.10.20): LIVE: Governor Hutchinson Provides COVID-19 Update From De Queen... Governor Asa Hutchinson provides an update to media in De Queen on Friday, July 10, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-10T12:15:00.000Z": "More job creation news as Gerber Products Company announced they will be expanding their existing facility in Fort Smith, creating an additional 50 jobs and investing $30 million at their site! Great work by @ftsmithchamber and @ArkansasEDC ! Gerber to create up to 50 jobs, invest $30 million at Fort Smith plant Gerber is generating up to 50 full-time jobs and investing $30 million for new equipment and infrastructure improvements at the site. arkansasedc.com", "2020-07-09T22:41:39.000Z": "I was grateful for U.S. Attorney General William Barr to visit Arkansas today. We discussed the work of the Task Force to Advance the State of Law Enforcement in Arkansas and the importance of a hate crime law in Arkansas. Thank you @SenTomCotton & @RepFrenchHill for joining us!", "2020-07-09T19:35:16.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.9.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.09.20) Governor Asa Hutchinson provides an update to media on Thursday, July 9, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-09T18:35:22.000Z": "LIVE: Governor Hutchinson Provides Media Availability with U.S. Attorney General William Barr (7.9.20): Gov. Hutchinson Holds Media Availability with U.S. Attorney General... Governor Asa Hutchinson will hold a media availability at 1:30 p.m. after a luncheon with U.S. Attorney General William Barr, Senator Tom Cotton, and Congres... youtube.com", "2020-07-08T18:29:44.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.8.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.08.20) Governor Asa Hutchinson provides an update to media on Wednesday, July 8, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-08T16:10:42.000Z": "I'm excited to have a wonderful group of interns in my office this summer. They are working virtually, which provides them with a unique experience in the Governor's office. I'm thankful for their desire to learn about Arkansas state government, and their commitment to serve.", "2020-07-07T20:23:41.000Z": "I'm grateful for the work done by the @ArkansasEDC and other local partners to bring @Amazon to Arkansas. Their new fulfillment center at the Port of Little Rock will create over 1,000 new jobs, and we are excited to welcome them to the Natural State. Amazon Announces First Fulfillment Center and Second Delivery Station in Little Rock Amazon is creating the first Fulfillment Center and second Delivery Station in Little Rock, creating over 1,000 new jobs. arkansasedc.com", "2020-07-07T18:28:50.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.7.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.07.20) Governor Asa Hutchinson provides an update to media on Tuesday, July 7, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-07T12:10:00.000Z": "Don't forget to fill out the 2020 Census! The Census is necessary to get a complete count of the citizens in Arkansas to determine federal funding, and an undercount of even one percent could cost the state almost $1 billion dollars over the next decade. English", "2020-07-06T18:29:33.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.6.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.06.20) Governor Asa Hutchinson provides an update to media on Monday, July 6, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-06T16:08:03.000Z": "Thank you @GovernorVA ! I wear a mask because it's the right thing to do to care for my friends and family. What about our friends to the south, @LouisianaGov ? #MaskUpAmerica Quote Tweet Ralph Northam @GovernorVA 0:52 As a physician, I wear a mask because I know it helps prevent the spread of #COVID19 . But governors across our country know it too. @AsaHutchinson , why do you wear a mask? #MaskUpSaveLives", "2020-07-05T12:56:00.000Z": "", "2020-07-04T16:00:01.000Z": "Today we reflect on the sacrifices and struggles of so many who fought for the independence of the United States. America has faced its share of troubling times, but has always pulled through because of the strength and resilience of her people. Happy 4th of July!", "2020-07-03T20:00:35.000Z": "Today I announced an executive order that allows cities to implement a mandatory mask order. I'm grateful for the work of @ARMuniLeague to help draft a model ordinance to allow for consistency across Arkansas. https:// governor.arkansas.gov/images/uploads /executiveOrders/EO_20_-_41.pdf ", "2020-07-03T18:30:02.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.3.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.03.20) Governor Asa Hutchinson provides an update to media on Friday, July 3, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-03T16:15:00.000Z": "While many state offices are closed today for the holiday weekend, COVID-19 doesn't take the holidays off. We must remain vigilant this weekend so we can stop the spread in Arkansas. Stay six feet apart, wear a mask, and enjoy the Fourth of July!", "2020-07-02T21:31:45.000Z": "Today I announced registered voters in Arkansas who fear potential exposure to COVID-19 may apply for an absentee ballot for November's General Election if they desire to do so. I'm grateful for the leadership of @ARSecofState and bipartisan support from @ARGOP and @ArkDems .", "2020-07-02T18:29:39.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.2.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.02.20) Governor Asa Hutchinson provides an update to media on Thursday, July 2, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-02T12:43:19.000Z": "While the Declaration of Independence was not signed until July 4, 1776, the Lee Resolution was passed two days earlier on July 2. This resolution, drafted by Richard Henry Lee of Virginia, declared the 13 colonies be \"free and independent states.\"", "2020-07-01T18:29:12.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (7.1.20): LIVE: Governor Hutchinson Provides COVID-19 Update (07.01.20) Governor Asa Hutchinson provides an update to media on Wednesday, July 1, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-07-01T12:02:00.000Z": "Today marks a new day in North American trade. The #USMCA Entry Into Force will provide for freer trade, freer markets, and expanded opportunities for Arkansas workers and farmers.", "2020-06-30T21:15:59.000Z": "During today's COVID-19 update, I announced the State ended the fiscal year $360 million above our revised projection. Because of this, the State will be able to further fund the Public School Fund, Higher Education, and the Medicaid Trust Fund beyond our original projection.", "2020-06-30T18:29:28.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.30.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.30.20) Governor Asa Hutchinson provides an update to media on Tuesday, June 30, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-29T20:38:53.000Z": "I'm saddened to hear of the passing of Charles Ripley. \"Coach Rip\" understood that \"student\" is listed first in \"student athlete\" for a reason. His care and compassion for young people will be missed greatly, and his impact on the State of Arkansas will continue on.", "2020-06-29T18:28:59.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.29.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.29.20) Governor Asa Hutchinson provides an update to media on Monday, June 29, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-28T12:58:00.000Z": "Have a restful Sunday.", "2020-06-27T20:12:50.000Z": "Listen in Sunday as I answer questions on our current national health emergency. Quote Tweet This Week @ThisWeekABC This Sunday, @GStephanopoulos goes one-on-one with Arkansas Gov. @AsaHutchinson as the South faces a spike in COVID-19 cases; plus @GovChristie , @ysimpsonpower , @RahmEmanuel and @sarafagen2 join the Powerhouse Roundtable. See it on @ThisWeekABC  http:// abcn.ws/3iikv8C", "2020-06-27T16:02:00.000Z": "Today is Post Traumatic Stress Disorder (PTSD) awareness day. PTSD affects nearly 8 million people in the United States, and it affects veterans and civilians who have experienced a traumatic event in their lives.", "2020-06-26T21:56:17.000Z": "Very proud of the legislative effort on a hate crime law in Arkansas. Texas has one & Georgia recently did so as well. This is the right step for Arkansas. Legislators Propose Hate Crime Bill Arkansas senate.arkansas.gov", "2020-06-26T21:12:35.000Z": "Today I announced the appointment of Rob Finley to the Arkansas Game and Fish Commission. His dedication to outdoor conservation in Arkansas is remarkable, and I am thankful for his willingness to serve on the Commission. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-announces-rob-finley-as-new-game-and-fish-commissioner ", "2020-06-26T18:30:03.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.26.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.26.20) Governor Asa Hutchinson provides an update to media on Friday, June 26, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-25T21:51:47.000Z": "Today I was honored to attend a wreath-laying ceremony for those who served and lost their lives in the Korean War. Often referred to as the \"Forgotten War,\" I was grateful to remember their service today.", "2020-06-25T18:29:48.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.25.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.25.20) Governor Asa Hutchinson provides an update to media on Thursday, June 25, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-25T01:27:19.000Z": "U of A Walton College has just been named as having the #1 Undergraduate Supply Chain program in America. A very big deal. Congrats! Quote Tweet U of A Walton College @uawaltoncollege Our supply chain management department ranked No. 1 in rankings released today by @Gartner_inc  #BeEpic  https:// linkedin.com/feed/update/ur n:li:activity:6681587077919883264 ", "2020-06-24T21:52:43.000Z": "During today's COVID-19 update I announced the Department of Health will be doubling the number of those working in contact tracing to more than 700. Contact tracing is a critical tool being used by our public health officials to help best determine where COVID-19 is being spread", "2020-06-24T18:30:25.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.24.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.24.20) Governor Asa Hutchinson provides an update to media on Wednesday, June 24, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-24T00:21:57.000Z": "Today I provided our COVID-19 update from Mountain Home. While Baxter County has not seen the number of cases other parts of Arkansas have seen, we can't let our guard down in response to COVID-19.", "2020-06-23T18:29:54.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update from Mountain Home (6.23.20): LIVE: Governor Hutchinson Provides COVID-19 Update From Mountain Home... Governor Asa Hutchinson provides an update to media in Mountain Home on Tuesday, June 23, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-22T18:30:52.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.22.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.22.20) Governor Asa Hutchinson provides an update to media on Monday, June 22, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-21T12:56:00.000Z": "Happy Father's Day!", "2020-06-20T20:19:03.000Z": "Well done @ARGOP for following public health guidelines at state committee meeting.  Well attended, distanced and safe.  Temperature checks  & masks available & worn as necessary.", "2020-06-20T16:35:00.000Z": "This past week, we received another shipment of N-95 masks for the state. These masks will be distributed all across Arkansas as we continue to deal with COVID-19.", "2020-06-20T12:00:00.000Z": "The Arkansas unemployment percentage for the month of May was 9.5%, nearly four points below the national average. While this number is still higher than we would like to see, it's great to see an economy bringing Arkansans back to work.", "2020-06-19T20:51:53.000Z": "During today's COVID-19 update, I once again stressed the importance of wearing a face covering with new guidance from the Department of Health. We must be vigilant in the fight against this virus as we continue to go about our daily lives.", "2020-06-19T18:29:38.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.19.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.19.20) Governor Asa Hutchinson provides an update to media on Friday, June 19, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-19T16:11:23.000Z": "Thank you to @USDOT for funding to improve US-67 in Arkansas! I am grateful for the work @myARDOT does to continually improve our highways across the state. Quote Tweet Donald J. Trump @realDonaldTrump Great things coming to Arkansas! $40M to be awarded to @myARDOT from @USDOT to reconstruct and improve US 67 in @PulaskiAR and Lonoke Counties. Will reduce congestion and travel time - a huge boost for economic growth!", "2020-06-19T12:06:30.000Z": "Today we celebrate Juneteenth as the end of slavery in the United States. We recognize the struggle that African Americans continue to have as we work for a more equitable society, with liberty and justice for all.", "2020-06-18T18:30:13.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update from Fort Smith (6.18.20): LIVE: Governor Hutchinson Provides COVID-19 Update From Fort Smith... Governor Asa Hutchinson provides an update to media in Fort Smith on Thursday, June 18, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-17T18:29:04.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.17.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.17.20) Governor Asa Hutchinson provides an update to media on Wednesday, June 17, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-17T12:05:00.000Z": "Yesterday, I was able to provide a COVID-19 update from Hot Springs. I am grateful for the work done by the officials in Hot Springs and Garland County in battling COVID-19 in their community.", "2020-06-16T21:58:09.000Z": "Throughout the COVID-19 pandemic, Arkansas companies have adapted to the changing economic environment in our state. Vulcan Sporting Goods Co. in Hot Springs has shifted some of its production to top quality masks for athletes and sportsmen. Very proud of them!", "2020-06-16T18:28:58.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update from Hot Springs (6.16.20): LIVE: Governor Hutchinson Provides COVID-19 Update From Hot Springs... Governor Asa Hutchinson provides an update to media in Hot Springs on Tuesday, June 16, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-15T18:28:58.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.15.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.15.20) Governor Asa Hutchinson provides an update to media on Monday, June 15, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-15T12:50:11.000Z": "", "2020-06-14T15:59:55.000Z": "The Second Continental Congress adopted the flag of the United States on this day in 1777. It has undergone a number of changes in the past 243 years, but remains a symbol of freedom to people all across the world.", "2020-06-14T12:45:00.000Z": "", "2020-06-13T13:00:00.000Z": "This weekend is another free fishing weekend in Arkansas! Be sure to take advantage of the incredible fishing opportunities the Natural State has to offer. https:// governor.arkansas.gov/images/uploads /proclamations/200206_2020_Free_Fishing_Weekend._.pdf ", "2020-06-12T21:27:53.000Z": "While it is critical that we continue to go about our daily business, wearing a face covering is vital to stopping the spread of COVID-19. Be sure and wear a face covering when social distancing is not possible to protect those around you from contracting COVID-19.", "2020-06-12T18:30:06.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.12.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.12.20) Governor Asa Hutchinson provides an update to media on Friday, June 12, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-12T12:00:00.000Z": "Today would have been the 96th birthday of President George H.W. Bush. His leadership and vision for America remain an inspiration to many, and his character and integrity are missed by all.", "2020-06-11T18:31:22.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.11.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.11.20) Governor Asa Hutchinson provides an update to media on Thursday, June 11, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-10T22:09:37.000Z": "After consultation with my public health team, I announced that we will expand economic opportunity with public health guidelines and enter Phase Two of our economic recovery. (1/2)", "2020-06-10T18:30:03.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.10.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.10.20) Governor Asa Hutchinson provides an update to media on Wednesday, June 10, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-10T18:06:10.000Z": "Today is the visitation for Dr. Ray Hull of Rogers. He was a friend to many, including myself. My statement is below.", "2020-06-10T14:13:50.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (06.10.20) Governor Asa Hutchinson provides an update to media on Wednesday, June 10, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-09T18:31:11.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update from Pine Bluff (6.9.20): LIVE: Governor Hutchinson Provides COVID-19 Update From Pine Bluff... Governor Asa Hutchinson provides an update to media in Pine Bluff this afternoon, Tuesday, June 9, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-09T17:52:40.000Z": "I'm holding a news conference at 1:30pm in Pine Bluff to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update From Pine Bluff... Governor Asa Hutchinson provides an update to media in Pine Bluff this afternoon, Tuesday, June 9, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-09T16:04:24.000Z": "LIVE: Governor Hutchinson Holds News Conference on Establishment of Law Enforcement Task Force: LIVE: Governor Hutchinson Holds News Conference on Establishment of... Governor Asa Hutchinson holds a news conference on the establishment of a task force to advance the state of law enforcement in Arkansas. youtube.com", "2020-06-08T21:03:00.000Z": "I was honored to fly the Healthcare Heroes flag at the Governor's Mansion to recognize the work being done by all those in the healthcare field as we continue to battle COVID-19.", "2020-06-08T18:30:29.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.8.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.08.20) Governor Asa Hutchinson provides an update to media on Monday, June 8, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-08T14:32:02.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (06.08.20) Governor Asa Hutchinson provides an update to media on Monday, June 8, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-07T13:00:00.000Z": "", "2020-06-06T16:00:00.000Z": "On this day in 1944, Allied Forces stormed the beaches of Normandy in an act of bravery rarely seen before. Because of their actions, World War II was able to come to a swift end, and the Allies were victorious.", "2020-06-05T21:13:19.000Z": "LIVE: Governor Hutchinson Holds Media Availability Following Meeting with Local Community Leaders (6.5.20): LIVE: Gov. Hutchinson Holds Media Availability Following Meeting with... Governor Asa Hutchinson holds a media availability at the Mosaic Templars Cultural Center following a meeting with local community leaders and protest organi... youtube.com", "2020-06-05T18:30:08.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.5.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.05.20) Governor Asa Hutchinson will provide an update to media on Friday, June 5, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-05T14:50:20.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (06.05.20) Governor Asa Hutchinson will provide an update to media on Friday, June 5, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-05T12:00:00.000Z": "Sixteen years ago today, President Ronald Reagan passed away. I was honored to be appointed by him to serve as United States District Attorney in 1982, and I am constantly inspired by his firm and steadfast leadership as President.", "2020-06-04T21:36:01.000Z": "Happy birthday to Arkansas Razorback Superfan @canaansandy ! I know you're ready for Razorback athletics to be back, and so am I. Thanks for stopping by the Capitol today!", "2020-06-04T18:30:13.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.4.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.04.20) Governor Asa Hutchinson provides an update to media on Thursday, June 4, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-04T14:26:05.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (06.04.20) Governor Asa Hutchinson provides an update to media on Thursday, June 4, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-03T18:36:39.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.3.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.03.20) Governor Asa Hutchinson provides an update to media on Wednesday, June 3, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-03T18:02:11.000Z": "LIVE: Governor Hutchinson discusses the unified law enforcement response to protect peaceful protests and last night's law enforcement work. (6.3.20) LIVE: Governor Hutchinson to Discuss Unified Law Enforcement Response... Governor Asa Hutchinson will hold a news conference to discuss the unified law enforcement response to protect peaceful protests and last night's law enforce... youtube.com", "2020-06-03T17:16:19.000Z": "I'm holding a news conference at 1:00 pm to discuss the unified law enforcement response to protect peaceful protests and last night's law enforcement work. LIVE: Governor Hutchinson to Discuss Unified Law Enforcement Response... Governor Asa Hutchinson will hold a news conference to discuss the unified law enforcement response to protect peaceful protests and last night's law enforce... youtube.com", "2020-06-03T14:33:04.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson to Discuss Unified Law Enforcement Response... Governor Asa Hutchinson will hold a news conference to discuss the unified law enforcement response to protect peaceful protests and last night's law enforce... youtube.com", "2020-06-02T22:19:46.000Z": "Congratulations to @ARDeptofAgricul Secretary Wes Ward, on his selection as President of the Southern Association of Secretaries of Agriculture. Sec. Ward has done great work for Arkansas and I'm excited to see other states recognize his work. Quote Tweet TalkBusinessArkansas @TBArkansas Arkansas Secretary of Agriculture Wes Ward was elected president of the Southern Association of State Departments of Agriculture (SASDA) for 2020-21 during its annual conference held virtually on M... https:// talkbusiness.net/2020/06/wes-wa rd-elected-president-of-southern-associa ", "2020-06-02T18:30:29.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (6.2.20): LIVE: Governor Hutchinson Provides COVID-19 Update (06.02.20) Governor Asa Hutchinson will provide an update to media this afternoon, Tuesday, June 2, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-02T15:41:38.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (06.02.20) Governor Asa Hutchinson will provide an update to media this afternoon, Tuesday, June 2, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-02T14:17:27.000Z": "At 10:30am I'll testify in front of @energycommerce to discuss Arkansas's response to COVID-19. I'll be joined by @govwhitmer and @govofco & I look forward to highlighting the targeted action we have taken in Arkansas to fight this invisible enemy. https:// youtu.be/h_fZ8ky5Fdo", "2020-06-01T21:00:28.000Z": "LIVE: Governor Hutchinson Addresses Recent Protests in Arkansas and Across the Nation (6.1.20): LIVE: Gov. Hutchinson to Hold a News Conference on Recent Protests in... Governor Asa Hutchinson will hold a news conference at 4 p.m. today to discuss the weekend protests in Arkansas and across the nation. youtube.com", "2020-06-01T20:17:03.000Z": "I'm holding a news conference at 4:00pm regarding recent protests in Arkansas and across the Nation. You can watch here: LIVE: Gov. Hutchinson to Hold a News Conference on Recent Protests in... Governor Asa Hutchinson will hold a news conference at 4 p.m. today to discuss the weekend protests in Arkansas and across the nation. youtube.com", "2020-06-01T18:09:48.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update from Rogers (6.1.20): LIVE: Governor Hutchinson Provides COVID-19 Update from Rogers... Governor Asa Hutchinson will provide an update to media in Rogers on Monday, June 1, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-06-01T15:21:36.000Z": "I'm holding a news conference in Rogers at 1:00pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update from Rogers... Governor Asa Hutchinson will provide an update to media in Rogers on Monday, June 1, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-31T16:44:29.000Z": "It is important that voices be heard to express hurt, anger, and frustration about this injustice. (2/3)", "2020-05-31T16:44:28.000Z": "Last night, a diverse group of Arkansans gathered in downtown Little Rock for what started out as a peaceful protest. They expressed justifiable outrage to the oppressive treatment of African Americans in the case of George Floyd & too many other cases across the country. (1/3)", "2020-05-31T13:00:01.000Z": "Have a great Sunday.", "2020-05-31T03:01:22.000Z": "So many respectful protests today for the right reason; but destruction of property is not acceptable. I have directed the State Police to work with local law enforcement to stop the damage to the Capitol.  The National Guard will be available as well.", "2020-05-29T20:16:25.000Z": "Today, I announced the creation of the Governor's Technical Advisory Board to make recommendations on technology that can be used to combat COVID-19. Dr. Austin Porter of the Department of Health is leading this taskforce, & I am thankful for his service. https:// governor.arkansas.gov/news-media/press-releases/governor-announces-new-covid-19-advisory-board-to-review-testing-contact ", "2020-05-29T18:35:22.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (5.29.20): LIVE: Governor Hutchinson Provides COVID-19 Update (05.29.20) Governor Asa Hutchinson will provide an update to media on Friday, May 29, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-29T15:53:51.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.29.20) Governor Asa Hutchinson will provide an update to media on Friday, May 29, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-28T20:42:46.000Z": "I was able to stop by the Division of Workforce Services office in Jonesboro yesterday to thank the DWS employees for their hard work in assisting Arkansans. I am thankful for the work of DWS employees across Arkansas during this unprecedented time.", "2020-05-28T18:32:54.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (5.28.20): LIVE: Governor Hutchinson Provides COVID-19 Update (05.28.20) Governor Asa Hutchinson will provide an update to media on Thursday, May 28, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-28T16:09:43.000Z": "I provided the daily COVID-19 Update yesterday from Jonesboro. I am thankful for the work Mayor Harold Perrin and other local leaders have done in response to COVID-19 and in response to the March tornado that tore through the heart of the city.", "2020-05-28T14:01:46.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.28.20) Governor Asa Hutchinson will provide an update to media on Thursday, May 28, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-27T18:35:21.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update from Jonesboro (5.27.20): LIVE: Governor Hutchinson Provides COVID-19 Update from Jonesboro... Governor Asa Hutchinson will provide an update to media in Jonesboro on Wednesday, May 27, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-27T14:48:33.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update from Jonesboro... Governor Asa Hutchinson will provide an update to media in Jonesboro on Wednesday, May 27, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-27T00:02:29.000Z": "I will be appointing Dr. Jose Romero, Chief Medical Officer at the Arkansas Department of Health and Infectious Disease Specialist, to serve as interim Secretary as we continue to battle COVID-19 in Arkansas.", "2020-05-27T00:02:28.000Z": "Today I announced Dr. Nate Smith, Secretary of Health, will be leaving the Department of Health for the CDC Aug. 28. His measured leadership during the COVID-19 crisis has been outstanding, & I'm thankful for his service to Arkansas over the past 7 years. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-announces-dr-nate-smith-moving-to-cdc-appoints-dr-jose ", "2020-05-26T18:30:32.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (5.26.20): LIVE: Governor Hutchinson Provides COVID-19 Update (05.26.20) Governor Asa Hutchinson will provide an update to media this afternoon, Tuesday, May 26, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-26T15:28:57.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.26.20) Governor Asa Hutchinson will provide an update to media this afternoon, Tuesday, May 26, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-25T18:56:22.000Z": "I was honored to remember those Arkansans who have given their lives in defense of our country as I attended the Wreath Laying Ceremony at the Arkansas Veterans Cemetery this morning. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-delivers-memorial-day-address ", "2020-05-25T14:59:09.000Z": "LIVE: Governor Hutchinson Attends Memorial Day Wreath Laying Ceremony at North Little Rock Veterans Cemetery (5.25.20): LIVE: Governor Hutchinson at Memorial Day Wreath Laying Ceremony Governor Asa Hutchinson speaks at the Memorial Day Wreath Laying Ceremony at the Arkansas State Veterans Cemetery in North Little Rock. youtube.com", "2020-05-25T13:23:29.000Z": "Today we honor those members of the United States Armed Forces who have given their lives in defense of our country. May we always remember the sacrifice they made for the freedoms we enjoy.", "2020-05-24T14:09:37.000Z": "I'm saddened to hear of the passing of Eddie Sutton. We are grateful for his remarkable leadership at the University of Arkansas. Coach Sutton forever changed the game of basketball and his legacy will live on for years to come. Our prayers are with his family and friends.", "2020-05-24T13:00:00.000Z": "Have a blessed Sunday.", "2020-05-22T16:33:58.000Z": "EXCLUSIVE: Chris will be joined by Arkansas Governor Asa Hutchinson as Arkansas moves forward with broad re-opening of its businesses. Check your local listings. #FNS  #FOXNews", "2020-05-23T21:08:01.000Z": "When I announced our plans to complete 60,000 COVID-19 tests for the month of May, we knew it would be a challenge. But, because of testing sites like the one I visited this morning at St. Mark's Baptist Church, we are on track to reach that goal.", "2020-05-23T18:30:52.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (5.23.20): LIVE: Governor Hutchinson Provides COVID-19 Update (05.23.20) Governor Asa Hutchinson will provide an update to media this afternoon, Saturday, May 23, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-23T16:27:39.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.23.20) Governor Asa Hutchinson will provide an update to media this afternoon, Saturday, May 23, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-23T15:00:01.000Z": "Congratulations to Jack Norris of @RHS_Mounties and Amanda Mei Thomsen of @FayettevilleHS for their selection as 2020 U.S. Presidential Scholars. Also, Brooke Avery Bradford of @ClintonHighSch3 was selected as 1 of 20 U.S. Presidential Scholars in Career and Technical Education.", "2020-05-22T18:29:57.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (5.22.20): LIVE: Governor Hutchinson Provides COVID-19 Update (05.22.20) Governor Asa Hutchinson will provide an update to media this afternoon, Friday, May 22, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-22T14:46:06.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.22.20) Governor Asa Hutchinson will provide an update to media this afternoon, Friday, May 22, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-22T01:06:55.000Z": "I was honored to be at the White House yesterday with @GovLauraKelly to discuss the impact of COVID-19 in each of our states. I'm thankful for @realDonaldTrump Administration's work and look forward to our continued partnership. \n\n-Official White House Photo by Shealah Craighead", "2020-05-22T00:48:03.000Z": "(1/4) Today I announced the dates and directives for some community and school sponsored team sports effective June 1st. This does not apply to collegiate or professional level sports as that will be considered at a later time. - https:// healthy.arkansas.gov/images/uploads /pdf/directiveteam_sports.pdf ", "2020-05-22T00:34:11.000Z": "(2/4) Regarding summer day camps the directive, effective May 18, is intended to cover organized, daytime group activities for children that may be outdoors or indoors, including vacation bible school, band camps, and arts camps. - https:// healthy.arkansas.gov/images/uploads /pdf/directive_covid_summer_day_camps.pdf ", "2020-05-22T00:33:54.000Z": "(3/4) As it relates to residential or overnight camps we recommend, effective May 21, that all camps follow the directives established by @ADHPIO . - https:// healthy.arkansas.gov/images/uploads /pdf/directive_overnight_camps.pdf ", "2020-05-22T00:33:33.000Z": "(4/4) Finally, all types of recreational pools can open to their patrons on May 22 if they meet the following requirements. Facilities can begin today to contact their local health units to facilitate opening. - https:// healthy.arkansas.gov/images/uploads /pdf/PoolRecreationalDirectiveFinal5.8.20.pdf ", "2020-05-21T18:28:52.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (5.21.20): LIVE: Governor Hutchinson Provides COVID-19 Update (05.21.20) Governor Asa Hutchinson will provide an update to media this afternoon, Thursday, May 21, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-21T00:52:09.000Z": "Appreciative of the meeting today with @realDonaldTrump to highlight Arkansas's growing economy and to urge the extension of deadlines on the PPP small business loans.", "2020-05-21T00:37:57.000Z": "Thanks for remembering Trevor. Grateful for his sacrifice and service. Quote Tweet Capitol View @CapitolViewAR We want to honor and remember \nMarine LCpl Trevor Andrew Roberts \nthis Memorial Day. #ARHonortheFallen He is @JimHendren1 cousin's son and @AsaHutchinson grandnephew\nThank you for your sacrifice for our freedom.", "2020-05-19T23:12:29.000Z": "Yesterday I announced that bars which are associated with and are located within restaurant facilities are approved to open today. Free standing bars which are not associated with restaurants should be ready to open next Tuesday, May 26th.", "2020-05-19T18:33:08.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (5.19.20): LIVE: Governor Hutchinson Provides COVID-19 Update (05.19.20) Governor Asa Hutchinson will provide an update to media on Tuesday, May 19, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-18T18:32:10.000Z": "LIVE: Governor Hutchinson provides COVID-19 update (5.18.20): LIVE: Governor Hutchinson Provides COVID-19 Update from Forrest City... Governor Asa Hutchinson will provide an update to media in Forrest City on Monday, May 18, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-18T17:03:53.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update from Forrest City... Governor Asa Hutchinson will provide an update to media in Forrest City on Monday, May 18, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-17T13:18:58.000Z": "Have a blessed Sunday!", "2020-05-16T20:44:29.000Z": "Thank you to all the brave men and women in the armed forces for your courage, honor and patriotism to our great country. May God grant you and your loved ones peace during this Armed Forces Day!", "2020-05-16T18:35:03.000Z": "LIVE: Governor Hutchinson provides COVID-19 update (5.16.20): LIVE: Governor Hutchinson Provides COVID-19 Update (05.16.20) Governor Asa Hutchinson will provide an update to media on Saturday, May 16, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-16T17:55:16.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.16.20) Governor Asa Hutchinson will provide an update to media on Saturday, May 16, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-16T01:13:41.000Z": "In case you missed it here is my interview with @cspan last night. https:// c-span.org/video/?472094- 1/covid-19-arkansas ", "2020-05-16T01:08:11.000Z": "In case you missed it here is my interview with @washingtonpost earlier this week. Leadership During Crisis: A Conversation with Gov. Asa Hutchinson Arkansas Gov. Asa Hutchinson (R) joined Washington Post national political reporter Robert Costa to discuss the impact of the coronavirus pandemic in his states. washingtonpost.com", "2020-05-16T00:19:38.000Z": "Starting Monday, May 18th all retailers are open with phase I restrictions specific to their industry under @ADHPIO guidelines. As we move towards next phases I encourage everyone to continue the basic safety measures to keep everyone safe while Arkansas is ready for business.", "2020-05-15T18:34:33.000Z": "LIVE: Governor Hutchinson provides COVID-19 update (5.15.20): LIVE: Governor Hutchinson Provides COVID-19 Update (05.15.20) Governor Asa Hutchinson will provide an update to media on Friday, May 15, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-15T17:15:40.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.15.20) Governor Asa Hutchinson will provide an update to media on Friday, May 15, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-14T23:11:16.000Z": "Special thanks to @BlueAngels for flying over Little Rock and putting on a great demonstration for those working in response to COVID-19! Thank you for your service! Quote Tweet Blue Angels @BlueAngels Thank you again to all the healthcare workers, first responders and essential personnel! \n\nHere are photos from today's #Nashville and #LittleRock flyovers! #AmericaStrong  #InThisTogether  #HealthcareHeroes", "2020-05-14T18:33:02.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (5.14.20): LIVE: Governor Hutchinson Provides COVID-19 Update (05.14.20) Governor Asa Hutchinson will provide an update to media on Thursday, May 14, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-14T16:38:11.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.14.20) Governor Asa Hutchinson will provide an update to media on Thursday, May 14, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-14T00:47:44.000Z": "I am truly grateful for the compassion and support that health care workers give to those in care every day and especially during this pandemic. During this National Hospital Week I encourage everyone to recognize them for their work to keep us safe and healthy", "2020-05-14T00:20:20.000Z": "In an effort to help reach our goal of 60,000 tests per month, Community Health Centers of Arkansas @chc_ar is pledging 2000 tests a week in needed areas. Thank you for your commitment to ensure more Arkansans have access to testing resources during this time.", "2020-05-13T00:57:56.000Z": "Trader Joe's is being a great example for businesses that are following the health and safety guidelines to minimize the spread of COVID-19. I've seen reports of social distancing, hand sanitizing stations and virtually everyone in the store had a mask. Great Work Trader Joes!", "2020-05-13T00:27:06.000Z": "I'm honored to proclaim this National Police Week and to designate May 15th Peace Officers Memorial Day. Let us remember the service and sacrifice of those who have lost their lives and those who continue to put their lives on the line for our communities. May God bless you all.", "2020-05-13T00:08:25.000Z": "It was exciting to talk investment in Arkansas and the great partnership between India and US. Quote Tweet Taranjit Singh Sandhu @SandhuTaranjitS A pleasure to interact with Governor @AsaHutchinson . Had a fruitful exchange on opportunities for trade and investments. Look forward to working together to strengthen Arkansas-India economic partnership.", "2020-05-12T18:35:27.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update (5.12.20): LIVE: Governor Hutchinson Provides COVID-19 Update (05.12.20) Governor Asa Hutchinson will provide an update to media this afternoon regarding Arkansas's COVID-19 response. youtube.com", "2020-05-12T17:40:28.000Z": "I'm holding a news conference at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.12.20) Governor Asa Hutchinson will provide an update to media this afternoon regarding Arkansas's COVID-19 response. youtube.com", "2020-05-12T00:36:19.000Z": "Great to be with @Matt_J_Shepherd in El Dorado. Exciting to see everyone so united and upbeat about future opportunities. Quote Tweet Matthew J. Shepherd @AR_HouseSpeaker Thank you Governor @AsaHutchinson for accepting my invitation to give your daily update from my hometown of El Dorado. \nI agree with your observation, that despite set-backs there is commitment, diversity, and strength in the economy of El Dorado and South Arkansas.", "2020-05-11T18:33:01.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update From El Dorado: LIVE: Governor Hutchinson Provides COVID-19 Update From El Dorado... Governor Asa Hutchinson will provide an update to media in El Dorado on Monday, May 11, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-11T17:17:13.000Z": "I'm holding a news conference in El Dorado at 1:30pm to provide a COVID-19 update. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update From El Dorado... Governor Asa Hutchinson will provide an update to media in El Dorado on Monday, May 11, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-10T13:58:44.000Z": "Happy Mother's Day!", "2020-05-09T22:56:58.000Z": "Today was a perfect day for a flyover to honor our frontline workers across the state. Thank you Steuart Walton for leading this tribute and for your leadership on our AR Economic Recovery Task Force. Quote Tweet NWADemGaz Photos @NWADemGazPhotos Look to the skies, Arkansas. Steuart Walton is leading a formation of WWII warbirds on a 15-city flyover tour to honor those who have died from #Covid19 and healthcare workers on the front lines. Gallery: http:// nwamedia.photoshelter.com/gallery/Arkans as-Economic-Recovery-Flyover/G0000q0nolhFchI0/C0000VL1BAyBI6F8  Show this thread", "2020-05-08T23:50:46.000Z": "http:// arkansasready.com is a resource to help businesses  navigate the public health emergency. If you have questions about our recovery timeline, PPE, or recent announcements, be sure to check it out.", "2020-05-08T23:49:50.000Z": "More good news today. Recreational pools may resume limited operations on May 22nd under @ADHPIO guidelines. Additionally, this Monday, we will begin the next phase of elective surgeries, which will allow procedures that require hospital stays of up to 48 hours.", "2020-05-08T23:48:55.000Z": "", "2020-05-08T18:33:51.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (05.08.20) LIVE: Governor Hutchinson Provides COVID-19 Update (05.08.20) Governor Asa Hutchinson will provide an update to media on Friday, May 8, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-08T16:46:34.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.08.20) Governor Asa Hutchinson will provide an update to media on Friday, May 8, 2020, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-07T22:52:59.000Z": "Today I visited Texarkana to update media on our COVID response, meet with local leaders, & drop by Harvest Regional Food Bank. I appreciate all of the work that's being done for the people of Southwest Arkansas.", "2020-05-07T21:52:10.000Z": "(1/3) Today at my daily COVID update briefing, I announced that the state's 3 gaming casinos will open at 1:30pm on May 18. The casinos will open at 1/3 capacity and will enforce strict social distancing. This is another industry that we are able to safely reopen during Phase 1.", "2020-05-07T21:02:33.000Z": "This morning I joined pastors and leaders to pray for our state, our nation, and our world. On this National Day of Prayer, I hope you will join me in giving thanks for our many blessings and asking God for his wisdom, guidance, and healing.", "2020-05-07T16:21:43.000Z": "I'm holding a news conference from Texarkana at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update from Texarkana... Governor Asa Hutchinson will provide an update to media in Texarkana on Thursday, May 7, 2020, regarding Arkansas's (COVID-19) response. youtube.com", "2020-05-06T22:37:18.000Z": "In the past two days, the fastest rate of increase in our number of COVID cases has been amongst those who are 18-24 years & those over 65. As the weather improves, it can be tempting to neglect @ADHPIO guidance, but we must continue to wash hands & social distance.", "2020-05-06T22:06:22.000Z": "Arkansas is testing better than a number of our fellow southern states, but we continue working to increase our capacity. @CDCgov has committed to provide 90,000 kits and swabs for Arkansas's COVID testing in the month of May. We have set a goal to test 60,000 people this month.", "2020-05-06T21:42:32.000Z": "We rely heavily on our nurses, especially in the midst of this pandemic. Arkansas nurses do such an incredible job, and on this National Nurses Day, I'm pleased to recognize them for their tireless work for the people of this state. #ThankYouNurses", "2020-05-06T18:29:59.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (05.06.20) LIVE: Governor Hutchinson Provides COVID-19 Update (05.06.20) Governor Asa Hutchinson will provide an update to media on Wednesday, May 6, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-06T17:21:56.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.06.20) Governor Asa Hutchinson will provide an update to media on Wednesday, May 6, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-05T22:00:00.000Z": "Danville High made it to the top 25 in the Vans Custom Culture Shoe Contest! The winning school will receive $50k for its art program. Check out what the Danville Little Johns designed & vote every day thru May15. Choose Physical Shoes. Good Luck Danville! http:// vans.com/customculture", "2020-05-05T21:42:27.000Z": "I've extended our COVID public health & disaster emergency for another 45days. Every industry sector in AR has been affected by the crisis. It's important that we continue to support & protect our industries & people until the threat is no longer imminent. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-extends-public-health-emergency-in-arkansas ", "2020-05-05T21:15:37.000Z": "Great teachers inspire, & I believe Arkansas has some of the world's greatest. On this National Teacher Day, we applaud our educators' hard work & dedication. I have declared this Teacher Appreciation Week in AR to celebrate you & thank you for all you do. https:// governor.arkansas.gov/images/uploads /proclamations/200504_Teacher_Appreciation_Week.pdf ", "2020-05-05T18:32:42.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (05.05.20) LIVE: Governor Hutchinson Provides COVID-19 Update (05.05.20) Governor Asa Hutchinson will provide an update to media on Tuesday, May 5, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-05T15:24:58.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.05.20) Governor Asa Hutchinson will provide an update to media on Tuesday, May 5, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-04T23:28:05.000Z": "Our faith community has been supportive of efforts to fight COVID, but we all miss in-person fellowship. While many churches will continue to meet remotely, we did present guidance to give houses of worship options as they minister to their congregations: https:// healthy.arkansas.gov/programs-servi ces/topics/covid-19-guidance-for-faith-based-organizations ", "2020-05-04T21:15:58.000Z": "(2/2) Businesses in every industry sector may be eligible for a Ready for Business grant. At least 75% of funding will be reserved for businesses w/ <50 employees & at least 15% of recipients will be minority- & women-owned businesses. Apply between 8am tomorrow & 6pm Wednesday.", "2020-05-04T21:15:24.000Z": "(1/2) The legislature has approved $55M in funding for the Arkansas Ready for Business Grant Program-a resource to help businesses get back on their feet & provide them assistance to ensure the highest health & safety standards for employees & customers. https:// arkansasedc.com/covid19", "2020-05-04T18:31:33.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (05.04.20) LIVE: Governor Hutchinson Provides COVID-19 Update (05.04.20) Governor Asa Hutchinson will provide an update to media on Monday, May 4, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-04T16:17:42.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.04.20) Governor Asa Hutchinson will provide an update to media on Monday, May 4, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-03T16:58:26.000Z": "Earlier, I took a socially distanced photo with Adolf, one of our Capitol policemen. Even in uncertain times, Arkansas law enforcement officers work hard to keep Arkansans safe.", "2020-05-03T13:00:00.000Z": "", "2020-05-02T22:02:33.000Z": "Today is the Arkansas Derby, a great tradition in our state. Although the derby is certainly operating differently this year, it remains a source of Arkansas pride. I'm wearing my @OaklawnRacing face mask to wish them well on their big day.", "2020-05-02T21:22:54.000Z": "Arkansas is taking steps to prepare for whatever the future may hold. We are increasing our contact tracing capacity, strengthening ADH infrastructure, & wearing masks. We also have shipments of PPE arriving each week to help ensure health care workers have an adequate supply.", "2020-05-02T18:31:07.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (05.02.20) LIVE: Governor Hutchinson Provides COVID-19 Update (05.02.20) Governor Asa Hutchinson will provide an update to media on Saturday, May 2, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-02T17:12:33.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (05.02.20) Governor Asa Hutchinson will provide an update to media on Saturday, May 2, regarding Arkansas's COVID-19 response. youtube.com", "2020-05-01T22:03:36.000Z": "(2/2) We've all felt the absence of these services recently, & professionals are eager to resume their work. I have great confidence that our stylists & other professionals will work hard to protect themselves & their clients & still provide the highest quality of service.", "2020-05-01T22:03:21.000Z": "(1/2) Today I announced that barber, cosmetology, massage therapy, body art, & medical spa services may resume operations on May 6 under guidelines that require pre-screening, use of gloves, face masks, & social distancing, & prohibit walk-in appointments. https:// governor.arkansas.gov/news-media/press-releases/barber-cosmetology-massage-therapy-body-art-and-medical-spa-services-may-re ", "2020-05-01T18:33:00.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (05.01.20) LIVE: Governor Hutchinson Provides COVID-19 Update (05.01.20) Governor Asa Hutchinson will provide an update to media on Friday, May 1, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-30T18:37:05.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (04.30.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.30.20) Governor Asa Hutchinson will provide an update to media on Thursday, April 30, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-30T18:01:35.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.30.20) Governor Asa Hutchinson will provide an update to media on Thursday, April 30, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-29T22:37:39.000Z": "Restaurants in AR may resume limited (33%) dine-in services on May 11 under guidelines that require daily health screening of staff, use of masks & gloves, and strict social distancing. This is a significant but cautious step on the path back to normalcy. https:// governor.arkansas.gov/news-media/press-releases/limited-dine-in-restaurant-service-may-resume-may-11-governor-announces ", "2020-04-29T18:30:41.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (04.29.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.29.20) Governor Asa Hutchinson will provide an update to media on Wednesday, April 29, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-29T17:23:50.000Z": "The Wabbots, a robotics team from Our Lady of Holy Souls' middle school, built an artificial leg for a stuffed animal to demonstrate progress in robotics for prosthetics. They created a video about their design & won 1st place in a renown national robotics tournament. Congrats!", "2020-04-29T16:43:06.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.29.20) Governor Asa Hutchinson will provide an update to media on Wednesday, April 29, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-28T22:30:35.000Z": ". @ARStatePark will begin a limited reopening of some facilities for Arkansas residents starting May 1. I am pleased that we can give Arkansans the opportunity to get out of their homes to safely enjoy our natural resources again. https:// governor.arkansas.gov/news-media/press-releases/state-parks-lifting-some-restrictions-for-arkansas-residents-governor-annou ", "2020-04-28T22:04:02.000Z": "SIG SAUER was one of the six prospective companies I called on my first day as Governor, & it has continued to be a great partner to the state since then. Today, I was pleased to hear that @sigsauerinc in Jacksonville has donated 2,000 KN95 masks to support @arfoodbank .", "2020-04-28T18:30:45.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (04.28.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.28.20) Governor Asa Hutchinson provides an update to media on Tuesday, April 28, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-28T17:08:53.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.28.20) Governor Asa Hutchinson provides an update to media on Tuesday, April 28, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-27T22:00:38.000Z": "The White House recommended that states & regions satisfy certain gating criteria, such as case trends, hospital trends, and symptom trends, before entering into phased opening. Based on that criteria, Arkansas's trajectory is on the right track.", "2020-04-27T21:05:36.000Z": "I want to thank @Walmart & Quest Diagnostic for opening a drive-thru COVID testing site in Central AR for symptomatic Arkansans, and for health care workers & first responders. This increase in testing capacity enhances our gathering of data as we look to lift restrictions in AR.", "2020-04-27T20:37:54.000Z": "Last week, we encouraged all symptomatic Arkansans to get tested over the weekend. Thanks to your response & the partnership of our hospitals & testing sites, we exceeded our goal & conducted >1,500 tests each day. This gives us a more accurate sampling of COVID numbers in AR.", "2020-04-27T17:00:57.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (04.27.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.27.20) Governor Asa Hutchinson provides an update to media on Monday, April 27, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-27T15:24:23.000Z": "I'm holding a news conference at noon today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.27.20) Governor Asa Hutchinson provides an update to media on Monday, April 27, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-26T13:00:00.000Z": "Have a safe Sunday.", "2020-04-25T23:36:49.000Z": "(2/2) @ArkansasEd will begin assessing ideas for alternative graduation ceremonies as school districts around the state plan creative nontraditional events to honor 2020 graduates.", "2020-04-25T23:36:32.000Z": "(1/2) I have a granddaughter who is a senior, so I understand that families want to celebrate graduation with a large ceremony. But it's a risk when thousands gather, so we won't be able to have traditional graduation ceremonies this year before July 1.", "2020-04-25T21:56:40.000Z": "The Arkansas Surge Campaign continues through today. If you think you have symptoms of COVID-19, don't wait. Get tested.", "2020-04-25T18:32:08.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (04.25.20) LIVE: Governor Hutchinson, Secretary Key Provides COVID-19 Update... Governor Asa Hutchinson and Secretary of the Department of Education Johnny Key provide an update to media on Saturday, April 25, regarding Arkansas's COVID-... youtube.com", "2020-04-25T16:05:35.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson, Secretary Key Provides COVID-19 Update... Governor Asa Hutchinson and Secretary of the Department of Education Johnny Key provide an update to media on Saturday, April 25, regarding Arkansas's COVID-... youtube.com", "2020-04-25T00:29:03.000Z": "(2/2) Today I approved an additional $1 million from the Quick Action Closing Fund to cover approximately 100 additional businesses that didn't receive loans from the initial bridge-loan funding.", "2020-04-25T00:28:49.000Z": "(1/2) @ArkansasEDC has approved $5 million in bridge loans for struggling Arkansas businesses. These 246 loans have retained nearly 3,500 Arkansas jobs.", "2020-04-25T00:12:00.000Z": "Today I announced that certain dental procedures in Arkansas can resume on May 18 subject to protective guidelines to be developed.", "2020-04-25T00:09:02.000Z": "I have declared 11 counties disaster areas in the wake of the severe storms and tornadoes on April 12, 2020. The eleven counties are Arkansas, Bradley, Cleveland, Dallas, Drew, Grant, Hot Spring, Jefferson, Lincoln, Ouachita, and Phillips. https:// governor.arkansas.gov/images/uploads /proclamations/DR_20-09._.pdf ", "2020-04-24T20:01:12.000Z": "WWII Veteran Louis Strickland is 100 years old today. He fought at Normandy. His daughter & fellow vets at the Arkansas State Veterans Home threw a party today, but his daughter & family couldn't attend because of COVID restrictions. Happy Birthday, Louis! Thank you for serving.", "2020-04-24T18:35:19.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (04.24.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.24.20) Governor Asa Hutchinson provides an update to media on Friday, April 24, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-24T16:18:16.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.24.20) Governor Asa Hutchinson provides an update to media on Friday, April 24, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-23T23:00:00.000Z": "More good news: A Girl Scout troop from @eastvillagek6 sold cookies earlier this year to raise funds for summer camp. When their summer plans were canceled, they used their cookie funds to partner with local restaurants to feed hospital staff & first responders in Central AR.", "2020-04-23T22:30:00.000Z": "Cynergy Cargo, which manufactures cargo trailers, announced today that it will build a plant in Crossett & hire 70 full-time employees including carpenters, welders, & electricians w/in 24 months. This is great news during this difficult time. Congratulations, Crossett!", "2020-04-23T22:01:20.000Z": "I encourage all who have a symptom such as fever or a cough, or who are short of breath, to get tested for COVID-19 within the next two days. If you think you have symptoms, don't wait - get tested.", "2020-04-23T18:31:19.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (04.23.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.23.20) Governor Asa Hutchinson provides an update to media on Thursday, April 23, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-23T15:39:28.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.23.20) Governor Asa Hutchinson provides an update to media on Thursday, April 23, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-23T14:20:05.000Z": "(3/3) The certain industries that will be permitted to reopen after May 4 will remain under Phase One guidelines that call for masks, social distancing, and limits on the size of gatherings. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-announces-certain-nonessential-procedures-may-resume ", "2020-04-23T14:19:29.000Z": "(2/3) We are moving in the right direction. If we stay on target, our desire and intent is to start lifting restrictions. But we are going to be closely watching public health data every day & taking it one step at a time.", "2020-04-23T14:19:08.000Z": "(1/3) Yesterday I announced that medical service providers can resume certain nonessential out-patient procedures on April 27. I have also established target dates to announce my decisions on lifting restrictions for restaurants, gyms, salons/barber shops, & places of worship.", "2020-04-22T18:31:46.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (04.22.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.22.20) Governor Asa Hutchinson provides an update to media on Wednesday, April 22, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-22T16:12:08.000Z": "With the outbreak of COVID-19, it is more important than ever for Arkansans to participate in the #2020Census . Responding to the Census is social-distancing friendly. You can submit your response by phone, by mail, or online at https:// my2020census.gov .", "2020-04-22T15:47:09.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.22.20) Governor Asa Hutchinson provides an update to media on Wednesday, April 22, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-21T22:35:00.000Z": "Today I announced the creation of the COVID-19 Testing Working Group to ensure Arkansas has adequate tests and processes in place as we pursue our public-health and economic recovery strategies. I joined the working group's first meeting this afternoon.", "2020-04-21T22:06:22.000Z": "Another story of Arkansans helping each other: A storm knocked out power in the town of Bearden last week, and employees of the Public Works Department in nearby Camden served 350 hot dogs to their neighbors. Then they cooked 150 hotdogs for 3 housing projects in Camden.", "2020-04-21T21:41:50.000Z": "The 27 members of my Economic Recovery Task Force, chaired by Steuart Walton, met for the 1st time today & started developing strategies to shift our economy out of low gear. Most joined the meeting via telephone. Those who met in person kept a socially appropriate distance.", "2020-04-21T18:31:04.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (04.21.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.21.20) Governor Asa Hutchinson provides an update to media on Tuesday, April 21, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-21T15:04:22.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.21.20) Governor Asa Hutchinson provides an update to media on Tuesday, April 21, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-20T23:27:30.000Z": "More proof that Arkansans care. 2 people in Jonesboro organized a free-pizza night to encourage their town, which had COVID plus a tornado. Word spread, donations arrived. It became Operation Full Belly: 2 weeks, 12 restaurants, 2,500 free suppers. That's the spirit of Arkansas.", "2020-04-20T22:55:23.000Z": "Great call with Secretary Esper today on @DeptofDefense continued National Guard support of our public health efforts. Quote Tweet Dr. Mark T. Esper @EsperDoD There is a strong partnership between the Council of Governors and the @DeptofDefense - especially in times of crisis. Thank you for the call today @AsaHutchinson and @GovHawaii .", "2020-04-20T22:36:38.000Z": "April is Child Abuse Prevention Month. Sadly, abuse doesn't stop because of this pandemic. Abuse may go unnoticed during this time because teachers & other caregivers aren't seeing the children regularly. If you suspect abuse, please report it to the hotline: 1-844-SAVE-A-CHILD.", "2020-04-20T15:09:59.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.20.20) Governor Asa Hutchinson provides an update to media on Monday, April 20, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-19T23:21:58.000Z": "I joined @foxandfriends this morning to discuss my newly formed economic recovery task force and the state's efforts to develop an industry-specific strategy for economic recovery that is consistent with public health guidance. Governor Asa Hutchinson on Fox and Friends Sunday - April 19, 2020 youtube.com", "2020-04-19T23:21:15.000Z": "I have asked the Parole Board & @ADCPIO to identify & review:\n-nonviolent offenders,\n-who are not sex offenders,\n-who are due for release within the next 6 months.\nThese individuals will be carefully evaluated & considered for release due to the public health emergency.", "2020-04-19T18:31:13.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (04.19.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.19.20) Governor Asa Hutchinson provides an update to media on Sunday, April 19, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-19T17:04:30.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.19.20) Governor Asa Hutchinson provides an update to media on Sunday, April 19, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-19T13:00:00.000Z": "", "2020-04-18T20:26:47.000Z": "(3/3) I also announced that I've allocated $10 million in community development block grants to be distributed to 27 AR hospitals. Each hospital will receive between $250k-$500k for hospital recovery. $500k will go to @uamshealth to support telehealth efforts in rural locations.", "2020-04-18T20:26:18.000Z": "(2/3) The task force will include 27 leaders from the private sector and public agencies who will examine the impact of COVID-19 on businesses and industries in the state. I have selected Steuart Walton as the chairman.", "2020-04-18T20:25:57.000Z": "(1/3) Today I created the Governor's Economic Recovery Task Force to develop an industry-specific strategy and make recommendations to me for Arkansas's economic recovery from the effects of COVID-19. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-announces-new-economic-recovery-task-force ", "2020-04-18T18:34:02.000Z": "LIVE: Governor Hutchinson provides COVID-19 update to media (04.18.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.18.20) Governor Asa Hutchinson provides an update to media on Saturday, April 18, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-18T14:42:39.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.18.20) Governor Asa Hutchinson provides an update to media on Saturday, April 18, regarding Arkansas's COVID-19 response. youtube.com", "2020-04-17T22:09:20.000Z": "I offer my condolences to the family of Chief Petty Officer Charles Robert Thacker, Jr., a Fort Smith native who lost his life to COVID-19. He was 42 years old. Grateful for his service to our country.", "2020-04-17T21:30:45.000Z": "The 1st report of the Governor's Medical Advisory Committee for Post-Peak COVID-19 Response prioritizes:\n-Restoring Arkansas's economy in a timely fashion\n-Protecting the most vulnerable\n-Maintaining adequate health care & public health capacity\n-Preventing resurgence of COVID-19", "2020-04-17T21:23:28.000Z": "(2/2) To achieve the goal of May 4, we have to continue mitigating the spread. Continue to follow the guidelines & directives for limited gatherings, use of masks, and social distancing.", "2020-04-17T21:22:50.000Z": "(1/2) I have carefully reviewed @realDonaldTrump 's model for reopening the economy & the first report of the Governor's Medical Advisory Committee for Post-Peak COVID-19 Response. Based on Arkansas's current public health data, we hope to begin lifting some restrictions by May 4.", "2020-04-17T18:31:41.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.17.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.17.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Friday, April 17, regarding A... youtube.com", "2020-04-17T17:17:55.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.17.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Friday, April 17, regarding A... youtube.com", "2020-04-17T15:47:39.000Z": "The @ARStatePark staff has created virtual backgrounds that will add Arkansas's outdoor beauty to your Zoom meetings. My chief of staff, @ARGovChief , brightened our staff meeting yesterday with daffodils from Historic Washington State Park. https:// arkansasstateparks.com/articles/zoom- backgrounds ", "2020-04-16T23:07:08.000Z": ". @ArkansasDWS has launched a new website that will provide regularly updated information regarding COVID-19-related unemployment benefits. http:// ARunemployment.com is a one-stop shop with answers to frequently-asked questions, a portal to file claims, & recent news articles.", "2020-04-16T22:47:34.000Z": "150,000 unemployment claims have been filed & processed in Arkansas since this public health crisis began - a massive increase compared to previous years, as shown in this graph. I appreciate the hard work of @ArkansasDWS to connect Arkansans with the resources they need.", "2020-04-16T22:30:13.000Z": "I will be meeting with the newly-formed Governor's Medical Advisory Committee for Post-Peak COVID-19 Response for the first time tomorrow to discuss our public health strategy for the future.", "2020-04-16T22:05:39.000Z": ". @EnviroTech_Chem converted its Helena Harbor operations and hired an additional 30 people to make and distribute hand sanitizer. Great news for Helena!", "2020-04-16T21:22:35.000Z": "Just finished a conference call with the President and his COVID-19 Task Force. He briefed the governors on \"Opening Up America Again.\" I will talk about what this means for Arkansas in tomorrow's daily update.", "2020-04-16T18:31:43.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.16.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.16.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Thursday, April 16, regarding... youtube.com", "2020-04-16T17:16:45.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.16.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Thursday, April 16, regarding... youtube.com", "2020-04-15T18:31:29.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.15.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.15.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, will provide an update to media this afternoon, Wednesday, A... youtube.com", "2020-04-15T16:23:24.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.15.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, will provide an update to media this afternoon, Wednesday, A... youtube.com", "2020-04-15T15:46:14.000Z": "My team continues to closely monitor the power outages caused by the severe storms that swept through the state earlier this week. More than 4,000 utility workers are engaged in Southeast Arkansas to restore power to thousands of Arkansas homes.", "2020-04-15T02:54:47.000Z": "Looking forward to joining @ShannonBream on @foxnewsnight to discuss Arkansas's COVID-19 response. Quote Tweet Fox News @ Night @foxnewsnight 11p w/ @ShannonBream John Yoo @BrettBruen  @AsaHutchinson  @peebles_don  @USCPrice 's Dr Sood @tracegallagher  @kevincorke  @RickLeventhal  @JacquiHeinrich  @ChadPergram", "2020-04-14T21:56:17.000Z": "Travel on our interstate highways has decreased by 55% from 1yr ago because of our efforts to temporarily discourage out-of-state travelers from visiting. Now, @myARDOT also uses message boards to alert travelers that recreational lodging for out-of-state visitors is prohibited.", "2020-04-14T21:20:10.000Z": "I issued 2 executive orders today. The 1st allows first responders & front-line health care workers to qualify for workers comp. if work responsibilities have caused them to contract COVID-19. The 2nd provides liability immunity for medical emergency responders during the crisis.", "2020-04-14T20:49:48.000Z": "As you can see in the attached graphs, Arkansas is flattening the curve, and our testing is increasing in capacity and performance. This is good news, but remember to keep social distancing, wearing masks, & washing hands to keep each other safe.", "2020-04-14T18:30:00.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.14.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.14.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Tuesday, April 14, regarding ... youtube.com", "2020-04-14T16:46:03.000Z": "It's important to be mindful of mental & emotional health along w/ physical health in this crisis. If you need counseling services during this public health emergency, there is assistance available. Call the @ARHumanServices mental health & services support line at 844-763-0198.", "2020-04-14T15:32:17.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.14.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Tuesday, April 14, regarding ... youtube.com", "2020-04-13T23:15:26.000Z": "I've formed a medical advisory committee to help guide public health strategy after Arkansas reaches the peak number of COVID-19 cases. The committee will examine protocols & make recommendations necessary to avoid a resurgence of COVID-19 after the peak. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-creates-committee-to-advise-on-states-post-peak-response-to-covid-19 ", "2020-04-13T18:31:28.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.13.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.13.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Monday, April 13, regarding A... youtube.com", "2020-04-13T17:28:25.000Z": "Something to bear in mind as we face COVID-19: if Arkansas's population isn't fully represented in the #2020Census , Arkansas hospital services & community health centers could be impacted negatively for the next decade. Make sure you are counted at https:// my2020census.gov .", "2020-04-12T21:32:19.000Z": "Today Arkansas received a wonderful Easter blessing. Six full FedEx trucks of masks, gloves, & gowns finally arrived. Grateful for the tireless work of @ArkansasGuard during this public health crisis & for the work of @AR_Emergencies & @uamshealth in procuring this critical PPE.", "2020-04-12T13:03:47.000Z": "He is risen!", "2020-04-11T21:28:10.000Z": "The First Lady and I wish you a happy Easter. This Easter celebration will be unusual- we will be celebrating online this year. But the meaning of Easter remains the same. It's a time of hope and new beginnings. Happy Easter!", "2020-04-11T15:59:25.000Z": "Eddie is a communication specialist at the Arkansas School for the Deaf, & for the past 2 years, he has also served as an ASL interpreter at my news conferences. Thankful for his selfless service to the people of AR & for always sporting colorful neckties. Sign language interpreter plays vital role bringing information to... The sign language interpreter for Governor Hutchinson's daily COVID-19 press conferences has made quite the splash on social media youtube.com", "2020-04-11T00:08:33.000Z": "There is another day coming.", "2020-04-10T23:17:31.000Z": "Thank you Dr. Fauci for recognizing our efforts to fight COVID-19 in Arkansas. Let's stay committed to win this fight.", "2020-04-10T18:30:07.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.10.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.10.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Friday, April 10, regarding A... youtube.com", "2020-04-09T23:42:12.000Z": "I will be live on @KARK4News / @FOX16News this evening to answer your questions about the COVID-19 public health emergency in Arkansas. I will answer as many questions as I can. Tune in to the virtual town hall at 7pm.", "2020-04-09T18:29:24.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.09.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.09.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Thursday, April 9, regarding ... youtube.com", "2020-04-09T17:52:44.000Z": "Lindsey's Hospitality House in North Little Rock is one of my favorite restaurants. Not only did I pick up some great barbecue for lunch today, I was also given a Lindsey's BBQ mask.", "2020-04-09T14:34:37.000Z": "I received reports from @AR_Emergencies that no lives were lost in last night's tornado in Poinsett County - something to be very grateful for. Local & state response teams are continuing to assess the damage and assist.", "2020-04-09T00:12:17.000Z": "\"Let me assure every Arkansan that we will do all that is necessary to protect life and to come out of this pandemic with our face looking into the bright days of our future.\"\n\nSee photos, video, & a transcript of today's State of the State Address: https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-delivers-state-of-the-state-address-to-the-92nd-general   #arpx", "2020-04-08T22:22:47.000Z": "Arkansas governors traditionally deliver a State of the State Address from the House Chamber. This year was certainly not traditional. In order to socially distance, I delivered the SOTS from the Senate Chamber while members of the House watched virtually from a nearby arena.", "2020-04-08T21:51:48.000Z": "I believe in Arkansas. We are resilient, courageous, & compassionate. Make no mistake - our eyes are fixed on our next opportunity, our next challenge, our next future victories before us. We will do what Americans & Arkansans have always done. We will be strong. We will prevail.", "2020-04-08T18:32:38.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.08.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.08.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Wednesday, April 8, regarding... youtube.com", "2020-04-08T17:29:29.000Z": "LIVE: Governor Hutchinson delivers the State of the State address to the 92nd General Assembly ahead of the fiscal session. Watch it here: LIVE: Governor Hutchinson Delivers State of the State Address to 92nd... Governor Asa Hutchinson will deliver the State of the State address to the 92nd General Assembly ahead of the fiscal session on Wednesday. In order to allow ... youtube.com", "2020-04-08T15:19:55.000Z": "I encourage Arkansans to join me in following @CDCgov guidelines & wearing a mask outside of your home to stop the spread. Jennifer is normally the 1st person guests greet when they visit my office. She showed off her mask today & encourages others to join. Get creative & share!", "2020-04-08T01:30:56.000Z": "Arkansans are taking steps to stop the spread by socially distancing, working remotely, and wearing protective gear. Your efforts are making a difference.", "2020-04-07T18:32:44.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.07.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.07.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Tuesday, April 7, regarding A... youtube.com", "2020-04-07T16:36:04.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.07.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Tuesday, April 7, regarding A... youtube.com", "2020-04-06T23:45:14.000Z": "Thank you to @uamshealth and @ADHPIO for supporting my request to send five ventilators to Louisiana. I just spoke to @LouisianaGov , and he thanked the people of Arkansas.", "2020-04-06T22:47:51.000Z": "I have extended the closure of public schools through the remainder of the 2019-20 school year. Schools will continue to provide alternative methods of instruction (AMI). This is necessary for our students to be safe but let's keep learning every day. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-announces-all-schools-to-remain-closed-for-remainder-of ", "2020-04-06T18:29:41.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.06.20) LIVE: Governor Hutchinson Provides COVID-19 Update (04.06.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Monday, April 6, regarding Ar... youtube.com", "2020-04-06T16:56:49.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update (04.06.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Monday, April 6, regarding Ar... youtube.com", "2020-04-05T23:17:06.000Z": "(3/3) I encourage all Arkansans to join me in following @CDCgov guidelines & wearing a mask when you are not able to socially distance. I'd like to thank Dr. Nate Smith's wife (also Dr. Smith) for crafting a mask for my use. Get creative & share your masks on social media.", "2020-04-05T23:12:41.000Z": "(2/3) I appreciate @EntergyArk for its support of the new COVID-19 Relief Fund and for announcing at today's news briefing that it will temporarily suspend disconnection of service for customers who can't pay.", "2020-04-05T23:11:03.000Z": "(1/3) This crisis has placed hardships on many, but Arkansans have been incredibly responsive to the needs of others. I'm pleased that the State is partnering w/ @SmartGivingAR to support the COVID-19 Relief Fund, a fund for Arkansans to donate & help their neighbors.", "2020-04-05T18:30:42.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.05.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.05.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Sunday, April 5, regarding Ar... youtube.com", "2020-04-05T15:32:30.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.05.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Sunday, April 5, regarding Ar... youtube.com", "2020-04-05T13:18:23.000Z": "", "2020-04-05T12:52:21.000Z": "Looking forward to talking about the incredible work of our Arkansas health care professionals on Meet the Press. Quote Tweet Meet the Press @MeetThePress COMING UP: @Surgeon_General Vice Admiral Jerome Adams, @GovInslee of Washington and Gov. @AsaHutchinson of Arkansas. Plus, an exclusive interview with Prime Minister of Italy, Giuseppe Conte on a special edition of #MTP . #IfItsSunday", "2020-04-04T21:59:58.000Z": "(2/2) I am grateful that Arkansans have taken extraordinary efforts to practice social distancing & flatten the curve. Each day, we evaluate new steps we can take. These measures will provide further protection for Arkansans as we prepare for the peak number of COVID-19 cases.", "2020-04-04T21:57:22.000Z": "(1/2) I have issued an executive order mandating new safety measures for commercial lodgings, short-term rentals, and other institutions and operations in order to protect public health during the COVID-19 crisis. https:// governor.arkansas.gov/images/uploads /executiveOrders/EO_20-13._.pdf ", "2020-04-04T18:31:11.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.04.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.04.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Saturday, April 4, regarding ... youtube.com", "2020-04-04T16:52:53.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.04.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Saturday, April 4, regarding ... youtube.com", "2020-04-03T21:33:28.000Z": "Arkansas's request for federal disaster assistance as a result of COVID-19 has now been approved. Thank you to our federal delegation, @fema , and @POTUS for approving this assistance.", "2020-04-03T18:27:37.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.03.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.03.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Friday, April 3, regarding Ar... youtube.com", "2020-04-03T16:30:00.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.03.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Friday, April 3, regarding Ar... youtube.com", "2020-04-02T18:29:01.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.02.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.02.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Thursday, April 2, regarding ... youtube.com", "2020-04-02T16:55:01.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.02.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Thursday, April 2, regarding ... youtube.com", "2020-04-02T16:44:26.000Z": "If you have #COVID19 related questions, I'll be participating in a nationwide #AsktheGovernor Twitter Q&A today at 5:00 .\n \nI'll answer as many questions as I can! Reply below or Tweet your question with #AskGovHutchinson Join the Q&A! Tweet #AskGovHutchinson", "2020-04-02T00:52:52.000Z": "Today I announced a partnership w/the state, Walmart & Quest Labs to start a pilot, drive-thru testing site in Benton County for first responders & health care workers who have symptoms. This will help expedite & make testing more accessible for those fighting this battle for us.", "2020-04-01T18:28:34.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.01.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.01.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media this on Wednesday, April 1, rega... youtube.com", "2020-04-01T16:30:00.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (04.01.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media this on Wednesday, April 1, rega... youtube.com", "2020-03-31T21:24:10.000Z": "(1/3) Our current number of COVID-19 cases in Arkansas is lower than the projected number of cases provided by @ADHPIO last week.", "2020-03-31T20:00:14.000Z": "If you suspect you have COVID-19 symptoms or have questions regarding children and COVID-19, call @ADHPIO at 1-800-803-7847 or @archildrens at 1-800-743-3616.", "2020-03-31T18:28:18.000Z": "LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.31.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.31.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Tuesday, March 31, regarding ... youtube.com", "2020-03-31T16:30:00.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.31.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Tuesday, March 31, regarding ... youtube.com", "2020-03-31T14:55:31.000Z": ". @ArkansasEd & @ArkansasPBS have partnered to support teachers, families, & students by providing Arkansas AMI Learning Guides associated with PBS educational programming. Learn more here: http:// dese.ade.arkansas.gov/divisions/lear ning-services/alternative-methods-of-instruction ", "2020-03-31T00:30:00.000Z": "We need more COVID-19 data in AR, and testing is what gives us that data. Increased testing is our immediate need right now, as well as protecting our health care workers. Our whole team, including myself, @AR_Emergencies , and @ADHPIO , is working on procuring add'l tests.", "2020-03-30T23:58:37.000Z": "On #NationalDoctorsDay , I commend the extraordinary physicians who protect & heal daily. We are especially grateful for your sacrifice during the COVID-19 outbreak. This year, we can support our doctors by social distancing while they save lives during this crisis.", "2020-03-30T23:25:52.000Z": "Thanks @DanyelleSargent & Coach @EricPMusselman for reminding us that if we want to get back to basketball we have to practice social distancing now. Quote Tweet Danyelle Musselman @DanyelleSargent Keep Arkansas safe! #StayHome", "2020-03-30T18:29:10.000Z": "LIVE: Governor Hutchinson To Provide COVID-19 Update to Media (03.30.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.30.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Monday, March 30, regarding A... youtube.com", "2020-03-30T16:30:11.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.30.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Monday, March 30, regarding A... youtube.com", "2020-03-30T01:52:37.000Z": "I met with the great county and local leadership who are responding quickly and efficiently to the disaster in Craighead County. Thank you for your recovery efforts on behalf of the people of Jonesboro.", "2020-03-29T23:41:15.000Z": "Today I took a flyover tour of Jonesboro to assess the damage from yesterday's tornado. I am grateful that no lives were lost.", "2020-03-29T18:30:15.000Z": "LIVE: Governor Hutchinson To Provide COVID-19 Update to Media (03.29.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.29.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Sunday, March 29, regarding A... youtube.com", "2020-03-29T16:30:00.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.29.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Sunday, March 29, regarding A... youtube.com", "2020-03-29T13:00:00.000Z": "Have a safe day.", "2020-03-28T23:01:15.000Z": "I have declared tomorrow a Special Day of Prayer in Arkansas. It is my hope that we can be unified in prayer thanking God for His love and mercy. We need His wisdom & guidance during this time of emergency. https:// governor.arkansas.gov/images/uploads /proclamations/20200329_2020_A_Special_Day_of_Prayer_in_Arkansas._.pdf ", "2020-03-28T22:47:52.000Z": "I am paying close attention to the report of a tornado hit in Jonesboro.  I know there is property damage.  Just praying all is safe.", "2020-03-28T21:30:00.000Z": "These are great guidelines from the Arkansas Department of Parks, Heritage and Tourism. We must do our part to flatten the curve. #COVID19Ark", "2020-03-28T20:00:00.000Z": "Uplift Arkansas provides free COVID-19 resources for businesses, organizations, and individuals. Thank you to @LittleRockCVB , @ManganHolcomb , & @WeAreTeamSI for creating this community website. https:// upliftarkansas.com", "2020-03-28T18:28:39.000Z": "LIVE: Governor Hutchinson To Provide COVID-19 Update to Media (03.28.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.28.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Saturday, March 28, regarding... youtube.com", "2020-03-28T16:30:05.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.28.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Saturday, March 28, regarding... youtube.com", "2020-03-28T05:51:27.000Z": "LIVE: Governor Hutchinson Signs Legislation Establishing the COVID-19 Rainy Day Fund LIVE: Governor Hutchinson Signs Legislation Establishing the COVID-19... Governor Asa Hutchinson will sign legislation establishing the COVID-19 Rainy Day Fund immediately after its passage around midnight, Saturday, March 28 youtube.com", "2020-03-28T01:30:28.000Z": "I will sign legislation establishing the COVID-19 Rainy Day Fund immediately upon its passage around midnight tonight. You can watch the bill signing here: LIVE: Governor Hutchinson Signs Legislation Establishing the COVID-19... Governor Asa Hutchinson will sign legislation establishing the COVID-19 Rainy Day Fund immediately after its passage around midnight, Saturday, March 28 youtube.com", "2020-03-27T23:22:57.000Z": "In this week's radio address, I share the initiatives we launched to assist rural hospitals and to provide more support for those on the front lines treating COVID-19 patients. Learn more here: https:// governor.arkansas.gov/news-media/weekly-address/new-initiatives-to-aid-in-the-covid-19-crisis ", "2020-03-27T21:58:05.000Z": "(1/3) I have authorized 10 additional National Guard personnel to assist the AR Dept. of Health and Corps of Engineers in expanding the capacity of hospital beds in AR. This is to get ahead of the curve & make sure we don't have to make difficult choices down the road.", "2020-03-27T18:29:45.000Z": "LIVE: Governor Hutchinson To Provide COVID-19 Update to Media (03.27.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.27.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Friday, March 27, regarding A... youtube.com", "2020-03-27T16:39:06.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.27.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Friday, March 27, regarding A... youtube.com", "2020-03-27T14:11:26.000Z": "It is important for Arkansans to stay home if possible as we work to mitigate the spread of COVID-19. When it is necessary to be out of the home, be mindful in public spaces. Keep a safe distance of at least six feet from others. There is no need for crowding.", "2020-03-26T23:30:00.000Z": "In order for us to be successful in Arkansas in slowing the upward trend line of COVID-19, the public needs to abide by the guidance of the Arkansas Department of Health. @ADHPIO guidelines and directives can be found here: https:// healthy.arkansas.gov/programs-servi ces/topics/novel-coronavirus ", "2020-03-26T22:59:24.000Z": "I am grateful for our federal delegation's communication & support they've given the state, especially through the passage of the COVID-19 relief bill by the Senate. This bill provides confidence to Arkansans whose employment or small business has been affected by the outbreak.", "2020-03-26T22:38:35.000Z": "(1/4) Today I announced a $116M initiative that directly addresses the COVID-19 crisis & the burden on our rural hospitals & other health care providers. This proposal will provide improved access to care for citizens & will keep providers open & their workforce employed.", "2020-03-26T19:30:35.000Z": "LIVE: Governor Hutchinson To Provide COVID-19 Update to Media (03.26.20) Governor Hutchinson Provides COVID-19 Update to Media (03.26.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Thursday, March 26, regarding... youtube.com", "2020-03-26T18:13:23.000Z": "LIVE: Gov. Hutchinson speaks to the 92nd General Assembly ahead of the First Extraordinary Session LIVE: Gov. Hutchinson speaks to the 92nd General Assembly ahead of... youtube.com", "2020-03-26T16:28:16.000Z": "I'm holding a news conference at 2:30pm today to provide an update on our COVID-19 response. You can watch here: Governor Hutchinson Provides COVID-19 Update to Media (03.26.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Thursday, March 26, regarding... youtube.com", "2020-03-26T16:26:29.000Z": "I am addressing a Special Session of the 92nd General Assembly at 1pm. You can watch here: LIVE: Gov. Hutchinson speaks to the 92nd General Assembly ahead of... youtube.com", "2020-03-26T14:57:23.000Z": "I am grateful for members of the @ArkansasGuard who have assisted @uamshealth in screening patients and administering COVID-19 tests through drive-through testing sites. They have responded faithfully to the urgent need of our state.", "2020-03-25T21:50:37.000Z": "(3/4) And the Medical Board also accelerated its overall licensing process, resulting in over 100 new AR physicians that have been licensed in the month of March.", "2020-03-25T21:50:36.000Z": "(1/4) I am grateful for our doctors, nurses, lab technicians, and other health care professionals who are on the front lines of COVID-19. As we look to the future, there will be fatigue among these individuals and an increased demand for more health care workers.", "2020-03-25T18:31:05.000Z": "LIVE: Governor Hutchinson To Provide COVID-19 Update to Media (03.25.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.25.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Wednesday, March 25, regardin... youtube.com", "2020-03-25T15:06:12.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.25.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Wednesday, March 25, regardin... youtube.com", "2020-03-24T23:06:32.000Z": "We have received 24 pallets of personal protective equipment (PPE)-including 27,800 N95 masks-from the Natl. Strategic Stockpile. Combined w/an order we'll receive this weekend, this will cover us for the next 60 days at the current usage rate. We will continue to buy PPE.", "2020-03-24T21:30:00.000Z": ". @ArkansasEDC has been working hard on behalf of Arkansas businesses during the COVID-19 outbreak. For COVID-19 business and employer resources, visit https:// arkansasedc.com/covid19 . COVID-19 Business and Employee Resources | Arkansas Economic Development Commission The Arkansas Economic Development Commission is committed to helping businesses and employees combat the effects of COVID-19. On this page, we have compiled a list of programs and resources, and we... arkansasedc.com", "2020-03-24T20:00:00.000Z": "I issued Executive Order 20-05 to leverage telehealth in AR during the COVID-19 outbreak. A doctor can now establish a new patient over the phone. This will minimize the number of sick patients in waiting rooms, which will mitigate the spread of the virus. https:// governor.arkansas.gov/images/uploads /executiveOrders/EO_20-05.pdf ", "2020-03-24T18:28:43.000Z": "LIVE: Governor Hutchinson To Provide COVID-19 Update to Media (03.24.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.24.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Tuesday, March 24, regarding ... youtube.com", "2020-03-24T15:32:33.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.24.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Tuesday, March 24, regarding ... youtube.com", "2020-03-24T15:06:05.000Z": "The Arkansas Blood Institute (ABI) is the only blood collection organization in central Arkansas, with donation centers in Little Rock, North Little Rock, and Hot Springs. If you are able, please consider donating blood as we face the COVID-19 public health emergency. @ABIblood", "2020-03-23T23:03:13.000Z": "(3/3) I applaud the General Assembly for their support and coordination on these tax and budget issues during this extraordinary time.", "2020-03-23T23:03:12.000Z": "(1/3) The tax filing & payment deadline for individuals in AR has been extended to July 15, mirroring the fed. govt.'s amended deadline. This will provide relief & consistency for individual taxpayers. The corporate filing deadline & est. payments timeline will remain the same.", "2020-03-23T19:29:01.000Z": "LIVE: Governor Hutchinson To Provide COVID-19 Update to Media (03.23.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.23.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Monday, March 23, regarding A... youtube.com", "2020-03-23T15:40:51.000Z": "I'm holding a news conference at 2:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.23.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Monday, March 23, regarding A... youtube.com", "2020-03-22T22:15:00.000Z": "Business owners should encourage employees to protect their personal health for themselves & for the safety of others. Clean surfaces that are frequently touched, avoid meetings that require close proximity, & post the symptoms of COVID-19: fever, cough, & shortness of breath.", "2020-03-22T21:32:10.000Z": "(3/4) We are looking at purchasing from the internatl. market, manufacturing our own, & working w/FEMA to release more of the strategic natl. stockpile to AR. While we're working very hard on this procurement, Arkansans need to understand the current challenge that we face.", "2020-03-22T21:32:09.000Z": "(1/4) As of today, there are a total of 165 positive COVID-19 cases in AR. This is the largest increase of cases in a 24-hour period that we've seen so far, and this number reflects the increase in @ADHPIO testing capacity.", "2020-03-22T20:00:00.000Z": "As COVID-19 spreads, it is important for Arkansans to follow the CDC's guidelines to keep themselves and their families safe. I encourage the people of our state to practice the CDC's current recommendation to avoid social gatherings of 10+ to help mitigate the virus.", "2020-03-22T18:29:06.000Z": "LIVE: Governor Hutchinson To Provide COVID-19 Update to Media (03.22.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.22.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Sunday, March 22, regarding A... youtube.com", "2020-03-22T16:30:12.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.22.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Sunday, March 22, regarding A... youtube.com", "2020-03-22T13:00:00.000Z": "Have a safe Sunday.", "2020-03-22T00:19:43.000Z": "(2/3) This outbreak endangers lives & strains our economy. Our goal is to flatten the peak & reduce the spread. We need the people's help. If we do what we are supposed to do in terms of social distancing & in taking care of ourselves & others, then we'll reduce the trend line.", "2020-03-22T00:19:42.000Z": "(1/3) Today I announced that we have a total of 118 positive COVID-19 cases in Arkansas. Based on what we have seen in other states, Arkansas is likely to reach the peak of COVID-19 cases in 6 to 8 weeks. We project that at the peak there will be 1,000 patients hospitalized.", "2020-03-21T21:55:25.000Z": "I encourage our churches, synagogues, and other places of worship to continue making good decisions while looking for creative ways to communicate their messages. They need to minister to their congregations with the same innovation we're asking of our businesses.", "2020-03-21T20:02:36.000Z": "Social distancing does not have to mean staying in the home, although this is an effective way to mitigate the spread of COVID-19. Walking, hiking, fishing, and other outdoor activities are all consistent with social distancing practices.", "2020-03-21T18:29:08.000Z": "LIVE: Governor Hutchinson To Provide COVID-19 Update to Media (03.21.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.21.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Saturday, March 21, regarding... youtube.com", "2020-03-21T16:29:57.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.21.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Saturday, March 21, regarding... youtube.com", "2020-03-21T14:45:00.000Z": "Protecting Arkansas's workforce and businesses from the COVID-19 outbreak is a top priority. Arkansas businesses can follow these guidelines to ensure the safety of their employees and the continuation of their operations.", "2020-03-21T13:11:04.000Z": "My team of top health care professionals from @ADHPIO , @uamshealth , and other agencies and hospitals from across the state have worked hard to keep me informed of the COVID-19 outbreak as it develops. Here are some guidelines Arkansans can follow to stay safe and healthy.", "2020-03-21T00:10:00.000Z": "According to the CDC, the best way to prevent the spread of COVID-19 is to avoid being exposed to the virus. COVID-19 is thought to spread between people within 6 feet of each other. By practicing social distancing, we can help mitigate the outbreak in our state.", "2020-03-20T23:40:00.000Z": "The rising number of positive COVID-19 cases in Arkansas reflect the additional testing capacity that we now have. We want that number to rise. That means we are locating & isolating cases across the state that otherwise would go undetected, which slows the spread of the virus.", "2020-03-20T23:06:45.000Z": "In this week's radio address, I discuss the executive order I issued last week to expand telemedicine during the COVID-19 outbreak. Learn more here: https:// governor.arkansas.gov/news-media/weekly-address/tough-time-calls-for-telemedicine ", "2020-03-20T21:54:00.000Z": "(2/5) Personal protective equipment (PPE) for our health care providers is a great need in our state. I have approved an advance of $30 million to help procure, in a greater quantity & at a lower cost, these materials that we will need in the future.", "2020-03-20T21:53:59.000Z": "(1/5) Today I announced that we currently have 96 positive cases of COVID-19 in AR. This affects 3 of our long-term care facilities:  Apple Creek Nursing & Rehab in Centerton, The Villages of General Baptist West in Pine Bluff, and Briarwood Nursing Home & Rehab in Little Rock.", "2020-03-20T21:27:36.000Z": "Doing my part to encourage social distancing within the community while supporting our local businesses in AR. Thanks to @TazikisCantrell for this wonderful carry-out lunch!", "2020-03-20T18:29:26.000Z": "LIVE: Governor Hutchinson To Provide COVID-19 Update to Media (03.20.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.20.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Friday, March 20, regarding A... youtube.com", "2020-03-20T18:07:28.000Z": "I'm holding a news conference at 1:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.20.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Friday, March 20, regarding A... youtube.com", "2020-03-20T01:00:00.000Z": "The American Red Cross is facing a blood shortage due to blood-drive cancellations across the nation. Maintaining our nation's blood supply is critical. If you are able, please consider donating blood.", "2020-03-20T00:30:00.000Z": "Last week, I activated the @ArkansasGuard to assist with our COVID-19 response. Grateful for the work that these National Guard medics from the 39th Infantry Brigade Combat Team are doing to support the @ADHPIO Emergency Operations Center and respond to questions from Arkansans.", "2020-03-20T00:00:00.000Z": "Thank you to each of the team members of the @ADHPIO Emergency Operations Center for your hard work and dedication during the COVID-19 outbreak. I commend your service to the people of Arkansas as we face this public health emergency.", "2020-03-19T23:09:00.000Z": "I joined a call with @POTUS , @VP and governors this afternoon on the COVID-19 pandemic. We are taking every step possible to make this national emergency as short-lived as possible.", "2020-03-19T19:28:20.000Z": "LIVE: Governor Hutchinson To Provide COVID-19 Update to Media Today (03.19.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media Today... Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Thursday, March 19, regarding... youtube.com", "2020-03-19T17:36:54.000Z": "I'm holding a news conference at 2:30pm today to provide an update on our COVID-19 response. You can watch here: LIVE: Governor Hutchinson Provides COVID-19 Update to Media Today... Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Thursday, March 19, regarding... youtube.com", "2020-03-19T01:47:01.000Z": "Today I announced relief for Arkansas businesses and child-care providers to ease COVID-19 impact. Read more here: https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-announces-relief-for-businesses-child-care-providers-to-ease-covid-19-impact ", "2020-03-18T18:30:46.000Z": "LIVE: Governor Hutchinson to Provide COVID-19 Update to Media (03.18.20) LIVE: Governor Hutchinson Provides COVID-19 Update to Media (03.18.20) Governor Asa Hutchinson provides an update to media this afternoon regarding Arkansas's COVID-19 response. The Governor also provided an update about the sta... youtube.com", "2020-03-17T15:30:02.000Z": "LIVE: Gov. Hutchinson, Sec. Smith To Provide Coronavirus Update to Media in West Memphis (03.17.20) LIVE: Gov. Hutchinson, Sec. Smith Provides Coronavirus Update to... Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Tuesday, March 17, regarding ... youtube.com", "2020-03-16T17:53:11.000Z": "(1/3) Today I announced that there are six new positive COVID-19 cases in Arkansas. Our strategy is to be ahead of the curve by mitigation, including closing school for two weeks and preventing large gatherings, while we don't have significant community spread in our state.", "2020-03-16T16:13:22.000Z": "I'm holding a news conference in Fayetteville at 11:15 a.m. to provide an update on our ongoing COVID-19 response. You can watch here: LIVE: Gov. Hutchinson, Sec. Smith Provides Coronavirus Update to... Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media Monday, March 16, regarding Arka... youtube.com", "2020-03-15T21:57:48.000Z": "(2/3) As this situation has developed, many parents and educators have shared their concerns regarding the safety of their students and communities with my office.", "2020-03-15T21:57:47.000Z": "(1/3) As of today, Arkansas has 16 confirmed cases of COVID-19. All the individuals are in isolation, and the situation is being monitored closely. I announced yesterday the activation of the Arkansas National Guard to assist in COVID-19 response.", "2020-03-15T18:29:35.000Z": "LIVE: Governor Hutchinson, Secretary Smith To Provide Coronavirus Update to Media (03.15.20) LIVE: Governor Hutchinson Provides Coronavirus Update to Media... Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Sunday, March 15, regarding A... youtube.com", "2020-03-15T13:00:00.000Z": "Have a great day.", "2020-03-15T01:34:52.000Z": "Thanks to all who have expressed concern about students in school.  My public health professionals are following the guidance of the US Center for Disease Control.  Wellbeing of students is always #1.", "2020-03-14T18:30:44.000Z": "LIVE: Daily Media Briefing on COVID-19 (03.14.20) LIVE: Daily Media Briefing on COVID-19 (03.14.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Saturday, March 14, regarding... youtube.com", "2020-03-13T23:06:00.000Z": "In this week's radio address, I commend the responsive and responsible leaders of Arkansas who have worked together to prevent the spread of COVID-19 in our state: https:// governor.arkansas.gov/news-media/weekly-address/protecting-against-covid-19 ", "2020-03-13T21:04:10.000Z": "Initial invitations to respond to the #2020Census will be delivered by mail between March 12-20. Once you receive your invitation, respond online, by phone, or by mail. An undercount of 1 percent, or just 30,000 people, could cost AR nearly a billion dollars over the next decade.", "2020-03-13T18:29:34.000Z": "LIVE: Daily Media Briefing on COVID-19 LIVE: Daily Media Briefing on COVID-19 (03.13.20) Governor Asa Hutchinson and Dr. Nathaniel Smith, Secretary of the Arkansas Department of Health, provides an update to media on Friday, March 13, regarding A... youtube.com", "2020-03-13T15:33:45.000Z": "Out of precaution, @ARSecofState has temporarily closed the AR State Capitol Building to visitors. The Governor's Office remains open, and our meetings continue. I will continue to work on behalf of the state as we prepare for the upcoming fiscal session of the General Assembly.", "2020-03-12T22:47:01.000Z": "(4/4) The AR Dept. of Health and @uamshealth are resources for information regarding COVID-19. For questions or if you show symptoms, call the 24/7 hotline at 1-800-803-7847 or visit https:// healthy.arkansas.gov or https:// uamshealth.com/healthnow/ to speak with a health care professional. HealthNow | UAMS Health uamshealth.com", "2020-03-12T22:47:00.000Z": "(1/4) Yesterday I announced the first presumptive positive case of COVID-19 in Arkansas. I learned today that we now have five additional presumptive positive cases in our state. This is not uncommon. We have seen the spread progress in a similar fashion in other states.", "2020-03-12T18:50:54.000Z": "LIVE: Governor Hutchinson, Secretary Smith to Provide Coronavirus Update to Media LIVE: Governor Hutchinson, Secretary Smith Provides Coronavirus... The Governor provides an update to media regarding Arkansas's coronavirus (COVID-19) response. Dr. Nathaniel Smith, Secretary of the Arkansas Department of H... youtube.com", "2020-03-12T18:33:21.000Z": "LIVE: Governor Hutchinson Announces Next State Highway Commissioner LIVE: Governor Hutchinson Announces Next State Highway Commissioner youtube.com", "2020-03-12T02:07:35.000Z": "(1/2) Today I confirmed the first presumptive positive case of coronavirus in Arkansas. I issued an executive order to declare a public health emergency to facilitate coordination & provide support to state agencies involved in response to the virus: https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-confirms-states-first-presumptive-positive-covid-19-cas ", "2020-03-11T15:33:01.000Z": "LIVE: Governor Hutchinson Holds Media Availability Following Cabinet Meeting LIVE: Governor Hutchinson Holds Media Availability Following Cabinet... youtube.com", "2020-03-11T14:02:56.000Z": "I am deeply saddened to learn that Hot Springs Police Officer Brent Scrimshire was shot and killed in the line of duty last night. Our prayers are with his family, the Hot Springs Police Department, and the entire law enforcement community.", "2020-03-09T21:05:19.000Z": "(3/5) Today, the state issued guidance to our long term care facilities to screen visitors. This is designed to reduce exposure of the elderly to those who may have traveled to impacted countries. Guidance for employers; EMS, travelers & educators is at https:// healthy.arkansas.gov/programs-servi ces/topics/novel-coronavirus  .", "2020-03-09T21:05:18.000Z": "(1/5) This is an update on our state's coordinated response to Coronavirus concerns:", "2020-03-08T13:00:01.000Z": "Have a good Sunday!", "2020-03-06T23:06:01.000Z": "Census Day is less than a month away, and in this week's radio address, I share some advice from the @uscensusbureau that will ensure we count as many people as possible. https:// governor.arkansas.gov/news-media/weekly-address/advice-for-the-census ", "2020-03-06T22:32:08.000Z": "A high school shot clock is something I have pushed for 4 years.  Starting at 6A will not put a cost burden on smaller schools. Thanks to AAA 6A principals for supporting. @sully7777 Quote Tweet Steve Sullivan @sully7777 Shot clock coming to Arkansas High School basketball.  Got word today that a 35-second shot clock has been approved for 6A conference games.  I love to see them make this move.  Will make for more entertaining end of game situations.", "2020-03-06T19:51:17.000Z": "Great to be at the Ag Hall of Fame luncheon where we saluted 6 new inductees.  I also got to see some dynamic new young 4-H leaders. Quote Tweet Ferndale International @AgWriterArk .... @AsaHutchinson  taking time for a group shot with our @Arkansas4h State Officers! (and ... @thecountyagent ) at #AAHOF2020", "2020-03-05T21:54:13.000Z": "Congratulations to the Nettleton STEAM program for receiving @CogniaOrg STEM certification. Nettleton is the first in Arkansas and one of only 200 programs worldwide to receive this certification. Wonderful work on this outstanding achievement!", "2020-03-04T15:04:41.000Z": "LIVE: Governor Hutchinson Presents Balanced Budget LIVE: Governor Hutchinson Presents Balanced Budget youtube.com", "2020-03-03T18:01:01.000Z": "Early this morning, the state of Arkansas lost Tom Schueck, a true leader in business and public service. Read my full statement here: https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-releases-statement-on-passing-of-tom-schueck ", "2020-03-03T14:31:23.000Z": "Today is Primary Election Day in Arkansas. I encourage each Arkansan to get out to the polls today. Go vote!", "2020-03-02T21:56:20.000Z": "Excited to proclaim March as Arkansas School Breakfast Month. Providing breakfast as part of the school day improves children's diets and allows students to begin their days focused and ready to learn. https:// governor.arkansas.gov/images/uploads /proclamations/200301_2020_Arkansas_School_Breakfast_Month.pdf ", "2020-03-02T20:15:45.000Z": "It was my honor to recognize Sergeant Major John Canley, Arkansas's own Medal of Honor recipient, at Saturday's @LittleRockMBB game. Thank you for your courageous service to our state and our nation.", "2020-03-01T14:00:00.000Z": "Have a great day.", "2020-02-29T14:00:00.000Z": "March 3 is Primary Election Day in Arkansas. In this week's radio address, to emphasize the importance of voting, I share the story of a recent election in Arkansas that demonstrates that every vote is important. https:// governor.arkansas.gov/news-media/weekly-address/every-vote-is-important ", "2020-02-28T21:44:25.000Z": "I spoke w/ @VP today & assured him that we're taking the #coronavirus threat seriously & are prepared in AR. I appreciate the Trump admin's aggressive approach to containing COVID-19 in the US & the VP's leadership & communication w/governors on this critical public health issue.", "2020-02-28T17:29:26.000Z": "LIVE: Governor Hutchinson Holds News Conference To Discuss State's Strategy to Address COVID-19 LIVE: Governor Hutchinson Holds News Conference To Discuss State's... Governor Asa Hutchinson holds a news conference with state public health and emergency management officials on Friday to discuss the state's preparation plan... youtube.com", "2020-02-27T23:26:30.000Z": "We have been preparing for the potential of #coronavirus in Arkansas. I will discuss the state's strategy to address COVID-19 at a news conference tomorrow. I have confidence in our preparation & am hopeful that our early planning will reduce understandable concerns of Arkansans.", "2020-02-27T17:33:39.000Z": "The @MilitaryOfficer", "2020-02-26T19:01:29.000Z": "In Arkansas we do not have sanctuary  cities so we do not lose federal dollars.  Nationally, this decision is good news because it strengthens cooperation between federal & local law enforcement. Quote Tweet The Hill @thehill #BREAKING : Federal appeals court rules Trump can withhold grants from \"sanctuary cities\" http:// hill.cm/mDuqJ65", "2020-02-25T22:45:00.000Z": "Delighted to attend the dedication of @ibclr 's new City Center. I look forward to the many ways this ministry facility will help serve the people of Little Rock.", "2020-02-25T21:11:01.000Z": "I asked the Terry Elementary students, \"how many of you know how to code?\" Just about every student raised their hand. #CSEd  #CSinAR  @codeorg", "2020-02-23T21:00:00.000Z": "Our students are AR's most valuable resource & are critical to the future of our state. During Gifted and Talented Awareness Week, we celebrate gifted & talented students & recognize our state's education system's important role in nurturing our students. https:// governor.arkansas.gov/images/uploads /proclamations/200223_2020_Gifted_and_Talented_Awareness_Week.pdf ", "2020-02-23T14:00:00.000Z": "Have a blessed day.", "2020-02-22T16:00:00.000Z": "On Civil Air Patrol Recognition Day, I commend the 260 adult & 203 cadet members of the AR Wing of Civil Air Patrol. These volunteers are tasked by @usairforce for inland search & rescue of downed aircraft & other disaster relief efforts in our state. https:// governor.arkansas.gov/images/uploads /proclamations/200127_2020_Civil_Air_Patrol_Recognition_Day._._.pdf ", "2020-02-22T14:00:00.000Z": "On the 288th anniversary of his birth, we recognize the leadership and wisdom of founding father and first President George Washington.", "2020-02-21T22:57:40.000Z": "In the past two years, the number of youths in state custody of the Division of Youth Services has declined by nearly thirty percent, and in this week's radio address, I discuss some of the changes we have made to achieve that. https:// governor.arkansas.gov/news-media/weekly-address/new-policies-positive-outcomes ", "2020-02-20T23:00:00.000Z": "The nursing profession celebrates a global milestone this year, as @WHO declares 2020 the International Year of the Nurse in honor of the 200th anniversary of the birth of Florence Nightingale. It was a pleasure to meet many of AR's nurses & nursing students today at the Capitol.", "2020-02-20T21:26:27.000Z": "\"You look at #reentry programs and those coming out of prison, it's the right thing to do at a human level for those that are genuinely seeking a second chance.\" Arkansas Gov. @AsaHutchinson", "2020-02-19T21:36:19.000Z": "At today's STEM Poster event, more than 140 undergraduate students from 17 Arkansas colleges & universities shared their scientific research in natural science & math at the Capitol. It was inspiring to see the work these bright young people have accomplished in STEM fields.", "2020-02-18T00:01:24.000Z": "Today we learned of the death of Arkansan and beloved writer Charles Portis. His classic works, including \"True Grit,\" will be remembered for generations to come.  And we are proud of the way he showcased our beautiful state.", "2020-02-17T18:30:15.000Z": "This is great news & the changes give a meaningful second chance opportunity for youth who are struggling.  We all need hope. State reduces count of kids in lockups by almost third The number of children in state lockups has dropped by nearly a third since July 2017, part of a push to overhaul a juvenile justice system that kept some in lockups longer than necessary, a state... arkansasonline.com", "2020-02-17T14:00:01.000Z": "Powerful words from former President Ronald Reagan's 1985 State of the Union address. Happy #PresidentsDay .", "2020-02-16T14:00:00.000Z": "Have a good Sunday.", "2020-02-14T22:16:17.000Z": "In this week's radio address, I share the story of Daisy Bates, a courageous woman whose leadership and determination continue to inspire us today. Learn more about her and her enormous contributions to the cause of equal rights here: https:// governor.arkansas.gov/news-media/weekly-address/the-home-of-history-makers ", "2020-02-14T20:49:08.000Z": "The newly created Occupational Licensing Sustainability Group will continue to streamline AR's licensing & certification process from last year's reforms. This is a significant step in pursuing @realDonaldTrump 's vision for regulatory reform. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-creates-working-group-to-continue-reform-of-occupational-licensing ", "2020-02-13T22:38:48.000Z": "It's always a pleasure to meet with our state's local leaders, who work daily on behalf of the people of Arkansas by serving our communities. Thank you for inviting me to speak with you at today's Arkansas Municipal League Winter Conference!", "2020-02-13T02:45:49.000Z": "I like it when Arkansas gets an \"A\" on broadband deployment policy.  Much more to do but I  appreciate the General Assembly supporting our rural internet initiative. Quote Tweet R Street Institute @RSI Check out our 2019 Broadband Scorecard Report http:// bit.ly/3by4iZv  @tstruble  @jeffreywestling cc @dougducey  @GovRonDeSantis  @GovEvers  @GovMikeDeWine  @AsaHutchinson  @GovPritzker  A grade: Arizona, Wisconsin, Florida, Ohio, Arkansas, Illinois D grade: Montana", "2020-02-13T00:15:00.000Z": "At yesterday's CTE Day at the Capitol, I discussed the importance of career & technical education to AR & met several bright students from across the state who are learning skills that will help them pursue future careers in industries such as computer science, welding & nursing.", "2020-02-12T23:39:04.000Z": "Wise words from former President Abraham Lincoln on what would have been his 211th birthday.", "2020-02-11T22:38:12.000Z": "Great to be on @FoxFriendsFirst this morning to discuss the partnerships with governors and @realDonaldTrump 's administration in reducing regulations and in increasing state flexibility. Quote Tweet Fox & Friends First @FoxFriendsFirst \"A GREAT AMERICAN COMEBACK\" - President Trump touts his economy at his business session with U.S. governors. Arkansas Gov. @AsaHutchinson , was there, and explains what those accomplishments mean in states across the nation. http:// ow.ly/HBix50yjhD7", "2020-02-10T19:32:03.000Z": "I am grateful for law enforcement who respond to calls to assure public safety.   They put their own safety at risk. Very thankful. Quote Tweet AR State Police @ARStatePolice The prayers of the ASP are with the 2 Forrest City officers that were injured this morning in a shooting at Walmart. \n\nThe ASP Criminal Investigation Division has been requested to conduct an investigation of the incident. Please stay away from the area if at all possible.", "2020-02-09T20:26:06.000Z": "It's exciting to share with my fellow governors what Arkansas is doing to help ex-offenders re-enter the workforce. Quote Tweet NGA @NatlGovsAssoc Whenever you look at re-entry for formally incarcerated individuals it is not only the human thing to do -- everyone deserves a second chance -- but a practical thing to do as well because employers need trained workers. - AR Gov. @AsaHutchinson  #WeTheStates", "2020-02-09T14:00:00.000Z": "Have a wonderful day.", "2020-02-08T22:16:24.000Z": "We had a productive meeting of the Council of Governors yesterday in DC. I'm honored to represent AR as co-chair of this important state-federal partnership to strengthen our homeland defenses and keep our citizens safe.", "2020-02-07T03:45:58.000Z": "Our tech talent in Arkansas leads to Affirma Consulting expanding its Fayetteville office - #Success Affirma to expand its Fayetteville office - Talk Business & Politics Affirma opened an office in Fayetteville in July and has already outgrown the space, according to founder Mark Mason. The company is adding a new office in the UARK complex... talkbusiness.net", "2020-02-06T17:52:17.000Z": "Former President Ronald Reagan appointed me as U.S. Attorney for the Western District of Arkansas in 1982 when I was 31 years old. Today is the 109th anniversary of his birth and the 16th since his passing. I am honored to have served under his leadership. https:// governor.arkansas.gov/images/uploads /proclamations/200206_2020_Ronald_Reagan_Day_in_Arkansas.pdf ", "2020-02-05T23:00:47.000Z": "\"Rescuers: Portraits of Moral Courage in the Holocaust\" is a compelling exhibit by photographer Gay Block that tells stories of those who saved lives during one of history's darkest moments. I was honored to attend the opening of this collection, on display now at @ArkansasTech .", "2020-02-05T22:20:47.000Z": "It was great to be                                in #I Russellville with ... @BreanneDavis  \nto enjoy some good bbq and talk about the importance of rural broadband.", "2020-02-05T15:51:57.000Z": "I'm grateful for the well-deserved recognition given in the #SOTU to our men & women serving in the military overseas. I'm glad they were honored last night by @realDonaldTrump .", "2020-02-04T22:35:45.000Z": "Today I spoke to the Benton Chamber of Commerce & learned more about the future Saline County Career & Technical Center, which will help students learn skills to set them apart in the workforce. Great work being done in central AR!", "2020-02-03T23:20:38.000Z": "What a privilege for @ARFirstLady & me to host the 70th anniversary celebration of the Arkansas Governor's Mansion. Thank you to former Governors Jim Guy Tucker, @GovMikeHuckabee , & @MikeBeebeAR , First Ladies, & their family members for joining us on this special day.", "2020-02-03T16:39:59.000Z": "LIVE: 70th Anniversary Celebration of the Governor's Mansion Press Conference LIVE: 70th Anniversary Celebration of the Governor's Mansion Press... youtube.com", "2020-02-02T14:00:01.000Z": "Have a blessed Sunday!", "2020-02-01T13:49:43.000Z": "February is Career and Technical Education Month in Arkansas. Career and technical education offers students the opportunity to gain the academic, technical, and employability skills necessary for true career readiness. https:// governor.arkansas.gov/images/uploads /proclamations/200201_2020_Career_and_Technical_Education_Month_in_Arkansas.pdf ", "2020-01-31T23:32:47.000Z": "In Arkansas, we have fostered an environment for tech innovation and recognize that the commercialization of technology drives our global economies. NWA @PlugandPlayTC inspires and supports innovation across our state and region.", "2020-01-31T23:19:11.000Z": "In this week's radio address, I share my thoughts about Forrest Wood, one of Arkansas's great outdoorsmen, conservationists, and entrepreneurs. Learn about his life and legacy here: https:// governor.arkansas.gov/news-media/weekly-address/forrest-l-wood-an-exceptional-arkansan ", "2020-01-31T20:20:54.000Z": "Coming out of a technology summit at Crystal Bridges, I got to meet some bright young students from ... @lrsd  with two wonderful teachers", "2020-01-31T15:43:51.000Z": "Don't miss your opportunity to be part of our 2020 Summer Internship Program. Click here to apply by March 1, 2020: https:// governor.arkansas.gov/our-office/int ernships ", "2020-01-31T04:12:01.000Z": "Pretty excited for Asa4 tonight. Quote Tweet Drury Panthers @drurypanthers MBB- @DruryMBB defeats Missouri S&T. Asa Hutchison leads DU with 19 points and 9 rebounds", "2020-01-30T22:05:16.000Z": "Today, I visited Helena-West Helena to announce that @WaltonFamilyFdn awarded @ARStatePark a $20 million matching grant to complete the construction of the Delta Heritage Trail over the next 5 yrs. I've visited the trail many times & always admire the rich beauty of the AR Delta.", "2020-01-29T22:56:54.000Z": "Three Arkansans were chosen to be Presidential Leadership Scholars: @GayatriAgnew of @Walmart , Chris Jones of @ARInnovationHub , & Alison Williams, my Chief of Staff. Thank you for your dedication to our state. Congratulations on this well-deserved honor! @PLSprogram", "2020-01-29T21:34:38.000Z": "3 yrs ago, I met w/POTUS, @VP & other Admin. officials to emphasize the importance of North American trade for AR. They told me they would work hard to open our trade markets & increase fairness. By signing #USMCA , @realDonaldTrump has delivered on that promise. Good news for AR!", "2020-01-29T21:20:05.000Z": "Thank you to the Newport Chamber of Commerce for inviting me to speak at your 84th annual banquet last night. Your hard work and dedication to the Jackson County community help boost economic growth not only in Northeast Arkansas but also throughout the state.", "2020-01-27T23:30:00.000Z": "Seventy-five years ago today, the prisoners of Auschwitz were liberated. On #InternationalHolocaustRemembranceDay , we continue to tell these stories as a means to understand the past and ensure that these atrocities never happen again.", "2020-01-27T22:06:13.000Z": "Today is Firefighter Recognition Day in Arkansas. We honor the men and women who make extraordinary sacrifices while in the line of duty on behalf of the citizens of our state, and I commend the courageous service of each of our state's firefighters. https:// governor.arkansas.gov/images/uploads /proclamations/200127_2020_Firefighter_Recognition_Day_%28Arkansas_Code%29.pdf ", "2020-01-26T22:30:00.000Z": "Best of luck to each of the Arkansans nominated for 2020 #Grammys tonight! @AshleyMcBryde  @ShayMooney  @PhillipSweet  @zachwilliams", "2020-01-26T21:00:00.000Z": "Every student in Arkansas should have access to an effective education. During Arkansas School Choice Week, we celebrate that our state is home to many different types of public and nonpublic schools, as well as families who educate their children at home. https:// governor.arkansas.gov/images/uploads /proclamations/200126_2020_Arkansas_School_Choice_Week.pdf ", "2020-01-26T14:00:00.000Z": "Have a great day.", "2020-01-25T17:59:08.000Z": "It was my honor to know Forrest Wood, and his passing is a deeply sad moment for our entire state. Forrest embodied the best of Arkansas. Read my full statement here: https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-issues-statement-on-the-passing-of-forrest-wood ", "2020-01-25T14:00:00.000Z": "Arkansas high school students, the deadline to apply for the 2020 Governor's Young Artist Competition is February 7! Learn about this year's theme, \"The Home Within,\" and how to submit your artwork here: https:// friendsofthemansion.org", "2020-01-25T00:00:00.000Z": "In this week's radio address, I talk about the state Revenue Office's Skip the Trip at http:// MyDMV.arkansas.gov . Click here to learn more about the service that lets you conduct nearly all revenue business online: https:// governor.arkansas.gov/news-media/weekly-address/skip-the-trip ", "2020-01-24T23:15:00.000Z": "Honored to be in Lowell for the official grand opening of the first facility in the state to house both an @ARStatePolice headquarters and AR State Crime Lab. The lab reduces the backlog of cases at the crime lab in LR & helps better serve the people and ASP officers of NWA.", "2020-01-24T22:42:26.000Z": "Thank you to the @SpringdaleCofC for inviting me to speak at today's annual meeting. Great work being done in Northwest Arkansas!", "2020-01-21T02:41:27.000Z": "I'll be on @foxnewsnight w/ @ShannonBream at 10pm CT to discuss the news of the day. Tune in!", "2020-01-20T22:30:32.000Z": "At today's annual @MosaicTemplars MLK Challenge, our state's young people continued Dr. Martin Luther King, Jr.'s legacy through service. I commend these inspiring individuals for volunteering across Little Rock today.", "2020-01-20T16:38:04.000Z": "Today, we celebrate a true leader for justice and reflect on the courage, the life, and the legacy of Dr. Martin Luther King, Jr. It was an honor to speak at the #MLK Interfaith Prayer Breakfast this morning in celebration of Martin Luther King, Jr. Day.", "2020-01-20T00:00:59.000Z": "I was honored to speak today at the annual March for Life in Little Rock. I appreciate the many elected officials who turned out for this important event, and I am committed to stand for life.", "2020-01-19T14:00:00.000Z": "Have a wonderful Sunday.", "2020-01-17T23:34:29.000Z": "Today I had the privilege of speaking at the Arkansas No. 1 Bowie Knife dedication at @UAHopeTexarkana 's James Black School of Bladesmithing & Historic Trades. This knife holds an important place in Arkansas's history, and it was an honor to participate in its dedication.", "2020-01-17T23:07:54.000Z": "In this week's radio address, I discuss my decision to allow refugees from war-torn countries to relocate legally in Arkansas after they have been vetted and cleared by agencies of the United States: https:// governor.arkansas.gov/news-media/weekly-address/its-the-right-thing-to-do ", "2020-01-17T18:45:22.000Z": "Interested in joining my team this summer? The application for our 2020 Summer Internship Program is now open! Apply before March 1 for opportunities and experiences you won't forget! https:// governor.arkansas.gov/our-office/int ernships ", "2020-01-17T16:19:05.000Z": "As Governor of the Natural State and as a lifelong outdoorsman, I understand the importance of protecting our state's natural resources and beauty. Thank you to the Arkansas Association of Conservation Districts for its efforts to preserve our state's great outdoors.", "2020-01-17T14:03:42.000Z": "At yesterday's AR Counts Census Summit, I shared why participating in the #2020Census is so important-census figures are used to make decisions at every level of govt, including policy decisions & funding for public services like education, healthcare, & economic opportunity.", "2020-01-17T00:18:39.000Z": "Today I spoke with school leaders from across the state at @The_AAEA Superintendent Symposium in Little Rock. Thank you to each of these inspiring individuals for all they do on behalf of the students of Arkansas!", "2020-01-16T23:30:00.000Z": "I am pleased to hear that the Senate has passed #USMCA . The agreement allows the continuation of trade with customers in Mexico & Canada as well as the creation of new jobs & investment opportunities, which is great news for AR's manufacturers, agricultural producers, & workers.", "2020-01-16T22:49:43.000Z": "On #NationalReligiousFreedomDay , I am grateful to live in a country where we are free to worship how we choose. As Governor, I value the fundamental right of religious liberty.", "2020-01-15T19:31:15.000Z": "The Phase One trade deal with China is great news for AR's farmers, manufacturers, and businesses. Thank you to @realDonaldTrump for your leadership in securing this historic agreement.", "2020-01-14T19:34:54.000Z": "(3/3) I shared stories of 3 refugees now living in NWA. Homayoon Abdullah fled Afghanistan after yrs. of assisting US authorities in his country. Lusia Akilimali fled war-torn Congo & now works as a CNA at a sr. care facility. Monga Mukandama fled the Congo with a similar story.", "2020-01-14T19:34:52.000Z": "(1/3) Yesterday, I spoke to the General Assembly on accepting refugees into AR. We support border security & oppose illegal entry, but this is about those who lawfully come to America.", "2020-01-13T22:20:59.000Z": "Privileged to help cut the ribbon at today's opening of @BaptistHealthAR 's new Graduate Medical Education building in NLR. Through a partnership with @uamshealth , this building houses 24 new residency slots, with the plan to expand to 120 or more opportunities in the future.", "2020-01-12T21:00:07.000Z": "Good luck to Arkansas native Sofia Overton on @ABCSharkTank tonight! We are rooting for you back home! Quote Tweet Arkansas Economic Development Commission @ArkansasEDC Sofia Overton, the 14-year-old founder of Wise Pocket Products, is taking on @ABCSharkTank . She will be pitching her company, which produces a clothing line aimed at active kids who need more pockets. Good luck, Sofia! https:// bit.ly/2QgKLEp", "2020-01-12T14:00:00.000Z": "Have a blessed Sunday!", "2020-01-11T20:30:15.000Z": "I have declared a state of emergency to assist the crews working to restore power around the state. https:// governor.arkansas.gov/images/uploads /proclamations/DR_20-01.pdf ", "2020-01-11T15:00:39.000Z": "Our state & local emergency managers were busy last night responding to reports of storm damage.  7 tractor trailer rigs were blown over on I-40.  Over 40,000 without power.  Stay safe everyone & we appreciate the power crews still at work.", "2020-01-11T14:26:40.000Z": "Congratulations to @naomimeeks for being selected as the 2020 Arkansas Mother of the Year by @americanmothers ! Your unique story and dedication to your family is inspiring to all. https:// americanmothers.org/2020motherofth eyear/#jp-carousel-6205 ", "2020-01-10T23:13:30.000Z": "Great to speak with you today, @NWAGreg and @NWARusty . Thank you for having me. Quote Tweet NWA Democrat-Gazette @nwademgaz PODCAST: @AsaHutchinson stopped by the office to talk with @NWAGreg and @NWARusty about trade, a half-cent sales tax, what might be in store for him after he leaves office in 2023 and more. https:// nwaonline.com/news/2020/jan/ 10/podcast-arkansas-gov-asa-hutchinson/?utm_medium=social&utm_source=twitter_nwademgaz ", "2020-01-10T22:01:37.000Z": "I created the Arkansas Levee Task Force in June 2019 in response to last year's historic flooding. In this week's radio address, I discuss the recommendations that the Task Force submitted to me this week in its final report: https:// governor.arkansas.gov/news-media/weekly-address/the-final-report-of-the-arkansas-levee-task-force ", "2020-01-09T22:06:11.000Z": "On National #LawEnforcementAppreciationDay , I commend the law enforcement officers who protect us daily and remember those who sacrificed all in the line of duty. Thank you for your service.", "2020-01-08T22:50:13.000Z": "Today I was honored to help break ground on @mondegroup 's new project, Esplanade, a mixed-use housing development in NLR. The land it will be built on is one of the largest tracts of Opportunity Zone land purchased in AR to date. Great day for economic development in our state!", "2020-01-07T19:58:08.000Z": "LIVE: Arkansas Levee Task Force Presents Final Report to Governor Hutchinson LIVE: Arkansas Levee Task Force Presents Final Report to Governor... The Arkansas Levee Task Force will present findings from its final report to Governor Asa Hutchinson at a press conference this afternoon. youtube.com", "2020-01-05T18:15:54.000Z": "Great duck hunt this morning w/grandson Malcolm Wengel getting his first banded duck. From Manitoba to the Cache River bottoms this 11 year old mallard helps us understand & conserve migratory wetlands.", "2020-01-05T14:00:01.000Z": "Have a good day.", "2020-01-04T17:06:55.000Z": "It is nice for Arkansas and our educators to be recognized by http:// Code.org as a national leader and model in computer science education. Let's keep setting a high mark. Quote Tweet Code.org @codeorg Arkansas is a leader when it comes to implementing computer science in its schools thanks to the leadership of Gov. @AsaHutchinson and many others. Here's what other states can learn from Arkansas' incredible success! https:// buff.ly/35hf7vx", "2020-01-03T22:21:36.000Z": "Over the course of the past five years, we have reduced our state's income taxes by over $250 million. On New Year's Day, the first day of 2020, our top individual income tax rate was reduced again. Learn more in this week's radio address: https:// governor.arkansas.gov/news-media/weekly-address/a-new-year-a-new-tax-cut ", "2020-01-01T13:52:34.000Z": "Happy New Year!", "2019-12-30T15:30:18.000Z": "As Governor, I take my duty to ensure the safety of our citizens very seriously. Thank you to the Trump administration for enhanced security screenings for legal immigrants coming to the U.S. and for returning the State's role in refugee resettlement. NWA EDITORIAL: The welcome mat Gov. Asa Hutchinson make the right decision to continue allowing Arkansas organizations to accept refugees escaping persecution in other countries. nwaonline.com", "2019-12-29T14:00:00.000Z": "Have a wonderful day.", "2019-12-26T16:43:03.000Z": "There is some excitement in being Governor but nothing compares to the intensity in the kitchen on Christmas Day. My jalapeño duck poppers were a hit & a nice addition to all the fixings Susan made.  Wonderful to be home.", "2019-12-25T14:02:17.000Z": "Wishing you and your families a Merry Christmas!", "2019-12-23T22:41:05.000Z": "What a great Christmas present for Razorback fans!  An inspiring statement from @boyd_rakeem Quote Tweet Rakeem boyd ™ @boyd_rakeem #WPS", "2019-12-23T18:51:04.000Z": ". @ARFirstLady and I wish many joyous blessings to you and your families this Hanukkah!", "2019-12-23T16:24:02.000Z": "This was my fifth year to participate in the lighting of the Menorah. It was a blessing to celebrate the #FestivalofLights and take part in this special tradition last night. Wishing you and your families a happy #Hanukkah .", "2019-12-22T14:00:00.000Z": "Have a blessed Sunday.", "2019-12-22T03:04:50.000Z": "So proud of Coach Anderson and ASU Redwolves. #WolvesUp Quote Tweet Arkansas State Football @AStateFB Retweet The Win!\n\nTHE RED WOLVES ARE CAMELLIA BOWL CHAMPIONS!! #WolvesUp x #NOW", "2019-12-22T02:34:42.000Z": "Retweet The Win!\n\nTHE RED WOLVES ARE CAMELLIA BOWL CHAMPIONS!! #WolvesUp x #NOW", "2019-12-21T14:41:59.000Z": ". @ARFirstLady and I wish you and your families a merry Christmas and a blessed season this year.", "2019-12-20T22:41:31.000Z": "I recently spoke to the graduates of the 53rd class of the @arkansasguard Youth Challenge, and in this week's radio address, I talk about the ways this program teaches at-risk youth in our state the skills they need to succeed. https:// governor.arkansas.gov/news-media/weekly-address/challenging-arkansas-youth ", "2019-12-19T23:01:50.000Z": "Wishing @MissAmericaAR Darynne Dahlem the best of luck as she competes on @MissAmerica tonight. We are rooting for you back home in Arkansas!", "2019-12-19T18:28:24.000Z": "The @WhiteHouse Fellowship offers young leaders the opportunity to develop professional skills and gain practical experience working in the highest level of federal government. The deadline to apply to this prestigious fellowship is January 8, 2020! White House Fellows | The White House Founded in 1964 by Lyndon B. Johnson, the White House Fellows program is one of America's most prestigious programs for leadership and public service. Whit whitehouse.gov", "2019-12-17T23:38:35.000Z": "I enjoyed meeting with @realDonaldTrump and @VP on Monday to discuss our efforts to reduce red tape and increase access to occupational licenses in Arkansas. Thank you for your partnership.", "2019-12-17T18:33:11.000Z": "Last week our nation grieved over multiple horrific hate crimes. The attack on the Kosher food market that targeted and killed the Jewish store owners is one of them. AR is 1 of only 4 states without a hate crimes law. We need to change that.", "2019-12-15T16:45:37.000Z": "Have a great Sunday.", "2019-12-13T22:15:37.000Z": "Since 1955, the @ArkSchBdsAssn has provided resources, support, and advocacy for school boards across the state. It was a delight to be with you at today's annual conference to discuss the future of education in Arkansas.", "2019-12-11T21:27:58.000Z": "For 50 years, the Island of Hope Chapel at the Tucker Unit, Division of Correction has emphasized the importance of faith in the lives of prisoners. Thank you to the chaplains, volunteers, and employees at Tucker Unit for your dedication to changing lives.", "2019-12-10T23:26:05.000Z": "Over the past two years, the number of licensed mental health providers has increased by 9% in Arkansas. I am proud of the work of @ARHumanServices in increasing access to treatment and counseling to those with substance-abuse and mental-health issues in the state.", "2019-12-10T21:16:18.000Z": "Exciting day at the @BroylesAward ceremony! Five finalists from across the nation met in Little Rock to be recognized as college football's top assistant coaches & to support the mission of the @BroylesFdn : to provide support to Alzheimer's caregivers. Congrats @CoachJoeBrady !", "2019-12-10T19:12:53.000Z": "I had a wonderful time helping members of our state legislature hand out gifts to children at today's Christmas in the Capitol event. Thankful for the dedicated public servants in our legislature and @ARHumanServices DCFS for making the holiday bright for these children.", "2019-12-09T22:54:38.000Z": "The U.S. produces approx. 20 billion lbs. of rice annually, & AR is the #1 state in rice production, growing nearly 10 billion lbs. annually. Today I had the opportunity to thank U.S. rice producers for their contribution to our state & nation at @Think_rice 's Outlook Conference.", "2019-12-09T22:31:32.000Z": "Pleased to announce that @Structurlam is locating its first U.S. mass timber manufacturing plant in Conway. @Walmart will be using this timber product for its new Bentonville headquarters. Great news for Conway and our timber producers.", "2019-12-09T21:52:04.000Z": "I have ordered the U.S. flag & the state flag of Arkansas to fly at half-staff in tribute to the memory of Fayetteville Police Officer Stephen Carr. Officer Carr's bravery & actions are worthy of our remembrance. https:// governor.arkansas.gov/news-media/press-releases/half-staff-in-memory-of-fallen-fayetteville-police-officer-stephen-carr ", "2019-12-08T16:33:30.000Z": "I am deeply saddened to learn of the senseless killing of a City of Fayetteville police officer. Our prayers are with the officer's family, Chief Reynolds and our entire law enforcement community.", "2019-12-08T14:00:00.000Z": "Have a good day.", "2019-12-08T00:53:30.000Z": "Such a wonderful Christmas lighting ceremony at the State Capitol honoring our Gold Star families.", "2019-12-07T12:56:09.000Z": "Seventy-eight yrs ago there were 144 Arkansans serving at Pearl Harbor. 23 of them died aboard the USS Arizona. Our country unites on Natl Pearl Harbor Remembrance Day to remember & honor these brave American veterans who lost their lives on this \"date which will live in infamy.\"", "2019-12-07T00:06:12.000Z": "I am delighted to hear that two @ARHumanServices Div. of Youth Services students were awarded @VirtualArkansas 's Student of the Month certificate! @VirtualArkansas educates AR students through online courses, & it is wonderful to see these students recognized for their hard work.", "2019-12-06T21:58:42.000Z": "To kick off next week's Computer Science Week, we recognized these AR students who scored a 3, 4 or 5 on the rigorous @APforStudents Computer Science test & received college credit & a financial incentive as a reward for their hard work. I'm proud of your outstanding achievement!", "2019-12-06T19:58:45.000Z": "LIVE: Governor Hutchinson Makes Computer Science Education Announcement LIVE: Governor Hutchinson Makes Computer Science Education Announce... Governor Asa Hutchinson holds a news conference to make an announcement about the future of computer science education in Arkansas. youtube.com", "2019-12-06T15:34:34.000Z": "I have directed the state flag of Arkansas to be flown at half-staff in memory of Petty Officer John W. Craig, whose life was taken during the attack on Pearl Harbor on December 7, 1941. Petty Officer Craig will be laid to rest at home in Arkansas today. https:// governor.arkansas.gov/images/uploads /proclamations/191206_2019_John_W._Craig_Memorial_Day_in_Arkansas_.pdf ", "2019-12-05T23:04:47.000Z": "Best of luck to Fort Smith-native Brittany Allen as she competes on @ProjectRunway this season. Your home state is cheering you on! Quote Tweet Walton College @CheckoutWalton Apparel Alumna Brittany Allen One of 16 Selected to Compete on Bravo's Project Runway | University of Arkansas https:// shar.es/a3Xi0o", "2019-12-05T21:30:57.000Z": "Join us at the Governor's Mansion this Sunday to see this year's Christmas decorations and to donate gifts for Toys for Tots at our Christmas Open House! I am looking forward to meeting people from across the state.", "2019-12-05T17:10:50.000Z": "Congratulations to Dr. Justin Zhan of @UArkansas and Dr. Teresita Bellido of @uamshealth for being selected as the two newest @ARAllianceOrg Scholars. These talented scientists contribute to research and innovation in AR, and I am excited to see all that they will accomplish.", "2019-12-05T16:02:14.000Z": "LIVE: Arkansas Research Alliance Scholars Press Conference LIVE: Arkansas Research Alliance Scholars Press Conference youtube.com", "2019-12-05T15:52:59.000Z": "At yesterday's @ArFB Annual Convention, I announced my recommended increase of $1.8 million in sustained state funding for the @UArkansas Division of Agriculture, which would make a total of $3 million increase in its annual budget over last year. @AginArk  https:// arkansasonline.com/news/2019/dec/ 05/hutchinson-time-to-raise-state-ag-funds/?latest ", "2019-12-04T22:56:18.000Z": "Congratulations to Arkansas's @marybeth_music for advancing to the @NBCTheVoice semifinals! We are rooting for you back home. Tune in next Monday to show your support! Quote Tweet The Voice @NBCTheVoice And #TheVoice Instant Save winner is", "2019-12-04T18:10:49.000Z": "Excited that @reshmasaujani , founder and CEO of @GirlsWhoCode , will speak at @UArkansas tonight. In AR, the number of girls enrolled in #CSEd increased from 223 in 2014-15 to 2,852 this year thanks to key advocates, such as Reshma, who encourage women to pursue a career in CS.", "2019-12-04T15:44:34.000Z": "Wonderful to meet students from Hanamaki Higashi High School in Japan-including 20 members of their stellar baseball team-as they visit their Sister City School, Hot Springs Lakeside. Japan is Arkansas's top partner in foreign direct investment.", "2019-12-03T22:44:15.000Z": "Thank you to the Highland School fifth graders for your birthday wishes and for visiting me at the Capitol today!", "2019-12-03T20:40:12.000Z": "Great to be with @nprgreene this morning. Thanks for having me. Quote Tweet David Greene @nprgreene He played a central role in President Clinton's impeachment. Today, @AsaHutchinson says lawmakers again face a moment when \"a vote that you cast goes down in history.\" https:// npr.org/2019/12/03/784 357397/impeachment-probe-is-an-extraordinary-responsibility-hutchinson-says   @MorningEdition", "2019-12-02T22:57:52.000Z": "Thanks to the generous donations of the Anthony family and other sponsors, the @CHIStVincent Hot Springs Anthony Childbirth Center will be able to ensure that expectant mothers have a safe and healthy delivery in its newly remodeled facility with the latest technology.", "2019-12-01T21:13:33.000Z": "Have a great Sunday.", "2019-11-30T21:00:52.000Z": "Great win by SAU @MuleriderHoops against Missouri S&T.  There is some real talent in South Arkansas.  Fun to watch.  Congrats!", "2019-11-30T14:00:55.000Z": "Arkansas is a growing state because of the hard-working small business owners who live and work here. On Small Business Saturday, I am proud of the entrepreneurs who are taking risks to grow their business, create jobs, and support our communities.", "2019-11-28T14:22:13.000Z": "Have a wonderful Thanksgiving!", "2019-11-27T20:14:09.000Z": "In this week's radio address, I share the story of Henry C. Gibson, the Arkansan who patented the box turkey call that has helped hunters across the nation put Thanksgiving turkeys on the table since 1897. Learn more here: https:// governor.arkansas.gov/news-media/weekly-address/the-stradivarius-of-turkey-calls ", "2019-11-27T19:26:14.000Z": "The First Lady and I are very grateful for the Lord's many blessings. I hope each of you have a wonderful Thanksgiving. #arpxThankfulChallenge  @CapitolViewAR", "2019-11-26T22:35:56.000Z": "It's always nice to run into people touring the Arkansas State Capitol. Today I met two young men visiting from Texas over the holidays. I hope you enjoy your time in our beautiful Natural State.", "2019-11-26T20:24:54.000Z": "Arkansas ranks 3rd in the U.S. in turkey production, growing 31.5 million turkeys per year & supporting over 19,000 jobs in the state. Today I proclaimed Nov. 24-30 as Arkansas Turkey Week alongside my new friend Gertrude. I am thankful for all our farmers do for our state!", "2019-11-25T20:44:59.000Z": "Earlier this year, I invited a group of key leaders from Arkansas businesses, research universities, philanthropic organizations, and state agencies to form the Arkansas Innovation Council. I appreciate the hard work to increase the STEM research dollars that lead to tech jobs!", "2019-11-25T19:40:31.000Z": "This week is AR Duck Week. To kick off the season, Mal R. Duck & his friends from @Stuttgart_AR Chamber of Commerce, the Wings Over the Prairie Festival & World's Championship Duck Calling Contest visited the Capitol. And, yes, I will be duck hunting soon! https:// governor.arkansas.gov/images/uploads /proclamations/191123_2019_Arkansas_Duck_Week.pdf ", "2019-11-24T14:08:19.000Z": "Have a great day!", "2019-11-22T21:03:43.000Z": ". @usedgov has awarded AR a $38 million grant to improve literacy in the state. This federal grant rewards & acknowledges the progress we've made in education, & it also helps give the gift of reading to AR students. Learn more in this week's radio address: https:// governor.arkansas.gov/news-media/weekly-address/federal-grant-assists-with-the-gift-of-reading ", "2019-11-22T19:01:40.000Z": "AR leads the nation in rice production, growing approximately 50% of rice produced in the US. Thanks to the new trade agreement between the US and South Korea, AR rice producers will enjoy expanded opportunities in a broadened, international market. https:// ustr.gov/about-us/polic y-offices/press-office/press-releases/2019/november/united-states-and-south-korea ", "2019-11-22T16:22:43.000Z": "For 200 years, @ArkansasOnline has faithfully delivered the news to the people of Arkansas. Thank you to the Hussman family and to the paper's reporters, editors, photographers, and staff for your dedication to our state and your commitment to keeping our citizens informed.", "2019-11-18T22:47:12.000Z": "Express Rx has chosen to locate its corporate headquarters in LR creating new, high-paying jobs. Thanks to the commitment & efforts of Express Rx, @LRChamber & @ArkansasEDC , this company will continue its national reputation as a high-quality pharmaceutical retailer in our state.", "2019-11-17T14:30:04.000Z": "Have a wonderful day!", "2019-11-16T14:35:38.000Z": "Yesterday was a wild day at the Governor's Mansion! Not only did @ARFirstLady & I meet the @ColumbusZoo Cheetah Ambassador, but we also had the opportunity to help raise funds for the AR Zoological Foundation to benefit the @LittleRockZoo & for @CCFCheetah to #SavetheCheetah .", "2019-11-16T00:30:43.000Z": "The chance to renew Arkansas's half-cent sales tax to pay for highways, roads & bridges will be the most important issue on the ballot next year, & in this week's radio address, I discuss why I supported the legislation that gives the voter the final vote: https:// governor.arkansas.gov/news-media/weekly-address/for-better-safer-roads-in-arkansas ", "2019-11-15T22:46:04.000Z": "I was honored to recognize Sen. Jim Hendren as he retired from the AR Air Natl Guard as a Colonel. Jim was an Air Force fighter pilot. Throughout his life & career, he has served our state & nation w/distinction, loyalty & excellence. Congratulations & thank you for your service!", "2019-11-15T14:25:12.000Z": "The reopening of China's market to U.S. poultry & poultry products is wonderful news for AR farmers & for our state's economy. I appreciate the leadership of @USTradeRep Robert Lighthizer & @USDA Secretary Sonny Perdue in supporting AR's largest industry. American Poultry Farmers Regain Access to China (Washington, D.C., November 14, 2019) - United States Trade Representative Robert Lighthizer and U.S. Secretary of Agriculture Sonny Perdue released the following statement on China's decision to... usda.gov", "2019-11-14T20:30:59.000Z": "So proud and appreciative of all the teachers and staff in the LRSD who were in the classroom today teaching & serving the students.  A vast majority of teachers put the students first.  Thank you.", "2019-11-13T20:08:54.000Z": "Honored to serve as Chair of Southern Region Education Board and to speak about the importance of education to leaders from 16 states. Quote Tweet SREB @srebeducation SREB chair @AsaHutchinson , launches our Goals 2030 effort to help states improve education pre-K through Ph.D. Gov. Hutchinson cited Arkansas improvements in early reading, STEM and workforce education, and a higher ed funding model for more affordable college.", "2019-11-13T19:35:21.000Z": "The United States-Mexico-Canada Agreement is critical in advancing economic development and fostering new investment. #USMCA will allow AR agricultural producers to continue trade with our state's largest trading partners. I encourage Congress to ratify this agreement. #USMCAnow", "2019-11-12T18:19:24.000Z": "Today, we announced 125 new jobs and a $10 million investment in Eudora, Chicot County. The expansion of Superior Group Industries in South Arkansas is a reminder that our economic development work is ongoing in every part of the state.", "2019-11-11T20:56:29.000Z": "With its new patient tower, @FollowMercy Northwest Arkansas in Rogers is increasing access to health care & meeting the needs of the people of NWA. Mercy has also added eight new clinics to the region since 2017, providing expanded & enhanced health care services to our state.", "2019-11-11T17:32:59.000Z": "On this Veterans Day, we remember our nation's finest. I had the opportunity to meet some of Arkansas's heroes today at New Life Christian Church in Bella Vista. Thank you to our veterans, who have led the way in war and in peace, for your service and sacrifice.", "2019-11-10T14:02:10.000Z": "Have a blessed Sunday.", "2019-11-08T23:27:27.000Z": "It might be 3 am on the other side of world but what fun to watch grandson A4 and Drury Panthers win.  I love internet broadcasts. Quote Tweet Bentonville Basketball @WEAREBVILLE Congratulations to Tiger Alum Asa Hutchinson IV who today helped his @DruryMBB team to their opening day win by leading the team in scoring with 19 points. We are proud of you Asa!", "2019-11-08T21:20:18.000Z": "On #NationalSTEMDay , I am proud of Arkansas's students & teachers for their enthusiasm for STEM education. AR has the 2nd greatest percentage of high schools teaching computer science & one of the most rapid rates of growth in CS education in the nation. #CSforAR  #ARKidsCanCode", "2019-11-07T22:05:51.000Z": "LIVE: Governor Hutchinson Holds a Media Availability From Japan LIVE: Governor Hutchinson Holds a Media Availability From Japan youtube.com", "2019-11-06T00:08:47.000Z": "Captain Bo Felder was killed in action on April 24, 2004, while deployed in support of Operation Iraqi Freedom. Last week, part of Hwy 82 in his hometown of Lewisville was dedicated to commemorate his faithful service. We honor this Gold Star Family for their ongoing sacrifice.", "2019-11-04T21:12:44.000Z": "Natl. Veterans Small Business Week is an opportunity to recognize veterans not only for their bravery and commitment to serving our country, but also for their accomplishments upon returning home. I am proud of AR's service members' success in entrepreneurship. #VetBiz  @SBAgov", "2019-11-03T14:17:36.000Z": "Have a great day!", "2019-11-02T01:11:42.000Z": ". @ARFirstLady and I had the pleasure of hosting Belgian Ambassador Dirk Wouters and Katrin Van Bragt at the Governor's Mansion today. Thank you for talking trade, investments, and how we can do business together.", "2019-11-01T23:32:16.000Z": "Effective boards are created by dedicated, knowledgeable trustees. Each year, the @ArkHigherEd Trustees Conference helps new board members and long-serving trustees of public institutions strengthen the skills required to lead their institutions. Delighted to be with you today!", "2019-11-01T21:57:14.000Z": "Over the past 10 days, I announced 1,500 new jobs & more than $300M in investment in AR from DXC Technology, Nucor Corporation, HMS Manufacturing, & Risever. Learn more about these economic developments in this week's radio address: https:// governor.arkansas.gov/news-media/weekly-address/10-days-1500-jobs  1,500 jobs in 10 Days Over the course of 10 days in October, Arkansas added 1,500 jobs across the state with hundreds of millions of dollars invested from DXC Technology, Nucor St... youtube.com", "2019-11-01T14:24:36.000Z": "#ICYMI This year, more than 9,800 students are taking a computer science class. That's 22% more than the 2018-19 school year. The enthusiasm we've seen for #CSed continues to amaze me & I'm confident that it will continue to be a catalyst for growth in AR. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-announces-22-percent-increase-in-computer-science-enrol ", "2019-10-31T22:57:30.000Z": "We are not too scary but I am with Cinderella ready to pass out treats on this Halloween.  No tricks!", "2019-10-31T22:11:56.000Z": "Today I met w/ incredibly bright students who represented each LRSD high school. They showed a depth of knowledge in the issues, posed great questions, & proposed ideas to improve education in LR. It means a lot to me that they were willing to meet when school was out of session.", "2019-10-31T20:05:13.000Z": "It was an honor to speak at the memorial service for State Representative John Walker today. Family and friends from across the state gathered to remember Representative Walker's life and legacy at a beautiful ceremony. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-delivers-remarks-at-memorial-service-for-the-honorable ", "2019-10-30T21:18:32.000Z": "Pleased to welcome HMS Manufacturing to AR. HMS of Troy, MI selected the Port of LR for its facility to make & distribute housewares worldwide. I called the CEO on the 1st day of my 2nd term. Thanks to @LRChamber & @ArkansasEDC for partnering to win this job creating investment.", "2019-10-30T15:06:11.000Z": "LIVE: Governor Asa Hutchinson Makes Economic Development Announcement in Little Rock LIVE: Governor Asa Hutchinson Makes Economic Development Announcement... Governor Hutchinson announces that Michigan-based HMS Mfg. Co. plans to open a new 550,000 sq. ft. injection molding facility in the Port of Little Rock. The... youtube.com", "2019-10-29T22:01:02.000Z": "Today I toured the @ADHPIO offices, Public Health Laboratory, and Emergency Communication Center in Little Rock. As Governor, I am proud of the hard work these public servants achieve daily to protect and improve the health and well-being of the people of Arkansas.", "2019-10-29T17:07:39.000Z": "I am proud that Jefferson Laboratories is home to the @US_FDA National Center for Toxicological Research, the only FDA Center outside Washington D.C. With over 650 employees, this facility is a significant economic engine for our state and provides critical research for the FDA.", "2019-10-28T23:29:13.000Z": "On National First Responders Day, I commend the courageous men and women who risk their lives as our state's first line of defense in emergencies and disasters, such as our state's flooding this past June. Thank you for all you do to aid and protect the people of Arkansas.", "2019-10-28T21:43:38.000Z": "I grew up on a farm and understand that keeping one in the family for 100 years is no easy task. I was proud to join the Arkansas Department of Agriculture to induct 46 farms into the Century Farm Program today. Thank you for contributing to our state's rich farming heritage!", "2019-10-28T15:48:56.000Z": "My statement on the passing of Rep. John Walker:", "2019-10-27T17:36:21.000Z": "This is such a powerful message that America will hunt down terrorist leaders.  Well done @realDonaldTrump , our special forces & our intelligence community. Quote Tweet Newsweek @Newsweek BREAKING: Trump approves Special Ops raid targeting ISIS leader Baghdadi and military says he's dead https:// trib.al/yzMzp4i", "2019-10-27T13:10:11.000Z": "Have a wonderful day!", "2019-10-26T13:31:53.000Z": "As former Administrator of @DEAHQ , I know the importance of the safe disposal of prescriptions in fighting drug abuse. On National Prescription Take Back Day, I encourage all Arkansans to drop off unused and expired medications at one of the many locations across the state. Quote Tweet Arkansas Take Back @artakeback The Arkansas Drug Take Back Day is BACK! There will be hundreds of locations from 10 a.m. - 2 p.m. Saturday, Oct. 26 where you can drop off expired & unneeded medications. Here's where you can find permanent drop box locations (many are 24/7) in the state: https:// artakeback.org/take-back/coll ection-sites/ ", "2019-10-25T20:56:18.000Z": "Students, in honor of National Red Ribbon Week in Arkansas, I encourage each of you to \"Send a Message, Stay Drug Free.\" To learn more about the importance of maintaining a healthy lifestyle and to sign the @RedRibbonWeek pledge, visit http:// redribbon.org .", "2019-10-25T19:01:54.000Z": "Did you know that the Buffalo River was the first in the United States to be designated a national river? Learn more about this Arkansas treasure and why we should be diligent in protecting it in this week's radio address: https:// governor.arkansas.gov/news-media/weekly-address/more-than-just-a-river ", "2019-10-25T16:24:10.000Z": "I am delighted to announce the grand opening of the new Specialty Cold Mill at Nucor Hickman in Blytheville today. This expansion of one of North America's premier steel and steel products companies is great news for Mississippi County and our state as a whole.", "2019-10-23T21:44:24.000Z": "It's a great day for economic development in our state! Thanks to cooperation between Risever, @ArkansasEDC , and @JboroUnlimited , the new Risever facility that will be a supplier for @CaterpillarInc , @JohnDeere , and other heavy equipment manufacturers opened in Jonesboro today.", "2019-10-23T16:32:50.000Z": "Today I shared an update on our state's successes in education with superintendents, administrators, teachers, and other school staff from across Arkansas at the @APSRC Annual Fall Conference. I appreciate all you do for our students and our state. Great to be with you!", "2019-10-22T19:37:54.000Z": "A large part of the mission of @ArkansasEDC and my administration has been to recruit high-paying, high-tech jobs to the state, and I'm thrilled to see @DXCTechnology , a leading independent IT services company, expand in Conway by creating 1,200 new jobs. https:// governor.arkansas.gov/news-media/press-releases/governor-announces-dxc-technology-to-expand-in-conway-create-1200-jobs ", "2019-10-22T15:01:17.000Z": "LIVE: Governor Hutchinson Makes Major Economic Development Announcement in Conway https:// youtube.com/c/governorasah utchinson/live ", "2019-10-21T14:50:45.000Z": "I have directed the state flag of Arkansas to be flown at half-staff in tribute to Corporal Jerry Mack Garrison, who was reported missing in action during the Korean War. Corporal Garrison will be laid to rest at home in Arkansas tomorrow. https:// governor.arkansas.gov/images/uploads /proclamations/191021_2019_Jerry_Mack_Garrison_Half-Staff.pdf ", "2019-10-21T12:21:08.000Z": "Significant storm damage last night in Northwest Arkansas including one fatality.  ADEM is monitoring and supporting local first responders.", "2019-10-20T13:33:24.000Z": "Have a blessed Sunday.", "2019-10-18T20:53:59.000Z": "When I took office in 2015, our child-welfare and foster-care system was in urgent need of improvement. In this week's radio address, I discuss the tremendous progress we've made on behalf of the children of Arkansas. https:// governor.arkansas.gov/news-media/weekly-address/making-real-progress-in-foster-care ", "2019-10-17T17:57:15.000Z": "I got to know Congressman Elijah Cummings during the time we served together in the House. We did not agree on all the issues but he was a dedicated public servant who I respected and appreciated. My prayers are with his family and friends.", "2019-10-16T19:03:24.000Z": "Today I met Troopers from around the State of Arkansas and got to train with the @ARStatePolice on its new driving track. What a ride! I appreciate our state's law enforcement officers for protecting and serving Arkansans each day.", "2019-10-16T16:55:23.000Z": "On National Boss's Day, I recognize my boss - the people of Arkansas. It is an honor to serve our great state each day as Governor.", "2019-10-15T15:33:34.000Z": "Today I helped kick off Arkansas Farm to School Month with the Arkansas Agriculture Department. Farm to school programs are vital in connecting our state's growers and food producers to schools to improve student nutrition and access to healthy food. https:// governor.arkansas.gov/images/uploads /proclamations/191001_2019_Arkansas_Farm_to_School_Month.pdf ", "2019-10-13T13:12:11.000Z": "Have a great day!", "2019-10-12T13:09:09.000Z": "On National Farmers Day, the State of Arkansas recognizes the vital contributions of farmers, ranchers, and foresters to our state and our nation through conservation efforts and community leadership. Thank you for all you do!", "2019-10-11T21:25:41.000Z": "Arkansas's timber industry contributes $6.4 billion to our economy. Learn more about the many benefits of forests and the success of the timber industry in our state in this week's radio address: https:// governor.arkansas.gov/news-media/weekly-address/arkansas-timber-is-a-crop-too ", "2019-10-11T17:24:54.000Z": "Since 1986, @KingBiscuitFest in Helena has celebrated the best of blues music as one of the nation's premier blues festivals. I had a great time at this year's festival kick-off hearing great music and meeting Arkansans and visitors to our state!", "2019-10-11T15:15:21.000Z": "\"Every Word We Utter\" by Jane DeDecker serves as an important reminder of the women's suffrage movement in Arkansas. Stop by Vogel Schwartz Sculpture Garden in Riverfront Park in downtown Little Rock to see this powerful piece and celebrate the centennial of the 19th Amendment.", "2019-10-10T15:15:28.000Z": "Thanks to @AreaDevelopment for recognizing Arkansas as eighth in cost of doing business. As Governor, I am grateful for our state's strides in economic development and our talented workforce that makes Arkansas such a great place to do business. State's business climate lauded Arkansas has gained a top 10 ranking for overall cost of doing business in a national survey of site-selection experts. arkansasonline.com", "2019-10-09T23:30:45.000Z": "Pretty exciting to have this national show covering a Bentonville story. Quote Tweet HGTV @hgtv Bentonville here we come! Fixer to Fabulous with Dave & Jenny Marrs ( @marrs_jenny ) premieres Tuesday, Oct. 22 at 9|8c.  #FixerToFab", "2019-10-09T13:17:06.000Z": ". @AACF has educated Arkansans on issues affecting children & families since 1977. Yesterday at the Friends of Children luncheon, they honored AR's child advocates, including @FirstLadyAR . Proud of her work as a former teacher & active supporter of Children's Advocacy Centers.", "2019-10-08T20:27:31.000Z": "I got my flu shot today, and I encourage all Arkansans to do the same. When you get a flu shot, you protect everyone you come in contact with as well as yourself. Keep yourself and your family healthy this season!", "2019-10-06T13:16:57.000Z": "Have a wonderful Sunday.", "2019-10-04T19:00:43.000Z": "This week, I set out on an international trade mission to the United Arab Emirates and India to pursue foreign investment in AR and support our existing industry. Learn more about how these trips help economic development in our state in my radio address: https:// governor.arkansas.gov/news-media/weekly-address/taking-arkansas-to-the-other-side-of-the-world ", "2019-10-03T14:15:55.000Z": "Congratulations to the governors recognized in the @ALEC_States  #StateoftheStates report. Through transformation of state government & an economic growth agenda, we're making great strides for Arkansans. I'm honored to be included on this list of leaders. https:// alec.org/publication/st ate-of-the-states-an-analysis-of-the-2019-governors-addresses/ ", "2019-10-02T12:58:23.000Z": "Very productive meeting w/ ... @TheWelspunGroup  In Mumbai, India. Thanks to ... @rgchokhani  for his success in creating over 1000 jobs in Arkansas.  Chairman ... @BKGoenka  is looking for more ways to invest in Arkansas.  ... @mikepreston83  ... @ArkansasEDC ", "2019-09-29T19:01:23.000Z": "Very proud of ... @FirstOrionCorp  of Arkansas & so excited to be with Charles Morgan, Chair, & ... @mikepreston83  as we celebrate the Dubai, UAE office opening.  Great market opportunities for a cutting edge technology company from Arkansas.", "2019-09-29T13:01:54.000Z": "Have a great Sunday!", "2019-09-27T19:45:36.000Z": "This month marks the 10th anniversary of the Arkansas Scholarship Lottery. In this week's radio address, I discuss the progress we've made and the opportunities the scholarships have provided for many of our state's young people. Tune in here: https:// governor.arkansas.gov/news-media/weekly-address/10-years-of-the-arkansas-scholarship-lottery ", "2019-09-26T21:30:23.000Z": "When we make foreign trade markets more accessible, it strengthens our state's economy and agriculture. The United States-Japan Trade Agreement is good news for Arkansas farmers. https:// ustr.gov/about-us/polic y-offices/press-office/fact-sheets/2019/september/fact-sheet-us-japan-trade-agreement ", "2019-09-26T19:23:55.000Z": "Stop by the @ARHumanServices 4th Annual Fall Food and Craft Fair tomorrow to celebrate the beginning of fall and to support our state's talented crafters with developmental disabilities! All proceeds will benefit the crafters who made the items. https:// blueumbrellaar.org", "2019-09-25T18:54:44.000Z": "Tourism and hospitality are among Arkansas's fastest growing industries. At the Arkansas Hospitality Association's 75th Vendor Showcase and Convention in Little Rock today, I talked with vendors from across the country about why Arkansas is the best place to live, work, and play.", "2019-09-24T20:53:04.000Z": "Thousands of Arkansans are employed by @McDonalds . Owned and operated locally, these small businesses are vital to our state's economy and help employees build professional skills through educational programs. Great to be with you to celebrate McDonald's Global Hiring Day!", "2019-09-24T16:02:56.000Z": "Established in 1789, the U.S. Marshals Service has enforced federal laws & pursued justice on behalf of Americans. The U.S. Marshals Museum will honor Marshals killed in the line of duty & remind visitors of the sacrifice of those who protect us daily. Great day for Fort Smith!", "2019-09-23T19:39:14.000Z": "We want the protection & enhancement of water quality in the Buffalo River Watershed to continue as a state-led effort. I'm confident in the Buffalo River Conservation Committee's ability to connect w/leaders & local stakeholders to coordinate this effort. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-announces-buffalo-riverconservation-committee ", "2019-09-22T13:14:40.000Z": "Have a great day.", "2019-09-20T21:40:12.000Z": "I finished my 9th Computer Coding tour of Arkansas schools this week, where I spread the word that CS leads to a great career and that a workforce trained in CS is the foundation for a technology-driven economy. Learn more in this week's radio address: https:// governor.arkansas.gov/news-media/weekly-address/spreading-the-word-about-computer-science ", "2019-09-19T14:29:08.000Z": "In AR, we have fostered an environment for entrepreneurship & recognize that new technology drives our economy & health care. The Arkansas Health and Business Symposium focuses on building a healthier workforce through innovation. I appreciate your efforts on behalf of Arkansans!", "2019-09-18T19:57:13.000Z": "When we promote economic development beyond the limits of our biggest cities, we create stronger rural communities. I am thankful for the work rural entrepreneurs and business leaders complete daily on behalf of our state. Great to be at this year's RuralRISE summit!", "2019-09-18T17:04:51.000Z": ". @JRDavis has been a key member of my team since the first day of my administration. Thank you for your service and leadership. Congrats to my new Communications Director @_KatieBeck , whose background & experience on my team will be an incredible asset. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-announces-departure-of-j-r-davis-names-katie-beck ", "2019-09-16T21:38:43.000Z": "Wrapped up my Fall Coding Tour at Mulberry HS this afternoon. When provided opportunity & resources, our students & teachers never cease to amaze me! They are the reason we continue to lead the nation #CSEd . Keep up the great work & good luck this semester!", "2019-09-16T16:59:35.000Z": "", "2019-09-16T14:50:10.000Z": "I am proud of the Eureka Springs Highlanders and their enthusiasm for computer science - 51 percent of the district's high school students are enrolled in a computer science course! Keep up the great work!", "2019-09-15T13:10:10.000Z": "Have a blessed Sunday.", "2019-09-13T23:37:11.000Z": "This week, I traveled to Jonesboro to cut the ribbon at Arkansas's fourth Crisis Stabilization Unit. Tune in to my weekly radio address to learn more about the difference these centers are making in our state. https:// governor.arkansas.gov/news-media/weekly-address/ ", "2019-09-13T15:17:44.000Z": "Our state is stronger because of the leadership of the companies recognized last night at the Governor's Quality Awards. Congratulations on this well-deserved honor!", "2019-09-12T23:10:49.000Z": ". @EPA and @USArmy today repealed a 2015 rule that expanded the definition of waters of the United States (WOTUS) under the Clean Water Act. This is a great step in providing greater regulatory consistency for farmers, developers, and others across the nation.", "2019-09-12T19:39:16.000Z": "I'm proud of the Lonoke Jackrabbits' enthusiasm for #CSEd ! The school holds its own coding competition each year, & 2 years ago, students from Lonoke won their way to my State Coding Competition. Its robotics team also won the 2018 @UALR Winter Tournament! Keep up the great work!", "2019-09-12T16:24:09.000Z": "Central Arkansas is full of growing computer science companies looking for talented programmers and coders. At Sylvan Hills Middle School today, I shared how students can pursue a career in #CSEd , secure a job right out of college, and stay close to their hometowns in Arkansas!", "2019-09-11T19:16:54.000Z": "As Governor, I have visited more than 70 schools to share the benefits of pursuing a career in #CSEd . Today, I spoke with the Calico Rock Pirates about some of the great computer science jobs in Arkansas & how many more opportunities there will be when they enter the workforce!", "2019-09-11T12:53:00.000Z": "Eighteen years have come and gone since the 9/11 attacks. We are a resilient country and people, but we will never forget the thousands of innocent lives lost on that Tuesday morning or...", "2019-09-11T01:36:44.000Z": "José Sacal's work is a stunning reflection of his Mexican roots and culture. Through this remarkable exhibit at @WJCLibrary , the people of Arkansas can honor his legacy while celebrating National Hispanic Heritage Month and the 209th anniversary of the Independence of Mexico.", "2019-09-10T20:40:54.000Z": "By learning computer science in high school, our students are getting ahead of the competition. 55 students are enrolled in #CSEd at Armorel High School this year, which means they'll be one step closer to a career in CS when they graduate. Great to be with you, Armorel Tigers!", "2019-09-10T19:40:40.000Z": "Opening AR's 4th Crisis Stabilization Unit in Craighead County is a significant step in providing a valuable alternative to jail for those experiencing a mental health crisis. I believe in the promise of these units to better serve the people of our state. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-announces-opening-of-craighead-county-crisis-stabilization-unit ", "2019-09-10T16:28:42.000Z": "Today we opened our 4th Crisis Stabilization Unit in Jonesboro.  Thanks to all the judges & sheriffs that made this happen. For those in a mental health crisis, Arkansas put compassion & action together for a solution.", "2019-09-10T15:30:50.000Z": "Governor Asa Hutchinson announces the opening of the Craighead County Crisis Stabilization Unit. Watch live here: https:// youtube.com/c/governorasah utchinson/live ", "2019-09-09T19:42:37.000Z": "To add to the excitement, today I also announced that I have expanded the ADE Computer Science Teacher Stipend Program to allow each high school computer science teacher to apply for up to $10K in stipends over a 5-year period. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-announces-expansion-of-computer-science-teacher-stipend ", "2019-09-09T19:42:36.000Z": "I began my 9th coding tour at Midland High School today. Arkansas continues to lead the nation in #CSEd , & I'm delighted to see the progress our students and teachers are making.", "2019-09-08T13:20:44.000Z": "Have a wonderful day!", "2019-09-06T21:54:19.000Z": ". @SecretarySonny made his third official visit to Arkansas this week, and in today's radio address, I discuss the Shared Stewardship Agreement he and I signed during his visit and what that means for AR as the first southern state to do so. https:// governor.arkansas.gov/news-media/weekly-address/a-natural-partnership ", "2019-09-05T20:55:21.000Z": "The @BeProBeProudAR Mobile Workshop 2.0 features an interactive trailer with information and skills challenges as it travels across Arkansas visiting companies, schools, and more. Thank you for bringing exciting career opportunities to citizens in every part of our state!", "2019-09-04T22:39:48.000Z": "Great having @SecretarySonny back in the Natural State. Today, AR became the first southern state to a sign a Shared Stewardship Agreement w/ @USDA & @ForestService to further support, protect & preserve AR's most valuable resources. More here: https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-and-u.s.-secretary-perdue-sign-shared-stewardship-agreement ", "2019-09-04T17:32:22.000Z": "Today I joined the leaders of @RevUnit and @startup_junkie for the launch of their 2nd Fuel Accelerator & leaders of @ARDataSciences and @NWArkCouncil to announce their Apprenticeship program. Arkansas continues to grow as a hub for entrepreneurship, innovation & technology.", "2019-09-04T15:29:54.000Z": "LIVE: Governor Asa Hutchinson speaks at Press Conference for 2 NWA Accelerator Programs LIVE: Governor Asa Hutchinson speaks at Press Conference for 2 NWA... youtube.com", "2019-09-04T12:57:05.000Z": "It is fitting the Natural State hosted the National Association of State Park Directors Conference this week. This is the first NASPD conference held in AR since 1968, & I am proud of these leaders' efforts to promote state parks. Thanks for all you do. Glad to be with you today!", "2019-09-03T22:16:50.000Z": "Loved hearing from @MarkRicht  @LRTouchdownClub today at lunch. He talked football but also inspired us with his personal faith story.  Life is about the people you impact.", "2019-09-02T13:00:07.000Z": "Happy Labor Day!", "2019-09-01T13:05:56.000Z": "Have a great Sunday!", "2019-08-30T23:54:19.000Z": "Looking forward to a great @RazorbackFB season this year! Thanks to everyone who came out to War Memorial Stadium today to call the Hogs! #ONEHogCall  #WPS", "2019-08-30T21:13:10.000Z": "Great win for @UCA_Football last night! Congrats on the 1-0 start! #BearClawsUp Quote Tweet #10 𝗨𝗖𝗔 𝗕𝗘𝗔𝗥𝗦 𝗙𝗢𝗢𝗧𝗕𝗔𝗟𝗟 @UCA_Football The Bears Toppled the Hilltoppers tonight! #RollBearsRoll  #BearClawsUp", "2019-08-30T20:01:55.000Z": "Census Day is April 1, 2020. In this week's radio address, I discuss the importance of participating in the U.S. Census and the ways the State of Arkansas is preparing for Census Day. https:// governor.arkansas.gov/news-media/weekly-address/every-arkansan-counts ", "2019-08-30T02:00:16.000Z": "Arkansas has a long history of female leadership. Industries from business, art, literature, medicine & more have benefited from the work and dedication of our state's exceptional women. It was an honor to recognize the new members of the 2019 AR Women's Hall of Fame tonight.", "2019-08-29T16:51:43.000Z": "With a production capacity that exceeds 26 million tons, Nucor is the largest producer of steel in the United States. It was great to meet with the Nucor Hickman team today to discuss Northeast Arkansas's economy and workforce education in our state.", "2019-08-28T18:29:08.000Z": "An accurate count of AR's population is critical if we are to receive our share of federal funding. An undercount of just 1% could cost AR $990M over the next decade. Today I announced the AR Complete Count Committee to promote statewide participation. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-issues-executive-order-establishing-the-arkansas-census ", "2019-08-27T17:50:12.000Z": "\"With the support of his communityMr. Brian found he wasn't alone. His participation in creating the law in memory of his son cut a path out of the chaos.\" This new blog post tells the story of the school-bus-safety legislation known as Isaac's Law. https:// governor.arkansas.gov/news-media/blo g/in-the-blink-of-an-eye-father-legislator-give-purpose-to-loss-with-isaacs-law ", "2019-08-26T19:55:24.000Z": "Economic developers & chamber of commerce executives are our boots on the ground, inspiring cities with great ideas that prosper Arkansas. Today at the @_AEDCE Conference in Fort Smith, I was honored to help present awards to 4 of Arkansas's top leaders. Congratulations.", "2019-08-25T13:35:19.000Z": "Have a blessed day.", "2019-08-25T00:18:34.000Z": "It was a delight to attend @OpenAvenues SOAR NWA and talk about all the great things Northwest Arkansas has to offer. This weekend was full of food, fun, and entertainment that raised support to benefit individuals with disabilities in Arkansas.", "2019-08-23T23:40:00.000Z": "I am pleased with the exponential growth of mental health services in our State. In this week's radio address, I discuss expanded @ARHumanServices resources for Arkansans struggling with mental health and substance addiction. https:// governor.arkansas.gov/news-media/weekly-address/ ", "2019-08-22T15:38:57.000Z": "It was a privilege to join the Association of Arkansas Counties at its 51st Annual Conference today and share some of the great things happening in our state. Thank you for all the work you do for Arkansas counties. It is always good to be with you!", "2019-08-21T23:12:20.000Z": "This morning at the Association of Builders & Contractors Arkansas Construction Forum, I reviewed details of the $300M highway-funding plan the 92nd General Assembly passed this spring. This legislation will ensure that roads all around Arkansas are safer and easier to travel.", "2019-08-21T19:38:52.000Z": ". @ARHumanServices launched the Mental Health and Addiction Services Helpline today. Because of this agency's efforts, Arkansans struggling with mental health or substance addiction will have a resource to receive the help they need.", "2019-08-21T19:05:15.000Z": "LIVE: Governor Hutchinson Announces New Resource for Arkansans Suffering with Mental-Health, Substance Addiction. Click here: LIVE: Governor Hutchinson Announces New Resource for Arkansans... youtube.com", "2019-08-20T20:13:05.000Z": "Mr. Keeney has run Keeney's Food Market in Malvern with his wife for 63 years, and they were featured in the Arkansas Food Hall of Fame. I give them an A+!", "2019-08-20T16:44:40.000Z": "The newly created @BowenLaw Veterans Legal Clinic is an important service for the veterans who have served us. I am proud of this initiative that provides legal aid to Arkansas's veterans and also educates law students about veterans' legal issues.", "2019-08-20T15:07:38.000Z": ". @UALR Bowen School of Law announces the creation of the Veterans Legal Clinic. Watch live here: LIVE: UALR Veterans' Legal Clinic Press Conference youtube.com", "2019-08-20T14:01:19.000Z": "Through her faith and strength Wendy Anderson turned death into victory. @CHbanderson , the whole state shares your loss and we are blessed to witness your love and commitment to a wonderful lady.", "2019-08-19T22:49:42.000Z": "Thanks to Arkansas employers for your unwavering support of National Guard and Reserve Component members of the US Armed Forces. Employer support is key to maintaining our vibrant all-volunteer force. Proclamation on National Employer Support of the Guard and Reserve Week, 2019 | The White House Our great Nation's hard-fought independence was won by citizen warriors united in purpose and possessing an unwavering commitment to liberty.  On countless whitehouse.gov", "2019-08-18T13:41:17.000Z": "Have a great day!", "2019-08-16T22:12:03.000Z": "With the new school year, the AR Dept. of Education is emphasizing the importance of drivers stopping when a school bus has its red lights flashing & stop signs out. Learn more about the Flashing Red. Kids Ahead. initiative in this week's radio address. https:// governor.arkansas.gov/news-media/weekly-address/stop-for-the-flashing-red-lights ", "2019-08-16T20:58:08.000Z": "Arkansas hit another record low unemployment rate of 3.4 percent. We are moving in the right direction when it comes to economic development, and I am proud of our state's achievement. https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-economy-strong-as-state-matches-record-low-3.4-percent ", "2019-08-16T16:19:32.000Z": "The Arkansas Arts Council is accepting nominations for the 2020 Governor's Arts Awards. If you know someone who has strengthened the arts in our state, submit your nomination by September 6! http:// arkansasarts.org/blog/governor- s-arts-awards-open-for-nominations ", "2019-08-15T19:11:03.000Z": ". @ARFirstLady partnered with @ArkRedCross to assemble Comfort Kits that replace those distributed during the Flood of 2019. Thanks to these volunteers, the Arkansas Red Cross is prepared for any disaster or emergency that comes our way.", "2019-08-13T17:53:00.000Z": "The Little Rock Air Force Base is so important to our state & our national security.  Great crowd at LRAFB Community Council meeting.  Honored to be with you", "2019-08-13T15:52:00.000Z": "Today is the first day of school for many Arkansas students. It is illegal to pass a stopped school bus when its red lights are flashing and the stop arm is out. Keep Arkansas's students safe, and remember: Flashing Red. Kids Ahead. #2019FlashingRed", "2019-08-12T21:29:39.000Z": "Congratulations to @LtGovTimGriffin for his promotion to Colonel in the U.S. Army Reserve. Thanks for your leadership and service to our state and country.", "2019-08-12T16:13:04.000Z": ". @Forbes - Green Steel: How Arkansas Became Home To America's Cleanest And Fastest-Growing Steelmaker https:// forbes.com/sites/jonathan ponciano/2019/08/06/green-steel-how-arkansas-became-home-to-americas-cleanest-and-fastest-growing-steelmaker/#15c05cd17cdc  | @ArkansasEDC Green Steel: How Arkansas Became Home To America's Cleanest And Fastest-Growing Steelmaker After his partner dropped dead, globetrotting financier David Stickler found himself at the helm of a steel mill startup in rural Arkansas. forbes.com", "2019-08-11T19:15:35.000Z": "Great crowd at Hall High for the @BPortistime Celebrity B-ball Game.  Proud of Bobby Portis Foundation and the difference it will make in Arkansas.", "2019-08-11T13:58:59.000Z": "Have a blessed Sunday.", "2019-08-10T22:00:48.000Z": "I am so proud of Arkansas National Guard.  Historic change of command ceremony today. Congrats to new Adjutant General Kendall Penn & thanks to General Mark Berry for your 40 plus years of service & leadership.", "2019-08-09T21:26:32.000Z": "Arkansas is one of four states that does not increase the penalty for a defendant who attacks individuals simply because of who they are. We must change that. In today's radio address, I discuss the need for a bill that enhances penalties for a hate crime. https:// governor.arkansas.gov/news-media/weekly-address/its-time-for-a-change ", "2019-08-09T17:08:52.000Z": "I sat down with @FRTreasury_US to talk about the valuable relationship Arkansas shares with France in terms of trade and investment. Read more about the positive economic tie between our state and France here: https:// frenchtreasuryintheus.org/en/governor-hu tchinson-talks-about-arkansas-france-economic-ties/ ", "2019-08-08T19:09:53.000Z": "The First Lady & I were honored to host Japanese Ambassador Shinsuke Sugiyama and his wife, Madame Yoko Sugiyama, today at the Governor's Mansion. We discussed the strong connection between Arkansas and Japan, with 22 Japanese companies employing 6,000 Arkansans.", "2019-08-08T13:56:25.000Z": "In case you missed it, Arkansas was named the number one state for small business friendliness by @Thumbtack ! Read more here: Thumbtack names Arkansas top state for small business friendliness Arkansas was named the number one state for small business friendliness by Thumbtack, the website and app that helps people find local professionals for any project. arkansasedc.com", "2019-08-07T20:32:17.000Z": "Many people know Jimmy Driftwood of Mountain View wrote \"The Battle of New Orleans\" to teach history to his students. But the radio version was much shorter than the original. In concerts, Jimmy always sang the long version. Read about it on my website: https:// governor.arkansas.gov/news-media/blo g/jimmy-driftwood ", "2019-08-06T18:03:24.000Z": "In July, I established the Arkansas State Broadband Office to deploy high-speed internet to rural Arkansas communities by 2022. Today I unveiled the Arkansas Rural Connect (ARC) grant program with funding of $25M. Read more here: https:// governor.arkansas.gov/news-media/press-releases/governor-hutchinson-announces-the-arkansas-rural-connect-grant-program ", "2019-08-06T16:57:52.000Z": "Governor Asa Hutchinson makes announcement at Arkansas Sheriff's Association Summer Conference in Rogers: LIVE: Governor Asa Hutchinson at Arkansas Sheriffs' Association... youtube.com", "2019-08-06T01:17:00.000Z": "11pm w/ @ShannonBream : \nGov. @AsaHutchinson  @nhclc  @YatesDCIA  @mschlapp  @EthanBearman  @KimMotleysLaw  @markpmeredith  @Garrett_FoxNews", "2019-08-04T13:32:56.000Z": "As a federal prosecutor I saw the evil of white supremacy.   Its influence diminished but now we see a resurgence.  In El Paso, there are two stories: the evil of the shooter & the love & help of the city. America must embrace El Paso's compassion & collectively rebuke this evil.", "2019-08-02T17:22:29.000Z": "I applaud my friend & colleague, @GovLauraKelly , for being the first Democratic governor to offer public support for the #USMCA . Governors from both parties understand how important this trade agreement is for states' economies & our nation as a whole. Governor urges support for USMCA Agreement - Governor of the State of Kansas governor.kansas.gov", "2019-08-01T19:29:01.000Z": "Great teachers inspire. I met a few today when I presented honors to 15 regional finalists & 4 state semifinalists for the title of 2019 Arkansas Teacher of the Year. They are the best of our best, shaping a great future for our state by inspiring greatness in our students.", "2019-07-31T22:12:53.000Z": "I was delighted to join the Rockefeller family this afternoon for a building renaming ceremony in honor of the late Gov. Winthrop Rockefeller. His bold leadership led to unprecedented economic growth, improved race relations, strong FOIA laws & prison reform. Incredible legacy.", "2019-07-31T16:35:24.000Z": "I never feel more safe than when I am in a room full of police officers as I was today when I spoke to the Arkansas Municipal Police Association Convention in Hot Springs. Thank you to all the police officers who put our safety above their own on a daily basis.", "2019-07-30T21:19:10.000Z": "With last week's 5-4 U.S. Supreme Court decision to allow @realDonaldTrump to fund the border wall, @AtlasTube steel is being produced in Blytheville for the steel portion of the wall. Victory in D.C. means jobs at home."}