{"2019-09-10T05:48:12.000Z": "Wouldn't you like this to be the headline in your hometown newspaper? We're working hard to make healthcare savings a reality across Colorado by building on reinsurance (18.2% avg premium reduction next year) and expanding the alliance model statewide", "2020-07-30T15:11:22.000Z": "The mask goes over your nose AND mouth.", "2020-07-29T15:31:58.000Z": "It inspired me not to wear rings! Quote Tweet Tolkien Society @TolkienSociety A very happy birthday to The Lord of the Rings! The first part, The Fellowship of the Ring, was published on 29th July 1954. What impact has #Tolkien 's masterpiece had on you? #LOTR", "2020-07-28T21:18:50.000Z": "\"I'm calling on Coloradans not to be stupid,\" Polis says. \n\nHe estimates that 1 in 500 Coloradans are contagious with coronavirus right now. #copolitics", "2020-07-28T14:03:14.000Z": "Today is Parks and Recreation Professionals Day in Colorado.\n\nWe can't think of a better day to thank our parks and wildlife officers for their dedication, and for keeping the outdoors accessible throughout the COVID-19 crisis to all Coloradans.\n\nThank you.", "2020-07-27T15:10:25.000Z": "Masks are required for all indoor areas outside of your home, and wearing a mask is just one way to stay safe. Here are other things you can do: Wash hands often. Keep 6 ft. from others. Avoid large gatherings. Limit interactions with others. Stay home if sick.", "2020-07-27T16:04:57.000Z": "C O L O R A D O that's it. that's the tweet.", "2020-07-27T06:43:03.000Z": "1st place Colorado @Rockies !!!!", "2020-07-20T17:04:07.000Z": "Trying to talk with someone who believes a conspiracy theory? Send them a video from someone they might listen to! Visit http:// thetruetruetruth.com", "2020-07-24T17:33:24.000Z": "NASHVILLE - A 10-year-old wrote a letter expressing her frustrations to bar owners and adults during the COVID-19 pandemic: \"Which is more important? Carrying on with your partying or sending kids to school?\" Preach. 10-year-old writes letter to Nashville bar owners, adults asking them to stop partying during... The child finished the letter by saying she would \"appreciate if one day soon, we can all live safely in the unique city Nashville is.\" wvlt.tv", "2020-07-23T20:47:52.000Z": "\"In the areas that they have sent troops in, it was obviously like pouring oil on a flame.\" Polis Tells Federal Troops to Stay the Hell Out of Colorado If needed, the governor would turn first to the National Guard. westword.com", "2020-07-23T19:36:52.000Z": "Thank you, @GovofCO , for stopping by the Colorado State Lab and commending the staff for increasing the lab's testing capacity. It's quite impressive that they've gone from running 200 tests/day to over 3,000 tests/day. Overall, Colorado is now running 10,000+ tests per day.", "2020-07-23T22:49:20.000Z": "The brave members of our military defend our freedom abroad. They should not be deployed in Colorado to beat up our fellow Americans expressing their free speech. Polis Tells Federal Troops to Stay the Hell Out of Colorado If needed, the governor would turn first to the National Guard. westword.com", "2020-07-22T20:01:23.000Z": "Hi Granny! Quote Tweet Looney Tunes @WBLooneyTunes I did some research and found the favorite looney tunes character of each state and wow there is a lot to process here Show this thread", "2020-07-20T00:41:22.000Z": "Colorado Gov. Jared Polis says wearing masks is \"not partisan,\" but \"a ticket to more freedom.\"\n\n\"It makes it less likely that businesses will be shuttered. It makes it less likely that people will die. It makes it more likely school will return.\" https:// abcn.ws/39bU3ZV", "2020-07-19T11:57:35.000Z": "Will be on this morning w @chucktodd on @MeetThePress  @NBCNews", "2020-07-18T20:40:40.000Z": "The state's model shows that masks alone won't change our trajectory. People need to stay home more. But if things are open, many will assume those are OK activities. https:// denverpost.com/2020/07/18/col orado-covid-masks-social-distancing-spike/  via @denverpost Masks will help, but more distancing needed to head off a September spike in Colorado, model shows Even if everyone wore masks in public and older people stayed home at the rates they did during shelter-in-place - not likely, since no order is always obeyed and some seniors have jobs ̵ denverpost.com", "2020-07-18T03:38:55.000Z": "One of the honors of my life was working alongside civil rights hero John Lewis. \n\nAn exceptional leader and fighter for the American Dream. \n\nMay he Rest In Peace.", "2020-07-18T00:42:03.000Z": "Opinion | Editorial: Just like wearing masks in public, Polis' order is the right thing to do Editorial: Just like wearing masks in public, Polis' order is the right thing to do For every scientific study casting dispersions on masks, there is another supporting them. denverpost.com", "2020-07-17T20:59:09.000Z": "Help for Colorado renters and homeowners impacted by Coronavirus is on the way! Quote Tweet Senadora Julie Gonzales @SenadoraJulie Struggling to make your rent or mortgage payments? Today, @COLocalAffairs is releasing the $20M in housing assistance that @TonyExum , @Zenzinger_AtoZ , @SerenaForCO and I fought for in HB1410. Visit: http:// cdola.colorado.gov/rental-assista nce  to find out more about how to apply! #COLeg  #COPolitics", "2020-07-17T15:44:02.000Z": "On implementing a state-wide mask mandate for public indoor spaces, Colorado Gov. @JaredPolis says the areas that had mask requirements had \"substantially reduced spread of the virus,\" so the decision was \"pretty obvious.\" https:// cnn.it/3eyCKU4", "2020-07-16T21:57:57.000Z": "MASKS REQUIRED: Colorado Gov. Jared Polis issued a statewide mask mandate, citing a \"significant uptick\" in the number of COVID-19 cases. It goes into effect on Friday.\n\nGet updates 24/7 on CBSN Denver: https:// denver.cbslocal.com/live/", "2020-07-16T19:59:46.000Z": ". @GovofCO Jared Polis has announced a Colorado statewide mask order for indoor public spaces: https:// bit.ly/2CiqHgB  #DoingMyPartCO", "2020-07-16T20:13:10.000Z": "", "2020-07-16T20:01:00.000Z": "Thank you @GovofCO for announcing a statewide face mask order for Coloradans. I hope this will encourage us all to do our part and slow the spread of COVID-19.", "2020-07-16T19:37:02.000Z": "Happy to comply w/ @GovofCO 's mask order, in fact I've been doing it for months. Not because I'm being forced to, but out of respect for our elders and vulnerable populations. And what if it turns out masks don't work? I'll survive. Other Americans have sacrificed far more. Quote Tweet The Denver Post @denverpost BREAKING: Colorado Gov. Jared Polis to issue a statewide mask mandate amid growing coronavirus cases https:// dpo.st/391OltE Show this thread", "2020-07-14T17:57:01.000Z": "Welcome @Wix to the Colorado family! \n\nJobs will include more than 200 full-time customer care employees. Positions in sales and account management will be added as the operation grows. #ChooseColorado | #EconDev Global website creation company Wix.com picks Denver for latest location A global software company specializing in website creation will open its newest office in Denver with about 200 employees to start, Colorado Gov. Jared Polis said Tuesday. denverpost.com", "2020-07-14T18:05:38.000Z": "BREAKING: @GovofCO has signed #paidsickdays into law! No worker is left behind as all Coloradans are covered. Colorado now becomes the 12th state to pass a paid sick day legislation and has one of the most progressive policies in the country.", "2020-07-14T06:12:00.000Z": "Colorado on Monday became the 11th U.S. state to ban the LGBTQ \"panic defense,\" meaning defendants can no longer blame their own violent actions on a victim's sexual orientation or gender identity. https:// bit.ly/2ZosAkD via @denverpost Colorado becomes 11th state to ban LGBTQ 'panic defense' Colorado on Monday became the 11th U.S. state to ban the LGBTQ \"panic defense,\" meaning defendants can no longer blame their own violent actions on a victim's sexual orientation or gender identity. thedenverchannel.com", "2020-07-14T17:08:55.000Z": "Be like Jimmy", "2020-07-14T13:40:31.000Z": "Good Morning! It's a good day to wear a mask!", "2020-07-14T15:52:59.000Z": "Be like Jimmy. Quote Tweet The Carter Center @CarterCenter https:// cnn.com/2020/07/11/pol itics/jimmy-carter-rosalynn-wear-mask-save-lives-trnd/index.html ", "2020-07-13T21:02:49.000Z": "With Governor @jaredpolis ' signature today, Colorado becomes the 11th state to ban defenses that push the blame for murder and violence onto the victim simply because of who they are. #LGBTrights  #coleg  #SaferCO", "2020-07-13T19:15:00.000Z": "\"We're leading the world.\"", "2020-07-13T15:10:05.000Z": "It's another summer week in Colorado. You know what to do.  #RecreateResponsibly", "2020-07-11T22:22:03.000Z": "#lifegoals ACHIEVED Quote Tweet CBSDenver @CBSDenver Dolly Parton Thanks Gov. Polis For Signing Imagination Library Bill https:// denver.cbslocal.com/2020/07/11/dol ly-parton-imagination-library-colorado/?utm_source=dlvr.it&utm_medium=twitter ", "2020-07-11T19:41:34.000Z": "Dolly Parton Thanks Gov. Polis For Signing Imagination Library Bill https:// denver.cbslocal.com/2020/07/11/dol ly-parton-imagination-library-colorado/?utm_source=dlvr.it&utm_medium=twitter ", "2020-07-11T22:10:05.000Z": "I wish that Trump was a capitalist and not a cronyistic socialist Quote Tweet Jeremy Rosenberg @JeremyR1992 Replying to @jaketapper If the Trump campaign just sold masks instead of peddling whacko conspiracy theories about masks, we'd be in a better spot. Conservatism is a plague.", "2020-07-11T21:39:48.000Z": "Some day someone will do a study on how many lives might have been saved if this happened in February or March Quote Tweet Jason Hoffman @JasonHoffman93 For the first time since the coronavirus pandemic began, President Trump has been seen by the White House press corps wearing a mask. Today, he's sporting the face covering while visiting wounded troops at Walter Reed Medical Center.", "2020-07-10T19:43:13.000Z": "A day after Gov. Polis told Coloradans to \"wear a damn mask,\" officials from Denver and the state health department reiterated how crucial mask-wearing is to keep the gradual increase in cases and hospitalizations from quickly growing exponentially. Colorado and Denver officials stress importance of masks in keeping COVID-19 increase from spiking A day after Colorado's governor told Coloradans to \"wear a damn mask,\" officials from Denver and the state health department reiterated how crucial mask-wearing would be in order to keep the curren... thedenverchannel.com", "2020-07-10T14:46:46.000Z": "", "2020-07-10T04:44:01.000Z": "\"Wear a damn mask!\" @GovofCO told Coloradans Thursday, arguing that mask-wearing will ensure the health not just of individuals, but also the overall economy. https:// buff.ly/3fdFqYw via @AndyKnny  #copolitics With Coronavirus Spreading In Colorado, Polis Warns 'This Is The Summer Of No Parties' The governor is asking Coloradans to step up their safety efforts as infection rates tick up a bit, including avoiding large summertime gatherings. cpr.org", "2020-07-10T02:13:00.000Z": "Colorado releases new coronavirus web app to track actions that affect COVID spread https:// gazette.com/colorado_polit ics/state-officials-release-new-coronavirus-web-app-to-track-actions-that-affect/article_cd38e73e-1717-5d3a-9023-a90b6ee4cd7c.html   #copolitics  @colo_politics  @GovofCO Colorado releases new coronavirus web app to track actions that affect COVID spread Gov. Jared Polis and the team of COVID-19 researchers from the University of Colorado showed the public an online application, at ColoradoCoronavirus.com, that will allow Coloradans to see updates on gazette.com", "2020-07-10T01:53:55.000Z": "Cover your face in a public place.", "2020-07-08T17:15:20.000Z": "well, would you look at the time...\n\n             12\n      11     ^      1\n  10         |          2\n9           ⊙----> DON'T FEED WILDLIFE\n   8                    4     O'CLOCK\n       7           5       \n             6", "2020-07-07T21:42:05.000Z": "Thanks for the challenge @GovofCO . I wear a mask to show respect for my fellow citizens, to protect the health of others, and to make sure Wyoming's businesses remain open and our economy stays healthy. @GovernorLittle of ID, why do you wear a mask?", "2020-07-08T00:33:04.000Z": "\"The mask is not for you. It's to protect the people you care about.\" - Batman\n\nBatman AND @jaredpolis are telling you to #WearAMask . Pretty fair to say you should listen to them.  #copolitics  #cogov The following media includes potentially sensitive content. Change settings View The following media includes potentially sensitive content. Change settings View", "null": "", "2020-07-07T23:00:21.000Z": "We commend the Colorado legislature for passing the bill and Colorado governor @jaredpolis for signing it into law! Progress! Colorado Enacts Law Eliminating Cages for Hens This means that all Colorado farms-and all out-of-state farms that sell eggs to Colorado-must transition to cage-free conditions. mercyforanimals.org", "2020-07-07T17:45:44.000Z": "Good news! @COParksWildlife said that a yearling bear that was burned during the East Canyon Fire last month is recovering well, should get his bandages off soon and should be released in coming weeks. https:// bit.ly/2ZLySd1  #cofire", "2020-07-07T17:12:06.000Z": "If they can, you can.", "2020-07-06T20:12:54.000Z": "Joe Biden is a fundamentally good human being who will help heal America. @JoeBiden Joe Biden For President 2020: Official Campaign Website \"Our country is being put to the test ...but I've never been more optimistic about America.\" joebiden.com", "2020-07-06T01:10:34.000Z": "Nick Cordero, standout actor in Broadway musicals, dies of COVID-19 complications at 41 Nick Cordero, Standout Actor in Broadway Musicals, Dies of COVID-19 Complications at 41 He received a Tony nomination for 'Bullets Over Broadway' and starred in 'Waitress,' 'A Bronx Tale the Musical' and 'Rock of Ages.' hollywoodreporter.com", "2020-07-01T19:51:10.000Z": "According to the @NYTimes , \"Colorado offers a model for voting smoothly in a pandemic.\"  The nation is noticing that Colorado's vote-by-mail election model is safe, effective, and popular with voters! An Election Day Success And what else you need to know today. nytimes.com", "2020-07-05T18:30:40.000Z": "I'm glad the @Rockies are masking up to stay safe, we need them healthy to win the pennant this year. I hope that you are masking up, too! Kiszla: The new definition of American patriotism? The Rockies know. Real men wear masks. With no star-spangled fireworks and no big crowd buzz on the Fourth of July, the crack of a ball off the bat sounded lonely echoing off empty seats in the ballpark on Blake Street. denverpost.com", "2020-07-05T00:18:49.000Z": "America is strong, America is resilient, just like our symbol the bald eagle. Happy Independence Day! Let's keep moving forward together, and work to ensure that our best days are still ahead! Bald eagle recovering this Fourth of July after crash landing in Durango This Fourth of July, a bald eagle, America's national bird, is recovering at an animal rehabilitation center after apparently flying into power... durangoherald.com", "2020-07-04T21:34:32.000Z": "The boys of summer are back, in a summer unlike any other. Go @Rockies ! Quote Tweet Colorado Rockies @Rockies Hello again, we're back!\n\nSorry if our socially distant content is blurry, we're trying our best. Show this thread", "2020-07-04T16:53:51.000Z": "Happy 4th", "2020-07-02T22:01:31.000Z": "As an entrepreneur and businessman, I wear a mask because I know it helps re-open the economy sooner and reduce unemployment in addition to saving lives. And governors across our country know it too. @GovernorGordon of WY, why do you wear a mask? #MaskUpSaveLives", "2020-07-02T19:40:01.000Z": "Colorado just passed a historic HSUS-led measure banning cruel cages for egg-laying chickens! Gov. @jaredpolis signed the measure into law yesterday, mandating eggs produced & sold in Colorado come from cage-free facilities. Breaking news: Colorado becomes seventh U.S. state to ban cages for egg-laying hens Colorado has just banned cages for egg-laying chickens and will require that eggs produced and sold in the state be cage-free. The bill, which passed both chambers of the state legislature in June,... blog.humanesociety.org", "2020-07-01T19:09:50.000Z": "Three bills signed in the past week by @GovofCO offer employers some regulatory relief, an extension of an existing tax credit and hope that the state can simplify its byzantine sales-tax system: Polis signs 3 bills that could help Colorado employers The three bills flew under the radar in a session where business was on the defensive more often than not. bizjournals.com", "2020-07-01T22:37:17.000Z": "@GovofCO Jared Polis had 10,000 #COVID19 testing kits delivered to Denver's Pepsi Center on Wednesday, preventing the site from having to scale back operations #Denver  #COVID19Colorado  #COpolitics Gov. Jared Polis provides 10,000 testing kits to Denver's Pepsi Center COVID-19 testing site Less than 24 hours after Denver announced it was reducing its hours at the state's largest drive-up coronavirus testing site due to a shortage of testing kits, Colorado Gov. Jared coloradopolitics.com", "2020-07-02T00:42:09.000Z": "I can't believe this unfair hit job cost @scottrtipton his re-election #copolitics Poll Finds 100% Of Americans Blame Shutdown Entirely On Colorado Representative Scott Tipton WASHINGTON-A new Pew Research poll published Thursday revealed that 100 percent of Americans blame the United States federal government shutdown entirely on Scott Tipton (R-CO). \"From the Rust Belt... politics.theonion.com", "2020-07-01T18:40:21.000Z": "On a farm in Longmont, with chickens clucking in the background, Gov. Jared Polis just signed a bill requiring all egg-laying hens in Colorado to be cage-free by 2025.", "2020-07-01T14:00:00.000Z": "Today is #CPOFDay ! Thanks to @GovofCO for your proclamation supporting Colorado pets! Our state is a great place to be a pet because of the generosity of Colorado residents and taxpayers. Read the official proclamation: https:// coloradopetfund.org  #COLovesPets", "2020-07-01T15:02:50.000Z": "Today is #CPOFDay ! Thank you @JaredPolis for your proclamation supporting Colorado Pets. Our partners at CPOF are doing important work to help us prevent pet homelessness. Learn more about CPOF by following them at @copetfund . #CPOFDay  #COLovesPets  https:// facebook.com/copetfund", "2020-07-01T17:47:24.000Z": "I want to thank @GovofCO for providing 10,000 COVID-19 tests to our site at the Pepsi Center, so we can keep testing going this week. The testing site will be closed, as planned, for the upcoming holiday weekend, but we will re-open on Tuesday, July 7th.", "2020-06-30T22:41:34.000Z": "\"For decades, the Black community has been disproportionately criminalized because of marijuana while others have profited,\" said @repjamescoleman a Denver Democrat & bill sponsor. \"We have needed to act on this injustice for decades.\" #COLeg  #COPolitics Colorado Gov. Jared Polis says pardons for marijuana convictions can start in 90 days Colorado Gov. Jared Polis signed a bill into law Monday that allows him to mass-pardon Coloradans with minor marijuana possession convictions, but he has not said exactly how the process will work. denverpost.com", "2020-07-01T03:00:04.000Z": "Our nation needs John @Hickenlooper 's leadership more than ever today, and I am proud to enthusiastically endorse and support him for the U.S. Senate.", "2020-07-01T00:15:15.000Z": ". @Hunt_Institute checked in with CO Governor @JaredPolis for this month's installment of 5 Questions for the Governor with @EarlyLearnNatn . #earlychildhood  #childcare  #earlyed  #preschool 5 Questions for the Governor: Colorado's Jared Polis - Early Learning Nation Colorado has fared better than many of our neighboring states because the people of this state have been taking this pandemic seriously -- wearing masks, staying at home, keeping their distance from... earlylearningnation.com", "2020-06-30T14:02:48.000Z": "Don't forget to vote! Today is the Colorado primary election.\n\nYou can drop off your completed ballot at a drop box near you by 7 PM tonight.\n\nFind your drop box or polling place at http:// GoVoteColorado.Gov", "2020-06-30T20:05:35.000Z": "Polis: Wearing a mask is not an ideological or partisan thing, it's a science thing.", "2020-06-30T20:02:45.000Z": "\"It's stupid not to wear a mask,\" Gov. Jared Polis says", "2020-06-30T00:55:19.000Z": "Ski goggle tan is SO 2019\n2020 is all about the facial mask tan", "2020-06-29T22:30:03.000Z": "Big day for us today. @GovofCO signed  bills today to provide new investments for our newest @COParksWildlife state park, our @CWCB_DNR water projects bill & important funding for CO wildlife.  Thanks to all the #coleg leaders for their ongoing support.", "2020-06-29T19:15:36.000Z": "Today, @GovofCO is in Southern Colorado to sign three bills that I sponsored. I am proud of these bills that will protect utility customers, create a state park at Fishers Peak, and provide information about concurrent enrollment to middle school students. #coleg  #PuebloProud", "2020-06-29T16:06:16.000Z": "The decisions we make today will have an impact on the number of COVID-19 cases tomorrow. Let's remember the BIG 3 to prevent the spread: Wear a face-covering in public. Wash your hands frequently with soap and water for 20 seconds. \nStay --6 feet-- apart from others.", "2020-06-27T21:05:32.000Z": "Extreme social distancing The Oceans of Europa may be Habitable A new study of the oceans of Europa suggest oceans on that giant moon may be habitable. But is there life? medium.com", "2020-06-26T18:32:40.000Z": "When we see data showing in hospital mortality for Covid patients aged 35-44 of almost 5% we should keep in mind - that's exceptionally high; especially since criteria for admission is generally just an oxygen saturation below 93%. Many of these young people are otherwise healthy", "2020-06-25T20:30:18.000Z": "Today I signed an Executive Order designating Attorney General Phil Weiser to investigate and, if the facts support prosecution, criminally prosecute any individuals whose actions caused the death of Elijah McClain. \n\nExecutive Order: https:// drive.google.com/file/d/1JqvdhY f9g9Zi_I8-8Nlpjjp7ThQhO5t1/view  Statement below:", "2020-06-25T19:17:50.000Z": "Today @GovofCO signed my bill allowing military spouses & others moving to CO to have their occupational licenses more easily & quickly recognized so they can continue their careers. We are making it easier for people to provide for themselves. #coleg  #copolitics  @ColoConcern", "2020-06-25T17:57:50.000Z": "I'm in. Having a gamer Governor must count for something. Quote Tweet MonteCristo @MonteCristo The@denverpost presents good reasons to develop the esports industry in Colorado. I am interested.\n\nIt's central location, major international airport, and cost/quality of living make it very attractive for the industry.\n\nHelp me @jaredpolis  https:// theknow.denverpost.com/2020/06/25/col orado-video-games-coronavirus/240946/  Show this thread", "2020-06-23T20:00:18.000Z": "The Colorado Children's Campaign would like to thank our #ColoradoLegislature for passing House Bill 1427, which will tax tobacco and nicotine products to support Colorado health and early childhood education programs @YadiraCaraveo  @McCluskieforCO  @SenRhondaFields  @domoreno", "2020-06-23T17:08:04.000Z": "In case you missed the @CBS4Shaun Boyd story last night, here's my full (very short) speech on our 2-1-1 bill the @GovofCO signed yesterday. Short version: need some of the CARES Act $$ we allocated to help with rent, food, and utilities? Dial 2-1-1! #coleg", "2020-06-23T21:11:44.000Z": "Small businesses are the backbone of Colorado's economy. Today @GovofCO signed my bill with @Cutter4Colorado into law that creates a $250 million fund. This will provide low cost loans to struggling small CO businesses as they recover from a struggling economy. #coleg  #copolitics", "2020-06-23T21:35:00.000Z": "A member of the @GovofCO economic advisory council said today that eight other states are looking at small-business loan funds like the one that is now in law in Colorado. But the Centennial State is believed to be the first to create one: Polis signs $270M small-business loan and grant programs into law The money will be available to companies of 100 or fewer employees that did not get sufficient coronavirus financial aid through federal programs. bizjournals.com", "2020-06-23T02:42:29.000Z": "Coloradans don't just search for masks on google, we wear them. https:// coloradomaskproject.com Quote Tweet Nate Silver @NateSilver538 In positive news, Google searches for masks have ticked up after a long decline. And guess where there's been the biggest increase over the past 7 days? Arizona, which has had (perhaps) the worst recent spread and where Phoenix just issued a mask mandate. https:// trends.google.com/trends/explore ?date=now%207-d&geo=US&q=masks ", "2020-06-22T19:06:55.000Z": "Mail-in ballots are safe, secure, and good for democracy. Colorado has proven it. Quote Tweet Joe St. George @JoeStGeorge VIDEO: I asked President Trump to cite specific evidence as to why mail-in ballots are fraudulent. I told him I covered politics for 5 years in Colorado (an all mail-in ballot state) and never heard @SenCoryGardner complain once. #copolitics  @DenverChannel  @KOAA", "2020-06-21T22:44:34.000Z": "A growing number of scientific studies support the idea that masks are a critical tool in curbing the spread of the coronavirus. Yes, Wearing Masks Helps. Here's Why Politicians argue. Those opposed to mask mandates protest. But meanwhile, growing evidence shows that mask wearing is a critical tool in curbing the spread of the coronavirus. npr.org", "2020-06-21T00:34:52.000Z": "\"When you do testing to that extent, you are going to find more people, you will find more cases. So I said slow the testing down.\" \n-Trump on trying to keep the number of reported COVID cases low", "2020-06-21T01:06:16.000Z": "Wear a mask", "2020-06-20T21:20:04.000Z": "However uncomfortable you may find it, wearing a face covering or mask is like being on a beach in Cancún with a piña colada in hand compared to being stuck on a ventilator for weeks in a hospital.", "2020-06-20T03:01:05.000Z": "Colorado Gov. Jared Polis signs a bill mandating police body cameras and banning chokeholds https:// cnn.it/3hJ8pVC", "2020-06-19T20:34:09.000Z": "Thank you @Leroy_Garcia and @leslieherod for your amazing work on this bill that made Colorado the first state in the nation since the demonstrations began to pass a sweeping police reform and accountability measure. 'We heard your cry': Colorado governor signs sweeping police reform bill invigorated by protests After weeks of massive demonstrations in Colorado following the death of George Floyd and several other Black Coloradans, Colorado became the first state in the nation since the demonstrations began... thedenverchannel.com", "2020-06-19T20:30:32.000Z": "I agree with @BernieSanders correct public health observation. Quote Tweet Bernie Sanders @BernieSanders Trump's rally in Tulsa is indoors, with no social distancing and no mask requirements-all in violation of CDC guidelines. Trump is willing to spread the COVID-19 virus in order to hear some cheers. He is a direct threat to the health of the American people. He must be defeated.", "2020-06-19T20:15:52.000Z": "Seeing lots of praise for Polis in the replies/quotes. His signature is what made it law, but the bill is not his doing. It is the work of POC bill sponsors who collaborated with ACLU, Mari Newman and others to write it. That it was drafted at all is the work of protesters. Quote Tweet Alex Burness @alex_burness Colorado Gov. Polis has signed SB-217 into law, ending qualified immunity for police, heavily restricting use of tear gas/projectiles on citizens, introducing criminal charges for cops who don't intervene in excessive force cases + much more.\n\nAll a direct result of protests. Show this thread", "2020-06-19T19:21:52.000Z": "Colorado is moving forward and working hard to reform policing and restore trust between law enforcement and our communities Polis signs broad Colorado police reform bill: 'black - lives - matter' - Sentinel Colorado DENVER | Colorado Gov. Jared Polis on Friday signed into law a broad police accountability and reform bill introduced amid protests over the police killing of George Floyd. Polis signed Senate Bill... sentinelcolorado.com", "2020-06-19T15:53:25.000Z": "BREAKING : @GovofCO has signed #SB217 into law. Colorado becomes one of the first states in the country to END qualified immunity as part of this historic comprehensive police accountability bill.", "2020-06-19T13:32:34.000Z": "Hello young white male adults (especially) and everyone else: let's wash our hands regularly. They covered that in kindergarten. Quote Tweet Eric Feigl-Ding @DrEricDing Who washes their hands less??? Latest JAMA study says: Whites Males Young adults\n\n(HT @jeremyfaust ).", "2020-06-18T14:25:09.000Z": "Thank you US Supreme Court for giving our dreamers some breathing room to continue to work and live here legally as we wait for Congress to pass immigration reform", "2020-06-17T19:56:27.000Z": "Proud of Colorado for breaking ground a decade ago, and proud to call Peter Groff and Terrance Carroll friends. Quote Tweet Lynn Bartels @lynn_bartels Colorado was the first state to have two black legislators lead their respective chambers. They took over power in a building where the KKK once held sway. #copolitics  #coleg  https:// vaildaily.com/news/milestone -2-blacks-at-top-denver-posts-at-same-time/   @petercgroff  @speakercarroll", "2020-06-15T20:11:06.000Z": "Colorado offers $4.1 million to cities that use pavement for people, not cars, as part of coronavirus recovery Colorado offers $4.1 million to cities that use pavement for people, not cars, as part of coronav... Across Colorado, communities large and small are diverting cars around main streets to allow more open-air, socially-distanced dining, shopping and strolling. And now the state is stepping in with a... summitdaily.com", "2020-06-15T17:13:26.000Z": "\"I spent 34 days in the hospital, starting with the ventilator and very gradually learning to swallow, walk, and eventually climb stairs again.\"\n\nMike Clark from the Colorado Department of Transportation shares his incredible story of survival. #COVID19Colorado Behind the Numbers: My Story Surviving COVID-19 covid19.colorado.gov", "2020-06-15T13:33:04.000Z": "The US Surgeon General says Coronavirus face masks promote freedom: \"If more wear them, we'll have MORE freedom to go out\" https:// cnn.it/3d62O8l", "2020-06-15T14:50:52.000Z": "No matter who you are or who you love your work is valued in the United States. Thank you to the Supreme Court for making the right decision for equality, inclusivity, and for a more resilient economy. Happy Pride! Quote Tweet USA TODAY @USATODAY Supreme Court grants federal job protections to LGBTQ workers https:// usatoday.com/story/news/pol itics/2020/06/15/supreme-court-denies-job-protection-lgbt-workers/4456749002/ ", "2020-06-14T22:03:33.000Z": "Let's not forget that Colorado also abolished the death penalty this year. If there has been a similarly important year in criminal justice reform, it was a long time ago. Quote Tweet Kyle Clark @KyleClark The impact of protests in Colorado: Statewide police reform Police out of Denver schools Denver Police barred from use of force on peaceful protesters Stapleton neighborhood dropping KKK-linked name\n\nHas any other state seen this much substantive change this fast?", "2020-06-14T20:49:51.000Z": "", "2020-06-13T16:54:30.000Z": "Currently, 40% of Colorado's workforce is not afforded the opportunity to earn paid sick days -- creating a \"work while sick\" culture that increases the transmission of deadly viruses such as COVID-19.\n\nSpeaker @kcbecker and @YadiraCaraveo 's bill change that. #COLeg  #COPolitics Quote Tweet KC Becker @kcbecker We just passed my bill with Dr. Rep. @YadiraCaraveo to ensure that every Coloradan, regardless of where they work, has access to earned #PaidSickLeave . #COVID19 has demonstrated how essential it is to have a safety net to protect our workers and businesses. #COLeg  #COPolitics", "2020-06-13T00:39:15.000Z": "I am honored to be here at this moment of time, alongside so many passionate Coloradans on the journey towards a more equal, more just, and more peaceful society as I sign SB20-217 when it reaches my desk. (4/4)", "2020-06-12T20:47:17.000Z": "Let's be smart and halt the virus! Masks Can Reduce Covid Spread By 40%, German Study Suggests Masks can reduce the growth rate of coronavirus infections by 40%, according to researchers who studied the experience of places in Germany that promoted their use. bloomberg.com", "2020-06-12T15:20:41.000Z": "Another study that shows the importance of wearing masks to DEFEAT the virus Quote Tweet Eric Feigl-Ding @DrEricDing AIRBORNE is the \"dominant\" route for the coronavirus transmission! New PNAS paper by a Nobel laureate's group concludes this based on study of several studies and how transmission wasn't truly slow until mask rules went into place. MASKS FOR ALL, please. https:// pnas.org/content/early/ 2020/06/10/2009637117  Show this thread", "2020-06-11T20:15:45.000Z": "Our state looks forward to having the ability to make sure that immigrants being detained by the federal government in our state are safe Quote Tweet Alex Burness @alex_burness With a 21-14 vote in the Senate, following previous approval by the House, the Colorado legislature has given final passage to a bill allowing the state health department to inspect the GEO ICE detention center in Aurora. The bill's broader than that, but GEO is its clear target. Show this thread", "2020-06-11T14:33:44.000Z": "slip and slide, Colorado style. Quote Tweet CPW NE Region @CPW_NE The Glenwood Springs State Fish Hatchery delivered 40,000 fingerling (2-inch) kokanee salmon to Middle Boulder Creek near the spillway into Barker Reservoir in Nederland today. #NEAquatics", "2020-06-10T18:53:01.000Z": "Study suggests that routine face mask use by 50% or more of the population reduced COVID19 spread to an R of less than 1.0. Other studies have generated similar estimates. More widespread masking with higher quality masks could help mitigate a second wave. Widespread mask-wearing could prevent COVID-19 second waves: study Population-wide face mask use could push COVID-19 transmission down to controllable levels for national epidemics, and could prevent further waves of the pandemic disease when combined with lockdow... reuters.com", "2020-06-10T14:47:31.000Z": "Anyone with symptoms of COVID-19 should get tested. \n\nSymptoms may appear 2-14 days after exposure to the virus. \n\nCall your health care provider and find a free community testing site near you https:// is.gd/7ZILOQ  #COVID19Colorado", "2020-06-04T22:06:08.000Z": "The use of masks, along with social distancing, are simple measures that can allow us to continue to enjoy our favorite outdoor activities like parks & open spaces. As we continue to deal with the reality of the virus still present, we need to protect ourselves & those around us.", "2020-06-04T20:24:37.000Z": "NEW: Gov. Polis' discretionary fund under the CARES Act will go to an innovation fund to address educational inequality and to improve online learning. #edcolo  #copolitics  https:// co.chalkbeat.org/2020/6/4/21280 807/how-colorado-gov-polis-will-spend-the-last-44-million-in-federal-education-relief-money  via @ChalkbeatCO How Colorado Gov. Polis will spend the last $44 million in federal education relief money Money from the governor's discretionary fund will go to close academic and economic gaps that widened during the pandemic and to improve the quality of online instruction. co.chalkbeat.org", "2020-06-04T01:03:43.000Z": "The Three Other Former Police Officers Involved In George Floyd's Death Have Been Charged And charges for former Minneapolis police officer Derek Chauvin have been upgraded to include second-degree murder. buzzfeednews.com", "2020-06-04T00:02:34.000Z": "If it portends plague, it's late Quote Tweet The Denver Post @denverpost An altocumulus floccus cloud showed up over Boulder on Wednesday morning - a sign of storms to come later in the day https:// dpo.st/3dvxi4P", "2020-06-03T22:42:51.000Z": "\"Pack like you're going to the moon\": executive director of the #Colorado Department of Natural Resources said preparation and planning are critical, amid parks reopening. #Colorado  #copolitics  #covid19  #CoronaVirusUpdates Colorado officials release guidance for outdoor recreation under updated coronavirus order Coloradans can again explore the great outdoors throughout the state under updated coronavirus restrictions, but the executive director of the state's Department of Natural Resources said preparation... coloradopolitics.com", "2020-06-03T20:30:40.000Z": "Free fishing! Being safer in our vast, great outdoors includes activities like fishing in our world-class mountain rivers and lakes. And In Colorado, fishing is always free for kids 15 and under! Quote Tweet Colorado Parks and Wildlife @COParksWildlife It's Free Fishing Weekend time To give everyone an opportunity to get out and cast some lines, we're inviting resident and nonresident anglers of all ages to participate in our annual Free Fishing Weekend on June 6 to 7.\n\nLearn more: https:// bit.ly/2QD0lIW", "2020-06-03T15:56:57.000Z": "NEW BLOG: \"So far, I've survived COVID-19, but this public health crisis seems different. It's a war of sorts, but this enemy is invisible, and, so much remains unknown about it. We do know older persons are at the greatest risk, particularly those with underlying health issues.\" Safer at Home In the time of COVID-19: A senior's perspective covid19.colorado.gov", "2020-06-03T05:02:33.000Z": "On behalf of a grateful nation, I thank the Republican primary voters of Iowa Iowa Rep. Steve King, Known For Racist Comments, Loses Reelection Bid After years of racist comments, King was largely abandoned by party leaders. He was defeated on Tuesday by state Sen. Randy Feenstra. npr.org", "2020-06-01T16:21:05.000Z": "Former President Barack Obama: \"If we want to bring about real change, then the choice isn't between protest and politics. We have to do both,\" he said, urging people to get involved and vote, but not to resort to violence. Obama condemns violence, outlines how protesters can bring about real change Former President Barack Obama released an essay on how he thinks Americans can sustain the momentum of the George Floyd protests to bring about real change. thedenverchannel.com", "2020-05-31T18:24:06.000Z": ". @MichelleObama : in a time when we're fighting to exist as a people, thank you for teaching my daughter, Naomi, she can be proud of who she is & can never reach too high. #Becoming  #BlackLivesMatter", "2020-05-27T13:55:00.000Z": "A public service announcement from Colorado's wildlife:\n\nWe're all in this together. #RecreateResponsibly .  #DoingMyPartCO", "2020-05-29T22:00:10.000Z": "Latest COVID-19 data summary for Colorado: 25,613 cases 173,300 total people tested 277 outbreaks 331 adult critical care ventilators in use 1,436 deaths among cases 1,181 deaths due to COVID-19 https:// covid19.colorado.gov/covid-19-data", "2020-05-28T18:57:12.000Z": "Thank you @trish_zornio for investing your time and effort in the pursuit of public service. Though serving in the US Senate didn't work out for you at this time, you elevated the issues and brought a needed focus on science. Thank you.", "2020-05-28T15:05:02.000Z": "We may be biased, but we think these license plates are some of the best on the road Want to learn more about the wildlife sporting license plate and how the design came to be? Read more: Step Up To The Plate - Colorado Outdoors Online Specialty license plates are like fancier, larger bumper stickers, only ones that also raise money for the cause, not just promote it. coloradooutdoorsmag.com", "2020-05-28T16:42:13.000Z": "Overwhelming response from frontline employees describing their daily interactions with people who hold the State Senator's view. Their messages often describe their daily concern based on their own health status balanced with their need to keep working. Quote Tweet Kyle Clark @KyleClark State Senator Vicki Marble's refusal to follow public health guidelines gets attention because she's an elected official, but frontline workers deal with the Vicki Marbles of the world every day. My commentary from #HeyNext . #9News", "2020-05-27T17:10:46.000Z": "Maj. Ldr. Steve Fenberg responds to GOPers who suggest Colorado senators now supporting remote voting are softer than previous generations.\n\n\"Yes, they might've been a little tougher than us in some ways. They also had higher infant mortality rates. They also died of dysentery.\"", "2020-05-27T21:37:00.000Z": "Colorado Gov. Jared Polis says wearing a face mask shouldn't be a political issue: \"It's really a civic responsibility to wear a mask when we're in public ... political leaders across the board should model that behavior\"", "2020-05-28T00:17:03.000Z": "RIP Larry Kramer, 84. To fight a different virus in a different era, Larry sounded alarm bells so loud they couldn't be ignored by the powers that be who wanted to ignore AIDS. His activism helped make living w HIV a condition rather than death sentence.", "2020-05-27T23:12:27.000Z": "The Constitutional right to petition won in court today! \"The State of Colorado has a very robust culture and history of initiative and referendum, and 'the right of initiative and referendum...is a fundamental right under the Colorado Constitution.' https:// courts.state.co.us/Media/Opinion_ Docs/20cv31708%20-%20Ritchie%20v%20Polis%20-%20FINAL%20as%20filed.pdf ", "2020-05-27T23:07:19.000Z": "A victory for the right of Colorado citizens to petition: \"Granting the preliminary injunction requested by the Plaintiffs would be against the public interest because it would create confusion and delay with the signature gathering processes for initiatives and referendum.\" Quote Tweet Rob McCallum @rwmccallum Judge McGahey has ruled in Ritchie/Colorado Concern v. Jared Polis. The Plaintiffs' motion is denied. #CoLaw  #CoLeg  https:// courts.state.co.us/Media/Opinion_ Docs/20cv31708%20-%20Ritchie%20v%20Polis%20-%20FINAL%20as%20filed.pdf ", "2020-05-27T15:52:16.000Z": "Something a little more light-hearted from @COParksWildlife but always good reminder to all of us to stay safe, wear a mask/face covering and #RecreateResponsibly  #coleg  #copolitics Quote Tweet Colorado Parks and Wildlife @COParksWildlife A public service announcement from Colorado's wildlife:\n\nWe're all in this together. #RecreateResponsibly .  #DoingMyPartCO", "2020-05-27T18:44:56.000Z": "For everyone who was at Gov. @jaredpolis news conference yesterday, or watching:\n\nI got his \"keggy kegger\" comment into this story and it's the best thing that's happened to me in a long time. Quote Tweet The Colorado Sun @ColoradoSun Safety and stoke: A-Basin's coronavirus reopening provides glimpse of what next ski season may look like https:// bit.ly/2XCUPd8 via @JesseAPaul", "2020-05-26T03:15:47.000Z": "So @jaredpolis when Klondike Bars give me Quarantine Ideas - Priceless #DoingMyPartCO  #HideAndSeek  #ByMyself  #CovidColorado  #Alone", "2020-05-25T03:06:49.000Z": "Masks are not partisan. Quote Tweet The Recount @therecount In a tearful speech, Gov. @DougBurgum (R-ND) asks residents to skip the \"ideological and political\" debate on face masks. Show this thread", "2020-05-24T01:44:16.000Z": "To minimize our future suffering and loss, please stay at least six feet apart from others not in your household, wear a facial mask, and be SMART. You have common sense how to stay safe. Use it.", "2020-05-22T19:34:29.000Z": "Everyone is excited for a weekend of backyard BBQs, hiking, and camping, but we still need to be smart to save lives and prevent the spread of COVID-19. #DoingMyPartCO", "2020-05-22T22:25:51.000Z": "JUST IN: Gov. Polis has signed an executive order that eliminates copays for COVID-19 testing for people who rely on Medicaid. The executive order also increases Colorado's Medicaid home health workforce. \n\nLatest #COVID19Colorado updates: Coronavirus in Colorado: Latest COVID-19 updates from May 22, 2020 More than 4,000 people who tested positive for the coronavirus in Colorado have been hospitalized for the virus, according to data released Thursday by the Colorado Department of Public Health and... thedenverchannel.com", "2020-05-21T20:33:55.000Z": "Colorado Gov. Jared #Polis ready for #Rockies to play baseball again https:// denverpost.com/2020/05/21/col orado-gov-jared-polis-sports-return/  via @denverpost Colorado Gov. Jared Polis ready for Rockies to play baseball again Although safety remains his paramount concern during the ongoing coronavirus pandemic, Colorado Gov. Jared Polis is ready and eager for sports to return. denverpost.com", "2020-05-21T00:16:21.000Z": "@jaredpolis  @GovofCO hearing the new plans to reopen include closing \"main streets\" so bars and restaurants can reopen and hope to pay their bills, and this Independent thinks you and @MayorofCOS are doing an EXCELLENT job of leading us through it.", "2020-05-18T17:56:47.000Z": "Most fun I've had in weeks. If you have flu-like symptoms I highly suggest that you try it. Quote Tweet Jesse Aaron Paul @JesseAPaul Colorado Gov. @jaredpolis receives a coronavirus test. He said he felt a tickle as a swab was inserted far up his nostril. #copolitics", "2020-05-17T19:35:02.000Z": "Governor Jared Polis signed two executive orders on Saturday to ensure elections can proceed in a safe manner and protect access to the ballot.​ Gov. Polis signs executive order to ensure safe elections DENVER (KDVR) - Governor Jared Polis signed two executive orders on Saturday to ensure elections can proceed in a safe manner and protect access to the ballot.  \"This is a challenging time fo kdvr.com", "2020-05-16T23:23:02.000Z": " @jaredpolis  @GovofCO - I know you support our #veterans . On this #ArmedForcesDay may I suggest you watch my latest documentary short, @25StepsFilm . Two Coloradans you will NEVER forget. Narrated by Peter Coyote. Simple distribution for creators - Xerb Watch amazing content. Connect with the creators who make it. xerb.tv", "2020-05-16T23:16:34.000Z": "I finally got targeted for an ad for a mask that I'm actually tempted to buy", "2020-05-16T20:02:34.000Z": "Thank you @justinamash for always putting principle over party, and best wishes for whatever comes next!", "2020-05-16T15:35:00.000Z": "It's #ColoradoPublicLandsDay  What do you love most about Colorado public lands? Reply here in words and photos", "2020-05-16T17:58:40.000Z": "Thank you @GovofCO for stepping up and protecting people's health as well as direct democracy by allowing alternatives to in-person signature gathering during these extraordinary times! Quote Tweet Kyle Clark @KyleClark NEW: @GovofCO Polis order allows email & mail-in petition signature gathering for ballot issues. This is a big deal because ballot issues  previously required extensive face-to-face signature gathering campaigns. (ie, in your face outside grocery stores) #9News  #covid19colorado Show this thread", "2020-05-16T04:59:01.000Z": "Colorado Observes Moment Of Silence To Honor Those Who Died From Coronavirus Colorado Observes Moment Of Silence To Honor Those Who Died From Coronavirus Coloradans gathered for a moment of silence on Friday night to honor the lives of those lost to coronavirus. denver.cbslocal.com", "2020-05-16T01:33:00.000Z": "Remember those lost Do your part Stay safe, Colorado", "2020-05-16T01:07:17.000Z": "", "2020-05-15T23:46:40.000Z": "To close out today's press briefing, @GovofCO put on his new Rockies mask, hand-made by our friend @OrangeCrushtina , and talked a little baseball", "2020-05-15T20:50:11.000Z": "Today I welcomed an announcement today that Peterson Air Force Base in Colorado Springs will be the provisional headquarters of U.S. Space Command for at least the next six years. The final decision will be in January 2021.", "2020-05-15T01:11:18.000Z": "Tomorrow at 7 pm buildings around CO will turn red to honor those we have lost to #COVID19 and stand together with the families of victims in our fight against this deadly virus. You can join by wearing a mask as a symbol that we will do our part & observing a moment of silence.", "2020-05-14T15:28:34.000Z": "Big News to celebrate Colorado Public Lands Day: We've officially acquired the Fishers Peak property! More than a year after joining a partnership to acquire the 19,200-acre ranch, we've completed the purchase to begin developing your next state park. https:// cpw.state.co.us/aboutus/Pages/ News-Release-Details.aspx?NewsID=7363 ", "2020-05-14T15:55:18.000Z": "Some great partners, tremendous local leadership & a great champion in @GovofCO helped bring Fishers Peak into the State Park system.  Its not open to the public yet, but hopefully soon. Stay tuned! #coleg Quote Tweet Colorado Parks and Wildlife @COParksWildlife Big News to celebrate Colorado Public Lands Day: We've officially acquired the Fishers Peak property! More than a year after joining a partnership to acquire the 19,200-acre ranch, we've completed the purchase to begin developing your next state park. https:// cpw.state.co.us/aboutus/Pages/ News-Release-Details.aspx?NewsID=7363  Show this thread", "2020-05-14T11:33:46.000Z": "Back to Colorado. Hopefully no more travel until this pandemic is over.", "2020-05-13T17:55:14.000Z": "Here are some of the oddly specific advertisements for facemasks that I've been getting in my feed recently. The Star Trek and Golden Girls masks hit the mark (if I was in the market for a mask), but that cat one just scares me!", "2020-05-13T16:37:46.000Z": "It's inspiring to see the innovative entrepreneurial spirit of Coloradans. Mobile food trucks, walk-up windows, new pop-up takeout restaurants, and delivery services are bringing jobs and (for customers) increased dining choices during the pandemic. Denver restaurants try out pop-up concepts during coronavirus shutdown Sandwich shops, pierogi purveyors, fancy hot dogs, bento boxes, burritos, ice cream, even Hawaiian-style shave ice. theknow.denverpost.com", "2020-05-13T15:24:11.000Z": "Yea and Pueblo, CO already has the infrastructure to be an industrial city. From steel city to solar city? Let's get it @CityofPueblo  @elonmusk  @jaredpolis . #GameChanger Quote Tweet Elon Musk @elonmusk Replying to @jaredpolis @Tesla and @kimbal Hi Jared, Colorado is great! I think your policies make a lot of sense.", "2020-05-13T11:07:45.000Z": "Park officials plan to use Colorado's \"safer-at-home\" guidance as they slowly reopen popular destination Rocky Mountain National Park to begin reopening at the end of May Rocky Mountain National Park plans to increase recreational access and services on May 27 as part of a phased reopening. denverpost.com", "2020-05-13T05:53:26.000Z": "We want you here @elonmusk in Colorado, we are the best of all worlds. We're very pro-business, low taxes, also pro-immigration, pro-LGBT, globally-minded. Bright, smart, motivated ppl love to live here. @Tesla HQ, Cybertruck, gigafactory look no further! @kimbal", "2020-05-12T16:53:15.000Z": "Today, @GovofCO Jared Polis launched Spanish-language Facebook and Twitter pages to help disseminate important information related to the COVID-19 pandemic. Follow on Twitter: @GovofCoEspanol . Visit the Facebook page at http:// facebook.com/GovofCoEspanol .", "2020-05-13T04:49:21.000Z": "¿Hablas español? Sígueme en mi nueva @GovofCoEspanol twitter\nen español, donde podrás encontrar las últimas noticias de mi oficina y el estado de Colorado", "2020-05-11T19:57:30.000Z": "...Team @GovofCO  is proud to support this innovative partnership w/ ... @rmpbs  ... @edinitiativeco  @ColoradoEA  ... @garycommunity  ...& more to bring high-quality, standards-aligned literacy instruction to CO kids & families Colorado teachers will lead literacy lessons on public television Colorado children in kindergarten through third grade will soon be able to access age-appropriate literacy lessons by turning on the TV. co.chalkbeat.org", "2020-05-09T19:36:52.000Z": "Replying to @jaredpolis Look like a bad-ass with a mask or a sad husk of a man without one.\n\nChoose to look awesome. Wear a mask.", "2020-05-09T19:31:31.000Z": "When Darth Vader took his mask off in public, it didn't work out well for him. Remember to wear a mask when you are out.", "2020-05-09T00:40:15.000Z": "The pandemic has vastly reduced everything national conservatives despise: Immigration, trade, and \"vapid\" consumerism. \n\nMan, this sucks.", "2020-05-08T19:36:06.000Z": "During Safer at Home let's continue doing our part.\n-Wear a mask in public\n-Stay at home as much as possible - especially those at higher risk for severe illness\n-Wash your hands often \n-Keep gatherings to 10 or fewer & stay 6 ft. from others\n-Connect with one another virtually", "2020-05-07T22:55:55.000Z": "Every day I hear stories about Colorado teachers going above and beyond for their students. During #TeacherAppreciationWeek , I want to again thank Colorado's dedicated educators that are continuing to work hard and educate our youngest Coloradans during these difficult times.", "2020-05-07T14:28:19.000Z": "One year ago today, we lost a young hero who died saving others at STEM School Highlands Ranch.\n\nRest In Peace, Kendrick. Your bravery won't be forgotten.", "2020-05-07T15:47:21.000Z": "TIL: Hundreds of tiny arachnids live on our faces! Two different species of mites- tiny arachnids related to spiders and ticks- live most of their lives head down inside a single pore. Hundreds of tiny arachnids are likely on your face right now Scientists aren't sure what microscopic face mites do, but they know where to find them: in the pores and hair follicles of most adult humans' faces. nationalgeographic.com", "2020-05-06T15:09:32.000Z": "Today is #NationalNursesDay ! And now more than ever we're thankful for their hard work and dedication.", "2020-05-06T18:42:52.000Z": "\"... We've increased testing by about 10 times from when this started, which was only a month and a half ago. We now have the capacity to process about 10,000 state tests each day in-state,\" Colorado Gov. @jaredpolis tells @jeremyhobson . Colorado Governor On Easing Restrictions As Coronavirus Cases Fall Colorado is slowly easing restrictions, as its cases trend down. wbur.org", "2020-05-06T18:06:18.000Z": ". @JaredPolis signed an executive order last year to protect #WildlifeMigration in the state. This week, @COParksWildlife completed its first comprehensive review of CO's migration corridors. More from @PNS_CO on this crucial first step: New Report Key to Protecting CO Big-Game Migration DENVER -- Colorado Parks and Wildlife on Tuesday released its 2020 Status Report on big-game winter range and migration corridors. The report marks a big step in Gov. Jared Polis' 2019 executive... publicnewsservice.org", "2020-05-04T21:18:55.000Z": "US House candidate, CO-7 Colorado's vote by mail system has increased participation in our elections by more than 9 percentage points. Every state should adopt a similar voting system to increase participation and keep people safe from COVID-19. Opinion | We Should Never Have to Vote in Person Again Our new paper shows vote-by-mail dramatically boosted Colorado's turnout. It could change this fall's election and every election after. nytimes.com", "2020-05-04T20:31:15.000Z": "#MayThe4thBeWithYou , Colorado. Remember to wear a mask and stay two lightsabers (6 ft) from others. You don't have to be a Jedi to protect others from the dark side. #DoingMyPartCO", "2020-05-04T14:39:39.000Z": "Happy Star Wars Day! #MayThe4thBeWithYou", "2020-05-03T23:40:58.000Z": "Wear a proper mask. Don't be a #rangerfail", "2020-05-03T00:05:00.000Z": "In case you missed it, this week the CDC announced that there are now nine main symptoms of COVID-19. Call your doctor if you have symptoms or have been in close contact with a person known to have COVID-19.\n\nLearn more:  http:// covid.colorado.gov   http:// cdc.gov/coronavirus", "2020-05-03T00:01:29.000Z": "It's time to pass the PRIME Act to better secure our food supply and support small ranchers Quote Tweet Thomas Massie @RepThomasMassie Dozens of Republicans, Democrats, and Independents support this bill in both the House and the Senate.  Let's put politics aside and pass the PRIME Act before more animals are unnecessarily wasted in land fills and rendering plants. twitter.com/justinamash/st", "2020-05-01T23:31:12.000Z": "Colorado has established a worker and racial health disparities hotline. Thank you @GovofCO for your leadership! No lives are expendable. We must work to save lives now. #coleg  #Covid_19 Quote Tweet Colorado Politics @colo_politics @leslieherod said  she was relieved and pleased that the governor expanded the state's 2-1-1 to allow employees and heath care patients to report discrimination. #COpolitics  #COVID19Colorado  https:// coloradopolitics.com/coronavirus/st ate-2-1-1-hotline-expands-to-hear-coronavirus-discrimination-claims/article_68a65670-8bf8-11ea-bae0-4fc81d26cb0b.html ", "2020-05-01T00:52:43.000Z": "We humans aren't obsolete yet! Computers legally need a front person to claim credit and ensure patent protection for their inventions for the foreseeable future US patent office rules that artificial intelligence cannot be a legal inventor Following similar decisions from European agencies. theverge.com", "2020-04-29T18:58:46.000Z": "Gov. @jaredpolis wrote a guest column for The Denver Post, explaining where we're at and where we're going in Colorado's coronavirus response. \"I have faith in the data, the science, and the people of Colorado that we can be successful in this new phase\": Polis: Coloradans have done a great job. Now comes the hard part. We all need to continue to take this seriously and do right by our fellow Coloradans. If we don't, we'll have to tighten restrictions again. Nobody wants that. denverpost.com", "2020-04-26T16:24:55.000Z": ". @Jaredpolis is one of the smartest people in American politics. He looks at data & has good judgment. His approach to reopening Colorado is sensible. There is no easy answer to the reopening decision but people have to make the call and have a plan based on available information Quote Tweet The Hill @thehill Colorado governor defends lifting restrictions: We have to make the best decision based on \"information we have\" http:// hill.cm/2rWdWHE", "2020-04-27T15:21:02.000Z": "If you happen to be hanging out with Julio down by the schoolyard, or anywhere else for that matter, make sure to wear a mask because you never know when you might run into Rosie, the queen of Corona.", "2020-04-25T19:24:02.000Z": "Wearing a cloth face covering CORRECTLY can help prevent the spread of #COVID19 to others. When you go out on essential trips, follow these \"do's\". If you have a child, remember those under age 2 should not wear a face covering. See https:// bit.ly/2R9av5m .", "2020-04-22T23:21:12.000Z": "From successfully washing your hands with soap many times each day. Congrats @MikeKonopasek Quote Tweet Michael Konopasek @MikeKonopasek . @GovofCO wants to see our dry and chapped hands. #DoingMyPartCO", "2020-04-22T18:59:46.000Z": "I love you planet Earth! Happy Earth Day 2020!", "2020-04-21T02:14:41.000Z": "This is an unprecedented and disastrous action that will slow down the economy further, impair the essential functions of the economy, & hobble our economic recovery. Quote Tweet Donald J. Trump @realDonaldTrump In light of the attack from the Invisible Enemy, as well as the need to protect the jobs of our GREAT American Citizens, I will be signing an Executive Order to temporarily suspend immigration into the United States!", "2020-04-20T15:42:04.000Z": "headed into the week like From CPW NE Region", "2020-04-18T16:30:08.000Z": "Happy Caturday It's been a treat seeing your favorite wildlife sightings in Colorado.\n\nKeep sharing them with us!  #DearColorado  : Lori Price Bollendonk", "2020-04-18T16:30:03.000Z": ". @vp greeted by mask wearing Colorado governor @jaredpolis Pence to speak at Air Force Academy commencement today.", "2020-04-18T16:55:10.000Z": "While growth of the deadly virus slows in CO, it's a huge threat for a long time. By keeping distance from one another, wearing masks as we re-open over April 27th throughout May we can avoid mass deaths that exceed medical capacity AND devastating closure Less than half of L.A. County residents still have jobs amid coronavirus crisis Only 45% of Los Angeles County residents are still employed, a national survey released Friday shows. Meanwhile, uncertainty and anxiety grow. latimes.com", "2020-04-18T13:29:04.000Z": "These tough times bring out the best in us, but also bring out the worst. Thank you @JoeNeguse for going after snakes who profit from exploiting us. Quote Tweet Shaun Boyd @CBS4Shaun Joe Neguse Introduces Bill To Crackdown On Price Gouging Amid Coronavirus Pandemic https:// cbsloc.al/2yhfiez#.Xppt6 l9mz04.twitter   #copolitics", "2020-04-16T06:28:07.000Z": "", "2020-04-15T19:51:07.000Z": "Thank you to our friends in #Taiwan , President Tsai @iingwen , @MOFA_Taiwan , Director General Chang and @TECO_Denver for their recent donation of 100,000 medical masks to the State. These supplies will be critical in protecting those on the front line fighting #COVID19 .", "2020-04-15T03:26:34.000Z": "Hi @BarackObama ! Like most high school/college seniors, I'm saddened by the loss of milestone events, prom & graduation. In an unprecedented time, it would give us great comfort to hear your voice. We ask you to consider giving a national commencement speech to the class of 2020.", "2020-04-14T15:47:23.000Z": "I'm proud to endorse my friend @JoeBiden for President of the United States. Let's go: Barack Obama @BarackObama Endorsement of Joe Biden for President", "2020-04-12T17:05:00.000Z": "This week, we unveiled a new state website with FREE resources, http:// stayathomeco.colorado.gov . It has health resources, education, entertainment, and more to make staying at home more bearable. You can even suggest a resource that we should add. #DoingMyPartCO", "2020-04-12T12:12:03.000Z": "Did you wear a mask when you went outside yesterday? Reader: Be a Good Neighbor. Wear a Mask! Readers debate whether they should don masks. westword.com", "2020-04-10T18:29:52.000Z": "More than 250 members of the CO Nat'l Guard supporting state and local officials combat #COVID19Colorado state wide at operations centers and shelters for those without homes in the Denver area. @GovofCO , @LtGovofCO  #WarOnCOVID19 # #Coronavirus  @usnationalguard  #InThisTogether", "2020-04-09T16:49:50.000Z": "Cloth face coverings should: Be clean and in good repair. Fit snugly, but comfortably. Be secure so you don't have to adjust. Include multiple layers of fabric. Allow for breathing without restriction. Be able to be laundered and machine-dried. #COVID19Colorado", "2020-04-09T17:46:00.000Z": "Hey Colorado - Did you know I'm also on Instagram and Facebook? I even have a weekly newsletter that I write myself. It's a great way to stay up-to-date on COVID-19. Instagram: https:// instagram.com/govofco/  Facebook: https:// facebook.com/jaredpolis/  Newsletter: https:// colorado.gov/governor/newsl etter ", "2020-04-08T23:22:50.000Z": "Actually made passable Charoset! I'm usually not the designated Charoset person, but this Passover we are all doing it in new ways! Almost time to FaceTime extended family... Happy Passover!", "2020-04-08T17:40:23.000Z": "Staff at @SwedishMedical in Englewood clapped and cheered as a patient who had COVID-19 was released from the hospital.", "2020-04-07T02:05:52.000Z": "Great example from @SheridanSchools of addressing basic & educational needs of #homeless students & their families. Keys are outreach, connecting w/ resources, addressing educational barriers. @DuffieldBarbara  @JamieFasteau  @ctrupin  @JeffBridges Remote learning: How one small Colorado district leverages its closeness with families Sheridan school officials looking to launch remote learning have borrowed ideas from across the country and are getting creative with ways to help their families. co.chalkbeat.org", "2020-04-07T15:05:00.000Z": "We will get through this together, Colorado. Remember, you are not alone.", "2020-04-06T18:47:54.000Z": "CGI U partner school @MSUDenver is answering Colorado Governor @JaredPolis ' call to creatively address the fight against COVID-19. The school's Industrial Design and Art departments are using 3D printers to print critical PPE for local health centers. ( cc: @MSUDenver )", "2020-04-06T13:55:33.000Z": ". @GovofCO said to wear masks when you go outside. He said to be creative. Here are your Denver coronavirus masks The situation is not funny, but these are. denverite.com", "2020-04-03T19:50:41.000Z": "New extensions announced by @GovofCO :\n-Income tax extension until July 15 (we knew this one)\n-Salex tax extension until May 20\n-Property tax extension until May 1 #copolitics  #9News", "2020-04-03T20:09:59.000Z": "#coloradomaskproject Let's wear masks, Colorado! Anything that covers your nose and mouth, and doesn't get in the way of your breathing.", "2020-04-02T15:03:52.000Z": "THIS! Stay home, Colorado.\n\nThank you to @karshhagan for making these and sharing them! #DoingMyPartCO", "2020-04-02T05:15:02.000Z": "Dear scientists, \nPlease cure this thing and find a vaccine. The sooner the better. \nThank you", "2020-04-02T04:35:39.000Z": "Just watched the season finale of Picard... minor spoiler unrelated to the main plot: wow! Seven of Nine is lesbian (or bi)!", "2020-04-01T21:03:45.000Z": "Our mountains and world class recreation areas will be here long after this crisis, and long after any of us. #stayathome Quote Tweet Colorado Department of Public Health & Environment @CDPHE This is not a vacation; it's a pandemic. There are still an alarming number of people traveling to our mountain communities, putting themselves and others at risk. Whether you're a second homeowner or weekend warrior, please stay home. We NEED to protect our mountain communities.", "2020-04-01T16:31:50.000Z": "Playful kits? Or siblings as stay-at-home order progresses? You tell us  #DoingMyPartCO  #WildlifeWednesday", "2020-03-30T17:57:59.000Z": "At the Colorado EOC everyone - including the Governor - gets screened and receives a temp check. If you are wondering he is 97.5 today.", "2020-03-30T00:20:00.000Z": "Extend driver's licenses so people don't have to go to the DMV. @GovernorVA and @GovofCO  @jaredpolis have done this. More states should follow. http:// bit.ly/2Wr6EUS  @NickZaiac  #Coronavirus  #COVID19 Small Regulatory Reforms That Can Help People During the COVID Pandemic - R Street While the federal and state governments figure out the appropriate way to stop the spread of the new coronavirus, there are plenty of narrow regulatory reforms they can implement to help people deal... rstreet.org", "2020-03-26T21:05:37.000Z": "", "2020-03-26T19:21:49.000Z": "In my town, Lamar (other places too?) people are putting bears in windows or out in the yard. Kids taking health walks with their folks try to spot them, for the fun of it. We had to pop in at our (closed) store to try off a few loose ends, so I put Bubba on watch. #bearhunt", "2020-03-26T19:19:25.000Z": "", "2020-03-25T23:13:57.000Z": "Stay at home.", "2020-03-25T15:20:20.000Z": "Take a break and learn about our national bird, the bald eagle. Thanks to decades of protection and #conservation work, the bird has enjoyed an amazing recovery.", "2020-03-25T02:11:59.000Z": "Please Colorado, #StayAtHome . So many folks coming in for presumed #covid . We need your help to stop this. Your actions matter!!!", "2020-03-25T02:20:01.000Z": "The greatest generation stormed the beaches at Normandy and families turned in their pots and pans to be melted down. We're asking you to give up getting a haircut or mani pedi for two weeks and to stay at home. Quote Tweet Kyle Clark @KyleClark A hairdresser says clients are pressuring her to cut hair at home while salons are closed. \"I feel angry and disrespected like me and my family are expendable to their needs.\" #9News  #covid19colorado", "2020-03-25T01:57:40.000Z": "A hairdresser says clients are pressuring her to cut hair at home while salons are closed. \"I feel angry and disrespected like me and my family are expendable to their needs.\" #9News  #covid19colorado", "2020-03-24T23:57:31.000Z": "#StayAtHomeSaveLives Quote Tweet The Denver Post @denverpost Opinion | Editorial: Stay at home during the coronavirus epidemic even if your mayor, governor or president hasn't ordered it yet https:// dpo.st/2QCXssY", "2020-03-24T22:32:57.000Z": "Opinion | Editorial: Stay at home during the coronavirus epidemic even if your mayor, governor or president hasn't ordered it yet Editorial: Stay at home during the coronavirus epidemic even if your mayor, governor or president... Coloradans must take this virus seriously or the government will step in and do it for us. denverpost.com", "2020-03-24T19:05:11.000Z": "While many playgrounds in Colorado have already closed, avoid those that are still open. Bike rides, walks, and hikes are great alternatives - as long as you stay 6 feet away from others. https:// covid19.colorado.gov/slowing-commun ity-spread   #COVID19Colorado", "2020-03-24T22:29:10.000Z": "Colorado nears 1,000 cases. Here is today's COVID-19 case summary for the state:\n912 cases (+192)\n84 hospitalized (+12)\n35 counties (+4)\n7,701 people tested (+1,477)\n11 deaths (+4)\n7 outbreaks at residential and non-hospital health care facilities (+2) https:// covid19.colorado.gov/case-data", "2020-03-24T13:41:38.000Z": "The European Union welcomes the decision of the State of Colorado to abolish the death penalty. #Colorado becomes the 22nd US State to take this important step in line with the trend worldwide. Thank you, #Colorado ! \n\nStatement: https:// eeas.europa.eu/headquarters/h eadquarters-homepage/76427/united-states-statement-spokesperson-abolition-death-penalty-colorado_en ", "2020-03-23T23:25:23.000Z": "Social distancing is the best tool we have to slow the spread of COVID-19. Let's work together. #DoingMyPartCO  #COVID19Colorado", "2020-03-23T20:58:52.000Z": "Staying at home? No problem. We'll bring the outdoors to you.\n\nEnjoy Ridgway State Park in 360°  https:// youtu.be/wfjUhIco9LI  #livelifeoutsideCO GIF", "2020-03-23T20:25:49.000Z": "Last week, San Miguel Cty issued a stay at home order for non-critical functions.Addt'l isolation measures were also taken in Gunnison, Eagle, and Summit. Today, Denver issued similar orders. I strongly support these local actions, based on science and data, to contain the virus", "2020-03-23T18:51:37.000Z": "At 2pm today, we will be sharing an important announcement regarding Denver's latest COVID-19 reponse efforts. Please watch and share. The live stream will be available at http:// denvergov.org or http:// facebook.com/5280mayor .  @CityofDenver // @DenverOEM", "2020-03-23T18:10:58.000Z": "#Boulder will light the Flagstaff Star out of season to provide hope for the community amid the #coronavirus pandemic: Boulder to light Flagstaff Star to \"raise the hopes of our beloved community\" amid coronavirus... The Boulder Chamber has decided to light Boulder's Flagstaff Star out of season to \"raise the hopes\" of residents coping with the impact of the new coronavirus. dailycamera.com", "2020-03-21T05:37:55.000Z": "Washington Governor @JayInslee : \"Someone asked the other day, 'what's the penalty for a young person going out to a restaurant, or hanging in a social get-together?' And it's true the penalty is that you might kill your grandparent\"", "2020-03-20T17:04:06.000Z": "I'm providing an update on what my administration is doing to help Coloradans in the short term while ensuring that we can stabilize and grow our economy. Watch it at http:// Facebook.com/jaredpolis or below Quote Tweet Denver7 News @DenverChannel Colorado Gov. Jared Polis is providing an update on the latest on the state's response to COVID-19. https:// twitter.com/i/broadcasts/1 yoKMarOAyWKQ  Show this thread", "2020-03-21T01:53:12.000Z": "We need direct payments, which are the most efficient way to support Americans during this hardship. Low-income families should benefit as much as higher-income families. Payments need to be larger and faster than what's been proposed and treat adults and kids the same.", "2020-03-20T15:19:18.000Z": "I'm so proud to be a Coloradan. We support each other when things get tough. Thank you to these businesses for making sure our seniors are taken care of.", "2020-03-19T21:42:41.000Z": "#WeApplaud everyone doing their part to #FlattenTheCurve . #DoingMyPartCO", "2020-03-19T22:53:45.000Z": "True that. Quote Tweet Matt Gray @matthewogray Real quick @jaredpolis I know you're really busy but can we get an emergency declaration requiring people to mute their phones on conference calls, let me know thanks.", "2020-03-19T22:26:09.000Z": "Thank you to our health care workers, our first responders, our supermarket workers, and everyone else stepping up in this crisis!", "2020-03-19T20:40:42.000Z": "US House candidate, CO-2 Thanks to @SBAgov for responding to our letter & granting @GovofCO 's application for a disaster declaration to assist small businesses.  \n\nAn important first step, but we must keep fighting for monetary relief for families, workers & our small businesss! Colorado receives disaster declaration from feds, freeing up loans for small businesses The U.S. Small Business Administration has approved Colorado's request for a statewide disaster declaration, a move that will free up billions in emergency loans at low interest rates for sma denverpost.com", "2020-03-19T16:53:58.000Z": "Thank you @TulsiGabbard for bringing your warm aloha spirit to the presidential race and for reaching out to those we don't always agree with to help grow a winning coalition Rep. Tulsi Gabbard drops out of the Democratic presidential primary, endorses Joe Biden Tulsi Gabbard said on Thursday that she has dropped out of the 2020 Democratic presidential primary race. The congresswoman from Hawaii, who officially jumped into the race in February 2019, never... cnbc.com", "2020-03-19T16:51:20.000Z": "ICYMI: Safeway, Target and Whole Foods are making sure senior citizens, pregnant women and those with underlying health conditions will be able to shop exclusively during select times of the week. Safeway, Target and Whole Foods among retailers reserving shopping time for at-risk customers As people around the country rush to the grocery store for essential items in the wake of the novel coronavirus' spread, major retailers are reserving shopping time for those considered most  denverpost.com", "2020-03-19T14:22:25.000Z": "Thank you @WholeFoods Quote Tweet Marshall Zelinger @Marshall9News Starting today, @WholeFoods said it would open one hour early to accommodate 60+ aged shoppers. Show this thread", "2020-03-19T14:22:08.000Z": "Thank you @Safeway Quote Tweet Marshall Zelinger @Marshall9News Starting tomorrow, @Safeway in Colorado (and other nearby states) will open TUESDAYS/THURSDAYS from 7a-9a for \"senior citizens and other at-risk populations, such as pregnant women or those with compromised immune systems.\" Show this thread", "2020-03-18T18:00:23.000Z": "We are all Colorado Strong, and that has always meant helping one another.  Looking for a way to do that?  Please visit: http:// HelpColoradoNow.org and see what you can do to help others. #DoingMyPartCO GIF", "2020-03-18T19:01:58.000Z": "I'm proud to announce the Help Colorado Now effort where Coloradans can donate or volunteer to the Colorado COVID Relief Fund to help Coloradans impacted by the coronavirus. \n\nWebsite: http:// HelpColoradoNow.org Press Release: https:// colorado.gov/governor/news/ gov-polis-coloradans-launch-covid-relief-fund ", "2020-03-17T18:25:42.000Z": "Looking for things to do that don't involve being around large groups of people? Luckily, we live in the best state in the country with great weather year-round. Here are a few suggestions if you're looking to get outside, but still keep our communities safe. #DoingMyPartCO", "2020-03-17T22:57:32.000Z": "US House candidate, CO-2 #DoingMyPartCO by meeting by phone with scientists at @ColoradoStateU (who are working tirelessly to develop a #covid19 vaccine!), donating to my local food pantry & fighting for immediate economic relief for families\n\nI challenge my friends @kcbecker  @RepJeniArndt & @Ed4Colorado", "2020-03-17T13:51:02.000Z": "Today is my son's fifth birthday! We're #DoingMyPartCO and celebrating at home-cancelling his party and a long-planned camping trip to Moab.\n\nCan you help show him the best of humanity by replying and wishing Austin a Happy Birthday? @jaredpolis  @KyleClark  @kjorgeson", "2020-03-17T18:26:03.000Z": "Thank you to @denverpost for temporarily taking down their paywall and allowing members of the public free, unrestricted access to high-quality journalism and up-to-date and accurate  information about the virus, how to avoid it, and its impact on our way of life.", "2020-03-17T18:14:16.000Z": "Social distancing is an effective public health strategy to prevent the spread of disease. If you need to go out in public, please stay six feet away from others. http:// ow.ly/A7rE50yOacN  #COVID19colorado", "2020-03-17T16:45:05.000Z": "Be brave. #DoingMyPartCO   #livelifeoutsideCO", "2020-03-17T14:11:45.000Z": "It takes every Coloradan to stop the spread of COVID-19. Help spread the word and share this to your profile if you're doing your part.\n\nThank you to everyone who is paying attention, following guidance, and putting the health of ourselves and our community first. #DoingMyPartCO", "2020-03-17T00:48:10.000Z": "#DoingMyPartCO by getting gift certificates to my favorite local small businesses so they'll have cash now and we'll be sure to go back when COVID-19 clears. I challenge @KyleOnKeys  @salaams_from_68  @SenCoryGardner  @SenatorBennet Quote Tweet Governor Jared Polis @GovofCO #DoingMyPartCO is our way of stopping the spread of COVID-19 in Colorado. I'm doing a conference call in my office instead of meeting in person. What are YOU doing to stop the spread? \n\nI challenge @KyleClark  @JoeStGeorge  @blairmiller  @CBS4Tim", "2020-03-17T00:57:01.000Z": "1/ Thanks for tagging me, @GovofCO ! #DoingMyPartCO is our way of stopping the spread of #covid19 in Colorado. I'm staying in tonight and filling out my Census form, which just arrived.", "2020-03-15T21:19:24.000Z": "This applies to EVERYONE who was up there. At risk or not. Symptoms or not. Spread the word to people you know who have been in the high country. #9News Quote Tweet Colorado Department of Public Health & Environment @CDPHE UPDATE: Anyone who has been in Eagle, Summit, Pitkin, or Gunnison counties in the past week should minimize all contact with other people, whether or not they are experiencing symptoms. Specific recommendations here: http:// ow.ly/hqcf50yMiNj", "2020-03-16T01:59:00.000Z": "I'm at our emergency command center this evening... we will get through this this together #coloradostrong", "2020-03-14T17:02:28.000Z": "I stopped by our drive-up COVID-19 testing site at Denver Coliseum this morning to thank the state workers & national guard who make this possible! Beginning today, this site is supported by the @CONG1860 to enable our @CDPHE to stand up additional mobile testing in other areas.", "2020-03-13T17:44:08.000Z": "UCHealth has opened a drive-up sample collection site for COVID-19 in Colorado Springs just east of Memorial Park.  Samples will be collected from 9 a.m. - 5 p.m.  You MUST have a doctor's note. Read more in the article. UCHealth suspends drive-up sample collections A drive-up facility is no longer open for COVID-19 testing in Colorado Springs. UCHealth is conserving testing supplies. koaa.com", "2020-03-12T17:05:35.000Z": "\"With Fishers Peak in Southern Colorado becoming our newest State Park, this law could not have come at a better time. I'm proud that we were able to deliver a win for Colorado's veterans today.\"\n\nRep. @Bri4CO on her bill becoming law #COLeg  #COPolitics Polis signs bill expanding free park access to veterans Gov. Jared Polis on Wednesday signed a bill into law that allows veterans to more easily access state parks free of charge. The bill was authored by state Rep. Bri Buentello. \"This simple new law... chieftain.com", "2020-03-11T17:54:54.000Z": "The Colorado Affordable Health Care Option bill will be heard in committee today! \n\nThe #ColoradoOption will lead to lower premiums increased competition in the marketplace fairer hospital costs\n\nHear from bill sponsor @Dylan_RobertsCO  #COLeg  #COPolitics", "2020-03-11T16:19:08.000Z": "A drive-up testing lab where patients with a doctor's note can get tested for coronavirus is set to open in Denver. \"This needs bold, early action,\" says @GovofCO Jared Polis. \"The actions taken in those first few days and weeks are absolutely critical.\" https:// cnn.it/2TUmO6g", "2020-03-11T16:54:34.000Z": ". @CDPHE has opened up the state's first drive-up testing center at the State Lab in Denver. \n\nWhat you need to know: 8100 E. Lowry Blvd, Denver, CO 80230 10 AM - 2 PM Wednesday - Friday Must have doctor's order and photo ID Testing is free\n\nMORE: https:// colorado.gov/pacific/cdphe/ news/cdphe-open-first-drive-testing-center-state-lab-lowry ", "2020-03-11T13:12:53.000Z": "Thanks, @jaredpolis , for this valuable guidance.  As we are discovering, 20 seconds feels like a long time-when washing hands.  And singing happy birthday twice gets old; any other 20 second song suggestions? Quote Tweet Governor Jared Polis @GovofCO The number one question I get is what Coloradans can do to protect themselves and keep safe from COVID-19. \n\nHere is what you can do.\n\nShare this with your friends and family to help stop the spread of COVID-19. \nLatest: http:// bit.ly/CoronavirusCO", "2020-03-10T02:55:38.000Z": "Thank you to @AuroraMayorMike and the Aurora City Council for having me today and discussing how the state can be a partner with the city of Aurora.", "2020-03-09T18:12:28.000Z": "Going to go out on a limb and guess there's a lot of you that are stressed out right now.\n\nTake a break and relax by learning about Colorado's red fox. Hang in there!  #livelifeoutsideCO", "2020-03-09T15:54:32.000Z": "I have instructed that insurance companies make COVID-19 testing free. This important step will help ensure cost barriers do not stand in the way of people getting tested. \n\nRead more: https:// colorado.gov/governor/news/ consumer-advisory-division-insurance-directs-insurers-covid-19-coverage ", "2020-03-05T19:07:31.000Z": "CO Democrats announce new Colorado Health Care Option, a public-private effort to drive health costs down, increase competition #cohealth  #copolitics", "2020-03-06T01:26:49.000Z": "Yo Twitter! Here it is: https:// leg.colorado.gov/bills/hb20-1349 hot off the press, the Colorado Affordable Health Care Option. I can't wait to fight to get this passed - it's the right thing to do! And I've got two of the best w/ me @Dylan_RobertsCO  @Kennedy4CO in the battle. #coleg  #healthcare", "2020-03-05T17:08:54.000Z": "For each of us the journey is different. I was fortunate to have a supportive family that made it easier. I enjoyed working w @aaronschock in Congress, am glad he overcame his legal troubles and is now ready to live life honestly and openly as a gay man. Ex-GOP Congressman Aaron Schock Finally Comes Out: 'I Am Gay' - Towleroad Gay News Aaron Schock, the disgraced former Republican congressman from Illinois, confirmed what most already knew on Thursday when he came out as gay in an Instagram post and on his website. \"For those who... towleroad.com", "2020-03-05T16:51:30.000Z": "Governor @jaredpolis is here and giving his address at Net Zero Cities. #netzerocities", "2020-03-05T16:19:51.000Z": "Thank you @ewarren for inspiring millions with a campaign based on real ideas and plans for a progressive future. The fight for a just future might be entering a new phase, but it has only just begun. You laid the groundwork with your energizing candidacy for President.", "2020-03-04T15:25:18.000Z": "Mike Bloomberg will have a lot to do with it if the Democrats defeat Trump in the Fall - his resources and data analytics are second to none. Kudos to him for his commitment to the country and for making this decision. Quote Tweet CNN Politics @CNNPolitics BREAKING: Former NYC Mayor Michael Bloomberg ends his presidential campaign and endorses Joe Biden https:// cnn.it/2TDsDVG", "2020-03-03T14:48:11.000Z": "IT'S SUPER TUESDAY Don't forget to fill out your ballot for the Super Tuesday primary and drop it off at a ballot box or polling place by 7 PM. No matter who you vote for in the Republican or Democratic presidential primary, it's just important that you vote!", "2020-03-03T16:07:35.000Z": "Happy Super Tuesday!", "2020-03-02T22:56:15.000Z": "Gov. Polis ate at one of the Chinese restaurants in Denver seeing fewer customers due to coronavirus concerns. \"It's important in the face of coronavirus that Coloradans don't take it out on any Asian-American Coloradans or Asian-owned businesses.\" Gov. Polis visits Asian businesses in Denver as coronavirus concerns The governor ate lunch at a restaurant that recently told us it's lost business because people are scared of the virus. denverite.com", "2020-03-03T00:15:10.000Z": "Thank you @AlecGarnett for working to ensure that the vote of all Coloradans is counted. If someones choice drops out, they should still be able to cast a provisional ballot for a remaining candidate through Election Day Quote Tweet Alec Garnett @AlecGarnett \"Every voter should have the opportunity...to pull a provisional ballot and vote for who remains in the race,\" #coleg  #copolitics  https:// denverpost.com/2020/03/02/col orado-super-tuesday-primary-ballots/ ", "2020-03-02T19:54:14.000Z": "Dim Sum lunch at Star Kitchen, 2917 W Mississippi Ave in solidarity with Colorado's Asian-American Community.", "2020-03-02T19:03:15.000Z": "Thank you Senator Amy Klobuchar for your unifying message and your commitment to a vision built on progress and action. We will miss your presence in the Presidential race, but I know you will continue to work tirelessly on behalf of our nation in the years ahead.", "2020-03-01T23:25:18.000Z": "Thank you @PeteButtigieg for making a headline like this possible and inspiring LGBT youth to know that anything is possible", "2020-03-01T23:24:11.000Z": "Thank you @PeteButtigieg for your historic run, sorely needed message of unity, and forward looking vision. We're all better for having had you in this race, and I can't wait to see what you have in store next!", "2020-03-01T03:28:37.000Z": "Thank you @TomSteyer for devoting your life this past year towards running to serve our nation as President. Your legacy of important ideas elevated the national discussion, and I know you have a lot more to give for America.", "2020-03-01T02:30:17.000Z": "At the 25th Birthday Party for @DENAirport Denver International Airport, rated best airport in North a America w former Governor Roy Romer", "2020-02-29T19:26:14.000Z": "Absolutely true. Humane husbandry and reduced prophylactic use of antibiotics in farmed animals (not related to Coronavirus but related to antibiotic resistant bacteria) is a public health imperative. Quote Tweet Ari Armstrong @ariarmstrong The word is that COVID-19 originated with animal-human contact in China. It seems obvious that better, more sanitary, and hopefully more humane raising of animals can reduce the risk to people of dangerous infectious diseases.", "2020-02-29T07:00:14.000Z": "Happy Leap Day!", "2020-02-28T17:33:27.000Z": "Gia sunning herself this morning", "2020-02-28T15:18:02.000Z": "#FelineFriday  We're in awe of this shot of the often elusive and secretive bobcat Have you ever had the fortune of seeing a bobcat in the wild? : Instagram's goodbulloutdoors", "2020-02-28T06:09:17.000Z": "http:// Q.How do you stay warm in any room?\nA.Just huddle in the corner, where it's always 90 degrees.", "2020-02-27T21:48:22.000Z": "Today @LtGovofCO Primavera and I released an updated 2020 Roadmap to Saving Coloradans Money on Health Care to reflect the progress made over the last year to lower health care costs for Coloradans. \n\nREAD MORE: http:// bit.ly/2TpKwqI", "2020-02-27T04:22:32.000Z": "I want a President candidate to take on the CULINARY deficit, but in the mean time please pass the sushi and spaghetti!", "2020-02-27T00:49:05.000Z": "Colorado's tribal youth haven't been included in the state's teen lawmaking council - until now http:// bit.ly/2Vp7Nf3  #copolitics via @moe_clark15 Colorado's tribal youth haven't been included in the state's teen lawmaking council - until now Gov. Jared Polis on Wednesday signed into law his first bill of 2020, which added two tribal youth positions to the Colorado Youth Advisory Council coloradosun.com", "2020-02-26T23:01:02.000Z": "Occupational licensing reform champions exist on all sides of the political spectrum, from @dougducey to @jaredpolis , and @BarackObama to @realDonaldTrump . https:// catalyst.independent.org/2020/02/25/occ upational-licensing-regimes-are-tough-to-dislodge-so-lets-try-a-different-approach/   @CatalystVoices  @elilehrerdc Occupational Licensing Regimes Are Tough to Dislodge, So Let's Try a Different Approach | Eli Lehrer It's time for a new strategy that focuses on changing the scope of professional licenses. catalyst.independent.org", "2020-02-26T18:06:08.000Z": "Read every word of Jenna Riley's story. @FaithWinterCO and I understand delivering paid family and medical leave is hard.\n\nBut inaction has a cost. It's paid by new moms like Jenna. It's paid by cancer patients who cut short chemotherapy to go back to work. It's time for action. Quote Tweet Andy Kenney @AndyKnny Why Unpaid Leave Means 'No Leave' For Many New Parents In Colorado https:// cpr.org/2020/02/26/why -unpaid-leave-means-no-leave-for-many-new-parents-in-colorado/  Show this thread", "2020-02-25T21:11:55.000Z": "I voted... have you?", "2020-02-24T23:39:40.000Z": "We finally have some details about how the \"state option\" for health insurance might work (thread): Colorado consumers could save up to 20% under state health insurance option, Polis says Colorado Gov. Jared Polis's office released a plan Monday to limit how much the \"state option\" for insurance would pay hospitals, with a goal of reducing consumers' monthly  denverpost.com", "2020-02-24T20:03:27.000Z": "What's best for consumers in this bill is also what's best for our environment. Auto Dealers in Colorado have fought tooth and nail against efforts to bring more electric vehicles to our state. It's time to let Coloradans buy what they want, however they want to buy it! Quote Tweet Sean M Mitchell @seanmmitchell Irony of SB167 hearing this week is NOT ONE consumer who testified was not in support of the bill. EVERY. SINGLE. CONSUMER. was in support. Time to take the training wheels off dealerships! 100 years is too long @KevinPriola  @HansenForCO  @FaithWinterCO  @JeffBridges  @SteveFenberg", "2020-02-24T17:47:45.000Z": "Siempre en nuestros pensamientos. Estamos en solidaridad con nuestros valientes hermanos y hermanas que han arriesgado sus vidas por el sueño de la Libertad en todo el mundo. Quote Tweet Juan Guaidó @jguaido Hace un año la dictadura asesinó a aquellos valientes hermanos pemones que defendían la Libertad. \n\nNo olvidaremos ese ni ninguno de los actos cobardes que el usurpador ordenó contra un país que quiere vivir con dignidad.\n\nHaremos justicia y sanaremos las heridas.", "2020-02-24T06:04:32.000Z": "2,000 years late for a date Scientists in Israel grow date plants from 2,000-year-old seeds Seeds found in Judean desert are male and female, leading to hopes of producing dates theguardian.com", "2020-02-23T01:08:34.000Z": "Early diagnosis is critical to save money on healthcare and save lives. This new technology to detect bladder cancer early through a simple urine test is promising. Urine test detects bladder cancer up to 10 years before clinical signs A compelling new study from the World Health Organization's International Agency for Research on Cancer (IARC) is suggesting a simple biomarker in urine may be an effective predictive test for... newatlas.com", "2020-02-23T00:52:35.000Z": "Best wishes to my friend, Governor Phil Murphy of New Jersey Quote Tweet Governor Phil Murphy @GovMurphy Friends - I've got a tumor on my left kidney and will undergo a partial nephrectomy in early March to remove it. The prognosis is very good and I'm profoundly grateful to my doctors for detecting the tumor early. Show this thread", "2020-02-20T16:05:30.000Z": "It's #LoveYourPetDay ! Gia loves using me as a headrest! It's one of my favorite things. I'd love to see photos of your furry friends!", "2020-02-19T21:36:29.000Z": "Come to Colorado! Leave Florida and move to Colorado, where gay and transgender people are protected, group urges A Colorado group has launched a statewide campaign to lure businesses away from Florida, touting more sunny days, legalized weed and stronger protections for LGBTQ citizens. orlandosentinel.com", "2020-02-19T01:59:45.000Z": "As of now, according to the prediction markets, there is an 80% chance that for the first time a major party will nominate someone Jewish for president. Amid so much division, it is encouraging that this barely seems to be an issue.", "2020-02-19T14:29:44.000Z": "Sen. @KerryDonovanSD5 and I are building a broad coalition of support from groups, providers, and everyday citizens who know Coloradans deserve more choices and lower prices with a Colorado insurance option - working collaboratively, not divisively. #coleg Groups supporting public option pen a letter to Colorado lawmakers The letter dated Jan. 22, provided to Colorado Politics Tuesday, speaks of a \"true crisis\" in every corner of the state and urges the General Assembly to deliver affordability, transparency coloradopolitics.com", "2020-02-18T23:32:04.000Z": "It's OFFICIAL We now have TWO Democratic candidates on the record preferring the Pueblo chile over the (inferior) Hatch chile, @ewarren and @TomSteyer ... who's next? https:// projects.coloradosun.com", "2020-02-18T21:08:50.000Z": "Lunch with @GovofCO talking about equity, transportation, affordable housing, other proposed legislation, and yes, pit bulls. Keeping an open line between the Governor and Mayor on the key issues benefits our whole state.", "2020-02-18T14:46:40.000Z": "https:// denver.cbslocal.com/2020/02/16/den ver-public-library-copirg-waste-landfills-legislation-brianna-titone/?fbclid=IwAR24ECYXsUaNaQpMMIoZl4ZJI4GqwvoFQurPhERZ1A2eyKvnArnPBhCEOz4#.XkqtBw0htvA.facebook   #HB1195 will give people the right to fix their own stuff and be sure that manufacturers design products differently and have parts available to be safely repairable. #RightToRepair Clinic Helps Consumers Fix What They Already Bought (And Broke) Many people throw out perfectly good products just because they don't know how to fix them when they break. denver.cbslocal.com", "2020-02-18T20:40:26.000Z": "Touching op-ed from @GGW_CO on what it means to visit @COParksWildlife State Parks w/his 5 yr old son & supporting \"I Love Colorado State Parks Act.\" @ConservationCO  #coleg  #copolitics Opinion: Let's put Colorado back on track to fund and protect our state parks coloradosun.com", "2020-02-17T02:16:17.000Z": "Freda, a friend's new pit bull rescue pup, joined us at the governors mansion in Denver tonight (shhhh )", "2020-02-16T23:47:47.000Z": "Could appear any day now (which would mean it happened 645 years ago), or in a decade, century, or a few thousand years What Will a Betelgeuse Supernova Look Like From Earth? Astronomers simulated what humans will see on Earth when the star Betelgeuse explodes as a supernova sometime in the next 100,000 years. discovermagazine.com", "2020-02-16T01:22:00.000Z": "Exciting to see Governor @jaredpolis 's commitment to expanding #preschool in Colorado. \"In Oklahoma, every kid can go to preschool. It's about time we caught up with Oklahoma.\" @chalkbeat  #prek Polis pitches preschool expansion, insists Colorado can afford it Colorado Gov. Jared Polis supports a preschool expansion that will ensure every 4-year-old has access. co.chalkbeat.org", "2020-02-15T00:46:43.000Z": "I honestly didn't think Ethereum could get any weirder. Then it did. CO and WY governors @jaredpolis and @Mark_Gordon_WY reading \"B is for Bufficorn\" onstage with kids, and a Bufficorn, at @EthereumDenver .", "2020-02-13T17:46:10.000Z": "We welcome @amazon distribution facility to Colorado Springs! Over 1,000 new jobs starting at $15/hour + great benefits", "2020-02-12T02:06:04.000Z": "Thank you to Colorado's Sen. @MichaelBennet for running a dignified campaign rooted in innovative policy and bridging divides. Colorado and America are better for your continued leadership.", "2020-02-12T01:47:12.000Z": "Thanks @AndrewYang for the creative ideas and innovative spirit you brought to the presidential race. It was so much fun watching you on the campaign trail. I know you'll continue to do great work for our nation.", "2020-02-10T19:05:11.000Z": "Yum! How Scientists Know Our Human Ancestors Ate Insects Slimy, yet satisfying? discovermagazine.com", "2020-02-09T16:52:48.000Z": "The difference between my classical liberalism and Bernie's and Trump's socialism is I believe the government should secure our rights, not secure the power of central planners who violate our rights. Quote Tweet The Hill @thehill \"The difference between my socialism and Trump's socialism is I believe the government should help working families, not billionaires.\" http:// hill.cm/dziU61C", "2020-02-09T16:43:41.000Z": "Unlike John Hickenlooper, Jared Polis is a very hands-on policymaker. On what this means for bills and relationships at the Capitol: Colorado Gov. Jared Polis draws lines. Which ones will Capitol Democrats cross? Lawmakers in the majority are starting to show some new willingness to push back on their fellow Democrat. denverpost.com", "2020-02-08T23:28:58.000Z": "Colorado's @GovofCO wants to find ways to lower healthcare costs for Coloradans and Americans as a whole.  This is just one issue of many up for discussion at the @NatlGovsAssoc conference in the nation's capital. @JLAngeline reports. https:// graydc.com/content/news/G overnors-discuss-key-issues-in-the-nations-capital-567691751.html ", "2020-02-08T16:24:51.000Z": "Hanging out w Captain America ... @ChrisEvans ", "2020-02-07T19:40:10.000Z": "Colorado has come a long way, but we still have a lot of work ahead. #copolitics  #safeschools  #LGBTQhealth  #LGBTQequality  #LGBTequality  #TransRightsAreHumanRights Colorado becomes national leader in LGBTQ policies, protections The Human Rights Campaign's sixth annual State Equality Index was released last week. coloradopolitics.com", "2020-02-05T14:55:44.000Z": "There's a 100% chance we're celebrating meteorologists today! We're lucky to have some of the best meteorologists in the world here in Colorado and I can't thank them enough for the important work they do! #nationalweatherpersonsday", "2020-02-02T07:14:17.000Z": "\"...The horror began- I learned in the same moment -of believing myself prisoner in the body of an axolotl, metamorphosed into him with my human mind intact, buried alive in an axolotl, condemned to move lucidly among unconscious creatures...\"\nAxolotl by Julio Cortázar", "2020-02-01T18:54:00.000Z": "California can keep Coachella... We have Birdchella. High Plains Snow Goose Festival in Lamar is for the birds The High Plains Snow Goose Festival in Lamar, Colorado is the perfect excuse to see the Colorado snow goose migration in action. theknow.denverpost.com", "2020-01-31T15:11:10.000Z": "Thanks to @GovofCO  @jaredpolis for your leadership on climate! It's always a good time when @NRDC and @e2org join forces. Quote Tweet Bob Keefe @bkeefee2 Thank you @GovofCO  @jaredpolis and @GinaNRDC - and First Dog Gia - for helping celebrate @e2org 's 20th anniv and @nrdc 's 50th in #Denver last night. And thanks especially @GovofCO and team for your leadership on #climate and #cleanenergy . #Colorado rocks!", "2020-01-31T15:09:05.000Z": "ColoradoEcoDevo: RT CORecIndustry: govofco joined us on the show floor today at outdoorretailer to meet companies and talk about how Colorado plans to help tackle #climatechange . #DYK Colorado has a goal of being 100% renewable by 2040?\n\nThank you to a", "2020-01-31T15:04:01.000Z": "Thank you for adding so much to the policy discussions on moving our country forward @JohnDelaney and best wishes for whatever you take on next Quote Tweet John Delaney @JohnDelaney lt has been a privilege to campaign for the Democratic nomination for President, but it is clear that God has a different purpose for me at this moment in time. Read my full statement here: 1/19 https:// johndelaney.com/2020/01/31/joh n-delaney-announces-decision-to-withdraw-from-2020-race/  Show this thread", "2020-01-29T18:26:36.000Z": "Thank you @GovofCO for your commitment to world-class education and a workforce training system that is agile, responsive, and innovative. #CCCSCapitolDay", "2020-01-29T22:21:46.000Z": "Fascinating: Colorado Gov. Jared Polis just announced that marijuana and beer companies are partnering on an energy efficiency plan where carbon is captured in the brewing process and then used to grow cannabis plants. https:// marijuanamoment.net/colorado-marij uana-and-beer-companies-will-partner-to-boost-energy-efficiency-governor-announces/ ", "2020-01-28T22:56:09.000Z": "Huge win today! HB20-1015 passed committee today with overwhelming bipartisan support. This is the first step the protecting our public education by working to end the educator shortage here in Colorado! #famliesfirst  #hd47  #SupportEducation  #CoPolitics  #coleg  #coschools  #edu", "2020-01-28T17:56:14.000Z": "Proud to declare it Larry Walker Week in Colorado! Larry Walker is the first Colorado @Rockies player to ever reach the Baseball Hall of Fame! #WalkerHOF", "2020-01-27T07:05:33.000Z": "Mind if I come take a few whacks? Quote Tweet Cory Voss @cory_voss WE DID NOT COME TO TAKE PART, WE CAME TO TAKE OVER! INTRODUCING THE MILL It is my pleasure to bring to you Southern Colorado's premier indoor baseball training facility. #Dominate", "2020-01-27T00:18:47.000Z": "WE DID NOT COME TO TAKE PART, WE CAME TO TAKE OVER! INTRODUCING THE MILL It is my pleasure to bring to you Southern Colorado's premier indoor baseball training facility. #Dominate", "2020-01-25T05:54:05.000Z": "Something must be off w @amazon targeting... usually it's spooky because it's stuff I could theoretically be interested in. But this... I have no idea what it is and zero desire to find out.", "2020-01-23T20:14:50.000Z": "This pack is likely the first wolves to call Colorado home since the 1930s. Incredibly exciting news! \n\nWe are continuing to fight against the Administration's attempt to rollback the Endangered Species Act. Protections for wolves in Colorado are essential. Quote Tweet The Denver Post @denverpost Polis welcomes wolves back to Colorado after wildlife officers confirm pack of 6 in Moffat County https:// dpo.st/2GhAd1M", "2020-01-23T03:49:15.000Z": "Colorado Gov. Polis welcomes wolves back to state Polis welcomes wolves back to Colorado after wildlife officers confirm pack of 6 in Moffat County The sighting comes as voters will be asked this year whether to reintroduce endangered gray wolves to the state denverpost.com", "2020-01-15T16:06:55.000Z": "Congratulations to Rep. Jason Crow on being named one of seven House impeachment managers. This solemn responsibility, during the third impeachment trial in our nations history, will be capably executed by Rep. Crow. May wisdom guide the weighty decision facing the Senate.", "2020-01-22T06:00:48.000Z": "...and then suddenly in 2020, searches for the word \"pettifogging\" skyrocketed", "2020-01-22T03:48:13.000Z": "Happy 33rd birthday @BoingBoing , you don't look a day over 20! Boing Boing is 20 (or 33) years old today Today is the twentieth anniversary of Boing Boing in its current incarnation. It looked like this in 2000. Here's a brief history of Boing Boing, which actually goes back 33 years. Carla and  boingboing.net", "2020-01-22T01:10:41.000Z": "Invited @GovofCO  @JaredPolis down to the district on Friday to talk early childhood education in @LPSK12 . Enjoyed an informative and engaging convo with teachers, admin, and parents, and crushed it playing Memory with the kids. #coleg", "2020-01-21T23:55:50.000Z": "The RIGHT CHOICE! Congrats to Larry Walker, first @Rockies player elected to the Hall of Fame. Walker dominated the league and earned his spot alongside the other baseball greats.", "2020-01-20T06:31:24.000Z": "If the same thing is happening on our side of the pond, it will help save people money on healthcare here too Amount of sugar sold in soft drinks drops by 29% in the UK ndph.ox.ac.uk", "2020-01-19T17:42:49.000Z": "Rita's, in my hometown of Pueblo is a favorite of ... @jaredpolis  - The Pueblo Chieftain #mexicanfood  #pueblocolorado Rita's: Longtime Pueblo restaurant a favorite of the governor A frequent criticism of state government leaders is that some of them act as if the Centennial State's southern border is located somewhere around Colorado Springs. When he was campaigning for... chieftain.com", "2020-01-17T15:15:24.000Z": "#Colorado crearía un seguro público de salud. En entrevista exclusiva, @GovofCO  @jaredpolis revela que evalúa la creación de un seguro público de salud. #public -option #salud  #segurodesalud Colorado aprobaría un seguro de salud público - GOBERNADOR POLIS APOYA A LOS DREAMERS Redacción El Comercio de Colorado Click here to read... elcomerciodecolorado.com", "2020-01-17T06:29:17.000Z": "Happy 98th birthday, Betty White!Born Jan 17, 1922 in Oak Park, IL, Betty began her TV career in 1939. From the Mary Tyler Moore Show to The Golden Girls, Betty inspires fans with her positive attitude. She still works, voicing a toy named Bitey White in Toy Story 4 last year.", "2020-01-16T21:33:54.000Z": "Did you know @GovofCO is a beekeeper? Watch this new video where we interviewed him about his relationship with our most important pollinators! #bees  #NoBeesNoFood", "2020-01-16T02:57:22.000Z": "Thanks @GovofCO - Enrollment closes at midnight! Increasing enrollment helps all of us save $$! #cohealth  #coleg  #copolitics Quote Tweet Governor Jared Polis @GovofCO This Wednesday is the open enrollment deadline for Coloradans to enroll in individual health insurance plans. I encourage Coloradans to take advantage of the historic premium reductions thanks to reinsurance & enroll in a plan before Wednesday's deadline. https:// colorado.gov/governor/news/ open-enrollment-individual-coverage-deadline-january-15 ", "2020-01-15T02:30:05.000Z": "EDITORIAL: Polis' push for health care reform recognizes Colorado's most pressing problem | Sentinel Colorado http:// ow.ly/2lGv50xVH4D  #COpolitics  #HealthCare  #Obamacare  #PublicOption  #UniversalCare", "2020-01-12T06:35:48.000Z": "New meaning to the phrase \"rat race\" https:// scientificamerican.com/article/teachi ng-rats-to-drive-a-new-model-for-learning/ ", "2020-01-10T22:34:34.000Z": "Worms that live 500% longer!! Scientists Extend Lifespan of Worms by 500 Percent Scientists have found a way to increase the lifespan of C. elegans worms fivefold, which would be equivalent to a human reaching the age of 400. futurism.com", "2020-01-10T19:18:08.000Z": "\"Our focus is is to make sure that ag. isn't just a story of Colorado's heritage, but that it's a dynamic and growing part of Colorado's economic future.\" - Gov. @jaredpolis  #bootsnbiz  #findyourwestern", "2020-01-10T19:01:46.000Z": "Governor Polis laid out bold plans for 2020 in his #stateofthestate address: protect and improve access to public lands increase renewable energy act on climate \n\nLearn how TNC and partners are working with @GovofCO to create CO's next state park http:// bit.ly/35AuY7x", "2020-01-09T21:15:10.000Z": "POLIS: 'We don't build walls of exclusion, we build ladders of opportunity' | Sentinel Colorado http:// ow.ly/QYKW50xRxdb  #COgov  #COleg  #COpolitics", "2020-01-09T20:11:16.000Z": ". @GovofCO was right in his State of the State today: \"We work for the people.\" And the people of Colorado demand further action to bring lower health care prices and choice. We won't let misleading special interest money intimidate us from doing what is right. #coleg  #copolitics", "2020-01-09T19:45:04.000Z": "Colorado, I love you. Thank you for trusting me to be your governor.", "2020-01-09T18:42:08.000Z": "Today, during his State of the State address, @GovofCO  @jaredpolis recognized Samantha Hosmer, a mom from Erie, who used our new all-day kindergarten to be able to join @SVVSD in a new job in special education.", "2020-01-09T18:18:17.000Z": "About to give my 2nd State of the State speech #coloradoforall", "2020-01-09T06:01:38.000Z": "I love the clever ways my followers respond to trolls", "2020-01-08T16:40:59.000Z": "\"More CO children than predicted have enrolled in full-day kindergarten, but these additional students are unlikely to break the state budget...Robust enrollment is a win for education advocates via @ChalkbeatCO Now we know the full cost of Colorado's full-day kindergarten expansion More Colorado children than predicted have enrolled in full-day kindergarten, but these additional students are unlikely to break the state budget. co.chalkbeat.org", "2020-01-08T06:22:52.000Z": "Estoy muy orgulloso de lo que hemos logrado en mi primer año como gobernador: kinder gratuito por todo el día y le ahorramos dinero a los coloradences en el cuidado de salud. \"Los inmigrantes son parte muy importante de nuestro estado\": Jared Polis El Gobernador de Colorado Jared Polis hace un balance de su primer año de gobierno, en una entrevista exclusiva con Telemundo Denver. telemundodenver.com", "2020-01-07T23:36:19.000Z": "I'm going over last-minute changes to the state of the state address with my team today. We've accomplished so much in the past year and I'm looking forward to working together to accomplish more in the year ahead! \n\nWhat do you want to hear in the speech on Thursday?", "2020-01-07T23:58:21.000Z": "Our thoughts and prayers are with our servicemen and servicewomen as well as civilians at al-Asad AirBase in Iraq.", "2020-01-07T05:03:14.000Z": "Every child deserves a chance to reach their full potential. @GovofCO toured Bright Academy, Aurora in my Senate District and neighborhood. It's a great learning facility with great educators. Thanks Gov Polis for building stronger futures for early learners. #CoEd  #coleg", "2020-01-06T23:52:02.000Z": "I'm #JewishAndProud . Amid the rising antisemitism in the U.S. and abroad, the American Jewish Committee ( @AJCGlobal ) has designated today (January 6), as #JewishandProud Day. Antisemitism and hate have no place Colorado.", "2020-01-06T03:35:52.000Z": "Another reason I love Nepal is that it resembles my home state of #Colorado in many ways, most notably the stunning mountains & rivers/lakes. Nepal always makes me feel like I'm home! #VisitNepal2020", "2020-01-05T23:44:39.000Z": "Not suggested A man says he accidentally swallowed his AirPod and found that it still worked after passing... A man in Taiwan swallowed his AirPod while sleeping and found that it still worked, according to The Daily Mail. He passed the device naturally. businessinsider.com", "2020-01-05T01:44:23.000Z": "Yum! Quote Tweet Colorado Farm & Food Alliance @ColoFarmFood Deeply rooted in time and place, Colorado's #SanLuisValley is cultural treasure, a long-time mixture of Hispanic and Anglo traditions which can still be seen in its farming and food heritage today. #COpolitics  #FoodMatters Great piece by @CPRnews  @cprwarner Show this thread", "2020-01-03T00:01:42.000Z": "Gov. @JaredPolis wants to \"get to the bottom\" of Colorado's drone mystery http:// dpo.st/2QDyokJ by @ShellyBradbury Gov. Jared Polis wants to \"get to the bottom\" of Colorado's drone mystery Colorado Gov. Jared Polis said Thursday he wants to \"get to the bottom\" of the ongoing drone mystery in rural northeast Colorado even as reports of the unmanned aircraft continue nightly. denverpost.com", "2020-01-02T23:33:22.000Z": "If you're on Medicaid, we'll pay you $10 for signing up to quit smoking! To enroll in Colorado QuitLine, call 1-800-QUIT-NOW and ask for the $10 incentive Colorado Medicaid Offers $10 Incentive For Members To Quit Tobacco If quitting smoking is your New Year's resolution, Colorado Medicaid wants to help. denver.cbslocal.com", "2020-01-02T20:40:04.000Z": "Today is the 100th anniversary of the birth of Isaac Asimov, who died in 1992 at age 72 of AIDS. He wrote/edited over 500 books on science, history, the Bible, Shakespeare, and of course science fiction. Asimov, who coined the term \"robotics,\"  was a true Renaissance man.", "2020-01-01T14:48:08.000Z": "In his first year: Free full-day kindergarten for all $100 529 for all new CO babies Massive climate change legislation Lower health insurance premiums And a 3% reduction in the income the tax rate!  @jaredpolis Is my nominee for 2019 #GovernorOfTheYear Quote Tweet Jared Polis @jaredpolis Our Colorado income tax rate is coming down from 4.64% to 4.5% for 2020! https:// coloradosun.com/2019/12/31/jar ed-polis-income-tax-reform-colorado-politics-opinion/ ", "2020-01-01T18:14:16.000Z": "Every child born or adopted in Colorado will now start out with a college savings account w $100 automatically deposited in it Colorado hopes dropping $100 into college savings accounts for every newborn will mean more higher... A new state initiative aims to give Colorado families a head start in the long race to save for higher education by offering $100 in seed money for the college savings accounts of every newborn or... coloradosun.com", "2020-01-01T18:00:26.000Z": "My eight-year-old son and I went looking for quartz crystals in the ground last summer, and now he's proud of being a minor minor miner.", "2020-01-01T05:45:23.000Z": "Happy New Year! May 2020 be an inspirational year of happiness, joy, and health for everyone in Colorado, America, and the world.", "2019-12-31T21:13:57.000Z": "Starting January 1st, all children born or adopted in Colorado will start off with a $100 college savings account, thank you @SteveFenberg and @leslieherod Every child born or adopted in Colorado starting Jan. 1 will get $100 for college savings account Every baby born or adopted in Colorado can get a $100 contribution to their college savings account, thanks to a new program that goes into effect Jan. 1. thedenverchannel.com", "2019-12-31T15:20:30.000Z": "Our Colorado income tax rate is coming down from 4.64% to 4.5% for 2020! Jared Polis: A New Year's tax cut surprise for every Coloradan coloradosun.com", "2019-12-31T01:32:36.000Z": "Q. Why doesn't logic work when the Enterprise is moving slowly?\n\nA. Because you need to use only impulse.", "2019-12-29T23:29:20.000Z": "I just learned that my dear friend, former colleague, and hero @repjohnlewis has been diagnosed with stage 4 pancreatic cancer. He fought his whole life for freedom, equality, basic human rights. I wish him the strength needed to beat the odds and win this fight against cancer.", "2019-12-29T19:00:45.000Z": "I'm shocked and saddened by the attack in Monsey, NY. Bursting into a Rabbi's home and attacking innocent people during Hanukkah festivities is \nan inexcusable act of anti-Semitism and domestic terrorism. I condemn anti-Semitism and all forms of bigotry and hate.", "2019-12-29T17:16:59.000Z": "Our bipartisan reinsurance program to save people money on healthcare is gaining national attention! @NBCNews highlights the Dennison family of Durango, whose monthly insurance premiums are decreasing by over $700/month! Colorado program aims to slash health insurance premiums so more can get covered Colorado's \"reinsurance\" program uses a pool of state and federal funds to cover the highest health care claims for insurance companies, allowing them to slash premiums for families. The plan doesn't... nbcnews.com", "2019-12-29T02:04:39.000Z": "Happy for this Durango family and the many others who are benefitting from #Reinsurance . Grateful to this bipartisan team!... @KerryDonovanSD5 , ... @votebobrankin , Rep. Janice Rich #COHealth  #Healthcare  #coleg  #copolitics Colorado program aims to slash health insurance premiums so more can get covered Colorado's \"reinsurance\" program uses a pool of state and federal funds to cover the highest health care claims for insurance companies, allowing them to slash premiums for families. The plan doesn't... nbcnews.com", "2019-12-26T21:52:37.000Z": "Colorado, you're full of surprises and wonder Have a favorite wildlife sighting from 2019? We'd love to hear it. Share below!  : Bryan Conley", "2019-12-26T16:45:56.000Z": "When Pres. Trump was elected, I was hopeful he would bring our men and women home from endless wars like Afghanistan. Instead, he nearly doubled the number of troops there. Even after reductions, there are still thousands more troops there now than when Pres. Obama left office.", "2019-12-26T19:27:36.000Z": "Thank you Gov. @JaredPolis for recognizing the work of @AmeriCorps in Colorado. Like you, I know that service can change lives and hope that all Americans can continue \"showing up and giving back\" well beyond the holiday season. Polis: Coloradans have a proud tradition of giving back, keep it going This December, I want to acknowledge Coloradans who have gone above and beyond to give back, and I want to challenge my fellow Coloradans to spread joy this holiday season. denverpost.com", "2019-12-26T15:23:41.000Z": "\"The clamping arrangement between the Lego blocks causes the Lego structures to behave as an extremely good thermal insulator at cryogenic temperatures...\" Scientists chilled Lego bricks to near absolute zero and discovered something cool That's 2,000 times colder than deep space. cnet.com", "2019-12-24T21:55:20.000Z": "Merry Christmas! Tonight the Christians of Colorado and the entire world rejoice: For unto you is born this day in the city of David a Savior, who is Christ the Lord.\nLuke 2:9", "2019-12-24T14:37:20.000Z": "I attended a stop on @jaredpolis listening tour and learned a lot...\n\nHere's what concerns Coloradans most - and what they want to see changed in the next decade http:// bit.ly/35UumLd  #copolitics Here's what concerns Coloradans most - and what they want to see changed in the next decade From affordable health care to the growing threat of wildfires, here's what a group of Colorado citizens had to say about what's on their mind coloradosun.com", "2019-12-23T19:15:27.000Z": "US House candidate, CO-2 Deeply grateful to @jaredpolis for his leadership. His pardon decision today will hopefully ensure Ingrid Latorre, a wonderful member of our community, can spend the holidays at home with her children. Thank you Governor Polis!  #FamiliesBelongTogether", "2019-12-22T19:50:59.000Z": "Happy Hanukkah!!! GIF", "2019-12-18T01:18:13.000Z": "THANK YOU COLORADO: By working together, we accomplished so much this year - but there's more work to be done. Thank you for trusting me to be your governor.", "2019-12-17T06:14:58.000Z": "Open source is the future Polis announces challenge to institutions, educators to make course materials free A 2018 study from Cengage, a digital learning company, reported that 40% of college students said they skipped meals to help pay for course materials. coloradopolitics.com", "2019-12-14T21:18:17.000Z": "Tomorrow is the last day to purchase health insurance to be covered on January 1st. Go and shop @C4HCO to see how much the reinsurance program can save you!! Guest Commentary: Many Coloradans can now save thousands on health insurance but they must enroll Cody and Amanda Dennison own an auto-care shop in Durango and buy insurance on the individual market. In 2019, they paid nearly $1,900 per month for coverage for them and their three kids. But for  denverpost.com", "2019-12-11T20:50:49.000Z": "1,000,000 Coloradans are coping with behavioral health conditions, but fear of stigma prevents many from seeking help. Today, @GovofCO Jared Polis and @CO_CDHS launched the SEE ME campaign to educate and activate Coloradans about stigma. Learn more >> http:// SeeMeColorado.com .", "2019-12-10T14:00:47.000Z": "Giving back feels good! According to a recent study, giving back not only benefits those you give to, but it helps improve your life too! No matter what you're passionate about, there's a nonprofit that could use your help. Visit http:// ColoradoGivesDay.org . #COGivesDay", "2019-12-09T14:26:12.000Z": "Great article highlighting @GovofCO  @Paul_Lundeen  @CoHigherEd (as well as @JeffBridges  @McCluskieforCO  @timgeitner !) leadership on concurrent enrollment. 77% of students in CE continued on to college, compared with 52% of students not in CE. 35% of Colorado high schoolers are earning college credit as they study for their diplomas Concurrent enrollment saves students from 173 Colorado school districts time and money -- and is helping to close the racial education gap. coloradosun.com", "2019-12-09T06:53:38.000Z": "Congrats to world's youngest Prime Minister Sanna Marin! Quote Tweet BBC News (UK) @BBCNews Finnish minister Sanna Marin, 34, to become world's youngest PM https:// bbc.in/2P41OsL", "2019-12-07T01:14:22.000Z": "Congratulations to @WinterPark for being named the best ski resort in North America by @USATODAY ! @CopperMtn and @Telluride also made the top 10! Further proof that there is no better place in the world for skiing than Colorado!", "2019-12-06T20:27:12.000Z": "Obviously, Pueblo Chile is the best chile in the world. So I had to add a Pueblo Chile ornament to the Christmas tree at the Colorado state capitol! It's such a great addition to our tree. Happy Holidays! @MartinHeinrich  @GovMLG", "2019-12-05T23:05:00.000Z": "Want to cut down your own Christmas tree from a Colorado forest? There are five Forest Service cutting areas in Colorado, but it's not for the faint of heart. Bundle up and be prepared. \n\nMore information on each of the locations is available here: http:// bit.ly/381S4Xq", "2019-12-04T21:33:23.000Z": "Thanks so much to @jaredpolis (center) and Gia (left) for sitting down at #GTMStorage to talk about their vision for Colorado as a leader in decarbonization and the role #EnergyStorage may play!", "2019-12-04T20:45:54.000Z": "We are excited to unleash Snowstang! The new bus service will serve three of our top ski mountains: @Arapahoe_Basin , @LovelandSkiArea & @skisteamboat . The bus will leave from our transportation hub at @DenversStation & will run on the weekends, helping to ease congestion on I-70.", "2019-12-03T22:49:05.000Z": "Hear how Gov. Jared Polis says the partnership between PPCC and Harrison School District 2 is a model that can be used across the state. Gov. Polis visits Harrison High School to discuss free college program COLORADO SPRINGS - Governor Jared Polis visited Harrison High School Tuesday. It was an opportunity for Polis to see innovative programs at the high school from AVID, career tech classes, and fox21news.com", "2019-12-03T16:20:11.000Z": "I sat down with @303_Magazine to talk about how I got to the legislature and what my life is like working for the people. Check out this thorough interview to learn more about me and what drives me work so hard for the people. #trans  #TuesdayThoughts Colorado's First Transgender Legislator Made History, Now She's Putting In The Work The 2018 elections made a huge impact on national politics. While the fallout from that impact has been dramatic, Colorado voters made history. In addition to a blue wave that elected Colora", "2019-12-03T16:03:02.000Z": "A vinyl record of mechanical keyboard and typewriter sounds? That's a mind blowing retro squared innovation You can now buy a vinyl record full of mechanical keyboard sounds It's the new style. pcgamer.com", "2019-12-02T22:59:14.000Z": "US House candidate, CO-2 Honored to represent #Colorado as part of the congressional delegation to the 2019 @UN Climate Change Conference ( #COP25Madrid ) & highlight the work of cities across 2nd District, including #Boulder , #FortCollins , and others that have committed to #ActonClimate  #TimeforAction", "2019-12-02T15:59:23.000Z": "The flying car, coming soon not coming soon since since the 1950s Inside Larry Page's Turbulent Kitty Hawk: Returned Deposits, Battery Fires And A Boeing Shakeup The secretive flying-car startup promised to bring personal flying to the masses. But those hopes have failed to take wing amid breakdowns and safety issues with its Flyer aircraft, former employees... forbes.com", "2019-11-30T01:42:46.000Z": "NATO is perhaps the most successful alliance ever, yet Trump has never liked it (as an FYI, Putin doesn't like it either). Trump's isolationism and disregard for our allies is the wrong answer to every foreign policy question. Trump administration to cut its financial contribution to NATO The Trump administration has moved to substantially cut its contribution to NATO's collective budget according to several US and NATO officials, a symbolic move that comes as many continue to... cnn.com", "2019-11-29T00:47:05.000Z": "We had a howling Thanksgiving at with family at Colorado Wolf and Wildlife Center @cwawc", "2019-11-28T14:37:07.000Z": "Warm Thanksgiving wishes from our family to yours", "2019-11-27T12:29:03.000Z": "By staying in the EU, we can tackle the climate emergency together and set a binding net zero target of 2050, a green reason to #StopBrexit for a #BrighterFuture . #GE2019", "2019-11-26T13:00:01.000Z": "If you have to travel today, @ColoradoDOT crews are out on the roads trying to keep up with the storm. Remember, never pass a snowplow truck and don't crowd the plows! Give them room to do their jobs.", "2019-11-26T01:25:19.000Z": "Not preparing for the future won't stop it from coming anyway.", "2019-11-25T05:49:50.000Z": "Congratulations to the people of Hong Kong for peacefully electing pro-democracy candidates in a landslide with record participation rates.", "2019-11-23T20:17:07.000Z": "So excited to unveil our rural economic blueprint, which we believe will lead to more prosperity all across our state from the Eastern Plains to Southern Colorado to the Western Slope! \n\nRead more about it here: https:// colorado.gov/governor/news/ gov-polis-releases-rural-economic-blueprint ", "2019-11-24T22:49:00.000Z": "Oil and gas flowline information to be published online! Access to information builds a foundation for corporate accountability. @matthew_bloom reports: Colorado To Start Mapping All Oil And Gas Flowline Locations Online State oil and gas regulators adopted new safety rules on Thursday requiring the locations of thousands of underground oil and gas pipelines across Colorado kunc.org", "2019-11-23T21:15:04.000Z": "The devil worm is the first subterranean organism to have its genome mapped and the first creature of its kind to be discovered, found in 2011 living 2 miles under the Earth Surface. The Devil Worm Is So Metal This hellish nematode lives a mile beneath the Earth's surface. It rules. popularmechanics.com", "2019-11-23T03:24:18.000Z": "We all sometimes mistake the mask for the person Hyper-Realistic Masks Can Be More Believable Than Real Human Faces Some silicone masks are now so realistic they can easily be mistaken for real faces, new research suggests. Hyper-realistic masks are made from flexible materials such as silicone and are designed to... scitechdaily.com", "2019-11-22T22:40:21.000Z": "#TenYearChallenge", "2019-11-22T20:36:17.000Z": "\"...Polis' vision for education is inspiring.\" - Denver Post. #opportunity ... @jaredpolis  ... @GovofCO  Editorial: Polis budget focus on education and reserves is good policy Gov. Jared Polis has crafted a good guide in his budget proposal, with a clear emphasis on funding education and reserves. denverpost.com", "2019-11-22T21:29:17.000Z": "Last night @ColoradoOGCC passed new rules to provide greater transparency for public & communities on where oil & gas flowlines are located & enhanced protective measures on abandoning or where appropriate, removing flowlines to ensure public safety. #coleg  #copolitics", "2019-11-21T05:01:27.000Z": "I would be hisssssterical if I saw a snake with limbs  Ancient snakes had limbs for 70 million years and they were \"big bodied and big mouthed\" Study of 100 million-year-old fossil Najash gives more clues about snake evolution. newsweek.com", "2019-11-21T04:15:05.000Z": "You know what? They're all better than Trump. Let's do this. #DemocraticDebate", "2019-11-20T20:03:59.000Z": "I appreciate @PeteButtigieg 's focus on \nexpanding apprenticeships, certificates, and training. While 4-year college remains a fine choice, there are often alternatives that can be a better deal: costing less and helping people earn more. Quote Tweet Pete Buttigieg @PeteButtigieg Instead of providing free college tuition for the children of millionaires and billionaires, I will open doors of opportunity for Americans who choose not to go to college with massive investments in apprenticeships, workforce training, and lifelong learning programs. Show this thread", "2019-11-20T19:00:01.000Z": "Progress in suspended animation hibernation for humans Exclusive: Humans placed in suspended animation for the first time | New Scientist At least one person has been placed in a form of suspended animation during a trial that aims to help people survive traumatic injuries like a gunshot or stab wound newscientist.com", "2019-11-19T17:08:09.000Z": "Our nearby states have set a bizarre low bar with their outreach mottos. South Dakota has launched a \"Meth-we're on it\" (anti?) drug campaign, and Nebraska has launched a \"Nebraska: Honestly, it's not for everyone\" toursim(?) campaign. What should Colorado's response be?", "2019-11-16T18:07:59.000Z": "Thank you @Dylan_RobertsCO and @KerryDonovanSD5 for leading the way to increase consumer choice and save people money on healthcare with a public option Colorado must ensure competition when it rolls out public health care option, agencies recommend Colorado's insurance commissioner should be given the authority to require at least two companies offer the state's new public health insurance option in counties where there's on denverpost.com", "2019-11-16T06:14:09.000Z": "BREAKING: Today, true to their word, Colorado under the leadership of @jaredpolis released a strong plan to create a first in the nation state insurance plan as an option to cover everyone. \n\nIt considers the needs of care providers & was endorsed by Colorado physicians.\n\nKudos. Quote Tweet United States of Care @USofCare Colorado remains at the forefront of state leadership in health care innovation. @DORAColorado & @CHCPF final report reflects a thoughtful, sustainable approach to provide real relief to Coloradans. #COHealth  https:// bit.ly/2KsAHER", "2019-11-16T15:17:31.000Z": "Bring our teams back to our screens! (open letter) @ColoradoRapids  @nuggets  @Avalanche  @MammothLax  #copolitics", "2019-10-23T18:53:49.000Z": "Today @GovofCO  @USDA  @forestservice signed important shared stewardship agreement to better coordinate on CO forest & watershed health, wildfire prevention, outdoor rec, & protecting CO wildlife @Nature_Colorado  #coleg  #copolitics", "2019-10-24T04:49:54.000Z": "Quantum computing is here. Or it's not here. Or it's simultaneously both here and not here... yeah that's it!", "2019-10-23T21:50:54.000Z": "Well this is awkward ...Colorado doesn't border Mexico. Good thing Colorado now offers free full day kindergarten so our kids can learn basic geography", "2019-10-22T19:19:00.000Z": "Lunch today at Lucy's Tacos in La Junta... Yum!", "2019-10-22T19:15:36.000Z": "Congrats to @JustinTrudeau , re-elected as Prime Minister of Canada, our friend and ally to the north", "2019-10-14T23:38:02.000Z": "I just visited the future of housing and energy: net zero affordable housing project Basalt Vista right near Basalt High School, amazing partnership w @holycrossenergy", "2019-10-14T18:43:08.000Z": "GRANT DEADLINE: The application deadline for the Teacher Technology mini grants is tomorrow (Oct. 15)! If you know any teachers who could use up to $1,500 to enhance and expand technology in their classroom, pass this link along: https:// rcfdenver.org/what-we-do/pro grams-and-initiatives/teacher-tech-mini-grants/  cc: @jaredpolis Teacher Tech Mini Grants | Rose Community Foundation September 4, 2019 | Teacher Tech Mini Grants About The education technology mini-grant program was designed to enhance and expand the utility of computers or other existing classroom technology for rcfdenver.org", "2019-10-12T23:26:41.000Z": "Great joining the home run derby! I'll be practicing all year so I can hit more than two out of the park next year @cory_voss A new Pueblo tradition! Quote Tweet The Pueblo Chieftain @ChieftainNews After being inspired by hearing his granddad's home run story, @cory_voss and the Pueblo Baseball Mill put together the first annual Frank Whalen Home Run Derby, coming this Saturday to Runyon (Story via @MarcusLHill ) http:// ow.ly/VdlM30pHF71", "2019-10-12T23:05:45.000Z": "Thanks to #pueblobaseballmill for having me at the Frank Whalen Home Run Derby today! Excited to support @RunyonSports Complex and I'll be practicing all year to build on my performance today of hitting two out of the park. Thanks to @cory_voss for organizing!", "2019-10-12T20:24:43.000Z": "#Blizzard  @Blizzard_Ent get some 'tegridy like we have here in South Park, Colorado (especially season 23, episode 2) and celebrate free speech and human rights. Gamers of the world oppose authoritarian Chinese influence just as we fought SOPA/PIPA here.", "2019-10-12T14:05:26.000Z": "Individual health insurance plan premiums on the state exchange will go down by an average of 20% across the state in 2020, with even higher average reductions in some rural areas. Thank you @jaredpolis ! Colorado announces 20% average reduction across individual health insurance premiums for 2020 Individual health insurance plan premiums will go down by an average of 20% across the state in 2020, with even higher average reductions in some rural areas, the state announced Thursday. thedenverchannel.com", "2019-10-10T20:05:13.000Z": "For 2020, Coloradans shopping for an individual health insurance plan will see an unprecedented reduction in premiums -- an average statewide decrease of 20.2 percent (-20.2%).\n\nMORE: https:// colorado.gov/governor/news/ gov-polis-2020-aca-premiums-going-down-average-202 ", "2019-10-10T01:25:01.000Z": "Breaking the fast with that famous classic Pueblo Chile on gefilte fish", "2019-10-07T20:09:53.000Z": "\"What if America could gain a strong, unwavering and independent ally in the Middle East?\" asked @jaredpolis in a 2014 @denverpost editorial. Interesting to read in the current context. https:// denverpost.com/2014/10/03/pol is-the-promise-of-an-independent-kurdish-republic/   #copolitics Polis: The promise of an independent Kurdish republic Polis: The promise of an independent Kurdish republic denverpost.com", "2019-10-08T03:09:24.000Z": "Are ants and crickets a healthy alternative to potato chips? Ants, crickets and cockroaches - healthy snacks that taste like potato chips At his home in rural ​Costa Rica, biologist Federico Paniagua joined his family at the dining table to devour several types of insects that he raised on his farm and whose flavour he compares to... uk.reuters.com", "2019-10-07T16:42:51.000Z": "@jaredpolis celebrating all that Colorado has already for bicyclists, but noting that we can still strive for more. Polis notes the health and economic benefits, the tourism that bicycling brings to Colorado and the boon that bikes are to air and infra. #cobikesummit19", "2019-10-04T15:16:39.000Z": "Bats talk to one another a lot Researchers \"Translate\" Bat Talk. Turns Out, They Argue-A Lot A machine learning algorithm helped decode the squeaks Egyptian fruit bats make in their roost, revealing that they \"speak\" to one another as individuals smithsonianmag.com", "2019-10-04T05:12:47.000Z": "Deep down, we all suspected that this is the dark reality we are now in:", "2019-09-30T03:40:53.000Z": "Pueblo chile, peanut butter, honey, banana sandwich... perfect late night snack", "2019-09-29T20:48:24.000Z": "Taking in the fall colors on the Peak to Peak Byway near Ward", "2019-09-27T20:36:25.000Z": "I had such a great time touring Musso Farms in Pueblo and tasting some of the best chiles in the world today! I can confirm, Pueblo Chile is better than Hatch.", "2019-09-27T17:51:10.000Z": "Governor @jaredpolis supporting local farms in Pueblo! @KKTV11News", "2019-09-27T20:22:24.000Z": "Pueblo Chile time!!!!!", "2019-09-27T01:04:48.000Z": "I'm excited to welcome Sir @richardbranson to Colorado for @thebiennial of the Americas", "2019-09-25T23:24:29.000Z": "Thank you Ed Perlmutter for leading the charge to allow full access to banking for legal cannabis companies Quote Tweet Rep. Ed Perlmutter @RepPerlmutter The #SAFEBankingAct passed by a vote of 321 to 103 in the U.S. House! This is a huge milestone in reforming federal cannabis laws and reducing the public safety risk in communities across the country. #SAFEBanking  #copolitics", "2019-09-25T01:33:17.000Z": "I'm glad the RTD board heard our bipartisan calls to celebrate our nation's heroes and made the right choice for our state. (3/3)", "2019-09-25T01:33:16.000Z": "Colorado is home to a proud military history, numerous active duty military members and veterans. We are one of the top tourist destinations in the country because of our outdoor activities and unique way of life.  (1/3)", "2019-09-25T01:22:01.000Z": "Thank you @RideRTD for reconsidering the decision and decisively voting to help honor our nation's heroes. Denver is the best possible home for National Medal of Honor Museum.", "2019-09-24T14:04:13.000Z": "To be clear I don't sanction spilling water on elected officials, even @SteveKingIA , but a year in prison for literally spilling a cup of water on someone would be an extreme and unfair punishment for this Colorado man Lafayette man admits throwing water on Iowa Rep. Steve King Blake Gibbins faces a maximum of of a year in prison.", "2019-09-24T00:29:46.000Z": "I wonder if my cute bisl Gia-la would like this class? 'Yiddish for Dogs' class held in Central Park Many people already speak to their dogs, now a select few New Yorkers can speak to their dogs in a second language. abc7ny.com", "2019-09-23T21:42:31.000Z": "The @GovofCO  @jaredpolis is joined by his pooch, First Dog Gia, as he runs through his first-year accomplishments including signing the Red Flag Gun bill, providing full-day Kindergarten, & addressing some of the state's drug issues. http:// HarberTV.com/Polis  #coloradopolitics", "2019-09-23T14:51:52.000Z": "It's officially fall in Colorado! Fall is a magical time in Colorado; it is a time for admiring the colors around us and bringing the community together.", "2019-09-21T19:22:52.000Z": "Today I visited with members of the @CONationalGuard in Grand Junction and toured the new western region One Source veterans center.", "2019-09-19T18:14:14.000Z": "Lunch w Al Gore", "2019-09-18T20:46:39.000Z": "I had so much fun having lunch and celebrating full-day kindergarten with the students at Cory Elementary School in Denver today, and visiting their school garden and nine chickens!", "2019-09-14T20:23:11.000Z": "Love my morning tea Drinking tea may improve brain health | NUS Research News A study led by NUS Psychological Medicine Assistant Professor Feng Lei found that drinking tea at least four times a week may have a protective effect against age-related decline in brain organisat... news.nus.edu.sg", "2019-09-13T03:16:33.000Z": "Fishers Peak is a hidden gem in plain sight. I'm so excited that we are working to open this Trinidad landmark to the public as Colorado's next state park! Here's the moment I made it official!\n\n(Video: @COParksWildlife )", "2019-09-13T17:37:08.000Z": "#Tarantulatourism near La Junta, Colorado", "2019-09-12T16:10:00.000Z": "In Colorado, we value and cherish our treasured state lands and wildlife. It's a part of who we are and why we call Colorado our amazing home. I am excited to announce that for the first time since 2013, we're planning on creating a brand new Colorado State Park!", "2019-09-12T04:13:37.000Z": "This week we have a rare full moon occurring on Friday the 13th. Time to get your unlucky werewolf groove on!", "2019-09-12T03:52:32.000Z": "Two new species of electric eels have been discovered in the Amazon Most powerful electric eel yet puts all other electric eels to shame We're talking 860 electrical volts here. cnet.com", "2019-09-10T21:35:05.000Z": "Thank you @jaredpolis for visiting #ColoradoSprings and sharing your entrepreneurial wisdom and vision for Colorado. Also, nice shoes  #teamsprings  #cosstartupweek", "2019-09-09T21:56:19.000Z": "... @GovofCO  delivers news to Summit County rate reduction of 41.5% through ... @peakhealthcolo  and reinsurance; congrats Peak Health Alliance", "2019-09-09T21:51:39.000Z": "BREAKING: @GovofCO is in Summit County talking about the #PeakHealthAlliance - the program is lowering insurance rates by 30%+ \nW/ hopes to make this model available to communities across the state. Details coming up at 6 on @CBSDenver  #OriginalReporting  #heathcare  #insurance", "2019-09-09T05:23:37.000Z": "Newly discovered underground life eats fools gold to survive Strange life forms found deep in a mine point to vast 'underground Galapagos' The rock-eating, sulfur-breathing microbes have scientists wondering what other strange creatures dwell deep below Earth's surface. nbcnews.com", "2019-09-06T22:40:23.000Z": "Governor @jaredpolis has been great with the #immigrant community so far.  \"Attempt to force recall election of #Colorado  @GovofCO falls short.\" https:// dpo.st/34p61Nl via @denverpost Attempt to force recall election of Colorado Gov. Jared Polis falls short A coalition of vexed Coloradans has failed to collect enough signatures to force a special election to recall Gov. Jared Polis. denverpost.com", "2019-09-06T01:32:49.000Z": "At Rifle Gap State Park w @COParksWildlife", "2019-09-04T16:28:27.000Z": "Future of Work- Executive Order by @jaredpolis to keep #Colorado at the forefront of our most valuable commodity- our people! @GovofCO  @ColoradoLabor  @the_cwdc  @CoHigherEd  #education  #workforce  #copolitics", "2019-09-01T23:52:40.000Z": "Happy Labor Day!", "2019-08-31T01:46:17.000Z": "Great night for some football! #RockyMountainShowdown", "2019-08-29T00:06:35.000Z": "Gov. Jared Polis Reads To Semper Elementary Students Gov. Jared Polis Reads To Semper Elementary Students Polis visited the school in Westminster. denver.cbslocal.com", "2019-08-26T17:40:37.000Z": "It was an honor to help build bikes with @walmart associates at University Prep today! The bikes were given to second grade students and their families who were selected by the nonprofit organization Wish for Wheels. #WishForWheels", "2019-08-26T19:52:47.000Z": "Our Honorable Governor @GovofCO  @jaredpolis is here discussing how Colorado is leading the way, nationally, regarding cannabis legalization and businesses. #marijuanabanking", "2019-08-25T21:39:41.000Z": "Polis: One thing parents can cross off their back to school lists - kindergarten tuition checks https:// dpo.st/3285bCF", "2019-08-25T13:58:58.000Z": "Opinion: Polis: One thing parents can cross off their back to school lists - kindergarten tuition checks https:// dpo.st/2zmUiAh", "2019-08-24T19:42:13.000Z": "I remember when there were 9", "2019-08-23T21:25:24.000Z": "It was an honor to speak at the Colorado Agriculture Commissioners Lunch & the Centennial Farms & Racnches Award Ceremony at the CO State Fair! While CO's agriculture sector is a major economic driver, it's also part of our heritage, history, & identity as Coloradans! #copolitics", "2019-08-20T15:59:53.000Z": "To kick off the new school year, @jaredpolis paid Green Gables Elementary School a visit in Lakewood. Gov. Polis stops by Lakewood To kick off the new school year, Colorado Gov. Jared Polis paid Green Gables Elementary School a visit in Lakewood. Along with Colorado State Senator Brittany Pettersen, Polis read a book to a group  lakewoodsentinel.com", "2019-08-20T19:50:45.000Z": "Thank you, @GovofCO , for visiting SW Colorado to discuss small business development, economic development, health care, and other important topics. @FLCDurango  @jaredpolis  @TomStritikus  @steve_durango  @pweiser  @FLCALUMNI  @FLCArtsSciences  @ColoradoSBDC  @FLCNews", "2019-08-21T22:40:30.000Z": "Great first look at @GovofCO 's new executive order on wildlife from @CPRNews ' @gracehood --> Make Way For Deer (And Bighorn Sheep And Elk): Polis Announces An Order To Clear The Path For Safer... Colorado's population boom is making the seasonal migrations for big game animals only more complicated. cpr.org", "2019-08-21T20:37:10.000Z": "Today's executive order from @GovofCO will help balance #CO 's rapid growth with the increasing need to safeguard important migration corridors for #coloradowildlife . Our release: Conservation Groups Herald Gov. Polis' Executive Order to Protect Wildlife; Habitats | Western... Today's executive order from Governor Jared Polis will help balance Colorado's rapid growth with the increasing need to safeguard important migration corridors for our iconic wildlife populations. westernresourceadvocates.org", "2019-08-20T14:58:50.000Z": "Fun to present ... @GovofCO  Jared Polis with a very special Key to the ... @CityofDurango !  Thank you for visiting our schools ... @Durango9R  and thank you to ... @LtGovofCO  Dianne Primavera as well.  Come back for your personal tour!", "2019-08-20T17:55:08.000Z": "I love being in Durango to celebrate full-day kindergarten in Colorado! This morning @LtGovofCO Dianne Primavera and I stopped by Park Elementary to meet teachers, students and parents.", "2019-08-20T16:10:55.000Z": "Gov. Polis & @LtGovofCO are in Durango this morning to welcome kiddos and parents back to school. Free full-day kindergarten will help parents save money and expand opportunity for Colorado's youngest learners. #coleg  #copolitics", "2019-08-17T16:46:03.000Z": "Colorado schools start free, full-day kindergarten Colorado schools start free, full-day kindergarten Governor Jared Polis said about 99 percent of schools are offering free, full day kindergarten starting this year.", "2019-08-17T16:15:12.000Z": "#FullDayK RT @BVSDcolorado : Thank you @GovofCO Jared Polis for visiting Columbine Elementary and for your leadership in bringing full-day kindergarten to #BVSD & school districts across Colorado.... #COSchoolsProud  #edcolo  #coleg  #copolitics", "2019-08-14T16:04:36.000Z": "Thank you @GovofCO , @skbird77 and @FaithWinterCO for making free full-day kindergarten a reality for students in @Adams12 ! Our Cotton Creek kindergartners loved reading time with Governor Polis. #FiveStarProud  @COSchoolsProud  #FirstDayOfSchool2019", "2019-08-16T19:18:53.000Z": "Thank you @GovofCO Jared Polis for visiting Columbine Elementary and for your leadership in bringing full-day kindergarten to #BVSD & school districts across Colorado. We believe that the additional focus on our youngest learners will reap great dividends for many years to come.", "2019-08-11T01:46:46.000Z": "MAJOR ANNOUNCEMENT: Today, we are very proud that our Governor-Governor Jared Polis-has made history and made our dream come true. Through his proclamation, he officially established the month of August as AFRICAN IMMIGRANT MONTH in the state of Colorado!", "2019-08-10T21:26:50.000Z": "As a kids' lung doctor and lifelong breather of air, I'm very glad @jaredpolis  @GovofCO made this move:\nEPA proposes downgrading Denver and northern Front Range to \"serious\" violator of air quality standards EPA proposes downgrading Denver and northern Front Range to \"serious\" violator of air quality... The U.S. Environmental Protection Agency announced Thursday that it wants to reclassify the region encompassing Denver and the northern Front Range as a \"serious\" violator of federal he denverpost.com", "2019-08-08T16:38:07.000Z": "TFW it's #InternationalCatDay  Lynx were reintroduced to Colorado in 1999, in one of the most ambitious #conservation projects in the state's history.\n\nNow, lynx are thriving - with an estimated population of more than 200. https:// cpw.state.co.us/learn/Pages/SO C-Lynx.aspx ", "2019-08-09T04:21:13.000Z": "Who's as excited as I am? Mass tarantula migration expected to crawl through Colorado starting this month It's an arachnophobe's worst nightmare or an absolute delight for those brave enough to get close to the hairy critters cbsnews.com", "2019-08-08T20:12:44.000Z": "If you come across a nuclear bomb, please don't try to dismantle it yourself How Scientists Actually Dismantle a Nuclear Bomb ... discovermagazine.com", "2019-08-07T23:08:40.000Z": "Today, Rocky Ford farmers delivered cantaloupes to our state Capitol. I enjoyed receiving them as I reflected on my days years ago as a cantaloupe runner for the @ConchitaCruz gang smuggling operation at the US Capitol.", "2019-08-04T18:56:18.000Z": "It was an honor and a privilege to welcome our troops back to Colorado! On behalf of a grateful state, I want to thank them for their service abroad. Every single one should be proud of serving our country with distinction.", "2019-08-04T15:22:15.000Z": "Dayton, Ohio. Another mass-shooting within 24 hours of El Paso. What's going on, America? So much sadness in such a short time. We need to love one another more and show that we are better than this senseless slaughter.", "2019-07-31T10:31:33.000Z": "India is delighted to welcome Colorado Governor H.E. Jared Polis @JaredPolis  @GovofCO to #REINVEST2019 for a transformative conversation on clean energy for sustainable development #LIVE | 2 Nov 2019 | Register: https:// re-invest.in  @mnreindia  @isolaralliance  @FollowCII", "2019-08-03T22:41:43.000Z": "I, for one, welcome our new raccoon overlords Raccoons are rapidly spreading across Earth-and climate change could help The voracious invaders are found on three continents, and warming could help their range expand northward. nationalgeographic.com", "2019-08-03T21:55:24.000Z": "A taste of Ethiopia! #coloradoforall", "2019-08-03T19:24:57.000Z": "I was saddened to hear of the tragedy in Texas. Together we mourn the victims and extend condolences to the families. May those who are injured heal, may those who bore witness recover from the trauma, and may we as a society learn.", "2019-08-01T13:35:22.000Z": "Our @GovofCO sends his warm wishes for Colorado's 143rd! HBD, CO. #HipToBeSquare", "2019-08-01T20:17:09.000Z": "Help me, I'm in a jam", "2019-08-01T13:10:03.000Z": "Today's the day where we celebrate our favorite state. Happy #ColoradoDay ! Celebrate with free admission to #ColoradoStateParks , Mon. Aug 5. #livelifeoutsideCO  https:// bit.ly/2SQ2jGS", "2019-08-01T19:57:54.000Z": "Bad news for our economy, bad news for working families,m Trump says US will impose 10% tariffs on another $300 billion of Chinese goods starting Sept. 1 Trump made the announcement via Twitter, shaking financial markets. cnbc.com", "2019-07-31T19:48:45.000Z": "US House candidate, CO-7 Congratulations to @jaredpolis , Colorado Senate Democrats, and Colorado House Democrats for getting federal approval to lower health care costs for families across Colorado. This is what happens when we elect Democrats up and down the ticket! Colorado gets federal OK for program expected to lower marketplace health care premiums 18% The federal government has given Colorado the green light to start a reinsurance program in January 2020 that's expected to lower health care premiums on the individual marketplace by an aver denverpost.com", "2019-07-31T00:25:19.000Z": "Ambassador @HarshShringla addressed the Colorado-India Business Roundtable in the presence of Governor of Colorado @JaredPolis and President @USIBC  @NishaBiswal Link to the speech: https:// indianembassyusa.gov.in/extra?id=41  @MEAIndia  @cgihou", "2019-07-30T18:27:43.000Z": "Standing room only as CO Gov @jaredpolis talks win-win strategies for the U.S and India on trade, with big opportunities in #emobility and #renewableenergy , at the Colorado-India Business Roundtable. Thanks to our host @Amazon . #USIBCinDenver", "2019-07-29T13:22:57.000Z": "Super interesting: Colorado Gov. @jaredpolis said at a meeting with other governors from around the country that legalizing marijuana delivery services is part of his state's effort to reduce impaired driving.\n\nWATCH: https:// marijuanamoment.net/legalizing-mar ijuana-deliveries-can-reduce-impaired-driving-colorado-governor-says/ ", "2019-07-26T16:43:14.000Z": "Hey @jaredpolis , you see this from @eater ? \n\nThe Great American Chile Highway. https:// eater.com/platform/amp/2 019/1/23/18182665/best-new-mexico-chile-restaurants-interstate-25 ", "2019-07-24T14:00:42.000Z": ". @GovofCO Jared Polis, is briefed by A1C Valentine & 2d Lt Murray on how to send commands to a satellite during his visit to @SchrieverAFB last week. Polis also met with Schriever AFB leadership & learned about the 2nd SOPS GPS mission.", "2019-07-24T15:33:31.000Z": "I'm glad that @AndrewYang is talking about the importance of occupational licensing reciprocity and more broadly about how increasing the mobility of labor improves our overall economy and the lives of workers Quote Tweet reason @reason Occupational licensing stops workers from moving across state lines. Democratic presidential candidate @AndrewYang wants to fix that. https:// reason.com/2019/07/23/occ upational-licensing-stops-workers-from-moving-across-state-lines-andrew-yang-wants-to-fix-that/ ", "2019-07-23T22:07:20.000Z": "Colorado wildflower conditions report: \n\nIt's currently EPIC. : @MarkDoughty21 From Mark Doughty, MS, AT", "2019-07-23T05:09:04.000Z": "", "2019-07-22T00:18:12.000Z": "Glowing shark, doo doo doo doo doo doo Scientists discovered a new species of tiny sharks that glow in the dark Sharks are known to stalk and sniff out prey before they attack. But all this newly discovered shark species has to do is glow in the dark, and the prey comes to them. amp.cnn.com", "2019-07-21T18:14:33.000Z": "Thank you to Colorado Governor @jaredpolis and @MayorHancock for declaring Sesame Street Day in the state of Colorado and the city of Denver! #ThisIsMyStreet", "2019-07-19T20:00:51.000Z": "In late May, #Colorado Governor @jaredpolis signed 7 climate & energy bills. #NCSL  https:// bit.ly/2NSRaXc", "2019-07-18T14:22:46.000Z": "A chant like \"Send her back!\" is ugly and dangerous, and it is the inevitable consequence of President Trump's demagoguery. This is how history's worst episodes begin. We must not allow this man to take us to such a place.", "2019-07-17T20:10:30.000Z": "Well, I guess this is what 6 months being Governor does to you  #faceapp  #faceappchallenge", "2019-07-16T17:40:22.000Z": "New: @GovofCO reveals for those on individual market - the cost of health insurance is going down 18.2 percent. This is because of a new reinsurance program passed by #coleg this year #kdvr  #copolitics", "2019-07-16T15:38:27.000Z": "Yum! Starting the morning with a @RosenbergsBagel bagel", "2019-07-16T02:28:44.000Z": "Go #Rapids96 !\nGo @USWNT !\nGo #Denver2026 !  @GovofCO honored @LindseyHoran & @MalPugh on their AMAZING run with the #USWNT ! #OneNationOneTeam", "2019-07-16T01:47:54.000Z": "At the @ColoradoRapids friendly game", "2019-07-14T20:22:50.000Z": "Now @Stranger_Things Dustin has nothing over our son CJ who lost his second front tooth last night!", "2019-07-13T19:59:01.000Z": "It desecrates our flag to deny humans dignity and treat people worse than cattle. Quote Tweet NBC News @NBCNews New video shows severe overcrowding of men in cages at Texas detainment facility during VP Pence's visit Friday. \n\nA group of men detained behind chain link fencing shouted to news cameras, \"No shower, no shower!\" https:// nbcnews.to/2GaAowu", "2019-07-13T19:48:20.000Z": "Of course I condemn the desecration of our flag, who wouldn't? Now will you condemn the ongoing and even more serious offense to our flag and values of putting children in cages and tearing families apart? @GregAbbott_TX  @cologop", "2019-07-12T00:58:04.000Z": "I'm a fan of blockchain and think we should embrace innovative technology that has the potential to revolutionize entire industries including our monetary system Quote Tweet Donald J. Trump @realDonaldTrump I am not a fan of Bitcoin and other Cryptocurrencies, which are not money, and whose value is highly volatile and based on thin air. Unregulated Crypto Assets can facilitate unlawful behavior, including drug trade and other illegal activity.... Show this thread", "2019-07-10T18:26:55.000Z": "I agree with @GovMLG on a lot of things, but we disagree on this one. I challenge @GovMLG to a chile taste-off in Trinidad! Let's put this to the test. Quote Tweet Michelle Lujan Grisham @GovMLG If Pueblo chile were any good, it would have been on national shelves before now. If Colorado wants to go chile to chile, no question that New Mexico can bring the heat - Hatch chile is, has always been and will always be the greatest in the world. twitter.com/thenewmexican/", "2019-07-09T20:44:08.000Z": "Wolves haven't roamed Colorado since the mid-1940's. This past weekend, a private citizen captured a wolf on video in Jackson County in northern Colorado. @COParksWildlife officials are working to verify the sighting as well as another in Grand County.", "2019-07-09T23:10:24.000Z": "What me worry?\nEnd of an era MAD Magazine to Cease Publication UPDATE: Details have emerged regarding the future of MAD Magazine following the end of original [...] comicbook.com", "2019-07-07T23:27:45.000Z": "I was surprised to get a letter from the President. Turns out he was just asking for money. No thanks!", "2019-07-07T19:32:42.000Z": "Rep. Justin Amash: \"When you look at the conduct in [the Mueller Report], when you look at the evidence as presented, I think basically anyone would be indicted for that conduct, anyone who was not the President of the United States.\"", "2019-07-06T15:15:12.000Z": "Gov Polis & @Dylan_RobertsCO spoke with @steamboatpilot about solutions to lower the cost of health care, rural broadband and more https:// steamboatpilot.com/news/broadband -coal-and-health-care-qa-with-gov-polis-during-his-visit-to-steamboat/   #coleg  #copolitics Broadband, coal and health care: Q&A with Gov. Polis during his visit to Steamboat Gov. Jared Polis made a visit to downtown Steamboat Springs Friday afternoon to speak with business owners ahead of a friend's wedding. steamboatpilot.com", "2019-07-06T18:15:07.000Z": "Bears are evolving fast Adventurous bear breaks into car in Boulder County, drives down a hill A bear took an unlocked car in Boulder County on a joyride down a hill. denverpost.com", "2019-07-05T20:45:42.000Z": "Had a great time visiting some local businesses and talking to the @steamboatpilot with @GovofCO . Thanks for coming to @SteamboatCO , Governor! #coleg  #copolitics", "2019-07-04T17:45:47.000Z": "Always a man of principle who puts values over partisanship, @justinamash today declared his independence on Independence Day Quote Tweet Justin Amash @justinamash Today, I'm declaring my independence. https:// washingtonpost.com/opinions/justi n-amash-our-politics-is-in-a-partisan-death-spiral-thats-why-im-leaving-the-gop/2019/07/04/afbe0480-9e3d-11e9-b27f-ed2942f73d70_story.html?noredirect=on&utm_term=.a203afca9d89 ", "2019-07-02T17:08:28.000Z": "Don Quixote was on to something... Tilting of windmills could lead to performance gains, study finds Stanford University researchers find simple technique of \"wake steering\" - or slightly tilting wind turbines - can boost performance and reduce variability of output. reneweconomy.com.au", "2019-07-02T06:45:02.000Z": "Cockroaches are much less common in Colorado than they are in Washington DC or NYC. Come join us in Colorado to survive the cockroach apocalypse Cockroaches are evolving to a point where they'll be nearly impossible to kill New study finds cockroaches being born with an immunity to pesticides nydailynews.com", "2019-06-29T01:59:17.000Z": "Beam me up, Scotty! Researchers teleport information within a diamond Researchers from the Yokohama National University have teleported quantum information securely within the confines of a diamond. The study has big implications for quantum information technology --... eurekalert.org", "2019-06-27T00:30:19.000Z": "Meta Social-savvy Polis carves out time to tweet - on whales, demon children, gaming, Game of Thrones ... Jared Polis wants his Twitter followers to know that he is a full-time governor - and a part-time entertainer. coloradopolitics.com", "2019-06-26T15:05:00.000Z": "Four years ago today, the U.S. Supreme Court decided that throughout the United States, people could marry the person they love! Love is love!", "2019-06-22T19:29:17.000Z": "Somali pirates gave me toothpaste & soap. Quote Tweet NowThis @nowthisnews A Trump official tried to argue that detained children don't need soap, toothbrushes, or beds to be 'safe and sanitary' while in Border Patrol custody", "2019-06-23T17:54:48.000Z": "Scary headline today", "2019-06-22T20:27:59.000Z": "I'm learning how to tabloidize and exaggerate headlines to better become twitter famous. How about this one: EAT CHOCOLATE TO LOSE WEIGHT AND END OBESITY Study: Phenols in cocoa bean shells may reverse obesity-related problems in mouse cells A new study by University of Illinois researchers Elvira Gonzalez de Mejia and Miguel Rebollo-Hernanz suggests that the phenolic compounds in cocoa bean shells reverse the chronic inflammation and... news.illinois.edu", "2019-06-21T22:36:32.000Z": "Too much cell phone use is slowly turning children into demons https:// washingtonpost.com/nation/2019/06 /20/horns-are-growing-young-peoples-skulls-phone-use-is-blame-research-suggests/ ", "2019-06-21T15:54:00.000Z": "Summer has officially arrived in Colorado! What's your favorite thing about summer in Colorado?", "2019-06-21T05:29:55.000Z": "Narlugas are real! Hybrids between belugas and narwhals have been proven to exist! Narlugas Are Real A very strange hybrid whale was the offspring of a narwhal mother and a beluga father. theatlantic.com", "2019-06-21T00:45:22.000Z": "Finding problems in Alderaan places Welcome to Trump's Corrupt State - the Mos Eisley cantina of world politics | Robert Reich The administration and the Republican party are nests of lobbyists and con artists who make Greedo look like a saint theguardian.com", "2019-06-20T18:17:00.000Z": "Colorado Governor @jaredpolis  @GovofCO is sporting the new state pride SlapLit Drink Wrap after stopping by our booth yesterday! It also makes for some eye-catching wrist wear. #OutdoorRetailer  #ORSM19  #weareOUTDOOR At Outdoor Retailer summer market, Gov. Polis focuses on trade policy coming out of Washington Colorado Gov. Jared Polis' appearance at the Outdoor Retailer summer market was all about recent tariffs imposed by President Donald Trump's administration. denverpost.com", "2019-06-16T20:06:50.000Z": "Our family really cleaned up at @bjsrestaurants today", "2019-06-16T18:24:34.000Z": "Happy Father's Day to the world's amazing fathers, raising boys and girls with confidence and strong character", "2019-06-15T01:00:47.000Z": "We are excited to host longtime #Rockies fan and Governor of Colorado @jaredpolis to throw tonight's ceremonial 1st pitch!", "2019-06-14T17:11:25.000Z": "The Pride Flag is on display this weekend at our Colorado State Capitol. I'm so proud to be the governor of a state that celebrates diversity and love.", "2019-06-12T20:15:33.000Z": "5 years, one billion dollars Colorado Crosses $1 Billion in Marijuana Tax Revenue It took 65 months. westword.com", "2019-06-12T14:49:51.000Z": "Three years ago today, 49 lives were lost in the tragic Pulse Nightclub massacre. My heart is still heavy for their families and all those affected in Orlando. We will never forget and we will never let hate win. Florida lawmakers want to make the Pulse nightclub site a national memorial In the days ahead of the third anniversary of the mass shooting at Pulse nightclub in Orlando, lawmakers have proposed plans to designate the nightclub a national memorial. cnn.com", "2019-06-12T06:19:00.000Z": "\"Nineteen species of mammals live longer than humans, given their body size, of which 18 are bats.\" Duh! That's because some bats are immortal vampires and that heavily skews the average bat lifespan! Why do bats have such bizarrely long lifespans? Adjusting for their size, most of the longest lived mammals are bats. arstechnica.com", "2019-06-11T21:47:19.000Z": "Incredible job by our Colorado athletes in the #USWNT 13-0 shutout today! Lindsay Horan and Mallory Pugh of Colorado both scored! Congratulations! #OneNationOneTeam  #FIFAWWC Morgan has 5 goals as US routs Thailand 13-0 Colorado products Lindsey Horan and Mallory Pugh also scored in Tuesday's dominant shutout.", "2019-06-10T22:17:25.000Z": "This is why we can't have nice things.\n\nPlease, secure *all* your trash and be #BearAware : https:// cpw.state.co.us/learn/Pages/Li vingwithWildlifeBears2.aspx  From Denver7 News", "2019-06-09T20:20:40.000Z": "A-Basin June Skiing", "2019-06-08T20:47:34.000Z": "Pride month hack at @USPS And yes Ellsworth Kelly was gay", "2019-06-08T14:21:46.000Z": "Bipartisan sponsorship, passed, signed into law by @GovofCO : Full-day K Start public health insurance option Lower insulin costs Reinsurance to lower premiums Hospital transparency & end surprise billing Lower taxes #coleg  #copolitics Polis: I fought for Coloradans this year and much of it was bipartisan When I delivered my first State of the State address back in January, I said that our administration's mission and mandate from the voters began with tackling the everyday challenges that Col denverpost.com", "2019-06-07T20:46:06.000Z": "Colorado's Governor Jared Polis Signs Strong Anti-SLAPP Law And Blocks Damaging Licensing Restrictions Colorado's Governor Jared Polis Signs Strong Anti-SLAPP Law And Blocks Damaging Licensing Restric... When Jared Polis was in Congress, he was one of the (tragically few) reliably good, principled voices on topics that were important to... techdirt.com", "2019-06-06T23:05:40.000Z": ". @GovofCO is \"trying to bring down costs, when we have to worry about textbooks and financial aid coming through,\" says a @ppccedu student. \"Not having to worry about tuition is nice.\" Students applaud tuition freeze during Polis' first visit to PPCC in Colorado Springs Still buoyed by signing 454 bills into law, the last of which was inked Monday, Colorado Gov. Jared Polis stopped in Colorado Springs on Wednesday to tout the highlights of gazette.com", "2019-06-06T14:07:27.000Z": "Incredible work, @GovofCO  @JaredPolis . Colorado (and every state in the union) deserves a clean energy future. https:// cpr.org/story/colorado -s-bold-plan-for-climate-action-moves-ahead-with-new-state-laws ", "2019-06-06T19:02:40.000Z": "Not only will tariffs against Mexico destroy American jobs and increase prices for consumers, they also increase illegal immigration because tariffs hit the Mexican economy just as hard, leaving more unemployed people with little to lose willing to risk illegal entry", "2019-06-05T14:06:03.000Z": "Colorado governor @jaredpolis just vetoed three new occupational licensing laws. \n\nLet's hope he doesn't stop there. Colorado's Jared Polis Is the Latest Governor to Embrace Licensing Reform Polis vetoed licensing requirements for HOA managers, sports agents, and genetic counselors. That's not sitting well with some members of his own party. reason.com", "2019-06-05T05:24:02.000Z": "Big rock on Colorado highway is about to become Memorial Rock An 8.5 million pound boulder will become a new tourist attraction of sorts. gazette.com", "2019-06-04T22:02:17.000Z": "Everybody meet Memorial Rock. \n\nWe will not be destroying this 8.5 million pound boulder - which is the size of a house. Instead, we're going to make a new state landmark and save taxpayers money. Colorado won't blow up massive boulder that destroyed highway. Here's why. Move over Castle Rock, there's a new \"geographical masterpiece\" for Colorado commuters and tourists to marvel. Meet Memorial Rock. denverpost.com", "2019-06-03T21:09:54.000Z": "High five for Pride Month  High fives were invented by gay Major League Baseball player Glenn Burke in 1977!", "2019-06-02T17:16:11.000Z": "To veto a bill, cross out \"approved\" and write in \"disapproved and vetoed\" and then sign it. I initialed the changes just in case.  Here's a link w more info about bills signed and vetoed yesterday: https:// colorado.gov/governor/news/ 511-gov-polis-signs-bills-law-announces-vetoes ", "2019-06-02T05:55:10.000Z": "The terminal velocity (fastest speed reached during free fall) of an ant is 4 MPH, so they can fall from any height and survive. You are not an ant and have a terminal velocity of 120 MPH, so don't get any ideas.", "2019-05-31T23:02:00.000Z": "What does the roadmap to 100% renewable energy in Colorado by 2040 mean for you? Cleaner air Green jobs that can never be outsourced Lower rates for consumers", "2019-05-30T21:48:27.000Z": "My friend @BetoORourke is such a wholesome, all American guy that even the criminal who impersonated working for his campaign only stole a popsicle Man Posing As Beto Worker Arrested For Breaking Into A Home, Stealing A Popsicle Man Posing As Beto Worker Arrested For Breaking Into A Home, Stealing A Popsicle talkingpointsmemo.com", "2019-05-30T19:56:53.000Z": "Thank you Governor Polis for signing our Bill designed to support students with special needs into legislation today. We truly appreciate your great support for our public education.", "2019-05-30T17:54:21.000Z": "We're taking immediate action to improve our air quality, curb pollution and fight climate change. Our roadmap to achieve 100% renewable energy in Colorado by 2040 will drive innovation and jobs, cleaner air, and save consumers money. #copolitics  #environment  #climatechange", "2019-05-30T17:10:04.000Z": "We are now open to business and investment Colorado's Legal Pot Industry Is Now Open To Outside Investors If everything goes as expected, Colorado legal cannabis industry is about to get a major windfall. Yesterday, Governor Jared Polis signed a bill that will pave the way for the state's legal cannabis... forbes.com", "2019-05-30T13:54:06.000Z": "This is not a show. Our military is not a prop. Ships and sailors are not to be toyed with for the benefit of a fragile president's ego. Quote Tweet Rebecca Ballhaus @rebeccaballhaus NEW: The White House wanted the USS John McCain \"out of sight\" for Trump's visit to Japan. A tarp was hung over the ship's name ahead of the trip, and sailors-who wear caps bearing the ship's name-were given the day off for Trump's visit. w/ @glubold  https:// wsj.com/articles/white -house-wanted-uss-john-mccain-out-of-sight-during-trump-japan-visit-11559173470?emailToken=ca887c08f025f5a5b7a01dbde32c838etBzq0FwbTXJrUQ8MUigaUjoAwWzGVOHT66U4wF7JggEVN49VMPJcywDwL4QIC90yIeTde53bioBxoijKFGMKce+lggzjkFmquqfBI+eoiwkN6qJGKPyIRwCj2ZtjqkkRe2VMQFp9bRWUdJs0k7z4QA%3D%3D&reflink=article_imessage_share ", "2019-05-30T16:25:39.000Z": "Good afternoon to everyone ESPECIALLY Colorado because @GovofCO signed HB 1277--a bill drafted in partnership with us--in a commitment to close the growing gender gap in K-12 computer science in CO #STEMeducation  https:// girlswhocode.com/2019/05/30/gir ls-code-passes-cs-education-law-in-colorado/ ", "2019-05-25T22:50:27.000Z": "You think Trump's tariffs don't affect you? Think again! Gamers of the world, unite! US considers 25% tariff on game consoles Trump administration proposes tax on \"essentially all products\" coming from China as part of escalating trade dispute gamesindustry.biz", "2019-05-25T14:56:51.000Z": "Pardoning war criminals, after or even before they have been tried by a jury of their military peers, would undermine order and discipline, corrode the foundation of American moral authority, and put future troops at risk. Trump may pardon military men accused or convicted of war crimes: New York Times U.S. President Donald Trump has asked for files to be prepared on pardoning several U.S. military members accused of or convicted of war crimes, including one slated to stand trial on charges of... yahoo.com", "2019-05-23T20:36:16.000Z": "Tested out my electric scooter skills in front of the Capitol this afternoon!", "2019-05-23T21:41:04.000Z": "Colorado Gov. Jared Polis signed a bill into law that places a $100 per month cap on insulin co-pays, regardless of how much insulin a patient uses. Insurance companies will pay anything more than the $100 co-pay, according to the new law. Colorado is the first state to cap skyrocketing insulin co-pays The skyrocketing prices of insulin are a nationwide issue and Colorado has become the first state to pass legislation that tackles the problem. cnn.com", "2019-05-22T17:27:36.000Z": "Tariffs are stupid, Colorado edition: It's not just China: The United States' global trade war has Colorado companies seeking - and... The negative impacts on local businesses range from the outdoor industry to aerospace firms, farmers to tech manufacturers. Some are shifting production out of China. Others pre-ordered goods before... coloradosun.com", "2019-05-21T23:03:06.000Z": "Here's the moment full-day kindergarten became the law of Colorado! #FullDayKCO", "2019-05-21T16:23:56.000Z": "Today every kid in Colorado will officially get free full day kindergarten when @JaredPolis signs into law a bill I sponsored along with Rep. Jim Wilson, @BarbaraforCO and @SenRhondaFields . In honor of #FullDayKCO , here's a pic of me as a kindergarten cowboy. #coleg  #copolitics", "2019-05-19T20:53:20.000Z": "Who will sit on the porcelain iron throne? #GameOfThrones", "2019-05-18T22:17:55.000Z": "Replying to @jaredpolis More like King of the Anvils, am I right? GIF", "2019-05-18T22:09:07.000Z": "It takes a blacksmith to lead the realm. My vote is for Gendry Baratheon, Lord of Storm's End to become Lord of the Seven Kingdoms, King of the Andals and the First Men #GOT", "2019-05-17T20:05:17.000Z": "Congrats to Taiwan for leading the way in Asia for legal recognition of loving relationships Taiwan legalizes same-sex marriage in historic first for Asia Taiwan's lawmakers have passed a same-sex marriage bill, making it the first place in Asia to bring in gay marriage. amp.cnn.com", "2019-05-17T05:26:18.000Z": "Mapping the wood wide web https:// sciencemag.org/news/2019/05/w ood-wide-web-underground-network-microbes-connects-trees-mapped-first-time ", "2019-05-16T06:33:24.000Z": "This is not our way in Colorado. Here we believe in empowering women to make their own reproductive health choices. The government should not come between a woman, her doctor, and her faith. Alabama governor signs bill banning nearly all abortions Gov. Kay Ivey called the move a testament to Alabamians' belief that \"life is a sacred gift from God.\" politico.com", "2019-05-15T06:01:05.000Z": "Promising  Researchers develop viable, environmentally-friendly alternative to Styrofoam | WSU Insider |... The plant-based material surpasses the insulation capabilities of Styrofoam, is very lightweight and can support up to 200 times its weight without changing shape. news.wsu.edu", "2019-05-14T22:56:31.000Z": "Congrats Mr. Ratburn! From chismimosa", "2019-05-14T02:04:41.000Z": "Quick reminder: a tariff is a tax. On Americans.", "2019-05-13T20:11:33.000Z": "The parents of kids born or adopted in Colorado will now get a $100 college savings account to help get them started on saving for their child's education Gov. Polis signs college kickstarter bill into law During a ceremony at CU-Boulder Monday, Gov. Jared Polis signed a bill designed to give every child born in Colorado $100 in a college savings account. koaa.com", "2019-05-10T12:19:49.000Z": "This is abysmal economic ignorance. Where are the White House economists? Quote Tweet Donald J. Trump @realDonaldTrump Tariffs will bring in FAR MORE wealth to our Country than even a phenomenal deal of the traditional kind. Also, much easier & quicker to do. Our Farmers will do better, faster, and starving nations can now be helped. Waivers on some products will be granted, or go to new source! Show this thread", "2019-05-10T20:50:34.000Z": "More batters are getting hit by pitches than ever before Batters Are Getting Plunked At Historic Rates. But Why? The current rate of batters hit by pitches is the highest since 1900. fivethirtyeight.com", "2019-05-10T15:44:31.000Z": ". @GovofCO addressed the SBE and thanked the board for supporting full-day kindergarten and legislation reworking the READ Act. Polis discussed the importance of the partnership between his office and the SBE, of which he was member from 2000 to January 2007. #edcolo", "2019-05-10T17:45:52.000Z": "\"I'm very proud of the work that we've done, and by working together we can make sure Colorado remains the best state to start a business, grow a family and more.\" @GovofCO  #dmccpolicy  #copolitics", "2019-05-10T14:39:04.000Z": "\"We are confident that we will be able to achieve that 30% reduction on the Western Slope,\" said @McCluskieforCO on her #Reinsurance health care bill that passed with bipartisan support in he House and Senate. #coleg  #copolitics Will rural residents reap benefits from reinsurance plan? DENVER - Colorado's reinsurance plan, passed by lawmakers in the final days of the legislative session, promises to reduce individual insurance... the-journal.com", "2019-05-10T13:38:49.000Z": "A trade deficit is not a loss of money. If you buy from a supermarket or go to a movie, you have a trade deficit, but you have not lost money; you get stuff (groceries, entertainment, etc.) in exchange for your dollars. Quote Tweet Donald J. Trump @realDonaldTrump We have lost 500 Billion Dollars a year, for many years, on Crazy Trade with China. NO MORE!", "2019-05-08T18:02:53.000Z": "Colorado hero Kendrick Castillo lost his life saving others. Kendrick, 18, lunged towards the gunman and helped prevent an even worse tragedy. Colorado will always remember the heroism of Kendrick Castillo. Student killed at STEM School Highlands Ranch lunged at gunman, classmate says Kendrick Castillo was shot and killed at STEM School Highlands Ranch on Tuesday.", "2019-05-07T21:01:18.000Z": "We are making all of our public safety resources available to assist the Douglas County Sheriff's Department in their effort to secure the site and evacuate the students. We are monitoring the situation in real time. The heart of all Colorado is with the victims & their families.", "2019-05-06T20:15:38.000Z": "Proud to stand with the @GovofCO , the @COHouseDem and the @COSenDem to celebrate this historic session! We delivered real results for #colorado families! #coleg  #boldlyforward", "2019-05-06T22:39:17.000Z": "Free, #fulldayk will be available this fall to all families who choose it! @GovofCo will sign the bill next month. Thank you advocates, funders, partners, legislators & educators who rallied together to fulfill this promise to #ColoradoKids at long last! #coleg  #edcolo", "2019-05-06T17:45:25.000Z": "Great to celebrate an incredibly productive legislative session in Colorado with @GovofCO  @jaredpolis ! Thanks to the leadership from you, @kcbecker  @SteveFenberg and many others to #ActOnClimate and #ReformCOGCC !", "2019-05-06T03:26:32.000Z": "This is really cool. American Jews have long taken pride in athletes like Koufax and Hank Greenberg who opted not to play on Yom Kippur. Enes Kanter observing Ramadan while competing in the NBA playoffs will hopefully do the same for American Muslims. Ramadan Kareem! Quote Tweet Seffi Kogen @seffikogen What a cool Sandy Koufax moment for American Muslims!! https:// nytimes.com/2019/05/05/spo rts/enes-kanter-ramadan-fasting.html ", "2019-05-05T20:45:06.000Z": "\"You've got to be very careful if you don't know where you are going, because you might not get there.\"\n-Yogi Berra", "2019-05-05T16:16:05.000Z": "If you missed the townhall last night with Governor @jaredpolis at Sierra you can watch it in its entirety at this link https:// fox21news.com/top-stories/wa tch-live-colorado-springs-town-hall-with-gov-jared-polis/1964481892  We were proud to host the Governor and enjoyed seeing our great students asking some tough questions. #GoStallions  #StallionNation", "2019-05-05T01:06:27.000Z": "Ser Brienne of Tarth? Queen Elizabeth II's elite guard recruits first woman in its 359-year A woman joined the Household Cavalry for the first time in 359 years, The Times reports. thehill.com", "2019-05-05T00:35:00.000Z": "Then unicorns can do it too! Narwhals beat the death sentence of low genetic diversity Despite their limited evolutionary toolbox, narwhals are thriving sciencemag.org", "2019-05-03T18:20:26.000Z": "Henceforth, there won't be any more (sic) after a quoted error according to AP. Shall I make one more go of it for old lime's (sic) sake? AP updates guidance on mentions of race, accent marks, and more As promised, this week we will discuss more changes in the Associated Press Stylebook, as announced at the annual conference of ACES: The Society for Editing. But first, one more change that falls in... cjr.org", "2019-05-03T17:04:09.000Z": "Thank you, ... @GovofCO  ... @jaredpolis  New committee to focus on protecting Colorado animals from cruelty New committee to focus on protecting Colorado animals from cruelty Colorado Gov. Jared Polis has created a new committee specialized to work on protecting animals from abuse. thedenverchannel.com", "2019-05-03T15:59:15.000Z": "Today is the last day of session for our state legislature #coleg . While there are some important work to finish up, this session has been amazing and I'll soon be signing bills to save people money on healthcare and a bill to finally bring free full-day kindergarten to Colorado!", "2019-05-02T23:37:27.000Z": "Whatever candidate you support, Time's cover is a wonderful milestone to celebrate the possible and inspire the celebration of love and family in all its forms Quote Tweet Chasten Buttigieg @Chasten 11 years ago, when I came out, I didn't think there was a place for me in this world. \n10 months ago we said \"I do.\"\n1 month ago we said \"let's do this.\"\nToday: Show this thread", "2019-05-02T06:23:13.000Z": "If Hirondellea gigas were a class in #DungeonsAndDragons , it would be able make its own armor starting w aluminum, working up to chain mail, and at high levels plate armor +2 w water damage immunity This shrimplike creature makes aluminum armor to survive the deep sea's crushing pressure Aluminum hydroxide gel also protects its exoskeleton from disintegrating sciencemag.org", "2019-05-01T01:00:42.000Z": "It's a standing ovation for  ... @GovofCO  @jaredpolis  !!! #FullDayK passes!!!! Amazing panel discussion on P-3 initiatives ... @CUDenverCPE_ED  tonight - today history is made in #edcolo which will benefit future generations for decades to come!!!", "2019-04-30T16:11:27.000Z": "A Super Tuesday for Colorado: Gov. Jared Polis makes March 3, 2020, presidential primary official A Super Tuesday for Colorado: Gov. Jared Polis makes 2020 presidential primary official Colorado will hold its first presidential primary in two decades March 3, joining more than a dozen states voting on Super Tuesday. denverpost.com", "2019-04-30T14:19:28.000Z": "The number of colors you see in a rainbow depends on expectations and culture. Aristotle wrote of only 3 colors and ancient Chinese scholars described 5. Next time you see a rainbow, try to see as few as 3 colors or as many as 12 https:// discovermagazine.com/2019/may/20-th ings-you-didnt-know-about--rainbows ", "2019-04-29T21:45:29.000Z": "Promising technology to reduce hospital infection rates and viral outbreaks Non-thermal plasma: new technology could kill 99.9% of the deadly germs in the air A new reactor may soon be able to safely disinfect the air in crowded spaces. theconversation.com", "2019-04-28T18:35:23.000Z": "Something special is happening this April. For the first time, renewable energy (hydro, biomass, wind, solar and geothermal) will generate more electricity than coal-fired plants in the US! IEEFA U.S.: April is shaping up to be momentous in transition from coal to renewables - Institute... The future of the U.S. electricity generation industry may have arrived, and it is not good news for struggling coal-fired generating plants. This month, for the first time ever, the renewable energy... ieefa.org", "2019-04-26T17:10:38.000Z": "Don't worry, I have not become a Cheyenne Republican #copolitics", "2019-04-26T05:04:27.000Z": "The Roly-Poly, or pillbug, isn't a bug at all, but actually a land-based crustacean!", "2019-04-25T20:36:09.000Z": "Wonderful to have children of state workers, Governor's staff, press, and legislators in my office for #bringyourchildtoworkday to learn about all of our work. A great reminder that we all are working for a better future for our youth! #Copolitics", "2019-04-24T15:01:31.000Z": "And we're off on the #healthcareroadmaproadtrip ! We're driving from Denver to Towaoc over the next 3 days to talk about how we are going to save people money on health care. First stop - Fairplay! #boldlyforward  #followtheminivan", "2019-04-22T17:59:36.000Z": "CO stands in solidarity with Christians worldwide in the wake of the Sri Lanka attacks. I call upon the federal gov't to fully investigate international anti-Christian terrorist networks & reiterate that in CO we protect & celebrate people of all faiths. Sri Lanka attacks: 'International network' linked to bombings Suicide bomb attacks on churches and hotels on Easter Sunday left 290 dead and hundreds injured. bbc.com", "2019-04-22T17:26:10.000Z": "Ebola containment drill... just making sure our ... @DenverHealthMed  pathogen containment unit is fully prepared for whatever comes our way", "2019-04-20T18:00:27.000Z": "Today, we remember those who were taken from us at #Columbine . We comfort those who were harmed. And we reflect on the emotional trauma inflicted on our community, our state, and our country. #Columbine20", "2019-04-19T19:26:18.000Z": "Thrilled to be in Grand Junction for the Western CO Economic Summit at @ColoradoMesaU to discuss the W. Slope's thriving economy! I will be a working partner w/ @GJEconDev , county & local governments, & the private sector to prepare for the economy of the future! #copolitics", "2019-04-19T16:21:24.000Z": "Great discussion in Eagle County on how to provide affordable, accessible behavioral healthcare. County Commissioner @JeanneMcQueeney is right - state agencies, along with nonprofits & the private sector  must collaborate to provide attainable behavioral healthcare! #copolitics", "2019-04-18T18:31:04.000Z": "Wonderful to be at High Plains Elementary School of @AcademyD20 in Colorado Springs to discuss how parents, districts, and of course, students will benefit from free full-day kindergarten! #copolitics  #boldlyforward  #first100days", "2019-04-18T14:10:26.000Z": "To kick off my administration's first 100 days in office, I am starting my day in Trinidad to discuss the recent acquisition of Crazy French Ranch and how this new area of public land will help boost the local outdoor recreation economy! #copolitics", "2019-04-16T22:52:48.000Z": "Today, we take a step to ensure the health & safety of our communities & give local communities a meaningful voice in the activities in their neighborhoods. I am proud to stand alongside bipartisan elected officials, environmental orgs, and O&G industry to sign #SB181  #copolitics", "2019-04-16T17:54:26.000Z": "Proud to announce alongside the @checkr CEO that they will be establishing their 2nd headquarters in CO! I am pleased to welcome 1,500 jobs to CO, along with a company whose values are as thoughtful as their business technology solutions! #copolitics  @ColoradoEcoDevo  @BetsyMarkey", "2019-04-15T21:51:04.000Z": "Today I'm on jury duty #winninglotteryticket so TAG @LtGov4CO you're it!", "2019-04-14T23:35:25.000Z": "Solar power can make agriculture more efficient and profitable Fraunhofer Reports Combining Farming With Solar 186% More Efficient In Summer Of 2018 Frauhofer ISE's experimental agrophotovoltaic farm in Germany was 186% more efficient during the hot, dry summer of 2018 than the land would have been if it was devoted solely to agriculture or solar... cleantechnica.com", "2019-04-14T02:11:07.000Z": "Wise words from my friend @justinamash Quote Tweet Justin Amash @justinamash Politicians, media, and activists like to divide us into good people and bad people based on political or social perspectives. Don't play their game. Most people are good. Americans share most principles. But we have different experiences that shape our views. Debate, don't hate.", "2019-04-13T19:24:23.000Z": "So it turns out \"red America\" and \"blue America\" are just two ways of looking at the same amazing country Your Color Red Really Could Be My Blue livescience.com", "2019-04-12T23:27:43.000Z": "Full-day Kindergarten: come for the educational benefits for kids. stay for the $avings for families #copolitics Colorado families could save thousands on full-day kindergarten next year. Here's how. Of the 63,409 kindergartners enrolled in Colorado public schools this year, nearly 80 percent - 50,076 - are enrolled in full-day classes.", "2019-04-11T20:35:01.000Z": "This is saving people ! The Peak Alliance in Summit County is perfect example of democracy in action! Our administration is excited by this initiative, which enables consumers to collectively negotiate their insurance plan & lower healthcare costs! Lt.Gov. Dianne Primavera visits Summit County to learn about Peak Health Alliance Gov. Jared Polis introduced last week a \"roadmap\" to reducing health care costs in Colorado. The broad plan involves utilizing several legislative and community-based approaches to attack the problem summitdaily.com", "2019-04-10T20:01:00.000Z": "Gov. Polis creates Commission on Employee Ownership to boost locally-owned businesses (via @Conrad_Swanson ) #Copolitcs  @colo_politics  @GovofCO Gov. Polis creates commission to fulfill promise of economy that works for all, not just wealthy Gov. Jared Polis created a commission Wednesday to boost Colorado's employee-owned businesses, signing an executive order where he began his gubernatorial campaign nearly two years ago - in the... gazette.com", "2019-04-10T21:43:00.000Z": "Employee ownership in all forms (stock options, coops, stock grants, ESOPs, profit sharing agreements, etc) align incentives, increase morale and retention, and lead to greater growth; and workers participate in the increased value creation! Gov. Polis creates commission to support employee-owned businesses Polis signed an executive order creating the Commission on Employee Ownership in hopes of helping small business transition to the model, should they desire to. fox21news.com", "2019-04-10T21:20:16.000Z": "The human family is getting larger. Welcome to the club, Homo luzonensis! Previously Unknown Human Species Discovered in the Philippines Beneath the rocky floor of Callao Cave on Luzon island in the Philippines, researchers have uncovered a number of fossils from what they believe is a previously history.com", "2019-04-10T20:51:41.000Z": "@jaredpolis our Governor, coming to Gateway to speak with our AVID students today! #Unitythroughcommunity  #OlyPride", "2019-04-10T17:05:02.000Z": "Didn't I see this movie? And I for one welcome our new primate overlords Chinese scientists have put human brain genes in monkeys-and yes, they may be smarter Human intelligence is one of evolution's most consequential inventions. It is the result of a sprint that started millions of years ago, leading to ever bigger brains and new abilities. Eventually,... technologyreview.com", "2019-04-09T13:10:09.000Z": "In Colorado, @jaredpolis is working to create a more sustainable workforce by encouraging employee ownership of businesses in the state | @denverpost  #EmployeeOwnership  #GoodJobs Colorado launches initiative to boost employee ownership of businesses Governor Jared Polis is taking action on one of his top economic development priorities - promoting employee ownership of businesses and companies in the state. denverpost.com", "2019-04-08T06:37:22.000Z": "Llamacorn!", "2019-04-07T06:04:51.000Z": "Coastal wolves are about the size of a German Shepard, swim for miles, and mostly eat sea food Meet the Rare Swimming Wolves That Eat Seafood Unlike its interior cousins, gray wolves of Vancouver Island live with two paws in the ocean and two paws on land. nationalgeographic.com", "2019-04-07T01:17:46.000Z": "Q: in which Burrough did Barry the burrowing bird on the burro bury the baroque burr and berry?\n\nA: Staten Island", "2019-04-07T00:14:39.000Z": "And on the topic of purple: Giant purple squirrels do exist-and they have an odd behavior These four-pound tree dwellers, native to India, have an unusual method for storing their food that's unlike any other squirrel. nationalgeographic.com", "2019-04-07T00:14:05.000Z": "If you see a \"purple people eater\" and it's not purple you can relax, because it likely only eats purple people. If it is purple however, RUN FOR YOUR LIVES!", "2019-04-06T20:45:40.000Z": "You can accomplish what you want in life. Dream, Dare, Do!", "2019-04-06T05:24:51.000Z": "Are you among those who can't wait to get your hands on cockroach milk? Cockroach Milk Could Be the Next Great Superfood Was dog semen not an option? Can we not make smoothies with possum blood instead? How about protein powder made from ground spiders? Maybe just slap a fresh raw donkey uterus onto our plates and have... rare.us", "2019-04-05T19:23:21.000Z": "Go @Rockies !!!!", "2019-04-03T20:11:11.000Z": "Wonderful to speak with parents and full day kindergarten advocates from all corners of the state at the Capitol today! Thank you for tireless work and I am optimistic we will get it across the finish line this year!", "2019-04-03T19:19:40.000Z": "#SB181 is on it's way to @GovofCO 's desk! Coloradans finally have a voice when it comes to oil+gas development in our state. Health and safety will come first. Thank you to @SteveFenberg  @SenMikeFoote  @kcbecker and @YadiraCaraveo for co-sponsoring this bill #coleg  #copolitics", "2019-04-03T19:01:43.000Z": "Jared Polis won 41/65 State House districts in 2018. Interestingly enough that is the exact breakdown of the chamber. Senator Michael Bennett won that same amount of districts in 2016. Fewer and fewer voters are splitting their tickets.", "2019-04-03T17:59:52.000Z": "Proud to stand along side @JeffBridges , @BarbaraforCO , Rep. Jim Wilson, and all the families and community members who are at the Capitol advocating for free full-day kindergarten for fall of 2019! #copolitics", "2019-03-31T23:18:32.000Z": "Colorado needs better air quality now! Governor Polis makes big moves to try to improve Colorado's air quality Governor Jared Polis is making a serious push to get Colorado compliant with federal air quality standards. thedenverchannel.com", "2019-03-31T03:24:25.000Z": ". @jaredpolis was the only Democrat member of @justinamash 's @libertycaucus : Colorado's governor, is an unusual breed: a libertarian Democrat https:// economist.com/united-states/ 2019/03/30/jared-polis-colorados-governor-is-an-unusual-breed-a-libertarian-democrat?fbclid=IwAR0TRoAuhjhZ4a1yX46HZCiJ6_FFI_N_1UmVJ9fwkHaQpOZIoQVe0DrKi44  via @TheEconomist Jared Polis, Colorado's governor, is an unusual breed: a libertarian Democrat He must strike a difficult balance economist.com", "2019-03-29T22:26:09.000Z": "Wonderful to be at the @NoCoHempExpo to promote Colorado's thriving industrial hemp industry! Colorados hemp economy is a model for the rest of the country and as Governor, I want to create an environment that ensures the industry can reach its full potential! #HempHempHooray", "2019-03-30T17:11:00.000Z": "\"Helping to grow the industrial hemp industry is really a focus of our administration.\" - @GovofCO Hemp Is Next: Colorado Wants More Than Marijuana Prominence Denver's heavyweight status in the hemp industry is on full display at the NoCo Hemp Expo. westword.com", "2019-03-30T02:46:17.000Z": "Featured in @TheEconomist woo hoo! #COpolitics Jared Polis, Colorado's governor, is an unusual breed: a libertarian Democrat He must strike a difficult balance economist.com", "2019-03-29T19:44:02.000Z": "#SB181 updates Colorado's antiquated laws to protect families and individuals from residential oil and gas drilling by putting#HealthandSafety first and #ReformCOGCC  https:// wsj.com/articles/color ado-moves-to-regulate-drilling-after-years-of-conflict-11553864763   #coleg  #copolitics Colorado Moves to Regulate Drilling After Years of Conflict In energy-rich Colorado, a conflict between those who believe drilling has crept too close to backyards and schools and risks marring the environment and those who tout its economic benefits for... wsj.com", "2019-03-29T18:15:59.000Z": "Thanks no thanks @CUBoulder  https:// colorado.edu/today/2019/02/ 28/catching-sleep-weekend-doesnt-work ", "2019-03-29T03:27:31.000Z": "Thank you @RochelleGalindo for co-sponsoring a bill to fund full day kindergarten and increase pay for hardworking Greeley teachers! #copolitics Proposed District 6 staff wage increase contingent upon full-day kindergarten funding from the state District 6 board members, staff and administrators react to discussion at the March 28, 2019 negotiation meeting. (Emily Wenger/ewenger@greeleytribune.com)While the teachers union and the Greeley-E greeleytribune.com", "2019-03-28T23:05:01.000Z": "Thanks @GovofCO for signing this important bill into law today. This is a huge first step in our efforts to save people money on health care. Proud to be co-sponsor! #coleg  #copolitics  #COhealth Colorado's hospital transparency bill is now law. Here's what it will and won't do. Colorado hospitals face new scrutiny after Gov. Jared Polis signed a new law Thursday that requires them to submit annual reports tracking what they're charging customers and what they' denverpost.com", "2019-03-28T19:32:19.000Z": "NEW: @RandPaul , @RepZoeLofgren , @justinamash & @RonWyden are introducing a bill to finally abolish the last vestige of the NSA's post-9/11 domestic bulk phone records surveillance. New Bill Would Finally Stop NSA's Mass Collection of U.S. Phone Data The surveillance giant shut down its flawed dragnet last year. Four legislators are trying to stop one of the security state's most infamous post-9/11 programs from returning. thedailybeast.com", "2019-03-27T22:03:01.000Z": "It was a pleasure to visit with CO Department of Natural Resources to talk to the stewards of our majestic public lands. Thank you @dangibbs16 for your leadership to preserve and enhance our Colorado way of life! #COpolitics", "2019-03-26T17:05:58.000Z": "Replying to @jessemallory Amazing. Who would have ever guessed, given how divisive this session has been and our politics are, the one thing that could unite the left and the right was a fresh state logo? #copolitics GIF", "2019-03-27T00:58:56.000Z": "A personal request from Mike Pence! Uh-oh!", "2019-03-26T21:41:33.000Z": "New logo for Colorado!\nThe tree evokes Colorado's natural resources and spirit, red symbolizes Colorado's red soil/rocks, yellow shows our sunshine and wheat of the plains, dual peaks represent the mountains in our state, blue base represents water-our most important resource", "2019-03-26T16:32:26.000Z": "@GovofCO  says to have a logo that better reflects the whole state is consistent with his goal of a \"colorado for all\" says the old logo really just \"talked about the mountains.\" #coleg  #copolitics  #cogov", "2019-03-26T16:51:00.000Z": "I'm glad that awful green triangle is gone. #copolitics Quote Tweet Marshall Zelinger @Marshall9News The new logo apparently existed in prior administration and was a logo in pin-form and hats handed out at trade shows, according to @GovofCO  #coleg  #copolitics Show this thread", "2019-03-26T16:29:38.000Z": "New brand, who this? #copolitics", "2019-03-25T20:29:26.000Z": "This bipartisan bill, SB19-009 which provides financial incentives for educators to work in rural areas, was just signed into law by @GovofCO . Thank you @BarbaraforCO for pushing this bill through. #coleg  #copolitics", "2019-03-26T06:06:27.000Z": "I see yellow, and I'm surprised only 42% agree. 52% say \"green\" and 6% \"other\" https:// theatlantic.com/science/archiv e/2018/02/what-color-tennis-ball-green-yellow/523521/ ", "2019-03-25T20:00:01.000Z": "#SB181 updates our antiquated laws to protect Coloradans from residential drilling by prioritizing #HealthandSafety , giving local communities a say, and ensuring clean air and water are protected. Our oil and gas laws haven't been updated in 60 years. #copolitics  #coleg", "2019-03-25T18:28:57.000Z": "Full Day K is coming to the state legislature. @BarbaraforCO is a co-prime sponsor of this bipartisan measure. \"Today was Rural Schools Day in the Capitol, & so this is the perfect time to say this was a fabulous bill for rural schools.\" #coleg  #copolitics Gov. Jared Polis says funds identified for full-day kindergarten State Rep. Barbara McLachlan predicted state funding for full-day kindergarten, one of her main legislative goals, will become a reality during the... durangoherald.com", "2019-03-24T02:48:03.000Z": "Colorado Governor Jared Polis and State Senator Jeff Bridges were our guests at Fort Logan Northgate School today! They participated in  a community forum on full day kindergarten! What a treat and honor to host them ! #safesmartandhappy", "2019-03-25T13:32:49.000Z": "Read how @jaredpolis  #fulldayk proposal has the added effect of freeing up 5000 Colorado #preschool program slots - representing the biggest increase in #ECE in CO's history! Early childhood educators tout trickle-down effect of full-day kindergarten on preschoolers in... As Colorado lawmakers begin debating Gov. Jared Polis' revisions to the 2019-20 state budget, early childhood education leaders in Colorado Springs are keeping their fingers crossed that one addition... gazette.com", "2019-03-24T02:32:25.000Z": "The debate is getting tense, both sides making unproven claims. #fakenews accusations are flying. I'm trying to bring both sides together around a simple message: In Colorado, you're entirely safe from both shark attacks and falling coconuts #copolitics FACT CHECK: Do Falling Coconuts Kill More People Than Sharks Each Year? This factoid has been repeated so often it might as well be true, but \"research\" on which it is based is a press release for a travel agency with remarkably comprehensive health insurance coverage. snopes.com", "2019-03-22T20:53:19.000Z": "I'm the Senate sponsor for #FullDayK ! Join Gov. @JaredPolis and me tomorrow for a town hall on the topic, because every kid deserves the chance to succeed no matter where they come from. Details: https:// facebook.com/events/2729306 46964742/ ", "2019-03-22T20:52:02.000Z": "   Gov. Polis introduces fully-funded kindergarten to 'make sure every child gets a strong start' GREELEY, Colo. - Gov. Jared Polis celebrated the largest increase in early childhood education in Colorado History alongside parents, legislatures,  staff and students of Greeley Elementary School  kdvr.com", "2019-03-22T15:12:05.000Z": "Polis blocks blame-it-on-China push to prevent EPA from flunking Colorado as \"serious\" violator of federal air-quality standards https:// dpo.st/2UKQphI via @denverpost Polis blocks blame-it-on-China push to prevent EPA from flunking Colorado as \"serious\" violator of... Colorado's evolving posture emerged Thursday as the state Department of Public Health and Environment's Air Quality Control Commission rejected a push by a pro-industry group called Def denverpost.com", "2019-03-22T14:27:49.000Z": "I'm excited to sign a bill soon \"knocking out layers of regulation\" to make it easier for farmers to sell their produce @katebgreenberg Lawmakers pass bill to help Colorado farm stands sprout up If you're nutty for Colorado-grown fruits and veggies, a bill headed to the governor's desk could prove mighty sweet. coloradopolitics.com", "2019-03-22T03:08:34.000Z": "SIGNED INTO LAW! \n\n\"Kevin's Law\" was signed into law by @GovofCO today. This law allows Coloradans access to life-sustaining medication (insulin, inhalers, etc) without a prescription in emergency situations. \n\nThis new law will save lives. #insulin4all  #coleg  #copolitcs", "2019-03-22T01:47:01.000Z": "Colorado drought levels are cut nearly in half in a week span; Gov. @jaredpolis declares snowpack is \"epic\" http:// bit.ly/2HAqs1i", "2019-03-21T05:10:33.000Z": "20% of all false teeth are made in the little country of Liechtenstein http:// mentalfloss.com/article/69736/ 13-fascinating-little-facts-about-liechtenstein ", "2019-03-20T20:00:48.000Z": "Celebrating Colorado Agriculture Day at the Capitol lived up to the hype! Colorado's Agriculture community provides many jobs, and I look forward to helping keep their legacy alive and thrive! @", "2019-03-20T18:10:05.000Z": "Gia is visiting the office today!", "2019-03-20T12:06:06.000Z": "Wild Animal Sanctuary gets $45,000 donation from Gov. Polis' inauguration fundraiser http:// bit.ly/2U5CndH", "2019-03-20T02:38:47.000Z": "A big thanks to the @CO_JBC (Joint Budget Committee) of the Colorado State Legislature & @GovofCO (Jared Polis) for prioritizing kindergarten funding. You're helping ensure that all our kids start out on the right foot and that #everychildsucceeds .", "2019-03-20T01:34:39.000Z": "Today was a great day for CO kids and families. Thank you @CO_JBC !! #fulldayK Quote Tweet Jared Polis @jaredpolis Thank you to the members of the Joint Budget Committee for recommending full funding for free, full-day kindergarten this year. This will save parents and school districts money, and give our students an even brighter future. A huge win for Colorado kids! #copolitics  #coleg", "2019-03-20T01:10:04.000Z": "Among the nuances, complexities, and revelations of life, it's important to note that the elegant, clarifying, and erstwhile perfunctory Oxford comma is now simply a legal, ethical, and stylistic imperative. Take That, AP Style! Court of Law Rules the Oxford Comma Necessary This settles the Oxford comma debate! Except...it goes against AP style. Here's an overview of how the serial comma works and why it's important for clarity. thewritelife.com", "2019-03-20T00:08:27.000Z": "Thank you to the members of the Joint Budget Committee for recommending full funding for free, full-day kindergarten this year. This will save parents and school districts money, and give our students an even brighter future. A huge win for Colorado kids! #copolitics  #coleg", "2019-03-16T20:40:47.000Z": "Our second town hall in Ridgway was great! Thank you all for your thoughtful questions and support for free full day kindergarten! And thank you Rep @BarbaraforCO for hosting the event!", "2019-03-16T21:16:01.000Z": "If this was my living room, I wouldn't be amoosed Quote Tweet Colorado Parks and Wildlife @COParksWildlife Think you're having a rough Friday? Homeowners and @BreckPolice were surprised this morning when a suspected home invasion turned out to be... an adult cow moose. Show this thread", "2019-03-16T19:05:24.000Z": "Sometimes a \"red\" pepper is just a red pepper", "2019-03-16T05:43:41.000Z": "I feel like I should have known this before: red peppers, green peppers, and orange/yellow peppers are all the same species, just more or less ripe depending on color Do You Know the Real Difference Between Red and Green Peppers? thescienceexplorer.com", "2019-03-16T03:37:03.000Z": "Works for me because I happen to love (iced) green tea! Green tea cuts obesity, health risks in mice Green tea cut obesity and a number of inflammatory biomarkers linked with poor health in a new study. Mice fed a diet of 2 percent green tea extract fared far better than those that ate a diet... news.osu.edu", "2019-03-15T20:52:23.000Z": "#SB057 , sponsored by @McCluskieforCO , @SteveFenberg , and @Story4CO , was signed into law today by @GovofCO . This bill will notify state employees of their eligibility for the federal Public Service Loan Forgiveness program . #coleg  #copolitics", "2019-03-15T22:43:24.000Z": "JUST IN: Colorado officially joins the National Popular Vote Interstate Compact with a signature from Gov. Jared Polis. https:// buff.ly/2O8j6CF  #copolitics Colorado Joins National Popular Vote Movement With Gov. Jared Polis' Signature Colorado joins 11 other states and the District of Columbia in what's called the National Popular Vote Interstate Compact. cpr.org", "2019-03-15T22:57:20.000Z": "Erin Martinez: I'm not a victim, I'm an advocate for health and safety. https:// bit.ly/2UEtip1  #copolitics  #coleg Colorado lawmakers are using the deadly Firestone explosion as a fulcrum for change - just as Erin... Erin Martinez and her story have become central to the debate over Senate Bill 181, the most expansive package of new regulations on Colorado's energy industry in decades. coloradosun.com", "2019-03-13T23:03:33.000Z": "He was, and always will be remembered as, a hero- Our hearts are with Dan Grove's partner and family. Quote Tweet Colorado State Patrol @CSP_News RELEASE: Information regarding fallen Colorado State Patrol Corporal Dan Groves.", "2019-03-13T19:03:17.000Z": "Gov. @jaredpolis talks about the #blizzard hitting #Colorado . Extended live coverage continues on FOX31 and streaming here: http:// bit.ly/1qor9HT", "2019-03-12T04:03:38.000Z": "Braavos, Governor. Braavos. Quote Tweet Jared Polis @jaredpolis \"Winter is coming!\" Arryn't you aware of the stark grey joy of the coming blizzard? Don't tully around, bolt on your windows and doors and don't let your pets frey outside! http:// bit.ly/2F7Fo4R", "2019-03-12T03:54:57.000Z": "\"Winter is coming!\" Arryn't you aware of the stark grey joy of the coming blizzard? Don't tully around, bolt on your windows and doors and don't let your pets frey outside! Blizzard Expected As 'Bomb Cyclone' Explodes Over Colorado Wednesday Believe it or not this is really a valid meteorological term. denver.cbslocal.com", "2019-03-10T22:26:53.000Z": "I'll be your friend :) Quote Tweet Justin Amash @justinamash Hello, it's me twitter.com/CNNPolitics/st", "2019-03-09T22:40:48.000Z": "Yup! Sounds right Cats Recognize Their Owner's Voice But Choose to Ignore It Researchers think cats' dismissive attitudes are a product of their evolutionary history over the past 9,000 years smithsonianmag.com", "2019-03-09T06:46:47.000Z": "In Animal Kingdom, Blood Comes in a Rainbow of Colors Blood isn't always red-evolution has given rise to a variety of hues. nationalgeographic.com", "2019-03-07T22:43:23.000Z": "Great to see #Colorado join the list of states that exempt #utilitytokens from state securities laws! Colorado today joined #Wyoming & #Arizona , which passed this exemption last yr (tho Arizona's has a dollar value cap). More states on the way this yr too. Congrats @jaredpolis ! Quote Tweet TheresaSzczurek @TheresaSzczurek Exciting day for #blockchain technology. @GovofCO  @jaredpolis signed the #Digital Token Act today with key legislators, Attorney General @pweiser , and #Colorado cabinet members Patty Salazar with @DORAColorado , @BetsyMarkey with OEDIT, and @TheresaSzczurek of @OITColorado .", "2019-03-03T18:40:11.000Z": "Vail!", "2019-03-01T17:01:15.000Z": "Happy Weights and Measures Week! Ten Totally Colorado Measurements for Weights and Measures Week Governor Jared Polis has named this Weights and Measures Week. westword.com", "2019-03-01T03:13:26.000Z": "Got my badge today! (Yes the Gov of CO gets a badge)", "2019-02-28T18:56:06.000Z": "It's encouraging to see the integrity and independence of the Israeli justice system: https:// timesofisrael.com/netanyahu-to-s tand-trial-for-bribery-and-breach-of-trust-pending-hearing/ ", "2019-02-28T17:32:23.000Z": "At today's ECLC meeting, @GovofCO thanked statewide #earlychildhood partners: \"There is no path to improving early childhood education that does not go through full-day kindergarten.\" #colorado  #earlyed  #FullDayK  #kindergarten", "2019-02-22T22:49:18.000Z": "WATCH: Colorado Governor @jaredpolis (D) says he is looking for \"authenticity\" in 2020 presidential candidates:\n\n\"Really it'll come down to who do you trust and who is competent and capable.\" #MTPDaily", "2019-02-19T07:33:31.000Z": "Maybe I need to try out the one in my attic... Man discovers 30 year old Apple computer still in working order A New York professor has Gen Xers reminiscing about their childhood after he posted images of his decades old Apple lle computer on Twitter Saturday night. cnn.com", "2019-02-19T07:06:31.000Z": "Are 2 Snowflakes Ever Identical? Are 2 Snowflakes Ever Identical? Is the \"unique snowflake\" just flake news? Mother Nature might never produce two identical snowflakes, thanks to the near-infinite variability of the conditions affecting ice crystal formation. But a... scientificamerican.com", "2019-02-19T06:57:29.000Z": "", "2019-02-18T01:18:02.000Z": "Are images of real people becoming obsolete? This website uses technology to create realistic human faces; refresh/reload for a new one. The photos look just like \"real\" people but are generated by a neural network https:// thispersondoesnotexist.com", "2019-02-16T22:06:12.000Z": "Polis sees 'historic opportunity' for health care reform Polis sees 'historic opportunity' for health care reform Gov. Jared Polis told a crowded auditorium here that state lawmakers have a \"historic opportunity\" this year to dramatically reduce the cost of health care to the public, especially those paying for... chieftain.com", "2019-02-16T16:45:06.000Z": "Some words of wisdom from my iced tea this morning", "2019-02-12T21:16:23.000Z": ". @katebgreenberg is the first woman to serve as Colorado ag commissioner. \"Women have always played in critical role in agriculture, yet they are infrequently recognized. I hope that women will see people like me & will see themselves as leaders in ag.\" https:// civileats.com/2019/02/11/mee t-kate-greenberg-colorados-new-commissioner-of-agriculture/ ", "2019-02-09T21:20:04.000Z": "Congrats to Colorado's @lindseyvonn on her final race this weekend and retirement as the greatest American skier ever! Lindsey Vonn Is The Greatest American Skier - And It's Not Even Close One of the great careers in international sport is coming to a close this weekend. Ski racer Lindsey Vonn's final run will be Sunday, at the 2019 Alpine World S fivethirtyeight.com", "2019-02-09T07:23:26.000Z": "One of the first universal basic income studies from Finland is now in! Universal income study finds money for nothing won't make us work less | New Scientist The most robust trial of universal basic income yet shows that it boosts well-being and doesn't decrease employment, as some had feared newscientist.com", "2019-02-08T02:35:13.000Z": "Rest In Peace @JohnDingell When I was first elected to the House I was somewhat in awe of serving alongside someone who had been in Congress since 1955. Your incomparable wit and legislative achievements including the Affordable Care Act leave a monumental legacy", "2019-02-07T06:59:01.000Z": "Replying to @jaredpolis The world's first 'bee-nary' computer?", "2019-02-07T06:56:58.000Z": "Very patient researchers used \"color-coded shapes to train 14 honeybees to do simple arithmetic.\" hopefully without getting stung Honeybees That Solve Math Problems Challenge Supremacy of Human Brains Maybe math isn't so hard after all. inverse.com", "2019-02-05T17:55:33.000Z": "\"Don't mess with Colorado trail runners.\" Gov. @jaredpolis comments on man who killed mountain lion with his bare hands: https:// dpo.st/2t90Srb by @NicGarcia  #copolitics Gov. Jared Polis, on Facebook, celebrates Colorado trail runner who killed mountain lion but urges... Gov. Jared Polis took to social media Friday to celebrate the toughness of a Colorado runner who killed an approaching mountain lion with his own hands. However, he urged others not to replicate th denverpost.com", "2019-02-05T05:50:19.000Z": "Ginsburg makes 1st public appearance since cancer surgery WASHINGTON (AP) - Supreme Court Justice Ruth Bader Ginsburg is making her first public appearance since undergoing lung cancer surgery in December. The 85-year-old Ginsburg is attending a concert at... apnews.com", "2019-02-04T17:57:37.000Z": "Thanks for the visit, Governor @jaredpolis ! #WeAreD51  #ItStartsWithKids  https:// bit.ly/2BjyRkZ", "2019-02-03T06:34:13.000Z": "Robots can learn to play Jenga now MIT robot combines vision and touch to learn the game of Jenga Machine-learning approach could help robots assemble cellphones and other small parts in a manufacturing line. news.mit.edu", "2019-02-02T21:33:09.000Z": "Life-saving drugs often cost far more here more than in other countries, and that's not ok. I'm looking forward to signing the @joannginal  @sonyajlewis  @SenRobRodriguez bill as soon as it lands on my desk #copolitics Colorado advances bill to import cheaper prescription drugs DENVER - Colorado on Thursday joined a growing number of states that want to cut certain prescription drug prices by importing licensed drugs from Canada. denverpost.com", "2019-02-02T17:07:46.000Z": "The guy deserves some credit here... Uniting Democrats, Republicans, and Independents on anything is no easy task! Howard Schultz viewed unfavorably by Dems, GOP and independents Howard Schultz, the former Starbucks CEO who has floated an independent run at the White House, is viewed unfavorably by Democrats, Republicans and independents, according to a new poll. thehill.com", "2019-02-02T02:30:00.000Z": "Thank you @McCluskieforCO for leading the fight to save people money on healthcare w #reinsuramce and hosting @KerryDonovanSD5  @Dylan_RobertsCO  @votebobrankin and I for a Healthcare townhall in Frisco where residents shared their stories", "2019-02-01T22:00:08.000Z": "Investments we make in #EarlyEd have benefits that go on for decades! @JaredPolis knows this and we stand ready to help Colorado #InvestInKids . http:// bit.ly/2Tsm72O  #COpolitics Following on his full-day kindergarten pitch, Colorado Gov. Polis highlights plans for 8,000 new... After weeks of focusing on full-day kindergarten, Colorado Gov. Jared Polis spoke about his plans to create 8,000 new preschool slots by next fall. co.chalkbeat.org", "2019-02-01T05:17:51.000Z": "Public lands are an enormous part of our identity and our Colorado way of life. They're why people move here, and choose to live here Coloradans, other Westerners strongly support public lands, conservation, new poll says The ninth annual Colorado College State of the Rockies Conservation in the West poll shows strong support for public lands, growing concerns about the region's water supplies and climate chan denverpost.com", "2019-01-30T14:54:40.000Z": "No surprise here: \"Counties with marijuana dispensaries open, experience 6 to 8 percent fewer opioid-related deaths\" Study shows legal access to marijuana reduces opioid overdoses The study found that counties with marijuana dispensaries open, experience 6 to 8 percent fewer opioid-related deaths among white men. ksdk.com", "2019-01-28T16:05:49.000Z": "No. @POTUS can't claim emergency powers for non-emergency actions whenever Congress doesn't legislate the way he wants. Quote Tweet Lindsey Graham @LindseyGrahamSC US Senate candidate, SC If White House and Congress fail to reach a deal then President @realDonaldTrump must act through emergency powers to build wall/barrier. Show this thread", "2019-01-28T02:14:34.000Z": "Today on International Holocaust Remembrance Day we remember those lost in the NAZI genocide and the intergenerational trauma it continues to create, and we vow never again, never again, never again.", "2019-01-27T18:40:24.000Z": "Warm wishes and prayers for Representative Walter Jones, a principled conservative never afraid to put his values above partisanship https:// abcnews.go.com/Politics/wireS tory/us-rep-walter-jones-north-carolina-enters-hospice-60649266 ", "2019-01-27T07:33:25.000Z": "Don't swallow catfish ever This Is What Happens When You Drunkenly Swallow a Live Catfish A hard lesson in a very strange party tradition theatlantic.com", "2019-01-27T07:07:22.000Z": "In these times of escalating nationalistic rhetoric, it's heartening to see Greece and North Macedonia settle their namesmanship squabble peacefully through statecraft and diplomacy Greeks Approve Deal to Rename Macedonia, in Victory for the West The vote by the Greek Parliament, over impassioned opposition, clears a path for the renamed North Macedonia to join the NATO alliance. nytimes.com", "2019-01-24T05:54:20.000Z": "\"So from the economic perspective in Colorado, I'd love other states to go slowly so that we can continue to see all these benefits for Colorado.\" Colorado's Pro-Legalization Governor Tells Other States Not To Allow Marijuana Newly sworn-in Colorado Gov. Jared Polis (D) is urging other states around the country not to legalize marijuana, but not for the reason you might think. It's not that Polis thinks legalization is a... marijuanamoment.net", "2019-01-23T16:46:56.000Z": "Congrats to Colorado Native, Arvada West graduate, and now Hall of Famer @baseballhall Roy Halladay Roy Halladay's Hall of Fame journey included many hours in his Arvada basement Halladay joins Goose Gossage as Colorado natives in the Baseball Hall of Fame", "2019-01-22T06:49:37.000Z": " Solar and wind are booming, while coal keeps shrinking The boom in solar and wind power in the United States will deal a fresh blow to coal country in the next few years. cnn.com", "2019-01-21T18:37:46.000Z": "Dr. Martin Luther King Jr. once said that \"Life's most persistent and urgent question is, 'What are you doing for others?'\"\n\nMy pledge to you is that every day I serve in this office, I will answer this question not just with words, but with action. #MLKDay", "2019-01-21T05:11:10.000Z": "Happy Super Wolf Blood Moon to all!", "2019-01-20T21:23:00.000Z": "Thank you to the kids at @greeleyschools Salida Del Sol Academy for an AMAZING performance that helped make my inauguration special! Greeley's Salida del Sol Academy performs at Colorado governor's inauguration ball Young musicians from Salida del Sol Academy last week were invited to perform at Gov. Jared Polis' inauguration ball.The Greeley students performed after being selected by the Colorado Direct greeleytribune.com", "2019-01-20T07:17:10.000Z": "This will be an intreresting basic income study to learn from in Sikkim If it moves forward https:// indianexpress.com/article/explai ned/simply-put-the-money-for-nothing-idea-sikkim-universal-basic-income-scheme-what-is-5532728/lite/ ", "2019-01-20T07:14:42.000Z": "\"I am fully able and willing to assume the office of the presidency on an interim basis to call for free and fair elections.\" Juan Guaidó offers a hope, a way out of authoritarian hell for Venezuela Quote Tweet Juan Guaidó @jguaido . @jorgemillant : este 2019 queremos reconquistar la paz, la democracia y la libertad. Este #23Ene nos encontramos en la calle. #TodaVzlaEnCabildo", "2019-01-20T01:35:51.000Z": "Happy birthday to the amazing, incredible @DollyParton Happy Birthday, Dolly Parton! 5 of Her Most Delightful, Retro TV Commercials Happy birthday, Dolly Parton! The beloved singer turns 73 on January 19, 2019.Parton has been busy lately, from releasing her Netflix film Dumplin' to working on a much-anticipated sequel to 9 to... parade.com", "2019-01-18T22:28:07.000Z": "I have authorized an emergency rule that makes all unpaid federal workers eligible for unemployment benefits, whether they are reporting for work or not. #Shutdown Colorado Gov. Jared Polis permits jobless benefits for federal employees working without pay Federal workers in Colorado who are required to work without pay through the shutdown can now apply for unemployment. denverpost.com", "2019-01-18T21:02:55.000Z": "From the @denverpost : For Becky English, a longtime volunteer for the @SierraClub , @GovofCO 's announcement was a welcome first step for the new administration. Gov. Jared Polis pushes Colorado toward zero-emission vehicles with first executive order Colorado Gov. Jared Polis rolled up in an electric car to a press conference in lower downtown Denver Thursday to announce a list of executive policy changes that taken together should put more ele denverpost.com", "2019-01-18T02:34:38.000Z": "Thank you to the Republicans and Democrats on the State Board of Education for endorsing full-day kindergarten! #copolitics Colorado's top education officials support Gov. Polis' full-day kindergarten proposal The Colorado State Board of Education adopted a resolution in support of paying for full-day kindergarten. co.chalkbeat.org", "2019-01-18T02:23:11.000Z": "Regardless of who is to blame, Congress should end the shutdown NOW it's really hurting people Poll Finds 100% Of Americans Blame Shutdown Entirely On Colorado Representative Scott Tipton WASHINGTON-A new Pew Research poll published Thursday revealed that 100 percent of Americans blame the United States federal government shutdown entirely on Scott Tipton (R-CO). \"From the Rust Belt... politics.theonion.com", "2019-01-17T19:44:42.000Z": "Thank you @JerrySonnenberg and @RepRodPelton for offering tax relief for ALL Coloradans. I look forward to working with you to achieve even lower rate than 4.49%, coming up w agreeable ways to reduce tax expenditures to ensure revenue neutrality Rural Colorado lawmakers introduce bill to reduce state income tax rate The bill would reduce Colorado's personal and corporate income tax rate from 4.63 percent to 4.49 percent. pagetwo.completecolorado.com", "2019-01-17T18:41:16.000Z": "Today we took a major step towards making electric vehicles more widely available in Colorado Governor Polis Takes Bold Action to Advance EVs & Clean Air Colorado's new governor is starting out the new year with a plan to reduce transportation carbon emissions to protect the environment and public health. nrdc.org", "2019-01-17T00:49:48.000Z": "\"Brexit is tearing British society and its political classes apart as the sides devolve into warring tribes of \"leavers\" and \"remainers,\" neither with enough power to best the other.\" Theresa May survives confidence vote, even after Brexit failure These are not normal times in British politics. washingtonpost.com", "2019-01-16T07:00:30.000Z": "Released budget to fund full-day kindergarten, save people money on healthcare, and invest $200 million in our roads. We also set aside 8% rainy day reserve fund+ leave $92 million unspent to help prevent cutbacks during a recession. Gov. Polis unveils first budget proposal, outlining full-day kindergarten plan and other initiatives Colorado Gov. Jared Polis unveiled his first budget proposal Tuesday, which outlines how he plans to pay for full-day kindergarten for all Coloradans, includes increases to education reserves and... thedenverchannel.com", "2019-01-14T07:04:18.000Z": "Have you been wondering what's going on w your compass? Magnetic north is now moving at 34 miles/year https:// nature.com/articles/d4158 6-019-00007-1 ", "2019-01-12T17:34:51.000Z": "Let's get to work!", "2019-01-11T23:50:18.000Z": "Hey @jaredpolis , are you a wizard? Three days ago you promised moisture and today we get this weather... coincidence?  #COwx", "2019-01-11T20:02:14.000Z": "I've been wondering the same thing for years How in the world is Steve King still in Congress? Steve King is at it again. cnn.com", "2019-01-10T19:00:53.000Z": "#COPolitics  #BoldlyFWD", "2019-01-10T19:02:15.000Z": "\"Together, we will build a Colorado that works for ALL!\"", "2019-01-08T23:26:11.000Z": "This was the view from the podium's perspective as I gave my inaugural address #ColoradoForAll", "2019-01-08T19:04:26.000Z": "A quick selfie as I become Governor", "2019-01-08T17:33:47.000Z": "The past, the current, and the future. Ready to build on the legacy of these leaders and get to work! #copolitics", "2019-01-08T14:30:51.000Z": "An inside look at the transition: Inside Jared Polis' Unique, Inclusive Approach to Governing Colorado governor-elect Jared Polis shares an inside look at a transition process that embraces openness and transparency.", "2019-01-06T05:42:40.000Z": "Lice offer a peek into a whale's social network The Stories Whale Lice Tell | Hakai Magazine Humpbacks can't tell you who they hang out with. But their lice can. hakaimagazine.com", "2019-01-06T00:34:29.000Z": "Felicitaciones y los mejores deseos\na @jguaido the new Venezuelan opposition leader. Across the world, we stand with you in your efforts to end the brutal dictatorship and restore democracy and human rights Venezuela's congress names new leader, who vows to battle President Nicolas Maduro Venezuela's opposition-controlled congress opened its first session of the year Saturday, installing a fresh-faced leader who struck a defiant tone and vowed to take up the battle against socialist... latimes.com", "2019-01-01T01:37:49.000Z": "Happy 2019! May the blessings of health, prosperity, and love be yours! GIF", "2018-12-29T01:35:34.000Z": "US House candidate, CO-2 Honored to deliver the final Democratic Weekly Address of 2018. #copolitics  #ForThePeople Quote Tweet Nancy Pelosi @SpeakerPelosi Americans sent a clear message in November - they are tied of exactly the type of behavior that triggered the #TrumpShutdown . Congressman-elect Joe Neguse is working to start putting things right by passing the bold reforms in HR 1.", "2018-12-28T15:12:34.000Z": "Behold! The hidden Colorado town of Iola has re-emerged from its watery grave! Drought reveals a long-submerged Colorado town GUNNISON COUNTY (AP) - The cold is just the cold. Bob Robbins and Bill Sunderlin know it all too well. durangoherald.com", "2018-12-23T15:28:38.000Z": "Odd and counterintuitive finding Low-dose radiation from A-bombs elongated lifespan and reduced cancer mortality relative to... The US National Academy of Sciences (NAS) presented the linear no-threshold hypothesis (LNT) in 1956, which indicates that the lowest doses of ionizing radiation are hazardous in proportion to the... genesenvironment.biomedcentral.com", "2018-12-21T07:35:39.000Z": "Electric vehicles can be an important component in energy management and help enable a greener, cleaner power grid How more EVs on the road can advance a renewable grid There's an alternative future on the horizon, where instead of just drawing power from the grid, electric vehicles become a mobile grid storage resource, with drivers and utilities both reaping the... pv-magazine-usa.com", "2018-12-16T19:30:51.000Z": "Colorado liberty voters can find silver linings to @jaredpolis 's victory: My latest for @ColoradoSun : Armstrong: Liberty voters can find silver linings to Jared Polis' victory As I've warned, single-party dominance of Colorado government by Democrats probably will be, on net, a bummer for Colorado's liberty voters. Yet those who advocate economic and personal freedom also... coloradosun.com", "2018-12-12T07:03:45.000Z": "The Guardians of Truth. Thank you", "2018-12-11T07:56:16.000Z": "Zombies lurking beneath the ground, dormant for millions of years... Barely living 'ZOMBIE' bacteria lurking in Deep Earth outweigh humanity by nearly 400 to one BARELY living \"zombie\" bacteria makes up a vast and secret world of life in \"Deep Earth\". According to scientists, these subterranean microbes have a carbon weight of betwee thesun.co.uk", "2018-12-07T20:25:40.000Z": "Strong piece by @SenSchumer on infrastructure investment: must reduce pollution and improve sustainability https:// washingtonpost.com/opinions/chuck -schumer-mr-president-lets-make-a-deal/2018/12/06/aeae0188-f99e-11e8-8c9a-860ce2a8148f_story.html ", "2018-12-06T12:52:37.000Z": "gotta be up pretty early to catch Colorado's Governor-elect @jaredpolis with @morningmika  #copolitics", "2018-12-04T20:16:55.000Z": "BREAKING @xcelenergy in CO w CO Gov-Elect @jaredpolis announcing bold industry-leading company wide commitment to slash carbon pollution 80% by 2030 & to eliminate all carbon pollution by 2050 across 8 midwestern & western states Clean Low Cost Reliable #CleanAir4Kids", "2018-12-02T22:31:25.000Z": "Happy Hanukkah!\nFirst night begins at sundown GIF", "2018-12-01T05:10:22.000Z": "Today we mourn the passing of President George H. W. Bush (President 1989-1993) WWII veteran, Ambasaddor to China, Vice-President, President, patriot", "2018-12-01T03:52:34.000Z": "Cow milk, goat milk, soy milk, almond milk, now... spider milk! Scientists discover spider species that feeds its young milk Spider milk containing four times the protein of cow's milk is secreted by mothers, scientists in China find theguardian.com", "2018-11-28T14:08:25.000Z": "Honored to complete 9 years of service on Board of Visitors for @AF_Academy w my final mtg today \nGo Falcons!", "2018-11-26T06:35:55.000Z": "We must do what we can to reverse this troubling trend with net netrality, open source, we are all freer when each part of the internet is freer Internet freedom continues to decline around the world, a new report says Governments are reining in liberty for the eighth consecutive year, Freedom House reports theverge.com", "2018-11-22T17:37:41.000Z": "In 1939, Colorado and Texas had two Thanksgivings: Nov 23rd and Nov 30th! The Real Reason Why Thanksgiving Is Always on a Thursday Thanksgiving holidays used to happen throughout the year time.com", "2018-11-22T16:01:23.000Z": "Behold the mole rat! Can live indefinitely w less than one quarter normal atmospheric oxygen and suspend themselves and survive zero oxygen for periods of time. Also only known eusocial (queen and colony) mammal. Warning: Do NOT get into a breath-holding contest with a naked mole rat Naked mole rats thrive in environments that would leave humans gasping for breath. popsci.com", "2018-11-22T05:24:01.000Z": "Todd Helton deserves to be in the Hall of Fame. @Rockies Helton hit .316 career w 369 homers, 1,406 RBIs and 1,401 runs, 3-time Gold Glove. The stats speak for themselves.", "2018-11-19T21:31:49.000Z": "Dreamers are just like you & me. They too have hopes and dreams, except many of them also live with constant fear, not knowing if they'll be deported to a country they don't know with a language they may not even speak. As DACA hangs in the balance, meet the Colorado Dreamers who are gripped by hope and fear A federal appeals court last week blocked the Trump administration from ending the Deferred Action for Childhood Arrivals program, which provides protection from deportation for approximately 17,00 denverpost.com", "2018-11-18T23:47:03.000Z": "Completed new governors training! Now In January when I take office, I get to begin as a level 2 Governor w basic equipment pack! Jared Polis, other new governors attend 'boot camp' in Colorado Springs Several of the nation's newly elected governors, including Colorado's Jared Polis, were gathered over the weekend at The Broadmoor hotel in Colorado Springs at a National Governors Association... gazette.com", "2018-11-15T19:12:24.000Z": "The Congressional Jared Caucus will remain at two members @JaredHuffman  @golden4congress even with my departure from Congress Jared Golden wins in nation's first federal race decided by ranked-choice voting Jared Golden wins in nation's first federal race decided by ranked-choice voting newscentermaine.com", "2018-11-14T21:16:43.000Z": "Governor @jaredpolis is in the Springs today visiting the Colorado Springs School for the Deaf and the Blind. He got a tour of the campus and even spoke with some students.", "2018-11-13T20:47:51.000Z": "Techstars Co-Founder Jared Polis is Colorado's Next Governor - https:// buff.ly/2T8AXvr - @techstars  @jaredpolis", "2018-11-13T06:26:03.000Z": "Solar panels and grazing can go together like macaroni and cheese Solar panels increase grasses for sheep and cows by 90% Researchers have determined that an Oregon solar facility altered the microclimate variables of mean air temperature, relative humidity, wind speed, wind direction, and soil moisture beneath itself... pv-magazine-usa.com", "2018-11-12T01:47:26.000Z": "\"I'm afraid. I'm afraid, Dave. Dave, my mind is going...\" we fondly remember Douglas Rain giving voice to HAL https:// comicbook.com/movies/amp/201 8/11/12/douglas-rain-dies-hal-9000-2001-a-space-odyssey/ ", "2018-11-11T05:26:07.000Z": "I was just featured on SNL... #bucketlist", "2018-11-10T14:06:00.000Z": "ICYMI: \"Is it just me or is Colorado becoming the coolest floor in America's dormitory?\" - @JKCorden", "2018-11-09T19:55:10.000Z": "I'm excited to announce Boldly Forward Colorado, our transition committee for the Polis-Primavera administration. There's a lot of work to be done in the next 60 days and we need your help to turn our bold solutions into real results: http:// BoldlyForward.co", "2018-11-06T19:30:32.000Z": "Juan had never voted in an election before. But he says this one is different. Too important not to vote.", "2018-11-06T03:22:26.000Z": "Thank you Colorado! One more day!", "2018-11-05T18:27:51.000Z": "Happy #NationalDonutDay ! Donut forget to V TE by tomorrow at 7pm!", "2018-11-05T15:58:47.000Z": "Please don't \"D'oh!\" this election. Vote today or tomorrow. Find your location here: http:// PolisforColorado.com/voting GIF", "2018-11-05T00:49:10.000Z": "It's time to come together and move Colorado forward. \n\nThe future starts now. \n\nVote  #COforAll  #COpolitics  #COgov", "2018-11-04T02:32:00.000Z": "Sunday we fall back Tuesday we move forward Vote", "2018-11-03T16:31:30.000Z": "Thank you Adams County! We only have days to:\nBuild an economy that works for everyone Provide universal pre-k & kindergarten for every community Ensure high-quality, affordable health care for every family Protect our public lands  #COforAll  #COpolitics", "2018-11-02T22:43:34.000Z": "Great turnout at Colorado Springs for the #COforAll tour. This is how we win the election on the doors, on the phones, talking to our friends and neighbors.\n\nLet's keep it up, days!", "2018-11-02T21:30:48.000Z": "Will llamas cure the common cold? Nasal gene spray inspired by llama antibodies could prevent all types of flu Unusual strategy for mutable virus might outdo traditional vaccines sciencemag.org", "2018-11-02T20:46:18.000Z": "The kilogram will soon be changing forever. Instead of being based on a piece of platinum and iridium locked away in Paris, the new kilogram will be based on derivation of a fundamental constant Redefining the Kilogram Officials will vote to overhaul the SI system of measurements, basing units such as the kilogram not on physical objects but on fundamental constants scientificamerican.com", "2018-11-02T18:27:18.000Z": "I've known Phil Weiser for many years and he will make a terrific Attorney General. To protect our rights, vote Phil Weiser! Quote Tweet Team Phil @ @PhilForColorado Watch and share Colorado AG candidate Phil Weiser's new ad, \"Whiteboard.\" It reflects his campaign journey--one that took him to all 64 counties--listening to  fellow Coloradans about the rights you want him to protect as your next AG. Vote by November 6. #Phil4CO", "2018-11-02T13:30:00.000Z": "This election is won on early mornings and late evenings through rain, shine, and snow. \n\nPerson by person, door by door, vote by vote. \n\nThank you for making this possible! Let's move Colorado forward. \n\nEvery. Vote. Counts. https:// coloradodems.org/colorado-democ rats-knock-on-one-millionth-door/   #COpolitics  #COgov GIF"}