{"2020-07-30T14:55:19.000Z": "Great morning at @NASAKennedy for the launch of the @NASAPersevere ! \n\nMoments like this serve as a reminder that no matter what challenges we face, by working together, we will persevere.", "2020-07-30T14:12:28.000Z": "WATCH LIVE: Roundtable with aerospace industry leaders at @SpaceFlorida in Merritt Island WATCH LIVE: Gov. DeSantis hosts aerospace roundtable WATCH LIVE: Gov. Ron DeSantis is hosting a roundtable with aerospace officials from Merritt Island | Read: https://at.wftv.com/2Pb48gw facebook.com", "2020-07-30T13:25:03.000Z": "Today I'm holding a roundtable with aerospace industry leaders at @SpaceFlorida in Merritt Island. Tune in at 10:00AM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-30T12:15:54.000Z": "Our goal is to ensure that not only our parents and students, but also our teachers, have the choice between in-person and distancing learning. We are thankful for our hardworking school superintendents and personnel for their continued efforts.", "2020-07-29T23:11:22.000Z": "Thank you, Joy, for sharing your story with us today. Parents should have the choice between in-person and distance learning this upcoming school year.", "2020-07-29T22:31:40.000Z": "We must empower parents with a choice this upcoming school year. I enjoyed meeting with parents and educators in Clearwater today to discuss how we can provide families with options at the local level so our kids can succeed.", "2020-07-29T16:56:36.000Z": "WATCH LIVE: Education Roundtable in Clearwater DeSantis in Clearwater DESANTIS IN CLEARWATER: Gov. Ron DeSantis is at Paul B. Stephens School in Clearwater for an update on Florida schools reopening during the pandemic.... facebook.com", "2020-07-29T13:58:34.000Z": "Thank you to the brave men and women of @OCFireRescue and all of Florida's first responders who are working day and night to combat #COVID19 and keep our communities safe. We appreciate your sacrifice and service to our state. Quote Tweet OCFire Rescue @OCFireRescue . @GovRonDeSantis made an unexpected stop today at OCFRD Headquarters where he took the opportunity to thank emergency management personnel and first responders of @OrangeCoFL . The team is now monitoring the tropics, while still combating COVID-19.", "2020-07-29T13:08:07.000Z": "We are closely monitoring a tropical system with @FLSERT . Forecasts are predicting heavy rainfall and strong winds will impact Florida beginning Saturday through early next week. Floridians should prepare now by having at least 7 days of disaster supplies.", "2020-07-28T00:21:40.000Z": "Last week we secured over 10k more vials of Remdesivir to help treat #COVID19 patients. This is in addition to our week 3 allocation of 20k vials. Florida will have received more than 81k vials this month as we continue to provide this critical treatment to our hospitals.", "2020-07-27T23:56:02.000Z": "It was great having Vice President @Mike_Pence and others in Florida today at @UMiamiMedicine to discuss the latest progress on a #COVID19 vaccine and the efforts the @RealDonaldTrump Administration is taking to ensure that our state has everything we need. Thank you @VP ! Quote Tweet Mike Pence @Mike_Pence Thank you to @GovRonDeSantis , @LtGovNunez , @MarioDB , Dean Ford, and the whole team at @umiamimedicine for making it possible for us to meet this moment as we work at Operation Warp Speed to have a vaccine as soon as it is safely possible to have for the American people.", "2020-07-27T14:02:30.000Z": "Thank you to the @FLSheriffs Association for having me this morning at their annual summer conference. Our law enforcement officers put themselves in harm's way every day to protect our communities and I am proud to stand alongside them during these especially trying times.", "2020-07-24T23:43:42.000Z": "Lowering the exorbitant cost of prescription drugs has been one of my top priorities since taking office as Governor. Thank you, President @RealDonaldTrump for signing this historic executive order and @RepJoseOliva for working with us at the state level to get this done.", "2020-07-24T23:27:52.000Z": "I'm pleased to recognize the 30th anniversary of the Americans with Disabilities Act. Florida is proud to be an accommodating state & I'm happy to report that $1.5 billion was funded in this year's state budget for @FloridaAPD - the highest amount ever budgeted for the agency. Quote Tweet Florida Agency for Persons with Disabilities @FloridaAPD Thank you @GovRonDeSantis for joining us today for the #ADA30FL Virtual Celebration!! Thank you for all you do to support Floridians with disabilities. https:// youtube.com/watch?v=DqwNpK MFoLw&feature=youtu.be ", "2020-07-24T16:25:55.000Z": "I am urging Florida's school superintendents to ensure parents have the choice between in-person & distance learning for their kids. Many school districts need a few extra weeks to safely re-open & they may do so. Find contact info for your district here - Superintendents Moving to Florida Home | School Superintendents | Map of Florida Districts Superintendents of Florida s public school districts are listed below with their ph. fldoe.org", "2020-07-24T14:00:47.000Z": "I'm pleased to announce that Florida has secured nearly an additional 11,000 vials of Remdesivir treatment to be sent to Florida hospitals. With this new shipment, we have provided more than 60,000 vials of Remdesivir to hospitals over the past few weeks.", "2020-07-23T20:56:02.000Z": "The mental health and well-being of all Floridians during the #COVID19 pandemic needs to be a robust part of the conversation. @GovRonDeSantis & I continue with our work to ensure that our kids and families have the support they need during these challenging times.", "2020-07-23T16:28:04.000Z": "WATCH LIVE: COVID-19 press conference in Melbourne Ron DeSantis @GovRonDeSantis WATCH LIVE: COVID-19 press conference in Melbourne pscp.tv", "2020-07-23T15:54:51.000Z": "Today I'm holding a #COVID19 press conference in Melbourne. Tune in at 12:30PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-23T14:33:26.000Z": "I believe we owe every Florida parent a CHOICE to send your child back to school for in-person instruction, or to opt to maintain distance learning. We support you and want you to feel safe.", "2020-07-23T11:58:29.000Z": "This morning I'll be joining @foxandfriends at 8:35 AM ET. Tune in!", "2020-07-22T22:56:43.000Z": "Congratulations @UF on this major accomplishment! Florida's nationally-ranked university system boasts of some of the most talented and innovative minds in the world. Quote Tweet FLORIDA @UF University of Florida. Home to higher education's most powerful #AI supercomputer.", "2020-07-22T21:00:02.000Z": "WATCH LIVE: Address to Floridians Regarding the Upcoming School Year Gov. DeSantis addresses start of school year: July 22, 2020 Governor Ron DeSantis is holding an address regarding the beginning of the 2020 school year in Florida. facebook.com", "2020-07-22T19:53:07.000Z": "Today I will be providing a live address to Floridians regarding the upcoming school year. Tune in at 5PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-22T12:12:28.000Z": "In March, I directed @HealthyFla to send Incident Management Teams to all FL long-term care facilities to check on infection control, screening procedures & PPE supply. We are now deploying these teams for a 2nd statewide mission. Protecting the vulnerable remains a priority.", "2020-07-21T22:41:29.000Z": "COVID-exclusive facilities are relieving pressure on both long-term care facilities & hospitals. Florida now has 20 of these facilities operational with 5 more pending. Ultimately, this will amount to nearly 1,700 beds.", "2020-07-21T22:41:28.000Z": "Early on during the pandemic, Florida led the charge to prohibit the discharge of #COVID19 positive patients back to their residence in long-term care facilities & @AHCA_FL established COVID-exclusive nursing homes to care for these patients.", "2020-07-21T21:32:16.000Z": "We continue to monitor hospital bed availability & Florida is in good shape - statewide nearly 24% of hospital beds and just under 20% of ICU beds are available.", "2020-07-21T20:05:17.000Z": "Florida continues to work with hospitals across the state. Over the past two weeks alone, my administration has helped hospitals secure 50k vials of critical Remdesivir treatment & we are encouraging Floridians who have recovered from #COVID19 to donate convalescent plasma.", "2020-07-21T19:48:16.000Z": "Today I was joined by physicians & health care leaders representing 70% of hospitals in Florida who have great insight into what is actually happening on the front lines of #COVID19 . Due to unprecedented collaboration during the pandemic, our hospital system remains strong.", "2020-07-21T16:05:37.000Z": "WATCH LIVE: COVID-19 roundtable in Tallahassee Ron DeSantis @GovRonDeSantis WATCH LIVE: COVID-19 roundtable in Tallahassee pscp.tv", "2020-07-21T15:25:46.000Z": "Today I'm holding a #COVID19 roundtable in Tallahassee. Tune in at 12PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-20T21:44:09.000Z": "I recently addressed the State Board of Education. I believe that we need to empower parents to make the best choice for their kids this upcoming school year. I'm confident we will get through this.", "2020-07-20T20:47:51.000Z": "Florida is working with @my1blood to encourage Floridians who have recovered from #COVID19 to consider donating life-saving convalescent plasma. People who have recovered from the virus have antibodies that can help patients still fighting the virus.", "2020-07-20T20:47:50.000Z": "Enjoyed stopping by @my1blood in Orlando today. These folks are working very hard to help ensure #COVID19 positive patients have access to convalescent plasma therapy, one of the most effective treatments currently available for the virus. Learn more - http:// oneblood.org", "2020-07-20T16:15:00.000Z": "WATCH LIVE: Press Conference regarding COVID-19 at OneBlood Headquarters in Orlando Ron DeSantis @GovRonDeSantis WATCH LIVE: Press Conference regarding COVID-19 at OneBlood Headquarters in Orlando pscp.tv", "2020-07-20T15:52:47.000Z": "Today I'm holding a press conference in Orlando @my1blood regarding #COVID19 . Tune in at 12:15PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-20T12:49:38.000Z": "In the last two weeks, my administration has helped secure & distribute nearly 50,000 vials of highly sought-after Remdesivir to hospitals caring for patients undergoing treatment for #COVID19 .", "2020-07-18T23:06:29.000Z": "Our state and nation mourn the loss of Congressman John Lewis, a civil rights icon whom I was honored to serve alongside in Congress. @FLCaseyDeSantis and I are keeping his family in our thoughts and prayers.", "2020-07-18T16:45:05.000Z": "WATCH LIVE: Press conference in St. Augustine regarding #COVID19 LIVE NOW: Governor DeSantis news conference WATCH LIVE: Governor DeSantis is holding a news conference on COVID-19 at a hospital in St. Augustine. He is expected to start speaking at 12:30 p.m. facebook.com", "2020-07-18T15:18:02.000Z": "Today I'm holding a press conference in St. Augustine regarding #COVID19 . Tune in at 12:30PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-17T21:03:09.000Z": "I understand that the #COVID19 pandemic has caused profound disruption in the lives of many Floridians, but with this commitment to support affordable housing, we hope to offer some measure of relief.", "2020-07-17T21:03:08.000Z": "Through no fault of their own, hundreds of thousands of Floridians are having difficulty making ends meet. I'm pleased to announce that @Florida_Housing has approved $75 million to distribute to counties for rental and mortgage assistance. Info here - https:// bit.ly/3fAdLRA", "2020-07-17T18:01:30.000Z": "WATCH LIVE: Major announcement in Apopka WFLA Now: DeSantis 'Major' Announcement from Central Florida... DESANTIS ANNOUNCEMENT: Florida Governor Ron DeSantis is appearing for a \"major\" announcement at an apartment complex in Apopka, which is outside of... facebook.com", "2020-07-17T17:38:48.000Z": "Today I'm making a major announcement in Apopka at 2PM. Tune in to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-16T16:46:56.000Z": "WATCH LIVE: Roundtable regarding mental health and #COVID19 with @FLCaseyDeSantis in Tampa @CrisisCenterTB LIVE NOW: Governor DeSantis roundtable discussion WATCH LIVE: Governor DeSantis is holding a roundtable discussion with First Lady Casey DeSantis and DCF in Tampa about mental health & COVID-19 facebook.com", "2020-07-16T15:39:40.000Z": "Today, @FLCaseyDeSantis and I are holding a roundtable regarding mental health and #COVID19 in Tampa at 12:30PM. Tune in to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-16T12:04:26.000Z": "Getting through this pandemic requires unity of purpose. I appreciate the hard work of Miami-Dade's mayors and I'm 100% confident we are going to get through this.", "2020-07-15T21:00:33.000Z": "WATCH LIVE: Press conference regarding #COVID19 Ron DeSantis @GovRonDeSantis WATCH LIVE: Press conference regarding #COVID19 pscp.tv", "2020-07-15T13:03:16.000Z": "WATCH LIVE: Remarks at State Board of Education meeting in Hillsborough County The Florida Channel - Connecting Florida thefloridachannel.org", "2020-07-14T17:34:38.000Z": "WATCH LIVE: Roundtable with Miami-Dade County Mayors LIVE NOW: Governor DeSantis roundtable discussion WATCH LIVE: Governor DeSantis holds a roundtable discussion regarding COVID-19 with Miami-Dade County mayors facebook.com", "2020-07-14T16:35:49.000Z": "Today I am holding a #COVID19 roundtable with Miami-Dade County Mayors at 1PM. Tune in to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-14T12:17:06.000Z": "We must all continue to do our part to protect Florida's most vulnerable and avoid the 3 Cs: closed spaces, crowded places and close-contact settings. Safeguarding the elderly and those with underlying health conditions will continue to be our top priority.", "2020-07-13T21:17:52.000Z": "WATCH LIVE: Press conference regarding #COVID19 in Miami LIVE NOW: Governor DeSantis conference in Miami WATCH LIVE: Governor Ron DeSantis is holding a news conference about COVID-19 in Miami facebook.com", "2020-07-13T20:01:23.000Z": "Today I am holding a press conference regarding #COVID19 in Miami at 5PM. Tune in to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-13T18:28:06.000Z": "Great context from Dr. Charles Lockwood, Senior Vice President of @USFHealth", "2020-07-11T16:57:40.000Z": "WATCH LIVE: Press conference regarding #COVID19 in Bradenton Gov. Ron DeSantis provides an update on the coronavirus pandemic in... Gov. Ron DeSantis provides an update on the coronavirus pandemic in Florida. facebook.com", "2020-07-11T14:30:05.000Z": "Today I am holding a press conference regarding #COVID19 in Bradenton at 12:45PM. Tune in to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-10T19:06:19.000Z": "I'm pleased to announce more than $8.6 million to build 74 fast electric charging stations along our state's major highways and evacuation routes as part of the $166 million Florida received from the Volkswagen Settlement.", "2020-07-10T16:46:33.000Z": "WATCH LIVE: Major Announcement at Turkey Lake Service Plaza in Orlando WATCH LIVE: Gov. DeSantis makes major announcement WATCH LIVE: Gov. DeSantis is about to speak in Orlando as he unveils a brand new Tesla charging station. Read: https://at.wftv.com/3iRafo4 facebook.com", "2020-07-10T16:08:04.000Z": "Today I am making a major announcement at Turkey Lake Service Plaza in Orlando at 12:45PM. Tune in to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-09T18:31:50.000Z": "WATCH LIVE: Press conference with U.S. Secretary of Labor Eugene Scalia in Jacksonville WATCH LIVE: Gov. Ron DeSantis speaks from Jacksonville with Labor... Gov. Ron DeSantis speaks from Jacksonville with Labor Secretary Eugene Scalia. Florida crosses 4,000 deaths: https://bit.ly/31XCiw5 facebook.com", "2020-07-09T18:18:28.000Z": "Today I am joining @SecGeneScalia for a press conference in Jacksonville. Tune in at 2:30PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-08T19:13:24.000Z": "I have directed the state to send 100 nurses to support @JacksonHealth as they continue to care for COVID-positive patients. I am committed to supporting our hard-working health care workers and physicians across the state and thank them for their ongoing efforts.", "2020-07-08T15:43:21.000Z": "Enjoyed discussing Florida's efforts to protect our most vulnerable in long-term care facilities and the elderly with @SeanHannity .", "2020-07-08T15:06:12.000Z": ". @FLCaseyDeSantis & I mourn the loss of Wayne Mixson, a WWII veteran who served as Lt. Governor and Governor of Florida & was appointed U.S. Ambassador under President Jimmy Carter. We extend our condolences to his family as our state and country celebrate his legacy.", "2020-07-07T16:37:33.000Z": "WATCH LIVE: Press conference regarding regarding COVID-19 in Miami https:// facebook.com/watch/live/?v= 756346328515122&ref=search ", "2020-07-07T15:38:13.000Z": "Today I am holding a press conference in Miami regarding #COVID19 . Tune in at 12:30PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-07T12:11:56.000Z": "I urge all Floridians to continue social distancing to help protect our state's most vulnerable and slow the spread of #COVID19 . Avoid the \"Three Cs\" and high-risk environments. Wearing a facial covering when you can't social distance may also help reduce transmission.", "2020-07-07T12:07:46.000Z": "Our #1 priority during #COVID19 has been to protect the vulnerable. Since early March, we have taken swift action to protect residents of LTC facilities and issued guidance to those 65+ & individuals with underlying conditions.", "2020-07-06T23:24:52.000Z": "Since the beginning of the pandemic, Florida has prohibited COVID-positive patients from being readmitted to LTC facilities. Since April, our state has established 12 COVID-dedicated nursing facilities, where COVID-positive LTC patients can safely recuperate.", "2020-07-06T22:56:45.000Z": "Hospitals are safe and Floridians in need of treatment shouldn't avoid seeking care. At the beginning of pandemic, people were fearful of going to the hospital and didn't seek treatment for other life-threatening conditions.", "2020-07-06T22:40:37.000Z": "Recent CDC seroprevalance study shows that #COVID19 was likely far more widespread than we thought at the beginning of March. The virus has been around for quite some time. \n\nThe good news? We have far more information now than we did previously about the virus & how to treat it.", "2020-07-06T22:23:48.000Z": "Florida's case fatality rate is 1.9%, which is much lower than other large states.", "2020-07-06T22:08:25.000Z": "At the beginning of the #COVID19 pandemic, many of the cases were over the age of 60. In recent weeks, the upswing of new positive cases has been driven by people in their 20s and 30s. \n\nAge with the most cases", "2020-07-06T22:06:20.000Z": "Florida has tested over 2.2 million people since the beginning of #COVID19 , which is 10% of our state's population. The week of 6/29 alone, Florida tested nearly 400,000 people.", "2020-07-06T16:46:11.000Z": "WATCH LIVE: Press conference regarding #COVID19 at UF Health The Villages WATCH: Gov. DeSantis provides COVID-19 update WATCH LIVE: Gov. Ron DeSantis is set to provide an update on the COVID-19 cases within the state. Read: https://at.wftv.com/3f2ExSw facebook.com", "2020-07-06T15:41:34.000Z": "Today I am holding a press conference at UF Health The Villages Hospital regarding #COVID19 . Tune in at 12PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-04T13:28:20.000Z": "The Declaration of Independence boldly asserted that individual rights are bestowed by God & \"that all men are created equal.\" Independence Day constitutes a seminal moment in human history & should be celebrated and honored. \n\nWishing all Floridians a happy & safe #July4th !", "2020-07-03T13:03:16.000Z": "Avoid the 3 Cs and make sure you wear a mask to help protect the most vulnerable this 4th.", "2020-07-02T19:42:54.000Z": "WATCH LIVE: Press conference in Tampa with @VP Mike Pence Pence and DeSantis in Tampa VP IN TAMPA: Vice President Mike Pence and Gov. Ron DeSantis are at USF to discuss Florida's response to the pandemic. LATEST: https://bit.ly/2VImERj facebook.com", "2020-07-02T16:31:00.000Z": "Feeling sick? Sit this 4th out to help protect the most vulnerable and stop the spread of COVID-19.", "2020-07-02T16:30:17.000Z": "For years, attempts to pass E-Verify have failed - until now. Assuring a legal workforce is good for the rule of law, protects taxpayers & places an upward pressure on wages. Thanks @TomLeeFL & @CordByrd for getting SB 664 over the finish line.", "2020-07-02T16:11:09.000Z": "Great pro-life effort by Sen. @kellistargel and Rep. @ErinGrall on SB 404, which requires minors to receive parental consent before having an abortion. Thank you for your work on behalf of Florida families.", "2020-07-02T15:33:59.000Z": "Floridians shouldn't need a permission slip from the government in order to earn a living. Proud to have signed \"The Occupational Freedom & Opportunity Act\" which eliminates barriers of entry to certain professions licensed by @FloridaDBPR . TY @GovGoneWild & Senator Albritton.", "2020-07-02T15:04:16.000Z": "I was proud to sign #AlyssasLaw , which will require teachers & staff to have mobile apps that silently alert law enforcement to emergencies on school campuses. Thank you @lorialhadeff for your tireless efforts to help prevent future tragedies in honor of your daughter's memory.", "2020-07-01T17:53:48.000Z": "Help protect the most vulnerable this 4th by wearing a mask as well as avoiding crowds and crowded spaces.", "2020-07-02T11:33:24.000Z": "With the signing of HB 1391, Florida welcomes #FinTech companies that disrupt the status quo & gives them an opportunity to provide new types of products & services. TY @JamesGrantFL for supporting entrepreneurship & innovation as we move forward with FL's economic recovery.", "2020-07-01T20:56:29.000Z": "Thank you, Representative Bush, for all your efforts on behalf of our great state and for helping us secure an increase of $18.9 million for Florida's HBCUs, including your alma mater @bethunecookman . God Bless!", "2020-07-01T19:37:56.000Z": "Madison had a great time meeting some of @LoggerheadMC 's turtle patients in Juno Beach! Thanks to the dedicated staff for their continued efforts to promote conservation of our ocean ecosystems and protect our natural resources for future generations.", "2020-07-01T18:17:59.000Z": "WATCH LIVE: Press conference at Bethune-Cookman University Ron DeSantis @GovRonDeSantis WATCH LIVE: Press conference at Bethune-Cookman University pscp.tv", "2020-07-01T17:31:01.000Z": "Today I am holding a press conference @bethunecookman in Daytona Beach. Tune in at 2PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-07-01T17:10:42.000Z": "I was proud to sign HB 1091, which increases fines for sanitary sewer overflows by 100% and all other environmental fines by 50% across the board. These penalties will serve as a deterrent against bad actors. Great work by @VoteRandyFine & @JoeGruters .", "2020-07-01T16:10:26.000Z": "Florida has taken another historic step in the fight to protect water quality & conserve our state's natural resources. I was proud to sign SB 712 \"The Clean Waterways Act\" sponsored by @debbie_mayfield & @bobbypaynefl . Thanks to Madison for the assist!", "2020-07-01T15:32:19.000Z": "Madison and I were honored to join @GovRonDeSantis & Representative @Mel_Ponder for the signing of the @MyFLFamilies Accountability Act.", "2020-06-30T18:13:11.000Z": "WATCH LIVE: Governor Ron DeSantis Makes a Major Announcement in Juno Beach Ron DeSantis @GovRonDeSantis WATCH LIVE: Governor Ron DeSantis Makes a Major Announcement in Juno Beach pscp.tv", "2020-06-30T17:54:04.000Z": "Today I am making a major announcement in Juno Beach. Tune in at 2PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-06-29T23:07:24.000Z": "As we move forward with our #SafeSmartStepbyStep Plan for Florida's Recovery, I am confident we will overcome the adversities before us and emerge stronger than before. For more information on the Fiscal Year 2020-21 Budget, click here - https:// bit.ly/2NE9L6h .", "2020-06-29T23:07:23.000Z": "Despite the #COVID19 pandemic, Florida continues to maintain strong reserves in the 2020-21 budget, totaling $6.3 billion. This includes the $1 billion in vetoes as well as reversions of $781 million from FY 2019-20.", "2020-06-29T23:05:20.000Z": "The budget includes $6M to make FL's correctional facilities safer, including $3M for security equipment. It also provides important funding for pay increases for correctional officers.", "2020-06-29T23:05:19.000Z": "Florida's budget continues to make necessary investments in public safety. The budget includes $2.3M to implement the first Statewide Behavioral Threat Assessment strategy in the country and more than $8.1M to expand and enhance Florida's crime databases.", "2020-06-29T23:03:28.000Z": "The health and well-being of all Floridians is paramount. The state budget provides $117.6M in funding for children & families who receive services through FL's child welfare system, including $53M for major reforms to enhance accountability.", "2020-06-29T23:02:14.000Z": "We are mindful that 2020 is an election year and the budget provides $10 million for state-level election oversight activities, with a focus on cybersecurity enhancements to Florida's election system.", "2020-06-29T23:01:07.000Z": "Florida's 2020-21 budget includes $1.3 billion in federal and state funding for communities to respond to, recover from, and mitigate against major disasters or emergencies.", "2020-06-29T23:00:07.000Z": "Despite #COVID19 , we remain focused on investing in FL's transportation infrastructure: $9.2B for the State Transportation Work Program $2.5B for highway construction $400.5M for aviation improvements $885.5M for rail/transit projects $236.4M for safety initiatives", "2020-06-29T22:58:51.000Z": "The 2020-21 budget includes: More than $322M for Everglades restoration $50M for springs restoration $160M for targeted water quality improvements $40M for alternative water supply $25M to combat harmful algal blooms & red tide $100M for Florida Forever", "2020-06-29T22:58:00.000Z": "With this budget, we are more than halfway to our goal of securing $2.5 billion for Florida's environment. For the second fiscal year in a row, we have secured more than $625 million for Everglades restoration & the protection of water resources.", "2020-06-29T22:55:48.000Z": "I am proud that Florida's FY 2020-21 budget provides an increase of $18.9 million for Florida's Historically Black Colleges and Universities.", "2020-06-29T22:53:50.000Z": "To continue building on the success of Florida's higher education system, the budget includes historic state operating funding for the Florida College System and State University System at $1.3 billion and $2.7 billion respectively. It does not include any tuition increases.", "2020-06-29T22:52:46.000Z": "Florida's K-12 education budget for the upcoming fiscal year includes record per student funding of $7,793, an increase of current year spending by $137 per student.", "2020-06-29T22:51:53.000Z": "Last year I vowed to make 2020 the \"Year of the Teacher\" and I'm proud to follow through on that promise. The budget includes $500M to raise the minimum K-12 teacher salary into the nation's Top 5 & increase salaries for veteran teachers & other eligible personnel.", "2020-06-29T22:50:06.000Z": "Today I signed Florida's state budget for Fiscal Year 2020-21. As Governor, I must ensure our state remains on a strong fiscal foundation during #COVID19 .", "2020-06-29T17:05:41.000Z": "WATCH LIVE: Press conference regarding the state budget Ron DeSantis @GovRonDeSantis WATCH LIVE: Press conference regarding the state budget pscp.tv", "2020-06-29T16:34:26.000Z": "Today I am holding a press conference in Tallahassee regarding the state budget. Tune in at 1PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-06-28T18:47:56.000Z": "WATCH LIVE: Press Conference Regarding #COVID19 in Pensacola Ron DeSantis @GovRonDeSantis WATCH LIVE: Press Conference Regarding #COVID19 in Pensacola pscp.tv", "2020-06-28T17:53:55.000Z": "Today I am holding a press conference regarding #COVID19 in Pensacola. Tune in at 1:30PM Central Time (2:30PM Eastern Time) to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-06-27T16:56:57.000Z": "I was proud to sign HB 1213, which directs public schools to teach about anti-Semitism during Holocaust instruction & directs @EducationFL 's African American History Task Force to explore lessons on the Ocoee Election Day Massacre.", "2020-06-27T16:34:45.000Z": "I'm pleased to announce that $250 million in CARES Act funding for rental and mortgage assistance will go to Florida families that have been negatively impacted by the #COVID19 pandemic. More info here - https:// bit.ly/2YwuRd6 Quote Tweet Florida Housing FC @Florida_Housing Today, @GovRonDeSantis announced that Florida Housing will be the recipient of $250 million from the CARES Act relief fund. This assistance will help provide housing assistance & resources for those who have been impacted by the pandemic. For more, visit: https:// bit.ly/2B0hFnX", "2020-06-27T14:01:16.000Z": "I was proud to sign HB 7067 which increases the ability for more families to choose the educational program that best suits their child. Thanks to @SenMannyDiazJr and @voteforjennifer for their hard work on this bill. More here - https:// bit.ly/3dCqJMO  #SchoolChoice", "2020-06-26T22:45:50.000Z": "Great work being done by the folks @Lee_Health and CEO Dr. Larry Antonucci.", "2020-06-26T22:21:43.000Z": "Thanks, Dr. Stovall, for your insight.", "2020-06-26T21:41:23.000Z": "I want to wish my beautiful wife @FLCaseyDeSantis a very Happy Birthday! She is an amazing mother to our three kids Madison, Mason and Mamie and her leadership on mental health continues to make a difference in the lives of Floridians.", "2020-06-26T20:28:21.000Z": "In case you missed it... today I held a press conference regarding #COVID19 in Fort Myers @Lee_Health . Quote Tweet Lee Health @Lee_Health WATCH LIVE: Governor Ron DeSantis ( @RonDeSantisFL ) at Gulf Coast Medical Center. https:// facebook.com/LeeHealth/vide os/1432282690295319/?vh=e&d=n ", "2020-06-26T17:09:46.000Z": "Today I am holding a press conference regarding #COVID19 in Fort Myers. Tune in at 2PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-06-25T21:06:46.000Z": "No, thank you, Chikara, for all of your hard work. May God Bless you and your family.", "2020-06-25T19:06:01.000Z": "WATCH LIVE: Governor Ron DeSantis Makes a Major Announcement in Tampa Ron DeSantis @GovRonDeSantis WATCH LIVE: Governor Ron DeSantis Makes a Major Announcement in Tampa pscp.tv", "2020-06-25T18:32:34.000Z": "Today I am making a major announcement in Tampa. Tune in at 3PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-06-24T21:53:24.000Z": "Today, I signed HB 641 and announced the approval of $500 million dedicated to raising teacher salaries in Florida. This historic initiative puts Florida among the top five states in the nation for minimum teacher pay. See more here - https:// bit.ly/3exCEN8", "2020-06-24T18:30:10.000Z": "Make sure to remember the Three Cs. Following these rules along with wearing a mask, disinfecting surfaces and washing your hands can help prevent the spread of #COVID19 . Visit https:// floridahealthcovid19.gov/prevention/ for more tips.", "2020-06-24T19:00:16.000Z": "WATCH LIVE: Governor Ron DeSantis Makes a Major Announcement in Hialeah Gardens Ron DeSantis @GovRonDeSantis WATCH LIVE: Governor Ron DeSantis Makes a Major Announcement in Hialeah Gardens pscp.tv", "2020-06-24T17:54:34.000Z": "Today I am making a major announcement in Hialeah Gardens. Tune in at 2:30PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-06-23T16:25:02.000Z": "WATCH LIVE: Governor Ron DeSantis Holds Press Conference in Orlando Ron DeSantis @GovRonDeSantis WATCH LIVE: Governor Ron DeSantis Holds Press Conference in Orlando pscp.tv", "2020-06-23T15:52:25.000Z": "Today I am holding a press conference regarding #COVID19 in Orlando. Tune in at 12:30PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-06-20T21:11:34.000Z": "This week Florida has seen a large number of new cases from those 18 to 35. More information here - https:// bit.ly/318eHYS", "2020-06-19T16:28:49.000Z": "WATCH LIVE: Press Conference Regarding #COVID19 in Miami Ron DeSantis @GovRonDeSantis WATCH LIVE: Press Conference Regarding #COVID19 in Miami pscp.tv", "2020-06-19T15:15:48.000Z": "Today I am holding a press conference regarding #COVID19 in Miami. Tune in at 12PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-06-16T21:02:34.000Z": "WATCH LIVE: Press Conference Regarding #COVID19 in Tallahassee Ron DeSantis @GovRonDeSantis WATCH LIVE: Press Conference Regarding #COVID19 in Tallahassee pscp.tv", "2020-06-16T20:13:50.000Z": "Today I am holding a press conference regarding #COVID19 in Tallahassee. Tune in at 5PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-06-14T17:09:16.000Z": "Excited to be at @HomesteadMiami today to commemorate their 25th anniversary & join them for the second consecutive day of @NASCAR races. The Speedway features a 1.5-mile oval and 2.21-mile road course & generates more than $301M annually for the region.\n\nStart your engines!", "2020-06-13T14:24:48.000Z": "This week I directed @EducationFL to provide high school seniors impacted by #COVID19 with pathways to meet eligibility requirements for the #BrightFuturesScholarship . \n\nStudents now have until July 31st to meet SAT/ACT requirements and flexibility on volunteer service hours.", "2020-06-12T21:48:03.000Z": "Florida is the most military-friendly state in the nation & I'm pleased to announce over $722,000 to support community infrastructure projects at FL military installations through the Florida Defense Support Task Force Grant Program @EnterpriseFL . Info - https:// bit.ly/2An2rJr", "2020-06-12T20:55:34.000Z": "Today I was proud to sign SB 646: Intercollegiate Athlete Compensation and Rights, which authorizes certain intercollegiate athletes to earn compensation for the use of their names, images or likenesses and was joined by @LtGovNunez  @debbie_mayfield  @ChipLaMarca & @kionnemcghee .", "2020-06-12T16:17:59.000Z": "WATCH LIVE: Major Announcement in Coral Gables Ron DeSantis @GovRonDeSantis WATCH LIVE: Major Announcement in Coral Gables pscp.tv", "2020-06-12T15:18:21.000Z": "Today I am making a major announcement in Coral Gables. Tune in at 12PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-06-12T14:04:48.000Z": "I'm pleased to announce 60 schools have been chosen to participate in the first phase of the Florida Civics and Debate Initiative (FCDI) as part of our partnership with The Marcus Foundation and @EducationFL .", "2020-06-11T23:48:54.000Z": "Enjoyed stopping by el Leoncito restaurant in Viera to help deliver the 100,000th meal of the @elderaffairs  @FloridaDBPR  @FRLAnews \"Meals of Love\" initiative, which has helped local restaurants stay open while preparing meals for homebound seniors during #COVID19 . Great work!", "2020-06-11T23:36:38.000Z": "In Florida, we're taking a #SmartSafeStepbyStep approach to re-opening and this extensive, data-driven plan will ensure Florida students, educators and families have the confidence and support needed to get students back to the classroom. Learn more - https:// bit.ly/3fh1H7f", "2020-06-11T23:36:37.000Z": "Today I was joined by Commissioner @richardcorcoran to announce recommendations for local communities to safely re-open FL schools. The plan maximizes nearly $475 million in federal CARES funding to close achievement gaps & provide safe environments for our students and teachers. Quote Tweet Florida Department of Education @EducationFL Today, @GovRonDeSantis & Comm. @RichardCorcoran announced recommendations & plans to re-open safe & healthy schools that set students up for success. This plan outlines nearly $475 million in education-related aid from the #CARESAct . https:// bit.ly/30wQU4I  @richardcorcoran", "2020-06-11T23:10:50.000Z": "I'm excited to announce that Florida will be hosting the 54th @TheRealAAU Junior Olympic Games in Brevard County at the end of July. This marks the 6th time Florida gets to host the games for the best youth athletes in the nation, which brings approx. $50M in economic impact.", "2020-06-11T16:12:12.000Z": "WATCH LIVE: Major announcement in Melbourne Ron DeSantis @GovRonDeSantis WATCH LIVE: Major announcement in Melbourne pscp.tv", "2020-06-11T15:12:58.000Z": "Florida is at the epicenter of the commercial space industry and today's announcement highlights the bright future of the Space Florida-Israel Innovation Partnership Program. Learn more - https:// bit.ly/3cPTWU9", "2020-06-11T15:12:57.000Z": "Last year I led a historic business development mission to Israel where Florida strengthened our partnership between @SpaceFlorida and the Israel Innovation Authority.\n \nA year later, I'm pleased to help announce the 7th round winners of innovation partner funding.", "2020-06-11T15:00:44.000Z": "Today I am making a major announcement in Melbourne. Tune in at 12PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-06-10T21:24:36.000Z": "I'm excited to join @myfwc to announce recreational Red Snapper Season in state and federal Gulf waters starting Thursday, June 11th. Florida is the Fishing Capital of the World & we are proud to offer this opportunity.", "2020-06-08T22:29:35.000Z": "At my direction, @FLSERT has been working to secure adequate supplies of PPE & other critical items to prepare for hurricane season, including: 10 million masks for shelters 12 million N95 masks in deal w/ @honeywell", "2020-06-08T22:29:34.000Z": "Today I joined @DHS_Wolf , @FEMA_Pete & @MayorGimenez  @MiamiDadeEM . Sheltering & evacuation protocols will look different this hurricane season due to #COVID19 . @FLSERT has used guidance from @CDCgov , @FEMA & @RedCross to create our own state guidance & provided that to counties.", "2020-06-08T18:08:20.000Z": "WATCH LIVE: Press Conference at Miami-Dade Emergency Operations Center DeSantis among officials to attend hurricane season news conference... WATCH LIVE: DeSantis among officials to attend hurricane season news conference at Miami-Dade Emergency Operations Center facebook.com", "2020-06-06T16:34:00.000Z": "Today our nation recognizes the 76th Anniversary of D-Day. May we never forget the brave soldiers who made the ultimate sacrifice in the defense of our nation's freedom. #DDay2020", "2020-06-05T19:27:25.000Z": "Beginning today, 64 Florida counties (all except Miami-Dade, Broward and Palm Beach) enter Phase 2 of our #SafeSmartStepbyStep Plan for Florida's Recovery.\n\nI will continue working with local leadership in South Florida to safely help their communities enter into Phase 2.", "2020-06-05T19:20:26.000Z": "I have spoken with Jacksonville Mayor @lennycurry regarding the cargo ship explosion at Blount Island. While there are injuries, we are thankful no lives have been lost. @FLCaseyDeSantis and I are praying for the speedy recovery of the injured firefighters and their families.", "2020-06-03T19:16:35.000Z": "I'm pleased to announce that the state of Florida will receive nearly $252 million from @FEMA to reimburse costs associated with the #COVID19 response.", "2020-06-03T17:22:32.000Z": "For more information on Phase 2 in Florida, see the full presentation here: https:// bit.ly/36UrFuq", "2020-06-03T17:22:31.000Z": "", "2020-06-03T17:22:30.000Z": "", "2020-06-03T17:22:29.000Z": "", "2020-06-03T16:59:52.000Z": "I'm pleased to announce that the Original Phase 1 Florida counties (all except Miami-Dade, Broward and Palm Beach) may enter Phase 2 effective Friday, June 5, 2020.", "2020-06-03T16:55:18.000Z": "Effective May 18th, all Florida counties were permitted to enter Full Phase 1 of the #SafeSmartStepbyStep Plan for Florida's Recovery.", "2020-06-03T16:31:54.000Z": "In Florida, statewide #COVID19 positive ICU hospitalizations and COVID-positive patients on ventilators continue to decrease.", "2020-06-03T16:25:28.000Z": "In Florida, we have deployed antibody testing for first responders.", "2020-06-03T16:25:27.000Z": "More than 44,629 tests have been conducted to-date at our 17 state-supported walk-up testing sites.", "2020-06-03T16:20:08.000Z": ". @FLGuard and @HealthyFla teams have tested more than 106,000 residents and staff in 1,415 facilities.", "2020-06-03T16:16:47.000Z": "We are committed to proactive, high-volume testing. To date, Florida has tested more than 1 million people for #COVID19 .", "2020-06-03T16:12:42.000Z": "Working with @AHCA_FL , we have established five #COVID19 dedicated nursing homes across the state to protect our most vulnerable.", "2020-06-03T16:10:49.000Z": "It's important to understand which groups are most at risk to #COVID19", "2020-06-03T16:08:22.000Z": "Florida's plan against #COVID19 includes a focus on protecting the vulnerable", "2020-06-03T16:02:29.000Z": "WATCH LIVE: Press conference in Orlando Ron DeSantis @GovRonDeSantis WATCH LIVE: Press conference in Orlando pscp.tv", "2020-06-03T15:12:52.000Z": "Today I am holding a press conference in Orlando. Tune in at 12PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-06-02T18:55:59.000Z": "Thanks to the collaborative efforts of local officials, law enforcement, @FLGuard , and Florida Highway Patrol @FLHSMV , over the past 24 hours @fdlepio reports no significant civilian or law enforcement injuries and no widespread property damage. My full statement", "2020-06-02T15:30:53.000Z": "I have issued an executive order extending the moratorium on evictions and foreclosures until July 1st. We are committed to getting Floridians back on their feet as we move forward with our #SafeSmartStepbyStep plan for Florida's recovery.", "2020-06-01T21:02:09.000Z": "Florida has zero tolerance for violence, rioting & looting. George Floyd's murder was appalling & the MN perpetrators need to be brought to justice, but this cannot be used as a pretext for violence in our communities. \n\nI thank local leaders for their efforts to keep FL safe.", "2020-05-30T16:54:44.000Z": "Today we launch an American rocket from Florida soil. This collaboration between @NASA and @SpaceX is a great public-private partnership and Florida is at the epicenter for this type of innovation. The Sunshine State remains the world's premiere gateway to space! #LaunchAmerica Quote Tweet NASA @NASA LIVE NOW: #LaunchAmerica , Take 2. Watch as @NASA_Astronauts fly to the @Space_Station from U.S. soil for the first time in nine years: https:// twitter.com/i/broadcasts/1 YqJDEZjkQvxV   https:// twitter.com/i/broadcasts/1 YqJDEZjkQvxV ", "2020-05-29T16:32:40.000Z": "WATCH LIVE: Press conference in Boca Raton Ron DeSantis @GovRonDeSantis WATCH LIVE: Press conference in Boca Raton pscp.tv", "2020-05-29T15:19:23.000Z": "Today I am holding a press conference in Boca Raton. Tune in at 12:15PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-05-28T16:50:47.000Z": "Every Florida resident and visitor needs to be ready for hurricane season and have a plan in place. Be sure to take advantage of the Florida Disaster Preparedness Sales Tax Holiday, which runs from May 29-June 4.", "2020-05-28T16:01:12.000Z": "I would like to thank President @realDonaldTrump and @USDA for allowing states to identify gaps in services and develop new and needed programs that will help parents be reassured that their children will continue to receive healthy lunches although the school year is completed.", "2020-05-28T15:44:28.000Z": "Thank you to @FLDEPNews and @Nature_Florida for their work to make this acquisition possible, which will provide increased protection of water quality in Northwest Florida and our coastal resiliency efforts along the Gulf of Mexico. Learn more - https:// bit.ly/2XEIG7G", "2020-05-28T15:44:27.000Z": "Conserving lands for future generations is vital to our state's environmental heritage. Today, the Florida Cabinet joined me to approve the acquisition of over 17,000 acres of land in Wakulla and Franklin counties within the Dickerson Bay/Bald Point Florida Forever project.", "2020-05-27T14:33:05.000Z": "In case you missed it, I was pleased to announce Florida's next Supreme Court Justices  John Couriel, the son of Cuban exiles, and Judge Renatha Francis, the first Jamaican-American to be named to our state's highest court.", "2020-05-26T22:36:15.000Z": "My appointment of Judge Renatha Francis to the Florida Supreme Court is historic - a naturalized citizen, Francis will be the first Jamaican-American to serve on the court.", "2020-05-26T22:18:19.000Z": "The son of Cuban exiles, John Couriel understands the importance of the rule of law and a written constitution. As a Florida Supreme Court Justice, John will interpret the law and Constitution as written and won't legislate from the bench.", "2020-05-26T16:20:02.000Z": "WATCH LIVE: Major announcement in Miami Ron DeSantis @GovRonDeSantis WATCH LIVE: Major announcement in Miami pscp.tv", "2020-05-26T15:20:14.000Z": "On May 25, Florida received more than 20,000 test results yielding 518 new cases.\n\nStatewide positivity rate: 2.69%\n\nOriginal Phase 1 counties positivity rate: 2.09%", "2020-05-26T15:16:36.000Z": "Today I am making a major announcement in Miami. Tune in at 12PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-05-25T17:19:23.000Z": "For May 24, Florida reported over 41,000 test results with 997 positive tests for a statewide positivity rate of 2.5%.\n\nPositivity rate for original Phase 1 counties: 1.98%", "2020-05-25T14:08:12.000Z": "Today marks the 152nd anniversary of #MemorialDay and is an opportunity to remember the men and women who made the ultimate sacrifice in defense of our freedoms. We honor our Gold Star Families and those who continue to serve our nation every day.", "2020-05-24T16:04:32.000Z": "Looking forward to watching the match this afternoon between four legends: @TigerWoods and Peyton Manning vs. @PhilMickelson and @TomBrady . It's good to have sports back in Florida, especially for such a great cause. Hope everyone tunes in.", "2020-05-23T19:05:58.000Z": "For May 22, Florida reported nearly 30,000 test results with 760 positive tests for a statewide positivity rate of 2.7%.\n\nPositivity rate for original Phase 1 counties: 2.2%", "2020-05-23T13:27:58.000Z": "I hope all Floridians enjoy their Memorial Day weekend. I hope you take time to reflect on the sacrifices of those who put on the uniform of our country and gave the last full measure of devotion in support of freedom. We would not be free without them. God Bless their memories.", "2020-05-22T22:13:45.000Z": "Great news for #30A in Northwest Florida! Grayton Beach State Park in Walton County has been named the #1 beach in the country.\n\nFlorida is fortunate to be home to the country's most beautiful beaches. Quote Tweet AP South U.S. Region @APSouthRegion Need a little vitamin sea? A Florida Gulf coast beach has been named No. 1 in the U.S. for 2020. Grayton Beach was given the top spot this year on an annual list compiled by Florida professor Stephen Leatherman, appropriately nicknamed \"Dr. Beach.\" http:// apne.ws/vU7iTeN", "2020-05-22T20:17:11.000Z": "Under the direction of President @realDonaldTrump , I have directed all Florida and United States flags to be flown at half-staff until Sunday May 24 in honor of the victims of the novel coronavirus pandemic. See the President's Proclamation here - Proclamation on Honoring the Victims of the Novel Coronavirus Pandemic | The White House Our Nation mourns for every life lost to the coronavirus pandemic, and we share in the suffering of all those who endured pain and illness from the outbrea whitehouse.gov", "2020-05-22T19:19:07.000Z": "I'm pleased to announce that Florida is lifting restrictions on youth activities, including summer camps & athletics. Our kids have been out of organized activity for a few months & this is a pathway back. Thanks Dr. Bonnie White and Mayor @LennyCurry for joining me today.", "2020-05-22T18:36:25.000Z": "Glad to host @SecAzar in Jax this morning. Florida is leading the way on establishing partnerships with facilities like @Dolphin_Pointe , which serves as a regional hub to care for COVID-positive patients and help curb the spread of #COVID19 in long-term care facilities.", "2020-05-22T15:04:32.000Z": "WATCH LIVE: Governor Ron DeSantis Holds Press Conference Regarding COVID-19 in Jacksonville Ron DeSantis @GovRonDeSantis WATCH LIVE: Governor Ron DeSantis Holds Press Conference Regarding COVID-19 in Jacksonville pscp.tv", "2020-05-22T14:22:04.000Z": "For May 21, Florida is reporting more than 27,000 test results with roughly 800 positive tests for a statewide positivity rate of 2.92%.\n\nPositivity rate for original Phase I counties: 2.2%", "2020-05-22T14:17:50.000Z": "Today I am holding a press conference regarding #COVID19 in Jacksonville. Tune in at 11AM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-05-22T12:11:58.000Z": "Florida took action early on to protect our most vulnerable and ensure our medical and long-term care facilities have the personal protective equipment supplies they need. Thank you, Vice President @Mike_Pence and @SeemaCMS for your partnership.", "2020-05-21T20:16:34.000Z": "In case you missed it, I was pleased to join Vice President @Mike_Pence and @SecGeneScalia for a productive economic roundtable with state tourism and hospitality leaders in Orlando. \n\nFlorida is leading the way! #SafeSmartStepbyStep", "2020-05-21T15:25:11.000Z": "Florida received another big dump of test results: more than 50,000 results with roughly 1,300 new cases. \n\nFor this batch: \nStatewide Positivity: 2.5%\nPositivity for initial Phase I counties: 1.66%", "2020-05-21T13:52:22.000Z": "The @VP and I had a great lunch yesterday at @Bethsburgerbar . A 5 meal and outstanding staff make Beth's hard to beat. Be sure to stop by next time you're in Orlando.", "2020-05-20T20:25:14.000Z": "Thank you to Vice President @Mike_Pence for visiting Florida today to get a firsthand look at our Safe. Smart. Step-By-Step. Plan to re-open the state for business. The people of Florida appreciate your continued support!", "2020-05-20T14:52:16.000Z": "Yesterday, Florida received a big dump of test results, which yielded about 500 new cases out of more than 75,000 results for a statewide positivity rate of 0.64%.", "2020-05-19T21:29:02.000Z": "Our ultimate goal is getting good folks back on their feet. If a Floridian has an eligible claim, we want them to get paid as quickly as possible.", "2020-05-19T21:27:07.000Z": "Florida's Reemployment Assistance Claims Dashboard is a great resource. No other state is providing this level of transparency. We are committed to helping Floridians understand the status of their claims.\n\nSee the dashboard at: http:// Floridajobs.org/raclaimsdashbo ard ", "2020-05-19T21:17:21.000Z": "More than 2,000 state employees have stepped up to the plate and supported their fellow Floridians in need of reemployment assistance.", "2020-05-19T21:15:38.000Z": ". @FLDEO has paid out more in the last 10 weeks than it has in the last 5 years combined.\n\nWe will continue working around the clock to support Floridians.", "2020-05-19T21:13:51.000Z": "Since March 15th, @FLDEO has paid out over $2.6 billion in reemployment assistance to Floridians.", "2020-05-19T21:11:42.000Z": "There's still a lot of work to do, but I'm pleased to report that 97.6% of eligible applicants have been paid their reemployment claims by @FLDEO .\n\nHere's the math", "2020-05-19T21:08:11.000Z": "Florida is opening 5 new walk-up testing sites this week. These sites support underserved communities and can test 200 individuals per day.\n\nFind a site near you: http:// floridadisaster.org/covid19/testin g-sites/ ", "2020-05-19T21:01:35.000Z": "WATCH LIVE: Press Conference at the Florida State Capitol in Tallahassee Ron DeSantis @GovRonDeSantis WATCH LIVE: Press Conference at the Florida State Capitol in Tallahassee pscp.tv", "2020-05-19T20:26:37.000Z": "Today I am holding a press conference at the Florida State Capitol in Tallahassee. Tune in at 5PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-05-19T19:17:01.000Z": "Great message from @Buccaneers newest QB @TomBrady to #2020FLGraduates !\n\n\" make decisions that are in line with your priorities. So many people over the course of my career want to be a great player, but they don't want to make the commitment.\" Celebrating Florida Seniors: Tom Brady youtube.com", "2020-05-18T16:48:17.000Z": "I'm pleased to join @MyFLFamilies Secretary Chad Poppell to announce a nearly $2 million Emergency Grant from @samhsagov to address mental health and substance use disorders in Florida resulting from the current #COVID19 public health emergency.", "2020-05-19T13:27:16.000Z": "Join @GovRonDeSantis and I in recognizing May 2020 as Foster Care Month in Florida. Over 6,700 foster families have opened their homes to more than 8,150 children, with some committing to care for youth impacted by #COVID19 . All children deserve a loving home.", "2020-05-19T15:13:39.000Z": "On May 18, the 64 original Phase I Florida counties reported roughly 23,000 test results with 402 new cases for a positivity rate of 1.75%. The positivity rate for 5/18 for all counties including Miami was 1.9%.", "2020-05-18T21:20:15.000Z": "Thanks to @danawhite and @ufc for being the first sport back! You are always welcome in Florida - let's have fans next time! Quote Tweet danawhite @danawhite Thank you Jacksonville for an amazing week!!! @RonDeSantisFL  @lennycurry  @FloridaExtreme  @VyStarVetArena", "2020-05-18T20:20:28.000Z": ". @FLCaseyDeSantis told me this was much needed: haircuts for a handsome young man and an old warhorse. \n\nThanks to all of our great barbers and hairdressers. Glad y'all are back in business!", "2020-05-18T18:23:33.000Z": "Lower traffic during #COVID19 was an opportunity for Florida to get ahead on transportation projects. Today I announced the opening of 5 new flyover ramps that compose the most impactful portion of the I-4 Ultimate Project in Central Florida 3 months ahead of schedule.", "2020-05-18T16:14:52.000Z": "I'm pleased to announce the opening of 5 new flyover ramps that compose the most impactful portion of the I-4 Ultimate Project 3 months ahead of schedule. We will continue to identify infrastructure projects to expedite as a result of #COVID19 . More info - https:// bit.ly/2LCR563", "2020-05-18T13:55:29.000Z": "WATCH LIVE: Major transportation announcement in Orlando Ron DeSantis @GovRonDeSantis WATCH LIVE: Major transportation announcement in Orlando pscp.tv", "2020-05-18T12:40:15.000Z": "Today I am making a major transportation announcement in Orlando. Tune in at 10AM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-05-17T13:12:14.000Z": "I want to thank the people of Florida for working really hard during this difficult time. There is a light at the end of the tunnel.", "2020-05-16T19:33:28.000Z": "Dolphin Pointe Health Care is the first of its kind in our state and @AHCA_FL is working to develop more facilities like this to provide medically-safe discharge destinations for positive #COVID19 patients.", "2020-05-16T15:11:13.000Z": "Join me in congratulating Florida's School-Related Employee of the Year, Ms. Althea Council. Not only is Althea a top-notch food service professional, she always goes above and beyond to spread joy and cheer at Citrus Springs Middle School.", "2020-05-16T15:10:15.000Z": "Pleased to recognize Florida's 2020 Assistant Principal of the Year, Ms. Kate Fulginiti. Her dedication to the students at Matthew Gilbert Middle School is a shining example.", "2020-05-16T15:09:15.000Z": "Congratulations to Ms. Sarajean Branam McDaniel, Florida's 2020 Principal of the Year. Her hard work and commitment have made a difference in the lives of the students and staff at Moseley Elementary School and the community.", "2020-05-16T13:20:54.000Z": "Today we pay tribute to the brave men and women who serve in the United States Armed Forces. Florida is proud to be home to more than 100,000 service members, more than 20 major military installations, three Combatant Commands and 1.5 million veterans. Thank you for your service!", "2020-05-15T21:24:03.000Z": "Since Florida entered Phase 1 on May 4, ICU hospitalizations for COVID patients are down 21% and ventilator use by COVID patients is down 32%.", "2020-05-15T21:00:39.000Z": "Florida's approach to protecting vulnerable populations in long-term care facilities has been proactive and focused on preventing the introduction of #COVID19 into facilities. Great work by @AHCA_FL and @HealthyFla !", "2020-05-15T18:56:05.000Z": "Florida's Full Phase 1 begins Monday, May 18. All 67 counties may now begin re-opening as we continue to implement our #SafeSmartStepbyStep Plan for Florida's Recovery.", "2020-05-15T16:10:36.000Z": "WATCH LIVE: Press conference in Jacksonville regarding #COVID19 Ron DeSantis @GovRonDeSantis WATCH LIVE: Press conference in Jacksonville regarding #COVID19 pscp.tv", "2020-05-15T15:28:34.000Z": "Today I am holding a press conference in Jacksonville regarding #COVID19 . Tune in at 12PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-05-15T13:02:44.000Z": "Florida is a state that proudly takes care of its veterans. We are constantly identifying areas of need to ensure our state's 1.5 million veterans get the support they deserve. See my message to veterans in this year's 2020 Benefits Guide: https:// bit.ly/2y24hOt Quote Tweet Danny Burgess @DannyBurgessFL The 2020 edition of the @FLVetsAffairs Florida Veterans' Benefits Guide is now available online at http:// floridavets.org . This comprehensive resource is a one-stop guide for veterans and military families to find statewide benefits, services and support. #FLVets", "2020-05-15T12:09:35.000Z": "Today, I've directed flags be flown at half-staff in observance of Peace Officers Memorial Day to honor those who were killed or disabled in the line of duty. The sacrifice these brave officers made will not be forgotten. From all of us whom you protect and serve, thank you.", "2020-05-15T00:30:43.000Z": "South Florida is an important region of our state. Entering Phase 1 wouldn't have been possible without the partnership of @LtGovNunez , @MayorGimenez , @HoldnessD9 and @maybermudez , as well as our health care workers and first responders on the front lines of #COVID19 .", "2020-05-14T23:30:56.000Z": "Florida's Department of @ElderAffairs has formed a partnership with @FloridaDBPR and @FRLAnews to match the needs of the elderly and meal delivery services during #COVID19 . To date, over 140,000 meals have been prepared and delivered by participating restaurants. Great work!", "2020-05-14T21:51:19.000Z": "Today we take an important step for South Florida. Thanks to our collaboration with local leaders including @MayorGimenez , @HolnessD9 and @mayorbermudez , I have signed an executive order granting requests from Miami-Dade and Broward to move them into Phase 1. #SafeSmartStepbyStep", "2020-05-14T21:31:16.000Z": "This afternoon I received a briefing from @CollierSheriff and @GN_Fire on the wildfire impacting #CollierCounty and SWFL. I urge residents to remain vigilant and heed local evacuation orders. We thank our emergency personnel and first responders for keeping residents safe.", "2020-05-14T18:24:38.000Z": "In order to provide much needed #COVID19 support to Floridians, today I signed an Executive Order that extends mortgage foreclosure and eviction relief until June 2. See the Executive Order here - https:// bit.ly/3fRUnAi", "2020-05-14T16:14:29.000Z": "WATCH LIVE: Press conference with South Florida mayors regarding #COVID19 in Doral Ron DeSantis @GovRonDeSantis WATCH LIVE: Press conference with South Florida mayors regarding #COVID19 in Doral pscp.tv", "2020-05-14T15:06:07.000Z": "Today I am holding a press conference in Doral with South Florida mayors regarding #COVID19 . Tune in at 12PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-05-14T14:13:29.000Z": "The percentage of positive test results for inmates - 18% - is much lower than what we've seen with other state prison outbreaks but is significantly higher than the positivity rate for the public at large in Florida.", "2020-05-14T14:13:28.000Z": "Florida reports another 150+ new cases today from prisons, including 98 new cases at Homestead CI in Miami-Dade County.", "2020-05-14T13:13:19.000Z": "We are monitoring the brush fires in SWFL and this afternoon I will be traveling to #CollierCounty to receive an update from local emergency management officials. We thank the first responders & @FLForestService who are working to contain these brush fires & keep residents safe.", "2020-05-14T12:57:49.000Z": "Enjoyed speaking with Fox & Friends @FoxNews this morning on my phased and measured approach to re-opening Florida's economy. I look forward to getting our state back on track in a safe manner. Gov. DeSantis pushing a return to normalcy in Florida Florida Gov. Ron DeSantis joins 'Fox & Friends' after he announces professional sports teams from across the country are welcome to the Sunshine State. video.foxnews.com", "2020-05-13T20:59:31.000Z": "Update on antibody testing at Florida's drive thru sites: positivity for Miami is still at 10% and is inching up for Orlando and Jacksonville (now between 2.4% and 3.1%). Palm Beach is only 1.7%, but has not had enough people get tested to draw any conclusions.", "2020-05-13T19:24:25.000Z": "Florida acted early to protect seniors in long-term care facilities by prohibiting hospitals from sending COVID-positive residents back to those facilities. \n\nThank you to Emmett Reed from the @FHCA for pointing out that this saved lives.", "2020-05-13T19:05:35.000Z": "Florida prioritized support for long-term care facilities. We took swift action to protect residents, including prohibiting COVID-positive patients from being sent back to facilities where they could infect others. Thanks to CEO @SteveBahmer & @LeadingAgeFL for the partnership.", "2020-05-13T16:02:38.000Z": "WATCH LIVE: Meeting on long-term care facilities and #COVID19 at the Florida State Capitol Ron DeSantis @GovRonDeSantis WATCH LIVE: Meeting on long-term care facilities and #COVID19 at the Florida State Capitol pscp.tv", "2020-05-13T15:01:58.000Z": "Today I am holding a meeting on long-term care facilities and #COVID19 at the Florida State Capitol. Tune in at 12PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-05-13T14:27:16.000Z": "Florida has increased testing in prisons. Yesterday, 100 new prison cases were identified in Hamilton County and we've seen over 120 new prison cases in Liberty County and 78 new prison cases in Miami-Dade County over the past few days.", "2020-05-13T12:16:06.000Z": "Hospitals located in Florida counties currently in Phase 1 are proceeding with elective surgeries. Most of these procedures are not cosmetic, they are necessary, and doctors understand the importance of having these surgeries sooner rather than later.", "2020-05-12T19:49:59.000Z": "Initial results from serological testing at drive thru sites: 10% positive for antibodies in Miami and between 2% and 3% in Orlando and Jacksonville. Health care workers and first responders were tested, so not necessarily a representative sample.", "2020-05-12T18:07:55.000Z": "Original Phase 1 counties reported receiving over 15,000 test results yesterday. New cases: 297. Percent Positive: 1.88%.", "2020-05-12T16:10:11.000Z": "Hospitals like @Lee_Health are doing a great job keeping their facilities safe for patients seeking treatment. Good perspective here from their CEO, Dr. Larry Antonucci.", "2020-05-12T12:56:51.000Z": "During #NationalPoliceWeek , we honor and recognize the sacrifices and courage of our brave men and women in blue. We thank Florida's law enforcement officers who are keeping us safe during the #COVID19 pandemic and year-round.", "2020-05-11T23:18:22.000Z": "The Florida Department of @ElderAffairs is working to protect our most vulnerable residents. These Scent Evidence Protection Kits allow families living with Alzheimer's and dementia to be prepared before someone may go missing. Quote Tweet FLDOEA @elderaffairs DOEA is delivering 2,000 Scent Evidence Kits to caregivers of those living with Alzheimer's Disease or a related dementia to help prevent at-risk individuals from becoming a missing person. The kits significantly reduce the time it takes to locate someone. https:// tinyurl.com/y9m6t5h8", "2020-05-11T22:31:32.000Z": "My administration continues to accelerate vital transportation projects throughout the state, providing essential jobs to Floridians. During #COVID19 , @MyFDOT is expediting more than 40 additional projects to keep Florida moving. Quote Tweet FLORIDA DOT @MyFDOT #ICYMI : Due to continued lower traffic volumes, @MyFDOT has announced an acceleration of more than 40 additional critical infrastructure projects across all districts by at least 650 total contract days. For a complete list of expedited projects, go to http:// bit.ly/3fulGjH .", "2020-05-11T21:51:21.000Z": "Following my recent request, @SeemaCMS has approved greater flexibility and reimbursement for hospitals providing inpatient services to long-term care residents. This federal flexibility is key as we continue to support Florida facilities working to combat #COVID19 .", "2020-05-11T21:01:44.000Z": "Yesterday yielded 187 new cases in Phase 1 counties with a positivity rate of 1.43%. The positivity rate has ranged between 1.43% and 4.2% over the past 2 weeks for our Phase 1 counties and has noticeably declined in the past week.", "2020-05-11T21:01:43.000Z": "", "2020-05-11T17:18:37.000Z": "Tune in to my press conference @Lee_Health where I am meeting with physicians and medical experts to discuss the state's ongoing response to #COVID19 : Lee Health on Facebook Watch Governor Ron DeSantis visits Gulf Coast Medical Center- Press Conference facebook.com", "2020-05-11T16:40:52.000Z": "Today I will be meeting with physicians and medical experts to discuss the state's ongoing response to #COVID19 at Lee Memorial Hospital. Tune in at 1PM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-05-10T13:07:00.000Z": "Happy Mother's Day to my beautiful wife @FLCaseyDeSantis . Casey is a wonderful mother and her leadership on mental health and substance abuse through her Hope for Healing initiative is helping families across our state. \n\nWishing all mothers a Happy #MothersDay", "2020-05-09T18:18:42.000Z": "If you'd like to be tested, these sites offer a convenient way to do it. The sites are in Broward (2 sites), Duval, Escambia, Hillsborough, Lee, Miami-Dade (3 sites), Orange, Palm Beach (2 sites), and Sarasota counties.", "2020-05-09T18:18:41.000Z": "The state supports 13 drive-thru test sites throughout Florida. Yesterday, we had 5,290 individuals get tested at these sites, yet we have capacity to test at least twice that many.", "2020-05-09T17:19:24.000Z": "Starting Monday, May 11th, Palm Beach County will enter Phase 1 of re-opening. We understand our responsibility to protect vulnerable populations and are ready for this next phase. Thank you, Mayor @DavidMKerner for working with us to keep residents safe.", "2020-05-09T15:27:51.000Z": "Thank you @TuckerCarlson and Dr. Marc Siegel for sharing how my administration's actions to protect our seniors and most vulnerable in long-term care facilities early on during the #COVID19 pandemic was critical to flattening the curve in Florida.", "2020-05-08T21:48:04.000Z": "Florida is the most military-friendly state in the nation and on #MilitarySpouseAppreciationDay we acknowledge the significant contributions and sacrifices of military spouses to our great state. God Bless America!", "2020-05-08T19:02:50.000Z": "Here's a major announcement from my friend J Henry, owner of J Henry's Barber Shop in downtown Orlando.", "2020-05-08T18:15:29.000Z": "Great news: May 7th represented the best testing day for Florida since the start of the #COVID19 pandemic. Florida received nearly 20,000 test results, which yielded only 358 new Florida cases and the lowest statewide positivity rate - 1.89% - on record for new cases.", "2020-05-08T17:31:35.000Z": "Tune in to my press conference at FITTEAM Ballpark of the Palm Beaches for an announcement: Governor Ron DeSantis on Facebook Watch Tune in to my press conference at FITTEAM Ballpark of the Palm Beaches for an announcement. Watch LIVE: facebook.com", "2020-05-08T15:20:12.000Z": "Tune in to my press conference in Jacksonville where I am announcing our partnership with a brand-new long-term care facility dedicated to providing quality care for #COVID19 patients: Governor Ron DeSantis on Facebook Watch Tune in to my press conference in Jax where I am announcing our partnership with a brand-new long-term care facility dedicated to providing quality care... facebook.com", "2020-05-08T14:29:43.000Z": "Today I'm announcing Florida's partnership with a brand-new long-term care facility dedicated to providing quality care for #COVID19 patients. Tune in at 11AM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-05-08T13:26:12.000Z": "In case you missed it, I joined @IngrahamAngle last night to discuss Florida's data-driven approach to flattening the curve and protecting our most vulnerable residents during #COVID19 .", "2020-05-07T21:13:31.000Z": "Enjoyed meeting with @OCFLMayor Jerry Demings and small business owners recently at a hair salon in Orlando. Floridians are creative people and together we will find a way to get these good folks back in business.", "2020-05-07T19:30:51.000Z": "Our men and women of the @FLGuard are protecting vulnerable residents in nursing homes and assisted living facilities during #COVID19 . We salute you! GIF", "2020-05-07T19:06:26.000Z": "With Mother's Day around the corner I stopped by Rusted Arrow in Pensacola to pick up some gifts.  Great store in a beautiful downtown area!", "2020-05-07T18:19:57.000Z": "Today I received a briefing on the #FiveMileSwampFire from @SRC_EM , @SRSheriffFL & @FLForestService . We have already received approval on our @FEMA request for federal financial assistance. Thank you President @realDonaldTrump for helping the good folks of Northwest Florida.", "2020-05-07T13:19:01.000Z": "I'm heading to Santa Rosa County this morning to receive a briefing from local officials on the 2,000-acre wildfire. We're closely monitoring this situation with @FLSERT and I've requested @fema to provide financial assistance to the county.", "2020-05-07T12:14:37.000Z": "This year's National Day of Prayer comes as we navigate our way through a difficult time that has impacted all of us. As we continue to fight to alleviate the effects of #COVID19 , let us lean on God in prayer to become more resilient in the face of fear and crisis.", "2020-05-06T23:48:32.000Z": "Nursing homes are ground zero for #COVID19 and that's why we have been deploying innovative and proactive methods to expedite testing of vulnerable residents.", "2020-05-06T23:01:40.000Z": "PPE will continue to be essential to our #COVID19 response, particularly as we progress through my Safe. Smart. Step-by-Step. Plan to re-open Florida.", "2020-05-06T22:15:48.000Z": "Florida has launched the only state-sponsored rapid-test mobile lab that we're aware of in the country. We continue to lead the way on innovative testing. 500 tests per day 45-minute turnaround 10 nurses and 10 Guardsmen assigned Focus on long-term care facilities", "2020-05-06T21:33:57.000Z": "Florida's new Critical Care Decontamination System is a gamer changer. The facility at Hard Rock Stadium can decontaminate up to 80,000 masks per day and decontaminate the same mask 20 times. \n\nWe are working with @fema to have additional Florida sites added as needed.", "2020-05-06T20:26:27.000Z": "Florida is leading the way on innovative testing for #COVID19 . Today I was joined by @MayorGimenez at Hard Rock Stadium to announce the only state-sponsored mobile testing lab and share cutting edge technology being used to decontaminate PPE.", "2020-05-06T18:53:59.000Z": "We are taking action to protect those who are suffering from mental health and substance abuse during the #COVID19 pandemic. GIF", "2020-05-06T17:16:24.000Z": "I have directed @AHCA_FL Secretary Mary Mayhew to issue an emergency rule requiring hospitals to test all individuals that will be discharged to a long-term care facility, regardless of whether the individual is symptomatic. GIF", "2020-05-06T16:04:00.000Z": "On #NationalNursesDay , we honor the more than 430,000 licensed registered nurses and practical nurses here in Florida.\n \nOur nurses are heroes on the frontlines of the #COVID19 pandemic. To that end, I have proclaimed the entire month of May as Florida Nurses Month.", "2020-05-06T15:25:29.000Z": "Pleased to announce the launch of Florida's new mobile testing lab, which will allow us to exponentially increase our proactive testing efforts at long-term care facilities.", "2020-05-06T15:04:20.000Z": "Tune in to my press conference at Hard Rock Stadium for the launch of Florida's new mobile testing lab: Governor Ron DeSantis on Facebook Watch Tune in to my press conference in Miami for the launch of Florida's new mobile testing lab. Watch LIVE: facebook.com", "2020-05-06T14:04:51.000Z": "Today I'm hosting a press conference for the launch of Florida's new mobile testing lab at Hard Rock Stadium in Miami Gardens. Tune in at 11AM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-05-06T00:46:23.000Z": "Tonight I'll be joining @seanhannity to discuss Florida's progress during Phase One of our state's re-opening. Tune in during the 9PM hour.", "2020-05-05T19:26:05.000Z": "Thank you, Dr. Crossman. It's important that we lead based on facts and data. We appreciate the partnership of the medical community in this effort.", "2020-05-05T17:21:50.000Z": "This week we honor those who have dedicated their lives to education. I especially want to thank our teachers for making distance learning so successful during the #COVID19 health emergency. @FLCaseyDeSantis & I extend our highest gratitude to educators everywhere. #ThankATeacher", "2020-05-05T15:53:50.000Z": "Pleased to announce our 12th state-supported drive-through testing site today in Sarasota. The state's drive-through sites have already accounted for over 109,000 tests. GIF", "2020-05-05T15:43:38.000Z": "Tune in to my press conference in Sarasota where we will be highlighting one of our new testing sights: Watch Live Newscasts mysuncoast.com", "2020-05-05T15:29:34.000Z": "May 4th represented the best testing for Florida since the start of the pandemic. Florida received 23,884 test results, which yielded only 589 new Florida cases and the lowest statewide positivity rate - 2.61% - on record for new cases.", "2020-05-05T14:20:05.000Z": "Today I'll be hosting a press conference regarding #COVID19 and the opening of a new drive-through test site in Sarasota. Tune in at 11:30 AM to the @floridachannel or http:// facebook.com/GovRonDeSantis .", "2020-05-05T13:45:17.000Z": "In Florida we took swift action to protect our elderly and vulnerable residents in long-term care facilities. Thank you @seanhannity for highlighting these efforts.", "2020-05-04T23:22:25.000Z": "In mid-April, out-of-state media had a spasm because Duval County opened its beaches for recreational use.\n\nNow 17 days later, have the fears of this drive-by smear against Floridians been realized? Facts vs. Fear: Duval County youtube.com", "2020-05-04T21:56:38.000Z": "Join me this afternoon for updates on the state's response to COVID-19 and our efforts on reemployment. Watch LIVE at 6:00 PM: Governor Ron DeSantis on Facebook Watch Join me this afternoon for updates on the state's response to COVID-19 and our efforts on reemployment. Watch LIVE at 6:00 PM facebook.com", "2020-05-04T14:59:00.000Z": "Coach Don Shula leaves behind an incomparable legacy as the NFL's winningest coach and as the one who put Miami sports on the map.", "2020-05-03T17:41:37.000Z": "I'm meeting with doctors and health care professionals at @HalifaxHealth in Daytona to discuss elective surgeries resuming in hospitals and the state's latest efforts to combat #COVID19 . Watch here - https:// facebook.com/halifaxhealth/ videos/703409143761542 ", "2020-05-03T16:47:09.000Z": "Thanks to @MariaBartiromo for having me on this morning to discuss my Safe. Smart. Step-by-Step. Plan for Florida's Recovery and what Florida is doing to protect residents in long-term care facilities. Gov. DeSantis on how Florida is protecting nursing home residents Florida Gov. Ron DeSantis outlines Phase 1 of reopening the state on 'Sunday Morning Futures.' video.foxnews.com", "2020-05-02T17:03:33.000Z": "Today I'm in Orlando at OhSoooJazzy Hair Salon for a roundtable with small business owners and community leaders, including @OCFLMayor Jerry Demings. Watch live: The Florida Channel - Connecting Florida thefloridachannel.org", "2020-05-02T14:28:50.000Z": "Over the past ten days, Florida's positivity rate for new cases has ranged between 4.12% and 6.18%. Roughly 95% of these tests come back negative.", "2020-05-01T18:08:38.000Z": "Watch my live announcement at the Escambia County Test Site: Live: Gov. DeSantis holds press conference in Pensacola abut COVID-19 LIVE: Gov. Ron DeSantis and Rep. Matt Gaetz will speak at a scheduled 1 p.m. press conference in Pensacola regarding COVID-19 -- https://bit.ly/2SqnuAq facebook.com", "2020-05-01T15:08:48.000Z": "Watch my live announcement at Little Talbot Island State Park: https:// bit.ly/2yh3FER", "2020-05-01T13:30:39.000Z": "We need to focus on facts and not fear. They said Florida was going to be just like New York or an \"Uber Italy\" when it came to hospitalizations and fatalities. This was wrong. It's time to focus on the facts and follow a safe, smart and step-by-step plan for recovery.", "2020-04-30T20:12:47.000Z": "I recently met with physicians in Broward County @CleveClinicFL where they highlighted optimism for Florida's future.\n \nI agree Dr. Barsoum, by working together, we will be victorious!", "2020-04-30T19:31:44.000Z": "We recently opened two walk-up community test sites in conjunction with the @ULBroward in Broward County. The two sites already account for over 3,800 tests. Great job!", "2020-04-30T19:14:00.000Z": "Ultimately, the Project will mean less harmful discharges from Lake O into our estuaries and more clean water can move south into the Everglades. More info here - https:// bit.ly/2VPNoQ3", "2020-04-30T19:13:58.000Z": "I'm pleased to announce that construction has started on the EAA Reservoir Project - one of the most important Everglades restoration projects in history.", "2020-04-30T18:17:52.000Z": "Thank you Dr. Lockwood and medical staff at @TGHCares for your contributions and perspective on Florida's fight against #COVID19 .", "2020-04-30T15:49:13.000Z": "Florida has spearheaded walk-up testing sites in underserved communities. This is a collaboration between the State of Florida, @FLGuard , @HealthyFla and local communities. \n\nGreat job to all involved!", "2020-04-30T15:22:23.000Z": "The past 2 months have been difficult and many of us have experienced hardships and uncertainty. My Safe. Smart. Step-by-Step. Plan for Florida's Recovery will lead to our state's next phase. There is a light at the end of the tunnel.", "2020-04-30T00:09:58.000Z": "ICYMI, today I laid out Phase One of my Safe. Smart. Step-by-Step. Plan for Florida's Recovery. 4/29/2020 Governor Ron DeSantis COVID-19 Press Conference Governor's COVID-19 Resources Webpage: https://www.flgov.com/covid-19/ Direct File Link: https://www.flgov.com/wp-content/uploads/covid19/Safe%20Smart%20Step... youtube.com", "2020-04-29T19:26:06.000Z": "I will be holding a press conference at 5:00 PM to announce my SAFE. SMART. STEP-BY-STEP. Plan to Re-Open Florida. Watch live on http:// thefloridachannel.org .", "2020-04-29T17:30:34.000Z": "Thank you to the physicians and medical personnel at @OrlandoHealth for your guidance as we work on my Safe. Smart. Step-by-Step. Plan for Florida's Recovery.", "2020-04-29T16:30:07.000Z": "Florida has done better than anyone predicted. We have a big, diverse state that requires a tailored and measured approach. Data and science have helped us flatten the curve in a safe way.", "2020-04-29T15:41:17.000Z": "Thank you, Dr. Birx. Our commitment to high-volume testing and a data-driven approach has helped us flatten the curve.", "2020-04-28T17:58:41.000Z": "Great meeting with President @realDonaldTrump at the @WhiteHouse discussing all things #COVID19 and FL's strong efforts to protect vulnerable populations & to expand testing in an innovative way. @POTUS & his administration have provided great support for FL each step of the way.", "2020-04-28T15:10:59.000Z": "ICU bed availability in Florida hospitals has increased during the span of this pandemic. In fact, Miami-Dade, which has nearly 40% of all FL cases, had 45% of its ICU beds available as of 4/27. Thank you to all of our health care workers and systems for doing such a great job!", "2020-04-27T22:11:11.000Z": "Florida has flattened the curve. Our state continues to ramp up #COVID19 testing, our hospitalizations remain low, and we are on the right path to safely re-opening our economy.", "2020-04-27T21:53:37.000Z": ". @MayorGimenez , @ReadyBroward and @pbcgov demonstrated a thoughtful approach to re-opening parks, marinas and golf courses.", "2020-04-27T20:37:17.000Z": "Taking advantage of less traffic, work for the widening of I-275 over Westshore Blvd in Tampa's busy Westshore District is moving swiftly. Completion is now estimated to be 60 days ahead of schedule.", "2020-04-27T01:22:13.000Z": "Kudos to @HealthyFla for including a new chart tracking the trend in positivity rates for Coronavirus tests. The last two days (4/24 and 4/25) have been 5.2% and 4.5% respectively. Very positive trend!", "2020-04-26T19:08:54.000Z": "Great meeting today with the talented physicians and medical experts @orlandohealth . Hospitalization rates have decreased across Florida and our expanded testing shows a decline in the rate of those testing positive for #COVID19 . Watch full video here: Live Update with Governor Ron DeSantis We are live at Orlando Health Orlando Regional Medical Center with Governor Ron DeSantis. facebook.com", "2020-04-25T18:34:51.000Z": "Your job and paycheck are important, and we are working hard to take a safe, smart, step-by-step approach to re-opening our economy.", "2020-04-23T22:26:58.000Z": "Public policy and health policy must continue to go hand in hand. I want to thank the doctors and health care professionals volunteering their time to serve on my Re-Open Florida Task Force.", "2020-04-23T18:51:27.000Z": "Thanks to @PhilMickelson for working so hard to put this together. This will raise millions for #COVID19 relief and will also provide sports fans something to look forward to during this difficult time. Quote Tweet Bleacher Report @BleacherReport It's official: @TigerWoods , Peyton Manning, @PhilMickelson and @TomBrady all on one golf course The Match: Champions for Charity is coming soon exclusively on TNT. All proceeds will benefit COVID-19 relief https:// bit.ly/2S1vhV7", "2020-04-23T17:35:23.000Z": "Joined @seanhannity to discuss how we are flattening the curve and saving Florida's seniors.", "2020-04-22T14:26:38.000Z": ". @elderaffairs continues to find unique ways to improve the lives of those they serve. This initiative will provide seniors with Alzheimer's and dementia a different outlet to reduce the stress of self-isolation. Quote Tweet FLDOEA @elderaffairs DOEA is proud to partner with the FL Alzheimer's Association #AlzFL to bring the gift of music to socially isolated seniors and adults with dementia. This week, over 1,000 pre-loaded MP3 players will be delivered to these Floridians and their caregivers. https:// tinyurl.com/yczm4urc", "2020-04-21T21:15:01.000Z": "Flattening the curve was necessary to prevent our hospital system from being overwhelmed. FL has dramatically increased its hospital bed and ICU bed capacity since the start of the pandemic.", "2020-04-21T19:53:07.000Z": "Today's #COVID19 news briefing will be at 4:30 PM. Watch it on the @floridachannel at http:// thefloridachannel.org .", "2020-04-21T17:24:40.000Z": "Florida is grateful to @Mike_Pence for his perseverance and leadership during this global pandemic. Thank you for your responsiveness, dedication and friendship over the past several months!", "2020-04-21T16:51:34.000Z": "As we observe Yom HaShoah, we remember the 6 million Jewish men, women & children who were persecuted & murdered by German Nazis in service of an evil ideology. In recalling these horrors, we teach future generations to never permit such atrocities again. #HolocaustRemembranceDay", "2020-04-21T13:07:35.000Z": "Glad to have joined @foxandfriends this morning to discuss how Florida is successfully flattening the curve. Floridians are doing a great job at stopping the spread and together we will re-open Florida's economy. Gov. DeSantis: Florida getting back to work without imposing 'draco... Gov. Ron DeSantis discusses how coronavirus projections in Florida were wrong and when he plans to ease restrictions in Florida video.foxnews.com", "2020-04-20T21:15:54.000Z": "Too often, the rights of crime victims are forgotten or neglected. In honor of National Crime Victims' Rights week, we recognize survivors and those who have lost their lives to senseless acts of violence. We will always support efforts to assist victims and their families.", "2020-04-20T21:08:20.000Z": "We are flattening the curve thanks to the hard work and sacrifice of so many Floridians from across the state. \n \nClick the link below to find out how Florida is Flattening the Curve A message from Governor Ron DeSantis: Florida is Flattening the Curve youtube.com", "2020-04-20T18:03:55.000Z": "The people of Northeast Florida, with leaders like Mayor @lennycurry , have done a great job at flattening the curve. Check out how Duval County stacks up:", "2020-04-20T15:53:34.000Z": "Well-deserved shout out by Dr. Birx to @HealthyFla and our great county health departments. Thank you for your hard work!", "2020-04-19T00:18:32.000Z": "Florida has made great progress with distance learning so we will continue with that for the remainder of the k-12 school year. Keeping our children and families safe is a priority.", "2020-04-17T23:27:18.000Z": "The two new walk up #COVID19 testing sites here in @BrowardCounty with @ulbroward are significant. Not everyone has access to a car or the ability to travel to drive-thru sites. These sites will increase accessibility for testing.", "2020-04-17T22:31:20.000Z": "Florida has received $4.1 billion from the federal CARES Act to aid the state in responding to and recovering from #COVID19 . Together, we will get through this difficult time and emerge stronger than before.", "2020-04-17T20:11:34.000Z": "I'm pleased to report that @SFWMD received the final federal permit to begin onsite work for the #EAAReservoir Project. I look forward to construction starting as soon as possible. The project is not only essential for Everglades restoration, it will also create hundreds of jobs.", "2020-04-17T17:19:49.000Z": "Today we honor the valiant Cuban patriots of the 2506 Brigade who fought for freedom in the battle of Bay of Pigs. Your sacrifice will always be remembered.", "2020-04-16T23:04:24.000Z": "Our health care workers inspire us every day in our fight against #COVID19 . Your dedication is admirable and appreciated by all. Thank you for everything you do.", "2020-04-16T22:20:07.000Z": "Today I issued Executive Order 20-104. Read it here - https:// bit.ly/2REetDx", "2020-04-16T19:46:49.000Z": "Today's #COVID19 news briefing will be at 5:00 PM. Watch it on the @floridachannel at http:// thefloridachannel.org .", "2020-04-16T16:27:31.000Z": "Happy Birthday to Senate President @BillGalvano , a good friend and a great leader for our state.", "2020-04-15T19:46:00.000Z": "Today's #COVID19 news briefing will be at 4:50 PM. Watch it on the @floridachannel at http:// thefloridachannel.org .", "2020-04-15T13:54:26.000Z": "Here's a message to Floridians who are fighting every day to combat #COVID19 .  \n\nWe can, and we will, get through this together. Governor Ron DeSantis COVID-19 Message youtube.com", "2020-04-14T18:57:04.000Z": "Today's #COVID19 news briefing will be at 4:00 PM. Watch it on the @floridachannel at http:// thefloridachannel.org .", "2020-04-13T18:20:42.000Z": "Today's #COVID19 news briefing will be at 2:30 PM. Watch it on the @floridachannel at http:// thefloridachannel.org .", "2020-04-12T11:05:40.000Z": "Wishing everyone a blessed Easter!", "2020-04-11T17:57:11.000Z": ". @EducationFL is providing more than 32,000 laptops to rural school districts to eliminate barriers to a great education. Thanks to our dedicated students, educators, parents and staff, Florida continues to lead the way in distance learning. https:// bit.ly/2V0mbK7", "2020-04-11T15:49:43.000Z": ". @FLCaseyDeSantis and I extend our sincerest condolences to the family of Representative @KristinJacobsFL . A fighter for the environment and water quality, we will remember Rep. Jacobs for her commitment to public service. She will be missed by many.", "2020-04-10T18:16:31.000Z": "We wish everyone a blessed Good Friday.", "2020-04-09T17:54:01.000Z": "Today's #COVID19 news briefing will be at 3:00 PM. Watch it on the @floridachannel at http:// thefloridachannel.org .", "2020-04-08T21:24:11.000Z": "Chag Pesach Sameach to our friends who are celebrating #Passover . As we pray to God for deliverance from hard times such as these, we wish all a safe and blessed celebration.", "2020-04-08T12:42:14.000Z": "Pleased to announce Project: VITAL, a partnership between @elderaffairs and @AlzAdvocacyFL to provide our elders in ALFs and nursing homes with tablets to safely connect them with their loved ones. Grateful for Sec. Prudom's leadership and our community partners. Learn more Quote Tweet FLDOEA @elderaffairs In partnership with @AlzAdvocacyFL , we have launched Project: VITAL in Assisted Living Facilities (ALFs) and nursing homes. This project aims to relieve the symptoms of social isolation during these trying times by allowing elders to safely connect with their loved ones.", "2020-04-07T20:45:53.000Z": "On #WorldHealthDay we are grateful for our doctors, nurses, healthcare staff and first responders for their service during our fight against COVID-19. Your selfless dedication to keeping our communities safe and healthy will always be remembered.", "2020-04-07T17:41:38.000Z": "Today's #COVID19 news briefing will be at 3:00 PM. Watch it on the @floridachannel at http:// thefloridachannel.org .", "2020-04-06T22:35:08.000Z": "Had a very productive #COVID19 response roundtable this morning with @FLDEO Director Ken Lawson, @FloridaDMS Secretary Jonathan Satter and @FloridaRevenue Director Jim Zingale to ensure Floridians receive their assistance quicky.", "2020-04-06T21:53:11.000Z": "I appreciate @FedEx 's willingness to help Floridians in a time of need. Starting today, over 100 @FedEx storefronts throughout the state are providing free printing and mailing of reemployment assistance applications.", "2020-04-06T17:32:39.000Z": "Today I issued Executive Order 20-95. Read it here - https:// bit.ly/2RfU1bH", "2020-04-06T13:21:40.000Z": "Today's #COVID19 news briefing will be at 10:30 AM. Watch it on the @floridachannel . https:// thefloridachannel.org", "2020-04-05T15:14:18.000Z": "", "2020-04-04T19:48:53.000Z": "As of 11 am today, we've tested 102K people for #COVID19 - making Florida second in the nation for testing. I appreciate the efforts of @FLSERT , @HealthyFla , @FLGuard and all of the health care workers and first responders on the front lines of this fight.", "2020-04-01T23:06:53.000Z": "I appreciated the time with @TeamCavuto today to discuss the challenges facing Florida ports with passengers on ships that carry COVID-19.", "2020-04-01T13:51:46.000Z": "As we continue to fight the spread of #COVID19 , I encourage every Floridian to utilize the resources available below. My administration is focused on providing as much help as possible to the people of Florida. We will get through this together.", "2020-03-30T23:54:01.000Z": "On #NationalDoctorsDay we thank the selfless men and women who work every day to improve the health and lives of those they serve.\n\nWe are forever grateful for your efforts and are proud to stand with you in this fight against #COVID19 .", "2020-03-30T12:26:34.000Z": "Counting our blessings. Casey and the kids are doing great. Quote Tweet Casey DeSantis @FLCaseyDeSantis Ron and I are beyond blessed to welcome our new baby girl, Mamie to the world. At 7 lbs 4 oz she was the smallest of the bunch, but she is already holding her own. Madison and Mason are so excited for their new baby sister!", "2020-03-25T22:21:23.000Z": "Thank you, President @realDonaldTrump for approving Florida's Disaster Declaration which will provide federal funds to help communities recover from the effects of #COVID19 . We are prepared for the fight ahead and will come out stronger than ever before.", "2020-03-25T21:34:16.000Z": "Dr. Birx and Dr. Fauci agree; there is too high a risk that travelers from the NY Tri-State Area have been exposed to #COVID19 . I appreciate their support for my executive order requiring such individuals flying into FL to self-quarantine for 14 days. Birx and Fauci warn people leaving New York: 'You may have been exposed' During the White House coronavirus task force briefing, Dr. Birx and Dr. Fauci supported Florida Gov. DeSantis' order that all travelers from the New York area self-quarantine for 14 days, saying it... nbcnews.com", "2020-03-20T23:20:24.000Z": "Floridians are resilient. This is not going to be easy, but we will get through it together.", "2020-03-20T12:00:13.000Z": "I want to thank those in the private sector who are helping Florida residents during this crisis, such as @Publix , which is designating senior shopping hours next week for customers 65 and older for their safety and wellbeing.", "2020-03-18T23:14:37.000Z": "Thank you @SBAgov for approving Florida's declaration for disaster loan assistance. Florida businesses interested in learning more should visit: https:// disasterloan.sba.gov/ela/Informatio n/Index ", "2020-03-18T16:11:30.000Z": "Si siente síntomas de COVID-19, comuníquese con la línea directa 24/7 de COVID-19 al: 1(866) 779-6121 Para obtener la última actualización visite: http:// floridahealth.gov/COVID-19", "2020-03-18T16:11:04.000Z": "El CDC no le recomienda que las personas sanas usen mascaras. Para obtener la última actualización visite: http:// floridahealth.gov/COVID-19", "2020-03-18T16:10:32.000Z": "Si siente síntomas de COVID-19, comuníquese con la línea directa 24/7 de COVID-19 al: 1(866) 779-6121 Para obtener la última actualización visite: http:// floridahealth.gov/COVID-19", "2020-03-16T20:19:31.000Z": "The CDC does not recommend healthy individuals to wear masks. The best way to prevent the spread of COVID-19 is by washing your hands, covering your cough or sneeze, and staying home if you are ill. For more information visit: http:// floridahealth.gov/covid-19", "2020-03-16T20:16:25.000Z": "If you believe you have been exposed to COVID-19, please contact the COVID-19 Hotline: 1(866)779-6121 before visiting your healthcare provider to prevent the spread of COVID-19.", "2020-03-16T20:14:03.000Z": "If you are experiencing the symptoms of COVID-19 please contact the COVID-19 Hotline: 1(866)779-6121 before visiting your healthcare provider to prevent the spread of this virus.", "2020-03-14T20:39:53.000Z": "Yesterday I sent a letter to @HHSGov Assistant Secretary Robert Kadlec requesting the release of 61 Florida residents from Georgia, many of whom are elderly, who were previously aboard the Grand Princess voyage outside of California. It is time to bring these Floridians home.", "2020-03-13T00:04:34.000Z": "Voters may consider picking up a vote-by-mail ballot for the March 17th election, which can also be picked up by a designee (form required) & returned by 7pm on Election Day. Designee \"affidavit\" forms are available in English and Spanish. More: http:// dos.myflorida.com/elections/for- voters/voting/vote-by-mail/   #COVID19", "2020-03-09T23:18:52.000Z": "I have issued an Executive Order declaring a State of Emergency to establish a unified command structure and direct funds as necessary in response to #COVID19 . \n\nEO: http:// bit.ly/2TUMdNh", "2020-03-07T15:54:39.000Z": "I have directed @FLSERT to activate to Level II to ensure Florida has all the necessary resources engaged as we respond to #COVID19 . It is critical that we proactively coordinate all state resources to mitigate and contain #COVID19 .", "2020-03-05T21:58:43.000Z": "Today, we awarded $2.2 million to Gadsden County through the Hurricane Michael State Recovery Grant Program. This funding, administered by @FLSERT , will help repair two important bridges for Gadsden residents. More here - http:// bit.ly/39uP1r4", "2020-03-04T18:23:06.000Z": "Happy to honor an American legend with this proclamation as a tribute to his many contributions to Florida. Quote Tweet Arnold Palmer @ArnoldPalmer The \"Arnold Palmer\" drink has been proclaimed as the official drink of the State of Florida's Governor's Mansion by Governor DeSantis. #LifeWellPlayed  #APinv", "2020-03-03T18:44:18.000Z": "This morning, we recognized the @FLGuard in celebration of National Guard Day at the Capitol. To those who are currently serving or have served in the National Guard, our state and nation are sincerely grateful for your selfless service and sacrifice.", "2020-03-03T18:22:06.000Z": "Here is a useful overview of what we know regarding #COVID19 , courtesy of Doctors Fauci, Lane and Redfield: Covid-19 - Navigating the Uncharted | NEJM Editorial from The New England Journal of Medicine - Covid-19 - Navigating the Uncharted nejm.org", "2020-03-03T17:01:40.000Z": "On March 3rd, 1845, Florida officially became the 27th state of the United States of America. 175 years later, our state remains a leader in healthcare, low taxes, and endless sunshine. It is a privilege to work for fellow Floridians every day. #Florida175", "2020-03-02T02:43:58.000Z": "Tomorrow I will be in Tampa and Miami with Surgeon General Rivkees and other officials to discuss our continued statewide response on #COVID19 . Quote Tweet Florida Dept. Health @HealthyFla Florida has 2 presumptive positive #COVID19 cases: one adult resident of Hillsborough County and one adult resident of Manatee County. Both individuals are isolated and being appropriately cared for. Show this thread", "2020-02-28T23:10:11.000Z": "Today I had the opportunity to discuss Coronavirus preparedness in Florida with @VP Pence. I requested the Vice President help provide local testing kits, additional medical supplies & federal supplementation for those that may be held in isolation for an extended period of time.", "2020-02-27T20:57:42.000Z": "Today I signed HB 1087 removing the Florida Coalition Against Domestic Violence from statute. Floridians deserve greater accountability from their government, especially survivors. I commend Pres. @BillGalvano and Speaker @RepJoseOliva for taking swift action on this legislation.", "2020-02-21T20:09:44.000Z": "By pardoning the Groveland Four, the State of Florida recognized the miscarriage of justice that occurred in that case. By unveiling this monument, Lake County is pledging to remember this history and to pledge itself to stand for justice for all of its citizens.", "2020-02-20T23:45:42.000Z": "I was pleased to award the City of Green Cove Springs in Clay County with $250,000 through the Job Growth Grant Fund today. Details here - http:// bit.ly/2umbWFG", "2020-02-19T22:23:52.000Z": "Today, @MyFWC approved a 45-day Gulf Red #Snapper Season from June 11th-25th for Gulf state and federal waters. Gulf red snapper season is an exciting time for anglers and is just another reason why Florida remains the Fishing Capital of the World.", "2020-02-19T21:20:00.000Z": "We look forward to the positive impacts this program will have on the lives of our veterans and the communities in which they live.", "2020-02-19T21:19:59.000Z": "I'm excited to share my administration's newest veteran-focused initiative: the \"Salute Our Soldiers\" Military Housing Loan Program for veterans and active duty military personnel throughout the state. Details here - http:// bit.ly/2SYt903", "2020-02-19T20:50:31.000Z": "Today, it was my pleasure to announce that my administration is awarding the @cityofpensacola $4.8 million through the Florida Job Growth Grant Fund for infrastructure enhancements to @flypensacola . More here - http:// bit.ly/2SGtx4d", "2020-02-18T19:30:56.000Z": "Enjoyed celebrating #GatorDay at the Florida Capitol today with @GatorsFB Head Coach @CoachDanMullen . On top of an excellent football program, @UF is also the 7th ranked public university in the nation. The best is yet to come for the Florida Gators!", "2020-02-14T21:04:57.000Z": "Thank you to @SecElaineChao for coming to Miami to make this major announcement for our state's infrastructure. These grants will allow for critical expansion projects that are vital to the economic success of @PortMiami , @PortCanaveral and Florida overall. Quote Tweet Sec. Elaine Chao @SecElaineChao Happy to have him and @GovRonDeSantis join the event; $43.9 million won by PortMiami and $14.1 million to Port Canaveral.  Ports are vital to the economic prosperity of the country and regional economies. These investments will boost economic growth and create new jobs! Show this thread", "2020-02-14T15:46:31.000Z": "Our state and nation continue to mourn the innocent lives that were taken two years ago in a senseless act of violence at @MSDHighSchool . In memory of those lives lost, the Florida State Capitol has been lit all week in the MSD school colors.", "2020-02-12T18:52:50.000Z": "I'm pleased to launch the Northeast Florida FinTech Initiative in conjunction with Florida State College at Jacksonville and St. John's River State College. More info here - http:// bit.ly/2SDm5G2", "2020-02-07T21:58:39.000Z": "The tax credit scholarship program provides educational opportunities to more than 100,000 low-income families in Florida. I support these families and am glad to see @FifthThird continue to do so as well. Thanks for empowering parents and students!", "2020-02-06T15:42:03.000Z": "We are closely monitoring a strong cold front moving through North Florida. A tornado watch has already been issued this morning & more watches & warnings are expected throughout the day. Make sure to follow @FLSERT and local media for updates. Quote Tweet FL Division of Emergency Management @FLSERT Severe weather is expected in North and Central Florida today. The storms could bring minor flooding, power outages and tree damage. Be ready to seek shelter if a tornado warning is issued and have a plan in place for severe weather.", "2020-02-05T22:34:50.000Z": ". @FLCaseyDeSantis and I mourn the death of FHP Trooper Joseph Bullock of Troop L - Fort Pierce who was killed today in the line of duty. We are keeping the Bullock family, Troop L and our @FLHSMV family in our prayers. Quote Tweet FLHSMV @FLHSMV The entire Florida Highway Patrol and FLHSMV family mourns today for the loss of one of our own, FHP Trooper Joseph Bullock. Please keep his family and his team members in your prayers.", "2020-02-04T17:37:45.000Z": "Today, the Florida Cabinet and I approved two Florida Forever land acquisitions and agreed to acquire a conservation easement that will protect Florida's fragile natural environments in Manatee, Sarasota and Columbia counties. Info here - http:// bit.ly/395slNb", "2020-01-31T18:20:53.000Z": "Under the current circumstances, I believe moving the case under State Attorney King's jurisdiction provides the best chance for the Montalvo family to receive the justice they deserve.", "2020-01-31T18:20:52.000Z": "After review by my office and consultation with the Montalvo family, today I am issuing an executive reassignment of the Nicole Montalvo murder case to State Attorney Brad King of the Fifth Judicial Circuit. See Executive Order here - http:// bit.ly/3901JgP", "2020-01-30T21:41:00.000Z": "We have worked tirelessly to get recovery dollars to all areas impacted by Hurricane Irma and will continue to do so as quickly and efficiently as possible.", "2020-01-30T21:40:58.000Z": "Today, @FLDEO awarded more than $84 million to 21 communities impacted by Hurricane Irma through their Rebuild Florida Infrastructure Repair Program, which helps fund infrastructure restoration and improvements. See more here - http:// bit.ly/37JOh0m", "2020-01-30T21:13:17.000Z": "Today, I'm excited to help kickoff 100 Yards of Hope, a project by the veterans of @forceblueteam to plant 100 yards of coral while honoring the @NFL 's 100th season. I'm also proud to announce a new initiative to promote awareness and protection of Florida's Coral Reef ecosystem.", "2020-01-29T22:04:48.000Z": "I'm honored to be named a 2019 Rx Price Fighter by @AARP today on Florida Senior Day. I will continue to work to identify innovative ways to reduce health care costs for Floridians.", "2020-01-29T21:32:06.000Z": ". @FLCaseyDeSantis and I enjoyed taking time today to celebrate all the Emergency Management Directors throughout Florida at the first-ever Emergency Management Day at the Capitol.", "2020-01-29T14:34:08.000Z": "One month after taking office, I asked @fdlepio to develop & implement a threat assessment strategy to help prevent acts of targeted violence in FL - http:// bit.ly/37BjL8P . Today, I'm pleased to announce that FDLE & the statewide steering committee have completed that request.", "2020-01-29T00:09:43.000Z": "Honored to be at the @WhiteHouse with President @realDonaldTrump and @IsraeliPM Netanyahu for today's announcement of a strong, pro-Israel peace plan.", "2020-01-27T22:10:14.000Z": "Today, I'm pleased to announce my support for the Florida Civics and Debate Initiative with The Marcus Foundation to provide opportunities for Florida students to debate issues related to American civics. Info here - http:// bit.ly/3aJzep7", "2020-01-27T15:58:36.000Z": "On International #HolocaustRemembranceDay , we remember and honor the memory of the 6 million Jews whose lives were horrifically taken. Today and every day, we stand in solidarity with our Jewish communities in Florida and around the world.", "2020-01-24T21:12:11.000Z": "I'm proud to share that in December 2019, Florida's unemployment rate dropped to 3% - the lowest in our history. Florida remains the best state in the nation to find a job and start or grow a business. Details here - http:// bit.ly/2RFKjPe", "2020-01-23T21:31:56.000Z": "The crisis in Venezuela is a great concern to many Floridians and impacts the security of the United States. @SecPompeo was kind enough to visit us in Miami and listen to concerns from the Venezuelan exile community.", "2020-01-20T16:46:45.000Z": "Great to visit community leaders and celebrate #MLKDay in Gretna this morning. Thank you to Mayor Jeff McNealy and @GadsdenSheriff Morris Young for having me.", "2020-01-17T18:53:58.000Z": "My administration remains committed to supporting Florida's growing aerospace industry and maintaining an economic climate that allows companies like Made In Space to prosper. See more here - http:// bit.ly/2NCq83F", "2020-01-17T18:53:57.000Z": "I'm proud to announce that @MadeInSpace has decided to relocate their corporate headquarters from the highly-taxed, highly-regulated state of California, to the business friendly environment of Florida.", "2020-01-16T21:38:15.000Z": "This morning I dropped by to thank our hard-working Agency Chiefs of Staff for their tireless efforts and service to Florida. @GovRonDeSantis and I believe collaboration is key, and together we can continue to move the needle for our state and its citizens.", "2020-01-16T19:48:59.000Z": "This morning, I joined @FlChamber to discuss the important role businesses play in Florida's success. Government is only part of the solution. As part of my Hope for Healing initiative, I encourage business leaders to leverage local resources to make a difference.", "2020-01-16T19:23:17.000Z": "The results of @EnterpriseFL 's 2020 Florida Military and Defense Economic Impact Study are in: Florida's military and defense industry has a $95 billion economic impact, a $10 billion increase from the 2017 study. More info here - http:// bit.ly/3aixzH2", "2020-01-16T18:32:42.000Z": "I enjoyed touring @PortTampaBay with the facility's President and CEO Paul Anderson. Port Tampa Bay is Florida's largest port and is a pillar of our state's economy. The future is bright for the Tampa Bay area!", "2020-01-16T17:55:08.000Z": "I am pleased that @FLCourts confirms that Amendment 4 requires fines, fees & restitution be paid to victims before their voting rights may be restored. Voting is a privilege that should not be taken lightly, and I am obligated to faithfully implement Amendment 4 as it is defined.", "2020-01-16T13:58:40.000Z": "Yesterday, @FLCaseyDeSantis and I were honored to host @NASCAR leadership at the Governor's Mansion. NASCAR is a part of Florida's sporting DNA and a major economic engine generating thousands of jobs and injecting more than $1.6 billion annually into our economy.", "2020-01-15T22:39:03.000Z": "It was such a privilege to host legislative spouses today at the Governor's Mansion. As partners of those who serve in public office, we can not only provide support, but also use our voices to raise awareness and positively impact our great state.", "2020-01-15T21:24:09.000Z": "Enjoyed speaking at @FlChamber 's #FCCFlyIn20 today to discuss Florida's low taxes, reasonable regulatory climate and positive disposition toward business. Our state continues to thrive, and our business leaders continue to pave the way for Florida's success.", "2020-01-15T17:35:06.000Z": ". @FLCaseyDeSantis and I are keeping Officer Paul Dunn of Lakeland and his family in our prayers today. I have ordered flags to be flown at half-staff to honor his memory. A husband, a father and a veteran-Officer Dunn will always be remembered as a hero.", "2020-01-15T16:50:58.000Z": "I'm pleased to announce that @FLDEPNews has reached an agreement with Kanter Real Estate that will allow for the purchase of 20,000 acres of critical wetlands in the Everglades.", "2020-01-14T16:56:11.000Z": "In this season of opportunity, we can say there is more out there to achieve for our state - and there is no reason why we can't seize this moment and deliver for the people of Florida.", "2020-01-14T16:56:10.000Z": "For everything there is a season, and this is Florida's season of opportunity - we have the chance to build on a strong foundation, the chance to face the challenges before us and the chance to leave a legacy of success that will benefit our people now and in the future.", "2020-01-14T16:54:31.000Z": "Hurricane recovery has been a priority for my administration. In January of 2019, I asked @FLSERT to expedite reimbursements to affected areas & the agency has distributed more than $1.4 billion to communities impacted by hurricanes Michael, Irma, Matthew and Hermine.", "2020-01-14T16:50:19.000Z": "One major initiative was to provide access to cheaper prescription drugs by bringing in safe, name-brand drugs from foreign markets such as Canada. Same drug, just a much lower price.", "2020-01-14T16:48:49.000Z": "With the Speaker and President leading the way, the 2019 Legislative session witnessed major reforms in the area of health care - from expanding access to telehealth to repealing antiquated regulations.", "2020-01-14T16:45:23.000Z": "Results matter and accountability is needed. But the Common Core framework was clearly flawed.\n\nI can reveal that one key to our replacement of Common Core will be a renewed emphasis on American civics and the US Constitution.", "2020-01-14T16:42:22.000Z": "Last year, we had nearly 13,000 low-income families on the waiting list for a tax credit scholarship. Thanks to the enactment of the new Family Empowerment scholarship, these families have been liberated from the waiting list.", "2020-01-14T16:38:43.000Z": "Our approach to K-12 education rests on (1) recruiting and retaining great teachers, (2) promoting educational choice so parents, particularly low-income parents, can place their child in a good school, and (3) measuring results through accountability.", "2020-01-14T16:33:57.000Z": "Low taxes and a healthy business climate are important in attracting investment in Florida, but so too is our ability to produce top-flight talent - through our colleges and universities, through workforce education opportunities and through strong K-12 schools.", "2020-01-14T16:33:26.000Z": "We have strong momentum and need to keep it going. We have a chance to take bold action to make a lasting positive impact upon Florida's environment.  \n\nLet's seize this opportunity.", "2020-01-14T16:30:10.000Z": "When I took office, I issued a sweeping executive order outlining a bold approach to protecting our natural resources, improving water quality and restoring the Everglades.", "2020-01-14T16:29:11.000Z": "Florida must remain steadfast in its commitment to low taxes and fiscal responsibility. Maintaining fiscal health will provide the type of durable foundation required for the expansion of our economic base, which means more opportunities for the people of Florida.", "2020-01-14T16:28:12.000Z": "While we should look with favor on these bold beginnings, we have much more to do.", "2020-01-14T16:26:57.000Z": "In 2019, we took bold steps to expand educational opportunities, protect our environment and natural resources, reform health care, invest in infrastructure and bolster public safety - all while reducing taxes and adding to our budget reserves.", "2020-01-14T16:23:21.000Z": "It brings me great satisfaction to report on the promising prospects of our public affairs and to commend the members of the House and Senate for your efforts to make Florida successful.", "2020-01-13T23:14:35.000Z": "Tomorrow I will deliver the State of the State address to a joint session of the Florida Legislature & Floridians everywhere. I look forward to a successful legislative session & working to ensure a brighter, better future for all. \n\nWatch my address live on the @floridachannel .", "2020-01-13T18:57:06.000Z": "Thank you @Jaxhealth for hosting me this morning! So many are impacted by the opioid crisis that has taken hold in our state. It's programs like #ProjectSaveLives that continue to advance meaningful solutions for those suffering.", "2020-01-13T19:17:55.000Z": "I'm pleased to hear @DollarTree will be opening a new distribution center in Marion County. This center is projected to create 600 jobs with a capital investment that is estimated to surpass $200 million: a big win for both Marion County and Florida.", "2020-01-13T15:56:03.000Z": "I thank Chairman John Rood and the @FloridaPrepaid College Board for their work and leadership. This price reduction is great news for hardworking Florida families looking to invest in their children's future.", "2020-01-13T15:56:02.000Z": "Today I announced that @FloridaPrepaid will lower Prepaid Plan prices by $1.3 billion, a reduction benefitting 224,000 current customers. See details here - http:// bit.ly/2QMz60f", "2020-01-11T15:24:09.000Z": "As severe weather approaches our state today, every resident in NW FL should be prepared for heavy rain, strong winds, and be ready to seek shelter if a tornado warning is issued. Follow @FLSERT and local media for updates.", "2020-01-10T21:08:04.000Z": "We are closely monitoring a strong cold front with @FLSERT that is expected to bring severe weather to Northwest Florida tomorrow. This system is capable of producing tornadoes & strong winds of more than 60mph. Make sure you have a plan & take any watches & warnings seriously.", "2020-01-10T20:24:03.000Z": "Today kicks off the 2020 #PythonBowl , where participants will head into the Everglades to remove invasive Burmese pythons. More info here - Florida Python Challenge™ 2020 Python Bowl Kicks Off in South Florida content.govdelivery.com", "2020-01-10T18:47:01.000Z": "Hurricane Michael left devastating impacts throughout NW FL and communities are still trying to rebuild. Today I announced over $5 million through @FLDEO 's Rural Infrastructure Fund to help these communities recover. Details here - http:// bit.ly/37VyL16", "2020-01-10T18:17:11.000Z": "One year ago today I signed Executive Order 19-12 to implement major environmental reforms. See the EO here - http:// bit.ly/2T90pU8", "2020-01-09T20:47:23.000Z": "We are forever indebted to the men and women who answer the call of duty and put their lives on the line by running into harm's way. Today, we recognize the sacrifice you and your families make every day to keep us safe. #LawEnforcementAppreciationDay", "2020-01-09T20:29:07.000Z": "One year ago, I named Barbara Lagoa to @FLCourts - the first Cuban-American woman to serve on FL's highest bench. Today, she serves on the @USCourts", "2020-01-09T19:47:12.000Z": ". @SpiritAirlines is a major job creator for our state, & we are excited that they have chosen to expand their FL footprint with a new corporate campus. Today's groundbreaking is just another indication that Florida remains the best state in the nation to start or grow a business.", "2020-01-09T17:26:18.000Z": ". @FLCaseyDeSantis and I send our sincerest condolences to @JimmyPatronis and @katiepatronis for the passing of Jimmy's father, Jimmy Patronis, Sr. You and your family are in our thoughts and prayers during this difficult time. Quote Tweet Jimmy Patronis @JimmyPatronis It's with a heavy heart that I share that my father peacefully passed away this morning surrounded by our family. While funeral arrangements and further details aren't available at this time (1/3) Show this thread", "2020-01-09T13:22:17.000Z": "Great news for Florida's education system - the graduation rate continued to increase last year, climbing to 86.9%, & has risen over 27% since 2003-04. I applaud FL's students, parents & educators for their hard work that lead to these positive results. http:// bit.ly/37MejzB", "2020-01-08T19:09:32.000Z": "One year ago today, I took the oath of office to become Governor of this great state. It's an honor to work every day on behalf of Floridians and I look forward to our continued efforts to create a bolder, brighter, better future for all.", "2020-01-07T22:01:34.000Z": "It was great to be joined by @SpaceFlorida President Frank DiBello as well as @EnterpriseFL President @JamalSowell to confirm my administration's commitment to promoting opportunity zones in the Melbourne area.", "2020-01-07T18:35:50.000Z": "Enjoyed the great opportunity to speak at the @FloridaChiefs 2020 Mid-Winter Training Conference in Orlando. @FLCaseyDeSantis and I stand with and extend our highest gratitude to the men and women in blue for their efforts to keep Florida safe day in and day out. Quote Tweet Chief Todd Garrison @NPPDPoliceChief @GovRonDeSantis speaking to the @FloridaChiefs this morning in Orlando. We @NorthPortPolice appreciate the Governor's continued support of law enforcement.", "2020-01-06T22:26:59.000Z": "The U.S. Constitution mandates a national census count be conducted every 10 years and Florida will do its part to support the federal government's efforts. Therefore, today I announced the designation of Florida's 2020 Census Statewide Complete Count Committee.", "2020-01-03T20:53:19.000Z": "I'd like to thank Caylor Branham, an extraordinary young man, as well as his mother @Mbranham27, for designing and creating these signs to spread awareness for Floridians living with dementia and their caregivers. #ENDALZ", "2020-01-03T19:54:06.000Z": "In the first week of this new year alone, @FLSERT has awarded nearly $29M in hurricane recovery dollars. In 2019, we awarded more than $1.4B in hurricane recovery dollars & we remain steadfast in our commitment to hurricane recovery in 2020. Info - https:// bit.ly/2MRiIcz", "2020-01-02T18:36:45.000Z": "I am pleased to announce more than $5.2M is being awarded to small and rural FL communities to improve infrastructure. We will continue to invest in our state's infrastructure to help attract new businesses and create opportunities for residents. Info - https:// bit.ly/36kKwgS", "2020-01-01T14:37:47.000Z": "The DeSantis family would like to extend a Happy New Year to all. I am proud of what we were able to accomplish this past year and look forward to an even more successful year in 2020. Wishing everyone a safe and Happy New Year!", "2019-12-31T16:20:14.000Z": ". @FLCaseyDeSantis and I are looking forward to attending today's matchup between @FSUHoops and @GTMBB . #GoNoles  #MarchOn", "2019-12-31T04:46:31.000Z": "Well-earned victory for @GatorsFB over @UVAFootball to bring home the 86th @OrangeBowl trophy. Congratulations to the Florida Gators for ending a great season with a hard-fought win! #GoGators", "2019-12-26T15:33:33.000Z": "Congratulations to @amazon on its newest distribution center in Florida. This $100 million investment will create 500 jobs for the community and is great news for Volusia County. Florida continues to be the best state in the nation to start or grow a business.", "2019-12-25T13:20:44.000Z": ". @FLCaseyDeSantis and I would like to wish everyone a Merry Christmas! We should use this day to spend time with family and loved ones. From our family to yours, have a wonderful day and God bless!", "2019-12-23T23:46:25.000Z": "The @GasparillaBowl did not disappoint, as @UCF_Football takes the contest over @HerdFB . Big win and a great way to end the season for UCF over a tough Marshall opponent. #ChargeOn", "2019-12-23T14:15:40.000Z": "In conjunction with the Florida Legislature and our federal, state and local partners, we were able to secure major successes for the environment, education, hurricane recovery, economic development, public safety, military, health care and much more - http:// bit.ly/376AK2b", "2019-12-23T14:15:39.000Z": "", "2019-12-22T17:22:13.000Z": ". @FLCaseyDeSantis and I would like to extend our warm wishes for a very Happy Hanukkah. May the bright lights of the menorah usher in a joyous holiday and 2020 for all our Jewish celebrants across the state of Florida.", "2019-12-21T23:50:32.000Z": "Huge win! Congrats to @UWFFootball on the incredible season and their first national championship. #GoArgos Quote Tweet UWF @UWF For the the first time in program history, @UWFFootball are @NCAADII National Champions!  #GoArgos", "2019-12-21T15:06:43.000Z": "Good luck to @UWFFootball today as they face off against @MinnStFootball in the @NCAADII national championship! #GoArgos", "2019-12-21T13:28:45.000Z": "Earlier this year, I joined @MarcoRubio and @SenRickScott in requesting $200 million from President @RealDonaldTrump in Everglades restoration funding. \n\nThe President answered the call, signing the federal spending bill into law that includes this important investment.", "2019-12-21T01:28:16.000Z": "Thank you to President @realDonaldTrump for signing the 2020 National Defense Authorization Act into law, which includes critical investments for @TeamTyndall and military families across our state and nation. See my letter to the President below", "2019-12-20T21:12:48.000Z": ". @GovRonDeSantis and I are excited to announce the theme for Black History Month in February will be \"Celebrating Untold Stories and Contributions of African Americans in Florida.\"", "2019-12-20T20:46:43.000Z": "Some pretty amazing kids got an early Christmas present from @SpiderMan . These kids are the real superheroes and @FLCaseyDeSantis and I enjoyed spending time with them today.", "2019-12-20T18:52:55.000Z": "Today, @FLCaseyDeSantis and I were joined by @SpiderMan to wish these kids Happy Holidays as we handed out comic books at @Nicklaus4Kids and @Nemours Children's Hospitals.", "2019-12-20T17:10:23.000Z": "I'm proud to announce the Florida Talent Development Council has submitted their plan to further develop Florida's workforce. Ensuring that Floridians are prepared for the jobs in the 21st century is vital to the future success of our state. Details here - http:// bit.ly/2PZbEeo", "2019-12-20T15:33:37.000Z": "I am pleased to announce that Florida's Reemployment Tax Rate continues to remain at the lowest possible rate of 0.1 percent - far below the national average. More here - http:// bit.ly/2ZfqEcr", "2019-12-20T15:03:51.000Z": "My administration is committed to the success of this state and all Floridians. Moving forward, I will continue to prioritize investments in Florida's workforce and infrastructure to provide opportunities for our communities to be resilient and prepared for the future.", "2019-12-20T15:03:50.000Z": "Florida continued to experience positive economic indicators throughout 2019, including a consistently low unemployment rate. Though we have had a successful year, the state of Florida will not rest on our laurels. Details here - http:// bit.ly/2ScUUmY", "2019-12-20T13:31:29.000Z": "Fantastic morning watching the mission launch of the @BoeingSpace Starliner spacecraft - the first American commercial spacecraft to be built right here in Florida. I will continue to provide my full support to our exciting and nation-leading aerospace industry.", "2019-12-19T22:38:54.000Z": "With the support from leaders like President @realDonaldTrump and Secretary @BetsyDeVosED , we are working every day to ensure that the many families, educators and students impacted by Hurricane Michael fully recover.", "2019-12-19T22:38:53.000Z": "In addition to the funding we announced earlier today, Florida has been awarded $63.2 million in federal disaster assistance through @usedgov to restore educational programs in counties affected by Hurricane Michael. More info here - http:// bit.ly/2s6gxdL", "2019-12-19T20:50:57.000Z": "Since day one, @GovRonDeSantis & I have made it a priority to ensure the good people of Northwest Florida are not forgotten. Today, more than $20 million was awarded to the counties ravaged by Hurricane Michael. Quote Tweet Ron DeSantis @GovRonDeSantis Today, I am proud to announce that I am awarding more than $20 million to communities in Northwest Florida for Hurricane Michael recovery through the Hurricane Michael State Recovery Grant Program. Show this thread", "2019-12-19T20:36:31.000Z": "Today, I am proud to announce that I am awarding more than $20 million to communities in Northwest Florida for Hurricane Michael recovery through the Hurricane Michael State Recovery Grant Program.", "2019-12-19T18:08:34.000Z": "This morning, I announced awards of $1.3 million in Calhoun County and $2.4 million in Gadsden County through the Hurricane Michael State Recovery Grant Program. We will be announcing more awards in Bay County this afternoon.", "2019-12-18T16:38:23.000Z": "With the support of the Florida Legislature, I will continue to work to identify innovative ways to reduce health care costs for Floridians. More info here - http:// bit.ly/35Ge7Bq", "2019-12-18T16:38:22.000Z": "Today I was joined by @HHSGov  @SecAzar and @HHS_ASH Dr. Brett Giroir to announce the advancement of the Trump Administration's plan to allow for safe and affordable prescription drug importation from Canada to multiple states, including Florida.", "2019-12-18T14:33:41.000Z": "I am pleased to be with @HHSGov  @SecAzar today in Tallahassee to share the details of this historic announcement. We are delivering on our promise to lower the exorbitant cost of prescription drugs for Florida residents. Quote Tweet Secretary Alex Azar @SecAzar I look forward to joining @GovRonDeSantis later this morning to  discuss this historic announcement. twitter.com/SecAzar/status", "2019-12-17T21:36:12.000Z": "Great work from @fdlepio 's Genetic Genealogy Team. By utilizing the power of genetic genealogy to solve cases and deliver justice to victims and their families, we are taking another positive step forward in keeping our communities safe and secure. Quote Tweet FDLE @fdlepio Nice Job!  FDLE's Genetic Genealogy team identified this suspect in two Florida violent sexual assaults from 1998, one in Pinellas County and the other in Venice. https:// mysuncoast.com/2019/12/16/dna -leads-arrest-armed-sexual-assault-case-venice/ ", "2019-12-17T20:42:45.000Z": "At @MyFLFamilies Child Protection Summit, I highlighted my administration's ongoing efforts to support our vulnerable citizens, including a recommended increase of over $97 million for services to children and families in our child welfare system.", "2019-12-17T20:41:53.000Z": "It's an honor and privilege to work with state and community leaders to better serve Florida's children.", "2019-12-17T20:41:52.000Z": "I was honored to speak today @MyFLFamilies Child Protection Summit. The impact these child welfare advocates have on some of the most vulnerable citizens in our society cannot be understated nor undervalued.", "2019-12-17T16:35:34.000Z": "In recognition of the hard work and dedication of state employees in 2019, I'm happy to announce that state offices will be closed on December 24th and 31st. @FLCaseyDeSantis and I extend our thanks and best wishes to state employees and their families this Holiday Season.", "2019-12-16T19:37:36.000Z": "It is imperative that judges understand the importance of their work on the bench, which does not include legislating from the bench. I'm confident that each of these appointees understand the proper role of the courts and will faithfully uphold the rule of law.", "2019-12-16T19:37:35.000Z": "Today, I am pleased to appoint Judges Ramiro Areces, Christina DiRaimondo and Robert Watson to the 11th Circuit @MiamiDadeCourts . I am also appointing Judges Elisabeth Espinosa, Julie Harris Nelson, Miesha Darrough and Ayana Harris to the Miami-Dade County Court.", "2019-12-16T13:01:47.000Z": "I was honored to receive the Zionist Hero Award at @ZOA_National 's Heroes for Israel Dinner. I will continue to work to strengthen Florida's long-standing relationship with Israel as well as combat anti-Semitism and discrimination against our Jewish communities.", "2019-12-13T23:11:25.000Z": "Today the @Florida_Housing Finance Corporation board of directors unanimously approved nearly $150 million in funding for 23 developments in hurricane-impacted counties in Florida.", "2019-12-13T17:53:19.000Z": "We are doing everything we can to expedite Everglades and Florida Bay restoration. Removing 5.5 miles of Old Tamiami Trail roadbed is another big step forward to send more water south into Everglades National Park, where it is needed. More info here - http:// bit.ly/2POjpEe", "2019-12-12T20:30:43.000Z": "Finally, I was proud to present my first \"Courage, Commitment and Compassion\" awards today to Yolanda Driskell and Jacob Iasevoli. Like Yolanda and Jacob, we should all aspire to perform acts of kindness throughout our daily lives. More info here - http:// bit.ly/2rHYLgJ", "2019-12-12T20:25:37.000Z": "Through our new H.O.P.E. Innovators program, led by @EducationFL 's Dr. Eric Hall, we will identify ways to connect students and their parents with resources and information so they can get meaningful support to lead happy and healthy lives.", "2019-12-12T20:25:35.000Z": "Hope Ambassadors will be comprised of young men and women who understand that simple acts of kindness and compassion can instantaneously change the trajectory of their fellow students' well-being.", "2019-12-12T20:25:34.000Z": "I am honored to announce three new initiatives which aim to deliver meaningful support to our schools. As I've traveled across the state, I've had the honor of meeting some amazing kids who have inspired me to create \"Hope Ambassadors.\"", "2019-12-12T17:52:09.000Z": "Home of the @BlueAngels , @NASPCOLA is important to the identity of our state. I've requested the Florida Historic Capitol be lit blue from December 9-15 to honor and stand with the Pensacola community following last week's tragedy.", "2019-12-12T00:01:46.000Z": "I'm pleased that the @flcourts Statewide Grand Jury has issued their 2nd interim report identifying recommendations to improve school safety. I look forward to working with the Legislature this session to review these recommendations. Report here - http:// bit.ly/348zbyR", "2019-12-11T22:04:48.000Z": "I commend President @realDonaldTrump for signing an executive order to combat anti-Semitism and the BDS Movement on college campuses. In Florida, we will continue to fight discrimination and stand with the Jewish community against all its forms.", "2019-12-11T19:25:41.000Z": "Florida is committed to protecting the integrity of voter rolls and preventing election fraud. As a member of ERIC, Florida is now equipped with more tools to further ensure accurate voter rolls, make voting easier & reduce costs to taxpayers. More here - http:// bit.ly/36pZCkX", "2019-12-11T18:52:02.000Z": ". @FLCaseyDeSantis and I are saddened to hear of the passing of John Broxson, a great public servant for the people of Northwest Florida. We send our heartfelt condolences to his brother, Senator @DougBroxson , as well as his entire family and friends. Quote Tweet PNJ @pnj John Broxson, a former state legislator, Santa Rosa County sheriff and county commissioner, has died at the age of 87. https:// pnj.com/story/news/201 9/12/10/longtime-santa-rosa-county-politician-john-broxson-dies-age-87/4380817002/ ", "2019-12-10T23:23:24.000Z": "Daily, our first responders are exposed to the most tragic side of humanity. We owe it to the men & women who protect us every day to make sure they know of available services so they can seek meaningful help.", "2019-12-10T23:20:12.000Z": "This afternoon, I sat down with Florida's first responder leaders to discuss how we can better support the emotional health of law enforcement, firefighters & emergency medical responders.", "2019-12-10T22:11:17.000Z": "Today, I directed @EducationFL to develop a program that increases civics education throughout our classrooms, including a civics examination for all 12th grade students in Florida. Quote Tweet Florida Department of Education @EducationFL Today, @GovRonDeSantis and Comm. @RichardCorcoran announced a new initiative that will prepare #Flstudents to become civically-minded, life-long learners. WATCH NOW: http:// bit.ly/357pvWE  #FlEdu  #civics", "2019-12-10T20:33:32.000Z": "Congratulations to @FLOIR_comm Commissioner David Altmaier for being voted president-elect of the @naic . As one of the largest insurance markets in the world, it is vital for Florida to have a leading role in state, national & global regulatory discussions. Quote Tweet Florida Insurance Regulation @FLOIR_comm Today, the National Association of Insurance Commissioners @NAIC voted Florida Insurance Commissioner David Altmaier as their 2020 President-Elect. https:// bit.ly/2LGIFL0", "2019-12-10T18:04:20.000Z": "Great news - @realDonaldTrump granted my request to add Broward & Volusia counties to the Hurricane Dorian Major Disaster Declaration. Both counties are now eligible for 75% federal reimbursement on Dorian costs, which totaled over $10M for @BrowardCounty & $2.5M for @VCNewsInfo .", "2019-12-09T22:47:34.000Z": "In the spirit of the holidays, the Cabinet brought toys to benefit children served by the Big Bend Community, including those still recovering from Hurricane Michael. I'm grateful to the members for opening their hearts & being so generous.", "2019-12-09T22:47:33.000Z": "To really change the scope & scale of how we reach & support struggling youth, we will focus on the current-situation data & statistics surrounding youth suicide prevention & research the best & most-promising prevention efforts.", "2019-12-09T22:47:32.000Z": "I am excited to announce the Florida Children & Youth Cabinet, in its unique position to create a new model for addressing youth suicide, will be zeroing in on strong mentorship programs. More details here - http:// bit.ly/38neUZD", "2019-12-09T19:59:49.000Z": "Thank you @realDonaldTrump for inviting me to speak at the White House today to discuss school choice. Since taking office, we've secured significant victories for students and parents, and we look forward to continuing this positive momentum in the upcoming legislative session.", "2019-12-09T19:46:54.000Z": "To honor our nation's fallen heroes and those who continue to bravely serve, we lay a @WreathsAcross Remembrance Wreath at the Florida State Capitol today. On this day, and every day, we promise to never forget and to continue to teach our youth the value of our freedom.", "2019-12-08T23:40:00.000Z": "When tragedy strikes, Floridians stand together. As Governor I will do all that I can to assist law enforcement in bringing these criminals to justice.", "2019-12-08T23:39:59.000Z": "Today I returned to @NASPCOLA to receive a briefing and updates from the @FBI , @USNavy and @ECSONews regarding Friday's shooting. @FLCaseyDeSantis and I also visited Baptist Hospital to meet with those who were wounded and thank them for their bravery and service to our nation.", "2019-12-07T13:44:22.000Z": "The attack on Pearl Harbor remains a day that lives in infamy. Bearing in mind the horrific attacks on two naval bases this week, I encourage all to observe today as Pearl Harbor Remembrance Day & honor those who died in defense of our freedom. God bless the @USNavy and America.", "2019-12-06T21:47:12.000Z": "In honor and remembrance of the victims of today's shooting at @NASPCOLA , I have directed the flags of the United States and the State of Florida to be flown at half-staff immediately and remain at half-staff until sunset on Friday, December 13.", "2019-12-06T21:37:42.000Z": "The response we saw from the deputies at @ECSONews and active personnel responding to the scene is commendable and lives were saved because of the bravery of those wearing the uniform of the @USNavy and LEOs, including from those who were wounded and still helped others.", "2019-12-06T21:37:41.000Z": "We are praying hard for the victims and families impacted by today's shooting at @NASPCOLA . As a Navy veteran, today hits especially close to home. @NASPCOLA is a special place and these brave warriors come here for flight training to protect and serve our great nation.", "2019-12-06T18:34:34.000Z": "I just spoke with President @realDonaldTrump regarding the shooting at NAS Pensacola and he reiterated his full support for our state during this tragedy. Quote Tweet Donald J. Trump @realDonaldTrump Just received a full briefing on the tragic shooting at NAS Pensacola in Florida, and spoke to @GovRonDeSantis . My thoughts and prayers are with the victims and their families during this difficult time. We are continuing to monitor the situation as the investigation is ongoing.", "2019-12-06T16:22:09.000Z": "I have spoken with NAS Pensacola Base Commander Timothy Kinsella and @ECSONews Sheriff David Morgan.\n\n. @FLSERT is also deploying Florida's Disaster Recovery Mental Health Coordinator to coordinate mental health resources for families impacted by this tragic shooting.", "2019-12-06T15:34:53.000Z": "We are deeply saddened by the tragic events at NAS Pensacola and we pray for all the victims and their families during this difficult time.", "2019-12-06T13:56:51.000Z": "We are actively monitoring the shooting that occurred this morning at Naval Air Station Pensacola. We are receiving updates from @fdlepio Commissioner Swearingen and offering our full support to law enforcement.", "2019-12-05T20:39:05.000Z": "I'm proud to announce that we have been able to work with @fema to secure more than $15 million in low-interest Community Disaster Loans that will provide much needed relief to the Northwest Florida communities who are still working hard to rebuild.", "2019-12-05T17:26:00.000Z": "The Python Bowl is part of our ongoing efforts to remove these invasive species which are wreaking havoc in South Florida, particularly in the Everglades. More info on the Python and how to participate here - http:// bit.ly/2Pi3j5b", "2019-12-05T17:25:59.000Z": "I am pleased to announce the launch of Florida's 2020 Python Bowl to remove invasive Burmese Pythons from the wild. The Python Bowl, which is now open for registration, is a joint effort with the @MIASBLIV Host Committee - with the big game being played in Miami on February 2nd.", "2019-12-04T23:02:48.000Z": "I enjoyed speaking at @evergfoundation 's town hall to discuss my administration's efforts to restore the Everglades & improve water quality. This has been a historically successful year for FL's environment & we will continue to invest in a better tomorrow for future generations.", "2019-12-03T21:59:07.000Z": ". @FLCaseyDeSantis and I are saddened to learn of the passing of Georgia Hatfield Carnley who was the receptionist for Governor Chiles, Governor McKay and Governor @JebBush . Georgia exemplified grace through public service and we extend our condolences to her family.", "2019-12-03T21:33:55.000Z": "Thank you President @realDonaldTrump and @HUDgov Secretary Carson for announcing an additional $326 million in funds to areas impacted by both Hurricanes Michael and Irma. Thanks to your continued commitment, we have secured more than $735 million for Northwest Florida alone.", "2019-12-03T21:23:44.000Z": "Enjoyed attending @FloridaTaxWatch 's 40th anniversary meeting today in Palm Beach. It's clear that Florida's low taxes, reasonable regulatory climate and overall positive disposition toward business and success is working. It's a great time to do business in Florida.", "2019-12-03T17:19:23.000Z": "Congratulations to @FLHSMV 's FHP Corporal Mithil Patel for receiving the 2019 Trooper of the Year award for heroic action in service and protection. Your recent promotion is duly deserved.", "2019-12-03T15:47:00.000Z": "This morning @FLCaseyDeSantis , Madison, Mason and I joined Cabinet members @AGAshleyMoody , @JimmyPatronis and @NikkiFriedFL to commemorate the beginning of the holiday season with a Christmas tree lighting at the Florida Capitol. Happy holidays to all!", "2019-12-03T14:23:15.000Z": "Although hurricane season is over, our state continues to recover from recent storms. With that said, I'm pleased to announce more than $44 million in awards to 11 communities through @FLDEO 's Rebuild Florida program. More info here - http:// bit.ly/2LeTXpK", "2019-11-30T18:09:45.000Z": "The rivalry of FSU-UF is one of college football's best and gives the winning team and fanbase a year of bragging rights. Good luck to both @FSUFootball and @GatorsFB as they battle it out tonight at the Swamp. #OneTribe  #GatorNation", "2019-11-30T14:06:39.000Z": "Florida's small businesses are the lifeblood of our economy, which is why I am pleased to recognize today as #SmallBusinessSaturday . My administration will continue to support small businesses by reducing government costs and interference whenever possible.", "2019-11-28T16:46:17.000Z": ". @FLCaseyDeSantis and I were grateful to serve others a classic Thanksgiving meal today at @AmericanLegion . Thank you to the volunteers who gave their time to share with their neighbors on this day of giving.", "2019-11-28T13:16:33.000Z": ". @FLCaseyDeSantis and I would like to wish everyone a Happy Thanksgiving. We have so much to be thankful for this year, and we appreciate the support we have received. We hope your day is filled with good times with family, food and football.", "2019-11-26T18:41:06.000Z": "With the holiday season here, it's vital to remember to remain safe while traveling. Thanksgiving is great to give thanks surrounded by family and friends, but it's important to #ArriveAlive . Follow @FLHSMV for more updates and safety tips. Quote Tweet FLHSMV @FLHSMV Almost 2.9M Floridians will be traveling for #Thanksgiving this week! No matter which beautiful FL destination you're going to, allow plenty of time to get there safely. #TravelSafeFL  @VISITFLORIDA  @CityofTLH Show this thread", "2019-11-25T20:11:23.000Z": "Today, I am proud to sign two executive orders: one to extend the Hurricane Michael State of Emergency and one to expand early voting in Bay and Gulf counties. More details here - http:// bit.ly/2KTAKtE", "2019-11-25T19:47:46.000Z": "The Declaration allows for 75% federal reimbursement for costs incurred preparing for and responding to the storm-assistance that both Broward and Volusia qualify for and need. I appreciate @FEMA 's consideration of my request and look forward to their response.", "2019-11-25T19:28:24.000Z": "Yesterday I wrote a letter to @FEMA appealing their decision to exclude Broward and Volusia counties from the Major Disaster Declaration for Hurricane Dorian. http:// bit.ly/2OhK8cs", "2019-11-25T18:13:36.000Z": "I trust the Legislature will act swiftly in the 2020 Legislative Session and pass an E-Verify requirement for employers in this state to protect Florida workers, preserve the rule of law, and make our communities safer. More here - http:// bit.ly/2DhRFSg", "2019-11-25T18:13:35.000Z": "Today, I was joined by Sen. @JoeGruters and Rep. @CordByrd to call on the Florida legislature to pass E-Verify legislation that will ensure a safe and legal labor market in Florida. We cannot continue to wait for important reforms of our state laws on immigration.", "2019-11-23T16:39:27.000Z": ". @FLCaseyDeSantis and I are excited to head down to Orlando today for the @FLBlue  @FloridaClassic between @FAMUAthletics and @BCUGridiron . This annual matchup between these two HBCUs is one of our state's best rivalries and is sure to be a great game.", "2019-11-22T21:15:09.000Z": "Thank you President @realDonaldTrump for helping Florida lower the cost of prescription drugs. Quote Tweet Donald J. Trump @realDonaldTrump . @SecAzar and I will soon release a plan to let Florida and other States import prescription drugs that are MUCH CHEAPER than what we have now! Hard-working Americans don't deserve to pay such high prices for the drugs they need. We are fighting DAILY to make sure this HAPPENS... Show this thread", "2019-11-22T19:20:22.000Z": "Happy 3rd birthday to our sweet Madison! @GovRonDeSantis and I love watching you grow into such an independent girl with a heart of gold. We can't wait to see you be a big sister again this spring.", "2019-11-22T18:28:59.000Z": "By commemorating Missing Children's Day, we honor the families who have suffered this unthinkable pain and raise awareness for children who are currently missing.", "2019-11-22T18:17:43.000Z": "By standing together, working together, and praying together, we are a powerful and unstoppable force and we will continue to bring more children home.", "2019-11-22T18:17:42.000Z": "Today, I joined @fdlepio Commissioner Rick Swearingen and law enforcement personnel, public officials and citizens to remember Florida's missing children and recognize the efforts we are taking to educate Floridians on child safety and abduction prevention.", "2019-11-22T18:04:29.000Z": "Thank you to the U.S. @DeptVetAffairs , @FLVetsAffairs Executive Director @DannyBurgessFL and Congressman @RepRutherfordFL for your hard work and dedication to Florida's veterans. Without your strong support, this project would not be possible. More here - http:// bit.ly/2QEaIyh", "2019-11-22T18:04:28.000Z": "The groundbreaking and establishment of St. Augustine's Community Based Outpatient Clinic has been a long time coming, and I'm honored to take part in the healing and continued support for this community's veterans.", "2019-11-22T17:41:52.000Z": "Congrats to Jacksonville's @AnheuserBusch Brewery on its 50th anniversary. In addition to creating jobs for Floridians, we're grateful for the emergency drinking water Anheuser-Busch provides in times of need and all you do for Florida. Cheers to 50 years!", "2019-11-21T20:36:41.000Z": "We will continue to embrace advancements in autonomous and connected vehicles so that Florida can lead the nation in innovative transportation solutions. #2019FAVSummit", "2019-11-21T20:36:40.000Z": "In my address to industry leaders this morning at the 7th annual Florida Automated Vehicles Summit, I discussed my continued commitment to make Florida the number one state in the country for transportation technology.", "2019-11-20T20:18:19.000Z": "Today, I am glad to award multiple Florida institutions the Florida Pathways to Career Opportunities Grant. By investing in workforce education and apprenticeship programs, we are ensuring Florida's students will have new opportunities and career paths.", "2019-11-20T17:07:52.000Z": "Congratulations to Justice Barbara Lagoa, who just received confirmation by the U.S. Senate to serve on the 11th Circuit federal appeals court. Justice Lagoa has been a trailblazer in Florida and will be a great federal judge.", "2019-11-20T14:31:04.000Z": "Great news - @amazon has chosen Auburndale as the location for a new distribution center, creating 500 new jobs in the area. This investment is a big win for Polk County and our entire state, and we look forward to the economic benefits it will bring to the community.", "2019-11-19T20:02:26.000Z": "Congratulations to Justice Robert Luck on earning Senate confirmation to sit on the US Court of Appeals for the Eleventh Circuit. Justice Luck has served the state of Florida well and will continue his great work as a federal appeals court judge.", "2019-11-19T17:55:44.000Z": "I'd like to congratulate @MayoClinic and @Hitachi_US on this major investment that will better serve Florida's cancer patients who need complex care. I look forward to seeing the groundbreaking research and discoveries that will be made here through this important collaboration. Quote Tweet Mayo Clinic @MayoClinic Mayo Clinic, @Hitachi_US Ltd. to build first carbon ion therapy treatment facility in North America. https:// mayocl.in/2CU4B0J", "2019-11-18T23:27:10.000Z": "When I visited Israel in May, I was the first Florida governor to cross the \"green line\" into Judea and Gush Etzion as I promised to be the most pro-Israel governor in the U.S. I", "2019-11-18T21:26:36.000Z": "On National Adoption Day, courts and communities come together to finalize thousands of adoptions. @MyFLFamilies Secretary Chad Poppell and I had the great honor of congratulating some of those families today.", "2019-11-18T15:15:18.000Z": "This budget places an emphasis where it is needed, making key investments in our K-12 education system, our environment and the well-being of all Florida families. Florida's future has never been bolder, brighter or better than it is today.", "2019-11-18T15:13:01.000Z": "Ensuring free and fair elections is crucial in preserving our democracy. That is why the budget recommends $6.6 million for state-level election oversight activities, with a focus on cybersecurity enhancements to Florida's election system.", "2019-11-18T15:13:00.000Z": "Earlier this year I directed @fdlepio to develop a statewide threat assessment strategy. In my budget, I am proud to include $4.7 million and 20 positions to implement the first Statewide Behavioral Threat Assessment strategy in the country.", "2019-11-18T15:11:16.000Z": "Hurricane recovery has been a top priority for my administration. The State of Florida is projected to spend over $1.9 billion on hurricane preparedness and recovery for the two most recent hurricanes to make landfall in Florida - Irma and Michael.", "2019-11-18T15:11:15.000Z": "Despite our strong economy and low unemployment, finding affordable housing can be challenging. My budget provides $387 million to fully fund Workplace and Affordable Housing Programs, with $267.2 million for the SHIP and $119.8 million for the SAIL program.", "2019-11-18T15:09:54.000Z": "The well-being of our children is paramount, which is why we invest $97.6 million to fund services to children and families who rely on Florida's child welfare system. This includes $75.7 million for improving and enhancing quality within the current system.", "2019-11-18T15:09:11.000Z": "My proposed budget also includes more than $17 million in new mental health and substance abuse funding, as well as an additional $25 million - for a total of $100 million - for mental health initiatives in Florida's schools.", "2019-11-18T15:09:10.000Z": "We are determined to find meaningful solutions to the substance abuse and mental health challenges facing our state. My budget recommends over $54 million to continue the fight against opioid abuse in Florida.", "2019-11-18T15:07:58.000Z": "The budget continues our important focus on the environment, recommending more than $625 million in recurring funding for Everglades restoration and the protection of our vital water resources, moving us closer to our goal of investing $2.5 billion over four years.", "2019-11-18T15:05:39.000Z": "In addition to this minimum salary increase, I'm proposing $300 million to implement the Florida Classroom Teacher Bonus and Florida School Principal Bonus programs to reward our high-performing educators.", "2019-11-18T15:04:11.000Z": "I believe that all students in Florida should have the opportunity to receive a high-quality education. In K-12 public schools, my budget proposes an increase in per student funding of $7,979, or $302 per student.", "2019-11-18T15:02:55.000Z": "To relieve Floridians' tax burden, my budget proposes over $312 million in tax relief. This includes a $56 million 8-day Back-to-School Sales Tax Holiday, a $9 million 10-day Disaster Preparedness Sales Tax Holiday and property tax relief of $247.3 million.", "2019-11-18T15:01:51.000Z": "Today, I am pleased to announce my budget recommendation for Fiscal Year 2020-2021. The Bolder, Brighter, Better Future budget of $91.4 billion represents a decrease in per capita spending and an increase in our state reserves.", "2019-11-18T13:30:46.000Z": "Thank you to @ZOA_National for having me last night to speak at the annual National Gala. Since day one as Governor, I've taken action to support Israel as an ally and partner and I will remain committed to making Florida the most Israel-friendly state in the country.", "2019-11-16T14:58:45.000Z": ". @FLCaseyDeSantis and I are looking forward to a great day of football to honor our military and veterans at today's Military Appreciation Game between @FSUFootball and @BamaStateFB . #GoNoles", "2019-11-16T02:06:21.000Z": "It was great to join the South Florida Automobile Dealers Association for their annual Gala in Ft. Lauderdale tonight. Auto-dealers throughout the state play an important role in the state's economy as big time job creators.", "2019-11-15T23:16:51.000Z": "This evening, Madison and I were honored that the USS Florida submarine stateside crew was able to joins us at the Governor's Mansion. We thank them for their commitment and service to our country.", "2019-11-15T21:11:40.000Z": "My administration appreciates Eastern Shipbuilding's longstanding commitment to Northwest Florida, and we look forward to their continued success. More here - http:// bit.ly/352Oxpp", "2019-11-15T21:11:39.000Z": "I was excited to join Eastern Shipbuilding Group today for the launch of the SSG Michael H. Ollis, a 4,500-passenger ferry for the City of New York's Staten Island Ferry Division.", "2019-11-15T19:13:13.000Z": "Florida continues to be the place to be as businesses and communities are growing and thriving. Our economy added 22,800 new private-sector jobs in October and our unemployment rate remains at a low 3.2%. More info on the latest jobs report here - http:// bit.ly/2Ot61Vp", "2019-11-15T16:47:57.000Z": "I'm pleased to announce the appointment of Randall Hunt to lead our efforts as secretary of the @floridalottery . Randall's entrepreneurial skills and perseverance will serve him well as he takes the helm of this important department.", "2019-11-15T16:27:45.000Z": "We have many tremendous volunteers across our state, but we also have many Floridians who want to get involved but don't know where to look. Volunteer Connect will provide a one-stop platform to align volunteers with organizations that meet their interests and skill sets.", "2019-11-15T16:27:44.000Z": "I'm excited to join @VolunteerFla to announce that our state's official volunteer opportunities platform, Volunteer Connect, has launched to the public.", "2019-11-14T21:56:47.000Z": "We want to make sure we are doing all that we can to recruit and retain great educators throughout the state of Florida. Together, we can advance this and other proposals as we strive to make 2020 the Year of the Teacher. More details here - http:// bit.ly/2XjAPM3", "2019-11-14T21:56:46.000Z": "I am proud to announce that in my forthcoming recommended budget, I will be proposing $300 million in teacher and principal bonuses that reward Florida's best educators.", "2019-11-14T18:09:53.000Z": "Great morning at the @FedSoc National Lawyers Convention discussing the ideals and principles our nation was founded upon. The Federalists believed it was imperative that each branch of government serve its proper role, and it is our duty to ensure that remains the case today.", "2019-11-13T22:58:04.000Z": ". @SBAgov is making disaster loans available to small businesses impacted by Hurricane Dorian & businesses in Polk County impacted by Tropical Storm Nestor. This is great news & will help these businesses get back on their feet.", "2019-11-13T19:29:16.000Z": "This nearly $4 million investment is expected to create 500 new jobs and attract development from aviation and aerospace companies. This is another big win for Florida's booming Space Coast. More info here - http:// bit.ly/354MVLX", "2019-11-13T19:29:15.000Z": "I am proud to announce my administration's second Job Growth Grant Fund award will go towards infrastructure improvements at the Melbourne Airport @FlyMLB .", "2019-11-12T19:52:41.000Z": "Thank you @SecElaineChao for continuing to support transportation in Florida. As Governor, I remain committed to ensuring Florida has a multimodal transportation system that reduces congestion & improves safety, while leveraging technology. Details - http:// bit.ly/2X9c05n", "2019-11-12T16:10:18.000Z": "In honor of Fire Rescue District Chief Dwain Bradshaw, I have directed the flags of the United States and the State of Florida to be immediately flown at half-staff. Dwain's heart for serving others is a testament to the legacy he leaves behind; he will be missed. Quote Tweet Ron DeSantis @GovRonDeSantis . @FLCaseyDeSantis and I are saddened to learn of the loss of @myescambia volunteer fire chief Dwain Bradshaw. He was a true public servant for his community, and our sincere condolences go out to his family, friends and all that knew him. https:// pnj.com/story/news/loc al/2019/11/06/beulah-volunteer-fire-chief-killed-while-responding-crash-wednesday/4176387002/ ", "2019-11-11T16:22:25.000Z": "Today I joined @FLVetsAffairs Dir. @DannyBurgessFL , @Lee_Health and @homebaseprogram in Ft. Myers to announce new mental health services for veterans impacted by the invisible wounds of war.\n\nIt is our duty to ensure veterans are receiving the support they deserve. #VeteransDay", "2019-11-11T15:25:36.000Z": "Since taking office, I've made it a priority to enhance FL's reputation as the most veteran-friendly state in the nation. @VISITFLORIDA 's new military travel hub expands this initiative and builds the bond between Florida and our nation's heroes. http:// bit.ly/2Q8VzEI", "2019-11-11T13:01:07.000Z": "On #VeteransDay2019 we honor the selfless sacrifices and courage of veterans, military members & their families. \n\nFlorida is the most veteran and military friendly state in the nation, and we are proud to spearhead efforts such as Forward March and GI LAW to support our heroes.", "2019-11-08T20:19:26.000Z": "We mourn the passing of a true icon who made Florida better, George Allen. As the first African American to graduate from @UF & a prestigious lawyer, George was vital in the integration of Broward public schools. @FLCaseyDeSantis and I send well wishes to his family and friends. Quote Tweet South Florida Sun Sentinel @SunSentinel Pioneering black lawyer W. George Allen dies at 83 https:// trib.al/NmToSlr", "2019-11-08T19:29:47.000Z": "As a gesture of gratitude, we invite all men and women who serve or have served our great nation to enjoy @FLStateParks for free on #VeteransDay2019 . \n\nWe hope that veterans and their families will have some time to enjoy a Florida State Park.", "2019-11-08T19:10:13.000Z": "We must do more now for our environment to reduce harmful discharges to the coastal estuaries and improve water quality, and this treatment area will play a major role in accomplishing both goals. More info here - http:// bit.ly/2p1U407", "2019-11-08T19:10:12.000Z": "Today I joined @FLDEPNews , @SFWMD , conservation groups, @USACE and community leaders to pump the first water into the C-44 Stormwater Treatment Area, a critical Everglades restoration project that will result in a cleaner, healthier St. Lucie estuary.", "2019-11-08T18:04:01.000Z": "Thanks to the efforts of @FLSERT , Florida has secured $380M in @USDA block grants to deliver critical support to farmers in Northwest Florida following Hurricane Michael. Thank you President @realDonaldTrump and @SecretarySonny for helping our farmers replant and rebuild.", "2019-11-08T15:50:48.000Z": "I'd like to wish a happy 90th birthday to @TheBobbyBowden , a true living legend. Coach Bowden put @FSUFootball on the map, inspired countless athletes to pursue their dreams and created a lasting legacy in college football. #GoNoles", "2019-11-08T13:48:26.000Z": "It was great speaking to the @FloridaC100 last night about our efforts to improve the quality of life and economic well-being of all Floridians. Through a collaborative commitment toward innovative policies, we'll continue to work to ensure FL's business climate remains strong.", "2019-11-07T16:04:07.000Z": "Today, FDEM paid out more than $4 million to communities recovering from hurricanes Michael and Irma, including $1.3 million for @OrmondBeach and $1.3 million for Islamorada. The Division remains committed to helping all communities impacted by hurricanes recover.", "2019-11-06T23:51:41.000Z": ". @FLCaseyDeSantis and I were excited to host our friends in the Indian American community for the the first-ever Diwali celebration at the Florida Governor's Mansion. We hope everyone had a terrific time as this year's Festival of Lights comes to an end.", "2019-11-06T21:53:08.000Z": "I'm proud to proclaim Nov. 4-15 as Paychecks for Patriots weeks in Florida. With support from @FLDEO , @FLVetsAffairs & @FLGuard , @CareerSourceFL is hosting events throughout November to help our veterans find meaningful employment in their communities. http:// bit.ly/32ngarl", "2019-11-06T20:58:04.000Z": "This important project for Northwest Florida and Tyndall AFB is a critical component of our long-term recovery and rebuilding efforts, and I look forward to seeing the improvements it will bring upon completion. More info on the project here - http:// bit.ly/33uCAbO", "2019-11-06T20:58:03.000Z": "Today I joined @MyFDOT and @TeamTyndall for the groundbreaking ceremony of the Tyndall Flyover - a new project that will significantly reduce traffic congestion at the main entrance of the base, improving safety and security for residents, visitors and commuters.", "2019-11-06T20:35:11.000Z": ". @FLCaseyDeSantis and I are saddened to learn of the loss of @myescambia volunteer fire chief Dwain Bradshaw. He was a true public servant for his community, and our sincere condolences go out to his family, friends and all that knew him. Volunteer district fire chief killed while responding to crash 'just wanted to help' An Escambia County spokesperson confirmed that volunteer fire chief Dwain S. Bradshaw, 41, was responding to a multi-vehicle accident with a fatality when he was struck. pnj.com", "2019-11-06T19:21:20.000Z": "Ali-Frazier. Yankees-Red Sox. Florida-Florida State. All battles of the titans, and today we have another: @PopeyesChicken vs. @ChickfilA . While I may someday render judgement on the superior sandwich, I'd like to know which one you prefer?", "2019-11-05T19:41:05.000Z": "Water is the lifeblood of our state, and this website brings environmental leaders, residents and visitors together to be a part of protecting and restoring Florida's waterways. More info on today's announcement here - http:// bit.ly/32mOdjs", "2019-11-05T19:41:04.000Z": "http:// ProtectingFloridaTogether.gov combines the good work of @FLDEPNews , @healthyfla and @MyFWC to better ensure our residents and visitors can appreciate and enjoy our beautiful resources.", "2019-11-05T19:41:02.000Z": "I am proud to join @GovRonDeSantis in continuing efforts to make water quality in Florida a clear priority, as well as the accountability and transparency of those efforts.", "2019-11-05T17:32:21.000Z": "Today I joined @FLCaseyDeSantis , @FLDEPNews and our environmental leaders to announce the launch of Florida's first-ever comprehensive water quality dashboard - http:// ProtectingFloridaTogether.gov", "2019-11-05T14:13:39.000Z": ". @FLSERT has paid out more than $30 million to communities recovering from Hurricane Irma, including nearly $17 million for @LeeEOC & nearly $10 million for @FTLCityNews . Our administration is committed to ensuring every single community impacted by recent hurricanes recovers.", "2019-11-04T22:21:58.000Z": ". @GovRonDeSantis and I were honored to host a Halloween \"Spooktacular\" Celebration at the Governor's Mansion in honor of those in public service, especially our first responders and their families for the selfless work they do to keep our communities safe.", "2019-11-04T22:12:53.000Z": "Opportunities for investment and economic development are critical to the health of local economies in FL's rural communities, and I'm pleased to announce $3 million in funding through @FLDEO 's Rural Community Development Revolving Loan Fund Program. http:// bit.ly/2JPybZb", "2019-11-04T21:41:12.000Z": "Together, we can identify meaningful solutions and quality care for families to address the suffering and stigma surrounding this issue. It is through a proactive approach that these Floridians will find the help and hope they need to heal.", "2019-11-04T21:41:11.000Z": "Today's meeting of the Florida Children & Youth Cabinet was a positive first step in our efforts to respond to the epidemic of youth suicide. The growing trend of this tragic cause of death is alarming and we are going to have to work quickly and creatively to change it.", "2019-11-04T21:13:25.000Z": ". @MyFWC 's Python Action Team has removed its 1,000th Burmese python from the Everglades - this is in addtion to the 2,600 pythons removed by the @SFWMD 's Python Elimination Program. In total, more than 3,600 pythons have been removed.", "2019-11-04T20:17:35.000Z": "My administration remains committed to empowering Florida patients. With today's announcements, we are one step closer to making Florida's health care system the most transparent, most affordable and highest quality system in the nation. See details here - http:// bit.ly/2oPF6u2", "2019-11-04T20:17:34.000Z": "Health care is the only industry where a consumer purchases something without knowing the price or value, and that needs to change. Today, I was pleased to announce 3 new initiatives to increase transparency and improve Florida's health care system.", "2019-11-02T23:38:03.000Z": "Congratulations to @GovKemp and the Georgia Bulldogs. Looks like I'll be going hog wild in southern Georgia soon. Quote Tweet Governor Brian P. Kemp @GovKemp Big win in Jacksonville for three in a row! Great game, @FrommJake ! #DawgsOnTop twitter.com/GeorgiaFootbal", "2019-11-02T16:32:50.000Z": "Good luck to both @FSUFootball and @CanesFootball as they square off today in Tallahassee. This historic rivalry has produced some of college football's greatest moments and is sure to be a hard-fought game. #GoNoles  #GoCanes", "2019-11-01T22:22:40.000Z": "There's a big game on Saturday & I'm so confident in the #Dawgs that I made a friendly wager with FL @GovRonDeSantis . We win & Ron comes to S. Georgia for feral hog hunting. We lose & I'm hunting pythons in the Everglades. Let's hunker down & keep choppin'! #GoDawgs ! #ATD  #gapol Quote Tweet Ron DeSantis @GovRonDeSantis 0:46 Hey @GovKemp - there's a big game tomorrow in Jacksonville, and you know I'm taking @GatorsFB to get the win over @GeorgiaFootball .\n\nI'm so confident, I'm even willing to offer a friendly wager. #GoGators  #UFvsUGA", "2019-11-01T22:05:53.000Z": "Hey @GovKemp - there's a big game tomorrow in Jacksonville, and you know I'm taking @GatorsFB to get the win over @GeorgiaFootball .\n\nI'm so confident, I'm even willing to offer a friendly wager. #GoGators  #UFvsUGA", "2019-11-01T18:12:00.000Z": "We are excited that @FISGlobal has chosen to expand its headquarters presence and employee base in Jacksonville. This important investment for our state and the Jacksonville community reaffirms Florida's position as a hub for the financial services industry.", "2019-10-31T21:56:52.000Z": "Great news! Today @FLSERT paid out more than $6.8 million to the City of Callaway for Hurricane Michael recovery. We won't stop fighting to help Northwest Florida recover from Hurricane Michael until every community has rebuilt stronger than before.", "2019-10-31T14:11:29.000Z": ". @SPGlobalRatings has upgraded Florida's State University System's bond rating from AA to AA+ - this is great news for our universities, current and incoming students and state economy as a whole.", "2019-10-30T16:23:20.000Z": "Thank you @insideFPL for sending 100 linemen to California to help restore power to areas impacted by fires. Florida has the best utility crews in the world who are always willing to lend a hand to help others. @FLCaseyDeSantis and I send our prayers for a safe return home. Quote Tweet Florida Power & Light @insideFPL Today, 100 FPL lineworkers and support staff from across the state left for California to help @PGE4Me restore power to areas affected by recent fires. Stay safe!", "2019-10-30T15:51:22.000Z": "Florida's charter schools have become increasingly diverse by serving students based on a variety of individual needs. This year 69% of the students served were minorities. 43% enrolled were Hispanic and 20% enrolled were African American.", "2019-10-30T15:51:21.000Z": "Today, the 2019 @NAEP_NCES results were announced and I am pleased to share that Florida's public charter school students outperformed their national charter school peers in all grades and subjects.", "2019-10-29T22:49:27.000Z": "Thank you to the @FLBOG and our state university trustees for inviting me to highlight Florida's top-rated higher education system. By working together, we will build on this success and continue to invest in our students to ensure we remain at the front of the pack.", "2019-10-29T18:27:32.000Z": "Great news for college athletes in FL & across our country. I'm extremely pleased the @NCAA has realized that this is a matter of fairness & equity, & that these athletes should have the opportunity to receive appropriate compensation for the use of their name, image & likeness. Quote Tweet SportsCenter @SportsCenter The NCAA voted unanimously Tuesday to allow college athletes to make money from their name, image and likeness \"in a manner consistent with the collegiate model.\" https:// es.pn/2Nm5wfc", "2019-10-29T15:20:01.000Z": "Great morning at the Florida Capitol for the annual @AP Legislative Preview. I look forward to continuing to work with members of the Florida Legislature this session on behalf of all Floridians across our state.", "2019-10-28T18:32:01.000Z": "Diwali is a celebration of good over bad, light over darkness and knowledge over ignorance. It is a time to come together for reflection on the past as well as for future prosperity. To those celebrating the Festival of Lights, it my pleasure to say Shubh Diwali!", "2019-10-28T15:32:04.000Z": "Today I spoke at the @VoiceofFLBiz annual conference to discuss Florida's strong business climate, workforce education initiatives and removing barriers to employment. I look forward to continuing to advance opportunity and prosperity for all Floridians.", "2019-10-26T18:56:43.000Z": "Looking forward to a great day at Doak Campbell Stadium with @FLCaseyDeSantis and @FSUPresThrasher as @FSUFootball takes on @CuseFootball . #GoNoles", "2019-10-26T02:04:07.000Z": "Governor Ron DeSantis salutes Medal of Honor recipients: \"You are American royalty.\"", "2019-10-25T16:23:03.000Z": "Once complete, the C-43 Reservoir will store approximately 55 billion gallons of water, with 19 miles of embankments and 15 miles of canals to reduce harmful discharges from Lake Okeechobee and help bring the Caloosahatchee River and Estuary back to health.", "2019-10-25T16:23:02.000Z": "Today, I joined members of the @SFWMD , @FLDEPNews and environmental stakeholders to break ground on the C-43 West Basin Storage Reservoir - one of our most important Everglades restoration projects.", "2019-10-24T22:27:52.000Z": "It was great to be in Orlando today for the @FLHospitalAssn annual meeting. My administration looks forward to continuing to work with hospitals and all providers to empower patients, reduce costs and improve quality of care for all Floridians.", "2019-10-24T21:20:56.000Z": "Due to Tropical Storm Nestor impeding anglers' ability to fish in the Gulf this past weekend, @MyFWC has announced an extension to recreational red snapper season which now includes the weekend of November 2-3. Additional details here - http:// bit.ly/2BEVn7J", "2019-10-24T20:48:12.000Z": "When finished, it will connect the Howard Frankland Bridge, the Courtney Campbell Causeway, the Veterans Expressway and @FlyTPA with additional lanes. More info on the project here - http:// bit.ly/2BERCz9", "2019-10-24T20:48:11.000Z": "As our population continues to increase, we remain committed to improving our transportation infrastructure through strategic innovation. By significantly relieving traffic congestion, this project will provide motorists a more effective way to travel through the region.", "2019-10-24T20:48:10.000Z": "I'm excited to join @MyFDOT in announcing $1.4 billion for the reconstruction of the I-275/SR 60 Westshore Area Interchange in Tampa, which will add capacity for future growth and improve connectivity for Tampa's residents, businesses and visitors.", "2019-10-24T19:53:53.000Z": "Most of Florida's thousands of college athletes will never have the opportunity to play pro sports to generate income, yet still compete at a high level every day. If these athletes are good enough to compete on the field, they're good enough to compete in the free market.", "2019-10-24T19:53:51.000Z": "This morning I was joined by @ChipLaMarca , @kionnemcghee , @debbie_mayfield , @csime90 and @Nick_J_Maddox to lend my support for legislation that provides college athletes in Florida the opportunity to receive reasonable compensation from the use of their likeness, image or name.", "2019-10-23T22:23:16.000Z": "I thank the Florida Senate for tending to this matter. I hope the outcome provides some measure of relief to the Parkland families that have been doggedly pursuing accountability.", "2019-10-23T19:22:10.000Z": "The removal of this stretch of roadbed will help move water south and restore important wetland habitats. More info on the project here - http:// bit.ly/31J8yiy", "2019-10-23T19:22:09.000Z": "Today I announced that @FLDEPNews has issued a permit to @EvergladesNPS for the removal of more than 5 miles of roadbed along Tamiami Trail. This project is a critical component of our long-term efforts to restore the Everglades and protect our environment.", "2019-10-23T18:10:29.000Z": ". @RepBrianMast & @MarcoRubio are right. The EAA Reservoir, which will help prevent harmful discharges from Lake O, is one of the most important water quality projects in FL's history. We've acted at the state level to expedite the project & it's time the @USACEHQ does their part. Quote Tweet Rep. Brian Mast @RepBrianMast It's been a year to this day since we authorized the southern storage reservoir. The @USACEHQ delay of the southern storage reservoir is unacceptable & blatantly disregards Congressional directives. @SenRubioPress & I are working to light a fire under their feet!", "2019-10-22T21:36:18.000Z": "I thank the FL Cabinet for joining me in taking action to expedite the construction of the EAA Reservoir Project. Today's decision is a critical step towards reducing harmful discharges & helping send more clean water south of the Everglades. Details - http:// bit.ly/2MCWdbz", "2019-10-22T18:45:03.000Z": "Thank you to President @realDonaldTrump for approving a major disaster declaration for the state of Florida following Hurricane Dorian. This will provide critical reimbursements to state and local governments for actions they took to prepare for this Category 5 storm.", "2019-10-22T14:36:59.000Z": "I'm pleased to announce the participation of several additional law firms for our GI LAW legal assistance program for military members. @SHBLaw , @NelsonMullins and @CSKLegal have joined @GT_Law , @Holland_Knight , @ShuttsBowen , @Akerman_Law and @GunsterLaw .", "2019-10-21T22:19:04.000Z": "A cold front will bring severe weather across North Florida tonight. Strong winds and tornadoes are possible with this system. Follow @FLSERT and local media for updates and take any tornado warnings seriously.", "2019-10-21T21:49:00.000Z": "It was a privilege to meet such a dedicated group of high school students from Miami-Dade. Together, they are working to fight the stigma surrounding mental health and find meaningful solutions for their peers.", "2019-10-21T17:52:54.000Z": "Today, @TheJusticeDept awarded more than $291 million in public safety grants to agencies & organizations across the state of Florida. The safety and well-being of our children is paramount, and I appreciate the Department of Justice for recognizing that with these grant awards.", "2019-10-21T17:00:24.000Z": "President @RealDonaldTrump announced the recipients of the PAEMST (Presidential Awards for Excellence in Mathematics and Science Teaching) awards last week, the highest award given to kindergarten through 12th grade teachers of math and science, including computer science.", "2019-10-21T17:00:23.000Z": "Congratulations to PAEMST Award recipients Karina Moran of @PBManatee_Prin in Port St. Lucie, Tiffany Oliver of @HCPSRobinsonHS in Tampa, Lorraine Plageman of @jupiter_high in Jupiter and Laura Steele of Wright Elementary School in Wright.", "2019-10-19T14:32:48.000Z": "We received reports of tornado damage overnight in Polk County & we are working with @FLSERT to survey damage & assist impacted areas. TS #Nestor is continuing to produce severe weather today, including the possibility of tornadoes across Central FL. Please monitor this storm.", "2019-10-18T23:01:08.000Z": "As Tropical Storm #Nestor impacts Florida overnight, it may produce isolated tornadoes & flash flooding. If a tornado warning or flash flood warning is issued in your area, please take action immediately. Stay tuned to local media for updates on conditions throughout the night.", "2019-10-18T21:19:36.000Z": "Tropical Storm #Nestor has formed & is approaching NW FL. Tropical storm force winds will be arriving later today & residents in the path of this storm should prepare now to avoid being caught outside in unsafe conditions. Remember to follow local media and @FLSERT for updates. Quote Tweet National Hurricane Center @NHC_Atlantic Here are the 4 pm CDT Key Messages on Tropical Storm #Nestor .  See http:// hurricanes.gov for more information", "2019-10-18T20:19:23.000Z": "Very productive two days in New York meeting with leaders in the financial services and aviation industries including @BNYMellon , @JetBlue , FIDUS Partners, Soroban Capital Partners and TrustCo Bank discussing Florida's abundant economic advantages.", "2019-10-18T20:16:37.000Z": "Thank you to Capital City Youth Services for showing me their transitional living program for young adults and discussing their efforts to help children and families in need.", "2019-10-18T16:12:33.000Z": "I am pleased to announce the state's unemployment rate has dropped to 3.2%. We will continue to prioritize innovation, keep taxes low and invest in education and the environment to further advance Florida's economy. More details here - http:// bit.ly/2qspD3x", "2019-10-18T15:30:01.000Z": "As Potential Tropical Cyclone 16 approaches, storm surge warnings are in effect from near Apalachicola to Clearwater Beach. Storm surge & heavy rain may cause flooding from NW FL to Clearwater starting today. Avoid flooded roads & follow @FLSERT for updates. #TurnAroundDontDrown Quote Tweet National Hurricane Center @NHC_Atlantic Here are the 10 AM CDT Friday, October 18 Key Messages for Potential Tropical Cyclone #Sixteen . https:// nhc.noaa.gov/refresh/graphi cs_at1+shtml/145015.shtml?key_messages#contents ", "2019-10-17T21:26:16.000Z": "Great news - @SpiritAirlines has announced its intention to build a new state-of-the-art HQ complex in Dania Beach, creating 225 jobs for Floridians. Our strong economy, top rated public education system and talented workforce continue to entice companies to expand in Florida.", "2019-10-17T19:17:15.000Z": "Great to hear that Florida will host the G-7 Summit next year. Miami is a globally recognized city and we look forward to having important leaders from around the world visiting and working in our state.", "2019-10-17T18:29:58.000Z": "We are closely monitoring a potential tropical system in the Gulf with @FLSERT . Forecasts are predicting heavy rainfall, gusty winds, isolated tornadoes & coastal flooding across NW Florida this weekend. Residents should prepare now for the chance of flooding & power disruption. Quote Tweet National Hurricane Center @NHC_Atlantic 10 AM CDT: NHC has initiated advisories on Potential Tropical Cyclone Sixteen. Here are the Key Messages for that system, which is expected to bring storm surge and wind hazards to portions of the Gulf Coast http:// hurricanes.gov", "2019-10-17T17:59:01.000Z": "I am traveling to New York to highlight Florida's low taxes, top rated university system and impressive workforce. I look forward to meeting with @BNYMellon and @JetBlue today to discuss the benefits of expanding in Florida's favorable business climate.", "2019-10-17T17:25:11.000Z": ". @SpaceFlorida has received official notification of its $90 million @USDOT grant to replace the Cape Canaveral Spaceport Indian River Bridge. With this federal investment, Florida will continue as a global leader in the aerospace industry for years to come.", "2019-10-17T15:08:41.000Z": "I'm pleased to announce more than $633 million in first-of-its-kind federal funding for disaster mitigation projects through @HUDgov 's newly created Community Development Block Grant - Mitigation program.", "2019-10-17T14:00:34.000Z": "According to @fladjj , juvenile arrests are down 27% in the last 5 years, marking the lowest level in 44 years. This decline demonstrates that our dedication to our youth through effective prevention and early intervention services is working. More info - http:// bit.ly/2MNKZjp", "2019-10-16T19:08:28.000Z": "The legislation stems from science-based recommendations made by the Blue-Green Algae Task Force. More information here - http:// bit.ly/2OUAJZ6", "2019-10-16T19:08:27.000Z": "Today, I joined environmental stakeholders to announce comprehensive legislation that I will be supporting this upcoming legislative session that will significantly improve the state's water quality.", "2019-10-16T14:04:01.000Z": "Darcy Abbott will be deployed to Northwest Florida to help those who are struggling in their ongoing recovery from Hurricane Michael. This role is just one piece of our continued efforts to make these communities feel whole again. Read more here - http:// bit.ly/2MMALzK", "2019-10-16T14:04:00.000Z": "I was pleased to join the Florida Behavioral Health Association @Floridabha1 to announce that @FLSERT has hired the state's first ever Disaster Recovery Mental Health Coordinator to focus on helping communities obtain critical mental health services following a disaster.", "2019-10-15T21:24:02.000Z": "Had a great conversation with @Virgin @HyperloopOne CEO Jay Walder this afternoon about the benefits of doing business in Florida. Our strong economy, world-class infrastructure and large and diverse workforce make our state an ideal place for companies to invest and grow.", "2019-10-15T20:31:35.000Z": "Congratulations to the next President of the @FLSenate , Senator @WiltonSimpson . His work ethic and commitment to improving our state gives me great hope for the future and @FLCaseyDeSantis and I were honored to attend his designation ceremony today.", "2019-10-11T18:49:36.000Z": "I'm excited to announce that all 28 Florida Colleges support the Last Mile Completion Program. Thank you to all the college presidents who have signed on and support this great program that helps students complete their higher education goals. More here - http:// bit.ly/317x3Wv", "2019-10-11T17:25:43.000Z": "As of today, @FLSERT has paid out more than $1 Billion for Florida hurricane recovery. I will continue to examine every hurricane recovery resource to help ensure that affected communities fully recover. More here - http:// bit.ly/2OGYLqu", "2019-10-11T17:10:33.000Z": "Our newly created Family Empowerment Scholarship Program has attained the highest first-year enrollment for a private choice program. I remain committed to providing opportunities for families to send their child to the school that best fits their needs. http:// bit.ly/2B7g5g8", "2019-10-11T15:20:51.000Z": "Thank you to Acting Secretary @DHSMcAleenan for granting extraordinary relief to Panama City-based Eastern Shipbuilding for four @USCG Offshore Patrol Cutters. This decision will save countless jobs for Northwest Florida and ensure our national defense remains strong.", "2019-10-10T23:32:43.000Z": "It was great to be with the Northwest Florida community at A Night to Unite where I announced that @FLSERT is awarding $150 million to Bay County and $20 million to Mexico Beach to help recover from Hurricane Michael. More here - http:// bit.ly/311xPEw", "2019-10-10T21:53:29.000Z": "Today, I am pleased to announce I am requesting $25 million from the Florida Legislature to once again fund the Hurricane Michael State Recovery Grant Program to support hurricane repair and recovery efforts.", "2019-10-10T18:01:37.000Z": "One year later, we are still in this fight together. This process will not be finished today, tomorrow, or the next day. This is something that requires a sustained effort, and we are in it for the long haul. We will rebuild, we will recover, and we will always remember.", "2019-10-10T14:09:05.000Z": "It's time to end the stigma surrounding mental health. On this #WorldMentalHealthDay , I encourage all Floridians to have a conversation about mental health and how it impacts our communities. To those struggling, know that we are with you and that help and hope is on the horizon.", "2019-10-09T21:08:30.000Z": "She works diligently to bring beauty into the lives of Floridians, and I could not be more excited for her to be able to showcase her incredible talent. Learn more about Ms. Larrea's story and artwork here - http:// bit.ly/316bh5D", "2019-10-09T21:08:28.000Z": "I'm excited to announce Virginia Larrea as Florida's featured artist for #HispanicHeritageMonth . Ms. Larrea is not only an award-winning painter whose work is collected around the world, but she is also a practicing architect and interior designer in Tampa.", "2019-10-09T16:34:41.000Z": "Florida has submitted its Beneficiary Mitigation Plan for the $166 million we received from the Volkswagen Settlement. We look forward to using these funds to improve our electric vehicle infrastructure & modernize school & transit bus fleets. More here - http:// bit.ly/2ID1Zrj", "2019-10-09T13:58:46.000Z": "I'm pleased to announce the relaunch and expansion of @EnterpriseFL 's 'Find It Florida!' commercial property search tool that will continue to assist businesses & investors find available sites, including Opportunity Zones, throughout the state. Details - http:// bit.ly/323OQis", "2019-10-08T18:38:51.000Z": "While Florida is a great place to find meaningful work, there is always more we can do to get government out of the way and increase opportunity. I look forward to working with @FloridaDBPR & the FL Legislature to get these reforms across the finish line. http:// bit.ly/2MpOmNe", "2019-10-08T18:38:50.000Z": "Today at @MiamiChamber , I announced our bold new occupational licensing reform agenda to increase professional opportunity for Floridians without sacrificing safety. These proposals will build on our efforts to remove unnecessary, burdensome regulations & barriers to employment.", "2019-10-08T13:20:49.000Z": "As tonight's sundown marks the start of this holy day, @FLCaseyDeSantis and I would like to extend warm wishes and an easy fast to all of those observing Yom Kippur. G'mar Chatimah Tova - may you be inscribed and sealed for a good year.", "2019-10-07T22:06:02.000Z": "Thank you to @MHS_MiddleburgH , Bayview Elementary and @my_dunedinhigh for having me today to roll out my proposal to increase the minimum salary for our teachers. We are committed to making Florida a top state in the nation for starting teacher pay.", "2019-10-07T20:31:53.000Z": "I also visited @unitedwaynefl 's 2-1-1 call center, where they are working to connect people with the resources they need to live healthy, happy and productive lives. It was a privilege to discuss the great things they are doing for their community.", "2019-10-07T20:31:51.000Z": "Neonatal Abstinence Syndrome is a serious issue in our state, and I am determined to keep the momentum moving at a rapid pace toward real solutions and real strategies to help people overcome addiction.", "2019-10-07T20:31:49.000Z": "Today, I visited @UFHealthJax for a tour of their neonatal intensive care unit and held a listening session on emerging trends, challenges and best practices in regards to Neonatal Abstinence Syndrome - http:// bit.ly/33f5kET", "2019-10-07T14:20:45.000Z": "Today, I announced my proposal to increase the minimum salary for teachers in FL to $47,500. This will help alleviate the teacher shortage in our state and elevate the profession to the level of appreciation it deserves. This is long overdue. More here - http:// bit.ly/30OAFMU", "2019-10-06T22:29:56.000Z": ". @FLCaseyDeSantis and I offer our deepest sympathies to Senate President @BillGalvano on the unexpected passing of his younger brother, Pete. Words cannot express how saddened we are to learn of your loss. We are here for you and Julie, and Pete's wife Karrie.", "2019-10-06T20:38:22.000Z": "Incredibly saddened to learn of the passing of Chris Connell, who served with honor and distinction as Director of Capitol Police and previously served 28 years with the Tallahassee Police Department. @FLCaseyDeSantis and I are keeping his family in our prayers. Quote Tweet Florida Politics @Fla_Pol In memoriam: Chris Connell, head of Capitol Police http:// bit.ly/2Vh7G38  #FlaPol", "2019-10-06T11:44:38.000Z": "Today, I've directed flags be flown at half-staff across the state in honor of National Fallen Firefighters Memorial Day. I encourage all Floridians to take a moment to reflect on the selflessness of our brave firefighters and the sacrifices they make in the line of duty.", "2019-10-05T23:11:04.000Z": "Congratulations to Coach Mullen and @GatorsFB on the big win and for getting to 6-0 on the season. Keep it up! #GoGators", "2019-10-05T15:45:48.000Z": ". @FLCaseyDeSantis and I are looking forward to watching @GatorsFB take on @AuburnFootball today at the Swamp! Good luck to Coach Mullen and the team. #GoGators  #AUvsUF", "2019-10-04T17:05:13.000Z": "I was excited to take part in today's groundbreaking of @CAE_Inc 's new U.S. headquarters in Tampa. This state-of-the-art facility at @FlyTPA will further bolster our aviation and defense industry and create 100 additional high-skilled jobs for the community.", "2019-10-04T16:36:25.000Z": "I congratulate @MyFWC on removing their 900th Burmese Python from the wild, including their recent capture of the largest python ever removed from Big Cypress National Preserve. It's essential we keep working to rid our state of these invasive species. FWC Python Action Team removes 900th snake, captures record python from Big Cypress National... content.govdelivery.com", "2019-10-04T15:22:48.000Z": "I'm happy to announce Veterans' Performance Incentive Awards for 3 workforce development boards and I applaud the work these local boards are doing in their communities to connect veterans with meaningful employment after serving our country. More here - http:// bit.ly/333RS6q", "2019-10-03T19:42:06.000Z": "Thank you President @realDonaldTrump for stopping by The Villages today and voicing your support for my plan to make access to affordable prescription drugs from Canada a reality in our state. In Florida, we are committed to finding innovative ways to keep healthcare costs low.", "2019-10-03T17:15:27.000Z": "Less than 48 hours after taking office, I charged @FLDEPNews and @SFWMD with expediting critical Everglades restoration projects.\n\nToday, I'm pleased to announce that Florida Crystals is terminating its lease on lands needed for the EAA Reservoir Project.", "2019-10-03T15:04:20.000Z": ". @FLHSMV FHP Trooper Tracy Vickers was an outstanding member of our law enforcement community, a Navy veteran and a model citizen. Please join @FLCaseyDeSantis and I in extending condolences to his family, friends and colleagues as he is laid to rest.", "2019-10-03T13:28:10.000Z": "Last night I joined the @floridabankers Association Leadership Forum to discuss the importance of the financial industry to Florida's strong economy. My administration will remain committed to policies that encourage the industry's continued growth and success.", "2019-10-02T22:28:52.000Z": "Today I visited @CoralGablesSHS to meet some of the students in the school's pre-apprenticeship program. My administration has prioritized career and technical education programs like theirs to ensure Florida students are prepared for careers in the 21st century job market.", "2019-10-02T20:29:11.000Z": "Those who are suffering don't always know where to turn for help. This afternoon, I was honored to tour @211Broward 's call center and learn more about this 24-hour, comprehensive helpline that provides real time guidance and support to those who need it.", "2019-10-02T18:43:12.000Z": "While this problem has reached substantial proportions, so have the efforts to combat it. With today's announcement, we are accelerating our fight against opioid addiction in Florida. Read more information here - http:// bit.ly/2mVQT90", "2019-10-02T18:43:11.000Z": "I also received a tour of the Neonatal Intensive Care Unit at @JDCHospital and saw firsthand the consequences of opioid addiction. As a mom, I feel a strong urgency to find real solutions for the innocent victims suffering from this epidemic.", "2019-10-02T18:43:09.000Z": "Today, at @mhshospital , I was pleased to announce $58.8 million in new federal grant funding to enhance the tracking of and response to the opioid crisis facing our state.", "2019-10-01T23:58:31.000Z": "Thank you to Bay County Contractors and Associates for having me this evening to discuss the efforts we've taken to ensure Northwest Florida fully recovers from Hurricane Michael. We will continue to work together to make this community whole again.", "2019-10-01T20:26:09.000Z": "It was great to visit the headquarters of @darden Restaurants in Orlando today to tour the facility and meet with President and CEO Gene Lee. We discussed Florida's strong business climate and the positive effects of the restaurant industry across our state.", "2019-10-01T13:46:05.000Z": "I'm pleased to join @MyFWC in announcing six additional recreational fishing days this fall to provide anglers with more opportunities to catch red snapper. Details: http:// bit.ly/2ohJIIv", "2019-09-30T21:05:02.000Z": "Today, I was excited to join Brunswick Boating Group to announce the grand opening of their new technology center in Volusia County. This new center will create more than 160 jobs and develop the future of marine technology. More here - http:// bit.ly/2moeyPb", "2019-09-30T20:42:06.000Z": "I was also fortunate to sit down with some very brave students to discuss mental health. This great group of Nease High Schoolers voiced the struggles young adults so often face. More info on today's events here - http:// bit.ly/2oHoGDr", "2019-09-30T20:42:04.000Z": "I was thrilled to join @FlaglerHospital and @THEPLAYERSChamp for today's launch of a new program for the @SJCSD - Being Resilient and Voicing Emotions (BRAVE). Together, we can reduce the stigma surrounding mental health and make a difference.", "2019-09-30T19:06:14.000Z": "It is reassuring that these funds were distributed so quickly so that Floridians can stay connected to their communities. More info here - http:// bit.ly/2mlOy72"}