{"2020-07-30T03:30:03.000Z": "JULY 29, 2020 http:// hawaiicovid19.com New cases: 109\nTotal cumulative cases: 1,865\nTotal hospitalized: 61\nNew deaths: 0\nTotal deaths: 26\nTotal number of individuals tested: 119,212 Hawaii COVID-19 Joint Information Center Daily News Digest, July 29, 2020 Office of the Governor: Spike in Cases Remind Community to Stay Vigilant, Reinstating Measures Being Considered At a news briefing Wednesday, Gov. Ige addressed the latest spike in COVID-19 cases. He... governor.hawaii.gov", "2020-07-29T23:07:52.000Z": "WATCH LIVE: July 29, 2020 News Conference - Update on #COVID19 WATCH LIVE: http:// Facebook.com/Governordavidi ge ", "2020-07-29T20:21:39.000Z": "Today's record-setting COVID-19 case count of 109 is likely due to lab closures because of Hurricane Douglas, as well as growing clusters that have been trending since the July 4th weekend.\nWash hands, wear face masks, practice physical distancing, and avoid large gatherings.", "2020-07-29T20:16:01.000Z": "Joining me this afternoon to discuss the latest on #COVID19 cases are Lieutenant Governor Josh Green and Dr. Bruce Anderson, Director, Hawaii State Department of Health\n\nWATCH here: http:// facebook.com/governordavidige ", "2020-07-29T18:16:39.000Z": "The 2020 @HIenergyConf live streams tomorrow, July 30. HSEO CEO @scottglennHI joins the event to discuss how clean energy jobs can contribute to Hawaii's recovery. The 3-hour event starts at 9am HST. Register for free to join online. Hawaii Energy Conference | Leading the Evolution - Hawaii Energy Conference Imagining a Just Recovery. What would that look like for the grid? Please join us online July 30th for a robust discussion of how the energy sector can and should respond to our current challenges by... hawaiienergyconference.com", "2020-07-29T09:19:00.000Z": "Tsunami Info Stmt: M5.5 020mi SE Sand Point, Alaska 0112AKDT Jul 29: Tsunami NOT expected #NTWC", "2020-07-29T03:30:04.000Z": "JULY 28, 2020 http:// hawaiicovid19.com New cases: 47\nTotal cumulative cases: 1,757\nTotal hospitalized: 47\nNew deaths: 0\nTotal deaths: 26\nTotal number of individuals tested: 117,559 Hawaii COVID-19 Joint Information Center Daily News Digest, July 28, 2020 Department of Health: 47 New Cases of Coronavirus Reported All but one of the newly diagnosed coronavirus cases reported by DOH are on O'ahu. There was a single new case on Maui. Of the 46 total... governor.hawaii.gov", "2020-07-28T22:09:19.000Z": "Today's COVID-19 cases totaled 47. As more clusters tied to businesses are surfacing, please continue to wear masks over both mouth and nose, wash hands for 20 seconds, practice physical distancing of at least six feet, and avoid large gatherings.", "2020-07-28T20:07:09.000Z": "Hawai'i was lucky to have escaped the worst of Hurricane Douglas, but officials are reminding everyone that the busiest part of the hurricane season -- August and September - still lies ahead. Residents are urged to remain vigilant and prepared.\n\nMore: Prepare now for hurricanes With the added concerns of COVID-19, residents are urged to prepare now for the 2020 hurricane season, which runs through Nov. 30. \"Hurricane season brings the very real threat of high winds, rain,... governor.hawaii.gov", "2020-07-28T17:39:38.000Z": "Flood Maps - https:// waihalana.hawaii.gov/flood-maps/ EVERYONE LIVES IN A FLOOD ZONE.  Know your risk.  No matter where you live or work, some risk of flooding exists.  Know your flood risk by looking up your property now.", "2020-07-28T18:00:01.000Z": "The County of Hawai'i has an entire website dedicated to Covid-19 Business Resources and Information.\nClick on the link for more info: https:// bit.ly/2Wta0pq  #supportsmallbusiness  #shoplocal  #hawaiicounty  #CARESact  #SBA", "2020-07-28T08:10:02.000Z": "Tsunami Info Stmt: M5.9 045mi SW Sand Point, Alaska 0004AKDT Jul 28: Tsunami NOT expected #NTWC", "2020-07-28T04:00:09.000Z": "Mahalo to everyone for staying with us through #HurricaneDouglas . All #RedCross Emergency Shelter Locations have been closed throughout the state. This weekend taught us that disasters don't quit in a pandemic, so we all need to stay safe and stay prepared.", "2020-07-28T01:10:57.000Z": "HFO cancels Flash Flood Watch for Kauai Leeward, Kauai Mountains, Kauai Windward, Niihau [HI] till 6:00 PM HST https:// nwschat.weather.gov/vtec/#2020-O-C AN-PHFO-FF-A-0005 ", "2020-07-28T02:13:53.000Z": "County Of Hawai'i Seeks Applicants For Stewardship Grants To Maintain & Preserve Lands Acquired With Monies From The Public Access, Open Space, And Natural  Resources Preservation Fund (Fund). http:// records.hawaiicounty.gov/Weblink/1/doc/ 107599/Page1.aspx ", "2020-07-27T23:37:27.000Z": "Oahu #hitraffic all vehicles in the inner lanes of the H-3 at Harano tunnels that were prestaged for Douglas have been moved. All travel lanes are open.", "2020-07-27T23:46:08.000Z": "We are barely two months into hurricane season. Please continue to build your 14-day emergency kits. All it takes is one storm to cause devastating damage and impacts to our islands.", "2020-07-27T22:34:10.000Z": "The @USCG Captain of the Port lifted all remaining restrictions on ports in the State of Hawaii following Hurricane Douglas.\n\nA hurricane warning remains for portions of the Papahanumokuakea Marine National Monument.\n\nRead more at: https:// lnks.gd/2/JtrDhX  #HurricaneDouglas GIF", "2020-07-27T20:12:10.000Z": "If you patronized Brix and Bones or Arena 808 between July 16 - 26, please contact your physician for a follow-up because a #COVID19 cluster has been identified at these establishments. #hawaiicovid19 Hawaii COVID-19 Joint Information Center News Release-Bar Patrons Sought for Possible Coronavirus... HEALTH INVESTIGATORS SEARCH FOR BAR PATRONS FOR CONTACT TRACING   (Honolulu) - Public health authorities from the Dept. of Health (DOH) are advising anyone who may have patronized two Honolulu bars... governor.hawaii.gov", "2020-07-27T20:00:25.000Z": "Today's COVID-19 case count is 28 but the decrease in numbers is likely due to a decrease in laboratory reporting. Private labs did not conduct late work shifts and the DOH State Laboratories were closed on Sunday due to Hurricane Douglas.", "2020-07-27T19:45:51.000Z": "Restrictions for Tropical Cyclone Douglas for all commercial Harbors in the State of Hawaii have been lifted.\n\nMahalo Harbors staff and @USCGHawaiiPac !", "2020-07-27T19:11:37.000Z": "#HurricaneDouglas rolled dangerously close to the Hawaiian Islands; we dodged another bullet. We were very lucky. Hurricane season is not over yet, so please don't let your guard down. Mahalo for staying steadfast and for preparing to keep yourselves and your families safe. Quote Tweet UW-Madison CIMSS @UWCIMSS Here's another look at #Hawaii 's close call with Hurricane #Douglas via storm-centered Morphed Integrated Microwave Imagery at CIMSS (MIMIC-TC). More #HIwx  #HurricaneDouglas info & imagery at https:// cimss.ssec.wisc.edu/satellite-blog /archives/37741  GIF", "2020-07-27T18:55:21.000Z": "No #tsunami generated, or damage reported in the park following that 4.7 #earthquake this morning *whew* and goodbye #HurricaneDouglas . https:// volcanoes.usgs.gov/observatories/ hvo/press_releases.html   #MondayFunday", "2020-07-27T17:54:03.000Z": "Hurricane #Douglas Advisory 29A: Hurricane Douglas Moving Away From the Main Hawaiian Islands. Hurricane Warning in Effect For Portions of the Papahanaumokuakea Marine National Monument. http:// go.usa.gov/W3H", "2020-07-27T18:29:40.000Z": "The storm may be over, but that doesn't mean the danger is. Keep your loved ones safe after the storm by following the safety tips below.\n\nStay tuned to local news for important announcements concerning the storm area and forms of assistance, such as food, water, and shelter.", "2020-07-27T10:56:33.000Z": "HFO issues Areal Flood Advisory for Kauai in Kauai [HI] till 3:45 AM HST https:// nwschat.weather.gov/vtec/#2020-O-N EW-PHFO-FA-Y-0111 ", "2020-07-27T09:11:59.000Z": "HFO continues Areal Flood Advisory for Kauai in Kauai [HI] till Jul 27, 1:00 AM HST https:// nwschat.weather.gov/vtec/#2020-O-C ON-PHFO-FA-Y-0110 ", "2020-07-27T08:45:23.000Z": "HFO continues Flash Flood Watch for Kauai Leeward, Kauai Mountains, Kauai Windward, Niihau [HI] https:// nwschat.weather.gov/vtec/#2020-O-C ON-PHFO-FF-A-0005 ", "2020-07-27T08:42:10.000Z": ". @NHC_Pacific Bulletin 11:00PM HST Sunday 7/26/20 \"The Hurricane Warning for Oahu has been canceled.\" #HurricaneDouglas  #Oahu  #HIwx", "2020-07-27T08:12:42.000Z": "HFO issues Areal Flood Advisory for Kauai in Kauai [HI] till Jul 27, 1:00 AM HST https:// nwschat.weather.gov/vtec/#2020-O-N EW-PHFO-FA-Y-0110 ", "2020-07-27T07:41:26.000Z": "TheBus and TheHandi-Van will be resuming service Monday, July 27 by 6 a.m. The Handi-Van will also begin accepting reservations again on Monday, July 27. Depending on road conditions, some services may be impacted. Visit http:// thebus.org for details. Quote Tweet Kirk Caldwell @MayorKirkHNL TheBus and TheHandi-Van will be resuming service Monday, July 27 by 6 a.m. The Handi-Van will also begin accepting reservations again on Monday, July 27. Depending on road conditions, some services may be impacted. Visit http:// thebus.org for details. @hnldts", "2020-07-27T07:17:53.000Z": "#HurricaneDouglas Tropical Cyclone Update 9:10PM HST Sun 7/26/20 @NHC_Pacific  \"Dangerous #Douglas Passing Just North of #Oahu And Approaching #Kauai \"  Position Update- About 75MI NNW of #Honolulu , moving WNW at 16MPH, maximum sustained winds 85MPH  #Hawaii  #HIwx", "2020-07-27T05:48:32.000Z": "Oahu #hitraffic Douglas updates (2 of 2):\nH-3 Freeway at Harano Tunnels - Vehicles staged in the inside lanes will remain there overnight. Staff will begin to take them back to our baseyards tomorrow morning. Please drive with caution and look out for our crews tomorrow.", "2020-07-27T04:20:15.000Z": "#HurricaneDouglas Tropical Cyclone Update 6:10PM HST Sun 7/26/20 @NHC_Pacific  \"Dangerous #Douglas Passing Just North of #Oahu \"  Position Update- About 65MI ENE of #Honolulu , About 110MI E of #Lihue , moving WNW at 16MPH, maximum sustained winds 85MPH  #Kauai  #Hawaii  #HIwx", "2020-07-27T04:31:33.000Z": "Emergency Shelters Closed; Residents can report storm related damage on County of Maui website http:// dlvr.it/RcQl3t", "2020-07-27T04:23:05.000Z": "Oahu #hitraffic  #hiwx sand on the road - Kamehameha Highway in Kaaawa. Roadway crew will scrape and tanker will wash road before opening.", "2020-07-27T03:45:28.000Z": "#RedCross has opened 4 shelters in Kauai County \n*Kalaheo Neighborhood Center: 4480 Papalina Rd, 96741\n*Kauai Community College: 3-1901 Kaumualii Hwy, 96766\n*Kilauea Neighborhood Center: 2460 Keneke St, 96754\n*Kapaa Middle School: 4867 Olohena Rd, 96746 #HurricaneDouglas", "2020-07-27T03:33:03.000Z": "Douglas 5 PM update. Hurricane Warning has been cancelled for Maui County, including the Island of Maui, Lanai, Molokai and Kahoolawe. A Hurricane Warning remains in effect for Oahu and Kauai County, including the islands of Kauai and Niihau. #hiwx", "2020-07-27T02:59:00.000Z": ". @NHC_Pacific Advisory 27  Sunday 7/26/20 5PM HST  \"Dangerous #HurricaneDouglas Passing North Of #Oahu \" About 60MI NE of Honolulu, moving WNW at 16MPH, maximum sustained winds at 85MPH  #Douglas  #Hawaii  #HIwx", "2020-07-27T02:32:33.000Z": "Maui Bus Routes resume services starting Monday, July 27 http:// dlvr.it/RcQXsd", "2020-07-27T02:30:25.000Z": "Oahu #hitraffic  #hiwx Kamehameha Highway in Kaaawa between Kaaawa Beach Park and Kalaeoio reported closed due to debris on roadway https:// hnl.info/a/wc.php?i=19u", "2020-07-27T02:09:41.000Z": "Molokai #hitraffic  #hiwx Rte 450 (Kamehameha V Highway) at Kamalo Dip is passable. Water is flowing approximately 10-inches deep but rains have stopped.", "2020-07-27T02:06:31.000Z": "#HurricaneDouglas Tropical Cyclone Update 4:00PM HST Sun 7/26/20  \"Dangerous #Douglas Passing North of #Maui \"  Position Update- 75MI  ENE of #Honolulu , moving WNW at 16MPH, maximum sustained winds 85MPH #Hawaii  #HIwx", "2020-07-27T02:02:36.000Z": "HFO cancels Flash Flood Watch till Jul 27, 6:00 PM HST https:// nwschat.weather.gov/vtec/#2020-O-C AN-PHFO-FF-A-0005 ", "2020-07-27T00:52:49.000Z": "Here is a time-lapse video from this morning's flight into #HurricaneDouglas supporting the Central Pacific Hurricane Center  #WeatherReady  #ReserveReady  #CPHC  #WC130J  #HurricaneHunters", "2020-07-27T01:26:17.000Z": "Stay safe and brace for #Douglas . #HurricaneDouglasHawaii  #HurricaneDouglas  #BePrepared  @MayorKirkHNL  @HonoluluGov", "2020-07-27T01:18:20.000Z": "#harbors update as of 2 p.m. 7/26 #Douglas restrictions on Hilo and Kawaehae lifted. Mahalo to @USCGHawaiiPac and our harbors staff for getting the underwater scans done quickly via our new vessels Kuleana and Kokua (Kokua pictured when she went into service in mid June).", "2020-07-27T01:20:51.000Z": "#HurricaneDouglas Tropical Cyclone Update 3:00PM HST Sun 7/26/20  \"Dangerous #Douglas Passing North of #Maui \"  Position Update- 90MI  ENE of #Honolulu , 55MI N of Kahului, moving WNW at 16MPH, maximum sustained winds 85MPH #Hawaii  #HIwx", "2020-07-27T00:54:18.000Z": "Molokai #hitraffic  #hiwx avoid Rte 450 at Kamalo Dip (mile marker 10.5) due to debris and flooding.", "2020-07-26T23:01:26.000Z": "TheBus and TheHandi-Van service has ended for today. Buses driving on the road are finishing up their service. @hnldts  @Oahu_DEM  #Douglas", "2020-07-26T23:19:16.000Z": "Need a safe place for you and your pets? \nCome to any of our pet-friendly shelters\n\n*Maui High School: 660 Lono Ave, Kahului, 96732 \n*South Maui Gym: 1501 Liloa Dr., Kihei 96753 \n*King Kekaulike High School: 121 Kula Hwy, Makawao, 96768 \n\nGet pet ready https:// bddy.me/2D4CyPo", "2020-07-26T23:19:44.000Z": "Help keep communication lines open!\n\nIn case of a life threatening emergency, call 9-1-1.\n\nThe City's call center will be taking calls until midnight tonight and tomorrow starting at 7:00AM. \nCall 768-CITY or 808-768-2489. #HurricaneDouglas Quote Tweet Oahu Emergency Mgmt. @Oahu_DEM Help keep communication lines open!\n\nIn case of a life threatening emergency, call 9-1-1.\n\nThe City's call center will be taking calls until midnight tonight and tomorrow starting at 7:00AM. \nCall 768-CITY or 808-768-2489. @HonoluluGov  #HurricaneDouglas", "2020-07-26T23:21:25.000Z": "While we still have power go to, download and print Post Impact Planning information. http:// honolulu.gov/site-dem-sitea rticles/39019-post-impact-planning.html   @MayorKirkHNL  @HonoluluGov", "2020-07-26T23:59:04.000Z": "13 Hawaii Red Cross shelters across Oahu are ready for anyone in need. All locations are pet friendly - seven also have Hawaiian Humane Society volunteers. https:// bddy.me/3f6KjSa via @KITV4  #hurricanedouglas", "2020-07-27T00:09:44.000Z": ". @NHC_Pacific Advisory 26A  Sunday 7/26/20 2PM HST  3 Day Forecast Track, \"Dangerous #HurricaneDouglas Passing North Of #Maui \" About 80MI N of Kahului, About 100MI E of Honolulu, moving WNW at 16MPH, maximum sustained winds at 85MPH  #Douglas  #Hawaii  #HIwx", "2020-07-27T00:11:00.000Z": "2 p.m. update: Maximum sustained winds are near 85 mph with higher gusts. Hurricane conditions are expected. Large swells and heavy rains will continue into Monday. Storm surge may raise water levels by as much as 3 feet. Quote Tweet Kirk Caldwell @MayorKirkHNL 2 p.m. update: Maximum sustained winds are near 85 mph with higher gusts. Hurricane conditions are expected. Large swells and heavy rains will continue into Monday. Storm surge may raise water levels by as much as 3 feet. Make sure you and your loved ones are safe. #Douglas", "2020-07-26T23:09:59.000Z": "Help keep communication lines open!\n\nIn case of a life threatening emergency, call 9-1-1.\n\nThe City's call center will be taking calls until midnight tonight and tomorrow starting at 7:00AM. \nCall 768-CITY or 808-768-2489. @HonoluluGov  #HurricaneDouglas", "2020-07-26T22:56:03.000Z": "HFO expires Areal Flood Advisory for Maui in Maui [HI] till 1:00 PM HST https:// nwschat.weather.gov/vtec/#2020-O-E XP-PHFO-FA-Y-0109 ", "2020-07-26T23:44:48.000Z": "Non-essential state employees on O'ahu, Kaua'i granted administrative leave as #HurricaneDouglas nears the islands.\n\nDetails: Governor's Office - News Release - Non-essential state employees on O'ahu, Kaua'i granted adminis... HONOLULU - Gov. Ige announced today that he is granting non-essential state employees on O'ahu and Kaua'i administrative leave as the state prepares for severe weather resulting from Hurricane... governor.hawaii.gov", "2020-07-26T20:04:01.000Z": "HFO issues Areal Flood Advisory for Maui in Maui [HI] till 1:00 PM HST https:// nwschat.weather.gov/vtec/#2020-O-N EW-PHFO-FA-Y-0109 ", "2020-07-26T21:51:33.000Z": "Hurricane Douglas 11 AM update.\nA Tropical Storm Warning is in effect for the Big Island and a Hurricane Warning is in effect for the rest of the state. #hiwx", "2020-07-26T22:07:02.000Z": "HURRICANE WARNING IN EFFECT UNTIL FURTHER NOTICE http:// dlvr.it/RcQ7VQ", "2020-07-26T22:01:18.000Z": "Waianae: New waterline installation on Kuwale Rd. Weather permitting working hours are Mon to Fri, 7:30 a.m. to 3:30 p.m. \n\nFor water saving tips to help beat the Summer heat visit http:// boardofwatersuppy.com . #WaterForLife  #KaWaiOla", "2020-07-26T21:55:04.000Z": "Please don't hesitate to use these shelters if you feel your home is unsafe. Visit http:// honolulu.gov/dem for more info. Quote Tweet Kirk Caldwell @MayorKirkHNL We have opened 13 emergency shelters for those who feel unsafe sheltering in place. About 350 people are using our shelters as of now. Please don't hesitate to use these shelters if you feel your home is unsafe. Visit http:// honolulu.gov/dem for more info. #Douglas  @Oahu_DEM", "2020-07-26T21:04:50.000Z": "JBPHH is now in TCCOR 1. Please continue to monitor JBPHH & Navy Region Hawaii FB for the most current updates. Mahalo!", "2020-07-26T20:57:39.000Z": ". @NHC_Pacific Advisory 26 Sunday 7/26/20 11AM HST \"Dangerous #HurricaneDouglas Near #Maui \" About 55MI ENE of Kahului, About 140MI E of Honolulu, moving WNW at 16MPH, maximum sustained winds at 85MPH #Douglas  #Hawaii  #HIwx", "2020-07-26T20:40:46.000Z": "Hurricane Douglas Update for Oahu https:// hnl.info/a/wc.php?i=19o", "2020-07-26T18:57:50.000Z": "Hurricane Douglas animated in infrared and water-vapor satellite images through 8 a.m. this morning. Is it my imagination, or did the storm take a menacing turn left toward the end? Images via Mauna Kea Weather Center. #hurricanedouglas  #hiwx", "2020-07-26T20:34:04.000Z": "#HurricaneDouglas  #Oahu  #HIwx Quote Tweet Joint Base Pearl Harbor-Hickam @JointBasePHH Reminder that our JBPHH team is maintaining normal gate operations.  Any updates will be posted soonest.\n\nBe safe/be strong.", "2020-07-26T20:31:19.000Z": "#HurricaneDouglas  #Preparedness  #Oahu  #Hawaii  #HIwx Quote Tweet Hawaiian Electric @HwnElectric Beware of downed power lines. Always assume they're dangerous and stay at least 30 feet or 3 car lengths away. Please report downed power lines to our 24/7 Trouble Line at 1-855-304-1212. #HurricaneDouglas", "2020-07-26T20:30:02.000Z": "#HurricaneDouglas  #Oahu  #Hawaii  #HIwx Quote Tweet Oahu Emergency Mgmt. @Oahu_DEM Hurricane Douglas Update for Oahu https:// hnl.info/alerts/wcBody. php?i=19o   @MayorKirkHNL  @HonoluluGov", "2020-07-26T20:29:25.000Z": "#HurricaneDouglas  #Hawaii  #HIwx Quote Tweet Hawaii News Now @HawaiiNewsNow How to stream Hawaii News Now online if you lose satellite coverage https:// bit.ly/2OU419c  #HNN", "2020-07-26T20:22:08.000Z": "TheBus and TheHandi-Van will end service at 12 noon Sunday July 26 2020. All buses/vans operating at 12 p.m. will continue in service to their scheduled destination then proceed out of service. Please complete your travel well before 12 noon. Quote Tweet Transportation HNL @hnldts HURRICANE WARNING 7/26/2020\n\nTheBus and TheHandi-Van will end service at 12 noon Sunday July 26 2020. All buses/vans operating at 12 p.m. will continue in service to their scheduled destination then proceed out of service. Please complete your travel well before 12 noon.", "2020-07-26T20:15:37.000Z": "WATCH #HurricaneDouglas briefing, Sunday July 26, 2020: http:// facebook.com/GovernorDavidI ge   @CountyofMaui  @MayorKirkHNL County of Kauai @NWSHonolulu  @Hawaii_EMA  @FEMARegion9  @USCG  @DOTHawaii  @ScottMorishige  @HwnElectric  @HIGoodEnergy  @RedCross", "2020-07-26T19:59:03.000Z": "Additional FEMA supplies have arrived on Maui. Last night a C-17 aircraft delivered 36 pallets of meals, 19 pallets of water, and nine pallets of electrical support ahead of Hurricane Douglas. Maui is expected to feel impacts over the next two hours. #HurricaneDouglas", "2020-07-26T16:14:07.000Z": "The path and forecast to aloha has pretty consistent - models, science, communicate thank u @NOAA  @NWSHonolulu Quote Tweet HAWAI'I STORM WATCH @HIStormWatch . @NHC_Pacific  #Douglas Forecast Track Cone archive images loop from Monday 7/20 5AM to Sunday 7/26 2AM HST  #Hurricane  #Hawaii  #HIwx", "2020-07-26T16:23:53.000Z": "Maui #hitraffic  #hiwx Traffic signals flashing at Honoapiilani Highway/Waiko Road and Honoapiilani/Maui Lani Parkway. Don't be out on the road unless absolutely necessary.", "2020-07-26T16:41:02.000Z": "Hawaiian Electric restores power to all customers in Wailuku and Waikapu areas. http:// dlvr.it/RcPWNX", "2020-07-26T19:05:35.000Z": "Hurricanes #Hanna & #Douglas bring flash floods. Stay safe: Monitor updates from local officials, @NHC_Pacific & @NHC_Atlantic  Pack a go-bag in case you have to evacuate quickly Do NOT drive in flood waters Avoid bridges with fast-moving water http:// Ready.gov/Hurricanes", "2020-07-26T15:05:10.000Z": "Here's the latest @NOAA 's #GOES17 loop of #HurricaneDouglas as it approaches Hawaii early this morning. Get updates here: http:// nhc.noaa.gov  #HIwx GIF Quote Tweet NWSHonolulu @NWSHonolulu Jul 26, 2020 5 AM HST UPDATE: Hurricane conditions are expected in portions of Maui County today, on Oahu by this afternoon, and on Kauai and Niihau tonight. Tropical Storm conditions are imminent across the Big Island. #hiwx  #HurricaneDouglas", "2020-07-26T17:46:40.000Z": "#HurricaneDouglas is headed for Hawaii holding strength as a Cat 1. Warnings are in effect for #Maui County, #Kauai County, and #Oahu . Residents should be familiar with their local emergency shelters and prepare for damaging winds, flash floods, and high surf.\n\nBe safe HI Ohana!", "2020-07-26T18:00:19.000Z": "The eye of #Douglas is moving into radar range as it emerges out of the beam blockage from the mountains of Hawaii. Looks formidable!  Be safe and rush any precautions to completion", "2020-07-26T18:08:10.000Z": "The County of Maui will sound warning sirens for Hurricane Douglas at 8:30 a.m. today to alert Maui County residents to shelter in place and stay informed. https:// mauicounty.gov/CivicAlerts.as px?AID=10274 ", "2020-07-26T18:13:36.000Z": "HDOT Highways updates for Douglas as of 8 a.m. July 26 at HDOT Highways Hurricane Douglas updates July 26 HONOLULU - Hawaii Department of Transportation (HDOT) Highways Division updates on Hurricane Douglas as of 8 a.m. Sunday, July 26 are: Hawaii District reports rain continues on the north shore. Staff... hidot.hawaii.gov", "2020-07-26T07:17:52.000Z": "Hawaiian Airlines is moving 54 of 62 aircraft from Oahu to avoid Hurricane Douglas which is approaching the Hawaiian Islands. Their A330 and A321 jets will primarily be stored in cities along the mainland west coast.", "2020-07-26T17:47:57.000Z": "HURRICANE DOUGLAS: Here's a list of all Oahu evacuation shelters for Hurricane Douglas: @KHONnews", "2020-07-26T18:41:59.000Z": "Hurricane Douglas 8 AM update. Tropical Storm Warning is in effect for the Big Island and a  Hurricane Warning is in effect for the the rest of the state. #hiwx", "2020-07-26T18:51:51.000Z": "Hurricane #Douglas has maintained its strength overnight, and we are expecting to experience tropical storm-force winds this afternoon, into the evening. Heavy rain expected for 12-18 hours after it passes. Shelter in place if possible, learn more at http:// honolulu.gov/dem Quote Tweet Kirk Caldwell @MayorKirkHNL Hurricane #Douglas has maintained its strength overnight, and we are expecting to experience tropical storm-force winds this afternoon, into the evening. Heavy rain expected for 12-18 hours after it passes. Shelter in place if possible, learn more at http:// honolulu.gov/dem", "2020-07-26T18:54:29.000Z": "Maui #hiwx Keanae crew just finished clearing a downed tree on Hana Highway at mile marker 34. Reminder to stay indoors unless absolutely necessary.", "2020-07-26T18:10:02.000Z": "Warning Siren scheduled for 8:30 a.m. alerting residents to Shelter in Place and Stay Informed http:// dlvr.it/RcPhlX", "2020-07-26T08:40:03.000Z": "Hurricane #Douglas Advisory 24: Dangerous Hurricane Douglas Drawing Closer to Hawaii. Hurricane Warning Issued For Kauai County. http:// go.usa.gov/W3H", "2020-07-26T08:50:29.000Z": ". @NHC_Pacific Advisory 24 Saturday 7/25/20 11PM HST \"Dangerous #HurricaneDouglas Drawing Closer To #Hawaii , #Hurricane WARNING Issued For #Kauai County\"  About 335MI E of Honolulu, moving WNW at 16MPH, maximum sustained winds at 90MPH #Hawaii  #HIwx", "2020-07-26T08:55:16.000Z": ". @NHC_Pacific  #HurricaneDouglas Advisory 24 Saturday 7/25/20 11PM HST  3 Day Forecast Track  \" #Hurricane  #WARNING has been issued for #Kauai , remains in effect for #Oahu \" https:// bit.ly/3g12iut  #Douglas  #Hawaii  #HIWx", "2020-07-24T21:05:06.000Z": "With #HurricaneDouglas approaching, we encourage all to stay informed with up-to-date news. Here's a few to follow @NWSHonolulu , @Hawaii_EMA , @Oahu_DEM ; @CivilDefenseHI , @CountyofMaui & local news media @hawaiinewsnow , @StarAdvertiser , @KHONnews , @KITV4", "2020-07-26T00:38:50.000Z": "Hawaii Red Cross volunteers are working in various areas as we prepare for Hurricane Douglas! if you would like to volunteer, please go to http:// redcross.org/hawaii or call 808-739-8122. Mahalo to all Red Cross volunteers!", "2020-07-26T02:30:06.000Z": "Download the free #RedCross Emergency App for real-time alerts, open shelters and advice on emergency situations.\n\nThe Emergency App includes an \"I'm Safe\" feature that helps people check on loved ones. Search \"American Red Cross\" in app stores or go to https:// bddy.me/2Xdb0ib .", "2020-07-26T06:48:47.000Z": "As #HurricaneDouglas inches closer, the Hawaii Red Cross recommends sheltering-in-place at home with family, friends or neighbors, if it is safe.\n\nHowever, if you need to finder a safer place, the following evacuation centers in Maui County have been opened.", "2020-07-26T03:30:04.000Z": "Don't forget your pets. Bring them indoors and maintain direct control of them. Prepare a pet emergency kit with leashes food, water, bowls, litter and box. \nGet more information about what you can do to get ready: https:// bddy.me/3jFkyvQ", "2020-07-24T14:00:05.000Z": "Protect yourself and everyone around you. Wear a mask.", "2020-07-26T08:36:20.000Z": "After the storm, communications may be down. Take time NOW to review, download or print the info you will need after impact. 1/9 #hurricanedouglas  #HurricaneDouglasHawaii  #douglas  #preaparenowthrivelater  @MayorKirkHNL  @HonoluluGov  @Hawaii_EMA  @HawaiiRedCross  @HIgov_Health", "2020-07-26T08:09:20.000Z": "New map is a worst case composite for a storm similar in intensity, forward speed, and trajectory as #Douglas , incorporating uncertainties in the track, intensity, and size forecast. View map to make sheltering decisions at http:// bit.ly/shelterinplace orevacuate  . @MayorKirkHNL  @HonoluluGov", "2020-07-26T08:28:04.000Z": "#HurricaneDouglas Satellite longwave infrared images loop  Saturday 7/25/20 7:35pm to 10:05pm HST via @TropicalTidbits  #Hurricane  #Douglas  #Hawaii  #HIwx", "2020-07-26T07:33:39.000Z": "", "2020-07-26T07:20:16.000Z": "Great resource to track information for Hawaii County for #douglas Quote Tweet COH Civil Defense @CivilDefenseHI The Weather Impact Tracking Map has the most current information on hazards, road closures, and other impacts.\n\nLink: https:// bit.ly/2EefVIM Please note that the map is currently blank because there are no hazards that have resulted from Hurricane Douglas yet.", "2020-07-26T06:54:02.000Z": "Mayor Victorino urges residents to shelter in place starting tonight and through Sunday http:// dlvr.it/RcNKn0", "2020-07-26T06:55:16.000Z": "#hiwx reset of coastal highway protection on Kamehameha Highway in Hauula ahead of #Douglas completed. #staysafehi", "2020-07-26T06:22:16.000Z": "For a list and map of shelters on Oahu, visit http:// bit.ly/openshelters .\n\nFor more information on how to better prepare yourself for #hurricanedouglas , visit http:// bit.ly/hurricanedougl as  Quote Tweet Oahu Emergency Mgmt. @Oahu_DEM For a list and map of open shelters on Oahu, visit http:// bit.ly/openshelters .\n\nFor more information on how to better prepare yourself for #hurricanedouglas , visit http:// bit.ly/hurricanedougl as  .  4/4 Show this thread", "2020-07-26T05:57:56.000Z": ". @NHC_Pacific Advisory 23A Saturday 7/25/20 8PM HST \" #HurricaneDouglas Drawing Closer To #Hawaii \"  About 390MI ESE of Honolulu, moving WNW at 16MPH, maximum sustained winds at 90MPH #Hurricane  #Douglas  #Hawaii  #HIwx", "2020-07-26T05:57:47.000Z": "While hurricane evacuation shelters should be a LAST RESORT, if you need to evacuate to one, please make sure to bring the following supplies. 1/ #HurricaneDouglas  #Douglas  @MayorKirkHNL  @HonoluluGov  @Hawaii_EMA  @HawaiiRedCross", "2020-07-26T05:13:49.000Z": "Hurricanes can cause dangerous and destructive high winds, flooding, heavy rain and storm surges. Carbon monoxide poisoning and driving through floodwaters cause injury and death after storms.\nFollow these tips to keep yourself and your family safe: https:// mauicounty.gov/CivicAlerts.as px?AID=10271 ", "2020-07-26T05:25:33.000Z": "Avoid Carbon Monoxide Poisoning and other dangers after Hurricane Douglas makes landfall http:// dlvr.it/RcNBmh", "2020-07-26T05:25:54.000Z": "#HurricaneDouglas  #HECO  #Hawaii  #Oahu  #Preparedness  #HIwx Quote Tweet Hawaiian Electric @HwnElectric As #HurricaneDouglas approaches, make sure you have your Emergency Outage Kits ready! For additional ideas and preparation tips, read our Handbook for Emergency Preparedness, available in five languages, at http:// hawaiianelectric.com/prepare .", "2020-07-26T05:13:11.000Z": "#HurricaneDouglas Satellite longwave infrared loop images  Saturday 7/25/20 2:00pm to 6:45pm HST via @TropicalTidbits  #Hurricane  #Douglas  #Hawaii  #HIwx", "2020-07-26T04:48:20.000Z": "7-25, 6pm. Hurricane Douglas 240 miles east of Hilo. http:// hawaiicounty.gov/active-alerts", "2020-07-26T03:27:40.000Z": "ALL RESIDENTS SHOULD PREPARE TO SHELTER IN PLACE. Emergency shelters are available for anyone who cannot shelter in place at home or at a friend/family's house. Shelters will be open at 7 p.m. tonight. For the full list: https:// mauicounty.gov/CivicAlerts.as px?AID=10269 ", "2020-07-26T04:27:03.000Z": "Flash Flood Watch - Maui, Molokai and Kahoolawe until 12 pm Monday http:// dlvr.it/RcN6Jg", "2020-07-26T04:27:05.000Z": "Tropical Storm Warning and Hurricane Watch in effect for Maui County until further notice http:// dlvr.it/RcN6Jr", "2020-07-26T04:27:07.000Z": "Maui Bus Routes to be suspended starting tomorrow due to Hurricane Douglas http:// dlvr.it/RcN6Jz", "2020-07-26T04:27:08.000Z": "Public asked to conserve water to prevent sewer spills due to Hurricane Douglas http:// dlvr.it/RcN6K3", "2020-07-26T04:27:09.000Z": "Mayor Victorino announces County of Maui emergency shelter plans http:// dlvr.it/RcN6K4", "2020-07-26T04:27:04.000Z": "Hurricane Watch in effect for all Maui County http:// dlvr.it/RcN6Jm", "2020-07-26T04:27:02.000Z": "High Surf Warning - East facing shores Maui, Molokai and Kahoolawe until 6 am Monday http:// dlvr.it/RcN6Hx", "2020-07-26T04:26:29.000Z": "Tropical Storm Force Winds are 60% probable for Hana and Kahului, and 45% probable for Lanai City.\nStore and secure outdoor objects such as lawn furniture and other loose lightweight objects such as toys, garden tools, and garbage cans.\nFor more tips: https:// bit.ly/2CEEFd2", "2020-07-26T04:08:20.000Z": "Hurricane Douglas may begin impacting Oahu as early as Sunday afternoon. 13 emergency shelters will open 9 a.m. Sunday. These shelters are last resorts, when sheltering at home is unsafe. You must wear a face mask and bring your own supplies. Info: http:// bit.ly/hurricanedougl as ", "2020-07-26T03:53:07.000Z": "A Hurricane Warning remains in effect for O'ahu. If you are unable to shelter in place, shelters will be opening tomorrow morning at 9 a.m. \n\nTo learn more, please visit: http:// bit.ly/hurricanedougl as  Subscribe to text alerts: http:// HNL.info  #Douglas  @Oahu_DEM", "2020-07-26T04:00:16.000Z": "Watch for downed power lines. Stay at least 30 feet away (about three car lengths) from downed power lines, as they may have electricity running through them and may be dangerous. Read full news release: http:// hwnelec.co/EO6r50AI6O6 .", "2020-07-26T03:58:31.000Z": "The Bus will be curtailing service at noon Sunday. Please plan accordingly, and limit trips to essentials. Conditions permitting, The Bus will resume service at 6 a.m. on Monday morning. Visit http:// thebus.org for more information @hnldts  @Oahu_DEM  #Douglas", "2020-07-26T03:44:11.000Z": "Tropical systems come close to aloha over time, our small targets make direct hits few and far between, many pass by or have indirect impacts that can be just disrupting - don't follow the line look out for flooding, winds, and landslides #BePrepared", "2020-07-26T03:37:21.000Z": "pacific light fades away, as #douglas ready for final approach to #aloha - impacts in next 24hrs are expected, take time to check in with you community members nearby and #BePrepared - this path will create some challenges GIF", "2020-07-26T03:37:08.000Z": "July 25, 2020 5 PM Update.\nHurricane Warning for Oahu. Hurricane Watch and Tropical Storm Warning for Maui County and Big Island. Tropical Storm Warning for Niihau and Kauai. #hiwx", "2020-07-26T03:23:40.000Z": "UPDATE 5:00 PM - Hurricane conditions possible across Maui County on Sunday. Tropical Storm conditions expected beginning late tonight or Sunday. Large swells/storm surge will produce life threatening and potentially destructive surf. For more info, visit http:// MauiCounty.gov", "2020-07-26T02:50:03.000Z": "Hurricane #Douglas Advisory 23: Hurricane Douglas Continues to Move West-Northwest Toward Hawaii. Tropical Storm Warning Issued For Kauai County. http:// go.usa.gov/W3H", "2020-07-26T02:21:05.000Z": "HFO continues Flash Flood Watch till Jul 27, 6:00 PM HST https:// nwschat.weather.gov/vtec/#2020-O-C ON-PHFO-FF-A-0005 ", "2020-07-26T02:12:52.000Z": "The Weather Impact Tracking Map has the most current information on hazards, road closures, and other impacts.\n\nLink: https:// bit.ly/2EefVIM Please note that the map is currently blank because there are no hazards that have resulted from Hurricane Douglas yet.", "2020-07-25T22:11:33.000Z": "If you need to stay at a disaster shelter during #HurricaneDouglas , take actions to protect yourself and others from #COVID19 . Learn more: https:// cdc.gov/disasters/hurr icanes/covid-19/public-disaster-shelter-during-covid.html ", "2020-07-26T00:27:31.000Z": "The County of Maui, Department of Environmental Management strongly encourages the public to conserve water to minimize sewage from entering facilities and prevent potential sewer spills due to Hurricane Douglas. https:// mauicounty.gov/CivicAlerts.as px?AID=10268 ", "2020-07-26T00:22:47.000Z": "This is a Hurricane Douglas informational message for Saturday, July 25th, at 1:00 in the afternoon. Click for details. http:// records.hawaiicounty.gov/Weblink/1/doc/ 107585/Page1.aspx ", "2020-07-26T01:00:12.000Z": "Sources to follow for information about #hurricanedouglas  https:// dod.hawaii.gov/hiema/get-read y/   @CivilDefenseHI  @CountyofMaui  @Oahu_DEM  @Hawaii_EMA  https:// kauai.gov/KEMA Get Ready Get Ready Hawai'i Visit each county's emergency management website for more information about county-specific preparedness tips and measures. Sign up for free text-based notifications for the latest... dod.hawaii.gov", "2020-07-26T00:30:38.000Z": "Here are some helpful tips to sanitize water post-impact. 4/5", "2020-07-25T23:56:11.000Z": "UPDATE:\n\nTheBus/TheHandi-Van is operating normally TODAY.\n\nTOMORROW: Sunday 7/26/2020, TheBus and TheHandi-Van will end service at 12:00 PM (noon). Please complete your travel well before 12 noon.", "2020-07-26T00:28:41.000Z": "#HurricaneDouglas is tracking toward the Hawaiian Islands. A Hurricane Warning is in effect for #Oahu ; a Watch and Tropical Storm Warning are in effect for Hawaii County and #MauiCounty . A Tropical Storm Watch is in effect for #KauaiCounty .\nStay safe HI from Douglas and COVID!", "2020-07-26T00:27:57.000Z": "No need to buy expensive water in preparation for #hurricanedouglas when we have some of the best water in the world coming out of our taps. 1/5 @MayorKirkHNL  @HonoluluGov  @BWSHonolulu", "2020-07-25T21:24:56.000Z": "July 25, 2020 11:00 AM Update.\nHurricane Warning for Oahu. Hurricane Watch and Tropical Storm Warning for Maui County and Big Island. Tropical Storm Watch for Niihau and Kauai. #hiwx", "2020-07-25T22:26:17.000Z": "After the storm has passed, we will use our social media channels to keep customers informed about the progress of its restoration effort. For updates, alerts and to report an outage, Oahu customers also may download our free mobile app. http:// hwnelec.co/EO6r50AI6O6 .", "2020-07-26T01:47:08.000Z": "WATCH #HurricaneDouglas News Conference - Saturday, July 25, 2020. @MayorKirkHNL  @NWSHonolulu  @Hawaii_EMA  @HawaiiTAG  @FEMARegion9  @USCG  @DOTHawaii  @ScottMorishige  @HwnElectric  @HIGoodEnergy  @RedCross Governor David Ige on Facebook Watch July 25, 2020 News Conference: Hurricane Douglas briefing - Mayor Kirk Caldwell - John Bravender or Leigh Anne Eaton, US National Weather Service... facebook.com", "2020-07-25T22:27:44.000Z": "Updates on HDOT preparation for #Douglas at https:// hidot.hawaii.gov/blog/2020/07/2 5/hdot-hurricane-douglas-update-1-july-25/  (Picture is of the hurricane shutters deployed on our Kauai baseyard.)", "2020-07-25T21:50:44.000Z": "Joining me this afternoon for a briefing on #HurrcaneDouglas are @MayorKirkHNL , @NWSHonolulu , @Hawaii_EMA , @HawaiiTAG , @FEMARegion9 , @USCG Hawaii, @DOTHawaii , @ScottMorishige , @HwnElectric , @HIGoodEnergy , @RedCross", "2020-07-25T21:06:56.000Z": "A \"Hurricane WARNING\" has been issued for the island of Oahu, which means that hurricane conditions are expected within the next 36 hours. Please prepare accordingly. @Oahu_DEM Quote Tweet Kirk Caldwell @MayorKirkHNL Our hurricane watch has been upgraded to a Hurricane Warning, meaning hurricane conditions are expected on O'ahu in the next 36 hours. Please prepare accordingly. http:// honolulu.gov/dem  http:// hnl.info for text alerts #HurricaneDouglas  #Douglas  @Oahu_DEM", "2020-07-25T21:03:05.000Z": ". @NHC_Pacific  #HurricaneDouglas Advisory 22 Saturday 7/25/20 11AM HST  3 Day Forecast Track  #Hurricane  #WARNING Has Been Issued For The Island Of #Oahu  #Douglas  #Hawaii  #HIWx", "2020-07-25T20:58:28.000Z": ". @NHC_Pacific Advisory 22 Saturday 7/25/20 11AM HST \" #Hurricane WARNING Has Been Issued For #Oahu \"  About 520MI ESE of Honolulu, moving WNW at 18MPH, maximum sustained winds at 90MPH #HurricaneDouglas  #Hawaii  #HIwx", "2020-07-25T19:47:25.000Z": "Current port conditions for Hawaii State ahead of Hurricane Douglas are as follows:\n\nHawaii County - Yankee\nMaui County - Yankee\nHonolulu County - X-Ray\nKauai County - X-Ray\n\nFor more information visit: https:// bit.ly/3eVe0Wg Stay informed, Stay Safe #HurricaneDouglas GIF", "2020-07-25T20:41:54.000Z": " #HurricaneDouglas continues to move west-northwest towards Hawaii. You can monitor the progress of the storm here: https:// nhc.noaa.gov/?cpac", "2020-07-25T20:50:19.000Z": "#HurricaneDouglas is forecast to bring severe winds to Oahu starting midday tomorrow. Visit http:// bit.ly/hurricanedougl as  to see more preparations you can do TODAY to keep yourself and your family safe! #PreparedNotScared  #Douglas  @MayorKirkHNL  @HonoluluGov  @Hawaii_EMA", "2020-07-25T19:35:45.000Z": "The following public safety measure and recommendation are now in effect:\n\nBoat and aircraft owners should take measures to secure their vessels. Do complete these measures before nightfall.", "2020-07-25T19:28:52.000Z": "Hurricane Douglas alert for Maui County https:// mauicounty.gov/AlertCenter.as px?AID=1521 ", "2020-07-25T19:32:27.000Z": "As Hurricane Douglas approaches and is expected to arrive late tonight/early Sunday, please keep yourself informed with the latest reliable information.  Click on our Tropical Cyclone Douglas webpage:  https://tc-d ouglas-hawaiicountygis.hub.arcgis.com", "2020-07-25T19:00:23.000Z": "Stay up to date, connected, and safe with Hawai'i County Civil Defense notifications by email or text message. #HawaiiCounty  #BeConnected  #BeSafe  #BeSmart  #HurricaneDouglas Link:  https://tc-d ouglas-hawaiicountygis.hub.arcgis.com", "2020-07-25T15:20:50.000Z": " #HurricaneDouglas remains a cat 2 storm. Threatening entire island chain tonight through Mon AM. Expected to impact Honolulu by Sun evening as a Cat 1 hurricane. Plan for tropical force winds. Have battery operated radio and/or iHeartRadio app in case of power outages.", "2020-07-25T17:42:54.000Z": "Press Release - City and County of Honolulu Emergency Operations Center in partial activation as of 7 a.m. Friday, July 24 https:// hnl.info/alerts/wc.php? i=19j   @MayorKirkHNL  @HonoluluGov", "2020-07-25T18:11:44.000Z": "\"Storms have the potential to damage our equipment - including bringing down our power lines,\" shares Robert Yang, a digital communications and social media specialist at @HwnElectric . Read more: http:// hwnelec.co/8Fcq50AI22a .", "2020-07-25T18:55:30.000Z": "7-25, 8am. A Hurricane Watch for the Island of Hawaii. http:// hawaiicounty.gov/active-alerts", "2020-07-25T18:55:03.000Z": "#HurricaneDouglas  #Oahu  #HIwx Quote Tweet Kirk Caldwell @MayorKirkHNL O'ahu is now under a Hurricane Watch, with tropical storm-force winds possible as early as noon tomorrow. Please make sure you and your family are prepared. Hope for the best, but plan for the worst. #Douglas  @Oahu_DEM", "2020-07-25T18:53:14.000Z": ". @NHC_Pacific Advisory 21A Saturday 7/25/20 8AM HST \" #Hurricane  #Douglas Continues To Move West-Northwest Toward #Hawaii \"  About 590MI ESE of Honolulu, moving WNW at 18MPH, maximum sustained winds at 100MPH #HurricaneDouglas  #HIwx", "2020-07-25T18:31:36.000Z": "There is still time to prepare for Hurricane Douglas. Please get your emergency kits ready and keep precautions for COVID-19 in mind as well.", "2020-07-25T14:54:32.000Z": "Jul, 25, 2020 5 AM HST UPDATE: Tropical Storm Warning for Big Island and Maui County. Hurricane Watch for Big Island, Maui County and Oahu. A Tropical Storm Watch has been issued for Kauai County. #hiwx", "2020-07-25T12:10:49.000Z": "Jul 25, 2020 2 AM HST: Hurricane Douglas is a category 2 hurricane and continues to track west-northwest toward Hawaii. Tropical Storm conditions are expected across Hawaii County and Maui County beginning Saturday night or Sunday...read latest update @ https:// nhc.noaa.gov/text/refresh/H FOTCPCP2+shtml/251149.shtml  ?", "2020-07-25T09:49:31.000Z": "Douglas remains a powerful hurricane as confirmed by the U.S. Air Force 53rd Weather Reconnaissance Squadron.  Tropical Storm Warnings have been issued for Hawaii County and Maui County. #HurricaneHunters  #hiwx", "2020-07-25T09:04:25.000Z": "#Category2  #Hurricane  #Douglas Three Day Forecast Earliest Reasonable Arrival Time of Tropical-Storm-Force Winds via @NHC_Pacific Advisory 20 as of Friday 7/24/20 11PM HST #Cat2  #HurricaneDouglas  #Hawaii  #HIwx", "2020-07-25T08:59:07.000Z": ". @NHC_Pacific Advisory 20 Friday 7/24/20 11PM HST https:// bit.ly/2ZXHs9I  #Cat2 \" #Douglas Weakens Slightly But Still Heading Toward #Hawaii \" About 750MI ESE of Honolulu, moving WNW 18MPH, maximum sustained winds 110MPH  #Category2  #HurricaneDouglas  #HIWx", "2020-07-25T08:47:54.000Z": "#TropicalStorm  #WARNING issued for #Hawaii and #Maui Counties from the NWS Central Pacific Hurricane Center 11PM HST 7/24/20 Advisory 20 https:// nhc.noaa.gov/text/refresh/H FOTCMCP2+shtml/DDHHMM.shtml   #HurricaneDouglas  #HIwx", "2020-07-24T22:29:48.000Z": "PDC is tracking #HurricaneDouglas as it nears the Hawaiian Islands. To ensure the safety of our Ohana across all islands, we recommend residents prepare now and follow  recommendations of local officials.\n\nVisit http:// disasteralert.pdc.org /download the app for the most reliable info", "2020-07-25T08:13:39.000Z": "#douglas hunters providing critical data for the road ahead toward aloha - @53rdWRS thank you for your service", "2020-07-15T12:45:08.000Z": "It's hurricane season! Be ready. Keep a list of important contacts you may need for reference. #HurricaneTip", "2018-09-13T15:03:45.000Z": "#HurricaneTip : write this down now, because if your power is out, your internet probably will be, too. Quote Tweet MC Emergency Mgmt @ReadyMontgomery During extreme weather, keep your electric company's phone # ready to report an outage if your power goes out. Don't assume someone will report it for you! #MoCoPrepares  BG&E - 1-877-778-2222 First Energy/Potomac Edison - 1-888-544-4877 PEPCO - 1-877-737-2662", "2017-09-08T20:01:50.000Z": "#HurricaneTip : Now is the time to assemble your Emergency Supply Kit. Here are some of the basics you should have for #HurricaneIrma", "2020-07-24T22:00:25.000Z": "#HurricaneTip - Unplug electric appliances you may not need or use until the storm has passed or until power is restored. Read full news release: http:// hwnelec.co/Lt0b50AGNSE . Hawaiian Electric urges customers to be prepared as Hurricane Douglas approaches As Hurricane Douglas approaches the islands with the potential for high winds and heavy rains, Hawaiian Electric is proactively preparing to respond, and customers should have their emergency plans... hawaiianelectric.com", "2020-07-24T23:00:27.000Z": "#HurricaneTip - Tie down or store loose objects outside your home, bring potted plants inside and remove and store lanai furniture. Read full news release: http:// hwnelec.co/bMt550AHuVX . Hawaiian Electric urges customers to be prepared as Hurricane Douglas approaches As Hurricane Douglas approaches the islands with the potential for high winds and heavy rains, Hawaiian Electric is proactively preparing to respond, and customers should have their emergency plans... hawaiianelectric.com", "2020-07-25T01:15:04.000Z": "#HurricaneTip - Cover all windows and door openings with boards, shutters, or other shielding materials. Wedge a dowel or a piece of broom handle into the track of sliding glass doors to secure them. Read full news release: http:// hwnelec.co/CMtn50AHwZp . Hawaiian Electric urges customers to be prepared as Hurricane Douglas approaches As Hurricane Douglas approaches the islands with the potential for high winds and heavy rains, Hawaiian Electric is proactively preparing to respond, and customers should have their emergency plans... hawaiianelectric.com", "2020-07-24T01:13:09.000Z": "Are you 2 weeks ready? Here are some tips you can use to be prepared during this hurricane season. Learn more at http:// dod.hawaii.gov/hiema/", "2020-07-25T04:30:00.000Z": "7-24, 6pm. Hurricane Watch for the Island of Hawaii. http:// hawaiicounty.gov/active-alerts", "2020-07-25T05:13:29.000Z": "Using the guidance on http:// bit.ly/shouldievacuate , decide NOW if your home or condo is safe to shelter in during #hurricanedouglas . If it is not safe, talk to family/friends that may have a safer home that you can stay in. 1/4 @MayorKirkHNL  @HonoluluGov  @Hawaii_EMA  @HawaiiRedCross", "2020-07-25T06:52:39.000Z": "Hurricane Douglas Intermediate Advisory Number 19A issued \n800 PM HST Fri Jul 24 2020... https:// nhc.noaa.gov/text/refresh/H FOTCPCP2+shtml/250548.shtml  ? #hiwx  #FlyNOAA", "2020-07-25T04:03:02.000Z": "Boarding up your windows: If you have the tools, plywood and help available this video will show you how to protect your windows. It is also Closed Captioned. Stay safe! https:// tinyurl.com/yy2om97f  @MayorKirkHNL  @HonoluluGov How to Board Up Windows Prepare for hurricanes and learn how to board up windows with the right materials and install them correctly to protect your home. This Home Depot guide shows how to use basic skills to prevent... homedepot.com", "2020-07-25T04:40:40.000Z": "#BREAKING In effect from 6 a.m. Saturday to 6 a.m. Monday. High Surf Warning: East facing shores of Molokai, Maui, Big Island and Kaho'olawe Dangerously large breaking waves of 15 to 25 feet. kitv.com", "2020-07-25T04:40:10.000Z": "Numerous State Parks Closing in Advance of Douglas https:// mauinow.com/2020/07/24/num erous-state-parks-closing-in-advance-of-douglas/?t=1595651924 ", "2020-07-25T04:35:56.000Z": "Hurricane Douglas July 24, 2020 5PM HST Update. Hurricane watch for Oahu, Maui County, and Big Island", "2020-07-25T04:21:06.000Z": "Evacuation shelters will feature temp checks, social distancing https:// bit.ly/2WWrVVM  #HNN Evacuation shelters will feature temp checks, social distancing They're urging people who can to shelter in place or with friends or family. hawaiinewsnow.com", "2020-07-25T03:50:10.000Z": "Visualizing wind speed and gusts #HurricaneDouglas  #HIwx Video by http:// Windy.com", "2020-07-25T04:16:47.000Z": ". @HawaiianAir cancels all Neighbor Island flights on Sunday due to Hurricane Douglas via @mauiwatch Hawaiian Airlines cancels all Neighbor Island flights on Sunday due to Hurricane Douglas - MAUIWatch Hawaiian Airlines is canceling all Neighbor Island flights on Sunday, in addition to select flights tomorrow evening between Honolulu and Maui and the Island of Hawaii, due to adverse weather... mauiwatch.com", "2020-07-25T04:21:05.000Z": "Hurricane Hunters fly into the storm to gather data forecasters can't get https:// bit.ly/3hAdezC  #HNN Hurricane Hunters fly into the storm to gather data forecasters can't get \"One of the most valuable pieces of information we collect is the actual pressure of the hurricane.\" hawaiinewsnow.com", "2020-07-25T04:24:00.000Z": "Hurricane Preparedness 6 Point Action Plan https:// youtu.be/CkLN8pfKTsk via @YouTube  #BePrepared  #StaySafe  #StayHealthy  #LiveAloha Hurricane Preparedness 6 Point Action Plan Hurricane season is upon us. Follow this 6 point plan to keep your ohana safe during and after the storm. youtube.com", "2020-07-25T04:13:31.000Z": "In light of the approaching Hurricane Douglas, schools are required to cancel all student programming, including extended school year (ESY) programs, currently scheduled for Monday, July 27.", "2020-07-25T03:00:13.000Z": "A hurricane watch was issued for O'ahu, and the city is working hard to ensure the safety of our communities and city employees as Hurricane Douglas approaches our island. Please visit http:// honolulu.gov/DEM for more information.", "2020-07-25T03:22:36.000Z": "Hurricane Douglas July 24, 2020 5PM HST Update. Hurricane watch for Oahu, Maui County, and Big Island", "2020-07-25T02:55:10.000Z": "Record numbers of COVID-19 cases with 60 today. Most cases occur as a result of socializing with work colleagues, extended family, or friends -without wearing face coverings or distancing. We can all help slow the spread of COVID-19. http:// HawaiiCOVID19.com  #HawaiiCOVID19", "2020-07-25T02:50:23.000Z": "Oahu is now under a hurricane watch along with Maui County and the Big Island. All islands are under a flood watch.", "2020-07-25T03:30:03.000Z": "JULY 24, 2020 http:// hawaiicovid19.com New cases: 60\nTotal cumulative cases: 1,549\nTotal hospitalized: 29\nNew deaths: 0\nTotal deaths: 26\nTotal number of individuals tested: 112,790\n\nMore from the AG office, DOH, DOD, DAGS and DLIR: Hawaii COVID-19 Joint Information Center Daily News Digest, July 24, 2020 Governor's Office: Modified Quarantine Rules in Place During Tropical Cyclone The State of Hawai'i's mandatory 14-day quarantine rule for travelers is being modified temporarily in consideration of... governor.hawaii.gov", "2020-07-24T21:54:05.000Z": "Are you planning to stay with family or friends this weekend? Start the discussion on how you can all best protect each other from #COVID19 . https:// cdc.gov/coronavirus/20 19-ncov/daily-life-coping/living-in-close-quarters.html ", "2020-07-24T21:54:45.000Z": "7-24, noon. Hurricane Watch for the Island of Hawaii. http:// hawaiicounty.gov/active alerts", "2020-07-24T22:00:00.000Z": "Stay up to date, connected, and safe with Hawai'i County Civil Defense notifications by email or text message. #HawaiiCounty  #BeConnected  #BeSafe  #BeSmart  #HurricaneDouglas Link:  https://tc-d ouglas-hawaiicountygis.hub.arcgis.com", "2020-07-24T22:02:37.000Z": "HIDOE is working closely with county and state emergency response teams to monitor Hurricane Douglas as it approaches the islands. For tips on hurricane preparedness please visit: http:// dod.hawaii.gov/hiema/", "2020-07-24T22:01:14.000Z": "Watch live @ 12:30: Mayor Caldwell will discuss the City's plan and preparations as Hurricane #Douglas tracks toward O'ahu and the rest of the state. @Oahu_DEM Tune in: http:// Facebook.com/mayorkirk", "2020-07-24T22:30:50.000Z": "WATCH LIVE: Mayor Caldwell discusses the City's plan and preparations as Hurricane #Douglas tracks toward O'ahu and the rest of the state. https:// facebook.com/watch/?v=14479 28912064078  via @FacebookWatch Mayor Kirk Caldwell on Facebook Watch WATCH LIVE: Mayor Caldwell discusses the City's plan and preparations as Hurricane #Douglas tracks toward O'ahu and the rest of the state. facebook.com", "2020-07-24T22:12:26.000Z": "Don't forget about the disaster plans for other places where your family spends time. Sign up for emergency alerts and notifications. And communication is key! Learn more at http:// dod.hawaii.gov/hiema/", "2020-07-24T21:24:28.000Z": "Hurricane Douglas July 24, 2020 11 AM HST update. Hurricane watch for Maui County and Big Island. Douglas will be near the main Hawaiian Islands on Sunday and Monday.", "2020-07-25T02:14:33.000Z": "[WATCH] #HurricaneDouglas briefing - July 24, 2020 Governor David Ige on Facebook Watch July 24, 2020 News Conference: Hurricane Douglas briefing. Joining me are  Mayor Michael Victorino, Maui County  Luke... facebook.com", "2020-07-25T02:10:26.000Z": "After a record number of new coronavirus cases on Thursday, today the Hawaii Dept. of Health (DOH) is reporting another single-day record of 60 new COVID-19 infections. More: Hawaii COVID-19 Joint Information Center News Release (Honolulu) - After a record number of new coronavirus cases on Thursday, today the Hawai'i Dept. of Health (DOH) is reporting another single-day record of 60 new COVID-19 infections. The majority of... governor.hawaii.gov", "2020-07-24T21:27:47.000Z": "#HurricaneDouglas continues to move toward the Hawaiian Islands and should be expected to bring severe weather this weekend. Joining me this afternoon are, Mayor Michael Victorino, Luke Meyers @Hawaii_EMA , John Bravender @NWSHonolulu & Veronica Verde @FEMARegion9", "2020-07-24T19:52:49.000Z": "We have set a new record of COVID-19 cases for the second day in a row. 60 more people have been infected. Please continue washing hands for 20 seconds, wear face masks over both the mouth and nose, and practice physical distancing during this extremely crucial period for Hawai'i", "2020-07-24T17:19:54.000Z": "There is a lot going on in the tropics right now. It can be a little confusing. We put together this map to show the current forecast cones for the three active storms\n\nFor more on...\n\nDouglas: https:// nhc.noaa.gov/graphics_ep2.s html?start#contents  Hanna: https:// nhc.noaa.gov/graphics_at3.s html?start#contents  Gonzalo: https:// nhc.noaa.gov/graphics_at2.s html?start#contents ", "2020-07-23T19:23:26.000Z": "As Hurricane Douglas approaches the Hawaiian Islands, it is very important to be prepared. Find helpful information, checklists, and key terms in Hawai'i County Civil Defense's Hurricane Pamphlet.", "2020-07-24T15:45:46.000Z": "Hurricane Douglas July 24, 2020 5 AM HST update #hiwx", "2020-07-24T09:26:07.000Z": "#Douglas is a Category 4 #hurricane Moving: WNW at 18 mph\nMin pressure: 954 mb\nMax sustained: 130 mph Quote Tweet Hurricane Tracker @ushurricanebot powerful #Hurricane  #Douglas entering the central #Pacific ... Pressure: 954 mb, Wind Speed: 130 mph https:// nhc.noaa.gov/text/refresh/M IATCPEP3+shtml/DDHHMM.shtml ", "2020-07-24T07:04:53.000Z": "What should you do tomorrow to prepare for #HurricaneDouglas ? Visit https:// tinyurl.com/Hurricanedougl as1  to find resources on Douglas and actions you can take now to keep you and your family safe. @MayorKirkHNL", "2020-07-24T04:49:51.000Z": "I issued a pre-landfall emergency proclamation as the state prepares for possible impacts from #HurricaneDouglas . This authorizes the expenditure of state funds for the quick & efficient relief of disaster-related damage, losses & suffering from the storm. OFFICE OF THE GOVERNOR - News Release - Governor Ige issues emergency disaster declaration in... HONOLULU - Gov. David Ige today issued a pre-landfall emergency proclamation as the State of Hawai'i prepares for possible impacts from Hurricane Douglas. The proclamation authorizes the expenditure... governor.hawaii.gov", "2020-07-24T01:45:41.000Z": "Add in face masks and hand sanitizer!", "2020-07-24T04:21:54.000Z": "JULY 23, 2020\n\nNew cases: 55\nTotal cumulative cases: 1,490\nTotal hospitalized: 39\nNew deaths: 1\nTotal deaths: 26\nTotal number of individuals tested: 111,291 Hawaii COVID-19 Joint Information Center Daily News Digest, July 23, 2020 Department of Health:  Highest Single-Day COVID-19 Case Count Since the Beginning of the Pandemic  Death Toll Rises to 26  50 cases in Honolulu, three (3) on Hawai'i Island, and two (2) on Maui... governor.hawaii.gov", "2020-07-24T03:02:49.000Z": "Hurricane Douglas 5:00 PM update.", "2020-07-23T21:14:16.000Z": " #HurricaneDouglas expected to impact state this weekend - Our #UHohana Is urged to sign up for #UHAlert to receive emergency text alerts: http:// hawaii.edu/alert . If you have already signed up, log in to ensure that your contact information is up-to-date.", "2020-07-24T02:37:03.000Z": "View Hawai'i County's Response page for information updates on Hurricane Douglas. @GovHawaii Link:  https://tc-d ouglas-hawaiicountygis.hub.arcgis.com", "2020-07-24T03:00:34.000Z": "Hurricane Douglas has strengthened slightly into a category 4 storm system. Estimated time of arrival is Saturday night. \nPlease prepare a 14-day emergency kit with face masks and hand sanitizer.\nAlso please prepare to shelter in place.", "2020-07-24T00:40:42.000Z": "The online ticketing system for PUA assistance has been moved to: http:// lbr.force.com/PUASupport/s/c ontact  .", "2020-07-23T17:41:49.000Z": "", "2020-07-23T09:19:49.000Z": "It's time to prepare. Visit https:// ready.gov/hurricanes Quote Tweet WeatherNation @WeatherNation *BREAKING* Hurricane #Douglas has strengthened, now making it the first major hurricane of the 2020 season for both the Atlantic & Pacific basin. We are tracking the tropics, more here -> http:// bit.ly/2YFb2gX  #tropics  #hurricane", "2020-07-23T03:30:03.000Z": "JULY 22, 2020 http:// hawaiicovid19.com New cases:  17\nTotal cumulative cases: 1,435 \nTotal hospitalized: 47\nNew deaths: 1\nTotal deaths: 25\nTotal number of individuals tested: 108,813\n\nMore ppdates from UH and DLNR: Hawaii COVID-19 Joint Information Center Daily News Digest, July 22, 2020 Office of the Governor: With Storm Approaching Governor Ige & HI-EMA Issue Hurricane Safety Reminders Gov. David Ige was joined by Hawai'i Emergency Management Agency Administrator Luke Meyers on... governor.hawaii.gov", "2020-07-22T22:15:13.000Z": "When you cannot practice social distancing, you should absolutely wear a face covering. Our science shows that this is an excellent way to protect each other from #COVID19 . Do your part to #SlowTheSpread . Full interview with @chuckandkelly on @810WGY : Interview with CDC Director Robert Redfield | News Radio 810 & 103.1 WGY | Chuck and Kelly wgy.iheart.com", "2020-07-23T01:41:01.000Z": "#UHohana contact tracing trainees want to help #Hawaii 's communities - By July 24, the University of Hawai'i- @HIgov_Health Contact Tracing Training Program will have trained nearly 450 qualified individuals  https:// bit.ly/2CHEu0e  #UHinTheCommunity", "2020-07-23T00:40:00.000Z": "Answer these numbers. Quote Tweet DLIR @HI_DLIR Unemployment call center hours: Mon-Wed-Fri 7a-6p inbound, Tue-Thur 7a-noon inbound, outbound 12-6p, Sat outbound only 8a-6p, both (808) 762-5751 and (808)-762-5752  is the department trying to reach you to process claims.", "2020-07-23T00:49:09.000Z": "To help prospective students who are furloughed or unemployed, @uhcc has announced the new Kūlia Scholarship for individuals whose employment has been impacted by the #COVID19 pandemic. Applications are due by August 10. Learn more  https:// bit.ly/30GaOZl  #AgreeToDegree", "2020-07-22T22:38:00.000Z": "With news of Tropical Storm Douglas being upgraded to #HurricaneDouglas , today is a great day to make sure your hurricane preparedness kit is ready.\n\nVisit https:// dod.hawaii.gov/hiema/hurrican e-preparedness/  for more information. #ReadyGov  #HurricaneStrong ( courtesy of @VDHgov )", "2020-07-22T22:45:03.000Z": "RT @HawaiiFloodPlan : #BePrepared Homeowner's Handbook - https:// waihalana.hawaii.gov/2020/01/13/hom eowners-handbook-whats-new-in-4-0/  DOWNLOAD your copy today.\n\nRetrofit Options: Almost every home in #Hawaii can be strengthened for hurricanes.  The @UHSeaGrant handbook covers retrofit measures. #HawaiiNFIP  #Waihalana  #NFIP Homeowner's Handbook - What's New in 4.0 The Homeowner's Handbook 4th ed. with new and in depth information is available in print and online now! Learn how you can prepare for natural hazards. waihalana.hawaii.gov", "2020-07-22T17:35:12.000Z": "Protect yourself and others from #COVID19 when using public transportation. Practice social distancing, avoid touching surfaces, and practice hand hygiene. Learn more. https:// bit.ly/36A09Cl", "2020-07-22T14:04:01.000Z": "It's understandable that many people may feel distress or anxiety during the #COVID19 pandemic. Dr. Joshua Gordon, Director of @NIMHgov , offers five steps you can follow to maintain your mental health and well-being.", "2020-07-22T22:17:38.000Z": "The number of Hawai'i's COVID-19 cases remains low, thanks to all who have been adhering to physical distancing, frequent handwashing, remaining at home when you're sick and, most importantly, masking up. Quote Tweet CDC @CDCgov As of July 21: In the last 7 days, #COVID19 cases increased in the US. Ten states reported more than 10,000 new cases w/ 3 states each reporting more than 60,000 new cases. Wear face coverings. Stay 6 feet away from others & wash your hands. See more data: https:// bit.ly/31sonOh", "2020-07-22T21:54:38.000Z": "We need to ready in aloha, a storm is not a point or line, they are very messy and hard to trace - #beprepared Quote Tweet NWSHonolulu @NWSHonolulu 11am HST update for Hurricane #Douglas . Graphic indicates the probability and likely time of arrival of at least tropical storm force (39 mph+) winds. Monitor http:// hurricanes.gov for the latest storm information issued every 6 hours at 5am/pm and 11am/pm HST.", "2020-07-22T20:44:37.000Z": "Always great to #BePrepared - storm on the horizon! Quote Tweet NWSHonolulu @NWSHonolulu With tropical activity picking up this week in the East/Central Pacific, here is a reminder of what you can do to prepare for the potentially devastating impacts from the hurricane. Monitor the latest information about Hurricane #Douglas at http:// hurricanes.gov  #hiwx", "2020-07-22T19:30:24.000Z": "Hurricane #Douglas develops a ragged eye ... Quote Tweet UW-Madison CIMSS @UWCIMSS 0:07 Introducing #HurricaneDouglas heading toward #Hawaii - the first #hurricane of the 2020 Eastern Pacific Season. #GOESWest meso-sector is monitoring #Douglas . Access several #GOES17 ABI 1-minute animations via @UW_AOS at http:// aos.wisc.edu/weather/wx_obs /GOES17_meso2.html ", "2020-07-22T17:02:20.000Z": "Introducing #HurricaneDouglas heading toward #Hawaii - the first #hurricane of the 2020 Eastern Pacific Season. #GOESWest meso-sector is monitoring #Douglas . Access several #GOES17 ABI 1-minute animations via @UW_AOS at http:// aos.wisc.edu/weather/wx_obs /GOES17_meso2.html ", "2020-07-22T03:22:01.000Z": " @LeewardCC has flipped the switch on becoming one of the first virtually net-zero campuses in the country  https:// bit.ly/2CAheBp  #sustainbleUH", "2020-07-22T19:53:14.000Z": "Our team of contact tracers help individuals and families safely isolate or quarantine and then confidently re-enter community. Mahalo to our hard-working contact tracers for their tireless support of Hawaii's families and efforts to slow the spread of #COVID19 ! #HawaiiCOVID19", "2020-07-22T20:15:24.000Z": "Keep in touch with us for updates on our clean energy goals #100by2045 - sign up for our e-newsletter - The Current. http:// energy.hawaii.gov/e-newsletter", "2020-07-22T07:38:25.000Z": "UPDATE: There is NO tsunami threat to Hawaii Quote Tweet Governor David Ige @GovHawaii JUST IN: 7.4M earthquake in Alaska. Awaiting more information if there is tsunami impact to #Hawaii . twitter.com/USGSBigQuakes/", "2020-07-22T06:44:29.000Z": "JUST IN: 7.4M earthquake in Alaska. Awaiting more information if there is tsunami impact to #Hawaii . Quote Tweet USGS Big Quakes @USGSBigQuakes Prelim M7.8 Earthquake Alaska Peninsula Jul-22 06:12 UTC, updates https:// go.usa.gov/xfkMx", "2020-07-22T03:30:04.000Z": "July 21, 2020 http:// hawaiicovid19.com New cases: 25\nTotal cumulative cases: 1,418\nTotal hospitalized: 46\nNew deaths: 0\nTotal deaths: 24\nTotal number of individuals tested: 108,182 Hawaii COVID-19 Joint Information Center Daily News Digest, July 21, 2020 Department of Health: 25 New Cases of COVID-19 21 new coronavirus cases on O'ahu and four (4) on Maui are being investigated by DOH. 21 of the cases are adults and four (4) are pediatric. Two (2) of... governor.hawaii.gov", "2020-07-22T03:12:40.000Z": "I issued the 15th supplementary emergency proclamation which extends the emergency relief period for the 2018 #kauai floods. Details: OFFICE OF THE GOVERNOR - News Release - Governor Ige extends emergency relief period for Kauai... HONOLULU - Gov. David Ige issued the 15th supplementary emergency proclamation which extends the emergency relief period for the 2018 Kaua'i floods. The proclamation serves to extend authority to... governor.hawaii.gov", "2020-07-22T01:22:34.000Z": "ICYMI: Hurricane preparedness during #COVID19 discussion with @Hawaii_EMA Administrator Luke Meyers @hazardlm   https:// facebook.com/GovernorDavidI ge/videos/681597089088014/?xts[0]=68.ARDCllO-ug0mTZBPc5UqbSfe16XMZw37na7WBVN7p6EAQHQjIzhp7E5CCCjSu9pWLDAAZFL3bLwPtNfD_09z-ttt2F_pA1EGAn8Z9NzAtlNI-G5jgckDXSBBNc7yRi2xvVeiA77HEd9OKxzLon57rI33NVnCu2K6UBTjEDE7P3N6QM8OK7pAKxGHbzYTt8PICPZyVhhFF9T7rnlV4BpTOq3VM1AALLN_2wOgHH90WMk7vrEqFAO1bnoHDRBobsjel03mbiBHNAjRckMkSNQmABe4ilVPwrJSwZHfsaWZ8lOPanXjaPAWLvVX_c6hHbbnhXuNNH67j4VsLzRpjVbSA6uM19HdON3jH4A&tn=-R ", "2020-07-21T18:07:45.000Z": "#COVID19 home care - ill people: Clean frequently  , drink plenty of fluids & eat nutritiously Stay home in separate room. If not possible, wear &  Cover & with or disposable tissue when coughing or sneezing  doctor if condition worsens", "2020-07-21T20:51:34.000Z": "Did you receive your ballot in the mail? Follow these tips to make your vote count. Mahalo to @ponofortheppl for these helpful graphics. #AlohaRising  #Vote2020  #HawaiiVotes  #Elections", "2020-07-21T18:00:00.000Z": "Be prepared and stay vigilant when traveling interisland!  Fill out the online health questionnaire up to 24 hours before your flight. Arrive at the airport early, wear a mask, and maintain 6 feet of physical distance as much as possible. Find out more at https:// health.hawaii.gov/travel/", "2020-07-21T16:35:00.000Z": "Wearing a cloth face covering correctly can help prevent the spread of #COVID19 to others. When you go out on essential trips, follow these \"do's\". If you have a child, remember those under age 2 should not wear a face covering. See https:// bit.ly/2R9av5m .", "2020-07-21T03:30:04.000Z": "JULY 20, 2020\nNew cases: 12\nTotal cumulative cases: 1,393\nTotal hospitalized: 33\nNew deaths: 0\nTotal deaths: 24\nTotal number of individuals tested: 106,783 Hawaii COVID-19 Joint Information Center, Daily News Digest, July 20, 2020 Office of the Governor: Reopening of Hawai'i Public Schools Moves Forward Gov. Ige was joined at an afternoon news briefing by DOE Superintendent Dr. Christina Kishimoto, Board of Education (BOE)... governor.hawaii.gov", "2020-07-20T16:23:02.000Z": "If you are wearing a cloth face covering and feel yourself overheating or having trouble breathing, put at least 6 feet of distance between yourself and others and remove the face covering. More safety tips: https:// bit.ly/2tZjtbM  #COVID19  #ExtremeHeat", "2020-07-21T01:45:45.000Z": "July 20, 2020 News Conference - Reopening Hawai'i's public schools on Aug. 4 July 20, 2020 COVID-19 News Conference [WATCH] July 20, 2020 COVID-19 News Conference. The topic of today's news conference is reopening Hawai'i's public schools on Aug. 4. Joining will be: ... facebook.com", "2020-07-20T22:00:43.000Z": "The topic of today's news conference is reopening Hawai'i's public schools on Aug. 4. Joining will be: \n Dr. Bruce Anderson, Director, Dept. of Health \n Catherine Payne, Chairperson, Board of Education \n Dr. Christina Kishimoto, Superintendent, Dept. of Education", "2020-07-20T21:38:55.000Z": "How do we prepare for this hurricane season while also battling the #COVID19 ? Luke Meyers ( @hazardlm ), administrator for the @Hawaii_EMA will join me on tomorrow's edition of Community Connection to answer this question. Tune in at http:// facebook.com/governordavidige ", "2020-07-20T00:24:07.000Z": "Hawai'i and the surfing community lost a great competitor. Dawn and I send our condolences to Derek's 'ohana and the friends who loved him. Quote Tweet World Surf League @wsl Derek Ho, 1993 World Champion, has passed away at 55. The four-time Triple Crown Winner and two-time Pipe Master has left an indelible mark on the international surfing world and has been a pillar of the North Shore community for five decades. Our hearts are with his loved ones.", "2020-07-18T20:05:02.000Z": "Flags will be flown at half-staff in the State of Hawai'i through July 18 as a mark of respect for Rep. John Lewis' many years of public service to the nation. Governor's Office - Flag Order - Gov. Ige orders flags at half-staff as a mark of respect for... HONOLULU - At the direction of the President of the United States, Gov. David Ige has ordered that the United States flag and the Hawai'i state flag will be flown at half-staff at the State Capitol... governor.hawaii.gov", "2020-07-18T02:20:27.000Z": "The period of self-quarantine continues to begin at the time of arrival through 14 days or for the duration of the visit - whichever is shorter. All arriving travelers will be required to comply w/ all applicable state & county rules, directives & orders. OFFICE OF THE GOVERNOR - News Release - Governor Ige signs emergency proclamation, extending 14-day... HONOLULU - Gov. David Ige has signed the 10th emergency proclamation, which keeps the mandatory 14-day quarantine in effect for travelers entering the State of Hawai'i. Under the proclamation,... governor.hawaii.gov", "2020-07-18T02:20:26.000Z": "Today I signed the 10th emergency proclamation, relating to C#OVID19 which keeps the mandatory 14-day quarantine in effect for travelers entering Hawai'i. Travelers arriving in Hawai'i will continue to undergo a mandatory screening process at the airport.", "2020-07-18T02:03:35.000Z": "I am saddened by the news of another death today caused by the coronavirus. Please use caution and continue to wear your mask, wash your hands frequently, stay a safe distance from one another and if you're sick, stay home. #MaskUpHawaii  #HawaiiCOVID19", "2020-07-18T02:01:20.000Z": "Exemption procedures for returning students to 3 O'ahu universities. Details: Hawaii COVID-19 Joint Information Center News Release-Exemption Procedures for Returning Students... (Honolulu) - Out-of-state students attending any University of Hawai'i campus on O'ahu, Chaminade University, Hawai'i Pacific University, and Kaua'i Community College for the 2020 fall semester will... governor.hawaii.gov", "2020-07-17T23:34:03.000Z": "As reported across the nation, fraudsters are targeting state UI systems during the pandemic through various schemes and identity theft which have resulted in the delay of PUA payments. DLIR continues to work diligently to get your PUA payments processed: https:// bit.ly/2ZFibkQ", "2020-07-17T22:23:20.000Z": "Discussing quarantine enforcement in Hawaii with @AtghIgov and Paul Jones, Deputy Chief for the Department of the Attorney General Investigations Divisions\nWATCH here: https:// facebook.com/GovernorDavidI ge/videos/3124118047669160   #hawaiicovid19", "2020-07-17T14:04:23.000Z": "Say it with us America: #COVIDStopsWithMe . Learn more about the simple steps you can take to help end the spread of #coronavirus : https:// bit.ly/2WoEpFB . @surgeon_general  #COVID19", "2020-07-17T21:47:25.000Z": "This week's community bulletin highlights our contact tracers: https:// mailchi.mp/doh/covid-19-c ommunity-bulletin-july-17-2020 ", "2020-07-17T21:25:19.000Z": "Talked with @arobach about reopening Hawai'i's schools and our response to the pandemic this morning. WATCH the segment here: https:// bit.ly/3eLuIYg  @ABC  @GMA", "2020-07-16T23:48:31.000Z": "Since the start of the 14-day quarantine mandate, the AG's office has been on the frontlines of quarantine enforcement. Joining me this afternoon is AG Clare Connors & Paul Jones, Deputy Chief for the Dept of the AG Investigations Divisions. Tune in here: http:// facebook.com/governordavidige ", "2020-07-16T19:31:22.000Z": "Hawai'i P-EBT Pandemic Benefits for Hawaii families to buy food. Click on flyer for details.", "2020-07-16T22:00:00.000Z": "Be prepared when traveling interisland! Fill out the online health questionnaire up to 24 hours before your flight, it only takes 2-5 minutes to complete. Make sure to arrive at the airport early. \nFind out more at: https:// health.hawaii.gov/travel/  #hawaiicovid19  #travelsafe  #stayhealthy", "2020-07-16T22:41:08.000Z": "DHHL, @HonoluluHabitat Partnership Completes Waimānalo Home. #DHHL DHHL, Honolulu Habitat Partnership Completes Waimānalo Home The Department of Hawaiian Home Lands, along with its Honolulu Habitat for Humanity partner, welcomed Shannon Chow and her 'ohana to their new Waimānalo home on Thursday, July 16. dhhl.hawaii.gov", "2020-07-16T21:36:51.000Z": "To keep our #COVID19 cases low, let's continue to #MaskUpHawaii . Quote Tweet Axios @axios The states where face coverings are mandatory https:// axios.com/states-face-co verings-mandatory-a0e2fe35-5b7b-458e-9d28-3f6cdb1032fb.html?utm_source=twitter&utm_medium=social&utm_campaign=organic&utm_content=1100 ", "2020-07-16T18:00:00.000Z": "Help #slowthespread : stay at least 6 ft apart & wear a cloth face covering to reduce the risk of spreading #COVID19 . #stopthespread  #hawaiicovid19  #physicaldistancing  #covid19  #6feetapart Learn more from the @CDCgov CDC: https:// bit.ly/2ZYYOlt", "2020-07-16T03:30:03.000Z": "JULY 15, 2020 http:// hawaiicovid19.com New cases: 29\nTotal cumulative cases: 1,292\nDeaths: 22 \nTotal number of individuals tested: 99,387 Hawaii COVID-19 Joint Information Center Daily News Digest, July 15, 2020 Department of Health: 29 Additional Positive COVID-19 Cases The majority of new coronavirus cases reported by DOH today are associated with community-spread. Of the 29 cases, 27 are on O'ahu and two... governor.hawaii.gov", "2020-07-16T02:57:51.000Z": "We all have to do our part to stay safe and reduce the risk of spreading the virus. The Department of Health answers questions about social bubbles, including how to bubble up safely, and what happens if someone in your bubble gets sick. https:// hawaiicovid19.com/social-bubble- faq/ ", "2020-07-15T22:00:00.000Z": "COVID-19 might impact your emergency plans if you need to evacuate due to a disaster. #BeReady : Pack a face cloth covering, disinfecting supplies & hand sanitizers in your emergency bag. Check with local officials for available shelters. \nMore tips: https:// ready.gov/pandemic", "2020-07-15T17:07:04.000Z": "I believe if everyone, including #Millenials and #GenZ , wear a cloth face covering for the next 4 to 6 weeks, we can get the #COVID19 epidemic under control. Quote Tweet JAMA @JAMA_current Live Q&A: @CDCDirector Robert Redfield discusses the ongoing #COVID19 pandemic and @CDCgov 's latest #coronavirus recommendations. #JAMALive  http:// ja.ma/redfield", "2020-07-15T21:22:01.000Z": "Stigma hurts everyone. No single group, ethnicity or population in the U.S. is more likely to spread #COVID19 than others. Find out how to stop COVID-19 stigma in your community at https:// bit.ly/2XWt80L", "2020-07-15T20:59:07.000Z": "Mahalo, @GovernorVA ! I wear a mask to protect everyone around me. Passing on the mask challenge to @OregonGovBrown . Why do you wear a mask, Kate? #MaskUpAmerica Quote Tweet Ralph Northam @GovernorVA 0:52 As a physician, I wear a mask because I know it helps prevent the spread of #COVID19 . But governors across our country know it too. @AsaHutchinson , why do you wear a mask? #MaskUpSaveLives", "2020-07-15T20:20:11.000Z": "Do you own a business or know a local entrepreneur who sells made in Hawaii products? Let them know about our new, free website that helps showcase local brands. \nTag them in the comments below and retweet this post. Companies can register here: https:// invest.hawaii.gov/bhga-applicati on/ ", "2020-07-15T19:27:57.000Z": "AVOID SCAMS: Public health contact tracers will never ask you for your Social Security Number or bank account number. #HawaiiCOVID19", "2020-07-15T19:25:00.000Z": "CDC and @Google remind you that wearing cloth face coverings in public settings can help #SlowTheSpread of #COVID19 . Learn more about cloth face coverings: https:// bit.ly/2R9av5m . GIF", "2020-07-15T19:10:52.000Z": "The state has paid out nearly $2B in claims since the onset of the #COVID19 Pandemic on 3/1. For those who have not received their benefits, click here to see common reasons for the delays and denials: https:// bit.ly/2ZyFyMS", "2020-07-15T03:30:04.000Z": "JULY 14, 2020\n\nNew cases: 22\nTotal cumulative cases: 1,264\nDeaths: 22\nTotal number of individuals tested: 97,557\n\nMore: Hawaii COVID-19 Joint Information Center Daily News Digest, July 14, 2020 Department of Health: 22 Additional Positive COVID-19 Cases Twenty Hawai'i adult and two pediatric cases are the latest coronavirus cases being reported by DOH. 19 of the cases are on O'ahu and three... governor.hawaii.gov", "2020-07-15T01:29:38.000Z": "We welcome the opportunity to join this multi-state coalition to accelerate electrification of medium & heavy-duty vehicles. This is critical to achieving Hawai'i's zero-emission clean economy goal & 100% renewable energy target for electricity. Details: https:// bit.ly/2OnN8Dl", "2020-07-15T00:00:00.000Z": "Restaurants, bars and other food establishments that don't comply with physical distancing, wearing face masks, and other required guidance can be shut down by the @HIgov_Health under existing state law Hawai'i Administrative Rules, Section §11-50-9(d)(3). https:// bit.ly/3fjyR6z", "2020-07-14T23:48:06.000Z": "Unlikely. There is no evidence that COVID-19 spreads through recreational waters. However, it's still important to keep a 6-ft distance from others in common pool areas and recreational spaces. And remember to wear a face covering anytime you are not in the water. #HawaiiCOVID19", "2020-07-14T12:00:00.000Z": "Workplaces can present unique challenges for #COVID19 public health investigations. @CDCgov created a toolkit to help state and local health departments more effectively investigate and respond to COVID-19 cases in non-healthcare work settings. https:// go.usa.gov/xfYE4", "2020-07-14T02:10:40.000Z": "Application forms for free and reduced-price school meals are being mailed home to parents or guardians for school year 2020-21. To apply, households should it fill out and return it to their child's school. More details at https:// bit.ly/3086UZ5 . #HI4PublicEd", "2020-07-14T21:10:03.000Z": "RT @HISecurities : Help protect our Kupuna from scammers by sharing this information on common coronavirus #scams from the folks at @CFPB  http:// ow.ly/22iY50Axvm6", "2020-07-14T20:37:01.000Z": "Everyone reacts differently to stressful situations. Finding ways to practice #selfcare can help reduce your stress during the #COVID19 pandemic. Find ways to cope with stress: https:// bit.ly/340pBQa .", "2020-07-14T03:31:16.000Z": "Exemption for out-of-state UH students part of extended quarantine - The exemption adopts elements of the state pre-travel program  https:// bit.ly/2OpbJrD", "2020-07-14T03:30:04.000Z": "JULY 13, 2020\n\nNew cases: 23\nTotal cumulative cases: 1,243\nDeaths: 23\nTotal number of individuals tested: 96,079\n\nMore: Hawaii COVID-19 Joint Information Center Daily News Digest, July 13, 2020 Office of the Governor: Sept. 1 is New Date for Resumption of Trans-Pacific Travel Calling the delay in re-opening trans-Pacific travel to Hawai'i a very tough decision, Governor Ige outlined the... governor.hawaii.gov", "2020-07-14T02:48:03.000Z": "This was an extremely difficult decision. This delay will further hurt our economy, but as I've always said - we will make decisions prioritizing the health & safety of our residents. Our county mayors & I agree, this is essential to protect our community OFFICE OF THE GOVERNOR - News Release - Governor Ige announces pre-travel testing program for... Link to news conference video  HONOLULU - Gov. David Ige today announced he will delay the launch of the pre-travel testing program for incoming travelers to Hawai'i. The program is now scheduled to... governor.hawaii.gov", "2020-07-14T02:48:02.000Z": "Today I announced the delay of the launch of the pre-travel testing program for incoming travelers to begin on Sept. 1. This means all travelers entering the State of Hawai'i will be subject to the mandatory 14-day quarantine until 9/1. July 13, 2020 COVID-19 Update July 13, 2020 COVID-19 News Conference Announcing the delay of the launch of the pre-travel testing program for incoming travelers to begin on Sept. 1.... facebook.com", "2020-07-14T00:00:47.000Z": "RT @CDCgov : Planning to host summer gatherings or cook-outs with people not in your household? Check out CDC's new tips to help protect you and your family. For tips: https:// bit.ly/3fuSfxC .", "2020-07-13T22:11:24.000Z": "[WATCH] http:// facebook.com/governordavidige ", "2020-07-13T20:40:22.000Z": "Three COVID-19 deaths and 86 new cases since Friday renew calls for safe practices in Hawai'i.\n\nDetails: Hawaii COVID-19 Joint Information Center News Release-3 Deaths & 86 New Cases Renew Calls for Safe... THREE COVID-19 DEATHS AND 86 NEW CASES SINCE FRIDAY RENEW CALLS FOR SAFE PRACTICES IN HAWAI'I (Honolulu) - A tragic reminder of the impact of COVID-19 on individuals and their families are the deaths... governor.hawaii.gov", "2020-07-13T19:54:00.000Z": "Cloth face coverings may help prevent the spread of #COVID19 when they are widely used in public settings. When you wear a face covering, you help protect those around you. When others wear one, they help protect people around them, including you. https:// bit.ly/3ee8iP4", "2020-07-13T19:21:13.000Z": "Buy Hawaii, Give Aloha is a free resource highlighting products that are made in Hawaii. Maintained by the Hawaii Dept. of Business, Economic Development and Tourism, it offers a place to share local products in a central portal. Learn more at https:// bit.ly/38SAqG7 .", "2020-07-11T03:30:03.000Z": "JULY 10, 2020\nNew cases: 28\nTotal cumulative cases: 1,158\nDeaths: 19\nTotal number if individuals tested: 92,234 Hawaii COVID-19 Joint Information Center Daily News Digest, July 10, 2020 Governors Office: Governor Ige's Statement About Ongoing COVID-19 Planning with Mayors \"The mayors and I have had productive meetings this week about the pre-travel testing program. We are assessing... governor.hawaii.gov", "2020-07-11T02:03:17.000Z": "The CAREs Act has made available funds for rent relief & housing assistance. The HHFDC is soliciting applications from qualified nonprofit agencies to help administer the program statewide. Deadline to apply is 7/13, 2PM. More: https:// dbedt.hawaii.gov/hhfdc/", "2020-07-11T01:30:48.000Z": "Many families are facing food insecurities for the first time in their lives because of #COVID19 . There is help out there. The @hawaiifoodbank is distributing food to families in need on O'ahu's Windward side on 7/11 & the North Shore on 7/25. Pre-Reg: Hawaii Foodbank Hawaii Foodbank, Hawaii Foodbank Home, Hawaii Food Bank, Hawaii, Foodbank, Oahu, Hawaii Foodbank Home Page, Hawaii Foodbank Warehouse hawaiifoodbank.org", "2020-07-10T23:44:31.000Z": "Contact tracing by the @HIgov_Health has uncovered a total of 17 cases to-date involving two O'ahu commercial gym facilities. DOH says cases in both gyms are linked to one person who participated in exercise classes at both. Please , , Hawaii COVID-19 Joint Information Center News Release-Gyms Encouraged to Practice Safety, July 10,... (HONOLULU) - Contact tracing by the Dept. of Health has uncovered a total of 17 cases to-date involving two O'ahu commercial gym facilities. DOH says cases in both gyms are linked to one person who... governor.hawaii.gov", "2020-07-10T13:24:59.000Z": "Have plans this weekend? If you will be around others, stay at least 6 ft apart & wear a cloth face covering to slow the spread of #COVID19 . More from @CDCgov : https:// bit.ly/3bJuy2M", "2020-07-10T23:25:16.000Z": "Today, I reluctantly withdrew my nomination for Rona Suzuki to lead the Dept. of Taxation. I respect the Senate and the role it plays in confirming nominees, and it's unfortunate that we don't agree on Rona's appointment.", "2020-07-10T22:04:27.000Z": "This week's community bulletin highlights an FAQ on social bubbles, pods, or \"quaranteams\": https:// mailchi.mp/doh/covid-19-c ommunity-bulletin-july-10-2020 ", "2020-07-10T21:45:40.000Z": "The DLNRTip App now includes ​new features that allow ​users to choose an island when submitting a tip. This sends the tip directly to the appropriate DLNR Division of Conservation and Resources Enforcement (DOCARE) branch.\n\nMore info at: https:// dlnr.hawaii.gov/blog/2020/07/0 9/nr20-097/ ", "2020-07-10T20:41:21.000Z": "Governor David Ige​'s request for a Presidential Disaster Declaration for Kaua'i Severe Storms and Flooding March 27-28, 2020 - approved\n\nClick here to read more: https:// bit.ly/322VtEIFEMA", "2020-07-10T21:18:21.000Z": "The mayors & I have had productive meetings this week about the pre-travel testing program. We're assessing the current situation here & on the mainland, & we'll make an announcement when we are satisfied that the plans will protect the health & safety of our residents & guests.", "2020-07-10T20:59:46.000Z": "Contact your health care provider if you have come in close contact with someone known to have COVID-19. Know the signs of Covid-19:\n● Cough\n● Fever\n● Chills\n● Muscle pain\n● Shortness of breath #hawaiicovid19  #covidhealthtips  #stayhealthyandsafe  #wereinthistogether", "2020-07-10T20:35:13.000Z": "If your child received free or reduced-price meals this year, your child is eligible to receive up to $360 in food purchasing assistance. Check the status of this Hawaii Pandemic EBT payment at https:// pais-pebt.dhs.hawaii.gov or if you have questions :hi.pebt@dhs.hawaii.gov @HIDOE808", "2020-07-10T18:00:01.000Z": "Do you know anyone in need of food assistance due to the pandemic? If so, let them know that the County of Hawai'i coronavirus website has a comprehensive list of food distribution sites, special grocery shopping hours for kūpuna, locations of food hubs, and much more!", "2020-07-10T18:30:11.000Z": "Wearing a cloth face covering CORRECTLY can help prevent the spread of #COVID19 to others. When you go out on essential trips, follow these \"do's\". If you have a child, remember those under age 2 should not wear a face covering. See https:// bit.ly/2R9av5m .", "2020-07-10T19:43:00.000Z": "Protect yourself and others from #COVID19 when using public transportation. Practice social distancing, avoid touching surfaces, and practice hand hygiene. Learn more: https:// bit.ly/36A09Cl .", "2020-07-10T19:50:30.000Z": "Coronavirus riskiest activites, ranked. Thank you @infobeautiful for creating this easy to understand graphic. https:// informationisbeautiful.net/visualizations /covid-19-coronavirus-infographic-datapack/ ", "2020-07-10T02:10:31.000Z": "I've appointed Bennette Misalucha to fill the late Sen. Harimoto's state seat. Bennette is a long-time member of our community & she understands the current issues & challenges we face. I know she'll ably represent Dist 16 until the new senator is elected. Governor's Office - News Release - Gov. Ige appoints Bennette Misalucha to state Senate seat HONOLULU - Gov. David Ige has appointed Bennette Misalucha to fill the late Sen. Breene Harimoto's state Senate seat. State Senate District 16 includes Pearl City, Momilani, Pearlridge, 'Aiea, Royal... governor.hawaii.gov", "2020-07-10T00:03:26.000Z": "We are getting input from community leaders as we carefully consider the health and safety of our residents and the financial health of our communities because we know they are interconnected. #HawaiiCovid19", "2020-07-10T00:03:25.000Z": "The mayors and I met yesterday and are meeting again today to assess the current situation and discuss what it might mean for the state, including the planned pre-travel testing program.", "2020-07-09T08:53:19.000Z": "Sign up for emergency notifications for Maui, as well as notifications for other islands here: Get Ready Get Ready Hawai'i Visit each county's emergency management website for more information about county-specific preparedness tips and measures. Sign up for free text-based notifications for the latest... dod.hawaii.gov", "2020-07-09T02:39:52.000Z": "Worship is an essential part of life for so many in Hawaii. If you choose to gather in-person to practice your faith, be sure to protect staff and those attending at risk for severe illness from COVID-19. https:// cdc.gov/coronavirus/20 19-ncov/community/faith-based.html ", "2020-07-08T03:01:56.000Z": "JULY 7, 2020\nNew cases: 41\nTotal cumulative cases: 1,071\nDeaths: 19\nTotal released from isolation: 797\nTotal number of individuals tested: 87,096\n\nMore: #hawaiicovid19 Hawaii COVID-19 Joint Information Center Daily News Digest, July 7, 2020 Office of the Governor: At a news briefing, Gov. David Ige said the 41 new COVID-19 cases reported by DOH Tuesday is still manageable. It is the highest case count since the pandemic began earlier... governor.hawaii.gov", "2020-07-07T03:30:03.000Z": "JULY 6, 2020 http:// hawaiicovid19.com New cases: 7\nTotal cumulative cases: 1,030\nDeaths: 19\nTotal number of individuals tested: 84,630\n\nMore: Hawaii COVID-19 Joint Information Center Daily News Digest, July 6, 2020 Governor's Office: Hawai'i Hits Milestone of Three Months Living with Restrictions Governor David Ige thanked Hawai'i residents at a news briefing Monday on all of their efforts and sacrifices to... governor.hawaii.gov", "2020-07-07T02:57:06.000Z": "[WATCH] 7/6/20 #COVID19 News Conference:\nI'll outline how COVID-19 has impacted the state's finances and where we go from here. Governor David Ige on Facebook Watch July 6, 2020 COVID-19 News Press Conference: At today's news conference I'll outline how COVID-19 has impacted the state's finances and where we go from... facebook.com", "2020-07-06T21:42:28.000Z": "HIDOE has launched an online bus pass application & payment feature. Parents who have an email address in their student's profile will receive an automated email today w/ instructions or can visit https:// hi.etrition.com/busapplication to sign up. More at https:// bit.ly/2ZG1gNL  #HI4PublicEd", "2020-07-06T21:08:14.000Z": "I will be joined by Lieutenant Governor Josh Green and Dr. Bruce Anderson, Director of the Hawaii State Department of Health. #hawaiicovid19", "2020-07-05T21:58:38.000Z": "If you're traveling overnight, check the hotel's #COVID19 prevention practices beforehand. Wear a cloth face covering, limit close contact with others, and protect yourself & others when you travel away your community. More travel guidance: https:// health.hawaii.gov/travel/  #HawaiiCOVID19", "2020-07-06T17:53:46.000Z": "As much as possible, stick with the same #OhanaBubble . If children are participating in group summer activities, stick to a group with whom they regularly interact. Meet outside, space out tables and chairs, and encourage attendees to wear festive masks. #HawaiiCOVID19", "2020-07-04T17:02:37.000Z": "May you have a safe and joyful Fourth of July celebration with family and friends.\n\nDon't forget to wear your mask, stay 6 feet apart and wash your hands frequently. Let us all do our part to slow the spread of COVID19. #COVIDStopsWithMe  #IndependenceDay", "2020-07-03T05:20:02.000Z": "RT @CivilDefenseHI : With the July 4th holiday this weekend, it's more important than ever to practice safety measures like physical distancing and wearing a face mask in public or in a group setting. #July4  #staysafe  #stayhealthyhawaii  #hawaiicovid19", "2020-07-03T03:30:04.000Z": "JULY 2, 2020\n\nNew cases: 20\nTotal cases: 946\nDeaths: 18\nTotal number of individuals tested: 80,659\n\nClick below to read the DOE's re-opening plans for schools and the latest unemployment information from the DLIR. Hawaii COVID-19 Joint Information Center Daily News Digest, July 2, 2020 Editor's Note: The Joint Information Center will not be sending out a Daily News Digest on July 3, due to the holiday weekend. Media questions will still be taken by phone and email. Department of... governor.hawaii.gov", "2020-07-02T20:42:15.000Z": "July 4th holiday weekend advisory from CDC - Stay safe when visiting friends and family with higher risk for severe illness https:// youtu.be/0HCvjtcI3vs via @YouTube", "2020-07-02T23:43:18.000Z": "LIVE: Mayor Caldwell discusses the proposed Amendment to his Emergency Order which requires face coverings be worn in certain circumstances outdoors and clarifies that face coverings must be worn in certain indoor businesses/operations. https:// facebook.com/watch/?v=27673 0583387976  via @FacebookWatch Mayor Kirk Caldwell on Facebook Watch LIVE: Mayor Caldwell discusses the proposed Amendment to his Emergency Order which requires face coverings be worn in certain circumstances outdoors and... facebook.com", "2020-07-03T00:00:01.000Z": "Did your keiki receive free or reduced meals during the school year?  If so, you're eligible to receive a one-time payment of up to $360 per child for food assistance.\nFor questions, email hi.pebt@dhs.hawaii.gov.\nFor more info, visit http:// humanservices.hawaii.gov .", "2020-07-02T22:37:22.000Z": "This week's community bulletin highlights 3 things to avoid to celebrate Independence Day safely: https:// mailchi.mp/doh/covid-19-c ommunity-bulletin-july-2-2020 ", "2020-07-03T01:19:35.000Z": "Mandatory interislsnd travel & health form now online... read about it @ Office of Enterprise Technology Services State of Hawaii ets.hawaii.gov", "2020-07-03T01:21:00.000Z": "HIDOE released an overall statewide Return to Learn: School Reopening Plan which includes a Principal's Handbook and a Health & Safety Handbook.", "2020-07-03T01:27:43.000Z": "Hurricane Preparedness 2020 PSA https:// youtu.be/3aI9E9L_uEs via @YouTube  #StaySafe  #StayHealthy  #BePrepared  #wenotpauyet  @ready .hawaii.gov Hurricane Preparedness 2020 PSA CAPTIONED Hurricane season is upon us. Take the time RIGHT NOW to prepare and protect your loved ones and property. #StaySafe #StayHealthy #wenotpauyet #HIEMA @ready.h... youtube.com", "2020-07-03T02:10:12.000Z": "Breene was a true dedicated public servant who worked tirelessly and selflessly for the community he loved, even while fighting his illness.", "2020-07-03T02:10:11.000Z": "As a mark of respect for the late Hawai'i State Senator Breene Harimoto, flags shall be flown at half-staff on 7/7 - the day of Sen. Harimoto's memorial service and flown at the State Capitol on 7/6, in honor of Sen. Harimoto, as a gift to his family. OFFICE OF THE GOVERNOR - FLAG ORDER - Governor orders flags at half-staff in honor of late Sen.... HONOLULU - As a mark of respect for the late Hawai'i State Senator Breene Harimoto, Gov. David Ige has ordered that the flags of the United States and State of Hawai'i shall be flown at half-staff at... governor.hawaii.gov", "2020-07-01T21:41:33.000Z": "1. Speak with aloha, even when angry 2. Listen to your keiki and partner 3. Encourage them to do what they enjoy. Connect with free statewide resources at http:// TheParentLine.org - We're in this together. https:// facebook.com/HawaiiDOH/vide os/322196615866520/ ", "2020-07-02T19:17:00.000Z": "Do your part to slow the spread of #COVID19 :\n1)Wear a face covering when in public. \n2)Stay at least 6 ft away from others and avoid large crowds. \n3)Wash your hands often. \nCDC joins @Surgeon_General in saying #COVIDStopsWithMe . http:// cdc.gov/coronavirus", "2020-07-02T18:52:36.000Z": "If you experienced a loss in income due to COVID-19, you may be eligible for @HOPEServicesHI one-time emergency financial assistance for rent/mortgage up to $2000 per household on the Big Island. To apply, visit http:// hopeserviceshawaii.org/rmap/  #hookahuawaiwai  #covid19", "2020-07-02T18:53:21.000Z": "Our monthly newsletter Ho'oha'aheo has gone digital! \n\nCheck out our debut issue featuring highlights on summer learning, a @fhsgovlove math teacher thinking outside the box, and what makes some of our recent alumni #PublicSchoolProud . https:// bit.ly/2BWYdbQ  #HI4PublicEd", "2020-07-02T19:15:06.000Z": "Many restaurants in Hawaii are now open for dining in. Mahalo to owners, managers, and staff who are keeping customers and the community safe. For those who are high risk or have underlying conditions, drive-thru, delivery, and pick-up remain the safest options. #HawaiiCOVID19", "2020-07-02T02:58:49.000Z": "JULY 1, 2020\n\nNew cases: 9 (8 adults, 1 pediatric)\nTotal cases: 926\nDeaths: 18\n\nTotal number of individuals tested: 80,290 Hawaii COVID-19 Joint Information Center Daily News Digest, July 1, 2020 Department of Health: Nine New Cases of COVID-19 in Hawai'i There are eight (8) additional adult cases, and one (1) pediatric case of coronavirus being reported by DOH; all are Hawai'i residents.... governor.hawaii.gov", "2020-07-02T02:14:36.000Z": "If you plan to use rideshares or taxis, see the CDC guidelines below. Help to protect yourself, each other and our community. Mahalo. Quote Tweet CDC @CDCgov If you plan to use rideshares or taxis, protect yourself & others from #COVID19 during your ride. Wear a cloth face covering, as able, and practice hand hygiene when leaving the vehicle AND when you arrive at your destination. More tips: https:// bit.ly/2D00nYE", "2020-07-01T23:40:55.000Z": "If you are planning to fly inter-island, please visit https:// health.hawaii.gov/travel/ and fill out the mandatory travel and health form within 24 hours of departure. \n\nClick below to read more on the new travel procedures: https:// governor.hawaii.gov/newsroom/lates t-news/hawaii-covid-19-joint-information-center-news-release-mandatory-travel-health-form-available-online-july-1-2020/  Disease Outbreak Control Division - Travelers' Health State of Hawaii, Department of Health health.hawaii.gov", "2020-07-01T20:35:21.000Z": "I had the chance to discuss all things #COVID19 and more with @GuyKawasaki . Check out the podcast! #remarkablepeople  #HIGov David Ige: Governor of Hawaii I'm Guy Kawasaki, and this is Remarkable People. This episode's guest is David Ige. He is the governor of the state of Hawaii. Hawaii has the least number of coronavirus infections, adjusted for... guykawasaki.com", "2020-07-01T03:05:46.000Z": "JUNE 30, 2020\n\nNew cases: 18\nTotal cases: 917\nDeaths: 18\n\nTotal No. of people tested: 79,058 Hawaii COVID-19 Joint Information Center Daily News Digest, June 30, 2020 Department of Health: 18 Additional COVID-19 Cases Associated with Previous Clusters Aggressive contact tracing by DOH is leading to the identification of additional COVID-19 cases associated with... governor.hawaii.gov", "2020-07-01T02:31:06.000Z": "Mayor Harry Kim is urging the Hawai'i Island community on Tuesday to keep up the good work of observing CDC guidelines of face masks, social distancing and hand hygiene over July 4 holiday. https:// youtube.com/watch?v=ukoQ4O PWD74   http:// records.hawaiicounty.gov/Weblink/1/doc/ 106287/Page1.aspx  Mayor Kim's Message for July 4 Weekend County of Hawaii Mayor Harry Kim's message for the 4th of July weekend. A reminder for the community to help keep us safe by follow rules and guidelines duri... youtube.com", "2020-06-30T20:56:27.000Z": "If you tested positive for #COVID19 and have no symptoms, stay home and away from other people. Learn more about CDC's recommendations about when you can be around others after COVID-19 infection: https:// bit.ly/3eh5YqS", "2020-07-01T01:28:17.000Z": "Reminder. Tomorrow is the first business day of the month. Statewide outdoor monthly siren and emergency alert test at 11:45 am. For more info visit http:// ready.hawaii.gov  #siren  #allhazards  #testonly  #publicsafety", "2020-06-30T19:06:03.000Z": "Please be sure to fill out the U.S. Census form, if you haven't already.  This is so important, because every person counts toward getting Hawaii its fair share of federal assistance, etc.", "2020-06-30T23:19:01.000Z": "Clinical healthcare professionals needed to become full-time contact tracers - The #UHohana - @HIgov_Health Contact Tracing Training Program has reopened registration for Track 1 to meet this need  https:// bit.ly/2AaAggE  #UHinTheCommunity", "2020-07-01T00:32:40.000Z": "News release with additional details on the gender neutral option at Gender neutral option available for state credentials beginning July 1, 2020 HONOLULU - The Hawaii Department of Transportation (HDOT) informs the public that effective July 1, 2020, there is a new gender option for State Identification cards, driver's licenses, and commerc... hidot.hawaii.gov", "2020-06-30T19:39:59.000Z": "If you are at higher risk for serious illness from COVID-19 because of your age or because you have a serious long-term health problem, it is extra important for you to take actions to reduce your risk of getting sick with the disease. #HawaiiCOVID19", "2020-06-30T02:52:39.000Z": "Via @dlnr : #HawaiiCOVID19 rules for commercial and recreational boating relaxed DLNR News Release-COVID-19 Rules for Commercial and Recreational Boats Relaxed, June 29, 2020 (Honolulu) - The State of Hawai῾i, through the Department of Land and Natural Resources (DLNR), Division of Boating and Ocean Recreation (DOBOR), with the concurrence of the Counties of Hawai'i,... governor.hawaii.gov", "2020-06-27T01:34:11.000Z": "Several West Hawai'i state parks will experience early closures on Independence Day. \n\nSee the full list here: http:// ow.ly/TSEl50Ajj07", "2020-06-30T01:19:31.000Z": "Help improve Hawaii's internet speeds by participating in a mapping effort. Please visit https:// cca.hawaii.gov/broadband/spee dmap/ ", "2020-06-30T02:31:51.000Z": "It's more important than ever to ensure every child's immunizations and physical exams are up-to-date. Parents, call your child's healthcare provider to schedule an appointment. Learn more about Hawai'i school health requirements at https:// health.hawaii.gov/docd/vaccines- immunizations/school-health-requirements/sy-20-21/   #HawaiiCOVID19", "2020-06-29T07:15:48.000Z": "Living with #COVID19 will require us to balance risks as we move forward in this marathon - a short video by @Hawaii_EMA helps share some of challenges out there FYI Medical Care During COVID FYI - COVID 19 should not prevent people from maintaining their regularly appointed medical visits. If you need mental or physical medical care, go see your ... youtube.com", "2020-06-29T15:15:07.000Z": "If you have certain underlying medical conditions, you are at increased risk of severe illness from #COVID19 , no matter your age. Find tips to protect yourself: https:// bit.ly/2UypEQ8", "2020-06-29T18:41:52.000Z": "If you haven't applied for the Paycheck Protection Program yet, hurry and call your bank today to ask about the Paycheck Protection Program or Economic Injury Disaster Loan Advance. The PPP deadline is tomorrow, June 30! #hawaiicovid19  #businessassistance  #SBA  #PPP", "2020-06-29T18:59:25.000Z": "The current pandemic's dramatic impact on the way we connect with each other. High-speed internet access for all is essential. To help identify Hawaii's underserved areas, the DCCA has launched an Internet Speed Map Tool that invites residents to map their home internet speeds.", "2020-06-29T20:02:06.000Z": "Reminder: @CDCgov still recommends wearing cloth face coverings in public to help prevent the spread of #COVID19 . Here's what a proper face covering should look like.", "2020-06-29T23:26:31.000Z": "To protect kupuna, the community needs to protect itself. \"No care facility, no matter how excellent, can keep covid-19 away if it's widespread in the community.\"  //www.washingtonpost.com/opinions/2020/06/25/we-cant-protect-nursing-homes-covid-19-without-protecting-everyone/", "2020-06-29T23:34:41.000Z": "The U.S. Census Bureau in Hawaii has begun a phased restart of 2020 Census field operations, particularly Updated Leave operations, or delivering Census invitations to rural households, or households with only p.o. boxes. http:// census.hawaii.gov/census_2020/ . http:// records.hawaiicounty.gov/Weblink/1/doc/ 105959/Page1.aspx  Census 2020 Your Ohana Counts! 2020 Census Guide   U.S. Census Bureau   Hawaii Government CCC   Language Resources for the 2020 Census   Check out Hawaii Counts for Upcoming 2020 Census Events The Census Bureau... census.hawaii.gov", "2020-06-29T19:19:01.000Z": "Heard about contact tracing, but not sure what it is? It's used by health departments to prevent the spread of #COVID19 . Learn more: https:// bit.ly/2ZkyWjJ . #SlowtheSpread", "2020-06-24T21:50:02.000Z": "As of June 23: More than 2.3 million #COVID19 cases have been reported in the U.S., with 40 states and jurisdictions reporting more than 10,000 cases. See how many cases have been reported in your state or county here: https:// bit.ly/2UjQ9XR", "2020-06-28T18:05:02.000Z": "RT @CDCgov : Are you or a loved one living with underlying medical conditions - or taking care of someone who is? Learn how you can reduce your and their risk of infection from #COVID19 : https:// bit.ly/2QGAa5h .", "2020-06-27T20:05:03.000Z": "RT @WHO : One of the most effective ways to prevent infection & reduce the spread of #COVID19 is to clean your hands thoroughly.\n\nWHO & @UNICEF launch Hand Hygiene for All Global Initiative to ensure #SafeHands for all http:// bit.ly/2Vlsckq From World Health Organization (WHO)", "2020-06-27T01:05:02.000Z": "RT @CDCgov : If you think or know you have #COVID19 and had symptoms, stay home and away from other people. Learn more about CDC's recommendations about when you can be around others: https:// bit.ly/3eh5YqS . From CDC", "2020-06-26T22:45:03.000Z": "RT @UHawaiiNews : Hawaiian name given to massive quasar of early universe - Most massive celestial object known in the early universe discovered on #Maunakea , named by @Imiloa Hawaiian naming program, A Hua He Inoa  https:// bit.ly/2ZfbULf  #Poniuaena", "2020-06-26T21:01:25.000Z": "RT @HIgov_Health : This week's community bulletin highlights how biking is booming: https:// mailchi.mp/doh/covid-19-c ommunity-bulletin-june-23-4495689 ", "2020-06-26T19:45:00.000Z": "Protect yourself & others from #COVID19 while camping. Wear a cloth face covering in public places like restrooms & picnic areas at campsites, & on trails. Keep at least 6 feet of physical distance between yourself & others, & frequently wash your hands. https:// bit.ly/2IZicXj", "2020-06-26T19:12:56.000Z": "Don't miss out on Payroll Protection Program. Get financial help for small businesses, sole proprietorships, independent contractors, self-employed persons & private non-profits. Contact your bank/credit union or visit http:// SBA.gov . Deadline: June 30. @SBAgov  #PPPLoan Small Business Administration We support America's small businesses. The SBA connects entrepreneurs with lenders and funding to help them plan, start and grow their business. sba.gov", "2020-06-26T02:16:45.000Z": "Eight out of 10 #COVID19 deaths reported in the U.S. have been in adults 65 years old and older. Remember to: Minimize time and activities outside the household. Wash your hands often. Keep 6 feet away or about two arm lengths between yourself and others. #HawaiiCOVID19", "2020-06-26T17:00:14.000Z": "Check out this free, high-quality virtual learning opportunity for PK-12 students! \n\nVisit the Summer Learning Lab website for more details (see graphic). Each session will be taught by a team of teachers who will provide whole and small-group meaningful instruction for students!", "2020-06-26T18:32:51.000Z": "Losing part-time work does not make you eligible for benefits if you're still working full-time: You must be either totally unemployed, or working less than your normal hours and earning less than your weekly benefit amount: https:// labor.hawaii.gov/ui/faq/#faq12", "2020-06-26T00:20:02.000Z": "RT @CDCgov : Pregnant women may be at an increased risk for severe illness from #COVID19 compared to nonpregnant women. Learn more in @CDCMMWR : https:// bit.ly/MMWR62520", "2020-06-25T23:17:28.000Z": "For more information about unemployment insurance and other labor issues please visit: https:// labor.hawaii.gov/covid-19-labor -faqs/  .\n\nSee the latest Unemployment Insurance Information from the Department of Labor and Industrial Relations: https:// governor.hawaii.gov/newsroom/lates t-news/dlir-news-release-state-releases-updated-unemployment-insurance-information/ ", "2020-06-25T23:17:27.000Z": " Incorrect deposit info supplied by claimants\n No weekly certifications filed by claimants\n Claim backdate issues\n Separation from work that requires investigation\n Claimants have filed multiple claims\n Failure to create a username & pwd in the claimant online portal", "2020-06-25T23:17:26.000Z": "Ninety-three percent (93%) of the valid unemployment insurance claims have been processed, and the state's paid out nearly $1.7B. For those who have not received their benefits, here are common reasons for the delays and denials:", "2020-06-25T23:06:42.000Z": "Our economy relies heavily on the movement of goods through our commercial harbors. As part of our economic recovery efforts, I've directed @DOTHawaii to defer scheduled tariff increases. DOT News Release: Governor Ige defers scheduled harbor tariff increase HONOLULU - The Hawaii Department of Transportation (HDOT) Harbors Division will defer the scheduled three-percent tariff increase on the orders of Governor David Ige. The tariff increase was schedu... governor.hawaii.gov", "2020-06-25T22:25:11.000Z": "The P-EBT (Pandemic Electronic Benefit Transfer) will provide temporary food purchasing assistance to households for students (K- 12th Grade) receiving free or reduced-price school meals in Hawai'i .", "2020-06-24T01:51:01.000Z": "#DYK : #Handwashing remains one of the best ways to prevent the spread of viruses like #COVID19 . Here are things to know about how to effectively : Prevent the Spread of COVID-19 | Five Things To Know About Properly... Washing your hands is one of the best ways to help stop the spread of #COVID19. U.S. Surgeon General Jerome Adams explains the five key steps you should take... youtube.com", "2020-06-25T22:02:40.000Z": "State releases updated unemployment insurance information: State Releases Updated Unemployment Insurance Information DEPARTMENT OF LABOR AND INDUSTRIAL RELATIONS  DAVID Y. IGE GOVERNOR SCOTT T. MURAKAMI DIRECTOR   FOR IMMEDIATE RELEASE June 25, 2020 STATE RELEASES UPDATED UNEMPLOYMENT INSURANCE INFORMATION State... labor.hawaii.gov", "2020-06-25T19:23:02.000Z": "Did you know? Among adults, the risk of severe illness from #COVID19 increases with age. Learn steps to reduce your risk: https:// bit.ly/2wEyT8h", "2020-06-25T20:09:24.000Z": "Hawaii imports an alarming amount of food. The hope of increasing local beef production may be found in the emerging grass-fed beef industry in Hawaii. One example of a local player is Paniolo Cattle Company, which uses grass-fed techniques and currently sold at Safeway!", "2020-06-25T20:12:02.000Z": " #COVID19 safety signage to be installed across the #UHManoa campus  https:// bit.ly/2Z9gZEu", "2020-06-25T20:15:09.000Z": "A new date, a new program and an online venue has been set for the 2020 Hawaii Energy Conference.  The live stream presentation will explore the theme \"Imagining a Just Recovery. What would that look like for the grid?\" Register today at https:// hawaiienergyconference.com  #HEC2020", "2020-06-25T19:45:34.000Z": "Testing. Contact tracing. Isolation. Sentinel surveillance. How do they all work together to control the spread of #COVID19 ? \"They're all tools in a toolbox - part of the bigger effort to protect the community,\" said Dr. Sarah Park. Continue reading: A comprehensive public health plan Testing. Contact tracing. Isolation. Sentinel surveillance. How do they all work together to control the spread of COVID-19? \"They're all tools in a toolbox - part of the bigger effort to protect the... governor.hawaii.gov", "2020-06-25T10:27:01.000Z": "New @UHWestOahu PV system adds 96 kilowatts to net-zero goal - The photovoltaic system is a step toward the #UHohana goal to produce as much renewable energy as it consumes  https:// bit.ly/30VKjBa", "2020-06-25T18:43:09.000Z": "FYI - Hawai'i Responds to COVID 19\nThe actions taken by the State of #Hawaii early on in the battle against #COVID19 have greatly helped keep the #curve down in the #AlohaState  #StaySafeStayHealthy  #LiveAloha  #beprepared  #FYI  #HIEMA  @ready .hawaii.gov", "2020-06-25T03:43:05.000Z": "Now is the time to work together to ensure that our local businesses can safely re-open to incoming travelers. #hawaiicovid19  #HIGov", "2020-06-25T03:43:04.000Z": "State of Hawai'i to launch #COVID19 pre-travel testing program for out-of-state travelers August 1. Travelers will have the option to pre-test or quarantine. OFFICE OF THE GOVERNOR - News Release - State to launch COVID-19 pre-travel testing program for... HONOLULU - Gov. David Ige announced today all travelers arriving in Hawai'i from out-of-state will be required to get a valid COVID-19 test prior to their arrival, and to show proof of a negative... governor.hawaii.gov", "2020-06-25T02:36:32.000Z": "Starting Aug. 1, travelers to Hawaii can get a #COVID19 test prior to arrival in lieu of the he 14-day quarantine. WATCH the news conference here: https:// m.facebook.com/story.php?stor y_fbid=307524080285123&id=387637784744953 ", "2020-06-25T00:40:47.000Z": "Trans-pacific travel is the key to Hawai'i's health. Now is the time to work together to ensure that our residents & local businesses can safely reopen. We need to take personal responsibility. Wash your hands. Wear your mask. Avoid large gatherings. Stay home if you feel sick.", "2020-06-25T00:40:27.000Z": "A multi-layers health screening process is set in place to protect our health and safety - temperature checks and mandatory Travel and Health form to be filled out. #HawaiiCovid19", "2020-06-25T00:40:01.000Z": "Pretesting for transpacific travel: those who have a valid negative #COVID19 test prior to arriving will NOT be subject to the 14-day quarantine. #HawaiiCovid19", "2020-06-25T00:33:43.000Z": "Announcing as of Aug 1, we will implement a pre-travel testing option for travelers to Hawai'i as an alternative to the 14-day travel quarantine. #HawaiiCovid19", "2020-06-24T23:02:14.000Z": "I have approved Mayor Kirk Caldwell's proposal to allow singing and/or playing of wind instruments at indoor and outdoor restaurants/bars, with some restrictions. Details: OFFICE OF THE GOVERNOR - News Release - Governor Ige approves City & County of Honolulu's request... HONOLULU - Gov. David Ige has approved Mayor Kirk Caldwell's proposal to allow singing and/or playing of wind instruments at indoor and outdoor restaurants/bars, with some restrictions. Performers... governor.hawaii.gov", "2020-06-24T20:10:13.000Z": "HHS has partnered with pharmacy and retail companies to accelerate testing for more Americans in more communities across the country. Find up-to-date information about #COVID19 testing on our new Community-Based Testing page: https:// bit.ly/2Z94glt", "2020-06-24T22:00:00.000Z": "The County of Hawai'i Bug Bustahs crew is out in force 7 days a week disinfecting public spaces, such as bus stops, pedestrian crosswalk poles, to keep island residents safe. Mahalo to the staff of DPW and Parks and Recreation for all their hard work! #hawaiicovid19  #bugbustahs", "2020-06-24T21:09:38.000Z": "I will be discussing transpacific travel this afternoon. Joining me will be:\n\n- @LtGovJoshGreen - @HawaiiSenate Senate President Ronald Kouchi\n- @hihousedems Speaker Scott K. Saiki,\n- @CountyofMaui Mayor Michael P. Victorino\n- @MayorKirkHNL - @HIgov_Health Dr. Bruce Anderson", "2020-06-24T19:10:45.000Z": "Find #covid -19 information in languages including Korean, Chinese, Chuukese, Marshallese, Tagalog, Tongan, & Vietnamese. Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-06-24T19:22:02.000Z": "Fall semester academic and space planning update - Provost Michael Bruno shares the academic formats and social distancing guidelines planned for the fall semester  https:// bit.ly/2AToyaj", "2020-06-24T20:31:54.000Z": "Save the dates! Kaiser Permanente is offering a \"COVID-19 and Beyond\" webinar to all HIDOE Hawaii-EUTF employees regardless of their health plan affiliation. 6/26, 11am-12pm and 6/29, 12-1pm. Use your HIDOE Intranet login to view the flyer with more info: https:// bit.ly/3dkpfGR .", "2020-06-17T21:32:06.000Z": "Yes-all interisland passengers must fill out the form. A parent or guardian must fill in a separate form for each child. Health information may be filled in no more than 24 hours in advance of flight time. View the Travel and Health Form: https:// health.hawaii.gov/travel/files/2 020/06/hawaii_state_traveler_health_form.pdf   #hawaiicovid19", "2020-06-18T22:16:59.000Z": "You will not be allowed to board your flight with a fever. You will be directed to a second screening and offered a COVID-19 viral test which you can choose to accept. These tests are paid by federal funds. For more travel FAQs, see https:// health.hawaii.gov/travel/travel- and-health-form/frequently-asked-questions/   #HawaiiCOVID19", "2020-06-24T19:00:00.000Z": "Get more information about active duty alerts at https:// consumer.ftc.gov/articles/0273- active-duty-alerts ", "2020-06-24T00:02:39.000Z": "Hurricane season is upon us.. #BePrepared Pack a #14DayEmergencyKit NOW and #StaySafe after the storm.. #HIEMA  #Hawaii  #LiveAloha", "2020-06-24T00:30:32.000Z": "The Hawaii Department of Commerce and Consumer Affairs is advising residents to be wary of COVID-19 scams. For more information https:// cca.hawaii.gov/ocp/covid19/  @MayorKirkHNL  @HonoluluGov", "2020-06-24T01:29:29.000Z": "This week's community bulletin highlights how hospitals in Hawaii are especially challenged during the COVID-19 pandemic and the Department of Health's Hawaii State Hospital has stepped up its operations: https:// mailchi.mp/doh/covid-19-c ommunity-bulletin-june-23-2020 ", "2020-06-24T01:00:00.000Z": "Do you know a kupuna or family in need of food assistance due to the pandemic? If so, let them know that Hawai'i County's coronavirus website has a comprehensive list of food distribution sites, locations of food hubs, and much more!\nLink:  https://coronavirus-response-county-of- hawaii-hawaiicountygis.hub.arcgis.com/pages/food-dis tribution ", "2020-06-22T20:21:41.000Z": "With more businesses reopening and inter-island travel increasing, it's important to protect YOUR health as well as your loved ones by continuing to: \n Wash hands for at least 20 seconds\n Wear a face mask when in public\n Physical distancing\n Staying home when sick", "2020-06-21T22:00:00.000Z": "Get free education and training in correct disinfection, hand washing, and social distancing practices for your business. Contact the county COVID Task Force on Education and Prevention at (808)935-0031 to schedule an appointment. #supportsmallbusiness  #shoplocal  #Hawaiicovid19", "2020-06-24T01:05:02.000Z": "RT @EnergyHawaiiGov : HSEO's spring newsletter is available for viewing. In this issue: HSEO's response and recovery efforts to COVID-19. https:// energy.hawaii.gov/wp-content/upl oads/2020/06/Spring-2020-e-newsletter.pdf ", "2020-06-24T00:45:02.000Z": "RT @DOTHawaii : Please help us gather information on COVID-19 impacts on commuters. There are three days left to take the survey at https:// surveymonkey.com/r/ACTcovidHawa ii  and so far we have fewer than 100 responses. Quote Tweet Hawaii DOT @DOTHawaii HDOT is asking all individuals currently working or planning to return to work in coming months to take a survey online at https:// surveymonkey.com/r/ACTcovidHawa ii  by June 26. The survey takes around 8-10 minutes to complete. More information can be found at https:// hidot.hawaii.gov/highways/rides hare/ ", "2020-06-23T23:21:16.000Z": "Governor says visitor pre-testing plan needed to reboot tourism is nearly finalized https:// bit.ly/2VsHF2n  #HNN Governor says visitor pre-testing plan needed to reboot tourism is nearly finalized In an interview with HNN's Sunrise on Tuesday morning, Gov. David Ige noted that Alaska's testing has hit some snags. hawaiinewsnow.com", "2020-06-23T23:24:29.000Z": "BEWARE: More warning about scammers pretending to be contact tracers: Hawaii COVID-19 Joint Information Center News Release-Renewed Warning About Scammers Pretending to... (Honolulu) - The State continues to warn of a multitude of scams associated with the COVID-19 virus; the latest involving scammers impersonating contact tracers in an attempt to acquire personal... governor.hawaii.gov", "2020-06-23T22:05:41.000Z": "The U.S. Small Business Administration recently reopened the Economic Injury Disaster Loan (EIDL) and EIDL Advance program portal to all eligible applicants experiencing economic impacts due to COVID-19 today.\nLink: https:// hawaiicounty.gov/Home/Component s/News/News/2236/720   #hawaiicovid19  #businessassistance", "2020-06-23T22:59:12.000Z": "Struggling to make payments because of COVID19? Follow these steps from @CFPB 1. Tell the company you've been impacted by the coronavirus pandemic\n2. Ask questions about the credit card relief packages they offer\n3. Get a written copy of your agreement http:// ow.ly/nnMI50AfZX4", "2020-06-23T20:52:52.000Z": "Dept. of Human Services & Hawaii Child Nutrition Program under HIDOE announced families w/ children who are eligible for free or reduced-price school meals will receive temporary cash assistance for food, due to COVID-19 impacts. More at https:// bit.ly/2Vczwi7 . #HI4PublicEd", "2020-06-23T20:32:22.000Z": "Please help us gather information on COVID-19 impacts on commuters. There are three days left to take the survey at https:// surveymonkey.com/r/ACTcovidHawa ii  and so far we have fewer than 100 responses. Quote Tweet Hawaii DOT @DOTHawaii HDOT is asking all individuals currently working or planning to return to work in coming months to take a survey online at https:// surveymonkey.com/r/ACTcovidHawa ii  by June 26. The survey takes around 8-10 minutes to complete. More information can be found at https:// hidot.hawaii.gov/highways/rides hare/ ", "2020-06-23T20:56:09.000Z": "#DHHL", "2020-06-22T12:51:19.000Z": "As states & communities re-open and you your activities, remember these basic #PublicHealth recommendations: Follow state & local guidelines When you're in public & it's difficult to keep a distance, wear a cloth face covering Frequent & thorough #handwashing", "2020-06-23T20:25:03.000Z": "RT @CDCgov : New info for caregivers and parents of people with developmental or behavioral disorders to help you protect yourself and others during #COVID19 . Learn more: https:// bit.ly/3dlMQqJ .", "2020-06-23T19:03:34.000Z": "This high-speed visualization illustrates airflow when breathing & coughing using home-made masks. Wearing any face covering over your mouth & nose is better than none at all. This protects others & may also protect you. Do your part to slow the spread. Cover smart. Do your part. Slow the spread. The high-speed visualizations illustrating airflow when breathing and coughing using home-made masks. Behind the scenes blog: https://www.nist.gov/blogs/taking-measure/my-stay-home-lab-shows-how-fa... nist.gov", "2020-06-23T18:44:01.000Z": "Parents: Newborn visits should be done in person to measure your baby's growth, check for jaundice, and make sure newborn screening tests are done.  Learn more about the importance of well visits and routine vaccines during COVID-19: https:// bit.ly/37xWLrS .", "2020-06-22T11:54:01.000Z": "Lets revisit the basics: How to handwash?\n\nUse Soap and  water for at least 40-60 seconds #HandHygiene  #COVID19", "2020-06-22T11:54:02.000Z": "How to handrub?\nUse alcohol-based handrub (sanitzer) for 20-30 seconds #HandHygiene  #COVID19", "2020-06-22T02:41:01.000Z": "Community contact tracer training underway - The first cohort for Track 2 consists of 31 participants taking the six-week intensive program  https:// bit.ly/37MYUjy  #UHinTheCommunity  @UHWestOahu  @uhkapiolani  @UHManoaNursing", "2020-06-22T22:02:16.000Z": "HIDOE releases preliminary results of distance-learning survey. Nearly 9,000 secondary students and over 61% of teachers, totaling more than 8,300 teachers, completed the surveys.\n\nTo read the full news release, visit: https:// bit.ly/3fStvPL . #HI4PublicEd", "2020-06-23T00:00:00.000Z": "Wondering where you can get tested for Covid-19? Check out the County of Hawaii Covid-19 Resources website for a list of testing locations and health care facilities. #hawaiicovid19  #covidtesting  #stayhealthyandsafe  #civildefensehi Link:  https://coronavirus-response-county-of- hawaii-hawaiicountygis.hub.arcgis.com", "2020-06-23T00:19:01.000Z": "Numerous #COVID19 related phishing schemes and fraud campaigns have been reported in the news. Cybersecurity awareness for COVID-19 precautions including links to other resources are listed on the @ITSatUH Information Security page: https:// hawaii.edu/infosec/", "2020-06-19T19:36:25.000Z": "FDA advises consumers not to use any hand sanitizer manufactured by Eskbiochem due to the potential presence of methanol, which can be toxic when absorbed through the skin or ingested: https:// go.usa.gov/xwp3c", "2020-06-20T19:29:01.000Z": "Restaurant and bar owners: Have you planned what to do if a staff member gets sick with #COVID19 ? CDC offers tips to protect the health and safety of staff and customers. Tips here: https:// bit.ly/3e4irOX .", "2020-06-21T20:18:01.000Z": "Feeling sick? Answer a few questions about your symptoms using Clara, CDC's #Coronavirus Self-Checker, to help you decide if you should call your doctor: https:// bit.ly/2UX7qXl .", "2020-06-23T01:35:02.000Z": "RT @HawaiiSenate : Hawai'i legislators announce plan to use CARES funds to support Hawai'i's unemployed and small businesses, rebuild Hawai'i's economy. #covid19  #coronavirushawaii Hawai'i legislators announce plan to use CARES funds to support Hawai'i's unemployed,small business Hawai'i legislators announce plan to use CARES funds to support Hawai'i's unemployed and small businesses, rebuild Hawai'i's economy. Senate President Ronald D. Kouchi, State House Speaker Scott K.... hawaiisenatemajority.com", "2020-06-23T00:50:03.000Z": "RT @UHawaiiNews : Community contact tracer training underway - The first cohort for Track 2 consists of 31 participants taking the six-week intensive program  https:// bit.ly/37MYUjy  #UHinTheCommunity  @UHWestOahu  @uhkapiolani  @UHManoaNursing", "2020-06-22T17:10:03.000Z": "After #COVID19 was declared a national emergency, emergency dept visits for life-threatening conditions declined. If you experience chest pain, loss of motor function, altered mental status, or other life-threatening issues, seek immediate care. @CDCMMWR : https:// bit.ly/MMWR62220 .", "2020-06-22T20:05:26.000Z": "The Hawaii Visitors and Convention Bureau has launched a Kamaaina Special Offers Program! The program is geared toward Hawaii residents and includes exclusive specials. For more information, please visit http:// HawaiiSpecialOffers.com/kamaaina/  #HawaiiTourism", "2020-06-22T19:35:02.000Z": "#HCP : Protect yourself and others from #COVID19 by following these facemask do's and don'ts. Learn more: https:// bit.ly/3dqKGq7 .", "2020-06-22T20:38:36.000Z": "#COVID19 Care Conversation with @ryankaleitsuji & @yunjid happening now https:// m.facebook.com/story.php?stor y_fbid=1708672549308130&id=387637784744953 ", "2020-06-21T05:11:13.000Z": "Today I issued a supplementary emergency proclamation for #Kauai , after heavy rains caused flooding and extensive damage on Mar. 27 and 28, 2020. This supplementary emergency proclamation is effective through Aug. 19, 2020 Governor's Office - News Release - Gov. Ige extends disaster period for Kaua'i for March flooding MC HONOLULU - Gov. David Ige today issued a supplementary emergency proclamation for Kaua'i, after heavy rains caused flooding and extensive damage on Mar. 27 and 28, 2020. The declaration provides... governor.hawaii.gov", "2020-06-20T02:46:44.000Z": "When caring for someone who is sick with #COVID19 , limit contact.  If possible, use separate bedrooms and avoid sharing personal items, such as such as dishes, glasses, silverware, towels, bedding, or cell phones with the person who is sick. #HawaiiCOVID19", "2020-06-20T01:23:13.000Z": "Registration to open next week for July 30 Live Stream Hawaii Energy Conference. Hawaii Energy Conference | Leading the Evolution - Hawaii Energy Conference Imagining a Just Recovery. What would that look like for the grid? Please join us online July 30th for a robust discussion of how the energy sector can and should respond to our current challenges by... hawaiienergyconference.com", "2020-06-20T00:58:16.000Z": "Health Director Bruce Anderson and State Epidemiologist Dr. Sarah Park discuss today's increase of COVID-19 cases in Hawai'i. https:// facebook.com/watch/?v=88556 3405297925   @MayorKirkHNL  @HonoluluGov Hawaii State Department of Health on Facebook Watch 6/19/20 - Health Director Bruce Anderson and State Epidemiologist Dr. Sarah Park discuss today's increase of COVID-19 cases in Hawai'i. facebook.com", "2020-06-20T00:08:52.000Z": "Today's spike in positive #COVID19 cases was anticipated as we began the process to re-open our community. It's still manageable, but we must cont. to be vigilant, esp. bc of the potential harm that the virus can cause to our most vulnerable populations. Hawaii COVID-19 Joint Information Center News Release-Largest Since Day Increase in Case Since... Despite Spike, State Officials Say All Systems Working as Planned (Honolulu) - The Hawai'i Dept. of Health (DOH) is reporting 27 new positive cases of coronavirus today, which is the highest number... governor.hawaii.gov", "2020-06-19T23:19:55.000Z": "Breene was a true dedicated public servant who worked tirelessly & selflessly for the community he loved, even while fighting his illness. We worked together to make my hometown of Pearl City a better place. Dawn & I offer our deepest condolences to Breene's 'ohana & loved ones.", "2020-06-19T20:27:12.000Z": "Happy #JuneteenthDay ! Join me in celebrating freedom, recognizing African American achievements and advocating for equal treatment for all. \n\nGraphic credit: @canva", "2020-06-19T00:14:20.000Z": "[WATCH LIVE] COVID-19 Community Connection conversation with Hawaii's Mayors: https:// m.facebook.com/story.php?stor y_fbid=2626039197670755&id=387637784744953 ", "2020-06-17T23:48:16.000Z": "All four county mayors will be joining me again tomorrow on the Community Connection's edition of Facebook Live. We're taking your questions live so here's your opportunity to connect with your county mayor. Tune in, Thursday, June 18 at 2PM: http:// facebook.com/governordavidige ", "2020-06-16T03:17:36.000Z": "[WATCH] June 15, 2020 #COVID19 News Conference: Starting tomorrow, June 16, we are lifting the inter-island travel quarantine. Dr. Bruce Anderson discusses the new inter-island travel forms and procedures. Governor David Ige on Facebook Watch June 15, 2020 News Conference - COVID-19 Update. Starting tomorrow, June 16, we are lifting the inter-island travel quarantine. With me today is Dr.... facebook.com", "2020-06-16T03:15:33.000Z": "Do your part to make interisland travel safe - practice physical distancing and wear your face covering. I also strongly encourages people to fill in the form before they get to the airport. Visit https:// health.hawaii.gov/travel/https:/ /health.hawaii.gov/travel/ ", "2020-06-16T03:15:32.000Z": "I know family & friends across the state are looking forward to getting together when the interisland travel quarantine is lifted. Flying between islands will be a different experience. We ask for your patience as the new procedures are implemented. News Release - Hawaii COVID-19 Joint Information Center, June 14, 2020 (Honolulu) - In advance of the reopening of interisland travel in Hawai'i, on Tuesday, June 16, the Dept. of Health (DOH) is directing travelers to a new website, where you can download the mandatory... governor.hawaii.gov", "2020-06-15T21:31:29.000Z": "The director of the @HIgov_Health Dr. Bruce Anderson will be joining me this afternoon to discuss the resumption of inter-island travel.", "2020-06-13T01:56:33.000Z": "Hawai'i County Mayor Harry Kim issued an Emergency Rule on Friday that reopens most businesses, operations and activities, including short-term vacation rentals. Exceptions such as bars, nightclubs and other specified venues will remain closed. http:// records.hawaiicounty.gov/Weblink/1/doc/ 105128/Page1.aspx ", "2020-06-12T21:04:29.000Z": "WATCH LIVE: http:// facebook.com/governordavidige  Guest speakers:\n Dr. Bruce Anderson, Director, @HIgov_Health  Hilton Raethel, President and CEO, @HealthcareHAH  Dr. Cecilia Shikuma, Professor, @uhmed", "2020-06-12T00:31:13.000Z": "Today we celebrate the life of a fearless leader in our islands. As you celebrate, remember to practice physical distancing, wear your face covering and wash your hands to #StoptheSpread of #COVID19 . #HappyKingKamehamehaDay", "2020-06-11T02:56:18.000Z": "We are working very hard toward re-opening out-of-state travel, but we're not there yet. There are new virus flare-ups in key mainland markets - including CA where more than 2K new cases were reported yesterday. OR, AZ and TX are also reporting their highest # of new daily cases.", "2020-06-11T02:56:17.000Z": "Today I signed a ninth supplementary emergency proclamation that extends the #COVID19 emergency period through July 31. OFFICE OF THE GOVERNOR - News Release - Governor Ige extends COVID-19 emergency period through... Governor Ige extends COVID-19 emergency period through July, lifts inter-island quarantine next week HONOLULU - Gov. David Ige today signed a ninth supplementary emergency proclamation that extends... governor.hawaii.gov", "2020-06-11T01:36:02.000Z": "DLIR announces revised unemployment insurance information: State Announces Revised Unemployment Insurance Information DEPARTMENT OF LABOR AND INDUSTRIAL RELATIONS  DAVID Y. IGE GOVERNOR SCOTT T. MURAKAMI DIRECTOR FOR IMMEDIATE RELEASE June 10, 2020 STATE ANNOUNCES REVISED UNEMPLOYMENT INSURANCE INFORMATION State Has... labor.hawaii.gov", "2020-06-11T02:35:33.000Z": "Today I approved a request from Mayor Derek S.K. Kawakami to safely re-open more businesses, operations or activities under guidelines that will ensure the health, safety and welfare of the people of #Kauai county, effective June 16, 2020. Details: Governor's Office - News Release - Gov. Ige approves Mayor Kawakami's Emergency Rules #12 HONOLULU - Gov. David Ige today approved a request from Mayor Derek S.K. Kawakami to safely re-open more businesses, operations or activities under guidelines that will ensure the health, safety and... governor.hawaii.gov", "2020-06-11T01:56:51.000Z": "June 10, 2020 News Conference - Announcing the signing of the Ninth Emergency Proclamation relating to #COVID -19. Governor David Ige on Facebook Watch June 10, 2020 News Conference - COVID-19 Update. Announcing the signing of the Ninth Emergency Proclamation relating to COVID-19 which extends the... facebook.com", "2020-06-10T21:32:25.000Z": "WATCH AT http:// facebook.com/governordavidige  Guest speakers:\n Clare Connors, Hawai'i Attorney General\n Tim Sakahara, Public Information Officer, Hawaii Department of Transportation\n Dr. Bruce Anderson, Director, Hawaii State Department of Health", "2020-06-10T17:20:02.000Z": "Do you know a new or expectant parent? Reach out and offer support during #COVID19 while maintaining social distance. Find ways to connect: https:// bit.ly/340pBQa .", "2020-06-10T17:28:58.000Z": "Hawaii DOH's Disease Outbreak Control Division (DOCD) is keeping an eye on detecting flu and #COVID19 in the community through its Sentinel Surveillance Program. Get the scoop on sentinel surveillance testing from Influenza Epidemiologist Han Ha Youn. https:// hawaiicovid19.com/the-scoop-on-s entinel-surveillance-testing/ ", "2020-06-10T03:20:02.000Z": "RT @UHWestOahu : #uhwestoahu has begun reconfiguring classrooms so students and faculty are able to practice safe social distancing when in-person instruction resumes in fall 2020. Photo courtesy of UH West O'ahu Planning and Facilities.", "2020-06-09T22:14:00.000Z": "Good news for Hawaii: By allowing for more efficient and coordinated emergency maritime assessments of harbors, this agreement will help port recovery efforts, including movement of fuel vessels to Hawaii and between islands following natural disasters. https:// content.govdelivery.com/accounts/USDHS CG/bulletins/2836752 ", "2020-06-09T22:30:49.000Z": "Check out these 3  tips to protect yourself and others from #COVID19 gov't imposter scams from the @FTC : https:// go.usa.gov/xwbyd", "2020-06-09T22:34:24.000Z": "Save the Date! #WEAAD is June 15th. In the mean time read up on how to Keep our Kupuna Safe  http:// ow.ly/vREf50A3qVp", "2020-06-10T01:26:53.000Z": "HDOT is asking all individuals currently working or planning to return to work in coming months to take a survey online at https:// surveymonkey.com/r/ACTcovidHawa ii  by June 26. The survey takes around 8-10 minutes to complete. More information can be found at Rideshare Ridesharing programs offer the least expensive way to reduce rush hour traffic congestion by moving more people in fewer cars. To encourage ridesharing, HDOT provides High Occupancy Vehicles Lanes... hidot.hawaii.gov", "2020-06-10T02:26:14.000Z": "June is National Reunification Month and the Child Welfare Services division of DHS honors and recognizes families who have overcome obstacles to providing a safe and loving home for their children, and their support systems who have helped with their 'ohana's reunification. #DHS", "2020-06-10T00:23:58.000Z": "Looks like COVID-19 is the catalyst for the future of telemedicine for Medicare and Medicaid. @SeemaCMS  @CMSGov  @GovHawaii COVID-19: Telemedicine is HERE TO STAY for Medicare & Medicaid - John A. Burns School of Medicine This is a 2017 photo composite, relative today.   President Trump's top Medicare official said Tuesday that expanded access to telemedicine should continue jabsom.hawaii.edu", "2020-06-09T20:46:31.000Z": "Hawaii doctors worry that patients are neglecting their regular visits as well as their health via @staradvertiser Hawaii doctors worry that patients are neglecting their regular visits as well as their health |... Despite fears surrounding the new coronavirus, Hawaii health officials are urging the public to go to the doctor for routine checkups, vaccinations and to manage chronic diseases to prevent a spike... staradvertiser.com", "2020-06-09T01:28:07.000Z": "Healthy employees are crucial to Hawaii's businesses. Encourage employees to stay home if they're sick and have conversations with employees about their concerns. For more guidance for small businesses, visit https:// cdc.gov/coronavirus/20 19-ncov/community/guidance-small-business.html   #HawaiiCOVID19", "2020-06-09T19:38:00.000Z": "Social distancing plays a critical role in preventing the spread of COVID-19. Some germs can spread easily through coughs, sneezes, hugs and handshakes. Stay at least 6ft. away from others. Even if you are well, others around you may be sick. https:// facebook.com/watch/?v=17562 31237865958 ", "2020-06-08T21:32:01.000Z": "Your #UHohana - @HIgov_Health Contact Tracing Training Program kicked off today! The first pilot group will have 16 trainees in a free, online one-and-a-half day training for clinical healthcare professionals  https:// bit.ly/2XIDjFw", "2020-06-08T19:45:03.000Z": "Caring for someone living with #Alzheimer 's disease or another type of #dementia ? Take additional steps to protect and care for them and yourself during the #COVID19 pandemic: https:// bit.ly/2YaTF9e .", "2020-06-07T20:14:01.000Z": "It's natural to experience many emotions during #COVID19 . Getting help can assist you in finding ways to cope with these feelings. Here are resources: https:// bit.ly/340pBQa .", "2020-06-09T00:50:02.000Z": "RT @CDCgov : It's natural to experience many emotions during #COVID19 . Getting help can assist you in finding ways to cope with these feelings. Here are resources: https:// bit.ly/340pBQa .", "2020-06-08T20:44:13.000Z": "#COVID Care Conversation happening #live now via @StarAdvertiser with @yunjid and @ryankaleitsuji Honolulu Star-Advertiser Write your questions for Governor Ige in the comments, and please like and share this video! This is a daily Facebook Live discussion, highlighting the latest news, resources and community concerns... m.facebook.com", "2020-06-08T17:54:48.000Z": "Here's the latest facts and figures from the whole-of-America #COVID19 response (as of 6/8/20): 20.3 million samples tested 205.6 million cloth masks delivered 23,030 ventilators currently available\n\nMore: http:// fema.gov/coronavirus/ne ws-multimedia   https:// fema.gov/coronavirus/ne ws-multimedia ", "2020-06-08T19:25:01.000Z": "False information on #COVID19 is spreading & putting people in danger. Make sure to double-check everything you hear against trusted sources. For accurate information on #coronavirus find official advice from your country's public health authority & WHO! From World Health Organization (WHO)", "2020-06-05T22:18:54.000Z": "#HonoluluPD  #cchnl", "2020-06-05T23:29:06.000Z": "Effective immediately Wiki Permits, the online permitting system for limited commercial activities on State beaches, such as weddings and vow renewals, is resuming service subject to the following COVID-19 \"Act With Care\" restrictions\n\nSee full list at: http:// ow.ly/6a7C50A0qvv", "2020-06-05T21:07:43.000Z": "NEWS RELEASE: FEMA Awards $3.7 Million to Hawaii for COVID-19 Response NEWS RELEASE: FEMA Awards $3.7 Million to Hawaii for COVID-19 Response June 5, 2020DR-4510-HI NR001News Desk:Phone: 808-354-4263Email: hawaiicovid19@gmail.com News Release FEMA Awards $3.7 Million to Hawaii for COVID-19 ResponseHONOLULU, HI - The Federal Emergency... dod.hawaii.gov", "2020-06-06T01:10:06.000Z": "Hawaii Attorney General Clare Connors dispels rumors of out-of-state troublemakers at protests https:// 808ne.ws/2Y9R4fL ⠀\n⠀ #Hawaii  #HInews  #GeorgeFloyd", "2020-06-05T23:47:58.000Z": "Mahalo to the @LtGovJoshGreen Dr. James Ireland, @HPU , Hawaii Health Systems Corporation, donors and the 140+ volunteers for stepping forward to help our community. For more information, visit http:// alohafreeclinic.org or call (808) 726-2600 to make your appointment.", "2020-06-05T23:47:57.000Z": "Earlier this week, the Aloha Free Clinic opened up its door to Hawai'i residents who are uninsured during this time of crisis. This volunteer based, 90-day pop-up clinic offers free in-person visits, tele-health, generic medication, and discounted blood tests statewide.", "2020-06-05T20:32:25.000Z": "Total Monthly UI (regular, FPUC ($600) 2020:", "2020-06-05T20:30:00.000Z": "As a mark of respect for former state Rep. Joseph Bertram III, flags shall be flown at half-staff until 6/8. Bertram was elected in '06 & re-elected in '08. He was known for taking on many challenging issues & advocating for change that would make his community a better place.", "2020-06-05T17:33:02.000Z": "Preparing for hurricane season? To avoid exposure to #COVID19 , try home delivery services to buy your disaster supplies. If that is not an option for you, be sure to take steps to protect your health and the health of others when running essential errands. https:// bit.ly/34ucuqJ", "2020-06-05T06:25:42.000Z": "Today I approved Mayor Kirk Caldwell's proposal to re-open designated indoor/outdoor businesses and operations, including fitness facilities and bars. The businesses/operations will open with limitations starting on June 19. Office of the Governor - Gov. Ige approves City & County of Honolulu's request to re-open more... HONOULU - Gov. David Ige today approved Mayor Kirk Caldwell's proposal to re-open designated indoor/outdoor businesses and operations, including fitness facilities and bars. The businesses/operations... governor.hawaii.gov", "2020-06-05T01:59:12.000Z": "This week's community bulletin highlights strategic testing to stop community spread of COVID-19: https:// mailchi.mp/doh/covid-19-c ommunity-bulletin-june-4-20 ", "2020-06-04T19:19:04.000Z": "Civil Defense PSA for Thursday am, June 4. Zero active cases of COVID-19. Testing today at Keauhou Shopping Center from 8am to noon. On Friday, June 5, Food Basket distribution at Waikoloa Elementary and Middle School from 10am to noon.", "2020-06-04T19:45:03.000Z": "NEWS RELEASE: HI-EMA Reminds Residents to Prepare For Hurricane Season NEWS RELEASE: HI-EMA Reminds Residents to Prepare for Hurricane Season FOR IMMEDIATE RELEASEJune 4, 2020 HONOLULU - While the National Weather Service is predicting an average storm potential for this year's hurricane season-2-6 tropical cyclones, the uncertainty posed... dod.hawaii.gov", "2020-06-04T20:37:24.000Z": "NEWS RELEASE: David Lopez Named Executive Director of Hawai'i Emergency Management Agency https:// dod.hawaii.gov/hiema/news-rel ease-david-lopez-named-executive-officer-of-hawaii-emergency-management-agency/ ", "2020-06-04T20:52:13.000Z": "WATCH: Gov. Ige talks rebuilding Hawaii WATCH: Gov. Ige talks rebuilding Hawaii HONOLULU (KHON2) - Governor David Ige says he is working with industry leaders to reboot our local economy. He says this will start with residents being allowed to travel inter-island quarant khon2.com", "2020-06-03T15:00:15.000Z": "Gov. David Ige announced that the mandatory quarantine for interisland travel will be lifted on June 16.​ Interisland quarantine to be lifted on June 16 Gov. David Ige announced that the mandatory quarantine for interisland travel will be lifted on June 16. bizjournals.com", "2020-06-02T20:07:00.000Z": "As schools, businesses and community organizations begin to resume operations during #COVID19 , protect yourself and others when using public transportation. Keep 6 feet between yourself & others when possible and wear a cloth face covering. Find more tips: https:// bit.ly/36A09Cl", "2020-06-03T23:03:01.000Z": "Communities in #Hawaii are not impacted equally by the #COVID19 pandemic - In response to the challenges faced, @UHM_SocialWork is offering a FREE webinar \"COVID-19 and Vulnerable Communities.\" Happening every Friday through June 5, 12-1pm: Details: https:// bit.ly/2YWBWEi", "2020-06-03T23:16:01.000Z": "#UHohana architects and engineers are reconfiguring classrooms and teaching laboratories so students and faculty are able to practice safe social distancing when in-person instruction resumes in fall 2020  https:// bit.ly/3eO1cRX", "2020-06-03T16:37:40.000Z": "We've received a lot of messages asking us about this rumor. It was false in March, and it's false now. Quote Tweet National Guard @USNationalGuard ICYMI: We continue to hear from many of you asking if certain rumors you've seen online about the National Guard are true. This message in particular keeps popping up. For the record: it is not true. Check the facts about this rumor and others here: https:// ngpa.us/8605", "2020-06-04T01:19:05.000Z": "Together, we will emerge stronger and more resilient, as a result of learning from and overcoming this challenge. \n\nRead the full news release at Hawaii COVID-19 Joint Information Center News Release-Economic Reopening Strategy Online, June 3,... (Honolulu) - Anyone interested in getting more detail on the State's Beyond Recovery: Reopening Strategy, can now view the entire detailed strategy online. It was developed by the Governor's Office... governor.hawaii.gov", "2020-06-04T01:19:04.000Z": "Anyone interested in getting more detail on the State's Beyond Recovery: Reopening Strategy, can now view the entire detailed strategy online at https:// recoverynavigator.hawaii.gov/reopening-stat us/#detailed-strategy  .", "2020-06-03T23:35:03.000Z": "Episode 4 of #TalkStorywithHouseMajority  @RepBelatti . Watch here: https:// m.facebook.com/story.php?stor y_fbid=3343920815618287&id=112028582140876 ", "2020-06-03T19:57:37.000Z": ". @hihousedems State Representative Scott Saiki and I will join State Representative Della Au Belatti as she hosts #TalkStoryWithHouseMajority at 1:30 PM today. Join the conversation about leadership in times of crisis, consensus building and our new normal.", "2020-06-03T17:45:15.000Z": "All 16 solar plus storage projects from Hawaiian Electric's Phase 2 #renewableenergy have been added to HSEO's one-stop project information page with interactive map of the projects and a notice board for public hearings! Learn about these projects at: https:// energy.hawaii.gov/hawaiian-elect ric-phase2 ", "2020-06-02T23:41:02.000Z": "Please file your certifications! Quote Tweet DLIR @HI_DLIR Please file your certifications including weeks you may have missed in the past as the system is capable of processing. twitter.com/HI_DLIR/status", "2020-06-02T22:18:02.000Z": "#blackouttuesday Credit: @biticonjustine", "2020-06-02T03:08:51.000Z": "\"We join in mourning the tragic death of #GeorgeFloyd and send our aloha to his family and friends. We understand the sadness, disappointment, anger and fear that so many across our nation live with daily. And we stand with those peacefully protesting long-standing injustices.", "2020-06-02T03:00:37.000Z": "The state @DOTHawaii will require thermal screening at the airport for everyone traveling inter-island. HDOT will also require travelers to fill out a new form that'll now also ask for health-related info to assist the state in tracking and responding to new COVID-19 cases.", "2020-06-02T03:00:36.000Z": "Today I announced that the state will be lifting the 14-day quarantine requirement for inter-island travelers, effective June 16. OFFICE OF THE GOVERNOR - News Release - Governor Ige lifting quarantine requirement for inter-isl... HONOLULU - Gov. David Ige today announced that the state will be lifting the 14-day quarantine requirement for inter-island travelers, effective June 16. The state Department of Transportation will... governor.hawaii.gov", "2020-06-01T19:53:17.000Z": "Try taking 20 minutes doing something the kids choose - like playing a game or reading - together with them.\n\nNo or so you can focus on them.\n\nQuality time will make them feel safe & loved.\n\nMore parenting tips during #COVID19   https:// bit.ly/ParentingCOVID 19   #ParentsDay", "2020-06-01T21:30:45.000Z": "[WATCH LIVE] http:// facebook.com/governordavidige   @LtGovJoshGreen  @HawaiiSenate President Ronald D. Kouchi \n @hihousedems Speaker Scott K. Saiki\n @AtghIgov Clare Connors, \n Dr. Anderson, @HIgov_Health  Tim Sakahara, @DOTHawaii  Peter Ingram, President/CEO, @HawaiianAir", "2020-06-01T20:46:43.000Z": "WATCH #COVID19 Care Conversation via @StarAdvertiser at https:// m.facebook.com/story.php?stor y_fbid=1688011951374190&id=387637784744953 ", "2020-05-29T01:51:23.000Z": "For the latest updates about driver licensing and satellite city hall updates, visit http:// bit.ly/CSDServicesUpd ate  .", "2020-05-29T01:51:03.000Z": "Today I approved requests from Mayor Harry Kim and Mayor Derek S.K. Kawakami to safely re-open more businesses and operations under guidelines that will ensure the health, safety and welfare of the people in Hawai'i and Kaua'i counties: OFFICE OF THE GOVERNOR - News Release - Governor Ige approves emergency rules for counties of... Governor Ige approves emergency rules for counties of Hawai'i and Kaua'i May 28, 2020 HONOLULU - Gov. David Ige today approved requests from Mayor Harry Kim and Mayor Derek S.K. Kawakami to safely... governor.hawaii.gov", "2020-05-29T00:54:21.000Z": "This week's community bulletin highlights: How one Hawaii couple has taken care of its family's mental health during the COVID-19 crisis: https:// mailchi.mp/doh/covid-19-c ommunity-bulletin-may-28-20 ", "2020-05-28T23:48:42.000Z": "I'm joined by all County Mayor: WATCH LIVE: http:// facebook.com/governordavidige ", "2020-05-27T23:15:58.000Z": "Please file your certifications including weeks you may have missed in the past as the system is capable of processing. Quote Tweet DLIR @HI_DLIR Please file your certifications weekly or biweekly! twitter.com/HI_DLIR/status", "2020-05-28T00:30:30.000Z": "Hawaii residents who suspect an imposter claim has been filed in their name should contact the Unemployment Insurance Division at (808) 586-8947 State Monitoring for Fraudulent Unemployment Insurance Claims State of Hawaii Seal DEPARTMENT OF LABOR AND INDUSTRIAL RELATIONS  DAVID Y. IGE GOVERNOR SCOTT T. MURAKAMI DIRECTOR FOR IMMEDIATE RELEASE May 27, 2020 STATE MONITORING FOR FRAUDULENT UNEMPLOYMENT... labor.hawaii.gov", "2020-05-28T03:01:35.000Z": "Governor Ige approves requests to safely re-open more businesses across the state. OFFICE OF THE GOVERNOR - News Release - Governor Ige approves requests to safety re-open more... HONOLULU - Gov. David Ige today approved Mayor Kirk Caldwell's proposal to safely re-open more businesses and operations on O'ahu, under guidelines that will ensure the safety of employees and... governor.hawaii.gov", "2020-05-28T01:36:07.000Z": "The county mayors will be joining me on Facebook live to discuss the reopening of businesses and activities in their counties. We will be taking questions, so tune in and ask your questions live. WATCH LIVE http:// facebook.com/governordavidige   #HawaiiCOVID19", "2020-05-27T03:49:26.000Z": "Every business in Hawai'i has been impacted by #COVID19 , including Young Brothers. The company is part of the state's critical infrastructure that keeps goods moving to & between the islands. We'll be considering the request as part of the recovery & resiliency efforts underway.", "2020-05-26T20:22:22.000Z": "Due to the COVID-19 pandemic, many Shared Ride users are unable to use their Shared Ride Taxi Coupons within the timeframe allowed.  For the convenience of our users, the Hawai'i County Mass Transit Agency is extending the expiration from April 30, 2020 and May 31 June 30, 2020.", "2020-05-26T20:42:09.000Z": "Civil Defense PSA for Tuesday am, May 26. Of 81 total COVID-19 cases, 80 have been cleared, with one person quarantined. Food Basket distribution today at Pahala Community Center, 10am-noon while supplies last.", "2020-05-26T23:02:02.000Z": "New measures include appointment-only service, requiring masks/face coverings, 30-inch high sneeze guards at counters & yellow floor markings to help maintain social distancing. To learn more, visit http:// bit.ly/CSDServicesUpd ate  .", "2020-05-27T02:58:31.000Z": "As the state continues to re-open and people begin to return to work, we know that childcare is essential. DHS is announcing contract opportunities for childcare facilities and is also seeking RFP for Emergency Child Care Services. More: https:// bit.ly/36wcS8Q  #ohananuistrong", "2020-05-27T00:52:51.000Z": "WATCH LIVE - May 26, 2020 News Conference - #COVID19 update: Governor David Ige on Facebook Watch May 26, 2020 News Conference: COVID-19 Update - I will be joined by the Director of the Department of Human Services Pankaj Bhanot and our Economic and... facebook.com", "2020-05-26T22:25:04.000Z": "RT @StarAdvertiser : Meal, grocery delivery services can help sheltering seniors #coronavirus  #COVID19  https://", "2020-05-26T20:53:40.000Z": ". @HonoluluGov Driver Licensing Centers reopened today for services to driver license and state identification cards expiring in March and June. Appointments can be made at http:// AlohaQ.org .", "2020-05-26T21:05:53.000Z": "Disasters won't wait for the pandemic to be over. Make a plan with your family in case you have to deal with #COVID19 and weather hazards at the same time. Find tools and resources on how to prepare for emergencies on http:// ready.gov/plan", "2020-05-26T21:21:27.000Z": "WATCH at: http:// facebook.com/governordavidige  Guest speakers:\n Pankaj Bahnot, Director, Dept. of Human Services\n Alan Oshima, Economic Recovery and Resiliency Navigator", "2020-05-26T19:56:37.000Z": "Everyone in Hawaii has the power to shape our future. Safe Practices like physical distancing, washing hands and wiping down surfaces help control the spread of #COVID19 in Hawaii.\n\nWe need everyone to come together to fight #HawaiiCOVID19 .", "2020-05-26T18:23:41.000Z": "We are pleased to announce the statewide launch of Library Take Out at 47 of our 51 public libraries! Starting today, Tuesday, May 26th, library patrons may now schedule a Library Take Out appointment time to pick up their hold item(s) at their favorite library.", "2020-05-26T19:46:02.000Z": "Your #UHohana will help to expand #COVID19 testing capacity on #Oahu as part of a new partnership with @HonoluluGov   https:// bit.ly/2ZjyYKp  @uhmanoa  @uhmed  @algoriphagus", "2020-05-25T18:01:21.000Z": "Today we remember those who gave their lives serving our country. As we honor their memory, let us continue to support their families and friends. #MemorialDay2020", "2020-05-23T02:20:03.000Z": "In accordance with the eighth supplemental emergency proclamation, the counties of O'ahu, Maui and Kaua'i are allowing medium-risk businesses and operations to re-open. Details: OFFICE OF THE GOVERNOR - News Release - Counties start re-opening medium-risk businesses, operations HONOLULU - In accordance with Gov. David Ige's eighth supplemental emergency proclamation, the counties of O'ahu, Maui and Kaua'i are allowing medium-risk businesses and operations to re-open. Kaua'i... governor.hawaii.gov", "2020-05-22T16:21:51.000Z": "If you are going out for #MemorialDayWeekend , stay safe and follow @CDCgov guidelines: Avoid large groups of people. If you leave your home, wear a face covering. Avoid using public transit or ride-sharing apps.\n\nLearn more: http:// cdc.gov/coronavirus/20 19-ncov/prevent-getting-sick/social-distancing.html ", "2020-05-23T00:43:12.000Z": "Highlights from our weekly staff e-newsletter for this week include summer learning opportunities, details about mobile learning labs in the works & other important updates and resources.\n\nRead more here https:// bit.ly/36uIETN  #HI4PublicEd", "2020-05-22T23:41:48.000Z": "An accurate and complete census helps businesses, community leaders and elected officials make informed decisions every day.  Respond to the census now at English", "2020-05-23T00:30:34.000Z": "At this time, there are no drugs for the treatment or prevention of #COVID19 . If you or someone you know has taken a non-approved drug or a disinfectant and feel sick, call 911, the Hawai'i Regional Poison Center (800-222-1222) or seek immediate medical care.", "2020-05-22T21:37:30.000Z": "Flags will be flown at half-staff immediately until sunset on 5/24This action is a mark of respect for the victims­­­­ of #COVID19 In addition, flags will be flown at half-staff on #MemorialDay2020 until noon. OFFICE OF THE GOVERNOR - FLAG ORDERS: Governor Ige orders flags at half-staff on Memorial Day, and... HONOLULU - At the direction of the President of the United States, Gov. David Ige has ordered that the United States flag and the Hawai'i state flag will be flown at half-staff at the State Capitol... governor.hawaii.gov", "2020-05-21T23:15:37.000Z": "May 21, 2020 News Conference: #COVID19 Update Governor David Ige on Facebook Watch May 21 2020 News Conference: COVID-19 Update - I am joined by Lieutenant Governor Josh Green who will provide an update on our healthcare capacity and... facebook.com", "2020-05-19T19:07:24.000Z": "Pandemic Emergency Unemployment Compensation (13-week extension) now available through https:// huiclaims.hawaii.gov/#/", "2020-05-21T21:48:58.000Z": "(808) 762-5752 is UI trying to work on your claim so therefore answer - and don't forget to set up or clear your voicemail! Quote Tweet DLIR @HI_DLIR Answer if this number calls it is UI trying to fix your routing or account information: (808)-762-5752\n\nPhone pic by Jonathan Mauer - Own work, CC BY-SA 4.0, https:// commons.wikimedia.org/w/index.php?cu rid=50534668 ", "2020-05-21T19:58:52.000Z": "Guest speakers:\n Lt. Governor Josh Green\n Dr. Bruce Anderson, Director, Hawai'i Dept. of Health\n Tim Sakahara, Public Information Officer, Department of Transportation", "2020-05-20T21:46:02.000Z": "Your #UHohana will help to expand #COVID19 testing capacity on #Oahu as part of a new partnership with @HonoluluGov   https:// bit.ly/2ZjyYKp  @uhmanoa  @uhmed  @algoriphagus", "2020-05-20T03:00:38.000Z": "Willie K was a unique talent whose huge voice effortlessly ranged from Hawaiian music and the blues to opera - all in one performance. Recognized locally and nationally, his songs touched our hearts. Dawn and I extend our deepest condolences to his family and friends.", "2020-05-19T22:15:15.000Z": "HIDOE today announced its summer programming will be delivered through multiple platforms including in-person and distance learning as well as mobile support for students and families. Read the full release here: https:// bit.ly/3g88120  #HI4PublicEd", "2020-05-19T21:59:29.000Z": "Help stop the #3 cause of death in Hawaii. Hunt for ways to recognize strokes in your household. Do this socially distanced scavenger hunt and become a Brain Champion. Start your hunt here: http:// health.hawaii.gov/NoStrokes  @American_Heart  #StrokeMonth  #StrokeAwareness  #HealthyWeLiveHawaii", "2020-05-19T22:50:05.000Z": "Practice social distancing by putting space between yourself & others. Continue to practice healthy habits, like washing your hands for at least 20 seconds & staying home if you're sick, to help slow the spread of #COVID19 . Learn more: http:// cdc.gov/coronavirus", "2020-05-19T20:56:22.000Z": "The #HawaiiDepartmentofHumanServices continues to process Medicaid applications in a timely manner. Here's a video on how to apply for Medicaid benefits from Meredith Nichols, Asst Administrator Med-QUEST Division. For more info go to http:// humanservices.hawaii.gov . #ohananuistrong", "2020-05-19T03:05:42.000Z": "It is important to act with care by maintaining physical distancing and safe practices throughout the re-opening, to protect the health and safety of the people of Hawai'i. I am committed to making decisions based on data, science, and best practices.", "2020-05-19T03:05:41.000Z": "Today I signed the 8th supplemental emergency proclamation ( https:// bit.ly/2ThxZqg ), extending the 14-day quarantine for travelers arriving in the State of Hawai'i, as well as for inter-island travelers through June 30.", "2020-05-19T01:13:54.000Z": "May 18, 2020 News Conference: #COVID19 Update - Announcing the 8th Emergency Proclamation and a strategy to reopen and reshape Hawai'i's economy.\n\nTo follow the Beyond Recovery: Reopening Hawai'i's PPT presentation, click here: https:// governor.hawaii.gov/wp-content/upl oads/2020/05/EMBARGOED_Media_Gov_Reopening-Presentation-Slide-Deck_18-May-2020-1208-PM.pdf  Governor David Ige on Facebook Watch May 18, 2020 News Conference: COVID-19 Update: Announcing the 8th Emergency Proclamation and a strategy to reopen and reshape Hawai'i's economy. To... facebook.com", "2020-05-18T21:07:38.000Z": "Guest speakers:\n Kenneth Hara, Director, Hawai'i Emergency Management Agency\n Alan Oshima, Economic Recovery and Resiliency Navigator\n Clare Connors, Attorney General\n Dr. Bruce Anderson, Director, Hawai'I State Dept. of Health", "2020-05-16T02:48:56.000Z": "Congratulations Class of 2020! Your class will hold a place in history for generations to come. Congratulations to the Class of 2020! Congratulations Class of 2020! facebook.com", "2020-05-15T02:59:32.000Z": "Flags will be flown at half-staff on May 15, 2020 in honor of Peace Officers Memorial Day. Governor's Office - Flag Order - Gov. Ige orders flags at half-staff for Peace Officers Memorial... HONOLULU - At the direction of the President of the United States, Gov. David Ige has ordered that the United States flag and the Hawai'i state flag will be flown at half-staff at the State Capitol... governor.hawaii.gov", "2020-05-14T02:05:02.000Z": "RT @Ulupono : It's easy to support local farms today! Check out @farmlinkhawaii to see how you can support your local farms and farmers.", "2020-05-14T02:02:54.000Z": "Dr. Park & Dr. Desmond will join me tomorrow to discuss the latest on #HawaiiCOVID19 testing capabilities. We'll also discuss the state's effort to step up contact tracing. Tune in at http:// facebook.com/governordavidige ", "2020-05-14T01:25:01.000Z": "RT @UHawaiiNews : Virtual job fair scheduled for @uhcc  #Oahu campuses - Scheduled for May 18 - Thursday, May 21. It is open to all students, faculty and staff from @HonoluluCC , @uhkapiolani , @LeewardCC and @wcchawaii   https:// bit.ly/3dG2xJP", "2020-05-14T00:50:02.000Z": "RT @EnergyHawaiiGov : Hawaii census data helps to determine where to build new schools, roads, health care facilities, child-care and senior centers, shopping malls, and homes. #everyonecounts  https:// census.hawaii.gov/census_2020/", "2020-05-14T00:40:18.000Z": "May 13, 2020 News Conference: #COVID19 update on health care system capacity and the State's plans for testing and contact tracing.\n- @LtGovJoshGreen - @HIgov_Health Dr. Anderson \n- @UHawaiiNews David Lassner Governor David Ige on Facebook Watch May 13, 2020 News Conference: COVID-19 update. Joining me are Lieutenant Governor Josh Green with an update on our health care system capacity, Dr.... facebook.com", "2020-05-13T22:10:04.000Z": "RT @hnldts : We're reminding everyone that masks are required to ride #TheBus and #TheHandiVan and you will not be allowed on without one. Masks are not entry fees to be removed once seated.\n\nMASKS ARE REQUIRED AT ALL TIMES WHILE ONBOARD.", "2020-05-13T21:55:04.000Z": "RT @HI_DLIR : ONLINE ONLY! To help your family, friends, and neighbors to file weekly or biweekly unemployment claim certifications we kindly request that you file your weekly/biweekly certification ONLINE at https:// huiclaims.hawaii.gov/#/ Quote Tweet DLIR @HI_DLIR Starting today! twitter.com/HI_DLIR/status", "2020-05-13T19:15:10.000Z": "ONLINE ONLY! To help your family, friends, and neighbors to file weekly or biweekly unemployment claim certifications we kindly request that you file your weekly/biweekly certification ONLINE at https:// huiclaims.hawaii.gov/#/ Quote Tweet DLIR @HI_DLIR Starting today! twitter.com/HI_DLIR/status", "2020-05-13T21:29:37.000Z": "Mental Health: The \"Don't Infect, Please Protect\" campaign gives you simple tips to stop the spread of COVID-19 and helps you understand how to keep you and your community healthy. Mental Health The \"Don't Infect, Please Protect\" campaign gives you simple tips to stop the spread of COVID-19 and helps you understand how to keep you and your... facebook.com", "2020-05-13T21:11:11.000Z": "WATCH at http:// facebook.com/governordavidige  Guest speakers:\n Lt. Governor Josh Green \n Dr. Bruce Anderson, Director, Hawai'i Dept. of Health \n David Lassner, President, University of Hawai'i to discuss UH role in contact tracing training program", "2020-05-12T23:38:25.000Z": "#DHHL", "2020-05-13T00:38:15.000Z": "The Department of Human Services continues to process SNAP & Financial applications. Here's a video on how to apply for SNAP/Financial Benefits. For more information go to http:// humanservices.hawaii.gov . #ohananuistrong  #hawaiidepartmentofhumanservices", "2020-05-11T20:10:56.000Z": "#Hawaii can boast the largest, integrated #SIREN system in the nation! Monthly testing ensures a sound method to help #protect the people of the #aloha state. #beprepared  #HIEMA", "2020-05-12T00:41:14.000Z": "May 11, 2020 News Conference #COVID19 update to discuss details of the rental relief program for eligible Native Hawaiian families both on and off Hawaiian Home Lands. Governor David Ige on Facebook Watch May 11, 2020 News Conference: COVID-19 Update. Joining me are William Aila, Chairman of the Department of Hawaiian Home Lands and Norm Baker, Interim... facebook.com", "2020-05-11T21:09:45.000Z": "Guest speakers:\n William Ailā, Jr., Chair, Department of Hawaiian Home Lands\n Norm Baker, interim AUW President and CEO  \n\nWatch at: http:// facebook.com/governordavidige ", "2020-05-11T20:32:20.000Z": "Live now with @ryankaleitsuji and @yunjid on #COVID19 Care Conversation: https:// m.facebook.com/story.php?stor y_fbid=1666416023533783&id=387637784744953 ", "2020-05-11T19:51:18.000Z": "Starting today, DLIR will be taking calls from those whose last name begins with the letters A - G. If you are part of this group, you can call unemployment services to receive assistance on your UI certification claims. #hawaiicovid19 Quote Tweet Governor David Ige @GovHawaii Starting 5/11, we're going to manage the high volume by taking certification filings by the first letter of your LAST NAME. I assure you that my administration will continue to support DLIR to ensure that we get all of your unemployment benefits to you. Mahalo for your patience.", "2020-05-11T18:30:12.000Z": "Graduation season kicks off this week with @Campbell_Hawaii , @mauihighsabers and @MililaniTrojans hosting their celebrations. @HawaiiFive0CBS star Alex O'Loughlin is the next celebrity who would like to share a special congratulations to the class of 2020! #HI4PublicEd", "2020-05-11T19:02:13.000Z": "Financial and emotional stresses ripple through homes as #COVID19 lockdown orders continue - @CTAHRNews ' Center on the Family offers tips for parents during the extended stay-at-home order. More  https:// bit.ly/2xKY7lS  #UHinTheCommunity", "2020-05-11T18:45:03.000Z": "UPCOMING FACEBOOK LIVE:\n\nGot questions for @GovHawaii ? Join us on the @StarAdvertiser Facebook page at 10:30 a.m. today for a live Q&A with Ige who will be taking questions on the COVID-19 Care Conversation: https:// 808ne.ws/2oJbnza  #hinews  #hawaii  #staradvertiser", "2020-05-10T20:00:18.000Z": "Happy Mother's Day to my wife Dawn and to all the lovely moms out there. \n\nAnd to my mom: thinking of you with love today and always. #HappyMothersDay", "2020-05-09T00:40:02.000Z": "RT @dlnr : With today's announcement of the reopening of select DLNR State Parks, park managers & aquatic biologists are reminding people to be respectful of the places we share with Hawai'i's treasured marine creatures. http:// ow.ly/i27k50zAe3F", "2020-05-08T21:30:07.000Z": "RT @NIOSH : Are you a small business owner? @CDCgov 's new factsheet can help you prepare your business for disruption during the #COVID19 outbreak and protect your employees' health: https:// go.usa.gov/xvKUK", "2020-05-08T02:12:59.000Z": "The city's public transit system is getting a major boost from federal funds that will allow it for the next year to maintain services and withstand coronavirus-related challenges to ridership.", "2020-05-08T19:00:01.000Z": "Check out the County of Hawaii Covid-19 Resources website for a list of testing locations open this weekend. Click on the link for more info:  https://coronavirus-response-county-of- hawaii-hawaiicountygis.hub.arcgis.com/pages/health-a nd-wellness   #hawaiicovid19  #covidtesting  #stayhealthyandsafe  #civildefensehi", "2020-05-08T19:28:40.000Z": "Drive through testing will be conducted in South Kohala today at the Waimea District Park.  Hours are from 9:00 this morning until 1:00 this afternoon.  Know that all the preventative  policies are in place to keep Hawaii safe.  Thank you and have a great weekend.", "2020-05-08T19:38:53.000Z": "As a mark of respect for former state Rep. Dennis R. Yamada, I have ordered that the flags of the United States and State of Hawai'i shall be flown at half-staff to honor Yamada on the day of his memorial service. Governor's Office - Flag Order - Flags to fly at half-staff in honor of former Hawai'i lawmaker... (HONOLULU) - As a mark of respect for former state Rep. Dennis R. Yamada, Gov. David Ige has ordered that the flags of the United States and State of Hawai'i shall be flown at half-staff at all state... governor.hawaii.gov", "2020-05-08T18:31:00.000Z": "New Video: We all have a role to play to reduce and slow the spread of #COVID19 . Keeping 6 feet of physical distance between yourself and others is an essential step. Watch to learn more. https:// bit.ly/3aY0lfT .", "2020-05-08T19:17:15.000Z": "What relief is available for paying my mortgage? Can a landlord evict me if I don't pay my rent? What are my rights as a landlord? DCCA's Office of Consumer Protection is providing FAQs: Worried about rent and mortgage payments? What relief is available for paying my mortgage? Can a landlord evict me if I don't pay my rent? What are my rights as a landlord? DCCA's Office of Consumer Protection is providing answers to... governor.hawaii.gov", "2020-05-08T00:23:10.000Z": "Starting 5/11, we're going to manage the high volume by taking certification filings by the first letter of your LAST NAME. I assure you that my administration will continue to support DLIR to ensure that we get all of your unemployment benefits to you. Mahalo for your patience.", "2020-05-07T00:51:36.000Z": "WATCH LIVE NOW: May 6, 2020 News Conference: COVID-19 Update, joining Governor David Ige is Lieutenant Gov. Josh Green, and Suzanne Case, Chair, Department of Land and Natural Resources (State parks reopening). Governor David Ige on Facebook Watch May 6, 2020 News Conference: COVID-19 Update, joining Governor David Ige is Lieutenant Gov. Josh Green, and Suzanne Case, Chair, Department of Land and... facebook.com", "2020-05-07T00:07:10.000Z": "#COVID -19 update: Low risk safety checks can resume Friday, May 15. Details at Low risk safety checks can resume May 15 HONOLULU - In consideration of Governor Ige allowing the reopening of low risk businesses that take necessary precautions, the Hawai'i Department of Transportation (HDOT) is coordinating the reopen... hidot.hawaii.gov", "2020-05-06T21:16:52.000Z": ": http:// facebook.com/governordavidige  Guest speakers: \n Lieutenant Gov. Josh Green\n Suzanne Case, Chair, Hawaii DLNR (Department of Land and Natural Resources) #HawaiiCovid19", "2020-05-06T20:07:02.000Z": "It's natural to feel worried, stressed and anxious during these trying times. Hawai'i UTelehealth has made an online portal available for #Hawaii residents to speak to behavioral health professionals about these concerns and more  https:// bit.ly/3cakwrN  #UHinTheCommunity", "2020-05-06T18:19:22.000Z": "Farrington Aina Meeting Round 2 (1of3)\nWatch our video presentation at Farrington Highway Corridor Study: Virtual Community 'Āina Meeting... The Hawaii Department of Transportation (HDOT) Highways Division is conducting a study to determine the long term vision and management for the Farrington Hi... youtube.com", "2020-05-06T19:12:00.000Z": "#WellnessMatters : Mental health resources are available to provide compassion and support during this difficult time. Call 1 (800) 753-6879 or text ALOHA to 741741. #HawaiiCOVID19", "2020-05-06T19:08:28.000Z": "@DLNR : Marine wildlife benefitting from the absence of human interaction. With the reopening of select state parks, DLNR reminds people to be respectful of the places we share with Hawai'i's treasured marine creatures. More: DLNR News Release-Reopening of Select State Parks Prompts Respectful Viewing Reminders, May 6, 2020 Reopening of Select State Parks Prompts Respectful Viewing Reminders (Honolulu) - Hawaiian monk seals, green sea turtles and other marine animals that frequent our shores have largely had near-shore... governor.hawaii.gov", "2020-05-06T19:01:40.000Z": "via @dlnr : The DLNR Division of State Parks is re-opening select parks and monuments across the state with an emphasis on social distancing and exercise and continued restrictions on gatherings of any sort. More: DLNR News Release-Select State Parks Re-Opening, May 6, 2020 SELECT HAWAI'I STATE PARKS RE-OPENING FOR HIKING AND BEACH ACCESS BUT NOT GATHERINGS (Honolulu) - The DLNR Division of State Parks is re-opening select parks and monuments across the state with an... governor.hawaii.gov", "2020-05-06T18:14:23.000Z": "Photo caption: The green line is the U.S. case total; the pink is Hawai'i.\n\nHawai'i cont. to rank as one of the best-performing states in the country in dealing with #COVID19 . That's according to recent reports & data from Johns Hopkins University. More: https:// bit.ly/2A5HFxj", "2020-05-06T06:13:56.000Z": "#hawaiicovid19 : Today I signed a 7th Supplementary Emergency Proclamation that authorizes the first group of businesses to re-open. Businesses and operations can re-open starting May 7, 2020 at 12:01 a.m. Details: Governor's Office - News Release - Gov. Ige gives first round of businesses greenlight to re-open HONOLULU - Gov. Ige today signed a 7th Supplementary Emergency Proclamation that authorizes the first group of businesses to re-open since the COVID-19 pandemic forced the temporary closure of... governor.hawaii.gov", "2020-05-05T22:06:04.000Z": "Governor David Ige on Facebook Watch May 5, 2020 News Conference: COVID-19 Update, Announcing the signing of the 7th Supplemental Emergency Proclamation (https://bit.ly/2SHQBzc), announcing... facebook.com", "2020-05-05T21:44:37.000Z": "WATCH NOW: 5/4 News Conference: COVID-19 Update: announcing signing of 7th Supplemental Emergency Proclamation - phase 1 reopening of businesses and activities: https:// m.facebook.com/story.php?stor y_fbid=1382068175334527&id=387637784744953 ", "2020-05-05T19:06:40.000Z": "", "2020-05-04T21:10:53.000Z": "Guests speakers: \n David Lassner, President, University of Hawai'i \n Dr. Bruce Anderson, Director, Hawai'i Dept. of Health", "2020-05-04T20:36:54.000Z": "May 4 @ 10:30AM - Join me now: https:// m.facebook.com/story.php?stor y_fbid=1658802117628507&id=387637784744953 ", "2020-04-30T05:25:02.000Z": "If conditions change later this summer, we will reassess and respond appropriately.", "2020-04-30T05:25:01.000Z": "I'm pleased the Navy has agreed to postpone the #RIMPAC 2020 exercise and will conduct the at-sea-portion this year to help keep Hawai'i safe as we continue to respond to the #COVID19 pandemic. I'm working closely with Adm. Davidson to monitor the situation.", "2020-04-30T01:58:54.000Z": "PUA application portal is available at https:// pua.hawaii.gov/_/", "2020-04-30T01:58:25.000Z": "On 4/8, I appointed Alan Oshima to lead the Hawai'i's economic & community recovery & resiliency efforts. He'll be joining me tomorrow on #COVID19 Community Connection on Facebook #Live to provide the latest update on this effort. 4/30 at 10:15AM: http:// facebook.com/governordavidige ", "2020-04-30T00:41:15.000Z": "LIVE STREAM: Governor David Ige COVID-19 Update, April 29, 2:30 p.m. https:// mauinow.com/2020/04/29/liv e-stream-governor-david-ige-covid-19-update-april-29-230-p-m/?t=1588207250 ", "2020-04-29T21:05:03.000Z": "RT @HIgov_Health : Do you live with older adults or family members with medical conditions? Here are helpful tips to protect them from #COVID19 . https:// publichealthinsider.com/2020/04/20/whe n-grandparents-live-with-you-how-to-protect-older-adults-at-home-from-covid-19/   #HawaiiCOVID19 When grandparents live with you: How to protect older adults at home from COVID-19 - PUBLIC HEALTH... Living with multiple generations in the home has wonderful social benefits, and also requires extra steps to prevent exposing older family members to COVID-19. We offer tips for protecting vulnerable... publichealthinsider.com", "2020-04-29T21:04:52.000Z": "http:// facebook.com/governordavidige   Lt. Governor Josh Green \n Scott Murakami, Director, Department of Labor and Industrial Relations (unemployment assistance) \n Dr. Bruce Anderson, Director, Hawai'i Dept. of Health (contact tracing)", "2020-04-29T00:27:25.000Z": "Amidst ongoing stay-at-home orders due to the COVID-19 pandemic, many turn to social media to stay connected.  While there are many benefits of using social media, it's important to remember that scammers too, will try to benefit from the increased usage. http:// cca.hawaii.gov/sec/release-st ate-issues-warning-about-investment-schemes-circulating-on-social-media/ ", "2020-04-29T00:35:51.000Z": "The enhanced passenger verification process continues at Hawaii airports with positive results. A Washington man flew to #HNL without a reservation so he was sent back to Seattle last night. Passenger contact information and reservations are being verified upon landing in Hawaii.", "2020-04-29T17:44:22.000Z": "Social distancing is critical to fighting the spread of #COVID19 . Every face-to-face interaction is an opportunity for the coronavirus to spread https:// hawaiicovid19.com/resources/#mul tilingual-flyers   #HawaiiCOVID19  #StayHealthyStayHome", "2020-04-29T00:42:00.000Z": ". @GovHawaii on the conditions required to expand social and economic activity, and what the next phase might look like. Quote Tweet Governor David Ige @GovHawaii #LIVE now on @StarAdvertiser with @yunjid & @ryankaleitsuji on COVID-19 Care Conversation: http:// facebook.com/Staradvertiser  #hawaiicovid19", "2020-04-29T00:03:25.000Z": "Are you having trouble paying your bills, you're not alone. Check out some of the resources from @CFPB to help you manage your finances during these trying times. http:// ow.ly/gMvo50zrleO", "2020-04-28T21:50:03.000Z": "RT @UHawaiiNews : In this difficult time when students around the state find themselves learning from home, new resources created in #Hawaii are being made available to families and educators  https:// bit.ly/2JGeUsD  @uhmanoacoe  @uhkapiolani  @uhmanoa", "2020-04-28T00:48:57.000Z": "@oha_hawaii , @nhccoahu and Hawai'i State Dept. of Agriculture invite local farmers for a FREE webinar panel sharing COVID-19 relief resources\n\nJoin us on April 28th at 2pm HST\nRegister at https:// us02web.zoom.us/meeting/regist er/tZ0qde6upzItHtPosqFkg0dXHhV3RX3lVqp6?fbclid=IwAR2oG7TpOVqi49EqE9HcVhk1w_n0kOhed6zVIBBdBDTRgIbbxctRjhRayCI  For more info, visit http:// oha.org/covid19  #COVID19response", "2020-04-28T19:35:14.000Z": "OHA's $450,000 Kaiāulu Meals program is supporting 13 community-based service providers' efforts to distribute enough food for Native Hawaiian kūpuna https:// vimeo.com/408788537 For more info on COVID-19 relief resources, please visit http:// oha.org/covid19  #COVID19Response", "2020-04-28T20:07:11.000Z": "UH extends socially distanced operations through May 31 http:// go.hawaii.edu/f9A", "2020-04-28T01:09:01.000Z": "UH President David Lassner thanks #UHohana for #COVID19 response  https:// bit.ly/2VpbUX5", "2020-04-28T00:14:52.000Z": "CALLING ALL SMALL BUSINESS OWNERS: The first PPP funding of $249B for small business loans ran out in 14 days. Congress approved an additional $310B, & the SBA opened its portal today. It's first come, first served. Visit: https:// sba.gov .", "2020-04-27T22:54:48.000Z": "For residents of Oahu, the @HawaiiFoodBank is here to help you and your family. They now have an interactive map to help find a food assistance program near you. \n\nClick the link here to find out more information: http:// hawaiifoodbank.org/emergency-assi stance  . Emergency Food Assistance Click for the Emergency Food Assistance handouts:O'ahu Emergency Food Assistance hawaiifoodbank.org", "2020-04-27T20:40:34.000Z": "#LIVE now on @StarAdvertiser with @yunjid & @ryankaleitsuji on COVID-19 Care Conversation: http:// facebook.com/Staradvertiser  #hawaiicovid19", "2020-04-26T17:04:01.000Z": "#UHohana employees help tackle unemployment insurance claim backlog - The large-scale volunteer work started April 22 and will run through early May  https:// bit.ly/2xU7aAK", "2020-04-26T00:56:39.000Z": "Thanks to our residents, we are flattening the curve, saving lives, and avoiding a resurgence of this virus by not reopening prematurely. Read the full news release at: Governor's Office - News Release: Gov. Ige extends stay-at-home order across the state through May... Governor Ige extends stay-at-home order across the state through May 31 Mandatory 14-day quarantine for travelers, eviction moratorium also continue HONOLULU - Gov. David Ige signed a 6th supplemen... governor.hawaii.gov", "2020-04-26T00:56:38.000Z": "#LIVE : April 25, 2020: COVID-19 News Conference \nI signed a 6th supplementary emergency proclamation extending the stay-at-home order across the state through May 31. Governor David Ige on Facebook Watch April 25, 2020: COVID-19 News Conference facebook.com", "2020-04-25T21:10:26.000Z": "WATCH LIVE: http:// facebook.com/governordavidige ", "2020-04-22T23:27:59.000Z": "PLEASE DO NOT go to the Hawaii Convention Center for unemployment issues, the building is closed and secure from the public. Mahalo nui!", "2020-04-23T02:52:21.000Z": "and isolation center on O'ahu to help those who are sick and in need during this crisis. Scott Morishige and Edward Mersereau will join me tomorrow to provide more details on this program and provide information on how you can help. #HawaiiCovid19  http:// facebook.com/governordavidige ", "2020-04-23T02:52:20.000Z": "#COVID19 has affected every community across our state. Those experiencing homelessness are at greater risk because many have underlying medical conditions. My administration has been working with the Hawaii State Department of Health and partners to set up a temporary quarantine", "2020-04-22T02:40:21.000Z": "I know that many of you have lost your jobs due to #COVID19 & filing for unemployment has been difficult. With us tomorrow is director Scott Murakami to provide the latest update. Tune in at http:// facebook.com/governordavidige ", "2020-04-21T23:24:01.000Z": "#UHohana President David Lassner updates UH regents on #COVID19 impact - The updates include financial student concerns and planning for the future  https:// bit.ly/34Jdpn2", "2020-04-21T22:02:51.000Z": "Salesforce is partnering with Ureeka to offer eligible small businesses the opportunity to receive a $10,000 grant to help them through the COVID-19 outbreak. Hawaii's opportunity opens on April 27th and closes on May 4th. https:// buff.ly/2KkQXYb", "2020-04-21T22:37:46.000Z": "Schemes, Scams & Ploys! Con Artists are always looking to take advantage of you and your money. Learn the basics on how to protect yourself with this LifeSmarts presentation. #HawaiiLifeSmartsAtHome  http:// ow.ly/ZTNN50zkMfg", "2020-04-21T21:13:02.000Z": " #COVID19 is taking a toll on our families and many are wondering how they can afford to pay for college. @HawaiiP20 and @cochawaii are hosting a webinar on Wed., April 22 to answer questions regarding college admissions and affordability. Register now: https:// bit.ly/2V94qZj", "2020-04-21T21:53:01.000Z": "Frank De Lima reminds everyone about the simple things you can do to keep yourself & others healthy. Do like Frank does-practice good hygiene and social distancing. Remember to also take care of your mental health. https:// facebook.com/HawaiiDOH/vide os/519032288764540/   #HawaiiCOVID19  #StayHealthyStayHome", "2020-04-21T19:08:45.000Z": "4-21, 9:00am. The total number of people who tested positive for Hawaii Island remains at 63.  From this 35 have been cleared as recovered and the remaining 28 are quarantined at home and monitored.  Highly recommend wearing a face covering. http:// hawaiicounty.gov/active-alerts", "2020-04-21T18:00:24.000Z": "#Hawaii 's first $600 extra #unemployment payments should go out Wednesday #coronavirus  #COVID19  https://", "2020-04-21T17:56:01.000Z": "In an effort to help residents who live in HPHA housing, #UHohana students and faculty have launched a #COVID19 resource website that provides updates on HPHA initiatives, COVID-19 information and connects residents to assistance programs  https:// bit.ly/2VgG8MW", "2020-04-21T03:04:33.000Z": "Share these helpful tips with those who are at-risk or who care for someone at-risk. https:// hawaiicovid19.com/wp-content/upl oads/2020/03/Fact-Sheet-Kupuna_032420.pdf   #SharetheFacts  #HawaiiCOVID19", "2020-04-21T02:39:29.000Z": "GRAPH: #HawaiiCOVID19 epidemic curve. As you can see, the highest number of cases occurred in mid-march & we are seeing a downward trend. Thank you all for your efforts & your support of my mandates. I know it's been difficult, but the curve is flattening. Hawaii COVID-19 - Epidemic Curve Epidemic curve of confirmed cases by exposure group, Hawaii 2020 public.tableau.com", "2020-04-21T02:01:01.000Z": "Summer school at the 10 #UHohana campuses will be held online, allowing students to continue their academic careers while staying safe during the #COVID19 pandemic  https:// bit.ly/3dJONyK", "2020-04-20T22:02:03.000Z": "Guest speakers: \n Lt. Gov. Josh Green \n Alan Oshima, Economic Recovery and Resiliency Navigator to discuss the state's economic recovery efforts.\n Dr. Bruce Anderson, Director, Hawai'i Dept. of Health", "2020-04-18T02:24:49.000Z": "Today signed a fifth emergency supplementary proclamation that includes an eviction moratorium -- which prevents any eviction from a residential dwelling for failure to pay rent. OFFICE OF THE GOVERNOR - News Release - Governor Ige orders eviction moratorium Governor Ige orders eviction moratorium Enhanced social distancing also required HONOLULU - Gov. David Ige signed a fifth emergency supplementary proclamation that includes an eviction moratorium -... governor.hawaii.gov", "2020-04-17T22:05:02.000Z": "RT @uhmed : JABSOM & UH College of Social Sciences developed an online COVID-19 screening tool that can connect a user to a health care provider via telemedicine in minutes! https:// bit.ly/2Ve1U3O Visit http:// covidhawaii.info  #UHManoa  #JABSOM COVID Hawaii Info covidhawaii.info", "2020-04-17T21:25:02.000Z": "RT @HIgov_Health : This week's community bulletin highlights the Show Aloha Challenge: Taking Care of Those Who Take Care of Us https:// mailchi.mp/c18eff8f8bd4/c ovid-19-community-bulletin-issue-4398490 ", "2020-04-17T21:06:59.000Z": " http:// facebook.com/governordavidige   Guest speakers:\n Dr. Christina Kishimoto, @HIDOE808  Dr. Bruce Anderson, @HIgov_Health", "2020-04-17T17:05:23.000Z": "Yes. Hawaii's stay-at-home orders don't preclude you from going outside for exercise or fresh air. While city parks and beaches are closed, you can go for a nature walk or hike to stay active and unwind while maintaining physical distance from others. #HawaiiCOVID19", "2020-04-17T17:57:06.000Z": "Scammers pray on our fears. Be wary of #COVID19 scams. https:// tinyurl.com/COVID19-Scam-A lerts   @MayorKirkHNL  @HonoluluGov  @Hawaii_EMA  @FTC", "2020-04-17T19:47:16.000Z": "#HawaiiCOVID19 : Are you an essential worker experiencing a challenge finding childcare? PATCH is here to help. Here is a list of DHS Licensed Centers and Registered Family Child Care providers in your Island area: https:// bit.ly/2VjWG6W .", "2020-04-17T05:15:02.000Z": "RT @EnergyHawaiiGov : The Hawaii Green Business Program shares COVID-19 tips and resources at https:// greenbusiness.hawaii.gov  https:// pic.twitter.com/rjOy1tUarX Hawaii Green Business Program State of Hawaii greenbusiness.hawaii.gov", "2020-04-17T03:15:03.000Z": "RT @Hawaii_EMA : This site allows health care professionals to register as a responder willing to provide services during a disaster or public health emergency. https:// nlk.doh.hawaii.gov", "2020-04-16T20:28:34.000Z": "DLIR has an open line of credit to the Treasury, as long as they keep printing we keep paying unemployment benefits!", "2020-04-16T20:22:29.000Z": "Here are some helpful tips for those of you with small children at home. #stayhomestaysafe", "2020-04-16T19:34:15.000Z": "Cloth face coverings are important to wear in public, and should be used with physical distancing to slow the spread of the virus. There are exceptions for young children or anyone who has trouble breathing. #HawaiiCOVID19", "2020-04-17T00:22:10.000Z": "Our 2:30PM news conference will be starting a few minutes late. Mahalo.", "2020-04-16T15:12:00.000Z": "Do you think you may have #COVID19 ? Monitor your symptoms and call ahead before visiting your doctor. Most people who get COVID-19 can take care of themselves at home. Take precautions to protect yourself and others around you. See more: https:// bit.ly/2wf7sS7 .", "2020-04-16T22:04:01.000Z": " Lieutenant Governor Josh Green\n Matthew Koenig, MD, Medical Director, Telemedicine, The Queen's Medical Center\n Judy Mohr Peterson, PhD, Med-QUEST Administrator and Hawaii State Medicaid Director, Hawaii DHS", "2020-04-16T19:50:03.000Z": "RT @CDCgov : Avoid shopping for food & other essentials in-person if you're not feeling well. Order food & other items online for home delivery or curbside pickup. For more tips during #COVID19 visit: https:// bit.ly/34ucuqJ .", "2020-04-16T19:10:08.000Z": "\"Dawn and I join the community in mourning the loss of former Rep. Yamada. We thank him for the years he dedicated to proudly serving the people of Kaua'i and our state,\" said Gov. Ige. OFFICE OF THE GOVERNOR - News Release - Governor Ige, Senate President Kouchi express condolences... HONOLULU - Gov. David Ige and Sen. President Ronald D. Kouchi offered their heartfelt condolences to the family and loved ones of former State Rep. Dennis R. Yamada, who died on Sunday, April 12,... governor.hawaii.gov", "2020-04-16T18:04:51.000Z": "Take care of yourself and stay #HealthyAtHome : Ensure you stay hydrated Eat a balanced diet Rest well #COVID19  #coronavirus", "2020-04-16T18:03:16.000Z": "Hawai'i National Guard Increasing Personnel to 1,200 for COVID-19 Response https:// mauinow.com/2020/04/16/haw aii-national-guard-increasing-personnel-to-1200-for-covid-19-response/?t=1587060196 ", "2020-04-16T04:27:20.000Z": "His job oversees disease prevention and containment, healthcare and medical response support, environmental health and safety response, medical shelters, mass patient movement and more.\n\nIf you have questions, submit them below or tune in tomorrow to ask them live. #HawaiiCOVID19", "2020-04-16T04:27:19.000Z": "Dr. Hankins, a family physician & assistant professor at the @uhmed & Community Health, will join me tomorrow on Facebook live. He is the LEAD for the Emergency Support Function/ Public Health and Medical Services for COVID-19 for the @Hawaii_EMA .", "2020-04-16T02:27:04.000Z": "Attention healthcare professionals, Hawaii needs you! If you are not currently working in a clinical role, visit https:// nlk.doh.hawaii.gov and join the Hawaii Medical Reserve Corps. #HawaiiCOVID19", "2020-04-15T21:50:03.000Z": "RT @HawaiiHTA : During this time of change, our local farmers are still here for you! @GoFarmHawaii has a list of various farms statewide that are providing fresh produce w/ convenient pick-up, delivery & subscription options! : https:// gofarmhawaii.org/find-your-farm er/ ", "2020-04-15T21:38:32.000Z": "-Brig. Gen. Moses Kaoiwi Jr., Joint Task Force Commander,\nHawaii National Guard\n-Scott Murakami, Director, Dept. of Labor & Industrial Relations to discuss new procedures to speed unemployment insurance payments\n-Dr. Bruce Anderson, Director, @HIgov_Health", "2020-04-15T19:34:00.000Z": "Wearing a cloth face covering CORRECTLY can help prevent the spread of #COVID19 to others. When you go out on essential trips, follow these \"do's\". If you have a child, remember those under age 2 should not wear a face covering. See https:// bit.ly/2R9av5m .", "2020-04-15T18:35:12.000Z": "Staying home can be difficult but it's important to keep it up. Try these tips from @CDCgov : Meditate and practice deep breathing. Take breaks from the news. Do something you enjoy! Get some regular exercise and plenty of sleep. \n\nMore: http:// cdc.gov/coronavirus/20 19-ncov/daily-life-coping ", "2020-04-15T20:20:06.000Z": "RT @CDCgov : Did you know that those with a history of heart disease are at higher risk for getting seriously ill from #coronavirus ? Learn more at http:// coronavirus.gov . #COVID19", "2020-04-15T01:56:27.000Z": "Watch the FULL Webinar: COVID-19 Assistance for Native Hawaiian Small Businesses & Non-Profits at https:// vimeo.com/407785018 Please visit http:// oha.org/webinar for copies of the Power Point slides and documents shared during the webinar. #hookahuawaiwai  #COVID19Response", "2020-04-15T17:31:23.000Z": "Frank De Lima reminds us of the importance of staying home as much as possible. But social isolation doesn't have to be isolating. Stay safe but stay connected. How have you shared aloha with kupuna and others who may be alone? https:// facebook.com/HawaiiDOH/vide os/671770756982900/   #StayHealthyStaySafe", "2020-04-15T19:03:06.000Z": "There's still time to participate in #Census2020 ! Learn more at http:// hawaiicounts.org or https:// my2020census.gov  #HawaiiCounts Quote Tweet HawaiiCounts @HawaiiCounts Census data will influence highway planning and construction, as well as grants Hawaii receives for buses, the rail, and other public transit systems.  #HawaiiCounts  #Census2020", "2020-04-15T01:10:31.000Z": "Are you a retiree or student with healthcare skills? Sign up for the Medical Reserve Corps. You could be called up if needed! http:// hah.org/wp-content/upl oads/2020/04/HAH_MRC-Recruitment-Press-Release_FINAL.pdf ", "2020-04-15T00:59:52.000Z": "April 14, 2020: #COVID19 News Conference Governor David Ige on Facebook Watch April 14, 2020: COVID-19 Update. Guest speakers: Lt. Governor Josh Green Dr. Bruce Anderson, Director DOH Hilton Raethel, President & CEO, Healthcare... facebook.com", "2020-04-14T20:12:59.000Z": "Hawaii Bankers Association says local lenders have secured approval for $1.6 billion in @SBAgov Paycheck Protection Program loans to local businesses. https:// cpb.bank/resources/2020 /april/hawaii-banks-secure-16-billion-for-more-than-7-500-local-businesses-through-sba-paycheck-protection-program   #COVID19", "2020-04-14T20:19:16.000Z": "Hawaiian Education resources - including a COVID-19 support page - are now available via a resource hub from HIDOE's Office of Hawaiian Education https:// bit.ly/OHEResourceHub  #HI4PublicEd", "2020-04-14T21:24:16.000Z": "Watch at http:// facebook.com/governordavidige  Guest Speakers:\nLieutenant Governor Josh Green\nDr. Bruce Anderson, Director, Hawaii State Department of Health\nHilton Raethel, President & CEO, Healthcare Association of Hawaii #hawaiicovid19  #COVID19", "2020-04-14T19:26:55.000Z": "#LIVE today at 10:15AM  http:// facebook.com/governordavidige  Have questions about SNAP (food stamps), Med-QUEST, financial assistance programs or domestic violence resources? Tune in to ask your questions live!", "2020-04-14T01:33:02.000Z": "The respiratory care practitioner program at @uhkapiolani has 11 ventilators ready to loan to local healthcare organizations in anticipation of an increased need in the coming weeks  https:// bit.ly/2Xnw1aA  #UHinTheCommunity", "2020-04-14T00:34:32.000Z": "With the rise of #COVID19 related scams it is important for Investors to be to be safe online. Check out the following handout on some tips on how to protect yourself from Fraud in Social Networking. http:// ow.ly/Anca50zdbGg", "2020-04-14T02:25:02.000Z": "RT @EnergyHawaiiGov : Remember physical distancing . . .", "2020-04-14T00:47:54.000Z": "ICYMI | @GovHawaii David Ige joined the #COVID19 Care Conversation w/ @yunjid & @ryankaleitsuji to answer questions and discuss the latest on the coronavirus in Hawaii.  http:// bit.ly/2xcOpEH   https:// facebook.com/staradvertiser /videos/256165069109626/ ", "2020-04-13T22:10:03.000Z": "RT @HISecurities : A reminder from the folks at @FTC please heed the #IRS warning: Stay vigilant to coronavirus-related scams, especially schemes tied to economic impact payments. Learn more at https:// go.usa.gov/xvrf7 . #COVIDreliefIRS  #COVID19", "2020-04-13T21:39:50.000Z": "Questions and answers for those who have already filed for unemployment insurance (UI) due to coronavirus (COVID-19): COVID-19 Post-Filing Information The below are questions and answers for those who have already filed for unemployment insurance (UI) due to coronavirus (COVID-19).  The Department of Labor and Industrial Relations (DLIR) will do... labor.hawaii.gov", "2020-04-13T21:00:13.000Z": "Growing evidence suggests #COVID19 can spread before people show symptoms (pre-symptomatic) and from people who have #coronavirus but never show symptoms (asymptomatic). \nCloth face coverings help prevent spread of COVID-19 in these situations.\nSee Q&A: https:// bit.ly/34cFym6 .", "2020-04-13T21:00:00.000Z": "For those recovering from #COVID19 , make sure you can check off these boxes before stopping home isolation.", "2020-04-13T20:47:11.000Z": "HAPPENING NOW: #COVID19 Care Conversation with @ryankaleitsuji and @yunjid on @StarAdvertiser : https:// m.facebook.com/story.php?stor y_fbid=1635488019959917&id=387637784744953 ", "2020-04-13T20:30:06.000Z": "RT @uhmed : New medical device allows one ventilator to help four patients at once New medical device allows one ventilator to help four patients at once Most of the material used to make the splitter can be found in Hawaii kitv.com", "2020-04-13T02:52:03.000Z": "A big thanks to the @hiema team and state emergency support function partners that continue to support #covid19 efforts in aloha - even on a beautiful Easter Sunday work is being accomplished to solve problems to make the community safer! #beprepared", "2020-04-13T18:19:01.000Z": "STUDENTS: Applications for the UH Urgent Student Relief Fund is now open for students at all 10 #UHohana campuses - The fund was created for students experiencing urgent financial distress created by the #COVID19 pandemic. Details: https:// bit.ly/2UzI1Ei", "2020-04-11T00:54:01.000Z": "April 10, 2020 #HawaiiCOVID19 News Conference: Governor David Ige on Facebook Watch April 10, 2020: COVID-19 News Conference. Speakers: Phyllis Shimabukuro-Geiser, Chairperson, Hawaii Dept. of Agriculture Rona Suzuki, Director, Hawaii... facebook.com", "2020-04-10T22:55:31.000Z": "#HawaiiCOVID19 : \nGuest Speakers:\n Dr. Bruce Anderson, Director, Hawai'i Dept. of Health\n Rona Suzuki, Director, Hawai'i Dept. of Taxation\n Phyllis Shimabukuro-Geiser, Chairperson, Hawaii Department of Agriculture", "2020-04-09T21:40:03.000Z": "RT @HIgov_Health : Reach out & stay connected. Regular social contact can be a lifeline for support, especially for those who live alone. Ask your ohana & friends how they're doing, & talk to people you trust about how you are feeling. #HawaiiCOVID19", "2020-04-09T19:40:02.000Z": "Most people who get #COVID19 will get better at home. If you are caring for someone who is sick:\n Have the person stay in a separate room and use a separate bathroom (if possible).\n Check how they are feeling but limit face-to-face contact.\nMore tips: https:// bit.ly/3a5uKZo .", "2020-04-08T23:56:03.000Z": "These times may be difficult but it's important to keep your butt off the beach! Go swim, surf, walk, or fish, but please don't hang around. What we do today will help #StopTheSpread . The sooner we do this, the sooner we can get back to normal! #COVID19  #OneOahu  @MayorKirkHNL", "2020-04-09T20:04:04.000Z": "With hotels and restaurants closed because of the coronavirus pandemic, farmers who need to get their produce to market are relying on the community to keep the supply chain running. Read more about how Hawaii Island is supporting local agriculture at https:// bit.ly/2JS1Osb . Keeping the supply chain running: Farmers need support to weather virus | West Hawaii Today With hotels and restaurants closed because of the coronavirus pandemic, farmers who need to get their produce to market are relying on the community to keep the supply chain running. westhawaiitoday.com", "2020-04-09T19:38:39.000Z": "POSTPONED: The Community Connection on Facebook live will be rescheduled to next week. Mahalo.", "2020-04-09T03:24:52.000Z": "Irene was a respected, central figure in U.S.-Japanese relations She worked tirelessly to develop leaders in the Japanese-American community in Hawai'i & beyond, & to strengthen ties between our two countries. She'll be missed. We send our deepest condolences to the Inouye 'ohana", "2020-04-09T01:54:09.000Z": ". @HawaiiDFI encourages the public to contact their financial institutions and government agencies to discuss opportunities for financial assistance during the COVID-19 pandemic. RELEASE: Banking and Financial Resources Available During COVID-19 DEPARTMENT OF COMMERCE AND CONSUMER AFFAIRS DIVISION OF FINANCIAL INSTITUTIONS DAVID Y. IGE GOVERNOR CATHERINE P. AWAKUNI COLÓN DIRECTOR IRIS K. IKEDA COMMISSIONER OF FINANCIAL INSTITUTIONS   FOR... cca.hawaii.gov", "2020-04-09T03:17:43.000Z": "I know there are people who are struggling & need help during #COVID19 . Pankaj Bhanot, director of DHS, will discuss benefits such as SNAP, Med-QUEST, financial assistance programs, domestic violence resources and more. Tune in and ask your questions live: http:// facebook.com/Governordavidi ge ", "2020-04-09T02:44:10.000Z": "The health and safety of Hawai'i's people will always remain my overriding priority. However, while working to protect our residents we also need to focus on stabilizing our economy.", "2020-04-09T02:44:09.000Z": "Today Iannounce the appointment of veteran business executive and community leader Alan M. Oshima to lead Hawai'i's efforts to develop and implement a plan for economic and community stabilization, recovery and resiliency following this crisis. #COVID19 OFFICE OF THE GOVERNOR - Governor Ige appoints Alan M. Oshima to lead Hawaii's economic and... HONOLULU - Gov. David Y. Ige, joined by Senate President Ron Kouchi and House Speaker Scott Saiki, issued a proclamation today announcing the appointment of veteran business executive and community... governor.hawaii.gov", "2020-04-08T21:19:06.000Z": "http:// facebook.com/governordavidige  Speakers: @HawaiiSenate : @RonKouchi Kouchi, Hawai'i State Senate President @hihousedems : Representative Scott Saiki, Hawai'i House Speaker @LtGovJoshGreen  @HIgov_Health : Dr. Bruce Anderson, Director, Hawaii DOH\nAlan Oshima #HawaiiCovid19  #covid19", "2020-04-08T03:36:19.000Z": "I spoke with ADM Davidson @INDOPACOM , and we're exploring RIMPAC options with our allies & partners to ensure the health & safety of the people of Hawai'i and our military forces. #HiGov", "2020-04-08T00:28:47.000Z": "CALLING SMALL BUSINESS OWNERS: Gwen Yamamoto Lau & Dennis Ling from DBEDT will join me on Community Connection on Facebook Live today to provide resources available to small business during these uncertain times. Ask your questions live at http:// facebook.com/governordavidige   #HawaiiCOVID19", "2020-04-07T01:16:39.000Z": "COVID-19 Unemployment Eligibility FAQS: COVID-19 Eligibility FAQs The below are questions and answers to eligibility scenarios for unemployment insurance (UI) due to coronavirus (COVID-19).  The Department of Labor and Industrial Relations (DLIR) will do all that... labor.hawaii.gov", "2020-04-07T19:50:03.000Z": "RT @CDCgov : Plan meals and have your food delivered, if possible. If you must go to the store during #COVID19 , avoid peak hours and try to send only one person to shop. More household tips: https:// bit.ly/2Qj4ing . #PhysicalDistance  #SocialDistancing", "2020-04-07T19:15:04.000Z": "RT @EnergyHawaiiGov : Hawaii Department of Health reminds everyone that face masks are no substitute of physical distancing. See news release: Hawai'i Department of Health reminds everyone that face masks are no substitute of physical... HONOLULU - Across the state, customers and staff at pharmacies, supermarkets, and take-out food establishments are wearing cloth masks and using physical distancing to prevent the spread of COVID-19.... health.hawaii.gov", "2020-04-07T18:37:02.000Z": "Growing evidence suggests #COVID19 can spread before people show symptoms (pre-symptomatic) and from people who have #coronavirus but never show symptoms (asymptomatic). \nCloth face coverings help prevent spread of COVID-19 in these situations.\nSee Q&A: https:// bit.ly/34cFym6 .", "2020-04-07T03:12:01.000Z": "In this difficult time when students around the state find themselves learning from home, new resources created in #Hawaii are being made available to families and educators  https:// bit.ly/2JGeUsD  @uhmanoacoe  @uhkapiolani  @uhmanoa  #UHinTheCommunity  #UHohana", "2020-04-06T18:18:02.000Z": "If you're feeling restless while you're staying at home, remember: Try to keep your regular routine & get enough sleep. Take deep breaths, stretch, or meditate. Exercise regularly.\n\nMore @CDCgov : https:// cdc.gov/coronavirus/20 19-ncov/daily-life-coping/managing-stress-anxiety.html ", "2020-04-06T21:35:47.000Z": "#LIVE @ 2:30PM: http:// facebook.com/GovernorDavidI ge  Speakers: @LtGovJoshGreen  @HIgov_Health : Dr. Bruce Anderson \nDept. of Human Services: Pankaj Bhanot - benefits for families and individuals #hawaiicovid19  #COVID19", "2020-04-06T19:59:01.000Z": "Reduce spread of #COVID19 . When in public, use a cloth face covering that Reaches above nose & below chin, completely covering mouth & nostrils Fits snugly against sides of your face Is made of multiple layers of cloth that you can breathe through https:// bit.ly/2Ravt42", "2020-04-06T19:50:46.000Z": "The @USNationalGuard did NOT make this announcement. This is FAKE NEWS. #COVID19  #coronavirus  #HawaiiCOVID19", "2020-04-05T20:25:08.000Z": "MASKOUT HAWAI'I: A campaign to encourage diy masks for all and to save medical PPE for health care workers so we can beat this pandemic together \\\\ video by Dr. Tokeshi & his clinical team in Family Medicine https:// youtu.be/N22HGmWMDnk  #JABSOM  #UHManoa  #MaskOutHawaii MASKOUT - A Universal Mask Campaign A universal mask campaign intended to reallocate medical-grade PPE to medical personnel on the frontlines of the COVID-19 pandemic, while encouraging widespr... youtube.com", "2020-04-05T21:19:01.000Z": "STUDENTS: Applications for the UH Urgent Student Relief Fund is now open for students at all 10 #UHohana campuses - The fund was created for students experiencing urgent financial distress created by the #COVID19 pandemic. Details: https:// bit.ly/2UzI1Ei", "2020-04-06T08:10:32.000Z": "More schools to begin Grab-and-Go breakfast & lunch starting Mon 4/6 on the Big Island, Maui & Kauai. Six more schools will start by Thurs & five more next Mon 4/13. For locations, visit https:// bit.ly/2UsONM0  #HI4PublicEd  #PublicSchoolProud", "2020-04-04T18:35:02.000Z": "RT @HawaiiFloodPlan : A pandemic doesn't stop floods from happening.  Keep up to date with Hawaii Floodplain Management News.  SUBSCRIBE to http:// waihalana.org . Wai Halana All about Floodplain Management and Flood Insurance waihalana.hawaii.gov", "2020-04-04T05:35:02.000Z": "RT @UHAlumni :  @uhmanoacoe alum and @UHHilo  #psychology professor Bryan Kim shares tips for coping with #SocialDistancing   http:// hawaii.edu/news/2020/03/2 5/kims-covid-coping-guide/   #UHohana  #COVID19", "2020-04-04T00:20:06.000Z": "RT @CDCgov : HCPs: Using #telemedicine instead of face-to-face encounters for routine medical visits can help slow the spread of #COVID19 in communities. Learn more: https:// bit.ly/2JfhnKd .", "2020-04-03T21:24:01.000Z": "Guest speakers: @HIgov_Health : Dr. Bruce Anderson @HawaiiHTA : Chris Tatum @HealthcareHAH : Hilton Raethel @Hawaii_EMA : Kenneth Hara @NationalGuard : Brig. Gen. Moses Kaoiwi Jr. #HawaiiCOVID19  http:// hawaiicovid19.com", "2020-04-03T21:00:43.000Z": "RT @HIgov_Health : Read the Hawai'i Department of Health's weekly community bulletin highlighting Five Tips for Conquering COVID-19 Stress: https:// mailchi.mp/08dbd86880a7/c ovid-19-community-bulletin-issue-4377158   #HawaiiCovid19", "2020-04-03T20:35:06.000Z": "RT @Hawaii_EMA : Check the facts regarding rumors about the National Guard at http:// ngpa.us/8605", "2020-04-03T19:36:31.000Z": "Hawaii nonprofits!\nPlease register for Heather Piper's HCRC webinar TODAY to support non-profits through this COVID-19 disaster. SBA Hawaii's Jane Sawyer will also be in the webinar that starts at 11:00 am TODAY\n\nSign up at: https:// hcrchawaii.com/webinar", "2020-04-03T05:51:56.000Z": "Due to a confirmed COVID-19 case in the Moloka'i community, HIDOE will be suspending Grab-and-Go meal service at Molokai'i High. The confirmed case does not directly involve someone in the school community. #HINews", "2020-04-03T20:19:48.000Z": "Small Business Virtual Town Hall: Hear directly from state, federal, and community agencies on the changing business and economic landscape due to #COVID19 Hawaii: Mon., 4/6, 1-2:30PM\nPac Island: Tues., 4/7, 9-10:30AM\n\nMore: Small Business Virtual Town Hall eventbrite.com", "2020-04-03T20:00:55.000Z": "RT @Hawaii_EMA : FEMA information on COVID-19 http:// fema.gov/coronavirus  http:// fema.gov/covid-19-respo nse   https:// fema.gov/Coronavirus-Ru mor-Control ", "2020-04-03T09:02:17.000Z": "Joining the global fight - @uhmed researcher's team helps create vaccine for #COVID19   https:// hawaii.edu/news/2020/03/2 3/jabsom-scientist-covid-vaccine/   #UHinTheCommunity", "2020-04-03T14:49:14.000Z": "The #COVID19 pandemic may be stressful for people. Set yourself up for #mentalwellness by establishing healthy habits as we all do our part to #SlowTheSpread . https:// bit.ly/2UF3k7h  #Coronavirus", "2020-04-03T15:20:04.000Z": "To slow the spread of #COVID19 , stay at home except to get groceries, medications, or other essentials. Avoid outings you don't have to take. Visit the FAQs for more tips: https:// bit.ly/2UbVHEZ . #PhysicalDistance  #SocialDistancing", "2020-04-03T19:20:03.000Z": "RT @WHO : During #COVID19 people with #disability should put a plan in place to ensure continuation of the care and support they need, including considering increasing the pool of caregivers they can call upon  https:// bit.ly/33ZDtKo  #coronavirus", "2020-04-03T19:12:42.000Z": ". @SBAgov Paycheck Protection Program Application https:// home.treasury.gov/system/files/1 36/Paycheck-Protection-Program-Application-3-30-2020-v3.pdf ", "2020-04-03T01:32:31.000Z": "UH West O'ahu V.E.T.S. lab creates 3D-printed parts for protective equipment https:// westoahu.hawaii.edu/ekamakanihou/? p=12012 ", "2020-04-03T02:15:17.000Z": "Read the Hawai'i Department of Health's weekly community bulletin highlighting Five Tips for Conquering COVID-19 Stress: https:// mailchi.mp/08dbd86880a7/c ovid-19-community-bulletin-issue-4377158   #HawaiiCovid19", "2020-04-03T04:51:44.000Z": "Protect our drivers.\nProtect your fellow riders.\nAnd, protect YOURSELF. #COVID19  @MayorKirkHNL  @HonoluluGov  @Hawaii_EMA", "2020-04-03T19:01:31.000Z": "Applications open today for Small Business Loans.\nClick below for more information and to apply. #hawaiiCOVID19 Coronavirus Relief Options We're here to help you overcome the challenges created by this health crisis. We offer multiple funding options for those seeking relief. Read more below. sba.gov", "2020-04-03T18:45:07.000Z": "RT @EnergyHawaiiGov : For more information and FAQ's on the energy sector's response to the COVID-19 outbreak go to https:// energy.gov/ceser/articles /covid-19-energy-sector-response-efforts-and-frequently-asked-questions   @ENERGY  #COVID", "2020-04-03T02:54:18.000Z": "The @HawaiiBOE unanimously approved HIDOE's request to modify high school graduation requirements for the graduating c/o 2020. HIDOE can now finalize a graduation plan that recommends using Q3 grades to determine final course grades. \nMore: https:// bit.ly/2X8RWSL  #HI4PublicEd", "2020-04-03T03:00:38.000Z": "The SBA's application process opens on Friday, but the Hawaii banks are making their applications available ahead of time to give businesses a chance to get their documentation together. First Hawaiian Bank, others open COVID SBA online applications The SBA's application process opens on Friday, but the Hawaii banks are making their applications available ahead of time to give businesses a chance to get their documentation together. bizjournals.com", "2020-04-02T22:30:05.000Z": "Do you have a loved one in a nursing home or assisted living facility? Please protect them from #COVID19 . Instead of in-person visits, share phone or video calls. This is temporary and will protect those at higher risk of #COVID19 . Learn more: https:// cdc.gov/coronavirus", "2020-04-03T00:00:30.000Z": "RT @EnergyHawaiiGov : To find out about how the Energy Office is helping Hawaii's energy sector during the #COVID outbreak please visit our website http:// energy.hawaii.gov", "2020-04-02T22:34:44.000Z": "As we come together with expressions of sympathy and support - we must also remember to help each other, to protect your health and the health of loved ones and your community. Let's all do our part to get Hawai'i through this challenging time.\n\n--Governor David Y. Ige", "2020-04-02T22:34:43.000Z": "Today, our community received the tragic news of the passing of a second Hawai'i resident from the #COVID19 virus. Dawn and I express our deepest condolences to the victim's family and friends.", "2020-04-02T22:25:04.000Z": "RT @CDCgov : #Handwashing is one of the best ways to protect yourself and your family from getting sick. Learn when and how you should wash your hands to stay healthy: https:// go.usa.gov/xEnje . #COVID19 From CDC", "2020-04-02T21:40:00.000Z": "April is Tsunami Awareness Month.. Be prepared before a tsunami strikes, learn the facts, and help save lives. http:// ready.hawaii.gov  #tsunami  #Hawaii  #Oahu  #Maui  #Kauai  #Molokai  #Lanai  #Niihau  #Honolulu  #April  #BigIsland  #BePrepared  #HIEMA  #DoD", "2020-04-02T21:45:03.000Z": "RT @UHawaiiNews : We want to remind everyone to be on high alert for cyber threats and scams. Here's a list of current alerts: http:// go.hawaii.edu/Ekj  @ITSatUH", "2020-04-02T21:00:38.000Z": "RT @WHO : #COVID19 home care for people with suspected or confirmed #coronavirus : Stay at home Do not attend work, school or public places. Rest, drink plenty of fluids and eat nutritious food", "2020-04-02T01:28:06.000Z": "Hawaii and Pacific Island small businesses, don't miss this virtual town hall to find out what resources are available to you! Small Business Virtual Town Hall eventbrite.com", "2020-04-02T18:40:51.000Z": "Stay informed with the latest COVID-19 related updates from the Department of Hawaiian Home Lands. #DHHL DHHL COVID-19 Updates Last updated on July 6, 2020. The Department of Hawaiian Home Lands is closely monitoring the latest developments regarding the COVID-19 virus and is in communication with the Governor's Offi dhhl.hawaii.gov", "2020-04-02T19:40:32.000Z": "DLIR phones temporarily down: HUI Password Reset: (833) 901-2272\nUI Phone Appointments: (833) 901-2275", "2020-04-02T20:23:56.000Z": "Major Disaster Declaration for Hawai'i Due to COVID-19 NEWS RELEASE: MAJOR DISASTER DECLARATION FOR HAWAI'I AS A RESULT OF COVID-19 For Immediate Release April 1, 2020 MAJOR DISASTER DECLARATION FOR HAWAI'I AS A RESULT OF COVID-19 HONOLULU - The President of the United States has declared a major disaster for the State of Hawai'i... dod.hawaii.gov", "2020-04-01T22:37:04.000Z": "Social distancing can help slow the spread of #COVID19 in affected communities. This means avoiding crowded places and maintaining distance from others. Learn more about staying safe and healthy at http:// cdc.gov/coronavirus . #FlattenTheCurve GIF", "2020-04-02T01:08:51.000Z": "In compliance to Govenor Iges proclamation the DCCA Kalakaua Building will be closed to the public through April 30. We are still OPEN for business and here to help remotely. For assistance please visit our website at http:// investing.hawaii.gov", "2020-04-02T02:20:03.000Z": "RT @InvestHawaiiGov : Hawaii Small Businesses and Nonprofits, please sign up for this Virtual Town Hall Meeting http:// smallbizvirtualtownhall.eventbrite.com on April 6 for the latest on support programs and services", "2020-04-02T01:19:51.000Z": "Today we celebrate Census Day, a day for us to rise up and be counted! After the last Census count, Hawai'i lost out on $2,600 per year, per person that didn't take the census.\n\nTake the census today at http:// 2020census.gov  #ea  #census  #HawaiiCounts", "2020-04-01T22:06:20.000Z": "Effective today, April 1, 2020, TheBus will operate on a State Holiday schedule Monday-Friday. For more info, visit http:// thebus.org . #hawaiigov", "2020-04-01T22:04:34.000Z": "As a reminder: All private sports clubs, like golf courses and tennis clubs, must close effective today, April 1. #covid19  #hawaii  #stayhomestaysafe", "2020-04-01T19:46:01.000Z": "Your #UHohana was once again recognized by the Association for the Accreditation of Human Research Protection Programs as a top research institution that follows rigorous standards for ethics, quality and protections while conducting human research. University of Hawaii reaccredited for human research protection | University of Hawai'i System News UH is recognized for ethics, quality and protections while conducting human research. hawaii.edu", "2020-04-02T01:43:08.000Z": "April 1, 2020 #COVID19 News Conference. Governor David Ige on Facebook Watch April 1, 2020: COVID-19 Press Conference Guests: Jane Sawyer district director of the Small Business Administration (SBA CARES Act-Paycheck Projection... facebook.com", "2020-04-01T18:13:30.000Z": "*VOLUNTEER NEEDED*\nThe Hawaii Emergency Management Agency is looking for a volunteer database developer who could help build a database to compile and report information on COVID-19 in Hawaii. Please contact Ellen at ellen.ng@htdc.org if you are able to help.\nMAHALO!", "2020-04-01T18:16:29.000Z": "Toll free numbers for unemployment assistance: 833-901-2272 for password resets and 833-901-2275 for appointments", "2020-04-01T18:30:00.000Z": "", "2020-04-01T18:36:27.000Z": "The following are web based scams, DO NOT FILE THERE: https:// unemploymentclaims.org/state/hawaii-u nemployment-extensions/  Hawaii Unemployment Extension - FileUnemployment.org Learn about the Hawaii Unemployment Extension details and whether you are eligible for an unemployment extension. Determine if they are still available. fileunemployment.org", "2020-04-01T08:27:12.000Z": "Mayor Michael Victorino provided guidance to Maui County residents on the inter-island travel quarantine policy issued by Gov. David Ige. Mayor Victorino provides guidance on inter-island travel for Maui County Mayor Michael Victorino provided guidance to Maui County residents on the inter-island travel quarantine policy issued by Gov. David Ige. The policy will go into effect statewide beginning April 1,... hawaiisenatemajority.com", "2020-04-01T21:55:06.000Z": "RT @fema : Please do not trust anyone who offers you financial help & then asks you for money or personal info. Federal & local disaster workers will not ask you for money or sign you up to receive a check. \n\nHelp prevent fraud: https:// fema.gov/coronavirus-ru mor-control ", "2020-04-01T21:42:45.000Z": "Rep, Dept. of Business ,Economic Development & Tourism or SBA (SBA CARES Act-Paycheck Projection Program)\n\nStephen Levins, Executive Director, Office of Consumer Protection (consumer scams)\n\nTim Sakahara, PIO, DOT (airport arrivals)\n\nDr. Bruce Anderson, DOG (latest COVID-19 no.)", "2020-04-01T02:37:13.000Z": "Here's an overview of all the things announced during today's press conference. Our focus as the City has been to push testing, quarantining, and social distancing. It takes all of us to flatten the curve.", "2020-04-01T19:02:18.000Z": "Monthly siren and Emergency Alert System TEST today at 11:45 am.", "2020-04-01T19:59:48.000Z": "The web portal for unemployment claims is currently not available, first time filers can use: https:// huiclaims2020.hawaii.gov/initial-claim", "2020-04-01T20:05:51.000Z": "Check out some tips from our partners at @FINRA to help you navigate through the uncertainties of #COVID -19. Stay safe! MAHALO FINRA for the Financial Peace of Mind Tips! http:// bit.ly/2W8SN5u", "2020-04-01T03:44:03.000Z": "Today I signed a 4th supplementary proclamation that requires all inter-island travelers to self-quarantine for 14 days. Details: https:// bit.ly/2UPcLjy . Order effective at 12:01AM, 4/1.\n\nTravelers will be required to fill out & sign: https:// bit.ly/2UzOejr  #hawaiicovid19", "2020-04-01T02:39:00.000Z": "Consumer Alert: Avoid COVID-19 Scams. \n\nCommon scams include cyber scams, telephone and text messaging scams, counterfeit product offers, bogus door to door tests and virus-related products, and phony charity donation requests. Consumer Alert: Avoid COVID-19 Scams DAVID Y. IGE GOVERNOR CLARE E. CONNORS ATTORNEY GENERAL STEPHEN H. LEVINS EXECUTIVE DIRECTOR, OFFICE OF CONSUMER PROTECTION For Immediate Release                                                    ... cca.hawaii.gov", "2020-04-01T02:27:06.000Z": "Today I signed a fourth supplementary proclamation that requires all residents and visitors traveling between any of the islands in the State of Hawai'i to self-quarantine for 14 days. #COVID19  #coronavirus  #hawaiicovid19 OFFICE OF THE GOVERNOR - News Release - Governor Ige issues emergency order requiring self-quaran... HONOLULU - Gov. David Ige today signed a fourth supplementary proclamation that requires all residents and visitors traveling between any of the islands in the State of Hawai'i to self-quarantine for... governor.hawaii.gov", "2020-03-31T22:08:51.000Z": "Top three reasons for delays in processing unemployment claims through the web form at https:// huiclaims2020.hawaii.gov/initial-claim", "2020-03-31T23:56:50.000Z": "Check out this week's episode of Talk Story as special guest Governor David Ige and Dr. K discuss HIDOE's Grab-and-Go school meal distribution program.  In the first week, nearly 16,000 breakfasts & 30,000 lunches were served for keiki at 40 school sites! https:// vimeo.com/402752771", "2020-04-01T01:09:50.000Z": "Governor David Ige on Facebook Watch March 31, 2020: COVID-19 News Conference facebook.com", "2020-03-31T21:23:00.000Z": "http:// facebook.com/GovernorDavidI ge   #Hawaii  #COVID19  #coronavirus", "2020-03-31T20:00:16.000Z": "Stay at home. Be a hero. #OneOahu  #StayAtHomeHero", "2020-03-31T21:19:01.000Z": "STUDENTS: Applications for the UH Urgent Student Relief Fund is now open for students at all 10 #UHohana campuses - The fund was created for students experiencing urgent financial distress created by the #COVID19 pandemic. Details: https:// bit.ly/2UzI1Ei", "2020-03-31T20:43:58.000Z": "Frank De Lima reminds everyone about the simple things you can do to keep yourself and others healthy. Practice good hygiene and social distancing and remember to take care of your well-being and mental health. #HawaiiCOVID19  #StayHealthyStayHome  https:// youtu.be/EqChkRQNZBA", "2020-03-31T00:05:02.000Z": "RT @HIDOE808 : In the first week of Grab-&-Go school meals, nearly 16k breakfasts & 30,000 lunches were served for keiki at 38 schools. More school sites start this week. Children must be present to receive meals. More at https:// bit.ly/2UsONM0 .", "2020-03-30T23:25:02.000Z": "RT @HISecurities : Parents, here are some tips you can share with your children on how to \"Be Safe Online\". Watch the Consumer Man video and take a look at the activities and vocabulary you can share in the lesson plan. #HawaiiLifeSmartsAtHome  #LifeSmarts The ConsumerMan Show: Online Safety Every month, NBC Consumerman Herb Weisbaum sits down with consumer experts to discuss issues important to teenagers. This month, the discussion is about stay... youtube.com", "2020-03-30T22:24:21.000Z": "March 30, 2020: #COVID19 News Conference at 2:30PM http:// facebook.com/GovernorDavidI ge   @HIgov_Health :  Dr. Bruce Anderson @DOTHawaii : Tim Sakahara, PIO #coronavirus", "2020-03-30T21:45:03.000Z": "RT @HISecurities : NEWS RELEASE: In response to the current COVID-19 pandemic. The DCCA Office of the Securities Commissioner has extended the deadline for franchise filings to April 30, 2020. http:// ow.ly/46CB50yZ93R", "2020-03-30T20:45:03.000Z": "RT @uhmanoa : Joining the global fight - @uhmed researcher's team helps create vaccine for #COVID19   https:// hawaii.edu/news/2020/03/2 3/jabsom-scientist-covid-vaccine/   #UHinTheCommunity From University of Hawaii at Manoa", "2020-03-30T20:05:03.000Z": "RT @CDCgov : Is your child or teen feeling stressed about #COVID19 ?  Talk to them and reassure them that they're safe. Learn other tips to support your child or teen. https:// bit.ly/39UVoEj", "2020-03-30T19:53:29.000Z": "JABSOM Researchers Team with Wuhan Hospital Medical Team on Study of Hypnotics to Treat COVID-19 JABSOM Researchers Team with Wuhan Hospital Medical Team on Study of Hypnotics to Treat COVID-19 -... By Paula Bender, JABSOM News Early this year, a researcher with the John A. Burns School of Medicine (JABSOM) collaborated with a colleague at the Tianyo jabsom.hawaii.edu", "2020-03-30T19:44:49.000Z": ". @HIgov_Health : is warning everyone about the hazards and dangers of using non-approved drugs for #COVID19 . Hawai'i Department of Health warns of potential adverse effects of using antimalaria drugs against... HONOLULU - The Hawai'i Department of Health (DOH) is warning everyone about the hazards and dangers of using non-approved drugs for COVID-19. Antimalarial drugs have been recently reported as... health.hawaii.gov", "2020-03-29T18:05:05.000Z": "Our kupuna are more susceptible to COVID-19. In response, organizations and individual donors created the \"Show Aloha Challenge.\"\n\nSeniros can sign up for the meal delivery service by calling St. Francis Healthcare System at (808) 547-6501. #mauliola  #health  #Covid19Response", "2020-03-29T21:26:43.000Z": "UH Researchers Need Your Help To Track COVID-19 In Hawai: Please complete the 10 minute survey that aims to trace the spread of coronavirus in Hawaii and share! Mahalo! #UHManoa i UH Researchers Need Your Help To Track COVID-19 In Hawaii They're looking to trace the spread of the disease in the community. civilbeat.org", "2020-03-30T16:40:09.000Z": "Grab-and-Go meal service at Lokelani Intermediate is canceled today due to a power outage. The school plans to start service tomorrow. #HINews", "2020-03-30T18:00:49.000Z": "KAUAI RESIDENTS - if your home was damaged by the recent March flooding (MARCH 2020), the information you provide may be used to determine or not whether certain federal aid is made avail to Kauai residents/and or state of Hawaii. https:// survey123.arcgis.com/share/96b5fb36 76f94718b472e33894d93a51 ", "2020-03-27T23:40:03.000Z": "RT @HIgov_Health : Questions about Coronavirus? Call 211 for info and resources. @AlohaUnitedWay is Hawaii's only statewide hotline partnering with the Department of Health. For more information visit http:// auw211.org  #HawaiiCOVID19", "2020-03-27T21:50:07.000Z": "RT @oha_hawaii : Good news from DHHL for Hawaiians on the homestead. #Covid19  #COVID19Response Quote Tweet dhhl @dhhl The Hawaiian Homes Commission approved an emergency postponement of mortgage payments for Department of Hawaiian Home Lands direct loans and loans assigned to DHHL during a special emergency meeting on Tuesday. #DHHL  https:// dhhl.hawaii.gov/2020/03/24/haw aiian-homes-commission-approves-dhhl-loan-deferral/ ", "2020-03-27T20:53:49.000Z": "We are navigating through uncharted waters. One video call included 100+ HIDOE leaders from across the state. Stay tuned as we share stories of innovation, resilience and camaraderie among teachers, students and staff in these unprecedented times. #HI4PublicEd  #PublicSchoolProud", "2020-03-27T20:35:03.000Z": "RT @Ulupono : Check out http:// foodagogo.org to see which restaurants are offering take-out, delivery & curbside pick-up. This listing is completely free to all restaurants & users to use to see what's open near you! #foodagogohi  #agfoundation", "2020-03-26T02:48:55.000Z": "If you have any questions related to the Stay At Home/Work From Home order, visit http:// oneoahu.org/faqs . You could also send an email to covidresponse@honolulu.gov, or call the city hotline at 768-CITY (2489).", "2020-03-27T20:05:10.000Z": "Respond online now. Use the Census ID from your invitation or provide your address when you start the questionnaire. Or, if you received a paper questionnaire, fill it out and mail it back (you can respond online if you prefer). Respond now at http:// 2020CENSUS.GOV . GIF", "2020-03-27T20:01:13.000Z": "Via @GovernorGordon : \"Grocery stores are an essential service that won't close. Keep in mind, #socialdistancing matters when shopping, too. Give your neighbors space and don't go out if you are sick. Actions like these help #slowthespread . #COVID19WY  \"", "2020-03-27T20:11:01.000Z": "A @UHHilo professor of psychology shares scientific reasons for social distancing and provides his top coping methods during the #COVID19 crisis. Coping with social distancing: a UH Hilo professor's how-to guide | University of Hawai'i System... Psychology Professor Bryan Kim shares 10 coping methods during the COVID-19 crisis. hawaii.edu", "2020-03-27T20:11:10.000Z": "Replying to @alohahomeguide  @HawaiiNewsNow  and 3 others Aloha, Lori! For the latest COVID-19 numbers you can visit http:// hawaiicovid19.com . It's updated daily at noon. Home hawaiicovid19.com", "2020-03-27T19:56:27.000Z": "https:// m.facebook.com/story.php?stor y_fbid=1617413741767345&id=387637784744953iki ", "2020-03-26T22:16:09.000Z": "MARCH 26, 2020: #COVID19 News Conference at 2:30PM http:// facebook.com/GovernorDavidI ge  Guest Speakers: @LtGovJoshGreen : Lieutenant Governor Josh Green @HIgov_Health :  Dr. Bruce Anderson @DOTHawaii : Tim Sakahara, PIO @CorpsHonolulu :  LTC Kathryn P. Sanborn, Commander #coronavirus  #Hawaii", "2020-03-26T03:04:26.000Z": "MARCH 25, 2020: https:// bit.ly/2UmHaXr  http:// hawaiicovid19.com  #COVID19  #CoronaVirus  #hawaii", "2020-03-26T02:46:56.000Z": "2/2 \nFor questions about the Governor's stay at home exemptions, email CovidExemption@hawaii.gov #HawaiiCOVID19", "2020-03-26T02:48:03.000Z": "1/2\nEffective Wednesday, 3/25 through Thursday, 4/30, Governor Ige's emergency proclamation requires everyone in the state to stay at home or in their place of residence. For a list of activities permitted outside the home, visit https:// hawaiicovid19.com/statewide-stay -at-home-order-effective-march-25-2020-through-april-30-2020   #HawaiiCOVID19", "2020-03-25T23:27:45.000Z": ". @GovHawaii with a reminder that social distancing protects us all.  Find Hawaii #coronavirus information at: https:// health.hawaii.gov or trusted resources for your state at https:// nga.org/coronavirus", "2020-03-25T22:43:29.000Z": "#COVID19News Conference at 3PM #Live : http:// facebook.com/GovernorDavidI ge   http:// hawaiicovid19.com  #coronavirus", "2020-03-25T19:30:37.000Z": "Scammers are texting customers to demand payment over false disconnection notices. We are not disconnecting service during this time and we will never contact you for payment through text. Learn more about fraud protection at http:// hwnelec.co/29fa50yUJ4Q . #StopScams Fraud Prevention Watch out for scams. Never provide personal, confidential or financial information to any unidentified individuals. If you have any doubt if a call, email or visit from someone claiming to represent... hawaiianelectric.com", "2020-03-25T19:34:21.000Z": "I cannot stress enough that we need everyone to please stay at home. These efforts are all aimed at social distancing, the single most effective way of controlling this deadly virus. STAY HOME to SAVE LIVES. Mahalo.\n\nWatch the full news conference: News Conference: Statewide order to stay at home, work from home to... COVID-19 News Conference: Statewide Stay-At-Home, Work-From-Home Mandate to fight COVID-19. Proclamation: https://bit.ly/2QDhN1i News release:... facebook.com"}