{"2020-07-30T16:45:35.000Z": "Thank you to @ISPHeadquarters and @IdahoTrucking for teaming up to make sure drivers are prepared and taken care of during this pandemic! Idaho Trucking Association hand out 250 masks courtesy of ISP The CEO of Idaho Truckers Association was passing out free masks to truck drivers Wednesday morning in North Lewiston. Truck drivers have been a crucial part of keeping us supplied during the... klewtv.com", "2020-07-29T00:07:35.000Z": "We need your help.  Fourteen intentional fires have been set along Hwy 95. Please share this news and if you have any information, report it to 1-877-75-ARSON. https:// loom.ly/1HReqEM", "2020-07-28T15:42:36.000Z": "Read more about the funds in @GovernorLittle 's July 24th press release: https:// gov.idaho.gov/pressrelease/a dditional-funds-to-cover-covid-19-testing-for-school-staff-more-supplies-to-open-schools-safely/?fbclid=IwAR35S_JQGkah_x4NTfZorLlDFkHaWb1jAzP-88E9XlXeWj2czeQECf8uKnk   #idahoCOVID19  #idedu  #idaho", "2020-07-28T02:40:07.000Z": "The Idaho State Department of Agriculture is warning people who get unsolicated package of seeds in the mail from China to not open them. Idaho among states receiving unsolicited seed packages from China - Local News 8 The Idaho State Department of Agriculture is warning people who get unsolicated package of seeds in the mail from China to not open them. localnews8.com", "2020-07-27T20:32:24.000Z": "I appreciate receiving your nomination, @GovernorLittle . I wear a mask to keep my family and friends safe and to show gratitude to our healthcare professionals and essential workers. Now, I nominate @GovSisolak to tell us why he wears a mask. #MaskUpAmerica  #MaskUpUtah Quote Tweet Brad Little @GovernorLittle 0:18 Thanks to @GovernorGordon of Wyoming for the nomination. I nominate @GovHerbert to share why he wears a mask in Utah! #MaskUpIdaho  #MaskUpAmerica  #OneIdaho  #MaskUpUtah", "2020-07-24T15:58:10.000Z": "Just a little and we're ready to open the slide closure on US-95 south of Riggins on Monday. \n\nMultiple viewings of the below video advised. \n\nMORE: https:// itd.idaho.gov/news/us95riggi nslide/ ", "2020-07-24T16:43:19.000Z": "These are uncertain, challenging times but we are far better off here than elsewhere right now, thanks to our focus on fiscal conservatism in state government. Office of the Governor gov.idaho.gov", "2020-07-24T16:09:07.000Z": "We're directing more resources to ensure schools have the supplies to open safely and so school staff can get COVID-19 tests. Office of the Governor gov.idaho.gov", "2020-07-23T18:16:30.000Z": "Golden Eagles mask up! #MaskUpIdaho  @CSIEagles", "2020-07-23T17:56:07.000Z": "When it comes to our public health response, our plans for school reopening, and our support for businesses across Idaho, we are focused on working closely with local officials and local leaders. #IdahoCOVID19 Office of the Governor gov.idaho.gov", "2020-07-23T00:18:48.000Z": "Dealing with COVID as Gov is captured in my fortune cookie from lunch today", "2020-07-22T19:08:38.000Z": "The Idaho Department of Labor has cleared the 42,000 unemployment insurance claims that had been pending as of June 6. #IdahoCOVID19 Quote Tweet Idaho Dept. of Labor @IdahoLabor Idaho Labor Clears Unemployment Pending Claims Backlog https:// idahoatwork.com/2020/07/22/ida ho-labor-clears-unemployment-pending-claims-backlog/ ", "2020-07-22T17:35:26.000Z": "Great working together with our Congressional Delegation @MikeCrapo  @SenatorRisch  @CongMikeSimpson and @GovernorLittle to protect the successful Enhanced Short-term Health Plans (ESTPs) Idaho built and improved from Trump Administration rule allowing short-term health plans.", "2020-07-22T17:34:00.000Z": "Keep it simple: \nMask. \nDistance. \nWash. #IdahoCOVID19  @one_idaho", "2020-07-22T14:40:50.000Z": "Idaho is showing that reducing unnecessary regulation and limiting government power are achievable goals! Smart regulatory reform is an achievable goal - Idaho has shown the Idaho eliminated or simplified 75 percent of its regulatory rules in one year, becoming the least-regulated state. thehill.com", "2020-07-21T15:29:32.000Z": "Idaho has, and continues to, make incredible contributions to space explorations. #SpudsAndSpace Quote Tweet Idaho National Lab @INL SPUDS AND SPACE When most people think of @NASA , #Idaho might not be the first state to come to mind. But, our contributions to space exploration date back to the early years of the space race and continue today. https:// fal.cn/39hzp  #nationallabs  #idahome  @EastIDNews", "2020-07-21T20:20:07.000Z": "Idahoans are strong. As ONE, we're even stronger. Take the pledge to keep others safe and keep our economy open.  http:// one.idaho.gov  #oneidaho  #maskupidaho  #staysafestayhealthy", "2020-07-21T17:56:22.000Z": "Starting soon at 12 pm MST: Q and A with @GovernorLittle and Director Jeppesen of @IDHW on #COVID19 . Join here: https:// states.aarp.org/idaho/coronavi rus-town-halls-with-governor-little-every-tuesday-at-noon-mdt   #idleg  #idaho  #idahoCovid19", "2020-07-21T14:26:11.000Z": "Join us today at 12 pm MST to get answers to your questions on the #Coronavirus with @GovernorLittle and Director Jeppesen of @IDHW . Listen and call in here: https:// nam05.safelinks.protection.outlook.com/?url=https%3A% 2F%2Fstates.aarp.org%2Fidaho%2Fcoronavirus-town-halls-with-governor-little-every-tuesday-at-noon-mdt&data=02%7C01%7Cbwynn%40aarp.org%7C7ecedee338034812427d08d82cdc620f%7Ca395e38b4b754e4493499a37de460a33%7C0%7C0%7C637308672339810087&sdata=3GLl9OtGHRGQt0CVk2d3nffKDgJRSsS6tGn%2FrjGEdpk%3D&reserved=0   #idleg  #idaho  #IdahoCOVID19 Coronavirus Town Halls with Governor Little STATEWIDE TELEPHONE TOWN HALLS WILL CONTINUE THROUGH NOVEMBER states.aarp.org", "2020-07-21T13:18:54.000Z": "NEW: Republican Governors Call On Congress To Provide Liability Protections To Health Workers, Educators, And Job Creators https:// rga.org/republican-gov ernors-call-congress-provide-liability-protections-health-workers-educators-job-creators/ ", "2020-07-20T20:38:58.000Z": "If you live in one of these Idaho cities or counties, you could see a 10-20% reduction in your property taxes this year due to our public safety initiative. Office of the Governor gov.idaho.gov", "2020-07-20T20:21:06.000Z": "Good news for Idaho families. Many Idahoans have been priced out of Affordable Care Act coverage, and the D.C. Circuit decision assures Idahoans access to additional, affordable coverage options that could make sense for their needs. Office of the Governor gov.idaho.gov", "2020-07-20T19:36:35.000Z": "Join @AARPIdaho tomorrow at Noon MT as @GovernorLittle and DHW Director Dave Jeppesen answer your COVID-19 questions live. Listen here: http:// spr.ly/6180GV7cK  #StaySafeStayHealthy  #MaskUpIdaho  #OneIdaho Coronavirus Town Halls with Governor Little STATEWIDE TELEPHONE TOWN HALLS WILL CONTINUE THROUGH NOVEMBER states.aarp.org", "2020-07-20T16:00:52.000Z": "Thanks to @GovernorGordon of Wyoming for the nomination. I nominate @GovHerbert to share why he wears a mask in Utah! #MaskUpIdaho  #MaskUpAmerica  #OneIdaho  #MaskUpUtah", "2020-07-18T20:23:29.000Z": "Flags are flown at half staff in Idaho in honor of the life and legacy of Representative John Lewis of Georgia. This serves as mark of respect for the memory and longstanding public service of Rep. Lewis. His contributions to our country will not be forgotten.", "2020-07-17T18:26:45.000Z": "Idahoans are getting back to work! Idaho has the third-lowest unemployment rates in the nation. We are getting our economy back on track! Quote Tweet Idaho Dept. of Labor @IdahoLabor Idaho Unemployment Falls to 5.6 Percent in June https:// idahoatwork.com/2020/07/17/ida ho-unemployment-falls-to-5-6-percent-in-june/ ", "2020-07-16T19:15:50.000Z": "Roundtable discussion with Senior @WhiteHouse officials, Governors @GovernorLittle  @GovDunleavy , and State Senate Leaders @paulgazelka  @SenatorRoth  @LarryObhof  @SenatorBerger on rolling back regulations to benefit ALL Americans.", "2020-07-16T21:14:10.000Z": "Today I met with with President Trump and administration officials on topics including cutting government red tape to support America's economic rebound, the availability of COVID-19 testing supplies for Idaho, Mountain Home Air Force Base, and others. Office of the Governor gov.idaho.gov", "2020-07-16T20:16:28.000Z": "LIVE: President Trump delivers remarks on rolling back regulations The White House @WhiteHouse LIVE: President Trump delivers remarks on rolling back regulations pscp.tv", "2020-07-16T19:48:01.000Z": "This afternoon, President @realDonaldTrump is giving remarks from the South Lawn on rolling back regulations to help all Americans!\n\nWatch LIVE at 4:00 p.m. ET: http://", "2020-07-16T18:11:51.000Z": ". @GovernorLittle and @GovDunleavy are at the White House today to talk about how President @realDonaldTrump 's historic deregulation actions have put more hard-earned money back in Americans' pockets.", "2020-07-16T17:10:13.000Z": "I spoke with reporters outside the West Wing about Idaho's historic red tape reduction and issues facing our state.", "2020-07-16T16:51:43.000Z": "I had a very productive meeting with the Air Force about strengthening the future of the Mountain Home Air Force Base!", "2020-07-16T15:28:27.000Z": "Today I met with leading infection disease expert Dr. Tammy Beckham of Health and Human Services in DC on testing capacity for COVID. HHS is sending us swabs today!", "2020-07-16T13:59:38.000Z": "Watch today at 2 pm MT as I join President Trump in an important announcement about cutting red tape and regulatory innovation. Streaming at https:// whitehouse.gov/live/  @WhiteHouse  @realDonaldTrump Live | The White House Tune in for LIVE White House events with President Donald J. Trump, Vice President Mike Pence, and other officials. whitehouse.gov", "2020-07-15T21:36:28.000Z": "Is your city or county on the list? The move is expected to provide up to $200 million in property tax relief, or a 10 to 20-percent reduction in your property tax bill this year - but only if your city or county opts in by Friday. Office of the Governor gov.idaho.gov", "2020-07-15T21:07:59.000Z": "I applaud President Trump's efforts to modernize the National Environmental Policy Act. The proposed updates reduce barriers to prosperity, improve public participation, and create certainty while upholding essential environmental safeguards. @WhiteHouse President Donald J. Trump Is Modernizing Federal Environmental Reviews to Accelerate America's... For the first time in 40 years, President Trump is taking action to right-size the environmental review process. whitehouse.gov", "2020-07-14T18:58:40.000Z": "Evaluating healthcare capacity helps state and local public health officials evaluate appropriate COVID-19 mitigation measures. #idahoCovid19", "2020-07-14T13:51:32.000Z": "Here is the full interview with ... @GovernorLittle  that aired this Sunday on Viewpoint on ... @KTVB . Viewpoint: Gov. Little on Idaho staying in Stage 4 and the framework for opening schools On this week's Viewpoint, Gov. Little explains his decision to keep Idaho in Stage 4 of reopening and discusses the plan for reopening public schools. ktvb.com", "2020-07-14T02:43:29.000Z": "She will be greatly missed but long remembered for her passion for education and her service to the people of Idaho. Former state superintendent Marilyn Howard dies The career educator rose to political prominence in 1998, ousting Republican incumbent Anne Fox in the November general election. Howard was the last Democrat to hold a statewide elected office in... idahoednews.org", "2020-07-14T02:42:17.000Z": "Dr. Howard was passionate about Idaho students, and she was a strong reading advocate. As a Land Board member, Dr. Howard recognized the earning potential of state endowment lands to fund education.", "2020-07-13T22:56:21.000Z": "There's a reason President Trump and Congressional Republicans are looking to Idaho - hard-hit businesses need all the help they can get now that our economy is open and jobs are coming back. Office of the Governor gov.idaho.gov", "2020-07-13T20:25:30.000Z": "Vacancies on the Economic Advisory Council are open for residents of Region 2 and residents of Region 6. We're accepting applications through Aug. 7. Office of the Governor gov.idaho.gov", "2020-07-10T21:28:23.000Z": "#MaskUpIdaho", "2020-07-10T17:33:24.000Z": "Idaho @GovernorLittle has proclaimed today as Lineworker Appreciation Day in Idaho! This year more than ever, we celebrate those who work hard to keep the lights, essential businesses, home offices, and A/C on for all of us. Please join us in thanking our Idaho Power line crews!", "2020-07-09T22:02:42.000Z": "", "2020-07-09T21:09:12.000Z": "", "2020-07-09T20:32:57.000Z": "It's imperative that students return to their classrooms and interact directly with their teachers and classmates at the end of the summer. More information here: https:// gov.idaho.gov/pressrelease/g ov-little-pushes-for-in-person-instruction-in-idaho-schools-this-fall/   #IdahoCOVID19 Office of the Governor gov.idaho.gov", "2020-07-09T17:02:15.000Z": "Stay safe, stay healthy, Idaho. Establish ongoing sanitization habits while out and about. #RecreateResponsiblyIdaho  @GovernorLittle  @IdahoCOVID19", "2020-07-09T14:59:05.000Z": "Watch the @GovernorLittle press conference TODAY at Noon MT in the Lincoln Auditorium regarding Idaho's K-12 Reopening Plan and Stage 4 of Idaho Rebounds. @IdahoPTV will stream the event on Facebook and over the air. https:// facebook.com/idahoptv/", "2020-07-09T15:41:24.000Z": "It's a great day to wear a mask! \n\n\"I mask up for all of my patients, to keep my community safe and to halt the spread of COVID-19,\" Dr. Deborah Robertson, St. Luke's Wood River ED medical director. #MaskUpIdaho", "2020-07-07T19:03:34.000Z": "With masks required in #McCall our Payette Lakes office staff are doing their part to #MaskUpIdaho . We have area offices across the state to help closely manage endowment lands which generate funding for public schools and other beneficiaries.", "2020-07-07T14:38:02.000Z": "LIVE today at 12 pm MST, join us with @GovernorLittle and Dr. Christine Hahn, State Epidemiologist to get answers to your questions on the #Idaho  #Coronavirus . Ask your questions and listen in here: https:// nam05.safelinks.protection.outlook.com/?url=https%3A% 2F%2Fstates.aarp.org%2Fidaho%2Fcoronavirus-town-halls-with-governor-little-every-tuesday-at-noon-mdt&data=02%7C01%7Cbwynn%40aarp.org%7C34f58e1b8b8b4d1c797b08d8228300f6%7Ca395e38b4b754e4493499a37de460a33%7C0%7C0%7C637297293348564943&sdata=xfuYBTS66wdH%2F9TA0ZFuFAh7LD8qX9YeOb8XvdAY77U%3D&reserved=0   #idleg  #idahocovid19  #CoronaVirusUpdates Coronavirus Town Halls with Governor Little STATEWIDE TELEPHONE TOWN HALLS WILL CONTINUE THROUGH NOVEMBER states.aarp.org", "2020-07-06T16:59:28.000Z": "The COVID-19 pandemic has exacerbated the impacts of the rural broadband gap. Thank you, #Idaho  @GovernorLittle for creating a new $50m grant fund to help close the gap. Idaho Department of Commerce Opens Applications for Idaho Broadband Grant Program - Idaho Commerce MEDIA ALERT Contact: Matt Borud Idaho Commerce 208.334.2470 matt.borud@commerce.idaho.gov   Idaho Department of Commerce Opens Applications for Idaho Broadband Grant Program BOISE, Idaho-June 29,... commerce.idaho.gov", "2020-07-04T11:00:00.000Z": "We may be celebrating differently this year, but that will not stop us from reflecting on the bravery, sacrifice, and ingenuity that defines the American spirit. Have a safe and happy Fourth of July!", "2020-07-03T11:00:01.000Z": "Happy Statehood Day, Idaho!", "2020-07-01T21:44:38.000Z": "#MaskUpIdaho  @GovernorLittle Here's @cwidaho Pres Bert Glandon and myself . We're with you! #mightycwi", "2020-07-01T22:09:10.000Z": "We Are Committed to Your Safe Return for Fall 2020  #MaskUpIdaho  #IdahoState  https:// youtu.be/mfNou1uhOdQ", "2020-07-02T01:15:10.000Z": "#maskupidaho", "2020-06-29T23:18:12.000Z": "The Idaho Broadband Grant application is now OPEN! For program information and application details Idaho Broadband - Idaho Commerce A vibrant economy starts with connectivity. Stable, reliable broadband infrastructure positions Idaho communities to attract business and enhance quality of life for their citizens. With this in... commerce.idaho.gov", "2020-07-01T16:07:06.000Z": "#USMCA helps all of America's diverse agricultural industries. This new and improved deal secures greater access to markets and lowers barriers for our agricultural products.", "2020-07-01T17:56:54.000Z": "Today is the day we go hands-free. It's now illegal statewide to have electronic devices in hand while operating a vehicle. This law applies even when stopped at red lights and stop signs. Learn more here: https:// itd.idaho.gov/news/idaho-goe s-hands-free-in-july/   #handsfreelaw", "2020-07-01T17:30:03.000Z": "Idaho had the strongest annual personal income growth of any state and ranks #1 in the nation in economic momentum! #IDLeg  #IDpol  https:// mailchi.mp/ffis/index-of- state-economic-momentum-spr-vol-38-12?e=f680b4faea ", "2020-07-01T14:54:12.000Z": "Labor Department Clears 85 Percent of Pending Unemployment Claims Labor Department Clears 85 Percent of Pending Unemployment Claims News Release For Immediate Release: July 1, 2020 Media Contact: Darlene Carnopis, darlene.carnopis@labor.idaho.gov or Georgia Smith, georgia.smith@labor.idaho.gov The Idaho Department of Labor has  idahoatwork.com", "2020-07-01T16:24:10.000Z": "#maskupidaho Thanks for your leadership and modeling @BSDEducation Superintendent Coby Dennis!", "2020-07-01T14:51:35.000Z": "The implementation of USMCA today enables Idaho businesses to continue competing in a global market and enhance their customer base in North America. Thank you, President Trump, for helping ensure Idaho's long-term prosperity into the future! @WhiteHouse  @realDonaldTrump", "2020-06-30T21:21:34.000Z": "We promise we're smiling behind our masks!  #maskupidaho  #communityovercovid  @GovernorLittle", "2020-06-30T14:38:17.000Z": "Join us today at 12 pm MST with @GovernorLittle and Director Jeppesen of @IDHW to discuss #idaho and #CoronaVirusUpdates . Call and listen in here: https:// states.aarp.org/idaho/live-coronavirus-updates-with-governor-little-every-tuesday-at-noon-mst   #idleg  #idahocovid19", "2020-06-30T02:36:03.000Z": "Let's make wearing masks the \"cool\" thing to do. Shouldn't be the other way around. #MaskUpIdaho", "2020-06-30T13:33:53.000Z": "@GovernorLittle is scheduled to join us today on @KBOI670 at 8:30am.  Send us your questions!", "2020-06-30T13:56:18.000Z": "Join the #COVID19 conversation live today at Noon MT as @AARPIdaho hosts @GovernorLittle and DHW Director Dave Jeppesen. Call in or listen to the conversation here: Live Coronavirus Updates with Governor Little Every Tuesday at Noon MDT GOVERNOR LITTLE AND AARP IDAHO WILL HOLD CORONAVIRUS TOWN HALL UPDATES EVERY TUESDAY THROUGH JUNE states.aarp.org", "2020-06-29T23:55:03.000Z": "Nampa Mayor Debbie Kling sharing her support for #maskupidaho .", "2020-06-29T23:53:26.000Z": "#MaskUpIdaho  @GovernorLittle", "2020-06-29T22:01:11.000Z": "CDH Administrative Assistant Jennifer wears a mask to protect her family, friends and community. #MaskUpIdaho  #OneIdaho  #WearItIdaho", "2020-06-29T21:31:34.000Z": "America has survived a civil war, two world wars, economic depression, and, yes, pandemics. These are trying times, but as I have said before, history will remember how we dealt with the challenges. Office of the Governor gov.idaho.gov", "2020-06-29T21:13:25.000Z": "We all want fall sports, so get on board the #FaceMasks4FallSports initiative! #MaskUpIdaho", "2020-06-29T19:12:28.000Z": "#MaskUpIdaho for my community and my family. Much love from Sandpoint! And I hate selfies, lol!", "2020-06-29T18:42:12.000Z": "Enjoy your #SurpriseMaskBenefits and #MaskUpIdaho", "2020-06-29T16:27:35.000Z": "Q. How can states deals with a backlog of archaic rules that hold back common sense government & economic progress? \n\nA. Follow the Idaho \"spring cleaning\" model @GovernorLittle has just issued: https:// mercatus.org/bridge/comment ary/idaho-%E2%80%9Cspring-cleaning%E2%80%9D-order-model-other-states  (new @Mercatus essay w @EconPatrick & @MattMitchell80 ) Idaho \"Spring Cleaning\" Order a Model for Other States Regulations tend to accumulate endlessly. Today there are over 1 million restrictive words (think \"shall\" or \"must\") in the Code of Federal Regulations. Some states, like California and New York, mercatus.org", "2020-06-29T13:54:48.000Z": "I wear a mask so my parents can stay healthy. #MaskUpIdaho", "2020-06-29T01:53:20.000Z": "Beautiful day to be back at @BogusBasin ! Love the mask policy keeping us all safe! #MaskUpIdaho", "2020-06-29T02:05:43.000Z": "Ready to try out my new #anatomy mask in the lab tomorrow #MaskUpIdaho  #MaskUp  @ISUHealthSci  @IdahoStateU  #anated The following media includes potentially sensitive content. Change settings View", "null": "", "2020-06-29T15:30:24.000Z": " #MaskUpIdaho  #CrushTheCurveIdaho", "2020-06-29T16:00:00.000Z": "Wear a mask Practice good hygiene Be cognizant of your health #MaskUpIdaho  #IdahoCOM", "2020-06-29T15:14:03.000Z": "Idaho leads again! Idaho \"Spring Cleaning\" Order a Model for Other States Regulations tend to accumulate endlessly. Today there are over 1 million restrictive words (think \"shall\" or \"must\") in the Code of Federal Regulations. Some states, like California and New York, mercatus.org", "2020-06-28T18:04:53.000Z": "I'm thankful that the masks are not mandatory because that's so hard & complicated to enforce. But with freedom comes responsibility. #MaskUpIdaho Quote Tweet Brad Little @GovernorLittle Let's see you #MaskUpIdaho ! Show your mask selfie and take the http:// one.idaho.gov pledge to protect yourself and others from COVID-19!", "2020-06-28T03:35:34.000Z": "Decided to over do it a bit on the #MaskUpIdaho today at @Ski_Tamarack . All employees here are maskin-up! Do need some #antifog coated @oakley lenses for my #5B  #ESS . @GovernorLittle , thank you for your leadership!", "2020-06-27T21:20:56.000Z": "Y'all have dress masks for socially distant weddings, right? #MaskUpIdaho", "2020-06-27T22:46:09.000Z": "#MaskUpIdaho because nobody should have to die alone, and even one day lost is too many", "2020-06-27T23:09:16.000Z": "@GovernorLittle  #MaskUpIdaho I wear a mask for me, my family and the  public. We can do better. We can do this. #WearAMask", "2020-06-27T23:26:06.000Z": "Masking up for black belt testing.  Good job Master Lee's Tae Kwon Do! #MaskUpIdaho", "2020-06-27T23:27:05.000Z": "Deary\nDonnelly\nMcCall\nBoise\nNo matter the community, if I'm out & about or around y'all I'm gonna #MaskUpIdaho . Because of all the reasons...\n(If you need a washable let me know!)", "2020-06-27T19:03:16.000Z": "#MaskUpIdaho", "2020-06-27T02:32:44.000Z": "Because you can dress up like a superhero and protect everyone around you! #MaskUpIdaho", "2020-06-27T15:54:26.000Z": "#MaskUpIdaho", "2020-06-27T02:23:26.000Z": "@GovernorLittle Masking up at the ID GOP Convention. #MaskUpIdaho", "2020-06-26T21:21:08.000Z": "#MaskUpIdaho  @GovernorLittle", "2020-06-26T22:28:00.000Z": "#MaskUpIdaho It doesn't even hurt! Help protect other Idahoans while you are out in public", "2020-06-26T23:26:09.000Z": "I mask up for my husband, who is immunocompromised and for my fellow Idahoans. I also mask up to teach my children that social responsibility, using wisdom, and loving thy neighbor is the right thing to do. #MaskUpIdaho  @GovernorLittle", "2020-06-27T01:07:40.000Z": "#MaskUpIdaho Thank you Governor Little @GovernorLittle", "2020-06-27T01:12:05.000Z": "We're embracing our new accessories to protect these guy's grandparents. #MaskUpIdaho", "2020-06-27T01:17:05.000Z": "He may not be from Idaho, but he's welcome here anytime! #MaskUpIdaho Quote Tweet Liz Cheney @Liz_Cheney Dick Cheney says WEAR A MASK. #realmenwearmasks", "2020-06-26T21:02:11.000Z": "Scripture reminds us to love our neighbor as ourselves. That's why the NNU community makes sure to wear their masks. Here's our Marketing and Communication Office showing off their masks on campus today! #MaskUpIdaho", "2020-06-26T20:42:36.000Z": "Let's all #MaskUpIdaho !! This is such a simple way that you can help our community and those around you.", "2020-06-26T20:45:06.000Z": "We wear masks to protect our community and staff, and we think we look good doing it! #MaskUpIdaho  #twinfalls", "2020-06-26T19:56:31.000Z": "We do it to give each member of our community the best possible odds at preserving their health and quality of life. #MaskUpIdaho  #science  @GovernorLittle", "2020-06-26T17:55:41.000Z": "Replying to @GovernorLittle Thank you, Gov. Little! #MaskUpIdaho", "2020-06-26T19:43:26.000Z": "Congrats and great work! #MaskUpidaho Quote Tweet Brian Darcy @brian_darcy The ISDB is celebrating our 2020 graduates. #MaskUpIdaho ... @GovernorLittle ", "2020-06-26T16:54:10.000Z": "Thank you, @Dr_Mark_Peters ! #MaskUpIdaho Quote Tweet Mark Peters @Dr_Mark_Peters I #MaskUpIdaho to protect my friends, my community, and everyone @INL . @GovernorLittle", "2020-06-26T16:28:25.000Z": "#MaskUpIdaho  #OneIdaho  @GovernorLittle", "2020-06-26T16:13:39.000Z": "I wear a mask now so I can hopefully see my students in a few months #MaskUpIdaho", "2020-06-26T16:17:05.000Z": "#MaskUpIdaho", "2020-06-26T15:59:16.000Z": "Hooyeah! #MaskUpIdaho  @one_idaho  #idahome", "2020-06-26T15:52:39.000Z": "Way to lead by example @GovernorLittle ! #MaskUpIdaho to keep yourself and other safe! #publichealth Quote Tweet Brad Little @GovernorLittle Let's see you #MaskUpIdaho ! Show your mask selfie and take the http:// one.idaho.gov pledge to protect yourself and others from COVID-19!", "2020-06-26T15:01:17.000Z": "@GovernorLittle I #MaskUpIdaho to protect my fellow Idahoans and to ensure small town America's continued prosperity. I hope everyone will #MaskUpIdaho up for the #4thofJuly and do our part to keep #idaho open!", "2020-06-26T15:19:56.000Z": "@GovernorLittle In the past 3 months, I had made about 800 masks, not only for my family, but for people in our community, so they can help #FlattenTheCurve  #MaskUpIdaho", "2020-06-26T15:24:51.000Z": "@GovernorLittle  #MaskUpIdaho at Rediscovered Books!", "2020-06-26T14:38:27.000Z": "Replying to @GovernorLittle #maskupidaho I choose to wear a mask to protect myself  and others. New fashion accessory! http:// One.idaho.gov", "2020-06-26T14:41:49.000Z": "#MaskUpIdaho at the Ada County Emergency Operations Center. #OneIdaho  @GovernorLittle", "2020-06-26T11:25:11.000Z": "Here is my #MaskUpIdaho  @GovernorLittle .  I think I need an extra mask to help cover that shinny spot on my head.", "2020-06-25T21:06:37.000Z": "Replying to @GovernorLittle", "2020-06-25T18:51:10.000Z": "Replying to @GovernorLittle", "2020-06-25T20:17:32.000Z": "Replying to @GovernorLittle I wear my mask to:\n-Respect & protect business owners, essential workers, fellow shoppers, & health care professionals\n-Support a stable economic recovery\n-Reduce my risk, taxes & insurance premiums going forward\n-Fulfill my responsibility as a citizen https:// tinyurl.com/y7gwnmuu", "2020-06-25T19:59:37.000Z": "Replying to @GovernorLittle Made this one myself way back in March.", "2020-06-26T02:23:50.000Z": "Replying to @GovernorLittle Gotta #MaskUpIdaho ! . Please .", "2020-06-26T01:57:57.000Z": "Replying to @GovernorLittle Masks Rock", "2020-06-26T00:05:21.000Z": "Masking up means you can wear dopey cats or watermelons on your face when you make your own. What's not to like? @RuthBrownNews  #MaskUpIdaho", "2020-06-26T00:10:08.000Z": "You get to dress like an outlaw from the movies. #MaskUpIdaho  #WeGotThisCovered", "2020-06-26T02:11:27.000Z": "Replying to @GovernorLittle Why not highlight our heritage while we're at it and have a little fun? Thanks to a friend who makes Basque & sheep themed masks", "2020-06-26T00:41:53.000Z": "We are masked up for Idaho! #MaskUpIdaho", "2020-06-26T00:43:05.000Z": "It's not a \"requirement\", but we do it anyways. Wearing a mask isn't political. It's the right thing to do. Do your part. #MaskUpIdaho", "2020-06-26T00:04:26.000Z": "Replying to @LTurnerPhD  and  @GovernorLittle", "2020-06-26T00:06:47.000Z": "Replying to @GovernorLittle #MaskUpIdaho If everyone wears a mask we can slow the spread by keeping germs at bay.", "2020-06-26T00:27:09.000Z": "Representing #MaskUpIdaho in DC. @GovernorLittle , which mask is the best?", "2020-06-26T00:32:12.000Z": "Replying to @GovernorLittle @idahowbc  #MaskUpIdaho Slow the Spread. We choose to follow the http:// One.Idaho.Gov pledge. Let's all stay healthy by wearing masks!!", "2020-06-26T01:40:04.000Z": "Replying to @GovernorLittle For my mom (82) and dad (84) to see their grandson graduate from BSU.", "2020-06-26T00:46:19.000Z": "I wear a mask to honor my mother who made it, and to help protect the other mothers, fathers, and fellow Idahoans who are around me. #MaskUpIdaho Quote Tweet Brad Little @GovernorLittle Let's see you #MaskUpIdaho ! Show your mask selfie and take the http:// one.idaho.gov pledge to protect yourself and others from COVID-19!", "2020-06-25T23:03:58.000Z": "I wear a mask because I want to be able to hug my parents again, travel to see my family again, and live to see another day. I want the same for all of you. #MaskUpIdaho", "2020-06-25T22:43:28.000Z": "#MaskUpIdaho I wear a mask to keep our economy and our community healthy! Join me in Crushing COVID @BlaineCountyID", "2020-06-25T22:02:05.000Z": "Via @GovernorLittle : \"Take the pledge to protect yourself and others at http:// one.idaho.gov \"", "2020-06-25T22:36:23.000Z": "I wear a mask to do my part to #slowthespread , keep me & my family safe and protect others #MaskUpIdaho ( #onbrand )", "2020-06-25T22:38:21.000Z": "#MaskUpIdaho", "2020-06-25T22:11:41.000Z": "#MaskUpIdaho ! We're at the Downtown Event Center and this ENTIRE violin studio is masked up while they record music for our community!", "2020-06-25T21:52:54.000Z": "#MaskUpIdaho I've kept a toothy grin though this entire ordeal, mostly thanks to my toothy mask! #craftylady  #mawmask  #allteeth  #homemade", "2020-06-25T21:27:41.000Z": "If we can do it, so can everyone else! #MaskUpIdaho and as always, Go Broncos", "2020-06-25T21:12:25.000Z": "This health behaviorist understands the importance of pro-social norms to promote actions that protect others. Grateful for leadership by example from @GovernorLittle  #MaskUpIdaho", "2020-06-25T21:15:20.000Z": "@GovernorLittle is asking everyone to wear a mask when out in public. Let's see your best picture of you in your masks! #MaskUpIdaho", "2020-06-25T20:56:19.000Z": "I wear a mask because my grandfather is in an assisted living facility. It's my hope those that come into contact with his nurses would do the same. #MaskUpIdaho", "2020-06-25T21:00:10.000Z": "10/10 for Fritz. A good boy and a great mask-wearer! #MaskUpIdaho Quote Tweet Natalie Hurst @NatalieKBOI Fritz got the memo from @GovernorLittle  He says if long noses can do this, you can too!  #MaskUpIdaho  #OneIdaho   #dachshunds", "2020-06-25T19:04:57.000Z": "Replying to @GovernorLittle Wearing masks and enjoying the zoo!! @ZooBoise", "2020-06-25T20:22:59.000Z": "#MaskUpIdaho  #ThrowbackThursday", "2020-06-25T20:04:03.000Z": "#MaskUpIdaho while heading into the grocery store. I work in healthcare and I wear a mask for your safety and mine! Looking out for my loved ones. Quote Tweet Brad Little @GovernorLittle Let's see you #MaskUpIdaho ! Show your mask selfie and take the http:// one.idaho.gov pledge to protect yourself and others from COVID-19!", "2020-06-25T19:58:56.000Z": "Let's #MaskUpIdaho to keep each other healthy and continue to safely support Idaho businesses. #OneIdaho", "2020-06-25T19:50:55.000Z": "You can engage in the economy, safely go back to work, and safely receive care from your medical provider, but you must do so while practicing the proven measures to fight the spread of coronavirus. Office of the Governor gov.idaho.gov", "2020-06-25T19:46:59.000Z": "#MaskUpIdaho  #IdahoCOVID19 Quote Tweet Brad Little @GovernorLittle Let's see you #MaskUpIdaho ! Show your mask selfie and take the http:// one.idaho.gov pledge to protect yourself and others from COVID-19!", "2020-06-25T19:18:54.000Z": "Doing my part  #MaskUpIdaho", "2020-06-25T19:18:38.000Z": "#MaskUpIdaho JUST WEAR IT!! It's easier than a ventilator mask!", "2020-06-25T19:12:04.000Z": "#maskupIdaho  @GovernorLittle", "2020-06-25T19:10:06.000Z": "It's my way of saying \"I care about you\"... #maskupidaho", "2020-06-25T19:09:48.000Z": "Replying to @GovernorLittle #MaskUpIdaho", "2020-06-25T19:08:31.000Z": "Filters still work. It's a new fashion statement. All of the cool kids are doing it. #MaskUpIdaho", "2020-06-25T18:58:24.000Z": "#MaskUpIdaho  #ThrowbackThursday", "2020-06-25T18:59:48.000Z": "#MaskUpIdaho", "2020-06-25T18:29:07.000Z": "Proud to wear a mask to protect my parents, grandparents, and vulnerable patients I help to serve. #MaskUpIdaho", "2020-06-25T18:37:31.000Z": "Proud to wear a mask to protect my wife, my kids, my family, my friends, people I don't know, and myself. Lead by example. #MaskUpIdaho", "2020-06-25T18:38:54.000Z": "wearing a mask in public is the best way to beat this thing #MaskUpIdaho", "2020-06-25T18:45:00.000Z": "#MaskUpIdaho Quote Tweet Karen Lehr @KarenLehr #MaskUpIdaho  twitter.com/GovernorLittle", "2020-06-25T18:48:33.000Z": "#MaskUpIdaho  #EnmascararIdaho", "2020-06-25T18:46:24.000Z": "Replying to @GovernorLittle I wear one because I care about you. #InThisTogether", "2020-06-25T18:40:52.000Z": "Replying to @GovernorLittle #MaskUpIdaho", "2020-06-25T18:32:29.000Z": "Replying to @GovernorLittle  and  @IDHW", "2020-06-25T18:21:35.000Z": "Replying to @GovernorLittle My daughters helping protect other Idahoans. #MaskUpIdaho", "2020-06-25T18:31:45.000Z": "Replying to @GovernorLittle 𝙒𝙚 𝘾𝘼𝙍𝙀 𝙛𝙤𝙧 𝙮𝙤𝙪, 𝙨𝙤 𝙒𝙀𝘼𝙍 𝙛𝙤𝙧 𝙮𝙤𝙪. \n\nLet's see you #MaskUpIdaho ! Show your mask selfie and take the http:// one.idaho.gov pledge to protect yourself and others from COVID-19!", "2020-06-25T18:17:06.000Z": "#MaskUpIdaho Quote Tweet Brad Little @GovernorLittle Let's see you #MaskUpIdaho ! Show your mask selfie and take the http:// one.idaho.gov pledge to protect yourself and others from COVID-19!", "2020-06-25T18:08:01.000Z": "Bravo to @GovernorLittle for highlighting the importance of protecting each other by wearing protective face coverings. #MaskUpIdaho  Quote Tweet Brad Little @GovernorLittle Let's see you #MaskUpIdaho ! Show your mask selfie and take the http:// one.idaho.gov pledge to protect yourself and others from COVID-19!", "2020-06-25T18:06:51.000Z": "Masking up is one of my new favorite things. #MaskUpIdaho Quote Tweet Brad Little @GovernorLittle Let's see you #MaskUpIdaho ! Show your mask selfie and take the http:// one.idaho.gov pledge to protect yourself and others from COVID-19!", "2020-06-25T17:59:54.000Z": "Replying to @GovernorLittle My little guy even knows to wear his! #MaskUpIdaho  #WearAMask", "2020-06-25T17:53:25.000Z": "Replying to @EricForsch  and  @GovernorLittle Wearing my mask to keep myself and my clients safe. I need my client to trust that I have their safety in coming to see me.", "2020-06-25T17:32:05.000Z": "Please continue to wear your face mask thanks #maskupidaho", "2020-06-25T17:46:55.000Z": "Replying to @GovernorLittle  #MaskUpIdaho", "2020-06-25T17:47:53.000Z": "Replying to @GovernorLittle Not only #MaskUpIdaho but supporting local businesses too. Feels good protecting them and myself.", "2020-06-25T17:24:22.000Z": "#MaskUpIdaho", "2020-06-25T16:48:21.000Z": "#MaskUpIdaho", "2020-06-25T17:13:31.000Z": "#MaskUpIdaho at ACHD! @GovernorLittle", "2020-06-25T17:00:30.000Z": "Replying to @GovernorLittle #MaskUpIdaho", "2020-06-25T16:42:30.000Z": "Replying to @GovernorLittle #ThursdayThoughts  #Leadership  #COVID19  #InThisTogether  #MaskUpIdaho", "2020-06-25T16:40:38.000Z": "Proud of my Gov! Challenge accepted. Quote Tweet Brad Little @GovernorLittle Let's see you #MaskUpIdaho ! Show your mask selfie and take the http:// one.idaho.gov pledge to protect yourself and others from COVID-19!", "2020-06-25T16:23:43.000Z": "Let's see you #MaskUpIdaho ! Show your mask selfie and take the http:// one.idaho.gov pledge to protect yourself and others from COVID-19!", "2020-06-24T21:50:23.000Z": "We want Idahoans back to work! \n\n60-70% of folks on unemployment are making more than they did at their job because of the additional $600 in federal benefits. That's a disincentive to go back to work.\n\nIdaho already offers Return to Work bonuses!", "2020-06-24T21:30:26.000Z": "Thank you @SecBrouillette for visiting the @INL ! Brouillette announced the DOE will provide $65 million in research funding to advance 93 nuclear technology projects in 28 states -- including the INL, the nation's leading nuclear energy research facility. https:// energy.gov/articles/secre tary-brouillette-tours-idaho-national-laboratory?fbclid=IwAR3iujAC5wg7CALwiyP_9Ergv4rRY_lgk1bbcu31BTELwzkIV7kZTjsAzdU ", "2020-06-24T20:47:18.000Z": "Thank you for joining us! Quote Tweet Senator Mike Crapo @MikeCrapo Thank you @AARPIdaho for inviting @governorLittle , Director Jeppesen of @IDHW and me for a Live Q and A on the #CoronavirusPandemic", "2020-06-24T19:45:02.000Z": "NEW: Idaho's @GovernorLittle Breaks Out The Scissors & Cuts More Red Tape To Expand Healthcare Access      Idaho Governor Brad Little Breaks Out The Scissors & Cuts More Red Tape To Expand Healthcare Access Idaho Governor Brad Little is back at it - cutting even more red tape and easing the regulatory burden on businesses and citizens across the Gem State. This week, the governor took sweeping action to... rga.org", "2020-06-24T18:19:52.000Z": "Have questions for @GovernorLittle and Idaho Dept of Health and Welfare Director Jeppesen? They will join us on @IdahoReports Thursday 6/25 at 8:00 PM for another COVID-19 Q&A.\n\nSend questions to Devon.Downey@idahoptv.org. #idahoCovid19  #idpol", "2020-06-24T19:11:39.000Z": "Good news for the future of our country: Today, the U.S. Senate confirmed President Trump's 200th judicial appointment - a historic legacy that will shape the courts for years to come. Senate confirms Trump's 200th judge, officially fills all appeals court vacancies The judges the Senate is confirming will likely remain at their posts for decades. Cory Wilson, confirmed Wednesday, is only 49 years old. Justin Walker, who the Senate last week confirmed to the... foxnews.com", "2020-06-24T18:15:57.000Z": "\"We're trying to stay ahead of this,\" Idaho @GovernorLittle says, about reopening amid the pandemic. https:// abcn.ws/2YzkNyI \"We've got 100% of all businesses open, and we're just seeing a lot of spread as a result of the bars being open.\"", "2020-06-22T20:08:15.000Z": "Join us this week at 1:30 pm MST on Wednesday with @GovernorLittle , Senator @MikeCrapo , and Director Jeppesen of @IDHW for a LIVE Q and A on #idaho and the #CoronavirusPandemic . https:// states.aarp.org/idaho/live-coronavirus-updates-with-governor-little-every-tuesday-at-noon-mst   #idleg", "2020-06-24T15:58:47.000Z": "The safest route to recovery will come with respecting each other's space and well-being.\n\nBy taking the pledge and submitting the contact form, you will receive a ONE Idaho sticker to display your commitment to a safer Idaho. Live Smart - One Idaho You can help Idaho rebound from COVID-19 by taking the One Idaho pledge today. Find out what you can do to make sure Idaho continues to recover quickly. one.idaho.gov", "2020-06-24T16:02:04.000Z": "Take the pledge to protect yourself and others at http:// one.idaho.gov !", "2020-06-23T23:00:27.000Z": "Had a great day with members of the Idaho legislature. We discussed sovereignty over our water, toured aquifer recharge sites that will help ensure water for future generations, and learned about the UI research that will help support continued multiple uses of our public lands!", "2020-06-22T18:46:25.000Z": "Idaho's unprecedented advances in telehealth and healthcare access this year will be preserved long after COVID-19 with a new executive order. #IdahoCovid19  #IDLeg  #IDGov  https:// gov.idaho.gov/pressrelease/g ov-little-cuts-more-red-tape-preserves-recent-healthcare-advances-moving-forward/ ", "2020-06-22T16:49:07.000Z": "TODAY at 12 p.m. MT / 11 a.m. PT, watch @GovernorLittle 's LIVE press conference regarding Red Tape Executive Order. #idpol Stream on IdahoPTV Facebook Live: https:// facebook.com/idahoptv/ Or watch online at: Idaho in Session Governor House and Senate sessions, committee meetings, court hearings, and more live streamed from all three branches of Idaho's government. idahoptv.org", "2020-06-19T17:56:44.000Z": "I encourage all Idahoans to reflect on this historical day and our future as a country. #Juneteenth Gov Little Juneteenth Proclamation 6 15 20 Juneteenth Proclamation from the office of the Governor of Idaho youtube.com", "2020-06-19T17:03:51.000Z": "President Trump is looking to Idaho on our Return to Work bonuses. The bonuses are needed to counteract federal programs that disincentivize returning to work so we can continue our economic rebound. Trump administration wants to replace $600 unemployment benefit with back-to-work bonus The Trump administration doesn't want to extend a federal enhancement to unemployment benefits, which is scheduled to end July 31, according to a senior aide. Instead, it wants to offer a cash bonus... msn.com", "2020-06-19T14:00:06.000Z": "Happy to have hosted Idaho's @GovernorLittle for a visit to @INL yesterday! Thanks for supporting @INL ! #INL  #Idaho  #nuclear", "2020-06-18T20:12:46.000Z": "A strong economic rebound cannot occur without workers returning to a job, and the new Return to Work cash bonuses counteract the federal payouts and incentivize our workforce to get back to work safely.", "2020-06-17T21:09:21.000Z": "The Return to Work bonuses are Idaho's conservative approach to counteracting enhanced federal benefits that disincentivize workers returning to jobs. Office of the Governor gov.idaho.gov", "2020-06-17T16:42:51.000Z": "It is our intent to have schools safely reopen across Idaho in the fall, although it may look different than it has in the past. Guidance and resources for reopening will be available to school districts and charter schools in the coming weeks. https:// gov.idaho.gov/pressrelease/n ew-committees-to-address-fall-school-reopening-and-the-digital-divide/ ", "2020-06-17T16:11:55.000Z": "Here's some good information on the face coverings we all should be wearing to keep our economic rebound going strong! https:// cdc.gov/coronavirus/20 19-ncov/downloads/fs-Important-information-cloth-face-covering.pdf ", "2020-06-16T17:34:14.000Z": "Top economic advisor to @realdonaldtrump and the @whitehouse discusses the benefits of return to work bonuses, a concept we're pursuing in Idaho to help our economic rebound, get people off unemployment, and save taxpayer dollars in the long run.", "2020-06-15T17:06:25.000Z": "Join Attorney General Lawrence Wasden and me as we answer your questions on fraud and COVID-19 during an AARP Telephone Town-hall on Tuesday, June 16 at noon Mountain Time. Office of the Governor gov.idaho.gov", "2020-06-12T00:21:32.000Z": "Had a productive tour and discussion focused on shared stewardship in our nation's forests at the Idaho Forest Group's mill in Athol, ID with @GovernorLittle and @RepRussFulcher", "2020-06-12T22:25:03.000Z": "RT @SecretarySonny : Had a productive tour and discussion focused on shared stewardship in our nation's forests at the Idaho Forest Group's mill in Athol, ID with @GovernorLittle and @RepRussFulcher", "2020-06-12T20:26:36.000Z": "Way to go, @Idaho_Central ! Quote Tweet Idaho Central Credit Union @Idaho_Central We are proud to take the @one_idaho Idaho pledge! We are committed to support an open, safe, and healthy environment. Join us and take the pledge!  https:// one.idaho.gov", "2020-06-12T17:24:29.000Z": "Thank you to Idaho Forest Group's Athol Mill for hosting a discussion on forestry with representatives from Idaho, the West, and with U.S. Dept. of Agriculture Secretary Sonny Perdue!", "2020-06-11T21:44:59.000Z": "This ends the extreme emergency declaration, consolidates much of the actions we have taken to date, and ensures Idaho can continue to access federal assistance to mitigate COVID-19.", "2020-06-11T21:44:46.000Z": "My latest disaster emergency proclamation ensures we can respond quickly to COVID-19 in our state in order to protect our citizens, preserve healthcare capacity, and rebound our economy. View the proclamation here: https:// coronavirus.idaho.gov/wp-content/upl oads/2020/06/proclamation_emergency_061120.pdf ", "2020-06-11T21:12:42.000Z": "Protocols are added for long-term care facilities, nightclubs, and employers of people who are at greater risk of COVID-19. The protocols for restaurants were also updated to allow for more than six people at a table along with a few other small changes. Office of the Governor gov.idaho.gov", "2020-06-11T19:02:36.000Z": "We narrowly met criteria to enter the final stage of our Idaho Rebounds plan to safely and responsibly open the economy in stages. Please continue to strengthen your personal actions to slow the spread of COVID-19 so we can keep Idaho open. Office of the Governor gov.idaho.gov", "2020-06-11T04:08:07.000Z": "...Thank you for your leadership ... @GovernorLittle , happy to take the ONE Idaho Pledge for businesses. Welcome - One Idaho 1.7 million people strong. One Idaho. Come together with fellow Idahoans. Take the pledge to help Idaho rebound from COIVD-19 today. one.idaho.gov", "2020-06-11T16:59:11.000Z": "With over 17,000 miles of trail in Idaho, appropriate physical distancing, and giving a wide breadth to passing traffic, is courteous trail etiquette with our without COVID-19 concerns. @IdahoCOVID19  @GovernorLittle  #RecreateResponsiblyIdaho", "2020-06-10T22:01:51.000Z": "Via @GovernorLittle : \"Idaho is leveraging federal coronavirus relief funds to cover local public safety personnel salaries, giving cities and counties the opportunity to pass on the savings to taxpayers. The move is expected to provide up to $200 million in property tax relief.\"", "2020-06-10T19:50:03.000Z": "I will host a press conference regarding Stage 4 of Idaho Rebounds at 10 a.m. MT, Thursday, June 11, in Capitol Room EW 42. The conference will be streamed to the public through Idaho Public Television. Idaho in Session Governor House and Senate sessions, committee meetings, court hearings, and more live streamed from all three branches of Idaho's government. idahoptv.org", "2020-06-10T16:54:27.000Z": "We're directing much of the federal coronavirus relief funds back to our citizens and businesses. Property tax relief, support for businesses, and Return to Work bonuses are among the fiscally conservative concepts we've put into action here in Idaho. Office of the Governor gov.idaho.gov", "2020-06-10T16:20:49.000Z": "Show your support for a safe, healthy, and open Idaho by taking the ONE Idaho Pledge. Welcome - One Idaho 1.7 million people strong. One Idaho. Come together with fellow Idahoans. Take the pledge to help Idaho rebound from COIVD-19 today. one.idaho.gov", "2020-06-09T17:24:55.000Z": "Qualified individuals interested in applying for the Fish and Game Commission vacancy are encouraged to submit applications to the Governor's Office by June 26, 2020. Office of the Governor gov.idaho.gov", "2020-06-09T17:13:41.000Z": "#TransparencyTuesday The first self-employed individuals started receiving their Small Business Grant money today. See Transparent Idaho for more details. https:// idahocaresact.opengov.com/data/#/45157/q uery=BF8756749F3A2E1CA49249D4EFE58398&embed=n   #idpol  #ReboundIdaho", "2020-06-09T15:23:28.000Z": "Join @AARPIdaho LIVE today at Noon MT with @GovernorLittle and Lt. Gov. Janice McGeachin. DHW Director Dave Jeppesen also will be available to answer your COVID-19 questions. Join the conversation here: Coronavirus Town Halls with Governor Little STATEWIDE TELEPHONE TOWN HALLS WILL CONTINUE THROUGH NOVEMBER states.aarp.org", "2020-06-09T00:06:22.000Z": "Join Lt. Gov. @JaniceMcGeachin and me for the AARP telephone town hall 6/9 at 12 pm MT.  Participants can join by dialing toll-free 866-767-0637 or register in advance by visiting https:// vekeo.com/aarpidaho/ . @AARPIdaho AARP Idaho - For more than 50 years, AARP has been working in the Gem State to improve the lives of the 50-plus. By weighing in on issues that matter most to Idaho families and providing trusted information,... vekeo.com", "2020-06-08T21:42:43.000Z": "Pres. Trump, White House officials and Congressional Republicans are looking at a program just like the one we rolled out here in Idaho: back-to-work bonuses. The move saves taxpayer resources in the long run and helps us achieve a strong economic rebound. White House, Congress discuss 'return to work' bonus of $450 a week Senator Rob Portman (R-Ohio) has proposed paying people who return to work this summer an extra $450 a week. Trump likes the idea, but heavy debate remains about how much aid to give million of... washingtonpost.com", "2020-06-08T18:39:25.000Z": "Our focus is to support our communities and our police, fire, and EMS personnel and ensure there are no reductions in public safety during these unprecedented challenges.", "2020-06-08T17:02:09.000Z": "The Paycheck Protection Program Flexibility Act addresses challenges in utilizing PPP funds. New provisions include reducing payroll requirements, delaying deadlines to rehire workers, extending time to use funds, and extending repayment terms. Paycheck Protection Program An SBA loan that helps businesses keep their workforce employed during the Coronavirus (COVID-19) crisis. sba.gov", "2020-06-08T16:20:11.000Z": "Office of the Governor gov.idaho.gov", "2020-06-08T15:24:28.000Z": "Idaho is leveraging federal coronavirus relief funds to cover local public safety personnel salaries, and giving cities and counties the opportunity to pass on the savings to property taxpayers. The move is expected to provide up to $200 million in property tax relief.", "2020-06-05T20:35:44.000Z": "News release: DHW to publish weekly information about #IdahoCovid19 and long-term care facilities https:// healthandwelfare.idaho.gov/AboutUs/Newsro om/tabid/130/articleType/ArticleView/articleId/2102/DHW-to-publish-weekly-information-about-COVID19-and-longterm-care-facilities.aspx ", "2020-06-05T19:07:10.000Z": "More than 60% of Americans who are out of work due to COVID-19 earn more with the enhanced unemployment benefits than their normal wages. The enhanced benefits are set to expire next month, making it even more important to get Idahoans back to work. https:// gov.idaho.gov/pressrelease/g ov-little-to-offer-back-to-work-cash-bonuses/ ", "2020-06-05T11:52:14.000Z": "Great going Brad! Quote Tweet Brad Little @GovernorLittle Idaho has met the criteria to advance to Stage 3 of the Idaho Rebounds plan to safely and responsibly reopen Idaho's economy. #IdahoCOVID19  https:// gov.idaho.gov/pressrelease/i dahoans-reminded-to-continue-safe-practices-as-idaho-enters-stage-3-of-reopening/ ", "2020-06-04T19:27:45.000Z": "I will host a press conference related to unemployment and Idaho's economy on Friday, June 5 at 11 a.m. MT in Capitol Room EW42. The press conference will be streamed to the public through Idaho Public Television and online. Idaho in Session Governor House and Senate sessions, committee meetings, court hearings, and more live streamed from all three branches of Idaho's government. idahoptv.org", "2020-06-02T15:03:51.000Z": "Join us today at 12 pm MST with @GovernorLittle and the @IdahoLabor department for a LIVE discussion on #reopening and #unemployment . Join here: https:// states.aarp.org/idaho/live-coronavirus-updates-with-governor-little-every-tuesday-at-noon-mst   #idleg", "2020-06-01T23:27:37.000Z": "I pray for the safety of our citizens and our law enforcement officers. God bless George Floyd and the men and women who are standing up in peace for a fair and equitable criminal justice system in America.", "2020-06-01T23:27:04.000Z": "George Floyd's death is unacceptable. We can all unite around our demand for justice for this innocent man. I'm proud of the Idahoans who have channeled their sorrow and anger in peaceful protest, and I appreciate mayors across Idaho who are helping to manage this situation.", "2020-06-01T20:46:42.000Z": "We've been able to get PPE to 2,500 small businesses and nonprofits in the past couple of weeks. Health and the economy are linked - people need to feel safe visiting businesses and returning to work. Visit https:// supplies.idaho.gov .", "2020-06-01T15:39:32.000Z": "Labor Director Jani Revier and I will answer unemployment questions during an hour-long telephone town-hall hosted by AARP Idaho.", "2020-05-29T14:53:45.000Z": "Stage 3 begins tomorrow in Idaho. Protocols for outdoor pools, splashpads, waterparks; bars, breweries, wineries, distilleries; and indoor movie theatres are now available at: Idaho Rebounds: Our Path to Prosperity Idaho's rebound from COVID-19 and our path to prosperity start with employee and consumer confidence, which leads into business stability and growth, and eventually promotion and attraction. rebound.idaho.gov", "2020-05-28T21:18:54.000Z": "Idaho has met the criteria to advance to Stage 3 of the Idaho Rebounds plan to safely and responsibly reopen Idaho's economy. #IdahoCOVID19 Office of the Governor gov.idaho.gov", "2020-05-28T19:22:50.000Z": "Watch Gov. Little's press conference on advancing to stage 3 here: https:// facebook.com/watch/live/?v= 601866347091653&notif_id=1590693677620163&notif_t=live_video   #idahocovid19  #idpol Idaho Governor Stage 3 Press Conference Idaho Governor Brad Little Press Conference on Coronavirus Stage 3 Guidance. Live on Idaho Public Television over the air and right here on Facebook. May... facebook.com", "2020-05-28T16:21:03.000Z": "There are many questions about what to expect for school districts, educators, and our students. We sat down with @GovernorLittle to answer some of them, you can watch the full conversation here: https:// idahoea.org/news/govlittle interview/   #idpol  #idleg  #COVID19", "2020-05-28T16:27:10.000Z": "TODAY at 1:30 MT / 12:30 PT: @GovernorLittle 's press conference regarding Stage 3 of Idaho Rebounds.\n\nStream it LIVE on IdahoPTV's Facebook page https:// facebook.com/idahoptv/ or on our website https:// idahoptv.org/shows/idahoins ession/governor/  . #IdahoCovid19 Idaho in Session Governor House and Senate sessions, committee meetings, court hearings, and more live streamed from all three branches of Idaho's government. idahoptv.org", "2020-05-27T17:40:52.000Z": "Some events must be planned well in advance and some event timelines extend beyond Stage 4 of the Idaho Rebounds plan. State and local public health experts created a new guidance document to assist with decisions about gatherings. Office of the Governor gov.idaho.gov", "2020-05-27T16:19:07.000Z": "Idaho small businesses can obtain a 30-day supply of personal protective equipment (PPE) for their employees and patrons at http:// supplies.idaho.gov .", "2020-05-27T15:43:05.000Z": "Many hospitals and healthcare providers are limiting visitors and any non-colleagues or providers. Please understand and respect the visitor policy of your local hospital or healthcare provider. These facilities are working to protect vulnerable patients and preserve PPE.", "2020-05-27T15:15:00.000Z": "Self-employed individuals economically impacted by COVID-19 now may be eligible to receive up to $7,500 in cash support through the Idaho Rebound cash grants for small businesses. Visit http:// Rebound.Idaho.Gov for more information and apply today!", "2020-05-26T14:24:57.000Z": "LIVE today at 12 MST, join @GovernorLittle & Director Dave Jeppesen of @IDHW as they answer questions and info. as Idaho's economy #reopens amid #CoronavirusPandemic . Get your questions answered here: https:// states.aarp.org/idaho/live-coronavirus-updates-with-governor-little-every-tuesday-at-noon-mst   @KMVTNews  @twinfallstn  @Boiseweekly  @TheIdahoPress Live Coronavirus Updates with Governor Little Every Tuesday at Noon MDT GOVERNOR LITTLE AND AARP IDAHO WILL HOLD CORONAVIRUS TOWN HALL UPDATES EVERY TUESDAY THROUGH JUNE states.aarp.org", "2020-05-26T14:51:17.000Z": "Starting TODAY eligible farmers and ranchers can begin submitting applications for the Coronavirus Food Assistance Program (CFAP) administered by @USDA  https:// farmers.gov/cfap", "2020-05-26T14:39:46.000Z": "\"We have a sign on our door thanking delivery personnel for bringing us our supplies because we have an infant with medical needs. Our Amazon driver dropped off our package, read our note, and prayed for our boy before heading out.\" - Raquel Pearson - Caldwell, Idaho", "2020-05-25T12:00:00.000Z": "I ask that all Idahoans take a brief moment out of this Memorial Day to give remembrance to all those who have fallen so that their memory may endure. 2020 Idaho Memorial Day Message with Governor Little Intro Boise, ID - Idaho Division of Veterans Services encourages Idaho's citizens to safely honor and remember all those that died while serving in defense to our ... youtube.com", "2020-05-24T21:12:46.000Z": "It's a beautiful Memorial Day Weekend. Please enjoy it responsibly!", "2020-05-22T19:18:38.000Z": "A strong economic rebound can only occur with a combination of efforts, and expanded and targeted testing is a big part of our strategy. Office of the Governor gov.idaho.gov", "2020-05-22T19:09:07.000Z": "At the request of President Donald J. Trump, flags should be flown at half-staff until sunset, May 24, 2020, honoring the Victims of the Novel Coronavirus Pandemic. Sign up to receive future notifications at https:// idaho.gov/flag/", "2020-05-22T18:12:11.000Z": "HAPPENING NOW: Governor's press conference on new COVID-19 Testing Strategy\nMay 22, 2020 at 12:00pm MT/11:00am PT Idaho in Session Governor House and Senate sessions, committee meetings, court hearings, and more live streamed from all three branches of Idaho's government. idahoptv.org", "2020-05-22T14:56:43.000Z": "@GovernorLittle will hold a press conference TODAY at noon MT regarding a new COVID-19 testing strategy for Idaho. The press conference will be streamed live through Idaho Public Television at: Idaho in Session Governor House and Senate sessions, committee meetings, court hearings, and more live streamed from all three branches of Idaho's government. idahoptv.org", "2020-05-21T22:35:21.000Z": "This move is about good government and prudent management of taxpayer dollars. Given the uncertain economic times, we must minimize state borrowing and limit the amount of General Fund that is committed to interest payments on loans. Office of the Governor gov.idaho.gov", "2020-05-21T21:44:16.000Z": "Health and the economy are not mutually exclusive - they are interconnected. Prosperity and safety are linked. Protecting other citizens is the right thing to do, and our economic rebound depends on it. Office of the Governor gov.idaho.gov", "2020-05-21T17:56:32.000Z": "With proper social distancing Idahoans can still enjoy the physical and emotional benefits of outdoor recreation! #StaySafe  #RecreateResponsiblyIdaho  #CrushTheCurve  #SocialDistancing  @GovernorLittle The following media includes potentially sensitive content. Change settings View", "2020-05-19T21:09:18.000Z": "#TransparencyTuesday Small businesses across Idaho need support as soon as possible. As of last night's processing, 85% of all Small Business Grant distributions have gone to businesses with 1 to 5 employees. See it all at Transparent Idaho. https:// transparentshowcases.idaho.gov/pages/direct-i daho-small-business-support   #idpol", "2020-05-19T15:06:57.000Z": "#BlueCrossofIdaho supports @GovernorLittle 's reopening plan, & wearing masks to slow #COVID19 . Our employees #RockTheMask for essential errands. EVP/CFO Ralph Woodard is rocking his mask at @Albertsons . Show us your mask & hashtag #RockTheMask ! #BCIEmployee", "2020-05-19T14:52:11.000Z": "Join us LIVE today at 12 pm MST for #coronavirus updates with @GovernorLittle and Director Jeppesen of @IDHW . https:// states.aarp.org/idaho/live-coronavirus-updates-with-governor-little-every-tuesday-at-noon-mst   @KTVB  @KMVTNews  @twinfallstn  @IdahoStatesman  @IdahoStateJ Live Coronavirus Updates with Governor Little Every Tuesday at Noon MDT GOVERNOR LITTLE AND AARP IDAHO WILL HOLD CORONAVIRUS TOWN HALL UPDATES EVERY TUESDAY THROUGH JUNE states.aarp.org", "2020-05-19T14:56:47.000Z": "In today's primary election, the ballot box is your mailbox! Today is the last day to visit http:// IdahoVotes.Gov to register and request your ballot. Return your ballot to your county clerk by June 2. Happy Election Day!", "2020-05-19T04:03:04.000Z": "Money is already going out to Idaho's small businesses as part of #IdahoRebounds grant program. Of course that means Transparent Idaho is already tracking it to show taxpayers that federal aid is getting where it needs to go. https:// transparentshowcases.idaho.gov/pages/direct-i daho-small-business-support   #idpol", "2020-05-18T21:29:01.000Z": ". @GovernorLittle will host a statewide AARP telephone town hall Tuesday to provide information on the coronavirus in Idaho, 12 p.m. MT/11 a.m. PT. Join by dialing toll-free 866-767-0637 or register in advance by visiting https:// vekeo.com/aarpidaho/ .(Photo: AARP, Randy Simon)", "2020-05-18T22:47:25.000Z": "Consumer and employee confidence is needed in order for Idaho's economy to rebound more quickly. Businesses opening their doors should have operational plans in place to mitigate the risk of spreading COVID-19. New protocols were recently added. Office of the Governor gov.idaho.gov", "2020-05-18T20:11:18.000Z": "The application cycle for self-employed individuals will start on May 27. Applicants need to create a Taxpayer Access Point (TAP) account and are encouraged to do so prior to their application phase opening.\n \nAdditional information is available at: https:// rebound.idaho.gov/idaho-rebound- cash-grants-for-small-businesses/  . Idaho Rebounds: Our Path to Prosperity Idaho's rebound from COVID-19 and our path to prosperity start with employee and consumer confidence, which leads into business stability and growth, and eventually promotion and attraction. rebound.idaho.gov", "2020-05-18T20:10:46.000Z": "Self-employed individuals economically impacted by COVID-19 now may be eligible to receive up to $7,500 in cash support through the Idaho Rebound cash grants for small businesses.", "2020-05-18T19:18:22.000Z": "We were happy to welcome ... @GovernorLittle  to ... @INL  today. We visited the ... @Battelle  Critical Care Decontamination System, which continues to decontaminate N95 respirators to meet our regional needs.", "2020-05-18T16:09:57.000Z": "Eligible small businesses with one to 50 employees can apply for grants beginning at noon MT (TODAY), May 18, 2020. Application and eligibility information is available at Idaho Rebounds: Our Path to Prosperity Idaho's rebound from COVID-19 and our path to prosperity start with employee and consumer confidence, which leads into business stability and growth, and eventually promotion and attraction. rebound.idaho.gov", "2020-05-18T16:06:27.000Z": "Idaho's restaurant dining rooms are now open under Stage 2 of Idaho Rebounds. Thank you @AbracadabrasIF for the delicious breakfast!", "2020-05-15T23:26:50.000Z": ". @SBAgov , in consultation with @USTreasury , has released the Paycheck Protection Program Loan Forgiveness Application along with detailed instructions. See them here: https:// home.treasury.gov/news/press-rel eases/sm1010 ", "2020-05-15T23:39:09.000Z": ". @SBAgov and Treasury release Paycheck Protection Program loan forgiveness application: https:// home.treasury.gov/news/press-rel eases/sm1010 ", "2020-05-18T14:00:01.000Z": "Congratulations to the class of 2020!", "2020-05-16T15:11:14.000Z": "Our local journalists have worked tirelessly though this pandemic to provide the public with up-to-date and accurate information. Thank you for keeping Idaho informed!", "2020-05-15T18:35:22.000Z": "", "2020-05-10T14:00:01.000Z": "This week, we honor, remember, and celebrate American Law Enforcement. Thank you, Idaho officers! #NationalPoliceWeek", "2020-05-15T16:50:12.000Z": "Thank you to Idaho's medical workers, first responders, and all essential workers! I had the opportunity to send off two 124th Fighter Wing A-10 Thunderbolt IIs to join two F-15Es to perform a flyover over 11 Idaho cities to thank essential workers around the state!", "2020-05-14T22:06:07.000Z": "The Idaho Fish and Game Commission approved resuming sales of nonresident licenses, tags, and permits, which will be available for sale on May 16 at 10 a.m. MDT. The following media includes potentially sensitive content. Change settings View", "2020-05-14T21:00:00.000Z": "Idaho small businesses can obtain a 30-day supply of PPE for their employees and patrons at http:// supplies.idaho.gov . #IdahoCOVID19 Masks Gloves Sanitizer Sourcing Program supplies.idaho.gov", "2020-05-14T20:51:48.000Z": "Idaho is leading the country in its support of small businesses during the COVID-19 pandemic. This week, Idaho small businesses started applying for the Idaho Rebound cash grants. $300 million is available to small businesses in direct cash support - more than any other state!", "2020-05-14T20:47:55.000Z": "Idaho has met the criteria to enter Stage 2 on Saturday. Additional details are available at http:// rebound.idaho.gov . Idaho Rebounds: Our Path to Prosperity Idaho's rebound from COVID-19 and our path to prosperity start with employee and consumer confidence, which leads into business stability and growth, and eventually promotion and attraction. rebound.idaho.gov", "2020-05-14T18:23:30.000Z": "Idaho Sees 5,795 New Weekly Initial Claims Because of COVID-19 Idaho Sees 5,795 New Weekly Initial Claims Because of COVID-19 NEWS RELEASE For Immediate Release: May 14, 2020 Information Contact: Craig Shaul, (208) 332-3570 ext. 3201 or Salvador Vazquez, (208) 332-3570 ext. 3218 Initial claims reached 5,795 during the wee idahoatwork.com", "2020-05-14T18:59:45.000Z": "NOW: Watch @GovernorLittle 's LIVE press conference here: https:// facebook.com/idahoptv/ or here: https:// idahoptv.org/shows/idahoins ession/governor/   #IdahoCovid19 Idaho in Session Governor House and Senate sessions, committee meetings, court hearings, and more live streamed from all three branches of Idaho's government. idahoptv.org", "2020-05-14T15:39:37.000Z": "I will hold a press conference regarding Stage 2 of Idaho Rebounds at 1 p.m. Mountain Time. Watch live here: Idaho in Session Governor House and Senate sessions, committee meetings, court hearings, and more live streamed from all three branches of Idaho's government. idahoptv.org", "2020-05-13T21:27:53.000Z": "On Friday morning, keep your eye out for a flyover of southern Idaho from @366FW and @124FighterWing in honor of Idaho's first responders. See the flight path below. #AirForceSalutes", "2020-05-12T16:00:00.000Z": "On Thursday, @GovernorLittle will hold a press conference on Stage Two of the four-phase plan to reopen Idaho. Later that night, Little will return to @IdahoPTV for another live Q&A. Submit your questions for the governor and his team at http:// idahoptv.org/idahoreports . #IdahoCOVID19 Idaho Reports Idaho Reports - The West's longest running legislative program has a storied history that dates back almost four decades. idahoptv.org", "2020-05-12T17:02:06.000Z": "#Idaho Governor Brad Little (R) says his state's reopening plan is largely based on feedback from constituents who want their businesses fully open! Should other states follow Idaho's lead? #Idaho  #Economy  #Jobs  #Coronavirus  #VarneyCo", "2020-05-12T16:37:00.000Z": "Idaho is distributing $300 million to small businesses impacted by COVID-19. More information on the grants and Idaho's plan to rebound is available at http:// Rebound.Idaho.Gov . Idaho governor on coronavirus funding: Hope to have money to small... Gov. Brad Little, R-Idaho, on the state giving $300 million to 30,000 small businesses impacted by the coronavirus and how they plan to reopen. video.foxbusiness.com", "2020-05-12T14:26:25.000Z": "Join us LIVE today at noon MST with @GovernorLittle and Director Jeppesen of @IDHW as they continue to update Idahoans and answer questions on #COVID19 . Join the conversation here: https:// states.aarp.org/idaho/live-coronavirus-updates-with-governor-little-every-tuesday-at-noon-mst   #idleg  @IdahoStatesman  @IdahoStateJ  @twinfallstn  @KTVB  @TheIdahoPress", "2020-05-12T15:05:16.000Z": "Join @AARPIdaho LIVE today at Noon MST as DHW Director Dave Jeppesen and @GovernorLittle answer your COVID-19 questions. Join the conversation here: https:// states.aarp.org/idaho/live-coronavirus-updates-with-governor-little-every-tuesday-at-noon-mst   #IdahoCOVID19 Live Coronavirus Updates with Governor Little Every Tuesday at Noon MDT GOVERNOR LITTLE AND AARP IDAHO WILL HOLD CORONAVIRUS TOWN HALL UPDATES EVERY TUESDAY THROUGH JUNE states.aarp.org", "2020-05-12T12:00:01.000Z": "I am happy to proclaim May 12 as Nurses Day in Idaho. Thank you to these dedicated health care workers!", "2020-05-11T23:21:22.000Z": "Thyra was a diligent legislator and, simply put, a really nice person. Thyra knew her constituents well and served her district, state, and country with distinction. My condolences to Thyra's loved ones and colleagues. She will be deeply missed. Rep. Thyra Stevenson dies, one week after suffering heart attack Idaho state Rep. Thyra Stevenson died this morning, a week after suffering a serious heart attack. lmtribune.com", "2020-05-11T20:16:52.000Z": "We join Governor Little thanking law enforcement officers across our state for the work they do serving Idahoans. #NationalPoliceWeek Quote Tweet Brad Little @GovernorLittle This week, we honor, remember, and celebrate American Law Enforcement. Thank you, Idaho officers! #NationalPoliceWeek", "2020-05-11T16:48:55.000Z": "Labor Begins Making Pandemic Unemployment Assistance Payments Labor Begins Making Pandemic Unemployment Assistance Payments NEWS RELEASE For Immediate Release: May 11, 2020 Information Contact: Georgia Smith, (208) 332-3570 ext. 2102 The Idaho Department of Labor is now making payments for the Pandemic Unemployment Assi idahoatwork.com", "2020-05-11T16:14:18.000Z": "Idaho is making $300 million in grants available to Idaho small businesses impacted by COVID-19. Eligible small businesses with 1 to 19 employees may start applying at noon MT today, May 11, 2020. For eligibility and process to apply, go to https:// rebound.idaho.gov/idaho-rebound- cash-grants-for-small-businesses ", "2020-05-11T16:16:02.000Z": "President Trump, Vice President Pence, and White House officials have highlighted Idaho as an example for other states to follow in our staged approach to reopening. Office of the Governor gov.idaho.gov", "2020-05-11T15:40:00.000Z": "The generous spirit of Idahoans never ceases to amaze me! Thank you to all who donated during #IdahoGives ! Idaho Gives 2020 donations set new record BOISE - Although it looked a little different this year, Idaho's annual nonprofit fundraiser didn't miss a step. idahopress.com", "2020-05-08T21:39:09.000Z": "I've made my #DoSomethingGood donations to: \n\nGem County Senior Center\nEmmett Valley Friendship Coalition  \nFaces of Hope\nICF Covid-19 fund  \nIBE -- Internet connectivity fund\nValor Health in Emmett\nand the American Red Cross! \n\nThanks for the nomination, @TommyAhlquist ! Quote Tweet Don Day @DonLDay So many leaders jumping on this! @SaintAlsHealth 's challenge spreads to @StLukesHealth 's Chris Roth, @RegenceIdaho 's @seanmrobbins , @WestValleyMed 's Betsy Hunsicker, @SimplotCompany 's Garrett Lofto, @bvadev 's @TommyAhlquist , more: #Idaho  #DoSomethingGood  https:// boisedev.com/news/2020/05/0 4/do-something-good-local-leaders-carry-out-acts-of-kindness-help-charities-and-challenge-others/ ", "2020-05-08T19:37:52.000Z": "We're making $300 million available to the smallest of Idaho businesses hit hard by COVID-19. Application period starts Monday, May 11. For eligibility and process to apply, go to https:// rebound.idaho.gov/idaho-rebound- cash-grants-for-small-businesses/  .", "2020-05-08T16:00:54.000Z": "Gov Little Discusses Rebound Idaho Grants Mat Erpelding @erpforidaho Gov Little Discusses Rebound Idaho Grants pscp.tv", "2020-05-08T16:00:00.000Z": "Buy Idaho Day is May 9. Look for the Buy Idaho Day specials posted on social media by following #BuyIdaho , and look for the Buy Idaho logo on products when you shop. Buying Idaho builds Idaho! Buy Idaho Day is May 9 Buy Idaho Day is May 9. Look for the Buy Idaho Day specials posted on social media by following #BuyIdaho and look for the Buy Idaho logo on products when yo... youtube.com", "2020-05-07T22:02:08.000Z": "We will vigorously litigate the Ninth Circuit's unprecedented ruling at the Supreme Court because the taxpayers of Idaho should not have to pay for a procedure that is not medically necessary. Office of the Governor gov.idaho.gov", "2020-05-07T17:41:52.000Z": "As the weather warms and Idaho begins to rebound from COVID-19 please remember that close to home recreation still requires social distancing at the trailhead, the boat ramp, and in nature's open landscapes. @GovernorLittle  #RecreateResponsiblyIdaho  #socialdistancing The following media includes potentially sensitive content. Change settings View", "2020-05-07T16:28:14.000Z": "Add Asian giant hornets to the list of things NOT to worry about right now. As of May 7, Idaho has no confirmed reports of Asian giant hornets in the state. Only two specimens have ever been collected in the United States - both in northwest Washington. Idaho Agriculture: No confirmed reports of 'murder hornets' found in state The news of \"murder hornets\" being found in Washington state has spread through the U. S. The Idaho State Department of Agriculture gave an update Thursday saying there have been no confirmed reports... idahonews.com", "2020-05-06T21:25:36.000Z": "As our residents are returning to their places of work, I want to make sure they have consistent care for their children. The new Idaho Child Care Emergency Grants not only help working parents,  but they also help the owners of these small businesses. Office of the Governor gov.idaho.gov", "2020-05-06T21:24:08.000Z": "Protocols are now available for indoor gym and recreational facilities managers to implement in order to open in stage 2 of the Idaho Rebounds plan. #idahocovid19 Idaho Rebounds: Our Path to Prosperity Idaho's rebound from COVID-19 and our path to prosperity start with employee and consumer confidence, which leads into business stability and growth, and eventually promotion and attraction. rebound.idaho.gov", "2020-05-06T18:23:39.000Z": "Join us this Friday at 9:30am as @GovernorLittle will discuss the Idaho Rebounds Small Business Cash Grants. The Governor will provide info about how Idaho small businesses qualify and apply for these incredible grants. Register here https:// boisemetroidcoc.wliinc22.com/events/Governo rLittle%20LIVE%20Idaho%20Rebounds%20Small%20Business%20Cash%20Grants%20-7739/details   #BoiseChamber", "2020-05-06T18:25:59.000Z": "Very proud to have such an important resource for our community co-located on the @INL site. Regional entities can use this @Battelle Critical Care Decontamination System to decontaminate up to 80,000 N95-respirators each day! Quote Tweet Brad Little @GovernorLittle Battelle's Critical Care Decontamination System (CCDS) is now up and running in Idaho! The CCDS can decontaminate 80,000 N95 masks a day -- and is free to use! https:// youtube.com/watch?time_con tinue=4&v=ziag4jkUiFw&feature=emb_logo  Show this thread", "2020-05-06T17:49:36.000Z": "Entities can request Battelle CCDS services here: Covid Response Contact us to see how Battelle can help you with your needs. battelle.org", "2020-05-06T17:49:14.000Z": "Battelle's Critical Care Decontamination System (CCDS) is now up and running in Idaho! The CCDS can decontaminate 80,000 N95 masks a day -- and is free to use! Battelle CCDS Critical Care Decontamination System™ The Battelle CCDS Critical Care Decontamination System™ addresses the current shortage of critical Personal Protective Equipment (PPE) across the United Stat... youtube.com", "2020-05-06T17:05:00.000Z": "Tune to #IdahoMatters at noon for an interview with @GovernorLittle . \n\nThen, health officials from @StLukesHealth and @SaintAlsHealth will answer your #IdahoCOVID19 questions.\n\nStream at 12: http:// bit.ly/2SiTuFS", "2020-05-05T23:05:32.000Z": "Idaho is reporting 2,127 cases of #IdahoCovid19 (including 21 new) and 65 deaths to date. NEW TODAY: data on positive tests, by week. Updated numbers at https:// coronavirus.idaho.gov  #staysafestayhealthy Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-05-05T23:05:41.000Z": "General and business-specific protocols for opening are available. Additional business-specific protocols will be added. Available now:\n\nGeneral Business\nDaycare\nYouth Activities\nPlaces of Worship\nRestaurants\nGeneral Business\nClose Contact Services Idaho Rebounds: Our Path to Prosperity Idaho's rebound from COVID-19 and our path to prosperity start with employee and consumer confidence, which leads into business stability and growth, and eventually promotion and attraction. rebound.idaho.gov", "2020-05-05T16:54:49.000Z": "On National Teacher Day, we recognize the women and men who dedicate their lives to instilling character, integrity, and knowledge in the hearts and minds of our students. Thank you for all you do!", "2020-05-05T16:45:00.000Z": "All eligibility criteria, information on how to apply along with instructions on how to gain a TAP account are available at Idaho Rebounds: Our Path to Prosperity Idaho's rebound from COVID-19 and our path to prosperity start with employee and consumer confidence, which leads into business stability and growth, and eventually promotion and attraction. rebound.idaho.gov", "2020-05-05T16:44:42.000Z": "$300 million in cash grants will be made available to Idaho small businesses impacted by COVID-19.\nEligible entities with one to 19 employees may apply starting at noon MDT on May 11. Idaho Rebound Grants #AmGrad Governor Brad Little designated $300 million dollars from the CARES Act funds to aid small businesses in Idaho with grants for up to $10,000. youtube.com", "2020-05-05T14:50:16.000Z": "As Idaho begins to reopen, get new info. and learn  from @GovernorLittle and Director Dave Jeppeson of @IDHW today as they answer questions LIVE at noon on #coronavirus . Join the call here: https:// states.aarp.org/idaho/live-coronavirus-updates-with-governor-little-every-tuesday-at-noon-mst?cmp=SNO-ID-FB&socialid=3301232287   @IdahoStatesman , @KBOI670 , @twinfallstn , @IdahoStateJ , @KMVTNews , Live Coronavirus Updates with Governor Little Every Tuesday at Noon MDT GOVERNOR LITTLE AND AARP IDAHO WILL HOLD CORONAVIRUS TOWN HALL UPDATES EVERY TUESDAY THROUGH JUNE states.aarp.org", "2020-05-05T15:25:51.000Z": "The Next Steps Idaho website is geared specifically for students, enabling them to learn about college and career options, and apply for college and financial aid. Check it out at https:// nextsteps.idaho.gov  #IDEdu", "2020-05-04T23:09:57.000Z": "Idaho is reporting 2,106 cases of #IdahoCovid19 (including 27 new) and 64 deaths to date. Updated numbers at https:// coronavirus.idaho.gov  #staysafestayhealthy Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-05-04T17:30:01.000Z": "I join many in recognizing his contributions to our state with gratitude. My condolences to John's family and the many Idahoans who will miss him. John Freemuth, Boise State professor and expert on public lands policy, has died at 69 \"I have so much to thank John for, and I really believe that so many of us in this community and at the university and in the state feel the same,\" said Boise Mayor Lauren McLean, who studied under... idahostatesman.com", "2020-05-04T17:29:44.000Z": "John's sudden death is a tragic loss not just for his loved ones and colleagues, but for all of Idaho. John was one-of-a-kind. He had a unique way of perceiving and bringing resolution to the diversity of opinion around public lands policy.", "2020-05-04T16:36:55.000Z": "The Idaho Commission on the Arts is seeking nominations for the 2020 Governor's Awards in the Arts. More on how to nominate is available here: https:// arts.idaho.gov/governors-awar ds-arts-nomination/ ", "2020-05-02T00:07:06.000Z": "Little said during a visit to Twin Falls that he's \"incredibly sympathetic\" to people in those industries that must remain closed. Gov. Little 'cautiously optimistic' during visit as businesses reopen in Twin Falls Little said during a visit to Twin Falls that he's \"incredibly sympathetic\" to people in those industries that must remain closed. magicvalley.com", "2020-05-02T00:34:14.000Z": "Gov. Little interview: Unemployment, evictions, events, small biz program and 'reopening day' visits #BoiseDev  https:// boisedev.com/2020/05/01/ida ho-gov-brad-little-reopening/ ", "2020-05-02T00:25:00.000Z": "Little visits downtown Idaho Falls toy store to mark 1st day of reopening https:// postregister.com/news/governmen t/little-visits-downtown-idaho-falls-toy-store-to-mark-1st-day-of-reopening/article_81ddbdc6-89ed-5495-89d6-f58e31c8bfe9.html?utm_medium=social&utm_source=twitter&utm_campaign=user-share  via @thepostregister  #idpol  #COVID19  #idahoCovid19 Little visits downtown Idaho Falls toy store to mark 1st day of reopening Weebee's Toys - and likely thousands more businesses across Idaho - turned on the \"open\" sign again Friday for the first time in more than a month. postregister.com", "2020-05-01T17:13:44.000Z": "If you missed last night's live @IdahoReports Q&A with @GovernorLittle and Idaho Dept of Health and Welfare Director Dave Jeppesen, discussing the first stage of the state's economic rebound plan, stream it here: https:// video.idahoptv.org/video/idaho-re ports-coronavirus-special-april-30-bu8pno/   #IdahoCovid19  #idpol  @IDHW Idaho Reports | Idaho Reports Coronavirus Special: April 30 Gov. Brad Little and Health & Welfare Dir. Dave Jeppesen detail re-opening plan Stage 1. video.idahoptv.org", "2020-05-01T22:14:09.000Z": "Businesses around the state reopen to in-store customers today. Thank you to everyone for complying with the Stay-Home Order and continuing to protect your friends and neighbors by following social distancing guidelines!", "2020-05-01T21:29:48.000Z": ". @GovernorLittle visiting @LitandCoCandles in #Boise . The business will open tomorrow. #idpol  #boisedev", "2020-05-01T14:53:05.000Z": "May is Teacher Appreciation Month. Let's recognize excellent educators and the amazing work they do. I have seen firsthand, through the many teachers I have had, known and met with over the years, how deeply they care for their students. #SendTeachersLove", "2020-05-01T16:44:30.000Z": "In case you missed it: Idaho State Laboratory Director Dr. Christopher Ball discusses testing in Idaho for COVID-19 on FB Live. #DHWcares  #staysafestayhealthy  #IdahoCOVID19  https:// facebook.com/pg/IdahoHealth andWelfare/videos/ ", "2020-05-01T12:00:00.000Z": "May is Mental Health Awareness Month in Idaho. I want to encourage Idahoans to pursue mental health treatment if they need it, provide educated support to struggling loved ones, and offer acceptance of our neighbors living with mental health conditions. May is Mental Health Awareness Month in Idaho Governor Brad Little has declared May 2020 as Mental Health Awareness Month in Idaho. youtube.com", "2020-05-01T01:57:42.000Z": "Tune in here, live at 8pm MT/7pm PT. #IdahoCOVID19 Idaho Reports: Coronavirus Q&A (April 30, 2020) Idaho Reports sits down with Gov. Brad Little, and Dir. Dave Jeppesen with Idaho Health and Welfare tonight for a Coronavirus Q&A. Watch it live over the... facebook.com", "2020-04-30T23:57:56.000Z": "It is important for people in these areas to assume coronavirus is already circulating in those communities and to take the recommended precautions so we can continue to reopen our economy and protect lives. Stay safe!", "2020-04-30T23:57:43.000Z": "Community spread has not occurred in public health district 2 (north central Idaho) as I stated earlier today. I apologize for the confusion.", "2020-04-30T23:57:15.000Z": "Community spread has been confirmed in 17 counties -- Ada, Bannock, Bingham, Bonneville, Blaine, Canyon, Elmore, Gem, Jefferson, Jerome, Kootenai, Lemhi, Madison, Owyhee, Payette, Teton, and Twin Falls counties.", "2020-04-30T23:06:34.000Z": "Idaho is reporting 2,015 cases of #IdahoCovid19 (including 31 new) and 63 deaths to date. Updated numbers at Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-30T20:42:00.000Z": "Labor Ready to Accept Applications for Extended Unemployment Insurance Benefits Labor Ready to Accept Applications for Extended Unemployment Insurance Benefits NEWS RELEASE For Immediate Release: April 30, 2020 Information Contact: Georgia Smith, (208) 332-3570 ext. 2102 Idahoans who are out of work and have exhausted regular unemployment insurance benefi idahoatwork.com", "2020-04-30T18:54:46.000Z": "TONIGHT AT 8pm MT / 7pm PT, LIVE @IdahoReports Q&A with @GovernorLittle . We'll ask viewer-submitted questions. To submit a question before broadcast, go here https:// idahoptv.org/shows/idahorep orts/  and click SUBMIT QUESTION. #idahoCovid19  #idpol", "2020-04-30T17:52:07.000Z": "More than 30,000 Idaho small businesses will receive Idaho Rebound cash grants, a $300 million investment in small businesses. No other state is putting up a larger amount from the Coronavirus Relief Fund to help small businesses with cash support! Office of the Governor gov.idaho.gov", "2020-04-30T17:39:13.000Z": "Governor Brad Little announced plans today for more than 30,000 Idaho small businesses to receive Idaho Rebound cash grants, a $300 million investment in Idaho's small business employers. Idaho Rebounds: Our Path to Prosperity Idaho's rebound from COVID-19 and our path to prosperity start with employee and consumer confidence, which leads into business stability and growth, and eventually promotion and attraction. rebound.idaho.gov", "2020-04-30T17:30:13.000Z": ". @GovernorLittle announced $300M will be available to small businesses through state grants. A biz could get $10,000.", "2020-04-30T16:48:26.000Z": "11 AM TODAY, 4/30: Stream @GovernorLittle 's press conference LIVE here: https:// facebook.com/idahoptv  #IdahoCovid19  #idpol", "2020-04-30T14:58:30.000Z": "Reminder: Governor Brad Little will hold a press conference today at 11 am MT. The Governor will update Idahoans on Idaho Rebounds: Stage 1. The press conference will be live on Idaho Public Television. #staysafe  #DHWcares  #IdahoCOVID19 Idaho Rebounds: Our Path to Prosperity Idaho's rebound from COVID-19 and our path to prosperity start with employee and consumer confidence, which leads into business stability and growth, and eventually promotion and attraction. rebound.idaho.gov", "2020-04-30T13:30:00.000Z": "In an 11am press conference, @GovernorLittle is expected to announce whether the criteria have been met for the state to enter Stage 1 of his \"Idaho Rebounds\" economic plan. Here's what that guidance means for individuals, employers, and churches. #IdahoCOVID19  #idpol", "2020-04-29T14:45:07.000Z": "Via @GovernorLittle : \"Take advantage of every opportunity to share love with your family and friends; be it by phone call, letter, email, text or video chat.\" \n\nThe latest newsletter from Idaho's First Lady is available here: http:// gov.idaho.gov/wp-content/upl oads/sites/74/2020/04/2020-0427-fl-covid19-message.pdf ", "2020-04-29T14:55:45.000Z": "Specific Stage 1 Protocols for opening daycares, youth activities, and places of worship were just added this morning. You can find them here: Idaho Rebounds: Our Path to Prosperity Idaho's rebound from COVID-19 and our path to prosperity start with employee and consumer confidence, which leads into business stability and growth, and eventually promotion and attraction. rebound.idaho.gov", "2020-04-28T18:10:02.000Z": "LIVE with @GovernorLittle and Director Jeppeson of @IDHW : 1,917 recorded positive #COVID19 cases. Apx. 1,000 recoveries from #COVID19 . 58 deaths. Over 20,000 tested, most from commercial labs. #idleg", "2020-04-28T14:11:59.000Z": "Call in today (4/28) to listen or ask questions LIVE at 12 pm MST to @GovernorLittle , and Director Dave Jeppeson of @IDHW while they discuss and answer questions on #COVID19 . #idleg Info. here: https:// states.aarp.org/idaho/live-coronavirus-updates-with-governor-little-every-tuesday-at-noon-mst ", "2020-04-27T21:27:53.000Z": "Nominate a special Idaho teacher for Idaho's top teaching honor, Idaho Teacher of the Year!\n\nGo to http:// sde.idaho.gov/toy The nomination deadline is May 11th! Quote Tweet Idaho Dept of Ed @IdahoSDE Who is the Idaho #teacher that has been a beacon of light in this difficult time? Nominate a special teacher for Idaho's top #teaching honor, #Idaho Teacher of the Year! http:// sde.idaho.gov/toy (Nomination deadline is May 11) #idedu  #idaho  #idahome", "2020-04-28T02:45:06.000Z": "\"Take advantage of every opportunity to share love with your family and friends; be it by phone call, letter, email, text or video chat.\" \n\nThe latest newsletter from Idaho's First Lady is available here: http:// gov.idaho.gov/wp-content/upl oads/sites/74/2020/04/2020-0427-fl-covid19-message.pdf ", "2020-04-27T23:06:33.000Z": "Idaho is reporting 1,917 cases of #IdahoCovid19 (including 20 new) and 58 deaths to date. Updated numbers at Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-27T20:08:29.000Z": "Through intelligent forest management, smart business practices, and generosity to their community, Idaho Forest Group helps Idaho Rebound from the COVID-19 pandemic. Idaho Forest Group helps Idaho Rebound from COVID-19 Though intelligent forest management, smart business practices, and generosity to their community, Idaho Forest Group helps Idaho Rebound from the COVID-19 p... youtube.com", "2020-04-27T14:49:08.000Z": "Idaho had over 13,000 approved loans for a total of $1,850,034,026 before #PPP funding ran out. PPP applications are now re-open. Apply quickly as possible to help employees of small businesses keep their jobs and collect a paycheck. Paycheck Protection Program An SBA loan that helps businesses keep their workforce employed during the Coronavirus (COVID-19) crisis. sba.gov", "2020-04-25T20:05:00.000Z": "Like countless family-owned restaurants all over America, Boise's Meraki Greek Street Food saw a sharp drop in sales with the statewide stay-at-home order.\n\nThey're staying afloat with a $43,000 loan through PPP! 'It was really quick': Boise eatery shares experience of getting a small business loan to keep... Meraki Greek Street Food was approved for a small business loan through the federal government's stimulus program. The owners say it was a pretty simple process. ktvb.com", "2020-04-25T02:30:00.000Z": "Though a stop in Coeur d'Alene to help the school district hand out free lunches wasn't \"part of (the) plan 80 days ago,\" Idaho Gov. Brad Little made the most of it on Friday. Idaho Gov. Brad Little helps Coeur d'Alene schools distribute free lunches Idaho Gov. Brad Little made the most of his stop in Coeur d'Alene on Friday, distributing free lunches with the school district and offering words of encouragement for his plan to reopen the state... spokesman.com", "2020-04-25T15:43:42.000Z": "ICYMI: Gov. Brad Little hands out meals, buys lunch, coffee, and visits downtown shop Gov. Brad Little hands out meals, buys lunch, coffee, and visits downtown shop Gov. Brad Little hands out meals, buys lunch, coffee, and visits downtown shop cdapress.com", "2020-04-25T00:32:29.000Z": "Governor Brad Little issued two new proclamations this week - one extending his previous declarations for a disaster emergency and extreme emergency for the State of Idaho due to COVID-19 and another waiving additional regulations. Office of the Governor gov.idaho.gov", "2020-04-24T20:41:29.000Z": "How do you #SupportLocalGems ? Thanks to CDA businesses Vault Coffee and Rustic for curbside service and takeout service!", "2020-04-24T19:49:27.000Z": "Our new Testing Task Force will set criteria for when and how frequently someone should be tested and how to move toward a common reporting platform across the state. Office of the Governor gov.idaho.gov", "2020-04-24T15:30:00.000Z": "Last night, @aaronkunz was joined by @GovernorLittle and @IdahoPower CEO Darrel Anderson - leader of the Gov's new Economic Rebound Advisory Committee - to answer questions on the four-stage plan to reopen the state economy. #IdahoCOVID19  #idpol  @IdahoPTV  https:// video.idahoptv.org/video/idaho-re ports-coronavirus-special-april-23-k7bhlm/ ", "2020-04-24T19:16:16.000Z": "Guidelines for Opening Up Idaho: DHW Director Dave Jeppesen outlines the transition from response to rebound https:// dhwblog.com/2020/04/24/gui delines-for-opening-up-idaho-dhw-director-dave-jeppesen-outlines-the-transition-from-response-to-rebound/  via @IDHW Guidelines for Opening Up Idaho: DHW Director Dave Jeppesen outlines the transition from response... Gov. Brad Little unveiled his Path to Prosperity, Guidelines for Opening Up Idaho, at a press conference yesterday. The document outlines a staged approach to getting our economy moving and getting dhwblog.com", "2020-04-24T19:06:21.000Z": ". @GovernorLittle is handing out lunches to @CdaSchools families at the Kroc Center right now. #cdaid", "2020-04-24T18:08:40.000Z": "Labor Begins Making Payments for Federal Pandemic Unemployment Compensation Labor Begins Making Payments for Federal Pandemic Unemployment Compensation NEWS RELEASE For Immediate Release: April 24, 2020 Information Contact: Georgia Smith, (208) 332-3570 ext. 2102 The Idaho Department of Labor has begun making more than $63 million in payments for  idahoatwork.com", "2020-04-24T18:36:33.000Z": "This #ArborDay I had the chance to tour Idaho Forest Group's Chilco Mill. Idaho's loggers, haulers, millers and foresters contribute greatly to our communities and economy while promoting forest health for a sustainable future.", "2020-04-23T23:33:46.000Z": "#supportlocalgems kicks off tomorrow! Make plans to shop small and support local Idaho businesses. If your financial situation allows, consider buying a gift card, ordering take-out, or simply thanking the businesses that make Idaho great. Learn more at https:// visitidaho.org/local-gems/", "2020-04-24T02:25:47.000Z": "Thank you! Keep up the good work in helping students and families through this challenging time. Quote Tweet IdahoEducationAssoc @IdahoEA The Idaho Education Association supports and commends @GovernorLittle for making the health and safety of Idaho citizens his top priority during the COVID-19 public health crisis.", "2020-04-24T00:14:00.000Z": "TONIGHT: @GovernorLittle will answer questions about COVID-19 in Idaho LIVE on Idaho Public Television at 8 p.m., broadcast and online. Idaho in Session Governor House and Senate sessions, committee meetings, court hearings, and more live streamed from all three branches of Idaho's government. idahoptv.org", "2020-04-23T23:07:50.000Z": "Thank you to @VP and the @WhiteHouse for recognizing Idaho's efforts to Rebound from COVID-19. #IdahoCOVID19  https:// rebound.idaho.gov", "2020-04-23T18:19:20.000Z": "Idaho's rebound from COVID-19 and our path to prosperity start with employee and consumer confidence, which leads into business stability and growth, and eventually promotion and attraction. Idaho Rebounds: Our Path to Prosperity Idaho's rebound from COVID-19 and our path to prosperity start with employee and consumer confidence, which leads into business stability and growth, and eventually promotion and attraction. rebound.idaho.gov", "2020-04-23T15:40:18.000Z": "I will host a press conference regarding economic recovery in Idaho at 11 a.m MT 4/23. Stream it here: Idaho in Session Governor House and Senate sessions, committee meetings, court hearings, and more live streamed from all three branches of Idaho's government. idahoptv.org", "2020-04-22T20:26:38.000Z": "If you are waiting for your Economic Impact Payment, don't panic. The IRS is delivering them as fast as possible to millions of eligible Americans. \nIf you have questions see: http:// IRS.gov/EIPpartners", "2020-04-22T17:10:13.000Z": "It's great to get outdoors on the 50th anniversary of Earth Day, but remember to check before you go to ensure access to where you want to be. Don't wait until you get to your destination to find out it may be closed. #checkbeforeyougo  #RecreateResponsiblyIdaho  @GovernorLittle", "2020-04-22T16:15:00.000Z": "Support essential workers on the highway by wearing yellow today. It's National Work Zone Awareness Week and a good time to remember as we drive to get groceries and other essential items to slow down in any work zones. #NWZAW2020  #SafeWorkZonesForAll", "2020-04-22T15:02:23.000Z": "Coming up at 10 a.m. today -- deputy state epidemiologist Dr. Kathryn Turner will discuss the dashboard of COVID-19-related data at https:// coronavirus.idaho.gov . Watch it live here: https:// facebook.com/IdahoHealthand Welfare/  Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-21T14:28:24.000Z": "Join us today LIVE at 12 pm MST to listen to @GovernorLittle ,  as he answers questions and discusses #COVID19 . #idleg Listen or call in here with your questions: https:// states.aarp.org/idaho/live-coronavirus-updates-with-governor-little-every-tuesday-at-noon-mst ", "2020-04-21T15:05:12.000Z": "#SupportLocalGems this Friday. Here's how:", "2020-04-20T23:13:49.000Z": "Idaho is reporting 1,736 cases of #IdahoCovid19 (including 64 new) and 48 deaths to date. Updated numbers at Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-20T21:38:18.000Z": "The May 19 Primary Election will look a little different this year. Your mail box will also be your ballot box. For more information visit http:// IdahoVotes.Gov . A reminder from Governor Brad Little about the May 19 Primary Election Governor Brad Little and Secretary of State Lawerence Denney announced there will be no change in Idaho's primary election date of May 19. The election will ... youtube.com", "2020-04-20T19:52:30.000Z": "Call in tomorrow (4/21) to listen LIVE at 12 pm MST to @GovernorLittle , Idaho health officials, and AARP Idaho as we answer questions and discuss #COVID19 . @IdahoStatesman  @IdahoNews6  @KTVB  @TheIdahoPress  #idleg Info. here: Live Coronavirus Updates with Governor Little Every Tuesday at Noon MDT GOVERNOR LITTLE AND AARP IDAHO WILL HOLD CORONAVIRUS TOWN HALL UPDATES EVERY TUESDAY THROUGH JUNE states.aarp.org", "2020-04-20T20:06:08.000Z": "News release:  Short-term health insurance plans join\nACA plans in COVID-19 testing and treatment\n\nLINK to full news release: https:// doi.idaho.gov/DisplayPDF?Id= 7777&url=   #COVID19Idaho  #IdahoCOVID19  #IdahoInsurance  #InsuranceIdaho", "2020-04-20T17:13:21.000Z": "On Friday, April 24th, 2020, Idahoans are invited to Support Local Gems by giving their business to their favorite local shops and restaurants. #SupportLocalGems Risch and Idaho Commerce Announce Event to Support Small Businesses during the COVID-19 Outbreak BOISE, Idaho - Today, U.S. Senator for Idaho Jim Risch and the Idaho Department of Commerce announced the creation of \"Support Local Gems,\" which will serve as an all-day event to support Idaho small... risch.senate.gov", "2020-04-20T18:06:37.000Z": "Due to the state of emergency in Idaho regarding the coronavirus, the May 19 Primary Election will be held entirely by absentee ballot. Start your absentee ballot request today! https:// idahovotes.gov", "2020-04-20T16:45:35.000Z": "Did you know small businesses employ the majority of Idaho's private sector workforce? Support local jobs and #SupportLocalGems on Friday, April 24th by shopping online, giving a gift card, or saying thank you to your favorite neighborhood spots. Quote Tweet Jim Risch @SenatorRisch #SupportLocalGems is an opportunity to shop small and find ways to support local Idaho businesses. Purchase a gift card, order take-out, leave a positive review, or say thank you to the businesses that make Idaho great. https:// risch.senate.gov/public/index.c fm/2020/4/risch-and-idaho-commerce-announce-event-to-support-small-businesses-during-the-covid-19-outbreak  Show this thread", "2020-04-18T15:39:36.000Z": "Idaho is one of the states best positioned for reopening thanks to the steps we have taken so far! Which US states are ready for phase 1 of reopening after coronavirus lockdown? Some states are starting to plan for a return to normalcy, though many are in no rush to do so. foxnews.com", "2020-04-17T22:37:31.000Z": "@USDA will be providing $19billion to America's farmers and ranchers impacted by COVID-19. Thanks @realDonaldTrump for your unwavering support for Agriculture.", "2020-04-18T00:18:35.000Z": "No one wants to get our economy back up and running as much as I do, but we simply cannot open everything all at once and reverse the good work we have done collectively over the past month to slow the spread of coronavirus. Office of the Governor gov.idaho.gov", "2020-04-17T23:07:53.000Z": "Idaho is reporting 1,655 cases of #IdahoCovid19 (including 46 new) and 43 deaths to date. Updated numbers at Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-17T02:00:49.000Z": "Live on Facebook to answer viewer #IdahoCOVID19 questions with @Governor Little and @IDHW Director Jeppesen: Idaho Reports: Q&A with Governor Little on Coronavirus (April 16,... Idaho Reports sits down with Gov. Brad Little, and IDHW Director Dave Jeppesen tonight for a Coronavirus Q&A. Watch it live over the air on Idaho Public... facebook.com", "2020-04-17T00:40:06.000Z": "The President's newly released guidelines for phased opening of the economy align with Idaho's decisions and actions to overcome coronavirus.", "2020-04-16T20:48:25.000Z": "Watch a live COVID-19 Q&A with Idaho Gov. Brad Little and @IDHW Director Dave Jeppesen at 8 p.m. MDT today on @IdahoPTV . Tune in!", "2020-04-16T23:05:49.000Z": "Idaho is reporting 1,609 cases of #IdahoCovid19 (including 22 new) and 41 deaths to date. Updated numbers at Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-16T20:12:14.000Z": "Those who want to recreate outdoors should consider carefully before traveling outside of their home county while the statewide stay-home order is in place. Information about outdoor recreation opportunities and other information is available at https:// coronavirus.idaho.gov/recreate-respo nsibly/  . Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-16T19:13:41.000Z": "Thank you, @PotlatchDeltic_ ! Quote Tweet PotlatchDeltic @PotlatchDeltic_ Covid-19 is impacting all of us - because so much of our work is centered around rural communities we appreciate how everything, one way or another, is connected. PotlatchDeltic supports the efforts of @GovernorLittle to keep Idahoans safe and flatten the curve.", "2020-04-16T19:11:11.000Z": "Thank you! In your public-facing, critical role, you are putting your own health at risk to ensure essential, life-saving services continue. Quote Tweet Idaho Firefighters Union @ProFFIdaho The Professional Firefighters of Idaho  support the Governor's decision to extend the \"Stay at home order\".  Governor Little, did not make this decision without science-based data. We ask all our members to please continue to support local businesses. https:// twitter.com/GovernorLittle /status/1250487338318225408 ", "2020-04-16T00:57:59.000Z": "SUBMIT QUESTIONS to @GovernorLittle and @IDHW Director Jeppesen for Thursday's LIVE @IdahoReports here: Idaho Reports Idaho Reports - The West's longest running legislative program has a storied history that dates back almost four decades. idahoptv.org", "2020-04-15T22:46:39.000Z": "Model shows continued mitigation will effectively slow the spread of COVID-19 (press release): http:// ow.ly/eoUc50zfqiF", "2020-04-15T18:18:34.000Z": "I announced today that I am extending the statewide stay-home order to April 30, with exceptions for operations of formerly \"non-essential\" businesses, facilities, and services and new restrictions related to nonresident travel into the state.", "2020-04-15T17:04:10.000Z": "Watch live on KTVB Channel 7 or https:// bit.ly/3enV7Mt Quote Tweet Maggie O'Mara @maggieKTVB7 #BREAKING Governor @GovernorLittle says he will extend the stay-at-home order to April 30 with some exceptions. Show this thread", "2020-04-14T19:44:32.000Z": "Today I toured Idaho's PPE stockpile. I'm doing everything I can to secure more personal protective equipment and testing supplies for the people of Idaho. @IdahoOEM  #IdahoCOVID19  https:// gov.idaho.gov/pressrelease/g overnor-little-visits-medical-supplies-stockpile-updates-idaho-on-ppe-levels/ ", "2020-04-14T19:13:13.000Z": "I will host a press conference regarding Idaho's 21-day stay-home order at 11 a.m. on 4/15.", "2020-04-14T17:46:18.000Z": "The American Red Cross is facing a severe blood shortage as many blood drives have been cancelled across the country due to coronavirus concerns. I am calling on Idahoans to make appointments to donate blood as soon as they can. I donated today!", "2020-04-14T17:01:58.000Z": "Join @GovernorLittle , AARP Idaho, and Idaho health experts LIVE today at 11:45 MST for our Telephone Town Hall on #COVID19 . \nListen and call in below: Live Coronavirus Updates with Governor Little Every Tuesday at Noon MDT GOVERNOR LITTLE AND AARP IDAHO WILL HOLD CORONAVIRUS TOWN HALL UPDATES EVERY TUESDAY THROUGH JUNE states.aarp.org", "2020-04-14T12:25:00.000Z": "Idaho @GovernorLittle will hold a press conference tomorrow to address the state's expiring stay-at-home order.\n\nHe's already warned we won't go back to normal, and is also 'begging' the federal government for better coronavirus testing capabilities: Gov. Little 'begging' the federal government for more coronavirus testing capabilities A busy week for Idaho Governor Brad Little started with a video conference with the white house. Tongue in cheek, Little said he is \"begging\" the federal government to increase Idaho's testing... idahonews.com", "2020-04-13T22:55:07.000Z": "I voted! Request your ballot for the May 19 primary election at http:// IdahoVotes.gov !", "2020-04-13T19:17:40.000Z": "State epidemiologist Dr. Christine Hahn has been serving Idaho for nearly a quarter century https:// idahopress.com/coronavirus/st ate-epidemiologist-dr-christine-hahn-has-been-serving-idaho-for-nearly-a-quarter-century/article_d8345133-330e-5388-8e07-af57fdfbe83b.html?utm_medium=social&utm_source=twitter&utm_campaign=user-share  via @theidahopress State epidemiologist Dr. Christine Hahn has been serving Idaho for nearly a quarter century BOISE - Since becoming the Idaho state epidemiologist in 1997, Dr. Christine Hahn has seen a number of public health scares that have kept her pretty busy. idahopress.com", "2020-04-13T17:26:27.000Z": "Labor to Change Phone Availability Times to Help Speed Up Claims Turnaround Labor to Change Phone Availability Times to Help Speed Up Claims Turnaround NEWS RELEASE For Immediate Release: April 13, 2020 Information Contact: Georgia Smith, (208) 332-3570 ext. 2102 The Idaho Department of Labor is adjusting its phone schedule to accept incoming call idahoatwork.com", "2020-04-13T16:36:24.000Z": "There is community spread of COVID-19 in Idaho. Please take the recommended precautions available at https:// cdc.gov/coronavirus/20 19-nCoV/ ", "2020-04-13T16:43:19.000Z": "On a video conference call this morning with the White House - thank you to our federal partners for their swift, decisive actions. A strong response ensures Idahoans can get back to work sooner!", "2020-04-12T21:26:33.000Z": "Have a happy and blessed Easter!", "2020-04-11T23:12:34.000Z": "Idaho is reporting 1,407 cases of #IdahoCOVID19 (including 11 new) and 27 deaths to date. For more up-to-date information, visit Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-10T23:52:49.000Z": "Enjoy the weekend responsibly as we continue to navigate COVID-19. #IdahoCOVID19", "2020-04-10T20:13:15.000Z": "With coronavirus, we must keep our faith as well as keep our distance. Office of the Governor gov.idaho.gov", "2020-04-10T19:10:22.000Z": "It's been a while since I had a lesson on multiplying fractions. Thanks to Ms. Taylor and her 5th grade class from Lake Ridge Elementary in Nampa for allowing me to Zoom into their lesson! Idaho's educators are truly amazing! #IDEdu", "2020-04-10T01:53:31.000Z": "We're live with Idaho @GovernorLittle , @IDHW Director Dave Jeppesen, and @SBAPacificNW Regional Administrator Jeremy Field at 8MT/7PT on @IdahoPTV . #IdahoCOVID19 Idaho Reports: Coronavirus Q&A with Governor Little Idaho Reports sits down with Gov. Brad Little, IDHW Director Dave Jeppesen, and SBA Regional Administrator Jeremy Field tonight for a Coronavirus Q&A.... facebook.com", "2020-04-09T20:25:07.000Z": "Governor Little hands out free sack lunches at Boise school Governor Little hands out free sack lunches at Boise school Idaho school districts are working to make sure children do not go hungry while they are not in class. ktvb.com", "2020-04-09T23:27:48.000Z": "Idaho is reporting 1,353 cases of #IdahoCovid19 (including 134 new) and 24 deaths to date. Updated numbers at Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-09T23:00:00.000Z": "I ask Idaho to unite in prayer for those facing hardships due to COVID-19. Pray for strength for all citizens during this challenging time.", "2020-04-09T22:32:09.000Z": ". @POTUS approval of @GovernorLittle 's disaster declaration request signals his & @VP 's commitment to Idahoans' safety. The declaration will provide additional resources to help Idaho state, tribal & local governments engage in emergency protective measures to combat #COVID19", "2020-04-09T20:55:21.000Z": "Filing for UI Benefits? Double Check that Website. Filing for UI Benefits? Double Check that Website. NEWS RELEASE For Immediate Release: April 9, 2020 Information Contact: Georgia Smith, (208) 332-3570 ext. 2102 Beware of Unemployment Insurance Scams Idahoans applying for unemployment insurance fo idahoatwork.com", "2020-04-09T18:07:12.000Z": "Have questions for the Small Business Administration? Jeremy Field of SBA will join Gov. Brad Little and IDHW Director Dave Jeppesen tonight for another coronavirus Q&A. Tune in tonight at 8 pm MT on @IdahoPTV . #IdahoCovid19  #idpol", "2020-04-09T19:26:23.000Z": "Gov. Brad Little and DHW Director Dave Jeppesen will answer viewer questions about COVID-19 at 8 p.m. today on Idaho Public Television. Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-09T19:44:40.000Z": "Thank you to Idaho insurance carriers for stepping up and providing relief and assurance to Idahoans in a time of need. We will get through this together. @RegenceIdaho  @bluecrossidaho Major Idaho insurance carriers waiving COVID-19 treatment costs BOISE - Two major Idaho insurance carriers - Regence and Blue Cross of Idaho - are voluntarily waiving health treatment costs associated with COVID-19, the Idaho Department of Insurance announced idahostatejournal.com", "2020-04-09T18:36:18.000Z": "I had the opportunity to help pack and distribute lunches to families at Morley Nelson Elementary in Boise. Thank you to Idaho's educators across the state for making sure kids keep learning and stay fed during this time! #IdahoCOVID19", "2020-04-08T21:57:38.000Z": "This federal funding must be prudently managed on behalf of all taxpayers. The federal funds will not be used to create new government programs in Idaho, and we will uphold our Constitutional mandate to provide a long-term, structurally balanced budget. Office of the Governor gov.idaho.gov", "2020-04-08T19:48:54.000Z": "We love our state. Observing the statewide stay-home order will help us get back out to enjoy it sooner. #seeyousoonIdaho  #traveltomorrow Visit Idaho. Stay Home. Stay Healthy! youtube.com", "2020-04-08T15:56:24.000Z": "Do you need to go to the grocery store? Here are 5 tips to help you #ShopSafe : 5 Tips to Shop Safe During COVID-19 Retailers are working hard every day to deliver the products families need as Americans stay home to slow the spread of the COVID-19 virus. To encourage safe... youtube.com", "2020-04-07T23:12:48.000Z": "Men and women in IDOC custody are making face masks for the people who live and work in the department's correctional facilities -- and we need your help. #teamIDOC  https:// facebook.com/IDOC.alert/pho tos/a.162194140463708/3662664640416623/?type=3&theater ", "2020-04-07T21:13:27.000Z": "Labor Committed to Help Idahoans Navigate Difficult Times Labor Committed to Help Idahoans Navigate Difficult Times Implementing CARES Act Will Take Time by Idaho Department of Labor Director Jani Revier As Idahoans grapple with the fallout from the ongoing COVID-19 pandemic and many face an uncertain economic f idahoatwork.com", "2020-04-07T20:55:41.000Z": "In times of crisis, the giving and kind hearts of Idahoans are more apparent than ever. Teresa and I had the opportunity to help at the Emmett Friendship Coalition, filling boxes at the food pantry for families in need. If you have the ability to help, I encourage you to do so.", "2020-04-07T18:00:43.000Z": "LIVE Tele-Town Hall with @GovernorLittle , health officials, and AARP Idaho on #COVID19 updates starting now! \nJoin and tune in here: https:// states.aarp.org/idaho/covid-19 -update-with-governor-little-on-4-7   #idleg  #coronavirus", "2020-04-07T18:11:10.000Z": "LIVE #COVID19 Tele-Town Hall Update as of 5 pm yesterday- 1,170 positive #coronavirus Idaho cases, 31 counties reporting cases, 13 counties reporting community spread. New @CDCgov information recommending using cloth based mask/covering in public. #idleg", "2020-04-07T16:44:53.000Z": "This #WorldHealthDay , I thank Idaho's doctors, nurses, and heath care professionals who are working tirelessly to keep our communities healthy and safe.", "2020-04-07T14:16:36.000Z": "Join @GovernorLittle , health officials and AARP Idaho for our fourth weekly Tele-Town Hall today at 12 MST. Questions and concerns on #coronavirus will be discussed. More here: COVID-19 Update with Governor Little on 4/7 Along with Idaho Governor Brad Little and health officials, AARP Idaho will host their fourth statewide telephone town hall to provide updated information and answer questions regarding the coronav... states.aarp.org", "2020-04-06T23:53:23.000Z": "BOARD EXTENDS SOFT CLOSURE FOR K-12 SCHOOLS WITH OPTION FOR REOPENING\n\nFull details here: BOARD EXTENDS SOFT CLOSURE FOR K-12 SCHOOLS WITH OPTION FOR REOPENING | Idaho State Board of... boardofed.idaho.gov", "2020-04-05T15:52:39.000Z": "Join our town hall discussion with Governor Little for the latest COVID-19 updates, 4/7 noon MTN. More here: http:// spr.ly/60151IT39", "2020-04-06T19:52:41.000Z": "With more Idahoans staying home, it's important to not put unnecessary strain on your local public utilities and infrastructure. Quote Tweet U.S. EPA Water @EPAwater Toilets are not trash cans. Please remember napkins, paper towels, and so called \"flushable\" wipes can all clog your pipes. https:// epa.gov/npdes/sanitary -sewer-overflow-sso-frequent-questions   #WipesClogPipes", "2020-04-06T18:37:41.000Z": "We must do all we can to slow the spread of COVID-19. It's imperative that we all share the message about the need for Idahoans to continue to stay home to help protect the lives of our health care workers, first responders, friends, and neighbors. https:// youtu.be/aIcMUn3ooy0", "2020-04-06T18:33:56.000Z": "Find out how to donate medical supplies, volunteer, and other ways to help your neighbors by visiting this link. We will get through this tough time by helping one another! #IdahoCOVID19 Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-06T18:18:16.000Z": "Two major Idaho insurance carriers are voluntarily waiving health treatment costs associated with COVID-19, the Idaho Department of Insurance announced Friday. #IdahoCOVID19 Major Idaho insurance carriers waiving COVID-19 treatment costs BOISE - Two major Idaho insurance carriers - Regence and Blue Cross of Idaho - are voluntarily waiving health treatment costs associated with COVID-19, the Idaho Department of Insurance announced idahostatejournal.com", "2020-04-06T15:19:41.000Z": "Thank you, @IDNationalGuard ! https:// ktvb.com/article/news/h ealth/coronavirus/here-is-what-the-national-guard-is-doing-to-help-idaho-during-coronavirus-outbreak/277-ef0584e6-2646-40ff-a142-ac89225ffb53   #IdahoCOVID19 Here is what the National Guard is doing to help Idaho during coronavirus outbreak \"Not only do we train to serve our nation in times of war, but we also come to the aid of our fellow citizens in times of their need.\" ktvb.com", "2020-04-06T13:30:22.000Z": "Celebrating the official Idaho Tartan on #TartanDay . Designed by Jan Crook in 2001, the modified Black Watch pattern was approved by the Idaho Centennial Commission. This tartan is listed in the Scottish Register of Tartans. #idedu  #idpol  #idahome  @GovernorLittle", "2020-04-05T16:09:32.000Z": "Waving some regulatory rules in Idaho has allowed more nurses to help our state during the COVID-19 pandemic. #IdahoCOVID19 More than 380 people have signed up for temporary Idaho nursing licenses to fight COVID-19 Currently, the need for more health care workers in Idaho to respond to the outbreak isn't dire, the Idaho Board of Nursing's executive director said. ktvb.com", "2020-04-03T23:58:11.000Z": "Replying to @GovernorLittle Thank you @GovernorLittle for coming out today and helping support ITA and the Drivers at the Weigh Station!  We really appreciate your support.", "2020-04-03T17:11:47.000Z": "Access IDL is our new gateway to online customer self-service and upcoming online services.  We provide access to timber sale information, map services, state land activity records, and leasing opportunities. We are here to help. Department of Lands idl.idaho.gov", "2020-04-04T23:04:03.000Z": "Idaho is reporting a total of 1,077 cases (including 64 new cases) of #IdahoCovid19 and 10 deaths to date. See updated numbers at Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-04T23:39:17.000Z": "I know this probably isn't the wedding of your dreams, but thank you for setting a great example for Idahoans. Congrats Alex and Allen! I wish you many happy, healthy years together! Post Falls couple respect Gov. Little's stay-at-home orders, marry on short notice Post Falls couple respect Gov. Little's stay-at-home orders, marry on short notice cdapress.com", "2020-04-03T18:12:09.000Z": "News release: Wasden Releases New Information on HIPAA Privacy and Security and Breach Notification Rules Wasden Releases New Information on HIPAA Privacy and Security and Breach Notification Rules - Idaho... (Boise) - Attorney General Lawrence Wasden has released the following statement regarding enforcement of HIPAA privacy and security and breach notification rules during Idaho's current emergency... ag.idaho.gov", "2020-04-03T20:52:20.000Z": "Generosity is pouring in across Idaho during the COVID-19 emergency. Today at our East Boise Port of Entry @IdahoTrucking and @GovernorLittle handed out free lunches to 2,000 truck drivers on the road. Thank you to the hard working drivers keeping resources moving!", "2020-04-03T18:12:53.000Z": "Another great example of Idaho's universities and colleges putting innovation to work in a time of need! @IdahoStateU  #IdahoCOVID19 Idaho State University using 3D printers to produce coronavirus personal protection equipment POCATELLO - Idaho State University departments across campus are teaming up to use 3D printers to produce components for face shields, N95-compliant face masks and other personal protection equipment... isu.edu", "2020-04-03T18:05:46.000Z": "Thanks to donations through @IdahoTrucking we were able to give truckers coming through the East Boise Port of Entry free lunches today. I want to express my sincerest thank you to our truckers for keeping supplies and groceries moving in Idaho!", "2020-04-03T17:14:11.000Z": "In last night's LIVE @IdahoReports , @GovernorLittle , @IDHW Director Dave Jeppesen, and Dept. of Labor Director Jani Revier answered viewer questions about how the state is responding to the coronavirus pandemic. #IdahoCovid19 Idaho Reports | Idaho Reports Coronavirus Special: April 2 Gov. Brad Little, Director Jani Revier and Director Dave Jeppesen answer viewer questions. video.idahoptv.org", "2020-04-03T17:50:37.000Z": "Thank you @IDNationalGuard ! Quote Tweet The Idaho Foodbank @IdahoFoodbank National Guard members are being deployed across the state to help with the growing demand caused by COVID-19. As the number of people hit hard financially by the pandemic continues to grow, so does the need for meals at The Idaho Foodbank. #IdahoCovid19  https:// buff.ly/2JCPwUI", "2020-04-03T17:47:54.000Z": "Awesome! Quote Tweet Boise State Alumni @BoiseStateAlum #BoiseStateServes : Sterile swabs, gloves, safety glasses/goggles, disposable lab coats/gowns, masks, respirators, & other #PPE are making their way from @BoiseState labs to @IDHW & other Boise health care institutions. #Boise  #IdahoCOVID19  #PPEnow  @SaintAlsHealth  @StLukesHealth", "2020-04-03T17:42:56.000Z": "Idaho Commerce's newsletter is answering COVID-19 related questions businesses, employers and employees may have. Check it out. @IdahoCommerce  #IdahoCOVID19  https:// mailchi.mp/commerce/show- me-the-money-august-3185829?e=57d4e2694e ", "2020-03-27T21:05:01.000Z": "Applications for the ISTPF due April 20! This program places scientists, engineers & social scientists in Idaho state agencies for a year of hands on service & training. @UIMcClure  @BoiseState  @IdahoStateU  http:// uidaho.edu/istpf  #SciPolJobs  #SciPol", "2020-04-03T15:30:00.000Z": "Last night on @IdahoReports , @IdahoPTV 's @aaronkunz was joined by @GovernorLittle and the directors of @IDHW & @IdahoLabor to answer your #IdahoCOVID19 questions. Watch the full half-hour here: https:// video.idahoptv.org/video/idaho-re ports-coronavirus-special-april-2-mefnon/   #idpol Idaho Reports | Idaho Reports Coronavirus Special: April 2 Gov. Brad Little, Director Jani Revier and Director Dave Jeppesen answer viewer questions. video.idahoptv.org", "2020-04-03T15:50:55.000Z": "Thank you, Buck's Bags! Boise company Buck's Bags pivots to manufacture protective masks, gowns for healthcare workers After more than 40 years of making custom sporting goods, Buck's Bags is changing up its manufacturing line to make personal protective equipment. ktvb.com", "2020-04-03T03:15:34.000Z": "Eye on Boise: Little on stay-at-home order: 'I did not do this lightly' #idpol  @IdahoReports  https:// idahopress.com/eyeonboise/lit tle-on-stay-at-home-order-i-did-not-do-this-lightly/article_526de9ac-3e48-5243-a60e-d13f538349cd.html ", "2020-04-02T20:13:46.000Z": "As the number of confirmed cases in Idaho continues to rise by the day, we are maintaining our focus on increasing healthcare capacity to deal with the medical needs of our friends and neighbors. #IdahoCOVID19 Office of the Governor gov.idaho.gov", "2020-04-02T18:33:12.000Z": "The new Idaho COVID-19 Hotline is 888-330-3010. Use this if the information on the web site doesn't answer your questions. Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-02T15:46:07.000Z": "It's not too late to submit your questions for tonight's LIVE @IdahoReports coronavirus conversation with @GovernorLittle . TONIGHT at 8 PM MT / 7 PM PT. Tune in to @idahoptv or stream online / via @pbs app. Submit questions here: https:// idahoptv.org/shows/idahorep orts/   #IdahoCovid19 Idaho Reports Idaho Reports - The West's longest running legislative program has a storied history that dates back almost four decades. idahoptv.org", "2020-04-02T05:25:26.000Z": "Betty is doing her part to social distance, are you? Boise's 'Betty the Washer Woman' dons Red Cross outfit to honor healthcare workers Since the 1940's, 'Betty' has been washing clothes on Vista Ave. in Boise. In 2002, Betty was featured in John Miller's Idaho Life. ktvb.com", "2020-04-02T02:09:06.000Z": "This Idaho company saw a need, reached out to my Coronavirus Working Group, and is now working with hospitals to help with sanitation efforts! Keep up the great work, Idaho! Caldwell food industry company lends technology to hospitals in COVID-19 battle CALDWELL - Reyco Systems normally supports the food industry exclusively, but now hospitals across Idaho have asked the Caldwell-based company for help in the fight against the new coronavirus. idahopress.com", "2020-04-02T00:21:56.000Z": "Idaho is reporting 669 cases of #IdahoCovid19 and 9 deaths to date. Previous numbers were incorrect for Idaho North Central District because of a technical issue and they have been corrected. See updated numbers at Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-04-01T22:00:03.000Z": "My proclamation detailing how Idaho's May 19 primary election will be carried out is now available here: https:// coronavirus.idaho.gov/wp-content/upl oads/sites/127/2020/04/proclamation_elections_040120.pdf ", "2020-03-31T21:46:42.000Z": "", "2020-03-31T12:45:01.000Z": "You can complete the #2020Census online, by phone, or by mail. https:// 2020census.gov/?cid=23680:16x 3680:16x9_ttpM-static:s.tw:p:dm:en:&utm_source=s.tw&utm_medium=p&utm_campaign=dm:en&utm_content=23680&utm_term=16x9_ttpM-static ", "2020-04-01T18:07:19.000Z": "Check out how this Bonneville School District 93 student is starting the first day of online learning - with the Pledge of Allegiance! #WeCanDoThis  #IdahoEdProud  #idedu  #Idahome  @bjsd93  https:// facebook.com/bjsd93/posts/3 644545278895589 ", "2020-04-01T16:34:26.000Z": "It is important for us to reach as many people as possible with vital information, so I would like to extend a heartfelt thank you to Steven and LaVona for their efforts! 'One of the world's best': Idaho interpreter wins fans during COVID-19 news conferences You may be seeing Steven Stubbs more than you're used to as he interprets for Gov. Brad Little and other officials. idahostatesman.com", "2020-04-01T12:00:01.000Z": "Today is Census Day! Help us spread the word about the importance of the #2020Census . Make this image your profile picture or post it on your timeline and make sure to tell your friends to complete to the census today at http:// 2020CENSUS.GOV !", "2020-04-01T01:46:56.000Z": "If you feel an #earthquake , do these three things: Drop. Cover. Hold on.\n\nVisit http:// ready.gov/earthquakes for more info. Quote Tweet USGS @USGS More on the M 6.5 earthquake - 72km W of Challis, Idaho that just occurred here: http:// ow.ly/Zhmr50z1CaW Please let us know what you felt here: http:// ow.ly/psQW50z1Cbe", "2020-04-01T00:38:37.000Z": "Did you feel it? Go to https:// earthquake.usgs.gov/earthquakes/ev entpage/us70008jr5/executive  to report it for the recent 6.5 72 km w of Challis.", "2020-04-01T00:39:24.000Z": "Looks like between Fall Creek and Clayton, very few people this time of year", "2020-03-31T21:08:36.000Z": "Want to help others while you continue to slow the spread of COVID-19? Check out these great resources compiled by @BoiseDev ! https:// boisedev.com/news/2020/03/2 4/do-something-good/   #IdahoCOVID19 Do Something Good: How you can help our communities In just a few weeks, much about our world changed quickly. But something that didn't change: Idaho's generous spirit. I've been flooded with questions from many of you asking what you can do. Today,... boisedev.com", "2020-03-31T18:17:37.000Z": "Thank you to @AARPIdaho for hosting our weekly tele-town hall discussing COVID-19 in Idaho.", "2020-03-31T17:26:16.000Z": "Telecom partners are stepping up to help Idahoans. Learn more about assistance opportunities and the latest efforts to help our communities, schools, families, and businesses stay connected and get through this together: https:// commerce.idaho.gov/covid-19/telec ommunication-assistance/   #IdahoCOVID19 Telecommunication Assistance - Idaho Commerce Telecom partners are stepping up to help Idahoans.   In these changing times, connectivity is more important than ever. Students at home should stay connected to distance learning opportunities.... commerce.idaho.gov", "2020-03-31T14:24:03.000Z": "Today (3/31) is the third statewide telephone townhall with AARP Idaho, Governor Little, and Idaho health experts. Join us at noon MTN as we offer information and answer questions on the coronavirus. Join in three different ways here: https:// states.aarp.org/idaho/town-hal l-coronavirus-update-from-governor-little   #idleg  #COVID19 Town Hall - Coronavirus Update from Governor Little on 3/31 Throughout this continued outbreak, AARP has been providing information and resources to help older people and those caring for them protect themselves from the virus and prevent it from spreading to... states.aarp.org", "2020-03-30T22:24:34.000Z": "Labor Phone Lines Overloaded with Calls Labor Phone Lines Overloaded with Calls NEWS RELEASE For Immediate Release: March 30, 2020 Information Contact: Georgia Smith, (208) 332-3570 ext. 2102 People are asked to visit Labor website for answers; file for benefits online Idaho i idahoatwork.com", "2020-03-30T23:06:51.000Z": "While the COVID-19 situation may change how we practice our right to vote in this primary election, it is important to keep our election dates in place. Request absentee ballots as soon as possible to vote from home this year. Office of the Governor gov.idaho.gov", "2020-03-30T22:49:06.000Z": "Idahoans can request an absentee ballot at https:// idahovotes.gov/vote-early-ida ho/  .", "2020-03-30T22:48:45.000Z": "Governor Brad Little and Secretary of State Lawerence Denney announced today there will be no change in Idaho's primary election date of May 19.\nThe election will be conducted by mail pursuant to the existing laws for absentee voting due to concerns about the spread of COVID-19.", "2020-03-30T22:09:35.000Z": "Recreate Responsibly! Make sure that you are still practicing social distancing whenever you go outdoors.", "2020-03-30T21:34:23.000Z": "People filing for unemployment benefits need to watch the videos, read the frequently asked questions, and read the user guides on the Claimant Portal web page before they file online at http:// labor.idaho.gov/ClaimantPortal . #IdahoCOVID19", "2020-03-30T21:14:31.000Z": "Scams related to COVID-19 are on the rise. I'm asking Idahoans to be vigilant so they can protect themselves. More: Attorney General Lawrence Wasden: Be on the Lookout for COVID-19 Scams - Idaho Office of Attorney... ag.idaho.gov", "2020-03-27T15:31:38.000Z": "My office has posted some FAQs on Idaho's current Stay at Home order. It deals with the governor's authority to issue the order, what businesses should consider when deciding whether to close, reporting violations, price gouging and open meetings. https:// ag.idaho.gov/content/upload s/2020/03/FAQs-Idahos-Stay-at-Home-Order.pdf ", "2020-03-27T17:07:50.000Z": "Join our town hall discussion with Governor Little for the latest news on COVID-19, 3/31 noon MTN. http:// spr.ly/60161vmd6", "2020-03-30T18:17:00.000Z": "Complying with the stay-home order is life-saving! Thank you all who are doing their best to Zoom, teleconference, FaceTime, and group chat their way through this time. It's not easy, but know your efforts are appreciated! #IdahoCOVID19", "2020-03-30T18:07:52.000Z": "Thank you, Doctors!", "2020-03-30T17:00:06.000Z": "The Idaho Department of Labor is receiving an unprecedented number of calls. Please be patient. We encourage you to file for unemployment online https:// labor.idaho.gov/dnn/COVID-19 . #IdahoCOVID19", "2020-03-30T16:34:35.000Z": "Thank you Clearwater Paper and employees! Idaho has a giant toilet-paper factory - an essential business amid coronavirus hoarding The factory is considered an essential business - thank goodness - so it is exempt from Gov. Brad Little's stay-at-home order. idahostatesman.com", "2020-03-29T16:21:31.000Z": "Thank you to our Vietnam War Veterans. We cannot honor you in person today, but know that you are in our thoughts, prayers and minds. We are forever grateful for your service. #VietnamWarVeteransDay", "2020-03-28T23:04:04.000Z": "Idaho is reporting 261 cases of #IdahoCovid19 and 5 deaths to date. Updated numbers now include reported hospitalizations at Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-03-27T23:14:38.000Z": "Idaho is reporting 230 cases of #IdahoCovid19 and 4 deaths to date. Updated numbers at https:// coronavirus.idaho.gov See why the numbers might not match health district announcements: https:// coronavirus.idaho.gov/wp-content/upl oads/sites/127/2020/03/CaseCountDifferences.pdf  Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-03-28T14:12:51.000Z": "The Idaho Department of Health and Welfare has announced a new toll-free number to call with questions about COVID-19 or the Statewide Stay-Home Order. The number, 1-888-330-3010, will be staffed Monday through Friday, 8 a.m. to 6 p.m. The number will be in service March 30.", "2020-03-27T22:48:05.000Z": "Wondering about golf courses? Car dealerships? Hotels? Additional guidance for FAQs regarding the stay-home order is available here: https:// coronavirus.idaho.gov/statewide-stay -home-order/   #IdahoCOVID19", "2020-03-27T22:26:55.000Z": "\"You have it within your power to be a tremendous help in the lives of others.\" -- Well said, Teresa! Read the inspiring words from the First Lady of Idaho. #IdahoCOVID19  https:// conta.cc/39uUIVa", "2020-03-27T20:40:03.000Z": "Amazing ingenuity from Idahoans! #IdahoCOVID19 Boise State leads project to 3D print facemasks for local hospitals A technology that didn't even exist a few years ago, could help Idaho health care professionals on the front-line of the COVID-19 pandemic. A community of makers across Idaho started working together... boisedev.com", "2020-03-27T15:50:36.000Z": "Thank you to @KTVB and all Idaho journalists for continuing to get the word out about the importance of following the stay-home order! Governor Little discusses 'stay-at-home' order and coronavirus impacts The governor says his main concern is health care capacity: Not only having enough hospital beds, but also personal protective equipment for healthcare workers. ktvb.com", "2020-03-26T23:40:15.000Z": "Idaho is reporting 189 cases of #IdahoCovid19 to date. Updated numbers at https:// coronavirus.idaho.gov See why the numbers might not match health district announcements: https:// coronavirus.idaho.gov/wp-content/upl oads/sites/127/2020/03/CaseCountDifferences.pdf  Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-03-26T20:40:38.000Z": "Join public health officials and @GovernorLittle TONIGHT as they answer questions about COVID-19 on Idaho Public Television LIVE Thursday 3/26 at 8:00 PM MT and streaming on https:// facebook.com/idahoptv/ .", "2020-03-26T21:50:24.000Z": "Under Governor Little's stay-home order, officers are not asking or looking for any type of special paperwork from employers. There is no special documentation needed for people going to work or permitted actives.", "2020-03-26T21:43:33.000Z": "I know this is a challenging, stressful, and difficult time for all Idahoans. Please, follow the stay-home order and do all you can to stop the spread of COVID-19. Let's get through this together.", "2020-03-26T20:00:58.000Z": "The news of the first deaths in Idaho resulting from COVID-19 is deeply saddening and a grave reminder that everyone MUST do all they can to prevent the spread of this virus. Please follow the statewide stay-home order, and pray for the loved ones of the people who passed. Quote Tweet DHW @IDHW Idaho reports first 3 deaths related to COVID-19: https:// healthandwelfare.idaho.gov/AboutUs/Newsro om/tabid/130/articleType/ArticleView/articleId/2095/Idaho-reports-3-deaths-related-to-COVID19.aspx ", "2020-03-26T15:53:19.000Z": "I had the opportunity to tour Idaho's Emergency Operations Center at the Idaho Office of Emergency Management. Idaho is continuously tracking PPE and supplies while preparing for every possible scenario. #IdahoCOVID19", "2020-03-26T02:05:17.000Z": "Idaho's order adopts the guidance from the U.S. Department of Homeland Security on \"Identification of Essential Critical Infrastructure Workers during COVID-19 Response,\" available at this link: https:// cisa.gov/sites/default/ files/publications/CISA_Guidance_on_the_Essential_Critical_Infrastructure_Workforce_508C_0.pdf ", "2020-03-26T01:58:11.000Z": "Information on the stay-home order, essential services, and the latest COVID-19 numbers is available here: http:// coronavirus.idaho.gov  #IdahoCOVID19 Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-03-26T00:06:54.000Z": "The stay-home order is available here: https:// coronavirus.idaho.gov/wp-content/upl oads/sites/127/2020/03/statewide-stay-home-order_032520.pdf   #IdahoCOVID19", "2020-03-25T22:27:31.000Z": "Our healthcare and public safety workers are putting themselves in harm's way to respond to the coronavirus emergency, and we owe it to them to do our part by following this statewide stay-home order. #IdahoCOVID19 Office of the Governor gov.idaho.gov", "2020-03-25T20:55:31.000Z": "The statewide stay-home order is being finalized with public health, local officials, and business today and will be available later today at https:// coronavirus.idaho.gov . The statewide stay-home order is effective immediately and will remain in effect for at least 21 days. Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-03-25T20:55:20.000Z": "Following the guidance of Idaho's public health experts, I issued a statewide stay-home order today for all Idahoans. #IdahoCOVID19", "2020-03-25T20:14:07.000Z": "@GovernorLittle issues statewide stay-home order, signs extreme emergency declaration", "2020-03-25T20:10:58.000Z": "In light of today's stay-at-home order, if you have #IdahoCOVID19 questions for IDHW or Gov. Little, submit them to me here or by e-mailing me through our website: http:// idahoptv.org/idahoreports . \n\nAnd be sure to watch our live show with Little, Jeppesen and Hahn Thursday at 8 pm MT. Idaho Reports Idaho Reports - The West's longest running legislative program has a storied history that dates back almost four decades. idahoptv.org", "2020-03-25T17:11:37.000Z": "Stay up to date with the latest news from my office by signing up for updates here: https:// visitor.r20.constantcontact.com/manage/optin?v =001jPcDrZTUF2iffZAaFR5CaCO9D9OTNmcIrS9m2JnRBQLxSmCCDvAfzkhQC6WRNcW4O6931CUyPvAzTSP21AiJ4rioUvabaHbWJxzuwF2hEYM%3D ", "2020-03-25T15:04:01.000Z": "I will make an important announcement about Idaho's COVID-19 response today at Gowen Field at 1:30 pm MT. A public release with more information will immediately follow. The conference will stream live here: https:// facebook.com/governorbradli ttle/ ", "2020-03-24T23:33:28.000Z": "From Ranch to the Statehouse-- @GovernorLittle spoke with @madisonhardy05 about his @uidaho days, higher education, and more. Here's her story: From Ranch to the Statehouse Idaho Governor Brad Little talks about the importance of higher education by Madison Hardy Idaho Public Radio State Capitol Bureau UI McClure Center Idaho native Bradley Jay Little, better known as idahopublicradio.wordpress.com", "2020-03-24T23:58:57.000Z": "The Idaho Secretary of State is proud to announce that we now have an online option to request your absentee ballot. Please visit https:// idahovotes.gov/vote-early-ida ho/  and request your ballot today! #VoteEarlyIdaho", "2020-03-25T02:15:06.000Z": "I will make an important announcement about Idaho's COVID-19 response tomorrow at Gowen Field at 1:30 pm. A public release with more information will immediately follow. #IdahoCOVID19", "2020-03-24T22:30:24.000Z": "Governor Brad Little acted quickly, encouraging the Idaho Board of Pharmacy to limit the drugs. #IdahoCOVID19 Quick action by Idaho officials prevents shortage of 'cornerstone' medication When President Donald Trump repeated his encouragement by anecdotal evidence of malarial drugs being used to treat or prevent COVID-19, some states saw a run on the medications. But not Idaho. Why? kivitv.com", "2020-03-24T22:08:33.000Z": "Idaho leads the way to protect citizens who need these medications prescribed to treat some autoimmune diseases like lupus and rheumatoid arthritis. #IdahoCOVID19 People have been stockpiling COVID-19 trial drugs. Idaho becomes 1st state to try to stop it Some doctors are writing prescriptions for themselves, family members or other associates in an effort to stockpile the drugs. idahostatesman.com", "2020-03-24T19:34:33.000Z": "The state public health lab strives to meet a 24-hour turn-around time for COVID-19 test results for patients who are hospitalized or determined by public health districts as high priority. Other samples are sent to regional private labs and the results may take longer.", "2020-03-24T17:07:35.000Z": "Small businesses that have been financially impacted as a direct result of COVID-19 since Jan. 31 may qualify for Economic Injury Disaster Loans of up to $2 million to help meet financial obligations and operating expenses. For more information, visit https:// commerce.idaho.gov/covid-19/ .", "2020-03-24T14:23:40.000Z": "We're holding telephone town hall with Governor Little today at noon MTN. This call is available to anyone. More here: Additional Town Hall with Governor Little Scheduled to Update Coronavirus Situation in Idaho Throughout this continued outbreak, AARP is providing information and resources to help older people and those caring for them protect themselves from the virus and prevent it from spreading to... states.aarp.org", "2020-03-23T23:05:19.000Z": "Idaho is reporting 50 cases of #IdahoCovid19 to date. Updated numbers at https:// coronavirus.idaho.gov See why the numbers might not match health district announcements: https:// coronavirus.idaho.gov/wp-content/upl oads/sites/127/2020/03/CaseCountDifferences.pdf  Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-03-24T12:00:00.000Z": "Idaho's farmers, ranchers, shippers, and producers have always been important to our state. Let's take a moment to thank them for everything they do! #NationalAgDay", "2020-03-24T00:36:03.000Z": "Idaho citizens and businesses now have until June 15, 2020, to file their state income taxes and make any state income tax payments and apply for the Property Tax Reduction, Property Tax Deferral, and 100% Service-connected Disabled Veteran Benefit programs. #IdahoCOVID19", "2020-03-24T00:29:51.000Z": "Our goal is to slow the spread of coronavirus. I'm in daily contact with our public health experts and epidemiologists, who are providing me guidance on the actions that are necessary at this time. We are committed to making decisions based on science. Office of the Governor gov.idaho.gov", "2020-03-24T00:05:04.000Z": "The Idaho State Board of Education today directed all public school districts and charter schools to immediately implement a \"soft closure\" of all classroom facilities through Monday, April 20, 2020. @IdSBOE", "2020-03-23T22:05:56.000Z": "Gov. Little: Idaho is extending the state tax filing deadline by 60 days. Idahoans and businesses now have until June 15th to file taxes. #idpol  #IdahoCovid19", "2020-03-23T22:01:48.000Z": "Idaho Governor Brad Little provides updates about the state's spread of the novel coronavirus. Idaho News 6 @IdahoNews6 Idaho Governor Brad Little provides updates about the state's spread of the novel coronavirus. pscp.tv", "2020-03-23T20:18:56.000Z": "Southeastern Idaho Public Health has confirmed two cases of COVID-19 in Bannock County. This brings the total to three case in southeastern Idaho, bringing the total number of confirmed COVID-19 cases in Idaho to 49. #IdahoCOVID19", "2020-03-23T04:23:05.000Z": "7's Hero: Timberline High School jazz musicians play music outside a nursing home 7's Hero: Timberline High School jazz musicians play music outside a nursing home Two students volunteered to play jazz outside the Emerson House in Boise. They entertained the residents, who are not allowed to have visitors due to coronavirus. ktvb.com", "2020-03-23T17:09:00.000Z": "Today on #IdahoMatters : @GovernorLittle joins us ahead of his 4 p.m. press conference on #idahocovid19 . \n\nAnd: @RadioDawson on the end of the #idleg session: what got done & what went unfinished in 2020.\n\nStream @12 : http:// bit.ly/2SiTuFS", "2020-03-23T16:28:18.000Z": "I will host a press conference Monday, March 23, 2020, at 4 p.m. to update Idahoans on the proactive measures the State is taking to help citizens.\n\nThe press conference will be streamed to the public through Idaho Public Television Idaho in Session Governor House and Senate sessions, committee meetings, court hearings, and more live streamed from all three branches of Idaho's government. idahoptv.org", "2020-03-20T20:58:19.000Z": "We're holding another statewide telephone town hall on 3/24 at noon MTN with Governor Little and Idaho health experts to provide the latest updates and information about the coronavirus. Join the conversation here: Additional Town Hall with Governor Little Scheduled to Update Coronavirus Situation in Idaho Throughout this continued outbreak, AARP is providing information and resources to help older people and those caring for them protect themselves from the virus and prevent it from spreading to... states.aarp.org", "2020-03-21T02:08:53.000Z": "Due to the large amount of speculation regarding #COVID19 , this is a reminder to rely on OFFICIAL sources for accurate information.\n\nHelp control the spread of rumors by sharing this page: https:// fema.gov/coronavirus-ru mor-control ", "2020-03-22T18:10:11.000Z": "For more information about how COVID-19 cases are counted, please see https:// coronavirus.idaho.gov/wp-content/upl oads/sites/127/2020/03/CaseCountDifferences.pdf ", "2020-03-21T03:00:33.000Z": "Idaho Gov. Little visits Coeur d'Alene to discuss the coronavirus https:// khq.com/coronavirus/id aho-gov-little-visits-coeur-d-alene-to-discuss-the/video_0a8d8d82-6b10-11ea-bb7d-ab0c2c128a2b.html?ref=trueanthem&taid=5e758350ef5fb40001467e93&utm_campaign=trueAnthem%3A+Trending+Content&utm_medium=trueAnthem&utm_source=twitter ", "2020-03-21T05:07:14.000Z": "#VIDEO : My interview with #Idaho  @GovernorLittle and the state director of @IDHW with the information you need concerning the #coronavirus as of Friday. https:// localnews8.com/news/2020/03/2 0/governor-little-and-state-health-director-address-covid-19-concerns/   #covid19idaho  #virus  #kidknews3  #localnews8 Governor Little and state health director address COVID-19 concerns - Local News 8 News anchor Todd Kunz talks with Idaho Governor Brad Little and Dave Jeppesen, Idaho Director of Health and Welfare about the current COVID-19 assessment in the state. localnews8.com", "2020-03-21T15:22:59.000Z": ". @GovernorLittle will host a statewide AARP telephone town hall on March 24 to provide information and answer questions regarding #COVID19 in Idaho. The hour-long conversation begins at 12 p.m. MT. Join in: https:// states.aarp.org/idaho/addition al-town-hall-with-governor-little-scheduled-to-update-coronavirus-situation-in-idaho?cmp=SNO-ID-FB-HLTH&socialid=3214132769 ", "2020-03-20T21:15:02.000Z": "Just finished speaking with @GovernorLittle and Idaho Health & Welfare director Dave Jeppesen regarding coronavirus in Idaho and the state's response. \n\nLook for more at 5pm on KREM 2. Livestream recap posted on the station's website.", "2020-03-20T21:00:07.000Z": "I just interviewed #Idaho  @GovernorLittle and Dave Jeppesen, the director of @IDHW about the effects of the #coronavirus in the state. See it tonight at 9pm on FOX 5 East Idaho and at 10pm on @KIDKNews 3 and @localnews8 . #virus  #covid19idaho  #news  #kidknews3  #localnews8", "2020-03-20T21:22:27.000Z": "Southwest District Health will announce the first confirmed case of COVID-19 in Canyon County at 5:00 p.m. The press conference will not be open to the public. A press release with additional information will be sent out after the announcement. #IdahoCovid19", "2020-03-20T20:40:08.000Z": "The Panhandle Health District (PHD) and Kootenai Health have confirmed two additional confirmed cases of novel coronavirus (COVID-19) in Kootenai County, bringing the total number of cases to three in the panhandle area. #IdahoCovid19", "2020-03-20T17:01:17.000Z": "Idaho's Teacher of the Year continues to inspire even when outside the classroom! Quote Tweet stacielawler@ID2020TOY @stacielawlerID1 Timberlake kids...join me in getting some exercise in our beautiful North Idaho sunshine!", "2020-03-20T14:53:08.000Z": "We are meeting with staff from each of the public health districts today. Thank you to the South Central District Health team for their hard work during this time.", "2020-03-20T03:23:24.000Z": "My office is committed to keeping the public informed. Sign up for every update at http:// gov.idaho.gov", "2020-03-19T23:40:14.000Z": "ID Dept Health & Welfare has issued a Shelter in Place Order for Blaine County to slow the rapid spread of the COVID-19 virus. This means everyone should stay home unless you need to perform essential activities or go to work to provide essential business and government services.", "2020-03-19T23:40:58.000Z": "The total number of confirmed cases in Idaho is now at 23. #IdahoCovid19  #IDCOVID19", "2020-03-19T21:05:17.000Z": "I will host a press conference Thursday, March 19, 2020, at 5 p.m. MST to update Idahoans on community spread of the novel coronavirus. \n\nThe press conference will be streamed to the public through Idaho Public Television https:// idahoptv.org/shows/idahoins ession/governor/  . Idaho in Session Governor House and Senate sessions, committee meetings, court hearings, and more live streamed from all three branches of Idaho's government. idahoptv.org", "2020-03-19T20:00:00.000Z": "As @GovernorLittle says, this is a historic time and America's Republican governors are rising to the challenge and leading. \n\nFor more #COVID19 information visit http:// CDC.gov/COVID19", "2020-03-19T18:42:47.000Z": "Thanks to @GovernorLittle , Director Jeppesen at @IDHW , Director Duke at Central District Health, and @ToniLaw71870714 of @teamiha for making this happen. Watch our #IdahoCovid19 special tonight at 8 pm. #idpol", "2020-03-19T12:44:01.000Z": "Together, we can stop the spread of #COVID19 . Here are the most recent guidelines for Americans from the @WhiteHouse and @CDCgov . #coronavirus", "2020-03-19T16:45:55.000Z": "Free meals for children are available at approved sites across the state. Children ages 1-18 may pick-up meals at any site, regardless of enrollment. https:// buff.ly/2QwlPZ0", "2020-03-19T16:36:51.000Z": "Idaho Reports is airing a half-hour special on #IdahoCovid19 Thursday at 8 pm on Idaho Public Television. Guests: Myself, Toni Lawson of @teamiha , Russell Duke of @CDHidaho , and Director Jeppesen of @IDHW .", "2020-03-19T14:28:03.000Z": ". @StLukesHealth , @SaintAlsHealth & @SaltzerHealth all now offer drive-thru or curbside coronavirus testing. @SaintAlsHealth also has an online urgent care tool. For a full list of the testing locations & details, visit the IMA Coronavirus Resources page: http:// bit.ly/IMAcoronavirus Quote Tweet KTVB.COM @KTVB Treasure Valley health care facilities explain criteria for coronavirus drive-thru testing https:// ktvb.com/article/news/h ealth/coronavirus/saint-alphonsus-coronavirus-testing-what-you-need-to-know/277-609ab814-192d-47d1-b79a-b58e49cdf1c4 ", "2020-03-19T00:21:25.000Z": "South Central Public Health District (SCPHD) has confirmed two additional cases of novel coronavirus in south central Idaho. These are cases four and five in south central Idaho, bringing the total number of confirmed COVID-19 cases in Idaho to 11.", "2020-03-18T23:08:56.000Z": "The American Red Cross is facing a severe blood shortage as many blood drives have been cancelled across the country due to coronavirus concerns. Governor Brad Little is calling on Idahoans to make appointments to donate blood as soon as they can. Office of the Governor gov.idaho.gov", "2020-03-18T22:10:55.000Z": "Governor Brad Little announced today that Idaho is adopting the latest guidance from the White House and U.S. Centers for Disease Control and Prevention (CDC) to slow the spread of coronavirus. Office of the Governor gov.idaho.gov", "2020-03-18T22:15:41.000Z": "Idaho wants to hear from small businesses impacted by coronavirus. The State of Idaho will need responses from small businesses to demonstrate economic injury as determined by the SBA in order to activate Economic Injury Disaster Loan assistance. Office of the Governor gov.idaho.gov", "2020-03-18T20:23:32.000Z": "This is what @GovernorLittle meant when he said \"History will remember our reaction to coronavirus, so let's be there for each other\" Local volunteer firefighters available to run errands for its community members in need | East... UCON - With the quickly spreading coronavirus affecting eastern Idaho residents, some local firefighters are coming to the rescue in a unique way. The Ucon Fire Department is offering to go into the... eastidahonews.com", "2020-03-18T19:17:35.000Z": "Idaho Reports is airing our first half-hour special on #IdahoCovid19 Thursday at 8 pm on Idaho Public Television. Guests: @GovernorLittle , Toni Lawson of @teamiha , Russell Duke of @CDHidaho , and Director Jeppesen of @IDHW . #idpol", "2020-03-18T16:41:40.000Z": "#VoteEarlyIdaho Protect yourself. Protect your neighbors.\n\nVoting Absentee is as easy as 1,2, 3!          \nREQUEST your ballot - the sooner the better.\nWAIT for it to arrive.\nVOTE & RETURN your absentee ballot to the clerk by no later than closing of the polls on election day!", "2020-03-18T00:48:25.000Z": "Cases of the novel coronavirus have now been confirmed in Ada, Blaine, Madison and Teton Counties. The total number of confirmed cases is now 9. #IDCOVID19", "2020-03-17T22:14:16.000Z": "I will host a press conference Wednesday, March 18, 2020, at 10 a.m. MT to update Idahoans on new guidance and recommendations to protect our citizens during the coronavirus outbreak. \n \nThe press conference will be streamed here: https:// facebook.com/governorbradli ttle/ ", "2020-03-17T20:42:42.000Z": "I want history to remember that Idahoans were there for each other during this very challenging and uncertain time. Office of the Governor gov.idaho.gov", "2020-03-17T17:03:30.000Z": "Your money is safe in your financial institution. Deposit accounts are federally insured to $250,000. \n\nIf you are experiencing a change in your financial circumstances, contact your financial institution. Chances are they can help.\n\nDebit and credit cards are fully operational.", "2020-03-17T16:01:54.000Z": "The Idaho Department of Health and Welfare, in conjunction with the affected local public health districts, is announcing an additional two cases of novel coronavirus infection in Idaho. This brings the total to seven in the state. https:// healthandwelfare.idaho.gov/AboutUs/Newsro om/tabid/130/articleType/ArticleView/articleId/2090/Idaho-reports-two-more-cases-of-COVID19-for-a-total-of-seven-in-the-state.aspx ", "2020-03-17T14:53:28.000Z": "We all must fight against rumors and false information regarding #IdahoCovid19 . Please use trusted sources such as https:// coronavirus.idaho.gov or https:// cdc.gov/coronavirus/20 19-ncov/index.html  . Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-03-16T23:06:09.000Z": "To reduce large gatherings of people, the Idaho Transportation Department's Division of Motor Vehicles is instituting a 90-day extension on some credentials. More info here: https:// itd.idaho.gov/news/itd-issue s-90-day-extension-on-expiring-credentials-encourages-use-of-online-services/ ", "2020-03-16T21:13:52.000Z": "After confirmed cases of the novel coronavirus in Idaho, I advise the public to follow the guidance of health officials, be thoughtful of your actions, and take care of each other.", "2020-03-16T17:44:47.000Z": "To stay up-to-date with the latest information from my office, sign up for news here: https:// visitor.r20.constantcontact.com/manage/optin?v =001jPcDrZTUF2iffZAaFR5CaCO9D9OTNmcIrS9m2JnRBQLxSmCCDvAfzkhQC6WRNcW4O6931CUyPvAzTSP21AiJ4rioUvabaHbWJxzuwF2hEYM%3D ", "2020-03-16T15:23:03.000Z": "Idaho is reporting 5 cases of novel #coronavirus to date. The state lab has tested 234 people, and private labs have tested 36. Updated numbers are posted at https:// coronavirus.idaho.gov . Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-03-13T22:06:02.000Z": "We've scheduled a statewide telephone town hall on 3/17 at noon MTN with Governor Little and Idaho health experts to provide the latest updates and information on the coronavirus. Join the conversation here: http:// spr.ly/60101SS4n", "2020-03-15T18:54:07.000Z": "There is no shortage of food. Stores will restock, so please don't hoard. \n\nThe water supply is clean and safe to drink. \n\nWe are working to provide you with the latest, most accurate information. \n\nWe are in this together, so please take care of yourself and your neighbors.", "2020-03-15T02:26:41.000Z": "Idaho reports three additional cases of COVID-19 in the state, for a total of 5 https:// healthandwelfare.idaho.gov/AboutUs/Newsro om/tabid/130/ctl/ArticleView/mid/3061/articleId/2089/Idaho-reports-three-additional-cases-of-COVID19-in-the-state-for-a-total-of-5.aspx ", "2020-03-15T01:43:03.000Z": "Cases of coronavirus have been confirmed in Ada, Blaine, and Teton Counties. #IDCOVID19 Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-03-14T21:42:12.000Z": "Blaine County School District Board Chairman Keith Roark and Superintendent Dr. GwenCarol Holmes announce that all schools and facilities are closed to the public beginning Monday, March 16 extending through Sunday, April 5. #IDCOVID19 Blaine County School District / Homepage Blaine County School District #61 serving Bellevue, Carey, Hailey, Ketchum and Sun Valley Idaho. We Inspire, Engage, Educate and Empower every student. blaineschools.org", "2020-03-14T20:05:29.000Z": "First  case of novel coronavirus reported in south central Idaho; the second in the state http:// ow.ly/VtGB50yLTAz", "2020-03-14T19:50:03.000Z": "Idaho now has 2 confirmed cases of the novel coronavirus. For the latest updates visit https:// coronavirus.idaho.gov . #IDCOVID19 Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-03-14T00:50:14.000Z": "We are committed to working with our partners to provide the public timely, accurate information about what individuals can do to help slow the spread of coronavirus. Office of the Governor gov.idaho.gov", "2020-03-13T22:06:41.000Z": "The Department of Health and Welfare and Governor Brad Little will announce Idaho's first confirmed case of the novel coronavirus at 5 p.m. today in the governor's ceremonial office on the second floor of the Idaho Statehouse.", "2020-03-13T20:40:05.000Z": "Attorney General Lawrence Wasden reminded businesses today that Idaho's price gouging statute prohibits selling fuel, food, drugs or water at an exorbitant or excessive price during a declared state of emergency. #IDCOVID19 Consumer Alert: Idaho's Price Gouging Law Now in Effect Following Emergency Declarations - Idaho... (Boise) - Attorney General Lawrence Wasden reminded businesses today that Idaho's price gouging statute prohibits selling fuel, food, drugs or water at an exorbitant or excessive price during a... ag.idaho.gov", "2020-03-13T20:09:08.000Z": "I issued a proactive emergency declaration today to aid in the coronavirus response effort in Idaho. With no confirmed cases in Idaho at this time, we are in the best position to be proactive and get ahead of the impact coronavirus could have here. Office of the Governor gov.idaho.gov", "2020-03-13T19:21:54.000Z": "I have signed Senate Bill 1400, transferring $2 million to help combat the spread of coronavirus. Thank you to the Idaho Legislature for this swift action that will help save lives. #IDLeg", "2020-03-13T14:50:41.000Z": "As of this morning, Idaho state lab has tested 118 samples for novel #coronavirus , and private labs have tested 13. Still no positive results. Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-03-13T14:25:58.000Z": "I will host a news conference at 10 a.m. Friday to provide an update on the coronavirus situation in Idaho. At this time, there are no confirmed cases of the novel coronavirus, also known as COVID-19, in the state. Watch live here: https:// facebook.com/governorbradli ttle ", "2020-03-12T19:47:51.000Z": "More information is available here: http:// coronavirus.idaho.gov", "2020-03-12T17:14:17.000Z": "The President's actions are appreciated and appropriate at this time. Idaho is prepared, and we all must do our part to prevent the spread of coronavirus to vulnerable populations and to preserve capacity in our healthcare facilities. @WhiteHouse President Donald J. Trump Has Taken Unprecedented Steps To Respond To The Coronavirus And Protect... President Donald J. Trump is taking further action to curb the spread of the coronavirus to the United States whitehouse.gov", "2020-03-11T22:05:38.000Z": "NOMINATE A TEACHER FOR IDAHO'S TOP TEACHING HONOR, THE #TEACHER OF THE YEAR AWARD! Nominations accepted through April 27th! https:// sde.idaho.gov/events/teacher -year/   #Idaho  #idedu  @IdSBOE  @IdahoCTE  @IdahoSTEMAC  @nextstepsidaho", "2020-03-12T16:57:48.000Z": "I am happy to help preserve Idaho's shooting ranges for generations to come! #IDLeg NRA-ILA | Idaho: Governor Signs Shooting Range Preservation Bill into Law Yesterday, Governor Brad Little signed shooting range protection legislation, House Bill 396, into law. nraila.org", "2020-03-11T12:47:18.000Z": "Thank you @GovernorLittle for signing an @ESGR Statement of Support for National Guard and Reserve Service members on behalf of the state of #Idaho . We are grateful to state and local governments that value their employees' #militaryservice ! @IDNationalGuard  @USNationalGuard", "2020-03-12T00:28:13.000Z": "#Idaho : Good news! @GovernorLittle signed shooting range protection legislation, HB 396, into law. @NRA thanks Gov. Brad Little for signing this important legislation. Also, thank you to #NRA members and #2A supporters for contacting your state lawmakers. NRA-ILA | Idaho: Governor Signs Shooting Range Preservation Bill into Law Yesterday, Governor Brad Little signed shooting range protection legislation, House Bill 396, into law. nraila.org", "2020-03-12T14:55:37.000Z": "93 people have been tested for novel #coronavirus in Idaho as of this morning. All results are negative. Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-03-10T19:36:43.000Z": "Yesterday Idaho @GovernorLittle signed a Statement of Support for the National Guard and Reserve on behalf of the @ESGR , recognizing the Idaho National Guard and Reserve are essential to the strength of our Nation and the well-being of our communities.", "2020-03-10T22:52:00.000Z": "Idaho has tested a total 51 people for the #novel coronavirus at the state lab, and all results have been negative. See the latest information at http:// coronavirus.idaho.gov and http:// coronavirus.gov . Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-03-10T21:00:42.000Z": "Our student doctors, alongside President Tracy Farnsworth and Dean Thomas Mohr, connected with Idaho legislators during 'COM Day at the Capitol' on March 9.\n\nThe group also had the opportunity to speak with @GovernorLittle during their visit. #IdahoCOM", "2020-03-10T15:36:29.000Z": "In an effort to protect Idaho individuals and families, health insurance carriers are waiving co-sharing for Coronavirus testing. #IDCOVID19  https:// doi.idaho.gov/DisplayPDF?ID= 7708 ", "2020-03-09T23:07:12.000Z": "Here is the latest from the Governor's Coronavirus Working Group Chairman Dave Jeppesen: https:// youtu.be/RZOWcWIBeyc", "2020-03-09T16:03:47.000Z": "I got my Star Card! Do you have yours? If you want a Star Card, don't wait until the last minute! Get your documents together and go to your local Driver's License office today. https:// itd.idaho.gov/starcard/", "2020-03-09T03:46:31.000Z": "Happy to appear on @IdahoPTV for #Festival2020 and the premiere of \"Idaho Experience: Idaho's Constitution Revealed\"!", "2020-03-08T03:17:45.000Z": "Another wonderful Idaho State Prayer Breakfast was held this morning!", "2020-03-07T00:08:21.000Z": "So grateful to @GovernorLittle for taking the time out of his busy schedule to spend time reading to our fabulous scholars at Indian Creek Elementary. Thank you for being our Education Governor!", "2020-03-06T22:17:11.000Z": "I voted! \n\nI voted early in Gem County! Today is the last day for in-person early voting. Vote on Election Day March 10. Absentee ballots must be received by March 10. #IDPol", "2020-03-06T20:20:24.000Z": "We are grateful to @GovernorLittle for reading at Indian Creek Elementary School today! @KSDempowers", "2020-03-06T20:13:21.000Z": "I'm with ... @GovernorLittle  at Indian Creek Elementary in Kuna for Read Across America week. #idpol", "2020-03-06T16:47:33.000Z": "I commend the Legislature for acting decisively to ensure we are prepared to protect the people of Idaho. #idleg Office of the Governor gov.idaho.gov", "2020-03-05T23:06:30.000Z": "Glad to see Sgt. Justin Anderson is in recovery. Please continue to keep him in your prayers. We thank Sgt. Anderson and all police officers for their bravery, public service and protection! Post Falls Police Sergeant up and walking around as he continues to recover from gunshot wound Update, March 5, 6:00 pm khq.com", "2020-03-05T15:14:48.000Z": "Idaho farmers have one month to nominate schools for $15K STEM grants: Idaho farmers have one month to nominate schools for $15K STEM grants Idaho farmers have less than one month to submit a nomination for a school they think deserves a $15,000 STEM grant. Idaho farmers can nominate any local rural public school for the grants which are... idahonews.com", "2020-03-05T00:10:32.000Z": "Congratulations to all of the @PHITHETAKAPPA members at two-year colleges recognized today by @GovernorLittle during Idaho's Phi Theta Kappa All-State Academic Team Day! #mightyCWI  #Idedu  #idleg  #idpol", "2020-03-04T21:03:19.000Z": "http:// Coronavirus.Idaho.Gov is where you can find the latest information on Idaho's coronavirus situation, resources to learn more about the disease, and contact information for local public health districts, which are the best sources to answer to citizens' questions. Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-03-04T21:00:35.000Z": "While the individual risk for coronavirus in Idaho is still low, the situation is rapidly evolving and we do expect confirmed cases in Idaho at some point. Idaho is prepared, and we all must do our part to prevent the spread of coronavirus. Office of the Governor gov.idaho.gov", "2020-03-04T13:00:00.000Z": "This Idaho Day we celebrate our great state and 100 years of women's suffrage. Idaho was the fourth state to give women the right to vote and the first to do it by constitutional amendment. #IdahoWomen100", "2020-03-03T19:01:51.000Z": "We had a wonderful visit from President Henry B. Eyring, Second Counselor in the First Presidency of The Church of Jesus Christ of Latter-day Saints. Thank you @EyringHB for the beautiful family history!", "2020-03-03T16:33:52.000Z": "Idaho still has no cases of COVID-19. Public health officials are monitoring 6 people for #coronavirus symptoms and have tested a total of 3. For the latest Idaho-specific information, visit https:// healthandwelfare.idaho.gov/COVID19/tabid/ 4664/Default.aspx  . Novel Coronavirus (COVID-19) coronavirus.idaho.gov", "2020-03-03T15:54:36.000Z": "Please follow @IdahoCOVID19 for official information regarding Coronavirus in Idaho.", "2020-03-02T22:31:30.000Z": "Idaho is carefully and closely monitoring the Coronavirus. Please join me on Facebook Live at 11 a.m. on Wednesday, March 4, for more information about ongoing preparedness efforts in Idaho.", "2020-03-02T16:09:21.000Z": "Your property taxes shoulder a growing share of teacher salaries and operating expenses in our school districts. It's out of balance and not sustainable. My teacher pay bill increases state support for teacher pay across Idaho. #IDLeg  #IDedu  #IDpol  https:// bonnercountydailybee.com/editorial/2020 0223/idahos_teacher_pay_and_state_property_taxes ", "2020-03-01T17:45:11.000Z": "I'm working hard to improve education in Idaho for all students, teachers, parents and families. #IDLeg  #IDedu Little leads roundtable on education issues with east Idaho leaders Gov. Brad Little met with a roundtable of a dozen educators and education stakeholders Saturday afternoon to discuss the biggest ideas coming down the pipeline of the state legislature. postregister.com", "2020-02-29T02:50:48.000Z": "Thanks to all the green lights for a better opportunity for our kids", "2020-02-29T02:46:10.000Z": "Celebrated our teacher pay bill at EMMETT Carberry School music program.", "2020-02-28T17:07:02.000Z": "We're just getting started at Capital for a Day in Cascade! #IDpol  #CFAD", "2020-02-27T21:56:48.000Z": ". @GovernorLittle is the latest GOP Gov leading the way on teacher pay! #Idaho  #idpol Quote Tweet Idaho News 6 @IdahoNews6 Following two days of testimony, the House Education Committee voted unanimously Wednesday to advance Gov. Brad Little's five-year, $223 million teacher pay proposal, @idahoednews reports. https:// kivitv.com/news/education /making-the-grade/the-governors-teacher-pay-plan-clears-its-first-major-hurdle ", "2020-02-27T21:33:14.000Z": "The result will be more efficient highway and construction projects, reduced fire risk, and jobs from increased on-the-ground activities that improve the health of our lands. #IDLeg  #IDpol", "2020-02-27T21:23:43.000Z": "In just four short years, Idaho climbed from the 50th to the 8th best in the world for mining investment. Mining can be done in an environmentally responsible manner while also protecting the open spaces and recreational activities we all enjoy! Annual Survey of Mining Companies, 2019 This report presents the results of the Fraser Institute's 2019 annual survey of mining and exploration companies. The survey is an attempt to assess how mineral endowments and public policy factors fraserinstitute.org", "2020-02-27T21:21:23.000Z": "I strongly support President Trump's plans to modernize NEPA - the National Environmental Policy Act. Speaker Bedke and I talked to White House officials today to share Idaho's experience with this law and why reform is needed. @WhiteHouse  #IDLeg", "2020-02-27T18:10:37.000Z": "See you tomorrow, Cascade! #IDLeg  #IDpol Quote Tweet Brad Little @GovernorLittle Join me at the next Capital for a Day in Cascade! #IDLeg  #IDPol  #IDGov", "2020-02-27T17:08:38.000Z": "\"Idaho's leaders are taking care of their primary job: providing a well-run government worthy of the good people of that state.\" #IDLeg  #IDpol Editorial: Idaho's government does it right It's not sexy, and it usually doesn't make a lot of headlines, but a well-run government is a beautiful thing. capitalpress.com", "2020-02-27T16:32:58.000Z": "Visiting with our logging contractors this morning - Our loggers and haulers make wood products possible! #IdahoLoggerStrong", "2020-02-24T16:30:02.000Z": "It's is so great to hear from @GovernorLittle this am A friend of firefighters in Idaho & roundly supported by @ProFFIdaho & @IAFFNewsDesk", "2020-02-23T03:23:37.000Z": "It was truly an honor to cut the ribbon at the grand opening of the visitor center at the Minidoka National Historic Site.  I encourage all Idahoans to visit, remember and reflect.", "2020-02-22T16:49:58.000Z": "Thank you to the City Club of Idaho Falls for hosting a wonderful evening celebrating the past, present and future success of the @INL ! #IDPol  @CongMikeSimpson  @Dr_Mark_Peters  @SenatorRisch  @CongMikeSimpson  @lawrencewasden", "2020-02-22T00:17:37.000Z": "Pleased to be with friends and colleagues @GovernorLittle  @SenatorRisch  @lawrencewasden  @Dr_Mark_Peters to celebrate  a successful negotiation to the 1995 Idaho Settlement Agreement. This is a great thing for Idaho, @INL  @ENERGY and our whole nation.", "2020-02-20T19:46:10.000Z": "Thank you to @GovernorLittle for hosting Idaho Stakeholders, @SenatorRisch , @CongMikeSimpson and me today to talk about how #USMCA will affect Idaho.", "2020-02-20T19:37:12.000Z": "Join me at the next Capital for a Day in Cascade! #IDLeg  #IDPol  #IDGov", "2020-02-20T19:25:52.000Z": "Thank you to @realDonaldTrump and Idaho's congressional delegation for the hard work in protecting and advancing Idaho agriculture, business and manufacturing through the passing of the USMCA. @MikeCrapo  @SenatorRisch  @CongMikeSimpson  @WhiteHouse", "2020-02-20T16:28:36.000Z": "It's Nurses Day at the Capitol! 2020 was declared the Year of the Nurse by the World Health Assembly, and nurses make up the largest workforce in healthcare. Idaho has more than 30k licensed nurses. Thank you for all you do! #idleg", "2020-02-19T22:38:18.000Z": "It is our vision that adults, children, and their families who live with mental illness and addiction receive the behavioral health care services they need when they need them. #IDleg  #IDpol Office of the Governor gov.idaho.gov", "2020-02-19T17:57:06.000Z": "For nearly 60 years, Bill Roden helped shape the quality of life we enjoy in Idaho. It is a privilege for me to present this award in Bill's honor. #IDLeg  #IDpol  https:// gov.idaho.gov/pressrelease/b ill-roden-receives-idaho-medal-of-achievement/ ", "2020-02-19T16:43:38.000Z": "It is time to make Idaho teacher salaries competitive. \n\nToday, I put a multi-year plan before the Idaho Legislature to raise teacher salaries across the board. #IDedu  #IDLeg Office of the Governor gov.idaho.gov", "2020-02-19T02:56:24.000Z": "It's time these unnecessary and outdated laws come off the books. \n\n*No wild hogs were injured in the trimming of this government fat. #IDLeg Idaho bills seek to repeal outdated laws The move came after Little challenged state agencies to look at their laws and make sure they were kept up to date and relevant. krem.com", "2020-02-18T16:41:53.000Z": "Thank you, @GovernorLittle ! #BoiseState is proud to contribute to the innovative, diligent and engaged culture of Idaho.\n\nGo Broncos! @ASBSU  @MarleneTromp  #IDedu Quote Tweet Brad Little @GovernorLittle I am happy to proclaim today Boise State University Day at the Capitol! #GoBroncos  #IDedu  @MarleneTromp", "2020-02-18T16:26:46.000Z": "I am happy to proclaim today Boise State University Day at the Capitol! #GoBroncos  #IDedu  @MarleneTromp", "2020-02-18T02:41:42.000Z": "Teresa is the better cook, but I am getting rather famous for my oatmeal recipe! Thanks, @KTVB ! Breakfast with Gov. Brad Little We also talked politics with the governor while he made his famous oatmeal for us in the KTVB Kitchen. youtube.com", "2020-02-17T18:52:11.000Z": "I had the privilege of meeting with Idaho's FFA State Officers this morning! #IdahoAG  #IdahoEdu", "2020-02-17T17:49:54.000Z": "On this President's Day holiday, we got the chance to chat with @GovernorLittle about many different issues facing the industry. Look for it in a future episode of #WordWithWayne", "2020-02-17T16:43:21.000Z": "We had @GovernorLittle come make his \"Famous Oatmeal\" for breakfast. Is it good? Find out tonight on the @the208KTVB", "2020-02-17T16:14:40.000Z": "What's happening in the @KTVB kitchen this morning?  #the208", "2020-02-17T14:16:24.000Z": "What a great way to start the week by speaking at the 4-H Know Your Government conference. #UIdahoExtension4H", "2020-02-16T17:35:35.000Z": "Thank you! Quote Tweet The RGA @The_RGA Happy Birthday to Idaho @GovernorLittle ! \n\nWe got you some red tape &", "2020-02-13T21:58:34.000Z": "I had the privilege of meeting with the students from Three Creek School! The school has 7 students and their teacher is also the superintendent, principal and secretary! #IDedu", "2020-02-13T15:45:08.000Z": "", "2020-02-11T23:23:39.000Z": "I still plan to appeal the decision to the U.S. Supreme Court. Idaho taxpayers should not have to pay for a procedure that is not medically necessary.\n\nFull statement here: Office of the Governor gov.idaho.gov", "2020-02-11T16:44:37.000Z": "On this day in history, February 11, 1920, Governor D.W. Davis gave a speech calling for the ratification of the 19th Amendment. That speech is on display in my Ceremonial Office until 3 pm. #IDLeg  #IDPol  #IdahoWomen100  @IdahoHistoryFan", "2020-02-10T21:14:21.000Z": "I've had an informative and productive visit to Washington DC! This morning, governors from around the nation took part in the White House Business Session. #IDPol Official White House Photo by Keegan Barber", "2020-02-07T15:02:00.000Z": "In his State of the State address, @GovernorLittle emphasized the need for a greater investment in literacy, teachers, and #Idaho 's public education system. Read a recap of all our Governor's annual speeches Western Governors deliver 2020 State of the State Addresses Western Governors are delivering their 2020 State of the State addresses. Below is a roundup of the speeches delivered so far; the word cloud above represents common issues included in the addresses. westgov.org", "2020-02-06T19:59:50.000Z": "The State Complete Count Committee formed by @GovernorLittle to assist federal partners in completing the 2020 Census Count will meet February 13 in Boise. You can see the agenda here: https:// gov.idaho.gov/2020-census/", "2020-02-05T07:05:07.000Z": "Gov. Little looks to increase funding for Idaho mental health facilities Gov. Little looks to increase funding for Idaho mental health facilities The governor is proposing a $44.8 million budget for state psychiatric hospitals in the upcoming fiscal year. ktvb.com", "2020-02-05T03:54:33.000Z": "I applaud @realDonaldTrump for highlighting the importance of supporting America's moms, dads, and children in tonight's #SOTU . Idaho's Families First Act gives eligible state employees 8 weeks of paid family leave. The @WhiteHouse is leading by example in supporting families.", "2020-02-04T20:20:38.000Z": "#Idaho 's Little and Wasden announce agreement with @ENERGY on spent #nuclear fuel generated by the Advanced Test Reactor @INL . https:// gov.idaho.gov/pressrelease/l ittle-and-wasden-announce-agreement-with-u-s-department-of-energy-on-spent-nuclear-fuel-generated-by-the-advanced-test-reactor-at-idaho-national-laboratory/   @GovernorLittle  @lawrencewasden", "2020-02-04T20:53:18.000Z": "I proclaimed today Red Cross Day at the Capitol and March as National Red Cross Month. Join me by donating lifesaving blood that gives hope and strength to patients in need. @RedCrossBloodLC The following media includes potentially sensitive content. Change settings View", "2020-02-04T15:00:00.000Z": "TODAY @GovernorLittle will proclaim 2/4 as #RedCross Day at the #Idaho State Capitol and host a @RedCrossBloodLC blood drive during a critical need for blood #GiveNow . 9 a.m. to 3 p.m. and help replenish the blood supply. Appts: https:// rcblood.org/2IYJQDF", "2020-02-03T21:26:14.000Z": "#Idaho Division of Aeronautics #art  #contest ! 1st-place winners in each age category will be invited to RIDE IN AN #AIRPLANE , and receive a copy of their #artwork signed by @GovernorLittle ! \n\nAges 5-18, submissions due April 1: https:// itd.idaho.gov/wp-content/upl oads/2019/12/Aero_Art_Contest.pdf   @IdahoITD  @IDNationalGuard", "2020-02-03T19:32:55.000Z": "Save the date!", "2020-02-02T15:00:01.000Z": "Tater Tots were created in 1953 by Ore-Ida founders F. Nephi Grigg and Golden Grigg. In 2004, Napoleon Dynamite made sure tots and Idaho would be associated forever in pop culture. Enjoy these Gem State gems during your Super Bowl celebrations for a little taste of Idaho!", "2020-02-01T00:21:38.000Z": "Thank you to all who came to Capital for a Day in Parma!", "2020-01-31T17:47:08.000Z": "The lack of regulatory friction is bringing higher paying jobs to Idaho! #idleg  #idpol Idaho housing is booming due to lack of regulation: Gov. Little Gov. Brad Little, (R-Idaho), discusses the real-estate boom in his state. video.foxbusiness.com", "2020-01-31T17:20:27.000Z": "We are just getting started at Capital for a Day in Parma - starting off with some questions from the kids! #CFAD  #IDpol", "2020-01-31T17:05:33.000Z": "Replying to @GovernorLittle  @Varneyco  and  @FoxBusiness Here is #Idaho  @GovernorLittle talking about the state economic growth on @FoxBusiness with @Varneyco .", "2020-01-31T16:44:57.000Z": "Ready to go live with @Varneyco from Capital for a Day in Parma! Check out @FoxBusiness for the interview.", "2020-01-30T22:23:09.000Z": ". @GovernorLittle at the Hispanic Legislative Reception. #idpol", "2020-01-30T21:05:13.000Z": "It's great to see Idaho's agriculture and our farmers being highlighted by one of the world's largest brands, @AnheuserBusch ! #IdahoAg  #Idahome Contract for Change Contract for Change is Michelob ULTRA Pure Gold's commitment to create an organic future by helping farmers transition to organic through technical support, ... youtube.com", "2020-01-30T19:08:28.000Z": "See you in Parma tomorrow! #IDLeg  #IDpol Quote Tweet Brad Little @GovernorLittle Join me at my next Capital for a Day in Parma!", "2020-01-29T17:36:06.000Z": "One of my favorite things to do each session is meet with the House & Senate Legislative Pages. These bright young people have wonderful futures ahead! #Idleg", "2020-01-29T14:39:36.000Z": "The USMCA is a win for Idaho and America. Thank you @realDonaldTrump for championing this important agreement. @WhiteHouse", "2020-01-28T18:48:43.000Z": "Beautiful rainbow over Emmett!", "2020-01-28T17:20:16.000Z": "I am happy to proclaim January 28 as Idaho State University Day in Idaho! @IdahoStateU  #IDEdu", "2020-01-27T20:50:54.000Z": "It was great to honor the late Pete Cenarrusa and to speak to Idaho's youth at the NWACC/FFA Day on the Hill.", "2020-01-27T18:27:20.000Z": "Today is the 75th anniversary of the liberation of the Auschwitz-Birkenau death camp. Let us honor the victims of the Holocaust and ensure that future generations never forget the atrocities that were committed against the Jewish people and many others. #UnitedinMemory75", "2020-01-27T17:27:53.000Z": "@GovernorLittle just est. 8 wks of paid leave for Idaho's executive branch employees following the birth or adoption of a child. ID is the 3rd State to take action since we secured PFL for Federal workers last month(joining NM & TN). Working together, we are Putting Families 1st! Quote Tweet Brad Little @GovernorLittle Children benefit, parents benefit, and the state benefits when we support a culture that balances the demands of work with the demands of family. #IDpol  https:// gov.idaho.gov/pressrelease/g overnor-little-signs-families-first-act-guarantees-state-employees-eight-weeks-of-paid-parental-leave/ ", "2020-01-24T21:19:57.000Z": "The new WOTUS definition protects our nation's waters while providing the appropriate deference to the states. Thank you @USACEHQ and @EPA ! EPA and Army Deliver on President Trump's Promise to Issue the Navigable Waters Protection Rule - A... EPA News Release: EPA and Army Deliver on President Trump's Promise to Issue the Navigable Waters Protection Rule - A New Definition of WOTUS epa.gov", "2020-01-24T02:16:39.000Z": "A MUST-READ FROM #IDAHO  #TEACHER OF THE YEAR STACIE LAWLER! Stacie tells the story of how she became a champion for mental health in her opinion piece \"Don't rely on luck to address teens' challenges. Invest in social-emotional learning\" https:// sde.idaho.gov/communications /files/news-releases/01-23-20-Guest-opinion-by-Stacie-Lawler-Idaho's-2020-Teacher-of-the-Year.pdf   #idedu  #idleg", "2020-01-24T17:56:59.000Z": "It's been a great morning visiting with Idaho businesses and vendors at the SHOT Show in Las Vegas!", "2020-01-23T23:56:43.000Z": "Stay classy, Idaho. @DollyParton", "2020-01-23T17:34:43.000Z": "Thank you to our Idaho Chiefs of Police for keeping our neighborhoods safe! It was wonderful to see these law enforcement representatives from all corners of the state today!", "2020-01-22T23:18:40.000Z": "Great news! The USMCA will benefit Idaho families, farmers, businesses and workers! Quote Tweet The White House @WhiteHouse Next stop for USMCA: the desk of President @realDonaldTrump !  https:// thehill.com/policy/finance /479369-grassley-signs-usmca-sending-it-to-trumps-desk ", "2020-01-22T20:00:07.000Z": "Idaho governor extends paid family leave for state employees (from @AP ) #idpol  #idleg Idaho governor extends paid family leave for state employees BOISE, Idaho (AP) - Idaho Gov. Brad Little on Wednesday issued an executive order increasing paid leave for parents in the executive branch to eight weeks. The Republican governor signed the... apnews.com", "2020-01-22T19:59:12.000Z": "Children benefit, parents benefit, and the state benefits when we support a culture that balances the demands of work with the demands of family. #IDpol  https:// gov.idaho.gov/pressrelease/g overnor-little-signs-families-first-act-guarantees-state-employees-eight-weeks-of-paid-parental-leave/ ", "2020-01-22T17:39:24.000Z": "On January 20th, @GovernorLittle recognized members of the Joint Field Office that handled the response to spring flooding in 2019 that affected 5 Idaho counties and the Nez Perce Tribe. Read more here, http:// shorturl.at/mopG7", "2020-01-22T17:15:16.000Z": "I think Marie Kondo is on to something! #IDLeg  #IDpol Little decides to 'spark joy' with agency rules reduction Gov. Brad Little recently issued two executive orders reducing the number of administrative rules and making them easier to understand. Photo by Sharon Fisher After a summer of Marie Kondoing Idaho... idahobusinessreview.com", "2020-01-21T18:29:54.000Z": "Join me at my next Capital for a Day in Parma!", "2020-01-20T20:19:27.000Z": "I issued two very special proclamations today recognizing Martin Luther King Jr. and Human Rights Day and the 125th Anniversary of the Jewish Community in Idaho.", "2020-01-20T16:40:52.000Z": "I will have a special announcement this week that takes steps to put Idaho families first. Watch on Facebook live Wednesday at 11:30 AM MST as I make the announcement in my ceremonial office. #IDpol  #IDGov", "2020-01-20T14:00:00.000Z": "This week's legislative agenda is all about my number one priority: EDUCATION. Please join me in supporting Idaho's schools, universities, and educators as we celebrate and recognize the efforts of public education stakeholders in our state. #IDLeg GIF", "2020-01-17T17:47:22.000Z": "More great news on trade from the White House! The signing of the trade agreement between the U.S. and China bodes well for Idaho businesses from a variety of sectors. @WhiteHouse  @realDonaldTrump President Donald J. Trump Has Secured a Historic Phase One Trade Agreement with China | The White... NEGOTIATING A HISTORIC AGREEMENT: President Donald J. Trump has reached a historic phase one trade agreement with China. As a result of President Donald J. whitehouse.gov", "2020-01-17T17:26:57.000Z": "Today I issued a proclamation declaring January as Human Trafficking Awareness Month in Idaho. #IDleg", "2020-01-17T15:00:00.000Z": "One of the staples of conservative governing is to put money back into taxpayers' pockets. I have long supported tax relief for Idahoans on the most basic of needs - groceries. #IDLeg  #GroceryTax", "2020-01-16T20:12:55.000Z": "A powerful new executive order from @GovernorLittle today. It includes mandated repeals of rule chapters every 5 years, a regulatory cap, retrospective analysis requirements, & more... A best practice for sure. Other states should take notice, and DC too! Office of the Governor gov.idaho.gov", "2020-01-16T18:55:29.000Z": "It is the nature of government to grow and for increased regulations to creep into our lives. My Zero-Based Regulation executive order is designed to prevent the accumulation of costly, ineffective, and outdated regulations over time. #IDLeg  #IDpol  https:// gov.idaho.gov/pressrelease/g overnor-little-signs-two-executive-orders-further-cutting-government-red-tape/ ", "2020-01-16T15:00:00.000Z": "I believe our people have greater opportunities to prosper when government limits regulatory hurdles, respects taxpayers by spending their money as efficiently as possible, and focuses as much on the needs of tomorrow as the needs of today. #IDLeg", "2020-01-15T23:31:02.000Z": "STEM Matters! Governor Brad Little spoke to the importance of STEM education opportunities for Idahoans at the STEM Matters! event at the Capitol building today. Here kids were able to experience hands-on STEM activities from businesses and students across the state", "2020-01-16T00:23:29.000Z": "@GovernorLittle live in the studio talking about everything from refugees to school funding! I'll have a report on his visit tonight at 9:00 and 10:00 on @CBS2Boise .", "2020-01-15T23:08:35.000Z": "The Trump Administration is investing close to $1 billion in transportation infrastructure. About 25% will be spent on rural projects. Providing a safe system of transportation that facilitates commerce & travel is an essential role of government. Infrastructure For Rebuilding America U.S. Secretary of Transportation Elaine L. Chao Announces $906 Million Investment to Revitalize America's Infrastructure transportation.gov", "2020-01-15T18:17:43.000Z": "Yesterday, Major Spencer received a Distinguished Achievement Award from @GovernorLittle for leading the team of ISP Employees who worked to reduce government regulations in Idaho.", "2020-01-15T15:00:01.000Z": "#IDEdu  #IDLeg", "2020-01-14T21:38:06.000Z": "The Idaho Suicide Prevention Hotline has partnered with Idaho's 211 Careline, making it easier for 211 callers who may be in crisis to reach the hotline. This easy-to-remember number will help save lives! #211", "2020-01-14T17:51:32.000Z": "These plans offer low-cost insurance to people priced out of Obamacare and draw them back into the insurance market. Idaho's 'enhanced short-term plans' a hit with consumers | BenefitsPRO With the debut of the policies, Idaho has gone further than any other state in loosening requirements imposed by the ACA. benefitspro.com", "2020-01-14T15:00:00.000Z": "My budget keeps our foot on the gas and makes historic investments in literacy ongoing! #IDedu  #IDLeg", "2020-01-13T18:17:05.000Z": "I subscribe to the view that it is better to prepare children today than to repair them later. #IDLeg  #IDEdu ISJ EDITORIAL: Little building legacy as Idaho's pro-education governor Idaho Gov. Brad Little said during his recent State of the State address that education is his No. 1 priority. idahostatejournal.com", "2020-01-13T15:00:00.000Z": "We cannot simply rely on the good hearts of teachers any longer to retain an effective teaching workforce in Idaho. We must pay them competitively. #IDedu  #IDLeg", "2020-01-12T18:28:49.000Z": "Happy Sunday from the ranch!", "2020-01-12T00:51:31.000Z": "Thank you and the good people of District 4 for letting me stop by! Quote Tweet Amador for Idaho @AmadorforIdaho Thanks for braving the North Idaho snow to attend our first Legislative District 4 Town Hall @GovernorLittle ! #idpol  #idleg", "2020-01-11T17:27:36.000Z": "Education is my number one priority. Getting all kids reading proficiently by the third grade will benefit every student throughout the K-12, college and career system. #idleg  #idedu Little: Literacy funding a must Idaho Gov. Brad Little said he intends to press for his education agenda during the state's legislative session and named funding for early childhood literacy a must-fund program during a lmtribune.com", "2020-01-10T19:40:11.000Z": "Talking with @GovernorLittle today @KLEWNews on everything from vaping, possible hands free cellphone laws, the opioid epidemic and education at all levels.", "2020-01-10T17:06:45.000Z": "I interviewed @GovernorLittle this morning for this week's @IdahoReports . We covered a lot of ground in 23 minutes: his agenda for the 2020 #idleg , and his take on Idaho growth and a possible economic downturn. Catch the interview tonight at 8:30 p.m. on @IdahoPTV", "2020-01-09T19:53:38.000Z": "Join me in honoring our officers on this National Law Enforcement Appreciation Day. #LEAD2020", "2020-01-09T17:52:50.000Z": "I am a strong advocate of healthy lands and waters, and I support President Trump's plans to update the National Environmental Policy Act (NEPA). @WhiteHouse  #NEPA Office of the Governor gov.idaho.gov", "2020-01-09T16:46:07.000Z": "We have such a dire need for skilled career technical workers in our state. That's why my budget recommends more funding for career technical programs at Idaho colleges. #IDedu  #IDleg Little talks benefits of career tech classes during visit to Bonneville Gov. Brad Little complimented the approach that Bonneville Technical Careers High School uses to prepare students for jobs after touring the campus Wednesday morning. postregister.com", "2020-01-08T17:15:34.000Z": "What is Shared Stewardship? Governor Brad Little spoke of advancing Shared Stewardship in his State of the State and Budget Address this week. The program helps reduce fire risk, creates jobs, and promotes forest health. https:// idl.idaho.gov/forestry/stewa rdship/index.html ", "2020-01-09T02:24:27.000Z": "Thank you, @woolstes ! It was great to see the amazing work you and our educators are doing in D93. Keep up the good work! Quote Tweet Dr. Scott Woolstenhulme @woolstes ...We had the wonderful opportunity to welcome ... @GovernorLittle  to @bjsd93 Technical Careers HS today to learn about the benefits and challenges of CTE programs. It was awesome to see our governor's passion for and commitment to our public schools.", "2020-01-08T20:06:37.000Z": "In Idaho, @GovernorLittle prioritized literacy, teachers and public education in his #StateoftheState address this week. He also discussed regulatory reform, grocery tax relief, budgeting, investments in public safety and corrections, and health care. Office of the Governor gov.idaho.gov", "2020-01-08T19:12:28.000Z": "Bonneville Technical Careers High School students get hands-on career training while still in high school, preparing them for high-paying jobs right after graduation. Great things happen when we invest in career technical education! #idedu  #idpol", "2020-01-07T18:53:02.000Z": "I am happy and honored to proclaim today Peace Officer Standards and Training Day! Happy 50th anniversary to POST!", "2020-01-07T16:34:20.000Z": "Idaho is a better place because of 2020 Teacher of the Year Stacie Lawler! Quote Tweet Idaho Dept of Ed @IdahoSDE Thank you @GovernorLittle for inviting 2020 #Idaho  #Teacher of the Year Stacie Lawler to #Boise for your State of the State Address, showcasing her wonderful accomplishments to the large audience of Idahoans listening in! #idedu  @IdSBOE  @stacielawlerID1", "2020-01-06T22:40:59.000Z": "I'm committed to working with the Legislature to invest in education, continue reducing regulatory burdens, and increase all Idahoans' prosperity and quality of life. More from my State of the State and Budget Address here: https:// gov.idaho.gov/pressrelease/g overnor-little-highlights-education-other-priorities-in-2020-state-of-the-state-and-budget-address/   #IDLeg", "2020-01-06T19:37:50.000Z": "Members of Idaho's House and Senate have officially welcomed me to the 2020 Legislative Session! #idleg", "2020-01-06T17:12:15.000Z": "The 2020 Idaho legislative session convenes today with @GovernorLittle State of the State address. Stay up to date with the Legislature by watching Idaho in Session Legislature Live: https:// idahoptv.org/shows/idahoins ession/Legislature/   #IDpol  #IDgov  #IDleg", "2020-01-06T16:00:42.000Z": "The 2020 Idaho legislative session convenes today with @GovernorLittle State of the State address. Stay up to date with the Legislature by watching Idaho in Session Legislature Live https:// idahoptv.org/shows/idahoins ession/Legislature/   #IDpol  #IDgov  #IDleg Idaho in Session Legislature House and Senate sessions, committee meetings, court hearings, and more live streamed from all three branches of Idaho's government. idahoptv.org", "2020-01-03T20:42:50.000Z": "Don't worry @GovSisolak and @GovMikeDeWine , I'll keep an eye on your boys while they're in Idaho! #IdahoPotatoBowl  #BattleBorn  #BleedGreen", "2020-01-02T21:18:54.000Z": "Looking forward to hearing from @GovernorLittle and #idleg leadership at the AP Legislative Preview tomorrow morning! Idaho journalists, you don't want to miss it: 9 a.m. in Statehouse WW55, with coffee and pastries for the early birds. #idpol", "2020-01-02T18:07:06.000Z": "Ever wonder why flags are at half-staff? Now you can sign up to receive electronic notifications whenever a flag status update is issued! https:// idaho.gov/flag/  #Idahome  #idpol  #IDGov  @GovernorLittle", "2020-01-02T15:42:23.000Z": "Please plan for delays or use alternate routes until the engines are removed & roads are cleared. Quote Tweet Idaho State Police @ISPNorthIdaho Boundary County Emergency Management, BNSF, ISP, Boundary CSO/EMS/Fire are on scene of a train derailment in the area of Crossport just east of Bonners Ferry. Be aware that local roads in the area may be congested or intermittently closed as crews work to remove the engines.", "2020-01-02T16:28:49.000Z": "Did you know that you can gain an Advanced Technical Certificate in CNC Machining Technology through @LCSC Lewis-Clark State College?\n\nLearn more here: http:// catalog.lcsc.edu/professional-t echnical-programs/technical-industrial-division/advanced-technical-certificates/automated-manufacturing-technology/ ", "2020-01-01T13:00:00.000Z": "Happy New Year! Let's make 2020 a great one! #IDGov  #IDpol", "2019-12-31T13:00:00.000Z": "Ten years passed between these two pictures. I am thrilled to keep serving Idahoans into the next decade! #IDpol  #10yearchallenge", "2019-12-30T13:00:12.000Z": "We were thrilled to tag along a few weeks ago as @GovernorLittle honored our customers, @cwidaho and @agropur , with 2019 Idaho Awards for Leadership in Energy Efficiency! The Governor congratulated them on their commitment to smart, cost-effective, responsible energy practices.", "2019-12-26T13:00:00.000Z": "Thank you for making 2019 a great year! Happy New Year, and we'll see you in 2020! #IDLeg  #IDpol  #IDGov", "2019-12-24T18:04:46.000Z": "The latest edition of my bi-weekly bulletin is out now: Merry Christmas From the Desk of the Governor. #IDpol  https:// conta.cc/2Sobgcc", "2019-12-24T17:36:22.000Z": "Wishing you a Merry Christmas and  a Happy New Year!", "2019-12-23T23:19:09.000Z": "Wishing you light and laughter as you gather together. #HappyHanukkah", "2019-12-20T18:22:19.000Z": "We had a great year in 2019, but I am looking forward to making 2020 even better for Idahoans. You can watch my full interview this Sunday morning at 6:30 on Viewpoint on @KTVB with @DougPetcashKTVB ! #IDpol Viewpoint: Gov. Little discusses top issues and priorities heading into 2020 Education, the budget, deregulation, Medicaid expansion and trade are a few of the major issues the governor is focused on now and for the coming year. ktvb.com", "2019-12-20T18:13:46.000Z": "Reflections at Christmastime from First Lady Teresa Little -- Happy holidays! https:// conta.cc/2Z8bA0l", "2019-12-19T21:53:49.000Z": "I applaud the U.S. House for passing #USMCA . This trade deal strengthens North American partnerships that benefit Idaho workers, businesses, farmers and ranchers! #USMCAnow Trump to now focus on trade deals after USMCA passage Passage of the deal is not only a crucial win for the president going into his 2020 reelection campaign but also a victory for Democrats. politico.com", "2019-12-19T18:50:30.000Z": "Idaho is no. 2 in the nation for best economic outlook! We consistently rank as one of the top states for job growth, economic momentum, low unemployment, and personal income growth - and we're now the least regulated state in the country! #IDGov  #IDpol Idaho governor removed, simplified 75 percent of state regulations Gov. Brad Little, (R-ID), discusses how he made his state's economy the second-best in the country. video.foxbusiness.com", "2019-12-19T16:22:20.000Z": "Our Governor has worked with groups from all over the state to advance Idaho. He is representing #Idaho 's & our people's innovation and creativity all the way up to the POTUS.  Thanks, @GovernorLittle ! We are so proud of you. #IDpol", "2019-12-19T16:09:41.000Z": "This important trade agreement could be brought to the House floor for a vote this week! I strongly support Trump's trade deal with Canada and Mexico. It is a good for Idaho. https:// gov.idaho.gov/pressrelease/o pinion-now-more-than-ever-we-need-support-for-trumps-trade-agreement-with-canada-and-mexico/ ", "2019-12-18T21:27:38.000Z": "Enhanced Short-term Plans provide good coverage at better prices. The plans are another way we are working to make health care more affordable for Idaho families. #IDpol Office of the Governor gov.idaho.gov", "2019-12-18T17:49:55.000Z": "Definitely said Brad Quote Tweet Marissa Morrison Hyer @IdahoMarissa Honestly, this is my best work.", "2019-12-17T17:04:19.000Z": "I appreciate President @realDonaldTrump for inviting me to share how Idaho achieved historic regulatory cuts this year! I am proud Idaho is leading in the area of regulatory reform and providing a template for other states and the federal government to follow. @WhiteHouse  #IDpol", "2019-12-16T22:16:00.000Z": "It was an honor to meet with @realDonaldTrump and @VP today to discuss the Governors' Initiative on Regulatory Innovation. Idaho leads the way in #RedTapeReduction as the least-regulated state in America! @WhiteHouse  #IDpol  #IDGov", "2019-12-16T16:01:15.000Z": "@GovernorLittle The 2019 final report is now available from Governor Brad Little's \"Our Kids, Idaho's Future\" task force that he formed to strengthen K-12 public education in Idaho. #highered  #idedu Read the full report details here: https:// boardofed.idaho.gov/education-init iatives/our-kids-idahos-future/ ", "2019-12-14T18:18:54.000Z": "It's been a productive two days here at WGA. What a privilege to be sharing successes and lessons learned with my fellow western governors! @westgov", "2019-12-13T21:19:19.000Z": "The USDA ReConnect Program furnishes loans and grants to provide funds for broadband services in eligible rural areas. Beginning on January 31, 2020, applications can be submitted online. More program and funding information is at https:// usda.gov/reconnect . @IdahoCommerce ReConnect Loan and Grant Program usda.gov", "2019-12-13T21:08:48.000Z": "The 2019 final report from my \"Our Kids, Idaho's Future\" task force is now available. The recommendations form the basis of my education budget and policy recommendations for the 2020 legislative session and beyond. #IDLeg  #IDedu Office of the Governor gov.idaho.gov", "2019-12-13T17:15:14.000Z": "IN CASE YOU MISSED IT: Find out where to watch #Idaho  @GovernorLittle deliver his opening remarks, as well as the rest of the panels from WGA's recent Post Falls Reimagining the Rural West workshop http:// ow.ly/KqMJ50xt93w", "2019-12-12T22:00:29.000Z": "President Debbie Critchfield speaking about the Idaho State Board of Education and the presidents of Idaho's four-year institutions freezing tuition increases in 2020. https:// boardofed.idaho.gov/resources/arti cle-higher-education-in-idaho-investing-in-our-future/ ", "2019-12-12T22:03:53.000Z": "CWI is proud to offer high-quality education at a great value. #MightyCWI is leading Idaho's Colleges and Universities by maintaining our Tuition for 4 years at $139/credit. #idedu  #Idleg  #idpol", "2019-12-12T21:37:42.000Z": "Great news: Boise State is freezing in-state undergrad tuition for next year! Idaho's public universities have the 8th lowest tuition in the country; President @marlenetromp and all of us @boisestate are committed to keeping campus accessible and affordable for ALL students.", "2019-12-12T21:56:19.000Z": "When we make tuition affordable, increase access to scholarships, and push for efficiencies at the universities, the result is a strengthened workforce and more opportunities for Idahoans to improve their lives. #IDedu  #IDpol COLLEGE & UNIVERSITY PRESIDENTS ANNOUNCE PLAN TO FREEZE TUITION NEXT YEAR | Idaho State Board of... boardofed.idaho.gov", "2019-12-12T21:08:10.000Z": "Graduating seniors of #Idaho high #schools : the application period for the Idaho Governor's Cup #Scholarship is open! Apply & find eligibility requirements thru @IdSBOE  https:// boardofed.idaho.gov /idaho-governors-cup-scholars/ @GovernorLittle  @nextstepsidaho", "2019-12-11T20:11:30.000Z": "The White House is accepting applications for the 2020-2021 fellowship year. Dakota Roberson from Shelley, Idaho, is a White House Fellow this year, and we want more Idahoans in this program! \n\nMore info here: https:// fellows.whitehouse.gov", "2019-12-11T18:11:46.000Z": "What a joy to take part in Hour of Code and proclaim this week \"Computer Science Education Week\" in Idaho! #HourOfCode2019  #Idahome  @IdahoSTEMAC", "2019-12-11T16:14:13.000Z": "I have been steady in my support of this important trade agreement, and I encourage Idahoans to speak up and share their support of it, too. #USMCANow  @WhiteHouse Office of the Governor gov.idaho.gov", "2019-12-10T22:46:10.000Z": "It was an honor to present CWI with the Leadership in Energy Efficiency Award. Improvements to their system will save $23,000 per year! @cwidaho", "2019-12-10T20:11:53.000Z": "Thank you Idaho Governor Brad Little for joining us at Garfield Elementary today to celebrate Hour of Code and encourage our students to engage in STEM related activities & careers! @GovernorLittle  #HourofCode2019  #EverythingsPossibleBSD  #BSDPride", "2019-12-10T18:43:17.000Z": "We spy a http:// Code.org sticker on @GovernorLittle 's cowboy hat! Quote Tweet Eric Rausch @wranglerrausch Start em' early! Hour of Code @garfield6thgrade fuels dreams for the future with a proclamation @GovernorLittle . #idpol  #bsdpride  @tayloc17  #everythingspossiblebsd  @MicronGives", "2019-12-06T14:05:29.000Z": "Mining has built and transformed Idaho for many years. On #NationalMinersDay , we thank the men and women who represent a very important industry.", "2019-12-06T15:10:22.000Z": "@GovernorLittle announced today his appointment of Kurt Liebich of Boise to the State Board of Education. \n\nCongratulations to Kurt Liebich! Read more here: https:// gov.idaho.gov/pressrelease/g overnor-little-appoints-kurt-liebich-to-state-board-of-education/ ", "2019-12-05T22:12:05.000Z": "Kurt's extensive experience in education policy and business is a welcome addition to the body that governs Idaho's public kindergarten through college education system. #IDedu Office of the Governor gov.idaho.gov", "2019-12-04T22:57:49.000Z": "Idaho Gov. @GovernorLittle cuts about 40 percent of Idaho rules in his first year in office. #IDpol Gov. Brad Little: Idaho is now least-regulated state in the country Idaho Gov. Brad Little says in one year, the state cut or simplified 75% of its rules. idahostatesman.com", "2019-12-04T22:00:00.000Z": "Since I took office in January, I've worked with the Idaho Legislature and agencies within my administration to eliminate 1,804 pages of the administrative code. For every chapter added, 83 chapters were cut! #IDLeg  #RedTapeReduction  @WhiteHouse  @VP  @realDonaldTrump", "2019-12-04T21:26:54.000Z": "BREAKING: @GovernorLittle 's Idaho Leads The Nation In Cutting Red Tape! https:// rga.org/governor-brad- littles-idaho-leads-nation-cutting-red-tape/   #idleg  #idpol", "2019-12-04T20:25:49.000Z": "Thanks to @GovernorLittle and the Idaho Legislature, Idaho is now the least-regulated state in the U.S. after simplifying 75% of its rules in a single year. Nice work, Governor and Legislature! #idpol", "2019-12-04T19:32:49.000Z": "I appreciate the support of the Legislature and the agencies within my administration for helping me achieve the largest regulatory cuts in Idaho history! #IDLeg  #IDpol  #RedTapeReduction  @WhiteHouse  @VP", "2019-12-04T19:28:06.000Z": "Congrats, Idaho! We're now the least-regulated state in the nation! #IDleg  #IDpol  #RedTapeReduction  @WhiteHouse  @VP  @realDonaldTrump  https:// gov.idaho.gov/pressrelease/i daho-cuts-and-simplifies-75-percent-of-rules-in-one-year-becomes-least-regulated-state-in-country/ ", "2019-12-03T21:20:40.000Z": "This has @GovernorLittle as 7th-most popular in the country. From Morning Consult's third-quarter polling: https:// morningconsult.com/governor-ranki ngs-q2-19/   #idpol  #idleg This Tweet is unavailable.", "2019-12-03T20:16:38.000Z": "I'll deliver the latest update on Idaho's historic regulation reductions tomorrow at 11 a.m.! #IDLeg  #idpol  #RedTapeReduction  https:// gov.idaho.gov/wp-content/upl oads/sites/74/2019/12/media-advisory-2019-1125.pdf ", "2019-12-03T16:30:33.000Z": "WATCH: #Idaho  @GovernorLittle kicks off the Post Falls Reimagining the Rural West Initiative workshop with opening remarks Post Falls Workshop: Opening Remarks by The Honorable Brad Little,... The Post Falls workshop of the Western Governors' Reimagining the Rural West Initiative will begin with opening remarks from Idaho Gov. Brad Little, as he di... youtube.com", "2019-12-03T03:34:11.000Z": "Thank you to everyone who made this year's Capitol Christmas Tree Lighting a success! Merry Christmas!", "2019-12-02T20:29:01.000Z": "How should journos kick off 2020? By getting on-the-record answers to pressing questions during the @AP Idaho Legislative Preview! @GovernorLittle chats with reporters starting at 9 a.m. Jan. 3, followed by a Legislative leadership panel. Statehouse WW55. #idpol  #idleg", "2019-12-02T16:30:31.000Z": "TOMORROW: WGA's Reimagining the Rural West Initiative workshop in Post Falls, #Idaho . Topics of discussion include strategies to increase energy efficiency, telehealth services in rural communities, and @GovernorLittle will deliver remarks. Stream it live http:// ow.ly/Fd8o50x47JX", "2019-11-28T13:00:00.000Z": "Happy Thanksgiving!", "2019-11-26T23:29:34.000Z": "Beautiful! #Idahome Quote Tweet IDPR @Idparksandrec Snowy evening on the Henry's Fork #IDStateParks  #Idaho", "2019-11-26T20:22:00.000Z": "I've had a great day in Glenns Ferry during Capital For A Day. Seniors in Elmore County didn't have time to get off the bus, so I got on!", "2019-11-26T17:53:22.000Z": "Today I am excited to be in my hometown for a Capitol for a day w @GovernorLittle and other leaders from @IDAHOgov", "2019-11-26T17:17:21.000Z": "We're just getting started at Capital For A Day in Glenns Ferry! We're here from 10 am to 3 pm. Stop in and say hello! #idleg  #idpol  #idgov", "2019-11-25T17:37:56.000Z": "The Idaho Capitol Christmas tree is cut! The Idaho Department of Lands cut and rigged the tree for lifting, Boise Crane loaded. This year's tree was donated by Cory and Chelsea Skinner, whose residence is in Garden City. They took this great time lapse. #christmastree", "2019-11-25T16:32:17.000Z": "See you tomorrow! #IDpol  #IDGov  #CFAD Quote Tweet Brad Little @GovernorLittle Capital for a Day is headed to Glenns Ferry! #CFAD  #IDGov  #IDpol", "2019-11-22T20:54:40.000Z": "In a data-driven society, connectivity is imperative for a vital economy. The task force members worked under an accelerated timeline to come up with the recommendations, and I appreciate them for their hard work! #IDLeg  #IDpol Office of the Governor gov.idaho.gov", "2019-11-22T15:00:01.000Z": "Can't wait to see you at the Capitol Christmas Tree Lighting!", "2019-11-21T17:51:12.000Z": "Idaho businesses are already benefiting from our trade mission in Asia! @SMHeuristics  #IDGov SMHeuristics brings back deals from Taiwan trade mission The Idaho delegation meeting with Megaforce, another Taiwanese company SMHeuristics works with. Photo courtesy of Gov. Little's office SMHeuristics, which participated in the recent trade mission to... idahobusinessreview.com", "2019-11-20T20:34:57.000Z": "This great partnership helps us address the growing need for professionals in the field of cybersecurity. I encourage young people who are interested to apply! Office of the Governor gov.idaho.gov", "2019-11-20T13:27:05.000Z": "Republican governors are taking state economies to new heights! According to @BLS_gov , the top 5 states for job growth in the past year are run by GOP govs - UT, FL, AZ, TX & ID. \n\nCongratulations @GovHerbert  @GovRonDeSantis  @dougducey  @GregAbbott_TX  @GovernorLittle", "2019-11-19T20:16:31.000Z": "I issued an executive order today to resolve conflicts between state and federal law related to the interstate transportation of hemp across Idaho. #IDPol  #IDleg  #IDGov Office of the Governor gov.idaho.gov", "2019-11-18T20:40:30.000Z": "Great launch of the Governors' Initiative on Regulatory Innovation this morning with @dougducey , @GovernorLittle , @GovStitt , and many governors from across the country. This initiative will help return power to the states.", "2019-11-18T20:39:26.000Z": "Help us celebrate the season at the Capitol Christmas Tree Lighting!", "2019-11-18T19:58:55.000Z": "Great news for Pocatello and Idaho! Quote Tweet FBI @FBI Today, the #FBI and our partners from @TheJusticeDept held a ribbon-cutting ceremony for a new data center at the FBI's facility in Pocatello, Idaho. http:// ow.ly/l66q50xdZr4", "2019-11-18T19:16:59.000Z": "This week, we celebrate the Idaho entrepreneurs who are generating ideas, innovation, and economic growth. Idaho is committed to making it easier for anyone to start a business. Thank you, Idaho entrepreneurs!", "2019-11-15T22:21:30.000Z": "Reading one of the classics to preschoolers at Mountain Home Head Start #IDedu", "2019-11-15T18:52:45.000Z": "Great groundbreaking ceremony yesterday for the @StanCraft JetCenter!  Thank you @GovernorLittle for being a big part of the event! @DauntlessAir is excited about our future at the Coeur D'Alene airport!! #wildfires  #rapidinitialattack", "2019-11-15T18:23:00.000Z": "Capital for a Day is headed to Glenns Ferry! #CFAD  #IDGov  #IDpol", "2019-11-14T21:38:32.000Z": "This is great news for those who are qualified and experienced in a field of expertise and have been thinking about becoming a teacher. The successful education of every child begins with an effective teacher! #idedu Office of the Governor gov.idaho.gov", "2019-11-13T23:36:55.000Z": "My latest bi-weekly bulletin is out now! More on Idaho's historic nuclear deal, how regulatory reform is benefiting the state, and an invitation to a very special event here: https:// conta.cc/32HwALy  #IDPol  #IDGov", "2019-11-13T22:08:46.000Z": "Teresa joined the Idaho STEM Action Center and Dutch Bros Coffee today to present Reuseum Educational Inc. with a $56,536 check to fund camps that explore science, technology, engineering, and math concepts. That's coffee for a good cause! @IdahoSTEMAC  @DutchBros  #IDedu", "2019-11-13T18:57:07.000Z": "The USMCA will benefit Idaho's farmers, ranchers, businesses and workers! I stand with my fellow governors in calling on Congress to ratify the United States-Mexico-Canada Agreement negotiated by President Trump. #USMCAnow  @realDonaldTrump  @WhiteHouse  @USTradeRep", "2019-11-12T21:12:52.000Z": "We're creating jobs in Idaho! Common sense regulatory reform has paved the way for 62 jobs (and counting) at the new CVS Pharmacy Tech Training Facility in Boise. My Red Tape Reduction Act will bring continued success to Idaho! #IDGov  #RedTapeReduction", "2019-11-12T17:57:48.000Z": ". @GovernorLittle dedicates this week to recognize the importance and safety of Traffic Incident responders @IdahoITD @IdahoStPolice @idahotow . https:// itd.idaho.gov/news/itd-gover nors-office-collaborate-to-promote-traffic-incident-safety-week-awareness/ ", "2019-11-12T17:13:13.000Z": "Live on a tele-townhall with AARP until 11 a.m.! Quote Tweet Idaho Public Radio @IdahoPubRadio The AARP live stream this morning with @GovernorLittle is at this link: https:// vekeo.com/event/aarpidah o-47290/ ", "2019-11-11T20:22:17.000Z": "An honor to speak at the Idaho State Veterans Home today. Thank you to our veterans and to the people who honor our veterans every day with their own service - the employees at the VA and Idaho Division of Veterans Services, volunteers, and the families of veterans.", "2019-11-11T18:04:27.000Z": "Thank you, @ThePostRegister ! #IDpol  #IDGov Cheers to Wasden and Little for spent fuel deal In the early days of the nuclear age, the deeply irresponsible decision was made to treat Idaho as a dumping ground. Waste created by nuclear weapons production was shipped from postregister.com", "2019-11-11T13:00:00.000Z": "On this Veterans Day, Americans, Idahoans, and all citizens of the free world celebrate the contributions of our veterans by honoring all who served and those who continue to serve, as well as those still listed as missing in action or prisoners of war. Thank you.", "2019-11-08T01:41:53.000Z": "Today's announcement from the Governor's office has been many years in the making. Congratulations to @GovernorLittle , @lawrencewasden , @ENERGY , and @INL on this historic agreement! Risch, Crapo Praise Idaho-DOE Spent Fuel, Waste Cleanup Agreement WASHINGTON - Today, Idaho Governor Brad Little and Attorney General Lawrence Wasden reached an agreement with the U.S. Department of Energy (DOE) to allow research quantities of commercial spent... risch.senate.gov"}