{"2020-07-31T19:51:23.000Z": "Today I joined @KDWPT Secretary Brad Loveless at Cheney State Park to thank workers and check out some of the park's newest features.", "2020-07-31T19:05:14.000Z": "Our first stop for the Office of Rural Prosperity's 2020 Virtual Tour is a week away! To register for the North Central meeting and the other regional meetings, visit https:// ruralkanprosper.ks.gov/2020-tour/  #KansasORP  #ORPTour2020", "2020-07-31T14:56:59.000Z": "The Tallgrass Heartland moratorium helps protect Kansas' unique ecosystem, vital to native wildlife, tourism, education, and future enjoyment. That's why I signed a proclamation reaffirming the moratorium. Gov. Kelly reaffirms Tallgrass Heartland wind moratorium Governor Laura Kelly has reaffirmed the Tallgrass Heartland wind moratorium region of the Flint Hills. wibw.com", "2020-07-30T21:16:24.000Z": "Many areas in our state are currently experiencing heavy rains, with flash flooding possible. Please remember not to drive across standing water in the roadway, and if you can, don't travel. Stay safe, Kansas. Four eastern Kansas counties under flash flood warning as rain approaches Kansas City The Kansas City metro area could get one to two inches of rain Thursday, increasing the risk of flash flooding. kansascity.com", "2020-07-30T17:30:37.000Z": "Areas of heavy rain are falling in parts of the state. If you don't have to get out in the heavy rain, don't. Some communities are experiencing flash flooding. \nIf you do drive and come across water over the roadway, #turnaround  #dontdrown GIF", "2020-07-30T18:00:38.000Z": "The pandemic has been stressful for all Kansans - including our youngest residents. Thanks to @SecNorman and Dr. Susan Voorhees for discussing ways we can guide children through these difficult circumstances. Psychologist advises parents talk with kids about anxiety, COVID-19 As kids prepare to head back to school this fall, either virtually or in person, they most likely have a lot of questions on their mind, said Susan Voorhees, a Topeka-based psychologist.COVID-19 has... cjonline.com", "2020-07-30T15:27:12.000Z": "These funds will provide aid to Kansans who need it most, help mitigate the spread of COVID-19, and accelerate our state's economic recovery. I appreciate the State Finance Council's action, which will help urban and rural Kansans alike.", "2020-07-29T20:03:40.000Z": "Wishing a happy birthday to long-time Senator Nancy Kassebaum, the first woman to represent Kansas in the United States Senate. Senator Kassebaum is a true trailblazer, and a mentor and inspiration for young women in Kansas. We appreciated your service to our state.", "2020-07-29T18:40:20.000Z": "Throughout the pandemic, @SecNorman of @KDHE has offered my administration measured, professional guidance on how to keep Kansans safe. I appreciate his continued service to our state. Editorial: Norman's advice would be well heeded Kansas is fortunate to have the talented, highly trained Lee Norman leading the Kansas Department of Health and Environment during a public health crisis.When Gov. Laura Kelly met with the editorial... cjonline.com", "2020-07-29T16:19:40.000Z": "Today, @GovLauraKelly signed Executive Order #20-60, extending the opportunity for Kansans under the age of 65 to renew driver's licenses online. Read Executive Order #20-46 here: https:// bit.ly/EO20-60", "2020-07-29T15:37:32.000Z": "My thoughts are with Mayor Everett Green and his family, and I wish him a speedy recovery. Mayor Green Tests Positive For COVID-19 facebook.com", "2020-07-28T20:53:28.000Z": "COVID-19 isn't going away anytime soon. We must take this threat seriously. #MaskUpKansas  #ksleg  https:// kansascity.com/news/coronavir us/article244544987.html  ? Kansas City metro sees record breaking day with more than 640 new COVID-19 cases The seven day rolling average for new daily cases is 488. One week ago, it was 362. Two weeks ago, it was 295. kansascity.com", "2020-07-28T15:30:43.000Z": "On this week's Kansan to Kansan, I'm pleased to join @LtGovRogers to announce the Office of Rural Prosperity 2020 Virtual Listening Tour and discuss the next step we're taking to improve the lives of rural Kansans. Register at: https:// ruralkanprosper.ks.gov/2020-tour/ . https:// youtu.be/-60u_ABJQIQ", "2020-07-27T21:53:39.000Z": "Today @KDOTHQ proposed a new regulation requiring railroads in Kansas to have a minimum of two crew members in a train's control compartment. This is a commonsense, necessary measure to continue protecting our state's workers and keep every community along the tracks safe.", "2020-07-27T17:07:57.000Z": "It's clear that COVID-19 can cause long-term health complications for people of all ages. All Kansans should be taking this threat seriously, and taking the necessary measures to protect their communities from disease spread. #MaskUpKansas COVID-19 patients in Wichita and Kansas getting younger Local and state health officials continue to learn new quirks about the virus, including its impact on younger hosts. kansas.com", "2020-07-26T18:12:41.000Z": "Today marks the 30th Anniversary of the passage of the Americans With Disabilities Act - but we must recognize that the fight for equality is not over. Let's recommit ourselves to advocating for inclusion for those living with disabilities in our country. Opinion | What Disabled Americans Really Want For true inclusion, we can't just follow the letter of the law; we must embrace its spirit. nytimes.com", "2020-07-24T20:52:24.000Z": "Wearing a mask is the most basic step we can take to keep COVID-19 from spreading in our communities. Masks are a must if we want to protect Kansans, get our kids back to school, and keep our economy open for business. #MaskUpKansas", "2020-07-24T19:58:16.000Z": "Community Development Block Grants are vital for Kansas communities recovering from the economic impact of COVID-19. The funds will strengthen local economies, improve the lives of Kansans, and keep our state open for business. 56 counties and cities receive Community Block Development Grants Governor Laura Kelly announced a second round of the COVID-19 aid Community Block Development Grants are being dolled out to 56 counties and cities around Kansas. wibw.com", "2020-07-24T17:15:03.000Z": "The following is my statement regarding the passing of former Kansas Senate President Dick Bond:", "2020-07-24T14:59:22.000Z": "Just this week, the KC metro area has broken its own record for daily increases in new COVID-19 cases - twice. This virus is still a very real threat to our communities and these trends are cause for concern. Wear a mask, social distance, and stay safe. Kansas City metro sees another record-breaking day for new COVID-19 cases The seven-day rolling average for new cases was 398. A week ago, it was 289. On July 1, it was 204. The metro added four deaths Wednesday. kansascity.com", "2020-07-23T21:15:13.000Z": "ICYMI: Editorial boards and other organizations across Kansas spoke out regarding the State Board of Education's vote to reject Governor Laura Kelly's school delay order. Read their statements here: ICYMI: Editorials and Statements Regarding the State Board of Education's Vote to Reject Governor... governor.kansas.gov", "2020-07-23T15:46:57.000Z": "Thank you to all Kansas school districts that have chosen to delay reopening until after the Labor Day holiday. I urge all districts across the state to do the same - we must work together to protect the health and safety of our students and educators. With Kelly's school delay order vetoed, Kansas schools left to decide their own start date OVERLAND PARK, Kan. - Kansas schools are no longer required to wait until after Labor Day to start classes.  The State Board of Education cast a split 5-5 vote Wednesday, which effectively th fox4kc.com", "2020-07-22T17:43:49.000Z": "The following statement is from Governor Laura Kelly regarding the State Board of Education's vote to reject her executive order delaying the start of school:", "2020-07-22T16:20:20.000Z": "Wear a mask. Quote Tweet Hannah Brandt @hannahKSNT BUSTING MASK MYTHS: Dr. Donepudi with Stormont Vail Hospital explained why 5 common myths about wearing masks are wrong. \n\nFull Story here ---> https:// ksnt.com/health/coronav irus/local-doctors-helps-bust-common-mask-myths/ ", "2020-07-22T15:32:22.000Z": "Happy Birthday to my friend @SenatorDole . Thank you for your lifelong service to the people of Kansas.", "2020-07-22T14:42:04.000Z": "\"Ten (years old) up to young adults are very much in that super spread category, and even though they may have mild to no symptoms, they still can, very easily still infect those around them.\" \n\nKeeping younger Kansans healthy protects ALL of us. Wichita pediatricians discuss study on spread of COVID-19 among children, teens More than half of the COVID-19 cases diagnosed in Sedgwick County are now in people younger than 40 and with the school year around the corner, a new study out of South Korea seeks to provide more... kwch.com", "2020-07-21T23:16:07.000Z": "Tune into Fox News tonight at 6:20 p.m. I'll be talking with Martha MacCallum about steps my administration is taking to keep Kansans healthy and keep our economy open for business.", "2020-07-21T15:24:26.000Z": "Yesterday I signed Executive Order 20-59, outlining safety procedures schools must take to protect students, teachers, and parents, and our economy. It mandates face coverings, hygiene stations, temperature checks, and social distancing. Governor Kelly Signs Executive Orders Delaying Schools, Implementing Mitigation Procedures -... governor.kansas.gov", "2020-07-21T15:04:48.000Z": "Before census workers come to your door, you can self-respond at http:// 2020census.gov , 844-330-2020, or returning the form you received in the mail. Ensure your community gets its fair share of funds for schools, hospitals, roads, public works, & more. Are you among Kansans who haven't responded to the census? Expect a knock on your door The statewide response rate is 65.9%, and federal employees will have to visit the remaining addresses to collect responses in person. kansas.com", "2020-07-19T16:24:59.000Z": "Please read the letter I sent to our State Board Members. I sincerely appreciate our LPS staff who are serving on our Together Again task force for their leadership, time, & dedication to this challenging task. This is an uncertain & emotional time for staff and families. (cont.)", "2020-07-20T17:55:53.000Z": "Today's announcement of U.S. 50 T-WORKS project will bring jobs, safety, and a long-term economic boost to the community. My administration is committed to rebuilding our infrastructure and putting an end to using critical transportation dollars to cover the state's unpaid debts.", "2020-07-20T14:58:36.000Z": "\"While there remains work to be done to relieve our state's strained child welfare system, we have made significant progress in getting it back on the right track.\" New report card from Gov. Laura Kelly puts Kansas' foster children on the right path The new Foster Care Academic Report Card will make the system more accountable. kansascity.com", "2020-07-18T14:26:17.000Z": "John Lewis was an American hero, a leader in the Civil Rights Movement and the \"conscience of Congress\". He spent his life serving his country and the African American community. \n\nThe best way to honor his legacy is by fighting to make America a more equitable place for all.", "2020-07-17T22:56:41.000Z": "The #KansasCREJ wants to hear from you. Engaging with the public will be crucial to crafting recommendations and policies that are specific to Kansas, and to amplifying as many voices throughout the community as possible. Learn more at: Governor's Commission on Racial Equity and Justice - Governor of the State of Kansas governor.kansas.gov", "2020-07-17T21:36:12.000Z": "Thanks to the @CommBloodCtrKC for hosting the Governor's Blood Drive today. Due to COVID-19, our communities are experiencing a critical blood shortage - and donating is more important than ever. I urge Kansans to visit http:// savealifenow.org to find a blood drive near you.", "2020-07-17T17:43:55.000Z": "ICYMI: Editorial boards from across Kansas spoke out in support of Governor Kelly's order to delay schools. Read their stories here: ICYMI: Editorial Boards Across Kansas Agree Governor Laura Kelly's School Delay Order is Right... governor.kansas.gov", "2020-07-17T16:25:09.000Z": "Today on #ParksandRecreationProfessionalsDay , let's all thank the dedicated staff & volunteers at our state's parks. They have been working hard throughout the pandemic to keep parks open and ready for what has been a record number of visitors, and they deserve our appreciation.", "2020-07-16T20:14:46.000Z": "RT if you agree. Quote Tweet Lt. Governor Lynn Rogers @LtGovRogers This is deeply concerning, but it's more proof our decision to delay schools was the right one. We know children can carry and spread COVID-19. If we want to keep our economy open and reopen schools, every Kansan needs to do their part by wearing a mask. https:// thehill.com/changing-ameri ca/well-being/prevention-cures/507442-almost-one-third-of-florida-children-tested-are?fbclid=IwAR0RPdCC2O14C1a6G6o0NrEZEcUYpXMdSeOu_8GB8qaA9DUzAbLXqAnKlOk ", "2020-07-16T17:48:55.000Z": "We've seen what happens when guidelines aren't mandatory in our state. Schools must implement COVID-19 mitigation strategies including masks, sanitation, and temperature checks - the health of our students and our educators depends on it. Kelly: Executive order will mandate masks, temperature checks in schools An executive order that Gov. Laura Kelly will sign Monday to delay the reopening of schools also will make it mandatory that school districts use masks, practice proper hygiene and perform daily... cjonline.com", "2020-07-16T16:03:16.000Z": "Yesterday I appointed Amy Cline to fill the Kansas Court of Appeals vacancy created by retired Judge G. Joseph Pierron Jr. Ms. Cline will bring her bring her breadth of experience to the Court of Appeals where I'm certain she will be a fair and open-minded jurist.", "2020-07-15T20:12:04.000Z": "Today I announced that I will issue an executive order to delay opening schools until after the Labor Day holiday. The additional three weeks will provide schools time to get masks, thermometers, hand sanitizer and other necessary COVID-19 mitigation supplies.", "2020-07-15T20:10:29.000Z": "I believe that real leaders aren't afraid to confront crises head on, they don't sit back silently and wait for the situation to get worse.  \n\nThat's what I have done and will continue to do, regardless of the political consequences.", "2020-07-15T20:07:07.000Z": "CDC Director Robert Redfield said the use of masks, good hygiene, and social distancing is the most powerful weapon we have against COVID, and that it could be controlled in 1-2 months if we did our part and wore masks.\n\nI agree with Director Redfield. COVID-19 could be controlled in 1-2 months if people wear masks: CDC Director Robert Redfield Robert Redfield says masks, washing hands and social distancing are key to combatting the pandemic. abcnews.go.com", "2020-07-15T20:04:21.000Z": "Every action I have taken throughout this pandemic has been in done with three things in mind:\n\nKeeping Kansans healthy, keeping our state open for business and getting our kids back to school. \n\nThose decisions have been guided by public health experts and science.", "2020-07-15T16:58:17.000Z": "At 3 p.m. today, I will hold a press briefing to announce Kansas' education plan for the fall, and discuss the rising cases of COVID-19 in Kansas. @KDHE 's @SecNorman and @ksdehq 's @KsCommissioner will join me live. Watch on my Facebook page at https:// facebook.com/GovLauraKelly/ .", "2020-07-15T15:02:55.000Z": "Kansas veterans contribute significantly to their communities, and we owe them a debt of gratitude for their service to our country. We are proud to help Kansas veterans find careers in our state. Kansas launches new website aimed at helping veterans KANSAS - Governor Laura Kelly announces the launch of a new website aimed at helping Kansas veterans find careers. The new Kan Vet website will help connect veterans to employment resources,  fourstateshomepage.com", "2020-07-14T21:46:49.000Z": "If we're not diligent about practicing proper COVID-19 safety protocol, we could see hospitals across Kansas become overwhelmed. We must do all we can to prevent this from happening. Keep your family, your friends, & your neighbors safe by wearing a mask. Wichita hospitals could hit capacity this month with COVID-19 patients, mayor says With only eight ICU beds available, Wichita's hospitals are converting rooms into intensive care units to help with the surge of COVID patients. kansas.com", "2020-07-14T20:28:43.000Z": "We've hit the reset button on the Kansas Department of Labor. The response model being implemented will be able to be scaled up as needed and there will be more trained agents to get Kansans paid as quickly as possible. Read full update here: More call center workers join Kansas Department of Labor to handle unemployment surge Gov. Laura Kelly brought in an outside company to work with the Kansas Department of Labor after months of unemployed Kansans saying they couldn't access the system. The changes follow the resignat... kansas.com", "2020-07-14T18:46:09.000Z": "When most Americans go to the grocery store, they have no idea where their food comes from. Today I visited Brookover Feed Yard in Garden City to learn more and thank front line agricultural workers for stepping up to feed our state, our nation, & our world during this pandemic.", "2020-07-13T20:09:29.000Z": "The Commission on Racial Equity and Justice's meeting was a great first step as we work to craft policies that address structural inequalities in our country. Thanks to co-chairs Dr. Tiffany Anderson & Dr. Shannon Portillo for facilitating this discussion. https:// hayspost.com/posts/83d4b948 -17d6-4820-94bb-d93a75307e69 ", "2020-07-13T17:18:52.000Z": "We're lucky our dedicated @KDWPT Game Wardens are always on the lookout when we visit our state's beautiful parks & lakes. Keep wearing proper personal flotation devices when you're out on the water - & remember to thank a Game Warden for keeping us safe. https:// facebook.com/kdwptgamewarde ns/posts/2734781050140981 ", "2020-07-13T14:00:19.000Z": "Congratulations to @KSDofA Secretary DeAngela Burns-Wallace on this well-deserved honor. I know she will serve the Stanford University Board of Trustees well. Stanford University Board of Trustees elects four new members | Stanford News The new trustees, selected through the alumni nominations process, will begin their six-year terms on Oct. 1. news.stanford.edu", "2020-07-10T17:36:21.000Z": "Kansas' rolling Flint Hills offer some of the most beautiful, serene sights in our state. Take a break from COVID-19 news and social media, and watch here as they come to life. Or, better yet, take a trip this weekend and see them for yourself. Watch the Flint Hills awaken this spring in Kansas The annual fires and storms of the Kansas Flint Hills are captured in thousands of photos over the spring season. kansas.com", "2020-07-10T14:36:42.000Z": "I know Kansans want this pandemic to be over. But the rise in hospitalizations for younger patients is a cause for concern for all of us. All of us must diligently practice proper health and safety precautions, avoid gatherings, and wear a mask. Kansas City hospital seeing younger coronavirus patients A third of coronavirus patients admitted to Truman Medical Center are under 50 years old. kmbc.com", "2020-07-09T21:40:45.000Z": "Many thanks to @LtGovRogers and Marci Penner with the Kansas Sampler Foundation for spearheading this effort. Our young, rural Kansans are smart, talented, and will help us continue to build a 21st-century economy in our state. Young rural professionals see new opportunity to build career The Office of Rural Prosperity has launched a project for young rural professionals to build careers. wibw.com", "2020-07-09T20:22:09.000Z": "Happening now: My Commission on Racial Equity and Justice is holding its first meeting today to begin the process of finding & presenting policy actions Kansas can take on issues of racial equity and justice in our state. Tune in now to my YouTube channel: https:// youtube.com/watch?v=ylmJgK 8kuiU ", "2020-07-09T19:25:53.000Z": "Our exciting new Cost Share projects are great news for Kansas. We're investing about $20 million across the state to improve our transportation system, create jobs, and build a foundation for Kansas to be economically competitive now and into the future.", "2020-07-09T16:13:14.000Z": "It's unsurprising that Kansas is among the states with the smallest first-quarter decreases in GDP. Our quick, early action and our dedicated frontline workers will be the driving force on our road to economic recovery. https:// bea.gov/news/blog/2020 -07-07/gross-domestic-product-state-1st-quarter-2020 ", "2020-07-08T21:05:08.000Z": "COVID-19 has made life more difficult for all of us, but especially our most vulnerable communities. I'm pleased to announce new TANF grants that will immediately provide a boost in critical services for Kansas families & kids who need them more than ever. Gov. Kelly awards Youth and Family Stability Grants to state agencies Governor Laura Kelly and her administration have provided eight state agencies with TANF Family and Stability grants. wibw.com", "2020-07-08T19:46:02.000Z": "Public health shouldn't be political. Masks are a simple, proactive measure we can take to make sure school can resume in the fall and our economy remains open. How many Kansas counties rejected Gov. Kelly's mask mandate? The number is alarming If the mask mandate increases usage by just 15%, Johnson County could see its rate of positive tests fall back to 3.5% or so. kansascity.com", "2020-07-08T17:44:38.000Z": "Protecting and promoting positive mental health is especially important during an unprecedented pandemic. Crisis counseling programs are a vital support system reminding anyone who is struggling that they aren't alone, and help is available. https:// hayspost.com/posts/930c1b19 -3c95-4711-89e9-0ed1c8290474 ", "2020-07-07T20:13:31.000Z": "If we're going to keep our loved ones healthy & keep Kansas open for business, every Kansan must step up, wear a mask, socially distance, and practice good hygiene. This is not a question about personal freedom - this is a matter of social responsibility. Kansas sees 'steepest rate of increase' in new COVID-19 cases since pandemic began The rate of new confirmed coronavirus cases in Kansas is on the rise and doesn't appear to be slowing.In a news conference Monday afternoon at the Kansas Statehouse, Gov. Laura Kelly addressed that... cjonline.com", "2020-07-07T17:34:56.000Z": "These Cost Share program awards will help urban and rural communities in Kansas alike as we work to improve our transportation system across the state. Tune in live at 10 a.m. Thursday to view the awards at https:// facebook.com/KSDOTHQ/ . Quote Tweet KDOT @KDOTHQ Happening this Thursday!! @GovLauraKelly and Secretary Lorenz will have a big Cost Share announcement on our Facebook page! \n\nCheck out http:// facebook.com/KSDOTHQ Thursday at 10 am! #ksleg", "2020-07-07T15:44:26.000Z": "My administration is committed to protecting and supporting children in our foster care system. Today I issued an Executive Order implementing an annual education report card that will improve accountability and outcomes for children in foster care. Kelly issues executive order on Kansas' vulnerable children after vetoing related bill The governor's order says that \"as their legal custodian, the State of Kansas bears a heightened responsibility to make every effort to ensure Kansas students in foster care receive a quality... kansascity.com", "2020-07-06T20:52:26.000Z": "This is great news for our state's farmers, who have shown incredible resilience and compassion during the pandemic - and have stepped up to the challenge to keep food on the tables of Kansas families. Editorial: Wheat harvest good news was welcome While much of the growth in Kansas in recent years has been in urban or suburban areas, there's no question that our state continues to boast a robust agricultural sector. Kansas farms produce wheat... cjonline.com", "2020-07-06T16:17:34.000Z": "What's in vogue? Wearing masks. Saving lives.", "2020-07-04T14:53:56.000Z": "Best wishes to all Kansans for a safe and happy 4th of July celebration today. Please remember to wear a mask, socially distance, and wash your hands often.", "2020-07-03T15:02:27.000Z": "As you celebrate Independence Day this weekend, please remember: We are at war with COVID-19. Do your civic duty and wear a mask to keep your families and neighbors healthy and keep Kansas open for business.", "2020-07-02T20:23:48.000Z": "Thank you to the Kansas County Health Officers and Directors for your input on this serious subject. These public health professionals ask that you do you part to keep Kansans healthy and keep Kansas open for business. It's really that simple. #MasksSaveLives", "2020-07-02T19:52:33.000Z": "At 4:30 p.m. today I'll join @NPRKelly on \"All Things Considered\" to discuss Kansas' response to COVID-19, our new statewide mask requirement, and more. Tune in live on your local @NPR radio station.", "2020-07-02T17:02:34.000Z": "I know the pandemic has been difficult for Kansans, & all of us want to return to our normal lives. But recent weeks have seen the number of COVID-19 cases spike - and we must act. Masks are a simple way to keep Kansans healthy, & keep KS open for business. Kansas governor signs order mandating face masks in public The order requires Kansans to wear masks indoors, in most cases, or outdoors where six feet of social distancing cannot be maintained. kwch.com", "2020-07-02T14:58:03.000Z": "Today I issued an EO requiring that most Kansans wear a mask in public & in places where one is unable to maintain social distancing of six feet. Wearing a mask is the easiest, most basic step we can take to keep Kansans healthy & keep KS open for business. https:// governor.kansas.gov/wp-content/upl oads/2020/07/20200702093130003.pdf ", "2020-07-01T21:25:46.000Z": "The COVID-19 pandemic has brought to light what happens when we don't support and invest in public health. We must do better, as a state and as a nation. The health of Kansas residents, and our economy, depend on it. https:// kansascity.com/news/article24 3918717.html ", "2020-07-01T19:43:19.000Z": "ICYMI - Yesterday, Kansas joined the chorus of other states proclaiming that equal rights belong to all Americans, regardless of sex. We urge the National Archives and Records Administration to recognize the Equal Rights Amendment to the U.S. Constitution.", "2020-06-30T22:03:40.000Z": "Businesses in our state took a big hit when the pandemic began. Now more than ever, they need our support. Mask usage is proven to improve health outcomes, which is a simple way we can keep Kansans healthy, and keep Kansas open for business. Goldman Sachs says a national mask mandate could slash infections and save economy from a 5% hit A face mask mandate would not only cut the daily growth rate of new cases of Covid-19, but could also save the U.S. economy up to 5% in GDP. cnbc.com", "2020-06-30T17:30:28.000Z": "Yesterday marked the 100 year anniversary of the Negro Leagues. I have a poster signed by Buck O'Neill and other NBL icons in my office. I recommend everyone visit the Negro Leagues Baseball Museum in KC to learn about the important contributions the NBL made to our country.", "2020-06-30T14:26:37.000Z": "Health officials in Kansas agree - masks are safe, effective, and are proven to mitigate disease spread. Thanks to Dr. Steinshouer and @KWCH12 for sharing this important information, so we can keep Kansas open for business. Wichita pulmonary specialist straightens out fact vs. fiction with wearing masks Eyewitness News Monday spoke with a pulmonary care physician in an effort to separate myths from reality when it comes to masks. kwch.com", "2020-06-29T22:11:51.000Z": "Starting July 3, I will issue an Executive Order requiring masks be worn in indoor public spaces, and at any outdoor gathering in which social distancing cannot be maintained. This step will keep Kansans healthy, and keep Kansas open for business.", "2020-06-29T18:17:23.000Z": "Accenture has a wealth of experience when it comes to assisting states with COVID-related programs. Accenture will help us continue on the proactive steps we are taking to improve response times for Kansans who need help from @KansasDOL officials.", "2020-06-29T15:03:01.000Z": "This mobile testing unit is great news for our state. My administration and @KDHE officials will continue our efforts to break down barriers to testing access for vulnerable Kansans, so we can track the full scale and scope of this virus. Governor Laura Kelly Deploys Mobile Testing Unit to Assist Communities with COVID-19 Testing for... Governor Laura Kelly today announced The Kansas Department of Health and Environment (KDHE) deployed a Mobile Testing... More » wibwnewsnow.com", "2020-06-26T16:34:13.000Z": "On Friday, @GovLauraKelly , DCF Secretary Laura Howard, & Child Care Aware of Kansas ( @ccakansas )  announced additional benefits within the Hero Relief Program to continue to support child care providers impacted by the pandemic. \n\nNEWS RELEASE: http:// dcf.ks.gov/Newsroom/Pages/EnhanceHeroReliefProgram.aspx   #KSLeg Kelly Administration Announces Enhancements to Hero Relief Program dcf.ks.gov", "2020-06-28T00:13:12.000Z": "Masks are a simple and effective way to reduce the spread of COVID-19, and to help get our economy back on track. Every Kansan should take this easy, and necessary, step to protect our friends, family, and neighbors. Editorial: Want fewer virus rules? Wear your masks Here's the bad news.Across the nation, we're seeing new records set for COVID-19 cases. On Thursday, more than 40,000 were reported. Kansas has experienced an uptick as well, with 178 new cases... salina.com", "2020-06-26T21:19:39.000Z": "We know that high speed internet is essential for Kansas to compete in the 21st century economy. That's why I joined governors from across the country to call for President Trump and other Congressional Leaders to invest in a national broadband strategy.", "2020-06-26T18:37:51.000Z": "Feedback from the experts - teachers who are dealing with the challenges of distance learning every day - will help our administration ensure educators & students have the tools they need to succeed. Thanks to all who participated in this discussion. https:// shawneemissionpost.com/2020/06/26/sta te-leaders-educators-discuss-safety-and-logistics-of-teaching-during-covid-19-95473/ ", "2020-06-25T20:55:35.000Z": "I will call back the State Finance Council tomorrow morning, and every morning until our Republican colleagues approve this certificate of indebtedness.", "2020-06-25T16:28:20.000Z": "KS educators stepped up when schools were closed, & continued to give our kids the education they deserve. Today Lt. Gov. Rogers, Rep. Cindy Holscher, and I spoke with teachers about the challenges of distance learning & how this administration can support their work in the fall.", "2020-06-24T22:12:53.000Z": "Kansans have been through so much during this incredibly difficult time. I know some have struggled to get the services they need from the Department of Labor. My administration will use every resource at our disposal to improve services and get Kansans help.", "2020-06-24T20:39:53.000Z": "Mail-in ballots are easy to use, secure, and will help protect our state from further spread of COVID-19. I encourage all counties in Kansas to take the threat of the pandemic seriously and proactively send mail-in ballots to voters. Missouri, Kansas adjust election protocols amid COVID-19 In response to concerns over the coronavirus pandemic, the Johnson County Election Office is encouraging residents to vote by mail for the August primaries and November general elections. For the... kshb.com", "2020-06-24T17:10:41.000Z": "ICYMI: Read my op-ed at The Community Voice @cvoiceks regarding the formation of my Commission on Racial Equity and Justice.\n\nRead the full piece here: http:// communityvoiceks.com/news/kansas_ne ws/governor-laura-kelly-commission-on-racial-equity-and-justice/article_09712e92-b63b-11ea-a37f-7f8116d84e62.html ", "2020-06-23T19:57:06.000Z": "Big news today - I joined @KDOTHQ Secretary Julie Lorenz and @SecretaryToland to break ground at the site of the upcoming Heartland Logistics Park in Shawnee. The project is a smart, long-term economic investment that will also contribute to our economic recovery.", "2020-06-23T16:38:13.000Z": "Today I spoke with representatives of Kansas' manufacturing sector about our path to economic recovery and how we can bring more jobs to Kansas. They'll be an important partner for my administration to get Kansans back to work.", "2020-06-23T14:30:22.000Z": "We can't get back to work and back to school unless every community adheres to the health and safety guidelines laid out in Phase 3 of the \"Ad Astra\" plan. Please wear a mask, socially distance, and wash your hands often. KS Gov. Kelly recommends remaining in Phase 3 as COVID-19 cases trend upward Kansas Gov. Laura Kelly announced Monday she is recommending communities remain in Phase 3 of the Ad Astra recovery plan. kshb.com", "2020-06-22T21:51:21.000Z": "Kansas' wind energy sector employs thousands and contributes significant capital investment to our state each year - & its production only grows. Our position as a leader in renewable energy will be valuable as we overcome current economic challenges. These national companies are choosing Kansas energy to power their operations Kansas is producing more wind energy than ever and these national companies are the state's biggest buyers. kansas.com", "2020-06-22T21:38:00.000Z": "Wearing a mask is a simple and smart action you can take to reduce the potential spread of COVID-19. The path to safely reopening our economy and our schools will require responsibility on the part of each of us. #MasksSaveLives", "2020-06-22T20:31:13.000Z": "The Executive Committee of the Strengthening People and Revitalizing Kansas (SPARK) Taskforce met today to approve proposed operating expenditures for the Recovery Office and SPARK Taskforce for the 2021 Fiscal Year. Watch a recording of the meeting here: SPARK Executive Committee Meeting 6/22/20 youtube.com", "2020-06-22T19:41:06.000Z": "Today is the first day of Kansas' \"Call for the Count\" campaign to increase participation in the #2020Census . This week, I challenge every Kansan to contact at least five coworkers, family members, or friends and urge them to complete their Census. Our communities depend on it.", "2020-06-21T13:59:49.000Z": "Being a parent is hard work, filled with unexpected challenges. Ted is the best partner I could have asked for while raising our two daughters. He is unfailingly patient, kind, and always supportive. Happy #FathersDay to Ted, and to all fathers and father figures in Kansas.", "2020-06-19T18:30:05.000Z": "ICYMI: My administration is dedicated to protecting our seniors and others who are at a higher risk for COVID-19. Allowing more Kansans to apply online to renew their driver's license will help in our efforts to get our state back to school and back to work, safely.", "2020-06-19T15:51:14.000Z": "The importance of completing the #2020Census cannot be overstated. If 1% of Kansas' population is uncounted, we risk losing over $6 million in federal funding over the next 10 years. If you haven't yet, please take a moment to fill out your Census. Kansan to Kansan: Census The importance of completing the 2020 Census cannot be overstated. If 1% of Kansas' population is uncounted, we risk losing over $6 million in federal fundin... youtube.com", "2020-06-18T22:15:27.000Z": "Further proof of Kansas' place as a leader in wind energy production. This new expansion in Clark County will create jobs, capital investment, and benefit our environment.", "2020-06-18T20:32:57.000Z": "Thank you to the the @SpiritAero workers, who in partnership w/ @vyaire_medical , have worked tirelessly to produce ventilators for COVID-19 patients.", "2020-06-18T18:56:08.000Z": "Kansas made history when I-70 was completed 50 years ago. Through our new Eisenhower Legacy Transportation Program (IKE), we will carry on President Eisenhower's legacy by preserving what we have, and making improvements for the future. Governor celebrates 50 Years of I-70 in Kansas TOPEKA, Kan. (KSNW)  - Governor Laura Kelly today marked the 50th anniversary of the completion of I-70 in Kansas. The interstate stretches 424 miles across the state. At the time of comp ksn.com", "2020-06-18T16:17:43.000Z": "The following is my statement on the United States Supreme Court's decision Thursday to uphold the Deferred Action for Childhood Arrivals (DACA) program:", "2020-06-18T14:36:05.000Z": "Renewable energy leader @enelgreenpower is constructing a new 199 MW expansion to the Cimarron Bend wind farm. The expansion will involve the creation of 74 new wind turbines and will create more than 250 temporary jobs in Clark County. https:// bit.ly/2UT8fRB", "2020-06-16T21:49:05.000Z": "ICYMI Kansas' #2020Census count determines the federal funding our communities receive for schools, roads and public services. So if you haven't yet, please take a few minutes and complete your census. Southwest Kansas counties record low census response rates TOPEKA, Kan. (AP) - Census organizers in Kansas plan to ramp up efforts to get people counted, particularly in southwestern counties where response rates are low. Morton, Stanton,... apnews.com", "2020-06-16T18:51:35.000Z": "Meals on Wheels programs, food pantries and similar community organizations stepped up when COVID-19 caused an increased need for their services. Thank you for hard work providing food and care to all who needed it. Meals on Wheels of Eastern Kansas fulfills food, social interaction needs of homebound seniors... TOPEKA, Kan. (KTMJ) - Meals on Wheels of Eastern Kansas, Inc. continues meeting a critical need for many homebound seniors during the coronavirus pandemic. Zach Ahrens, vice president, strategic in ksnt.com", "2020-06-16T16:18:48.000Z": "Most Kansas counties are seeing a downward trend in hospitalizations and deaths, but 13 counties are experiencing increasing rates. Masks work, social distancing works. Let's continue to be cautious so we can protect our health, and get back to work and back to school.", "2020-06-16T14:11:41.000Z": "Thanks to @thermofisher for helping our state increase testing capacity, which will assist our careful recovery to get Kansans back to work, back to school, and prepared for future COVID-19 outbreaks. Thermo Fisher Scientific Inc. building new COVID-19 sample collection manufacturing facility in... Thermo Fisher Scientific Inc., a biotechnology company with offices in Lenexa, is building a new facility in the city to ramp up manufacturing of products for COVID-19 sample collection and shawneemissionpost.com", "2020-06-12T17:15:47.000Z": "The following is my statement on the death of former Wichita Mayor Carl Brewer.", "2020-06-11T19:08:30.000Z": "The pandemic has not stopped Kansas businsses from providing quality jobs for people across the state. Work is available - and @KansasWorkforce has adapted in order to connect workers and employers, even in the midst of COVID-19. Quote Tweet KANSASWORKS @KansasWorkforce KANSASWORKS is hosting a Virtual Statewide Job Fair beginning at 8am on June 23 & will end on June 25 at 5pm. Job seekers will have the opportunity to live chat with employers as the employer schedule allows. Join via computer or phone! Pre-register here:  https://kansaswo rksvirtualjobfair.easyvirtualfair.com", "2020-06-11T18:41:07.000Z": "Tune in at 4 pm CDT today, June 11, for the #COVID19 press conference with Secretary Lee Norman, M.D. and @GovLauraKelly . Watch it live or later on our Facebook pages.", "2020-06-11T16:11:58.000Z": "Kansas Governor Laura Kelly will join me tomorrow morning at 7:40am on the KLWN Morning Show.\n\nListen Live! : 101.7/1320 : https:// v7player.wostreaming.net/855  @GovLauraKelly  @LauraKellyKS", "2020-06-11T17:06:41.000Z": "In Kansas we are attracting and expanding businesses, creating jobs and strengthening our economy. With the diligent work of @KansasCommerce and hard-working business-owners across the state, we will use this momentum to move our state forward in economic recovery.", "2020-06-10T20:32:31.000Z": "Masks work. Social distancing guidelines work. If we don't follow the health and safety recommendations put in place by @KDHE , we risk lives and our economic recovery. No new COVID-19 cases after infected Missouri hairstylists worked with over 140. How? Health officials credited masks and several other factors. kansascity.com", "2020-06-10T18:37:40.000Z": "Frances has asked me to share her very important message for LGBTQ+ Kansans. We agreed that her message of inclusion and equality needs to be spread far and wide. Quote Tweet Frances, First Cat of Kansas @FirstCatofKS Proudly celebrating #PrideMonth with my new rainbow cape. I think I speak on behalf of all my pet-stituents when I say that LGBTQ+ Kansans are meowgnificent.", "2020-06-10T17:09:55.000Z": "Thanks to @vandersluis11 and @ktwu11 for inviting me to discuss systemic racism and my administration's plans to make our state a more equitable home for all Kansans. Tune in at 7:30 p.m. Thursday, June 18.", "2020-06-10T13:53:07.000Z": "Today marks the 57th anniversary of the #EqualPayAct . This anniversary is a reminder that even though we've made progress, women still get paid less than men for doing the same job.", "2020-06-09T22:55:01.000Z": "Strong winds are starting develop across portions of central and south central KS. The strong winds will later expand into southeast KS and continue through early tomorrow morning. The strongest gusts of 50 to 60 mph are expected mainly west of the KS turnpike. #kswx", "2020-06-09T22:40:44.000Z": "As a reminder during the #COVID19 response, the Kansas Division of Emergency Management recommends that your first priority be sheltering from a potential tornado. #kswx  @NWS", "2020-06-09T18:25:33.000Z": "ICYMI - Our SPARK task force met to put the plan in place to deliver federal recovery funds that KS communities need. My administration's top priority will be getting Kansans back to work & supporting community preparedness in case of future outbreaks. https:// hayspost.com/posts/5edeac09 ebfb13423b2746f4 ", "2020-06-09T16:22:17.000Z": "I'm proud to see Kansas schools going above and beyond to make sure each high school graduate experiences a meaningful ceremony during the COVID-19 pandemic. Congratulations Parsons Seniors! Graduation lasts 13 hours at Parsons parsonssun.com", "2020-06-09T14:35:15.000Z": "No child should ever go hungry. For Kansas parents worried about grocery bills, I strongly encourage you to apply for @DCFKansas ' Pandemic Electronic Benefit Program. Thousands of Kansas families are missing out on a special grocery payment during the pandemic KANSAS - Thousands of Kansas families are missing out on a special grocery payment during the pandemic. If you have a child in school that received free or reduced lunch in the last year, the fourstateshomepage.com", "2020-06-08T20:42:47.000Z": "Our agricultural industry is not immune to the challenges created by COVID-19. This weekend @KDHE  @SecNorman and @KansasDeptofAg Secretary Mike Beam joined @WIBWNews to discuss these challenges and how we are working to mitigate the effects of COVID-19. WIBW Radio/KAN Podcast: Kansas Farm Bureau Rural Report 10 | WIBW News Now Friday morning's Ag Issues program was the 10th edition of Kansas Farm Bureau's Rural Report. Joining farm... More » wibwnewsnow.com", "2020-06-08T19:45:44.000Z": "I will hold a press briefing at 4 p.m. today, June 8, to discuss the latest updates regarding COVID-19. Please visit my Facebook page at 4 p.m. to see the live broadcast. https:// facebook.com/GovLauraKelly/", "2020-06-08T18:21:58.000Z": "As our state enters stage 3 of @GovLauraKelly 's Ad Astra plan, the SPARK Taskforce is meeting to plan the revitalization of the Kansas economy. The Taskforce is made up of public and private-sector leaders and experts in economic development and recovery. Strengthening People and Revitalizing Kansas (SPARK) Executive &... Tune in live at 1 p.m. to view today's Office of Recovery Strengthening People and Revitalizing Kansas (SPARK) Executive & Steering Committees Meeting. youtube.com", "2020-06-08T18:11:55.000Z": "Do you need to renew a driver's license or state identification card? \n\nMost of our driver's license offices have reopened. Go to https:// bit.ly/ReopeningKDOR to see which offices are open and ready to take your appointments: \n\nAPPOINTMENTS ARE REQUIRED.\n(1/6)", "2020-06-08T17:49:41.000Z": "Kansas' local businesses make up the fabric of our rural communities. We must do all we can to assist them as they navigate the hardships caused by COVID-19, & I applaud NetWork Kansas' commitment to making these Restart Kansas loans possible. Learn more: https:// hayspost.com/posts/5eda73db ebfb13423b2714d4 ", "2020-06-08T16:36:06.000Z": "On this week's Kansan to Kansan, I discuss how we can celebrate #PrideMonth by recommitting ourselves to standing up for equality and coming together to celebrate and embrace all people, regardless of their sexual or gender identity. Kansan to Kansan: Pride Month On this week's Kansan to Kansan, we celebrate Pride Month by recommitting ourselves to standing up for equality and coming together to celebrate and embrace ... youtube.com", "2020-06-06T20:00:34.000Z": "Please take appropriate precautions as you continue to exercise your constitutional rights. Kansas will need you and your neighbors to stay healthy so that you can help us fix the problems that spurred this moment in the first place. https:// salinapost.com/posts/5edbc26a ebfb13423b2729e7 ", "2020-06-05T19:21:00.000Z": "Last year more than 400 Kansans died from gun violence. Today I'm asking you to join me and wear orange to recognize #GunViolenceAwarenessDay . Together we will fight to reduce gun violence and create a safer communities for all Kansans. Gun Violence Awareness Last year more than 400 Kansans died from gun violence. Today I'm asking you to join me and wear orange to recognize #GunViolenceAwarenessDay. Together we wi... youtube.com", "2020-06-05T18:00:28.000Z": "I will hold a press briefing at 4 p.m. today, June 5, to discuss the latest updates regarding COVID-19. Please visit my Facebook page at 4 p.m. to see the live broadcast. https:// facebook.com/GovLauraKelly/", "2020-06-04T21:44:59.000Z": "Due to COVID-19, KS farmers are facing challenges beyond their control. We must do all we can to provide aid & support as we move forward into Kansas' economic recovery. Visit http:// covid.ks.gov for industry guidance, mental health assistance & more. https:// kticradio.com/agricultural/k ansas-farmers-experiencing-another-rough-ride/  Kansas COVID-19 Response and Recovery Kansas COVID-19 resources. Apply for unemployment and assistance. Find meals for your family. What to do if you think you're sick. Latest news from the State of Kansas. Kansas' one stop site everyt... covid.ks.gov", "2020-06-04T18:28:13.000Z": "ICYMI - Monday I addressed the protests that took place in response to the tragic murder of George Floyd. It's time for our elected leaders to acknowledge that we have failed to give the problem of racial inequality the attention it deserves. My comments: Governor Kelly message regarding the murder of George Floyd youtube.com", "2020-06-04T16:14:22.000Z": "I've always been a staunch advocate for education, & the challenges brought by COVID-19 will not change that. No matter what the budget looks like, I pledge that I will not stop working to provide KS teachers & students with the tools they need to succeed. Kansas School Funding Looks Good On Paper, But Deep Cuts Are Expected Due To The Pandemic In Shawnee Mission Schools, for instance, what is currently projected to be a $7 million surplus could end up being at least a $13 million deficit. kcur.org", "2020-06-04T14:48:03.000Z": "Wednesday night the KS House of Representatives passed a bipartisan COVID-19 response bill. In spite of their disagreements, they put the interests of Kansans ahead of politics. I commend their action, and I urge the Senate to swiftly follow their lead. https:// sunflowerstatejournal.com/house-passes-n ew-emergency-powers-bill/ ", "2020-06-03T15:48:47.000Z": "The health and safety of Kansans has always been my top priority. As part of that commitment, today I announced my support for this bipartisan legislation. I will continue to work across the aisle to efficiently move Kansas forward in our recovery efforts. https:// kansas.com/news/politics- government/article243230656.html ", "2020-06-03T13:18:50.000Z": "Yesterday, @GovLauraKelly announced the award of $9 million in Community Development Block Grant awards to to 66 Kansas cities and counties to support their community responses to #COVID19 . https:// bit.ly/3dGl8Ww", "2020-06-02T19:26:11.000Z": "COVID-19 has caused unprecedented challenges for our state's economy, our businesses and our families. Through the SPARK taskforce, the Recovery Office will distribute CARES Act funds to Kansans who need it most. We are on our way to building a more inclusive & resilient economy.", "2020-06-02T17:39:47.000Z": "Today the Strengthening People and Revitalizing Kansas (SPARK) taskforce Executive Committee is holding its first meeting at 2 p.m. to begin discussion on how to lead Kansas forward in recovery from the effects of COVID-19. View the meeting live at https:// youtube.com/channel/UChH3f B2PkiJjZlo55c9UH2Q?view_as=subscriber  . Governor Laura Kelly Official account of the Office of Governor Laura Kelly, 48th Governor of Kansas. youtube.com", "2020-06-01T22:00:45.000Z": "Don't receive mail directly to your home ? No worries, the #2020Census has you covered! They have team members leaving response packets right at your doorstep.", "2020-06-01T16:46:58.000Z": "I will hold a press briefing at 4 p.m. today, June 1, to discuss the latest updates regarding COVID-19. Please visit my Facebook page at 4 p.m. to see the live broadcast. https:// facebook.com/GovLauraKelly/", "2020-05-29T20:45:02.000Z": "The death of George Floyd was unnecessary and preventable. My deepest condolences are with Mr. Floyd's family, friends, and his community, who have all been impacted by this tragedy.", "2020-05-29T19:45:17.000Z": "Maintaining positive #MentalHealth can be difficult during #COVID19 . If disruptive stress lingers, or if you want to talk to a pro: Text Kansas to 741741 Call the Suicide Prevention Lifeline @800273TALK (English) or 888-628-9454 (Español) Visit: https:// bit.ly/3ccYRyk", "2020-05-29T17:40:21.000Z": "Thank you, Deputy Secretary Clark, for your many years of service to the people of Kansas. Your work at @KansasCommerce has been instrumental in fostering workforce and economic development in our state. Congratulations on your retirement. Quote Tweet Kansas Department of Commerce @KansasCommerce Deputy Secretary Patty Clark ends her storied career w/ the state of Kansas today, as she retires from public service. We couldn't let her go without asking her to reflect on her time w/ the state. Patty, thank you for your service & enjoy your retirement! https:// bit.ly/2AnQIJT", "2020-05-29T16:58:14.000Z": "Secretary Lee Norman of @KDHE will hold a press briefing at 2 p.m. CST today to offer the latest updates on COVID-19 in Kansas. Watch it live on my Facebook page at http:// facebook.com/GovLauraKelly/", "2020-05-29T14:51:00.000Z": "With schools closed due to #COVID19 , children who are eligible for free or reduced-price meals can get up to $291 in food benefits. \n\nLearn more about #PEBT food benefits: English: http:// dcf.ks.gov/COVID19/Docume nts/COVID-19_P-EBT_FAQ.pdf   Español: http:// dcf.ks.gov/COVID19/Docume nts/COVID-19_P-EBT_FAQ_es.pdf   #ksleg", "2020-05-29T00:57:09.000Z": "El rastreo de contactos se utiliza para controlar y contener enfermedades infecciosas. Más de 200 voluntarios están ayudando a los departamentos de salud locales a notificar a los contactos de KSans que son positivos. La información compartida se mantiene confidencial. #COVID19", "2020-05-28T19:40:06.000Z": "#CallYourPediatrician today to keep your child's health & wellness on track. Quote Tweet KansasAAP @KansasAAP Your child's regular doctor's appointment is important even during #COVID19 . Contact us to discuss well child visit options & learn about the precautions we're taking to keep your family safe. #CallYourPediatrician", "2020-05-28T20:49:55.000Z": "KDOT is committed to completing all T-WORKS projects. The goal is to move forward with the projects identified in the blue box as soon as possible. Check out the full updated schedule for delivering at least one phase of the T-WORKS projects by Dec. 2021: https:// bit.ly/2B9nE9v", "2020-05-28T18:56:27.000Z": "Today we mourn the loss of more than 100,000 people nationwide to the coronavirus. Every life lost had a story, and every life lost had a purpose. They will not be forgotten. US death toll from coronavirus surges past 100,000 people HARTFORD, Conn. (AP) - The U.S. surpassed a jarring milestone Wednesday in the coronavirus pandemic: 100,000 deaths. That number is the best estimate and most assuredly an undercount. But it... apnews.com", "2020-05-28T20:06:50.000Z": "The KAAP is encouraging families and physicians to make sure all Kansas children are protected against vaccine-preventable disease, especially during this unprecedented time. Quote Tweet KansasAAP @KansasAAP Your child's regular doctor's appointment is important even during #COVID19 . Contact us to discuss well child visit options & learn about the precautions we're taking to keep your family safe. #CallYourPediatrician", "2020-05-28T17:56:07.000Z": "#ContactTracing is a #PublicHealth tool to monitor & contain infectious diseases. #TeamKDHE & 200+ volunteers are assisting local #HealthDepartments w/notifying close contacts of KSans who are positive. #HIPAA regulations are followed = information shared is kept confidential.", "2020-05-28T17:56:29.000Z": "Para mantener el estado avanzando de manera segura, tenga en cuenta que su salud está en sus manos. Para obtener más información, visite https:// kdheks.gov . #QuedateEnfocadoQuedateSanoQuedateFuerte ( #StayFocusedStayHealthyStayStrong ) @GovLauraKelly  @KDHE", "2020-05-28T14:00:49.000Z": "ATTENTION RURAL BUSINESSES: @usdaRD has announced the Business and Industry CARES Act Program! This program offers federal loan guarantees for rural businesses/ag producers during this pandemic. Check to see if your business is eligible! https:// bit.ly/3eqC4R6", "2020-05-28T16:51:01.000Z": "ICYMI - Yesterday I appointed Carl A. Folsom III to fill the Court of Appeals vacancy created by the retirement of Judge G. Joseph Pierron Jr. Carl is not only a bright lawyer, but he also has a passion for law & understands how it affects Kansans' lives. Governor appoints Carl Folsom to Kansas Court of Appeals - Governor of the State of Kansas governor.kansas.gov", "2020-05-27T20:51:32.000Z": "Attn. businesses: Our new poster series can help you encourage mask use, social distancing & hand hygiene -- for your employees & customers. Download & print today: https:// bit.ly/3g7A9lU . Find additional resources to protect your team & your community: https:// bit.ly/2TpjCQA", "2020-05-27T20:49:17.000Z": "A la atención de Empresas: nuestros nuevos pósters pueden ayudarlo a fomentar el uso de máscaras, el distanciamiento físico y la higiene de manos, para empleados y clientes. Descargue e imprima hoy: https:// bit.ly/3g7A9lU . Encuentra más recursos: https:// bit.ly/2TpjCQA", "2020-05-27T17:56:49.000Z": "We're hiring! KDOL has an opening for a Field Representative in Shawnee County.\n\nLearn more: https:// bit.ly/3gwlIrN  #ksdol  #ksworks", "2020-05-27T16:01:01.000Z": "Travel alert - there is flooding on K-92, west of Leavenworth and K-192 in Easton, both located in Leavenworth County.  Cresting may occur this afternoon.  Please seek alternative routes. @KansasCityKDOT -photos courtesy of Cody Hilt, Supervisor, A3, Leavenworth subarea", "2020-05-27T16:48:14.000Z": "Secretary Lee Norman of @KDHE will hold a press briefing at 2 p.m. CST today to offer the latest updates on COVID-19 in Kansas. Watch it live on my Facebook page at http:// facebook.com/GovLauraKelly/", "2020-05-27T15:48:14.000Z": "I want to thank every Kansan doing all you can to help slow the spread of COVID-19. To those of you following recommendations such as wearing masks and avoiding mass gatherings - you are making a difference. Kansas COVID-19 Response and Recovery Kansas COVID-19 resources. Apply for unemployment and assistance. Find meals for your family. What to do if you think you're sick. Latest news from the State of Kansas. Kansas' one stop site everyt... covid.ks.gov", "2020-05-27T15:22:28.000Z": "Contact tracing. It has been in the news, and you've likely heard me mention it during our press conferences. Let's take a deeper dive: https:// vimeo.com/423216689?ref= tw-share   #ksleg Sec. Lee Norman - Contact Tracing This is \"Sec. Lee Norman - Contact Tracing\" by KDHE on Vimeo, the home for high quality videos and the people who love them. vimeo.com", "2020-05-27T15:08:55.000Z": "Get help buying food while Kansas schools are closed. #COVID19 Pandemic EBT ( #PEBT ) benefits will be available soon.\n\nLearn more about P-EBT food benefits in Kansas: English: http:// dcf.ks.gov/COVID19/Docume nts/COVID-19_P-EBT_FAQ.pdf   Español: http:// dcf.ks.gov/COVID19/Docume nts/COVID-19_P-EBT_FAQ_es.pdf   #ksleg", "2020-05-27T13:42:31.000Z": "RURAL BUSINESSES: More federal dollars may be available through @RurDev_Kansas ! Check out this link and see if your business is eligible! Quote Tweet Rural Development KS @RurDev_Kansas . @USDA is making available up to $1 billion in loan guarantees to help #rural businesses meet working capital needs through @usdaRD 's Business & Industry (B&I) CARES Act Program. Ag Producers ineligible for @usdafsa loans may also be eligible: https:// bit.ly/3ekMLoc . @ecomm_ks", "2020-05-26T23:23:32.000Z": "Today @GovLauraKelly announced a shift in re-opening the state. However, the following mandates and recommendations are still in effect after May 26:", "2020-05-26T23:00:45.000Z": "Keep up the great work and continue to challenge others to complete their #2020Census . https:// 2020census.gov  #KansasCounts", "2020-05-26T21:58:17.000Z": "Today I announced a series of actions to address the threat to public health and our economy caused by the COVID-19 pandemic: I vetoed House Bill 2054, signed a new state disaster declaration and called a special session of the KS Legislature. Details: Governor signs disaster declaration, calls for special session, warns of grave consequences to... governor.kansas.gov", "2020-05-26T20:09:14.000Z": "The press briefing to discuss the latest updates regarding COVID-19 has been delayed to 3:30 p.m. Please visit my Facebook page at 3:30 p.m. to see the live broadcast. http:// facebook.com/GovLauraKelly/", "2020-05-26T19:01:00.000Z": "The COVID-19 pandemic may be hard for Kansas kids to understand - and they have a lot of really great questions about the virus. Watch as @SecNorman of @KDHE answers some of these questions: Quote Tweet Lee Norman @SecNorman Back for another installment of Questions from Kids about  Coronavirus. We can learn a lot from these curious Kansas kids. Watch the series: https:// vimeo.com/showcase/70629 69   #COVID19 Show this thread", "2020-05-26T16:38:53.000Z": "Reminder: @KansasCommerce Community Service Tax Credit Program applications are due May 31. This year, $1 million of the $4.1 million CSP credits available will be designated specifically for childcare centers. Apply now at https:// kansascommerce.gov/programs-servi ces/community-development/community-service-tax-credit-program/   #ksleg  #KansasORP", "2020-05-26T16:08:20.000Z": "I will hold a press briefing at 3 p.m. today, May 26, to discuss the latest updates regarding COVID-19. Please visit my Facebook page at 3 p.m. to see the live broadcast. https:// facebook.com/GovLauraKelly/", "2020-05-26T15:16:07.000Z": "Wearing a mask in public is about respecting and protecting those around you. Like @KDHE  @SecNorman says: My mask protects you, your mask protects me. Let's do our part to keep all those around us safe from COVID-19. #WearAMask", "2020-05-26T14:45:58.000Z": "\"... If you traveled to Lake of the Ozarks over the weekend, we urge you to act responsibly & self-quarantine to protect your neighbors, co-workers & family,\" said Secretary Lee Norman, M.D. https:// khap2.kdhe.state.ks.us/NewsRelease/PD Fs/5-26-20%20Ozarks.pdf   #LakeOfTheOzarks  #COVID19", "2020-05-22T22:50:36.000Z": "Las personas con #asma pueden tener un mayor riesgo de desarrollar complicaciones graves por #COVID19 . Siga estos consejos de los @CDCasthma para minimizar los desencadenantes del asma y maximizar la salud: https:// espanol.cdc.gov/coronavirus/20 19-ncov/need-extra-precautions/asthma.html ", "2020-05-25T12:21:18.000Z": "Best wishes to all Kansans for a safe #MemorialDay celebration. Let's take this time to honor and remember the many brave women and men in the U.S. Armed Forces who gave their lives in service to our country.", "2020-05-22T20:55:13.000Z": "Congratulations to KS students Eddie Dai, Olathe North High School, & Bridget Rose Schippers, St. James Academy, on being named 2020 U.S. Presidential Scholars. During this time of uncertainty, your achievements in and out of the classroom are outstanding. Two Kansas Students Named 2020 U.S. Presidential Scholars U.S. Secretary of Education Betsy DeVos Thursday announced the 56th class of U.S. Presidential Scholars, recognizing 161 high school seniors for their accomplishments in academics, the arts and knss.radio.com", "2020-05-22T18:48:20.000Z": "My press briefing for today, May 22, 2020, to discuss the latest updates regarding COVID-19 has been moved to 2:30 p.m. To watch the briefing, tune in live at 2:30 p.m. on my Facebook page, http:// Facebook.com/GovLauraKelly .", "2020-05-22T16:05:45.000Z": "People with #asthma may be at greater risk for developing serious complications from #COVID19 . Follow these tips to minimize asthma triggers & maximize health. Learn more about asthma in KS: http:// bit.ly/2ZOrwEF  #AsthmaAwarenessMonth  @CDCasthma  #WeTrackThat  @CDC_EPHTracking", "2020-05-22T15:30:45.000Z": "ICYMI: KDOR has been phasing in the reopening of its driver's license offices. For a list of reopened offices, visit https:// bit.ly/ReopeningKDOR . \nAppointments are required. Renewals can also be done online at http:// ikan.ks.gov . (Some restrictions apply.) #ksleg", "2020-05-22T15:15:31.000Z": "Today begins Phase 2 of \"Ad Astra: A Plan to Reopen Kansas,\" as well as the start of #MemorialDayWeekend . Reminder: our state's move into Phase 2 does not mean that the threat of COVID-19 has subsided. Please be safe this weekend, practice social distancing and wear a mask.", "2020-05-22T13:50:46.000Z": "My thoughts are with the family of Chuck Graham, co-director of the Great Plains ADA Center, who passed away May 19. Chuck was a passionate advocate for the Americans with Disabilities Act, and dedicated his life to serving the people of the Great Plains Region and the nation.", "2020-05-21T22:08:59.000Z": "During my meeting with @POTUS yesterday, we discussed Kansas' reopening plan, and ways to ensure the safety of America's food supply chain while also keeping those workers safe and healthy. I appreciate what the President's team has done for us throughout the pandemic. (1/2)", "2020-05-21T21:48:20.000Z": "Back for another installment of Questions from Kids about  Coronavirus. We can learn a lot from these curious Kansas kids. Watch the series: https:// vimeo.com/showcase/70629 69   #COVID19", "2020-05-21T21:48:58.000Z": "Did you miss our Pandemic EBT (P-EBT) live virtual Town Hall today? \n\nWatch the recording of it here: https:// facebook.com/watch/?v=77037 0790162534  Also, be sure to check out this FAQ for more information on #PEBT in Kansas:  http:// dcf.ks.gov/COVID19/Docume nts/COVID-19_P-EBT_FAQ.pdf   #KSLeg", "2020-05-21T18:59:20.000Z": "With Memorial Day weekend ahead, it's important for Kansans to remain vigilant and protect themselves and others from COVID-19. @KDWPT has good tips for those who want to safely enjoy Kansas' beautiful State Parks over Memorial Day weekend. https:// ksoutdoors.com/KDWPT-Info/New s/Weekly-News/5-20-20-How-To-Safely-Enjoy-Kansas-State-Parks-During-Memorial-Day-Weekend/How-To-Safely-Enjoy-Kansas-State-Parks-During-Memorial-Day-Weekend ", "2020-05-21T17:57:00.000Z": "On behalf of the state of Kansas, I would like to congratulate Tabatha Rosproy, who has been selected as the 2020 National Teacher of the Year. The rest of the country has another reason to recognize what we've always known - KS educators are outstanding. National Teacher of the Year On behalf of the state of Kansas, I would like to congratulate Kansas' Tabatha Rosproy, who has been selected as the 2020 National Teacher of the Year.... facebook.com", "2020-05-20T21:45:17.000Z": "Though it may look a little bit different, our state's graduating class of 2020 deserves all of the pomp and circumstance of a traditional commencement ceremony. If you are a graduating senior, I encourage you participate in #KSClassof2020 Appreciation Day. Quote Tweet KS Dept of Education @ksdehq ATTN KS CLASS OF 2020 HS SENIORS! Statewide tossing of caps commences at 20:20 (8:20 pm) this evening. Post your videos here using #KSClassof2020 , tag @ksdehq . All Class of 2020 All Day!", "2020-05-20T18:40:20.000Z": "DCF in collaboration with @ksdehq has announced the creation of the Pandemic Electronic Benefit Transfer program. #PEBT will help families who have been impacted by school closures due to #COVID19 to purchase food for their children.\nNEWS RELEASE: http:// dcf.ks.gov/Newsroom/Pages/Pandemic-EBT.aspx   #ksleg Kansas Families to Receive Additional Food Support Through Pandemic EBT Program dcf.ks.gov", "2020-05-20T18:00:31.000Z": "How about a story of incredible ingenuity and persistence in Southwest Kansas? Hodgeman County's Lea Ann Seiler and Dr. Kristie Clark have been 3D printing #COVID19 swabs! Check out this story covering their dedication and resourcefulness! Very inspiring! KANSAS PROFILE | With 3D printer makerspace, Hodgeman woman supporting COVID-19 efforts Here comes a package of nasal swabs, important tools in fighting the coronavirus pandemic. These aren't from some government stockpile or overseas supplier. They were manufactured on a 3D printer, themercury.com", "2020-05-20T15:25:48.000Z": "More great resources for Kansas small businesses. Quote Tweet SBA Wichita @SBA_Wichita #SmallBiz  #funding , #contracting , #workforce and #Cybersecurity check out  https:// covid-sb.org  @sbdckansas  @vetbiz  @KansasCommerce", "2020-05-20T15:06:18.000Z": "It's great to see officials with @KDWPT doing their part to keep Kansans safe, healthy and strong during the COVID-19 pandemic. The more than 2,000 pounds of elk and bison meat donated to local food banks can help feed 8,500 Kansans. https:// ksoutdoors.com/KDWPT-Info/New s/Weekly-News/5-19-20-KDWPT-Donates-2-000-Pounds-of-Elk-and-Bison-Meat-to-Food-Banks/KDWPT-Donates-2-000-Pounds-of-Elk-and-Bison-Meat-to-Local-Food-Banks ", "2020-05-19T22:47:34.000Z": "Today, @GovLauraKelly announced the creation of the Strengthening People and Revitalizing Kansas (SPARK) taskforce. This public-private partnership will oversee the distribution of federal funds across Kansas to help guide our state's economic recovery. Governor Kelly Announces Strengthening People and Revitalizing Kansas (SPARK) Taskforce to Lead... governor.kansas.gov", "2020-05-19T23:01:01.000Z": "A public tornado shelter can protect you from severe weather. If you are in a public tornado shelter, @CDCgov recommends that you protect yourself and others from #COVID19 by staying at least 6 feet from other people when possible and wearing a cloth face covering .", "2020-05-19T20:48:56.000Z": "I appreciate Kansans doing all they can to stay healthy and mitigate the spread of COVID-19. I know it has been difficult - but thanks to your diligence and commitment, we are able to move into Phase 2.", "2020-05-19T20:43:17.000Z": "Under the modified Phase 2, organized sports facilities and practices, community centers, indoor leisure spaces like arcades and theaters, in-person group exercise classes and state-owned-and-operated casinos may open on May 22. (1/2)", "2020-05-19T20:40:11.000Z": "Moving forward in Kansas' reopening plan does not mean COVID-19 no longer threatens our communities. Modifying Phase 2 to keep some restrictions allows us to reopen our economy as quickly and safely as possible, while exercising necessary caution. Governor Kelly moves Kansas into modified Phase 2 - Governor of the State of Kansas governor.kansas.gov", "2020-05-19T20:39:22.000Z": "Throughout the COVID-19 pandemic, I've said I'm relying on data and science to tell us how quickly, or slowly, we open up our economy. Now, the data tell us it is time for another safe step forward. This Friday, Kansas will move into a modified Phase 2 of our reopening plan.", "2020-05-19T16:59:07.000Z": "My press briefing to discuss the latest updates regarding COVID-19 for today, May 19, 2020, has been moved to 1:30 p.m. CST. Please visit my Facebook page at 1:30 p.m. to see the live broadcast. https:// facebook.com/GovLauraKelly/", "2020-05-19T14:31:07.000Z": "We've updated our Gating filing system to accommodate the FPUC payments (extra $600). We ask claimants filing weekly claims to please participate in our new gating system. #ksdol  #ksleg  #ksworks", "2020-05-18T18:05:07.000Z": "Needing to renew a KS driver's license or ID card? These can be done online at http:// ikan.ks.gov . (By statute, some restrictions apply.) With a phased-in approach, some offices have reopened. Go to https:// bit.ly/ReopeningKDOR for more info. #ksleg", "2020-05-18T20:38:43.000Z": "Memorial Day is coming soon, and though COVID-19 has changed the way we usually hold Memorial Day ceremonies, we still can safely honor our country's military personnel who made the ultimate sacrifice. To learn more, visit: https:// covid.ks.gov/wp-content/upl oads/2020/05/Safe-Memorial-Day-Guidance-5.15.pdf  .", "2020-05-18T16:30:06.000Z": "The @DCFKansas Hero Relief Program expands child care assistance subsidies for families and provides financial support directly to child care providers. Find out if you qualify here: http:// ksherorelief.com", "2020-05-18T16:21:25.000Z": "I'll have a press briefing Tuesday this week instead of Monday, with @KDHE Secretary Lee Norman appearing for today's 2 p.m. CST press briefing. I'll instead hold a briefing at 1 p.m. CST this Tuesday, May 19. Watch both on Facebook Live at http:// facebook.com/GovLauraKelly/ .", "2020-05-18T15:56:13.000Z": "This is very good news for our state. The new @thermofisher facility in Lenexa will not only create quality jobs in Kansas, but also help increase COVID-19 testing capacity in our state and nation. #ksleg Quote Tweet Thermo Fisher G.R. @ThermoFisherDC #COVID19 testing requires specialized viral transport media, and our #Lenexa , #Kansas team will add 300 new colleagues to support the important effort. @GovLauraKelly  @JerryMoran  @SenPatRoberts  @RepDavids  https:// thermofisher.mediaroom.com/2020-05-18-The rmo-Fisher-Scientifics-Support-of-COVID-19-Response-Continues-to-Expand-with-U-S-Government-Contract-for-Products-Used-in-Sample-Collection ", "2020-05-18T15:00:50.000Z": "KANSANS ARE BEING COUNTED! As of today, the #Census response rate in Kansas is 63.8%, compared to a national average of 59.5%. Thank you so much to everyone who has taken the time to respond! If you haven't yet, there's still time. Head to http:// my2020census.gov !", "2020-05-17T15:53:18.000Z": "This mural, located on the third floor of the Kansas Statehouse, reminds us of Brown v. Board's legacy and our duty to stand against racial inequality and fight for equal opportunity for all - just as those brave women and men did so many years ago. (2/2)", "2020-05-17T15:53:17.000Z": "Today is the 66th anniversary of Brown v. Board of Education, the landmark U.S. Supreme Court ruling that ended segregation in our country's public schools. (1/2)", "2020-05-17T14:10:09.000Z": "I know the past few months have been challenging for all of us - particularly our high school seniors set to graduate this spring. I know this isn't the way they imagined their senior year would come to a close. But know there still is cause to celebrate. Governor Laura Kelly Graduation Message I know the past few months have been challenging for all of us - particularly our high school seniors set to graduate this spring. I know this isn't the way ... youtube.com", "2020-05-15T21:35:23.000Z": "Kansas Secretary of Labor Delía García confirmed that with the recently increased bank limits for payouts, KDOL successfully processed $99,828,060 in Federal Pandemic Unemployment Compensation (FPUC) overnight. #ksleg  #ksworks  #ksdol  https:// bit.ly/2Z7c2Oh (1/2)", "2020-05-15T21:47:37.000Z": "Reminder: if you are already receiving regular UI benefits, you DO NOT need to apply for PUA benefits. The PUA program is for those who are not typically eligible for UI benefits and/or have been denied regular UI benefits. \n\n(1/3)", "2020-05-15T21:00:01.000Z": "As we enter the weekend, remember that a great way to experience the outdoors at a safe distance is by riding a bike! May is National Bicycle and Motorcycle Awareness month, so remember to pay attention to your surroundings. Motorists, share the road we are all in this together.", "2020-05-15T19:50:38.000Z": "#COVID19 scams that target older adults and those w/ serious long-term health conditions who appear to be at higher risk for serious illness are increasing. The Senior Medicare Patrol (SMP) program wants you to have the most up-to-date information. Visit: https:// bit.ly/363jUBJ", "2020-05-15T20:59:07.000Z": "Kansans, ¿Tiene preguntas sobre viajes y cuarentena en #Kansas ? Visite nuestro sitio web para saber quién necesita ponerse en cuarentena, cómo controlarse, encontrar respuestas a preguntas frecuentes y más: https:// bit.ly/3bmOg3b  #COVID19  #coronavirus  #Kansas", "2020-05-15T20:29:24.000Z": "Today we observe #NationalPeaceOfficersMemorial Day as a way to pay tribute to local, state and federal peace officers who have lost their lives in the line of duty. Their bravery, dedication and professionalism warrant our sincere praise and gratitude. National Peace Officers Memorial Day Today we observe National Peace Officer Memorial Day as a way to pay tribute to local, state and federal peace officers who have lost their lives in the line... youtube.com", "2020-05-15T15:43:08.000Z": "Kansans, Do you have questions about travel & quarantine? Check out our website to learn who needs to quarantine, how to monitor yourself, find answers to frequently asked questions & more: https:// bit.ly/3bmOg3b . #COVID19  #coronavirus  #Kansas", "2020-05-15T16:00:46.000Z": "KANSAS ARTS ORGS! Today is the LAST DAY to apply for SOS (Short-term Operational Support) federal funds! If your arts program is experiencing difficulties as a result of #COVID19 , this program can help! Apply today! https:// bit.ly/3fgR7hn", "2020-05-15T16:45:49.000Z": "Transportation starts at the local level. Working side by side with communities, stakeholders and state employees we will continue to build a future for Kansans that we can be proud of, the Eisenhower Legacy Transportation Program is just getting started. #WeLikeIKE", "2020-05-15T16:24:30.000Z": "Save the date and stay tuned for more information on how to join this virtual meeting discussing Pandemic EBT (P-EBT).\n\nCheck out P-EBT Frequently Asked Questions http:// dcf.ks.gov/COVID19/Docume nts/COVID-19_P-EBT_FAQ.pdf   #ksleg  #PEBT", "2020-05-14T21:19:23.000Z": "What does Phase 1.5 of my reopening plan mean for Kansans? It means you can go to the barbershop or nail salon - but only for prescheduled appointments. Fitness centers may also open, but in-person classes may not occur. Visit http:// covid.ks.gov to view the plan in full. Kansas COVID-19 Response and Recovery Kansas COVID-19 resources. Apply for unemployment and assistance. Find meals for your family. What to do if you think you're sick. Latest news from the State of Kansas. Kansas' one stop site everyt... covid.ks.gov", "2020-05-14T21:06:32.000Z": "I would like to thank all Kansans for your commitment to the health and safety of your friends, neighbors and loved ones. I know this hasn't been easy - but without your dedication, we couldn't move forward in our reopening efforts. We'll continue to get through this together.", "2020-05-14T20:54:39.000Z": "Over the past couple of weeks, hospitalizations & COVID-related deaths have declined, enabling us to move forward in our efforts to safely reopen KS. Unfortunately, the rate of disease spread has not shown the downward trajectory necessary to move fully into Phase 2. (1/2)", "2020-05-14T17:44:20.000Z": "Transportation is built for Kansans and when we work together amazing things can be achieved. That is how the IKE Program was developed, and it is how we will move Kansas into the future. These projects are just the beginning. #WeLikeIKE for more info: http:// ksdot.org/ike.asp", "2020-05-14T16:10:28.000Z": "Working alongside local officials and stakeholders through the Eisenhower Legacy Transportation Program, we can build a transportation future for Kansans that meets the needs of our communities, helps grow our economy and creates jobs. #WeLikeIKE (2/2)", "2020-05-14T16:03:55.000Z": "Today I joined @KDOTHQ Secretary Julie Lorenz to announce the first major highway projects under the new Eisenhower Legacy Transportation Program, which was passed in March by the Kansas Legislature. (1/2)", "2020-05-14T13:28:49.000Z": "Happening TODAY at 10:30 a.m. Join @GovLauraKelly and Secretary Julie Lorenz as they announce major highway projects for the development pipeline. These are the first projects to be added under the new Eisenhower Legacy Transportation Program (IKE) Watch: https:// facebook.com/KSDOTHQ/", "2020-05-13T21:38:34.000Z": "The Community Development Block Grant program has been a powerful tool in developing communities and expanding economic opportunities for low- and moderate-income Kansans. This CDBG tool is especially important during this time of crisis. https:// kansascommerce.gov/2020/05/govern or-kelly-announces-9-million-in-grants-to-support-community-responses-to-coronavirus/ ", "2020-05-13T21:09:54.000Z": "Make sure to visit http:// covid.ks.gov for the latest information on #COVID19 in Kansas and other additional resources. Kansas COVID-19 Response and Recovery Kansas COVID-19 resources. Apply for unemployment and assistance. Find meals for your family. What to do if you think you're sick. Latest news from the State of Kansas. Kansas' one stop site everyt... covid.ks.gov", "2020-05-13T20:27:44.000Z": "Our COVID-19 website is Kansans' one-stop shop for information and resources on community, family, mental, financial and economic health. Find out more at http:// covid.ks.gov .", "2020-05-13T17:30:29.000Z": "Don't forget to tune in at 2 p.m. CST for my press briefing to hear updates on COVID-19 in Kansas. Watch it live on Facebook at http:// facebook.com/GovLauraKelly/ .", "2020-05-12T23:00:48.000Z": "Shape your future by going to https://", "2020-05-13T15:30:38.000Z": "The State Finance Council will meet at 3 p.m. today., Wednesday, May 13. Information about the meeting can be found on Kansas Public Square. Click the link for details on how to listen in: State Finance Council Meeting publicsquare.ks.gov", "2020-05-12T20:55:47.000Z": "As our recovery unfolds, it is important to remember that we must continue to follow safe practices. Keep practicing social distancing at all times, wear a mask in public and wash your hands often. And please, if you feel ill, stay home.", "2020-05-12T20:41:29.000Z": "Kansas has received more than $6.7 million in federal @HHSGov grants from @ACLgov to help communities provide supportive services, meals, caregiver support services and long-term care ombudsman services for older adults as part of the CARES Act.\n\nRelease: https:// kdads.ks.gov/media-center/n ews-releases/2020/05/12/kdads-receives-more-than-$6.7-million-in-additional-cares-act-funding-to-support-older-americans-act-programs ", "2020-05-12T19:03:23.000Z": "I would like to recognize and celebrate Kansan Sarah Deer, who was awarded one of 27 prestigious Andrew Carnegie fellowships. Congratulations on your achievement, Sarah, and on the opportunity to tell your important story. KU Native American scholar selected for prestigious $200K Andrew Carnegie fellowship Sarah Deer, a nationally recognized writer and researcher on the intersection of Native American law and violence against women, was awarded one of 27 Andrew Carnegie fellowships on Tuesday. The... ljworld.com", "2020-05-12T18:21:28.000Z": "National Skilled Nursing Care Week (NSNCW) recognizes the essential role of skilled nursing care centers in caring for America's frail, elderly, and disabled. #NSNCW  #CareNotCOVID Quote Tweet AHCA/NCAL @ahcancal This week is National Skilled Nursing Care Week. Honor your hard-working staff and the care they provide to your residents with new activity suggestions #NSNCW  https:// ahcancal.org/events/nationa l_skilled_nursing_care_week/Pages/Suggested  Activities.aspx", "2020-05-12T18:02:41.000Z": "Applications are OPEN NOW for CDBG-CV! Kansas communities can apply for federal funding to help with economic development and meal programs. Funds will be awarded on a first-come, first-served basis until all funds have been disbursed, so apply now! http:// kansascommerce.gov/cdbg-cv", "2020-05-12T17:39:27.000Z": "In accordance with Executive Order 20-30, I have ordered U.S. flags to be flown at half-staff on Wednesday, May 13, until sunset in honor of Overland Park Police Officer Mike Mosher. Officer Mosher tragically lost his life in the line of duty. (1/2) Governor Laura Kelly orders flags to be flown at half-staff in honor of Office Mike Mosher and... governor.kansas.gov", "2020-05-12T15:53:42.000Z": "En caso de que se haya perdido la conferencia de prensa #COVID19 del 11 de mayo con Secretario Lee Norman, M.D. y @GovLauraKelly , vea los subtítulos en español: https:// vimeo.com/showcase/69353 73   @TelemundoKC", "2020-05-12T15:15:58.000Z": "To apply for PUA benefits or to submit a weekly claim for PUA benefits, go to https:// pua.getkansasbenefits.gov  #ksdol  #ksleg  #ksworks", "2020-05-12T13:32:41.000Z": "The application process for PUA benefits is now open. Apply online at http:// PUA.GetKansasBenefits.gov .\n\nFrequently Asked Questions can be found here: https:// dol.ks.gov/ui-faqs/pua  #ksdol  #ksworks  #ksleg", "2020-05-08T23:32:53.000Z": "Sec. García confirmed that KDOL is ahead of schedule in processing FPUC payments - the additional $600 weekly payment added to an eligible claimant's weekly benefit amount. The remaining weeks of back payments began processing on May 6, 2020. http:// bit.ly/2WCbKw8", "2020-05-11T22:48:56.000Z": "KDOL will begin accepting PUA applications TOMORROW, May 12!  As a reminder, make sure you have already applied for and been denied for regular unemployment insurance benefits.\n\nAll PUA applications will be completed online at http:// PUA.GetKansasBenefits.gov . #ksleg  #ksworks", "2020-05-09T14:01:03.000Z": "Need groceries or other household supplies? If curbside pick-up or home delivery isn't an option, follow these 7 tips to protect the health of all. And don't forget your mask. #PreventTheSpread  #COVID19", "2020-05-12T00:08:52.000Z": "We don't say it enough. THANK YOU to our #HealthCareHeroes in #PublicHealth , especially our friends in #KSPublicHealth . We see you, & we couldn't do it without you! #ThankYouPublicHealth  #COVID19", "2020-05-11T23:00:46.000Z": "To limit the spread of #COVID19 , @CDCgov recommends covering your mouth and nose with a cloth face covering when around others, including when in a public tornado shelter. https:// cdc.gov //prevent-getting-sick/prevention.html", "2020-05-11T21:17:03.000Z": "During National #HospitalWeek , I would like to thank hospitals and healthcare workers in Kansas and across the nation for your tireless response to the COVID-19 pandemic. Your work on the front lines has saved countless lives - you deserve our appreciation today and every day.", "2020-05-11T19:46:14.000Z": "BIG NEWS: @GovLauraKelly has announced that more than $9 million in federal funding is being made available to the Community Development Block Grant (CDBG) program for community responses to #COVID19 . Applications open tomorrow! https:// bit.ly/3fxNR1c", "2020-05-11T20:06:30.000Z": "This week is #NationalPoliceWeek - a time to honor and remember those brave men and women who have lost their lives in the line of duty. Police officers in Kansas and around the world deserve our deepest thanks and appreciation for the sacrifices they make each day. Quote Tweet KS Highway Patrol @kshighwaypatrol In honor of #NationalPoliceWeek , the Kansas Highway Patrol will be highlighting those lost in the line of duty. \n\nWe encourage you to think of these troopers who gave their lives in service to the citizens of the state of Kansas. #NeverForgotten  #ThinBlueLine", "2020-05-11T17:39:28.000Z": "Don't forget to tune in at 2 p.m. CST for my press briefing to hear updates on COVID-19 in Kansas. Watch it live on Facebook at http:// facebook.com/GovLauraKelly/ .", "2020-05-11T17:26:56.000Z": "In a short time, COVID-19 has stolen so much from so many of us - the Class of 2020 included. I share in your disappointment that your Graduation Day didn't end up the way you always imagined. Listen to a relevant commencement address from Shankar Vedantam: Coming Of Age In The Age Of Coronavirus? | 1A They might look a little different right now but some milestones, like high school proms, are still happening. the1a.org", "2020-05-09T15:41:06.000Z": "¿Necesita comestibles u otros artículos para el hogar? Si la recogida en la acera o la entrega a domicilio no son una opción, siga estos 7 consejos para proteger la salud de todos. Y no olvides tu máscara. #PrevenirlaPropagación  #COVID19 .", "2020-05-11T16:25:10.000Z": "KDOR will begin phasing in the reopening of offices on Tue. 5/12/2020. Visitors must have an appt. & will be required to have symptom & temperature screening.\nGo to https:// ksrevenue.org/reopening.html to see which offices are reopening & info on making an appointment. #ksleg", "2020-05-11T13:00:00.000Z": "As part of #NationalPoliceWeek , we are highlighting those lost in the line of duty. \n\nTrooper Maurice R. Plummer\nEnd of Watch: December 16, 1944 EOW Plummer youtube.com", "2020-05-10T13:00:00.000Z": "In honor of #NationalPoliceWeek , the Kansas Highway Patrol will be highlighting those lost in the line of duty. \n\nWe encourage you to think of these troopers who gave their lives in service to the citizens of the state of Kansas. #NeverForgotten  #ThinBlueLine", "2020-05-10T14:32:53.000Z": "Happy Mother's Day, Kansas! My mother, Jeanne Maddock Kelly (back right), taught me (front right) valuable lessons about leadership and compassion that helped me get to where I am today. I hope all mothers, aunts, grandmas and mother figures have a special day.", "2020-05-08T20:50:24.000Z": "Though COVID-19 has changed nearly every aspect of our lives, one thing that has remained constant is the threat of severe weather. All Kansans need to have a plan in mind for when severe weather does strike. Quote Tweet KDEM @KansasEmergency If you must go to a public tornado shelter, @CDCgov recommends preparing a \"go kit\" with personal need items, including hand sanitizer and cloth face coverings.  https:// cdc.gov //prevent-getting-sick/prevention.html", "2020-05-08T17:30:42.000Z": "Don't forget to tune in at 2 p.m. CST for my press briefing to hear updates on COVID-19 in Kansas. Watch it live on Facebook at http:// facebook.com/GovLauraKelly/ .", "2020-05-08T15:33:34.000Z": "On #MilitarySpouseAppreciationDay , I would like to recognize the many sacrifices military spouses make every day as their loved ones serve our state and nation. Please know your efforts and unwavering support do not go unnoticed.", "2020-05-08T13:47:13.000Z": "Kansans have many questions about #COVID19 . We have answers - except for personal lab test results or medical advice. Your healthcare provider needs to hear those questions. Otherwise, call, email or check out the Online Resource Center: https:// bit.ly/3cfJ567", "2020-05-07T22:31:23.000Z": "If you must go to a public tornado shelter, @CDCgov recommends preparing a \"go kit\" with personal need items, including hand sanitizer and cloth face coverings.  https:// cdc.gov //prevent-getting-sick/prevention.html", "2020-05-07T18:07:05.000Z": "KS needs access to high-quality broadband for telehealth services, remote learning and workforce and economic development. The 10-year transportation plan @GovLauraKelly signed in April, and these investments are great first steps. #ksleg USDA Invests $71 Million in High-Speed Broadband for Rural Kansas and Oklahoma WASHINGTON, May 7, 2020 - U.S. Secretary of Agriculture Sonny Perdue today announced that USDA is investing $71 million to provide broadband service in unserved and underserved rural areas in Kansas... usda.gov", "2020-05-07T13:00:36.000Z": "It's #NationalTourismDay ! If you're thinking of an incredible place to visit, we don't think it gets any better than the Sunflower State. If you haven't paid a visit, give us a try! You won't regret it. Kansas Hotels, Events, Things to Do, Restaurants & Travel Tools Planning your vacation to Kansas? Find information here about Kansas cities, things to do, restaurants, places to stay, events and travel tools. travelks.com", "2020-05-07T14:25:50.000Z": "Through the #CARESAct , the #PaycheckProtectionProgram is helping small businesses keep workers employed during the #COVID19 pandemic. \n\nHere are a few frequently asked questions about the program (thread): Paycheck Protection Program: FAQs for Lenders and Borrowers www.sba.gov", "2020-05-07T16:22:59.000Z": "#ICYMI : @usdaRD Deputy Under Secretary Bette Brand recently released a summary of key service changes to increase the use of telehealth in response to the #COVID19 pandemic. Learn more: https:// bit.ly/3diWwTb .", "2020-05-07T15:49:25.000Z": "Our #COVID19 testing supplies have increased, and our testing criteria has expanded. We are looking forward to learning more about the disease patterns throughout the state of Kansas. #ksleg", "2020-05-07T15:03:37.000Z": "ICYMI - Yesterday I announced Cheryl Harrison-Lee and Lyle Butler would head our team charged with leading Kansas forward in recovery from the economic fallout of COVID-19. They both have exceptional and relevant experience. Learn more here: Governor Kelly announces recovery team leadership - Governor of the State of Kansas governor.kansas.gov", "2020-05-07T15:00:26.000Z": "Did you see the flyover in Wichita, Kansas, yesterday? Team McConnell, 'Doc' the B-29 Superfortress fly over south-central Kansas Team McConnell is scheduled to perform a series of community flyovers for Operation America Strong on May 6, 2020, beginning at 10 a.m. kwch.com", "2020-05-06T22:50:47.000Z": "En caso de que se haya perdido la conferencia de prensa #COVID19 del 6 de mayo con Secretario Lee Norman, M.D. y @GovLauraKelly , vea los subtítulos en español: https:// vimeo.com/showcase/69353 73   @TelemundoKC", "2020-05-06T21:07:49.000Z": "For the latest updates & information about the #COVID19 recovery and response in Kansas, go to https:// covid.ks.gov . This is your source for community, family, mental, financial, and economic health.", "2020-05-06T20:19:00.000Z": "Did you know there are approximately 45,000 home electrical fires each year? May is National Electrical Safety Month. Watch here for more home electrical safety messages throughout the month of May. #ApplianceFireSafety GIF", "2020-05-06T19:55:42.000Z": "Congratulations, Dennis. As @NYGovCuomo said, the genuine, sincere nature of your gift made it truly special. You make Kansas proud. Quote Tweet Melissa DeRosa @melissadderosa We read that Dennis, who sent 1 of his 5 masks to NY for a healthcare worker, was awarded his college degree today\n\nGov Cuomo tracked down his number\n\nHe gave an entire country reason to believe in the goodness of America & that should be celebrated https:// ksn.com/news/health/co ronavirus/coronavirus-in-kansas/kansas-farmer-who-gave-new-york-governor-n95-mask-conferred-a-bachelors-degree-by-k-state-gov-kelly/ ", "2020-05-06T17:48:11.000Z": "Please note that the schedule for my regularly-scheduled daily press briefings has changed. Starting today, I will join @KDHE  @SecNorman for briefings at 2 p.m. CST on Monday, Wednesday and Friday each week. Tune in live on my Facebook page at https:// facebook.com/GovLauraKelly/ .", "2020-05-06T17:25:04.000Z": "Our nurses work tirelessly on the front lines to make sure all of us can stay safe and healthy. The extraordinary courage and determination shown by nurses in Kansas and around the world during the COVID-19 pandemic deserve our sincerest thanks and recognition. #NationalNursesDay", "2020-05-06T15:00:10.000Z": "FEMA to provide Kansas nursing homes with 14 days' worth of PPE FEMA to provide Kansas nursing homes with 14 days' worth of PPE All Kansas Medicare and Medicaid-certified nursing homes should receive this week 14 days' worth of personal protective equipment for staff use. kwch.com", "2020-05-06T00:11:18.000Z": "Please see below the full video of @KState President Richard Myers and I conferring a bachelor's degree upon Dennis Ruhnke of Troy, Kansas. It was an absolute honor and privilege to watch as Dennis achieved his lifelong goal. #SGNGraduation Dennis Ruhnke Degree Please see below the full video of Kansas State University President Richard Myers and I conferring a bachelor's degree upon Dennis Ruhnke of Troy,... facebook.com", "2020-05-05T20:51:53.000Z": "#NationalTeachersDay is an ideal time to show our appreciation for educators in Kansas. In the midst of this public health crisis, they have gone above & beyond to make sure Kansas kids succeed. As the \"education governor,\" I will always advocate for and celebrate KS teachers.", "2020-05-05T19:46:03.000Z": "This afternoon I had the pleasure of joining @KState President Richard Myers to confer a bachelor's degree upon Dennis Ruhnke of Troy, Kansas. Dennis recently sent a letter to @NYGovCuomo with an N-95 mask to give to a nurse or doctor in New York. (1/2)", "2020-05-05T17:49:25.000Z": "My mask protects you, your mask protects me. An important reminder as Kansas reopens. Save the surgical and N95 masks for our medical teams and first responders, and take a deeper dive into homemade masks and cloth coverings on our website: https:// coronavirus.kdheks.gov/225/How-to-pro tect-yourself-and-others   #ksleg", "2020-05-05T17:00:06.000Z": "It's not too late to participate in the #2020Census . Census data are used to distribute over $6 billion in federal funds to Kansas every year for schools, transportation, healthcare & more. You can complete your census online at http:// my2020Census.gov , by mail or by phone.", "2020-05-05T13:26:42.000Z": "Due to many downed power lines K-177 from I-70 south to K-4 will remain closed until this afternoon for repairs. Follow signed detour. Check http:// kandrive.org for updated information. #DriveSafe  #BuckleUp", "2020-05-04T20:39:26.000Z": "This partnership between @SpiritAero & @vyaire_medical will not only result in life-saving medical equipment, but also maintain KS jobs. The innovative collaboration is a great example of Kansans stepping up to help one another during the COVID-19 pandemic. Spirit AeroSystems partners with top medical supplier to make ventilators to fight COVID-19 Approximately 700 Spirit Wichita employees will work on the medical devices. kansas.com", "2020-05-04T18:04:49.000Z": "TRAFFIC ALERT - I-70 closed between Manhattan and Wamego exits. Traffic being detoured until early evening. Please use alternate route.\nPlease check @NEKansasKDOT for updates.", "2020-05-04T17:30:10.000Z": "Applications are NOW OPEN for the Short-Term Operational Support (SOS) Program! Nearly $500,000 in grant funding is available now for arts programs in Kansas during the #COVID19 crisis. Apply today! https:// bit.ly/3fgR7hn", "2020-05-04T17:12:23.000Z": "Today begins Phase One of my administration's plan to cautiously and gradually reopen our state. For Kansans, Phase One means you can go to restaurants - so long as they adhere to proper public health guidelines and can maintain at least 6 feet between customers. (1/2)", "2020-05-04T15:55:20.000Z": "PLEASE SHARE\n\nBeing advised I-70 could be SHUTDOWN between exit 313 and exit 328 for 6-8 hours as they remove and repair the downed power lines across I-70 @evergypower is on scene working now.  \n\nMore equipment is responding to further assist. #KSwx", "2020-05-04T16:05:38.000Z": "Curious about what to expect on the #2020Census ? Below are the basic demographic questions that are on the survey .\n\nVisit https:// 2020census.gov/en/about-quest ions.html  to see the questions or take your 2020 Census.", "2020-05-04T13:17:00.000Z": "Stormy weather and rain are part of the forecast for much of the state today. Be weather aware, and pay attention to what the weather is doing in your area before you travel. \nRemember: If you wipers are on, your headlights should be too.", "2020-05-01T23:00:51.000Z": "There are three ways to fill out the #2020Census . Which one will you choose?  http:// 2020census.gov  #KansasCounts  #ShapeYourFuture", "2020-05-01T21:07:27.000Z": "Today on #InternationalWorkersDay , I want to offer a special message of gratitude to Kansas workers, & recognize the important contributions American workers have made throughout history. Particularly now, during the COVID-19 pandemic, our frontline workers deserve our gratitude.", "2020-05-01T17:08:50.000Z": "On National #SchoolNutritionHeroDay , let's all extend our thanks to school nutrition professionals who work hard every day to make sure our children are fed. Even through the uncertainty of the COVID-19 pandemic, they continue to rise to the occasion.", "2020-05-01T15:49:55.000Z": "While there are still many uncertainties surrounding COVID-19, one thing is clear: we are going to make it through the daunting days ahead. Please stay safe, and follow the guidelines outlined in our new framework. Governor Laura Kelly introduces plan to safely, gradually re-open Kansas, get state back to work governor.kansas.gov", "2020-04-30T23:58:47.000Z": "The Framework also includes guidance for businesses and individuals on when to wear masks, when employers should implement telework policies, travel guidance and more. To view the Framework, click the following link: Ad Astra: A Plan to Reopen Kansas - Kansas COVID-19 Response and Recovery COVID-19 Information and resources from the State of Kansas. Apply for a job or unemployment benefits. Apply for business loans and relief assistance, find unemployment insurance information. Locate... covid.ks.gov", "2020-04-30T23:56:25.000Z": "I will evaluate Kansas' disease spread, testing rates, hospitalizations, PPE availability and other factors to determine if KS should move to the next \"Phase.\" Kansans should continue social distancing and taking other precautionary measures during each of the three phases.", "2020-04-30T23:53:54.000Z": "Under \"Ad Astra: A Plan to Reopen Kansas,\" county officials are permitted to impose regulations that are more restrictive than the Framework, but cannot be less restrictive. Counties do not have to submit requests to the state to institute equal or more restrictive standards.", "2020-04-30T23:52:17.000Z": "So what does Phase 1 mean for Kansans? It means that you can go to restaurants - as long as they adhere to proper public health guidelines and can maintain at least 6 feet between customers. It means you can go to the library, and childcare facilities will be open. (1/2)", "2020-04-30T23:46:47.000Z": "In Phase 1 of the plan, the statewide stay-at-home order is lifted on May 4. In its place, mass gatherings statewide will be limited to 10 or fewer. Entities already considered essential functions pursuant to the Kansas Essential Functions Framework can continue to operate. (2/2)", "2020-04-30T23:46:46.000Z": "After discussion with public health officials and evaluating the state's disease spread, testing capacity & other factors, we have decided to lift the statewide \"safer-at-home\" order. We will gradually and cautiously move into Phase 1 of \"Ad Astra: A Plan to Reopen Kansas.\" (1/2)", "2020-04-30T23:36:58.000Z": "I know the past few weeks have been incredibly difficult for Kansas families. As your governor, I am so proud of your commitment and the sacrifices you've all made to make sure your family, friends and neighbors remain healthy. Together, we will get through this.", "2020-04-30T21:48:40.000Z": "Sec. García confirmed today that the remaining programs in the federal CARES Act: Pandemic Unemployment Insurance (PUA) and Pandemic Emergency Unemployment Compensation (PEUC) should be paying out benefits by the end of May. https:// bit.ly/2y6q6N7  #ksdol  #ksleg  #ksworks", "2020-04-30T19:41:02.000Z": "Be sure to tune in this evening to hear @GovLauraKelly 's plan to reopen the state amidst the #COVID19 pandemic. Her address will be broadcast on live television, available to Kansas radio stations and on her Facebook page at http:// facebook.com/GovLaura/Kelly/ . Quote Tweet Governor Laura Kelly @GovLauraKelly At  6:30 p.m. Thursday, April 30, I will deliver an address to the people of Kansas on my administration's official plan to reopen the state as we address the COVID-19 pandemic. (1/2) Show this thread", "2020-04-30T19:59:07.000Z": "I can't say THANK YOU loudly and proudly enough to all the healthcare providers in Kansas and around the world for the work they are doing on the front lines. #ksleg Quote Tweet KDADSOfficial @KDADSOfficial VIDEO: Sec. Laura Howard and @GovLauraKelly extend their appreciation to healthcare workers in nursing and long-term care facilities for the compassionate around-the-clock care they provide to our most high-risk Kansans, especially during #COVID19 . https:// vimeo.com/413233784/4103 72cb9d ", "2020-04-30T17:50:44.000Z": "Make sure to tune into @GovLauraKelly 's address to the people of Kansas this evening. Watch on Facebook live: https:// facebook.com/GovLauraKelly/ , or check your local TV listings. #ksleg Quote Tweet Governor Laura Kelly @GovLauraKelly At  6:30 p.m. Thursday, April 30, I will deliver an address to the people of Kansas on my administration's official plan to reopen the state as we address the COVID-19 pandemic. (1/2) Show this thread", "2020-04-29T21:02:45.000Z": "The address will be broadcast on live television and available to radio stations in Kansas, and on my Facebook page at https:// facebook.com/GovLauraKelly/ . (2/2)", "2020-04-29T21:02:44.000Z": "At  6:30 p.m. Thursday, April 30, I will deliver an address to the people of Kansas on my administration's official plan to reopen the state as we address the COVID-19 pandemic. (1/2)", "2020-04-29T20:17:21.000Z": "During the COVID-19 pandemic, many individuals and businesses have taken on new tasks to fight the virus. Kansans' dedication to finding innovative ways to help others is one of many reasons I am proud to be governor of this great state. CapFed Best News: Polo Custom Products repairs gear for Stormont A company with headquarters in Topeka has veered from its usual production in recent weeks to repair vital equipment used by Stormont Vail Health's doctors and nurses as they treat coronavirus... cjonline.com", "2020-04-29T17:40:20.000Z": "Don't forget to tune in at 2 p.m. CST for my daily press briefing to hear updates on COVID-19 in Kansas. Watch it live on Facebook at http:// facebook.com/GovLauraKelly/ .", "2020-04-29T16:27:52.000Z": "High winds are expected today, here are some safety tips you can use to help you stay safe if you must drive.\nBe aware that wind gusts are unpredictable, and watch out for flying debris. \nIf you drive a high profile vehicle, you have a higher risk of being affected by high winds.", "2020-04-29T16:00:42.000Z": "In times like these, health is everything. #COVID19 is on everyone's mind, but there are other ways we need to stay healthy! Daily physical exercise is a must, and it can be very simple.", "2020-04-29T14:00:54.000Z": "Check out @buckuspirits ! This #Ottawa based family business has been cranking out hand sanitizer at an incredible rate! Another prime example of a Kansas company making a big change for the health of the people of our state.", "2020-04-29T14:34:30.000Z": "Reminder: \nBenefit payments typically take 2 - 3 bus. days to be deposited once payment has been issued. If you filed a weekly claim on Sun. or Mon. and it was approved, our system will typically issue the payment on Tues and you may see your payment as early as Thurs. (1/3)", "2020-04-29T13:25:36.000Z": "A new website for resources regarding COVID-19 is now live. The site is a centralized place for Kansans seeking information as the state responds to the COVID-19 pandemic. The site is ADA compliant, mobile optimized and will be available in Spanish. Governor announces state's new COVID-19 website - Governor of the State of Kansas governor.kansas.gov", "2020-04-28T17:56:43.000Z": "When Kansas became the first state to close school buildings for the rest of the school year, our teachers stepped up. All KS teachers deserve heartfelt thanks and support for their incredible work as they navigate this \"new normal\" in our education system. Sharon Hartin Iorio: Teacher heroes face the 'new normal' school This content is being provided for free as a public service to our readers during the coronavirus outbreak. Please support local journalism by subscribing to your local newspaper.As the battle with... cjonline.com", "2020-04-28T15:47:33.000Z": "Want to learn how to talk to your children about #COVID19 ? Or maybe you want to learn more about how to care for yourself & others? Find these resources & more in the Individuals & Families toolkit in the Online Resource Center: https:// bit.ly/2Sh3XSP  #KSPublicHealth", "2020-04-28T16:00:09.000Z": "My daily COVID-19 press briefing for today, April 28, has been canceled. Daily briefings will resume tomorrow, Wednesday, April 29, at the regular time of 2 p.m. CST. I would like to thank all Kansans for regularly tuning in to these briefings, staying informed and staying safe.", "2020-04-28T14:30:14.000Z": "If you're in a rural community, check out @usdaRD 's #COVID19 response page. It lays out answers to frequently asked questions, information on business resources and more. https:// rd.usda.gov/coronavirus", "2020-04-28T14:56:37.000Z": "Our team is continuing to work hard to implement the new PUA program for those who are self-employed, independent contractors, \"gig\"-workers or fall under any of the listed covered situations. \n\n(1/4)", "2020-04-27T17:47:16.000Z": "Here's what you need to know about the new legislation under the CARES Act. FPUC $600 payments have officially been implemented. Retroactive payments will be coming soon. The PUA program is in the process of being implemented. More updates will be provided soon.\n\n(1/2)", "2020-04-28T05:30:00.000Z": "It just makes sense. Fill out your census. \n\nThe future of Kansas is Counting on you! Fill out your census by going to http:// 2020census.gov it only takes a few moments, but the results can impact our state for years to come. #Census2020", "2020-04-27T20:50:09.000Z": "Today we mourn the loss of artist Richard Bergen. He created Ad Astra, the statue of a Native American hunter atop the Statehouse. Ad Astra's bow, pointed at the North Star, reminds us of our motto \"Ad Astra Per Aspera - to the stars through difficulties.\" Artist who built Kansas Statehouse statue dies at 95 MISSION, Kan. (AP) - Richard Bergen, the artist who built the 22-foot bronze statue of a Native American on top of the Kansas Statehouse dome, has died at 95. His daughter, Lori Bergen, said he die ksnt.com", "2020-04-27T20:33:12.000Z": "The State of Kansas' new and comprehensive COVID-19 online resource center is now live. Visit http:// covid.ks.gov for the latest news, information and resources related to unemployment assistance, business, agriculture, COVID-19 data and more. #ksleg", "2020-04-27T20:08:33.000Z": "Kansans are experiencing hardships as a result of the COVID-19 outbreak. KDOL wants to make sure you know your rights and resources available. \n\nCheck with your local options for community resources. #ksleg  #ksworks  #ksdol", "2020-04-27T14:17:02.000Z": "Kansas is now in 6th place in self-responding to the #2020Census . Help us pass 60% this week. Heck, let's go for 65%! Remind your friends & family to #BeCounted at http:// my2020census.gov . Help Kansas get the resources we deserve over the next decade. #KansasCounts", "2020-04-27T18:02:12.000Z": "2:30 p.m. time change for @GovLauraKelly & @SecNorman 's press conference today. Watch it live on our Facebook pages or later on Vimeo: https:// vimeo.com/showcase/69353 73   #ksleg Quote Tweet Governor Laura Kelly @GovLauraKelly My regularly scheduled press briefing to discuss the latest updates regarding COVID-19 for today, April 27, 2020, has been moved to 2:30 p.m. CST. Please visit my Facebook page at 2:30 p.m. to see the live broadcast. https:// facebook.com/GovLauraKelly/", "2020-04-27T17:46:57.000Z": "My regularly scheduled press briefing to discuss the latest updates regarding COVID-19 for today, April 27, 2020, has been moved to 2:30 p.m. CST. Please visit my Facebook page at 2:30 p.m. to see the live broadcast. https:// facebook.com/GovLauraKelly/", "2020-04-27T17:12:10.000Z": "ICYMI: Last week I appointed Lori Dougherty-Bichsel to fill the 3rd Judicial District court vacancy created when former Chief Judge Evelyn Wilson was appointed to the KS Supreme Court. Lori is a dedicated public servant who will serve Shawnee Co. & KS well. Governor appoints Lori Dougherty-Bichsel to fill district court vacancy in the 3rd Judicial... governor.kansas.gov", "2020-04-27T14:17:44.000Z": "Applications for @SBAgov 's #PaycheckProtectionProgram will be accepted again beginning this morning at 9:30 a.m. If you're thinking of a #PPP loan, act quickly to ensure you get proper consideration! http:// sba.gov/ppp", "2020-04-27T14:01:28.000Z": "Complete your #2020Census by going to https:// 2020census.gov  #KansasCounts  #ShapeYourFuture", "2020-04-27T13:49:00.000Z": "This morning's Ag Issues features an update on the impact of COVID-19 on the Kansas agriculture industry from Kansas Secretary of Agriculture Mike Beam. Quote Tweet Greg Akagi @GregAkagi Mon @WIBWNews Ag Issues Podcast w/ @KansasDeptofAg Secretary Mike Beam. https:// wibwnewsnow.com/wibw-radio-kan -podcast-kansas-secretary-of-agriculture-mike-beam-4/   #COVID19  #Meatpackers  #KsAgriculture  #Beef  #Cattle", "2020-04-24T00:22:50.000Z": "With gratitude to the heroes behind the scenes of #COVID19 -- the Medical Laboratory Professionals, with a special shout-out to #TeamKDHE . We couldn't do it without you! THANK YOU. #LabWeek Kansas Health and Environmental Laboratories - Thank You This is \"Kansas Health and Environmental Laboratories - Thank You\" by KDHE on Vimeo, the home for high quality videos and the people who love them. vimeo.com", "2020-04-24T20:21:38.000Z": "Today I sent a letter to members of Kansas' federal delegation commending them for supporting the latest coronavirus emergency relief package, & also conveying the urgent need for additional federal support in the form of direct, flexible state aid. #ksleg Governor Kelly applauds federal coronavirus relief, conveys need for flexibility - Governor of the... governor.kansas.gov", "2020-04-24T17:43:55.000Z": "This incredible example of kindness and generosity is the epitome of what it means to be a Kansan. I am so proud to be the governor of this great state. Quote Tweet Andrew Cuomo @NYGovCuomo I received this letter from a farmer in northeast Kansas. His wife is ill and he is aging. \n\nHe sent me 1 of 5 N95 masks he has from farming to pass on to a doctor or nurse in New York.\n\nThis is humanity at its best. I share his letter as inspiration.", "2020-04-24T17:34:01.000Z": "Don't forget to tune in at 2 p.m. CST for my daily press briefing to hear updates on COVID-19 in Kansas. Watch it live on Facebook at http:// facebook.com/GovLauraKelly/ .", "2020-04-24T16:00:44.000Z": "YOU COUNT! Kansas needs you to stand up and be recognized. The 2020 #Census is vital to our state. Head to http:// 2020census.gov and do your part. It only takes a few minutes, and an accurate count will go a long way for our state! #KansasCounts", "2020-04-24T15:30:00.000Z": "Every day our Highway workers put their lives on the line to keep Kansas moving. \n\nThey deserve our thanks, they deserve our respect. The best way you can show them how much they matter is by slowing down, paying attention in work zones and #MoveOverKS . #NWZAW", "2020-04-24T15:15:35.000Z": "At 8 a.m. CST Saturday morning, @CNN and @sesamestreet will host a town hall about the coronavirus for kids and parents alike. I encourage families to tune in to this wonderful program for Kansans of all ages. Quote Tweet Sesame Street @sesamestreet Do your kids have questions about Covid-19? We're teaming up with our friends at @CNN to help! The ABC's of Covid-19: A #CNNSesameStreet Town Hall for Kids and Parents, Saturday morning at 9am ET.", "2020-04-23T17:00:00.000Z": "Do your kids have questions about Covid-19? We're teaming up with our friends at @CNN to help! The ABC's of Covid-19: A #CNNSesameStreet Town Hall for Kids and Parents, Saturday morning at 9am ET.", "2020-04-24T13:59:22.000Z": "Highway workers help keep Kansas moving. We are grateful for the hard work they do every single day to help keep us connected to our communities. KDOT crews have one request: #MoveOverKS so they can make it home to their loved ones. Help protect them and yourself.", "2020-04-23T18:47:02.000Z": "Rumors & scams can easily circulate in times of crisis. Members of #Medicare & #Medicaid can be at increased risk for being targeted for #COVID19 fraud schemes; however, no one is immune. Learn more in the Resource Center: https:// bit.ly/3eMGKSk  #ksleg  @aarpks  @CommunityCareKS", "2020-04-23T20:17:56.000Z": "FPUC, which provides an additional $600 weekly payment for UI claimants, is now live!\n\nAnyone who is eligible for UI benefits will automatically receive this additional payment. There is no need to apply. Retroactive payments will be coming soon. #ksdol  #ksleg  #ksworks", "2020-04-23T20:49:58.000Z": "#Soldiers from the Kansas National Guard assist in packaging food items @HarvestersORG in Kansas City, Missouri, April 22. The Soldiers worked in a USDA-certified clean room, repacking bulk product into consumer retail size packaging for distribution. #community  #COVID19", "2020-04-23T19:47:41.000Z": "My thoughts are with the family and friends of Dave Seaton, longtime editor and publisher of the Winfield Courier. Dave was a bold advocate for his community and state, and a true Kansas newspaper icon. Seaton, local newspaper owner, leaves big legacy Long-time Winfield Courier publisher and newspaper owner Dave Seaton is being remembered as a bold journalist, dedicated community leader and devoted family man. ctnewsonline.com", "2020-04-23T17:55:04.000Z": "Don't forget to tune in at 2 p.m. CST for my daily press briefing to hear updates on COVID-19 in Kansas. Watch it live on Facebook at http:// facebook.com/GovLauraKelly/ .", "2020-04-23T15:45:51.000Z": "During my Listening Tour across Kansas last year, I saw firsthand the issues our rural communities face. This outbreak has created even more challenges in rural parts of KS. @USDA has provided a COVID-19 Federal Rural Resource Guide to provide assistance. https:// rd.usda.gov/coronavirus", "2020-04-23T16:27:40.000Z": "LIVE: Axios' @JimVandeHei and @khart host a conversation on the coronavirus' effect on education, featuring Kansas @GovLauraKelly , @khanacademy CEO @salkhanacademy and @FCC commissioner @AjitPaiFCC . Axios @axios Axios hosts a live virtual event on the coronavirus' effect on education", "2020-04-23T15:30:00.000Z": "TODAY at 12:30pm ET: @khart + @JimVandeHei discuss how to close the homework gap in middle America and nationally during the pandemic.\n\nHear from @GovLauraKelly , @AjitPaiFCC and @khanacademy 's @salkhanacademy .\nRegister: https:// theeducationpuzzle1.splashthat.com", "2020-04-23T14:21:49.000Z": "Tune in at 11:30 a.m. CST to hear me discuss education during the COVID-19 pandemic, and reiterate the significance of our decision to be the first state to close school buildings for the remainder of the school year. Quote Tweet Axios @axios THIS THURSDAY at 12:30pm ET: @khart + @JimVandeHei discuss how to close the homework gap in middle America and nationally during the pandemic. \n\nHear from @GovLauraKelly , @AjitPaiFCC and @khanacademy 's @salkhanacademy . \n\nRegister: https:// theeducationpuzzle1.splashthat.com Show this thread", "2020-04-23T13:32:09.000Z": "Best wishes for a happy and prosperous holiday to everyone in Kansas and around the world recognizing the holy month of #Ramadan .", "2020-04-22T21:52:38.000Z": "Food and agriculture businesses are serving essential functions across Kansas, and we appreciate your work. We especially appreciate your efforts to protect your team members and your community.", "2020-04-21T19:59:53.000Z": "THIS THURSDAY at 12:30pm ET: @khart + @JimVandeHei discuss how to close the homework gap in middle America and nationally during the pandemic. \n\nHear from @GovLauraKelly , @AjitPaiFCC and @khanacademy 's @salkhanacademy . \n\nRegister: https:// theeducationpuzzle1.splashthat.com", "2020-04-22T17:38:48.000Z": "Don't forget to tune in at 2 p.m. CST for my daily press briefing to hear updates on COVID-19 in Kansas. Watch it live on Facebook at http:// facebook.com/GovLauraKelly/ .", "2020-04-22T16:28:53.000Z": "Happy #EarthDay ! Did you know that 70% of the world is covered by water but only 3% is drinkable & accessible? #takecareofyourresources  #kswater", "2020-04-21T17:33:43.000Z": "REMEMBER: if you have not returned to work since filing your initial application for unemployment benefits, you do not need to file another application. You should file a weekly claim for each week you are not working. Today is last names A - M day to file! #ksworks  #ksleg", "2020-04-21T21:24:26.000Z": "During this uncertain time, the @KCSL Parent Hotline (1-800-CHILDREN) is a resource you can connect with 24 hours a day, seven days a week, to get simple questions answered or to just be a listening ear for your problems.\nLearn more  https:// kcsl.org/ParentHelpLine .aspx  . #ksleg", "2020-04-22T16:02:04.000Z": "There are a lot of ways to make your own compost bin. It can be indoors or outdoors, big or small. Here are some basics to get you started.  #StayHomeStaySafeSaveLives  #SaferAtHome  #StayAtHomeKansas  #DIY  #Compost", "2020-04-22T15:02:15.000Z": "KREC met virtually for Monday's Commission meeting to comply with the stay-at-home order in place for Kansas. The meeting was conducted pursuant to KOMA and K.A.R 16-20-1. ( http:// ow.ly/xnfa50zliI1 ).", "2020-04-22T15:30:00.000Z": "Top 5 contributing factors in work zone crashes: Not paying attention Following too closely, Improper lane change. Right of way violations, Driving too fast. \n\nHighway workers rely on you to slow down and pay attention in work zones. #NWZAW  #MoveOverKS", "2020-04-22T15:19:58.000Z": "In recognition of #EarthDay , let's all commit to protecting our planet and the natural resources of KS for future generations. We all can recognize Earth Day in some way, such as planting a tree, working in the garden, riding a bike or doing more to recycle.", "2020-04-22T15:00:42.000Z": "On the 50th Anniversary of #EarthDay , take a moment to learn more about #OneHealth . By working together, we can keep people, animals & the environment healthy. Learn what you can do from @CDCgov : http:// bit.ly/2tKjEsM", "2020-04-21T20:06:40.000Z": "KDOL has implemented the expansion of total benefits amounts up to a maximum of 26 weeks for claims filed on or after January 1, 2020. Claimants only need to continue filing weekly claims. There is no need to reapply for this extension. #ksworks  #ksleg  https:// bit.ly/2VsbZua", "2020-04-21T21:42:49.000Z": "La temporada de alergias está aquí y los síntomas pueden ser similares a #COVID19 . Encuentre este cuadro y la Herramienta de comprobación de síntomas de CDC en nuestro Centro de recursos en línea: https:// bit.ly/2RWvb12", "2020-04-21T21:43:29.000Z": "Allergy season is here and symptoms can be similar to #COVID19 . Find this chart and the @CDCgov 's Symptom Checker Tool in our Online Resource Center: https:// bit.ly/2RWvb12", "2020-04-21T20:33:50.000Z": "We have officially launched the state benefits extension from 16 weeks to up to 26 weeks for those claimants who initially filed for benefits on or after 1/1/2020. THERE IS NO NEED TO APPLY. Just continue to file your weekly claims. #ksdol  #ksworks", "2020-04-21T19:40:48.000Z": "Congratulations to @gsksmo on the success of its Census patch program. What started as a local effort by Girl Scouts to increase participation in the #2020Census has gone viral. Now, Scouts from 42 states and Puerto Rico have completed the patch. More: https:// governor.kansas.gov/wp-content/upl oads/2020/04/Census-Patch-Release-4-20-2020.pdf ", "2020-04-21T17:53:38.000Z": "Don't forget to tune in at 2 p.m. CST for my daily press briefing to hear updates on COVID-19 in Kansas. Watch it live on Facebook at https:// facebook.com/GovLauraKelly/ .", "2020-04-21T14:53:47.000Z": "I sincerely appreciate the thoughtfulness of the Kansans who sent these gifts and note of thanks for the work we're doing to keep Kansans healthy and safe. It's also great to see the support for small businesses!", "2020-04-21T01:51:06.000Z": "Handwashing prevents 1 in 5 respiratory infections, including #COVID19 , #cold and #flu . Learn more about how clean hands saves lives from @CDCgov  https:// bit.ly/2Vle1My", "2020-04-20T22:30:53.000Z": "En caso de que se haya perdido la conferencia de prensa #COVID19 del 20 de abril con @SecNorman y @GovLauraKelly y Mike Beam, Secretario del Departamento de Agricultura de Kansas, vea los subtítulos en español en Vimeo: https:// vimeo.com/showcase/69353 73 ", "2020-04-20T19:58:43.000Z": "The @KansasGuard and staff members from @KDHE load COVID-19 supplies into a UH-60 Black Hawk helicopter. The supplies were flown to Finney, Ford, Lyon and Seward counties for use by local public health departments. @GovLauraKelly  @NationalGuard Music: http:// bensound.com", "2020-04-20T20:36:09.000Z": "Thank you, Team @KansasGuard for the assist in delivering #COVID19 supplies. Quote Tweet KDEM @KansasEmergency The @KansasGuard and staff members from @KDHE load COVID-19 supplies into a UH-60 Black Hawk helicopter. The supplies were flown to Finney, Ford, Lyon and Seward counties for use by local public health departments. @GovLauraKelly  @NationalGuard Music: http:// bensound.com", "2020-04-20T20:30:31.000Z": "ICYMI - last week @DCFKansas Secretary Laura Howard and I announced the \"Hero Relief Program,\" which expands DCF's child care assistance subsidies for families and provides financial support directly to child care providers. DCF Announces Hero Relief Program dcf.ks.gov", "2020-04-20T18:16:37.000Z": "Don't forget to tune in at 2 p.m. CST for my daily press briefing to hear updates on COVID-19 in Kansas. Watch it live on Facebook at https:// facebook.com/GovLauraKelly/ .", "2020-04-20T15:53:03.000Z": "Cuando se trata de prevenir #COVID19 , quedarse en casa es más efectivo. Si salir de la casa es una necesidad, el distanciamiento social, el lavado frecuente de manos y el uso de una máscara pueden ayudar. Obtenga más información: https:// bit.ly/2Y1V0AP", "2020-04-20T16:50:35.000Z": "State employee temperature screening stations will be at Curtis and Landon, starting Tues., April 21.\n \nEmployees housed in the Capitol Complex (Curtis, Docking, Landon & Eisenhower) must first visit a screening station. \n\nFor more info, visit: https:// bit.ly/3eEz3NI", "2020-04-20T16:53:16.000Z": "These challenging times are taking a toll on all of us. For our essential agriculture workers who are experiencing more stress due to the COVID-19 crisis, please know @KansasDeptofAg has resources available to help: KansasAgStress.org | Resources to help fight ag-related stress KansasAgStress.org provides resources and support to help you and your family deal with ag-related stress that faces farmers and ranchers today. kansasagstress.org", "2020-04-20T15:25:43.000Z": "Yesterday I announced KS has received supplies and personal protective equipment to expand COVID-19 testing in Finney, Ford, Lyon & Seward counties. I want to thank our federal partners for their ongoing efforts to help our state response to this pandemic. Kansas receives additional PPE supplies, expands COVID-19 testing in Kansas - Governor of the State... governor.kansas.gov", "2020-04-20T14:15:42.000Z": "When it comes to preventing #COVID19 , staying home is most effective. If leaving the house is a necessity, then social distancing, frequent handwashing & wearing a mask can help. Learn more -- including how to make a mask -- in the Online Resource Center: https:// bit.ly/2Y1V0AP", "2020-04-17T21:44:15.000Z": "National Work Zone Awareness Week starts Monday! Join us as we share information and stories throughout the week on the importance of staying alert in work zones. We also invite you to GO ORANGE with us on Thursday, April 23, and wear orange in support of highway workers! #NWZAW", "2020-04-18T17:01:00.000Z": "Here is something you can do from home! Add a little color to your #garden by making it a #butterfly garden. Stay Home, Stay Safe, Save Lives. #Monarchs  #Kansas  #StayHomeStaySafeSaveLives", "2020-04-18T13:05:00.000Z": "If you were unable to file a weekly claim, you can still do so today! Remember, our new gating file process starts TOMORROW (after 12 pm, noon) for those who's last names start with A - M. Claims filed on Sun. and Mon. are processed at the same time. #ksdol  #ksworks  #ksleg", "2020-04-17T22:51:37.000Z": "I've been asked a lot of questions about coronavirus. There's no shortage of original questions when they come from Kansas kids. Enjoy this installment of Questions from Kids in two parts. #COVID19  #ksleg COVID-19 Questions from Kids - 8 This is \"COVID-19 Questions from Kids - 8\" by KDHE on Vimeo, the home for high quality videos and the people who love them. vimeo.com", "2020-04-17T23:51:37.000Z": "En caso de que se haya perdido la conferencia de prensa #COVID19 del 17 de abril con @SecNorman y @GovLauraKelly , vea los subtítulos en español en Vimeo: https:// vimeo.com/showcase/69353 73 ", "2020-04-17T19:29:46.000Z": "Gov. Laura Kelly ( @GovLauraKelly ) & DCF Secretary Laura Howard announced Friday the \"Hero Relief Program,\" which expands DCF's child care assistance subsidies for families & provides financial support directly to child care providers.\n\nNEWS RELEASE: http:// dcf.ks.gov/Newsroom/Pages/HeroReliefProgram.aspx   #ksleg DCF Announces Hero Relief Program dcf.ks.gov", "2020-04-17T22:03:49.000Z": "As @KansasDOL Secretary Delia Garcia announced yesterday, the Department of Labor is moving to a new claims process called \"gating.\" Kansans seeking claims will be asked to file an application for benefits and weekly claims on certain days by the first letter of their last name.", "2020-04-17T20:28:28.000Z": "April is #ChildAbusePreventionMonth - a reminder to raise awareness and empower others to help make great childhoods happen. Sadly, efforts to mitigate the spread of COVID-19 have heightened the risk of child abuse.", "2020-04-17T17:03:47.000Z": "In an effort to relieve some of the strain placed on our IT systems by the overwhelming number of claims coming in at the same time, KDOL is asking Kansans seeking claims to file an application for benefits and weekly claims on certain days by the first letter of their last name.", "2020-04-17T16:41:54.000Z": "ICYMI:  Claimants who's last names start with A - M file unemployment applications and weekly claims on Sun. (after noon), Tues. or Thurs. Claimants who's last names start with N - Z file unemployment applications and weekly claims on Mon., Wed. or Fri.\n\n(1/3)", "2020-04-17T16:17:56.000Z": "During this time of social distancing, we're asking all Kansans to stay alert and watch for child abuse and neglect in their neighborhoods and communities. #ksleg  #COVID19", "2020-04-17T15:30:13.000Z": "A heartwarming story of ingenuity in the Sunflower State. 7-year-old Ethan Stimac used a 3D printer to create KC-themed mask bands to help nurses keep masks on reliably and comfortably. When things get tough, Kansans get creative. Way to go, Ethan! https:// bit.ly/3ckueHL", "2020-04-17T15:18:15.000Z": "Being home more often may mean more cooking. Now is a great time to try new recipes! Visit National Institute on Aging to learn about shopping for healthy foods, smart food choices for healthy aging, sample menus, and more! https:// nia.nih.gov/health/healthy -eating ", "2020-04-17T15:03:29.000Z": "Don't forget to tune in at 2 p.m. CST for my daily press briefing to hear updates on COVID-19 in Kansas. Watch it live on my Facebook at https:// facebook.com/GovLauraKelly/ .", "2020-04-17T13:05:36.000Z": "On Wednesday I announced extension of the statewide stay-home order until May 3. I know this hasn't been easy, and we still have some difficult days ahead. But by staying home and staying safe, we can flatten the curve, save lives and beat this virus. Governor Laura Kelly extends Stay-At-Home order - Governor of the State of Kansas governor.kansas.gov", "2020-04-16T21:07:02.000Z": "We're hiring! We have openings for Customer Service Representatives in our Unemployment Contact Center. Learn more at https:// bit.ly/2RIwiS1  #ksworks", "2020-04-16T20:41:29.000Z": "It's not too late to complete your census form! It's one simple and effective way to support the future of our communities. #ksleg  #2020Census Quote Tweet KansasCounts @KansasCounts Census data impacts rural funding for things like water and waste disposal systems, rural electrification loans and community development grants just to name a few. Help shape the future of your community by completing the #2020Census at http:// my2020census.gov . #KansasCounts", "2020-04-16T18:29:12.000Z": "If you need to file a claim and your last name begins with the letter A - M, file a claim on Sunday (after noon), Tuesday, or Thursday. If you need to file a claim and your last name begins with the letter N - Z, file a claim on Monday, Wednesday, or Friday.\n\n(2/4)", "2020-04-16T18:29:11.000Z": "ANNOUNCEMENT: As @GovLauraKelly and Sec. García announced in their press conference, we have a new claims process! We are asking claimants to file an application for benefits and weekly claims on certain days by the first letter of their last name. \n\n(1/4)", "2020-04-16T19:02:48.000Z": "I encourage employees and employers looking to connect during the COVID-19 pandemic to visit http:// KANSASWORKS.COM/CORONAVIRUS . @KansasCommerce has compiled resources for employers with urgent hiring needs and information about who is hiring in Kansas. Quote Tweet Kansas Department of Commerce @KansasCommerce If you need a new job or need someone to fill an important role in your business, http:// KANSASWORKS.COM/CORONAVIRUS is for you. The site was built to keep employers and job seekers connected during this crisis. Visit the page to post a job or to find our who's hiring! #KANSASWORKS", "2020-04-16T17:39:27.000Z": "My regularly scheduled press briefing to discuss the latest updates regarding COVID-19 for today, April 16, 2020, has been moved to 1 p.m. Please visit my Facebook page at 1 p.m. to see the live broadcast. http:// facebook.com/GovLauraKelly/", "2020-04-16T17:07:37.000Z": "Even while offices are closed to the public, many services are available online! Visit us at https:// ksrevenue.org/onlineservices .html  for more information. #ksleg", "2020-04-16T15:07:23.000Z": "When it comes to preventing #COVID19 , staying home is most effective. If leaving the house is a necessity, then social distancing, frequent handwashing & wearing a mask can help. My mask protects you. Your mask protects me. Learn how to make your own: https:// bit.ly/2V2ylSE", "2020-04-16T15:00:44.000Z": "There are so many important ways an accurate #Census count helps Kansas. Federal funding for school programs, housing, community development projects and more depends on our count in the #2020census . Shape your future, start here! Visit http:// 2020census.gov !", "2020-04-16T14:51:11.000Z": "Yesterday I signed Executive Order #20-23, bringing KS adult-care homes in line with other occupational licensing exemptions issued in recent days. This order is needed to ensure adult care-home workers can continue to do their jobs during this pandemic. Governor Kelly signs new Executive Order as part of her administration's ongoing COVID-19 response... governor.kansas.gov", "2020-04-15T23:49:22.000Z": "En caso de que se haya perdido la conferencia de prensa #COVID19 del 15 de abril con @SecNorman y @GovLauraKelly vea los subtítulos en español en Vimeo: https:// bit.ly/2UQfuKR  @TelemundoKC", "2020-04-16T14:00:00.000Z": "Are you seeking information related to Kansas DCF's Rehabilitation Services during this #COVID19 pandemic?\nDCF has made available this guidance: http:// dcf.ks.gov/COVID19/Docume nts/COVID-19_RS_Guidance.pdf   #ksleg", "2020-04-16T13:00:36.000Z": "If you need a new job or need someone to fill an important role in your business, http:// KANSASWORKS.COM/CORONAVIRUS is for you. The site was built to keep employers and job seekers connected during this crisis. Visit the page to post a job or to find our who's hiring! #KANSASWORKS", "2020-04-15T22:24:13.000Z": "Reminder: Individual income tax, corp. income tax, & trust/estate tax return filing & payments are now due July 15, 2020.\nRead more here: https:// bit.ly/KDORextensions  #ksleg", "2020-04-15T20:48:07.000Z": "Businesses & employers can protect their team & their community from #COVID19 by following these practices at the beginning & end of every shift or work day. Find additional tools & resources in the Online Resource Center: https:// bit.ly/2XEpwQI . #Workforce  #EssentialWorker", "2020-04-15T20:59:52.000Z": "We have heard your frustration with our website and phone systems. Our team has been working to fix these issues and strengthen our systems. We will continue to double down on our efforts to serve all Kansans. We thank you for your patience and understanding.", "2020-04-15T20:58:43.000Z": "As you may have heard, Governor Kelly extended the stay-home order to May 3. We want to reopen Kansas as quickly as everyone else, but we must do it in a way that protects the health of all Kansans and our communities. @GovLauraKelly and the team are working closely (1/2)", "2020-04-15T19:38:58.000Z": "Gov. Laura Kelly ( @GovLauraKelly ) & Department for Children and Families Secretary Laura Howard announced Wednesday that DCF will begin issuing an emergency food assistance benefit to current program households. \n\nNEWS RELEASE: http:// dcf.ks.gov/Newsroom/Pages/EmergencyFoodAssistance.aspx   #ksleg DCF to Distribute Emergency Food Assistance Benefit dcf.ks.gov", "2020-04-15T17:55:37.000Z": "Tune in as @SecNorman joins @GovLauraKellys weekday #COVID19 press conference at 2 pm today (4/15). Watch it live or later on  Facebook. No Facebook? Need closed captioning? No problem! Find it later on Vimeo: https:// bit.ly/2UQfuKR  #ksleg", "2020-04-15T17:30:00.000Z": "Did you lose your job or have your hours reduced as a result of COVID-19? Businesses across Kansas need thousands of workers for immediate hire. Learn more about who is hiring in your community. https:// kansascommerce.gov/covid-19-respo nse/covid-19-jobs-and-hiring-portal/ ", "2020-04-15T16:55:38.000Z": "On this week's Kansan to Kansan, my husband, Dr. Ted Daughety, talks about the importance of social distancing during the COVID-19 pandemic and offers a few ideas on ways to stay busy while at home. Dr. Ted Daughety Kansan to Kansan youtube.com", "2020-04-15T01:42:27.000Z": "If you log into your UI benefits account and get a message saying, \"Claim status is not available at this time,\" don't panic! We have temporarily suspended the feature that allows you to check your benefits status in an effort to increase our website functionality.", "2020-04-15T13:37:04.000Z": "We are sharing success stories to highlight the great things our DCF staff, partners & stakeholders are doing to help children and families during the #COVID19 pandemic.\n\nCheck out this one from @KLSforkansas here: https:// facebook.com/KansasDCF/phot os/a.596434527051565/3377235768971413/?type=3&theater   #CaringInCrisis  #ksleg", "2020-04-15T01:21:16.000Z": "Parents need support to face the unique challenges in accessing childcare during #COVID19 . Some solutions include: Relatives & neighbors  @ccakansas for licensed providers & KDHE's tool for informed choices: https:// bit.ly/3a8yKHQ  Learn more: https:// bit.ly/2XzqGwS", "2020-04-14T19:24:00.000Z": "Our public transit workers provide essential services to communities by making sure everyone can access food, medical supplies or other necessities. Thank you to Topeka Metro & all bus drivers and public transit workers for keeping Kansans safe & healthy. Topeka Metro manager urges appreciation for bus drivers Describing them as \"true heroes,\" Topeka Metro general manager Bob Nugent encouraged the public Monday to offer thanks to the city's bus drivers.\"In the difficult times we have been facing it is... cjonline.com", "2020-04-14T16:54:35.000Z": "Thank you to fellow Kansan @metheridge for helping me spread the word about the importance of staying home so we can protect ourselves, our friends and our family from COVID-19. Stay home. Stay safe. Save lives. #SaferatHome . Message from Melissa Etheridge youtube.com", "2020-04-14T16:52:24.000Z": "Kansans have many questions about #COVID19 . We have answers - except for personal lab test results or medical advice. Your healthcare provider needs to hear those questions. Otherwise, call, email or check out the Online Resource Center: https:// bit.ly/3cfJ567", "2020-04-14T15:20:26.000Z": "KDOL's IT system has been struggling due to the heavy load placed upon it by enormous claims volumes. In an effort to fix the issues with the system, it will be taken down for one hour beginning at noon and again beginning at 7 pm on April 14, 2020.", "2020-04-14T16:07:03.000Z": "Yesterday I signed EO # 20-22. It lifts some weight restrictions and permitting requirements for certain motor carriers to get needed medical supplies, food shipments and other items moving through Kansas as quickly as possible. Governor Kelly announces executive order extending relief to motor carriers during COVID-19... governor.kansas.gov", "2020-04-14T16:00:41.000Z": "This week, the #Census bureau released a statement on how the Census will ensure health and safety while collecting data, including a proposed new timeline. If you haven't already, head to http:// 2020census.gov and make sure you're counted! #KansasCounts  https:// bit.ly/2VtY9X6", "2020-04-14T15:59:10.000Z": "This morning, the Commission extended its emergency order suspending utility disconnects until May 15 citing the continued threat of COVID-19. The previous order, issued March 16, had been set to expire tomorrow.", "2020-04-14T15:00:16.000Z": "", "2020-04-14T14:00:39.000Z": "#DYK that the decennial #census is required by the #Constitution and determines the number of seats each state gets in the U.S. House of Representatives? Learn more about the U.S. Census and the Amazing Apportionment Machine. https:// youtu.be/RUCnb5_HZc0  #KansasCounts  #2020Census The U.S. Census and the Amazing Apportionment Machine Apportionment is the process of dividing the seats in the House of Representatives among the 50 states based on the population figures collected during the d... youtube.com", "2020-04-14T13:52:53.000Z": "Due to new evidence that suggests some people without COVID-19 symptoms can transmit the virus before getting sick, @KDHE recommends Kansans use cloth face coverings when going out in public. For a guide to making a homemade mask, visit the following: https:// kdheks.gov/coronavirus/to olkit/Kansas_Homemade_Mask_Guidance.pdf ", "2020-04-14T00:00:59.000Z": "The @IRS will not call you asking to verify or provide your financial information so you can get a refund faster.\n\nFor the most up-to-date information go to http:// irs.gov .", "2020-04-13T21:01:07.000Z": "It's a difficult decision with the coronavirus. However, the Kansas Division of Emergency Management recommends that your first priority be to protect yourself from a potential tornado .", "2020-04-13T20:04:53.000Z": "Our 866 hotline number is experiencing technical difficulties today (4/13); however, you can still reach us by phone at 785-741-8680. You can also email questions to covid-19@ks.gov. Reminder: KDHE cannot provide medical advice or individual lab test results.", "2020-04-13T17:38:56.000Z": "Don't forget to tune in at 2 p.m. for my daily press briefing to hear updates on COVID-19 in Kansas. Watch it live on my Facebook at http:// facebook.com/GovLauraKelly/ .", "2020-04-13T15:35:34.000Z": "Thanks to all who participated this weekend in the #KansasEggHunt ! I saw many of your fantastic creations posted online. Even though Easter is over, you can still access free Kansas-themed coloring pages at http:// governor.kansas.gov/KansasEasterEg gs  . Kansas Egg Patterns - Governor of the State of Kansas governor.kansas.gov", "2020-04-13T15:30:15.000Z": "We're here to answer questions and help you through the SBA loan process! Chat with us online at https:// kansascommerce.gov , M-F, 9 a.m.-4 p.m. #COVID19", "2020-04-11T22:00:52.000Z": "When it comes to preventing #COVID19 , staying home is most effective. If leaving the house is a necessity, then social distancing, frequent handwashing & wearing a mask can help. Learn more about cloth face coverings: https:// bit.ly/2V2ylSE", "2020-04-13T13:46:10.000Z": "All Kansas borders and highways throughout the state remain open to the public. \n\nContact your county's local agencies for questions regarding Safe-at-Home orders.\n\nPlease continue to #DriveSafe , #BuckleUp and take proper #COVID19 precautions as you travel.", "2020-04-13T13:00:53.000Z": "We are experiencing technical difficulties that impact both our website and our claims filing by phone. We are working to fix this and will post as soon as the issues are resolved.", "2020-04-12T14:04:01.000Z": "Sending best wishes to all Kansans for a safe and happy Easter during this difficult time. Remember: Better times are ahead. Stay safe and stay hopeful. Governor Easter Message youtube.com", "2020-04-12T03:27:34.000Z": "I know that during difficult times like these, many Kansans turn to their faith for guidance and strength. That should continue - but in a way that will keep our friends and loved ones safe. (1/2)", "2020-04-12T03:12:41.000Z": "The order, which prohibits mass gatherings of more than 10 people - including church services and funerals - remains in effect.  (2/4)", "2020-04-12T03:12:40.000Z": "Today the Kansas Supreme Court ruled unanimously that the Legislative Coordinating Council (LCC) was not authorized to revoke Executive Order 20-18. https:// governor.kansas.gov/governors-stat ement-on-unanimous-kansas-supreme-court-ruling/  (1/4) Governor's statement on unanimous Kansas Supreme Court ruling - Governor of the State of Kansas governor.kansas.gov", "2020-04-12T01:33:05.000Z": "Cuando se trata de prevenir #COVID19 , quedarse en casa es más efectivo. Si salir de la casa es una necesidad, el distanciamiento social, el lavado frecuente de manos y el uso de una máscara pueden ayudar.", "2020-04-11T21:17:54.000Z": "I know that because of changes caused by the coronavirus, this Easter is going to be different for our kids. That's why I wanted to do something special so we all can celebrate - safely. Happy Easter! Kansas Kids Easter Message youtube.com", "2020-04-10T20:09:09.000Z": "Guidance has changed on wearing masks. Save the surgical and N95 masks for our medical teams and first responders, and take a deeper dive into homemade masks and cloth coverings: https:// kdheks.gov/coronavirus/to olkit/Kansas_Homemade_Mask_Guidance.pdf   #ksleg", "2020-04-11T20:00:58.000Z": "What's going on in Kansas? Virtual tours, live animal cameras and digital libraries! @KansasCapitol  @museumatPF  @KansasCityZoo  @TopekaZoo  @TopekaLibrary KSNG Museum - Virtual tour #COVID_19  #StayAtHomeKansas  #Stayhomeandsavelives", "2020-04-11T18:03:09.000Z": "Do you need to submit a form to KDOL? Here is a tip to help your form process easier and faster!", "2020-04-11T16:01:26.000Z": "With all the stress surrounding #COVID_19 , it's important to take care of yourself and to take a mental break. Go for a walk , unwind with activities you enjoy, eat a healthy snack or call and talk with a loved one.\n\nVisit https:// mentalhealth.gov for more information.", "2020-04-10T20:28:21.000Z": "The Unemployment Contact Center will be open tomorrow starting at 8 a.m.! Our call lines fill up quickly, so we recommend calling early.", "2020-04-10T20:39:52.000Z": "Questions about unemployment? The UI Call Center is online beginning at 8 a.m. tomorrow morning. Set your alarm and call early! Quote Tweet Kansas Department of Labor @KansasDOL The Unemployment Contact Center will be open tomorrow starting at 8 a.m.! Our call lines fill up quickly, so we recommend calling early. Show this thread", "2020-04-10T20:31:40.000Z": "We love seeing this kind of outreach and support in our Kansas communities! Well done, @CobaltBoats ! #kansasproud Quote Tweet Cobalt Boats @CobaltBoats Members of the Cobalt Engineering and Upholstery team worked together to provide 127 face masks and 65 hospital gowns for Wilson County Medical Center in Neodesha, KS, and over 400 reusable face masks for nearby nursing homes and the National Guard. #onlyacobalt  #alonetogether", "2020-04-10T17:42:33.000Z": "Yesterday I issued two Executive Orders as part of my administration's response to COVID-19. The first extends professional and occupational licenses for the remainder of the pandemic, and the second allows notaries and witnesses to do their jobs remotely. Governor Kelly issues Executive Orders to aid Kansans during COVID-19 pandemic - Governor of the... governor.kansas.gov", "2020-04-10T17:30:11.000Z": "http:// KANSASWORKS.COM/CORONAVIRUS is a tool dedicated to connecting companies with job seekers during this crisis. If you're looking for work, or if you need to fill positions in your organization, this site is for you!", "2020-04-10T16:45:43.000Z": "ICYMI - last night I joined @CNNTonight to reiterate the importance of Kansans working together to help end this public health crisis. We must put aside political games and do what's necessary to save lives. Quote Tweet CNN Tonight @CNNTonight \"I am not trying to suppress religion. I'm just trying to save Kansans lives.\" \n\nKansas Gov. Laura Kelly's administration filed a lawsuit with the Kansas supreme court over an order that sought to limit religious gatherings amid the coronavirus pandemic. https:// cnn.it/3aZA3Kn", "2020-04-10T16:09:09.000Z": "", "2020-04-10T16:07:28.000Z": "With the holiday weekend approaching, kids may be curious about how your family's plans have changed. Enjoy episode three of Ask Dr. Norman in two parts. #COVID19  #ksleg", "2020-04-10T15:41:10.000Z": "Scammers will try and use any tactic to gain valuable information. Here are just a few red flags to look out for when identifying scammers.", "2020-04-09T23:25:57.000Z": "So proud of our Kansas teachers and students as they adapt during these challenging times. Just as impressive is in how our communities are coming together to support one another and keep each other safe. Keep up the good work and keep learning. #SaferAtHome  #ksed Quote Tweet CoachBudke @CoachBudke First batch of face shield frames are being tested. The engineering students are working on a balance between flexibility as durability. We hope to have them available Tuesday during lunch pick-up. #RemoteLearningExperience  @KsCommissioner  @thomascmurray  @KCTVDani", "2020-04-09T18:48:02.000Z": "I know it's painful to refrain from gathering to recognize religious celebrations. But I encourage Kansans of all faith traditions to embrace alternate forms of worship. The physical church itself, while sacred and beloved, has never defined Kansans' deep and abiding faith.", "2020-04-09T18:01:10.000Z": "A reminder to stay safe and take shelter from severe weather, even during the #COVID_19 response. #kswx  #shelter  #tornado  #staysafe", "2020-04-09T17:25:52.000Z": "I've spoken with faith leaders from across the state, and they agree - it's critical for Kansans to maintain proper social distancing, including during religious gatherings. As difficult as this is, we all must do our part to mitigate the spread of COVID-19. #StayHome  #SaveLives", "2020-04-09T16:30:24.000Z": "Thank you to Kansas author and National Book Award finalist @Sarah_Smarsh for helping me share this important message. Please remember: Stay home. Stay safe. Save lives. #SaferatHome Sarah Smarsh PSA youtube.com", "2020-04-09T15:18:03.000Z": "In Kansas, we are right in the heart of the most dangerous time of this crisis. Yesterday, we had a 40% increase in COVID-19-related fatalities from the day before. Now more than ever, it is absolutely imperative that Kansans stay home and practice social distancing. #SaferatHome", "2020-04-09T13:45:37.000Z": "", "2020-04-09T13:30:46.000Z": "Stay home, stay save and save lives. #COVID_19  #StayAtHomeKansas  #saferathome", "2020-04-08T22:47:08.000Z": "That's why all the difficult decisions I've made up to this point have been unavoidable, and absolutely crucial. That's why I'm deeply disappointed that Republican leadership isn't putting the health and safety of Kansas families first - including our faith communities. (2/3)", "2020-04-08T22:47:07.000Z": "This virus has been hard for all of us. As your governor, all I can do is take decisive steps to mitigate the damage, flatten the curve as quickly as possible, and prevent this virus from reaching its full, lethal potential.  (1/3)", "2020-04-08T20:38:13.000Z": "Moved to 4:30 p.m. Watch live on Facebook or later on Vimeo. Quote Tweet KDHE @KDHE @GovLauraKelly & @SecNorman 's joint press conference  has been moved to 3:30 today (4/8). Watch it live on our Facebook accounts or later in closed captioning on Vimeo: https:// vimeo.com/showcase/69353 73 ", "2020-04-08T18:39:29.000Z": "Once again, I appreciate @CoachLesMiles with @KU_Football for reiterating the importance of staying at home and practicing social distancing in our efforts to mitigate the spread of COVID-19. Stay home. Stay safe. Save lives. #SaferatHome .", "2020-04-08T15:56:58.000Z": "My regularly scheduled press briefing to discuss the latest updates regarding COVID-19 for today, April 8, 2020, has been moved to 3:30 p.m. Please visit my Facebook page at 3:30 p.m. to see the live broadcast. https:// facebook.com/GovLauraKelly/", "2020-04-08T14:18:52.000Z": "All Kansas borders and highways throughout the state remain open to the public. \n\nContact your county's local agencies for questions regarding Safe-at-Home orders.\n\nPlease continue to #DriveSafe , #BuckleUp and take proper #COVID19 precautions as you travel.", "2020-04-08T15:00:39.000Z": "Are you a restaurant employee who's experienced hardship due to the COVID-19 outbreak? You may qualify for a grant through the Restaurant Employee Relief Fund. Click the link to learn more! @WeRRestaurants Restaurant Employee Relief Fund The Restaurant Employee Relief Fund (RERF) provides grants to restaurant industry employees experiencing hardship in the wake of the coronavirus (COVID-19) outbreak. Grants will be made to restaurant... rerf.us", "2020-04-08T14:04:30.000Z": "Best wishes to Jewish communities in Kansas and around the world for a safe and happy #Passover during these challenging times.", "2020-04-08T01:30:00.000Z": "DCF partners/stakeholders: Are you a small business owner impacted by #COVID19 & in need of assistance? \n\nThe Paycheck Protection Program is a forgivable loan that helps businesses like yours during the crisis.\n\nAPPLY NOW: https:// kansascommerce.gov/covid-19-respo nse/covid-19-response-business-incentives/   #ksleg  @KansasCommerce", "2020-04-06T18:16:08.000Z": "While offices are closed to the public, we are still offering online resources! From info about Kansas WebFile, driver's licenses, and other services to how to contact us with any questions, visit us at https:// ksrevenue.org/onlineservices .html   #ksleg", "2020-04-07T21:15:42.000Z": "Here are reliable resources available to you. @CDCgov  @WHO  @KDHE  @CSTS_USU", "2020-04-07T21:12:10.000Z": "Today I signed Executive Order #20-18, which brings our religious institutions in line with the previous order that limited public gatherings to 10 or fewer people. https:// governor.kansas.gov/governor-kelly -announces-revised-mass-gatherings-guidance-to-include-religious-services/  (1/3) Governor Kelly announces revised mass gatherings guidance to include religious services - Governor... governor.kansas.gov", "2020-04-07T20:44:14.000Z": "ICYMI: Quote Tweet Kansas Revenue @KanRevenue While offices are closed to the public, we are still offering online resources! From info about Kansas WebFile, driver's licenses, and other services to how to contact us with any questions, visit us at https:// ksrevenue.org/onlineservices .html   #ksleg", "2020-04-07T20:41:10.000Z": "Need groceries or other household supplies? If curbside pick-up or home delivery isn't an option, follow these seven tips to protect the health of all. #PreventTheSpread  #FlattenTheCurve  #COVID19  #StayHomeKansas  #SaferAtHome", "2020-04-06T23:45:23.000Z": "Direct deposit is the fastest and easiest way to get your unemployment insurance benefits! Please make sure you enter your banking information correctly. Update your preferred payment method by logging into your benefits account at https:// getkansasbenefits.gov/Home.aspx", "2020-04-06T19:43:17.000Z": "The sacrifices are real, but together we can do hard things. Thank you for doing your part to keep all Kansans safe & healthy. Have questions about the Stay at Home order? Check out @GovLauraKelly 's FAQs: https:// bit.ly/34e0yct  #TogetherUsAll  #StayHomeKansas  #SaferAtHome", "2020-04-07T18:11:52.000Z": "This #WorldHealthDay , take a minute to thank a healthcare worker for the work they do every single day. They are the heroes on the front lines protecting the lives of people across Kansas and around the world. THANK YOU!", "2020-04-07T17:43:51.000Z": "Remember: Under my stay-home order, Kansans are not required to carry or present any letter, identification card or other paper to prove they are allowed to leave their home. For more details about my recent Executive Orders, please visit http:// governor.kansas.gov/newsroom/execu tive-orders/  . #SaferatHome Executive Orders - Governor of the State of Kansas governor.kansas.gov", "2020-04-07T16:08:44.000Z": "Today, on #WorldHealthDay , we are so grateful to the heroes working in the healthcare industry during the #COVID19 crisis. They work to ensure our safety and well-being, even at the risk of their own health. Thank you for all you do!", "2020-04-07T16:07:38.000Z": "It's good to see Kansas farmers exercising creativity to help get the word out about the importance of good hygiene practices. To mitigate the spread of COVID-19, Kansans in urban and rural areas alike must wash their hands often, clean surfaces and stay home. #SaferatHome Quote Tweet Travis Heying @travisheying Along Hwy 77, north of Florence, Kansas. #CoronavirusPandemic", "2020-04-07T16:01:45.000Z": "RUMOR ALERT! #SpreadFactsNotFear  #StopTheRumors  #COVID_19", "2020-04-07T15:04:32.000Z": "Watch our daily update video on Facebook! https:// facebook.com/KansasDOL/vide os/648759479254656/  Join us tomorrow at 3 p.m. on our Facebook for our weekly virtual town hall meeting. #KSDOL  #COVID19 4.7 Daily Update with Secretary Garcia and UI Deputy Director Shawn... Today we will be sharing updates and a brief overview of the federal legislation. Please join us for our weekly virtual town hall on Facebook Live... facebook.com", "2020-04-07T15:00:36.000Z": "ATTN JOB SEEKERS! Employers across Kansas are hiring NOW! Hundreds of jobs have been posted on our COVID-19 jobs site in the last few days alone, and we expect hundreds more will be posted in days to come. Check back frequently to find new opportunities! https:// bit.ly/34mc1qs", "2020-04-05T20:00:53.000Z": "#COVID_19 scams are increasing. Here are some of the top scams being used. #Scams", "2020-04-07T14:01:06.000Z": "10 ideas for at-home physical activity during isolation\n\nDAY 7: #TenTips  #Yoga  #MentalHealth  #Meditate", "2020-04-01T14:56:19.000Z": "Visit https:// govstatus.egov.com/coronavirus for the latest information on #COVID_19 from @KDHE . You can find frequently asked questions, updates from @GovLauraKelly and more. GIF", "2020-04-07T13:30:11.000Z": "Have questions about applying for an SBA Emergency Injury Disaster Loan? We're here to help! Visit https:// kansascommerce.gov/covid-19-respo nse/  to chat online with a Commerce team member! Online chat is available M-F, 9 a.m.-4 p.m. #COVID19", "2020-04-07T01:09:30.000Z": "KDHE adds Connecticut to the travel quarantine list, effective for persons returning April 6 and moving forward. Read the release: https:// bit.ly/3aOi4GL . Find guidance for isolation & quarantine in the #COVID19 Online Resource Center: https:// bit.ly/3b0eLMN", "2020-04-07T00:36:40.000Z": "In case you missed the April 6 #COVID19 press conference with @SecNorman & @GovLauraKelly , watch it with closed captioning in English or Spanish on Vimeo: https:// vimeo.com/showcase/69353 73   #ksleg", "2020-04-06T21:46:34.000Z": "¡NO ES DEMASIADO TARDE! Haz que Kansas cuente. Sus respuestas son seguras y protegidas por la ley federal. Sus respuestas no pueden ser utilizadas en su contra por ninguna agencia gubernamental o tribunal. Complete el cuestionario del Censo hoy: https:// bit.ly/2UmDxkg", "2020-04-06T20:39:50.000Z": "IT'S NOT TOO LATE! Make sure #KansasCounts today & every day for the next 10 years! The Census informs federal funding for things like infrastructure, health care & food assistance. Take a few minutes to complete your count online today: https:// bit.ly/2UmDxkg  #2020Census", "2020-04-06T20:56:59.000Z": "I appreciate @KUHoops  @CoachBillSelf for reminding all of us that workers on the front lines in this pandemic deserve our sincerest thanks and appreciation. Remember: Stay home. Stay safe. Save lives. #SaferatHome .", "2020-04-06T20:24:45.000Z": "Last week, @GovLauraKelly signed the Eisenhower Legacy Transportation Program and we want your input on how to best visually represent the new program logo! Fill out the survey: https:// surveymonkey.com/r/C7CBVDF and tell us which one is your favorite! Survey ends Friday, April 10 at 5 P.M.", "2020-04-06T17:30:43.000Z": "These fourth-year University of Kansas School of Medicine students stepped up to help in such an important way. Thank you to all healthcare professionals in our state for going the extra mile to care for those affected by COVID-19. KU medical students to graduate early to help rural Kansas fight coronavirus pandemic Thirty-four counties in Kansas have only one or two physicians for their residents. kansascity.com", "2020-04-06T16:04:19.000Z": "Join @GovLauraKelly & @SecNorman for a #COVID19 press conference at 2 pm today (4/6). Watch it live or later on our Facebook pages. No Facebook, no problem. Find it later on Vimeo: https:// bit.ly/2UQfuKR  #ksleg", "2020-04-06T15:09:34.000Z": "On today's Kansan to Kansan, I show my appreciation for the many educators in Kansas working so hard to ensure their students receive a quality education during this truly unprecedented time. Kansan to Kansan On today's Kansan to Kansan, I show my appreciation for the many educators in Kansas working so hard to ensure their students receive a quality education dur... youtube.com", "2020-04-06T14:01:00.000Z": "10 ideas for at-home physical activity during isolation\n\nDAY 6: #TenTips  #SpringCleaning  #Chores  #Organize", "2020-04-05T19:31:08.000Z": "Do you need to file your weekly claim? The best way to do so is through our website. If you file over the phone, please do so before 8:00 am or after 4:30 pm when our phone lines are not as busy. For more info, check out our FAQ at https:// getkansasbenefits.gov/FAQs/Weekly.as px  .", "2020-04-04T14:00:51.000Z": "10 ideas for at-home physical activity during isolation\n\nDAY 4: #TenTips  #MowTheLawn  #Gardening  #Outside  #Flowers", "2020-04-04T15:00:34.000Z": "Check in regularly to the Department of Commerce's COVID-19 Response Resource webpage. We're making daily updates, adding new information and resources important to the Kansas business community. #COVID19  https:// bit.ly/2x92V3y", "2020-04-04T18:00:51.000Z": "There are heroes all around us: nurses , doctors , law enforcement and food preparation workers . You too can be a hero, a #HomebodyHero . #SaferAtHome  #StayAtHomeKansas  #COVID_19", "2020-04-04T21:19:02.000Z": "Kansans have many questions about #COVID19 . We have answers - except for personal lab test results or medical advice. Your healthcare provider needs those questions. Otherwise, call, email or ask Agent Kay the chat bot in the Online Resource Center: http:// bit.ly/2xPPR3B", "2020-04-03T20:26:11.000Z": "Governor Kelly announces partial resumption of State of Kansas operations - Governor of the State... governor.kansas.gov", "2020-04-03T20:34:48.000Z": "Curious what the main differences between @SBAgov PPP and EIDL are? https:// twitter.com/SecretaryTolan d/status/1246170852162523146  This Tweet is unavailable.", "null": "", "2020-04-03T20:24:12.000Z": "Today I signed a bipartisan bill creating the new 10-year Eisenhower Legacy Transportation Program. This plan features a visionary approach with the flexibility to address immediate needs and secure more opportunities for the future. Governor signs bipartisan transportation plan into law - Governor of the State of Kansas governor.kansas.gov", "2020-04-03T18:01:03.000Z": "Have you seen rumors on #COVID_19 ? Let us know!  #KSRumorWatch  #SpreadFactsNotFear  #StopTheRumors", "2020-04-03T15:30:22.000Z": "ACT NOW! Applications for the Payment Protection Program through the CARES Act open today. Act now to apply for this forgivable loan program, which is expected to be depleted within days. https:// bit.ly/2JBCnLv", "2020-04-03T15:22:52.000Z": "Thanks to @KU_Football 's @CoachLesMiles for \"spreading the news!\" All of us can play a part in mitigating the spread of COVID-19. Stay home. Stay safe. Stay healthy. #SaferatHome", "2020-04-02T21:30:00.000Z": "During this uncertain time, the Kansas Department for Children and Families knows there are many questions related to our child care program. Check out these FAQs for important information: http:// dcf.ks.gov/COVID19/Docume nts/COVID-19_ChildCareInfoforFamiliesFAQ.pdf  . #COVID19  #ksleg", "2020-04-03T14:01:07.000Z": "10 ideas for at-home physical activity during isolation\n\nDAY 3: #TenTips  #Stretch  #SaferAtHome", "2020-04-02T20:03:44.000Z": "I appreciate the hard work of the Parsons High School Career Technical Education program in helping to provide face shields to a local hospital. I am proud of all of our Kansas communities rallying together to provide innovative solutions like this one. PHS prints face shields for hospital parsonssun.com", "2020-04-02T18:30:08.000Z": "ATTN JOB SEEKERS! Employers across the state have urgent hiring needs related to increased activity due to COVID-19, and they're looking for you! Employers are adding new jobs to the portal every day, so check back regularly for new opportunities! http:// kansasworks.com/coronavirus", "2020-04-02T19:15:57.000Z": "In case you missed it, yesterday we launched a new map with more data. Check it out at http:// kdheks.gov/coronavirus . Don't forget to update your reference links or bookmarks. #COVID19 Quote Tweet Jayson Prentice @SeverePlains Great data and graphics from @KDHE Epidemiology on COVID-19 cases and testing in Kansas. Includes maps of cases across the state. https:// public.tableau.com/profile/kdhe.epidemiology#!/vizhome/COVID-19Data_15851817634470/KSCOVID-19CaseData ", "2020-04-02T18:04:11.000Z": "Yesterday may have been Census Day in the U.S., but it's not too late to complete the #2020Census . Census participation is so important for our state and our communities - let's make sure that every Kansan is counted. #KansasCounts", "2020-04-02T18:01:13.000Z": ": Should I still go to a public storm shelter with a stay-at-home mandate? YES! Sheltering from a tornado is priority. Protect your family and have a plan. Please contact your local authorities to see what shelters  are open or closed. #kswx  #tornado  #covid_19", "2020-04-02T16:22:31.000Z": "Thanks to @KStateFB 's @CoachKli for spreading the word. Stay home. Stay safe. We'll get through this together. #SaferatHome", "2020-04-02T14:01:14.000Z": "10 ideas for at-home physical activity during isolation\n\nDAY 2: #TenTips  #Dance  #Music", "2020-04-02T13:44:26.000Z": "Yesterday was #CensusDay , but there's still plenty of time to complete your Census! What's at stake? Billions in federal funds for public education & housing, road &bridges, healthcare and more! Do your part and help make sure #KansasCounts . Complete your Census today!", "2020-04-02T12:00:01.000Z": "While our offices our closed, we're still offering several services to assist you during the coronavirus pandemic. #COVID19  #ksleg", "2020-04-01T16:56:07.000Z": "It's #CensusDay2020 ! Please make sure to take some time and fill out your census questionnaire online! Let's make sure #KansasCounts . Start here: English", "2020-04-01T20:35:28.000Z": "FALSE RUMOR: We are still receiving reports on a letter going around social media saying the @DHSgov is mobilizing the National Guard. This is false. Please let others know about this fake letter so we can #SpreadFactsNotFear . #StoptheRumors  #KSRumorWatch", "2020-04-01T19:31:09.000Z": "We wanted to take a moment to thank our important partners, the Truckers who help keep our grocery stores stocked, and commerce moving. You do an incredible job and we are grateful for you. \nKDOT remains committed to keeping our highways open and Kansas moving. #togetherusall", "2020-04-01T20:15:40.000Z": "It's #AprilFoolsDay , but we're not joking when it comes to #MentalHealth . Reach out to your loved ones, friends and neighbors to make sure they are doing okay. Visit https:// samhsa.gov/find-help/nati onal-helpline  for more information. #NoAprilFools", "2020-04-01T20:02:22.000Z": "We need your help right now!  Please get counted! http:// 2020Census.gov Quote Tweet KansasCounts @KansasCounts A4: If 1% of Kansas is under counted in the #2020census , the state could miss receiving approximately $603,990,400 in federal funding over a 10-year period. It is critical that you count, your community counts, and #KansasCounts by participating in the census. #KSCensusChat", "2020-04-01T17:24:48.000Z": "This order will allow flexibility for Kansas workers and small-business owners to secure the safety and protection that unemployment insurance is designed to provide in times of crisis. (2/2)", "2020-04-01T17:24:47.000Z": "Yesterday I signed Executive Order 20-17, which ensures Kansas can draw down millions in federal dollars under the federal CARES act. https:// governor.kansas.gov/governor-kelly -issues-executive-order-to-help-meet-surging-demand-for-unemployment-benefits-for-workers-affected-by-covid-19/  (1/2) Governor Kelly issues Executive Order to help meet surging demand for unemployment benefits for... governor.kansas.gov", "2020-04-01T17:04:39.000Z": "Businesses who are uncertain whether they perform essential functions outlined in Executive Order 20-16 may fill out the online form at https:// governor.kansas.gov/KEFF/ or email KEFF@ks.gov for more information. @GovLauraKelly", "2020-04-01T14:47:56.000Z": "Make sure Kansas counts! Take 5-10 minutes to complete your questionnaire online, by phone or mail.\n\nVisit http:// census.gov now to take your Census. #Census2020  #KansasCounts", "2020-04-01T14:27:24.000Z": "IT'S CENSUS DAY! Make sure #KansasCounts . Take a few minutes today to complete your census questionnaire online if you haven't already. Visit http:// Census.gov now to complete your Census! #2020Census", "2020-04-01T03:20:50.000Z": "It's not an April Fools! KDOL has a new and improved automated process to retrieve your forgotten user name and reset your password and PIN!  Even if you have already submitted a request, visit https:// getkansasbenefits.gov/BenefitsStartM enu.aspx   #ksleg  #ksworks", "2020-03-31T20:27:46.000Z": "\"We should not let fear of the coronavirus blind us to the danger of an imminent tornado,\" @GovLauraKelly said. \"If you have to seek refuge in a community shelter, try to practice social distancing and other precautions as much as possible to minimize your risk.\"", "2020-04-01T03:04:56.000Z": "We couldn't agree more! Nurses are heroes #TogetherUsAll  #COVID19 Quote Tweet KS Board of Nursing @ksnursingboard The Kansas State Board of Nursing would like to recognize the contributions that are being made by nurses at all levels during this unprecedented COVID-19 pandemic. The courage that each front-line nurse demonstrates daily is heroic, requiring conquering personal anxiety [1/4] Show this thread", "2020-04-01T12:00:00.000Z": "Call us today to get the assistance you need. #COVID19  #ksleg", "2020-03-31T20:47:30.000Z": "", "2020-03-31T21:07:34.000Z": "Know where you are going before a tornado strikes. #kswx  @GovLauraKelly", "2020-03-31T23:06:43.000Z": "Kids have questions about #COVID19 too. I had so much fun the first time that we're back for round two. My team knew just who to ask. #LittlePolice  #ksleg COVID-19 Questions From Kids - 5 This is \"COVID-19 Questions From Kids - 5\" by KDHE on Vimeo, the home for high quality videos and the people who love them. vimeo.com", "2020-03-29T20:00:00.000Z": "Q: My license is about to expire.\nWhat do I do?\n\nA: @GovLauraKelly signed an executive order to automatically extend the dates of expiring licenses and vehicle registrations.\n\nRead more about it here: https:// bit.ly/KDORextensions", "2020-03-28T16:00:00.000Z": "Q: Is there an extension for homestead or property tax refund claims?\n\nA: @GovLauraKelly signed an executive order to automatically extend the date of homestead and property tax refund claims to 10/15/2020.\n\nRead more here: https:// bit.ly/KDORextensions", "2020-03-31T16:54:50.000Z": "We've updated the #COVID19 FAQs. Take a look: https:// bit.ly/2JpT9x5 . Find this resource & more in the Online Resource Center: https:// bit.ly/2wHEmv2", "2020-03-31T17:22:56.000Z": "There is a letter circulating on social media about the @DHSgov mobilizing the National Guard.  This is a RUMOR!!!  Currently, there are less than 60 Kansas National Guardsmen on state active duty in support of Kansans during the #Covid_19 Response. #KSRumorWatch", "2020-03-31T16:47:31.000Z": "Starting today, I will hold press briefings at 2 p.m. Monday through Friday to discuss the latest updates regarding COVID-19. You can see them live on my Facebook page, https:// facebook.com/GovLauraKelly/ .", "2020-03-31T13:41:56.000Z": "During this turbulent time, communicating with others is more important than ever. News about COVID-19 can cause fear or stress - especially among children. @KDHE 's website, http:// kdheks.gov , offers guidance on how to talk to kids about COVID-19: http:// kdheks.gov/coronavirus/to olkit/Talking_with_Children_and_Adolescents_About_COVID-19.pdf ", "2020-03-31T00:04:14.000Z": "Today is #NationalDoctorsDay . Doctors and their fellow healthcare workers in Kansas and beyond are risking their lives to protect us. We all owe a great deal to these dedicated professionals, and I want to say thank you from the bottom of my heart.", "2020-03-30T21:51:04.000Z": "Today I visited the @KansasDOL call center to thank our customer service representatives for their work. They're handling an unprecedented level of calls due to the COVID-19 pandemic, & doing all they can to help every Kansan who needs to file for Unemployment Insurance Benefits.", "2020-03-30T19:48:52.000Z": "Thank you, Kansas educators In his #COVID19 press conference today, @SecNorman discussed the data that now clearly illustrates that closing schools is a key factor to help #FlattenTheCurve . Watch the conference on Facebook. #KansansCan  #TogetherUsAll  #StayHomeKansas Quote Tweet KS Dept of Education @ksdehq Today, our schools, teachers, students &  families are showing us what it means to be Kansans. They're stepping up & embracing what has to be done in a time of adversity. Thank you for making KS the greatest place on earth. We are so proud of you. #KansansCan  #ItsaKSthing", "2020-03-30T20:19:53.000Z": "My employer filed my claim for unemployment benefits by spreadsheet. What do I do next  We've created an additional resource to outline key next steps! To learn more, read our \"Filing a Weekly Claim\" FAQ on our website:  https:// getkansasbenefits.gov/FAQs/Weekly.as px ", "2020-03-30T20:09:17.000Z": "In this week's Kansan to Kansan, I discuss the disruption the COVID-19 pandemic has caused to nearly every sector of the economy and offer tips for Kansans who now need to file for Unemployment Insurance Benefits. https:// facebook.com/GovLauraKelly/ videos/944013189347695/ ", "2020-03-30T18:10:17.000Z": "Not sure if your business provides functions that are considered \"essential\" under the Kansas Essential Functions Framework? Please visit http:// governor.kansas.gov/KEFF to submit an \"essential functions\" request and learn more about KEFF. #SaferatHome", "2020-03-30T17:15:21.000Z": "Join us on Facebook at 1:30 CST on M-W-F to hear the latest #COVID19 developments in Kansas. Can't join us live? Watch it later on Facebook or Vimeo: https:// vimeo.com/showcase/69353 73   #ksleg  #TogetherUsAll", "2020-03-28T14:00:01.000Z": "Are you eligible for TANF or cash assistance? The program assists families with children when parents or other responsible relatives cannot meet their family's basic needs. \nLearn more: http:// dcf.ks.gov/services/ees/p ages/cash/tanf.aspx  or visit the DCF Self-Service Portal to apply: https:// cssp.kees.ks.gov/apspssp/sspNon Med.portal ", "2020-03-30T15:21:53.000Z": "Information about COVID-19 changes quickly. To access up-to-date guidance, please visit the @KDHE website, http:// kdheks.gov/coronavirus . Additionally, visit http:// getkansasbenefits.gov for federal stimulus benefits updates or to file for Unemployment Insurance Benefits with @KansasDOL .", "2020-03-30T15:01:02.000Z": "THANK YOU, DOCTORS! We're thankful for Kansas #doctors every day, but especially now as they work to keep our communities safe and healthy. #nationaldoctorsday", "2020-03-30T14:00:01.000Z": "Q: Are tax returns still being processed while offices are closed?\n\nA: Yes, we have employees processing returns as they come in. \n\nRead about all KDOR extensions here: https:// bit.ly/KDORextensions", "2020-03-29T17:33:22.000Z": "Please expect slower processing times on our website today as we are experiencing a high volume of activity. If you are experiencing difficulties, wait to file your weekly claim until later in the day when fewer people are accessing our website. We appreciate your patience!", "2020-03-29T15:32:06.000Z": "Your house, your family! Staying safe and stopping the spread of #Covid_19 doesn't include gatherings or parties with stay home orders in effect. #SaferAtHome  #StoptheSpread", "2020-03-29T13:09:18.000Z": "Rumor: You need documentation saying that you are an essential employee.\n\nFACT: You are not required to have this paperwork, or be asked to show law enforcement. #KSRumorWatch  #SpreadFactsNotFear  #StopTheRumor", "2020-03-28T00:30:00.000Z": "The coronavirus pandemic can be overwhelming & also can affect emotional health. @samhsagov 's @distressline provides 24/7, 365-day-a-year crisis counseling & support to people experiencing emotional distress related to #COVID19 & other disasters.\n\nMORE: Disaster Distress Helpline SAMHSA's Disaster Distress Helpline provides 24/7, 365-day-a-year crisis counseling and support to people experiencing emotional distress related to natural or human-caused disasters. samhsa.gov", "2020-03-28T18:01:37.000Z": "I know that abiding by the statewide stay-home order I issued this morning is difficult. But remember: We're in this together. Stay home. Stay safe.", "2020-03-28T17:21:39.000Z": "As part of ongoing efforts to limit the spread of COVID-19 in Kansas, today I issued Executive Order 20-16, making Kansas the 22nd state in the nation to institute a temporary, statewide stay-home order. https:// governor.kansas.gov/governor-kelly -issues-temporary-statewide-stay-home-order-in-ongoing-effort-to-combat-covid-19/  (1/3) Governor Kelly issues temporary, statewide Stay Home order in ongoing effort to combat COVID-19 -... governor.kansas.gov", "2020-03-27T19:58:03.000Z": "Get the latest #COVID19 developments from @SecNorman by watching the March 27 press conference on Facebook: https:// facebook.com/KDHEnews/video s/2275555782749312/   #ksleg", "2020-03-27T19:35:28.000Z": "All Kansas borders and highways throughout the state remain open to the public. \n\nContact your county's local agencies for questions regarding Safe-at-Home orders.\n\nPlease continue to #DriveSafe , #BuckleUp and take proper #COVID19 precautions as you travel.", "2020-03-27T18:56:47.000Z": "Rumor: You need documentation saying that you are an essential employee.\n\nFACT: You are not required to have this paperwork, or be asked to show law enforcement. If this happens to you call 911!", "2020-03-27T18:43:04.000Z": "IMPORTANT! When information is available about the additional $600 payments, we will share that information on our website and social media. Please do not call the contact center at this time to ask about these payments. They are not yet available. #ksleg  #kdol  #ksworks", "2020-03-27T18:33:36.000Z": "KDADS Announces $2 Million in Additional Funding for Senior Nutrition Services; States Receive Additional Grants from HHS to Feed Older Americans During COVID-19 Outbreak #COVID19  https:// bit.ly/3at57BS", "2020-03-27T16:13:38.000Z": "As we hunker down in our homes to reduce the spread of COVID-19, it is still important for our health - both physical and mental - to make time for some exercise. @KDHE has several ideas for at-home activities: http:// kdheks.gov/coronavirus/to olkit/10_at_Home_Physical_Activities.pdf ", "2020-03-27T16:07:03.000Z": "Kids say the darndest things. They are always soaking up information, and they have really great questions. I wondered what questions children have about COVID-19, so I asked some 6th, 7th and 8th graders. Their questions, my answers in four parts.", "2020-03-27T14:08:03.000Z": "Check out the full February Labor Report here: https:// klic.dol.ks.gov/gsipub/index.a sp?docid=472   #KSDOL  #ksleg", "2020-03-27T14:57:43.000Z": "Q: Am I eligible for a tax extension?\nA: @GovLauraKelly signed an EO to apply an automatic extension to all individual income tax, corp. income tax, & trust/estate tax returns. Filing & payments are due 7/15/2020.\nRead more here: https:// bit.ly/KDORextensions  #ksleg", "2020-03-27T13:04:13.000Z": "We know KSans have many ?s about #COVID19 , & we have answers -- except for personal lab test results & medical advice. Your healthcare provider needs to hear those questions. Otherwise, call 866-534-3463, email covid-19@ks.gov or ask the chat bot: http:// bit.ly/2xPPR3B .", "2020-03-26T22:00:32.000Z": "Earlier this week, @GovLauraKelly and I removed restrictions to speed up the flow of working capital loans to small businesses in @MainStreetKS communities. We're making the Incentives Without Walls program faster and easier to help with #COVID19 response.", "2020-03-27T02:25:03.000Z": "DYK the #2020Census shapes funding for emergency preparedness, disaster relief, health tracking & disease control, schools, roads & more! You should have received instructions & your ID from the @uscensusbureau . Respond online today: https:// bit.ly/2UmDxkg . #KansasCounts", "2020-03-26T23:00:00.000Z": "Social distancing and quarantine may come with concerns for individuals, families, and communities.\n\nView SAMHSA's \"Tips For Social Distancing, Quarantine, And Isolation During An Infectious Disease Outbreak\" for use during this time.  http:// bit.ly/2Qockv1  #COVID19  #ksleg", "2020-03-26T23:00:17.000Z": "Check in regularly to the Department of Commerce's COVID-19 Response Resource webpage. We're making daily updates, adding new information and resources important to the Kansas business community. https:// bit.ly/2UCKJYl  #COVID19", "2020-03-26T22:05:03.000Z": "ATTENTION MAIN STREET COMMUNITIES! You can now use Incentives Without Walls funds to make working capital loans for operating expenses including payroll & commercial loan payments for businesses impacted by #COVID19 . Contact scott.sewell@ks.gov for more info. #WeAreMainStreet", "2020-03-26T19:00:44.000Z": "Wondering if you're eligible and how to apply for a @SBAgov disaster loan? Here are some helpful tips from @StartlandNews in KC. #COVID19 Firsthand from a founder: Applying for a SBA disaster loan? Come prepared with startup financials If you have a small business (fewer than 500 employees) and are being affected by COVID-19, then I recommend applying, writes founder and ecosystem builder Bo Lais. startlandnews.com", "2020-03-26T19:45:05.000Z": "The Kansas Small Business Development Center will be hosting a free webinar to share the latest updates for small businesses seeking COVID-19 disaster relief. Monday, March 30, 10 a.m. REGISTER TODAY! https:// bit.ly/3bs5ug3", "2020-03-26T19:06:56.000Z": "Attention Employers! We've added a Covid-19 Essential Jobs tab for you to apply to your job posts on http:// KANSASWORKS.com . Post your current job openings! For questions, please call (877) 509-6757 or visit the Live Chat feature on http:// KANSASWORKS.com  #ksjobs  #covid19", "2020-03-26T18:00:55.000Z": "When you are home practicing social distancing, take time to complete the #2020Census . Completion rates not only determine the federal funds our communities receive, but could also help your team make it to the National Championship in this bracket: CensusBrackets censusbrackets.org", "2020-03-25T23:48:04.000Z": "#COVID19  #FAQ : We receive many questions about decisions made at the county level, such as stay-at-home orders & business closures. For questions specific to your county, please reach out to your county health department, who can put you in touch with your County Health Officer.", "2020-03-26T17:12:56.000Z": "In this week's Kansan to Kansan, I want to address the difficult decision to close Kansas school buildings for the rest of the school year - and emphasize that though these are turbulent times, we will get through this together. https:// facebook.com/GovLauraKelly/ videos/630706974436675/ ", "2020-03-25T16:36:45.000Z": "REMINDER: The job search requirement (My ReEmployment Plan, KBEN-990) has been waived at this time. This form is no longer required. #KSDOL  #KSWorks  #covid19", "2020-03-25T21:27:15.000Z": "Soldiers from the 1st Bn, 108th Aviation Regiment load two UH-60 Black Hawk helicopters with Bambi buckets in preparation for going to Barber County to help support local firefighters battling a wildland fire. @GovLauraKelly  @ksfiremarshal  @KSForestService", "2020-03-25T21:10:47.000Z": "Everyone can help slow the spread of COVID-19. By practicing social distancing, washing your hands often and staying home as much as possible, we all can do our part to flatten the curve and save lives.", "2020-03-25T20:01:30.000Z": "Today I signed the state's budget bill for Fiscal Years 2020 and 2021, which includes $65 million to help support COVID-19 response efforts in Kansas. I appreciate the bipartisan work of lawmakers who approved a budget swiftly in the midst of this pandemic. Gov. Laura Kelly signs state budget, approves $65 million for Kansas coronavirus response -... governor.kansas.gov", "2020-03-25T19:32:11.000Z": "Because of the impacts of COVID-19 and to provide communities more time to develop and submit applications, the deadline to submit projects for the 2nd round of the Cost Share Program has been postponed to May 18. \n\nFor more info go here: https:// bit.ly/2JdCQmP", "2020-03-25T19:00:00.000Z": "SCAM ALERT: Please be aware of a scam involving participants of food assistance, or SNAP. \n\nIf SNAP participants in Kansas are unsure if a request for information is legitimate, please contact your local DCF service center. #ksleg", "2020-03-25T13:43:37.000Z": "We know there are lots of questions regarding unemployment benefits right now. Today at 3 p.m., Secretary Garcia will give an update on Facebook Live. Be sure to share this info with anyone who might be interested and tun in at 3 p.m.! @KansasWorkforce Quote Tweet Kansas Department of Labor @KansasDOL Join Secretary Delía García LIVE on Facebook tomorrow at 3 p.m. for an update surrounding unemployment benefits and COVID-19. https:// facebook.com/KansasDOL/  #KSDOL  #KSWorks  #COVID19", "2020-03-25T17:59:45.000Z": "Due to unprecedented volume of questions, KDOL is unable to answer indiv. questions at this time. Staff will continue to monitor social media and the Communications Inbox daily for FAQs to be answered during the Morning Video Update at 9:30 a.m., Mon-Fri.", "2020-03-25T02:59:06.000Z": "You've likely heard this before, but it bears repeating. Do you part to stop the spreading -- the disease & the misinformation too. @fema debunks a few common #COVID19 myths here: https:// bit.ly/2WNuaeK . @femaregion7  #StopTheSpread", "2020-03-25T16:03:23.000Z": "", "2020-03-25T15:00:02.000Z": "The KDHE hotline is getting an upgrade today (3/25). Should you experience difficulty or delay at 866-534-3463, #TeamKDHE is ready to assist online. Email your questions to covid-19@ks.gov or visit the chat bot in the #COVID19 Resource Center: https:// govstatus.egov.com/coronavirus", "2020-03-25T13:00:00.000Z": "If you're looking to get a paper copy of a benefits application but don't have a printer, you can visit your local DCF service center today & grab one. Paper apps are available outside each DCF service center. Completed apps can be left in drop boxes outside each service center.", "2020-03-24T21:48:47.000Z": "One of the common questions we've received is, \"Are the rest areas still open?\"\nKDOT rest areas that are not closed for repairs are open at this time. We ask that everyone please travel wisely. For updated road conditions/truck parking, check http:// kandrive.org or call 511", "2020-03-24T21:26:38.000Z": "Today I issued two executive orders to keep Kansans safe during the COVID-19 pandemic. The first limits mass gatherings in KS to 10 persons & the second details a framework that counties will be required to use if local officials issue stay-at-home orders. Governor Kelly signs Executive Orders limiting gatherings, providing essential function framework... governor.kansas.gov", "2020-03-24T21:00:39.000Z": "Within 48 hours of @GovLauraKelly announcing the establishment of the Hospitality Industry Relief Emergency (HIRE) Fund, all $5 million allocated for the loan program had been awarded. https:// bit.ly/33TWP3H  #HIREfund  #COVID19  @networkkansas", "2020-03-24T20:07:29.000Z": "Kansas' medical professionals, grocery store & food industry workers, custodial staff, emergency responders and the many others working so hard to keep Kansans safe and healthy deserve our heartfelt thanks. It's a trying time, and we all appreciate your commitment and dedication.", "2020-03-24T19:30:00.000Z": "Reminder: Due to an extreme volume of calls, @KansasDOL is encouraging Kansas employees and workers to visit http:// dol.ks.gov or http:// GetKansasBenefits.gov to apply for benefits, file by spreadsheet, find answers to frequently asked questions and utilize additional resources.", "2020-03-24T18:34:04.000Z": "During my #KansasORP Tour last summer, I had the chance to visit dozens of amazing local restaurants. Due to the effects of COVID-19, businesses like these across Kansas now need your help. If you're able, please considering ordering take-out from your favorite local eateries.", "2020-03-24T15:30:03.000Z": "Call your local Community Blood Center to schedule an appointment to donate blood. They are in need of donations! #DonateBlood  #COVID19 Quote Tweet CommunityBloodCenter @CommBloodCtrKC We've expanded the capacity of our donor centers to allow donors to be more spread out, & have revised our donor appointment schedules for the same reason. We've transitioned to appointments only to control donor spacing.\n\nMake your appointment to donate: http:// smarturl.it/CBC_GiveTW", "2020-03-24T16:21:42.000Z": "@KDHE has issued guidance on prevention for workers who visit homes to include assessment questions before scheduling a visit and before entering the home.\nFor more information: http:// kdheks.gov/coronavirus", "2020-03-24T15:48:54.000Z": "It's great to see Boot Hill Distillery in Dodge City improvise in a time of need by producing free hand cleanser for the local community. Through these stressful times, the people of Kansas continue to step up & show the nation what it means to be a Kansan. Boot Hill Distillery supplying free hand sanitizer This content is being provided for free as a public service to our readers during the coronavirus outbreak. Please support local journalism by subscribing to www.dodgeglobe.com/ at https://www.dodg... dodgeglobe.com", "2020-03-24T01:41:30.000Z": "vehicle registration renewals, and preventing evictions due to COVID-19-related issues while dealing with this pandemic. More information attached: https:// governor.kansas.gov/governor-kelly -announces-four-executive-orders-to-aid-kansans-during-covid-19-pandemic/  (2/3) Governor Kelly announces four executive orders to aid Kansans during COVID-19 pandemic - Governor... governor.kansas.gov", "2020-03-24T01:41:29.000Z": "Today I signed four executive orders pushing back the tax filing deadline until July 15th, maintaining public health by keeping our waste removal services running, providing some leniency for Kansans by extending deadlines for driver's licenses and (1/3)", "2020-03-23T23:18:31.000Z": "Today @GovLauraKelly signed an executive order extending deadlines for driver's licenses and vehicle registration renewals and regulations during the COVID-19 pandemic. Read more: https:// governor.kansas.gov/governor-kelly -announces-four-executive-orders-to-aid-kansans-during-covid-19-pandemic/   #ksleg", "2020-03-23T23:20:50.000Z": ". @GovLauraKelly has signed an executive order extending tax filing deadlines to July 15, 2020, and waiving any interest and penalties for returns and payments made on or before July 15, 2020. Read more here: https:// governor.kansas.gov/governor-kelly -announces-four-executive-orders-to-aid-kansans-during-covid-19-pandemic/   #ksleg", "2020-03-23T22:58:24.000Z": "KDHE issued several #COVID19 updates today, including new states added to the quarantine mandates list, as well as \ntesting prioritization guidance for tests sent to the Kansas Health & Environmental Laboratories. #ksleg  https:// khap2.kdhe.state.ks.us/NewsRelease/PD Fs/3-23-2020%20Updates.pdf ", "2020-03-23T22:58:13.000Z": "BREAKING: @GovLauraKelly issued an Executive Order this afternoon pushing the filing deadline for personal and corporate income tax filings from April 15 to July 15, aligning the state deadline with the recently extended federal deadline. #COVID19", "2020-03-23T21:30:34.000Z": ". @GovLauraKelly today announced an Executive Order limiting mass gatherings to 10 persons. For more information check out the press release in its entirety here: Governor Kelly announces Executive Order to further improve public safety regarding COVID-19... governor.kansas.gov", "2020-03-23T18:10:17.000Z": "La gobernadora @GovLauraKelly y @SecNorman del @KDHE transmitirán una conferencia de prensa hoy a la 1:30pm para ofrecer actualizaciones sobre el #coronavirus en el estado de Kansas. Sintontiza aquí: http:// facebook.com/GovLauraKelly Quote Tweet Governor Laura Kelly @GovLauraKelly Please join us live on my Facebook page at 1:30 p.m. for a press conference with @SecNorman of @KDHE for updates regarding COVID-19. To view my Facebook page, click here: https:// facebook.com/GovLauraKelly/", "2020-03-23T17:34:20.000Z": "Please join us live on my Facebook page at 1:30 p.m. for a press conference with @SecNorman of @KDHE for updates regarding COVID-19. To view my Facebook page, click here: https:// facebook.com/GovLauraKelly/", "2020-03-23T16:17:05.000Z": "Save yourselves and your staff time by filing claims by spreadsheet!", "2020-03-23T13:51:08.000Z": "FAQ RE: #COVID19 testing Quote Tweet Lee Norman @SecNorman Replying to @kenjansen @AnnClemens and @KDHE Our State Lab of Kansas doesn't test well people, but anyone else who the doctor requests one of we will. Assuming the illness symptoms are consistent with an respiratory infectious disease. The commercial labs in the state will test anybody for whom a doctor orders the test.", "2020-03-23T13:38:00.000Z": "Essential services still being provided via Live Chat at http:// kansasworks.com and by phone at 877.509.6757. Quote Tweet KANSASWORKS @KansasWorkforce All Workforce Centers will be closed beginning today, March 23, but services will still be available. Visit http:// KANSASWORKS.com to speak to a staff member on live chat, download the free KANSASWORKS Mobile App or call (877) 509-6757 for assistance #ksjobs  #kansasworks", "2020-03-23T13:17:48.000Z": "Executive order #20-09 lifts certain weight restrictions and permitting requirements for motor carriers to allow needed supplies to travel for COVID-19 response efforts. Keep that food supply chain moving! (And all other necessary supplies too!) Quote Tweet Governor Laura Kelly @GovLauraKelly Today I announced Executive Order #20-08 and Executive Order #20-09. While each of these orders has a specific purpose, together they will make sure Kansas families can access needed care and supplies until we have weathered this storm. Learn more: https:// governor.kansas.gov/governor-kelly -announces-executive-orders-to-assist-kansans-amid-covid-19-pandemic/ ", "2020-03-23T12:00:00.000Z": "Kansas DCF has a quick and easy tool to find out if your household might be able to get food assistance, cash assistance, child care assistance, energy assistance or other services. Take this self-assessment now to find out if you're eligible: https:// cssp.kees.ks.gov/apspssp/sspNon Med.portal?_nfpb=true&_st=&_windowLabel=amIEligible_1_5&_urlType=action&_state=maximized&wlpamIEligible_1_5_render=welcome&wlpamIEligible_1_5_javax.portlet.action=maximize#wlp_amIEligible_1_5   #ksleg", "2020-03-23T01:22:50.000Z": "Today I announced Executive Order #20-08 and Executive Order #20-09. While each of these orders has a specific purpose, together they will make sure Kansas families can access needed care and supplies until we have weathered this storm. Learn more: Governor Kelly announces executive orders to assist Kansans amid COVID-19 pandemic - Governor of... governor.kansas.gov", "2020-03-22T22:47:49.000Z": "Guidance for Supporting Families in Accessing Healthy & Safe Child Care During the #COVID19 Outbreak: https:// khap2.kdhe.state.ks.us/NewsRelease/PD Fs/03.22.2020%20childcare.final.pdf ", "2020-03-22T22:13:48.000Z": "Last week I announced that gatherings of 50 people or more were temporarily prohibited to mitigate the spread of COVID-19. But I want to be clear: blood drives are not included. I encourage all who can to donate blood during this critical time. Executive Order No. 20-04 - Governor of the State of Kansas governor.kansas.gov", "2020-03-22T17:12:36.000Z": "DCF's offices are closed until further notice because of #COVID19 . \n\nEach DCF region will have a emergency service phone number you can contact.\n Wichita Region: 316-337-7222\n KC Region: 1-888-369-4777\n East Region: 785-296-2500\n West Region: 785-462-6760 ext. 206 #ksleg", "2020-03-21T20:21:04.000Z": "FAQ update RE: testing & supplies. #COVID19 Quote Tweet Lee Norman @SecNorman Replying to @AnnClemens and @KDHE Our State lab has enough kits to do the tests that are requested of us. Our supply has had good days and bad, but we have not turned away samples for lack of supplies. Plus, four commercial companies can do them also.", "2020-03-22T14:52:42.000Z": "Despite numerous rumors, the National Guard is not staging at Arrowhead Stadium or Kansas City Royals Stadium. @Missouri_NG  #SpreadFactsNotFear  #Coronavirus  #StopTheRumors Quote Tweet KCKPD @KCKPDChief We don't like rumors. Please don't spread them. If you are telling people that the Nat. Guard is going to impose Martial Law, please stop. It's not true. They are busy being helping distribute medical supplies. Please and thank you. #COVID19  #kckpd  #commonsense  #norumors", "2020-03-21T21:45:31.000Z": "I'm grateful for the combined efforts of businesses, @KansasCommerce and @KansasEmergency to quickly pull together the data that made it possible for Kansas to receive this designation. These loans can be used to help keep Kansas businesses afloat amid the COVID-19 pandemic. Quote Tweet Kansas Department of Commerce @KansasCommerce BREAKING! @SBAgov has approved @GovLauraKelly request to declare all 105 Kansas counties eligible to receive assistance in the form of low-interest federal disaster loans up to $2 million. Read more about the declaration and how to apply at https:// bit.ly/2UcjBR3 . #COVID19", "2020-03-21T19:07:33.000Z": "BREAKING! @SBAgov has approved @GovLauraKelly request to declare all 105 Kansas counties eligible to receive assistance in the form of low-interest federal disaster loans up to $2 million. Read more about the declaration and how to apply at https:// bit.ly/2UcjBR3 . #COVID19", "2020-03-21T19:30:05.000Z": "Small businesses in Kansas can now apply for @SBAgov Disaster Assistance Loans of up to $2 million! These low-interest federal loans have been made available to Kansas small businesses to assist with fixed debt payments, payroll and more. https:// bit.ly/33HSssb  #COVID19", "2020-03-21T18:59:09.000Z": "BREAKING The Small Business Administration has approved Kansas' request for disaster assistance, providing much needed relief to our small businesses. Apply here: https:// disasterloan.sba.gov/ela/", "2020-03-20T21:41:41.000Z": "A message to Kansas workers from Secretary Delía García.\n\nApply for benefits at http:// GetKansasBenefits.gov  https:// facebook.com/14673336871939 2/videos/560516544557057/   #KSDOL  #KSWorks  #COVID19  #InThisTogether A Message to Kansas Workers from Secretary García A message to Kansas workers from Secretary Delía García. Apply for benefits at www.GetKansasBenefits.gov #KSDOL #KSWorks #COVID19 #InThisTogether facebook.com", "2020-03-20T20:55:51.000Z": "\"I am proud of the work these men and women do as citizen-soldiers and airmen - especially in the face of emergencies that threaten Kansans,\" @GovLauraKelly said. @KansasGuard", "2020-03-20T19:24:26.000Z": ". @kms_kansas is providing resources for manufacturers in our state to help get them through the #COVID19 crisis. These resources include information on how the virus spreads and what companies should do to ensure health and safety. https:// bit.ly/2U1wUDz", "2020-03-20T00:25:50.000Z": "Echa un vistazo a nuestros nuevos recursos en Español: http:// kdheks.gov/coronavirus . #TogetherUsAll  #COVID19 Quote Tweet Telemundo Kansas City @TelemundoKC Esta es la actualización más reciente de casos de #COVID19 confirmados en el estado de Kansas. Se registran 34 casos positivos.\n\nvía @KDHE  @ksgovernment  #TuSalud", "2020-03-20T19:02:48.000Z": "As Kansans practice social distancing, we know our restaurants, bars and other event centers will see a decrease in patrons. This morning I announced steps my administration is taking to help mitigate the potential impact of COVID-19 on the Kansas economy. Governor Laura Kelly announces disaster assistance for Kansas businesses and discusses banks,... governor.kansas.gov", "2020-03-20T17:00:07.000Z": "As the COVID-19 crisis continues to develop and reports of bottled water shortages make headlines, the @kswateroffice and @KDHE want to remind Kansans the drinking water provided by our public water supply systems is free of viruses and other pathogens.", "2020-03-20T14:49:35.000Z": ". @GovLauraKelly has established the Hospitality Industry Relief Emergency (HIRE) Fund to provide bridge loans for Kansas' hospitality sector during the COVID-19 crisis. Eligible businesses can apply for up to $20 thousand at 0% interest for 36 months! https:// bit.ly/3bbcxts", "2020-03-20T02:39:59.000Z": "Thank you for your support as we work together to protect the health of all Kansans. Stay up-to-date on the latest #COVID -19 developments by signing up for email updates: https:// bit.ly/3dfTkbW . #TogetherUsAll", "2020-03-19T17:45:00.000Z": "The KSNG is prepared to support state and local agencies responding to CoVid19 in order to protect Kansans. Currently, 15 Soldiers and Airmen are working with partners to provide logistical support.", "2020-03-19T18:39:11.000Z": "The @KDHE website provides up-to-date, valuable information regarding COVID-19, or the novel coronavirus. Please visit http:// kdheks.gov/coronavirus to sign up for daily updates that will go straight to your inbox.", "2020-03-19T17:54:35.000Z": "I would like to thank the Continuous Learning Task Force for its diligent, near-constant work over the past few days. Today the task force released robust, comprehensive guidance for KS school districts that will ensure learning continues for our students. https:// ksde.org/Portals/0/Comm unications/Publications/Continuous%20Learning%20Task%20Force%20Guidance.pdf?ver=2020-03-19-084325-833 ", "2020-03-18T23:55:45.000Z": "There's confusion about #COVID19 testing. We do not test people who are well (asymptomatic). A healthcare provider will evaluate whether or not you meet the criteria & then order testing if needed. In Johnson Co., community transmission = isolation & new testing procedures.", "2020-03-18T22:49:50.000Z": "For the latest updates on #COVID -19 please visit https:// govstatus.egov.com/coronavirus . You can also receive notifications by subscribing to @KDHE 's website so you will always have the latest information.", "2020-03-19T16:07:23.000Z": "I just signed three bipartisan bills that will help Kansans navigate these difficult times. These bills will extend unemployment eligibility, allow for the judicial branch to extend deadlines and help provide flexibility for school districts.", "2020-03-19T15:22:46.000Z": "For more information, latest updates and answers to Frequently Asked Questions about COVID-19, make sure to visit the @KDHE website at https:// govstatus.egov.com/coronavirus .", "2020-03-19T14:24:13.000Z": "ICYMI - I joined @CNNTonight to talk about the measures Kansas is taking to protect our families and communities as we deal with COVID-19. Quote Tweet CNN Tonight @CNNTonight \"We will continue to keep our school buildings essentially shut. But we will start to offer alternative educational opportunities.\" - Kansas Gov. Laura Kelly on ordering the closure of all K-12 schools for the rest of the year in response to the coronavirus pandemic", "2020-03-19T14:05:44.000Z": "For more information about COVID-19, make sure to visit KDHE's website and Frequently Asked Questions at http:// kdheks.gov/coronavirus and http:// cdc.gov/coronavirus", "2020-03-18T21:50:10.000Z": "**UPDATED 3/18/2020**\n\nIf you are not working or working reduced hours due to COVID-19, you may be eligible for Unemployment Insurance (UI) benefits.\n\nApply online at http:// GetKansasBenefits.gov  #KSDOL  #KSWorks  #COVID19", "2020-03-18T21:45:43.000Z": "Last Friday, KDADS leadership presented two #COVID19 Webinars outlining @CMSGov guidance about the virus. Follow these links to watch videos.\n\nNursing Facilities Session: https:// vimeo.com/397531644/7a89 6f247b  Community-Based Session: https:// vimeo.com/397531651/913c 493305 ", "2020-03-18T20:52:15.000Z": "Still confused on gathering size? We made it easy for you. 50 or more is a no go. #coronavirus  #kansas  @kdhe  @CDCgov", "2020-03-18T22:10:24.000Z": "Today's #COVID19 press conference covered several  updates, including new testing procedures due to community spread in Johnson County, KS. Watch the conference on Facebook: https:// facebook.com/142908749923/v ideos/300134447646003/ ", "2020-03-18T18:04:08.000Z": "Secretary Laura Howard today announced that visitation at all four state hospitals has been restricted effective immediately as a measure of precaution to reduce exposure of COVID-19 to residents and staff. https:// bit.ly/3b9nziG", "2020-03-17T20:18:20.000Z": "Know the symptoms of #COVID19 .", "2020-03-18T14:56:09.000Z": "With the high volume of calls KDHE is experiencing, try finding answers on their website first. Visit https:// govstatus.egov.com/coronavirus Quote Tweet KDHE @KDHE We know you have many questions about #COVID19 , and we are experiencing a high volume of inquiries. We have extended the hours of the hotline to include weekends, & we have added a chat bot to the COVID-19 Online Resource Center to address some FAQs: http:// bit.ly/2xPPR3B", "2020-03-18T15:05:17.000Z": "This is why it is important to wash your hands and keep surfaces clean. @KDHE", "2020-03-18T13:33:05.000Z": "For family members who have loved ones within the Kansas Department of Corrections prison system, we have posted information to our website about a number of free phone and video visits while in-person visitation is closed. http:// bit.ly/3dbRBnN", "2020-03-18T02:18:07.000Z": "During these times of uncertainty, rest assured that state agencies are collaborating in new ways to meet the needs of KSans statewide. Take a look at these resources from our friends at the @KansasDOL , and follow them to stay up-to-date on labor-related developments. #COVID19 Quote Tweet Kansas Department of Labor @KansasDOL We recognize the impact of #COVID19 on employers and workers alike. We are here to assist as we tackle this challenge together, and will continue to update this page w/ available resources & contact info as it becomes available. https:// dol.ks.gov/covid19response  #coronavirus  #ksleg", "2020-03-18T00:12:08.000Z": "Once these buildings are thoroughly sanitized, we will look to reopen them for small groups of school personnel to implement a plan for Continuous Learning. Additionally, I am calling on district leaders to prepare for a time when schools may reopen (4/5)", "2020-03-18T00:12:07.000Z": "Today I signed Executive Order #20-07 announcing the closure of our school buildings statewide. We must protect our children and  parents, as well as the educators and staff who work at our schools. https:// governor.kansas.gov/governor-kelly -announces-proactive-measures-to-mitigate-spread-of-covid-19-pandemic-in-kansas/  (1/5) Governor Kelly announces proactive measures to mitigate spread of COVID-19 pandemic in Kansas -... governor.kansas.gov", "2020-03-17T18:18:07.000Z": "Today we mourn the loss of Dr. Julia Marie Scott, daughter of Kansas Senate President @SenatorWagle . My thoughts and condolences are with Senator Wagle and her family during this difficult time.", "2020-03-17T16:29:06.000Z": "In light of the Centers for Disease Control and Prevention's guidance released on Sunday, March 15, 2020, E.O. #20-04 follows the CDC's recommendation to limit group gatherings to no more than 50 individuals in a single area. (2/5)", "2020-03-17T16:29:05.000Z": "I have signed Executive Order #20-04 and Executive Order #20-05 to keep Kansans safe and healthy and to ensure all families are protected during the COVID-19 pandemic. https:// governor.kansas.gov/governor-kelly -outlines-new-executive-orders-to-improve-public-safety-regarding-covid-19-pandemic/  (1/5) Governor Kelly outlines new Executive Orders to improve public safety regarding COVID-19 pandemic -... governor.kansas.gov", "2020-03-17T16:10:03.000Z": "As a result of the #COVID19 pandemic, with public safety as a priority, @KansasWorkforce Centers will be taking actions to reduce contact and maintain social distancing. Centers will remain open, but services will be limited. https:// bit.ly/2IR49mD", "2020-03-17T15:16:36.000Z": "You may have noticed an uptick in sharing posts from our friends at the @KDHE and @GovLauraKelly about Covid-19.\nThat's because we all are in this together, and helping to keep our communities healthy, connected and safe is so important. More info here: http:// bit.ly/2TrC7EC Quote Tweet KDHE @KDHE Have questions about #COVID19 ( #coronavirus disease 2019)? We have answers. Give us a call, email or check the COVID-19 Online Resource Center: http:// bit.ly/2TrC7EC", "2020-03-17T02:05:26.000Z": "Access to KANSASWORKS Workforce Centers will be limited beginning tomorrow due to Covid-19 precautions. We apologize for the inconvenience. For more information, please call (877) 509-6757 to speak with your local Workforce Center. Check back for more information soon.", "2020-03-16T19:58:18.000Z": "COVID-19 (coronavirus) Information for state agencies and employees: https:// admin.ks.gov/coronavirus", "2020-03-16T20:28:51.000Z": "To help Kansans stay current on information related to COVID-19, or the novel coronavirus, @KDHE provides daily updates on its website, http:// kdheks.gov . For the Monday, March 16 update, see below: http:// kdheks.gov/coronavirus/pu blicupdate/COVID-19_March_16_2020.pdf ", "2020-03-16T20:10:04.000Z": ". @KansasEmergency is working to secure @SBAgov Economic Injury Disaster Loan funds to assist #KSbiz . If your business has suffered economic injury as a result of the #COVID_19 disaster, complete and submit the Estimated Disaster Economic Injury Worksheet: https:// bit.ly/2IPInj8", "2020-03-16T19:39:57.000Z": "If you are experiencing these symptoms, please stay home, call your healthcare provider and tell them you may have COVID-19. This gives their office the opportunity to take steps to keep other people from being exposed to the virus, and offer you guidance on what to do next.", "2020-03-16T19:30:09.000Z": "When it comes to #COVID_19 , prevention is key, and simple measures can go a long way. Be sure to take these important steps to help keep #Kansas as healthy as possible. #kshealth", "2020-03-16T17:44:56.000Z": "This morning, the KCC used its emergency powers to issue an order suspending utility disconnects for nonpayment until April 15 to offer relief to those experiencing hardship from the COVID-19 virus. Read the order here: https:// estar.kcc.ks.gov/estar/ViewFile .aspx/20200316105259.pdf?Id=88d5541d-695f-4b27-ae43-2ce44d20a94f ", "2020-03-16T16:58:39.000Z": "The @KDHE website, http:// kdheks.gov , offers a variety of information for Kansans seeking guidance during the COVID-19 pandemic. This includes information for individuals and families, healthcare providers, law enforcement, businesses and more.", "2020-03-16T16:37:59.000Z": "When classes resume, parents can be assured their children will continue to receive the same high-quality, world-class education Kansas is known for. (4/4)", "2020-03-16T15:07:12.000Z": "ICYMI: Last night I announced my recommendation to close all public schools for the upcoming week to allow administrators and teachers to develop a strategic plan moving forward. https:// governor.kansas.gov/governor-kelly -recommends-the-kansas-state-department-of-education-temporarily-close-schools-to-implement-comprehensive-education-plan-amidst-covid-19-pandemic/  (1/4) Governor Kelly Recommends the Kansas State Department of Education Temporarily Close Schools to... governor.kansas.gov", "2020-03-16T00:35:31.000Z": "We've been getting many questions about school closings in relation to #COVID19 . Here's the latest update from our friends @ksdehq . Give them a follow to stay up-to-date with education-related developments. Quote Tweet KS Dept of Education @ksdehq As of Sun, March 15, Kansas Education Commissioner Dr. Randy Watson strongly recommends that those schools currently coming off of spring break, suspend operations for the week March 16-20.  All schools scheduled for spring break the week of March 16-20 will continue as planned. Show this thread", "2020-03-15T21:45:17.000Z": "Important new information on recommendations for travelers, close contacts and those being tested for COVID-19. https:// khap2.kdhe.state.ks.us/NewsRelease/PD Fs/3-15-20%20Quarantine%20recommendations%20FINAL.pdf ", "2020-03-14T20:45:54.000Z": "¿Tiene preguntas sobre COVID-19? Eche un vistazo a estos recursos de los @CDCgov : https:// cdc.gov/coronavirus/20 19-ncov/faq-sp.html ", "2020-03-15T00:42:42.000Z": "Unsung heroes of public health. Coronavirus lab samples don't run themselves. These people do. 16 hours per day per person. Coronaviruses don't fall onto a swab. People mask and gown up to gather samples. Day/night. Putting themselves at risk. I am grateful for their devotion.", "2020-03-14T20:17:33.000Z": "Conócelo. Prepárate. Actúa. @KDHE", "2020-03-14T20:16:57.000Z": "Be Aware. Prepare. Act. @KDHE", "2020-03-14T15:10:27.000Z": "Conozca la diferencia: Observación de su propia persona, Aislamiento; Cuarentena", "2020-03-14T15:02:25.000Z": "Know the Difference:  Self-monitoring, Isolation, Quarantine", "2020-03-13T20:15:25.000Z": "We recognize the impact of #COVID19 on employers and workers alike. We are here to assist as we tackle this challenge together, and will continue to update this page w/ available resources & contact info as it becomes available. https:// dol.ks.gov/covid19response  #coronavirus  #ksleg", "2020-03-13T20:12:16.000Z": "KDOL's COVID-19 Response web page can be found at http:// dol.ks.gov/covid19response This afternoon, Kansas Secretary of Labor Delía García released the KDOL COVID-19 Response web page with resources available for employers and workers affected by COVID-19. http:// bit.ly/3aP3lKY", "2020-03-13T19:11:54.000Z": "Currently, the best defense against COVID-19, or the novel coronavirus, is practicing good hygiene. We also encourage Kansans to avoid large crowds and exercise social distancing. Please visit the @KDHE website for more information at http:// kdheks.gov .", "2020-03-13T17:04:50.000Z": "If you feel like you need medical attention, please contact your health care provider. KDHE cannot provide medical evaluation. If you have questions regarding #COVID19 , call the phone bank at 866-534-3463, from 8 am - 5 pm Mon - Fri, or email covid-19@ks.gov.", "2020-03-13T16:14:18.000Z": "The health and safety of all Kansans is our highest priority. For information regarding COVID-19, please go to the @KDHE website, http:// kdheks.gov , follow KDHE social media accounts or use the contact below.", "2020-03-13T14:18:16.000Z": "Stay up to date on everything related to COVID-19, or the novel coronavirus, on @KDHE 's website: http:// kdheks.gov", "2020-03-13T00:38:12.000Z": "If you have symptoms such as fever, cough or shortness of breath and believe you may have had contact or have had contact with someone with a laboratory confirmed case of COVID-19, stay home and call your healthcare provider. (6/7)", "2020-03-13T00:38:11.000Z": "The Kansas Department of Health and Environment @KDHE also announced the first COVID-19 related death in Kansas. (3/7)", "2020-03-13T00:38:10.000Z": "Tonight I announced I have issued an emergency declaration for the State of Kansas in response to COVID-19. https:// governor.kansas.gov/governor-issue s-emergency-declaration-for-covid-19/  (1/7) Governor Issues Emergency Declaration for COVID-19 - Governor of the State of Kansas governor.kansas.gov", "2020-03-12T20:30:51.000Z": "Kansas is home to the Air Capital of the World, and the aviation industry is so important to our state's economy. It was great to have so many manufacturers, suppliers and aviation organizations here showcasing all Kansas has to offer. #AviationDay  #ksleg  @KDOTAviation", "2020-03-12T19:12:10.000Z": "KDHE has learned there are spam text messages being sent to Kansans announcing confirmed cases of COVID-19 at different hospitals. These are not true. For current case counts, please visit http:// kdheks.gov/coronavirus .  Kansas has four presumptive positive cases and 74 negative.", "2020-03-12T18:21:30.000Z": "I urge Kansans to be on the lookout for a letter from the U.S. Census Bureau calling for a response to the #2020Census . Mailings should arrive in the next week. Please make sure you & your community are counted by submitting responses by phone, online or by mail. #KansasCounts", "2020-03-12T14:28:52.000Z": "Have questions about traveling? Check out these guidelines, but remember #COVID19 is an evolving issue. Check @CDCgov 's travel advisory information for regular updates: http:// bit.ly/32SJUhP", "2020-03-11T22:01:36.000Z": "To help Kansans stay current on information related to COVID-19, or the novel coronavirus, @KDHE provides daily updates on its website, http:// kdheks.gov . For details, see below: http:// kdheks.gov/coronavirus/pu blicupdate/COVID-19_March_11_2020.pdf ", "2020-03-11T17:36:32.000Z": "Thank you to the Kansas Commission for the Deaf and Hard of Hearing for your continued advocacy on behalf of Kansans with disabilities. Accessibility is an integral part of ensuring that everyone has equal access to spaces and information. #ksleg", "2020-03-11T19:00:00.000Z": "Residents can take the census in three ways: online, by phone or by mail. If you miss these opportunities, you may get a visit from an enumerator, learn more about their visits at http:// KansasCounts.org . #KansasCounts  #2020Census", "2020-03-11T19:04:10.000Z": "It was good to join several Johnson County chamber leadership programs at State Leadership Day this afternoon to discuss the ways we're working to build communities across KS. Government must work as a partner to foster workforce development and make other positive steps forward.", "2020-03-11T16:55:56.000Z": "Today I spoke with Hispanic & Latino Kansans from across the state at the KS Hispanic and Latino American Affairs Commission's annual Hispanic Day at the Capitol. We talked about the importance of participating in the #2020Census & our state's need for a more inclusive society.", "2020-03-11T15:54:19.000Z": "Appointing Supreme Court justices is one of the most important responsibilities of the Governor. Today I was proud to appoint K.J. Wall to the Kansas Supreme Court. His experience, temperament & dedication to public service will make him an excellent addition to the high court.", "2020-03-10T14:30:12.000Z": "95% or about 143 million households in the U.S. will receive an initial invitation to respond to the #2020Census in their mailboxes between March 12 and 20. Households are encouraged to respond when they receive their invitation. Learn more: https:// KansasCounts.org  #KansasCounts", "2020-03-10T20:23:33.000Z": "I joined @TextronAviation & @wsutech today to celebrate the announcement of their new, first-of-its-kind apprenticeship program. Students will receive hands-on experience and educational opportunities in production tooling, which will transfer to a full-time position.", "2020-03-10T19:21:24.000Z": "I would like to thank officials with Wichita's @TextronAviation for inviting me to tour their facility today. Textron's innovative, state-of-the-art technology makes the company a force in helping Wichita maintain its reputation as the Air Capital of the World.", "2020-03-10T18:01:06.000Z": "Today I stopped by the monthly meeting of the Wichita Bar Association to discuss why KS lawyers must remain vigilant in the fight to preserve & defend public faith in the judiciary. I also reiterated my commitment to returning accountability & transparency to state government.", "2020-03-10T16:47:53.000Z": "By partnering with business leaders around the state to train and equip incarcerated people with in-demand skills, we can help those businesses find the workers they need, while also helping people who are released land stable, good-paying jobs. Governor Kelly partners with national organizations to assess criminal justice reform - Governor of... governor.kansas.gov", "2020-03-10T15:40:53.000Z": "When we work in #partnership with other groups to address important community needs, everyone wins. With a grant from KDOC Juvenile Services, the SW KS Regional Juvenile Detention Center remodeled unused space into an emergency children's shelter. http:// bit.ly/387ed5p", "2020-03-10T15:48:02.000Z": "@SecNorman says it best. \"You own your own preparedness.\" Keep yourself & your community healthy by: Washing your hands. Avoiding touching your face. Covering sneezes & coughs. STAYING HOME if you are sick! #KansasFightsFlu  #PreventTheSpread  #COVID19  #Coronavirus", "2020-03-10T13:33:06.000Z": "#COVID19 Frequently Asked Question: Testing. Why don't we test everyone for COVID-19? Answer: Individuals showing no symptoms likely won't test positive. Visit the COVID-19 Online Resource Center for more FAQs, resources & updates: http:// bit.ly/2TrC7EC", "2020-03-09T20:59:26.000Z": "An estimated 5.3 Americans currently are living with brain injury-related disabilities. To raise awareness of the importance of research, treatment and support for those living with a brain injury, I signed a proclamation marking March as #BrainInjuryAwareness Month in Kansas.", "2020-03-09T19:46:20.000Z": "Information regarding the novel coronavirus, COVID-19, can change rapidly. I encourage all Kansans to visit the @KDHE website at http:// kdheks.gov to stay informed. Officials say not to panic after coronavirus is confirmed in Kansas and Missouri \"The risk to residents remains low,\" said a Johnson County health official. kansascity.com", "2020-03-09T19:00:00.000Z": "2020 marks the 24th decennial since 1790! The census is not only our civic duty, it is in the U.S. Constitution as the duty of the Federal Government. Learn how your participation makes a difference in Kansas. Visit http:// KansasCounts.org . #KansasCounts  #2020Census", "2020-03-08T14:39:50.000Z": "Trailblazing Kansas women have shattered barriers and made innumerable contributions to our state, nation & world. We stand on their shoulders. Today on #InternationalWomensDay and during #WomensHistoryMonth , let's celebrate their achievements by sharing their important stories.", "2020-03-08T00:02:57.000Z": "I urge all Kansans to stay current on the virus, our response, ways to stay safe and healthy, and other useful information available @KDHE 's website: http:// kdheks.gov (5/5)", "2020-03-08T00:02:56.000Z": "We learned today that Kansas has its first presumptive positive case of COVID-19. As I have said previously, our state is well prepared. (1/5) Presumptive-Positive COVID-19 Case Identified in Kansas - Governor of the State of Kansas governor.kansas.gov", "2020-03-07T19:33:35.000Z": "It was good to meet @RAEtheReporter of @41actionnews and Christal Watson, executive director of @kckschools Foundation for Excellence, at the Rae Daniel #YesSheCan ! conference this morning. Just two more examples of Kansas women whose leadership & talent make our state stronger.", "2020-03-07T18:26:46.000Z": "This morning I joined a great group of motivated Kansas women at the Rae Daniel Yes She Can! Conference. I discussed the important role women have played in creating change in Kansas, and explained why their engagement matters to their communities and to other women. #yesshecan", "2020-03-06T19:40:40.000Z": "Despite international challenges which caused U.S. trade to decline in 2019, last year saw an INCREASE in #exports for Kansas! $11.6 BILLION in exports were shipped from the #SunflowerState to destinations all over the world in 2019. #kansasgrowth  https:// bit.ly/2PQrGYL", "2020-03-06T22:11:04.000Z": "International Women's Day is still two days away, but we're so excited to show off women leading Kansas we just couldn't wait! Happy Women's Month and #IWD2020  #EachforEqual to all the amazing women out there! #WomensHistoryMonth", "2020-03-06T21:26:07.000Z": "Prairie burning season is a spectacular sight & a needed technique to manage the tallgrass prairie; however, smoke can affect air quality. Learn how to protect your health if smoke is present in your community: http:// bit.ly/2x9gzUn .", "2020-03-06T21:34:37.000Z": "On #EmployeeAppreciationDay , I want to express my gratitude to all state employees across Kansas. No matter where you live, which agency you work for or your job title, please know I see you and I appreciate your efforts every day.", "2020-03-06T19:25:33.000Z": "The health & safety of every Kansan is our top priority and we are utilizing every tool at our disposal to continue monitoring the situation surrounding COVID-19, also known as the coronavirus, & ensure that we're ready to respond should that be necessary. Kansas can now test for coronavirus in hours. Results used to take days The coronavirus will eventually come to Kansas, officials warned Wednesday, but the state can now test patients in a matter of hours. kansas.com", "2020-03-06T17:31:03.000Z": "Today Secretary Lorenz joined State Rep. Shannon Francis and @LiberalChamber CEO Rozelle Webb at the U.S. 54 delayed T-WORKS groundbreaking ceremony. \n\"We need a transportation system that's modernized to support larger equipment and increased truck traffic,\" said Sec. Lorenz.", "2020-03-06T16:32:15.000Z": "Yesterday, the Kansas Senate unanimously voted to confirm General David A. Weishaar to become the state's next Adjutant General. I have absolutely no doubt General Weishaar will perform his duties with steadfast leadership and integrity. Senate confirms David A. Weishaar as Adjutant General - Governor of the State of Kansas governor.kansas.gov", "2020-03-06T15:17:59.000Z": "We've been getting a lot of questions about masks and gloves. Are they recommended to prevent #COVID19 ? #ksleg", "2020-03-05T22:58:53.000Z": "I offer my sincerest congratulations to those who received recognition at this afternoon's @sbdckansas Small Business Awards ceremony. Kansas entrepreneurs are a vibrant, creative energy, and play a vital role in creating jobs and growing our economy.", "2020-03-05T19:45:35.000Z": "One of my first priorities as governor was to bring on board qualified individuals who are passionate about helping Kansans. I'm glad to have Audé Negrete, executive director of the Kansas Hispanic and Latino American Affairs Commission, on my team. WOMEN'S History Month: Negrete discusses why politics and civic engagement matter - Dos Mundos... By Angie Baldelomar A passion for helping the community and creating change led Aude Negrete to a career in politics. Born in Mexico City, Negrete moved to Overland Park, Kansas, when she was 14. She... dosmundos.com", "2020-03-05T16:55:41.000Z": "On this week's Kansan to Kansan, I discuss why I submitted an ERO to move the energy office out of the Kansas Corporation Commission, and reiterate my commitment to unlocking the potential of Kansas' diverse energy landscape. https:// youtu.be/NJX1KfgiSxI via @YouTube Kansan to Kansan: Energy Office ERO On this week's Kansan to Kansan, I discuss why I submitted an executive reorganization order to move the energy office out of the Kansas Corporation Commissi... youtube.com", "2020-03-04T22:06:53.000Z": "Today I joined @SecNorman & KS Adjutant General Lee Tafanelli to address growing concern over coronavirus & review what we're doing to protect Kansans from the spread of the disease. Please visit http:// kdhe.ks.gov for up-to-date information on the virus & ways to stay safe.", "2020-03-04T22:03:49.000Z": "Scenes from today's press conference with ... @GovLauraKelly  & ... @KansasEmergency . Watch the conference on Gov. Kelly's Facebook page to learn more about statewide #preparedness efforts for #COVID19 .", "2020-03-04T17:19:41.000Z": "For the next decade, the results of the #2020Census will help determine federal funding for healthcare, schools, transportation and other services. That's why I signed a proclamation emphasizing our commitment to counting every Kansan. We urge you to participate. #KansasCounts", "2020-03-03T23:42:26.000Z": "KDHE Announces COVID-19 Online Resource Center. https:// khap2.kdhe.state.ks.us/NewsRelease/PD Fs/3-3-20%20%20Misinformation%20FINAL.pdf ", "2020-03-03T19:16:53.000Z": "In Kansas, severe weather can happen at any time - so preparedness is critical. To raise awareness of the seriousness of this issue and drive home the importance of having a severe weather safety plan, I signed a proclamation marking March 2 - 6 #SevereWeatherAwarenessWeek in KS.", "2020-03-03T16:40:59.000Z": "Did you know KS averages 61 tornadoes each year? Do you know the difference b/w a watch & a warning? Make sure you know what to do if severe weather strikes. Make a plan & practice it, build an emergency kit & stay informed. #kswx  #BePreparedNotScared  #SevereWeatherAwarenessWeek", "2020-03-03T16:11:58.000Z": "@SecNorman answers frequently asked questions regarding #COVID19 (2019 Novel Coronavirus). This is part one in a series. Find FAQs, information and resources on our website: http:// kdheks.gov/coronavirus/in  Quote Tweet Lee Norman @SecNorman Answers to some of the most frequently asked questions regarding COVID-19 (2019 Novel Coronavirus) -- part one in a series. Find FAQs and the latest #COVID19 information and resources on the @KDHE website: http:// kdheks.gov/coronavirus/in dex.htm ", "2020-03-02T18:01:02.000Z": "The #2020Census is fast approaching with Census Day on April 1st. Learn why counting everyone is crucial for the future of Kansas. Visit http:// KansasCounts.org  #KansasCounts  #2020Census", "2020-03-02T23:22:57.000Z": "We're working hard to get this to the finish line. It makes a difference when Medicaid expansion advocates help others understand our morally & fiscally responsible plan. I urge Kansans to contact their legislators & let them know we must #ExpandMedicaid . Kelly, appearing with Denning, slams 'immoral' blockade of Kansas Medicaid expansion Medicaid supporters say they are one vote short of getting the bill to the Senate floor. kansas.com", "2020-03-02T21:43:08.000Z": "The State's Feb. total tax collections came in at $448.3 million; $63.6 million more than estimated. These collections are $66.4 million or 17.4% more than Feb. of FY 19. Click the link for more: http:// bit.ly/FEB2020Receipts  #ksleg", "2020-03-02T20:31:39.000Z": "When we encourage the children in our lives to read, we give them the tools they need to succeed now and into the future. To celebrate National #ReadAcrossAmericaDay , I encourage everyone to pick up a book, visit the library or find other ways to promote reading for Kansas kids.", "2020-03-02T19:08:52.000Z": "Following the roundtable with hospital administrators, we spoke with faith leaders regarding access to affordable health care in Kansas. I'm grateful for the opportunity to deepen the understanding of the potential impact Medicaid expansion could have on faith communities.", "2020-03-02T18:58:27.000Z": "The @MainStreetKS Program has a fresh, new look! When it comes to revitalizing small towns and rural communities across our state, #KansasMainStreet is hard-at-work. If you haven't seen what the program is all about yet, come check it out! #WeAreMainStreet  https:// bit.ly/39jBCC6", "2020-03-02T17:52:02.000Z": "Today I'm in Wichita with @JimDenning4KS to discuss the far-reaching benefits of expanding Medicaid in Kansas. We started at @ViaChristi St. Francis with hospital administrators and discussed how expansion will strengthen hospitals in urban and rural communities across the state.", "2020-03-02T17:18:00.000Z": "Are you prepared if severe weather hits? This week is Severe Weather Awareness Week. Take time this week to review severe weather safety plans for your home, farm, ranch or business. For more tips on agricultural related emergencies visit: http:// bit.ly/2TqjX4F", "2020-02-29T15:43:27.000Z": "On this week's Kansan to Kansan, I discuss my executive reorganization order that would create the Kansas Department of Human Services, and address how this new agency would help us better serve our children and families. https:// youtu.be/eSsrPlEJ2U4 via @YouTube Kansan to Kansan: Kansas Department of Human Services Executive... On this week's Kansan to Kansan, I discuss my executive reorganization order that would create the Kansas Department of Human Services, and address how this ... youtube.com", "2020-02-29T03:33:05.000Z": "With recent, widespread media coverage surrounding COVID-19 - commonly known as the coronavirus - it's important to share what we are doing here at home to protect Kansans' health and well-being. Please watch this video to learn more about our efforts.", "2020-02-28T21:54:14.000Z": "We had a Fabulous February! We welcomed the first loaded train to the Great Plains Industrial Park in 40 yrs and broke ground on the U.S. 169 T-WORKS project in Anderson Co. We are excited to move #FORWARDKS and celebrate projects that will benefit KS now and into the future.", "2020-02-28T18:55:00.000Z": "Throughout the week, educators & students across KS have been celebrating the critical role our public schools play in making sure students can reach their full potential. In a fitting end to the celebration, I signed a proclamation today recognizing #PublicSchoolsWeek in Kansas.", "2020-02-28T14:59:13.000Z": "The Governor's Council on Tax Reform is set to begin at 9 this morning. Listen here: http:// sg001-harmony.sliq.net/00287/Harmony/ en/PowerBrowser/PowerBrowserV2/20200228/-1/9196   #ksleg", "2020-02-27T20:54:05.000Z": "We took a tour of The Birth Place at @OlatheHealth . This facility provides the best care to mothers at each stage of pregnancy. Expansion would allow them offer additional health and wellness services through KanCare, lowering healthcare spending and taxpayer burden. #ksleg", "2020-02-27T19:40:54.000Z": "This afternoon I stopped to chat with 5th graders from Horizon Elementary in DeSoto who were touring the Statehouse. One student even asked me about Medicaid expansion, and I was glad to tell the entire group how expansion would help keep many Kansans and their families healthy.", "2020-02-27T17:01:00.000Z": "\"The sky's the limit. If I can learn this, then I can learn anything if I set my mind on it and stay focused on it.\" http:// bit.ly/TCFcoding - Brittany, TCF computer programming and coding graduate #secondchances", "2020-02-27T16:27:23.000Z": "The Court of Appeals Nominating Commission announced its three nominees to fill the vacancy created by the upcoming retirement of Judge G. Joseph Pierron Jr. I will appoint one nominee before the end of the 2020 Legislative session. Learn more: Court of Appeals Nominating Commission announces three nominees for Court of Appeals vacancy -... governor.kansas.gov", "2020-02-27T13:36:01.000Z": "The Blueprint for Early Childhood is our state's strategic framework for ensuring every child thrives. It guides decision making system-wide & locally so that every provider & parent can rely on a network of support. Learn more: https:// bit.ly/2uCwutj . #allinforKansasKids", "2020-02-26T18:12:39.000Z": "I drove to Leonardville this morning to meet with small-town entrepreneurs and community business leaders. I shared what the #KansasORP and state agencies are doing to help them on the road to prosperity. #ksleg", "2020-02-26T21:31:44.000Z": "State Transportation Engineer Burt Morey met with the MO/KS Chapter of the American Concrete Pavement Assoc. He told the group that KDOT is committed to finishing the remaining T-WORKS projects, working with our industry partners & moving #FORWARDKS to meet transportation needs.", "2020-02-26T16:17:35.000Z": "DYK census data is used to determine how many seats the state of KS gets in the U.S. House of Representatives? It also is used to adapt to changes in population for state legislative, city government & school districts. It's just as important as voting! #KansasCounts  #2020Census", "2020-02-26T15:09:51.000Z": "Oscar Micheaux, born in 1884, was a trailblazing black novelist & filmmaker. His book \"The Case of Mrs. Wingate\" was the first best-selling novel by a black author. Though not from KS, he chose to be buried in Great Bend, which he claimed as an adopted home. #BlackHistoryMonth", "2020-02-25T18:13:55.000Z": "\"This is the first program that I did (while incarcerated) that gave me the opportunity to think about where I would be in the future as far as a career and as a mother that provides for her children.\" - Tiplance, TCF computer programming/coding graduate http:// bit.ly/TCFcoding", "2020-02-25T15:44:49.000Z": "During National #PublicSchoolsWeek , it is important to highlight the hard work and dedication of Kansas educators. This includes Winfield's Tabatha Rosproy, who is in the running for National Teacher of the Year. Congratulations, Tabatha! We are rooting for you here at home. Quote Tweet Tabatha @TabathaRosproy Off to DC for my interview for National Teacher of the Year! As my good friend @2020MontanaTOY says, we go \"on the shoulders of giants.\"  #NTOY20", "2020-02-25T14:57:47.000Z": "From @NCKansasKDOT The Kansas Department of Transportation has closed westbound I-70 at Salina due to crashes blocking the roadway. \n\nFor up-to-date information on road closures and road conditions, visit http:// kandrive.org , or call 511 in Kansas or 866-511-5368 outside KS.", "2020-02-24T21:45:22.000Z": "Today we mourn the loss of Katherine Johnson, a brilliant mathematician and inspiration for women and people of color. Her work, which was instrumental to the success of several NASA space missions, went largely unrecognized for years. #BlackHistoryMonth  https:// kansascity.com/news/nation-wo rld/national/article240582836.html ", "2020-02-24T18:17:23.000Z": "Today begins National #PublicSchoolsWeek in Kansas & the U.S. Our state's public schools give Kansas kids the knowledge & tools they need to succeed. As the \"education governor,\" I'm always proud to advocate for and celebrate our schools, educators & students. #PublicSchoolProud", "2020-02-24T15:30:36.000Z": "\" @KDOTHQ Secretary Julie Lorenz and @SecretaryToland visited southeast Kansas Thursday for a ribbon cutting and ceremonial throwing of a switch to mark the arrival of the first loaded train cars at the Great Plains Industrial Park in more than 40 years.\" https:// kiowacountysignal.com/news/20200222/ officials-celebrate-industrial-park-partnership ", "2020-02-21T22:55:05.000Z": "We had a special guest in my ceremonial office this morning. Abigail and her family were at the Capitol for a tour and look at our amazing murals and statues. You're never too young to check out our beautiful Statehouse, and take a seat in the Governor's chair.", "2020-02-21T19:48:29.000Z": "Following the Civil War, thousands of former slaves left southern states looking for new roots - and many built communities in Kansas. Nicodemus, in Graham County, is the only remaining western town established by black Americans during the Reconstruction Era. #BlackHistoryMonth", "2020-02-21T17:45:04.000Z": "#Education and #ecodevo go hand-in-hand. The importance of public-private partnerships in creating opportunity for work-based learning, certificate & apprenticeship programs and workforce reentry can't be understated. Proud to be part of this initiative! Governor's Council on Education gathers for first meeting of 2020 - Governor of the State of Kansas governor.kansas.gov", "2020-02-21T16:23:31.000Z": "The Governor's Council on Education met Thursday for its first meeting of the year. In December, the Council presented @GovLauraKelly with policy recommendations aimed at improving our state's educational systems. Check out the link for more information: Governor's Council on Education gathers for first meeting of 2020 - Governor of the State of Kansas governor.kansas.gov", "2020-02-21T16:10:14.000Z": "Over the next weeks we will be featuring a year-end review with the KWO. This week we are covering Reservoir Water Supply & Sediment Management​ and today featuring Watershed Conservation Practice Implementation, which continues to be a key component in the reduction of sediment.", "2020-02-21T16:00:44.000Z": "Are you a non-profit looking for ways to serve your community? Applications are being accepted to administer the Individual Development Account Program (IDA)! IDA helps Kansans overcome financial barriers to make major life investments. Apply today! https:// bit.ly/2PbadtX", "2020-02-21T15:22:26.000Z": "Thank you @LtGovRogers for dropping by @LibraryofKS . \"Survival of Rural America\" was a 2009 #KSNotableBooks . More great books will be announced in June. Quote Tweet Lt. Governor Lynn Rogers @LtGovRogers I was in the Kansas Statehouse library looking for good books. Did you know we have one of the best Statehouse libraries in the country? Also, any recommendations? I checked out \"Survival of Rural America\" by Richard E. Wood. @LibraryofKS", "2020-02-20T19:31:40.000Z": "It was an honor to accept the Paul Harris Award from @toprotary this afternoon. The Rotary's focus on \"putting service above self\" is a guiding principle of mine, and an inspiration as I work to improve the lives of people across Kansas.", "2020-02-20T16:28:30.000Z": "Today I spoke to @topeka_links , @WichitaLinks and the Greater Kansas City chapter of Links, Inc., about the crucial role expanding Medicaid will have in building healthier communities across our state - and address racial disparities in access to health care. #ksleg", "2020-02-20T15:57:37.000Z": "The First Kansas Colored Infantry, which began to form in 1862, was the first black regiment recruited in the northern states for service in the Civil War. The unit's regimental flag, pictured below, is a document of its gallantry, with a record of many battle honors. #BHM", "2020-02-19T19:29:03.000Z": "Access to quality, affordable mental health care in Kansas is absolutely critical. Thank you to all who came to the Statehouse today as part of Mental Health Advocacy Day. Your experiences help shape policy that will benefit Kansans for years to come.", "2020-02-19T17:00:48.000Z": "The @FCC has authorized more than $240 million in funding to expand rural broadband deployment! Kansas is among the states receiving funding. #Broadband access is vital for #rural economic and community development. https:// bit.ly/2vNBagd  @ajitpai  @AjitPaiFCC", "2020-02-19T16:20:59.000Z": "I was proud to stand alongside hundreds of \"mothers and others\" with @MomsDemand this morning to honor victims and survivors of gun violence in Kansas. Moms Demand Action's courageous and tireless call for gun sense is saving lives.", "2020-02-18T17:31:33.000Z": "The #FourStateFarmShow is coming to @pittstate ! The show draws thousands of visitors from all across the region. Previously only outdoors, the new venue means space for 400+ indoor exhibits. This is big for our state's #agriculture sector and a win for all of KS! #GrowAg", "2020-02-18T16:24:36.000Z": "Hattie McDaniel, born in Wichita in 1895, was the first black woman to win an Oscar for her role as Mammy in the 1939 film \"Gone With the Wind.\" In receiving her Oscar, she also was the first black person to attend an Academy Awards ceremony. #BlackHistoryMonth", "2020-02-18T12:36:14.000Z": "Mid-February, and Influenza is still peaking. Not a good sign. Do not let the (occasional) good weather fool you. We are in what appears to be the worst part of the flu season. Wash hands, cover coughs, vaccinate, and stay home when ill.", "2020-02-18T03:04:56.000Z": "", "2020-02-17T22:31:38.000Z": "Congratulations to Secretary DeAngela Burns-Wallace, @KSDofA , on your swearing in today. I know you will continue serving in this position with poise and diligence. #ksleg", "2020-02-17T22:37:00.000Z": "This afternoon we marked the swearing in of @KSDofA , Secretary of the Kansas Department of Administration and Chief Information Technology Officer. Secretary Burns-Wallace's long history of professionalism and accomplishments made her an ideal choice for these critical positions.", "2020-02-17T21:05:45.000Z": "In this week's Kansan to Kansan, we recognize #BlackHistoryMonth by reflecting on the many, far-reaching accomplishments and contributions of black Kansans. https:// facebook.com/GovLauraKelly/ videos/1950103448467764/ ", "2020-02-17T17:18:23.000Z": "My favorite Eisenhower quote hangs in the entrance of the Capitol building to greet legislators and visitors alike. It is a thoughtful reminder to always consider what is best for our state. #PresidentsDay", "2020-02-17T16:44:49.000Z": "KS school bus drivers take their jobs very seriously. Transporting children - our most precious cargo - is a big responsibility. That's why I stood alongside school bus drivers today to advocate for a bill allowing them to qualify for unemployment benefits during summer months.", "2020-02-14T23:01:20.000Z": "Congratulations to Specialist Jonathon P. Gallegos, this year's Kansas Army National Guard Best Warrior Soldier; SGT Luke Fursman, Best Warrior NCO; & Airman first Class Lilliana Rebollar, National Guard Airman of the Year. You epitomize all that's outstanding in KS armed forces.", "2020-02-14T21:11:27.000Z": "One hundred years ago today, the League of Women Voters was founded by leaders of the women's suffrage movement. I am truly inspired by the determination, strength and courage of those who fought for women to have a voice. Let's honor that legacy by making our voices heard.", "2020-02-14T19:40:26.000Z": "Langston Hughes, famous black poet and author, spent most of his childhood in Lawrence, Topeka and Kansas City. Hughes dedicated his life to advocating for social equality and justice through his poetry, plays, short stories and novels. #BlackHistoryMonth", "2020-02-14T14:30:15.000Z": "Happy #ValentinesDay to the state we love.     #WeLoveKansas  #AdAStraPerAspera  #KansasGrowth", "2020-02-13T22:05:04.000Z": ". @SecretaryToland announced today the award of more than $17 million in Community Development Block Grants ( #CDBG ) to 39 communities. These grants will ensure vital improvements for wastewater systems, streets, housing and more in #rural Kansas towns. https:// bit.ly/2vrZZ1p", "2020-02-13T20:41:40.000Z": "Celebrated Community Development Block Grant recipients from across the state today. This round of CDBG invests in infrastructure improvements for local communities. #KansasORP & @KansasCommerce are working together so tools like CDBG can help meet rural Kansas needs. Quote Tweet Secretary David Toland @SecretaryToland Had a great time joining @LtGovRogers and community leaders from all over Kansas at the #CDBG Awards Reception today. @KansasCommerce is awarding 39 communities more than $17 million in Community Development Block Grants. Quality of life is key to #economicdevelopment !", "2020-02-13T20:30:20.000Z": "Had a great time joining @LtGovRogers and community leaders from all over Kansas at the #CDBG Awards Reception today. @KansasCommerce is awarding 39 communities more than $17 million in Community Development Block Grants. Quality of life is key to #economicdevelopment !", "2020-02-13T19:48:04.000Z": "I am impressed by the continued, all-hands-on-deck state and local response effort to help those affected by recent layoffs in Kansas' aviation sector. This afternoon I received a progress update from @KansasDOL Secretary Delia Garcia, @BWhippleKS & other response team members.", "2020-02-13T19:15:36.000Z": "Thank you to @Groover_Labs for hosting our Air Capital Commitment Roundtable w/ Sec. García, @GovLauraKelly and #Wichita Mayor @BWhippleKS . A perfect opportunity to hear from local leaders & agencies. @workforcecenter  @Greater_Wichita  @PeteMeitzner  @speea  @ChamberWichita", "2020-02-13T18:44:13.000Z": "This morning I toured Wichita's Workforce Center before stopping by @REAPofSCK . Thank you to all of the Kansas job seekers and business owners who shared their triumphs and concerns. Maintaining a strong workforce is crucial to fostering growth and prosperity in Kansas.", "2020-02-13T18:10:29.000Z": "@GovLauraKelly and Sec. García met with Union leaders in #Wichita today to discuss concerns and the future for aviation workers in the area. #aircapitaloftheworld  #ksleg  @SEIU Local 513 @speea  @IBEW Local 271 @MachinistsUnion Local 839 @MachinistsUnion District 70", "2020-02-13T16:48:16.000Z": "I was happy to welcome my fellow Kansans to Black Legislative Day at the Capitol! Black Legislative Day is an opportunity to network with legislators and learn about what's going on this session. This is the people's house and a place for all voices to be heard. #ksleg", "2020-02-12T20:05:20.000Z": "Joined @GovLauraKelly at the @LawrenceChamber for their roundtable meeting to discuss higher ed and its vital role in #ecodevo . Our state's Universities are some of the best in the land. Of particular note: retention of our educated young people is key to the future of KS.", "2020-02-12T20:19:00.000Z": "Kansas receives over $6 billion from the 55 largest federally funded programs each year. Your census participation determines funding for these programs. Make Kansas Count. Learn more now at http:// kansascounts.org ! #KansasCounts  #2020Census", "2020-02-12T21:16:32.000Z": "The innovative partnership between @LawrenceChamber and @UnivOfKansas is instrumental in promoting economic prosperity in and around Lawrence. Thank you for inviting @SecretaryToland and me to talk about our strategies for fueling economic success in the region and across KS.", "2020-02-12T19:43:00.000Z": "Kansas receives over $6 billion from the 55 largest federally funded programs each year. Your census participation determines funding for these programs. Make Kansas Count. Learn more now at http:// kansascounts.org ! #KansasCounts  #2020Census", "2020-02-12T19:06:00.000Z": "In this week's Kansan to Kansan, I discuss the details of FORWARD, our proposed statewide transportation plan. Through FORWARD, we will deliver on projects and services good for Kansas now and into the future. https:// facebook.com/GovLauraKelly/ videos/586866402169963/?xts[0]=68.ARDqvs-QgI0UUrvlVBjcndJ1k_y6ReSJJ5NfMdkWz39ZdrNCVrsvTviNc93Nb5HpyHvh5xU8chy9MiTG_uSB7C8snpj0J8T9WQgpvj6F8pgYGDcsYu23p8V1_i9bWL2joufs48-dyLcWPXVBiOORdwZiCPFjvwJip1tz6I9AaL5h3uenc7q_-Js7DvjIthW9aCZmH6Hv6k_KgOcQ7ZejTeN_Szj3lEo9k0_TF_OMjzzpmFjmSngHwCG-J7lZtcC8FT9Xy8G6_TihYw_crvazUsMA-sdU2ZJDgJNw6rEOfwbcf0UxWHCMD4IzW3r4r9gGkj0t9xXvqAey9NHQ7L48D6dqRDFqAq3mUzw&tn=-R ", "2020-02-12T17:30:49.000Z": "Today I joined @KDOTHQ Secretary Julie Lorenz to announce the details of FORWARD, our proposed statewide transportation plan. Under FORWARD, major projects will be selected every two years rather than once a decade - and all existing T-WORKS projects will be completed. #ksleg", "2020-02-12T16:55:37.000Z": "We are starting the press conference in five minutes! Please join us: http:// facebook.com/ksdothq  #FORWARDKS  #ksleg", "2020-02-12T15:53:01.000Z": "In July 1958, a group of black students began filling the seats at Wichita's Dockum Drug Store each day in peaceful protest of the restaurant's segregation. After about a month the owner relented, and the students' victory sparked similar protests in OK & NC. #BlackHistoryMonth", "2020-02-12T15:39:40.000Z": "Happening TODAY!  Moving Kansas FORWARD. @GovLauraKelly and Secretary Lorenz are hosting a live press conference to discuss the proposed FORWARD transportation program, at 11 a.m. at the Kansas Statehouse.\nWatch the press conference online at http:// facebook.com/KSDOTHQ/  #FORWARDKS", "2020-02-11T21:35:30.000Z": "As the average age of Kansas residents continues to rise, it's critical for Kansas seniors to have access to the services they need. Thanks to @NCFHAAA for sponsoring today's Older Kansans Day event - the well-being of our state's seniors is enhanced by your advocacy.", "2020-02-10T16:20:14.000Z": "You're invited to the KANSASWORKS Statewide Job Fair on 04/02. This event allows qualified job seekers & hiring employers to network, apply & hire! Locations: Dodge City, El Dorado, Kansas City, Lawrence, Leavenworth, Manhattan, Overland Park, Pittsburg, Salina, Topeka, Wichita.", "2020-02-11T14:46:36.000Z": "Women have a long history of excellence when it comes to scientific contributions. But unfortunately, less than 30% of researchers worldwide are women. On #InternationalDayofWomenandGirlsinScience , let's encourage the women and girls in our lives to pursue STEM activities.", "2020-02-10T15:27:02.000Z": ". @SecretaryToland has announced the addition of Jeff Freeman to the business #recruitment team! For the first time since 2015, Commerce's business recruitment team is FULLY STAFFED! We're so excited to see the incredible work Jeff will do for Kansas! https:// bit.ly/37eCbev", "2020-02-10T16:00:01.000Z": "2020 marks the important anniversary of the ratification of the 19th Amendment to the U.S. Constitution 100 years ago. In just a few weeks on March 20, 2020, we will be opening a special exhibit, \"Upward to Equality: Kansas Women Fight to Vote.\" #kansashistory", "2020-02-10T16:01:13.000Z": "On May 17, 1954, the U.S. Supreme Court decided the landmark case known as \"Brown v. Board of Education of Topeka,\" officially declaring segregation in schools unconstitutional. The decision laid a foundation of equal rights and opportunities for all. #BlackHistoryMonth", "2020-02-09T19:39:45.000Z": "Expanding high-quality broadband access across Kansas is an investment in our rural communities. Better internet access would encourage economic development and improve quality-of-life offerings rural Kansas towns need to survive and thrive. #ksleg Not connected and no Netflix: 'It's frankly embarrassing' in these Kansas towns \"People won't be able to live here and work at some point,\" said one internet provider. kansascity.com"}