{"2019-01-03T00:52:30.000Z": "Maine is our home. Tomorrow we rise before the dawn - like the mist over the Sandy River - and seek adventure, with hope in our hearts and love in our souls for the brand new day. To all of you, and to the people of Maine, I say, welcome home. Thank you. #mepolitics", "2019-01-03T00:48:10.000Z": "From the tree streets of Lewiston to the rolling fields of the County, from the Bold Coast to the Height of Land, from Cross Rock in Allagash to Portland's Promenades, our people will once again find unity of purpose. #mepolitics", "2019-01-03T00:45:39.000Z": "My administration will create an Office of Innovation and the Future. This office will dive into major policy challenges, foster collaboration and propose concrete, workable solutions. Let's look ahead for a change. #mepolitics", "2019-01-03T00:43:21.000Z": "It is high time we put children's health and safety first. I will start with one simple step -calling together the Children's Cabinet for the first time in years, to tackle these issues. #mepolitics", "2019-01-03T00:41:41.000Z": "From now on, one simple sign will greet all those arriving in our state at the Kittery line. It will say: \"Welcome Home.\" #mepolitics", "2019-01-03T00:39:12.000Z": "In sad memory of the 418 Maine people who lost their lives to drug overdose in 2017, our Administration will create a Director of Opiate Response, a person who will marshal the collective power and resources of state government to stem the tide of this epidemic. #mepolitics", "2019-01-03T00:37:19.000Z": "Our new Administration will expand Medicaid - and pay for it sustainably; work to ensure that every person has primary care; control the cost of health insurance; and rein in the cost of  prescription drugs. #mepolitics", "2019-01-03T00:34:56.000Z": "Our new Administration will embrace clean energy; change our modes of transportation; weatherize homes and businesses, and reach a goal of 50 percent of our electricity coming from Maine renewable resources. BTW, check out our new solar panels on the Blaine House coming soon!", "2019-01-03T00:33:56.000Z": "Climate change is threatening our jobs, damaging our health and attacking our historic relationship to the land and sea. Tonight I say, enough. Enough with studies, talk, and debate. It is time to act! #mepolitics", "2019-01-03T00:32:35.000Z": "I do think about all the things they can do, along with their brilliant brothers, uncles and fathers. But truly, this year's milestone will one day be commonplace. When future generations read of this day, they will wonder what the fuss was about. #mepolitics", "2019-01-03T00:31:13.000Z": "The morning after the election, one mother left a note in her daughter's lunchbox, \"Janet Mills won last night!\" it said. \"She is the FIRST woman to be the governor in Maine EVER! Think about all the things you can do! love, Mom.\" #mepolitics", "2019-01-03T00:30:32.000Z": "In recent weeks I have received many letters. Eight-year old Lucy wrote, \"Now I feel like I could become governor someday!\" #mepolitics", "2019-01-02T22:56:22.000Z": "The Inaugural ceremonies are about to begin! Tune in to https:// livestream.com/accounts/76137 48/events/8505185?fbclid=IwAR0P_8C4PHril1_9IT7aWa30ygZiepx-xBxT1qADch-SVMXhUpanXhzMTto  to watch at 6:00 PM! #mepolitics", "2019-01-01T20:50:09.000Z": "Began my move into the Blaine House today while reflecting on how grateful I am for the immense trust & faith placed in me to lead our great state. Looking forward to tomorrow- watch my swearing in by tuning into this livestream @ 6:00 PM EST https:// bit.ly/2F4ljxo  #mepolitics", "2018-12-15T22:37:21.000Z": "What an incredible season. I could not be prouder of @BlackBearsFB and all they accomplished this year. Quote Tweet Bangor Daily News @bangordailynews UMaine football team's historic season ends in national semifinal loss at Eastern Washington http:// bit.ly/2PDYMII", "2018-12-08T14:02:04.000Z": "Got that right. Couldn't be prouder of this team. Congratulations, @BlackBearsFB ! Onto the @NCAA_FCS ! #BlackBearNation  #BearWitness Quote Tweet Maine Football @BlackBearsFB BEST. TEAM. IN. MAINE. HISTORY. #BearWitness | #BlackBearNation | #FCSPlayoffs", "2018-12-01T20:58:04.000Z": "Great win! Congratulations, @BlackBearsFB ! #BlackBearNation  #BearWitness  #FCSPlayoffs Quote Tweet Maine Football @BlackBearsFB FINAL | BLACK BEARS WIN!\n\nMaine takes a commanding 55-27 FCS Playoff home victory! #BlackBearNation | #BearWitness | #FCSPlayoffs", "2018-12-01T15:00:27.000Z": "Today, I join all Maine people in mourning the passing of President George H. W. Bush. You can read my full statement below #mepolitics", "2018-11-19T14:41:37.000Z": "Congratulations @BlackBearsFB ! Proud of you! Quote Tweet Maine Football @BlackBearsFB CAA CHAMPS! No 16 Maine Defeats No. 12 Elon, 27-26 \n\nRecap: http:// bit.ly/2K98BwW  #BlackBearNation | #BearWitness | #CAAFB", "2018-11-07T14:23:31.000Z": "Maine's Margaret Chase Smith to governor-elect @JanetMillsforME in 1948: 'You have much to live up to' Margaret Chase Smith to Janet Mills in 1948: 'You have much to live up to' \"Remember -- you have much to live up to because your two brothers will expect a great deal out of you but I know that you can do it,\" Smith writes in her letter. wmtw.com", "2018-11-07T05:40:37.000Z": "Thank you, Maine!", "2018-11-07T01:06:13.000Z": "VOTER ALERT: Italian American Heritage Center in Portland will be open until 9:30 PM! Please make sure to get out and vote.", "2018-11-07T00:22:11.000Z": "While we wait for the polls to close at 8:00 PM (stay in line if you're still waiting!) I want to thank every Mainer who has helped this campaign however way they can. We couldn't have done it without you.", "2018-11-06T21:59:22.000Z": "On the campaign trail at the Reiche School in Portland. \n\nWe're working to earn every vote we can across Maine! \n\nHave you voted yet?", "2018-11-06T17:52:12.000Z": "Love the energy we're seeing at the polls here in Lewiston! \n\nHave you voted yet today? Remember, polls are open until 8:00 PM. Find your polling place: http:// mainevoting.com", "2018-11-06T15:29:35.000Z": "Questions or problems at the polls? \n\nCall the Maine Voter Protection Hotline to help get them answered.", "2018-11-06T15:52:00.000Z": "Now that I've cast my ballot, I'm heading across Maine trying to talk with every last voter before polls close at 8:00 PM! First stop: Bangor. \n\nFind your polling location at http:// mainevoting.com", "2018-11-06T14:57:59.000Z": "Today is Election Day - RT to spread the word! #TeamJanet", "2018-11-06T13:18:35.000Z": "I just voted at my polling place near my home in Farmington. \n\nHave you voted yet today?", "2018-11-06T00:17:03.000Z": "Since I began this campaign in July 2017, I've traveled to every county in Maine talking with voters about making health care more affordable, creating jobs, and providing \"cradle-to-career\" education to every Mainer. \n\nElection day is tomorrow-and now I'm asking for your vote.", "2018-11-05T17:18:40.000Z": "These Mainers know that when we all vote, we all win. The #TeamJanet energy in Presque Isle is off the charts!", "2018-11-05T15:19:02.000Z": "Election Day is TOMORROW - can you believe it? #TeamJanet took a quick coffee break in Houlton as we continue our statewide GOTV tour!", "2018-11-04T22:13:10.000Z": "Hey you-yes, you! Our #TeamJanet volunteers in Bangor have a message for you:", "2018-11-04T20:23:58.000Z": "Bangor is ready to take Maine in a new, better direction by voting this Tuesday. Thank you to every #TeamJanet volunteer for working on GOTV today!", "2018-11-04T18:37:11.000Z": "Health care is a human right. Period. \n\nAs governor, my top priority will be to make health care more affordable and more accessible for people and small businesses across the state. \n\nMy plan: https:// janetmills.com/issues/healthc are ", "2018-11-04T17:13:17.000Z": "Up next? Augusta! Our #TeamJanet volunteers have a simple message for this Tuesday ->", "2018-11-04T14:57:14.000Z": "Good morning, Mainers! #TeamJanet was up early in Lewiston and Auburn getting volunteers ready for a big day of contacting voters.", "2018-11-03T23:59:40.000Z": "Hey Mainers-do you have a plan to vote? Election Day is on Tuesday, so make sure you know where your polling place is and what time you'll get there. There's more information about polling locations and other voting FAQs at http:// JanetMills.com/VOTE", "2018-11-03T20:17:53.000Z": "Packed house in Portland sending off another group of canvassers ready to get out the vote. Just 3 days left before Election Day-let's get it done!", "2018-11-03T19:42:52.000Z": "The Maine Department of Labor recently projected zero job growth for Maine's future. It's time for a new, better direction. I'm the only candidate in this race with a bold Economic Action Plan to create jobs and grow our economy: https:// janetmills.com/issues/economy", "2018-11-03T17:08:01.000Z": "Next stop: Biddeford! #TeamJanet is making calls and knocking doors as we sprint to Election Day on November 6. Join us- http:// MaineDems.org/GOTV", "2018-11-03T16:21:14.000Z": "We need to keep working hard to win on Tuesday, and you can help! Just go to http:// MaineDems.org/GOTV and find the nearest place to pitch in. #TeamJanet  #mepolitics", "2018-11-03T14:16:27.000Z": "Starting my Saturday morning in Yarmouth with a fabulous canvass kickoff. Want to join #TeamJanet and volunteer? Visit http:// MaineDems.org/GOTV  #MEgov  #MEpol", "2018-11-03T13:20:55.000Z": "So excited to share our final ad of this campaign with you. I'm so grateful for every conversation I've had with Mainers about how to take Maine in a new, better direction. Election Day is on Tuesday-and I'm asking for your vote. Need to Know youtube.com", "2018-11-02T22:30:26.000Z": "On the campaign trail in Brunswick and Rumford today, I met some great voters who are fired up to take Maine in a new, better direction on November 6th #MEPolitics  #MEGov", "2018-11-02T21:22:15.000Z": "Election Day is FOUR days away! Text \"MILLS\" to 82623 for updates on our campaign and other Maine Dems so you're ready to vote on Tuesday, November 6th. #mepol", "2018-11-02T19:43:42.000Z": "Stopped by Spectrum Generations in Hallowell to greet some Mainers and remind them to get out and VOTE on Tuesday! #mepolitics  #megov", "2018-11-02T14:58:58.000Z": "My goal is to have a \"cradle-to-college\" approach: strive for the highest achieving children and the most qualified young adults of any state. My plan: Universal Pre-K Improve K-12 quality Invest in college completion Tackle student debt\nMORE: http:// JanetMills.com/issues/educati on ", "2018-11-02T00:03:02.000Z": "I want everyone watching out there to know that I want to be a governor for all Mainers. I will always be pragmatic and collaborative, and together we will write our state's next chapter. #mepolitics  #MEGovDebate  #YourVoteYourFuture  https:// bangordailynews.com/2018/10/19/opi nion/editorials/janet-mills-would-be-a-pragmatic-governor-offering-a-refreshing-change/ ", "2018-11-01T23:30:42.000Z": "The \"run government like a business\" approach has led to literally zero job growth, according to Paul LePage's own administration. We need a new direction, and my economic action plan will provide that.\n\nRead more: https:// janetmills.com/issues/economy", "2018-11-01T23:22:32.000Z": "Proud to have worked closely with @AARPMaine as AG, and I have plans to help seniors age in place throughout Maine. #mepolitics  #MEGovDebate  #YourVoiceYourFuture", "2018-11-01T23:16:05.000Z": "I've stood up for women my entire career, and I will continue to do that as governor. #mepolitics  #MEGovDebate  #YourVoiceYourFuture", "2018-11-01T22:38:25.000Z": "I'm finishing up debate prep for our final debate of this campaign where I\"ll share my plan to lower the cost of health care, strengthen our public schools, and grow our economy.\n\nWill you join me? Tune in at 7:00 on @WGME or follow the live stream at: https:// wgme.com/news/local/tow n-hall-your-voice-your-future-debate-maine-gubernatorial-debate ", "2018-11-01T20:56:35.000Z": "#TBT : In 1981, the @OnlineSentinel wrote about my career as District Attorney.", "2018-11-01T18:18:50.000Z": "Silas wants to take Maine in a new, better direction-that's why he supports our campaign! If you agree, join us this weekend to help get out the vote: http:// JanetMills.com/volunteer  #PuppiesForJanet", "2018-11-01T16:47:36.000Z": "There are far too many people who are not able to get health insurance, and even for those who have insurance, many are paying very high premiums and high out of pocket expenses. \n\nRead my plan to lower the cost of health care: https:// janetmills.com/issues/healthc are ", "2018-11-01T14:59:45.000Z": "Election Day is Tuesday, November 6th! Make your plan to vote-and make sure your family and friends know when they're voting too. \n\nMORE: http:// JanetMills.com/VOTE", "2018-11-01T13:00:52.000Z": "With five days left in this election, Team Mills was outside ND Paper in Rumford early this morning talking to hardworking folks about the issues that matter to them. We can make a real difference for working families if we get out and vote next Tuesday!", "2018-10-31T21:51:52.000Z": "With just six days to go until Election Day, we're busy traveling across Maine and talking to voters! Here are some highlights from this week.", "2018-10-31T17:21:30.000Z": "\"As longtime students of economic forces that shape Maine, we are confident and optimistic because of the unique combination of experience, character and vision now offered to Maine citizens by Democrat Janet Mills.\" Commentary: Janet Mills prepared to fight labor crisis, revitalize government Mills will mobilize political, business and community partners to work with all levels of government. pressherald.com", "2018-10-31T16:23:08.000Z": "Six days left in this election and we're out on the campaign trail talking to Mainers about how to lead Maine in a new, better direction!", "2018-10-31T13:05:23.000Z": "Election Day is Tuesday, November 6th. Have you made your plan to vote?", "2018-10-30T17:31:44.000Z": "As governor, I'll make cradle-to-college investments in education by providing universal pre-K, ensuring every student has a great teacher & the resources to succeed, making college more affordable, and expanding access to vocational & technical programs: http:// janetmills.com/issues/educati on ", "2018-10-30T17:03:44.000Z": "Great conversation-and delicious lunch-with some fired up young voters at @ColbyCollege", "2018-10-30T15:05:32.000Z": "I am thrilled to have the support of @JoeBiden , a champion for working people around the country. Our campaign is focused on taking Maine in a new direction that always puts hardworking Mainers first. I can think of no better supporter of that cause than Vice President Biden.", "2018-10-29T15:22:15.000Z": "Grateful for @alancaron4maine 's support, and thankful to him for participating in this campaign. After eight years of divisive politics and backwards policies, Maine needs a change - not more of the same. #mepolitics", "2018-10-29T03:18:58.000Z": "Congratulations to the #RedSox on their #WorldSeries win! Well deserved after an incredible season.", "2018-10-29T00:46:48.000Z": "I want every Maine child to have the best education they can get, and we can get closer to that goal beginning with Universal Pre-K. #mepolitics  #MEGovDebate", "2018-10-29T00:39:53.000Z": "In Maine, the state legislature passed multiple renewable energy initiatives in the past year - but they were vetoed by the current governor.\n\nAs your next governor, I will make sure Maine is a leader on this issue. #mepolitics  #MEGovDebate Election 2018: Clean Energy's Future Could Rise or Fall with These Governors have the power to set the agenda on renewable energy or throw up roadblocks to its progress. It's become an issue in several races this year. insideclimatenews.org", "2018-10-29T00:20:59.000Z": "Medicaid Expansion is one of single clearest steps we need to take to reduce health care costs, and I am committed to doing it on day one. #mepolitics  #MEGovDebate", "2018-10-29T00:13:45.000Z": "The Welcome Home Program is one of the several programs I would pursue to grow our workforce. Check out my Economic Action Plan here  http:// janetmills.com/issues/economy  #mepolitics  #MEGovDebate", "2018-10-29T00:08:40.000Z": "I am the only candidate who has taken on the drug companies that contributed to the opioid epidemic. I have a 10-point plan to address this crisis. Read about my plan at http:// janetmills.com/issues/opioids  #mepolitics  #MEGovDebate", "2018-10-28T23:48:16.000Z": "Excited to talk about Maine's opportunity to turn the page, tonight in Bangor with @MainePublic  #mepolitcs  #MEGovDebate Quote Tweet Maine Public @MainePublic . @MainePublic will be hosting a live gubernatorial debate at 8 p.m., on radio, TV and web - if you need to brush up on the candidates we have your guide here: http:// bit.ly/2CGVhhI  #mepolitics", "2018-10-28T18:31:09.000Z": "Looking for an easy way to help us win on November 6th?\n\nText \"MILLS\" to 82623 and get periodic updates on our race and other Maine Democrats. #mepolitics", "2018-10-25T23:52:35.000Z": "On day one, I would begin implementation of Medicaid Expansion. Health care is a human right and, unlike my opponent @Moody4Gov , I have no problem stating that fact. #mepolitcs  #MEGovDebate", "2018-10-25T23:45:46.000Z": "We have to do more to address the opioid epidemic, which is why I stepped up to fund a supply of Narcan as Attorney General.\n\nAddiction is a public health crisis, and we need to treat it via prevention, education, treatment, and enforcement. #mepolitics  #MEGovDebate", "2018-10-25T23:30:01.000Z": "We need to take action on mitigation and prevention of climate change, now. A lobsterman recently put it to me this way: \"anyone who says 'climate change isn't real' hasn't been on my boat.\" #mepolitics  #MEGovDebate", "2018-10-25T23:12:23.000Z": "\"A recent report from the Maine Department of Labor painted a grim picture of the near future: Nearly zero job growth over the next eight years.\"\n\nMaine workers and families can't afford more of the same policies. #mepolitics  #MEGovDebate Janet Mills' Economic Plan Calls For 'New Direction' From GOP's Status Quo Democratic candidate Janet Mills attempted to lay claim Tuesday to a key issue in the four-way race for governor - the economy. She presented a range of mainepublic.org", "2018-10-25T23:08:21.000Z": "I believe that Maine's best chapter has yet to be written, and I can't wait to write it with you. #mepolitics  #MEGovDebate", "2018-10-24T16:45:31.000Z": "Proud to have the support of @PPMEAF .\n\n\"As someone who grew up in rural Maine and as the mother of five grown daughters, Janet Mills knows that no matter where you live, you deserve access to comprehensive reproductive and sexual health care.\" Commentary: Janet Mills will be an advocate for Planned Parenthood, reproductive rights By contrast, her primary challenger, Shawn Moody, has made his opposition clear. pressherald.com", "2018-10-24T01:05:33.000Z": "I've spent my life serving the people of Maine and trying to make our state better. \n\nI hope you will join me on November 6th and move our state in a new direction. I would be honored to have your vote. #mepolitics  #MEGovDebate Now let's go turn on the #RedSox", "2018-10-24T00:55:39.000Z": "Medicaid Expansion is supported by hospitals, small businesses, patient advocate groups-and Mainers overwhelmingly voted to approve it.\n\nI'll implement Medicaid expansion on day one. My opponent has said he will repeal it. #mepolitics  #MEGovDebate Medicaid expansion is the law - and it will benefit Maine Maine lawmakers must ignore the grandstanding and demands from LePage. bangordailynews.com", "2018-10-24T00:36:36.000Z": "Too many Maine children are going hungry. As Governor, I'll be committed to reversing this trend.\n\nWe have to take this on. #mepolitics  #MEGovDebate", "2018-10-23T17:49:08.000Z": "Having the support of tribal elder and former State Representative Donna Loring is an honor. Thank you, Rep. Loring, for writing such a thoughtful piece in the @PressHerald . #mepolitics Letter to the editor: Mills receives tribal elder's personal endorsement in race for governor The candidate's goals include defending the Indian Child Welfare Act, protecting the environment and opening up official lines of communication. pressherald.com", "2018-10-22T17:03:14.000Z": "\"She also knows from experience how the Legislature can navigate partisan differences and still be productive: She has shown that she knows when to fight and when to compromise.\" #mepolitics Our Endorsement: Editorial Board picks Mills for governor - Portland Press Herald Practical plans and an understanding of government set her apart from the field. pressherald.com", "2018-10-22T17:03:13.000Z": "From the endorsement:\n\n\"In her campaign, Mills has focused on the right issues: health care, education and rural economic growth.\" #mepolitics Our Endorsement: Editorial Board picks Mills for governor - Portland Press Herald Practical plans and an understanding of government set her apart from the field. pressherald.com", "2018-10-22T17:03:12.000Z": "In case you missed it: the @PressHerald has now endorsed Janet Mills for Governor! #mepolitics Our Endorsement: Editorial Board picks Mills for governor - Portland Press Herald Practical plans and an understanding of government set her apart from the field. pressherald.com", "2018-10-20T16:59:42.000Z": "This is our chance to send a message that we need a new direction. Thank you all for your hard work! #mepolitics Quote Tweet Maine Democrats @MaineDems \"This is when we take back our state.\" - the next governor of Maine, @JanetMillsforME  #mepolitics", "2018-10-19T14:36:41.000Z": "Honored to earn the endorsement of the @BangorDailyNews today! \n\n\"Mills is the best choice for a fresh, consistent, competent and compassionate direction to a more prosperous future.\" #mepolitics  #megov  http:// bangordailynews.com/2018/10/19/opi nion/editorials/janet-mills-would-be-a-pragmatic-governor-offering-a-refreshing-change/ ", "2018-10-17T23:51:40.000Z": "I've spent my life serving the people of Maine and trying to make our state better. \n\nI hope you will join me on November 6th and move our state in a new direction. #mepolitics  #MEGovDebate Janet Mills' mission: Break yet another glass ceiling - Portland Press Herald Informed by an influential family and an esteemed role model, a longtime Maine Democratic leader has come prepared with decades of public service as she seeks the governor's job. pressherald.com", "2018-10-17T23:46:28.000Z": "We need to take action on climate change now. \n\nWe cannot afford to send a climate denier to the Blaine House. #mepolitics  #MEGovDebate", "2018-10-17T23:42:31.000Z": "1 in 5 kids go to school hungry.\n\nPaul LePage's decision to cut SNAP benefits was wrong and I will reverse it as Governor. #mepolitics  #MEGovDebate", "2018-10-17T23:37:05.000Z": "I am a product of the Maine public school system. \n\nMy daughters are products of the Maine public school system. \n\nAs Governor, I will ensure that every teacher and student in Maine has the resources they need to be successful. #mepolitics  #MEGovDebate", "2018-10-17T23:34:21.000Z": "My opponent said our schools are overfunded. Meanwhile: Maine's teachers spent at least $4.2 million out of their pockets on school supplies Maine has the lowest per-student funding in New England Maine has the lowest teacher pay in New England #mepolitics  #megovdebate", "2018-10-17T23:31:23.000Z": "My family struggled firsthand with and expensive & complex health care system. Too many Mainers do too.\n\nI'll fight to lower the cost of Rx drugs & make sure every person has access to high-quality coverage, regardless of where they live in our state #mepolitics  #megovdebate", "2018-10-17T23:29:21.000Z": "A few years ago, my husband Stan had a stroke. He was in & out of hospitals for a year before passing away.\n\nThe high deductibles & huge prescription drug costs were no different than what 1000's of Mainers deal with.\n\nWe need a system that works for us. #mepolitics  #megovdebate", "2018-10-17T23:21:59.000Z": "\"In Maine, the state legislature passed renewable energy initiatives in the past year but they were vetoed by the GOP governor.\"\n\nShawn Moody will be more of the same. As governor, I will make sure Maine is a leader on this issue. https:// insideclimatenews.org/news/27092018/ election-2018-governor-races-renewable-energy-wisconsin-maine-michigan-colorado-new-mexico-nevada   #mepolitics  #megovdebate Election 2018: Clean Energy's Future Could Rise or Fall with These Governors have the power to set the agenda on renewable energy or throw up roadblocks to its progress. It's become an issue in several races this year. insideclimatenews.org", "2018-10-17T23:19:23.000Z": "As governor, I will make Maine a renewable energy leader. \n\nInvesting in renewables will lower energy costs, create jobs, and benefit our environment. https:// pressherald.com/2016/10/30/mai ne-voices-solar-benefits-all-ratepayers/   #mepolitics  #megovdebate Solar benefits all ratepayers Adding more renewables to Maine's energy mix will save money, lower the cost of electricity and create jobs. pressherald.com", "2018-10-17T23:16:59.000Z": "We need a new direction in Maine. My economic plan will: Create a Small Business Accelerator Launch Job Growth Loans Establish the 'Welcome Home Program' to bring Mainers back to the workforce Provide the Rural Workplace Grant Expand broadband #mepolitics  #megovdebate", "2018-10-17T23:16:28.000Z": "I grew up in Franklin County - Saddleback was in my backyard.\n\nAs Governor, I will help find the right investors to get the resort back on its feet. #mepolitics  #MEGovDebate", "2018-10-17T23:10:48.000Z": "\"A recent report from the Maine Department of Labor painted a grim picture of the near future: Nearly zero job growth over the next eight years.\"\n\nMaine workers and families can't afford more of the same Republican policies. http:// mainepublic.org/post/janet-mil ls-economic-plan-calls-new-direction-gop-s-status-quo#stream/0   #mepolitics  #megovdebate Janet Mills' Economic Plan Calls For 'New Direction' From GOP's Status Quo Democratic candidate Janet Mills attempted to lay claim Tuesday to a key issue in the four-way race for governor - the economy. She presented a range of mainepublic.org", "2018-10-17T23:02:54.000Z": "Medicaid Expansion is supported by hospitals, small businesses, patient advocate groups-and Mainers overwhelmingly voted to approve it.\n\nI'll implement Medicaid expansion on day one. My opponent has said he will repeal it. https:// bangordailynews.com/2018/04/02/opi nion/editorials/medicaid-expansion-is-the-law-and-it-will-benefit-maine/   #mepolitics  #megov Medicaid expansion is the law - and it will benefit Maine Maine lawmakers must ignore the grandstanding and demands from LePage. bangordailynews.com", "2018-10-16T17:58:12.000Z": "Farmington taught me how to listen and communicate directly with people. Thanks to @newscentermaine for taking the time to visit and chat. Voice of the Voter gubernatorial profile: Janet Mills Voice of the Voter gubernatorial profile: Janet Mills newscentermaine.com", "2018-10-11T00:29:25.000Z": "I've spent my life serving the people of Maine and trying to make our state better. \n\nI hope you will join me on November 6th and move our state in a new direction. #mepolitics  #MEGOV Janet Mills' mission: Break yet another glass ceiling - Portland Press Herald Informed by an influential family and an esteemed role model, a longtime Maine Democratic leader has come prepared with decades of public service as she seeks the governor's job. pressherald.com", "2018-10-11T00:19:47.000Z": "I am a product of the Maine public school system. \n\nMy daughters are products of the Maine public school system. \n\nAs Governor, I will ensure that every teacher and student has the resources they need to be successful. #mepolitics  #megov", "2018-10-11T00:17:35.000Z": "My opponent thinks education is overfunded. Maine's teachers spent at least $4.2 million out of their own pockets on school supplies in 2016. Maine has the lowest per-student funding in New England. Maine has the lowest teacher pay in New England. #mepolitics  #megov", "2018-10-10T23:59:51.000Z": "We need to take action on climate change now. \n\nWe cannot afford to send a climate denier to the Blaine House. #mepolitics  #MEGOV", "2018-10-10T23:48:30.000Z": "I will always defend women's reproductive health and a women's right to choose. #mepolitics  #MEGOV", "2018-10-10T23:41:28.000Z": "As governor, I will make Maine a renewable energy leader.\n\nInvesting in renewables will lower energy costs, create jobs, and benefit our environment. https:// pressherald.com/2016/10/30/mai ne-voices-solar-benefits-all-ratepayers/   #mepolitics  #MEGOV Solar benefits all ratepayers Adding more renewables to Maine's energy mix will save money, lower the cost of electricity and create jobs. pressherald.com", "2018-10-10T23:38:14.000Z": "\"In Maine, the state legislature passed renewable energy initiatives in the past year -but they were vetoed by the GOP governor.\"\n\nShawn Moody will be more of the same. \n\nAs governor, I will make sure Maine is a leader on this issue. https:// insideclimatenews.org/news/27092018/ election-2018-governor-races-renewable-energy-wisconsin-maine-michigan-colorado-new-mexico-nevada   #mepolitics  #MEGOV Election 2018: Clean Energy's Future Could Rise or Fall with These Governors have the power to set the agenda on renewable energy or throw up roadblocks to its progress. It's become an issue in several races this year. insideclimatenews.org", "2018-10-10T23:27:42.000Z": "Medicaid Expansion is supported by hospitals, patient advocate groups, and Mainers who voted to approve it.\n\nI'll implement Medicaid expansion on day one. My opponent has said he will repeal it. https:// bangordailynews.com/2018/04/02/opi nion/editorials/medicaid-expansion-is-the-law-and-it-will-benefit-maine/   #mepolitics  #MEGOV Medicaid expansion is the law - and it will benefit Maine Maine lawmakers must ignore the grandstanding and demands from LePage. bangordailynews.com", "2018-10-10T23:23:39.000Z": "I believe everyone in Maine should have access to affordable, quality healthcare. \n\nPeople shouldn't have to choose between paying their mortgage and paying for their prescription drugs. #mepolitics  #megov", "2018-10-10T23:17:53.000Z": "We need a new direction in Maine. My economic plan will: Create a Small Business Accelerator Launch Job Growth Loans Establish the 'Welcome Home Program' to bring Mainers back to the workforce Provide the Rural Workplace Grant Expand broadband #mepolitics  #megov", "2018-10-10T22:32:48.000Z": "Thank you all for the support!\n\nTune in to the debate tonight at 7:00 pm. \n\nYou can watch on http:// portlandpressherald.com  #mepolitics  #MEGOV", "2018-10-10T22:25:33.000Z": "Let's go @JanetMillsforME ! We're fired up for tonight's gubernatorial debate. You can watch on http:// portlandpressherald.com . #mepolitics", "2018-10-08T20:56:52.000Z": "Thank you to all of the incredible women who are coming together to organize, write letters to the editor, and support my campaign as we head into these critical final weeks. Sign up to volunteer: https:// janetmills.mainecandidate.com", "2018-10-08T15:57:28.000Z": "I will always stand with working people for our rights. #mepolitics Quote Tweet MSEA-SEIU Local 1989 @MSEASEIU1989 Thank you for your leadership, @JanetMillsforME  #mepolitics twitter.com/JanetMillsforM", "2018-10-06T20:16:44.000Z": "Here's another reason #WhyIRun : when Congress, the President, or even the Supreme Court won't stand up for Maine people, particularly women, I always will. #mepolitics", "2018-10-05T18:40:37.000Z": "I would not vote to confirm him and, despite the serious misstep of advancing his nomination, I urge the Senate to reject him tomorrow. #KavanaughVote  #mepolitics", "2018-10-05T18:39:45.000Z": "Judge Kavanaugh's conduct throughout this process has been alarming, and it raises serious doubts about his ability to judge cases impartially. #KavanaughVote  #mepolitics", "2018-10-05T18:39:43.000Z": "The Senate is now on the precipice of confirming one of the most controversial judges in American history to a lifetime post on the highest court in the land. #KavanaughVote  #mepolitics", "2018-10-05T17:12:52.000Z": "I'm fighting for opportunity for hardworking Mainers - for expanded health care coverage, better schools, and more.\n\nBlazing a trail isn't new for us here in Maine. We need a new direction, and I want to lead us in that new direction as Maine's next governor. #WhyIRun Quote Tweet EMILY's List @emilyslist There's a lot we're sad, angry, and frustrated about. And surprisingly, there's also a lot to be hopeful for. So today we're asking our pro-choice Democratic women to tell us: Why are you running for office? What are you fighting for? #WhyIRun", "2018-10-05T14:41:53.000Z": "GET EXCITED: Team Janet has new lawn signs! Contact one of our local field office to get yours today.  https:// my.mainedems.org/office/index", "2018-10-04T23:12:28.000Z": "And that makes 4 forums in less than 48 hours! I'm excited to tell people about Maine's next chapter. Thanks to @PortlandChamber , @WLOBRadio , @MidMaineChamber with @ThomasCollege , and the coalition of seafood industry groups for all of the great discussions. #mepolitcs", "2018-10-03T19:23:28.000Z": "As your next Governor, I will take Maine in a new direction. I was thrilled to talk about that vision with the @PortlandChamber this morning. #mepolitics", "2018-10-02T12:54:22.000Z": "Last night in #mepolitics , @JanetMillsforME , @alancaron4maine and @hayesformaine took questions from York County high school students. @Moody4Gov declined the invitation to participate in the forum. @seacoastonline Students share the stage with gubernatorial candidates YORK, Maine - At a gubernatorial forum Monday night, candidates for the state's highest office painted a picture of two very different Maines: One of rural, blue collar populations feeling left... seacoastonline.com", "2018-10-02T12:57:44.000Z": "The future of Maine is in good hands! I was grateful to take such excellent questions from high school students last night in York. \n\nThanks to @dmcdermoSMG for moderating and @seacoastonline for organizing last night's forum at York High School. #mepolitics", "2018-09-28T22:37:47.000Z": "I would not vote to confirm him, and I agree with the American Bar Association that the FBI should investigate the allegations before any vote is taken. (3/3)", "2018-09-28T22:37:17.000Z": "I was concerned by the tone and tenor of Judge Kavanaugh's testimony yesterday, and I do not trust him to protect the right of women to access safe and legal abortion. (2/3)", "2018-09-28T22:36:38.000Z": "This is a lifelong appointment to the highest court in the land, with critical issues like women's reproductive rights and health care hanging in the balance. (1/3) #mepolitics Candidates in Maine governor's race weigh in on Kavanaugh confirmation debate Two of the four candidates in the race call for a deeper investigation and a delay on a vote to confirm. pressherald.com", "2018-09-24T14:41:44.000Z": "I struggled firsthand with an unfair & complicated health care system. Too many Mainers do too. That's why I'll fight like hell to lower the cost of health care & make sure every person has access to high-quality coverage, regardless of where they live in our state #mepolitics", "2018-09-19T14:12:57.000Z": "\"Last month, the Maine Department of Labor painted a grim picture of the near future: Nearly zero job growth over the next eight years.\"\n\nWe can't afford more of the same. \n\nThat's why I've put forth bold new ideas to move us forward. #mepolitics Janet Mills' Economic Plan Calls For 'New Direction' From GOP's Status Quo Democratic candidate Janet Mills attempted to lay claim Tuesday to a key issue in the four-way race for governor - the economy. She presented a range of mainepublic.org", "2018-09-16T12:58:42.000Z": "\"There is one thing that needs to be said: She is a hell of a lot tougher than anybody estimates,\" says Peter Mills, her eldest brother. \"Janet is an incredible fighter, better than my dad, and he was one tough cookie.\" #mepolitics Janet Mills' mission: Break yet another glass ceiling - Portland Press Herald Informed by an influential family and an esteemed role model, a longtime Maine Democratic leader has come prepared with decades of public service as she seeks the governor's job. pressherald.com", "2018-09-09T23:00:00.000Z": "Shana Tova to all those celebrating Rosh Hashanah! May the New Year be one of sweetness, happiness and hope.", "2018-09-04T15:53:39.000Z": "We launched our new ad today! Watch below! Throughout my life and career, I've tried to do what most Mainers do - step up, work hard, fight for what's right, and get the job done. That's what I pledge to do as your Governor. #mepolitics", "2018-08-29T14:56:55.000Z": "As governor, I will fight to ensure that all Maine people are treated fairly and equally and with dignity and respect. Anything less than that is wrong and out of step with Maine values.", "2018-08-29T14:56:23.000Z": "I strongly disagree with Governor LePage and believe the law is both clear and right: No person should be fired because of their gender identity or sexual orientation. #mepolitics Critics say LePage's support for case challenging protections for LGBT workers puts Maine in a bad... He joins Republicans in arguing that the Civil Rights Act doesn't bar companies from firing workers for being gay or transgender, but a spokesman says the governor opposes how the protection was... pressherald.com", "2018-08-28T17:53:01.000Z": "I am honored to earn the endorsement of Planned Parenthood Maine Action Fund. I pledge to the people of Maine that, as governor, I will fight every day to protect a woman's right to make her own personal medical decisions #mepolitics", "2018-08-28T15:05:09.000Z": "After Gov LePage signed on to brief asking SCTOUS to rule that companies can fire people based on sexual orientation and gender identity, his Attorney General says he did it without consulting her, stressing ME law protects from such discrimination", "2018-08-26T19:51:23.000Z": "Glad to hear Governor LePage is in good spirits -- sending him best wishes for a speedy recovery #mepolitics LePage taken to EMMC after experiencing 'discomfort' LePage was hospitalized after he experienced unspecified \"discomfort\" while visiting family in New Brunswick, according to the governor's office. bangordailynews.com", "2018-08-26T13:25:43.000Z": "While we are worse because of his loss, we are a stronger, better nation because of his service, his leadership, and his example. I join every American in expressing my condolences to his wife, Cindy, his children, and his entire family. We will miss him.", "2018-08-26T13:24:55.000Z": "An American hero, a statesman of unsurpassed character, and a paragon of integrity, Senator McCain embodied the strength and compassion of our nation and was a powerful force for good. #mepolitics War hero and presidential candidate John McCain dies at 81 U.S. Sen. John McCain died Saturday, just days after deciding to end treatment for brain cancer. He was 81. bangordailynews.com", "2018-08-25T18:11:34.000Z": "Thanks to Betsy Sweet, Mark Eves, Diane Russell, Adam Cote and the hundreds of dedicated volunteers knocking doors across Maine today! #VictoryStartsHere Sign up today to join the team at http:// JanetMills.com/Volunteer", "2018-08-23T19:38:38.000Z": "My opponent, Shawn Moody, opposes Medicaid expansion and has said he would work to repeal it as governor. I think that's fundamentally wrong, and I pledge to see that it's fully implemented and is successful for our state.", "2018-08-23T19:37:45.000Z": "Not only will it improve the health of Mainers, but it will also inject millions of dollars into our economy, create jobs, and bolster our rural hospitals.", "2018-08-23T19:37:21.000Z": "This is a positive step forward for the people of Maine and for the future of our state. I agree with the Maine State Chamber of Commerce that Medicaid expansion is good for business and good for the people of Maine #mepolitics  https:// pressherald.com/2018/08/23/mai ne-high-court-rejects-lepage-request-to-delay-medicaid-expansion/ ", "2018-08-21T20:57:08.000Z": "The Trump Administration's effort to roll back clean air protections is fundamentally wrong and harmful to Maine #mepolitics", "2018-08-20T18:34:56.000Z": "Had a wonderful time in Owls Head yesterday with the Knox County Democrats talking about a new direction for Maine focused on affordable, high-quality health care, good-paying jobs in every part of the state, and a world-class education for every Maine child #mepolitics", "2018-08-18T17:08:15.000Z": "Thanks for all your hard work! Quote Tweet Lily Herrmann @lilyherrmann1 Rain won't stop us from knocking doors in Brewer for @JanetMillsforME , @golden4congress , @bevuhlenhake , & Archie Verow! #mepolitics (Sign up to volunteer for @MaineDems : http:// mainedems.org/volunteer )", "2018-08-17T14:52:00.000Z": "We cannot continue to do the same thing. We need to take immediate action & it needs to be more than re-airing the old 1980s 'this is your brain on drugs' commercial, like my opponent Shawn Moody suggests. The health of our citizens and the future of our state depend on it.", "2018-08-17T14:50:19.000Z": "That's why I have proposed a ten-point plan focused on providing greater resources, expanding the availability of treatment, and enhancing prevention efforts. You can read it here: https:// janetmills.com/issues/opioids", "2018-08-17T14:49:30.000Z": "For far too long our state has been behind the curve when it comes to addressing the opioid crisis, and that's because of a lack of leadership in the Blaine House - that needs to change.", "2018-08-17T14:48:51.000Z": "The opioid epidemic is reaching every corner of our society - taking the lives of those we love, limiting our ability to move people into the workforce and grow our economy, and -- most fundamentally -- hindering our future #mepolitics Maine is the 6th worst state in the nation for rise in overdose deaths - Portland Press Herald The number of overdose deaths in Maine increased by 10.9 percent in 2017, according to newly released federal data. pressherald.com", "2018-08-15T17:49:51.000Z": "I extend my deepest sympathy to Chris' family, friends, loved ones, and the entire @BangorDailyNews and Maine journalism community, whom I know he cherished so dearly. I will miss him.", "2018-08-15T17:48:47.000Z": "He established himself as a stalwart presence at the State House, waiting out the long and often grueling hours of legislative process to get the unique angle on a story and to collect the insight that made him such a stand-out reporter.", "2018-08-15T17:47:05.000Z": "Chris was a gifted journalist, a loving father and husband, and a good friend. With a pencil always at the ready, his wry and inquisitive smile was a welcome presence in every corner of the legislative and political universe of Maine #mepolitics  https:// bangordailynews.com/2018/08/15/pol itics/veteran-bdn-political-reporter-chris-cousins-dies-at-42/ ", "2018-08-14T19:15:25.000Z": "Maine is being hammered by climate change and it not only hurts Maine people but Maine industries that we rely on for good-paying jobs. We cannot stand idly by. Maine needs bold, urgent leadership to address climate change and I will deliver it #mepolitics Our View: Ignoring climate change puts Mainers in danger Politics has stifled research that would have helped the state prepare for a warming planet. pressherald.com", "2018-08-12T19:36:49.000Z": "Had a great time today at the Lincoln County Democratic Committee's annual Lobster Bake where I spoke to an energized crowd about a new direction for Maine, shucked a few Pemaquid oysters, and even met the local mascot #mepolitics", "2018-08-09T14:57:38.000Z": "I also stopped by The Well {at Jordan's Farm}, a restaurant situated on the farm that focuses on serving locally-sourced food. Agriculture is a pillar of our state's economy & a bright spot for continued growth moving forward - one that I intend to help cultivate as governor.", "2018-08-09T14:56:00.000Z": "Yesterday I toured Jordan's Farm in Cape Elizabeth, a family-owned farm that dates back five generations. At Jordan's not only do they grow & sell their own fresh produce, but they work to support other Maine farms & small businesses by selling their products as well #mepolitics", "2018-08-07T14:22:42.000Z": "Maine needs a new direction, and that's what I will deliver come January.", "2018-08-07T14:21:42.000Z": "As governor, I intend to bring about that change. I will work to rein in the growing costs of health care, train and educate more skilled workers, lower the burden of student debt, and bring broadband internet to every part of the state.", "2018-08-07T14:20:31.000Z": "This report underscores the urgent need for the next governor to move our state in a new direction if we are going to see serious economic growth. We simply cannot afford to continue to do the same thing and expect different and better results #mepolitics  https:// pressherald.com/2018/08/06/rep ort-projects-near-zero-net-job-growth-in-maine/ ", "2018-08-04T14:09:52.000Z": "It was a VERY wet parade at the Wilton Blueberry Festival this AM. @JanetMillsforME & @golden4congress with Tom Saviello. $ #mepolitics", "2018-07-30T02:06:38.000Z": "Record number of canvassers in @FranklinMEDems today! 14 strong, including 4 brand new folk. Knocked on 112 doors, had 55 conversations about @JanetMillsforME and @golden4congress and all our great candidates. Next Sunday: 146 Sunset Ave, Farmington #VictoryStartsHere", "2018-07-28T17:41:55.000Z": "", "2018-07-28T17:41:24.000Z": "", "2018-07-28T17:40:38.000Z": "1/3 Yesterday, I joined @HeartBiddeford for a walking tour of downtown to learn more about their economic revitalization efforts.", "2018-07-22T18:54:07.000Z": "\"There are many in our state who have been left behind, or feel they've been left behind. Families struggling to pay rent...members of the middle class whose savings are shot with one trip to the emergency room. We need a better future for them.\" - @JanetMillsforME  #mepolitics", "2018-07-22T21:08:08.000Z": "Missed the #MuskieLobsterBake because we were canvassing in Jay for @JanetMillsforME  @golden4congress and all our other awesome Democratic candidates! We're canvassing every Sunday from 12:30-3:30. Neighbor to neighbor chats to Get Out The Vote. Join us!", "2018-07-19T00:25:58.000Z": "4/4 As AG, I've distributed naloxone across Maine, saving nearly 500 lives to date. This issue is personal to me, like it is to so many families across Maine, and it will always be one of my priorities - as a candidate, and as Governor.\n\nRead my plan here: https:// janetmills.com/issues/opioids", "2018-07-19T00:20:15.000Z": "3/4 It turns out the reason Shawn Moody couldn't find time to work on this life-and-death issue was something else altogether - he was at a car show unveiling a NASCAR stock car with his campaign's slogan on it. Shawn Moody unveils new advertisement on NASCAR vehicle ARUNDEL (WGME) -- A Maine gubernatorial candidate will be making the rounds at an upcoming NASCAR event.Republican candidate Shawn Moody landed an advertising spot on Matt DiBenedetto's race car.Di... wgme.com", "2018-07-19T00:19:05.000Z": "2/4 @Moody4Gov was supposed to attend, too. Instead, he withdrew from the event and sent a political staffer as a surrogate. He said he had a scheduling conflict. #mepolitics", "2018-07-19T00:17:21.000Z": "1/4 I see the effects of the opioid crisis every day - from parentless children to small businesses that can't find workers. That's why I was in Bangor tonight with doctors, health officials, and experts, discussing how the next governor can tackle this epidemic. #mepolitics", "2018-07-12T23:55:40.000Z": "Thank you to Governor @JayInslee for joining me today to stand up for Maine people who voted overwhelmingly last year to approve Medicaid expansion. As governor, I will honor their will.", "2018-07-12T23:53:17.000Z": "Medicaid expansion will inject millions of federal dollars into our state, help create jobs, strengthen our economy, support rural hospitals & enable more than 70k people to gain health insurance. That's why I pledge to fully implement it & protect it as governor.", "2018-07-11T23:48:00.000Z": "Today I visited @TheTellingRoom , an organization empowering Maine youth by helping them express their voices through storytelling. I couldn't have been more impressed with these kids -- they were bright, funny, kind -- and they're writing our future, one line at a time.", "2018-07-08T23:56:59.000Z": "(Fixed link after some technical problems).\n\nWe're looking for summer interns, and we'd love to have you on the team! Click on the link below to apply. https:// goo.gl/forms/zjwyfCrS ufbt0Y5N2 ", "2018-07-07T13:28:11.000Z": "This should have been an easy decision for Governor LePage, but, instead, he chose to misrepresent the facts of this bill in order to turn his back on the LGBTQ community in Maine. The governor should have signed this, but where he failed, I will not.", "2018-07-07T13:27:28.000Z": "Conversion therapy is a reprehensible practice that has no medical merit, is fundamentally wrong, and serves no other purpose than to tell people they should feel ashamed and embarrassed of who they are #mepolitics LePage vetoes 6 new bills, including ban of 'conversion therapy' bangordailynews.com", "2018-07-05T21:45:31.000Z": "As Attorney General, I have fought Pruitt, and, today, I welcome his resignation. I hope a new Administrator will take seriously the EPA's critical mission to protect people, rather than work to turn it upside down as Pruitt has.", "2018-07-05T21:44:20.000Z": ".@EPAScottPruitt has virtually turned the Environmental Protection Agency into an arm of the oil and gas industry, weakening environmental regulations and directly threatening the health and well-being of Maine people - something I will never stand for. #mepolitics", "2018-07-04T19:46:14.000Z": "I had a great time marching in the Sanford #FourthofJuly2018 Parade! Thanks to everyone who came out to march or watch, it was a fantastic crowd! #mepolitics", "2018-07-04T14:45:21.000Z": "As we reflect on the type of nation, the type of state, and the type of people we want to be, let us keep in mind all that binds us together, and move forward with the important work of protecting our democracy and the liberties we hold dear. Happy Fourth of July!", "2018-07-01T14:19:54.000Z": "Access to reproductive health care is vital to the independence and dignity of women and girls in Maine. As Maine's next governor, I will fight any attempt to undermine or roll back a woman's right to choose - unlike my opponent, Shawn Moody. Greg Kesich: Abortion fight will be on state level With changes on the Supreme Court, Maine's next governor will have a lot of influence over women's health choices. pressherald.com", "2018-06-26T22:16:57.000Z": "I'm honored to have endorsement of Maine Conservation Voters. I will work every day to protect Maine's natural heritage - for the health of our people, for our economy, and so our children and grandchildren can grow and explore and wonder at the majesty and beauty of our state. Quote Tweet Maine Conservation Voters @MCVoters MCV Action Fund Endorses @JanetMillsforME for Governor! @MaureenDrouin  #mepolitics", "2018-06-23T23:20:05.000Z": "Victory in November starts with coming together right now. #mepolitics", "2018-06-23T00:51:17.000Z": "Campaigning can wait for just a minute.", "2018-06-23T00:37:49.000Z": "I was honored to address the extraordinary young women of Dirigo Girls State this afternoon. Their passion for public service and enthusiasm to learn is inspiring, and I'm so grateful to have had the chance to get to know them! #mepolitics", "2018-06-22T17:47:49.000Z": ". @JanetMillsforME addresses young women at Dirigo Girls State. The first female Attorney General in the state, Mills tells the high schoolers about a few women who inspired her and encourages them to get involved in politics and \"always seek common ground.\" @WABI_TV5", "2018-06-21T13:27:25.000Z": "#mepolitics this is what unity looks like. #VictoryStartsHere  @JanetMillsforME  @CoteForMaine", "2018-06-21T18:46:01.000Z": "I've been privileged to get to know six other Democratic candidates, who are each passionate, thoughtful, and committed to our state. I'm honored to accept their endorsements, and I look forward to working with all of them to take back the Blaine House and beyond. #mepolitics", "2018-06-21T01:09:19.000Z": "Congratulations to @golden4congress ! I'm excited to work together on the issues facing Maine people and families. #mepolitics", "2018-06-21T00:14:31.000Z": "It was announced just moments ago: we have officially been declared the winner of the Democratic primary for Governor of Maine! I'm deeply honored to accept this nomination, and I'm excited to get to work to win the general election. #mepolitics", "2018-06-19T13:45:11.000Z": "Seperating children from their families is unnecessary, unlawful, and un-American. Proud to be joining other @DemocraticAGs in calling for the Trump Administration to immediately end this moral and legal disaster. #mepolitics Quote Tweet Democratic AGs @DemocraticAGs #Breaking : New Mexico AG @HectorBalderas leads 21 Democratic AGs in calling on #Trump admin to stop separation of families. https:// ajc.com/news/democrati c-attorneys-general-urge-end-border-separations/sWJCwccKrRqzjy6Jc0G5dK/  Show this thread", "2018-06-18T17:50:54.000Z": "What a great afternoon - thanks for having me! #mepolitics Quote Tweet Dirigo Boys State @DirigoBoysState @JanetMillsforME made an appearance for the boys and they loved it! What a start to our week!", "2018-06-16T17:22:27.000Z": "Happy Pride! #mepolitics", "2018-06-13T23:54:51.000Z": "My statement on the results of the election. #mepolitics", "2018-06-12T22:15:00.000Z": "Get out the VOTE today for Democratic candidates up and down the ballot in Maine, Nevada and South Carolina on #PrimaryDay . (Special shout out to Maine AG @JanetMillsforME and @AaronDFordNV ) Primary Elections 2018: What to Watch For Maine, Nevada, North Dakota, South Carolina and Virginia are holding their primaries. Here are the most important races. nytimes.com", "2018-06-12T18:48:48.000Z": "Thank you Maura! Quote Tweet Maura Healey @maura_healey Good luck to my sister in service @JanetMillsforME on Primary Day! #mepolitics", "2018-06-12T12:54:19.000Z": "Just a reminder - if you're not sure where your polling place is, here's where you can look it up! http:// maine.gov/portal/governm ent/edemocracy/voter_lookup.php ", "2018-06-12T11:40:46.000Z": "Polls are open! Starting the day off with some canvassing at Bath Iron Works with former Senator Stan Gerzofsky!", "2018-06-11T15:25:50.000Z": "(8/8) And I agree with all my fellow Democrats that any of us would be better for Maine than one of the Republicans running on a platform of eight more years of LePage.\n\nSo while I hope you rank me as your number one choice, no matter what, show up tomorrow and VOTE! #mepolitics", "2018-06-11T15:25:21.000Z": "(7/8) I agree with Adam Cote that renewable energy should power our economy and our homes, preserving our beautiful environment and creating new, good-paying jobs. #mepolitics", "2018-06-11T15:25:00.000Z": "(6/8) I agree with Mark Eves that it's long past time for meaningful gun safety laws, from banning high-capacity magazines and bump stocks to passing a red flag law that keeps guns away from dangerous people. #mepolitics", "2018-06-11T15:24:39.000Z": "(5/8) I agree with Diane Russell that Augusta needs to respect the will of the voters, from Ranked Choice Voting to legalizing marijuana. #mepolitics", "2018-06-11T15:24:19.000Z": "(4/8) I agree with Betsy Sweet that we need a healthcare system that puts people above profits, and that after we expand Medicaid, working with other states to form a single-payer system is the best solution. #mepolitics", "2018-06-11T15:23:54.000Z": "(3/8) I agree with Donna Dion that we need to bring respect back to our political system. #mepolitics", "2018-06-11T15:23:39.000Z": "(2/8) I agree with Mark Dion that the opioid crisis is one of our greatest challenges as a society, and that the solution lies with education, treatment, and rehabilitation. #mepolitics", "2018-06-11T15:22:53.000Z": "(1/8) It's easy to get caught up in the fire and fury of a competitive primary, as everyone works to draw distinctions and make their case. Let's take a moment and, instead, talk about all the things that unite us. #mepolitics", "2018-06-11T15:05:03.000Z": "Almost there! Make sure you have a plan to vote: click below to find your polling place, view a sample ballot, and learn about local races.\n\nI hope I'll earn your first-choice vote! I also encourage you to vote YES on Question 1 to keep RCV. http:// maine.gov/portal/governm ent/edemocracy/voter_lookup.php   #mepolitics", "2018-06-11T14:29:07.000Z": "Thanks Chelsea! #mepolitics Quote Tweet Chelsea Handler @chelseahandler Maine! You've got your primary election on Tuesday. There are only two pro-choice Democratic women governors in the country. Help @emilyslist elect @JanetMillsforME ! http:// bit.ly/2klL53P GIF", "2018-06-10T14:32:33.000Z": "Ultimately this election is about the issues, policies, and leadership we need to turn our state around. Among those, healthcare is among the most critical. \n\nThanks to Jay Naliboff, MD, for this letter about why he's supporting my campaign for Governor! http:// dailybulldog.com/db/opinion/let ter-to-the-editor-janet-mills-will-make-an-excellent-governor/ ", "2018-06-09T22:18:50.000Z": "As Attorney General, I've always stood up to anyone who tries to take advantage of Maine people - whether that's Paul LePage, Donald Trump, Wall St. or Big Pharma. As Governor, I'll always have your back. #mepolitics", "2018-06-09T19:55:23.000Z": "After 8 years of LePage, we need a Governor who shares our values; we also need a candidate who can win. As the only candidate from CD2 - and having won tough elections there - I'm ready to turn Maine blue this fall (and help turn out Dems for the CD2 Congressional)! #mepolitics", "2018-06-09T14:35:14.000Z": "Thank you to everyone who came out yesterday for our rally in Augusta! I'm so honored by the support our campaign has received; it's the kindness, dedication, and energy of the hundreds of people like you that keeps me going every day.\n\nFour more days! #mepolitics", "2018-06-08T20:31:44.000Z": "What I'm hoping to see during the last week of the campaign. #mepolitics", "2018-06-08T13:29:42.000Z": "Great article this morning in the Bangor Daily News about where the campaigns are getting their funding! I'm honored by the fact that Mainers from more parts of our state have contributed to my campaign than to any other candidate, Republican or Democrat. https:// bangordailynews.com/2018/06/08/pol itics/where-candidates-who-want-to-replace-lepage-are-getting-their-campaign-cash/ ", "2018-06-07T18:40:37.000Z": "Just a reminder - today is your last date to vote absentee in person at your town hall! #mepolitics", "2018-06-07T11:50:50.000Z": "Thank you to Richard Barringer for a wonderful letter to the editor!\n\n\"In a long and distinguished career in public service to Maine, Janet has proven to be thoughtful, caring, hardworking, forthcoming, tough-minded and resilient.\" Letter to the editor: We know where Janet Mills stands; make her the Democratic nominee for... pressherald.com", "2018-06-06T22:35:58.000Z": "\"You can report a game poacher in 2 minutes...Reporting child abuse, you'll be put on hold for two hours.\" @JanetMillsforME", "2018-06-06T22:31:44.000Z": "@JanetMillsforME supporting Medicaid, hub and spokes, narcan etc... has saved over 400 lives as AG through distributing Narcan. #mepolitics", "2018-06-06T20:49:20.000Z": "Of all the great endorsements I've received this campaign, this is the one that matters most. #mepolitics", "2018-06-06T14:46:40.000Z": "Just a reminder: tomorrow is the deadline to cast your absentee ballot in person at your town hall! You can find your polling location or view a sample ballot here: http:// maine.gov/portal/governm ent/edemocracy/voter_lookup.php   #mepolitics", "2018-06-06T14:17:31.000Z": "Thanks Barbara Trafton for the great LTE! \"Janet has defended greenhouse gas emission standards, secured millions of dollars for air quality improvements, opposed oil drilling in the Gulf of Maine and fought to protect our waters from mercury emissions.\" Mills will protect the environment I grew up in the paper-mill town of Rumford on the banks of the Androscoggin River. The mill was important to the town's economic life, but it came at the high price of polluted air and water. Sen.... sunjournal.com", "2018-06-05T19:46:49.000Z": "As Governor, I will continue to work every day to make sure every Maine person has access to safe, affordable, high-quality healthcare, including abortion. And I will always stand with Planned Parenthood. #mepolitics Quote Tweet Planned Parenthood @PPMEAF How will @JanetMillsforME protect #Maine 's access to @ppnnehealth ? Check out what Janet says she will do if elected to governor to support #PlannedParenthood . #mepolitics  #istandwithpp  #MidtermElections", "2018-06-05T15:10:45.000Z": "Look who I ran into at Brownie Carson's campaign kickoff!", "2018-06-04T23:47:30.000Z": "I'm so proud that my record on women's rights and progressive values earned our campaign the endorsement of EMILY's List this year. As we head into the last week of this critical primary campaign, there's nobody I'd rather have on the team! #mepolitics", "2018-06-04T22:06:59.000Z": "Great news. Medicaid expansion will grow our economy and save lives. LePage's refusal to follow the will of the voters was appalling - that's why I refused to defend him in court & brought home $35 million to fund startup costs by holding Big Tobacco accountable. #mepolitics Quote Tweet Maine Public @MainePublic Court Rules That Maine Must Expand Medicaid Program As Approved By Voters http:// tinyurl.com/y7aup79r  #mepolitics", "2018-06-04T17:47:57.000Z": "Thanks to former Senator Judy Paradis, of Frenchville, for your support!", "2018-06-04T14:18:59.000Z": "Phil Bailey, a leader in the labor movement with the SEIU and the Maine People's Alliance, makes a powerful argument that we don't have to choose between someone 'electable' and someone who shares our values. I'm proud to have his support. Letter to the editor: Mills an 'electable,' future-minded candidate pressherald.com", "2018-06-03T16:10:24.000Z": "Replying to @JanetMillsforME A tireless advocate for bringing meaningful change to approaching this challenge.\nThe naloxone you provide to first responders has saved hundreds of lives, you continue to enforce drug laws to interdict the supply, and you have treated the families of those lost with compassion.", "2018-06-03T15:38:14.000Z": "A new study has found one of every five deaths in young adults is related to opioids. It's long past time to make prevention, education, and treatment a major priority for our state - it's appalling so little has been done. You can find my full plan here: https:// janetmills.com/tackling-opioi d-crisis/ ", "2018-06-03T14:54:23.000Z": "Thanks to Bob Jean and Deb Simpson for their great letters in the BDN today! Monday, June 4, 2018: The real Poliquin, Mills is role model for girls, Yes on Question 1 Monday, June 4, 2018: The real Poliquin, Mills is role model for girls, Yes on Question 1 bangordailynews.com", "2018-06-02T12:44:08.000Z": "Check out my op-ed in the Bangor Daily News about why I'm asking for your vote June 12!\n\n\"I believe that my track record makes me the best-qualified candidate for governor. But that's not the reason I'm running.\" #mepolitics I'm running for governor to continue my work for the people of Maine I believe my track record at attorney general makes me the best-qualified candidate for governor. But that's not the reason I'm running. bangordailynews.com", "2018-06-01T22:01:41.000Z": "Honored to have former Lewiston Mayor Larry Gilbert's endorsement! \"I came to know Janet Mills when she was elected District Attorney... We worked closely on serious cases that she prosecuted and was an outstanding advocate for victims and their families.\" Proud to support Janet Mills | Lewiston Sun Journal Municipal officials have a tough job, made harder through the past several years because of reductions in revenue sharing. Maine's economic future and the health of its communities depends on finding... sunjournal.com", "2018-06-01T13:37:26.000Z": "This the kind of gun safety report card we want to see! @JanetMillsforME along with her fellow Democratic AGs are working tirelessly in their states to prevent gun violence. \n\nOh, and they are not afraid of an extremist gun lobby that is out of touch with the American people. Quote Tweet Janet Mills @JanetMillsforME Wouldn't usually be proud of a failing grade - but I'll make an exception for this. Glad to see fellow Dems receive Fs from the NRA as well. Meanwhile, the GOP candidates all got As. Time to pull together to ensure none of them make it to the Blaine House. https:// nrapvf.org/grades/maine/", "2018-06-01T11:56:50.000Z": "Wouldn't usually be proud of a failing grade - but I'll make an exception for this. Glad to see fellow Dems receive Fs from the NRA as well. Meanwhile, the GOP candidates all got As. Time to pull together to ensure none of them make it to the Blaine House. https:// nrapvf.org/grades/maine/", "2018-05-31T16:25:56.000Z": "I'm honored to have the endorsement of former AG and Governor, Joe Brennan.\n\n\"A lifelong Democrat, a founder of the Maine Women's Lobby, and a person known and respected in all corners of Maine, Janet Mills will lead Maine with character, compassion and dignity.\" #mepolitics", "2018-05-30T20:19:34.000Z": "I had a great afternoon at @MainePublic for a debate with my fellow #megov candidates! I'm told the segment is planned to air on June 7th - we'll keep you posted. #mepolitics", "2018-05-29T22:16:01.000Z": "Thanks to Rep. Ted Koffman for a great letter to the editor! https:// bangordailynews.com/2018/05/29/opi nion/letters/wednesday-may-30-2018-mills-an-environmental-champion-protect-ranked-choice-voting-olson-for-congress/ ", "2018-05-28T23:07:28.000Z": "I was honored to address the Memorial Day Parade in Farmington:\n\n\"Maine has always had more than its share of heroes. We honor their sacrifice when we are not complacent, but stand up - when we serve our community, when we help our neighbors and work for the progress of us all.\"", "2018-05-27T13:24:43.000Z": "Great letter from Nick Wilson, Executive Director of the Maine Gun Safety Coalition: \"We need a proven leader who can craft and build consensus around gun laws that make sense for Maine. That's why Janet has my vote in the June 12 Democratic primary.\" Letter to the editor: Janet Mills a leader for sensible gun laws - Portland Press Herald pressherald.com", "2018-05-26T15:16:29.000Z": "My statement on misleading attacks regarding my record on gun safety. #mepolitics", "2018-05-25T22:24:12.000Z": "I had a great time with @BillNemitz on his podcast: https:// pressherald.com/2018/05/23/jan et-mills-i-was-a-bit-of-a-rebel/  . We talked about my family history in Maine, being the first woman to be District Attorney in Maine, how I met my husband Stan, and (of course) how proud I am of my daughters and grandkids! #mepolitics", "2018-05-25T12:50:00.000Z": "That's why I'm proud to join Democratic AGs across US in support of Planned Parenthood, in the case of Planned Parenthood v. Azar, over the Trump Administration's attempt to strip Title X funds from clinics that provide contraception, instead of education on abstinence.", "2018-05-25T12:47:29.000Z": "The Trump Administration is pushing a \"gag rule\" to prevent nurses & doctors from discussing abortion with their patients. #IStandWithPP , along with Dem AGs across the country, and I will always fight to defend reproductive rights for all Maine people.", "2018-05-23T16:02:31.000Z": "I'm honored to announce the endorsement of seventy current and former state senators and representatives, representing districts across Maine. So proud and grateful to have these dedicated public servants on board!", "2018-05-23T01:37:56.000Z": "Thanks to everyone who came out to Cushnoc Brewing in Augusta tonight! Had a great time meeting everyone and answering questions - 21 days to go!", "2018-05-21T02:24:32.000Z": "Had a great time at the Democratic Convention with my #1 supporter! Thanks to all the volunteers and supporters who came out, and to the Democrats around our state working to take back the Blaine House!", "2018-05-18T23:09:58.000Z": "\"Our successes belong not to me or my office, but to you, and to the people of our state... to everyone who believes that if we stand together, we will emerge from this long darkness stronger and more united than ever before.\" -Janet Mills #mepolitics", "2018-05-18T23:06:52.000Z": "\"Throughout. our team at the AG's office have been doing their job with integrity and compassion. I am so proud of their toughness, their patience, and their resolve to maintain the rule of law, even in the face of politicization, polarization, and personal attacks.\" #mepolitics", "2018-05-18T23:05:33.000Z": "\"And that is why, when our President emboldened the forces of division and xenophobia, threatening to deport Dreamers and ban Muslim immigrants, we were there to stand with every new American who dreams of a safe and productive life right here in our state.\" #mepolitics", "2018-05-18T23:04:54.000Z": "\"That is why, when the NRA said we could never pass meaningful gun laws to avoid tragedies like the one this very morning in Texas, we have been working to pass a \"red flag\" bill to keep guns away from just such dangerous individuals.\" - Janet Mills #mepolitics", "2018-05-18T23:04:14.000Z": "\"I am proud to stand as a Democrat, holding fast to Democratic values.\n\nThat is why we refused to stand by as the opiate epidemic ravaged our state; we distributed Narcan to 80 police departments, saving 459 lives to date.\" - Janet Mills #mepolitics", "2018-05-18T23:02:55.000Z": "Janet Mills: \"These times have been challenging for our state and our nation... It is those very challenges that make me so honored to serve as your Attorney General - to be the first line of defense for our laws and our rights.\" #mepolitics", "2018-05-18T17:00:01.000Z": "Convention starts today! Democrats are prepared to attend in record numbers, we've got energy and momentum on our side, and we're ready to elect Democrats who will fight for every Mainer's fair shot at success. #mepolitics  #victorystartshere", "2018-05-15T20:52:45.000Z": "Thank you Helen Rankin!\n\n\"Her service as a district attorney, state representative and attorney general has required stamina and the courage of her convictions, which speaks highly of her ability to fight for the citizens of Maine.\" Letter to the editor: Experienced, tough Janet Mills would make an excellent governor - Portland... pressherald.com", "2018-05-14T12:51:19.000Z": "Thank you Lynn Bromley!\n\n\"Janet's vision and values are for a healthy and prosperous Maine, and she has the knowledge and experience to do the hard work that turns good ideas into reality.\" Letter to the editor: Mills' vision, values make her best choice for Blaine House - Portland Press... pressherald.com", "2018-05-13T20:21:04.000Z": "", "2018-05-13T20:20:54.000Z": "", "2018-05-13T20:20:03.000Z": "", "2018-05-13T13:57:02.000Z": "Thank you Mary! Letter to the editor: Mills' sterling performance as DA bodes well for her candidacy for governor pressherald.com", "2018-05-10T15:19:56.000Z": "My statement on #NursesWeek", "2018-05-08T19:41:34.000Z": "I find the allegations made against Eric Schneiderman deeply disturbing, and I'm glad he has chosen to do the right thing and resign. As AG, I've made combating domestic violence and abuse my highest priority; there can be no tolerance for such actions. Full statement below.", "2018-05-07T14:54:15.000Z": "When LePage said we couldn't afford to expand Medicaid this year, I secured a new $35 million from Big Tobacco to do just that. Now, LePage is out of arguments - but he's still refusing to follow the law. As AG, I will refuse to defend the indefensible. Attorney General Mills won't defend LePage in Medicaid expansion lawsuit It's the latest example of Maine's attorney general, a Democratic candidate for governor, opting to let the governor hire outside legal counsel rather than represent the state in court. pressherald.com", "2018-05-03T14:50:49.000Z": "I believe this campaign is about two things: who has a vision for Maine's future, and who has the experience to make that vision a reality. I'm running for Governor to continue my fight for Maine people and families.", "2018-05-02T14:16:46.000Z": "In September, I promised that if the Trump administration tried to gut car emissions standards, I'd take them to court. Yesterday, I did exactly that. Maine joins lawsuit over Trump plans to scrap vehicle emission standards California officials say the standards are achievable and the EPA's effort to roll them back is not based on any new research. pressherald.com", "2018-05-01T23:10:39.000Z": "Thanks to everyone who made our second quarter a success! We're proud that more than 40% of our contributions came from Maine's Second Congressional District. With your help, we'll make Janet's vision of a single united, prosperous Maine a reality!\n\n-Ben Gagnon, Finance Director", "2018-04-30T13:52:03.000Z": "See my statement on addressing #foodinsecurity in Maine below.", "2018-04-28T21:46:21.000Z": "I want to express my gratitude for the brave men and women who worked tirelessly, around the clock, to arrest John Williams for the murder of Somerset County Sheriff's Corporal Eugene Cole. My thoughts and deepest sympathies remain with the family of Corporal Cole.", "2018-04-28T02:21:08.000Z": "Thank you to Pious Ali and everyone who helped organize a forum with the Portland immigrant community! As our population ages and our workforce shrinks, it's more critical than ever that we welcome new Mainers to our state.", "2018-04-26T15:15:39.000Z": "", "2018-04-26T15:14:43.000Z": "", "2018-04-23T02:36:47.000Z": "", "2018-04-23T02:35:51.000Z": "2) As the Trump administration and Scott Pruitt continue to turn the EPA away from its mission of safeguarding our environment, it's more critical than ever that state governments lead on this critical issue. That's what I've done over and over as AG: https:// janetmills.com/protecting-cle an-air-water/ ", "2018-04-23T02:34:58.000Z": "1) Happy #EarthDay2018 ! On this day in 1970, millions of people came together to call for immediate action to protect our environment. That first Earth Day inspired many of the critical protections we sometimes have sometimes taken for granted, including the creation of the EPA.", "2018-04-22T17:38:26.000Z": "Thanks for your support, Trish Riley! I'll know where to start on day one, to repair the damage from the LePage administration and get Maine back on track. Letter to the editor: Mills would implement practical, compassionate agenda pressherald.com", "2018-04-21T15:57:09.000Z": "I had a wonderful morning meeting the residents at the Thornton Oaks retirement community! We had a great discussion about environmental protection, clean energy, prescription drug costs and making healthcare accessible to everyone. Thanks to everyone who came out!", "2018-04-20T19:42:57.000Z": "I had a great time meeting with the Maine Credit Union League about the issues we both care deeply about - financial literacy, student debt, and economic development. Here's what they had to say: http:// mainecul.org/news-events/vi ew_news/1827 ", "2018-04-19T19:17:27.000Z": "I've said from the beginning that I believe Ranked Choice Voting has real potential to encourage civility in politics at every level, and I'm deeply gratified that the saga over implementation seems finally to be resolved. Maine's top court clears way for ranked-choice voting in June The decision from the Maine Supreme Judicial Court allows Secretary of State Matt Dunlap to continue implementing the system for gubernatorial and congressional primaries. bangordailynews.com", "2018-04-19T00:34:08.000Z": "Thanks to everyone who came out to @moderationbeer in Brunswick last night, and to @GrowingUpJulia for hosting us!", "2018-04-18T03:55:00.000Z": "Barbara Bush was an empathetic, generous and fearless advocate for the causes she believed in - literacy, education, and public service. My thoughts are with the entire Bush family tonight.", "2018-04-16T19:32:47.000Z": "I will always defend the right of women to seek reproductive healthcare free of abuse, harassment or intimidation - whether that fight takes us to the Supreme Court or to the Blaine House. U.S. Supreme Court Rejects Abortion Protester's Challenge Of Maine Law Limiting Noise The United States Supreme Court has upheld a Maine law that limits noise generated by protestors outside medical facilities. The case arose when a pastor mainepublic.org", "2018-04-13T18:20:03.000Z": "Thanks to Deborah McDermott at @seacoastonline for a great profile! We talked about everything from environmental protection to marijuana legalization. Check it out! Maine governor candidate: Janet Mills, Democrat Age: 70 Hometown: Farmington Family: Five daughters, four grandchildren Occupation: Attorney general of Maine York state representative Patricia Hymanson has introduced legislation (LD 105) to create... seacoastonline.com", "2018-04-12T16:44:35.000Z": "You can find all the candidate's answers here: Candidates for governor respond with BIG IDEAS Two weeks ago, I made an offer to all the candidates running for governor: Send me a big idea explained in 50 words or less, and I'll share it with the world as written and without comment. A chanc davidfarmer.bangordailynews.com", "2018-04-12T16:44:10.000Z": "Last week, @DavidFarmer14 asked every gubernatorial candidate to propose, in 50 words or less, a creative policy idea - not just a typical talking point, but a specific idea that could actually be implemented.\n\nHere was my response:", "2018-04-11T15:04:05.000Z": "I had a great time at the WGME/BDN gubernatorial debate last night - thanks to everyone who tuned in! Left versus inside: Recapping the Maine Democratic gubernatorial debate Attorney General Janet Mills looked like the frontrunner as most of the Democratic field raced to the left to define themselves before a primary audience. stateandcapitol.bangordailynews.com", "2018-04-11T00:31:23.000Z": "\"We need a plan from cradle to college\" - Janet Mills on schools. #YourVoiceYourFuture", "2018-04-11T00:22:06.000Z": "Janet Mills says Medicaid expansion will bring more than 3,000 jobs to the state. #YourVoiceYourFuture", "2018-04-11T00:21:35.000Z": "Janet Mills says Medicaid expansion is \"the right thing to do.\" #YourVoiceYourFuture", "2018-04-11T00:14:55.000Z": "Janet Mills says that she supports more computer science programs in Maine schools. #YourVoiceYourFuture", "2018-04-11T00:35:07.000Z": "Janet Mills; \"I'm running for Governor so my four children and five grandchildren can grow up in the safe, prosperous, beautiful state I've always been proud to call home.\" #mepolitics  #demsdebate", "2018-04-11T00:34:00.000Z": "Janet Mills: \"We need to pay teachers more, and make sure students have access to a great education no matter where they live in Maine.\" #mepolitics  #demsdebate", "2018-04-07T15:25:27.000Z": "I can't recall if this is gesture was 'thumbs up for Medicaid expansion' or 'Paul LePage is about to be outta here,\" but either way, I meant it!\n\nThanks to Chris Nyhan and Carmela Palanda for hosting a wonderful event at their home!", "2018-04-07T07:12:41.000Z": "Proud to work with coalition of AGs to take Trump admin and @EPA to court for ignoring duty to control methane emissions.\n\nAs Governor, I will work every day to protect Maine - whether from Donald Trump's EPA or anyone who threatens our beautiful home. http:// maine.gov/ag/news/articl e.shtml?id=793547 ", "2018-04-05T02:44:47.000Z": "Today we mark the 50th anniversary of the assassination of Dr. Martin Luther King, Jr. His legacy is honored not only by celebrating his great accomplishments, but by renewing our commitment to work every day towards his dream of justice and equality for all. #MLK50", "2018-04-03T22:44:38.000Z": "Just testified in favor of \"red flag\" law, so family members can ask courts to temporarily remove firearms from high-risk individuals (i.e. domestic abusers, people threatening suicide), subject to a hearing & due process. Grateful to @dionforgovernor for his leadership on this.", "2018-04-03T17:51:48.000Z": "I'm proud to announce that my office has secured over $35 million in new funds for Maine, by holding Big Tobacco accountable. These funds will be more than adequate to fully implement #Medicaid expansion in Maine. #mepolitics Mills: New tobacco settlement cash could fund Medicaid expansion Republican Gov. Paul LePage called Mills' plan a \"one-time budget gimmick to fund Medicaid expansion.\" bangordailynews.com", "2018-04-02T01:07:27.000Z": "Happy Easter from the Mills clan! Whether you're celebrating Easter, Passover, or time with family and friends this weekend, we hope your day was filled with laughter and love!", "2018-03-31T22:53:06.000Z": "Thanks to everyone who came out to open our new office at 120 Lisbon St, Lewiston! #mepolitics", "2018-03-30T16:42:02.000Z": "I had a wonderful time getting to know Mariam Jalabi, the director of the Syrian National Coalition's Office at the United Nations! Mariam is doing critical work advancing the cause of peace, liberty, and women's rights around the world.", "2018-03-27T21:03:09.000Z": "Thank you to Pam Maus and the Midcoast Women's Collective, for hosting a fascinating panel discussion on the history and future of the movement for women's equality!", "2018-03-24T19:13:51.000Z": "Some more great photos of the students at Mt. Blue High School who organized the event. So tremendously proud of them!", "2018-03-24T18:16:55.000Z": "This morning, I was honored to march with dedicated, passionate, fearless students and allies at the #MarchForOurLives in my hometown of Farmington. I'm so proud of these young people and the hope they represent for our state and our nation.", "2018-03-24T16:21:25.000Z": "Why did you join Team Janet? Send us a photo and your reason for supporting Janet for Governor to info@janetmills.com!\n\n-Mike Ambler, Campaign Manager", "2018-03-19T23:53:51.000Z": "Thank you to the Wells and Yarmouth Democratic Committees for hosting two great gubernatorial forums yesterday afternoon. It's always a pleasure to meet and discuss the critical issues facing our state with informed, engaged, fired-up voters!", "2018-03-16T20:02:04.000Z": "I'm pleased to announce that the courts have held the the Governor may not unilaterally shut down Downeast Correctional Facility. This ruling is critical both to uphold our system of checks and balances, and to protect the people of Washington County. Judge says that LePage doesn't have power to close Down East prison Superior Court Justice Michaela Murphy granted a temporary injunction sought by the attorney general, unions and the Washington County Commission. bangordailynews.com", "2018-03-16T15:16:39.000Z": "It's official! Congratulations to all the candidates who qualified as well - I look forward to a substantive debate on the many important issues facing Maine. Primary field for Maine governor narrowed to 12 in the two major parties Seven Democrats and five Republicans submit voter signatures in time to get their names on the June 12 ballot, and the deadline for independents is June 1. pressherald.com", "2018-03-14T16:25:55.000Z": "As AG and as Governor, I will strongly oppose the the Trump administration's proposal to drill for oil off the coast of Maine. An oil spill would create havoc for Maine's economy, our fishing and tourism industries, and our fragile coastal ecosystems. http:// maine.gov/ag/news/articl e.shtml?id=791092 ", "2018-03-12T22:30:53.000Z": "Today, we filed exactly 3,000 signatures (the legal maximum) to qualify for the ballot! Thank you so much to the 200+ volunteers who helped us collect more than 4,000 petition signatures, including signatures from over 140 municipalities and all 16 counties in Maine!", "2018-03-07T21:05:51.000Z": "", "2018-03-07T21:05:36.000Z": "", "2018-03-07T21:05:20.000Z": "", "2018-03-04T22:21:05.000Z": "Rep Pingree and State Atty General Janet Mills support Hospice workers in their fight for a fair contract", "2018-03-05T02:26:03.000Z": "Honored and excited to have won the Lewiston Democrat's Straw Poll with 61% of the vote! http:// fb.me/28yuHyVAg", "2018-03-05T02:24:06.000Z": "Thanks to everyone who came out today for the caucuses! I had a wonderful day in Bangor, Lewiston, Auburn, Portland, and Falmouth (whew!). Especially grateful to the 150+ volunteers who collected signatures and spoke for our campaign (our awesome Portland team is pictured below)!", "2018-03-04T16:05:39.000Z": "It's Caucus Day! The caucuses are a great place to talk to voters and organize for the campaign ahead (and if you haven't yet, sign to get us on the ballot!). Each municipality has its own caucus; you can find your location below.\n\nHope to see you there! Maine Democratic Party #RiseAndOrganize because voting by itself is not enough. my.mainedems.org", "2018-03-03T20:08:57.000Z": "Had an exhilarating time at the Can-Am sled dog races in Fort Kent this morning! What amazing dogs - some will be running more than 250 miles to Portage Lake and Allagash before looping back to Fort Kent.", "2018-03-02T18:43:00.000Z": "Thanks so much to the great folks at Schooner Ridge in Bath for joining me for a discussion and canvass! By far my favorite part of running for Governor is when I get to go knock on doors and meet real voters, and it's doubly fun with such fine company!", "2018-02-26T20:49:54.000Z": "Proud to have signed on to #JANUSvsAFSCME in support of hard-working people and families across Maine and the US. Will do everything in my power to urge #SCOTUS to preserve the right to collective bargaining. Healthy unions mean good jobs and a path to the middle class.", "2018-02-26T19:17:03.000Z": "\"We need to focus on teacher/student ratios, not teacher/gun ratios.\" ~ @JanetMillsforME  #EndGunViolence  #MaPoli", "2018-02-25T22:12:54.000Z": "Please take a look at my full statement on how we can do better at keeping guns out of the hands of dangerous people.", "2018-02-25T14:14:53.000Z": "Thank you Dr. Ira Mandel for inviting me to UC Rockland to speak about solutions to the #opioidcrisis ! I was so impressed by his thoughtful and passionate students, and I'll be proud to work with them - and other students and advocates like them - to tackle this critical issue.", "2018-02-22T20:32:39.000Z": "Thanks to the Tri-Town Democrats (of Limerick, Newfield and Parsonsfield) for hosting me last night!", "2018-02-19T14:43:44.000Z": "Hard at work canvassing in Bangor with the estimable Rep. Barbara Cardone and our team of volunteers! I had a great time meeting voters and hearing about the issues important to them; thanks to everyone who came out to help!", "2018-02-16T00:51:58.000Z": "The closure of Downeast Correctional Facility represents a violation of the separation of powers in our constitution, which does not permit the Governor to unilaterally end programs funded by the legislature. As such, I will oppose DCF's closing in court. Janet Mills opposes Downeast Correctional Facility's closing in court AUGUSTA - The Maine Department of Corrections agreed Wednesday to halt equipment removals from the now-vacant Downeast Correctional Facility while a legal case against the LePage administration... sunjournal.com", "2018-02-14T16:28:17.000Z": "We've already heard a lot - appropriately - about what was wrong with last night's State of the State. But I'd like to focus instead on what next year's speech might sound like. #mepolitics", "2018-02-11T21:45:51.000Z": "I had a wonderful time yesterday meeting the fine folks of Chebeague Island at local businesses, the Polar Plunge, and the Chowder Challenge. Thanks for having me!", "2018-02-08T16:43:59.000Z": "I will oppose Trump administration's rule allowing employers to pocket employee's tips. I strongly believe that we should be working to increase the wages of hardworking Maine people, not encouraging employers to confiscate every penny above minimum wage. http:// maine.gov/ag/news/articl e.shtml?id=778219 ", "2018-02-07T22:56:36.000Z": "Why did you join Team Janet? Send us a photo and your reason for supporting Janet for Governor to info@janetmills.com!", "2018-02-04T23:31:27.000Z": "LET'S GO PATS! #NOTDONE  #SBLII  #GoPats", "2018-02-03T01:07:35.000Z": "This week, we were proud to endorse @JanetMillsforME for governor of Maine! Learn more: http:// bit.ly/2s20E7k  #MEGov", "2018-01-31T15:45:13.000Z": "I'm honored to receive the endorsement of @emilyslist . They understand how critical this election is for Maine's future. EMILY's List Endorses Janet Mills for Governor of Maine emilyslist.org", "2018-01-30T15:00:05.000Z": "We've said since day one that we want to run a grassroots campaign powered by real Maine people, not big out-of-state megadonors or slick consultants. But to do that, we need your help! Go to http:// janetmills.com/volunteer to join the team today.", "2018-01-24T17:15:22.000Z": "Last week, I filed an amicus brief before the U.S. Supreme Court in Janus v. AFSCME, a case threatening to undermine organized labor across the nation. As governor, I will continue to stand up for the rights of all Maine workers, http:// maine.gov/ag/news/articl e.shtml?id=776624 ", "2018-01-23T17:58:07.000Z": "Why did you join Team Janet? Send us a photo and your reason for supporting Janet for Governor to info@janetmills.com!", "2018-01-21T17:20:38.000Z": "There are some moments that are bigger than one person, one political issue, or one campaign for governor. Standing with thousands of women in Augusta yesterday was one of those moments. I'm deeply proud of the strength, compassion, and courage on display at #WomensMarch2018", "2018-01-20T16:51:44.000Z": "Why did you join Team Janet? Send us a photo and your reason for supporting Janet for Governor to info@janetmills.com!", "2018-01-19T18:36:57.000Z": "One of my favorite parts of running for Governor is learning about all the amazing things that are already happening in Maine. Kennebec Technologies is a leader in state-of-the-art aerospace, medical device, and clean energy manufacturing, all right in our backyard!", "2018-01-18T14:52:11.000Z": "Why did you join Team Janet? Send us a photo and your reason for supporting Janet for Governor to info@janetmills.com!\n\n-Mike Ambler, Campaign Manager", "2018-01-16T17:39:31.000Z": "(3/3) I've learned that the best way to respond is to double-down on the commitments that matter - accessible healthcare, equitable workplaces, and safe homes. My dedication to those values is absolute - no matter what they throw at me, and no matter what office I hold.", "2018-01-16T17:38:28.000Z": "(2/3) I wish I was shocked by the attacks that get made against those standing up for women's rights, but over my career - co-founding the Maine Women's Lobby, prosecuting domestic abuse, and serving as ME's first woman Attorney General- I've learned that it comes with the job.", "2018-01-16T17:37:08.000Z": "(1/3) This morning, far-right lawmakers in the Maine Legislature said they wanted my resignation - because I advanced a bill designed to ensure women in rural and low-income communities have access to abortion services. Maine Republicans Oppose Bill Expanding Abortion Access Republican lawmakers in Maine push state's attorney general to resign over her decision to move forward a bill that would expand abortion access. usnews.com", "2018-01-15T18:05:50.000Z": "As Dr. Martin Luther King Jr. said, it's true that \"the moral arc of the universe bends toward justice.\" But it doesn't get there on its own. Today, I'll be reflecting on what I can do to bend that arc a little bit more sharply. I hope you'll join me.", "2018-01-14T16:39:10.000Z": "There's no imaginable economic or moral justification here. As AG, I'm working now to find a way to deploy Narcan as widely as possible, with or without LePage's approval. As Governor, I'll work to implement a comprehensive response to the opioid crisis. Why a life-saving drug still isn't at hand: Bureaucracy - Portland Press Herald Twice Maine lawmakers have OK'd the purchase of Narcan, a heroin overdose antidote, without a prescription, but Gov. Paul LePage and the state's pharmacy regulators won't publish the rules that... pressherald.com", "2018-01-12T17:19:16.000Z": "I'm deeply pleased to announce that my office, along with the Attorneys General of California, Maryland, and Minnesota, and other plaintiffs whose suits were combined with ours, have won an injunction blocking the rescission of the DACA program. Judge temporarily blocks Trump decision to end DACA program for young immigrants - Portland Press... He says lawyers for the so-called 'dreamers' demonstrated that they were likely to suffer 'irreparable' harm. pressherald.com", "2018-01-10T15:14:18.000Z": "First speaker for the event on Human Trafficking is @JanetMillsforME", "2018-01-09T16:51:21.000Z": "I had a great time meeting with the fine men and women of the Southern Maine Labor Council last week! Organized labor is at the front of the fight to protect working- and middle-class Mainers, from tackling sexual harassment in the workplace to pushing for Medicaid expansion.", "2018-01-07T18:20:59.000Z": "Check out my piece in the @bangordailynews on how we can turn the tide of the opioid epidemic:\n\n\"One more overdose is one too many. One more family torn asunder is one too many. One more orphaned child is one too many. Let's make 2018 a new beginning.\" Maine is losing the war against opioids. Here are 10 steps to turn it around. One more family torn asunder is one too many. bangordailynews.com", "2018-01-06T20:33:22.000Z": "Great article on how Dems are poised to retake governorships across the the US! \"Mills... is known for standing up to LePage in many political fights, on issues ranging from health care to declining to sue the federal government at LePage request.\" https:// vox.com/policy-and-pol itics/2018/1/5/16840962/republicans-democrats-governors-races-2018-midterms ", "2018-01-04T16:25:22.000Z": "I hope everyone is staying safe and warm today! If at all possible please stay off the roads (and find a good book to curl up with!). Maine feels blizzard's blast with heavy snow and high winds Mainers are hunkering down as a blizzard that is expected to gradually pick up strength blows through that state Thursday, and bracing themselves for predicted hurricane-strength winds along the... bangordailynews.com", "2017-12-21T17:42:12.000Z": "I had a wonderful time talking (and singing) with Erin Ovalle of @MaineLifeMedia for her show! MaineLeaders - Attorney General Janet Mills - S2 - Episode 38 Attorney General Janet Mills serenades Erin in Farmington, and talks about her hopes for the state. youtube.com", "2017-12-18T16:45:05.000Z": "Why did you join Team Janet? Send us a photo and your reason for supporting Janet for Governor to info@janetmills.com!\n\n-Mike Ambler, Campaign Manager", "2017-12-15T21:46:20.000Z": "Today, I'm announcing that my office will join Democratic AGs across the country in a lawsuit against the FCC to stop the repeal of #NetNeutrality . As AG, and as Governor, I will do everything in my power to oppose this unprecedented threat to the free exchange of ideas online.", "2017-12-15T20:07:50.000Z": "Why did you join Team Janet? Send us a photo and your reason for supporting Janet for Governor to info@janetmills.com!\n\n-Mike Ambler, Campaign Manager", "2017-12-14T18:30:31.000Z": "I had a wonderful time at @FrancoCenterME this morning in Lewiston, serving turkey with state Representative Heidi Brooks and former state Senator Peggy Rotundo!", "2017-12-12T17:34:34.000Z": "The Trump administration's attempt to undermine the @CFPB is a clear case of prioritizing increased profits for a few Wall Street giants over the protection of millions of everyday Americans. I will continue to fight to protect the CFPB's independence. http:// mainepublic.org/post/maine-joi ns-amicus-brief-english-v-mulvaney#stream/0 ", "2017-12-11T22:10:01.000Z": "Dem AG @JanetMillsForME and 17 colleagues have signed onto a brief on behalf of a lawsuit that challenges #Trump 's overreach in appointing the new director of the @CFPB . We need an independent voice that will take on big banks and protect consumers.", "2017-12-10T20:31:53.000Z": "Why did you join Team Janet? Send us a photo and your reason for supporting Janet for Governor to info@janetmills.com!\n\n-Mike Ambler, Campaign Manager", "2017-12-09T15:22:53.000Z": "Why did you join Team Janet? Send us a photo and your reason for supporting Janet for Governor to info@janetmills.com!\n\n-Mike Ambler, Campaign Manager", "2017-12-08T23:41:59.000Z": "Why did you join #TeamJanet ? Send us a photo and your reason for supporting @JanetMillsforME to info@janetmills.com!\n\n-Mike Ambler, Campaign Manager", "2017-12-05T12:47:58.000Z": "I won my first election in a Republican-Independent district by knocking on every door and talking to every voter, and that's how we're going to win this one too.\nTo do that, though, I need your help. Can you join our team? https:// act.myngp.com/Forms/71374402 15364143872 ", "2017-11-30T17:26:28.000Z": "This week, I've joined a coalition of Attorneys General to oppose rolling back the ACA contraception requirement. As Governor, I will continue to fight for a health system that makes affordable and high-quality care available to everyone. http:// maine.gov/ag/news/articl e.shtml?id=772914 ", "2017-11-29T14:28:58.000Z": "Acadia is a treasure held in trust for all Maine people and all Americans; it shouldn't be a playground for the wealthy. I strongly oppose Trump's efforts to double or triple fees to enter national parks across America. Maine AG joins effort to block park fee hike at Acadia Maine Attorney General Janet Mills has joined a bipartisan coalition of 11 attorneys general in writing a letter opposing the National Park Service's proposal to dramatically increase entrance fees... mainebiz.biz", "2017-11-28T16:11:55.000Z": "Since the 2016 election, I've been deeply proud of the way the Democratic Attorneys General across the country have come together to stand up on key issues from environmental protection, to the rights of immigrants, to the need to preserve Net Neutrality. https:// facebook.com/DemocraticAGs/ videos/2100859930134912/ ", "2017-11-26T16:44:52.000Z": "I'm standing against the Trump Administration's attempts to repeal #NetNeutrality , and as Governor, I will continue to oppose this unprecedented threat to the free exchange of ideas online. Attorney General Janet Mills decries FCC repeal of net neutrality rules Attorney General Janet Mills decries the proposal of the Federal Communication Commission (FCC) to repeal the \"net neutrality\" rules put in place by the Obama administration that maintain important... wagmtv.com", "2017-11-22T18:19:07.000Z": "This Thanksgiving, I hope you'll join me in reflecting on our many blessings. I also hope you'll join me in reaching out to those who may be alone as many take pleasure in family and friends.\n\nI wish you and your families a Thanksgiving full of kindness, togetherness and love.", "2017-11-20T13:25:25.000Z": "Great birthday celebration yesterday at the Franco-American Center for the Grand Dame of Lewiston-Auburn, the gracious, dynamic and well-loved Connie Cote!", "2017-11-19T15:52:00.000Z": "Thank you to the Hancock Democrats for hosting me this week! I had a great time discussing the important issues facing Hancock County and our state, from health care and protecting Medicaid expansion to ensuring economic development and new jobs reach all parts of Maine.", "2017-11-18T17:53:15.000Z": "Had a great time touring @MDIBL the other night & learning about their groundbreaking research for diseases like Parkinson's and Alzheimer's. Also so impressed by their work incubating new medical/biopharm companies; just the type of creative solutions needed to grow our economy!", "2017-11-17T16:53:02.000Z": "You never know where the campaign trail will take you! I had a blast on Community Kitchens with Roger Berle, making Fettuccine and Chicken L'orange. Thanks to Roger and and CTN for hosting me, hope you'll check out the show! http:// ctn5.org/shows/communit y-kitchens/community-kitchens-12075 ", "2017-11-11T18:22:51.000Z": "Thinking of dad - a WW2 veteran - this #VeteransDay . So proud of my niece Kate and daughter K, who served with honor in the Army, and my brother Peter's service in Vietnam. I hope you'll join me in thanking those who sacrificed for us. We owe them our freedom and our gratitude.", "2017-11-09T17:09:14.000Z": "Thrilled that ME passed Question 2 by nearly 2:1. Sadly, @Governor_LePage is already trying to sabotage. As AG, 1st battle I fought with LePage was his attempt to kick 1000s of children off Medicaid. We won that fight for the people of Maine, and together, we'll win this one too.", "2017-11-07T17:14:13.000Z": "Remember to get out and #vote today (and please vote yes on Question 2)! You can find polling location info at http:// maine.gov/portal/governm ent/edemocracy/voter_lookup.php ", "2017-11-06T20:36:50.000Z": "I'm voting YES on #Medicaid expansion, which will stabilize hospitals, grow the economy, and save lives. I hope you'll join me. #MEpolitics", "2017-11-02T16:26:28.000Z": "Enjoyed meeting the @UMaineDems Orono chapter! Had a great discussion about jobs, student loans, environmental protection, & opioid epidemic", "2017-10-25T21:25:39.000Z": "Had an informative and lively evening discussing labor's role in revitalizing ME's economy with local @IBEW e-board. Thanks for hosting me!", "2017-10-21T17:44:40.000Z": "Yet again, courts rule against Gov. LePage and his unconstitutional attempts to force my office to join his agenda. Judge throws out LePage lawsuit against Mills A judge has dismissed a lawsuit filed by Maine Gov. Paul LePage against Attorney General Janet Mills. bangordailynews.com", "2017-10-17T01:00:01.000Z": "Taking action to combat the #opioidcrisis is a top priority among our AGs. @JanetMillsforME  http:// pressherald.com/2017/10/15/mil ls-we-need-to-get-the-genie-back-in-the-pill-bottle/ ", "2017-10-13T22:46:09.000Z": "", "2017-10-13T22:45:37.000Z": "", "2017-10-13T22:45:28.000Z": "1) I haven't always agreed w/ @SenatorCollins on every issue, but I've always respected her devotion to public service and Maine people.", "2017-10-09T18:36:31.000Z": "Proud to join 17 fellow AGs to warn White House to expect legal action over allowing employers to exclude contraception from healthcare", "2017-09-26T19:18:41.000Z": "Proud to join fellow @DemocraticAGs in demanding Trump end efforts to roll back rules protecting students w/ debt. https:// attorneygeneral.gov/uploadedFiles/ MainSite/Content/Related_Content/PressReleases/Multistate%20Letter%20to%20DeVos%20re%20federal%20loan%20servicers.pdf ", "2017-09-21T15:51:54.000Z": "Check out our first campaign video, about my track record as AG and the reasons I'm running for Governor! One Maine I'm running for Governor to keep fighting for Maine people. Join me at www.JanetMills.com youtube.com", "2017-09-20T19:39:19.000Z": "As a tail gunner in an A-20 bomber, Bob Francis of Industry flew more than 50 missions during WWII. He had some incredible stories to share!", "2017-09-12T17:32:26.000Z": "Proud to join my colleagues @AGBecerra , @BrianFrosh , and @DMNnews in filing lawsuit over attempt to end #DACA . https:// oag.ca.gov/system/files/a ttachments/press_releases/DACA%20Lawsuit.pdf ", "2017-09-05T21:52:11.000Z": "Please sign our petition to tell Congress to take immediate action to protect #Dreamers from deportation. https:// act.myngp.com/Forms/79693488 9979906816 ", "2017-08-29T17:13:41.000Z": "20 Democratic AGs called on the president to defend DREAMers. #HereToStay  https:// oag.ca.gov/system/files/a ttachments/press_releases/7-21-17%20%20Letter%20from%20State%20AGs%20to%20President%20Trump%20re%20DACA.final_.pdf ", "2017-08-26T21:00:45.000Z": "Had great tour w/ @mainebeerco founder Daniel Kleben. Created 35 local jobs with good pay/benefits (not to mention a pretty darn good beer)!", "2017-08-23T17:04:13.000Z": "Going after companies that prey on sick, elderly, or vulnerable Mainers is priority of my office, and I'll continue that work as Governor. Quote Tweet Consumer Action @consumeraction Three Dietary Supplement Marketers (CogniPrin and FlexiPrin sellers) Settle @FTC , Maine AG @JanetMillsforME Charges https:// ftc.gov/news-events/pr ess-releases/2017/08/three-dietary-supplement-marketers-settle-ftc-maine-ag-charges ", "2017-08-16T21:50:50.000Z": "I hope every public official in Maine will join me in condemning these reprehensible actions in the strongest terms. http:// wcsh6.com/news/local/kkk -flyers-found-distributed-around-boothbay-harbor/464867294 ", "2017-08-12T21:38:10.000Z": "White supremacism is despicable and un-American. My thoughts are with the victims of this violence, and all the people of #Charlottesville .", "2017-08-09T20:46:05.000Z": "Proud to have successfully appealed ruling letting protesters harass women seeking healthcare. @IstandWithPP Maine allowed to enforce law against protests loud enough to be heard inside a building An appeals court overturns a federal injunction against enforcing the state law, which had targeted a protester shouting outside a Planned Parenthood clinic in Portland. pressherald.com", "2017-08-06T23:39:33.000Z": "Had a wonderful time with family and friends celebrating the Blueberry Festival in Wilton!", "2017-08-03T16:35:07.000Z": "The @PressHerald praises AG @JanetMillsforME for her efforts to #ActOnClimate and hold the EPA accountable for failing to protect clean air. Quote Tweet Portland Press Herald @PressHerald Our View: Actions to promote clean air may help Maine breathe easier http:// ift.tt/2hqMsiU", "2017-07-29T20:18:38.000Z": "As of last week, giving police departments Narcan had saved 215 lives. Today it's 215 *human* lives and one dog! Police use Narcan to revive Maine dog The owner flagged down a police officer because she was fearful her dog, Addie, had overdosed on oxycodone. bangordailynews.com", "2017-07-25T17:52:06.000Z": "So many of our kids/grandkids leave town, or Maine, for work. I'll fight for the opportunities they need to stay near family. It's personal.", "2017-07-19T23:38:23.000Z": "Replying to @JanetMillsforME 9/ I'm running for governor for many reasons, but fighting for opportunities for all Maine people is the most important. #wedoitourselves", "2017-07-19T23:38:00.000Z": "Replying to @JanetMillsforME", "2017-07-19T23:37:11.000Z": "Replying to @JanetMillsforME 7/  Example: Maine ranks near the bottom of all states for access to broadband internet. Rural Maine especially. Maine broadband service ranks 49th out of 50 states Despite efforts, speeds are less than the U.S. average and access is limited - problems a group is about to tackle. pressherald.com", "2017-07-19T23:36:25.000Z": "Replying to @JanetMillsforME", "2017-07-19T23:35:18.000Z": "Replying to @JanetMillsforME", "2017-07-19T23:33:54.000Z": "Replying to @JanetMillsforME", "2017-07-19T23:32:45.000Z": "Replying to @JanetMillsforME", "2017-07-19T23:32:26.000Z": "Replying to @JanetMillsforME", "2017-07-19T23:32:02.000Z": "1/ My friends and neighbors have worked at the Jay paper mill for decades. This is devastating news. Jay mill to shut down paper machine permanently, cut 120 jobs The announcement Wednesday by Verso Corp. came after the company had said in November it would idle the key papermaking machine temporarily because of declining customer demand. centralmaine.com", "2017-07-17T14:33:16.000Z": "At Wild Blueberry Land in Columbia Falls! Deeply enjoyed talking to Dell & Marie Emerson but confess that the highlight was truly superb pie", "2017-07-16T00:22:09.000Z": "Had a wonderful time at the Old Hallowell Day parade this morning. Great music, food, and civic spirit! Old Hallowell Day abounds with music, fundraisers, parade, stone carver, more - CentralMaine.com A Down with the Crown booth was set up not far from the high crown in the road on Water Street, which a state project is expected to flatten in 2018. centralmaine.com", "2017-07-11T13:51:24.000Z": "THRILLED our Maine AG Janet Mills has announced her candidacy for Governor!  Be sure to follow her new twitter account @JanetMillsforME !", "2017-07-10T23:39:10.000Z": "I'm running so my grandchildren have the opportunities they need to stay in Maine. Join me: http:// janetmills.com  #wedoitourselves", "2017-07-10T23:35:32.000Z": "I'm running because I've fought for victims of violence and abuse and I know we can do more #wedoitourselves Join me http:// janetmills.com", "2017-07-10T23:33:11.000Z": "I'm running because we need to protect our beautiful wilderness and natural resources. Join me: http:// janetmills.com  #wedoitourselves", "2017-07-10T23:31:19.000Z": "I'm running for Governor because we need an economy that works for all citizens of Maine. #wedoitourselves Join me: http:// janetmills.com", "2017-07-10T23:29:44.000Z": "I'm running for Governor because in Maine, we don't wait for people to fix our problems: #wedoitourselves . Join me: http:// janetmills.com", "2017-07-10T23:28:44.000Z": "I'm running for Governor because we need leadership that unites us, not divides us. Join me today: http:// janetmills.com  #wedoitourselves", "2017-07-10T18:19:03.000Z": "Excited to announce my candidacy for Governor! Together, we'll make Maine the safe, beautiful, prosperous state we all want for our children"}