{"2020-07-27T19:34:30.000Z": "Every issue is a women's issue, but when our leaders make decisions without us, we're set back and left out. @JoeBiden is determined to change that.\n\nRead his new plan to fight for full inclusion & equality for all women: https:// joebiden.com/womens-agenda/", "2020-07-26T17:27:22.000Z": "It me", "2020-07-26T15:56:43.000Z": "It's official -  we only have #100Days until Election Day. \nThe stakes are high, but Michiganders have never been afraid of a challenge. \nWe're going to do this together. \nLet's go Joe Biden for President Events · Mobilize Take action with Joe Biden for President. Find high-impact opportunities near you. mobilize.us", "2020-07-24T20:02:01.000Z": "Extremely on-brand", "2020-07-23T23:59:54.000Z": "On Monday, Michigan's Lieutenant Governor Garlin Gilchrist will be doing a Virtual Q+A! If you'd like to join him (and a special guest ), you can RSVP here: https:// bit.ly/30KFMjn", "2020-07-23T23:01:51.000Z": "If you're in need of some hope during these difficult times, 44 + 46 have got you covered Quote Tweet Joe Biden @JoeBiden Folks, I sat down with my friend President @BarackObama to discuss the significant moment we're in, who we are as a nation, and how we can build back better.   Watch our full conversation: https:// pscp.tv/w/ceg9-TFvUEVM QkJiT2xyS2R8MURYeHlBTURET3l4TcYwhEIouxvdV9bkQGdqEA6FPOOKAO25Gp3ikC23RlSj ", "2020-07-22T19:43:43.000Z": "Summer mood. Quote Tweet Bell's Brewery @BellsBrewery Oberon, filtered. #WearAMask  #NewProfilePic", "2020-07-21T16:28:45.000Z": "Wear your mask, stop the spread. #MaskUpMichigan", "2020-07-21T01:05:20.000Z": "I think we can do better than that. Let's get Dan to 1000 followers tonight Quote Tweet Dan O'Neil @VoteDanONeil Let me try something: I'm running for Michigan's state house to make this state fairer for working people. I ran for this seat in 2018 and lost by 349 votes out of 50,000.\n\nI'm at 288 followers. Can you follow and retweet to help me get to 500?", "2020-07-17T00:58:38.000Z": "Tomorrow, I'm joining @DrBiden for a virtual listening session on @JoeBiden 's plan to help America build back better. RSVP here: https:// mobilize.us/joebiden/event /287715/?source=press-advisory-20200714&refcode=press-advisory-20200714&utm_medium=press&utm_source=advisory&utm_campaign=20200714 ", "2020-07-09T21:21:12.000Z": "Tomorrow, I'm hosting a virtual roundtable with @Andy_Levin on @JoeBiden 's economic recovery plan to create jobs, raise wages, and help America build back better. We'd love for you to join us Michigan Build Back Better Roundtable with Governor Gretchen Whitmer · Joe Biden for President Join Team Joe, Michigan Governor Gretchen Whitmer, and Congressman Andy Levin for a roundtable in Michigan on Joe Biden's economic recovery plan for working families, which will create jobs, raise... mobilize.us", "2020-06-28T01:21:42.000Z": "Wear a mask. Quote Tweet Joe Biden @JoeBiden Wear a mask.", "2020-05-28T23:16:41.000Z": "Wearing a mask isn't about making a political statement or an admission of fear. It's pretty simple - we wear a mask because we care about others. #MaskUpMichigan", "2020-05-17T00:58:40.000Z": "Thank you President @BarackObama . Watching with my 2020 grad. the 3 lessons:\n1. Don't be afraid \n2. Do what's right \n3. Build a community #GraduateTogether", "2020-05-15T22:32:56.000Z": "Quote Tweet EMILY's List @emilyslist Which EMILY's List woman are you?", "2020-04-26T15:02:30.000Z": "Speaking with @charlielangton on @FOX2News this morning, @GovWhitmer says @nbcsnl got the beer wrong last night. \n\n\"We love Canada, but we drink Michigan beer!\"", "2020-04-25T22:56:30.000Z": "I'm joining @JoeBiden to thank our health care workers on the front lines during the #COVID19 crisis. Extraordinary medical providers like Lori are one of the reasons we are going to get through this together. #SOULSaturday Quote Tweet NowThis @nowthisnews A nurse in Michigan sang 'Amazing Grace' to raise the spirits of her fellow health care workers", "2020-03-10T23:53:46.000Z": "( And if you're still in line to register and vote prior to 8pm you can do both!) Quote Tweet Brian Abel @BrianAbelTV \"People should not expect to know the results of Michigan's elections until well into Wednesday.  We hope to get them sooner. We are workin hard to get them sooner, but we want everyone to expect them mid-to-late day on Wednesday\" - @MichSoS 's @JocelynBenson  #MichiganPrimary Show this thread", "2020-03-10T23:04:46.000Z": "Michiganders: if you're in line by the time the polls close, you have the right to vote and make your voice heard! \n\nProblems? Call 1-866-687-8683 (OUR-VOTE)", "2020-03-10T13:55:40.000Z": "Michigan: Election Day is TODAY! Go to http:// Michigan.gov/Vote to find your polling place.", "2020-03-09T16:50:19.000Z": "Detroit - join us tonight with @JoeBiden ! Quote Tweet Team Joe (Text JOE to 30330) @TeamJoe DETROIT: #TeamJoe is heading your way! \n\nJoin @JoeBiden for a get out the vote event TOMORROW! RSVP below. https:// joe.link/2PZ2hwi", "2020-03-07T22:55:05.000Z": ". @garlin said it perfectly - you have to show up for communities in order to win. @JoeBiden has shown up for Michigan, now let's show up for him! https:// mobilize.us/joebiden/event /259596/  Quote Tweet Reverend Al Sharpton @TheRevAl Thank you Lt. Gov Garlin Gilchrist for joining me on #Politicsnation", "2020-03-07T20:26:50.000Z": "Michiganders, it's time to get out the vote! Join us on Monday at 7PM in Detroit for @JoeBiden ! Detroit, MI: Get Out the Vote Event with Joe Biden, Kamala Harris, and Cory Booker · Joe Biden for... Joe Biden is headed to Detroit with Kamala Harris and Cory Booker! Join us on Monday, March 9th for a Get Out the Vote event at Renaissance High School. Doors open at 7:00pm. mobilize.us", "2020-03-06T15:57:54.000Z": "Leadership means showing up, listening, and responding to get things done, and @JoeBiden has shown up for Michigan time after time. He's been there for Detroit, and Michigan, as a friend and a leader. That's why I'm endorsing Joe Biden to be our nominee for president. #StandTALL", "2020-03-05T20:05:42.000Z": "Hi, I'm Gretchen Whitmer. You may know me from my hits, \"Smart Women Will Decide This Election,\" \"If You're On The Clock, You Should Be Paid,\" & my chart-topper \"Fix The Damn Roads\" Quote Tweet Gary Peters @GaryPeters Hi, I'm Gary Peters. You may know me from my hits, \"I've got the Great Lakes in my DNA,\" \"workhorse (not showhorse) of the Senate,\" & my chart-topper \"Betsy DeVos should never have been named Secretary of Education\" twitter.com/JessicaPost/st", "2020-03-05T13:35:34.000Z": "We need a president who will show up and fight for Michiganders, and @JoeBiden has proven time and again that he has our back. I am proud to both endorse him and announce that I will be joining his campaign as a co-chair.", "2020-03-02T14:53:59.000Z": "If the candidate that you voted for via absentee ballot is no longer in the race, you have the option to spoil your ballot and vote for a different candidate. Learn more: Michigan voters get a second chance if they voted absentee for a candidate who dropped out Michigan voters can receive a second chance to pick a candidate who is still in the race. mlive.com", "2020-03-01T22:02:57.000Z": "All women panels? Here for it", "2020-02-26T15:57:15.000Z": "Thank you so much to @DebDingell , who sent over paczkis yesterday for us to enjoy and celebrate the diversity and traditions of our state. Team Whitmer really appreciated them!", "2020-02-21T17:52:29.000Z": "I am proud and excited to say that I am endorsing @jonhoadley for Congress. MI-06 needs someone who isn't afraid to fight for what is right, and I know Jon is just the person for the job. \nJoin us: http:// jonhoadley.com", "2020-02-20T21:26:52.000Z": "Life is never boring with this guy around  #LoveYourPetDay", "2020-02-17T21:17:55.000Z": "Owen Bieber dedicated his entire life to fighting for Michigan's working families. His leadership made our state a better place to live, work, and raise a family. Sending my deepest sympathies to @MIAFLCIO President @RonBieberMI and the entire Bieber family. Quote Tweet Ron Bieber @RonBieberMI My statement on the death of my father Owen Bieber at 90:", "2020-02-10T15:28:41.000Z": "We had a MARVELous day with @ChrisEvans yesterday!", "2020-02-10T02:36:20.000Z": "Look, if you had another shot, another opportunity... Thanks for having me @TheAcademy .  Sorry it took me 18 years to get here.", "2020-02-05T20:05:31.000Z": "Looks like the President's staff waited until the last minute to do their research Quote Tweet Malachi Barrett @PolarBarrett Searches for @GovWhitmer spiked last night shortly before her speech began but quickly returned to normal.", "2020-02-05T14:41:46.000Z": ". @HaleyLive , this was so kind! Thank you for the flowers and the encouragement.", "2020-02-05T03:44:04.000Z": "Remember. Listen to what people say, but watch what they do.  It's time for action. Generations of Americans are counting on us. Let's not let them down. #SOTUResponse", "2020-02-05T03:42:57.000Z": "Democrats want safe schools. We want your water to be clean. We want you to love who you love, and to live authentically, as your true selves. We want women to have autonomy over our bodies. We want our country to be welcoming, & everyone's vote to be counted. #SOTUResponse", "2020-02-05T03:42:19.000Z": "Young people - you inspire us. You know that democracy takes action. You react to a world that is literally on fire with a fire in your bellies. #SOTUResponse", "2020-02-05T03:42:00.000Z": "Governor @JBPritzker is rebuilding roads and bridges in Illinois. @GovMurphy is replacing lead pipes in New Jersey. @GovLauraKelly is working across the aisle to expand Medicaid coverage in Kansas. @GovMLG enshrined ACA protections into New Mexico state law.", "2020-02-05T03:41:19.000Z": "Who fights for hardworking Americans? Democrats. And let me tell you, #DemGovsGetItDone . #SOTUResponse", "2020-02-05T03:40:02.000Z": "Michigan invented the middle class. So, we know - if the economy doesn't work for working people, it just doesn't work. #SOTUResponse", "2020-02-05T03:39:36.000Z": "When the President says the economy is strong, my question is: strong for whom? Strong for the wealthy? Who are reaping the rewards from tax cuts they don't need? #SOTUResponse", "2020-02-05T03:38:19.000Z": "When it comes to health care, here is the truth: Democrats are trying to make your health care better. Republicans in Washington are trying to take it away. #SOTUResponse", "2020-02-05T03:37:28.000Z": "I lost patience for people who are just talk and no action. So, as a state senator, I worked with a Republican governor and legislature to expand health care coverage to more than 680,000 Michiganders under the Affordable Care Act. #SOTUResponse", "2020-02-05T03:37:14.000Z": "It was hard. It exposed the harsh realities of our workplaces, our health care system, and our child care system. And it changed me. #SOTUResponse", "2020-02-05T03:37:02.000Z": "When I was 30, I was up all night with a baby, and during the day, I had to fight my mom's insurance company when they wrongly denied her coverage for chemotherapy. #SOTUResponse", "2020-02-05T03:36:39.000Z": "For me, for so many Americans, health care is personal. Not political. #SOTUResponse", "2020-02-05T03:36:30.000Z": "Bullying people on Twitter doesn't fix bridges - it burns them.  Our energy should be used to solve problems. #SOTUResponse", "2020-02-05T03:36:22.000Z": "When it comes to infrastructure, Monte has tried to do more with a shovel and a pile of dirt than the Republicans in DC have with the Oval Office AND the US Senate. #SOTUResponse GIF", "2020-02-05T03:35:32.000Z": "During my campaign, people told me to fix the damn roads - because blown tires and broken windshields are downright dangerous. And car repairs take money from rent, child care, or groceries.\nAnd we - the Democrats - are doing something about it. #SOTUResponse", "2020-02-05T03:35:01.000Z": "Meet Monte Scott. We wouldn't be surprised if he was giving the #SOTUResponse one day. Fixing 'the damn roads' himself: Boy filling potholes in Muskegon Heights He's already filled 15 potholes on his street. wzzm13.com", "2020-02-05T03:34:37.000Z": "We might be weary of today's politics, but we must stay engaged. Our country, our democracy, our future demand it. We are capable of great things when we work together. #SOTUResponse", "2020-02-05T03:34:24.000Z": "So, instead of talking about what the President is saying, I am going to highlight what Democrats are doing.  After all, you can listen to what someone says, but to know the truth - watch what they do. #SOTUResponse", "2020-02-05T03:34:01.000Z": "I'd need a lot more than 10 minutes to respond to what the President just said #SOTUResponse GIF", "2020-02-05T03:33:21.000Z": "Welcome to the 2020 State of the Union Democratic Response. I'm Gretchen Whitmer, the 49th governor of the great state of Michigan. #SOTUResponse", "2020-02-04T21:57:13.000Z": "Current mood: GIF", "2020-02-04T18:49:13.000Z": "I'm ready. See you tonight. #SOTUResponse", "2020-02-04T17:51:38.000Z": "I learned from the very best. #SOTU2020 Quote Tweet Stacey Abrams @staceyabrams Tonight, @GovWhitmer will remind Americans that our patriotism lives in championing our values, speaking up for the vulnerable and working towards better life for all. She does it each & every day. I'm proud to watch my dear friend give the #SOTU2020 Response + a vision for more!", "2020-01-28T15:20:33.000Z": "Ah, I see you visited my Facebook page! Quote Tweet Lansing Facts @LansingMIFacts Anyone in Michigan: \n*posts about spending money*\n\nFacebook commenters:\nwHaT aBOuT tHe RoAdS?!???", "2020-01-22T20:37:38.000Z": "Today marks 47 years since #RoevWade , but the right for women to maintain autonomy over our bodies is still under attack. As I reminded the Lansing #WomensMarch last weekend, I'm ready to defend the reproductive rights of Michiganders.\n\nWe won't go back.", "2020-01-22T16:31:56.000Z": "I am thrilled to see Michigan is one of the Battleground Build-Up 2020 states! This is a smart, exciting move from the @TheDemocrats that will lay the groundwork to elect Democrats up and down the ticket come November. Quote Tweet The Democrats @TheDemocrats We have *BIG* news to share! The @DNC is proud to announce a new, multi-million dollar investment across six battleground states - AZ, FL, MI, NC, PA, and WI - to continue laying the groundwork for our eventual nominee and Democrats up and down the ballot to win in November. Show this thread", "2020-01-17T14:27:30.000Z": "Hey @UpperPeninsula - if Michigan State wins, will you come home? Your family misses you! Quote Tweet Detroit Free Press @freep No. 14 Michigan State basketball vs. Wisconsin: Scouting report, prediction http:// rssfeeds.freep.com/~/616040848/0/ freep/home~No-Michigan-State-basketball-vs-Wisconsin-Scouting-report-prediction/ ", "2020-01-15T22:02:09.000Z": "Can women win high-stakes elections, @dananessel and @JocelynBenson ?\nWe can, and we did. Quote Tweet CNN Newsroom @CNNnewsroom \"I think every woman who's run has heard the same thing...  I certainly did, and I ran. I gritted my teeth and did the work, and I think that's what women do.\"\n- @GovWhitmer , one of two female politicians cited by Sen. Amy Klobuchar during the #DemDebate . https:// cnn.it/30tgVQy", "2020-01-15T03:43:55.000Z": "Yes, we do Quote Tweet Haley Stevens @HaleyLive That's because Michigan women lead!  https:// mlive.com/public-interes t/2020/01/gretchen-whitmer-gets-shoutout-at-january-democratic-debate.html ", "2020-01-10T01:32:07.000Z": "I spent a year competing for a job against a guy who thought my name was Jennifer. Quote Tweet Aidan Moher @adribbleofink Tell me a story about yourself the sounds like a lie but is absolutely true. Show this thread", "2020-01-09T18:45:26.000Z": "Exciting news in Kansas today! #DemGovs get it done Quote Tweet Governor Laura Kelly @GovLauraKelly I am very pleased to announce today that in true bipartisan fashion, Senate Majority Leader @JimDenning4KS and I reached a compromise proposal to expand Medicaid while lowering health insurance premiums for Kansas families across the state. More details: https:// governor.kansas.gov/governor-senat e-majority-leader-announce-compromise-proposal-to-lower-healthcare-costs-for-kansas-families/ ", "2019-12-25T15:41:43.000Z": "Merry Christmas from our family to yours!", "2019-12-19T16:08:04.000Z": ". @RepDebDingell is an extraordinary public servant, one of the very best Michigan has to offer. I'm grateful she represents our state in Congress, and even more grateful to call her a friend. @realDonaldTrump owes her an apology.", "2019-12-19T01:55:42.000Z": "H.Res.755 - Impeaching Donald John Trump, President of the United States, for high crimes and misdemeanors.\n\nArticle 1: Abuse of Power\nYEA: 230\nNAY: 197\nArticle 2: Obstruction of Congress  \nYEA: 229\nNAY: 198 Quote Tweet Mikenzie Frost @MikenzieFrost President Trump comes out swinging, taking direct aim at @GovWhitmer .\n\n\"She was all about the roads but we aren't fixing potholes,\" he says, touching on the proposed 45-cent gas tax increase that we now have learned isn't happening.\n\nCrowd responds like you expect. #TrumpInBC", "2019-12-18T19:02:06.000Z": "Know that while all eyes are on Washington DC, I'm still laser-focused on doing my job and building a stronger state for the people of Michigan.", "2019-12-18T19:02:05.000Z": "Today is a solemn day for our country, but I believe that @RepSlotkin and @RepHaleyStevens , along with Democrats in the delegation and @justinamash , deserve credit for doing the right thing on a really tough vote.", "2019-11-30T19:28:24.000Z": "Popular opinion: Michigan is by far the best place to be on #SmallBusinessSaturday ! Be sure to drop by your favorite local business for a little holiday shopping today. #shopsmall", "2019-11-27T18:29:57.000Z": "It's officially Football Week in the great state of Michigan. The Game is just a few days away, and this Spartan is rooting for @UMichFootball . You ready for a friendly wager @MikeDeWine ? I'll put a box of @zingermans goodies on the line. #GoBlue", "2019-11-16T19:27:13.000Z": "Do you like my sweater??? #GoGreen", "2019-11-16T17:56:32.000Z": "We're hoping for a great game, and, as always, #GoGreen !", "2019-11-16T17:28:50.000Z": "Tomorrow we'll be back on the same team, but for today #GoGreen", "2019-11-15T18:51:47.000Z": "A little friendly trash talk with @JoiqueBell and @devingardnerXCI before the big game this weekend! #GoGreen", "2019-11-12T19:55:57.000Z": "Quote Tweet Tyler Lykins @lykinstyler Just throwing it out there that every team in the top 6 has a Democratic governor now.", "2019-11-09T16:32:59.000Z": "Add 10 more women! #Thank10Women (Yes, I went over 10... there's too many to thank!) @BridgetMaryMc  @DanaNessel  @JocelynBenson  @stabenow  @RashidaTlaib  @ElissaSlotkin  @HaleyLive  @BrendaLLawrence  @DebDingell  @PaulaMEAPres  @MITreasEubanks  @LieslClark  @HeidiWashington Quote Tweet Tori Saylor @tori_saylor Add 10 more women! #Thank10Women  @gretchenwhitmer  @EileenBelden  @LewisChelsea21  @EVolovsek  @GuliaPickett  @sienacicarelli  @KenzieSheahan  @BunchaBrady  @LibbySaylor  @sammmreid twitter.com/RukmaniBhatia/", "2019-11-06T02:35:49.000Z": "Congratulations, Governor-Elect @AndyBeshearKY ! This is awesome news for the people of Kentucky. Quote Tweet MSNBC @MSNBC BREAKING: Democrat Andy Beshear is the apparent winner in the Kentucky governor race. https:// on.msnbc.com/2WOKqdr Show this thread", "2019-11-04T18:24:20.000Z": "Election Day 2020 is one year away. Don't look back at what you could have done, take action now. \nCheck out @orgcorps2020 's paid trainings at http:// organizingcorps2020.com  #OC2020 Home - Organizing Corps 2020 ORGANIZING CORPS 2020 is recruiting and training first-time organizers so they have the skills and experience to put a Democrat in the White House and win up and down the ticket in 2020. organizingcorps2020.com", "2019-11-01T00:17:57.000Z": "\"Sir, please take a step back from the governor.\" #HappyHalloween", "2019-10-25T15:09:37.000Z": "GIF Quote Tweet Detroit Free Press @freep Oh COME ON", "2019-10-24T19:09:41.000Z": "All smiles for expanding the right to overtime pay.", "2019-09-03T21:36:47.000Z": "Welcome to the party, it's \"Good As Hell\"! Quote Tweet Chief Justice McCormack @BridgetMaryMc I guess I'm super late to the Lizzo party, but really glad I finally got here.", "2019-08-01T12:58:32.000Z": "Over the past couple of days, we heard about big ideas and solutions to the issues we are facing from the candidates running for president in 2020. We are so glad to have hosted the #DemDebate2 right here in the state of Michigan.", "2019-08-01T00:29:29.000Z": "The youngest Gilchrist is having a great time at #DemDebateMI", "2019-07-31T23:37:27.000Z": ". @garlin and I were so glad to meet Charles Barkley at tonight's debate. Thanks for coming to Michigan, Charles!", "2019-07-31T20:34:00.000Z": "Last year @GovWhitmer flipped MIchigan blue! And last night she welcomed 2020 candidates to the state for the #DemDebate . \n \nAmericans deserve a president who will fight for them the way @GovWhitmer fights for everyday Michiganders. Watch her opening remarks:", "2019-07-31T19:33:04.000Z": "Here's the truth: people are less focused on the president's Twitter feed and more worried about feeding their families. Michigan's Governor Is Giving Advice To Democrats Trying To Win The Midwest: Don't Get Distracted... \"People are less focused on the president's Twitter feed and more worried about feeding their families,\" Gretchen Whitmer said in an interview. buzzfeednews.com", "2019-07-30T23:21:49.000Z": "We are thrilled to host this important debate, because the world knows that the path to the presidency goes through the Great Lakes state. #DemDebateMI  #PartyWithTheDems", "2019-07-30T18:14:08.000Z": "\"People in Michigan don't care about the president's Twitter feed. We care about feeding our families,\" Michigan's @GovWhitmer tells CBSN's @CHueyBurns ahead of tonight's Democratic presidential debate in her state https:// cbsn.ws/33417oi", "2019-07-30T14:40:29.000Z": "\"We are not a city of failures. ... That's not who Detroit is.\"\n\nWith all eyes on the Motor City this week for #DemDebate Round 2, here's what the Democratic presidential candidates need to know about our home.", "2019-07-30T11:42:42.000Z": "\"We have to stay focused on what we can get done,\" Michigan @GovWhitmer says about the Democrats' 2020 strategy going into the first of the CNN Democratic presidential debates. #DemDebate  https:// cnn.it/2LRavGi", "2019-07-29T21:01:18.000Z": "Ahead of CNN's #DemDebate in Detroit, Michigan @GovWhitmer says the presidential candidates should be talking about infrastructure: \"We have got water issues all across the country and closing the skills gap through better education.\" https:// cnn.it/2ynYOy8", "2019-07-29T23:29:18.000Z": "We're ready- we'll see you tomorrow. #DemDebateMI", "2019-07-29T20:48:02.000Z": "Just interviewed MI @GovWhitmer in Detroit. Her advice to 2020 candidates:\"Stay focused on the things that really matter. People in Michigan don't care about the president's twitter feed. We care about feeding our families\"", "2019-07-25T14:14:05.000Z": "Cheyna, you hardly miss a beat, but you're waaay behind on this one! To be fair, with the LG, you're always looking  #StandTALL Quote Tweet Cheyna Roth @Cheyna_R Am I the last one to know that ... @LtGovGilchrist  wears awesome shoes with his suits? #LGshoewatch", "2019-07-15T18:25:53.000Z": "Over the next couple of weeks, I'm going to be sharing what is important to Michiganders to hear about from the candidates at the Detroit #DemDebateMI . So tell me - what issues do you want to hear from the 2020 candidates about?", "2019-06-27T00:07:32.000Z": "I believe we have big minds preparing to walk out onto the stage tonight and tomorrow, so I am eager to hear their big ideas!", "2019-06-27T00:07:31.000Z": "As we all prepare to watch the first #DemDebate of many to come, I want to share a favorite quote of mine by Eleanor Roosevelt: \"Big minds discuss ideas, average minds discuss events, small minds discuss people.\"", "2019-06-08T23:35:47.000Z": "Thank you @JulianCastro for coming to visit and talk with the people of Flint. Quote Tweet Michigan Advance @MichiganAdvance Julián Castro 1st of 2020 Dems to visit Flint https:// michiganadvance.com/2019/06/08/jul ian-castro-1st-of-2020-dems-to-visit-flint/ ", "2019-06-07T12:44:11.000Z": "Politicians shouldn't choose their voters. That's why I took @DemRedistrict 's pledge to support fair maps and end map manipulation. It's time to end gerrymandering. #fairmaps", "2019-06-05T00:26:38.000Z": "Thank you @JayInslee for making a trip to Detroit to talk about your plans and ideas!", "2019-06-05T00:06:17.000Z": "Thank you @ewarren for spending the day in Michigan to talk to Michiganders about your plans and the issues we care about!", "2019-06-03T18:58:48.000Z": "Quote Tweet Lansing Facts @LansingMIFacts Maybe while @ewarren is here she can weigh in on cheese inequality Art's Pub only makes the 1% of Lansing's pizza but it uses 99% of Lansing's mozzarella", "2019-05-29T22:26:09.000Z": "Grateful to have the visionary leadership of @staceyabrams at the Mackinac Policy Conference today. #MPC19", "2019-05-15T18:51:06.000Z": "#MILEG |\n  |        \n                               | Fixing the           | \n    damn roads       |\n          |\n  |\n  | Banning a standard\nabortion procedure &\ncriminalizing doctors", "2019-05-06T21:49:49.000Z": "Thank you @KamalaHarris for coming to Michigan to talk about your plans!", "2019-04-02T19:25:00.000Z": "The road to the White House runs right through Michigan! We're proud to host a debate between such a diverse range of candidates. Detroit to host 2020 Democratic presidential debate in July The Democratic National Committee said as many as 20 presidential candidates could be part of the Detroit debate, which could run over two nights freep.com", "2019-03-29T15:27:08.000Z": "\"What's your name?\"\n\n\"Gretchen\"\n\n\"Jennifer?\"\n\n\"No, my name is Gretchen.\" Quote Tweet Devin Nunes' cow @DevinCow \"What's your name?\"\n\"Devin Nunes' Cow\"\n\"May I all you Devin?\"\n\"Are you out of your mind?\" twitter.com/MonicaLewinsky", "2019-03-27T12:11:42.000Z": "Happy Wednesday, Michigan!", "2019-03-19T19:39:27.000Z": "How bad are your local potholes? Quote Tweet brittneybuti @brittneybuti You know the potholes are bad when the local meat market can use it as a billboard advertisement  #potholes  #mipotholes  #potholeseason  @upnorthlive", "2019-03-19T14:10:26.000Z": "Glad to be in such great company! #GoGreen NCAA bracket: School colors, mascots, fight songs and notable alumni Not sure whom to root for? We've collected the basic information on all 68 schools in this year's NCAA men's basketball tournament so you can fake it until you make it. espn.com", "2019-03-18T22:41:45.000Z": "Although I wasn't able to be there in person, I'm grateful to @BetoORourke for coming to Michigan to talk about his plans for our country!", "2019-03-18T22:40:50.000Z": "The road to the White House leads right through Michigan. Thank you @SenGillibrand for coming to the Mitten State to talk about your plans and ideas.", "2019-03-18T13:00:07.000Z": ". @JayInslee  @BetoORourke  @Hickenlooper", "2019-03-17T13:45:38.000Z": "Both @BetoORourke and @SenGillibrand will be in Michigan soon! Quote Tweet Gretchen Whitmer @gretchenwhitmer I'm inviting all of the 2020 presidential candidates to come to Michigan. We want to hear your ideas. @SenGillibrand  @ewarren  @amyklobuchar  @KamalaHarris  @CoryBooker  @BernieSanders  @JulianCastro  @TulsiGabbard  @PeteButtigieg  @JohnDelaney  @marwilliamson  @AndrewYangVFA Show this thread", "2019-03-11T17:07:05.000Z": "We're proud to have the Democratic National Convention here in the Midwest! Quote Tweet The Democrats @TheDemocrats Did you hear the news? We're going to Milwaukee for the 2020 Democratic National Convention! Here are a few things you should know about the city that will host us from July 13-16, 2020. Show this thread", "2019-03-06T20:15:15.000Z": "The #MIBudget that I proposed yesterday includes the biggest investment in public education in a generation.\n\nLearn more at http:// Michigan.gov/mibudget", "2019-03-05T21:08:05.000Z": "This budget presents bold solutions to strengthen our communities, grow our economy, and prepare us for the road to opportunity.\n\nLearn more at http:// michigan.gov/mibudget  #MIBudget", "2019-03-02T21:53:23.000Z": "A pothole that looks like the Lower Peninsula has to be a sign that it's time to #FixTheDamnRoads", "2019-02-27T14:54:27.000Z": "Good morning, Michigan!", "2019-02-25T16:20:52.000Z": "Congratulations to Michiganders Sam Davis and Erik Porn for their work on #Oscar2019 winning movies 'Period. End of Sentence' and 'Vice.' \n\nAnd congratulations to all of the amazing movies and artists who won awards last night!", "2019-02-25T13:00:45.000Z": "I'm inviting all of the 2020 presidential candidates to come to Michigan. We want to hear your ideas. @SenGillibrand  @ewarren  @amyklobuchar  @KamalaHarris  @CoryBooker  @BernieSanders  @JulianCastro  @TulsiGabbard  @PeteButtigieg  @JohnDelaney  @marwilliamson  @AndrewYangVFA"}