{"2020-07-30T17:18:09.000Z": "Yesterday we announced a plan to allocate much-needed funding to programs aimed at supporting at-risk Minnesotans through this pandemic. We're committed to doing all we can to help contain the spread of COVID-19, especially among our most vulnerable citizens. Quote Tweet Lt. Governor Peggy Flanagan @LtGovFlanagan #COVID19 has exacerbated crises that vulnerable Minnesotans face every day. As those who serve at-risk Minnesotans step up, we must support them. That's why we announced $25.8M to help at-risk populations, including $19M toward our homelessness response. https:// mn.gov/governor/news/ ?id=1055-442058 ", "2020-07-30T02:29:52.000Z": "We all want to safely get our economy back on track. The easiest way to move toward that new normal is by wearing a mask. Slow the spread, help our economy, and save lives. #MaskUpMN", "2020-07-29T23:38:08.000Z": "Masking up to protect public health should be easy and accessible.\n\nToday we visited Liberty Packaging as they help distribute 4 million masks across the state. Chambers of Commerce, community groups and businesses have all come together to make this work for Minnesota. #MaskUpMN", "2020-07-28T21:21:07.000Z": "Proud (and not surprised) to see Minnesota's @MayoClinic top this list for the 5th year in a row. Their talented staff and commitment to our Minnesota community have been invaluable during this pandemic, especially in our work to ramp up testing. #MNStrong Mayo ranked nation's No. 1 hospital by U.S. News & World Report | INFORUM ROCHESTER, Minn. -- The banners can stay up another year. For the fifth year in a row, Mayo Clinic Rochester has been ranked the best hospital in the nation by U.S. News & World Report's annual inforum.com", "2020-07-23T17:07:36.000Z": "Some 20,000 SNAP and MFIP recipients must renew their applications in August to continue their benefits for September onward, unless the federal government allows continued flexibility in how the benefits are administered. See the news release: http:// mn.gov/dhs/media/news /index.jsp?id=1053-441259   #SNAP  #MFIP", "2020-07-28T15:57:51.000Z": ". @GwenWalz brings patience and compassion to this work each and every day. These have been some of the toughest months in our state's history, and I've been grateful to have such an incredible partner through it all. Minnesota First Lady Gwen Walz opens up about COVID-19 decisions, aftermath of George Floyd's death Minnesota First Lady, Gwen Walz, told 5 EYEWITNESS NEWS she worked closely with husband, Gov. Tim Walz, in what are considered monumental decisions in the state's history regarding COVID-19 and the... kstp.com", "2020-07-27T23:02:00.000Z": "COVID-19 has reached every county in Minnesota - please take the simple step of wearing a mask to slow the spread. An ounce of prevention is worth (much more than) a pound of cure. #MaskUpMN", "2020-07-27T13:00:00.000Z": "Wearing a mask properly can help slow the spread of COVID-19. Follow these steps to help protect yourself and others. #MaskUpMN  #StaySafeMN", "2020-07-27T02:42:22.000Z": "", "2020-07-26T19:40:16.000Z": "He's at it again. Quote Tweet Governor Tim Walz @GovTimWalz Is he comfortable? No.\n\nIs he making the cat mad by sitting in his favorite spot? Yep.", "2020-07-26T17:37:49.000Z": "Several times I walked across the Edmund Pettus Bridge with John Lewis. Watching his body cross the final time strengthens my resolve to keep fighting the good fight. Quote Tweet CBS News @CBSNews WATCH: The casket of Rep. John Lewis has made the final journey across the Edmund Pettus Bridge in Selma, Alabama. https:// cbsn.ws/2WW5a4z", "2020-07-26T17:00:01.000Z": "Disgraceful, plain and simple. Thank you to the bystanders who stood up to this unacceptable, hate-fueled behavior. Couple flaunt swastika face masks at southwestern Minnesota Walmart At the request of the Marshall, Minn. store, the two were told they'll face arrest if they return there. startribune.com", "2020-07-25T22:15:00.000Z": "PSA: A mask requirement is in effect across Minnesota starting today. Here's a good overview of some FAQs Minnesota's mask mandate: What you need to know Here's what you need to know about Minnesota's mask mandate and what face coverings do to help prevent the spread of COVID-19. mprnews.org", "2020-07-25T19:37:33.000Z": "Photo from a fun day last season with @LtGovFlanagan .", "2020-07-25T19:24:31.000Z": "Good to have you back @Twins . Can't wait to get back to Target Field", "2020-07-23T16:15:06.000Z": "Follow these tips when buying, wearing, and using masks. #MaskUpMN  #StaySafeMN For captions: https:// youtube.com/watch?v=_w2-p4 MsAqU  For translations: https:// health.state.mn.us/diseases/coronavirus/materials/videos.html ", "2020-07-23T00:16:41.000Z": "Hey, Minnesotans! Show us your masks with #MaskUpMN !", "2020-07-24T17:35:55.000Z": "#MNStrong > #MNNice  @GovEvers Quote Tweet Brian Bakst @Stowydad Rivalry: @GovTimWalz playfully picking a fight with neighboring Wisconsin while on North Dakota radio: \"We have the best fishing in  the country. And unlike Wisconsin that counts mudholes as lakes, we do have over 10,000 of them.\" cc: @GovEvers", "2020-07-23T20:38:13.000Z": "We will continue working together to bring meaningful reform. And by the way, if you're not following these dedicated civil servants, you should be. @jbeckerfinn  @RepAishaGomez  @RepHassan  @KaohlyVangHer  @MaryKunesh9  @RepFueLee  @AliceMann4House  @Cmarianirosa  @renamoran", "2020-07-23T20:38:12.000Z": "Today I signed the bipartisan Minnesota Police Accountability Act, which got across the finish line because of the hard work and dedication of the @DFLPOCICaucus . These are long-overdue changes, but they do not end the conversation we're having about police accountability.", "2020-07-23T16:08:38.000Z": "All Minnesotans deserve to feel safe and protected by police. I'm joined by members of the @DFLPOCIcaucus to sign the Minnesota Police Accountability Act. Tune in Governor Walz's 7/23/20 Briefing Update youtube.com", "2020-07-22T20:01:27.000Z": "COVID-19 has uprooted nearly every aspect of our lives. But Minnesotans take care of one another. And right now the best way to demonstrate those Minnesota values is by wearing a mask to protect our neighbors, keep businesses open, and get us back to the activities we love.", "2020-07-22T18:53:07.000Z": "LIVE: At 2pm we'll make an announcement on our efforts to combat COVID-19. Tune in This announcement will also be broadcast live in Spanish, Hmong, and Somali through @tpt , @3hmoobtv , and Somali TV Minnesota. Governor Walz's 7/22/20 Briefing Update youtube.com", "2020-07-22T15:46:28.000Z": "Proud co-worker alert! Quote Tweet Lt. Governor Peggy Flanagan @LtGovFlanagan I'm incredibly honored and humbled to receive the Dr. B. Robert Lewis Award from @MNPublicHealth . Public health, and the impact of health inequities, have never been so front of mind. We must work together to build communities that value and support the health of all Minnesotans.", "2020-07-22T00:12:44.000Z": "A good public health response starts with good data. Proud to see Minnesota leading the nation in #COVID19 reporting and transparency. Former CDC chief: Most states fail to report data key to controlling the coronavirus pandemic The analysis is the first comprehensive review of covid-19 data that all 50 states and D.C. are using to make decisions about policies on mask-wearing and opening schools and businesses. washingtonpost.com", "2020-07-21T22:42:05.000Z": "We're working with @mnhealth to ensure our long-term care facilities have the tools they need to contain COVID-19. This is progress, but we can't lose sight of how dangerous this virus is for our most vulnerable Minnesotans. There's more work to do. Quote Tweet Star Tribune @StarTribune BREAKING: Deaths in long-term care facilities have dropped tenfold since the Minnesota Health Department introduced a five-point plan to address the growth in #coronavirus outbreaks. http:// strib.mn/3jvXcJ8", "2020-07-21T18:57:28.000Z": "We're providing an update on our five-point battle plan to mitigate the impacts of #COVID19 in long-term care facilities. Tune in Governor Walz's 7/21/20 Briefing Update youtube.com", "2020-07-21T17:43:27.000Z": "Major General Jensen exemplifies servant leadership. As Governor and a veteran of the Minnesota National Guard, I have been incredibly grateful for his steady guidance and service to Minnesota. This is well-deserved recognition! U.S. Senate confirms Minnesotan as next Army National Guard director Follow the StarTribune for the news, photos and videos from the Twin Cities and beyond. startribune.com", "2020-07-21T14:53:42.000Z": "Thank you to the communities of color and the People of Color and Indigenous Caucus, who have led this conversation and fought tirelessly for change.", "2020-07-21T14:39:11.000Z": "Everyone deserves to feel safe and protected by police. I look forward to signing these long-overdue reforms to strengthen transparency and community oversight, ban chokeholds and warrior training, expand de-escalation training for officers, and reduce the use of deadly force.", "2020-07-21T14:39:09.000Z": "George Floyd's death brought the urgent need for meaningful police reform into sharp focus.\n\nLast night, the #mnleg passed bipartisan police accountability and reform measures. This is a critical step toward justice.\n\nBut this is only the beginning. The work does not end today.", "2020-07-20T23:55:00.000Z": "Our health care workers have been working around the clock to fight this pandemic. The best way to show you care is by masking up to slow the spread. #MaskUpMN", "2020-07-20T21:57:15.000Z": "The jobs that can't be done from home - growing our food, providing care, and keeping our warehouses stocked - are disproportionately held by people of color. \n \nThese frontline workers deserve wages and benefits that reflect how critical that work is. #StrikeForBlackLives Quote Tweet MPR News @MPRnews Organizers of a national workers strike say tens of thousands are set to walk off the job today in more than two dozen U.S. cities, including Minneapolis, to protest systemic racism and economic inequality that has only worsened during the pandemic. https:// mprnews.org/story/2020/07/ 20/thousands-to-walk-off-job-to-protest-racial-inequality ", "2020-07-20T18:38:58.000Z": "The @Twins are right, it's going to take teamwork to beat COVID-19. #MaskUpMN so we can get back to the things we love (like baseball, for example). Quote Tweet Minnesota Twins @Twins Be a good teammate and #MaskUpMN !", "2020-07-19T18:16:00.000Z": "Happy Sunday, I hope you're getting outside today, Minnesota! Remember your checklist: Sunscreen Sunglasses Mask #MaskUpMN", "2020-07-19T15:49:06.000Z": "Minnesota's flags fly at half staff today to remember and honor the lives of Minnesotans we've lost to COVID-19. We must commit to doing everything we can to slow the spread of this deadly pandemic.", "2020-07-18T14:50:49.000Z": "I will always be grateful to have served with John Lewis, a civil rights leader who never gave up on building a more fair, more equal country. His heart, his ideas, and his legacy will forever be etched in history.", "2020-07-17T15:11:54.000Z": "So many reasons to #MaskUpMN . Quote Tweet Minnesota Timberwolves @Timberwolves Who do you mask up for? #MaskUpMN", "2020-07-17T00:32:27.000Z": "My heart is with Philando Castile's family today. I received a text from his mom, Valerie, this morning reminding me he would've been 37 today. Instead of celebrating, his family is mourning-and calling for action. We must heed their call.", "2020-07-16T14:05:55.000Z": "Unemployment alert! The last week that the additional $600 weekly federal PUC benefit will be paid is the week ending July 25. You can find additional state and local resources at http:// mn.gov/covid19/gethelp", "2020-07-16T23:01:20.000Z": "We need to pass a strong bonding bill because investing in projects like these is an investment in the future of our state. We can energize our local economies and provide good-paying jobs. It can't wait. We're working with the #mnleg to make sure it gets done.", "2020-07-16T23:01:19.000Z": "Henderson MN has seen so many floods they've named their annual celebration Flood Fest. Today we visited a flood mitigation project that needs state funding to move forward - just one of hundreds of investments across the state we've proposed in our Local Jobs and Projects Plan.", "2020-07-16T21:40:41.000Z": "Two Prince-themed masks with your names on them, @ltgovflanagan and @MDHCommMalcolm ! Made in Henderson, MN, home of the original Prince statue.", "2020-07-16T17:20:12.000Z": "Good news, Minnesota. This year there will still be a Princess Kay of the Milky Way. COVID-19 can't stop this MN tradition. Finally, Some Good News (Carved From 90 Pounds of Butter) The state fair is canceled because of the pandemic, but the tradition of sculpting a Minnesota dairy princess out of a block of Grade A salted butter will continue, with a few modifications. nytimes.com", "2020-07-15T21:40:22.000Z": "Our intern program may look slightly different this fall, but it's still a great experience for students looking to make an impact at the Capitol Apply by July 24! https:// mn.gov/governor/conta ct/internships.jsp ", "2020-07-15T16:26:50.000Z": "COVID-19 hasn't changed the fact that rent is due in 2 weeks. But it shouldn't mean Minnesotans lose their homes. That's why we built a $100 million program to help Minnesotans maintain safe and stable housing through this unprecedented crisis. $100 million available to Minnesotans struggling with housing costs People will be able to apply for federal funds through local housing agencies. startribune.com", "2020-07-14T23:55:00.000Z": "As COVID-19 cases spike across the country, we each need to do our part to help our businesses stay open, curb the spread, and protect our neighbors. Wear a mask. It's simple. #MaskUpMN  #StaySafeMN", "2020-07-14T20:47:12.000Z": "Having a home is foundational to Minnesotans' health and safety - that's never been more true than during this pandemic.\n \nToday we announced $100 million in support for Minnesotans struggling with their housing bills due to this pandemic. Everyone deserves a place to call home.", "2020-07-14T19:05:39.000Z": "Stable housing is the first step in maintaining public health. We're announcing a plan to provide housing relief and prevent homelessness amid COVID-19. Tune in Governor Tim Walz on Facebook Watch Stable housing is the first step in maintaining public health. We're announcing a plan to provide housing relief and prevent homelessness amid COVID-19.... facebook.com", "2020-07-14T17:45:00.000Z": "Minnesotans don't joke around when it comes to civic engagement. Great work Minnesota, let's get those last Census forms filled out! Minnesota leads nation in census response Follow the StarTribune for the news, photos and videos from the Twin Cities and beyond. startribune.com", "2020-07-14T16:18:04.000Z": "Reason 1,000,001 to love MN. So awesome. Quote Tweet Lake Superior Photo @LAKSuperiorFoto northern lights and comet #neowise over Lake Superior - great way to start the day! #aurora  #comet  #lakesuperior", "2020-07-12T16:15:01.000Z": "This is where I found Scout. Apparently he wanted to take me for a drive.", "2020-07-11T17:03:20.000Z": "COVID-19 is a serious illness with lasting effects we're just beginning to understand. Please continue to be vigilant in mask wearing, social distancing, and hand washing. After the virus, Minnesota woman faces a hellish recovery Hospitals are reporting better-than-expected survival rates but worse-than-expected complications even after patients have technically recovered. m.startribune.com", "2020-07-11T17:30:28.000Z": "We are the 7th least federally dependent state in America. We subsidize most states. The Trump Administration just turned down @GovTimWalz 's request for disaster relief after the riots. Our congressional delegation should be unified FOR Minnesota - not against Minnesota. Quote Tweet Star Tribune @StarTribune The federal government has denied Gov. Tim Walz's request for aid to help rebuild and repair Twin Cities structures that were damaged in the unrest following #GeorgeFloyd 's death. http:// strib.mn/38MxxGR", "2020-07-11T15:03:53.000Z": "Huge thank you to @HealthFair11 for generously donating @MATTER_ngo snacks to child care programs! Our partners have stepped up in so many ways to serve their communities and support our kids through this pandemic. #StaySafeMN", "2020-07-10T23:11:34.000Z": "I'm asking the Legislature to work together on the urgent matters Minnesotans expect them to tackle this summer. We need Republicans and Democrats to rise to the occasion, pass meaningful police reform, fund local jobs and projects, and help Minnesotans rebuild and recover. Quote Tweet MPR News @MPRnews Gov. Tim Walz summoned lawmakers back for a special session that will begin Monday. He said it's time for a deal on police accountability and public works construction. https:// mprnews.org/story/2020/07/ 10/special-session-part-two-planned-for-monday ", "2020-07-10T20:25:58.000Z": "Keep up the good work, Minnesota. We're not out of the woods - we've got to keep working together. Our View: COVID-19: Minnesota response is working to stop spread Recently released research on COVID-19 cases in the United States shows Minnesota to be one of the top 10 states in stopping the spread and reducing infection rates due to mankatofreepress.com", "2020-07-10T15:23:25.000Z": "This week we passed 700,000 #COVID19 tests. Thank you to all of the frontline health care workers at clinics, long-term care facilities, hospitals and community testing sites, and our partners @UMNews and @MayoClinic for helping increase testing capacity in Minnesota. #StaySafeMN", "2020-07-10T00:10:23.000Z": "Cultural malls aren't just businesses. They're gathering spaces and community hubs that bring vibrancy to our neighborhoods. Proud to visit the Village Market today to highlight funding available to support cultural malls as they navigate the impacts of COVID-19. #MNStrong", "2020-07-09T22:18:02.000Z": "My heart is in West Central Minnesota today, where a family lost a loved one and a community is suffering from unexpected and tragic damage. Tornadoes hit western Minnesota, killing one A 30-year-old man was killed near Dalton when a tornado destroyed a garage where he was working Wednesday night, according to the Otter Tail County Sheriff's Office. Two others suffered non-life-th... mprnews.org", "2020-07-09T21:11:48.000Z": "Make it a habit: phone, keys, mask, and you're ready to go. #MaskUpMN", "2020-07-08T21:45:23.000Z": "No Minnesotan should go to bed hungry or be forced to learn on an empty stomach. Today we announced a $12 million effort to combat hunger during this pandemic. \n\nThank you to the Department of Indian Work for hosting and the incredible work you're doing to support families!", "2020-07-07T23:42:00.000Z": "We're in this together. Mask up, slow the spread, help our economy stay open. #MaskUpMN  #StaySafeMN", "2020-07-07T19:09:52.000Z": "In the face of COVID-19, child care providers have stepped up to provide safe, reliable care. Proud to visit @hamlinecdc to announce a $56 million plan to support the work providers do to educate our little ones, help families, and strengthen our economy during the pandemic.", "2020-07-06T23:49:43.000Z": "Wearing a mask is an easy way to help keep society open and keep each other safe. Why do you #MaskUpMN ? Protect my neighbors 3.8% Keep our businesses open 3.1% Right thing to do 7.7% All of the above", "2020-07-06T21:30:47.000Z": "Philando Castile was killed by a police officer 4 years ago. I've been honored to get to know his mother, Valerie, who has channeled her grief into action. Nothing brings the urgency of police reform to light more than a mother's pain in losing her son.", "2020-07-05T16:48:00.000Z": "States across the country are seeing #COVID19 cases surge - the easiest thing we can all do to keep Minnesota safe and keep our economy open? Wear. A. Mask. #MaskUpMN  #StaySafeMN", "2020-07-04T14:49:01.000Z": "Our founding fathers envisioned a nation where each person was guaranteed life, liberty, and the pursuit of happiness. We're reminded today to keep striving to make those ideals a reality for all Minnesotans. Happy Fourth of July, Minnesota", "2020-07-03T18:46:00.000Z": "Wearing a mask is easy. Closing down our businesses isn't. Help your neighbors, help our businesses. #MaskUpMN  #StaySafeMN", "2020-07-03T01:12:03.000Z": "Chloee played D1 soccer and has been accepted into the Peace Corps in Indonesia.\n\nJake started high school after losing his dad and was critically injured in a BWCA storm. He went on to be a great swimmer and wonderful person. Off to the @UMNews !  So proud of you both. Uncle Tim", "2020-07-03T01:12:02.000Z": "Socially distant graduation for my niece Chloee from Boston University and my nephew Jake from Rochester Mayo. Congratulations to two awesome young adults!", "2020-07-02T23:45:00.000Z": "Hey Minnesota, wear a mask! The more we slow the spread, the better it is for our economy and the small businesses devastated by COVID-19. #MaskUpMN  #StaySafeMN", "2020-07-02T20:48:53.000Z": "Banks and Credit Unions across the state are working with families to provide support. Minnesotans who need assistance can reach out to their lender or @MNHOC .", "2020-07-02T20:48:52.000Z": "Stable housing is the foundation of a healthy life. @ltgovflanagan and I are proud to partner with @AGEllison and over 30 banks and credit unions to provide mortgage relief that will help families make ends meet during this incredibly challenging time. #MNStrong Quote Tweet Attorney General Keith Ellison @AGEllison Affording your life during #COVID19 is tough. That's why @GovTimWalz  @LtGovFlanagan & I have negotiated a framework for mortgage relief with 31 MN credit unions & banks to help homeowners not covered under the CARES Act. Pls seek help if you qualify. https:// ag.state.mn.us/Office/Communi cations/2020/07/02_MortgageReliefOptions.asp ", "2020-07-02T19:45:00.000Z": "The price of insulin has skyrocketed 1200% since 2001. \n \nMinnesotans are celebrating a life-saving program, while Big Pharma once again puts profits ahead of peoples' lives. Minnesota will fight back. 'This fight is not over': Insulin affordability act goes into effect as pharmaceutical industry sues The Alec Smith Insulin Affordability Act is now law, but the fight over insulin costs may not be over. kare11.com", "2020-07-02T02:28:00.000Z": "Today is about freedom, celebration, and community. Wishing all who are celebrating a festive and healthy 60th Somali Independence Day!", "2020-07-02T01:53:03.000Z": "Hachalu Hundessa showed that music could change hearts and minds across the world. My heart goes out to the Oromo community mourning his powerful voice and tireless activism. Quote Tweet Mayor Melvin Carter @MayorCarter Our thoughts are with all those in our community grieving the loss of musician and activist Hachalu Hundessa in Addis Ababa, Ethiopia. As an artist who spoke to the aspirations of our Oromo community, we stand in solidarity will all those whose hearts and minds he touched. twitter.com/nytimes/status", "2020-07-01T20:06:33.000Z": "No Minnesotan should lose their life because they can't afford their next insulin refill. Today our insulin safety net program launched, giving Minnesotans peace of mind in knowing they'll be able to access the medicine they need to survive.", "2020-07-01T18:27:55.000Z": "Own a small business? We allocated $62 million in CARES Act funding to help. Apply by Thursday Quote Tweet MN DEED @mndeed Don't forget! Applications for the Small Business Relief Grant Program will be accepted until 5:00 p.m. on Thursday, July 2. Apply now! https:// bit.ly/2BjAAtI", "2020-06-30T22:34:06.000Z": "Minnesota doesn't just respond in times of crisis-we lead. Minnesota achieves COVID-19 testing 'moonshot' goal This week, the state will surpass the milestone of more than 600,000 tests processed since the pandemic began. That's roughly 10% of the state's population, although some people have been tested more... startribune.com", "2020-06-30T20:24:54.000Z": "Today we announced a public-private partnership to keep MN connected. We'll work together to provide technology and internet access to students across the state.\n \nThis is a team effort. Thank you to @BestBuy , @Comcast , @blandinFound , @spmcfoundations , and @BizPartnership .", "2020-06-30T16:39:35.000Z": "The @DFLPOCIcaucus knows the time for action on police reform is now. They have a plan to bring impactful, structural change, and I am proud to stand by it. OPINION EXCHANGE | Our POCI Caucus has a plan for real police reform Republicans failed to meet us in this moment. startribune.com", "2020-06-29T23:36:40.000Z": "The long-overdue conversation we're having on police accountability isn't over. Minnesota needs REAL reforms to combat racism in our criminal justice system. We'll keep working to pass the @DFLPOCIcaucus reform agenda, because we're in a moment that demands action.", "2020-06-29T20:24:23.000Z": "When Minnesota comes together as one, we can achieve near-impossible tasks. Our testing partnership with @UMNews and @MayoClinic has allowed us to dramatically ramp up testing to more accurately track the course of this pandemic and keep Minnesotans safe. Coronavirus (MN): Gov. Walz Announces Over Half Million Tested In State, Capacity To Test 20,000... On Monday, Gov. Tim Walz announced that Minnesota has hit its \"moonshot\" testing goal of having the capacity for 20,000 COVID-19 tests per day. minnesota.cbslocal.com", "2020-06-29T00:05:30.000Z": "Is he comfortable? No.\n\nIs he making the cat mad by sitting in his favorite spot? Yep.", "2020-06-28T18:36:58.000Z": "We celebrate #Pride because 51 years ago the LGBTQ+ community started a movement for equality and freedom at Stonewall - a fight that continues today. \n\nWe have progress to celebrate and work ahead to ensure everyone can be who they are and live free from discrimination", "2020-06-28T16:24:00.000Z": "It doesn't matter where in Minnesota you live, people expect honesty and results from their government. Especially during the difficult moment we're in, we need to place progress over finger pointing. #OneMinnesota Our View: Politics: What rural areas need from legislators Taking talking points from the increasingly extreme ideology of its national party, the Minnesota GOP spends a great deal of time talking about how rural Minnesota is left behind by mankatofreepress.com", "2020-06-26T02:21:10.000Z": "COVID-19 has caused food insecurity for thousands of Minnesotans and added new burdens on local governments.\n\nThat's why today we announced a $853 million plan to build a stronger, more equitable economy by supporting emergency food efforts and our local governments across MN.", "2020-06-25T23:15:00.000Z": "This pandemic isn't over. The actions we take impact everyone around us. Remember that even if you aren't at a high risk, people close to you might be. Wear a mask, social distance, and stay home if you're sick. #StaySafeMN Minnesota at pivotal moment in COVID-19 pandemic, experts say While the daily number of COVID-19 cases isn't rising as quickly as some other states in the U.S. there are still some alarms sounding as Minnesota continues to reopen. fox9.com", "2020-06-25T22:41:47.000Z": "This is great news for the incredible @MayoClinic staff. It's encouraging to see the people who make Minnesota a national leader in health care get back to work. Mayo Clinic to end furloughs due to quicker-than-expected recovery | Post Bulletin Leaders notified employees on Wednesday that the practice is running about \"85 to 90%\" of pre-pandemic levels. postbulletin.com", "2020-06-24T23:36:00.000Z": "Minnesotans have been loud and clear: It's time for meaningful police accountability and reform. We've waited and debated long enough.\n\nWe need action and we need it now. That's why I am working with the @DFLPOCIcaucus to advance their comprehensive reform package.", "2020-06-24T18:23:16.000Z": "PSA: Minnesotans looking for a boost in the job market can choose from 3,800 free classes in multiple languages. Thank you to @mndeed for creating this partnership! Out of work? Looking for a better job? The state will pay for online classes Residents must enroll by Sept. 30 for online classes paid for by the state. startribune.com", "2020-06-24T00:02:00.000Z": "Our #COVID19 trends are encouraging, and they can stay that way if we each do our part. Wear a mask. Social distance. Get tested. And stay home if you're sick. #StaySafeMN", "2020-06-23T23:17:40.000Z": "Just signed a bipartisan bill to support child care providers and bring relief to working families across the state. This bill will use federal funding to support an industry that so many families rely on, and help Minnesotans afford the high-quality care our little ones deserve.", "2020-06-23T21:03:57.000Z": "COVID-19 has brought historic challenges for our small business owners. Today, applications opened for $62.5 million in relief funding. If you own a small business impacted by COVID-19: Please apply! http:// mn.gov/deed/relief .", "2020-06-23T16:33:59.000Z": "If you attended demonstrations, marches, clean-ups, etc., get tested for #COVID19 . There are free community testing events today and tomorrow in Minneapolis and St. Paul from 11-6. Schedule an appointment here to avoid long lines: https:// health.state.mn.us/diseases/coronavirus/testsites.html   #StaySafeMN", "2020-06-23T18:30:30.000Z": "Youth outdoor sports games will resume tomorrow. I've been a coach - I know how important the discipline, hard work, and teamwork are for our kids. But it should also be safe. Follow our guidelines  http:// staysafe.mn.gov/industry-guida nce/organized-sports.jsp ", "2020-06-22T23:14:22.000Z": "Happy #PollinatorWeek !  Quote Tweet MN Agriculture Dept @MNagriculture . @GovTimWalz has proclaimed this week, June 22-28, as Pollinator Week. Pollinators play an important role in agriculture and \"pollinator species provide significant environmental benefits that are necessary for maintaining healthy, biodiverse ecosystems...\" #MNAg  #PollinatorWeek", "2020-06-22T20:08:16.000Z": "Feeling sick? Help keep the people around you safe. Find a COVID-19 testing site in your community. http:// mn.gov/covid19/for-minnesotans/if-sick/ ", "2020-06-17T19:49:25.000Z": "DEED announces partnership with @coursera to provide free \nonline learning content to Minnesotans. DEED will work directly with Coursera to create accounts for Minnesotans and provide immediate access to online courses: https:// bit.ly/2YaDb1V", "2020-06-21T21:21:06.000Z": "I'll always look up to my dad. He served during the Korean War and grew up working in my grandparents' butcher shop. He worked as hard as anyone I've ever known. And yes, that's me in the bonnet.", "2020-06-21T19:14:03.000Z": "And these two amazing kids remind me every day why I'm so proud to be their dad. We're wishing a happy Father's Day to all the dads out there. Quote Tweet Gwen Walz @GwenWalz \"Any man can be a father, but it takes someone special to be a dad.\" - Anne Geddes. \n\nTim is a dad! Happy Dad's Day! @GovTimWalz", "2020-06-20T23:36:18.000Z": "Happy #PrideMonth , Minnesota  We're celebrating virtually this year but that doesn't mean our continued work toward fair, full, and equal rights for the LGBTQ+ community will rest.", "2020-06-19T23:46:11.000Z": "Today our flags fly at half staff to remember the 1,361 Minnesotans we've lost to COVID-19 and to honor their families. We must work together to slow the spread of this pandemic. Gov. Walz Orders Flags At Half-Staff Friday To Honor COVID-19 Victims Gov. Tim Walz has ordered flags to be flown at half-staff Friday to honor those who have lost their lives to COVID-19. minnesota.cbslocal.com", "2020-06-19T21:09:18.000Z": "Today we commemorate a second Independence Day. June 19, 1865 brought freedom and justice for enslaved Black people in Texas, two years after the Emancipation Proclamation. \n\nWe should honor #Juneteenth as a State holiday, and I am working with the #mnleg to ensure we do.", "2020-06-19T20:19:34.000Z": "We're working to get kids and adults back to the sports they love - safely during #COVID19 . See our timeline and full guidance here: https:// staysafe.mn.gov/industry-guida nce/organized-sports.jsp   #StaySafeMN", "2020-06-19T19:44:20.000Z": "We are writing history. Last night the Minnesota House passed legislation that would bring systemic change. The Senate should not let this moment pass without meaningful police accountability and reform. EDITORIAL | Keep up the pressure for police reforms As federal, state debate continues, here are some critical principles. startribune.com", "2020-06-19T18:44:24.000Z": "Thank you for fighting for this issue. #Juneteenth is an important part of our history, it should be recognized and remembered by our entire state each year. Quote Tweet Pharrell Williams @Pharrell Thank you @GovTimWalz for calling on state Legislature to make Juneteenth a state holiday in Minnesota. It was great speaking with you.", "2020-06-18T18:43:25.000Z": "The time to address systemic racism and address police reform is now. The 28 recommendations and 33 action steps outlined earlier this year by the state's Working Group on Police-Involved Deadly Encounters provided a roadmap for change. Learn more: http:// ow.ly/BPam50AbFwP", "2020-06-19T16:24:06.000Z": "The Minnesota Small Business Relief Grants Program will begin accepting applications on June 23. More than $60 million available in grants to small businesses affected by COVID-19: https:// bit.ly/3hCAkGG", "2020-06-19T12:07:50.000Z": "We get powerful results when we center those most impacted. Thank you to the @DFLPOCIcaucus for your tireless work on the Minnesota Police Accountability Act. I'm grateful to the @mnhouseDFL for taking real action. The MN Senate has the opportunity to do the same. #mnleg Quote Tweet MNHouseInfo @MNHouseInfo #mnhouse votes 71-59 to pass SSHF93/SSSF104*, as amended to merge three policing reform bills into 'The Minnesota Police Accountability Act.' The measures championed by the @DFLPOCIcaucus now go to the Senate. #mnleg", "2020-06-18T20:59:32.000Z": "As a 24 year veteran of the National Guard, it was an honor to meet with Chief of the National Guard @ChiefNGB yesterday, and to thank our members for always answering the call to serve.", "2020-06-18T19:26:50.000Z": "Today the Minnesota House will act on police reform that would deliver real changes to our broken system. These ideas are grounded in months of research and conversations with community. House DFL poised to approve wide-ranging police reform package - Minnesota Reformer A handful of states across the country have already passed police reforms - including New York, Iowa, Colorado and California - in the wake of the Minneapolis police killing of George Floyd. minnesotareformer.com", "2020-06-18T16:57:44.000Z": "This is great news for our country and our state. DREAMers know no other home. They are #HereToStay . Supreme Court rejects Trump bid to end young immigrants' protections The Supreme Court on Thursday rejected President Donald Trump's effort to end legal protections for 650,000 young immigrants, the second stunning election-season rebuke from the court in a week after... startribune.com", "2020-06-18T14:56:55.000Z": "TUNE IN: We're discussing police reform and accountability with @ltgovflanagan , @AGEllison , @melissahortman , legislators, and public safety officials. Governor Walz's 6/18/20 Briefing Update youtube.com", "2020-06-17T23:46:43.000Z": "Thanks for having me! Quote Tweet AgriGrowth @mn_agrigrowth Thanks to MN @GovTimWalz for joining our #USMCA event today. Your words about how the voice of #Minnesota  #agriculture is heard every day in your administration is greatly appreciated, & we're thankful for your partnership and leadership. #AgriGrowth  #MNAg", "2020-06-17T22:41:19.000Z": "Our Local Jobs and Projects plan will create jobs and rebuild infrastructure in communities in every corner of our state. Proud to work with these folks to make sure we get it done. Quote Tweet MN Building Trades @MNBldgTrades Let's get a Bonding Bill for Minnesota communities done THIS WEEK. With ... @GovTimWalz  ... @LtGovFlanagan  ... @iupat82  ... @LIUNAMinnesota  @ibew292 ...... @CityofRedWingMN  #mnleg", "2020-06-17T21:12:30.000Z": "I can only do so much, Minnesota. Finding Bigfoot: Governor Tim Walz Spotted in Sasquatch Shirt The official Twitter account for Minnesota Governor Tim Walz posted a photo Tuesday evening showing the Governor signing a $62 million Covid-19 relief bill while wearing a short-sleeve Sasquatch-pr... wedgelive.com", "2020-06-17T20:57:55.000Z": "The People of Color and Indigenous (POCI) caucus put together a package of 21 bills that will bring greater police accountability. Their ideas capture the change Minnesotans are asking for, and they must be heard by the Senate. Quote Tweet Minnesota Senate DFL @SenateDFL This year, the Senate DFL proposed 21 new criminal justice reform bills led by members of color. Not a single one got a hearing from Senate Republicans. Show this thread", "2020-06-17T20:12:29.000Z": "Friendly reminder: Wear a mask to protect the people around you and help slow the spread. #StaySafeMN", "2020-06-17T00:35:11.000Z": "Today I approved $62 million in direct assistance for our small businesses, with a focus on our Black, Brown, Indigenous, veteran, female, and Greater Minnesota business owners. It's an important piece of our plan to build a stronger and more equitable economy.", "2020-06-16T20:30:23.000Z": "We can jumpstart our economic recovery by investing in local jobs and projects. We're working with the #mnleg to pass our plan to support communities in every corner of our state by rebuilding aging roads and bridges, investing in water infrastructure, and putting people to work.", "2020-06-16T18:59:10.000Z": "We're discussing our Local Jobs and Projects plan, which is part of our effort to build a stronger, more equitable economy. Tune in. Governor Walz's 6/16/20 Briefing Update youtube.com", "2020-06-16T16:41:46.000Z": "This is not the time for smaller and slower reform. \n\nThe clock is ticking Minnesotans want to see police accountability now. Quote Tweet MPR News @MPRnews The MN House moved a DFL-crafted plan for greater police accountability through 3 committees Monday after a marathon hearing this weekend. Senate Republicans are set to begin working on a smaller plan, as some in the GOP say the House is moving too quickly https:// mprnews.org/story/2020/06/ 16/house-democrats-move-quickly-on-police-changes ", "2020-06-15T23:47:00.000Z": "Happy birthday to my best friend. I'm so grateful to have you by my side, @GwenWalz .", "2020-06-15T21:28:58.000Z": "Our inability to confront the past has a direct impact on systemic issues we face now.\n\nIt was humbling to hear the painful stories community leaders shared about this terrible chapter in our history, and their ideas to use this moment to bring change. 'An unbroken line': Gov. Tim Walz connects Duluth lynchings 100 years ago to George Floyd's death A masked and socially distant Gov. Tim Walz got a tour of Duluth's painful history Monday morning, exactly 100 years after a white mob lynched three black men, Elias Clayton, Elmer Jackson and Isaac... startribune.com", "2020-06-15T19:10:41.000Z": "To truly be One Minnesota, we need to dismantle the systems of oppression that led to the deaths of Clayton, Jackson, and McGhie 100 years ago, and that led to the death of George Floyd just 3 weeks ago. Today I met with Duluth leaders to discuss how we can and will move forward. Quote Tweet Katie Galioto @katiegalioto The governor is sitting in a (socially distant) circle with a group of 10 Duluth residents, all people of color. Says there's \"an unbroken line\" between the lynchings 100 years ago and George Floyd's death. Show this thread", "2020-06-15T17:42:27.000Z": "This is great news and a big step forward for civil rights, but a stark reminder of all the work we have left to do to achieve equality and basic protections for all. Supreme Court Delivers Major Victory To LGBTQ Employees The Supreme Court says the federal ban on discrimination \"based on sex\" applies to gay, lesbian and transgender employees. npr.org", "2020-06-15T16:45:38.000Z": "On Friday, we issued the state's first posthumous pardon to Max Mason, who was wrongfully convicted and used as a scapegoat for the lynching. Read about Mason's story Minn. grants state's first posthumous pardon Max Mason was convicted in 1920 of assaulting a white woman in Duluth. She claimed she had been raped by six black circus workers. mprnews.org", "2020-06-15T16:45:37.000Z": "Today I visited the memorial for Elias Clayton, Elmer Jackson, and Isaac McGhie, 100 years after they were lynched in Duluth and accused of a crime they did not commit.\n \nWe can never forget this shameful, tragic event in Minnesota's history.", "2020-06-14T18:32:23.000Z": "This #FlagDay  we are reminded that fairness, equality, and justice don't come free. We must continue to fight for and model the values our Nation's flag stands for.", "2020-06-14T01:00:39.000Z": "Minnesotans are asking us to think bigger. We need to meet this moment, not by half measures or checking a box, but with meaningful reform and police accountability. Quote Tweet Star Tribune @StarTribune Minnesota legislators clashed sharply on Friday as top Republicans rejected much of a sweeping DFL package of police reforms brought in response to the death of #GeorgeFloyd in Minneapolis police custody. http:// strib.mn/2Ao9YYs", "2020-06-13T01:09:49.000Z": "The world is watching. https:// nytimes.com/aponline/2020/ 06/12/us/politics/ap-us-george-floyd-minnesota-legislature.html ", "2020-06-12T23:09:49.000Z": "Dan Hall and Jerry Relph also serve on the senate public safety committee. Tell them not to let Senator Limmer block these accountability measures.", "2020-06-12T22:11:06.000Z": "Karin Housley is a Minnesota Senate Assistant Majority Leader. Tell her Minnesotans have waited long enough for action on police reform.", "2020-06-12T22:09:02.000Z": "Warren Limmer is the Senate Public Safety chair. He can give these bills a public hearing. Tell him Minnesotans want action.", "2020-06-12T22:09:01.000Z": "Paul Gazelka is the Senate Majority Leader. He decides which bills reach the Senate floor. Tell him not to block police reform and accountability.", "2020-06-12T21:44:16.000Z": "Minnesotans, call your GOP State Senators. Make your voices heard. Minnesota Senate GOP to block most policing overhaul plans Key Republican lawmakers in Minnesota said Friday that they'll block most of the ambitious changes Democrats want to make to policing in the state where George Floyd died, and that they plan to... startribune.com", "2020-06-12T17:04:51.000Z": "Today, 100 years after Max Mason was wrongfully convicted, I granted him a pardon. It's critical that we take time to grapple with our state's history of racism. Quote Tweet Star Tribune @StarTribune Max Mason, a \"scapegoat\" for a mob that lynched three innocent black men in Duluth 100 years ago, has been cleared of his century-old rape conviction. On Friday morning the Minnesota Board of Pardons granted Mason the state's first posthumous pardon. http:// strib.mn/3e35s04", "2020-06-11T23:00:41.000Z": "Today @LtGovFlanagan , #mnleg leaders, the People of Color and Indigenous Caucus and I announced a set of reforms to make meaningful changes to our law enforcement system. Minnesotans are demanding real change. We stand united in our commitment to getting this done. Quote Tweet WCCO - CBS Minnesota @WCCO On Thursday, @GovTimWalz and state legislators representing Minnesota's People of Color and Indigenous Caucus made a call for specific reforms to Minnesota law they say will support racial justice. | https:// cbsloc.al/2MML1sd", "2020-06-11T19:54:15.000Z": "I'm joining @ltgovflanagan , Minnesota House and Senate leaders, and the @DFLPOCICaucus to announce our police accountability and reform priorities for the upcoming special legislative session. Tune in live: Governor Walz's 6/11/20 Briefing Update youtube.com", "2020-06-10T21:22:58.000Z": "When the legislature reconvenes on Friday, we plan to work together to pass police reform and accountability and build a stronger and more equitable economy. \n\nMinnesota is at a turning point. We need to seize this opportunity and create meaningful change.", "2020-06-10T20:07:42.000Z": "LIVE: We're holding a press conference to discuss police accountability and our plan to build a stronger and more equitable economy. Tune in Gov. Walz holds press conference Gov. Tim Walz is expected to address police accountability, COVID-19 and efforts to restart the economy as he announces a special session set to start on... facebook.com", "2020-06-10T18:14:31.000Z": "After spending significant time out in our communities the past two weeks, @LtGovFlanagan and I each got a #COVID19 test yesterday (they turned up negative). It was quick and painless and we urge any Minnesotan who has spent time in a crowd or has symptoms to do the same. Quote Tweet Lt. Governor Peggy Flanagan @LtGovFlanagan Minnesotans: Remember to get tested for #COVID19 if you have been crowded spaces these last few weeks. I got tested yesterday, and it was quick, easy, and a relief when my test came back negative. Find out when and where to get tested here: https:// mn.gov/covid19/for-minnesotans/if-sick/testing-locations/index.jsp ", "2020-06-10T16:11:29.000Z": "As members of the @mnnationalguard prepare to return to their homes and families, I was grateful for the chance to share my gratitude for their service. Thank you for keeping Minnesotans safe.", "2020-06-09T22:31:12.000Z": "Let's keep it up, Minnesota, and make sure that EVERY Minnesotan is counted. Fill out your census while staying safe by phone, web, or mail today. Or check in with friends and family to remind them to be counted too! #WeCountMN  https:// my2020census.gov", "2020-06-09T22:07:50.000Z": "Thank you, Minnesotans, for the sacrifices you've made to slow the spread of COVID-19. As we carefully turn the dial toward reopening society tomorrow, it's more important than ever that we each do our part to keep each other safe.", "2020-06-09T21:46:38.000Z": "Minnesotans, if you recently attended a demonstration, vigil, or community cleanup, thank you for using your voice for change. \n\nKeep looking out for your communities and get a test to avoid spreading #COVID19 . Find a clinic near you. #StaySafeMN  http:// mn.gov/covid19/for-minnesotans/if-sick/ ", "2020-06-09T14:31:31.000Z": "In honor of the funeral for George Floyd, we ask all Minnesotans to spend 8 minutes and 46 seconds in silence at 11am this morning.", "2020-06-09T01:22:36.000Z": "Today we visited St. Paul businesses that lost generations of blood, sweat, and tears to damage in recent weeks. To them, rebuilding is about more than the storefront, it's about maintaining their community's vibrancy and giving back. We are are committed to rebuilding, together.", "2020-06-08T23:59:14.000Z": "Replying to @GovTimWalz Tom Johnson was indeed a giant.   His compassionate work on behalf of victims of clergy sexual abuse was inspiring.  We are a better Church and a better community because of Tom.  May the God whom he served so well now bless him with eternal rest.", "2020-06-08T22:52:24.000Z": "Tom was a giant. As a voice for the voiceless, a passionate pursuer of justice, a loving husband, and a wise and good-humored father, he made a generational impact on our state. I'm forever grateful for his friendship, his counsel, and his family's contributions to Minnesota. Quote Tweet Amy Klobuchar @amyklobuchar Today former Hennepin County Attorney Tom Johnson passed away. Tom was my friend, neighbor & mentor. He always did good, from his groundbreaking work on domestic abuse, his focus on race & justice, his principled stand against the death penalty. Show this thread", "2020-06-08T22:30:52.000Z": "We created a resource to meet families' basic needs following the destruction of critical businesses in our communities.\n \nIf you know someone looking for help with food, child care, or mental health support, please share this with them: http:// mn.gov/portal/residen ts/response-resources.jsp ", "2020-06-08T18:19:45.000Z": "Minnesota has completed over 11,000 tests on average over the past 5 days. Tests are available and they're a valuable tool to curb the spread of COVID-19. \n \nFind a provider near you  http:// mn.gov/covid19/for-minnesotans/if-sick/ ", "2020-06-07T17:21:42.000Z": "I'm grateful to have Nic by my side helping keep Minnesotans informed. She makes it look easy, but she works day and night to provide an incredibly important resource. Thank you! Meet Nic Zapko. Her face and hands explain Gov. Tim Walz's words to the deaf. Her work has been featured in newscasts around the world, and she has been praised on social media for her expressive delivery. twincities.com", "2020-06-07T16:04:28.000Z": "This is a heartbreaking loss for Minnesota. Gwen and I are keeping Marny's family and friends in our thoughts today. We know that countless Minnesota families will remember and cherish her lifelong work in and outside the classroom to create a better future for our students. Quote Tweet MN Dept. Education @MnDeptEd MDE offers our condolences to Marny Xiong's family and friends, and the whole @SPPS_News community. Chair Xiong tirelessly fought for a system that would work for and lift up its students. She was an SPPS graduate who spent her entire life investing her talents in her community. Show this thread", "2020-06-06T23:45:57.000Z": "Today we remember the bravery of the soldiers who stormed the beaches of Normandy 76 years ago. Their sacrifice helped bring us out of one of the darkest chapters in our history and paved the way for the end of World War II. #DDay", "2020-06-06T01:40:00.000Z": "Today we visited three areas that were devastated this past week. Amid the physical damage, we saw real signs of resilience and hope. Communities have already begun to rebuild.\n \nBut there is a lot of work ahead. We must commit the resources needed to rebuild together.", "2020-06-05T21:32:16.000Z": "Today our office and the City of Minneapolis announced immediate changes the MPD will take to address systemic discriminatory practices. From banning chokeholds to requiring officers to intervene when they see inappropriate force, these are important steps toward accountability. Quote Tweet Minnesota Department of Human Rights @mnhumanrights On Tuesday, we announced a civil rights investigation into the Minneapolis  Police Department. Today, we filed an emergency court action and an agreed proposed court order that details immediate structural changes that the police department must implement. Show this thread", "2020-06-05T20:25:06.000Z": "We will continue to follow the guidance of public health experts and make data-driven decisions. We're ramping up testing efforts and requiring that companies have a COVID-19 preparedness plan to protect those headed back to work.", "2020-06-05T20:25:05.000Z": "Today we announced a gradual turning of the dial toward re-opening society. With safety measures in place, indoor dining, gyms, and entertainment venues can begin to re-open on Wednesday, June 10.", "2020-06-05T19:00:55.000Z": "LIVE: We're giving an update on the next steps in our response to COVID-19. Tune in here: https:// facebook.com/watch/?v=73259 4404153246  This announcement will also be broadcast live in Spanish and Hmong through @tpt and @3hmoobtv . Gov. Walz holds update on state's COVID-19 response Gov. Tim Walz and other state officials will hold a press conference around 2 p.m. today to announce next steps in the state's response to COVID-19.... facebook.com", "2020-06-05T00:00:18.000Z": "Reminder: A curfew goes into effect in St. Paul and Minneapolis at 10 p.m. The best way to stay out of harm's way is to stay home. Thank you to those Minnesotans that are helping keep their communities safe. #MACCMN", "2020-06-04T22:06:32.000Z": "Anyone who demonstrated should receive a test for COVID-19.\n \nIf you think you've been exposed, get a test 5 days after the event. If that test turns up negative, get tested again 14 days after the event.\n \nIf you start to experience symptoms, get tested right away. #StaySafeMN Quote Tweet mnhealth @mnhealth If you have symptoms of #COVID19 , you should get tested. This video explains who should get tested, where to get tested, and how to get your results. #StaySafeMN Show this thread", "2020-06-03T13:47:46.000Z": "\"...I worry about white politicians appropriating black pain.  But this is personal for me...I have I become friends with mothers only because their sons were killed...I don't think we get another chance to fix this in the country.  I don't think this is hyperbole. @GovTimWalz", "2020-06-03T19:17:12.000Z": "We recommend that any Minnesotan who has attended a protest, vigil, or community clean-up get tested for #COVID19 . If you start to feel sick, get tested right away. If you do not feel sick, get tested as soon as you can, but no later than 5-7 days after the event. (1/2)", "2020-06-03T23:02:18.000Z": "This civil rights charge is an important step toward comprehensive and urgent systemic change. Let's make this just one of many accountability measures to come from this harrowing week. Minnesota Department of Human Rights files civil rights charge against Minneapolis Police Department According to a release from Gov. Tim Walz's office, the Department of Human Rights will seek agreement from city leadership and MPD to immediately implement interim measures in advance of long-term... kstp.com", "2020-06-03T22:01:26.000Z": "LIVE: We're responding to @AGEllison charging all four officers involved in George Floyd's death, and providing an update on public safety concerns. Tune in here: http:// facebook.com/pg/MPRnews/pos ts/?ref=page_internal ", "2020-06-03T20:13:36.000Z": "What will our young people learn about this moment? Will his death be just another blip in a textbook? Or will it go down in history as when our country turned toward justice and change? It's on each of us to determine that answer.", "2020-06-03T20:13:35.000Z": "I laid flowers at George Floyd's memorial this morning. As a former high school history teacher, I looked up at the mural of George's face painted above and I reflected on what his death will mean for future generations.", "2020-06-03T18:44:30.000Z": "Minnesotans need more than ever to lean on their neighbors, show up for their communities, and add their voice to this urgent conversation on addressing our systemic problems. Thank you for doing those things peacefully - we again ask you to plan to stay inside beginning at 10.", "2020-06-02T23:05:23.000Z": "REMINDER: a curfew remains in effect tonight from 10pm to 4am in Minneapolis-St. Paul. Thank you for honoring this curfew to help keep our neighborhoods safe, Minnesota.", "2020-06-02T19:24:27.000Z": "Our Minnesota Department of Human Rights today filed a civil rights charge against the MPD. @mnhumanrights will investigate the department's policies, procedures, and practices over the past 10 years to determine if they engaged in systemic discriminatory practices.", "2020-06-02T17:47:39.000Z": "We're providing an update on next steps in the state's response to George Floyd's death at 2:00pm. You can tune in on your local media station.", "2020-06-02T02:25:14.000Z": "Your Citizen-Soldiers and Airmen stand with peaceful protestors today, protecting our freedom to peaceably assemble. #OneMinnesota  #AlwaysReady  #AlwaysThere", "2020-06-02T01:26:25.000Z": "Minnesotans have responded this week the way they always do when they see a neighbor in need - by donating, volunteering, and organizing for their community. If you're wondering how you can help rebuild, here's a good place to start Need help? Want to help? Twin Cities groups offer resources for folks hurt by riots Groups are gathering donations and planning cleanup events. m.startribune.com", "2020-06-01T20:04:08.000Z": "A curfew is set in Minneapolis-Saint Paul from 10pm-4am Monday and Tuesday. Please comply with the curfew to protect yourself and your community.", "2020-06-01T16:11:46.000Z": "We're providing an update on the situation in Minneapolis and St. Paul at 11:30am. You can tune in on your local media station or on our YouTube page here: Office of the Governor of Minnesota This is the official YouTube channel for the Office of the Governor of Minnesota. Please find more information on the Walz-Flanagan Administration on our web... youtube.com", "2020-06-01T01:06:40.000Z": ". @GovTimWalz  #JusticeForGeorgeFloyd", "2020-06-01T03:18:32.000Z": "We're providing an update on the situation in Minneapolis and St. Paul at 10:30pm. You can tune in on your local media station.", "2020-06-01T01:55:21.000Z": "CURFEW NOW IN EFFECT in Minneapolis and St. Paul Please allow our law enforcement to focus response and resources on the legitimate threats attacking our communities. Officers will enforce the curfew & arrest those who refuse to comply. #MACCMN", "2020-06-01T01:56:11.000Z": "Having @AGEllison lead this prosecution keeps faith with our commitment to ensure justice for George Floyd. Thank you, Attorney General. I can think of nobody better to do this critical work. Attorney General Keith Ellison To Lead Prosecution Of George Floyd's Death Gov. Tim Walz announced Sunday that he has asked Attorney General Keith Ellison to assist Hennepin County Attorney Mike Freeman in the forthcoming case surrounding the death of George Floyd. minnesota.cbslocal.com", "2020-06-01T00:39:00.000Z": "From DPS Commissioner Harrington: From the footage we are seeing on @MnDOT cameras, it appears the semi was on I-35W as authorities were closing the road. It didn't appear to drive through any barricades. Driver released from the hospital & under arrest. #MACCMN", "2020-05-31T23:34:16.000Z": "Very disturbing actions by a truck driver on I-35W, inciting a crowd of peaceful demonstrators. The truck driver was injured & taken to a hospital with non-life threatening injuries. He is under arrest. It doesn't appear any protesters were hit by the truck. #MACCMN", "2020-05-31T23:26:24.000Z": "We're providing an update on the situation in Minneapolis and St. Paul at 7:00pm. You can tune in on your local media station.", "2020-05-31T21:38:33.000Z": "IMPORTANT UPDATE: Road closures will now begin at 5PM, and will be more extensive than previously planned. Quote Tweet Minnesota Department of Transportation @MnDOT Highway closures will be in effect again tonight beginning at 8PM. Please note some changes from last night's closures:\n\n I-35W north/south btwn Hwy 280 & Hwy 62\n I-94 east/west btwn I-694 & Hwy 280\n I-394 east btwn Hwy 100 & I-94\n Hwy 55 north/south btwn Hwy 62 & I-94", "2020-05-31T19:37:27.000Z": "Highway closures will be in effect again tonight beginning at 8PM. Please note some changes from last night's closures:\n\n I-35W north/south btwn Hwy 280 & Hwy 62\n I-94 east/west btwn I-694 & Hwy 280\n I-394 east btwn Hwy 100 & I-94\n Hwy 55 north/south btwn Hwy 62 & I-94", "2020-05-31T17:34:22.000Z": "We cannot simply go back to the place we were before. That place is not good enough. If we do not fix the systemic issues, we will be back to a point with our communities on fire, our security and safety in question, and a searching for who we are.", "2020-05-31T17:34:21.000Z": "Minnesota consistently ranks highly for our public schools, innovation and opportunity, and happiness - if you're white. If you're not, the opposite is true. Systemic racism must be addressed if we are to secure justice, peace, and order for all Minnesotans.", "2020-05-31T16:36:41.000Z": "The curfew on Friday and Saturday night allowed our law enforcement to target those who meant to do harm to our communities. Law enforcement made several arrests and seized weapons, narcotics, long guns, handguns, magazines and knives.", "2020-05-31T14:27:53.000Z": "We're providing an update on the situation in Minneapolis and St. Paul at 9:30am. You can tune in on your local media station.", "2020-05-31T03:25:54.000Z": "We're providing an update on the situation in Minneapolis and St. Paul at 10:30pm. You can tune in on your local media station or on our YouTube page here: Governor Walz's 5/30/20 Briefing Update youtube.com", "2020-05-31T02:33:50.000Z": "We now have more than 4,100 - quickly moving toward 10,800 - Minnesota Citizen-Soldiers and Airmen supporting our friends and neighbors in the Twin Cities. This is a significant increase over the 700 on-duty Friday. We live here. We work here. We serve here. We're all in.", "2020-05-31T02:50:53.000Z": "If you're out now, please go home. If you know someone out right now, please tell them to go home immediately.", "2020-05-31T02:20:59.000Z": "We are bringing the full force of goodness and righteousness to restore order on our streets tonight. Please be safe, please help our communities, and please stay home.", "2020-05-31T01:30:05.000Z": "IMPORTANT REMINDER: If you are out patrolling the street, our response teams cannot know if you are there to do damage or to protect and will divert resources to find out. Help us by staying home and staying safe. #MACCMN", "2020-05-31T01:13:05.000Z": "Stay safe and stay home, Minnesotans. Tonight's curfew begins at 8p.m. and ends at 6 a.m. on Sunday. If you are home, please stay there. If you are not, make a plan to get home now. For questions on the curfew, visit https:// dps.mn.gov/macc/Pages/faq .aspx ", "2020-05-31T00:39:40.000Z": "At 8pm tonight, it is time to separate out those protesting peacefully in pursuit of justice from those who wish to undermine this movement through chaos. I urge all to respect the curfew in the Twin Cities as we take necessary action to protect the safety of our communities.", "2020-05-30T23:43:10.000Z": "STAY HOME! Follow the temporary curfew. Please allow our law enforcement to focus response and resources on the legitimate threats attacking our communities. #MACCMN Quote Tweet Minnesota Department of Transportation @MnDOT HIGHWAY CLOSURES in effect beginning at 7PM tonight:\n\n I-35W north/south btwn I-694 & Hwy 62\n I-35E north/south btwn Hwy 36 & Hwy 62\n I-94 east/west btwn I-694 & the I-694/I-494 interchange\n I-394 east btwn Hwy 100 & I-94\n Hwy 55 north/south btwn Hwy 62 & I-94 Show this thread", "2020-05-30T20:41:35.000Z": "My heart and guts are being ripped out because I also want to go to the streets, but there are people who are burning down institutions that are core to our identity. Stay home tonight so that we can remove the folks who are harming us. Lt. Gov. Peggy Flanagan Beseeches People To Honor The Curfew Gov. Tim Walz, top state officials, religious and community leaders call for peaceful protests, ask demonstrators to obey 8 p.m. curfew (6:10). WCCO 4 News -... youtube.com", "2020-05-30T22:19:18.000Z": "We will provide an update on our plan to keep Minnesotans safe today at 6:30pm. Tune into MPR or your local TV news station. This announcement will be translated into Spanish via @NowTpt .", "2020-05-30T21:06:49.000Z": "Many Minnesotans are peacefully demonstrating today, and we fully support you. But please know there are people looking to undermine this movement for justice by inciting violence. Please go home by 8pm so that we can remove the people who wish to do our communities harm.", "2020-05-30T14:38:43.000Z": "Minnesota @GovTimWalz has announced the full mobilization of the @MNNationalGuard for the first time since World War II. We are \"all-in\" to restore order and maintain and keep the peace in Minnesota.", "2020-05-30T18:14:44.000Z": "Minnesota Guardsmen are reporting for duty from across the state to be ready to assist local authorities in restoring order and maintaining peace.", "2020-05-30T16:44:25.000Z": "In times of distress, we're coming together. This is the Minnesota I know. This is the Minnesota we love. Quote Tweet Rex Chapman @RexChapman As riots in Minneapolis continue, a center for low-income housing put out a call asking for food donations.\n\nThis is how people responded.\n\nThere was so much food it became a distribution center for anyone - at all - who needed it. \n\nHumanity.", "2020-05-30T16:29:38.000Z": "I'm giving an update at noon with @ltgovflanagan , @AgEllison , and community leaders. You can follow on MPR or your local TV news station.", "2020-05-30T13:02:16.000Z": "More than 1,000 additional Citizen-Soldiers and Airmen are activating today. This is in addition to the 700 that were on duty as of late last night. This represents the largest domestic deployment in the Minnesota's National Guard's 164-year history.", "2020-05-30T13:26:38.000Z": "We will provide an update on our plan to keep Minnesotans safe today at 9am. Tune into MPR or your local TV news station.", "2020-05-30T11:13:07.000Z": "Minnesotans are asking for and deserve confidence that we can respond to this crisis, and we will. We are continuing to coordinate efforts at the state and local level while accessing resources from across the country to keep our communities safe. I urge for peace at this time.", "2020-05-30T05:43:15.000Z": "I will address Minnesotans and the media at 1:30am for an update on the situation in the Twin Cities. Tune into MPR or your local TV news station.", "2020-05-30T05:34:17.000Z": "Minnesotans, please go home. It's time to restore peace on our streets and in our neighborhoods. The situation has become dangerous for Minnesotans and first responders.", "2020-05-30T04:57:20.000Z": "Troopers are giving dispersal orders near the Fifth Precinct. Leave the area now or you will be arrested. #MACCMN", "2020-05-30T04:37:58.000Z": "350 troopers and officers are on the ground near the Fifth Precinct in Minneapolis to clear the area and enforce the curfew. #MACCMN", "2020-05-30T04:40:39.000Z": "The Minnesota National Guard, State Patrol, and local police are on the ground responding to incidents in Mpls-St. Paul. I urge residents to comply with 8pm curfew and go home immediately. Law enforcement needs to respond to emergencies, restore order, and keep Minnesotans safe.", "2020-05-29T22:41:17.000Z": "We have implemented a temporary nighttime curfew in Minneapolis and St. Paul in order to restore peace.\n\nIt will be in effect from 8pm-6am on Friday and Saturday night. I urge Minnesotans to comply - It's time to rebuild our community.", "2020-05-29T18:58:40.000Z": "Former Officer Chauvin's actions were horrific. His arrest is a good first step toward justice for George Floyd. But it doesn't change the systemic problems and persistent inequities that led to his death or the pain our communities live with every day. We're committed to change.", "2020-05-29T14:06:21.000Z": "UPDATE: This press conference will be held at 10:30 am. Quote Tweet Governor Tim Walz @GovTimWalz I'm hosting a press conference at 10:00am. Tune in here: https:// m.youtube.com/channel/UC7CPB sekv_4u34kIVqaVtDA ", "2020-05-29T11:43:40.000Z": "I'm hosting a press conference at 10:00am. Tune in here: Office of the Governor of Minnesota This is the official YouTube channel for the Office of the Governor of Minnesota. Please find more information on the Walz-Flanagan Administration on our web... youtube.com", "2020-05-28T21:56:25.000Z": "It is time to rebuild. Rebuild the city, rebuild our justice system, and rebuild the relationship between law enforcement and those they're charged to protect. George Floyd's death should lead to justice and systemic change, not more death and destruction.", "2020-05-28T03:36:34.000Z": "The situation near Lake Street and Hiawatha in Minneapolis has evolved into an extremely dangerous situation. For everyone's safety, please leave the area and allow firefighters and paramedics to get to the scene.", "2020-05-28T01:46:13.000Z": "If you plan to turn your pain into action by joining a public demonstration, please do so peacefully and safely to protect your own health and the health of the people around you.", "2020-05-28T01:46:12.000Z": "Our state watched George Floyd's humanity get erased. Our feelings of anger, anguish, and disillusionment are justified.", "2020-05-28T01:24:27.000Z": "It was an honor to co-chair the POW/MIA Commission in Congress with Sam Johnson. He was a true patriot, gentleman, and friend. Sam Johnson, Vietnam POW who became longtime Texas congressman, dies at age 89 WASHINGTON - Retired Congressman Sam Johnson, a conservative stalwart whose service to country spanned seven years as a prisoner of war and a long stint in... dallasnews.com", "2020-05-27T19:06:42.000Z": "LIVE: We're providing an update on our response to #COVID19 . Tune in. MPR News Minnesota's Online Source for News That Matters mprnews.org", "2020-05-26T14:56:50.000Z": "The lack of humanity in this disturbing video is sickening. We will get answers and seek justice. Quote Tweet MPR News @MPRnews The FBI and the state's Bureau of Criminal Apprehension are investigating the death of a man as he was taken into custody by Minneapolis police. Bystander video showed the man telling police he couldn't breathe as they held him down https:// mprnews.org/story/2020/05/ 26/fbi-bca-investigate-death-of-man-in-minneapolis-police-custody ", "2020-05-25T17:07:47.000Z": "To all who have served and sacrificed, from decades ago to now: thank you. There is no higher service than protecting and serving your fellow citizens. I wish you a healthy, peaceful #MemorialDay .", "2020-05-25T00:14:38.000Z": "The Armory locations in Moorhead, Duluth, Faribault, St. James, East Saint Paul, and Minneapolis are offering #COVID19 testing from 10am - 5pm through Monday. This testing is available to anyone - no symptoms, payment, insurance, or ID required. #StaySafeMN", "2020-05-25T00:14:37.000Z": "This weekend, any Minnesotan who wants to get tested can visit one of 6 locations across the state where the @mnnationalguard will offer free tests. Testing, tracing and isolating are the best tools we have to understand and contain the impact of this pandemic on our communities.", "2020-05-24T21:22:22.000Z": "Eid Mubarak to all Minnesotans celebrating! I hope you're spending it with good food and good company - even if it's virtual - while looking back on the last 30 days that brought the values of gratitude and generosity to the forefront.", "2020-05-23T18:58:13.000Z": "LIVE: We're providing an update on our response to #COVID19 . Tune in Governor Walz's 5/23/20 COVID-19 Briefing The health and safety of Minnesotans is my top priority. Tune in for an update on our state's response to COVID-19. youtube.com", "2020-05-22T16:05:13.000Z": "Happy #EMSWeek , Minnesota! To our EMS community: thank you for putting the health and safety of Minnesotans above all else, your hard work saves lives. #StaySafeMN", "2020-05-22T02:30:04.000Z": "If you have COVID-19 symptoms, you can and should get tested. #StaySafeMN  http:// mn.gov/covid19", "2020-05-21T21:30:18.000Z": "#MoreThanEverBefore we need to be kind to one another and stay connected to the people in our lives. You're not alone in this challenge, or in managing the increased stress it has caused. #MentalHealthAwareness Quote Tweet MNDeptofVetsAffairs @MNVeteran It's normal to be experiencing increased stress & anxiety due to COVID-19. From exercise to meditation to staying in touch w/ loved ones, many things can help. Check out these @mnhealth tips https:// health.state.mn.us/communities/me ntalhealth/support.html   #MoreThanEverBefore  #MNVeteran  #MentalHealthAwareness", "2020-05-21T01:13:41.000Z": "My mask protects you and your mask protects me, but only if we're wearing them right. Step up your mask wearing, buying, and re-using form with these helpful tips from @mnhealth . #StaySafeMN Quote Tweet mnhealth @mnhealth Are you using your mask correctly? Follow these tips when buying, wearing, and using masks! Some people with health conditions might not be able to wear a mask, so be kind and wear a mask if you can. #StaySafeMN  #COVID19 Show this thread", "2020-05-20T20:20:06.000Z": "Whether it's a Jucy Lucy, a plate of tamales, or a walleye dinner, Minnesotans can support their local restaurants by enjoying a socially distanced meal outdoors beginning on June 1.", "2020-05-20T20:20:05.000Z": "Today we announced the next phases in our Stay Safe Plan. Our restaurants and bars are an integral part of the social fabric of Minnesota, and it has been heartbreaking to see this pandemic's impact on our small businesses.", "2020-05-20T19:58:29.000Z": "I'm joining our team at @mnhealth for an update on our response to COVID-19. Tune in Governor Walz's 5/20/20 COVID-19 Briefing The health and safety of Minnesotans is my top priority. Tune in for an update on our state's response to COVID-19. youtube.com", "2020-05-19T20:56:37.000Z": "Our deep sense of community is what makes Minnesota such a great place to live. During these challenging times, acting on that sense of community means wearing your masks in public, being aware of space between you and others, and doing your part to slow the spread. #StaySafeMN", "2020-05-19T18:15:09.000Z": "We've lost 748 Minnesotans to COVID-19. Each and every life lost is dearly missed by a community of parents, children, co-workers, friends, and neighbors. Today, and on the 19th of every month, flags will fly at half staff to honor their memory.", "2020-05-18T22:23:50.000Z": "The @mnhealth guidance to #StaySafeMN :\n\n1. Wear a mask\n2. Get tested if you aren't feeling well\n3. Stay home if you are sick\n4. Wash your hands\n5. Don't gather in groups larger than 10\n\nWe're counting on Minnesotans to make smart choices to protect people in their lives.", "2020-05-18T20:17:21.000Z": "Minnesotans, thank you for your continued sacrifices. You've saved thousands of lives by allowing us time to prepare. \n\nToday we're turning a dial, not flipping a switch.", "2020-05-17T21:34:08.000Z": "Communities across the state are counting on the legislature to pass a robust Local Jobs and Projects Plan. Work together and get this done for Minnesotans. MN House GOP blocks passage of $2 billion bonding bill Republicans in the Minnesota House followed through on their threat to block a bonding bill Saturday when the $2 billion measure was put to a vote. Meanwhile, state employees would lose a scheduled... mprnews.org", "2020-05-16T23:47:27.000Z": "I signed a bill today raising the age to purchase tobacco products to 21, which will help stop addiction before it starts, improve public health, and save young lives.", "2020-05-16T22:33:18.000Z": "Today I signed a bill into law making Minnesota the first state to ban the carcinogenic known as TCE. Thank you to all the advocates who shined a light on the use of this harmful chemical.", "2020-05-16T21:19:11.000Z": "To our @UMNews", "2020-05-16T19:58:30.000Z": "Minnesotans value our small businesses - all of them. As the #mnleg works to provide relief for Minnesota business, I urge them to support the businesses owned by people of color that give life to main streets across our state and make Minnesota a great place to live. #MNStrong", "2020-05-16T19:22:03.000Z": "Bonding bill in limbo as Minnesota lawmakers race toward deadline The uncertainty surrounding the $2 billion bill, couched by Democrats as a jobs initiative, is the latest roadblock in a legislative session completely upended by the COVID-19 pandemic. m.startribune.com", "2020-05-16T18:34:36.000Z": "With just two days left in the legislative session, the #mnleg needs to act quickly to pass a bonding bill, like my Local Jobs and Projects Plan, to boost our economic recovery, create jobs across the state, and make the investments our communities are asking for right now.", "2020-05-16T16:14:58.000Z": "Not today, puppy.", "2020-05-15T23:14:27.000Z": "Supreme Court Justices decide some of the most pressing and significant questions of our time, and the feedback from Judge Moore's peers was resounding: he is a brilliant jurist and a leader in his community. Walz appoints Worthington's Gordon Moore to the Minnesota Supreme Court | The Globe ST. PAUL - Moore will fill the vacancy created upon the retirement of Justice David Lillehaug, who has served on the Supreme Court since 2013. Moore brings more than 30 years of legal experience to... dglobe.com", "2020-05-15T23:14:26.000Z": "Today we announced the appointment of Judge Gordon Moore as the next Associate Justice of the Supreme Court. He has spent his career working hard for the people of Southern Minnesota, and he will bring a fair and respected voice to the Minnesota Supreme Court.", "2020-05-15T18:57:08.000Z": "I've ordered Minnesota's flags to fly at half staff today in honor of Peace Officers who gave their lives to protect ours, and in thanks to the 11,000 Law Enforcement Officers who serve our state for their dedication to protecting Minnesota communities. #PeaceOfficerMemorialDay", "2020-05-15T17:01:07.000Z": "Five Veterans Homes in Minnesota work around the clock to ensure the men and women who've served our country live in a supportive community. During Veterans Home Week we honor those who provide the highest level of care for our Nation's heroes.", "2020-05-15T16:02:12.000Z": "I am announcing the appointment of the next Associate Justice of the Minnesota Supreme Court, who will fill the vacancy created upon the retirement of Justice David Lillehaug. Tune in Governor Walz Announces Minnesota Supreme Court Appointment Governor Tim Walz announced his first appointment to the Minnesota Supreme Court. youtube.com", "2020-05-14T23:42:55.000Z": "Minnesotans regularly lead the nation in voter participation and this year should be no different. This week I proudly signed an election security bill in to law to make sure the process is smooth, safe, and accessible, even during these challenging times. #MNStrong", "2020-05-14T20:28:48.000Z": "As we slowly reopen society, we must protect the communities that are most vulnerable to the virus. Last week we announced a Five Point Battle Plan to protect our seniors, and today I am encouraging Minnesotans at greatest risk of serious illness to continue staying home.", "2020-05-14T20:20:23.000Z": "If you do not feel safe at your job, contact @mndli at 651-284-5050.", "2020-05-14T17:59:03.000Z": "Workers should not have to sacrifice their health and safety for economic security. As more people head back to work, they must be protected. I signed an Executive Order to ensure workers can raise concerns about workplace safety without fear of discrimination or retaliation.", "2020-05-14T15:40:10.000Z": "Until now it was legal for Minnesotans under 18 to marry, which can be detrimental to their mental and physical health. Thanks to the tireless work of @SenatorPappas and @KaohlyVangHer , this week I signed into law a measure to protect young Minnesotans. Bill Banning Child Marriages In Minnesota Clears Legislature The state Senate approved the bill Wednesday and sent it to Gov. Tim Walz, who is expected to sign it. minnesota.cbslocal.com", "2020-05-14T01:17:33.000Z": "Amid COVID-19, our commitment to helping Minnesotans afford the medication they need to survive hasn't changed. Yesterday I signed into law the #DrugPriceTransparencyAct to hold drug manufacturers accountable and require greater price transparency for drugs Minnesotans need.", "2020-05-13T23:18:01.000Z": "We are trusting people to #StaySafeMN by making smart choices. Wear a mask, stay home if you are sick, wash your hands, and get tested if you are not feeling well. We are counting on Minnesotans to take personal responsibility for their health and the health of their community.", "2020-05-13T23:18:00.000Z": "We asked you to take drastic action. We asked you to stay home to slow the spread and give us time to prepare. And with that time we built out hospital capacity, we increased ventilators and ICU beds, we sourced critical care and PPE, and we launched a landmark testing strategy.", "2020-05-13T23:17:59.000Z": "Today we announced a cautious, measured turning of the dial toward a new normal. Our Stay Home Order will be replaced with one that encourages Minnesotans to stay close to home and allows retail stores and main streets to safely open.", "2020-05-13T23:07:29.000Z": "LIVE: I'm announcing the next phase of our COVID-19 response in Minnesota. Tune in here: MPR News Minnesota's Online Source for News That Matters mprnews.org", "2020-05-13T22:58:37.000Z": "This announcement will also be broadcast live in Spanish and Hmong through @tpt and @3hmoobtv .", "2020-05-13T19:37:33.000Z": "Minnesota's fund dedicated to our COVID-19 response has saved lives. I'm grateful for the #mnleg 's bipartisan effort to extend this resource so we can continue providing the testing, hospital beds, and PPE Minnesotans need to weather this pandemic. Minnesota's expiring COVID-19 money a 'looming problem' Budget officials seek extension and an additional $200 million or more. startribune.com", "2020-05-13T18:31:51.000Z": "I started to do it myself but @GwenWalz wisely insisted on taking over.", "2020-05-12T01:57:14.000Z": "Happy Statehood Day! On this day 162 years ago Minnesota became the 32nd state - and what a perfect Minnesota day it is to mark the occasion. \n\nIt's an honor to serve our extraordinary state.", "2020-05-12T01:09:29.000Z": "This is challenging for all Minnesotans. It's hard on our lives, our businesses, and our families.\n\nBut whether it's a friend or a neighbor, we reach out and help each other up. That's who we are as Minnesotans, and that's what it means to get through this together. #OneMinnesota", "2020-05-11T20:33:21.000Z": "Today I signed an Executive Order to help fill workforce shortages in critical sectors, like nursing, across MN. We created a path for students near graduation in critical sectors to complete their exams and get to work protecting Minnesotans' health, safety, and well-being.", "2020-05-11T18:02:03.000Z": "A reminder to all Minnesotans: If you have COVID-19 symptoms, you can and should get tested. Visit our website to find a testing site in your community: http:// mn.gov/covid19/for-minnesotans/if-sick/ ", "2020-05-10T22:45:01.000Z": "I'm lucky to celebrate 3 strong mothers in my life today.\n\nMy mother taught me what it means to serve others. My mother-in-law is a wonderful person who raised 4 strong daughters including my wife @GwenWalz , who is an incredible mother to Hope and Gus.\n\nHappy Mother's Day to all!", "2020-05-09T19:08:55.000Z": "One of my favorite notes this year - handwritten AND highlights public health advice. Thank you, Harriet!", "2020-05-09T15:14:21.000Z": "Incredibly grateful for the work @ltgovflanagan is doing to address racial inequities that have been exposed during this crisis, lift up our vulnerable populations, and navigate the complex challenges facing Minnesota. Quote Tweet Lt. Governor Peggy Flanagan @LtGovFlanagan #COVID19 has an unequal impact on BIPOC community members throughout the state. We measure what we care about, and the data is clear: we cannot allow our communities to be invisible as we build our response and recovery efforts. https:// mn.gov/covid19/data/c ommunity-data/overview.jsp ", "2020-05-08T23:15:16.000Z": "A boy and his dog.\n\nIt's been a long week. Wishing Minnesotans a restful weekend with those they love. #StayHomeMN", "2020-05-08T21:35:12.000Z": "We don't say thank you enough to the people who do that critical behind-the-scenes work to keep our communities safe. This week, we thank the dedicated folks at our corrections facilities for their service to the people of Minnesota. #MNStrong", "2020-05-08T14:27:57.000Z": "Minnesota's fishing opener is a time-honored tradition that thousands look forward to. We want folks to enjoy the outdoors. But anglers know it's also about ethics - it's about how you treat the others on the lake. This year, being a good neighbor means fishing close to home. Quote Tweet Minnesota DNR @mndnr Going fishing this weekend? Be safe and fish close to home, and practice social distancing while you're on the water. Follow these recommendations. http:// mndnr.gov/covid19  #SocialDistancing  #StayHomeMN  #FishMN", "2020-05-08T01:49:43.000Z": "Go home bear  #StayHomeMN Bad news, bear: This Duluth mall is closed With nearby Miller Creek and a forest bordering the parking lot, the mall has seen visits from beavers, fox, rabbits and even coyotes over the years. m.startribune.com", "2020-05-08T00:12:00.000Z": "From the start of distance learning, Minnesota's schools have provided care for thousands of children of critical workers each day, while working tirelessly to close the opportunity gap and improve education outcomes. Proud to declare May 7 School-Age Care Workers Day.", "2020-05-07T22:04:00.000Z": "As a parent and teacher, the mental health of our children is a top priority, especially during this pandemic. On Children's Mental Health Awareness Day, we want to make sure our children have the resources they need. https:// mn.gov/covid19/for-minnesotans/get-help/mental-health.jsp ", "2020-05-07T20:41:08.000Z": "Ensuring we are in a strong position to care for our most vulnerable populations is a top priority. Today we announced a five point battle plan to keep this virus at bay in our long-term care facilities. https:// health.state.mn.us/diseases/coronavirus/hcp/ltc.html ", "2020-05-07T18:58:12.000Z": "I'm joining our team at @mnhealth to provide an update on our response to COVID-19 and discuss our plan to protect Minnesotans living in long-term care facilities. Tune in Governor Walz's 5/7/20 COVID-19 Briefing The health and safety of Minnesotans is my top priority. Tune in for an update on our state's response to COVID-19. youtube.com", "2020-05-07T00:11:00.000Z": "Your community's health is only as strong as your own health. \n\nKeep it up, Minnesota. Stay home if you can, wear cloth masks in public, and maintain social distance. \n\nIt's not just for you, it's for everyone around you. #StayHomeMN", "2020-05-06T22:45:00.000Z": "Minnesota will fondly remember Marion Watson's service, curiosity and enduring legacy in advocacy and broadcasting. She broke codes, news, and barriers for generations of Minnesotans and lived Minnesota's values through and through. Marion Watson, 97, broke World War II codes, went on to manage KUOM Radio Marion Watson's curiosity and passion for justice often led her to the front lines. The longtime St. Paul resident died of dementia complications on March 28 at Episcopal Homes. She was 97. Watson  twincities.com", "2020-05-06T21:29:25.000Z": "Thank you to our @MNNationalGuard for this demonstration of solidarity, and thank you to our health workers, first responders, and essential personnel for the sacrifices you're making for your fellow Minnesotans during this pandemic. #MNStrong  Quote Tweet MN National Guard @MNNationalGuard It was an honor to show our support for Minnesota's frontline workers today. So many across our state are stepping up to help us fight COVID-19. #OperationAmericanresolve Show this thread", "2020-05-06T21:02:00.000Z": "If you have a health scare, don't hesitate to seek help. Our hospitals and care providers are prepared to treat Minnesotans for *any* concern they have about their health. Quote Tweet mnhealth @mnhealth While we stay home to slow the spread of #COVID19 , you should still call 911 for medical emergencies like a #heartattack or #stroke . Don't delay important care. Minnesota hospitals are safe and prepared to treat emergencies. https:// health.state.mn.us/diseases/coronavirus/prevention.html   #StayHomeMN  #StrokeMonth Show this thread", "2020-05-06T19:47:16.000Z": "We thank and honor our nurses for keeping Minnesotans safe and healthy today, and every day. Their commitment to delivering high-quality care has been unwavering through this critical time. #NationalNursesDay  #MNStrong", "2020-05-06T17:18:00.000Z": "Generosity is part of Minnesota's shared culture. During @GiveMN 's #GiveAtHomeMN , I encourage you to donate to our nonprofits and schools if you're able, and support the work they do to improve lives in every corner of our state. Learn more at http:// givemn.org", "2020-05-05T23:13:00.000Z": "My heartfelt gratitude goes to our educators on #TeacherAppreciationDay . As a former teacher I know you're the ones who inspire our young minds and light that fire. I'm always proud to stand with you.", "2020-05-05T21:49:00.000Z": "Native women experience violence at alarmingly high rates. Last year I proudly signed into law a task force to examine the causes of this violence. \n\nToday, we commit to making Minnesota a place where all Minnesotans know their loved ones will get home safe. #RedDressDay", "2020-05-05T20:25:06.000Z": "We know Minnesotans' health concerns haven't gone away during this pandemic. Safely restarting elective surgeries will help Minnesotans get care they need and improve their quality of life.", "2020-05-05T19:33:35.000Z": "Our updated budget outlook confirms what we suspected: COVID-19 will damage Minnesota's economy. There is a long winter ahead. COVID-19 is upending life as we know it-and our economy will not be spared.", "2020-05-05T18:57:55.000Z": "As we navigate an unprecedented challenge, we cannot compromise the health, safety, and well-being of Minnesotans. Tune in for an update on our response to COVID-19 - We'll hear from Minnesota's Chief Financial Officer about our state's financial outlook. Governor Walz's 5/5/20 COVID-19 Briefing The health and safety of Minnesotans is my top priority. Tune in for an update on our state's response to COVID-19. youtube.com", "2020-05-01T15:31:36.000Z": "Do you receive #SSI ? Do you have children? The IRS needs to hear from you by Tuesday, May 5, so that you can receive the $500 per child federal stimulus payments. Notify the IRS of your dependents at: https:// irs.gov/coronavirus/no n-filers-enter-payment-info-here   #COVID19", "2020-05-05T17:05:00.000Z": "We're working with businesses and employees every day to safely get people back to work. Grateful to have partners in the private and non-profit sectors bringing innovative ideas to the table. We're in this together and will continue to navigate this pandemic as #OneMinnesota .", "2020-05-05T15:02:00.000Z": "When you face a big challenge you smother it with talent. We're fortunate to have experienced, dedicated public servants leading us through this pandemic. Joe Kelly is one of them. I've been endlessly grateful for his level-headed, thoughtful advice. Minnesota homeland security chief Joe Kelly brings calm to pandemic response \"I'm trying to make things digestible and understandable for the people of Minnesota in an environment where there's so much going on and so much data, so much information,\" said Joe Kelly, who has... startribune.com", "2020-05-05T02:18:07.000Z": "Thank you to Minnesota's 20,000 firefighters for responding to crises with courage and resilience 365 days a year, day or night. Quote Tweet State Fire Marshal @MnDPS_SFM On this International Firefighters' Day, the men and women of the State Fire Marshal Division stand and salute each and every one of our 20,000-plus Minnesota firefighters. Thank you for all that you do. Stay safe. Stay strong. Stand proud.", "2020-05-05T01:19:11.000Z": "Breakfast for supper   #QuarantineDiet", "2020-05-04T23:26:19.000Z": "Financial support for COVID-19 should go where it's needed most: helping Minnesotans pay their rent and put food on the table. Today we took action to ensure emergency funding goes directly to improving lives and isn't intercepted by debt collectors. Gov. Walz bans debt collectors from intercepting coronavirus relief funds Debt collectors are prohibited from intercepting COVID-19 relief payments bound for Minnesota residents under a new order Monday from Gov. Tim Walz. The executive order applies to the $1,200 income twincities.com", "2020-05-04T22:01:04.000Z": "Proud to honor the work of child care providers by declaring Child Care Provider Appreciation Week in the State of Minnesota. Family child care providers open their doors and hearts to families each and every day. They are ready to serve no matter the circumstance. #MNStrong", "2020-05-04T19:01:34.000Z": "The health and safety of Minnesotans is my top priority. Tune in for an update on our state's response to COVID-19 Governor Walz's 5/4/20 COVID-19 Briefing The health and safety of Minnesotans is my top priority. Tune in for an update on our state's response to COVID-19. youtube.com", "2020-05-04T02:24:56.000Z": "A heartwarming Sunday night surprise. Our family ended the weekend with this impromptu performance by two retired band teachers outside our home. Thank you for lighting up the neighborhood! #SkiUMah", "2020-05-03T19:05:45.000Z": "On #WorldPressFreedomDay I want to say thank you to the outstanding journalists in Minnesota covering this pandemic from the ground-level and keeping Minnesotans informed year-round. \n\nIt isn't free - if you value local news and you're able, consider subscribing.", "2020-05-03T01:28:37.000Z": "This is why we stay home. The sacrifices Minnesotans are making and our commitment to keeping each other safe have delivered these results. #StayHomeMN Minnesota health officials say care system better equipped for COVID-19 Doctors and hospitals credit a stay-at-home order from Gov. Tim Walz with slowing an expected surge of patients, but that has political consequences. startribune.com", "2020-05-02T21:24:44.000Z": "Not exactly the way we imagined Hope would finish off her first year of college. As @GwenWalz and I help move her out of the dorm we're thinking of students who've missed milestones this year. I know we'll look back at this time and remember the ways we came together. #StayHomeMN", "2020-05-02T14:51:00.000Z": "We've made meaningful progress in the fight against COVID-19, but we all need to continue to slow the spread of this virus. That means: wear cloth masks, maintain social distance and stay home if you can.", "2020-05-01T23:50:00.000Z": "#InternationalWorkersDay this year falls at a time when workers around the world are measuring their safety against their livelihood. We'll keep working to ensure Minnesotans have fair pay and safety on the job, now and always.", "2020-05-01T22:05:00.000Z": "When times get tough, we pull together. Through this pandemic, we've truly seen #WhoCaresForUs - let's make sure those front-line employees in healthcare, schools, security, and childcare have the equipment they need to stay safe, keep the lights on, and put food on their tables.", "2020-05-01T16:02:10.000Z": "Thank you @GovTimWalz nd @LtGovFlanagan for your proclamation to recognize May as Asian and Pacific Islander Minnesotans Heritage Month! #OneMinnesota", "2020-05-01T17:56:26.000Z": "ICYMI: Retail stores can begin curbside pick-up beginning Monday. Minnesota has led the nation in our response to COVID-19. As long as we take careful steps to keep each other safe, we can continue to slowly turn the dials and get Minnesotans back to work. #StayHomeMN", "2020-05-01T16:55:29.000Z": "Today is #SchoolLunchHeroDay  This challenging time has given Minnesotans renewed appreciation for the important role food service staff play in our childrens' lives. Thank you to everyone going the extra mile to make sure our kids are ready to learn!", "2020-04-30T19:30:34.000Z": "But now is not the time for sudden movements. There's more work to be done. We need to keep this virus at a simmer, not a boil. We must prioritize the safety of Minnesotans while taking cautious, strategic steps toward getting people safely back to work.", "2020-04-30T19:30:33.000Z": "From building out critical hospital capacity to launching a landmark testing strategy, Minnesota has made meaningful progress in preparing for the worst of the COVID-19 pandemic. Minnesotans have made this possible by staying home and holding down the rate of infection.", "2020-04-30T18:57:48.000Z": "I'm giving an update on Minnesota's Stay Home Order and our next steps to combat COVID-19. Tune in live Governor Walz's 4/30/20 COVID-19 Briefing The health and safety of Minnesotans is my top priority. Tune in for an update on our state's response to COVID-19. youtube.com", "2020-04-30T02:23:56.000Z": "We #StayHomeMN not for ourselves, but for the nurses and health care workers risking their lives for us every time they clock in. Thank you for providing compassionate, life-saving care for Minnesotans.", "2020-04-30T00:31:45.000Z": "I just want to say thank you, Minnesota. You have risen to the challenge before us and shown incredible kindness, generosity, and grit through it all. Keep it up. #MNStrong", "2020-04-29T22:36:10.000Z": "Our agriculture industry drives Minnesota's economy - I was proud to join @CollinPeterson and the House Agriculture Committee today to support our employees and pork producers, who are weighing heartbreaking decisions as COVID-19 disrupts their work and way of life.", "2020-04-29T20:29:16.000Z": "We just got the final count and Minnesotans donated 137,430+ masks during our drive. Special shout out to Altura, MN, which donated nearly as many masks as it has residents. We couldn't have done this without our fire stations, every single one of which participated. Awesome.", "2020-04-29T17:45:26.000Z": "Today we announced a new alternative care site in Roseville to increase our hospital capacity and ensure all patients who need care get it. We'll continue to plan ahead to ensure Minnesota is prepared to weather this pandemic and any challenges it brings. Minnesota signs lease for alternative care site in Roseville to address hospital capacity concerns In an effort to address hospital capacity issues, Minnesota Governor Tim Walz signed a lease for an alternative care site to provide low-level medical care if it is needed during the COVID-19... fox9.com", "2020-04-29T15:00:09.000Z": "As a MN-based company, we're proud to answer @GovTimWalz 's call & support local businesses with access to infrared thermometers for employee health screenings. A supply is now available for pre-order at wholesale cost from us. More here: Minnesota B2B thermometers | Target's coronavirus response Target is offering Minnesota businesses the opportunity to purchase no-touch infrared forehead thermometers at wholesale cost. corporate.target.com", "2020-04-29T15:04:58.000Z": "Today @mndeed announced they partnered with @Target to launch a health screening tool that will help keep our workplaces safe. Minnesota's innovative spirit and history of public-private partnerships hasn't slowed during this pandemic. #MNStrong Quote Tweet MN DEED @mndeed Thanks to a collaboration between @Target , @MNSafetyCouncil and @MNIT_Services , Minnesota businesses now have a digital tool to help perform basic health screenings! Learn more about the MN Symptom Screener: https:// bit.ly/2KPhIUB", "2020-04-29T02:33:24.000Z": "Not quite the same as seeing him in person, but Minnesota's @MZELLAR put on a great virtual concert tonight. Thank you for bringing Minnesotans together during this challenging time.", "2020-04-29T00:22:06.000Z": "On #WorkerMemorialDay we remember those who've been injured or lost their lives on the job, and we appreciate the sacrifices of healthcare workers and first responders risking their lives to save others in the fight against COVID-19. Let's get Minnesotans home safe. #StayHomeMN", "2020-04-28T22:25:45.000Z": "Mayors are at the ground level of this pandemic and their decisions have a direct impact on health and wellbeing. I applaud @MayorNorton 's leadership for the Rochester community through this crisis and we'll continue to work closely to navigate the challenges of COVID-19.", "2020-04-28T14:17:01.000Z": "Our public-private partnerships have positioned Minnesota as a national leader in the fight against COVID-19. Today I'll walk @VP Mike Pence through our groundbreaking testing strategy at @MayoClinic . Coronavirus In Minnesota: Vice President Pence To Visit Mayo Clinic To Learn About Testing 'Moons... Vice President Mike Pence has an appointment Tuesday at Minnesota's Mayo Clinic to learn about a new coronavirus testing \"moonshot\" that has the famed clinic partnering with the state and the U of M... minnesota.cbslocal.com", "2020-04-28T01:45:02.000Z": "I spoke with church leaders today who are finding new ways to bring their communities together during the pandemic. While congregations look forward to worshiping under one roof again soon, they're putting public health first until we can limit the spread of COVID-19. #StayHomeMN", "2020-04-28T00:46:29.000Z": "Folks from every corner of the state made and donated masks to their local fire stations this weekend to support our congregate care facilities on the front lines of this pandemic. Thank you for going above and beyond to help your communities! #MNStrong", "2020-04-27T23:46:49.000Z": "Minnesota's expanded testing capacity is going to help keep our communities safe. Thanks to a partnership between @MayoClinic , @UMNews , and the State of Minnesota, it's easy to find a testing location in your community. Visit https:// mn.gov/covid19/for-minnesotans/if-sick/  .", "2020-04-26T18:19:58.000Z": "We lost 28 Minnesotans to COVID-19 yesterday. This is a heartbreaking loss for our state and my thoughts are with each grieving family. \n\nThis won't be the last hard day, but if we continue to look out for each other and stay home we can help protect our neighbors and loved ones.", "2020-04-26T16:18:12.000Z": "Are you getting outside this weekend? Here's some advice from a few familiar faces and our friends at @mndnr  Quote Tweet Minnesota DNR @mndnr Looking to get outside this weekend? Here's a little outdoor recreation advice from a few [famous] friends... #COVID -19", "2020-04-25T23:49:49.000Z": "For our healthcare professionals, going to work each day means facing this pandemic head-on. We cannot take their heroic work for granted. Take a few minutes to read some of their stories. #MNStrong  #StayHomeMN These Minnesotan health care heroes are fighting on the front lines against COVID-19 Meet the people putting it all on the line during the coronavirus crisis: \"We are going to look out for each other.\" m.startribune.com", "2020-04-25T21:29:44.000Z": "Thank you for supporting our kids @AfroDeli ! #MNStrong Quote Tweet Afro Deli @AfroDeli Starting today, will be offering free, all-day #kidsmeals to help support families in need during this difficult time.\n.\nPlease share to those who might benefit from this - we are here to help . #AfroFamily", "2020-04-25T14:19:41.000Z": "#OneMinnesota means our neighbors' concerns are our concerns, and when times are tough, we have each others' backs. I'm so proud of the team at @mndeed for what they're doing to ensure no one is left behind, including self-employed Minnesotans, during this pandemic. Quote Tweet MN DEED @mndeed DEED begins making Pandemic Unemployment Assistance (PUA) payments. Minnesota is one of the first states to have authorized the additional FPUC $600 weekly payments, the 13-week extension of unemployment benefits, and begin processing payments under PUA: https:// bit.ly/3az8IxE", "2020-04-25T00:52:21.000Z": "Access to COVID-19 testing is critical to moving Minnesota forward during this pandemic - today we launched a tool to help make our statewide testing initiative accessible to all Minnesotans. Visit our new website to find a testing site in your community. https:// mn.gov/covid19/for-minnesotans/if-sick/ ", "2020-04-24T23:24:46.000Z": "Hey Minnesota, if you haven't brought a homemade mask in to your local fire department yet, there's still time. Let's finish #MinneSEWtaweek strong!", "2020-04-24T17:31:25.000Z": "Eating my glasses was a strategic first step. Now I can't see what he's doing! 11/10 Scout is winning quarantine. #StayHomeMN Quote Tweet John Croman @JohnCroman During webinar with Minnesota League of Cities @GovTimWalz pauses briefly, then explains his dog is trying to eat his remote. This comes days after the black lab ate governor's glasses. Scout!", "2020-04-24T16:28:00.000Z": "105 years ago, 1.5 million lives were lost in the #ArmenianGenocide . When I was a teacher, this was always a solemn day in the classroom as we took time to remember those who died and discuss the importance of studying history to ensure it never happens again.", "2020-04-24T14:18:48.000Z": "When Minnesotans face adversity, we rise to the challenge together. I know this isn't easy and that you're making sacrifices every day to stay home, keep Minnesotans safe and healthy, and save lives. \n\nIt's incredible to see the ways Minnesotans are stepping up. #StayHomeMN", "2020-04-23T21:32:01.000Z": "Ramadan Mubarak! Gwen and I are wishing a safe, peaceful, and blessed Ramadan to all Minnesotans celebrating. It's hard to imagine holidays without our cherished traditions, but I know Minnesotans will find new ways to come together and honor their faith.", "2020-04-23T20:06:18.000Z": "Our lives will look different for quite some time. As we move forward, I want you to know how we're making our decisions. \n\nBefore we turn these dials, we will carefully consider public health, economic and societal impacts.", "2020-04-23T19:32:20.000Z": "Today we extended distance learning through the end of the year. As a former teacher, I know how hard this is for students, families, and teachers. \n\nIt's a long road ahead - but I will continue to put the safety and well-being of our families first. #StayHomeMN", "2020-04-23T18:59:39.000Z": "The health, safety, and well-being of Minnesotans remains my #1 priority. Tune in for an update on our response to COVID-19 Governor Walz's 4/23/20 COVID-19 Briefing The health and safety of Minnesotans is my top priority. Tune in for an update on our state's response to COVID-19. youtube.com", "2020-04-23T18:26:45.000Z": "Each life taken by COVID-19 causes shock waves of pain for every Minnesotan whose lives they've touched. \n\nYesterday we lost 21 Minnesotans to this virus, each one heartbreaking and deeply felt by the Minnesota community. We must continue to #StayHomeMN .", "2020-04-23T14:34:59.000Z": "This can't happen in Minnesota, and if we expand vote by mail, it won't. In Minnesota, we consistently lead the nation in voter turnout - let's not let COVID-19 change that. #StayHomeMN 7 Wisconsin coronavirus infections linked to Election Day, health official says Advocates, saying the spread was preventable, step up their push for mail-in voting. nbcnews.com", "2020-04-22T23:50:14.000Z": "I asked for a Minnesota moonshot and our healthcare partners delivered. This testing breakthrough will be transformative to our COVID-19 response, allowing us to better protect Minnesotans and build a more clear picture of how COVID-19 is impacting us. Walz, U of M and Mayo announce plan for 35,000 COVID-19 tests per day The number of tests available should soon allow the state to test all symptomatic people in the state, Walz said. kare11.com", "2020-04-22T22:36:17.000Z": "You can't accuse me of being a fair-weather @Twins fan. Fastest way to get back to Target Field? Keep up up the good work and continue wearing those masks Minnesota. Go Twins! Quote Tweet Glen Stubbe @gspphoto It is good when leaders model the behavior they want us to have\n\nGov Tim Walz\nwore a mask in,\nwore a mask out,\nshowed proper social distancing inside @GovTimWalz announced expanded #COVID19 testing for Minnesota http:// strib.mn/2VsJtIK", "2020-04-22T21:05:00.000Z": "Happy #EarthDay 50! Here are a few (solo) ways you can leave our environment a little better than you found it. As we combat one global crisis, let's not lose sight of another. Earth Day's 50th year brings new ways to celebrate the planet Celebrating Earth Day is going to be a solo activity this year. southernminn.com", "2020-04-22T19:39:02.000Z": "More information: https:// mn.gov/governor/news/ #/detail/appId/1/id/429435  Watch our announcement live: https:// m.youtube.com/watch?v=QtBY0Z 0sZhg   #MNStrong Governor Walz's 4/22/20 COVID-19 Briefing The health and safety of Minnesotans is my top priority. Tune in for an update on our state's response to COVID-19. youtube.com", "2020-04-22T19:20:56.000Z": "Today we announced a breakthrough in rapid, widespread testing of COVID-19. When Minnesota faces a challenge, we rise up-together. I'm proud to partner with Minnesota's innovative research and health care systems to pioneer how states can begin to move forward amid COVID-19.", "2020-04-22T18:59:23.000Z": "Tune in for a live announcement on COVID-19 testing with @MayoClinic , @UMNews , and Minnesota health system leaders: Governor Walz's 4/22/20 COVID-19 Briefing The health and safety of Minnesotans is my top priority. Tune in for an update on our state's response to COVID-19. youtube.com", "2020-04-22T14:09:17.000Z": "NEW: More than 1,200 MN child care providers will receive funding to continue serving children of essential workers as a result of a partnership between our office and the #mnleg . \n\nEndlessly grateful for our providers' work to support our littlest Minnesotans. Quote Tweet Minnesota DHS @MinnesotaDHS DHS News Release - State awards first emergency child care grants; Round one of funding totals $9.8 million to support family child care providers and centers serving children of essential workers: http:// mn.gov/dhs/media/news /index.jsp?id=1053-429315   #StayHomeMN", "2020-04-22T00:09:06.000Z": "Minnesota lost an icon 4 years ago today.  @GwenWalz and I are listening to some of our favorite hits today in #Prince 's memory. Quote Tweet Star Tribune Variety @entertain_mn Tonight's all-star tribute on CBS-TV \"proves Prince does music better than anybody.\" Read @jonbream 's preview with input from Maya Rudolph, Jimmy Jam & Bobby Z. http:// strib.mn/3btxzUz", "2020-04-21T21:34:10.000Z": "Heys folks, this isn't a time to go without health insurance. Your health and safety is our #1 priority. If you haven't yet, you have until 11:59 tonight to get covered during @mnsure 's special enrollment period. #StayHomeMN Quote Tweet MNsure @MNsure The COVID-19 special enrollment period ends at 11:59 pm tonight. If you need help enrolling by the deadline, try working w/a free, MNsure-certified assister: http:// bit.ly/FindAnAssister", "2020-04-21T16:02:58.000Z": "Today we remember, we mourn, and we stand solemnly against hate and antisemitism. We will #NeverForget the 6 million innocent lives lost. #YomHaShoah  #HolocaustRemembranceDay", "2020-04-21T00:58:18.000Z": "Public-private partnerships are one important way Minnesotans have come together to strengthen our response to COVID-19. Proud to give an update today with @Ecolab 's Doug Baker on the ways we've partnered to secure critical medical supplies. #MNStrong Minnesota corporations put to work finding PPE | Park Rapids Enterprise With masks, tests more secure, Walz says delays now come down to coordination parkrapidsenterprise.com", "2020-04-20T22:53:56.000Z": "Hey Minnesota, 5 days left in our statewide homemade mask drive. Let's see your progress!  #MinneSEWtaWeek", "2020-04-20T20:53:45.000Z": "Love to see the little ways Minnesotans are showing their support for our healthcare workers and the incredible sacrifices they're making. #HeartsForHealthcare  #MNStrong", "2020-04-20T18:59:32.000Z": "Minnesota companies, big and small, have stepped up to help us secure scarce medical supplies for our front line health care workers. @Ecolab has helped us coordinate with the state's major companies in this effort. Tune in for a live update Governor Walz's 4/20/20 COVID-19 Briefing The health and safety of Minnesotans is my top priority. Tune in for an update on our state's response to COVID-19. youtube.com", "2020-04-20T17:19:47.000Z": "Find out how you can make a difference in your community here: http:// mn.gov/covid19/for-minnesotans/volunteer/ ", "2020-04-20T17:18:26.000Z": "Volunteerism is a core part of the Minnesota identity - thank you to all Minnesotans who've found new ways to step up to help each other through this virus. How are you participating in National Volunteer Week?", "2020-04-19T17:23:44.000Z": "Reminder to check in with the people in your life today.\n\nAnd if you're worried about a loved one, or if you want someone to talk to, know you can reach out. \n\nWe have a website with mental health resources. You're not alone in this challenge  https:// mn.gov/covid19/for-minnesotans/get-help/mental-health.jsp ", "2020-04-19T13:42:12.000Z": "Well said, Marshall! We all miss our friends and teachers, but we're staying home to keep each other safe and healthy. Thank you! #StayHomeMN", "2020-04-19T00:16:10.000Z": "Businesses are stepping up to support their communities during this pandemic. Special thanks to @SPLASH_Products for donating 1680 gallons of cleaning supplies to help child care providers keep children and staff safe. #MNStrong", "2020-04-18T22:19:19.000Z": "Our great Lieutenant Governor is a leading national voice on equity. So proud to have her partnership. Quote Tweet Lt. Governor Peggy Flanagan @LtGovFlanagan It is critically important that we work in partnership with tribal nations in Minnesota to coordinate public health responses as #COVID19 exacerbates existing inequities. Grateful to join @MichelMcQMartin and @AmanpourCoPBS this week to discuss why. https:// youtube.com/watch?v=my40cy 60Th4&feature=youtu.be ", "2020-04-18T20:37:01.000Z": "There is no standard design for a homemade facemask, but if you're looking for inspiration, recommendations or more information, take a look at our website: https:// mn.gov/covid19/for-minnesotans/volunteer/masks.jsp   #MinneSEWtaWeek Quote Tweet Governor Tim Walz @GovTimWalz We're calling on all Minnesotans to get creative Today we launched a statewide mask drive to help our congregate care facilities.\n\nThese don't replace PPE, but they do help limit the spread of the virus. Thanks to our fire stations for partnering with us! #MinneSEWtaWeek", "2020-04-18T18:41:01.000Z": "Yesterday I signed a bill to allow sales of wine and beer with takeout so Minnesotans can continue to support their favorite local restaurants. Our restaurants have found creative ways to keep Minnesotans fed and happy through the pandemic - this is one way we can help them out Quote Tweet WCCO - CBS Minnesota @WCCO Gov. Tim Walz signed legislation Friday to allow takeout sales of beer and wine from bars and restaurants during the COVID-19 pandemic. | http:// cbsloc.al/2KgkbXY", "2020-04-18T17:34:47.000Z": "I hope Minnesotans can enjoy the beautiful weather this weekend. Just a reminder to do so safely while social distancing and protecting our wildlife. Quote Tweet Minnesota StateParks @mnstateparks Some state park hiking trails are too narrow to maintain social distancing without stepping off the trail and onto fragile plants. Please choose open spaces and wide trails. #SocialDistancing  #MNStateParks", "2020-04-18T16:37:00.000Z": "Ruben told Minnesotans' stories - the good and the bad - with insight and candor. Congratulations on an outstanding career. You'll be missed in St. Paul and beyond! Rosario: Time to say goodbye for now The memories of more than 43 years as a full-time newspaperman rushed unimpeded inside my noggin like a tsunami this week as I finalized paperwork and cleared out my desk. This is my last week at t twincities.com", "2020-04-18T14:59:59.000Z": "We're calling on all Minnesotans to get creative Today we launched a statewide mask drive to help our congregate care facilities.\n\nThese don't replace PPE, but they do help limit the spread of the virus. Thanks to our fire stations for partnering with us! #MinneSEWtaWeek", "2020-04-18T13:54:24.000Z": "Making Minnesota proud, @Jeopardy_Nibir - congratulations! #UMNProud University of Minnesota sophomore wins 'Jeopardy' college tournament Nibir Sarma, from Eden Prairie, took home a $100,000 prize and automatically earned a spot in the Tournament of Champions. startribune.com", "2020-04-18T02:10:11.000Z": "Throughout history we've seen a disturbing but clear pattern play out during public health crises: People of color and Indigenous people are more likely to suffer physically AND financially. \n\nWe formed a work group to ensure we center these communities in our COVID-19 response. Quote Tweet Lt. Governor Peggy Flanagan @LtGovFlanagan I am proud to lead this work in partnership with @mnhumanrights Commissioner @RebeccaLuzLuz . To ensure Minnesotans have access to the same data that helps drive our decisions, we have launched a page on our dashboard to track this work. https:// mn.gov/covid19/data/c ommunity-data/overview.jsp  Show this thread", "2020-04-18T00:33:41.000Z": "Done. We will continue to support our beloved local restaurants that are keeping Minnesotans fed during a really challenging time. #StayHomeMN  #mnleg Quote Tweet MNN Newsroom @StateWideNewsMN MN House passes beer, wine to-go bill on a vote of 129-1; Gov Walz says he'lls sign ASAP #mnleg", "2020-04-17T21:16:18.000Z": "Giving back Fashion-forward Keeping fellow Minnesotans safe and healthy\n \nStories like these of small businesses seeing a need in their community and rushing to fill it make me proud to be a Minnesotan. #MNStrong Buying one of these fashionable masks will help feed the hungry in Minnesota Ingenuity and time on their hands were the genesis of this fundraiser. startribune.com", "2020-04-17T18:58:21.000Z": "I'm joining our team at @mnhealth , Emergency Medicine Doctor John Hick, and @mnnurses President Mary Turner for a daily briefing on COVID-19. Tune in Governor Walz's 4/17/20 COVID-19 Briefing The health and safety of Minnesotans is my top priority. Tune in for an update on our state's response to COVID-19. youtube.com", "2020-04-17T14:37:13.000Z": "I'm proud to officially proclaim April 11-17 to be the Week of the Young Child in Minnesota, in honor of the child care providers supporting our first responders. Let's recognize their heroic efforts, especially during this unprecedented time  #StayHomeMN", "2020-04-16T21:34:24.000Z": "When Minnesotans say they support our small businesses, they mean it. That's one thing that hasn't changed during this pandemic. We will get through this unprecedented crisis together. #MNStrong Minnesota ranked a state with small businesses least affected by pandemic | Detroit Lakes Tribune Detroit Lakes Tribune your best local source for news, sports, and weather in the Detroit Lakes area dl-online.com", "2020-04-16T19:15:56.000Z": "We're doing all we can to protect Minnesotans' health and well-being. But we aren't in this alone. Our success depends on our neighbors' success. Today @GovWhitmer  @GovMikeDeWine  @GovEvers  @GovPritzker  @GovHolcomb  @GovAndyBeshear and I agreed to weather this pandemic as a team.", "2020-04-16T00:19:58.000Z": ". @GwenWalz and I send our love to our friend @AGEllison through this unimaginable loss. Let's resolve to do all we can to stop COVID-19 from taking more of our loved ones. Minnesota Attorney General Keith Ellison's mother dies from COVID-19 complications Minneapolis City Council Member Jeremiah Ellison says positive coronavirus test made it feel like grandmother \"was snatched from us.\" startribune.com", "2020-04-15T23:18:11.000Z": "Extremely proud of the folks at @mndeed who are leading the nation in making sure Minnesotans are getting through this pandemic with the support they need. These are unprecedented times, but we'll get through this by looking out for one another. #StayHomeMN  #MNStrong Quote Tweet MN DEED @mndeed DEED has fully implemented the Pandemic Emergency Unemployment Compensation (PEUC), which provides a 13 week extension of unemployment benefits for eligible applications: https:// bit.ly/34BJYDk", "2020-04-15T22:10:12.000Z": "ICYMI: Today may technically be #TaxDay , but this year we have a few extra months to file. Mark July 15 on your calendar! Quote Tweet Minnesota Revenue @MNRevenue Reminder: You have until July 15 to file & pay your individual income tax. \nExpecting a refund? File when ready so we can send any refund owed. \nDon't need extra time? We encourage these Minnesotans to file & pay when ready to help support the ongoing COVID-19 response across MN.", "2020-04-15T19:21:12.000Z": "Here's a refresher on what's open and what's closed during Minnesota's Stay Home Order. Questions? Our new COVID-19 website is a great resource: http:// mn.gov/COVID19 .", "2020-04-15T17:27:38.000Z": "It's an honor to thank them personally, if virtually, for their work. Many, like @NSmithholt12 , were compelled to share their stories because someone they loved couldn't survive to their next paycheck without insulin. They fought for this to save others. #InsulinForAll", "2020-04-15T17:27:37.000Z": "Minnesota took major action to make insulin accessible to people whose lives depend on it today. This bipartisan achievement couldn't have happened without the bravery, persistence, and dedication of folks who showed up day after day to share their stories.", "2020-04-15T16:33:12.000Z": "I'm proud to sign the Alec Smith Insulin Affordability Act, digitally surrounded by advocates like @NSmithholt12 and legislators from both sides of the aisle who worked tirelessly to make this happen. Tune in: http:// Facebook.com/GovTimWalz   #InsulinForAll", "2020-04-15T01:29:39.000Z": "Happy birthday, Erna! Cheers to 112 years of good breakfast and even better humor. I'm glad it was spent with friends and loved ones, even from afar. Oldest-living Minnesotan celebrated with 112th birthday parade Erna Zahn says the secret to longevity is a good breakfast. startribune.com", "2020-04-15T00:29:26.000Z": "Don't underestimate your local bookstore! Even while social distancing, they're finding creative ways to keep serving and connecting with Minnesotans during this pandemic. #StayHomeMN Quote Tweet MPR News @MPRnews During the COVID-19 outbreak, many small bookstores across Minnesota have found creative ways of dealing with the challenge: Curbside pickup, virtual reading, story time and book club, and more. https:// mprnews.org/story/2020/04/ 13/indie-booksellers-turn-virtual-in-response-to-pandemic ", "2020-04-14T22:22:23.000Z": "Right now, we're all on the same team. #OneMinnesota Quote Tweet Minnesota Twins @Twins Together we are #OneMN .", "2020-04-14T21:35:24.000Z": "During a dark time, this is a long-awaited silver lining for the 300,000 Minnesotans who struggle to afford the ever-increasing price of a life-saving drug. Thank you for your work, Mike, Nicole, and all the advocates who fought to get this bill across the finish line. Quote Tweet Glen Stubbe @gspphoto Nicole Smith-Holt @NSmithholt12 wiped away tears as the Alec Smith Insulin Affordability Act passed #mnleg overwhelmingly thanks to @mikehowardmn .  The bill was inspired by son Alec who died because he tried to ration his insulin #insulin4all", "2020-04-14T20:32:02.000Z": "I've had the privilege of meeting Karl and I'm deeply sorry for the loss in his family.\n \nMinnesota has lost 79 of our grandparents, brothers, parents and loved ones to this virus. Each one is heartbreaking. We need to keep working to contain this-it will save lives. #StayHomeMN Quote Tweet NBA @NBA The NBA family mourns the passing of Jacqueline Cruz, loving mother to Karl-Anthony Towns. \nJacqueline was beloved around the NBA and a great source of strength and inspiration for her family.  \nWe extend our deepest condolences to the Towns family during this difficult time.", "2020-04-14T16:26:29.000Z": "Many Minnesotans have had to find creative spaces to work from home while in quarantine. Scout finally has his work station set up, in front of the TV of course.", "2020-04-14T00:08:00.000Z": "Minnesota has taken life-saving action, but the threat of COVID-19 remains. The next stages of this virus will challenge us. Today we extended our peacetime emergency, allowing us to quickly respond to this rapidly-evolving virus and protect Minnesotans' health and wellbeing.", "2020-04-13T22:43:00.000Z": "When you're done watching Tiger King (and let's be honest, you probably already are) take in some nature right from home with @mndnr 's Eagle Cam! #StayHomeMN  https:// youtube.com/watch?v=9IQPIo xTAh0&feature=emb_logo ", "2020-04-13T21:32:00.000Z": "A new program from @2Harvest and MN restaurants is keeping local chefs employed AND providing more than 30,000 meals a week for Minnesotans in need. Small Businesses are stepping up the Minnesota way - with compassion and creativity. Inspiring. #MNStrong Minnesota Central Kitchen gives restaurant workers jobs while feeding those who are hungry Inspired by humanitarian and chef José Andrés, the Minnesotans are using the area's talent and resources to provide hunger relief in the midst of a crisis. startribune.com", "2020-04-13T21:13:08.000Z": "I'm sorry to hear this terrible news. These businesses hold a special place in many of our hearts. I'm keeping the tight-knit Grand Marais community in my thoughts today. And tomorrow, we will rebuild. Quote Tweet WTIP Community Radio @WTIPradio This video from 1:55 p.m. in downtown Grand Marais. At 3:20 p.m. significant progress has been made on the fire. Buildings burning in downtown Grand Marais on a day that won't be forgotten...", "2020-04-13T20:05:15.000Z": "I'm grateful folks are staying home to prevent the spread of COVID-19, but fewer cars on the road doesn't give Minnesotans clearance to speed. Please drive safely, Minnesota - we've seen too many recent tragedies on our roads. #StayHomeMN Quote Tweet MN Traffic Safety @MnDPS_OTS Of the 28 fatalities on Minnesota roads since March 16, half (14) are either speed-related or caused by careless/negligent driving. Let's make sure hospital beds are available for those dealing with #COVID19 . Preventing critical injuries from a crash can help make that happen.", "2020-04-13T19:03:37.000Z": "Metro Mobility is stepping in to help our health care workers weather the storm created by COVID-19 with free door-to-door transportation. Thank you! #MNStrong Quote Tweet Metropolitan Council @MetCouncilNews We're marshaling our resources for health workers to provide a safe and stress-free trip to and from work. Metro Mobility is offering a free door-to-door service for any person who works at a healthcare facility, 24 hours a day, 7 days a week. https:// metrocouncil.org/News-Events/Tr ansportation/Newsletters/Transportation-for-essential-health-workers.aspx ", "2020-04-12T20:56:06.000Z": "Wishing all a blessed and joyful Easter on this snowy Minnesota day. While many traditions will prove challenging this year, I am grateful to spend this holiday celebrating with my family at home.", "2020-04-11T22:32:30.000Z": "We know this is hard. But from the start, we responded to COVID-19 as #OneMinnesota . We've put our neighbors ahead of ourselves and because of that, Minnesota currently has the lowest national infection rate. Keep it up, Minnesota! #StayHomeMN  #MNStrong Early efforts to halt virus spread may have spared some states, CDC says Areas that closed schools early and enforced strict social distancing may have avoided the brunt of new cases. apple.news", "2020-04-11T15:51:15.000Z": "Happy Birthday to Vera Mueller whose recent victory against COVID-19 is only her latest  accomplishment in 104 years of being an exemplary Minnesotan.\n\nThank you Vera. You, your family, and the health workers by your side are giving us all hope! #MNStrong At 104, Minnesota woman may be oldest in U.S. to survive COVID-19 Her son is convinced that Vera Mueller's faith pulled her through. startribune.com", "2020-04-11T14:06:39.000Z": "Minnesota is home to one of the nation's strongest health care systems - our doctors, nurses, and health care workers are working around the clock to prepare for what's ahead. We can't take their sacrifices for granted. Every Minnesotan must continue to do their part. #StayHomeMN", "2020-04-10T22:00:09.000Z": "I hope you're getting outside this weekend, Minnesota! Just remember to practice social distancing (our puppy Scout has some learning to do...) and cover your face to protect others. Bonus points for creative or MN themed masks.", "2020-04-10T20:49:40.000Z": "The historic Split Rock Lighthouse is only lit a couple times a year. Tonight, watch for a 'beacon of hope' over Lake Superior. Quote Tweet Lt. Governor Peggy Flanagan @LtGovFlanagan We are facing a challenging time, but Minnesotans are showing hope and resilience. Tonight, @mnhs is lighting historic Split Rock Lighthouse as a \"beacon of hope\" for Minnesotans. Tune in live on the Split Rock Facebook page at sundown #MNStrong twitter.com/mnhs/status/12", "2020-04-10T19:56:31.000Z": "Minnesotans care about their neighbors. We're willing to go the extra mile and make sacrifices to protect one another. Those sacrifices are making a difference. We can't let up now. Our neighbors' lives depend on this. #StayHomeMN EDITORIAL | Stay-at-home strategy is working for Minnesota The extension to May 4 is the right choice to keep the progress state has made vs. COVID-19. startribune.com", "2020-04-10T17:07:20.000Z": "This year, it will look different. We must find new and meaningful ways to practice our faith that protect the health of our loved ones. How will your family celebrate the holidays this year? #StayHomeMN", "2020-04-10T17:07:19.000Z": "Easter has always been a special time in my house-a time for reflection and gratitude. For Minnesotans of all religions, holidays are a time when families gather together and houses of worship burst with faithful energy.", "2020-04-10T16:00:01.000Z": "It's going to take every community in Minnesota coming together to slow the spread of COVID-19. We have materials to share in multiple languages to help keep all our neighbors safe, healthy, and up-to-date. #StayHomeMN  http:// mn.gov/covid19/media/ translations/ ", "2020-04-10T00:23:54.000Z": "Across the country our landmarks are going blue to shine a light on the dedication and selflessnesss of our health care workers. Minnesota's proud to #LightItBlue on the 35W bridge Quote Tweet Minnesota Department of Transportation @MnDOT The I-35W Bridge in Minneapolis will glow light blue tonight to honor healthcare providers and essential workers. Other landmarks and buildings in Minnesota, and in states across the U.S., will also be lit blue to show support to workers helping during the pandemic. #LightItBlue", "2020-04-09T22:20:28.000Z": "Thank you for the support! We're in this together. #MNStrong", "2020-04-09T21:05:00.000Z": "COVID-19 had disrupted all of our lives, but it always lifts my spirits to see the ways Minnesotans are finding small ways to lift each other up - I know we're going to get through this, together. #StayHomeMN In Minneapolis' North Loop, cheering for medical workers catches on Every night at 7 p.m., neighbors step out on their balconies to show their appreciation. startribune.com", "2020-04-09T19:59:05.000Z": "ICYMI - Minnesota is one of the first states to make sure folks are getting this extra support. #StayHomeMN Quote Tweet MN DEED @mndeed DEED has authorized the first payments of the temporary additional compensation of $600/week for people receiving unemployment benefits. If you receive unemployment you will also automatically receive an additional $600 for every week you remain eligible: https:// bit.ly/2RnGizQ", "2020-04-09T00:18:39.000Z": "#MinnesotaProud  https:// twitter.com/Super70sSports /status/1247992095236816899  This Tweet is unavailable.", "null": "", "2020-04-08T23:40:00.000Z": "Happy Passover to all who celebrate! Under normal circumstances this is a time to celebrate resilience, family and faith with loved ones. I know Minnesotans will find ways to honor those values, which are more important than ever, even though we're physically apart. Chag sameach.", "2020-04-08T20:16:47.000Z": "By staying home, Minnesotans are pushing out the peak of COVID-19. But we can't let up. Decisions we make now will have life or death impacts for our neighbors and loved ones down the road. That's why today we extended our Stay Home order until May 4. #StayHomeMN", "2020-04-08T19:49:15.000Z": "We fully support @GovTimWalz in asking Minnesotans to continue to stay at home and practice diligent social distancing. It is working. We thank Gov. Walz for working closely with hospitals and health systems across Minnesota. https:// mnhospitals.org/Portals/0/Docu ments/news/Rahul%20Koranne%20Statement%204-8-20.pdf   #stayhomeMN", "2020-04-08T18:57:54.000Z": "The health and safety of Minnesotans is my top priority. Tune in for an update on next steps in our state's response to COVID-19  https:// youtube.com/watch?v=h-wd_K OKMl0   #StayHomeMN", "2020-04-08T15:15:23.000Z": "Last night I signed a bipartisan measure to support our first responders and front line workers during this pandemic. Coronavirus In Minnesota: State Legislature Passes New Protection For Front-Line Workers Minnesota's coronavirus infection count surpassed 1,000 Tuesday, as lawmakers moved closer to passing legislation to ensure first responders and health care workers on the front lines of the battle... minnesota.cbslocal.com", "2020-04-07T23:32:00.000Z": "News about #COVID19 travels fast. The best way to keep you and your loved ones safe is to follow reliable, fact-based public health advice. Sign up for our daily COVID-19 updates to receive a daily digest each evening straight to your inbox #StayHomeMN  https:// public.govdelivery.com/accounts/MNGOV /subscriber/questions/new ", "2020-04-07T18:44:17.000Z": "It's easy to find the heroes in this pandemic. Our first responders & health care workers are putting themselves on the front line of this battle every day. They need to know we have their backs. Pleased we were able to come to a consensus on this. https:// house.leg.state.mn.us/members/profil e/news/12266/29296   #mnleg", "2020-04-07T20:02:00.000Z": "Today we announced @cubfoods and our Children's Cabinet partnered to ensure child care providers can get supplies they need. Grocers are working tirelessly to keep Minnesotans fed - and they're going the extra mile for our child care providers and emergency workers.", "2020-04-07T17:53:04.000Z": "On #WorldHealthDay , let's celebrate the brave health care workers clocking in day and night to keep Minnesotans safe. \n\nThank you to ALL health care workers putting their lives on the line to save others right now The #1 way we can support them is by staying home. #StayHomeMN", "2020-04-07T14:07:15.000Z": "Just finished our weekly briefing with @GovTimWalz , @MDHCommMalcolm and our congressional delegation. We're neither big nor flashy, but we are mighty, well-managed, and collaborative. More difficult days are ahead, but 'The Good Life in Minnesota' will return. #optimism", "2020-04-07T00:15:00.000Z": "The toll this pandemic takes on our fellow Minnesotans isn't just physical. Economic hardship and isolation from our neighbors and loved ones is challenging our mental health as well. Today I signed a measure to increase telehealth options for mental health support.", "2020-04-06T22:54:00.000Z": "Our veterans chose to raise their hand to serve our country - they deserve our unwavering support during this challenging time. I encourage all veterans struggling during the COVID-19 pandemic to apply for our newly available @MNVeteran relief grants. http:// MinnesotaVeteran.org/COVIDRelief", "2020-04-06T18:57:00.000Z": "Deeply grateful for the chance to speak to children, parents, front line workers, and all Minnesotans about our new reality and the challenges ahead. We are resilient. We will come out stronger on the other side. Watch here if you missed it  #MNSOTS Governor Walz's 2020 State of the State Address It's more important than ever that we come together as #OneMinnesota to address #COVID-19. Tune in live for my State of the State Address. #MNSOTS youtube.com", "2020-04-06T17:14:00.000Z": "When the going gets tough, Minnesotans support our neighbors. As Asian Americans report discrimination amid COVID-19, remember this: Viruses don't discriminate and neither should we. Law enforcement and our new helpline are here for support: 833-454-0148.", "2020-04-06T12:50:03.000Z": "As promised, we are clarifying Work Comp language to make sure Covid -19 front line workers, nurses, fire, police, etc.,are covered by work comp if they get the virus.  Senate and House will pass the bill Tuesday.", "2020-04-06T15:44:59.000Z": "I'm proud of the tireless, bipartisan collaboration between the legislature, businesses and labor that went into getting this to the finish line. Our front line employees are fighting nonstop to keep Minnesotans safe - if they get sick on the job, we need to be there for them. Quote Tweet Melissa Hortman @melissahortman The #mnleg will reconvene on Tuesday to pass legislation to address workers' compensation claims for our first responders, police officers, firefighters, and health care workers, including home health care workers. Read the full statement from leaders: https:// house.leg.state.mn.us/members/profil e/news/12266/29272  Show this thread", "2020-04-06T15:00:00.000Z": "Minnesotans are making an amazing effort to prevent the spread of this virus and keep our neighbors safe and healthy. Thank you. #StayHomeMN Minnesota's COVID-19 response shows promise in helping to slow virus Gov. Tim Walz said he will be looking this week for updated modeling and any signs of the infection ebbing before deciding on extend his stay-at-home order. startribune.com", "2020-04-06T00:12:48.000Z": "The State of our State is strong. The State of our State is resilient. The State of our State is united. #MNSOTS", "2020-04-06T00:12:06.000Z": "We won't just make it to spring. We will come out better on the other side of this winter. Because we are Minnesotans. We see challenges-and we tackle them. #MNSOTS", "2020-04-06T00:09:55.000Z": "Spring will arrive. And when it does, we will dig out. We will do whatever it takes to support Minnesotans and businesses to get back on their feet. #MNSOTS", "2020-04-06T00:09:39.000Z": "While we may be separated physically, we stand united. From Rondo to the Range, from North Minneapolis to North Mankato, we are One Minnesota. #MNSOTS", "2020-04-06T00:07:01.000Z": "My promise is to continue to communicate my decisions, explain when we change course, and never stop fighting alongside you, the people of Minnesota. #MNSOTS", "2020-04-06T00:04:50.000Z": "Minnesotans are hardworking people who step in to help. In many storms, that means plowing your neighborhood, filing sandbags, or trudging through the snow to check on your loved ones. \n\nNow that means staying home. What you are doing isn't paralysis-it is action. #MNSOTS", "2020-04-06T00:03:30.000Z": "We won't just prepare for COVID-19 - we will lead. #MNSOTS", "2020-04-06T00:02:19.000Z": "We are used to long winters in Minnesota. We are resilient people with a deep reserve of courage, optimism, and grit. \n\nBut this will be a winter like we've never seen before. #MNSOTS", "2020-04-06T00:01:03.000Z": "Self-quarantine. Self-isolation. Social distancing. Phrases that many of us never used before now roll off our tongue in daily conversation. \n\nA new vocabulary to define a new reality. #MNSOTS", "2020-04-05T23:55:01.000Z": "It's more important than ever that we come together as #OneMinnesota to address the crisis of COVID-19. Tune in live for my State of the State. #MNSOTS Governor Walz's 2020 State of the State Address It's more important than ever that we come together as #OneMinnesota to address #COVID-19. Tune in live for my State of the State Address. #MNSOTS youtube.com", "2020-04-05T22:45:00.000Z": "We're facing an unprecedented crisis in COVID-19. I look forward to the chance to speak directly to Minnesotans tonight. #MNSOTS", "2020-04-05T13:30:00.000Z": "Good morning! Reminder: Tonight at 7pm I'll give my second State of the State address. You can tune in live on our Facebook page. #MNSOTS", "2020-04-05T00:20:00.000Z": "Hey Minnesota, my second State of the State address is tomorrow! I'm looking forward to addressing Minnesotans about how we're going to get through this unprecedented crisis as #OneMinnesota . Tune in at 7pm. #MNSOTS", "2020-04-04T23:08:05.000Z": "Great burger from @redcow_mn ! Thanks to folks making food for carry out.", "2020-04-04T19:37:00.000Z": "Remember that your choice to stay home is an act of compassion and generosity that will save lives. All Minnesotans are making a difference each and every day. #StayHomeMN", "2020-04-04T16:06:36.000Z": "Following our local news is more important than ever. They're putting out facts, not fear, and that's what it's going to take to get through this together. #StayHomeMN", "2020-04-03T20:24:44.000Z": "During Minnesota's Stay Home Order, we are working to collect data, increase the availability of life-saving equipment, and develop strategies to address the economic and social impacts of COVID-19.", "2020-04-03T17:58:11.000Z": "During Minnesota's Stay Home Order, we are working tirelessly to track the spread of COVID-19 and increase hospital capacity across the state. Tune in for an update on our response Governor Walz's 4/3/20 COVID-19 Address During Minnesota's Stay Home Order, we've been working to increase hospital capacity and track the spread of COVID-19. Tune in for an update on our response youtube.com", "2020-04-03T17:10:02.000Z": "I'm proud to proclaim April 3rd as First Avenue Day in Minnesota and I know Minnesotans look forward to the day we can celebrate together", "2020-04-03T17:10:01.000Z": "Cheers to 50 years of bringing Minnesotans together, @FirstAvenue ! During times like these, it's even more important to take a moment to recognize what defines the Minnesota we know and love.", "2020-04-03T15:22:26.000Z": "I agree. First responders are putting their physical and mental health on the line battling this pandemic. They deserve more than our thanks - they deserve our collective energy, resources, compassion, and support. #StayHomeMN OPINION EXCHANGE | National Guard adjutant general: Fellow Minnesotans, join the fight against... It is essential to unite behind those responding to this crisis with the same passion shown to those of us in the armed forces. startribune.com", "2020-04-03T00:55:11.000Z": "To the countless first responders, law enforcement, and correctional employees working tirelessly to keep our communities safe during COVID-19: Thank you for going to work so others can stay home. #StayHomeMN  Quote Tweet MN Dept. of Corrections @MinnCorrections Thank you to our corrections officers, healthcare workers, agents, and other essential staff who are continuing to provide community safety services during this pandemic. Minnesota thanks you!", "2020-04-02T23:37:22.000Z": "Minnesota is consistently ranked one of the most generous states and this crisis is no exception - great to see Minnesotans showing up for each other and for their communities during these unprecedented times. Quote Tweet MCF @FollowMCF MCF and Saint Paul & Minnesota Foundation award $2 million in grant funding to organizations for the Minnesota Disaster Recovery Fund for coronavirus. See who was funded and the communities they serve: http:// mcf.org/MDRF", "2020-04-02T21:19:10.000Z": "I'm proud to announce today that Minnesota's health plans have agreed to waive COVID-19 expenses. Removing cost barriers to care will help ensure no Minnesotan has to sacrifice rent or groceries to cover a hospital bill from COVID-19.", "2020-04-02T21:04:13.000Z": "If fair representation and potential loss of federal funding haven't motivated you to fill out the Census yet, the thought of losing to Wisconsin should  http:// My2020Census.gov Quote Tweet David Montgomery @dhmontgomery My latest for @MPRnews : two familiar rivals, Minnesota and Wisconsin, are battling for the top Census response rate. \n\nThere's more than bragging rights at stake - MN could lose a congressional seat with a low count. My story: https:// mprnews.org/story/2020/04/ 01/minnesota-tops-nation-in-census-response-with-a-familiar-rival  Show this thread", "2020-04-02T00:30:51.000Z": "On Sunday evening I will give my second State of the State address. COVID-19 presents an unprecedented hardship to our state, but Minnesotans always rise to a challenge. I look forward to the opportunity to speak directly to Minnesotans during this uncertain time.", "2020-04-01T22:01:20.000Z": "Applications for child care grants open today! This funding complements work from the private sector, foundations across the state, and @ThinkSmallMN in providing critical support for our workers on the front lines of #COVID19 . Peacetime Emergency Child Care Grants - Child Care Aware MN Grants for licensed child care providers serving essential workers during the COVID-19 public health emergency. childcareawaremn.org", "2020-04-01T18:43:56.000Z": "Thank you to everyone stepping into new roles to support our kids while we work through distance learning. I know it's challenging for our teachers AND our parents, but we're in this together. #StayHomeMN", "2020-04-01T15:10:58.000Z": "It's #CensusDay , Minnesota! Don't let social distancing guidelines keep you from being counted. I encourage you to take 5 minutes today to complete your Census form by phone, online, or by mail.\n\nLet's make sure every single Minnesotan is counted.", "2020-03-31T21:04:00.000Z": "COVID-19 presents an unprecedented challenge for our families, our businesses and our communities. I want you to know that we're doing everything we can to fight this virus and we ask you to do your part too. Stay home if you can, Minnesota. It could save lives. #StayHomeMN", "2020-03-31T16:59:14.000Z": "Happy Tuesday from Afton, who's adjusting to self-quarantine just fine.", "2020-03-31T15:07:00.000Z": "Stay At Home should never mean you stay somewhere unsafe. There are places of sanctuary open for anyone facing abuse or violence. Please call Minnesota's statewide crisis hotline - available 24 hours a day, 7 days a week - at 1.866.223.1111 or text 612.399.9995.", "2020-03-31T00:41:15.000Z": "It's fitting that today is #NationalDoctorsDay . Our doctors and health care workers deserve our deepest gratitude - they're risking their lives to save others during this pandemic. As they work around the clock, you can help them by staying home. #StayHomeMN", "2020-03-30T20:52:13.000Z": "Commissioner Roberts-Davis will focus on managing inventories, securing needed supplies such as personal protective equipment and ventilators, and developing solutions to offset supply shortages for hospitals and emergency responders.", "2020-03-30T20:52:12.000Z": "Our front-line health care professionals deserve our complete support - that starts with giving them the tools they need to keep themselves and their patients healthy. \n\nToday I appointed Commissioner @acalicerd to lead Minnesota's effort to maintain lifesaving care supplies.", "2020-03-30T16:55:00.000Z": "As a former teacher, I'm rooting for our students, parents, and educators today as Minnesota takes on a new challenge! #StayHomeMN Coronavirus In Minnesota: Learning Curves Expected As Distance Learning Begins Distance learning begins in Minnesota schools Monday with the expectation that it will continue until at least May 4. minnesota.cbslocal.com", "2020-03-29T23:04:00.000Z": "Minnesotans: Join me in thanking our health care professionals, first responders, educators, grocers, farmers, child care providers, public employees, and so many more on the front lines of this crisis. #StayHomeMN", "2020-03-29T15:22:00.000Z": "These may be challenging times, but Minnesotans look out for one another and that's how we're going to get through this. Here are a few ways YOU can give back to our community right now.", "2020-03-29T00:31:27.000Z": "Thanks for the suggestions so far! \n\nUpdate from Gus: Tournament wrapped up, and he's currently reading Star Wars: Revenge of the Sith.", "2020-03-29T00:15:20.000Z": "Let's start the state's largest book club. What are you reading, Minnesota? Gwen: Mississippi Sissy\n\nHope: Uneasy Peace\n\nGus: Xbox tournament (working on it) \n\nMe: Just finished Cryptonomicon, looking for suggestions.", "2020-03-28T21:15:00.000Z": "Worried about health care costs? It's more important than ever that we're all covered right now . Remember you can sign up on MNsure any time before April 21 at http:// mnsure.org . #StayHomeMN", "2020-03-28T17:29:04.000Z": "Just signed a comprehensive COVID-19 package to keep Minnesota healthy, support our food systems, and care for our most vulnerable in the face on an unprecedented crisis.\n\nProud of the way the Legislature worked across the aisle to get this done. #OneMinnesota  #StayHomeMN", "2020-03-27T22:46:03.000Z": "In order to protect folks who've lost income & jobs, @GovTimWalz has suspended evictions during the #COVID19 emergency except for reasons of safety. If you or someone you know feel you're being wrong evicted, contact my office here https:// ag.state.mn.us/Office/Forms/T enantEvictionComplaint.asp  or at (651) 296-3353.", "2020-03-28T00:35:18.000Z": "Thank you to all our first responders across Minnesota, including these two good boys. #StayHomeMN Quote Tweet Hennepin Sheriff @HennepinSheriff Max and Luka are very good boys who remember to practice #socialdistancing . If you have to go out, remember to stay six feet apart. Show this thread", "2020-03-27T21:53:00.000Z": "I'm grateful for @LtGovFlanagan 's partnership and leadership now more than ever. While we're keeping distance from each other, we're responding to #COVIDー19 as a team. https:// minnpost.com/state-governme nt/2020/03/lt-gov-peggy-flanagan-has-been-out-of-sight-during-the-states-covid-19-response-thats-part-of-the-plan/   #StayHomeMN Lt. Gov. Peggy Flanagan has been out of sight during the state's COVID-19 response. That's part of... The state's continuity of operations plan calls for the governor and lieutenant governor to stay away from each other as a means of preventing both from becoming sick with COVID-19 at the same time. minnpost.com", "2020-03-27T18:58:00.000Z": "Minnesota's two-week Stay at Home order takes effect tonight at 11:59. Here's what's open and what's closed. \n \nStill have questions? Head to http:// mn.gov/stayhomemn for resources and answers to frequently asked questions. \n \nLet's keep fighting #COVIDー19 , together. #StayHomeMN", "2020-03-27T17:25:47.000Z": "We're in uncharted waters, but we're rowing the boat together. #StayHomeMN Quote Tweet Minnesota Football @GopherFootball We know one thing for certain: we'll get through this together.\n\nWash your hands, stay at home, put your oar in the water and ROW. #UMNProud", "2020-03-27T00:30:00.000Z": "In collaboration with our Children's Cabinet, six Minnesota foundations today joined @ThinkSmallMN in launching a statewide child care program. I'm proud to support this effort, which provides invaluable education and services to our state's emergency response.", "2020-03-26T23:18:00.000Z": "The Legislature came together in a quick, bipartisan fashion to pass our proposed #COVIDー19 legislation. I look forward to signing these bills to keep our state working , support our food systems , care for children of emergency workers , and more. Minnesota Legislature passes $330 million COVID-19 aid bill The Minnesota Legislature passed a $330 million financial aid package Thursday to help soften the economic impact and help public agencies and the state's health system kick into high gear to fight... startribune.com", "2020-03-26T22:09:32.000Z": "Can't tell you how much @GwenWalz and I appreciate all you're doing to step up and protect your neighbors during the #COVIDー19 pandemic. Stay healthy, Minnesota. #StayHomeMN", "2020-03-26T15:21:17.000Z": "I want to thank all of the health care providers who are working around the clock to keep Minnesotans safe and healthy and prepare us for the weeks ahead. #StayHomeMN", "2020-03-26T15:21:16.000Z": "The health and safety of Minnesotans is my top priority. The COVID-19 pandemic presents unprecedented challenges. During this Stay at Home order, I will work with our world-renowned health care sector to build out hospital capacity and increase access to life-saving equipment.", "2020-03-26T00:02:00.000Z": "I urge you not to take our Stay at Home Order as an opportunity to stockpile more than you need. Our stores will have food and other necessary supplies, and our grocery store workers are keeping things stocked. This is about social distancing and taking precautions to save lives.", "2020-03-25T19:28:54.000Z": "The virus will still be here when this two-week period is over, but we'll be better prepared. We will work with our health care sector, manufacturers, business community, and strong-spirited Minnesotans across the state to tackle this virus head on. #StayHomeMN", "2020-03-25T19:28:53.000Z": "We must take bold action to save the lives of Minnesotans. As a former Command Sergeant Major in the Army National Guard, I believe in having a plan - which is why I'm directing Minnesotans to stay at home and limit their movements to essential services. #StayHomeMN", "2020-03-25T19:12:31.000Z": "The health and safety of Minnesotans is my top priority. I'm providing an update on our state's response to COVID-19 and what this means for our neighbors and our loved ones. Tune in: https:// facebook.com/GovTimWalz/vid eos/536202673961023/?v=536202673961023   #StayHomeMN", "2020-03-24T22:46:55.000Z": "And the final encouraging statistic for today:", "2020-03-24T22:46:53.000Z": "If you don't believe me, see for yourself: Coronavirus In Minnesota: State Among Best In U.S. For Social Distancing So Far Gov. Tim Walz says Minnesotans are doing a good job at keeping their distance, and there's data to back it up. minnesota.cbslocal.com", "2020-03-24T22:46:51.000Z": "Thank you, Minnesota. You're clearly making sacrifices and doing your part to make sure our hospitals have the supplies necessary to keep Minnesotans safe, and the data backs that up. #StayHomeMN", "2020-03-23T23:45:00.000Z": "Today I suspended evictions in Minnesota. COVID-19 is causing financial hardship for families across the state and we must ensure everyone can #StayHomeMN .", "2020-03-23T21:38:00.000Z": "To our small businesses facing unprecedented uncertainty: We're with you. Unemployment Insurance helps, but it's not enough. That's why I just signed an Executive Order to provide immediate relief by creating an emergency loan for struggling businesses.", "2020-03-23T17:37:12.000Z": "This isn't a typical Monday morning but we're still hard at work to combat the #COVIDー19 crisis. Minnesotans have been through long winters before, we'll get through this one like we always do, together. Be safe, and #StayHomeMN .", "2020-03-23T16:02:00.000Z": "Protective gear like face masks are essential for our hospitals, health care facilities, and first responders. The Minnesota National Guard wasted no time delivering these supplies for Minnesotans. Thank you. Minnesota National Guard Delivered 81,000 Face Masks To MDH In Response To Shortage Included in the delivery were more than 81,000 N95 masks, 17,296 pandemic flu kits, 1,153 Tyvek disposable coveralls, 2,265 boots and 2,263 gloves. minnesota.cbslocal.com", "2020-03-23T15:09:13.000Z": "After learning I had contact with someone who has COVID-19, I plan to lead by example and work from home. I currently have no symptoms and will continue working tirelessly to combat the spread of COVID-19. #StayHomeMN", "2020-03-23T13:10:40.000Z": "It's going to take every single one of us to fight this virus. Thanks for speaking up, Coach. #StayHomeMN Quote Tweet Minnesota Timberwolves @Timberwolves Ahead of tonight's Wolves-Clippers replay on @fsnorth , a message from Coach... #StayHomeMN", "2020-03-21T23:22:00.000Z": "Minnesota's strength comes from our ability to come together and lift each other up. Thank you @ThinkSmallMN for launching supportive local programs for over 4800 children of essential workers!", "2020-03-21T20:52:31.000Z": "Small businesses across Minnesota are putting the health of their neighbors before their bottom line. This loan assistance will help our state's businesses recover from the economic hardship caused by COVID-19. SBA offering federal disaster loans for Minnesota small businesses The U.S Small Business Administration is offering low-interest federal disaster loans for working capital to Minnesota small businesses suffering a substantial economic injury due to COVID-19... kstp.com", "2020-03-21T18:47:00.000Z": "Every Minnesotan deserves access to health coverage during this uncertain time. We worked with @MNsure to set up a special enrollment period to help ensure Minnesotans can receive the care they need during the #COVIDー19 crisis.", "2020-03-21T16:48:27.000Z": "Health officials today announced Minnesota's first death due to COVID-19. Gwen and I extend our deepest sympathy to their loved ones during this time of loss. As the virus continues to spread in Minnesota, we must all continue to do everything we can to keep each other safe.", "2020-03-21T00:13:00.000Z": "Thank you to the nearly 1000 Minnesota child care providers who've agreed to continue serving children of emergency workers during the COVID-19 crisis. All child care providers, including those who have had to close temporarily, provide critical care for our littlest Minnesotans.", "2020-03-20T23:04:55.000Z": "No one should be targeting Minnesotans for personal gain during the #COVIDー19 crisis. Today I signed an Order banning price gouging during times of emergency. Minnesotans can report instances of price gouging by calling 800-657-3787. Minnesota governor signs executive order prohibiting price gouging amid COVID-19 pandemic Minnesota Gov. Tim Walz signed three more executive orders Friday, including one prohibiting stores from price gouging amid the outbreak of COVID-19, the disease caused by the novel coronavirus. fox9.com", "2020-03-20T20:12:05.000Z": "Thank you @Twins for getting the word out to Minnesotans to #StayHomeMN . Together we can #FlattenTheCurve to protect our family, friends, and neighbors. Quote Tweet Jake Odorizzi @JakeOdorizzi Minnesotans are stepping up to #FlattentheCurve . Remember it's not about you, it's about your grandparents, your friend who's a healthcare worker, or your neighbor with a health condition. We can overcome this, but only if we #StayHomeMN .", "2020-03-20T19:09:45.000Z": "I'm joining our team at @mnhealth for a daily briefing on #COVIDー19 . Tune in. : Governor Tim Walz on Facebook Watch I'm participating in a daily briefing by the Minnesota Department of Health on COVID-19. The best way to keep you and your loved ones safe and healthy is... facebook.com", "2020-03-20T17:57:27.000Z": "I'm joining our team at the @mnhealth for a daily briefing on COVID-19 at 2pm. Tune in : http:// facebook.com/GovTimWalz/", "2020-03-19T23:17:50.000Z": "Spread the word: Stay home if you can and save lives. #StayHomeMN", "2020-03-18T23:59:58.000Z": "Taking care of one another is one tradition all Minnesotans share. I applaud this coalition of statewide partners for launching the Minnesota Disaster Recovery Fund to respond to the unprecedented economic challenges our neighbors are facing. #OneMinnesota Quote Tweet MCF @FollowMCF Today MCF and @spmcfoundations launch the Minnesota Disaster Recovery Fund (MDRF) for \ncoronavirus with over $4.4 MIL in philanthropic contributions from first funders. Click here for details: https:// mcf.org/minnesota-disa ster-recovery-fund-coronavirus  Show this thread", "2020-03-18T20:04:26.000Z": "It is more important than ever that we pull together, take care of each other, and stay informed on the #COVIDー19 pandemic. : Governor Tim Walz on Facebook Watch It is more important than ever that we pull together, take care of each other, and stay informed on the COVID-19 pandemic. facebook.com", "2020-03-18T15:23:00.000Z": "As our Asian American community faces heightened discrimination due to COVID-19, my message is clear: Viruses don't discriminate and neither should we. #OneMinnesota", "2020-03-18T00:15:00.000Z": "Minnesotans, do you have questions about COVID-19? Call the Department of Health hotline, open every day between 7AM and 7PM: \nMetro: 651-297-1304\nGreater MN: 1-800-657-3504", "2020-03-17T21:31:00.000Z": "We must do everything we can to support workers who are negatively impacted by #COVIDー19 . That is why I signed an Executive Order yesterday to ensure Minnesotans who are not able to work due to COVID-19 have access to Unemployment Insurance. More info: https:// bit.ly/392GtGx", "2020-03-17T21:21:44.000Z": "Due to COVID-19, I sent a letter to House Speaker @melissahortman today announcing that I will no longer be giving my State of the State address in person. I will instead televise my address to the legislature and the State of Minnesota on a future date.", "2020-03-17T20:07:03.000Z": "Our #1 priority is combating #COVID -19, but doesn't mean democracy stops. Today I signed measures to: \nImprove safety on Hwy 14\nProvide emergency assistance after natural disasters\nOffer low-interest loans to farmers\nWhatever comes our way, we're still #OneMinnesota .", "2020-03-17T18:55:05.000Z": "Listen to @MHealthFairview : stay home, avoid big groups and wash your hands. #FlattenTheCurve  #StayHomeMN Quote Tweet M Health Fairview @MHealthFairview A fast increase in #COVID19 cases could overwhelm our community. Help us #FlattenTheCurve : Wash your hands, avoid big groups, and stay at home. We've all got to do our part to prevent the spread of COVID-19. \n\nLearn more.  http:// bit.ly/2It3MP0  #DontKidwithCOVID", "2020-03-17T16:39:45.000Z": "Thanks to my sister in law Maribeth Sagmoe who sent bars for my team! She then went to prepare to serve her students as a teacher in the Richfield Schools. That's what Minnesotans do!", "2020-03-16T22:32:06.000Z": "Now is the time to take decisive action to curb the spread of #COVIDー19 . That's why I'm ordering a partial closure of bars, restaurants & other places of public amusement or accommodation beginning tomorrow at 5 p.m. : Governor Tim Walz on Facebook Watch As the cases of COVID-19 in Minnesota continue to climb, we must take decisive action to curb the spread of this pandemic and protect the health and... facebook.com", "2020-03-15T23:37:01.000Z": "During the coming weeks, as we respond to #COVIDー19 , families will rely heavily on child care providers. As the child care providers respond to health guidance and changing circumstances, they will need support and flexibility from families too. Governor and Lt. Governor's COVID-19 update to child care providers content.govdelivery.com", "2020-03-15T19:49:18.000Z": "I'm there. Quote Tweet janashortal @janashortal I second this idea, what do you say @GovTimWalz  @LtGovFlanagan ? twitter.com/KyleClark/stat", "2020-03-15T15:01:51.000Z": "My top priority as Governor is the safety of Minnesotans, especially our kids. That's why I'm ordering the temporary closure of schools so we can put plans in place to educate and feed our students, regardless of what's to come. : Governor Tim Walz on Facebook Watch My top priority as Governor is the safety of Minnesotans. As a former teacher, and father of two teenage kids, I'm especially focused on the safety of... facebook.com", "2020-03-13T18:12:24.000Z": "The safety of Minnesotans is my top priority which is why I'm declaring a peacetime state of emergency. I advise and urge Minnesotans to follow @mnhealth community mitigation strategies to combat the spread of #COVIDー19 . : Governor Tim Walz on Facebook Watch The safety and well-being of Minnesotans is my top priority, and we are working around the clock to combat the spread of COVID-19. In addition to the... facebook.com", "2020-03-12T15:04:24.000Z": "Minnesotans know the importance of having a plan and being prepared for whatever comes our way. That's why @LtGovFlanagan and I are focusing our supplemental budget proposal on emergency response and preparedness. : Governor Tim Walz on Facebook Watch Minnesotans know the importance of being prepared for emergencies - having plans in place and resources stocked and ready. That's why Lieutenant Governor... facebook.com", "2020-03-12T01:09:05.000Z": "This afternoon I spoke with @SPPS_News Superintendent @JoeGothard and @SPFE28 President @nfabe and strongly encouraged both of them to head back to the table, negotiate in good faith, and come to an agreement that's good for our students, our schools, and our educators.", "2020-03-10T22:35:16.000Z": "Thank you to the disability community for letting your voices be heard today at the Capitol! Direct support professionals are critical to supporting Minnesotans with disabilities as they live full, meaningful lives, and we're committed to supporting them in that work #SeeOurDSPs", "2020-03-10T16:49:56.000Z": "Preparing our state for #COVIDー19 has become our top priority. This pressing public health crisis transcends partisanship. That's why I'm proud to sign this bipartisan legislation into law to prepare for a potential outbreak and protect the health of Minnesotans.", "2020-03-09T23:19:24.000Z": "My message at Minnesotanos Day at the Capitol this morning: we value and stand with our Latino community. From boosting our economy as small business owners and employees to contributing to the culture of our great state, we are stronger because you are here.", "2020-03-09T18:10:05.000Z": "Last Friday, I spent the morning celebrating National Reading Month with Minnesota's littlest learners. This month pick up a book and read with children in your life. #NationalReadingMonth  #MarchIsReadingMonth", "2020-03-08T23:36:22.000Z": "News Release: Health officials confirm second case of novel coronavirus in Minnesota News Release: Health officials confirm second case of novel coronavirus in Minnesota content.govdelivery.com", "2020-03-08T18:58:20.000Z": "Thank you to my partner-in-justice @LtGovFlanagan and all women who have been leading the way to better representation and better results for all Minnesotans. #IWD2020", "2020-03-08T18:58:19.000Z": "I'm proud to proclaim today #InternationalWomensDay . An equal world is a stronger world, because democracy works best when it reflects the communities we seek to represent. #IWD2020 Quote Tweet Lt. Governor Peggy Flanagan @LtGovFlanagan Happy #InternationalWomensDay ! On this day - and every day - we lift up the incredible women in our communities and their collective achievements. We honor those who have come before and whose shoulders we stand on. We commit to equality and equity in everything we do. #IWD2020", "2020-03-06T23:31:23.000Z": "Today, I announced the first #COVIDー19 case detected in Minnesota. This may be concerning, but the State of Minnesota is prepared. Learn more and stay up-to-date via @mnhealth : https:// health.state.mn.us/diseases/coronavirus/index.html ", "2020-03-06T22:04:27.000Z": "We are collaborating across state agencies and remain in close contact with both federal and local partners as we monitor developments with this outbreak. Our state is fortunate to have a strong public health sector and world-class health care providers to keep Minnesotans safe.", "2020-03-06T22:04:26.000Z": "The State of Minnesota has been working around the clock to prepare for #COVIDー19 and I am confident that @mnhealth is up to the challenge. Governor Tim Walz on Facebook Watch The State of Minnesota has been working around the clock to prepare for a potential coronavirus outbreak, and I am confident that our Department of... facebook.com", "2020-03-05T23:45:09.000Z": "I welcomed @VP Pence to Minnesota today for a conversation at @3M about how we can partner across state and federal government, as well as the public and private sectors, to keep Minnesotans healthy #COVIDー19", "2020-03-04T16:49:23.000Z": "Replying to @Angsto2  @MnDPS_DPS  and  @GovTimWalz If you are traveling through Terminal 1, pre-apply on the DVS website, and bring your documentation, you can finish the process here!", "2020-03-04T16:43:28.000Z": "\"We want to make this as painless and convenient as possible,\" @GovTimWalz said of the opening of a #REALID office at the @mspairport . \"Minnesotans need to get this done.\"", "2020-03-04T15:41:13.000Z": "More than 61,000 Minnesotans work in clean energy. We're celebrating their contributions with a proclamation from @GovTimWalz that today is #cleanenergybizday in Minnesota!", "2020-03-04T14:07:34.000Z": "Sitting down with our interns is always a highlight of my day. I love hearing their stories and passion for serving our state.\n\nWe're always looking for hardworking and passionate students to come work with us, so I encourage you to learn more and apply. https:// mn.gov/governor/conta ct/internships.jsp ", "2020-03-03T22:29:24.000Z": "Farmers in Clay, Kittson, Marshall, Traverse, and Wilkin counties may be eligible for assistance, including emergency loans, from @usdafsa under a recent disaster declaration in North Dakota for multiple disasters in 2019. Contact your local FSA office for more info. #MNAg", "2020-03-03T17:30:19.000Z": "Governor TIm Walz has declared it Women in Construction week here in Minnesota! Join us all week as we celebrate and recognize women in the #construction industry. ' #WICWeek2020", "2020-03-03T17:38:12.000Z": "Hey MN, today is our state's presidential primary! I encourage everyone to get out and vote today - and you can even register at the polls.\n\nLearn more and find your polling place here  https:// gttp.votinginfoproject.org", "2020-03-02T22:04:08.000Z": "Our Public Health Lab is now able to test for #COVID19 . This means testing can happen right here in Minnesota rather than sending samples to CDC, which will help to more quickly detect and treat cases. https:// kare11.com/article/news/h ealth/coronavirus/minnesota-ready-to-begin-testing-for-coronavirus/89-3a2dfa13-66ab-4806-93da-5bf2d0ac6639   #COVID_2019 Minnesota ready to begin testing for coronavirus The state public health lab is now equipped to test up to 100 people per day. kare11.com", "2020-03-02T16:44:47.000Z": "The best available guidance for avoiding #COVID19 is to take the same precautions you take for avoiding colds and flu:\n- Wash your hands thoroughly.\n- Cover your cough.\n- Stay home when sick.\n\nVisit our @mnhealth website for more info: https:// health.state.mn.us/diseases/coronavirus/index.html ", "2020-03-02T16:44:46.000Z": "The State of Minnesota is taking coronavirus seriously, and I receive daily briefings to monitor developments with this outbreak. While we are thankful that Minnesota has not had a case of novel coronavirus to this point, we are preparing for that possibility. #COVID19", "2020-02-28T23:37:04.000Z": "Proud to announce Patina Park and Mattie Harper DeCarlo are joining our Administration as the Director and Asst. Director of Tribal State Relations. These roles are steps toward actualizing our goal of tribal-state relationships built on respect, understanding, and sovereignty", "2020-02-28T21:54:43.000Z": "As someone who has driven countless miles on Highway 14 and who has lost a dear neighbor on this road, this issue is personal to me and it's personal to everyone in Southern Minnesota. Today I was proud to announce a funding plan to complete the final expansion of #HWY14 .", "2020-02-28T18:54:58.000Z": "\"We will turn over every stone, we will get funding, we will get it done.\" - @GovTimWalz  #Hwy14  #Fix14Now Quote Tweet Hwy 14 Partnership @Hwy14Pshp Good news! . @GovTimWalz announces plan to fund the final the expansion of #hwy14 between Nicollet and New Ulm. #fix14now", "2020-02-28T20:20:41.000Z": "Couldn't make a trip to Mankato without stopping at @tandembagels for lunch!", "2020-02-28T05:27:29.000Z": "Great news out of the MN House tonight! The red flag law and background check bills are commonsense pieces of legislation that will reduce gun violence in our state.\n\nIt's now time for the Senate to stand on the side of Minnesotans - not the gun lobby - and pass this bill. #mnleg Quote Tweet Star Tribune @StarTribune UPDATE: A \"red flag\" bill to let courts temporarily remove guns from people deemed a threat to themselves or others has passed the Minnesota House on a 68-62 vote. http:// strib.mn/2waUHHW", "2020-02-26T21:13:33.000Z": "Proud to join @GovTimWalz  @MNSteveSimon & @JulieBlaha in directing State Bd of Investment to continue addressing Environmental, Social and Governance (ESG) issues, incl corp diversity & inclusion, & look into reducing State's risk exposure to long-term carbon investments.", "2020-02-27T14:50:07.000Z": "Thank you to Pilgrim Lutheran Church for the beautiful Ash Wednesday service last night. This Lent season, Pope Francis is giving folks something to think about and asking everyone to spread more kindness. Pope Francis called for Catholics to give up trolling for Lent Pope Francis implored Catholics to give up \"useless words, gossip, rumors, and tittle-tattle\" for Lent - a nice way of saying \"stop trolling.\" businessinsider.com", "2020-02-27T02:24:27.000Z": "This is an incredible step to ensuring ALL Minnesotans with diabetes can afford the medicine they need to survive. Thank you to the #insulin4all advocates and legislators who worked to pass this.\n\nNow it's time for the Senate to do the same. I'm ready to sign it into law. #mnleg Quote Tweet Minnesota House DFL @mnhouseDFL Tonight, thanks to courageous #Insulin4all advocates, the @mnhouseDFL was able to #PassAlecsBill", "2020-02-27T01:35:17.000Z": "School bus drivers are unsung heroes, transporting 760,000 MN students to and from school each day safely.\n\nI am honored to proclaim today School Bus Driver Appreciation Day to recognize the invaluable contribution they make to education and student safety. #OneMinnesota", "2020-02-26T15:03:36.000Z": "Governor Tim Walz kicked of the #mncounties Legislative Conference and County Day at the Capitol. Record attendance of more than 275 county officials will be at the #mnleg today. @NACoTweets  @GovTimWalz", "2020-02-26T00:06:21.000Z": "That's why today we proposed $250,000 in funding to help farmers make safety investments and prevent future tragedies. #OneMinnesota  #mnleg 'Momma On A Mission' Backs Governor Walz's Call For Farm Safety Money Farming is one of the most dangerous professions in the U.S. At least 10 people have died in farming-related accidents in Minnesota since last June, mostly in grain bin accidents. minnesota.cbslocal.com", "2020-02-26T00:06:20.000Z": "As someone who grew up on a farm, my heart breaks to hear about the recent injuries and deaths from farm accidents. Thank you to Michele Gran, who lost her 18-year-old son in a grain bin accident, for sharing her story and advocating for stronger farm safety.", "2020-02-25T22:44:08.000Z": "Heartbreaking news out of Alexandria. Thank you to our first responders and firefighters for your tireless work to keep Minnesotans safe. My team and I are monitoring the situation and thinking of the people of Alexandria. Update, 2:15 p.m. Wednesday: Highway 29 reopens through fire-damaged area in downtown Alexandria |... More than 32 hours after a fire broke out in historic downtown Alexandria buildings, a three-block portion of Broadway (Highway 29) re-opened to traffic in both directions at about 2 p.m. Wednesday. echopress.com", "2020-02-25T20:14:20.000Z": "This is a beautiful story about a community coming together to unite around their love for the local high school sports teams. #OneMinnesota True colors: A changed Austin unites around its high school's red-and-white The schools have more minority students enrolled than white students, with 48 languages spoken in its classrooms. Through the changes, two colors have united the town: The red and white of the Austin... startribune.com", "2020-02-25T16:22:41.000Z": "Too many Minnesota families have lost loved ones to preventable farming accidents. That's why I'm proposing new funding for safety measures like tractor rollover protection and grain bin safety equipment. : https:// facebook.com/GovTimWalz/vid eos/240168087000660/ ", "2020-02-24T19:00:38.000Z": "\"We have a moral obligation to take the time to figure out which programs are producing intended results and to improve those that aren't.\" \n- Minnesota @GovTimWalz  #whatworks  #EvidenceBased via @PewStates How Minnesota Is Elevating Evidence-Based Policymaking Minnesota stands out as a state that embraces a data-driven approach to governance. Leaders have made regular practice of using research and data to inform policy decisions, which has made the... pewtrusts.org", "2020-02-25T02:09:48.000Z": "That's right, I wore my 1980 Miracle on Ice jersey all weekend long.\n\nThank you to everyone who joined us this weekend as I proclaimed it the \"Greatest Day Celebration\" in MN to honor one of the greatest sports moment in American history.  #MiracleOnIce", "2020-02-24T21:43:59.000Z": "I stand with my fellow governors across the country to express concern about the Department of Defense's planned reprogramming of National Guard funding for construction projects along the southern border. Quote Tweet NGA @NatlGovsAssoc #WeTheStates join @NGAUS1878 and other advocates for homeland security and preparedness in opposing a planned federal reprogramming that would cut nearly $1.7 billion dollars from the National Guard and Reserve. #nationalguard  https:// nga.org/news/press-rel eases/governors-oppose-billion-dollar-cuts-to-critical-national-guard-funding/ ", "2020-02-24T02:44:20.000Z": "Thank you to the Progressive Baptist Church and @MayorCarter for welcoming Gwen and I this morning. I was humbled to join you as we celebrate #BlackHistoryMonth and honor the sacrifices and contributions made by generations of African Americans to our state and our country.", "2020-02-21T23:29:10.000Z": "More than 3 years ago, my nephew Jake was in an accident in the Boundary Waters that killed his dad (my brother) and left him with life-threatening injuries. Today, we're cheering Jake on at the MN state high school swimming tournament.\n\nI'm so proud of him. Let's go, Jake!", "2020-02-21T02:25:05.000Z": "My team and I are closely monitoring the fire in Becker, and we are grateful to local law enforcement and firefighters who have been working tirelessly to control the situation.\n\nYou can stay up-to-date on the situation from @mnhealth and @MnPCA at the link below. Quote Tweet mnhealth @mnhealth Wondering about potential heath impacts of Becker fire? Smoke from any fire can contain potentially harmful substances. Overall risk depends on multiple factors, including level and duration of exposure to smoke. Learn more on our website https:// health.state.mn.us/news/pressrel/ 2020/beckerfire.html ", "2020-02-20T21:58:02.000Z": "Safe and stable housing is an essential building block to success, but out of reach for too many. That's why we're proposing a historic investment in affordable housing.\n\nThank you to the folks at @JRLCmn for your tireless advocacy on this issue. #homes4all  #BuildOneMN", "2020-02-20T19:15:23.000Z": "Hey MN! Are you flying on an airplane soon? Well, not without a new ID.\n\nYou will need a REAL ID, Enhanced Driver's License, or another acceptable form of ID before **October 1, 2020** to fly on an airplane or enter federal buildings. RT this video to spread the word!", "2020-02-20T13:35:34.000Z": "Uprooting the Hmong and Lao community is unjust, immoral, and a betrayal of our country's patriotic duty to these refugees. That's why I sent a letter to Secretary of State Mike Pompeo condemning these deportation negotiations. Walz writes Trump administration opposing plan that could deport hundreds of MN Hmong and Lao... Minnesota Gov. Tim Walz on Tuesday joined a growing chorus of public officials opposing the Trump administration's efforts to seek authority to deport Hmong and Lao back to Laos. In a letter to U.S twincities.com", "2020-02-20T03:25:30.000Z": "Gwen and I are praying for @RepHagedorn as he battles cancer. Thinking of him, @jkcarnah , and their family at this time and wishing him a full recovery.", "2020-02-19T23:23:00.000Z": "Our firefighters put their lives on the line to protect our communities. Today I am proud to be with our MN firefighters at Fire Service Day on the Hill.  We are committed to working towards our shared goal of ensuring every firefighter gets home safely at the end of every shift.", "2020-02-19T22:46:00.000Z": "I grieve with the MN families who have lost loved ones in these terrible accidents. As someone who grew up on a farm, I know how important it is that we educate folks on the dangers of farming to help decrease the number of preventable injuries and deaths. https:// kbjr6.com/2020/02/16/gov -tim-walz-declares-grain-bin-safety-week-in-minnesota/ ", "2020-02-19T20:26:20.000Z": "Ope! Didn't mean to barge in here @NJGov Quote Tweet Nick Corasaniti @NYTnickc \"Imagine if, like, Minnesota came out tweeting in a Minnesota accent. That would be off the hook. It would be awesome. \" - @NJGov  https:// nytimes.com/2020/02/19/nyr egion/new-jersey-twitter-njgov.html ", "2020-02-19T15:26:00.000Z": ". @GovTimWalz proposes adding $30 million to depleted state natural disaster account: \"It would be irresponsible not to assume that we're going to have a pretty wet spring and the potential for flooding, as it was last year.\" Walz proposes adding $30 million to depleted state natural disaster account Walz said his supplemental budget proposal next month will include a $30 million request for the Disaster Assistance Contingency Account. He said he wants money added soon to make sure the state is... mprnews.org", "2020-02-18T23:30:57.000Z": "I look forward to addressing Minnesotans and #mnleg for my State of the State address on Monday, March 23 at 7:00 pm. You can follow along at #MNSOTS and tune in LIVE on our Facebook page!  http:// facebook.com/GovTimWalz", "2020-02-18T16:18:44.000Z": "In Minnesota, we come together to help each other when our communities are hit by devasting natural disasters. That's why I'm asking #mnleg to build our state's savings account to assist communities in times of need. We cannot afford to be unprepared. : https:// facebook.com/GovTimWalz/vid eos/200113491055513/ ", "2020-02-15T21:25:00.000Z": "Bishop Chilstrom's life of service made this world a better place. Minnesota grieves this loss with his family. Minnesota native Rev. Herbert Chilstrom, first bishop of ELCA, dies at 88 Former Bishop Rev. Herbert Chilstrom is being remembered for helping to merge Lutheran churches and for his commitment to tolerance. Chilstrom died Jan. 19 at his home in Arizona. mprnews.org", "2020-02-15T00:47:38.000Z": "Happy Valentine's Day to the loves of my life: Gwen, Hope, and Gus. I'm so lucky to call you my family.", "2020-02-14T22:09:33.000Z": "We will continue working in partnership to ensure Native women are able to thrive and succeed without having to experience trauma and violence. #mmiw", "2020-02-14T22:09:31.000Z": "Today I was honored to join Minnesotans in the March for Missing and Murdered Indigenous Women. Native women face violence at alarmingly high rates. As Governor, I am committed to making Minnesota a state where everyone is safe. #mmiw", "2020-02-13T21:04:05.000Z": "I will not stand by as the Trump Administration tries to uproot a community by deporting small business owners, combat veterans who fought alongside American soldiers, and passionate people who have shaped Minnesota's culture into what it is today.", "2020-02-13T21:04:04.000Z": "Minnesota stands with our Hmong and Lao neighbors, many of whom have called this state home longer than I have. Quote Tweet MPR News @MPRnews Nearly 3,500 Hmong and Lao immigrants nationwide are subject to deportation under Trump's proposal; in Minnesota, several hundred could be affected https:// mprnews.org/story/2020/02/ 10/what-you-need-to-know-about-trump-plan-to-deport-hmong-lao-immigrants ", "2020-02-13T19:19:38.000Z": "Thank you @GovTimWalz for standing strong in support of $50mil bonding for the Rural Finance Authority! RFA loans are critical to addressing land access and financing issues for emerging farmers. @MNFarmersUnion stands with you!", "2020-02-13T17:53:10.000Z": "Thank you @GovTimWalz and @LtGovFlanagan for speaking to #LeadershipTC", "2020-02-13T17:51:48.000Z": "It's a Bold North day in Minnesota today. Stay warm out there! #OneMinnesota", "2020-02-12T19:25:17.000Z": "Miigwech to @GovTimWalz  @SenTinaSmith  @ShelleyCBuck  @jbeckerfinn  @RLilligren for your kind words as I accepted @NCAI1944 Native American Leadership Award last night. I'm proud of the work we're doing to ensure Native folks are seen, heard, and valued at every level of government.", "2020-02-12T18:59:10.000Z": "Investing in this project will not only create more jobs, but will provide access to curbside food waste collection for more than 800,000 residents and reduce greenhouse gas emissions. #BuildOneMN  #mnleg", "2020-02-12T18:59:07.000Z": "Today I toured the Ramsey/Washington Recycling & Energy Center - one of the projects included in my Local Jobs and Projects Plan. #BuildOneMN  #mnleg", "2020-02-12T17:40:35.000Z": "Governor Walz @GovTimWalz and Lt. Governor Flanagan @LtGovFlanagan will speaking during the Council's African Heritage Day on the Hill. The event will take place on Feb. 26th from 2 - 4 PM in the Capitol, Rotunda. Reserve your spot at the event at: 2020 African Heritage Day on the Hill Community members are invited to meet with lawmakers and rally together in support of equity. eventbrite.com", "2020-02-12T03:54:54.000Z": "From health care to infrastructure to national security, I'm grateful for the time spent with governors from other states to discuss ways we can work together in a bipartisan way to serve the people of our states. #WeTheStates", "2020-02-12T03:54:48.000Z": "This past weekend, I joined my fellow governors in Washington, DC for the @NatlGovsAssoc meeting to represent MN at the federal level. We came together to discuss some of the most pressing issues facing our states and innovative solutions to these challenges. #WeTheStates", "2020-02-11T13:52:01.000Z": "It's the first day of the 2020 #mnleg session! AND it's the season 2 debut of the Minnesota Values Podcast Rep. Liz Olson and Rep. Jamie Long interview special guest @GovTimWalz . Listen to their conversation at https:// anchor.fm/mnvaluespod and anywhere podcasts are available.", "2020-02-10T18:35:03.000Z": "\"You cannot board an airplane with this ID.\" A traveler's worst nightmare. It could happen if you don't have a #RealID . Learn more at http:// REALID.dps.mn.gov .", "2020-02-10T22:58:50.000Z": "I'm honored to proclaim February as #BlackHistoryMonth in Minnesota to recognize the generations of African Americans who have risked their lives for justice and who continue to fight for equality today.", "2020-02-08T20:33:31.000Z": "In 2018 alone, Saskatchewan exported over $2.2 Billion to Minnesota, making Minnesota one of our largest export destinations in the United States. It was my pleasure to discuss the importance of this relationship with @GovTimWalz .", "2020-02-10T14:45:36.000Z": "Last week I was proud to convene our Minnesota Congressional Delegation in Washington, DC to talk about important issues facing our state, from infrastructure to health care.\n\nThank you to my fellow Minnesotans for joining me over lunch! #OneMinnesota", "2020-02-06T15:38:00.000Z": "Yesterday @GOmn_umn toured the State Capitol and ran into a certain VIP. Thanks for welcoming our students from Seoul National University, @GovTimWalz !", "2020-02-05T16:30:11.000Z": "\"If we are truly going to be #oneminnesota and am Age Friendly State, we need to support the this field and lift up those who are dedicated to serving our elders.\" @GovTimWalz at #institute2020  #bettertogether", "2020-02-05T00:33:45.000Z": "Nothing better than Taco Tuesday!  @ELBURRITOM is one of my favorite restaurants in MN, and I'm glad everyone was safe after the devastating robbery. Quote Tweet Kent Erdahl @kenterdahl I spy @GovTimWalz at @ELBURRITOM eager to get his Taco Tuesday order in. He's here to show his support for the business after a horrific armed robbery two weeks ago. He's far from the only one here tonight! Story on @kare11 at 10p Show this thread", "2020-02-04T22:48:07.000Z": "This past December, we joined philanthropic leaders to launch the Minnesota Winter Homeless Initiative to bring Minnesotans without shelter in from the cold.\n\nI couldn't be prouder of the incredible impact this initiative has made across the state. With state help, hundreds of emergency shelter beds open for homeless Minnesotans Gov. Walz launched effort to help the homeless. startribune.com", "2020-02-03T22:29:15.000Z": "This is a powerful op-ed from @GovTimWalz . Alec's mom Nicole continues to inspire me and has been a passionate advocate and leader for #insulin4all . \n\nI stand with them; the Minnesota Senate must do the right thing and pass this bill. OPINION EXCHANGE | Cost of insulin shouldn't be cause for death We are reintroducing Alec's bill and we ask the Senate to do the right thing. startribune.com", "2020-02-03T16:43:12.000Z": "The only way we can provide relief to Minnesotans struggling to afford their insulin is to call upon the pharmaceutical companies who created this crisis to help fund the solution.\n\nIt's time to move this commonsense solution forward. #insulin4all  #mnleg OPINION EXCHANGE | Cost of insulin shouldn't be cause for death We are reintroducing Alec's bill and we ask the Senate to do the right thing. startribune.com", "2020-02-03T03:11:01.000Z": "Congratulations to the @Chiefs and @PatrickMahomes on your SuperBowl win! What an incredible game. #SuperBowlLIV", "2020-02-03T00:18:38.000Z": "Picture yourself in @VisitWinona . Just like Winona did. #SB54  #OnlyinMN", "2020-02-03T00:21:48.000Z": "Love seeing Winona, MN featured on a SuperBowl ad! Great place to visit, great place to live. #WelcomeToWinona  #SuperBowlLIV Quote Tweet Squarespace @squarespace Tonight's the night. Watch for #WelcomeToWinona in between the first and second quarters.  https:// welcometowinona.com  #Squarespace  #BigGame", "2020-02-01T22:46:04.000Z": "Today @GovTimWalz visited w/ home care leaders at @SEIUHCMN meeting. Members shared passionate stories about how families are impacted by current #CareCrisis & Gov. Walz reaffirmed his commitment to ensuring programs are well funded so we can show we #ValueHomeCare in MN.", "2020-02-01T16:21:43.000Z": "Beautiful Minnesota sunrise this morning.", "2020-01-31T18:43:13.000Z": "MN's economy is strong because of our innovative spirit.\n\nThank you to the employees at @Medtronic for welcoming me yesterday. I'm committed to working with companies like Medtronic - who are the backbone of our region's economy - to build #OneMinnesota together.", "2020-01-31T17:00:14.000Z": "Have a question for @GovTimWalz ? He's about to join @MPRnews  @MPRsMikeMulcahy live. Call in at 651-227-6000. http:// mprnews.org/listen Quote Tweet Angela Davis @AngelaDavisMPR Friday at 11 @MPRnews listen to @GovTimWalz talk with @MPRsMikeMulcahy  https:// mprnews.org/episode/2020/0 1/31/mulcahy-gov-tim-walz-ahead-of-the-2020-legislative-session ", "2020-01-30T23:03:09.000Z": "It was an honor to welcome Minnesota @GovTimWalz for a Town Hall at our operational headquarters where the governor met with company leaders and employees.", "2020-01-31T03:45:36.000Z": "@GovTimWalz visited with his Children's Cabinet.  Their primary purpose was to hear from students. We were selected largely due to our new Community Schools programming. It was amazing to see so many people come together to show they care about & support our students' success.", "2020-01-30T23:54:40.000Z": "Currently, there is a low immediate health risk for the public in the U.S.  We recommend Minnesotans take the same precautions recommended for avoiding cold and flu. My office remains in close contact with @mnhealth to monitor the situation.", "2020-01-30T23:54:38.000Z": "Today I received a briefing on coronavirus with @mnhealth . With the rising number of cases in China and other countries, it's a stressful time for all of us, but particularly those who have family and friends in China where most cases have been reported.", "2020-01-30T20:58:14.000Z": "This is Jett. He has type 1 diabetes. He told us that he doesn't want to become Alec or Jesse, two Minnesotans who died from rationing insulin.\n\nThat's why today we introduced commonsense legislation to make insulin affordable for all Minnesotans. #insulin4all  #mnleg", "2020-01-30T20:57:41.000Z": "\"I'm nine years old. I like Legos, Minecraft, Star Wars, Pokémon, and reading. I've had diabetes for almost three years. I am worried about what will happen to me when I become an adult and need to pay for my own insulin, because I know it's so expensive.\" #insulin4all  #mnleg", "2020-01-30T15:56:41.000Z": "Taking the best from both Democrat and Republican proposals, this compromise bill would increase access to affordable insulin, hold Big Pharma accountable, and is ready to be implemented. There's no reason not to support it. #insulin4all  #mnleg  : Governor Tim Walz on Facebook Watch The cost of insulin has tripled in the last ten years - raking in the cash for pharmaceutical companies, while Minnesotans with diabetes are left... facebook.com", "2020-01-30T15:56:40.000Z": "Today we're announcing commonsense legislation to improve access to affordable insulin and ensure that Minnesotans facing an emergency have access to an immediate refill at their pharmacy. #insulin4all  #mnleg  : https:// facebook.com/GovTimWalz/vid eos/2632173387018095/ ", "2020-01-30T15:56:37.000Z": "The cost of insulin has tripled in the last ten years - raking in the cash for pharmaceutical companies, while Minnesotans with diabetes are left scrambling to afford the drug they need to survive.\n \nWe have a solution to this crisis. #insulin4all  #mnleg", "2020-01-30T01:23:02.000Z": "Through the Children's Cabinet, state agencies are working collaboratively on policy solutions to ensure MN is the best place for every child to grow up.\n\nToday we heard from students and teachers on issues facing young Minnesotans, from mental health to educational opportunity.", "2020-01-30T01:22:58.000Z": "As a teacher, it was great to be back in the classroom today! We convened our Children's Cabinet meeting in Rochester at @RPS535 John Marshall H.S., a full-service community school that is prioritizing wrap-around services for students. #OneMinnesota", "2020-01-29T19:46:39.000Z": "Thank you to @barbershop_mn for welcoming me on your podcast today! Listen to our conversation here  https:// fbwat.ch/19RtOfmPVMAfKL Nk ", "2020-01-29T03:33:31.000Z": "To the families grieving an unimaginable loss: my deepest condolences.\n\nTo law enforcement and advocates: thank you for your work to protect victims of domestic violence and help prevent these tragedies before they happen. #WeRememberMN", "2020-01-29T03:33:30.000Z": "Tonight, Gwen and I joined @ViolenceFreeMN to honor and remember the victims of intimate partner homicide in 2019. #WeRememberMN Quote Tweet Violence Free Minnesota @ViolenceFreeMN This afternoon we will honor Minnesota's 2019 intimate partner homicide victims at a memorial in Saint Paul. We remember and choose to use whatever power we have to create a violence free Minnesota. #WeRememberMN", "2020-01-28T20:07:11.000Z": "Thank you to the advocates from @MinnCCD for coming to the Capitol to discuss issues facing the disability community. I am here to listen and lift up your voices, so we ensure that all Minnesotans have access to the support and services they need to live full lives. #MNCCD2020", "2020-01-28T14:49:03.000Z": "Great story on @ArvigHQ on their broadband grant! @GovTimWalz : Melrose expansion grant will help business, quality of life  Arvig's infrastructure will exceed state's speed goals w/ 1 gig/second for downloads & uploads https:// sctimes.com/story/news/202 0/01/27/walz-melrose-broadband-expansion-grant-help-business-quality-life/4586933002/   #broadband  @grove  @MinnesotaCable Walz: Melrose broadband expansion grant will help business, quality of life Internet provider Arvig receives nearly $400,000 for project that improves broadband in the Melrose industrial park and parts of rural Stearns County sctimes.com", "2020-01-27T23:00:00.000Z": "Thank you @GovTimWalz ! Quote Tweet Denise Specht @DeniseSpecht Yes! @GovTimWalz has proclaimed this week Paraprofessional Recognition Week. Please join me in thanking our paraprofessionals! Schools don't work without them. #rESPect  @EducationMN", "2020-01-27T22:57:22.000Z": "We had a great time up in Melrose today! And thanks for the delicious pizza Quote Tweet JD's Taphouse @JdsTaphousemn Thanks for stopping by today @GovTimWalz !", "2020-01-27T21:14:55.000Z": "Broadband internet access is critical to building thriving communities. No one knows this better than local businesses Farm Systems and @WarriorBoatsinc who joined us today. With this broadband grant, these companies will be able to expand their services and hire more employees.", "2020-01-27T21:14:53.000Z": "It was great to be up in Melrose with Commissioner @grove today to hear from local internet provider @ArvigHQ on how our border-to-border broadband grant allows them to improve broadband services for more than 400 locations in Greater MN. #OneMinnesota  #mnleg", "2020-01-27T16:08:59.000Z": "Today on #HolocaustRemembranceDay , we remember the horrific and tragic genocide that killed millions of Jewish people and civilians. We honor the lives of the victims and those liberated, and we commit ourselves to fighting back against anti-Semitism.", "2020-01-27T15:25:30.000Z": "Thank you, @SteveHunegs  @JCRCMINNDAK , for this important article. OPINION EXCHANGE | On Holocaust Remembrance Day, Americans must commit to remembering The searing experiences helped shape the American postwar world for the better as it belatedly began to address its endemic racism. startribune.com", "2020-01-24T21:02:43.000Z": "Thank you @GovMarkDayton for your work to restore our beautiful State Capitol. I still can't believe I get to work here everyday. MN Capitol restoration wins American Institute of Architects award The American Institute of Architects has announced that the Minneapolis firm that designed the restoration of the Minnesota State Capitol has won a 2020 AIA architecture award that recognizes \"the  twincities.com", "2020-01-24T17:45:00.000Z": "\"As a lifelong sportsman and as your Governor, I am committed to the conservation and protection of Minnesota's natural resources, so all Minnesotans can enjoy our great outdoors.\" @GovTimWalz  #DNRroundtable", "2020-01-24T17:44:00.000Z": "\"This year's theme of connecting people to the outdoors is at the heart of the DNR's mission.\" @GovTimWalz  #DNRroundtable", "2020-01-24T02:10:45.000Z": "This experience was powerful, and I will carry their stories with me as we work to ensure that EVERY Minnesotan has a safe, affordable place to call home.", "2020-01-24T02:10:42.000Z": "I heard from Minnesotans experiencing homelessness about their challenges finding shelter, their fears of living in public, and their struggles surviving on no sleep.", "2020-01-24T02:10:39.000Z": "These volunteers are working to not only ensure that all Minnesotans are counted, but to also make this crisis visible.", "2020-01-24T02:10:36.000Z": "Last night, I joined fellow Minnesotans who volunteered for the federally mandated count of unsheltered people. The rate of Minnesotans experiencing unsheltered homelessness continues to rise year after year.", "2020-01-23T17:04:55.000Z": "That's why we invested $1.5 million in this program to prepare tomorrow's workers for the jobs businesses are creating today. #OneMinnesota  #mngov  #mnleg", "2020-01-23T17:04:53.000Z": "Youth Skills Training grants provide students with hands-on workforce training in high-demand fields. I heard from students and employers at Teamvantage on how these innovative partnerships connect schools with local businesses to create career pathways for young Minnesotans.", "2020-01-22T21:34:07.000Z": "Thank you to ... @GovTimWalz  for stopping by to discuss ... @BetterFuel4MN  and its goal to promote the usage and awareness of biofuels in MN. #mnagexpo20  #betterfuel4mn", "2020-01-21T21:57:34.000Z": ". @GovTimWalz bonding proposal revealed last week includes more than $100 million for projects in northwest suburbs. Cities impacted include @BrooklynPark  @BrklynCenterMN  @cityofcrystalmn  @GoldenValleyMN  @maplegrovemngov and @PlymouthMN_gov Governor Walz Bonding Proposal Includes $100 Million for Northwest Metro Projects - CCX Media A closer look inside Governor Tim Walz's bonding proposal revealed last week includes more than $100 million for projects in the northwest suburbs. ccxmedia.org", "2020-01-21T19:05:02.000Z": "Today, we are awarding over $23 million in border-to-border broadband grants to fund projects in every corner of the state that will provide internet access for over 10,900 businesses, homes, and community institutions. #OneMinnesota  : Governor Tim Walz on Facebook Watch Fast, reliable broadband access is critical to improving the quality of life for Minnesotans, modernizing operations for farms, and making businesses in... facebook.com", "2020-01-21T19:05:01.000Z": "Fast, reliable broadband access is critical to improving the quality of life for Minnesotans, modernizing operations for farms, and making businesses in Greater Minnesota more competitive. #OneMinnesota", "2020-01-21T02:01:49.000Z": "We still have work to do to ensure home care workers earn a living wage. But I'm proud that PCAs with @SEIUHCMN , like Deb who I shadowed for a day, won time-and-a-half pay in their union contract for working on #MLKDay to keep seniors and people with disabilities in their homes.", "2020-01-20T21:05:55.000Z": "The world Dr. King dreamt of is a world we are still working to actualize together.\n\nThank you to all Minnesotans who came together today to celebrate and honor the legacy of Dr. King! #MNMLK", "2020-01-20T21:05:51.000Z": "Today we celebrate Martin Luther King Jr. Day and honor a man who inspired generations of Americans to build a society that worked for everyone. #MNMLK", "2020-01-20T15:03:00.000Z": "If you are not able to make @GovTimWalz and & @LtGovFlanagan 's #MNMLK Celebration this #MLKDay in person, you can watch the live stream: Minnesota Governor's Council Martin Luther King, Jr. Day Celebration - Twin Cities PBS The 32nd Annual State of Minnesota Governor's Council on Martin Luther King, Jr. Day Celebration live from the Ordway Center for Performing Arts in St. Paul, MN. This year's program is hosted by... tpt.org", "2020-01-20T03:52:30.000Z": "I'm glad that @IBT_320 and St. Louis County are back at the table today. I encourage everyone to negotiate in good faith and get this sorted out. Plow drivers, county resume mediation | Duluth News Tribune St. Louis County Public Works and County spokeswoman Dana Kazel said that the Minnesota Bureau of Mediation Services requested the session, which started at 11 a.m. Kazel had no update on any... duluthnewstribune.com", "2020-01-20T03:34:19.000Z": "Tomorrow we're excited to come together to celebrate the legacy of Dr. Martin Luther King, Jr.\n\nDoors open at 9:15am at the Ordway, and you can find all info at the link below. Hope to see you there! #MNMLK  #MLKDay  https:// facebook.com/events/s/state -of-minnesota-dr-martin-l/1310538462461767/ ", "2020-01-17T21:45:03.000Z": "Great lunch at @AfroDeli in the Minneapolis Skyway today!", "2020-01-17T16:06:15.000Z": "ICYMI: Governor Walz paid a visit to Anoka-Ramsey earlier this week to share his proposal for investment in higher education in Minnesota. Read more about his plan and proposed upgrades to Anoka-Ramsey's Coon Rapids campus: https:// bit.ly/2Rho4iF", "2020-01-16T23:06:54.000Z": "We are not #OneMinnesota when our neighbors are hungry.\n\nThe Trump Administration's cuts to SNAP will increase hunger across the state, especially in Greater MN. Thank you @AGEllison for standing up for Minnesotans today. Quote Tweet Attorney General Keith Ellison @AGEllison It's hard to believe the Trump Admin wants to make it harder for ppl to afford their lives & even to afford to eat, but a new Trump rule ends food assistance to 8K Minnesotans & 700K Americans. It's my job to protect Minnesotans, so I sued to block it. https:// ag.state.mn.us/Office/Communi cations/2020/01/16_SNAP.asp ", "2020-01-16T19:11:58.000Z": "Our Local Jobs and Projects Plan includes more local projects than any bonding proposal before. This year, we did things differently and asked Minnesotans to submit their ideas to us. Our plan is in direct response to what communities across the state say they need. #BuildOneMN", "2020-01-16T14:31:29.000Z": "Thank you @GovTimWalz for including our Main Street flooding and Blazing Star Trail funding requests in the bonding bill! #buildthebridge  #raisetheroad  #albertlea", "2020-01-16T15:03:49.000Z": "Good morning, Minnesota! Today is a Bold North day.", "2020-01-15T19:31:05.000Z": "As Governor, my top priority is keeping the people of Minnesota safe. This proposal also includes funding to ensure our emergency services, as well as aging roads and bridges, are repaired and upgraded so Minnesotans can have peace of mind in their day-to-day lives. #BuildOneMN", "2020-01-15T16:05:23.000Z": "Tune in Governor Tim Walz on Facebook Watch Today I'm proud to announce our Local Jobs and Projects plan proposing $2.03 billion in General Obligation bonds to make critical investments in... facebook.com", "2020-01-15T16:05:22.000Z": "Today I'm proud to announce our Local Jobs and Projects plan proposing $2.03 billion in General Obligation bonds to make critical investments in communities across the state and ensure all Minnesotans enjoy a high quality of life, regardless of race or zip code. #BuildOneMN", "2020-01-13T16:34:36.000Z": "Thank you @GovTimWalz and @LtGovFlanagan for your strong capital investment recommendation for @UMNews and higher education. This investment will help students, research, and outreach around the state. We are grateful. #renewUMN", "2020-01-13T16:16:00.000Z": "Thank you @GovTimWalz and @LtGovFlanagan for your strong support and your commitment to investing in the #UMN System! Today's proposal will help the U of M system fulfill our mission to the state. #mnleg  #RenewUMN President Gabel's Thank You to Governor Walz and Lieutenant Governor... University of Minnesota President Joan T.A. Gabel thanks Governor Tim Walz and Lieutenant Governor Peggy Flanagan for their continued support and investment ... youtube.com", "2020-01-13T23:39:40.000Z": "I was proud to be with @DisabilityMN for their legislative forum today. We are committed to our partnership with the disability community to ensure everyone has access to the support and services they need to live full lives.\n\nAnd it was great to see my friend, @JustinDFTBA !", "2020-01-13T15:46:18.000Z": "That's why we're here at @AnokaRamseyCC to propose our investment of $488 million in higher education projects to help prepare our students for the jobs of tomorrow that our businesses are creating today. #BuildOneMN  : https:// facebook.com/GovTimWalz/vid eos/1018545258517087/ ", "2020-01-13T15:46:14.000Z": "But insufficient space, aging facilities, and outdated technology on college campuses aren't just holding our students back - they're holding Minnesota back in the face of a workforce shortage that's impacting every corner of the state. #BuildOneMN", "2020-01-13T15:46:13.000Z": "Every Minnesotan deserves access to opportunities that will lead to a bright future, and for many, that means attending a higher education institution. #BuildOneMN", "2020-01-10T22:53:05.000Z": "Well here's a highlight, and probably for my team too - talking water infrastructure with @GovTimWalz", "2020-01-10T19:50:23.000Z": "Spent the morning with @GovTimWalz as he toured the underground storm tunnel system in northeast Minneapolis after unveiling the second piece of his bonding package focusing on water quality Friday. (Anthony Souffle/ @StarTribune )", "2020-01-10T20:07:38.000Z": "These are the kind of critical projects we just can't ignore any longer. That's why this local project is included in my Local Jobs and Projects Plan to improve water quality for Minnesotans across the state. #BuildOneMN", "2020-01-10T20:07:34.000Z": "It's caused manhole covers to pop off - and led to the discharge of untreated wastewater and stormwater to the Mississippi River in 2010.", "2020-01-10T20:07:22.000Z": "Today I toured a storm tunnel in Minneapolis. Deep below the streets of downtown, the Central City Storm Tunnel was built more than a century ago to move stormwater to the river. And now it is bursting at the seams each time it rains. #BuildOneMN", "2020-01-10T19:42:15.000Z": "Skol @Vikings ! We're rooting for you this weekend. #Skol  #GoGetIt Quote Tweet John Croman @JohnCroman MInn @GovTimWalz predicts Vikings over 49ers by 11 @kare11  #kare11vikes  #GoGetIt", "2020-01-10T19:20:46.000Z": "Every Minnesotan deserves access to clean water. Yet this isn't the case for many communities across the state, especially in Greater MN. We're working to protect our environment and Minnesotans' health by investing $300 mil to improve water quality and infrastructure. #BuildOneMN", "2020-01-10T03:24:17.000Z": "We're working to make sure all Minnesotans can afford to live in the communities they call home. Whether it's proximity to work, school, or loved ones, too often Minnesotans can't find affordable housing near the things that matter most. #BuildOneMN Gov. Walz Unveils Local Jobs And Projects Plan, Includes $276M For Affordable Housing Minnesota Gov. Tim Walz announced Thursday his 2020 capital investment proposal, the Local Jobs and Projects Plan, which will include a major investment in affordable housing. minnesota.cbslocal.com", "2020-01-09T21:47:42.000Z": "It is so exciting to see @GovTimWalz and @LtGovFlanagan take time to address the students at @mnymcayig opening ceremony!", "2020-01-09T20:56:07.000Z": "We're excited to welcome @YaraShahidi , actress and producer of \"grown-ish\", back home to MN as our keynote speaker at the 2020 #MNMLK Celebration!", "2020-01-09T15:23:21.000Z": "Tune in now! #BuildOneMN  : Governor Tim Walz on Facebook Watch Every Minnesotan deserves a safe, affordable place to call home. But too often, Minnesotans across the state struggle to find housing. That's why today... facebook.com", "2020-01-09T15:23:20.000Z": "Every Minnesotan deserves a safe, affordable place to call home. But too often, folks across the state struggle to find housing. That's why I'm announcing the first part of my Local Jobs and Projects Plan to invest $276 million in safe, affordable housing projects. #BuildOneMN", "2020-01-08T23:58:00.000Z": "You can't divide Minnetonka from Mankato. You can't divide Waseca from Warroad. Because we know that Minnesota thrives when we work together as #OneMinnesota . For Minnesota Gov. Tim Walz, a year of striving for consensus in a divided state Minnesota's governor enters his second year in office facing a list of unfinished policy priorities, some politically fraught decisions and the complicated backdrop of the 2020 election. startribune.com", "2020-01-08T20:55:01.000Z": "Our #MNEnviroCongress19 recording is now live! \n\nAs we start the new year, we're motivated by @GovTimWalz 's charge on the importance of focusing our efforts on sustainability and climate change. Minnesota Environmental Congress 2019 Leadership Forum youtube.com", "2020-01-08T22:11:43.000Z": "I'm proud of all we've accomplished just one year in, and looking forward to what's next! #OneMinnesota", "2020-01-07T20:59:12.000Z": "A year ago today, I was sworn in as Minnesota's 41st Governor. We got a lot done this first year, and I can't wait to continue working for the people of Minnesota in the years to come. Thank you. #OneMinnesota", "2020-01-05T21:30:03.000Z": "Incredible game! Skol #Vikings ! Quote Tweet Minnesota Vikings @Vikings With everybody against us.", "2020-01-05T02:54:21.000Z": "Great time watching the #ClashOfChampions MN high school basketball game with my kids today. Congrats to Minnehaha Academy on the win!", "2020-01-02T22:09:20.000Z": "This past #mnleg session, we worked across party lines to pass a budget that invests in our students and protects health care for Minnesotans. This is #OneMinnesota in action - working together across lines of difference to get things done for Minnesotans. No. 1: Walz's first year in office Gov. Tim Walz likes to say his philosophy on politics and governing was formed in Mankato, where he credits local leaders and advocates with putting together a healthy community and mankatofreepress.com", "2020-01-01T21:27:04.000Z": "Great win, @GopherFootball ! #OneMN Quote Tweet Minnesota Football @GopherFootball Starting 2020 off the right way. @OutbackBowl Champions.", "2020-01-01T21:41:52.000Z": "Congrats to @GopherFootball !! Row the boat! #RTB  #SkiUMah  #Gophers Quote Tweet Minnesota Football @GopherFootball", "2020-01-01T01:26:05.000Z": "And I can't wait to continue working with you by my side to build #OneMinnesota in 2020. Thank you, and I wish all Minnesotans a happy New Year! #2020NewYear", "2020-01-01T01:26:04.000Z": "2019 was a year filled with new beginnings for me and my family. I am grateful for the opportunity to serve you each and every day. Together, we have accomplished so much - from investing in our students to protecting health care for 1 million Minnesotans. #2020NewYear", "2019-12-30T03:05:07.000Z": "Rep. John Lewis is an American hero. He will fight this diagnosis with the same strength and courage he has demonstrated throughout his entire life's work. Gwen and I consider him a friend and a mentor, and we are praying for him through this fight. Congressman John Lewis says cancer is his latest battle As a civil rights activist at 25, John Lewis was beaten so badly his skull was fractured and the TV images from an Alabama bridge in the 1960s forced a nation's awakening to racial discrimination. As... startribune.com", "2019-12-28T19:40:17.000Z": "Future @mnwild player right here! If this isn't the most Minnesotan, I don't know what is. \n\nIn all seriousness, please be safe out there today with the dangerous icy conditions. #mnwx Quote Tweet Mark Norgren @marknorgren Icy in Savage MN #mnwx Show this thread", "2019-12-28T18:34:26.000Z": "As of 12:30PM: We have lifted the no travel advisory for the Twin Cities. \n\nMotorists should still drive with extreme caution & postpone travel if possible, as slippery and icy conditions may persist throughout the weekend. http:// 511mn.org for latest conditions. #mnwx", "2019-12-28T15:09:43.000Z": "No travel advised in the Twin Cities metro area. Please stay home until conditions improve. If you are already out & stuck in traffic, stay in your vehicle with your seat belt on.", "2019-12-26T18:52:19.000Z": "This memorial ride is an important time to acknowledge the wrongs that have been done, to share our deepest apologies, and recommit ourselves to accountability and healing. #Dakota38", "2019-12-26T18:52:18.000Z": "This morning, @LtGovFlanagan and I attended the Dakota 38 + 2 ride in Mankato to honor the 38 Dakota men who were hung 157 years ago and the two chiefs who were executed 3 years later from the aftermath of the U.S.-Dakota War of 1862. #Dakota38", "2019-12-25T18:45:25.000Z": "We are in direct communication with the city and county and will provide support where needed.", "2019-12-25T18:45:24.000Z": "Sad news this Christmas morning as a fire broke out at the Francis Drake Hotel apartment building in Minneapolis. Praying for all those injured or displaced by the incident, and grateful for the first responders who saved lives this holiday. Quote Tweet MPR News @MPRnews More than a hundred people were evacuated from the Francis Drake Hotel early Wednesday morning in Minneapolis as firefighters responded to a 4-alarm fire. Three people were taken to a hospital with unspecified injuries. This is a developing story. https:// mprnews.org/story/2019/12/ 25/firefighters-battling-blaze-at-francis-drake-hotel-apartments ", "2019-12-25T04:20:29.000Z": "Merry Christmas! Quote Tweet Governor Tim Walz @GovTimWalz 1:32 Sometimes I wonder what my dog and cat do all day when I'm at the Capitol or traveling the state...\n\nMerry Christmas from Scout and Afton!", "2019-12-24T22:00:30.000Z": "As we prepare to welcome friends and family into our homes, we are given new reason to reflect on our calling to welcome the stranger. Specifically, what is our calling to welcome #immigrants and #refugees ? Catholic and Lutheran Bishops of Minnesota write. OPINION EXCHANGE | Resettlement policy: Create a welcoming society, not more barriers, for refugees A message from Catholic and Lutheran bishops in Minnesota. startribune.com", "2019-12-23T23:51:33.000Z": "Today, @LtGovFlanagan and I helped families shop at the Hallie Q. Brown Community Center food shelf in St. Paul. Cuts to this program by the Trump Administration will increase hunger across Minnesota. And I will do everything in my authority to fight these cuts.", "2019-12-23T23:51:31.000Z": "We know that 1 in 12 Minnesota households are food insecure - meaning they either don't have enough food to feed their families. Food assistance programs like SNAP are critical to our #OneMinnesota values: supporting our neighbors in hard times.", "2019-12-19T22:18:10.000Z": "Message from @GovTimWalz - latest legal setback for Affordable Care Act won't affect coverage for 2020. Open enrollment via @MNsure runs until Dec. 23", "2019-12-23T22:08:43.000Z": "Today's the last day to enroll in health coverage for 2020 through @MNsure ! MNsure's contact center is open until midnight to make sure you get the coverage you need.\n\nApply and enroll at http:// MNsure.org  #GetCovered", "2019-12-23T18:11:27.000Z": "It is my honor to appoint Charlie Zelle as Chair of the @MetCouncilNews . As a key economic driver in the state, the Metropolitan Council is critical to our vision of #OneMinnesota , and Charlie will bring this unifying lens to his work as Chair.", "2019-12-23T14:45:44.000Z": "Minnesotans agree they want our state to be the best place for children to grow up.\n\nI'm proud to announce we received a $26.7 million federal grant to help us achieve this goal and connect families with the support they need to thrive. #OneMinnesota Gov. Walz announces $26M federal grant to improve services to families with young children - Austin... Gov. Tim Walz has announced that Minnesota has received a $26.7 million federal grant to support critical early childhood services. Based on feedback from over 130 community listening sessions, the... austindailyherald.com", "2019-12-22T21:09:05.000Z": "Sometimes I wonder what my dog and cat do all day when I'm at the Capitol or traveling the state...\n\nMerry Christmas from Scout and Afton!", "2019-12-23T00:20:12.000Z": "I was honored to stand with our Jewish community to celebrate the first night of #Hanukkah today. Wishing all Minnesotans who celebrate a blessed and peaceful holiday! Chag Sameach from my family to yours.", "2019-12-21T21:48:44.000Z": "In 1977, I saw the Original #StarWars with my Dad in Omaha when I was 13.\n\nToday, I went to see the final installment with my 13-year-old son, Gus. May the Force be with you.", "2019-12-21T16:39:36.000Z": "Cheering on the undefeated MSU Mankato football team in the NCAA Division II national championship game today. Go Mavs! #HornsUp  #MavFam  @msumavericks", "2019-12-20T18:07:00.000Z": "Homelessness is a solvable issue. It's a math problem, not a character problem.\n\nAnd that's why the Minnesota Winter Homeless Initiative is so important, so we can bring more Minnesotans in from the cold. Gov. Tim Walz nets nearly $5 million to combat homelessness in Minnesota Leaders aim to open about 150 new shelter beds immediately. startribune.com", "2019-12-20T15:32:02.000Z": "Across the state, there are more than 1,600 Minnesotans sleeping outside on any given night. This is unacceptable.\n\nI am grateful to Shelita, Forrest, and Jeff - current and former residents at a local shelter in Virginia, MN - for sharing their stories with me.", "2019-12-19T16:15:03.000Z": "This afternoon on @KSTP , before the #HomelessMemorialMarch , @GovTimWalz , @LtGovFlanagan and donors launch new 'Minnesota Winter Homeless Initiative'\n\nMillions of $$$ raised (in a matter of days) to give shelter to those who need it this winter.", "2019-12-19T16:07:31.000Z": "Together as #OneMinnesota , we will bring our neighbors in from the cold. Learn more and get involved at http:// mnhomelessfund.org", "2019-12-19T16:07:29.000Z": "Every Minnesotan deserves a safe, warm place to sleep at night. Yet too many are without shelter in the winter.\n\nThat is why our Administration is partnering with private and philanthropic partners to launch the MN Winter Homelessness Initiative. : https:// fbwat.ch/1Gr2iC8fNuqGv1 WF ", "2019-12-19T01:21:56.000Z": "I was honored to stop by the @MNNationalGuard holiday celebration to thank our brave military members for their service to our state and country. The past week has been challenging with the loss of fellow soldiers, and we are grateful for your support to our military families.", "2019-12-18T19:29:59.000Z": "AGs from around the country & I are challenging Trump's illegal & immoral refugee order in court. @GovTimWalz is holding MN's door open for refugees. We both know MN is stronger when all ppl live with dignity & respect. We're in this together for MN. EDITORIAL | Minnesota's doors, hearts remain open to refugees We applaud Gov. Tim Walz for rejecting refugee ban nonsense. startribune.com", "2019-12-18T18:07:00.000Z": "While this is the right direction, this is simply not enough. We need to ensure that ALL Minnesotans can earn a living wage. Minnesota's minimum wage will rise Jan. 1 An estimated 206,000 workers will get raises. startribune.com", "2019-12-18T17:21:54.000Z": "Great to see @mnhouseDFL holding a public hearing on insulin today, and I'm encouraged @mnsrc is coming to the table. It's critical we include the public's voice as we work towards a solution so all Minnesotans with diabetes can afford the medicine they need to survive.", "2019-12-18T02:00:11.000Z": "Minnesota's doors and hearts remain open to #refugees , thanks to @GovTimWalz . EDITORIAL | Minnesota's doors, hearts remain open to refugees We applaud Gov. Tim Walz for rejecting refugee ban nonsense. startribune.com", "2019-12-18T00:56:00.000Z": "This is great news for our Liberian community here in Minnesota. They are our co-workers, our friends, our neighbors - and now they can become our fellow citizens. Senate approves path to citizenship for Liberians facing deportation U.S. Senate approves measure for those facing deportation March 31 startribune.com", "2019-12-17T23:14:44.000Z": "I had a great time stopping by a few local shops in beautiful downtown Waseca today, and highly recommend the peaches 'n' cream scone from @TrioWaseca !\n\nThese small businesses are the lifeblood of our Greater MN economy. #OneMinnesota  #MyWaseca", "2019-12-17T22:54:09.000Z": "Aging is a reality that we all face.\n\nThat's why I'm working to make Minnesota an Age-Friendly state that is respectful and inclusive and helps all more older Minnesotans lead full lives as they age. https:// postbulletin.com/opinion/our_vi ew/our-view-governor-s-order-will-help-fight-ageism-in/article_0f09b084-1de5-11ea-92ac-4f0175ff7702.html ", "2019-12-17T16:11:56.000Z": "Thanks to @GovTimWalz for taking the time to visit our school and discussing government with our students today! #MyWaseca", "2019-12-17T01:23:59.000Z": "Today concluded the beautiful memorial services for our brave @MNNationalGuard soldiers: Chief Warrant Officer 2 Charles Nord, Chief Warrant Officer 2 James Rogers, and Sergeant Kort Plantenberg.", "2019-12-16T15:18:29.000Z": "We can't afford to wait any longer when it comes to climate change. That's why I'm taking action to put Minnesota at the forefront of finding solutions to the climate crisis. #OneMinnesota EDITORIAL | Walz takes charge on climate change After setback in legislative session, executive order will at least keep Minnesota moving. startribune.com", "2019-12-15T19:00:09.000Z": "That is why we are launching a competitive search for an outside expert to take an independent look at DHS and recommend whether breaking up the agency would improve efficiency, increase accountability, and better serve Minnesotans. #mngov  #mnleg  http:// startribune.com/walz-hires-con sultant-to-study-options-for-dhs/566176871/ ", "2019-12-15T19:00:08.000Z": "As my Administration surfaces issues at the Department of Human Services that have been going on for years, we must dig deeper to find the root of these problems. #mngov  #mnleg", "2019-12-15T00:07:22.000Z": "Happy Caturday!", "2019-12-13T22:27:51.000Z": "Minnesotans believe everyone should live w dignity & respect. This includes refugees who've given back much to the state & communities that have welcomed them. That's why I'm challenging POTUS's resettlement order. It's not just illegal, it's immoral. Attorney General Ellison defends refugees against President's unlawful executive order Joins coalition of 12 AGs in brief in support of refugee-resettlement organizations challenging Trump order; argues order violates federal law, interferes with state sovereignty, and undermines... ag.state.mn.us", "2019-12-14T01:05:23.000Z": "\"As the holiday season approaches, we are reminded of all who seek refuge in Minnesota.\" Thanks @GovTimWalz  for reminding the President of the United States that \"the inn is not full in Minnesota.\" Refugees are a big part of MN our work force. Gov. Tim Walz to Trump on refugees: 'The inn is not full in Minnesota' Governor gives consent to refugee resettlement after new executive order by the president. startribune.com", "2019-12-14T00:12:39.000Z": "You can read my full letter here", "2019-12-13T23:00:31.000Z": "All Minnesotans should be able to afford the medicine they need to survive. I applaud the @mnhouseDFL for holding public meetings on insulin affordability. We must move forward on this issue to find solutions for Minnesotans. Let's get this done. #insulin4all Quote Tweet Minnesota House DFL @mnhouseDFL RELEASE: House DFL members of the insulin working group have scheduled a public meeting on the status of insulin affordability legislation at 1:00 pm on Wednesday, December 18th. https:// house.leg.state.mn.us/members/profil e/news/15518/26324 ", "2019-12-13T18:34:35.000Z": "MN has a strong moral tradition of welcoming those who seek refuge.\n\nThis holiday season, I have a message for the Trump Administration: The inn is not full in Minnesota. Quote Tweet MPR News @MPRnews Gov. Tim Walz on Friday gave his formal consent to letting refugees settle in Minnesota and said he rejected the intent of President Trump's executive order requiring state and local governments to formally OK such settlements. https:// mprnews.org/story/2019/12/ 13/inn-is-not-full-in-minnesota-walz-backs-continued-refugee-settlement  Show this thread", "2019-12-12T23:06:41.000Z": "Everyone wants to live in a community that is respectful, inclusive, and supportive of our contributions and needs. That's why I signed this Executive Order to move us toward an #AgeFriendly MN. Walz wants to make MN nicer for the elderly. He announces Age Friendly council. Minnesota soon will have more residents over 65 than under 18, and Gov. Tim Walz wants to make the state a more welcoming place for older people to live. The Democratic governor on Wednesday announ twincities.com", "2019-12-12T18:49:33.000Z": "For decades, @willsteger has been a champion for #ClimateAction . Will is both a friend and a mentor, and I was glad to meet with him and @ClimateGenOrg to discuss ways we can continue partnering together to tackle climate change in MN and build a more sustainable future.", "2019-12-11T15:28:34.000Z": "Breaking news...Today, we make history @mnlcoaging Summit. @GovTimWalz signed Age-Friendly Minnesota Executive Order!", "2019-12-11T19:35:05.000Z": "I'm making climate change a priority in my Administration, so we can create a sustainable future for all Minnesotans. Because if Washington won't lead, Minnesota will. #OneMinnesota Climate change to be a top focus for Walz and his cabinet A day after issuing an executive order stating that \"climate change is an existential threat that impacts all Minnesotans,\" Gov. Tim Walz was in Mankato Tuesday to reinforce the message. mankatofreepress.com", "2019-12-11T17:32:08.000Z": "Today I was proud to join the Minnesota Leadership Council on Aging @mnlcoaging as I signed this Executive Order to help make Minnesota an #AgeFriendly state.\n\nTogether, we can uplift the voice of older Minnesotans to ensure everyone can thrive in our state. #OneMinnesota", "2019-12-10T15:16:22.000Z": "Through our bonding bill, we can invest in programs like RFA to support young and emerging farmers and invest in MN's rural economy. Because wins for our farmers and Greater MN are wins for Minnesota. #OneMinnesota  #mngov  #mnleg", "2019-12-10T15:16:19.000Z": "Last week, I had the opportunity to visit with Brent Kelsey at his farm in Lake Crystal. Back in 2010, Brent relied on the Rural Finance Authority - a low-interest loan program for MN farmers - to get his farm up and running. #OneMinnesota", "2019-12-08T15:44:00.000Z": ". @mlahammer follows along as @GovTimWalz tours another potential bonding project. This one is particularly close to the Governor himself.", "2019-12-07T15:46:16.000Z": "On behalf of MN, Gwen and I offer our deepest sympathies to the families of Chief Warrant Officer Two Charles Nord, Chief Warrant Officer Two James Rogers, and Sergeant Kort Plantenberg. Words will never ease the pain of this loss and we are forever in the debt of these warriors. Quote Tweet Star Tribune @StarTribune Minnesota National Guard identifies soldiers killed in helicopter crash; they had returned in May from a nine-month deployment. http:// strib.mn/38g1JcH Show this thread", "2019-12-06T21:13:34.000Z": "In honor of our fallen heroes.", "2019-12-06T18:09:15.000Z": "A flag erected minutes ago near a Blackhawk helicopter crash that killed three members of the MN National Guard. The Krippner family, which owns the land where the chopper went down, put up the flag to show their respect. They say a permanent flagpole will be erected later.", "2019-12-06T18:29:16.000Z": "I am mourning with all Minnesotans for the brave National Guard soldiers who tragically died yesterday. Today I ordered flags across Minnesota to be lowered in honor of their dedicated service.", "2019-12-06T01:33:00.000Z": "I am in Kimball tonight with our brave service members of the @MNNationalGuard .\n\nTune in below for my remarks. Quote Tweet KARE 11 @kare11 LIVE: Gov. Tim Walz to provide an update on today's Nat'l Guard helicopter crash in Stearns Co. https:// twitter.com/i/broadcasts/1 kvJpREjAXoKE ", "2019-12-05T19:24:54.000Z": "This budget forecast is good economic news for our state. And the people of Minnesota have themselves to thank for that - for living here, raising their families here, and contributing to the state's economy. $1.3 billion Minnesota surplus estimate sparks new spending debate Legislators and Gov. Tim Walz highlighted different spending priorities Thursday. startribune.com", "2019-12-05T16:01:33.000Z": "@GovTimWalz & @MNagriculture Deputy Commissioner @afvaubel stop in Lake Crystal on bonding tour to highlight Rural Finance Authority Governor Walz stops in Lake Crystal on bonding tour Governor Walz is getting input from Minnesotans as he prepares to allocate bonding dollars across various capital investments, including the Rural Finance Authority loan programs. keyc.com", "2019-12-05T02:47:20.000Z": "And my message to JUUL, if they're listening today, is: you can hire your attorneys, you will have your day in court, but we will bring the righteous justice of the state of Minnesota down on JUUL. #MNvsJUUL Minnesota sues e-cigarette maker Juul over youth vaping rise Minnesota Attorney General Keith Ellison is suing Juul Labs abcnews.go.com", "2019-12-05T02:47:19.000Z": "These students make me incredibly proud to be Governor. I am grateful they shared their stories on how they feel preyed upon and deceived by the vaping industry. #MNvsJUUL", "2019-12-04T22:38:03.000Z": "I'm proud to stand in partnership w/ @GovTimWalz and @LtGovFlanagan to protect the health & safety of our young people. Thanks to the youth that joined us during today's press conference announcing our lawsuit against JUUL. Your courage inspires us all. https:// bit.ly/2qm9pt3", "2019-12-04T18:39:10.000Z": "Today @AGEllison and @GovTimWalz announced the State of MN is taking action to stop the vaping industry from using deceptive marketing targeting our kids. Thank you for holding them accountable and protecting the heath of Minnesotans @LtGovFlanagan  @ANSRMN  #MNvsJUUL", "2019-12-04T17:51:53.000Z": "Thank you to Claire and Will at @Hopkins270 for sharing their story about their experiences with vaping. They shared that they felt deceived and they wanted resources while they were trying to quit. #MNvsJUUL", "2019-12-04T17:36:25.000Z": "This company is running a deceptive marketing campaign deliberately targeting our children, and students across the state tell me they feel preyed upon by the vaping industry. #MNvsJUUL", "2019-12-04T17:36:24.000Z": "Today I'm proud to stand with @AGEllison as we announce that the State of Minnesota is filing a lawsuit against e-cigarette manufacturer JUUL. #MNvsJUUL  #mngov  : https:// facebook.com/GovTimWalz/vid eos/2212794385688289?sfns=mo ", "2019-12-03T23:06:08.000Z": "Minnesotans and Minnesota companies understand we must lead on addressing climate change. Thank you @Cargill . Cargill pledges to reduce greenhouse gas emissions from its entire supply chain by 30% The commitment follows a contentious summer when Cargill faced severe activist criticism during the recent spate of fires in and around the Amazon. startribune.com", "2019-12-03T22:40:11.000Z": "Minnesota's future is bright with these students as our future leaders. Thank you to the Native American and immigrant students at @MNSUMankato for meeting with me and sharing your stories today. #OneMinnesota", "2019-12-03T19:16:22.000Z": "I spent my career in Congress working to ensure that our veterans have access to the care they need - and I saw the relief medical cannabis could bring them for chronic pain.\n\nI'm glad @mnhealth is working to help more Minnesotans get this same relief. Minnesota OKs medical cannabis for chronic pain, eye disease Macular degeneration and chronic pain will be added next year as conditions eligible for treatment under Minnesota's medical marijuana program. The state Health Department also said it would allow... mprnews.org", "2019-12-02T16:04:04.000Z": "Climate change threatens the very things that make MN a great place to live. That's why I'm signing this Executive Order to create a Climate Change Subcabinet - bringing state government agencies together to implement bold, collaborative action on climate change. #OneMinnesota", "2019-11-30T19:36:49.000Z": "Cheering on @GopherFootball with our students before the big game! #RTB  #SkiUMah  #Gophers", "2019-11-30T17:55:29.000Z": "Small businesses are the backbone of our economy, and today I'm proud to proclaim it #SmallBusinessSaturday in Minnesota. Gwen and I stopped by @ShopGoodthings in St. Paul to pick up some gifts for the holiday season. #shopsmall Where are you shopping today?"}