{"2020-07-26T15:21:38.000Z": "Tragic loss. May our God assuage the pain of his family... UPDATE- Monroe County deputy killed in line of duty - WCBI TV | Your News Leader Deputy hit by car at checkpoint wcbi.com", "2020-07-23T18:42:01.000Z": "I was honored to introduce @POTUS to my friend Charles Evers at the opening of the Museum of Mississippi History and the Mississippi Civil Rights Museum.  He was a legend to us all. @MDAH_Official", "2020-07-17T19:48:49.000Z": "Reagan economist touts multi-billion dollar benefits of digital credentialing. #$437.6Billion #LafferCurve $4 billion in annual economic benefits could pour into our economy with this simple move: Art Laffer The hiring process costs employers an average of 42 days and over $4,000 per hire. foxbusiness.com", "2020-07-09T18:36:09.000Z": "Great job by @DeSotoCountyMS , @mdaworks team and Governor @tatereeves ! Google announces first U.S. Google Operations Center coming to Southaven Google announced on Thursday that it will be opening its first U.S. Google Operations Center in Southaven, Mississippi. The Operations Center will provide customer and operations support to Google's... desototimes.com", "2020-07-08T17:44:34.000Z": "Amen Senator. Quote Tweet Senator Roger Wicker @SenatorWicker Another #SCOTUS victory for the Little Sisters of the Poor and for religious liberty and the First Amendment. Churches and religious ministries cannot be forced to violate their sincerely held religious beliefs. twitter.com/AP/status/1280", "2020-07-07T00:26:22.000Z": "Go rest high on that mountain.  There is a new fiddle player in glory. Quote Tweet Charlie Daniels @CharlieDaniels Guess I'll hang it up for tonight \nGoodnight planet earth-God bless", "2020-07-04T13:23:22.000Z": "I stand for the flag and with @Franklin_Graham and our @POTUS . Happy 4th y'all! Quote Tweet Franklin Graham @Franklin_Graham Happy Independence Day! I thank God for the men and women who laid down their lives for this flag and the freedoms that it represents. Show this thread", "2020-07-02T19:53:33.000Z": "Great job Mr. President! @realDonaldTrump Quote Tweet Donald J. Trump @realDonaldTrump JOBS, JOBS, JOBS! #MAGA", "2020-06-30T21:40:05.000Z": "This economic impact study was done by renowned economist Arthur Laffer. The Laffer report estimates that nationwide implementation of this type of work program would yield a economic benefit of $437.6 billion. @gradish  @trevorcornwell", "2020-06-30T21:38:55.000Z": "The folks @earnmerits are doing their part to help get Americans back to work. This innovative company breaks down the time barriers to portability of work credentials across states. #LafferEconomics Laffer Study: Widespread Adoption of Digital Credentialing Would Lead to $437.6 Billion in Annual... Laffer Associates has issued a report detailing the economic benefits of digital solutions that can dramatically shorten periods of unemployment. businesswire.com", "2020-06-30T20:03:51.000Z": "Tomorrow we will lay to rest one of the finest Patriots I have ever known.  Billy was my close friend who I will miss dearly.  Leading \"Amidst the Fray\" will be Billy's legacy to us all.", "2020-06-25T14:57:50.000Z": "I was proud as Governor to add \"In God We Trust\" to the State Seal with @tatereeves and @PhilipGunnMS . It will make a great Mississippi State Flag.", "2020-06-24T18:27:43.000Z": "Congratulations to my friend Cory Wilson for making history as @POTUS 's 200th judge!  I was honored to appoint Cory to the Mississippi State Court of Appeals in 2018. Quote Tweet The White House @WhiteHouse 0:03 BREAKING: The Senate just confirmed President @realDonaldTrump 's 200th judicial nominee!", "2020-06-19T14:26:38.000Z": "MAGA Quote Tweet Donald J. Trump @realDonaldTrump", "2020-06-08T16:27:27.000Z": "Divine counsel. Archbishop Viganò's powerful letter to President Trump: Eternal struggle between good and evil... Archbishop Carlo Maria Viganò warns the president that the current crises over the coronavirus pandemic and the George Floyd riots are a part of the eternal spiritual struggle between the forces of... lifesitenews.com", "2020-06-06T15:33:09.000Z": "Above the beaches of Normandy rest those that paid the ultimate price for their country.  I pray we never forget their sacrifice.  D Day - June 6, 1944", "2020-06-05T16:52:15.000Z": "Proud of my former colleague @Lauriejo1. She's doing a great job for @USDOL and American women! Quote Tweet USDOL Women's Bureau @WB_DOL #OTD in 1920, the Women's Bureau was established in @USDOL to promote the welfare of wage-earning women, improve working conditions, increase efficiency, and advance opportunities for women to access profitable employment. 100 years later, this remains our purpose. #WB100", "2020-06-05T15:09:31.000Z": "Great news for America. Thanks Mr. President. Quote Tweet Donald J. Trump @realDonaldTrump Really Big Jobs Report. Great going President Trump (kidding but true)!", "2020-06-05T02:39:25.000Z": "Powerful. Quote Tweet Franklin Graham @Franklin_Graham \"It's a racial issue but it does go deeper than just race. There is a spiritual warfare going on.\" Hear from our @BGEA Rapid Response chaplains who are sharing hope and ministering to the people of Minneapolis, MN.", "2020-06-03T03:08:53.000Z": "Interesting article by local Journalist Frank Corder. President Trump: Peaceful protesting, law and order go hand in hand The last six nights have featured gut wrenching images of major cities in the U.S. in chaos as violent riots seem to be stealing the media narrative from much larger participation in peaceful... yallpolitics.com", "2020-05-25T21:51:36.000Z": "Mississippian Hugh Talbert.  KIA during the invasion of Normandy on June 19th, 1944.  We must never forget that some gave all.", "2020-05-17T02:26:46.000Z": "In 100 days, we renominate @realDonaldTrump at the @GOPconvention . We will Keep America Great. I look forward to seeing everyone in Charlotte! #RNCinCLT", "2020-05-13T17:37:28.000Z": "Honored to Co-Chair the @realDonaldTrump Victory Finance Committee for Mississippi.  Participated in the virtual briefing for the Southeast with @DonaldJTrumpJr , @kimguilfoyle , & @GOPChairwoman . We will \"Keep America Great!\"  #Trump2020", "2020-05-10T14:35:19.000Z": "My mother's bible...worn from use...reminds me on this special day how our mothers often lead us down the narrow path and to the small gate of salvation.  I miss her dearly.", "2020-05-07T13:42:11.000Z": "A powerful message from our First Lady for all to hear on this National Day of Prayer.  \"We should pray without ceasing.\" 1 Thessalonians 5:17 #NationalDayOfPrayer Quote Tweet Melania Trump @FLOTUS As Americans of all faith turn to prayer, this #NationalDayofPrayer reminds us of the grace of God & the importance of faith, family & loved ones in our daily lives.", "2020-05-02T14:59:43.000Z": "I am honored to appear on The Call to Unite today 10:30 a.m.  I will share Matthew 7:24.  This nation is built on a rock and will not fall. The Call to UNITE This is The Call to Unite, a live 24-hour global event that invites all people to experience the world's most inspiring spiritual, cultural, and community leaders - and channel that energy into a... unite.us", "2020-04-23T14:38:30.000Z": "Good reminder in these difficult times. Keep your eyes upon Jesus.", "2020-04-22T15:26:48.000Z": "I now challenge @SecretaryPerry  @ScottWalker & @GovMikeHuckabee ! #CombatCOVID19Challenge", "2020-04-22T15:24:01.000Z": "I have accepted @GovChristie 's challenge. Deborah and I will start by donating and encouraging others to donate to @ExtraTable , a non-profit providing hungry Mississippians with healthy, shelf-stable food everyday and most especially during this pandemic. #CombatCOVID19Challenge", "2020-04-15T14:19:13.000Z": "Interesting article from Frank Corder CORDER: #MeToo or Et Tu, Mike Espy? With Democrats coalescing around Joe Biden as their best chance to defeat President Donald Trump in November, there is a lingering sexual harassment allegation made by a former staffer that Biden's... yallpolitics.com", "2020-04-13T01:45:52.000Z": "Earlier today.  Before the Storms.  Now we pray and remember Mississippi always rises together.", "2020-04-12T16:09:14.000Z": "Visited the garden tomb while in Jerusalem in 2017.   Praise God, \"He is risen!\"", "2020-04-11T23:15:12.000Z": "My grandson found an empty plastic egg in his basket.  \"Look,\" he said with a child's excitement.  \"It's the Jesus Egg!\"  Sunday is coming.", "2020-04-10T20:49:26.000Z": "Jesus said, \"It is finished.\" With that, he bowed his head and gave up his spirit.\nJohn 19:30\n\nChrist died on the cross only to rise again on the third day.  Sunday is coming.", "2020-04-07T17:13:31.000Z": "Deborah always appreciated Rachel's hard work at the Mansion.  She became part of the family at the people's house. @southern135 Quote Tweet Future Female Leaders @FFL_of_America How She Got That Internship: Rachel's Internship With The First Lady of Mississippi https:// futurefemaleleader.com/how-she-got-th at-internship-rachels-internship-with-the-first-lady-of-mississippi/ ", "2020-04-05T16:13:52.000Z": "Sunrise at the Farm is a daily reminder of the rising of the Son of God. This Palm Sunday begins our Holy week and Jesus once again will enter the city.", "2020-04-03T15:01:07.000Z": "Ringing of Church bells has always been a call to worship. Thanks Delbert for reminding us. Quote Tweet Delbert Hosemann @DelbertHosemann We are asking our Mississippi churches to ring their church bells at 6 p.m. every day beginning April 6 through the end of the statewide shelter-in-place on Monday, April 20. Citizens can ring their bells from their front porch. Show this thread", "2020-04-01T18:16:04.000Z": "The energy industry has always been a major part of winning America's wars.  This battle against COVID-19 and its attack on our people and economy will be no different. Save America's Oil And Gas Industry While all eyes are on the global pandemic, our nation's military superiority, our citizens' quality of life and our economic stability are threatened. American oil and gas has been a source of... forbes.com", "2020-03-31T17:44:16.000Z": "I was honored to appoint Judge Wilson to the Miss. Court of Appeals during my term as Governor. He will do a great job serving on the Fifth Circuit. Wicker, Hyde-Smith Applaud Mississippi Judicial Nominations President Trump Picks Cory T. Wilson & Kristi H. Johnson to Serve on Federal Bench U.S. Senators Roger Wicker, R-Miss., and Cindy Hyde-Smith, R-Miss., today welcomed President Trump's nominations of... yallpolitics.com", "2020-03-29T22:11:15.000Z": "Let us join our Neighbors tomorrow for this day of prayer for our Nation. Quote Tweet Gov. Asa Hutchinson @AsaHutchinson I have declared tomorrow a Special Day of Prayer in Arkansas. It is my hope that we can be unified in prayer thanking God for His love and mercy. We need His wisdom & guidance during this time of emergency. https:// governor.arkansas.gov/images/uploads /proclamations/20200329_2020_A_Special_Day_of_Prayer_in_Arkansas._.pdf ", "2020-03-28T15:53:57.000Z": "My friend @ScottWalker shares his bible with us all this morning. Thanks Governor. Quote Tweet Scott Walker @ScottWalker But Jesus immediately said to them: \"Take courage! It is I. Don't be afraid.\"\n\nMatthew 14:27", "2020-03-25T20:50:45.000Z": "U.S.A. Strong. Quote Tweet Donald J. Trump @realDonaldTrump The LameStream Media is the dominant force in trying to get me to keep our Country closed as long as possible in the hope that it will be detrimental to my election success. The real people want to get back to work ASAP.  We will be stronger than ever before!", "2020-03-23T00:23:53.000Z": "A Great company with a Mississippian as CEO.  My friend David Abney from the Delta.  Thanks Mr. President. Quote Tweet Donald J. Trump @realDonaldTrump The hard working men and women of @UPS are working overtime to maintain our supply chain and deliver medical supplies to those in need. Your work is critical to the health of our nation, keep it up!", "2020-03-21T16:04:16.000Z": "Great article by my friend @peggy_grande .  U.S.A. Strong. Peggy Grande: Americans will survive uncertainty of coronavirus - We are stronger than we realize We need to rise above partisan politics and rely on each other and the God in whom we as a nation trust. We need to not be defined by the crisis itself, but defined by our courage in facing it. foxnews.com", "2020-03-20T15:10:24.000Z": "Thankful today for our friends in Israel.  God be with us all. https:// tevausa.com/news-and-media /press-releases/teva-to-donate-potential-covid-19-treatment-hydroxychloroquine-sulfate-tablets-to-hospitals-nationwide-/ ", "2020-03-17T23:58:11.000Z": "Saving a portion of our income is always the right thing to do. Quote Tweet Yall Politics @MSyallpolitics CORDER: Mississippi's Rainy Day fund survived attempts to raid it for this moment. #msleg Loss of millions (sales taxes, other revenues) seems to be inevitable with #coronavirus . Significant fiscal challenges ahead if life doesn't return to normal soon. https:// yallpolitics.com/2020/03/17/cor der-mississippis-rainy-day-fund-survived-attempts-to-raid-it-for-just-this-moment/ ", "2020-03-16T17:02:31.000Z": "Businesses are pulling together in this time of crisis. #coronavirus Verified Identity Platform Merit Launches 'ReadyNow' Medical License Reciprocity Program to Aid... Merit is offering all states a digital licensing and verification program to help medical professionals respond to COVID-19 across state lines. businesswire.com", "2020-03-15T17:57:18.000Z": "My cousin Donnie Dukes is Deploying to the Middle East with the MNG.  We pray for his safety as he continues to serve his nation.", "2020-03-14T16:54:40.000Z": "Amen Mr. President Quote Tweet Donald J. Trump @realDonaldTrump It is my great honor to declare Sunday, March 15th as a National Day of Prayer. We are a Country that, throughout our history, has looked to God for protection and strength in times like these.... Show this thread", "2020-03-10T02:15:15.000Z": "Thanks Mr. President for your support of Michael. Let's keep Congressman Guest on the job for us all. Quote Tweet Donald J. Trump @realDonaldTrump Congressman Michael Guest ( @GuestCongress ) is an incredible fighter for the Great State of Mississippi. Michael is strong on Crime and the Border, he loves our Military and Vets. Michael has my Complete and Total Endorsement! Get out and Vote for Michael tomorrow, March 10th!", "2020-03-10T01:31:36.000Z": "Steven is a veteran working for veterans. Let's re-elect @StevenPalazzo  Quote Tweet Donald J. Trump @realDonaldTrump Congressman @StevenPalazzo is doing a fantastic job for the people of Mississippi. He strongly supports our #MAGA Agenda. Steven will continue to protect your #2A , & Support our INCREDIBLE Vets & Military. Steven has my Complete Endorsement. VOTE for Steven tomorrow, March 10th!", "2020-03-09T17:23:44.000Z": "Happy Commonwealth Day! RCSUSA is proud of our strong ties with @RoyalCWSociety and other friends in the UK. #commonwealthday  #royalcommonwealthsociety", "2020-03-08T17:16:16.000Z": "All gave some and some gave all.  We must always remember our Veterans. Quote Tweet Hattiesburg American @hburgamerican Retired Hattiesburg combat engineer Jack Walker  received a $10,000 check to help with construction costs on his new home. https:// hattiesburgamerican.com/story/news/loc al/hattiesburg/2020/03/06/jack-walker-hattiesburg-disabled-veteran-gets-check-10-000-for-new-home/4963870002/ ", "2020-03-07T15:06:10.000Z": "Congratulations to my friend Mark Meadows.  Good man for the job. Quote Tweet Donald J. Trump @realDonaldTrump I am pleased to announce that Congressman Mark Meadows will become White House Chief of Staff. I have long known and worked with Mark, and the relationship is a very good one.... Show this thread", "2020-03-04T18:34:42.000Z": "Historic event in Harrison County.", "2020-03-03T21:21:19.000Z": "Deborah and I send our thoughts and prayers to those loved and lost in Nashville. It was a tragic event that we know about all to well in Mississippi. Our prayers are with you. #nashvillestrong", "2020-03-03T01:19:20.000Z": "Congratulations to one of my former team members at the governor's office, @kkline201 , for being appointed to the Dept of @CommerceGov . #MAGA", "2020-03-02T02:01:04.000Z": "One of the bravest men I know.  Great Governor of Texas teaching us all a lesson.  Determination. Quote Tweet Greg Abbott @GregAbbott_TX Our lives are not defined by how we are challenged. \n\nInstead we determine our future by how we respond to those challenges. \n\nWe live in a State where a young man can have his back broken in half and still rise up and become Governor. \n\nAnything is possible in Texas.", "2020-02-21T17:49:53.000Z": "We are proud of our partnership with Uzbekistan and the Mississippi National Guard.  I look forward to my return to this amazing country which is leading Central Asia to a brighter future. Quote Tweet Javlon Vakhabov @JavlonVakhabov Grateful to meet w/ @PhilBryantMS . I've been alw inspired by his accomplishments. Under his leadership UE's reached historic lows. >50 tax cuts into law've been signed. For the 1st time ever, MS is at the top of the good lists in education. MS remains my favorite subject to learn.", "2020-02-14T18:49:50.000Z": "Great choice by Administrator @EPAAWheeler and @WhiteHouse . Expect more cooperative federalism with this great leader from Mississippi. You make us proud, Mandy @MississippiMG She pushed Trump to exit the Paris climate agreement and roll back environmental rules. And she's... One of EPA's first Trump appointees, Mandy Gunasekara, has run a \"pro-Trump nonprofit\" since leaving the agency a year ago. washingtonpost.com", "2020-02-13T21:09:03.000Z": "Lecile brought laughter to generations of fans.  My children and grandchildren always loved America's best rodeo clown.  God bless you my friend.", "2020-02-09T16:40:58.000Z": "Wanted to share this devotion. God does speak to all of us. I hope to become a better listener.", "2020-02-08T23:11:01.000Z": "Glad to have participated in the Call-Day event for @GOP and President @realDonaldTrump yesterday. We raised over $20 million for Trump Victory 2020.", "2020-02-07T16:53:10.000Z": "Meeting today @MarALago with @Nigel_Farage to discuss trade with Great Britain. Congratulations my friend. You made Great Britain great again.", "2020-02-06T16:06:21.000Z": "I met President Reagan in 1986, and he inspired me to seek public service.  Strong mothers were our inspiration. Happy Birthday Mr. President. Peggy Grande: Ronald Reagan was born exactly 109 years ago - How did his mother influence his... Exactly 109 years ago - on Feb. 6, 1911 at 4:16 am - Ronald Wilson Reagan was born in Tampico, Ill., in an apartment above the local bank. foxnews.com", "2020-02-05T03:50:05.000Z": "I can only imagine how she helped divide America with her actions. Quote Tweet Mississippi GOP @MSGOP Nancy Pelosi just ripped up a copy of the President's address on live television. Devoid of all class and decorum. #TheseAreTheDemocrats", "2020-02-05T03:43:48.000Z": "\"The American Adventure has only begun.\" - @realdonaldtrump . I am so proud of our President tonight. Let's keep America great.", "2020-02-01T17:51:01.000Z": "Congratulations to my friend @Nigel_Farage . He has helped make Great Britain Great Again. #worldforbrexit", "2020-01-29T23:54:59.000Z": "Glad to be back in the private sector. Looking forward to advancing economic development opportunities in this new role. Former Mississippi Gov. Phil Bryant lands consulting gig The consulting firm was originally formed by former Gov. Phil Bryant's chief of staff. clarionledger.com", "2020-01-28T19:31:49.000Z": "I have had the honor of meeting with Prime Minister @netanyahu several times on trade missions to Israel. He is a true friend of the United States and President Trump. #standwithisrael Quote Tweet Dan Scavino Jr. @Scavino45 MOMENTS AGO President @realDonaldTrump participates in a bilateral meeting with Israeli Prime Minister Benjamin @Netanyahu in the Oval Office of the @WhiteHouse ....", "2020-01-21T04:36:28.000Z": "Touching tribute by President Trump to MLK.  Let there be no more hate forever. Quote Tweet The White House @WhiteHouse #MLKDay", "2020-01-20T18:59:04.000Z": "Great to be with @realDonaldTrump at the @FarmBureau annual convention yesterday. Ranchers and farmers are WINNING BIG with this administration's trade deals.", "2020-01-13T23:47:34.000Z": "It has been an amazing ride. #mississippiworks", "2020-01-13T22:31:39.000Z": "Thank you Gary Rikard for all of your hard work at @MDEQ . You served Mississippi well. I wish you the best in your next endeavors. MDEQ Executive Director to step down - News Mississippi photo courtesy of MDEQ Executive Director of the Mississippi Department of Environmental Quality (MDEQ) Gary C. Rikard has announced he will be leaving the agency on January 13. Rikard has held the... newsms.fm", "2020-01-13T20:09:35.000Z": "This picture was taken on the way to give my first State of the State Address. @FirstLady_MS", "2020-01-13T18:07:32.000Z": "Thanks @The_RGA . Your support has made all the difference these last eight years. I have enjoyed working with the RGA team. Quote Tweet The RGA @The_RGA This week Mississippi Governor @PhilBryantMS completes two incredibly successful terms in office. Thank you Governor Bryant for all your hard work on behalf of the people of the Magnolia State!", "2020-01-13T17:25:13.000Z": "Tune in to @Supertalk . I am live on the radio with @thejtshow .", "2020-01-13T14:52:21.000Z": "Thanks @LucienSmith . We worked hard for the future of the state-Glad you were a part of it. #educationworks Phil Bryant: Mississippi's education governor Phil Bryant's work in public education will serve as the cornerstone of his legacy. clarionledger.com", "2020-01-13T14:42:28.000Z": "Throwback to signing the education works package in 2013. We've made great strides in education over the last eight years.", "2020-01-13T02:07:25.000Z": "Thanks so much Connor.  I will keep the seat warm for you.  Always, stay the course. https:// m.facebook.com/story.php?stor y_fbid=2931490410203864&id=149191811767085  .", "2020-01-12T15:02:29.000Z": "We were fortunate there were no fatalities from yesterday's storms.  Three lives were lost in neighboring Alabama. Our prayers go out to those families this Sunday morning. Quote Tweet msema @MSEMA We are receiving reports of damage statewide. Here are some initial pictures of damage caused by today's storms. We will share more details when we receive more specific information.", "2020-01-11T19:05:11.000Z": "I have signed a declaration  of emergency due to the severe weather the state has experienced. The storms have caused damage and high flooding will continue to be a threat. State assistance will be necessary to support state and local governments' response to recovery efforts.", "2020-01-11T18:03:29.000Z": "I met today with @MSEMA to get updated on the severe weather that occurred throughout the state. We are accessing damages and will take the necessary steps to help those affected by the storm. We are fortunate that no loss of life occurred due to the severe weather.", "2020-01-11T12:17:58.000Z": "Everyone please be cautious and aware as severe weather moves across our state. Follow @MSEMA and @NWSJacksonMS for updates. Quote Tweet msema @MSEMA TORNADO WARNING FOR NORTHWESTERN LAFAYETTE COUNTY, CENTRAL MARSHALL COUNTY, SOUTHEASTERN TATE COUNTY, SOUTHWESTERN BENTON COUNTY AND\nNORTHEASTERN PANOLA COUNTY UNTIL 600 AM CST.", "2020-01-11T03:59:13.000Z": "The Poultry Industry leads our Agribusiness world in Mississippi. Good to have 200 more jobs in Jones County. Farm processing facility to bring more than 200 new jobs to Laurel A farm processing facility in Laurel is bringing in more than 200 new jobs to the Pine Belt. wdam.com", "2020-01-11T00:16:38.000Z": "Honored to be with Commissioner Andy Gibson last night.  Great event at the Ag. Museum. @CommAndyGipson", "2020-01-10T22:57:39.000Z": "Amazing job by teachers, parents and students. #educationworks Mississippi Superintendent's Annual Report Shows Student Achievement Reaches All-time High The newly released Mississippi Department of Education (MDE) 2018-19 Superintendent's Annual Report shows how student achievement in Mississippi has reached an all-time high. View the report online... yallpolitics.com", "2020-01-10T22:09:21.000Z": "More good news from FEMA -Will be a relief for those still suffering from the storms. Additional counties eligible for storm recovery assistance - News Mississippi Chickasaw, Choctaw, and Oktibbeha counties are now eligible to apply for funding under FEMA's Public Assistance Program to supplement state and local recovery efforts in areas that sustained damage... newsms.fm", "2020-01-10T15:26:42.000Z": "Please be weather aware into Saturday.  Have a personal plan in the event of severe weather.  Prepare and plan to keep you and your family safe. Quote Tweet msema @MSEMA The timing of the severe weather expected to impact the state Saturday continues to become more clear. As of this afternoon, the National Weather Service expects the system to begin impacting the state in the early hours of Saturday and to continue into the afternoon #mswx", "2020-01-09T23:08:14.000Z": "Moving inmates to Tutwiler is the best course of action to secure these inmates and make sure we meet their needs. Good job by @MS_MDOC and MBI. See below for the latest MDOC update and a copy of my emergency letter putting this plan in action.", "2020-01-09T21:06:38.000Z": "Honored to witness the Swearing in of all of our Statewide Elected Officials including our new Secretary of State Michael Watson.", "2020-01-09T18:43:00.000Z": "Let us all join the President in thanking Law Enforcement who protect and serve us all.  As a former Deputy Sheriff, I am particularly close to my brothers in blue. Quote Tweet Donald J. Trump @realDonaldTrump Happy National Law Enforcement Appreciation Day! #LESM", "2020-01-09T13:57:35.000Z": ". @toshiba is opening distribution operations in Horn Lake. The $14 million project will create 40 jobs. The tremendous success DeSoto County's distribution industry has experienced in 2019 is unparalleled as companies have generated nearly 2,000 jobs for the area's workforce.", "2020-01-08T23:20:39.000Z": "Met with physicians and others on the Board of Health who oppose this amendment to our constitution.  I agree that we need to defeat this proposal in its current form. Medical marijuana will be on Mississippi's November ballot Ballot Initiative 65 is now on the ballot, but it may not be the only initiative up for consideration. wlox.com", "2020-01-08T19:54:03.000Z": "Strong revenue numbers for this Fiscal Year. More than half a billion in revenue collected in December. The economy in Mississippi is outpacing all estimates. https:// yallpolitics.com/2020/01/08/mis sissippi-revenues-climb-over-6-of-fy-2020-estimates-in-december/ ", "2020-01-08T17:35:00.000Z": "The number of unemployment claims have dropped dramatically over the last eight years, saving over $150 million since 2011. This will keep unemployment taxes low for employers and businesses growing their workforce. #msworks", "2020-01-08T14:31:37.000Z": "2019 was a great year for tourism in Mississippi. Thank you @visitms and @mdaworks for working hard to bring in tourists and highlight the wonders of our state.", "2020-01-07T22:51:07.000Z": "Congratulations to Whitney Lipscomb who will be joining @LynnFitch as her Deputy Attorney General. I appreciate her for serving on my staff for the past four years. She's been a remarkable leader in state government and will do a great job in this new role. Attorney General-Elect Lynn Fitch Announces Senior Staff Attorney General-Elect Lynn Fitch is pleased to announce the following senior officials to help lead her team at the Attorney General's Office. Jesse Graham, Deputy for Administrative Operations.... yallpolitics.com", "2020-01-07T21:23:38.000Z": "Members of the State Senate and @MSHouseOfRep have come to inform me that the 2020 Legislative Session has begun. Let's make this a great year for Mississippi.", "2020-01-07T20:59:35.000Z": "Great corporate neighbor in Mississippi for biomass that will help reduce emissions around the world. Quote Tweet Enviva @Enviva Enviva Chairman & CEO John Keppler outlines the facts & science about #bioenergy : \"Enviva was founded with a simple purpose of fighting #climatechange with effective solutions that could be implemented immediately.\" https:// newsobserver.com/opinion/articl e239026793.html ", "2020-01-06T23:27:03.000Z": "New opportunities set sail for the future with @SouthernMiss and the blue economy. Quote Tweet SOSEUSM @soseusm The inaugural educational cruise for the Ocean Engineering program took place in the fall on USM's R/V Point Sur. The crew was made up of both faculty and students.  This educational cruise will be repeated every fall for incoming students.", "2020-01-06T22:50:24.000Z": "No one has ever done a better job as Medicaid Director.  Drew will continue providing outstanding leadership for Mississippi. @SnyGuy Quote Tweet Taylor Vance @TaylorVanceDJ Gov.-elect @tatereeves is appointing Drew Snyder to be the executive director of the state's Medicaid division. Show this thread", "2020-01-06T21:53:53.000Z": "Thanks to the Marshall Service, @MS_MDOC and MHP for their assistance in capturing the second escapee a short time ago.  He will be charged and returned to be incarcerated. We will now find whoever helped with his escape and charge them as well.", "2020-01-06T17:21:37.000Z": "I am glad to be able to file the qualifying papers in Mississippi for @realDonaldTrump to be on the ballot in 2020. Mississippians are excited to vote and re-elect  President @realDonalTrump once again. @MSGOP  @TeamTrump .", "2020-01-06T16:07:58.000Z": "Inmate needs are being met, and I have ordered the investigations to continue. 2/2", "2020-01-06T16:07:43.000Z": "I have been working throughout the weekend with @MS_MDOC , MS Highway Patrol and @MSEMA officials to restore order and control at the prison at Parchman. Some MHP Officers continue to process the scene to recover any contraband or items that may be used as a weapon. 1/2", "2020-01-05T20:53:08.000Z": "Mississippi must invest in its prison system and the men and women who work there. State lawmaker says the only way to fix Mississippi's prison crisis is with money When the 2020 Legislative Session opens this week in Jackson, one of the very first topics lawmakers will tackle is the Mississippi's prison crisis. wlox.com", "2020-01-05T00:14:14.000Z": "Good meeting today with @MS_MDOC Commissioner Pelicia Hall. Gang violence will not be accepted in our prisons or on our streets. We have taken decisive action to end it.", "2020-01-04T19:15:35.000Z": "Anyone reporting conditions within the prison should have accurate information. Here it is. Quote Tweet MDOC @MS_MDOC THERE IS CURRENTLY NO FIRE OR MAJOR DISTURBANCE at the MS State Penitentiary at Parchman. There was a minor fire at Unit 30 earlier this week. That fire, set by an inmate, was immediately extinguished. Like other facilities in the prison system, the prison has limited movement.", "2020-01-04T18:22:42.000Z": "DPS and MBI officers have been responding to restore order and apprehend the two escapees. I have directed the use of all necessary assets and personnel to achieve this result. Over 500 inmates have been moved to a more secure detention and a general lockdown continues.", "2020-01-04T15:00:06.000Z": "Today we have 345 Mississippi Guardsmen deployed in Kuwait and other locations throughout the region supporting current operations. Please keep these soldiers and their families in your prayers. @nationalguardMS", "2020-01-03T23:56:45.000Z": "The people who perpetrated this violence will be charged and brought to justice. Gang violence will not be tolerated in state prisons or on our streets. https:// m.facebook.com/story.php?stor y_fbid=1447479755427865&id=117229601786227&anchor_composer=false ", "2020-01-03T23:56:33.000Z": "MDOC and the Department of Public Safety are to be commended for their response to this tragic situation. I have been in contact throughout the week with Commissioner Hall and MBI.", "2020-01-03T19:46:00.000Z": "Thank you Mr. President for always supporting Law Enforcement. @realDonaldTrump President Trump sends letter of support to Deputy Brad Sullivan - News Mississippi As Madison County Deputy Brad Sullivan continues his recovery after being shot in the line of duty in September, he has received a letter of encouragement from President Donald Trump. After being... newsms.fm", "2020-01-03T16:08:43.000Z": "Be very careful.  High water is dangerous and trying to drive through it can be tragic.  Please turn around and don't drown. Quote Tweet NWS Jackson MS @NWSJacksonMS Another dam failed in Hinds County near Raymond. The ensuing flooding caused minor structural damage and flooded some cars. Please remain vigilant of ongoing flooding in the Jackson Metro. Turn around, don't drown. Show this thread", "2020-01-03T14:47:50.000Z": "I was honored to work along side @GlennMcCJr as we won one economic development project after another for the people of Mississippi. The Golden Shovel is the highest honor in business development-Glenn received two for his state. #msworks Quote Tweet MS Dev. Authority @mdaworks \"It has been an honor to serve at the helm of MDA with our good, talented people and partners to win economic development opportunities for Mississippians.\" \n\nMDA Executive Director @GlennMcCJr to step down effective January 30  http:// ow.ly/Drto50xLIdL  #MSWorks", "2020-01-02T14:39:50.000Z": "I intend to work for @cindyhydesmith as if the fate of America depended on her single election. If Mike Espy and the liberal Democrats gain the Senate we will take that first step into a thousand years of darkness. Quote Tweet The Senate Majority @NRSC NEW VIDEO: We're one year out. Here are the stakes", "2020-01-01T15:25:20.000Z": "Forty-three years ago today Deborah and I were on our honeymoon in Gatlinburg.  She remains the light of my life. @FirstLady_MS", "2020-01-01T06:01:00.000Z": "Happy New Year! 2020 is going to be a great year!", "2019-12-31T18:58:01.000Z": "Marshall Fisher is a career Law Enforcement Officer who has served this state and country to the highest standards. I was fortunate to have worked with him.  Godspeed my friend. MDPS commissioner Marshall Fisher announces retirement, plans to pursue other opportunities Mississippi Department of Public Safety Commissioner Marshall Fisher announced Tuesday that he is retiring from state government, effective January 31, 2020. wlbt.com", "2019-12-31T14:32:18.000Z": "Yes we did. Quote Tweet State Policy Network @StatePolicy Mississippians' freedom of speech is protected thanks to @mspolicy . MCCP led the push for donor privacy in the state, resulting in the Gov signing a bill that protects and ensures the privacy of individuals who donate to charitable causes in Mississippi. https:// bit.ly/2rBAk4y", "2019-12-31T03:13:48.000Z": "Franklin has it right again. Thanks for being unafraid to speak the truth. Quote Tweet Franklin Graham @Franklin_Graham Do guns save lives? Saturday night a man w/ a machete wounded 5 at a Hanukkah celebration. Sunday morning a shooter killed 2 at a church in TX. Within 6 seconds, this gunman was shot dead because congregants were armed & ready to protect themselves. 1/3 https:// dallasnews.com/news/crime/201 9/12/29/2-dead-1-in-critical-condition-after-reported-shooting-at-church-in-white-settlement/?fbclid=IwAR2bpw5Hgs243Lv9T1voWzWprKNmm3lTO9s7LzlgsszeXC9_o4fvmxxY2Mk ", "2019-12-30T22:46:48.000Z": "I announced today that I have appointed Brian K. Burns as the Eighth Circuit Court District Judge. He replaces Judge Christopher A. Collins, who is leaving public service after serving 21 consecutive years as a judge. Burns' appointment is effective on January 2nd.", "2019-12-30T18:46:14.000Z": "", "2019-12-30T16:33:44.000Z": "Great job by MSCPS. Children come first.", "2019-12-29T23:25:14.000Z": "TORNADO WARNING FOR... \nNEWTON, KEMPER, NESHOBA AND LAUDERDALE COUNTIES\nUNTIL 6:15 PM", "2019-12-29T23:12:21.000Z": "TORNADO WARNING FOR\nOKTIBBEHA, CLAY AND LOWNDES COUNTIES UNTIL 5:45PM", "2019-12-29T21:36:03.000Z": "Tornado Warning including Kosciusko MS, Ethel MS, Sallis MS until 4:15 PM CST", "2019-12-29T20:54:10.000Z": "Please be weather aware and follow @MSEMA and @NWSJacksonMS for updates. Quote Tweet NWS Jackson MS @NWSJacksonMS Tornado Warning including Clinton MS, Madison MS, Ridgeland MS until 3:30 PM CST", "2019-12-29T16:39:51.000Z": "We have worked hard to bring the rest of the world to Mississippi. This year we welcomed 24.7 million visitors to the Hospitality State. @visitms Quote Tweet MS Economic Council @MECStateChamber The UK Telegraph recently did a profile on the #Mississippi  #Blues Trail. Read it here: http:// atjo.es/5HaB  #MississippiBluesTrail", "2019-12-28T16:01:29.000Z": "Let's all stand and salute the flag and proudly pledge our allegiance as one nation under God.", "2019-12-28T00:44:23.000Z": "Fighting for the least among us, the unborn. Mississippi asks appeals court to reconsider abortion ruling Mississippi is asking an appeals court to reconsider a ruling stating the state's ban on most abortions at 15 weeks of pregnancy is unconstitutional. clarionledger.com", "2019-12-27T23:06:15.000Z": "It was a very good year. State's 2019 top economic projects bring jobs, investments BEFORE YOU GO  we'd like to ask for your support. More people are reading the Mississippi Business Journal than ever before, but advertising [...] msbusiness.com", "2019-12-27T17:12:29.000Z": "This is fantastic news. Always proud of @HIIndustries -the best shipbuilders in the world. Quote Tweet MS Dev. Authority @mdaworks . @HIIndustries has announced its shipbuilding division has been awarded a contract with a potential total value of $453.4 million  #MSWorks  http:// ow.ly/So0o50xIISw", "2019-12-27T00:25:55.000Z": "Interesting perspective from my friend Rob Wasinger. Pelosi's Impeachment Farce Is an Attempt to Distract From the Deep State Conspiracy When House Speaker Nancy Pelosi abruptly announced in September that the House was moving forward with an official impeachment inquiry related to President Trump's dealings with Ukraine, it left many townhall.com", "2019-12-26T20:53:20.000Z": "Last christmas at the Governor's Mansion with the grandchildren. Santa made it a very special memory for us all.", "2019-12-25T13:00:01.000Z": "Merry Christmas from our family to yours. May your day be blessed with special time spent with family and friends as we celebrate our Savior's birth.", "2019-12-24T22:00:00.000Z": "\"A thrill of hope the weary world rejoices\nFor yonder breaks a new glorious morn\nFall on your knees\nO hear the angels' voices\nO night divine\nO night when Christ was born\"\n\nMerry Christmas Eve everyone!", "2019-12-24T18:15:03.000Z": "Amen @MarshallRamsey . Let us all pray for Warren and Sandra. Please Lord. Heal him.", "2019-12-23T23:03:23.000Z": "We had the annual Lighting of the Menorah at the Governor's Mansion with the Beth Israel congregation of Jackson, MS. It is always a special time sharing in this event with our Jewish friends.", "2019-12-23T20:01:45.000Z": "Every child deserves a Merry Christmas and all the folks at Batson do their best to make that happen for their patients.", "2019-12-23T19:25:39.000Z": "Amen. I hope everyone will start displaying a nativity scene to remember the real reason for the season. Quote Tweet Pope Francis @Pontifex The nativity scene reminds us that God did not remain invisible in heaven, but came down to earth and became man. To set up a nativity scene is to celebrate the closeness of God, to rediscover that God is real, concrete; He is humble Love that came down to us. #Nativityscene", "2019-12-23T18:21:14.000Z": "It is always wonderful to visit Batson Children's Hospital to hand out gifts and interact with the kids. They are always such a blessing to us. \n\nWe thank the physicians, nurses, technicians, and all other staff who care for these children and their families each day.", "2019-12-22T23:29:32.000Z": "Got to believe. #whodat Saints storm back to beat Titans, 38-28 Saints improve to 12-3 wlox.com", "2019-12-22T18:56:20.000Z": "We will continue with the Lighting of Menorah at the Governor's Mansion on Monday afternoon-a tradition Deborah and I began years ago.  Always a special time for our Jewish friends.", "2019-12-22T14:57:56.000Z": "", "2019-12-21T22:52:47.000Z": "Wishing everyone a very Merry Christmas from the people's home.", "2019-12-21T21:00:31.000Z": "Greg will continue to a great job as MEMA Director.  Good call Governor Reeves. @tatereeves  @MSEMA Quote Tweet Tate Reeves @tatereeves When disaster strikes, we need a director who can lead a quick response and work with local leaders to help our people. Working with him as Lt Gov, I know Greg Michel is the man for the job. I'm honored he will continue serving as @MSEMA Exec. Director to keep Mississippi safe.", "2019-12-20T19:00:02.000Z": "Glad to have @Google coming to Mississippi and creating 350 new jobs. They join @amazon as our states newest corporate neighbors. Welcome home Google. #finishstrong Operations center, 350 jobs mark Google's entry into Memphis metro area Google has plans to open an operations center in North Mississippi. The internet giant will hire 350 employees. commercialappeal.com", "2019-12-20T14:51:08.000Z": "I would like to congratulate Mississippi's 176 new National Board Certified Teachers. I appreciate your hard work and dedication to examine and strengthen teaching practices through this certification process.", "2019-12-19T22:11:09.000Z": "Jerry Lee is a country music legend and today we celebrate \"The Killer's\" musical legacy.", "2019-12-19T21:59:47.000Z": "I was proud to unveil the MS Country Music trail marker for Jerry Lee Lewis at his ranch in Nesbit, MS. Jerry is known for his innovative piano playing style and is one of the most iconic musicians of our time.", "2019-12-19T19:26:47.000Z": "Thank you to the Department of Public Safety for having me at the end of the year review luncheon. They are the best of the best. It's been a honor and a privilege to work with Commissioner Fisher, Col. Gillard and all the employees at @MissDPS .", "2019-12-19T14:16:37.000Z": "Proud to host the Base Commanders and Military Leaders of our Mississippi Installations last night. It's been our honor to host this reception every year. Thank you all for your continued service to our great state and nation! #MSStrong  #MilitaryWorks", "2019-12-19T04:00:46.000Z": "This is a day that will be remembered in infamy.", "2019-12-19T02:30:52.000Z": "We will answer in 2020. Quote Tweet Mississippi GOP @MSGOP . @BennieGThompson will vote against his district's interests and for his power and clout. No shock there. @realDonaldTrump has brought more improvements to MS02 than Rep. Thompson has in years. twitter.com/BennieGThompso", "2019-12-18T21:22:42.000Z": "Honored to be at my final Military Installations Commanders Roundtable. MS is blessed to have such a robust military community and I am grateful for the opportunity to visit with our commanders. It has been my great honor to work with and on behalf of these brave men and women.", "2019-12-18T18:14:57.000Z": "Glad to be able to speak to the hardworking employees of the MS Department of Corrections today. Over the past eight years we've made strides in criminal justice reform. We must fully fund @MS_MDOC in 2020. Thank you Commissioner Hall and @MS_MDOC .", "2019-12-18T14:08:41.000Z": "Amazing interview with two of America's leading women.  They are helping keep America great. Quote Tweet Peggy Grande @peggy_grande An honor to be interviewed by @LaraLeaTrump and to have our conversation shared and posted by @realDonaldTrump himself! https:// fbwat.ch/1ISSzESjVSulP4 d2 ", "2019-12-17T20:27:13.000Z": "It was my honor to present the Excellence in Government Awards to\nSam Howell, Director of the Mississippi Crime Lab and to Wayne Miller, Director of Public Works for the City of Gulfport. Thank you for nominating these hardworking individuals @MissDPS and @CityofGulfport", "2019-12-17T15:45:01.000Z": "I have issued a declaration of emergency following the weather events from yesterday. @MSEMA is working hard and assessing the damage state wide. If you need immediate assistance, please contact your local county emergency manager. https:// msema.org/county-ema/", "2019-12-17T14:44:20.000Z": "I will be at @MSEMA this morning to address the state about yesterday's severe weather events. Join live on MEMA's Facebook. Quote Tweet msema @MSEMA Governor Phil Bryant will address the state at 9:30 this morning regarding yesterday's severe weather. MEMA will carry the press conference live on Facebook as well.", "2019-12-16T22:14:08.000Z": "Mississippians, as you head home from school and work today please be weather aware and remain so into the night. There is more severe weather expected with more tornadoes possible. Follow @MSEMA , @NWSJacksonMS , @NWSMemphis , @NWSMobile & @NWSNewOrleans for updates. #mswx", "2019-12-16T18:05:11.000Z": "NWS Jackson confirms tornado via radar near Edwards, moving northeast at 35mph #mswx", "2019-12-16T17:18:43.000Z": "From the National Weather Service Jackson office at 1115 AM CST, A CONFIRMED LARGE AND EXTREMELY DANGEROUS TORNADO WAS LOCATED 8 MILES NORTHWEST OF PORT GIBSON, OR 21 MILES SOUTHWEST OF VICKSBURG, MOVING NORTHEAST AT 30 MPH.", "2019-12-16T16:29:19.000Z": "Thanks Mickey for all the years of service and for helping Mississippi grow like never before. #msworks Quote Tweet Glenn McCullough Jr. @GlennMcCJr Mickey and Carole Milligan are extraordinary Mississippians.  ...Thanks Coach for leading ... @mdaworks  for our people to win! #2GOLDSHOVELS6SILVER  #Teamwork  #MSWorks  #HailState", "2019-12-16T14:21:03.000Z": "Be weather aware today as severe storms with potential for strong winds, tornadoes, and hail move through Mississippi. Follow @MSEMA for the latest updates. #mswx Quote Tweet msema @MSEMA Severe weather is imminent today in Mississippi. As you can see below, the worst of the weather is expected to be in the central part of the state between noon and 6 pm. Please be weather aware, have a way of receiving weather alerts, and have a safe place to take cover.", "2019-12-15T15:53:50.000Z": "Lior was Consul General for Mississippi from Israel and is a dear friend.  He will do an outstanding job for the Ministry. Congratulations my friend. Quote Tweet Lior Haiat @LiorHaiat Starting today it is official, I'm the new Spokesperson of the Ministry of Foreign Affairs\nהחל מהיום זה רשמי, אני דובר משרד החוץ https:// pic.twitter.com/RQfKcy80s0  https:// pic.twitter.com/EZ1g3Psv3c", "2019-12-14T19:00:03.000Z": "Was an honor to be a part of this historic summit. Thank you President @realDonaldTrump . Quote Tweet The White House @WhiteHouse President @realDonaldTrump is supporting strong families and putting parents back in control!", "2019-12-14T18:03:38.000Z": "I am honored to serve with @peggy_grande as a Board Member of @world4brexit . President Reagan would have been proud of her fight for Democracy. Peggy Grande: Democrats beware -- British election is final nail in the coffin of the globalist... Is there really anything surprising about wanting to control one's own destiny? foxnews.com", "2019-12-14T13:53:42.000Z": "We will sustain our efforts to fight for America's unborn children. Mississippi will continue this mission to the United States Supreme Court. Quote Tweet Emily Wagster Pettus @EWagsterPettus #Mississippi 15-week #abortion ban is blocked by appeals court. Judges from conservative 5th Circuit say district judge ruled correctly when he stopped the law from taking effect in 2018. (from @AP ) #msleg  https:// apnews.com/c4f9a37a641117 4e1e3be843778a954d ", "2019-12-13T22:37:32.000Z": "Happy 383rd Birthday to the @USNationalGuard ! Whether helping our loved ones after severe storms or protecting our country abroad the National Guard stands ready. #AlwaysReady  #AlwaysThere  @nationalguardMS", "2019-12-13T18:17:09.000Z": "Great to be in Jackson County today to break ground on the I-10/Cook Road Connector Project. This $30 million dollar project will be a thoroughfare that will foster growth and economic development for the MS Gulf Coast.", "2019-12-13T16:27:07.000Z": "Thank you Mr. President. Mississippi farmers and manufacturers will do all the better now that you have closed the deal. Quote Tweet Donald J. Trump @realDonaldTrump We have agreed to a very large Phase One Deal with China. They have agreed to many structural changes and massive purchases of Agricultural Product, Energy, and Manufactured Goods, plus much more. The 25% Tariffs will remain as is, with 7 1/2% put on much of the remainder.... Show this thread", "2019-12-13T15:22:33.000Z": "Proud of our Mississippi Guard and our friendship with Uzbekistan. A great rising Republic in Central Asia. Quote Tweet MS National Guard @nationalguardMS The 2020 Mississippi National Guard Best Warrior Competition kicked off with an obstacle course and rappel event!\n\nThis year, Mississippi Army and Air Guardsmen were joined by Soldiers from the Armed Forces of the Republic of Uzbekistan.", "2019-12-13T00:19:07.000Z": "Now, Britain will be made great again. NOW we can get Brexit done! Jubilant Leavers celebrate exit poll Brexit has dominated this year's election with the phrase 'Let's get Brexit Done' becoming Boris Johnson's mantra and the exit poll confirms the Tory's are set for a large majority. apple.news", "2019-12-12T17:54:16.000Z": "Great day at the @WhiteHouse today. @realDonaldTrump and his administration are doing great things for our country. @RepDanCrenshaw  @SecAzar  @IvankaTrump", "2019-12-12T14:53:24.000Z": "Thank you @IvankaTrump for leading this charge and for inviting me to speak at the White House Summit on Child Care and Paid Leave with @GovParsonMO . @WhiteHouse", "2019-12-12T14:00:53.000Z": "Livestream as I participate in a @WhiteHouse panel discussion with @GovParsonMO at the Child Care and Paid Leave Summit. https:// youtu.be/MtKwhaRBWOg", "2019-12-12T00:08:02.000Z": "I had a great time signing books at @LemuriaBooks today. There are signed copies of \"THE MISSISSIPPI GOVERNOR'S MANSION: MEMORIES OF THE PEOPLE'S HOME\" available for purchase.", "2019-12-11T21:43:34.000Z": "Join me today at @LemuriaBooks from 4-6 p.m. I look forward to signing \"THE MISSISSIPPI GOVERNOR'S MANSION: MEMORIES OF THE PEOPLE'S HOME\" Quote Tweet Univ Press of MS @upmiss Governor Phil Bryant will sign THE MISSISSIPPI GOVERNOR'S MANSION: MEMORIES OF THE PEOPLE'S HOME at Lemuria Books on Wednesday, December 11, from 4-6 p.m. @LemuriaBooks  @PhilBryantMS  #ReadUP", "2019-12-11T02:51:07.000Z": "Revenue collection numbers are $31.1 million over estimates for November, bringing the YTD sum to $135.5 million for this fiscal year. Another great month for Mississippi. FY 2020 total revenue collections are up over 7 percent for November Total revenue collections for the month of November FY 2020 are $31,093,431 or 7.76% above the sine die revenue estimate. Fiscal YTD revenue collections through November are $135,495,970 or 6.34%... yallpolitics.com", "2019-12-10T22:24:18.000Z": "This will be great for Mississippi and great for the nation. Thanks to @realDonaldTrump and his dedication to America First. Revised Trade Pact Set for Likely Approval by Congress in 2020 A new U.S. trade deal with Mexico and Canada gained backing from House Democrats, setting it on course for likely ratification by Congress in 2020 and marking a victory for President Trump after... wsj.com", "2019-12-10T21:29:38.000Z": "possible and thereby reducing the number of children in care by nearly 2000. At the same time, CPS more than doubled the annual number of adoptions. I appreciate Justice Dickinson's many years of dedicated public service and wish him the best in his retirement. 2/2", "2019-12-10T21:29:20.000Z": "I commend Justice Jess Dickinson for his two & a half years of service as Commissioner of the Mississippi Department of Child Protective Services. Under his leadership, CPS has made significant improvements like implementing measures to keep the family intact whenever safely 1/2", "2019-12-10T16:46:10.000Z": "The facility is a 30 bed transitional care center for chronically ill children that provides inpatient & outpatient services. The center will offer a home-like treatment facility for the medically fragile children who are now living at @childrensofms .", "2019-12-10T16:44:05.000Z": "Great to break ground on the Mississippi Center for Medically Fragile Children. This facility will be the first of its kind in MS. I am very proud of Deborah and her work in making this home a possibility. She has spent countless hours loving and serving the children of MS.", "2019-12-10T14:57:14.000Z": "On this date, 202 years ago, our great state was founded. Through both good and difficult times, I believe it continues to be the most wonderful state in this great nation because of it people-Hospitable, kind and sharing people are the soul of the Great State of Mississippi.", "2019-12-08T17:43:59.000Z": "Congratulations to the 2019 SWAC Champions Alcorn State University. #BowlBound  @AlcornStateU Quote Tweet Alcorn State @AlcornStateU 2019 SWAC CHAMPIONS #NoDistractions | #BowlBound", "2019-12-07T17:38:41.000Z": "Deborah with the grands on the steps of the People's Mansion.  It has truly been a wonderful time for our family and we will always treasure the experience.", "2019-12-07T13:30:00.000Z": "Today we remember the brave men and women who made the ultimate sacrifice defending our nation in the face of tragedy. May December 7th continue to be a defining moment in our nation's history. #PearlHarbor78", "2019-12-06T21:59:22.000Z": "Thank you @realDonaldTrump for approving this request. Quote Tweet msema @MSEMA Gov. Phil Bryant announced that Pres. Trump declared 16 counties as federal disaster areas following TS Olga. Those counties:\nAlcorn, Covington, Itawamba, Jasper, Jefferson Davis, Leake, Lee, Marion, Neshoba, Newton, Pontotoc, Prentiss, Scott, Simpson, Smith and Tippah Show this thread", "2019-12-06T17:40:48.000Z": "Thank you to Ron Wanek, Chairman and Founder of Ashley Furniture for being a champion of industry in America. His vision has made @InsideAFI a success in Mississippi as the company celebrates 75 years of business. #MSWorks  @mdaworks", "2019-12-06T17:25:15.000Z": "Great to be in Ecru as Ashley Furniture announces it is expanding operations at its stationary upholstery manufacturing and regional distribution center. The project is a $25.05-million corporate investment and will create 100 jobs. This is the @InsideAFI", "2019-12-06T15:34:10.000Z": "Thanks to our entire delegation. I believe the President has heard our request and will be issuing a Federal Disaster Declaration today. Quote Tweet Senator Roger Wicker @SenatorWicker Today the entire Mississippi congressional delegation sent a letter supporting @PhilBryantMS 's request for a federal disaster declaration to help our state recover from straight-line winds and flooding in October. https:// wicker.senate.gov/public/index.c fm/2019/12/miss-delegation-requests-federal-disaster-declaration-for-october-storm-damage ", "2019-12-06T14:13:15.000Z": "Great article regarding students in Mississippi and how they are leading the nation in reading progress. Opinion | There Is a Right Way to Teach Reading, and Mississippi Knows It The state's reliance on cognitive science explains why. nytimes.com", "2019-12-06T13:38:07.000Z": "Congratulations to @MGCCC on winning the 2019 NJCAA Football National Championship. #perfectseason Quote Tweet NJCAA Football @NJCAAFootball A late surge from Mississippi Gulf Coast powered the Bulldogs to a fifth national championship with a 24-13 win in the 2019 NJCAA @eTeamSponsor Football Championship! #NJCAAFootball | #NJCAAonCBS  https:// njcaa.org/sports/fball/2 019-20/national_championship/championship_recap ", "2019-12-05T23:49:18.000Z": "I have signed an executive order to lower the flags in honor of Nielsen Harris Cochran who passed away. The flags shall be lowered beginning at sunrise and ending sunset Friday.", "2019-12-05T22:33:47.000Z": "Great day touring @msstate 's High Performance Computing Collaboratory with President Mark Keenum along with other MSU administrators and faculty. On the tour I got to see Orion, a supercomputer capable of more than 5 quadrillion calculations per second.", "2019-12-05T19:43:33.000Z": "Mississippi has over 50,000 job openings and will spend millions on workforce programs to help achieve self-sufficiency for all able-bodied adults without dependents. MDHS says new Trump Administration SNAP rules won't affect Mississippi The MS Department of Human Services was quick to react to new rules from the Trump Administration regarding SNAP eligibility for \"able-bodied adult without dependents\" beneficiaries.  MDHS clarifies... yallpolitics.com", "2019-12-05T16:06:04.000Z": "Great day at Pearl River C.C. Hancock. The students trained at this facility will be the future for the workforce in aerospace at Stennis, NASA and beyond. Phil Bryant Aviation and Aerospace Academy groundbreaking This video is about the Phil Bryant Aviation and Aerospace Academy groundbreaking ceremony held at the future site of PRCC's Hancock Center in Hancock County. youtube.com", "2019-12-05T14:09:35.000Z": "Mississippi now is leading the way. We have more work ahead but our students can achieve with great teachers and parents who have made it all possible. Mississippi more than a year ahead of Alaska in fourth grade reading The good news is that there's no need to adopt radical or unproven solutions. adn.com", "2019-12-04T15:48:11.000Z": "Dean Kirby is one of the finest public servants in our state.  He will make a great Senate Pro-Tem. Dean Kirby will be next Senate Pro-Tem Y'all Politics has confirmed that State Senator Dean Kirby of Pearl will be the next Senate Pro-Tem.  His selection is still subject to an official vote of the Senate membership that will be seated... yallpolitics.com", "2019-12-03T22:49:34.000Z": "Great to tour @relativityspace today at @NASAStennis . Their facility is designing, building and testing 3D printing autonomous rockets. They are helping the space industry thrive in @HancockCountyMS .", "2019-12-03T20:38:09.000Z": "I thank the company for choosing to grow in @HancockCountyMS and for creating dozens of new high-tech jobs for the people of the Mississippi Gulf Coast.", "2019-12-03T20:37:41.000Z": "Global security and aerospace company @LockheedMartin is expanding its operations at NASA's Stennis Space Center in Hancock County. The project is a $20.9-million corporate investment and will create 30 jobs. #MSWorks", "2019-12-03T18:29:37.000Z": "The students trained at this new facility at Stennis will graduate with the skills they need to be successful and contribute to our state's economic growth. I am honored to have this facility named after me. @PRCC_Wildcats  @HancockCountyMS", "2019-12-03T18:28:30.000Z": "The new Phil Bryant Aviation and Aerospace Workforce Academy at the Stennis International Airport will be a modern facility providing educational opportunities in academic, career technical, and workforce programs.", "2019-12-03T14:58:13.000Z": "Deborah and I will be making a donation on this special day of giving to the Center for Medically Fragile Children soon to be built in our capitol city. If you would like to share please see the link below to make your contribution. #GivingTuesday Mississippi Center for Medically Fragile Children The Mississippi Center for Medically Fragile Children is a nonprofit organization based in Jackson, Mississippi. Its mission is to provide the first pediatric skilled nursing facility in the state of... msfragilechildren.org", "2019-12-02T19:23:41.000Z": "Deborah and I are saddened to hear of the passing of Nielsen Cochran.  He served on the Jackson City Council and later as Public Service Commissioner.  We pray the Good Lord will help assuage the pain of this loss to his wonderful wife Connie and all who loved Nielsen.", "2019-12-02T17:46:24.000Z": "Thanks @SenatorWicker for you Leadership on Mississippi's Space Initiative. More exciting announcements will be made tomorrow at @NASAStennis . Wicker Advocates for New Facility at Stennis The Path to Space Goes Through Mississippi wicker.senate.gov", "2019-12-02T13:09:16.000Z": "Tune in now and listen to the @paulgalloshow . Quote Tweet Paul Gallo @paulgalloshow A very special GalloShow tomorrow morning. The official \"Exit Interview\" with Gov Phil Bryant. Join us at 7:05 am on the @Supertalk Network. @supertalk  @realDonaldTrump  @PhilBryantMS  @PhilipGunnMS  @tatereeves", "2019-12-01T13:00:00.000Z": "What a wonderful day of praise and thanksgiving.", "2019-11-30T20:11:02.000Z": "Greg is a Small Business owner with a mission to build the finest rocking chairs in the world.  I am proud to own one of his chairs and proud of this amazing craftsman on Small Business Saturday. Mississippi chair-maker builds sixth chair for a U.S. president You enter an area where quality, craftsmanship, and pride are still taken seriously, and it shows through his work. wlox.com", "2019-11-30T15:40:32.000Z": "Please be weather aware today. Have a family plan to be in a safe area and be extremely careful when driving. Quote Tweet msema @MSEMA The National Weather Service is expecting another round of severe weather across the state on Saturday. Damaging winds gusts are the main threats with the possibility of tornadoes and hail.\nThe timeframe for the severe weather threat is Saturday from 2PM to 3AM Sunday. Show this thread", "2019-11-29T22:51:45.000Z": ". @GovKemp will make the right decision. I had a similar opportunity and appointed a great Conservative woman U.S. Senator who has voted with President Trump 100% of the time. Quote Tweet Candice Broce @candicebroce . @RepMattGaetz : For a \"Constitutional conservative,\" you're oddly submissive to #TheSwamp . @GovKemp runs the Peach State. This appointment is his alone. You should focus on Florida and study federalism - because I question your \"judgement.\" twitter.com/mattgaetz/stat", "2019-11-29T16:36:21.000Z": "My youngest Grandson Phillip is enjoying a beautiful day at the Farm.  So much to be thankful for yesterday, today and tomorrow.", "2019-11-28T23:00:01.000Z": "Good luck to Mississippi State and Ole Miss as they face off in the 2019 Egg Bowl. These two schools first met in 1901 to play this rivalry game. Can't wait to see who takes home the Golden Egg. #HailState  #HottyToddy  #MississippiProud  #EggBowl  @HailStateFB  @OleMissFB", "2019-11-28T13:30:00.000Z": "Happy Thanksgiving from our family to yours. I hope this day is full of family, friends and food. May we be thankful and remember blessings from this past year and cherish new blessings to come. #Thanksgiving2019", "2019-11-27T14:00:41.000Z": "Working with @MSEMA Director this morning on response to this storm. We were blessed not to have injuries-still a difficult time for these families. Quote Tweet msema @MSEMA SEVERE WEATHER UPDATE: Rankin County officials tracking 8-10 homes that have been damaged from overnight storms. There are 13 roads with heavy debris. NO INJURIES TO REPORT.", "2019-11-27T01:44:56.000Z": "Please be weather aware and follow @MSEMA and @NWSJacksonMS for updates. Quote Tweet msema @MSEMA TORNADO WARNING FOR NORTHWESTERN HOLMES COUNTY, HUMPHREYS COUNTY, AND NORTHEASTERN SHARKEY COUNTY UNTIL 8:15 P.M.", "2019-11-26T22:43:36.000Z": "The grand tree is up in the Mansion.  Christmas is on its way. Candlelight tour is Dec. 6th begins at 5pm.", "2019-11-26T18:00:21.000Z": "Great job Mississippi. We are leading the way in international trade. Quote Tweet MS Dev. Authority @mdaworks The world wants what Mississippi has to offer: Latest Free Trade Zones report ranks Mississippi 8th in U.S production and 11th in U.S. Exports. #MSWorks", "2019-11-26T14:48:20.000Z": "Please remain weather wise today as the threat of tornadoes will exist throughout much of the day. Quote Tweet msema @MSEMA For most of the state this afternoon and into the overnight hours, there is a possibility for tornadoes and damaging winds. Be on the lookout for watches and warnings and to know where your safe place is in case you are impacted by severe weather.", "2019-11-25T23:49:20.000Z": "In the past 12 hours, the @TheMSLottery has taken in over $500k in funds to be used for repairs to our state's roads and bridges. Please remember to play responsibly.", "2019-11-25T22:18:18.000Z": "Mr. Williams passed from this earth on Sunday, Nov. 24th, 2019. He will be buried with honors on Wednesday but will be forever remembered for his service by a grateful nation.", "2019-11-25T20:53:01.000Z": "My granddaughter Eliza enjoyed our Sunday afternoon movie with her Grandmother and me. Frozen II was very cool.", "2019-11-25T13:58:24.000Z": "Today is the day Mississippi! You can buy lottery tickets at a certified retailer near you. Please play responsibly. #playmsyall  #themslottery Quote Tweet themslottery @TheMSLottery Have fun y'all! Today is the day! Tag us in the pictures of your first ticket purchase! #havefunyall  #dontmsyourchance  #playmsyall  #themslottery  #playresponsibly", "2019-11-24T17:27:41.000Z": "Good job by @SenatorWicker on MTP.  Injustice to the President is injustice to America. We the people will have our say in 2020. Quote Tweet Meet the Press @MeetThePress WATCH: On the open impeachment hearings, @SenatorWicker says he thinks \"the Democrats had a bad week last week.\" #MTP  #IfItsSunday \"I just think the people out there don't think this investigation is fair.\"", "2019-11-23T20:50:14.000Z": "ICYMI: Mississippi students led the nation in educational progress on the nations report card. Mississippi ranks No. 1 for score gains on National Assessment of Educational Progress TUPELO  Mississippi ranked No. 1 in the nation for score gains in reading and mathematics on the National Assessment of Educational Progress (NAEP), also known as the Nation's Report djournal.com", "2019-11-23T14:57:44.000Z": "Great job by all at @amazon and thanks for investing in Mississippi. #1350jobs  #MSWorks Quote Tweet Jeff Bezos @JeffBezos Nice! Amazon ranked #1 best managed company. Definitely the result of strong teamwork from people who care deeply and passionately about customers, their fellow employees, and the environment. Huge thank you and kudos to all Amazonians. twitter.com/WSJ/status/119", "2019-11-23T00:31:17.000Z": "Proud of the job Chris Freeze and his team are doing to help the people who need help in Mississippi. Quote Tweet MDHS @MS_DHS Tune in tonight to @WLBT at 10:00 pm to learn more about My Resources. We also wanted to say a big thank you to @MaggieWade for visiting us today. #resources  #onestopguide  #mississippi  #bettermebettermississippi  #wlbt", "2019-11-22T22:59:53.000Z": "Amen Brother Graham. We should all ask God's grace and guidance for our President and for those who have hate in their heart for him. This Nation must come together. Franklin Graham calls on nation to pray for Trump as impeachment conti Evangelist Franklin Graham is asking the nation to pray for President Trump as the impeachment inquiry continues, accompanied by nonstop media coverage. washingtontimes.com", "2019-11-22T21:38:38.000Z": "More good news for Mississippi's Economy. Mississippi suburbs' growth continues as railroad certifies industrial land at Holly Springs Fort Worth railroad cites 1,200-acre Holly Springs industrial park ready for development near Memphis. commercialappeal.com", "2019-11-22T19:05:20.000Z": "Great to be at the Delta Council Mid Year Board of Directors meeting today. It has been an honor to work with the awesome people of the Mississippi Delta. @MSDeltaStrong", "2019-11-22T15:35:15.000Z": "Just adopted revised budget of nearly $6 billion dollars. Revenue for the state is at a historic all time high.", "2019-11-22T13:07:57.000Z": "Deborah and I are saddened to hear of the loss of Caitlin.  Today she walks the streets of glory and we remain to continue her battle against breast cancer. Caitlin Sollie Powell, daughter of Lauderdale County sheriff, remembered as caring, generous In the final days of her life, Caitlin Sollie Powell wanted to make something clear - she would never give up fighting cancer and if she died, it was not meridianstar.com", "2019-11-21T20:53:00.000Z": "Congratulations to Governor Reeves. He will lead Mississippi into a brighter future for us all. #togetherforward  @tatereeves Quote Tweet The RGA @The_RGA Mississippi Governor-elect @tatereeves addressed the RGA 2019 Annual Conference. Congratulations to America's newest Republican governor!", "2019-11-20T23:00:06.000Z": "This is great news Senator. #MSWorks Quote Tweet Sen. Brice Wiggins @bricewigginsMS Per @EconMs : employment above peak pre-recession levels", "2019-11-20T21:02:57.000Z": "Great work by Law Enforcement at all levels. Human Trafficking must be stopped. Thanks to the MS Legislature they now have the tools they need to win this war. Mississippi improves to an A for human trafficking laws Mississippi has improved its grade, rising from a D to an A in six years. clarionledger.com", "2019-11-20T19:05:41.000Z": "Amazing job by great MDA Team. Best year ever. @mdaworks Quote Tweet MS Dev. Authority @mdaworks Don't let anyone tell you Mississippi isn't winning. Our unbeatable workforce and growth-centered policies have helped create more than 6,300 new jobs and attract almost $1.1 billion in private capital investment in 2019. And we're not done yet! #MSWorks", "2019-11-20T16:06:56.000Z": "We have worked hard to help improve Schools in Mississippi.  We now also have over 80% Graduation rates. Great job by parents, teachers, and students. #educationworks Three out of four schools and 70% of districts rated 'C' or higher Nearly three quarters of schools and 70% of districts will be rated C or higher when the Mississippi State Board of Education (SBE) approves accountability grades Thursday for the 2018-19 school... yallpolitics.com", "2019-11-19T16:28:57.000Z": "Great to speak this morning at the Graphene Innovation and Research Conference happening here in Jackson. Mississippi is on the leading edge of research and commercialization of this \"material of the future.\" @NGAgraphene", "2019-11-19T14:36:39.000Z": "The @MS_aquarium will become a worldwide destination for tourists, researchers and students. It is one of the achievements I am very proud to have broken ground on during my term as Governor. #BlueEconomy Quote Tweet Mississippi Aquarium @MS_aquarium #MondayMotivation  #BuildingMSAQ  @RACContractors", "2019-11-19T01:05:39.000Z": "Tom Royals was a very good Attorney and fine man.  I knew him for many years but did not know he had passed. I am very Sorry for your loss Kate. Quote Tweet Larrison Campbell @thisislarrison If I may brag on @KRRoyals for a minute, a little know fact about her brilliant dad Tom, who passed away last week, is that in addition to the legal accolades on his resume, he produced the debut album of his friend Miller Williams' daughter @HappyWoman9  https:// google.com/amp/s/amp.clar ionledger.com/amp/83941954  Show this thread", "2019-11-18T14:01:12.000Z": "I'm proud to announce that @Amazon is locating its second Mississippi fulfillment center in Olive Branch. The company will create 500 new full-time jobs at the facility. This is a tremendous milestone for DeSoto County and our entire state.", "2019-11-17T15:03:36.000Z": "Wonderful time at the farm with all the Grands. We have truly been blessed.", "2019-11-16T22:01:39.000Z": "Great job by @GlennMcCJr and his winning team at MDA. Two Gold and six Silver Shovels in the past eight years-Another record for our great state. #FinishStrong Quote Tweet Glenn McCullough Jr. @GlennMcCJr Progressive Pipeline locating their new Headquarters in Meridian on Thurs. was Mississippi's 47th Economic Development WIN in 2019.  Private Cap. investment from @mdaworks assisted projects = $978.2 M creating 5865 new Jobs  for Mississippians! #teamwork  #MSWorks  #finishstrong", "2019-11-16T21:20:51.000Z": "The deadline for\nassistance is approaching. We want to provide all the help we\ncan. Please apply before Tuesday. Deadline is Tuesday: Don't let misconceptions stop you from applying for FEMA aid - News Mississippi If you were affected by the severe storms, straight-line winds, tornadoes, and flooding which began in February, the last day to register for assistance through the Federal Emergency Management... newsms.fm", "2019-11-16T16:31:25.000Z": "Thanks Kaya. Big day for football in Mississippi. #upset Quote Tweet Kaya Jones @KayaJones Excited for the Ole Miss/ LSU game tomorrow", "2019-11-16T13:30:00.000Z": "Louisiana, get out and vote RED for my good friend @EddieRispone to be the next Governor of Louisiana! @The_RGA  #GeauxVote  #LAgov", "2019-11-15T19:08:28.000Z": "All revenue from the sale of the book will go to the Mansion Foundation to help maintain the grand ole house.", "2019-11-15T18:07:30.000Z": "You can purchase a copy of my book \"The Mississippi Governor's Mansion: Memories of the People's Home\" at https:// upress.state.ms.us/Books/T/The-Mi ssissippi-Governor-s-Mansion  or on @amazonbooks & @LemuriaBooks . The Mississippi Governor's Mansion Welcoming its first executive in 1842, the Mississippi Governor's Mansion is the second-oldest continuously occupied governor's residence in the United States. The Mansion is both a public building... upress.state.ms.us", "2019-11-15T18:06:45.000Z": "\"The Mississippi Governor's Mansion: Memories of the People's Home\" is now available for purchase. Artist Bill Wilson and I take you through the mansion with descriptive historical narrative and beautiful water color paintings. Read the book review here: The Mississippi Governor's Mansion: Memories of the People's Home by Governor Phil Bryant A review by Elizabeth Grey published on November 10, 2019 msbookspage.wordpress.com", "2019-11-15T16:01:27.000Z": "Great meeting this morning at the Uzbekistan Embassy in D.C with Ambassador @JavlonVakhabov .", "2019-11-15T13:20:09.000Z": "Time to Rise and Shine Mississippi. Rise. Shine. Project MFG is on a mission to build the United States Industrial Base of tomorrow. The first step in that process is to honor the men and women of yesteryear who vimeo.com", "2019-11-14T22:27:58.000Z": "Congratulations to the great Dwight Yoakam. I look forward to one day being back on the bus with this Country Music Legend. Quote Tweet Dwight Yoakam @DwightYoakam Dwight received the BMI President's Award for his profound influence on the music industry, joining an impressive list of past winners like Kenny Chesney, Harlan Howard, Brooks & Dunn, and more! Thank you @bmi for this outstanding distinction.\n\n- D Team #dwightyoakam  #bmi", "2019-11-14T21:19:58.000Z": "Dr. Smith served as Education Advisor in the Governor's Office and as Director of the State Workforce Investment Board before assuming the Directorship.", "2019-11-14T20:18:42.000Z": "Proud to attend the swearing in ceremony at the U.S. Department of Labor for Dr. Laurie Todd Smith who is the new Director of the Women's Bureau. It was great to support her today and to meet @USDOL Secretary @SecGeneScalia .", "2019-11-14T14:01:14.000Z": "Live now: The @USDOL 's National Summit on Women in Apprenticeship is starting. Watch it here  http:// dol.gov/live  #NAW2019", "2019-11-14T14:33:51.000Z": "SMTTT for the United States Military. Great job by a great University. Quote Tweet Southern Miss @SouthernMiss Did you hear? USM has received a No. 9 national ranking by Military Times in its Best for Vets: Colleges 2020 survey. SMTTT!", "2019-11-13T23:06:29.000Z": "Look forward to seeing the USS Thad Cochran constructed by the best ship builders in the world at Ingalls in Pascagoula, Mississippi. Hyde-Smith: U.S. Navy will name guided-missle destroyer for U.S. Senator Thad Cochran U.S. Senator Cindy Hyde-Smith (R-Miss.) today praised a decision by Navy Secretary Richard V. Spencer to name a future guided-missile destroyer after her predecessor, the late U.S. Senator Thad... yallpolitics.com", "2019-11-13T22:53:23.000Z": "Another bad day for the Democrat's circus. #sendintheclowns Quote Tweet Ronna McDaniel @GOPChairwoman First it was the Russia Hoax, now it's the Ukraine Hoax.\n\nAnd what are Democrats basing this sham on? HEARSAY.", "2019-11-13T21:25:56.000Z": "I have signed an executive order to lower the flags in honor of former Speaker of the Mississippi House of Representatives, William J. (Billy) McCoy, who passed away. The flags shall be lowered beginning at sunrise on Thursday and ending sunset Friday.", "2019-11-13T17:24:14.000Z": "I am humbled and honored with the naming of this amazing Wildlife Management Area. It will be dedicated, if not in name, in spirit to the Mississippi outdoorsmen and women who will forever enjoy it's beauty and harvest. Thank you @MDWFPonline . https:// mdwfp.com/media/news/wil dlife-hunting/phil-bryant-wma/ ", "2019-11-13T15:49:01.000Z": "The USMCA is a win for Mississippi and the Nation. It incorporates modern, strengthened, and rebalanced rules of trade and investment for North America. With USMCA, we will have more growth, more exports, more jobs, and rising wages. This is HUGE for America's economy. #USMCAnow", "2019-11-13T02:13:20.000Z": "Sorry to hear of the passing of former Speaker of the Mississippi House of Representatives Billy McCoy. Although we may have differed on issues we were always good friends. He will be missed. Tonight he walks the Streets of Glory.", "2019-11-12T22:53:59.000Z": "Military Family Spotlight: LTC Steve Jackson, MSARNG, pinned by his son Sgt. Jackson of the 155th ABCT and goddaughter SrA Sudberry, KAFB. An amazing military family. Thank you all for your service!", "2019-11-12T22:26:16.000Z": "Another good indicator of Mississippi's growing economy. Mississippi outpaces national average in GDP growth Mississippi's real gross domestic product outpaced the national and Southeastern average for the second quarter of 2019. Mississippi's GDP grew by 2.3 percent compared to the first quarter of the... mspolicy.org", "2019-11-12T18:33:29.000Z": "Great to be at the @Allegiant Air event today in Gulfport as we announced that starting Feb. 15th they will start twice weekly flights between Nashville International Airport and @FlyGPT , with fares as low as $55 one-way. @SeeCoastalMS", "2019-11-12T17:40:37.000Z": "Today I announced the 2019 RESTORE projects totaling $53.2 million. This round of funding will be used for 12 new projects and amend 4 existing projects and programs- all projects are centered around restoration of our beautiful MS Gulf Coast.", "2019-11-12T16:41:39.000Z": "This morning I had the honor of meeting Biloxi native and former NASA astronaut Fred Haise who flew on the Apollo 13 mission. He gave me a Mississippi Flag that was on the mission with him in 1970. Thank you Fred for what you've done for our state, @NASA , and the @Visit_INFINITY .", "2019-11-12T02:20:07.000Z": "It's an honor to be inducted in the @MississippiAMA Hall of Fame and given a lifetime membership to the association. Mississippi has made great strides in manufacturing over the last 8 years and I'm proud of all our automotive partners in the state.", "2019-11-11T14:31:30.000Z": "Saluting today all who serve or have served. We thank you for your sacrifice and devotion to our great nation. The Commander in Chief Salutes You Donald Trump is the master showman. An entertainer by nature and a natural on stage. He knows the power of timing.The rally audience hears speeches by local and statewide dignitaries townhall.com", "2019-11-11T17:43:00.000Z": "Mr. Loyd E Williams Of Pearl, MS is 96 years of age and a former POW.  He was born on August 17, 1923. He was captured on December 25, 1944 and he spent the next 7 months in captivity.  Let's remember our WWII Veterans and all POW-MIA this Veterans Day.", "2019-11-11T13:00:00.000Z": "Today we honor our Veterans-Thank you to all who have bravely served and continue to serve our country. Your commitment and sacrifice keep America strong, safe and free. #VeteransDay", "2019-11-10T22:46:10.000Z": "Great win by Southern Miss.  Let's go Bowling Quote Tweet Southern Miss FB @SouthernMissFB BIG WIN Bowl Eligible Defensive Shutout C-USA Win  #SMTTT", "2019-11-10T16:41:01.000Z": "Today we remember the Birth of the @USMC . Because they fight we are free. Semper Fi Marines.", "2019-11-10T14:16:04.000Z": "This Sunday morning let us all remember Willow in our prayers and all the families that struggle with challenges far beyond our ability to understand. Our God is one of wonders. Let us pray that we witness a blessed miracle for Willow and her dear family. Her daughter may die by age 10, but this mom keeps fighting to cure her rare disease Amber Olsen's daughter, Willow, is 6 years old and has lost all muscle control. goodmorningamerica.com", "2019-11-09T18:02:16.000Z": "Thanks @joenosef . It has been an amazing journey and Ocean Enterprise will move the Blue Economy, create jobs and help the Navy defend freedom here and across the seas. Quote Tweet Joe Nosef @joenosef The @PhilBryantMS administration began 8 years ago w/focus on @PortofGulfport & is continuing progress through finish line. Congrats to @JamieMillerMS & others who worked so hard getting this project going. Jonathan Daniels & port commission have done a great job. twitter.com/JamieMillerMS/", "2019-11-09T14:21:44.000Z": "Honored to have @ElaineChao back in Mississippi to campaign on behalf of President Trump in support of @EddieRispone to be the next Governor of Louisiana. MS and LA have to have a strong partnership and I'm glad to help turn Louisiana Red. @The_RGA  #LAGov", "2019-11-08T23:19:58.000Z": "Revenue collection numbers are once again exceeding estimates. Mississippi has had another great month. October revenue collections 5.18% above Sine Die estimates Total revenue collections for the month of October FY 2020 are $27,388,741 or 5.18% above the sine die revenue estimate. Fiscal YTD revenue collections through October are $104,402,539 or 6.02% above... yallpolitics.com", "2019-11-08T21:36:23.000Z": "Good decision by Administration at @OleMissRebels . Free speech is still a constitutional Guarantee even on College Campuses. Quote Tweet Yall Politics @MSyallpolitics The Journalism School at @OleMissRebels uninvited @ElishaKrauss to speak on November 13.  The new administration quickly jumped in and overruled. https:// yallpolitics.com/2019/11/07/ole -miss-journalism-school-cancels-conservative-speaker-but-administration-overrules-and-invites-speaker-back/  Show this thread", "2019-11-08T20:15:55.000Z": "The facility will be named \"Roger F. Wicker Center for Ocean Enterprise\" after @SenatorWicker who sponsored the legislation. This is a well deserved recognition for my friend and colleague.", "2019-11-08T20:15:03.000Z": "Ocean Enterprise is the culmination of work by the Governor's Ocean Task Force, our congressional delegation as well as our academic and state partners. We are excited to break ground on this facility. @SouthernMiss", "2019-11-08T20:14:25.000Z": "Great to attend the Ocean Enterprise groundbreaking ceremony for the new facility that will serve as a hub for research and innovation that will bolster our Blue Economy & help in the protection of our country for decades to come. @SenatorWicker  @CongPalazzo  @NOAA  @PortofGulfport", "2019-11-08T17:04:12.000Z": "Honored to attend the graduation ceremony for the Air Force Radio Frequency Transmission Systems Course this morning at @81trwKeeslerAFB . I'm extremely proud of the 338th Training Squadron Dark Knights and all the incredible men and women at Keesler.", "2019-11-07T21:05:01.000Z": "Great to be at the Port of Pascagoula groundbreaking for Enviva's new terminal. Once completed the terminal will export wood pellets produced in the George County Facility and other Enviva plants to markets in Asia and Europe.", "2019-11-07T17:54:56.000Z": "At the age of 14, Jack H. Lucas lied about his age in order to serve in World War II. He became the youngest Marine and service member in World War II to receive the Medal of Honor for his heroism.", "2019-11-07T17:54:09.000Z": "I was honored to attend the official keel laying ceremony for the U.S. Navy's future Arleigh Burke-class guided missile destroyer, the Jack H. Lucas (DDG 125). The ship is the 35th Arleigh Burke-class destroyer built by Ingalls and the first Flight III ship.", "2019-11-07T16:01:02.000Z": "Leading auto parts retailer O'Reilly Auto Parts is locating a distribution center in Horn Lake. The project will create 380 jobs. #MSWorks", "2019-11-07T03:48:41.000Z": "Thanks Kellyanne. @LynnFitch will be a great A.G. for Mississippi. President Trump being here last week made all the difference. Quote Tweet Kellyanne Conway @KellyannePolls Congratulations to history-making @LynnFitchforMS and #Mississippi ! twitter.com/thehill/status", "2019-11-06T23:13:39.000Z": "Great work by our U.S. Senators on the LIFTS Act. We are ready to reach for the stars. Wicker, Hyde-Smith Introduce the LIFTS Act Legislation Would Establish a Facility at Stennis Space Center to Modernize Commercial Space Licensing Training wicker.senate.gov", "2019-11-06T22:39:19.000Z": "Thank you to the Mississippi Poultry Association and their members who donated to this cause.", "2019-11-06T22:36:26.000Z": "For the past 8 years, I've partnered with MS Poultry Association to donate truckloads of chickens and eggs to the Salvation Army to feed the hungry.  This year's donation set a new record of 534,608 servings of protein- that's 63,452 pounds of meat and 280,000 eggs.", "2019-11-06T18:46:05.000Z": ". @FirstLady_MS and I stopped by the Pathway2Possibilites interactive career expo today in Jackson. I was proud to see so many student engaging and learning about opportunities right here in MS. Quote Tweet SWIB @SWIB_MS Governor Bryant is here at P2P!", "2019-11-06T16:00:59.000Z": "Yesterday was a great night for Republicans-we won it all! Mississippi showed out and Republicans swept the statewide elected positions. Congratulations to each of our candidates on your well deserved wins. I know you will make the State of Mississippi proud.", "2019-11-06T05:02:32.000Z": "Congratulations to my friend and the 65th Governor of the State of Mississippi @tatereeves ! He will do a great job leading the people of Mississippi and I couldn't be more proud to pass this title on to our Lt. Governor.", "2019-11-05T23:19:15.000Z": "Polls are open until 7 PM. Let's send the Washington liberals a message. Here in Mississippi we are conservatives and we aren't tired of winning yet. #VoteRED Quote Tweet Mississippi GOP @MSGOP Jim Hood's silence is deafening.  You can't have your cake and eat it too.  Jim should, at the very least, have some respect for a former President who endorsed him. You're either for Barack Obama or against him. Can't have it both ways, Jim. #Dontbehoodwinked", "2019-11-05T17:06:32.000Z": "Honored to cast my vote for @tatereeves to be the 65th Governor of the great state of Mississippi along with the other republican candidates running for statewide and local offices. Please go out and do the same. #VoteRED  #TeamTate", "2019-11-05T13:00:00.000Z": "It's Election Day! Get out and vote. The polls are open from 7:00 a.m- 7:00 p.m #MSgov  #VoteRED  #TeamTate", "2019-11-05T02:18:50.000Z": "At the 11th hour Jim Hood had Barack Obama endorse him for Governor of Mississippi. Now we finally know what he really believes. Vote Republican tomorrow and end this once and for all. @MSGOP  #MAGA . Last minute \"hail mary\" robocall by Barack Obama for Jim Hood Monday evening, robocalls with the voice of former President Barack Obama began circulating in Mississippi. The calls encourage Mississippians to vote for Jim Hood on Tuesday, November 5 in the... yallpolitics.com", "2019-11-05T00:57:48.000Z": "Always good to see you @peggy_grande . #RonaldReagan Quote Tweet Peggy Grande @peggy_grande Exciting to be the guest of Governor @PhilBryantMS for a rally in Tupelo, MS. Wonderful to see the enthusiastic crowd of 10k in support of #Trump2020 .", "2019-11-04T23:56:58.000Z": "Tomorrow is Election Day. Everyone be sure to exercise your right and privilege to vote. \"The right to vote is the crown jewel of American liberties, and we will not see its luster diminished.\" -Ronald Reagan", "2019-11-04T20:25:59.000Z": "Thank you @VP Pence for your kind words at the Rally today. We've worked hard in Mississippi over the last eight years and have made gains in education, job creation, and economic development. Let's continue the momentum by electing @tatereeves tomorrow, Nov. 5th!", "2019-11-04T17:27:02.000Z": "Welcome back to Mississippi Mr. Vice President! @VP", "2019-11-04T17:08:16.000Z": "Conservative policies are working, and Mississippi is continuing to reap the benefits of welfare reform. After implementation of food stamp work requirements we have seen significant improvements. See the key findings below & follow the link to learn more. https:// thefga.org/research/missi ssippi-food-stamps-work-requirement/ ", "2019-11-04T15:36:26.000Z": "Both @RogerWicker and @cindyhydesmith were appointed by Republican Governors. The Governor's power to appoint US Senators is nothing to take lightly. We need a Republican Governor to ensure we have conservative lawmakers.", "2019-11-04T00:21:56.000Z": "Looking forward to having @VP Mike Pence on the MS Gulf Coast tomorrow for a rally to support @tatereeves . Don't forget to get your tickets. Mississippi Victory Rally eventbrite.com", "2019-11-03T20:39:56.000Z": "And all God's people said Amen. https:// twitter.com/Education4Libs /status/1191023314917117953  This Tweet is unavailable.", "null": "", "2019-11-03T18:43:38.000Z": "This is what fighting back looks like. #IStandWithPresidentTrump  @MSGOP", "2019-11-03T01:00:02.000Z": "Don't forget that Daylight Savings goes into effect early tomorrow morning. Set your clocks. #DaylightSavings", "2019-11-02T19:52:31.000Z": "One of the Dem's biggest names in MS says the 10k+ patriots who showed up for @realDonaldTrump 's rally last night are Nazis. That's what they think of you, conservatives.  Let's send them a clear message and elect @GOP nominees from constable to Governor. @GOPChairwoman  #maga", "2019-11-02T18:29:36.000Z": "Last night I met an American Hero in Staff Sgt. Roy Hodges of Dumas, MS.  He flew 34 combat missions as a gunner on a B-24 Liberator over Europe in WWII and is 95 years old.", "2019-11-02T18:28:01.000Z": "One of Jim Hood's biggest trial lawyer supporters called the President's visit to Tupelo a Nuremberg Rally. That should tell you all you need to know about Democrats and why you must elect Tate Reeves as Governor.", "2019-11-02T14:27:27.000Z": "My great honor to speak at the Keep America Great Rally. On Tuesday we will elect @tatereeves and all our Republican Candidates. #MAGA", "2019-11-01T22:57:34.000Z": "#WATCH : Mississippi Governor Phil Bryant @PhilBryantMS delivers EXPLOSIVE remarks at President @realDonaldTrump 's rally in Tupelo, MS! #TrumpRally Mississippi Governor PHIL BRYANT Speaks at Trump Rally in Tupelo, MS #WATCH as Mississippi Governor Phil Bryant delivers EXPLOSIVE remarks before President Trump takes the stage at his rally in Tupelo, MS! Subscribe to RSBN ... youtube.com", "2019-11-01T23:14:37.000Z": "", "2019-11-01T23:12:32.000Z": "Great to speak at the rally in Tupelo as we welcome @realdonaldtrump back to our state! Mississippi is ready to turn out in large numbers on Tuesday to vote Republican and elect @tatereeves as our next Governor. #VoteRED  @MSGOP", "2019-11-01T19:04:16.000Z": "Thanks @grantcallen . One of the reasons our 4th graders are leading the nation in reading improvements. Quote Tweet Grant Callen @grantcallen A picture worth a thousand words. Under current leadership of @PhilBryantMS  @tatereeves and @PhilipGunnMS per pupil spending up dramatically.", "2019-11-01T17:00:02.000Z": "We stopped by Trader's Inn Restaurant in Ripley, MS. Mississippians are excited to go to the polls on Tuesday and vote Republican! @MSGOP  #VoteRED", "2019-11-01T15:53:39.000Z": "Great to be on the campaign trail in New Albany this morning with @CommAndyGipson , @DavidMcRaeMS , and @LucienSmith . Thank you @MSGOP . Be sure to get out and vote Republican Tuesday, Nov. 5th!", "2019-11-01T14:24:13.000Z": "Mississippi is ready to welcome @realDonaldTrump to Tupelo this evening. The line outside @BCSArena is getting longer and longer by the minute.", "2019-10-31T23:13:00.000Z": "Grands and kids enjoying Halloween! I hope everyone has a fun, safe night trick-or-treating with their family and friends.", "2019-10-31T22:56:16.000Z": "I agree with Franklin. This is how Democrats play the game in Washington. Republicans need to fight and take back the House. Pelosi has helped elect many Republicans and she can do it again. Quote Tweet Franklin Graham @Franklin_Graham This is a sad day for America. Our politics in this country has hit a new low. @SpeakerPelosi and her followers in Congress have weaponized the impeachment process. This is just another attempt to tarnish and embarrass @POTUS  @realDonaldTrump before the next election. 1/2", "2019-10-31T20:36:33.000Z": "Unemployment payments have dropped nearly 70% since 2011 saving $150M, which we have used to lower premiums on business and pay for workforce training. #MSWorks Quote Tweet Mississippi Department of Employment Security @MDESMS Good news!  Since January 2012, Mississippi's unemployment insurance claims have dropped over 60% and unemployment insurance payments have dropped nearly 70%. #MSWORKS", "2019-10-31T19:31:39.000Z": "My granddaughter Eliza enjoyed a ride on a beautiful animal from Mississippi Horses in Madison. The horses are trained for young children and those with special needs. Great mission for wonderful kids.", "2019-10-31T17:38:35.000Z": "Great conversation with @FirstLady_MS at @MECstatechamber 's 18th Annual Hobnob Mississippi. It's been a honor to work with the business community in MS over the past eight years as Governor. #Hobnob2019", "2019-10-31T15:48:09.000Z": "President @realDonaldTrump knows there is only ONE conservative in the race for Mississippi governor-- @tatereeves . #LeadRight  #TeamTate", "2019-10-31T14:57:32.000Z": "Laura Jackson has done a remarkable job as Director of MDFA. Her steadfast service to the taxpayers of Mississippi will be missed.", "2019-10-31T14:02:50.000Z": "Laura Jackson, Executive Director of the Mississippi Department of Finance & Administration, will be retiring from state government after more than 30 years of service. She will be joining the administration at Mississippi College to serve as the Chief Financial Officer.", "2019-10-30T21:41:50.000Z": "Thanks @JebBush . Mississippi's students, teachers, and administrators have worked hard. Quote Tweet Jeb Bush @JebBush #Mississippi 's focus on accountability and hard work is succeeding. Congrats to students and teachers, Supt. Wright and @MissDeptEd , @tatereeves , @PhilBryantMS @SenGrayTollison, Rep. Bennett. #NAEP  https:// excelined.org/news/mississip pi-leading-nation-with-strong-student-centered-policies/ ", "2019-10-30T19:54:35.000Z": "During the grand opening event, the company also announced an expansion of its distribution operations - a $2.4-million corporate investment that will create as many as 50 additional jobs.", "2019-10-30T19:54:14.000Z": "Today I attended the grand opening of @CorelleBrands manufacturing and distribution operations in Marshall County. Announced in January, the initial project is a $27.7-million corporate investment over time that is expected to create as many as 400 jobs.", "2019-10-30T17:46:13.000Z": "Thanks @tatereeves for all your hard work with Speaker @PhilipGunnMS and all involved. You have helped make a difference for Mississippi children. Quote Tweet Tate Reeves @tatereeves BIG news in Mississippi. We are now the #1 state in the country for gains in fourth grade math and reading! Number one! This is an incredible success story! Reform works. Thank you to our teachers, parents, and especially students for showing what Mississippi can do.", "2019-10-30T16:44:35.000Z": "In 2013, we advocated a simple but profound K-12 reform: requiring greater reading achievement for rising 4th graders. Now, we see historic achievements in math and reading. I commend teachers, students, parents, @tatereeves , @PhilipGunnMS & the MS Legislature.", "2019-10-30T13:43:02.000Z": "Mississippi still has much work ahead but our students have made tremendous progress. 8th and 4th graders are leading the Nation in reading and math scores. Great work by students, parents, teachers and administrators. American students' performance lags on Nation's Report Card WASHINGTON (AP) - The latest Nation's Report Card is painting a dismal picture of math and reading achievement among American fourth and eighth graders despite a few bright spots. Students... apnews.com", "2019-10-29T22:09:48.000Z": "Jim, as you may remember, my office and @MDEQ worked for years to achieve the BP settlement while you were at your house in Houston. Please take my photo out of your commercial. https:// t.co/CmBPh4mr6c This Tweet is unavailable.", "2019-10-29T21:26:24.000Z": "Great to meet with @FDICgov Chairman Jelena McWilliams who spoke at the DBCF\nBank CEO Summit today in Madison. There are many emerging banking, financial and regulatory issues impacting Mississippi's financial institutions. We are proud to have her in Mississippi.", "2019-10-29T19:29:19.000Z": "Thank you for the kind recognition on behalf of our administration's strides in workforce and economic development.", "2019-10-29T19:28:09.000Z": "Today I attended the @SWIB_MS board meeting. I appreciate their hard work to help Mississippians find jobs and most recently their MS Works Magazine publication for students across the state.", "2019-10-29T15:58:15.000Z": "This is a $56 million project that will feature 100 single occupancy beds. The project will bring nearly 200 new jobs to the Coast.", "2019-10-29T15:57:52.000Z": "Proud to have broken ground today on the new MS State Veterans Home on the Mississippi Gulf Coast at @Tradition_MC . This home will serve as a place for veterans to live and receive quality care while acknowledging their service and sacrifice to the U.S. @MSVetAffairs", "2019-10-29T12:53:14.000Z": "Very proud of former @SWIB_MS Executive Director and my senior policy advisor Dr. Laurie Todd Smith. She will do a great job as Director of the Women's Bureau for @USDOL . https:// dol.gov/newsroom/relea ses/wb/wb20191028 ", "2019-10-28T21:32:19.000Z": "@MSEMA will continue working with counties to assist and assess damages.", "2019-10-28T21:31:49.000Z": "I was briefed today by @MSEMA about Tropical Storm Olga that impacted the state this weekend. Thank you to our counties and first responders who acted quickly. We are continuing to clean up debris and power companies are working hard to restore power in areas without.", "2019-10-28T20:44:07.000Z": "Such a tragic loss. Our deep sympathy and prayers go out to Jason's family and friends. Quote Tweet Melinda McGrath @McGrathMDOT On Saturday, we lost MDOT Maintenance Superintendent Jason Boyd in a tragic accident while he was clearing trees on Hwy 489 in Newton County. \n\nWe're asking everyone to keep the Boyd family in your thoughts and prayers during this difficult time. https:// bit.ly/2WiZv6O", "2019-10-28T14:52:40.000Z": "Looking forward to welcoming @VP Pence to Mississippi. Strong push to the finish for @tatereeves for Governor. VP Mike Pence to hold GOTV rally on 11/4 for Tate Reeves on the Coast Monday morning the Reeves campaign announced that Vice President Mike Pence will appear at a rally for the Gubernatorial Candidate on the Mississippi Gulf Coast. \"I am honored to host Vice President... yallpolitics.com", "2019-10-27T22:43:01.000Z": "Honored to have received this wonderful recognition from this Christian University. #GraduateDegree88 Quote Tweet Mississippi College @MissCollege Gov. Phil Bryant Selected Order of the Golden Arrow Award Recipient https:// bit.ly/2VHmHf1  @PhilBryantMS", "2019-10-27T20:23:25.000Z": "Publisher Fred Ryan was President Reagan's last Chief and a good man.  How can he let this go on at the Post? Quote Tweet Brit Hume @brithume The Washington Post has become unembarrass-able. twitter.com/yashar/status/", "2019-10-27T18:21:07.000Z": "Terrible tragedy. MDOT workers put their life on the line everyday to clear our roads after storms, protect our bridges from ice in the winter and repair our bridges and highways. We pray for those affected by this tragic event. Quote Tweet Clarion Ledger @clarionledger MDOT worker killed while clearing trees. He was working in Newton County. https:// bit.ly/2Jqt9Sy", "2019-10-27T14:12:45.000Z": "Great work by our Military, President @realDonaldTrump , and his team to bring the worlds most wanted terrorist to justice. Quote Tweet Team Trump (Text TRUMP to 88022) @TeamTrump BREAKING: President @realDonaldTrump confirms the leader of ISIS had been KILLED", "2019-10-26T20:53:35.000Z": "Looking forward to seeing the President in Tupelo on Friday Nov.1st. Will bring another Republican Victory to Mississippi Governor's Race. Quote Tweet Donald J. Trump @realDonaldTrump MISSISSIPPI! There is a VERY important election for Governor on November 5th. I need you to get out and VOTE for our Great Republican nominee, @TateReeves . Tate is Strong on Crime, tough on Illegal Immigration, and will protect your Second Amendment.... Show this thread", "2019-10-26T16:03:00.000Z": "Don't forget to take this to the polls with you. #protect2nd  #mselex", "2019-10-26T14:20:01.000Z": "Thank you Mr. President. DEA's Take Back Day educates about the disposal of any unwanted, unused or expired prescription medications in your home. Learn more here: https:// takebackday.dea.gov Quote Tweet Donald J. Trump @realDonaldTrump My Administration is fighting hard to end the Opioid Crisis. Join with us by disposing unused or expired prescription medications at over 4,000 locations across this great Country. Find a location TODAY from 10am-2pm at http:// TakeBackDay.DEA.gov . #TakeBackDay", "2019-10-26T13:26:50.000Z": "Thanks @RussLatino . We are proud of our work. Everyone is inspired to do even more. Quote Tweet Russ Latino @RussLatino Facts are stubborn things, so here are a few about education spending in Mississippi: total state support for K-12 education has increased by $330 million since @PhilBryantMS , @tatereeves & Philip Gunn took office. #mselex Show this thread", "2019-10-25T21:40:04.000Z": "The Mississippi Department of Finance and Administration made the transfer to the rainy day fund from the year end surplus. $205.08 million was transferred which brings the Reserve Fund to the statutory limit of $554.8 million. The most in Mississippi's history.", "2019-10-25T20:15:24.000Z": "Congratulations Mr. President. Well deserved. I was honored to work with you on the First Step Act. Quote Tweet Donald J. Trump @realDonaldTrump It was my great honor to deliver the keynote address at the 2019 Second Step Presidential Justice Forum hosted by the 20/20 Bipartisan Justice Center in South Carolina, and my true honor to receive the Bipartisan Justice Award, thank you! https:// pscp.tv/w/cINHzzFvTlFs TFJub1dwUXd8MU1ueG5FbmdhcW9KT99pFYaYe1C4ArvQ2DE-0gWmhGZ56k58_gydacO3TnKQ?t=1s ", "2019-10-25T20:01:25.000Z": "Let's stay weather aware and move to a safe room or to the center hallway of your home during tornado warnings. Quote Tweet msema @MSEMA TORNADO WARNING FOR NORTHEASTERN GEORGE COUNTY AND EASTERN GREENE COUNTY UNTIL 3:30 PM.", "2019-10-25T17:43:20.000Z": "Another great event for our Medical City at @Tradition_MC . This will serve our Veterans in their time of need. Thanks @MSVetAffairs . Quote Tweet MS Veterans Affairs @MSVetAffairs Governor Phil Bryant will be the keynote speaker at a groundbreaking for the new State Veterans Home at Tradition, Tuesday, October 29, 2019 at 10:00a.m. The event will be held outside Mississippi Gulf Coast https:// instagram.com/p/B4Cy237BnuA/ ?igshid=1eb6rrbhbti2c ", "2019-10-25T15:01:06.000Z": "Please be weather aware. Quote Tweet NWS Jackson MS @NWSJacksonMS A tornado watch has been issued for parts of Alabama and Mississippi until 4 PM CDT", "2019-10-25T13:15:59.000Z": "There they go again. Misleading letters and billboards are probably just the beginning for the Democrats. #dirtytricks  @MSGOP Quote Tweet Geoffrey Pender @GeoffPender Election misinformation: Letters falsely tell Mississippi voters they aren't registered https:// clarionledger.com/story/news/pol itics/2019/10/25/ms-election-letters-wrongly-tell-voters-they-arent-registered/4086607002/   #MSElex", "2019-10-24T23:42:43.000Z": "Great to join my friends @DonaldJTrumpJr , @kimguilfoyle and @tatereeves at the Longleaf Plantation in South Mississippi. We are all for Tate. #msgov", "2019-10-24T15:58:29.000Z": "Must read for all Republicans who think Medicaid expansion is a good idea. Lipstick and pigs: Medicaid reform and expansion Over the past year, a steady stream of op-eds have appeared in the Daily Leader and other media outlets promoting either Medicaid expansion or something called Medicaid reform. These terms are not... mspolicy.org", "2019-10-24T14:01:30.000Z": "Time to start your career right here in Mississippi. Good job by @SWIB_MS , Mississippi Community College Board, @MDESMS and all our sponsors. Quote Tweet SWIB @SWIB_MS Check out the new MS Works magazine at http:// msworksmagazine.com  #msworksmagazine  @MDESMS", "2019-10-23T21:55:30.000Z": "Today we cut the ribbon on the storm water outfalls on the MS Gulf Coast. These new water outfalls have dramatically improved the visual aesthetic along our beaches & I am proud to see the project come to fruition. I want everyone to come Catch a Wave on the coast. @SeeCoastalMS", "2019-10-23T20:30:05.000Z": "So proud of the best ship builders in the world. Quote Tweet U.S. Coast Guard @USCG Coast Guard Cutter Stone, a Legend-Class National Security Cutter currently under construction by Huntington Ingalls Industries Inc., recently transited across the shipyard to the dry dock, then launched. Stone is the 9th NSC built by Ingalls Shipbuilding. : @HIIndustries", "2019-10-23T19:59:49.000Z": "Thanks @CongPalazzo for telling it like it is. Quote Tweet Cong. Steven Palazzo @CongPalazzo House Democrats have abandoned legislating while they work to overturn a presidential election. House Republicans want to pass USMCA, secure our borders, lower prescription drugs, and do so much more, but are being stonewalled by Pelosi's partisan politics. #StoptheSchiffShow", "2019-10-23T18:59:49.000Z": "It was great to attend the grand opening of @NufarmUS operations in Greenville, MS. The project is a $20 million investment and will create 68 jobs. #MSWorks", "2019-10-23T16:45:01.000Z": "I would like to thank @demariodavis for donating all proceeds from his \"Man of God\" headband sales to @StDomHospital Emergency Department. @Saints  #ManofGod  #WhoDat Get yours here today : http:// bit.ly/56manofgod", "2019-10-23T14:09:55.000Z": "Congratulations to @MGCCC .  Best Nursing program in Mississippi. MGCCC Nursing Program ranked No. 1 in the State of Mississippi - WXXV 25 When it comes to training for quality health care, Mississippi Gulf Coast Community College ranks number one in the state for an Associate Degree in Nursing according to the nursing advocacy program... wxxv25.com", "2019-10-22T22:03:39.000Z": "Granddaughter leads the pledge in class today. Proud of her.", "2019-10-22T18:57:02.000Z": "Yesterday, I had a promising meeting with @EPA Region 4 Administrator Mary Walker. We must finish the pumps. Quote Tweet Senator Roger Wicker @SenatorWicker 1:59 Last night senior officials from the @EPA were in Rolling Fork to hear from Mississippians who were affected by this year's flooding in the Delta. I am working with EPA to complete important flood control infrastructure projects in our state. #FinishThePumps", "2019-10-22T17:31:48.000Z": "Thanks to @USAttyHurst we will protect our schools. DOJ grant to improve security in 3 Coast school districts - News Mississippi Three school districts on the Coast have received a portion of a national grant to improve security in schools.  Announced by U.S. Attorney Mike Hurst's Office, the Pearl River County, Long Beach and... newsms.fm", "2019-10-22T15:07:52.000Z": "Great interview this morning with JSU's Allyson Brown. Always great to work with people from the University.", "2019-10-21T22:40:54.000Z": "Like the President, Mississippi has increased economic opportunities and created jobs by cutting burdensome regulations and ensuring that occupational licensing promotes competition and encourages innovation.", "2019-10-21T22:40:19.000Z": "I am proud to support @realDonaldTrump and @VP in establishing the Governors' Initiative on Regulatory Innovation. Quote Tweet Vice President Mike Pence @VP Productive cabinet meeting today at the @WhiteHouse with President @realDonaldTrump . Since the start of our Administration, President @realDonaldTrump has led HISTORIC deregulation efforts resulting in more than 6 million new jobs, rising wages, and low unemployment!", "2019-10-21T16:11:44.000Z": "Great to attend @EnvivaBiomass groundbreaking ceremony for its new wood pellet mill in Lucedale. The project is a $140-million investment and is creating 90 jobs. The facility plans to produce upwards of 700,000 tons of wood pellets per year. #MSWorks", "2019-10-21T13:50:42.000Z": "Recycling and refuse equipment manufacturer New Way Trucks is opening operations in Booneville. The project is a $2.5-million corporate investment and will create 100 jobs. #MSWorks  @newwaytrucks", "2019-10-21T13:28:51.000Z": "Started the day on the @paulgalloshow this morning. Always enjoy straight talk with Paul. Listen here: https:// supertalk.fm/audio-archives /gallo-archives/?recording_id=31884 ", "2019-10-20T20:58:30.000Z": "Please be aware tomorrow as severe weather moves across our state. Follow @MSEMA and @NWSJacksonMS for updates. Quote Tweet msema @MSEMA Severe Weather Preparedness Week begins tomorrow. The National Weather Service is calling for severe storms Monday morning thru the evening hours. Damaging winds are the primary threat. However, the possibility of a tornado in your area cannot be ruled out. #mswx", "2019-10-20T15:36:10.000Z": "We are looking forward to having you back in Mississippi Mr. President. Get your tickets now! Quote Tweet Donald J. Trump @realDonaldTrump https:// donaldjtrump.com/events/ms-2019 -nov-tupelo/ ", "2019-10-19T19:24:59.000Z": "The unveiling today of @steveazar 's Country Music Trail Marker in Greenville. Well deserved for this great Mississippi artist. #onemississippi", "2019-10-19T16:38:31.000Z": "Thanks @KayaJones . So do we. #blessed Quote Tweet Kaya Jones @KayaJones Hello Mississippi so loving your state", "2019-10-19T15:11:52.000Z": "Enjoying the Scarecrow Car Show in Madison this morning with the Grands. Perfect morning.", "2019-10-18T21:24:39.000Z": "I am proud to be one of the honorary chairmen of the campaign to re-elect President @realDonaldTrump . Quote Tweet Lucien Smith @LucienSmith Sign up here to hear @realDonaldTrump as he campaigns for our next governor @tatereeves and @MSGOP candidates up and down the ballot! #mselex  #mspol  https:// donaldjtrump.com/events/ms-2019 -nov-tupelo ", "2019-10-18T20:40:20.000Z": "Just received a congratulatory call from @Mark_Shriver , CEO of @SavetheChildren . It was a great honor to receive the Champion for Children Award from this great organization. Chairman Richard Bennett was also recognized for his strong support of Mississippi's children.", "2019-10-18T19:40:05.000Z": "Mississippi now has over 55,000 job openings. We are working hard to put our people to work. Italy Borrows From Mississippi With a Program to Help the Poor Find Work The $7.7 billion project includes workers called navigators, who help with everything from résumé preparation to liaising with potential employers. bloomberg.com", "2019-10-18T16:10:43.000Z": "Dr. Micca Knox who serves as the lead for the state Early Child Academies has been appointed to serve as the Executive Director for the State Early Childhood Advisory Council. Congratulations Dr. Knox.", "2019-10-18T14:25:51.000Z": "Mississippi's Early Childhood State System, takes 3rd place competing nationally at Harvard Graduate School during the Saul Zaentz Innovation Challenge at @hgse . For more information visit: https:// zaentz.gse.harvard.edu/innovation-cha llenge/ ", "2019-10-17T22:18:16.000Z": "Great honor from @MissCollege . A great Christian University. Gov. Phil Bryant Selected Order of the Golden Arrow Award Recipient Gov. Phil Bryant earned kudos for his faithful leadership to spark economic development and enhance education during two terms as the state's chief executive. mc.edu", "2019-10-17T20:54:04.000Z": "As I always like to say, you can live the American Dream right here in Mississippi. Mississippi is the best place to live the \"American Dream,\" according to new research New research says Mississippi is the best place to live the American Dream, but there's a catch. wlox.com", "2019-10-17T19:55:27.000Z": "Great to attend the grand opening of @FastenalCompany 's new distribution center in Madison County. The project, which was announced in June 2018, is an $11.5-million corporate investment and will create 60 jobs over the next three years.", "2019-10-17T18:06:36.000Z": "Honored to have received the 2019 Champion for Children Award from @SavetheChildren . I appreciate the work of this organization in Mississippi and across the world.", "2019-10-17T15:06:25.000Z": "I have declared October as Domestic Violence Awareness Month. This month will provide an excellent opportunity for citizens to learn more about preventing domestic violence and to show support for the numerous organizations and individuals who provide assistance to victims.", "2019-10-17T12:59:23.000Z": "Great day for Hinds County and Mississippi. Continental Tire opens: 'Mississippi accomplished something remarkable,' governor says \"The rest of America is looking,\" Gov. Phil Bryant said. \"They're saying Mississippi accomplished something remarkable.\" clarionledger.com", "2019-10-16T20:58:09.000Z": "FEDERAL DECLARATION UPDATE: The incident period for the State's Individual Assistance Declaration has been amended. The new Incident Period is Feb. 22nd through Aug. 23rd for the following eight counties: Clay, Humphreys, Issaquena, Lowndes, Monroe, Sharkey, Warren and Yazoo", "2019-10-16T20:01:31.000Z": "It's been three years since we started this project. @continentaltire will provide 2,500 good paying jobs in Hinds County. A $1.45B private investment. #MSWorks", "2019-10-16T16:44:58.000Z": "This is a historic day in Mississippi. Congratulations to @continentaltire on the opening of this extraordinary, state-of-the-art plant. The entire state of Mississippi is truly proud to have this great company here. @mdaworks", "2019-10-16T13:31:35.000Z": "Big day today for Mississippi as @continentaltire opens its plant in Clinton. I am excited to attend the grand opening ceremony and I am heading there now.", "2019-10-16T12:49:44.000Z": "I recently had the chance to speak with @bizfacilities for their exclusive Governor's Report interview. Read the article below. https:// businessfacilities.com/2019/10/missis sippi-governor-bryant-making-world-take-notice/   #MSWorks Mississippi Governor's Report: Making The World Take Notice Gov. Phil Bryant shares how Mississippi is surging to the top with a skilled workforce that is setting new standards for success in advanced manufacturing. businessfacilities.com", "2019-10-15T22:18:11.000Z": "Good work by the @msjusticeinst . Freedom of speech is one of our most important rights and I stand in support of challenging the city's restriction of it. Quote Tweet Mississippi Center for Public Policy @mspolicy Today, @msjusticeinst announced a legal challenge to Jackson's ordinance limiting free speech around an abortion clinic.", "2019-10-15T19:46:51.000Z": "It was great to tour the @ABBNorthAmerica facility today in Senatobia, MS with Ambassador Ed McMullen, the US Ambassador to Switzerland and Liechtenstein. #MSWorks  @USEmbassyBern", "2019-10-15T18:24:50.000Z": "I couldn't agree more, Mr. President. @tatereeves is going to make a great Governor. Let's not forget his Democratic opponent voted for Hillary. Quote Tweet Donald J. Trump @realDonaldTrump Mississippi, there is a VERY important election for Governor on November 5th. I need you to Get Out and Vote for our Great Republican nominee, @TateReeves . Tate is strong on Crime, tough on Illegal Immigration, and will protect your Second Amendment.... Show this thread", "2019-10-15T14:53:36.000Z": "I would like to thank my friend @peggy_grande for coming to Mississippi for the @MSGOP event last night. I enjoyed hearing her speak about democracy, optimism, and her time working for President Ronald Reagan.", "2019-10-15T01:24:49.000Z": "It has been an honor. Quote Tweet Mississippi GOP @MSGOP Thank you, Governor @PhilBryantMS !", "2019-10-14T20:43:36.000Z": "I got my flu shot today, have you? I would like to encourage everyone, to get out and get your flu shot to protect yourself this flu season!", "2019-10-14T17:51:17.000Z": "I have lifted the statewide burn ban, effective immediately. Despite the lifting of the statewide burn ban, there are a number of counties that will remain under burn bans, enacted by the Board of Supervisors.", "2019-10-14T16:13:55.000Z": "Interesting article on election for Governor. @MSyallpolitics continues to provide great coverage and analysis. What does the Republican rout in Louisiana mean for the upcoming Mississippi election? After President Trump campaigned in the Pelican State on Friday night for Republicans,  Louisiana held their \"jungle\" primary on Saturday for its statewide election.  All state offices were on the... yallpolitics.com", "2019-10-14T15:01:53.000Z": "I'm looking forward to this evening. See below for more information about the event. @MSGOP Quote Tweet Lucien Smith @LucienSmith There are still a few tickets left to tonight's ... @MSGOP  event with ... @peggy_grande  honoring ... @PhilBryantMS  and Deborah Bryant.  Go to http:// MSGOP.org or call 601-948-5191 to get your seat while we still have space!", "2019-10-13T14:00:00.000Z": "Happy Birthday to the @USNavy ! Today we celebrate 244 years of navigating the seas and being a global force for freedom.", "2019-10-12T16:22:51.000Z": "Let us all be thankful that God made Farmers. #NationalFarmersDay", "2019-10-11T21:28:58.000Z": "We are improving our Education System one student at a time. Quote Tweet The Reform Alliance @1ReformAlliance Did you know that #Mississippi schools are improving in #reading and literacy? http:// ow.ly/Q0l850w9GP1  #schoolchoice  #saveARstudents", "2019-10-11T19:11:05.000Z": "Congratulations to all those who serve our Veterans and have truly earned this special recognition. Quote Tweet National Cemeteries @VANatCemeteries . @USMAReeves presents an Operational Excellence award to North Mississippi Veterans Memorial Cemetery. They did a great job and met all the standards assessed. #NoVeteranEverDies  #HonoringVets", "2019-10-11T15:40:18.000Z": "Today I announced that Jamestown Metal is expanding in Pascagoula to accommodate new contracts with shipbuilder VT Halter Marine. The project is a $375,000 corporate investment and will create 100 full-time jobs.", "2019-10-11T14:31:22.000Z": "Well stated Mr. Chairman. @tatereeves is a Conservative Republican. He has the support of @realDonaldTrump and the Governor. Let's make sure we all win on November 5th by electing Tate as our new Governor. Quote Tweet Lucien Smith @LucienSmith . @tatereeves proved tonight why he is the clear choice for Mississippi.  If you want to continue conservative policy that will keep moving Mississippi forward, vote Tate Reeves for Governor. #mspol  #mselex", "2019-10-10T22:06:23.000Z": "Have the Nomad parked at the Beau and enjoying Crusin.", "2019-10-10T19:34:36.000Z": "Great to be at the @MSStateFair Antique Car Show today. I got to select the Governor's pick for the show. Got to love a '63 Ford T-Bird!", "2019-10-10T16:25:43.000Z": "Great to attend the Inaugural Friends of MS Veterans Clay Shoot, a  fundraiser to raise money for our Mississippi Veterans. Thanks to all who came out.", "2019-10-10T13:41:48.000Z": "Happy 50th Birthday to my good friend @BrettFavre . #GOAT", "2019-10-10T13:05:16.000Z": "So glad to welcome my friend @peggy_grande to Mississippi. An amazing lady who served President Reagan as his last Executive Assistant.", "2019-10-10T00:07:40.000Z": "My Senator stands for life. #MississippiProud Quote Tweet Cindy Hyde-Smith @cindyhydesmith US Senate candidate, MS No matter how much they attack, or how much they spend, I will never stop fighting for lives of the unborn. https:// foxnews.com/politics/plann ed-parenthood-spend-45-million-in-2020-to-elect-abortion-rights-candidates ", "2019-10-09T22:00:00.000Z": "I appreciate @VanJones68 for letting me come on his show and share my conservative view for some of the key issues going on in our country.", "2019-10-09T18:23:39.000Z": "For @msdemocrats , several dying Lib papers, a multi-millionaire funded Left Wing Blog )that has the gall to ask for donations) the task of spreading depression in Disinformation like campaign literature, is getting tougher. @PhilBryantMS  @tatereeves  @supertalk  @MSyallpolitics", "2019-10-09T18:52:12.000Z": "Great year for revenue in Mississippi. Almost $40 million more in September than projected. Mississippi tax revenue collections up $77 million above estimates The Legislative Budget Office is reporting that total revenue collections for the month of September FY 2020 are $39,933,319 or 7.99% above the sine die revenue estimate. Fiscal YTD revenue collect... yallpolitics.com", "2019-10-09T13:45:00.000Z": "We will fight the war in Human Trafficking every day for the victims and their families. MBI launches new human trafficking division - News Mississippi The Mississippi Bureau of Investigation has announced the formation of a new human trafficking division.  The division was created with the passage of a bill designed to combat human trafficking that... newsms.fm", "2019-10-08T22:35:38.000Z": "Thank you to @TrayHairston and all of the panelists at the Opportunity Zones Summit we held last week in Jackson. I'm thankful to all who are instrumental in making sure MS is successful with our 100 tracts.", "2019-10-08T21:55:42.000Z": "Getting the 55 Nomad ready for Crusin the Coast. Will be pulling out tomorrow. Best Classic Car Show in America. #CruisintheCoast", "2019-10-08T16:31:37.000Z": ". @TheMSLottery has launched their new website! We are looking forward to December 1, 2019. Quote Tweet themslottery @TheMSLottery With the launch of our new website, things are getting real! Visit us at http:// mslotteryhome.com . #dontmsyourchance  #playmsyall  #themslottery  #playresponsibly", "2019-10-08T15:09:28.000Z": "Don't be hoodwinked. Quote Tweet The RGA @The_RGA .@HoodForGovernor Proposes $1 Billion Agenda; Won't Say How He Would Pay For It => https:// rga.org/jim-hood-propo ses-1-billion-agenda-wont-say-how-he-would-pay-for-it/   #MSGOV", "2019-10-07T15:01:44.000Z": "Pearl River receives $2 million grant for Aviation and Aerospace Workforce Academy https:// msbusiness.com/2019/10/pearl- river-receives-2-million-grant-for-aviation-and-aerospace-workforce-academy/ ", "2019-10-07T17:08:27.000Z": "Glad to join @MayorFlaggs and @DelbertHosemann for an endorsement opportunity. Should be coming to you in a commercial soon.", "2019-10-07T15:57:37.000Z": "Today is the last day to register to vote. Be sure to register so you can exercise your right. #yallvote Quote Tweet Mississippi Secretary of State's Office @MississippiSOS The voter registration deadline for the November 5 General Election is TODAY! Mail-in applications must be postmarked today and applicants who register in-person in the Circuit Clerks' Offices must do so by 5 p.m. Visit http:// yallvote.sos.ms.gov for more info. #yallvote  #mselex", "2019-10-06T00:01:00.000Z": "Come on in, the waters fine, and fishing is better than ever! @SeeCoastalMS Quote Tweet WLOX @WLOX Coast residents, visitors relieved after Water Advisory Lifted https:// ift.tt/31QpKUm", "2019-10-05T21:52:55.000Z": "Don't forget to tune in to @CNN this evening at 6pm CST for the Van Jones Show. I'm excited to be his guest. @VanJones68", "2019-10-05T16:54:52.000Z": "Thank you Mayor Flaggs! #MSWorks Quote Tweet Mayor George Flaggs, Jr. @MayorFlaggs", "2019-10-05T14:30:00.000Z": "Delighted again to chair President @realdonaldtrump campaign in Mississippi.  He has always been there when we need him. Let's get ready for the biggest victory in history.", "2019-10-04T23:43:30.000Z": "For over a decade, Laurie has been extremely successful in helping improve education for the children of Mississippi by leading the charge through several legislative efforts. I am thankful for her dedicated service.", "2019-10-04T23:42:14.000Z": "Congratulations to Dr. Laurie Smith. She has been a valuable asset to the State of Mississippi for many years, and I can't wait to see what she can do for the whole country from her new position. President Donald J. Trump Announces Intent to Nominate and Appoint Individuals to Key Administrat... Today, President Donald J. Trump announced his intent to nominate the following individuals to key positions in his Administration: Sean O'Donnell of Maryl whitehouse.gov", "2019-10-04T22:00:22.000Z": "Tune into @VanJones68 on @CNN tomorrow at 6 pm CDT.", "2019-10-04T18:30:00.000Z": "Good meeting this morning with @FitchRatings . Mississippi is on the right track with our fiscal responsibility and revenue growth.", "2019-10-04T16:07:56.000Z": "FEMA has been a great partner to Mississippi during our time of need. Thanks Y'all @femaregion4 FEMA teams canvassing neighborhoods to help Mississippi flood survivors - News Mississippi More than a dozen disaster survivor assistance (DSA) specialists will be going door-to-door in the eight Mississippi counties designated for federal individual assistance in the wake of severe... newsms.fm", "2019-10-04T13:26:25.000Z": "Thanks to all the help from MEC for the significant improvements in Mississippi Public Schools. Hard working students, parents and administrators make it all possible. Quote Tweet MS Economic Council @MECStateChamber #Mississippi 's public school districts showed broad improvement under the state's letter grading system last year: http:// atjo.es/5DWl", "2019-10-03T22:03:39.000Z": "Liberals try to limit Freedom of Speech near abortion clinics. Mississippi city tries to limit noise near abortion clinic JACKSON, Miss. (AP) - Noisy conflict is common outside Mississippi's only abortion clinic, with protesters sometimes using bullhorns to amplify their voices and the clinic itself blaring music to... apnews.com", "2019-10-03T20:47:18.000Z": ". @Taylor_Machine made in Louisville, Mississippi. Cleaning the air one big red machine at a time. Quote Tweet Taylor Machine Works @Taylor_Machine Taylor introduces the world's first zero emissions battery-electric container handler for Everport Terminals and the Port Of Los Angeles. The ZLC series can complete a two-shift operation without opportunity charging. #taylorbigred  https:// portoflosangeles.org/references/new s_100219_top_handler ", "2019-10-03T20:35:06.000Z": "Earlier this week I received the Rural Health Task Force Report. Thank you to Chairman Ryan Kelly and the members of the Governor's Rural Healthcare Taskforce for their hard work. Follow the link to view: https:// governorbryant.ms.gov/Pages/Rural-He alth-Task-Force-Report.aspx ", "2019-10-03T18:31:22.000Z": "Congratulations to Lt. Gov. @tatereeves . Well deserved for your strong support of the Mississippi National Guard and their families. Quote Tweet Tate Reeves @tatereeves We live in a free nation, thanks to the service and sacrifice of our brave servicemembers. It has been my honor as Lt. Governor to support the men and women who risk their lives every day for us. I am truly humbled to receive the Mississippi Distinguished Civilian Service Medal.", "2019-10-03T16:13:02.000Z": "Mississippi is honored to host soldiers for the Artic Anvil Exercise and it is our hope that the rest of the exercise continues to be successful.", "2019-10-03T15:53:31.000Z": "Thanks to @ForrestGeneral Hospital, first responders, and those on the ground at Camp Shelby for their response.", "2019-10-03T15:52:08.000Z": "I've been in contact with General Boyles and the @nationalguardMS regarding the parachuting accident.I received the first phone call early this morning. My prayers go out to the members of Alaska's 4th Brigade Combat Team who were injured in the exercise. https:// foxnews.com/us/nearly-two- dozen-paratroopers-injured-in-mississippi-airborne-exercise-report ", "2019-10-03T13:10:36.000Z": "This recognition is outlined in the new report: State of the States: An Analysis of the 2019 Governors' Addresses The latest entry of the State of the States publication breaks down each governor's \"state of the state\" address and identifies strong and weak policy prescriptions within. The publications also... alec.org", "2019-10-03T13:09:58.000Z": "I would like to thank The American Legislative Exchange Council (ALEC) @ALEC_states for naming me on their 2019 Best of the Best list, based on my State of the State address proposals to enhance economic competitiveness and growth in the Magnolia State.", "2019-10-02T23:39:54.000Z": "Thank you Mr. President. We are all working hard in Mississippi for Victory in 2019 and 2020! Quote Tweet Donald J. Trump @realDonaldTrump Mississippi, there is a VERY important election for Governor on November 5th. I need you to Get Out and Vote for our Great Republican nominee, @TateReeves . Tate is strong on Crime, tough on Illegal Immigration, and will protect your Second Amendment.... Show this thread", "2019-10-02T21:18:16.000Z": "At the request of the MFC, @PhilBryantMS has signed a proclamation initiating a statewide burn ban, effective immediately. The burn ban will remain in place until further notice. More info> http:// bit.ly/2nUB3fi . #MSforestry  #wildfireprevention", "2019-10-02T21:07:04.000Z": "The State has been and will continue to be adversely affected by extremely dry conditions, and as a result wildfires are occurring increasingly over wide areas of Mississippi. I have signed a proclamation initiating a statewide burn ban, effective immediately.", "2019-10-02T16:49:28.000Z": "Numerous problems with the foundation structure and gas leaks have long plagued the current DPS Headquarters. Thank you to the MS Legislature who authorized $4.5 million to begin construction!", "2019-10-02T16:47:47.000Z": "We broke ground on the future HQ of @MissDPS . DPS should be in Rankin Co. because of the proximity to the crime lab, medical examiner's office & MLEOTA. It's important we build on the progress made. I know public safety will continue to be a priority for future administrations.", "2019-10-02T15:05:23.000Z": "Leading medical device manufacturer and supplier Zimmer Biomet is growing its distribution operations by locating a facility in Olive Branch. The project will create 100 additional jobs.", "2019-10-02T13:00:00.000Z": "Mississippi's Early Childhood System \"Connected for Success\" is helping lead the nation! Saul Zaentz Early Education Initiative at the Harvard Graduate School of Education Announces... /PRNewswire/ -- The Saul Zaentz Early Education Initiative at the Harvard Graduate School of Education today announced the finalists for its 2019 Zaentz Early... prnewswire.com", "2019-10-01T20:45:00.000Z": "It has been a great day at the first #SEOZsummit . I would like to thank all who attended and especially thank the speakers, panelists, and institutions for their involvement in this regional event. I look forward to next years summit in South Carolina.", "2019-10-01T20:11:58.000Z": "The final panel of the #SEOZsummit is an investor discussion that outlines the importance and impact of investing in these opportunity zones.", "2019-10-01T18:59:44.000Z": "The fourth panel is on regional trends highlighting potential projects for resilient infrastructure, agriculture, trade, manufacturing and other industries in the Southeast. #SEOZsummit", "2019-10-01T17:40:57.000Z": "Honored to have @SecretaryCarson of @HUDgov deliver the Key Note Address at the Southeastern Regional Opportunity Zone Summit. Today he announced the new website http:// opportunityzones.gov , a way for everyone to interact and learn more about Opportunity Zones. #SEOZsummit", "2019-10-01T16:35:45.000Z": "Panel III is moderated by Deputy Assistant to the President Ja'Ron Smith. Topic is \"Community-Led Investments: Stories of Financial and Social Impact.\" Also contributing is the @MSHomeCorp Executive Director Scott Spivey, @alan_lange , @TrayHairston , and @PRiddlebarger  #SEOZsummit", "2019-10-01T16:02:17.000Z": "Governor @henrymcmaster just announced South Carolina will be hosting the 2nd Annual Southeastern Regional Opportunity Zone Summit. We are thrilled to continue this discussion next year! #SEOZsummit", "2019-10-01T15:34:12.000Z": "This panel is moderated by @GlennMcCJr Executive Director of @mdaworks .", "2019-10-01T15:32:50.000Z": "South Carolina Governor @henrymcmaster is sitting on Panel II about the \"Government Role in Opportunity Zones.\" We are proud to have him in Mississippi. This panel also includes representatives from the states of Arkansas and Alabama. #SEOZsummit", "2019-10-01T14:12:00.000Z": "Day 2 of the Southeastern Regional Opportunity Summit has begun. The first panel is on \"The Mississippi Story\" of the first opportunity zone transaction in the U.S. #SEOZsummit", "2019-09-30T22:58:25.000Z": "The Southeastern Regional Opportunity Zone Summit is in full swing. Day 1 was a huge success thanks to @MilkenInstitute . I look forward to Day 2 tomorrow with @SecretaryCarson , @US_EDA Dr. John Fleming, @henrymcmaster , Scott Turner, and more. #WelcomeReception  #SEOZsummit", "2019-09-30T21:33:04.000Z": "It was great to attend @HUDgov 's lead remediation grant announcement at Ms. Wall's home in Jackson . I appreciate @SecretaryCarson and his leadership on this issue.", "2019-09-30T13:00:52.000Z": "U.S. Department of Commerce invests to support growth of aviation and aerospace workforce in Mississippi U.S. Department of Commerce invests to support growth of aviation and aerospace workforce in... U.S. Secretary of Commerce Wilbur Ross has announced that the Department's Economic Development Administration (EDA) is awarding a $2 million grant to Pearl River Community College of Poplarville,... newsms.fm", "2019-09-30T14:28:09.000Z": "Proud to have the @US_EDA team in Mississippi. Quote Tweet EDA @US_EDA We're in #jacksonms for the @MilkenInstitute Southeast Regional #OpportunityZones Boot Camp to learn how regional efforts can help build a stronger, more vibrant and resilient Southeast economy.", "2019-09-29T18:01:11.000Z": "No President has ever been a better friend to Israel and the Jewish people than @realDonaldTrump . Quote Tweet Donald J. Trump @realDonaldTrump Wishing a Happy New Year to all of those celebrating Rosh Hashanah in America, Israel, and around the World!", "2019-09-29T14:39:47.000Z": "I would ask everyone to send prayers this Sunday morning. May God hold this family in his hands. Quote Tweet MHP BILOXI @MHPTroopK We extend our deepest sympathies to the Harrison Co Sheriffs Dept (MS) during this time. We are deeply saddened to hear of the sudden loss of Deputy Glen Roe, a true lawman. As you grieve, know that the LEO community is behind you during this difficulty time and the days ahead.", "2019-09-28T22:00:16.000Z": "Tragic accident in Jackson County this morning.  We have lost a veteran Law Enforcement Officer. Now we are praying for his wife's recovery. Harrison County deputy killed in motorcycle wreck Authorities confirmed one person is dead and another injured after a wreck in Jackson County Saturday morning. wlox.com", "2019-09-28T19:55:12.000Z": "Thanks @tatereeves . Great cause to champion. Proud of my Eagles. Quote Tweet Tate Reeves @tatereeves Glad to see @CoachHopson & @SouthernMissFB taking a stand to help cure Duchenne Muscular Dystrophy today. Thanks for leading @CoachToCureMD presented by @wernerladderco Let's #tackleDuchenne ! #SMTTT", "2019-09-28T16:51:41.000Z": "The @homeofgrace has been a way out of addiction for decades and continues to be instrumental in people's lives. Thank you to all who came out to support this great cause. @HogRideFestival", "2019-09-28T14:15:44.000Z": "Great day to ride and join over 500 motorcycles in the Home of Grace \"HOG\" Ride @HogRideFestival . Proceeds support the scholarship fund at the Home of Grace, a faith-based addiction recovery program serving the Gulf Coast. #LetsRide", "2019-09-28T02:17:41.000Z": "See you there Brett. Time to pack the Rock. #SMTTT Quote Tweet Brett Favre @BrettFavre Alright Southern Miss fans especially students let's pack the Rock!! SMTTT!!!!", "2019-09-28T01:21:45.000Z": "Great night at the 2019 @HancockWhitney Splash Bash for Mississippi Aquarium! I look forward to the opening of the @MS_Aquarium on April 30, 2020. I can't wait to bring my grandchildren here to visit! @tatereeves  @StevenPalazzo  @BillyHewes", "2019-09-27T20:35:01.000Z": "Today I announced 17 projects totaling more than $20.85 million that will be funded through the most recent Phase II Gulf of Mexico Energy Security Act (GOMESA) disbursement. These funds will continue our efforts to protect and enhance our beautiful Mississippi Gulf Coast.", "2019-09-27T12:52:44.000Z": "I appointed District Attorney Kassie Coleman because she can be trusted to protect our families. Kassie has proven her dedication and skills in fighting for justice and making your community safer for the next generation.", "2019-09-26T22:50:11.000Z": "Thanks Senator! I loved duck hunting with his Dad. All men of honor. Quote Tweet U.S. Senator Cindy Hyde-Smith @SenHydeSmith Look forward to working with @USDOL Secretary Scalia to promote job creation and workforce training in Mississippi.", "2019-09-26T20:36:25.000Z": "It was a great day unveiling the country music trail marker for Marty Gamblin. Marty's history and influence in country music runs deep. #MSProud  #MSCountryMusicTrail  @visitms  @Phila_Tornadoes Quote Tweet Visit Mississippi @visitms Marty Gamblin has been an extension of Mississippi's musical heritage by sharing his talents as a publisher & manager for some of the biggest names in music. Today he was joined by Gov. @PhilBryantMS as he received a marker on the #MSCountryMusicTrail .  http:// bit.ly/MartyGamblinMa rker ", "2019-09-26T15:19:43.000Z": "Don't forget to sign up for the Southeastern Regional Opportunity Zone Summit by 12:00 p.m Friday the 27th. I look forward to seeing you there! http:// mississippi.cvent.com/m-events/Info/ Summary?e=9dd6b34a-cb61-4618-b7e3-2d90f9524092 ", "2019-09-26T12:34:52.000Z": "Congratulations @MSDeptofITS ! Quote Tweet MS Dept. of ITS @MSDeptofITS We proudly announce that the official website of the State of Mississippi, http:// ms.gov , won 3rd place in the Center for Digital Government's annual Government Experience Awards. #awards Read more at: https:// its.ms.gov/Pages/3rd_plac e_gov_experience_2019.aspx  .", "2019-09-25T15:48:09.000Z": "Fishing is the cornerstone of countless coastal economies & has been a way of life for generations of Americans. This determination acknowledges the critical role fisheries play in our communities, & the risks they face from natural disasters & other causes beyond their control. Quote Tweet U.S. Commerce Dept. @CommerceGov Commerce @SecretaryRoss approves disaster declarations for American fishing communities in #Louisiana , #Mississippi and #Alabama due to extreme flooding events in the Gulf of Mexico. https:// commerce.gov/news/press-rel eases/2019/09/secretary-commerce-approves-disaster-declarations-american-fishing ", "2019-09-25T22:34:14.000Z": "Congratulations Charles on your Award. Hard work always produces a good result. Quote Tweet Charles McCool @CharlesMcCool #traveltribe , I am immensely proud to share I won Travel Media Award @VisitMSTourism Governor's Conference recognizing best of Mississippi #travel  #MSGCT2019  @SeeCoastalMS @Anna_RoyVMGC nominated me and @ErinMRosetti accepted. Thank y'all #SecretCoast  #USGulfCoast  #ttot  #trlt", "2019-09-25T19:00:00.000Z": "Pleased to have @aronbetru MC'ing the Southeastern Regional Opportunity Zone Summit Oct.1st. Aron leads the @MilkenInstitute work on OZs and he will be a great facilitator for this regional event. I look forward to seeing him again. #SEOZsummit", "2019-09-25T17:07:00.000Z": "Thanks to all involved. This is great news for the MS Gulf Coast. Quote Tweet Senator Roger Wicker @SenatorWicker ICYMI: Here's the official announcement from @CommerceGov declaring a catastrophic regional federal fishery disaster for Mississippi, Alabama, & Louisiana. I worked with @NOAA , @PhilBryantMS , @SenHydeSmith , and @CongPalazzo to get our state relief. https:// commerce.gov/news/press-rel eases/2019/09/secretary-commerce-approves-disaster-declarations-american-fishing ", "2019-09-25T14:17:53.000Z": "I would also like to thank our MS CODEL for their work in securing this declaration that will create a path forward to obtaining funding that will provide much needed assistance to the individuals and marine resources that have been affected by the prolonged Bonnet Carré opening.", "2019-09-25T14:16:52.000Z": "Thanks to @SecretaryRoss for approving the Federal Fisheries Disaster Declaration. I appreciate the support for the Mississippi Gulf Coast and our hard working fishermen.", "2019-09-24T21:17:56.000Z": "One of the most compelling speeches ever made at the United Nations. #MAGA Quote Tweet The White House @WhiteHouse \"Socialism and communism are not about justice. They are not about equality. They are not about lifting up the poor.\n\nAnd they are certainly not about the good of the nation. \n\nSocialism and communism are about one thing only: power for the ruling class.\" #UNGA", "2019-09-24T19:03:29.000Z": "Important decision ordering rehearing by the full 5th Circuit Court of Appeals. Under our system of Federalism, the Mississippi Legislature not a single Federal Judge has the Constitutional authority to apportion districts. Senate District 22 gerrymandering case will be heard by entire 5th Circuit Court On Monday, in a ruling in favor an appeal by the State Election Commission, the United States Court of Appeals ruled that the redistricting lawsuit filed in July 2018 to redraw the lines of a... yallpolitics.com", "2019-09-24T17:00:00.000Z": "Great piece written by Assistant Secretary of Commerce for Economic Development Dr. John Fleming. We are excited he will be joining us and speaking at the Southeastern Regional Opportunity Zone Summit. @US_EDA Commentary: Opportunity Zones Aren't a Gimmick-They're a Legitimate Investment Option Commentary: Investment in qualified Opportunity Zones brings significant tax advantages, as a result of Trump's tax plan. fortune.com", "2019-09-24T13:00:00.000Z": "I am honored that @SecretaryCarson , Secretary of @HUDgov , is speaking at the Southeastern Regional Opportunity Zone Summit Oct.  1st. I look forward to welcoming him back to Mississippi. His expertise on Opportunity Zone's is something you don't want to miss.", "2019-09-23T21:33:21.000Z": "Today @PhilBryantMS visited MEMA for a briefing with MEMA @GregMichelMSEMA on the Individual Assistance Declaration as a result of the Feb 19-24, 2019 #SevereStorms  #Tornadoes  #Flooding . This disaster includes the Yazoo-Basin Backwater Flooding. More info: https:// bit.ly/2mGk8fJ", "2019-09-23T21:26:58.000Z": "Meeting today with @msema regarding FEMA approving flood relief for the Delta and the potential for Tropical storms to produce Hurricane activity in the Gulf.  Tropical Storm Karen appears to be headed Northeast and will hopefully stay out at sea.", "2019-09-23T17:00:00.000Z": "If you're looking to learn more about Opportunity Zones, register for the Southeastern Regional Opportunity Zone Summit. \n\nHere is a link that shares a positive impact that has come from this legislation. T.I. And David Gross Explain Opportunity Zones | Forbes David Gross and T.I. discuss the potential of Opportunity Zones and the implementation of best practices to unlock transformative economic potential and crea... youtube.com", "2019-09-23T13:19:58.000Z": "Great day at the new MLEOTA shooting facility in Pearl for the start of the @NRA Championship for Law Enforcement Officers. The NRA signed a 5 year contract to host the Championship right here in Mississippi. This will be the 57th year of competition.", "2019-09-22T21:36:18.000Z": "Mississippi @SenHydeSmith is first in line to meet our friend and PMO India as he takes the stage in Houston today. Quote Tweet PMO India @PMOIndia Thank you Houston for such amazing affection! #HowdyModi", "2019-09-22T15:22:36.000Z": "Thanks to MHP Motorcycle Unit for keeping these riders and all the motoring public safe.  May the good Lord always keep them out of harms way. Quote Tweet MHP BILOXI @MHPTroopK The Mississippi Highway Patrol Motorcycle Unit along with other law enforcement agencies from across the State of MS escorted Governor @PhilBryantMS and 735 other motorcycles today for the Wounded Warriors of Mississippi to raise money for our nations heroes.", "2019-09-21T18:39:59.000Z": "It has been my honor for the last 6 years to host the Annual Governor's Ride to raise money for our Mississippi Wounded Warriors and help these veterans who have sacrificed so much. Today we raised over $60,000 and had over 730 riders. Thank you to all who attended!", "2019-09-21T14:32:11.000Z": "", "2019-09-21T14:31:23.000Z": "Beautiful day for the 6th Annual Governor's Ride for Wounded Warriors. Let's ride!", "2019-09-21T13:16:26.000Z": "Since August 2018 the number of jobs in our state has increased by 15,000. #MSWorks Number of Mississippians working increased in August 2019 The August 2019 rate is five-tenths of a percentage point higher than a year ago in August 2018, when the rate was 4.7%. wlox.com", "2019-09-21T00:13:27.000Z": "Thank you President @realDonaldTrump for approving FEMA Individual Disaster Assistance for Warren, Yazoo, Sharkey, Humphreys, Issaquena, Clay, Lowndes, and Monroe counties. Great news for Mississippi and these areas that have been devastated by flooding and severe weather.", "2019-09-20T22:07:23.000Z": "In accordance with Special Circuit Court Judge McKenzie's order issued on September 17th, I have set the special election for Senate District 50 for November 5th, 2019.", "2019-09-20T20:21:01.000Z": "I would encourage every Governor to visit Taiwan and show our support for this Democracy and vital trading partner. Quote Tweet 蔡英文 Tsai Ing-wen @iingwen We regret Kiribati's decision to abandon our true friendship & become China's pawn. China's continued oppression of #Taiwan is an attempt to influence the upcoming election, but it only strengthens our determination to preserve our sovereignty & democracy. https:// bit.ly/2msBUDb", "2019-09-20T19:01:09.000Z": "Until they are all home, we will never forget. Quote Tweet The White House @WhiteHouse Our history is filled with the stories of courageous men and women who went beyond the call of duty to protect and defend.\n\nToday. we honor those who were Prisoners of War and those Missing in Action.\n\nYou are not forgotten.", "2019-09-20T14:31:21.000Z": "Enjoyed meeting President @iingwen of Taiwan. Her Goodwill Trade Delegation signed Letters of Intent this week to purchase soybeans and corn from Mississippi Farms.  Thanks to @CommAndyGipson and @MSFarmBureau for helping make this possible.", "2019-09-20T00:30:12.000Z": "I endorse Republican @LynnFitch for A.G. Quote Tweet Adam Ganucheau @GanucheauAdam Jennifer Riley Collins, Dem nominee for AG, questions why current AG Jim Hood, the Dem nominee for governor, hasn't endorsed her: \"ASK YOURSELF WHY... I urge General Hood to reconsider his lack of support for my campaign.\" #MSElex Show this thread", "2019-09-19T21:40:29.000Z": "Deborah and I offer our prayers of support for @GovernorKayIvey . Kay is a dear friend and one of the finest leaders in America. Her strength and faith will bring her through this challenge. Godspeed Kay. Quote Tweet Governor Kay Ivey @GovernorKayIvey During a routine exam, a spot was discovered on my lung that was unusual & is, indeed, a tiny, isolated malignancy. The good news is that I'm fortunate this was discovered early, & it's very treatable. I welcome your prayers & your support. https:// governor.alabama.gov/statements/gov ernor-ivey-issues-statement/ ", "2019-09-19T21:06:17.000Z": "For the first time, Taiwan's Goodwill Procurement Trade Delegation has chosen to do business with Mississippi. This partnership will benefit our Mississippi soybean and corn farmers and reaffirms our commitment to collaborate and strengthen our respective agriculture industries.", "2019-09-19T15:47:29.000Z": "Beautiful day for the start of the @Sanderson_Champ ! @PGATour  #MSProud Quote Tweet Sanderson Farms Championship @Sanderson_Champ It all begins at the 1st Tee! First day of play here at the Sanderson Farms Championship.", "2019-09-18T22:12:17.000Z": "Meeting with U.S. EPA Administrator Andrew Wheeler today to help finish the pumps in the Mississippi Delta. Made progress today. #FinishThePumps  @EPAAWheeler", "2019-09-18T21:00:05.000Z": "Happy Birthday @usairforce ! Today we celebrate 72 years of service & excellence.", "2019-09-18T20:35:15.000Z": "The U.S. Military recently began Operation Artic Anvil at the Ports of Gulfport and Pascagoula. Approximately 4,500 troops and over 1,450 pieces of equipment are headed to Camp Shelby for the Joint Readiness Exercise. #ArmyStrong  #TogetherWeDeliver", "2019-09-17T16:01:01.000Z": "Gov. @PhilBryantMS will host the Southeastern Regional Opportunity Zone Summit September 30 - October 1st. The event will be held at the @JxnConvention in Jackson, MS. For more info: http:// mississippi.cvent.com/OpportunityZon  #MSWorks", "2019-09-17T22:07:55.000Z": "Our songwriters and musicians are helping raise funds for the Delta flood victims. 100% of the proceeds will benefit the South Delta Disaster Recovery Fund. Come if you can. #OneMississippi  https:// eventbrite.com/e/one-mississi ppi-singer-songwriter-benefit-concert-tickets-71113194479 ", "2019-09-17T19:12:53.000Z": "Catfish processing company #SuperiorCatfish is expanding its operations in Macon. The project is a $17-million corporate investment and will create 25 jobs. #Mississippi 's catfish rep just got a lot stronger today! http:// bit.ly/MDASuperiorCat fish   #MSWorks", "2019-09-17T16:59:45.000Z": "Economic development projects are on track to help create more jobs and more private capital investment than ever before in Mississippi.  Great job by the MDA team and local developers. @mdaworks", "2019-09-17T14:19:22.000Z": "This exercise highlights the interconnectedness and support of South Mississippi's military infrastructure.", "2019-09-17T14:18:13.000Z": "I had a great evening with members of our MS CODEL and Lt. General Quintas, Jr., Deputy Commanding General and other distinguished guests discussing the Artic Anvil exercise that is ongoing at our ports on the Mississippi Gulf Coast.", "2019-09-17T13:27:08.000Z": "Today, continue to pray for all those affected by the recent storms and flooding. #webelieve . Quote Tweet CNN @CNN Thinking of sending your \"thoughts and prayers\" to those affected by tragedy or a natural disaster? Not everyone wants them.\n\nWhile Christians value these gestures from religious people, some atheists and agnostics want to avoid them, a new study finds. https:// cnn.it/30qbC2m", "2019-09-16T22:58:35.000Z": "The legend and \"King of the Blues,\" B.B. King would have had his 94th birthday today. His influence continues to shape music around the world.", "2019-09-16T21:58:03.000Z": "Another great day for Mississippi and American energy independence. Quote Tweet Mandy Gunasekara @MississippiMG This is American Energy Dominance in action happen twitter.com/GlennMcCJr/sta", "2019-09-16T20:58:08.000Z": "Glad to join these two great artists in our Nation's Capital to promote music in Mississippi. #NativeSons Quote Tweet Steve Azar @steveazar Looking forward to a great show with Cedric Burnside, some tix still available if in the DC area come on! @visitms  https:// ticketfly.com/event/1878532- native-sons-steve-azar-washington/ ", "2019-09-16T17:00:00.000Z": "William Carey University's College of Osteopathic Medicine has been authorized to expand the size of its incoming class doubling it over the next four years. This is great news for our state's medical community. @WmCareyU  https:// wmcarey.edu/news/2019-09-0 9/wcu-medical-school-to-double-in-size ", "2019-09-16T14:52:37.000Z": "", "2019-09-16T14:52:19.000Z": "Don't forget to sign up for the Southeastern Regional Opportunity Zone Summit September 30- October 1st at the @JxnConvention center. http:// mississippi.cvent.com/events/opportu nity-zone-summit-2019/event-summary-9dd6b34acb614618b7e32d90f9524092.aspx ", "2019-09-15T13:05:37.000Z": "So sad to hear of the passing of Kipp Greggory. I always enjoyed our interviews and listening to his radio show. He was a fine Christian who brought joy to all he met. Today he walks the streets of glory. Rest well my friend.", "2019-09-14T15:49:55.000Z": "Mississippi is now in better fiscal condition than anytime in the state's history. Thanks to republican leadership we will fill our savings account. #staythecourse Quote Tweet Tate Reeves @tatereeves Huge news in MS! Our rainy day fund is now expected to be full for the first time! That is how we weather crises-recession, storms, or any disaster. That's a 4,000% increase from when Democrats controlled the governorship. That is fiscal responsibility at work!", "2019-09-14T13:37:38.000Z": "This is a huge success for @MSMedicaid .  Great work by Director Drew Snyder and his team. Quote Tweet Mississippi Medicaid @MSMedicaid . @MSMedicaid currently on track to avoid budget deficit for 2nd consecutive year. View presentation here: https:// medicaid.ms.gov/wp-content/upl oads/2019/09/JLBC-Presentation_091319.pdf  Show this thread", "2019-09-13T18:00:56.000Z": "\"We look at employees and try to challenge them to everyday come to work and try to motivate them and challenge them. #Mississippi 's highly skilled, highly qualified #workforce plays a huge part in the success of General Atomics. #MSWorks  #InTheirWords  http:// bit.ly/1TB4hok", "2019-09-13T15:48:07.000Z": "Great jobs are available in Mississippi's Aerospace Industry. Thanks @relativityspace for coming to @NASAStennis . #MSWorks Quote Tweet Relativity Space @relativityspace We're always looking for top #engineering and #aerospace talent to join our team. This week, Relativity CTO Jordan Noone hosted @mdaworks to discuss opps for #Mississippi 's best & brightest at @NASAStennis . Join us to build the future of humanity in space: https:// bit.ly/2lDDMs9", "2019-09-13T12:59:05.000Z": ". @SenHydeSmith is getting the job done for Mississippi. Great work Senator. #FinishThePumps Quote Tweet Cindy Hyde-Smith @cindyhydesmith US Senate candidate, MS Proud to support this legislation to improve flood control projects, ports, & waterways in MS. Managing the Mississippi River requires constant attention and investment, as shown by the prolonged flooding in the MS Delta. https:// yallpolitics.com/2019/09/12/hyd e-smith-secures-funding-support-to-address-army-corps-projects-affecting-mississippi/ ", "2019-09-12T23:59:20.000Z": "Great debate tonight by @DelbertHosemann . Strong republican candidate. #VoteRED  @MSGOP", "2019-09-12T23:00:03.000Z": "Thanks @Entergy for helping grow Mississippi's economy.  You have been a great partner for progress. Quote Tweet Entergy @Entergy At Entergy, we mean business. That's why for 12 years running, @SiteSelection magazine has named us one of the nation's top utilities in #economicdevelopment . #econdev  http:// enter.gy/6019E7wpT", "2019-09-12T17:01:50.000Z": "I am looking forward to having men & women from a variety of public & private institutions attend this summit. The purpose is to discuss how to maximize opportunity zones so that we can work together to build a stronger MS, a more vibrant Southeast, & a more prosperous country. Quote Tweet MS Dev. Authority @mdaworks Gov. @PhilBryantMS will host the Southeastern Regional Opportunity Zone Summit September 30 - October 1st. The event will be held at the @JxnConvention in Jackson, MS. For more info: https:// mississippi.cvent.com/OpportunityZon eSummit2019   #MSWorks", "2019-09-12T14:58:56.000Z": "Very proud of my former Chief of Staff @JoeySongy . Songy starts new consulting firm after years with Gov. Bryant BEFORE YOU GO  we'd like to ask for your support. More people are reading the Mississippi Business Journal than ever before, but advertising [...] msbusiness.com", "2019-09-11T21:59:00.000Z": "\"Today, let us remember that our Union-forged and strengthened through adversity-will never be broken and that the immeasurable sacrifices of our patriots will never be forgotten.\" Presidential Proclamation on Patriot Day, 2019: Presidential Proclamation on Patriot Day, 2019 On Patriot Day, we solemnly remember the nearly 3,000 people who perished on September 11, 2001. whitehouse.gov", "2019-09-11T19:29:03.000Z": "I'm proud of how Mississippi is remembering and commemorating this 9/11 #PatriotDay . 9/11: Remembering those lost and those who serve Reservoir firefighters and supporters run during the 9/11 Remembrance Run commemorating those who lost their lives on 9/11, while honoring current military veterans and first responders. clarionledger.com", "2019-09-11T13:00:00.000Z": "Today we remember those lost and the sacrifice made by so many heroes during the attacks on September 11, 2001. May this day serve as a reminder of the strength of the United States of America. #NeverForget", "2019-09-10T21:54:17.000Z": "Congratulations to @SouthernMiss for continuing to lead in oceanographic research. This will help MS continue to be on the forefront in the Blue Economy. Thank you @NSF and @PortofGulfport . Quote Tweet Southern Miss @SouthernMiss USM and @LUMCONscience have been selected to operate the @NSF 's third Regional Class Research Vessel. The vessel will be owned by NSF and will enable scientists to conduct scientific research and help shape the future of our world's oceans.\n\nDetails: https:// bit.ly/34w2v3H", "2019-09-10T20:16:48.000Z": "I am very proud of the creation of the new statewide Mississippi Human Trafficking Council. This council will help prevent trafficking, protect victims, and prosecute criminals. Thank you to @USAttorneys Chad Lamar and @USAttyHurst , @PhilipGunnMS , and Commissioner Fisher. Quote Tweet Justice Department @TheJusticeDept National, State, Local and Tribal Government Officials Announce New Statewide Mississippi Human Trafficking Council to Combat This Violent Crime https:// justice.gov/opa/pr/nationa l-state-local-and-tribal-government-officials-announce-new-statewide-mississippi-human  Show this thread", "2019-09-10T15:19:22.000Z": "Prayers for those involved in the school bus accident in Benton County this morning. I am coordinating with @MSHwyPatrol and @MissDPS .", "2019-09-10T13:00:01.000Z": "With USMCA, we will have stronger growth, more\nexports, more jobs, and rising wages. The USMCA is a\nbig win for America's economy. #USMCAnow", "2019-09-10T02:47:00.000Z": "That's the way to start Monday Night Football. #WhoDat Quote Tweet The Checkdown @thecheckdown Can't leave too much time for Deshaun.\n\nCan't leave too much time for Brees.\n\nWHAT. A. FINISH.", "2019-09-09T20:05:01.000Z": "This is our team and I endorse each of them. #WinThemAll Quote Tweet Mississippi GOP @MSGOP Thank you to everybody who joined us today at our Victory Kickoff! We have a strong slate of conservatives, and we're ready to win big in November! #LeadRight", "2019-09-09T17:54:18.000Z": "Great to attend the victory kick-off and join great Republican candidates and supporters as we get ready to keep Mississippi RED in November. @MSGOP", "2019-09-09T15:54:18.000Z": "Congratulations @bluedeltajeans , a Mississippi company and a great success story! Quote Tweet Blue Delta Jean Co. @bluedeltajeans Great weekend celebrating the announcement that Blue Delta is the Official Jean of the @RyderCupUSA ! Thank you to all who helped make this happen!  #bluedeltajeans  #rydercup  #bespoke", "2019-09-08T19:52:14.000Z": "Interesting post and question. Quote Tweet Charles R Porter @ChasRPorter Does @HoodForGovernor suppprt any Democrat candidate? If so, who and why? @MSTODAYnews should ask him.  Inquiring minds would like to know. Show this thread", "2019-09-08T01:39:20.000Z": "A great day for Henry and his Papa at @msstate . Golden Eagles will hang tough but this was the day for Dawgs..They will take it to the SEC.", "2019-09-08T00:16:48.000Z": "I have made several appointments to statewide offices. This is why I selected Andy Gipson as Agriculture Commissioner. #Truegrit Quote Tweet Commissioner Andy Gipson @CommAndyGipson Me and my boy!", "2019-09-07T22:38:49.000Z": "Great honor to be recognized by Mississippi State University today. Thanks to President Keenum and the Bulldog Nation. @msstate", "2019-09-06T23:20:37.000Z": "Information you probably won't see anywhere else. Quote Tweet The RGA @The_RGA CONFIRMED: Radical Liberal Stacey Abrams Working To Elect @AndyBeshearKY , @JohnBelforLA & @HoodForGovernor => https:// rga.org/confirmed-radi cal-liberal-stacey-abrams-working-to-elect-andy-beshear-john-bel-edwards-and-jim-hood/   #KYGov  #lagov  #mselex  #msgov", "2019-09-06T20:28:30.000Z": "Looking forward to being there! @MSGOP Quote Tweet Mississippi GOP @MSGOP We hope you can join us on Monday!", "2019-09-06T17:03:40.000Z": "Congratulations @SenatorWicker . Thanks to you and our entire delegation, Mississippi's future is brighter than ever. Quote Tweet Senator Roger Wicker @SenatorWicker Mississippi is among the most pro-growth, pro-business states in America, and I am proud to be doing my part to promote our economy and create good-paying jobs for Mississippians. @USChamber  @MECStateChamber  https:// wicker.senate.gov/public/index.c fm/2019/9/wicker-receives-u-s-chamber-spirit-of-enterprise-award-in-ridgeland ", "2019-09-06T14:10:41.000Z": "", "2019-09-06T13:00:01.000Z": "Food insecurity is an issue of grave concern in the United States and the State of Mississippi. MS is committed to working with @ExtraTable to educate other citizens and raise awareness of the need to devote attention to fighting hunger in our state. #HungerAwarenessMonth", "2019-09-06T12:13:15.000Z": "The latest revenue numbers continue to surpass estimates. Tax cuts work. Period. FY2020 revenue reports still above estimates for August Total revenue collections for the month of August FY 2020 are $9,995,224 or 2.49% above the sine die revenue estimate. Fiscal YTD revenue collections through August are $37,080,479 or 5.25% above the... yallpolitics.com", "2019-09-05T21:13:11.000Z": "I am proud that the Mississippi State Supreme Court has ruled that charter schools in Mississippi are constitutional. I believe that all students should have the opportunity to attend the school of their choice to ensure the best education possible. Mississippi Supreme Court sides with charter school students The Mississippi Supreme Court upheld the constitutionality of public charter school funding, preserving the schools that have served as a lifeline to hundreds of Mississippi children in just a few... mspolicy.org", "2019-09-05T16:27:38.000Z": "Sending prayers to the officers wounded in today's shooting. Thank you Madison County Sheriffs Department, @MissDPS , MBI and first responders for their work and response to the shooting.", "2019-09-05T16:09:37.000Z": "Spectra Laboratories, a wholly owned subsidiary of @FMCNAnews , the nation's leading provider of kidney care products and services, broke ground on a 200,000-square-foot laboratory in Southaven. The project is expected to create more than 300 jobs over the next 3 years. #MSWorks", "2019-09-05T12:38:53.000Z": "Together we stand, divided we fall. Republicans will stand. Quote Tweet Spencer Ritchie @SpencerMRitchie This narrative of the @MSGOP being \"divided\" is contrived and silly. Just because you have an abundance of good candidates and have competitive primaries doesn't make a party \"divided.\" Plus, @MSGOP time and time again has shown unity after primaries. E.g. 2014 US Senate race. twitter.com/GanucheauAdam/", "2019-09-04T19:29:34.000Z": "Good perspective here from MCPP. Young and highly educated professionals want a vibrant and prosperous city to live, work and play. That should be Jackson. Quote Tweet Mississippi Center for Public Policy @mspolicy Mississippi needs a thriving urban core to reverse population loses statewide. Where does that start? Solving Jackson's crime problem, both perception and reality. https:// mspolicy.org/solutions-to-b rain-drain-begin-with-solving-jackson-crime/ ", "2019-09-04T15:30:00.000Z": "Great meeting this morning with Janet Tran of the Ronald Reagan Institute. Looking forward to RISE 2020, a @ReaganInstitute Summit on Education.   Proud to serve on the Honorary Steering Committee which promotes the state's role in education. @ronaldreagan40", "2019-09-04T13:10:06.000Z": "I will be supporting Lynn Fitch for Attorney General. First female A.G. for Mississippi. Let's make it happen! Quote Tweet Lynn Fitch @LynnFitchAG What a remarkable group of women - the Girl Scouts of Greater Mississippi 2019 Women of Distinction, including my good friend, Deanne Mosley, executive director of The Mississippi Bar. @girlscouts  @TheMSBar", "2019-09-04T01:14:35.000Z": "The Governor's Mansion is lit blue for the 1 in 9 men who will be diagnosed with prostate cancer. Together with the Prostate Cancer Foundation, we'll #LightItBlue and help raise awareness. @PCFnews  #PCAM", "2019-09-03T18:03:51.000Z": "Today @MSEMA Executive Leadership participated in @fema National Coordination Center Video Teleconference in response to #HurricaneDorian . MEMA briefed on assistance that #Mississippi can provide to the affected states through the Emergency Management Assistance Compact (EMAC)", "2019-09-03T14:27:18.000Z": "Congratulations graduates! \"Nine different crafts were represented among the 159 graduates of the 2019 class.\" #MSWorks Quote Tweet MS Economic Council @MECStateChamber The 2019 Ingalls Shipbuilding Apprenticeship Program graduates 159 participants: http:// atjo.es/5COG", "2019-09-03T00:16:10.000Z": "Great day dove hunting in Copiah County. Fall is on the way.", "2019-09-02T19:00:11.000Z": "Mississippi is a leading state focused on generating a workforce that supports the creation of good, high-paying jobs. In the last 8 years we have added well over 80,000 jobs to Mississippi's workforce. #MSWorks  #LaborDay", "2019-09-02T17:00:00.000Z": "\"Labor Day brings a fitting opportunity to salute those who built our great nation and whose spirit, hard work and courage are now building a new era of lasting economic expansion filled with greater opportunities for all our people.\" -Ronald Reagan", "2019-09-02T16:11:33.000Z": "Someone should let CNN know that Alabama is missing.. Quote Tweet David W. Case @dwcase I live in Mississippi and my sister lives in Georgia and if anybody could have been bothered to tell me our States were right next to each other I would have visited her way more than I have the last 30 years", "2019-09-02T14:34:57.000Z": "We are praying for those in harms way of Hurricane Dorian. Mississippi stands ready and is prepared to send support personnel to the effected areas once the storm comes ashore.", "2019-09-02T13:00:01.000Z": "Happy Labor Day to our hardworking Mississippians! Today, we honor the working people of America and their efforts to help build American strength and prosperity.", "2019-09-01T16:56:56.000Z": "Another great day to be a Golden Eagle. #SMTTT Quote Tweet Brett Favre @BrettFavre Thanks to the many Alcorn fans for coming and to our loyal eagle fans especially our students let's get 5,000 students for the next one #SMTTT twitter.com/SouthernMissFB", "2019-09-01T13:00:01.000Z": "I hope you have a blessed Sunday with your families!", "2019-08-31T14:00:01.000Z": "It's GameDay! Good luck to all of our Mississippi schools. #collegefootball  @CollegeGameDay", "2019-08-30T22:42:25.000Z": "Follow @MSEMA and @NWSJacksonMS for weather updates throughout the weekend. #Dorian  #MSWX Quote Tweet National Hurricane Center @NHC_Atlantic 5 PM EDT: Here are the latest Key Messages for #Dorian . For more information see http:// hurricanes.gov", "2019-08-30T22:34:46.000Z": "If China would crack down on the illegal trafficking of this poison-we may be able to trust them on trade and other policies. Investigators seize enough fentanyl to kill 14 million people in massive drug bust Law enforcement officers in Virginia busted a massive three-state drug ring as part of what they called \"Operation Cookout\" cbsnews.com", "2019-08-30T18:45:55.000Z": "Trent Lott International Airport is getting a big upgrade to accommodate larger planes. Today @SenHydeSmith , @CongPalazzo , and I announced $6.7M to support this project. Wicker, Hyde-Smith, & Palazzo Hail Award of $6.7M for Trent Lott International Airport Runway... RESTORE Act Project to Upgrade Capacity of Runway to Accommodate Larger Planes wicker.senate.gov", "2019-08-30T17:01:32.000Z": "The 2019 Public Waters Alligator Hunting Season officially opens in Mississippi Friday at noon. The season will open for ten days and will close at noon on Monday, September 9th. Alligator hunting season opens Friday in Mississippi A total of 960 permits in seven hunting zones across the state were offered in two random drawings. This is the 15th year of public waterway alligator hunting in the state and wildlife officials say... wlbt.com", "2019-08-30T14:54:56.000Z": "The Mississippi 2nd Amendment Sales Tax Holiday runs through Sunday. The Mississippi 2nd Amendment Sales Tax Holiday runs through Sunday! - News Mississippi If you're getting ready for hunting season, through Sunday, you can save during Mississippi's Second Amendment Sales Tax Holiday. The 2019 Mississippi's Second Amendment Sales Tax Holiday takes place... newsms.fm", "2019-08-29T21:26:16.000Z": "Thank you, Mr. President! Quote Tweet Donald J. Trump @realDonaldTrump Establishment of the U.S. Space Command! https:// pscp.tv/w/cDgvDzFvTlFs TFJub1dwUXd8MVlwS2tZT25ydndKaqLw3mezwKw0VQi2Zsx-aLO0MB7bgfwiy9LSKAHHj_kK?t=2s ", "2019-08-29T16:53:37.000Z": "We were one of two states in the country to receive funding for more than one proposal. Thank you @SecElaineChao , @USDOT and our MS CODEL for being apart of the Summit and for their work on choosing these projects.", "2019-08-29T16:51:25.000Z": "Very proud to have @SecElaineChao on the MS Gulf Coast today for the Coastal Regional Transportation Summit. She just announced that Mississippi received 2 funding awards in the Competitive Highway Bridge Program.", "2019-08-29T13:00:00.000Z": "We remember those effected by Hurricane Katrina. 14 years ago today, Katrina made landfall on the Mississippi Gulf coast. This storm showed the strength and resilience of Mississippians who fought hard to help those impacted recover. We will never forget.", "2019-08-28T23:20:11.000Z": "I commend President Donald J. Trump's nomination of Judge Cory T. Wilson to serve as a U.S. District Judge for the Southern District of Mississippi. His integrity and respect for the rule of law makes him an excellent choice for the federal bench.", "2019-08-28T18:05:30.000Z": "SWIB Executive Director, Dr. Laurie Smith, participated in a panel on Technology and The Workforce of Tomorrow at the University of Mississippi's Tech Summit! #PrepareConnectSustain  #MSWorks", "2019-08-28T18:58:09.000Z": "Under the leadership of President @realDonaldTrump , America is more prosperous, our military is stronger, and our veterans are getting the care and respect they deserve! Our Administration will ALWAYS stand with the amazing men and women of our Armed Forces.", "2019-08-28T15:41:26.000Z": "Bank City @MyTupelo is growing with the Mississippi economy. Quote Tweet CDF @CDFMS Bank City USA is Growing Again! | Governor of Mississippi, @PhilBryantMS , discusses the opportunities & growth in the #financial sector in Tupelo with the new expansion by @MyBXS . | Bank City USA from @ababankers : http:// cdf.ms/bankcityusa | PRESS RELEASE: http:// cdf.ms/bancorpsouth", "2019-08-28T03:44:09.000Z": "Congratulations to @lynnfitch for winning the republican nomination for attorney general!", "2019-08-28T03:25:58.000Z": "The Chairman is right. It is time for all Republicans to come together to elect Republicans to every Statewide Office in Mississippi. \"Together Forward\" Quote Tweet Lucien Smith @LucienSmith Now is the time to unite to ensure a @GOP victory in November! #mspol  #mselex Show this thread", "2019-08-28T01:59:48.000Z": "I am proud that my friend and Lt. Governor @tatereeves has won the Republican nomination for Governor! I look forward to supporting him and his continued efforts to be the next Governor of Mississippi. I commend Justice Waller on a well run campaign.", "2019-08-27T22:20:05.000Z": "Payrolls continue to rise in Mississippi. Let's continue the momentum #MSWorks Payrolls continue to rise in Mississippi Payrolls in Mississippi grew in July, continuing a positive trend for the state over the past year.  The total number of employees on nonfarm payrolls in the state increased to 1,171,700 according to... mspolicy.org", "2019-08-27T17:00:00.000Z": "There are 7 hours left to vote for @tatereeves to be the Republican Candidate for Governor. #PrimaryRunoff  #ImForTate", "2019-08-27T13:00:01.000Z": "Be sure to get out and vote in the Republican Primary Runoff. The polls stay open until 7 PM.", "2019-08-26T19:07:50.000Z": "If you want a hardworking conservative Governor- @tatereeves is your guy. Vote tomorrow. #PrimaryRunoff  #ImForTate Quote Tweet Tate Reeves @tatereeves From DeSoto County to the Gulf Coast, working hard to earn the vote of every Mississippian on the final day before the runoff. Stop #1: Olive Branch", "2019-08-26T14:47:58.000Z": "29 counties are now eligible for federal assistance following February storms. 29 counties eligible for federal assistance following February storms - News Mississippi Information provided by the Mississippi Emergency Management Agency The Federal Emergency Management Agency (FEMA) has approved Issaquena, Sharkey, Warren, and Yazoo Counties for Public Assistance... newsms.fm", "2019-08-25T14:39:15.000Z": "JUST NOW: President @realDonaldTrump and Prime Minister @AbeShinzo announced a trade deal. \n\n\"This is a tremendous deal for the United States. It's a really tremendous deal for our farmers.\"", "2019-08-24T20:50:10.000Z": "Congratulations Jackie. Worlds best chef. Quote Tweet Mike Lacy @MikeLacyWLOX And the winner of the world food championships final table with a $100,000 grand prize is Jackie Seavey of Island view Casino resort!", "2019-08-24T17:03:40.000Z": "Saturday morning is soccer time for grandson Henry.", "2019-08-23T22:51:28.000Z": "This happens every election. Democratic operatives always spread this lie about Republicans.  Did it to me.  Didn't work then, won't work now. Quote Tweet Tate Reeves @tatereeves You may have seen a post or heard from Democrat lobbyists pushing a lie on my position on PERS. I support the \"13th check.\" Anything else you see or hear is, pure and simple, a lie.", "2019-08-23T18:47:01.000Z": "The @fema has approved Issaquena, Sharkey, Warren, and Yazoo Counties for #PublicAssistance which is in response to the February 22-24 #SevereStorms , #Tornadoes and #Flooding that impacted the state. For more info visit our website: https:// bit.ly/2YwhEPA", "2019-08-23T17:01:58.000Z": "#SmallBusiness owners gave Mississippi an A+ this year, ranking third in @thumbtack 's small business friendliness survey. We're always proud to support our small businesses - they're a big reason why #Mississippi is such an amazing place to live! http:// bit.ly/ThumbtackSurvey  #MSWorks", "2019-08-23T15:25:51.000Z": "Thanks Congressman @BennieGThompson and @RepMichaelGuest for this summit. Thousands of new physicians are needed-that's why we built a new medical school and increased funding for Rural Physicians Scholarships. More to come. Congressmen host rural healthcare summit at UMMC - News Mississippi Yesterday, Congressman Bennie Thompson and Congressman Michael Guest hosted a 'Rural Healthcare Summit' at the University of Mississippi Medical Center School of Health Related Professions. The... newsms.fm", "2019-08-22T22:56:17.000Z": "Tennessee, Florida, and Texas have no individual income tax and are leading the nation in growth. Mississippi should join them and phase out this tax while we are experiencing good economic times. Quote Tweet Yall Politics @MSyallpolitics . @tatereeves on increasing gax tax aka use tax: The Busby was adding 12 cent to gas tax, 3 cents per year over 4. Says he's opposed to raising gas tax--but would be happy to eliminate individual income tax. #MSGOPGOVDebate  #msgov  #mselex", "2019-08-22T17:24:23.000Z": "", "2019-08-22T17:22:48.000Z": "A Toyota Corolla rolls off the line every 75 seconds. Glad to be with over 2000 hard working employees here at Toyota in Blue Springs, Mississippi. #OneTeamToyota", "2019-08-22T15:36:50.000Z": "BancorpSouth Bank is increasing capacity at its Jackson Street Campus in Tupelo to accommodate the company's rapid growth. The project represents a corporate investment of more than $15 million and will create 100 jobs. #MSWorks  @MyBXS  @mdaworks", "2019-08-22T13:53:31.000Z": "Tate Reeves showed a command of issues important to conservative republicans. That's why I am voting for @tatereeves for Governor. Quote Tweet Team Tate! @TeamTateReeves \"I think Obamacare was a mistake. Judge Waller would expand it. I think raising taxes is a mistake. Judge Waller is for raising taxes. If you want a real conservative leading us into November, I'm your guy.\" - @tatereeves  #msgopgovdebate  #mselex  @WJTV", "2019-08-21T21:57:10.000Z": "There is only one Republican candidate for Governor who agrees with the President on this issue. I am for @tatereeves . Quote Tweet Drew Snyder @SnyGuy In his latest budget narrative, @RealDonaldTrump called provider taxes a \"financing gimmick\" that leads to inefficient Medicaid spending. He also called for a repeal of Medicaid expansion.", "2019-08-21T21:17:56.000Z": "Well done Mr. President! This is great news for our disabled veterans. @realDonaldTrump Quote Tweet The White House @WhiteHouse President @realDonaldTrump is directing @usedgov to eliminate all federal student loan debt owed by American veterans who are completely and permanently disabled.", "2019-08-21T18:58:26.000Z": "Facts do matter. Even in politics. Quote Tweet Drew Snyder @SnyGuy Why is it relevant that the Trump Administration mentioned repealing expansion and reducing provider taxes? Because the MHA Cares proposal calls on @MSMedicaid to get permission from the Trump Administration for a waiver to expand Medicaid through increased provider taxes.", "2019-08-21T14:36:08.000Z": "To learn more about how you can get involved with @ExtraTable please visit the link below. https:// extratable.org/partnered-agen cies/ ", "2019-08-21T14:34:47.000Z": "It was an honor to attend my official retirement dinner benefiting the @ExtraTable Foundation. Thank you to all that attended and raised money to help feed people in need. It was a blessing to look back at my time in public service. @robertstjohn", "2019-08-20T20:48:51.000Z": "Great American Hero from Mississippi. Thank you @SenHydeSmith . A True Mississippi Hero: Hyde-Smith presents highest civilian defense medal to Jay Blount of... Photo: (From left:  son and daughter-in-law Heath and Megan Blount; grandson Sutton Blount; daughter Jade Melton; Sutton; Hyde-Smith; LTC Deidre D. Smith, Mississippi National Guard; and Col. Marc... newsms.fm", "2019-08-20T19:44:35.000Z": "Proud to join my friend @tatereeves at a press conference to show my support for him to be the next Governor of Mississippi. #ConservativeSolutionsWork  #ImForTate", "2019-08-20T15:16:59.000Z": "@GlennMcCJr  @FirstLady_MS  @mdaworks  #AvidBoats", "2019-08-20T15:10:30.000Z": "Boat manufacturer Avid Boats is locating a new production facility in Amory. The project is a $1.6-million corporate investment and will create 75 jobs. Great to attend this announcement today. #MSWorks", "2019-08-19T22:08:22.000Z": "Great meeting with Mr. Hikomitsu Noji chairman of @YokohamaTC Mississippi Manufacturing today. @mdaworks  #MSWorks", "2019-08-19T19:07:20.000Z": "Thank you Senator, I appreciate our congressional delegation's hard work on this issue. Quote Tweet Senator Roger Wicker @SenatorWicker Decades ago the United States Congress made the people of Mississippi a promise. But that promise has not been kept. It is time to #FinishThePumps . https:// wicker.senate.gov/public/index.c fm/2019/8/wicker-it-is-time-to-finish-the-yazoo-pumps ", "2019-08-19T17:00:01.000Z": "Together, Lieutenant Governor @tatereeves and I have cut taxes over 50 times. #ConservativeSolutionsWork", "2019-08-19T15:15:25.000Z": "Mississippi was ranked the No. 1 state in America where you get the most for your money. #MSWorks Quote Tweet Tax Foundation @TaxFoundation Which states offer the biggest \"bang for your buck?\" http:// bit.ly/31N6fM3", "2019-08-18T13:28:06.000Z": "Mississippi has had a strong relationship with Israel for many years. The anti-Semitic behavior we now see from Democrats in our Congress is extremely troubling. #neveragain", "2019-08-16T18:00:51.000Z": "In 2019 there has been more than $668.9 million of private capital invested in #Mississippi , leading to 3,926 new jobs. Onward and upward!!  #MSWorks", "2019-08-17T18:53:02.000Z": "Beautiful day for the @msbookfest . Be sure to stop by this great event.", "2019-08-17T16:28:23.000Z": "If it walks like a duck, quacks like a duck- it's probably a duck. Quote Tweet Russ Latino @RussLatino I don't care if you call it \"Obamacare,\" \"PenceCare,\" or \"DaydreamCare,\" the Indiana Medicaid expansion that @BillWallerMS & @RobertFoster4MS are using as an example increased the cost of Medicaid in the Hoosier state by $5 billion (50%). #mselex", "2019-08-17T13:00:01.000Z": "Today marks 50 years since Hurricane Camille made landfall on the Mississippi Gulf Coast. This day changed many lives forever. We remember those who were impacted by this storm.", "2019-08-16T23:01:13.000Z": "More great work by @SenHydeSmith to protect our border.  Will mean a boom for Airbus Helicopters in the Golden Triangle.", "2019-08-16T16:58:11.000Z": "Very proud of all those that are Completing to Compete. Over 1,250 Mississippians have received college degrees through the program. Many more are on the way to success. C2C Success Blog Short, easy to access tips and success stories msc2c.org", "2019-08-16T13:48:39.000Z": "Initially #HurricaneCamille was forecast to turn northeastward toward the Florida panhandle. Instead, it continued northwest and rapidly intensified after leaving Cuba. Its eye contracted to a diameter of less than 8 miles, and strong rainbands developed. #WeRemember  #50Years", "2019-08-15T18:30:15.000Z": "I'm encouraged to see the continued reports of growing interest of our local jobseekers in these open poultry plant jobs. Quote Tweet The White House @WhiteHouse After @ICEgov recently removed illegal immigrants working at Koch Foods' plants in Mississippi, Americans are applying for the open jobs. https:// breitbart.com/politics/2019/ 08/13/americans-apply-jobs-koch-foods-after-ice-raid/ ", "2019-08-15T20:26:33.000Z": "Mississippi students made gains in all tested subjects and grades. Mississippi legislators, teachers, and students have worked hard. Let's continue the momentum. Student Achievement on Statewide Assessments Reaches All-time High The Mississippi Department of Education (MDE) released today statewide results from the 2018-19 Mississippi Academic Assessment Program (MAAP), which shows student achievement has reached an all-time... yallpolitics.com", "2019-08-15T18:24:31.000Z": "Clay is a long-time friend and great leader in the medical community.  He will do a great job. Congratulations Doc. Quote Tweet Jackson Heart Clinic @JacksonHeartMS We would like to congratulate Dr. Hays on being selected as the Mississippi State Medical Association's incoming president. We are proud of all of his accomplishments! #Congratulations  #JacksonHeartClinic  #MSMA", "2019-08-15T12:49:18.000Z": "Another example of support from our federal partners. Mississippi gets $2 million to modernize 911 systems - News Mississippi Mississippi will get nearly $2 million as part of a grant program to modernize and improve 911 systems across the state.  Announced by the U.S. Department of Commerce and the U.S. Department of... newsms.fm", "2019-08-15T00:05:12.000Z": "Public Safety has been vital in our administration-with 4 trooper schools, the School Safety Act, Human Trafficking Law, overdose deaths decreasing by 13%, and a 22% reduction in prescription drugs. We are working to make Mississippi safer than ever before.", "2019-08-14T14:21:47.000Z": "", "2019-08-14T14:15:51.000Z": "Some Republicans in Mississippi want Democrat style Obamacare expansion like @kamalaharris . But the question, as always, is who is going to pay for it? This nice lady seems to have it figured out. Quote Tweet Ronna McDaniel @GOPChairwoman Kamala Harris isn't fooling anyone on health care.\n\nHere's one of Iowa's seniors calling her out for her socialist plan.", "2019-08-14T01:23:46.000Z": "When all the do better politicians talk about Health Care they should remember these amazing young Physicians. #1000by2025 . Quote Tweet LouAnn Woodward M.D. @LAWoodwardMD Now that our 2019 1st-year medical students (165 strong!) are fully oriented and have started their journeys toward an MD, I think it's a good time to remember that MOST of them will end up practicing right here in their home state after finishing their medical education. (1/3) Show this thread", "2019-08-13T14:02:00.000Z": ". #HeatAdvisory is in effect statewide again today until 8PM. Expect indices between 110-117. Make sure you have a cool place out of the heat, and water if outside. #HeatExhaustion and stroke can happen if you're not adequately cooled and hydrated. https:// bit.ly/33vqiA1", "2019-08-12T20:03:12.000Z": "Interesting article you will probably only see reported by @MSyallpolitics Exceed Mississippi PAC run off dark money by Jim Hood insiders targeting Tate Reeves In recent weeks, Attorney General Jim Hood has been giving off the political vibe that he would almost rather see Reeves in a general election instead of Bill Waller.  But new details have come to... yallpolitics.com", "2019-08-12T16:33:19.000Z": "I have declared this week Hurricane Camille 50th Anniversary Commemoration Week. This storm was the 2nd most intense hurricane to make landfall in the US. This week we remember those who were impacted by this storm. Quote Tweet msema @MSEMA This week we remember the devastating destruction of #HurricaneCamille . @PhilBryantMS has declared this week Hurricane Camille Anniversary Week to honor those whose lives were lost in the storm 50 years ago and remember the impact on MS. Find out more: https:// bit.ly/2YYDUAo", "2019-08-12T14:52:44.000Z": "I am glad to see this important legislation become law and support our veterans.\n\nAs we commemorate the American Legion's centennial this year, I appreciate the services and resources they've continued providing to our nation's veterans. Quote Tweet The White House @WhiteHouse President @realDonaldTrump has signed the LEGION Act, allowing the @AmericanLegion to extend benefits to 6 million additional veterans!", "2019-08-10T23:53:50.000Z": "Good work parents, teachers and administrators. Proud of Mississippi. Mississippi education gains good news for students, parents and employers BEFORE YOU GO  we'd like to ask for your support. More people are reading the Mississippi Business Journal than ever before, but advertising [...] msbusiness.com", "2019-08-10T22:41:41.000Z": "Just like AOC and \"the Squad\", Mississippi Democrats stand up for those who violate our federal laws and illegally cross our Border.  They degrade ICE and Border Patrol for doing their duty. I'm with Tate. @tatereeves Quote Tweet MS Democratic Party @msdemocrats Not a crime to be illegally present in this country; civil matter. Raids for #GOP leaders to use for PR victory laps doesn't sit well with anyone! Incl. one of @tatereeves own Pastors!\n\nThe law requires humanity, but it didn't happen here. #ICEraidsMS - https:// mailchi.mp/mississippidem ocrats/unhospitable-and-un-christian-says-tates-former-pastor ", "2019-08-10T20:06:14.000Z": "Great looking class of future physicians. The new medical school is paying off already for UMMC. Best wishes class of 2023. Quote Tweet LouAnn Woodward M.D. @LAWoodwardMD SOM Class of 2023 White Coat Ceremony! The start of something great! @UMMCnews  @UMMCAdmitMD", "2019-08-09T23:01:31.000Z": "People ask who will win the Republican Run Off.  Here's the map from primary election night. I'm for Tate. @tatereeves (photo @MSyallpolitics )", "2019-08-09T19:31:34.000Z": "State revenue reports are in and Mississippi had yet another month over revenue estimate. State revenue reports, yet another month over revenue estimate Total revenue collections for the month of July FY 2020 and Fiscal YTD 2020 through July are $27,085,255 or 8.88% above the sine die revenue estimate. Fiscal YTD total revenue collections through... yallpolitics.com", "2019-08-09T14:21:00.000Z": "This message from @USAttyHurst should help with concerns regarding the children. Quote Tweet U.S. Attorney Mike Hurst @USAttyHurst . @ICEgov  @DHSgov conducted yesterday's operation w/ respect & dignity for fellow man/woman.  HSI procedures ensured child/parent were united afterwards\n\nWe are unaware of any child presently w/o a parent as a result of this operation\n\nIf so, let us know & call CPS 800-222-8000 twitter.com/SDMSNews/statu", "2019-08-09T12:42:14.000Z": "Thanks @GovernorKayIvey . @JoeySongy has been my right arm as my Chief.  He will be missed as a dear friend to me and the people of this state.  But for all things there is a season.  I wish him all the best. Quote Tweet Governor Kay Ivey @GovernorKayIvey Congrats to @JoeySongy , Governor @PhilBryantMS 's chief of staff, for many years of good service.  Mississippi & Alabama compete on the athletic field - and in economic development - but we have a close relationship that crosses our state line.  Good luck, Joey!", "2019-08-08T22:58:32.000Z": "Tate Reeves stands strong against the Democratic Leadership.  That's why I am for Tate. @tatereeves Quote Tweet Tate Reeves @tatereeves . @IlhanMN , it is wrong to demonize the brave work of our law enforcement and @ICEgov . They put their lives on the line for us; all you do is tweet. I stand with law enforcement. Your no-borders vision is a non-starter in Mississippi. twitter.com/IlhanMN/status", "2019-08-08T21:58:36.000Z": "Thank you @USDA for this designation. I hope this will help all of the Mississippi Farmers who have been effected by the flood.", "2019-08-08T18:02:21.000Z": "Gov. Phil Bryant Chief of Staff @JoeySongy entering private sector.", "2019-08-08T16:48:33.000Z": "Mississippi showing strong job growth. You will probably only see it here. https:// bls.gov/regions/southe ast/news-release/businessemploymentdynamics_mississippi.htm ", "2019-08-08T13:39:13.000Z": "I will be live soon on the @Varneyco show. Tune in and listen. @FoxBusiness", "2019-08-08T00:24:33.000Z": "If you are here illegally violating federal laws, you have to bear the responsibility of that federal violation. I think @ICEgov is doing a great job, and I think @USAttyHurst is doing exactly what he should be doing, and I commend him for it. ICE raids on Mississippi food processing plants result in 680 arrests U.S. Immigration and Customs Enforcement (ICE) said Wednesday that its officers had raided seven food processing plants in Mississippi and detained approximately 680 \"removable aliens\" in what a... foxnews.com", "2019-08-07T22:18:03.000Z": "Today I announced and signed an Executive Order for the creation of the Mississippi Complete Count Committee for the 2020 Census. The Committee Chairman will be Giles Ward, the Vice-Chairman Dr. John Green, and Secretary Emily Kruger.", "2019-08-07T16:01:05.000Z": "Under Gov. @PhilBryantMS 's leadership MS has experienced: record low unemployment, 2 Gold Shovel Awards, over $8B in cap. investment & 85,000+ new jobs & the largest single private corp investment in MS history w/ @continentaltire . Thank you Gov Bryant for proving that #MSWorks !", "2019-08-07T15:32:54.000Z": "On this National Purple Heart Day, we remember and honor the sacrifices of the courageous men and women, of the U.S. Armed Forces, who have received this military decoration. They are true American heroes.", "2019-08-07T14:07:01.000Z": "Thank you for your leadership Mr. Chairman.  This was truly a historic day for the Republican Party in Mississippi. @LucienSmith Quote Tweet Lucien Smith @LucienSmith For the first time, more people chose to vote in the Republican primary than the Democrat primary. To every R activist who made a call, attended a meeting, or asked a local D to switch parties, THANK YOU!  Let's keep the momentum up through the fall to win up and down the ticket!", "2019-08-06T22:00:09.000Z": "Reminder: polls are open until 7:00 p.m. Get out and vote! @tatereeves  @DelbertHosemann  @MichaelWatsonMS  @DavidMcRaeMS  @NicLott  #PrimaryElection  #Vote", "2019-08-06T16:28:08.000Z": "This morning @VanJones68 leads a discussion on #criminaljustice reform w/ state leadership incl. Gov. @PhilBryantMS (MS), Sen. @JeffreyBrandes (FL) & @AKShelleyHughes (AK), Rep. @NickZerwas (MN) & Assem. @SteveYeagerNV (NV). \n\nTune into our Live Stream: https:// facebook.com/pg/NCSLorg/vid eos/?ref=page_internal ", "2019-08-06T14:19:53.000Z": "Follow the link below to hear @VanJones68 and I speak on criminal justice reform. #NCSLsummit Quote Tweet NCSL @NCSLorg In one hour, hear from @REFORM CEO @VanJones68 & Gov. @PhilBryantMS on #criminaljustice reform. Join @NCSLorg in @NashvilleMCC Davison C. #NCSLsummit  https:// bit.ly/2ZEPC4y", "2019-08-06T12:39:44.000Z": "Be sure to get out and vote Republican today. Polls stay open until 7:00 p.m. #PrimaryElection", "2019-08-05T22:57:56.000Z": "Thanks Brett. You can count on me. I am for Tate. @tatereeves  @BrettFavre Quote Tweet Brett Favre @BrettFavre To my fellow Mississippians, as we head to the Polls tomorrow for the primary election for Governor, I hope you'll join me in Voting for @tatereeves , a friend and family man who is committed to making our state a better place. #msgov", "2019-08-05T21:50:28.000Z": "Well said Spencer. I am supporting @MichaelWatsonMS . Quote Tweet Spencer Ritchie @SpencerMRitchie This whole @MichaelWatsonMS not supporting @realDonaldTrump thing is silly. I helped organize the @MSGOP delegation to @GOP convention in Cleveland and Michael was there & part of unified delegation to support and see Pres. Trump receive nomination.", "2019-08-05T17:42:13.000Z": "I signed an executive order this morning asking that all flags in our state be lowered in compliance with the Presidents orders.", "2019-08-05T14:22:36.000Z": "President Trump: \"Together we lock arms to shoulder the grief. We ask God in heaven to ease the anguish of those who suffer and we vow to act with urgent resolve\"", "2019-08-05T13:35:00.000Z": "No candidate is working harder than @tatereeves .  He has earned our vote to be the next Governor of Mississippi. Quote Tweet Tate Reeves @tatereeves Great breakfast stop with folks this morning at Dixie Depot in Hurley! Even this bright and early, people are energized and ready for the primary tomorrow! #msgov  #mselex", "2019-08-05T12:38:30.000Z": "This is a story that is just now being told.  We have been working since March to finish the pumps. Quote Tweet Fox News MMR @FoxNewsMMR #ICYMI : @chuckreports tells the story of Southern farmers suffering after widespread flooding prevents crops from being planted this year", "2019-08-04T21:27:44.000Z": "I have asked that all flags in our state be lowered in compliance with the Presidents orders.  A state executive order will be issued. The nation mourns the tragic deaths. Quote Tweet Donald J. Trump @realDonaldTrump ....The flags at the White House will be lowered today through Thursday, August 8. Melania and I are praying for all those impacted by this unspeakable act of evil! Show this thread", "2019-08-04T15:21:38.000Z": "Texas and Ohio are in our prayers this morning. Amen Governor. Quote Tweet Greg Abbott @GregAbbott_TX Now in the beautiful city of El Paso. \n\nTexans grieve today for the people of this wonderful place. \n\nWe unite in support of all the victims. \n\nWe thank First Responders for their swift action. \n\nWe ask God to bind up the wounds of all who've been harmed.", "2019-08-04T02:55:47.000Z": "Deborah and I are praying for the families affected by this evil attack on innocent lives, as well as the entire El Paso community. Mississippi has a heavy heart for Texas tonight.", "2019-08-03T18:36:27.000Z": "Sen. Watson has always been a Republican and a conservative.  He has my support and vote. @MichaelWatsonMS Quote Tweet Michael Watson @MichaelWatsonMS In the MS Senate, I fought for conservative issues like lower taxes, better schools, & fighting illegal immigration. Now, I'm running for Secretary of State to help more businesses and families in MS. #MWforSOS  https:// bit.ly/2WWaqam", "2019-08-03T13:34:47.000Z": "Proud to see this bold new leadership from my Congressman. @RepMichaelGuest Congressman Guest passes first bill on House floor - News Mississippi This afternoon, Congressman Michael Guest became the first freshman Republican Member of the House of Representatives in the 116th Congress to pass a piece of legislation on the House floor. That... newsms.fm", "2019-08-02T22:00:05.000Z": "Great new video from @steveazar . #OneMississippi STEVE AZAR -ONE MISSISSIPPI Hey everyone, The official Mississippi Bicentennial song is now available to stream! Back in 2017, the Mississippi Governor Phil Bryant asked me to write the... youtube.com", "2019-08-02T19:36:43.000Z": "Congratulations to my friend Kelly Craft on her recent confirmation as the new US Ambassador to the United Nations. We are fortunate to have an outstanding leader in such an influential post. @USAmbCanada  @LordAshcroft", "2019-08-02T16:18:44.000Z": "Thank you @SenHydeSmith and @SenatorWicker . Let's finish the pumps. https:// hydesmith.senate.gov/hyde-smith-wic ker-introduce-bill-rein-clean-water-act-veto-authority ", "2019-08-02T14:26:53.000Z": "Thank you @SenatorWicker for introducing this legislation that would make improvements to provide fishermen with disaster relief more quickly. Quote Tweet Senator Roger Wicker @SenatorWicker \"I appreciate Senator Wicker's support for the Mississippi Gulf Coast... These changes will certainly improve the process for Federal Fisheries Disaster Declarations & will provide... assistance in a timely manner to those affected.\" - @PhilBryantMS  https:// wicker.senate.gov/public/index.c fm/2019/8/what-they-are-saying-mississippi-officials-groups-applaud-wicker-s-fishery-fundd-act ", "2019-08-02T01:34:55.000Z": "I agree completely. I expect the 5th Circuit and then the Supreme Court will uphold the ruling that Obamacare is unconstitutional. Then the states will pay 100% of the cost of the expansion. https:// foxnews.com/opinion/ken-pa xton-obamacare-supreme-court-fifth-circuit-texas-california  Quote Tweet AFP Mississippi @afp_ms Great time with our freedom fighters at Neshoba County Fair. Lotta Medicaid expansion talk. Adding 300,000 people to Medicaid is bad policy. Lift regulations to increase the supply of healthcare, don't put more burdens on hardworking taxpayers #ncf2019", "2019-08-01T22:59:32.000Z": "Sweet Child. No doubt who she favors. We are blessed @sidsalter . Quote Tweet Sid Salter @sidsalter Our granddaughter Alline Gregory had a guest today at the fair cabin. It is Alline's first Neshoba County Fair, but Gov. Phil Bryant's final speech here as governor after a total of 35 years of public service. Saw a lot of old friends today and treasure another year at Neshoba.", "2019-08-01T19:28:27.000Z": "The First Lady and I enjoyed meeting with Choctaw Tribal Chief Cyrus Ben. @FirstLady_MS", "2019-08-01T16:48:45.000Z": "I am live now with @tatereeves on the @thejtshow . Great day here at Neshoba!", "2019-08-01T16:41:31.000Z": "Just finished my last speech as Governor at the Neshoba County Fair.", "2019-08-01T13:25:10.000Z": "Thanks @SenatorWicker and @SenHydeSmith . This must be done and soon by the EPA. #FinishThePumps Quote Tweet U.S. Senator Cindy Hyde-Smith @SenHydeSmith We need @EPA to act, but I've also introduced a new bill to prohibit the EPA from vetoing congressionally-approved @USACEHQ flood control projects. This bill would immediately nullify the veto preventing pump construction in the Yazoo Backwater. Show this thread", "2019-07-31T22:03:14.000Z": "Please join me tomorrow at the Neshoba County Fair at 10:40 a.m. for my last speech as Governor. Great environment and even better hospitality. @neshoba_ms", "2019-07-31T21:42:01.000Z": "Thank you @SenHydeSmith for fighting for the Mississippi Delta. Listen below to hear her speak on the Senate floor. Quote Tweet U.S. Senator Cindy Hyde-Smith @SenHydeSmith Shortly I will speak on the Senate floor about the Yazoo Backwater Flood and my latest attempt for a solution. Watch here: https:// senate.gov/legislative/fl oor_activity_pail.htm ", "2019-07-31T20:47:33.000Z": "Great report. We're putting more Mississippians to work, who are generating more revenue for our state. Quote Tweet Tate Reeves @tatereeves How do you know our economy is booming? Largest tax cut in Mississippi history, and revenue is WAY up! First month of our budget year, it's up $23.2 million above projections. About 8% higher!", "2019-07-31T18:30:28.000Z": "Good job here by @henryrodgersdc . Honest and credible reporting is the wind at freedoms back. Quote Tweet Henry Rodgers @henryrodgersdc My latest for @DailyCaller featuring @Nigel_Farage , @PhilBryantMS , & more! A global Brexit movement is here: https:// dailycaller.com/2019/07/26/ame ricans-flock-to-brexit-movement-trade/ ", "2019-07-31T16:00:22.000Z": "If they're a company that's looking for a home, looking for employees that are dedicated, that are hardworking, that come to work everyday, that really care about the quality of their work - they ought to come & try MS.\" - Pete Rinaldi, VP General Atomics #MSWorks  #InTheirWords", "2019-07-30T20:24:10.000Z": "Good work by the law enforcement officers involved in today's incident. We need more of this training for all P.D's and S.O's. Training saves lives. Quote Tweet Joneé Lewis WREG @JoneeLewisTV \"The training that we did paid off today.\" Southaven Police officers underwent active shooter training just ten days ago. Today that training was put to the test. @3onyourside  #walmartshooting", "2019-07-30T16:31:29.000Z": "MS Bureau of Investigation has responded to assist Southaven P.D. and Desoto County S.O.  Please keep the victims, families and officers in your prayers.  Tragic day for Southaven and all of Mississippi. Two dead after shooting at Southaven Walmart - News Mississippi An early morning shooting at a Walmart in Southaven turned deadly. According to multiple reports, two people are dead and two more have been wounded. Dozens of police cars from the Southhaven Police... newsms.fm", "2019-07-30T12:58:33.000Z": "Excellent reporting @MSyallpolitics on MWF, an affiliate of NWF, and their drifts to Climate Change ideology.  We should #finishthepumps and save the Delta. MS Wildlife Federation Extravaganza melts down over opposition to #FinishThePumps A Mississippi Delta farmer, hoping to spread awareness about the impacts of the expansive flooding, was denied the right to purchase a booth at the Mississippi Wildlife Federation's Wildlife Extrav... yallpolitics.com", "2019-07-29T23:26:57.000Z": "I agree Mr. President.  #MAGA Quote Tweet Donald J. Trump @realDonaldTrump Senator Cindy Hyde-Smith is doing a GREAT JOB for the people of Mississippi and fully supports our #MAGA Agenda. Cindy is tough on Crime, Strong on the Border and Illegal Immigration.... Show this thread", "2019-07-29T18:43:48.000Z": "Great news! Thanks Senators. #LetsFly  @SenatorWicker  @SenHydeSmith Quote Tweet Senator Roger Wicker @SenatorWicker Six Mississippi airports are receiving $6.45M to make important safety and capacity upgrades that will improve service for thousands of travelers statewide. @SenHydeSmith  https:// wicker.senate.gov/public/index.c fm/2019/7/wicker-hyde-smith-announce-6-45-million-for-improvements-to-local-airports ", "2019-07-29T12:48:57.000Z": "Grands and niece enjoying the Mansion's water park.", "2019-07-28T19:19:04.000Z": "Thanks to @CommAndyGibson, @USDA , @realDonaldTrump and our Congressional Delegation. This is a great program for our Mississippi Farmers. Quote Tweet Commissioner Andy Gipson @CommAndyGipson Please help me spread this welcome news to all our Mississippi farmers, thanks to @realDonaldTrump and @SecretarySonny", "2019-07-28T15:54:39.000Z": "Please join me August 6th in electing Michael Watson as Secretary of State. Michael Watson When Governor Bryant needed help advancing his policy agenda in the Mississippi legislature, he called on me. I worked to balance our budget, protect our second amendment rights, introduced the... m.facebook.com", "2019-07-27T22:35:12.000Z": "I don't understand why MWF won't allow for this Individual to educate others on the backwater flooding issues and the pumps that could have saved a large portion of Mississippi's acreage and wildlife from devastating flooding.  Very disturbing. Mississippi Wildlife Federation denies flood victim a booth at its event Flood victim and farmer Victoria Darden planned to put up a booth at next week's Mississippi Wildlife Federation's annual fundraiser to raise awareness of the historic Backwater Flood. She collected... vicksburgnews.com", "2019-07-27T20:30:32.000Z": "The USACE has just notified me that all the flow from the Bonnet Carré Spillway has been stopped. Good news for the Gulf. @VicksburgUSACE", "2019-07-27T16:20:43.000Z": "This is what we expected this tax free weekend to accomplish. Don't forget to get out and shop to get your sales tax free items! Quote Tweet wdam @wdam Turtle Creek Mall was packed full of shoppers getting the bang for their buck for day one of the state tax free weekend. https:// wdam.com/2019/07/27/mis s-tax-free-weekend-begins/ ", "2019-07-27T13:28:57.000Z": "", "2019-07-26T21:18:04.000Z": "Glad to visit with former U.S. Ambassador to the UN @NikkiHaley at the @The_RGA quarterly meeting.  She did a great job as Ambassador and continues to Make America Great Again.", "2019-07-26T19:09:59.000Z": "Thank you @SenHydeSmith for stopping this.  I knew when I appointed her that Cindy was a fighter.  Now everyone will know it. Sen. Cindy Hyde-Smith stands up to Democrats trying to force passage of 'election security' bills Senator Cindy Hyde-Smith blocked rush passage of two election security bills following Robert Mueller's testimony regarding election meddling attempts on Capitol Hill yesterday. The two bills, penned... yallpolitics.com", "2019-07-26T15:22:33.000Z": "I am proud to endorse Nic Lott. He will make a great Public Service Commissioner. #LottforPSC Quote Tweet Nic Lott @NicLott Republicans who want to win PSC Central race in November know that there's only one candidate with a path to victory. That is why Governor Phil Bryant, Governor Haley Barbour, and Majority Leader Trent Lott have all endorsed my candidacy. #LottforPSC ad: https:// facebook.com/NicLottPSC/vid eos/385329718785276/ ", "2019-07-26T12:50:38.000Z": "This is great news for @NASAStennis in Hancock County.  We are standing by for the Green Run test for @NASA_SLS . Thanks to @SenatorWicker , @SenHydeSmith , and @CongPalazzo . Quote Tweet Jim Bridenstine @JimBridenstine . @NASA will do a Green Run test for @NASA_SLS prior to #Artemis 1. Here's why:\n\n Astronaut safety is our #1 priority\n Increases probability of a successful Moon landing in 2024\n It's important to discover issues earlier rather than later\n\nMore: https:// go.nasa.gov/2Y70nj9", "2019-07-25T22:25:41.000Z": "Proud to have joined my friends @Nigel_Farage and @peggy_grande in NYC at an event to support the fight for Brexit.", "2019-07-25T19:06:31.000Z": "Not tired of winning yet.. #winning Quote Tweet Trump War Room - Text TRUMP to 88022 @TrumpWarRoom Jeffrey Toobin on the #MuellerHearing : \"It certainly seems like Donald Trump is #winning \"", "2019-07-25T16:41:21.000Z": "Thank you Congressman.  The people in the Delta need our help. @BennieGThompson Quote Tweet Bennie G. Thompson @BennieGThompson Today, I wrote a letter to the President supporting the Governor's request for a major Disaster Declaration for Humphreys, Issaquena, Sharkey, Warren, and Yazoo.", "2019-07-25T14:11:52.000Z": "I have appointed former Federal Bureau of Investigation Special Agent in Charge Christopher Freeze as Executive Director of the Mississippi Department of Human Services. I am grateful he has accepted this appointment.", "2019-07-24T22:07:30.000Z": "Record payrolls in June. #MSWorks Mississippi employer payrolls again set new record in June JACKSON, Miss. (AP) - Preliminary data show Mississippi's employers set another new record for payrolls in June. Payrolls - which are economists' top labor market indicators - rose slightly... apnews.com", "2019-07-24T20:52:34.000Z": "So far this year 19,074 businesses have been created in Mississippi. #MSWorks Record Business Creation Seen in Presidential Battleground State Since President Trump was elected, business applications are thriving in New Mexico. bloomberg.com", "2019-07-24T17:13:05.000Z": "Tate stands with the President. #MAGA  #ImWithTate  @realDonaldTrump Quote Tweet Tate Reeves @tatereeves Our President @realDonaldTrump is leading the way on jobs, border security, and protecting the second amendment. As Governor, I'll have his back like he has all of ours in Mississippi. #2A", "2019-07-24T12:37:57.000Z": "I want to thank @SecElaineChao , @SenatorWicker , @SenHydeSmith , and @RepTrentKelly who truly made this happen for Mississippi. #ToyotaMississippi Quote Tweet Northeast Mississippi Daily Journal @DJournalnow A $52.4M project to create an 8.3-mile segment of highway to connect Mississippi Highway 76 and Mississippi Highway 25 in Itawamba County was announced Tuesday. https:// buff.ly/2YeQ4ok Show this thread", "2019-07-23T19:36:02.000Z": "Glad to see the RESTORE Act being used in such an effective way for the Mississippi Gulf Coast. Gautier secures $2.3 million grant to upgrade water and sewer system Gautier has been awarded a $2.3 million grant by MDEQ to install a new sanitary sewer system. wlox.com", "2019-07-23T16:51:09.000Z": "Great seeing @VP Mike Pence this morning at @The_RGA quarterly meeting. We talked about passing USMCA through Congress. It would be great for Mississippi and America.", "2019-07-23T14:57:24.000Z": "I was Lt. Governor when we passed the Sales Tax Holiday and signed the law this year to add school supplies to the list of eligible tax-free items. Be sure to get out this weekend and get your items sales tax free. Retailers gearing up for tax-free, back to school shopping Passed into law a decade ago, the Mississippi Sales Tax Holiday always felt a bit incomplete for back-to-school shoppers. While consumers would buy clothing, shoes and some accessories without paying djournal.com", "2019-07-23T01:29:56.000Z": "I sent a letter to @realDonaldTrump requesting a new Major Disaster Declaration for the Mississippi counties of Humphreys, Issaquena, Sharkey, Warren, and Yazoo. This disaster declaration will assist with recovery efforts in areas that have experienced severe flooding.", "2019-07-22T18:57:49.000Z": "And now we are building the rockets that will carry mankind to Mars. @NASAStennis  #HancockCounty Quote Tweet MS Depart. of Archives & History @MDAH_Official #OTD in history, the Apollo 11 lunar module, operated by Neil Armstrong and Buzz Aldrin, separated from the command module and began it's descent to the Moon's surface. All second stage boosters for the mission were tested at the Mississippi Test Facility in Hancock County. Show this thread", "2019-07-22T15:12:24.000Z": "This is good news for the Mississippi Gulf Coast. Corps closing bays at Bonnet Carré Spillway - News Mississippi Based on the reduced flows in the Mississippi River at Red River Landing, the U.S. Army Corps of Engineers, New Orleans District will begin closing bays at the Bonnet Carré Spillway this morning.... newsms.fm", "2019-07-21T22:52:53.000Z": "Buzz Aldrin, American Hero, still packs a punch. Quote Tweet Oliver McGee PhD MBA @OliverMcGee \"Why don't you swear on Bible Buzz Aldrin you walked on the moon!\" Lib Loon\n\n\"Will you get out of here, we'll CALL THE POLICE!\" Buzz \n\n\"You're a coward, a liar & a thief!\" Lib Loon\n\nBuzz SOCKA-PUNCH THE LOON in his face!\n\nRetweet That YOU STAND WITH BUZZ! @POTUS  @realDonaldTrump", "2019-07-21T16:38:15.000Z": "Mississippi's education reforms are helping improve student outcomes.  With all the services working together, children are coming to school ready to learn.  Keep up the good work teachers, parents, and caregivers. MDE: Students make significant gains on statewide assessment - News Mississippi According to the Mississippi Department of Education, the results of Mississippi's statewide assessment of learning in pre-K and kindergarten show the majority of the state's youngest students... newsms.fm", "2019-07-21T13:16:02.000Z": "The Scalia's are a wonderful family. I always enjoyed duck hunting with his Dad.  I welcomed Justice Scalia and his son John to spend the night in the Governor's Mansion.  I am sure Gene would do a great job as Secretary. Opinion | Gene Scalia's Winning Record Trump's Labor pick has the legal experience to navigate the bureaucracy. wsj.com", "2019-07-21T00:32:30.000Z": "Amen Senator. Thanks for standing with Israel. Quote Tweet Cindy Hyde-Smith @cindyhydesmith US Senate candidate, MS Rep. Omar is wrong.  Israel is one of America's greatest allies.  We should be doing all we can to support Israel. https:// foxnews.com/politics/omar- introduces-resolution-defending-boycotts-of-israel-likens-it-to-boycott-of-nazi-germany-soviet-union ", "2019-07-20T15:01:02.000Z": "50 yrs ago today, Apollo 11 landed on the moon & Stennis Space Center played a key role. We've come a long way since then, and as Gov. @PhilBryantMS loves to say \"To get to Mars, you gotta go through Hancock County.\" #MSWorks photo: S-IC on B1/B2 Test Stand in 1968 @NASAStennis", "2019-07-20T17:38:25.000Z": "Mississippi has over 43,000 job openings. The #MSWorks app and website is available to help you connect to jobs and training. #PrepareConnectSustain", "2019-07-20T13:43:11.000Z": "Finest military training base in America.  Proud of all who have served at Camp Shelby. Quote Tweet MS National Guard @nationalguardMS On this day, 102 years ago, the United States flag was raised for the very first time at Camp Shelby. Today we celebrate 102 years of service to our country! #nationalguard  #campshelby", "2019-07-20T01:32:12.000Z": "Bobby Morgan is one of the finest young men I know and he will be missed at our office.  The young men and women of the Governor's Staff become family and we rejoice at their success but are always sorry to see them go.  Godspeed Bobby. Quote Tweet Glenn McCullough Jr. @GlennMcCJr .... @BobbyHottyToddy  Morgan has served ... @PhilBryantMS , ... @mdaworks  our partners and the people of #Mississippi with extraordinary skill.  Thank you Bobby!  All the best in your new responsibilities with ... @atmosenergy ! #MSWorks", "2019-07-19T21:02:38.000Z": "Very proud of our homegrown companies. Mississippi's innovative entrepreneurs provide so many jobs across the state. Congratulations to @JonesCompanies for this recognition. The Most-Loved Company in Every State These companies have earned the respect of American consumers. finance.yahoo.com", "2019-07-19T16:16:23.000Z": "Proud to have attended this announcement in Greenwood, MS.", "2019-07-19T16:03:35.000Z": "The Middleby Corporation, a global leader in the foodservice equipment industry, is relocating @LynxGrills headquarters and manufacturing operations to the @VikingRange facility in Greenwood. $5-million corporate investment and will create 200 jobs. #MSWorks", "2019-07-19T14:32:53.000Z": "Proud of so many members of my staff who have left to pursue great opportunities. They work tirelessly to make Mississippi the best it can be.", "2019-07-18T21:56:23.000Z": "Mississippi is doing great things. #MSWorks Quote Tweet MS Dev. Authority @mdaworks Every dollar the state commits in economic development incentives generates almost $15 in private capital investment. Our disciplined approach grows our economy and has led to almost $620 million in private investment just this year. #MSWorks", "2019-07-18T16:22:57.000Z": "DEADLINE EXTENDED! Nominate a young employee to be featured in the upcoming MSWorks Magazine! https:// abpgcsp.wufoo.com/forms/m1b0pchd 040ton9/?fbclid=IwAR0KfaEghjX9Z3xCbJSz4CEygfwo7GqLJIRXzA_wnJMjAcaNOuWql4iB13g ", "2019-07-18T13:11:27.000Z": "This week I met at @Mississippi_DMR to discuss the Algal Bloom. The warnings issued refer to water contact only & do not prohibit recreational use of the sand portion of any beach. Off-shore, locally-caught fish and seafood are safe to enjoy as well in local businesses. Quote Tweet MDEQ @MDEQ MDEQ Maintains Water Contact Warnings Across Mississippi Gulf Coast-- @PhilBryantMS and @Mississippi_DMR Assure Public Local Seafood Safe for Consumption: https:// mdeq.ms.gov/mdeq-maintains -water-contact-warnings-across-mississippi-gulf-coast/ ", "2019-07-17T22:32:52.000Z": "Glad to meet with Austin this morning. He is doing a great job @RSLC . Quote Tweet Austin Chambers @achambersgop . @GiveGOP is a scheme that preys on the good intentions of activists. It was launched by a money processing firm on a registry that @RSLC owns. So today, we shut it down. We stand w/ @realDonaldTrump + @GOP as a partner to make @winred successful. It's vital to winning!", "2019-07-17T18:40:14.000Z": "Happy to have endorsement of Governor @PhilBryantMS :\n\n\"I'm proud to endorse my friend @NicLott for Public Service Commission.Nic's the only Republican w/a path to victory in November.He has my vote in August 6 GOP primary. It's time to pass the torch to new generation of leaders\"", "2019-07-17T19:02:55.000Z": "Looking forward to joining @NCSLorg in Nashville to speak about Criminal Justice Reform. Quote Tweet NCSL @NCSLorg Former Deputy Sheriff. State Representative. Lt. Governor. Hear from Gov. @PhilBryantMS , a leader in system-wide #criminaljustice reform on Tuesday, Aug. 6 in @VisitMusicCity . #NCSLsummit  https:// bit.ly/2VTGviu", "2019-07-17T14:25:53.000Z": "In eight years Mississippi has won six Silver and two Gold Shovel Awards by @AreaDevelopment for achievement in economic development. In 2019 we were one of only six states to be awarded the honor of receiving a Gold Shovel. A testament to our economic developers @mdaworks", "2019-07-17T12:17:46.000Z": "Good to be with two of my friends in Hattiesburg. #ImforTate  @tatereeves  @BrettFavre Quote Tweet Tate Reeves @tatereeves It's always a great day on the campaign when you get to spend some time with friends. I am truly blessed to call @BrettFavre and @PhilBryantMS my friends and have their support in my run for Governor!", "2019-07-16T18:30:18.000Z": "As I see and hear the criticism of @realDonaldTrump , I think back to his speech from December 9th, 2017 as we opened the Mississippi Museums. Please take a moment to listen to his words: Watch Trump's full speech at the Mississippi Civil Rights Museum President Trump delivered remarks at the opening of the Mississippi Civil Rights Museum on Dec. 9. washingtonpost.com", "2019-07-16T13:29:31.000Z": "Yesterday I had the honor of meeting with all the base commanders in Mississippi at Keesler Air Force Base.\nIt's important that I hear from the men & women leading our military installations. I want Mississippi to continue to be the most military friendly state in the nation.", "2019-07-16T01:14:00.000Z": "\"It is still shocking to see the sheer amount of water that we've got. It's been here since February, and most of these houses have been under water since May.\" Thanks for the coverage @VicksburgPost . Gov. Phil Bryant visits Eagle Lake, assesses flooding from the ground - The Vicksburg Post Gov. Phil Bryant toured the Yazoo Backwater Area Sunday afternoon to get a closer look at the problems at Eagle Lake and the rest of the flooded areas. Bryant, who had previously toured the area by... vicksburgpost.com", "2019-07-15T14:31:33.000Z": "Time for all of us to work together to finish the pumps. The South Delta has become an ocean.", "2019-07-14T19:27:17.000Z": "At Eagle Lake in Warren County this afternoon. This area and 550,000 acres of the South Delta have been under water since May. We need to finish the pumps..", "2019-07-14T15:31:35.000Z": "Headed to Warren County this morning to survey flood damage-We have been fortunate so far with this storm but localized flooding remains with more rain expected-Nearly half the deaths from flooding occur when automobiles are driven into high water-Please turn around & don't drown", "2019-07-14T00:42:33.000Z": "Good work here by a hard working  reporter. What is happening in the Delta and in the Mississippi Sound will be an ecological disaster for a generation. We are seeking a generational solution. Barry bad timing. Delta still reeling from floodwaters, and now this. The Delta, struggling with flooding since February, is expected to see another 6-12 inches of rain. \"Long-term solutions\" are needed, governor says. clarionledger.com", "2019-07-13T21:01:23.000Z": "Just completed latest update on Tropical Storm Barry.  More rain is coming and flooding will occur. Follow @MSEMA for storm updates. Quote Tweet Hugh Keeton @HughKeeton Live right now on @WLOX Gov. Phil Bryant is updating the impacts of Tropical Storm Barry.", "2019-07-13T20:42:23.000Z": "Speaking with @malkoff of @weatherchannel now about Mississippi's response to Barry.", "2019-07-13T17:40:29.000Z": "Tropical Storm Barry is now a hurricane. All Mississippians need to be informed and aware. Please follow @MSEMA for more information. Will be going on @FoxNews at 1 to speak with @ArthelNeville to provide an update.", "2019-07-13T13:38:09.000Z": "I will be on @FoxNews this morning with @cvpayne giving an update on Tropical Storm Barry. Please tune in at 10 and continue to follow @MSEMA for updates.", "2019-07-12T23:01:45.000Z": "Today at 4:40 I signed a State of Emergency proclamation for the affected areas of Tropical Storm Barry. Please be weather aware and folllow @MSEMA for updates.", "2019-07-12T18:23:09.000Z": "Please reach out to MDEQ if you have concerns about the safety of local dams during heavy rain fall. Quote Tweet MDEQ @MDEQ TS Barry is projected to move into SW MS and heavy rains are being predicted there and in other areas.  Keep an eye on dam structures and features.  Contact the MDEQ Dam Safety Program with concerns or notifications regarding potential dam failures:  1-855-264-6665. #damsafety", "2019-07-12T17:28:32.000Z": "Good advice from the American Red Cross. Red Cross offers prep tips ahead of Tropical Storm Barry - News Mississippi Ahead of Tropical Storm Barry, the American Red Cross offers some preparedness and safety guidance in anticipation of severe rain and flooding that is expected to hit Mississippi over the weekend as... newsms.fm", "2019-07-12T16:23:46.000Z": "A year ago I appointed @shadwhite as your State Auditor.  Very proud of his hard work and unquestionable integrity. Quote Tweet OSA @MSStateAuditor Check out this recap of Auditor @shadwhite 's first year in office as @MSStateAuditor", "2019-07-12T14:49:45.000Z": "I am working with @MSEMA this morning on latest plans in response efforts.  The public should have a personal storm plan and consider that flooding will be our major concern.", "2019-07-12T13:10:21.000Z": "Great work by @SenHydeSmith . You continue to make us proud. Quote Tweet Yall Politics @MSyallpolitics On the heels of the @ACUConservative endorsement of @tatereeves this week, the ACU is rolling out a statewide TV ad buy urging voters to thank @SenHydeSmith for continued support of @realDonaldTrump 's policies. #mssen  #mselex  https:// yallpolitics.com/2019/07/11/acu -makes-cindy-hyde-smith-related-ad-buy-in-mississippi/ ", "2019-07-12T03:22:54.000Z": "CGC Munro made by the best shipbuilders in the world at @HIIndustries in @PascagoulaCity Mississippi. Quote Tweet U.S. Coast Guard @USCG Earlier today, the @VP welcomed back CGC Munro from patrol as they offloaded $569 million of cocaine in San Diego. \n\nIf you missed it, you can still watch the live recording on the @USCGPACAREA FB page: http:// ow.ly/9Fhf50uYSH0", "2019-07-11T23:57:02.000Z": "To everyone on the Gulf Coast: As you make preparations to protect your homes & loved ones from flooding & the coming storm, it is imperative that you heed the directions of @FEMA , State & Local Officials. We are working closely w/ them. Please be prepared, be careful, & be SAFE!", "2019-07-11T22:33:45.000Z": "I am so honored to have chaired this amazing organization.  No one does more for public education than @EdCommission .", "2019-07-11T22:02:33.000Z": "Proud to have @amazon Fulfillment Center in Marshall County which will be hiring 850 Mississippians. Amazon Makes $700 Million Investment To Retrain 100,000 Of Its US Employees By 2025 Amazon announced they will be investing over $700 million into retraining a third of its US employees by 2025 dailycaller.com", "2019-07-11T21:18:29.000Z": "Barry is expected to produce total rain accumulations of 10 to 20 inches over southeast Louisiana and southwest Mississippi, with isolated maximum amounts of 25 inches. The rainfall forecast was trended up slightly in these areas. #Barry", "2019-07-11T20:33:51.000Z": "If I remember correctly this is the teachers union and does not represent the majority of the hardworking teachers across Mississippi. I never had their support running for Governor nor did I want it.", "2019-07-11T17:49:04.000Z": "Looking forward to joining my friend @VanJones68 on stage for @NCSLorg Summit next month. We are a proven example of how different political parties can come together on #criminaljustice reform-Listen to the #NCSLpodcast on why I care about this issue. https:// apple.co/2S9NfDO", "2019-07-10T21:05:35.000Z": "Updated graphic and timing on the #TropicalDepression  #Hurricane impacting Mississippi over the next few days. #MSWX Quote Tweet National Hurricane Center @NHC_Atlantic A #Hurricane Watch has been issued from the mouth of the Mississippi\nRiver westward to Cameron Louisiana for Potential Tropical Cyclone 2.  For more details see http:// hurricanes.gov or http:// weather.gov  @NWS  #PTC2", "2019-07-10T22:45:47.000Z": "The past month. @SecretaryRoss has been a supporter of Mississippi since his early days in office and I am certain @NOAA under his leadership will do all they can to help. 2/2", "2019-07-10T22:45:45.000Z": "I received a call today from @CommerceGov  @SecretaryRoss . We discussed the lingering effect of the storms this weekend & the flooding that will be prevalent in south Mississippi.  I updated the Secretary on the damages caused by fresh water entering the Gulf over 1/2", "2019-07-10T21:06:25.000Z": "So honored to have been Chairman of the Education Commission of the States. Great honor for Mississippi. @EdCommission  @ECS_Anderson", "2019-07-10T14:07:32.000Z": "The USMCA is a complete overhaul of NAFTA, which incorporates modern, strengthened, and rebalanced rules of trade and investment for North America. This is a win for Mississippi and the Nation. #USMCAnow  @realDonaldTrump  @WhiteHouse  @USTradeRep", "2019-07-09T21:15:57.000Z": "Congratulations to Cyrus Ben on becoming the new Chief of the Mississippi Band of Choctaw Indians. I know the tribe will continue to thrive and will benefit from your service and leadership. I look forward to working with you.", "2019-07-09T20:37:38.000Z": "As a lifetime member of the NRA this makes a difference to me, and I would add most Mississippians. Another well-earned endorsement. #ImforTate Quote Tweet NRA @NRA . @NRAPVF endorses @TateReeves for governor in the 2019 #Mississippi primary election. \"The @NRA wholeheartedly endorses Reeves for governor and looks forward to what he can accomplish in the state's highest office,\" said Jason Ouimet, chairman, NRA-PVF. https:// nrapvf.org/articles/20190 709/nra-endorses-tate-reeves-for-governor-of-mississippi ", "2019-07-09T18:15:54.000Z": "Today I have approved $500,000 from the State's GOMESA allocation to @SouthernMiss for the cost of testing and monitoring the waters of the Mississippi Sound. We will do all in our power to manage this disaster and keep the public informed.", "2019-07-09T15:02:17.000Z": "Thanks Commissioner King. Your leadership has been invaluable during times of natural disasters in South Mississippi. You have my full support for re-election. Quote Tweet TomKingMS @TomKingMS One of the roles I have as Transportation Commissioner is ensuring @MississippiDOT crews & coast residents are prepared for hurricanes. Working w/Gov. @PhilBryantMS & MEMA to make sure residents can evacuate before the storm & roads are cleared after! #ExperienceMatters", "2019-07-09T14:29:27.000Z": "Great year-end numbers. Republicans have cut taxes over 50 times in the last eight years. Thanks @tatereeves  @PhilipGunnMS Quote Tweet Yall Politics @MSyallpolitics Mississippi's FY 2019 ends over $300 million ahead of estimates #msleg READ MORE>> https:// yallpolitics.com/2019/07/08/mis sissippis-fy-2019-ends-over-300-million-ahead-of-estimates/ ", "2019-07-08T21:10:31.000Z": "Please be weather aware as the probability of a tropical storm has increased. Quote Tweet msema @MSEMA High probability (80%) that a #TropicalDepression will form by the end of the week over the northern Gulf of Mexico. Too early to determine impacts for #Mississippi . We will keep you updated as the system develops. Click here for useful preparedness info https:// bit.ly/2QF6tAw", "2019-07-08T19:31:22.000Z": "As I see and hear the criticism of @realDonaldTrump , I think back to his speech from December 9th, 2017 as we opened the Mississippi Museums. Please take a moment to listen to his words: Watch Trump's full speech at the Mississippi Civil Rights Museum President Trump delivered remarks at the opening of the Mississippi Civil Rights Museum on Dec. 9. washingtonpost.com", "2019-07-08T18:00:16.000Z": "I have received real-time information from @MDEQ & DMR & have been monitoring the beach closures. The closures refer to water contact & do not prohibit the use of the sand portion of a beach. Seafood in restaurants are unaffected & the MS Gulf Coast remains open for business.", "2019-07-07T14:15:29.000Z": "Such sad news about Lake Little.  A beautiful light has passed from this world far too soon. Deborah and I pray the dear Lord would assuage the pain and grief of her parents and family. Well-known Starkville teen dies following plane crash A well-known Starkville teenager and incoming University of Southern Mississippi student died Saturday from injuries sustained in a plane crash on the Ole Miss golf course in Oxford earlier in starkvilledailynews.com", "2019-07-06T16:24:14.000Z": "We are proud to have these soldiers home.  Best photo ever. Quote Tweet National Guard @USNationalGuard Photo of the Day: @RINationalGuard Airmen celebrate Independence Day by returning home to their families from their recent deployment. https:// ngpa.us/7320", "2019-07-06T14:07:07.000Z": "My youngest Grand takes his first ride at daycare. We are blessed.", "2019-07-06T00:45:32.000Z": "Right again Charles.  Sad but true. #MAGA Quote Tweet Charles R Porter @ChasRPorter Patriotism drives liberals crazy. twitter.com/PhilBryantMS/s", "2019-07-05T12:58:04.000Z": "President Trump reminds us once again that it is the people that Make America Great. Thank you Mr. President for your leadership and love for this Nation. Quote Tweet Donald J. Trump @realDonaldTrump A great crowd of tremendous Patriots this evening, all the way back to the Washington Monument! #SaluteToAmerica", "2019-07-04T19:05:25.000Z": "I'm for Tate. Republican Reeves Heavily Favored to Keep Miss. Governorship A just-completed Impact Management Poll showed Mississippi's stalwart conservative State Treasurer Tate Reeves in a commanding position to win both the Republican primary and general election for... newsmax.com", "2019-07-04T13:52:44.000Z": "Women were very prominent in founding of nation on July 4th 1776. One of those included Betsy Ross who handmade one of first flags to represent the nation's birth-Today we enjoy Independence Day & thank Betsy Ross & many patriots who helped make this the greatest nation on earth.", "2019-07-04T00:36:49.000Z": "Appreciate our entire Congressional Delegation for helping improve airports all across Mississippi. Let's Fly. Quote Tweet The FAA @FAANews . @USDOT and the #FAA announce a total of $4.8M in #AirportGrants to fund the improvement of #airport  #infrastructure and #operations across the state of #Mississippi . http:// bit.ly/2X2MZar", "2019-07-03T21:30:19.000Z": "Thank you @CongPalazzo . I am sure @SecretaryRoss will do all he can to help.  Your support will certainly help. Palazzo presses Secretary of Commerce for fisheries disaster declaration - News Mississippi Congressman Steven Palazzo has requested an update from the Secretary of Commerce. Palazzo sent the letter to Commerce Secretary Wilbur Ross asking for an update on the federal fisheries disaster... newsms.fm", "2019-07-03T17:44:53.000Z": "Unbelievable success these past 7 years in terms of housing. I appreciate the work of Scott Spivey and his team at the Mississippi Housing Corporation.", "2019-07-03T14:26:38.000Z": "Great conversation this morning with @SecretaryCarson . He thanked @mdaworks  @PortofGulfport for their hard work in meeting National Objective of job creation. Annual economic output associated with Port is $425 million. This will position us for success for decades to come.", "2019-07-03T13:18:34.000Z": "Ray you've been gone awhile but trust me our state doesn't long for the days of 9% unemployment and a 64% high school graduation rate or a pro-abortion Governor. #UnderNewManagement Quote Tweet Ray Mabus @SECNAV75 So Mississippi has a Space Force! Won't pay teachers a living wage, fails in education, pitiful on health care, tries to deny women control over their own bodies, suppresses voting rights but at least has a Space Force twitter.com/MaryPerezSH/st", "2019-07-02T19:29:16.000Z": "Well said Commissioner. We will stand with you to protect the people of Mississippi. Quote Tweet Commissioner Andy Gipson @CommAndyGipson Yesterday the State of Mississippi was sued in federal court by out-of-state interests seeking to block Mississippi's new meat labeling law.  My official statement attached", "2019-07-02T16:28:19.000Z": "Great to hear @US_EDA  @CommerceGov awarded City of Durant $413,592 to make electrical system improvements to provide reliable electric power to consumers in aftermath of the tornado that struck in 2017. Strong #infrastructure to make city resilient to future natural disasters!", "2019-07-02T15:13:25.000Z": "Yes! #Mississippi is taking steps to harness its incredible tradition and experience in #space . Thank you @PhilBryantMS . Even more reason to come study #space law @olemisslaw Mississippi plans its own space force, and a space economic development arm, Gov. Bryant announces The governor announced two state-backed space initiatives at a Monday event on the Coast. clarionledger.com", "2019-07-02T01:46:54.000Z": "If I remember correctly Sheriff Woody was smartest toy in the box. This is funny no matter who you are. Proud of announcements made.  We want our state to be prepared to contribute to security of this country in 21st century. We want our young people to work for @relativityspace Quote Tweet Mississippi Today @MSTODAYnews The latest from @MarshallRamsey :\n\nGov. Phil Bryant follows President Donald Trump's lead and introduces a Space Force. #Mississippi  http:// bit.ly/2JgehW2", "2019-07-01T18:56:08.000Z": "I believe that we have the capabilities to attract other space companies to invest in the state and the ability through our National Guard to use space technology to aid in defense and disaster response.", "2019-07-01T18:55:14.000Z": "Today I announced an economic development Space Initiative and the formation of the @nationalguardMS Directorate at the @Visit_INFINITY Science Center in Hancock County.", "2019-07-01T17:16:34.000Z": "Patrick Scheuermann named new leader of space initiative for MS. He is former director at Stennis Space Center. @sunherald", "2019-07-01T13:44:52.000Z": "Strange how some Metro media outlets report the Chism polls as factual and ignore Yall's. Partisans attack latest YP poll - media tries to bury it The old political saying \"a hit dog will holler\" is in full effect as the head of Chism Strategies penned a response to the Y'all Politics poll released earlier this week.  The Y'all Politics poll... yallpolitics.com", "2019-06-30T21:58:13.000Z": "Very proud of these National Champions.  They are the best of the best across America. Quote Tweet MS Highway Patrol @MSHwyPatrol Ladies and gentlemen, your 2019 National LawFit Champions- Mississippi Highway Safety Patrol", "2019-06-29T21:43:19.000Z": "I have been to the border and have visited with the brave men and women of @CBP  @DHSgov . This type of hate speech by the New York Times is outrageous and it's nothing but a whistle call to the criminal cartels that have caused this crisis. Quote Tweet Daily Caller @DailyCaller NYT Op-Ed Calls For Public Shaming Of Border Protection Agents https:// dailycaller.com/2019/06/29/new -york-times-public-shame-border-agents/ ", "2019-06-28T16:32:21.000Z": "When you are ready to run for Governor of Arkansas please put me down as a volunteer. Your dad was a big help to me and I can't wait to return the favor. Quote Tweet Kayleigh McEnany @PressSec Today I'll walk out the gates of the White House for the last time as Press Secretary with my head held high. It's been the honor and privilege of a lifetime to work with President @realDonaldTrump and his amazing team the last three and a half years. You're the best...Thank you!", "2019-06-28T15:37:57.000Z": "This is long-awaited good news. Let's keep moving forward in making the Mississippi Gulf Coast a great place to live and work. Quote Tweet Yall Politics @MSyallpolitics HUD verifies the Port of Gulfport has met its obligation for job creation #msleg READ MORE>> https:// yallpolitics.com/2019/06/28/hud -verifies-the-port-of-gulfport-has-met-its-obligation-for-job-creation/ ", "2019-06-28T15:25:32.000Z": "I appreciate the hard work and diligence by @SecretaryCarson and @HUDgov . This is an important milestone that shows the economic strength of the @PortofGulfport Quote Tweet Yall Politics @MSyallpolitics HUD verifies the Port of Gulfport has met its obligation for job creation #msleg READ MORE>> https:// yallpolitics.com/2019/06/28/hud -verifies-the-port-of-gulfport-has-met-its-obligation-for-job-creation/ ", "2019-06-28T12:30:21.000Z": "Republicans have cut taxes over 50 times in the last eight years and have $400 million in savings and $200 million more in revenue than last year. Thanks @tatereeves  @PhilipGunnMS  @MSGOP Quote Tweet Tate Reeves @tatereeves Like his fellow Democrat Bernie Sanders, Jim Hood is clear: he wants to raise taxes on the middle class and working families-specifically the gas tax. twitter.com/AmericaRising/", "2019-06-27T15:32:28.000Z": "Lt. Governor @tatereeves has worked hard for these numbers. I'm for Tate! Quote Tweet Yall Politics @MSyallpolitics New poll commissioned from @ImpactMG shows @tatereeves +30 over @BillWallerMS in primary and +12 over @HoodForGovernor in general election ballot. #mselex  #msgov  https:// yallpolitics.com/2019/06/25/new -yall-politics-poll-shows-tate-reeves-leading-primary-and-general-election-ballots/  Show this thread", "2019-06-27T14:17:08.000Z": "We must do all we can to advance marine education. Perhaps these young scientists can help stop the damage caused to our Gulf. @SouthernMiss and @Mississippi_DMR remain on the job. Quote Tweet Southern Miss Now @SouthernMissNow .@GCRL1's Marine Education Center teamed up with Pelagic Research Services to create the Ocean Science and Technology Camp at @USMGulfPark , designed to provide a gateway to a career in ocean science. @WLOX reported on the camp this week: https:// wlox.com/2019/06/25/fut ure-marine-scientists-tour-point-sur-research-vessel/ ", "2019-06-26T19:04:32.000Z": "Every year @usedgov recognizes outstanding high school seniors across the country to be selected as Presidential Scholars. 161 students were honored with 3 being from MS. Mr. Ruben Banks is the future of our State. We are all proud of you! Good luck at @AF_Academy .", "2019-06-26T14:45:51.000Z": "Proud to welcome @KRONE_NA to Olive Branch. We have more German foreign direct investment in Mississippi than any other nation.  45 good paying jobs for their new HQ. Quote Tweet MS Dev. Authority @mdaworks Germany-based @KRONE_NA , which has been doing business in the U.S. since 1973, is moving its North American headquarters to Olive Branch. The location will cost $1.5 million and employ 45 Mississippians. #MSWorks  http:// bit.ly/2KxuRTs", "2019-06-25T18:12:00.000Z": "Don't forget to dress for success when you attend the Mississippi Re-Entry Job Fair tomorrow. Here are some tips to help you pick the best outfit: https:// mdes.ms.gov/i-need-a-job/j ob-searching-resources/job-hunting-tips/dress-for-success/ "}