{"2020-07-30T17:38:02.000Z": "Tune in today! @41actionnews  Quote Tweet Dia Wall @DiaWall Excited to chat with @GovParsonMO about the things that impact our community most.\n\nLook for coverage on @41actionnews tomorrow.", "2020-07-30T15:16:45.000Z": "\"I love this state. I love the people of this state. I've been really blessed in my career to live the American dream.\" - Gov. @MikeParson  #mogov", "2020-07-30T14:57:10.000Z": "Our kids are our future, and we must work to provide them with the best education possible. Parson meets with Missouri school leaders to discuss reopening plans - Missourinet Missouri school officials have been putting a lot of effort into developing reopening plans designed to help protect staff, students and their families during the COVID-19 era. Gov. Mike Parson is... missourinet.com", "2020-07-30T14:50:30.000Z": "I love this state, and I will continue to work hard every day for the people of Missouri. 'I love this state;' Parson discusses re-election, leadership priorities ahead of primary ST. LOUIS (KMOV.com) -- Mike Parson is already the governor of Missouri, but if he wins in November it will be the first time he'll be elected to the position. kmov.com", "2020-07-30T01:07:40.000Z": "Each school district will have different reopening plans based on the local needs of the community and students.  \n\nWhether it's in-person, hybrid, or online, it's important that our students get back to learning the skills they need to be successful in the future.", "2020-07-30T00:58:43.000Z": "It was encouraging to hear from Springfield area education leaders on their plans to resume teaching. \n\nMissouri educators go above and beyond for their students, and I am confident in school districts to decide what's best for their communities. Gov. Parson backs Springfield Public Schools reopening plan Parson spoke with reporters after a private meeting with local education leaders Wednesday. news-leader.com", "2020-07-29T19:57:45.000Z": "It has been a challenging year, however, I am confident that Missourians will continue to push through these challenges and move our state forward.", "2020-07-29T17:40:10.000Z": "Enjoyed welcoming @GovParsonMO to campus today and visiting with him about our challenges. Thank you for asking and listening.", "2020-07-29T15:27:37.000Z": "We must get our kids back in the classroom. Governor Parson to meet with St. Louis area school districts to talk about reopening amid pandemic Governor Mike Parson will be in St. Louis Wednesday afternoon to discuss the re-opening of schools during the pandemic fox2now.com", "2020-07-29T15:20:51.000Z": "I will be giving an update at the @SGFChamber State of the State this morning starting at 11am. \n\nWatch the live stream: State of the State 2020 youtube.com", "2020-07-29T03:19:58.000Z": "Always a great time talking to folks at the Newton County Watermelon Feed in Neosho! \n\nSouthwest MO is ready to keep moving our state forward this November!", "2020-07-29T01:51:34.000Z": "New jobs are coming to Marshfield! @ArmstrongCeilng announced an $8 million expansion to its @acgiwood wood ceiling and wall operations. \n\nOur economy is recovering, and it's encouraging to see companies investing in our great state. Armstrong World Industries to expand operations in Marshfield; expected to add 130 jobs Armstrong World Industries has announced it is investing approximately $8 million to expand its Architectural Components Group Inc. wood ceiling and wall operations in Marshfield, ky3.com", "2020-07-29T00:21:34.000Z": "This week, I am meeting with Missouri educators around the state to talk through their reopening plans.  \n\nOur focus remains on the health and safety of students, staff members, and communities as a whole. It may not be easy, but we must have a plan to safely reopen schools.", "2020-07-28T19:38:36.000Z": "LATEST POLL: Team Parson has the momentum! #mogov New governor's poll has Parson ahead of Galloway by 9 points A new poll from Gov. Mike Parson's team showed the chief executive ahead of his likely Democratic opponent, Auditor Nicole Galloway. themissouritimes.com", "2020-07-28T18:56:36.000Z": "Tracing the contacts of someone who tests positive is an important weapon in the fight against COVID-19. \n\nWe are NOT defenseless against this virus, and it's up to each of us to slow the spread. Missouri health officials assist local agencies with contact tracing While the state will assist with COVID-19 contact tracing, Missouri Gov. Mike Parson said the work depends on local health agencies. kshb.com", "2020-07-27T21:40:03.000Z": "We cannot continue to let violence destroy our cities, communities, and families. \n\nMissouri can do better, and that's why I called this special session to address violent crime.", "2020-07-27T17:59:02.000Z": "If we are to stop violent crime in our state, we must work together to support our law enforcement officers. #BackTheBlue", "2020-07-27T15:00:01.000Z": "We can't allow violent criminals to destroy our cities. Missouri Gov. Mike Parson Takes Aim At Pelosi, Says Biden 'Needs To Get In Touch With Reality' 'Anybody with any common sense knows these are violent protests' dailycaller.com", "2020-07-27T14:40:01.000Z": "The First Lady and I were proud to cast our ballots in Bolivar today. \n\nRemember to vote next Tuesday!", "2020-07-26T23:11:10.000Z": "Tomorrow we start our special session on violent crime. I spent last week meeting with local leaders to discuss the six provisions that will be considered to combat violent crime. \n\nIf there's one thing we all agree on, it's that we must stop the violence in our state.", "2020-07-26T23:07:41.000Z": "We are officially 100 days out from the November 3rd election. \n\nJoin our team and let's keep moving Missouri forward, together. >>> http:// mikeparson.com", "2020-07-26T15:32:12.000Z": "If we are to change violent crime across our state, we must work together. We must support our law enforcement officers, and we must start prioritizing the prevention of violent crime. Special session on crimes begins this week Lawmakers will reconvene in Jefferson City this week with one main focus: quelling crime. newspressnow.com", "2020-07-25T16:08:21.000Z": "I will do everything within the Constitution of the State of Missouri to protect law-abiding citizens.\n\nIt's a shame that we have a rogue prosecutor pulling a political stunt and attacking a family for exercising their rights.", "2020-07-25T16:08:20.000Z": "Democrats like Nancy Pelosi don't represent the majority of Americans who support law enforcement.\n\nIt's evident that these cities need federal reinforcements, and we can't continue to let violent criminals destroy our cities.", "2020-07-25T13:17:39.000Z": "Joining @TeamCavuto at 9am. Tune in on @FoxNews !", "2020-07-24T20:46:02.000Z": "Check out the latest edition of the @Mo_Soy Farmer Magazine featuring their endorsement of Governor @MikeParson !  #mogov Missouri Soybean August 2020 Page 7 omagdigital.com", "2020-07-24T20:39:07.000Z": "It's an honor to be featured in the August issue of the Missouri Soybean Farmer Magazine. \n\nI'm proud to be endorsed by @Mo_Soy and support our Missouri farmers. Missouri Soybean August 2020 omagdigital.com", "2020-07-24T20:15:35.000Z": "We are NOT defenseless against COVID-19. \n\nWe CAN take steps to protect ourselves and move our state forward. \n◦Social distance\n◦Wear a mask\n◦Wash your hands", "2020-07-24T19:48:36.000Z": "Missouri nonprofits have been a lifeline for many Missourians throughout the COVID-19 crisis. \n\nThey have delivered critical support to our citizens, and this grant will ensure that they are able to continue helping those who need it most. Governor Parson Announces $22 Million in Grant Funds for Nonprofits - KOAM JEFFERSON CITY, Mo - Governor Mike Parson announced a new Nonprofit Relief and Recovery Grant that could provide up to $22 million for Missouri nonprofits assisting communities in response to... koamnewsnow.com", "2020-07-24T15:19:46.000Z": "Listen to our full interview The Rush Limbaugh Show - July 23 youtube.com", "2020-07-24T15:19:45.000Z": "Great to join @toddeherman on @Rushlimbaugh yesterday while in Cape Girardeau.", "2020-07-24T14:32:25.000Z": "Violent crime isn't just a St. Louis or Kansas City problem. It's a Missouri problem, and we cannot wait until the next session to address it. Gov. Parson meets with local leaders, law enforcement ahead of special session on violent crime In the wake of a shortened state legislative session due to the coronavirus, Missouri lawmakers are now preparing to reconvene Monday for a special session focused on one issue -- violent crime.... semissourian.com", "2020-07-24T11:16:15.000Z": "Joining Branden Rathert on Wake Up Columbia this morning. Listen at 6:35 -> @939TheEagle", "2020-07-23T22:58:07.000Z": "Law enforcement officers need our support now more than ever. It's vital that we give them the tools they need to fight violent crime in our state. St. Louis leaders throw support behind Gov. Parson's goal to remove residency requirement for city... \"The number one barrier to our recruitment is our city's residency rule,\" St. Louis police chief said ksdk.com", "2020-07-23T19:17:25.000Z": "Traveling across the state today to Columbia, Cape Girardeau, and St. Louis to meet with local officials and law enforcement. \n\nViolent criminals need to be held accountable, and I will always support our law enforcement while we work together to find solutions.", "2020-07-23T17:21:51.000Z": "LISTEN LIVE:  Joining The Rush Limbaugh Show now!  @rushlimbaugh", "2020-07-23T17:15:54.000Z": "Violent crime impacts our entire state, and Missouri must address these issues NOW.", "2020-07-23T00:04:53.000Z": "Supporting Missouri's agriculture community and mental health systems is vital to moving our state forward. Parson administration announces new agriculture, mental health funding to address pandemic Parson also pushed back against criticism that his recent comments on school reopening mean he doesn't care about kids. news-leader.com", "2020-07-22T22:52:51.000Z": "It is not the government's place to mandate masks for the entire state.", "2020-07-22T22:05:02.000Z": "If a mob started coming toward your house and your family, what would YOU do?", "2020-07-22T21:54:38.000Z": "Sick individuals continue to play politics with our children's education. Shameful.", "2020-07-22T16:22:40.000Z": "Missouri is playing a vital role in combating COVID-19 across the country. Quote Tweet AllianceSTL @Alliance_STL Pfizer is partnering with BioNTech to produce 100 million doses of a #COVID19 vaccination. Pfizer's vaccinations will be manufactured at their #STL location. https:// bloom.bg/2EaiBar  #STLMade  #biotech  #healthcare  #pharma", "2020-07-22T15:11:59.000Z": "Teresa and I are so grateful to be able to share the People's House with all Missourians. \n\nWatch the First Lady's interview on the rich history inside the Governor's Mansion Inside the Missouri Governor's Mansion with the First Lady \"90 percent of the time is spent here in Jefferson City and here at this home. The house belongs to all Missourians and we are grateful and blessed to be here.\" fox2now.com", "2020-07-22T15:08:13.000Z": "Violent crime impacts our entire state, and it's up to us to work together to make our state safe for Missouri families.", "2020-07-22T13:09:02.000Z": "Looking forward to working with @Chewy as they invest in our state and bring new jobs to Missouri families! Chewy.com to open giant fulfillment center in Missouri and hire 1,200 workers - Missourinet Online pet product retailer Chewy, Inc. has announced plans to open a new 800,000 square foot eCommerce fulfillment center in the Kansas City suburb of Belton. A press release from Gov. Mike Parson's... missourinet.com", "2020-07-22T01:51:41.000Z": "Missouri is proud to welcome @Chewy to Belton! This move will bring more than 1,200 NEW JOBS!\n\nOur state's economy remains strong, and this investment in Missouri workers will help move our state forward.", "2020-07-21T21:32:00.000Z": "Replying to @meaccoleman  @GovParsonMO  and  @travisfitzwater Thank you for sharing! I had a similar experience when I took my two oldest grandsons to a #prolife bill signing (HB 1288) in 2018. @GovParsonMO & @FirstLadyTeresa were exceedingly gracious to them - and the governor had the boys next to him when he signed the bill! #MOLeg  #MOGov", "2020-07-21T20:35:36.000Z": "A person's character is shown by how they treat the least among them. \n\nThe Governor and First Lady's kindness to me, and our children has been beyond anything I could have anticipated.  \n\nI'm grateful for their leadership and character they bring to public service #mogov", "2020-07-22T00:27:27.000Z": "Governor @mikeparson is working with local leaders and law enforcement across the state to hold violent criminals accountable. #mogov", "2020-07-21T23:35:07.000Z": "This afternoon, we met with the Hannibal Mayor James Hark, Police Chief Lyndell Davis, and other local leaders to discuss the upcoming special session on violent crime. \nWe must hold violent criminals accountable for their actions.", "2020-07-21T23:35:06.000Z": "Violent crime isn't just a St. Louis, Kansas City, or Hannibal problem. It is a Missouri problem, and we MUST hold violent criminals accountable. We cannot wait until next year to find solutions.", "2020-07-21T20:25:45.000Z": "As a father and grandfather, I care deeply about the children in our state. \n\nWe are working hard to safely reopen our schools and keep ALL Missouri students, educators, and school employees safe.", "2020-07-21T17:59:12.000Z": "Every Missourian has the right to protect their family and their personal property, and I will do everything within the Constitution of the State of Missouri to protect law-abiding citizens. Missouri Gov. Parson to pardon McCloskeys 'without a doubt,' saying prosecutor's actions 'defy... Missouri Gov. Mike Parson told \"Hannity\" on Monday that \"without a doubt,\" he will pardon Mark and Patricia McCloskey, hours after St. Louis Circuit Attorney Kimberly Gardner filed felony charges... foxnews.com", "2020-07-21T17:53:26.000Z": "The only way we can hold violent criminals accountable is if we work together. \n\nFrom the local levels to the state levels to the federal government, we must find solutions to keep our communities safe. Local officials meet with Governor Mike Parson ahead of the special legislature session Local authorities work with state officials to fight violent crime across the state of Missouri. ky3.com", "2020-07-21T03:51:35.000Z": "Law and order will always prevail in Missouri, and I am proud to work with President @realDonaldTrump to stand up for our men and women in law enforcement.", "2020-07-21T03:51:34.000Z": "The McCloskeys had every right to defend their home, and I will do everything I can under the Constitution to protect law-abiding citizens in our state.", "2020-07-21T01:06:40.000Z": "Guess who is on @seanhannity tonight? Our own @GovParsonMO ! #MOGov", "2020-07-21T01:08:56.000Z": "I will be joining @seanhannity tonight at 8:30 CT. \n\nWATCH LIVE on @FoxNews", "2020-07-20T23:49:15.000Z": "We must prioritize laws that keep our citizens safe over political motivations. Kim Gardner owes every single family who has had a loved one murdered an explanation on why she has acted on the McCloskey case instead of theirs.", "2020-07-20T23:49:14.000Z": "Kim Gardner's action toward the McCloskeys is outrageous.                    \n\nEven worse, the Circuit Attorney's office has admitted there is a backlog of cases and dozens of homicides that haven't been prosecuted, yet she has accelerated this case forward.", "2020-07-20T21:35:25.000Z": "Met with local leaders and law enforcement officials in Kansas City this afternoon to discuss addressing violent crime. \n\nDoing nothing isn't an option. We must do everything we can, as soon as we can, to get violent criminals off our streets.", "2020-07-20T15:21:13.000Z": "Thanks to historic reforms enacted by @GovParsonMO , more Missourians have access to good jobs, expanded opportunities, and second chances. #mogov", "2020-07-20T14:53:06.000Z": "The McCloskeys had every right to defend their home. Missouri governor says pardon likely if St. Louis homeowners charged Missouri Gov. Mika Parson says he is prepared to exercise his pardon powers if prosecutors bring criminal charges in the case of a white St. Louis couple who brandished firearms at a group of... foxnews.com", "2020-07-20T02:23:17.000Z": "Enjoyed speaking to Missourians yesterday in Taney County! Gov. Parson talks masks, COVID-19 and law enforcement at Taney County Lincoln Days The Taney County Republican Central Committee held its \"Lincoln Days\" convention in Branson on Saturday, one of the first major campaign events for Governor Mike Parson and the Ozarks as a whole. ky3.com", "2020-07-19T23:03:09.000Z": "Great to be back in my hometown today in Hickory County and visit with friends and family for some Sunday afternoon ice cream. \n\nThe values I learned growing up here guide me each day that I go to work for Missourians.", "2020-07-19T12:34:28.000Z": "As a former Sheriff, a law enforcement officer for over 22 years, and now Governor, when it comes to supporting law enforcement officers and their families who are under attack, I'll always stand with President @realDonaldTrump and have their backs.", "2020-07-19T01:47:05.000Z": "WATCH Studio 57 update with @TeamParsonMO from the Taney County Lincoln Days. \n\nMissourians are ready to move our state forward!", "2020-07-18T20:38:53.000Z": "These law enforcement officers made the ultimate sacrifice. They should be honored and remembered, not demoralized.\n\nThis is unacceptable. It is wrong, and it will NOT be tolerated. #BackTheBlue KCPD officer memorial vandalized by anti-law enforcement demonstrators Demonstrators vandalized the entrance to the Kansas City, Missouri, Police Department Headquarters and a police memorial to officers who died in the line of duty Friday night downtown. kshb.com", "2020-07-18T18:42:14.000Z": "We support law enforcement, believe in the American Dream, and are ready to keep moving our state forward this November! \n\nGreat time at the Taney County Lincoln Days.", "2020-07-18T17:05:54.000Z": "Great to be in Taney County today!", "2020-07-18T13:00:00.000Z": "We will not allow law-abiding citizens to be targeted for exercising their constitutional rights. Governor Parson says he would consider a pardon in the McCloskey case Governor Mike Parson and Marc Cox discuss St. Louis officials pandemic response, Kim Garner v the McCloskey's, providing aid to law enforcement, and more.", "2020-07-15T00:39:33.000Z": ". @GovParsonMO is working hard for Missouri. @nicolergalloway is working for herself. #mogov Nicole Galloway: Working for Herself Go to www.unitingmo.com to learn more. youtube.com", "2020-07-18T02:33:56.000Z": "On this week's Studio 57 update: Gov. @MikeParson defends the constitutional rights of law-abiding Missourians and addresses violent crime in our state. FULL EPISODE", "2020-07-17T21:14:09.000Z": "Joined Marc Cox on @971FMTalk this morning to talk about the McCloskeys, COVID-19, and crime in our state. \n\nListen to the full interview Marc Cox Show - July 17 youtube.com", "2020-07-17T21:14:08.000Z": "Missourians have the right to stand their ground and protect their property, this shouldn't be a political issue.", "2020-07-17T20:13:39.000Z": "Stay up to date with our team! \nFollow  @TeamParsonMO  #mogov  #Team57", "2020-07-17T20:05:33.000Z": "Well deserved! #MissouriProud Quote Tweet Wonders of Wildlife @WOWaquarium It's official: Johnny Morris' Wonders of Wildlife has once again been named the #1 Aquarium in North America! THANK YOU to every guest, member and fan for your support. Read more about this exciting announcement: https:// bit.ly/32sJsbH", "2020-07-17T18:05:41.000Z": "We are NOT defenseless against COVID-19. \n\nWe are more prepared than ever to deal with this virus and we must get our economy moving again while protecting the health of all Missourians.", "2020-07-17T17:51:42.000Z": "\"NRA applauds Gov. Parson for knowing that we must address violent crime by enforcing existing laws and holding criminals accountable for their actions rather than infringing on the rights of law-abiding citizens.​\" - @NRAILA NRA-ILA | Missouri: Gov. Parson Calls Special Session to Fight Crime On July 15th, Governor Michael Parson called on the General Assembly to convene a special session on July 27th to address violent crime. nraila.org", "2020-07-17T17:42:57.000Z": "Missouri's unemployment rate dropped to 7.9% with jobs growing by 71,600. \n\nMissourians are getting back to work!", "2020-07-17T16:02:25.000Z": "ICYMI: Robert Courtney will NOT be released early from prison. \nGovernor @mikeparson 's thoughts on the DOJ decision", "2020-07-17T15:29:34.000Z": "Missouri's unemployment rate dropped more than two full percentage points since May. The future is promising, and our economy will come back stronger than before! Missouri unemployment rates drop in June, state says - Missouri's unemployment rates are decreasing after record highs earlier this year due to the COVID-19 pandemic, according to DED's June Jobs Report. themissouritimes.com", "2020-07-17T15:14:30.000Z": "Our history is something that should be celebrated, and it's great to see a new patriotic landmark in Monett that will celebrate America for years to come.\n\nThank you, Raine - America's Muralist for sharing your talent and love of country with our state. Historic silo in Monett gets patriotic paint job MONETT, Mo- For 130 years, a grain silo located at Seventh and Front Streets in Monett has sat vacant, collecting rust. Now, one famous Ozarks muralist has been tasked with sprucing it up a bit. Ra ozarksfirst.com", "2020-07-16T03:00:50.000Z": "Farmers like our FIVE. 2 cattlemen & 3 champions for ag. We back @GovParsonMO  @Mikelkehoe  @JayAshcroftMO  @Eric_Schmitt  @FitzpatrickMO", "2020-07-16T20:48:33.000Z": "WATCH: Gov. @mikeparson calls a special session to give law enforcement the tools they need to fight violent crime. #mogov", "2020-07-16T20:16:35.000Z": "Missouri's economy is recovering.\n\nOur unemployment rate is dropping and Missourians are getting back to work. Missouri's unemployment rate fell to 7.9% in June The rate is still more than double what it was pre-pandemic ksdk.com", "2020-07-16T19:33:53.000Z": "The Department of Justice made the right decision to not release Robert Courtney from prison. This criminal deserves to serve his full term after diluting lifesaving chemotherapy drugs.\n\nCOVID-19 doesn't excuse taking countless innocent lives.", "2020-07-16T19:10:00.000Z": "Violent crime isn't just a Kansas City or St. Louis problem. It's a Missouri problem and it must be addressed now. 'We cannot wait until next year': Parson calls special session on violent crime Legislators are set to return July 27. news-leader.com", "2020-07-16T18:30:00.000Z": "We cannot continue to let violent criminals destroy our state. By working together, we will make our state a safer place for our families. Parson calls special session to address 'violent crime' later this month Gov. Mike Parson has called lawmakers back to convene back in the capital city later this month to address violent crime. themissouritimes.com", "2020-07-16T18:03:20.000Z": "Missourians have the constitutional right to defend their homes. \n\nI will always protect the Second Amendment in our state and I'm proud to be endorsed and have an A+ rating from the @NRAPVF .", "2020-07-15T16:22:26.000Z": "Thanks to @GovParsonMO for joining me this morning on @kcmotalkradio to discuss #OperationLegend in #KansasCity , slowing violent crime, plus #COVID concerns moving forward. @mikeparson 7-15: Mike Parson, Missouri Governor KCMO Talk Radio 103.7FM and 710AM. KC's Most Stimulating Talk with LOCAL Kansas City News, Weather, Traffic, and National Updates From Westwood One News. Streaming online Worldwide, and Podcasting for soundcloud.com", "2020-07-16T00:33:55.000Z": "I stand with Missourians defending their property and will always defend the right to bear arms in our state.", "2020-07-15T20:12:59.000Z": "There is no debate on whether we should support our law enforcement officers. \n\nI will always #BackTheBlue", "2020-07-15T19:03:31.000Z": "Governor @mikeparson says a special session will convene next week to address the #McCloskey situation in St. Louis along with giving a harsh rebuke to #KimGardner 's job of managing the law and order of #STL . Listen here #AFS971  #971Rewind 97.1 FM Talk - Younger. Smarter. Better. - LISTEN LIVE | RADIO.COM Listen To 97.1 FM Talk, A News/Talk Station Based Out Of St. Louis. Never Miss A Story Or Breaking News Alert! LISTEN LIVE At Work Or While You Surf. FREE On RADIO.COM. radio.com", "2020-07-15T18:57:51.000Z": "We have a crime problem in our state. Families are hurting. Police officers are hurting. This is not who we are as a state.\n\nI am calling for a special session to address violent crime in our state.", "2020-07-15T18:35:21.000Z": "What is happening with the McCloskey family in Saint Louis is unacceptable. I stand with Missourians defending their homes and will always defend our Second Amendment. \n\nLaw and order will prevail in Missouri.", "2020-07-14T23:21:24.000Z": "Missourians have the right to protect their homes. PARSON: Trump says he'll help McCloskeys against circuit attorney investigation \"The conversation I had with the President, said that he would do everything he could within his powers to help with this situation,\" said Gov. Mike Parson kmox.radio.com", "2020-07-14T20:46:37.000Z": "I'm a firm believer in an individual's right to bear arms and stand their ground.\n\nI helped write & pass Missouri's Castle Doctrine which became a model for the nation.", "2020-07-14T20:24:30.000Z": "The McCloskeys had every legal right to defend themselves.", "2020-07-14T16:02:45.000Z": "Missouri is proud to stand with #Israel . Missouri governor signs anti-BDS bill into law Missouri Gov. Mike Parson signed a bill Monday that requires companies entering into a contract with the state to certify that they are not, and will not, engage in a stljewishlight.com", "2020-07-14T15:21:51.000Z": "Foster children are Missouri's children, and it's time we give them the tools they need to succeed. Missouri reforms foster system, expanding rights for parents and children Gov. Mike Parson signed a pair of bills into law increasing child protection in Missouri and making changes to the foster system. themissouritimes.com", "2020-07-14T13:18:19.000Z": ". @AP : Missouri Governor @mikeparson signs bill for free COVID-19 testing https:// kctv5.com/news/local_new s/missouri-governor-mike-parson-signs-bill-for-free-covid-19-testing/article_57ff9e70-c55b-11ea-900e-0b605433f09e.html   #mogov Missouri Governor Mike Parson signs bill for free COVID-19 testing COVID-19 tests recommended by doctors now must be free to Missouri patients under a new law. kctv5.com", "2020-07-14T00:34:07.000Z": "I will always stand with our men and women in law enforcement. \n\nThank you @kcpolice and all officers for your service to our state.", "2020-07-13T22:37:43.000Z": "We're cutting unnecessary red tape and making it easier for workers to transfer their licenses when coming to our state. Bill creates easier path to transfer professional licenses Moving across a state line shouldn't mean losing your ability to earn a living but it's a reality many families face as a result of licensing requirements. Now, a new kctv5.com", "2020-07-13T20:30:00.000Z": "We're proud of the agriculture community in our state. \n\nThere's no better place to showcase their hard work than at the @MoStateFair . MO Governor: feedback to hold state fair positive - Brownfield Ag News Governor Mike Parson says he's received positive feedback on the decision to hold the 2020 state fair. Parson tells Brownfield the state needs to be doing two things during COVID-19 \"We got to fight... brownfieldagnews.com", "2020-07-13T20:00:00.000Z": "Now more than ever, Missourians need access to affordable broadband. \n\nInvesting in this infrastructure is just one of the ways we are preparing our rural communities for the jobs of the future. Parson gives boost to rural broadband - Ozark Radio News By Eric Bohl   For years Missouri has struggled to keep pace with the need to build internet infrastructure. Rural areas have suffered more than most. Over one million rural Missourians lack access... ozarkradionews.com", "2020-07-13T19:18:07.000Z": "It's important that we continue to invest in the future of our state's workforce. \n\nMissourians need to be prepared for the jobs of the 21st century, and we're working hard to make that happen. Governor's Budget Includes Money for Unemployed, Educational Institutions Governor Parson has released a new budget that will include 125 million dollars for workers coming back to work after the coronavirus and for academic institutions also negatively impacted. Missouri... ktts.com", "2020-07-13T00:27:03.000Z": "It all started on a farm. Nobody tells our story better than Teresa.\n\nJoin our team and let's keep moving Missouri forward, together. >>> http:// mikeparson.com", "2020-07-12T01:13:55.000Z": "There is nothing like being in a room full of cattlemen and women.\n\nThese folks know what it means to work hard each and every day to put food on our tables. \n\nIt's an honor to be endorsed by @MoCattle .", "2020-07-11T15:24:22.000Z": "I am proud to have Associated Industries of Missouri as a partner while we meet the challenges of tomorrow. \n\nOur shared focus on pro-jobs, workforce development initiatives will move Missouri forward. @AIMTWEET13 Parson receives endorsement from business advocacy group - The Associated Industries of Missouri (AIM) PAC announced its endorsement of Gov. Mike Parson on Wednesday, praising his focus on workforce development. themissouritimes.com", "2020-07-11T14:36:45.000Z": "Missouri has a bright future as companies continue to invest and grow in our state. The Bright Light at the End of the COVID Tunnel is Missouri Missouri Partnership CEO, Subash Alias, talks about the bright future in Missouri as we celebrate winning our largest business recruitment project in our organization's history.  It's been a long few... missouripartnership.com", "2020-07-10T21:34:43.000Z": "We must hold violent offenders accountable for their actions.\n\nToday, we are standing with law enforcement by working together to ensure justice, address crime and keep Missourians safe.", "2020-07-10T20:19:57.000Z": "Creating opportunities for workers in Missouri is needed now more than ever.", "2020-07-10T17:49:35.000Z": "We joined the @kcchamber & the @WomensFound to celebrate the expansion of license reciprocity.\n\nThis legislation eliminates governmental barriers to employment, and allows citizens to become licensed faster when moving or needing to find work in Missouri.", "2020-07-10T16:04:46.000Z": "Today, we approved critical legislation that cuts red tape and helps Missourians get to work. \n\nThanks to @STLRegChamber for hosting us. Missouri's workforce is strong, and our state is the ideal place to live and work.", "2020-07-10T15:00:02.000Z": "Workforce development is critical to our state's recovery. Skilled, prepared workers will meet the needs of our economy and move our state forward. Parson announces $125 million for workforce development Gov. Mike Parson announced that nearly $125 million from the CARES Act will go toward workforce development and higher education initiatives. themissouritimes.com", "2020-07-10T01:17:23.000Z": "Teresa and I were pleased to host Missouri's @WestPoint_USMA graduates and their families at the People's House.\n\nDue to public health concerns, their traditional graduation ceremony was closed to guests.", "2020-07-10T14:11:04.000Z": "President @realdonaldtrump has approved Missouri's request for a federal major disaster declaration following the storms that swept across the state in May. \n\nHardworking Missourians are fueling our recovery, and this federal assistance will help us continue to move forward.", "2020-07-10T04:15:51.000Z": "As a farmer myself, I know how hard our Missouri farm families work each and every day. \n\nI am proud to work with @MOAGBIZ to ensure that the agriculture industry remains strong in our state.", "2020-07-09T18:00:00.000Z": "Education is a part of who we are, and we cannot let this virus shut our country and our state down.", "2020-07-09T17:30:00.000Z": "The Second Amendment is important to Missourians. \n\nI will continue working hard to defend our rights, and I'm proud to be the only candidate endorsed by the @NRAPVF . NRA-PVF | Grades | Missouri The Official NRA Political Victory Fund (NRA-PVF) is NRA's political action committee. The NRA-PVF ranks political candidates - irrespective of party affiliation - based on voting records, and public... nrapvf.org", "2020-07-09T16:32:05.000Z": "We must continue moving our state forward. Missourians will now have even more opportunities to get to work in our state. Governor Mike Parson Signs Landmark Licensing Reforms To Boost Jobs In The Show Me State Escalating Missouri's already promising economic rebound, Governor Mike Parson took sweeping action this week to remove unnecessary government red tape and incentivize new jobs and entrepreneurship... rga.org", "2020-07-09T15:03:11.000Z": "On this week's Studio 57 news update, Governor @mikeparson calls on Missourians to #BackTheBlue WATCH  #mogov", "2020-07-08T22:18:56.000Z": "I am proud to be the only candidate in this race to be endorsed by and have the highest rating from the @NRAPVF .", "2020-07-08T21:49:11.000Z": "I am proud to have @AIMTWEET13 as a partner as we help our state recover from the COVID-19 economic crisis and meet the challenges of tomorrow to move Missouri forward.", "2020-07-08T21:49:10.000Z": "Associated Industries of Missouri has led the way in supporting business-friendly policies to grow family-supporting jobs and strengthen our economy, and I am honored to receive their endorsement. Quote Tweet AIM @AIMTWEET13 AIM endorses Governor Mike Parson in 2020: https:// voiceofmobusiness.com/post/associate d-industries-of-missouri-endorses-governor-mike-parson-in-2020 ", "2020-07-08T20:00:01.000Z": "By expanding and streamlining occupational licensing in Missouri, Governor @mikeparson is putting the Show Me State on the map as a thriving, flexible economy ready to attract top talent, expand opportunity for all, and reach even greater heights. https:// rga.org/governor-mike- parson-signs-landmark-licensing-reforms-boost-jobs-show-state/   #mogov Governor Mike Parson Signs Landmark Licensing Reforms To Boost Jobs In The Show Me State Escalating Missouri's already promising economic rebound, Governor Mike Parson took sweeping action this week to remove unnecessary government red tape and incentivize new jobs and entrepreneurship... rga.org", "2020-07-07T12:50:19.000Z": ". @MissouriTimes : @GovParsonMO expands license reciprocity in Missouri\n\n\"This will not only help fill critical jobs in our economy but also highlight Missouri as an ideal state to live and work.\" https:// themissouritimes.com/parson-expands -license-reciprocity-in-missouri/   #MOGov Parson expands license reciprocity in Missouri - The Missouri Times Gov. Mike Parson signed a pair of bills into law on Monday expanding license reciprocity and expanding funding for Missouri FIRST. themissouritimes.com", "2020-07-08T16:19:58.000Z": "Safely reopening our schools is necessary so that we can continue providing resources to our at-risk students.", "2020-07-08T02:09:21.000Z": "I will always stand up for law and order in our state.", "2020-07-07T23:26:12.000Z": "It is vital that we can safely reopen schools and get children back in the classroom. \n\nI am thankful for the leadership of the Trump Administration for meeting with state leaders today to discuss reopening schools across the country. Gov. Mike Parson meets with President Trump to discuss reopening of schools The Missouri Governor participated in a National Discussion at the White House alongside President Trump and the First Lady. graydc.com", "2020-07-07T22:04:39.000Z": "#ProLife WIN!! Missouri fully funds the Alternative to Abortion Program, sending $6.46 million to pregnancy centers and maternity homes.\n\nThank you @GovParsonMO for prioritizing moms and babies!  \n \nThank Gov. Mike Parson now  https:// governor.mo.gov/contact-us", "2020-07-07T20:07:22.000Z": "We are moving Missouri forward and making sure that we open up our schools while protecting the health of our students and teachers. \n\nWe are working with President @realDonaldTrump and his administration to support America's students during the pandemic.", "2020-07-07T19:10:02.000Z": "Missouri Gov. Mike Parson at White House as Trump discusses school reopening FOX2now @FOX2now Missouri Gov. Mike Parson at White House as Trump discusses school reopening", "2020-07-07T15:52:00.000Z": "At the White House today for this important discussion. Watch Live at 11:15 CT! Quote Tweet The White House @WhiteHouse Today at the White House, we're hosting a National Dialogue on Safely Reopening America's Schools. \n\nWatch the full event online, beginning at 12:15 p.m. ET! http://", "2020-07-07T00:00:01.000Z": "We are removing unnecessary government barriers and opening the door for more opportunities to work in our great state! NEW LEGISLATION EXPANDS LICENSING RECIPROCITY IN MISSOURI Governor Mike Parson signed HB 2046 on Monday, July 6, expanding license reciprocity provisions in the state of Missouri. Currently in Missouri, license reciprocity is only allowed if the license... kmmo.com", "2020-07-06T23:37:02.000Z": "Protecting our communities is a top priority. We are making sure that law enforcement and prosecutors can hold violent offenders accountable for their actions.", "2020-07-06T22:50:00.000Z": "Thank you President @realDonaldTrump for honoring members of our Missouri law enforcement community on Independence Day. \n\nTheir heroism deserves to be recognized! 4 St. Louis officers, David Dorn's widow attend White House July 4 celebrations The officers were injured during riots last month near downtown St. Louis, the same night retired police captain David Dorn was shot and killed by suspected looters ksdk.com", "2020-07-06T22:30:58.000Z": "If there was ever a time to support our officers, NOW is the time. \n\nI am proud to support legislation that will give our law enforcement officers the tools they need to keep our communities safe. Parson signs major crime bill after visiting injured officer's family Gov. Mike Parson said he will sign Missouri's controversial crime reform bill, SB 600, into law after visitng the family of an injured police officer. themissouritimes.com", "2020-07-06T20:22:55.000Z": "We are eliminating governmental barriers and allowing citizens to become licensed faster when moving or needing to find work. \n\nNew license reciprocity provisions will not only help fill critical jobs in our economy but also highlight Missouri as an ideal state to live and work.", "2020-07-06T18:53:08.000Z": "Ensuring Missourians have access to telehealth, education, and the ability to telework is critical. \n\nThese are not optional services, and we are working hard to increase connectivity across the state. Missouri to spend $50 million in pandemic funds to boost internet access Missouri is in the lower half of the nation when it comes to broadband access stltoday.com", "2020-07-06T16:13:32.000Z": "I want the officer, his family, and fellow officers to know, on behalf of all Missourians, we stand behind them & support our law enforcement officers. #BackTheBlue Missouri Gov. Mike Parson offers support for injured KCPD officer Missouri Gov. Mike Parson visited Truman Medical Center on Sunday to show support for an injured Kansas City, Missouri, police officer. kshb.com", "2020-07-06T02:14:09.000Z": "Traveled to Truman Medical Center in KC to show our support for the injured officer who was shot Friday night.\n\nI want the officer, his family, and fellow officers to know, on behalf of all Missourians, we stand behind them & support our law enforcement officers. #BacktheBlue", "2020-07-05T20:30:00.000Z": "The Marshfield Independence Day parade has a rich tradition, and Missourians from all over were excited to take part in this year's festivities.", "2020-07-05T19:50:25.000Z": "Law and order is something that all Americans should be proud to celebrate. It was an honor to attend the grand opening of the Webster County Justice Center on Independence Day. Marshfield's 141st Independence Day Parade Ends with Opening of Webster County Justice Center The city of Marshfield held their 141st Independence Day parade, the longest running Independence Day parade west of the Mississippi, ozarksindependent.com", "2020-07-04T22:52:02.000Z": "Proud to celebrate July 4th today in Marshfield with Governor @mikeparson !  #mogov", "2020-07-04T22:32:16.000Z": "Great day celebrating our country in Southwest Missouri at the Marshfield Independence Day Parade!", "2020-07-04T12:06:54.000Z": "Our freedom allows all Missourians to be able to achieve the American Dream and work towards a better, brighter future.   \n\nTeresa and I wish all Missourians a safe and happy Independence Day weekend!", "2020-07-04T12:06:49.000Z": "On the Fourth of July, we are reminded to celebrate the freedoms we cherish and the brave men and women who have fought to preserve our great country.\n\nI am proud to lead a state that honors those who have served. May we never forget their selfless sacrifice for our freedom.", "2020-07-03T19:06:36.000Z": "Governor Parson had this message to share with Missourians this Independence Day weekend Watch this week's full Studio 57 episode here  http:// youtu.be/Owyknzxr888  #mogov", "2020-07-04T02:28:12.000Z": "Team Parson kicked off the Fourth of July weekend at the Salute to America parade in Jefferson City! We were proud to support Governor @mikeparson , even in a little rain! \n\nThank you to all who joined us  #mogov", "2020-07-02T23:44:08.000Z": "This afternoon, two law enforcement officers in the Kansas City region were shot. One is in very serious condition. Please join Teresa and me in praying for these officers and their families. #BackTheBlue", "2020-07-03T00:00:08.000Z": "Follow @TeamParsonMO to stay up to date with our team! Quote Tweet Team Parson (Text PARSON to 484848) @TeamParsonMO Studio 57 behind the scenes! Stay tuned for a new episode coming soon", "2020-07-02T23:25:23.000Z": "In Missouri, we are working to bridge the digital divide in our state and bring high-speed broadband access to ALL parts of the state. Parson signs bill to extend internet in rural areas of Missouri He extended a grant program by six years. komu.com", "2020-07-02T19:28:27.000Z": "Today, I was proud to approve legislation extending the Missouri Broadband Grant Program until 2027. \n\nAccess to high-speed broadband is critical to preparing our state for the jobs of the future.", "2020-07-02T16:38:54.000Z": "Now more than ever, access to high-speed broadband is critical to our infrastructure.\n\nToday, I signed HB 1768 extending the Missouri Broadband Grant Program to 2027. This key legislation builds on our efforts to expand broadband across the state, especially in rural Missouri.", "2020-07-02T14:50:48.000Z": "We are looking forward to joining Missourians at this year's @MoStateFair ! #HomeisHere Missouri State Fair will include Governor's Ham Breakfast after all It turns out any plans to cancel the traditional Governor's Ham Breakfast at this year's Missouri State Fair was just some hogwash. themissouritimes.com", "2020-07-02T14:38:48.000Z": "4.8 MILLION jobs added in June.\n\nAmerica is getting back to work! Record jobs gain of 4.8 million in June smashes expectations; unemployment rate falls to 11.1% Another big contributor to the decline of the jobless rate was a plunge in those on temporary layoff. That total fell by 4.8 million in June to 10.6 million after a decrease of 2.7 million in May. cnbc.com", "2020-07-01T23:11:49.000Z": "Today I was proud to sign SB 591 into law. I applaud the legislature for finding a fair balance between protecting Missouri employers and employees from frivolous claims while also ensuring the ability of those harmed to seek relief in court. Missouri Governor Signs Legislation Making It Harder To Get Punitive Damages Missouri Gov. Mike Parson on Wednesday signed legislation that modifies how plaintiffs are awarded punitive damages. The measure requires plaintiffs to news.stlpublicradio.org", "2020-07-01T22:22:57.000Z": "Now more than ever, it's vital that the fundamentals of our economy are strong for long-term success. \n\nThe USMCA will foster free markets and economic growth throughout North America. USMCA is the light at the end of the tunnel for our economy  thehill.com", "2020-07-01T20:20:56.000Z": "I am proud to stand with our business community by signing SB 591. This bill will protect Missouri businesses against unfair and unreasonable litigation and equip them with the tools they need to succeed. Parson signs punitive damages bill - The Missouri Times Gov. Mike Parson signed SB 591, a bill bringing sweeping changes to how punitive damages are assessed in Missouri Wednesday. themissouritimes.com", "2020-07-01T18:14:01.000Z": "Today, the #USMCA trade deal officially goes into effect. This historic agreement will put American manufacturers and workers FIRST. \n\nBig news for Missourians, thanks to the leadership of @realDonaldTrump !", "2020-06-30T22:11:03.000Z": "Our Missouri Broadband Grant Program awarded @cvalleynet a grant for broadband development projects in Renick-Randolph County. High speed internet is essential infrastructure in the modern economy! #broadband Quote Tweet Chariton Valley @cvalleynet FOR IMMEDIATE RELEASE: June 30, 2020\nChariton Valley Becomes One of First Providers to Install Fiber Internet for Missouri Broadband Grant Recipients http:// ow.ly/dXdn50Am67J  #ruralbroadband  #ruraliscool  #gofurthergofastergofiber", "2020-06-30T19:51:44.000Z": "It has been incredible to see the resilience of our Missouri business community during this time. @TrippNT is one of the many companies that is working to help other Missouri businesses protect their employees on the job. Missouri company shifts to fill major need during COVID-19 - Missourinet A Kansas City business that specializes in making carts, shelving and other organizers has found a niche in the midst of the coronavirus. Susan Tripp, the founder of TrippNT, says one of her workers... missourinet.com", "2020-06-30T17:35:39.000Z": "This 3 million dollar expansion of Holtec Gas Systems in St. Charles will not only expand the company's capabilities but also provide secure jobs for Missouri workers for years to come. St. Louis-area manufacturer invests $3M to expand in St. Charles Earlier this month, the company moved out of a nearly 7,000-square-foot facility in Chesterfield. bizjournals.com", "2020-06-29T17:13:21.000Z": "Holtec Gas Systems is a great example of the hard-working Missouri businesses skillfully navigating the challenges of COVID-19.\n\nHoltec has announced a $3 million expansion in St. Charles. A sign that our economy is recovering and will come out of this even stronger than before. Holtec Gas Invests $3 Million to Expand in St. Charles www.usagnet.com", "2020-06-29T19:00:01.000Z": "We are moving Missouri forward and working to make sure that ALL Missourians are able to achieve the American Dream. \n\nHelp our campaign meet our end-of-quarter deadline by donating before MIDNIGHT ON TUESDAY! Help us reach our EOQ Goal! This November will be a deciding moment in our nation's history, and we must unite together to keep Missouri on the right path. Rush in TODAY to support our end of quarter goals. secure.winred.com", "2020-06-29T17:50:14.000Z": "As Missourians have always done, we've come together to move forward and the best is yet to come. \n\nTogether we will build the greatest economic comeback that we've ever seen in Missouri history. >>> http:// mikeparson.com", "2020-06-28T16:11:47.000Z": "On this week's Studio 57 update: Governor Parson's focus remains on protecting the health and safety of Missourians while building the greatest economic comeback in our state's history! #mogov", "2020-06-27T20:50:18.000Z": " Celebrate July 4th with Team Parson!\n\nPitch in TODAY and secure our limited-edition Parson merch bundle  https:// secure.winred.com/parson-for-mis souri/bundle?utm_source=Housefile&utm_medium=HA-SMS&utm_campaign=2020.06.24_MerchJuly4_SMS1_TP&utm_content=URL&amount=25 ", "2020-06-27T15:55:47.000Z": "We are proud to have Brigadier General James Bonner back in Missouri serving as the new commander at @fortleonardwood . New Commander Is No Stranger To Fort Leonard Wood Brig. Gen. James Bonner took command of Fort Leonard Wood on Friday, but it won't take him long to get acclimated to the installation in the Ozarks. This news.stlpublicradio.org", "2020-06-26T21:49:08.000Z": "You can't have a strong economy without strong infrastructure. I'm glad to see progress with the Focus on Bridges program. This will help us make sure that we get Missourians back to work. McKenna pleased with progress of Missouri's $350 million bridge bonding plan - Missourinet More than 100 bridges in Missouri's $350 million bridge bonding plan are now under contract, and 13 have already been completed. State Department of Transportation (MoDOT) Director Patrick McKenna... missourinet.com", "2020-06-26T15:46:57.000Z": "Momentum continues building for @mikeparson  @Mikelkehoe  @realDonaldTrump & @MissouriGOP conservative cause across Missouri! Having fun, working up a little sweat, and driving t-posts today. #mogov  #moleg", "2020-06-26T15:41:49.000Z": "Congratulations to our newest @MSHPTrooperGHQ Troopers!\n\nWe are thankful for your service and your willingness to keep Missourians safe. Quote Tweet MO Public Safety @MoPublicSafety By enduring rigorous training, demanding challenges, and through their shared experiences, each member of the @MSHPTrooperGHQ", "2020-06-26T15:20:54.000Z": "Joined @foxnewsradio to talk about how we are working to move Missouri forward. \nListen to the podcast here Quote Tweet FOX News Radio @foxnewsradio Today on The #FOXNewsRundown  @Rosenthalfox speaks with @GovParsonMO on how Missouri has handled the Covid-19 outbreak, reopening the state, police reform and more! \n\nListen and subscribe: https:// open.spotify.com/show/7A4YfyFtN OZhqMV7F3kYVu ", "2020-06-26T14:07:52.000Z": "Another exciting day in space for Missourian @AstroBehnken ! Quote Tweet NASA @NASA Today's spacewalk is underway! At 7:32am ET @AstroBehnken & @Astro_SEAL set their spacesuits to battery power, marking the beginning of a spacewalk that could last as long as seven hours. Live from space: https:// twitter.com/i/broadcasts/1 vAxRrPqeQvxl ", "2020-06-25T22:26:32.000Z": "President @realDonaldTrump understands the importance of having strong, pro-jobs, pro-growth leaders like Governor Parson. #mogov", "2020-06-25T20:13:22.000Z": "Workforce development & infrastructure are a critical part of Missouri's recovery. Before COVID-19, we were making great progress with infrastructure.\n\nAs we continue to recover, we are excited to get momentum going again and move forward with critical infrastructure projects.", "2020-06-25T16:09:49.000Z": "It was an honor to have @KellyannePolls join Missourians last night for our virtual campaign event. We are proud to have her support as a leading conservative voice throughout the nation. \n\nTogether we will move Missouri forward and come back stronger than before!", "2020-06-23T17:06:43.000Z": "Accenture to hire 1,400 in St. Louis County to work at a new Advanced Technology Center Accenture to hire 1,400 workers at a new Advanced Technology Center in St. Louis County The building has been in place on the Maryville University campus but it's a new facility for Accenture Federal Services. And the welcome to town gift they're bringing - 1,400 tech jobs to St. Loui fox2now.com", "2020-06-24T15:16:58.000Z": "Missourians are looking to get back to work, and we are excited about the opportunities that @AccentureFed will bring to grow our technology workforce.", "2020-06-23T22:35:27.000Z": "We are NOT overwhelmed. We are NOT currently experiencing a second wave. We have NO intentions of closing Missouri back down at this point in time.\n\nWe continue to monitor our state-specific data on a daily basis, and we remain confident that we are on the road to recovery!", "2020-06-23T22:20:12.000Z": "1400 NEW JOBS for Missourians!  https:// mikeparson.com/2020/06/23/140 0-new-jobs/ ", "2020-06-23T20:02:57.000Z": "Today's announcement is a huge step forward for Missouri. We are bringing more jobs to our state and putting Missourians back to work. Governor Parson announces more jobs coming to the St. Louis region ST. LOUIS, Mo. (KMOV, CBS Newspath) - Missouri Governor Mike Parson says more jobs are coming to the St. Louis region. The governor announced Tuesday June. 23, 2020 that St. Louis will be hom ozarksfirst.com", "2020-06-23T17:39:00.000Z": "Missouri is already recognized as one of the most prepared states for the digital economy.  At a time when many Missourians are looking for work, this move will create more opportunities, grow our technology workforce, and strengthen our standing as a technology hub in the U.S.", "2020-06-23T17:38:59.000Z": "We're proud to welcome @AccentureFed to Missouri where we're developing the next generation of tech talent. Quote Tweet AllianceSTL @Alliance_STL We are excited to share that @AccentureFed 's new Advanced Technology Center will call St. Louis home. The future of #tech jobs is #STLMade . Check out the press release for details: https:// alliancestl.com/tech-jobs-pres s-release/   #STL  #tech  #technology  #AI  #cybersecurity", "2020-06-23T16:28:11.000Z": "\"We're proud to welcome @AccentureFed to #Missouri where we're developing the next generation of tech talent,\" @GovParsonMO . AFS selected #MO for its new Advanced Technology Center, creating 1,400 new jobs. #ShowMeRecovery  #MOstrong  #MOinnovation  #ShowMeMO Missouri Welcomes 1,400 New Tech Jobs As Statewide Recovery Efforts Ramp Up In the midst of Missouri's \"Show Me Strong Recovery\" Plan, the state's coordinated effort to reopen and rebuild its economy, Missouri is showing its strength in the tech industry. Accenture missouripartnership.com", "2020-06-23T16:41:24.000Z": "Great news today for the St. Louis region! We are proud to welcome the new @AccentureFed Advanced Technology Center to the Show-Me State. @Alliance_STL Quote Tweet Accenture Federal @AccentureFed . @AccentureFed expanding operations in St. Louis MO and adding 1400 high-quality technology jobs https:// accntu.re/3dsuS5O", "2020-06-23T16:11:37.000Z": "WATCH LIVE: Jobs expansion announcement for St. Louis region Quote Tweet AllianceSTL @Alliance_STL Major Tech Jobs Expansion for St. Louis Region https:// pscp.tv/w/ccDMcDFQbUtx SmtNd3JQam98MWpNS2dYalZNeXlHTPql7aqbghrP3kH_jisyFoT1vsFpfZr2cIw6L6AEgKn5 ", "2020-06-22T20:09:05.000Z": "Every human life has value. I'm proud to be pro-life and stand up for those without a voice. \n\nIt is an honor to have been endorsed by @SBAList .", "2020-06-22T17:32:11.000Z": "We are working hard to get signs out across the state! \n\nRequest a yard sign here  https:// mikeparson.com/team-57/  #mogov", "2020-06-22T17:09:13.000Z": "In Missouri, we stand for life, protect women's health, and advocate for the unborn. \n\nI am honored to be endorsed by @SBAList . Quote Tweet Susan B. Anthony List @SBAList It's an honor to endorse @mikeparson for re-election! He's a true #prolife hero and has signed some of the strongest protections for unborn children and their mothers into law! #MOgov  https:// sba-list.org/newsroom/press -releases/sba-lists-candidate-fund-pac-endorses-mo-governor-mike-parson-re-election ", "2020-06-22T14:17:31.000Z": "Last week, I visited the Inmate Training Center at the Lincoln County Jail. This program prepares current offenders for life outside prison, reduces recidivism, and increases employment placement upon release. https:// lincolnnewsnow.com/news/business/ parson-visits-inmate-training-center/article_1a079ca8-b3ef-11ea-8a03-b74edbbbae66.html ", "2020-06-21T16:39:00.000Z": "Dad raised his family on a little farm in Wheatland, Hickory County. He was strong and true.", "2020-06-20T18:49:16.000Z": "Looking forward to it! #MoStateFair  #HomeisHere Quote Tweet Team Parson (Text PARSON to 484848) @TeamParsonMO Governor Parson is working hard to move forward with this year's @MoStateFair ! https:// emissourian.com/covid19/state- fair-to-go-on---livestock-shows-get-green-light-other-activities-pending/article_dabca1e6-b255-11ea-8375-1bddfeb95c3c.html ", "2020-06-20T17:32:27.000Z": "Together, we will revive our economy and come back stronger than before! Missouri governor says job market rebounding from COVID-19 losses - ABC17NEWS Missouri Gov. Mike Parson touted the state's economic recovery from COVID-19 on Thursday, saying tens of thousands of employees returned to work in May. abc17news.com", "2020-06-20T16:37:38.000Z": "Missouri is proud of those who serve at @fortleonardwood . Quote Tweet Fort Leonard Wood @fortleonardwood Defense Secretary Dr. Mark T. Esper thanked Soldiers at #FortLeonardWood , Missouri today for being a part of the \"elite\" group of Americans who serve on \"the greatest team history has known,\" the U.S. military. https:// army.mil/article/236603  @DeptofDefense  @USArmy  @TRADOC  @MSCoECG", "2020-06-19T17:30:00.000Z": "We are already seeing signs of economic recovery in our state. The expansion of Tyler Pipe Company is another example of the resilience of the economy and business community in Missouri. Missouri pipe company expanding, adding dozens of new jobs - Missourinet Tyler Pipe Company in southwest Missouri's Marshfield is investing $4.9 million in an expansion - leading to an additional 75 new jobs to its workforce. The plant - near Springfield - specializes in... missourinet.com", "2020-06-19T16:45:00.000Z": "I look forward to keeping the tradition of showcasing the best of Missouri agriculture at the @MoStateFair this year. Missouri Gov. Mike Parson says state fair should continue despite COVID-19 \"I'm looking forward to going to the state fair and getting people there\" ksdk.com", "2020-06-19T16:00:03.000Z": "We are working hard to get Missourians back to work! Gov. Parson hopeful for strong economic recovery in Missouri Missouri Governor Mike Parson is looking forward to a strong economic recovery in the state. The remaining health restrictions were lifted Tuesday in Missouri, allowing the state and economy to fully... ktvo.com", "2020-06-18T20:08:29.000Z": "Last week, we announced that we are moving forward with plans for the 2020 Missouri State Fair.\n\nFor more than a century, the @MoStateFair has been built on strong traditions, showcasing the best of Missouri agriculture. #MoStateFair  #HomeisHere", "2020-06-18T20:40:59.000Z": "Missourians are getting back to work! Quote Tweet ABC 17 News @ABC17News Governor Mike Parson said 34,000 people returned to work in May, after historic unemployment in April due to COVID-19 #ABC17News - @ConnorABC17", "2020-06-18T18:09:26.000Z": "An incredible story showing the bravery of our men and women of the Missouri State Highway Patrol.\n\nWe are proud to have heroes like Trooper Brock Teague protecting Missourians every day. Missouri trooper pulls man from burning car in south St. Louis County The Missouri Highway Patrol is lauding Trooper Brock Teague for reaching into the car early Saturday and pulling the driver to safety. stltoday.com", "2020-06-18T14:16:03.000Z": "Looking forward to the opportunities that this facility will bring to grow Missouri's workforce! Lincoln County School District partners with Ranken Tech to open trade school facility The new facility will focus on aquaponics, cultivating plants in water, renewable energy, and construction trades. kmov.com", "2020-06-17T21:47:00.000Z": "Now more than ever, Missouri needs skilled, resilient workers. Quote Tweet Community Relations @Linc_R3 An exciting day for our community! We are grateful for all that came to support today's groundbreaking. We look forward to the opportunities this facility will provide for students & community. @ranken  @RandyPietzman  @MOEducation  @GovParsonMO  @BoonslickRPC  @US_EDA  @mpennyR3Sup", "2020-06-17T20:13:43.000Z": ". @ranken 's groundbreaking for the Lincoln County workforce development training center is a great step forward!\n\nThe State of Missouri provided $1 million for the new center - proud to support this partnership between @Linc_R3 , #Ranken , Lincoln County, and the City of Troy.", "2020-06-17T15:07:14.000Z": "Yesterday, Governor Parson celebrated the expansion of @BurnsMcDonnell . This expansion is a great sign of the continued economic growth in #MO despite the challenges of #COVID19 . We're excited to see economic activity as we continue working toward economic recovery. #ShowMeStrong Quote Tweet Burns & McDonnell @BurnsMcDonnell \"We're proud of Missouri's infrastructure workers who have continued to safely move essential projects forward even during this challenging, unprecedented time in our state,\" @GovParsonMO said. #OnSiteThroughItAll  #CriticalInfrastructure  https:// hubs.ly/H0rzrVM0", "2020-06-17T18:26:48.000Z": "Exciting developments today in Lincoln County in partnership with @ranken . Building a skilled workforce through programs like this is essential for economic growth in our state. Quote Tweet Brian Hauswirth @Brianontheair UPDATE: Missouri @GovParsonMO has announced that Ranken Technical College is establishing a new campus in the Lincoln County community of Troy. The 25,000 square foot facility is set to open in the fall of 2021. A groundbreaking ceremony took place this morning. #moleg", "2020-06-17T15:48:58.000Z": "Great to join Marc Cox this morning on @971FMTalk .  Missouri is open for business and ready to get back to work!", "2020-06-17T15:01:37.000Z": "This is great news for southwest Missouri! \n\nWe are working hard to bring new jobs to Missourians across our state. Missouri governor: 250 new jobs coming to \"small town pretty close to Bolivar\" (AUDIO) - Missourinet Missouri's governor says 250 new agricultural-related jobs are coming to southwest Missouri. Governor Mike Parson made the announcement during a briefing with Capitol reporters in Jefferson City on... missourinet.com", "2020-06-17T00:16:35.000Z": "Infrastructure projects will bring jobs BACK to our state.", "2020-06-16T22:12:20.000Z": "Missouri is getting back to business!\n\nSign up here to show your support for FULLY OPENING our state  https:// mikeparson.com/mo-fully-open/", "2020-06-16T20:30:00.000Z": "We are prepared and Missourians across the state are ready to move forward. Parson: Missouri is prepared and ready to reopen for business on Tuesday - Missourinet Missouri will fully reopen for business on Tuesday morning, and will enter phase two of its \"Show Me Strong Recovery Plan.\" Governor Mike Parson tells Capitol reporters in Jefferson City that the... missourinet.com", "2020-06-16T19:18:51.000Z": "I will always stand with the men and women of our law enforcement community. \n\nAs a former Polk County Sheriff, I am honored to have the support of leaders like Sheriff Ruth Ann Dickerson.", "2020-06-16T14:01:56.000Z": "Missouri is FULLY OPEN", "2020-06-16T00:42:02.000Z": "We are moving MISSOURI forward. Join @TeamParsonMO by signing up here: Team 57 - Parson for Missouri Help Governor Parson defend the American dream by joining Team 57. mikeparson.com", "2020-06-15T16:30:58.000Z": "Our state will be FULLY OPEN tomorrow. \n\nMissourians are prepared and ready to get back to work. 'Open for business': Missouri moves to 'fully reopen' while COVID-19 is 'still out there' The second phase of Gov. Mike Parson's Missouri reopening plan means there will be no statewide health order, he said Thursday. themissouritimes.com", "2020-06-15T15:16:28.000Z": "Today's \"Make A Vet Smile!\" comes to us from Mt. Vernon. Veterans at the Mt. Vernon Veterans Home offer advice to 2020 graduates.", "2020-06-14T16:03:00.000Z": "Happy Birthday to our Commander in Chief.", "2020-06-14T12:02:00.000Z": "Very fitting that the Army's birthday and Flag Day share June 14. \n\nI served six years in the United States Army, and it wasn't until I served in the Army that I understood the true meaning of our American Flag.", "2020-06-12T20:31:03.000Z": "This is GREAT news from @GovParsonMO !\n\nThese last few months have exemplified the resiliency of our people. I have absolute confidence Missourians will recover strong and I couldn't be prouder to represent such strong and resilient individuals. Back in business: Parson says state is lifting all restrictions on June 16 Missouri will be fully open for business beginning June 16,Governor Mike Parson said during a press briefing Thursday. Beginning Tuesday, June 16, Parson said Missouri will move into Phase 2 of the... krcgtv.com", "2020-06-13T23:20:00.000Z": "Missouri is taking the next step forward to get Missourians working again! Gov. Parson To Drop All Of Missouri's Coronavirus Restrictions Next Week Updated at 6:30 p.m. June 11 with plan details Missouri Gov. Mike Parson announced Thursday he will allow all businesses in the state to open without news.stlpublicradio.org", "2020-06-13T20:32:58.000Z": "Latest Poll: Missourians are ready to rebuild! \n\nBIG momentum for @TeamParsonMO !", "2020-06-13T16:43:21.000Z": "Watch the full interview here: Neil Cavuto - June 13 youtube.com", "2020-06-13T16:43:20.000Z": "We are prepared to move forward, and I am confident Missouri is ready to fully open on Tuesday.", "2020-06-13T13:29:11.000Z": "I will be joining @TeamCavuto this morning at 9:00am. We will be discussing Missouri's strategy to FULLY open on Tuesday. Tune in LIVE on @FoxNews", "2020-06-12T22:30:00.000Z": "It's time to begin repairing our economy and getting Missouri businesses, communities, and citizens back on their feet.", "2020-06-12T21:30:00.000Z": "We are fully opening Missouri and making sure that people can get back to work.\n\nChip in $5 today to help us continue fighting for the American Dream. Donate today! WinRed - Our technology changes how conservative & center-right groups fundraise online. Join now to start winning in 2020! secure.winred.com", "2020-06-12T19:01:23.000Z": "In case you missed it: Yesterday's Studio 57 episode on fully reopening Missouri. Follow @TeamParsonMO for future Studio 57 episodes!", "2020-06-12T18:00:00.000Z": "Missourians across the state know that it's time to FULLY REOPEN! 'Open for business': Missouri moves to 'fully reopen' while COVID-19 is 'still out there' The second phase of Gov. Mike Parson's Missouri reopening plan means there will be no statewide health order, he said Thursday. themissouritimes.com", "2020-06-12T17:51:35.000Z": "On Tuesday, Missouri will be fully open for business. \n\nThe health and safety of Missourians will continue to be our number one priority: We have met the standards to reopen We have increased testing capacity We are prepared to deal with any potential hotspots", "2020-06-12T17:22:50.000Z": "We will be FULLY opening Missouri for business on Tuesday.\n\nMissourians are prepared for this and are ready to move Missouri forward. Back in business: Parson says state is lifting all restrictions on June 16 Missouri will be fully open for business beginning June 16,Governor Mike Parson said during a press briefing Thursday. Beginning Tuesday, June 16, Parson said Missouri will move into Phase 2 of the... krcgtv.com", "2020-06-12T00:34:00.000Z": "Missouri continues to receive and distribute PPE across the state. Yesterday, the state reached a record PPE shipment:", "2020-06-12T00:00:00.000Z": "Governor Parson is leading the greatest economic comeback in Missouri history. Missouri to fully reopen, enter Phase 2 of recovery plan on June 16 Gov. Mike Parson announced that Missouri will fully reopen and enter Phase 2 of its \"Show Me Strong Recovery\" Plan on Tuesday, June 16. ky3.com", "2020-06-11T23:00:08.000Z": "Governor Parson is fully opening Missouri!", "2020-06-11T21:09:26.000Z": "On Tuesday, Missouri will be FULLY open.", "2020-06-10T21:00:36.000Z": "We have made great progress in moving Missouri forward out of this crisis. Hospitalizations are down Testing continues to increase", "2020-06-10T15:50:23.000Z": "Doing away with law enforcement officers is not the answer.\n\nIt will take all of us working together to move forward and keep our communities safe. Parson on 'defund the police' calls: 'Doing away with officers is not an answer' Amid a growing charge across the U.S. to \"defund the police,\" Gov. Mike Parson said he does not support \"doing away with\" law enforcement. themissouritimes.com", "2020-06-10T15:39:41.000Z": "This morning, I joined the @PeteMundo Morning Show to discuss the process of reopen Missouri's economy and the recent civil unrest. We continue to open our economy We continue to fight the COVID-19 virus, esp. through social distancing\n\nWe have to do BOTH!", "2020-06-10T14:43:07.000Z": ". @MSHPTrooperGHQ pilots are experts in rescues under adverse conditions & darkness, using night-vision goggles & infrared cameras. This week, an aircraft team rescued 2 people at 1AM after they became stranded on a float trip in an inaccessible area of Cooper County. Great work!", "2020-06-10T02:23:14.000Z": "Tonight, I attended the visitation for the late Retired St. Louis Police Captain & Moline Acres Police Chief David Dorn who was shot and killed on June 2. \n\nThank you Chief Dorn for 44 years of faithful service to the St. Louis region and the State of Missouri.", "2020-06-09T20:06:12.000Z": "In the midst of everything, we must also continue moving forward on the COVID-19 front.\n\nPhase 1 of our recovery plan expires on Monday, June 15, and we will be addressing that during Thursday's briefing.", "2020-06-09T18:45:20.000Z": "Four St. Louis Metropolitan Police Officers were shot in downtown St. Louis during the violence on June 1.\n\nI've spoken with each of them to check on their health and to let them know they have my wholehearted gratitude for serving their community.", "2020-06-09T16:22:58.000Z": "Glad to see our Missouri National Guard troops return safely from assisting police last week in Washington D.C. Missouri troops return from Washington Guardsmen provided security around the White House during protests stltoday.com", "2020-06-08T21:30:00.000Z": "\"The President and Governor Parson are working hard to protect the integrity of our elections and the safety of voters. It's important to give voters a commonsense choice.\" - Representative Peggy McGaugh\n\nFull Episode -> https:// youtu.be/riBR2mOuu5Y", "2020-06-08T18:21:53.000Z": "The election protection bill provides a safe, secure, and legal way to vote under these extraordinary circumstances while protecting against legitimate concerns about voter fraud.", "2020-06-08T18:20:43.000Z": "Any Missourian affected by COVID-19 should still be able to vote, including those who are sick or considered at-risk. Missouri Governor Signs Bill Making Absentee Voting Easier For Some In Pandemic Missouri Gov. Mike Parson on Thursday signed legislation allowing people at higher risk of contracting the coronavirus to vote absentee without needing an news.stlpublicradio.org", "2020-06-08T14:58:19.000Z": "Today and tomorrow @HealthyLivingMo & @Missouri_NG teams will be in PLATTE COUNTY testing for COVID-19. \n\nRegister at: http:// health.mo.gov/communitytest Quote Tweet Platte County Health Department @plattehealth DHSS & MO National Guard will hold a Free COVID19 testing event for Platte County. June 8th & June 9th from 7a -7p Platte County R-III Middle School.\n\nRegister online https:// health.mo.gov/communitytest . For those who do not have the ability to register online, they can call 877-435-8411.", "2020-06-06T20:00:01.000Z": "Governor Parson is protecting the voter and the vote! \n\nFull Video -> https:// youtu.be/rjfrG9qOxmI", "2020-06-06T16:47:16.000Z": "June 6, 1944, Allied troops from the United States, the United Kingdom, Canada, Free France & Norway fought for freedom along Normandy's coast.\n\nLast year, Teresa & I had the privilege to visit the Normandy American Cemetery and Memorial in France to lay a wreath in memory. #DDay", "2020-06-06T14:01:39.000Z": "76 years ago today, an estimated 12,004 men and women lost their lives. D-Day was a pivotal moment for the Allies in WWII. We remember the bravery and sacrifice of those liberators on this \"Day of Days\". #DDay76thAnniversary", "2020-06-06T15:37:00.000Z": "Missouri is leading the way with a common-sense solution that ensures Missourians can vote safely this year while still protecting the standards of our elections against fraud. We must protect the voter and the vote! How Missouri protected the vote while also protecting the voter States across the country are addressing the challenge of holding an election in an environment where some voters are sure to have lingering concerns about the coronavirus. But those that rush to... washingtonexaminer.com", "2020-06-05T23:58:02.000Z": "Missourians deserve commonsense choices to safely cast their ballot while maintaining the integrity of our elections. I'm proud to have signed the election protection bill to protect the voter and to protect the vote. Legislature struck right balance with voting bill; Governor Parson should sign it SB 631 is a good faith effort by the legislature to give voters at risk or concerned about contracting COVID-19 the opportunity to vote. news-leader.com", "2020-06-04T22:37:11.000Z": "Protects the voter, protects the vote Ensures one ballot per person Ballot Harvesting is illegal Absentee ballots must be requested and will not be sent to inactive voters All ballots must be cast and received by election day #moleg Quote Tweet Mike Parson @mikeparson Today, I signed the election protection bill into law.\n\nMissourians affected or concerned by COVID-19 should be able to vote, including those who are sick or considered more at-risk. Show this thread", "2020-06-04T21:44:59.000Z": "Thanks to @GovParsonMO for signing this commonsense historic legislation passed by the Missouri legislature that protects against ballot harvesting and ensures ballot access that protects every #voter and their #vote during the #2020Elections", "2020-06-04T22:14:09.000Z": "Today, I signed the election protection bill into law.\n\nMissourians affected or concerned by COVID-19 should be able to vote, including those who are sick or considered more at-risk.", "2020-06-04T16:32:09.000Z": "I will give a briefing at 3pm today on Facebook LIVE.\n\nJoining me:\n Director Rob Dixon, @MoEcoDevo  Adjutant General Brigadier General Levon Cumpton, @Missouri_NG  Director Dr. Randall Williams, @HealthyLivingMo", "2020-06-03T17:13:02.000Z": "This report highlights states slow to get relief funds to rural towns and communities. \n\nProud to say Missouri is NOT on that list as @GovParsonMO works FOR our rural communities and small towns because that's where he's from. STUDY: 32 States Are Withholding COVID Relief Funding From Most Rural Governments - Ways and Means... Thirty-two states are withholding federal funds from local governments according to data compiled by the National League of Cities, confirming reports that local governments are not receiving... gop-waysandmeans.house.gov", "2020-06-02T23:17:36.000Z": "--GEORGE FLOYD SHOULDN'T HAVE DIED ON MAY 25.\n\n--RETIRED ST. LOUIS POLICE OFFICER DAVID DORN SHOULDN'T HAVE DIED LAST NIGHT.\n\n--FOUR ST. LOUIS POLICE OFFICERS SHOULDN'T HAVE BEEN SHOT LAST NIGHT.", "2020-06-02T17:14:38.000Z": "I will give a briefing at 4pm today on Facebook LIVE.\n\nJoining me:\n Adjutant General Brigadier General Levon Cumpton, @Missouri_NG  Director Sandy Karsten, @MoPublicSafety  Director Dr. Randall Williams, @HealthyLivingMo *This replaces the briefing at 3pm.", "2020-05-31T02:28:08.000Z": "Today I signed Executive Order 20-11 to declare that a State of Emergency exists in Missouri due to civil unrest. The Missouri National Guard and the Missouri Highway Patrol stand ready to support local authorities. https:// governor.mo.gov/press-releases /archive/governor-parson-activates-missouri-national-guard-assist-local-authorities ", "2020-05-29T20:03:28.000Z": "Voting is a critical part of our democracy. \n\nI was able to cast my absentee ballot while in Bolivar today. Thank you to the county clerks and election authorities across the state who are working hard to keep our elections safe and secure.", "2020-05-29T17:08:56.000Z": "Governor @mikeparson has spent his career risking his life to defend every American's right to vote, serving our nation and Missouri in the military and as a Sheriff.  As Governor he works each and every day to protect the people of our great state... #moleg  #mogov", "2020-05-28T20:01:37.000Z": "Today, I am extending the Phase 1 Order through Monday, June 15.\n\nWe are very pleased with how well Phase 1 has gone so far. Businesses, communities, and Missourians across the state have been implementing health & safety measures, and we are encouraged by data across the state.", "2020-05-27T19:07:21.000Z": "All the testing that we do now prepares us for this fall. By reaching 7,500 tests per day, we will continue to fight this virus and get our economy going again.", "2020-05-27T02:04:21.000Z": "Missourians were able to hear how Governor Parson is moving the state forward during the #MoTownHall tonight. Join our team and help make sure ALL Missourians have the opportunity to achieve the American Dream.  https:// mikeparson.com/team-57/", "2020-05-27T02:03:01.000Z": "Thanks for joining us for tonight's live Town Hall.", "2020-05-27T01:57:55.000Z": "#MoTownHall We are prepared for a possible second wave @GovParsonMO", "2020-05-27T01:56:25.000Z": "#MoTownHall viewer question from Sheila Schneider asks: will there be a Missouri State Fair this year? People need to make plans. The Governor expects a fair in some form, possibly without concerts", "2020-05-27T01:43:17.000Z": "I get up and go to work every day to make sure that our sons and daughters can live the American dream. Missourians aren't afraid of hard work, and I know that we'll get through this. #MOTownHall", "2020-05-27T01:12:36.000Z": ". @GovParsonMO on future of stay at home....we want people able to get out, get sports back. Will be different in different parts of the state #MoTownHall", "2020-05-26T22:09:15.000Z": "Placing Medicaid expansion on the August ballot is a matter of policy, not politics.\nIt's important that Missourians are able to make this decision as soon as possible. Pass or fail, we need as much time as possible to make appropriate budgetary decisions moving forward.", "2020-05-26T19:00:00.000Z": "It is critical that we get Missourians back to work.  Increased testing will ensure that people can safely return to their jobs and get our economy moving again. Reopening the economy only works if people return to work Governors must have the courage to act. washingtonexaminer.com", "2020-05-26T18:08:29.000Z": "Tonight we'll be talking about moving forward and our state's recovery efforts.\n\nSubmit your questions and tune in at 8 p.m. Ask the governor or our guests a question during 'Moving Forward: A Missouri Town Hall' ST. LOUIS, Mo. - The state of Missouri has been re-opened for almost three weeks. Tuesday night we sit down with Governor Mike Parson during Moving Forward: A Missouri Town Hall. We will talk fox2now.com", "2020-05-25T13:30:00.000Z": "Join me and Teresa in setting aside time today to remember and recognize the brave men and women who made the ultimate sacrifice defending our nation.", "2020-05-24T18:00:00.000Z": "We are building our team to win in November. Join us to help move Missouri forward here -> https:// mikeparson.com/team-57/", "2020-05-23T22:00:00.000Z": "We are working every day to defend the American dream here in Missouri. Chip in $5 to show your support! Donate today! WinRed - Our technology changes how conservative & center-right groups fundraise online. Join now to start winning in 2020! secure.winred.com", "2020-05-23T19:00:01.000Z": "Always enjoy spending a little time at home on the farm.", "2020-05-23T14:28:23.000Z": "As you celebrate with friends and family this weekend, be cautious, and practice social distancing.", "2020-05-22T23:30:00.000Z": "Team 57 is working hard to gear up for November! Join our team here -> Team 57 - Parson for Missouri Help Governor Parson defend the American dream by joining Team 57. mikeparson.com", "2020-05-22T18:00:00.000Z": "Our new three-part testing plan will not only help us fight this virus now but prepare us for this fall. By working together, we will come out of this stronger than before.", "2020-05-22T17:01:16.000Z": "Great to be on The Marc Cox Show @971FMTalk yesterday to talk about testing and getting Missourians back to work!", "2020-05-22T16:30:00.000Z": "The more Missouri-based data we have, the better equipped we are to move forward. Our new three-part testing strategy will be vital to recovery as we get people back to work. COVID-19 testing to expand locally and statewide Expanded testing across the state will be a key component of Missouri's recovery plan for battling COVID-19. newspressnow.com", "2020-05-22T15:33:23.000Z": "Missouri @GovParsonMO not only allows graduation, but keynotes granddaughter's ceremony http:// bit.ly/3gcN5Hp", "2020-05-22T15:06:19.000Z": "Our plan focuses on three strategies: box-in outbreaks sentinel testing community sampling \n\nWe have already been utilizing these strategies and will ramp up even further to meet our 7,500 tests per day goal.", "2020-05-22T15:06:18.000Z": "The more testing we do, the more data and knowledge we have on the situation in Missouri, and the more confidence and reassurance we can give Missourians as we work through the recovery process. Governor Parson Announces Plan To Rapidly Increase COVID-19 Testing Volume In Missouri - Parson... Governor Mike Parson announced a plan to rapidly increase COVID-19 testing volume to 7,500 tests per day in Missouri. Expanding testing capacity and volume is one of the four pillars of Missouri's... parsonupdates.com", "2020-05-21T19:10:15.000Z": "I am proud to speak at my granddaughter's high school graduation ceremony tonight. Missouri governor not only allows graduation, but keynotes O'FALLON, Mo. (AP) - In a year when many states are prohibiting in-person graduation ceremonies due to the coronavirus, Missouri Gov. Mike Parson is not only allowing them, but also spoke at one. The... news.yahoo.com", "2020-05-21T18:00:01.000Z": "The First Lady & I were able to light up the Governor's Mansion in honor of Missouri's graduates last night. We are proud of the Class of 2020 for their hard work & resilience during this time. You make the Show-Me State proud! 2020 graduates honored at Governor's Mansion Graduation may not look like what 2020's seniors originally envisioned it to be, because of the COVID-19 pandemic, but strange times have also led to new ways for graduates to celebrate their achievem newstribune.com", "2020-05-21T17:20:12.000Z": "The Missouri National Guard is mission-driven, and with their help, we will hit our goal of 7,500 tests per day.\nWe are using all available resources to increase testing, and I'm proud of the work being done by our troops to get the job done.", "2020-05-21T17:00:00.000Z": "The Missouri National Guard stands ready to help us accomplish our mission. With their help, I have no doubt that we will meet our goal of 7,500 tests per day. Missouri National Guard to assist with expanding COVID-19 testing The announcement comes as Missouri continues to put emphasis on increased COVID-19 testing. columbiamissourian.com", "2020-05-21T14:45:30.000Z": "Missourians deserve the most accurate and up-to-date information. \n\nStay informed by viewing the Missouri-specific data being used to make decisions as we reopen our state. Governor Parson Announces Launch Of New COVID-19 Dashboard - Parson Updates Governor Mike Parson announced the launch of a new COVID-19 dashboard containing Missouri-specific data from across the state. \"Throughout COVID-19, we have worked very hard to be transparent and... parsonupdates.com", "2020-05-20T23:30:00.000Z": "Missouri is on the road to recovery. We are working hard to move Missouri forward and get people back to work. Contribute today to show your support. Donate today! WinRed - Our technology changes how conservative & center-right groups fundraise online. Join now to start winning in 2020! secure.winred.com", "2020-05-20T20:54:59.000Z": "Missouri's governor said Wednesday that the National Guard will be key in getting to 7,500 COVID-19 tests per day. Missouri National Guard to play major role in ramping up COVID-19 testing - ABC17NEWS Gov. Mike Parson and state leaders are set to give an update on Missouri's response to the COVID-19 pandemic at a daily 3 p.m. briefing. abc17news.com", "2020-05-20T20:48:33.000Z": "We are working hard to expand testing.\n\nBy increasing testing, we will continue to slow the spread and box-in this virus. Our goal is 7,500 tests per day.", "2020-05-20T19:50:00.000Z": "Testing is key to moving our state forward and putting Missourians back to work. \n\nAs testing becomes more available, Missourians will have the confidence to engage with their communities and local businesses again. Missouri lags in COVID-19 testing as governor sets goal of 7,500 a day His announcement comes as a study showed Missouri ranks 41 out of 50 states in the number of per capita tests administered. stltoday.com", "2020-05-20T18:56:29.000Z": "As we increase testing in Missouri, it is important to remember that we will see more positive cases of COVID-19.\n\nRamping up testing will not only help us fight this virus now, but it is vital to helping us prepare for this fall when schools are back in session.", "2020-05-20T15:03:35.000Z": "Testing is critical to Missouri's full economic recovery and it gives Missourians the confidence to engage in their local communities. \n\nWe have the testing capacity, and now we are finding ways to use that capacity to test as many people as possible. Governor Parson Emphasizes Importance Of COVID-19 Testing To Economic Recovery - Parson Updates Governor Mike Parson emphasized the importance of COVID-19 testing to economic recovery in Missouri. \"As we move forward, testing will be critical to Missouri's full economic recovery and giving... parsonupdates.com", "2020-05-19T23:30:00.000Z": "We are working hard to get Missourians back to work and our economy back on track. Join our team.  https:// mikeparson.com/team-57/", "2020-05-19T20:36:54.000Z": "Don't delay preventative care! Medical providers, such as dentists and optometrists, can provide services at their discretion.\n\nMedical providers have implemented new health and safety measures using http:// showmestrong.mo.gov in addition to any @CDCgov guidance.", "2020-05-19T20:28:32.000Z": "Throughout this crisis, we have used Missouri specific data to determine the actions that our state takes. We will continue to make decisions based on data, and testing is essential for ensuring that we have accurate data.", "2020-05-19T19:06:47.000Z": "We have significantly increased our testing capacity, and now we must increase the number of tests being done. As we do this, it is important to remember that the more tests we do, the more positive cases there will be. Parson says state targeting long-term care facilities for widespread coronavirus testing 'The more tests we do, the more positive cases there will be,' Parson said. stltoday.com", "2020-05-19T17:15:00.000Z": "Testing is critical. It's how we will continue to move our state forward.\n\nWe are working to expand testing criteria so that Missourians feel safe and to ensure that anyone in a high-risk setting can be tested.", "2020-05-19T16:10:08.000Z": "We are working hard to continue improving COVID-19 testing in high-risk areas across the state, and we have prioritized testing in long-term care facilities. Governor: Virus testing focus on long-term care facilities LIBERTY, Mo. (AP) - Missouri is expanding coronavirus testing to high-risk places where people are in close contact, with an emphasis on long-term care facilities, Gov. Mike Parson said... apnews.com", "2020-05-19T15:25:26.000Z": "Last month, we launched a new tool developed by @googlecloud to help health care providers connect with Missouri manufacturers & suppliers of PPE.\n\nThe PPE Marketplace tool is a joint effort with @MOHospitals , built to connect manufacturers with buyers. Helping Manufacturers During Coronavirus | Google Cloud Blog While the manufacturing industry retools to offer immediate assistance, the longer term implications of the coronavirus will require a systemic approach cloud.google.com", "2020-05-18T18:54:56.000Z": "I'm proud of the hard work that's been done to get our testing to this point. We are going to continue working with physicians & healthcare providers to ensure that we protect the health and safety of all Missourians.", "2020-05-18T18:54:55.000Z": "Expanding testing is critical as we continue the of reopening Missouri. We have made great strides in growing our capacity throughout the state.", "2020-05-18T17:01:06.000Z": "Ford assembly plant employees are heading back to work in Claycomo. \n\nWe're working hard to make sure that Missourians stay healthy while we restart our economy!", "2020-05-17T13:52:18.000Z": "We've seen manufactures retool to make PPE here in America, & the CARES package is helping millions. This hard work is how we will recover & emerge from this even stronger than before.", "2020-05-17T13:52:17.000Z": "President Trump & Vice President Pence have moved mountains to lead us through the COVID-19 pandemic. Missouri governor praises Trump admin's COVID-19 response: 'Almost moved mountains' MIssouri Gov. Mike Parson, R, defended the Trump administration's response to the coronavirus pandemic, arguing on Saturday that the president and vice president \"did nothing but almost move mounta... foxnews.com", "2020-05-17T00:49:08.000Z": "Big thanks to @TeamParsonMO for working hard to help us get ready for our 2020 sign blitz! Request yours today! -> https:// mikeparson.com/team-57/", "2020-05-16T20:00:00.000Z": "While we are working to reopen our state, we must remember that the virus is still here. ALL Missourians play an important role in combating COVID-19 and must continue to practice social distancing.", "2020-05-16T15:38:01.000Z": "Link to the full interview here -> Gov. Mike Parson on reopening Missouri, impact of COVID-19 on jobs... Missouri's stay-at-home order expired on May 3; insight from Gov. Mike Parson. video.foxnews.com", "2020-05-16T15:37:14.000Z": "I'm proud to be the governor of this state and a citizen of our country.\n\nI Joined @TeamCavuto this morning to talk about what we've been able to accomplish in the last 60 days and how our state is moving towards recovery.", "2020-05-15T22:30:00.000Z": "We were able to see new safety procedures in action at the Ford plant in Claycomo. Ford is committed to keeping Missourians safe as they resume operations on Monday. \n\nI'm hopeful that more Missourians will be headed back to work as we move to manufacture PPE right here in MO.", "2020-05-15T19:21:56.000Z": "It was great to meet with local leaders, police, and businesses yesterday in Cape Girardeau. \n\nNow is the time to buy local and support our small businesses. https:// wsiltv.com/2020/05/14/mis souri-gov-mike-parson-discusses-economic-recovery/ ", "2020-05-15T14:22:49.000Z": "Last week, severe storms blasted southern Missouri. \n\nThe result was extensive damage to homes & businesses. As well as additional emergency response costs to communities that are already strapped by mounting expenditures because of COVID-19. Governor Parson Begins Process To Obtain Federal Disaster Assistance For Severe Storms In Missouri... Governor Parson Requests Damage Assessments for 19 Missouri Counties Governor Mike Parson announced he has begun the process to obtain federal disaster assistance for Missouri in response to severe... parsonupdates.com", "2020-05-14T21:38:28.000Z": "Governor Mike Parson wants you to join his grassroots team. Team 57 is comprised of Governor Parson's top supporters who are leading the fight to secure the American Dream for ALL Missourians. -> https:// mikeparson.com/team-57/", "2020-05-14T17:36:41.000Z": "One of our primary focuses during this pandemic has been expanding access to testing. \n\nWe are working with physicians & healthcare providers to ensure that they understand the importance of testing, to protect the health and safety of Missourians. Governor Parson Announces Priorities For Expanded Access To Testing - Parson Updates Governor Mike Parson announced a series of testing priorities designed to detect and rapidly contain potential COVID-19 outbreaks as the state gradually reopens its economy. \"One of our primary... parsonupdates.com", "2020-05-13T18:14:35.000Z": "The @Missouri_NG has been preventing the spread of COVID-19 by conducting medical screenings at government facilities throughout the state, including the State Capitol. This afternoon, I took a moment to stop by the stations and thank our Citizen-Soldiers for their hard work.", "2020-05-13T17:30:00.000Z": "We are working hard to protect the health of all Missourians while getting our economy going again.\n\nYesterday, we announced some potentially big news about Missouri businesses being called on by the federal government to manufacture PPE for those who need it across the country.", "2020-05-13T16:23:10.000Z": "Missouri citizens and businesses are eager to get back to work, and now more than ever, they need our support to get back on their feet.", "2020-05-13T16:23:09.000Z": "The health and safety of Missourians will always be our top priority.\n\nAs we move forward, we must also work together to develop and institute resilient and sustainable economic initiatives that promote prosperity in our state. https:// myleaderpaper.com/news/state/par son-talks-economic-recovery-as-state-beings-reopening/article_f14e5111-5dbe-5b88-aa1c-51128b197c90.html ", "2020-05-13T13:38:00.000Z": "Missourians are beginning to safely re-engage in the economy, and businesses across our state have stepped up to implement new measures that will keep employees and customers safe. Governor Parson Highlights Missouri's Economic Recovery Plan - Parson Updates Governor Mike Parson discussed the economic recovery portion of the \"Show Me Strong\" Recovery Plan. \"I'm glad to see Missourians begin to safely re-engage in the economy, and we are thankful for the... parsonupdates.com", "2020-05-12T14:41:28.000Z": "I am proud of our Citizen-Soldiers and Airmen who play a major role in supporting state and community operations as we combat COVID-19. #MissouriProud Quote Tweet Missouri National Guard @Missouri_NG The 139th Airlift Wing assisted the Department of Health and Senior Services over the past couple of weeks to test employees at Triumph Foods in St. Joseph Mo., for coronavirus. The Missouri National Guard is always ready to assist our state partners and the citizens of Missouri.", "2020-05-12T15:12:09.000Z": "Yesterday we saw the lowest daily increase in new reported cases of COVID-19 since mid-March. This is ecouraging news and shows that social distancing is working.\n\nEverybody must continue to practice social distancing so that Missouri can continue moving in the right direction.", "2020-05-11T18:30:00.000Z": "Together, Missourians can accomplish anything. We came together and slowed the spread of COVID-19.\n\nJoin Team 57 and help Governor Parson continue to lead Missouri through recovery and secure the American Dream for all Missourians. -> https:// mikeparson.com/team-57/", "2020-05-11T17:30:00.000Z": "I am proud of the businesses that are stepping up to help customers and employees feel safe again.\n\nPeople are using common sense, and they were doing what they were being asked to do to stay healthy. Governor, first lady explore how merchants adapt to pandemic There was another unusual sight at a couple Jefferson City stores Thursday, and it was not limited meat products, shoppers wearing masks or social distancing stickers on the floor. newstribune.com", "2020-05-11T16:20:00.000Z": "Missourians are eager to get back to work and get our economy going again.\n\nAs we reopen our state, businesses are leading the way and putting measures into place that will protect their employees and customers. It's ok to start being engaged in our economy again.", "2020-05-11T15:21:26.000Z": "We need to be dependent on ourselves and our own resources, not those of other countries. \n\nBuilding a supply chain of our own in-state manufacturers for vital medical equipment will be an important part of our recovery efforts. US governors aim to boost production of medical supplies JEFFERSON CITY, Mo. (AP) - Frustrated by scarce supplies and a chaotic marketplace amid the coronavirus outbreak, some U.S. governors are seeking to bolster their home-state production of vital... apnews.com", "2020-05-10T13:00:00.000Z": "Happy Mother's Day to the woman I met over 35 years ago that trusted me to come into her children's lives, and love and take care of them like my own. She exemplifies what a mother's love really means. \n\nWishing Teresa and all mothers a wonderful day!", "2020-05-08T21:45:00.000Z": "Missouri is proud to have @pfizer working to combat COVID-19 in our state.\n\nTheir facility in Chesterfield is among a few sites working at an unprecedented pace for a potential vaccine to fight this disease. Together, Missourians can accomplish anything. Pfizer facility in Chesterfield scaling up operations for COVID-19 vaccine production JEFFERSON CITY - During Thursday's, May 7, COVID-19 briefing, Gov. Mike Parson was joined by Christine Smith, head of the Pfizer Biotherapeutics and Pharmaceutical Sciences Department and site head of dailystarjournal.com", "2020-05-08T19:00:00.000Z": "COVID-19 has highlighted the importance of shopping local and supporting Missouri Businesses. \n\nTo find businesses produce and manufacture right here in the state, visit-> https:// buymissouri.net Parson highlights importance of supporting Missouri businesses, safely reengaging in economy JEFFERSON CITY - During Tuesday's, May 5, COVID-19 briefing, Gov. Mike Parson highlighted the importance of safely reengaging in the economy and supporting Missouri businesses. dailystarjournal.com", "2020-05-08T17:15:00.000Z": "The tourism industry in our state has been devastated by COVID-19. \n\nI am glad to see Lt. Gov. Mike Kehoe working hard to find ways highlight the tourism industry while keeping employees and visitors safe. Kehoe praises Missouri's recovery plan; emphasizes importance of expanding COVID-19 testing... Missouri's lieutenant governor is pleased with the state's \"Show Me Strong Recovery Plan,\" and says residents are ready to return to work. Lieutenant Governor Mike Kehoe (R) says the state has safely... missourinet.com", "2020-05-08T16:30:00.000Z": "Teresa and I spent part of yesterday morning at @HyVeeJCMO to talk about what they are doing to improve social distancing and sanitation.\n\nI'm proud of our businesses for working hard to keep employees and customers safe.", "2020-05-08T15:18:29.000Z": "For Missourians to feel safe going forward, we must be able to develop a COVID-19 vaccine.\n\nWe are proud of the Pfizer facility right here in Chesterfield, Missouri, is helping lead the charge Pfizer Facility in Chesterfield, Missouri, Scaling Up Operations for COVID-19 Vaccine Production -... Governor Mike Parson was joined by Christine Smith, head of the Pfizer Biotherapeutics and Pharmaceutical Sciences Department and site head of Pfizer's Research and Development facility in Chesterf... parsonupdates.com", "2020-05-07T19:06:39.000Z": "Team 57 is dedicated to supporting the governor's plan to rebuild our state and defend the American Dream.\n\nJoin Team 57 and help our state continue to move forward and into recovery. -> https:// mikeparson.com/team-57/", "2020-05-07T17:53:30.000Z": "The CARES Act Child Care Plan provides special assistance to child care providers who continue to support the needs of working families during COVID-19.\n\nWe're going to take care of the kids across our state and make sure that Missourians can get back to work.", "2020-05-07T14:57:02.000Z": "Temporary changes will make it possible for more low-income Missouri families to qualify for child care assistance and some families will also see an increase in benefits.", "2020-05-07T14:57:01.000Z": "Missouri will receive $66 million under the CARES Act Child Care Plan to expand child care assistance to low-income families and to support child care providers. Missouri to Receive $66 Million for Child Care Assistance, $1.5 Million for Food Banks Under... Governor Parson announced that Missouri will receive $66 million for child care assistance and $1.5 million for food banks under the federal Coronavirus Aid, Relief, and Economic Security (CARES)... parsonupdates.com", "2020-05-07T13:34:40.000Z": "We are especially thankful for the freedoms we enjoy and pray that our state and its people will continue to be blessed and protected.\n\nWe will also be praying for the brave men and women that serve in our military, veterans, law enforcement, and first responders.", "2020-05-07T13:34:39.000Z": "Every year, Congress sets aside a day for National Day of Prayer and encourages us to pray for our nation. Today is National Day of Prayer, and Teresa and I would like to invite all Missourians to join us in prayer.", "2020-05-06T23:33:39.000Z": "\"All the decisions being made in the governor's office are data-driven. They are based on facts and realities on the ground.\" - Treasurer @FitzpatrickMO Studio 57 with Treasurer Scott Fitzpatrick Treasurer Scott Fitzpatrick discusses Governor Parson's plan to reopen Missouri. youtube.com", "2020-05-06T17:00:00.000Z": "Many of us have turned to shopping online during this time, but we must remember to shop local as we reopen Missouri. \n\nIt is a crucial time for our small businesses, and we can support them and their families while practicing social distancing. Parson: Recovery hinges on shopping locally Gov. Mike Parson said Tuesday that recovery from the disruptions of the COVID-19 pandemic will be driven by shopping locally. newstribune.com", "2020-05-06T16:15:00.000Z": "The reopening of our state will be a slow process as rebuild the economy. I am confident, however, that more businesses will continue to reopen every day. \n\nIt is vital that we support local businesses when they do reopen and so that their employees can get back to work.", "2020-05-06T15:38:51.000Z": "Day in and day out, nurses are hard at work responding and adapting to COVID-19 while at the same time providing care for ALL of our health care needs.\n\nTake some time this week to thank the people you know who selflessly serve as a nurse. #ThankYouNurses", "2020-05-06T15:22:48.000Z": "Join me for another COVID-19 briefing on Facebook at 3pm, along with:\n Acting Director Jennifer Tidball, @DSS_Missouri  Adjutant General, Brig. Gen. Levon Cumpton, @Missouri_NG  Director Dr. Randall Williams, @HealthyLivingMo  Director Sandy Karsten, @MoPublicSafety", "2020-05-06T15:30:00.000Z": "Shopping locally is the key to bringing back our economy in Missouri. Small businesses are the backbone of our state, and we need to support them now more than ever. Parson urges Missourians to support state-based businesses LIBERTY, Mo. (AP) - Gov. Mike Parson on Tuesday continued his optimistic message about the state's reaction to the coronavirus pandemic and urged state residents to return to work if possible and... apnews.com", "2020-05-06T15:00:03.000Z": "Expanding our testing capacity and volume continues to be a top priority as we open up Missouri. \n\nWe are moving in the right direction because we have been using Missouri based data to make smart decisions and informed decisions", "2020-05-06T14:48:41.000Z": "Will I still be able to participate in my local parks and recreation organized activities this summer?\n\nYes. Traditional summer activities such as utilizing aquatic facilities, fitness centers, organized athletics, etc. offer a variety of recreational opportunities for citizens. SHOW ME STRONG RECOVERY PLAN: PHASE I GUIDELINES AND FAQ governor.mo.gov", "2020-05-06T13:51:32.000Z": "We are on the road to recovery, & we must continue taking steps to protect ourselves & others. With that said, we encourage Missourians to safely re-engage in the economy.\n\nNow more than ever, Missouri businesses need our support to get back on their feet. Supporting Missouri Businesses & Safely Re-Engage in the Economy - Parson Updates Governor Mike Parson highlighted the importance of safely re-engaging in the economy and supporting Missouri businesses.    Governor Parson encourages Missourians to shop local and support Missouri... parsonupdates.com", "2020-05-06T01:03:40.000Z": "We've put together a team who have worked hard to protect Missourians and know what it takes to gradually and safely get our economy opening again. What They Are Saying | Governor Parson's Show Me Strong Recovery Plan: - Parson for Missouri On the first day of Missouri's reopening, Governor Parson joined the team at Bass Pro Shops in Springfield for a reopening ceremony. This was one of several stops on the first day of Phase One of the... mikeparson.com", "2020-05-05T22:45:04.000Z": "Since Day One, we've been focused on protecting the health and well-being of all Missourians. Now, we are also focused on getting our state back to work.", "2020-05-05T22:45:03.000Z": "There has not been a one-size-fits-all solution for the entire country during this crisis. All 50 states have had to make their own decisions based what works best for their citizens. Opinion | Five Republican governors: Our states stayed open in the covid-19 pandemic. Here's why... Restarting our economy is not a race to be won but a cooperative effort. washingtonpost.com", "2020-05-05T21:55:45.000Z": "Today @GovParsonMO and @LtGovMikeKehoe encouraged Missourians to #BuyMO and shop local to support our state's economic recovery. Learn more at http:// buymissouri.net . #moleg", "2020-05-05T19:59:58.000Z": "For #NationalTeacherDay I would like to recognize my daughter and all of our amazing Missouri educators.\n \nI know my daughter is one of many who misses her students during these unprecedented times. THANK YOU to our teachers for finding creative ways to educate students.", "2020-05-05T17:00:00.000Z": "Governor Parson is committed to rebuilding Missouri. Join Team 57 and be a part of the Grassroots Army dedicated to re-electing the governor. -> https:// mikeparson.com/team-57/", "2020-05-05T15:45:19.000Z": "Next COVID-19 update will be on Facebook LIVE today at 3pm. I will also share more information about our #ShowMeStrong Recovery Plan which started yesterday. \n\nJoining me today: \n Missouri @LtGovMikeKehoe  Director Todd Richardson, MO HealthNet/ @DSS_Missouri", "2020-05-05T15:30:00.000Z": "I want Missourians to know that we will be transparent. Posting this information in one public place will keep Missourians up-to-date and give them confidence that we are working hard to make every dollar count. Governor Parson Announces Distribution of Federal CARES Act Funds to Local Governments - Parson... Governor Mike Parson announced that the state will be disbursing funds received through the federal Coronavirus Aid, Relief, and Economic Security (CARES) Act to local governments today. \"COVID-19... parsonupdates.com", "2020-05-05T13:30:00.000Z": "\"I believe that Gov. Mike Parson has been very appropriate and responsible in his efforts to mitigate the spread of the novel coronavirus.\" - Dr. George Carr Letter: Parson protecting Missouri residents As a primary care physician in private practice I am caring for patients with COVID-19 infections, both in the office and in the hospital.There is a great deal of inaccurate and misleading informat... columbiatribune.com", "2020-05-04T21:32:56.000Z": "\"Missourians are ready to go back to work!\" - Lt. Gov. @Mikelkehoe", "2020-05-04T22:48:58.000Z": "Be sure to catch the latest Studio57 episode - @Shannon_Kirk28 talks with Lt. Gov. @Mikelkehoe about working alongside Gov. @mikeparson to re-open Missouri's economy #moleg Quote Tweet Team Parson (Text PARSON to 484848) @TeamParsonMO \"Missourians are ready to go back to work!\" - Lt. Gov. @Mikelkehoe", "2020-05-04T17:33:39.000Z": "Thank you, Lt. Gov @Mikelkehoe for being a part of our plan to reopen Missouri. Quote Tweet 93.9 The Eagle @939TheEagle (AUDIO) Lt. Gov Kehoe on Missouri reopening https:// post.futurimedia.com/kssz/playlist/ 6/listen-1307.html?cb=1588598864.094813 ", "2020-05-04T16:03:11.000Z": "Today we begin our deliberate and data-driven plan to reopen the state.\n\nBy using Missouri models, we are confident that we are prepared to begin putting Missourians back to work.", "2020-05-03T18:22:59.000Z": "We are all in the fight against this disease together, and Missouri will come out of it stronger than before.", "2020-05-03T18:22:58.000Z": "For the past few weeks, we have all had to make sacrifices and change our everyday lives. As we reopen the state, I want to urge everyone to continue making wise decisions and supporting each other along the way. Mike Parson: Show Me Strong Recovery is a blueprint to move Missouri past coronavirus The plan's four pillars will help everyone in the state get back on our feet together. kansascity.com", "2020-05-01T21:22:16.000Z": "Today, I am declaring Sunday, May 3, as a \"Day of Prayer\" across Missouri.\n\nJoin @FirstLadyTeresa and me in prayer for each other and for our state as we reopen the Great State of Missouri. We look forward to Monday, but please be safe, be smart, and be responsible.", "2020-05-01T23:25:02.000Z": "We are prepared to begin reopening our state. The trends in our data show that we are ready to safely move forward and put Missourians back to work. Governor Parson Highlights Plan to Reopen Missouri - Parson Updates Governor Parson highlighted the state's plan to reopen Missouri and emphasized that we are prepared to safely reopen on Monday, May 4.  \"I want to assure Missourians that we are prepared,\"  Governor... parsonupdates.com", "2020-05-01T16:42:59.000Z": "Thank you @HannahKellyMO for your continued support as we begin to reopen our state. Quote Tweet Missouri Farm Bureau @MOFarmBureau . @HannahKellyMO joins us on this week's #DiggingInPodcast to discuss the reopening of Missouri and its impact on rural Missouri. Search \"Digging In with Missouri Farm Bureau\" on your favorite podcast app! https:// mofb.org/state-rep-hann ah-kelly-on-reopening-missouri/ ", "2020-05-01T02:55:57.000Z": "We are becoming more prepared each day to reopen our economy and get Missourians back to work. \n\nIt was great to talk with @TeamCavuto today about our deliberate and data-driven reopen our state on Monday. Quote Tweet Neil Cavuto @TeamCavuto . @GovParsonMO on Missouri's reopen strategy", "2020-05-01T00:47:57.000Z": ". @GovParsonMO on Missouri's reopen strategy", "2020-05-01T00:56:53.000Z": "At the state level, my administration has worked with the investor-owned utility companies throughout Missouri to stop disconnects and shut-offs related to COVID-19, ensuring that Missourians would not have disruptions in utility services in the face of economic hardship.", "2020-05-01T00:56:52.000Z": "Our state has a number of options available for Missourians looking for housing assistance and resources amid the COVID-19 crisis. We CAN get through the COVID-19 challenge, and we WILL succeed. Governor Parson Highlights COVID-19 Housing Assistance for Missourians - Parson Updates During today's COVID-19 briefing, Governor Parson highlighted housing assistance and resources for Missourians amid the COVID-19 crisis.   Under the federal Coronavirus Aid, Relief, and Economic... parsonupdates.com", "2020-04-30T20:41:50.000Z": "This morning, I joined Lindsay Shively and Taylor Hemness from 41 Action News - KSHB-TV to talk about reopening our state.\n\nWe also talked about how the state is prepared in case we see a spike in cases four or five months down the road. Governor: Missouri more prepared now if second COVID-19 wave hits After releasing sweeping guidelines for a statewide reopening next week, Missouri Gov. Mike Parson said Thursday that he believes the state is more prepared to handle a potential second wave of the... kshb.com", "2020-04-30T15:09:15.000Z": "I will be on Facebook LIVE at 3pm to continue discussing our #ShowMeStrong Recovery Plan starting May 4.\n\nJoining me today:\n Commissioner Margie Vandeven, @MOEducation  Commissioner Zora Mulligan, @MODHEWD  Director Chlora Lindley-Myers, @MissouriDCI", "2020-04-30T15:43:23.000Z": "TUNE IN AT 11:00 a.m.- Joining @TeamCavuto on @FoxNews .", "2020-04-30T01:00:44.000Z": "One of the important pillars of our recovery plan is testing capacity.\n\nBetween the state health lab and at least 15 private labs and participating health care institutions, approximately 50,000 tests could be performed each week. Governor Parson Highlights Missouri Testing Capacity as State Prepares to Reopen on May 4 - Parson... As Missouri prepares to reopen on May 4, Governor Mike Parson highlighted the state's COVID-19 testing capacity.  Expanding testing capacity is essential for the state's recovery plan:  Expand... parsonupdates.com", "2020-04-29T13:40:52.000Z": "Because Missouri took aggressive actions to combat COVID-19 from the start, we are in a good place and I'm confident that we are ready to move forward and begin reopening our state.", "2020-04-29T11:54:58.000Z": "TUNE IN AT 7:20 a.m.- Joining @foxandfriends on @FoxNews to talk about Missouri's deliberate and data-driven plan to reopen our state.", "2020-04-28T22:24:11.000Z": "Because Missouri took aggressive actions to combat COVID-19 from the start, we are in a good place with each of these pillars and confident that we are ready to move forward and begin reopening our state. Governor Parson Highlights Data Supporting His Plan to Reopen Missouri - Parson Updates As Missouri prepares to reopen on May 4th, Governor Parson highlights data supporting the state's plan to move towards recovery.  The governor's plan is designed to give Missouri a benchmark for... parsonupdates.com", "2020-04-28T20:21:13.000Z": "Reopening Missouri will NOT just be the flip of a switch. The virus is still out there. Continue to maintain social distancing to protect yourself & others.\n\nFor our recovery to be successful, it is going to take EVERYONE taking proactive steps to mitigate the risk of COVID-19.", "2020-04-28T13:38:54.000Z": "Many States moving to SAFELY & QUICKLY reopen!", "2020-04-27T22:59:05.000Z": "A strategic \"reopening\" of Missouri's economy will not be successful without proactive steps taken by our state's businesses, communities, and citizens to mitigate the risk of COVID-19. By working together, we can accomplish anything and move Missouri forward.", "2020-04-27T22:59:04.000Z": "We are reopening Missouri on May 4th.\n\nThanks to the efforts and incredible sacrifices of Missourians who stayed home and practiced social distancing, we are successfully flattening the curve.", "2020-04-27T22:25:51.000Z": "Missouri took early, aggressive, and smart actions to slow the spread of COVID-19.\n\nTogether, We ARE winning the battle, and our recovery plan will reopen the state and get Missourians back to work. Governor Parson Announces Plan to Reopen Missouri in Phases - Parson Updates Governor Mike Parson has officially announced his plan to reopen Missouri which will put Missouri back to work and restard our economy beginning on Monday, May 4, 2020.  \"With favorable data and... parsonupdates.com", "2020-04-27T20:18:31.000Z": "ALL Missouri businesses can open on Monday, May 4, under our new Order as long as the guidelines are followed.\n\nMore info: https:// governor.mo.gov/press-releases /archive/governor-parson-announces-first-phase-show-me-strong-recovery-plan-begin-may ", "2020-04-27T16:50:59.000Z": "Today we announce our plan to reopen Missouri's economy!\n\nI will be LIVE at 3pm on Facebook to walk through the first phase of our Show Me Strong Recovery Plan starting May 4. Tune in here. --> https:// facebook.com/GovMikeParson/", "2020-04-27T15:49:11.000Z": "Today we announce our plan to reopen Missouri's economy!\n\nI will be LIVE at 3pm on Facebook to walk through the first phase of our Show Me Strong Recovery Plan starting May 4.\n\nJoining me today:\n CEO Herb Kuhn with @MOHospitals  Director Rob Dixon with @MoEcoDevo", "2020-04-25T16:30:00.000Z": "We are a model for how other state can find innovative ways to get PPE to those on the front line fighting COVID-19. \n\nI appreciate President @realDonaldTrump and VP @Mike_Pence for recognizing the work we are doing here in Missouri.", "2020-04-25T14:38:18.000Z": "Together, Missourians are able to accomplish anything and our Show-ME Strong Recovery Plan ensures that those who are at risk stay safe while we move Missouri forward. Missouri Gov. Parson: Plan for reopening coming next week Missouri Gov. Mike Parson began to speak Friday about what will be addressed in the state's guidelines for reopening. newstribune.com", "2020-04-24T22:16:49.000Z": "We are ready to rebuild Missouri's economy and put Missourians back to work. President Trump and VP Pence Praise Governor Parson's Plan to Rebuild Missouri's Economy and Put... As the state prepares to move into the economic recovery phase of COVID-19, Governor Mike Parson today signed Executive Order 20-09 extending the state of emergency in Missouri through June 15,... parsonupdates.com", "2020-04-24T21:49:20.000Z": "My family comes from rural Missouri, and while the liberal elitist papers try to divide us, we know that all Missourians have come together to defeat COVID-19.", "2020-04-24T21:48:55.000Z": "I believe in everybody in this state. Saying that people in rural Missouri don't understand the Coronavirus is uncalled for and disrespectful.", "2020-04-24T20:18:51.000Z": "Next week, we will officially introduce the reopening plan, which will take effect on May 4th. We know there have been a lot of questions about what the reopening will look like...", "2020-04-24T18:37:19.000Z": "Proud to highlight Missouri efforts to combat COVID-19 and the positive trends we are seeing in Missouri models during a call with @VP Mike Pence & other governors.\n\nBecause of quick actions taken by the state & everyday Missourians we have slowed the spread in MO! #ShowMeStrong", "2020-04-24T17:17:02.000Z": "Missourians have worked together throughout this unprecedented crisis, and it's why we are going to emerge from it stronger.", "2020-04-24T17:16:02.000Z": "Our Show Me Strong Recovery Plan uses a phased approach to get Missourians back to work while protecting those who are at risk.\n\nThank you, President @realDonaldTrump and Vice President @Mike_Pence for recognizing Missouri's important work to restart our economy.", "2020-04-23T20:06:01.000Z": "WATCH LIVE: Missouri Gov. Mike Parson updates on Coronavirus pandemic: https:// ky3.com/content/news/V irtual-briefing-from-Missouri-Gov-Mike-Parson-on-Coronavirus-pandemic-569011061.html ", "2020-04-23T17:03:36.000Z": "Today, Governor Mike Parson is holding another Q&A with reporters at the State Capitol at 3pm this afternoon. Reporters will be required to abide by the social distancing guidelines outlined in the \"Stay Home Missouri\" Order.", "2020-04-23T13:00:00.000Z": ". @kfvsnews : Gov. @mikeparson signs bills for license reciprocity military spouses\n\n\"Military spouses face considerable challenges when they relocate with their active duty partner, and finding a job in their licensed profession should not be one of them.\" Gov. Parson signs bills for license reciprocity military spouses Governor Mike Parson signed two bills into law on Tuesday, April 21, which allows license reciprocity for military spouses relocating to Missouri with their active duty partner. kfvs12.com", "2020-04-22T21:59:04.000Z": "The shortage of PPE equipment is a top concern in Missouri and nationwide as health care professionals and first responders serve our communities on the front lines. It's vital that we protect our health care workers in the fight against COVID-19. State of Missouri Continues to Get Vital PPE Into The Hands of Those Who Need It. - Parson Updates State of Missouri Utilizes Google Technology to Launch Missouri PPE Marketplace Governor Mike Parson announced the launch of a new tool developed by Google to help health care providers connect with... parsonupdates.com", "2020-04-22T19:52:29.000Z": "At a time when Missourians are coming together like never before, there are still some who want to use this crisis to divide us.\n\nNo matter where you live in our great state, in rural or urban communities, Missourians are known for our hard work, grit, and determination.", "2020-04-21T23:01:26.000Z": "Fantastic story in Springfield on @LorenCookCo , a great Missouri manufacturer supplying air filtration units for hospitals, universities, and hotels for COVID-19 patients. #mogov Local company increases production to provide essential equipment for medical facilities SPRINGFIELD, Mo. - Loren Cook Company, a local manufacturer that creates industrial fans, has ramped up production during the COVID-19 crisis to provide essential equipment for medical facili ozarksfirst.com", "2020-04-21T22:47:20.000Z": "We can no longer depend on foreign countries to supply PPE for our hospitals and first responders.\n\nOur administration will continue to prioritize the lives of those on the front lines and ensure that this life-saving equipment is manufactured right here in Missouri.", "2020-04-21T21:02:38.000Z": "Easing this burden and improving the quality of life for our military families living and working in our state is the right thing to do to support the families of our nation's heroes.", "2020-04-21T21:02:37.000Z": "Today we signed into law legislation allowing license reciprocity for military spouses relocating to Missouri with their active duty partner.", "2020-04-20T22:50:11.000Z": "Enjoyed sitting down for yesterday's episode to discuss our ongoing Covid-19 response efforts and our plans to get Missourians back to work as quick and safely as possible. #mogov This Week in Missouri Politics - April 19, 2020 TWMP is back! In this wide-ranging, nearly 30-minute interview, Gov. Mike Parson discusses COVID-19 and his plans to reopen the state's economy. twmp.tv", "2020-04-20T20:07:00.000Z": "OPINION: \"The data indicate that Gov. Parson's tactics are working.\" #moleg Opinion: Gov. Parson's focus on social distancing is the right move to combat COVID-19 The data indicate that Gov. Parson's tactics are working. The state is currently in the bottom half of states in terms of overall cases. themissouritimes.com", "2020-04-20T22:27:34.000Z": "I appreciate the support of medical professionals as we work to reopen our state for business while keeping Missourians safe and healthy. #mogov Opinion: Gov. Parson's focus on social distancing is the right move to combat COVID-19 The data indicate that Gov. Parson's tactics are working. The state is currently in the bottom half of states in terms of overall cases. themissouritimes.com", "2020-04-20T22:18:42.000Z": "\"And we thank you for not listening to those who seek to make this pandemic a political or religious issue when it is anything but. As our governor, you have understood this is not a Democrat or Republican issue but is about saving lives.\" #mogov COVID-19, Gov. Parson and focusing on saving lives Countless lives have been saved by shutting down businesses and churches news-leader.com", "2020-04-20T20:28:09.000Z": "I want to assure Missourians that there IS light at the end of the tunnel. We are putting recovery plans in place and are preparing to get Missourians back to work as quickly as possible.", "2020-04-20T20:06:52.000Z": "COVID-19 is unlike anything we have ever dealt with before, and like many families during this time, we are having to make adjustments and cut back on our state expenditures.", "2020-04-18T14:00:00.000Z": "I believe every job for every Missourian should be considered essential. Missourians on unemployment and their families believe their jobs are essential. We are committed to getting every Missourian back to work and that is the bottom line.", "2020-04-17T21:41:47.000Z": "Missourians will recover from this crisis. I look forward to seeing Missourians safe, healthy, and back to work as soon as possible. Governor Parson Highlights \"Show Me Strong\" Recovery Plan - Parson Updates Governor Mike Parson highlighted Missouri's \"Show Me Strong\" Recovery Plan to safely and gradually reopen the state's economy.  Governor Parson was joined by Missouri Department of Economic Develop... parsonupdates.com", "2020-04-17T21:13:22.000Z": "Gov. Mike Parson will host reporters in the Capitol for the first time in weeks. Watch live at the link below. WATCH: Governor takes COVID-19 questions from reporters at Capitol - ABC17NEWS Gov. Mike Parson took questions Friday from reporters in person for the first time in weeks. abc17news.com", "2020-04-17T18:12:39.000Z": "Since March 17, AJ has been an invaluable addition to our team during our daily COVID-19 briefings. We appreciate AJ & the Missouri Commission for the Deaf & Hard of Hearing for working with us to ensure the briefings are accessible to our Deaf Community. Meet AJ Housewright, the interpreter at the forefront of the governor's briefings - The Missouri... With this job, AJ Housewright has married two of his greatest interests: Sign Language and government. themissouritimes.com", "2020-04-17T17:55:30.000Z": "From farming and business to education and health care, high speed internet is essential infrastructure in the modern economy, especially during these challenging times. Governor Parson Announces Broadband Grants to 16 projects, Other Broadband Resources to Aid in... Governor Mike Parson announced 16 broadband development projects will receive a total of $3.05 million through the state of Missouri's broadband grant program. The selected projects will bring... parsonupdates.com", "2020-04-17T17:12:32.000Z": "Broadband brings so many new opportunities for rural economies. From farming and business to education and health care, high speed internet is essential infrastructure in the modern economy, especially during these challenging times. Quote Tweet Mo Eco Devo @MoEcoDevo During the #COVID19 pandemic, quality internet is crucial. Today @GovParsonMO announced the recipients of the #MO broadband grant program. Selected projects will bring service to 4,400+ homes, businesses, & farms. Other resources are available. More: http:// ow.ly/LQk550zhjfZ", "2020-04-17T15:42:47.000Z": "My administration will continue to prioritize PPE procurement for our healthcare workers & first responders. \n\nPPE is key to our recovery plan, and we are working to expand our reserves by opening public & private supply chains and continuing to utilize Missouri businesses.", "2020-04-17T14:00:01.000Z": "Small businesses are the heart and soul of this state. This crisis has had a tremendous effect on them and their employees.\n\nWe will continue working hard for the hundreds of thousands of people on unemployment. To these people and their families, their jobs were essential.", "2020-04-16T23:07:30.000Z": "Because we have worked together, making diligent efforts and sacrifices, we are able to put Missourians back to work. We must be ready for a slow but steady road to recovery with some sort of social distancing continuing even as we begin to reopen the economy.", "2020-04-16T23:07:29.000Z": "I'm proud of the people of Missouri.\n\nYou have listened. You have taken social distancing seriously. You have looked out for each other, and you have followed the Stay Home Missouri Order. Governor Parson Extends Statewide \"Stay Home Missouri\" Order Through May 3, Announces Initial... Governor Mike Parson extended the statewide \"Stay Home Missouri\" Order through May 3, 2020, and announced the state's initial framework to help Missouri safely and gradually move into the recovery... parsonupdates.com", "2020-04-16T20:35:11.000Z": "Missouri is incredibly diverse, and our reopening efforts will be careful, deliberate, and done in phases.\n\nThe timing may not look the same in every community - our hardest hit areas like St. Louis and Kansas City may take longer to fully recover.", "2020-04-16T20:01:55.000Z": "As of 2:00 p.m. today, there have been 5,111 positive cases of COVID-19 in Missouri, including 152 deaths.\n\nOur hearts go out to their families and loved ones.", "2020-04-16T19:00:00.000Z": "As we look at plans to re-open our state, we have to remember how diverse our state is. What's right for the urban areas, may not be right for rural Missouri.\nRight now, it's important for all Missourians to obey our state's order so that we stay healthy while combating COVID-19.", "2020-04-16T16:26:40.000Z": "Thank you @MONurses , @MoCRNA , and @missourisnp for supporting our statewide \"Stay Home Missouri\" order.", "2020-04-16T16:00:20.000Z": "We should be proud of how the people of this state have responded to COVID-19. Missourians are doing their part, and one day soon we will be able to focus on rebuilding our state. \n\nMissourians have always faced our challenges together, and this crisis will be no different. The following media includes potentially sensitive content. Change settings View", "null": "", "2020-04-16T15:03:43.000Z": "Today at 3pm, Governor Mike Parson will be LIVE on Facebook to give an update on the state response to COVID-19, and he will address the \"Stay At Home\" Missouri Order.", "2020-04-16T15:08:28.000Z": "Ensuring public safety is our top priority and right now it's important for Missourians to obey our Stay Home Missouri order.", "2020-04-16T11:37:00.000Z": ". @MDC_online guidance:\n-Travel in sm. groups of 10 people or fewer\n-If an area is crowded/full parking lot, find a new spot\n-Keep at least six feet apart, especially on trails", "2020-04-16T00:46:29.000Z": "We know remote learning looks different in every district across the state, and I want to thank all of our educators, as well as our families at home, for stepping up and finding creative ways to continue educating our students during this difficult time.", "2020-04-16T00:46:28.000Z": "Keeping school buildings closed is the right decision to not only continue protecting the health and safety of Missouri students and teachers, but also to give educators time to transition into longer-term remote teaching and learning solutions. Governor Parson Gives Update on Public Schools, Federal Funding to Help Address COVID-19 Needs -... Governor Mike Parson and Commissioner of Education Margie Vandeven gave an update on K-12 schools following last week's announcement that all Missouri public and charter school buildings will remain... parsonupdates.com", "2020-04-15T19:20:07.000Z": "Already in 2020, there have been 174 traffic fatalities statewide.\n\nJust recently, @MoDOT vehicles were struck three times by distracted drivers. The emergency room is the last place you want to find yourself during this public health crisis. SLOW DOWN and stay safe! Quote Tweet MSHP Troop A @MSHPTrooperA Ditto!!!\n\nThis \"high roller\" was caught near Sedalia on US65 by Trooper Grose. 78 mph over the posted speed limit is down right dangerous!  #SlowYourRoll  twitter.com/MSHPTrooperC/s", "2020-04-15T16:43:25.000Z": "Missouri Gov. Mike Parson spoke one-on-one with @taylorhemness this morning. The governor says the reopening of the state will likely be a \"gradual\" process and could occur in phases, rather than all at once. Missouri Gov. Mike Parson says reopening state could be 'gradual' process With the current statewide stay-at-home order set to expire next week, Missouri Gov. Mike Parson said Wednesday that certain parts of the state may reopen quicker than others. kshb.com", "2020-04-13T23:49:46.000Z": "We have an excellent health care system, and I am proud of Missourians' heroic work as we continue to fight COVID-19.", "2020-04-13T23:49:45.000Z": "I am grateful for our local hospital and health care workers who are on the front lines responding to COVID-19, from converting ICU beds to training health care personnel, and establishing remote testing sites. Governor Parson Highlights Efforts of Missouri Hospitals to Adapt and Respond to COVID-19 - Parson... Governor Mike Parson highlighted efforts of hospitals across the state to adapt and respond to COVID-19 in Missouri.  Governor Parson was joined by Missouri Hospital Association President and CEO... parsonupdates.com", "2020-04-12T17:00:00.000Z": "Missourians are facing challenging times, but we will overcome this together.\nThe resurrection shows us the hope & peace that is found in Christ. In John 16, we are reminded that our Savior overcame the world. He will certainly help us overcome the situation we're facing today.", "2020-04-12T12:00:00.000Z": "HE IS RISEN!\n\nTeresa and I would like to wish each of you and your families a Happy Easter. While we may be spending Easter differently this year, we will still worship.", "2020-04-11T19:00:00.000Z": "No virus, no government, no piece of paper will stop us from worshiping.", "2020-04-11T15:00:00.000Z": "COVID-19 has had an overwhelming impact on our economy, & many local governments, health care providers, education institutions, businesses & other groups will rely on this funding to move forward.\n\nWe want to make sure every dollar counts for Missourians. Gov. Mike Parson signs $6 billion coronavirus relief package Some of the money will go to purchase increasingly expensive and hard-to-find personal protective equipment for medical workers. stltoday.com", "2020-04-10T22:42:39.000Z": "I would like to thank the leadership in both the House and the Senate, House Budget Chair Cody Smith, and Senate Appropriations Chair Dan Hegeman. Your work on this bill will help provide critical resources to those who need it most.", "2020-04-10T22:42:38.000Z": "Today I signed a critical piece of legislation to provide access to federal funding under the Coronavirus Aid, Relief, and Economic Security (CARES) Act. Governor Parson Signs Supplemental Budget, Establishes Working Group to Analyze Application of... Governor Mike Parson signed the supplemental budget passed by the Missouri General Assembly earlier this week.  \"We are very grateful for the action of the General Assembly, and for the cooperative... parsonupdates.com", "2020-04-10T20:57:29.000Z": "Little Elizebeth is going to remember how tough we are, how hard we work, and how willing we are to help one another in a crisis.", "2020-04-10T18:21:48.000Z": "Missourians working together to defeat COVID-19. Together, we will emerge from this stronger than ever.", "2020-04-09T22:41:28.000Z": "Continuing our efforts to slow the spread of COVID-19, I am ordering all public and charter schools to remain closed through the remainder of this academic year, with the exception of nutrition and child care outlined in our Stay Home Missouri Order. Governor Parson Orders Schools Remain Closed for Remainder of Academic Year, Emphasizes State's... Governor Mike Parson announced that all Missouri public and charter school buildings will remain closed through the remainder of the academic year.  This recommendation was made to Governor Parson... parsonupdates.com", "2020-04-09T21:58:45.000Z": "\"But he was wounded for our transgressions; he was crushed for our iniquities; upon him was the chastisement that brought us peace, and with his stripes, we are healed.\" (Isaiah 53:5)", "2020-04-09T19:58:23.000Z": "We are ordering all Missouri public and charter schools to remain closed through the remainder of the academic year with the exceptions of nutrition and child care services that are outlined in our recent health order.", "2020-04-09T01:30:00.000Z": "To all of our friends celebrating Passover, Chag Sameach.", "2020-04-09T00:36:14.000Z": "We continue to communicate with medical experts and hospitals across the state, review the data, and keep track of bed space and equipment. Right now, Missouri is in a good place. Governor Parson Announces State of Missouri is Moving Forward with First Alternate Care Site in St.... Governor Mike Parson announced that Missouri is moving forward with its first alternate care site to assist hospitals in the St. Louis region treating an increased number of COVID-19 patients.  After... parsonupdates.com", "2020-04-08T21:25:57.000Z": "As we navigate unprecedented times, Mo Corn is working hard alongside Gov. @mikeparson & the @MoAgriculture to ensure farmers have what they need to overcome the challenges before us. See what state and federal resources are available: http:// mocorn.org/covid-19-resou rces/  . #mogov  #MoTogether Quote Tweet Mike Parson @mikeparson Missourians have risen to meet challenges before. By working together, we will get through this stronger than ever. #MOGov  #MOTogether", "2020-04-08T21:13:13.000Z": "We're strong and well equipped to overcome this challenge, especially under Governor @mikeparson leadership. Thankful for his ability to work across partisan lines, with leaders from all parts of the state to solve issues during this crisis. #MOGov  #MOTogether Quote Tweet Mike Parson @mikeparson Missourians have risen to meet challenges before. By working together, we will get through this stronger than ever. #MOGov  #MOTogether", "2020-04-08T21:03:54.000Z": "We know that Missourians will get through this difficult time by doing the right thing.\nThank you Governor Parson for your leadership! Quote Tweet Mike Parson @mikeparson Missourians have risen to meet challenges before. By working together, we will get through this stronger than ever. #MOGov  #MOTogether", "2020-04-08T15:18:43.000Z": "Proud to join Governor @mikeparson as he works with leaders across the state and partisan divide to help Missourians navigate this challenging time. #mogov  #MOTogether Quote Tweet Mike Parson @mikeparson Missourians have risen to meet challenges before. By working together, we will get through this stronger than ever. #MOGov  #MOTogether", "2020-04-08T15:10:54.000Z": "Governor @mikeparson is working hard for Missourians every step of the way and meeting these challenging times head-on. #mogov  #MOTogether Quote Tweet Mike Parson @mikeparson Missourians have risen to meet challenges before. By working together, we will get through this stronger than ever. #MOGov  #MOTogether", "2020-04-08T15:15:12.000Z": "Proud to be working with Governor @mikeparson to help Missourians navigate this challenging time. #mogov  #MOTogether Quote Tweet Mike Parson @mikeparson Missourians have risen to meet challenges before. By working together, we will get through this stronger than ever. #MOGov  #MOTogether", "2020-04-08T14:19:22.000Z": "Missourians can accomplish anything #MOTogether . Our #MOGov  @mikeparson has shown strong leadership to protect all Missourians. Stay safe and stay home. Quote Tweet Mike Parson @mikeparson Missourians have risen to meet challenges before. By working together, we will get through this stronger than ever. #MOGov  #MOTogether", "2020-04-08T14:26:54.000Z": "To prevent the spread of the coronavirus, Governor @MikeParson is asking every citizen of Missouri to continue to stay home. We're all in this together, Missouri. #MOTogether Quote Tweet Mike Parson @mikeparson Missourians have risen to meet challenges before. By working together, we will get through this stronger than ever. #MOGov  #MOTogether", "2020-04-08T14:35:08.000Z": "Thank you to Gov. @mikeparson for his leadership in these tough times. #MOTogether Quote Tweet Mike Parson @mikeparson Missourians have risen to meet challenges before. By working together, we will get through this stronger than ever. #MOGov  #MOTogether", "2020-04-08T14:05:27.000Z": "Missourians have risen to meet challenges before. By working together, we will get through this stronger than ever. #MOGov  #MOTogether", "2020-04-07T23:40:25.000Z": "During this crisis they are at a greater risk of contracting COVID-19 simply because they are doing what they do best: serving our communities. That's why today we took strong action to take care fo the heroes who take care of us.", "2020-04-07T23:40:24.000Z": "Every day, our first responders leave the comfort of their homes to serve on the front lines doing dangerous work for the people of Missouri. Governor Parson Announces Implementation of $600 Federal Pandemic Unemployment Compensation... Governor Mike Parson announced that the Missouri Department of Labor and Industrial Relations' (DOLIR) Division of Employment Security (DES) has received its first operational guidance related to the... parsonupdates.com", "2020-04-07T21:05:10.000Z": "In today's #coronavirus briefing, @GovParsonMo and @MoLabor Director Anna Hui discuss a new emergency law allowing first responders who contract COVID-19 to receive workers compensation and address filing for unemployment. #moleg", "2020-04-07T20:23:41.000Z": "Keep doing the right thing. Stay home and follow our Stay Home Missouri order and we will emerge from this stronger than ever.", "2020-04-07T17:55:07.000Z": "Missourians can accomplish a great deal by working together. Governor Parson: We have to figure out how to get people back to work as soon as possible - Parson... There are a lot of Missourians out of jobs due to COVID-19, and it is more important than ever to get the facts on what is being done to protect the health and well-being of all Missourians. Listen... parsonupdates.com", "2020-04-06T23:48:37.000Z": "It's important for us in state government to work together to remove government barriers to keep Missourians moving forward during this time. Governor Parson Signs Executive Order 20-08 Regarding Notary Public in Response to COVID-19 -... Governor Mike Parson announced he has signed Executive Order 20-08 suspending a statutory requirement that a notary public must conduct the notarization of official documents while the signer appears... parsonupdates.com", "2020-04-06T17:01:08.000Z": "Today at 3pm, Governor Mike Parson will be LIVE on Facebook to provide a COVID-19 update.\n\nToday's briefing will include @muhealth Dr. Stevan Whitt, @MissouriSOS Jay Ashcroft, @HealthyLivingMo Director Dr. Randall Williams, & @MoPublicSafety Director Sandy Karsten.", "2020-04-06T15:46:20.000Z": "Learn more about our Stay Home Missouri order. Read all of the FAQs \"STAY HOME MISSOURI\" ORDER - GUIDANCE AND FREQUENTLY ASKED QUESTIONS - Parson Updates To further combat the spread of COVID-19 in Missouri, Governor Parson directed Dr. Randall Williams, Director of Missouri Department of Health and Senior Services, to issue a Stay at Home Order which... parsonupdates.com", "2020-04-05T00:00:00.000Z": "Missourians should know that our state's food supply chain remains strong and many organizations have stepped up to assist with the COVID-19 response in Missouri. Governor Parson Assures Missourians Food Supply Chain Remains Strong - Parson Updates Governor Mike Parson assured Missourians that the state's food supply chain remains strong.  Governor Parson was joined by Missouri Department of Public Safety Director Sandy Karsten, Missouri... parsonupdates.com", "2020-04-04T21:47:11.000Z": "We are calling on all available medical professionals to support the effort to fight the virus by joining a critical reserve unit now focusing on providing care in high need areas across the state. Their efforts can help save the lives of their fellow Missourians.", "2020-04-04T21:47:10.000Z": "Medical professionals and first responders across the state are working tirelessly to meet the rising needs and challenges posed by the COVID-19 crisis. State of Missouri Recruiting Medical Personnel to Boost COVID-19 Response Across State - Parson... Additional medical professionals are needed by hospitals across Missouri to help meet the challenges posed by COVID-19. To supplement the state's current health care workforce, the  Missouri Depart... parsonupdates.com", "2020-04-03T22:41:51.000Z": "Gov. Parson has declared a statewide stay-at-home order for Missouri, April 6 through April 24. Read Missouri Chamber President & CEO Dan Mehan's statement: http:// mochamber.com/coronavirus/st ay-at-home-order ", "2020-04-03T22:36:09.000Z": "As Governor, I have no greater responsibility than to protect the health, well-being, and safety of all Missourians. This is about our families, friends, neighbors, and the entire state of Missouri. For the sake of all Missourians, be smart, be responsible, and stay home.", "2020-04-03T22:36:08.000Z": "Building on Missouri's efforts to control, contain, and combat COVID-19, we issued a statewide \"Stay Home Missouri\" Order effective beginning at 12:01 a.m. on Monday, April 6, 2020, until 11:59 p.m. on Friday, April 24, 2020. Governor Parson Issues Statewide \"Stay Home Missouri\" Order to Control, Contain, and Combat... Building on Missouri's efforts to control, contain, and combat COVID-19, Governor Mike Parson today issued a statewide  \"Stay Home Missouri\"  Order effective beginning at 12:01 a.m. on Monday, April... parsonupdates.com", "2020-04-03T19:43:18.000Z": "I know Missourians are very focused on COVID-19, but we must remain vigilant in our efforts to ensure every Missouri child remains safe from abuse and neglect. Quote Tweet First Lady Teresa Parson @FirstLadyTeresa We all need to make sure we're doing our part to help keep Missouri kids safe, now more than ever. If you're concerned about a child, call the @DSS_Missouri toll-free hotline 1-800-392-3738 and report it. You could save a child's life. #NationalChildAbusePreventionMonth", "2020-04-03T19:25:42.000Z": "Today's daily COVID-19 press briefing has been moved to 5 p.m.\n\nIn accordance with our directive to avoid social gatherings of more than ten people, the briefings remain virtual only via live-stream on Facebook.\n\nLINK: https:// facebook.com/GovMikeParson", "2020-04-03T12:13:00.000Z": "I cannot emphasize enough how important it is for all citizens to practice social distancing and abide by this - the more people reduce their public contact, the sooner the virus will be contained and the sooner we can overcome this challenge!", "2020-04-03T00:27:13.000Z": "Not just government, but our doctors, nurses, public health professionals, law enforcement, first responders, truck drivers, grocery store workers, and all of the Missourians who are on the frontlines every day.", "2020-04-03T00:27:12.000Z": "Day in and day out, we are working around the clock to respond and adapt to COVID-19 in every way possible. Governor Parson Highlights Missouri's Ongoing Efforts to Combat COVID-19 - Parson Updates Governor Mike Parson highlighted the state's ongoing efforts to respond to the COVID-19 crisis in Missouri.  Governor Parson was joined by Missouri Department of Public Safety Director Sandy Karsten,... parsonupdates.com", "2020-04-02T18:38:13.000Z": "Join me on Facebook LIVE at 3pm for our COVID-19 update. \n\nI'll be joined by Dept of Public Safety Director Sandy Karsten, State Health Dept Director Dr. Randall Williams, and Missouri National Guard Adjutant General, Brig. Gen. Cumpton.\n\nLINK: https:// facebook.com/GovMikeParson", "2020-04-02T18:23:59.000Z": "Thanks for your questions! If yours wasn't answered join me on Facebook at 3pm for our live COVID-19 update. I'll be joined by Dept of Public Safety Director Sandy Karsten, State Health Dept Director Dr. Randall Williams, & MONG Adjutant General, Brig. Gen. Cumpton. #AskGovParson", "2020-04-02T17:00:13.000Z": "Thanks for the questions! 9,000+ cases of personal protective equipment, or PPE, have already been shipped to hospitals, EMS agencies, & health care facilities. Just yesterday, 18,480 N-95 masks, 22,200 surgical masks, 10,230 gowns & 5,568 face shields left the SEMA warehouse... Quote Tweet Therese Basham @ThereseBasham What are you doing to secure PPE for our healthcare workers? What are you doing to make sure everyone who needs to be tested is tested? Are you helping hospitals get ventilators? #AskGovParson", "2020-04-02T16:27:41.000Z": "We are working each day to protect the health and well-being of all Missourians. \n\nThe most important thing that you can do to stay safe is to stay home. Missouri's response to coronavirus: A timeline - The Missouri Times Here's a look at how Missouri - and in particular, the state government - has responded to the global coronavirus pandemic. themissouritimes.com", "2020-04-01T23:26:11.000Z": "This has had a serious impact on our anticipated economic growth, so we've had to take a hard look at our budget and make some very difficult decisions.", "2020-04-01T23:26:10.000Z": "The impact of COVID-19 has already been hard felt in our economy. More people are staying home, business operations have been limited, many people have lost their jobs, and state revenues are down. Governor Parson Announces Expenditure Restrictions to Ensure Balanced Budget, Funds to Combat... Governor Mike Parson announced $180 million in expenditure restrictions to ensure a balanced state budget and the necessary funds to combat COVID-19 going forward.  Governor Parson was joined by... parsonupdates.com", "2020-04-01T21:56:22.000Z": "The most important step that anyone can take right now is staying at home.\n\nWe need to get rid of the mentality that people are\nstuck at home. What you really are is safe at home.", "2020-04-01T18:54:34.000Z": "Today's press briefing will include updates from Missouri Department of Public Safety Director Sandy Karsten, Missouri Department of Health and Senior Services Director Dr. Randall Williams, and State Budget Director Dan Haug.\n\nWatch at 3 p.m. --> https:// facebook.com/GovMikeParson/", "2020-03-31T23:05:44.000Z": "Thank you to the Missourians who are doing their part by staying home and practicing social distancing. These folks are showing what it means to be a Missourian. It will take all of us to slow the spread of this virus. Governor Parson Gives Updates on Missouri National Guard, Department of Economic Development... Governor Mike Parson provided updates on efforts by the Missouri National Guard, Missouri Department of Economic Development (DED), Missouri Department of Corrections (DOC), and the Missouri Depart... parsonupdates.com", "2020-03-31T20:02:55.000Z": "Enhanced collaboration: @Missouri_NG will play a major role in supporting state & community COVID-19 response efforts. \n\nThe Guard has been working since last week & through the weekend as part of our effort to identify potential Alternate Care Sites, if needed, around the state.", "2020-03-31T17:40:21.000Z": "AG Schmitt, @GovParsonMO , and @LtGovMikeKehoe are warning Missourians of potential #COVID19 scams and price gouging. \n\nReport price scams and price gouging to the AG's Office at 800-392-8222 or online at http:// ago.mo.gov .\n\nRead more: https:// ago.mo.gov/home/news/2020 /03/31/attorney-general-schmitt-governor-parson-lt.-governor-kehoe-warn-of-scams-price-gouging   #MOLeg  #MOGov Attorney General Schmitt, Governor Parson, Lt. Governor Kehoe Warn of Scams, Price Gouging ago.mo.gov", "2020-03-31T16:01:57.000Z": "That's why, since January, we have been taking the necessary steps to be as prepared as possible to combat COVID-19.\n\nWe are going to continue working hard, and we will come out of this stronger than ever before.", "2020-03-31T16:01:56.000Z": "Ensuring the health and well-being of all Missourians must be our state's number one priority during this crisis. TIMELINE (Updated June 22, 2020) - Parson Updates January 22,2020:  Missouri Department of Health and Senior Services (DHSS) distributed a health update to health care providers and partners regarding an outbreak of a 2019 novel coronavirus... parsonupdates.com", "2020-03-31T14:30:57.000Z": "Our team is working with @HealthyLivingMo to procure PPE for hospitals, law enforcement, first responders, and other emergency service personnel.\n\nThe Strategic National Stockpile is for hospitals, EMS, and long-term care facilities.", "2020-03-30T23:30:39.000Z": "We must provide more flexibility and alternative delivery methods for professionals in other states to provide care in Missouri.\n\nOur goal is to provide as much access to care as possible for the health and well-being of all Missourians", "2020-03-30T23:26:54.000Z": "It is critical that our health professionals be able to treat Missourians during the COVID-19 crisis. Governor Parson Continues Efforts to Eliminate Barriers, Expand Ability to Provide Health Care... Governor Mike Parson announced he has approved a waiver granting full reciprocity for physicians and surgeons from other states who wish to assist Missourians during the COVID-19 crisis.    Missouri... parsonupdates.com", "2020-03-30T20:57:04.000Z": "These actions will help our response efforts and make it easier for us to stop the spread of this disease.\n\nTo find out more about what we've done, visit http:// parsonupdates.com . Parson Updates parsonupdates.com", "2020-03-30T20:57:03.000Z": "We've been preparing to combat COVID-19 since January.\n\nTo protect the health and well-being of all Missourians, I've signed 5 Executive Orders, waived 170 state statutes, and mobilized the National Guard.", "2020-03-30T18:14:24.000Z": "Today at 3pm, Governor Mike Parson will be LIVE on Facebook for a COVID-19 update.\n\nJoining him: @MoPublicSafety Director Sandy Karsten, @HealthyLivingMo Director Dr. Randall Williams, @DSS_Missouri Acting Director Jennifer Tidball, and @MissouriDCI Director Chlora Lindley-Myers.", "2020-03-30T16:34:08.000Z": "Making sure that we protect the health and well-being of ALL Missourians is our top priority. Gov. Parson: Missouri has been preparing for virus 'since January' Governor Parson stressed the actions his office has taken to combat the coronavirus in the past two weeks, while saying that Missouri has been preparing for its coronavirus response \"since January\"... ktvo.com", "2020-03-28T21:11:34.000Z": "We've accomplished a tremendous amount of work in a short period of time. COVID-19 UPDATE (3-28-2020) - Parson Updates View Governor Parson's entire update from today's press briefing, here. parsonupdates.com", "2020-03-27T21:08:55.000Z": "Find out more about our response to COVID-19 by visiting http:// parsonupdates.com .", "2020-03-27T15:28:23.000Z": "Today at 3pm, Governor Mike Parson will be LIVE on Facebook to provide an update on the state response to COVID-19.\n\nToday's briefing will include @HealthyLivingMo , @MoPublicSafety , @Missouri_NG , & @DSS_Missouri .", "2020-03-27T14:38:07.000Z": "The COVID-19 crisis is constantly developing and changing, but we are taking steps each and every day to slow the spread and protect public health and safety. Governor Parson Signs Executive Order 20-06 to Begin Mobilizing Missouri National Guard to Assist... Governor Mike Parson has signed Executive Order 20-06 to begin mobilizing the Missouri National Guard to assist in the state's COVID-19 response efforts. This will increase the amount of coordination... parsonupdates.com", "2020-03-27T02:11:57.000Z": "I appreciate the President acting quickly on my disaster declaration request and the commitment of federal resources as we battle this unprecedented public health and economic threat to Missourians. President Trump Approves Governor Parson's Request for Major Disaster Declaration to Support... President Donald Trump   today approved Governor Mike Parson's request for a federal major disaster declaration for the state of Missouri.  The President approved Governor Parson's request that the... parsonupdates.com", "2020-03-26T21:56:11.000Z": "It's up to each of us to slow the spread of COVID-19. Practice social distancing and watch out for each other.", "2020-03-26T21:44:47.000Z": "We're working hard to make sure that Missourians are able to receive the critical supplies that they need. Missouri Department of Transportation Takes Steps to Assist with COVID-19 Response - Parson Updates Missouri Department of Transportation (MoDOT) Director Patrick McKenna and Missouri Department of Mental Health Director Mark Stringer provided updates at today's press briefing Governor Parson... parsonupdates.com", "2020-03-26T18:28:02.000Z": "Critically needed shipments continue to arrive at our Missouri State Emergency Management Agency warehouse.", "2020-03-26T15:30:00.000Z": "LISTEN to the latest interview from this morning with @939TheEagle .\n\nMissourian's are strong and we will come out of this stronger than ever before. RADIO: Gov. Parson on Wake Up Columbia - Parson Updates Gov. Parson talks about a federal disaster declaration request, and other ways he's trying to help Missourians deal with COVID-19, on Wake Up Columbia on Thursday. parsonupdates.com", "2020-03-26T14:17:16.000Z": "My top priority is protecting the health and well-being of all Missourians. We're going to continue putting Missourians first and doing everything possible to combat COVID-19. STRONG LEADERSHIP | 58 ACTIONS TO PROTECT MISSOURIANS - Parson Updates Governor Parson and his administration have been working hard to protect the health and well-being of all Missourians. Here are the most critical 58 actions he's taken to combat COVID-19. (UPDATED... parsonupdates.com", "2020-03-25T22:01:55.000Z": "Missouri's food supply is as strong as the men and women who drive our trucks and tractors. Governor Parson Highlights Importance of Food and Agriculture Industry to Missouri's COVID-19... Governor Parson assured Missourian's that the state's food supply remains strong and emphasized the important role of the food and agriculture industry in Missouri's COVID-19 response efforts.... parsonupdates.com", "2020-03-25T15:44:20.000Z": "Today at 3pm, Governor Mike Parson will be LIVE on Facebook to provide an update on the state response to COVID-19.\n\nToday's briefing will include @MoEcoDevo Director Rob Dixon, @MOLabor Director Anna Hui, and @MoAgriculture Director Chis Chinn.", "2020-03-25T15:36:52.000Z": "We're going to continue working hard to protect the health and well-being of Missourians.\n\nIf you have questions about what precautions you should take, please visit http:// health.mo.gov/coronavirus , or call our 24/7 hotline at 877-435-8411.", "2020-03-25T15:36:51.000Z": "Today, we requested a Federal Major Disaster Declaration for Missouri. Governor Parson Requests Federal Major Disaster Declaration for Missouri in Response to COVID-19 -... Governor Mike Parson has requested that President Donald J. Trump approve a major disaster declaration for the entire state of Missouri to provide federal assistance for state and local COVID-19... parsonupdates.com", "2020-03-25T15:35:31.000Z": "The COVID-19 pandemic has already had a devastating effect on the state of Missouri, straining hospitals, healthcare facilities and nursing homes, businesses large and small, schools, and tens of thousands of Missourians who have been forced out of their jobs.", "2020-03-25T14:10:02.000Z": "Our administration has directed $18 million for the purchase of more PPE -- critical equipment for our healthcare workers and first responders! Quote Tweet Missouri State Emergency Management Agency @MoSEMA_ Critically needed #PPE shipments continue to arrive at our @MoSEMA_ warehouse. Our team is working with @HealthyLivingMo to rush these surgical masks, gowns, face shields, gloves, etc. to healthcare facilities & EMS & w/ @MoPublicSafety to get them to Missouri first responders.", "2020-03-24T22:18:52.000Z": "I'm proud of the hard work and leadership our education leaders have demonstrated during this public health emergency. Governor Parson Highlights Leadership of Missouri Schools and Higher Education Institutions During... Recognizing that every school district is different, Governor Mike Parson enabled local school leaders to make the best decisions for their communities as Missouri continues to combat the spread of... parsonupdates.com", "2020-03-24T22:18:51.000Z": "We enabled local school leaders to make the best decisions for their communities as Missouri continues to combat the spread of COVID-19. This approach allowed for local solutions and provided maximum flexibility for leaders to address the effects of closing a school district.", "2020-03-24T20:09:36.000Z": "All 555 of Missouri's public school districts and charter schools are currently closed, impacting 915,000 students.\n\nSchool leaders make decisions every day about the health & safety of students, and it's important they have the flexibility to do what is best for their community.", "2020-03-24T17:12:39.000Z": "No Missourian will have their Food Stamp benefits end, and they do not need to take any actions to ensure their benefits will continue while we are dealing with the COVID-19 pandemic. Missouri expands food stamp program in response to coronavirus The expansion includes boosting the amount families receive for as long as the federal emergency declaration lasts stltoday.com", "2020-03-24T14:38:48.000Z": "Today at 3pm, Governor Mike Parson will be LIVE on Facebook to provide an update on the state response to COVID-19.\n\nToday's briefing will include @MOEducation Commissioner Margie Vandeven.", "2020-03-24T01:36:10.000Z": "#COVID19 update: Today, we updated our testing screening criteria which reflect the CDC's latest recommendations Learn about the criteria here  https:// health.mo.gov/emergencies/er t/alertsadvisories/pdf/update32320.pdf ", "2020-03-23T22:27:40.000Z": "To meet the increasing healthcare needs of Missouri citizens as a result of COVID-19, we are working hard to quickly remove some statutory barriers, allowing more trained healthcare professionals to work in ways that are both safe and productive. Governor Parson and Administration Continue Efforts to Streamline Government Processes Amid... Governor Mike Parson and his administration continue to take steps to streamline government processes and provide relief to those impacted by COVID-19. \"In order to meet the increasing healthcare... parsonupdates.com", "2020-03-23T21:22:57.000Z": "We will continue doing everything we can to minimize the impact of COVID-19 on Missourians and their families, which includes supporting Missouri's small businesses and the communities that depend on them.", "2020-03-23T21:22:56.000Z": "Many restaurants and bars are now offering drive-thru, pickup, and delivery options. This is a great option for Missourians to continue supporting their local businesses while still practicing the required social distancing. GOVERNOR PARSON SIGNS EXECUTIVE ORDER 20-05 ALLOWING SALE OF UNPREPARED FOODS BY RESTAURANTS -... Governor Mike Parson signed Executive Order 20-05 ordering the suspension of any prohibition on the sale of unprepared food by restaurants to the public. \"Due to the public health threat caused by... parsonupdates.com", "2020-03-23T19:28:37.000Z": "Join us at 3pm as Governor Mike Parson gives a COVID-19 update on Facebook LIVE. https:// facebook.com/GovMikeParson/", "2020-03-23T15:01:40.000Z": "Proud of the many churches and nonprofit organizations across the state that continue to care for our most vulnerable citizens while following social distancing guidelines to help keep volunteers & staff safe. California church provides essential supply drive-thru Empty grocery store shelves have become a common sight during the COVID-19 outbreak. In California, Missouri, one church is working to help alleviate that issue. New Beginnings Church, partnered with... krcgtv.com", "2020-03-23T14:42:51.000Z": "2020 Census field operations are suspended until April 1. Filling out the Census online is a great step you can take while social distancing. \n\nFill yours out now: https:// census.mo.gov Quote Tweet U.S. Census Bureau @uscensusbureau Nice job @MoCensus , catching up to @KansasCounts (23.5%)! RT @MoCensus As of today, Missouri's self-response rate for the #2020Census is outpacing the rest of nation! Let's keep it up!- because #MissouriCounts ! https:// go.usa.gov/xduSe", "2020-03-23T14:02:21.000Z": "Great to see @muhealth provide drive-thru testing! MU now also provides COVID-19 video consultations (at no cost) through its virtual platform. Quote Tweet MU Health Care @muhealth Updated link: https:// youtu.be/3jpTVfUtc3Q Show this thread", "2020-03-22T21:15:07.000Z": "All Missourians need to keep their faith, hope, and to help move the state forward during and after this crisis.\n\nWe joined Vic Faust to talk about our Response to COVID-19. Watch it here. FOX 2 Exclusive: Gov. Parson talks about his response to coronavirus - Parson Updates To view the full interview, click here . parsonupdates.com", "2020-03-22T19:44:00.000Z": "Under our statewide directive requiring social distancing, schools remain closed. This does not prohibit schools from providing child care and Food and Nutritional Services for those children that qualify. @MOEducation  @healthylivingmo", "2020-03-21T21:47:14.000Z": "Get the latest on Missouri's social distancing order. --> http:// parsonupdates.com", "2020-03-21T20:02:03.000Z": "I have directed @healthylivingmo Director Dr. Randall Williams to ORDER social distancing statewide.\nThe order requires the following:", "2020-03-21T20:05:05.000Z": "This is a serious, unpredictable time for our state and nation, and we must continue taking all steps necessary to stop the spread of COVID-19.\n\nThe more people reduce their public contact, the sooner the virus will be contained and the sooner we can overcome this challenge.", "2020-03-21T17:56:27.000Z": "Tune in at 3pm to watch today's press briefing on Facebook LIVE: https:// facebook.com/GovMikeParson/ Governor Mike Parson will outline a new statewide social distancing order. He will also discuss child care and Department of Revenue relief and extensions.", "2020-03-20T18:32:05.000Z": "STRONG ACTION TO SUPPORT MISSOURI'S ECONOMY:\n\nI've directed the @MoSEMA_ & @MoEcoDevo to seek assistance for Missouri businesses through the U.S. Small Business Administration's ( @SBAgov ) Economic Injury Disaster Loan program.", "2020-03-21T02:20:12.000Z": "Yesterday, personal protective equipment from the strategic national stockpile arrived at our @MoSEMA_ warehouse, today our teams expedited work to get it shipped to hospitals and EMS agencies around the state.", "2020-03-20T21:36:21.000Z": "If you have questions about what precautions you should take, please visit http:// health.mo.gov/coronavirus , or call our 24/7 hotline at 877-435-8411.", "2020-03-20T21:36:20.000Z": "We are working each day to respond to COVID-19 and protect the health and well-being of Missourans. For the latest news on what steps we are taking to combat this challenge. --> http:// parsonupdates.com", "2020-03-20T16:13:14.000Z": "THANK YOU to our healthcare providers & emergency personnel on the front lines of the #COVID19 outbreak!\n\nThis isn't work that attracts people looking to become rich or famous. It's a calling for those who want to make a difference & make their communities stronger. #ShowMeStrong", "2020-03-20T14:58:35.000Z": "Today, I ordered U.S. and Missouri flags be flown at half-staff at government buildings in Greene County on Saturday, March 21, 2020 in honor of @SGFPolice Officer Christopher R. Walsh.", "2020-03-20T14:11:32.000Z": "**Overnight county clarifications**\nMissouri's COVID-19 stats to date: 47 positive", "2020-03-19T22:30:16.000Z": "As of today, ALL Missouri public and charter schools are CLOSED. @MOEducation officials remain in close communication to be informed about COVID-19 and the current situation in Missouri.", "2020-03-19T21:26:58.000Z": "Today, Missouri took delivery of thousands of Personal Protective Equipment (PPE) from the @CDCgov and @HHSGov 's Strategic National Stockpile. Our @MoSEMA_  @HealthyLivingMo & @MoDOT teams are getting this vital protection to MO healthcare providers to protect against #COVID19 .", "2020-03-19T19:59:49.000Z": "WATCH our daily COVID-19 press briefing LIVE NOW on Facebook: https:// facebook.com/GovMikeParson/", "2020-03-19T19:20:24.000Z": "It's up to each of us to slow the spread of COVID-19 in Missouri.\n\nThis is a serious situation and all of us must see the importance of protecting the health and well-being of ALL Missourians.", "2020-03-19T18:32:26.000Z": "ICYMI: In case you missed it, several actions were taken yesterday to support our COVID-19 response efforts: Signed Executive Order 20-4 authorizing executive agencies to waive or suspend certain regulations and statutes that interfere with COVID-19 response efforts", "2020-03-19T15:57:37.000Z": "The @HealthyLivingMo  #COVID19 chatbot is up and running. Ask your COVID-19 questions here: https:// info.mo.gov/covid/", "2020-03-18T18:31:08.000Z": "Has your business been impacted by the Coronavirus? Check out our FAQ page at http:// labor.mo.gov/coronavirus for information about avoiding layoffs, unemployment, workers' compensation and more. #coronavirus  #WorkingBetterTogether", "2020-03-19T14:01:55.000Z": "What we can't do is live in a society of fear. Concern, yes. Fear, no. This disaster is affecting everyone, and it's going to take all of us working together to get through it. Governor: People must have plans to overcome COVID-19 As the COVID-19 pandemic worsens and deepens, individuals and families better have plans for getting by day to day, Gov. newstribune.com", "2020-03-19T00:55:32.000Z": "-Signed Executive Order 20-04 invoking emergency powers to authorize executive agencies to waive or suspend certain regulations and statutes that interfere with Missouri's response to the spread of COVID-19.", "2020-03-19T00:55:31.000Z": "LATEST COVID-19 UPDATE:\n\nWe are working each day to respond to the virus and protect the health and well-being of Missourians.", "2020-03-18T21:49:06.000Z": "We will continue doing everything we can to minimize the impact of the coronavirus on hardworking Missourians and their families, including supporting Missouri's small businesses and our communities that depend on them.", "2020-03-18T21:49:05.000Z": "The SBA will offer targeted, low-interest disaster recovery loans for Missouri small businesses that have been severely impacted by economic disruptions related to the new coronavirus (COVID-19.)", "2020-03-18T21:49:04.000Z": "We must protect our small businesses during this crisis. That's why my administration directed state agencies to seek assistance through the SBA Economic Injury Disaster Loan program.", "2020-03-18T21:25:56.000Z": "We're working hard to protect our first line of defense. That's why we have 370,000 sets of personal protection equipment on its way to those who need it. They will be receiving these shipments in the coming days.", "2020-03-18T20:25:52.000Z": "WATCH LIVE: #Missouri Gov. @mikeparson canceled multiple events to hold a mid-afternoon press conference today. It indicates some big news may be coming related to the #COVID19 crisis. It starts in 5 minutes.\n\nLIVESTREAM HERE: Boone County records Missouri's first COVID-19 death - ABC17NEWS The first Missouri death from COVID-19 was recorded Wednesday in the Columbia area, officials said during a news conference at the Missouri Capitol. abc17news.com", "2020-03-18T19:05:12.000Z": "Do your part to slow the spread of the coronavirus! \nDownload your copy of the President's Coronavirus Guidelines for America here http:// ow.ly/d/8nya", "2020-03-18T19:40:05.000Z": "We're working with the @SBAgov to bring assistance to Missouri small businesses. Once Missouri is approved by SBA, we'll have more information on how to apply. Learn more: http:// ow.ly/AKdq50yPhro", "2020-03-18T20:02:04.000Z": "Missouri Gov. @mikeparson 's office announced the next daily press update of the #COVID19 crisis will take place at 3:30 p.m. today. #ABC17News - @JoeMcLeanNews", "2020-03-18T20:08:09.000Z": "Tune into today's press update regarding COVID-19 at 3:30pm. -> http:// bit.ly/dailypressupda te ", "2020-03-18T16:40:09.000Z": "If your employment has been impacted by COVID-19 and you need to file an unemployment claim visit http:// uinteract.labor.mo.gov . #coronavirus  #WorkingBetterTogether", "2020-03-18T17:00:00.000Z": "We are working each day to respond to this virus and combat the spread. Follow CDC, Trump Administration, and state guidance to help keep ALL Missourians safe. What You Need to Know: Missouri's Guidelines to Combat Spread of COVID-19 (JEFFERSON CITY, MO) - As concerns over the new coronavirus (COVID-19) continue to grow across the state and the nation, Governor Mike Parson and his administration are working each day newspressnow.com", "2020-03-18T15:40:34.000Z": "As concerns over COVID-19 continue to grow across the state and the nation, our administration is working to respond to the virus & help combat the spread.\n\nIn line with President @realDonaldTrump 's guidance, the state encourages Missourians to follow these guidelines.", "2020-03-18T15:21:44.000Z": "Ashcroft, Parson postpone April election to June 2 through executive order.  \n\nAshcroft: \"These are difficult times, but I am grateful for how we have responded, worked together and come to a resolution that helps every single Missouri voter.\" https:// sos.mo.gov/Parson-Ashcrof t-Announce-April-7-Municipal-Elections-Postponed-Until-June-2-Response-COVID-19 ", "2020-03-18T15:21:35.000Z": "A lot has happened over the past week, and we are working hard to stop the spread of COVID-19.\n\nWe are partnering with the private sector to ensure that all Missourians who need to be tested get tested. Our testing capacity is increasing every day.", "2020-03-18T13:59:38.000Z": "My administration has directed @MoSEMA_ and @MoEcoDevo to seek assistance for Missouri businesses through the U.S. Small Business Administration ( @SBAgov ) Economic Injury Disaster Loan program. https:// governor.mo.gov/press-releases /archive/governor-parson-works-us-small-business-administration-activate-disaster ", "2020-03-18T01:54:09.000Z": "WATCH: Governor Mike Parson's First Daily Press Briefing Regarding COVID-19 First Daily Press Briefing Regarding COVID-19 As concerns over the new coronavirus (COVID-19) continue to grow across the state and the nation, our administration will begin daily press briefings to... facebook.com", "2020-03-17T21:25:02.000Z": "Sat down with Columbia Mayor @BNTreece , @CoMoGov officials, Columbia/Boone County Dept of Public Health & Human Services, @Mizzou leaders, state legislators (via phone), & emergency personnel to detail the state response to COVID-19.", "2020-03-17T20:36:38.000Z": "LIVE: Governor Mike Parson and Columbia City leaders provide an update on COVID-19. Parson: How state will provide local relief, increase testing, combat COVID-19 Governor Mike Parson is traveling the state visiting cities and providing an update on the progression of COVID-19. Prior to holding a press briefing Tuesday, Parson met with Columbia leaders to... krcgtv.com", "2020-03-17T19:30:00.000Z": "Gov. Parson is set to meet with Columbia city leaders at 2:45 p.m. ABC 17 News will have a livestream of the news conference following the briefing at 3:30 p.m. Parson: Decision to close schools amid COVID-19 pandemic best left to locals - ABC17NEWS Gov. Mike Parson said Tuesday in Columbia that the decision on whether to close schools was best left to local leaders. abc17news.com", "2020-03-17T18:18:52.000Z": "To support COVID-19 response, @MoDOT has waived weight limitations for motor carriers. The waiver allows private & for-hire motor carriers to haul up to 10% more than their licensed weight on Missouri highways when transporting supplies & equipment. https:// modot.org/node/18157", "2020-03-17T17:02:35.000Z": "Just met with Kirksville Mayor Zac Burden, community leaders, local legislators (via phone), and emergency personnel to provide a briefing on COVID-19 and the state response.", "2020-03-12T22:29:06.000Z": "REMINDER: Report any and all instances of price gouging or any other scams related to #COVID19 to the Attorney General's Office by calling 1-800-392-8222 or by filing a complaint online at https:// ago.mo.gov/app/consumerco mplaint  . #MOLeg  #coronavirus", "2020-03-16T18:58:08.000Z": "Get the latest CDC guidance on mass gatherings and large community events, http:// cdc.gov/coronavirus or head to the Missouri Department of Health and Senior Services (DHSS) website at http:// health.mo.gov/coronavirus .", "2020-03-16T18:58:07.000Z": "This afternoon, we met with @citystjoemo Mayor Bill McMurray, Buchanan County officials, & emergency personnel for a COVID-19 briefing.", "2020-03-16T15:07:48.000Z": "This morning, we joined KC Mayor @QuintonLucasKC , metropolitan leaders, & emergency management personnel for a briefing on COVID-19.\n\nWe will continue to work with our urban centers to address their unique concerns and maximize coordination.", "2020-03-16T00:31:45.000Z": "In accordance with @CDCgov recommendations, my administration and I strongly urge the cancellation or suspension of public gatherings of >50 with the exception of educational institutions, daycare facilities, & business operations. https:// governor.mo.gov/press-releases /archive/governor-parsons-statement-regarding-cdc-recommendations-mass-gatherings-and ", "2020-03-15T18:52:49.000Z": "Teresa and I joined our family this morning to pray for our state and for our county on this National Day of Prayer.", "2020-03-13T22:53:21.000Z": "Our top priority is protecting the health and safety of all Missourians. That's why today, we declared a state of emergency by Executive Order in response to COVID-19. Quote Tweet Governor Mike Parson @GovParsonMO WATCH Governor Parson's press conference declaring a state of emergency in response to COVID-19 in Missouri.  https:// facebook.com/GovMikeParson/ videos/285256935791022/ ", "2020-03-13T20:56:10.000Z": "We are grateful to President @realDonaldTrump for declaring a national emergency regarding COVID-19 and releasing much needed federal funds. We will continue to work with federal, state, and local emergency personnel to keep our communities safe and healthy. Quote Tweet The White House @WhiteHouse President @realDonaldTrump is officially declaring a National Emergency and ordering every state to set up emergency operations centers, effective immediately.", "2020-03-12T13:44:10.000Z": "Severe storms are forecast for much of Missouri today. Threats include tornadoes, damaging winds & large hail. Follow your local forecast for updates & make sure you know where you'd shelter & have multiple ways of getting #MoWx alerts. Check our http:// StormAware.mo.gov videos.", "2020-03-12T02:40:31.000Z": "This afternoon, we met with Better Family Life to continue our conversation about creating real and lasting change in metropolitan St. Louis.\n\nJames Clark and his team gave me an overview of their de-escalation centers that partner with Washington University.", "2020-03-11T20:00:00.000Z": "Thanks to the MoExcels Workforce Initiative Grant, the Allied Health Student Success Center at OTC will train students for critical jobs in the healthcare industry.\n\nTogether, we will do the hard work to keep moving Missouri forward. -> https:// mikeparson.com/team-57/", "2020-03-11T15:25:00.000Z": "Clean hands keep you healthy and can stop germs from spreading to others. What you need to know about handwashing: https:// cdc.gov/handwashing", "2020-03-11T15:30:00.000Z": "ICYMI: Our MOExcels Workforce Initiative Grant is helping make the Allied Health Student Success Center at OTC possible. \n\nThis center will help students receive the skills needed to enter the healthcare profession. #mogov", "2020-03-11T14:17:35.000Z": "It's always great to see Missouri grown businesses expanding! @goBRANDgo is an exciting, innovative business that's dedicated to helping other businesses and the community. We look forward to seeing this company continue to grow & fulfill its mission. NATION'S FIRST CO-LEARNING SPACE FOR MANUFACTURING SUPPLY CHAIN www.missouripartnership.com", "2020-03-10T23:01:57.000Z": "With the passage of HB 1511 and 1452, we can now eliminate this burden and improve the quality of life for military families living and working in Missouri.", "2020-03-10T23:01:56.000Z": "Military spouses face considerable challenges when they relocate with their active duty partner, and finding a job in their licensed profession should not be one of them! #mogov", "2020-03-10T22:00:00.000Z": "In Missouri, we are standing for life, protecting women's health, and advocating for the unborn. I believe that all life has value and is worth protecting. Join my team and help us stand for those who cannot defend themselves. #mogov -> https:// mikeparson.com/team-57/", "2020-03-10T21:49:40.000Z": "NOW: COVID-19 briefing call with hundreds of mayors, county commissioners, & emergency response personnel from across the state.\n\nWe know local communication is critically important to keeping Missourians healthy & safe.", "2020-03-10T20:17:32.000Z": "Met with emergency personnel from @MOAmbAssoc today during \"EMS Day\" at the Capitol.\n\nWe discussed legislation that would impact first responders, and I listened to their thoughts on the state & local response to COVID-19. Glad to meet with so many of Missouri's local heroes!", "2020-03-10T19:23:34.000Z": "I am honored to lead a state with so many people committed to standing up for those without a voice.\n\nTeresa & I participated in the @MORightToLife \"Show Me Life\" rally today at the state Capitol. #ProLife", "2020-03-10T15:47:06.000Z": "Making sure that our workforce is prepared for high demand jobs is one of our top priorities.\n\nThe new Allied Health Student Success Center is exciting because it uses the MoExcels Workforce Initiative Grant to help students receive training in critical healthcare fields. #mogov", "2020-03-10T02:15:04.000Z": "Historic low unemployment is helping drive up wages, & our tax cuts are helping Missourians keep more of their hard-earned money. \n\nWe're working hard to make sure that kids like Carson have a chance to live the American Dream. \n\nFantastic Lincoln Day in Callaway County! #mogov", "2020-03-09T19:28:41.000Z": "Welcoming @GovParsonMO to campus as we cut the ribbon on our Allied Heath Student Success Center. #MOExcels  #myOTC", "2020-03-09T15:01:40.000Z": "Missouri has one of the nation's largest highway systems with one of the lowest levels of funding in the country - now is the time to fix our infrastructure needs!\n\nOur Focus on Bridges program will repair/replace 250 of the state's poorest bridges. Governor Parson's Bridge Program Awarded Contracts on First 14 Bridges www.acppubs.com", "2020-03-09T15:55:51.000Z": "I was proud to cast my ballot for President Trump this morning!\n\nBe sure to make your voice heard by getting out and voting tomorrow in Missouri's Presidential Preference Primary. \n\nFind your polling place ahead of time. -> https:// voteroutreach.sos.mo.gov/prd/VoterOutre ach/VOSearch.aspx ", "2020-03-08T20:00:00.000Z": "Teresa and I have lived the American Dream and that's why we are protecting it for future generations. Join our team today and help us protect our state's HISTORIC Progress. #mogov -> https:// mikeparson.com/team-57/", "2020-03-07T19:17:45.000Z": "Welcome to Edina, Missouri. Knox Co. This place is packed!\nLots of momentum and support for @mikeparson 's conservative leadership and focus on issues/values that matter most to Missourians - Jobs/Economy. #MikeWorks", "2020-03-07T16:38:29.000Z": "Our state's economy is booming! Record low unemployment, 40,000 new jobs, & MAJOR business investment are driving our historic gains. \nMarion County is seeing the results from the hard work that we're doing in Jeff City, & they are ready for big Republican wins in Nov. #mogov", "2020-03-06T23:00:00.000Z": "The governor's pro-jobs, pro-business policies are working!\n\nOn top of the 9,000 Missourians that went back to work in January, our state's general revenue is up 22%. This is what happens when you cut taxes and train our workforce for the jobs of the future. #mogov", "2020-03-06T21:19:04.000Z": "Missourians across Northeast Missouri support Governor Mike Parson because he is fighting to protect the American Dream! #mogov Governor Parson Announces Strong Support from Elected Officials in Marion, Lewis, Knox, and... Ahead of Governor Mike Parson's four-county Republican Lincoln Days tour in Northeast Missouri on Saturday, the governor's campaign released the following list of endorsements from state legislators... mikeparson.com", "2020-03-06T19:26:37.000Z": "We are saving YOUR tax dollars!\n\nWe want to do what's best for Missourians. By paying down our state's debt and refinancing certain bonds, we are saving our state MILLIONS. #mogov", "2020-03-06T14:30:51.000Z": "Crawford County Republican Lincoln Day was a huge success! Thank you to Senator Justin Brown for talking about our state's record low unemployment and historic job growth under Governor @mikeparson 's leadership. #mogov  #moleg", "2020-03-05T16:56:38.000Z": "Teresa's video won a 2020 Reed Award for \"Best Online Video for a Gubernatorial Campaign.\" If you've missed it, check it out. #mogov ICYMI: Teresa Parson's Award Winning Video - Parson for Missouri Teresa's video won a 2020 Reed Award - \"Best online video for a Gubernatorial Campaign.\" Check it out below! Governor Parson made the announcement at Bolivar High School in the community where he... mikeparson.com", "2020-03-01T03:26:51.000Z": "Proud to support @karenbest as she kicked off her campaign for State Representative today.", "2020-02-29T01:57:57.000Z": "Great to be in Howell County for their Lincoln Days. The future of our party is strong! #mogov", "2020-02-26T23:31:35.000Z": "We've had an incredible couple of years. 40,000 New Jobs Private Sector is Humming Wages are up\n\nHelp us protect this progress. Join our team today! #mogov --> https:// mikeparson.com/team-57/", "2020-02-25T18:04:54.000Z": "We are going to continue making sure that everyone has the chance to pursue the American dream.\n\nToday, I filed to run for re-election. In the next four years, we will continue building upon our successes that make a positive difference for Missourians. #mogov", "2020-02-24T18:15:45.000Z": "HUGE support for the governor in Osage and Greene Counties! #mogov Governor Parson Announces Strong Support from Elected Officials in Greene and Osage Counties. -... Ahead of Governor Mike Parson's keynote address at the Osage County Republican Lincoln Days and the Missouri Republican Lincoln Days in Greene County, the governor's campaign released the following... mikeparson.com", "2020-02-23T00:01:33.000Z": "WATCH this Real News Update from Missouri Republican Lincoln Days in Springfield, MO. #mogov Studio57 - Real News Updates - E8 From the 2020 Missouri Republican Lincoln Days in Springfield, here is the latest Real News Update. youtube.com", "2020-02-23T01:07:53.000Z": "We are excited to have Kellyanne Conway in Missouri for the second night of 2020 Missouri Republican Lincoln Days. \n\nHer work with President Trump helps ensure that our HISTORIC economy keeps BOOMING! #mogov", "2020-02-22T23:14:38.000Z": "The next generation is important for the future of our country and our state. Looking forward to seeing what these young leaders accomplish over the next year! Quote Tweet MOCR @MissouriCR Congratulations to the next MOCR Executive Board!!\nChairman-Elect: Will Shafer\nVice Chairman-Elect: Tiffany Hartzler \nSecretary-Elect: Nick Althoff (Not pictured.)\nTreasurer-Elect: Jasper Logan\nExecutive Director-Elect: Anthony Garcia", "2020-02-22T19:14:30.000Z": "Teresa and I joined the Missouri Federation of Republican Women for lunch. \n\nAs Missouri's First Lady, she has made the Governor's Mansion more accessible to the public, works with at-risk youth, and advocates for special needs children.", "2020-02-22T17:09:24.000Z": "It's going to be one heck of a year. #mogov 'One heck of a year': Parson kicks off Lincoln Days predicting GOP sweep \"We're going to go for the president and we're going to win all the statewides,\" he said. news-leader.com", "2020-02-22T16:39:08.000Z": "This morning we addressed the state committee members of the Missouri Republican Party.\n\nOur party is strong and working hard to win in November. #mogov", "2020-02-22T03:19:04.000Z": "Over 1/4 of circuit court judges are @realdonaldtrump constitutional conservatives. Quote Tweet Julie O'Donoghue @JSODonoghue . @RoyBlunt is getting credit/praise for helping to get @realDonaldTrump 's federal judge appointments through Congress. He got a standing ovation from this Republican crowd.", "2020-02-22T01:40:19.000Z": "It was great to be in Springfield with Governor Scott Walker tonight.\n\nThe 2020 Missouri Republican Lincoln Days is off to a fantastic start. Our party is STRONG! #mogov", "2020-02-21T03:09:33.000Z": "Exciting night at the Osage County Republican Lincoln Day.\n\nThey are seeing the effects of what happens when you focus on what matters- record low unemployment, 40,000 new jobs, rising wages. We are just getting started! #mogov", "2020-02-20T21:11:45.000Z": "Join Governor @ScottWalker and me as we kick off the 2020 Missouri Republican Lincoln Days in Springfield tomorrow. #mogov Doors open at 5 p.m. Find out more information and sign up! --> http:// bit.ly/kickoffLD2020", "2020-02-20T01:30:06.000Z": ". @TGMissouri recently announced their expansion in Perryville, and today I was able to visit for an update on their progress. We're going to keep leading the way to ensure our economy stays strong and Missourians are adequately prepared for the jobs of the future. #mogov", "2020-02-20T01:30:03.000Z": "Businesses are expanding in Missouri because we have been working tirelessly to make sure our workers have the skills and training to fill the high-demand jobs of the future. #mogov", "2020-02-19T21:30:00.000Z": "NEW JOBS ALERT!\n\nTwo Hundred new jobs in Moberly! We have made HUGE progress- 40,000 new jobs across the state, record low unemployment, and rising wages.\n\nHelp us keep our state moving in the right direction. Join Team 57 NOW --> https:// mikeparson.com/team-57 New bacon facility expected to create 200 jobs in Moberly - ABC17NEWS A meat packaging company plans to build a facility in Moberly that would create hundreds of new jobs. abc17news.com", "2020-02-19T18:40:43.000Z": "Governor Parson kicked off the 2020 Lincoln Days circuit in Cole County this week. The packed crowd was excited and ready to keep Missouri red in 2020. #mogov", "2020-02-19T14:07:45.000Z": "Major announcement! @Eric_Schmitt is running for Missouri Attorney General in 2020. Watch our announcement video and join the campaign! Eric Schmitt is Missouri's law and order Attorney General. As your Attorney General, my job is to stand on the frontline of freedom and be the last line of defense. We have much more work to do to defend the rule... facebook.com", "2020-02-18T16:15:46.000Z": "Team Parson is proud to announce the first round of county elected official endorsements! HUGE support for Governor Parson! #mogov Parson Campaign Announces Strong Support from Cole County Elected Officials - Parson for Missouri Parson Campaign Announces Strong Support from Cole County Elected Officials mikeparson.com", "2020-02-18T04:12:13.000Z": "Team Parson in Cole County is fired up! #mogov", "2020-02-18T04:11:04.000Z": "We kicked off our  2020 Lincoln Day circuit with Cole County Republicans tonight. They are ready to keep Missouri red in 2020. #mogov", "2020-02-17T03:43:06.000Z": ". @MSHPTrooperGHQ is assisting in St. Louis County after a gunman shot & wounded an off-duty officer who was working security. Officer is stable. @FirstLadyTeresa & I are praying for the officer's recovery & for all officers working to protect us & serve justice #BackTheBlue", "2020-02-16T22:04:22.000Z": "Last week, Governor Parson announced the recipients of $700,000 in grants for local law enforcement. These funds will allow agencies to purchase life-saving equipment to help our officers stay safe while protecting our communities. #mogov", "2020-02-14T17:13:35.000Z": "Teresa, I never could have done this without you and have only been able to achieve it because of you.\n\nPlease share with your friends and family to help me show Teresa how much we appreciate her work as First Lady of Missouri. Mike Parson Works It gives me great honor to be able to invite you to join me as we begin our campaign to keep Missouri moving forward. MikeParson.com youtube.com", "2020-02-14T13:16:00.000Z": "To the state @FirstLadyTeresa and I love so much, happy Valentine's Day Missouri!\n\nWe remain committed to building up and moving the state forward for the next generation privileged to call Missouri \"home.\"", "2020-02-10T23:02:47.000Z": "I was very honored to attend @FLOTUS 's luncheon today! #MissouriProud Quote Tweet Melania Trump @FLOTUS Had a great afternoon hosting the Governors' Spouses' Luncheon at the @WhiteHouse today. We discussed the values of #BeBest and how they can be used to effect positive change in all states and communities across the country.", "2020-02-07T22:25:10.000Z": "Missouri's economy continues to grow at a historic rate. We're making sure that Missourians receive the skills they need to join our workforce and find great jobs. #mogov Missouri general revenue sees increase at start of 2020 Missouri's net general revenue collections in January were up by 7.4 percent, the state budget director announced Thursday. themissouritimes.com", "2020-02-07T16:30:49.000Z": ". @WateredGardens emphasizes a hand-up, not a hand-out, by asking residents to participate in the program too. 1hr of work earns groceries for a week. Very inspiring visit.", "2020-02-05T21:35:56.000Z": "Now we can finally move on from this terrible partisan distraction and get back to doing the work of the American people.", "2020-02-05T21:35:55.000Z": "Today the United States Senate upheld its responsibility to the American people and acquitted President Trump. I applaud both Senators Blunt & Hawley for their vote on behalf of the people of Missouri. Since the beginning, this impeachment was a fraud & a complete waste of time.", "2020-02-05T19:50:23.000Z": "Gov. Mike Parson at #ChiefsKingdom rally: \"How bout them Super Bowl Chiefs?\"", "2020-02-05T15:50:55.000Z": "The celebrations have begun! \n\nTeresa and I have made our way to Kansas City ahead of today's parade. What a time to be a Chiefs fan! #chiefsparade", "2020-02-04T22:21:10.000Z": "We MUST protect the American Dream for future generations. Governor Parson is doing just that! #mogov", "2020-02-04T17:51:11.000Z": "President Trump is working hard to put policies into place that will make this country better. It was great to be a part of last night's winning team for our president.", "2020-02-04T15:48:47.000Z": "Rush Limbaugh has been an iconic voice not only in Missouri but across the country. Teresa and I are praying for him during this difficult time. Stay strong!", "2020-02-04T02:25:02.000Z": "President Trump is working hard to bring jobs back to America and rebuild our manufacturing strength. He is getting the job done!\n\nIowa's first in the nation caucus is exciting and and it's an honor to support him here in Fort Madison.", "2020-02-02T22:48:26.000Z": "Chiefs Kingdom Showed up!", "2020-02-02T19:57:09.000Z": "Great to be with Bryan Meyers and @SarahHuckabee !\n\nBryan's organization Veterans Community Project has helped end veteran homelessness in K.C. They are hoping to expand nationwide!\n\nIt's a great day to be a Chiefs fan!", "2020-02-01T17:27:36.000Z": "The most pro-life governor. Ever. #mogov", "2020-02-01T17:25:21.000Z": "We are creating a culture in Missouri that protects women's health and defends those who cannot defend themselves.\n\nProud to stand with thousands at the Midwest March for Life today. #mogov", "2020-01-31T23:22:29.000Z": "Governor Parson holds a commanding lead in the 2020 campaign for Missouri Governor. Watch this episode of Studio 57 to learn more. #mogov Studio 57 - Real News Updates - E4 Governor Parson holds a commanding lead in the 2020 race for Missouri Governor. youtube.com", "2020-01-29T19:10:22.000Z": "The #USMCA is a 21st century trade agreement that will benefit diverse industries including manufacturers, farmers, tech companies, and any business who sells or buys across North America. #mogov", "2020-01-29T15:24:58.000Z": "THANK YOU! #mogov", "2020-01-27T17:58:55.000Z": "Missourians support President @realDonaldTrump because he's focused on bringing back jobs, restoring our military strength, and making America great again.", "2020-01-27T16:30:00.000Z": "More new jobs for Missouri!\n\nWe're working hard to make sure that companies like EquipmentShare keep moving to Missouri and keep creating great jobs for Missourians.\n\nHelp us protect this progress by joining our team. #mogov -> https:// mikeparson.com/team-57/ Columbia tech-rental company plans to hire hundreds Gov. Mike Parson called EquipmentShare's announcement a \"win-win story\" for the state. columbiamissourian.com", "2020-01-27T14:34:00.000Z": "Not so long ago, six million martyrs, including 1.5 million children, were exterminated simply because of their religious beliefs and heritage. We should not only remember their deaths, but also the lives they led and families they loved. #WeRemember", "2020-01-24T19:45:11.000Z": "Missourians are proud of our governor for standing up for women's health and defending those who cannot defend themselves. #mogov Governor Parson to be First Governor to Participate in Midwest March For Life - Parson for Missouri Governor Mike Parson will be the first governor to participate in the Midwest March for Life on Saturday, February 1, 2020. This is the region's largest pro-life gathering with over 2,000 in attend... mikeparson.com", "2020-01-22T17:33:54.000Z": ".\nWe are going to fix this. There are critical job openings that these spouses can fill, and we MUST remove these unnecessary regulations.", "2020-01-22T17:33:53.000Z": "When the spouses of servicemen & women move to our communities they face considerable challenges. Those challenges include burdensome regulations that prevent them from using the skills & training they have received in a different state. #mogov", "2020-01-21T19:38:49.000Z": "Our administration is committed to professional license reciprocity for military spouses who move to Missouri as a part of a Permanent Change of Station.\n\nThis is a common sense solution to fill our high-demand jobs, especially in healthcare. #Military  #Veterans  #MissouriForward", "2020-01-21T15:16:25.000Z": "More people have more money in their pockets, and the tax cuts at the state and federal level are ABSOLUTELY having a positive impact! #mogov", "2020-01-20T16:17:44.000Z": "Today, we honor the life of Rev. Dr. Martin Luther King Jr. and reflect upon his dream for America. \n\nMore than 50yrs after his tragic death, Dr. King's legacy continues to inspire people to promote peace, justice, & equality in their communities. #MLKDay", "2020-01-17T21:24:48.000Z": "Honor to join @SecondLady today to release the President's Principles on Workforce Freedom & Mobility. @GovParsonMO & @LarryObhof are leading occupational licensing reforms in their states & are great champions for the Governor's Initiative on Regulatory Innovation led by @VP !", "2020-01-16T23:09:49.000Z": "The State of our State is STRONG! Our economy is BOOMING and we're repairing or replacing more than 250 bridges across the state. #mogov  #MissouriSOTS Studio57- Real News Updates- E2 In his State of the State Address, Governor Parson highlighted our Booming economy and plans to rebuild our roads and bridges. youtube.com", "2020-01-16T14:00:00.000Z": "NOW @GovParsonMO joins @MarcCox971 fresh off the #stateofthestate ! #TuneIn : http:// bit.ly/2Bt96OT  #MCMS 97.1 FM Talk - Younger. Smarter. Better. - LISTEN LIVE | RADIO.COM Listen To 97.1 FM Talk, A News/Talk Station Based Out Of St. Louis. Never Miss A Story Or Breaking News Alert! LISTEN LIVE At Work Or While You Surf. FREE On RADIO.COM. radio.com", "2020-01-15T22:10:20.000Z": "It is an honor and privilege to be the 57th Governor of the State of Missouri. God bless you, God bless the great State of Missouri, and God bless the United States of America.", "2020-01-15T22:05:13.000Z": "We're going to continue working hard every day to help prepare Missourians for the future. #MissouriSOTS", "2020-01-15T22:03:06.000Z": "Holding my newest grandbaby for the first time reminded me just how valuable life is. Every life has value and I am working hard to protect the lives of the unborn. #MissouriSOTS", "2020-01-15T21:59:09.000Z": "Missouri's economy and future financial health has always been of utmost importance to the Parson Administration. \"It is our responsibility to pass this on to the next generation.\" #MissouriSOTS  #WeServeMo", "2020-01-15T21:58:24.000Z": "As a veteran myself, I am proud that Missouri is home to over 480,000 veterans, and I hope that we can bring more to our state. Allowing license reciprocity would not only help us attract more military families, but also fill critical jobs in our economy. #MissouriSOTS", "2020-01-15T21:56:25.000Z": "At the same time opponents have been criticizing us, they are promoting expanding this system. But, the reality is that expanding this system comes at the cost of other vital services such as education, workforce training, and improving our aging infrastructure. #MissouriSOTS", "2020-01-15T21:54:16.000Z": "There is one more very special project that I am so proud to announce, especially in front of Mayor Lucas and our Kansas City delegation WE WILL BUILD THE BUCK O'NEIL BRIDGE. #MissouriSOTS", "2020-01-15T21:52:11.000Z": "The most exciting infrastructure investments we will see in the coming year can be tied back to the bold bridge infrastructure plan that you as legislators passed. More than 250 bridges around the state will be repaired or replaced. #MissouriSOTS", "2020-01-15T21:51:20.000Z": "We can't emphasize workforce development without strong roads and bridges. Repairing and replacing more than 250 bridges across Missouri allows our state to move forward in the right direction. #MissouriSOTS", "2020-01-15T21:50:55.000Z": "MoDNR is proud to work with our partner agencies and Missouri communities to ease the 2019 #MOFlood impacts. #WeServeMO  #MissouriSOTS  http:// dnr.mo.gov/floodrecovery", "2020-01-15T21:48:31.000Z": "A fully funded formula shows the state's commitment to improving lives through education. Providing transportation to ensure students can make it to school to learn is crucial. Buses in MO safely transport more than half a million students every day. #ShowMeSuccess  #MissouriSOTS", "2020-01-15T21:47:32.000Z": "We need to work together to make sure our children receive a quality education. #MissouriSOTS", "2020-01-15T21:44:09.000Z": "Early learning is a WIN for us all! If Missouri wants to ensure a proper finish for our children - where they have everything they need to be successful leaders in the future - then we need to provide a proper start. #ShowMeSuccess  #MissouriSOTS", "2020-01-15T21:44:25.000Z": "As a former sheriff, it is important to me to remember those who risk their lives to keep us safe. Our law enforcement & emergency personnel do a job most don't want to do, but expect them to do it.  We must trust them, and STAND UP for these brave men & women. #MissouriSOTS", "2020-01-15T21:43:49.000Z": "Mrs. Jones has been involved in her same community is St. Louis for over 50 years, keeping an eye on things, offering help and assistance to youth, and always serving others. #MissouriSOTS", "2020-01-15T21:42:52.000Z": "As a former Sheriff and 22-year law enforcement official, I get it. We must back our law enforcement, military and first responders. #MissouriSOTS", "2020-01-15T21:34:00.000Z": "We must protect victims and witnesses, provide more mental health resources and strengthen our laws to target violent criminals. #MissouriSOTS", "2020-01-15T21:32:38.000Z": "It is the private sector that is driving these investments, NOT government. Here are just a few examples. #MissouriSOTS GIF", "2020-01-15T21:31:59.000Z": "Big shout out in today's #MissouriSOTS to the employers creating jobs in #MO ! Aurora Organic Dairy, Boeing, Briggs & Stratton, Bayer, Bunge, CVS, Dollar Tree, General Motors, NGA West, Nucor Steel, Pfizer, Purina, and USDA are just a few! #MO is open for business! GIF", "2020-01-15T21:30:10.000Z": "The prison consolidation & pay plan introduced by @GovParsonMO at the 2019 #MissouriSOTS & implemented by summer drove a big boost in staff income, safety & morale.", "2020-01-15T21:28:43.000Z": "Investment in Missouri means an investment in Missouri's citizens and our economic vitality. #MissouriSOTS", "2020-01-15T21:26:54.000Z": "African American unemployment in Missouri has dropped from over 10% in 2014 to 5.5% today. #MissouriSOTS GIF", "2020-01-15T21:24:46.000Z": "@GovParsonMO \"Aurora Organic Dairy opened a new processing plant in Columbia, creating over 100 new jobs...\" #MissouriSOTS | #beMORE", "2020-01-15T21:25:06.000Z": "Missouri now ranks 7th in the nation for small business wage growth. #MissouriSOTS Small business pay checks are growing at a fast pace as job gains slow Weekly earnings for small business employees grew at an annual rate of 4.1% in December, according to a Paychex/IHS Markit monthly report. cnbc.com", "2020-01-15T21:21:09.000Z": "Missouri families have more money in their pockets thanks to state and federal tax cuts. #MissouriSOTS", "2020-01-15T21:17:53.000Z": "We're working hard every day to help prepare Missourians for the jobs of the future. #MissouriSOTS", "2020-01-15T19:34:06.000Z": "Another trade deal, another win for @realDonaldTrump , another win for the USA, another win for Missouri farmers. Quote Tweet The White House @WhiteHouse Today's deal secures some $40-50 BILLION in purchases of U.S. products-a huge WIN for farmers and producers across America!", "2020-01-15T18:55:07.000Z": "Initial promises from the Phase One Trade Agreement with China include more than $200 billion in purchases that cover a number of industries that thrive in Missouri, including agriculture, energy, manufacturing & other services. A tremendous victory for our American economy!", "2020-01-15T16:20:44.000Z": "Today, I will address the Missouri General Assembly and give the State of the State. \n\nWatch LIVE on my Facebook page, OR at @MoGov . #MissouriSOTS", "2020-01-14T17:48:25.000Z": "Tomorrow, I will give my State of the State address to the Missouri General Assembly.\n\nI invite all Missourians to watch it on Facebook LIVE or at https:// mo.gov/live where it will be saved for anyone wanting to view it at a later time. #MissouriSOTS", "2020-01-13T21:43:34.000Z": "Governor Parson will be delivering the State of the State address on Wednesday at 3pm. For anyone interested in tuning in live, you can click on the following link: https:// mo.gov/live Or, you can find the address on the Governor's Facebook page. #MissouriSOTS  #WeServeMo", "2020-01-12T01:55:21.000Z": "Despite some rough weather, there was a good crowd at the 2019 Missouri Cattle Industry Convention & Trade Show. @FirstLadyTeresa and I always enjoy talking with our fellow cattle farmers.", "2020-01-10T17:51:22.000Z": "Today is jobs day & a day to celebrate the US economy, American business, & the #AmericanWorker ! 7.1 million jobs created since the election. Lowest level of unemployment in 50 years. Historic gains in the stock market.\n\nThank you President @realDonaldTrump ! #JobsReport", "2020-01-10T17:50:00.000Z": "Missouri is now 7th in the nation for small business wage growth thanks to low taxes and our historically low unemployment rate of 3.1 percent. #MissouriForward Small Business Pay Checks are Growing at a Fast Pace as Job Gains Slow www.cnbc.com", "2020-01-09T23:00:00.000Z": "2019 was a HISTORIC year & we've been focused on working hard for Missourians.\n\nThrough education, training, & making sure students know about the great paying jobs that are available, wages will continue to rise and our economy will keep BOOMING! #mogov Parson cites 2019 high points, cooperation in chamber talk Missouri scored some significant economic gains in 2019, with unemployment near record levels and secure funding for a new Interstate 70 bridge near Rocheport among the highlights, Gov. Mike Parson... columbiatribune.com", "2020-01-09T20:56:30.000Z": "Unemployment is at a record low 3.1% and we've created nearly 40,000 new jobs. We're going to continue working hard for the people of Missouri. #mogov Studio 57 - Real News Updates - E1 Unemployment is at a record low 3.1% and we've created nearly 40,000 new jobs. We're going to continue working hard for the people of Missouri. youtube.com", "2020-01-09T19:00:00.000Z": "We NEED to keep moving Missouri forward! That means fixing our state's infrastructure and continuing to invest in our workforce.\n\nWhen we come together on focus on doing the hard work for Missourians we can make real progress for our state. #mogov Parson outlines priorities for Missouri's 2020 legislative session COLUMBIA, Mo. (Missourinet)- Transportation and workforce development are two of Governor Mike Parson's (R) top priorities for Missouri's 2020 legislative session, which begins Wednesday at n ozarksfirst.com", "2020-01-09T18:00:01.000Z": "Law enforcement put their lives on the line each day to defend our families and our communities.\n\nThis Law Enforcement Appreciation Day, let's remember their sacrifice and the sacrifice that their families make.", "2020-01-09T16:46:35.000Z": "Honored to have @SecretaryCarson from @HUDgov be our featured speaker at the 2020 Governor's Prayer Breakfast.\n\nSecretary Carson shared a powerful story from his days as a pediatric neurosurgeon when walking by faith was one little boy's only hope of healing.", "2020-01-08T21:42:00.000Z": "It was great to catch up with @MarcCox971 this morning to talk about today's start to the legislative session and what we are doing to protect our state's historic progress. #mogov LISTEN HERE->> Governor Parson on The Marc Cox Morning Show. (Jan. 8, 2020) - Parson for Missouri Governor Parson joined Marc Cox to discuss the start of the 2020 legislative session and the 2020 campaign mikeparson.com", "2020-01-08T17:38:25.000Z": "Governor @mikeparson begins 2020 #Mogov race with a $5 MILLION dollar lead!\n\nBut, wait there's more... 40,000 New Jobs Record Low Unemployment Over $4 BILLION in Private Investment #2 in Nation for Small Biz Wage Growth https:// themissouritimes.com/67017/parson-r akes-in-540k-in-q4-fundraising/ ", "2020-01-07T22:42:30.000Z": "CHECK out my interview from today with Pete Mundo on KCMO Talk Radio. We discussed the upcoming legislative session and the 2020 campaign. -> Governor Parson on KCMO Talk Radio (Jan. 7, 2020) - Parson for Missouri Governor Parson spoke with KCMO Talk Radio's Pete Mundo about the upcoming legislative session and his histroic 2020 campaign. mikeparson.com", "2020-01-07T14:04:12.000Z": "TUNE IN!\n\nI'll be on KCMO Talk Radio 710am with @PeteMundo at 8:05.    We're talking about the upcoming legislative session and the 2020 campaign.", "2020-01-06T01:59:37.000Z": "Today, Firefighter Chuck McCormick of the West Peculiar @WPFPD was killed as he helped fight a home fire. His death is a reminder of the brave and selfless work of Missouri's fire service. Teresa and I pray for his family and for our fire service community across Missouri.", "2020-01-03T22:17:13.000Z": "Curious about our decision on refugee resettlement?\n\nThe consent to continue refugee resettlement in Missouri was in response to President Trump's Executive Order 13888.\n\nGET THE FACTS", "2020-01-02T20:31:59.000Z": "Missourians are seeing more money in their pocket because of our Historic LOW unemployment, a skilled workforce, and low taxes! \n\nJoin our team today to help us protect this progress. --> https:// mikeparson.com/team-57/ Small business pay checks are growing at a fast pace as job gains slow Weekly earnings for small business employees grew at an annual rate of 4.1% in December, according to a Paychex/IHS Markit monthly report. cnbc.com", "2020-01-01T06:00:00.000Z": "Happy New Year from Teresa and me. Our state saw historic growth in 2019 and we are going to work hard to keep it going in 2020!", "2019-12-31T23:45:43.000Z": "Missouri experienced a HISTORIC 2019. Check out our top 10 most talked-about accomplishments of the year. We need your help to protect this progress. Join our team TODAY! #MOGOV -> http:// bit.ly/Top-10-mp", "2019-12-30T22:51:56.000Z": "┏━━┓┏━━┓┏━━┓┏━━┓\n┗━┓┃┃┏┓┃┗━┓┃┃┏┓┃\n┏━┛┃┃┃┃┃┏━┛┃┃┃┃┃\n            RE-ELECT @mikeparson ┃┏━┛┃┃┃┃┃┏━┛┃┃┃┃\n┃┗━┓┃┗┛┃┃┗━┓┃┗┛┃\n┗━━┛┗━━┛┗━━┛┗━━┛", "2019-12-23T22:00:00.000Z": "The First Lady and I are excited to wish all Missourians a Merry Christmas! Be sure to take the time to create special memories. They will be cherished for a lifetime.", "2019-12-25T11:00:21.000Z": "The First Lady and I are wishing you and yours a very Merry Christmas.", "2019-12-24T18:38:18.000Z": "Not everyone is able to spend Christmas at home with loved ones. Teresa & I encourage everyone to give back and count our blessings this holiday season. We just visited many brave patients at @muhealth 's University Hospital & the Women's and Children's Hospital. #MOHolidayCheer", "2019-12-22T23:55:53.000Z": "Teresa and I love opening up the \"People's House\" and inviting our friends over. \n\nGreat to have the Missouri Republican Party over tonight for a Christmas Reception. Our party is strong! #mogov", "2019-12-22T17:15:24.000Z": "May the light of the Chanukah candles bring peace, health and happiness to your family. Happy Hanukkah!", "2019-12-19T01:13:53.000Z": "Instead, a political party has weaponized impeachment for the first time in history. They haven't moved past Republican's HISTORIC victory in 2016 and can't beat our president at the ballot box in 2020.", "2019-12-19T01:13:52.000Z": "*1,340*\n\nThe number of days liberals have been obsessed with this impeachment scam. Those 1,340 days could have been spent working on issues that would've made life better for all Americans. #mogov", "2019-12-18T19:21:15.000Z": "Our economy is BOOMING! Historic 3.1% unemployment; Nearly 40,000 new jobs; Second in the nation for completed apprenticeships;\n\nCheck out the latest jobs report --> http:// bit.ly/NOV_Jobs", "2019-12-13T22:38:22.000Z": "Businesses know that our American economy is thriving! Just last month, the @WhiteHouse celebrated 266,000 new jobs. @GM investing $1.5 billion & retaining 4,000 jobs in MO is a great example of our economic strength.", "2019-12-13T23:36:39.000Z": "From day one, we talked about the importance of workforce development & infrastructure. Thanks to Reps @Kathyswan147 & @NickBSchroer , Senator @lincolnhough and legislators who supported SB68 we have the economic development tools to make a $1.5 billion GM investment a reality.", "2019-12-13T19:21:28.000Z": "Exciting announcement for Wentzville - @GM is making a commitment to our state by investing $1.5 billion in the Wentzville plant & retaining nearly 4,000 jobs. Great to see GM President Mark Reuss in Missouri for this terrific news, thank you for investing in our state.", "2019-12-13T19:50:06.000Z": "Today's announcement by GM is a testament to the quality of MO03's workforce & our state's business environment.  Looking forward to many more years of success in Wentzville as auto manufacturing in the U.S. continues to strengthen. GM to invest $1.5 billion in Wentzville, keep 4,000 employees, to build 'next-generation' midsize... Investment will help retain 4,000 jobs at the St. Charles County plant, the company said. stltoday.com", "2019-12-13T20:15:30.000Z": "More great news this holiday season! Today's GM Wentzville plant announcement preserves jobs for the dedicated workforce of nearly 4,200 employees. These jobs strengthen the state's economy & will prepare small businesses & manufacturers for the future. #MissouriProud", "2019-12-13T19:02:48.000Z": "Huge win for Missouri as @GovParsonMO  @DixonRob get 1.5 billion investment retaining 90% of workforce. Happy to have played a part as the sponsor of this enabling language in the House #moleg Quote Tweet Missourinet @Missourinet GM investing $1.5 billion in trucks to be built at Wentzville plant, retaining 4,000 jobs https:// wp.me/p16gMv-vWZ", "2019-12-13T20:33:50.000Z": "Was proud to be with Governor @MikeParson in #Wentzville today for the @GM announcement.  With his leadership and the legislature's support we helped retain 4,000 manufacturing jobs remained in St. Charles County. #moleg Quote Tweet Governor Mike Parson @GovParsonMO HUGE to join @GM leadership, government officials, and community partners for the announcement of GM's decision to invest $1.5 billion and retain nearly 4,000 jobs at its Wentzville facility! Show this thread", "2019-12-13T18:12:33.000Z": "HUGE thanks to the 4,200+ @GM workers who really make our state GO! GM's investment in Wentzville is the largest in our state's history = $1.5 billion! Proud to help ensure these great paying, US manufacturing jobs are kept in the heart & soul of America. MO's economy is strong! Quote Tweet Missourinet @Missourinet GM investing $1.5 billion in trucks to be built at Wentzville plant, retaining 4,000 jobs https:// wp.me/p16gMv-vWZ", "2019-12-12T21:25:19.000Z": "As a father & grandfather, this issue is personal to me. \n\nWe're working to ensure that working families have access to affordable childcare options. \n\nFull comments from my visit to the @WhiteHouse with @Mike_Pence and @IvankaTrump .--> http:// bit.ly/working-famili es ", "2019-12-12T15:18:27.000Z": ". @IvankaTrump has been working to provide opportunity in the workforce through paid family leave and I was glad to join the @WhiteHouse Child Care & Paid Leave Summit this morning.", "2019-12-11T04:19:54.000Z": "Missouri farm families work hard each and every day. \n\nI'm proud to have the support of @MOFarmBureau , @MoCattle , @MissouriCorn , @Mo_Soy , @Missouriagribusiness, and others. \n\nLet's keep working to make sure that the agriculture industry remains strong!", "2019-12-10T18:48:18.000Z": "Merchandise - Parson for Missouri mikeparson.com", "2019-12-10T18:30:00.000Z": "ORDER TODAY!\n\nYour Missouri Christmas Tree won't be complete without one of these Special Edition Parson Family Ornaments. \n\nThere are a limited supply and orders must be placed by December 16th! Don't Wait!", "2019-12-10T16:14:54.000Z": "Proud of our @HealthyLivingMo team members' work protecting the health of Missourians across our state! \n\nToday, I joined the Division of Community & Public Health's team meeting and thanked hundreds of our DHSS team members on behalf of Missouri. #WeServeMO", "2019-12-10T16:46:23.000Z": "Promises kept!", "2019-12-10T15:07:48.000Z": "Governor Parson needs your help!\n\nOur economy is booming and unemployment is at a record low but there are liberals trying to stop these HISTORIC gains.\n\nJoin Team 57 and play a critical role in making sure that our state continues to grow STRONGER than ever before. #mogov", "2019-12-06T15:49:33.000Z": "Under President @realDonaldTrump , U.S. businesses are expanding, hiring, and raising workers' wages!", "2019-12-09T15:51:11.000Z": "It was great to be with the @MOFarmBureau this morning. Thank you to all Missouri farmers for the work you do to make our state's leading industry a success. #mogov  #MOFB19 Quote Tweet Missouri Farm Bureau @MOFarmBureau \"To meet the demands of the world coming up, it will be on our shoulders. It's up to us for the future generations to know what agriculture is all about.\" - @GovParsonMO at #MOFB19", "2019-12-05T20:32:57.000Z": "Congratulations to @MissouriYAG Student Governor Thora Pearson. Glad we got to meet Governor to Governor. Good luck to the Pearson Administration during session!", "2019-12-05T20:01:02.000Z": "Big thanks to our intern @elijahmayf for helping staff today's event with @MissouriYAG students in Jefferson City for their state conference. #MissouriProud", "2019-12-05T16:11:06.000Z": "Great work by our troopers at @MSHPTrooperF . Quote Tweet MSHP Troop F @MSHPTrooperF An SUV was stopped for crossing the centerline on I-70 last night. K9 Rony showed up & sniffed out... 22,200 THC Vape Cartridges With 85-90% THC value Worth about $1.1 million\n\nDetails:\n1. https:// bit.ly/38aiPcf 2. https:// bit.ly/2sJ7Wh3", "2019-12-04T22:22:52.000Z": "I have championed some of the strongest pro-Second Amendment laws in the country & I have always proudly received the NRA's highest A+ rating & endorsement. \n\nWe will continue defending our constitutional rights while working to keep guns out of the hands of violent criminals.", "2019-12-04T22:22:51.000Z": "As a former Sheriff and law enforcement official for 22 years, I firmly believe that any solutions to reduce violent crime should punish the most dangerous criminals and thugs, not law-abiding gun owners. #mogov", "2019-12-03T14:47:55.000Z": "Come celebrate the Christmas Season with us at the People's House. The opening ceremony starts this Friday at 6pm where we will officially light the Mansion's 30ft Missouri Christmas Tree! https:// facebook.com/events/5051234 83420165/ ", "2019-12-02T20:00:00.000Z": "LIMITED QUANTITY!\n\nCyber Monday is the perfect time to get EXCLUSIVE Team 57 merchandise for your friends and family before its gone! \n\nOrdering TODAY ensures arrival by Christmas. -> https:// mikeparson.com/merchandise/"}