{"2020-07-30T14:25:28.000Z": "Make no mistake: the election will happen in New Hampshire on November 3rd.  End of story. Our voting system in NH is secure, safe, and reliable. We have done it right 100% of the time for 100 years - this year will be no different.", "2020-07-30T19:25:21.000Z": "Ahead of this weekend's race, @NHMS has published safety guidance, which includes: Attendees will be required to wear masks upon entry, exit, and in high traffic areas All staff will wear masks There will be social distancing throughout the Speedway Temperature checks", "2020-07-30T19:16:43.000Z": "Last month we launched the Housing Relief Program to keep people from losing their housing & to secure/maintain permanent housing. Funding is available to households unable to pay rent due to #COVID19 . This is a $35M, ongoing program with no current end date. Click below to apply Click to apply www.goferr.nh.gov", "2020-07-30T19:15:51.000Z": "Qualifying colleges and universities must be NH based, approved by the NH Higher Education Commission, have a physical campus in the state, and have endowments or reserves of less than $300 million.", "2020-07-30T19:15:38.000Z": "THREAD: The Safer Scholars Campus Modification Program will assist private, non-profit colleges and universities as they modify their operations in light of COVID-19 and prepare to reopen their campuses to students this fall. Click below to apply. Click to apply www.goferr.nh.gov", "2020-07-30T19:14:30.000Z": "We're launching our second round of funding for Long Term Care Facilities. Funding is available to all long-term care providers - even if the facility has already received funding. Click below to apply. Click to apply www.goferr.nh.gov", "2020-07-30T19:13:38.000Z": "We are reopening our Emergency Health Care System Relief Fund for a third round of funding. Funding is available to all health care providers - even if they have received earlier funding. Click below to apply. Click to apply www.goferr.nh.gov", "2020-07-30T19:12:44.000Z": "The Veterans Service Organization Support Program provides for organizations like New Hampshire VFWs, American Legions, and Disabled American Veterans chapters that have lost revenue due to #COVID19 . Click below to apply. Click to apply www.goferr.nh.gov", "2020-07-30T19:11:57.000Z": "The Traditional Veterans Services Support Program provides grants to eligible organizations and businesses that offer traditional services to NH veterans that have experienced, or anticipate, increased service demand or expenses due to #COVID19 . Click below to apply. Click to apply www.goferr.nh.gov", "2020-07-30T19:10:54.000Z": "The NH General Assistance and Preservation GAP Fund is designed to provide emergency financial relief for NH businesses and nonprofits that have been impacted by #COVID19 , but have been unable to access support from other state and federal programs. Click below to apply. Click to apply www.goferr.nh.gov", "2020-07-30T19:09:39.000Z": "The Empowering Youth Program makes $2M available to NH summer and school-year youth programs that serve middle and high school students. Applications will be taken on a rolling basis and must be submitted by August 17 at 6 PM. Click below to apply. Click to apply www.goferr.nh.gov", "2020-07-30T18:59:18.000Z": "HAPPENING NOW: I'm holding a press conference to provide a #COVID19 update. Click below to watch live. Click to watch live www.wmur.com", "2020-07-29T16:47:41.000Z": "Thank you @GovChrisSununu for bringing more awareness to #VirtualSWAM20 and helping to make sure that our Fallen #NewHampshire service members are Never Forgotten.  #NeverForget  #SWAMToRemember Quote Tweet Chris Sununu @GovChrisSununu There's still time to get in a swim in support of @Swim4aMission and this year's virtual event, honoring 89 post-9/11 service members who lost their lives serving our country and raised money to support organizations providing services for veterans. Click below to learn more.", "2020-07-29T16:37:09.000Z": "There's still time to get in a swim in support of @Swim4aMission and this year's virtual event, honoring 89 post-9/11 service members who lost their lives serving our country and raised money to support organizations providing services for veterans. Click below to learn more. Click to learn more www.swimwithamission.org", "2020-07-28T23:15:21.000Z": "The Americans with Disabilities Act was a profound piece of legislation that changed the landscape of America. As we celebrate the 30th anniversary of the ADA being signed into law, I've issued a proclamation to recognize this historic piece of legislation. Watch:", "2020-07-28T18:23:40.000Z": "No birthday is complete without the official birthday card from @GovChrisSununu ! Thanks Gov!", "2020-07-28T19:01:22.000Z": "Today we launched the Veterans Relief and Support Fund, which is intended to assist homeless veterans, aid veterans service programs that provide direct traditional services, such as financial assistance, and provide mental health support. Learn more: Veterans Relief and Support Fund Governor Chris Sununu has authorized the allocation of $7 million in CARES Act Coronavirus Relief Fund (\"flex funds\") to help veterans in the Granite State through the New Hampshire Veterans COVID-19... goferr.nh.gov", "2020-07-28T18:21:05.000Z": "Importantly, of those that currently receive support from New Hampshire's scholarship organizations, 22% of them are of racial and ethnic minority populations, which is more than double our statewide demographic. (/5)", "2020-07-28T18:21:04.000Z": "THREAD: A few weeks ago, our office received a letter from minority owned businesses with ideas and potential recommended action items. Acknowledging that minorities and people of color have been disproportionately impacted by #COVID19 , we have worked to take additional actions.", "2020-07-28T18:17:01.000Z": "THREAD: Today, I am signing an Emergency Order that frees up additional funding for the UNIQUE Annual Allocation Scholarship Program by temporarily expanding it due to #COVID19 . This change will increase funding for direct scholarships by up to $8 million dollars.", "2020-07-28T18:15:22.000Z": "The goal of this review is to establish patterns or links between the way the ventilation system/air flows through the building and the spread of #COVID19 . (/5)", "2020-07-28T18:15:21.000Z": "THREAD: We know that long term care facilities have faced the brunt of the #COVID19 crisis in NH - and today we're announcing that the state will be undergoing a two week review of all long-term-care facilities that have had an outbreak of COVID-19.", "2020-07-28T15:59:04.000Z": "TIME CHANGE: Today's #COVID19 press conference will be held at 2 PM, rather than at our usual 3 PM time. Click below to watch live. Watch live at 2 PM www.wmur.com", "2020-07-27T16:19:47.000Z": "Today I will be issuing a new emergency order that rescinds the ban on reusable bags when shopping. We looked at the latest data, consulted with officials at public health and ask individuals to be courteous and respectful to retail/grocery workers by cleaning your reusable bags.", "2020-07-24T17:09:24.000Z": "Earlier today I signed HB 1182, the State's 10 Year Transportation Improvement Plan, into law with students from @AlvirneBroncos Career Technical Education Program. In addition to our transportation plan, this bill provides critical funding to support CTE education programs.", "2020-07-23T21:28:30.000Z": "7/23/2020 SEVERE THUNDERSTORM WARNING for parts of Hillsborough and Merrimack Counties until 6:15PM. Seek shelter indoors immediately. Expect heavy rain, hail, lightning, and strong winds. #NHwx  #ReadyNH  #BePrepared  #BeSafe Quote Tweet NWS Gray @NWSGray Severe Thunderstorm Warning including Concord NH, Suncook NH, Hooksett NH until 6:15 PM EDT", "2020-07-23T19:21:26.000Z": "Assure testing sites have written protocols for community outreach and demographic identifier data Assure healthy food access Create communication channels to hear community voices\n\n(4/)", "2020-07-23T19:21:25.000Z": "Among the recommendations in the report that are currently underway, or are achievable and can be implemented in some manner in the near future, are: Robust disparity data dashboards Increased community testing Conduct Equity Review analyses\n\n(3/)", "2020-07-23T19:21:24.000Z": "While our office continues to review the report, we've identified numerous recommendations that are currently underway or that can prompt immediate action from the state. (2/)", "2020-07-23T19:21:23.000Z": "THREAD: Yesterday, I released the initial report and list of recommendations from the Governor's #COVID19 Equity Response Team. The group worked incredibly hard, and I can't thank them enough for their service.", "2020-07-23T19:14:44.000Z": "Tomorrow, self-employed individuals who have applied for the SELF program will receive an email from the state notifying them of an approval, a notice of non-eligibility, or a request for additional information to validate. The initial approval list includes $26M in relief funds.", "2020-07-23T19:06:59.000Z": "It was an honor to sign HB 1135 into law today with Kati Preston, a Holocaust survivor, by my side. Until today, NH did not require that stories like Kati's are told, ensuring our children learn from the past and that the atrocities of the Holocaust are not forgotten.", "2020-07-23T19:05:17.000Z": "This bill also provides financial support to municipalities so that they have the resources needed to bring their water systems up to standard. (2/3)", "2020-07-23T19:05:16.000Z": "THREAD: This morning I signed HB 1264 into law, strengthening our clean drinking water standards, ensuring we have some of the strongest in the nation. As I've long said, when you turn your faucet on at home, you expect the water to be safe to drink. This bill will help do that.", "2020-07-23T02:19:50.000Z": "7/22/2020: FLASH FLOOD WARNING for parts of Cheshire County until 1:15AM. Move to higher ground immediately! Flash flooding is already occurring or is expected to begin soon. Do not drive through flooded roadways. #NHwx  #ReadyNH  #BePrepared  #BeSafe Quote Tweet NWS Gray @NWSGray Flash Flood Warning including Winchester NH, Hinsdale NH until 1:15 AM EDT", "2020-07-21T23:10:17.000Z": "There's no task too big or small for New Hampshire. We simply get the job done. Proud that our innovative partnerships have been able to supply PPE to over 9 million veterans at @DeptVetAffairs hospitals across the United States.", "2020-07-21T20:08:06.000Z": "Grateful for all of the hard work being done by our @NHNationalGuard members to assist in the state's response to #COVID19 . Quote Tweet NHNG @NHNationalGuard All Hands\n\nGov. Chris Sununu & NH Adjutant Gen. David Mikolaities pitched in to help guardsmen offload PPE at M-B Regional Airport today. It was the seventh shipment of medical gowns to be distributed to VA centers throughout the state & nation. #603Pride , #NHNG , #VeteransAffairs", "2020-07-21T19:35:53.000Z": "Earlier today I signed HB 1623 into law, permanently expanding telemedicine in New Hampshire - one of the first actions I took as part of the State of Emergency. Expanding these services will help streamline our health care system by breaking down burdensome regulations.", "2020-07-21T19:19:07.000Z": "THREAD: Today we're launching the GAP Fund- the NH General Assistance & Preservation Fund- to provide emergency relief to NH businesses & nonprofits impacted by #COVID19 who've been unable to access support from other state/federal programs. Learn more at Welcome An official New Hampshire Government web site. goferr.nh.gov", "2020-07-21T19:16:32.000Z": "The State of NH is launching a new multifaceted PSA campaign to remind younger individuals the importance of mask wearing and social distancing, and encouraging them to get a test to help stop the spread of #COVID19 . View the campaign here: https:// visitnh.gov/industry-membe rs/industry-resources/seasonal-campaigns/covid-19/viral ", "2020-07-21T19:01:46.000Z": "HAPPENING NOW: I'm holding a press conference to provide a #COVID19 update. Click below to watch live. Click to watch live www.wmur.com", "2020-07-21T16:05:57.000Z": "Deborah Scher in NH today expressing gratitude to @FedEx , @NHNationalGuard , @GovernorSununu , @VAManchester and Dean Kamen for securing more #PPE to protect @DeptVetAffairs frontline #healthcare workers serving 9 million Veterans during #COVID19 . What a powerful #coalition !", "2020-07-21T16:15:10.000Z": "Live at 3: Governor holding latest COVID-19 briefing State launches PSA campaign urging mask use as NH's 400th COVID-19 death announced New Hampshire is launching a campaign to encourage mask wearing as the state records its 400th death connected to COVID-19. wmur.com", "2020-07-21T15:26:04.000Z": "Today, NH secured another shipment of lifesaving PPE - over 400,000 gowns that will be delivered to @DeptVetAffairs facilities across the country. New Hampshire has become an expert at procuring PPE, and we're proud to play our part to help deliver these lifesaving materials.", "2020-07-20T14:23:36.000Z": "Great news: @GovChrisSununu has signed HB705 and HB1240 into law! We are thankful for the Governor's efforts to strengthen protections for survivors of domestic and sexual assault in NH #nhpolitics", "2020-07-20T15:09:43.000Z": "This morning I signed HB 1240 and HB 705 into law, which further protect victims of child abuse, sexual assault, and domestic violence. Grateful to have been joined by Ana Goble, who courageously raised concerns about a teacher's interactions with students while in middle school.", "2020-07-18T15:30:57.000Z": "John Lewis represented the best of America. A champion of the Civil Rights Movement, Rep. Lewis reminded our nation that we must always strive to do better, to be better, and to further pursue the blessings of liberty. We must not let the spirit he emulated waiver. Rest In Peace.", "2020-07-18T15:00:17.000Z": "7/18/2020: A Heat Advisory is in effect for most of NH until 8pm Sunday. Hot temperatures and high humidity may cause heat illnesses. Stay out of the sun, drink plenty of fluids & check on neighbors. Never leave children or pets in vehicles. #ReadyNH  #NHwx  http:// ReadyNH.gov", "2020-07-18T13:51:21.000Z": "Congratulations to the @RHSMainOffice Class of 2020 on their graduation! We could not be more proud of your hard work and the way you've overcome the challenges of the last few months. The future is bright for the Raymond High Class of 2020! Thanks for the hat, Mr. Hayes!", "2020-07-17T23:17:03.000Z": "Thanks to @GovChrisSununu for speaking at today's Raymond High School graduation!", "2020-07-17T22:35:05.000Z": "Great to tour Tulley BMW's new Manchester location earlier this morning and to hear of their future expansion projects. Even in these though times, New Hampshire businesses continue to look towards the future. #603Pride", "2020-07-17T17:10:29.000Z": "Yesterday I signed a comprehensive criminal justice reform bill into law - a strong step forward for New Hampshire. No system is ever perfect, and I look forward to our continued work with the Commission on Law Enforcement Accountability, Community, and Transparency.", "2020-07-17T14:08:29.000Z": "Today is the final day for self employed individuals to apply for the Self Employed Livelihood Fund. Self employed individuals MUST complete their application by 4 PM today to be eligible. Click to apply https://t.co/gfr3v1BuaL", "2020-07-16T22:24:31.000Z": "Attended my first in-person event today to provide @chamber81main with an update on the State's response to #COVID19 , how businesses are adjusting, and the relief funds that have been made available. Great work by all to ensure proper social distancing and mask wearing!", "2020-07-16T19:25:54.000Z": "Great news: @GovChrisSununu has signed HB1645, a bill that will help improve the safety of domestic violence victims and their children! #nhpolitics", "2020-07-16T19:33:12.000Z": "Today I also signed HB 1645 into law, a comprehensive criminal justice reform bill. A few of the highlights are: Prohibits the use of chokeholds by law enforcement Prohibits private prisons in NH Requires police officers to report misconduct Additional bail reform", "2020-07-16T19:14:50.000Z": "THREAD: Earlier this year we announced $10M in funding to help the University System of NH transition to remote learning successfully. Today we're announcing a one time, $19M grant for facility modifications and equipment to increase student safety for their return this fall.", "2020-07-16T19:11:09.000Z": "After reviewing the data from the Main Street Relief Fund, we acted quickly to ensure that self-employed individuals are provided the opportunity to apply for the Self Employed Livelihood Fund. Self employed individuals MUST complete the SELF application by tomorrow at 4:00 PM. Click to apply https://t.co/gfr3v1BuaL", "2020-07-16T19:09:03.000Z": "Today I signed HB 1280 into law, which: Lowers prescription drug costs for Granite Staters Injects transparency in drug pricing Allows NH to import low-cost prescription drugs from Canada Makes the cost of insulin in NH the lowest in the nation & puts a price cap in place", "2020-07-16T17:26:19.000Z": "I'm holding a press conference today at 3 PM to provide a #COVID19 update. Click below to watch live. Click to watch live at 3 pm www.wmur.com", "2020-07-16T14:24:57.000Z": "Applications for the Self Employed Livelihood Fund are due TOMORROW! Self employed individuals MUST submit their application by 4 PM to be eligible to receive funding. Click to complete the SELF application https://t.co/gfr3v1BuaL", "2020-07-15T00:37:26.000Z": "Each district faces unique realities, which is why our K-12 Reopening Guidance, crafted by the School Transition Reopening and Redesign Taskforce, provides flexibility for districts to meet their needs while providing for the safety of students and staff.", "2020-07-15T00:15:16.000Z": "Thank you for your service to Sunapee and Croydon, Gates! We passed mandatory suicide prevention training in our schools with your help, and you were instrumental in holding the line against bad bills these last two years. Quote Tweet Gates Lucas @GatesLucasNH Today I resigned from the @NHHouseofReps given I am moving to Portsmouth. I'm proud of the work we've done in the house to uphold @GovChrisSununu 's vetoes and reject many of the radical policies of the left. It's been an honor serving Sunapee & Croydon! #NHPolitics", "2020-07-14T21:37:24.000Z": "In studio at @WMUR9 about to answer YOUR questions on our new Back-To-School guidance. Tune in!", "2020-07-14T20:50:18.000Z": "I'll be live on @WMUR9 at 5:30 answering your #COVID19 questions. Hope you'll tune-in! Gov. Sununu answers questions about school reopening plan Gov. Chris Sununu answered questions about the state's reopening plan for schools during a segment Tuesday on News 9 at 5:30. wmur.com", "2020-07-14T19:43:31.000Z": "Plans for how a school can provide in-person education as well remote-learning options for those who choose not to return to school for health or safety reasons.\n\n(10/)", "2020-07-14T19:43:30.000Z": "The highlights of the guidance include: Robust daily screening process for staff, students and visitors for symptoms of COVID-19 or risk factors for exposure prior to entering the educational facility.\n\n(7/)", "2020-07-14T19:43:29.000Z": "Instead of a one-size-fits-all approach, this is a guide that will help school districts make their own decisions on education this coming year. (3/)", "2020-07-14T19:43:28.000Z": "We all share the goal of getting our kids back to school safely, but we know each district will have a different path forward. Here in NH, we value local control, and we know that each school district will need to make the best decision for their students and teachers. (2/)", "2020-07-14T19:35:42.000Z": "THREAD: Today we're announcing guidance to safely reopen schools this fall. Designed by the School Transition Reopening and Redesign Taskforce, and approved by public health experts, this guidance provides districts with the flexibility to safely reopen according to their needs. Click to view guidance www.covidguidance.nh.gov", "2020-07-14T19:29:43.000Z": ". @GovChrisSununu says the state is building a two month stockpile of PPE. The Governor says NH goes through 2-2.3M masks per month. #COVID19  #WMUR", "2020-07-14T19:21:12.000Z": "Tomorrow is the last day the @NHNationalGuard will be assisting with our Unemployment Hotline call centers. For the last four months, they've helped field over 540,000 calls.\n\nTHANK YOU to all the Guard members who have played an invaluable role in helping NH respond to #COVID19", "2020-07-14T19:19:41.000Z": "Today we're launching our #COVID19 Response Recruitment Portal - a new, simple, streamlined approach to connecting job-seekers with employers and high-paying jobs available across the Granite State.\n\nView the portal here: https:// unemploymentbenefits.nh.gov", "2020-07-14T15:59:12.000Z": "I'm holding a press conference today at 3 PM to make an announcement with regards to schools. Click below to watch live. Click to watch live at 3 PM www.wmur.com", "2020-07-13T23:43:14.000Z": "7/13/2020: FLASH FLOOD WARNING for parts of Belknap, Carroll and Grafton counties until 10:45PM. Flash flooding is ongoing or expected to begin shortly. Move to higher ground immediately. Do not drive through flooded roadways. #NHwx  #ReadyNH  #BePrepared  #BeSafe Quote Tweet NWS Gray @NWSGray Flash Flood Warning including Plymouth NH, Conway NH, Ashland NH until 10:45 PM EDT", "2020-07-13T19:59:38.000Z": "REMINDER: Grant applications for the Self Employed Livelihood Fund are due this Friday, July 17 by 4:00 PM. Click below to complete yours. Click to complete your grant application https://t.co/gfr3v1BuaL", "2020-07-13T19:46:11.000Z": "Déjà Vu All Over Again\n\nFor the second time as many days, Task Force Distribution secured another shipment of medical gowns that arrived at Manchester-Regional Airport, July 12. The PPE will be distributed to VAs around the state as well as other health care providers.", "2020-07-13T17:37:51.000Z": "Thank you for your 27 years of service to the citizens of New Hampshire, Major Encarnacao! Wishing you all the best in your next advanture. #603Pride Quote Tweet John Encarnacao @JohnAEncarnacao After 22 years @NH_StatePolice , I've decided to retire. My dad would have been so proud to see me become the 1st African American to become a Major in New Hampshire history. Thank you @ChrisSununu and @SenatorHassan for your kind words.", "2020-07-13T16:44:11.000Z": "Strong #thunderstorms will be impacting NH today...stay informed of conditions in your area.  When #thunder roars, go indoors - seek shelter immediately. #ReadyNH  #BePrepared  #BeSafe", "2020-07-12T16:33:54.000Z": "Be Advised NH:\nTraffic reports on Route 1 moved to \"severe \" status. Please check travel and traffic conditions before planning your trip here: https:// newengland511.org", "2020-07-12T14:01:51.000Z": "I signed my 5,501st birthday card earlier this week, with a new card design featuring Mink the Bear and her three cubs. To celebrate I sent Olivia, the first to receive the newly designed card, a special stuffed friend too.\n\nRequest a signed birthday card: https:// new-hampshire.secure.force.com/support/GOV_Re quest_A_Birthday ", "2020-07-10T19:18:51.000Z": "Whether one characterizes it as a \"premium on wages\" or a \"payroll deduction\" the reality remains that if it looks like an income tax, functions like an income tax, & takes more money out of the paychecks of hard working taxpayers like an income tax, then it is an income tax (2/)", "2020-07-10T19:18:49.000Z": "THREAD: For the second time in as many years, the Democrats have put an income tax on my desk. Earlier today, I VETOED the Democrats' income tax. Here's why. (1/)", "2020-07-09T16:50:20.000Z": "There's just over a week left for self-employed individuals to submit their grant application! Be sure to submit yours by Friday, July 17 at 4:00 PM. Click to complete your grant application https://t.co/gfr3v1BuaL", "2020-07-08T21:44:10.000Z": "7/8/2020: SEVERE THUNDERSTORM WARNING for parts of Carroll County until 6:15PM. Take shelter indoors. Be alert for heavy rain, high winds, hail & lightning. Do not drive through flooded roadways. #NHwx  #ReadyNH  #BePrepared  #BeSafe Quote Tweet NWS Gray @NWSGray Severe Thunderstorm Warning including North Conway NH, Fryeburg ME, Lovell ME until 6:15 PM EDT", "2020-07-08T22:01:31.000Z": "7/8/2020: SEVERE THUNDERSTORM WARNING for parts of Coos, Grafton & Carroll counties until 6:45PM. Take shelter indoors. Be alert for heavy rain, high winds, hail & lightning. Do not drive through flooded roadways. #NHwx  #ReadyNH  #BePrepared  #BeSafe Quote Tweet NWS Gray @NWSGray Severe Thunderstorm Warning including North Conway NH, Conway NH, Lincoln NH until 6:45 PM EDT", "2020-07-08T21:40:20.000Z": "7/8/2020: FLASH FLOOD WARNING for parts of Coos & Grafton counties until 8:45PM. Move to higher ground! Flash flooding is ongoing or expected to begin shortly! Do not drive through flooded roadways. #NHwx  #ReadyNH  #BePrepared  #BeSafe Quote Tweet NWS Gray @NWSGray Flash Flood Warning including Keene NH, West Swanzey NH, Troy NH until 8:45 PM EDT", "2020-07-08T18:06:07.000Z": "7/8/2020: Severe Thunderstorm Watch for all counties in NH until 10PM. A watch means severe thunderstorms are likely. Be alert for hail, wind gusts, lightning and heavy rain. #NHwx  #ReadyNH  #BePrepared  #BeSafe Quote Tweet NWS Gray @NWSGray A severe thunderstorm watch has been issued for parts of Maine, New Hampshire and Vermont until 10 PM EDT", "2020-07-08T18:24:50.000Z": "7/8/2020: SEVERE THUNDERSTORM WARNING for parts of Sullivan and Cheshire counties until 3:15PM. Seek shelter! Go indoors and stay away from windows. Be alert for heavy rain, hail & strong wind gusts. Do not drive through flooded roadways. #NHwx  #ReadyNH  #BePrepared  #BeSafe Quote Tweet NWS Gray @NWSGray Severe Thunderstorm Warning including Bellows Falls VT, Charlestown NH, North Walpole NH until 3:15 PM EDT", "2020-07-07T23:32:24.000Z": "Nationwide, thousands of @AmeriCorps members are responding to COVID-19. Today it was my privilege to join the inaugural group of NH COVID Community Care Corps @AmeriCorps members as they took the pledge to #GetThingsDone for America. @GovChrisSununu  @MayorJoyceCraig  @VolunteerNH", "2020-07-07T19:07:08.000Z": "Self-employed Granite Staters and their businesses are an important part of what makes the 603 such a special place to live, work, and raise a family.\n\nSelf-employed individuals MUST complete their S.E.L.F grant application by Friday, July 17 at 4:00 PM. Click to complete your grant application https://t.co/gfr3v1BuaL", "2020-07-07T17:33:05.000Z": "I'm holding a press conference today at 3 PM to provide a #COVID19 update. Click below to watch live. Click to watch live at 3 PM www.wmur.com", "2020-07-07T13:31:21.000Z": "Over $322M has gone out the door through the Main Street Relief Fund to help 5,017 small businesses across NH pay their bills and keep their lights on. Our small businesses are the backbone of our economy, and we're thrilled that these funds have been a lifeline for so many.", "2020-07-06T14:24:04.000Z": "The Self Employed Livelihood Fund grant application is live! Self-employed businesses must complete the grant application by 4:00 PM on Friday, July 17, 2020. Click below to complete yours: Click to complete the SELF grant application https://t.co/gfr3v1BuaL", "2020-07-06T01:22:11.000Z": "7/5/2020: Attention Merrimack, Hillsborough, Strafford and Rockingham Counties SEVERE THUNDERSTORM WARNING until 10PM. Be alert for high winds and hail. Do not drive through flooded roadways. #NHwx  #ReadyNH  #BePrepared  #BeSafe Quote Tweet NWS Gray @NWSGray Severe Thunderstorm Warning including Concord NH, South Hooksett NH, Suncook NH until 10:00 PM EDT", "2020-07-05T23:25:16.000Z": "7/5/2020: Attention Sullivan and Cheshire Counties SEVERE THUNDERSTORM WARNING until 8PM. Be alert for high winds and hail. Do not drive through flooded roadways. #NHwx  #ReadyNH  #BePrepared  #BeSafe Quote Tweet NWS Gray @NWSGray Severe Thunderstorm Warning including Charlestown NH, North Walpole NH, Walpole NH until 8:00 PM EDT", "2020-07-05T00:41:38.000Z": "Stopped by Hampton Beach tonight to check in with life guards, local law enforcement, and small business owners. Couldn't be more proud of our state's resiliency as we celebrate Independence Day. Happy #July4th ! #603Pride", "2020-07-04T12:59:10.000Z": "Wishing all Granite Staters a safe and happy Fourth of July!", "2020-07-02T20:25:40.000Z": "Thank you @GovChrisSununu for helping us spread the word and for all that you do to support our #NHVeterans   #SWAMToRemember  #VirtualSWAM20  #VeteranSupport Quote Tweet Chris Sununu @GovChrisSununu THREAD: NH has lost 89 service members in the War on Terror since 2001. This year, @Swim4aMission is challenging participants to pay tribute to one of those service members by thinking of them while training for the 2020 Virtual Swim With a Mission. https:// swimwithamission.org Show this thread", "2020-07-02T21:36:47.000Z": "As @GovChrisSununu announced earlier today, GOFERR launched an interactive map for the Main Street Relief Fund. To view the map, search by town, business, or address, and see who has received an award & for how much - click here: https:// goferr.nh.gov/main-street-re lief-fund-funds-transparency-map  GIF", "2020-07-02T19:37:17.000Z": "I was paired with Capt. Ryan Phaneuf of Hudson, who was killed in a plane crash while serving in Afghanistan. Each day I wear a @Swim4aMission bracelet with Ryan's name, which reminds me of his sacrifice while I train for this year's event.\n\nLearn more: Home On A Mission For Our Veterans swimwithamission.org", "2020-07-02T19:37:16.000Z": "THREAD: NH has lost 89 service members in the War on Terror since 2001. This year, @Swim4aMission is challenging participants to pay tribute to one of those service members by thinking of them while training for the 2020 Virtual Swim With a Mission. Home On A Mission For Our Veterans swimwithamission.org", "2020-07-02T19:22:17.000Z": "Today we're launching a statewide map of the businesses that have received checks from the Main Street Relief Fund. You can view the map, search by town, business, or address and see who has received a grant and how much it was for by visiting: Main Street Relief Fund - Funds Transparency Map In keeping with Governor Chris Sununu's vision for GOFERR and his belief that public trust is built on the foundations of transparency and accountability, the below map gives Granite Staters the... goferr.nh.gov", "2020-07-02T19:19:38.000Z": "Today, in following with announcements made in nearby New England states, we are removing the quarantine requirement for New England residents who travel to New Hampshire for leisurely purposes, effective immediately.", "2020-07-02T18:46:39.000Z": "Coming up at 3, I'll be holding a press conference to provide a #COVID19 update. Click below to watch live. Click to watch live at 3 PM www.wmur.com", "2020-07-02T14:54:21.000Z": "Wishing a very happy 81st birthday to the (second) best governor New Hampshire's ever had, @GovernorSununu ! Always enjoy looking back on this candid photo taken of us on the morning after the 2016 primary as my Dad offered his words of wisdom (unsolicited, I'm sure)!", "2020-07-01T20:56:17.000Z": "Coming up at 5:30, I'll be live on @WMUR9 to answer your #COVID19 questions. Tune-in! Governor answers questions about state's COVID-19 response Gov. Chris Sununu answered viewer questions about the state's response to the coronavirus crisis during a segment Wednesday on News 9 at 5:30 on WMUR. wmur.com", "2020-07-01T16:00:19.000Z": "The #USMCA goes into effect today, increasing access to the markets of Granite State businesses' top trading partners and creating new economic opportunity. This is a win for New Hampshire!", "2020-07-01T01:10:07.000Z": "Thanks to @SecAzar , @GovMikeDeWine , @GovChrisSununu & other leaders for joining our roundtable today on strengthening our child welfare system. We must confront the challenges & impacts for the vulnerable children in the foster care system & protect the well-being of all youth.", "2020-07-01T14:07:16.000Z": "Spotted at the State Emergency Operations Center yesterday. THANK YOU Perry Plummer for your tireless, nonstop service to the people of our state. New Hampshire could not have had a better public servant. #603Pride", "2020-06-30T19:30:25.000Z": "Over the coming months, I will continue to advocate Congress for another funding appropriation. As it is written, we cannot using existing #CARESAct funds to backfill revenue shortfalls.\n\nI implore Congress - do your job, get to work, and provide more relief for states. (4/5)", "2020-06-30T19:30:24.000Z": "I've instructed Commissioners to take action to help limit the financial shortfall - halting discretionary spending, taking a pause on upcoming capital projects. I have told them to tighten their belts until we can at least see what additional federal funding may come in. (3/5)", "2020-06-30T19:30:23.000Z": "NH will not be covering our losses by raising taxes or kicking the can down the road, saddling future generations with liabilities. The last thing we should do in the middle of a pandemic is raise taxes on our citizens & businesses when they are struggling to make ends meet (2/5)", "2020-06-30T19:30:22.000Z": "THREAD: Due to #COVID19 , our revenues as a state are far lower than projected in the last budget. We face a significant revenue shortfall - to the tune of $538 million.\n\nWe will need to make up for this shortfall, and it will require tough decisions.", "2020-06-30T19:20:08.000Z": "We continue to monitor the financial conditions of NH's 26 hospitals, and today we're announcing grants from the Emergency Healthcare System Relief Fund to eight additional hospitals.", "2020-06-30T19:18:58.000Z": "THREAD: When we announced the long-term care funding, we also announced additional funding for the Emergency Healthcare System Relief Fund. Today we're announcing that 134 organizations will be receiving grants totaling approximately $8.8 million.", "2020-06-30T19:17:41.000Z": "Today we're announcing the first 68 long-term care facilities that are being awarded nearly $10.8 million in grants to assist with financial challenges that have arisen due to #COVID19 . Organizations receiving grants will be notified within the next few days.", "2020-06-30T19:09:30.000Z": "Effective July 15, the moratorium on utility shut-offs will sunset. Those unable to pay their utility bills can call 2-1-1 or visit http:// CAPNH.org to apply for assistance to help with utility payments. This program will also help pay past due utilities.", "2020-06-30T19:06:37.000Z": "THREAD: As announced earlier this month, the moratorium on evictions and foreclosures ends tomorrow, July 1. To assist those who have struggled to pay rent, we have authorized $35M from #CARESAct funding. Call 2-1-1 or visit http:// CAPNH.org to learn how to apply.", "2020-06-30T18:22:44.000Z": "I'm holding a press conference today at 3 PM to provide a #COVID19 update. Hope you'll tune-in. Click to watch live at 3 PM www.wmur.com", "2020-06-29T20:39:08.000Z": "Senate Democrats chose to spend time today moving forward with their partisan agenda while simultaneously killing important, bipartisan legislation like student debt relief and pregnancy protections in the workplace. (1/2) Quote Tweet Kevin Landrigan @KlandriganUL Senate Democrats vote as a block to deny @SenJeb bid to revive pregnancy protection bill @GovChrisSununu championed. Dems said it violated agreement today that only bipartisan floor amendments would go thru. #nhpolitics", "2020-06-29T20:28:30.000Z": "This bill will close a critical loophole and protect students from sexual assault at the hands of those in a position of authority over the victim.", "2020-06-29T20:28:29.000Z": "Earlier this month I called on the Senate to quit playing politics and get this bill done. Ensuring there is proper justice for victims of sexual assault is paramount. (1/2) Quote Tweet Ethan DeWitt @edewittNH Just now: In a 23-1 vote, the Senate has passed a resuscitated version of the \"Howie Leung loophole bill,\" which would criminalize sexual relations between 16-17 year olds and superiors. \n\nThe bill has had a twisting path, but Ds and Rs came behind Bradley amendment. #nhpolitics Show this thread", "2020-06-29T13:59:09.000Z": "The #NHARNG is hiring, providing qualified individuals with the opportunity to live in New Hampshire, learn at one of our local colleges and universities while earning a 100% tuition waiver, and serve the Granite State. For more information, visit Army National Guard Hiring Days Start your path to service with the New Hampshire Army National Guard. We are seeking highly qualified, highly motivated individuals looking to become apart of something greater than themselves. nharmyguardrecruiting.com", "2020-06-27T18:13:51.000Z": "\"Play ball!\" Governor Sununu and Mayor Becksted threw out the ceremonial first pitches to officially open Little League season in Portsmouth. Play ball! Gov. Sununu throws first pitch of Little League season PORTSMOUTH - Governor Chris Sununu shouted the words every kid, young and old, at the Plains ballpark wanted to hear Saturday morning - \"Play ball!\"The governor and Portsmouth Mayor Rick Becksted... seacoastonline.com", "2020-06-27T13:02:44.000Z": "Let's play ball! Fun time kicking off the Portsmouth Little League season this morning! Thanks to Mayor Beckstead for the invite, it was a great, socially-distanced event!", "2020-06-26T15:00:12.000Z": "Go get a #COVID19 test. \n\nSign up for a test here: https:// business.nh.gov/DOS_COVID19Tes ting/ ", "2020-06-26T13:26:59.000Z": "Thanks for all you do, Spc. Stella! #603Pride Quote Tweet NHNG @NHNationalGuard Dispensing Reassurance\n\nSpc. Madalyn Stella, part of a COVID-19 testing team, found her calling as a combat medic in the NHARNG.", "2020-06-26T01:25:48.000Z": "Officially 16 years-old today... man does time fly. Of course cake and ice cream wouldn't be complete without the birthday card from @GovChrisSununu !", "2020-06-26T00:09:04.000Z": "START YOUR ENGINES @NASCAR is BACK at the @NHMS this August for the Foxwoods Resort Casino 301! Fans will be allowed at rescheduled NASCAR Cup Series race at NHMS Fans will be allowed to attend the rescheduled NASCAR Cup Series race in August at New Hampshire Motor Speedway under an action plan approved by the governor. wmur.com", "2020-06-25T20:37:01.000Z": "I'll be live on @WMUR9 tonight at 5:30 answering your #COVID19 questions. Gov. Sununu answers questions about state's COVID-19 response Gov. Chris Sununu joined News 9 at 5:30 on Thursday to answer questions from viewers about the state's response to the coronavirus pandemic. wmur.com", "2020-06-25T19:20:08.000Z": "THREAD: On May 15th I announced $25 million in #CARESAct Funds for our early childhood care and education system. On Monday, DHHS will notify 590 child care programs of their awards - totaling $15 million for family childcare, after school and recreation programs, & summer camps.", "2020-06-25T19:18:02.000Z": "Today we're also announcing $1.5 million in #CARESAct commitments to @VolunteerNH , which has done amazing work to connect Granite Staters seeking to help those in need. \n\nNH's commitment to service runs deeps, and we're proud to further strengthen that commitment today.", "2020-06-25T19:16:22.000Z": "Eligible self-employed businesses will be able to start applying on July 6th. The application period will end on July 17th. (8/8)", "2020-06-25T19:16:21.000Z": "Individual award amounts will be calculated similar to the Main Street Relief Fund, with the maximum award amount a business can receive being $50,000. (4/8)", "2020-06-25T19:16:20.000Z": "THREAD: Today we're announcing SELF - the New Hampshire Self Employed Livelihood Fund - which builds off the success of the Main Street Relief Fund to support self-employed Granite Staters.", "2020-06-25T19:11:58.000Z": "As of today, over $322 million in checks have gone out the door to over 5,000 small businesses across the Granite State as part of our Main Street Relief Fund, helping New Hampshire small businesses pay their bills.", "2020-06-25T19:10:31.000Z": "While hotels in NH have been open for over three weeks, with smaller facilities able to open at 100% occupancy, larger hotels, inns, and campgrounds will be able to operate at 100% occupancy beginning on Monday, June 29. Click to view COVID guidance documents www.covidguidance.nh.gov", "2020-06-25T19:07:17.000Z": ". @GovChrisSununu begins briefing by saying for the first time since pandemic restrictions began, more people came off unemployment assistance than signed up #COVID19  #WMUR", "2020-06-25T18:03:31.000Z": "BREAKING: The state of NH has worked with @NHMS to allow for fans at the #Foxwoods301  @NASCAR race on August 2nd. \n\nThe speedway can operate at UP TO 35% capacity in the grandstands to allow for proper social distancing. \n\nLearn more: https:// nhms.com/media/news/new -hampshire-motor-speedway-host-fans-for-aug-foxwoods-resort-casino-301.html ", "2020-06-25T16:32:07.000Z": "I'm holding a press conference today at 3 PM to provide a #COVID19 update. Hope you'll tune-in! Click to watch live at 3 PM www.wmur.com", "2020-06-25T00:09:03.000Z": "New Hampshire, let's help Nolan find his #ForeverFamily !\n\nFor the first time in recent memory, more kids are leaving our foster care system than entering it, but there's more work to do.\n\nLearn more: https:// dhhs.nh.gov/dcyf/adoption", "2020-06-24T19:42:59.000Z": "The @NHNationalGuard goes above and beyond to help Granite Staters every single day. #603Pride Quote Tweet Amy Coveno @amyWMUR PVT  first class LaValley out of 237th MP unit shields this woman from heavy rain in Nashua DMV while assisting the state distribution of PPE.", "2020-06-24T15:45:59.000Z": "As if 2020 hasn't dealt enough surprises already, make sure to watch out for and avoid Lion's Mane Jellyfish that have been spotted at Jenness Beach in Rye. Watch Out for Lion's Mane Jellyfish on Jenness Beach in Rye, NH Yikes! And we thought sharks were the problem. wokq.com", "2020-06-24T14:15:36.000Z": "As the Executive Council meeting gets underway, Councilors accept the resignation of Associate Commissioner of DHHS Christine Tappan. @GovChrisSununu lauds her work, saying she was \"hugely instrumental in turning around the crisis at DCYF\" #nhpolitics  #WMUR", "2020-06-24T00:08:16.000Z": "Today I announced $18 million in new funding to support programs that benefit New Hampshire's youth, mental health and substance use disorder treatment, and veterans programs. No area has been untouched by #COVID19 , and these funds are a proactive step to provide needed resouces.", "2020-06-23T20:16:46.000Z": "Thank you @GovChrisSununu for prioritizing youth through after school programming and for recognizing the importance of social/emotional health during this crisis. #greatfutures Quote Tweet Chris Sununu @GovChrisSununu We are also committing $2 million to community organizations like the @BGCA_Clubs , @girls_inc , and the Police Athletic League.\n\nThese programs provide services for kids while parents are at work and a safe place for kids to socialize and spend their time. (4/4) Show this thread", "2020-06-23T19:21:55.000Z": "Today I'm also allocating $7 million to help Veterans across NH in three areas: Ensuring the homeless can find housing Veterans Service Programs to provide direct services to our veterans, like financial assistance and local organization support Mental Health Supports", "2020-06-23T19:20:48.000Z": "Using the funding announced today, DHHS will work with my office to develop a plan and program that will be released in the coming days and weeks. This program will ensure we don't lose ground on the important progress we have made in addressing SUD in the Granite State. (3/3)", "2020-06-23T19:20:47.000Z": "THREAD: Today, we are committing at least $6 million to ensure that Granite Staters continue to have access to critical Substance Use Disorder (SUD) services.", "2020-06-23T19:18:53.000Z": "I am also committing $1 million to provide additional support for the New Hampshire Internet Crimes Against Children Taskforce to ensure our kids are not exploited as they spend more time online due to #COVID19 . (3/4)", "2020-06-23T19:18:52.000Z": "THREAD: Based on recommendations from the Governor's Youth Advisory Council on Substance Misuse and Prevention, which I established in my first term, I am authorizing $2 million to be used to benefit youth across New Hampshire.", "2020-06-23T19:13:18.000Z": "Today, we're announcing three new areas of allocation from our #CARESAct funding, including: Kids Mental Health and Substance Use Disorder Veterans\n\nNo area has been left untouched by #COVID19 , and these funds ensure we remain proactive in providing services.", "2020-06-19T14:25:18.000Z": "The Application Period for eligible Nonprofits to apply to the New Hampshire Nonprofit Emergency Relief Fund closes on June 25th. If you have any questions, make sure to register for one of the two Q&A's next week by clicking here: https:// register.gotowebinar.com/#rt/8962444041 419237902?utm_content=buffer72dfe&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer ", "2020-06-23T19:06:25.000Z": "THREAD: On April 14th, we announced the Long Term Care Stabilization program. Originally, the program was set to end on June 31. \n\nToday, we're extending the program through July 31 to ensure we have the workforce needed to care for our loved ones.", "2020-06-23T17:03:13.000Z": "Coming up at 3 PM, I'll be holding a press conference to provide a #COVID19 update. Click below to watch live. Click to watch live at 3 PM www.wmur.com", "2020-06-23T14:47:06.000Z": "#COVID19 testing is quick, easy, and convenient. Schedule your test today! http:// ow.ly/cVlX50Afwcl", "2020-06-22T20:39:34.000Z": "6/22/2020: Attention Coos County Flash Flood Warning until 7:45 PM. Heavy rain in the area. Move to higher ground. Turn around, don't drown. #ReadyNH  #NHwx  #BePrepared  #BeSafe Quote Tweet NWS Gray @NWSGray Flash Flood Warning including Coos County, NH until 7:45 PM EDT", "2020-06-21T22:35:31.000Z": "On the one year anniversary of the tragic crash in Randolph, we pause to pay our respects and remember the Fallen Seven, whose lives were taken all too soon. We will never forget. 'Band of brothers' died in horrific crash one year ago THEY WERE Marines and the women who loved them. This \"band of brothers,\" who had come to the White Mountains for a weekend of fellowship and fraternity, had served their unionleader.com", "2020-06-21T18:48:03.000Z": "6/21/2020: Attention Southern Coos County Severe Thunderstorm Warning until 3:30pm. Strong winds and hail is expected. Move indoors. #BePrepared  #BeSafe  #ReadyNH  #NHwx Quote Tweet NWS Gray @NWSGray Severe Thunderstorm Warning including Berlin NH, Gorham NH, Randolph NH until 3:30 PM EDT", "2020-06-21T17:31:40.000Z": "232 years ago today, New Hampshire became the 9th state to join the Union. Happy Birthday to the Granite State! Couldn't be more proud to call it home. #603Pride", "2020-06-21T14:52:55.000Z": "Happy #FathersDay Dad! @GovernorSununu - I found this oldie but goodie of us in 1989. \n\nWow, mom was right. We WERE incredibly handsome!", "2020-06-20T12:47:07.000Z": "Dom, a first grade student, wrote to me suggesting there should be a Kid's Day to recognize the bravery and resiliency that kids have shown as we navigated remote learning and #COVID19 . Great idea, Dom! \n\nHappy to proclaim today, the first day of summer, as Kid's Day! #603Pride", "2020-06-19T14:11:12.000Z": "Effective immediately, capacity at places of worship has been bumped up to 50% capacity. Click below to view the update guidance. https:// covidguidance.nh.gov/sites/g/files/ ehbemt381/files/inline-documents/2020-05/guidance-worship.pdf ", "2020-06-19T13:13:17.000Z": "In 2018 I declared #JuneteenthDay for the first time in NH history, and last year, I signed a law proclaiming annual observance of Juneteenth, which celebrates the abolition of slavery along with African American freedom and achievement. Proud to do so again this year! #603Pride", "2020-06-18T19:15:29.000Z": "Performing arts venues may open on June 29 in accordance with new guidance. Click to view guidance www.covidguidance.nh.gov", "2020-06-18T19:13:56.000Z": "Arts and music education may resume on June 29 in accordance with new guidance. Click to view our guidance www.covidguidance.nh.gov", "2020-06-18T19:12:38.000Z": "Adult day services may resume on June 29 in accordance with new guidance. Click to view guidance www.covidguidance.nh.gov", "2020-06-18T19:11:32.000Z": "Movie theaters may open on June 29 in accordance with new guidance. Click to view guidance www.covidguidance.nh.gov", "2020-06-18T19:10:30.000Z": "Amusement parks may open on June 29 in accordance with new guidance. Click to view guidance www.covidguidance.nh.gov", "2020-06-18T19:06:54.000Z": ". @GovChrisSununu says he received the results of his #COVID19 PCR test & it came back negative. Encourages all Granite Staters to do the same #WMUR", "2020-06-18T19:07:54.000Z": "Although I had no symptoms, two weeks ago I took a test to see if I was an asymptomatic carrier of #COVID19 . My test was negative.\n\nWe encourage anyone- whether you have a symptom or not, have been in a crowd over the past week or just left your house for groceries- to get a test Click to request a COVID-19 test business.nh.gov", "2020-06-18T19:05:13.000Z": "THREAD: This morning, emails went out to all who submitted the Main Street Relief Fund final grant submission, letting them know whether their submission was approved or denied. For those approved, the first round of checks should be going out later today.", "2020-06-18T16:55:20.000Z": "I'm holding a press conference today at 3 PM to provide a #COVID19 update. Click below to watch live. Click to watch live at 3 PM www.wmur.com", "2020-06-17T23:33:45.000Z": "Today I signed Emergency Order #53 to ensure that @NHNationalGuard members who have been called into active service are eligible for expanded worker's compensation coverage. These men and women have been there every step of the way during #COVID19 , and we can't thank them enough.", "2020-06-17T21:00:22.000Z": "I'll be live on @WMUR9 at 5:30 to answer your #COVID19 questions. Hope you'll tune-in! Governor answers viewer questions about COVID-19 response Gov. Chris Sununu will answer viewer questions about the state's response to the coronavirus crisis during a segment Wednesday on News 9 at 5:30. wmur.com", "2020-06-17T20:05:24.000Z": "Happy Wednesday, everyone.  Quick reminder, the Governor answers viewer questions during our 5:30pm news tonight - you can submit yours in the WMUR link below - take care! Quote Tweet WMUR TV @WMUR9 Live on News 9 at 5:30: Governor to answer viewer questions about COVID-19 response https:// wmur.com/article/q-and- a-new-hampshire-governor-coronavirus-june-17-2020/32892449 ", "2020-06-17T17:19:09.000Z": "While this is something we can all be proud of, we know we have more work to do. (7/7)", "2020-06-17T17:19:08.000Z": "The number of children adopted during each state fiscal year has increased every year since FY16. (6/7)", "2020-06-17T17:19:07.000Z": "The number of Licensed Foster Homes has increased from roughly 600 in January of 2017 to roughly 900 in January 2020. (5/7)", "2020-06-17T17:19:06.000Z": "The amount of overdue open assessments reached a peak of 3,500 in November 2015 and are now down to 747. The current overdue assessments are less than half of what they have been in any other month since at least 2013. (3/7)", "2020-06-17T17:19:05.000Z": "THREAD: When I took office in 2017, New Hampshire's DCYF was in crisis with unacceptable results for our kids. We made children a top priority, created a new set of standards, made the right investments, and have exceeded expectations with our outcomes.", "2020-06-16T23:18:18.000Z": "Today I announced a new commission which will make actionable recommendations within the next 45 days to enhance transparency, accountability, and community relations in law enforcement.\n\nOur goal is simple: a new dynamic to benefit both our communities and law enforcement.", "2020-06-16T19:38:57.000Z": "", "2020-06-16T19:24:03.000Z": "Earlier today I signed an Executive Order establishing the Commission on Law Enforcement Accountability, Community, and Transparency. We're facing a pivotal moment for our country and our state that requires we act now. Read more: Governor Chris Sununu Establishes Commission on Law Enforcement Accountability, Community, and... Concord, NH - Today, Governor Chris Sununu signed Executive order 2020-11, an order establishing the New Hampshire Commission on Law Enforcement Accountability, Community, and Transparency. governor.nh.gov", "2020-06-16T18:50:07.000Z": "Listen live to NHPR and streaming on http:// NHPR.org at 3 pm when @GovChrisSununu gives an update on NH's response to COVID-19. Coronavirus Update: Sununu Announces $19M to University System of N.H. for Student Safety NHPR is continuing to cover the developing story around coronavirus in New Hampshire. Bookmark this page for the latest updates, including case numbers and nhpr.org", "2020-06-16T18:50:09.000Z": "Sununu creates commission to examine police transparency, accountability Sununu creates commission to examine police transparency, accountability Gov. Chris Sununu established a commission Tuesday to issue recommendations on improving transparency and accountability in law enforcement in New Hampshire. wmur.com", "2020-06-16T18:30:49.000Z": "Breaking: @GovChrisSununu is establishing a state Commission on Law Enforcement Accountability, Community and Transparency. Commission will have 45 days to submit a report w/ recommendations. @seacoastonline  #NHpolitics", "2020-06-16T18:07:57.000Z": "I'm holding a press conference at 3 PM to provide a #COVID19 update. Click below to watch live at 3 PM. Click to watch live at 3 PM www.wmur.com", "2020-06-16T15:38:42.000Z": "$30 million for COVID-19 related relief is available for NH Long Term Care providers who apply by June 19, 2020 -More Details: https:// goferr.nh.gov/covid-expendit ures/healthcare-system-relief-fund ", "2020-06-14T13:53:05.000Z": "On #FlagDay we honor the great freedoms our Flag represents and those who have made the ultimate sacrifice to protect them.", "2020-06-12T19:58:28.000Z": "CALLING ALL SMALL BUSINESS APPLYING TO THE MAIN STREET RELIEF FUND:\n\nThe DRA Call Center Hours have been extended until 11:59PM today to provide businesses with the most comprehensive assistance possible. For more information click here: https:// us4.campaign-archive.com/?u=7b673e17afc 2fc81feb2943fd&id=a4cff195d7 ", "2020-06-11T21:45:04.000Z": "With the stay-at-home order expiring on Monday, several sectors of society will open with some restrictions, including gyms, pools and bowling alleys. Find more information on sectors reopening: https:// bit.ly/37mKLcF", "2020-06-11T22:18:21.000Z": "All business sectors in N.H. will be re-opened under new guidance by June 29th. @GovChrisSununu says the state is heading into a \"new normal\" for Summer months as #COVID19 hospitalizations & rate of positive tests remain low; next \"inflection point\" will be back-to-school #WMUR", "2020-06-11T23:29:06.000Z": "Employment official Richard Lavers answers viewer questions Employment official Richard Lavers answers viewer questions Employment official Richard Lavers joined News 9 live at 5:30 on Thursday. wmur.com", "2020-06-11T15:29:59.000Z": "Got tested for COVID-19 on Tuesday as part of the Asymptomatic Spread Assessment Program and less than 24 hours later got a phone call confirming I am COVID-negative. Every NH resident should take advantage of this -- couldn't have been easier and gave me great peace of mind!", "2020-06-11T22:20:03.000Z": "Thank you for helping make New Hampshire GREAT, Pallavi! Quote Tweet nehavipin @neha4vipin Thank you @GovChrisSununu for making Pallavi's birthday wonderful!", "2020-06-11T20:05:40.000Z": "More details on the New Hampshire Housing Relief Program, announced by @GovChrisSununu today, can be found here: https:// goferr.nh.gov/covid-expendit ures/new-hampshire-housing-relief-program ", "2020-06-11T19:33:11.000Z": "Amusement parks may open on June 29, in accordance with strengthened guidance that will be released next week, and in line with capacity limitations.", "2020-06-11T19:32:46.000Z": "Performing arts centers may open on June 29, in accordance with strengthened guidance that will be released next week, and in line with capacity limitations.", "2020-06-11T19:32:19.000Z": "Indoor movie theaters may open on June 29, in accordance with strengthened guidance that will be released next week, and in line with capacity limitations.", "2020-06-11T19:31:24.000Z": "Funeral homes may open on June 15 under new guidance. Click to view guidance www.covidguidance.nh.gov", "2020-06-11T19:30:07.000Z": "Libraries may open on June 15 under new guidance. Click to view guidance www.covidguidance.nh.gov", "2020-06-11T19:28:56.000Z": "Charitable gaming facilities may open on June 15 under new guidance. Click to view guidance www.covidguidance.nh.gov", "2020-06-11T19:25:37.000Z": "Most race tracks will be able to reopen at 50% capacity with 6 feet between parties, but we are still working on a viable plan to allow for the @NHMS in Loudon to resume spectator-based races. We intend to work with all stakeholders in the coming weeks.", "2020-06-11T19:25:09.000Z": "THREAD: On June 15, tourist trains, organized motorcycle rides, and race tracks will be able to reopen as part of newly revamped outdoor attractions guidance. Click to view guidance www.covidguidance.nh.gov", "2020-06-11T19:23:28.000Z": "Bowling alleys will be able reopen on June 15th with strengthened guidance. Click to view guidance www.covidguidance.nh.gov", "2020-06-11T19:22:17.000Z": "On June 15, amateur sports can move into Phase Two - which will include the reopening of indoor athletic facilities. Click to view guidance www.covidguidance.nh.gov", "2020-06-11T19:21:08.000Z": "BREAKING: Our Stay at Home 2.0 Order will expire at 11:59 PM on Monday, June 15. \n\nWe will also remove the cap on scheduled gatherings of 10 or less.", "2020-06-11T19:20:20.000Z": "On June 15, gyms will be able to open at 50% capacity to normal activities under strengthened guidance. Click to view guidance www.covidguidance.nh.gov", "2020-06-11T19:17:08.000Z": ". @GovChrisSununu announces how more of #NH 's share of Cares Act will be spent...\n\n-$50M to broadband initiative \n-$35M for people facing housing insecurities\n-$15M to homeless shelters\n-$10M for private colleges/universities\n-$2M to chambers of commerce #WMUR", "2020-06-11T19:13:25.000Z": ". @GovChrisSununu announces $50M broadbands initiative to try to get \"the last mile\" of high speed internet into rural N.H. via @AdamSextonWMUR", "2020-06-11T19:15:32.000Z": "Using #CARESAct funding, we're announcing: $15 million in aid to homeless shelters $2 million for area Chambers of Commerce to assist businesses as they reopen $10 million to private colleges and universities in the State of New Hampshire", "2020-06-11T19:12:33.000Z": "The State will solicit bids from telecom providers and will award grants starting with the lowest public cost per household. It's imperative we move quickly, and this program will use the power of the private market to make the connections folks need. (2/2)", "2020-06-11T19:12:32.000Z": "THREAD: To better provide Granite Staters equitable access to broadband services and to address the needs of our citizens during the #COVID19 pandemic, the State is engaging in a private/public partnership to fund the build-out of broadband services to our most in need citizens.", "2020-06-11T19:09:33.000Z": ". @GovChrisSununu announces $35M Housing Relief Fund to help homeowners & renters in need. Moratorium on foreclosures & evictions will be lifted July 1st. #WMUR", "2020-06-11T19:10:18.000Z": "In crafting this order and corresponding assistance, we have consulted with State Government housing experts, housing advocacy groups, and the Court System. (5/5)", "2020-06-11T19:10:17.000Z": "This program has two components: One-time grants for households that suffered a limited short-term loss of household income or increased expenses that threaten the family's ability to maintain its housing Short-term rental assistance program\n\n(2/5)", "2020-06-11T19:10:16.000Z": "THREAD: Today we're authorizing $35 million in #CARESAct funding to assist families and individuals facing housing insecurity as a result of #COVID19 .", "2020-06-11T19:07:25.000Z": "Main Street Relief Fund applications must be filled out by TOMORROW, June 12.\n\nBusiness that filled out a pre-qualification application are now eligible to fill out a final grant submission. If you don't complete the submission, the process will not proceed. Click to complete your submission https://t.co/U4HSoSG0fo", "2020-06-11T16:35:38.000Z": "Holding a press conference today at 3 PM to provide a #COVID19 update. Click below to watch live. Click to watch live at 3 PM www.wmur.com", "2020-06-10T22:11:14.000Z": "Ryan Terrell stepped up to serve our state and the Executive Council rejected his nomination to serve on the NH Board of Education. Now, more than ever, we must celebrate and empower individuals from different backgrounds with different perspectives to serve in NH government.", "2020-06-10T21:15:11.000Z": "I'm joining @WMUR9 tonight at 5:30 to answer your #COVID19 questions. Hope you'll tune-in! Gov. Sununu answers viewer questions about COVID-19 response Gov. Chris Sununu answered questions about the state's coronavirus response efforts live during a segment Wednesday on News 9 at 5:30. wmur.com", "2020-06-10T17:35:11.000Z": "There's still time to contribute in support of New Hampshire nonprofits! Visit http:// nhgives.org today. #TogetherWeGive Quote Tweet NH Gives @nhgives Thank you @GovChrisSununu for helping spread the word about #NHGives . Visit https:// nhgives.org tomorrow, June 9 starting at 6pm to support one of nearly 500 participating nonprofits! #TogetherWeGive", "2020-06-10T15:51:08.000Z": "Today marks 100 days since the first confirmed case of #COVID19 was diagnosed in New Hampshire.\n\nWe've been in it together. We're coming out of it together. We're going to stick together. \n\nThank you, New Hampshire!", "2020-06-10T14:25:38.000Z": "I cannot thank Perry Plummer enough for his years of service to our state. From leading @NH_HSEM to taking a lead role in responding to COVID19, Perry has been at my side since my first day in office and New Hampshire could not have had a better public servant. #603Pride Quote Tweet Adam Sexton @AdamSextonWMUR Executive Council meeting: Asst. Commissioner of Safety Perry Plummer has tendered his resignation. Plummer has played a key role in securing PPE for NH during the #COVID19 pandemic. Resignation accepted with much regret from Council. #WMUR", "2020-06-10T14:16:06.000Z": "Throughout this crisis, we've done our best to keep you up-to-date and informed.\n\nIn the past 100 days I've made over 300 media appearances - whether it's on radio, our daily press conferences, national media, or interviews - all with the intention of keeping you in-the-know.", "2020-06-10T14:16:05.000Z": "From campgrounds to child care, restaurants to retail, and beaches to weddings, we're reopening our economy. Our decisions have all been based on data and have been made in consultation with public health experts. Stay up to date with our guidance here: Welcome An official New Hampshire Government web site. covidguidance.nh.gov", "2020-06-10T14:16:04.000Z": "The data we've seen in recent weeks is encouraging. We're seeing a downward trend in the percent of positive #COVID19 tests and plenty of hospital beds remain available. Thanks to the steps we've taken, and the responsibility of Granite Staters, we're on the right path.", "2020-06-10T14:16:03.000Z": "The requests have come in from far and wide, and I've mailed over FIVE THOUSAND birthday cards.\n\nThe reaction has been incredible. Seeing the photos and videos you've sent of kids receiving their cards has put a smile on all of our faces.\n\nRequest here: https:// new-hampshire.secure.force.com/support/GOV_Re quest_A_Birthday ", "2020-06-10T14:16:02.000Z": "Nothing about this crisis has been easy, but Granite Staters have found ways to adapt and have some fun along the way.\n\nHundreds of Granite Staters have participated in the #HomeHikeChallenge and found hidden gems right in their own backyard. Granite Staters encouraged to safely enjoy outdoors as part of 'Home Hike Challenge' Despite a stay-at-home order in New Hampshire, residents are allowed to head outside for exercise. But they're urged to pick less popular trails and hike local. wmur.com", "2020-06-10T14:16:01.000Z": "In late March, we mobilized several volunteer efforts and since, Granite Staters have stepped up to the challenge. Over $5.36 MILLION raised through @graniteuwnh and @nhcfoundation  Over 1,700 Granite Staters have signed up to volunteer\n\nTHANK YOU, NEW HAMPSHIRE! #603Pride", "2020-06-10T14:16:00.000Z": "There's no doubt about it: combating #COVID19 has been an ordeal that's taken its toll on us all. But throughout this public health crisis, we've seen the very best of Granite Staters. Our communities have rallied together to ensure that our neighbors have the support they need.", "2020-06-10T14:15:59.000Z": "To date, 88,647 Granite Staters have been tested for #COVID19 , with 5,132 confirmed cases in the State. Thankfully, 3,501 individuals have recovered.\n\nOur deepest condolences and prayers are with the family and friends of the 286 Granite Staters that we have lost to COVID-19.", "2020-06-10T14:15:58.000Z": "New Hampshire residents can also go online to request an antibody test at a number of locations across New Hampshire. Sununu Announces 9 Antibody Testing Locations in NH, Guidance for Dentists New Hampshire Gov. Chris Sununu announced Friday that in recent days, the state has greatly increased the COVID-19 testing capacity in the state and antibody testing will be available at nine... nbcboston.com", "2020-06-10T14:14:42.000Z": "To ensure that testing is not only available, but accessible to all Granite Staters, I ordered insurance companies to cover the costs of testing for #COVID19 . N.H. orders insurance companies to cover Covid testing Health insurers in New Hampshire must cover the costs of testing for Covid -19 and help inform the public by making sure they have accurate information about the outbreak online and that \"nurse help... concordmonitor.com", "2020-06-10T14:14:41.000Z": "It's also thanks to our PPE procurement that we've been able to expand testing availability. All Granite Staters - regardless of whether or not they have symptoms - can now request a #COVID19 test. State creates come-one, come-all COVID-19 test plan CONCORD - The state of New Hampshire is now encouraging everyone in the state to be tested for COVID-19. unionleader.com", "2020-06-10T14:14:40.000Z": "It's thanks to our team's ability to procure PPE that we were able to make face coverings available to New Hampshire businesses and get a jump start on safely reopening many sectors of our economy. State Of New Hampshire Gives Free PPE To Businesses For Reopening Businesses getting prepared to reopen next week received free personal protective equipment from the state across New Hampshire Friday. patch.com", "2020-06-10T14:14:39.000Z": "Back on Easter Sunday, the first plane carrying 91,000 pounds of PPE landed at @flymanchester . Our team has become experts at procuring PPE from across the globe in the months since. Plane brings 91,000 pounds of PPE to NH A cargo plane from Shanghai, China, carrying the PPE landed Sunday afternoon at Manchester-Boston Regional Airport. wmur.com", "2020-06-10T14:14:36.000Z": "It's also why we established 14 flex facilities across the state. We're extremely fortunate that we've never had to turn the lights on at these facilities and that many have been able to now close. Sununu: 14 'flex facilities' set up, ready CONCORD - With the addition of 14 clinical surge flex facilities set up across the state, New Hampshire now has a total bed capacity of more than 5,000. The 14 facilities will remain dark until they... nashuatelegraph.com", "2020-06-10T14:14:35.000Z": "Ensuring that Granite Staters are able to access quality health care has been paramount. That's why I created an initial $50 million fund - now up to $100 million - to ensure that no hospital in the Granite State is forced to close its doors. Governor announces $50M fund to help hospitals CONCORD - Gov. Chris Sununu announced Thursday that a $50 million fund is being set up to support hospitals as they gear up for a potential surge in patients associated laconiadailysun.com", "2020-06-10T14:14:34.000Z": "We've taken swift action to address the many ways #COVID19 has impacted society. That's why we've used emergency funding to bolster services provided through the @NHCADSV and strengthen support services to help protect New Hampshire's vulnerable children. Sununu announces new funding for victims of domestic violence, child abuse Gov. Chris Sununu announced Wednesday $600,000 for the state's 13 crisis centers providing critical emergency services to victims of domestic violence and an additional $2 million in new funding to... concordmonitor.com", "2020-06-10T14:14:33.000Z": "Businesses MUST complete their final grant submission by Friday, June 12 in order to receive funds. Complete yours here: https:// gtc.revenue.nh.gov/tap/main-stree t-relief-fund/_/ ", "2020-06-10T14:14:32.000Z": "Just weeks ago, we announced over $400 million will be distributed to eligible businesses across the state through the Main Street Relief Fund. State works to provide relief to 'Main Street' with grants The state will dish out $400 million from the CARES Act to small businesses through the Main Street Relief Fund. unionleader.com", "2020-06-10T14:14:31.000Z": "We moved quickly to provide assistance to businesses across the Granite State. NH was one of the earliest states in the country to be granted a @SBAgov disaster declaration - a necessary first step to getting relief funds out the door. NH 16224 - SBA Economic Injury Disaster Loans Available in Vermont Following Secretary of Agricul... ATLANTA - The U.S. Small Business Administration announced today that Economic Injury Disaster Loans are available to small businesses, small agricult... sba.gov", "2020-06-10T14:14:30.000Z": "In other states, scammers have ravished unemployment systems. Thanks to the hard work of our team at @NHESWorking , the integrity and security of our system has been maintained. Scammers employ ID theft, unreported income to rob unemployment As people filed for unemployment to replace paychecks stolen by the coronavirus pandemic, criminals went after their cut, too. unionleader.com", "2020-06-10T14:14:29.000Z": "Since March 24, over $649 million has gone out the door in unemployment benefits. Our team at @NHESWorking has worked around the clock to process the unprecedented number of claims filed. NH unemployment paid since March 24 tops sum of last 8 years CONCORD, N.H. (AP) - Members of the state's economic reopening task force got an unemployment update, and Democratic lawmakers want to direct federal aid to vulnerable populations.UnemploymentMore... seacoastonline.com", "2020-06-10T14:14:28.000Z": "From the beginning, we've understood the impact that #COVID19 has had on the bottom lines of New Hampshire families, which is why we took immediate action to expand unemployment benefits. NH starts immediate unemployment benefits due to coronavirus CONCORD - New Hampshire residents unable to work or those facing reduced hours due to the coronavirus pandemic will have access to immediate unemployment benefits, as well as temporary protection... fosters.com", "2020-06-10T14:14:27.000Z": "On May 18, restaurants began outdoor dining - and they did so the NH way, taking innovative approaches to make the most of a tough situation.\n\n\"I think Gov. Sununu is doing things right, gradually opening things up. This makes me so happy.\" 'Good times with good friends' return as restaurants offer outdoor dining Sitting on a couch in the late day sun, surrounded by friends, Cindy Gravell took a sip from her cocktail and smiled. unionleader.com", "2020-06-10T14:14:26.000Z": "Transitioning restaurants to takeout, delivery, and drive-thru was a tough call. But as the @pressroomnh noted, \"the sooner we all make these difficult decisions and coordinate preventive efforts, the sooner we will be on the other side of this crisis\" Gov. Sununu mandates restaurant closures as coronavirus response PORTSMOUTH - After a daylong trickle of local restaurants announcing full or partial closures, Gov. Chris Sununu issued an order late Monday afternoon \"prohibiting scheduled public gatherings over 50... fosters.com", "2020-06-10T14:14:25.000Z": "I never thought that I'd be in a position to have to make the calls I've made. Believe you me, I'm the last person who ever wanted to have to make these decisions - but they're calls that had to be made to ensure the safety of Granite Staters and #FlattenTheCurve .", "2020-06-10T14:14:24.000Z": "Thanks to the hard work of the Department of Education and @NHEdCommr , our schools set the gold standard for the rest of the country. There's few moments in life as transformational as one's education, and our teachers have continued to deliver. Area school officials agree with Pence: NH ahead of curve on remote learning Vice President Mike Pence on Monday singled out New Hampshire as a state that was \"setting the pace\" in efforts to transition students to remote learning. And he said that sentinelsource.com", "2020-06-10T14:14:23.000Z": "On March 13, I officially declared a State of Emergency and opened our Emergency Operations Center. That very same day, we began to take immediate action to limit the spread of #COVID19 in New Hampshire's nursing homes and long-term care facilities. Gov. Sununu declares state of emergency; steps include a ban on visitors at nursing homes; more NH... A ban on visitors at nursing homes and assisted living centers was one of 18 steps Gov. Chris Sununu outlined as he declared a state of emergency over the coronavirus unionleader.com", "2020-06-10T14:14:22.000Z": "THREAD: Today marks 100 days since the first case of #COVID19 in NH. Since, we've taken historic action to provide for the safety of our citizens and the well-being of New Hampshire families, and start down the road to recovery. We're getting through this together. Read more", "2020-06-10T00:45:53.000Z": "In New Hampshire, ALL ADULTS are mandated reporters - because that's what we do here. Protecting children is all of our responsibility. Know the signs of abuse - and tell responsible authorities when a child needs help. #iKNOWandTELL Quote Tweet KNOW & TELL - Child Advocacy @_iKNOWandTELL WATCH : It's what you all have been waiting for! KNOW & TELL is proud to present you this new video featuring @sethmeyers , @GovChrisSununu , @SenatorHassan and around 100 granite staters. \n\nThey all KNOW & TELL, will you? #iKNOWandTELL Show this thread", "2020-06-09T19:15:36.000Z": "The Department of Revenue Administration has sent the final submissions for Main Street Relief Fund Grants to businesses that completed a prequalification application. Businesses MUST complete their final grant submission by this Friday, June 12. Click below to complete yours: Click to complete your final grant submission https://t.co/U4HSoSG0fo", "2020-06-09T19:13:36.000Z": "This weekend I went to @riteaid in Portsmouth for a #COVID19 test. While I have no symptoms, I took the test to see if I'm an asymptomatic carrier. As part of our Asymptomatic Spread Assessment Program - ASAP - we're challenging all Granite Staters to do the same. Request yours: Click to request a COVID-19 test business.nh.gov", "2020-06-09T18:41:06.000Z": "Coming up at 3 PM, I'll be holding a press conference to provide a #COVID19 update. Hope you'll tune-in! Click to watch live at 3 PM www.wmur.com", "2020-06-09T17:38:34.000Z": "The registration period is open for the non-dairy, other agriculture portion of the NH Agriculture COVID-19 Relief Program. For more information and to register, click here: https:// goferr.nh.gov/covid-expendit ures/nh-agriculture-grants ", "2020-06-08T16:00:56.000Z": "@GovChrisSununu virtually congratulates the New Hampshire Scholars Class of 2020 graduating this month. These students not only crossed the finish line but they did so with high academic accomplishments. Watch the Governor's video message here: https:// youtu.be/TRqXlBIqo", "2020-06-08T18:48:21.000Z": "Thank you @GovChrisSununu for helping spread the word about #NHGives . Visit https:// nhgives.org tomorrow, June 9 starting at 6pm to support one of nearly 500 participating nonprofits! #TogetherWeGive", "2020-06-07T16:28:42.000Z": "Our latest challenge to NH: The Asymptomatic Spread Assessment Program (ASAP). \n\nWe're encouraging everyone to get a #COVID19 test. I have no symptoms, but it only took 10 minutes to book an appointment online and 2 minutes to take the test from my car. \n\nEasy. Painless. Done.", "2020-06-07T14:07:47.000Z": "Deeply saddened to hear this. Spc. Usanase represented the very best of the Granite State, consistently prioritizing service to her community. Throughout #COVID19 , she was on the frontlines distributing food to those in need. We mourn her loss. Our sympathies are with her family. Quote Tweet NHNG @NHNationalGuard Our Hearts Are Heavy\n\nThe New Hampshire National Guard suffered a tragic loss last week. Spc. Pamela Anne Usanase, 21, a culinary specialist with the 3643rd Brigade Support Battalion, died on the evening of May 30. http:// facebook.com/notes/new-hamp shire-national-guard/our-hearts-are-heavy/10151377914679959/ ", "2020-06-06T15:52:53.000Z": "Severe Thunderstorm Warning including Laconia NH, Wolfeboro NH, Belmont NH until 12:30 PM EDT", "2020-06-06T13:37:26.000Z": "Today, we remember the heroism and bravery of the nearly 160,000 troops who landed on the beaches of Normandy on June 6, 1944 and forever changed the course of history. We must never forget their sacrifice. #DDay", "2020-06-06T12:21:48.000Z": "Don't forget! TODAY is Free Fishing Day in New Hampshire. Anyone can fish in the Granite State today without a fishing license!", "2020-06-05T21:52:44.000Z": "THREAD: Earlier today @GovChrisSununu announced the next phase of Main Street Relief Fund. Grant amounts under the Main Street Relief Fund will be calculated utilizing the following formula. (1/6)", "2020-06-05T19:25:24.000Z": "As @GovChrisSununu just announced, the final submission period for the Main Street Relief Fund has opened. Information about this phase of the program, lead by the Department of Revenue Administration, can now be found here: https:// goferr.nh.gov/covid-expendit ures/main-street-relief-fund ", "2020-06-05T19:21:16.000Z": "Last week, we announced we would be providing guidance to allow for Day Camps to open up voluntarily on June 22nd, and Overnight Camps on June 28th.\n\nToday, we are releasing guidance for our Overnight Camps. Click below to view. Click to view guidance www.covidguidance.nh.gov", "2020-06-05T19:19:33.000Z": "Over the past few days, we have heard from those eager to celebrate their wedding day. Small ceremonies are currently permitted under our house of worship guidance, but we're taking a step today to provide additional guidance for wedding receptions starting June 15th. Click to view guidance www.covidguidance.nh.gov", "2020-06-05T19:18:01.000Z": "On June 15, restaurants in the following counties will be able to open up at 100% capacity indoors, provided all tables are more than six feet apart: Belknap Coos Carrol Cheshire Grafton Sullivan\n\nRestaurants in all other counties may open at 50% indoor capacity. Click to view guidance www.covidguidance.nh.gov", "2020-06-05T19:15:34.000Z": "Effective immediately, we are expanding the activities covered under our outdoor recreational attractions guidance to include batting cages, ropes courses, disc golf, caves, petting zoos and many other outdoor recreational activities. Click below to view our guidance. Click to view guidance www.covidguidance.nh.gov", "2020-06-05T19:14:20.000Z": "We're moving forward with Phase 2 of our golf guidance, which will shorten the break in between tee-times, allow two people from separate households in the same golf cart, and open up our golf courses to out-of-state residents. Click below to view the guidance. Click to view guidance www.covidguidance.nh.gov", "2020-06-05T19:13:09.000Z": "This morning, I announced that effective immediately, sunbathing and other leisurely beach activities can resume on our seacoast beaches. Beachgoers should maintain 6 feet in distance from other groups.\n\nClick below to view our new guidance. Click to view guidance www.covidguidance.nh.gov", "2020-06-05T19:08:45.000Z": "Our formula takes into account the difference in a business' 2019 and 2020 revenue, and federal aid they may have received like PPP. All adjusted losses for applicants across the state will be added up, and businesses will receive their pro-rata share of the $400M. (3/4)", "2020-06-05T19:08:44.000Z": "THREAD: One week ago, the deadline ended for small businesses to submit their Main Street Relief Fund pre-grant qualification application. Today, the Department of Revenue Administration will send out the final application form for Main Street Relief Fund Grants.", "2020-06-05T19:06:40.000Z": "Today we're announcing ASAP, the Asymptomatic Spread Assessment Program, to help identify asymptomatic spread and protect vulnerable populations across the state. The challenge: Get a #COVID19 test. Anyone can get one! Click below to request yours. Click to request your COVID-19 test! prd.blogs.nh.gov", "2020-06-05T16:31:39.000Z": "I'm holding a press conference today at 3 PM to provide a #COVID19 update. Tune in! Click to watch live at 3 PM www.wmur.com", "2020-06-05T15:42:10.000Z": "Beachgoers return to #HamptonBeach  #NH Friday after @GovChrisSununu allows safe return with 6 feet between families. #beachlife  @seacoastonline  @HamptonUnion", "2020-06-05T11:51:25.000Z": "We've always said we'd work with @NHPubHealth to be nimble with our decisions based on public health data, and we thank everyone for their patience.\n\nThose heading to our seacoast beaches should note that current parking restrictions will remain in effect.", "2020-06-05T11:51:24.000Z": "THREAD: Sunbathing and other traditional beach activities may resume on seacoast beaches, effective immediately. Beachgoers must still remain 6 feet from other groups.", "2020-06-04T23:32:50.000Z": "As I shared yesterday, New Hampshire has seen positive #COVID19 data trends in recent weeks. It's our intention to allow the Stay at Home Order to expire on June 15 and transition to a more flexible advisory. Tune-in to our press conference tomorrow at 3 for more details!", "2020-06-04T21:07:47.000Z": "Joining @WMUR9 live at 5:30 to answer YOUR #COVID19 questions. Hope you'll tune in! Gov. Sununu answers questions about COVID-19 response Gov. Chris Sununu joined WMUR during News 9 at 5:30 to answer viewer questions about the state's response to the coronavirus pandemic. wmur.com", "2020-06-03T22:48:40.000Z": "Good. It's about time. Quote Tweet The Washington Post @washingtonpost All four officers involved in George Floyd's death are now charged https:// wapo.st/3eRzTpX", "2020-06-03T22:32:23.000Z": "Throughout the #COVID19 pandemic we've managed our health care capacity incredibly well. On average, less than 5% of available hospital beds have been occupied by COVID-19 patients. This is another data point which provides us with additional flexibility moving forward. (2/2)", "2020-06-03T22:32:20.000Z": "THREAD: In recent weeks New Hampshire has seen positive trends in our data, including a downward trend in the percent of #COVID19 tests that have come back positive. This data is encouraging, and will help to better inform our reopening decisions in the coming days.", "2020-06-03T20:11:59.000Z": "Thank you @GovChrisSununu for Brooklynn's Birthday card!", "2020-06-03T19:11:07.000Z": "In the coming days, there will surely be more protests. It is our hope - and expectation - that these will be peaceful affairs, but we are closely monitoring them and will be ready if there are folks who try and disrupt these peaceful gatherings. (6/6)", "2020-06-03T19:10:37.000Z": "Manchester did not see the level of destruction seen in other major metropolitan areas across the country and we owe it to our people for protesting peacefully, and our law enforcement for making sure everything was safe. (5/6)", "2020-06-03T19:09:59.000Z": "THREAD: Last night, there was an organized, peaceful candlelight vigil in Stark Park in Manchester. It was a somber, well-run occasion, and it was very peaceful. I would like to thank the organizers for the well-run event, and the State stands with them in their calls for justice", "2020-06-03T18:57:32.000Z": "Holding a press conference in just a few moments to provide a #COVID19 update. Click below to tune-in. Click to watch live at 3 PM www.wmur.com", "2020-06-03T15:44:05.000Z": "Live at 3: Governor holds latest COVID-19 briefing 9 new COVID-19 deaths announced as officials see positive trends Gov. Chris Sununu plans to give the latest coronavirus response updates at a briefing Wednesday afternoon. wmur.com", "2020-06-03T18:24:55.000Z": "Congratulations to our friends at Loudon Elementary School on finishing the school year! Thank you for bringing your celebration to #NHMS .", "2020-06-03T16:28:47.000Z": "Anyone can be tested for #COVID19 in NH - learn the when, where, and how: http:// ow.ly/Cf3G50zXUYD", "2020-06-03T15:10:27.000Z": "Happy #603Day , New Hampshire!", "2020-06-02T22:20:41.000Z": "To that end, the State of NH is providing resources to the Manchester Police Department to ensure that all gatherings are peaceful and safe across the city. State Police and the National Guard are strategically staged and ready to deploy as needed. (2/2)", "2020-06-02T22:20:40.000Z": "THREAD: There have been reports of threats of potential violence separate from the peacefully planned #GeorgeFloyd vigil in Stark Park tonight. (1/2)", "2020-06-02T00:53:36.000Z": "Tuning in via Facebook live to the vigil at Henry Law Park in Dover. Pleased to see that Granite Staters are joining with one another in a tremendously peaceful way to engage in this important dialogue. Let's keep working together to bring about change. Dover students organize vigil for George Floyd to protect 'innocent black lives' DOVER -- High school student leaders from Project DREAM are holding a candlelight vigil Monday for George Floyd aimed at stopping the \"violence of police brutality against innocent black lives.\"Pal... fosters.com", "2020-06-01T19:10:22.000Z": "Racism has no home and will not be tolerated in NH - and neither does violence, looting, or rioting.\n\nThis important conversation must continue and we must constructively work together as a nation to ensure there is change. (5/5)", "2020-06-01T19:10:21.000Z": "This important conversation must continue and we must constructively work together as a nation to ensure there is change. Their message must be heard, but we will not condone violence against any individual, any small business, or any public property. (3/5)", "2020-06-01T19:10:20.000Z": "THREAD: Over the last few days, we have seen peaceful protests happen across America - including here in NH. The March in Manchester on Saturday was a peaceful protest organized to enact change and continue the important conversation of injustice - a message that we support.", "2020-06-01T16:36:05.000Z": "Holding a press conference today at 3 PM to provide a #COVID19 update. Click below to watch live. Click to watch live at 3 PM www.wmur.com", "2020-06-01T14:25:27.000Z": "All NH residents can be tested for #COVID19 at fixed testing sites across NH, in addition to ConvenientMD and through your provider. Call 271-5980 or visit http:// nh.gov/covid19 to set up a test.", "2020-05-30T17:21:45.000Z": "This AM I called the organizers ahead of the #GeorgeFloyd March in Manchester to let them know the State of NH stands with them in their calls for justice. This important conversation must continue and we must constructively work together as a nation to ensure there is change. Quote Tweet WMUR TV @WMUR9 Thousands march in Manchester to protest death of George Floyd https:// wmur.com/article/thousa nds-march-in-manchester-to-protest-death-of-george-floyd/32719310?utm_campaign=snd-autopilot ", "2020-05-29T20:30:23.000Z": "TESTING NOW OPEN TO ALL NH RESIDENTS. To make an appointment at a fixed testing site, call 271-5980, or register online at http:// ow.ly/BME750zU44F .", "2020-05-29T19:31:50.000Z": ". @GovChrisSununu , unprompted, addresses George Floyd killing & protests in MN. \"From the Governor to that family, our heart really does go out to them.\" #WMUR", "2020-05-29T19:25:50.000Z": "In an effort to allow parents time to make their summer plans, we are announcing that day camps will resume operations under new guidance on June 22. Click to view guidance www.covidguidance.nh.gov", "2020-05-29T19:24:27.000Z": "If you are coming from out-of-state to stay at a NH hotel or rental location, you must self-attest to having stayed in your home, only leaving for essential purposes, for the previous 14 days.", "2020-05-29T19:24:09.000Z": "THREAD: Hotels and short-term rentals may resume service on June 5.\n \nHotels, inns, bed and breakfasts, and short-term rentals may start taking reservations for in-state residents, and those from out of state who have quarantined for 14 days, effective immediately. Click to view guidance www.covidguidance.nh.gov", "2020-05-29T19:21:10.000Z": "While places of worship were never closed for small gatherings of under 10 people, many chose to stop in-person services altogether. Today we are issuing guidance that will allow for in-person services to resume, effectively immediately, with a 40% cap on occupancy. Click to view guidance www.covidguidance.nh.gov", "2020-05-29T19:19:03.000Z": "Effective immediately, behind the wheel driver's education classes may resume in accordance with new guidance. Click to view guidance www.covidguidance.nh.gov", "2020-05-29T19:13:28.000Z": "REMINDER: Today is the FINAL day to submit your prequalification application for the Main Street Relief Fund. Complete yours here: https:// goferr.nh.gov/covid-expendit ures/main-street-relief-fund ", "2020-05-29T17:30:18.000Z": "Holding a press conference today at 3 PM to provide a #COVID19 update. Click below to watch live. Click to watch live at 3 PM www.wmur.com", "2020-05-29T17:14:29.000Z": "CALLING ALL NEW HAMPSHIRE SMALL BUSINESSES\n\nFINAL DAY to submit a prequalification application for the Main Street Relief Fund. Visit: http:// goferr.nh.gov/covid-expendit ures/main-street-relief-fund ", "2020-05-29T12:49:26.000Z": "Don't miss the deadline today to submit your prequalification application to take part in the $400 million in emergency funding and financial relief to #NH  #smallbiz . http:// ow.ly/CDmZ50zTwwQ  @nhgoferr", "2020-05-29T13:15:15.000Z": "DEADLINE TODAY: $400 million is available in emergency funding for NH small businesses as part of the Main Street Relief Fund -- more info & to submit a prequalification application by the deadline: Friday, May 29 by visiting: http:// ow.ly/e5QM50zSTCj", "2020-05-29T12:36:51.000Z": "Those looking to take their @NH_DMV driving test can go online to schedule an exam, which will begin on Monday, June 1. Visit http:// nh.gov/dmv to schedule yours.", "2020-05-28T19:40:34.000Z": "Sheep graze by a massive American flag on the side of a barn along Atlantic Ave in #NorthHampton  #NH . #streetphotography  #Merica  @seacoastonline", "2020-05-28T21:06:34.000Z": "I'll be on with @WMUR9 tonight just after 5:30 to answer your #COVID19 questions. Hope you'll watch!", "2020-05-28T19:03:13.000Z": "From PPE distribution to running testing sites, the men and women of the @NHNationalGuard have helped respond to #COVID19 every step of the way. I commend @POTUS for extending Title 32 status. This announcement allows our National Guard to continue to provide critical services. Quote Tweet Donald J. Trump @realDonaldTrump The men and women of the National Guard have been doing a great job fighting the CoronaVirus. This week, I will extend their Title 32 orders through mid-August, so they can continue to help States succeed in their response and recovery efforts.", "2020-05-28T16:17:16.000Z": "The State plans to keep four facilities operationalized in: Manchester Plymouth Durham Littleton\n\nShould the need arise, the @NHNationalGuard stands ready to stand up additional sites at a moment's notice.", "2020-05-28T16:17:01.000Z": "Starting next week, most of the clinical surge flex facilities across NH will be closed. When we stood these sites up, thanks to the @NHNationalGuard and our local partners, our hope was to never have to turn the lights on. This is welcome news. Click below to read more: Click to read more www.governor.nh.gov", "2020-05-28T15:08:21.000Z": "Today I wrote to @POTUS and @HHSGov  @DepSecHargan regarding federal funding to help New Hampshire respond to #COVID19 . Read my letters:", "2020-05-28T12:47:34.000Z": "Main Street Relief Fund prequalification applications are due by TOMORROW. Businesses interested in receiving these relief funds MUST complete the application. Click below. Click to complete the prequalification application www.goferr.nh.gov", "2020-05-27T17:44:32.000Z": "Prequalification applications for the Main Street Relief Fund, which will help small businesses manage the economic disruption brought by #COVID19 , MUST be submitted by this Friday, May 29. Click below to submit yours. Click to complete your application www.goferr.nh.gov", "2020-05-26T23:43:00.000Z": "In the wake of #COVID19 , it's more important than ever to ensure that information is readily accessible to all Granite Staters. Following our press conferences, transcripts will now be made available at http:// Governor.nh.gov . Read more: https:// drcnh.org/press-releases /state-commits-to-increase-accessibility-for-people-with-disabilities/ ", "2020-05-26T20:58:22.000Z": "You can't hike to where we are headed. My first mate is calling in the coordinates. #HomeHikeChallenge", "2020-05-26T20:30:48.000Z": "Education news in NH today - @GovChrisSununu mandates every school district hold individualized IEP meetings to consider extended school year services for every child w/ an IEP.\n\nStudents w/ IEPs are among those most impacted by shift to remote learning. @seacoastonline Quote Tweet Chris Sununu @GovChrisSununu THREAD: Today I signed Emergency Order #48 - an order to ensure the continuation of special education services for our students, and require each school district to hold individualized IEP team meetings to consider extended school year services for every child with an IEP. (1/3) Show this thread", "2020-05-26T19:30:19.000Z": "As the weather gets warmer, and as folks partake in the #HomeHikeChallenge , it's important we take time to educate ourselves on Lyme Disease and take steps to prevent tick bites. Check out http:// TickFreeNH.org to learn how you can protect and prevent yourself from ticks.", "2020-05-26T19:23:58.000Z": "Over a week ago, we announced the formation of the Main Street Relief Fund which will help small businesses manage the economic disruption brought by #COVID19 . Businesses interested in receiving funds MUST fill out a prequalification application online by May 29. Click below. Click to complete the prequalification application www.goferr.nh.gov", "2020-05-26T19:18:53.000Z": "At these meetings, IEP teams must consider whether any compensatory education services may be required due to circumstances arising from remote instruction and support. (2/3)", "2020-05-26T19:18:52.000Z": "THREAD: Today I signed Emergency Order #48 - an order to ensure the continuation of special education services for our students, and require each school district to hold individualized IEP team meetings to consider extended school year services for every child with an IEP. (1/3)", "2020-05-26T18:35:12.000Z": "The deadline for small businesses to complete the Main Street Relief Fund prequalification application is this Friday. Small businesses MUST complete this application in order to receive these relief funds. For more information visit: https:// goferr.nh.gov/covid-expendit ures/main-street-relief-fund   #NHEconomy", "2020-05-26T17:14:30.000Z": "I'm holding a press conference today at 3 PM to provide a #COVID19 update. Hope you'll tune-in. Click to watch live at 3 PM www.wmur.com", "2020-05-26T12:57:14.000Z": "The deadline for small businesses to complete the Main Street Relief Fund prequalification application is this Friday. Small businesses MUST complete this application in order to receive these relief funds. Click below or visit http:// revenue.nh.gov Click to complete the pre-grant application www.goferr.nh.gov", "2020-05-25T13:28:12.000Z": "On this Memorial Day, we pause to remember those who gave their lives in defense of our nation. We are forever indebted to these heroes.", "2020-05-24T18:22:47.000Z": ". @NHEdCommr and the School Transition, Reopening, and Redesign Taskforce are looking for input from parents, teachers, and education leaders across NH. Make sure your voice is heard and fill out the Back to School survey by May 29! https:// education.nh.gov/survey2020", "2020-05-22T23:45:37.000Z": "Today we announced steps we're taking to gradually flex open additional businesses and industries, based on guidance approved by our Bipartisan Reopening Taskforce and signed off on by public health officials. Visit http:// covidguidance.nh.gov to see the full list of today's guidance", "2020-05-22T21:00:02.000Z": "I'll be on-air with @WMUR9 tonight at 5:30 to answer YOUR #COVID19 questions. Be sure to tune-in!", "2020-05-22T19:55:34.000Z": "CALLING ALL NH SMALL BUSINESSES\n\nThere's just one week left to submit the Main Street Relief Fund prequalification application. Click below to submit yours. Click to complete the prequalification application www.revenue.nh.gov", "2020-05-22T19:21:51.000Z": "Gov. Chris Sununu announced Friday that no-contact sports practices are now allowed on playing fields, for up to 10 players maintaining social distancing. Play ball! NH to allow baseball, other no-contact sport practices PORTSMOUTH - Gov. Chris Sununu announced Friday that no-contact sports practices are now allowed on playing fields, for up to 10 players maintaining social distancing.Mayor Rick Becksted said Friday... seacoastonline.com", "2020-05-22T19:39:07.000Z": "Today we are also announcing the next areas that will be able to open in a smart, phased approach on Monday, June 1.  Click below to view all guidance announced today. Click to view all COVID guidance www.covidguidance.nh.gov", "2020-05-22T19:31:28.000Z": "On June 1, state beaches along our seacoast will be able to open in a measured, safe approach. People may go to our beaches to engage in recreational activities. Sitting, lounging, and sports will be prohibited. State parking lots will be limited to 50% capacity. Click to view guidance www.covidguidance.nh.gov", "2020-05-22T19:25:12.000Z": "Starting on June 1, fitness centers may open to small-group fitness classes - but only where social distancing can be allowed, with 8-10 feet between individuals.\n\nThis guidance does not allow for general use of gym equipment, unless through a one-on-one personal training class. Click to view guidance www.covidguidance.nh.gov", "2020-05-22T19:20:35.000Z": "Today we are offering guidance to allow for small-group youth and amateur sports practices, training, and other sessions to resume immediately. Click below to view full guidance. Click to view guidance www.covidguidance.nh.gov", "2020-05-22T19:17:43.000Z": "After announcing new childcare guidance last week, we heard from folks who were concerned about certain parameters and modifications. We listened and we hear you. We believe this new, modified guidance, which takes effect immediately, will allay concerns. Click below to view. Click to view updated guidance www.covidguidance.nh.gov", "2020-05-22T16:21:14.000Z": "Later today I will make an announcement about our State seacoast beaches, and other sectors of the economy that we can open in a safe approach. Hope you'll tune in at 3 PM! Click to watch live at 3 PM www.wmur.com", "2020-05-22T14:01:17.000Z": "CALLING ALL NH SMALL BUSINESSES\n\nThere is only one week left to submit the Main Street Relief Fund prequalification. To submit visit: https:// goferr.nh.gov/covid-expendit ures/main-street-relief-fund ", "2020-05-21T20:10:19.000Z": "This Pallet's For You\n\nNH guardsmen assigned to COVID-19 relief operations pick up 100 pallets today in Concord. They were donated by NH Distributors and will be used to secure the next shipment of PPE scheduled to arrive Friday at Manchester-Boston Regional Airport.", "2020-05-21T22:12:17.000Z": "Last wk, @GovChrisSununu announced a new $60M NH Nonprofit Emergency Relief & Recovery Fund for #NH  #nonprofits . This new fund will support a grants program to be administered by a partnership of the @nhnonprofits  @nhcfoundation & @NHCDFA  https:// bit.ly/3bNq8ag  #InThisTogether", "2020-05-21T13:43:38.000Z": "CALLING ALL NH SMALL BUSINESSES\n\nMake sure you've completed your Main Street Relief Fund pre-grant application by May 29! Small businesses MUST complete this simple application in order to receive these relief funds. Click below or visit http:// revenue.nh.gov Click to complete the pre-grant application new-hampshire.secure.force.com", "2020-05-20T16:25:52.000Z": "I'll be holding a press conference today at 3 PM to provide a #COVID19 update. Hope you'll tune in! Click to watch live at 3 PM www.wmur.com", "2020-05-19T13:31:26.000Z": "Restaurants across NH have not just made outdoor dining work - they've taken innovative approaches to adhere to our safety guidelines and make outdoor dining an experience of its own. THANK YOU to everyone for a successful first day! #603Pride 'Good times with good friends' return as restaurants offer outdoor dining Sitting on a couch in the late day sun, surrounded by friends, Cindy Gravell took a sip from her cocktail and smiled. unionleader.com", "2020-05-18T19:27:55.000Z": "Today we will also begin to open up Equestrian Facilities. Lessons can be scheduled only in a manner where social distancing is appropriately applied, no congregating in public areas, and limits on the amount of riders at a time. Click to view guidance www.covidguidance.nh.gov", "2020-05-18T19:26:37.000Z": "Larger group activities and tourist attractions like amusement parks, water parks, tourist trains, boat cruises, and indoor attractions will be considered for reopening down the line. (3/3)", "2020-05-18T19:26:27.000Z": "Included outdoor attractions are: Biking rentals Canoe and kayak rentals Outdoor driving ranges Outdoor shooting ranges Small fishing charters Paint ball Outdoor guiding services for fishing, hunting, or hiking Other outdoor activities able to follow the guidance", "2020-05-18T19:26:09.000Z": "THREAD: Effective immediately, outdoor activities situated in recreational or natural settings that occur individually or in small groups of 10 or less, may resume with appropriate guidelines. Click to view guidance www.covidguidance.nh.gov", "2020-05-18T19:23:42.000Z": "Some of these new changes include: Daily screenings of children and staff Increased hygiene practices Limits on room capacity Staggered drop-off and pickup times. \n\n(3/3)", "2020-05-18T19:23:27.000Z": "The foundation of this guidance is taken from the guidance we originally issued to child care facilities that chose to remain open early in this crisis to take care of children of essential workers. (2/3)", "2020-05-18T19:23:15.000Z": "THREAD: Today we are putting forward comprehensive guidance that will ensure the safety and security of children and staff at NH's child care facilities. This guidance was unanimously endorsed by our bipartisan Reopening Taskforce Committee and approved by NH Public Health. Click to view guidance www.covidguidance.nh.gov", "2020-05-18T19:14:26.000Z": "Yesterday the state reported out nearly 2,400 tests for a total of 41 positive cases, bringing our percent of positive cases to below 2% - the lowest ever. We are making huge strides every day in increasing our testing capacity and will continue to do so. Click to request a test: Click to request a test prd.blogs.nh.gov", "2020-05-18T19:12:26.000Z": "The Main Street Relief Fund is an innovative, $400M fund meant to help small businesses in the wake of #COVID19 . Small businesses interested in receiving funding must fill out a pre-grant application online by May 29, 2020 at: http:// revenue.nh.gov  http:// goferr.nh.gov Click to complete the pre-grant application new-hampshire.secure.force.com", "2020-05-18T17:11:45.000Z": "I'm holding a press conference today at 3 PM to provide a #COVID19 update. Click below to watch live. Click to watch live at 3 PM www.wmur.com", "2020-05-18T14:01:28.000Z": "Here are the 8 Portsmouth restaurants approved for outdoor dining as of 5 p.m. Sunday https:// bit.ly/2WFHtNV  @seacoastonline Reminder from @GovChrisSununu no one is forced to reopen Dining out is back in Portsmouth PORTSMOUTH -- Nurses at Wentworth-Douglass Hospital, Sheri Sprague and Linda Samuels were among the first to dine al fresco Monday, when COVID-19 restaurant-closure orders were loosened in New... seacoastonline.com", "2020-05-18T13:49:05.000Z": ". @GovChrisSununu 's Economic Re-Opening Task Force will meet today, May 18 from 1:30 pm to 3:30 pm to discuss plans for re-opening the #NHeconomy . The public is invited to listen in. Visit https:// nheconomy.com/reopeningtaskf orce  to learn more. #603strongertogether", "2020-05-18T13:08:53.000Z": "To be clear: no restaurant is forced to open today. As always, employers have the final say as to whether or not they wish to flex open their operations. The State continues to make masks available for businesses that choose to open. Request yours: Mask Order Form for Businesses The Business Mask Order program has been incredibly successful. The State of NH has received over 15,000 requests totaling more than 7 million masks. That translates to over 12,750 businesses... prd.blogs.nh.gov", "2020-05-18T13:08:46.000Z": "THREAD: Restaurants across the Granite State are opening for outdoor dining today, in addition to takeout and delivery. Those opening must do so in accordance with guidelines developed and approved by our Reopening Taskforce and signed off on by public health officials. Click to view guidance www.covidguidance.nh.gov", "2020-05-17T11:20:37.000Z": "Joining @foxandfriends around 8:15 AM. Hope you can tune in.", "2020-05-15T23:49:02.000Z": "5/15/2020: TORNADO WARNING for parts of Cheshire and Hillsborough counties until 8:15PM. TAKE COVER NOW! For protection, move to an interior room on the lowest floor of a building. #ReadyNH  #NHwx  #BePrepared  #BeSafe Quote Tweet NWS Gray @NWSGray Tornado Warning including Peterborough NH, Jaffrey NH, Troy NH until 8:15 PM EDT", "2020-05-15T23:42:13.000Z": "5/15/2020: Severe Thunderstorm Warning for parts of Sullivan, Hillsborough, Cheshire, and Merrimack Counties until 8:30PM. For protection, move to an interior room on the lowest floor of a building. #ReadyNH  #NHwx  #BePrepared  #BeSafe Quote Tweet NWS Gray @NWSGray Severe Thunderstorm Warning including Keene NH, Milford NH, Goffstown NH until 8:30 PM EDT", "2020-05-15T20:47:17.000Z": "Will be in studio at @WMUR9 tonight at 5:30 PM answering your questions. Tune in!", "2020-05-15T20:46:52.000Z": "This program will enable the BFA to use expertise and discretion to target relief aid to the most impacted small business. More details on this program will be forthcoming, with a targeted go-live date of after the Main Street Relief Fund grants are awarded starting June 15th.", "2020-05-15T20:46:51.000Z": "THREAD: In order to ensure that no small business falls through the cracks, similar to what has happened with the Federal PPP program, we are creating a $30 million \"Small Business Gap Fund\" to be administered by the New Hampshire Business Finance Authority.", "2020-05-15T19:33:33.000Z": "With today's funding allocations, the state will have approximately $405 million in reserve. This funding will stay in our reserves to help us respond to future #COVID19 issues that may arise.", "2020-05-15T19:32:33.000Z": "We are expanding the eligible pool of those in line to receive stipend enhancements. These enhancements will not require any increases in currently allocated funding, and instead, will fall within the current budgets of our existing stipend programs.", "2020-05-15T19:32:06.000Z": "We are committing $15 million to higher education here in New Hampshire, with funding to meet the needs of our University System and Community College System as they confront #COVID19 .", "2020-05-15T19:29:57.000Z": "Today we are announcing $15 million in support of farm & food, with $4.5 million for NH's Dairy Farmers and an additional $1.5 million towards farmers in NH's other industries. An additional $4 million will go towards emergency grants to ensure stability in our food supply chain.", "2020-05-15T19:26:13.000Z": "Any eligible business interested in applying for these funds MUST fill out this pre-grant application.", "2020-05-15T19:26:12.000Z": "The pre-grant application will allow us to account for a business's anticipated lost revenues due to #COVID19 , any other federal assistance a business may have received, like through the federal Paycheck Protection Program, and allow us to determine the size of need across NH.", "2020-05-15T19:24:26.000Z": "THREAD: Small businesses interested in receiving funding must fill out a pre-grant application. To complete this pre-grant application, you can: Click below Visit http:// goferr.nh.gov  Visit http:// revenue.nh.gov Click to complete the necessary pre-grant application new-hampshire.secure.force.com", "2020-05-15T19:22:19.000Z": "The Main Street Relief Fund is our most substantial investment to date. This initial round of 400 million dollars will help New Hampshire small businesses get through the economic disruption caused by #COVID19 .", "2020-05-15T19:21:12.000Z": "This funding will help build upon the work of New Hampshire's Emergency Child Care Program and Collaborative and will support a strategic, aligned, and innovative approach to manage and reopen childcare and family resources settings as the NH Economy continues to reopen.", "2020-05-15T19:21:11.000Z": "THREAD: Childcare is a vital component to our eventual plans to reopen the economy. We are committing $25 million to provide emergency funding to the Early Childhood Care and Education System to support urgent child care and family support needs.", "2020-05-15T19:17:48.000Z": "", "2020-05-15T19:14:19.000Z": "Today we are doubling the amount allocated for our health care organizations by increasing the Emergency Fund by $50 million, bringing the total to $100 Million - which will help facilities keep their lights on and provide critical services to those in need.", "2020-05-15T19:13:15.000Z": "We are expanding funding for our hospitals and health care facilities, committing an unprecedented amount to our non-profits and Main Street small businesses, and continuing to put dollars towards our childcare system, frontline workers, and higher education system.", "2020-05-15T19:11:03.000Z": "In the first few weeks since receiving these funds from the federal government, we moved quickly and committed $250 million in federal funds to help those in need. These steps were just the beginning, but every day we take steps to provide more relief for the citizens of NH.", "2020-05-15T17:47:26.000Z": "Holding a press conference today at 3 PM to provide a #COVID19 update. Hope you'll in. Watch live at 3 PM www.wmur.com", "2020-05-15T14:54:45.000Z": "Just got off a zoom call with the Newport Chamber of Commerce. Appreciated hearing about how Newport small businesses are responding to #COVID19 and I provided an update on state level efforts. Big thanks to Widmer & Davis Artisan Distillery for producing hand sanitizer #603Pride", "2020-05-15T13:17:56.000Z": "The Law Enforcement Officers' Memorial Ceremony was cancelled due to #COVID19 , so I got up early to pay my respects and drop off a wreath at the memorial - a solemn reminder that we will never forget the commitment & sacrifice made by our state's fallen heroes and their families.", "2020-05-15T12:44:11.000Z": "We will miss you Lorie! Thanks for making the countless TV hits go off without a hitch. Have fun on your next adventure! #603Pride Quote Tweet Neil Levesque @NeilLevesque After 27 years ... @SaintAnselm  + @nhiop today is the last day at work for the beloved Lorie Cochran who is opening a new chapter in retirement. She influenced 1000s of students and made so many friends in NH like ... @SenatorShaheen  + ... @GovChrisSununu  #nhpolitics", "2020-05-14T16:01:12.000Z": "#COVID19 testing is available, even if you have just one symptom. Call your provider, or make an appointment at a fixed testing site - visit http:// ow.ly/w57p50zG8On to schedule online, or call 271-5980.", "2020-05-14T13:57:56.000Z": "While there's still a long way to go in our fight against #COVID19 , the State of New Hampshire has made significant progress in just the last few days. Watch:", "2020-05-13T23:37:45.000Z": "In just days NH has taken impressive action to confront #COVID19 : 1,900 tests reported - the single highest daily total 7th fixed drive-thru testing site 17M masks secured Launch of antibody testing $5.5M a week for long-term care worker stipends New strategies to respond to COVID-19 nursing home deaths in NH CONCORD - The state is responding to a high COVID-19 mortality rate in nursing homes by licensing temporary health workers and increasing testing, Gov. Chris Sununu and the state's top unionleader.com", "2020-05-13T19:18:11.000Z": "Today we are reporting out 1,900 #COVID19 test results - the highest number of tests conducted in a single day. Of those tests, 63, or 3.3% were positive for COVID-19. This is good news. Increased testing will continue to help guide our decisions moving forward.", "2020-05-13T19:16:32.000Z": "Today, we are sending $575,000 to police and fire departments across New Hampshire to purchase ventilators, PPE, supplies, and help cover overtime costs. These emergency funds provide communities with the means needed to respond to #COVID19 . Read more: https:// governor.nh.gov/sites/g/files/ ehbemt336/files/documents/sununu-macdonald-20200513.pdf ", "2020-05-13T19:10:10.000Z": "To date, the State has approved 282 application from eligible long-term care facilities, with 22,500 workers now receiving a weekly $300 stipend. We look forward to providing this incentive to additional workers as more and more facilities apply.", "2020-05-13T19:10:09.000Z": "THREAD: A few weeks ago we launched the Long Term Care Stabilization Fund to ensure that those in long-term care facilities receive uninterrupted care. Since, over $6.2 million in payments have gone out the door with $5.5 committed a week going forward.", "2020-05-13T19:08:56.000Z": "THREAD: Over $25 million dollars have gone to New Hampshire companies who are manufacturing, procuring, and securing PPE. This is a team effort, and New Hampshire is getting the job done.", "2020-05-13T19:08:02.000Z": "THANK YOU to Body Armor Outlet in Salem for helping to secure these additional masks.", "2020-05-13T19:08:01.000Z": "In just a few months, NH has become a force to be reckoned with when it comes to procuring PPE. Earlier this week 7 million more masks arrived in the Granite State, with another 10 million scheduled to arrive on Friday. Request for your business: https:// prd.blogs.nh.gov/dos/hsem/?page _id=8451  (1/1)", "2020-05-13T17:04:05.000Z": "Holding a press conference at 3 PM to provide a #COVID19 update. Hope you'll tune in. Click to watch live at 3 PM www.wmur.com", "2020-05-13T00:18:03.000Z": "The loss of even one life is unacceptable. From our team at public health, to the frontline workers in long-term care facilities, NH is enacting an aggressive containment strategy to ensure the wellbeing of our vulnerable citizens against #COVID19 . Neighboring states have seen greater spike in long-term care than NH CONCORD - While 75% of COVID-19-related deaths are nursing home or assisted living residents, fewer of New Hampshire's long-term care centers have been touched by the virus compared to neighboring unionleader.com", "2020-05-12T19:43:11.000Z": "During this #NationalPoliceWeek and #LawEnforcementMemorialWeek , we're especially grateful for the bravery and dedication of the men and women who serve to keep NH's communities safe and strong - especially during these difficult times. Thank you for all that you do! #603Pride", "2020-05-12T17:42:55.000Z": "Today we got a letter in the mail notifying us of a change in the transportation services provided through Medicaid. For this, we want to say thank you to @GovChrisSununu for hearing our voices and taking action to protect the most vulnerable in our state!", "2020-05-12T16:28:20.000Z": "Tomorrow, we're launching a new drive-thru testing site in Concord, which will be open 7 days a week 11 AM-7 PM. Additionally, we have drive-thru testing locations in: Claremont Lancaster Milford Plymouth Tamworth Rochester\nClick below to reserve a test: Click to reserve a test prd.blogs.nh.gov", "2020-05-12T00:17:07.000Z": "In NH, we've leveraged connections across the private sector & international markets to secure millions of pieces of PPE, with an additional 15M units on the way. Thanks to our fast action, hospitals & businesses alike are receiving these critical supplies How New Hampshire built a mammoth PPE supply chain from China State governments are scrambling to track down and acquire personal protective equipment (PPE) and essential medical gear to fight the coronavirus pandemic, as President Trump encourages governors to thehill.com", "2020-05-11T22:45:02.000Z": "While she won't let me take her picture, I am allowed to tell you that our newly-minted 16 year-old loved receiving a b-day card from @GovChrisSununu . Thanks for taking time to brighten her day, Governor! #birthdaygirl  #603Pride", "2020-05-11T19:00:54.000Z": "Replying to @janebuck  @sklogw42  and 2 others Went today. Got antibody test draw and Swab. Fantastic experience all around. Results in a day to a few for both. Really appreciate this @GovChrisSununu", "2020-05-11T17:17:17.000Z": "Holding a press conference today at 3 PM to provide a #COVID19 update. Click below to watch live: Click to watch live at 3 PM www.wmur.com", "2020-05-11T16:00:52.000Z": "Parents - don't miss State Epidemiologist Dr. Benjamin Chan on WMUR tonight as he answers questions from NH kids about #COVID19 . Show airs at 7 p.m. Monday, May 11th: Kids ask Dr. Chan about COVID-19 Kids get answers to the questions that are on their minds during quarantine. wmur.com", "2020-05-11T13:21:42.000Z": "The State has made face masks available to all those who elect to open for business today. Request yours at: Mask Order Form for Businesses The Business Mask Order program has been incredibly successful. The State of NH has received over 15,000 requests totaling more than 7 million masks. That translates to over 12,750 businesses... prd.blogs.nh.gov", "2020-05-11T13:21:41.000Z": "New Hampshire's drive-in movie theaters will also be able to flex open their operations today, in accordance with new guidelines. https:// governor.nh.gov/news-media/sta y-at-home/documents/20200105-drive-in-theaters.pdf ", "2020-05-11T13:21:40.000Z": "While never closed by the state, several dental practices will resume operations today, if they should choose, under new guidance vetted by @NHPubHealth , and in-line with @AmerDentalAssn recommendations. https:// governor.nh.gov/news-media/sta y-at-home/documents/20200508-dental.pdf ", "2020-05-11T13:21:39.000Z": "Golf courses across the Granite State reopen today. Participants are limited to New Hampshire residents and club members only. https:// governor.nh.gov/news-media/sta y-at-home/documents/20200501-golf.pdf ", "2020-05-11T13:21:38.000Z": "While curbside and delivery methods have been utilized by retailers over the last few weeks, many will flex open operations at their physical locations today in accordance with new public health guidelines. https:// governor.nh.gov/news-media/sta y-at-home/documents/20200501-retail.pdf ", "2020-05-11T13:21:37.000Z": "THREAD: Today, several industries across the Granite State are beginning to flex their operations to open in a smart, responsible manner guided by data and science, and under guidance approved by @NHPubHealth . View the industries flexing open today, along with guidance, below.", "2020-05-11T00:29:43.000Z": "#HomeHikeChallenge Somewhere in the boonies near Mt. Monadnock. Thanks for the inspiration @GovChrisSununu !", "2020-05-10T13:35:08.000Z": "Things look a little different this year, but the love of a mom never wavers. Wishing a Happy #MothersDay to all of the remarkable mothers across the Granite State, especially to my amazing wife, Valerie, and to my Mom.", "2020-05-09T15:07:49.000Z": ". @NHFB and @NHNationalGuard Guard are handing out meals at @NHMS in Loudon until 1pm! Come on down if you're in need, they're giving out 52 pounds of food per vehicle that pulls in. #WMUR", "2020-05-09T14:30:04.000Z": "As testing continues to increase in NH, the addition of antibody tests - now available to NH residents regardless of financial standing or insurance coverage - provides us another tool in our fight against #COVID19 . This is an important step forward. Antibody tests available in NH, state to pay for tests for uninsured New Hampshire has had 2,947 confirmed COVID-19 cases as of Friday, but in a briefing, Gov. Chris Sununu guessed many more people have had the virus. unionleader.com", "2020-05-08T19:12:36.000Z": "While most major insurance carriers will cover the testing cost, the State of NH has entered into a contract with ClearChoiceMD to provide antibody testing to people who do not have health insurance and for those whose health insurance plan does  not cover the test. (2/3)", "2020-05-08T19:12:08.000Z": "THREAD: ClearChoiceMD has announced they are offering antibody tests, which help determine whether you have the antibodies to #COVID19 , indicating you have had, and recovered, from the virus. NH residents can click below to schedule a telehealth visit and get the test. Click to schedule an anti-body test ccmdcenters.com", "2020-05-08T19:09:15.000Z": "In recent days we've greatly expanded NH's #COVID19 testing capacity. Anyone with a single symptom can now reserve a test online, and any person over the age of 60 or any health worker can get a test for any reason. If you're eligible, click below to reserve your test. Click to reserve your test prd.blogs.nh.gov", "2020-05-08T19:07:56.000Z": "As businesses begin to consider reopening, we have made the availability of face masks a priority. In just a few days our online web form has received thousands of requests for millions of masks. Click below to request face masks for eligible businesses. Click to request for eligible businesses prd.blogs.nh.gov", "2020-05-08T19:06:22.000Z": "While the state did not close any of them down, we are issuing new guidance - vetted by @NHPubHealth - which offers dentist offices a roadmap to reopen if they should choose on Monday, May 11 with safety precautions in place. Click below for more info. Click to view guidance www.governor.nh.gov", "2020-05-08T18:52:21.000Z": "LIVE AT 3: New Hampshire @GovChrisSununu holds a COVID-19 briefing. https:// bit.ly/3bdf2el", "2020-05-08T18:50:01.000Z": "WATCH LIVE ONLINE: @GovChrisSununu to give update on COVID-19 efforts in #NH . It's scheduled to start at 3 p.m. Watch it live on http:// wcax.com  https:// wcax.com/content/news/N H-colleges-plan-for-fall-return-task-force-takes-more-calls-570310821.html ", "2020-05-08T17:00:27.000Z": "Live at 3: Governor to hold latest COVID-19 briefing Governor says dentist offices can open Monday Dental offices in New Hampshire will be able to reopen as early as Monday under new guidance from the state, the governor said Friday. wmur.com", "2020-05-08T17:01:57.000Z": "Holding a press conference today at 3 PM to provide a #COVID19 update. Click below to watch live: Click to watch live at 3 PM www.wmur.com", "2020-05-07T15:50:04.000Z": "NH COVID-19 testing has been expanded!  Residents maybe tested, regardless of insurance status, at one of the following testing sites (Claremont, Milford, Tamworth, Rochester, Plymouth, or Lancaster). Register at: https:// bit.ly/2WyVqMx", "2020-05-07T15:22:59.000Z": "This 7 year old so happy to get her birthday card from @GovChrisSununu while remote learning.", "2020-05-07T01:12:14.000Z": "Happy to have helped Evan celebrate his 8th birthday. Love this video his Mom shared with us. Evan is one super cool dude!", "2020-05-06T23:00:03.000Z": "Every day we are taking significant steps forward in expanding access to #COVID19 testing. Our new portal on http:// nh.gov/covid19 allows you to schedule yourself to receive a COVID-19 test. Watch below to see if you're eligible:", "2020-05-06T21:06:34.000Z": "Joining @WMUR9 tonight at about 5:30 PM to answer your #COVID19 questions. Hope you'll tune in.", "2020-05-06T19:46:05.000Z": "Every day we are taking significant steps forward in expanding access to #COVID19 testing. Quote Tweet Kevin Landrigan @KlandriganUL . @GovChrisSununu announces broad expansion of testing, setting up link to http:// nh.gov . tomorrow for anyone with one symptom for COVID to log on and request a test, also open to anyone over 60, with comorbidity condition, health care workers. #covid19nh  #nhpolitics", "2020-05-06T19:10:38.000Z": ". @GovChrisSununu says anyone with at least one COVID-19 symptom, anyone over the age of 60, healthcare workers, and anyone with certain underlying conditions will be able to get a #covid19 test with new, expanded testing.", "2020-05-06T19:11:39.000Z": "THREAD: When it comes to child care, we've taken swift and decisive action. Established the Emergency Child Care Collaborative - comprised of 265 child care centers serving 5,300 children Deployed over $500k in financial incentives to local child care centers", "2020-05-06T19:10:18.000Z": "As we take smart, scientific steps to reopen certain parts of our economy, we'll continue placing an emphasis on testing. Today's announcement is a major step forward in ensuring ease of access to testing for all Granite Staters. (4/4)", "2020-05-06T19:10:17.000Z": "THREAD: We're urging Doctors to recommend a #COVID19 test to anyone displaying even one of the symptoms. Today, we're announcing that we will further expand this effort by setting up an online web portal to allow Granite Staters to sign up and reserve a test. (1/4)", "2020-05-06T18:50:02.000Z": "WATCH LIVE: Sununu COVID-19 update https:// wcax.com/content/news/N ew-Hampshire-offers-guidance-on-high-school-graduations-570237351.html ", "2020-05-06T16:20:06.000Z": "Live at 3: Gov. Sununu gives updates at latest COVID-19 briefing 19 new deaths, all in long-term care facilities, attributed to COVID-19 in NH New Hampshire health officials said Wednesday that 19 more people have died of COVID-19, and all were residents of long-term care facilities. wmur.com", "2020-05-06T16:32:49.000Z": "Holding a press conference today at 3 PM to provide a #COVID19 update. Click below to watch live: Watch live at 3 PM www.wmur.com", "2020-05-06T13:14:36.000Z": "On this #NationalNursesDay , we're sending an extra special THANK YOU to all of New Hampshire's nurses who are serving on the front lines in our fight against #COVID19 . You are our heroes today and every day. #603Pride", "2020-05-06T00:51:10.000Z": "AWESOME! Have an extra slice of cake for me, John! Quote Tweet Laura Montenegro @LMontenegro_PIO My dad, Papa, an attorney with the great state of #NH for 20 years, was ecstatic to receive a birthday card during these unprecedented times personalized by @GovChrisSununu . A 2-time cancer survivor, he makes 75 the new 30. #happybirthday  twitter.com/GovChrisSununu", "2020-05-05T23:44:16.000Z": "New Hampshire's First Responders have always been there for our communities in times of crisis, regardless of the risks they face. Great to share how NH is using #CARESAct funding to provide for those on the frontlines of keeping our communities safe on @CNN with @JohnKingCNN .", "2020-05-05T18:13:55.000Z": "As part of Stay At Home 2.0, the state began distribution of free masks for businesses today at DMV locations around the state. Businesses can request masks at http:// nheconomy.com/covid . #ReadyNH  #COVID19  #GraniteStrong", "2020-05-05T17:07:38.000Z": ". @zoom_us calls just got an upgrade thanks to these picture perfect New Hampshire backgrounds. Download yours today to show off your #603Pride ! https:// visitnh.gov/trip-ideas/dis cover/zoom-backgrounds ", "2020-05-05T16:21:00.000Z": "Looking forward to joining @JohnKingCNN on @CNN in a few minutes to talk about reopening New Hampshire in a smart, phased approach, and our new stipend for first responders. #COVID19", "2020-05-05T01:17:26.000Z": "Awesome work, Connor! #603Pride 10-year-old raises thousands of dollars for food pantry in Meredith The Meredith Emergency Food Pantry got a special delivery recently thanks to a fundraising fourth-grader. wmur.com", "2020-05-04T23:33:40.000Z": "Whether it's making PPE available to eligible businesses preparing to reopen, providing stipends for first responders, or making $40 million in relief funds available to cities and towns across NH, we're doing everything we can to support those on the front lines of this crisis.", "2020-05-04T20:14:36.000Z": "Thanks for watching, and happy birthday! #603Pride Quote Tweet Jenna Calcavecchia @JennaCal Thank you for the warm birthday wishes @GovChrisSununu this absolutely BRIGHTENED my day!!", "2020-05-04T19:22:06.000Z": "Local departments can fill out a form to submit their personnel, which will be up by the end of today, on the @NH_DeptSafety 's website at https:// nh.gov/safety/ .", "2020-05-04T19:22:05.000Z": "Our police, fire, and EMS first responders risk their lives every day they leave their house, and that risk is even greater as we combat #COVID19 . Using #CARESAct funding, a stipend will be made available to these brave heroes who keep our communities safe and strong.", "2020-05-04T19:20:58.000Z": "Today, @nhgoferr is announcing the allocation of $40 million to NH communities impacted by #COVID19 to help cover expenses incurred by towns. Every town will be able to be reimbursed. Additional guidance will be released today on http:// goferr.nh.gov Click to learn more www.goferr.nh.gov", "2020-05-04T19:18:39.000Z": "NH has had great success in securing PPE, and thanks to those efforts, any business allowed to reopen under our Stay at Home 2.0 guidance is eligible for free masks from the state for their employees & customers. Over 2,100 requests have been made to date. Click below to request: Click to request for your business prd.blogs.nh.gov", "2020-05-04T18:17:56.000Z": "We'll have all the latest info for you in about 45 minutes. https:// wmur.com/article/new-ha mpshire-coronavirus-update-may-4-2020/32365867  via @TomGriffithWMUR PPE made available for all businesses opening under new order As some New Hampshire businesses prepare to reopen amid the COVID-19 pandemic, Gov. Chris Sununu said Monday they will have access to free personal protective equipment provided by the state. wmur.com", "2020-05-04T18:50:01.000Z": "WATCH LIVE ONLINE: @GovChrisSununu to give update on COVID-19 efforts in #NH . It's scheduled to start at 3 p.m. Watch it live on http:// wcax.com  https:// wcax.com/content/news/N H-stay-at-home-until-May-31-restricted-opening-of-businesses-570179081.html ", "2020-05-04T18:15:57.000Z": "Mobile testing will be available in Concord tomorrow, May 5. Anyone who has a symptom or symptoms should contact their healthcare provider to discuss testing. If you don't have a provider, call 271-5980.", "2020-05-04T17:48:07.000Z": "It's #TeacherAppreciationWeek ! THANK YOU to all of NH's educators who have worked tirelessly to ensure that the Granite State is leading the nation in remote learning, and for your continued work to provide our kids with a quality education. Keep up the great work! #603Pride", "2020-05-04T16:53:35.000Z": "Holding a press conference today at 3 PM to provide a #COVID19 update. Click below to watch live: Click to watch live at 3 PM www.wmur.com", "2020-05-04T13:52:59.000Z": "Love this! Thank you for your great leadership and for encouraging our students @GovChrisSununu  Quote Tweet Ms Katie Sullivan @ksullivanH4 Today's Lancer ShoutOut is from our Governor Chris Sununu....Keep Leading The Way Londonderry @GovChrisSununu  @Londonderry_lhs  @LondonderryUSA", "2020-05-04T12:58:28.000Z": "Today's Lancer ShoutOut is from our Governor Chris Sununu....Keep Leading The Way Londonderry @GovChrisSununu  @Londonderry_lhs  @LondonderryUSA", "2020-05-04T00:05:09.000Z": "17 years ago we lost a treasured New Hampshire icon - The Old Man of the Mountain. Till this very day he resembles the true essence of what it means to be a Granite Stater. #603Pride", "2020-05-03T17:48:27.000Z": "Some deep #HomeHikeChallenge conversations happening here.  We are so fortunate to love where we live. @GovChrisSununu , thanks for the measured guidance rolled out this week so we can move forward in a safe way.", "2020-05-03T16:31:12.000Z": "", "2020-05-03T00:47:41.000Z": "Looking forward to joining @foxandfriends tomorrow with @jasoninthehouse around 8:15 AM. Hope you can tune in.", "2020-05-02T23:48:02.000Z": "Today is #EMSAppreciationDay in New Hampshire! We're grateful for the critical role EMS providers play in keeping Granite State communities healthy and strong, especially as we navigate this public health crisis. THANK YOU for all you do! #603Pride", "2020-05-02T18:31:32.000Z": "... @GovChrisSununu , thank you for your steadfast support of #NH brewers. #603Pride", "2020-05-02T14:49:40.000Z": "Are you a retailer, barber, restaurant, manufacturer, or other business planning to reopen as part of Stay-at-Home 2.0?\n\nThe state is making face coverings available for your employees & customers. Fill out the form below & pick up at any NH DMV next week. Mask Order Form for Businesses The Business Mask Order program has been incredibly successful. The State of NH has received over 15,000 requests totaling more than 7 million masks. That translates to over 12,750 businesses... prd.blogs.nh.gov", "2020-05-02T13:58:59.000Z": "Awesome discovery today. \nI've lived on the seacoast for 17 years and never knew this amazing spot just 10 minutes from my home was here. Comment with where you think this spot is and share your own #HomeHikeChallenge hidden gems!", "2020-05-02T00:22:20.000Z": "Right now the people of New Hampshire are focused on getting through this unprecedented and challenging time. They do not have the time nor patience for these wasteful politically driven lawsuits and partisan attacks. Quote Tweet John DiStaso @jdistaso BREAKING: Democratic lawmakers tell judge they now have standing to sue @GovChrisSununu over use of #COVID19 funding; Separation-of-powers dispute reignited by motion for reconsideration, amended complaint, JUST FILED in Superior Court #nhpolitics  #WMUR", "2020-05-01T20:56:35.000Z": "I'll be live with @WMUR9 tonight at 5:30 answering your #COVID19 questions and the Stay at Home 2.0 Order I announced today. Tune-in!", "2020-05-01T20:02:30.000Z": "Today's guidance documents can also be found here: 5.1.2020 Governor Chris Sununu Issues Stay at Home Order 2.0 Emergency Order #40 Extending and modifying Emergency Order #17 (Closure of non-essential businesses and requiring Granite Staters to stay at home) Exhibit A to Emergency Order #40 - Essential Busi... businesshelp.nheconomy.com", "2020-05-01T19:48:33.000Z": "For comprehensive information on today's Stay at Home Order 2.0, and to read industry-specific guidance, click below. Click to view all Stay at Home Order 2.0 guidance www.governor.nh.gov", "2020-05-01T19:44:16.000Z": "Stakeholder experts were consulted, our Economic Reopening Taskforce formulated this guidance, and officials from public health have vetted it. Safety is always first. For the full restaurant guidance read below or click here: https:// governor.nh.gov/news-media/sta y-at-home/documents/20200501-restaurants.pdf ", "2020-05-01T19:44:05.000Z": "RESTAURANTS: While many restaurants continue to operate with takeout and delivery, we are announcing today that restaurants may choose to start offering outdoor seating at their restaurants starting on May 18. All health and safety guidelines must be met. Click to view guidance www.governor.nh.gov", "2020-05-01T19:40:01.000Z": "RETAIL: Effective Monday, May 11, retail locations may open in accordance with new public health guidelines. Additional retail-industry specific guidance will be made available shortly. Click to view guidance www.governor.nh.gov", "2020-05-01T19:38:36.000Z": "HAIR: Starting Monday May 11 barbers & hair salons may open in accordance with strict guidelines developed in coordination with the NH Association of Cosmetologists. PPE will be made available to those that wish to open. More info available at http:// nh.gov/covid19 this weekend Click to view guidance www.governor.nh.gov", "2020-05-01T19:34:59.000Z": "GOLF: Effective Monday, May 11, private and public golf courses may open in accordance with new health guidance. Participants are limited to NH residents and club members only. Click to view guidance www.governor.nh.gov", "2020-05-01T19:32:30.000Z": "Effective immediately, campgrounds across the state may choose to stay open in accordance with new health guidelines - but access is limited only to NH residents and members. Click to view guidance https://t.co/aJX44M4zO0", "2020-05-01T19:11:13.000Z": "These are steps to reopen our economy in a smart, phased approach that are supported by facts, science, data, and state health officials. Every decision we made regarding this plan was informed by data, and every decision has the backing of @NHPubHealth . (2/2)", "2020-05-01T19:11:09.000Z": "Today I am announcing our Stay at Home Order 2.0 - a plan developed with @NHPubHealth allowing us to modify and flex out our existing order to safely provide Granite Staters with additional flexibility in their daily lives. This order remains in effect until May 31, 2020. (1/2)", "2020-05-01T18:55:40.000Z": ". @GovChrisSununu to speak at 3pm on #NH 's stay-at-home order & Re-Opening the economy. Watch live here - https:// wmur.com/article/new-ha mpshire-coronavirus-stay-at-home-order-updates/32343346 ", "2020-05-01T18:55:02.000Z": "WATCH LIVE ONLINE: @GovChrisSununu will give an update on COVID-19 efforts in #NH . It's scheduled to start at 3 p.m. Watch it live on http:// wcax.com . https:// wcax.com/content/news/S ununu-to-give-update-on-COVID-19-efforts-in-New-Hampshire-570119071.html ", "2020-05-01T14:24:07.000Z": "Today at 3 PM I'll be holding a press conference to discuss New Hampshire's Stay at Home Order and to provide a #COVID19 update. Click below to watch live: Watch live at 3 PM www.wmur.com", "2020-05-01T12:40:07.000Z": "#COVID19 TESTING: Mobile testing will be available in Laconia on Friday, Sunapee on Saturday, and Keene on Sunday. Anyone who has a symptom or symptoms should contact their healthcare provider to discuss testing. If you don't have a provider, call 2-1-1.", "2020-04-30T22:46:04.000Z": "Today NH secured another shipment with over 110,000 pounds of PPE. When we heard @DeptVetAffairs was in need, we agreed to secure them 4.5 million masks to ensure that those on the frontlines of caring for our veterans have the protection they deserve. NH gets the job done.", "2020-04-30T21:05:34.000Z": "HAPPENING NOW: @FedEx cargo plane carrying 110,000 pounds of #PPE arrives at @flymanchester . @GovChrisSununu says it's the largest PPE shipment to arrive in #NH to date - and 4.5 million masks onboard are destined for @DeptVetAffairs hospitals nationwide. #Covid_19  #WMUR  @WMUR9", "2020-04-30T15:10:29.000Z": "BREAKING: 110K+ pounds of PPE is on its way to NH. As part of this shipment, the state of NH is sending roughly 4.5M masks to @DeptVetAffairs to help VA Hospitals across the country. When VA @SecWilkie reached out to me I knew this was a mission New Hampshire could take on. (1/4)", "2020-04-29T19:26:46.000Z": "What a way to make my day!!! Thank you @ChrisSununu !!", "2020-04-29T23:36:38.000Z": "In recent days we've taken significant steps to increase and expand NH's testing capacity, including the creation of five new strategic testing sites for those unable to access hospital based clinics, and expanded mobile testing. NH expands COVID-19 testing capabilities CONCORD - New Hampshire on Wednesday announced increased testing capabilities while reporting six more COVID-19-related deaths and 50 more cases.The state has now seen 66 deaths and 2,054 cases to... seacoastonline.com", "2020-04-29T19:20:17.000Z": "Provide additional dollars directly to shelters to assist them with the increased costs they are faced with due to the COVID pandemic Additional dollars will be provided to community agencies to support permanent housing for individuals and families experiencing homelessness", "2020-04-29T19:20:16.000Z": "THREAD: Individuals experiencing homeless are vulnerable citizens. In these times, their vulnerability is intensified.\n\nToday we are announcing the release of funds to assist homeless shelters in our state meet the increased demands they are facing during the #COVID19 pandemic.", "2020-04-29T19:14:41.000Z": "\"We want to make sure those barriers are down, everyone can get testing.\" - @GovChrisSununu describing in-depth in #COVID19 briefing the various ways symptomatic individuals can obtain a test in NH. #WMUR", "2020-04-29T19:16:07.000Z": "Additionally, VNA clinical staff will respond to the homes of individuals who have barriers to accessing one of the specimen collection testing locations. Interpretation services are available at all of these clinics and through the Visiting Nurses Association.", "2020-04-29T19:16:06.000Z": "Lancaster - The National Guard Armory Plymouth - The National Guard Armory Rochester - The National Guard Armory Tamworth - The DMV Claremont - Claremont Elementary School", "2020-04-29T19:16:05.000Z": "Anyone with a symptom for #COVID19 can call their medical provider and request a test We have expanded access to testing so that those not near a hospital can now drive to one of five locations across the state after having been approved for a test by their medical provider", "2020-04-29T19:16:04.000Z": "THREAD: Yesterday, I discussed our goal to ramp up the number of tests performed to 1,500 a day. A few key things you should know about our efforts as we move forward:", "2020-04-29T19:08:09.000Z": "THREAD: On Friday, May 1, we will make an announcement regarding the future of our stay at home order.", "2020-04-29T18:54:39.000Z": "Live at 3 pm: Listen to NHPR and http:// NHPR.org as @GovChrisSununu gives an update on NH's response to #coronavirus Coronavirus Update: N.H. Cases Top 2,000; Sununu Gives Schools Budget Flexibility NHPR is continuing to cover the developing story around coronavirus in New Hampshire. Bookmark this page for the latest updates. nhpr.org", "2020-04-29T18:41:42.000Z": "LIVE AT 3: @GovChrisSununu is joining state officials for a coronavirus briefing. 6 new deaths attributed to COVID-19; 2 new long-term-care facility outbreaks identified Six more deaths linked to COVID-19 were announced Wednesday, as health officials said two more outbreaks of the coronavirus were identified at long-term care facilities. mynbc5.com", "2020-04-29T18:50:07.000Z": "WATCH LIVE: Sununu COVID-19 update https:// wcax.com/content/news/S ununu-to-hold-COVID-19-media-briefing-570046531.html ", "2020-04-29T18:46:17.000Z": "Live at 3: Governor holding COVID-19 briefing 6 new deaths attributed to COVID-19; 2 new long-term-care facility outbreaks identified Six more deaths linked to COVID-19 were announced Wednesday, as health officials said two more outbreaks of the coronavirus were identified at long-term care facilities. wmur.com", "2020-04-29T17:25:08.000Z": "Just in time for @Israel 's 72nd Birthday @GovChrisSununu sent us this proclamation. Thank you @NHgov for your friendship & support. \n\nThank you New England for celebrating with us.", "2020-04-29T17:24:07.000Z": "Holding a press conference today at 3 PM to provide a #COVID19 update. Click below to watch live: Click to watch LIVE at 3 PM www.wmur.com", "2020-04-28T19:13:25.000Z": "Visit http:// GOFERR.nh.gov and follow @nhgoferr to stay up-to-date on all the latest information from the Governor's Office for Emergency Relief and Recovery. Quote Tweet Governor's Office for Emergency Relief & Recovery @nhgoferr Welcome to GOFERR! \n\nFor information related to the Governor's Office of Emergency Relief and Recover, visit our new website: https:// goferr.nh.gov/welcome", "2020-04-27T22:04:04.000Z": "Proud to have proclaimed April as Child Abuse Prevention Month. In the wake of #COVID19 , we've acted decisively to increase resources in place to provide for NH's vulnerable children. Thanks to @NHChildrenTrust for sharing this inspiring video! #603Pride Child Abuse Prevention Month youtube.com", "2020-04-27T19:20:47.000Z": "We are ramping up our testing, and these new efforts will help guide our decision making in the weeks ahead. (5/5)", "2020-04-27T19:20:46.000Z": "THREAD: Over the coming days and weeks, @NHPubHealth is embarking on a community-based campaign to increase testing to 1,500 residents daily. (1/5)", "2020-04-27T18:59:26.000Z": "I am finishing up a call with @POTUS , @VP , and Governors from across the country. We will hold our #COVID19 press conference once the call concludes. We appreciate everyone's patience. Quote Tweet WMUR TV @WMUR9 Live at 3: COVID-19 briefing held by governor, state officials https:// wmur.com/article/new-ha mpshire-coronavirus-update-april-27-2020/32289278 ", "2020-04-27T18:54:55.000Z": "LIVE AT 3: @GovChrisSununu joins state officials for a coronavirus briefing. New Hampshire aims to open testing for anyone with COVID-19 symptoms The state is aiming to conduct 1,500 coronavirus tests per day, with the goal to make testing available for any Granite Staters with COVID-19 symptoms, state officials announced Monday. mynbc5.com", "2020-04-27T15:58:06.000Z": "Live at 3: COVID-19 briefing held by governor, state officials State aims to open testing for anyone with COVID-19 symptoms The state is aiming to conduct 1,500 coronavirus tests per day, with the goal to make testing available for any Granite Staters with COVID-19 symptoms, state officials announced Monday. wmur.com", "2020-04-27T18:50:01.000Z": "Watch Live: #NH  @GovChrisSununu to provide COVID-19 update https:// wcax.com/content/news/S ununu-to-provide-COVID-19-update-569980781.html ", "2020-04-27T16:56:05.000Z": "@GovChrisSununu Thanks for the birthday card to my daughter for her 11th birthday!", "2020-04-27T16:04:09.000Z": "Holding a press conference today at 3 PM to provide a #COVID19 update. Watch live: State aims to open testing for anyone with COVID-19 symptoms The state is aiming to conduct 1,500 coronavirus tests per day, with the goal to make testing available for any Granite Staters with COVID-19 symptoms, state officials announced Monday. wmur.com", "2020-04-27T00:10:48.000Z": "Another night signing birthday cards for Granite Staters of all all ages. We've had thousands of requests come in from moms and dads, grandparents, aunts and uncles, and friends. Happy to send one to all. Click here to request a card: https:// new-hampshire.secure.force.com/support/GOV_Re quest_A_Birthday ", "2020-04-26T02:12:02.000Z": "DHART on scene and road remains closed. #NHTraffic", "2020-04-24T22:28:53.000Z": "While the @forestservice has made the tough call to temporarily close several @WhiteMountainNF trailheads, you can still get outdoors this weekend by going for a #HomeHikeChallenge along a trail or path right in your backyard. Officials shut down several WMNF trailheads amid COVID-19 concerns The trailheads and recreational sites are closed until further notice. Officials cited \"unseasonably high\" numbers of visitors to forest, raising concerns about the potential spread of the coronavi... wmur.com", "2020-04-24T22:01:12.000Z": "Right Now: @GovChrisSununu extends New Hampshire's state of emergency declaration to May 15th. This is different than the state's stay-at-home order which is still set to expire on May 4th.", "2020-04-23T18:41:26.000Z": "Thank you @GovChrisSununu for speaking this out loud for all of us small businesses in #NH ! Quote Tweet Chris Sununu @GovChrisSununu I'm calling on legislators to repeal the business tax triggers included in last year's State budget.\n\nRaising business taxes on our small businesses for something out of their control is the wrong approach. We must provide relief for our job creators.", "2020-04-23T18:39:41.000Z": "I'm calling on legislators to repeal the business tax triggers included in last year's State budget.\n\nRaising business taxes on our small businesses for something out of their control is the wrong approach. We must provide relief for our job creators.", "2020-04-23T18:29:07.000Z": "There are areas where we now know we can't use these funds.\n\nThis money can't be used by the state or municipalities to address revenue shortfalls, and per @USTreasury guidance, it can't be used to backfill our budgets. \n\nDespite what some may say, it just isn't true. (4/6)", "2020-04-23T18:29:06.000Z": "As I have repeatedly stated, we will dispense these funds in a transparent, accountable manner. Our Stakeholder Advisory Board and Legislative Advisory Board have met regularly and will continue to do so in the days and weeks to come. (2/6)", "2020-04-23T18:29:05.000Z": "THREAD: Earlier this week, the State received the second half of our #CARESAct funding. There is now 1.25 billion dollars deposited in the State's accounts. That is an incredible responsibility - one that we take very seriously. (1/6)", "2020-04-23T18:16:47.000Z": "Today's #COVID19 briefing with @GovChrisSununu is about to get underway. Watch here: Quote Tweet WMUR TV @WMUR9 Live at 2:15: Gov. Sununu holds latest COVID-19 briefing https:// wmur.com/article/new-ha mpshire-coronavirus-update-april-23-2020/32254272 ", "2020-04-23T17:00:24.000Z": "Live at 2:15: Gov. Sununu holds latest COVID-19 briefing 3 new COVID-19 deaths related to institutional outbreaks in NH, officials say New Hampshire officials on Thursday announced three additional deaths that they said are connected to COVID-19 outbreaks at long-term care facilities in the state. wmur.com", "2020-04-23T18:05:02.000Z": "WATCH LIVE: Sununu to provide COVID-19 update https:// wcax.com/content/news/N ew-Hampshire-governor-gets-OK-to-spend-money-after-lawsuit-569864251.html ", "2020-04-23T17:43:09.000Z": "Holding a press conference at 2:15 to provide a #COVID19 update. Click below to watch live: Watch LIVE at 2:15 PM www.wmur.com", "2020-04-23T13:53:33.000Z": "The Governor's Economic Re-Opening Task Force is holding their 2nd meeting at 3 PM today. We appreciate your patience as we work to increase accessibility. 500 people called-in to yesterday's meeting, but if you were unable to join us, a recording is here: NH Economy : Welcome nheconomy.com", "2020-04-22T21:55:44.000Z": "The Governor's Economic Re-Opening Task Force held their first meeting today to begin examining when is best to re-open NH based on science and data. Re-opening won't be like flipping a switch, and we're making sure public health is at the forefront of our decisions.", "2020-04-22T20:36:32.000Z": "Answering your questions LIVE on @WMUR9 tonight at 5:30. Hope you'll tune in! Gov. Sununu responds to viewer questions regarding COVID-19 in NH The governor was live in WMUR's studios Wednesday during News 9 at 5:30 to answer viewer questions about the COVID-19 outbreak. wmur.com", "2020-04-22T19:29:30.000Z": "THANK YOU @casanh ! #603Pride Quote Tweet WMUR TV @WMUR9 CASA Appreciation Day recognizes group that advocates on behalf of children https:// wmur.com/article/casa-a ppreciation-day-recognizes-group-that-advocates-on-behalf-of-children/32238718 ", "2020-04-22T18:41:03.000Z": "BREAKING: Judge Dave Anderson has dismissed the lawsuit filed by the four legislators seeking to hold up #COVID19 funding. In this unprecedented public health emergency, it is paramount that we get relief out to NH families fast, and that is what I am determined to do.", "2020-04-22T17:51:56.000Z": "On this #EarthDay50 , we're reminded of just how fortunate we are as Granite Staters to call such a beautiful state our home. \n\nThis year looks a little different than hiking the Appalachian Trail, but there's no better way to get outdoors than by going for a #HomeHikeChallenge !", "2020-04-22T15:47:47.000Z": "The Governor's Economic Re-Opening Task Force is scheduled to hold their first meeting at 4 PM today to begin examining when is the right time to re-open our economy, according to science and data, and how best to do so. Listen in:\n\nCall in: 1-800-356-8278\nPin: 125563", "2020-04-22T12:36:27.000Z": "A HUGE thank you to @GovChrisSununu , Dr. Benjamin Chan and NH DHHS Commissioner Lori Shibinette for joining us on the @AARPNH tele-town hall about COVID-19. Thank you also to our 6,000 attendees! @AARPadvocates", "2020-04-22T14:46:03.000Z": "Thank you @GovChrisSununu for remembering #YomHaShoah , #IsraeliHolocaustRemembranceDay with us and taking a stance against #antisemitism . #NeverAgain  #UnitedInMemory  Quote Tweet Chris Sununu @GovChrisSununu Today on #YomHashoah we remember the 6 million innocent Jews that lost their lives during the Holocaust, the families that lost their loved ones, the resilience of the survivors, and the heroism of those that risked their lives to save the innocent. #HolocaustRemembranceDay", "2020-04-22T00:10:18.000Z": "Big thanks to @GovChrisSununu for honoring @casanh tomorrow!! #CASAAwarenessDay And for the wonderful accolades for the hard work #CASA  #volunteers do for NH's abused and neglected children. #itsaboutthekids", "2020-04-21T19:16:00.000Z": "I empathize with those who want to rush back to normal - but we must appreciate that we will not be in normal times for quite awhile. It's how we approach and tackle these new norms that will define how we will get out of this crisis. (6/7)", "2020-04-21T19:15:59.000Z": "Their mission is to examine how we can start to re-open some sectors of our economy in phases at the appropriate time, guided by public health - which will always come first. (3/7)", "2020-04-21T19:15:58.000Z": "Here in New Hampshire, we have been looking at how we can reopen our state and our economy in a smart, phased approach - rooted in science and data - for quite some time. (1/7)", "2020-04-21T18:57:15.000Z": "LIVE AT 3: New Hampshire @GovChrisSununu joins state officials for a COVID-19 briefing. LIVE: Gov. Sununu joins state health officials for coronavirus briefing mynbc5.com", "2020-04-21T18:50:01.000Z": "Watch Live: Sununu COVID-19 update https:// wcax.com/content/news/N H-health-care-professionals-call-on-Sununu-to-increase-testing-569820241.html ", "2020-04-21T16:21:05.000Z": "Live at 3: Gov. Sununu to give new updates at COVID-19 briefing Sununu announces reopening task force as COVID-19 numbers continue to plateau in NH Gov. Chris Sununu said Tuesday that New Hampshire will take a phased approach to reopening after the COVID-19 crisis begins to subside. wmur.com", "2020-04-21T17:38:28.000Z": "On the phone now with @AARP , Dr. Chan, and Commissioner Shibinette\nfor a Tele-Town Hall meeting with NH seniors to discuss the steps we've taken to combat #COVID19 , the steps we can all take as we confront this pandemic, and to address any community concerns.", "2020-04-21T16:25:05.000Z": "Holding a press conference today at 3 to provide a #COVID19 update. Tune-in. Watch LIVE at 3 PM www.wmur.com", "2020-04-20T23:23:04.000Z": "Today on #YomHashoah we remember the 6 million innocent Jews that lost their lives during the Holocaust, the families that lost their loved ones, the resilience of the survivors, and the heroism of those that risked their lives to save the innocent. #HolocaustRemembranceDay", "2020-04-20T22:10:16.000Z": "Democrats in the legislature are focused on inside baseball & playing politics - something I don't have time for, & the people of NH don't care about. I'm focused on increasing testing capacity, securing PPE for frontline workers, and delivering immediate relief for NH families.", "2020-04-20T17:12:07.000Z": "Governor offers to send birthday cards to Granite State children Governor offers to send birthday cards to Granite State children With children across New Hampshire forced to cancel or postpone their birthday parties because of social distancing, the governor is stepping in to help make their big days a little more special. wmur.com", "2020-04-20T19:11:12.000Z": "REOPENING THE ECONOMY: Is #COVID19 testing the key to getting Americans back to work and the economy back online? @GovChrisSununu of New Hampshire to @KellyCNBC : \"it's a huge part of the equation\" @CNBCTheExchange  @CNBC", "2020-04-20T19:24:27.000Z": " @GovChrisSununu is offering to send #NewHampshire kids #birthday cards. @MyNBC5 Details Gov. Sununu offers to send birthday cards to Granite State children With children across New Hampshire forced to cancel or postpone their birthday parties because of social distancing, the governor is stepping in to help make their big days a little more special. mynbc5.com", "2020-04-20T15:58:22.000Z": "Looking forward to joining @CNBCTheExchange today around 1:30 PM to discuss New Hampshire's response to #COVID19 . You can watch live on @CNBC .", "2020-04-19T22:01:59.000Z": "A mom messaged me saying her son was sad because he couldn't celebrate his birthday with friends due to #COVID19 , but that it'd be \"cool to get a birthday card from the Gov, and I'm guessing a lot of other kids would think so too!\" Happy to do so. \n\nClick below to request a card. Click to request a child's birthday card from Chris Sununu new-hampshire.secure.force.com", "2020-04-18T23:03:15.000Z": "In just two weeks, NH has acquired well over 7 MILLION pieces of PPE. These vital supplies are being made available at no cost to those on the front lines of #COVID19 . Many thanks to @Boeing , Dean Kamen, and @NHNationalGuard for making this possible. NH is getting the job done.", "2020-04-18T16:44:36.000Z": "Another life-saving delivery of PPE has arrived in NH. Thanks to Dean Kamen for facilitating this deal, and to @Boeing for donating the cost of this mission transport. The state will deliver these masks to the greatest areas of need & to those on the frontlines fighting #COVID19 .", "2020-04-18T16:27:30.000Z": "Our first COVID-19 airlift mission is complete. We carried 500K+ medical-grade face masks from China to New Hampshire. \nOur partnership with @FIRSTweets ' Dean Kamen, and @GovChrisSununu will help protect frontline healthcare workers in that state. \nMore: https:// bit.ly/3cxZYct", "2020-04-18T15:39:07.000Z": "I am joining Dean Kamen, @GovChrisSununu , @SenatorShaheen , @Boeing CEO Dave Calhoun, and members of the @NHNationalGuard to receive another shipment of emergency PPE in Manchester today. \n\nThank you Dean and our public and private partners who made this happen.", "2020-04-18T15:34:56.000Z": "#603Pride", "2020-04-18T15:07:37.000Z": "Thanks to @Boeing CEO Dave Calhoun for donating a shipment of 3D printed face shields to NH!", "2020-04-18T15:05:36.000Z": "", "2020-04-18T12:02:14.000Z": "Thanks to @Boeing for donating the cost of the mission transport. The 500k masks the state of NH purchased will help and protect those on the front lines fight #COVID19 .", "2020-04-18T11:12:56.000Z": "This morning, I'll join Dean Kamen, @Boeing CEO Dave Calhoun, the @NHNationalGuard , and members of New Hampshire's Congressional delegation at @flymanchester to unload over 500K medical grade face masks for NH as we continue to respond to the #COVID19 global pandemic.", "2020-04-18T00:03:42.000Z": "ATTENTION! Due to the high volume of traffic to our website at this time some people are experiencing difficulty donating. You can also make a donation by visiting http:// NHunity.givesmart.com or texting NHunity to 76278! THANK YOU FOR YOUR SUPPORT!! NHunity - Powered By GiveSmart Help New Hampshire Food Bank spread the word about e.givesmart.com", "2020-04-17T19:19:57.000Z": "Today, we are please to announce that @samhsagov has awarded New Hampshire a $2 million grant to assist individuals impacted by mental health and substance use disorders during the #COVID19 pandemic. (1/2)", "2020-04-17T19:17:34.000Z": "In addition to those funds, over $6 million in zero-interest loans have also been approved to over 40 other facilities across the Granite State (2/2)", "2020-04-17T19:17:33.000Z": "Through the #COVID19 Emergency Healthcare System Relief Fund, we are announcing new recipients of zero-interest loans - approved by a committee of state officials from the Dept. of Health and Human Services, Dept. of Revenue Administration, and the Dept. of Justice (1/2)", "2020-04-17T18:56:01.000Z": "LIVE AT 3: @GovChrisSununu joins state health officials for a coronavirus briefing. LIVE: Gov. Sununu joins state officials for coronavirus briefing mynbc5.com", "2020-04-17T19:01:19.000Z": "The #COVID19 briefing with @GovChrisSununu will get underway momentarily. Watch here: Quote Tweet WMUR TV @WMUR9 Live at 3: Gov. Sununu holds COVID-19 briefing https:// wmur.com/article/new-ha mpshire-coronavirus-update-april-17-2020/32188170 ", "2020-04-17T17:47:40.000Z": "New Hampshire is in a unique position among our fellow Northeastern states. Here's my response on how we're looking at a regional approach to reopening the economy:", "2020-04-17T17:47:29.000Z": "Holding a press conference at 3 PM to provide an update on the state's response to #COVID19 . Click below to watch live. Watch LIVE at 3:00 PM www.wmur.com", "2020-04-17T16:55:34.000Z": "Best way to prepare for TV hits and get through the days on little sleep is cold brew from @LucasRoasting Company in Wolfeboro, NH! They ship their delicious cold brew to six New England states! #603Pride", "2020-04-17T16:27:55.000Z": "Thanks @TSRobertsNH . This relief is critical to keeping our crisis centers running. Glad we could expedite this funding to provide these resources to @NHCADSV . Quote Tweet Starting Point @NHStartingPoint \"Dear @GovChrisSununu , I want to thank you for the care and regard you have shown for victims of domestic and sexual violence and at risk children during this public health crisis.\"- @TSRobertsNH  @NHCADSV  #nhpolitics", "2020-04-17T16:09:41.000Z": "Looking forward to joining @chucktodd on @MSNBC this afternoon at 1:00 PM. We'll be talking about New Hampshire's response to #COVID19 .", "2020-04-17T15:52:05.000Z": "Tune in at 7PM tonight on @WMUR9 or @iHeartRadio to watch the program. If you're able to donate to this worthy cause, you can text \"NHUnity\" to 76278 or online at http:// nhfoodbank.org/projectcommuni ty   #NHTogetherFromHome", "2020-04-17T15:52:04.000Z": "As soon as I heard about @WMUR9 and @iHeartRadio 's NH Together From Home event tonight benefitting @NHFB I made a few calls. The response has been incredible. This AM I picked up a $25K check from Matt and Stacey Connors of Gemini Electric and hand delivered it to the Food Bank.", "2020-04-17T14:24:41.000Z": "Quote Tweet Chris Johnston @reporterchris The governor of New Hampshire is involved in talks with the NHL. twitter.com/KenLairdWEEI/s", "2020-04-17T12:50:51.000Z": "Joining @GregHillWEEI on @WEEI around 9:00 AM talking New Hampshire's response to #COVID19 .", "2020-04-16T23:20:03.000Z": "Coming up shortly: I'll be joining @marthamaccallum on @FoxNews talking New Hampshire's response to #COVID19 .", "2020-04-16T18:16:59.000Z": "Ensuring students continue to receive a quality education has been an all-hands-on-deck effort. Read my letter to the educators, administrators, parents, teachers, bus drivers, food service workers, custodial staff, and of course, students, who have made remote learning a success", "2020-04-16T18:13:57.000Z": "Earlier today, I informed Superintendents across New Hampshire that we will continue remote learning for the remainder of the school year. (1/3)", "2020-04-16T18:10:25.000Z": "Our hearts are with the families and loved ones of those we lost to #COVID19 today.", "2020-04-16T18:02:11.000Z": "New Hampshire Gov. Chris Sununu is joining state officials for a COVID-19 briefing. Sununu: All NH schools will continue remote learning for rest of school year All public and private schools in New Hampshire will remain closed for the rest of the school year, and students will continue remote learning, the governor announced Thursday. mynbc5.com", "2020-04-16T17:55:02.000Z": "WATCH LIVE ONLINE: @GovChrisSununu to discuss COVID-19 efforts in #NH - scheduled to start at 2 p.m. https:// wcax.com/content/news/N H-stakeholders-to-discuss-COVID-19-relief-aid-569692461.html ", "2020-04-16T16:40:06.000Z": "Live at 2: Gov. Sununu gives latest updates at COVID-19 briefing All NH schools will continue remote learning for rest of school year, governor says All public and private schools in New Hampshire will remain closed for the rest of the school year, and students will continue remote learning, the governor announced Thursday. wmur.com", "2020-04-16T16:48:03.000Z": "I'm holding a press conference today at 2 PM to provide an update on the state's response to #COVID19 . Watch live: Watch live at 2 PM www.wmur.com", "2020-04-16T12:08:04.000Z": "AWESOME news! THANK YOU to the incredible team at @LRGhealthcare and all of our front line workers. #603Pride Quote Tweet Cherise Leclerc @CheriseWMUR Great news! @LRGHealthcare discharges its FIRST COVID-19 patient today! His daughter says she is so thankful to the medical staff and can't wait to hug her dad when the crisis is over. We'll have his story of survival tonight on #WMUR", "2020-04-15T23:33:05.000Z": "Thank you ... @GovChrisSununu  and ... @NH_DOJ  AG Gordon MacDonald for always standing with victims of domestic & sexual violence. During these unprecedented times, victims need to know that help will be available to them. We are so grateful for your efforts! #nhpolitics", "2020-04-15T23:42:15.000Z": "#603Pride Quote Tweet Seacoastonline.com @seacoastonline \"It was something that police and fire could do rather easily to show how much we value and care about our vital health-care staff and workers, who are all of our true heroes,\" Exeter Police Chief Stephan Poulin says. https:// seacoastonline.com/news/20200415/ first-responder-caravan-thanks-exeter-hospital-workers ", "2020-04-15T21:30:44.000Z": "In-studio with the dynamic duo @JeanWMUR and @TomGriffithWMUR , answering your until 6:00 PM on @WMUR9 !", "2020-04-15T20:51:03.000Z": "Will be live on @WMUR9 from 5:30 - 6:00 PM answering YOUR questions. Tune in.", "2020-04-15T18:36:09.000Z": "WATCH: NH @GovChrisSununu joins #DailyBriefing to discuss when to reopen the economy, and how his state is combating COVID-19.", "2020-04-15T18:03:21.000Z": "Coming up: I'm Skyping into the @dailybriefing from the Statehouse - watch on @FoxNews now.", "2020-04-15T17:08:40.000Z": "Joining @DanaPerino on the @dailybriefing right at 2:00 PM. Talking about New Hampshire's response to #COVID19 - catch it on @FoxNews .", "2020-04-15T14:04:34.000Z": "To ensure that NH's most vulnerable individuals receive uninterrupted care, I've announced a $300 weekly stipend for frontline workers at many residential facilities & social service organizations, as many are struggling to retain the workforce they need. Extra pay, expanded testing for front-line workers CONCORD - Gov. Chris Sununu announced dramatic steps against COVID-19 Tuesday, including tests of all workers at long-term care centers in the two hardest-hit counties and $300 a week in unionleader.com", "2020-04-14T22:29:06.000Z": "NH boosts pay, testing for nursing home workers Nursing home workers to get more money, virus testing CONCORD, N.H. (AP) - Front-line workers at New Hampshire nursing homes and other long-term care facilities will get extra pay and many will be tested for the coronavirus, Gov. Chris Sununu said... apnews.com", "2020-04-15T11:50:01.000Z": "#HomeHikeChallenge in Hopkinton", "2020-04-14T21:16:26.000Z": "Today I was asked about the four legislators who are suing us in an effort to delay the emergency spending required to respond to #COVID19 at a rapid pace. Getting relief out quickly to our citizens is critical.", "2020-04-14T19:03:47.000Z": "Public health first. Always.", "2020-04-14T18:32:40.000Z": ". @GovJanetMills says she has been talking with @GovPhilScott of VT and @GovChrisSununu of NH about how to reopen economies down the line. #mepolitics", "2020-04-14T18:24:38.000Z": "Distributing relief to Granite Staters remains a top priority. Today, I signed an Executive Order officially establishing the Governor's Office for Emergency Relief & Recovery, along with processes and procedures for allocation and expenditure of #COVID19 emergency funds. (1/2)", "2020-04-14T18:22:38.000Z": "In a further effort to protect those on the front lines and those in long-term care facilities, we will be partnering with @ConvenientMD to make testing available to the 6,600 health care workers in long-term care facilities in Hillsborough and Rockingham County. (1/2)", "2020-04-14T18:19:22.000Z": "I am announcing the formation of the Long-Term Care Stabilization Program, which will provide a weekly $300 stipend to front line workers at NH Medicaid funded residential facilities and social services organizations. (1/3)", "2020-04-14T18:15:36.000Z": "Our hearts go out to the families of the four Granite Staters we lost to #COVID19 today.", "2020-04-14T18:09:27.000Z": "Listen to NHPR live now as @GovChrisSununu provides an update on #coronavirus in N.H. http:// ow.ly/53rY50ze3hF", "2020-04-14T18:09:22.000Z": "Today's #COVID19 briefing with @GovChrisSununu is underway #WMUR", "2020-04-14T17:56:06.000Z": "About to hold a press conference to provide an update on the state's response to #COVID19 . Watch live: 4 more deaths linked to COVID-19 outbreaks at long-term care facilities in NH As four more deaths linked to COVID-19 outbreaks at New Hampshire long-term care facilities were announced Tuesday, Gov. Chris Sununu said front-line workers helping the state's most vulnerable will... wmur.com", "2020-04-14T17:52:21.000Z": "WATCH LIVE ONLINE: #NH  @GovChrisSununu will hold a briefing on the state's efforts to slow the spread of the coronavirus. It's scheduled to begin at 2 p.m. https:// wcax.com/content/news/W ATCH-LIVE-Sununu-to-provide-COVID-19-update-569626171.html ", "2020-04-14T16:45:12.000Z": "Live at 2: Gov. Sununu holds news conference for latest coronavirus updates 4 more deaths linked to COVID-19 outbreaks at long-term care facilities in NH As four more deaths linked to COVID-19 outbreaks at New Hampshire long-term care facilities were announced Tuesday, Gov. Chris Sununu said front-line workers helping the state's most vulnerable will... wmur.com", "2020-04-13T23:58:58.000Z": "This is how we do it in New Hampshire.", "2020-04-13T18:43:51.000Z": "We do not have an afternoon state press conference planned today, but our team will have coverage (from a safe distance) on what officials are doing.  In the meantime, please be connected and safe with weather moving through - a few trees and wires down & flood warnings: Quote Tweet WMUR TV @WMUR9 JUST IN: The National Weather Service has issued river flood warnings for portions of the Pemigewasset and Saco rivers. https:// wmur.com/article/weathe r-forecast-new-hampshire-april-13-2020/32126180 ", "2020-04-13T16:32:03.000Z": "This morning I joined @JohnKingCNN on @CNN to talk about the 91,000 pound PPE delivery we secured for New Hampshire yesterday.", "2020-04-13T14:51:35.000Z": "Joining @JohnKingCNN on @CNN around 11:20 AM to talk about New Hampshire's response to #COVID19 .", "2020-04-12T23:31:00.000Z": "Millions of pieces of PPE arrived at @flymanchester hours ago on a @FedEx cargo plane, and are currently being inventoried by the @NHNationalGuard before being distributed to areas of critical need across NH. THANK YOU to Dean Kamen for helping facilitate this critical delivery.", "2020-04-12T23:12:29.000Z": "A much needed positive development in the #COVID19 fight. NH receives shipment of personal protective equipment: 24,000 coveralls and Tyveks suits, 50,000 faceshields, 6.6 million masks. This PPE will save lives & protect the men & women working on the front lives of this crisis. Quote Tweet Seacoastonline.com @seacoastonline 91,000 pounds of personal protective equipment arriving in New Hampshire today from Shanghai as state nears 1,000 confirmed coronavirus cases. https:// seacoastonline.com/news/20200412/ new-hampshire-receives-millions-of-ppe-from-china ", "2020-04-12T23:08:40.000Z": "#HappyEaster !", "2020-04-12T21:05:37.000Z": "Joining @wolfblitzer on @CNN tonight around 6:45 PM to talk how we are combating #COVID19 in New Hampshire and today's PPE shipment.", "2020-04-12T20:43:20.000Z": "All hands on deck effort.", "2020-04-12T20:24:40.000Z": "New Hampshire governor posts quick video on medical supplies delivery Quote Tweet Chris Sununu @GovChrisSununu Our @NHNationalGuard hard at work. Supplies will be delivered across the state in the coming days. #603Pride", "2020-04-12T20:21:39.000Z": "Our @NHNationalGuard hard at work. Supplies will be delivered across the state in the coming days. #603Pride", "2020-04-12T20:03:36.000Z": "The PPE will be passed off to The @NHNationalGuard and then to local hospitals.", "2020-04-12T20:06:59.000Z": "6.6 million masks 50,000 face shields 24,000 Tyvek coveralls \n\nAnd this is just the beginning. #603Pride", "2020-04-12T19:43:32.000Z": "Right Now: ... @FedEx  plane carrying 91,000 pounds of PPE arrives as ... @flymanchester . The equipment will be shipped to NH hospitals across the state. via @TimCalWMUR", "2020-04-12T19:51:04.000Z": "Standing by for a press conference which you can watch live on @WMUR9 about the delivery of 91,000 lbs of PPE that just landed in #NH via @MikeCroninWMUR", "2020-04-12T19:49:29.000Z": "BREAKING: Cargo plane carrying 91,000 pounds of PPE has just landed in NH from China. Awaiting update from NH @GovChrisSununu on how this gear will help healthcare workers across the state battle #COVID19 Watch @boston25 for updates", "2020-04-12T19:52:09.000Z": "#603Pride", "2020-04-12T15:19:49.000Z": "This is great news. We passed the CARES Act to help get medical supplies to the front lines and I thank Dean Kamen for his round-the-clock efforts to deliver these supplies. I'll keep working with @GovChrisSununu and our Congressional delegation to get NH the supplies we need. Quote Tweet Chris Sununu @GovChrisSununu Wheels up to MHT. One month ago New Hampshire wasn't even in the business of PPE procurement, & today we secured over 91,000 pounds  of this critical lifesaving equipment for NH. We scoured the earth and left no stone unturned. Thankful for this team effort in fighting #COVID19 Show this thread", "2020-04-12T14:16:46.000Z": "The @FedEx plane departed Shanghai, China, last night & passed through US Customs in Anchorage, Alaska early this AM. Later today I'll join Dean Kamen, who was instrumental in facilitating this effort, state officials, @NHNationalGuard & @SenatorShaheen as we unload the plane.", "2020-04-12T14:16:45.000Z": "Wheels up to MHT. One month ago New Hampshire wasn't even in the business of PPE procurement, & today we secured over 91,000 pounds  of this critical lifesaving equipment for NH. We scoured the earth and left no stone unturned. Thankful for this team effort in fighting #COVID19", "2020-04-11T16:56:36.000Z": "It's the Saturday before Easter and our incredibly dedicated @NHESWorking staff are hard at work processing unemployment claims for Granite Staters affected by #COVID19 . I can't thank the team enough for their tireless work - it means the world to so many. #603Pride", "2020-04-11T01:10:02.000Z": "New Hampshire is ready for a surge and so is @NHTI . Thank You @GovChrisSununu for making sure that we are prepared. #doingourpart  #BeSafe", "2020-04-11T02:21:44.000Z": "Thank you @GovChrisSununu from a Deaf licensed clinical social worker here in NH! Making my job just a little easier by getting critical, lifesaving  information out to our ASL community. #deaf  #deafsocialwork  #nhpolitics Quote Tweet Chris Sununu @GovChrisSununu THREAD: Confronting #COVID19 is a team effort. I'd like to take a moment to thank one of our unsung heroes. David, our Certified Deaf Interpreter, has been with me at nearly every single one of our press conferences. (1/4) Show this thread", "2020-04-11T02:18:44.000Z": "#603Pride Quote Tweet holly marie @hollyreooo Replying to @AdamSextonWMUR and @GovChrisSununu I'm a Deaf social worker in NH and David and his team are doing critical work. NH is certainly serving as a model for effective communication access for our ASL users.  Making my job easier when I can refer my community to the press conference for an update!!", "2020-04-11T00:42:36.000Z": "Joining @ErinBurnett on @CNN at 10:15 PM tonight to talk New Hampshire's response to #COVID19 . Hope you can tune in.", "2020-04-10T23:50:39.000Z": "#603Pride Quote Tweet WMUR TV @WMUR9 First responders honor workers at Concord Hospital https:// wmur.com/article/first- responders-honor-workers-at-concord-hospital/32111808 ", "2020-04-10T21:47:28.000Z": ". @GovChrisSununu on why he's expanding absentee voting in New Hampshire: \"You don't ever want public safety to come in the way of an individual casting the ballot. That is the wrong message to send and given that this is a unique crisis, we're taking some unique steps.\" #MTPDaily", "2020-04-10T21:16:30.000Z": ". @GovChrisSununu helping deliver 3,500 masks to New Hampshire Hospital in #Concord , which was running low on PPE. @SoClean has rounded up 250,000 masks for 200+ healthcare facilities across #NH - all which will be distributed in the coming days via @MikeCroninWMUR", "2020-04-10T21:17:33.000Z": "Just joined @SoClean in delivering 3,500 KN95 masks to New Hampshire Hospital. Thanks to SoClean's efforts, over 200 health care facilities across NH will be delivered a total of 175,000 masks this weekend. THANK YOU SoClean! #603Pride", "2020-04-10T20:59:51.000Z": "Today, @NHSecretary and @NH_DOJ released guidance that allows all voters with #COVID19 concerns to vote absentee in the September and November elections. \n\nNo voter should have to choose between their health and their constitutional right to vote. \n\nRead: https:// governor.nh.gov/news-media/press-2020/documents/20200410-absentee-voting.pdf ", "2020-04-10T20:32:39.000Z": "Joining @chucktodd on @MeetThePress Daily around 5:40 PM on @MSNBC to discuss the steps we're taking in New Hampshire to respond to #COVID19 .", "2020-04-10T20:20:06.000Z": "Some recognition today for the hard-working ASL team that interprets @GovChrisSununu 's #COVID19 briefings, including Certified Deaf Interpreter David Krueger #WMUR", "2020-04-10T17:05:30.000Z": ". @GovChrisSununu touring the new Clinical Surge Flex Facility #NHTI in Concord The new site is expected to be fully operational by Wednesday #COVIDー19  #WMUR The Governor praises the team effort and a short turnaround in making this facility happen", "2020-04-10T19:13:43.000Z": ". @GovChrisSununu thanks the ASL team interpreting the #COVID19 briefings #WMUR", "2020-04-10T19:11:06.000Z": "This is an all-hands on deck effort. I'm up here every day with folks from public health, but there are so many other people working tirelessly behind-the-scenes. I can't thank our team enough for all that they are doing. #603Pride (4/4)", "2020-04-10T19:11:05.000Z": "THREAD: Confronting #COVID19 is a team effort. I'd like to take a moment to thank one of our unsung heroes. David, our Certified Deaf Interpreter, has been with me at nearly every single one of our press conferences. (1/4)", "2020-04-10T19:07:57.000Z": ". @SoClean , a great NH employer, will be delivering 175,000 KN95 masks to over 200 health care facilities across the state this weekend. Later today, I'll join them to deliver 3,500 masks to New Hampshire Hospital. THANK YOU, SoClean! #603Pride", "2020-04-10T19:06:58.000Z": "New Hampshire schools have borne many costs because of #COVID19 , but the #CARESAct funding we've received will help to provide much-needed relief.", "2020-04-10T19:06:15.000Z": "Approximately $8.9 million will be allocated to provide discretionary grants to K-12 schools, and higher education institutions significantly impacted by #COVID19 , to provide educational services, childcare and early childhood education, social and emotional supports. (2/4)", "2020-04-10T19:06:14.000Z": "THREAD: Through the #CARESAct Education Stabilization Fund, New Hampshire will be provided $82.4 million to help schools and higher education institutions across the state confront the challenges they're facing as a result of #COVID19 . (1/4)", "2020-04-10T18:33:46.000Z": "Coming up at 3 PM - watch today's press conference LIVE Click to watch today's press conference LIVE www.wmur.com", "2020-04-10T17:04:00.000Z": "Visited our new clinical surge flex facility at @NHTI in Concord today. We hope that these beds never have to be used, but New Hampshire stands prepared as we confront this public health crisis. This sign hanging outside could not ring more true: We are stronger than #COVID19 .", "2020-04-10T15:59:18.000Z": "I'm holding a press conference today at 3 PM to provide an update on the state's response to #COVID19 . Watch live on-air and online at @WMUR9 .", "2020-04-10T00:36:33.000Z": "The proactive steps we have taken to fight #COVID19 are working. \n\nLet's keep it up. Official: NH COVID-19 battle plan is working CONCORD - State Epidemiologist Dr. Benjamin Chan said New Hampshire's aggressive strategy to prevent the spread of COVID-19 should cut the number of possible infections and deaths by more than unionleader.com", "2020-04-09T20:35:32.000Z": "These are trying times, but the strength and power of NH communities is unrivaled. In two weeks, over 1,300 Granite Staters have stepped up to help those in need within their communities. If you're interested in connecting with a local nonprofit call @VolunteerNH at 603-271-7200.", "2020-04-09T19:32:59.000Z": "THANK YOU to the over 1,300 Granite Staters who have volunteered with New Hampshire non-profits and charitable organizations as part of #COVID19 relief efforts. For those still interested in getting connected with a local nonprofit to volunteer, call @VolunteerNH at 603-271-7200", "2020-04-09T19:31:25.000Z": "Today we're announcing the NH Nonprofit Response Fund, a joint effort between the @NHCDFA and the NH Business Finance Authority, to provide nonprofits with resources up to $100,000 for working capital, equipment purchases, and programming expenses.", "2020-04-09T19:26:44.000Z": "Since calling upon Granite Staters a few weeks ago to volunteer or donate to a good cause, over $3.2 MILLION DOLLARS has been raised, with over $2.5M going directly to New Hampshire nonprofits and roughly $2.3M having been distributed for #COVID19 related grants. #603Pride", "2020-04-09T19:16:27.000Z": "New chart released by NH state epidemiologist Benjamin Chan this afternoon.\n\nPopulation sizes aside, NH appears to be doing better at flattening the curve for COVID-19 cases than neighboring states. #nhpolitics", "2020-04-09T19:03:12.000Z": "In the coming days Jerry will be forming his team, and they look forward to meeting with key stakeholders and the bipartisan legislative advisory committee. (3/3)", "2020-04-09T19:03:11.000Z": "I'm proud to have appointed Banking Commissioner Jerry Little to serve as Executive Director of the Governor's Office for Emergency Recovery and Relief. Jerry stands ready to hit the ground running so that we can deliver results for New Hampshire families. (1/3)", "2020-04-09T18:50:01.000Z": "WATCH LIVE: Sununu to provide COVID-19 update https:// wcax.com/content/news/S ununu-to-provide-COVID-19-update--569509131.html ", "2020-04-09T17:29:06.000Z": "Live at 3: Governor to give updates about COVID-19 in NH Social distancing in NH may be working, must be continued, health experts say As three more deaths related to COVID-19 were confirmed in New Hampshire, health officials said Thursday the state's efforts to slow the spread of the coronavirus through social distancing might be... wmur.com", "2020-04-09T18:42:22.000Z": "Listen live on NHPR and http:// NHPR.org at 3 pm for @GovChrisSununu 's news conference on #coronavirus in NH. Coronavirus Update: 1 More Death; 26 New Cases In New Hampshire NHPR is continuing to cover the developing story around coronavirus in New Hampshire. Bookmark this page for the latest updates, including case numbers and nhpr.org", "2020-04-09T14:27:38.000Z": "Holding a press conference at 3:00 PM to provide an update on New Hampshire's response to #COVID19 .", "2020-04-09T00:56:44.000Z": "The State of New Hampshire appreciates all of your lifesaving work on the frontlines. Quote Tweet hngrylkthewolf @hngrylkthewolf Replying to @GovChrisSununu Thank you so much for your handling of the situation. @DartmouthHitch HCW's thank you! #StayHomeSaveLives  #COVID19", "2020-04-08T23:28:37.000Z": "Am I:\n\n1) Indulging in ice cream to relieve stress.\n2) Enjoying the first incognito shopping run I've had in years.\n3) Feeling super cool like a Western cowboy hero in Aisle 10.\n4) Doing my part to follow CDC guidance & not spread #COVID19 .\n5) All of the Above \n\nStay safe, NH!", "2020-04-08T22:26:37.000Z": "I sometimes get asked to end my Stay At Home Order because some folks don't think #COVID19 is serious. \n\nHere's my response:", "2020-04-08T22:12:02.000Z": "Thanks for stopping by and answering questions from our viewers, @GovChrisSununu ! Quote Tweet Chris Sununu @GovChrisSununu In studio with @MonicaWMUR and @MikeCherryWMUR answering YOUR questions on @WMUR9 until 6:00 PM!", "2020-04-08T22:09:39.000Z": "Just heard @Travelers and @GEICO are also taking this important action. Thanks to all these companies for stepping up and providing relief during this difficult time. Quote Tweet Chris Sununu @GovChrisSununu Earlier today, @NHInsuranceDept approved a waiver from @Allstate reducing auto insurance premiums by roughly 15% for NH Allstate policyholders. In effect for March/April, and likely longer. In total this will save Granite Staters around $2.3 million. Thanks @AllState .", "2020-04-08T21:59:58.000Z": "Happy #Passover to all who are celebrating. Wishing you a peaceful and healthy holiday. Chag Sameach!", "2020-04-08T21:30:24.000Z": "In studio with @MonicaWMUR and @MikeCherryWMUR answering YOUR questions on @WMUR9 until 6:00 PM!", "2020-04-08T21:00:17.000Z": "Gov. Chris Sununu will be live in WMUR's studios during News 9 at 5:30 to answer viewer questions about the COVID-19 outbreak. See the segment on http:// WMUR.com or the WMUR mobile app. Gov. Chris Sununu answers viewer questions regarding COVID-19 in New Hampshire The governor was live in WMUR's studios Wednesday during News 9 at 5:30 to answer viewer questions about the COVID-19 outbreak. wmur.com", "2020-04-08T20:39:51.000Z": "I'll be LIVE on @WMUR9 tonight at 5:30 taking YOUR questions on the state's response to #COVID19 . Tune in!", "2020-04-08T19:39:23.000Z": "We've seen a lower number of new confirmed #COVID19 cases in recent days and that's encouraging, but that must not be mistaken for a trend. This viral epidemic is real. Our toughest days are likely ahead, but we will continue attacking this with every resource available.", "2020-04-08T19:28:38.000Z": "It's the people of New Hampshire who deserve all the credit in the world as to why we're not seeing results like some other states. Granite Staters have acted responsibly & have taken social distancing seriously. We can't repeat that enough. THANK YOU New Hampshire. #GraniteTough", "2020-04-08T19:12:28.000Z": "Our hearts go out to the families of the five Granite Staters we lost to #COVID19 today. Our toughest days are likely still ahead.", "2020-04-08T19:12:23.000Z": "We appreciate folks' patience as we continue to make the application system more robust, but to date our team is doing a great job and continues to provide one-on-one services to the over 100,000 people asking for help. (3/3)", "2020-04-08T19:12:22.000Z": "Since I signed Emergency Order 5 expanding unemployment benefits on March 17, NH has become a leader in getting folks relief fast. In just three weeks, @NHESWorking has issued over 67,000 total payments with nearly $19M in benefits paid (1/3)", "2020-04-08T19:05:45.000Z": "Earlier this week it was announced that NH has received 15 Abbott rapid-testing devices. While that's good news, @fema has only sent us a limited number of the cartridges needed to perform those tests. We have been told to only expect about 15% of the cartridges requested. (1/3)", "2020-04-08T19:05:03.000Z": "Right now: @GovChrisSununu is giving a #COVID19 briefing. Watch here: http:// wmur.com/article/new-ha mpshire-coronavirus-update-april-8-2020/32081692?src=app  via @AdamSextonWMUR", "2020-04-08T18:55:12.000Z": "Listen to NHPR live at 3 p.m. for Governor Sununu's update on the state's response to #coronavirus . Also streaming online at http:// NHPR.org  http:// ow.ly/YnIA50z9bEy", "2020-04-08T18:50:01.000Z": "WATCH LIVE: @GovChrisSununu will give an update today on #NH 's response to COVID-19. The news conference is scheduled to start at 3 p.m. Watch it live on http:// wcax.com . https:// wcax.com/content/news/N H-lawmakers-assert-authority-in-spending-virus-relief-aid-569474651.html ", "2020-04-08T18:02:45.000Z": "I'll be holding a press conference today at 3 PM to provide an update on the state's response to COVID-19. Watch live: 10 COVID-19 deaths linked to outbreaks at NH long-term care facilities, officials say Ten recent deaths linked to COVID-19 in New Hampshire were in long-term care facilities or nursing homes, state health officials said Wednesday. wmur.com", "2020-04-08T17:17:27.000Z": "Congratulations Colonel Noyes!  #NHSP Quote Tweet Chris Sununu @GovChrisSununu Congratulations to Captain Nathan Noyes of New Boston on his unanimous confirmation to serve as the next Colonel of the @NH_StatePolice at today's Executive Council Meeting. I look forward to working with him to ensure that NH remains one of the safest states in the nation.", "2020-04-08T17:15:45.000Z": "Congratulations to Captain Nathan Noyes of New Boston on his unanimous confirmation to serve as the next Colonel of the @NH_StatePolice at today's Executive Council Meeting. I look forward to working with him to ensure that NH remains one of the safest states in the nation.", "2020-04-08T17:03:08.000Z": "Councilor Russell Prescott, R-Kingston, reveals his daughter is working on floor of Boston hospital now serving as COVID-19 wing and thanks @GovChrisSununu team. \"I thank the people around our country for doing so much work to keep us safe.\" #covid19  #nhpolitics", "2020-04-08T16:30:11.000Z": "Live at 3: Governor holding COVID-19 briefing to give latest updates 10 COVID-19 deaths linked to outbreaks at NH long-term care facilities, officials say Ten recent deaths linked to COVID-19 in New Hampshire were in long-term care facilities or nursing homes, state health officials said Wednesday. wmur.com", "2020-04-08T15:03:03.000Z": "Taking today's Executive Council call remotely from the State's Emergency Operations Center this morning. We are hard at work.", "2020-04-08T14:49:13.000Z": "Our @NewHampshireDOT electronic message signs are being mobilized at entry points across the state to remind those coming from out-of-state for an extended period of time to quarantine for 14 days. #COVID19", "2020-04-08T13:37:51.000Z": "Following passage of the CARES Act, I have established the Governor's Office for Emergency Relief & Recovery. This office will ensure that the allocation of the more than $1.25B in federal aid coming to New Hampshire is allocated in a transparent, accountable manner.", "2020-04-07T21:55:53.000Z": "A bipartisan Legislative Advisory Board within GOFERR will ensure that this process has as much accountability, transparency, and integrity as possible. I look forward to having legislative leadership advise this critically important office. (2/3)", "2020-04-07T21:55:52.000Z": "THREAD: Today I announced the formation of the Governor's Office for Emergency Relief and Recovery (GOFERR) to oversee investment and oversight of #COVID19 relief and stimulus funds provided to NH by the federal government. (1/3)", "2020-04-07T20:56:02.000Z": "Just heard @LibertyMutual is joining these efforts to provide a ~15% reduction in premiums. Great to hear. Quote Tweet Chris Sununu @GovChrisSununu Earlier today, @NHInsuranceDept approved a waiver from @Allstate reducing auto insurance premiums by roughly 15% for NH Allstate policyholders. In effect for March/April, and likely longer. In total this will save Granite Staters around $2.3 million. Thanks @AllState .", "2020-04-07T18:43:50.000Z": "Thank you to everyone keeping us moving forward to a healthy, safe NH. #603Salute  #StrongerTogether  #ReadyNH", "2020-04-07T17:48:08.000Z": "Earlier today, @NHInsuranceDept approved a waiver from @Allstate reducing auto insurance premiums by roughly 15% for NH Allstate policyholders. In effect for March/April, and likely longer. In total this will save Granite Staters around $2.3 million. Thanks @AllState .", "2020-04-07T17:25:15.000Z": "Today I sent a letter to @USDOT  @SecElaineChao advocating for changes to the #CARESAct to ensure Manchester-Boston Regional Airport @flymanchester receives financial assistance. Read my letter:", "2020-04-07T17:01:45.000Z": "Hey Out There... NHDOT loves our Truckers and Travelers.\nWelcome Centers have been temporarily closed but our rest areas are still open.\nYou can still park and take a rest. Use portable toilets and access vending machines. \nRest areas will continue to be maintained and cleaned.", "2020-04-07T14:02:25.000Z": "THANK YOU to New Hampshire's frontline health care workers for all you do to keep our communities healthy and strong, especially in the wake of the public health crisis we're facing. #603Salute Quote Tweet DHHS PIO @NHDHHSPIO Celebrating people whose jobs require them to serve on the front lines of the #COVID19 pandemic, including the more than 27,000 RNs and LPNs in NH. To all who inspire us and protect us, we offer a #603Salute !", "2020-04-06T21:46:17.000Z": "Happily enjoying the forest as a family and close to home! Thanks @GovChrisSununu and the #HomeHikeChallenge  #FlattenTheCurve  #getoutside", "2020-04-07T10:59:07.000Z": "Found a super cool spot on our hike right in our own neighborhood. #homehikechallenge  #wmur  #COVID19 via @ErinWMUR", "2020-04-07T10:59:00.000Z": "Found a super cool spot on our hike right in our own neighborhood. #homehikechallenge  #wmur  #nhchronicle  #COVID19", "2020-04-06T21:00:53.000Z": "It's a beautiful day for a run on the Goffstown Rail Trail. Thank you @GovChrisSununu for the idea! #HomeHikeChallenge  #KeepYourDistance", "2020-04-06T19:21:05.000Z": "46 new cases, 715 total, 9 deaths. \nGovernor: Due to influx of out of staters: lodging must end non-essential accommodations (vacations) after reservations end.  \n300,000 PPE items acquired, and avid-19 machines giving  test results in minutes (for health care workers first) Quote Tweet WMUR TV @WMUR9 LIVE: Gov. Sununu is holding a new COVID-19 briefing right now. Watch it live: https:// wmur.com/article/new-ha mpshire-coronavirus-update-april-6-2020/32053523   #coronavirus", "2020-04-06T19:19:28.000Z": "Hotels and other lodging establishments will still be able to provide accommodations to provide housing for essential health care workers, first responders, state-approved quarantining accommodations for individuals, and victims of domestic and sexual violence.", "2020-04-06T19:18:09.000Z": "Effective immediately, all hotels and short-term rentals like Airbnb's in the State of New Hampshire must suspend lodging accommodations for non-essential reasons, like vacations and other leisurely purposes.", "2020-04-06T19:10:04.000Z": "Securing Personal Protective Equipment remains a top priority for the state. To date, we have acquired over 300,000 individual pieces of PPE - everything from N95 masks to face shields, gloves, & gowns. We will continue working around the clock to secure this critical equipment.", "2020-04-06T19:01:59.000Z": "A briefing on the #COVID19 pandemic in New Hampshire from @GovChrisSununu will get underway soon. Watch: http:// wmur.com/article/new-ha mpshire-coronavirus-update-april-6-2020/32053523?src=app   #WMUR", "2020-04-06T18:59:45.000Z": "New Hampshire Gov. Chris Sununu is providing an update on the state's response to COVID-19. WATCH LIVE: Gov. Sununu addressing state's COVID-19 response mynbc5.com", "2020-04-06T18:58:23.000Z": "Watch live: http:// wmur.com/article/new-ha mpshire-coronavirus-update-april-6-2020/32053523?src=app  Quote Tweet Mike Cherry @MikeCherryWMUR Coming up near the top of the hour Gov. Sununu and state officials will hold a briefing on Coronavirus efforts in New Hampshire. #WMUR", "2020-04-06T18:50:02.000Z": "WATCH LIVE: #NH  @GovChrisSununu to provide COVID-19 update https:// wcax.com/content/news/N H-rest-stops-closed-569402261.html ", "2020-04-06T16:45:47.000Z": "I will be holding a press conference today at 3:00 PM to provide an update on the state's response to #COVID19 . Watch live on @WMUR9 : NH hotels, Airbnbs told to end nonessential accommodations to slow COVID-19 spread Hotels and short-term rentals in New Hampshire must suspend all accommodations for nonessential purposes, Gov. Chris Sununu announced Monday. wmur.com", "2020-04-05T22:10:20.000Z": "#HomeHikeChallenge  @GovChrisSununu  @JoppaHillEdFarm"}