{"2020-03-24T14:08:15.000Z": "For the latest #COVID19 /Coronavirus response information, please visit my official state account: @GovMurphy", "2020-07-30T00:02:28.000Z": "Honored to serve with some of our party's most distinguished leaders like @TammyforIL  @KeishaBottoms  @MayorOfMKE  @Tcardenas as a Co-Chair of the 2020 @DemConvention , where we'll show the country why we must elect @JoeBiden as our next President. Democrats announce convention schedule, party officers for 2020 gathering transformed by coronavirus Democrats, who are set to formally nominate presumptive nominee Joe Biden in a few short weeks, announced on Wednesday evening a preliminary schedule for the four days. abcnews.go.com", "2020-07-29T23:53:39.000Z": "Two veep contenders, @SenDuckworth and @KeishaBottoms , will serve as permanent co-chairs of the Democratic convention next month\n\nOther co-chairs: @PhilMurphyNJ , @MayorOfMKE  @Tcardenas  @SpeakerPelosi and @SenSchumer will serve as honorary chairs Democrats announce convention schedule, party officers for 2020 gathering transformed by coronavirus Democrats, who are set to formally nominate presumptive nominee Joe Biden in a few short weeks, announced on Wednesday evening a preliminary schedule for the four days. abcnews.go.com", "2020-07-28T16:45:00.000Z": ". @GovMurphy stood up for Americans and called out Republicans for leaving states to deal with the pandemic on their own, explaining that injecting cash into states \"is the one smart thing we can do as a country right now.\"", "2020-07-14T13:36:43.000Z": "Governor candidate, NC North Carolina will rebuild, and we'll be even stronger than before. Watch our new TV ad now:", "2020-07-12T20:51:00.000Z": "The presidency isn't the only thing at stake this November. Across the country, #DemGovs have been fighting Trump's disastrous agenda at every turn. @DemGovs have the chance to deliver historic victories in key battleground states. Can you chip in now? Chip in to the DGA Help us elect Democratic governors across the country! secure.actblue.com", "2020-07-08T22:16:15.000Z": "Along with @LtGovOliver I look forward to our continued partnership with Mayor Small and the people of Atlantic City. AC's best days are ahead.", "2020-07-08T21:06:43.000Z": "Congratulations to Mayor @marty_small on his primary win. Mayor Small is working hard to restore integrity to Atlantic City government and I was glad to support him. Quote Tweet David Wildstein @wildstein Atlantic City Mayor Marty Small has claimed victory in the Democratic primary.", "2020-07-08T03:22:43.000Z": "US House candidate, NJ-2 I'm so grateful for my family, my community and the overwhelming support in South Jersey. I am ready to fight with you. I am ready to fight for you. I am ready to take on Jeff Van Drew.", "2020-07-08T02:33:08.000Z": "Tonight, hardworking families across South Jersey nominated a candidate that will finally put them first. Congratulations to @AmyKennedy715 on an incredible victory for South Jersey.\n\nNext up: @VanDrewforNJ . Give 'em hell, Amy.", "2020-07-05T15:30:51.000Z": "Proud to endorse Ventnor attorney and small business owner Steve Dicht ( @64philliesfan ) for Atlantic County Surrogate. Along with @AmyKennedy715 , he'll lead responsibly and with character. If you live in Atlantic County, vote Column A on your mail-in ballot by Tues July 7th!", "2020-07-02T17:06:02.000Z": "Incredible news: @DemGovs just had its best quarter of grassroots fundraising EVER in Q2! We raised $6,779,357 online From 231,511 grassroots donors With an average donation of just $19.83!\n\nChip in $1 to #ElectDemGovs and be a part of this: Chip in to the DGA Help us elect Democratic governors across the country! secure.actblue.com", "2020-07-01T17:35:11.000Z": "The 7/7 primary will be conducted mostly by vote by mail, and we're working hard to make sure that Democrats throughout NJ are ready to cast their votes in the primary. We're excited to announce the launch of our new get out the vote video, which you can watch below.", "2020-07-01T22:06:42.000Z": "Join my Facebook Live with @AmyKennedy715 now! Quote Tweet Amy Kennedy @AmyKennedy715 US House candidate, NJ-2 We're live with @PhilMurphyNJ ! https:// facebook.com/amykennedyforc ongress/videos/991335544654771/?eid=ARCVxJ5OKldUEU3ILAn6Y8hstA5vHMCN7XEek0Lpin3cnpxNwWgwZPAp4dfafswRQkjOacZo6Rh_14Ib ", "2020-07-01T15:02:32.000Z": "US House candidate, NJ-2 Don't forget to join us tonight at 6pm on Facebook live, we're hosting a virtual GOTV rally with @PhilMurphyNJ ! \n\nDetails here: Amy Kennedy Virtual Campaign Rally with Gov. Murphy · Amy Kennedy for Congress Join us for a virtual campaign rally with Governor Phil Murphy! To join, simply go to Amy Kennedy's facebook page at 6pm on Wednesday here ->facebook.com/amykennedyforcongress You can also sign up... mobilize.us", "2020-06-26T19:35:33.000Z": "It's an honor to earn the support of NJ's leading Democrats @PhilMurphyNJ  @LtGovOliver  @BobMenendezNJ  @CoryBooker who have seen my record of standing up for our values and delivering for the people I represent up close. New Jersey's top Democrats back Sires - New Jersey Globe Four of New Jersey's top Democrats backed Rep. Albio Sires (D-West New York) for re-election Friday. Gov. Phil Murphy, Lt. Gov. Sheila Oliver, U.S. newjerseyglobe.com", "2020-06-25T23:34:03.000Z": "Proud of @AmyKennedy715 for her strong performance in tonight's primary debate. She will bring real change to South Jersey and keep her word to the people of #NJ02 . @VanDrewForNJ has met his match. #AmyKFightsforSJ", "2020-06-24T20:25:31.000Z": "US House candidate, NJ-2 I'm so honored to have Gov @PhilMurphyNJ 's endorsement. His commitment & leadership in NJ is exactly what I hope to bring to Washington. I'm committed to the people of South Jersey and to bringing change to my community. Quote Tweet Phil Murphy @PhilMurphyNJ Thrilled to endorse @AmyKennedy715 . As a former public school teacher and mental health advocate, Amy understands the importance of making health care more affordable and fixing our broken political system. She'll be a strong voice for South Jersey. https:// pressofatlanticcity.com/news/murphy-en dorses-amy-kennedy-on-eve-of-congressional-debate/article_d2d673cb-b6e2-5c3e-816d-0aeca28d745d.html ", "2020-06-24T19:49:28.000Z": "Thrilled to endorse @AmyKennedy715 . As a former public school teacher and mental health advocate, Amy understands the importance of making health care more affordable and fixing our broken political system. She'll be a strong voice for South Jersey. Gov. Murphy endorses Amy Kennedy on eve of congressional debate Gov. Phil Murphy endorsed Brigantine's Amy Kennedy for the Democratic nomination for the 2nd congressional district race Wednesday, on the eve of a debate between the top three Democrats in pressofatlanticcity.com", "2020-06-19T20:27:50.000Z": "MAJOR NEWS: The Portal Bridge project will enter into its engineering phase with FULL federal funding.\n\nHonored to have made the case directly to @realDonaldTrump last weekend, and proud to usher in a new era of safe, modern, reliable infrastructure for NJ and the region.", "2020-06-18T16:50:06.000Z": "Phil Murphy - NJ", "2020-06-11T19:35:02.000Z": "The \"Welcome to New Jersey: Don't be a Knucklehead\" won our t-shirt design contest! Buy your t-shirt below. All net proceeds will benefit @NJ_PRF , a nonprofit founded by @FirstLadyNJ that helps residents recover from the COVID-19 crisis. Buy yours today! \"Don't Be a Knucklehead!\" Buy Your T-Shirt to Support Pandemic Relief The New Jersey Democratic State Committee is selling the winning \"Don't Be a Knucklehead\" t-shirt design, based on Governor Phil Murphy's now-famous phrase. Buy yours today to support the NJ Pandemic... nj-dems-store.myshopify.com", "2020-06-10T13:19:02.000Z": "Congratulations to @BenSalango on his #WVPrimary win. Ben has spent his career focused on creating jobs and he has a record of getting things done. @DemGovs looks forward to fighting with him to move West Virginia forward. #WVGov", "2020-06-03T03:50:00.000Z": ". @CooneyForMT has worked for good paying jobs, high-quality, affordable health care, and public access to public lands.\n \nWe're excited to fight by his side for the future Montanans deserve. #MTGov", "2020-06-03T15:11:50.000Z": "Congratulations to Lt. Gov. @CooneyforMT on his primary victory last night. Mike is one of Montana's most trusted and effective leaders and @DemGovs looks forward to fighting with him to defend Montana and protect the Last Best Place. #MTGov", "2020-05-19T15:01:32.000Z": "We are excited to announce that the NJDSC is launching a \"Don't be a Knucklehead\" T-Shirt sale! All net proceeds will benefit the @NJ_PRF . Vote for your favorite design below and check back on 6/1 to see which design won! NJDSC Knucklehead Shirt Options - NJDSC njdems.org", "2020-05-18T20:38:05.000Z": "Great call today with @TeamPelosi and @DemGovs from across the country about the vital importance of passing the HEROES Act. Congress needs to act now to keep state and local governments funded and prevent layoffs of cops, educators, firefighters, and EMTs.", "2020-05-18T12:50:45.000Z": "RIP to former Assemblyman Paul J. McCurrie, a U.S Navy veteran and longtime @HudsonDems county committeeman from Kearny. Our thoughts and prayers are with his children, grandson, family, and friends. Paul McCurrie, elected Assemblyman from Hudson in 1961, dies at 91 - New Jersey Globe Paul J. McCurrie, who served in the New Jersey State Assembly from 1962 to 1964, died on May 15.  He was 91. McCurrie was a 32-year-old attorney and U.S. newjerseyglobe.com", "2020-05-15T13:47:23.000Z": "I'm thrilled to endorse @JoeBiden and look forward to supporting him to be our next president. Joe has the experience, the compassion and the optimism we need to restore the soul of our nation. Murphy endorses Biden - New Jersey Globe Gov. Phil Murphy endorsed former Vice President Joe Biden's presidential bid Thursday. \"I would just echo and say I endorse everything Ned and Gretchen newjerseyglobe.com", "2020-05-14T19:34:14.000Z": "Watch @GovMurphy and Governors @GovWhitmer and @GovNedLamont with @JoeBiden here: https:// joebiden.com/live/", "2020-05-13T22:03:37.000Z": "Excited to join two good friends on the front lines of this crisis for a conversation with @JoeBiden on how we can begin to move our nation forward Quote Tweet Matt Hill @thematthill TOMORROW: @JoeBiden will hold a virtual roundtable on responding to the COVID crisis with governors, including @gretchenwhitmer of Michigan, @PhilMurphyNJ of New Jersey, and @NedLamont of Connecticut. \n\nTune into our platforms Thursday, May 14 at 3:30 PM ET to watch!", "2020-04-22T13:10:07.000Z": "I'm so proud of @TammyMurphyNJ for helping launch #Jersey4Jersey , the star-studded event tonight at 7pm ET benefitting NJ leaders on the frontlines of #COVID19 . And the fun continues with a @NJ_PRF takeover of @hqtrivia at 9pm! Learn how you can tune in: Home - NJ Pandemic Relief Fund BLACK LIVES MATTER A Message from the Board of Directors George Floyd's killing underscores a pervasive, painful and unacceptable reality in American life: Black communities and communities of color... njprf.org", "2020-04-20T19:57:00.000Z": ". @GovMurphy tells Congress: \"Now is the time for bold action and ambitious solutions. States are leading in this crisis, but we need the federal government's help to make sure we can keep the fight up in the coming weeks and months, and we need it now.\" Statement from DGA Chair Governor Phil Murphy on the Importance of Direct Cash Assistance to States... Today, Democratic Governors Association Chair New Jersey Gov. Phil Murphy released the following statement on the importance of direct cash assistance to states in next federal stimulus package: \"As... democraticgovernors.org", "2020-04-08T20:55:07.000Z": ". @GovMurphy is protecting NJ's democracy and making sure voters won't be forced to choose between exercising their right to vote and their health #COVID19", "2020-04-07T18:09:22.000Z": "California is sending 100 lifesaving ventilators to New Jersey.\n\nWe are beyond grateful to @GavinNewsom and the people of California.\n\nFrom the bottom of our hearts, thank you. We will repay the favor when California needs it.", "2020-03-31T21:42:35.000Z": "Tammy and I are deeply saddened by the passing of @njburlcodems State Committeewoman Bea Holley - a loyal colleague and dear friend. Sending our deepest condolences to her husband Lester and all her family and friends.", "2020-03-24T12:17:40.000Z": "The New Jersey Pandemic Relief Fund community is growing - band together with us! #BandTogetherNJ Quote Tweet New Jersey Pandemic Relief Fund @NJ_PRF We must #BandtogetherNJ ! The NJ Pandemic Relief Fund seeks to marshal resources across the state to fight COVID-19's impact on NJ's most vulnerable. To donate, please visit http:// njprf.org . You'll be a star! Show this thread", "2020-03-24T03:30:00.000Z": "@GovMurphy my wife and I are Republican, but that doesn't stop us from realizing the GREAT JOB you are doing to flatten the curve on #COVID19  #coronavirus The virus knows no party. We are in this together! Thank you!", "2020-03-04T01:54:14.000Z": "Congratulations to @RoyCooperNC on his primary victory tonight. Gov. Cooper has made workforce development a key focus, created tens of thousands of jobs and courageously fought for Medicaid expansion and North Carolina public schools.", "2020-02-10T22:10:56.000Z": "Saily has time and time again proven herself to be an exemplary leader with the determination we need to push our party forward. I look forward to working with her to continue the progress we have already made in building a stronger and fairer New Jersey.", "2020-02-10T22:10:55.000Z": "As NJ continues to lead on progressive policies, it's imperative we have leaders with a deep connection to the grassroots advocates who are at the forefront of so many issues. I'm incredibly proud to welcome Saily Avelenda to @NJDSC to help fulfill that commitment.", "2020-02-05T03:42:00.000Z": "Governor @JBPritzker is rebuilding roads and bridges in Illinois. @GovMurphy is replacing lead pipes in New Jersey. @GovLauraKelly is working across the aisle to expand Medicaid coverage in Kansas. @GovMLG enshrined ACA protections into New Mexico state law.", "2020-02-05T03:38:59.000Z": "\". @GovPhilMurphy is replacing lead pipes in New Jersey\" GIF", "2020-01-29T00:58:38.000Z": "US House candidate, PA-2 Jeff Van Drew is a weak man who has no core beliefs. He went from vowing to \"never support\" Donald Trump to then pledging his \"undying loyalty\" to Trump only weeks later. We will defeat this coward in November. Quote Tweet David Wildstein @wildstein Donald Trump calls Jeff Van Drew \"a courageous leader who has left the Democratic Party because he's had enough of their extremism.\"", "2020-01-28T22:56:38.000Z": "President Trump has spent the past three years breaking promises and taking our country backwards by embracing hate and division. #TrumpRallyNJ", "2020-01-24T16:17:28.000Z": "Thrilled to have the opportunity to deliver the Democratic Response to the State of the Union. Democrats are laser-focused on building a stronger country, and this is an opportunity to show the American people that we are getting things done for them and for future generations.", "2020-01-23T17:31:01.000Z": "The \"gay/trans panic\" defense has been used to justify horrific acts of violence against the LGBTQ+ community. I was proud to help make California the first state to outlaw it and am happy New Jersey is following suit. Let's ban it everywhere. New Jersey to Become Ninth State to Ban LGBTQ 'Panic Defenses' LGBTQ \"panic\" defenses have long been a controversial part of the legal system. It effectively absolves blame from the perpetrator of a crime and places it on the victim instead. Luckily, these kinds... theroot.com", "2020-01-15T23:02:02.000Z": "Gov. Parson has kicked 100,000 Missouri children off their healthcare. He created this problem and has resisted every opportunity to fix it. Our state deserves better than that.\n\nWatch my official response to Gov. Parson's State of the State response here: State of the State Response https://nicolegalloway.com/ youtube.com", "2020-01-14T19:48:20.000Z": "New Jersey is stronger and fairer than ever because we're investing in our most valuable asset - our people.\n \nFollow along this week as we share the stories of nine New Jerseyans, and how we're working to put their needs first. #SOTS2020  #StrongerFairerNJ", "2020-01-13T20:41:57.000Z": "Congrats to @JohnBelforLA, the first Dem gov in 44 yrs to win-relection in LA, on his inauguration. John's bipartisan record turned a $2 billion deficit into a surplus, expanded health care to over 450K Louisianans, and gave teachers their first pay raise in a decade. #LAGov", "2020-01-13T16:01:11.000Z": "I will do everything in my power to help return Cory to the U.S. Senate this November. New Jersey and our nation need his voice now more than ever.", "2020-01-13T16:01:10.000Z": "Cory ran a campaign based on a bold vision and an even bolder optimism. He changed the presidential race by promising to bring our nation together instead of sowing division. I know he will continue fighting every day for justice and fairness for all. Quote Tweet Cory Booker @CoryBooker US Senate candidate, NJ It's with a full heart that I share this news-I'm suspending my campaign for president.\n\nTo my team, supporters, and everyone who gave me a shot-thank you. I am so proud of what we built, and I feel nothing but faith in what we can accomplish together.", "2020-01-11T16:57:56.000Z": "Today, Democrats voted once again to elect Chairman Currie as NJDSC Chairman! We welcome Chairman Currie and Vice Chair Schaffer's dependable leadership in this crucial election year. Come November, we will defeat Donald Trump & re-elect our Democratic congressional delegation!", "2020-01-11T16:59:25.000Z": "John and Peg are the best of what we stand for and they have gotten the best out of our party. Together, they are not just building a Democratic party that is successful today - they are building a party that will be successful for years to come.", "2020-01-11T16:59:24.000Z": "Our Democratic Party has never been stronger. Today, we renewed our commitment to that progress by re-electing Chairman John Currie and Vice Chair Peg Shaffer to continue leading the @NJDSC .", "2020-01-09T20:57:53.000Z": "Huge congrats to Kansas Governor @LauraKellyKS for reaching a bipartisan agreement to move Medicaid expansion forward, providing coverage to 100,000 more people while lowering premiums. This is what happens when you elect Democratic governors. Kansas Gov. Laura Kelly, Sen. Jim Denning reveal bipartisan Medicaid expansion deal Democratic Gov. Laura Kelly and GOP Senate Majority Leader Jim Denning outlined Thursday a bipartisan compromise for expanding Medicaid to thousands of low-income Kansans potentially fueled by enough... cjonline.com", "2020-01-07T15:49:08.000Z": "Democrats all over the state were sworn-in to office this week, many of whom won tough elections last November in traditionally Republican places. We're building our Democratic Party from the bottom up to continue delivering a stronger and fairer NJ. Murphy touts newly elected Democrats across New Jersey, one by one On Sunday, one of Gov. Phil Murphy's stops on his swearing-in tour was Fanwood. nj.com", "2019-12-31T17:33:52.000Z": "In 2019, we worked hard to build a stronger and fairer New Jersey for all. Together, we've made tremendous progress. Here are some highlights", "2019-12-19T21:27:43.000Z": "@GovMurphy firmó una legislación que ampliará el acceso a las licencias de conducir. \"Darle a más personas la oportunidad de obtener licencias independiente de su estado migratorio reducirá la cantidad de conductores sin seguro y aumentará la seguridad en nuestras calles\".", "2019-12-19T03:20:21.000Z": "President Trump has been impeached because he abused our Constitution, abused his office, and abused our foreign policy to benefit himself. It is a clear and textbook example of why the framers gave the House the power to impeach. This is not a time for anyone to celebrate.", "2019-12-17T18:32:57.000Z": ". @GovMurphy is signing a law that will restore the right to vote to 80,000 people on probation and parole. That's a big deal for voting rights. Every person who has served their time should have a voice. New Jersey might give 80,000 people on probation and parole the right to vote A bill to change New Jersey's system is moving quickly through the legislature. inquirer.com", "2019-12-15T00:16:21.000Z": "Congressman Van Drew has long voted against core Democratic values. Betraying our party by siding with Donald Trump is the final straw, as grassroots activists, local party leaders in his district, and I have made clear in recent weeks.", "2019-12-15T00:16:20.000Z": ". @CongressmanJVD has chosen his political career over our Constitution. Despite knowing full well that the President has abused the powers of his office, he's now willing to enable Donald Trump just to try to salvage his own election.", "2019-12-11T21:25:00.000Z": "Congrats to @GovMurphy as the new Chair of @DemGovs ! @PPact is excited to work with you and continue @GovRaimondo 's incredible work to protect the right to affordable and accessible health care, including sexual and reproductive health care, for all. Quote Tweet Democratic Governors @DemGovs Congratulations to New Jersey's @GovMurphy , our new DGA Chair!\n\nWe look forward to working with Governor Murphy to #ElectDemGovs and flip more states blue in 2020. Join us at http:// DemocraticGovernors.org", "2019-12-09T19:00:10.000Z": "Democratic governors can be the strongest check against Republican efforts to suppress the right to vote. This partnership with @staceyabrams and @fairfightaction is critical to ensure that every American citizen can exercise their right to vote. Quote Tweet Democratic Governors @DemGovs Hear from @OregonGovBrown and @StaceyAbrams directly on why this effort is so critical: https:// twitter.com/DemGovs/status /1204085727530758146/video/1  Show this thread", "2019-12-06T00:24:50.000Z": "Kathryn and his family are in our prayers, and Jay will forever remain in our hearts.", "2019-12-06T00:24:02.000Z": "Tammy and I are heartbroken to learn of the passing of our dear friend of over 20 years, Jay Kriegel. Jay was a trusted advisor and an important mentor to us both. He hosted us for dinner when we returned from Germany, and we eagerly took his advice from that day forward.", "2019-12-04T02:58:56.000Z": "The next Democratic presidential debate must reflect the full and rich diversity of our party. Donate now to ensure @CoryBooker gets on stage: http:// CoryBooker.com Quote Tweet Cory Booker @CoryBooker US Senate candidate, NJ We started with one of the most diverse fields in our history. It's a damn shame that the only African American woman in this race is no longer in it, and we're spiraling toward a debate stage without a single person of color.", "2019-11-26T18:37:39.000Z": "The politics of Washington aren't working for the middle class. @AndyBeshearKY and @JohnBelforLA won by showing up everywhere and focusing on kitchen table issues like making health care more affordable, boosting teacher pay, and creating good-paying jobs. Opinion | How Democrats can win, everywhere We urge Democrats to focus on, care about and invest more in state races, and to see our victories as blueprints for winning across the country. washingtonpost.com", "2019-11-25T17:34:37.000Z": "God bless the Kenny family, mourning the loss of their beloved son Bernard. The courage and determination he showed in life serve as an example to us all. May he rest in peace.", "2019-11-24T17:34:00.000Z": "Unlike his predecessor, @GovMurphy is bringing much-needed change to the Garden State by building an economy that works for New Jersey's middle class, not just the wealthy few. Quote Tweet Governor Phil Murphy @GovMurphy We need tax incentives that will: Propel our innovation economy Catalyze economic growth in our communities Uplift our middle-class families\n\nOur proposed incentives will do this- while ensuring accountability, transparency, and sustainability. https:// nj.gov/governor/news/ news/562019/approved/20191121b.shtml ", "2019-11-17T04:33:13.000Z": "The Blue Wave is still gaining momentum heading into 2020 -  congratulations to @JohnBelforLA on an inspiring victory! Quote Tweet Kyle Griffin @kylegriffin1 BATON ROUGE, La. (AP) - Louisiana's John Bel Edwards stuns GOP, wins reelection to a second term as the Deep South's only Democratic governor.", "2019-11-06T19:28:27.000Z": "A big congratulations to Hamilton Mayor-elect Jeff Martin! Great to see one of New Jersey's largest cities once again led by Democrats. Quote Tweet Insider NJ @INSIDERNJ JEFF MARTIN: AN OPEN LETTER TO THE RESIDENTS OF HAMILTON - Insider NJ - https:// go.shr.lc/2CigKfv", "2019-11-06T18:59:44.000Z": "For the first time since the 1960s, the Somerset County Freeholder Board will soon be led by Democrats. Congratulations to Freeholder-elect Melonie Marano, and to the @SomersetNJDems and their incredible Chair Peg Schaffer!", "2019-11-06T18:38:34.000Z": "Congratulations to Chatham's new Mayor-elect, Democrat Thad Kobylarz!", "2019-11-06T04:36:43.000Z": "Major congratulations to Somerset County Sheriff-elect, Democrat Darrin Russo. An incredible achievement for the @SomersetNJDems", "2019-11-06T03:58:49.000Z": "Celebrating our victories in Somerset County tonight with their incredible Chair Peg Schaffer and @NJSCDEMS !", "2019-11-06T03:03:53.000Z": "Congrats to @AndyBeshearKY , the next Governor of Kentucky, who ran on the values of respect and looking out for your fellow neighbors.\n\nStripping away health care from workers and attacking teachers and public schools is never a winning formula. #KYGov", "2019-11-06T02:27:16.000Z": "Congratulations to Democratic Mayor-elect Arvin Amatorio of Bergenfield, along with re-elected Assembly members Lisa Swain and Chris Tully!", "2019-11-06T02:18:50.000Z": "Congratulations to Dover's new Mayor-elect Carolyn Blackman on an inspiring win!", "2019-11-06T02:13:49.000Z": "This is shaping up to be a great night for New Jersey Democrats, and I'm excited to be in Passaic County with my friend @NJDSC Chairman John Currie to kick off the night. Lots of good news to come!", "2019-11-05T23:16:08.000Z": "Hudson County will soon have a woman Mayor once again when @DinaMGrilo is elected today. Excited to support Dina along with Chairwoman @amy_degise , @angiemj319, Assemblyman Mejia, @TomDeGise and all the @HudsonDems !", "2019-11-06T00:05:04.000Z": "There's less than an hour left before polls close at 8:00 PM, and there's still time to vote. \n \nFind your polling place here: https:// voter.njsvrs.com/elections/poll ing-lookup.html ", "2019-11-05T23:32:32.000Z": "My great friend and a stalwart ally in the labor movement, @PresWowkanech knows how to rally the troops with the best of them. Excited to be here with Charlie supporting the @middlesexdems", "2019-11-05T21:46:17.000Z": "Berkeley Heights is one of the key places we need to win to @Flip21Blue , and Mayor Angie Devanney and the council candidates Rina Franchino and Julie Figlar are working hard to make it happen!", "2019-11-05T22:13:41.000Z": ". @MayorStack does #GOTV better than just about anyone, no matter who's on top of the ballot. Great to be in Union City along with @Amy_DeGise supporting @RajMukherji , @AChaparro33 , @TomDeGise and the entire @HudsonDems team", "2019-11-05T21:56:42.000Z": "Irvington has never been stronger thanks to @MayorTonyVauss and his team, and I was glad to visit the Mayor and this great community today to get folks out to vote for the Essex County Democrats", "2019-11-05T21:10:02.000Z": "#ElectionDay 2019 ... @PhilMurphyNJ  rallying members as we go out to knock doors to make sure everyone gets out to #Vote !", "2019-11-05T20:39:35.000Z": "US Senate candidate, NJ New Jersey-Go Vote! Confirm your polling location: http:// iwillvote.com", "2019-11-05T18:51:31.000Z": "Melonie Marano is an extraordinary candidate & public servant, & today she has a chance to flip the Somerset Freeholders to Democratic control for the first time in a generation. Excited to chat with business owners & voters with Melonie, @SomersetNJDems & Raritan Dem candidates!", "2019-11-05T18:44:44.000Z": "Every vote counts in this election, and that's more important in the 25th District than just about anywhere. @LisaBhimani and @DarcyDraeger are battling hard for support with the help of the @MorrisDems and their great Chairman Chip Robinson.", "2019-11-05T17:19:27.000Z": ". @BergenDems are headed for big wins today, starting in LD38 where two great public servants in Lisa Swain and Chris Tully + Arvin Amatorio and his team in Bergenfield are on the ballot. Finnian Tully won't be voting today but he's cheering on his Dad and all the Democrats!", "2019-11-05T16:25:46.000Z": "This fabulous group of Somerset County volunteers voted, and you should too! Remember polls close at 8pm!", "2019-11-05T16:57:12.000Z": "What better place to make a Jersey Election Day stop than the Park West Diner! Great to be with friends like @NJDSC Chairman John Currie, Sheriff @RichBerdnik and many other Passaic County Democrats as our #GOTV day continues", "2019-11-05T16:02:34.000Z": ". @SomersetNJDems and their Chair Peg Schaffer are on the verge of a breakthrough and we're here in their campaign HQ calling voters and working to flip Somerset blue by election Democrats Marano and Russo, as well as Bridgewater candidates Brookner, Arcoleo & Selikoff", "2019-11-05T15:04:03.000Z": "Good morning from NJ, where 32BJ is ready to get out the vote for @NJLD11 (with @PhilMurphyNJ )! #GOTV", "2019-11-05T15:04:47.000Z": "Rallying the troops this morning in support of @NJLD11 Assembly members Eric Houghtaling and Joann Downey and the entire @MonmouthDems ticket along with @1199SEIU_NJ", "2019-11-05T14:07:18.000Z": "Thank you Governor @PhilMurphyNJ for the support! #GOTV  #Monmouth", "2019-11-05T14:10:34.000Z": "Starting off Election Day the way I hope every single registered voter in NJ does today -- by voting. @TammyMurphyNJ and I were proud to support the @MonmouthDems team and we're ready for a busy day of #GOTV", "2019-11-05T13:25:32.000Z": "US House candidate, NJ-11 It's Election Day in New Jersey! Polls close at 8pm Find your polling location here: https:// voter.njsvrs.com/elections/poll ing-lookup.html ", "2019-11-05T02:27:49.000Z": "Democrats in Chatham are pushing right through the finish line to elect @Flip21Blue and the entire @morrisdems team! There's no time to waste and we're fighting for every vote #GOTV", "2019-11-05T00:57:42.000Z": "We're almost down to the wire, so it was great to spend time knocking doors in Fair Lawn on behalf of Assembly members Swain and Tully along with Mayor Peluso and his Council team #GOTV", "2019-11-05T02:20:32.000Z": "Great energy tonight at the Trenton Democrats Pre-Election Rally, where we're all in with @MercerDems , @BrianMHughes and Chairwoman Mironov to deliver big victories on Tuesday #GOTV", "2019-11-04T23:33:47.000Z": "The @BergenDems are competing everywhere in this election, and Upper Saddle River is no exception where local activists are working to elect Birkner and Falotico for Assembly, Marshall Grupp for Mayor and Garbar + Galosso for Council", "2019-11-04T19:56:35.000Z": "Spent some quality time this afternoon with Harrison seniors talking about the importance of voting tomorrow for Mayor Fife's Council team, @TomDeGise and the entire @HudsonDems slate!", "2019-11-04T20:14:35.000Z": "Sheriff @RichBerdnik is a tremendous public servant and I loved spending some time with him and the Passaic Dems team at their Senior GOTV Luncheon along with @andresayegh  @NelliePou  @shavondasumter Assemblyman Giblin and more!", "2019-11-04T21:04:39.000Z": ". @AndrewZwicker and @RoyFreiman are two of the most thoughtful and hardworking members of our Democratic Assembly caucus and we're here launching a canvass to send them back to Trenton", "2019-11-04T14:16:31.000Z": "Up early this morning talking to commuters at the Summit train station. Fixing @NJTRANSIT after 8 years of neglect under Christie is at the top of my priority list. #vote  #ld21", "2019-11-04T19:07:00.000Z": "Former @BergenDems Chairman Lou Stellato is a great friend who has done so much to elect Democrats in our most populous county, and he still knows how to pack the house for his annual GOTV Breakfast in Lyndhurst.", "2019-11-04T14:31:08.000Z": "There's only one day left until the Election so I'm glad to be back at the Rutherford Train Station, one of our favorite annual stops, meeting voters. Great to see Rutherford's next Mayor Frank Nunziato + @BergenDems Freeholders Amoroso, Sullivan & Ortiz and more! #GOTV", "2019-11-04T02:00:42.000Z": "Ending a thrilling #GOTV weekend close to home with the Red Bank Democrats supporting Council candidates Kathy Horgan and Erik Yngstrom and the @NJLD11 team! Can't wait to be back out tomorrow getting Democrats ready to vote on Tuesday", "2019-11-04T00:54:28.000Z": "Goooooo @LisaMandelblatt & @LisaBhimani ! Go Team Blue!\n\nAs inspired by @PhilMurphyNJ & @Malinowski", "2019-11-03T11:33:35.000Z": "Thank you for knocking on doors with us in Manville, supporting our local candidates, Freeholder, Sheriff, and everyone up and down the ticket Quote Tweet Tammy Murphy @TammyMurphyNJ Somerset is getting bluer thanks to the leadership of Chairwoman Peg Schaffer and the @SomersetNJDems !\n\nThis year they're working to take the Freeholder Board and Sheriff's Office by electing Marano + Russo on Tuesday, plus sending @AndrewZwicker and @RoyFreiman back to Trenton!", "2019-11-04T01:34:01.000Z": "Closing out an exhilarating #GOTV Weekend in Short Hills supporting an excellent local slate of Democrats alongside @RichardCodey  @JohnFMcKeon  @BrendanWGill Len Luciano, Chairman LeRoy Jones and more. We'll be back on the campaign trail tomorrow rallying Democrats to vote Tuesday", "2019-11-04T01:02:03.000Z": "Make sure you vote column two in Morris County this Tuesday! #GOTV", "2019-11-04T00:40:23.000Z": "And thank you Senator @vingopal , Tinton Falls Council President and Vietnam vet Gary Baldwin, and @NJLD11 for your tireless support to expand this deduction and make our tax code fairer for our veterans. #VoteforVets Our veterans fought for fairness and equality. They deserve the same, legislator says. Veterans who own their units in a continuing care retirement community don't qualify as \"homeowners\" under existing law and can't take the veterans' property tax deduction nj.com", "2019-11-04T00:40:20.000Z": "On Tuesday, I urge you to vote Yes on Public Question 1, giving veterans in continuing care retirement communities the same property tax deduction as those living in private homes.\n\nOur vets fought for our freedom and deserve even standards in retirement. Should NJ expand its veterans property tax break? Voters will decide Tuesday Currently veterans who served in times of war, armed conflict or emergency are eligible for the tax break on their homes or other property. But those eligible vets who live in so-called continuing... burlingtoncountytimes.com", "2019-11-03T22:23:42.000Z": "Arvin Amatorio and his team are working hard to give Bergenfield a Democratic Mayor and move the community forward, and it was great to help their #GOTV !", "2019-11-03T22:50:25.000Z": "We're working alongside @SpeakerCoughlin to expand our Democratic Assembly majority on Tuesday and I'm glad to be with the @MCDO Team for a #GOTV Rally", "2019-11-03T21:00:15.000Z": "Under the leadership of\nChairman Juliano, Democrats all over Bergen County are working hard to get ready for Tuesday. \n\nIt was great to talk with voters outside of Shoprite in Hackensack with @GMJohnsonNJ & Freeholders Ortiz, Amoroso, & Sullivan & rally for #GOTV in Ridgefield!", "2019-11-03T20:30:40.000Z": ". @Malinowski 's victory last year was a breakthrough for Democrats, and it's great to stand with him today to support Lisa Mandelblatt and Stacey Gunderman as we work together to @Flip21Blue ! #GOTV", "2019-11-03T19:31:39.000Z": ". @ChrisHillmann is working incredibly hard to be the next Mayor of Hasbrouck Heights and we're here to stand with him and his running mates, knock on doors, and launch a canvass of @BergenDems supporters! #GOTV", "2019-11-03T19:57:20.000Z": "Democrats in Paramus know how to deliver for their community, and I'm glad to be here with Mayor LaBarbiera, @BergenExec Tedesco, Senator @JoeLaganaNJ , Assembly members Swain and Tully, Council candidates Ralph Amato & Dennis Arslanian, Freeholders and many more friends!", "2019-11-03T20:06:37.000Z": ". @SomersetNJDems and their Chair Peg Schaffer are kicking it into overdrive to elect Melonie Marano as Freeholder, Darrin Russo as Sheriff, and state and local candidates. We're here to help get this canvass fired up and ready to go. #GOTV", "2019-11-03T19:33:09.000Z": "Great to be in Livingston to support Michael Vieira for Council along with Chairwoman Pat Sebold and Essex Democrats like @Joe_D_EssexExec , Chairman Jones, @BrendanWGill and more #GOTV", "2019-11-03T17:47:40.000Z": "Congratulations to my friend @BergenDems Chairman Paul Juliano on another successful Pre-Election Breakfast in Fairview. The Democrats in this room are fired up to win all over Bergen County on Tuesday!", "2019-11-03T16:58:05.000Z": "On to a Democratic victory up and down the ballot in Monmouth County! #GOTV", "2019-11-03T15:24:28.000Z": "Monmouth County the kind of place our message of a stronger + fairer NJ is really resonating, and I'm excited to be back today helping kick off another strong #GOTV canvass for @NJLD11, @penna_nelson , and local democratic candidates!", "2019-11-03T00:49:59.000Z": "A quick reminder from our friends in Somerset County to #GOTV on Tuesday!", "2019-11-03T00:32:53.000Z": "Somerset is getting bluer thanks to the leadership of Chairwoman Peg Schaffer and the @SomersetNJDems !\n\nThis year they're working to take the Freeholder Board and Sheriff's Office by electing Marano + Russo on Tuesday, plus sending @AndrewZwicker and @RoyFreiman back to Trenton!", "2019-11-02T22:54:16.000Z": "The crowds were jumping today at Plainfield Democrats HQ, Plainfield High School, and Crescent Ave Presbyterian Church. @MayorMapp , Assemblywoman Linda Carter, and many other local leaders have everyone ready to #GOTV on Tuesday", "2019-11-02T22:37:05.000Z": "In 2018, Burlington Dems flipped control of the Freeholder Board & elected @AndyKimNJ . This year we're working to elect Gina LaPlaca & Mark Natale to Assembly & Anthony Basantis for Sheriff!\n\nGreat show of support at the Marlton launch & thanks to Chairman Andl for the welcome!", "2019-11-02T20:27:58.000Z": "Still going strong in NJ for Somerset County Freeholder Candidate Melonie Marano & LD 21 candidates @LisaMandelblatt & @Flip21Blue  #GOTV", "2019-11-02T20:22:00.000Z": "Continuing my afternoon with the @BergenDems at their headquarters in Hackensack making calls to voters throughout the county. This is a great group of volunteers along with Chairman Juliano + Assembly members Lisa Swain, Chris Tully, @ClintonCalabre1 , @GMJohnsonNJ", "2019-11-02T20:04:17.000Z": ". @BergenDems are competing all over the county, and it was great to spend some time with @CarlstadtDems candidates Dennis Ritchie, @FucciJeff + @AmandaKarper along with Chairman Juliano, @PaulASarlo , @ClintonCalabre1 , @SteveTanelli and other South Bergen leaders", "2019-11-02T19:04:58.000Z": "A busy day of #GOTV continues with a quick stop for lunch with my good friend @morrisdems Chair Chip Robinson and Chatham's next Mayor, Democrat Thad Kobylarz + team", "2019-11-02T19:04:17.000Z": "The @morrisdems are out in force this morning working to elect Carolyn Blackman as the next Mayor of Dover. Proud to stand with Carolyn and her team this morning and look forward to a big win on Tuesday.", "2019-11-02T16:33:09.000Z": "32BJ members were joined by @GovMurphy and Alderwoman Carolyn Blackman at our campaign launch today in Dover! It's a busy day of #GOTV in NJ, with #electionday2019 only a few days away.", "2019-11-02T15:43:19.000Z": ". @OceanDems have truly outstanding candidates for this year in @EileenandErin for Assembly, Gene Davis for Sheriff + @JACandDTWforOC for Freeholder, and it was exciting to knock on doors with them this morning and launch such an incredible group of canvassers! #GOTV", "2019-11-02T16:08:52.000Z": "A little message from our Ocean Democratic Chairman Wyatt Earp and our @OceanDems friends in LD10! #GOTV", "2019-11-02T15:42:43.000Z": "Diversity makes our party and our state stronger every day, and today's Diwali event in Parsippany is a great example of different cultures coming together. Thanks to @sorianoformayor for bringing people together and working hard to elect Democrats!", "2019-11-02T14:01:58.000Z": "3 days to go!  We can't do it without you.  Be a voter and help us flip Somerset County!  Link below for more info.  \n\nVote Column 1 on November 5th! #russo4sheriff  #marano4freeholder  #realprogress  #beavoter  https:// russomarano.com/voter-informat ion/ ", "2019-11-02T14:39:39.000Z": "US House candidate, NJ-6 Frank joined @FirstLadyNJ and @EricH4Assembly and @Downey4Assembly to launch volunteers from #SEIU in Long Branch this morning. Knocking doors is the most effective thing you can do to help local Democrats win! So get knocking, and most importantly: #VoteBlue on Tues, Nov. 5!", "2019-11-02T13:34:39.000Z": "Excited to be in our home county this morning helping the @MonmouthDems launch a canvass in support of great candidates like @NJLD11, @penna_nelson and more. Great to see @pallonefornj , Mayor Pallone + SEIU 32BJ in action!", "2019-11-02T13:49:18.000Z": "Couldn't think of a better way to start #GOTV Saturday than joining @NJDSC Chairman John Currie for the Passaic County Democrats Annual Breakfast. In addition to making our state party stronger than ever, Chairman Currie has Passaic County Dems ready for Tuesday", "2019-11-02T00:56:24.000Z": "Second #GOTV stop of the night is in Roselle Park, where Chairman @SenatorScutari , @SenatorJoeCryan + county and local Democrats are working hard to @Flip21Blue and win seats up and down the ballot", "2019-11-02T00:22:04.000Z": ". @morrisdems are ready to #GOTV ! Great turnout in East Hanover with @SpeakerCoughlin for Chairman Chip Robinson's pre-election rally! \n\nWe must finish strong for @LisaBhimani , @Clarke4Assembly , @Fortgang4Asmbly , @DarcyDraeger & all of the Democratic candidates in Morris County!", "2019-11-01T23:25:07.000Z": "Kicking off #GOTV weekend at the @MercerDems Dinner, where there is a major crowd of excited Democrats getting ready for Tuesday. Great to see @BrianMHughes , Chairwoman Mironov and many other friends", "2019-10-31T21:07:53.000Z": "I'm excited to hit the campaign trail this weekend with @TammyMurphyNJ to rally support for Democrats all over our state, from the Assembly to crucial local and county races. Governor, First Lady begin agressive campaign swing to boost Democratic candidates - New Jersey... Gov. Phil Murphy and First Lady Tammy Murphy will launch a whirlwind campaign swing through New Jersey beginning on Friday, making 26 stops in twelve newjerseyglobe.com", "2019-10-31T21:07:52.000Z": "Tuesday's election is an opportunity to unite behind candidates who share our values and will work to continue the tremendous progress we've made with our partners in the Legislature, including @SpeakerCoughlin and our Democratic Assembly caucus, and county and local officials.", "2019-10-31T02:21:59.000Z": "Great night with @Fortgang4Asmbly , @AswTimberlake , @Clarke4Assembly , @OurRevEssexNJ and @GovMurphy to rally Dems to #GOTV for #ElectionDay on Tuesday, November 5th!", "2019-10-30T15:49:47.000Z": "Last night I was proud to speak to the @MontclairDems & connect with so many friends & local activists who are making a difference in their community. Congrats to the honoree longtime Montclair organizer Willie Walker, & thank you to Chairman @BrendanWGill & all Montclair Dems!", "2019-10-31T00:39:23.000Z": "Enjoyed spending time with the Neptune Democrats tonight rallying support for Carol Rizzo & Robert Lane and the entire @MonmouthDems team! Great to see @vingopal and other local leaders working to flip this county blue", "2019-10-28T20:16:35.000Z": "US House candidate, NJ-4 Yesterday's pre-election brunch is still fueling my #MondayMotivation to #gotv for the incredible people running for office in Monmouth County. It was an honor to meet w/ @GovMurphy and hear from candidates Eric Houghtaling & Joann Downey (@NJLD11), & @penna_nelson . #Election2019", "2019-10-27T22:03:51.000Z": "An incredible morning in West Caldwell kicking off a canvass & phone banking in support of @Clarke4Assembly & @Fortgang4Asmbly ! Laura & Christine's passion shown through their dedicated supporters who didn't let the rain stop them from knocking doors & contacting voters", "2019-10-27T15:02:00.000Z": "By investing in students and schools now, @GovMurphy is strengthening New Jersey's future : Quote Tweet Governor Phil Murphy @GovMurphy #1 public schools in the nation Historic levels of school funding \"Computer Science for All\" Initiative Universal arts education P-TECH model implementation Expanded access to high-quality pre-K\n\nEducation is the backbone of a stronger and fairer New Jersey.", "2019-10-26T00:44:54.000Z": "Great night meeting voters in Westfield with the @Flip21Blue team! Lisa and Stacey are both working incredibly hard to connect with as many people as possible and their energy and dedication are an inspiration. #GOTV", "2019-10-25T00:10:24.000Z": "Excited to be in Hudson County tonight supporting our good friends at the @HudsonDems . Chairwoman @Amy_DeGise and her team packed the house and they're ready to #GOTV on November 5!", "2019-10-20T22:19:11.000Z": "Democrats all over NJ are working hard for victories on November 5, and that includes Sussex County where Chairwoman Katie Rotondi and the @SCDC51124 are fired up and ready to go!", "2019-10-20T15:44:59.000Z": "I saw a room packed with fired up Democrats ready to win in November at the @BergenDems Saturday morning meeting in Woodcliff Lake. This is the kind of local organizing that flips seats from red to blue.", "2019-10-16T01:38:29.000Z": "Senator @JoeLaganaNJ is a rising star in our Democratic Party and his Beefsteak dinner is quickly becoming one of the best political events of the year. Congratulations Joe on a great night!", "2019-10-15T12:02:27.000Z": "I support Jersey City's Local Ordinance 19-077. Short-term rentals should be regulated. #VoteYesJC Quote Tweet Share Better @Share_Better \" #VoteYesJC prevents commercial operators, many of whom are not based in JC, from converting entire neighborhoods into full-time hotels, which limits housing & increases rents for residents. These rules prioritize the people of Jersey City over corporate profits\"- @HudProgressives", "2019-10-12T18:44:40.000Z": "The same issues that speak to New Jerseyans resonate in Florida -- we all want to keep our communities safe from the scourge of gun violence, break down barriers to equality and take on the very real challenge of climate change.", "2019-10-12T18:44:39.000Z": "Florida is going to be ground zero for @realDonaldTrump 's misinformation campaign over the next 13 months, so I was excited to address @FlaDems today to talk about the urgency of electing a Democratic president in 2020. #FlaDems19", "2019-10-09T20:18:51.000Z": "@GovMurphy , Governor of New Jersey, incoming chairman of the Democratic Governors Association and advocate for action on climate change, building an economy and nation that works for every American family. #flapol  #FlaDems19", "2019-10-09T02:28:02.000Z": "Assemblyman @BenjieWimberly is one of New Jersey's extraordinary leaders with an unparalleled commitment to working families. I was proud to headline an event tonight supporting Benjie and look forward to continuing to work with him to make NJ stronger and fairer.", "2019-10-08T12:11:04.000Z": ". @TammyMurphyNJ and I were in Bergen County last night to join Chairman Paul Juliano for the @BergenDems Annual Hall of Fame Dinner. Great to see so many friends and to recognize some of the grassroots Democrats who have helped turn our state's most populous county blue", "2019-10-03T01:22:20.000Z": "Here in NJ, we're fighting for tax fairness for middle class families. In 2018, we achieved the lowest growth of property taxes in state history, and we did it by investing in middle class priorities like our public school systems.", "2019-10-03T01:21:38.000Z": "Only a DC Republican would cut taxes for the wealthy & corporations at the expense of middle-class families and then dare lecture anyone about tax policy. \n\nThis is why you and your colleagues are now in the minority: you're not fooling anyone anymore. Quote Tweet Rep. Kevin Brady @RepKevinBrady NJ is a great state - but only ones \"taking it out on innocent property taxpayers\" are NJ state/local govt leaders, @GovMurphy Instead of fighting to brutally tax NJ families & local businesses - why not try lowering their taxes? #GiveThemABreak  https:// nj.com/politics/2019/ 10/judge-tosses-nj-lawsuit-seeking-to-save-your-property-tax-break-heres-what-murphy-said.html  Show this thread", "2019-10-02T01:36:38.000Z": "Was an honor and a pleasure to meet First Lady @TammyMurphyNJ this evening. Thank you to all who gave their support; we can't do it without you! #RightHereAtHome", "2019-10-01T21:50:19.000Z": "This year's @NJDSC Conference was better than ever, and now we're focused on organizing our voters and supporting Democratic candidates for State Assembly and local + county offices this November. NJDSC 2019 Conference youtube.com", "2019-09-30T17:55:04.000Z": "Thank you Speaker Pelosi for supporting @NJDSC and our mission of making NJ stronger and fairer. You've shown extraordinary courage and patriotism in taking the necessary step of starting an impeachment inquiry into President Trump, and it was an honor to spend this time together Quote Tweet Nancy Pelosi @TeamPelosi US House candidate, CA-12 Thank you Gov. @PhilMurphyNJ , Chairman Currie and the @NJDSC for your invitation to speak and hospitality at the @NJDSC Conference. Your theme of \"Uniting for Progress\" is an inspiring message for NJ and for all who fight for a brighter tomorrow #ForThePeople . -NP Show this thread", "2019-09-29T21:55:24.000Z": ". @CoryBooker has reached a critical moment in his campaign and needs resources to compete for the nomination during the final stretch. I know he's the best candidate to heal our country, deliver real justice for all and beat Donald Trump.\n\nGo to http:// CoryBooker.com/together to donate.", "2019-09-28T22:49:58.000Z": "Wanted to thank @PhilMurphyNJ for his continued support and inclusion of progressives in this party! The grassroots is the party's pulse and we are lucky to have you lead our state!", "2019-09-29T15:25:55.000Z": "Passaic County Democrats have an incredible team led by Chairman John Currie and @PascrellforNJ , two tremendous advocates for working families who have done so much for NJ. Thanks to @AssadAkhter for the invitation -- I'll always be there for Passaic County! Quote Tweet Assad Akhter @AssadAkhter Thank you to @philmurphy4nj, Chairman John Currie, @pascrellfornj , @andresayeghnj and so many others for joining us at our home in support of the Row A Democratic Ticket this year!  \n\nLet's get out the vote on Tuesday November 5th!", "2019-09-29T00:05:17.000Z": "Great afternoon today in Somerville visiting local businesses and supporting outstanding local @SomersetNJDems like Freeholder Sara Sooy, Mayor Dennis Sullivan and many more. Somerset Co. is turning blue thanks to great work from Chairwoman Schaffer + local activists", "2019-09-28T01:42:37.000Z": "Thank you NJ Democrats! A record crowd of 2,500 attendees came to our Annual Conference today and were treated to an incredible day capped off by inspiring words from @TeamPelosi  @PhilMurphyNJ  @CoryBooker and Chairman Currie.", "2019-09-27T23:57:44.000Z": ". @TeamPelosi : \"What a model for the rest of the country you have in @PhilMurphyNJ \"", "2019-09-27T21:42:49.000Z": "Chairman Currie just welcomed Speaker Pelosi to the NJDSC Conference. Our Closing Reception featuring the Chairman, @PhilMurphyNJ , @CoryBooker and @TeamPelosi begins at 6pm!", "2019-09-27T12:53:34.000Z": "We're ready for Day Two of our Annual Conference in Atlantic City! The room is filling up at our Faith in the Democratic Party Breakfast and we're excited to hear from @LtGovOliver , @SpeakerCoughlin and faith leaders from throughout the state", "2019-09-27T02:46:25.000Z": "Great to see so many friends from across the state tonight at the @NJDSC Conference. Excited for a full day of outstanding programs tomorrow capped off by a visit from @SpeakerPelosi", "2019-09-26T23:38:33.000Z": "\"We stand for that stronger and fairer New Jersey that we promised. We are what we said we would be. We know that we cannot make economic progress without social progress.\" - @GovMurphy", "2019-09-26T20:32:46.000Z": "I'm sure you've heard the news about our special guest @TeamPelosi , and I applaud her for beginning the impeachment inquiry and taking decisive action to hold the President accountable", "2019-09-26T20:32:13.000Z": "While this is a discouraging time in Washington, here in NJ we're moving forward by making our state stronger and fairer for every family", "2019-09-26T20:31:39.000Z": "The @NJDSC Conference starts tonight, and I'm looking forward to seeing you there! There's still time to register to attend and join us Register for the NJDSC Conference! Join us! Contribute today. secure.actblue.com", "2019-08-29T16:25:28.000Z": "We are excited to announce that House Speaker Nancy Pelosi will be a Special Guest at NJDSC's Annual Conference in Atlantic City! @SpeakerPelosi will encourage Democrats statewide to get active & involved heading into November. N.J. Democrats helped make Nancy Pelosi Speaker of the House. She's now paying the state party back. House Speaker Nancy Pelosi will be the featured speaker at the New Jersey State Democratic Committee's conference next month. nj.com", "2019-08-29T17:12:58.000Z": "Could not be more excited to welcome @TeamPelosi to NJ next month at our annual @NJDSC Conference! Sign up now to join us in Atlantic City. Register for the NJDSC Conference! Join us! Contribute today. secure.actblue.com", "2019-08-16T20:52:10.000Z": "El Gobernador Phil Murphy firmó este jueves, designando el tercer domingo de septiembre de cada año como el \"Día de #PuertoRico \" en #NuevaJersey . Nueva Jersey es el hogar de la tercera población puertorriqueña más grande en los Estados Unidos continentales. ¡Wepa! #PuertoRicoNJ", "2019-07-19T18:13:43.000Z": "Building an economy that works from the middle class out and the bottom up is good policy and good politics. Pro-growth progressive policies work.\n \nI'm proud of our Dem field for bringing these issues to the forefront. Anxious Democratic Governors Urge 2020 Field Not to Veer Too Far Left \"I think it scares people,\" Gov. Michelle Lujan Grisham of New Mexico said of a proposal to eliminate private health insurance. Other governors echoed similar concerns. nytimes.com", "2019-07-18T00:56:08.000Z": "In 16 months, we'll be able to send a clear message to @realDonaldTrump and his GOP enablers: America is better than this. It is incumbent on all of us to make the man who inspired this racist chant a one-term president. Quote Tweet The Daily Beast @thedailybeast Trump rally crowd launches into \"send her back\" chant over Ilhan Omar https:// trib.al/Jxsf3a2", "2019-07-17T23:28:33.000Z": "Honored to speak tonight in support of Paul Juliano, our next @BergenDems Chairman. Paul's commitment to grassroots organizing and good government will make him a strong leader and someone I'm excited to work with to build our Democratic Party.", "2019-07-16T21:58:42.000Z": "Lisa Mandelblatt and Stacey Gunderman both know that enacting some of the toughest gun laws in the country will make our communities safer for all of us. Their opponents choose to side with the NRA against common sense gun safety, which is one of many reasons to @Flip21Blue Quote Tweet Mandelblatt & Gunderman for Assembly @Flip21Blue Proud to stand alongside @MomsDemand as @GovMurphy signs Gun Safety Package 2.0 which requires, among other things, that NJ retailers sell at least one type of \"smart gun\", legislation our NRA endorsed opponents voted against. #enough  #Expectus  #GVP", "2019-07-11T15:23:01.000Z": ". @GovMurphy 's 2020 budget includes $68 million to expand preschool in NJ - making early childhood education more accessible. Quote Tweet TurrellFund @TurrellFund Proud that the 2020 NJ budget demonstrates a commitment to the very young, our most precious commodity!\n- $9M in increased #childcare funds\n- $68M to expand #preschool - $9M for state and local #census outreach\nThank you @GovMurphy for your leadership! @RightStartNJ  #ThinkBabies", "2019-07-09T21:37:00.000Z": ". @GovMurphy recently signed important bills into law to provide benefits to the brave first responders who risked their lives during rescue, recovery, and clean-up efforts on 9/11. Quote Tweet Governor Phil Murphy @GovMurphy Our 9/11 first responders didn't think of themselves, they thought of others. They didn't ask to go, they went.\n\nToday, we did our part to set things right for every 9/11 first responder who waited too long for a full accidental disability retirement. https:// nj.gov/governor/news/ news/562019/approved/20190708a.shtml ", "2019-07-01T15:37:04.000Z": "We all know @realDonaldTrump is fighting for millionaires like himself. I'm fighting for New Jersey's middle class and all those working to get there. Quote Tweet Donald J. Trump @realDonaldTrump Congratulations to legislators in New Jersey for not passing taxes that would have driven large numbers of high end taxpayers out of the state. Many were planning to leave, & will now be staying. New York & others should start changing their thought process on taxes, fast!", "2019-06-30T21:14:56.000Z": "The work on our Fiscal Year 2020 budget ends today. But, the fight for the middle class, and all those working to get there continues.\n\nSo, the question is: Whose side are you on?\n\nMy answer? Yours.", "2019-06-27T03:33:17.000Z": "Proud of @CoryBooker 's performance tonight at the #DemDebate . He's spent his entire career running toward big challenges others have given up on, and taking on tough fights to lift up those most in need.", "2019-06-25T21:00:04.000Z": "Join us for the Governor's budget town hall at 6:00 p.m.! Call 609-256-4984 to share your voice and learn about his Blueprint for the Middle Class.", "2019-06-19T02:20:06.000Z": "@TammyMurphyNJ and I are proud to know his family and call him a friend. May he rest in peace.", "2019-06-19T02:19:26.000Z": "Joe Simunovich dedicated his life to public service: writing speeches for Bobby Kennedy, serving in public office and working with conviction across countless boards and organizations. His contributions to healthcare in New Jersey are immeasurable.", "2019-06-16T21:14:46.000Z": "US Senate candidate, NJ As we honor the lives of the Emanuel Nine, their families, and the survivors, let's recommit ourselves to using love as a radical, universal tool for justice and healing. #MotherEmanuel", "2019-06-12T01:34:47.000Z": "Energizing day in Iowa stumping for @corybooker . Everywhere we went, folks are connecting to his message and the campaign is building support.", "2019-06-11T23:13:50.000Z": "Love being back at a packed Cooney's Tavern! Great to have @PhilMurphyNJ here explaining why @CoryBooker should be our next President! Also love that the #hopehypehustle of hall of fame has traveled back to Des Moines to help light up the place!", "2019-06-11T23:07:13.000Z": ". @KonfrstForHouse and @PhilMurphyNJ bringing the HEAT at Cooney's this afternoon #Cory2020  #IACaucus", "2019-06-06T15:45:58.000Z": "Your checklist for Tuesday, 6/11: Go about your daily business Head to Cooney's Tavern at 5:30 Meet @PhilMurphyNJ Just a typical Tuesday in Beaverdale with your NWDM Dems and @polkdems crew. This event is free and open to all #Dems !", "2019-06-06T16:04:18.000Z": "Sat down with Gov. @PhilMurphyNJ to talk, among other things, about his passion, which is rebuilding America-and why it isn't getting done. #AxeFiles on @hearluminary ! https:// luminarypodcasts.com/premium?_refer rer=twitter&_branch_match_id=548676450829899533&country=US ", "2019-05-31T14:26:34.000Z": "An incredible show of support for @GovMurphy and his #MiddeClassBlueprint in Union City this week!", "2019-05-29T02:33:36.000Z": "No one throws a party like @mayorstack ! Had a great time spending the night with 5,000+ friends in Union City and talking about our #MiddleClassBlueprint and the need for tax fairness Quote Tweet Assemblywoman Chaparro @AChaparro33 @mayorstack  @GovMurphy  @RajMukherji  @moli315 What a great night, Union City!!", "2019-05-22T02:20:18.000Z": "Congrats to @AndyBeshearKY on your primary win tonight. @GovMattBevin is entering the general election as a deeply flawed and unpopular incumbent. Attacking teachers and jeopardizing funding for public schools hurts both the economy and middle class. #KYGOV", "2019-05-15T03:00:41.000Z": "Congratulations to @NicholasJSacco in North Bergen, Gabriel Rodriguez in West New York, @SheenaCollum in South Orange, Advocates for Ocean team and all of the other victorious candidates in today's nonpartisan municipal elections.", "2019-05-11T15:00:00.000Z": ". @GovMurphy signed 10 measures into law this week aimed at helping New Jersey residents facing hunger. His leadership is bringing the Garden State further in combatting hunger in communities across the state. Governor Phil Murphy Signs Bills To Help Fight Hunger In New Jersey Murphy says roughly one in 10 residents faces hunger. philadelphia.cbslocal.com", "2019-04-26T02:53:11.000Z": "Draft night at the Murphy household. A brief NFL interlude into baseball season.", "2019-04-22T21:27:15.000Z": "I hope you'll join me tonight for a telephone town hall on our #MiddleClassBlueprint budget proposal. Talk to you soon! Quote Tweet NJ Dems @NJDSC . @GovMurphy will be live on the line in less than one hour! Join us for the Governor's latest telephone town hall at 6pm, 609-256-4984. https:// facebook.com/events/5829598 62200275/ ", "2019-04-16T21:39:52.000Z": "Our newly elected Democratic governors have hit the ground running - boosting funding for education and infrastructure, investing in clean energy, and defending the Affordable Care Act. Proud to build on this progress as @DemGovs Vice Chair. https:// washingtonpost.com/national/in-th eir-first-months-on-the-job-democratic-governors-seek-to-roll-back-republican-predecessors-policies/2019/04/15/4bce78d8-5c70-11e9-842d-7d3ed7eb3957_story.html?noredirect=on&utm_term=.86267fa5807b ", "2019-04-13T18:30:55.000Z": ". @TammyMurphyNJ and I were thrilled to help our friend @CoryBooker kick off his campaign for President on a gorgeous day here in Newark. Cory is fighting for justice for all and his message of hope and optimism is exactly what our country needs right now.", "2019-04-05T20:20:01.000Z": "My friend @CoryBooker is hosting a Hometown Kickoff next Saturday in Newark. We need a president with bold vision and even bolder optimism. RSVP here! https:// mobilize.us/corybooker/eve nt/89050/ ", "2019-04-02T20:43:39.000Z": ". @GovMurphy in New Jersey signed a bipartisan equal pay and anti-discrimination bill that Governor Chris Christie had previously vetoed: Equal pay becomes law in New Jersey, setting a 'national standard' for wage practices Equal pay for equal work was one of Phil Murphy's many campaign promises. On Tuesday he signed a law requiring that in New Jersey. northjersey.com", "2019-04-03T01:41:54.000Z": "Here's me tonight with our youngest dog, Lulu. We lost our oldest dog Sasha ten days ago, and our home will never be the same. Here's a reminder to hug everyone in our families as often as we can (whether furry or not).", "2019-03-30T16:38:33.000Z": "Spent the morning with a fired up crowd of Sussex County Democrats ready to build on our successes last year. Great to see Chairwoman Leslie Huhn and our outstanding Assembly candidates Deana Lykins and Dan Smith.", "2019-03-21T20:53:08.000Z": "I spoke to Brian Williams on @MSNBC 's @11thHour last night about why we're working hard to legalize adult-use marijuana. NJ has the largest disparity in black-white marijuana arrests and legalization and expungement are major steps toward ending that injustice. The time is now.", "2019-03-17T15:23:01.000Z": "Happy Saint Patrick's Day, New Jersey! The Irish are represented well by today's Freehold St. Pat's Parade Grand Marshall, the great Tim McLoone!", "2019-03-13T14:06:55.000Z": "Thank you to our partners in this effort @NJSenatePres , @SpeakerCoughlin , @SenatorScutari , @AnnetteQuijano , @jamelholley and the many advocates who have been on the front line of this issue", "2019-03-13T14:05:47.000Z": "Yesterday, we announced a monumental step forward toward legalizing adult-use marijuana. This will truly make our state stronger and fairer for everyone. Quote Tweet New Jersey @NJGov Today, @GovMurphy and legislative leaders announced an adult-use marijuana agreement:\n\n Legal for New Jerseyans 21 and older\n\n Expedited expungement process for individuals convicted of low-level marijuana offenses\n\n Promotes industry diversity and community reinvestment", "2019-03-10T13:55:48.000Z": "Hats off to our friend and Rumson St. Pat's Grand Marshall John Croddick! Here's a picture from 2015 when I was honored to march as Grand Marshall.", "2019-03-09T02:34:57.000Z": "Governor @PhilMurphyNJ delivered his 2020 budget proposal this week, and in case you missed it you can check out the highlights of the #MiddleClassBlueprint right here!", "2019-03-05T20:16:39.000Z": "I just finished presenting our 2020 budget plan, including unprecedented savings so we continue our unprecedented investments in the middle class. Join me in supporting the #MiddleClassBlueprint   https://newjerseystat edemocraticcommittee.forwardaction.io/sign/budget_ad dress ", "2019-03-03T15:48:17.000Z": "Congrats to all those marching in today's St. Patrick's Day Parade in Belmar, especially to my good friend former Lake Como Mayor Mike Ryan! I cannot think of anyone better to serve as Grand Marshall. Sláinte!", "2019-02-27T15:58:58.000Z": "Saddened to hear of the passing of Anne Iannone, a founder of the Somerset County Federation of Democratic Women and former Vice Chair of the @SomersetNJDems . Tammy and I are keeping Anne's family and friends in our prayers.", "2019-02-23T20:01:17.000Z": "US Senate candidate, NJ It's not enough to just legalize marijuana at the federal level-we should also expunge records of those who have served their time, and reinvest in communities hardest hit by the failed War on Drugs-which has really been a war on people.", "2019-02-23T15:23:31.000Z": "US Senate candidate, NJ The US is the only industrialized nation to not guarantee paid family leave. Only a handful of states including New Jersey have paid family leave laws-grateful to @PhilMurphyNJ for continuing our state's leadership on this issue. Big changes coming for paid family leave in N.J. as Murphy signs law Gov. Phil Murphy signed a law Tuesday boosting benefits under the state's paid family leave program. nj.com", "2019-02-22T14:45:03.000Z": "No one should be forced to choose between caring for family and earning a paycheck. The paid family leave expansion we signed into law this week will ensure that and support middle class families.", "2019-02-21T13:08:54.000Z": ". @CoryBooker has spent his entire career running toward big challenges others had given up on, and taking on the tough fights to lift up those most in need of help.\n\nJoin the campaign by texting JOIN to 40203", "2019-02-10T16:52:31.000Z": "A $15 minimum wage means over 1 million working NJ residents will soon be on a path out of poverty and into the middle class, thanks to @PhilMurphyNJ and legislative Democrats. #Fightfor15 What a $15 Minimum Wage means -- NJDSC Watch testimony from advocates celebrating the passage of the $15 minimum wage bill and hear from Governor Phil Murphy, Senate President Steve Sweeney, and A... youtube.com", "2019-02-01T12:30:11.000Z": "Cory Booker ran toward the toughest problems and has fought to build a more just and fair nation for everyone, from his days on the Newark City Council, as mayor, and as a U.S. Senator. He'll make an amazing President. Quote Tweet Cory Booker @CoryBooker US Senate candidate, NJ I'm running for president. Join me on this journey. http:// corybooker.com", "2019-01-31T01:11:55.000Z": "At Rutgers/Indiana game...we are tied at 29 in second!!", "2019-01-27T02:31:53.000Z": "Outstanding night at the @BergenDems Annual Gala celebrating our many victories in 2018 and looking forward to more with the leadership of Chairman Stellato, @PascrellforNJ , @BergenExec , @JoshGottheimer and so many wonderful friends.", "2019-01-26T21:14:58.000Z": "Training today with our youngest, Sam.", "2019-01-23T15:38:02.000Z": "Volker and his contemporaries like Werner Herzog, Wim Wenders and Rainer Fassbinder reestablished the German cinema. We will dine with many of the leaders in the New Jersey film community. After all, we think New Jersey is the next big thing in American cinema!", "2019-01-23T15:37:36.000Z": "I am thrilled to welcome our dear friend, academy award winning director (The Tin Drum) Volker Schloendorff and his daughter, Elena, to New Jersey this evening. We became very close to Volker and his family during our years in Berlin.", "2019-01-19T18:42:15.000Z": "Until this shutdown ends, it is incumbent upon all of us to help our fellow New Jerseyans through this difficult time. Thrilled to team up with @JBJSoulFound to offer meals to furloughed federal workers this Monday, 12p-2p.", "2019-01-17T20:49:33.000Z": "Thrilled to announce that we've reached an agreement with @NJSenatePres and @SpeakerCoughlin to raise New Jersey's minimum wage to $15/hour. \n\nWe are taking a historic step to provide more than one million New Jersey workers a stronger foothold in the middle class.", "2019-01-17T15:49:04.000Z": "Tam's favorite picture of her sister, Susan, and me. Susan was guarding me in touch football. We all miss her and I cannot believe she is gone.", "2019-01-16T18:09:03.000Z": "On a much lighter note, Tammy and I had our first date 25 years ago today. Wow! The best thing that ever happened to me!", "2019-01-16T18:08:33.000Z": "And, sadly, only a few hours before Sue passed away, the singular Carol Channing - the all time Dolly - had passed.", "2019-01-16T18:07:20.000Z": "Why? Because her family was enthralled with Hello Dolly which was a Broadway hit then. Wouldn't you know it that separately Hello Dolly was - and remains - my favorite show of all time.", "2019-01-16T18:06:25.000Z": "Lots of emotions these couple of days, some good, some challenging. Tammy lost her sister Sue yesterday unexpectedly. So sad. Sue was 15 years older than Tammy. Speaking of which, Tammy was born in 1965 and came close to being named Dolly.", "2019-01-15T19:09:26.000Z": "One year ago, I took the oath of office as New Jersey's 56th Governor. Our journey toward a #StrongerFairerNJ , where we can all grow and prosper, has just begun. Join me live in Trenton for my first State of the State address. #StateoftheStateNJ  https:// youtube.com/watch?v=AVF8Rr JWCos&feature=youtu.be ", "2019-01-15T03:08:51.000Z": "On the way home from Newark, preparing for tomorrow's State of the State speech with an assist from Derek and the Dominos.", "2019-01-15T01:29:38.000Z": "GO DEVILS!!!", "2019-01-13T15:05:03.000Z": "Rehearsing my State of the State speech in Trenton this morning.", "2019-01-13T04:11:43.000Z": "Watching NFL playoffs with the gang.", "2019-01-08T05:00:51.000Z": "Crazy national title game. Clemson crushed Alabama. Stunned. That's why they play the game.", "2019-01-04T01:10:31.000Z": "I'm incredibly proud of the newest Democratic members of our NJ Congressional delegation, who have shown what's possible when we combine great candidates with grassroots support and a mandate for change. Congrats @MikieSherrill  @AndyKimNJ  @Malinowski  @VanDrewForNJ", "2018-12-01T17:41:22.000Z": "I'm honored to serve as @DemGovs Vice Chair for 2019. In NJ, we're showing how Democratic leadership brings real results & safeguards the values of our working families. I look forward to teaming with @GinaRaimondo & all Democratic Governors to move our country forward.", "2018-12-01T05:49:32.000Z": "From the Navy to the CIA, from Congress to the Presidency, President George Herbert Walker Bush lived his life in service to his fellow Americans. He leaves behind a legacy to which we can all aspire. May he rest in peace.", "2018-11-14T20:31:43.000Z": "Congratulations @AndyKimNJ ! Andy and his team ran an incredible race, highlighting issues like affordable health care access that are so important to the people of #NJ03 . He will be an excellent representative. Quote Tweet Andy Kim @AndyKimNJ US House candidate, NJ-3 The @AP just made our victory official. I'm ready to get to work serving my home district and represent #NJ03 with integrity and civility in Washington.", "2018-11-07T03:34:16.000Z": "Tonight millons of New Jerseyans exercised our sacred right to vote. We voted for equal opportunity, tax fairness, common sense gun safety and progressive policies. We voted for @BobMenendezNJ and incredible Democrats up and down the ballot. Thank you New Jersey!", "2018-11-07T00:47:10.000Z": "There's still time to vote! Remember, if you're in line to vote by 8pm you MUST be allowed to cast your ballot. Make your voice heard, be a voter and vote @BobMenendezNJ .", "2018-11-06T23:58:53.000Z": "There's only one hour left! Polls close at 8pm, make sure you get out and vote", "2018-11-06T23:14:12.000Z": "We're taking nothing for granted in this election, so we're here at Hoboken Terminal meeting commuters with @Amy_DeGise to make sure people get home and vote!", "2018-11-06T22:18:59.000Z": "It's no surprise that @mayorstack has organized an army of supporters hitting the streets for @BobMenendezNJ , no matter the weather. Great to be in Union City knocking doors in the home stretch", "2018-11-06T22:00:26.000Z": "Mayor @NicholasJSacco and his team know better than most how to #GOTV , and they also know @BobMenendezNJ from having served together for so long. Turnout is high in North Bergen, but we need more to bring this home and build a #BlueWave !", "2018-11-06T21:17:45.000Z": "We're seeing tremendous turnout in communities across the state like Englewood, where outstanding local leaders like Mayor Huttle, @valerie_huttle and next Mayor @Michael_Wildes are leading the charge for @BobMenendezNJ and @BergenDems", "2018-11-06T20:34:48.000Z": "Stopped for lunch in the great borough of Paramus with @BergenExec , @JoeLaganaNJ , Mayor LaBarbiera and the @BergenDems team", "2018-11-06T18:32:24.000Z": ". @BobHugin has spent months telling us he's not a Trump Republican. Now that's been exposed as just another lie. Vote @BobMenendezNJ today to stand up to President Trump! #GOTV Quote Tweet Donald J. Trump @realDonaldTrump Bob Hugin, successful all of his life, would be a Great Senator from New Jersey. He has my complete and total Endorsement! Get out and Vote for Bob.", "2018-11-06T17:47:10.000Z": "Newark is out in force for @BobMenendezNJ and Essex Dems! Folks are fired up to vote to stop the Trump agenda thanks to leaders like @rasjbaraka and @Joe_D_EssexExec who are leading the fight", "2018-11-06T17:05:16.000Z": "Getting out the Vote for @BobMenendezNJ and Democrats in Essex County with one of the masters of #GOTV , Mayor @rasjbaraka . Newark knows it has #NeverMatteredMore to vote today!", "2018-11-06T14:54:50.000Z": ". @CWA_NJ members are fired up to build a #BlueWave today. @PhilMurphyNJ and I were excited to help launch their Ocean County canvass! #GOTV", "2018-11-06T14:44:16.000Z": "We believe. #Vote", "2018-11-06T13:31:40.000Z": ". @TammyMurphyNJ and I just voted, and I'm asking you to do the same. Today is a crucial day for our democracy, but we're only going to see the change we need if we all vote. #BeAVoter  #GOTV", "2018-11-06T11:00:00.000Z": "New Jersey, we've been waiting for this day for the last two years. The polls are now open. Vote today for @BobMenendezNJ and Democrats up and down the ballot to stand up against President Trump. Find your polling place here: https:// njdems.org/vote-2018/", "2018-11-06T02:53:29.000Z": ". @BobHugin says rain is \"Republican weather,\" because the fewer people that participate in an election, the better they do. Prove him wrong -- let's show Hugin that the #BlueWave isn't afraid of the rain. \n\nHave questions? Get voting resources here: https:// njdems.org/vote-2018/ Quote Tweet Ryan Hutchins @ryanhutchins I hope voters who don't have cars and have to walk to the polls in poor communities don't vote, is what he's saying. twitter.com/NYTnickc/statu", "2018-11-05T22:19:22.000Z": ". @CCDems are ready to #GOTV tomorrow thanks to leaders like @DonNorcross4NJ and Mayor Moran, and grassroots supporters who can't wait to vote for @BobMenendezNJ and Democrats down the ballot!", "2018-11-05T21:55:34.000Z": ". @MikieSherrill and her team have built more than just a campaign, but a movement for change that has inspired thousands of people and that will lead to victory on Tuesday!", "2018-11-05T21:29:54.000Z": "Spent the afternoon with @MayorBollwage and his team in Elizabeth meeting voters and getting out the vote for @BobMenendezNJ , @RepSires and the Union County Democratic Team", "2018-11-05T19:16:02.000Z": ". @TammyMurphyNJ and I are visiting all 21 NJ counties to support @BobMenendezNJ , because it's #NeverMatteredMore to have a Senator who will stand against the Trump agenda. Vote on Tuesday to hold Trump accountable by electing Democrats who will stand up for what we believe in.", "2018-11-05T17:46:24.000Z": "Proud to stand with @CoryBooker + many of our state's leading Mayors this morning to support @BobMenendezNJ . Mayors like @MayorBollwage , @rasjbaraka , @andresayegh are on the front line working for people every day and they know why it's #NeverMatteredMore to vote on Tuesday", "2018-11-05T15:39:30.000Z": "The @BergenDems are fired up to re-elect @BobMenendezNJ  @JoshGottheimer  @PascrellforNJ  @BergenExec and the entire Democratic team! We're bringing that energy right out to the streets for #GOTV", "2018-11-04T23:24:47.000Z": "Thank you to @arleneqperez and @demsofhunterdon for a great afternoon getting out the vote for @Malinowski and Dems across Hunterdon County!", "2018-11-04T21:53:49.000Z": ". @middlesexdems are ready for #GOTV ! Great to be with @CoryBooker , @SpeakerCoughlin , @ChairmanMcCabe and the rest of an outstanding team working to elect @BobMenendezNJ and Democrats throughout the county", "2018-11-04T21:27:50.000Z": ". @AtlanticDems are working to get out the vote on Tuesday for @BobMenendezNJ , @VanDrewForNJ and Democrats because they know it's #NeverMatteredMore to have the right leaders in Washington and in our communities.", "2018-11-04T19:47:02.000Z": "We're working hard to make sure the #BlueWave hits everywhere in New Jersey, which is why it was great to spend time in Cumberland County getting out the vote for @BobMenendezNJ  @VanDrewForNJ and more!", "2018-11-04T15:58:51.000Z": "Cape May County Democrats are ready to #GOTV for @BobMenendezNJ , @VanDrewForNJ and the Democratic ticket! Great to be here for the first stop on a busy day of working to build the #BlueWave", "2018-11-03T23:49:36.000Z": ". @SomersetNJDems are out in force tonight rallying for @Malinowski and Democrats up and down the ballot. This is real grassroots enthusiasm on a level NJ has never seen before, and it's why we will have a #BlueWave on Tuesday #GOTV", "2018-11-03T13:48:18.000Z": ". @RepBonnie is a true inspiration and I'm so proud to be with her team this morning to kick off a GOTV phone bank to build the #BlueWave", "2018-11-03T15:10:01.000Z": "Essex County could not be more fired up to elect @BobMenendezNJ  @MikieSherrill and Democrats up and down the ballot. Great to be with @CoryBooker  @Joe_D_EssexExec this morning to rally the troops! #GOTV", "2018-11-03T13:11:43.000Z": "Hey, Paterson!  @PhilMurphyNJ is firing the crowd up for Bob Menendez! Who's ready to #VOTE on November 6?", "2018-11-02T23:46:09.000Z": "Spent the afternoon in Hudson County campaigning for @BobMenendezNJ , because we absolutely must send him back to Washington to fight for NJ. It was great to meet so many people who know how important it is to vote this Tuesday.", "2018-11-01T21:09:31.000Z": "Excited to support @RiggedTheFilm , a new documentary about the threat of voter suppression narrated by @jfreewright . Learn more at: Home | Rigged: The Voter Suppression Playbook Rigged: The Voter Suppression Playbook is a documentary feature chronicling how American democracy is being threatened, and what we can do to save it. riggedthefilm.com", "2018-10-31T23:59:31.000Z": "Back out on the campaign trail tonight in Monmouth County with @JoshuaWelle , who is exactly the kind of progressive, experienced new leader we need to elect to Congress. The energy to build a #BlueWave is everywhere in NJ!", "2018-10-31T00:02:06.000Z": "One week from today NJ faces a true pass-fail election. Either we'll have @BobMenendezNJ fighting against the Trump agenda or a Senator who supports it. That's what this election comes down to, and I'm excited to get back on the campaign trail tomorrow. Menendez is in the final stretch in the fight of his political life. Murphy and Booker are helping. Gov. Phil Murphy has been appearing in public with U.S. Sen. Robert Menendez as he fights Republican challenger Bob Hugin in a tight race. nj.com", "2018-10-29T00:06:32.000Z": "Our final stop of an inspiring day was a packed house in Jersey City at a Rally hosted by leaders in the AAPI community supporting @BobMenendezNJ . Incredible work by @RLavarro  @RajMukherji  @RaviBhalla and everyone who came out. 9 days left to #GOTV !", "2018-10-28T20:48:39.000Z": "Next stop: Jersey City, where @HudsonDems Chairwoman @Amy_DeGise and Councilman @SolomonforJC are getting out the early vote for @BobMenendezNJ . I'm seeing the same thing around NJ, big time energy to elect Democrats on Nov. 6", "2018-10-28T19:09:39.000Z": "Continuing an energizing day of #GOTV events with the @morrisdems , where Chairman Robinson and hundreds of local Democrats are fired up to elect @MikieSherrill and @Malinowski to Congress. #BlueWave", "2018-10-28T17:53:35.000Z": "Meeting with leaders in the Korean American community this morning to rally support for @BobMenendezNJ and @BergenDems candidates", "2018-10-28T14:38:37.000Z": "Starting off a full day of #GOTV events at the Union County Democratic Breakfast where Chairman @SenatorScutari has a big crowd of grassroots activists excited to re-elect @BobMenendezNJ !", "2018-10-27T16:04:25.000Z": "Listen to Gov. @PhilMurphyNJ explain what's at stake for #nj2018 . \"Bob Hugin doesn't care about working families. Hugin will do all he can to undo the progress Senator Menendez has fought for.\" #TeamMenendez for #njsen at @NJAFLCIO  #GOTV event this morning.", "2018-10-27T13:09:42.000Z": "Great to be in Bergen County this morning to help the Central Labor Council kick off its canvassing for the day in support of @BobMenendezNJ and the outstanding @BergenDems ticket. Let's go GOTV!", "2018-10-26T23:32:56.000Z": "Thanks Governor Murphy for joining us in Hunterdon County. Another amazing turnout for the Meet and Greet with Tom Malinowski @PhilMurphyNJ  @Malinowski  @NJDSC  @DemsOfHunterdon", "2018-10-26T23:39:25.000Z": ". @TammyMurphyNJ and I announced earlier today that we'll be campaigning in all 21 NJ counties to elect Democrats up and down the ballot, and I couldn't think of a better place to start than in Hunterdon County with our next Congressman Tom @Malinowski ! #BlueWave", "2018-10-26T20:11:29.000Z": "It has never been more clear that we must re-elect @BobMenendezNJ so he can keep standing up against the Trump agenda and fighting for NJ. There's just too much at stake.", "2018-10-26T11:57:11.000Z": ". @TammyMurphyNJ is absolutely right -- Tom MacArthur's record on women's health care is atrocious and he's the wrong choice for #NJ03 . @AndyKimNJ will always stand up for women in Burlington and Ocean counties. First lady Tammy Murphy leads anti-MacArthur event in Burlington City MacArthur is seeking a third-term representing the sprawling swing district, which includes most of Burlington County and a large swath of neighboring Ocean County. District voters supported Presid... burlingtoncountytimes.com", "2018-10-25T01:16:14.000Z": ". @BobMenendezNJ just showed why New Jersey will rally around him on November 6 -- because it's #NeverMatteredMore to have a Senator who will stand up to the Trump agenda representing us in Washington. Join the #BlueWave here: https:// secure.ngpvan.com/EQ39SWuvbUK_D6 zITJA6pQ2?recode=website-homepage-button  Quote Tweet NJ Dems @NJDSC Tonight the message is clear: if you support moving our country in the right direction, then we must re-elect @BobMenendezNJ because @BobHugin will be another vote for the Trump agenda. Less than two weeks left to #GOTV !", "2018-10-11T02:26:37.000Z": "Mr. President, there's a time and place for campaigning, but now is the time to focus on our fellow Americans in the path of #HurricaneMichael Quote Tweet Donald J. Trump @realDonaldTrump Couldn't let these great people down. They have been lined up since last night - see you soon Pennsylvania!", "2018-10-10T14:17:37.000Z": "It was great to spend some time supporting @JoshuaWelle along with good friends @Amy_DeGise and @NJDSC Chairman Currie as we work to bring the #BlueWave to Monmouth and Ocean counties Quote Tweet Hudson County View @HudsonCoView Attempting to help Dems take back the House, @GovMurphy fundraises for @JoshuaWelle in #JerseyCity : https:// hudsoncountyview.com/attempting-to- help-dems-take-back-the-house-murphy-fundraises-for-welle-in-jersey-city/ ", "2018-10-05T01:31:59.000Z": "It was an honor to spend some time with my friend and one of the strongest Democratic leaders in the state tonight in @NicholasJSacco at his annual Mayor's Ball, where people are fired up to reelect @BobMenendezNJ and Democrats all over the ballot", "2018-10-01T23:47:17.000Z": "We're working hard to build the Democratic Party everywhere in New Jersey, so I was excited to visit @DemsOfHunterdon and their excellent Chair @arleneqperez tonight to rally the troops for @Malinowski and Democrats running up and down the ballot #BlueWave", "2018-09-26T23:53:47.000Z": "Historic, exciting candidates like @staceyabrams , @AndrewGillum , @BenJealous and our NJ Congressional challengers are running to fight for the same kind of progressive policies we're working for here in New Jersey. I'm proud to support them. Murphy fundraiser for Democratic Governors Association expected to raise $2.5M For Murphy, fundraising for others is getting back to his political roots. politico.com", "2018-09-25T00:39:04.000Z": ". @TammyMurphyNJ and I were thrilled to support @Bonnie4Congress tonight because she's a tireless, constant champion for working families who will always fight for our values in Washington", "2018-09-23T19:44:18.000Z": "Proud to support @AndrewGillum , the next governor of the great state of Florida. Andrew believes in funding our public schools and health care as a right, not a privilege. Let's #BringItHome for him this November.", "2018-09-23T13:42:37.000Z": "Anti-Semitism and racism have no place in our great state. Disgusted by this hate crime, and grateful that the @NJSP have opened an investigation. Campaign Sign for New Jersey Congressman Vandalized With Swastikas and Racist Graffiti Swastikas, racial epithets and profanity were scrawled across a campaign banner for Representative Josh Gottheimer and the home of a supporter who had put the sign on his lawn. nytimes.com", "2018-09-20T16:58:14.000Z": "You're either with NJ or you're not -- join us tonight and tomorrow in Atlantic City for the 2018 @NJDSC Conference to make the Blue Wave happen and bring the progressive change we're seeing here to Washington. NJDSC 2018 Conference Introduction Video Featuring Gov. Murphy youtube.com", "2018-09-18T14:26:16.000Z": "Sarah and Zach are providing leadership in an area where many adults have failed, and their voices are ensuring that their generation will be heard in the fight to end our national gun violence epidemic. As March For Our Lives seeks change at midterm elections, these Shore teens lead the way Marlboro's Sarah Baum and Toms River's Zach Dougherty are urging peers to vote with school safety in mind. Gov. Murphy & Sen. Booker have their backs. app.com", "2018-09-16T13:42:38.000Z": "Calling all NJ Democrats! We need your help to #FliptheHouse this November, and it starts this week in AC at the @NJDSC Conference. Register here: http:// njdems.org", "2018-09-07T19:09:27.000Z": "Excited to announce that @TheDemocrats Chair @TomPerez will be joining us at the @NJDSC conference in Atlantic City. I hope you'll join us!", "2018-09-07T19:07:17.000Z": "The road to change starts in New Jersey this fall, and there's no better way to shape the future of our country than by working to #FlipTheHouse . Register for the @NJDSC Conference to join the fight. I just gave to New Jersey Democratic State Committee - State Account! Join us! Contribute today. secure.actblue.com", "2018-09-05T19:43:54.000Z": ". @JoeBiden said it best today -- @MikieSherrill has exactly the kind of character, commitment and values we need in Congress, and I'm so proud to support her! Quote Tweet NJ Dems @NJDSC Who better to help #FlipTheHouse and fire people up than the great @JoeBiden ! Inspiring day at @montclairstateu with @PhilMurphyNJ  @MikieSherrill  @TammyMurphyNJ  #NJ11", "2018-09-04T16:01:46.000Z": "I'm proud that NJ has two strong Democratic Senators in @BobMenendezNJ and @CoryBooker who are standing up for us by opposing Kavanaugh. Join them by adding your name here. https:// secure.ngpvan.com/BMizdWONuEykOD lDx86eVw2 ", "2018-09-04T15:55:20.000Z": ". @realDonaldTrump 's SCOTUS nominee Brett Kavanaugh has a long-established view that the President is above the law. He absolutely shouldn't be confirmed.", "2018-09-03T12:23:22.000Z": "Today I hope you will join me at the South Plainfield Labor Day Parade and Rutherford Street Fair as we continue to fight for working people throughout the Garden State. Wishing you all a Happy Labor Day.", "2018-09-03T12:22:52.000Z": "Our Administration stands for the rights and dignity of all workers. I was proud to attend the Peter J. McGuire Labor Day Observance and wreath laying in Collingswood and Pennsauken last week.", "2018-08-27T15:38:40.000Z": "New Jerseyans see Democrats working for a stronger and fairer state while Republicans give huge tax breaks to millionaires and do nothing to solve our major problems, and they're responding by joining our party in record numbers Quote Tweet NJ Dems @NJDSC NJ is getting bluer -- Democrats have registered over 100k more voters than Republicans in the last two years, including big increases in three of the crucial districts we need to #FlipTheHouse in November https:// nj.com/politics/index .ssf/2018/08/a_breakdown_on_how_democratic_voters_are_outpacing.html?utm_campaign=njpolitics&utm_content=nj_twitter_njpolitics&utm_source=twitter&utm_medium=socialflow ", "2018-08-26T01:24:22.000Z": "Tammy and I send our deepest condolences to Cindy and the entire McCain family. \n\nOur nation has lost a hero and a guiding light.", "2018-08-24T01:43:35.000Z": "The last few days have shown there's a deep culture of lies, deception, and cover-up in Washington, fueled by President Trump and his Republican allies in Congress. We need a Democratic Congress to fight back - and that starts right here in New Jersey. I just gave to New Jersey Democratic State Committee - State Account! Join us! Contribute today. secure.actblue.com", "2018-08-20T15:48:58.000Z": ". @PhilMurphyNJ has made big strides for New Jersey with a bold, progressive agenda. He's already mandated \"one of the strongest equal-pay policies in the country\" & promised \"larger pension payments, universal pre-K\" & \"free community college\" #NJpolitics Murphy could be the ultimate Democrat in the age of Trump | Opinion His progressive moves point to a bright future for his party nj.com", "2018-08-20T12:40:48.000Z": "The #BlueWave runs through New Jersey this November, and we could not have a better slate of Democratic candidates than @MikieSherrill  @Malinowski  @VanDrewForNJ  @AndyKimNJ  @JoshuaWelle Midterm elections 2018: Will Democratic 'blue wave' wash over New Jersey? Trump predicts 'Red Wave!' but polls suggest a Democratic surge in the state in November northjersey.com", "2018-08-18T15:48:10.000Z": "Beautiful morning for a run in @BradleyBeach_NJ with @GovMurphy , @FirstLadyNJ Tammy Murphy, Mayor @GaryEngelstad , Councilman John Weber, the @JSRunningClub and my wife @angelamwelle ! #RunWithWelle", "2018-08-16T16:13:48.000Z": ". @AndyKimNJ grew up in #NJ03 and served our country on President Obama's nat'l security team -- of course he's one of us. Now he's making the GOP in Washington very nervous. Trump-like rhetoric has no place in NJ. 2018 elections: Andy Kim comes under attack from GOP Super PAC in NJ battleground race Congressional Leadership Fund's attack on Democrat Andy Kim, who is challenging Rep. Tom MacArthur, will not likely be its last. northjersey.com", "2018-06-28T20:33:51.000Z": "Wait. #Progressive NJ @GovMurphy protected @PPACtionNJ , voting rights, toughened gun laws, sued Trump over Dreamers & immigrant kids. But now Dems are blocking him on a millionaires tax to fund public schools? What am I missing? Call 609-400-4763 to get your legislator on board.", "2018-06-14T13:42:23.000Z": "I'll be live at 9:45 on CBS 880 to discuss first day of sports betting!", "2018-06-13T02:20:00.000Z": "LISTEN: Talking to @MikeFrancesa , @GovMurphy explains how the rollout of sports betting in New Jersey will work. First bets to be placed Thursday. http:// bit.ly/2t1VmpK", "2018-06-12T22:37:38.000Z": "Congrats to @ChairmanMcCabe on another term as Chair of the @middlesexdems ! Together, we'll continue the fight of making NJ a stronger & fairer place for every family.", "2018-06-06T02:11:13.000Z": "New Jersey Democrats are fired up & ready to take back the Senate and House in '18! Congrats to @BobMenendezNJ  @MikieSherrill  @JoshGottheimer  @DonaldNorcross  @FrankPallone  @JeffVanDrew  @AndyKimNJ  @JoshuaWelle  @Malinowski  @RepSires  @BillPascrell  @RepDonaldPayne  @Bonnie4Congress", "2018-04-26T21:06:24.000Z": "US Senate candidate, NJ If you're interested in running for office, the @NJDSC is hosting candidate trainings throughout New Jersey that will provide guidance on everything from implementing field strategies to communications messaging to engaging volunteers and more.\n\nRSVP here: https:// secure.ngpvan.com/gWD1B-HKl0WiRT 16YzmPBQ2 ", "2018-04-27T00:32:53.000Z": "It's an honor to be in Union City supporting @mayorstack for re-election!", "2018-04-26T20:27:37.000Z": "Look forward to seeing everyone there tonight! Quote Tweet Alejandro Velazquez @AlexUCNJ3715 Mayor Brian P. Stack invites everyone to the Union City First RALLY on Thursday, April 26, 2018 at 7:00 PM at the Park Theatre, 560 - 32nd Street in Union City; and urges everyone @GovMurphy  @NJSenatePres  @INSIDERNJ  @AlexUCNJ3715  @Alsullivan12", "2018-04-20T17:08:25.000Z": "Today, I signed into law a bill to protect the Jersey shore from the potential devastation of offshore drilling.\n\nNew Jersey will not stand by silently and allow @realDonaldTrump and @SecretaryZinke to open the ocean floor off our coast to oil and gas exploration.", "2018-04-13T12:48:34.000Z": "Great to see @GovMurphy and New Jersey take a big step toward renewable energy - Washington cannot stop us from meeting @AmericasPledge under the Paris Agreement. New Jersey Takes a Big Step Toward Renewable Energy (and Nuclear Gets Help, for Now) Bills passed in Trenton set a goal of 50 percent renewables by 2030, one of the biggest policy steps by any state toward cutting greenhouse gases since President Trump was elected. nytimes.com", "2018-04-03T16:50:52.000Z": "Retweet if you agree with @CoryBooker and @PhilMurphyNJ - Bob Menendez is NJ's champion and should be reelected this November!", "2018-03-29T16:00:47.000Z": "Proud to announce that New Jersey has sold its holding of all investments in manufacturers of automatic and semi-automatic weapons for civilian use. \n\nMilitary-grade weapons do not belong in the hands of civilians. http:// nj.gov/governor/news/ news/562018/approved/20180329b_saleofholdings.shtml ", "2018-03-29T22:50:42.000Z": "Reminder: join us at 7pm for a telephone town hall to discuss our FY2019 budget. #StrongerandFairer Quote Tweet Phil Murphy @PhilMurphyNJ Join us for a Telephone Town Hall this Thursday evening to discuss our FY2019 budget, a critical step in our fight for a stronger and fairer New Jersey. #StrongerandFairer", "2018-03-28T23:50:44.000Z": ". @FirstLadyNJ rocks. Subscriber Guide - northjersey.com Discover the benefits of being a subscriber. northjersey.com", "2018-03-28T21:26:16.000Z": "Joined by @CoryBooker  @SenatorMenendez  @SpeakerCoughlin and more at @NJDSC meeting. NJ Dems are fired up for historic gains this November!", "2018-03-28T15:50:04.000Z": "Thrilled to speak at @SenatorMenendez 's re-election kickoff in Union City. New Jersey is blessed to have the best team of Senators in America!", "2018-03-28T02:12:33.000Z": "Join us for a Telephone Town Hall this Thursday evening to discuss our FY2019 budget, a critical step in our fight for a stronger and fairer New Jersey. #StrongerandFairer", "2018-03-21T14:32:51.000Z": "Remember, NJ is under a State of Emergency: @NJSP has activated the 24/7 State Emergency Operations Center. @NJDOT_info is clearing roadways. @NJNationalGuard is prepared to respond to requests for assistance from @NJOEM Report power outages, downed trees or power lines.", "2018-03-07T16:52:29.000Z": "At the @NJSP in Holmdel as we monitor the storm. NJ residents are urged to stay indoors and keep the roads clear. If you need to go outside, use extreme caution. Visit http:// ready.nj.gov for more info.", "2018-03-07T19:15:42.000Z": "A big thank you to the utility workers on the job today, especially those who've traveled from out of state. Lots more work to do in the days ahead to get power restored.", "2018-02-19T15:38:29.000Z": "When the Christie Administration defunded @PPFA and women's health clinics, tens of thousands of women throughout New Jersey lost access to quality, affordable primary care. \n\nIt's time to right that wrong.", "2018-02-18T23:15:28.000Z": "New Jersey will think.\n\nNew Jersey will pray.\n\nBut I guarantee you, New Jersey will act. #GunReformNow", "2018-02-13T23:48:12.000Z": "I'll be answering your questions live tonight at 7:00 p.m. on @News12NJ  #AskGovernorMurphy  http:// newjersey.news12.com/story/37488126 /ask-governor-murphy ", "2018-02-05T19:42:14.000Z": "We all deserve free, open, and equal access to the internet. \n\nThe FCC's repeal of net neutrality was arbitrary and dangerous and will give outsized power to a few big companies to control the free flow of information. #NetNeutrality", "2018-01-14T18:53:16.000Z": "Join us TONIGHT for our Inauguration 2018 Concert at Middlesex County College! I'll be there with Busta Rhymes, PNB Rock, and more special guests. Free! RSVP here: https:// cvent.com/c/express/00d5 dba7-82e0-4a7a-8032-7fa4e1fafa34   #NewDayNJ  @pnbrock  @BustaRhymes", "2018-01-13T15:13:18.000Z": "Good morning New Jersey! #NewDayNJ Quote Tweet Dustin Racioppi @dracioppi . @GovMurphy , Hoboken train station, beginning a daylong Transit your through NJ.", "2018-01-12T16:25:10.000Z": "We're going to ignite an educational revolution in NJ. I am honored to appoint Dr. Lamont Repollet as our Commissioner of Education. To move the Dept. of Ed ahead, we need strong leadership with real-world experience both in and out of the classroom. Repollet is that leader.", "2018-01-12T16:13:22.000Z": "Follow our new official Twitter account, @GovMurphy ! Quote Tweet Governor Phil Murphy @GovMurphy Honored to be sworn in as the new Governor of this great state in just a few short days. Together, we will build a stronger and fairer New Jersey for all.", "2018-01-12T00:53:51.000Z": "Our hearts and prayers are with Lt. Christopher Robateau for his many years spent protecting and serving his beloved community of Jersey City. His wife Rose and his sons Darin, Christopher, and Michael are in our thoughts. May he rest in peace. 'The greatest man I've ever known,' sons say at lieutenant's funeral Lt. Christopher Robateau's three sons eulogized him before a funeral mass at St. Aeden's Church. nj.com", "2018-01-11T21:14:37.000Z": "Tune in to @NJTVNews for my interview discussing our inaugural and the incoming Murphy administration! 5:30pm on channel 13, and then 6pm, 7:30pm and 11pm on NJTV.", "2018-01-11T01:22:34.000Z": "We're getting close to kicking off our inaugural festivities, five days of events and services that honor all that New Jersey has to offer. Join us: Home | njinaugural2018 njinaugural2018.com", "2018-01-10T14:44:08.000Z": "Replying to @SecretaryZinke We'd like equal treatment for NJ and I'd like to meet with you to explain why. The Jersey shore is our pride and joy and an economic driver for our communities - we cannot allowing drilling off the coast.", "2018-01-10T02:05:43.000Z": "Proud and delighted that Gov. @PhilMurphyNJ has chosen my friend and former @USDOL colleague @robangelo to be his Labor Commissioner. Rob is an excellent choice, and will serve #NewJersey 's working people very well. http:// ow.ly/d9yj30hGphL", "2018-01-09T17:08:47.000Z": "Sad to hear of the passing of former @PANYNJ Chairman Alan Sagner - an honorable and committed public servant Alan Sagner, Who Revitalized the Port Authority, Dies at 97 A Democratic fund-raiser, he ran the New York-New Jersey agency from 1977 to 1985 and later headed the Corporation for Public Broadcasting. nytimes.com", "2018-01-09T15:24:10.000Z": "Salvadorean immigrants came to New Jersey and the U.S. seeking refuge - they've become our friends, neighbors, and colleagues. Ending TPS for Salvadoreans will tear apart families and do nothing to make our communities safer. #saveTPS", "2018-01-06T21:08:47.000Z": "Dear Gary Cohn, if the @WhiteHouse is so concerned about revenue, why does the tax bill give massive tax breaks to the wealthy and large corporations? We will stand up for middle-class NJ taxpayers getting clobbered by Washington. New Jersey's Incoming Governor Joins Tax Fight as Cohn Hints at Pushback New Jersey's governor-elect joined a chorus of leaders in Democratic states who are proposing workarounds for their residents to avoid new caps on state and local tax deductions, even as a top Trump... bloomberg.com", "2018-01-05T19:46:51.000Z": ". @realDonaldTrump and the Republican Congress slammed NJ taxpayers by eliminating SALT. Today, we're fighting back - the towns of Fair Lawn, Park Ridge, and Paramus will allow taxpayers to pay their taxes as charitable donations, preserving the deduction", "2018-01-05T15:49:53.000Z": "Joining @PhilMurphyNJ & @SenatorMenendez in Long Branch to stand against Trump's dangerous offshore drilling plan. Watch live here: https:// facebook.com/senatormenende z/videos/10155965459201358/ ", "2018-01-05T15:54:57.000Z": "With @SenatorMenendez  @pallonefornj & many more standing firm against plans for offshore drilling of fossil fuels, which would compromise our shore & our economy. We will reject all offshore drilling whether it be 3 miles or 300 miles from our New Jersey shoreline.", "2018-01-04T23:47:56.000Z": "New Jersey has lost one of its most beloved and distinguished favorite sons in former Governor Brendan T. Byrne. Full statement:", "2018-01-03T20:54:06.000Z": "This is truly wonderful news for the people of New Jersey.  Carole Johnson is a supremely talented public servant - it was an honor to serve at her side. Murphy recruits Obama official to lead programs for poor Carole Johnson served on the White House Domestic Policy Council health team. nj.com", "2018-01-03T22:25:49.000Z": "Great hire by @PhilMurphyNJ . Carole Johnson has an incredible work ethic, an encyclopedic knowledge of health and human services, and she cares deeply about keeping Americans healthy and safe: a true public servant. Murphy recruits Obama official to lead programs for poor Carole Johnson served on the White House Domestic Policy Council health team. nj.com", "2018-01-03T20:47:35.000Z": "Sergeant First Class Mihail Golin of Fort Lee paid the ultimate sacrifice serving the country he loved. @TammyMurphyNJ and I send our deepest condolences to the Sergeant's family during this difficult time. Fort Lee soldier killed in Afghanistan Mihail Golin of Fort Lee was the first U.S. serviceman killed in combat this year northjersey.com", "2018-01-01T22:12:13.000Z": "Was honored to also swear in Rutherford Councilwoman @StephanieMcGo16 and Brick Mayor @MayorDucey - looking forward to working with all of our local elected officials to make NJ stronger & fairer in 2018!", "2018-01-01T18:47:44.000Z": "Happy New Year, New Jersey! Kicked of 2018 swearing in Parsippany Mayor @sorianoformayor and Livingston Mayor Ed Meinhardt. Good luck to all the newly sworn-in officials all over our great state.", "2017-12-31T19:32:29.000Z": "President Trump's firing without explanation of remainder of HIV/AIDS Council another slap in the face to our #LGBTQ family & friends. Real leadership means inclusivity, respect, and dignity.", "2017-12-29T17:16:56.000Z": "Too little, too slow for working families struggling to make ends meet. We need to increase the minimum wage gradually to $15/hour. In 4 days, N.J.'s minimum wage will creep up 16 cents The new amount will be $8.60 an hour. nj.com", "2017-12-28T18:06:26.000Z": "Jared Maples is an experienced homeland security official who will put the safety of residents first & ensure prompt action/coordination in the face of threats, wherever they come from. Proud to ask him to serve as Director of @NJOHSP .", "2017-12-25T19:53:38.000Z": "From our families to yours, a very Merry Christmas and Happy Holidays to all! May this holiday season bring us all peace and joy.", "2017-12-24T14:20:50.000Z": "New Jersey taxpayers are hurting - they need relief too. @GovChristie must act now. With Cuomo Assist, Homeowners Rush to Soften Tax Bill's Impact Many residents in suburbs outside New York City want to prepay their 2018 property tax bills in 2017 to reduce their tax liability by thousands of dollars. nytimes.com", "2017-12-23T22:50:11.000Z": "Humbled to be on @thenation 's 2017 Progressive Honor Roll. Soon, we will begin the hard work of building a stronger and fairer New Jersey for all. The 2017 Progressive Honor Roll Resistance was the watchword this year. These honorees not only refused to go backward; they challenged old orthodoxies. thenation.com", "2017-12-21T16:11:36.000Z": "Announcing Catherine McCabe to serve as NJ DEP Commissioner. It's time for a leader who understands the threat of climate change, uses science and fact in making decisions, is tough on polluters & who will champion a green energy economy.", "2017-12-20T20:18:50.000Z": "No agency is more in need of a wholesale makeover and re-envisioning than @NJTRANSIT . Enough is enough. It's time to not just clean the house, but to knock it down and rebuild. Quote Tweet njdotcom @njdotcom NJ Transit is a 'national disgrace' that must be torn down and rebuilt: Murphy http:// dlvr.it/Q6vPPC", "2017-12-20T19:01:26.000Z": "What Citizens United did to begin to tilt the system in favor of the biggest and most powerful, this plan is finishing.", "2017-12-20T19:00:45.000Z": "We won't give a pass to the Republicans who voted \"no\" but didn't speak out forcefully or lobby their colleagues. It is New Jersey, and states like us, who are paying for this plan out of our pockets. We won't have short memories - 2018 is just around the corner. Quote Tweet The Washington Post @washingtonpost Analysis: Trump just admitted the GOP's tax cuts were deceptively sold http:// wapo.st/2BH3srX", "2017-12-20T17:31:58.000Z": "Introducing Diane Gutierrez-Scaccetti as NJ's next DOT commissioner. I will look to her to make sure we fix our roads & bridges, get essential projects built & overhaul NJTransit. Our economy relies on safe & modern infrastructure, and with Diane's leadership we will create it.", "2017-12-20T15:16:38.000Z": "\"We are looking to reinvigorate the innovation economy. This bill makes it harder but we will succeed.\" @PhilMurphyNJ on @SquawkStreet  @CNBC", "2017-12-20T15:18:17.000Z": "On @SquawkStreet now talking about the devastating impact of the #GOPTaxScam on NJ & all we must do to make our economy stronger and fairer again.", "2017-12-19T21:52:51.000Z": ". @RepTomMacArthur & the House GOP have shown where their true loyalties lay - not with their constituents but with President Trump and their wealthy contributors. When phased in, 83% of tax benefits will go to top 1%. #GOPTaxScam in one word: Shameful.", "2017-12-19T17:14:19.000Z": "Proud to announce @MarleneCaride as NJ's next commissioner of Banking & Insurance. As the President & Congress look to gut healthcare & financial protections, NJ needs leadership that is focused on the needs of consumers and small businesses.", "2017-12-18T16:16:55.000Z": "Proud to announce nomination of Tahesha Way to serve as NJ's next Secretary of State. We will need her dynamic leadership to protect & expand voting rights, promote tourism & the arts, and uphold the work of our cultural commissions.", "2017-12-15T21:59:05.000Z": "We finished our trip to Puerto Rico in a San Juan shelter, meeting displaced residents and listening to their stories. Puerto Ricans are our fellow Americans, and we must commit to helping them rebuild over rhe long term. #NJinPR", "2017-12-15T20:25:50.000Z": "Hearing from FEMA and PR Gov's team members on the ground about dealing with the island's devastation from Hurricane Maria & how NJ can help rebuild over the short & long terms. #NJinPR", "2017-12-15T18:42:58.000Z": "Gobernador @ricardorossello agradece el apoyo del gobernador electo @PhilMurphyNJ y establece que los puertorriqueños residentes en NJ tienen un aliado como gobernador.", "2017-12-15T18:48:15.000Z": "Holding a press conference with Puerto Rico Governor @ricardorossello on rebuilding Puerto Rico after Hurricane Maria, and the potential devastating impact of the federal tax bill on both New Jersey and Puerto Rico. #NJinPR", "2017-12-15T17:38:06.000Z": "Greeting the Governor & First Lady of Puerto Rico at La Fortaleza, the Governor's residence. The resilience & perseverance they've shown over the past few months is remarkable. #NJinPR", "2017-12-15T16:18:12.000Z": "The NJ delegation is on the ground in San Juan with Acting Secretary of State Maria Marcano, on our way to meet Governor Rossillo. #NJinPR", "2017-12-15T02:05:22.000Z": "Repeal of #NetNeutrality complete and utter nonsense. I've tasked my team with exploring every possible option & giving me concrete recommendations to fight back on behalf of NJ consumers the moment we take office Jan 16.", "2017-12-14T16:32:30.000Z": "Five years after Sandy Hook, we remember the 26 victims, many small children, ripped from their families, and we resolve to do all we can to prevent more senseless gun violence. Too many have been lost in the last five years. We cannot, and will not, give up. #SandyHook5yrs", "2017-12-14T12:36:24.000Z": "About to join @PIX11News live to talk federal tax bill, our transition, and all things New Jersey. Tune in!", "2017-12-13T21:14:12.000Z": "Diversity is our strength. Congratulations, Gurbir. Quote Tweet Phil Murphy @PhilMurphyNJ I am truly honored to nominate Bergen County Prosecutor Gurbir Grewal to the position of Attorney General. If confirmed, he will be the first Sikh-American Attorney General in American history. Thank you, Gurbir, for accepting the call to serve NJ.", "2017-12-13T19:50:42.000Z": "The music in New Jersey is a little quieter today with the passing of Smithereens' frontman Pat DiNizio, who wrote memorable riffs and proudly called Scotch Plains home. Condolences to his family, bandmates, and everyone who loved his music.", "2017-12-13T17:12:34.000Z": "New Jersey needs a Treasurer who can return our state to being known for fiscal responsibility, respect & standing for the right things. @lizmuoioNJ is the right woman for the job, and I'm proud to name her as our next state Treasurer.", "2017-12-13T12:23:22.000Z": "Tammy & I send our deepest congratulations and love to our dear friend Jon Bon Jovi on his induction into @RockHall ! His music has been a soundtrack for so many of our lives. NJ makes, Cleveland takes. Congratulations, Jon!", "2017-12-13T03:49:40.000Z": "Congratulations to Senator-elect @GDouglasJones on a truly inspiring victory tonight! Let this be a reminder to Democrats across the county: we can compete everywhere when we stand for our shared American values. Now, together, let's take back the Senate & House in 2018.", "2017-12-12T17:13:07.000Z": "Congratulations, Gurbir. Career prosecutor and first-class lawyer and person. Quote Tweet Anjalee Khemlani @AnjKhem First Sikh state AG in US history appointed by @PhilMurphyNJ  http:// roi-nj.com/2017/12/12/pol itics/bergen-prosecutor-grewal-is-pick-for-attorney-general/ ", "2017-12-13T00:24:06.000Z": "Wishing all in our Jewish communities a happy Hanukkah! May each night be filled with light and happiness. Chag sameach!", "2017-12-12T16:11:12.000Z": "I am truly honored to nominate Bergen County Prosecutor Gurbir Grewal to the position of Attorney General. If confirmed, he will be the first Sikh-American Attorney General in American history. Thank you, Gurbir, for accepting the call to serve NJ.", "2017-12-12T13:40:03.000Z": "Stunned and saddened by the news of Paul Fader's passing. He was a friend, advisor, and, most of all, a family man. Few knew NJ better. Tammy and I send our deepest condolences to Jill and their children.", "2017-12-08T21:45:26.000Z": "#GOPTaxScam threatens to hurt NJ homeowners! Join the call to learn more! Direct dial 9733102355 @NJPolicy  @CoryBooker  @SenatorMenendez  @PhilMurphyNJ  @FrankPallone", "2017-12-08T21:39:52.000Z": "One the line with @NJWFA  @SenatorMenendez  @CoryBooker  @FrankPallone  @NJPolicy talking about the #GOPTaxScam . This is beyond R vs D - you're either with the people of NJ, or the GOP in congress.", "2017-12-07T17:42:02.000Z": "It is unconscionable that Congress has failed to reauthorize health insurance for America's children while passing a tax bill that hurts their families. Hundreds of thousands of NJ kids who rely on CHIP need this now. The bill is there & must be passed. Quote Tweet KFF (Kaiser Family Foundation) @KFF Federal #CHIP funding expired Sept. 30. Absent congressional action, a third of states anticipate they will run out of money for their CHIP programs by the end of Jan. 2018 http:// kaiserf.am/2BDpfiX", "2017-12-06T15:03:06.000Z": "NJ must say \"no\" to being part of the House GOP's race to the bottom and attempt to undo our gun laws. We must stand strong to protect our communities from gun violence. Call Congress today and help #StopCCR ! Quote Tweet Giffords @GiffordsCourage Congress is voting to weaken our nation's gun laws TODAY. Here is a script for you to use when you call your member of Congress and tell them to vote NO on the Concealed Carry Reciprocity Act. #StopCCR", "2017-12-04T22:20:42.000Z": "Thank you @NYGovCuomo and @JerryBrownGov for your leadership in fighting back against the #GOPTaxScam that would hurt our residents & decimate our state economies. By speaking with one voice in opposition, we speak with the power of nearly 68 million Americans.", "2017-12-04T00:32:02.000Z": "The #GOPTaxScam is theft in plain sight, but remember: it's not law yet. All of NJ must now come together to stop this bill and avert an economic disaster for our middle class. Opinion | A Historic Tax Heist In which Republican donors pick your children's pockets. nytimes.com", "2017-12-02T15:52:37.000Z": "Great job @RURec & @RutgersU on this year's Big Chill 5K! A beautiful day to run and just look at all these toys that will help brighten smiles of thousands of kids throughout the area. Honored to be part of this great race!", "2017-12-02T14:55:51.000Z": "Chancellor Dutta and @PhilMurphyNJ about to kick off the15th Annual Big Chill! Thanks for joining @RURec and the campus community to #DoWhatMovesYou  #ExerciseIsMedicine", "2017-12-02T01:21:10.000Z": "I used to joke about this tax bill being written on the back of a cocktail napkin - it looks like I wasn't far off. This process is almost as much of a disgrace as the bill itself. #GOPTaxScam", "2017-12-01T23:05:29.000Z": "On #WorldAIDSDay , we remember the lives we've lost and support the estimated 37,000 New Jerseyans living with HIV/AIDS. Together we can end the stigma surrounding this disease and continue the progress we've made for a cure.", "2017-12-01T19:29:12.000Z": "The State & Local Tax Deduction was one of very few deductions found on the first Income Tax form in 1913. Congress knew then it was unfair to tax Americans twice. In 104 years, nothing has changed - except GOP politics. #GOPTaxScam", "2017-11-30T22:31:39.000Z": "Opened the Stronger & Fairer Economy transition committee meeting today, asking them for recommendations on kickstarting NJ's economy & providing opportunity for NJ's middle class. There is no time to waste.", "2017-11-30T13:46:13.000Z": "Note to Senate Republicans: millionaires don't need another tax cut. The people who do are the middle-class and those aspiring to the middle class, who would use tax relief to spur economic growth and save for their futures. https:// washingtonpost.com/news/wonk/wp/2 017/11/26/senate-gop-tax-bill-hurts-the-poor-more-than-originally-thought-cbo-finds/ ", "2017-11-29T20:43:33.000Z": "Republicans are more interested in giving the president a 'win' than passing a tax bill that actually helps the whole middle class win. This bill is still nothing but a bad deal for NJ and shouldn't pass. What the Tax Bill Would Look Like for 25,000 Middle-Class Families We modeled taxes for 25,000 middle-class families. Here's how the Senate bill would affect each of them. nytimes.com", "2017-11-28T22:05:05.000Z": "Opened the Education, Access, and Opportunity Transition Committee today, underscoring the importance of education to NJ's future. Thank you to all volunteering their time to serve our state!", "2017-11-28T18:27:20.000Z": "Kicking off the first of our transition committee meetings, opening a discussion on how we can better focus on innovation & technology to not just grow our economy, but make state government more efficient and effective.", "2017-11-26T23:17:29.000Z": "Our prayers to the family of Shuri Henry, who committed her life to improving the lives of others, lost to senseless gun violence. We can't fail her memory. We must act. Woman killed in Newark carjacking was organizing meeting on community violence Shuri Henry, 40, an apparent carjacking victim, was killed outside her home after returning from Thanksgiving dinner. nj.com", "2017-11-26T00:02:31.000Z": "Disgusted by reported vandalism of African-American churches across Morristown. These cowardly acts will not shake our faith. They will renew our determination to come together as one NJ. -PM", "2017-11-23T20:05:50.000Z": "Thankful to spend this morning with @TammyMurphyNJ and our kids at Lunch Break in Red Bank, serving neighbors and fighting food insecurity.\n\nFrom all the Murphys, we hope you have a Happy Thanksgiving spent among friends & family!", "2017-11-22T23:34:35.000Z": "This should serve as a wake-up call to all of us. Our treatment of veterans can and must improve. We owe them so much more. N.J. vet who committed suicide was waiting for treatment A government watchdog faulted a veterans clinic in New Jersey.. nj.com", "2017-11-22T17:51:33.000Z": "Having spent much of the past few years on the Parkway and Turnpike, I'm not surprised to see New Jersey produce a NASCAR champion. Congratulations @MartinTruex_Jr on representing NJ with pride!", "2017-11-22T16:39:10.000Z": "Congratulations to Christopher, Jordan, and Jasmine on your selection as Rhodes Scholars & for representing the best of our state. You do your families, your schools, and New Jersey proud! 3 N.J. residents chosen as Rhodes Scholars The three New Jersey residents were among the 32 American recipients announced Sunday nj.com", "2017-11-16T21:04:52.000Z": "With today's vote, the House said it stands with the wealthiest & biggest corporations, not the middle class and working families. Now to the Senate. This isn't over, we're not near done fighting for what's right & we won't be silent! Quote Tweet The Washington Post @washingtonpost Analysis: Senate tax bill cuts taxes of wealthy and hikes taxes on families earning under $75,000 over a decade http:// wapo.st/2hylfID", "2017-11-16T20:18:07.000Z": "#NJGovElect  @PhilMurphyNJ talks one-on-one w/ @ericlandskroner about #TaxPlan  #MenendezTrial & #DanceMoves ; full interview on #PowerAndPolitics Sat&Sun 10am12:30&4:30pm - Preview 2night at 10pm @News12NJ", "2017-11-16T20:01:29.000Z": "Good meeting today with @NJSenatePres and Assemblyman Coughlin on the necessary work ahead to rebuild New Jersey's economy.", "2017-11-15T13:46:03.000Z": "Talking with @PhilMurphyNJ 930 @wcbs880 w @WayneCabot  @JoeConnollybiz tweet questions at us!", "2017-11-15T13:06:17.000Z": "We speak with gov-elect @PhilMurphyNJ at 8:30 on #Gdny . What are you interested in?", "2017-11-15T12:48:14.000Z": "About to go live on @Morning_Joe - tune in!", "2017-11-14T18:07:35.000Z": "Edith Savage-Jennings dedicated her entire life to racial equality, from when she was 10 years old until her passing yesterday at age 93. That is a life to be celebrated. She will be missed, but her spirit will live on. -PM", "2017-11-13T17:35:07.000Z": "\"This is not reform, it's a scam. And New Jersey will be victim state number one if this passes.\"", "2017-11-13T17:21:42.000Z": "Standing with @BillPascrell  @RepSires  @DonaldNorcross  @pallonefornj and @RepDonaldPayne condemning the House GOP's disastrous tax hike on New Jersey taxpayers. This \"tax reform\" bill is nothing less than a tax hike on the middle class for the benefit of corps & the wealthy.", "2017-11-11T13:42:46.000Z": "We can do everything in our power to support and care for them. The first step is to let them know how much we appreciate their service.", "2017-11-11T13:42:23.000Z": "NJ is home to 435,000+ veterans & many live with wounds we cannot see. The challenges don't end when they leave the armed forces.", "2017-11-11T13:42:13.000Z": "To all who served, thank you! As governor, I will work diligently to make sure veterans get the care and services they need. -PM #VeteransDay Honoring Veterans New Jersey is home to more than 435,000 proud veterans, yet many live with wounds we cannot see. murphy4nj.com", "2017-11-08T21:05:53.000Z": "Wow, the @PhilMurphyNJ and @RalphNortham victories still have me fired up! Congrats to you and the dozens of new Democratic legislators who flipped seats across the country.", "2017-11-08T13:25:21.000Z": "This is what happens when the people vote. Congrats @RalphNortham and @PhilMurphyNJ . And congratulations to all the victors in state legislative, county and mayors' races. Every office in a democracy counts!", "2017-11-08T13:40:10.000Z": "NJ Governor-Elect Phil Murphy: \"We have to get this economy going again and we have to make it fair again.\" SnappyTV features are now in Twitter Media Studio SnappyTV features and core functionality can now be found in Media Studio, Twitter's content management platform for publishers. LiveCut in Media Studio allows you to create video clips from your... media.twitter.com", "2017-11-08T14:32:12.000Z": "Spent the morning thanking voters in Hoboken - we're turning the page to a better, brighter future. Thank you! #Murphy4NJ", "2017-11-08T01:39:25.000Z": "Thank you, New Jersey! We're ready to have your back in Trenton! #Muprhy4NJ  #ElectionDay", "2017-11-08T01:01:32.000Z": "On behalf of my family and campaign team, thank you for all you've done for this campaign. -PM", "2017-11-07T23:17:41.000Z": "Just under 2 hours Left! Did your family and friends vote? Give them a call and find out! Everyone vote matters @PhilMurphyNJ  #GoTV  #Resist", "2017-11-07T23:05:05.000Z": "The rain won't hurt you, but not voting will. After you've voted, join us in Asbury Park to watch the votes come in! http:// murphy4nj.com/vote", "2017-11-07T23:00:43.000Z": "Polls close at 8 pm. If you haven't voted already, here's your chance. Find your polling place: https:// murphy4nj.com/vote GIF", "2017-11-07T22:47:50.000Z": "Just cast my vote for @PhilMurphyNJ . Here's to $15/min wage, women's/LGBTQ rights, and legalization marijuana.", "2017-11-07T22:25:40.000Z": "Don't let the rain stop you! Get out and vote, and make sure your friends & family do the same! #Murphy4NJ Quote Tweet Cathleen Lewis @cathleenlewis1 Yes it's raining but what's worse getting wet or 4 more years for christie-guagdano? Get out and vote @PhilMurphyNJ  #Murphy4NJ  #Election2017", "2017-11-07T22:24:23.000Z": "After 18months, just gave the last stump speech of this election. The future of New Jersey is now in your hands. #Murphy4NJ  #GOTV", "2017-11-07T20:56:59.000Z": "just voted for the first time! make sure to get out and vote @PhilMurphyNJ !", "2017-11-07T20:22:22.000Z": "With @rasjbaraka and @RichardCodey on a GOTV walk in the South Ward of Newark. We're so close to bringing real change to NJ - VOTE by 8pm!", "2017-11-07T18:45:58.000Z": "Let's bring it home for @PhilMurphyNJ Afternoon GOTV time", "2017-11-07T16:38:23.000Z": "New Jersey: you have the chance to elect @PhilMurphyNJ  @SheilaOliverNJ and other great Dems today. Take it!", "2017-11-07T17:36:23.000Z": "Made a quick roadside stop to thank volunteers. We cannot do this without you. #Murphy4NJ  #GOTV", "2017-11-07T17:15:18.000Z": "Your voice is your vote. Use it! Polls are open until 8 p.m. http:// murphy4nj.com/vote", "2017-11-07T17:01:15.000Z": "RT if you're voting for Phil and Sheila today or share your own sticker photo with #Murphy4NJ ! \n\nFind your polling → http:// Murphy4NJ.com/Vote", "2017-11-07T16:20:34.000Z": "Elinor wants everyone to know how important it is to vote today! Make your plan here: http:// Murphy4NJ.com/vote  #Murphy4NJ", "2017-11-07T15:08:02.000Z": "Firing up our troops in Burlington County: \"With your help, we're going to turn the page for New Jersey!\"", "2017-11-07T14:50:33.000Z": "Today's election for governor is more important than ever. Vote @PhilMurphyNJ to put the horrors of Christie behind us. Quote Tweet The New York Times @nytimes From marijuana to property taxes, a look at what the candidates for New Jersey governor hope to do http:// nyti.ms/2A6pBhk", "2017-11-07T14:10:16.000Z": "NJ was built with union hands & we'll rebuild it with union hands. Honored to start Election Day with the Building Trades in South Jersey!", "2017-11-07T13:48:32.000Z": "Just voted for @PhilMurphyNJ to be next NJ governor.", "2017-11-07T13:51:27.000Z": "I just voted to bring real change to New Jersey - @PhilMurphyNJ and I can't do it without you. Have you voted yet? http:// Murphy4nj.com/vote", "2017-11-07T11:54:54.000Z": "NEW JERSEY! GET OUT AND VOTE @PhilMurphyNJ TODAY! Enough of Christie's bully politics and Trenton corruption!", "2017-11-07T12:12:13.000Z": "Thrilled to have started my day by voting for @PhilMurphyNJ .  A man of integrity who will lead with both his brain and his heart!! #njgov", "2017-11-07T12:44:35.000Z": "My partner and I just voted for a governor who has our backs! @PhilMurphyNJ  #Election2017", "2017-11-07T12:54:21.000Z": "About 12 hours from now I want to say this is me & my girls w/the next gov of NJ. So get out today & vote for @PhilMurphyNJ", "2017-11-07T12:31:54.000Z": "Live in VA, NJ, WA, NY or anywhere with an election today? Consider this my personal ask/nudge/plea for you to go to the polls and VOTE.", "2017-11-07T13:00:36.000Z": "Just cast my vote for @PhilMurphyNJ and you should too", "2017-11-07T13:07:11.000Z": "Voted for @PhilMurphyNJ and then straight down the party line. Let's go blue!!!", "2017-11-07T13:13:47.000Z": "I'm voting today for a lot of reasons. Common sense gun legislation is one of them. @PhilMurphyNJ  @MomsDemand", "2017-11-07T11:00:30.000Z": "It's Election Day, New Jersey! Polls are open from 6 am to 8 pm. Find your polling place: http:// Murphy4NJ.com/Vote GIF", "2017-11-06T14:41:01.000Z": "Hey, NJ voters. @KimGuadagnoNJ is a continuation of @ChrisChristie which is something you need to run from.", "2017-11-07T01:28:50.000Z": "Pre-election rally in Trenton with @PhilMurphyNJ and @SheilaOliverNJ .  Let's get to work.  Bring.  It. Home.", "2017-11-07T01:02:17.000Z": "Every election matters - those who show up determine our future. Go vote tomorrow! Everything You Need to Vote - Vote.org Register to vote. Check your registration status. Get your absentee ballot. Fast, free, easy, secure, nonpartisan. vote.org", "2017-11-07T02:19:55.000Z": "Tomorrow we take back New Jersey by electing @PhilMurphyNJ and other progressive Democrats across the state! #GOTV Tomorrow We Have The Power To Take Back New Jersey bluewavenj.org", "2017-11-07T02:25:13.000Z": "Big day tomorrow. Gotta get my #vote on for @PhilMurphyNJ . #PhilForNJ", "2017-11-07T00:43:05.000Z": "W @MercerDems at historic Shiloh Baptist. We need a gov committed to all communities. Tmrw we change Trenton in more ways than one.", "2017-11-06T23:54:54.000Z": "Tomorrow is election day. VOTE to end the disastrous Christie-Guadagno admin and bring NJ the change we so desperately need. #Murphy4NJ", "2017-11-06T22:06:20.000Z": "Last stop in NJ: Dropped by a field office making the final push for @PhilMurphyNJ . Great afternoon campaigning with @TammyMurphyNJ !", "2017-11-06T21:55:45.000Z": "Grateful to NJ's South Asian community for their support and friendship throughout. Tomorrow we speak as one New Jersey for a better future.", "2017-11-06T21:10:27.000Z": "Thank you @JasonKander for coming out for @PhilMurphyNJ ! (& how much does Tammy Murphy rock??) #everyvotecounts  #Victory2017  @middlesexdems", "2017-11-06T21:01:54.000Z": "RT if you agree with Phil and Sheila that it's time to build a stronger and fairer economy for all NJ families, not just the few. #Murphy4NJ", "2017-11-06T18:25:03.000Z": "NEW JERSEY: Election Day is Tuesday! Make your plan to vote for @PhilMurphyNJ for governor by texting MURPHY to 50409.", "2017-11-06T16:57:58.000Z": "With @CoryBooker firing up Bergen Dems at their annual GOTV breakfast - all of NJ is ready to turn the page from Christie/Guadagno! #GOTV", "2017-11-06T14:01:08.000Z": "Fellow NJ people: Do your part to end the Christie era AND stick it to Trump. Vote @PhilMurphyNJ for governor TOMORROW. Don't sit home!", "2017-11-06T15:04:03.000Z": "If you are in New Jersey, get out and vote tomorrow for my friend, @PhilMurphyNJ . Now more than ever, your vote matters! http:// Murphy4NJ.com/vote", "2017-11-06T12:27:15.000Z": "Early morning in Rutherford with @StephanieMcGo16 and Eddie Narucki - in 24hrs NJ votes for change from Christie/Guadagno! #Murphy4NJ", "2017-11-06T01:00:14.000Z": "Election Day is this Tuesday! Make your plan to vote by texting MURPHY to 50409. #Murphy4NJ", "2017-11-06T00:30:09.000Z": "Another senseless massacre in a house of worship. Now is the time to talk about the scourge of gun violence - we owe it to our children. -PM", "2017-11-05T22:09:00.000Z": "VP @algore : \"We need to make @PhilMurphyNJ our next governor.\" Note: \"need\", not just want -- This election is a matter of necessity! #GOTV", "2017-11-05T22:49:56.000Z": "The crowd waiting for @jonbonjovi to play at a @PhilMurphyNJ rally at the House of Independents in Asbury Park. #NJGov", "2017-11-05T23:13:27.000Z": "What a way to close out the weekend! Asbury Park. @jonbonjovi . Hundreds of supporters.", "2017-11-05T21:13:29.000Z": ". @middlesexdems are fired up and ready for new leadership in NJ. Election Day is just 2 days away...48 hours to get out every vote!", "2017-11-05T19:21:34.000Z": "http:// dailyrecord.com/story/news/201 7/11/05/murphy-booker-rally-democrats-parsippany/830657001/ ", "2017-11-05T17:53:12.000Z": "Speaking at the Annual Paramus Dems GOTV breakfast - two more days until NJ sends a message to @GovChristie & @KimGuadagnoNJ  #Murphy4NJ", "2017-11-05T17:49:56.000Z": "Thank you @CoryBooker for helping @SheilaOliverNJ and me bring our message of a stronger & fairer economy to NJ voters! #Murphy4NJ Quote Tweet George Helmy @ghelmy In Springfield NJ, @CoryBooker 's 8th stop this weekend on the campaign trail for @PhilMurphyNJ", "2017-11-05T17:00:43.000Z": "This race is going to come down to the wire, and we're counting on you!\n\nText MURPHY to 50409 and find your polling place! #Murphy4NJ", "2017-11-05T14:49:31.000Z": "\"I wholeheartedly support Phil and I hope you will too.\" Thank you @APstartup ! Why Phil Murphy Is Best Suited To Empower NJ's Innovation Economy When I was first invited to meet with Phil Murphy it was at a small business roundtable in Hoboken almost two years ago before he medium.com", "2017-11-04T23:18:10.000Z": "Thank you @DonNorcross4NJ ! Join the Congressman and make a plan to vote here: http:// murphy4nj.com/vote Quote Tweet Donald Norcross @DonNorcross4NJ US House candidate, NJ-1 Today I cast my ballot for @PhilMurphyNJ & full Dem team -- committed to growing jobs & wages to keep our communities strong. #NJGov", "2017-11-04T23:16:42.000Z": "With @CoryBooker in Parsippany - Morris County is fired up to turn red seats blue & end the Christie/Guadagno era! #Murphy4NJ", "2017-11-04T20:46:24.000Z": "Everyone vote for @PhilMurphyNJ", "2017-11-04T21:00:40.000Z": "#ElectionDay is Tuesday! Make your plan to vote by texting MURPHY to 50409. #Murphy4NJ", "2017-11-04T20:10:37.000Z": "Teamsters are fired up & rallying in Woodbridge to elect Murphy/Oliver & bring a strong & fair economy back to NJ! #Murphy4NJ", "2017-11-04T18:12:42.000Z": "Obama: 'Lace up your shoes and do some organizing'. 3 days/1 job. Vols 4 @PhilMurphyNJ . Go 2 http:// tinyurl.com/2017NJDems Obama: 'Lace up your shoes and do some organizing' President Barack Obama delivered his farewell address in Chicago, where he launched his political career eight years ago. youtube.com", "2017-11-04T18:01:27.000Z": "US House candidate, NJ-6 We can't let Republican anti-labor policies happen here in NJ. We need @PhilMurphyNJ . Huge support @Teamsters rally in Woodbridge!", "2017-11-04T17:10:24.000Z": "Getting ready for #GOTV w @MaketheRoadAct fam to support @PhilMurphyNJ for Governor & stand up against Trumpism. #Election2017", "2017-11-04T17:01:29.000Z": "We've got three days to go, and Essex County is ready to turn the page from the disastrous Christie-Guadagno admin. #Murphy4NJ  #GOTV", "2017-11-04T14:44:11.000Z": "When Trump & Guadagno allow hate to become acceptable, this is what happens. This is disgusting. On 11/7 we'll show NJ is better than this. Quote Tweet Ravinder S. Bhalla @RaviBhalla Yesterday, a flyer w/ word \"terrorist\" above a pic of me was circulated in Hob. Of course this is troubling, but we won't let hate win. Show this thread", "2017-11-04T13:53:11.000Z": "Packed house in Paterson for Passaic County's GOTV breakfast - three days to go! #Murphy4NJ  #GOTV", "2017-11-04T00:07:32.000Z": "Make a plan to vote! Visit http:// Murphy4NJ.com/Vote Quote Tweet Mo Elleithee @MoElleithee Dear Democrats on Twitter:\n\nThere is an election in 5 days.\n\nI know a lot of Dems in VA & NJ that would appreciate you remembering that.", "2017-11-04T00:04:11.000Z": "Sen @CoryBooker visits #CamdenNJ to join @DonNorcross4NJ to campaign for @PhilMurphyNJ & @CCDems Column 1 Democratic Team. Vote on Tuesday!", "2017-11-03T23:42:52.000Z": "Spent the afternoon with leaders of Jersey City's South Asian community, including Asm. @RajMukherji - JC is ready for change in 4 days!", "2017-11-03T18:40:12.000Z": "Go vote on Tuesday for @PhilMurphyNJ as New Jersey governor. http:// go.murphy4nj.com/page/s/commit- to-vote ", "2017-11-03T22:37:08.000Z": "Starting our GOTV push in Plainfield. Four days until we write the last lines of the Christie-Guadagno era in NJ and start a new chapter!", "2017-11-03T18:16:13.000Z": "First Responders GOTV Rally at Bloomfield Firehouse with Colorado Governor @hickforco ! Four days to election day! #Murphy4NJ  #GOTV", "2017-11-03T18:33:19.000Z": "\"We look forward to having a governor who will sign the progressive, pro-woman bills passed by our Legislature.\" https:// twitter.com/mcnownj/status /926478284677943299  This Tweet is unavailable.", "null": "", "2017-11-03T16:00:29.000Z": "#ElectionDay is just around the corner! Text MURPHY to 50409 and make your plan to vote! #Murphy4NJ", "2017-11-03T15:50:21.000Z": "US House candidate, NJ-1 Got plans this weekend? Sign up to volunteer and make sure @PhilMurphyNJ is our next Governor. https:// go.murphy4nj.com/page/s/volunte er   #NJGov", "2017-11-03T15:33:55.000Z": "It's a tax plan written by Trump to help him get more. NJ's reps need to stand as one to oppose this scheme that hurts our state & people.", "2017-11-03T15:33:34.000Z": "The loss of state/local tax deduction & capping prop tax deduction means middle-class NJ & seniors would get a big federal tax hike.", "2017-11-03T15:33:15.000Z": "GOP tax plan reads like napkin it was written on. Middle & working class NJans would lose, while the wealthiest & biggest would win. -PM Quote Tweet njdotcom @njdotcom The Republican tax plan: Bad for N.J., and the GOP knows it | Editorial http:// dlvr.it/PyxMnN", "2017-11-03T11:39:20.000Z": "Our entire campaign was honored to have you join us. You are an inspiration! Quote Tweet Gabrielle Giffords @GabbyGiffords Excited to be back in NJ today talking about why @PhilMurphyNJ should be the next governor! I know he has the #CourageToFight gun violence.", "2017-11-02T20:15:02.000Z": "Glad to be back in my home state campaigning for @PhilMurphyNJ : a strong advocate for gun safety who will make NJ communities safer.", "2017-11-03T02:08:07.000Z": "Great day in New Jersey with @GabbyGiffords and @ShuttleCDRKelly for @PhilMurphyNJ . Go vote this upcoming Tuesday, Nov 7! #GOTV  #NJ4Murphy", "2017-11-03T01:49:07.000Z": "Bergen County volunteers are working hard to ensure NJ turns the page from disastrous Christie/Guadagno admin! #Murphy4NJ", "2017-11-02T22:27:02.000Z": "T-minus days until the #NJGov election! Do you have a plan to get out to the polls to support @PhilMurphyNJ ?  http:// iwillvote.com", "2017-11-02T23:37:12.000Z": "Thank you @EricHolder ! http:// Murphy4NJ.com/vote Quote Tweet NDRC @DemRedistrict . @EricHolder supports @PhilMurphyNJ & @SheilaOliverNJ . If you do too, make sure you have a plan to vote on Nov. 7 http:// murphy4nj.com/vote", "2017-11-02T21:54:49.000Z": "Joining American heroes @GabbyGiffords and @ShuttleCDRKelly talking about gun safety. Our election is in 5days & it cannot be more critical.", "2017-11-02T17:46:57.000Z": "Honored to speak to New Jersey Chiefs of Police Association about keeping our communities safe and better serving our residents. #Murphy4NJ", "2017-11-02T17:16:29.000Z": "Proud to stand w @GabbyGiffords & @ShuttleCDRKelly to fight for commonsense laws to end gun violence. With @PhilMurphyNJ we will succeed!", "2017-11-02T17:11:42.000Z": "Honored to welcome @GabbyGiffords and @ShuttleCDRKelly to NJ & give voice to our efforts for commonsense gun laws to keep communities safe.", "2017-11-02T16:43:23.000Z": "New Jersey friends: @PhilMurphyNJ will make an outstanding governor. Commit to vote for him on Tuesday https:// go.murphy4nj.com/page/s/commit- to-vote  Quote Tweet Beau Salant @BeauSalant Looks like this @JasonKander dude is a big deal!", "2017-11-02T16:02:02.000Z": "The current state of NJTransit is unacceptable. We need new leadership. See our plan for NJTransit here: https:// murphy4nj.com/issue/nj-trans it/  Quote Tweet Silas Kezengwa @silasofficial My train was 15 mins late all week and then #NJTransit cancels it all together this morning. WHO CAN HELP? cc: @PhilMurphyNJ  @KimGuadagnoNJ", "2017-11-02T15:27:00.000Z": "#DYK  @PhilMurphyNJ 's first job was as a dishwasher for an NJ diner? #TBT Learn more about the #NJgov candidate here: Meet Phil Murphy, NJ's Democratic Nominee Get to know Phil Murphy, the Democratic nominee for governor of New Jersey. medium.com", "2017-11-02T15:25:12.000Z": "Absolutely disgusting. New Jersey is better than this! -PM Quote Tweet njdotcom @njdotcom Racist 'Make Edison Great Again' mailer targets Asian school board candidates http:// dlvr.it/PyrPDK", "2017-11-02T02:34:50.000Z": "Thank you! #Murphy4NJ  #GOTV Quote Tweet BlueWaveNJ @BlueWave_NJ Tonight was our 11th #WomenWaveWednesday phone bank. 1122 calls for @SheilaOliverNJ & @PhilMurphyNJ  #GOTV  #Murphy4NJ On to victory Nov 7!", "2017-11-01T23:20:11.000Z": "Our Facebook Live Town Hall will begin shortly! You can join us on Facebook ( http:// facebook.com/philmurphynj ) or watch here: https:// livestream.com/murphy4nj/Face bookTownHall ", "2017-11-01T19:10:28.000Z": "NJ lost a fine young man with tons of promise. Tammy & I send our deepest condolences to Darren's family & friends. 'Perfect son' Darren Drake killed in NYC terror attack Darren Drake, 32, of New Milford, was among eight people killed when a man driving a truck along a riverfront bicycle path plowed into pedestrians and bicyclists, the NYPD confirmed. nj.com", "2017-11-01T18:04:25.000Z": "Today is the first day of open enrollment for individual health insurance plans! Get covered today: http:// healthcare.gov Quote Tweet Barack Obama @BarackObama Starting today, you can sign up for 2018 health coverage. Head on over to http:// HealthCare.gov and find a plan that meets your needs. https:// twitter.com/getuscovered/s tatus/925709097076449280 ", "2017-11-01T16:28:56.000Z": "Tonight - Join Phil for a Facebook Live Town Hall! http:// Facebook.com/PhilMurphyNJ Submit questions on Facebook or by tweeting them back here.", "2017-11-01T15:33:13.000Z": "It is imperative we elect @PhilMurphyNJ as our next Governor on Tuesday. Thanks to @northjersey for publishing. Letter: Murphy is the right candidate for New Jersey Letter: Murphy is the right candidate for New Jersey amp.northjersey.com", "2017-11-01T14:56:40.000Z": "Listen in now! Quote Tweet The Brian Lehrer Show and A Daily Politics Podcast @BrianLehrer Now: Meet the Candidate: @PhilMurphyNJ . New Jersey residents, call in with your questions! 212 433 9692. http:// wny.cc/XyB830ghhjh", "2017-11-01T14:23:37.000Z": "We asked the NJ candidates for governor to fill out a Madlibs letter to NJ. And they did. First up: @PhilMurphyNJ  https:// nytimes.com/interactive/20 17/11/01/nyregion/nj-gov-madlibs-murphy.html ", "2017-10-31T21:50:09.000Z": "Horrible news out of NYC today. Praying for the families of all those affected. Americans will never give in to terrorism. -PM", "2017-10-31T13:41:58.000Z": "I'm going to be traveling on 11/7, so I voted early for @PhilMurphyNJ for #NJGov  #Election2017", "2017-10-31T21:26:34.000Z": "The Murphy family is in North Bergen & Paterson for Halloween parades - we hope everyone has fun tonight & stays safe!", "2017-10-31T17:01:37.000Z": "Thank you @RepMaxineWaters for your endorsement today - only 7 days until NJ turns the page from disastrous Christie/Guadagno administration", "2017-10-30T21:55:33.000Z": "I'm ready to vote for @PhilMurphyNJ on 11/7!", "2017-10-30T17:34:45.000Z": "Honored to be in Bloomfield w Assemblymembers Caputo & Tucker, and 200+ seniors ready to turn NJ around for themselves and their families.", "2017-10-30T13:26:52.000Z": "Former US ambassador to #Germany & Dem nominee for Gov of NJ @PhilMurphyNJ on @PodSaveAmerica - starts at 59:45! ‎Pod Save America: \"Another cuck bites the dust.\" on Apple Podcasts ‎Show Pod Save America, Ep \"Another cuck bites the dust.\" - 26 Oct 2017 podcasts.apple.com", "2017-10-30T13:55:51.000Z": "ICYMI: @nytimes endorses Phil Murphy for Governor! Opinion | Phil Murphy for Governor of New Jersey The Democratic candidate, a former financier and ambassador, offers the best opportunity to end the chaos of the Chris Christie years. nytimes.com", "2017-10-30T03:07:17.000Z": "Great town hall tonight with the only Gun Sense candidate for governor, @PhilMurphyNJ ! @MomsDemand", "2017-10-30T02:25:53.000Z": "A:  . @PhilMurphyNJ should be the next Governor.  We are lucky to have him. Put in 2 hours. http:// tinyurl.com/2017NJDems Quote Tweet Phil Murphy @PhilMurphyNJ \"Who should be the next governor of New Jersey? That's not even a close call.\" https:// nytimes.com/2017/10/29/opi nion/editorials/phil-murphy-governor-jersey.html?_r=0 ", "2017-10-29T22:40:11.000Z": "US House candidate, NJ-6 @PhilMurphyNJ town hall in Port Monmouth. Phil will fight for an economy that's fair for all New Jerseyans! Get out and vote Nov. 7th!", "2017-10-30T02:16:38.000Z": "\"Who should be the next governor of New Jersey? That's not even a close call.\" Opinion | Phil Murphy for Governor of New Jersey The Democratic candidate, a former financier and ambassador, offers the best opportunity to end the chaos of the Chris Christie years. nytimes.com", "2017-10-30T00:18:39.000Z": "Super inspired with @JoshuaWelle after a town hall by @PhilMurphyNJ and @TammyMurphyNJ  #NJ", "2017-10-29T22:24:03.000Z": "We're live in Port Monmouth for a town hall on the 5th anniversary of Superstorm Sandy - join us live: http:// facebook.com/philmurphynj", "2017-10-29T22:03:31.000Z": "", "2017-10-20T13:48:02.000Z": "'All of us have a responsibility to make our democracy work.' - Obama campaigning for NJ candidate Phil Murphy", "2017-10-29T16:40:40.000Z": "Former Gov @MartinOMalley joined Chairman Currie, @BillPascrell and Freeholder Duffy at an Irish-American GOTV Rally this AM! #Murphy4NJ", "2017-10-29T14:00:33.000Z": "CWAers are mobilizing to elect @PhilMurphyNJ for New Jersey Governor! You can join them! Election day is Nov. 7 #1u CWAers Mobilize to Elect Phil Murphy for New Jersey Governor New Jersey Election Day is November 7. cwa-union.org", "2017-10-29T14:19:45.000Z": "Opening the last full week of the campaign with Union County Democrats, fighting to win up & down the ballot. We're all in this together!", "2017-10-28T23:48:33.000Z": "Looking forward to Governor Murphy. NJ transit it needs a complete overhaul.  Vote November 7", "2017-10-29T00:14:52.000Z": "Honored & grateful to have @JulianCastro stumping for our campaign & Dem ticket in Passaic with Mayor Lora & Chairman Currie. #Murphy4NJ", "2017-10-28T22:47:26.000Z": "Thank you to all our union brothers and sisters out canvassing today. Let's put New Jersey back to work! #Murphy4NJ", "2017-10-28T19:16:52.000Z": "Thanks to Derek at Ara Coffe in Rutherford, a great local biz, for the healthy dose of caffeine to keep us going on the campaign trail!", "2017-10-28T17:45:37.000Z": "Thank you @NJLCV for joining us on the campaign trail today! #GOTV  #Murphy4NJ Quote Tweet New Jersey LCV @NJLCV Knocking on doors today to elect @PhilMurphyNJ and @SheilaOliverNJ and turn New Jersey green!", "2017-10-28T16:35:09.000Z": "Met Liam the Democratic Dinosaur today in Rutherford - our campaign is inclusive to New Jerseyans of all sizes & species. #Murphy4NJ", "2017-10-28T16:21:46.000Z": "US House candidate, NJ-1 Today I was proud to support our next governor, @PhilMurphyNJ , at a rally with labor leaders from across the state. #NJGov", "2017-10-28T14:43:54.000Z": "GP Rigmaiden speaks @IUPATDC711 in support of @PhilMurphyNJ and working class values #jerseystrong H/T @agalvez1009", "2017-10-28T14:40:36.000Z": "Joining the men & women of @IUPATDC711 for a GOTV rally in Edison - only ten days to go & it's a beautiul day to knock on some doors! #GOTV", "2017-10-27T21:21:27.000Z": "Well done @PhilMurphyNJ on @PodSaveAmerica this week. Go get a W in Jersey in 11 days! #Vote  https:// voter.njsvrs.com/PublicAccess/j sp/PollPlace/PollPlaceSearch.jsp ", "2017-10-27T21:05:36.000Z": "\"We see Murphy as more authentic...Elections are about choices and Phil Murphy is the better choice.\" The Record endorses Phil Murphy for governor of New Jersey We believe Phil Murphy will be more committed to listening and advocating for disenfranchised New Jerseyeans than Kim Guadagno. northjersey.com", "2017-10-27T17:01:09.000Z": "Phil Murphy and Sheila Oliver will give New Jerseyans fresh leadership and build a fairer economy for every family.", "2017-10-27T15:16:26.000Z": "@PhilMurphyNJ - great job in your interview on Pod Save America yesterday (at minute 59:50). This well shows Phil's concern for all in NJ. Quote Tweet Jon Favreau @jonfavs NEW POD: Flake and Corker, Wall St wins in the Senate, the dossier idiocy, plus guests @PhilMurphyNJ and @Timodc : http:// go.crooked.com/Bu3g2m Show this thread", "2017-10-27T14:21:06.000Z": "Hey fellow NJ politics junkies: @PhilMurphyNJ is on @PodSaveAmerica this morning. Take a listen, educate your vote...", "2017-10-27T13:43:25.000Z": ".@USRepRodney: the time is now. Stand up for NJ, or get out of the way. Your constituents will remember next November. Quote Tweet Phil Murphy @PhilMurphyNJ Congressman @USRepRodney voted yesterday to eliminate SALT deduction & raise taxes on his NJ constituents. Only NJ rep to do so. Shameful.", "2017-10-27T13:43:04.000Z": "Congressman @USRepRodney voted yesterday to eliminate SALT deduction & raise taxes on his NJ constituents. Only NJ rep to do so. Shameful.", "2017-10-26T19:59:40.000Z": "Thanks for joining us! Here's the ep: http:// go.crooked.com/Bu3g2m Quote Tweet Phil Murphy @PhilMurphyNJ Spoke with @jonfavs on @PodSaveAmerica today about our campaign& how Dem party can move forward nationally. Election day=12 days! #Murphy4NJ", "2017-10-26T22:25:55.000Z": "I'm thrilled to have my sister Jan campaigning for me in Hudson County, and even happier I could be there in cardboard cutout form!", "2017-10-26T22:11:13.000Z": "Too many NJ Republican congress members trying to have it both ways on SALT deduction. There is only one way forward: protect NJ taxpayers.", "2017-10-26T20:17:06.000Z": "Yes! Sign up to volunteer here: http:// murphy4nj.com/volunteer And donate here: http:// murphy4nj.com/donate Quote Tweet Joe @ My House @Joe_LoGuidice Replying to @jonfavs @PhilMurphyNJ and @Timodc I live in NJ any last ditch things I can do to help Phil Murphy? OFC will be voting tuesday!!", "2017-10-26T19:58:59.000Z": "NEW POD: Flake and Corker, Wall St wins in the Senate, the dossier idiocy, plus guests @PhilMurphyNJ and @Timodc : http:// go.crooked.com/Bu3g2m", "2017-10-26T18:53:27.000Z": "Spoke with @jonfavs on @PodSaveAmerica today about our campaign& how Dem party can move forward nationally. Election day=12 days! #Murphy4NJ", "2017-10-26T18:00:56.000Z": "\"On November 7, you are voting for the goodness of America. You will set the direction of this nation's moral compass.\" - Khizr Khan", "2017-10-26T17:54:38.000Z": "\"We cannot wake up on Nov 8th and wished we had done more.\" -Khizr Khan", "2017-10-26T17:49:09.000Z": "Proud to welcome Gold Star father Khizr Khan to NJ. We will not bend to the politics of division - inclusiveness & diversity are NJ values.", "2017-10-26T17:00:51.000Z": "\"I flat out reject the 'us versus them' approach to our economy - it is time we get back to thinking about 'we.'\" - Phil Murphy", "2017-10-25T23:24:00.000Z": "We're kicking off our 59th town hall in New Brunswick! Join us live at http:// Facebook.com/philmurphynj & join our campaign for a stronger, fairer NJ", "2017-10-25T19:28:06.000Z": "\"Phil Murphy is the kind of leader we need in government right now.\" Watch General Mark Hertling's endorsement: Lt Gen Hertling endorses Ambassador Murphy for Governor of New Jersey Lt. Gen. Hertling endorses Ambassador Murphy for Governor of New Jersey youtube.com", "2017-10-25T17:31:09.000Z": "Thank you to all of our excellent volunteers in Long Branch! We're bringing our message of change to all of NJ. #Murphy4NJ  #GOTV", "2017-10-25T17:02:07.000Z": "As governor, Phil Murphy will defend New Jersey and stand up to President Trump everytime he defies our constitution.", "2017-10-24T22:07:33.000Z": "President @BillClinton has taken the stage! Join us: http:// facebook.com/philmurphynj", "2017-10-24T21:58:30.000Z": "Honored to welcome @BillClinton to Paramus! Join our rally to get out every vote between now and November 7: http:// Facebook.com/philmurphynj", "2017-10-24T21:38:23.000Z": "Paramus is fired up to hear from Phil and @BillClinton ! Join us live: http:// facebook.com/philmurphynj", "2017-10-24T18:38:52.000Z": "Join us tonight in Paramus with President @BillClinton ! RSVP here: https:// go.murphy4nj.com/page/s/join-bi ll-clinton-and-phil-murphy ", "2017-10-24T16:09:16.000Z": "To my home state of New Jersey. There is an election on Nov 7th for governor and state legislators. @PhilMurphyNJ is your man.", "2017-10-24T15:04:50.000Z": "Four more years of @KimGuadagnoNJ is simply unaffordable. \n\nWatch our new ad: Unaffordable 30 New Murphy for Governor Ad: \"Four More Years of Kim Guadagno is Unaffordable\" Newark - A new 30-second television ad from Murphy for Governor begins airing s... youtube.com", "2017-10-24T13:40:59.000Z": "Eliminating state & local tax deduction = big tax increase on NJ families. All of NJ must stand & fight this. Senate votes to eliminate state and local tax deductions WASHINGTON - Senate Republicans voted Thursday in favor of eliminating the state and local tax deduction used by some 44 million Americans. By a 52-47 vote, the Senate passed an amendment to repeal nypost.com", "2017-10-24T00:55:02.000Z": "#ICYMI : @PhillyInquirer believes @PhilMurphyNJ is the best choice to be NJ's next governor #NJgov  http:// bit.ly/2hZZa5y", "2017-10-23T22:23:32.000Z": "President @BillClinton will join us for a grassroots event in Paramus tomorrow - RSVP and say you'll be there! https:// go.murphy4nj.com/page/s/join-bi ll-clinton-and-phil-murphy ", "2017-10-23T21:46:14.000Z": "Thank you to all of our great volunteers who worked hard to get out the vote this weekend - NJ is ready for change! #GOTV  #Murphy4NJ", "2017-10-23T20:21:17.000Z": "Murphy says he'll expand NJ voter rights if elected gov The Democrat says Republicans are for voter suppression. He said he'd make it easier to register and to vote. nj.com", "2017-10-23T17:16:04.000Z": ". @HRC is proud to endorse pro-equality candidate Phil Murphy ( @PhilMurphyNJ ) for governor of New Jersey. HRC Endorses Phil Murphy for Governor of New Jersey Phil Murphy's commitment to LGBTQ equality makes him the clear choice for the approximately 2.3 million LGBTQ and allied voters in the Garden State. hrc.org", "2017-10-23T17:01:22.000Z": "Read more about Phil Murphy's plan to build an economy that works for everyone here: http:// bit.ly/2qAz5wi", "2017-10-23T14:39:45.000Z": "\"At stake in NJ's next choice of governor: The health care of tens of thousands of women. @KimGuadagnoNJ ...supports Christie's vetoes.\" Quote Tweet NJ.com Politics @NJ_Politics Guadagno, 'advocate for women,' won't defend their health care | Editorial http:// nj-ne.ws/4h9RpT7", "2017-10-23T14:03:07.000Z": "The notion that @KimGuadagnoNJ refused to stand up to the Kobach Commission tells you the type of governor she would be. Quote Tweet Phil Murphy @PhilMurphyNJ Joined by @EricHolder & @repbenraylujan for a discussion on opening access to democracy - we must fight voter suppression & gerrymandering.", "2017-10-23T13:59:11.000Z": "Joined by @EricHolder & @repbenraylujan for a discussion on opening access to democracy - we must fight voter suppression & gerrymandering.", "2017-10-23T12:19:22.000Z": "\"Guadagno claims to be a huge advocate for women, but when she stands quietly beside Christie/Trump, why trust her?\" Guadagno, 'advocate for women,' won't defend their health care | Editorial What difference does it make if she personally identifies as pro-choice, if she is effectively denying women that choice, along with basic health care? nj.com", "2017-10-23T02:18:34.000Z": "Proud to have @HillaryClinton join our campaign today - the importance of this election cannot be understated! #Murphy4NJ", "2017-10-23T00:42:13.000Z": "How cool to canvass with spectacular scenery 4 @PhilMurphyNJ  @kateandgina  @HamiltonforNJ - NJ Vote Nov 7th #gotv  #VoteBlue  @Action2getherNJ", "2017-10-22T22:25:22.000Z": "\"Murphy...has the skills and ideas for the job.\" \"He should be the next governor.\" @PhillyInquirer endorsement: Murphy's experience, ideas make him the best choice to be N.J.'s next governor | Endorsement Committed to being a full-time governor, Democrat Phil Murphy, 59, of Middletown, says he would make the state a leader once again in environmental protection and economic growth. inquirer.com", "2017-10-22T13:19:03.000Z": "This is the man RUNNING For governor of my home state of New Jersey. @PhilMurphyNJ and that is his beautiful wife. Go, NEW JERSEY!", "2017-10-21T20:00:29.000Z": "From serving as Ambassador to Germany to creating organizations that help domestic abuse survivors, Phil has always put people first.", "2017-10-21T19:49:57.000Z": "Phonebanking in Middlesex County, talking to voters about the need for change from failed Christie/Guadagno admin. #Murphy4NJ", "2017-10-21T13:28:54.000Z": "\"We are embracing a politics that says everybody deserves a chance, a politics that says everybody has dignity & worth- a politics of hope.\"", "2017-10-20T18:00:43.000Z": "Phil Murphy will work to make a meaningful difference in the lives of women across #NJ .", "2017-10-20T15:21:54.000Z": "Thank you @RazacProducts for hosting a roundtable on our small biz agenda - small businesses are the heartbeat of NJ's economy! #Murphy4NJ", "2017-10-19T20:39:56.000Z": "\"The most important office is the office of citizen! Elections Matter.\" @BarackObama & @PhilMurphyNJ urging all #NewJersey citizens to vote!", "2017-10-19T20:46:16.000Z": "This crowd is so fired up! Great day w @PhilMurphyNJ !", "2017-10-19T20:52:18.000Z": "Welcome to New Jersey, Mr. President. #Murphy4NJ", "2017-10-19T20:41:17.000Z": "\"We need everyone vote on Nov 7. You will send a message to the world that we are rejecting the politics of division.\" @BarackObama", "2017-10-19T20:23:32.000Z": "Welcome back to New Jersey, @BarackObama !", "2017-10-19T19:09:41.000Z": ". @SheilaOliverNJ : \"Nine years ago we won with three simple words, 'Yes we can.' In 19 days we'll do it again!\"", "2017-10-19T19:06:20.000Z": "Few can fire up a room like @rasjbaraka ! Newark is ready to welcome @BarackObama !", "2017-10-19T19:00:41.000Z": "Thanks to Phil Murphy and the New Start Career Network, New Jersey's long-term unemployed have hope.", "2017-10-19T18:57:27.000Z": ". @pallonefornj : \"We're not going to let them reverse the Obama legacy.\" RT if you agree!", "2017-10-19T18:52:57.000Z": ". @Payne10thNJ : \"We need Phil Murphy unless you want what you had for the last 8 years ... We need someone who cares about every family.\"", "2017-10-19T18:49:13.000Z": "Thank you @DonaldNorcross for getting us started here in Newark!", "2017-10-19T17:28:21.000Z": "Soon. @BarackObama  #Murphy4NJ", "2017-10-19T00:35:34.000Z": "It's all in the shoes. Quote Tweet Sal Rizzo @rizzoTK Murphy's shoes", "2017-10-19T00:25:14.000Z": "\"I don't know how @KimGuadagnoNJ can claim any credibility on the economy after being at Chris Christie's side for 2,829 days.\" #NJGovDebate", "2017-10-19T00:03:44.000Z": "NJ needs big change. @PhilMurphyNJ showed he'd bring it. @KimGuadagnoNJ failed the test. Time 2 turn page & begin new chapter 4 all of us.", "2017-10-18T23:55:53.000Z": "\"We can turn the page, and embrace change, new leadership. and new priorities.\" #Murphy4NJ  #NJGovDebate", "2017-10-18T23:37:55.000Z": "RT if you agree: \"Social justice is not an entitlement.\" #Murphy4NJ  #NJGovDebate", "2017-10-18T23:34:02.000Z": "Very thoughtful & impressive answer on marijuana legalization by @PhilMurphyNJ", "2017-10-18T23:27:01.000Z": ". @KimGuadagnoNJ , if you wanted to fix NJTransit, you've been there 2,829 days -- where have you been? #Murphy4NJ  #NJGovDebate", "2017-10-18T23:20:56.000Z": ". @KimGuadagnoNJ : You've left the middle class behind, and now you've left the truth behind. #Murphy4NJ  #NJGovDebate", "2017-10-18T23:15:19.000Z": "School aid is prop tax relief. Christie & Guadagno underfunded schools by $9B. Property taxes up 17%. Not a coincidence. #NJGovDebate", "2017-10-18T23:12:56.000Z": "What fellow Republicans have said about @KimGuadagnoNJ 's \"circuit breaker\": \"fantasy and phantom revenues\" #NJGovDebate", "2017-10-18T23:06:13.000Z": "\"We (Christie) were completely together on every issueI don't see any difference quite frankly.\" @KimGuadagnoNJ , 7/11/15 #NJGovDebate", "2017-10-18T22:50:30.000Z": "Join us for the final debate of the election - stream it live at the link below! #Murphy4NJ Quote Tweet CBS New York @CBSNewYork IN ONE HOUR: Join @KJohnsonTV as @KimGuadagnoNJ and @PhilMurphyNJ meet for #NJGovDebate  #NJGov2017 at 7 p.m. - Watch http:// cbsloc.al/2hCozlv", "2017-10-18T17:01:41.000Z": "Our economy has underperformed under the Christie/Guadagno administration, and families have paid the price. https:// mckinsey.com/mid-atlantic/o ur-insights/reseeding-growth-in-the-garden-state ", "2017-10-18T14:23:56.000Z": "@PhilMurphyNJ for governor my man tryna make good changes to our state", "2017-10-17T20:00:30.000Z": "Today's the last day to register to vote, New Jersey! Make sure you're ready to go for Election Day.\n\nRegister: https:// murphy4nj.com/register-to-vo te  GIF", "2017-10-17T19:00:22.000Z": "Obama's Visit to New Jersey Caps Tour of Democrats Supporting Murphy The former president will campaign for Philip D. Murphy, the Democratic candidate for New Jersey governor, as the party looks to statehouses to protect policies. nytimes.com", "2017-10-17T16:27:57.000Z": "Enter by midnight tonight for a chance to join President @BarackObama and Phil Murphy on Thursday. Visit http:// murphy4nj.com/obama for details", "2017-10-17T13:01:14.000Z": ". @GovChristie and @KimGuadagnoNJ left New Jersey stuck. I'm serious about moving New Jersey forward.\n\nWatch our new ad, \"Bridges.\"", "2017-10-17T01:10:30.000Z": "We invite you to join us: http:// murphy4nj.com/volunteer Quote Tweet Sheila Oliver @SheilaOliverNJ . @PhilMurphyNJ and I will turn the page from the failed Christie-Guadagno years and create an NJ where all 9 million of us rise. #NJLGDebate", "2017-10-17T00:12:46.000Z": "Join us live on NJTV for the Lieutenant Governor debate! #Murphy4NJ Quote Tweet NJTV News @NJTVNews TONIGHT watch the lieutenant gubernatorial candidates debate NJ's top issues at 8 p.m.! http:// bit.ly/NJLGDebate  #NJLGDebate", "2017-10-16T17:01:07.000Z": "Next star Democrat to stump for Murphy: Barack Obama http:// dlvr.it/PvxsMJ", "2017-10-16T17:01:19.000Z": "Politics as usual has failed NJ, but Phil doesn't owe the special interests anything. Watch and join the campaign at http:// Murphy4NJ.com", "2017-10-16T11:32:04.000Z": "Jersey was visited by civil rights icon David Mixner last night. He shared a message about the importance of voting 4 @PhilMurphyNJ  #FiredUp", "2017-10-15T20:58:12.000Z": "\"Are you ready for change? Are you ready for a new direction for NJ?\" @algore fires up thousands at GOTV rally in Monmouth Co. #Murphy4NJ", "2017-10-15T20:48:38.000Z": "In 23 days, New Jersey voters will have a choice: more of the same, or turning the page to a better, brighter future for all NJ families.", "2017-10-15T20:34:11.000Z": "On stage for the Monmouth County GOTV rally, introducing @algore and NJ's next gov, @PhilMurphyNJ . #Murphy4NJ  #GOTV", "2017-10-15T20:02:54.000Z": "Monmouth County is fired up for our GOTV rally with @algore !", "2017-10-15T18:26:00.000Z": "Join us live: http:// Facebook.com/PhilMurphyNJ", "2017-10-15T18:25:32.000Z": "The future of NJ's economy lies in embracing innovation. We're at @TigerlabsCo in Princeton w @algore to talk about how we do that.", "2017-10-14T17:02:42.000Z": "Lighting the divya to start off Diwali celebrations with the South Asian Registration Initiative and State Senate candidate @vingopal", "2017-10-14T16:15:15.000Z": "Phil and Tammy Murphy founded 2nd Floor, a confidential and anonymous helpline for New Jersey's youth and young adults", "2017-10-13T16:26:01.000Z": "We've seen how the military must adapt to ever-changing threats. Phil Murphy knows the DMAVA must similarly reform to reflect present needs.", "2017-10-12T17:00:01.000Z": ". @JoeBiden calls NJ Gov race between @PhilMurphyNJ & @KimGuadagnoNJ the \"single most important race in America to be taking place this year\"", "2017-10-12T19:52:19.000Z": "Read the full editorial here: http:// nj.com/opinion/index. ssf/2017/10/guadagnos_willie_horton_ad_fans_racial_fears_edito.html  Quote Tweet Phil Murphy @PhilMurphyNJ The Star-Ledger on @KimGuadagnoNJ : \"Flat-out dishonest.\" \"A cheap attempt.\" \"Another sign that Guadagno's campaign can't be trusted.\"", "2017-10-12T19:51:54.000Z": "The Star-Ledger on @KimGuadagnoNJ : \"Flat-out dishonest.\" \"A cheap attempt.\" \"Another sign that Guadagno's campaign can't be trusted.\"", "2017-10-12T16:17:58.000Z": "Proud to welcome @JoeBiden to Middlesex County to help kick off the final weeks of our campaign! Join our rally live on Facebook!", "2017-10-12T14:39:22.000Z": ". @KimGuadagnoNJ herself says we are the weakest state financially. That's the one time in this campaign she has actually told you the truth.", "2017-10-12T14:38:45.000Z": "Instead of talking about issues, @KimGuadagnoNJ is race-baiting. Her racist ad is meant to distract you from her failed record. Shameful.", "2017-10-12T14:38:01.000Z": ". @KimGuadagnoNJ 's self-proclaimed job is to grow the economy. Unlike her 'A' grade from the NRA, on that score she gets an 'F.'", "2017-10-12T14:37:39.000Z": "FACTS: NJ losing private sector jobs. Incomes down. Ppl giving up looking for work. Highest foreclosure rate in US. https:// njbmagazine.com/njb-news-now/n ew-jersey-private-sector-jobs-decreased-600-september-according-adp-regional-employment-report ", "2017-10-12T13:16:43.000Z": "Catching up with an old friend. @JoeBiden  #Murphy4NJ", "2017-10-12T00:00:42.000Z": "\"Phil Murphy will build a fairer economy and improve education for students throughout our state.\" - Dimple Shah, NJ.", "2017-10-11T23:09:39.000Z": "We are live at our town hall in Emerson! Watch the livestream: http:// facebook.com/philmurphynj", "2017-10-11T19:06:59.000Z": "We must empower girls to dream big. We must fight for equal pay and greater access to STEM programs. This is our future. #dayofthegirl Quote Tweet Girl Scouts @girlscouts The world's 1.1 billion girls are an unstoppable force with limitless potential. We must prepare them to ignite the change they want to see. http:// GIRLagenda.org  #DayoftheGirl  #GIRLagenda", "2017-10-11T15:14:21.000Z": "\"Ladies and gentlemen, the next Governor of New Jersey, Phil Murphy.\" @JohnKerry  #Murphy4NJ", "2017-10-11T15:04:42.000Z": "\"We need someone who does what they say they will, and honors our veterans.\" @JohnKerry  #Murphy4NJ", "2017-10-11T14:46:57.000Z": "Welcoming @JohnKerry to Clifton VFW hall to meet NJ vets and talk veterans' issues. As Gov, I will have our veterans' backs.", "2017-10-11T00:12:51.000Z": "Final share of #NJGovDebate Twitter conversation around the candidates on stage:\n\n54% - @PhilMurphyNJ 46% - @KimGuadagnoNJ", "2017-10-11T00:29:49.000Z": "Blue Wavers for @PhilMurphyNJ before tonight's #NJGovDebate", "2017-10-11T00:01:14.000Z": "NJ needs a governor who will build a stronger, fairer economy that works for us all. Join us to build that future: http:// murphy4nj.com", "2017-10-11T00:00:04.000Z": "After 2821 days at Chris Christie's side, nothing @KimGuadagnoNJ said tonight shows she'd do anything different. #NJGovDebate", "2017-10-10T23:44:36.000Z": "We need a governor who will reform NJTransit from the top-down. Here's my plan: NJ Transit Democrat for Governor murphy4nj.com", "2017-10-10T23:43:52.000Z": "NJTransit fares are up 36% under Christie-Guadagno but service is down. Why? 90% defunding & political patronage. #NJGovDebate", "2017-10-10T23:33:46.000Z": "NJ has only 15 tech incubators to NY's 179. To grow economy & create jobs, we must focus on innovation. #NJGovDebate", "2017-10-10T23:09:49.000Z": "Guadagno again misstates education funding amount. Total is $9B but most of that is funded, no need to raise all that #NJGovDebate", "2017-10-10T23:28:41.000Z": "If Kim's audit would have solved our state's fiscal crisis, why didn't she do even one in her 7+ years w Christie? #wherehaveyoubeen ?", "2017-10-10T23:26:33.000Z": "Don't let @KimGuadagnoNJ fearmonger about immigrants. They're our neighbors, friends, and even family. We are one NJ. #NJGovDebate", "2017-10-10T23:20:33.000Z": "I will sign every gun safety law Chris Christie vetoed. @kimguadagnonj just made it clear she'd veto them again. #NJGovDebate", "2017-10-10T23:16:42.000Z": ". @kimguadagno keeps saying she \"has a plan\" for prop taxes, but #wherehaveyoubeen for last 8yrs? #NJGovDebate", "2017-10-10T21:38:23.000Z": "#Murphy4NJ Quote Tweet Theresa @TheresaPil @MomsDemand proud to support @PhilMurphyNJ pre first gubernatorial debate! #murphyforNJ", "2017-10-10T17:03:21.000Z": "\"But if an independent prosecutor had been appointed six years ago, Guadagno might not be running for governor.\" The Ticking Time Bomb Faced by Next NJ Governor | WNYC | New York Public Radio, Podcasts, Live... The amount of money owed to New Jersey state pension holders will break the bank. Find out what the candidates say about what they'll do and why one of them has a pension reform problem. wnyc.org", "2017-10-10T17:01:06.000Z": "Phil Murphy will be a governor who brings progressive change to New Jersey that gets the economy working for everyone.", "2017-10-10T14:52:03.000Z": "In 4wks, NJ voters will choose bt a stronger, fairer economy that works for all NJ families or four more years of Christie-Guadagno failures", "2017-10-10T13:30:46.000Z": "@PhilMurphyNJ in #Paterson last night. https:// tapinto.net/towns/paterson /articles/phil-murphy-i-will-have-patersons-back ", "2017-10-09T22:25:50.000Z": "\"I support Phil Murphy for having a plan to build the economy.\" - Nancy, from North #NewJersey", "2017-10-09T21:12:04.000Z": "US House candidate, NJ-6 Great to welcome back DNC chair @TomPerez to help us GOTV for @MonmouthDems  @PhilMurphyNJ @NJLD11 @Vingopal ! 29 days!", "2017-10-09T17:13:16.000Z": "Brady is honored to endorse @PhilMurphyNJ for Governor! Phil is a staunch advocate 4 gun violence prevention & we're proud  to stand w/ him", "2017-10-09T16:44:02.000Z": "Honored to stand w @Bradybuzz & to earn their endorsement. Together, we'll make common sense gun safety a reality in New Jersey. #Enough", "2017-10-08T22:13:48.000Z": "Spoke to the Jewish Fed of NJ today, affirming strong support of Israel & importance of standing up strong against hate in our communities", "2017-10-08T16:01:02.000Z": "Phil Murphy isn't the type of person to see a problem and just talk about it -- he rolls up his sleeves and works with others to solve it.", "2017-10-08T15:24:33.000Z": "Let's end the patronage and waste, and return NJTransit to serving commuters, not politics. NJ Transit Democrat for Governor murphy4nj.com", "2017-10-08T15:24:09.000Z": "Christie's & @KimGuadagnoNJ 's NJTransit wastes $5M on empty offices while service plummets. Time to clean house. Investigation: Struggling with finances, NJ Transit spent millions on empty office space NJ Transit plans to buy a vacant office space in its headquarters building that it has already spent nearly $5 million to lease and renovate. northjersey.com", "2017-10-08T14:56:28.000Z": "Now more than ever, we must stand with our Puerto Rican community and let them know we have their back. Murphy: There's still more N.J. can do to help Puerto Rico | Opinion The Jones Act restrictions are outdated and protectionist -- they unnecessarily drive up prices for essential commodities Puerto Rico needs to jumpstart its economy. nj.com", "2017-10-08T01:54:53.000Z": "Time for those signs!  Let's go, . @PhilMurphyNJ !!!", "2017-10-07T22:51:09.000Z": "LETTER: @PhilMurphyNJ protects women's rights. #Christie has not & #Guadagno is complicit. #Murphy4NJ LETTER: Murphy protects women from GOP apathy Christie and Guadagno have shown little interest in women's health issues dailyrecord.com", "2017-10-07T19:05:47.000Z": "Back in January, I committed to laws preserving access to birth control for women in New Jersey: https:// murphy4nj.com/2017/01/murphy -pledges-to-protect-womens-access-to-contraception/  Quote Tweet Phil Murphy @PhilMurphyNJ No woman should have to worry about access to proven, safe, & affordable contraception, but as a result of Trump & GOP Congress, they do.", "2017-10-07T19:05:17.000Z": "No woman should have to worry about access to proven, safe, & affordable contraception, but as a result of Trump & GOP Congress, they do.", "2017-10-07T17:00:25.000Z": "Phil will have our veterans' backs. \n\nFind out how here: https:// murphy4nj.com/issue/veterans/", "2017-10-07T02:11:17.000Z": "Respect is an American value. Discrimination isn't. We stand with our LGBTQ community. Quote Tweet Garden State Equality @GSEquality This #LicenseToDiscriminate from @jeffsessions & @realDonaldTrump will harm the lives of thousands of hardworking LGBTQ Americans.", "2017-10-06T17:55:28.000Z": "Democrat @PhilMurphyNJ hosts a roundtable on clean energy at a Lawrenceville power company. Less than 5 weeks until N.J. picks a new gov.", "2017-10-06T20:58:04.000Z": "Hosted a clean energy roundtable at @PrincetonPower1 - Christie/Guadagno have ignored NJ's potential. We must work to spark it & be a leader", "2017-10-06T16:01:40.000Z": "Governor Christie has been consistently wrong on gun control, and Lieutenant Governor Guadagno will just follow in his footsteps. WATCH:", "2017-10-06T15:57:54.000Z": "If this plan passes, roughly a third of NJ households would be hit with a tax increase of $3500. That is unacceptable & cannot happen. -PM Quote Tweet Phil Murphy @PhilMurphyNJ It's official: Reps MacArthur & Frelinghuysen have sold out NJ, voting to pave way for Trump tax plan that slams NJ. https:// nytimes.com/2017/10/05/us/ politics/house-budget-blueprint-tax-cut-overhaul.html?_r=0 ", "2017-10-06T15:57:31.000Z": "It's official: Reps MacArthur & Frelinghuysen have sold out NJ, voting to pave way for Trump tax plan that slams NJ. House Passes Budget Blueprint, Taking Step Toward Tax Overhaul The approval of the budget blueprint is critical to Republicans' hopes of remaking the tax code even if Democrats are unified in opposition. nytimes.com", "2017-10-05T22:40:49.000Z": "Wishing a wonderful Chuseok and Korean Thanksgiving Day to all those celebrating.", "2017-10-05T17:00:12.000Z": "Gun violence is a public health crisis and we must pursue smart, sensible solutions. Add your name now >> http:// bit.ly/2hK5Urw", "2017-10-05T14:38:03.000Z": ". @KimGuadagnoNJ 's not even willing to listen. That's not leadership, that's being in the pocket of the gun lobby. Murphy commits to 'bump stock' ban as Guadagno slams door on even thinking about it murphy4nj.com", "2017-10-05T11:09:17.000Z": "Proud to stand with women all over New Jersey endorsing @PhilMurphyNJ Quote Tweet Insider NJ @INSIDERNJ Democratic Women Release List of Murphy Supporters - http:// go.shr.lc/2yUT1zc", "2017-10-04T21:13:47.000Z": ". @KimGuadagnoNJ says, \"I wouldn't change the gun laws, simple as that. I wouldn't change the gun laws.\" She went from not wanting to talk about gun safety to slamming the door on the discussion in under 24 hours. Murphy: 'Simple as that,' Guadagno slams door on common sense gun safety \"Lt. Governor Kim Guadagno says she wouldn't even discuss changing the gun laws, which tells us all we need to know about who she truly represents,\" Murphy said. murphy4nj.com", "2017-10-04T20:01:09.000Z": "RT if you agree with Phil and Sheila that it's time to build a stronger and fairer economy for all NJ families, not just the few.", "2017-10-04T19:13:18.000Z": "\"Well before the 2018 midterms, the people of New Jersey have a chance on Nov. 7 to send a message to Trump and the rest of the nation by turning a red governorship a beautiful and bright shade of blue.\" NJ Democrat Phil Murphy: Probably the Next Governor, and Major Anti-Trumper Like the Donald, Murphy went to Wharton and made money in business. The similarities definitely end there. thedailybeast.com", "2017-10-04T13:14:18.000Z": "If you're wondering who will stand up to the gun lobby and fight for sensible gun safety measures, this says all you need to know #Murphy4NJ", "2017-10-04T14:10:48.000Z": ". @PhilMurphyNJ talking to Verizon employees right now...", "2017-10-04T14:15:18.000Z": "Simply put, this tax plan is a disaster for the middle class, and a disaster for New Jersey. We cannot allow President Trump to give himself a massive tax break at the expense of New Jersey taxpayers.", "2017-10-04T14:14:55.000Z": "$3500. That's the average tax increase on NJ households that currently take advantage of the State and Local Tax deduction, which the Trump tax plan would eliminate. That's not a typo: roughly a third of NJ households would be hit with a tax increase of $3500.", "2017-10-03T20:29:35.000Z": "Thanks, Sabrina! #Murphy4NJ Quote Tweet Sabrina Jacobs @bri_jacobs I just sent in my mail-in ballot for @PhilMurphyNJ for governor and you should too!!!", "2017-10-03T18:55:48.000Z": "Google and Facebook need to own up to the fact that they have a \"fake news\" problem. They got fooled by the Russians in '16 election, now get fooled again after Las Vegas shooting. It is way past time for them to fix this. https:// nytimes.com/2017/10/02/bus iness/las-vegas-shooting-fake-news.html ", "2017-10-03T15:00:57.000Z": ". @KimGuadagnoNJ says now is \"not the time\" to discuss the public health crisis of gun violence. Lieutenant Governor, now was not the time for 59 innocent Americans to lose their lives in yet another mass shooting. Read the full statement: https:// facebook.com/PhilMurphyNJ/posts/1133875750080063 ", "2017-10-02T12:00:01.000Z": "Another awful episode of senseless violence. Thinking of the victims and their families. This can't numb us, but must move us to find answers. -PM", "2017-10-01T23:21:57.000Z": "Thank you @GovHowardDean for campaigning for us in NJ today! #Murphy4NJ", "2017-10-01T19:29:55.000Z": "Spoke at the State LGBT Caucus fundraiser today in Boonton. A more representative New Jersey = a stronger New Jersey! #Murphy4NJ", "2017-10-01T17:04:54.000Z": "Thank you @GovHowardDean for campaigning on our behalf at the Statewide Hispanic Parade in North Bergen today! NJ is ready to turn the page from the failed Christie/Guadagno administration. #Murphy4NJ", "2017-09-30T17:11:34.000Z": "Thanks to the 150+ that showed up for our labor walk in Cherry Hill bringing @PhilMurphyNJ 's message of a stronger fairer economy for all NJ", "2017-09-30T17:24:56.000Z": "Speaking to the New Jersey Puerto Rican Congress about the hunanitarian crisis that fellow Americans in Puerto Rico are suffering through. US Congress must step forward and expedite aid.", "2017-09-30T16:01:17.000Z": "Read more about Phil Murphy's plan to build an economy that works for everyone here: http:// bit.ly/2qAz5wi", "2017-09-29T22:22:23.000Z": "The entitlement shown by Kushner and Trump do not reflect NJ's values in the slightest bit. -PM Opinion | Jared Kushner's Entitlement Is New Jersey Born and Bred There are many reasons he doesn't think the rules apply. The Garden State is one of them. nytimes.com", "2017-09-29T19:32:33.000Z": "Congress must move aggressively, swiftly, and decisively in expediting relief aid to Puerto Rico. Small steps on Puerto Rico hurricane relief as crisis intensifies | Video | NJTV News President Trump waved the Jones Act, but relief supplies continue to sit on San Juan docks. njtvonline.org", "2017-09-29T18:27:20.000Z": "Phone bankers in Jersey City are making calls for Phil Murphy & the entire Hudson County Democratic slate. #Murphy4NJ", "2017-09-29T18:25:09.000Z": "Last night, had the honor of speaking to over 600 ILA union members about the importance of investing in our ports. #Murphy4NJ", "2017-09-29T16:38:07.000Z": "@MomsDemand action members making calls for NJ next governor @PhilMurphyNJ  ! #Murphy4NJ  #gunsense  @tt63_turner", "2017-09-28T23:46:27.000Z": "Tune in to @SXMProgress at 8pm for our town hall! Quote Tweet SiriusXM Progress @SXMProgress \"Governors will never have mattered more during this Trump era.\" - @PhilMurphyNJ explains to @Deanofcomedy why governors will need a steel backbone.", "2017-09-28T01:47:54.000Z": "Rutgers for Phil Murphy with @PhilMurphyNJ at tonight's phenomenal town hall at @Eagleton_RU", "2017-09-28T18:27:51.000Z": "As usual, @KimGuadagnoNJ has been reluctant to stand up to the GOP in Washington on behalf of New Jersey. But let's be clear: anything less than full-throated opposition to this plan is tacit approval of a massive tax hike on New Jersey taxpayers. -PM Quote Tweet Phil Murphy @PhilMurphyNJ If you look at the states that will be hit hardest by the elimination of state and local tax deductions in new Trump tax plan, New Jersey is at or near the top. That is unacceptable, and our federal delegation must do everything in their power to stop this bill.", "2017-09-28T18:27:18.000Z": "If you look at the states that will be hit hardest by the elimination of state and local tax deductions in new Trump tax plan, New Jersey is at or near the top. That is unacceptable, and our federal delegation must do everything in their power to stop this bill.", "2017-09-28T17:15:00.000Z": "Celebrating Hispanic Heritage month! Happy to support my friend @PhilMurphyNJ at his Latino policy speech.", "2017-09-28T15:19:10.000Z": "The humanitarian crisis in Puerto Rico is not abstract to New Jersey. Congress must act quickly & forcefully in expediting relief aid.", "2017-09-28T14:45:03.000Z": "In Jersey City for an endorsement event with the Latino Leadership Alliance, a group of statewide Latino leaders. #estamoslisto", "2017-09-27T21:39:50.000Z": "I am running for #NJgov because our economy is suffering from decades of poor management & special interest insider politics. -PM", "2017-09-27T00:01:07.000Z": "Spent the day in Monmouth county with the LD-11 ticket - Facebook Live with @vingopal & knocking doors in Tinton Falls! #Murphy4NJ", "2017-09-27T12:41:58.000Z": "Be sure to watch @PhilMurphyNJ 's live town hall from @njdotcom tonight at 7 WATCH: Phil Murphy Q&A broadcast from NJ.com town hall Democratic gubernatorial candidate Phil Murphy spoke Wednesday night in New Brunswick. nj.com", "2017-09-27T00:03:19.000Z": "Speaking at Planned Parenthood Action Fund of NJ event about the importance of access to high quality, affordable healthcare. #Murphy4NJ", "2017-09-26T21:59:56.000Z": "Please join in contributing to New Jersey for Puerto Rico & send a message they aren't forgotten: http:// nj4pr.org", "2017-09-26T21:52:18.000Z": "#PuertoRico is facing a humanitarian crisis. Congress must step up and deliver aid. These are our fellow Americans & they need us. -PM", "2017-09-26T19:20:41.000Z": "Visited small businesses in Camden Co yesterday to talk about being an entrepreneur in NJ & turning the page from the Christie-Guadagno era.", "2017-09-26T18:58:42.000Z": "Today is National #VoterRegistrationDay ! If you or someone you know are not registered, download the form here: http:// state.nj.us/state/election s/voting-information.html ", "2017-09-26T13:48:28.000Z": "The Christie playbook failed New Jersey. Now, @KimGuadagnoNJ wants to give it another try. Watch our new spot, titled \"Cut + Paste.\"", "2017-09-25T20:26:47.000Z": "Thank you @SHAQ for joining @SheilaOliverNJ and me at Weequahic HS speaking to Newark students about importance of civic engagement!", "2017-09-25T17:15:22.000Z": "Thank you @NJ_Commuters for your endorsement! Read our plan to restore NJTransit & rebuild our critical infra: https:// murphy4nj.com/issue/nj-trans it/   https:// twitter.com/phelanmichaelN J/status/912353917811482624  This Tweet is unavailable.", "2017-09-25T17:08:30.000Z": "Thrilled to see Hanaa, Moneeb, and Hasan at our Muslim Leadership Conf this past weekend - congratulations! Rutgers team wins $1 million 'Nobel Prize for students' with project in Pakistan The business school students visited the 8,000-acre Orangi Town slum in May with a project in mind to help its residents. When they arrived, an even better idea emerged. inquirer.com", "2017-09-25T16:31:16.000Z": "A $15 min wage will spur our economy & ensure workers can meet their basic financial needs. Christie/Guadagno refuse to support, but I will. Quote Tweet Gianna Tarantino @NJSmallBz Target to bump minimum wage to $11 an hour, will increase it to $15 by 2020 http:// dlvr.it/PqLWYC  #NJBusiness", "2017-09-25T16:02:21.000Z": "RT if you've had enough of #NJtransit problems under the Christie-Guadagno administration and are voting for Phil to get #NJ moving again!", "2017-09-24T23:48:42.000Z": "Today, NJ Dems came together for our state's first ever Muslim Leadership Summit. NJ is ready to turn the page. #Murphy4NJ  #Muslims4Victory", "2017-09-24T19:55:23.000Z": "Emma and I were honored to participate in the Mexican flag raising and parade in Passaic today. We stand with Mexico as they rebuild!", "2017-09-23T23:47:05.000Z": "Phil Murphy takes his town hall to Montclair http:// dlvr.it/Pq1hwr", "2017-09-23T18:13:37.000Z": "Speaking to Victory 2017's AAPI Leadership Conference about the importance of this November's election. NJ is ready for change. #Murphy4NJ", "2017-09-23T17:28:43.000Z": "\"We will fully fund Planned Parenthood\" @PhilMurphyNJ during today's Town Hall. @PPact", "2017-09-23T17:15:08.000Z": "And tremendous thanks to @Action2getherNJ and @NJWFA for the great support making today happen, as well!", "2017-09-23T17:14:04.000Z": "Our @SIRIUSXM town hall sponsored by @BlueWave_NJ is kicking off in Montclair! Thanks to @Deanofcomedy for coming and spending time w us.", "2017-09-23T15:27:48.000Z": "Proud to join @1199SEIU_NJ in their fight for 15. It's time for a governor who puts working families first. #Murphy4NJ", "2017-09-23T15:17:30.000Z": "Deputy Campaign Manager Jenny Davis with @LiUNAEasternReg union members getting ready for the Hudson CLC labor walk! #Murphy4NJ", "2017-09-22T15:56:19.000Z": "Honored to stand w @Everytown and @MomsDemand for their endorsement today. We can make NJ the nation's leader in common sense gun laws.", "2017-09-21T21:51:22.000Z": "Holding an incredible town hall in Newark with hundreds of @LiUNAEasternReg union members ready to bring change to NJ!", "2017-09-21T19:43:43.000Z": "Rs in NY have come out against GC ACA repeal, but NJ's GOP congressional delegation silent. Are they taking their cues from @KimGuadagnoNJ ?", "2017-09-21T16:45:05.000Z": "The state of our transpo infra is unacceptable. Christie-Guadagno admin let NJT deteriorate into a national joke. NJ needs to turn the page. Quote Tweet Curtis Protect the Free Press Tate @tatecurtis More track closures planned in 2018 in New York Penn Station: http:// northjersey.com/story/news/tra nsportation/2017/09/20/amtrak-plan-more-track-closures-coming-penn-station-2018/686166001/ ", "2017-09-20T20:00:31.000Z": "As governor, Phil Murphy will protect immigrants and DREAMers -- and ensure that their dreams do in fact come true right here in NJ.", "2017-09-20T19:58:42.000Z": "Healthcare is a right, not a privilege. We must raise our voices loud and clear, and fight this disastrous bill. -PM Quote Tweet Phil Murphy @PhilMurphyNJ This bill cuts funding to NJ by $4b. Hundreds of thousands in NJ would lose their coverage. Protection from preexisting conditions weakened. https:// twitter.com/voxdotcom/stat us/910517985357500417 ", "2017-09-20T19:58:18.000Z": "This bill cuts funding to NJ by $4b. Hundreds of thousands in NJ would lose their coverage. Protection from preexisting conditions weakened. Quote Tweet Vox @voxdotcom The staggering hypocrisy of Bill Cassidy and Lindsey Graham http:// bit.ly/2xw908q", "2017-09-20T18:43:36.000Z": "Message for @KimGuadagnoNJ : even @GovChristie knows Graham-Cassidy would be \"too injurious\" for NJ. Why won't you stand up for NJ residents?", "2017-09-20T16:55:52.000Z": "Wishing all celebrating Rosh Hashanah a Happy New Year! May it be filled with good health, happiness, prosperity, & peace. Shanah Tovah! -PM", "2017-09-20T16:52:47.000Z": "Thank you @njfmba for allowing me to speak to you at your conference. The work you do everyday should be commended, not vilified.", "2017-09-20T16:24:29.000Z": "Unimaginable devastation and loss of life in Mexico. Our hearts break for you. We will be with you as you rebuild.", "2017-09-20T16:04:14.000Z": "Thoughts with Puerto Rico & the Caribbean as Hurricane Maria passes. My family and I are praying for all affected. NJ stands with you.", "2017-09-20T12:51:24.000Z": "Misogynistic language & posing with conf flag not what we're about. This is pass/fail. AsmSpace must apologize& @KimGuadagnoNJ must speak up Quote Tweet POLITICO New Jersey @politiconj Confederate flag assemblyman recorded making crude comments about opponent http:// politi.co/2f9ts4I", "2017-09-19T17:28:28.000Z": "Great to be home in #Montclair with our Democratic county committee and our next Lieutenant Governor @SheilaOliverNJ  @PhilMurphyNJ", "2017-09-19T16:02:36.000Z": "NJ would lose billions under this plan. Christie/Guadagno silent even as administration announces new Medicaid spending on opioids.  -PM Quote Tweet Phil Murphy @PhilMurphyNJ It's not Halloween yet, but ACA repeal is back from the dead. We must fight this as vigorously as earlier efforts: https:// nytimes.com/2017/09/19/opi nion/editorials/republican-healthcare-graham-cassidy.html ", "2017-09-19T16:02:14.000Z": "It's not Halloween yet, but ACA repeal is back from the dead. We must fight this as vigorously as earlier efforts: Opinion | The Republican Health Care Zombie Is Back After spending much of this year trying to kill the Affordable Care Act, House and Senate leaders try again with a worse plan. nytimes.com", "2017-09-19T13:32:41.000Z": "NJ Friends: Hope u come out Saturday to @PhilMurphyNJ Town Hall Im moderating-it will air as special on my show http:// bluewavenj.org/murphytownhall", "2017-09-19T14:07:01.000Z": "The state of NJT is unacceptable. Commuters are paying more & getting less reliable service.\n\nSee our plan here: https:// murphy4nj.com/issue/nj-trans it/  Quote Tweet Kim Mullaney @momofrazorsam What's your plan for improving @NJTransit  @PhilMurphyNJ ? #NJElection  #NJGovRace", "2017-09-19T09:59:22.000Z": "Thrilled to welcome back Princeton hero Sen Bill Bradley as he endorsed our next gov @PhilMurphyNJ  @TigerlabsCo", "2017-09-19T01:04:49.000Z": "Great crowd at @BergenDems end of aummer BBQ - Bergen County is ready to turn the page from Christie/Guadagno. #Murphy4NJ", "2017-09-18T21:38:36.000Z": "\"The good news is that if choices got us into this, choices and the right leadership & priorities can get us out.\" https:// njtvonline.org/news/video/mur phy-says-nj-community-colleges-tuition-free/ ", "2017-09-18T18:31:05.000Z": "Phil Murphy: I'll bring tuition- free community college to N.J. http:// dlvr.it/Pnrx1j", "2017-09-18T17:20:33.000Z": "Thank you @CoryBooker for being with us in Trenton as we roll out our Workforce Development platform - read it here: https:// murphy4nj.com/issue/connecti ng-new-jerseyans-to-good-jobs/ ", "2017-09-18T13:30:27.000Z": "Princeton's @TigerlabsCo , where NJ's innovation econ is taking root. Honored to be joined by fmr Sen Bill Bradley & receive his endorsement!", "2017-09-18T00:05:07.000Z": "Marched in the annual Puerto Rican Parade in Newark this afternoon - great turnout from a strong community! #estamoslisto", "2017-09-16T21:34:45.000Z": "We celebrated Hispanic Heritage Month by attending annual Latino Festival in Freehold hosted by Latino Alliance of Monmouth #estamoslisto", "2017-09-16T17:08:45.000Z": "In Manahawken talking to Dems about competing in every district in NJ, top to bottom of ballot. We must turn the page from Christie-Guadagno", "2017-09-16T15:54:23.000Z": "Great morning at the Makers Festival in Stafford NJ - we must do more to support small businesses & the arts!", "2017-09-16T00:59:42.000Z": "It was an honor to meet his holiness #MahantSwami and to address the BAPS Robbinsville Temple congregation. Jai Swaminarayan!", "2017-09-15T20:10:59.000Z": "Thank you @MartinOMalley for firing up NJ Dems at the 2017 @NJDSC Conference!", "2017-09-15T17:23:50.000Z": "Fmr. Missouri Sec of State @JasonKander : \"Put in place a governor who will help NJ lead the way on expanding voting rights\" @NJDSC", "2017-09-15T16:17:49.000Z": "Here with the @PhilMurphyNJ  #Victory2017 Campaign at Six Flag's Muslim Day! Stop on by! #MuslimDay", "2017-09-15T16:43:50.000Z": "Talking to the @NJDSC Youth Caucus about the critical importance of our election for their generation. NJ needs to turn the page #Murphy4NJ", "2017-09-15T15:10:04.000Z": "Thank you @CornellWBrooks for your incredible & important endorsement: https:// facebook.com/PhilMurphyNJ/v ideos/1123837801083858/ ", "2017-09-15T14:01:07.000Z": "Gender pay gap unacceptable but decreasing, but like most economic measures, NJ lags behind. We must build a fairer, stronger economy. Quote Tweet Janice Kovach @janicekovach The disturbing facts about how much more money men earn than women in N.J. http:// nj.com/news/index.ssf /2017/09/census_gender_wage_gap_shrinks_but_not_in_new_jers.html ", "2017-09-15T13:18:02.000Z": "Inspiring winner of the labor movement with Lizette Delgago-Pelanco, John Currie, . @SheilaOliverNJ and . @PhilMurphyNJ .", "2017-09-15T13:03:40.000Z": "Addressing @NJDSC convention, urging the room to keep up our fight for a stronger, fairer economy that works for all NJ families. #Murphy4NJ", "2017-09-13T23:00:02.000Z": "The crowd is building for tonight's town hall in Hamilton Township, Mercer County. Join us online: http:// Facebook.com/PhilMurphyNJ", "2017-09-13T20:44:28.000Z": "Last night in Jersey City, Phil spoke to a packed room about building a stronger, fairer economy that works for all NJ families. #Murphy4NJ", "2017-09-13T00:31:19.000Z": "Thanks to Harvey for providing sign language translation at tonight's town hall - proud to make our events accessible", "2017-09-12T23:24:33.000Z": "Mayor @StevenFulop kicks us of at our town hall in Jersey City - stream it live: http:// facebook.com/philmurphynj", "2017-09-12T22:52:45.000Z": "Edith Windsor put the exclamation point on the term \"Love is love!\" May she rest knowing she made our world more loving and inclusive. -PM Quote Tweet The New York Times @nytimes Edith Windsor's landmark Supreme Court case required the federal government to recognize same-sex marriages in 2013 http:// nyti.ms/2wXvDAv", "2017-09-12T20:34:36.000Z": "From attacking union protections to choosing corps & the wealthy over working families, Walker, Christie, & Guadagno are perfect together.", "2017-09-12T20:27:32.000Z": "As Gov, I will stand up to Trump/DeVos & ensure that our colleges do everything possible to ensure a safe environment for all students. Quote Tweet Jane Karr @JaneAKarr Right and Left on Betsy DeVos's Changes to Campus Sex Assault Rules https:// nyti.ms/2eSMoV7", "2017-09-12T17:33:47.000Z": "At our first of two town halls today, talking about building a stronger and fairer economy that works for all NJ families. #Murphy4NJ", "2017-09-11T17:40:24.000Z": "Hosting a conference call on the importance of drawing employment opportunities to NJ, such as Amazon's HQ2. We must strengthen NJ's economy", "2017-09-11T13:16:05.000Z": "Speaking at the 9/11 memorial service in Jersey City. #neverforget", "2017-09-10T20:39:49.000Z": "Happy to visit Mayor Hornik and the entire Monmouth team at Marlboro Day - Monmouth Co. is ready to end Christie/Guadagno era politics!", "2017-09-10T17:20:10.000Z": "The Murphy team is in Paterson for the Dominican American parade! #Murphy4NJ"}