{"2020-07-16T22:22:38.000Z": "Wearing a mask is about respect.\n\nWe launched a national campaign to encourage every American to wear a mask. Stop the Spread. Save Lives. #MaskUpAmerica 0:30 701.9K views From Andrew Cuomo", "2020-07-30T19:37:19.000Z": "At a time when Americans are dying at a rate of approximately one per minute:\n\nWear A Mask. Stop the Spread. Save Lives. Quote Tweet The Washington Post @washingtonpost U.S. reports 1,400 coronavirus deaths in a day - about one per minute.\n\nLive updates: https:// wapo.st/3fewxNB", "2020-07-30T17:39:28.000Z": "As we continue to fight COVID, we also must prepare for the upcoming fall flu season.\n\nNY will provide funding to counties to increase their contact tracing operations & help ensure counties are ready to provide both flu and COVID testing to residents. Governor Cuomo Announces More Than $30 Million to Enhance COVID-19 Contact Tracing and Flu Preven... Governor Cuomo announced more than $30 million to enhance COVID-19 contact tracing and flu prevention in advance of the fall flu season. governor.ny.gov", "2020-07-30T17:23:43.000Z": "It's #CensusWeek & we need to get the word out.\n\nPease take a moment to text or call 10 people & urge them to complete the Census.\n\nBillions of dollars & Congressional seats are on the line.\n\nRespond today and #GetCountedNY : https:// my2020census.gov", "2020-07-30T15:38:20.000Z": "Today's update on the numbers:\n\nOf the 73,546 tests reported yesterday, 777 were positive (1.06% of total).\n\nTotal hospitalizations fell to 586.\n\nSadly, there were 13 COVID fatalities yesterday.", "2020-07-30T12:49:31.000Z": "The economy will never fully recover until our nation gets the virus under control.\n\nIt was never a choice between public health and the economy. Quote Tweet NPR @NPR NEW: The coronavirus pandemic triggered the sharpest economic contraction in modern American history - as GDP shrank at an annual rate of 32.9% in the second quarter.\n\n\"Horrific,\" one economist says. \"We've never seen anything quite like it.\" https:// trib.al/ST0FC12", "2020-07-30T12:34:30.000Z": "\"Though I may not be here with you, I urge you to answer the highest calling of your heart and stand up for what you truly believe.\" Opinion | John Lewis: Together, You Can Redeem the Soul of Our Nation Though I may not be here with you, I urge you to answer the highest calling of your heart and stand up for what you truly believe. nytimes.com", "2020-07-30T00:14:23.000Z": "If essential workers can wear masks for 12-hour shifts, you can wear one while running an errand. #MaskUpAmerica", "2020-07-29T18:01:16.000Z": "The men's U.S. Open Championship will be held without fans from Sep. 14-20 at Winged Foot Golf Club in Mamaroneck.\n\nThe national championship is a great event & the organizers are working with the State Department of Health to ensure everyone's safety.", "2020-07-29T16:44:52.000Z": "In NY's time of need, Americans came to our aid. We promised to pay it forward.\n\nToday NY set up a new testing site in St. Petersburg, FL and shipped much-needed PPE.\n\nResidents can make an appointment to get tested by calling 833-697-4352.", "2020-07-29T15:54:19.000Z": "Today's update on the numbers:\n\nOf the 62,276 tests reported yesterday, 715 were positive (1.14% of total).\n\nTotal hospitalizations fell to 619.\n\nSadly, there were 5 COVID fatalities yesterday.", "2020-07-29T13:25:24.000Z": "Every NY business is permitted by law to refuse entrance to customers who are not wearing masks.\n\nNo one has the right to endanger the health of store employees or other customers. Quote Tweet The Washington Post @washingtonpost Two Trader Joe's customers were asked to put on masks. They attacked employees instead, police said. https:// wapo.st/39zzwyQ", "2020-07-28T23:17:21.000Z": "Americans should never again rely on foreign supplies during a pandemic.\n\nThe fed gov took a smart step today in using the Defense Production Act to award the great NY company @Kodak a $765M loan for medical manufacturing.\n\nWe're happy to have worked w/ the WH to make this happen Quote Tweet Kodak @Kodak Kodak is proud to be a part in strengthening America's self-sufficiency in producing the key pharmaceuticals we need to keep our citizens safe. More to come at the signing ceremony. https:// dfc.gov/media/press-re leases/dfc-sign-letter-interest-investment-kodaks-expansion-pharmaceuticals ", "2020-07-28T20:50:05.000Z": "Delivering remarks by video at the Kodak Center in Rochester. Watch: Andrew Cuomo @NYGovCuomo Delivering remarks by video at the Kodak Center in Rochester. Watch: pscp.tv", "2020-07-28T19:20:54.000Z": "New York's travel advisory has been extended to Illinois, Kentucky, Minnesota, Puerto Rico and Washington D.C.\n\nIndividuals traveling to New York from states with high infection rates are required to quarantine for 14 days.\n\nSee the full list of states: COVID -19 Travel Advisory coronavirus.health.ny.gov", "2020-07-28T15:54:13.000Z": "What the federal government does this week will determine your property taxes, your school's budget, your subway fare, your bridge tolls and more.\n\nWithout state and local aid in the stimulus package, there will be painful cuts.\n\nNew Yorkers are watching and waiting.", "2020-07-28T15:34:25.000Z": "Today's update on the numbers:\n\nOf the 57,397 tests reported yesterday, 534 were positive (0.93% of total).\n\nTotal hospitalizations are at 648.\n\nSadly, there were 9 COVID fatalities yesterday.", "2020-07-28T14:16:22.000Z": "Nurses & doctors are still working long shifts to treat COVID patients.\n\nBus drivers are driving with the windows open in a heat wave to ensure air circulation.\n\nGrocery store workers and delivery people have never stopped putting food on our plates.\n\nThank you. Thank you.", "2020-07-28T00:02:15.000Z": "Videos from a concert held in Southampton on Saturday show egregious social distancing violations. I am appalled.\n\nThe Department of Health will conduct an investigation.\n\nWe have no tolerance for the illegal & reckless endangerment of public health. From Icculus The Brave", "2020-07-27T22:44:33.000Z": "Farewell to a fearless leader who inspired us with every act of his well-lived life. We will continue your fight and make #GoodTrouble . Quote Tweet theGrio.com @theGrio John Lewis becomes the FIRST Black lawmaker to lie in state in the Capitol Rotunda and his casket rests atop the catafalque built for President Abraham Lincoln's funeral in 1865. #JohnLewis  #GoodTrouble", "2020-07-27T15:40:17.000Z": "While the vast majority of restaurants and bars are in compliance, a few bad actors are not. \n\nLast night 27 additional establishments were issued violations.\n\nNYS will continue to enforce health laws that prevent the spread of this virus.", "2020-07-27T15:32:50.000Z": "Today's update on the numbers:\n\nOf the 57,270 tests reported yesterday, 608 were positive (1.06% of total).\n\nTotal hospitalizations are at 642.\n\nSadly, there were 11 COVID fatalities yesterday.", "2020-07-27T15:02:35.000Z": "I urge New Yorkers to exercise caution as a wave of extreme heat impacts the state.\n\nI encourage you to limit outdoor activity, especially if you are more susceptible to heat-related illness.\n\nRemember to wear a mask & practice social distancing at beaches and pools. Extreme Heat: Take Steps To Prevent Heat-Related Illness www.health.ny.gov", "2020-07-27T13:17:40.000Z": "We know it's hot.\nCOVID doesn't care.\n\nWear a mask.\nNot around your chin.\n\nFeeling hot is bad - COVID is worse.", "2020-07-27T00:15:56.000Z": "In March & April there weren't enough masks.\n\nPeople were sewing them in their homes. We were ordering them from all over the globe.\n\nNow you can get masks easily - so WEAR THEM. #MaskUpAmerica", "2020-07-26T22:10:31.000Z": "This week, NY announced the largest combined clean energy solicitations in U.S. history - enough clean energy to power 1.5 million homes.\n\nWith a failure of federal leadership, it falls on states to take the actions needed to combat climate change. New York Wants to Buy Enough Clean Power for 1.5 Million Homes New York Governor Andrew Cuomo is seeking bids for up to 4,000 megawatts of clean energy, enough to power 1.5 million homes. bloomberg.com", "2020-07-26T14:15:27.000Z": "This weekend in every county in downstate NY investigators found blatant disregard for the law at bars & restaurants.\n\n105 violations were issued. Suspensions will be determined this week.\n\nThe state will enforce health laws. If we don't, the virus will spread.", "2020-07-26T14:03:39.000Z": "Today's update on the numbers:\n\nOf the 53,568 tests reported yesterday, 536 were positive (1.0% of total).\n\nTotal hospitalizations fell to 637.\n\nSadly, there were 3 COVID fatalities yesterday.", "2020-07-26T13:28:39.000Z": "On the 30th anniversary of the Americans with Disabilities Act, New York stands firmly committed to being a state where people of all abilities can thrive.\n\nWe will keep fighting for a more accessible and inclusive New York. #ADA30", "2020-07-26T00:24:57.000Z": "The mask goes over your nose. Some people don't seem to realize.", "2020-07-25T22:10:05.000Z": "It doesn't matter if you're young, if you work out every day, if you're only partying with your close friends, if you think you have antibodies - COVID is still a threat.\n\nBe smart and wear a mask.", "2020-07-25T21:05:00.000Z": "New York lost a TV legend today. \n\nBronx born and raised, Regis Philbin greeted us for years with our morning coffee and at night after dinner.\n\nHis humor and enthusiasm touched millions of Americans. My heart goes out to Joy and his loved ones.", "2020-07-25T16:02:05.000Z": "New York's #Census response rate is at 58%, below the national average.\n\nCome on, New York. We can do better.\n\nRespond to the Census today: https:// my2020census.gov", "2020-07-25T12:57:27.000Z": "Today's update on the numbers:\n\nOf the 71,466 tests reported yesterday, 750 were positive (1.05% of total).\n\nTotal hospitalizations fell to 646.\n\nSadly, there were 10 COVID fatalities yesterday.", "2020-07-25T12:53:24.000Z": "Happy Saturday to everyone wearing a mask.", "2020-07-24T23:01:56.000Z": "Partiers be warned: There will be active enforcement against bars and restaurants violating health regulations.\n\nEnjoy your weekend SAFELY and don't be the reason behind a COVID cluster.", "2020-07-24T20:10:00.000Z": ". @NYGovCuomo has made it official. \n\nLet's #PlayBall ! #LGM", "2020-07-24T18:20:35.000Z": "Travelers: DON'T book air travel to NY for just a few days or a week if you're from a state on the quarantine list. You will have to quarantine in New York for at least 14 days. Details: COVID -19 Travel Advisory coronavirus.health.ny.gov", "2020-07-24T19:40:29.000Z": "NY is proud to welcome the @BlueJays to Buffalo this season! Quote Tweet Toronto Blue Jays @BlueJays Blue Jays To Stage Majority Of 2020 Home Games In Buffalo.", "2020-07-24T18:21:44.000Z": "In brief: They lied and got caught. Quote Tweet NPR @NPR The White House is lifting a months-long ban on New York state residents from taking part in the Trusted Traveler Program - after Homeland Security admitted that it made false statements responding to a lawsuit New York brought over the issue. https:// trib.al/7rQhoiC", "2020-07-24T16:55:00.000Z": ". @DHSgov has become a government agency that violates the law and is used as a political weapon against perceived opponents of the Trump administration.\n\nCongress must investigate their abuses.", "2020-07-24T16:23:51.000Z": "#BREAKING : Gov. Andrew Cuomo says that Chad Wolf, Ken Cuccinelli violated oath of office and should be charged: \"I believe Mr. Wolf and Mr. Cuccinelli have possible criminal liability.\"", "2020-07-24T16:23:39.000Z": "Appearing on @CNN at 12:30pm ET. Tune in.", "2020-07-24T16:04:48.000Z": "After @DHSGov illegally banned New Yorkers from TTP, there were huge lines at airports/border control.\n\nThose dense crowds may well have increased the spread of COVID at airports in Feb & Mar.\n\nNYS suffered significant damage & we will look at legal remedies.", "2020-07-24T15:54:05.000Z": "The truth has a way of coming out.\n\nThe federal gov't gave patently false reasons for banning New Yorkers from the Trusted Traveler Program.\n\nFrom the start, it was a politically motivated, illegal attack on New York by @DHSgov .\n\nAnd they got caught. Homeland Security Dept. Admits Making False Statements in Fight With N.Y. The surprise admission came as the Trump administration unexpectedly reversed its decision to bar New Yorkers from programs that allow travelers to speed through airports. nytimes.com", "2020-07-24T15:37:59.000Z": "Today's update on the numbers:\n\n76,507 tests were performed yesterday. 753 tests came back positive (0.98% of total).\n\nTotal hospitalizations fell to 650.\n\nSadly, there were 9 COVID fatalities yesterday.", "2020-07-24T15:35:29.000Z": "Holding a press briefing and making an announcement. Watch live: Andrew Cuomo @NYGovCuomo Holding a press briefing and making an announcement. Watch live: pscp.tv", "2020-07-24T13:02:30.000Z": "I will be making an announcement and holding a briefing at 11:30am ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-07-24T00:30:07.000Z": "We'll save you a click: It's New York, New Jersey and Connecticut. We made incredible progress by listening to the experts and doing the work to establish testing and tracing systems.\n\nLet's keep up the good work. #NewYorkTough Just 3 states meet these basic criteria to reopen and stay safe Most states still need to reduce coronavirus cases and build up their testing capacity. vox.com", "2020-07-23T23:05:04.000Z": "As baseball gears up, don't forget to mask up.\n \nThanks @Yankees for the reminder and the baseball. #NewYorkTough", "2020-07-23T16:08:36.000Z": "New York State tested every incarcerated individual in @NYSDOCCS facilities aged 55 and over.\n\n1.9% of those tested were positive for COVID - all of whom were asymptomatic.\n\nWe are committed to ensuring the safety of every facility.", "2020-07-23T15:54:47.000Z": "Young people can & have died from COVID. Many more will have lasting health issues.\n\nIf you treat COVID lightly, you may not live to regret it.", "2020-07-23T15:45:32.000Z": "The question was never Reopen or Stay Closed, Health or Economy.\n\nThe economy won't fully recover until our country gets the virus under control.\n\nThat can only happen with a data-driven, fact-based approach.", "2020-07-23T15:36:49.000Z": "Today's update on the numbers:\n\n69,698 tests were performed yesterday. 811 tests came back positive (1.16% of total).\n\nTotal hospitalizations fell to 706.\n\nSadly, there were 13 COVID fatalities yesterday.", "2020-07-23T15:33:19.000Z": "In New York City holding a briefing. Watch Live: Andrew Cuomo @NYGovCuomo In New York City holding a briefing. Watch Live: pscp.tv", "2020-07-23T12:43:56.000Z": "I will be making an announcement and holding a briefing at 11:30am ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-07-23T12:35:49.000Z": "There should be a national mask mandate.", "2020-07-22T23:35:23.000Z": "They ignore the science.\n\nThey discredit their own health experts.\n\nThey deny reality.\n\nAmericans deserve better.", "2020-07-22T22:44:57.000Z": "Thank you @blakelively  @VancityReynolds for your donation of much-needed supplies that will help NY families in need.\n\nThe 5,000 packages of diapers & 2,000 packages of baby wipes will be distributed at our food banks. \n\nGrateful for the #NewYorkLove .", "2020-07-22T19:39:49.000Z": "When we needed it most Americans stepped up to help. We promised to return the favor. \n\nNY set up a testing site at the Kingdom Life Christian Fellowship in #Savannah , Georgia, to share our expertise.\n\nCall 833-697-4728 to schedule an appointment.", "2020-07-22T17:13:29.000Z": "In a ten round fight COVID would knock out DENIAL in round one.\n\nDenial is a losing strategy.\n\nThe federal government should stop betting on it.", "2020-07-22T16:43:11.000Z": "Will be calling into @mitchellreports on @MSNBC at approx. 12:45pm. Tune in.", "2020-07-22T15:48:42.000Z": "If Republicans in Congress care about economy recovery put politics aside. NOW.\n\nFund state and local government. NOW. \n\nBlue and red states alike are broke from this crisis.", "2020-07-22T15:33:07.000Z": "Today's update on the numbers:\n\n67,659 tests were performed yesterday. 705 tests came back positive (1.04% of total).\n\nTotal hospitalizations fell to 714.\n\nSadly, there were 9 COVID fatalities yesterday.", "2020-07-22T00:18:21.000Z": "While the federal government fails to lead in the fight against climate change, local leaders are proving bold action makes a difference. @NYGovCuomo 's move to power homes with clean energy will get us further & faster toward achieving our climate goals. New York Wants to Buy Enough Clean Power for 1.5 Million Homes New York Governor Andrew Cuomo is seeking bids for up to 4,000 megawatts of clean energy, enough to power 1.5 million homes. bloomberg.com", "2020-07-21T12:22:21.000Z": "If a hospital worker can wear a mask nonstop during a 10-hour shift.\n\nIf women can wear masks during labor.\n\nYou can wear a mask while running an errand.", "2020-07-21T17:31:33.000Z": "New York's travel advisory has been expanded to 31 states.\n\nIf you're traveling to NY from the following states you must self-quarantine for 14 days:\n\nAK, AL, AR, AZ, CA, DE, FL, GA, IA, ID, IN, KS, LA, MD, MO, MS, MT, NC, ND, NE, NM, NV, OH, OK, SC, TN, TX, UT, VA, WA, WI.", "2020-07-21T16:02:53.000Z": "One state can only do so much to protect itself from COVID.\n\nThe virus can and will cross state lines.\n\nThere must be a national plan to get this virus under control.\n\n5 months later, we're still waiting.", "2020-07-21T15:47:40.000Z": "The state will suspend liquor licenses for businesses in violation of health orders.\n\nLocal governments must also enforce these rules.\n\nWe need compliance to stop the spread and keep New Yorkers safe.", "2020-07-21T15:47:39.000Z": "Let's be clear.\n\nOutdoor dining is now permitted statewide.\n\nOutside drinking is not.", "2020-07-21T15:34:14.000Z": "Today's update on the numbers:\n\n66,169 tests were performed yesterday. 855 tests came back positive (1.29% of total).\n\nTotal hospitalizations are at 724.\n\nSadly, there were 2 COVID fatalities yesterday.", "2020-07-21T00:11:48.000Z": "Here is where denial got us.\n\nFive months into this pandemic our nation is totally unprepared.\n\nThis virus thrives on denial.", "2020-07-20T22:28:37.000Z": "When New York was at its worst point, 30,000 Americans volunteered to help.\n\nWe need that unity and solidarity now if we want to beat this virus.\n\nWe are interconnected and our destiny is linked.", "2020-07-20T21:59:03.000Z": "When states help out each other, we're stronger.\n\nNY is proud to work with @MayorJohnsonSAV to launch two new COVID testing centers in Savannah, GA.\n\nSavannah residents: Call 833-697-4728 to schedule an appointment.", "2020-07-20T18:32:55.000Z": "New York takes no peace in the fact that our infection rate is low.\n\nThis virus can and will cross state borders. We know that.\n\nWe stand ready to help all states. We can't defeat COVID alone.", "2020-07-20T18:14:29.000Z": "In Savannah, Georgia, holding a roundtable with @MayorJohnsonSAV . Watch Live: Andrew Cuomo @NYGovCuomo In Savannah, Georgia, holding a roundtable with @MayorJohnsonSAV. Watch Live: pscp.tv", "2020-07-20T17:53:22.000Z": "NY Georgia. \n\nHolding a roundtable with @MayorJohnsonSAV at 2:00pm ET. Watch live: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-07-20T15:34:05.000Z": "Heading to Savannah, Georgia, for the day to deliver PPE, meet with @MayorJohnsonSAV and offer our help.\n\nAmericans from across the country helped us when we needed it most.\n\nI made a promise that NY would return the favor.", "2020-07-20T13:42:16.000Z": "", "2020-07-20T13:39:20.000Z": "There are facts and then there are myths.\n\nIf you are in your 20s you can get sick.\n\nAnd you can make other people sick.\n\nYou're not a superhero. But you could become a superspreader.", "2020-07-20T13:32:56.000Z": "Today's update on the numbers:\n\n49,342 tests were performed yesterday. 519 tests came back positive (1.05% of total).\n\nTotal hospitalizations fell to 716.\n\nSadly, there were 8 COVID fatalities yesterday.", "2020-07-20T13:30:05.000Z": "At JFK International Airport making an announcement. Watch Live: Andrew Cuomo @NYGovCuomo At JFK International Airport making an announcement. Watch Live: pscp.tv", "2020-07-20T13:17:12.000Z": "This weekend COVID didn't quit but too many NYers did.\n\nThis is not NY Tough and it sure isn't NY Smart. \n\nWear a mask. Social distance.\n\nIt is NOT worth the risk. Reopen News: Hundreds gather, crowd Queens streets without masks Clusters of people were caught on video refusing to practice social distancing during the overnight hours in Queens Friday. abc7ny.com", "2020-07-20T13:09:07.000Z": "I will be making an announcement and holding a briefing at approx. 9:30am ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-07-19T20:54:03.000Z": "Had a great time outdoor dining with Michaela at The Local 217 Taproom & Kitchen in Albany. Thanks to owner Susie for the great food & being a model of perfect COVID safety compliance!", "2020-07-19T17:02:48.000Z": "Imagine where our nation would be if the federal government treated this public health crisis as just that: A public health crisis.", "2020-07-19T13:22:03.000Z": "Today's update on the numbers:\n\n46,204 tests were performed yesterday. 502 tests came back positive (1.08% of total).\n\nTotal hospitalizations fell to 722\n\nSadly, there were 13 COVID fatalities yesterday.", "2020-07-18T22:48:47.000Z": "This story could have gone very differently. When you wear a mask you are protecting others. #MaskUpAmerica", "2020-07-18T19:10:47.000Z": "Gov Cuomo and New Yorkers earn high praise from Dr Fauci -->  Keep it up, NY!\n\nFauci holds up New York as model for fighting coronavirus - 'They did it correctly' Fauci holds up New York as model for fighting coronavirus - 'They did it correctly' National Institute of Allergy and Infectious Diseases Director Anthony Fauci on Friday praised New York for its handling of the coronavirus pandemic, saying the state did it \"correctly.\" cnbc.com", "2020-07-18T16:51:21.000Z": "There are 750+ testing sites in New York State.\n\nAny New Yorker can get tested for any reason.\n \nFind a site near you: Find a Test Site Near You coronavirus.health.ny.gov", "2020-07-18T14:14:04.000Z": "A few reminders:\n\nIt's Saturday. Wear a Mask. Be Smart.", "2020-07-18T13:24:26.000Z": "Today's update on the numbers:\n\n69,817 tests were performed yesterday. 754 tests came back positive (1.08% of total).\n\nTotal hospitalizations fell to 743.\n\nSadly, there were 11 COVID fatalities yesterday.", "2020-07-18T12:44:42.000Z": "One of the greatest men this country has ever known. Quote Tweet John Lewis @repjohnlewis Do not get lost in a sea of despair. Do not become bitter or hostile. Be hopeful, be optimistic. Never, ever be afraid to make some noise and get in good trouble, necessary trouble. We will find a way to make a way out of no way. #goodtrouble", "2020-07-18T04:15:16.000Z": "With John Lewis' passing, America lost a civil rights icon who shined a light and fought the fight. \n\nKnow that we will continue to make #goodtrouble", "2020-07-18T01:51:47.000Z": "So proud. NY's health care workers are nothing short of heroes. #NewYorkTough Quote Tweet NBC Nightly News with Lester Holt @NBCNightlyNews Health care workers from New York City, the nation's former epicenter, are spreading out across the country to help amid the ongoing coronavirus surge. @tomcostellonbc has the latest on the pandemic tonight on @NBCNightlyNews .", "2020-07-17T22:46:49.000Z": "This weekend, New York will experience a potentially dangerous heat wave.\n\nI urge everyone to take precautions as high temperatures are expected to last through Sunday. Check your local weather forecasts for the most up-to-date information.", "2020-07-17T19:45:04.000Z": "NYC has been cleared to enter Phase 4 of reopening, starting Monday, July 20.\n\nPhase 4 will not include indoor activity in malls, restaurants or cultural institutions at this point.\n\nI'm so proud of what New Yorkers have done. But we must continue to be on alert.", "2020-07-17T14:09:15.000Z": "We appreciate the commitment to social distancing and the flexibility!\n\nWear a mask. From jamie", "2020-07-17T13:34:40.000Z": "There's a way to stop the spread of Coronavirus. \n\nThe answer weighs less than an ounce. #MaskUpAmerica", "2020-07-17T13:20:55.000Z": "Today's update on the numbers:\n\n78,239 tests were performed yesterday. 776 tests came back positive (0.99% of total).\n\nTotal hospitalizations fell to 765.\n\nSadly, there were 10 COVID fatalities yesterday.", "2020-07-17T12:23:09.000Z": "You know what it takes to beat community spread? Community.\n\nWe'll only defeat this virus if we all work together. All of us.", "2020-07-16T19:43:24.000Z": "Happy to be part of ... @NYGovCuomo 's national \"Mask Up\" campaign. Mask Up America | \"You Have My Respect\" | Morgan Freeman Governor Andrew M. Cuomo launched the national \"Mask Up America\" education and awareness campaign to urge all Americans to wear a mask while in public to hel... youtube.com", "2020-07-16T19:27:56.000Z": "Will be appearing on @MSNBC at approx. 3:40pm. Tune in.", "2020-07-16T16:51:22.000Z": "Houston NY | We appreciate @NYGovCuomo sending testing resources resources to #Houston to supplement our sites! Two free walk-up sites: Fallbrook Church Higher Dimension Church\n\nAppt required via 1-833-697-4839\n\nDetails: http:// HoustonEmergency.org/covid19  #hounews  #StopTheSpread", "2020-07-16T19:10:58.000Z": "Appearing on @CNN at approx. 3:15pm ET. Tune in.", "2020-07-16T18:50:17.000Z": "The only way you defeat a virus is with science and medicine.\n\nThis federal government does not understand that.", "2020-07-16T17:44:43.000Z": "36 years ago, my dad gave one of the greatest political speeches of my lifetime. I know he'd be so proud of how New Yorkers united over these last few months. From Steve Kornacki", "2020-07-16T15:52:40.000Z": "#MaskUpAmerica", "2020-07-16T15:47:54.000Z": "Today's update on the numbers:\n\n72,685 tests were performed yesterday. 769 tests came back positive (1.06% of total).\n\nTotal hospitalizations fell to 813.\n\nSadly, there were 14 COVID fatalities yesterday.", "2020-07-16T15:46:02.000Z": "NY didn't wait for Houston to call - we offered help to @houmayor and the City of Houston.\n\nWe have teams on the ground to set up testing sites that are now up & running.\n\nWe are grateful for what people across the US did for NY. We'll never forget it & we are paying it forward.", "2020-07-15T19:14:35.000Z": "My mother often says, \"A friend, in need, is a friend indeed.\"  We are grateful to have a friend in @NYGovCumo and the people of NY. #ATLStrong Quote Tweet Andrew Cuomo @NYGovCuomo When New York was in need, volunteers from around the country came here to help. We vowed to pay that generosity forward.\n\nAt the request of @KeishaBottoms , NY will send 7,500 test kits, 30,000 pieces of PPE and 1,250 gallons of hand sanitizer to Atlanta by Friday.", "2020-07-15T18:59:22.000Z": "When New York was in need, volunteers from around the country came here to help. We vowed to pay that generosity forward.\n\nAt the request of @KeishaBottoms , NY will send 7,500 test kits, 30,000 pieces of PPE and 1,250 gallons of hand sanitizer to Atlanta by Friday.", "2020-07-15T17:31:26.000Z": "The White House is actively trying to discredit its own medical professionals and health experts.\n\nThis is not normal. And it does nothing to help a suffering nation.", "2020-07-15T14:06:23.000Z": "Today's update on the numbers:\n\n63,598 tests were performed yesterday. 831 tests came back positive (1.30% of total).\n\nTotal hospitalizations are at 831.\n\nSadly, there were 9 COVID fatalities yesterday.", "2020-07-15T13:55:52.000Z": "Knock. It. Off. Now. \"We All Want To Pretend This Isn't Happening\": Mask-Free Pandemic Parties Are Popping Up In NYC \"It comes as a shock to us that these venues that cater to out-of-towners are disregarding the rules that we need to abide by to get out of the pandemic together.\" gothamist.com", "2020-07-14T16:08:56.000Z": "Tax filing reminder: New Yorkers have until July 15 (tomorrow) to file their personal income tax returns. The deadline was extended from April 15.\n\nFile online: https:// tax.ny.gov", "2020-07-14T17:30:33.000Z": "Health insurance news: July 15 is the last day to apply for coverage during @NYStateofHealth 's special enrollment period.\n\nEnroll today: NY State of Health, The Official Health Plan Marketplace Enroll Today! Shop for quality, affordable health insurance options at NY State of Health. nystateofhealth.ny.gov", "2020-07-14T18:08:45.000Z": "Here's a true story about how quickly COVID can spread.\n\nAt a 4th of July party in Suffolk County, at least one person was positive.\n\nSince the party, 35% of the people who attended have tested positive for COVID.\n\nIt only takes one person at one party.\n\nWear a mask and be smart.", "2020-07-14T17:18:41.000Z": "The White House doesn't get it.\n\nUntil we control this virus as a nation, the economy can't fully recover.\n\nWhere is the national plan?", "2020-07-14T16:59:17.000Z": "An important step toward meeting NY's aggressive climate targets.\n\nWith a lack of federal leadership and outright failure to follow science, it's up to the states to address the climate crisis. Quote Tweet Basil Seggos @BasilSeggos . @NYGovCuomo and 15 bipartisan state leaders are partnering to reduce #ClimateChange emissions from medium and heavy duty trucks. This will help us address air pollution in #EnvironmentalJustice communities and meet our ambitious climate targets. @NYSDEC  https:// washingtonpost.com/news/powerpost /paloma/the-energy-202/2020/07/14/the-energy-202-more-than-a-dozen-states-unite-to-boost-electric-trucks/5f0c5ff888e0fa7b44f73000/ ", "2020-07-14T16:05:44.000Z": "Individuals arriving from these states must undertake a precautionary quarantine for 14 days.\n\nThey must also complete a DOH Traveler Health Form that will be distributed by airlines and is available online here: https:// forms.ny.gov/s3/Welcome-to- New-York-State-Traveler-Health-Form ", "2020-07-14T16:03:44.000Z": "New York's travel advisory has been expanded to 22 states.\n\nIf you're traveling to NY from the following states you must self-quarantine for 14 days:\n\nThe states are: AL, AR, AZ, CA, FL, GA, IA, ID, KS, LA, MN, MS, NC, NM, NV, OH, OK, SC, TN, TX, UT, WI.", "2020-07-14T14:39:04.000Z": "Today's update on the numbers:\n\n60,045 tests were performed yesterday. 912 tests came back positive (1.5% of total).\n\nTotal hospitalizations are at 820.\n\nSadly, there were 5 COVID fatalities yesterday.", "2020-07-14T13:22:19.000Z": "Infection rates are alarmingly rising among 20 somethings in NY.\n\nYou can get and spread COVID.\n\nWear a mask. Get tested.", "2020-07-14T12:55:03.000Z": "You don't defeat a virus with politics. You defeat a virus with science and medicine.", "2020-07-14T02:30:36.000Z": "The Sea of Division. The Boyfriend Cliff. The Sun On The Other Side. See it all for yourself.\n\nPre-order the #NewYorkTough poster here: New York Tough Poster www.governor.ny.gov", "2020-07-13T23:34:50.000Z": "Just going to leave this right here. From BrooklynDad_Defiant!", "2020-07-14T00:19:07.000Z": "I'll be on @FallonTonight at approx. 11:35pm ET. Tune in. Quote Tweet Deadline Hollywood @DEADLINE 'The Tonight Show Starring Jimmy Fallon' Returns To Studio; Gov. Cuomo Welcomes Him Back To The City http:// dlvr.it/RbYRlb", "2020-07-13T22:59:17.000Z": "Public health has to come first. Facts have to come first. Science has to come first.", "2020-07-13T19:39:40.000Z": "#NewYorkTough", "2020-07-13T19:11:59.000Z": "We do like the boyfriend. All boyfriends face a steep climb. https:// twitter.com/chrissyteigen/ status/1282713903625957376  This Tweet is unavailable.", "null": "", "2020-07-13T16:22:10.000Z": "NY is issuing an emergency health order: \n\nOut-of-state travelers from designated high-COVID states must provide their contact information upon arrival.\n\nIf you fail to provide it, you will receive a summons with a $2K fine.\n\nWe're serious about enforcing quarantine.", "2020-07-13T16:13:02.000Z": "President Trump is attacking science.\n\nHe is denying reality and jeopardizing public health.\n\nIt is gross negligence.", "2020-07-13T16:09:11.000Z": "We all want schools to open but it has to be safe. In NY we will decide based on the data.\n\nSchools will reopen if a region is in Phase 4 & daily infection rate remains below 5% (14-day avg).\n\nSchools close if regional infection rate is greater than 9% (7-day avg) after August 1.", "2020-07-13T15:53:50.000Z": "Today's update on the numbers:\n\n51,687 tests were performed yesterday. 557 tests came back positive (1.08% of total).\n\nTotal hospitalizations fell to 792.\n\nSadly, there were 10 COVID fatalities yesterday.", "2020-07-13T15:39:15.000Z": "In New York City holding a briefing. Watch Live: Andrew Cuomo @NYGovCuomo In New York City holding a briefing. Watch Live: pscp.tv", "2020-07-13T13:16:38.000Z": "I will be holding a briefing and making an announcement at 11:30am ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-07-12T17:32:17.000Z": "One is a mask. The other is a chin guard. No one told you to wear a chin guard. Wear a mask.", "2020-07-12T10:37:44.000Z": "Please please please retweet this terrific videoclip of a little girl whose message about wearing masks is way way smarter and more powerful than what our so-called \"leaders\" mumble daily. Everyone should listen to her. Retweet if you agree! Quote Tweet Justice Seeker @tizzywoman #SaturdayMotivation I'm hoping that this little girl will reach the hearts and minds of every person that sees her, so spread this widely. #TheChildrenWillLeadUs  #WearAMask", "2020-07-12T13:37:41.000Z": "Today's update on the numbers:\n\n62,418 tests were performed yesterday. 677 tests came back positive (1.08% of total).\n\nTotal hospitalizations are at 801.\n\nSadly, there were 5 COVID fatalities yesterday.", "2020-07-11T14:32:47.000Z": "Today's update on the numbers:\n\n69,203 tests were performed yesterday. 730 tests came back positive (1.05% of total).\n\nTotal hospitalizations fell to 799\n\nSadly, there were 6 COVID fatalities yesterday.", "2020-07-11T12:46:51.000Z": "Two reminders:\n\nIt's Saturday and Wear a Mask.", "2020-07-10T23:59:01.000Z": "The virus doesn't take the weekend off.\n\nWear a mask. Stay six feet apart. Wash your hands with soap.\n\nBe smart. It's Up To Us, New York.", "2020-07-10T18:08:47.000Z": "New York promised to help states in need as we were helped when we needed it.\n\nToday we pay it forward.\n\nTomorrow we will deliver Remdesivir to Florida to help care for COVID patients.\n\nThe people of NY stand shoulder to shoulder with Americans fighting this virus.", "2020-07-10T14:30:37.000Z": "Even kids get it. Wear a mask.", "2020-07-10T14:02:20.000Z": "Today's update on the numbers:\n\n73,558 tests were performed yesterday. 786 tests came back positive (1.06% of total).\n\nTotal hospitalizations fell to 826.\n\nSadly, there were 8 COVID fatalities yesterday.", "2020-07-09T14:42:14.000Z": "It is a fundamental principle in our country: No one is above the law, not even the president.\n\nThis is a victory for democracy. Quote Tweet SCOTUSblog @SCOTUSblog In Trump v. Vance, #SCOTUS hands President Trump a defeat in battle with NY district attorney, holding that a subpoena to a sitting president does not have to meet a heightened standard Show this thread", "2020-07-09T13:45:09.000Z": "Today's update on the numbers:\n\n65,564 tests were performed yesterday. 584 tests came back positive (0.89% of total).\n\nTotal hospitalizations are at 851.\n\nSadly, there were 8 COVID fatalities yesterday.", "2020-07-09T13:24:32.000Z": "Tragically, this is becoming an evergreen tweet. Quote Tweet Andrew Cuomo @NYGovCuomo Yesterday the US hit a record high for new COVID cases.\n\nWEAR A MASK.", "2020-07-09T12:53:20.000Z": "Listen to Bill Nye.", "2020-07-08T20:49:34.000Z": "Welcome Virginia to the Regional Greenhouse Gas Initiative-the 11th state to join.\n\nThe #RGGI is a cap-and-trade program that is reducing fossil fuel emissions.\n\nWith the fed gov't ignoring science & abdicating its duty to combat climate change, it's up to the states to lead.", "2020-07-08T16:43:28.000Z": "Remember April?\n\nWe never want to live through a month like that again.\n\nNow is not the time to forget what we suffered through.\n\nBe smart. Wear a mask.", "2020-07-08T15:52:54.000Z": "The federal government does not decide if NYS schools reopen - the state does.\n\nWe will make that decision based on the science and the data.\n\nA decision will be announced in the first week of August.", "2020-07-08T15:49:36.000Z": "Beginning Friday, July 10, malls can open in Phase 4 regions as long as they have enhanced HVAC filtration systems & measures in place.\n\nThe more we learn about COVID, the clearer it is that safe ventilation is crucial.", "2020-07-08T15:36:10.000Z": "Today's update on the numbers:\n\n57,585 tests were performed yesterday. 692 tests came back positive (1.2% of total).\n\nTotal hospitalizations are at 841.\n\nSadly, there were 11 COVID fatalities yesterday.", "2020-07-08T15:32:30.000Z": "In New York City holding a briefing. Watch Live: Andrew Cuomo @NYGovCuomo In New York City holding a briefing. Watch Live: pscp.tv", "2020-07-08T13:48:02.000Z": "I will be holding a briefing and making an announcement at 11:30am ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-07-07T20:46:27.000Z": "Many of the 750+ testing sites in New York State are under capacity.\n\nAny New Yorker can now get tested for COVID.\n\nFind a site near you: Find a Test Site Near You coronavirus.health.ny.gov", "2020-07-07T16:24:30.000Z": "If you're traveling to New York from the following states you must self-quarantine for 14 days.\n\nThe states are: AL, AR, AZ, CA, DE, FL, GA, IA, ID, KS, LA, MS, NC, NV, OK, SC, TN, TX, UT.", "2020-07-07T14:57:34.000Z": "Despite Deutsche Bank's knowledge of Epstein's criminal history, they failed to prevent millions of dollars in suspicious transactions.\n\nNo matter how rich, how big or how powerful an institution you are, predatory behavior of any kind will not be tolerated in New York. Quote Tweet New York Daily News @NYDailyNews Deutsche Bank was slapped with a $150M penalty for failing to monitor Jeffrey Epstein's accounts.\n\n\"The Bank inexcusably failed to detect or prevent millions of dollars of suspicious transactions,\" a financial services superintendent says. https:// trib.al/bZpOxz1", "2020-07-07T14:00:49.000Z": "Today's update on the numbers:\n\n56,736 tests were performed yesterday. 588 tests came back positive (1.04% of total).\n\nTotal hospitalizations are at 836.\n\nSadly, there were 10 COVID fatalities yesterday.", "2020-07-06T21:34:44.000Z": "We are saddened by the death of Spc. Vincent Sebastian Ibarria, who was deployed to Afghanistan from Fort Drum.\n\nIn recognition of his service, I am directing all flags at half-staff. \n\n\nWe join his fellow soldiers, family, and friends in honoring his service to our nation.", "2020-07-06T19:19:03.000Z": "Not knowing, not testing is not an answer.\n\nIt's a rejection of science.", "2020-07-06T16:13:35.000Z": "No mammograms? We cured breast cancer.\n\nNo HIV tests? We eradicated HIV.\n\nNo pregnancy test? No baby.\n\nThe White House logic that without testing there is no virus is denial on a national scale.", "2020-07-06T15:58:16.000Z": "Violations of social distancing and mask-wearing risk lives.\n\nThe videos over the weekend from Fire Island, the East Village and elsewhere say it all - there is COVID fatigue.\n\nBut the virus doesn't get tired or lazy and we can't either.", "2020-07-06T15:47:36.000Z": "The @NYSFair is officially cancelled.\n\nThis one hurts - I love the State Fair. But the risk is too high to hold it this summer.", "2020-07-06T15:43:57.000Z": "When NY's phased reopening began, the goal was to avoid an uptick.\n\nWhat is happening now is even better: Our numbers continue to go down.\n\nThis is great news. But it's up to ALL New Yorkers to keep this progress going.", "2020-07-06T15:37:18.000Z": "Today's update on the numbers:\n\n54,328 tests were performed yesterday. 518 tests came back positive (0.95% of total).\n\nTotal hospitalizations fell to 817.\n\nSadly, there were 9 COVID fatalities yesterday.", "2020-07-06T15:34:17.000Z": "In New York City holding a briefing. Watch Live: Andrew Cuomo @NYGovCuomo In New York City holding a briefing. Watch Live: pscp.tv", "2020-07-06T14:22:29.000Z": "More testing ≠ more cases Quote Tweet Scott Gottlieb, MD @ScottGottliebMD New York State on 7/4: More testing. Fewer cases uncovered. When the virus is under control, testing doesn't uncover more cases. It's a tool for keeping the epidemic at bay.", "2020-07-06T13:00:19.000Z": "I will be holding a briefing and making an announcement at 11:30am ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-07-06T12:27:08.000Z": "A mask weighs less than an ounce.\n\nIt's not a heavy lift - wear a mask.", "2020-07-05T21:53:19.000Z": "Wear a mask, New York. Don't let our hard-won progress be reversed. From McCann Health", "2020-07-05T18:31:07.000Z": "Reminder: If you get a call from NYS Contact Tracing - Answer the phone!\n\nOur Contact Tracing force is working every day to help stop the spread.", "2020-07-05T13:53:23.000Z": "NYC will enter Phase 3 of reopening tomorrow. Indoor dining will remain closed.\n\nWear a mask. Socially distance. Be smart. #NewYorkTough", "2020-07-05T12:55:01.000Z": "Today's update on the numbers:\n\n63,415 tests were performed yesterday. 533 tests came back positive (0.84% of total).\n\nTotal hospitalizations fell to 832.\n\nSadly, there were 8 COVID fatalities yesterday.", "2020-07-05T02:57:14.000Z": "It's not red and blue. It's red, white and blue. Happy Independence Day!", "2020-07-04T23:26:20.000Z": "If we slip up - the virus will spread. \n\nIf we stop social distancing - the virus will spread.\n\nIf we ignore science & data - the virus will spread.", "2020-07-04T20:32:45.000Z": "This July 4th remember - real patriots wear masks. #NewYorkTough", "2020-07-04T16:28:46.000Z": "Happy Fourth of July!", "2020-07-04T15:09:47.000Z": "Today's update on the numbers:\n\n62,403 tests were performed yesterday. 726 tests came back positive (1.16% of total).\n\nTotal hospitalizations fell to 844.\n\nSadly, there were 11 COVID fatalities yesterday.", "2020-07-04T12:56:30.000Z": "It's Saturday.\n\nIt's the Fourth of July.\n\nCelebrate safely.", "2020-07-03T18:04:20.000Z": ". @repjohnlewis said \"when you see something that is not right, that is not fair, that is not just, say something, do something.\"\n\nThank you for your unwavering leadership. @JohnLewisDoc", "2020-07-03T15:15:05.000Z": "Today's update on the numbers:\n\n66,392 tests were performed yesterday. 918 tests came back positive (1.38% of total).\n\nTotal hospitalizations fell to 857.\n\nSadly, there were 9 COVID fatalities yesterday.", "2020-07-03T13:07:48.000Z": "Wearing a mask is about respect. \n\nIt shows you stand up when it counts. It shows you have joined the battle. It shows you care about your country. \n\nI can't think of a more patriotic thing.", "2020-07-03T00:27:26.000Z": "Washing your hands often with soap is still one of the best ways of avoiding COVID. Be safe and be smart.", "2020-07-02T20:55:05.000Z": "Remember that COVID won't take July 4th weekend off.\n\nWear a mask. Stay six feet apart. Wash hands with soap often.\n\nBig July 4 parties - especially indoor ones - are a bad idea. A really bad idea.", "2020-07-02T18:14:40.000Z": "", "2020-07-02T15:20:13.000Z": "Today's update on the numbers:\n\n69,945 tests were performed yesterday. 875 tests came back positive (1.25% of total).\n\nTotal hospitalizations fell to 878.\n\nSadly, there were 10 COVID fatalities yesterday.", "2020-07-01T22:43:08.000Z": "Remember to social distance. Stay 6 feet apart from others whenever possible.\n\nIt's Up To Us, New York.", "2020-07-01T21:24:04.000Z": "New Yorkers MUST comply with social distancing and wear masks.\n\nDon't risk your life.\n\nDon't risk someone else's life.\n\nWear a mask.", "2020-07-01T16:47:20.000Z": "Denying reality is a losing strategy.\n\nThe White House must face facts.\n\nThe national COVID situation is out of control.", "2020-07-01T16:04:47.000Z": "Indoor dining in NYC will be postponed until the facts change and it is safe and prudent.", "2020-07-01T15:54:43.000Z": "Beginning today we are expanding our testing criteria statewide to ALL New Yorkers.\n\nThere is enough capacity.\n\nGet tested.", "2020-07-01T15:49:54.000Z": "Today's update on the numbers:\n\n56,710 tests were performed yesterday. 625 tests came back positive (1.1% of total).\n\nTotal hospitalizations fell to 879.\n\nSadly, there were 11 COVID fatalities yesterday.", "2020-07-01T15:38:02.000Z": "In New York City holding a briefing. Watch Live: Andrew Cuomo @NYGovCuomo In New York City holding a briefing. Watch Live: pscp.tv", "2020-07-01T13:26:45.000Z": "It's July 1.\n\nWe are halfway through 2020, a year that is like no other. \n\n2020 - Year of the Mask. Wear one.", "2020-07-01T13:10:14.000Z": "I will be holding a briefing and making an announcement at 11:30am ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-30T15:51:10.000Z": "Mask around your neck: Not useful.\n\nMask covering your mouth and nose: Useful.", "2020-06-30T15:28:49.000Z": "If you're traveling to New York from the following states you must self-quarantine for 14 days.\n\nThe states are: AL, AR, AZ, CA, FL, GA, IA, ID, LA, MS, NC, NV, SC, TN, TX, UT.", "2020-06-30T14:47:42.000Z": "Today's update on the numbers:\n\n52,025 tests were performed yesterday. 524 tests came back positive (1.0% of total).\n\nTotal hospitalizations are at 891.\n\nSadly, there were 13 COVID fatalities yesterday.", "2020-06-30T14:19:01.000Z": "Wear. A. Mask.", "2020-06-30T14:10:34.000Z": "Carl Reiner, Bronx born and bred, made TV comedy that endures to this day. He made America laugh - a true gift. \n\nNew York extends our condolences to his family and many friends. Quote Tweet Variety @Variety Carl Reiner died Monday night of natural causes. He was 98 https:// bit.ly/31HBYl5", "2020-06-30T10:17:04.000Z": "New York Gov. Andrew Cuomo: \"COVID is getting worse not better. The White House is in denial.\" https:// abcn.ws/2ND6lRl", "2020-06-29T16:11:43.000Z": "Fireworks are dangerous and illegal.\n\nThe @nyspolice will launch a detail to prevent illegal fireworks from being brought into NYS from Pennsylvania.", "2020-06-29T16:02:23.000Z": "If President Trump wants Americans to take COVID seriously, there's one easy thing he can do. \n\nMr. President, put on a mask.", "2020-06-29T15:43:47.000Z": "Today's update on the numbers:\n\n46,428 tests were performed yesterday. 391 tests came back positive (0.84% of total).\n\nTotal hospitalizations fell to 853.\n\nSadly, there were 7 COVID fatalities yesterday.", "2020-06-29T15:41:46.000Z": "Wake up America.\n\nCOVID is getting worse not better.\n\nThe White House is in denial.", "2020-06-29T15:34:02.000Z": "In New York City holding a briefing. Watch Live: Andrew Cuomo @NYGovCuomo In New York City holding a briefing. Watch Live: pscp.tv", "2020-06-29T14:31:55.000Z": "I will be holding a briefing and making an announcement at 11:30am. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-29T14:19:02.000Z": "Today the Supreme Court reaffirmed what was clear - Louisiana's law purporting to protect health and safety is unconstitutional and was always about restricting reproductive rights.\n\nWe will not go back.", "2020-06-29T13:30:31.000Z": "Show you care. Wear a mask.", "2020-06-29T12:22:21.000Z": "Calling into @NY1 now with @patkiernan . Tune in.", "2020-06-28T19:01:08.000Z": "Learn more about the Restoration of Honor Act and how to apply here: https:// veterans.ny.gov/content/restor ation-honor-act ", "2020-06-28T18:59:31.000Z": "Any NY veteran denied honorable discharge due to their LGBTQ identity can submit an application under The Restoration of Honor Act starting today.\n\nThis Act will restore their rightful state veterans' benefits.\n\nThank you to sponsors @bradhoylman and @DidiBarrett106 .", "2020-06-28T16:30:55.000Z": "On #Pride we celebrate our progress in the fight for #LGBTQ rights & vow to keep fighting.\n\nWe will keep knocking down the barriers to equality.\n\nThis year we will work to repeal the #WalkingWhileTrans statute & combat anti-trans violence.", "2020-06-28T15:05:46.000Z": "This virus does not respond to politics or party.\n\nIt responds to what we do. \n\nWear a Mask. Everyone Wear a Mask.", "2020-06-28T14:01:45.000Z": "Today's update on the numbers:\n\n61,906 tests were performed yesterday. 616 tests came back positive (0.99% of total).\n\nTotal hospitalizations fell to 869.\n\nSadly, there were 5 COVID fatalities yesterday.", "2020-06-28T13:45:46.000Z": "I'll be on @MeetThePress with @ChuckTodd this morning. \n\nTune in at 10:00am in Albany and 10:30am in NYC.", "2020-06-28T13:35:15.000Z": "Today we celebrate #Pride on the 50th anniversary of the NYC Pride March.\n\nWe join together as one New York for equality, respect and as a community with pride.\n\nWe stand united not only by love, but our commitment to progress.", "2020-06-27T18:47:25.000Z": "In April, NYS eliminated the process known as \"second parent adoption\" - providing #LGBTQ parents an immediate pathway to be legally recognized as their child's parents. Here's why that matters. #Pride", "2020-06-27T14:54:28.000Z": "In the middle of a global pandemic, the Trump admin wants the Supreme Court to strike down the entire Affordable Care Act.\n\nThey have no plans to replace it.\n\n20 million Americans will lose their health care.\n\nIt's morally bankrupt and reckless.", "2020-06-27T14:00:46.000Z": "Today's update on the numbers:\n\n73,262 tests were performed yesterday. 703 tests came back positive (0.96% of total).\n\nTotal hospitalizations fell to 908.\n\nSadly, there were 13 COVID fatalities yesterday.", "2020-06-27T12:48:16.000Z": "It's Saturday. Wear a Mask.", "2020-06-27T12:05:17.000Z": "What Milton Glaser gave to New York will long survive him. \n\nI New York was the perfect logo at the time he created it and remains so today.\n\nWe lost a brilliant designer and a great New Yorker. Milton Glaser, Master Designer of 'I NY' Logo, Is Dead at 91 He was also a founder of New York magazine, created a memorable Bob Dylan poster and produced designs for everything from supermarkets to restaurants to \"Mad Men.\" nytimes.com", "2020-06-26T20:59:04.000Z": "Today at Albany Airport we start the work to Build Back Better and supercharge our economic recovery. #NYSmart  #NYTough", "2020-06-26T19:32:57.000Z": "When New York needed it, our fellow states answered.\n\nWe'll never forget that generosity and we are going to pay it forward.\n\nWe are reaching out to Florida, Texas, Arizona and other states with high COVID infection rates to offer any assistance we can.", "2020-06-26T15:46:14.000Z": "Wake up America.\n\nWhat's happening across the country isn't a second wave.\n\nIt's still the first wave.", "2020-06-26T15:40:21.000Z": "Today's update on the numbers:\n\n61,723 tests were performed yesterday. 805 tests came back positive (1.3% of total).\n\nTotal hospitalizations fell to 951.\n\nSadly, there were 14 COVID fatalities yesterday.", "2020-06-26T13:01:27.000Z": "", "2020-06-25T17:03:16.000Z": "Hey guys, sorry to say it but it's not time to take our masks off. Quote Tweet Andrew Cuomo @NYGovCuomo Yesterday the US hit a record high for new COVID cases.\n\nWEAR A MASK.", "2020-06-25T15:07:15.000Z": "Today's update on the numbers:\n\n67,642 tests were performed yesterday. 749 tests came back positive (1.1% of total).\n\nTotal hospitalizations fell to 996.\n\nSadly, there were 17 COVID fatalities yesterday.", "2020-06-25T12:55:46.000Z": "BREAKING: Today NY reached a new milestone.\n\nTotal hospitalizations fell to 996 - dropping below 1K for the first time since March 18th.\n\nTogether we bent the curve. And we aren't stopping now.\n\nWear a mask. Keep 6 feet apart. Wash hands. Stay smart. #NewYorkTough", "2020-06-25T12:26:28.000Z": "Yesterday the US hit a record high for new COVID cases.\n\nWEAR A MASK.", "2020-06-24T16:56:58.000Z": "NY, NJ and CT will continually update and publish on their respective websites a list of states to which the new advisory applies.\n\nAs of today, the list of states includes: Alabama, Arkansas, Arizona, Florida, North Carolina, South Carolina, Texas, Utah & Washington. Quote Tweet Andrew Cuomo @NYGovCuomo I am announcing with @GovMurphy and @GovNedLamont a joint travel advisory. All individuals traveling from states with significant community spread of COVID into NY, NJ, or CT must quarantine for 14 days.\n\nThis travel advisory is effective midnight tonight.", "2020-06-24T16:36:30.000Z": "Throughout COVID, my daughters Michaela, Cara and Mariah were my rock. They helped me find the calm in this storm. I am so lucky to be their dad. Andrew Cuomo & His Daughters Look Back at 3 Months in the Center of COVID-19 Pandemic New York Gov. Andrew Cuomo's daughters, Cara, Mariah and Michaela, moved in with him in Albany during the novel coronavirus pandemic that ravaged the state people.com", "2020-06-24T15:48:12.000Z": "Today's update on the numbers:\n\n51,144 tests were performed yesterday. 581 tests came back positive (1.1% of total).\n\nTotal hospitalizations fell to 1,071.\n\nSadly, there were 17 COVID fatalities yesterday.", "2020-06-24T15:39:30.000Z": "I am announcing with @GovMurphy and @GovNedLamont a joint travel advisory. All individuals traveling from states with significant community spread of COVID into NY, NJ, or CT must quarantine for 14 days.\n\nThis travel advisory is effective midnight tonight.", "2020-06-24T15:32:36.000Z": "In New York City making an announcement. Watch Live: Andrew Cuomo @NYGovCuomo In New York City making an announcement. Watch Live: pscp.tv", "2020-06-24T13:44:48.000Z": "When @harpersbazaarus looked for Voices of Hope they found what we in NYS know well - @melissadderosa is one of the strongest. https:// harpersbazaar.com/culture/featur es/a32881371/bazaar-summer-issue-voices-of-hope/ ", "2020-06-24T12:28:45.000Z": "", "2020-06-23T23:06:51.000Z": "As the state continues to reopen, remember that for many workers, it never shut down.\n\nThank you to NY's grocery store workers, who helped carry us through this crisis with compassion and courage.", "2020-06-23T18:41:31.000Z": "New York State is one of only 3 states that are on track to contain #COVID .\n\nI can't stress enough how important it is that we don't blow this incredible progress now.\n\nWear a mask. Get tested. Be smart.\n\n(Study by @CovidActNow ) https:// covidactnow.org", "2020-06-23T14:53:39.000Z": "Today is Primary Election Day in New York.\n\nPolls are open everywhere until 9pm. Go vote!\n\nMasks are mandatory. Find your polling place here: https:// voterlookup.elections.ny.gov", "2020-06-23T14:32:32.000Z": "Today's update on the numbers:\n\n48,709 tests were performed yesterday. 597 tests came back positive (1% of total).\n\nTotal hospitalizations fell to 1,104.\n\nSadly, there were 27 COVID fatalities yesterday.", "2020-06-23T12:27:35.000Z": "Do your part. Show respect. Wear a mask.\n\nThis means you.", "2020-06-22T21:49:03.000Z": "More testing = more knowledge = better control of the virus. Get tested. #NewYorkTough  @chrisrock", "2020-06-22T17:20:19.000Z": "Transgender Americans face discrimination in ways that go far beyond the workplace.\n\nLast year, New York enacted #GENDA , which bans all forms of discrimination based on gender identity or expression. It's not only right - it's the law.\n\nKnow your rights: https:// on.ny.gov/2AOJsHT", "2020-06-22T13:48:50.000Z": "Today's update on the numbers:\n\n56,780 tests were performed yesterday. 552 tests came back positive (0.97% of total).\n\nTotal hospitalizations fell to 1,122.\n\nSadly, there were 10 COVID fatalities yesterday.", "2020-06-22T13:00:48.000Z": "Today New York City is in Phase 2 of reopening. \n\nTo continue our success at bending the curve everyone must be smart.", "2020-06-21T15:30:56.000Z": "Today's update on the numbers: \n\n67,526 tests were performed yesterday. 664 tests came back positive (0.98% of total).\n\nTotal hospitalizations fell to 1,142.\n\nSadly, there were 15 COVID fatalities yesterday.", "2020-06-21T12:47:59.000Z": "Thinking of Pop today. Happy #FathersDay to all of New York's dads.", "2020-06-21T12:20:54.000Z": "I will be on @CBSSunday at 9am ET. Tune in.", "2020-06-20T22:32:17.000Z": "The first NY-bred horse to win the Belmont since 1882!\n\nTiz the Law ran for us all and won. #NYTough Quote Tweet Andrew Cuomo @NYGovCuomo Congrats to NY's own Tiz the Law and @jockeyfranco on winning the Belmont Stakes! An incredible New York-bred colt.\n\nIt was a different Belmont this year but thanks to all for making this iconic racing event happen. twitter.com/BelmontStakes/", "2020-06-20T21:56:28.000Z": "Congrats to NY's own Tiz the Law and @jockeyfranco on winning the Belmont Stakes! An incredible New York-bred colt.\n\nIt was a different Belmont this year but thanks to all for making this iconic racing event happen. Quote Tweet Belmont Stakes @BelmontStakes THE NEW YORK HERO!!! TIZ THE LAW AND @jockeyfranco WIN THE $1,000,000 BELMONT STAKES! @nytbreeders Show this thread", "2020-06-20T19:29:24.000Z": "Today's update on the numbers. We will continue to update daily. \n\n68,830 tests were performed yesterday. 716 tests came back positive (1% of total).\n\nTotal hospitalizations fell to 1,220.\n\nSadly, there were 24 COVID fatalities yesterday.", "2020-06-20T19:26:30.000Z": "Over the course of this crisis our goal was to inform in real time on the facts as we knew them.\n\nGrateful that it helped so many and that over 1.7 million tuned in for my final briefing.\n\nMore to follow as needed. You can count on it. From Andrew Cuomo", "2020-06-20T16:45:47.000Z": "As we wait on a decision from the @MLB on the baseball season, I'm excited to announce that the @Yankees and the @Mets will resume their training here in New York for the first time in years.\n\nNY will review the teams' plans to make sure the trainings are safe.", "2020-06-20T12:46:49.000Z": "Daily briefings may be over - but these reminders aren't.", "2020-06-19T17:09:34.000Z": "This wasn't only about what government did. This was about what people did.\n\nTogether, New Yorkers bent the curve because we acted responsibly and we looked out for each other.\n\nNow we must stay the course. #NewYorkTough", "2020-06-19T12:57:28.000Z": "#OTD in 1865, enslaved African Americans were notified of their freedom by Union troops in Galveston Bay, TX-two years after the Emancipation Proclamation was issued.\n\nKnown as #Juneteenth , this day is widely celebrated as the end of chattel slavery in the U.S. #APeoplesJourney", "2020-06-19T12:39:52.000Z": "\"Emancipation wasn't a gift bestowed on the slaves; it was something they took for themselves, the culmination of their long struggle for freedom.\" Opinion | Why Juneteenth Matters It was black Americans who delivered on Lincoln's promise of \"a new birth of freedom.\" nytimes.com", "2020-06-19T16:28:19.000Z": "NYS tested a record 79,303 people for COVID yesterday.\n\nOnly 796 tests - 1.0% of total - came back positive.", "2020-06-19T15:30:18.000Z": "Happy #Juneteenth . After 111 days, I'm giving my final daily COVID briefing. Watch now: Andrew Cuomo @NYGovCuomo Happy #Juneteenth. After 111 days, I'm giving my final daily COVID briefing. Watch now: pscp.tv", "2020-06-19T15:10:47.000Z": "I will be delivering an address on COVID at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-19T12:37:25.000Z": "Today we celebrate #Juneteenth , the day when enslaved Black Americans in Texas finally learned they were emancipated.\n\nWe use this moment to reflect on the work still to be done to address the lasting consequences of systemic racism.", "2020-06-18T20:41:03.000Z": "I'm asking every governor to make Juneteenth a paid holiday for state employees. Thank you @GovernorVA and @NYGovCuomo for leading by example.", "2020-06-18T23:51:18.000Z": "Gov. Cuomo will be a guest on @CNN with @drsanjaygupta and @andersoncooper at approx. 8:25pm to discuss New York's response to covid 19 and where the state is 110 days later.", "2020-06-18T18:44:13.000Z": "Thanks to @kellycummingsny , Joe Rabito and the State Operations team and all of our agencies for leading the testing, response, and enforcement operations throughout the pandemic.", "2020-06-18T17:46:52.000Z": "New York's #Census response rate is at 56.7%, below the national average.\n\nCome on, New York. We can do better.\n\nRespond to the Census today: https:// my2020census.gov", "2020-06-18T17:24:02.000Z": "Every day we work to deliver the facts clearly & completely.\n\nThe social & content teams led by @MimiReisner worked around the clock to do so and keep New Yorkers informed.\n\nI thank @cacurtis , @maxorenstein , @snapchatandrew & team for their creativity and their clarity.", "2020-06-18T16:41:15.000Z": "This effort depended on the hard work of so many behind the scenes -  I couldn't do it without them: Jill DesRosiers, @dana_carotenuto , Beth Garvey - thank you & your teams for your professionalism and dedication.", "2020-06-18T16:27:13.000Z": "Shoutout to my press team. They have worked around the clock, nonstop for 100+ days, including 14 days working in quarantine. And to every person who helped in every way - you made a difference in crushing the curve.", "2020-06-18T16:26:16.000Z": "It takes a team and I'm lucky to have the best. Thank you @jimmalatras , @GarethRhodes , @LindaLacewell  @Benton_Steph , Rob Mujica and Dr. Howard Zucker for your work on the Coronavirus response.", "2020-06-18T16:08:46.000Z": ". @melissadderosa has been a rock during this crisis and has worked night and day to help get our state through this. Quote Tweet Chelsea Handler @chelseahandler Replying to @melissadderosa Great job, sister. You really set a great example for women everywhere about not taking any shit. Keep it up! X", "2020-06-18T15:58:51.000Z": "Businesses that violate health guidelines can face the immediate loss of their liquor license or a shut down order.\n\nI'm also issuing an Executive Order holding bars responsible for the sidewalk/area in front of their establishments.", "2020-06-18T15:48:30.000Z": "More good news.\n\nNYS performed 68,541 tests yesterday.\n\nOnly 618 came back positive.\n\n\nThat's just 0.90%. The lowest percent positive since we started.", "2020-06-18T15:35:14.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-18T14:37:52.000Z": "I will be giving my second to last daily briefing at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-18T14:23:26.000Z": "The Trump Administration failed to give an adequate reason for ending #DACA because there isn't one.\n\nA victory for Dreamers is a victory for all of us who care about fairness and equality under the law. Quote Tweet SCOTUSblog @SCOTUSblog #SCOTUS rules against Trump administration in challenge to decision to end #DACA program, which allowed noncitizens brought to this country illegally as children to apply for protection from deportation, holding decision was arbitrary and capricious", "2020-06-17T17:36:52.000Z": "|￣￣￣￣￣￣|\n|   RESPOND  |\n|        TO         |\n|       THE        |\n|    CENSUS    |\n| ＿＿＿＿＿|\n(\\/) ||\n(ㅅ) ||\n/ 　 づ", "2020-06-17T20:28:36.000Z": "It's not goodbye - we just won't be seeing each other every day anymore.\n\nAfter 100+ straight days, Friday will be my final daily press conference. Going forward I'll provide briefings as needed. You can be sure I'll continue to give you the facts as I have them. #NewYorkTough", "2020-06-17T16:13:46.000Z": "Really good news on testing.\n\nNY tested 59,341 people for COVID yesterday.\n\nOnly 567 tests came back positive - 0.96% of total.\n\nThat is a record low.", "2020-06-17T15:56:09.000Z": "New York City is on track to enter Phase 2 of reopening on Monday.\n\nIt's up to all of us to ensure a successful reopening. Be smart & be responsible.\n\nInfo on what businesses are part of Phase 2 here: New York City Phase Two Industries forward.ny.gov", "2020-06-17T15:49:09.000Z": "Yesterday there were 17 fatalities due to COVID. We mourn those we lost.\n\nBut we are thankful this is the lowest number since the pandemic began.", "2020-06-17T15:40:57.000Z": "Today I will sign an Executive Order recognizing #Juneteenth as a holiday for state employees.\n\nI will advance legislation to make it an official state holiday next year.", "2020-06-17T15:33:46.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-17T14:49:12.000Z": "", "2020-06-17T14:41:00.000Z": "I will be giving my daily briefing at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-17T12:07:07.000Z": "There is testing capacity available at many locations in New York State.\n\nWe're encouraging anyone who has attended a protest to get tested. It's the responsible thing to do.\n\nFind a site here: Find a Test Site Near You coronavirus.health.ny.gov", "2020-06-16T20:44:00.000Z": "I am disgusted by the recent discovery of a noose - the epitome of hatred and an evil icon of our nation's racist past - in Harlem's Marcus Garvey Park.\n\nI am directing the State Police Hate Crimes Task Force to investigate this immoral and illegal act. Noose Found in Harlem's Marcus Garvey Park Sparks NYPD Hate Crimes Probe The symbol of hate was discovered over the weekend dangling from a tree near the landmark old Mount Morris fire tower in the heart of the Manhattan neighborhood. thecity.nyc", "2020-06-16T18:45:22.000Z": "I just signed legislation requiring New York State Police officers to wear body cameras while on patrol & creating the Law Enforcement Misconduct Investigative Office.\n\nThese new laws will help promote accountability & improve transparency in policing.\n\nIt all starts with trust.", "2020-06-16T16:00:49.000Z": "New York State surveyed 12,000 people over 6 weeks to test for COVID-19 antibodies.\n\nWeighted results show that 13.4% of the state was positive for the antibody.\n\n21.6% of NYC residents were positive for the antibody.", "2020-06-16T15:49:43.000Z": "The @usopen will be held in Queens, NY, without fans from August 31 to September 13.\n\nThe USTA will take extraordinary precautions to protect players and staff, including robust testing, additional cleaning, extra locker room space, and dedicated housing & transportation.", "2020-06-16T15:47:41.000Z": "Total COVID hospitalizations fell to 1,538 yesterday - the lowest since March 20.\n\nThe 3-day rolling average in daily COVID fatalities is at 24, a new record low.", "2020-06-16T15:44:18.000Z": "The testing numbers tell a good story. The next steps are up to us New York.", "2020-06-16T15:35:20.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-16T14:27:08.000Z": "I will be giving my daily briefing at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-16T01:54:25.000Z": "Happy birthday, pop.", "2020-06-15T22:45:04.000Z": "Today was a historic day for #LGBTQ rights. We will keep fighting. #Pride GIF", "2020-06-15T21:44:38.000Z": "New York thanks @Sony for a generous donation to the COVID-19 First Responders Fund.\n\nLearn more about the fund & get involved here: https:// healthresearch.org/donation-form/ Quote Tweet Sony @Sony We're proud to support Governor Cuomo's work to ensure those on the front lines of the #COVID19 pandemic have the essential resources they need.", "2020-06-15T16:55:42.000Z": "Today my father would have turned 88. I know that he would be proud of NYers today. \n\nMany nights during this crisis, I asked myself, what my father would tell me?\n\nI knew what he'd say: Take responsibility.\n\nAnd he'd quote Churchill: Never give up never give up never give up.", "2020-06-15T15:46:58.000Z": "In New York we have long known that regardless of who you are or who you love - discrimination is immoral, illegal, and incompatible with the idea of America.", "2020-06-15T15:44:40.000Z": "Across the nation we are seeing the virus increasing.\n\nNew York is one of the exceptions. COVID cases are going down even after we began reopening.\n\nWe must stay the course.\n\nIt's up to us, New York.", "2020-06-15T15:38:47.000Z": "Today I will sign additional police reforms:\n\n-Police must report a weapon discharge within 6 hrs\n-Police depts & courts must track arrest data, including race/ethnicity\n-Police must provide for the medical & mental health needs of those under arrest or in custody who require it", "2020-06-15T15:31:10.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-15T14:47:11.000Z": "I will be giving my daily briefing at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-15T14:26:25.000Z": "This #SCOTUS decision is a major victory for #LGBTQ rights.\n\nNo one should be discriminated against based on their sexual orientation or gender identity.\n\nNYS will keep fighting until every LGBTQ+ person can be themselves without fear. Quote Tweet SCOTUSblog @SCOTUSblog #SCOTUS rules that federal employment discrimination laws protect LGBT employees", "2020-06-15T00:09:38.000Z": "It's Up To Us, New York.", "2020-06-14T17:04:31.000Z": "NEW: We are extending open enrollment in the health exchange an additional 30 days - through July 15.\n\nGet covered at http:// nystateofhealth.ny.gov . Quote Tweet Andrew Cuomo @NYGovCuomo There is still time for New Yorkers to enroll in a health plan on @NYStateofHealth .\n\nSpecial Enrollment ends Monday, June 15th.\n\nNew Yorkers who lost their health insurance this year can apply today and get covered: http:// nystateofhealth.ny.gov", "2020-06-14T16:48:27.000Z": "The violation complaints are predominantly from Manhattan & the Hamptons. Lots of violations of social distancing, parties in the street, restaurants and bars ignoring laws.\n\nEnforce the law or there will be state action.", "2020-06-14T16:35:00.000Z": "I signed into law two more bills today.\n\nThe first bill affirms the right to record police activity.\n\nThe second launches a Dept of Health study on health impacts of COVID-19 on minorities in NYS.", "2020-06-14T16:27:27.000Z": "We have received 25,000 complaints of reopening violations.\n\nBars or restaurants that violate the law can lose their liquor license.\n\nPeople with open containers in the street can be fined.\n\nPolice & protesters not wearing masks can be fined.\n\nLocal gov't must enforce the law.", "2020-06-14T16:14:14.000Z": "Since reopening, almost half the states have seen an increase in COVID cases.\n\nThat hasn't happened in New York.\n\nLet's keep it that way.\n\nThe pandemic isn't over and we MUST keep being vigilant.", "2020-06-14T16:07:51.000Z": "We lost 23 New Yorkers to COVID yesterday - a new record low.\n\nTotal COVID hospitalizations fell to 1,657, the lowest since March 20.\n\nThe data show we're continuing to make great progress.", "2020-06-14T16:01:54.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-14T14:36:55.000Z": "I will be giving my daily briefing at 12:00PM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-14T13:13:25.000Z": "\"You don't make progress by standing on the sidelines... You make progress by implementing ideas.\" \n-Shirley Chisholm", "2020-06-14T00:14:17.000Z": "Wear a mask. Show respect. Stop the spread. #NewYorkTough", "2020-06-13T22:30:26.000Z": "There is still time for New Yorkers to enroll in a health plan on @NYStateofHealth .\n\nSpecial Enrollment ends Monday, June 15th.\n\nNew Yorkers who lost their health insurance this year can apply today and get covered: NY State of Health, The Official Health Plan Marketplace Enroll Today! Shop for quality, affordable health insurance options at NY State of Health. nystateofhealth.ny.gov", "2020-06-13T17:53:33.000Z": "It's up to us. #WearAMask", "2020-06-13T16:00:07.000Z": "Don't make me come down there... Quote Tweet evgrieve @evgrieve Friday night (6/12), St. Mark's Place", "2020-06-13T15:51:58.000Z": "Yesterday we lost 32 New Yorkers to Coronavirus.\n\nThis is the lowest number of COVID-related fatalities since this pandemic started.\n\nWe also saw the lowest number of total hospitalizations since March 20th.", "2020-06-13T15:45:09.000Z": "Today the hard work of change begins.\n\nI signed an Executive Order saying that police agencies MUST sit down w/ community & adopt reform plans by April 1 to be eligible for state funds.\n\nIt's time to put pen to paper & enact systemic reform.\n\nNo reform - No funding.", "2020-06-13T15:34:54.000Z": "Giving my daily press briefing now. Watch Live:- Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live:- pscp.tv", "2020-06-13T14:44:25.000Z": "I will be giving my daily briefing at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-13T13:54:47.000Z": "This is a moment that calls for action, not words. \n\nThis is about the murder of George Floyd.  But it's also about decades and centuries of injustice.\n\nWe're not done yet - there is more to do & NY will lead the way.", "2020-06-13T13:22:37.000Z": "Today is Saturday. Wear a mask.", "2020-06-13T12:49:25.000Z": "We have seen an alarming spike in domestic violence reports during the COVID crisis.\n\nThe COVID-19 DV task force chaired by @melissadderosa has issued recommendations that NY will adopt.\n\nWe will make services more survivor centered and individualized. Behind the New York Domestic Violence Task Force Launched in Response to COVID-19 To address the significant increases in domestic violence cases during its stay-at-home order, New York state has launched a special COVID-19 task force to support victims and survivors. vogue.com", "2020-06-12T21:26:19.000Z": "At a time when there is so much violence against trans people, it is abhorrent that the Trump admin is stripping away critical health protections.\n\nReminder: Under NYS law, discrimination based on gender identity or gender expression is ILLEGAL. \n\nNY will keep fighting. Quote Tweet NPR @NPR BREAKING: The Trump administration just finalized a rule that would remove nondiscrimination protections for LGBTQ people in health care and health insurance. Show this thread", "2020-06-12T21:14:26.000Z": "Today New York enacted landmark reform that will raise the bar on policing and make our state more just.\n\nThe countless voices speaking out and demanding justice were heard. This is just the beginning.", "2020-06-12T18:14:34.000Z": "Today, @nygovcuomo signed into law nation-leading #legislation that repeals 50-A, bans chokeholds, prohibits false race-based 911 calls, makes the Attorney General the #independentprosecutor in killings of unarmed civilians by #police , & more. It has been a long road to this day", "2020-06-12T19:03:39.000Z": "Honored @TheRevAl could be with us on this historic day.\n\nWe signed into law landmark police reform and created a new system by Executive Order requiring local police to reform & modernize with input from the communities they serve.\n\nAnd we made it clear: No reform - No funding.", "2020-06-12T17:00:41.000Z": "Today NY took a major step toward justice by enacting landmark police reform.\n\nTo the activists and advocates who spoke out year after year,\n\nTo all who marched and demanded justice in the last weeks,\n\nThank you.\n\nYour voices brought real change.", "2020-06-12T16:42:30.000Z": "I just signed into law nation-leading legislation that:\n\n-Ends 50-A\n-Bans chokeholds\n-Prohibits false race-based 911 calls\n-Makes Attorney General the independent prosecutor in killings of unarmed civilians by police\n\nThere is more to do & NY will lead the way.", "2020-06-12T16:29:58.000Z": "I will issue an Executive Order that mandates that local police depts develop reform plans with community input in order to be eligible for state funding.\n\nThey must adopt plans by April 1 or they won't get state funding.\n\nWe must restore trust.", "2020-06-12T15:57:58.000Z": "#BREAKING : I am signing into law nation-leading criminal justice & police reform bills - including legislation that ends 50-A & bans chokeholds.\n\nThank you to @AndreaSCousins , @CarlHeastie & the Legislature for your partnership and fast action.\n\nThis is a historic moment for NY.", "2020-06-12T15:32:47.000Z": "In New York City giving my daily press briefing and making an announcement. Watch Live: Andrew Cuomo @NYGovCuomo In New York City giving my daily press briefing and making an announcement. Watch Live: pscp.tv", "2020-06-12T14:43:18.000Z": "I will be giving my daily briefing and making an announcement at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-12T12:40:04.000Z": "Four years ago today, 49 innocent people were murdered at the #Pulse nightclub in Orlando.\n\nToday and every day New York will honor their memory by taking action against hate in all its forms.", "2020-06-11T22:13:13.000Z": "COVID is still out there.\n\nIt's increasing in states across the nation. In New York it's on the decline - but that can change overnight.\n\nThe success of NY's reopening is up to all of us.", "2020-06-11T18:43:13.000Z": "The needs of survivors of Domestic Violence are not one size fits all. \n\nNYS will lead the way in developing an innovative survivor-focused system.\n\nWe need to empower survivors to have maximum control of their future.", "2020-06-11T16:34:53.000Z": "Each locality will determine when public pools and playgrounds will open in their region.\n\nThey must use health data & metrics as a guide to inform each decision.", "2020-06-11T15:51:10.000Z": "States across the country are seeing spikes again.\n\nNY is one of the exceptions.\n\nWhy are we not seeing the same spikes? Because New Yorkers are informed, diligent & we're protecting each other.\n\nLet's keep it up.", "2020-06-11T15:47:57.000Z": "", "2020-06-11T15:41:54.000Z": "We are looking closely at daily COVID testing by region to tell us what we need to know as we reopen. \n\nYesterday's results show that the positive rate remains low.", "2020-06-11T15:32:36.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-11T14:10:08.000Z": "I will be giving my daily briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-11T13:42:02.000Z": "When you get a call from NYS Contact Tracing - Answer your phone!\n\nOur Contact Tracing force is working every day to help stop the spread.", "2020-06-10T20:48:31.000Z": "Ribbon Cutting: 2020. @LGAairport", "2020-06-10T15:56:34.000Z": "Our goal is to take this moment and to Build Back Better.\n\nWe are accelerating infrastructure improvement and construction projects.\n\nWe've gone through hell, but we have the opportunity to come back stronger. We won't squander it.", "2020-06-10T15:49:53.000Z": "Every day NYS tests over 50,000 people for COVID. This provides a daily snapshot of the situation.\n\nThe positive rate of those tested remains very low in NYC.", "2020-06-10T15:43:22.000Z": "I stand with the protestors.\n\nThis week we turn that solidarity into action.\n\nThis week I will sign legislation that leads the nation in police reform.", "2020-06-10T15:35:00.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-10T14:39:16.000Z": "I will be giving my daily briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-10T14:05:40.000Z": "Wear a mask. Stop the spread. Do the right thing. @rosieperezbklyn", "2020-06-10T01:54:20.000Z": "The Legislature just voted to repeal 50-A and I will sign it into law this week.\n\nThe countless voices for reform united and were heard.\n\nNOW is the moment for real change.", "2020-06-09T18:19:40.000Z": "Don't dismiss this as an issue of the moment. What we're seeing is a response to decades and centuries of systemic injustice and racism in this country.", "2020-06-09T16:01:00.000Z": "Gov. Cuomo (D-NY) gets fired up over Trump's Buffalo tweet: \"How reckless, how irresponsible, how mean, how crude. If there was ever a reprehensible, dumb comment ... and from the president of the United States.\"", "2020-06-09T16:01:57.000Z": "NYS is opening 11 new testing sites in hotspots in New York City in partnership with @CoreResponse .\n\nThank you @SeanPenn and CORE for working with us to help bring testing to the communities that need it most.\n\nThere are now over 800 testing sites in NYC. Get tested!", "2020-06-09T15:52:09.000Z": "The president is tweeting conspiracy theories about the Buffalo incident based on no evidence, no proof.\n\nWas the blood coming out of his head staged? Were our eyes lying to us? No.\n\nThe man is still in the hospital & the president is disparaging him.\n\nIt's cruel & reckless.", "2020-06-09T15:41:29.000Z": "This is not just a moment to express outrage - it's a moment to do something about it and create real reform & real change.\n\nIn partnership with @AndreaSCousins and @CarlHeastie we will pass major criminal justice reforms this week.\n\nNY will not let this moment pass unanswered.", "2020-06-09T15:31:36.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-09T14:17:31.000Z": "I will be giving my daily briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-09T13:42:15.000Z": "Each of us can stop the spread the spread of Coronavirus.\n\nIt's up to us, New York.", "2020-06-09T01:02:10.000Z": "New Yorkers rose to the occasion and together we bent the curve. I'm so proud to be a New Yorker.", "2020-06-08T23:33:32.000Z": "We are working to repeal it this week. Thanks for lending your voice @MariahCarey (my 2nd favorite Mariah). Quote Tweet Mariah Carey @MariahCarey Please help #Repeal50A , a New York law that shields police wrongdoing by hiding records of misconduct, complaints, and abuse. Help end the violence by taking action now: http:// linktr.ee/50A  @NYGovCuomo  @AndreaSCousins  @CarlHeastie", "2020-06-08T20:28:55.000Z": "Enough is enough. We need reform and NY will get it done.", "2020-06-08T19:55:36.000Z": "Thank you @jonasbrothers for lending your voice in support of repealing 50-A. NY will lead the way. Quote Tweet Jonas Brothers @jonasbrothers 50-a protects criminal cops from being exposed in New York. This has to end. \n\nTake action now to end the violence and hold bad cops accountable: https:// linktr.ee/50A  #Repeal50A  @NYGovCuomo  @AndreaSCousins  @CarlHeastie", "2020-06-08T18:50:55.000Z": "Thank you @ArianaGrande for your support in repealing 50-A. NY will lead the way. Quote Tweet Ariana Grande @ArianaGrande new yorkers ! please support the repeal of 50 A, a new york law that blocks crucial information in the search for law enforcement accountability: https:// linktr.ee/50A   #repeal50a  @nygovcuomo  @andreascousins  @carlheastie", "2020-06-08T17:10:31.000Z": "NYC enters Phase 1 today. Learn more about what the phased reopening means for New York City here: Reopening New York City New York City is now in Phase Four of reopening. forward.ny.gov", "2020-06-08T16:46:13.000Z": "This week NY will lead the way on real and necessary reform:", "2020-06-08T16:33:25.000Z": "If it wasn't safe, I wouldn't ask anyone to go on the subway.\n\nRemember: If you're riding, you MUST wear a mask. It's mandatory & shows respect for fellow riders.", "2020-06-08T16:20:41.000Z": "If you're riding the @MTA do it safely:\n\n1. MASKS ARE MANDATORY. No exceptions.\n2. Socially distance as much as possible.\n3. Use hand sanitizer.\n4. Observe decal guidance.", "2020-06-08T16:17:22.000Z": "The MTA is cleaning & disinfecting daily. We are deploying over 1 million masks, 35,000 gallons & 500,000 2-oz bottles of sanitizer to the MTA.\n\nSince May, the MTA has performed:\n\n-30,000 station cleanings & disinfections\n-500,000 subway car cleanings & disinfections", "2020-06-08T16:06:33.000Z": "As NYC begins to reopen we're keeping a special eye on testing.\n\n-Capacity going up to 35K tests a day \n-Targeting testing to most impacted zip codes \n-All protesters can get tested\n\nThere are over 240 testing sites in NYC. \n\nFind one near you: Find a Test Site Near You coronavirus.health.ny.gov", "2020-06-08T16:01:36.000Z": "I applaud the State Legislature for convening this week to act on nation-leading reforms.\n\nAs soon as they are passed I will sign them. \n\nThank you @CarlHeastie and @AndreaSCousins for your leadership and partnership.", "2020-06-08T15:57:59.000Z": "True justice requires reform at the federal level.\n\nNow is the time for nationwide reform:\n\nIn education.\nIn housing.\nIn health care.", "2020-06-08T15:40:24.000Z": "It's Day 100 since we had our first confirmed COVID case in NYS.\n\nNo one knew how fast we would be able to control the virus. It all depended on what we all did.\n\nI'm so proud of how New Yorkers responded.\n\nWhen things are tough, New Yorkers are tougher.", "2020-06-08T15:31:49.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-08T11:52:31.000Z": "We are #NewYorkTough .", "2020-06-08T13:21:54.000Z": "I will be giving my daily briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-08T01:50:57.000Z": "Tomorrow is a new day. NYC reopens. #NewYorkTough", "2020-06-07T20:38:21.000Z": "\"What the people want is very simple - they want an America as good as its promise.\"\n-Rep. Barbara Jordan", "2020-06-07T16:32:46.000Z": "New York State will lead the way on real reform.", "2020-06-07T16:23:25.000Z": "If you attended a protest, assume you may have been exposed to COVID. Get tested.\n\nThere are 15 new testing sites in NYC for people who attended protests.\n\nFind a testing site here: Novel Coronavirus (COVID-19) Individuals traveling to NY from states with significant community spread of COVID-19 will be required to quarantine for 14 days. coronavirus.health.ny.gov", "2020-06-07T16:16:40.000Z": "NYC enters Phase 1 of reopening tomorrow.\n\nNew Yorkers bent the curve by being smart.\n\nLet's keep being smart. #NYTough", "2020-06-07T16:12:42.000Z": "Yesterday New York did 60,435 COVID tests.\n\nOnly 781 of the tests were positive - about 1%.\n\nThat's very good news.", "2020-06-07T16:05:44.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-07T13:51:04.000Z": "I will be giving my daily briefing at 12:00PM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-06T21:23:57.000Z": "If a police officer is saying, unless I get to knock people to the ground and hit them with a baton for no reason, I don't want to be a police officer - then don't be a police officer.", "2020-06-06T20:12:00.000Z": "76 years ago today, 160,000 Allied troops stormed the beaches of Normandy, turning the tide of WWII and changing the course of history.\n\nWe honor & remember the courageous service members who risked everything that day. We owe them a debt that can never be repaid. #DDay", "2020-06-06T19:43:25.000Z": "Price gouging on life-saving supplies including masks and PPE is abhorrent.\n\nWe won't allow it in NY so I'm signing legislation to ensure all NYers have access to critical supplies including masks at fair cost.\n\nThank you @NewYorkStateAG  @bradhoylman  @nily .", "2020-06-06T19:04:09.000Z": "We did the impossible.\n\nOn Monday NYC will open phase one.\n\nWe didn't just flatten the curve - we crushed it. #NYTough", "2020-06-06T16:43:42.000Z": "George Floyd must not have died in vain. Mr. Floyd's killing must be a moment in which this nation actually learned and grew and progressed to make this place a better place.", "2020-06-06T16:00:16.000Z": "Police have to do their jobs but they don't have the right to abuse, to hurt, to use unnecessary force.\n\nThose that do are going to be held accountable.\n\nNo tolerance for delayed justice.", "2020-06-06T15:50:51.000Z": "Now is the time to seize the moment.\n\nThe Legislature comes back next week. Together we will pass meaningful reform.\n\nNo chokeholds.\nTransparency of prior disciplinary records.\nAG as independent prosecutor in police killings.\nMake false race-based 9-1-1 calls a hate crime.", "2020-06-06T15:40:20.000Z": "The metrics and health data across the state are very positive.\n\nTaking that into account, churches, mosques and temples can reopen with 25% occupancy and with social distancing as part of Phase 2.\n\nThis starts immediately for regions currently in Phase 2.", "2020-06-06T15:35:03.000Z": "35 New Yorkers died of #Coronavirus yesterday. This is a record low since this crisis began.", "2020-06-06T15:31:29.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-06T15:29:20.000Z": "The police must not abuse people and cannot abuse their office or their badge.\n\nNY will lead the way by enacting the #SayTheirName Reform Agenda so that we use this moment for positive change.", "2020-06-06T14:23:54.000Z": "I will be giving my daily briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-06T13:03:13.000Z": "Reminder:", "2020-06-05T23:24:22.000Z": "When I saw the video from Buffalo, it made me sick to my stomach. Where was the threat? How can you walk by a person when there's blood coming out of his head? It's fundamentally inhumane & frightening.\n\nThis is a moment for change. NY will lead the way. From Reuters", "2020-06-05T22:21:20.000Z": "Wear a mask. Do the right thing.", "2020-06-05T21:54:39.000Z": "NEW: I just issued an Executive Order allowing necessary in-person special education instruction this summer. Any school district providing these services must follow all state and federal guidance.", "2020-06-05T21:20:31.000Z": "What happened in Buffalo offends our sense of decency & humanity. It's frightening.\n\nLet's focus on the facts. What we saw on that video is abuse and we must put a stop to this kind of abuse. Enough is enough.\n\nIn this moment change is possible. New York will be at the forefront.", "2020-06-05T18:15:16.000Z": "Mr. Floyd's murder was a breaking point - but the outrage is decades old.\n\nSociety must change. And I believe it's possible.\n\nWe just did it during the COVID crisis.\n\nSo many reform movements began in our state. Once again NY must be at the forefront of change.", "2020-06-05T16:40:39.000Z": "NY should lead the way and pass the \"Say Their Name\" Reform Agenda:\n\n1. Make police disciplinary records transparent\n2. Ban chokeholds\n3. Make false race-based 911 reports a hate crime\n4. Attorney General must act as independent prosecutor for any police murder case", "2020-06-05T15:55:32.000Z": "It is in all of our interest to stop police abuse.\n\nStopping police abuse vindicates the overwhelming majority of good police.\n\nIt restores trust. It restores safety.\n\nFor the sake of our communities, we must do this.", "2020-06-05T15:38:00.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-05T14:36:09.000Z": "I will be giving my daily briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-05T03:01:27.000Z": "This incident is wholly unjustified and utterly disgraceful.\n\nI've spoken with Buffalo @MayorByronBrown and we agree that the officers involved should be immediately suspended pending a formal investigation.\n\nPolice Officers must enforce - NOT ABUSE - the law. https:// twitter.com/WBFO/status/12 68712530358292484  This Tweet is unavailable.", "2020-06-04T21:41:48.000Z": "We need unity.\n\nInstead the president seeks to divide.\n\nHe's done it from day one and he's doing it now.\n\nIt's his instinct. Divide racially. Divide politically. Divide geographically. He puts in a wedge into every crack to divide & shatter.\n\nThe nation is begging for it to stop.", "2020-06-04T20:45:10.000Z": "First, the president started the fire. He keeps adding fuel.\n\nNow, he wants credit for attempting to put it out.\n\nMeanwhile the house is burning.", "2020-06-04T20:23:47.000Z": "Peaceful protest is a sacred American right. \n\nNo peaceful protestor deserves to be hit with a baton and no self-respecting police officer would defend that.\n\nI've asked @NewYorkStateAG to investigate last night's incidents as part of her ongoing investigation.", "2020-06-04T18:00:02.000Z": "Statewide moment of silence for #GeorgeFloyd happening now. Quote Tweet Andrew Cuomo @NYGovCuomo A statewide moment of silence for George Floyd will be held today at 2:00 PM ET.\n\nThis will coincide with the start of the Memorial Service in Minnesota.\n\nPlease join us in silence at 2:00 PM in his memory.", "2020-06-04T17:30:46.000Z": "Police abuse cases shouldn't be handled by the local prosecutors who work with the very same police day in and day out.\n\nIt's just common sense.\n\nThat's the law of this state by Executive Order and it should be across the country.", "2020-06-04T17:30:07.000Z": "For businesses that were impacted by looting, DFS is directing insurers to expedite claims, provide free mediation of disputes, and accept photos as reasonable proof of loss so businesses don't have to wait for police reports. More info at http:// dfs.ny.gov .", "2020-06-04T16:20:00.000Z": "Coronavirus tests are available to all protesters. We ask protesters to be responsible.\n\nWear a mask. Get tested.\n\nAct as if you may have been exposed.", "2020-06-04T16:03:53.000Z": "A statewide moment of silence for George Floyd will be held today at 2:00 PM ET.\n\nThis will coincide with the start of the Memorial Service in Minnesota.\n\nPlease join us in silence at 2:00 PM in his memory.", "2020-06-04T15:41:23.000Z": "This is a moment for national change. For reform.  \n\nChange comes when it's demanded by the people.\n\nI stand with the peaceful protesters for effective, meaningful reform.", "2020-06-04T15:32:29.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-04T14:48:22.000Z": "I will be giving my daily briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-04T02:47:18.000Z": "A free press is the lifeblood of democracy. Now more than ever, it is critical that reporters & photographers can safely document protests without fear of harm or  targeting.\n\nThey are essential - and they must be able to do their jobs. We all depend on them.", "2020-06-03T22:16:12.000Z": "At at time when people are hungry, no food should go to waste.\n\nHere's how NY is connecting farms to food banks and feeding those in need instead of wasting food:", "2020-06-03T20:51:34.000Z": "Together we flattened the curve. We changed the course of this virus and we did it by standing together. #NYTough", "2020-06-03T18:53:41.000Z": "Starting tomorrow, outdoor dining will be permitted in regions that are in Phase 2 of reopening (Capital Region, Central NY, Finger Lakes, Mohawk Valley, North Country & Southern Tier).\n\nStaff must wear masks & patrons must cover face when not seated. Tables 6' apart.", "2020-06-03T16:04:03.000Z": "There are those who are trying to lump together the peaceful protesters & the looters. Attempting to blur the two.\n\nBut we know these are two separate groups entirely. With two separate agendas.\n\nWe see through this cynical attempt to discredit a legitimate protest.", "2020-06-03T15:51:17.000Z": "If you are protesting peacefully, remember the COVID virus is still out there. Wear a mask. Be smart.", "2020-06-03T15:47:11.000Z": "\"The option to use active duty forces in a law enforcement role should only be used as a matter of last resort, and only in the most urgent & dire situations. We are not in one of those situations now. I do not support invoking the Insurrection Act.\"\n-Defense Secretary Esper", "2020-06-03T15:46:11.000Z": "The military cannot be used as a political weapon.", "2020-06-03T15:36:06.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-03T14:57:51.000Z": "I will be giving my daily briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-02T16:09:37.000Z": "The vast majority of protesters are peaceful.\n\nThey are separate & distinct from the criminals who are opportunistically using this situation for their own purposes.\n\nCriminal activity & looting MUST stop. Not only is it illegal-it distracts from the point of the protests.", "2020-06-02T16:02:54.000Z": "There are those who want to intentionally blur the lines between peaceful, legitimate protesters and looters.\n\nThe president is among them.\n\nThey want you to watch the videos of the looting - not the video of Mr. Floyd being murdered.\n\nDon't fall for it.", "2020-06-02T15:31:53.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-02T15:02:14.000Z": "I will be giving my daily briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-02T02:32:32.000Z": "There are justified peaceful protests across the state tonight.\n\nBut there are also people criminally exploiting this pain and this moment.\n\nWe will not tolerate it.", "2020-06-01T23:43:44.000Z": "The president is calling out the American military against American citizens.\n\nHe used the military to push out a peaceful protest so he could have a photo op at a church.\n\nIt's all just a reality TV show for this president.\n\nShameful.", "2020-06-01T23:18:06.000Z": "I will call into @ErinBurnett  @CNN at 7:30pm. Tune in.", "2020-06-01T21:32:09.000Z": "NOTICIA IMPORTANTE:\n\nHabrá un toque de queda para toda la ciudad de Nueva York a partir de las 11:00 PM (1 de junio) hasta las 5:00 AM.\n\nResidentes de NYC: ¡deben quedarse en casa después de las 11:00 PM!", "2020-06-01T20:09:30.000Z": "IMPORTANT NEWS: \n\nThere will be a citywide curfew in NYC starting at 11pm TONIGHT (6/1), lasting until 5am.\n\nNYC residents - you must stay home after 11 PM!", "2020-06-01T20:08:13.000Z": "Calling into @MSNBC now to discuss the NYC protests. Tune in.", "2020-06-01T16:48:41.000Z": "We saw peaceful protests in pursuit of positive, long overdue change.\n\nWe saw police officers take a knee.\n\nWe saw protesters trying to *stop* looting & violence.\n\nShow that on TV too.", "2020-06-01T16:12:24.000Z": "We are seeing a hijacking of a legitimate protest movement. There are people who are using the protests as a cover to steal and to sow the seeds of anarchy.\n\nThey are exploiting this moment for their own purposes. We see through that.", "2020-06-01T16:06:56.000Z": "Looting and criminality is not protesting.\n\nIt depreciates the righteousness of the protest.\n\nIt plays right into the hands of those who refuse to make positive change.\n\nIt allows them to dismiss the entirety of the argument.", "2020-06-01T15:59:43.000Z": "It's time for equal education.\n\nIt's time for an anti-poverty agenda.\n\nIt's time for a national affordable housing plan.\n\nMy father spoke of a Tale of Two Cities in the 1980s and it is just as true now as it was then.\n\nFocus the outrage into specific policy goals.", "2020-06-01T15:55:48.000Z": "We must demand specific change.\n\nIt's time for a national ban on excessive force & chokeholds.\n\nIt's time for independent investigations of police abuse.\n\nIt's time for transparency in disciplinary records for police officers being investigated.", "2020-06-01T15:49:50.000Z": "I share the outrage of the injustice and I stand with the protesters.\n\nIt's not just George Floyd. There are 50 or more cases just like it.\n\nIt is rooted in hundreds of years of racism and injustice.\n\nLet's use this energy constructively and demand real, positive change.", "2020-06-01T15:35:35.000Z": "Giving my daily press briefing now. Watch Live: Andrew Cuomo @NYGovCuomo Giving my daily press briefing now. Watch Live: pscp.tv", "2020-06-01T14:30:44.000Z": "I will be giving my daily briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-06-01T13:35:19.000Z": "Today marks the start of #PrideMonth .\n\nNY is the birthplace of #LGBTQ rights, a movement that showed the world that love always overpowers prejudice and hate.\n\nThere is still work to do to end violence & discrimination, esp. against trans people of color. We will keep fighting.", "2020-06-01T02:18:10.000Z": "A police officer kneels with demonstrators at Barclays Center in Brooklyn. The following media includes potentially sensitive content. Change settings View", "2020-06-01T01:42:04.000Z": "The justice system must be fair both in theory and practice. @GovTimWalz 's decision to have Minnesota's Attorney General take the lead in this case is the right one to ensure independence, public trust and justice. Walz: Minnesota attorney general to take lead in Floyd case Minnesota Gov. Tim Walz said Sunday that the state's attorney general - and not the county prosecutor - will take the lead in any prosecutions related to the death of George Floyd, a black man who... startribune.com", "2020-06-01T00:10:55.000Z": "This is how change begins. Quote Tweet NBC New York @NBCNewYork Earlier today in Queens, NYPD officers joined demonstrators in kneeling during their protest. http:// bit.ly/2ZSb3C0", "2020-05-31T21:34:26.000Z": "We need to mobilize the outrage and the energy into real, positive change. That's how this moment becomes a different one.", "2020-05-31T20:28:11.000Z": "Guidance on dentists' offices here: https:// governor.ny.gov/sites/governor .ny.gov/files/atoms/files/DentistryMasterGuidance.pdf ", "2020-05-31T19:30:14.000Z": "Change must come and it starts with standardizing police misconduct policies across America.\n\nWe need:\n-Independent police misconduct investigations\n-One universal definition of excessive force\n-Publicly available disciplinary records of officers who are accused of misconduct", "2020-05-31T19:10:41.000Z": "NEW: New York dentists can reopen statewide tomorrow. Dentists' offices will be subject to safety and social distancing guidelines.", "2020-05-31T16:44:13.000Z": "We don't need to lose the passion or the outrage - we need to direct it. Like a laser focused on real, positive change.\n\nThat's how George Floyd does not become just another name in a long list of people who should never have died.\n\nThat's how his death won't be in vain.", "2020-05-31T16:20:52.000Z": "We're very good in this country at telling other people how to behave and act - but we still discriminate on the basis of the color of skin. That is the simple, painful truth.", "2020-05-31T16:19:12.000Z": "Last night was a long and ugly night across the country and across our state.\n\nPeople are outraged and I understand it. I am too.\n\nIt's not just George Floyd's killing, although that is cause enough. It's the continuing, chronic, institutional racism in this country.", "2020-05-31T16:10:41.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-31T15:09:22.000Z": "I will be giving my daily briefing at 12:00PM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-30T18:18:41.000Z": "I thank @CarlHeastie and @AndreaSCousins for their work in passing legislation that provides death benefits for families of frontline workers who lost their lives due to COVID-19.\n\nIt is the least we can do to thank and honor the memory of these heroes.", "2020-05-30T17:38:08.000Z": "You are in denial if you think the death of George Floyd was an isolated incident.", "2020-05-30T17:17:32.000Z": "How many times have we seen the same situation?\n\nYes, the names change, but the color doesn't.", "2020-05-30T16:15:35.000Z": "Why are black people dying from #COVID at higher rates than white people? Why are health outcomes worse in communities of color? Why did George Floyd die? Why does this happen again and again? It's all related.", "2020-05-30T16:09:39.000Z": "It is my honor to sign into law a bill that gives death benefits to all the frontline workers who gave their lives in service to all of us during this pandemic. Providing for their families is the least we can do.", "2020-05-30T16:02:37.000Z": "This nation's history of discrimination and racism dates back hundreds of years. It is abhorrent, and I share the outrage at this fundamental injustice.\n\nBut violence obscures the righteousness of the message and the mission.", "2020-05-30T15:58:38.000Z": "Last night we saw disturbing violent clashes amid protests in Brooklyn.\n\nI am asking @NewYorkStateAG to review all actions and procedures that were taken.\n\nThe public deserves answers and accountability.", "2020-05-30T15:58:03.000Z": "\"Returning hate for hate multiplies hate, adding deeper darkness to a night already devoid of stars. Darkness cannot drive out darkness; only light can do that. Hate cannot drive out hate; only love can do that.\" -Dr. Martin Luther King Jr.", "2020-05-30T15:54:25.000Z": "As we reopen NYC we are laser-focused on the 10 hotspots where infection rates are highest.\n\nIt is not just coincidence that the hotspots are in low-income and minority communities.\n\nThe inequality in health outcomes of this pandemic is just one of countless inequalities.", "2020-05-30T15:47:21.000Z": "We are reopening smart.\n\nWe follow the data - not opinions.\n\nNew York City will open on June 8th.", "2020-05-30T15:38:26.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-30T14:03:25.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-30T12:52:20.000Z": "Say it with me:", "2020-05-29T22:33:15.000Z": "I'll be on @SPECNewsAlbany at approx 6:35pm. Tune in.", "2020-05-29T21:26:40.000Z": "Calling into @NY1 with Roma Torre now.", "2020-05-29T19:59:06.000Z": "Link to Executive Order 202.35: No. 202.35: Continuing Temporary Suspension and Modification of Laws Relating to the Disaster... No. 202.35: Continuing Temporary Suspension and Modification of Laws Relating to the Disaster Emergency governor.ny.gov", "2020-05-29T19:39:01.000Z": "Appearing on @MSNBC at 3:45pm. Tune in.", "2020-05-29T19:33:47.000Z": "Rodney King. Abner Louima. Amadou Diallo. Sean Bell. Oscar Grant. Eric Garner. Michael Brown. Laquan McDonald. Freddie Gray. Antwon Rose Jr. Ahmaud Arbery. Breonna Taylor. George Floyd. \n\nSay Their Names.", "2020-05-29T17:34:18.000Z": "The death of George Floyd is not an isolated incident. \n\nIt is part of a continuum of outrage and inequality. That is the reason for the rage, the frustration, the anger and the fear.\n\nThe demand is for Justice. Over and over and over again.", "2020-05-29T17:22:20.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-29T17:20:04.000Z": "Reopening does not mean returning to the past. Reopening means moving toward a new, safer normal.\n\nWear a mask. Get tested. Social distance.\n\nIt's up to us to keep this progress going.", "2020-05-29T17:17:56.000Z": "NYC is on track to begin reopening the week of June 8th.\n\nWe will stay on track by focusing on the hotspots.\n\nWe know down to the zip code where the infection rate is higher than average.\n\nWe will meet the need where it is greatest.", "2020-05-29T17:15:27.000Z": "In Phase 2 retail curbside pickup will be open. Hair salons and barber shops can also reopen with strict guidelines. Visit http:// forward.ny.gov for more info on the phases of reopening. NY Forward: A Guide to Reopening New York and Building Back Better forward.ny.gov", "2020-05-29T17:12:24.000Z": "Five regions will now enter Phase 2 of reopening: North Country, Finger Lakes, Central NY, Mohawk Valley and Southern Tier.\n\nThe data in these regions has been reviewed by county, regional & state officials as well as global experts in virology.", "2020-05-29T17:02:55.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-29T16:18:09.000Z": "I will be giving my daily #Coronavirus briefing at 1:00PM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-28T20:33:47.000Z": "Thanks @chrisrock for spreading the message to New Yorkers to get tested if you have symptoms or think you have been exposed to COVID. Find a testing site near you: https:// coronavirus.health.ny.gov/find-test-site -near-you ", "2020-05-28T20:02:15.000Z": "Congratulations @AlanChartock on winning a Lifetime Achievement Award from the NYS Associated Press Association. A well deserved honor. NY radio wouldn't be the same without the Good Doctor.", "2020-05-28T18:02:51.000Z": ". @rosieperezbklyn wants you to do the right thing.", "2020-05-28T16:15:57.000Z": "People have a right to jeopardize their own health (I don't recommend it).\n\nPeople don't have a right to jeopardize other people's health. Quote Tweet Andrew Cuomo @NYGovCuomo Today I am signing an Executive Order authorizing businesses to deny entry to those who do not wear masks or face-coverings. No mask - No entry.", "2020-05-28T16:12:47.000Z": "All state-run testing sites are free of charge. Many are under capacity.\n\nGet an appointment & get tested. Find a Test Site Near You coronavirus.health.ny.gov", "2020-05-28T16:04:58.000Z": "Spread love the Brooklyn way.\n\nGet tested. Wear a mask.\n\nStand up & do the right thing. @rosieperezbklyn  @chrisrock", "2020-05-28T16:00:42.000Z": "Today I am signing an Executive Order authorizing businesses to deny entry to those who do not wear masks or face-coverings. No mask - No entry.", "2020-05-28T15:58:07.000Z": "The data is clear. This virus is disproportionally impacting lower-income communities that already suffer from lower health outcomes.\n\nWe are working at full tilt to reach these communities, with more testing, more supplies and more outreach.", "2020-05-28T15:49:02.000Z": "The economy will bounce back quickly for the rich and powerful. It always does.\n\nWe need to make sure the economy bounces back for working Americans, too.", "2020-05-28T15:45:47.000Z": "Some states like Alaska & Wyoming got over $2 million in federal relief PER case.\n\nNY got only $23,840 per case.\n\nWe are one country. Stop the politics. Fund states based on need.", "2020-05-28T15:43:59.000Z": "States have taken on many of the tough jobs in this pandemic - testing, tracing, reopening. \n\nBut states can't do this alone - we need help from the federal government.\n\nStop shortchanging the hardest hit states like NY.", "2020-05-28T15:32:25.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-28T13:57:34.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-28T13:16:47.000Z": "Wear a mask. It's the right thing to do. Quote Tweet ABC News @ABC Gov. Andrew Cuomo wears a mask as he arrives at the White House to meet Pres. Trump. https:// abcn.ws/2TOdDFo", "2020-05-28T12:03:49.000Z": "We lost 100,000 Americans.\n\nEach one was loved. Each one will be missed.\n\nLet us pause in unity and sorrow.", "2020-05-27T22:35:32.000Z": "We are talking about people's lives here and we need to be united as a nation.\n\nNow is not the time to play politics.", "2020-05-27T21:20:10.000Z": "\"What happened to that American spirit?\"\n\nWhile visiting Washington, D.C. on Wednesday, New York Gov. Andrew Cuomo slammed the \"toxic\" and \"hyper-partisan\" reactions from lawmakers who don't want to help other states during the pandemic. https:// cbsn.ws/2B3mTi9", "2020-05-27T20:50:29.000Z": "Deeply saddened by the death of Larry Kramer, a great NYer who helped galvanize the nation's response to the HIV/AIDS epidemic. As the federal gov't sat paralyzed, Larry Kramer was fearless & relentless - he demanded & inspired action. We will miss him. Larry Kramer, Playwright and Outspoken AIDS Activist, Dies at 84 He sought to shock the country into dealing with AIDS as a public-health emergency and foresaw that it could kill millions regardless of sexual orientation. nytimes.com", "2020-05-27T17:35:38.000Z": "Now is the time for government to stimulate the economy by investing in infrastructure.\n\nWe have projects in NY ready to go but we need to do it together with the fed gov't & with other states.\n\nThis is long overdue. Let's do it now.", "2020-05-27T17:31:44.000Z": "Let's put politics aside for a single moment.\n\nIt's not, red and blue. It's red, white and blue.\n\nWe need to act like the United States of America.", "2020-05-27T17:26:18.000Z": "It's hypocritical to say NY doesn't deserve federal funding now because it would be 'unfair' to GOP states. (Never mind that NY was hit hardest of all by COVID.)\n\nThey had no problem using NY tax dollars for decades as a piggy bank to subsidize poorer, GOP states.", "2020-05-27T17:20:11.000Z": "This virus doesn't care about political party.\n\nStates like NY that have been hit hardest by COVID-19 shouldn't be punished because they vote blue.\n\nEspecially when NY, year in and year out, subsidizes our fellow states.", "2020-05-27T17:12:28.000Z": "There is no \"United States\" without the states.\n\nThe states most impacted by COVID-19 represent more than 1/3rd of the national GDP.\n\nState & local spending is essential to the health of the national economy.", "2020-05-27T17:11:59.000Z": "There won't be a national recovery if state and local governments aren't funded.\n\nThat's just fact.", "2020-05-27T17:08:15.000Z": "As we move forward and begin to reopen New York region by region we do so guided by science and facts.\n\nThere are no opinions only metrics. #NewYorkSmart", "2020-05-27T17:01:32.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-27T14:43:12.000Z": "I will be giving my daily #Coronavirus briefing at 1:00PM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-27T14:19:51.000Z": "When you get a call from NYS Contact Tracing - pick up your phone.\n\nStop the Spread. Save Lives.", "2020-05-27T13:02:25.000Z": "Wear a mask it's cool. \nAnd that's official.", "2020-05-26T16:44:28.000Z": "And congrats to Natalia Bougadellis and Emory Parker, the creators of the runner-up video. They finished in 2nd place by only about 500 votes (out of nearly 200K votes cast). Well done.", "2020-05-26T16:17:42.000Z": "Congrats to @BunnyLakeFilms , the winner of NY's #WearAMask Ad Contest. Thank you to everyone who participated in the contest, shared videos with us and voted. Here's the winning video. #NewYorkTough", "2020-05-26T15:55:40.000Z": "If there's ever a time to take on a major infrastructure program, it's now.\n\nIt will stimulate the economy, create jobs and will help America catch up to other countries that frankly have surpassed us.\n\nIt's just common sense.", "2020-05-26T15:45:03.000Z": "The future will be written by each of us.\n\n-Wash your hands\n-Social distance\n-Wear a mask\n\nThis is our responsibility to one another.", "2020-05-26T15:41:39.000Z": "As more regions of the state begin reopening, we are carefully monitoring health data to make sure that everything is going in the right direction.\n\nWe rely on science and data to guide us - not emotion or politics.", "2020-05-26T15:38:22.000Z": "The Mid-Hudson Region begins Phase 1 reopening today, having now met all the required metrics.\n\nLong Island is on track to enter Phase 1 tomorrow.", "2020-05-26T15:31:34.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-26T14:16:15.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-26T13:29:57.000Z": "Today I ring in the start of the trading day and the return of traders to the floor of the NYSE. In the two months the floor was dark, NYers bent the curve and slowed the spread of this virus. #NewYorkTough Andrew Cuomo @NYGovCuomo Today I ring in the start of the trading day and the return of traders to the floor of the NYSE. In the two months the floor was dark, NYers bent the curve and slowed the spread of this virus.... pscp.tv", "2020-05-25T17:25:43.000Z": "We asked NYers to tell us in their own words why it's important to #WearAMask . They delivered.\n\nVote for your favorite Wear A Mask video at http:// wearamask.ny.gov .\n\nVoting closes at midnight. Wear A Mask New York Ad Contest: Winner Announced Watch the winning video that will be used for public service announcements. coronavirus.health.ny.gov", "2020-05-25T16:39:28.000Z": "We remember the fallen and honor them today. #MemorialDay2020", "2020-05-25T15:58:29.000Z": "Be smart. Masks work. In simple New York terms: Don't be stupid.", "2020-05-25T15:49:25.000Z": "We will continue to show respect to our frontline heroes not just with words, but with action.\n\nToday we are announcing that the State & Local government will provide death benefits for public heroes who died from COVID-19 during this emergency.", "2020-05-25T15:47:04.000Z": "I am calling on the federal government to provide dedicated funding for hazard pay for frontline workers.\n\nThey have earned it by showing up and risking their health and lives for all of us.", "2020-05-25T15:39:59.000Z": "This #MemorialDay we stand on the USS Intrepid Sea, Air and Space Museum in NYC.\n\nToday we honor the servicemembers we have lost and the ideals they stood for - service, bravery and sacrifice.\n\nLet's all take a moment to remember the fallen today.", "2020-05-25T15:32:06.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-25T14:22:12.000Z": "Do your part. Show respect. Wear a mask.", "2020-05-25T14:10:13.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-25T12:18:31.000Z": "This Memorial Day we honor and remember those who gave their lives in service to our country.\n\nWe are forever grateful. #MemorialDay2020", "2020-05-24T22:47:11.000Z": "There's still time to cast your vote in our wear a mask ad contest.\n\n600+ New Yorkers submitted videos on why we should all #wearamask .\n\n55 students from @MS167Manhattan and 19 teen leaders from @ReadAlliance sent videos. Thank you for participating. Wear A Mask New York Ad Contest: Winner Announced Watch the winning video that will be used for public service announcements. coronavirus.health.ny.gov", "2020-05-24T20:24:29.000Z": "Congratulations to all 2020 graduates. \n\nWhile the celebrations are different this year , the pride is even stronger. \n\nAnd to my daughter Michaela, who officially graduates today: The best is yet to come. That I promise.", "2020-05-24T16:27:15.000Z": "Jones Beach is beautiful but it's also a tremendous accomplishment. It was built on 7 miles of marsh.\n\nWe did it then and that ambition is needed now. It's not impossible.", "2020-05-24T16:18:34.000Z": "Together with the business community, we will think big and build back better. \n\nNew York has always led the way. And we will do it here and now.", "2020-05-24T16:14:29.000Z": "The needs right now are very simple. New Yorkers need food and shelter. If you would like to support our Nourish New York initiative, please contribute. \nContact us at \nCOVIDPhilanthropies@exec.ny.gov", "2020-05-24T16:11:01.000Z": "Starting today, NY professional sports leagues can begin spring training.\nOn Tuesday, veterinarians can reopen statewide.", "2020-05-24T16:08:56.000Z": "Mid Hudson region is on track to reopen on Tuesday.\nLong Island region is set to reopen on Wednesday.\nA mask is required when riding public transportation.", "2020-05-24T16:07:07.000Z": "Our actions determine our future.\nKnowledge is power.\nGo to our regional dashboard to see where your community stands. Percentage Positive Results By Region Dashboard forward.ny.gov", "2020-05-24T16:04:31.000Z": "State beaches are open.\nCampgrounds will open tomorrow.\nWe urge New Yorkers to be smart. #NewYorkTough", "2020-05-24T16:00:01.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-24T14:52:30.000Z": "I will be giving my daily #Coronavirus briefing at 12:00PM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-24T14:05:45.000Z": "Health care workers wear masks for 5+ hours non-stop. You can wear one for 45 minutes.", "2020-05-24T02:30:57.000Z": "Tonight, Muslim New Yorkers mark the end of Ramadan and celebrate Eid al-Fitr.\n\nWhile this year's celebrations may be different, I wish all who observe a blessed holiday. #EidMubarak", "2020-05-23T22:09:37.000Z": "\"Courage is not having the strength to go on; it is going on when you don't have the strength.\"\n-Theodore Roosevelt", "2020-05-23T19:53:29.000Z": "There is strength in community. There is strength in being a good neighbor. I believe that we are at our best when we work together. #NYTough", "2020-05-23T16:17:26.000Z": "A few more great submissions in our #WearAMask Ad Contest.\n\nHelp us tell New Yorkers why it's important to wear a mask. Go to http:// wearamask.ny.gov and vote.", "2020-05-23T16:06:04.000Z": "The Mid-Hudson Region is on track to begin Phase 1 reopening on Tuesday.\n\nI urge New Yorkers to continue to take precautions & do your part by wearing a mask in public, washing your hands often, and avoiding large gatherings. #NewYorkTough", "2020-05-23T15:53:11.000Z": "We lost 84 New Yorkers to COVID-19 yesterday. By any normal standard this is a hideous number. But we are thankful this number has fallen below 100 for the first time since late March.", "2020-05-23T15:48:09.000Z": "If you have symptoms get a test.\n\nIf you have been exposed to someone with COVID get a test. Find a Test Site Near You coronavirus.health.ny.gov", "2020-05-23T15:35:22.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-23T14:55:51.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-23T14:14:31.000Z": "Our actions shape our future. If we get reckless today, we'll suffer the consequences tomorrow.", "2020-05-23T13:00:25.000Z": "Wait for it.", "2020-05-22T15:36:58.000Z": "NY received 600+ submissions for our #WearAMask Ad Contest. Here are a few of the excellent honorable mentions. Vote for the winning video at http:// wearamask.ny.gov", "2020-05-22T15:18:41.000Z": "Wearing a mask is a small thing. And it can be the difference between life and death.", "2020-05-22T15:15:27.000Z": "90% of NY businesses are small businesses. \n\nThey need help. Today we are launching the $100+ million New York Forward Loan Fund.\n\nWe'll focus on Minority and Women-owned businesses  & very small businesses with 20 or fewer employees.\n\nLearn more: http:// esd.ny.gov/nyforwardloans", "2020-05-22T15:10:53.000Z": "We are launching a new pilot program with 52 independent pharmacies to conduct 7,000 more tests per week.\n\nThis is in addition to the 700+ locations NYers can already get tested.\n\nFind a testing location near you: Find a Test Site Near You coronavirus.health.ny.gov", "2020-05-22T15:02:35.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-22T13:55:22.000Z": "I will be giving my daily #Coronavirus briefing at 11:00AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-22T12:51:56.000Z": "I'll keep saying it for as long as it's necessary to say it: Wearing a mask is about RESPECT.", "2020-05-21T18:07:08.000Z": "During this pandemic, there has been a tragic spike in Domestic Violence cases.\n\nWe're launching a task force to come up with innovative solutions.\n\nRemember: If you are in a dangerous situation, we will help you find safe shelter. Call 1-800-942-6906", "2020-05-21T16:21:01.000Z": "NYS is now investigating 157 cases of the COVID-related illness affecting children.\n\nI urge parents to watch out for the symptoms of this multisystem inflammatory syndrome and to seek care if your child has symptoms.\n\nSee the symptoms and learn more: Childhood Inflammatory Disease Related to COVID-19 coronavirus.health.ny.gov", "2020-05-21T15:56:14.000Z": "This #EMSWeek , we thank and honor our EMS workers who are on the frontlines.\n\nTo those we have lost, we owe our eternal gratitude.", "2020-05-21T15:53:01.000Z": "To reduce the risk of spread, summer school this year will be conducted through distance learning.\n\nMeal programs and child care services for essential employees will continue.", "2020-05-21T15:42:37.000Z": "Each of us plays a role as we go forward.\n\nWhat happens next depends on what we do. #NewYorkTough", "2020-05-21T15:34:50.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-21T14:03:44.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-21T01:38:25.000Z": "It's well known that I have a tiny, button nose. Please stick to the facts on your show, little brother. Quote Tweet Christopher C. Cuomo @ChrisCuomo Which swab was it @NYGovCuomo ?", "2020-05-20T19:32:27.000Z": "Do your part. Show respect. Wear a mask.", "2020-05-20T16:02:28.000Z": "We launched a video contest asking New Yorkers to explain in their own words why NYers should wear a mask in public.\n\nWatch the 5 video finalists and vote for the winning video here: Wear A Mask New York Ad Contest: Winner Announced Watch the winning video that will be used for public service announcements. coronavirus.health.ny.gov", "2020-05-20T15:50:16.000Z": "If people get arrogant and casual about this pandemic, you will see the infection rate go up.\n\nIt's that simple.", "2020-05-20T15:47:47.000Z": "Low-Income communities & communities of color have been hit hardest by this virus.\n\nToday we're expanding our faith-based testing program (with @NorthwellHealth & SOMOS) to 72 locations in hardest-hit communities.\n\nWe will also expand testing to 40 public housing developments.", "2020-05-20T15:33:45.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-20T14:52:57.000Z": "The 5 finalists in our #WearAMaskNY Ad Contest will be announced at 11:30am.\n\nWe received hundreds of great submissions.\n\nI encourage everyone to watch the videos, vote for your favorite, and of course, wear a mask.", "2020-05-20T14:07:48.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-19T16:48:42.000Z": "When a vaccine is found it must be available to all.\n\nNot only to the rich or privileged.\n\nThe federal gov't must develop fair rules now to ensure any future vaccine is available to all.", "2020-05-19T16:19:35.000Z": "Taxpayers shouldn't subsidize corporate layoffs. \n\nIt's 2008 all over again.\n\nI'm proposing that if a corporation gets gov't money, they MUST rehire the same # of employees they had pre-pandemic.", "2020-05-19T16:13:19.000Z": "Memorial Day is an important American tradition and we want to safely honor our veterans.\n\nThe state will allow ceremonies with 10 people or less, at the discretion of local governments.", "2020-05-19T16:10:03.000Z": "NEW: The Capital Region will be be able to enter Phase 1 of reopening tomorrow.", "2020-05-19T16:04:49.000Z": "The least we can do is wear a mask.\n\nIt's easy and shows respect.", "2020-05-19T16:02:22.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-19T14:42:08.000Z": "I will be giving my daily #Coronavirus briefing at 12:00PM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-19T13:35:30.000Z": "Gov. Cuomo will be guest on @SRuhle  @MSNBC now.", "2020-05-18T22:27:51.000Z": "We are facing a mental health crisis right now. If you feel overwhelmed and anxious, you aren't alone.\n\nFor support, call 1-844-863-9314. @Headspace is also offering free resources for educators, health care workers, and those who have lost their job - a great initiative.", "2020-05-18T17:08:17.000Z": "I urge anyone who has COVID symptoms to make an appointment and get tested.\n\nFind a testing site near you: Find a Test Site Near You coronavirus.health.ny.gov", "2020-05-18T16:15:45.000Z": "New York State is ready and willing to partner with major sports teams that are interested in playing games safely, without fans.\n\nIf our professional sports teams can make it work (& be safe) on their end, we're supportive.", "2020-05-18T15:57:13.000Z": "The stakes are high, and expert, scientific opinion is far more valuable than political opinion.\n\n\nI'm pleased to announce that Dr. Michael Osterholm and Dr. Samir Bhatt, two international experts in epidemiology, will be advising NY on our progress and our metrics.", "2020-05-18T15:51:34.000Z": "Update: Judges and staff will be returning to courthouses in 30 Upstate counties starting this week.", "2020-05-18T15:44:47.000Z": "NEW: Western New York will begin Phase 1 of reopening tomorrow.\n\nThey will have all the contact tracers needed in place.", "2020-05-18T15:43:15.000Z": "We must do all we can to protect the most vulnerable. \n\nNY has required all nursing home staff to be tested for COVID twice a week.\n\nTo make sure that happens we are sending 320K testing kits to nursing homes statewide.", "2020-05-18T15:38:42.000Z": "New York responded to the COVID crisis with great unity and great discipline.\n\nWe need that same discipline as regions begin to reopen.", "2020-05-18T15:31:36.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-18T14:07:46.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-18T13:12:52.000Z": "As NY begins to reopen we can't let our guard down. Gatherings are dangerous. Here's why:", "2020-05-17T17:14:07.000Z": "It's quick, easy and painless. If I have time, you do too.", "2020-05-17T16:18:47.000Z": "Testing is fast and easy, and there are over 700+ sites in New York where you can get a COVID test.\n\nAnyone with symptoms is eligible. So are essential workers.\n\nFind a testing site near you: Find a Test Site Near You coronavirus.health.ny.gov", "2020-05-17T16:16:37.000Z": "We now have more testing capacity than New Yorkers are using.\n\nWe need to use our full testing capacity as we reopen.\n\nIf you have COVID symptoms or have been in contact with someone with COVID - get a test.", "2020-05-17T16:14:50.000Z": "New York has rapidly expanded our testing capacity.\n\nWe have met our earlier target of 40,000 diagnostic tests daily.\n\nAs a percentage of our population, NY has tested more than any other state.", "2020-05-17T16:12:47.000Z": "Up to 38% of Americans are experiencing mental distress.\n\nThe Mental Health Coalition launched the #HowAreYouReally campaign to raise awareness about the mental health issues so many people are facing.\n\nWe all need to look out for one another.", "2020-05-17T16:09:56.000Z": "The COVID-19 crisis is a mental health crisis, and it deserves far more attention than it's gotten.\n\nDon't underestimate the trauma this has created for people.\n\nNYers can call 1-844-863-9314 for emotional support.", "2020-05-17T16:00:47.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-17T14:42:15.000Z": "I will be giving my daily #Coronavirus briefing at 12:00PM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-17T12:55:23.000Z": "As regions of the state begin to reopen, each of us needs to be smart and protect ourself and others.\n\nNew Yorkers are in control of what happens. #NewYorkTough", "2020-05-16T18:21:23.000Z": "Congratulations to the Class of 2020 graduates of @SUNY . This week NY honors and celebrates you.\n\nI know it's not the ceremony you planned for, but I want to commend all graduates for your academic achievement.\n\nCongratulations on this success.", "2020-05-16T17:01:43.000Z": "When we openly talk about mental health, we can better address it. I'm proud to stand with @kennethcolereal and the Mental Health Coalition and join the #howareyoureallychallenge . I nominate @GovMurphy - share how you are, really.", "2020-05-16T16:06:39.000Z": "To those trying to make COVID funding into a Red vs. Blue issue.\n\nTo those counting how many people passed away by their political party.\n\nTo those more interested in helping states where Republicans live than where Democrats live.\n\nShame on you.", "2020-05-16T15:48:12.000Z": "The House passed a smart bill yesterday, the #HeroesAct , that funds states.\n\nRemember: It's the states who fund hospitals, schools, firefighters, police and crucial services that working Americans rely on.\n\nThe Senate needs to act fast to pass it too.", "2020-05-16T15:44:00.000Z": "NEW: We will allow elective surgeries to resume in Westchester County and Suffolk County, including at Ambulatory Surgery Centers.", "2020-05-16T15:41:19.000Z": "As we phase reopening we are looking for all opportunities to reopen economic activity without crowds.\n \nFor example, horse racing tracks across the state can open June 1 without fans.", "2020-05-16T15:32:48.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-16T14:59:35.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-16T13:11:46.000Z": "Once again I remind New Yorkers:", "2020-05-15T16:22:20.000Z": "As part of Phase One of reopening, residential and commercial construction can resume in the regions that have met the benchmarks.\n\n-Indoor & outdoor work allowed\n-Masks must be worn within 6 feet of another worker\n-Employer must provide masks\n-No congregate meetings", "2020-05-15T16:16:30.000Z": "If you live in a region that's in Phase 1 of reopening, retail businesses can open for curbside pickup or in-store pickup (if curbside not practical).\n\n-Customers must order ahead\n-Social distancing required in store\n-Patrons & staff must wear masks in store\n-Sanitizer available", "2020-05-15T16:03:33.000Z": "What happens next is up to each of us.\n\nThis virus is powerful and every time we think we understand it we learn we don't.\n\nGovernment alone can't keep you safe.\n\nIt's up to you.", "2020-05-15T15:59:15.000Z": "City, town and county beaches may open as well on Friday of Memorial Day weekend, as long as they fully enforce the minimum rules.\n\nThey may impose additional conditions.\n\nIf local government's don't enforce these rules, the beaches will be closed.", "2020-05-15T15:52:16.000Z": "As a region we have established a joint agreement on beaches in NY, NJ, CT and DE.\n\nState beaches will open Friday of Memorial Day weekend with strict precautions.\n\nBeaches will be at 50% capacity & masks will be required when social distance not possible. Staff will enforce.", "2020-05-15T15:41:28.000Z": "NY on PAUSE is extended to May 28 for regions that don't begin reopening today.\n\nBut as soon as a region hits its benchmark, it comes online immediately - it does not have to wait until May 28.", "2020-05-15T15:35:11.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-15T15:10:59.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-15T13:41:05.000Z": "This pandemic is also a mental heath crisis.\n\nNY wants you to know: You are not alone. \n\nIf you need support, call the New York State Emotional Support Hotline at 1-844-863-9314.", "2020-05-15T01:19:43.000Z": "As we ease into phase 1 in certain regions of the state, we have to be smart --wear masks, gloves & stay 6 feet apart\n\nIt's not the economy OR public health - it has to be both\n\nWe are not out of the woods just yet -- we got here bc NY'er did the right thing -- let's keep going! Quote Tweet Andrew Cuomo @NYGovCuomo The Finger Lakes, Southern Tier, Mohawk Valley, the North Country, and Central NY are ready to begin Phase 1 of reopening tomorrow.\n\nThe others can be UN-PAUSED the moment they hit their benchmarks.\n\nNew Yorkers be proud. Your actions bent the curve.", "2020-05-15T00:46:41.000Z": "The Finger Lakes, Southern Tier, Mohawk Valley, the North Country, and Central NY are ready to begin Phase 1 of reopening tomorrow.\n\nThe others can be UN-PAUSED the moment they hit their benchmarks.\n\nNew Yorkers be proud. Your actions bent the curve.", "2020-05-14T18:37:00.000Z": "This is not just about what government does.\n\nIt's also about what New Yorkers do.\n\nIf you wear a mask in public, if you wash your hands often, if you avoid large gatherings - you will be safer.", "2020-05-14T18:27:59.000Z": "Like New York State, 16 other states and 6 European countries have reported cases of children suffering from potentially COVID-related illnesses.\n\nNY is leading the way on research.\n\nWe need to understand all we can as fast as we can when it comes to our children.", "2020-05-14T18:25:36.000Z": "New York State is working to build a strong medical manufacturing supply chain in our own state.\n\nWe never again want to be in a position where we need  to rely on foreign imports to get critical supplies like N95 masks.\n\nIt's a national security issue.", "2020-05-14T18:02:20.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-14T18:15:44.000Z": "NEW: Central New York has now met all seven metrics to begin Phase 1 of reopening on May 15th.\n\nIt joins Mohawk Valley, Southern Tier, Finger Lakes, and the North Country.", "2020-05-14T18:07:54.000Z": "Follow the data.\nFollow the science.\nFollow the metrics.\n\nThat's how New York reopens.", "2020-05-14T16:44:00.000Z": "I will be giving my daily #Coronavirus briefing at 2:00PM. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-14T12:50:47.000Z": "It takes a team to fight this virus.\n\nThis crisis bore down on New York with a force unlike anything we've ever seen. Our response requires an equal and opposite force.\n\nMeet @melissadderosa Who Can Say 'No' to Cuomo? His Top Aide, Melissa DeRosa Many unfamiliar with state politics have wondered about the steady, steely presence six feet from the governor's elbow during his popular daily briefings. Here's an introduction. nytimes.com", "2020-05-13T23:49:13.000Z": "Reminder: Doctors' offices are essential businesses and continue to be open to patients across NYS.\n\nCheck with your doctor for hours and protocols.", "2020-05-13T20:30:07.000Z": "47 New York counties can now resume elective surgeries.\n\nAmbulatory Surgical Centers in those counties can also now resume elective surgeries.\n\nSee the list of counties here: Governor Cuomo Announces 12 More Counties Are Now Eligible to Resume Elective Surgeries Amid the ongoing COVID-19 pandemic, Governor Cuomo announced 12 more counties are now eligible to resume elective surgeries. governor.ny.gov", "2020-05-13T18:04:18.000Z": "As of today, the North Country has met all seven metrics required to begin reopening May 15th.\n\nIt joins the Finger Lakes, Southern Tier, and Mohawk Valley regions that have also met the requirements to begin reopening.\n\nSee where your region stands: Regional Monitoring Dashboard forward.ny.gov", "2020-05-13T16:06:17.000Z": "If a corporation gets a check from the government, they must rehire the same number of workers after the pandemic as employed before.\n\nTaxpayers shouldn't subsidize companies that lay off workers.", "2020-05-13T15:59:36.000Z": "While we believe this illness to be rare, seek care is your child has these symptoms - especially if your child has been exposed to someone who had COVID-19.", "2020-05-13T15:57:52.000Z": "NYS is investigating 102 cases of a potentially COVID-related inflammatory illness in children. \n\nTragically, 3 young NYers lost their lives to this illness.\n\nThough rare, we have cases in children of all ages.\n\n14 other states and 5 European countries have also reported cases.", "2020-05-13T15:47:51.000Z": "Our decisions are based on science. Watch the measures. Watch the numbers. \n\nBut the rate of transmission is based on the actions of all of us.\n\nYou tell me what New Yorkers do today, and I'll tell you what the transmission rate will be tomorrow.", "2020-05-13T15:43:51.000Z": "Our reopening process is totally transparent and based on data.\n\nYou can see for yourself exactly what is happening in your region on a daily basis.\n\nVisit the Regional Monitoring Dashboard: Regional Monitoring Dashboard forward.ny.gov", "2020-05-13T15:39:11.000Z": "We lost 166 New Yorkers yesterday to COVID-19.\n\nIt's not just a number. These are people whose families are in immense pain today. We share in their heartbreak.", "2020-05-13T15:33:14.000Z": "Closed captioning and ASL interpretation is available at The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-13T15:32:49.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-13T13:36:35.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-13T13:29:14.000Z": "Washington's bailout rule should be simple and clear: No government support if you don't hire back all of your pre-pandemic workers. Opinion | Andrew Cuomo: Let's not repeat the mistake of putting corporations ahead of workers in a... The government's bailout rule should be simple: No support if you don't hire back all of your pre-pandemic workers. washingtonpost.com", "2020-05-13T13:09:40.000Z": "Price gouging on products that protect people from Coronavirus is dishonest.\n\nIt's also illegal.\n\nNew York State has referred over 2,000 gouging complaints to law enforcement.\n\nTo report suspected price gouging, call 800-697-1220.", "2020-05-12T22:33:24.000Z": "An LC-130 \"Skibird\" from the New York Air National Guard flew over Albany today to salute first responders and essential workers fighting on the frontlines against this virus.", "2020-05-12T21:04:00.000Z": "Show respect. Wear a mask.", "2020-05-12T18:20:06.000Z": "When you wear a mask you are saying I respect my neighbors. \n\nWhen you wear a mask you are saying I respect nurses and doctors.\n\nWhen you wear a mask you are saying I respect other people.", "2020-05-12T18:08:13.000Z": "I'm proposing the Americans First Law: If a corporation does not rehire the same number of employees, they must return any COVID funds received.", "2020-05-12T17:57:59.000Z": "The federal government bailed out big corporations and gave millionaires a tax cut in the first COVID bills.\n\nIt's time for them to fund:\n\n-State and local governments \n-Testing and tracing programs\n-A real economic stimulus that helps working Americans", "2020-05-12T17:50:12.000Z": "When we begin to reopen we will do so on a regional basis and in a controlled, safe way.\n\nAll information by region is clear and available to the public.\n\nWe want all New Yorkers to have the facts. Regional Monitoring Dashboard forward.ny.gov", "2020-05-12T17:47:25.000Z": "New York State is now investigating about 100 cases of an inflammatory illness in children that may be related to COVID-19.\n\nThe ages of these cases range from infancy to age 21.\n\nWe ask parents to watch out for these symptoms:", "2020-05-12T17:37:09.000Z": "Closed captioning and ASL interpretation is available at The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-12T17:36:05.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-12T15:59:01.000Z": "I will be giving my daily #Coronavirus briefing at 1:00PM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-12T15:53:51.000Z": "Wear a mask - it's the right thing to do. \n\nHelp us tell New Yorkers why. Submit a video by FRIDAY, May 15th.\n\nLearn more: Wear A Mask New York Ad Contest: Winner Announced Watch the winning video that will be used for public service announcements. coronavirus.health.ny.gov", "2020-05-11T20:21:19.000Z": "Our plan to safely reopen New York in phases will be guided by science and data.\n \nRead the full NY Forward plan here: https:// on.ny.gov/3fAGrua", "2020-05-11T18:34:53.000Z": "Three regions of New York are ready to begin reopening May 15th.\n\nFinger Lakes, Southern Tier, and Mohawk Valley have met the 7 metrics required to begin Phase 1 of the reopening plan.\n\nHere's where all the regions of NY currently stand:", "2020-05-11T18:19:59.000Z": "Jerry Stiller was as New York as they come. To my friend Ben who, like his father, is a New Yorker through and through I extend my deepest condolences. Jerry will be missed. Quote Tweet Ben Stiller @RedHourBen I'm sad to say that my father, Jerry Stiller, passed away from natural causes. He was a great dad and grandfather,  and the most dedicated husband to Anne for about 62 years. He will be greatly missed. Love you Dad.", "2020-05-11T16:24:48.000Z": "What New Yorkers have done, nobody could have imagined. The people accomplished a great feat in flattening the curve. \n\nWe need New Yorkers to show that same resolve and intelligence in this next phase.", "2020-05-11T16:03:51.000Z": "New York will reopen statewide certain low-risk businesses and recreational activities as of May 15.\n\nThese include:\n\n-Landscaping and gardening\n-Outdoor, low-risk recreational activities like tennis\n-Drive-in movie theaters", "2020-05-11T15:55:49.000Z": "In each region there will be a Regional Control Room that will closely monitor progress and act as a circuit breaker ready to step in.", "2020-05-11T15:52:10.000Z": "Today we enter a new phase in the battle against COVID-19.\n\nWe have established criteria for reopening based on 7 metrics:", "2020-05-11T15:35:26.000Z": "Closed captioning and ASL interpretation is available at The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-11T15:35:08.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-11T14:04:10.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-10T18:45:53.000Z": "Corporations that lay off workers because of COVID shouldn't be getting government money for COVID.\n\nIf they don't rehire the workers they laid off, they should have to return the money.", "2020-05-10T18:24:07.000Z": "My mother has a message for all New Yorkers on #MothersDay :", "2020-05-10T16:42:25.000Z": "Happy #MothersDay to my mother Matilda.\n\nWhile I can't be with you, it is great to see you. You have always been pure love.\n\nAnd to all moms: Whether separated by distance or staying home together, we love and appreciate you.", "2020-05-10T16:30:17.000Z": "Congress needs to fund working Americans.\n\nThey've funded corporations, airlines and banks.\n\nThey literally put a tax break for millionaires into their COVID legislation.\n\nDon't make the same mistake twice. Fund working Americans.", "2020-05-10T16:22:14.000Z": ". @HealthNYGov is now investigating up to 85 cases of what may be a COVID-related illness in children.\n\nSymptoms are similar to Kawasaki disease and toxic shock syndrome.\n\nThough the illness is rare, we ask parents to be vigilant.\n\nLearn more: Governor Cuomo Announces State is Helping to Develop the National Criteria For Identifying and... Governor Cuomo announces that at the request of the CDC, the state is helping to develop the national criteria for identifying and responding to COVID-related illness. governor.ny.gov", "2020-05-10T16:16:52.000Z": "Any nursing home that fails to follow health procedures will lose their license.\n\nRemember: If a nursing home cannot provide adequate care, they MUST call the State Department of Health to transfer the resident.", "2020-05-10T16:14:35.000Z": "NEW: All nursing home staff must now be tested for COVID twice a week.\n\n\nThis rule is not optional - it's mandatory.", "2020-05-10T16:10:04.000Z": "Yesterday we lost 207 New Yorkers to COVID-19.\n\nTo the family and loved ones suffering the pain of this loss - we share in your pain.", "2020-05-10T16:05:25.000Z": "Closed captioning and ASL interpretation is available at The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-10T16:04:50.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-10T15:07:53.000Z": "I will be giving my daily #Coronavirus briefing at 12:00PM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-10T13:05:48.000Z": "Happy Mother's Day, Mom.\n\nLove this photo of you with your favorite son, and @ChrisCuomo ...", "2020-05-09T18:17:22.000Z": "Anyone who tells you they know the script doesn't know what they're talking about.\n\nWe all wish we did but we don't.", "2020-05-09T16:03:07.000Z": "Communities of color have been disproportionately & unfairly impacted by this pandemic.\n\nThis partnership will help us tackle these inequities.\n\nThank you to @RepJeffries  @NydiaVelazquez  @RepYvetteClarke and our many partners in the faith community for making this possible.", "2020-05-09T15:57:44.000Z": "NEW: New York is partnering with @NorthwellHealth to open 24 temporary COVID testing sites at churches in predominantly low-income communities & communities of color.\n\nWe must address the racial disparities of this pandemic, and meet the need where it is.", "2020-05-09T15:51:55.000Z": "We have tested 1,300 transit workers in the NYC area for antibodies and found a 14.2% positive rate.\n\nWe will continue to expand antibody testing to monitor and assess infection rate.\n\nOur essential workers have done so much for us - and we must look out for them too.", "2020-05-09T15:47:11.000Z": "Tragically, three young New Yorkers have died of what may be a COVID-related illness in children.\n\nThis illness has symptoms that are similar to Kawasaki disease & toxic shock syndrome.\n\nDOH is investigating & we will provide updates.\n\nThough rare, we urge parents to be vigilant.", "2020-05-09T15:38:57.000Z": "It is heartbreaking that 226 New Yorkers were lost yesterday to COVID-19. \n\nWe mourn with their families and loved ones.", "2020-05-09T15:33:15.000Z": "Closed captioning and ASL interpretation is available at The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-09T15:32:43.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-09T14:26:57.000Z": "Your weekly reminder:", "2020-05-09T13:48:27.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-09T12:56:09.000Z": "\"I do not like to state an opinion on a matter unless I know the precise facts.\"\n-Albert Einstein", "2020-05-08T23:35:53.000Z": "We have to proceed carefully.\n\nIf we lose people, that's the one thing we can't fix.", "2020-05-08T20:19:00.000Z": "Are you are interested in being a COVID tracer?\n\nGreat! NY is building an army of contact tracers.\n\nYou can apply online here: https:// careers-pcgus.icims.com/jobs/5244/cont act-tracer/job ", "2020-05-08T18:55:59.000Z": "Our teachers and students have risen to the occasion during this pandemic and worked hard via remote learning.\n\nBut nothing can ever replace in-class learning.\n\nWhen we reopen, a new advisory council will help us strengthen NY's education system for the future.", "2020-05-08T17:29:18.000Z": "COVID-19 will not stand in the way of justice. We will extend the window for victims to file cases under the #ChildVictimsAct an additional five months.\n\nVictims will now have until January 14 to file cases under this law.", "2020-05-08T16:31:44.000Z": "Parents - seek care immediately if your child has these symptoms:", "2020-05-08T16:27:57.000Z": "I will continue to give New Yorkers the facts, whether the facts are pretty or ugly.\n\nEvery one of us, through our actions, will shape the course of this pandemic.\n\nThat's why it's so important to know the facts and stay informed.", "2020-05-08T16:18:04.000Z": "There have been 73 reported cases in NY of children getting severely ill with symptoms similar to Kawasaki disease and toxic shock-like syndrome.\n\nOn Thursday, a 5-year-old boy passed away from these complications, believed to be caused by COVID-19.\n\nDOH is investigating.", "2020-05-08T16:07:16.000Z": "We lost 216 New Yorkers to COVID-19 yesterday.\n\nWe know the pain is felt by their families and we share this loss.", "2020-05-08T16:01:01.000Z": "Closed captioning and ASL interpretation is available at The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-08T16:00:01.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-08T14:48:31.000Z": "I will be giving my daily #Coronavirus briefing and making an announcement at 12:00PM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-08T00:55:39.000Z": "\"Let them know the truth, and the country is safe.\"\n-Abraham Lincoln", "2020-05-07T23:41:09.000Z": "So good. #WearAMask Quote Tweet John Walsh @itsJohnWalsh My #NewYorkTough PSA for @NYGovCuomo  #WearAMask We need to find these masks a face! #NewYork it is so important to wear a mask in public!", "2020-05-07T21:38:38.000Z": "Tell your little brother thank you, but I just tell the facts. You know who has a really hard job? The nurses, doctors, transit workers, first responders and all our essential workers. They showed up so we could stay home. Quote Tweet Shyanne Garcia @ShyanneGarcia18 So my little brother who's in the first grade had a homework question saying \"If you could be anybody for a day, who would you be?\" & this kid says I wanna be Andrew Cuomo, because he has a really hard job right now and I want to be like him\" @NYGovCuomo", "2020-05-07T19:40:07.000Z": "So grateful I got the chance to meet and thank medical staff at Westchester Medical Center in Valhalla.\n\nWe can thank them every day & it still will never be enough. They are the heroes who have carried us through this crisis. #NewYorkTough (Photo by @SethEHarrison )", "2020-05-07T17:58:48.000Z": "Wear a mask so Kiara can get back on the court Quote Tweet Kiara Anglin @KiaraAnglin Please wear your masks so I can get back on the court  #NewYorkTough  @NYGovCuomo", "2020-05-07T17:01:04.000Z": "Wash your hands with soap. Wear a mask in public. Don't touch your face. It could literally save your life. Quote Tweet Nate Silver @NateSilver538 New York's serology studies have actually found slightly *lower* rates of COVID-19 among healthcare workers than in the general population. Suggests that PPE and masks help a lot!", "2020-05-07T16:48:54.000Z": "What New Yorkers are doing is working.\n\nWe have flattened the curve. We have lowered the infection rate.\n\nWe must stay the course.\n\n\"If you're going through hell, keep going.\"", "2020-05-07T15:58:48.000Z": "At a time when people are hungry, it makes no sense for food or milk to go to waste.\n\nWe launched a program to buy excess agricultural products and donate them to food banks.\n\nWe will bring products from 2,100 Upstate farms to 50 food banks, providing 20,000 households with food.", "2020-05-07T15:52:40.000Z": "Today we are banning late fees and missed payments fees during the eviction moratorium period.\n\nWe are also allowing renters facing COVID-related hardship to use their security deposit as payment and repay the deposit over time.", "2020-05-07T15:51:03.000Z": "#BREAKING : New York State will extend the moratorium on evictions for those facing COVID-related hardship for an additional 60 days - until August 20.", "2020-05-07T15:37:20.000Z": "\"Facts are stubborn things; and whatever may be our wishes, our inclinations, or the dictates of our passions, they cannot alter the state of facts and evidence.\" \n-John Adams", "2020-05-07T15:33:57.000Z": "Closed captioning and ASL interpretation is available at The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-07T15:33:42.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-07T15:02:39.000Z": "Then and now.  It's incredible how quickly time passes by...", "2020-05-07T13:45:41.000Z": "I will be giving my daily #Coronavirus briefing and making an announcement at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-06T21:36:54.000Z": "Happy #NationalNursesDay from @jfreewright and his 90-year-old Aunt Na, a much loved nurse who retired after 30+ years of care and service.", "2020-05-06T18:14:06.000Z": "Teachers are heroes & nothing could ever replace in-person learning--COVID has reinforced that\n\nThe re-imagine education task force focuses on using technology most effectively while schools are closed & to provide more opportunities to students no matter where they are Quote Tweet Jim Malatras @jimmalatras As @NYGovCuomo said, the goal is to reopen our schools. It must be done protecting health & safety. Virtual learning must bridge the gap & supplement when schools reopen but equity is an issue. Many issues so experts, educators, students & parents all will inform the process.", "2020-05-06T16:15:18.000Z": "We lost 232 New Yorkers yesterday to #Coronavirus . \n\nThat is 232 families that are suffering today.\n\nYes, we have made great progress in bringing down hospitalizations.\n\nBut it is completely wrong to say that the pandemic is \"over.\"", "2020-05-06T16:06:24.000Z": ". @JetBlue is donating a pair of round-trip flights to 100,000 medical personnel and nurses to honor their efforts, beginning with 10,000 NY medical professionals.\n\nWhat a great way to thank so many of our frontline heroes. #NationalNursesDay", "2020-05-06T16:04:17.000Z": "We must find new, innovative solutions that help the people most in need. @EricSchmidt will serve as chair of a blue-ribbon commission that will reimagine how our state can Build Back Better.", "2020-05-06T15:58:44.000Z": "When it is safe to reopen, NYS will set the bar high.\n\nWe have the opportunity to Build Back Better.\n\nWe can't waste the many lessons of this pandemic.", "2020-05-06T15:34:20.000Z": "Closed captioning and ASL interpretation is available at The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-06T15:33:54.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-06T13:41:29.000Z": "I will be giving my daily #Coronavirus briefing and making an announcement at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-06T12:55:11.000Z": "To all the nurses who do the tough work tirelessly and bravely: You deserve our recognition every day. You are our heroes on the frontline.\n\nOur nurses are the best of us. You heal and comfort us. New York thanks you. #NationalNursesDay", "2020-05-06T01:05:33.000Z": "Congratulations Dennis. Your kindness continues to shine and inspire. Kansas farmer who gave New York governor N95 mask conferred a bachelor's degree by K-State, Gov.... TOPEKA, Kan. (KSNW) - A Kansas farmer took the national spotlight about two weeks ago for his kind act, but now he's being honored at home. Dennis Ruhnke became known when New York Gove ksn.com", "2020-05-05T17:27:40.000Z": "There is no dollar figure to a human life.\n\nNew York will reopen (by region) when it is safe to do so.", "2020-05-05T17:17:09.000Z": "Don't shake hands. Avoid any direct contact. GIF", "2020-05-05T17:16:24.000Z": "Keep six feet of distance from others in public.\n\n(If it's impossible to do so, you MUST wear a mask or face covering.) GIF", "2020-05-05T17:14:40.000Z": "Wash your hands with soap often - for at least 20 seconds. GIF", "2020-05-05T17:11:20.000Z": "How soon we reopen will be determined by how fast the infection rate goes down.\n\nDo your part to reduce the spread.", "2020-05-05T16:21:10.000Z": "Government has a role to play but each of us does too.\n\nWear a mask - it's the right thing to do. \n\nHelp us tell New Yorkers why. Submit a video and we'll use the winning video to get the point across. \n\nLearn more: Wear A Mask New York Ad Contest: Winner Announced Watch the winning video that will be used for public service announcements. coronavirus.health.ny.gov", "2020-05-05T15:53:28.000Z": "As we prepare to reopen we have the opportunity to reimagine and build back our education system better.\n\nWe will work with the @gatesfoundation and develop a blueprint to do this.", "2020-05-05T15:40:38.000Z": "Look at the data. Follow the science. Listen to the experts.  \n\nBe smart.", "2020-05-05T15:34:53.000Z": "Closed captioning and ASL interpretation is available at The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-05T15:34:37.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-05T13:59:38.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-05T00:08:35.000Z": "The best way to keep each other safe is to be responsible and wear a mask in public.\n\nThis is about respect.", "2020-05-04T23:09:34.000Z": "To join in the 7pm nightly cheer, each night I will share an image of some of our frontline heroes.\n\nIn honor of #InternationalFirefightersDay , today's image is of @FDNY Engine 40 & Ladder 35.\n\nNew Yorkers thank you for your service.\n\n(Photo credit: @aliyanaumoff )", "2020-05-04T18:47:26.000Z": "Government competence can be the difference between life and death.", "2020-05-04T16:28:40.000Z": "New Yorkers have stepped up and together we have saved lives.\n\nEveryone has a role to play here. #NewYorkTough", "2020-05-04T16:14:06.000Z": "Some regions of New York are closer to reopening than others.\n\nCurrently, no region meets all the requirements necessary to reopen safely and securely.\n\nThere is a lot of work to do.", "2020-05-04T16:12:46.000Z": "It's disrespectful to our frontline workers -⁠ and to your neighbors -⁠ not to wear a mask in public when you can't socially distance.\n\nWhy? Because you don't wear a mask to protect yourself. You wear one to protect others.", "2020-05-04T16:00:35.000Z": "", "2020-05-04T15:48:31.000Z": "Reopening our state is far more complicated than shutting down was.\n\nIf you open too quickly you can immediately have a backlash.\n\nOther countries have seen this.\n\nWe must be smart.", "2020-05-04T15:46:14.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-04T13:58:19.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-04T13:12:39.000Z": "Great story. These Albany small business owners switched to making 3D-printed masks - and are giving them away to the community. \n\nWear a mask in public! #NewYorkTough Quote Tweet Spectrum News Albany @SPECNewsAlbany In normal times, Yamaguchie on Lark Street sells hand made crafts, clothing, and jewelry, but these aren't normal times. http:// specne.ws/f2EXW3?cid=twi tter_SPECNewsAlbany ", "2020-05-03T22:55:12.000Z": "Nothing says thank you like wearing a mask.", "2020-05-03T16:58:08.000Z": "Reminder:", "2020-05-03T16:47:42.000Z": "Want to know the best way to honor our brave health care workers some of whom literally gave their lives to save others?\n\nAct responsibly and wear a mask outside.", "2020-05-03T16:29:28.000Z": "#BREAKING : NY, NJ, CT, PA, DE, RI and MA are launching a regional purchasing consortium to jointly procure PPE, tests, ventilators and other medical equipment.\n\nThis will increase our market power and help prevent price-gouging.\n\nStates are stronger when we work together.", "2020-05-03T16:25:38.000Z": "NEW: New York State will require all hospitals to have on hand a 90-day supply of PPE at quantities sufficient to meet the rate of use during the worst of this crisis.", "2020-05-03T16:20:54.000Z": "\"Those who don't learn from history are doomed to repeat it.\"\n\nThe 1918 Influenza Epidemic lasted over 10 months and came in three waves.\n\nThe 2nd wave was worse than the first wave. \n\nWe must be cautious. The war isn't won yet.", "2020-05-03T16:07:42.000Z": "Closed captioning and ASL interpretation is available at The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-03T16:06:36.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-03T14:29:48.000Z": "I will be giving my daily #Coronavirus briefing at 12:00PM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-03T13:13:19.000Z": "Wear a mask in public when you can't maintain social distancing.\n\nWarm weather doesn't mean the rules no longer apply.\n\nDo it to protect the people around you and because it's the law.", "2020-05-03T02:17:36.000Z": "Thank you to the government and people of Qatar from the people of New York. We are grateful for your assistance in helping send critical supplies and for the donation of aid.", "2020-05-02T15:19:31.000Z": "The MTA will disinfect every subway car everyday. Stations & commuter train cars will be cleaned daily as well.\n\nThis has never been done before and it's an extraordinary effort.\n\nThe riding public deserves this. Essential workers deserve this. Transit workers deserve this.", "2020-05-02T15:16:50.000Z": "NEW: New York State will distribute 7 million more cloth masks across the state to most vulnerable New Yorkers.\n\nThe masks will be given to nursing homes, lower-income communities in NYC and NYCHA residents.", "2020-05-02T15:14:34.000Z": "NYC overall: 19.9% positive for antibodies.\n\nBronx: 27.6%\nBrooklyn: 19.2%\nManhattan: 17.3%\nQueens: 18.4%\nStaten Island: 19.2%\n\n(Results are weighted.)", "2020-05-02T15:12:35.000Z": "Today we are releasing additional preliminary results from our statewide antibody survey.\n\nThe survey shows that 12.3% of the state population is positive for COVID-19 antibodies, from an expanded sample size of 15,000.\n\n(Results are weighted.)", "2020-05-02T15:11:30.000Z": "We are in uncharted waters.\n\nBut that doesn't mean we are sailing blind.\n\nWe are constantly looking at the data to chart our course.", "2020-05-02T14:59:50.000Z": "Closed captioning and ASL interpretation is available at The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-02T14:58:57.000Z": "In Queens giving my daily briefing on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo In Queens giving my daily briefing on #Coronavirus. Watch Live: pscp.tv", "2020-05-02T14:28:10.000Z": "You know the drill:", "2020-05-02T13:07:31.000Z": "I will be giving my daily #Coronavirus briefing at 10:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-01T23:08:57.000Z": "Our essential workers have been delivering 1000% since day one of this crisis. Join me in saying: Thank You and Good Job.\n\nWatch with sound on", "2020-05-01T20:38:48.000Z": "Socially distanced. Spiritually connected.", "2020-05-01T16:03:10.000Z": "This is a mental heath crisis.\n\nNY wants you to know: You are not alone. \n\nIf you need support, call the New York State Emotional Support Hotline at 1-844-863-9314. #MentalHealthAwarenessMonth", "2020-05-01T15:57:53.000Z": "NEW: NYS is directing insurers to waive all cost sharing/copays/deductibles for mental health services for essential workers through this crisis.\n\nOur frontline heroes are risking their health AND mental health every day. Cost shouldn't be a barrier for them to get help.", "2020-05-01T15:48:55.000Z": "#BREAKING : Given the current situation, K-12 schools and college facilities will remain closed for the rest of the academic year and will continue to provide distance learning.\n\nThis is the best course of action to keep students, educators and staff safe.", "2020-05-01T15:42:16.000Z": "It's cause and effect.\n\nOur actions determine our future.\n\nTogether we changed the course of this virus.", "2020-05-01T15:36:09.000Z": "Closed captioning and ASL interpretation is available at The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-01T15:35:54.000Z": "Holding a briefing with updates on #Coronavirus . Watch Live: Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-01T14:06:44.000Z": "I will be giving my daily #Coronavirus briefing at 11:30AM ET. Watch here: The Official Website of New York State The official website of the State of New York. Find information about state government agencies and learn more about our programs and services. ny.gov", "2020-05-01T00:46:20.000Z": "One of the greatest concerns of the pandemic is making sure all New Yorkers have access to food. No New Yorker should go to bed hungry. \n\nTo find a food pantry that services your county, visit http:// ny.gov/foodbanks", "2020-04-30T18:28:45.000Z": "I will be appearing on the @TheEllenShow today. Tune in.", "2020-04-30T16:14:17.000Z": "This is an extraordinary effort and requires us all to work together.\n\nThis will be a joint MTA/State/City partnership.\n\nI thank @NYCMayor for helping meet this challenge alongside us.", "2020-04-30T16:09:06.000Z": "I asked the MTA to develop a plan to accomplish this.\n\nThey will do it by stopping MTA train service between 1am - 5am.\n\nThere will be alternative transportation during this time with buses, for-hire vehicles, at NO cost to essential workers.", "2020-04-30T16:04:01.000Z": "It is our obligation to do everything we can to keep our essential workers safe.\n\nThe MTA stepped up to clean trains and buses every 72 hours (a massive undertaking).\n\nNow, we must clean and disinfect every 24 hours.\n\nThis is unprecedented, but we must do it."}