{"2020-07-29T21:08:48.000Z": "Be sure to join @CommerceND for tomorrow's briefing on the Economic Resiliency Grant, which is designed to restore consumer confidence and support businesses in their efforts to slow the spread of COVID-19. Register here: https:// belegendary.link/ERGBusiness-Br ief-0730  Quote Tweet North Dakota Dept. of Commerce @CommerceND Commerce will lead a four-part Special Business Briefing to provide step-by-step instruction on the Economic Resiliency Grant (ERG) application process on July 30, at 11 a.m. (CST). Space is limited, follow the link to apply today! https:// belegendary.link/ERGBusiness-Br ief-0730   #NDSmartRestart", "2020-07-29T19:15:29.000Z": "Let's go BIG on fighting COVID-19, North Dakota! Protect your herd, your flock and your community.\n\nYou can make a difference: Maintain six feet of distance, wear a mask when appropriate and wash your hands often. #InThisTogetherND", "2020-07-28T23:40:46.000Z": "Today we announced the formation of the Burleigh-Morton COVID-19 Task Force to focus efforts on slowing the spread in the Bismarck/Mandan metro and surrounding area, which is home to more than one-third of ND's active cases. Burgum announces formation of Burleigh-Morton COVID-19 Task Force as active cases climb Gov. Doug Burgum announced the formation of a task force to prevent and mitigate the spread of COVID-19 in Burleigh and Morton counties including the Bismarck-Mandan metro area, which have seen sharp... governor.nd.gov", "2020-07-28T20:30:27.000Z": "Today's COVID-19 press briefing will begin shortly. Watch live below. Quote Tweet ND Department of Health @NDDOH July 28th, 2020 COVID-19 Press Conference - ND Joint Information Center https:// pscp.tv/w/ce8sljFsWkVw b1dsbm5Pam58MVJER2xya1ZwT1J4TBzViW6JpYH-InuSvwyUHrVLYxHPmpBNep-dh1_yt1UT ", "2020-07-27T19:46:05.000Z": "We're looking forward to welcoming virtual attendees for the fourth annual Recovery Reinvented on Oct. 28! This year's event will feature conversations on virtual recovery support services, mental health & recovery-friendly workplaces.\n\nVisit http:// recoveryreinvented.com for details! Quote Tweet First Lady Kathryn Burgum @FirstLadyND For the first time ever, #RecoveryReinvented will be an online, interactive experience to be held on October 28!\n\nTo learn more about @Recovery_ND , register for the event, share a personal story, or nominate someone for a #RecoveryChampion Award visit http:// RecoveryReinvented.com .", "2020-07-24T17:24:24.000Z": "Between Mar. 31-July 24, 1,182 individuals tested positive for COVID-19 after a prior negative test. That's over 21 percent of our positive cases. This is why serial testing is so important, and we're committed to continuing to grow ND's strong COVID-19 testing program.", "2020-07-23T05:16:12.000Z": "As I've long said, all North Dakotans deserve to be treated equally and live free of discrimination. There's no place for the hurtful and divisive rhetoric in the NDGOP resolutions. 1/2", "2020-07-22T20:28:16.000Z": "This week's COVID-19 press briefing begins at approximately 3:30 p.m. CT. We'll discuss testing, higher education and business resources. Tune in below! Quote Tweet ND Department of Health @NDDOH July 22nd, 2020 COVID-19 Press Conference - ND Joint Information Center https:// pscp.tv/w/cedDljFsWkVw b1dsbm5Pam58MWt2S3BlbE9xWlFHRQHpuTNyh2K28fXUhOrhchWxdU0TAD8NXiTprC6HWDoe ", "2020-07-21T23:52:28.000Z": "Thanks to the 1,300+ amazing educators, administrators, elected officials, parents and stakeholders who made this year's Summit on Innovative Education a success! Check out this recap of speakers, award recipients and North Dakota's opportunity to lead. Burgum highlights progress, technology as a tool during fourth annual Summit on Innovative Education Gov. Doug Burgum and state Superintendent Kirsten Baesler hosted the fourth annual Governor's Summit on Innovative Education, highlighting the progress being made in North Dakota toward personalized,... governor.nd.gov", "2020-07-21T17:54:52.000Z": "Terrific morning session at the Governor's Summit on Innovative Education! Join us for an afternoon filled with breakout sessions and keynotes from @KhanAcademy founder Sal Khan and @FIRSTweets founder Dean Kamen. https:// ndgovernorssummit.com  #InnovativeND", "2020-07-21T13:09:32.000Z": "Kicking off the fourth annual Governor's Summit on Innovative Education at 8:30 a.m. CT! Join today's conversation using #InnovativeND and watch live at the link below. 2020 ND Governor's Summit on Innovative Education ndgovernorssummit.com", "2020-07-20T22:14:38.000Z": "The @NDDOH reported a record number of active cases and hospitalizations today, and the rise in active cases is outpacing our growth in testing.\n\nKeep yourself, your family and your community healthy. Wash your hands, wear a mask when appropriate and stay six feet apart.", "2020-07-19T20:13:05.000Z": "In less than two days, 1,000+ participants will engage in a day of inspiration for the future of education in North Dakota.\n\nEducators: your participation can be counted toward a graduate credit. Get your ticket and learn how to register for credits: 2020 Governor's Summit on Innovative Education Join Gov. Burgum and stakeholders across North Dakota to discuss education, innovation and transformation in this virtual summit. eventbrite.com", "2020-07-18T23:33:32.000Z": "Rep. John Lewis was a lion of the civil rights movement whose example of courageous leadership continues to inspire the pursuit of racial equality for all Americans. North Dakotans are encouraged to fly their flags at half staff in his honor. My statement: Burgum directs flags flown at half-staff in honor of civil rights leader Rep. John Lewis Gov. Doug Burgum has directed government agencies to fly the United States and North Dakota flags at half-staff through today, July 18, and encourages North Dakotans to do the same at their homes and... governor.nd.gov", "2020-07-17T20:47:46.000Z": "Join us for a conversation with @khanacademy founder Sal Khan about the upcoming Governor's Summit on Innovative Education! Register for Tuesday's event here: https:// eventbrite.com/e/2020-governo rs-summit-on-innovative-education-registration-105976669070  Quote Tweet Chris Berg @chrisbergpov ND Governor's Summit on Innovative Education w/ ND Gov @DougBurgum and founder of Khan Academy @salkhanacademy  https:// pscp.tv/w/ceCykDM0MTE2 NHwxWXFHb1JCbXZ6Ykt2pskx0-fAsu_f0_PuTCx46abXoP8kIYHzUX0S5KKEVyg= ", "2020-07-17T20:11:28.000Z": "Joined @WOYMRadio to discuss ND's efforts to combat COVID-19 and what it'll take to beat this pandemic and avoid going backward. It's up to all of us to follow #NDSmart guidelines: wash your hands, wear a mask when appropriate and stay six feet apart. Masks, the Economy and North Dakota with Gov. Doug Burgum Governor Doug Burgum joins What's On Your Mind for a chat about everything North Dakota. am1100theflag.com", "2020-07-16T19:24:43.000Z": "Just 5 days left until the 2020 Governor's Summit on Innovative Education! In addition to virtual tickets, a limited number of in-person seats are now available to join us at the Heritage Center, where #NDSmart guidelines will be in effect. Register today! 2020 Governor's Summit on Innovative Education Join Gov. Burgum and stakeholders across North Dakota to discuss education, innovation and transformation in this virtual summit. eventbrite.com", "2020-07-15T21:00:22.000Z": "Modernizing our roads, pipelines, flood protection & other critical infrastructure is crucial to the safety and economic success of ND & the U.S., and such projects deserve a timely, efficient and effective environmental review. My full statement on NEPA: Burgum welcomes release of modernized NEPA process to streamline infrastructure permitting BISMARCK, N.D. - Gov. Doug Burgum released a statement after the White House's Council on Environmental Quality (CEQ) released its final rule modernizing the National Environmental Policy Act (NEPA)... governor.nd.gov", "2020-07-15T18:16:54.000Z": "Our ongoing work to strengthen state-tribal partnerships continued today with a tax summit with MHA Nation. Thanks to MHA Chairman Mark Fox, Lt. Gov. @BrentSanfordND , Tax Commissioner Ryan Rauschenberger & more for the productive dialogue as we explore new areas of collaboration!", "2020-07-15T15:00:25.000Z": "Excited to have Dean Kamen keynote at next week's Governor's Summit on Innovative Education! Dean is the founder of @FIRSTweets , an organization dedicated to motivating the next generation to understand, use and enjoy science and technology.\n\nRegister now! https:// eventbrite.com/e/2020-governo rs-summit-on-innovative-education-registration-105976669070 ", "2020-07-14T22:46:44.000Z": "Today, State Supt. Kirsten Baesler & I released the K-12 Smart Restart guidelines to help ND school districts plan for reopening this fall, provide the highest-quality education and protect the health and safety of students, staff, families & communities. Burgum, Baesler release K-12 Smart Restart guidelines for schools to assist with fall reopening... Gov. Doug Burgum and State Superintendent Kirsten Baesler released the K-12 Smart Restart guidelines to help North Dakota school districts plan for reopening this fall to provide a safe, high-quality... governor.nd.gov", "2020-07-14T20:28:32.000Z": "Join us for today's COVID-19 press briefing at 3:30 p.m. CT with @NDDPI State Superintendent Kirsten Baesler. Quote Tweet ND Department of Health @NDDOH July 14th, 2020 COVID-19 Press Conference - ND Joint Information Center https:// pscp.tv/w/cdy3mzFsWkVw b1dsbm5Pam58MWt2SnBlQnZOa294RamYWBb16v3pNPe_nE0g7KNbcsd2AX2NcDjr289hUZ-r ", "2020-07-13T20:05:00.000Z": "While our active case numbers in ND continue to climb, our positive test rate remains among the lowest in the nation.\n\nIt's important to follow #NDSmart guidelines-including washing your hands, wearing a mask and keeping appropriate distance-to slow the spread of COVID-19. Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs report 4,564 completed tests today for COVID-19 with 108 new positive cases, bringing the statewide total to 4,442. NDDoH reports no new deaths.\n\nState & private labs have reported 233,097 total completed tests.\n\n3,653 ND patients are recovered.", "2020-07-10T05:31:28.000Z": "Grateful to @POTUS & @fema for declaring a major disaster for spring flooding in ND, recognizing the hardship caused by significant flood damage to roads, bridges and culverts in counties already heavily burdened by recovery costs from 2019 flooding. https:// governor.nd.gov/news/burgum-th anks-trump-administration-granting-major-disaster-declaration-spring-flooding-nd ", "2020-07-09T17:03:01.000Z": "Excited to announce innovative teaching, learning and leadership consultant @gcouros as a keynote speaker at the 2020 Governor's Summit on Innovative Education on July 21, along with @khanacademy founder Sal Khan. To register for this virtual event, visit  https://2020inn ovativeeducationsummit.eventbrite.com", "2020-07-09T16:01:26.000Z": "Great discussion with the @NDCornGrowers about value-added agriculture, planting and harvest challenges, COVID-19 relief for growers and ethanol producers, and the importance of supporting ag research and animal agriculture. ND farmers feed the world and do it better than anyone!", "2020-07-08T20:46:36.000Z": "Join us now for this week's COVID-19 press briefing! Quote Tweet ND Department of Health @NDDOH July 8th, 2020 COVID-19 Press Conference - ND Joint Information Center https:// pscp.tv/w/cdTOmzFsWkVw b1dsbm5Pam58MUJkR1luTFdkV1lKWFEsMdZiLIYETYShGZXpVbQmV9YX6ESb1UepYAeIax4V ", "2020-07-07T20:53:52.000Z": "Register for a business briefing call this Thursday, July 9, at 11 a.m. CT with @CommerceND and @nodakchamber ! Learn how ND businesses and nonprofits can apply for up to $50,000 in funding through the Economic Resiliency Grant. \n\nDetails & registration: https:// commerce.nd.gov/news/Commercea nnouncesspecialBusinessBriefingcalltointroducetheEconomicResiliencyGrantERGandapplicationprocess/ ", "2020-07-06T21:05:13.000Z": "North Dakota's educators are embracing innovative practices to prepare our students for success. Help us recognize their efforts by submitting a nomination for the #InnovativeND Awards!  http://2020inn ovativeeducationsummit.eventbrite.com July 14: nominations due\nJuly 21: recipients announced at the summit", "2020-07-04T12:32:28.000Z": "Happy Independence Day, North Dakota!", "2020-07-03T16:22:26.000Z": "Thanks to Trooper Mlynar and all of the outstanding members of the @NDHighwayPatrol for their work to keep our roads safe!\n\nThis holiday weekend, remember to wear your seat belt, drive sober and distraction-free, and follow posted speed limits. #VisionZeroND Quote Tweet North Dakota Highway Patrol @NDHighwayPatrol Congratulations to #NDHP Trooper Brett Mlynar on being selected as the 2019 Trooper of the Year. His dedication and commitment to the citizens of ND are exceptional! https:// bit.ly/31DwDuT", "2020-07-02T18:33:46.000Z": "The success of our rural communities is crucial for the future of ND and the western U.S. @WestGov just released the \"Reimagining the Rural West\" special report, which includes policy recommendations to support opportunity, connectivity and community. Reimagining the Rural West Initiative Special Report delivers ideas to re-energize communities As the population of the West concentrates in metropolitan areas, rural communities face increasing challenges to provide the services, infrastructure and opportunities needed to thrive. At the same... westgov.org", "2020-07-01T18:59:04.000Z": "Happy Canada Day to our friends to the north! We're grateful to have neighbors like @PremierScottMoe and @BrianPallister , who have been excellent partners to work with across the border.", "2020-07-01T15:29:58.000Z": "We're accepting nominations for the #InnovativeND Awards, which will be presented during the summit. Learn about the categories and how to submit your nomination on our website. Kahn Academy founder announced as speaker as registration opens for Summit on Innovative Education Gov. Doug Burgum encouraged North Dakotans to register for the 2020 Governor's Summit on Innovative Education, announcing Khan Academy founder Sal Kahn as a featured speaker. The summit will take... governor.nd.gov", "2020-07-01T15:29:57.000Z": "Sal Khan, the founder of @KhanAcademy , will join us on July 21 as a speaker at the 2020 Governor's Summit on Innovative Education!\n\nRegister for your ticket today!  http://2020inn ovativeeducationsummit.eventbrite.com", "2020-07-01T14:49:30.000Z": "The #USMCA goes into effect today, which is terrific for farmers, business owners, innovators & more. This is a new era of trade & strengthened relationships w/ ND's largest trading partners. Thanks to @POTUS , Sens. Hoeven & Cramer and Rep. Armstrong for their work on this deal.", "2020-06-29T21:12:53.000Z": "Calling North Dakota's young artists! In celebration of the 100th anniversary of the 19th Amendment, @FLOTUS is presenting a student art exhibit in honor of the women's suffrage movement. Submissions are due by July 6! Details here: https:// whitehouse.gov/briefings-stat ements/building-movement-americas-youth-celebrate-100-years-womens-suffrage/ ", "2020-06-28T17:20:01.000Z": "At this year's Summit on Innovative Education, we'll discuss the future of education in North Dakota, including how to create safe environments for students and educators to thrive when school starts again this fall. Register for your free ticket today! 2020 Governor's Summit on Innovative Education Join Gov. Burgum and stakeholders across North Dakota to discuss education, innovation and transformation in this virtual summit. eventbrite.com", "2020-06-26T20:29:52.000Z": "Widespread testing is essential to our ND Smart Restart. Thanks to the @NDDOH , @NDNationalGuard , local public health and private providers, drive-through testing events and static sites are widely available. Find your nearest provider here: Where to get a COVID-19 Test health.nd.gov", "2020-06-26T20:29:51.000Z": "As we approach one of the busiest travel weeks of the year, we all need to remember: the COVID-19 pandemic is not over.\n\nWhile North Dakota is well-positioned to handle a potential surge in cases, it's essential we follow #NDSmart guidelines to prevent such a surge. Thread:", "2020-06-25T23:05:23.000Z": ". @CommerceND just announced $69 million in grant funding to help ND businesses!\n\nThe Economic Resiliency Grant Program will help ensure businesses are equipped to mitigate the spread of COVID-19 and keep workers and customers safe. Learn more: North Dakota Department of Commerce announces Economic Resiliency Grants The North Dakota Department of Commerce announced that the agency has developed the Economic Resiliency Grant (ERG) Program which was approved at today's Budget Section hearing to assist businesses... ndresponse.gov", "2020-06-24T19:58:42.000Z": "The 2020 Governor's Summit on Innovative Education is less than a month away! Register for your free ticket today to join national and local leaders in a discussion on the future of education in North Dakota. 2020 Governor's Summit on Innovative Education Join Gov. Burgum and stakeholders across North Dakota to discuss education, innovation and transformation in this virtual summit. eventbrite.com", "2020-06-23T23:43:02.000Z": "If your vehicle registration or driver's license expired on or after March 1, you have until August 31 to renew! Learn how to make your renewal appointment here: ​​​​​​​Burgum signs order extending driver license renewals, vehicle registration until Aug. 31 Gov. Doug Burgum signed an executive order that extends the renewal date for motor vehicle registrations and driver licenses that expired on or after March 1, 2020. The new renewal date is Aug. 31,... governor.nd.gov", "2020-06-23T22:30:58.000Z": "In recognition of the approximately 16,000 individuals working in long-term care facilities across North Dakota, today is Silver Linings Day! Thanks for the care and compassion you provide for the nearly 10,000 residents who count on you to help keep them healthy and safe.", "2020-06-23T20:23:01.000Z": "Join us for this week's COVID-19 press briefing at 3:30 p.m. CT. Quote Tweet ND Department of Health @NDDOH June 23rd, 2020 COVID-19 Press Conference - ND Joint Information Center https:// pscp.tv/w/ccEIFjFsWkVw b1dsbm5Pam58MVlwS2tOcnJaa2p4aloENAHygvJXT1UzknE9-i49gLBwups8nOCt4odUo1Jg ", "2020-06-22T20:50:42.000Z": "Kathryn and I extend our deepest condolences and heartfelt prayers to the family and friends of Sister Thomas Welder, including the Benedictine Sisters and the entire University of Mary community. Our full statement: https:// governor.nd.gov/news/burgum-st atement-passing-sister-thomas-welder ", "2020-06-21T13:06:04.000Z": "Incredibly grateful for the blessing of being a dad to Joe, Jesse and Tom and for all that I learn from them each and every day. Happy Father's Day to dads of all ages!", "2020-06-19T19:54:36.000Z": "Save the date! The 2020 Governor's Summit on Innovative Education will now take place virtually on July 21. Registration information coming soon!", "2020-06-18T21:08:01.000Z": "The North Dakota Emergency Commission today voted unanimously to direct over $401M in federal funding to the state's COVID-19 response & recovery efforts, aimed at providing the greatest positive impact to ND citizens, businesses and governments. Details: ND Emergency Commission approves additional $406M in federal funds for COVID-19 response and... The North Dakota Emergency Commission voted unanimously to direct over $406 million in federal funding to the state's COVID-19 response and recovery efforts, with the majority of the money again... governor.nd.gov", "2020-06-18T19:49:11.000Z": "Congratulations to ND Grain Growers Association President Dennis Haugen on his appointment to the @EPA Farm, Ranch, and Rural Communities Committee! Great to have a voice at the table who knows how federal regulations affect North Dakota's ag producers. EPA Administrator Wheeler Appoints New Members to the Farm, Ranch, and Rural Communities Federal... EPA News Release: EPA Administrator Wheeler Appoints New Members to the Farm, Ranch, and Rural Communities Federal Advisory Committee epa.gov", "2020-06-17T21:52:29.000Z": "Friday has been proclaimed Juneteenth Celebration Day in North Dakota. We encourage North Dakotans to observe and learn more about this day commemorating the end of slavery, as we renew our commitment to the ideals of democracy and liberty, justice and equality for all citizens.", "2020-06-17T15:49:35.000Z": "Free public COVID-19 testing events being held this week: State Capitol in Bismarck, 9am-6pm, June 17 Fargodome in Fargo, 10am-6pm, June 18-19 State Fairgrounds in Minot, 8am-4pm, June 19", "2020-06-17T15:49:34.000Z": "Testing for COVID-19 is a key element of the #NDSmartRestart , and the team at @NDDOH , @NDNationalGuard and local public health are instrumental in making those tests available. Thanks to all who are coming out to get tested at today's free event at the Capitol, open until 6 p.m.", "2020-06-16T20:24:31.000Z": "Join us for this week's COVID-19 press briefing at 3:30 p.m. CT. Quote Tweet ND Department of Health @NDDOH June 16th, 2020 COVID-19 Press Conference - ND Joint Information Center https:// pscp.tv/w/cbfNmTFsWkVw b1dsbm5Pam58MW1yR21FcE5YTEJHeYBH-DruueyvFePX1ET656ybY8dVO69mBf3iCYD8TOL9 ", "2020-06-15T22:59:50.000Z": "Catch up on all of the latest news in this week's Dakota Download. Dakota Download 6-14-2020 See the story spark.adobe.com", "2020-06-13T18:07:17.000Z": "Later this year, the @LamoureuxTwins will become the 45th & 46th inductees into the Theodore Roosevelt Rough Rider Award Hall of Fame.\n\nDiscover the award's history and learn more about the North Dakotans who have been recognized over the past six decades: https:// governor.nd.gov/theodore-roose velt-rough-rider-award ", "2020-06-12T21:43:44.000Z": "Congratulations to the Valley City Senior Choir and the Fargo Davies Wind Ensemble for being named this year's Governor's Official Band and Choral Programs! Burgum announces 2020 Governor's Band and Chorus programs from Valley City and Fargo Gov. Doug Burgum announced that the Valley City High School Senior Choir and Fargo Davies Wind Ensemble have been selected as the 2020 Governor's Official State Band and Choral Programs. governor.nd.gov", "2020-06-11T21:03:29.000Z": "From backyard games in Grand Forks to the world's biggest stage, the @LamoureuxTwins became the first two North Dakotans to bring home Olympic gold. Honored to name them the next recipients of the Theodore Roosevelt Rough Rider Award, ND's highest honor. Burgum names Olympic gold medal-winning Lamoureux twins as 45th and 46th recipients of North... Gov. Doug Burgum announced Olympic gold medalists and equity advocates Monique Lamoureux-Morando and Jocelyne Lamoureux-Davidson as the 45th and 46th recipients of the North Dakota Theodore Roosevelt... governor.nd.gov", "2020-06-11T00:32:05.000Z": "The @NDDOH is partnering with the @cityoffargo and @FCPH to offer COVID-19 testing events tomorrow and Friday. Here's what you need to know: https:// fargond.gov/news-events/ci ty-news-room/post-detail?id=5ee0f9b7e404cd5c15359e82  Similar testing events are in the works for Bismarck, Grand Forks and Minot and will be announced soon. Quote Tweet ND Department of Health @NDDOH COVID-19 TESTING will be open to the general public on Thursday, June 11 & Friday, June 12, from 10am to 6pm. Outdoor drive-up testing will take place in the west parking lot of the FARGODOME, in partnership with the NDDoH, the ND National Guard & Fargo Cass Public Health.", "2020-06-10T20:28:59.000Z": "Watch today's COVID-19 update at 3:30 p.m. CT. Quote Tweet ND Department of Health @NDDOH June 10th, 2020 COVID-19 Press Conference - ND Joint Information Center https:// pscp.tv/w/ca_klzFsWkVw b1dsbm5Pam58MXlwSmR3UlJPcXZHVynpeewIdoWXzIcUitkr_FMbU0VEmyKK5hDl-OXtn6ru ", "2020-06-09T20:03:05.000Z": "Congratulations to the 14 startups selected for @PlugandPlayTC North Dakota's first batch! Looking forward to watching these innovators leverage technology to change the future of agriculture. Plug and Play North Dakota Accepts 14 Startups for its First Batch plugandplaytechcenter.com", "2020-06-08T00:25:56.000Z": "The @NDNationalGuard , working with @NDDOH and the rest of Team ND, has been crucial to ND's COVID-19 response. We appreciate @POTUS extending the 100% federal cost share for states' use of National Guard forces to respond to COVID-19 and facilitate economic recovery.", "2020-06-07T22:05:12.000Z": "ICYMI: Restrictions on visitation at long-term care facilities have been modified, allowing for a phased approach to resuming visitation, including immediate outdoor visitation by appointment with appropriate protective measures. Read the details here: Burgum announces phased approach to resuming visitation at long-term care facilities Gov. Doug Burgum signed an executive order that modifies restrictions on visitation at long-term care facilities in North Dakota during the COVID-19 pandemic, allowing for a phased approach to... governor.nd.gov", "2020-06-05T19:53:46.000Z": "Join us for today's COVID-19 press briefing at 3 p.m. CT. Quote Tweet ND Department of Health @NDDOH June 5th, 2020 COVID-19 Press Conference - ND Joint Information Center https:// pscp.tv/w/calGEDFsWkVw b1dsbm5Pam58MXJteFBBdk13ckRLTvBrwURER1bJHLluoa-CATfmeQwbTjcGewC0s6Y7X02D ", "2020-06-05T19:42:02.000Z": "Happy Birthday, @FirstLadyND ! Inspired by your incredible courage and tireless efforts. Your work and your depth of caring matters now more than ever! So grateful to be on this journey with you!", "2020-06-05T17:25:15.000Z": "This week, North Dakotans have organized peaceful demonstrations in cities across the state, calling for justice and equality in the wake of the George Floyd tragedy. We hear you, and as always, we are here to work together to make our great state an even better place to live.", "2020-06-04T15:51:37.000Z": "In her 15 years at the helm of the @NDDOCR , Leann has earned national recognition for her work in the ND corrections system. We are incredibly grateful for her transformational leadership and to DOCR's Dave Krabbenhoft for stepping in as interim director. https:// governor.nd.gov/news/burgum-ac cepts-resignation-docr-director-leann-bertsch-thanks-her-15-years-leadership ", "2020-06-03T23:35:00.000Z": "For the first time since ND began serial testing, no new COVID-19 cases were identified among residents or staff in long-term care facilities yesterday; today, one staff member was positive.\n\nAs we work to protect these vulnerable populations, we're encouraged by these results.", "2020-06-03T20:28:00.000Z": "Tune in to today's COVID-19 update at 3:30 p.m. CT. Quote Tweet ND Department of Health @NDDOH June 3rd, 2020 COVID-19 Press Conference - ND Joint Information Center https:// pscp.tv/w/caarXDFsWkVw b1dsbm5Pam58MUJSS2pRZ1ZwYXZ4d_hKGd-S9Je7m8fNEQeJspQHouspOOayKQv7jV-6H68E ", "2020-06-03T00:32:58.000Z": "Officer Cody Holte represented the best in all of us - a man of honor, courage & public service who put God, family and country above all else. Thanks to everyone in Grand Forks and across our state for supporting his family and honoring his memory. Rest in Peace, Officer Holte.", "2020-06-01T23:02:04.000Z": "Tomorrow, flags will be lowered in honor of Officer Cody Holte as a mark of our respect and gratitude for his courageous service and his ultimate sacrifice. Officer Holte devoted his life to the protection & safety of his community, his state, his country and his fellow citizens. Quote Tweet Grand Forks Police Department @GrandForksPD", "2020-05-31T19:19:44.000Z": "Great to see Fargoans coming together to clean up downtown this morning. This is the spirit of North Dakota. We can stand together, talk to each other and work to make our state a better place for everyone.", "2020-05-31T16:34:30.000Z": "In North Dakota, we protect the safety of our citizens and the right to protest peacefully. Grateful for the actions of these leaders and law enforcement to ensure both happened yesterday, and for everyone helping with cleanup today. #NDstrong  #FargoStrong", "2020-05-31T14:00:05.000Z": "Press conference on the state of emergency in Fargo, West Fargo and Cass County. Quote Tweet The City of Fargo @cityoffargo FargoStrong Unified Press Conference - 05.31.2020 https:// pscp.tv/w/caJdPjFKUktt WXJhZHF6S1B8MURYeHllcU56UlJ4TY5PiiBMAfpo_3f2cJjOapa2oZYFo8gOdd2hR5iWLRki ", "2020-05-31T04:01:00.000Z": "At the request of local authorities, we have declared a state of emergency and activated the @NDNationalGuard in Fargo, West Fargo & Cass County. The rule of law must be enforced to protect the public, protesters and first responders from illegal activity. UPDATED: Governor declares state of emergency in Fargo, West Fargo and Cass County, activates ND... Gov. Doug Burgum signed an executive order declaring a state of emergency in Fargo, West Fargo and Cass County and activating the North Dakota National Guard to help local authorities respond to... governor.nd.gov", "2020-05-29T22:55:29.000Z": "North Dakota is moving to the next phase of its #NDSmartRestart plan, as the state continues to see a high rate of testing per capita, a low positive test rate and adequate hospital capacity to handle potential COVID-19 case surges. Check out the details: Burgum announces move to next phase of ND Smart Restart plan Gov. Doug Burgum announced North Dakota is moving to the next phase of its ND Smart Restart plan, as the state continues to see a high rate of testing per capita, a low positive test rate and... governor.nd.gov", "2020-05-29T20:29:30.000Z": "Today's COVID-19 press briefing will begin at approximately 3:30 p.m. CT. Watch below. Quote Tweet ND Department of Health @NDDOH May 29th, 2020 COVID-19 Press Conference - ND Joint Information Center https:// pscp.tv/w/caASmjFsWkVw b1dsbm5Pam58MVJEeGxRek1OcE5LTKY92XBW8aOjpdXasKuVEeHdTRVxzwNGDzM6EVcAXcWx ", "2020-05-28T21:22:55.000Z": "Our entire state mourns with Officer Holte's family and fellow officers & National Guard members.\n\nWhile we can never repay him for his incredible service and sacrifice, we can honor him by supporting his loved ones & the families of all who give their lives in the line of duty. Quote Tweet N.D. National Guard @NDNationalGuard On May 27, a shooting occurred in Grand Forks, N.D. that took the life of Officer Cody Holte of the@GrandForksPD. Officer Holte was also a First Lieutenant in the North Dakota National Guard. Show this thread", "2020-05-28T03:39:17.000Z": "Kathryn and I extend our deepest condolences to the family of the Grand Forks police officer who made the ultimate sacrifice today in the line of duty. Burgum statement on Grand Forks police officer killed in the line of duty Gov. Doug Burgum released a statement after a Grand Forks Police Department officer was fatally shot today while responding to a shooting incident at an apartment building. A Grand Forks Sheriff's... governor.nd.gov", "2020-05-27T20:53:49.000Z": "Watch today's COVID-19 press briefing with the @NDDOH . Livestream will begin around 4 p.m. CT. Quote Tweet ND Department of Health @NDDOH May 27th, 2020 COVID-19 Press Conference - ND Joint Information Center https:// pscp.tv/w/cZ12ojFsWkVw b1dsbm5Pam58MWdxeHZFTmFRUVdKQtzKsk4ZzoBtaY1zRXM7yees7L5C10ATssMvu0mP-wi4 ", "2020-05-27T02:47:52.000Z": "Today is the 100th anniversary of the birth of Peggy Lee! This Grammy Award winner graced us with one of the most recognizable voices of all time, and her music continues to inspire artists around the world. ND is honored to call this Rough Rider Award recipient one of our own.", "2020-05-26T20:26:22.000Z": "Join us for today's COVID-19 update with the @NDDOH at 3:30 p.m. CT. Quote Tweet ND Department of Health @NDDOH ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 5/26 will begin at approximately 3:30pm CT. https:// pscp.tv/w/cZweGTFsWkVw b1dsbm5Pam58MWxQS3FWT3dBQU5HYjNU8xa7uRpbzHebuUodHgN2FKbjZLlXLjs_qyL0JenW ", "2020-05-26T00:01:54.000Z": "For our freedom, we owe our nation's fallen heroes a debt that cannot be repaid. Watch today's full Memorial Day service at https:// youtube.com/watch?v=tIYXx1 4M6qg  .", "2020-05-25T18:04:42.000Z": "Today, we honor the brave men and women who gave their lives for our country. This day of remembrance can inspire each of us to consider how fortunate we are to live in this great nation and how important it is for us to keep fighting for America's future.", "2020-05-25T00:50:50.000Z": "As we commemorate Memorial Day tomorrow, please join us for virtual ceremonies with the @NDNationalGuard at 12 p.m. CT, livestreamed on http:// ndguard.nd.gov , and with the Fargo National Cemetery Committee at 2 p.m. CT on Facebook Live at https:// facebook.com/events/2574824 12307914/  . Home ndguard.nd.gov", "2020-05-23T19:13:51.000Z": "In another strong day of testing, the @NDDOH has reported 49 new cases of COVID-19 in ND, most of which are in Cass County.\n\nThis weekend, it's everyone's responsibility to continue practicing #NDSmart guidelines to protect the health of our communities. Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs report 2,408 completed tests today for COVID-19 with 49 new positive cases, bringing the statewide total to 2,365.\n\nState & private labs have reported 80,046 total completed tests.\n\n1,451 ND patients are recovered. 1 previous case changed to out-of-state.", "2020-05-22T22:53:09.000Z": "Following widespread spring flooding estimated to have caused more than $40 million in damage to roads and other public infrastructure, today we requested a presidential major disaster declaration for 21 counties in North Dakota. Read more: Burgum requests presidential major disaster declaration for damage caused by spring flooding Gov. Doug Burgum requested a presidential major disaster declaration for widespread spring flooding estimated to have caused more than $40 million in damage to roads and other public infrastructure... governor.nd.gov", "2020-05-22T20:33:49.000Z": "Tune in to today's COVID-19 press briefing below. Quote Tweet ND Department of Health @NDDOH May 22nd, 2020 COVID-19 Press Conference https:// pscp.tv/w/cZbYGTFsWkVw b1dsbm5Pam58MWxEeExnUGpCTFBKbUaBNbQp7CzE5nFLtMGd6sRnBmitqEyzAEduyRuxKla5 ", "2020-05-21T23:02:15.000Z": "Thankful for North Dakota's outstanding emergency medical services teams! This week, we honor the lifesaving care they provide and their compassion for those in need, especially during these challenging times. https:// governor.nd.gov/sites/www/file s/documents/proclamations/Emergency%20Medical%20Services%20Week%202020.pdf ", "2020-05-20T23:31:11.000Z": "From over 6,000 miles away to 6 feet apart, honored to welcome members of the @NDNationalGuard", "2020-05-20T20:30:30.000Z": "Today's COVID-19 press briefing will begin shortly. Watch here: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 5/20 Briefing will begin at approximately 3:30pm CT facebook.com", "2020-05-19T23:01:39.000Z": "Residents of basic care facilities will be able to keep the CARES Act Economic Impact Payments, ensuring that North Dakota citizens receive this relief as intended. Grateful to legislative leadership, the Attorney General and DHS for their collaboration. Burgum announces emergency rule change allowing basic care residents to keep stimulus checks Gov. Doug Burgum announced an emergency rule change that will allow residents of basic care facilities in North Dakota to keep the Economic Impact Payments provided as part of the federal Coronavirus... governor.nd.gov", "2020-05-19T20:23:11.000Z": "Watch today's COVID-19 press briefing at 3:30 p.m. CT. ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 5/19 Briefing will begin at approximately 3:30pm CT facebook.com", "2020-05-19T16:57:30.000Z": ". @FirstLadyND and I were honored to join @POTUS , @FLOTUS and @VP by videoconference to discuss our #NDSmartRestart , share gratitude for federal support for our COVID-19 response and thank First Lady Melania for her important work on children's mental health and the opioid crisis. Quote Tweet Mike Pence @Mike_Pence Productive day at the @WhiteHouse . Honored to join President @realDonaldTrump for a roundtable with Restaurant Executives and a Conference call with our Governors. As a Nation, we have completed 11 million tests and we are well on our way to safely Opening Up America Again!", "2020-05-18T19:17:06.000Z": "Powerful tribute to North Dakota's health care workers and others protecting us on the front lines in the fight against COVID-19. Thanks to the airmen at @TeamMinot for today's #AFSalute in Bismarck, Fargo, Grand Forks and Minot!", "2020-05-17T23:57:09.000Z": "We're continuing to take targeted actions to contain concentrated areas of infection. As we work with local officials to slow the spread, it's more important than ever that we all practice individual responsibility to protect our communities. Forum Editorial: We must protect livelihoods, not just lives | INFORUM People are understandably concerned that the number of positive coronavirus cases in Cass County continues to rise. Cass is by far North Dakota's coronavirus hotspot, accounting for well more than... inforum.com", "2020-05-15T23:34:31.000Z": "Our #NDSmartRestart recommendations for large gatherings balance the importance of controlling the spread of COVID-19 with the ability to safely proceed with events of limited size as we continue to focus on saving lives and livelihoods. Burgum releases guidelines for large gatherings, events as part of ND Smart Restart plan Gov. Doug Burgum announced guidelines for large gatherings, banquets, ballrooms and event venues as part of the ND Smart Restart plan, while also outlining the plan as a phased approach to recovery... governor.nd.gov", "2020-05-15T20:30:48.000Z": "Today's COVID-19 update begins at 3:30 p.m. CT. Watch live here! ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 5/15 Briefing will begin at approximately 3:30pm CT facebook.com", "2020-05-15T14:31:23.000Z": "On Peace Officers Memorial Day, we honor the heroic law enforcement officers who laid down their lives in service and protection of our communities, our citizens and our freedoms. https:// governor.nd.gov/sites/www/file s/documents/proclamations/Police%20Week%20-%20Peace%20Officer%20Memorial%20Day%202020.pdf ", "2020-05-14T20:36:01.000Z": "Join us for today's COVID-19 press briefing! ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 5/14 Briefing will begin at approximately 3:30pm CT. facebook.com", "2020-05-13T23:44:32.000Z": "Gov. @DougBurgum and Commerce Commissioner @KommerMichelle met with @realDonaldTrump at the White House this afternoon highlighting state-federal partnerships to North Dakota's COVID-19 response and recovery efforts such as the #NDSmartRestart plan. #InThisTogetherND", "2020-05-13T23:40:05.000Z": "\"Man, that team is really good.\" @POTUS wants to see @NDSUfootball back at the White House. #GoBison", "2020-05-13T22:45:13.000Z": "Appreciate the opportunity to share ND's coronavirus successes and challenges with @POTUS at the White House today with @SenJohnHoeven and @KommerMichelle .", "2020-05-13T20:04:57.000Z": "This afternoon, President @realDonaldTrump welcomes @GovofCO Jared Polis and Governor @DougBurgum of North Dakota to the White House to discuss Coronavirus response and re-opening efforts.", "2020-05-13T19:42:11.000Z": "Fighting COVID-19 requires a whole-of-government approach, and we're fortunate to have the partnership of @POTUS and his administration as well as @SenJohnHoeven , @SenKevinCramer & @RepArmstrongND working on behalf of ND. Looking forward to meeting with the President later today.", "2020-05-12T23:31:58.000Z": "Looking forward to it! Grateful for the partnerships with ND's congressional delegation and federal agencies that have helped us slow the spread of the coronavirus and achieve an #NDSmartRestart . Quote Tweet Senator John Hoeven @SenJohnHoeven Under Gov. @DougBurgum 's leadership, #ND is leading the way in testing, a key part of safely reopening the economy. We look forward to his visit to the @WhiteHouse tomorrow as he & President @realDonaldTrump discuss further efforts to work together + address the COVID pandemic.", "2020-05-12T20:39:54.000Z": "The Emergency Commission voted today to utilize $500M+ in federal funding for our COVID-19 response and recovery. We're in a fortunate position to be able to deploy these funds in a way that can help so many citizens and help our economy get rolling again. Emergency Commission approves using over $500M in federal funds for COVID-19 response and recovery The North Dakota Emergency Commission voted to utilize more than half a billion dollars in federal funding for North Dakota's COVID-19 response and recovery efforts, with the majority of the money... governor.nd.gov", "2020-05-12T00:11:44.000Z": "Beginning June 1, ND schools will be able to host a variety of activities, including summer school and college admissions testing. Schools may also allow students to retrieve belongings and bring back equipment from May 15-30. Burgum, Baesler announce summer school, testing options Gov. Doug Burgum and State School Superintendent Kirsten Baesler announced that beginning June 1, North Dakota schools will be allowed to host a number of activities, including summer school and... governor.nd.gov", "2020-05-11T20:26:08.000Z": "Join us for today's press briefing on COVID-19. Watch live here at 3:30 p.m. CT. ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 5/11 Briefing will begin at approximately 3:30pm facebook.com", "2020-05-10T18:35:57.000Z": "Since announcing #NDSmartRestart , we've averaged 1,741 tests/day, just shy of our 1,800/day goal. We've climbed to 3rd in the U.S. in per capita testing as we're working through supply/equipment issues and shifting from drive-through testing to a more targeted approach.", "2020-05-10T16:25:31.000Z": "Today we celebrate and share our gratitude to those amazing moms who unselfishly give life, love, encouragement and support in all seasons and circumstances. Whether by birth or by choice, Happy Mother's Day to all moms!\n\nPhoto with our mom, Katherine Kilbourne Burgum, in 2004.", "2020-05-10T00:55:57.000Z": "Grateful to the @NDNationalGuard and tribal leaders for their constant communication and dedicated partnership in fighting COVID-19! #InThisTogetherND Quote Tweet N.D. National Guard @NDNationalGuard Today's mobile testing site showed partnership at it's finest. Despite the wind and the rain @StandingRockST , Standing Rock Indian Health Services, Custer Health and the #NDGuard collected more than 480 COVID-19 test samples. Thank you to all who made this mission so successful!", "2020-05-09T14:30:51.000Z": "As @NDparkrec begins to welcome campers and day visitors again for the summer season, it's everyone's responsibility to be #NDSmart and use our public lands wisely. Visit http:// parkrec.nd.gov for more information.", "2020-05-09T02:33:40.000Z": "On the 75th anniversary of Victory in Europe Day, we pay tribute to the millions of Americans who served in World War II to defend our nation and our allies. We'll forever be grateful for their service.", "2020-05-08T21:58:09.000Z": "Having an ample supply of PPE was one of our eight criteria for moving ahead with the #NDSmartRestart , and this new decontamination system will further improve our PPE capacity while also better preparing us for a potential second surge in COVID-19 cases. North Dakota gets new PPE disinfection system as recovered COVID-19 cases surpass active cases Gov. Doug Burgum highlighted a new capability that will help North Dakota meet demand for personal protective equipment (PPE) during the coronavirus pandemic, as the state's number of recovered... governor.nd.gov", "2020-05-08T20:32:22.000Z": "Today's COVID-19 press briefing will begin around 3:30 p.m. CT. Watch live! ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 5/8 Briefing will begin at approximately 3:30pm CT. facebook.com", "2020-05-07T19:58:48.000Z": "In any other year, Memorial Hall would be filled with hundreds of North Dakotans taking part in today's National Day of Prayer. \n\nThough this year's service was virtual, it was as full of hope and gratitude as ever. Thankful to all who gathered together in community and prayer.", "2020-05-07T18:58:28.000Z": "While it's disappointing that GRE plans to retire Coal Creek Station in 2022, @BrentSanfordND and I are determined to find a path forward that preserves high-paying jobs & keeps this efficient coal-fired plant on the grid to ensure baseload power capacity. Burgum statement on Great River Energy's announcement to retire Coal Creek Station in 2022 Gov. Doug Burgum released a statement after Great River Energy (GRE), a not-for-profit wholesale electric power cooperative providing power in Minnesota and Wisconsin, announced plans to retire its... governor.nd.gov", "2020-05-06T23:45:05.000Z": "The Red River Valley COVID-19 Task Force will work to prevent and mitigate the spread of COVID-19, dedicating state and county resources to assist in prevention measures, testing, contact tracing and support for isolation and quarantine. Learn more: Burgum, local leaders announce Red River Valley COVID-19 Task Force to address concentration of... Gov. Doug Burgum was joined by local leaders in announcing a new Red River Valley COVID-19 Task Force to address an increasing concentration of COVID-19 cases in Cass County. governor.nd.gov", "2020-05-06T20:30:31.000Z": "Watch today's COVID-19 press briefing live at 3:30 p.m. CT! We'll be joined by State Superintendent Kirsten Baesler, Fargo Mayor Tim Mahoney, West Fargo Mayor Bernie Dardis and Cass County Commissioner Chad Peterson. ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 5/6 Briefing will begin at approximately 3:30pm CT. facebook.com", "2020-05-06T16:19:57.000Z": "The heroism of North Dakota's health care workers has never been more apparent than it is now. \n\nToday we say #ThankYouNurses to the compassionate individuals who work tirelessly to protect our health every single day.", "2020-05-05T21:17:16.000Z": "North Dakota's exceptional teachers continue to provide a top-notch education for our students through distance learning. On #NationalTeacherDay - and all throughout North Dakota Teacher Appreciation Week - we celebrate the innovation and dedication of North Dakota's educators.", "2020-05-05T18:18:18.000Z": "Health care workers are critical in the fight against COVID-19. Join a team that's protecting North Dakotans and saving lives. \n\nWe're #InThisTogetherND . http:// health.nd.gov/covidjobs", "2020-05-04T20:26:52.000Z": "Today's COVID-19 press briefing will begin at 3:30 p.m. CT. Watch live here: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 5/4 Briefing will begin at approximately 3:30pm CT facebook.com", "2020-05-04T16:14:25.000Z": "Throughout this public health emergency, members of Team ND and local public servants have worked tirelessly to continue serving the citizens of North Dakota. We are tremendously grateful for the crucial work they do!", "2020-05-03T00:09:47.000Z": "ICYMI: K-12 schools will continue distance learning for the rest of the academic year. We're deeply grateful to our teachers and administrators for developing plans to continue educating North Dakota's students. Burgum: K-12 schools will continue distance learning for remainder of school year as fight against... Gov. Doug Burgum announced his executive order directing schools to provide education via distance learning will remain in effect through the end of the current school year to help slow the spread of... governor.nd.gov", "2020-05-01T23:29:21.000Z": "Sat down with Prairie Pulse to discuss the latest on COVID-19 and the #NDSmartRestart ! Watch on @PrairiePublic at 7:30 p.m. CT or online here: Prairie Pulse | Prairie Pulse 1728: North Dakota Governor Doug Burgum | Season 17 | Episode 28 Doug Burgum talks about the COVID-19 pandemic in North Dakota. pbs.org", "2020-05-01T20:29:05.000Z": "Today's press briefing on COVID-19 begins at 3:30 p.m. CT. We'll be joined by @NDDPI Superintendent Kirsten Baesler and leaders from our testing and contact tracing teams. Watch live: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 5/1 Briefing will begin at approximately 3:30pm CT facebook.com", "2020-05-01T18:48:47.000Z": "The COVID-19 pandemic is a landmark event in all our lives, and it will have a long-lasting impact on our state budget. This presents a challenge, but we can choose how we respond. Within crisis, there is an opportunity for us to transform. Burgum presents strategic budget guidelines for 2021-2023 biennium Gov. Doug Burgum presented his strategic budget guidelines for the state of North Dakota for the 2021-2023 biennium, with an emphasis on teleworking, process improvement, reduced facility costs and... governor.nd.gov", "2020-05-01T16:01:31.000Z": "We'll be discussing the budget guidelines for the 2021-23 biennium at 11 a.m. CT. Join us for an update on the state revenue outlook. Watch here: 2021-23 Revenue Outlook & Budget Guidelines We'll be discussing the budget guidelines for the 2021-23 biennium at 11 a.m. CT. Join us for an update on the state revenue outlook. facebook.com", "2020-04-30T20:25:51.000Z": "We'll be live at 3:30 p.m. CT with the latest on COVID-19 in North Dakota. Watch live: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/30 Briefing will begin at approximately 3:30pm CT facebook.com", "2020-04-30T19:45:28.000Z": "North Dakota's citizens are its greatest strength, and it was an honor to highlight this group of citizen-soldiers and airmen who continue to work around the clock manning the front lines in the fight against COVID-19. Grateful to the @NDNationalGuard !", "2020-04-29T23:34:37.000Z": "Today, we saw the lowest rate of positive tests since April 10. It's more important than ever that we all continue to be responsible and follow #NDSmart guidelines to slow the spread of COVID-19.", "2020-04-29T23:34:36.000Z": "Guidance for businesses to resume or continue operations under the #NDSmartRestart have been developed in collaboration with the business community to protect the safety of employees and customers alike. Burgum issues executive order providing additional guidance for businesses under ND Smart Restart Gov. Doug Burgum signed an amended executive order providing additional guidance for businesses that are resuming or continuing operations under the \"North Dakota Smart Restart\" protocols developed... governor.nd.gov", "2020-04-29T20:28:38.000Z": "Today's COVID-19 press briefing begins at 3:30 p.m. CT. Watch live! ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/29 Briefing will begin at approximately 3:30pm facebook.com", "2020-04-29T02:05:31.000Z": "Thanks to @marthamaccallum for having me on to discuss the #NDSmartRestart . We're taking a thoughtful approach to restarting the sectors of North Dakota's economy that were restricted by executive order due to COVID-19. Gov. Doug Burgum on reopening North Dakota: We never really closed... North Dakota took a measured approach to its coronavirus response, North Dakota Gov. Doug Burgum tells Martha MacCallum on 'The Story.' video.foxnews.com", "2020-04-29T00:27:29.000Z": "The #NDSmartRestart protocols released today include operating standards for all industries, as well as specific guidance for several high-contact business sectors that were closed or had access limited by executive order. https:// ndresponse.gov/covid-19-resou rces/covid-19-business-and-employer-resources/nd-smart-restart  (2/3) ND SMART RESTART ndresponse.gov", "2020-04-29T00:27:28.000Z": "As ND increases testing capacity, we will find more cases of COVID-19. That's why we look at the rate of positives to accurately assess the spread. Our positive rate is holding steady and beginning to trend downward - an important part of the #NDSmartRestart . (1/3)", "2020-04-28T20:27:10.000Z": "Join us for today's update for the latest on COVID-19 in North Dakota. Watch live at 3:30 p.m. CT: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/28 Briefing will begin at approximately 3:30pm CT facebook.com", "2020-04-27T22:53:06.000Z": "The vast majority of ND's economy has remained open through this crisis. Our success against the coronavirus has hinged on a low-mandate, high-compliance approach, and North Dakotans have done their part to slow the spread through social distancing & other measures. (1/3)", "2020-04-27T20:28:02.000Z": "Join us for today's briefing at 3:30 p.m. CT, where we'll discuss the latest on COVID-19 in North Dakota and the plan for an ND Smart Restart. Watch live: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/27 Briefing will begin at approximately 3:30pm CT facebook.com", "2020-04-25T13:28:37.000Z": "Our team has been working with the select businesses that had to close or restrict access, developing recommendations and guidelines that will allow for a graduated reopening.", "2020-04-25T13:28:17.000Z": "As many states are discussing plans to reopen, it's important to realize that most of North Dakota's economy never closed. Agriculture, energy, manufacturing, health care, education - all have continued to operate during challenging circumstances and unsteady economic conditions.", "2020-04-24T22:45:29.000Z": "Overland flooding and near-record river crests have caused extensive damage to infrastructure at a time when ND is already responding to challenging conditions. \n\nToday, I declared a statewide emergency for flooding that has caused $7M in damage so far. Burgum declares statewide flood emergency due to spring flooding North Dakota Gov. Doug Burgum issued an executive order declaring a statewide flood emergency for spring flooding that has caused an estimated $7 million in infrastructure damage so far. governor.nd.gov", "2020-04-24T20:25:16.000Z": "Join us for today's COVID-19 update. Livestream begins at 3:30 p.m. CT. ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/24 Briefing will begin at approximately 3:30pm facebook.com", "2020-04-23T20:27:35.000Z": "Join us for today's COVID-19 update at 3:30 p.m. CT. Watch live here: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/23 Briefing will begin at approximately 3:30pm CT. facebook.com", "2020-04-23T15:41:52.000Z": "North Dakota is leveraging technology to enhance our contact tracing efforts. Grateful to @gretabrawner for having me on @cspanwj to talk about how the Care19 app will play an important role in a North Dakota Smart Restart. \n\nWatch the full clip: http:// c-span.org/video/?471389- 103/washington-journal-governor-burgum-discusses-technology-trace-covid-19-cases ", "2020-04-23T15:20:13.000Z": "Thanks to @SenJohnHoeven along with @SenKevinCramer and @RepArmstrongND for their efforts to secure funding for this important program to protect North Dakota workers! Quote Tweet Senator John Hoeven @SenJohnHoeven We've been working w/ the Administration to ensure Gov. @DougBurgum is able to use the funds from the Coronavirus Relief Fund to help offset the rise in unemployment insurance costs & meet #NorthDakota 's specific needs. https:// bit.ly/2XV95zT", "2020-04-22T23:07:59.000Z": "Widespread rapid testing is a key element of our step-by-step plan for a North Dakota Smart Restart. We're grateful to our State Lab and partners who are working to expand testing and contact tracing to protect lives & livelihoods.\n\nMore on our strategy: North Dakota officials outline plan to expand testing capacity for COVID-19 Gov. Doug Burgum and Maj. Gen. Alan Dohrmann, director of the North Dakota Department of Emergency Services, outlined a plan to significantly increase testing capacity for COVID-19, a critical... governor.nd.gov", "2020-04-22T20:22:46.000Z": "Today's COVID-19 update begins at 3:30 p.m. CT. Watch live! ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/22 Briefing will begin at approximately 3:30pm facebook.com", "2020-04-22T17:01:25.000Z": "ND's UAS companies are partnering with universities & health experts to test the use of remotely-piloted vehicles in the fight against coronavirus. Here, @SkySkopes tests soapy water and disinfectant to clean a closed playground in Grand Forks. Read more: http:// blogs.und.edu/und-today/2020 /04/und-sponsored-project-will-show-how-drones-may-be-used-to-help-fight-covid-19/ ", "2020-04-22T14:23:46.000Z": "Excited to announce that Andrea Travnicek has been appointed to lead @NDparkrec ! http:// governor.nd.gov/news/burgum-ap points-andrea-travnicek-lead-north-dakota-parks-and-recreation-department ", "2020-04-22T02:40:15.000Z": "Due to a temporary network issue, today's COVID-19 update was not streamed live by the @NDDOH but was broadcast by media outlets around the state. Thanks to ND's journalists for their constant efforts to provide important information! Watch today's update: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/21 Due to technical difficulties, the briefing could not be... facebook.com", "2020-04-21T21:58:04.000Z": "Care19 is now available for Android! This contact tracing app developed for COVID-19 is completely voluntary and developed with a privacy-first mindset. Over 20,000 users have already downloaded Care19, which has also been updated today. Download it now! http:// BeLegendary.link/Care19", "2020-04-20T22:41:45.000Z": "Creating a network of 3D printers and other technology to make safe, effective PPE for frontline workers is another great example of how we're all #InThisTogetherND .\n\nGrateful to all of the North Dakotans who are finding new ways to help their communities! Statewide coalition launches personal protective equipment portal to connect needs, resources North Dakota Information Technology, EduTech, Gateway to Science and Microsoft Corp., today announced a Personal Protective Equipment (PPE) Portal, https://gatewaytoscience.org/nd-covid19/, designed... ndresponse.gov", "2020-04-20T20:24:31.000Z": "Today's COVID-19 update begins at 3:30 p.m. CT. Watch live here: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/20/20 Briefing will begin at approximately 3:30pm CT facebook.com", "2020-04-19T18:52:05.000Z": "Whether you're inside or outdoors enjoying today's spring weather, we ask that you follow state & CDC guidelines to slow the spread of COVID-19. As the number of cases continues to rise, we must continue practicing physical distancing and avoiding gatherings of 10 or more people. Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs are reporting 667 completed tests today for COVID-19, with 57 new positive cases, bringing the statewide total to 585. NDDoH reports 1 new death.\n\nState & private labs have reported 13,630 total tests with 13,045 negatives.\n\n189 ND patients are recovered.", "2020-04-18T22:33:02.000Z": "These teams-a collaboration of the @NDDOH , @NDNationalGuard , local public health and other partners-can respond to localized outbreaks and use targeted testing to quickly identify positive cases and begin the contact tracing process to prevent the disease from spreading further.", "2020-04-18T22:33:01.000Z": "A rapid response team that conducted testing at the LM Wind Power manufacturing plant in Grand Forks has confirmed 88 cases of COVID-19, with an add'l 22 cases confirmed outside of this testing event. Employees at the plant have been ordered to quarantine. Burgum: State, local response teams work quickly to contain COVID-19 outbreak at Grand Forks... A rapid response team that conducted testing Thursday at the LM Wind Power manufacturing plant in Grand Forks has confirmed 88 additional cases of the coronavirus disease, COVID-19, Gov. Doug Burgum... governor.nd.gov", "2020-04-18T20:25:34.000Z": "Today's COVID-19 update will begin at 3:30 p.m. CT. Watch live here: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/18/20 Briefing will start at approximately 3:30pm CT facebook.com", "2020-04-18T17:03:45.000Z": "With 90 new positive cases of COVID-19 today, North Dakota's active confirmed cases have climbed to 336. We'll be joined by Grand Forks Mayor Michael Brown for a press briefing at 3:30 p.m. today streamed live on http:// facebook.com/ndhealth/ . Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs are reporting 621 total completed tests today for COVID-19, with 90 new positive cases, bringing the statewide total to 528.\n\nState & private labs have conducted 12,963 total tests with 12,435 negative results.\n\n183 ND patients are considered recovered. Show this thread", "2020-04-17T23:48:59.000Z": "North Dakota's rate of positive results from completed tests has been over 7% for three of the last four days. This is still lower than many other states, but it's more important than ever that we continue to follow #NDSmart guidelines to slow the spread of COVID-19.", "2020-04-17T20:33:58.000Z": "Join us for today's press briefing. Watch here: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/17/20 Briefing will begin at approximately 3:30pm CT facebook.com", "2020-04-16T23:17:08.000Z": "Behavioral health professionals have found new and innovative ways to provide care during this pandemic. Grateful to everyone who is out there making a difference for North Dakotans! \n\nFind resources: http:// behavioralhealth.nd.gov Quote Tweet ND Behavioral Health @NorthDakotaBH Our continued heartfelt gratitude to all of the #NorthDakota  #behavioralhealth professionals who are supporting individuals during this time of crisis. We notice, and we sincerely thank you ♡", "2020-04-16T20:57:59.000Z": "Today's press briefing begins at 4:00 p.m. CT. Watch at this link: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/16/20 Briefing will begin at approximately 4:00pm facebook.com", "2020-04-15T22:58:36.000Z": "Resources for businesses and employers affected by the COVID-19 pandemic can be found at: COVID-19 Business and Employer Resources ndresponse.gov", "2020-04-15T22:58:35.000Z": "To continue to slow the spread of coronavirus and protect the health and safety of all North Dakotans including business owners, their employees and customers, we're extending access restrictions on certain businesses by 10 days through April 30. Burgum extends business restrictions for 10 days, outlines path forward for reopening Gov. Doug Burgum extended access restrictions on certain businesses for an additional 10 days and outlined a path forward for them to reopen as the number of COVID-19 cases in North Dakota continued... governor.nd.gov", "2020-04-15T20:30:07.000Z": "Today's COVID-19 press briefing begins at 3:30 p.m. CT. Watch the livestream: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/15/20 Briefing will begin at approximately 3:30pm facebook.com", "2020-04-14T23:18:07.000Z": "While our hospitalizations remain low and we believe that our health care facilities have the capacity to handle a surge in COVID-19 patients, it's our duty to prepare for the worst-case scenario, and in that regard, ND is well-prepared.\n\nRead the plan: http:// governor.nd.gov/news/north-dak ota-finalizes-hospital-surge-plan-covid-19-response ", "2020-04-14T20:28:11.000Z": "Today's COVID-19 press briefing will begin at 3:30 p.m. CT. Watch here: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/14/20 Briefing will begin around 3:30pm. facebook.com", "2020-04-13T23:32:14.000Z": "These are challenging times for our residential facilities that serve North Dakota's most vulnerable youth. Today's executive order will allow for necessary changes to maintain critical operations in these facilities. Read more: Burgum allows for changes to maintain critical services for vulnerable youths during COVID-19... Gov. Doug Burgum signed an executive order allowing for changes necessary to maintain critical operations for vulnerable youths being served in Psychiatric Residential Treatment Facilities and... governor.nd.gov", "2020-04-13T20:27:29.000Z": "Join us for today's COVID-19 press briefing at 3:30 p.m. CT. Watch live here: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/13/20 Briefing will begin at 3:30pm facebook.com", "2020-04-13T13:39:21.000Z": "We don't expect to need these Tier 3 facilities at the Fargodome and University of Mary Fieldhouse in Bismarck, but it's our responsibility to protect the health & safety of our citizens and prepare for the worst-case scenario. (2/4)", "2020-04-13T13:39:20.000Z": "Working together, we've taken targeted action to slow the spread of COVID-19 in North Dakota so we can avoid having to use a Tier 3 minimum care facility like the Fargodome, where we have pre-positioned beds. (1/4)", "2020-04-11T23:03:56.000Z": "North Dakotans are doing their part to slow the spread of COVID-19 and #FlattenTheCurve . These critical actions are helping us avoid pressure on our health care system and save lives.\n\nBe #NDSmart : stay home, stay healthy, stay connected.", "2020-04-11T00:13:31.000Z": "Grateful to Dr. Anthony Fauci for sharing his time & expertise with us by phone this evening, and especially for affirming that ND is doing exactly what needs to be done to #SlowtheSpread of #COVID19 . Appreciate his perspective on our 2.9% positive test rate, 2nd lowest in U.S.", "2020-04-10T20:31:12.000Z": "Watch today's COVID-19 press briefing with the @NDDOH at 3:30 p.m. CT: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/10/20 Briefing will begin at 3:30pm CT facebook.com", "2020-04-09T23:14:20.000Z": "Gov. Walz and I also agreed, for the health and safety of our citizens, they should avoid all nonessential travel. Stay home, stay healthy, and stay connected. (2/2)", "2020-04-09T23:14:19.000Z": "Just had a great call with our friend and neighbor, Minnesota @GovTimWalz , and we agree: There's no \"us and them,\" only \"we.\" Our states share a river, communities and health care systems, and we'll continue to work together in the fight against COVID-19. (1/2)", "2020-04-09T20:30:11.000Z": "We'll discuss updates regarding COVID-19 in North Dakota during today's press briefing at 3:30 p.m. CT. Watch live: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/9/20 Briefing will begin at 3:30pm CT facebook.com", "2020-04-09T15:53:25.000Z": "Every state wants more data on the spread of COVID-19. In ND, we continue to ramp up testing capacity to gain a clearer picture of infection rates. Here's how our testing stacks up.\n\nWe're doing well comparatively, but we can always do better and are working every day to improve.", "2020-04-09T01:48:47.000Z": "The targeted actions we have taken in North Dakota are very aligned with the measures taken in other states under a \"stay at home\" label. \n\nNo matter the label, the point is the same: stay home, stay healthy, stay connected. We're #InThisTogetherND . Quote Tweet ND Department of Health @NDDOH DID YOU KNOW? The executive orders signed by Governor @DougBurgum and other measures implemented by the state since March 15 form a matrix of safety in ND virtually identical to those in our neighboring states with \"stay at home\" orders. #NDsmart", "2020-04-08T20:28:42.000Z": "Join us for today's COVID-19 press briefing at 3:30 p.m. CT. ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/8/20 facebook.com", "2020-04-08T14:21:47.000Z": "Going live with @1MillionCupsFar to talk about the new Care19 app! Watch here: 1 Million Cups Fargo: Care19 Welcome to #1MCFar! Today we're joined by Governor Doug Burgum and Tim Brookins from ProwdCrowd to talk about a revolutionary way to track COVID-19; an... facebook.com", "2020-04-07T20:32:28.000Z": "Today's press briefing on COVID-19 begins at 3:30 p.m. CT. Watch here: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/7 facebook.com", "2020-04-07T16:38:44.000Z": "All around the state, whether in metro centers or rural areas, many of our counties are experiencing similar rates of testing. No matter where you live, your response to COVID-19 should be the same: stay home, stay healthy, stay connected.", "2020-04-07T02:26:54.000Z": "Grateful to @POTUS and the @WhiteHouse Coronavirus Task Force for their support and partnership with governors as we fight this COVID-19 pandemic together!", "2020-04-07T00:05:42.000Z": "To protect the most vulnerable and slow the spread, I also signed executive orders requiring self-quarantine for positive cases of COVID-19 & their household members, as well as an executive order suspending visitation to long-term care facilities. Burgum signs executive orders to slow spread of COVID-19, limit visitation to nursing homes Gov. Doug Burgum signed two executive orders designed to slow the spread of COVID-19 in North Dakota and protect the most vulnerable from the coronavirus disease by limiting visitation to long-term... governor.nd.gov", "2020-04-07T00:05:41.000Z": "As ND increases testing capacity, we're seeing among the lowest rates of confirmed positives in the nation with one of the best per capita testing rates. \n\nWe'll continue to take targeted action to slow the spread of COVID-19 and preserve hospital capacity to save lives.", "2020-04-06T20:32:27.000Z": "Watch today's press briefing at 3:30 p.m. CT for updates on COVID-19 in North Dakota. ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/6/20 Briefing will begin at 3:30pm CT facebook.com", "2020-04-05T19:25:24.000Z": "Stay home, stay healthy, stay connected.", "2020-04-04T19:13:53.000Z": "With 409 new tests conducted, North Dakota has confirmed an additional 13 cases of COVID-19.\n\nRemember: stay home, avoid all gatherings and don't go out for non-essential trips. Everyone has a responsibility to help slow the spread. Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs are reporting 409 total completed tests today for COVID-19, with 13 new positive cases, bringing the statewide total to 186.\n\nState & private labs have conducted 6,207 total tests with 6,021 negative results.\n\n63 ND patients are considered recovered.", "2020-04-03T22:53:32.000Z": "We're launching a new pilot project to expand COVID-19 testing and improve contact tracing to slow the spread.\n\nThis involves setting up drive-through sites this weekend to test as many people as possible in two communities. Read the plan here: http:// governor.nd.gov/news/burgum-an nounces-pilot-project-expand-covid-19-testing-and-improve-tracing-slow-spread-virus ", "2020-04-03T20:26:48.000Z": "Today's press briefing on North Dakota's COVID-19 response is live at 3:30 p.m. CT. Watch here: ND Dept of Health Joint Information Center daily press briefing... ND Dept of Health Joint Information Center daily press briefing with Governor Doug Burgum 4/3/20 facebook.com", "2020-04-03T00:14:23.000Z": "Our state is blessed with some of the most generous people in the world, and many of you are looking for ways to support your community during this crisis. Here's a thread on how to help:", "2020-04-02T22:39:14.000Z": "All North Dakotans should be staying home and avoiding non-essential trips. However, if you need to pick up food and supplies, follow these helpful tips from the North Dakota Grocers Association to stay safe and help slow the spread of COVID-19.", "2020-04-02T20:59:50.000Z": "Watch today's press briefing on COVID-19 at 4 p.m. CT: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/2/20 facebook.com", "2020-04-02T16:34:18.000Z": "ND has confirmed 12 new cases of COVID-19, for a cumulative total of 159 confirmed positive cases since the pandemic began.\n\nBe on the lookout for data at 11 am CT going forward. This new, once-daily reporting will allow epidemiologists more time to conduct their investigations. Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs are reporting 353 total completed tests today for COVID-19, with 12 new positive cases, bringing the statewide total to 159.\n\nState & private labs have conducted 4,980 total tests with 4,821 negative results.", "2020-04-01T23:25:36.000Z": "Today, I signed an executive order waiving the mandatory 1-week waiting period for unemployment benefits as claims continue to increase. This is critical to helping out-of-work North Dakotans who are struggling to make ends meet during the COVID-19 crisis. Burgum waives waiting period for unemployment benefits, extends business closures by two weeks Gov. Doug Burgum signed an executive order waiving the mandatory one-week waiting period for unemployment benefits as claims continue to increase in North Dakota during the COVID-19 pandemic. governor.nd.gov", "2020-04-01T20:59:16.000Z": "Today's COVID-19 press briefing with the @NDDOH begins at 4 p.m. CT. Watch here: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 4/1/20 facebook.com", "2020-04-01T19:00:41.000Z": ". @POTUS has granted ND's request for a major presidential disaster declaration, opening up federal assistance for our response efforts. Grateful to the President, his administration & our congressional delegation for their partnership in fighting COVID-19. President grants Burgum's request for major disaster declaration related to COVID-19 response Gov. Doug Burgum announced that President Donald Trump has granted the governor's request for a major presidential disaster declaration to make federal assistance available to support North Dakota's... governor.nd.gov", "2020-04-01T15:24:06.000Z": "North Dakota has confirmed 16 additional cases of COVID-19, with 142 cumulative cases in the state. Stay home, avoid non-essential trips, wash your hands and do not gather in groups of ten or more. Your actions to slow the spread can protect your fellow North Dakotans. Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs have completed 236 total tests today for COVID-19 as of 9:00am CT, with 16 new positive cases, bringing the statewide total to 142.\n\nState & private labs have conducted 4,493 total tests with 4,351 negative results. Show this thread", "2020-03-31T23:24:12.000Z": "State agencies have come together to activate the Workforce Coordination Center to serve emergency workforce needs in support of health care providers, industries and agencies affected by COVID-19. \n\nDetails: Burgum announces Workforce Coordination Center to serve emergency needs during COVID-19 pandemic Gov. Doug Burgum announced the activation of North Dakota's Workforce Coordination Center (WCC) to serve emergency workforce needs in support of health care providers, industries and agencies... governor.nd.gov", "2020-03-31T20:56:16.000Z": "Today's press briefing with the @NDDOH will begin at 4 p.m. CT. Watch here: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 3/31/20 facebook.com", "2020-03-31T15:24:09.000Z": "State Engineer Garland Erbele is retiring today after four decades of public service and four years with the State Water Commission. We're grateful to Garland for his leadership on important water projects and to John Paczkowski for stepping in as Interim State Engineer.", "2020-03-30T20:53:45.000Z": "Today's press briefing on COVID-19 with @SenJohnHoeven and @SenKevinCramer begins at 4 p.m. CT. Watch live: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 3/30/20 facebook.com", "2020-03-30T20:07:21.000Z": "In times of crisis, it's more important than ever to make sure we're all doing our part to stop the spread of rumors. Before you share, check the facts. #InThisTogetherND", "2020-03-30T15:12:37.000Z": "It's with heavy hearts that we announce the second death in ND related to COVID-19. Each loss of life deeply affects that person's loved ones, and that loss reverberates across each community and the entire state. We all have a role to play in slowing the spread of coronavirus.", "2020-03-29T20:16:01.000Z": "Thank you @SenKevinCramer , @SenJohnHoeven & @RepArmstrongND for your strong support of this request and your tireless work to prioritize the needs of North Dakotans and all Americans in the CARES Act. #InThisTogether  #COVID19ND  @NDResponse  @NDDOH Quote Tweet Sen. Kevin Cramer @SenKevinCramer . @SenJohnHoeven , @RepArmstrongND , and I support Gov. @DougBurgum 's request and urge President @realDonaldTrump to approve it quickly.\n\nWe appreciate @POTUS 's strong leadership and tireless work during #COVIDー19 .\n\nWe trust he will provide North Dakota with the resources it needs. twitter.com/DougBurgum/sta Show this thread", "2020-03-29T19:27:40.000Z": "On Vietnam Veterans Day, we share our unending gratitude for their incredible service and sacrifice in the name of freedom.", "2020-03-29T15:55:53.000Z": "We appreciate all who have watched our press briefings over the past two weeks. Please note that there will not be a briefing today. Briefings will resume at 4 p.m. Monday, March 30.", "2020-03-29T15:55:52.000Z": "ND has requested a major presidential disaster declaration to unlock federal assistance to support our response to the COVID-19 pandemic. \n\nThis is critical for our capability to expand North Dakota's response to the rapidly evolving impacts of COVID-19. Burgum requests major presidential disaster declaration for response to COVID-19 pandemic Gov. Doug Burgum has requested a major presidential disaster declaration to unlock federal assistance to support North Dakota's response to the COVID-19 pandemic. governor.nd.gov", "2020-03-29T01:30:17.000Z": "Whether or not a test has confirmed that your county has a positive case, we all need to take precautions against the spread of this disease. Visit the @NDDOH website to learn how you can help to slow the spread. Coronavirus health.nd.gov", "2020-03-29T01:30:16.000Z": "ND saw its largest jump in confirmed cases of COVID-19 today. \n\nCollecting this data is important, and we continue to work to expand our testing capacity. It's important for North Dakotans to understand this is not a complete picture of the prevalence of COVID-19 in our state. Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs have completed 399 total tests today for COVID-19 as of 4:00pm CT, with 11 new positive cases since 9:00am, bringing the statewide total to 94.\n\nState & private labs have conducted 3,107 total tests with 3,013 negative results. Show this thread", "2020-03-28T20:54:45.000Z": "Tune into today's briefing on COVID-19 with the @NDDOH at 4 p.m. CT. ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 3/28/20 facebook.com", "2020-03-28T15:45:31.000Z": "North Dakota has confirmed 15 new cases of COVID-19, for a total of 83 cases.\n\nWe know this number will continue to rise. Everyone needs to take steps to slow the spread and #flattenthecurve : stay home, avoid non-essential trips, wash your hands and keep physical distance. Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs have completed 184 total tests today for COVID-19 as of 9:00am CT, with 15 new positive cases, bringing the statewide total to 83.\n\nState & private labs have conducted 2,892 total tests with 2,809 negative results. Show this thread", "2020-03-27T23:08:33.000Z": "Within the past couple of days, for the first time, ND's number of confirmed COVID-19 cases attributed to community spread surpassed the number of travel-related or close-contact cases.\n\nIt's everyone's responsibility to help slow the spread of this virus & protect public health.", "2020-03-27T23:08:32.000Z": "Today I signed an order directing the closure of all salons operated by licensed cosmetologists, as well as massage therapy, barbershop and tattoo facilities, effective 12 a.m. Saturday, March 28 until April 6. Burgum expands business closures to protect health, suspends unemployment taxes to help employers Gov. Doug Burgum expanded business closures in North Dakota to help slow the spread of the novel coronavirus and protect public health, while also suspending payment of unemployment taxes to allow... governor.nd.gov", "2020-03-27T20:52:51.000Z": "Watch today's press briefing at 4 p.m. CT for the latest on COVID-19 in North Dakota. North Dakota Department of Health on Facebook Watch ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 3/27/20 facebook.com", "2020-03-27T16:19:01.000Z": "Sadly, ND has experienced its first death related to COVID-19. Kathryn & I extend our deepest condolences to the family & friends who have lost a loved one. Each of us has a responsibility to help prevent the spread of COVID-19. We're all in this together. ​​​​​​​North Dakota Department of Health reports first death related to COVID-19 The North Dakota Department of Health (NDDoH) today reported the first confirmed death of a North Dakota resident due to COVID-19, the disease caused by the novel coronavirus. The death occurred in... ndresponse.gov", "2020-03-26T23:37:08.000Z": "Access to child care is essential for health, safety and other lifeline workers during the COVID-19 pandemic. \n\nToday we released modified operating practices & an emergency grant program for child care providers to help them through this crisis. Details: Burgum releases child care guidelines, signs order to allow for mail ballot elections during... Gov. Doug Burgum released modified operating practices and an emergency grant program for child care providers to help them through the COVID-19 crisis and ensure that child care services are... governor.nd.gov", "2020-03-26T20:58:22.000Z": "Watch today's press briefing regarding child care and other updates on the COVID-19 pandemic in North Dakota. ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 3/26/20 facebook.com", "2020-03-26T16:06:39.000Z": ". @NDDOH confirmed 7 new cases of COVID-19 in ND this morning, increasing the statewide total of confirmed cases to 52.\n\nAs of this morning, state & private labs have conducted 2,091 total tests with 2,039 negative results. #COVID19ND", "2020-03-26T02:45:50.000Z": "The North Dakotans behind #aworldofhearts have shown how a simple gesture of gratitude can spread throughout the world. We are #InThisTogetherND", "2020-03-26T01:55:26.000Z": "In uncertain times, we turn to the caring spirit of North Dakotans who find ways to help neighbors & strangers in need.\n\nWhether it's a friend's kind deed or an uplifting message on the sidewalk, we encourage you to share these stories at @TogetherND . \n\nWe are #InThisTogetherND .", "2020-03-25T23:53:10.000Z": "ND's first responders and health care workers are on the front lines of the COVID-19 fight.\n\nToday's exec. order expands worker's compensation coverage to 80K workers who are now eligible for benefits if they contract COVID-19 or are quarantined. Details: Burgum extends worker's compensation to first responders, health workers who contract COVID-19 Gov. Doug Burgum signed an executive order extending worker's compensation coverage to first responders and health care providers who contract COVID-19 on the job. governor.nd.gov", "2020-03-25T21:03:02.000Z": "Watch today's press briefing on COVID-19 in North Dakota. ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 3/25/20 facebook.com", "2020-03-25T16:23:32.000Z": "With 171 more test results in, ND has 3 new confirmed cases of COVID-19, bringing our total to 39, with 8 hospitalizations.\n\nPlease continue to stay home, avoid non-essential trips and keep physical distance. It's everyone's responsibility to be #NDSmart and help slow the spread. Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs have conducted 171 total tests today for COVID-19 as of 9:00am CT, with three new positive cases, bringing the statewide total to 39.\n\nState & private labs have conducted 1,773 total tests with 1,734 negative results. Show this thread", "2020-03-24T22:56:40.000Z": "We're continuing to take your input and explore ways to better serve North Dakotans through this COVID-19 crisis. \n\nToday the Bank of North Dakota announced that student loan borrowers may request to defer payments for six months. Learn more & opt in here: Student Loan Relief Program - Bank of North Dakota This program will assist student loan borrowers experiencing financial hardship related to the COVID-19 pandemic. bnd.nd.gov", "2020-03-24T21:05:28.000Z": "Tune in to today's COVID-19 press briefing. ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 3/24/20 facebook.com", "2020-03-24T19:45:34.000Z": "Health care providers have been collecting specimens for COVID-19 testing from almost all areas of North Dakota. These specimens are then tested at a state or private lab. This map breaks down completed tests by county. Quote Tweet ND Department of Health @NDDOH As of today at noon, 49 of the 53 counties in North Dakota have had at least one COVID-19 test performed. Take a look at this map to see how many tests have been performed in your county!\n\nFuture updates to this map will be found on the NDDoH COVID-19 site http:// health.nd.gov/coronavirus Show this thread", "2020-03-24T00:18:34.000Z": "We will need a fully functioning child care system when this pandemic is over and our economy gets back on track. Read more below. (3/3) Guidelines being developed to ensure child care for essential workers through COVID-19 crisis North Dakota has launched a rapid planning process to develop operating guidelines to ensure that child care is available for health care and other essential workers through the COVID-19 crisis, Gov.... governor.nd.gov", "2020-03-24T00:18:33.000Z": "We've launched a rapid planning process to develop operating guidelines to ensure that child care is available for health care and other essential workers through the COVID-19 crisis. (1/3)", "2020-03-23T20:58:52.000Z": "Watch today's press briefing on COVID-19 at 4 p.m. with @NDDPI Supt. Kirsten Baesler and @NDHumanServices Executive Director Chris Jones. Watch live here: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 3/23/20 facebook.com", "2020-03-23T19:47:31.000Z": "In North Dakota and around the world, individuals and families are experiencing significant changes in their lives. It can be hard to navigate all of the information to find what you need to know. Team ND wants to help.\n\nVisit http:// NDResponse.gov/covid-19-resou rces  for more. Quote Tweet NDResponse @NDResponse The COVID-19 pandemic has impacted many facets of our daily lives. We've compiled information pertaining to both state and federal resources that could be useful to you during these challenging times. Visit https:// ndresponse.gov/covid-19-resou rces  to learn more. #coronavirus  #NDSmart", "2020-03-23T13:39:28.000Z": "Curious how the NDDoH tests for the novel coronavirus? Watch this quick video to see how the process works.\n\nGrateful for the members of Team ND and all of North Dakota's health professionals working tirelessly to fight this pandemic. Quote Tweet ND Department of Health @NDDOH Your ND Dept of Health State Laboratory is putting in long hours to run tests for COVID-19. Ever wondered what those tests look like? NDDoH Director of Microbiology Dr. Christie Massen joins us today to take you inside our State Lab for a look at how the testing process works!", "2020-03-22T23:19:47.000Z": "The NDDoH lab confirmed 2 new cases of COVID-19 in ND today.\n\nIt's important to note these tests have a lag time - results will not be an immediate indicator of how well we're practicing #socialdistancing . Now is not the time to be complacent. We've got to be vigilant. #COVID19ND Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs have conducted 173 total tests today for COVID-19 as of 4:00pm CT, with two new positive cases since 9:00am for a statewide total of 30.\n\nState & private labs have conducted 1,355 total tests with 1,325 negative results. Show this thread", "2020-03-22T21:31:53.000Z": "Watch today's press briefing with the @NDDOH here: ND Dept of Health Joint Information Center daily COVID-19 press... ND Dept of Health Joint Information Center daily COVID-19 press briefing with Governor Doug Burgum 3/22/20 facebook.com", "2020-03-22T14:59:44.000Z": "No new positive cases of COVID-19 from the most recent @NDDOH report. North Dakota's confirmed positive cases remains at 28.\n\nStay home, avoid non-essential trips and practice social distancing. It's everyone's responsibility to be #NDSmart and help slow the spread. #COVID19ND Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs have conducted 106 total tests today for COVID-19 as of 9:00am CT, with no new positive cases reported, keeping the statewide total at 28.\n\nState & private labs have conducted 1,288 total tests with 1,260 negative results.", "2020-03-22T00:10:45.000Z": "To expand the availability of COVID-19 testing, I signed an executive order authorizing licensed pharmacists to administer tests in collaboration with @NDDOH . It also streamlines the process for essential prescription medication refills during this crisis. Burgum signs executive order to help slow spread of COVID-19, expand testing locations BISMARCK, N.D. - Gov. Doug Burgum today signed an executive order designed to help slow the spread of coronavirus (COVID-19) and expand testing locations for North Dakotans. governor.nd.gov", "2020-03-21T20:56:51.000Z": "Tune into today's press briefing with health care leaders at 4 p.m. CT. ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum 3/21/20 The briefing will begin at 4:00pm CT. facebook.com", "2020-03-21T15:10:43.000Z": "With 231 tests conducted so far today, 2 have been positive, bringing North Dakota's confirmed positive cases of COVID-19 to 28.\n\nStay home, avoid non-essential trips and practice social distancing. Be #NDSmart and help slow the spread. #COVID19ND . Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs have conducted 231 total tests today for COVID-19 as of 9:00am CT, with two new new positive cases for a statewide total of 28.\n\nState & private labs have conducted 1,169 total tests with 1,141 negative results. Show this thread", "2020-03-21T00:33:26.000Z": "By cutting red tape & streamlining services, state government can better serve North Dakotans & provide relief during this stressful time.\n\nToday I signed 3 executive orders addressing unemployment insurance, burdensome regulations & expanding telehealth. State takes steps to reduce regulatory burdens to help North Dakotans through COVID-19 crisis Gov. Doug Burgum signed three executive orders to reduce regulatory burdens and improve services for North Dakota citizens to help them through the coronavirus (COVID-19) crisis. governor.nd.gov", "2020-03-20T21:04:51.000Z": "Today's press briefing is live now. Watch here: ND Dept of Health Joint Information Center press briefing with... ND Dept of Health Joint Information Center press briefing with Governor Doug Burgum - 3/20/20 facebook.com", "2020-03-20T19:33:23.000Z": "During a crisis, misinformation is often our greatest enemy. New information regarding COVID-19 remains dynamic and constantly changing. Given the importance and fluidity of this situation it is vital that we circulate only factual reports and refrain from rumor.", "2020-03-20T15:07:49.000Z": "ND has now confirmed 20 total positive tests for COVID-19. \n\nA reminder that bars, restaurants, rec facilities & entertainment venues will close to on-site patrons at noon today until April 6. Continue practicing social distancing and help slow the spread. #COVID19ND  #NDSmart . Quote Tweet ND Department of Health @NDDOH The NDDoH & private labs have conducted 147 total tests today for COVID-19 as of 8:30am, with one new positive case in Morton County for a statewide total of 20.\n\nState & private labs have conducted 820 total tests with 800 negative results. #ndsmart  #stateofcalm  #factsnotfear Show this thread", "2020-03-20T00:28:59.000Z": "Today I signed an executive order directing bars, restaurants, recreational facilities and entertainment venues to close to on-site patrons tomorrow at noon until April 6 to slow the spread of COVID-19. Read more: Burgum orders bars, restaurants closed to on-site patrons; provides additional guidance for K-12... Gov. Doug Burgum signed an executive order directing bars and restaurants to close to on-site patrons and issued additional guidance for K-12 schools to continue to educate students with alternative... governor.nd.gov", "2020-03-19T21:22:49.000Z": "Watch today's press conference on plans for K-12 education, state facilities, on-site dining establishments and recreational facilities. ND Dept of Health Joint Information Center press conference with... ND Dept of Health Joint Information Center press conference with Governor Doug Burgum 3/19/20 facebook.com", "2020-03-19T18:15:38.000Z": "For North Dakota businesses feeling the effects of COVID-19, @CommerceND has assembled important information pertaining to both state and federal resources for businesses and communities affected economically.\n\nExplore available resources: http:// business.nd.gov/resources/COVI D19BusinessandEmployerResources/  Quote Tweet North Dakota Dept. of Commerce @CommerceND Thank you to @DougBurgum for kicking off our first #COVID19NDBrief and reminding us of the importance of #socialdistancing . #NDSmart  #FactsNotFear", "2020-03-19T16:13:10.000Z": "North Dakota has now confirmed 15 total positive tests for COVID-19. It's critically important that you stay home when you're sick and practice social distancing.\n\nFollow the @NDDOH & visit http:// health.nd.gov/coronavirus to stay up to date with the latest info. http:// health.nd.gov/news/state-hea lth-officials-confirm-eight-additional-cases-covid-19-north-dakota-make-changes  Quote Tweet ND Department of Health @NDDOH The NDDoH and private laboratories have conducted 146 total tests today for COVID-19 as of 10:00am, with 1 new positive case in Morton County and Burleigh County for a statewide total of 15.\n\nThe state lab has conducted 508 total tests with 493 negative results. Show this thread", "2020-03-19T02:04:54.000Z": "The COVID-19 pandemic can create feelings of fear and anxiety. @NorthDakotaBH put together helpful resources for managing your well-being along with your friends, family and community. #BehavioralHealthIsHealth  http:// behavioralhealth.nd.gov/covid-19 Quote Tweet ND Behavioral Health @NorthDakotaBH NEW - tips and tools on managing our behavioral health during this #COVID19 pandemic. Learn more here: https:// bit.ly/33uItXi  #behavioralhealthishealth  #Stateofcalm", "2020-03-18T22:50:32.000Z": "Today we confirmed our first 2 cases of community transmission of COVID-19, bringing our total to 7 positive cases in ND.\n\nFollow the @NDDOH and visit http:// health.nd.gov/coronavirus for the latest information. Quote Tweet ND Department of Health @NDDOH The NDDoH Division of Microbiology has conducted 109 total tests today for COVID-19 as of 5:00pm, with one additional new positive case in Morton County since 9:30am for a statewide total of 7.\n\nThe state lab has conducted 362 total tests with 355 negative results.", "2020-03-18T21:02:05.000Z": "With North Dakota's first confirmed cases of community transmission of COVID-19, @NDDOH Field Medical Officer Joan Connell helps explain what that means and how to slow the spread of the novel coronavirus. Tune into a news conference on http:// facebook.com/ndhealth now for more. Quote Tweet ND Department of Health @NDDOH We've been learning a lot of new terminology during the COVID-19, pandemic. What is community spread? And how do we use social distancing to minimize that spread? NDDoH Field Medical Officer Joan Connell, MD, explains how social distancing is everyone's responsibility.", "2020-03-18T14:53:11.000Z": ". @NDDOH confirmed a new case of COVID-19 in Morton County, which is the first confirmed case of community spread of the disease in ND. \n\nIt's critically important to practice social distancing and stay home when you're sick, even if it's minor. http:// health.nd.gov/news/new-case- covid-19-morton-county-north-dakotas-first-confirmed-case-community-spread  Quote Tweet ND Department of Health @NDDOH The NDDoH Division of Microbiology has conducted 21 tests today for COVID-19 as of 9:30am, with one new positive case in Morton County. This is the first case in ND to be associated with community spread.\n\nThe state lab has conducted 274 total tests with 268 negative results.", "2020-03-18T01:31:27.000Z": ". @NDDOH confirmed two new cases of COVID-19 tonight in Burleigh County, for a total of 5 positive cases in ND.\n\nFor questions related to COVID-19, you can call 1-866-207-2880 daily from 7am-10pm. For medical advice, contact your health care provider. http:// health.nd.gov/news/updated-s tate-health-officials-confirm-two-additional-cases-novel-coronavirus-north-dakota ", "2020-03-17T22:08:16.000Z": "COVID-19 is causing financial anxiety around the world, so today we spoke w/ 150 leaders from ND's banks to address concerns and make sure the state and business community is prepared for the financial impacts of this pandemic. Get the latest info at http:// health.nd.gov/coronavirus", "2020-03-17T21:15:42.000Z": "WATCH: Press conference with @NDDOH to discuss two additional positive cases of COVID-19 in North Dakota and the importance of social distancing to slow the spread of coronavirus. ND Department of Health Joint Information Center press conference... ND Department of Health Joint Information Center press conference with Governor Doug Burgum - March 17, 2020 The press conference will begin at... facebook.com", "2020-03-17T19:56:17.000Z": "The @NDDOH confirmed two additional cases of COVID-19 in residents from Cass & Ward counties. \n\nThis increase in cases underscores the importance of exercising personal responsibility & following the CDC & White House recommendations for social distancing. http:// health.nd.gov/news/state-hea lth-officials-confirm-two-additional-cases-novel-coronavirus-north-dakota  Quote Tweet ND Department of Health @NDDOH The NDDoH Division of Microbiology has conducted 74 tests for COVID-19 today as of 2:30pm, with two tests coming back positive. The cases are in Ward County and Cass County.\n\nThe state lab has conducted 223 total tests with 220 negative results. https:// health.nd.gov/news/state-hea lth-officials-confirm-two-additional-cases-novel-coronavirus-north-dakota ", "2020-03-17T17:15:30.000Z": "#SocialDistancing : Look below to see what this means for you.\n\nThis is especially important on St. Patrick's Day, when you might be accustomed to going out to celebrate with friends. We all have a role to play in slowing the spread of coronavirus. Quote Tweet ND Department of Health @NDDOH Over the last few days, people have been urged to participate in #SocialDistancing to help stop the spread of COVID-19, but what does that mean? Use this graphic as a guide for the best ways to keep yourself safe and #FlattenTheCurve !", "2020-03-16T23:45:50.000Z": "K-12 schools which were closed this week will NOT have to make up the instructional time later this school year.\n\nGranting these waivers ensures that districts will be able to pay teachers and hourly employees through this weeklong closure. Burgum: K-12 schools won't have to make up instructional time from coronavirus-related closure Gov. Doug Burgum announced that K-12 schools which were closed this week by executive order will not have to make up the instructional time later this school year. governor.nd.gov", "2020-03-16T20:40:55.000Z": "News about COVID-19 is everywhere and concerns can result in children feeling anxious. As you take steps to protect your physical health, remember to address your family's behavioral health needs.\n\nVisit http:// ParentsLead.org/COVID-19 for resources to guide your family's conversation.", "2020-03-16T19:30:13.000Z": "Our Unified Command is working with state, local & tribal partners to slow and mitigate the spread of COVID-19 and protect our citizens. We'll continue to keep you informed as the situation develops. \n\nQuestions? Visit http:// health.nd.gov/coronavirus or call @NDDoH at 1-866-207-2880.", "2020-03-16T02:28:48.000Z": "To slow the spread of COVID-19 and protect our citizens, public and private schools will be closed March 16-20. We want to work through the situation, gain understanding and make sure we're driven by data and solid strategies. Burgum orders K-12 schools to close for one week in effort to slow spread of COVID-19 By executive order, Gov. Doug Burgum ordered the closure of North Dakota K-12 schools in an effort to slow the spread of COVID-19 based on guidance from public school superintendents, medical experts... governor.nd.gov", "2020-03-16T00:30:12.000Z": "Happening now: press conference about K-12 school closures related to the COVID-19 pandemic. Watch live: ND Dept of Health Joint Information Center press conference with... ND Dept of Health Joint Information Center press conference with Governor Doug Burgum regarding K-12 schools and the COVID-19 pandemic. The press... facebook.com", "2020-03-15T02:03:25.000Z": "We're taking a whole-of-government approach to prevent and slow the spread of coronavirus and to continue and expand upon the efforts of the @NDDOH . http:// health.nd.gov/news/state-lab -reports-no-new-positive-results-covid-19-response-efforts-expand-under-unified  Thread Quote Tweet ND Department of Health @NDDOH Today, @DougBurgum convened members of the state's #COVID19 Unified Command. The Unified Command is led by State Health Officer Mylynn Tufte and adjutant general, Maj. Gen. Alan Dohrmann. See below for 11 actions taken to prevent, contain and mitigate the spread of COVID-19. 1/12 Show this thread", "2020-03-13T21:21:17.000Z": "Read more and view the executive order below: UPDATED: Burgum declares state of emergency in response to coronavirus; K-12 guidance issued Gov. Doug Burgum declared a state of emergency for North Dakota in response to the novel coronavirus (COVID-19) public health crisis and issued guidance to K-12 schools with Superintendent of Public... governor.nd.gov", "2020-03-13T21:14:12.000Z": "We have announced the declaration of a state of emergency for North Dakota in response to COVID-19 and issued guidance to K-12 schools. Watch the press conference on http:// facebook.com/ndhealth  #coronavirus", "2020-03-12T13:46:11.000Z": "Watch the press conference with @NDDOH at 9 a.m. CT on Facebook: http:// facebook.com/ndhealth/", "2020-03-12T02:33:18.000Z": "Tonight, @NDDOH confirmed North Dakota's first presumptive case of COVID-19 in a Ward County resident. We have been planning and preparing for this since January, and our top priority is your health, safety and well-being. First case of novel coronavirus confirmed in North Dakota as work continues to prevent spread The North Dakota Department of Health (NDDOH) has confirmed the state's first presumptive case of novel coronavirus disease (COVID-19) in a Ward County resident, Gov. Doug Burgum announced with... governor.nd.gov", "2020-03-11T22:28:06.000Z": "Every North Dakotan has a role to play in reducing the spread of COVID-19. The @WhiteHouse and @CDCgov have provided state, local, tribal and community leaders with the latest helpful actions for all Americans. Learn more here: http:// cdc.gov/coronavirus/20 19-ncov/downloads/workplace-school-and-home-guidance.pdf ", "2020-03-11T20:26:42.000Z": "Community efforts to prepare for spring flooding are underway in several regions around the state. Visited Sandbag Central in @cityoffargo today to discuss flood preparations with local officials and thank the volunteers who are helping to fill 400,000 sandbags this week.", "2020-03-11T15:26:15.000Z": "Thanks to @1MillionCupsFar for hosting a conversation on behavioral health today! #1MCFar  @FirstLadyND announced the fourth annual Recovery Reinvented, Sept. 29 in Grand Forks. Details: http:// governor.nd.gov/news/first-lad y-announces-fourth-annual-recovery-reinvented-be-held-grand-forks-sept-29 ", "2020-03-11T00:40:17.000Z": "While we'll be wearing different shades of green, @BrentSanfordND & I wish best of luck to @NDSUmbb and @UNDmbasketball in tonight's Summit League championship. Thanks to both teams for representing our state well & making sure a ND team is punching their ticket to @marchmadness !", "2020-03-10T20:52:00.000Z": "The ND Emergency Commission voted today to accept up to $6 million in federal funds to contain & mitigate the spread of COVID-19. Grateful to Congress and @POTUS for approving $8.3 billion for #coronavirus preparedness, prevention & treatment efforts. ND Emergency Commission votes to accept federal funds for COVID-19 response The North Dakota Emergency Commission voted today to accept up to $6 million in federal funds to contain and mitigate the spread of the coronavirus disease, COVID-19. governor.nd.gov", "2020-03-10T00:28:27.000Z": "Our highest priority is the health, safety and well-being of all North Dakotans, and that especially includes our seniors and individuals with serious chronic medical conditions who are among the most vulnerable to COVID-19. Read about steps you can take: In fight against coronavirus, Burgum urges focus on protecting seniors and other higher-risk... Gov. Doug Burgum urged North Dakotans to take precautions to protect themselves and especially senior citizens and other populations who are particularly vulnerable to the coronavirus disease,... governor.nd.gov", "2020-03-09T20:29:37.000Z": "Over the weekend, @NDDOH tested four individuals for COVID-19, and all tests came back negative. Learn more: http:// health.nd.gov/news/state-lab -tests-individuals-novel-coronavirus-tests-are-negative  While we have not had a case in ND, everyone has a role to play in reducing the spread of COVID-19. Learn what you can do: Coronavirus health.nd.gov", "2020-03-06T16:03:43.000Z": "Students, jobseekers and employers: this is the place to be on April 8!\n\nJoin us for Dakota Strike, a first-of-its-kind, multi-industry career expo aimed at addressing the state's workforce shortage and highlighting the importance of 21st century skills. Burgum announces sponsors for multi-industry career expo at Fargodome Gov. Doug Burgum announced the sponsors currently committed for Dakota Strike, a first-of-its-kind, multi-industry career expo aimed at addressing the state's workforce shortage and highlighting the... governor.nd.gov", "2020-03-05T22:55:36.000Z": "Stay tuned to @NDDOH for the latest coronavirus updates. Our focus continues to be preparation, and our top priority is always the safety of North Dakota citizens. Quote Tweet ND Department of Health @NDDOH COVID-19 UPDATE: Michelle Dethloff from the Division of Disease Control updates you on the number of cases of COVID-19 in the US, and reminds you that though there are no cases yet in ND, there are steps you can take to prepare!", "2020-03-04T17:27:25.000Z": "Big thanks to Plug and Play and its corporate partners for their investment in ND's entrepreneurial ecosystem! As a national leader in ag tech, ND is an ideal place for startups from around the globe to test their technology, grow their companies and advance agriculture. Quote Tweet Plug and Play @PlugandPlayTC We're excited to announce our newest location in Fargo, North Dakota with a focus on #agtech , in partnership with Founding Partners: @BremerBank , @CHSInc , @Microsoft , and @ocpgroup !\n\nFind out more  https:// prn.to/38iGdmt  #PnPNewPartner  #corporateinnovation", "2020-03-04T16:41:15.000Z": "Grateful for the opportunity this morning at the @FMWFChamber to engage with local business, education and nonprofit leaders and discuss efforts to address our workforce challenges and diversify the economy!", "2020-03-03T21:54:34.000Z": "State agencies are working together with federal & local partners to prepare for the potential of coronavirus cases in North Dakota. We all have a role to play in keeping our citizens and communities healthy. Read the latest information from @NDDOH here: http:// governor.nd.gov/news/burgum-st ate-health-officials-empower-north-dakotans-assist-preventing-spread-covid-19  . Burgum, state health officials empower North Dakotans to assist in preventing spread of COVID-19 Gov. Doug Burgum and other state officials provided an update and highlighted statewide efforts in response to COVID-19. No cases have been reported in North Dakota and the risk remains low; however,... governor.nd.gov", "2020-03-02T20:06:55.000Z": "Participated with fellow governors in a briefing call from @VP Pence and @SecAzar regarding the response to COVID-19. \n\nWe'll provide an update on the state's preparations at a press conference at 2:00 p.m. tomorrow, which will be streamed live at: https:// facebook.com/ndhealth .", "2020-03-01T17:30:34.000Z": "Calling all school, community and church bands, orchestras and choirs across North Dakota: apply to serve as the Governor's Official State Band/Orchestra Program and Choral Program for 2020! Submit an application by March 13 at this link: https:// governor.nd.gov/form/governor- s-chorus-and-band-orche ", "2020-02-28T22:16:17.000Z": "We are actively monitoring the COVID-19 situation with @NDDOH and taking all appropriate measures to prevent the spread of coronavirus and fine-tune response plans. The health, safety and well-being of our citizens remains our top priority. Read more: Health officials prepare for spread of new coronavirus, or COVID-19 The North Dakota Department of Health (NDDoH) continues to proactively and carefully monitor travelers from China in North Dakota daily and plan for community spread of COVID-19. Currently, nine... health.nd.gov", "2020-02-27T23:12:40.000Z": "Local leaders drive important initiatives affecting workforce, infrastructure & more, and we're working closely with city officials to improve quality of life. Appreciate the opportunity to join the ND League of Cities today & speak with mayors representing 450K+ North Dakotans!", "2020-02-26T21:40:36.000Z": "Thanks to Cavendish Farms and President Robert K. Irving for their continued commitment to ND and for taking the time to discuss ways to grow our potato industry. Not only do they make a delicious product, they support agriculture and community development in Jamestown & beyond!", "2020-02-25T19:15:15.000Z": "\"As a team, we've really invested time ... to help them understand the nature of the threat, what we have in place to address the threat, and what is needed to have a comprehensive, world-class cybersecurity posture,\" said @ndgovitd CIO Shawn Riley. A Road Map for Better Government Cybersecurity From North Dakota Imagine the impact on the government cybersecurity landscape if the mantra for every U.S. state were something like, \"Every student, every school, cyber-educated.\" securityintelligence.com", "2020-02-25T15:45:34.000Z": "Hundreds of partners work together across many industries every day to ensure the safety of ND's workers. Thanks to the ND Safety Council for bringing the latest & greatest in safety training and tools to its annual conference and to @NDWSI for its role in promoting safety!", "2020-02-20T19:27:52.000Z": "North Dakota's entrepreneurs and innovators - people who care deeply about their community and the business and institutions they lead - are powering our strong economy. Thanks to the @FMWFChamber for the opportunity to speak at their 2020 Economic Outlook Forum! #EOF20", "2020-02-20T14:51:16.000Z": "Broadband is critical infrastructure for a 21st century economy, and North Dakota is well-positioned to continue being \"one of the most connected states in the country.\" 'As essential as roads': How one of America's most rural states became a broadband leader North Dakota is ranked as one of the connected states in the country. It's a giant feat considering it's also one of the most rural. finance.yahoo.com", "2020-02-19T22:31:39.000Z": "Welcome! Thanks for visiting Minot AFB, including our @NDNationalGuard 219th Security Forces Squadron. @TeamMinot is essential to the nuclear triad, and the work of the 5th Bomb Wing and 91st Missile Wing helps the U.S. achieve peace through strength. #OnlyTheBestComeNorth Quote Tweet Dr. Mark T. Esper @EsperDoD Warm welcome at Minot Air Force Base. Looking forward to hearing from @TeamMinot about the remarkable work they do in strategic deterrence, global strike & combat support. #GlobalStriker  #NuclearDeterrence", "2020-02-19T18:45:35.000Z": "The Battle of Iwo Jima began 75 years ago today, lasting 36 days and claiming the lives of nearly 7,000 brave Americans, one of the deadliest conflicts in the Pacific Theater of WWII. On this day, we honor their incredible service and sacrifice. #IwoJima75 From U.S. Marines", "2020-02-18T22:07:24.000Z": "Save the date for the 2020 Governor's Summit on Innovative Education! We look forward to gathering June 16-17 in Mandan to discuss the future of education in North Dakota. More details to come!", "2020-02-17T19:32:08.000Z": "In honor of the inspirational leaders who have shaped this country we call home, Happy Presidents Day! : NPS Photo", "2020-02-15T20:01:27.000Z": "Congratulations to the @jimmiemvb team on some historic firsts - claiming ND's first @NAIA men's volleyball match ever played in the state & their first home win!\n\nShout out to head coach & past #RecoveryReinvented speaker, Riley Salmon, on leading his team to a 3-0 sweep!", "2020-02-14T17:53:34.000Z": "North Dakota is the best state in the Midwest to do business! Thanks to reliable infrastructure, low taxes, a skilled workforce and a focus on technology and innovation, our state is a terrific environment for businesses to grow. Via @247WallSt  https:// 247wallst.com/special-report /2020/02/13/best-and-worst-states-for-business-2/2/ ", "2020-02-13T17:53:23.000Z": "It's a great day to give! Grateful to the volunteers who joined us to celebrate #GivingHeartsDay in Bismarck. More than 14,000 individuals have already contributed to important causes throughout the region - join them at http:// givingheartsday.org !", "2020-02-13T15:21:34.000Z": "Going live on @GivingHeartsDay TV with @FirstLadyND at 9:30! Tune in on Facebook and make your contribution at http:// givingheartsday.org .", "2020-02-12T23:21:12.000Z": "Always a highlight receiving the Boy Scouts Report to the State! Hearing these young people share their experiences with the @NLCBSA over the past year is inspiring and shows how bright the future of our state is!", "2020-02-12T17:29:26.000Z": "Tomorrow is @GivingHeartsDay ! Join us for 24 hours of giving to benefit nearly 500 outstanding local organizations. Visit http:// givingheartsday.org to make your contribution. Together, we can be the most generous place on the planet! #GivingHeartsDay", "2020-02-11T23:37:32.000Z": "Thankful to @POTUS , @VP and the administration for engaging with governors at yesterday's @WhiteHouse business session on the issues that matter most to our states. Across the nation, states are successfully implementing unique solutions to solve our most complex challenges!", "2020-02-09T21:11:15.000Z": "In addition to maintaining a border, SK & North Dakota hold a number of shared economic interests. Governor @DougBurgum & I sat down to discuss the $1.5B trade relationship between our jurisdictions & how we can work together to continue building our trading relationship.", "2020-02-09T19:14:34.000Z": "From droughts to floods, building resiliency against natural disasters is a critical need across America. Glad to join @GovJanetMills and @GavinNewsom at @NatlGovsAssoc to talk about steps states can take to protect our citizens. #WeTheStates", "2020-02-09T15:20:44.000Z": "Thanks to @SecBernhardt for hosting western governors and Cabinet secretaries at @Interior this morning! As chair of @westgov , grateful to have such strong partnerships as we drive our Reimagining the Rural West initiative.", "2020-02-08T23:26:12.000Z": "Terrific discussion about energy today with Alberta Premier @jkenney and Acting Ambassador @KirstenHillmanA . Alberta leads oil and natural gas production in Canada, making them a valuable partner in promoting research and encouraging innovation in our energy industries!", "2020-02-08T22:45:02.000Z": "Grateful to meet with the U.S.-Canada Inter-Parliamentary Group today as the #USMCA is in the process of being ratified by Canada. As North Dakota's largest trading partner, continuing our strong relationship with our neighbors to the north is essential to our state's economy.", "2020-02-07T22:32:57.000Z": "Each state can be a platform for innovation, and that's how North Dakota will seize the opportunities that lie ahead and solve the complex issues we face. Grateful to @politico for hosting today's #StateSolutions Conference! Quote Tweet NGA @NatlGovsAssoc Passage of the #USMCA North American trade agreement was a boon to North Dakota, said @DougBurgum at the @PoliticoLIVE  #StateSolutions event. \"It's a very big deal for us to have that kind of certainty and stability both for energy and for agriculture.\" https:// politico.com/live-events/20 20/02/07/tenth-annual-state-solutions-conference-000470 ", "2020-02-07T18:56:34.000Z": "Joining @POLITICOLive to talk about trade, energy, agriculture and all things North Dakota for the 10th Annual #StateSolutions Conference! Watch the livestream starting in five minutes at 10th Annual State Solutions politico.com", "2020-02-05T05:05:20.000Z": "Tonight President Trump outlined a vision for America that builds upon the economic growth, historic low unemployment and rising wages that have benefited citizens in North Dakota and across the nation under his administration. My full statement: Burgum statement on 2020 State of the Union Address Gov. Doug Burgum expressed his support for the priorities outlined by President Donald Trump in his 2020 State of the Union Address, including strengthening the economy through new trade agreements... governor.nd.gov", "2020-02-04T21:56:48.000Z": ". @bakerboynd is a North Dakota success story, and they've made big investments in their operations in the past couple of years. Thanks for the tour today in Dickinson!", "2020-02-03T20:13:37.000Z": "Terrific example of how building a statewide air traffic control network for UAS will enable smart decisions utilizing real-time data. Great partnership between McKenzie County and ISight RPV! Drones to inspect McKenzie County roads after storms, help officials make closure decisions McKenzie County officials hope drones will help them make better-informed decisions about restricting traffic amid wet weather. bismarcktribune.com", "2020-02-03T17:00:16.000Z": "Exciting to see how oil and gas operators are responding to our challenge and pursuing cutting-edge technologies to enhance leak prevention and detection. Learn more about the iPIPE program at https:// ipipepartnership.com  @EnergyofND  #innovationoverregulation New Casper tech company hopes to use artificial intelligence to reduce oil leaks Flowstate, a pipeline leak detection software company funded by the True companies, is still gathering data and testing the product but hopes to have it on the market this year. trib.com", "2020-01-31T20:26:19.000Z": "Missed watching the State of the State address? Watch the full program at the link below! North Dakota Gov. Doug Burgum delivers his 2020 State of the State... North Dakota Gov. Doug Burgum delivers his 2020 State of the State address at the Chester Fritz Auditorium on the University of North Dakota campus in Grand ... youtube.com", "2020-01-31T16:31:48.000Z": "Our entrepreneurs, risk-takers and innovators are helping lead North Dakota into the future. Grateful to spend time with some of the region's brightest leaders at 1 Million Thanks!", "2020-01-30T02:33:31.000Z": "#USMCA is a victory for American farmers, business owners and innovators, modernizing trade and strengthening our relationships with ND's top 2 trading partners! Grateful to @USTradeRep and @POTUS for signing this historic deal and providing increased market access & certainty. Quote Tweet USTR @USTradeRep Thanks to President Trump's leadership and the work of Republicans and Democrats, the USMCA delivers a strong win for the American people.", "2020-01-29T22:14:58.000Z": "LaGrave on First provides an essential service in the Grand Forks community with permanent supportive housing. It's a great example of how the state can utilize the Housing Incentive Fund to work together with communities to build affordable housing.", "2020-01-29T18:24:13.000Z": "Investing Legacy Fund earnings in infrastructure will support commerce and drive economic prosperity throughout our state. #NDSOTS20  #NDgov", "2020-01-29T18:24:12.000Z": "As we envision the needs of this generation and beyond, we find ourselves today with a $6.8 billion Legacy Fund that, if utilized correctly, will help North Dakota reach its full potential. #NDSOTS20  #NDgov", "2020-01-29T18:18:53.000Z": "By partnering on these five strategic initiatives, together we can change this generation and chart a course for future generations. #NDSOTS20  #NDgov", "2020-01-29T18:06:21.000Z": "Excited to announce the Dakota Strike career expo, inviting young people to explore dozens of careers and thousands of job openings in ag, energy, manufacturing, UAS, military, health care, and more! https:// governor.nd.gov/news/burgum-an nounces-first-its-kind-technology-focused-career-expo-fargodome   #NDSOTS20  #NDgov Burgum announces first-of-its-kind, technology-focused career expo at Fargodome Gov. Doug Burgum today announced a first-of-its-kind, multi-industry career expo aimed at addressing the state's workforce shortage and highlighting the importance of 21st century skills such as... governor.nd.gov", "2020-01-29T17:58:12.000Z": "Over the last 3 years we've been dedicated to strengthening our government-to-government relationships with the 5 sovereign tribal nations with whom we share geography. Working together, we've honored that commitment, by listening first & making real progress. #NDSOTS20  #NDgov", "2020-01-29T17:44:02.000Z": "Team ND has saved taxpayers more than $1 million in avoided cost avoidance by providing standard back-end website technology for over 45 state agencies - all while providing a more consistent and user-friendly experience. #NDSOTS20  #NDgov  #ReinventingGovernment", "2020-01-29T17:36:39.000Z": "Together with the Legislature, we're piloting a first-of-its-kind statewide network that will support UAS flights beyond visual line of sight. This newest form of air traffic control will us help us diversify our economy, w/applications for ag, energy, etc.! #NDSOTS20  #NDGov", "2020-01-29T17:07:04.000Z": "We've taken meaningful steps toward our goal of making North Dakota the most military-friendly state in the nation. This is important as we compete with other states and, more importantly, for honoring the service of our brave military men and women. #NDSOTS20  #NDgov", "2020-01-29T17:03:09.000Z": "#NDSOTS20  #NDgov", "2020-01-29T16:58:05.000Z": "North Dakota is a state driven by farmers, ranchers, entrepreneurs and innovators. A people dedicated to the future who achieve amazing things with a humility that requires no recognition. A people who give without expectation of receiving anything in return. #NDSOTS20  #NDGov", "2020-01-29T16:14:36.000Z": "Tune in to the 2020 State of the State at 10:30 a.m. at https:// governor.nd.gov ! #NDSOTS20  #NDGov Home governor.nd.gov", "2020-01-27T17:40:33.000Z": "On #HolocaustRemembranceDay , #WeRemember the 6 million men, women and children who were victims of a massive genocide carried out against the Jewish people. Seventy-five years later, we must never forget and continue to reject hatred to ensure this never happens again.", "2020-01-27T00:13:56.000Z": "See you in Grand Forks this Wednesday for the State of the State! #NDSOTS20  #NDpol Quote Tweet Gov. Doug Burgum @DougBurgum Join us for the 2020 State of the State Address at 10:30am on January 29 at the Chester Fritz Auditorium in Grand Forks!", "2020-01-24T20:32:27.000Z": "North Dakota continues to work with local, state & federal partners - including the Office of National Drug Control Policy - to eliminate the stigma associated with the disease of addiction. \n\nGrateful to @FirstLadyND & @ONDCP Director Carroll for their meaningful collaboration! Quote Tweet ONDCP @ONDCP \"Addiction can be overcome, and people in long-term recovery continue to prove this fact every day.\"\n\nRead more from Director Jim Carroll and @FirstLadyND Kathryn Burgum in the @bistrib about how we can all help end the stigma of addiction and save lives: https:// bismarcktribune.com/opinion/letter s/letter-ending-stigma-the-first-step-to-ending-america-s/article_e62dbac7-0035-52ab-8df0-d778d46666c4.html ", "2020-01-24T03:03:23.000Z": "North Dakota's thriving economy is enabling a bright future full of opportunity. Great to be with hundreds of business leaders who are making it possible at the @bismanedc tonight!", "2020-01-21T19:47:46.000Z": "Grateful to @POTUS and @fema for approving our request for a major disaster declaration! This declaration will provide critical relief to local governments that incurred substantial costs from the historic early October rain and snowstorm. Read more: President Trump grants Burgum's request for major disaster declaration for flooding from rain,... President Donald Trump has approved Gov. Doug Burgum's request for a presidential major disaster declaration for the impacts of an October storm that dumped heavy rain and snow on a large swath of... governor.nd.gov", "2020-01-20T22:40:07.000Z": "High-speed connectivity is key to the prosperity of both our rural & urban areas in North Dakota. We're excited about the many investments being made across our state, including the first rollout of 5G service by @TMobile , & for what's to come to help ND reach its full potential!", "2020-01-20T20:10:04.000Z": "Thanks to all of the hardworking @NDHighwayPatrol troopers, NDDOT plow drivers, law enforcement officers and county & city road crews who helped keep drivers safe and opened roads and rest areas after the big blizzard! #VisionZero", "2020-01-20T14:42:28.000Z": "Dr. King's legacy of visionary leadership on civil rights and justice lives on today through the generations of people who have been inspired by his words to work toward a better world for their fellow Americans. #MLKDay", "2020-01-17T20:21:47.000Z": "Approved 16 pardons today for low-level marijuana offenses through a new, streamlined process. By removing the stigma of these minor offenses, we can offer people a second chance at a healthy, productive life & help address our state's workforce shortage. Burgum approves first group of pardons for low-level marijuana offenses under new policy Gov. Doug Burgum has granted 16 pardons under a new policy allowing individuals with low-level marijuana offenses on their records to apply for a summary pardon through a streamlined application... governor.nd.gov", "2020-01-16T17:49:06.000Z": "Great news on the Senate passing #USMCA , which will provide enhanced market access & certainty for ND ag producers and manufacturers. Thanks to @SenJohnHoeven & @SenKevinCramer for helping to push this bill through the Senate and to @POTUS for continuing to fight for fair trade.", "2020-01-15T19:45:49.000Z": "With China pledging to buy $200B+ in additional US goods over the next 2 yrs, including $40B-50B in ag products, the Phase One trade deal is a major win for ND farmers & ranchers. Thanks to @POTUS & @USTradeRep for their efforts to improve trade fairness. Burgum: Signing of Phase One Trade Agreement with China represents a win for the U.S. and North... Gov. Doug Burgum released a statement after President Donald Trump signed a Phase One Trade Agreement with China, calling it a major win for North Dakota farmers and ranchers. governor.nd.gov", "2020-01-15T17:56:16.000Z": "Deeply grateful to the leaders of North Dakota's tribal nations and the hundreds of partners who are here to work together at this week's Strengthening Government to Government Partnerships and Relationships Conference. http:// governor.nd.gov/news/burgum-hi ghlights-progress-third-strengthening-government-government-partnerships-conference ", "2020-01-14T00:29:52.000Z": "Join us for the 2020 State of the State Address at 10:30am on January 29 at the Chester Fritz Auditorium in Grand Forks!", "2020-01-12T04:17:29.000Z": "We celebrate big wins in a big way. Congratulations to the Bison on their eighth national championship in nine years.\n\nPhoto by @Threefold .", "2020-01-11T20:25:16.000Z": "Congrats to @Coach_Entz and the national champion Bison! With an amazing 37-game win streak and 8 out of the last 9 national titles, this @NDSUfootball team is one for the history books. Great matchup against JMU today - what a game! #GoBison", "2020-01-11T01:24:06.000Z": "Bison Nation is ready for a great game in Frisco tomorrow! Great to see Easton Stick and all of the former players alongside thousands of fans in the crowd at tonight's Pep Fest. Let's go win a championship! #GoBison", "2020-01-10T21:32:30.000Z": "Save the date! We're excited to host the Cybersecurity Education and Diversity Policy Summit on April 20 at @Bismarck_State .\n\nWe'll be joined by @GirlScouts CEO Sylvia Acevedo & @PaloAltoNtwks President Amit Singh to discuss ND's model for cyber education. Burgum to host Girl Scouts of the USA CEO, Palo Alto Networks President for Cybersecurity Education... Gov. Doug Burgum announced a first-of-its-kind event in April that will bring together local, regional and national partners involved in North Dakota's K-20W Initiative to highlight the unique... governor.nd.gov", "2020-01-09T17:32:15.000Z": "The 40-year-old NEPA process has grown more complex, creating multi-year delays for key infrastructure projects like including highways, bridges, pipelines & flood protection. We thank @POTUS & his administration's proposal to modernize & streamline NEPA. Burgum applauds proposed updates to NEPA process to streamline permitting of infrastructure Gov. Doug Burgum applauded a proposal to modernize the National Environmental Policy Act (NEPA) process to streamline permitting of infrastructure projects. governor.nd.gov", "2020-01-09T16:26:35.000Z": "Grateful to the men and women who put their lives on the line to protect the people of North Dakota each and every day. On #NationalLawEnforcementAppreciationDay , we thank all of the officers who keep us safe, including the dedicated troopers of the @NDHighwayPatrol .", "2020-01-08T22:32:34.000Z": "Excited to deliver the 2020 State of the State Address later this month at the @UofNorthDakota 's Chester Fritz Auditorium. Hope to see you in @GrandForksCity on January 29!", "2020-01-06T18:02:46.000Z": "Congratulations to North Dakota's new Supreme Court Chief Justice Jon Jensen on receiving the gavel from Chief Justice Gerald VandeWalle, who provided exceptional leadership during his 27-year tenure, the longest-serving chief justice in state history.", "2020-01-03T19:56:51.000Z": "Grateful to @SecBernhardt for addressing these concerns raised by ND landowners and to @SenKevinCramer and @SenJohnHoeven for bringing the issue to light -- ensuring a fairer, more collaborative process for all involved. https:// doi.gov/pressreleases/ interior-increases-transparency-refuge-wetland-easements-modernizes-mapping-older  via @interior Interior Increases Transparency on Refuge Wetland Easements: Modernizes Mapping of Older Easements,... The U.S. Fish and Wildlife Service (Service) issued new internal guidance to provide better government services and alleviate conflict with landowners stemming from easement deeds that pre-date 1976. doi.gov", "2020-01-01T16:07:34.000Z": "Happy New Year! Wishing you a 2020 filled with gratitude and curiosity!", "2019-12-31T23:12:31.000Z": "Wishing everyone a safe and happy New Year's Eve! Special thanks to the ND Dept. of Transportation and the @NDHighwayPatrol for their incredible efforts during the storm and all they do to keep us safe every day! @VisionZeroND", "2019-12-30T22:07:49.000Z": "Excited to see @uscensusbureau estimate that North Dakota reached a record high population again in 2019, reflecting our exceptional quality of life, abundant opportunities and strong economy. Now let's make sure we get a complete count for Census 2020! https:// governor.nd.gov/news/burgum-we lcomes-new-record-population-estimate-recognizes-need-complete-census-count-2020 ", "2019-12-25T14:08:00.000Z": "Merry Christmas! Kathryn and I wish you and your loved ones a joyous holiday.", "2019-12-23T23:12:20.000Z": "Happy Hanukkah! Thanks to Rabbi Yonah Grossman and all who helped celebrate the lighting of the menorah in the Capitol today.", "2019-12-22T16:44:55.000Z": ". @NDSUfootball is heading to the FCS championship once again! Great game yesterday against the Bobcats, and it was good to see @GovernorBullock and @MontanaState President @WadedCruzado . #GoBison !", "2019-12-19T21:27:32.000Z": "This disaster aid in the ag appropriations bill will provide much-needed support for ND farmers struggling after a record wet fall and extremely difficult harvest. Thankful for the work of @SenJohnHoeven & our entire congressional delegation to support ag producers. Quote Tweet Senator John Hoeven @SenJohnHoeven Great news for agriculture: Congress approved the add. $1.5 billion in disaster aid I secured for our farmers & ranchers, as well as provisions to ensure our sugar producers were included + coverage for quality losses. Given challenges in farm country, this is vital assistance. Show this thread", "2019-12-19T20:12:23.000Z": "Grateful to @SenKevinCramer , @SenJohnHoeven and @RepArmstrongND for fulfilling Spirit Lake Nation's request to rename Sullys Hill National Game Preserve by restoring its traditional name, White Horse Hill, and properly honoring its Dakota history. Congress Passes Sen. Cramer's Legislation to Rename \"Sullys Hill\" to \"White Horse Hill\" | U.S.... ***Click here for video. Click here for audio.*** WASHINGTON - U.S. Senator and Senate... cramer.senate.gov", "2019-12-19T17:27:57.000Z": "Join us for the 2020 State of the State address on Jan. 29 at Chester Fritz Auditorium at the @UofNorthDakota , where we'll discuss North Dakota's successes and the challenges and opportunities that lie ahead.", "2019-12-19T17:27:56.000Z": "This week marks three years since @BrentSanfordND and I were sworn into office, and we remain grateful every single day to serve the people of this great state.\n\nRead about our administration's significant progress this past year: Burgum, Sanford reflect on significant progress made during third year in office; site announced... Gov. Doug Burgum and Lt. Gov. Brent Sanford this week marked their third anniversary of being sworn into office, reflecting on meaningful strides made by state agencies and through collaboration with... governor.nd.gov", "2019-12-18T22:07:06.000Z": "North Dakota's strong economy has created one of the best environments in the U.S. for job seekers. This week, Fargo and Bismarck were both ranked in the top 10 hottest job markets of 2020. Here are the 10 best cities for jobs in 2020 For those serious about making a career move in the year ahead, ZipRecruiter identified the hottest job markets across the county, based on the growing number of job postings and median wage, among... cnbc.com", "2019-12-18T22:02:49.000Z": "This morning on @Varneyco , we talked about North Dakota's excellent economic outlook and highlighted why we're the nation's proving ground for UAS.", "2019-12-18T19:50:08.000Z": "Grateful to longtime entrepreneur Ron Bergan for continuing to believe in North Dakota's people and invest in our economy. \n\nLearn more about the company at http:// lulzbot.com .", "2019-12-18T19:50:04.000Z": "This is an exciting day for Fargo and the entire region as we welcome @lulzbot3D and dozens of jobs to North Dakota to build upon the state's flourishing entrepreneurial ecosystem. \n\nRead about today's announcement here: http:// governor.nd.gov/news/burgum-an nounces-relocation-3d-printer-business-fargo-bringing-tech-jobs-and-innovation-nd ", "2019-12-18T16:37:16.000Z": "About to go live on @Varneyco to talk about North Dakota's great economic outlook!", "2019-12-17T23:19:15.000Z": "Today, the Industrial Commission announced a loan program through the Bank of North Dakota to help the state's livestock producers cover feed costs as they deal with this year's extreme weather conditions. Learn about eligibility and other information at https:// bnd.nd.gov/ag/ . Ag Loans - Bank of North Dakota Most of BND's ag loans are initiated with a local financial institution, except the Beginning Farmer and Established Farmer Real Estate Loans. Learn More! bnd.nd.gov", "2019-12-17T18:12:51.000Z": "Congratulations to @bushelpowered on this major investment announcement! Their technology is changing the way 20,000 farmers across North America do business, and it's built right here in North Dakota. Quote Tweet Bushel @bushelpowered \"We're grateful for the opportunity to continue serving the grain industry through this investment, especially in this challenging environment,\" -Jake Joraanstad, Bushel cofounder & CEO. Learn more about the $19.5 million dollar investment round announced. http:// bit.ly/35tHfM4", "2019-12-14T22:46:10.000Z": "Save the date for the @westgov", "2019-12-14T20:13:29.000Z": "ND Indian Affairs Commission Executive Director Scott Davis spoke to the @westgov crowd about North Dakota's efforts to address the missing and murdered indigenous women crisis. Collaboration between law enforcement agencies is key to solving this issue in ND and beyond.", "2019-12-13T23:03:58.000Z": "Glad to be joined by ten fellow governors to kick off the Western Governors' Association meeting and provide an update on the Reimagining the Rural West initiative this afternoon! Quote Tweet Western Govs Assoc. @westgov How do we create communities that work for people? Because if we can accomplish that, then we will be able to attract workforce to rural areas, said WGA Chair and North Dakota @DougBurgum  #WestGov19", "2019-12-13T21:07:55.000Z": "Happy Birthday to the @USNationalGuard ! North Dakota is proud to be part of this nation's historic militia and stand together to defend our country and build partnerships around the world. Quote Tweet N.D. National Guard @NDNationalGuard From the Minuteman to the modern Citizen-Soldier and Airman, we re-affirm our commitment to be #AlwaysReady and #AlwaysThere for our State and Nation 383 years later. #Guard383", "2019-12-13T17:53:00.000Z": "Today, I requested a presidential major disaster declaration \nfrom @POTUS and @FEMA to help local jurisdictions recover from the impacts of October's storm that dumped heavy rain and snow and caused up to $9.7 million in infrastructure damage. Read more: Burgum requests presidential major disaster declaration for flooding from heavy rain, snowstorm Gov. Doug Burgum has requested a presidential major disaster declaration for the impacts of an October storm that dumped heavy rain and snow on a large swath of the state and caused up to $9.7... governor.nd.gov", "2019-12-13T00:20:32.000Z": "The @USAO_ND team works hard to uphold the law and keep citizens safe in our state. Grateful to U.S. Attorney Drew Wrigley for inviting me to discuss technology and the future of law enforcement and for all the ways in which these dedicated public servants work to secure justice!", "2019-12-12T21:52:00.000Z": "Today, along with @NDagriculture , we announced the Emergency Feed Transportation Assistance Program to help producers hit hard by feed losses resulting from the wettest Aug.-Oct. on record. Learn more: Feed transportation cost-share program announced Gov. Doug Burgum and Agriculture Commissioner Doug Goehring have announced the availability of a program that will reimburse eligible producers for a portion of feed transportation expenses. The... governor.nd.gov", "2019-12-12T20:52:48.000Z": "Best of luck to the thousands of students across ND participating in #HourOfCode today! Teaching coding, computer science and other technology skills to today's students will help them succeed in tomorrow's economy while also addressing our need for a 21st century workforce.", "2019-12-11T22:23:59.000Z": "Great states, great universities, great teams and @govkristinoem is a great sport! Thanks to @GoJacksFB for hosting @FirstLadyND & me along with @CollegeGameDay in Brookings. See you at the next Dakota Marker game on Oct. 17, 2020, at the Fargodome! #GoBison Quote Tweet Governor Kristi Noem @govkristinoem I keep my promises....but I'm not happy about it  @DougBurgum and I had a little wager on the Dakota Marker game and @NDSUfootball came out on top....but boy did @SDSUFootball gave them a fight. Thanks for the gear Governor....I Hope next year we see you in a @GoJacksSDSU jersey", "2019-12-10T19:50:05.000Z": "The #USMCA will provide market certainty at a time of extreme hardship for our farmers and ranchers. We urge House leadership to put it to a vote quickly so it can advance to the Senate and be implemented as soon as possible. My full statement: http:// governor.nd.gov/news/burgum-st atement-house-representatives-agreeing-advance-usmca-trade-deal ", "2019-12-07T15:23:44.000Z": "Today marks 78 years since the tragic attacks on U.S. soldiers stationed at Pearl Harbor. For their courage in defense of liberty, we are forever grateful.", "2019-12-06T15:23:39.000Z": "Grateful for everyone who attended last night's tree lighting ceremony and all of the talented performers and speakers who shared their gifts. What a fantastic way to kick off this special time of year and share the message of hope that it brings! Video at https:// facebook.com/GovernorDougBu rgum/ ", "2019-12-04T01:36:12.000Z": "Congratulations, Dr. Armacost! Grateful for your willingness to lead at the @UofNorthDakota and bring your decades of experience at the @AF_Academy to continue innovating in higher education. Welcome to North Dakota! Quote Tweet U of North Dakota @UofNorthDakota Welcome to the University of North Dakota, Dr. Andrew Armacost! Join us in congratulating UND's President.  #UNDproud", "2019-12-03T21:55:27.000Z": "Today we started flood preparations earlier than normal because these unprecedented wet fall conditions pose a serious threat to people and property next spring, in addition to the tremendous hardship they're causing our farmers and ranchers right now. @NDResponse", "2019-12-02T23:25:50.000Z": "Congratulations to @EnergyDepSec Dan Brouillette on his Senate confirmation to be our nation's next Secretary of Energy! We look forward to working together to advance our state's all-of-the-above energy strategy and strengthen U.S. energy security, independence and dominance.", "2019-12-02T22:35:09.000Z": "Join @FirstLadyND and me at 5:30 p.m. Thursday to light the State Christmas Tree! There will be holiday readings, music and carols as we celebrate together in Memorial Hall at the Capitol. See you on Thursday! Governor, First Lady invite public to 'Build Bridges of Hope' at annual Christmas Tree Lighting... Gov. Doug Burgum and First Lady Kathryn Burgum encourage the public to join them for holiday readings, music and carols at the annual North Dakota State Christmas Tree Lighting ceremony at 5:30 p.m.... governor.nd.gov", "2019-11-28T14:48:18.000Z": "Kathryn and I wish all North Dakotans a wonderful day filled with warmth and gratitude for beloved family, friends and food. Happy Thanksgiving!", "2019-11-27T22:11:17.000Z": "The first videos from the Governor's Summit on Innovative Education are now live! Keep an eye on our playlist on YouTube, where we'll be adding all of the videos from the event, like this fascinating keynote address from Dr. Stuart Ablon. Dr. Stuart Ablon | Governor's Summit on Innovative Education | Aug.... Dr. Stuart Ablon, director of Think:Kids at the Massachusetts General Hospital and associate professor at Harvard Medical School, speaks at the Governor's Su... youtube.com", "2019-11-25T18:19:48.000Z": "Pleased today to pardon Lilly, a top-notch turkey from Tolna who will be back on the farm this Thanksgiving, safe to gobble without being gobbled. \n\nThanks to the ND Turkey Federation for its generous donations to Heaven's Helpers Soup Cafe and the Abused Adult Resource Center.", "2019-11-22T22:36:21.000Z": "On this episode of the podcast, we're joined by three recipients of the 2019 Governor's Awards for Excellence in Public Service to discuss what it means to them to be part of Team ND. Hear from them on the latest edition of Work Worth Doing: Work Worth Doing Listen to the latest episode of Gov. Burgum's podcast. governor.nd.gov", "2019-11-20T23:32:21.000Z": "Our state is facing a significant shortage of propane, which is essential for drying late-harvest crops & provides residential heating for many North Dakotans. Today I asked the @FERC to continue its efforts to increase the supply of propane to the state. Burgum stresses need for increased propane to FERC; thanks FMCSA for regional emergency declaration In a letter to the Federal Energy Regulatory Commission (FERC), Gov. Doug Burgum underscored the severity of North Dakota's propane distribution and supply issue and requested that the FERC take... governor.nd.gov", "2019-11-19T16:44:53.000Z": "ND has received top marks for financial transparency from the nonpartisan organization Truth in Accounting! Transparency is a priority for our administration, and we're grateful to the members of Team ND who work to improve citizens' access to information. Burgum welcomes report from watchdog group giving ND top marks for financial transparency Gov. Doug Burgum welcomed a report from the nonpartisan watchdog organization Truth in Accounting that gives North Dakota top marks for financial transparency. governor.nd.gov", "2019-11-14T17:58:31.000Z": "For 25 years, the ND Game & Fish Dept has produced a high-quality weekly broadcast to showcase our state's tremendous opportunities for outdoor recreation. Thanks to the G&F team for instilling a love for the outdoors in generations of hunters and anglers! Twenty-Five Years Later - NDGNF - 11-05-19 ​North Dakota Game and Fish Department's weekly television program, North Dakota Outdoors, is celebrating 25 years. In this week's segment Mike Anderson rein... youtube.com", "2019-11-13T23:42:50.000Z": "Canada & Mexico are ND's top trading partners, accounting for nearly $5B in annual exports. Modernizing trade among our 3 nations is a huge win for our businesses, farmers and ranchers, who can compete with anyone on a level playing field. #USMCANow  @WhiteHouse  @realDonaldTrump", "2019-11-12T23:18:42.000Z": "Congratulations to the recipients of this year's Recovery Reinvented awards - champions of recovery who work tirelessly to help the people of ND!\n\nGrateful to the 1200+ people who attended today's event in person and hundreds more who watched online. http:// governor.nd.gov/news/governor- first-lady-host-third-recovery-reinvented-announce-families-strong-support-program ", "2019-11-12T16:10:30.000Z": "#RecoveryReinvented is underway! Watch the live broadcast at http:// recoveryreinvented.com to hear speakers discuss the power of recovery and share tools that can empower communities to take action.", "2019-11-11T18:18:53.000Z": "On #VeteransDay we share our endless gratitude for our veterans and the extraordinary acts they perform to defend freedom and maintain peace through strength. They fulfill their duty with honor & courage. We must honor their service with our full support. https:// governor.nd.gov/news/burgum-is sues-statement-honoring-military-service-observance-veterans-day ", "2019-11-11T04:18:16.000Z": "Happy 244th Birthday to the @USMC , and thank you for fighting for our freedom in the air, on land and sea! Quote Tweet N.D. National Guard @NDNationalGuard \"𝐅𝐫𝐨𝐦 𝐭𝐡𝐞 𝐇𝐚𝐥𝐥𝐬 𝐨𝐟 𝐌𝐨𝐧𝐭𝐞𝐳𝐮𝐦𝐚, 𝐭𝐨 𝐭𝐡𝐞 𝐒𝐡𝐨𝐫𝐞𝐬 𝐨𝐟 𝐓𝐫𝐢𝐩𝐨𝐥𝐢!\" Happy 244th Birthday to the few, the proud, the @USMC . Sound off devil dogs!  #BrothersInArms  #OnceAMarineAlwaysAMarine  #SemperFi", "2019-11-08T16:00:41.000Z": "Grateful to @SecretarySonny and @BillAtUSDA for their quick response to our request for a secretarial disaster designation, making assistance available to farmers & ranchers facing one of the most difficult and stressful seasons on record.\n\nRead more here: http:// governor.nd.gov/news/burgum-go ehring-thank-perdue-approving-secretarial-disaster-designation-help-nd-farmers-and ", "2019-11-07T17:08:34.000Z": "Today I signed a 30-day waiver of certain restrictions and fees for drivers of commercial vehicles transporting hay and livestock to help our producers. All road safety and vehicle compliance regulations still apply. Read the executive order here: http:// governor.nd.gov/sites/www/file s/documents/Executive%20Order%202019-12%20Hay%20and%20livestock%20hauling.pdf ", "2019-11-07T02:24:26.000Z": "We are committed to maintaining convenient access between ND & Manitoba to support tourism, trucking and the local and regional economies. That's why I sent a letter requesting @CBP maintain its current hours at ports of entry in Antler, Carbury and Maida. Burgum urges Customs and Border Protection not to reduce hours at ports of entry on ND-Manitoba... Gov. Doug Burgum is urging U.S. Customs and Border Protection (CBP) not to reduce hours of operation at three ports of entry on the North Dakota-Manitoba border. governor.nd.gov", "2019-11-06T22:09:09.000Z": "Working together across agencies, @ndgovitd has led the effort to pursue a shared approach to website development, avoiding $1 million in costs and improving the user experience for all citizens! http:// governor.nd.gov/news/reinventi on-work-unified-approach-online-platforms-helps-avoid-more-1-million-cost  Quote Tweet ITD @ndgovitd Governor Doug Burgum highlights reinvention efforts in this press release - learn more and visit http:// ow.ly/5ff950x3RVC to see the wealth of audio and video assets available! http:// ow.ly/5Qdv50x3RVz", "2019-11-05T22:45:08.000Z": "The 33rd edition of the North Dakota Blue Book-a treasure trove of the unique qualities that make ND special-is now available! http:// history.nd.gov/bluebook/index .html  Grateful to Secretary of State Al Jaeger and the whole team who updated this edition with even more of our state's rich history.", "2019-11-05T20:34:10.000Z": "Brutal deaths of North Dakota mother, 4 kids in Mexico 'heart-wrenching,' says state senator who... A woman and four children who were murdered in Mexico lived in Williston, N.D., according to a family member's Facebook post. inforum.com", "2019-11-05T20:34:09.000Z": "Kathryn & I extend our deepest sympathies to the relatives and friends of the Miller family in North Dakota and beyond. We condemn these horrific acts of violence against women & children and pray that their survivors receive the care and support they need in their time of grief.", "2019-11-05T00:11:15.000Z": "The ND Dept. of Human Services and MHA Nation received a $500K federal grant to improve intergovernmental child support management. We're grateful for this opportunity to work alongside our tribal partners to improve the lives of children and families. http:// nd.gov/dhs/info/news/2019/11-4-nd-awarded-intergovernmental-state-tribal-child-support-grant.pdf ", "2019-11-02T19:55:43.000Z": "Today, I signed an executive order granting a 30-day waiver of hours of service requirements for drivers of commercial vehicles transporting propane, gasoline and diesel fuel to retail suppliers, ensuring we meet the needs of North Dakotans. Read more: Burgum waives hours of service for haulers of propane, gasoline and diesel Gov. Doug Burgum signed an executive order granting a waiver of hours of service requirements for drivers of commercial vehicles transporting propane, gasoline and diesel fuel to retail suppliers. governor.nd.gov", "2019-11-02T15:39:09.000Z": "On this day in 1889, North Dakota joined the United States of America. From the first inhabitants of the land to the people living here today, generations of North Dakotans have made this state a land of opportunity. Happy 130th Birthday, North Dakota! http:// governor.nd.gov/sites/www/file s/documents/proclamations/130th%20Anniversary%20of%20North%20Dakota%20Statehood.pdf ", "2019-11-01T20:55:15.000Z": "During Native American Heritage Month, we honor the history and culture of North Dakota's indigenous people and recommit ourselves to strengthening the collaborative state-tribal relationships built on understanding and mutual respect. Our proclamation: https:// governor.nd.gov/sites/www/file s/documents/proclamations/Native%20American%20Heritage%20Month%202019.pdf ", "2019-11-01T14:34:05.000Z": "This morning, we submitted a letter to the @USDA requesting a secretarial disaster designation to make federal assistance available to agricultural producers struggling with extremely wet harvest conditions. http:// governor.nd.gov/news/secretari al-disaster-designation-requested-47-53-nd-counties-crop-losses-continue-mount ", "2019-10-31T15:02:50.000Z": "Happy Halloween! @FirstLadyND and I are looking forward to welcoming trick-or-treaters at the east entrance of the Governor's Residence tonight between 5:00-7:30pm!\n\nThis picture is from last year's theme with the ND Geologic Survey. Can't wait to see all of this year's costumes!", "2019-10-30T23:49:37.000Z": "These folks are driving change all around the state: Beach, Bismarck, Cavalier, Fargo, Grand Forks, Hettinger, Jamestown, Mandan, McClusky, Milnor, Sheyenne, West Fargo, Williston and beyond. Thanks for making a difference!", "2019-10-30T23:49:36.000Z": "Congratulations to the recipients of the 2019 Main Street Awards! \n\nThese communities have shown excellence in elevating the three pillars of the Main Street Initiative: healthy, vibrant communities; smart efficient infrastructure; and 21st century workforce.", "2019-10-30T14:19:14.000Z": "Thanks to @Surgeon_General Vice Admiral Jerome Adams for headlining the #MainStreetND Summit this morning! When we talk about the importance of healthy, vibrant communities, we must also remember to invest in improving physical & behavioral health. Watch: http:// nd.gov/living-nd/main -street-nd/take-action/main-street-summit ", "2019-10-29T14:43:36.000Z": "The Main Street ND Summit is happening now! Watch the livestream: http:// nd.gov/living-nd/main -street-nd/take-action/main-street-summit   #MainStreetND", "2019-10-28T19:34:25.000Z": "Tune in tomorrow morning for the kickoff of the 2019 Main Street ND Summit! We'll be livestreaming the event beginning at 9am at this link: http:// nd.gov/living-nd/main -street-nd/take-action/main-street-summit  Quote Tweet Gov. Doug Burgum @DougBurgum Register today for the Main Street ND Summit 2019! On Oct. 29-31, local leaders, national experts and community builders will gather to share best practices in community planning. Reserve your space here: http:// eventbrite.com/e/2019-main-st reet-nd-summit-registration-63378626177 ", "2019-10-26T22:36:38.000Z": "Congrats to @NDSUfootball on bringing the #DakotaMarker home to North Dakota once again! Great effort by the Jacks as well. What a rivalry! Quote Tweet NDSU Football @NDSUfootball We're heading home with the #DakotaMarker and an 8-0 record.", "2019-10-26T14:45:05.000Z": "Great to join @govkristinoem on @CollegeGameDay in Brookings! #GoBison ! Quote Tweet Governor Kristi Noem @govkristinoem Joining @espn now with @DougBurgum ahead of the NDSU v SDSU Dakota Marker game. GO JACKS!! @GoJacksFB  @GoJacksSDSU", "2019-10-26T00:00:19.000Z": "Before the kickoff of tomorrow's legendary Dakota Marker game between @NDSUfootball and @GoJacksFB , I'll be joining @govkristinoem on @CollegeGameDay ahead of what's sure to be a Bison victory. Tune in to the coverage starting at 8am CT!", "2019-10-25T20:35:44.000Z": "The economic impacts and stress from this unprecedented fall flooding situation are serious and real. We encourage individuals to reach out to others who may be struggling emotionally and be aware of available resources during this weather emergency. More: Burgum, Goehring encourage reaching out to those coping with flood-related stress; webpage offers... With extremely wet conditions, localized flooding and an early snowstorm impacting farmers, ranchers and many other individuals and communities across North Dakota, Gov. Doug Burgum and Agriculture... governor.nd.gov", "2019-10-24T23:14:34.000Z": "School board members make important decisions that have a profound impact on the education of students, and their leadership can empower educators to pursue innovative practices. Thanks to @NDSchoolBoards for the invitation to discuss the future of education in North Dakota.", "2019-10-23T20:24:34.000Z": "Grateful for @POTUS 's commitment to cutting burdensome red tape w/the Governor's Initiative on Regulatory Innovation. In #NorthDakota , we're providing occupational license reciprocity for trailing military spouses & studying other ways to remove barriers to attracting workforce.", "2019-10-23T16:45:50.000Z": "Glad to take this bet with @GovKristiNoem ! Looks like we'll have to add a white @NDSUfootball jersey to your collection... #GoBison  #DakotaMarker  @MVCsports Quote Tweet Governor Kristi Noem @govkristinoem The bet is on!! If SDSU wins the Dakota Marker game on Sat., ND Gov @DougBurgum has to post a selfie in an SDSU jersey. If NDSU wins (which they won't #GoJacks ) I have to post a selfie in an NDSU jersey. Be sure to tune in to the showdown Sat. at 2!! GO JACKS!!", "2019-10-22T22:32:20.000Z": "Grateful for all of the farmers, ranchers & community members who attended yesterday's flood meetings and shared with us the challenges they're facing as we respond to this unprecedented fall flooding. Check out http:// NDresponse.gov for more information on available resources.", "2019-10-21T23:13:20.000Z": "Follow tonight's flood meeting in Fessenden on @NDResponse . Quote Tweet NDResponse @NDResponse \"We know there a lot of pressures out here. We've talked at our other locations today about farm stress. We know it's there, we know it's severe. So we want to talk about it.\" - @DougBurgum  #FallFloodTownhall", "2019-10-21T21:08:53.000Z": "Strong turnout for today's flood meeting in Jamestown underscores the magnitude of problems facing farmers, ranchers and area residents, both urban and rural. http:// governor.nd.gov/news/burgum-si gns-executive-order-declaring-statewide-flood-emergency-he-and-goehring-visit-flood ", "2019-10-21T16:50:05.000Z": "Grand Forks City Councilman Ken Vein talks about the basement flooding in Grand Forks caused by recent heavy rains and early snow. The city has hauled away over 800 tons of debris in recent weeks, including 530 tons of carpet and furniture and 280 tons of branches.", "2019-10-21T16:04:41.000Z": "Kicked off today's community meetings about flooding impacts with a discussion in Fargo. As we continue to meet with local officials, community members and ag producers in Grand Forks, Jamestown and Fessenden today, we'll be sharing more about available resources and next steps.", "2019-10-21T16:04:33.000Z": "Following heavy rains and a historic blizzard, I signed an executive order today declaring a statewide flood emergency. Joined by @NDDES , @NDagriculture & other agencies, we're visiting affected areas to discuss the state's whole-of-government response. Burgum signs executive order declaring statewide flood emergency as he and Goehring visit flood-i... Gov. Doug Burgum this morning signed an executive order declaring a statewide flood emergency, paving the way for requests for federal assistance to help North Dakotans deal with significant flooding... governor.nd.gov", "2019-10-17T22:42:53.000Z": "Fargo's Main Avenue makeover resulted in a smart, efficient & pedestrian-friendly passageway that improves retail access and walkability to create a healthy, more vibrant city. Congrats on Phase 1 and thanks to the public for your input on this project! https:// dot.nd.gov/dotnet/news/Pu blic/View/8497 ", "2019-10-17T18:44:08.000Z": "Thrilled & deeply grateful for @Microsoft President Brad Smith's announcement that the company will contribute tech and $1.5M to @emergingprairie 's Grand Farm initiative, helping ND continue to be a leader in ag innovation with leadership from entrepreneurs like Barry Batcheller!", "2019-10-16T17:19:37.000Z": "Congratulations again to Sara Medalen, the 2020 North Dakota Teacher of the Year. Grateful to all of the @sunnyside_mps students and family who joined us at the Capitol to celebrate! North Dakota can lead the nation in education, and it starts with exceptional teachers like Sara.", "2019-10-14T19:56:31.000Z": "We'll also have @nddes recovery staff out assessing damage to public infrastructure to determine if it meets the threshold for a presidential disaster declaration. Read more about the state's efforts: Options for producers sought as wet weather continues The extensive wet pattern in North Dakota, topped with an early snowstorm, is creating a great deal of anxiety for farmers and ranchers. The state is exploring all possible means of assistance and... governor.nd.gov", "2019-10-14T19:56:30.000Z": "This week, @nddes & @NDagriculture are capturing all impacts from the blizzard and heavy rains to ask @USDA for a secretarial disaster declaration to make farmers and ranchers eligible for this relief @SenJohnHoeven helped secure. Quote Tweet Senator John Hoeven @SenJohnHoeven Spoke w/ Deputy Secretary Censky to outline the wet conditions & early snowfall challenges in ND. Working w/ @USDA to ensure our #NDag producers are eligible for as much relief as possible under the disaster assistance leg. we approved earlier this year. https:// hoeven.senate.gov/news/news-rele ases/hoeven-we-worked-to-provide-ag-coverage-in-disaster-supplemental-for-blizzard ", "2019-10-12T22:13:43.000Z": "After working to clear the roads of snow and abandoned vehicles, the NDDOT and @NDHighwayPatrol have announced that I-94, I-29 and US 2 have now reopened to traffic. If you must travel, be safe and watch for hazardous road conditions. Quote Tweet North Dakota Highway Patrol @NDHighwayPatrol #NDHP and #NDDOT announce I94 and US2 Now Open https:// dot.nd.gov/dotnet/news/Pu blic/View/8495  Significantly reduce speed, increase following distance, don't pass, drive distraction free, and buckle up. Road conditions can change quickly and often.", "2019-10-12T15:27:15.000Z": "In their stewardship of the land, perseverance in times of hardship and as leaders in our communities, farmers are foundational to the spirit of North Dakota. On National Farmer's Day, thank a farmer and keep them in your thoughts during this especially difficult harvest season.", "2019-10-11T19:47:13.000Z": "Lots of roads closed and no travel advised across much of North Dakota today as this snowstorm continues. Please be safe and keep track of road conditions at https:// dot.nd.gov/travel-info-v2/ .", "2019-10-10T23:22:47.000Z": "Together w/ @NDagriculture , we're exploring every avenue to assist farmers & ranchers through the financial & emotional stress of this extremely wet harvest season. Anyone struggling with depression or feelings of hopelessness, please reach out for support. Options for producers sought as wet weather continues The extensive wet pattern in North Dakota, topped with an early snowstorm, is creating a great deal of anxiety for farmers and ranchers. The state is exploring all possible means of assistance and... governor.nd.gov", "2019-10-10T15:43:10.000Z": "In North Dakota, we're making cybersecurity a top priority & working hard every day to lead the nation in protection of our citizens' information. Great to join @PaloAltoNtwks at Federal Ignite '19 to discuss our efforts to raise the bar on safeguarding data. #IgniteYourSecurity", "2019-10-09T22:48:23.000Z": "As a potentially historic winter storm bears down on North Dakota, our state agencies are ready to respond. The @NDNationalGuard has ground search-and-rescue teams positioned around the state, NDDOT is ready for snow removal and @NDHighwayPatrol has additional troopers on call.", "2019-10-08T21:46:16.000Z": "As chair of the Interstate Oil & Gas Compact Commission, I also signed an agreement with @EPAAWheeler to renew a longstanding partnership with @EPA . Working collaboratively, we can utilize best practices & policies to protect health and natural resources for generations to come.", "2019-10-08T21:46:12.000Z": "Grateful to @EPAAWheeler for announcing the availability of more than half a billion dollars in funding for the @FMDiversion , which will save taxpayer dollars & help complete this critical infrastructure project to protect hundreds of thousands of people. http:// governor.nd.gov/news/burgum-56 1m-loan-announced-epa-head-wheeler-crucial-fargo-moorhead-flood-diversion-project ", "2019-10-08T14:02:22.000Z": "North Dakota is an energy powerhouse on a global scale. At #NDEnergy2019 , we're discussing how ND can continue to grow its energy industry through better infrastructure, innovation and more integration with the technology and agriculture industries.", "2019-10-07T21:14:21.000Z": "Now it's time for Congress to approve the U.S.-Mexico-Canada Agreement to give our ag producers, tech sector and manufacturers another economic boost. #USMCAnow Burgum attends signing of U.S.-Japan trade agreements that boost ag exports, digital products Gov. Doug Burgum joined President Donald Trump, U.S. Trade Representative Robert Lighthizer, Japanese Ambassador Shinsuke Sugiyama, Secretary of Agriculture Sonny Perdue, Transportation Secretary... governor.nd.gov", "2019-10-07T21:14:20.000Z": "Today we strengthened our trade relationship with Japan and opened the door to further deals with this key ally. Great to reconnect with Ambassador Sugiyama and grateful to @POTUS & @USTradeRep Lighthizer for finalizing this important deal for our farmers and ranchers.", "2019-10-06T17:46:42.000Z": "Register today for the Main Street ND Summit 2019! On Oct. 29-31, local leaders, national experts and community builders will gather to share best practices in community planning. Reserve your space here: http:// eventbrite.com/e/2019-main-st reet-nd-summit-registration-63378626177 ", "2019-10-04T20:22:35.000Z": "Williston Basin International Airport is an incredible facility that will serve a growing population, provide vital air travel services and sustain long-term economic expansion. Congratulations on a historic day for Williston and the entire Bakken region! http:// governor.nd.gov/news/burgum-ne w-williston-basin-international-airport-vital-regions-growing-population-economy ", "2019-10-04T15:07:48.000Z": "Thanks to @EPA and @USDA for announcing a new agreement on the Renewable Fuel Standard that strikes a balance for our farmers, ethanol producers and refiners, protecting demand for renewable fuels while still allowing for exemptions for small refineries. Burgum releases statement on renewable fuels agreement announced by EPA and USDA Gov. Doug Burgum released the following statement today after the U.S. Environmental Protection Agency (EPA) and U.S. Department of Agriculture announced a new agreement on the Renewable Fuel... governor.nd.gov", "2019-10-04T14:14:25.000Z": "Thanks again to @SecBernhardt for visiting the Medora area and the treasure that is Theodore Roosevelt National Park. We have an opportunity to partner on the TR Presidential Library & Museum, grow our tourism economy and share the legacy of America's conservation president.", "2019-10-03T20:54:38.000Z": "Productive tour today w/ @SecBernhardt , @SenJohnHoeven , @SenKevinCramer and @TRooseveltNPS Supt. Wendy Ross. Together, we can make the Theodore Roosevelt Presidential Library a reality, repair the park, grow our tourism economy and honor the legacy of \"the conservation president.\"", "2019-10-03T16:05:20.000Z": "Grateful that @SecBernhardt is here today to learn more about the Theodore Roosevelt Presidential Library and Museum and address deferred park maintenance. Working together, we can grow tourism and honor the legacy of a president who was transformed by ND. http:// governor.nd.gov/news/burgum-st resses-collaboration-presidential-library-park-maintenance-interior-secretary ", "2019-10-02T19:47:25.000Z": "October is North Dakota REAL ID Month! For the sake of convenience, safety and security, we strongly encourage all air travelers to act now to obtain a REAL ID. Make an appointment today! Burgum proclaims October as REAL ID Month in ND; NDDOT offers 'REAL ID Days' on select Saturdays Gov. Doug Burgum was joined by officials from the North Dakota Department of Transportation and the federal Transportation Security Administration to proclaim October as North Dakota REAL ID Month. governor.nd.gov", "2019-10-01T17:14:31.000Z": "The veterans who protected our nation and defended our freedom deserve our unwavering support and gratitude. Great to meet with @SecWilkie of the @DeptVetAffairs to discuss how we can better serve the needs of veterans across North Dakota, including workforce & behavioral health.", "2019-10-01T15:19:59.000Z": "Read more about the Reimagining the Rural West Initiative: Burgum focuses on opportunity, connectivity and community in first workshop for WGA chair's... Gov. Doug Burgum hosted the first workshop of his central policy initiative as 2020 chair of the Western Governors' Association (WGA), \"Reimagining the Rural West,\" an ambitious effort to address the... governor.nd.gov", "2019-10-01T14:21:01.000Z": "We can help our rural areas prosper in a 21st century economy by focusing on three areas that are essential to rural prosperity: opportunity, connectivity and community. \n\nFollow along with today's @westgov workshop at: http:// westgov.org/news/watch-wor kshop-reimagining-the-rural-west-in-fargo-north-dakota-on-oct.-1 ", "2019-10-01T12:59:33.000Z": "The first workshop for the @westgov Reimagining the Rural West Initiative is starting soon! Watch live at this link: http:// westgov.org/news/watch-wor kshop-reimagining-the-rural-west-in-fargo-north-dakota-on-oct.-1  Quote Tweet Gov. Doug Burgum @DougBurgum Join us online for the first workshop on the @westgov Reimagining the Rural West Initiative tomorrow! We'll examine opportunities in the rural West and identify best practices and policies to support vibrant rural communities.\n\nWatch here Oct. 1 at 8am CT: http:// westgov.org/news/watch-wor kshop-reimagining-the-rural-west-in-fargo-north-dakota-on-oct.-1 ", "2019-10-01T04:57:57.000Z": "Tonight, U.S. Navy Radioman 2nd Class Floyd A. Wells returned home to North Dakota. Wells was aboard the USS Arizona on Dec. 7, 1941 during the attack on Pearl Harbor. We deeply appreciate the @dodpaa for honoring his legacy by bringing him home. http:// governor.nd.gov/news/burgum-ho nors-nd-native-who-died-attack-pearl-harbor-sailors-remains-returned-home-state ", "2019-09-30T19:40:52.000Z": "Grateful to the K-12 Education Coordinating Council for gathering for the first time today to discuss how educators, administrators & policymakers can ensure that innovative practices are shared and supported to create the best outcomes for students. http:// governor.nd.gov/news/burgum-ba esler-announce-members-newly-established-k-12-education-coordinating-council ", "2019-09-30T15:59:40.000Z": "Join us online for the first workshop on the @westgov Reimagining the Rural West Initiative tomorrow! We'll examine opportunities in the rural West and identify best practices and policies to support vibrant rural communities.\n\nWatch here Oct. 1 at 8am CT: http:// westgov.org/news/watch-wor kshop-reimagining-the-rural-west-in-fargo-north-dakota-on-oct.-1 ", "2019-09-30T14:08:00.000Z": "Sara engages her students with hands-on, innovative experiences that instill courage and curiosity and prepare them to be lifelong learners and problem solvers. We thank all of the finalists for their passion and dedication to empowering students. Burgum, Baesler announce Sara Medalen as ND Teacher of the Year for 2020 Sara Medalen, a reading and math interventionist at Minot's Sunnyside Elementary School, is the North Dakota Teacher of the Year for 2020. governor.nd.gov", "2019-09-30T14:07:59.000Z": "Sara Medalen, a reading and math interventionist at Minot's Sunnyside Elementary School, is the North Dakota Teacher of the Year for 2020! http:// governor.nd.gov/news/burgum-ba esler-announce-sara-medalen-nd-teacher-year-2020 ", "2019-09-29T23:40:14.000Z": "Registration is open for Recovery Reinvented! Reserve your space at this year's event in Bismarck on Nov. 12 at https:// recoveryreinvented.com/events/2019/#r egistration  Quote Tweet First Lady Kathryn Burgum @FirstLadyND Join Governor @DougBurgum and me on November 12th to be a part of the solutions to ending the stigma of addiction and empowering recovery! https:// bit.ly/2nFxvgI Register for the event and share your selfie video of how you reinvent recovery at http:// recoveryreinvented.com !", "2019-09-27T21:21:31.000Z": ". @NDDES met with emergency managers today to determine how to best respond to and recover from last week's severe storms and heavy rainfall. We're committed to a whole-of-government approach and using all appropriate resources during this situation. Burgum: State continues to monitor rain-affected areas as efforts shift from response to recovery State leaders meet with emergency managers from across the state to determine if additional resources or capabilities are needed to respond to last weekend's severe storms and heavy rainfall. governor.nd.gov", "2019-09-27T00:46:24.000Z": "Chief Justice VandeWalle has honorably served the citizens of ND with compassion, humility & fairness for over 60 years, the last 41 on the Supreme Court. We are deeply grateful for his 26-plus years as Chief Justice and thankful he'll continue to serve. North Dakota chief justice won't seek another term at the helm, but will stay on state's high court... BISMARCK - The chief justice of the North Dakota Supreme Court said Thursday, Sept. 26, that he won't seek reappointment to the post he's held since 1993 but will stay on the court for the \"immediate... inforum.com", "2019-09-26T18:29:43.000Z": "Harwood Elementary & New Rockford-Sheyenne Elementary have been recognized as National Blue Ribbon Schools! This tremendous honor highlights the hard work of the outstanding students, teachers & administrators at these exceptional schools. Congratulations! Burgum applauds Harwood, New Rockford-Sheyenne for being recognized as National Blue Ribbon Schools Harwood Elementary School and New Rockford-Sheyenne Elementary School recognized by U.S. Secretary of Education Betsy DeVos as National Blue Ribbon Schools for 2019. governor.nd.gov", "2019-09-25T20:14:50.000Z": "The U.S.-Japan trade agreement will provide greater market access for ND producers of wheat, beef, barley, ethanol and other goods. We appreciate the administration finalizing this deal with ND's No. 5 export market and the U.S.'s No. 3 ag export market. Burgum statement on trade agreement with Japan Burgum: Trade agreement with Japan to lift tariffs on ag products is good news for ND producers. governor.nd.gov", "2019-09-25T14:31:19.000Z": "Congrats as well to this year's fellow inductees: the Wisness family and Dr. Richard Lindstrom. Great to be at Norsk Høstfest to celebrate the Scandinavian heritage of so many North Dakotans!", "2019-09-25T14:31:17.000Z": "Congratulations to Darin Erstad on his induction into the Scandinavian-American Hall of Fame! During his 14-year @MLB career and World Series championship, Darin set an example for athletes across the nation with his incredible work ethic, humility and dedication to the game.", "2019-09-24T16:59:00.000Z": "Influenza can affect anyone. A vaccination is the safest and easiest way to protect yourself, your family and your community. Grateful to @NDDOH , ND Indian Affairs and Angie Wehrkamp from @famfightflu for raising awareness. Get vaccinated today and share your #FluShotSelfie !", "2019-09-23T22:18:21.000Z": "Congratulations to the newest members admitted to the North Dakota Bar! It was an honor to join today's ceremony with these attorneys and their families as they begin their legal careers.", "2019-09-20T14:04:18.000Z": "For those who were captured or never returned home from the battlefield, we pay tribute today - and every day - for their incredible sacrifice. #POWMIARecognitionDay", "2019-09-19T20:51:41.000Z": "Congratulations to the recipients of the Governor's Awards for Excellence in Public Service! Grateful to these individuals (including the K-20W members seen here) and teams for their exceptional work & outstanding commitment to our state and its citizens. https:// governor.nd.gov/news/burgum-sa nford-recognize-team-members-governors-awards-excellence-public-service ", "2019-09-19T19:04:34.000Z": "Former Gov. Ed Schafer gets the importance of the U.S.-Mexico-Canada Agreement to our farmers and rural economy, as do all of his fellow former U.S. Secretaries of Agriculture. It's time to bring this to a vote and allow Congress to ratify the #USMCANow ! Former Agriculture Secretaries Announce Support for USMCA (Washington, D.C., September 19, 2019) - Today, all former U.S. Secretaries of Agriculture since President Reagan's Administration announced support for the United States-Mexico-Canada Agreement... usda.gov", "2019-09-18T18:17:00.000Z": "Happy Birthday to the @usairforce , making America and ND proud for 72 years, especially at @TeamMinot and the @319thRW in Grand Forks! Grateful for all you do to defend freedom in the skies, space & cyberspace alongside the @NDNationalGuard , and for strengthening our communities.", "2019-09-17T16:56:05.000Z": "Exciting to see ND schools receiving national attention for their innovative efforts to transform education & improve outcomes for students! This only happens with commitment from our dedicated teachers and administrators on the front lines. #InnovativeND A North Dakota law gives school districts a chance to experiment Could an experiment at a small school in the middle of a field in rural North Dakota inspire a revolution in America's public education system? pri.org", "2019-09-17T02:11:16.000Z": "Great news for our efforts to advance carbon capture, clean coal technology and enhanced oil recovery! Thanks @SecretaryPerry & @ENERGY for supporting the Project Tundra engineering study with $9.8M on top of $15M from the ND Industrial Commission. Burgum applauds nearly $10M from U.S. Department of Energy for Project Tundra engineering study Gov. Doug Burgum applauded the U.S. Department of Energy for awarding $9.8 million to help fund a Front-End Engineering and Design (FEED) study for Project Tundra, a carbon-dioxide capture system for... governor.nd.gov", "2019-09-15T20:48:32.000Z": "Congratulations to WalkWise, another great example of ND entrepreneurship!\n\n\"WalkWise is the first North Dakota company selected to take part in a Techstars Accelerator Program and will join a group of startups with a combined market cap of $22B.\" https:// walkwise.com/blog/techstars -announcement ", "2019-09-12T17:36:28.000Z": "September is Childhood Cancer Awareness Month, in which we recognize those who are courageously fighting this disease. Landon Solberg of West Fargo, who is fighting terminal brain cancer, has helped bring awareness to childhood cancer with @LandonsLight , a symbol of hope for all.", "2019-09-11T13:26:12.000Z": "Our nation was forever changed by the tragic events of Sept. 11, 2001. Today we remember those who perished in the attacks and honor the courage and heroism displayed by the firefighters, police officers, EMTs and rescue workers who risked their lives to save others.", "2019-09-10T17:57:23.000Z": "Canada & Mexico are ND's top trading partners, and the #USMCA is a tremendous opportunity to grow as leaders in industry and innovation. It's time for Congress to pass the #USMCAnow to advance free and fair trade for the benefit and protection of American producers and consumers.", "2019-09-09T18:24:33.000Z": "Congratulations as well to Command Sgt. Maj. Derek Heck on being selected as the next state command sergeant major, assuming duties from CSM David Lien. Another great addition to the @NDNationalGuard 's leadership team! https:// ndguard.nd.gov/news/heck-name d-new-state-command-sergeant-major ", "2019-09-09T18:24:31.000Z": "Honored to name Brig. Gen. Jackie Huber as Deputy Adjutant General, the 1st woman to hold this position in the @NDNationalGuard . Gen. Huber is a highly qualified officer with the leadership & military expertise that make her the right person for this role. https:// ndguard.nd.gov/news/huber-nam ed-deputy-adjutant-general ", "2019-09-08T21:31:59.000Z": "I witnessed BG Becklund's excellent leadership as Deputy Adjutant General and Chief of Staff as the 119th Wing went through a major shift from manned to unmanned aircraft. He helped the Happy Hooligans be the nation's best, and Schulte's leadership will continue that tradition.", "2019-09-08T21:31:57.000Z": "Wishing a happy retirement and huge thanks to Brig. Gen. Robert J. Becklund for his 37 years of outstanding service to the @NDNationalGuard , and congratulations to Col. Robert Schulte on his deserving promotion to brigadier general and Chief of Staff for the @NDAirGuard .", "2019-09-07T19:24:32.000Z": "Deeply grateful to everyone who worked to establish the Fargo National Cemetery near Harwood, an eternal resting place and tribute to the military veterans who have defended our freedom and upheld our most sacred values. http:// governor.nd.gov/news/burgum-he lps-dedicate-fargo-national-cemetery-building-nds-history-honoring-military-service ", "2019-09-07T15:40:45.000Z": "Check out the highlights from the ceremony on the latest episode of the podcast: Work Worth Doing Listen to the latest episode of Gov. Burgum's podcast. governor.nd.gov", "2019-09-06T20:55:32.000Z": "Thanks to tribal leaders, staff, the Dept. of Human Services, the Indian Affairs Commission, Casey Family Programs and all of our partners for signing updated comprehensive agreements today to enhance child welfare services for Native American families. http:// nd.gov/dhs/info/news/2019/9-6-nd-tribal-nations-sign-updated-agreement-enhancing-child-welfare%20services-native-american-children-families.pdf ", "2019-09-05T19:07:00.000Z": "Today, the @NDDOCR announced a new initiative to further ND's efforts to reform its corrections system. In partnership with Recidiviz, DOCR will be able to track metrics of success, which will enhance public safety, improve lives and save taxpayer dollars. Burgum, DOCR announce initiative focused on prison re-entry success DOCR will be able to monitor success on an ongoing basis and in detail through the new initiative, titled Continuous Corrections Improvement - North Dakota. governor.nd.gov", "2019-09-05T01:59:36.000Z": "Improving access to treatment & recovery services is critical to addressing the opioid crisis impacting communities across ND & the nation. Thanks @samhsagov & @POTUS for announcing $1.8B in funding, including $4M for ND, for a total of $10M over two years to fight this epidemic.", "2019-09-04T18:48:24.000Z": "Beginning in October 2020, you'll need a gold star on your driver's license to board an airplane. If you haven't already obtained your REAL ID, make an appointment today! Read about the process for renewing here: http:// dot.nd.gov/divisions/driv erslicense/real-id-information.htm ", "2019-09-03T21:53:51.000Z": "Honored to address the Tribal Leaders Summit hosted by @UnitedTribesND and highlight the tremendous progress we've made in state-tribal relations in ND. With great leaders like these, we have a huge opportunity for further collaboration and partnership. https:// governor.nd.gov/news/tribal-le aders-summit-burgum-highlights-progress-opportunities-further-state-tribal ", "2019-09-02T13:34:32.000Z": "Happy Labor Day to the hardest-working state in the nation! https:// wallethub.com/edu/hardest-wo rking-states-in-america/52400/ ", "2019-08-31T20:59:07.000Z": "Beautiful day for some @NDSUfootball and the Gold Star Marching Band! Thanks to @TwinsPrez Dave St. Peter for hosting #BISONATION at Target Field!", "2019-08-30T21:01:47.000Z": "This week's newsletter is live! Check out the Dakota Download at this link: Dakota Download 8-30-2019 See the story spark.adobe.com", "2019-08-29T21:28:55.000Z": "Thanks to the team at the Department of Mineral Resources for today's update on all of their important work!", "2019-08-28T22:02:52.000Z": "The State Mill and Elevator has been adding value to ND wheat and supporting agriculture and the local economy since 1922. Thanks to President/CEO Vance Taylor and team for another profitable year and for today's tour with fellow ND Industrial Commission members!", "2019-08-27T21:38:35.000Z": "Access to quality medical care is essential for healthy, vibrant communities. Congrats to Unity Medical Center in Grafton on your expansion project, and thanks to @BankofND , @usdaRD , @SenJohnHoeven  @SenKevinCramer  @RepArmstrongND & other partners for securing the financing!", "2019-08-27T16:43:04.000Z": "Honored to again be chairing the Tribal Taxation Issues Committee & grateful to the Legislature for creating this panel. We made great progress working together last interim to create a stable tax & regulatory environment that attracts capital & talent to all areas of our state.", "2019-08-26T21:50:08.000Z": "With this trade agreement, #Japan will become an even more important market for the corn, soybeans, beef and other quality goods produced in ND. We're grateful to @POTUS and his administration for their persistent efforts on this trade deal. My statement: Burgum: Trade deal with Japan will benefit North Dakota producers, strengthen partnership Gov. Doug Burgum released a statement regarding the White House's announcement that President Donald Trump and Japanese Prime Minister Shinzo Abe have reached a trade agreement in principle. governor.nd.gov", "2019-08-26T16:40:49.000Z": "As the second largest producer of oil in the U.S., North Dakota is leading the way in innovation. Great to be with the Interstate Oil & Gas Compact Commission to share how innovation and investment in new technology and infrastructure are transforming our oil and gas industry.", "2019-08-25T18:59:58.000Z": "Dr. Stuart Ablon is the director of Think:Kids at Massachusetts General Hospital and an associate professor at Harvard Medical School. He joined us on the podcast for a fascinating overview of his research on children's behavioral health. Listen here: http:// governor.nd.gov/podcast", "2019-08-23T20:59:33.000Z": "Thanks to a strong finish to the 2017-19 biennium, North Dakota is replenishing the Budget Stabilization Fund. Combined with a conservative budget, a robust economy and a great start to the new biennium, ND is once again in a sound position for growth. ND refills rainy day fund with strong 2017-19 ending fund balance With July revenues above forecast, 2019-21 biennium begins on a high note. governor.nd.gov", "2019-08-23T16:29:22.000Z": "Speakers for the 2019 Main Street ND Summit have just been announced! The summit will provide attendees with best practices and resources to further local initiatives that will help their communities thrive. Read about the speakers and reserve your space: Burgum announces featured speakers for Main Street ND Summit The 2019 Main Street ND Summit will be held Oct. 29-31 at the Bismarck Event Center. governor.nd.gov", "2019-08-21T16:03:58.000Z": "And what an amazing season for ND teams overall:\n- Fargo Dirt Dawgs 56-0, #BabeRuthWorldSeries 13U champs\n- @biscaps15 finish 2nd in 13-15 #BabeRuthWorldSeries - Wahpeton 14U in #BabeRuthWorldSeries - West Fargo Rattlers 10U Cal Ripken WS\nAmerica's pastime is alive & well in ND!", "2019-08-21T16:03:57.000Z": "Congrats to the players, coaches, parents and fans of @fargo_post2 on an incredible season and strong effort in today's @ALWS_Shelby championship -- the first ND team to reach the title game! You've made your state and community proud! Quote Tweet Fargo Post2 Baseball @fargo_post2 This team left it all out on the field falling just short\n     54-8 record\n      ND champs\n      Central Plains Champs\n      ALWS runner-up\nThank you to Coach Rustad, Coach Linstaedt, the players, and parents for you commitment and dedication to Post 2 Baseball #LiveTheTradition", "2019-08-21T13:52:04.000Z": "Wishing students a happy and safe return to school in Bismarck today and across the state this week! Special thanks to our schoolteachers, administrators and all educators for their dedication to our state's greatest resource -- our young people! #backtoschoolND  #InnovativeND", "2019-08-21T00:16:29.000Z": "Great meeting with WGA staff to discuss our plans for Reimagining the Rural West, our @westgov chairman's initiative to support rural communities.", "2019-08-19T16:56:10.000Z": "Congratulations to @aldevron for breaking ground on their new facility in Fargo! It takes a lot of effort to building a world-class company like this. Thanks to Michael Chambers, John Ballantyne & their team for doing it right here in North Dakota! http:// governor.nd.gov/news/burgum-he lps-break-ground-aldevron-expansion-highlights-investment-nds-technology-sector ", "2019-08-16T15:55:49.000Z": "Congratulations to the #BabeRuthWorldSeries champion Fargo Dirt Dawgs on an amazing perfect season, 56-0! Thanks to these young men and their coaches, parents and fans for doing an outstanding job of representing our great state! Quote Tweet Fargo Post2 Baseball @fargo_post2 The 2019 13u Babe Ruth World Series CHAMPIONS.  \n         FARGO DIRT DAWGS \n                       56-0\nA record that will most likely never be reached again. History is made in Fargo youth baseball.", "2019-08-15T21:37:43.000Z": "Big things are happening in North Dakota. Thanks to all who attended and helped make this year's Governor's Summit on Innovative Education a success! #InnovativeND  #InnovativeND19", "2019-08-14T16:56:43.000Z": "The Governor's Summit on Innovative Education is off to a great start! We're hearing from North Dakota educators and students who are leading the way in their schools. Watch live ( http:// livestream.com/accounts/24798 519/events/8782037  ) and follow along using #InnovativeND19 and #InnovativeND .", "2019-08-14T00:17:45.000Z": "Getting ready for the Governor's Summit on Innovative Education happening tomorrow and Thursday in Jamestown! It's not too late to join: http:// eventbrite.com/e/2019-governo rs-summit-on-innovative-education-registration-62280965043   #InnovativeND  #InnovativeND19", "2019-08-12T22:39:45.000Z": "As ND's population has increased, classroom space has become a challenge for many school districts - particularly in high-growth areas in the Bakken. Thanks to all who joined us in Williston to discuss how we can work together to ensure the best possible outcomes for students!", "2019-08-12T15:54:58.000Z": "Great to see you, @SteveCase and @JeanCase ! Thanks for visiting our great state. Enjoy the rest of your travels here! @ExperienceND Quote Tweet Steve Case @SteveCase Thanks, @DougBurgum , for being such a wonderful and welcoming host as we travel through #NorthDakota . @JeanCase and I are having a great time, exploring your great state! #RVAcrossAmerica  #RiseOfRest  #Fargo  #Bismarck  #Medora twitter.com/SteveCase/stat", "2019-08-09T19:52:31.000Z": "More than 65 communities across ND are involved in the Main Street Initiative, developing best practices that all communities can adapt. On this episode, local leaders from Grand Forks, Cavalier and Lakota share what makes their towns healthy and vibrant. Work Worth Doing Listen to the latest episode of Gov. Burgum's podcast. governor.nd.gov", "2019-08-08T17:14:42.000Z": "Grateful for the nearly 70 candidates who applied to the North Dakota Ethics Commission and to Senators Wardner and Heckaman for the collegial selection process that produced an excellent group of five initial members. Committee selects five members for new North Dakota Ethics Commission A committee tasked with selecting members of North Dakota's newly created Ethics Commission reached consensus on appointing the first five members to the voter-approved Commission. governor.nd.gov", "2019-08-07T19:49:46.000Z": "Read more: Burgum leads delegation on tour of petrochemical facilities in Canada in effort to bring industry... Gov. Doug Burgum led a delegation of state officials and legislative leaders on a tour of petrochemical facilities in the Canadian province of Alberta as part of ongoing efforts to bring the petroc... governor.nd.gov", "2019-08-07T19:44:59.000Z": "In Alberta today with legislators, @BankofND & agency officials to learn more about how the province developed its petrochemical industry. North Dakota has abundant natural gas that could be processed at home to create jobs, diversify the economy & grow wealth in our communities!", "2019-08-06T21:08:46.000Z": "Congratulations to Spirit Lake Wellness and Recovery Center on their new residential substance abuse treatment facility! Grateful for the leadership of Cankdeska Cikana Community College, United Health Foundation & the many supporters who have helped make this project a reality.", "2019-08-06T18:05:56.000Z": "The agenda for next week's Summit on Innovative Education is now live! Check out our lineup of experts in education and behavioral health and register for your ticket today: http:// eventbrite.com/e/2019-governo rs-summit-on-innovative-education-registration-62280965043 ", "2019-08-05T18:16:00.000Z": "On Aug. 14-15, attendees at the Summit on Innovative Education will discuss how educators, behavioral health providers and communities can develop new ways to better serve students' behavioral health needs. Get a preview of the event on our latest podcast: Work Worth Doing Listen to the latest episode of Gov. Burgum's podcast. governor.nd.gov", "2019-08-02T21:20:29.000Z": "Great news for ND beef producers and U.S. ag! Our farmers & ranchers can compete w/ anyone if given market access & a level playing field. Thanks to @POTUS , @SecretarySonny , @USTradeRep Lighthizer, @SenJohnHoeven & all who made it happen. Now Congress needs to pass the #USMCA ! Quote Tweet The White House @WhiteHouse President Trump just signed a deal  to let American beef farmers export more of their product to the European Union!", "2019-08-02T16:42:51.000Z": "Interested in a new opportunity for public service? Applicants are being sought for three new boards created by the 2019 Legislature, including a council to promote collaboration across all K-12 education entities in North Dakota. Read more and apply: http:// governor.nd.gov/news/applicant s-sought-new-boards-related-k-12-education-environmental-issues ", "2019-08-01T19:53:38.000Z": "Thanks to everyone for the birthday wishes today. Feeling blessed and grateful for your kind words, friendship and the opportunity to serve the people of ND!", "2019-08-01T15:49:34.000Z": "State solutions in the health care sector can reduce costs for consumers and provide greater stability in the individual insurance marketplace. Thanks to @NDID Commissioner Godfread for his leadership in securing a waiver for this reinsurance program. Godfread Announces Federal Approval of State-based Reinsurance Program for Individual Health... Insurance Commissioner Jon Godfread announced today that the proposed state-based reinsurance program developed by the North Dakota Insurance Department for the individual health insurance market has... insurance.nd.gov", "2019-07-31T19:49:27.000Z": "With the broad experience and expertise that these commissioners bring to the table, the SWC will continue to manage and develop our water resources in a way that improves the quality of life and the health of our economy for all North Dakotans. Burgum appoints four to State Water Commission The four appointments include a member to fill the newly created seat representing the Little Missouri River basin in southwestern North Dakota. governor.nd.gov", "2019-07-30T17:06:19.000Z": "Governors are addressing the economic and social challenges of rural America , reports @GOVERNING from our Summer Meeting. @DougBurgum : \"You can replicate the elements of entrepreneurship and innovation, I believe, in any size community.\" #WeTheStates As Rural America Slips, Governors Look for Ways to Help Rural America lags behind metro areas in terms of population growth, business creation and workforce participation. governing.com", "2019-07-29T19:00:51.000Z": "The Bank of North Dakota is a unique asset that has helped create a robust locally-owned banking system and has supported agriculture, commerce and students for the benefit of all North Dakotans. Happy 100th anniversary, @BankofND !", "2019-07-29T14:29:13.000Z": "Announcing the first round of presenters for the Governor's Summit on Innovative Education! We're excited to have these local and national experts share their perspectives on how we can improve education for everyone. Stay tuned for more & register today: http:// eventbrite.com/e/2019-governo rs-summit-on-innovative-education-registration-62280965043 ", "2019-07-28T21:01:08.000Z": "This is a great step forward in recognizing the history of the @TMBChippewa in our area. Congratulations to @ChairmanAzure and the leaders of the International Peace Garden on this continued collaboration to tell the story of this special place. Quote Tweet Chairman Jamie Azure @ChairmanAzure Tribal flag raised at International Peace Garden https:// kfyrtv.com/content/news/T ribal-flag-raised-at-International-Peace-Garden-513299961.html ", "2019-07-27T22:34:54.000Z": "Honored to join soldiers from the @NDNationalGuard 's 957th Engineer Company and their families for a ceremony today before their yearlong deployment to Kuwait. Our Guard soldiers are the best in the nation and we're grateful for their service.", "2019-07-26T19:37:08.000Z": "Join us on Aug. 14-15 in Jamestown! Register for your ticket: 2019 Governor's Summit on Innovative Education Join us for the 2019 Governor's Summit on Innovative Education August 14-15 at Jamestown High School in Jamestown, ND. We are excited to listen, learn and grow along with teachers, students, admini... eventbrite.com", "2019-07-26T19:31:05.000Z": "Interested in learning what the Summit on Innovative Education is all about? State Supt. @KirstenBaesler and Pam Sagness of the Dept. of Human Services joined us for a special preview of the event. Listen below or on our website ( http:// governor.nd.gov/podcast ). Innovative Education: Supporting Students, Educators and Communities - Gov. Doug Burgum open.spotify.com", "2019-07-25T20:25:40.000Z": "Thrilled to announce $200K in federal funding to support the launch of Emerging Digital Academy, an accelerated learning platform that will teach new skills to help North Dakotans thrive in an economy undergoing rapid technological change. Read more: Burgum announces federal funding for technology upskilling school with ties to Grand Farm initiative Burgum announces federal funding totaling $200,000 to support the launch of Emerging Digital Academy. governor.nd.gov", "2019-07-25T15:34:48.000Z": "Bismarck native Dave St. Peter has spent 28 years with the @Twins building a strong community and delivering outstanding customer service. Great to chat with him on the @TEDxFargo stage (and give a @UofNorthDakota alum his very own @NDSUfootball jersey)!", "2019-07-24T21:01:08.000Z": "The Governor's Summit on Innovative Education is fast approaching! Sara Medalen of @sunnyside_mps shares why she'll be joining us in Jamestown on Aug. 14-15. Register for your ticket today: http:// eventbrite.com/e/2019-governo rs-summit-on-innovative-education-registration-62280965043 ", "2019-07-23T20:34:15.000Z": "Sen. Dwight Cook has been a true statesman and an outstanding leader in shaping tax policy for the good of all North Dakotans during his 22 years of faithful service in the Legislature. We are tremendously grateful for his service and wish him all the best in retirement. Quote Tweet The Bismarck Tribune @bistrib Longtime state Sen. Dwight Cook of Mandan retiring from the Legislature #NDLeg  #NDPol  https:// buff.ly/2M4dvOK", "2019-07-22T18:05:50.000Z": "In memory of retired Associate Justice John Paul Stevens and his 34 years of service on the Supreme Court, all government agencies are directed to fly flags at half-staff tomorrow, in accordance with a proclamation by @POTUS . Homeowners & businesses are encouraged to do the same.", "2019-07-21T21:19:31.000Z": "You can get our weekly newsletter delivered directly to your inbox! Check out this week's Dakota Download ( http:// spark.adobe.com/page/s2TiFHjK7 d0gS/  ) and subscribe ( http:// apps.nd.gov/itd/listserv/m aint.htm?reqid=GOV&request=AgencyListServEnterEmail  ). News Releases and Newsletters apps.nd.gov", "2019-07-19T21:07:37.000Z": "Thanks to @SenJohnHoeven , @SenKevinCramer and @RepArmstrongND for introducing legislation to return criminal jurisdiction to Spirit Lake Nation. Repealing this outdated law respects the ability of both the state and the tribal nations to exercise and enforce public safety.", "2019-07-18T19:44:33.000Z": "Great catching up with Minnesota @GovTimWalz and discussing how we can get the FM Area Diversion Project done and provide citizens with permanent protection from catastrophic flooding.", "2019-07-18T14:43:53.000Z": "Join @NDDPI Superintendent @KirstenBaesler and me on August 14-15 at the 2019 Governor's Summit on Innovative Education in Jamestown! Register today for your free ticket and learn more here: http:// eventbrite.com/e/2019-governo rs-summit-on-innovative-education-registration-62280965043   @NDUnited  @NDCELorg  @BushFoundation  #innovativeND  #ndedchat", "2019-07-17T15:26:17.000Z": "Check out the kickoff webinar of my @westgov chairman's initiative, Reimagining the Rural West: http:// westgov.org/news/webinar-r egister-for-reimagining-the-rural-west-initiative-launch-on-july-16  Quote Tweet Western Govs Assoc. @westgov \"We need to build great places to live, grow, work, and retire,\" says Gov. Doug Burgum during WGA webinar. \"Sometimes that's not about resources, but leadership. That's the strength of community.\"", "2019-07-17T13:26:45.000Z": "I've signed an executive order waiving of hours of service for haulers of cement and fly ash supplies to assist in the timely completion of infrastructure projects throughout North Dakota, including the new Williston airport. A link to the order is here: Burgum waives hours of service for haulers of cement, fly ash to aid timely completion of infrast... Gov. Doug Burgum signed an executive order granting a waiver of hours of service requirements for drivers of commercial vehicles transporting cement and fly-ash supplies to assist in the timely... governor.nd.gov", "2019-07-16T23:07:51.000Z": "Today, we're in Mott looking at the extensive damage done by Friday's tornado. In true North Dakota spirit, the surrounding communities have come together to support those in need. The state stands ready to assist in any way we can during the recovery.", "2019-07-15T15:00:27.000Z": "Join us for a Western Governors' Association webinar tomorrow on Reimagining the Rural West, the central policy initiative of my @westgov chairmanship. I'll be joined by experts from around the west for an engaging discussion at 11 a.m. CT. Register here: http:// westgov.org/news/webinar-r egister-for-reimagining-the-rural-west-initiative-launch-on-july-16 ", "2019-07-15T00:35:45.000Z": "On the latest episode of the podcast, State Health Officer Mylynn Tufte joins us to discuss the medical marijuana program, child immunizations and some of the other ways in which the @NDDOH is supporting healthy lives for all North Dakotans. Check it out! Work Worth Doing Listen to the latest episode of Gov. Burgum's podcast. governor.nd.gov", "2019-07-12T21:31:59.000Z": "As a state that shares geography & history with Spirit Lake Nation, and an administration that prioritizes tribal partnerships built on understanding and mutual respect, we support these efforts to properly honor Dakota history. My full letter of support: https:// governor.nd.gov/sites/www/file s/documents/executive-orders/June11WhiteHorseHill.pdf  Quote Tweet Grand Forks Herald @gfherald Congress mulls name change for Sullys Hill preserve on Spirit Lake Reservation to traditional Dakota name https:// trib.al/Vj7qTlX", "2019-07-11T00:07:23.000Z": "Great progress made today: By destigmatizing these minor and, in many cases, distant offenses, we can give individuals a second chance at a successful, healthy and productive life. Pardons for minor marijuana crimes to be eligible for streamlined application process in North... BISMARCK - A North Dakota state panel approved a new policy meant to streamline the pardon application process for minor marijuana crimes Wednesday, July 10, which supporters hope will make it easier... inforum.com", "2019-07-08T20:24:40.000Z": "Congrats to Sara Lupton of the @USDA Edward T. Schafer Agricultural Research Center in Fargo for receiving the Presidential Early Career Award for Scientists & Engineers, awarded to emerging leaders like Sara for outstanding research in science & tech! President Donald J. Trump Announces Recipients of the Presidential Early Career Award for Scienti... Today, President Donald J. Trump announced the recipients of the Presidential Early Career Award for Scientists and Engineers (PECASE). whitehouse.gov", "2019-07-07T20:48:02.000Z": "Nominations are now open for the 2019 Main Street Awards! These awards recognize communities and individuals that are actively working to differentiate and enhance the quality of life for their present and future residents. Find out more: http:// nd.gov/living-nd/main -street-nd/main-street-awards ", "2019-07-04T14:02:38.000Z": "Today we celebrate the birth of a nation built on a foundation of freedom and grounded in the unalienable rights to life, liberty and the pursuit of happiness. @FirstLadyND and I wish you and your families a joyous and safe Independence Day.", "2019-07-01T20:59:41.000Z": "On the latest episode of our podcast, we discuss cryptocurrencies, micro-investing apps and other financial technologies and what they have to do with the ND Securities Department. Check it out on Apple Podcasts, Spotify or at the link below! Work Worth Doing Listen to the latest episode of Gov. Burgum's podcast. governor.nd.gov", "2019-06-29T15:14:52.000Z": "Great to see @cj_wentz back home in North Dakota! Grateful for his commitment to serve others through the @AO1Foundation .", "2019-06-26T22:52:49.000Z": "Grateful to @FirstLadyND and the students of @SADDNation for making a difference in the lives of young people across North Dakota! Quote Tweet First Lady Kathryn Burgum @FirstLadyND Thank you @SADDnation for honoring me with the Outstanding Contribution Award. SADD empowers & mobilizes young leaders to change the world!\n\nA special shoutout to my fellow North Dakotans with @nlsadd and your courageous leadership to support strong, healthy, & safe communities!", "2019-06-25T19:15:15.000Z": "Fantastic news for North Dakota! NDDOT has received a waiver from @FAANews to operate #UAS over people, strengthening our position as the nation's proving ground for UAS and acknowledging ND's work to ensure safe integration into the national airspace. http:// governor.nd.gov/news/burgum-is sues-statement-faa-granting-waiver-operate-unmanned-aircraft-systems-over-people ", "2019-06-24T20:36:58.000Z": "Thanks to the hundreds of members of Team ND who are making an investment in themselves during Leadership Everywhere Week! Great professional development tools in the public sector encourage continuous learning and enable our team to better serve the citizens of North Dakota.", "2019-06-21T17:24:41.000Z": "It's not too late to submit nominations for the #InnovativeND Awards or to apply to speak at this year's summit. Find out more: http:// bit.ly/innovativend19", "2019-06-21T17:24:40.000Z": "Registration is now open for the 2019 Governor's Summit on Innovative Education! Reserve your spot today to join us Aug.14-15 in Jamestown for an agenda packed w/ info on innovative instruction, best practices regarding behavioral health in schools & more. http:// eventbrite.com/e/2019-governo rs-summit-on-innovative-education-registration-62280965043?aff=ebdssbdestsearch ", "2019-06-20T17:08:17.000Z": "With Mexico's approval secured, we strongly urge Congress and Canada to ratify the #USMCA and modernize trade relations with North Dakota's largest trading partners, accounting for nearly $5 billion in annual exports. My full statement: http:// governor.nd.gov/news/burgum-st atement-mexico%E2%80%99s-approval-us-mexico-canada-agreement ", "2019-06-19T17:40:00.000Z": "These educators are changing lives! Together with @NDDPI and @NDUnited , we recognized the accomplishments of several teachers and administrators today who have achieved statewide and national attention for their work to improve the lives of North Dakota students. Congratulations!", "2019-06-19T14:25:18.000Z": "Thrilled to announce Border States CEO Tammy Miller will join the administration as chief operating officer, bringing extensive experience to our ongoing efforts to reinvent government. Grateful to outgoing COO Jodi Uecker for her outstanding leadership. http:// governor.nd.gov/news/burgum-an nounces-border-states-ceo-tammy-miller-next-chief-operating-officer-state-north-dakota ", "2019-06-18T18:00:25.000Z": "We appreciate the @forestservice 's proposal to modernize compliance with the National Environmental Policy Act. This proposal will simplify and clarify the rules, lowering project costs and allowing all North Dakotans to use and enjoy their public lands. http:// governor.nd.gov/news/burgum-ap plauds-usda-proposal-modernize-nepa-process-improve-access-public-lands# ", "2019-06-17T22:43:05.000Z": "Collaboration and communication across every branch of state government is the best way to serve our citizens. Grateful to the 60+ leaders of Team ND that joined us today for a Judicial-Executive-Legislative meeting to discuss the ways we can work together and improve outcomes.", "2019-06-16T23:06:41.000Z": "To my dad, Joey, and all the dads who have instilled lifelong lessons in their children throughout the years, Happy #FathersDay . My favorite part of today is celebrating with the three amazing people who gave me the greatest job in the world.", "2019-06-15T03:43:36.000Z": "For 242 years, Americans have proudly flown the flag as a symbol of liberty and democracy. Today we celebrate the Stars and Stripes and honor the service and sacrifice of those who protect our freedoms. #FlagDay", "2019-06-14T18:34:23.000Z": "Find this episode and past episodes here: Work Worth Doing Listen to the latest episode of Gov. Burgum's podcast. governor.nd.gov", "2019-06-14T17:33:24.000Z": "Since 1935, @NDHighwayPatrol has been keeping North Dakota safe and secure, and we are grateful for their service. In today's episode of Work Worth Doing, we talk to NDHP Supt. Col. Brandon Solberg, learn from the cultural liaison officer and hop in a patrol car for a ride-along.", "2019-06-13T16:02:07.000Z": "Why do we love North Dakota so much? Take a few minutes to watch this video and hear why, in the words of Theodore Roosevelt. Thanks to ND Tourism for doing such a fantastic job of showcasing our great state and its wonderful people! @NorthDakota North Dakota video for Western Governors' Association Promotional video for Governor Doug Burgum's announcement that the Western Governors' Association 2020 Annual Meeting will be held in Medora, North Dakota. youtube.com", "2019-06-12T19:36:59.000Z": "Deeply grateful to @POTUS & @fema for granting our disaster declaration request after spring flooding damaged infrastructure and hurt farmers, homeowners & others. Thanks to @SenJohnHoeven , @SenKevinCramer & @RepArmstrongND for pushing for the declaration! Burgum thanks Trump administration for granting presidential disaster declaration for spring... Gov. Doug Burgum expressed his deepest thanks to President Trump and the Federal Emergency Management Agency for granting North Dakota's request for a presidential major disaster declaration for... governor.nd.gov", "2019-06-12T18:54:12.000Z": "Honored to be elected chair of @westgov and excited to unveil the Reimagining the Rural West policy initiative! Thanks @GovHawaii for your leadership, and welcome @OregonGovBrown as vice chair. Looking forward to building upon WGA's bipartisan successes! https:// governor.nd.gov/news/burgum-el ected-chairman-western-governors%E2%80%99-association-unveils-%E2%80%98reimagining-rural-west%E2%80%99 ", "2019-06-11T22:14:20.000Z": "Calling all educators! At the Governor's Summit on Innovative Education, we want to shine a light on the great work being done in our schools. Help us recognize excellence by submitting your nominations for awards and speakers today at http:// bit.ly/innovativend19", "2019-06-10T20:38:53.000Z": "Good to see @SecBernhardt at the @WestGov annual meeting today to discuss natural resources, energy development and improvements to @TRooseveltNPS . We appreciate @Interior 's continued collaboration on the opportunities and challenges faced by North Dakota. http:// governor.nd.gov/news/burgum-me ets-interior-secretary-bernhardt-western-governors%E2%80%99-association-annual-meeting ", "2019-06-09T15:36:20.000Z": "Glad to appoint Kaleb Dschaak to serve as the student representative on the state Board of Higher Education! His experience in student government and information technology will provide useful perspective during this period of rapid change in higher ed. Student voice plays vital role on State Board of Higher Education | Grand Forks Herald Earlier this week, Gov. Doug Burgum appointed UND student Kaleb Dschaak to a one-year term as the student representative on the State Board of Higher Education. Dschaak's role on the board, while... grandforksherald.com", "2019-06-06T19:56:48.000Z": "Read my op-ed with AR Gov. @AsaHutchinson on improving behavioral health in our nation's correctional facilities, as we're doing in ND. There must be collective agreement that our criminal justice system should improve communities, not be a source of harm. Govs. Hutchinson, Burgum: All Americans stand to benefit from fixing the health crisis in our... We must make our jails serve their intended purpose of maintaining public safety, rather than treating them as de facto psychiatric facilities. foxnews.com", "2019-06-06T15:55:04.000Z": "On the 75th anniversary of D-Day, we honor the 160,000 Allied soldiers who bravely fought to overcome tyranny and secure liberty, including more than 6,600 Americans who were killed, wounded or missing in action. For their sacrifice and for our freedom, we are eternally grateful.", "2019-06-05T17:47:30.000Z": "Wishing @FirstLadyND a fantastic Happy Birthday! Grateful for your courage and inspired by your work to make a difference every day!", "2019-06-05T15:36:46.000Z": "Congratulations, @RepArmstrongND ! Your great work on this important issue has made a difference in North Dakota and will continue on a national scale to benefit our corrections systems, communities and workforce. Quote Tweet Congressman Kelly Armstrong @RepArmstrongND I introduced my first bill today - the Justice Reinvestment Initiative Act. This bill helps state, local, and tribal governments use evidence-based strategies to make communities safer and save money on corrections. https:// armstrong.house.gov/media/press-re leases/congressman-kelly-armstrong-introduces-justice-reinvestment-initiative-act  Show this thread", "2019-06-04T22:43:35.000Z": "June is #SafetyMonth in North Dakota! \n\nThanks to our public and private employers and the ND Safety Council for their efforts to keep their team members safe on the job and at home. http:// ndsc.org/jipnsmind/", "2019-06-03T14:42:49.000Z": "Congratulations to @Aldevron on its big announcement to continue growing in North Dakota! This expansion will create hundreds of jobs in the local economy and elevate our region as a center of innovation. Fargo biotech firm announces major expansion to add 189,000 square feet, employ over 1,000 | INFORUM FARGO - Aldevron is announcing a major expansion of its campus that will increase its biotechnology production capacity 10-fold, quintuple its warehouse space and create a research and development... inforum.com", "2019-06-02T21:58:28.000Z": "Always Ready, Always There. These are the four words that Major General Al Dohrmann uses to describe his team at the @NDNationalGuard and @nddes . Check out the latest episode of \"Work Worth Doing\" for an inside look at their work to serve North Dakota. http:// governor.nd.gov/media-center/w ork-worth-doing-gov-doug-burgum ", "2019-05-31T22:26:15.000Z": "School may be wrapping up for the summer, but that doesn't mean our students are putting down their books! Fun to see so many young people at the @NDStateLibrary 's Summer Reading Celebration today.", "2019-05-31T20:29:53.000Z": "Great to visit the Dept. of Environmental Quality, our newest agency! Previously part of the Dept. of Health, the DEQ was designated as a cabinet-level agency to streamline gov't and acknowledge the importance of environmental stewardship in North Dakota. http:// governor.nd.gov/news/burgum-hi ghlights-important-work-newly-established-department-environmental-quality ", "2019-05-30T18:43:52.000Z": "Beautiful day to get outside with members of Team ND for our annual Walk@Work event, part of the Governor's Wellness Initiative with NDPERS and Sanford Health Plan. Small choices to incorporate more physical activity into the day can have major health benefits!", "2019-05-29T14:31:28.000Z": "Great to help kick off #DroneFocus19 this morning! As Dep. Asst. Secretary David Short of the U.S. DOT said this morning, North Dakota is truly on the leading edge of UAS activity. Thanks to all who are gathered today to keep pushing this industry forward!", "2019-05-28T01:54:37.000Z": "Today we paid tribute to those who made the ultimate sacrifice. As we honor these fallen heroes on #MemorialDay , we also remember their families, the men and women still serving, & those who have returned home and need our continued support. May we never forget their sacrifices.", "2019-05-27T13:01:48.000Z": "On #MemorialDay - and every day - we remember the brave military men and women who defended our freedoms and made the ultimate sacrifice in the name of liberty. With unending gratitude, we honor their incredible acts of valor and unwavering devotion to the service of this nation.", "2019-05-26T22:20:05.000Z": "To solve our workforce shortage, we must ensure that everyone who wants to work can do so. @JobServiceND 's 2nd Chance Job Fair will connect jobseekers with barriers to employment with employers willing to provide employment opportunities.\n\nFind out more: Burgum promotes 2nd Chance Job Fair designed for individuals with barriers to employment Job Service North Dakota is hosting its annual 2nd Chance Job Fair on June 6 in Bismarck, Grand Forks and Fargo, Gov. Doug Burgum announced. governor.nd.gov", "2019-05-24T14:31:01.000Z": "We submitted a request to @POTUS for a major disaster declaration in the aftermath of widespread spring flooding that damaged homes and inundated roads and farmland, resulting in serious economic hardship for our residents. #NDResponse Read more: Burgum requests presidential major disaster declaration for impacts of widespread spring flooding Gov. Doug Burgum has requested a presidential major disaster declaration as a result of widespread spring flooding that damaged homes and public infrastructure, inundated hundreds of roads and... governor.nd.gov", "2019-05-23T19:46:45.000Z": "Grateful for all of the Watford City community members who were able to join us this morning for our 50th Main Street Initiative visit! As Lt. Gov. @BrentSanfordND knows from his time as mayor of this great town, collaboration is key to building healthy, vibrant communities.", "2019-05-23T15:02:56.000Z": "We're in Watford City this morning with Lt. Gov. @BrentSanfordND (and former Watford City mayor) to talk about the Main Street Initiative. Looking forward to our team's 50th MSI visit to hear from the residents of one of our fastest-growing communities!", "2019-05-22T20:19:12.000Z": "These dedicated folks are currently walking a 370-mile route across North Dakota to bring awareness to the effects of post-traumatic stress disorder among our combat veterans. If you see them, make sure to wave and show your support! http:// bradyoberglegacyfoundation.org/events/the-2nd -annual-bradys-border-to-border-ruck-march/ ", "2019-05-20T21:41:05.000Z": "The US deal with Canada and Mexico to lift tariffs on steel & aluminum is great for ND's manufacturers & consumers. Now, Congress must ratify the #USMCA to modernize ties with ND's two largest trading partners-representing more than 85% of our exports. http:// ustr.gov/about-us/polic y-offices/press-office/press-releases/2019/may/united-states-announces-deal-canada-and ", "2019-05-19T16:53:41.000Z": ". @BrentSanfordND discusses a new initiative to build a statewide UAS network on this bonus episode of our podcast. With the legislature's support, this project is ready to get underway. Listen to find out why ND is America's proving grounds for #UAS ! http:// bit.ly/WWDPod", "2019-05-17T19:03:48.000Z": "This was an important topic among our ag producers during Secretary Perdue's recent visit to North Dakota. We appreciate his partnership as we work to expand market access and develop more value-added agriculture in our state.", "2019-05-17T18:28:36.000Z": "American beef will have full access to Japanese markets once again, which could expand U.S. exports by up to $200 million. This is great news for North Dakota's ranchers! Thanks @SecretarySonny for supporting and hearing us out on this issue. U.S. Beef Gains Full Access to Japan (Washington, D.C., May 17, 2019) - U.S. Secretary of Agriculture Sonny Perdue today announced that the United States and Japan have agreed on new terms and conditions that eliminate Japan's longsta... usda.gov", "2019-05-16T17:02:35.000Z": "North Dakota's economic success story was recently profiled by American Way magazine! Great to see national attention recognizing our state as a land of innovation and opportunity for so many established and emerging local businesses. http:// ink-global.com/emagazines/ame rican-way-spotlight/2598/may-2019/ ", "2019-05-15T14:51:59.000Z": "On Peace Officers Memorial Day, we honor the courageous men and women in uniform who died protecting our communities, our families and our freedoms, including the 64 North Dakotans who lost their lives in the line of duty. We will always remember their sacrifice.", "2019-05-14T20:47:46.000Z": "Thanks @usnews for again recognizing ND as a land of opportunity, w/ No. 1 labor force participation rate and low unemployment. With an estimated 30,000+ open jobs and a high quality of life, ours is one of the best states to live, work and raise a family. U.S. News Ranks the 50 States Not all states are created equal. usnews.com", "2019-05-12T22:11:24.000Z": "Happy Mother's Day! Today, we are reminded of our daily gratitude for the moms who have loved, raised, healed, encouraged and inspired us.", "2019-05-08T14:16:39.000Z": "Congratulations to Dyuti Dawn and Junting Shen of @FargoNDSchools ' Davies High for being named 2019 Presidential Scholars! This is a well-deserved recognition of your academic excellence. Thanks for representing your state so well! http:// ed.gov/news/press-rel eases/161-students-across-country-named-2019-us-presidential-scholars ", "2019-05-07T17:52:04.000Z": "How important is #Census2020 ? One North Dakotan not counted equals $19,100 of lost federal funds-funds that help provide roads, schools, emergency services and more-between 2020-2030. \n\nThe Complete Count Task Force will help ensure an accurate census. Burgum kicks off Census 2020 efforts in North Dakota with executive order creating Complete Count... Gov. Doug Burgum has signed an executive order creating the Complete Count Task Force to recommend strategies that safeguard and promote the 2020 census to ensure a fair and accurate count for the... governor.nd.gov", "2019-05-06T23:44:18.000Z": "This groundbreaking statewide network will provide economic diversification opportunities in every community and solidify North Dakota's reputation as a leader in #UAS . Thanks to the legislators who supported this project! Quote Tweet Lt. Gov. Brent Sanford @BrentSanfordND Great to be in Grand Forks to highlight the new $28M investment in a statewide UAS network! By building a traffic control system for UAS flights beyond visual line of sight, this network has huge potential for aviation, ag, energy and other industries. http:// nd.gov/news/north-dak ota-invests-28-million-statewide-uas-network ", "2019-05-04T16:09:18.000Z": "It's inspiring to see so many members of our community come together this morning to honor and remember the 2.7 million Americans who served in Vietnam - including more than 15,000 North Dakotans. We are forever grateful for their service.", "2019-05-04T14:27:58.000Z": "On the latest episode of Work Worth Doing, we're joined by Scott Davis, Executive Director of the ND Indian Affairs Commission, to talk about the future of tribal, state and federal partnerships in North Dakota. Listen here: http:// governor.nd.gov/media-center/w ork-worth-doing-gov-doug-burgum ", "2019-05-03T17:09:12.000Z": "Pleased to see the DC Circuit Court rule in favor of the Northwest Area Water Supply project today after 16 years of litigation. This project will bring a reliable water supply to northwest ND, which is key to attracting development and economic growth. http:// attorneygeneral.nd.gov/news/stenehjem -praises-court%E2%80%99s-naws-ruling ", "2019-05-02T21:22:07.000Z": "#ND Gov @DougBurgum joins me tonight to talk about the #NDLeg session and what got accomplished for you and your family. \nTune in 6:30p on KX4", "2019-05-02T18:21:26.000Z": "Glad to see so many faith leaders, elected officials, educators, business leaders and community members attending the #NationalDayofPrayer ceremony this afternoon. Though we may pray in our own ways, in our own places and in our own faiths, we all have so much to be grateful for.", "2019-05-01T20:36:51.000Z": "With the help of Vern Huber, a Korean War POW, the POW/MIA flag was raised in front of the Capitol today. Thanks to HB 1056, this flag will be flown in this location as a constant reminder of the service members who never returned home. You are not forgotten.", "2019-04-30T18:41:36.000Z": "ICYMI: The Flying Tigers exhibit at the @FargoAirMuseum opened over the weekend! It was an honor to take part in the ceremony and to recognize the family of Lt. Percy Robert Bartelt for his service during World War II. http:// inforum.com/news/1012427-F ormer-Flying-Tigers-pilot-honored-during-debut-of-exhibit ", "2019-04-29T19:33:27.000Z": "This session, we worked with legislators to invest in the future and fund our priorities, all while ensuring state government lives within its means. We've signed 475 bills and continue to work through the 50+ that remain. Read a recap of this session: Burgum: Session delivers conservative budget, funds priorities and makes strategic investments... North Dakota is making strategic investments in its future, funding priorities and delivering citizens a conservative balanced budget without raising taxes, Gov. Doug Burgum said today after the... governor.nd.gov", "2019-04-27T20:51:18.000Z": "Excited by this new technology being pioneered right here in North Dakota! Combined with our proposal for a statewide UAS network, which was funded by the Legislature this week, our state is making huge strides in precision agriculture. Quote Tweet Sec. Sonny Perdue @SecretarySonny Joined the ribbon cutting ceremony and launch of The #GrandFarm . Their goal is to develop an autonomous farm by harnessing innovation and technology which will help feed and clothe the world.", "2019-04-27T14:20:23.000Z": "Grateful to have @SecretarySonny back in North Dakota today with @SenJohnHoeven and @SenKevinCramer to talk with local ag producers about trade and other issues facing our state's farmers and ranchers.", "2019-04-26T19:47:21.000Z": "Today, SB 2001 became law, creating an endowment for the Theodore Roosevelt Presidential Library & Museum. This museum will tell the story of Roosevelt and the people of North Dakota, and we're grateful to the Legislature for seizing this opportunity. http:// governor.nd.gov/news/burgum-si gns-bill-thanks-legislators-creating-endowment-theodore-roosevelt-presidential-library ", "2019-04-25T21:13:26.000Z": "North Dakota's 150 boards and commissions rely on your participation. Among those, applications are being accepted through May 24 for service on the Ethics Commission, which was established through a voter-approved constitutional amendment last November. http:// governor.nd.gov/boards/", "2019-04-24T18:53:04.000Z": "Glad to see this partnership to create a #UAS corridor that will keep North Dakota on the leading edge of UAS traffic control technology. Excited to see what this and the statewide UAS network will bring! https:// grandskynd.com/uas-bvlos-supe r-corridor/  Quote Tweet Senator John Hoeven @SenJohnHoeven BREAKING NEWS: @GrandSkyND & HarrisCorp just announced a new #UAS Super Corridor in the Red River Valley - will enable both large & small UAS aircraft to fly beyond visual line of sight for approx. 100 miles, helping integrate this tech into our airspace. (1/2) Show this thread", "2019-04-24T15:18:44.000Z": "My statement of thanks to the Legislature for supporting the Theodore Roosevelt Presidential Library and Museum. Read more: https:// governor.nd.gov/news/burgum-th anks-legislature-seizing-historic-opportunity-support-theodore-roosevelt-presidential ", "2019-04-23T14:01:38.000Z": "Congratulations to Brigadier General Huber on the promotion! After multiple deployments and decades of service, Huber has joined the ranks of general officer in the @NDNationalGuard -the second woman to do so. Her continued leadership is deeply appreciated. https:// facebook.com/NDNationalGuar d/posts/10156495205077428 ", "2019-04-22T16:59:45.000Z": "Happy #EarthDay ! ND's land, water and air-the cleanest in the U.S.-is living proof of our culture of conservation and respect for our natural resources. Learn how the state supports this year's Earth Day theme, \"Protect Our Species,\" on our latest podcast: http:// governor.nd.gov/media-center/w ork-worth-doing-gov-doug-burgum ", "2019-04-21T14:43:37.000Z": "Happy Easter! Wishing you and your family a joyful day together.", "2019-04-19T17:04:36.000Z": "ND's abundant natural resources have instilled a culture of conservation and a love for hunting & fishing. Terry Steinwand of the ND Game & Fish Dept. joins us to discuss managing these resources and working alongside our hunters & anglers. Listen here: https:// governor.nd.gov/media-center/w ork-worth-doing-gov-doug-burgum ", "2019-04-18T19:58:07.000Z": "Congratulations! Thank you for your continued service to North Dakota and the United States! Quote Tweet Drew H. Wrigley @DrewWrigley https:// justice.gov/usao-nd/pr/dre w-h-wrigley-sworn-united-states-attorney ", "2019-04-18T14:48:44.000Z": "Thrilled to sign SB 2124, a breakthrough bill that redesigns county social services to improve quality of services and speed of delivery while providing $172 million in property tax relief & maintaining all local access points. Learn more: Burgum signs legislation to improve social services delivery and outcomes, provide property tax... Gov. Doug Burgum has signed breakthrough legislation that redesigns county social services in North Dakota to improve the quality of services, increase the speed of delivery and reduce costs while... governor.nd.gov", "2019-04-17T13:57:00.000Z": "There are over 150 boards and commissions in ND working to empower people, improve lives and inspire success. Your help is essential for informed and responsive governance. Are you or someone you know interested in serving? Click here to learn more: https:// governor.nd.gov/boards/", "2019-04-15T22:58:27.000Z": "Today, ND became the newest state to celebrate Patriots' Day. Celebrated on the third Monday of April, Patriots' Day commemorates the start of the Revolutionary War. Thanks to the Century High School Patriot Band for performing! Read the proclamation here: https:// governor.nd.gov/sites/governor /files/documents/proclamations/Patriots%20Day%202019.pdf ", "2019-04-15T18:37:00.000Z": "ND has a strong culture of giving, and that extends to organ donors and their families. More than 380,000 adults in ND are registered as organ, tissue, and eye donors - one of the highest rates in the nation. Thanks to the families of donors for joining us to honor their gift.", "2019-04-14T19:53:10.000Z": "Had an eggs-cellent time at today's Easter Egg Hunt at the Capitol hosted by the Optimist Club of Bismarck! With 12,000 eggs snatched up in 20 minutes, no-bunny is faster than this group of kids. Thanks to the parents, kids and organizers for a great event!", "2019-04-12T22:09:00.000Z": "Thank you, Premier Pallister, for your continued partnership on addressing flooding, water management and other issues we share as neighbors. Quote Tweet Brian Pallister @BrianPallister I spoke with Governor Doug Burgum yesterday about the current state of spring flooding in the region, including in the Red River, Pembina River and Souris River watersheds, which we share with North Dakota. Show this thread", "2019-04-12T19:47:48.000Z": "Good discussion with officials from Williston Public School District #1 and Williams County School District #8 on challenges related to enrollment growth and opportunities for greater collaboration to address the issue for the benefit of students, families and the communities.", "2019-04-12T17:35:13.000Z": "By signing SB 2110, ND becomes the first state to authorize a central approach to cybersecurity across all of state government, including state, local, K-12 and higher education. Read more about how this reflects the growing importance of cybersecurity: Burgum signs legislation creating unified cybersecurity approach for North Dakota Gov. Doug Burgum signed Senate Bill 2110, a milestone that makes North Dakota the first state to authorize a central, shared service approach to cybersecurity strategy across all aspects of state... governor.nd.gov", "2019-04-12T00:38:19.000Z": "Grateful for action by ... @realDonaldTrump  to streamline permitting of essential energy infrastructure and ensure market access, allowing export states like ND to support U.S. energy dominance while protecting our clean air, water and land. Executive Order on Promoting Energy Infrastructure and Economic Growth | The White House By the authority vested in me as President by the Constitution and the laws of the United States of America, it is hereby ordered as follows: Section 1.  P whitehouse.gov", "2019-04-11T21:43:26.000Z": "In North Dakota, the vast majority of people in our prisons and jails will return to their communities. Ensuring a successful transition is why #ReentryMatters . Read more from @CSGJC to find out what reentry means to me: https:// csgjusticecenter.org/nrrc/posts/sec ond-chance-month-qa-north-dakota-governor-doug-burgum/ ", "2019-04-09T19:27:06.000Z": "When we address children's issues, we're not just developing leaders for tomorrow, we are empowering our youth with the resources they need to succeed today. I was excited to sign this bill providing a greater focus on child welfare and juvenile justice. Gov. Burgum signs bill for children's cabinet, commission on juvenile justice Gov. Doug Burgum on Monday signed a bill to create a \"children's cabinet\" and six-year commission on juvenile justice. bismarcktribune.com", "2019-04-08T20:18:58.000Z": "There are more jobs available in the U.S. than people seeking jobs, which means North Dakota's greatest barrier to economic growth is a workforce shortage. Listen to the latest episode of Work Worth Doing to learn how we're addressing this challenge. http:// bit.ly/WWDPod", "2019-04-05T15:36:19.000Z": "Read more on today's latest news here: National Guard resources deployed to aid flood fights; Emergency Commission approves funding The North Dakota National Guard and North Dakota Department of Emergency Services (DES) are deploying resources to Cass County and the city of LaMoure to assist in flood fighting efforts. governor.nd.gov", "2019-04-05T15:36:18.000Z": "Visit @NDResponse and http:// ndresponse.gov for more information about flooding in ND, including county, city and tribal flood declarations, flooding preparedness and ways to assist residents in McKenzie County who have been displaced and had property damaged by flooding. NDResponse.gov ndresponse.gov", "2019-04-05T15:36:17.000Z": "The @NDNationalGuard and @nddes are deploying resources to Cass County and the city of LaMoure to assist in flood fighting efforts. While melt conditions have been ideal so far, significant risk remains for ice jams, snowmelt and localized thunderstorms to cause major flooding.", "2019-04-04T23:04:38.000Z": "As communities across the state respond to flooding and prepare for more to come, it was great to meet with business and civic leaders from the Red River Valley to discuss steps we can take to protect against flooding. For the latest conditions, go to http:// NDResponse.gov .", "2019-04-02T21:27:49.000Z": "Stay up to date on spring flooding in North Dakota by following @NDResponse . Providing quality services requires a whole-of-government approach, and our state agencies are working together to address the needs of our citizens. Quote Tweet NDResponse @NDResponse The #UnifiedCommand (NDDES Dir., NDDES Homeland Security Dir. and State Eng./Sec. of ND Water Commission) monitors flood conditions in order to ensure timely support to local and tribal governments. The entire command staff meets weekly to evaluate needs. #NDflood19  #NDResponse", "2019-04-01T22:41:03.000Z": "Read more: https:// governor.nd.gov/news/updated-g overnor-first-lady-participate-white-house-meetings-criminal-justice-and-prison-reform ", "2019-04-01T22:41:02.000Z": "Grateful to participate in White House meetings today on criminal justice and prison reform and a celebration of the First Step Act, which @POTUS signed into law last year. ND is being recognized as a leader in justice reform thanks to efforts by all branches of state government.", "2019-04-01T18:26:19.000Z": "Thanks to CDR Robinson, MCPO Voland and the entire crew of the USS North Dakota SSN 784 for the tour and for protecting our freedoms!", "2019-03-30T20:45:34.000Z": "The award is named in honor of Master Sgt. Woodrow \"Woody\" Keeble, a Medal of Honor recipient and one of the most decorated soldiers to ever serve in the NDNG. Read more about Master Sgt. Keeble here: https:// governor.nd.gov/media-center/t heodore-roosevelt-rough-rider-award/master-sergeant-woodrow-wilson-keeble ", "2019-03-30T20:45:32.000Z": "Congratulations to the first-ever recipients of the Woodrow Wilson Keeble \"Je Suis Pret\" (I Am Ready) Award! It was an honor to recognize these members of the @NDNationalGuard for their courage, fortitude and determination-both in the NDNG and as citizens in our communities.", "2019-03-29T21:00:12.000Z": "Vietnam War veterans served our country with courage & honor and deserve our undying gratitude. On this 10th anniversary of Vietnam Veterans Day in ND, we honor the 15,000+ North Dakotans who served in Vietnam including 198 who made the ultimate sacrifice. https:// governor.nd.gov/news/burgum-st atement-vietnam-veterans-day ", "2019-03-28T18:55:51.000Z": "Replying to @inforum Who's the tallest politician? Take it from a 5'10\" point guard, @jon_godfread_ND is a slam dunk.", "2019-03-27T21:37:55.000Z": "With a high potential for significant spring floods, like what we saw on the Yellowstone River today, local response capabilities could be overwhelmed. As state agencies continue coordinating resources, I've issued a statewide flood emergency. Read more: https:// governor.nd.gov/news/burgum-de clares-statewide-emergency-preparation-spring-flooding-tours-flood-affected-area ", "2019-03-27T15:10:13.000Z": "Heartbreaking stories this morning from McKenzie County residents displaced from their homes due to ice jam flooding on the Yellowstone River. More than 50 homes flooded, 110 residents displaced. Grateful for their courage & the community support as we ramp up our flood response!", "2019-03-27T01:34:19.000Z": "Mark your calendars! For the third year, hundreds of people will join us to celebrate the hope that can be found in recovery. See you there! Quote Tweet First Lady Kathryn Burgum @FirstLadyND Governor @DougBurgum and I invite you to save the date for our third Recovery Reinvented on November 12th in Bismarck, ND! #RecoveryReinvented", "2019-03-25T21:11:25.000Z": "Check out this recap of last week's events! http:// spark.adobe.com/page/AgUTdRg7f BD1b/  Subscribe to our weekly newsletter to keep up with the latest news: http:// apps.nd.gov/itd/listserv/m aint.htm?reqid=GOV&request=AgencyListServEnterEmail ", "2019-03-23T19:08:29.000Z": "Just in time for warmer temperatures, Melissa Baker of @NDparkrec joined me on Work Worth Doing to talk about the beautiful parks in our state! Listen to the latest episode here: https:// governor.nd.gov/media-center/w ork-worth-doing-gov-doug-burgum ", "2019-03-22T17:30:50.000Z": "One of my greatest honors is serving as the commander-in-chief of the @NDNationalGuard . The men and women of the Guard are incredible examples of leadership in a complex environment. Thank you for inviting me to speak at today's Joint Leaders Conference.", "2019-03-21T13:27:52.000Z": "We're excited to welcome @SecretaryAcosta to North Dakota today to discuss a variety of issues and opportunities related to workforce. We need embrace new ways to attract and retain a 21st century workforce that can fill the more than 30,000 open jobs in our state.", "2019-03-21T00:47:45.000Z": "Bring on the Blue Devils!  #GoBison Quote Tweet NDSU Basketball @NDSUmbb One more chance to Dance.", "2019-03-20T18:45:56.000Z": "Honored to be joined by legislators for the signing of HB 1066, the bipartisan infrastructure funding legislation. This will help cities, counties and townships across North Dakota make smart investments in their essential infrastructure projects.", "2019-03-19T19:15:50.000Z": "Always grateful for the opportunity to thank the USS North Dakota's officers and crew for their outstanding service and critical mission, maintaining peace through strength. They're a source of immense pride for the people of North Dakota! Quote Tweet Lt. Gov. Brent Sanford @BrentSanfordND USS North Dakota Commander Mark Robinson (right), Master Chief Petty Officer Kellen Voland (left) & their entire crew do an excellent job leading the sophisticated attack submarine and protecting our nation. @DougBurgum and I thank them for their service and for making ND proud!", "2019-03-19T19:09:21.000Z": "Joined @SenJohnHoeven for an update on the @FMDiversion . This project continues to gain momentum, recognizing the significant value it will provide ND & MN in terms of protecting human life, the F-M area's thriving economy and billions of dollars in property value.", "2019-03-19T15:10:14.000Z": "Thanks to all of North Dakota's farmers, ranchers and ag producers! Agriculture has a long history in our state and continues to be a key segment of the economy, providing healthy, wholesome food to families around the world. Read the proclamation here: http:// governor.nd.gov/sites/governor /files/documents/proclamations/ND%20Agriculture.pdf ", "2019-03-15T20:59:33.000Z": "We're excited to announce the 17 recipients for our first YES Challenge! These young people and their initiatives represent the unique challenges that communities across ND face surrounding addiction and mental illness. \n\nLearn more about the winners here: https:// governor.nd.gov/news/governor- first-lady-announce-winners-first-ever-youth-ending-stigma-challenge ", "2019-03-14T00:48:38.000Z": "Thanks to the @NatlGovsAssoc for inviting me on their podcast to discuss how North Dakota is harnessing technology to improve the lives of our citizens. Listen here: https:// itunes.apple.com/us/podcast/we- the-states/id1454714757?mt=2 ", "2019-03-13T03:00:03.000Z": "The Bison are dancing again! #MarchMadness Quote Tweet NDSU Basketball @NDSUmbb Next year, they said.\nNot yet.\nThey're too young.\nThey've got too far to go.\n\nWe're here NOW. And we're dancing.", "2019-03-11T15:44:21.000Z": "Today's revised revenue forecast bodes well for the state's ability to achieve a structurally balanced budget, fund priorities and invest in legacy projects for the future. My statement below. Read more about the forecast here: https:// governor.nd.gov/news/burgum-re vised-revenue-forecast-has-good-news-budget-highlights-north-dakota%E2%80%99s-strong-economy ", "2019-03-11T00:33:09.000Z": "Grateful for the First Lady's efforts to share her advocacy at this national forum, raising awareness that prevention is essential, treatment works, and recovery is attainable and sustainable. Quote Tweet First Lady Kathryn Burgum @FirstLadyND Thank you @DelrayTaskForce and @FloridaAtlantic for hosting @SUDTalksUS and shining a beacon of hope for those seeking the path to recovery! #SUDTalks2019 Watch all the SUD talks here: http:// bit.ly/2TsyLCP", "2019-03-10T00:13:59.000Z": "Congratulations to Payton Otterdahl on a truly impressive feat! Way to make history, @PayOtt - first individual D-1 national champ for NDSU in any sport! King in the North: Otterdahl Sweeps Throwing Events at NCAA Indoor Championships - NDSU Payton Otterdahl won the weight throw at the NCAA Indoor Track & Field Championships, throwing a career-best 79-01.25 (24.11m) on his final attempt to extend his NDSU school record and claim his... gobison.com", "2019-03-09T16:57:02.000Z": "This Monday is the deadline for school, community and church bands and choirs to apply to serve as the Governor's Official State Band/Orchestra Program and Choral Program for 2019. Interested groups should apply at the following link by March 11: https:// governor.nd.gov/governor%E2%80 %99s-chorus-and-bandorchestra-program-application ", "2019-03-08T19:12:00.000Z": "For the latest episode of Work Worth Doing, we hit the road with Craig Sperling, a snow plow operator with the North Dakota Department of Transportation. Listen to the full podcast here: http:// governor.nd.gov/media-center/w ork-worth-doing-gov-doug-burgum ", "2019-03-08T16:59:48.000Z": "Thank you to all who joined us for the 27th Annual Governor's Prayer Breakfast, coming together to celebrate our common humanity and the power of prayer to move us forward in love, understanding and abundant daily gratitude.", "2019-03-07T17:49:56.000Z": "Read more here: Burgum congratulates NDSU at launch of $50M Challey Institute for Global Innovation and Growth Gov. Burgum joined North Dakota State University officials to announce a transformative, interdisciplinary research institute focused on global innovation, trade and economic growth and made possible... governor.nd.gov", "2019-03-07T17:49:54.000Z": "Congratulations to @NDSU on the announcement of the new $50M Challey Institute for Global Innovation and Growth! With an export-driven economy led by ag and energy, our state stands to benefit greatly from the solutions generated at this new institute of study.", "2019-03-06T21:43:31.000Z": "Signed! The first signed bill of the 2019 legislative session (HB 1183) will remove mandatory minimum sentencing requirements for certain drug-related offenses. The House passed the bill by a vote of 81-9 and the Senate passed it 44-1. Read more here: https:// governor.nd.gov/news/burgum-si gns-first-bill-2019-legislative-session-removing-mandatory-minimum-sentences-certain ", "2019-03-05T23:38:08.000Z": "Have you heard the latest episode of Work Worth Doing? @rilescat , director of @ndgovitd , sat down with me to talk about cyber security, technology in schools and working as one across state government. Listen now! Work Worth Doing Listen to the latest episode of Gov. Burgum's podcast. governor.nd.gov", "2019-03-05T18:01:50.000Z": "ND is an energy powerhouse, and these innovators are leading the way! @BrentSanfordND & I were grateful to welcome everyone to the ND Petroleum Council's \"Energy Day at the Capitol,\" and to introduce MHA Chairman Mark Fox after last week's signing of an oil tax revenue compact.", "2019-03-04T23:11:18.000Z": "Thank you Kathryn for continuing to engage communities in this important conversation! Quote Tweet First Lady Kathryn Burgum @FirstLadyND Join me and register for the @FMWFChamber 's Eggs & Issues this Tuesday to engage in a dialogue about how the business community can be a leader to eliminate stigma and empower a supportive culture for recovery! #FMWFEggs Register here: https:// bit.ly/2VsbMV4", "2019-03-04T18:03:05.000Z": "Congratulations to the 7-time #FCS national champs @NDSUfootball on today's historic @WhiteHouse visit! Thanks @realDonaldTrump for the invitation and @SenJohnHoeven for lining it up and representing with @SenKevinCramer , @RepArmstrongND and @FirstLadyND . Go Bison! #NDSUinDC Quote Tweet NDSU Football @NDSUfootball Easton Stick presented the #45 jersey to President Trump in the State Dining Room followed by a quick lunch. Next stop, the Oval Office! #NDSUinDC", "2019-03-02T02:22:14.000Z": "Thanks for having me on, Dennis, to discuss our state's exciting progress and potential! Quote Tweet AM 1090 The Flag KTGO @theflagktgo You won't want to miss Dennis Lindahl's interview with @DougBurgum On today's program they discussed his successes as governor, workforce solutions, America's surging energy dominance, and much more...\n\nListen here: https:// bit.ly/2EjP3n3", "2019-02-28T22:58:57.000Z": "Here's the full pic, and check out video on our FB page at https:// facebook.com/GovernorDougBu rgum/ ", "2019-02-28T22:32:52.000Z": "Honored to join MHA Chairman Mark Fox in signing a historic oil tax compact built on trust & mutual prosperity. Thx to tribal & legislative leaders, @BrentSanfordND , Tax Commish Rauschenberger & Indian Affairs Dir. Scott Davis for driving this forward! https:// governor.nd.gov/news/governor- mha-nation-chairman-sign-compact-sharing-oil-tax-revenue ", "2019-02-26T22:43:20.000Z": "Remembering my mother, Katherine Kilbourne Burgum, on the 104th anniversary of her birth. A true North Dakota patriot, trailblazer and inspiration to many.", "2019-02-25T23:22:26.000Z": "Agriculture is a $10 billion sector in #NorthDakota . I was glad to welcome Gov. @DougBurgum to DC today to discuss how we can grow our ag industry and support farmers and ranchers.", "2019-02-24T23:19:54.000Z": "#WeTheStates are launching a podcast series called, yes, We The States from the Winter Meeting, featuring discussions on trade, energy, innovation and more. Here, @DougBurgum sits down for a conversation on how forward-thinking technology is making a difference in North Dakota.", "2019-02-24T19:35:21.000Z": "North Dakota, like any other state, can only reach its fullest potential by investing in smart infrastructure to make our cities healthier and more vibrant. At @NatlGovsAssoc , governors came together to discuss how technology can create a more responsive government. #WeTheStates", "2019-02-24T13:04:23.000Z": "Thanks to @EPAAWheeler and @westgov for hosting a meeting this morning with @DOIDepSec, @SecretaryAcosta and more than a dozen governors to discuss the issues affecting states in the western U.S.", "2019-02-23T21:16:36.000Z": "Glad to have the opportunity to meet with several Canadian premiers, as well as Ambassador MacNaughton. As North Dakota's largest trading partner, our relationship with Canada is an essential component of our economy. #WeTheStates", "2019-02-23T19:26:05.000Z": "Joined governors from across the nation to talk about how states can put forth positive and meaningful solutions to address complex problems @NatlGovsAssoc  #WeTheStates  @DougBurgum  @GovTimWalz  @GovMLG", "2019-02-22T17:37:41.000Z": "Read more here: https:// governor.nd.gov/news/burgum-at tend-national-governors-association%E2%80%99s-winter-meeting ", "2019-02-22T17:37:22.000Z": "This weekend, we'll join nearly all of the nation's governors plus more than 1,500 business, nonprofit and government leaders and others from around the world at the National Governors Association's 111th annual Winter Meeting in Washington, D.C. Follow along at #WeTheStates .", "2019-02-19T23:19:51.000Z": "Thanks to the @ndscswildcats team and all of the groups who came to the Capitol for Career and Technical Education Day to share about the great learning opportunities available to our students!", "2019-02-17T21:11:48.000Z": "Our state parks are great places to explore year-round! As part of the \"12 Months - 12 Hikes\" challenge, more than 180 hikers hit the trail at @FortLincoln today. Thanks to the @NDParkRec team that makes events like this possible! Plan your next outing at http:// parkrec.nd.gov", "2019-02-15T20:03:51.000Z": ". @BobcatCompany is North Dakota's largest manufacturer and a globally-recognized brand. Grateful that Scott Park, President and CEO of Doosan Bobcat Inc., came to Bismarck today to discuss his company's significant investment and tremendous impact in our state.", "2019-02-14T16:43:53.000Z": "Today is #GivingHeartsDay ! More than 450 charities across North Dakota and northwest Minnesota are taking part in today's event. Make your donation now at http:// givingheartsday.org !", "2019-02-13T20:33:19.000Z": "Have you heard the latest episode of Work Worth Doing? Theodore Roosevelt V talks about his great-great-grandfather's time in North Dakota and the proposed Theodore Roosevelt Presidential Library and Museum. Listen here: https:// governor.nd.gov/media-center/w ork-worth-doing-gov-doug-burgum ", "2019-02-13T16:53:56.000Z": "Students and teachers from all over North Dakota are here for the Education Technology Showcase to demonstrate the technology they use in their classrooms! Great to see the ingenuity of these young minds and future leaders.", "2019-02-12T23:47:28.000Z": "BREAKING NEWS: The President has nominated Drew Wrigley to be U.S. Attorney for #NorthDakota . He's served in that capacity before & brings a great track record & strong experience. Now we'll move to get him confirmed before the full Senate ASAP.", "2019-02-12T01:49:15.000Z": "Our young people possess the ingenuity and passion to drive meaningful change. That's why we're asking for their help with the Youth Ending Stigma Challenge. Visit http:// RecoveryReinvented.com by Friday to join the #YESChallenge and help end the stigma of mental illness and addiction. Quote Tweet First Lady Kathryn Burgum @FirstLadyND Stigma puts up walls to conversation and healing. Which is why ND students in grades 7-12 can receive up to $1,000 to eliminate stigma surrounding addiction and mental illness in their communities. Visit http:// recoveryreinvented.com and share your #YESChallenge solution by Friday!", "2019-02-08T18:28:26.000Z": "The second episode of Work Worth Doing is now available! Ted Roosevelt V joins us to discuss the legacy of of his great-great-grandfather in North Dakota and the future of the @TRPresLibrary . Find us at the link below or on your favorite podcast app! https:// governor.nd.gov/media-center/w ork-worth-doing-gov-doug-burgum ", "2019-02-07T21:24:29.000Z": "Grateful for the dedicated team at @NDparkrec for being at the Capitol today to highlight our beautiful parks! Check out their new website at http:// parkrec.nd.gov to explore what North Dakota has to offer.", "2019-02-06T19:57:21.000Z": "Great visiting with DECA students this morning at Mandan High School. It's clear that these young entrepreneurs have a bright future in mind for North Dakota!", "2019-02-06T04:20:58.000Z": "My statement on tonight's #SOTU .", "2019-02-05T23:49:12.000Z": "Read more here: Governor, legislative leaders, MHA chairman highlight support for oil tax revenue sharing bill Gov. Doug Burgum joined MHA Nation Chairman Mark Fox, legislative leaders and Tax Commissioner Ryan Rauschenberger for a press conference to highlight the bipartisan support and benefits of a bill... governor.nd.gov", "2019-02-05T23:46:53.000Z": "Great to see the bipartisan backing and tribal support for SB 2312! A stable tax and regulatory environment will give the MHA Nation, state of North Dakota and oil & gas industry the certainty needed to keep the Bakken competitive and ensure tax revenue is shared appropriately.", "2019-02-05T17:35:22.000Z": "Join us in a few minutes on Facebook for our press conference with legislative leaders and MHA Nation Chairman Mark Fox on SB2312, an important bill to change how oil tax revenues are shared! https:// facebook.com/GovernorDougBu rgum/ ", "2019-02-05T01:07:54.000Z": ". @FirstLadyND and I joined recovery advocates, legislative leaders, peer support specialists, individuals with lived experience, behavioral health care providers and other stakeholders to celebrate the first-ever Recovery Day at the Capitol. Read more: https:// governor.nd.gov/news/governor- first-lady-join-legislators-recovery-advocates-and-service-providers-highlight-first ", "2019-02-04T18:34:35.000Z": "... @FirstLadyND  & I are deeply grateful for all attending the 1st-ever Recovery Day at the Capitol!  Fostering a culture that promotes recovery takes all of us, and together we can eliminate the stigma surrounding the disease of addiction. #recoverydaynd  #recoveryreinvented", "2019-02-02T14:29:41.000Z": "Thanks @govtechnews for recognizing our focus on boosting government effectiveness through technology. ND citizens deserve modern services & strong cybersecurity, and with the proposals in our exec budget, we can take our state to the next level! State of the States 2019: Getting America Connected The nation's governors are laying out policy priorities for the coming year - some for the first time. Many are focused on technology-driven economic and workforce development as paths to prosperity. govtech.com", "2019-02-01T00:55:06.000Z": "Congratulations to Cmdr. Mark Robinson and the crew of the USS North Dakota on today's return home from a successful deployment! We are grateful for your service to the nation and the honor with which you represent our state's namesake ship.", "2019-01-30T20:56:45.000Z": "ICYMI, we launched a new podcast! \"Work Worth Doing\" is now available on Apple Podcasts, with more listening platforms to be added soon. Listen here: https:// itunes.apple.com/us/podcast/wor k-worth-doing-with-gov-doug-burgum/id1450882084 ", "2019-01-29T23:15:42.000Z": "Thanks to CIO @rilescat , the @ndgovitd team & our partners from @PaloAltoNtwks for today's hacking demonstration (which continues tomorrow). We're committed to protecting our state's financial assets and citizens' data, with $16.4M in our budget proposal to enhance cybersecurity.", "2019-01-27T18:48:30.000Z": "We're launching a podcast! Welcome to 'Work Worth Doing,' where we tell the stories of people working to serve North Dakota.\n\nOur first episode features Leann Bertsch, director of our Department of Corrections and Rehabilitation. Listen here: Work Worth Doing Listen to the latest episode of Gov. Burgum's podcast. governor.nd.gov", "2019-01-24T22:48:58.000Z": "These fourth-grade students were full of great questions! Thanks to @BismarckSchools and the team at Jeanette Myhre Elementary School for hosting us.", "2019-01-24T02:30:34.000Z": "Fun to see so many dedicated people in the Capitol today to highlight the work being done by our state's nurses, students and medical professionals. Thanks for sharing your talents!", "2019-01-23T05:07:03.000Z": "Questions about this project? Learn more in the infographic below.", "2019-01-23T05:07:01.000Z": "Filled with gratitude to host Melani & Rob Walton and Theodore Roosevelt V today as they shared eloquent words of support with legislators for the TR Presidential Library & Museum. This is the place. Now is the time.", "2019-01-22T22:18:32.000Z": ". @FirstLadyND is hosting our first-ever Recovery Day at the Capitol on Feb. 4! Join us at #RecoveryDayND and find out more at this link: https:// governor.nd.gov/events/governo r-first-lady-extend-invitation-first-ever-recovery-day-capitol  Quote Tweet First Lady Kathryn Burgum @FirstLadyND Join Gov. @DougBurgum and me on Feb. 4 to celebrate Recovery Day at the Capitol!\n\nConnect with provider booths from 10:30am to 3:00pm and attend a special program from 12:15 to 12:45pm. We look forward to seeing everyone in Memorial Hall at the State Capitol! #RecoveryDayND", "2019-01-21T16:27:51.000Z": "Dr. Martin Luther King Jr.'s vision of equality, peace and justice for all continues to be an inspiration for Americans and people throughout the world. Today we honor the life and legacy of this incredible leader. #MLKDay", "2019-01-21T06:17:11.000Z": "As additional footage surfaces, it's become apparent that this situation was more complex than originally reported and was deserving of more careful evaluation. Everyone has the right to demonstrate peacefully.", "2019-01-21T01:26:36.000Z": "Great to see residents and small business owners of Medora reaffirming their support for the proposed TR Presidential Library and Museum. This is a great opportunity for North Dakota. Medora residents weigh governor's Theodore Roosevelt Presidential Library proposal MEDORA - Kitty corner from Demores Elementary School in Medora, a life-size statue of President Theodore Roosevelt stares across the road. bismarcktribune.com", "2019-01-20T22:15:17.000Z": "Ag producers are key drivers of ND's economy. That's why our budget proposal invests in agricultural research and extension services. Thanks to the help of @NDagriculture Commissioner Goehring, we are continuing to support our state's agriculture industry. Great Returns and a Great Program One of our biggest industries in the State is Ag, Keith Peltier Chair of the State Board of Agricultural Research and Education is here to tell how important it is to fund research and much more.... valleynewslive.com", "2019-01-20T04:50:25.000Z": "This is unacceptable. Nathan Phillips is an Omaha elder and Vietnam veteran who deserves our respect and gratitude for serving his country. We must set a better example for our children and teach them to see the dignity in all people. Kentucky Catholic school to investigate taunting of Native Americans \"Who's bringing them up?\" Native American elder Nathan Phillips said of students from the Diocese of Covington, Kentucky. nbcnews.com", "2019-01-19T18:13:20.000Z": "Grateful to join leaders and members of North Dakota's five tribal nations for this week's historic ceremony celebrating and honoring their flags, now on display in the Capitol for the first time as announced in my State of the State address on Jan. 3.", "2019-01-17T20:34:03.000Z": "Today we joined the five tribal nations that share geography with ND for a historic ceremony honoring their flags, now on display in Memorial Hall. With a small, symbolic step, we can take a big step forward in terms of understanding and progress as people who share this Earth.", "2019-01-16T21:25:05.000Z": "Glad to have the opportunity to speak to the @NDAREC annual meeting. Rural electric cooperatives play a vital role in powering our state and way of life while enabling North Dakota to compete in a global economy.", "2019-01-15T21:31:38.000Z": "Excited about the announcement from @SecElaineChao ​ that ND's Northern Plains UAS Test Site will be partnering with the FAA on UAS Traffic Management Systems. Partnerships like this, combined with new state investments, will help us remain the nation's proving ground for drones.", "2019-01-13T22:35:05.000Z": "Want to receive our weekly newsletter straight to your inbox? Sign up here: https:// apps.nd.gov/itd/listserv/m aint.htm?reqid=GOV&request=AgencyListServEnterEmail  Check out our latest newsletter: https:// spark.adobe.com/page/XbDkogXzU AfNk/ ", "2019-01-12T00:08:59.000Z": "North Dakota's young people are smart, compassionate and full of new ideas. That's why @FirstLadyND is asking for submissions to the YES Challenge. Do you know a student who would be a great fit for this project? Find out more at http:// recoveryreinvented.com/get-involved/ Quote Tweet First Lady Kathryn Burgum @FirstLadyND Gov. @DougBurgum and I are calling on ND youth to participate in the YES Challenge! Winning student committees can receive up to $1K to eliminate the stigma surrounding addiction and mental health conditions!\n\nApp deadline is Feb. 15. Learn more & apply: http:// recoveryreinvented.com/get-involved/", "2019-01-10T21:30:09.000Z": "We're glad to have the support of Theodore Roosevelt V to create the Theodore Roosevelt Presidential Library and Museum right here in ND. This is a unique opportunity to build a state-of-the-art facility in honor of one of the most dynamic and influential presidents in history.", "2019-01-10T17:42:12.000Z": "Grateful for opportunity to testify about importance of @FMDiversion before the Senate Approps Cmte & highlight the joint Task Force formed w/ @GovMarkDayton to keep this cost-effective project moving, now with a @mndnr permit. Now is the time to be proactive & support this plan.", "2019-01-06T01:57:27.000Z": "A big celebration for a big win. Congratulations to the National Champion Bison!\n\nPhoto courtesy of @Threefold / contact: joel@threefold.tv", "2019-01-05T20:17:36.000Z": "Congratulations to @NDSUfootball on an amazing 7th FCS National Championship in 8 years! Capping an undefeated season with a hard-fought 4th quarter, #BisonNation showed up to win in Frisco today. Thanks to @CoachKli for his years of tremendous leadership!", "2019-01-05T02:49:58.000Z": "As @NDSUfootball takes on @EWUFootball in the FCS championship, @GovInslee has agreed to a friendly wager: a donation of locally-made goods to a food bank in the winning team's state. ND & WA are both agricultural powerhouses, but only one winner can harvest the trophy. #GoBison !", "2019-01-04T23:10:21.000Z": "We are deeply saddened by the loss of Dale Ihry, a strong voice for corn growers and a true force in North Dakota agriculture for many decades. Kathryn and I extend our thoughts and prayers to his family and friends. The farmer's lens: ND farmers lose big ally | INFORUM Corn executive Dale Ihry dies at age 58 from autoimmune disease inforum.com", "2019-01-04T19:21:33.000Z": "We were honored to announce in yesterday's #NDSOTS19 that we will display the flags of the 5 tribal nations with whom we share geography. These flags will serve as a constant reminder of our strong relationships and mutual respect as we work together to serve all North Dakotans.", "2019-01-03T20:22:48.000Z": "As we stand at the cusp of this new era, let us seize this opportunity for North Dakota. Now is the time to dream bold dreams, to build those dreams and to create lasting legacies. #NDSOTS19  #ndpol", "2019-01-03T20:19:27.000Z": "To honor the life and legacy of President Theodore Roosevelt while diversifying our economy, we propose investing $50M of Legacy Fund earnings in the TR Presidential Library and Museum, leveraged with a 2-to-1 private match. #NDSOTS19  #ndpol", "2019-01-03T20:16:31.000Z": "Our state leads in UAS technologies. Let's keep it that way. #NDSOTS19  #ndpol", "2019-01-03T20:15:30.000Z": "North Dakota must continue building for our future. We propose an investment of $1.5B for roads, essential water projects, airport infrastructure and technology investments. #NDSOTS19  #ndpol", "2019-01-03T20:13:59.000Z": "North Dakota's schools can be the best in the world if we empower educators to lead the transformation of their classrooms and cut the red tape that stands in their way. #NDSOTS19  #ndpol", "2019-01-03T20:12:13.000Z": "North Dakota has the best people in the world, and we invest in our people because we believe the role of government is to empower people, improve lives and inspire success. #NDSOTS19  #ndpol", "2019-01-03T20:08:27.000Z": "Take a look back at the budget address here: https:// twitter.com/i/moments/1070 473629002018818   #NDSOTS19  #ndpol Gov. Doug Burgum @DougBurgum 2018 Budget Address Today we delivered the 2019-21 Executive Budget Recommendation in an address to the 66th Legislative Assembly. Check out the highlights.", "2019-01-03T20:05:47.000Z": "ND had to become stronger and more nimble in the face of recent economic and budget downturns. Now is the time to increase transparency and build our reserves so we are prepared to meet the next challenge head-on. #NDSOTS19  #ndpol", "2019-01-03T20:02:20.000Z": "Workforce challenges remain the number one gating factor for economic growth. We propose new and expanded solutions. #NDSOTS19  #ndpol", "2019-01-03T19:55:41.000Z": "#NDSOTS19  #ndpol", "2019-01-03T19:52:23.000Z": "Thanks to the unbreakable spirit of our citizens, the hard work of our state agencies and the foresight of our elected leaders to plan for a rainy day, our state is stronger than ever. #NDSOTS19  #ndpol", "2019-01-03T19:45:43.000Z": "We continue to support programs like Free Through Recovery. Jyssica Noble, an FTR participant who sat down for a @CSGJC discussion with @FirstLadyND and myself, had the courage to share her story. Watch here: http:// bit.ly/2QkDqAw  #NDSOTS19  #ndpol", "2019-01-03T19:40:42.000Z": "Since taking office two years ago, we've made substantial progress on the five strategic priorities outlined in the State of the State address in 2017. #NDSOTS19  #ndpol", "2019-01-03T19:37:18.000Z": "Agriculture is the backbone of our economy, and our ag producers are ND's original tech innovators. They can compete with anyone if given a level playing field. #NDSOTS19  #ndpol", "2019-01-03T19:34:32.000Z": "Our administration believes that innovation, not regulation, is the best way to solve complex challenges in a digital age. #NDSOTS19  #ndpol", "2019-01-03T19:33:55.000Z": "Ranking in the top two states for clean air and water, we're proving that energy production and environmental stewardship aren't mutually exclusive. #NDSOTS19  #ndpol", "2019-01-03T19:33:16.000Z": "Once again, ND is on the grow. Oil and gas producers continue to shatter production records while making billions of dollars in new investments in our state. #NDSOTS19  #ndpol", "2019-01-03T19:32:01.000Z": "Life is good in North Dakota. Our quality of life is second to none. http:// bit.ly/2Qg2JUe  #NDSOTS19  #ndpol", "2019-01-03T19:31:13.000Z": "#NDSOTS19  #ndpol", "2019-01-03T19:30:08.000Z": "We have so much to be grateful for in North Dakota. Led by our risk-takers and innovators, our state is in a unique position on a local, national and global scale. #NDSOTS19  #ndpol", "2019-01-03T19:24:10.000Z": "Thank you for joining us for the 2019 State of the State address to a joint session of the 66th Legislative Assembly. Follow along using #NDSOTS19 or watch live at http:// governor.nd.gov  #ndpol Home governor.nd.gov", "2019-01-03T19:23:25.000Z": "Tune in now: Home governor.nd.gov", "2019-01-03T18:42:40.000Z": "Join us for today's State of the State address! The joint session of the 66th Legislative Assembly begins at 1pm CT and the address is expected to start around 1:30pm. Watch live here: WATCH HERE: Burgum to deliver State of the State address to Legislative Assembly on Jan. 3 Gov. Doug Burgum will deliver his 2019 State of the State address to a joint session of the 66th Legislative Assembly on Jan. 3 in the House chamber of the state Capitol, 600 E. Boulevard Ave.,... governor.nd.gov", "2018-12-31T22:59:26.000Z": "Read more, including the final reports, here: Burgum thanks members of K-12, higher education task forces as final reports and recommendations... Gov. Doug Burgum expressed his gratitude for the members of the K-12 Innovative Education Task Force and the Task Force for Higher Education Governance as the two groups submitted their final reports... governor.nd.gov", "2018-12-31T22:59:24.000Z": "Grateful for the members of the K-12 Innovative Education Task Force and the Task Force for Higher Education Governance today as they submitted their final reports. These recommendations will make a difference in developing our state's most precious resource: its young people.", "2018-12-31T16:45:12.000Z": "If you are planning to attend the State of the State address, please know that space is limited and you should arrive before the joint session begins at 1:00pm.", "2018-12-30T20:53:52.000Z": "Mark your calendar! Thursday is the 2019 State of the State address, which will be delivered to the 66th Legislative Assembly in the House chamber of the Capitol. The address is scheduled to start at 1:30pm on Jan. 3 and can be watched live at this link: http:// governor.nd.gov", "2018-12-28T19:49:52.000Z": "We'll pretend not to see that SDSU hat. Thanks for making good on our bet! #GoBison Quote Tweet Kristi Noem @KristiNoem Well I thought @DougBurgum forgot...but yesterday this Bison jersey came in the mail and I keep my promises...but I did take a little freedom with my \"accessories\". Tough loss a few weeks ago to NDSU but I'll always be a Jacks fan! #SDSU  #gojacks", "2018-12-27T19:50:20.000Z": "Today, the MnDNR granted a permit for the F-M Area Diversion, a major milestone in efforts to protect the metro area from catastrophic flooding. Thanks to the Task Force and @GovMarkDayton & DNR Commissioner Landwehr for their partnership and leadership. My full statement below.", "2018-12-25T20:04:11.000Z": "Wishing you all the joys of the season and peace throughout the year. Merry Christmas!", "2018-12-23T19:01:26.000Z": "While this growth affirms ND is on the right track, we still have thousands of jobs to fill, making it important that we invest in workforce development and create healthy, vibrant communities to attract and retain a 21st century workforce.\n\nRead more: Burgum welcomes population growth to all-time high, stresses that workforce challenges remain Gov. Doug Burgum welcomed the latest estimates from the U.S. Census Bureau that show North Dakota's population reached an all-time high of 760,077 residents as of July 1, 2018, an increase of 4,901... governor.nd.gov", "2018-12-23T19:01:25.000Z": "This week, the U.S. Census Bureau showed that ND's population hit an all-time high of 760,077 residents as of July 1, 2018. We're excited to see more people moving here, and for good reason: Our economy is strong, our jobs are abundant and our quality of life is second to none.", "2018-12-20T16:42:51.000Z": ". @FirstLadyND and I recently joined @CSGJC 's #MeetFacetoFace initiative to see how our state can better help people in our criminal justice system who struggle with the disease of addiction.  Watch our conversation with Jyssica to learn more: https:// youtu.be/3WhEkFPvqww", "2018-12-19T16:23:55.000Z": "Grateful to North Dakota's tribal leaders and the hundreds of state, tribal and federal partners taking part in the second Strengthening Government to Government Partnerships and Relationships conference hosted by the ND Indian Affairs Commission.", "2018-12-18T23:12:32.000Z": "These funds will help communities with strategic projects in our cities' Main Street areas that will strengthen our state's economy and help create healthy, vibrant communities that can attract and retain a 21st century workforce. \n\nRead more: https:// governor.nd.gov/news/burgum-an nounces-23m-community-development-funds-support-main-street-projects-public-facilities ", "2018-12-18T23:12:31.000Z": "Today, with the ND Dept. of Commerce, we announced funding for 15 projects totaling $2,331,000 aimed at Main Street development, public facilities and services. The program is funded by federal Community Development Block Grant dollars focusing on long-term community development.", "2018-12-16T19:18:17.000Z": "This week, @USDA announced $600M in loans & grants to deliver broadband service to rural areas that have insufficient internet access. As one of the key factors of today's economy, investing in broadband infrastructure drives prosperity and increased quality of life across ND.", "2018-12-16T00:40:29.000Z": "Congratulations to @NDSUfootball on a big semi-final win over a great team and rival SDSU, and many thanks to Coach Klieman for your incredible leadership!  Bison Nation see you in Frisco! Quote Tweet North Dakota State @NDSU . @NDSUfootball defeats South Dakota State 44-21 and moves on to the FCS National Championship in Frisco, Texas on Saturday, Jan. 5! #FCSPlayoffs", "2018-12-15T00:01:59.000Z": "Montana's @GovernorBullock dropped by @SDGovDaugaard (a USD grad) and First Lady Linda (SDSU grad) to prepare them for tonight's outcome. Can't wait to see Gov.-elect @KristiNoem make good on our bet and don the green and gold!", "2018-12-13T01:10:47.000Z": "Read more: https:// governor.nd.gov/news/burgum-si gns-mou-between-western-governors%E2%80%99-association-and-usda-foster-collaborative-land ", "2018-12-13T01:10:46.000Z": ". @SecretarySonny joined the @WestGov Winter Meeting today to sign an MOU to cooperatively address land management challenges. Working closely with the @forestservice will help us develop more efficient, effective public policy for the benefit of our citizens and the environment.", "2018-12-12T00:09:53.000Z": "Gov. @DougBurgum and I, in partnership with @Recovery_ND and @DakotaMedFdn , are excited to launch the #YESChallenge to enable ND students to eliminate stigma around addiction & mental health conditions!\n\nTo learn more or apply for the challenge, visit http:// recoveryreinvented.com/get-involved/ .", "2018-12-10T18:06:05.000Z": "Last Friday, 5,000+ students from more than 100 schools across the state participated in #HourofCodeND as part of a broader initiative to learn the basics of computer science. Check out this video of students from Jamestown getting involved! Jamestown schools take part in Hour of Coding | Jamestown Sun Third and fourth graders at Lincoln Elementary School on Friday participated in Hour of Code, a worldwide event where students learn about computer science. jamestownsun.com", "2018-12-08T00:58:52.000Z": "Thankful for all who came to celebrate the start of the holiday season by lighting the Christmas Tree at the Capitol. @FirstLadyND invited performers and speakers to remind us all to Dream, Hope and Act. Special thanks to the Simle Middle School Choir for their performance!", "2018-12-06T00:39:57.000Z": "Today we delivered the 2019-21 Executive Budget Recommendation in an address to the 66th Legislative Assembly. Check out the highlights: \"2018 Budget Address\" Gov. Doug Burgum @DougBurgum 2018 Budget Address Today we delivered the 2019-21 Executive Budget Recommendation in an address to the 66th Legislative Assembly. Check out the highlights.", "2018-12-05T16:58:53.000Z": "With leadership everywhere, working as one, being citizen-focused and bringing a growth mindset to our work, we can truly make a difference in the lives of those we serve. #NDbudget  #NDpol", "2018-12-05T16:58:27.000Z": "In sum: this budget recommendation invests in our people, modernizes our infrastructure and replenishes our rainy-day fund without raising taxes. #NDbudget  #NDpol", "2018-12-05T16:57:30.000Z": "Our budget uses Legacy Fund earnings to fund large-dollar projects with a statewide or national impact that produce lasting value for our citizens. #NDbudget  #NDpol"}