{"2020-07-29T12:44:05.000Z": "Northwest Ohio!  FREE COVID testing today and tomorrow in Toledo! Quote Tweet Toledo-Lucas County Health Department @ToledoLucasHD Drive-thru testing tomorrow and Thursday. No appointment needed. FREE #Covid19 tests from 9am to 3pm. Details", "2020-07-28T12:12:43.000Z": "Here are the COVID testing sites for this week.... Quote Tweet Ohio Dept of Health @OHdeptofhealth This week's list of pop-up testing sites in Ohio. Find our interactive map with testing sites across the state here: http:// bit.ly/2Xu2N9F  #InThisTogetherOhio", "2020-07-25T12:05:51.000Z": "Thank you @CUJacketsBase , @CoachManes , and @sdenni5 for letting me use your field to tape the @Reds Opening Day (virtual) first pitch! #FeedThePositiveDog", "2020-07-25T00:22:03.000Z": "Thank you, @Reds for giving me the opportunity to throw out the (virtual) first pitch! I'm thrilled that baseball is back! #RedsOpeningDay Quote Tweet Cincinnati Reds @Reds Thanks for getting us started, @GovMikeDeWine !  #RedsOpeningDay   #TakeTheCentral", "2020-07-24T01:28:17.000Z": "Happy 60th Anniversary, Jack and Barbara! Quote Tweet Jack Nicklaus @jacknicklaus Today, Barbara and I celebrate our 60th wedding anniversary! We met our first week of college in 1957 and have been together ever since. Married at 20; 5 kids; 22 grandkids; countless memories. It's been an unbelievable life together. Show this thread", "2020-07-22T12:42:43.000Z": "650 people came out to the free COVID testing site in Rootstown yesterday.  Thank you @PortageCoHealth and @OHNationalGuard for all your hard work! Ohio National Guard tests 650 for COVID-19 in Rootstown ROOTSTOWN - The Ohio National Guard performed 650 COVID-19 tests Tuesday at NEOMED, with long lines early and shorter ones later in the day, according to Dale Hluch, director of campus operations at... record-courier.com", "2020-07-22T12:34:45.000Z": "Yesterday, there was free COVID testing in Alliance. Thank you @health_stark and everyone who worked to make the testing possible! Alliance battles COVID on two fronts The battle against the spread of COVID-19 was easy to see Tuesday, as two events to assist members of the public took place in the city of Alliance. Tuesday afternoon, a large crowd of area residents... the-review.com", "2020-07-22T12:18:11.000Z": "CINCINNATI- HAMILTON County - SW Ohio - FREE Covid testing today from 9 am - 1 pm at Withrow High School,\n2488 Madison Road. Free COVID-19 testing sites in Cincinnati this week Anyone can get the free test and no appointment is needed. fox19.com", "2020-07-22T12:13:17.000Z": "CLARK County - SPRINGFIELD - Miami Valley - FREE COVID testing today from Noon to 6 at La Condessa Grocery - 440 S. Burnett Road in Springfield @clarkcohealth Coronavirus: Pop-up testing Wednesday in Springfield Free pop-up COVID-19 testing is available from noon to 6 p.m. Wednesday, July 22, 2020, in Springfield. springfieldnewssun.com", "2020-07-21T14:24:12.000Z": "Portage County Health District employees are out at NEOMED helping with the pop up testing! The testing will take place until 3:00pm!", "2020-07-21T12:28:48.000Z": "Stark County and Northeast Ohio! Free COVID testing TODAY in ALLIANCE! @health_stark Quote Tweet Stark County Health Department @health_stark Alliance:\n\nWHEN: July 21, 1:00 p.m.-5:00 p.m. WHERE: College Plaza Location (hosted by Family Empowerment Ministries/Spirit of Faith Christian Center)\n\n1150 E. State St. Alliance, OH 44601", "2020-07-21T12:21:46.000Z": "Portage County and Northeast Ohio!  Free COVID testing...TODAY, Thursday, and Saturday! See below for details. @PortageCoHealth  @NEOMEDedu  @OHNationalGuard Quote Tweet Portage Co Health @PortageCoHealth TOMRROW, July 21st will be the first day of covid-19 testing at @NEOMEDedu ! Testing will take place from 9:00AM -3:00PM conducted by the Ohio National Guard! This is a drive up only, all are welcome - no appointment necessary! ** NO ANTIBODY TESTING **", "2020-07-21T12:05:21.000Z": "Over 1,400 people got a free covid test yesterday at the pop-up site at the Montgomery County Fairgrounds. Thank you to the @OHNationalGuard and @PublicHealthDMC for all your hard work! Coronavirus: More than 1,400 tested at Montgomery County Fairgrounds daytondailynews.com", "2020-07-20T20:31:08.000Z": "I'm going to be on with @TheTrivShow around 4:40.... @wtam1100", "2020-07-20T12:03:34.000Z": "Free covid testing today in Knox County from 3-6 TODAY! @KnoxHealth  @OHNationalGuard National Guard to help with drive-thru testing in Howard Knox Public Health, the Community Health Center and the Ohio National Guard are joining forces to offer a drive-thru opportunity next week to test for COVID-19. mountvernonnews.com", "2020-07-20T11:49:29.000Z": "FYI Miami Valley - Pop Up Testing at the Montgomery County Fairgrounds today! @PublicHealthDMC Quote Tweet Dayton Daily News @daytondailynews Coronavirus: Pop-up testing at Montgomery County Fairgrounds today https:// daytondailynews.com/news/coronavir us-pop-up-testing-at-montgomery-county-fairgrounds-tomorrow/TMTN4UN4DNAQDO6VSTWGKUXPG4/ ", "2020-07-18T23:53:18.000Z": "Let's wear our masks Ohio and Buckeye Nation lets do our part to protect each other!  @OhioStAthletics  @OhioStateWBB", "2020-07-17T21:49:50.000Z": "\"I urge everyone to take this pandemic seriously, this can happen to anyone, even the healthiest of athlete. Wear a mask, social distance, and follow your local protocols.\"                                   Get well soon, Yasiel! Quote Tweet Yasiel Puig @YasielPuig", "2020-07-17T12:23:56.000Z": "No-Cost testing in Trotwood today! 9 am - 4 pm. @mayormmcdonald Quote Tweet Ohio Dept of Health @OHdeptofhealth TODAY: pop-up testing in Trotwood. Find our interactive map with testing sites across the state here: http:// bit.ly/2Xu2N9F  #InThisTogetherOhio", "2020-07-17T12:22:28.000Z": "No-Cost testing today in Youngstown!  From now until 6 pm. Quote Tweet Ohio Dept of Health @OHdeptofhealth TODAY: pop-up testing in Youngstown. Find our interactive map with testing sites across the state here: http:// bit.ly/2Xu2N9F  #InThisTogetherOhio", "2020-07-16T14:15:00.000Z": "We invest in innovation and technology. But we know a good low tech solution when we see it. #MasksOnOhio  #InThisTogetherOhio  @GovMikeDeWine", "2020-07-15T22:38:56.000Z": "The Council joins our Ohio leadership in supporting the importance of wearing a mask in public and social distancing. By embracing #InThisTogetherOhio , we protect our fellow Ohioans while keeping the economy open. #ResponsibleRestartOhio  @GovMikeDeWine  @OHdeptofhealth", "2020-07-15T21:45:55.000Z": "The Ohio Business Roundtable joins @GovMikeDeWine in asking Ohioans to put #MasksOnOhio in public. Together we can fight the virus and keep our economy moving. #InThisTogetherOhio", "2020-07-15T21:59:38.000Z": "Wash your hands, wear a mask, and practice social distancing, 3 simple things slow the spread of COVID-19. Together we can keep our economy moving. #MasksOnOhio  #InThisTogetherOhio  @GovMikeDeWine   #OhioRestaurants", "2020-07-15T21:55:50.000Z": "We're joining @GovMikeDeWine and asking you to put #MasksOnOhio . Together we can fight the virus and keep our economy moving. #InThisTogetherOhio  #AllforOhio", "2020-07-15T21:51:57.000Z": "It's time to put our #MasksOnOhio ! We must work together to slow the spread of COVID-19, keep our communities safe, and keep moving our economy forward. #InThisTogetherOhio  @GovMikeDeWine", "2020-07-15T21:55:38.000Z": "We're joining @GovMikeDeWine and asking you to put #MasksOnOhio . Together, we can fight the virus and keep our economy moving. #InThisTogetherOhio", "2020-07-16T12:56:53.000Z": "Thank you to everyone who came out to the Springfield covid testing site yesterday. @clarkcohealth Clark County coronavirus testing clinic sees increase of residents The Clark County Combined Health District and the City of Springfield saw an increase of residents at their second free coronavirus testing clinic. springfieldnewssun.com", "2020-07-15T17:54:44.000Z": "At 5:30, I will update the people of Ohio on the current state of the Coronavirus pandemic and the recent increases in cases and virus spread.", "2020-07-12T13:38:04.000Z": "Happy Birthday, Tina!  Thanks for all you do for our state! Quote Tweet Jon Husted @JonHusted Happy birthday to my wonderful wife Tina!", "2020-07-11T18:21:34.000Z": "Thank you, Ella! #IWantASeason Quote Tweet ✿ ᎬᏞᏞᎪ ✿ @BiondiElla By everyone doing their part in preventing the spread of COVID-19 this will help bring sports back for highschool athletes. #IWantASeason  @MentorLadybball  @MentorVB", "2020-07-11T18:17:30.000Z": "Great message, Rockets! #MaskUp  #IWantASeason  #GoRockets Quote Tweet Toledo Athletics @ToledoRockets Rockets, be a team player. Wear a mask.   #MaskUp | #GoRockets", "2020-07-08T19:49:15.000Z": "From the man @youngchase907 himself: Wear a mask! #IWantASeason  #GoBuckeyes", "2020-07-08T12:03:09.000Z": "TODAY: pop-up testing continues in Cincinnati. Find our interactive map with testing sites across the state here: http:// bit.ly/2Xu2N9F  #InThisTogetherOhio  #ResponsibleRestartOhio", "2020-07-07T18:32:35.000Z": "Lt. Governor @JonHusted launches the #IWantASeason awareness campaign", "2020-07-07T22:52:01.000Z": "There is no question that the upcoming weeks are going to be a critical time in the decision to allow sports in the fall, at all levels. Please do your part and do whatever you can to minimize the spread of COVID-19, because #IWantASeason", "2020-07-05T21:57:08.000Z": "Help us get back on the court and wear your mask.  #GoBuckeyes", "2020-07-05T13:56:18.000Z": "Fran and I are saddened by the death of Toledo Police Officer Antony Dia in the line of duty. I have ordered that flags in Lucas County and at the Statehouse be lowered to half staff until his funeral.", "2020-07-04T12:58:53.000Z": "Happy Fourth of July from @FranDeWine and me.  Fran made our masks.  Hers has a baseball theme and mine is the Ohio flag.", "2020-07-02T16:02:33.000Z": "At my 2:00 press conference today, I'll be announcing the reopening guidelines for our k-12 schools.", "2020-07-01T12:59:52.000Z": "We want to see you back in The Shoe in this fall! \nPlease do your part and wear your masks ! #GoBuckeyes", "2020-07-01T18:22:44.000Z": "On Thursday, you can get your NO-COST COVID-19 test at two locations in Cincinnati. @CityOfCincy  @HamCoHealth", "2020-07-01T18:17:48.000Z": "On Thursday, you can get your NO-COST COVID-19 test in Circleville. @PC_PublicHealth", "2020-07-01T14:52:09.000Z": "Thank you to everyone who came out to the Wood County COVID-19 Pop-Up testing site yesterday! @sentineltribune  @WCHDOhio VIDEO: Pop-up testing popular at the Wood County Community Health Center 428 coronavirus tests were given today at the Wood County Community Health Center. sent-trib.com", "2020-06-27T21:56:54.000Z": "Are you getting ready to take the drivers license skills test?  Check out the story below for information about the new protocols. Driving skills tests return in Ohio with a new look post COVID-19 shutdown After COVID-19 forced driving skills tests to be put on hold, there is finally some good news for soon-to-be drivers in Ohio. \"I turned 16 in August,\" said Srikar Maduposu, a newly licensed driver.... abc6onyourside.com", "2020-06-26T12:07:14.000Z": "Here are the pop-up testing site locations for next week. Anyone can show up and get a no-cost COVID-19 test.", "2020-06-19T11:33:10.000Z": "Free fishing in Ohio on Saturday and Sunday for Ohio residents! Quote Tweet OhioDNR @ohiodnr Free Fishing Days Weekend for Ohio Residents is June 20-21 - http:// ow.ly/kwAb50AboZw  @OhioDivWildlife  #WildOhio  #Fishing  #FreeFishing  #OhioFindItHere  #responsiblerecreation  #InThisTogetherOhio", "2020-05-28T11:08:29.000Z": "The \"Flags For Forgotten Soldiers\" display was started by Mr. Howard Berry, in memory of his son SSG Joshua Berry, who lost his internal battle in 2013. Let us remember, as we move past Memorial Day, the fight doesn't always end when the uniform comes off.", "2020-05-28T11:05:53.000Z": "Today, at Veterans Plaza on the grounds of the @OhioStatehouse , there is a display of nearly 700 United States flags. Each flag represents one of the 22 Veterans lost daily, nearly 700 lost monthly to suicide.", "2020-05-27T18:34:04.000Z": "I just got off the phone with @VP Pence. I am grateful for the Administration's help as we continue to fight COVID-19.", "2020-05-25T13:42:29.000Z": "Today we remember those who made the ultimate sacrifice for our nation.  Because of their bravery we live in the land of the free. #MemorialDay2020", "2020-05-21T23:00:00.000Z": "Tomorrow (5/22) at 10AM (ET), we will host a Youth Summit with OH Governor @MikeDeWine and Hall of Famers @darrellgreen28 , @AnthonyMunozHOF and @aeneas35 . \n\nTune in live on our Facebook page: http:// bit.ly/HOFFBLive  #SYSC | #SYSCOHIO", "2020-04-12T00:09:31.000Z": "Wanted to share this story from Lancaster.  This will be a different Easter, but the generous spirit of Ohioans is great to see. Facebook post by Lancaster businessman leads to Easter miracle for hundreds hurt by coronavirus Lancaster businessman and philanthropist Brad Hutchinson posted on Facebook Sunday that he wanted to help families with Easter baskets and dinner. Requests poured in. So with $11,000 of Hutchinson's... dispatch.com", "2020-04-10T22:32:58.000Z": "A friend brought her to us a week ago - rest assured that we practiced social distancing when she was dropped off! Dolly seems to enjoy our daily walks around the farm.", "2020-04-10T19:46:02.000Z": "Hello Dolly! Fran and I are happy to introduce our 1 and 1/2 year old Springer Spaniel.  She has been a great addition to our family.", "2020-04-09T16:23:41.000Z": "Take 30 seconds and watch this great video by the @OHdeptofhealth explaining how social distancing works and keeps us all safe. #FlattenTheCurve  #StayHome  #InThisTogetherOhio Quote Tweet Arundi @dativenk So proud of this video and the amazing team that put it together. #coronavirus  #COVID  #FlattenTheCurve  #stayhome  #InThisTogetherOhio", "2020-04-06T13:50:57.000Z": "Thank you to Macey and the Tontogany 4-Leaf Clovers 4-H Club in Wood County for this wonderful message to all of our essential workers! @ohio4h  #InThisTogetherOhio", "2020-04-06T11:35:00.000Z": "In about 5 minutes, @MikeDeWine joins Nolan, Malone, Kullik and Tracey on the Majic Morning Show! -> https:// wmji.iheart.com/featured/nolan -malone-kullik-and-tracey/content/2020-04-03-ohio-governor-mike-dewine-and-dr-amy-acton-join-us-monday-at-740-am/ ", "2020-04-04T20:39:57.000Z": "This was in the driveway when I got home today - God bless America!", "2020-04-05T12:15:44.000Z": "These kids are staying home for you. Who are YOU staying home for? #InThisTogetherOhio", "2020-04-04T18:02:51.000Z": "Today, I'm wearing a tie from @NEOMEDedu .  NEOMED is where @DrAmyActon earned her medical degree.", "2020-04-03T23:20:58.000Z": "The Village of Monroeville recently re-lit its community Christmas tree, hoping to bring comfort to those who drive past.", "2020-04-03T18:05:38.000Z": "Today, I'm wearing my @youngstownstate tie. They have more than 12,000 students with over 115 undergraduate and 40 graduate programs. Thank you @JimTressel5 and everyone at YSU for all you do!", "2020-03-29T20:01:02.000Z": "If you watched my press conference today, I concluded with the @MaloneU (Canton, Ohio) virtual choir singing \"The Lord Bless You and Keep You.\"  They have taken social distancing and turned it into Social Distance-Sing! The Lord Bless You and Keep You-- The Malone University Chorale... A blessing from the book of Numbers, by Peter Lutkin. During this difficult and unprecedented time, the commitment of the students in the Malone University C... youtube.com", "2020-03-26T12:32:53.000Z": "Last year, Fran & I met Kaden. He was in treatment for a cancerous brain tumor. His parents sent me this update:\n\n\"Yesterday, Kaden had his MRI. It has been 16 months since he relapsed so this MRI was crucial one. It came back clear with no evidence of disease! We are thrilled!\"", "2020-03-22T16:02:23.000Z": "Wow - the courthouse looks great. Thank you, Licking County Quote Tweet Rick Platt @RickPlatt Licking County ratchets it up a level on @GovMikeDeWine call for flying the flag.  The courthouse is lit up in patriotic colors.", "2020-03-22T14:33:24.000Z": "US and #Ohio flags shall be flown at half staff at all public buildings in Mahoning County in honor of State Representative Don Manning. \n\nFlags should also be flown at half staff at all public buildings in Hamilton County in honor of Springdale Police Officer Kaia Grant.", "2020-03-22T00:31:24.000Z": "Yep - that'll do! Thanks, Brutus! Quote Tweet Brutus Buckeye @Brutus_Buckeye I don't have a front porch but assume this works @MikeDeWine   #InThisTogetherOhio", "2020-03-21T22:11:44.000Z": "Thank you, Busser family! https:// twitter.com/mbusser21/stat us/1241486473158897664  This Tweet is unavailable.", "null": "", "2020-03-21T21:55:18.000Z": "Thank you, Tiffany! Quote Tweet Tiffany Hambel @TiffanyHambel @GovMikeDeWine  @MikeDeWine  @DrAmyActon THANK YOU for your leadership! #InThisTogetherOhio  #COVID19OhioReady", "2020-03-21T21:49:49.000Z": "Thank you, and thank you for your service! Quote Tweet Libby @LibbyHayes1 @MikeDeWine This veteran's flag is waving proudly.", "2020-03-21T21:46:32.000Z": "Thank you, President Robinson! Quote Tweet Steve Robinson @LCCPresident #FlattenTheCuve  #COVID19OhioReady  @ToledoFlags  @MikeDeWine", "2020-03-21T21:44:33.000Z": "Thank you, Mark! Quote Tweet Mark Prusinowski @Pru1PC North Canton supports a strong Ohio!  Thank you @MikeDeWine for your leadership!", "2020-03-21T21:44:01.000Z": "Thank you! Quote Tweet Laurie McCormack @Lauriemack31 @MikeDeWine  #ohiostrong", "2020-03-21T21:43:31.000Z": "Thank you!  The flag (and lights!) look great. Quote Tweet Major's dad @JimWalker13 Replying to @MikeDeWine My flag is always flying!", "2020-03-21T21:42:22.000Z": "Thank you, Lorraine! Quote Tweet Lorraine Stiefel @LorraineStiefel @MikeDeWine We rent so all we have is a little flag...but it is out!", "2020-03-21T21:15:31.000Z": "The flag looks great! Quote Tweet Derek Varansky @DVaransky Contrary to the garden flag, friends currently not welcome . #OhioStrong  #InThisTogether  @GovMikeDeWine  @MikeDeWine", "2020-03-21T21:14:51.000Z": "Thank you! Quote Tweet J Root @JayFizz13 People follow strong leadership in a crisis. @MikeDeWine", "2020-03-21T21:14:05.000Z": "That's great!  Thank you, Steve! Quote Tweet Steve Holt @youthguru @MikeDeWine", "2020-03-21T21:10:28.000Z": "Thank you! https:// twitter.com/dakotaleedille y/status/1241459453632876546  This Tweet is unavailable.", "2020-03-21T21:06:34.000Z": "Thank you, Glenn! Quote Tweet Glenn Murgatroyd @GlennMurgatroyd Replying to @MikeDeWine Marysville, Ohio", "2020-03-21T20:42:55.000Z": "Thank you, Katie and Jesse! Quote Tweet Katie @KatieShamp Proud to have our flag flying! @GovMikeDeWine  @JShamp_724", "2020-03-21T20:16:58.000Z": "Thank you! Quote Tweet Steven J. Megerle @CincyMegsGOP @GovMikeDeWine we are proud you are leading our State through this crisis!  Flying the in North Avondale per your suggestion!  Your steady hand will get us through this storm. @MikeDeWine  @FranDeWine  @HamCoGOP  @ohiogop  @JaneyMurph  @GOCOAST", "2020-03-21T20:15:42.000Z": "Thank you! Quote Tweet Kyla (Yes, black lives do matter.) @SailorSonicX I don't have a large flag to fly outside, but I do have a small one inside!  We've been asked to fly our state flag or the American flag in a stance of unity against the virus.\n\nIn America, and across the world, may God's peace shine. #InThisTogether  @GovMikeDeWine  @MikeDeWine", "2020-03-21T20:15:13.000Z": "Thank you, April! Quote Tweet April Ernst @aernst95 @MikeDeWine  @GovMikeDeWine", "2020-03-21T20:13:30.000Z": "Thank you! https:// t.co/lKrF5kdrIk This Tweet is unavailable.", "2020-03-21T20:13:07.000Z": "Thank you! Quote Tweet Marty Swinehart @traheniwsm @MikeDeWine A new addition to my house today, thank you for the idea! #ohiostrong", "2020-03-21T20:12:41.000Z": "Thank you! Quote Tweet Jim Amspoker @jamspokMCS Outside to release from the cabin fever. This guy wanted to follow the advice of our great governor @MikeDeWine", "2020-03-21T20:10:30.000Z": "Thank you! Quote Tweet Matt Bruning @mbruning81 I told my parents about @GovMikeDeWine 's request to fly the flag. They immediately went out and got it done! #COVID19OhioReady", "2020-03-21T18:34:16.000Z": "Thank you, Leanne! Quote Tweet Leanne Sunderman @MsSunderman @MikeDeWine Thank you for your leadership!!", "2020-03-21T18:16:26.000Z": "Thank you, Mark! Quote Tweet mark gessner @mrkgessner @MikeDeWine  #ohiostrong", "2020-03-21T17:59:53.000Z": "Thank you, Ken! Quote Tweet Ken Masich @Ken_Masich @MikeDeWine flying in Barberton!", "2020-03-21T17:09:20.000Z": "Thank you! Quote Tweet Jeffrey Schetroma @AFTSgtIMer . @MikeDeWine flying in support in Beavercreek. #AloneTogether  #CoronavirusPandemic  #OhioStrong", "2020-03-21T17:07:13.000Z": "Thank you! Quote Tweet Lib Ration @lib_ration @MikeDeWine I may not live in #Ohio now, but I'm still an Ohioan. #InThisTogether", "2020-03-21T17:06:37.000Z": "Thank you, Grant! Quote Tweet Grant Lammi @glammi @MikeDeWine we are here too. From a distance.", "2020-03-21T15:47:06.000Z": "Thank you, John! Quote Tweet John Lester @lesterohio Replying to @MikeDeWine", "2020-03-21T15:29:03.000Z": "Thank you! Quote Tweet Matt Hill @matthewchill1 ...... @GovMikeDeWine  ... @MikeDeWine  I know I am not a 7 yr old like you mention in your press conference yesterday, but I felt the need to fly my wife & my flags! #Wereallinthistogether", "2020-03-20T11:22:10.000Z": "I woke up this morning to the following email:\n\nMr. Dewine.\nWe do not have an American Flag to hang outside our home. Today after your news conference, my seven year old daughter made this flag for our house in honor of your request.\n\nThank you, Alayna!", "2020-03-17T23:15:12.000Z": "Thank you to all the Ohioans who continue to support restaurants by ordering carry-out and delivery! Quote Tweet Governor Mike DeWine @GovMikeDeWine Support your local restaurants! I took my granddaughters, Caroline and Izzy, to ... @DubVillageTav  to pick up a special #StPatricksDay dinner for the family tonight! Restaurants across #Ohio are open for carry-out and delivery! #COVID19OhioReady", "2020-03-16T21:46:13.000Z": "What are some helpful resources for businesses as we all work together to slow the spread of #COVID19 ? Enhanced unemployment aid - http:// unemployment.ohio.gov  @OhioJFS  Small business support - BusinessHelp@development.ohio.gov @OhioDevelopment", "2020-03-16T20:01:33.000Z": "People should not have to choose between their constitutional rights and their health.  That's why I'm recommending that we delay in-person voting until June 2. But I don't have the authority to push the date back, so a lawsuit will be filed soon in Franklin County. #StayTuned", "2020-03-14T21:39:52.000Z": "Today is pi(e) day! Jeannie and Fran made this strawberry/blueberry pie. Can't wait to eat it!", "2020-03-13T22:49:42.000Z": "A lot of people are asking me about @OHdeptofhealth Director Dr. Amy Acton.  From living in a tent while homeless to graduating medical school - she has an incredible story. Amy Acton is calming leader in coronavirus crisis The Ohio Department of Health director is drawing praise for her knowledge, calm and compassion as she leads the state through the coronavirus crisis. dispatch.com", "2020-03-12T17:43:34.000Z": "We are trying to keep the public as informed as possible. You can watch our next COVID-19 update at 2 pm at http:// ohiochannel.org or check your local media's website.", "2020-03-11T23:41:17.000Z": "This morning, I stopped by the @OHdeptofhealth call center. If you have questions about coronavirus - you can reach the call center (7 days/week from 9:00 a.m. to 8:00 p.m.) at 1-833-4-ASK-ODH  You can also get the latest information and guidance at http:// coronavirus.ohio.gov .", "2020-03-06T17:23:56.000Z": "The @OHdeptofhealth has opened a call center to answer questions regarding coronavirus. The call center will be open 7 days a week from 9:00 a.m. to 8:00 p.m. and can be reached at 1-833-4-ASK-ODH.", "2020-03-04T12:34:44.000Z": "Greeneview offers an elective class where students learn about everything that goes into running a farm - plant and animal science, plumbing, concrete, business/finance, etc.  These are all great skills to have whether you go into farming or not. @GreeneviewLocal  @OhioFFA", "2020-03-04T12:33:18.000Z": "Last night, I spoke at the Greeneview FFA banquet. What a great group of young people. Congrats to the Greeneview FFA on a great year! @GreeneviewLocal  @OhioFFA", "2020-03-03T01:57:36.000Z": "Good news! @SiteSelection named #Ohio #1 for per capita projects in its 2019 Governor's Cup state economic & business attraction rankings. @JobsOhio  @APEGOhio  @RGP_Toledo  @TeamNEO  @CBUSRegion  @daytonregion  @GrowCincyUSA", "2020-03-01T15:08:53.000Z": "Congratulations to the Ohio State women's track and field team and head coach Karen Dennis!  Yesterday, they won their second consecutive indoor Big 10 team championship! @OhioStateTFXC", "2020-03-01T12:24:05.000Z": "Happy birthday, #Ohio", "2020-02-29T21:38:08.000Z": "Congrats to Coach Nagy and the Wright State men's basketball team on their regular season Horizon League championship! @WSU_MBB", "2020-02-29T00:00:12.000Z": "Back at @UDArena to watch the @DaytonMBB take on Davidson. Let's go Flyers! #WearRed  #BeLowd", "2020-02-28T02:48:11.000Z": "Senate President @LarryObhof was honored tonight at the Medina County Lincoln Day Dinner for his service to the people of Medina County and the people of Ohio!\n\nHe was presented with original artwork done by @TinaHusted1 of his daughters looking out of his Senate office window.", "2020-02-27T01:19:14.000Z": "Today Lt. Gov. @JonHusted & I toured the lab at the Knox County campus of @COTCedu to learn about how the college is preparing  students through hands-on training in order to meet the needs of future employers.", "2020-02-25T21:45:31.000Z": "Today I signed House Bill 18,\nsponsored by @NinoVit & @EricaCCrawley , the #Ohio Veterans Exemption Payment Act offers a 1-time, refundable tax credit to vets who've paid state income tax on disability severance payments & gives them a 2-year period to claim the credit.", "2020-02-22T22:31:32.000Z": "A great family day watching @DaytonMBB get their 16th win in a row. Go Flyers!", "2020-02-21T01:41:01.000Z": "I had great  evening in Meigs County tonight at their annual Lincoln Day dinner. I was thrilled to see so many local high school students and visit with the OU College Republicans after the event. Also, I helped honor County Recorder Kay Hill with an award for her service.", "2020-02-21T00:32:19.000Z": "Great to see my friend @RickSantorum today.  He stopped by a meeting of our cabinet today while he was in Columbus.", "2020-02-20T16:36:22.000Z": "This morning I had the honor of presenting the Ohio Distinguished Service Medal to Col. Guion Bluford for his lifetime achievements in service to the state and nation. \nHe flew 144 combat missions in Vietnam and became first African American astronaut to travel to space in 1983.", "2020-02-20T00:14:21.000Z": "Enjoyed being with @OhioCornWheat growers tonight in #Springfield for their celebration.", "2020-02-17T15:26:28.000Z": "Happy 100th Birthday to Annie Glenn. Annie Glenn, widow of astronaut John Glenn, turning 100 Annie Glenn,  the wife of the late astronaut and U.S. Sen. John Glenn, is turning 100 Monday and is doing fine, a spokesman said. cincinnati.com", "2020-02-17T13:37:49.000Z": "#Ohio is the mother of presidents. William Henry Harrison, Ulysses S. Grant, Rutherford B. Hayes, James Garfield, Benjamin Harrison, William McKinley, William Howard Taft and Warren G. Harding. https:// ohiohistory.org/participate/ev ent-calendar/ohio-history-center/presidents-day ", "2020-02-13T22:28:46.000Z": "Today I announced details of a new bill to strengthen #Ohio 'a laws against #distracteddriving The Bill is sponsored by @StephanieKunze and @Sean_J_OBrien", "2020-02-12T00:12:54.000Z": "Let's go Flyers! #dayton6th  #BeLowd  @DaytonMBB", "2020-02-07T00:47:32.000Z": "I had a great conversation today with Elyria's new mayor - Frank Whitfield. We talked about some of the challenges the city is facing, but also some of the things that really excite him. Great meeting you today, Mayor!", "2020-02-06T21:04:34.000Z": "A big win today for #Cleveland and NE Ohio. @SherwinWilliams is going to build their new headquarters in Cleveland. They also announced they will build a new R&D center in #Brecksville . More than 3,500 employees will be employed here in #Ohio ! Quote Tweet Sherwin-Williams @SherwinWilliams Sherwin-Williams plans to create a next generation workplace environment that further ignites creativity, collaboration and industry-leading innovation. We believe we have identified a solution in Cleveland and Northeast Ohio. Learn more at http:// BuildingOurFuture.com . #LifeAtSherwin", "2020-02-06T18:17:04.000Z": "Great news today! @Facebook 's @NewAlbanyDataCenter is now open! #Facebook also announced that they are adding two new buildings.  The $1 billion project will support 150 jobs. #Ohiofindithere", "2020-02-05T21:17:27.000Z": "I'm in studio with @scottsands on @1370wspd , and I brought one of @FranDeWine 's homemade pies with me!", "2020-02-02T00:20:06.000Z": "Earliest maple syrup ever for our son John! Getting ready to put some on ice cream as we celebrate Rebecca's birthday!", "2020-02-01T16:53:53.000Z": "Today marks the start of #BlackHistoryMonth .  We are proud of the many contributions made by African Americans to our state and nation.", "2020-01-29T20:22:02.000Z": "Today @realDonaldTrump signed the #USMCA trade agreement which makes it easier for #Ohio businesses and farmers to export products to Canada and Mexico.", "2020-01-27T19:36:28.000Z": "This afternoon I signed Senate Bill 7 at the #USAirForceMuseum  @WrightPattAFB .  The bill helps military spouses with occupational licenses have reciprocity in Ohio while their spouse is stationed in Ohio.", "2020-01-25T04:02:05.000Z": "A great game tonight, @Ivan_Mallett !  Go Raiders! Quote Tweet Ivan @Ivan_Mallett Thank you @MikeDeWine for coming to the @WSU_MBB game tonight. Despite the challenges of the past Wright State student life is vibrant. We are excited for the future of our university under the leadership of @WSUPrezSue .", "2020-01-24T17:40:43.000Z": "Today thousands will participate in the March for Life in Washington, D.C.", "2020-01-21T14:11:05.000Z": "For the @B1Gfootball Championship Game, @GovEvers and I made a friendly cheese wager.  Last week, some delicious Hook's Muenster Cheese out of Mineral Point, WI arrived. Thank you, Governor!", "2020-01-20T14:07:23.000Z": "Today we remember the life and legacy of Dr. Martin Luther King Jr. whose life was dedicated to non-violent social change and service. #MLKDay2020", "2020-01-20T00:08:45.000Z": "It was my honor to be a part of the state's Martin Luther King Jr. Commission Celebration. It was inspiring to hear from the young people who spoke about Dr. King's legacy. #MLKDay2020  https:// dispatch.com/news/20200116/ youths-celebrate-legacy-of-mlk-at-annual-commemorative-event?template=ampart ", "2020-01-15T01:15:26.000Z": "Today I was with @SecretaryCarson and @RepSteveStivers at Huckleberry House to talk about their programs for at-risk and homeless youth.", "2020-01-13T16:36:49.000Z": "This morning I was in #Bluffton at GROB Systems with @LtGovHusted  @joncrossoh and @LarryObhof to sign House Bill 2 into law.  The bill helps build a stronger workforce by helping workers with technology-related skills.", "2020-01-08T02:38:08.000Z": "Our armed forces around the world work tirelessly to keep us safe. We are grateful for all the Ohioans who are serving our country in the military, and keep them always in our thoughts and prayers.", "2020-01-06T22:28:50.000Z": "Today I was pleased to join leadership from Fuyao Glass America @JobsOhio and @LtGovHusted for the announcement that @FUYAO is adding 100 new jobs in #Ohio . #OhioFinditHere  #ohioSuccess", "2020-01-01T18:59:05.000Z": "Congratulations and Good luck to the Ohio State School for the Blind Marching Band who will perform at halftime of the @outbackbowl today! Ohio State School for the Blind's marching band to perform at halftime show in Outback Bowl COLUMBUS, Ohio (CNN) - The Ohio State School for the Blind's marching band bills itself as the only blind marching band in the world. On Wednesday, the group adds another achievement to fox8.com", "2020-01-01T15:36:10.000Z": "If you watch the @RoseParade this morning, be on the lookout for the #DonateLife float.  More than 3,000 Ohioans are waiting for the gift of a lifesaving organ.", "2020-01-01T14:24:45.000Z": "More than 3,000 Ohioans are waiting for the gift of a lifesaving organ.  You can register to become an organ, eye and tissue donor today online at http:// lifelineofohio.org . #DonateLife home - Lifeline of Ohio lifelineofohio.org", "2020-01-01T14:05:32.000Z": "Today, is the Rose Parade in Pasadena! @FranDeWine and I were honored to sign one of the rose vials that's on the Donate Life float. Last year, 421 Ohioans shared the gift of life through organ donation, and our rose honors those individuals and their tremendous gift. #DonateLife", "2019-12-31T02:14:31.000Z": "It was a great night at @UDArena watching the @DaytonMBB with my son-in-law Nick and 2 of the grandkids!  Go Flyers!", "2019-12-31T01:20:47.000Z": "At the @DaytonMBB game!  Enjoying all of these dunks by the Flyers! #dayton6th", "2019-12-29T01:50:57.000Z": "Our son Brian graduated from Clemson - but the rest of us came to Arizona to cheer on the Buckeyes! O-H! #OSUvsCLEM", "2019-12-27T14:53:16.000Z": "A trip with grandkids to Glen Helen is always fun!", "2019-12-22T20:30:38.000Z": "Some of the grandkids are making gingerbread men this afternoon.   Parker made pancakes this morning!", "2019-12-20T00:17:44.000Z": "Good luck to Miss Ohio - Caroline Grace Williams of Cincinnati - who is competing this evening to be Miss America. She has been working hard to promote Know The F.A.C.T.S. of Calling 911: Caroline's Crisis Call, which promotes what to do in an emergency situations @MissAmericaOH", "2019-12-19T20:25:29.000Z": "Today I encouraged Ohioans to quit using tobacco products as part of their new year resolutions.  For free help, call 1-800-QUIT-NOW or for those under 18, call or text My Life, My Quit at 1-855-891-9989.", "2019-12-18T15:31:41.000Z": "We are starting the Cabinet meeting with a @JobsOhio update from President and Chief Investment Officer JP Nauseef.", "2019-12-18T15:22:34.000Z": "This morning, I had a chance to talk Career Tech education with @mcctc Superintendent @PrincipalZ . He is very excited about and proud of all the things going on here!", "2019-12-18T15:19:28.000Z": "The Governor's meeting is underway! @MikeDeWine  @LtGovHusted  @ywchamber  @MaraBanfield  @jcene2019  @PrincipalZ", "2019-12-18T15:06:35.000Z": "This morning I saw the kitchen where Chef Matt Putzier works with the students in the culinary program here at @MCCTC Our Cabinet meeting is taking place in the Bistro - the student operated restaurant on campus.", "2019-12-18T14:41:39.000Z": "My first meeting this morning is a local health department roundtable with the Ohio Health Director, Dr. Amy Acton. We will talk about creating an environment for all Ohioans to be healthy & the important link between human development & economic development. @OHdeptofhealth", "2019-12-18T13:44:04.000Z": "I'm live on @570wkbn at @MCCTC talking about why @LtGovHusted and I brought the Cabinet to the Mahoning Valley today.", "2019-12-18T13:35:35.000Z": "I'm about to be live on Dan Rivers @570wkbn We are talking live from the Mahoning County Career and Technical Center where I will be hosting a Cabinet meeting this morning. @MCCTC", "2019-12-15T18:55:07.000Z": "We loved seeing our granddaughter Rebecca and all the kids (and teachers!) in Scrooge last night!  So great for kids to be in theater!", "2019-12-15T13:13:34.000Z": "Congratulations to Athens County Ohio native @Joe_Burrow10 on winning the Heisman Trophy!  In his acceptance speech he said, \"When I lift this trophy, it's for LSU, Ohio State, southeast Ohio, and all of Louisiana.\" LSU quarterback Joe Burrow named Heisman Trophy winner NEW YORK - On a stage in Midtown Manhattan on Saturday night, the blonde-haired gunslinger from southeast Ohio received the highest honor bestowed on a college football player. Joe Burrow was named... buckeyextra.com", "2019-12-08T04:13:04.000Z": "Buckeyes looking great in the 2nd half! #B1GChampionship  #grandkids  #Indy", "2019-12-08T01:07:37.000Z": "Let's go Bucks! #B1GChampionship", "2019-12-06T17:39:49.000Z": "Looking forward to watching our @UWBadgers take on OSU in tomorrow's @B1GFootball championship game! I am putting up Hook's Muenster cheese from Mineral Point, but I am really looking forward to that Guggisberg Baby Swiss, @MikeDeWine ! #OnWisconsin Quote Tweet Mike DeWine @MikeDeWine The @B1Gfootball Championship Game is Saturday! In the spirit of collegiality and sportsmanship, I have made a friendly cheese wager with Governor @GovEvers , offering a wheel of the #1 cheese in the country - Grand Champion Guggisberg @BabySwiss ! Go @OhioStateFB !", "2019-12-06T17:35:48.000Z": "The @B1Gfootball Championship Game is Saturday! In the spirit of collegiality and sportsmanship, I have made a friendly cheese wager with Governor @GovEvers , offering a wheel of the #1 cheese in the country - Grand Champion Guggisberg @BabySwiss ! Go @OhioStateFB !", "2019-12-06T00:49:48.000Z": "Last week, Michigan Governor @gretchenwhitmer and I made a friendly bet on the big game. Today, we received a gift basket of delicious treats from @zingermans . Thank you, Governor! @brutus_buckeye  #gobucks", "2019-12-05T19:28:06.000Z": "Great news today for #Ohio .  A deal announced today between GM and LG Chem to build electric batteries will mean 1,100 new jobs near Lordstown. New electric vehicle battery plant will bring 1,100 jobs near former Lordstown auto plant General Motors Chairman and CEO Mary Barra announced Thursday that a joint venture with the South Korean firm LG Chem would make automotive batteries at a new plant near GM's old Lordstown facility,... cleveland.com", "2019-12-04T17:31:51.000Z": "Today I met with students from Cedarville Elementary at my office in the #OhioStatehouse", "2019-11-28T18:36:40.000Z": "Fran and John with the turkey John raised.   Happy Thanksgiving!", "2019-11-28T16:52:20.000Z": "Granson Theo adding sage from the garden to the dressing.   Preparations for Thanksgiving dinner continue!", "2019-11-27T23:11:03.000Z": "Grandson Desi helping @FranDeWine make homemade cinnamon rolls for breakfast.", "2019-11-27T22:24:27.000Z": "Grandson Theo helping Fran make rolls. Thanksgiving has begun!", "2019-11-27T18:09:38.000Z": "On Saturday, it's time to play TTUN! In the spirit of sportsmanship and collegiality, I have made a friendly wager with Governor @gretchenwhitmer , offering a basket of Ohio's famous buckeye candies. Go @OhioStateFB , and O-H!", "2019-11-26T20:16:40.000Z": "Final stop today was @DublinSchools to meet students and staff and talk about their substance use prevention efforts.", "2019-11-26T18:35:13.000Z": "With @senrobportman and students from four districts in Hamilton County @PrevFIRST", "2019-11-26T15:12:31.000Z": "Enjoyed hearing from students and teachers in Lawrence County about their drug prevention efforts.", "2019-11-25T13:53:56.000Z": "Hosting #Thanksgiving this year? Check out these tips to make your gathering accessible if one (or more) of your guests has a disability. https:// bit.ly/2OidKGR", "2019-11-24T21:52:48.000Z": "Touchdown! NASA's Super Guppy aircraft has safely landed at Mansfield Lahm Airport. Welcome to Ohio, @NASA_Orion !", "2019-11-23T23:20:58.000Z": "Are you preparing your menu for #Thanksgiving ? Check out @FranDeWine 's column in the #XeniaDailyGazette for some of the recipes that she'll be making for our family's gathering on Thursday. Fran's Favorites: Preparing for Thanksgiving - Xenia Gazette On weekends Mike and I really enjoy going home to Cedarville and spending time with our family.Cross country season is over but basketball has begun, so la xeniagazette.com", "2019-11-22T15:16:16.000Z": "Unintentional vehicle accidents are one  of the leading causes of death for teenagers. We are installing 400 customized virtual driving assessment systems in Ohio's 57 driver examination locations as well as many driver training schools. Virtual driving terminals to help state gather data for training curriculum Ohio plans to roll out more than 400 new virtual driving terminals that let users cruise around a simulated road while gauging their skills behind the wheel at driver training schools and testing... dispatch.com", "2019-11-18T15:41:58.000Z": "We miss you, Teddy! Quote Tweet Dolly DeWine @firstdogofohio Remembering Teddy \n2005-2019", "2019-11-14T19:05:16.000Z": "In #Toledo outlining our #H2Ohio water quality plan.", "2019-11-12T21:30:56.000Z": "https:// wdtn.com/news/detective -del-rio/city-state-leaders-reflect-on-det-del-rios-legacy  . Today I spoke at the service honoring #Dayton Police Detective Jorge Del Rio. City, state leaders reflect on Det. Del Rio's legacy Through many tears and some laughter, the Dayton community honored a man recognized as one of the very best at what he did. wdtn.com", "2019-11-07T19:54:54.000Z": "Fran and I send our deepest condolences to the DelRio family and the Dayton Police Department.  Below is the order lowering the flags of the United States and State of Ohio in honor of the life and service of Dayton Police Detective Jorge DelRio.", "2019-11-07T17:16:50.000Z": "Proud to recognize the 20 inductees to the Ohio Veterans Hall of Fame today. #Veterans  #OhioFinditHere", "2019-11-07T02:17:40.000Z": "Today I signed \"Tyler's Law\" that strengthens Ohio's amusement ride safety standards.  I was joined by Tyler Jarrell's family for the signing ceremony at the Ohio Statehouse.", "2019-11-04T00:12:10.000Z": "Cousin @JimmyKimmel My fiancée Molly and I need your help! We are getting married in January 2020 (invitation in the mail-hope you can make it). Everything is coming together with one exception...we need a hashtag! Since you're also a Kimmel with a Molly, I'm hoping you can help!", "2019-11-03T19:26:13.000Z": "Fran's Favorites: Autumn leaves, country music & sweet treats - Xenia Gazette The leaves were beautiful this week on the front lawn of the Governor's Residence where different governors have planted all sorts of trees. I especi xeniagazette.com", "2019-10-22T21:21:12.000Z": "Great visit to @MarshallSTEMM in #Toledo today. #tpsproud  #discovertps", "2019-10-19T21:25:06.000Z": "Good luck to everyone running Sunday's Nationwide Children's Hospital Columbus Marathon and 1/2 Marathon!  When you run past mile 7, make sure to say hi to Charlie Hill. Charlie is the official Children's Patient Champion of Mile 7! His dad Jason works at my office.", "2019-10-19T20:32:11.000Z": "Fall in Ohio means it's time for Ohio apples! Check out some of @FranDeWine 's recipes for delicious apple dishes you can make to share with your family. Fran's Favorites: Apple time - Xenia Gazette I love this time of year. It's crisp and beautiful, and there are lots of great Ohio apples to use for cooking.I have only found one apple tree at th xeniagazette.com", "2019-10-17T23:20:30.000Z": "To honor the life and legacy of Rep. Elijah Cummings, and in accordance with orders issued by the President of the United States, I've ordered all U.S. and #Ohio flags be flown at half-staff on all public buildings and grounds in Ohio through tomorrow.", "2019-10-14T13:34:00.000Z": "Just learned that our friend Cooper Snyder died. Cooper was a former state senator from southern Ohio who always stayed close to the people he represented. Cooper and Dorothy were wonderful people who Fran and I were blessed to know. We will miss our friend.", "2019-10-13T18:09:53.000Z": "We watched grandson Justin run cross country yesterday.", "2019-10-13T14:56:20.000Z": "Theo helping his grandmother make waffles this morning !", "2019-10-12T19:50:29.000Z": "Congratulations to our granddaughter, Josie, and the Yellow Springs Girls Cross Country team for winning their conference meet tonight!", "2019-10-11T21:25:03.000Z": "Today I spoke at the investiture ceremony for Judge Eric Murphy of the U.S. Sixth Circuit.  Retired Justice Anthony Kennedy administered the oath.  Eric was the state's solicitor when I was Attorney General.  He is smart, compassionate & fair. He will be a great judge.", "2019-10-06T00:08:31.000Z": "Great race today, Josie!", "2019-10-05T22:35:15.000Z": "Almost game time in the Shoe with Fran's sister, Kathy, and her husband, Tom. #GoBucks", "2019-10-04T18:04:57.000Z": ". @FranDeWine and I toured @JergensInc . They work with kids in the CEVEC program in Cleveland who have special needs. #October is also National Disability Employment Awareness Month. #NDEAM . @OhioOOD  #MFGDay19  @OHIOMFG", "2019-10-02T23:22:27.000Z": ". @FranDeWine is interviewed by @karenkasler of @oprtv Ideas Sunday - First Lady Fran DeWine; Camp Hope; Banner Year for Walleye Before he was sworn in as Ohio's governor eight months ago, Mike DeWine spent more than four decades in public office. Through it all, there's been one constant -- his closest adviser and wife,... ideastream.org", "2019-09-29T12:21:39.000Z": "Last night, Fran, Director Pelanda, and I presented @LukeBryanOnline a proclamation recognizing the #HeresToTheFarmer campaign.  Every time someone uses that hashtag, Bayer, his tour sponsor, will donate a meal to a family through Feeding America.", "2019-09-28T15:33:13.000Z": "A beautiful morning on #LakeErie !", "2019-09-28T12:09:11.000Z": "It's a beautiful morning for Lake Erie fishing! #walleye  #perch", "2019-09-27T12:21:50.000Z": "I will miss hearing @Reds announcer Marty Brennaman on the radio as I travel around our state!", "2019-09-24T20:02:16.000Z": "Register to vote!  Visit http:// Vote.Ohio.gov Quote Tweet Frank LaRose @FrankLaRose Today is #NationalVoterRegistrationDay ! \nIf you or someone you know isn't registered to vote - now is the time.\n\nVisit http:// VoteOhio.gov before the October 7th deadline!", "2019-09-21T23:50:09.000Z": "Congratulations, Becky and Chris!  Fran and I wish you a lifetime of happiness!", "2019-09-21T14:45:25.000Z": "Watched our granddaughter Josie run cross country today in Bellbrook.", "2019-09-20T23:35:06.000Z": "Today I met with #Ontario Premier @fordnation Ford and #Alberta Premier @jkenney Kenney. We talked about our shared goals. Canada was Ohio's largest export market for Ohio products in 2018. There  are 560 Ohio locations of Canadian corporations employing over 21,000 people.", "2019-09-20T12:42:29.000Z": "One of the highlights of the Jug yesterday was getting to catch up with my long-time friend Roger Huston.  Roger is a native of Xenia and has been \"The Voice\" of the Little Brown Jug since 1967.  He has called over 180,000 races in his career!", "2019-09-19T23:15:11.000Z": "It was my pleasure to present the trophy to the winner of the 2019 Little Brown Jug - Southwind Ozzi!", "2019-09-19T22:10:43.000Z": "Over 48,000 people at today's Little Brown Jug!  A beautiful day for harness racing!", "2019-09-19T16:30:51.000Z": "I enjoyed meeting with representatives of #Catholic Charities agencies from all of the dioceses in Ohio.  They serve 400,000 poor and vulnerable people across the state.", "2019-09-18T23:19:58.000Z": "Today I was pleased to be at the #OhioSenate to be part of the ceremony recognizing the bravery of  the #Dayton Police during the August 4th shooting. @peggylehner  @SteveHuffmanOH", "2019-09-11T07:22:38.000Z": "Saitama Prefecture is #Ohio 's sister state.  Today we met Kavya Gopalakrishnan who is their Coordinator for International Relations.  She is also a 2018 @OhioState grad as is our granddaughter Izzy who is on the trip to #Japan with us! #OhioinJapan2019", "2019-09-09T08:09:06.000Z": "Today at the Midwest U.S. Japan conference in #Tokyo , I talked about what a special place #Ohio is.  We value the many relationships we have with #Japanese -owned companies throughout the #Buckeye state. #OhioinJapan2019  #JobsOhio  #OhioFinditHere", "2019-09-08T19:23:52.000Z": "I am in #Tokyo leading a business development mission. #Japan is #Ohio 's top international investor with nearly 73,000 Ohioans employed by Japanese-owned companies. @FranDeWine and I are pictured with Consul General Tsutomu Nakagawa.", "2019-09-02T18:05:48.000Z": "Check out Scott Halasz's article on the history of #Labor Day and #Cedarville native James Kyle who is the father of #Labor Day. Enjoying Labor Day? Thank a Cedarville native - Xenia Gazette CEDARVILLE - While taking one last dip in the pool, munching on a perfectly cooked burger or hot dog, attending CedarFest or otherwise enjoying the u xeniagazette.com", "2019-09-02T14:59:57.000Z": "", "2019-08-31T10:54:54.000Z": "Looking for something fun to do w/ your family this weekend? I suggest hiking one of Ohio's many trails.  Fran & I recently took some of our family members & hiked to Buzzardroost Rock in the Edge of Appalachia Preserve in Adams County. The view was stunning! #OhioFindItHere", "2019-08-30T13:38:39.000Z": "Nutrition is so important to help #Ohio kids do their best in school. Check out @FranDeWine column on easy back-to-school recipes. Fran's Favorites: Back to school recipes - Xenia Gazette I love hearing our grandkids talk about their favorite things that we did together this summer.Some liked our trip to the Cleveland Museum of Natural Histo xeniagazette.com", "2019-08-29T17:45:04.000Z": "Stopped in @vindicator today to thank their reporters and editors for all of the great journalism they've produced.", "2019-08-29T14:40:42.000Z": "A beautiful morning for the ribbon cutting of the @CanfieldFair !", "2019-08-29T11:54:11.000Z": "Talking with Youngstown media before Youngstown/Warren Regional Chamber's Salute to Business.", "2019-08-29T11:09:17.000Z": "Taping an interview this morning with Dan Rivers on @570wkbn in Youngstown.  You can hear the interview later this morning on his show.", "2019-08-29T00:02:29.000Z": "In Trumbull County tonight with @JonHusted .  Great to be with friends in the Mahoning Valley.", "2019-08-27T21:02:36.000Z": "It was great seeing @SecPompeo at the American Legion Convention today. #ALconv2019", "2019-08-27T15:58:19.000Z": "It was my honor, on behalf of @cindymccain and her family, to accept the @AmericanLegion Distinguished Dervice Medal awarded to my friend Senator John McCain. #ALConv2019 Quote Tweet The American Legion @AmericanLegion Ohio Gov. @MikeDeWine accepting our Distinguished Service Medal recipient on behalf of former U.S. Sen. John McCain. #ALconv2019", "2019-08-27T15:29:46.000Z": "Thank to @Lauren_Daigle for performing at the #Ohio Reformatory for Women and sharing your positive message through music! #lookupchildworldtour Quote Tweet Lauren Daigle @Lauren_Daigle The one thing that we can always do is look up. | 8.24.19 | #lookupchildworldtour  View the full video: https:// youtu.be/7VkKxpyMuZ8", "2019-08-25T18:33:21.000Z": "Thanks to the @OHNationalGuard", "2019-08-25T17:18:19.000Z": "Today I am in #Canton for a call-to-duty ceremony recognizing nearly 600 @OHNationalGuard soldiers deploying to the Middle East. Thanks to the 1st Battalion, 145th Armored Regiment troops and their families for their service to our state and country.", "2019-08-21T17:00:56.000Z": "Today I announced the creation of the Ohio School Safety Center to help prevent and prepare for acts of violence or self-harm.  Read more  https:// governor.ohio.gov/wps/portal/gov /governor/media/news-and-media/20190821 ", "2019-08-17T14:56:45.000Z": "Last night, Justin & I went to the @OSReformatory in Mansfield where they are celebrating the 25th Anniversary of #ShawshankRedemption . The movie was filmed in & around Mansfield. There are events all weekend - you can tour film sites, meet cast members, and more! #OhioFindItHere", "2019-08-13T19:43:34.000Z": "Fran DeWine and I were in #Dayton many times last week following the terrible shooting.  Fran describes the week in her column below. #DaytonStrong . Dayton Strong - Xenia Gazette Last week was filled with sadness in the Miami Valley and all of Ohio.Mike got the call in the early hours of Sunday morning, Aug. 4, that there had been a xeniagazette.com", "2019-08-08T16:02:47.000Z": "With First Lady @FranDeWine and Lt. Gov. @JonHusted in the Oregon District in #Dayton with #DaytonStrong shirts.", "2019-08-08T00:22:18.000Z": "I was on @foxnewsalert today talking about @realDonaldTrump and @FLOTUS visit to Dayton. Quote Tweet GOP @GOP Today, @GovMikeDeWine joined @realDonaldTrump and @FLOTUS in Dayton as they met with family members, victims, medical professionals, and first responders.\n \nHere's what he had to say about today's visit.", "2019-08-07T19:33:27.000Z": "With first responders in #Dayton today. @realDonaldTrump and @FLOTUS visited the shooting victims, their families, medical staff and first responders at Miami Valley Hospital.", "2019-08-06T20:58:26.000Z": "Toni Morrison, the award-winning author and daughter of #Ohio died yesterday.  She inspired millions with her brilliant writing and thought-provoking words.  Her powerful voice will live on through her books and plays.", "2019-08-03T18:27:28.000Z": "It's the final weekend of the @OhioStateFair . This morning I attended pig and cattle shows.  The kids did a great job!  There is a lot going on today!  It's a beautiful day - come on out! #OhioFindItHere", "2019-08-02T16:36:17.000Z": "Congratulations to the Hamilton West Side Little League Baseball @wslloh on winning the Ohio Little League State Tournament. Best of luck as you take on Indiana in the Great Lakes Regional of the Little League World Series Tournament this weekend.", "2019-08-01T12:24:36.000Z": "Fran and I have been enjoying the #OhioStateFair ! She has been making pizzas with kids at the Taste of Ohio Cafe on the fairgrounds. This week her column has a recipe for pizza dough for you to try with your family! Fran's Favorites: Cooking fun at the fair - Xenia Gazette It's fair time!We have been having a great time at the Ohio State Fair! Mike and I have enjoyed walking through the barns and talking with kids about xeniagazette.com", "2019-07-31T15:07:36.000Z": "We are heartbroken over the news of the death of PFC Brandon Kreischer of Williams County. Fran and I are praying for his family.", "2019-07-30T20:15:57.000Z": "This morning @FranDeWine and I had breakfast with folks from Daybreak. Daybreak is the Miami Valley's only 24-hour crisis hotline and emergency youth shelter. They also provide many other services.", "2019-07-30T00:55:21.000Z": "Another great evening at the @OhioStateFair !  Dinner with family and then attending the @tobykeith concert. #OhioFindItHere", "2019-07-29T00:30:16.000Z": "And of course, no trip to the @OhioStateFair is complete without eating some fair food.  Tonight, we had corn on the cob and a candy apple! @FranDeWine  #OhioFindItHere", "2019-07-28T23:55:19.000Z": "Tonight, Fran and I walked through a couple of the animal barns and talked with some of the kids who are busy showing this week. It doesn't take long to see how passionate these young people! (PS - that's Sugar the pig resting behind us in the first photo)", "2019-07-28T15:12:55.000Z": "This morning after church, Fran and I visited our home county (Greene County) fair. We visited with Esther Pierson, the long time secretary of the fair who is retiring this year, and some of the kids who will be showing their 4-H animals. #OhioFindItHere", "2019-07-28T01:09:49.000Z": "And if you have questions about Medicaid - and all of its services and supports - please stop by the @OhioMedicaid booth and ask our knowledgeable team! #OhioFindItHere  #OhioStateFair", "2019-07-28T00:57:07.000Z": "As I mentioned - our state agencies have a lot of great booths with valuable information in the Bricker Building at the @OhioStateFair . If you stop by the Dept. of Public Safety booth, you can learn about the important work being done by the @Ohio_EMS  @Ohio_OIU and @Ohio_OHS", "2019-07-28T00:45:04.000Z": "And if your ready to play a game, stop by the @OhioBWC booth and play Safety Plinko. Answer a question about safety correctly, play plinko, and win a prize! #OhioFindItHere  #OhioStateFair", "2019-07-28T00:34:48.000Z": "Do you have questions about the new federal ID requirements if you want to fly starting in October 2020?  Then stop by the @Ohio_BMV table!  They can answer all your questions and make sure you're compliant. #OhioFindItHere  #OhioStateFair", "2019-07-28T00:24:23.000Z": "And if you're at the Dept. of Public Safety booth, stop by the @Ohio_EMA table. You can check out a safe room. A safe room provides protection to people during a tornado or wind storm. You can also put your (small) pets in there with you! #OhioFindItHere  #OhioStateFair", "2019-07-28T00:11:32.000Z": "Do you have unclaimed funds? Stop by the @OhioCommerce booth and find out!  It's amazing how many people have money waiting for them and they don't even know it!  It takes less than a minute to check. #OhioFindItHere  #OhioStateFair", "2019-07-27T23:57:15.000Z": "If you're at the @OhioStateFair this week, stop in the Bricker Building. Many of our state agencies have booths w/ valuable information! If you stop by @ODOT_Statewide , they will show you how to get real time traffic updates on your phone. And pick up a state map! #OhioFindItHere", "2019-07-26T21:07:51.000Z": "This afternoon I met some pickleball players at the #OhioStateFair . #OhioFinditHere .", "2019-07-26T10:48:25.000Z": "Good morning from the #OhioStateFair ! I visited with families doing morning chores in the dairy barn.", "2019-07-26T02:01:56.000Z": "Nothing better after a fun at the fair then sitting around the campfire... #OhioStateFair  #ohiofindithere", "2019-07-26T01:07:24.000Z": "The grandkids love the giant slide! #OhioFindItHere  #OhioStateFair", "2019-07-26T00:22:11.000Z": "There's always room for ice cream! #OhioFindItHere  #OhioStateFair", "2019-07-25T22:54:23.000Z": "This afternoon we visited the #ODNR park on the #OhioStateFair grounds. I planted a native Red Oak tree with granddaughters Rebecca and Jeanie and other young helpers. And we talked to #SmokeyBear ! #OhioFinditHere .", "2019-07-25T19:00:28.000Z": "I enjoyed my visit with my friends from the building trades today. My grandkids loved putting their hands in cement! Thanks for all of your hard work!", "2019-07-25T14:30:04.000Z": "We are having a Cabinet meeting this morning at the Ohio FFA Center at the #OhioStateFair . Our Cabinet members are paired with FFA students from across the state. #OhioFinditHere .", "2019-07-24T15:06:26.000Z": "Today is opening day of the @OhioStateFair !", "2019-07-20T17:57:31.000Z": "https:// xeniagazette.com/news/42198/fra ns-favorites-remembering-mans-walk-on-the-moon  .  Fun recipes from @FranDeWine for your family to try with a moon landing theme. Fran's Favorites: Remembering man's walk on the moon - Xenia Gazette I think everyone over 50 remembers where they were on July 20, 1969!Mike had just graduated from Miami University and we were living in an old farm house n xeniagazette.com", "2019-07-20T16:58:09.000Z": "It's really hot across Ohio. Here are some pictures of snow plow trucks to help cool you down.  #OHwx", "2019-07-20T12:20:51.000Z": "Today is the 50th anniversary of Ohioan Neil Armstrong's historic achievement as the first man to walk on the moon.  On that day in 1969, millions of Americans were glued to their televisions and watched with awe this amazing achievement.", "2019-07-18T15:05:51.000Z": "Today I signed the state's operating budget that invests in #Ohio 's kids, water quality, workforce development, recovery, and education, and provides significant tax relief for taxpayers and regulatory relief for businesses. #OHBudget", "2019-07-18T12:32:18.000Z": "Extreme heat will blanket Ohio in the coming days. These extreme temperatures can be life-threatening. Remember these tips: \nFind air conditioning.\nAvoid strenuous activities.\nCheck on family members & neighbors.\nDrink plenty of fluids.\nRead more: https:// ready.gov/heat GIF", "2019-07-16T13:11:12.000Z": "It was great being with you all this morning!  Thanks for the great questions, and enjoy the rest of your week! Quote Tweet OhioOOD @OhioOOD Thank you for coming @GovMikeDeWine ! Show this thread", "2019-07-14T18:55:35.000Z": "The second sculpture at @ArmstrongSpace is of Armstrong as an adult.  They are truly incredible. Here we are with Neil's son Mark and the sculptor Chas Fagan. #firstonthemoon  #onesmallstep  #ohiofindithere", "2019-07-14T18:48:21.000Z": "Great to be in #wapakoneta this morning at the @ArmstrongSpace as they unveiled two statues of Neil Armstrong. The first one depicts Armstrong as a kid. #firstonthemoon  #onesmallstep  #ohiofindithere", "2019-07-09T11:07:47.000Z": "\"The greatest state ever.\"  We agree, Pete! Congratulations to you and everyone who participated in the all-star home run derby last night. #cleveland  #ohio  #OhioFindItHere Quote Tweet clevelanddotcom @clevelanddotcom Pete Alonso, your 2019 Home Run Derby Champion, referred to Ohio earlier on Monday as \"the greatest state ever.\" His parents are from there as is his second cousin, who pitched to him in the Derby. Photo: AP.", "2019-07-07T22:50:13.000Z": "Congratulations #Cincinnati 's own @roselavelle and the @USNWT on winning the #WorldCup19 !", "2019-07-04T11:09:47.000Z": "Wishing everyone a Happy 4th of July! Whether you are grilling, hanging out by a pool or watching fireworks this evening I hope everyone has a great Independence Day!", "2019-07-02T21:57:17.000Z": "Did you know the Outdoor Writers of Ohio maintain the Ohio record fish list?  The largest walleye caught in Ohio occurred on Lake Erie in 1999 and weighed in at over 16 pounds! #BigFish  #OhioFinditHere", "2019-07-02T14:30:25.000Z": "This is the 40th consecutive Fish Ohio Day that the Governor and Legislators have participated in to promote Lake Erie and fishing in our state. We are fortunate to have such a wonderful resource! #OhioFinditHere", "2019-07-02T14:13:42.000Z": "We are fishing this morning with Captain Jerry Coolidge.  He is this year's Lake Erie Charter Boat Association's Captain of the Year!  He has fished Lake Erie for over 40 years and has been a licensed captain for more than 30! #OhioFinditHere", "2019-07-02T12:53:48.000Z": "The fish are biting this morning on Lake Erie! #ohiofindithere", "2019-07-02T11:19:20.000Z": "Spending the day with family, legislators, outdoors writers, and our outstanding Lake Erie Charter Boat Captains to promote some of the best fishing in the country! #walleye  #perch  #Ohiofindithere  #LakeErie", "2019-06-29T12:25:49.000Z": "A great morning with the athletes competing in the Special Olympics Ohio State Games! @SOOhio  #SOOHSG19", "2019-06-24T22:00:14.000Z": "This afternoon we opened a beautiful new Welcome Center at Hocking Hills State Park!  You will definitely want to check this out the next time you visit.  And we got a hike in before the rain started. #findithere", "2019-06-22T16:16:16.000Z": "We are fortunate to live in a state with so much to see and do.  Yesterday, Fran and I took our grandson Parker to the @ColumbusZoo  #findithere", "2019-06-22T01:00:09.000Z": "Its @ohiodnr night at the @CLBClippers game, so we stopped by. I even heard that Director Mertz threw out the first pitch!", "2019-06-21T23:03:57.000Z": "Our grandson Parker at the @ColumbusZoo on #WorldGiraffeDay  #findithere", "2019-06-21T22:15:56.000Z": "We are at the @ColumbusZoo on #WorldGiraffeDay ... #findithere", "2019-06-19T17:35:54.000Z": "Sharing link to article by @ocj_ohioagnet Gov. DeWine makes NW Ohio farm visit:  I can't remember a situation bad as this via @ocj_ohioagnet Gov. DeWine makes NW Ohio farm visit: I can't remember a situation bad as this By Dale Minyo and Joel Penhorwood Ohio Governor Mike DeWine, alongside Director of Agriculture Dorothy Pelanda, made a special trip to northwest Ohio Wednesd ocj.com", "2019-06-13T21:46:16.000Z": "It's always fun stopping by @OhioBBS The students are great and ask a lot of good questions. I hope they enjoy the rest of their time at @miamiuniversity work", "2019-06-10T16:06:40.000Z": "Did you feel that rumble this morning Cleveland? Well if you missed it, we caught this morning's earthquake on multiple #OHGO cameras. Check it out! #Clevelandreallyrocks", "2019-06-09T17:45:33.000Z": "Wapakoneta is one of @SmithsonianMag 15 best small towns to visit in 2019! #moonlanding Quote Tweet Smithsonian Magazine @SmithsonianMag Looking for summer road trip ideas: why not swing through Wapakoneta, Ohio? The hometown of Neil Armstrong-the first person to walk on the moon-is honoring their American hero and 50th anniversary of Apollo 11 with events all year long. http:// ow.ly/4XNe50uz6jt", "2019-06-08T17:24:33.000Z": "I stopped by @NWTF_official (Ohio) Jakes Day at Cowan Lake. What a great way to get kids interested and active in the outdoors!  My grandkids especially enjoyed the archery.", "2019-06-08T17:09:46.000Z": "Governor @MikeDeWine wants to remind Ohioans that there is a fishing lake 30 min away. #optoutside  https:// instagram.com/p/BydFAF5gzFh/", "2019-06-08T16:12:39.000Z": "A great morning on Cowan Lake with Sen. and Patti Uecker, Sen. Peterson, and Rep. Wilkin!  We caught a LOT of fish!", "2019-06-08T15:46:20.000Z": "Patti Uecker caught this BIG white bass! #fishohio  #cowanlake", "2019-06-08T14:54:18.000Z": "The fish are biting at Cowan Lake!", "2019-06-08T12:09:20.000Z": "A beautiful morning for fishing at Cowan Lake. #ClintonCounty", "2019-06-06T00:09:52.000Z": "Today, I had the honor of meeting Robert Morrison (and many members of his family!).  Robert turns 100 on June 8 and is one of the oldest living WWII veterans in our state.", "2019-06-01T16:59:58.000Z": "Look! I made the paper!  @DispatchAlerts  @AbbeyMarshall", "2019-06-01T21:39:01.000Z": "I have ordered the flags lowered to half staff at all public buildings in accordance with the orders issued today by the President of the United States. They will remain lowered until sunset on June 4, 2019 to honor the victims of the tragedy at Virginia Beach, VA.", "2019-06-01T19:37:18.000Z": "Our grandson Brian came in 8th in the 3200 at the state track and field championships today.  He ran at Jesse Owens track at The Ohio State University.", "2019-05-30T16:31:20.000Z": "Sad to learn that former U.S. Senator Thad Cochran of Mississippi has died. . @FranDeWine and I extend our sincere condolences to his family and friends.", "2019-05-30T16:22:25.000Z": "Got to meet 4th graders from @altondarby in Hilliard and Discovery School in Mansfield with . @LtGovHusted and show them my office!", "2019-05-30T11:25:54.000Z": "https:// afmc.af.mil/News/Article-D isplay/Article/1860013/air-force-confirms-wright-patterson-afb-to-host-f-35-support-organization/  Good news for #Dayton . Air Force confirms Wright Patterson AFB to host F-35 support organizat WRIGHT-PATTERSON AIR FORCE BASE, Ohio -  Outgoing Secretary of the Air Force Heather Wilson has confirmed the selection of Wright Patterson Air Force Base, Ohio to host the F-35 Hybrid Product Support afmc.af.mil", "2019-05-28T22:29:08.000Z": "Thanks . @OHdeptofhealth and . @ODOT_Statewide for your work helping your fellow Ohioans by getting water to #Dayton . Quote Tweet Ohio Dept of Health @OHdeptofhealth With help from our partners at @ODOT_Statewide , ODH has begun the process of transporting about 30,000 gallons of bottled water from our Columbus warehouse to Dayton in case it's needed by residents affected by power outages. #OhioTornado", "2019-05-28T20:11:05.000Z": "Toured hard-hit Montgomery County with @FranDeWine and .Ohio Lt. Governor . @LtGovHusted .  Ohioans are resilient and helping each other out after these awful storms.", "2019-05-28T19:35:59.000Z": "Fran and I went to Celina today to see the damage from the tornado.   It is hard to describe the damage.", "2019-05-27T16:42:24.000Z": "Our grandson Theo putting flowers on the graves of Denis and Mary DeWine, who were the first DeWines to come from Ireland to the U.S.  Denis and Mary DeWine are his (and his cousins and brother's) great, great, great, great grandparents!", "2019-05-27T16:20:33.000Z": "Today we honor our service men and women who made the ultimate sacrifice for our country. @FranDeWine & I were honored to participate in the Governor's Wreath Laying Ceremony where we remembered the brave Ohioans and their families who made the ultimate sacrifice.", "2019-05-26T23:11:00.000Z": "Congratulations to the citizens of Dayton and the Miami Valley for coming together yesterday. They made it clear clear we stand against hate. Thanks to Mayor @nanwhaley , local officials, and law enforcement for your leadership, planning, and work to keep people safe.", "2019-05-25T01:00:30.000Z": "Congratulations to our grandson Michael who graduated from Elon University today!", "2019-05-23T11:53:34.000Z": "Congrats to the @ToledoWalleye on winning the Western Conference and advancing to the Kelly Cup finals! #GoWalleye", "2019-05-19T19:07:08.000Z": "And congratulations, Annie!", "2019-05-19T19:06:42.000Z": "Congratulations, Caroline!", "2019-05-19T18:31:11.000Z": "Yesterday, our grandson Brian qualified for Regionals in the 3200.", "2019-05-16T17:06:49.000Z": "It's great having Big Brothers Big Sisters at the @OhioStatehouse today!  There are drums and a lot of laughter - you can tell they are having fun today!", "2019-05-13T22:19:15.000Z": "Today I met students from @Raymond_Elem and gave them a tour of my #Statehouse office. #RaymondRoars", "2019-05-12T16:56:54.000Z": "https:// 10tv.com/article/inside -governors-mansion-first-lady-fran-dewine-2019-may  Happy Mother's Day! Below is a link to a story on @FranDeWine - Ohio's First Lady and my best friend. Fran is the mother of our eight children and grandmother to our 24 grandchildren! \n\nThanks to all mothers for what you do every day for Ohio's families. Inside the Governor's Mansion with First Lady Fran DeWine", "2019-05-10T19:32:08.000Z": "Today I joined @OHEducationSupt Paolo DeMaria and Columbus Zoo and Aquarium President and CEO Tom Stalf to highlight In-Demand Jobs Week. The Zoo's Edge Program allows high school students who work there to earn the OhioMeansJobs Readiness Seal.", "2019-05-10T13:12:34.000Z": "Kicking off the 83rd District Bus Tour w/ freshman legislators to learn about my communities in NW Ohio.  Follow us today #83DistrictTour  @OHRGOPCaucus  @OHHouseDems  @SusanManchester  @DonJonesOhio  @tupchurch216  @HarazGhanbari  @Juanita_Brent  @Russo4Ohio  @joncrossoh @CaseyforOhio", "2019-05-06T17:03:00.000Z": "At the #Cincinnati Museum Center for the opening of the #NeilArmstrong exhibit.", "2019-05-04T21:23:12.000Z": "Per a 2015 article in the @courierjournal , only one Kentucky Derby winner was born in Ohio - Wintergreen in 1909. #DerbyDay", "2019-04-30T19:39:02.000Z": "Before deciding to launch a new building, @amazon said there was a variety of contributing factors that went into their decision - including customer demand, a dedicated workforce, and great local support. I am proud that Amazon can now call Ohio home! Amazon's 1,000-plus jobs leads these area companies expecting growth in 2019 journal-news.com", "2019-04-29T12:01:32.000Z": "#OTD in 1865, the funeral train for Pres. Abraham Lincoln arrived in Columbus. Lincoln's casket was taken to the Ohio Statehouse where he laid in state. The Statehouse was draped in black crepe for the occasion, and thousands of visitors came to honor the fallen President.", "2019-04-27T14:48:00.000Z": "First Lady @FranDeWine giving her opening remarks to kick off the 2019 #OhioanaBookFestival !", "2019-04-27T16:37:56.000Z": "It was great to be in Meigs County this morning as they celebrate their Bicentennial!", "2019-04-27T15:25:51.000Z": "We're marching from Pomeroy to Middleport today in the Meigs Bicentennial Parade. Happy 200th birthday, Meigs County!", "2019-04-25T23:34:45.000Z": "Blue Jackets. Round 2. Let's go! #CBJ  #NHLPlayoffs", "2019-04-24T23:42:46.000Z": "It's been 100 days since I took office & we are delivering on our promise to #KeepOhioMoving !", "2019-04-24T12:22:40.000Z": "As we look back on the first 100 days of the DeWine Administration, Ohio's community colleges want to thank Governor @MikeDeWine , Lt. Governor @JonHusted and @OhioHigherEd Chancellor Randy Gardner for a great start!", "2019-04-20T10:57:29.000Z": "Theo helping Fran make biscuits this morning! #breakfast", "2019-04-18T18:18:56.000Z": "Happy Birthday to three outstanding #Ohio public servants . @boblatta , . @RobertCSprague , and @FrankLaRose !", "2019-04-17T02:22:30.000Z": " #CBJ  #WeAreThe5thLine", "2019-04-16T23:06:44.000Z": "#NHLPlayoffs are back at @NationwideArena tonight.  Let's go, @BlueJacketsNHL ! #CBJ", "2019-04-15T01:56:33.000Z": "Great win tonight, @BlueJacketsNHL !", "2019-04-14T22:53:21.000Z": "Let's Go, @BlueJacketsNHL ! #CBJ  #WeAreThe5theLine", "2019-04-14T21:42:04.000Z": "RIP country music star and Portsmouth, Ohio native Earl Thomas Conley who died this week in Nashville.", "2019-04-13T19:56:57.000Z": "Fran and I loved hosting an Easter Egg Roll this morning at the Residence!", "2019-04-10T00:37:10.000Z": "I enjoy seeing all the groups taking @OhioStatehouse tours!  It was great seeing students from @WHSCane today! Quote Tweet Doug Cooper @CoopWHS Thanks @GovMikeDeWine for stopping by @WHSCane tour of the @OhioStatehouse", "2019-04-10T00:33:25.000Z": "I ran into some @CentralState87 students today at the Statehouse. #marauders", "2019-04-04T17:11:20.000Z": "I always enjoy running into school groups at the #OhioStatehouse . These students are from Grace Christian School in Blacklick.", "2019-03-28T21:56:06.000Z": "Enjoying the @Reds game with some of our family! #OpeningDay2019", "2019-03-28T18:18:09.000Z": "You run into lots of fun people at the @Reds Opening Day Parade - including @JohnnyBench_5", "2019-03-28T17:42:49.000Z": "Always good to see my friend, Vice-Mayor @voteSmitherman", "2019-03-28T15:43:49.000Z": "Governor @MikeDeWine speaking with @JohnnyBench_5 at @FindlayMarket 100th Opening Day Parade. #FindlayMarket", "2019-03-28T15:02:22.000Z": "It's @Reds Opening Day!  And at today's game they recognizing sailors from the USS Cincinnati.", "2019-03-27T18:27:34.000Z": "Today . @MattDeWine and students from @MiamiOH_GRN came to my Riffe Center office. They are in Columbus learning more about state government.", "2019-03-26T21:04:07.000Z": "Today I met with students from  . @MiamiOH_GRN who were visiting the Statehouse. Our grandson . @MattDeWine was part of the group! #LoveandHonor", "2019-03-23T15:31:58.000Z": "Cousins enjoying being with each other this morning! #familytime", "2019-03-22T00:04:22.000Z": "Great to have a former Flyer back on campus tonight! Thank you Lt. Governor Jon Husted for speaking to the team. @LtGovHusted  #GOTGRIT  #UDFLYERS", "2019-03-21T15:59:07.000Z": "https:// dayton.com/lifestyles/ohi o-gov-mike-dewine-wooed-this-woman-with-whitman-chocolates-when-they-were-and-worked/v5GZQF73zQECPtVTRHlISN/  Take a listen to a podcast that @FranDeWine did with host @DDNSmartMouth . Ohio Gov. Mike DeWine wooed this woman with Whitman's chocolates when they were 12... and it worked \"What Had Happened Was\" host Amelia Robinson sits down with Ohio First Lady Fran DeWine to talk about her 50-year marriage to Gov. Mike DeWine, how he stole her heart with chocolates and how she... dayton.com", "2019-03-18T00:20:51.000Z": "Tonight, @FranDeWine gets to read to Theo and Desi...", "2019-03-17T23:44:25.000Z": "Congrats to @OhioStateHoops and @GoBearcatsMBB on making the NCAA tournament. #MarchMadness", "2019-03-17T23:35:28.000Z": "Congrats to @fccincinnati on the win! Quote Tweet FC Cincinnati @fccincinnati FT - #CINvPOR", "2019-03-17T12:35:23.000Z": "Top o' the mornin' to ya!", "2019-03-15T20:24:06.000Z": "Please help us congratulate Colonel Paul A. Pride, our 18th superintendent, for his three decades of service to the Ohio State Highway Patrol and the citizens of Ohio.", "2019-03-15T01:04:05.000Z": "It is Pi day! Look what @FranDeWine made! Janet Voinovich's buttermilk pie and a blueberry pie.", "2019-03-14T11:16:02.000Z": "Happy Pi day from our family to yours!", "2019-03-13T01:51:42.000Z": "I'd like to see Ohio add 30 drug/specialty courts.  I spent some time today with Judge Durkin - he started Mahoning County's drug court 20 years ago.", "2019-03-10T14:00:00.000Z": "Take a tour of the #OhioStatehouse this weekend! Today, tours begin at 12, 1, 2 and 3 p.m. in the Map Room. #LifeInCbus  #AsSeenInOhio  #CapitolSquare  #Columbus  #Ohio  #Cbus  #OhioHistory  #CivicsEducation  #AmericanRepublic  #Museum  #Constitution  #art", "2019-03-10T00:19:04.000Z": "It's always fun seeing my friend Mike Budzik. #wildgamedinner", "2019-03-09T23:30:05.000Z": "A full plate at tonight's wild game dinner!  The food is outstanding!", "2019-03-09T22:54:50.000Z": "I'm at a Wild Game dinner in Logan tonight and students in the @HockingCollege culinary arts program are helping prepare the food.", "2019-03-09T21:13:48.000Z": "Great win for the Crew! Quote Tweet Columbus Crew SC @ColumbusCrewSC Quieted that Revolution  #NEvCLB | #Crew96 | 0-2", "2019-03-08T20:45:13.000Z": "I also met with @CincyAAChamber to talk about the resources they can provide to small businesses and how we can work together.", "2019-03-08T19:46:17.000Z": "I'm in Cincinnati today.  I had a great meeting with Mayor @JohnCranley", "2019-03-08T01:52:12.000Z": "Today, I also had the privilege of swearing-in Charlie Norman as Registrar of the @Ohio_BMV", "2019-03-07T22:07:29.000Z": "Congratulations to Chad Readler and Eric Murphy on being confirmed to the Sixth Circuit Court of Appeals.  Eric was state solicitor when I was Ohio Attornry General.", "2019-03-07T16:43:06.000Z": "At my cabinet meeting this morning, I swore in Lt. Col. Richard Fambro as the 19th Superintendent of the @OSHP .  Fambro will replace Col. Paul Pride who retires on March 15.", "2019-03-06T17:26:15.000Z": "It's Nurses Day at the Ohio Statehouse. Thank you @OhioNursesAssoc for giving me an opportunity to thank nurses for all they do!", "2019-03-05T16:27:06.000Z": "Pre #SOTS with my family showing them the \"bingo card\" that @jpelzer created. Clever!", "2019-03-05T16:18:51.000Z": "Gave a tour of the office to some family members before the State of the State.", "2019-03-04T00:36:31.000Z": "Nice to have Mark, Becca, Theo, and Desi with us this weekend.  Mark took this picture of me reading to Theo. Note the picture above is me holding Mark!", "2019-03-02T22:06:51.000Z": "Theo helping his grandmother make rolls. Good need for all of us in the family!", "2019-02-28T22:20:58.000Z": "On #NationalChiliDay , here is my son John's recipe for venison chili!", "2019-02-27T15:23:17.000Z": "At Great American Ballpark this morning to speak at a Cristo Rey event.  I love the Cristo Rey school model!   We employ some of these great kids. One month and a day from now I will be back here for @Reds Opening Day!", "2019-02-24T22:52:46.000Z": ". @FranDeWine and I are in Washington, D.C. for meetings with fellow governors.  We are headed to the White House for a dinner.", "2019-02-21T21:36:06.000Z": "I support the #Ohio General Assembly's efforts to fix this drafting error. Quote Tweet Buckeye Firearms Association @BuckeyeFirearms ICYMI: Ohio General Assembly introduces emergency fix for Shockwave error: https:// tinyurl.com/yxvajgwl", "2019-02-21T01:32:24.000Z": "It's #NationalCherryPieDay - a day celebrating one of my favorite desserts! Here is @FranDeWine 's recipe.", "2019-02-20T01:22:57.000Z": "Great to be with several of the clerk of courts today!", "2019-02-19T11:44:56.000Z": "Fran and I had a great time at the Clinton County Lincoln Day Dinner last night.  In addition to seeing many of our longtime friends, I had the pleasure of presenting an award to former Sheriff and County Commissioner Patrick Haley for his 50 years of public service!", "2019-02-19T01:22:00.000Z": "Today is my Dad's birthday.  He loved baseball, and during his life February 18th was usually the day pitchers and catchers reported for spring training.  He thought that was a great birthday present!  I miss him.  He would have been 96 today.", "2019-02-18T12:12:49.000Z": "Fran & I were saddened to hear of the passing of Tony Petkovsek. Tony was America's \"Polka Ambassador.\" His daily two-hour polka radio program ran 6 days a week for 50 years! We got to know Tony through our good friends, George & Janet Voinovich. He will be greatly missed by many", "2019-02-15T21:05:27.000Z": "Our prayers are with our friends in India. Quote Tweet U.S. Embassy India @USAndIndia Statement from @WhiteHouse  @PressSec on the #KashmirTerrorAttack", "2019-02-14T22:47:45.000Z": "Happy #Valentine 's Day to @FranDeWine .  I first gave her a Whitman's Sampler in the sixth grade, and I gave her another one just after I was sworn in as Governor.", "2019-02-12T23:13:50.000Z": "I ended my day with a visit to @HockingCollege .  Thank you to President Young and all of the students and faculty who talked with me about some of the exciting things going on at their school, including some of the workforce initiatives. #hockinghawks", "2019-02-12T22:53:19.000Z": "Thank you to Minford Elementary for inviting me to stop by. The students are celebrating #KindnessWeek so I read a book about kindness to several of the first grade classes. Principal McGraw also talked with me about the investment they are making in social emotional learning.", "2019-02-12T19:05:08.000Z": "After visiting @ShawneeState , I grabbed lunch at the Scioto Ribber. #Portsmouth", "2019-02-12T18:42:48.000Z": "It was great to be at @ShawneeState this morning.  We discussed early childhood education, first-generation college students, and then had a showcase by the engineering technologies program. #gobears", "2019-02-10T20:31:10.000Z": "With @FranDeWine at the Auglaize County Courthouse.", "2019-02-10T19:07:37.000Z": ". @FranDeWine and I were in Auglaize County today for the 125th celebration of the courthouse, and we took grandkids to the Armstrong Air and Space Museum.", "2019-02-10T14:43:39.000Z": "Today is our daughter Becky's birthday; she would have been 48 today.  She was killed in a car accident in 1993, when she was just 22.  We miss her every day.   \n\nBecky was just starting a career in journalism when she died.", "2019-02-09T23:43:19.000Z": "Today is my Aunt Mickey's birthday. She is pictured here peeling apples in our kitchen helping Fran get ready for our Ice Cream Social. She helped me all my life. She was the last to die in my Dad's family, and I miss her a lot.", "2019-02-09T12:54:01.000Z": "Yesterday @FranDeWine and I attended the Call to Duty Ceremony of the @OHNationalGuard Company B, 638th Support Battalion in North Canton. We are grateful for their service, and the support from their families. Emotional sendoff: Ohio National Guard soldiers prepare to deploy to Kuwait NORTH CANTON, Ohio - An emotional sendoff was held Friday morning for about 110 Ohio National Guard soldiers who are deploying to Kuwait. Ohio Governor Mike DeWine and other officials attende fox8.com", "2019-02-07T22:53:02.000Z": ". @FranDeWine and I visited @OhioHistory today.  Archivists showed us pictures of the 1969 moonwalk by Ohioan Neil Armstrong and the 1974 Xenia tornado.", "2019-02-06T19:25:36.000Z": "Pleased to announce appointment of retired Colonel Joe Zeis as Senior Advisor for Aerospece and Defense. https:// daytondailynews.com/business/break ing-colonel-from-dayton-area-named-news-state-level-military-cabinet-position/zUpcDW1xfx9A5cQsBI1grO/ ", "2019-02-05T15:06:10.000Z": ". @FranDeWine featured in this story. Meet Ohio's pie-baking, Bible-holding first lady - one of the governor's closest advisers Ohio's new first lady has years of experience advising Gov. Mike DeWine - and baking pies. cincinnati.com", "2019-02-03T18:52:25.000Z": "Today I have ordered that flags of the U.S. and Ohio be lowered to half staff at the #OhioStatehouse and Clermont County in honor of the service of Officer Bill Brewer until sunset the day of his interment.", "2019-02-03T16:33:56.000Z": ". @FranDeWine and I are heartbroken to learn of the death of Officer Bill Brewer and injury to Officer Nick DeRose in the line of duty.  Please keep their families and @ClermontSheriff in your thoughts and prayers.", "2019-02-02T20:30:17.000Z": ". @FranDeWine and I watched our grandson, Brian, run the mile at Cedarville University this afternoon.", "2019-01-28T22:50:31.000Z": "Fran DeWine wears Janet Voinovich-designed Ohio 'first lady' pin with pride From inauguration night into the morning of Jan. 15, the Governor's Residence in Bexley was filled with laughter, music and family. Children dressed in pajamas ran through Grandma and Grandpa's... dispatch.com", "2019-01-24T17:34:38.000Z": "And you thought the story was the 9 Bibles ... check out my dad @MikeDeWine 's inaugural socks!", "2019-01-25T01:02:39.000Z": "Happy Birthday to our son, Mark! He is pictured below with his niece, @izzyydarling", "2019-01-23T13:00:56.000Z": "Coming up at 8:05 a.m. I'll be live with @hughhewitt discussing my priorities for #Ohio .", "2019-01-21T23:45:22.000Z": "As I reflect on the life of Dr. Martin Luther King, Jr. today, I am reminded of these wise words he once wrote. One element of equal opportunity is a solid educational foundation, and I will work hard to ensure that opportunity exists for every #Ohio child. #MLKDay", "2019-01-21T17:27:48.000Z": "I was honored to speak this morning at the annual Dr. Martin Luther King, Jr. Breakfast held by the Martin Luther King Breakfast Committee, Inc. in Columbus. #MLKDay", "2019-01-19T23:27:10.000Z": "Director Jack Marchbanks and @ODOT_Columbus plow driver Terrell Danial at the Westerville Garage as crews begin their 6pm shift. Please pay extra attention around our plows so Terrell and all of our other drivers make it home safe. #ODOTwinter", "2019-01-19T00:07:14.000Z": ". @FranDeWine and Steven and I helped Young's Jersey Dairy celebrate their 150th anniversary today! Steven had a chocolate cone, Fran butter pecan, and I had strawberry. Fran and I would take her brothers and sisters there when we were dating in high school.", "2019-01-18T21:32:39.000Z": "Here are some pictures of our new grandson Tadhg Jack Dudukovich.", "2019-01-17T22:22:40.000Z": ". @FranDeWine and I are thrilled to announce the birth of our grandson, Tadhg Jack Dudukovich. He is the son of our daughter, Alice, and her husband, Nick. Tadhg (pronounced Tyg like tiger) is an old Irish name. The DeWine side of the family is Irish.", "2019-01-16T13:24:57.000Z": "Looks like . @FranDeWine and I will have a new grandson today! Our daughter, Alice, is in labor.", "2019-01-15T20:18:49.000Z": "#ReadyToLead", "2019-01-15T16:28:07.000Z": "If breakfast is the most important meal of the day,  I definitely started my second day as governor off right! Steve Evans, son of Bob Evans of @BobEvansFarms , came to our home this morning to cook our family breakfast using his mother's original sausage recipe!", "2019-01-14T17:54:15.000Z": "May God bless America, and may God bless #Ohio ! #OhioInaugural", "2019-01-14T17:53:24.000Z": "Family is everything. Education is key to equality & opportunity. And everyone - no matter where they were born or who their parents are - deserves the chance to succeed, to get a good-paying job, to raise a family comfortably, and to be secure in their future. #OhioInaugural", "2019-01-14T17:51:05.000Z": "We will be fierce and passionate advocates and defenders of the defenseless. We will bring people together. We will seek out many opinions and ideas. We will work hand-in-hand with local government and community leaders. #OhioInaugural", "2019-01-14T17:49:17.000Z": "all will be undertaken in the faith, hope, and confidence that these children will flourish and grow and that their lives will be forever changed by the things that we do. #OhioInaugural", "2019-01-14T17:49:16.000Z": "Our plans to intervene early in the lives of at-risk kids, to address their physical and emotional needs, and to give them better, higher quality educational opportunities #OhioInaugural", "2019-01-14T17:47:28.000Z": "Over the next four years, I will be asking the people of #Ohio and the General Assembly to do things where the results will not be immediate, but where they will be profound, and where they will endure. #OhioInaugural", "2019-01-14T17:43:27.000Z": "I will be the Governor for all the people of #Ohio - and I will remember each and every day that I am their servant. #OhioInaugural", "2019-01-14T17:42:00.000Z": "We are united in our love for and our pride in this wonderful state, with its rich history, abundant natural wonders, and good and decent people. #OhioInaugural", "2019-01-14T17:40:54.000Z": "We are united in our resolve to end the #OpioidCrisis . We are united in our desire to preserve and protect our magnificent Lake Erie. #OhioInaugural", "2019-01-14T17:38:59.000Z": "Today, we are united as Ohioans. We are united in our passion and commitment to ensuring that all of our children lead meaningful, fulfilling lives. #OhioInaugural", "2019-01-14T17:37:50.000Z": "Thank you for your deep love of #Ohio - our great state that you all have had the privilege to lead. #OhioInaugural", "2019-01-14T17:37:49.000Z": "I am honored that several former #Ohio Governors are here for today's ceremony. Gov. @JohnKasich , Gov. @Ted_Strickland , Gov. Bob Taft, & Gov. Celeste: It means a great deal to me that you are here to share in this historic occasion. #OhioInaugural", "2019-01-14T17:34:46.000Z": "#OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-14T17:13:37.000Z": "#OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-14T16:57:25.000Z": "Great music from @MUGleeClub to begin today's #OhioInaugural ! #DeWineHusted  #FaithFamilyFriends", "2019-01-14T14:13:49.000Z": "This is the stunning view of the @OhioStatehouse from the cupola. My ceremonial swearing in will take place here at noon, and it promises to be a momentous ceremony. You'll be able to watch it live here: http:// ohiochannel.org/live/special-e vents ", "2019-01-14T05:31:00.000Z": "Moments ago, I was sworn in during a ceremony at my Cedarville home. My son @PatDeWine gave the oath as my hand rested atop nine family Bibles held by First Lady @FranDeWine .  I'm proud to be your Governor and am ready to do what it takes to make #Ohio thrive. #OhioInaugural", "2019-01-14T04:51:33.000Z": "Right now I am preparing to take the oath of office from my home in Cedarville. You can watch the ceremony - which starts at midnight - here: http:// ohiochannel.org/live/special-e vents   #OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-14T01:45:19.000Z": "Tonight we planted a White Oak to commemorate the 2019 #OhioInauguration .", "2019-01-13T23:12:47.000Z": "Today was a wonderful day! Thank you to @AFmuseum and all the volunteers who made #FamilyDay a success! Next up: The #OhioInaugural on Monday! #DeWineHusted  #FaithFamilyFriends", "2019-01-13T21:27:05.000Z": "Great demonstration by the @ColumbusZoo today during #FamilyDay at @AFmuseum ! #OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-13T21:17:14.000Z": "#FamilyDay  #OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-13T20:13:14.000Z": "Today's #FamilyDay event at @AFmuseum is focused around science,  discovery, and fun! #OhioInaugural  #DeWineHusted  #FaithFamilyFriends  #STEM  #STEMEducation", "2019-01-13T19:45:08.000Z": "It was a joy to hear the All-Ohio State Fair Youth Choir sing today at #FamilyDay ! #OhioInaugural  #DeWineHusted  #FaithFamilyFriends  @FranDeWine  @AFmuseum", "2019-01-13T19:17:43.000Z": "Great meeting Bill at here at #FamilyDay ! He is a WWII #Veteran ! #OhioInaugural  #DeWineHusted  #FaithFamilyFriends  @AFmuseum", "2019-01-13T19:02:39.000Z": "Great turnout at #FamilyDay at @AFmuseum in #Dayton ! #OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-13T18:07:37.000Z": "#FamilyDay at @AFmuseum is happening now! Join us! This free event goes until 4pm! Lots of fun for the kids! @FranDeWine  #OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-13T15:02:00.000Z": "#OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-12T21:42:13.000Z": "Family Day at @AFmuseum is tomorrow! This free event, which happens just one day before the #OhioInaugural , will be fun for all ages and will feature #STEMEducation activities like virtual reality and flight simulator demos! See you there! More info: http:// bit.ly/2F9f36P", "2019-01-12T16:46:02.000Z": "#OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-12T03:51:23.000Z": "Tonight we're celebrating #Ohio innovation! With only a few days until the #OhioInaugural , we spent time with leaders who are using technology to help Ohio thrive and prosper. @JonHusted and I are ready to get to work to modernize the state! #DeWineHusted", "2019-01-11T21:55:47.000Z": "Our dog,Teddy, is getting ready for swearing in at this spot in our home  at midnight on Sunday night.", "2019-01-11T21:31:46.000Z": "#OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-10T17:24:57.000Z": "#OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-09T21:09:56.000Z": "I'm so excited to launch this learning toolkit with @OHEducation ! Students can have fun learning about the #OhioInaugural and be part of history! Quote Tweet Ohio Department of Education @OHEducation Gov.-elect @MikeDeWine has announced the release of Ohio's Inauguration Toolkit, developed in partnership with @OHEducation , featuring #OhioInaugural activities for students at various grades!\n\nFind the toolkit here: https:// bit.ly/2ANBFqD  #OhioEd", "2019-01-09T17:23:17.000Z": "#OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-09T15:44:04.000Z": "LIVE INTERVIEW: Ohio Gov.-elect DeWine highlights the challenges he expects to face while in office https:// buff.ly/2Ty0WvE", "2019-01-08T21:25:36.000Z": "I am happy to announce today that @JonHusted will be leading Ohio's initiatives on innovation, efficiency, workforce development and economic development. Quote Tweet Columbus Dispatch @DispatchAlerts Jon Husted will head new InnovateOhio office for Mike DeWine administration http:// bit.ly/2RemxN4", "2019-01-08T20:12:48.000Z": ". @JonHusted 's work has earned him the trust of Ohioans, the trust of the legislature, and he certainly has my confidence.", "2019-01-08T20:11:48.000Z": ". @JonHusted will also continue the Lt. Governor's oversight with the Common Sense Initiative - known as CSI. This program, founded under the previous administration and takes a detailed look at state regulations through the lens of how it impacts businesses and entrepreneurs", "2019-01-08T20:11:26.000Z": "I am also asking @JonHusted to help lead the Governor's Office of Workforce Transformation. The Office of Workforce Transformation has and will continue working to bring those two together to grow our economy, and deliver more opportunity to Ohioans.", "2019-01-08T20:10:24.000Z": "I am announcing today that I am officially naming Lt. Governor @JonHusted to serve as the Director of InnovateOhio Jon will work across state government - with each cabinet agency to create an innovative and more efficient government.", "2019-01-08T20:10:04.000Z": "Beginning next Monday, Lt. Governor @JonHusted will take a leadership role in several parts of our administration, all of which deal with providing better services to Ohioans at a lower cost, and making it possible for our workforce and economy to grow.", "2019-01-08T20:09:32.000Z": "As a former Lt. Governor, I feel I can say that I believe @JonHusted is the most experienced person to become Lt. Governor in my lifetime, and he is prepared to make a real contribution to our state in the coming years.", "2019-01-08T20:09:03.000Z": "Since announcing @JonHusted as my running mate in November 2017, I've been very clear: He will have a significant role in this administration.", "2019-01-08T16:30:33.000Z": "#OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-08T11:34:05.000Z": "Colerain police officer Dale Woods was doing his job at an accident scene when he was hit.  Fran and I send our condolences to his family and friends. Colerain police officer Dale Woods dies: 'Dale was born to be a cop' Colerain Police Officer Dale Woods was struck while on duty. cincinnati.com", "2019-01-07T22:45:49.000Z": "#SaveTheDate for Family Day at @AFmuseum in #Dayton on the 13th! I'll be there with @FranDeWine and our family, and we hope to see you too! The event is free and open to the public! RSVP: http:// bit.ly/2F9f36P  #OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-07T20:49:28.000Z": "Congratulations to Speaker @HouseholderOH .  Looking forward working with you and President @LarryObhof .", "2019-01-07T18:07:43.000Z": "#OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-06T20:12:34.000Z": "We hope to see you next Sunday! Quote Tweet Fran DeWine @FranDeWine A fun day visiting the @AFmuseum in #Dayton for a preview of next Sunday's Family Day! @MikeDeWine & I will be there, and we'd love to see you too! The event is free & open to the public! RSVP: http:// bit.ly/2F9f36P  #DeWineHusted  #FaithFamilyFriends  #OhioInaugural", "2019-01-06T15:53:26.000Z": "#OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-05T16:38:31.000Z": "#OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-04T20:48:17.000Z": "#OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-03T18:19:51.000Z": "#OhioInaugural  #DeWineHusted  #FaithFamilyFriends", "2019-01-03T15:18:07.000Z": "Dan McCarthy will begin serving as the Director of Legislative Affairs to the Governor this month. He most recently served as President of The Success Group where he was responsible for the firm's day-to-day business operations.", "2019-01-03T15:17:15.000Z": "Michael Hall will begin serving as Director of Policy to the Governor on January 14, 2019. He most recently served as the Policy Director for the DeWine-Husted for Ohio Campaign.  He previously served as my Director of Outside Counsel in the Ohio Attorney General's Office.", "2019-01-03T15:16:22.000Z": "I am also pleased to announce that Ryan Burgess will serve as my Director of Cabinet Affairs. He currently serves as the Director of the Governor's Office of Workforce Transformation where he has been tasked with developing Ohio's skilled and productive workforce.", "2019-01-03T15:15:49.000Z": "Jeff McClain is my nominee for Commissioner for @OhioTaxation . He is currently the Director of Tax and Economic Policy for the Ohio Chamber of Commerce, where he worked to achieve passage of the Municipal Income Tax changes in the most recent biennieum budget.", "2019-01-03T15:14:49.000Z": "My nominee to lead @DRCOhio is Annette Chambers-Smith. Annette served at the Ohio Department of Rehabilitation and Correction for over two decades, where she worked to create a more efficient environment in the department.", "2019-01-03T15:12:52.000Z": "I am nominating Kevin Miller to remain as executive director at @OhioOOD . He has led Opportunities for Ohioans w/ Disabilities since January 2011 and has done great work providing individuals with disabilities the services and support they need to attain and maintain employment.", "2019-01-03T15:10:51.000Z": "Today I am also nominating Lydia Mihalik to lead @OhioDevelopment as its director. Lydia is the current mayor of @CityOfFindlay and the first woman to hold Findlay's top post.", "2019-01-03T15:09:52.000Z": "I'm happy to announce today the nomination of Matthew Damschoder for Director of the Ohio Department of Administrative Services. He is currently the assistant Secretary of State and Chief of Staff for @OhioSOSHusted.", "2019-01-01T13:21:44.000Z": "", "2018-12-22T18:19:03.000Z": "Jeanie and cousin Theo helping @FranDeWine make cinnamon rolls!", "2018-12-21T03:01:00.000Z": "THIS. This is why the 1st appointments of my administration were people dedicated to fighting the opioid crisis & focusing on child welfare & education. Ohio should be the state of opportunity where EVERY CHILD can live their God-given potential. Number of Ohio kids in foster care jumped by 3,500 in five years, largely due to opioid crisis With Ohio consistently near last in the nation in state funding for child-protective services, the number of children entering foster care has exploded - another financial and human cost of the... dispatch.com", "2018-12-21T01:40:24.000Z": "Tonight I was honored to swear in Jon Hensler as Jackson County Commissioner.", "2018-12-17T15:12:44.000Z": "Happy Wright Brothers Day, Ohio! \"On December 17, 1903, two American brothers from Dayton, Ohio...  launched the first manned, powered flight on a windy beach In the 115 years since..., the United States has led the world in aviation innovation.\" Presidential Proclamation on Wright Brothers Day, 2018 | The White House On December 17, 1903, two American brothers from Dayton, Ohio, Orville and Wilbur Wright, launched the first manned, powered flight on a windy beach in Kit whitehouse.gov", "2018-12-17T14:31:19.000Z": "For information on the inaugural events this January, visit http:// DeWineHustedInauguration.com . @JonHusted and I are already getting to work to move our state forward and we're excited to hit the ground running on January 14th.", "2018-12-17T00:36:18.000Z": "Don't miss @60Minutes tonight. Tonight's episode featuring our work to hold opioid manufacturers and distributors accountable is on @cbs right now. #ohio Quote Tweet Governor Mike DeWine @GovMikeDeWine Keep the television on after the @NFL game on @CBS tonight for @60Minutes . I'll be talking with @BillWhitakerCBS about the status of our #Ohio lawsuit against opioid manufacturers and distributors. https:// cbsn.ws/2LhH6C1", "2018-12-16T20:33:48.000Z": "Tune in to @60Minutes tonite to see the interview I did with @BillWhitakerCBS on our lawsuit against the #opioid manufacturers and distributors.", "2018-12-15T17:39:59.000Z": "Tomorrow night I will be on . @60Minutes talking to . @BillWhitakerCBS about our lawsuit against the opioid manufacturers and distributors.", "2018-12-14T21:47:52.000Z": "Congratulations to . @Paduch on your new position as part of the president's re-election effort.", "2018-12-14T18:04:47.000Z": "At the #OhioStatehouse I met a new friend - Alonzo from Columbus.", "2018-12-14T00:24:57.000Z": ". @FranDeWine and I were at the White House tonight. Earlier today I met with several members of the cabinet to talk about Ohio issues and was in a meeting with the President and other newly elected governors.", "2018-12-13T20:38:29.000Z": "Happy Birthday to the @USNationalGuard  @OHNationalGuard Thanks for your service to our country.", "2018-12-12T19:54:49.000Z": "Tom Stickrath has been an outstanding leader in law enforcement and he will make a great Director of the Ohio Department of Public Safety.", "2018-12-12T19:54:21.000Z": "Kim Murnieks has deep knowledge of our state and its budget and I'm proud to name her to serve as Director of the Office of Budget and Management.", "2018-12-12T19:15:26.000Z": "Sheryl Maxfield has served under 8 different Attorneys General of both parties and I'm glad she has agreed to serve as Director of the Department of Commerce.", "2018-12-12T19:13:12.000Z": "I am proud to continue announcing outstanding public servants to serve alongside @JonHusted and I as members of my cabinet.", "2018-12-07T13:43:01.000Z": "Excited this morning to participate in the Columbus 2020 Economic Development forum to talk about the future of our state's economy and what we can do to take our momentum to the next level. #ED411  @CBUSRegion", "2018-12-06T22:09:54.000Z": "Today I got to be with #crewsc fans for the announcement of plans for a new stadium!", "2018-12-06T14:38:00.000Z": ". @JonHusted and I are looking forward to hitting the ground running on January 14th and working for an Ohio with growing prosperity and greater opportunity for everyone. Stay tuned for more information about the inauguration in 39 days!", "2018-12-05T21:16:57.000Z": "Today was a national day of mourning for President George H.W. Bush.  Below is a picture with my daughter Jill, @FranDeWine , and @patdewine .  Remembering#41", "2018-12-04T19:45:14.000Z": "Ervan Rodgers has been working since 2014 in the Attorney General's Office to develop IT strategies that help better serve and protect Ohioans and I am pleased he will continue his leadership as Ohio's Chief Information Officer.", "2018-12-04T19:43:16.000Z": "Over a year ago, I released my 12-point plan to fight the opioid epidemic. Today, I'm proud to put that plan in motion by naming Alisha Nelson as the Director of RecoveryOhio.", "2018-12-04T19:42:18.000Z": "Ann O'Donnell is my longest continuously-serving staff member, and I'm glad she will continue her public service as Chief Advisor in the Governor's Office in my administration.", "2018-12-04T19:41:13.000Z": "Laurel Dawson has a wealth of management experience in both the public and private sectors and I am honored she has agreed to serve as the Chief of Staff in the Governor's Office.", "2018-12-04T19:39:50.000Z": "Mary Mertz has a long history of working on important policy issues dealing with the environment, and protecting our natural resources, which is why today I am nominating her to serve as the next Director of the Ohio Department of Natural Resources.", "2018-12-04T19:38:42.000Z": "I am proud to nominate General John Harris to serve our women and men in uniform as Ohio's next Adjutant General.", "2018-12-01T12:31:12.000Z": "Some photos of our family with #PresidentGeorgeHWBush", "2018-12-01T12:01:05.000Z": "Fran and I are deeply saddened to learn of the death of a great and good man - our friend, President George H.W. Bush. We extend our sympathy and love to his children, grandchildren and great grandchildren. His life revolved around his touchstones of faith, family and friends.", "2018-11-30T02:01:52.000Z": ". @FranDeWine & stopped by the @ohiogop Christmas Party tonight to thank the volunteers for everything they've done to keep Ohio moving forward in 2019 & beyond.", "2018-11-26T16:35:27.000Z": "The @GM Lordstown plant is very important to our state & their workers are second to none. The plant and the workers need to be a part of the future of the auto industry. As Governor, I will make Ohio's case in-person.", "2018-11-24T01:22:54.000Z": "Tonight . @FranDeWine and I flipped the switch for the Legendary Lights . @thecliftonmill !", "2018-11-23T21:18:38.000Z": "Each year on the weekend after Thanksgiving, I try to plant trees with some of my grandkids. It was a great day with the sun shining! Some red buds and an apple tree.", "2018-11-22T20:06:07.000Z": "Theo and Jeanie's pie! #HappyThankgiving !", "2018-11-22T19:18:15.000Z": "#HappyThanksGivingDay2018 !  Our son, John, raised this 32-pound turkey, and Fran cooked it.", "2018-11-22T18:09:39.000Z": "Can't wait for the pie!", "2018-11-22T16:55:51.000Z": "And cornbread and apple dressing . #HappyThanksgiving2018", "2018-11-22T16:55:47.000Z": "Jeanie and Theo making progress on the apple pie.", "2018-11-22T16:11:44.000Z": "The grandkids helping make apple pie! Happy Thanksgiving!", "2018-11-22T00:12:38.000Z": "", "2018-11-22T00:12:34.000Z": "Fran and some of our grandkids getting ready for Thanksgiving at our house. We wish everyone a Happpy Thanksgiving!", "2018-11-20T20:03:12.000Z": ". @FranDeWine and I are very sad to hear about the passing of Gib Reese today. He will be very missed.", "2018-11-17T21:24:45.000Z": "At a meeting today of the . @NatlGovsAssoc with. @GovLarryHogan of Maryland. What a finish to the #OhioState vs. #Maryland game!", "2018-11-11T19:27:06.000Z": "Fran and I watched our grandson Brian run in the state cross country meet this weekend. It was a cold day for the runners! We are very proud of Brian, his team came in second place!", "2018-11-11T16:58:41.000Z": "Today we thank all of our #Veterans and especially remember those who served in World War I, on the 100th anniversary of the end of that war. #Armistice100 Quote Tweet Governor Mike DeWine @GovMikeDeWine On this #VeteransDay we honor all the men and women who have served our great nation. To them and their families, thank you. #ThankAVeteran  #ThankAVet  #MilitaryFamilyMonth  #Ohio", "2018-11-09T12:34:56.000Z": "Glad to start the morning today with @foxandfriends & @Morning_Joe talking about the opportunities we have in front of us in Ohio to make our state the state of opportunity.", "2018-11-08T01:08:28.000Z": "Pleased to have these qualified and talented professionals serve as key leaders in my administration. Gov-elect Mike DeWine names first administration appointees, outlines issues at top of his to-do... DeWine also said that his 4-percentage-point victory margin over Democrat Richard Cordray on Tuesday came as a \"surprise.\" cleveland.com", "2018-11-07T04:06:39.000Z": "Thank you, Ohio. Let's get to work!", "2018-11-06T22:31:42.000Z": "There are 2 hours left to get out and make your voice heard! Find your voting location at http:// MyOhioVote.com ! #ElectionDay", "2018-11-06T22:13:58.000Z": "Grandkids campaigning!", "2018-11-06T21:43:43.000Z": "Proud to have the support of many law enforcement officers across the state who work hard every day to keep our communities safe.", "2018-11-06T20:19:21.000Z": "So grateful to our supporters all over Ohio. Our Columbus HQ has made more than 87,000 phone calls already today! Polls are open until 7:30pm - find your poll location at http:// MyOhioVote.com !", "2018-11-06T20:00:58.000Z": "Stopped by Price Hill Chili!", "2018-11-06T18:02:54.000Z": "Fran and a few little helpers planted a Buckeye tree today!", "2018-11-06T17:51:20.000Z": "There is still time to vote - less than 7 hours until the polls close!", "2018-11-06T13:49:52.000Z": "Just voted!", "2018-11-06T11:37:44.000Z": "Polls are open from 6:30am - 7:30pm today. Get out and vote! \n\nFind your voting location here: https:// sos.state.oh.us/elections/vote rs/toolkit/#gref ", "2018-11-06T03:27:39.000Z": "Since high school, Fran and I have shared many Bull Shakes at Young's over the years. So we ended the night in a booth with one more.", "2018-11-06T03:10:07.000Z": "There's no place like home. \n\nGreat to be at Young's Jersey Dairy tonight for a final hometown rally with our long-time supporters, friends & family! \n\nThank you.", "2018-11-05T20:52:39.000Z": "\"Help us get this victory to keep Ohio growing!\" - @MikeDeWine Vote DEWINE for Governor! http:// gop.cm/6017rCcsF", "2018-11-05T21:45:52.000Z": "Thank you to my friend @JDVance1 for the support! Quote Tweet J.D. Vance @JDVance1 Proud to support my friend @MikeDeWine for governor. Proud of the campaign he's run. Only thing left to do is vote! Polls close tomorrow! https:// sos.state.oh.us/elections/vote rs/toolkit/polling-location/ ", "2018-11-05T15:39:52.000Z": "Thanks, @WKBN , @DanRivers & @21WFMJNews , for having me in studio this morning!", "2018-11-05T14:20:17.000Z": "Tomorrow this election comes to a close. @JonHusted and I ask that you support our campaign to bring a brighter and more prosperous future to every Ohioan.", "2018-11-05T02:25:58.000Z": "Great to be back in Summit County with @FrankLaRose - our next Secretary of State - and his wonderful wife @LaurenALaRose !", "2018-11-05T01:00:05.000Z": "\" @mikedewine is a family man. He does what's necessary because he believes in it. And we all need to be able to believe in this man on Tuesday.\"", "2018-11-04T22:16:33.000Z": "Great to be in beautiful Geauga County!", "2018-11-04T19:43:48.000Z": "We had a great afternoon outside the @Browns game with our friend @BernieKosarQB and Chairman @JaneyMurph talking to voters and reminding people to cast their ballot!", "2018-11-04T16:33:33.000Z": "I'm shaking hands outside the Browns' stadium!", "2018-11-04T13:29:51.000Z": "Father Tom is our dear friend.", "2018-11-03T22:15:11.000Z": "What a fun Get Out The Vote Rally with Gov. @JohnKasich last night!", "2018-11-03T21:51:22.000Z": "Great to be with so many supporters in Lucas County!", "2018-11-03T21:39:41.000Z": "Thank you so much to former Toledo Mayor Mike Bell for your endorsement!", "2018-11-03T18:39:31.000Z": "I have the best campaigners on my team!", "2018-11-03T17:47:10.000Z": "Stopped at Bun's in Delaware!", "2018-11-03T12:50:49.000Z": "Get out and vote this weekend! Find more details at http:// MyOhioVote.com .", "2018-11-03T00:53:25.000Z": "Ohio has come a long way the last 8 years under Republican leadership. Great to join Gov. @johnkasich , @keithfaber , @franklarose & @marydegenaro in Columbus tonight!", "2018-11-02T22:41:11.000Z": "\" @mikedewine has a wonderful heart, but there is something else that motivates him. It's his family. That's how he thinks of politics. And that's what you want in a leader.\" - @JohnKasich", "2018-11-02T19:05:10.000Z": "Great news in the October Jobs Report:", "2018-11-02T18:35:27.000Z": "Tune in: @FoxBusiness at 4:50pm!", "2018-11-02T17:50:32.000Z": "Great to be in Youngstown, Mahoning County!", "2018-11-02T15:19:33.000Z": "The Labor Department announced today that job growth blew past expectations in October and year-over-year wage gains jumped past 3% for the first time since the Great Recession. Republican economic policies are working. Let's keep the momentum going! Jobs smash estimates with gain of 250,000, wage gains pass 3% for first time since recession Job growth blew past expectations in October and year-over-year wage gains jumped past 3 percent for the first time since the Great Recession, the Labor Department says. cnbc.com", "2018-11-02T12:48:54.000Z": "Started the day off right...", "2018-11-02T00:16:57.000Z": "The @CantonRepdotcom endorsed @MikeDeWine for Ohio Governor! #OHGov", "2018-11-02T02:25:05.000Z": "This race will come down to turnout, and everything we do over the next five days matters! Sign up today to volunteer at http:// MikeDeWine.com/volunteer ! Thank you!", "2018-11-01T23:47:00.000Z": "\"I'm an optimist. I think the best days are ahead of us. I want people to look at Ohio and say: That's the place to raise a family. That's the place to start a business. That's the state of opportunity. We have a great state! We just have to keep moving forward.\"", "2018-11-01T23:46:20.000Z": "\"As your Governor, I'm going to do what I've done in the past. I'm going to pull people together: Democrats, Republicans & Independents. This state has a great future & the problems we have to tackle can not be done alone. I will pull people together to do that.\"", "2018-11-01T23:40:04.000Z": "\"I've spent my career fighting to protect Ohio families to keep them safe.. focusing on kids & making sure they grow up in a safe environment.. fighting for victims of crime who were voiceless. As your AG, I sued the drug companies who caused so much sorrow & suffering in Ohio.\"", "2018-11-01T23:35:35.000Z": "I'm always impressed by Summit County GOP! Here at their fall rally.", "2018-11-01T20:13:29.000Z": "Happy Birthday, William!", "2018-11-01T17:43:07.000Z": "Spoke with lots of kind, supportive people in Lima. Thanks, @ACOGOP for hosting this great event!", "2018-11-01T17:38:12.000Z": "Stopped for lunch at Kewpee!", "2018-11-01T16:14:00.000Z": "We can send our state backwards, or we can continue our economic comeback", "2018-11-01T14:00:25.000Z": "WATCH: @BillHemmer spoke with @MikeDeWine about President Trump rallying in Ohio next Monday, a tight Governor's race #nine2noon", "2018-11-01T15:08:09.000Z": "It was an honor to welcome the Vice President to Mansfield yesterday. Thank you, @VP Mike Pence, for visiting Ohio and supporting our @ohiogop ticket!", "2018-11-01T13:24:14.000Z": "Excited to join @BillHemmer and @SandraSmithFox on America's Newsroom this morning. Hope you can tune in at 9:40!", "2018-10-31T23:40:11.000Z": "Trick-or-treating with a McDonald's chef, Pikachu and a rock star!", "2018-10-31T21:31:35.000Z": "Back in Licking County this afternoon!", "2018-10-31T19:06:56.000Z": "Thanks to my friend @LindseyGrahamSC for helping us remind people of the stakes in this election and rally voters to the polls!", "2018-10-31T17:26:13.000Z": "GREAT to be in Ohio today supporting STRONG Republican candidates. Proud to stand with @MikeDeWine for Governor, @JimRenacci for Senate & @Troy_Balderson & @Bob_Gibbs for Congress. Get Out and Vote, Ohio!", "2018-10-31T17:18:18.000Z": "Thank you, @VP Mike Pence for coming to Ohio! It was so great to be with you in Mansfield!", "2018-10-31T12:23:15.000Z": "Under GOP leadership, Ohio's economy set a record for jobs in September. I want to keep this momentum going - not turn back to where we were 8 years ago. Ohio breaks 18-year-old record for jobs; 5.6 million now employed Ohio's economy set a record in September when it comes to jobs. The state added 4,300 jobs last month that, coupled with revisions to August, were enough to give the state 5,638,900 jobs in Septemb... dispatch.com", "2018-10-31T02:11:49.000Z": "US Senate candidate, SC Great visit tonight to Cincinnati to help some long time friends in the @ohiogop .\n\nIf you have friends or family in Ohio it is important they get out and support @MikeDeWine for Governor and the rest of our GOP team!", "2018-10-31T02:50:41.000Z": "Thank you to my friend, Senator @LindseyGrahamSC , for visiting Ohio to support our great @ohiogop ticket & rally voters to the polls!", "2018-10-31T01:37:00.000Z": "Getting ready to go live on @seanhannity now!", "2018-10-30T22:25:44.000Z": "Looking forward to joining U.S. Senator @LindseyGrahamSC on @seanhannity this evening at 9:45pm. Hope you can tune in!", "2018-10-30T19:39:04.000Z": "Eatin' in Eaton - at the 1808 Cafe! Great to be in Preble County!", "2018-10-30T17:18:31.000Z": "I joined Sidney officials to rally against Issue 1 at Shelby County Courthouse. Issue 1 would be extremely dangerous for all Ohio communities and families.", "2018-10-30T15:47:18.000Z": "Our best days are ahead of us. Let's move forward, together.", "2018-10-30T15:33:16.000Z": "Happy Birthday to our grandson, Albert!", "2018-10-30T15:03:19.000Z": "Dropped by the Paper City Coffee in Chillicothe yesterday!", "2018-10-30T14:57:29.000Z": "Just met with supporters in Dayton!", "2018-10-30T00:45:36.000Z": ". @VP Mike Pence is coming to Mansfield on Wednesday! You can RSVP here: https:// tinyurl.com/y82ecefq", "2018-10-29T22:30:48.000Z": "Stopped by the original Bob Evans Farm in Rio Grande today!", "2018-10-29T17:41:56.000Z": "Dropped by Millie's in Meigs County and met with county officials to discuss the dangerous effects of State Issue 1, which my opponent supports.", "2018-10-29T11:56:18.000Z": "College tuition rates are at an all-time high, and it is a huge strain on Ohio families. When I am Governor, students at state colleges and universities will never pay more in tuition and fees than they did their freshman year.", "2018-10-29T01:03:33.000Z": "I was honored to speak and answer questions tonight at the Asian American Commerce Group Candidate Forum.", "2018-10-29T00:02:17.000Z": "Fran and I are saddened by the violence that occurred this weekend, both in the Kentucky grocery store and in the Synagogue in Pittsburgh. Our prayers are with those killed and injured and the families who are grieving. There is no place for this violence and hate in our country.", "2018-10-28T23:29:12.000Z": "U.S. Senator Lindsey Graham is coming to Cincinnati for a get out the vote rally on Tuesday! Check out the details and make sure to RSVP, tickets are limited! https:// bit.ly/2OcYoQB", "2018-10-28T21:30:00.000Z": "It was a beautiful day for #SaveDtheCrew fans... until the rain came. Important game today. Let's go, black and yellow! #CrewSC", "2018-10-28T17:12:12.000Z": "Just left Paul Brown Stadium!", "2018-10-28T16:44:00.000Z": "Warren Tribune Chronicle: DeWine gets nod over Cordray for Ohio governor http:// tribtoday.com/opinion/editor ials/2018/10/dewine-gets-nod-over-cordray-for-ohio-governor/ ", "2018-10-28T14:18:54.000Z": "When I'm Governor of this state, every single day I will focus on jobs. Our goal is to make Ohio # 1. #ProtectOhio", "2018-10-28T13:25:53.000Z": "\"We cannot endorse a candidate for governor who supports Issue 1. But not for that reason alone do we endorse Mike DeWine.\" Editorial: Elect Mike DeWine as Ohio's next governor Both Republican Mike DeWine and Democrat Rich Cordray are qualified to serve as Ohio's next governor. DeWine has held public office for more than four decades, first as a county prosecutor in... cantonrep.com", "2018-10-28T00:32:17.000Z": "Final stop of the day was LaRosa's in Mount Orab, Brown County! It's been a fun day with our daughters & a few grandchildren. 10 days!", "2018-10-27T21:20:43.000Z": "Stopped by the Ulysses S. Grant Boyhood Home!", "2018-10-27T20:40:17.000Z": "Here with great supporters at the Olde Wayside Inn in West Union, Adams County!", "2018-10-27T20:21:04.000Z": "Eating our way through southern Ohio ... including hamburgers at Hickie's in New Boston, Scioto County!", "2018-10-27T19:42:47.000Z": "Fran and I are praying for the people impacted by the horrendous attack at the Tree of Life Synagogue in Pittsburgh today, including the brave first responders at the scene.", "2018-10-27T18:46:42.000Z": "Of course we had to get some ribs-to-go from the Scioto Ribber! We're having fun traveling southern Ohio with our daughters & a few grandchildren!", "2018-10-27T16:24:00.000Z": "Just left Diner 23 in Waverly, Pike County!", "2018-10-27T15:03:55.000Z": "Liberty Township Volunteer Fire Department is busy getting ready for their bean dinner!", "2018-10-27T14:32:05.000Z": "We kicked off the day in Jackson County!", "2018-10-27T02:34:53.000Z": "We ended the Protecting Ohio's Future tour in Dayton! So great to travel around the state with the Republican ticket! 11 days ... onward to victory! #ProtectOhio", "2018-10-27T02:14:29.000Z": "\"I want people to say - when they talk about Ohio - THAT'S the place to go for opportunity. Ohio? THAT'S the place to go to start a business. Ohio - THAT'S the place to go to raise a family. And that's our commitment to you.\" #ProtectOhio", "2018-10-26T23:48:45.000Z": "Signed my hot dog bun for @tonypackos !", "2018-10-26T23:31:34.000Z": "I met 9-year-old David at our Toledo stop and voted in his statehouse candy poll! (The word is he accurately predicted the outcome of the 2016 presidential election with his Halloween costume!)", "2018-10-26T23:00:06.000Z": "\"I think Mike cares about people. Seeing him over the years, getting the rape kits taken care of ... My husband is a county prosecutor so for us that's a big deal.\"", "2018-10-26T22:22:07.000Z": "I'll be voting for @yost4ohio to be Ohio's next Attorney General! He is a proven prosecutor who cares deeply about protecting Ohio families and will help keep our communities safe!", "2018-10-26T22:09:16.000Z": "\"We want every child to graduate from high school truly college ready or on a pathway to a good career.  We have amazing career centers in Ohio. Our goal is to take them to the next level-to be the best in the world at preparing young people & all Ohioans for 21st century jobs.\"", "2018-10-26T21:52:35.000Z": "\"One thing @JonHusted & I are really going to fight for & emphasize every single day is early childhood education. We have some kids in Ohio, who through absolutely no fault of their own, show up to kindergarten & they're behind. Our goal is to get them up to the starting line.\"", "2018-10-26T21:39:29.000Z": "\"We understand that when you talk about jobs, you have to talk about skills and education. What we want for every child in this state - is to be able to live the American Dream.\" #ProtectOhio", "2018-10-26T20:33:05.000Z": "11 days until the Election! On this bus, it's all work between stops! #ProtectOhio", "2018-10-26T19:40:09.000Z": "I love to visit companies like the PDI Group, a leading manufacturer in Cleveland. As Governor, I will work every day to bring good jobs to Ohio & help existing businesses expand - by eliminating burdensome regulations & keeping taxes low! #ProtectOhio", "2018-10-26T18:36:13.000Z": "\"One thing that won't change about Mike DeWine - he will remain sincere, hardworking, and have the backs of all Ohioans.\" -Stacey Polk #ProtectOhio", "2018-10-26T13:38:42.000Z": "\"This election is about a choice. Are we going to go back? Or move forward? We can't go back to higher taxes, more regulation. We're going to move forward.\"- @MikeDeWine The cold can't keep supporters away from cheering on their next Governor & Republican ticket! #ProtectOhio", "2018-10-26T16:18:09.000Z": "\"I think Mike DeWine will be the next great governor because he promotes education.\" #ProtectOhio", "2018-10-26T15:02:42.000Z": "It was a beautiful fall morning in Hanoverton to talk about the future of our state - keeping our economy strong, fighting for our children's education and giving hope to those with addiction. Our best days are ahead of us! #ProtectOhio", "2018-10-26T13:51:01.000Z": "Just arrived in Columbiana County to talk to voters about protecting Ohio's future and taking our economy to the next level! #ProtectOhio", "2018-10-26T12:27:28.000Z": "People care about their paychecks and a strong Ohio economy! Yesterday we took our message of Protecting Ohio's Future to Cincinnati, Columbus, Zanesville and Canton. #ProtectOhio", "2018-10-26T02:14:22.000Z": "Rallying in Canton! Thanks for the support today on the #ProtectOhio tour. 12 days to go ... the momentum is building!", "2018-10-26T01:16:36.000Z": "\"I think Mike DeWine will be great for the economy and great for Ohio families.\" #ProtectOhio  @StarkGOP", "2018-10-25T23:15:00.000Z": "There are some kids who, due to no fault of their own & due to circumstances they can't control, just don't have the same shot at success as others. We have to fix this. Every kid deserves the same chance to achieve the American dream. http:// MikeDeWine.com/Kids", "2018-10-25T22:47:32.000Z": "Just left Zanesville! Thanks to all who came out for this stop on the #ProtectOhio tour.", "2018-10-25T22:37:09.000Z": "\" @JonHusted and I have a real vision for where we want to take the State of Ohio. That vision starts with a focus on jobs. I believe the job of the governor is to focus every single day on job creation - creation of good-paying jobs.\" #ProtectOhio", "2018-10-25T20:36:29.000Z": "So glad the bus took a detour to Tom's Ice Cream Bowl. Thanks for having us, Bill Sullivan!", "2018-10-25T19:31:08.000Z": "It's a question: Are we going to go back, or are we going to move forward? I say we move forward.\"", "2018-10-25T19:31:03.000Z": "Do we want to go back to where we were 8 years ago? We can't do that. And that's what this race is all about ..", "2018-10-25T19:31:02.000Z": "\"This bus tour that we're on is about hope and opportunity. Because that's the Ohio that @JonHusted and I see ..", "2018-10-25T19:17:20.000Z": "\"I think he would be an excellent governor for Ohio.\" - Cassandra Cartier #ProtectOhio", "2018-10-25T16:08:09.000Z": "Eight years ago, Ohio had an $8 billion budget hole, just 89 cents in savings, and 400,000 people lost their jobs. We can't return to the failed policies of the past. @JonHusted and I have a plan to move our state forward. http:// MikeDeWine.com/Jobs", "2018-10-25T15:35:22.000Z": "\"I know that when he is Governor of the State of Ohio that veterans will be a top of mind all the time.\"\n\nThank you, Mr. Battle, for your support! #ProtectOhio", "2018-10-25T14:59:29.000Z": "My granddaughter Izzy sent me this photo this morning. \"Extra stamps just to be safe.\" Thanks, Izzy!", "2018-10-25T14:19:28.000Z": "Kicking off the #ProtectOhio bus tour in Cincinnati NOW!", "2018-10-25T11:24:06.000Z": "The Protecting Ohio's Future tour kicks off this morning in Cincinnati! \n\nJoin us at 10:00AM to hear the Republican candidate's plans to keep our economy booming and #ProtectOhio ! http:// ohiogop.org/bustour", "2018-10-25T01:09:51.000Z": "As Governor, I'm committed to funding 10,000 nano-degrees for anyone ready to take the next step in a career- all you'll have to do is work in OH when you're done! This is a start to addressing our workforce shortage & getting people into good paying jobs http:// MikeDeWine.com/Jobs", "2018-10-24T22:46:44.000Z": "The Protecting Ohio's Future bus tour kicks off tomorrow! Join the Republican ticket Thursday & Friday around the state. Find details for the stop nearest you and RSVP here: http:// ohiogop.org/bustour", "2018-10-24T19:21:45.000Z": "Great news in the @daytondailynews this morning. Under GOP leadership, Ohio's economy is strong. Let's carry the momentum forward!", "2018-10-24T11:57:53.000Z": ". @JohnKasich & @MaryTaylorOH have made great progress with the Common Sense Initiative to cut regulations. @JonHusted & I want to build off this success. As Governor, I will oppose any regulation that stands in the way of economic growth. http:// MikeDeWine.com/Jobs  #OHGov", "2018-10-23T21:48:22.000Z": "It was great to meet with supporters in Morgan County & Belmont County today!", "2018-10-23T18:55:26.000Z": "Thanks for your support, Governor @JohnKasich ! Quote Tweet John Kasich @JohnKasich Please join me in voting for @MikeDeWine for Ohio governor. Mike has an aggressive jobs plan that will continue our strong momentum into the future, keep taxes low & continue our fight to end burdensome gov't regulations that hamper job creation.", "2018-10-22T20:11:28.000Z": "15 days. Let's finish this! #LeadRight  #OHGov", "2018-10-22T19:06:57.000Z": "Thank you to @IntelligencerWV for endorsing me for governor. The Intelligencer Endorses Mike DeWine As Ohio Governor It became apparent during the 2016 presidential election that many Ohioans are fed up with traditional politics, ready to embrace government outsiders. But one long-time insider earned Buckeye State... theintelligencer.net", "2018-10-22T12:45:04.000Z": "Our friend Amy found this in her 6-year-old son Mason's room.  Thanks so much for the support, Mason!!", "2018-10-21T22:48:42.000Z": "Congratulations to our grandsons Albert and David who ran the Nationwide Children's Hospital Columbus 1/2 Marathon this morning!", "2018-10-21T22:24:18.000Z": "Great crowd and a lot of energetic voters at the Darke County GOP Hog Roast!", "2018-10-21T21:35:55.000Z": "Thanks, @RepGaryScherer , for letting our team join you in the Bainbridge Fall Festival of Leaves parade this afternoon!", "2018-10-21T19:34:31.000Z": "We just finished up a meet and greet in Mercer County with @KeithFaber for State Auditor, @SusanManchester for State Representative, Mercer Co. @SheriffJeffGrey and Prosecutor Matt Fox, and GOP Chairman Matt Gilmore. Thanks to all who joined us!", "2018-10-21T18:33:57.000Z": "We stopped at The Fountain Restaurant in downtown Celina for a quick bite to eat, and chatted with the owner, Dee.", "2018-10-20T22:45:15.000Z": "In 6th grade, I would bounce my basketball past @FranDeWine 's house. One day I showed up at her door with a silver cross necklace and a Whitman's Sampler box of chocolates. I'm glad she opened the door. Happy Sweetest Day, Frances! #SweetestDay", "2018-10-20T21:07:26.000Z": "The Circleville Pumpkin Show is the \"Greatest Free Show on Earth.\" It's amazing how many people from all over Ohio visit the show. We had a great time there today! @PumpkinShowInc", "2018-10-20T18:37:28.000Z": "Great to visit with friends and supporters in Urbana today!", "2018-10-20T13:54:31.000Z": "Thanks to our grassroots team working around the clock, and around the state for our Republican ticket! @FranDeWine and I shared a few words with volunteers before door to door in Franklin County this morning.", "2018-10-20T13:19:25.000Z": "My grandkids wanted to share a few words with you . . .", "2018-10-20T00:07:13.000Z": "#HeartOfItAll  #FranFor1stLady  #OHGov", "2018-10-19T14:59:32.000Z": "TODAY: Ohio has added 557,600 new private sector jobs since 2011 and broke an 18-year record for jobs. We are heading in the right direction & can't go back to where we were 8 years ago. https:// dispatch.com/news/20181019/ ohio-breaks-18-year-old-record-for-jobs   #OHGov Ohio breaks 18-year-old record for jobs; 5.6 million now employed Ohio's economy set a record in September when it comes to jobs. The state added 4,300 jobs last month that, coupled with revisions to August, were enough to give the state 5,638,900 jobs in Septemb... dispatch.com", "2018-10-19T02:50:33.000Z": "Hancock County Getting to the Heart of it All tour -Anna #HeartOfItAll  #FranFor1stLady  #OHGov", "2018-10-18T23:51:54.000Z": "Lots of energy tonight as the #HeartOfItAll Tour concluded in Findlay. So great to stand next to these strong women. #FinishStrong  @DeWineHustedOH  @TinaHusted1  @Yost4Ohio  @FranDeWine  @RobertCSprague  @KeithFaber", "2018-10-19T00:30:21.000Z": "We have a great team across Ohio working hard every day to move our state forward! #OHGov Quote Tweet Lydia Mihalik @LydiaMihalik \"There's no \"I\" in team!\" This is what a vibrant group of women supporting the 2018 @ohiogop Statewide ticket looks like. #HeartOfItAll", "2018-10-19T00:00:58.000Z": "The \"Getting to the Heart of it All\" tour just ended with a Findlay finale! -Anna #HeartOfItAll  #FranFor1stLady  #OHGov", "2018-10-18T21:14:27.000Z": "Cuyahoga County Lucas County  #FranFor1stLady  #HeartOfItAll  #OHGov", "2018-10-18T21:08:16.000Z": "Toledo! Thanks for welcoming the Getting to the Heart of it All tour. Our finale is coming up ... Meet us in Findlay at 5:30! -Anna #HeartOfItAll  #FranFor1stLady  @TheLucasCoGOP", "2018-10-18T17:49:11.000Z": "What a beautiful day in Cuyahoga County and a fun stop at Chagrin Falls Popcorn Shop!! -Anna #HeartOfItAll  #FranFor1stLady  #OHGov  @ChagrinFallsOH  @CuyahogaGOP", "2018-10-18T17:43:54.000Z": "#FranFor1stLady", "2018-10-18T15:32:44.000Z": "Mahoning County Now we're headed to the Chagrin Falls Popcorn Shop! -Anna #HeartOfItAll  #FranFor1stLady  #OHGov", "2018-10-18T15:09:48.000Z": "Anna here. What a great first stop on Day 2 of the Getting to the Heart of it All tour with Tina Husted, Lauren LaRose and LeeAnn Johnson in Youngstown! Thank you, Mahoning County!! #FranFor1stLady  #HeartOfItAll  #OHGov", "2018-10-18T12:54:27.000Z": "Stark County See you soon, Mahoning County, for our first stop of the day! -Anna #HeartOfItAll  #FranFor1stLady", "2018-10-17T23:58:30.000Z": ". @FranDeWine , @TinaHusted1 , & @LaurenALaRose are making Ohio the best place to live the American Dream. Thanks for a great afternoon Richland County! #OHGov", "2018-10-17T17:52:42.000Z": "Ohio's economy has come a long way under Republican leadership. Let's keep moving forward! Special thanks to @DelCoProsecutor & @kevinbaconohio for joining us on the trail in Delaware County! #OHGov", "2018-10-17T21:11:11.000Z": "Pictures from today's GOP event with the wives of the statewide candidates for office. @ButlerCoGOP  @OhioGOP  #Election2018  #Politics  #Ohio", "2018-10-17T23:58:46.000Z": "#FranFor1stLady", "2018-10-17T23:36:39.000Z": "Just ended Day 1 of our Getting to the Heart of it All tour in Canton. Thank you, Stark County!! -Anna #HeartOfItAll  #FranFor1stLady  #OHGov  @StarkGOP", "2018-10-17T21:28:42.000Z": "Richland County Meet us in Stark County for our final stop of the day! -Anna #HeartOfItAll  #FranFor1stLady", "2018-10-17T21:10:16.000Z": "Just left another great event in Mansfield! Thanks for having us, Richland County! -Anna @MansfieldOhio  #HeartOfItAll  #FranFor1stLady  #OHGov", "2018-10-17T18:44:06.000Z": "Delaware County Up next: Richland County! -Anna #HeartOfItAll  #FranFor1stLady  #OHGov", "2018-10-17T18:33:58.000Z": "Thanks for the warm welcome, Westerville, and to all the energetic supporters who met us! -Anna #HeartOfItAll  #FranFor1stLady  #OHGov  @DelCoProsecutor  @DelawareCoOhio  @WestervilleOhio", "2018-10-17T15:56:37.000Z": "Butler County Next stop - Delaware County! See you in Westerville. -Anna #FranFor1stLady  #HeartOfItAll  #OHGov", "2018-10-17T15:16:03.000Z": "\"I think this tour is getting to the heart of it all - what is really important to Ohio families and how important it is to get out and vote on November 6th.\" - Fran, in Hamilton #FranFor1stLady  #HeartOfItAll  #OHGov", "2018-10-17T14:45:50.000Z": "What a GREAT group to greet us in Hamilton for the first stop of the tour! Thanks to everyone who came out to listen to some amazing women. -Anna #HeartOfItAll  #FranFor1stLady  #OHGov  @ButlerCoGOP  @HamiltonOh", "2018-10-17T12:44:11.000Z": "Anna here, taking over Dad's account. Mom is on the road and on the radio! First stop on the Getting to the Heart of it All tour - Butler County!", "2018-10-16T17:04:07.000Z": "Thanks for joining us on the Red, White & Bluegrass tour featuring the @RadioRamblers !", "2018-10-16T12:09:45.000Z": "Tomorrow @FranDeWine kicks off her two-day statewide \"Getting to the Heart of it All\" tour! Meet her on the campaign trail!", "2018-10-14T20:50:47.000Z": "Just finished our final stop of the Red, White and Bluegrass tour with Joe Mullins and the @RadioRamblers in Marysville!", "2018-10-14T18:48:05.000Z": "While we were in Cleveland, I wanted to stop and see my friend, Jimmy Haslam, and thank him for all he is doing to help #SaveTheCrew ! It means a lot to all @ColumbusCrewSC fans.", "2018-10-14T15:38:56.000Z": ". @MikeDeWine getting some help from friend @BernieKosarQB on the campaign trail. Today they are meeting with @Browns fans outside the stadium.", "2018-10-14T15:30:12.000Z": "We're tailgating for a little bit at @Browns stadium before heading south! It's a beautiful fall day to cheer on Cleveland! #OHGov", "2018-10-14T14:52:47.000Z": "Join us for our final stop on the #RedWhiteAndBluegrass tour with @RadioRamblers this afternoon in Marysville! http:// rwbpartners.eventbrite.com Thanks for coming out to Troy last night! #OHGov", "2018-10-14T14:20:30.000Z": "Thanks to @RepNanBaker for a giving us a great start to the day at her Pancake Breakfast! The kids enjoyed every bit of it! Good to see Ohio's next Attorney General, @Yost4Ohio ! #OHGov", "2018-10-14T13:38:08.000Z": "I'm starting the day up in Cleveland with @FranDeWine and our family at @RepNanBaker 's Pancake Breakfast! #OHGov", "2018-10-13T18:05:37.000Z": "\"Eight years ago, we were in a bad place - we lost 400,000 jobs and had an $8 billion budget hole. We've come a long way since then and @JonHusted & I are going to take it to the next level. #OHGov", "2018-10-13T18:01:26.000Z": "NOW: @MikeDeWine & @FranDeWine speak to supporters at @JungleJimsMrkt in Fairfield. #OHGov", "2018-10-13T17:33:10.000Z": "We're kicking off the Red, White, and Bluegrass tour this morning in Fairfield w/ @RadioRamblers at @JungleJimsMrkt ! Come hear our positive vision for Ohio's future, and some great music! #OHGov", "2018-10-13T15:11:02.000Z": "We will be inside the Monorail Barn at @JungleJimsMrkt (Fairfield, OH) delivering some FREE BLUEGRASS with @MikeDeWine starting at 1PM. Come out and join us! #jmrr  #mikedewine  #bluegrass", "2018-10-13T13:48:51.000Z": "Today is the day for #RedWhiteAndBluegrass featuring the @RadioRamblers ! @FranDeWine and I are so excited to see you at 1 at @JungleJimsMrkt , then at 6 in Troy for the second show! @MiamiCountyGOP Red, White & Bluegrass Tour at the Miami County Fairgrounds Join candidate for Governor Mike DeWine for a free concert with Joe Mullins & the Radio Ramblers on Saturday, October 13th at 6:00p. Bring the whole family for this fun event! Doors open 5:30p Paid... eventbrite.com", "2018-10-13T01:25:19.000Z": "The first stop on the #RedWhiteAndBluegrass tour with the @RadioRamblers begins at 1 p.m. tomorrow at @JungleJimsMrkt Fairfield! See you there  @ButlerCoGOP  @HamCoGOP RSVP: Red, White & Bluegrass Tour at Jungle Jim's Join candidate for Governor Mike DeWine for a free concert with Joe Mullins & the Radio Ramblers on Saturday, October 13th at 1:00p. Bring the whole family for this fun event! Doors open 12:30p Paid... eventbrite.com", "2018-10-13T01:15:06.000Z": "Tonight, @FranDeWine , Brian and Parker joined me to welcome people to the GOP rally in Lebanon! Republicans have a lot of energy in Ohio for this election! #OHGov", "2018-10-12T21:58:56.000Z": "It's a great day for #SaveTheCrew fans, and outstanding news for all of Columbus! It's amazing what a community can do when they work together! \n\nTogether, you #SavedTheCrew Quote Tweet Save The Crew @Save_The_Crew We ALL did this. Together. #SaveTheCrew  #SavedTheCrew Show this thread", "2018-10-12T21:26:43.000Z": ". @FranDeWine & I had a great day with our son, Brian, and our grandson, Parker! Parker was a big help passing out cookbooks at Sam's Meats & Deli! #OHGov", "2018-10-12T02:27:46.000Z": "Countdown: 2 days until we are with the @RadioRamblers for Red, White & Bluegrass! You're invited! #RedWhiteAndBluegrass  1 pm Sat. @JungleJimsMrkt , Fairfield", "2018-10-10T20:02:58.000Z": "In Ohio, youth suicides have nearly doubled since 2007. It's never been more important than now to talk to children about mental health. @JonHusted and I will ensure every Ohio school has access to a mental health professional. Read: http:// mikedewine.com/education  #WorldMentalHealthDay Meet Mike DeWine Learn about Mike, his life, what he stands for, and what his plans are for the state! mikedewine.com", "2018-10-10T18:11:48.000Z": "Early voting starts TODAY Visit http:// myohiovote.com to request an absentee ballot or find out where to vote!", "2018-10-10T16:55:01.000Z": "Join @FranDeWine and me this weekend for the Red, White & Bluegrass Tour featuring Joe Mullins & the @RadioRamblers !", "2018-10-09T01:04:36.000Z": "Thank you to everyone who came to Cleveland with @FranDeWine & me for the #OHGovDebate . Good to be joined by @MaryTaylorOH , @FrankLaRose , and of course, Ohio's next Lt. Governor, @JonHusted ! #OHGov", "2018-10-08T23:55:41.000Z": "That concludes the final #OHGovDebate in Cleveland, Ohio. Visit http:// MikeDeWine.com to learn more about our campaign & to join the cause!", "2018-10-08T23:54:20.000Z": "\"I run for Governor because I know I can make a difference. Throughout my career, I've been able to take problems and find solutions - and I've done it by bringing people together, both Democrats and Republicans, to work together.\" #OHGov  #OHGovDebate", "2018-10-08T23:40:23.000Z": "\"We need to make sure our children are making it to the starting line.\" \n\nMike DeWine & @JonHusted have a plan to improve early childhood education & make sure every child has a chance to achieve their God-given potential. See http:// MikeDeWine.com/Kids  #OHGov  #OHGovDebate Meet Mike DeWine Learn about Mike, his life, what he stands for, and what his plans are for the state! mikedewine.com", "2018-10-08T23:38:00.000Z": "\"There needs to be less testing and more learning in our schools.\" Read the plan Mike DeWine & @JonHusted have to improve education in Ohio by visiting http:// MikeDeWine.com/Education . #OHGov  #OHGovDebate Meet Mike DeWine Learn about Mike, his life, what he stands for, and what his plans are for the state! mikedewine.com", "2018-10-08T23:27:20.000Z": "\"We need to have some reform, but State Issue 1 would be a total disaster... @RichCordray is standing out there basically alone at this point.\" #OHGovDebate  #OHGov", "2018-10-08T23:26:29.000Z": "\"The number-one complaint I hear as I travel the State of Ohio is that employers can't find enough people to fill jobs they have open.\" Read the plan Mike DeWine & @JonHusted have to grow our economy & pair Ohioans with good careers: http:// MikeDeWine.com/Jobs  #OHGovDebate  #OHGov", "2018-10-08T23:16:30.000Z": "Great to hear our endorsed candidate @MikeDeWine talk about his plan for growing economy and jobs in every corner of our state. #OHGovdebate", "2018-10-08T23:16:35.000Z": "\"The goal of the Governor of the State of Ohio should always be to grow our economy... @JonHusted and I have a plan.\" Read the plan at http:// MikeDeWine.com/Jobs  #OHGov  #OHGovDebate", "2018-10-08T23:10:47.000Z": "\"When it comes to Medicaid Expansion, I believe there needs to be a reasonable work requirement, and I believe we need a wellness initiative to improve healthcare outcomes.\" #OHGovDebate  #OHGov", "2018-10-08T23:08:43.000Z": "\"I have always supported coverage for people with preexisting conditions... I voted seven different times in Congress to support preexisting conditions.\" #OHGovDebate", "2018-10-08T23:00:24.000Z": "Getting ready for the final #OhGovDebate in Cleveland. Follow along with staff here and @DeWineHustedOH !", "2018-10-08T22:50:42.000Z": "Glad to have Liz Garcia and Alyssa Allison with us tonight in Cleveland to sit with @FranDeWine for the final #OHGovDebate ! #OHGov", "2018-10-08T12:35:50.000Z": "The next Governor needs to bring people together from both parties to solve problems. I'm proud to have the support of State Rep. Bill Patmon.", "2018-10-07T20:48:40.000Z": "Thanks to @RepBobGibbs & Sen. @LarryObhof for joining us today!", "2018-10-07T20:28:44.000Z": "Had a great stop in Ashland with some of the members of Sportsman for DeWine-Husted at Fin Feather Fur this afternoon! #OHGov", "2018-10-07T17:31:33.000Z": "We finished Saturday by watching our granddaughter, Caroline, in the musical \"Smile.\" All these high school kids were just amazing!", "2018-10-06T22:11:49.000Z": "I'm pleased that the Senate has completed its confirmation of Justice Kavanaugh and that Republicans have again kept their promise to promote conservative jurists who are committed to the constitution. #SCOTUSvote", "2018-10-06T18:56:49.000Z": ". @FranDeWine & I made it to Ohio Stadium to talk with people heading in for today's game! I even wore my Ohio State Buckeyes tie! #OHGov  #GoBucks", "2018-10-06T18:15:57.000Z": "Yesterday, national unemployment fell to its lowest rate in 50 years. In Ohio, we've won back the 350,000 jobs lost under Democrat control & added hundreds of thousands more. We can't go back. @JonHusted & I have a plan to take our state to the next level. http:// MikeDeWine.com/Jobs", "2018-10-06T17:14:33.000Z": "Made a quick stop into Mel-O-Dee Restaurant in New Carlisle before heading into Columbus for the @OhioState game! @FranDeWine , @JonHusted , @TinaHusted1 , and I are so grateful for the support we are receiving everywhere we go. #OHGov", "2018-10-06T16:41:45.000Z": ". @FranDeWine & I walked in the New Carlisle Parade of Planes this morning with the team!", "2018-10-06T13:10:37.000Z": "Last night, @FranDeWine & I stopped by the Minster Oktoberfest before heading home! Thanks to everyone who came out to join us!", "2018-10-05T18:34:01.000Z": "\"Issue 1, if passed, will make Ohio the best place to live if you are a drug addict or dealer and do not want to change your lifestyle.\" --Municipal Court Gary Dumm #OHGov Municipal Court Gary Dumm Issues Opinion on Ohio Issue #1 Issue 1, if passed, will make Ohio the best place to live if you are a drug addict or dealer and do not want to change your lifestyle.  Under the amendment, possession of deadly drugs like cocaine,... sciotopost.com", "2018-10-05T16:08:34.000Z": "Today is National Manufacturing Day ( @MfgDay )! @JonHusted & I are proud to be endorsed by the @OhioMFG , among all of Ohio's leading business groups. We have some of the hardest-working people in America, which is why the Buckeye State is a great place to do business. #OHGov", "2018-10-04T18:17:35.000Z": "I had a great time chatting with @andy_chow and a group of young adults today about jobs, the economy & issues facing the next generation of Ohioans. Thanks for having me! #OHGov", "2018-10-04T15:50:10.000Z": "If @RichCordray gets his way, Ohio would have some of the most lenient drug laws in America. Say No to Issue 1. Say No to Cordray.", "2018-10-04T00:44:35.000Z": "Protecting families has always been my top priority. Help us share our latest ad! #OHGov", "2018-10-01T23:52:11.000Z": "\"I will be a Governor who is focused on jobs every single day.\" \n\nRead our jobs plan here: Meet Mike DeWine Learn about Mike, his life, what he stands for, and what his plans are for the state! mikedewine.com", "2018-10-01T23:29:51.000Z": "\"There is only 1 candidate on this stage who has fought to hold ECOT accountable... and I have a plan going forward that is good for parents, good for students, and good for the taxpayers of the State of Ohio.\" Learn more at http:// MikeDeWine.com/Education  #OHGov  #OHGovDebate Meet Mike DeWine Learn about Mike, his life, what he stands for, and what his plans are for the state! mikedewine.com", "2018-10-01T23:25:51.000Z": "Mike DeWine has a real plan to grow jobs in Ohio, drive investment into communities that need it, and focus on vocational training to pair more people with great careers. Visit http:// mikedewine.com/Jobs to learn more. #OHGov  #OHGovDebate", "2018-10-01T23:24:20.000Z": "It was Mike DeWine who put out a call to law enforcement across the state to send in 12,000 rape kits that had never been tested. Mike DeWine tested them all: https:// cleveland.com/metro/index.ss f/2018/02/completed_testing_of_13931_rape_kits_signals_progress_unfinished_business_and_investigtions_remain.html#incart_river_index   #OHGovDebate  #OHGov Completed testing of 13,931 rape kits signals progress Sexual assault victim advocates say more needs to be done to ensure transparency and accountability of the evidence. cleveland.com", "2018-10-01T23:22:31.000Z": "\"The answers do not lie in Columbus. The answers lie in our local communities.\"", "2018-10-01T23:19:29.000Z": "Here is the truth: \"Untested\" While Richard Cordray was Attorney General, 12,000 rape kits like Alyssa's were left untested. Cordray's failure left serial rapists free to strike again. Th... youtube.com", "2018-10-01T23:04:07.000Z": "\" @JonHusted and I have a plan - it's a plan for education - it's a plan for prosperity - it's a plan to move all of Ohio forward.\" #OHGovDebate", "2018-10-01T22:59:07.000Z": "We're about to begin the second gubernatorial debate at @MariettaCollege . Follow along with my staff here! #OHGovDebate", "2018-10-01T21:11:46.000Z": "Thanks to everyone who came out to welcome @FranDeWine & I to Marietta for this evening's debate! We're grateful for your support. I'm looking forward to the opportunity to discuss the vision @JonHusted & I have for Ohio's future tonight. #OHGov", "2018-09-30T23:12:55.000Z": "3 MILLION VOTERS CONTACTED! Thank you to everyone who has made calls and knocked on doors to elect me, @JonHusted & the Republican team. You make all the difference! We are working hard to win a brighter future for every Ohioan. Join us at http:// MikeDeWine.com/Volunteer . #OHGov", "2018-09-30T17:20:19.000Z": "This weekend, we hit a big milestone: 3 million voters contacted! @JonHusted & I are so grateful for the time and effort this team is putting in - not just for us - but to bring the entire @OhioGOP team over the finish line. Join us today at https:// MikeDewine.com/Volunteer/ ! #OHGov", "2018-09-29T21:37:38.000Z": "Huge rally in Canal Winchester this afternoon! Onward to Victory!", "2018-09-29T17:17:10.000Z": "It's perfect weather today for a fall festival! @FranDeWine and I had a wonderful time visiting with people at the Lebanon Country Apple Fest.", "2018-09-29T13:13:08.000Z": ". @FranDeWine and I are in Cincinnati this morning with @SteveChabot where the @OhioGOP team is about to hit our 3 MILLIONTH voter contact of the campaign! @JonHusted & I are grateful for everyone's time and hard work. #OHGov", "2018-09-28T19:34:06.000Z": "\"If there's any example that shows the difference between the candidates, it certainly is this one. It really comes down to a question of judgment.\" DeWine rips Cordray for backing reduced criminal sentences Calling it the most distinctive issue in the 2018 Ohio governor's race, Republican Mike DeWine questioned the fundamental judgment of Democratic opponent Rich Cordray for backing state Issue 1. While... dispatch.com", "2018-09-28T18:25:23.000Z": "If Richard Cordray gets his way and Issue 1 passes, Ohio would end up with some of the most lenient drug laws in the nation, making Ohio a safe haven for drug dealers & giving the Mexican drug cartels a road map straight into our neighborhoods. #OHGov", "2018-09-27T23:54:08.000Z": "Glad to be at the @FranklinCoGOP Slate Dinner tonight with Chairman @JaneyMurph & so many other great leaders for Ohio's future! #OHGov", "2018-09-27T18:36:35.000Z": "There are kids who, due to no fault of their own and because of circumstance beyond their control, just don't have the same chances for success as others - when I am Governor, we're going to change that. #OHGov  #Vote4OhioKids", "2018-09-27T17:28:58.000Z": ". @MikeDeWine speaking now at the #Vote4OhioKids conference about his plans to ensure every child has the chance to succeed & reach their God-given potential - no matter their circumstances. Visit http:// MikeDeWine.com/Kids to learn more. #OHGov", "2018-09-27T15:00:01.000Z": "Drug courts have been one of our most successful tools in getting people clean and onto a pathway of recovery. That's why I encourage Ohio to VOTE NO on Issue 1. Participation has decreased by 60% in California since their state implemented a similar proposal in 2014.", "2018-09-25T14:31:42.000Z": ". @FranDeWine has done it again! Since April, Fran has been traveling Ohio, visiting with people in all 88 counties. Today, she has reached county #88! Come out to Allen County today to celebrate with her. #FranFor1stLady  #OhGov", "2018-09-25T13:12:15.000Z": ". @FranDeWine & I returned home late from Lawrence County on Saturday night and took a walk around the farm together. Fran picked up some of the new fallen buckeyes - note her arrangement!", "2018-09-23T21:07:35.000Z": "Unlike my opponent, I am vehemently opposed to Issue 1 & will continue working against this reckless issue. It will gravely endanger Ohioans & give our state some of the most lenient drug laws in the country. I agree w/ @clevelanddotcom - vote no. #OHGov No on Issue 1 reclassifying Ohio drug crimes: endorsement editorial The editorial board of cleveland.com and The Plain Dealer urges a no vote on state Issue 1, which seeks to insert into the Ohio Constitution new restrictions on how drug crimes are handled in Ohio. cleveland.com", "2018-09-22T20:51:21.000Z": "The Jackson Apple Festival is one of our favorite events in the state. Fran and I bought fudge and shared some of the best apple dumplings we've ever had. Thanks to Jackson County Prosecutor Justin Lovett for joining us!", "2018-09-22T18:39:58.000Z": "Ate lunch at Diner 23 in Waverly. It was nice to meet Lauren, a Pike CTC Engineering Technology major. She wants to join the Army National Guard radar control or attend @ShawneeState . Ohio is blessed w/ great career tech centers that are important tools to fixing our skills gap.", "2018-09-22T16:30:56.000Z": "Great to see Hillsboro Police Chief Darrin Goudy today. Couldn't leave town without stopping by Momma's West Main Street Cafe!", "2018-09-22T16:18:08.000Z": "Great visit with many friends at the Highland County GOP headquarters this morning!", "2018-09-22T16:02:47.000Z": "This is the Springboro High School ROTC color guard right before the Springboro vs. Centerville game last night!", "2018-09-22T15:57:46.000Z": "I started my day today at the Silver Creek Township Fire Dept. pancake breakfast in Jamestown. Thanks for a great breakfast!", "2018-09-20T17:04:38.000Z": "Glad to have the chance to speak at the @PCSAOhio Conference today about the plan @JonHusted and I have proposed, \"Opportunity for Every Ohio Kid,\" to ensure every child has the chance to get to the starting line - regardless their circumstances. #OHGov  http:// MikeDeWine.com/Kids", "2018-09-19T23:55:42.000Z": ". @MikeDeWine  #Ohio will be the state of OPPORTUNITY! #OhGovDebate", "2018-09-19T23:48:59.000Z": ". @MikeDeWine I think @realDonaldTrump has done an excellent job of appointing conservative judges to the federal bench. #OHGovDebate .", "2018-09-19T23:46:44.000Z": ". @MikeDeWine It is important for the Governor of the State of Ohio to have a good working relationship with the President of the United States.", "2018-09-19T23:44:13.000Z": ". @MikeDeWine  #WrightPattersonAFB is the \"brains\" of the #USAF .  This is a jewel of the #MiamiValley . #OHGovDebate", "2018-09-19T23:42:01.000Z": ". @MikeDeWine is against legalization of recreational marijuana. #Colorado has seen an increase in use among young people. #OHGovDebate", "2018-09-19T23:40:24.000Z": ". @MikeDeWine Drug courts help keep people in treatment for addiction. #OHGovDebate", "2018-09-19T23:36:22.000Z": ". @MikeDeWine the saddest part of #issue1 will be its effect on drug courts.", "2018-09-19T23:34:57.000Z": ". @MikeDeWine I wil vote no on #issue1 .", "2018-09-19T23:34:16.000Z": ". @MikeDeWine supports the heartbeat bill.", "2018-09-19T23:33:16.000Z": ". @MikeDeWine government should protect the most vulnerable people - born and unborn.", "2018-09-19T23:27:32.000Z": "@MikeDeWine will put a mental health specialist in every Ohio school that is available to every child.", "2018-09-19T23:25:27.000Z": "@MikeDeWine will appoint people to boards of Ohio's universities who are committed to keeping costs down.  Also costs will be locked in for a student's four years at Ohio's universities.", "2018-09-19T23:07:35.000Z": "This is why. #OHGovDebate", "2018-09-19T22:18:52.000Z": "Tonight, I will be at @univofdayton for the #OHGovDebate ! Follow along with my staff here! #OHGov", "2018-09-19T22:17:31.000Z": "Here's my view from the podium for tonight's #OHGovDebate at @univofdayton ! Looking forward to talking about my vision for Ohio's future. #OHGov", "2018-09-19T15:15:22.000Z": "Took Teddy for a walk around the farm early this morning looking forward to being at the University of Dayton tonight. Teddy will be watching at home. #OHGovDebate  #OHGov", "2018-09-17T22:54:53.000Z": "\"We the people of the United States, in Order to form a more perfect Union, establish Justice, insure domestic Tranquility, provide for the common defense, promote the general Welfare and secure the Blessings of Liberty\" Happy #ConstitutionDay !", "2018-09-17T20:43:32.000Z": "Thanks to our family, friends and many volunteers who joined us this weekend for the Grove City Arts in the Alley Parade!", "2018-09-17T16:11:21.000Z": ". @MikeDeWine is LIVE on @700wlw now talking about the dangerous State Issue 1 on this fall's ballot, which would allow someone to possess enough Fentanyl to kill 10,000 people. Tune in now: https://", "2018-09-17T15:48:51.000Z": "Just arrived at @700wlw to talk with @Willie700WLW at noon! Listen live here: https://", "2018-09-15T17:18:40.000Z": ". @FranDeWine & I had a great time at the Hocking County Fair this afternoon!", "2018-09-15T17:07:22.000Z": "Simply put: State Issue 1 in #Ohio is dangerous and would make Ohio a haven for drug dealers. We must defeat this proposal in November. #OHGov", "2018-09-15T15:00:38.000Z": ". @FranDeWine and I had a great time with the team at the Grove City Arts in the Alley Parade this morning! So grateful for the support we are seeing in every corner of the state. #OHGov", "2018-09-13T14:10:22.000Z": "Join @MikeDeWine & @JonHusted LIVE to hear their plan on how we can transform the way the state does business and deliver better services at a lower cost! https:// facebook.com/MikeDeWine/vid eos/265815494058753/   #OHGov  #DHFO2018", "2018-09-11T16:20:40.000Z": "Let us honor and remember the lives lost on 9/11 and the courageous actions of the police, firefighters, EMTs, and other heroes who helped on that tragic day. #911Anniversary", "2018-09-11T00:13:31.000Z": "People stop me on the street to ask about our lawsuit to #SaveTheCrew . Check out my interview on Spectrum News In-Focus about what we are doing on behalf of Ohio taxpayers to ensure the team's owners follow the law. AG DeWine explains lawsuit against Precourt, MLS He believes the law is behind him in the suit. spectruminfocus.com", "2018-09-10T22:59:55.000Z": "State Issue 1 is dangerous and reckless and would take away some of the most effective tools had by judges and law enforcement personnel in helping people and saving lives. DeWine says Issue 1 impact 'devastating,' Cordray calls it smart policy Saying state Issue 1 would bring devastating consequences and lead to fewer addicts getting treatment, Attorney General Mike DeWine on Monday came out firmly against the proposed constitutional... dispatch.com", "2018-09-09T20:44:06.000Z": "We need less testing and more learning in our schools. We cannot limit educators into just teaching to the test. @JonHusted & I have a plan to make it happen. Read it for yourself at http:// MikeDeWine.com/Education . #OHGov Meet Mike DeWine Learn about Mike, his life, what he stands for, and what his plans are for the state! mikedewine.com", "2018-09-08T16:45:38.000Z": "Thanks to everyone who braved the rain and came out in Central Ohio this afternoon to go door-to-door for the @OhioGOP ticket! #OHGov", "2018-09-08T15:39:56.000Z": ". @FranDeWine and I planned to go to Old Hilliard Fest this morning, but it was cancelled for the rain. Instead, we dropped in at Nancy's Home Cooking in Clintonville until the next stop and had a great time!", "2018-09-08T15:03:58.000Z": ". @FranDeWine & I started the day right at the South Vienna Corn Festival Pancake Breakfast this morning! #OHGov", "2018-09-08T00:15:26.000Z": "Had dinner w/the Summit Co. Republican Party tonight & talked about the plans @MikeDeWine & I have to fight the opioid epidemic & prepare more Ohioans for careers in growing industries & ensure everyone has the chance to pursue the American Dream! #OHGov  http:// MikeDeWine.com/Jobs", "2018-09-07T23:35:31.000Z": "I had a great conversations yesterday with @NAWBOColumbus about how we make Ohio the best place in the nation for entrepreneurship, business growth, and job creation. I met some very impressive business leaders. #OHGov", "2018-09-05T22:18:04.000Z": "Great to see Chairman Timken ( @JaneyMurph ) tonight in Canton! @JonHusted & I are grateful for your support & leadership as we work to elect @OhioGOP candidates across the state this fall! #OHGov", "2018-09-04T21:32:41.000Z": "My office was in court today working to #SaveTheCrew ! http:// dispatch.com/news/20180904/ columbus-crew-sc-art-modell-law-get-day-in-court ", "2018-09-03T20:46:59.000Z": ". @FranDeWine & I just finished up at the Geauga County Fair! It's a beautiful Labor Day in NE Ohio!", "2018-09-03T20:12:22.000Z": "Happy Labor Day! Our state is strong because of the hard working women and men who move us forward every day. Together, we will take Ohio to the next level & earn a more prosperous future for our workers and our families!", "2018-09-03T18:06:35.000Z": ". @FranDeWine & I just attended the annual 11th Congressional District Picnic at Luke Easter Park in Cleveland. We had fun seeing old friends and meeting so many new ones!", "2018-09-03T16:58:22.000Z": "There was a great crowd at the Barberton Labor Day Parade today! Thanks to our great volunteers who came out to walk with @FranDeWine & me.", "2018-09-03T12:32:20.000Z": ". @FranDeWine & I had a great time yesterday after the parade at both the St. Rocco Festival in Cleveland & the Parma Hungarian Scout Festival! We had some great food & went home with plenty of leftovers to share!", "2018-09-02T20:25:20.000Z": "We just left the Milan Melon Festival where we walked in the parade and ate a half cantaloupe with cantaloupe and watermelon ice cream!", "2018-08-30T00:24:16.000Z": "Bob & Lisa Peterson ( @bobpetersonfarm ) hosted a great campaign rally for @FranDeWine & I at their farm near Sabina tonight! We all enjoyed their homemade ice cream with black raspberry sauce and great peach cobbler! #OHGov", "2018-08-28T21:24:24.000Z": "John McCain had a rally at @YoungsDairy in '08. Though dying from pancreatic cancer at the time, my dad (a WWII vet) wanted to meet Sen. McCain & came w/my mom to the rally. \"You are my hero,\" he said. I'll never forget that moment. And America will never forget @SenJohnMcCain ."}