{"2020-07-30T17:21:21.000Z": "The massive and non-violent protests led by Black Lives Matter activists have inspired the nation. Let's get to work and make this vision a reality.", "2020-07-30T21:18:09.000Z": "Portland is not \"under siege.\" Portlanders are enjoying the summer. Portlanders are walking their dogs. Portlanders are cooking dinner. Portlanders are playing with their kids in the park. Share a photo! #ShowMeYourPortland", "2020-07-30T19:49:09.000Z": "Because of Lincoln & Union counties' diligent work to reduce the spread of COVID-19, they have been removed from the Watch List. Unfortunately, Hood River, Marion, and Multnomah need to be added. We can reduce the spread of COVID-19 if we work together. You can make a difference.", "2020-07-30T16:34:31.000Z": "Congratulations Rupert and Rohan! (via @Oregonian ) Portland-area teens named Top 10 science scholars nationwide, score $200K in award money A pair of Washington County teens were named among the 10 best science and math scholars Wednesday evening by the nation's most prestigious science competition for U.S. high school seniors. oregonlive.com", "2020-07-30T18:24:47.000Z": "Today, we remember the life and legacy of John Lewis. Let's all honor his final words: \"I urge you to answer the highest calling of your heart and stand up for what you truly believe...the way of peace, the way of love, and nonviolence is the more excellent way.\" #GoodTrouble Quote Tweet New York Times Opinion @nytopinion \"Ordinary people with extraordinary vision can redeem the soul of America.\"\n\nRead the message John Lewis wrote to the nation shortly before his death. https:// nyti.ms/3120meX", "2020-07-29T23:28:12.000Z": "\"Their presence here was like pouring gasoline on the fire, and their strategy, because it was a political one, has backfired,\" @OregonGovBrown says, after announcing \"phased withdrawal\" of federal officers from Portland following unrest and public outcry. http:// abcn.ws/33cBEeR", "2020-07-30T02:17:22.000Z": "As federal troops prepare to go home, we have an opportunity to make real and lasting change, centering racial justice and taking bold steps to achieve the vision of the Black Lives Matter movement. \n\nLet's get to work. Federal Troops to Leave Portland youtube.com", "2020-07-29T19:17:07.000Z": "U.S. agents who were sent to protect a federal courthouse in Portland from demonstrators will begin to withdraw. \n\nThere will still be a \"robust presence\" of Oregon State Police until it is clear federal properties are safe. Oregon Gov. Says Federal Officers Will Begin Phased Withdrawal From Portland Oregon Gov. Kate Brown called the federal agents sent to Portland acted as \"an occupying force & brought violence.\" Brown says federal officers will leave starting Thursday. npr.org", "2020-07-29T16:31:10.000Z": "Breaking News: Federal agents who have clashed with protesters agreed to withdraw from Portland, Oregon, on the condition that the state secures federal properties Federal Tactical Teams to Withdraw From Portland, Governor Says Gov. Kate Brown of Oregon said the teams will begin a withdrawal on Thursday. Federal officials cautioned that they will withdraw only when they are confident the federal courthouse can be secured. nytimes.com", "2020-07-29T15:31:12.000Z": "After my discussions with VP Pence and others, the federal government has agreed to withdraw federal officers from Portland. They have acted as an occupying force & brought violence. Starting tomorrow, all Customs and Border Protection & ICE officers will leave downtown Portland.", "2020-07-29T04:01:37.000Z": "Just three days ago, I announced that Oregon suffered our greatest COVID-19 loss yet, with nine Oregonians dying in one day from the disease. Today, I'm devastated to announce we quickly hit a new grim record of losing 14 Oregonians. My heart is with their friends and families.", "2020-07-28T22:59:52.000Z": "Oregon will always be a welcoming, safe place for all. Our 33-year-old Sanctuary Law prevents Oregon from enforcing federal immigration law, and I will uphold this to stand with Oregon's Dreamers. We are at our best when we focus on what we have in common, not what divides us.", "2020-07-28T22:59:51.000Z": "Brought to the U.S. as kids, Dreamers embody the American dream. Oregon's 12,000 Dreamers serve in our military, work in our hospitals, pay taxes, and make our communities stronger. Though the Supreme Court recently blocked the president's attempt to end DACA, he is trying again. Quote Tweet NBC News @NBCNews JUST IN: White House announces that the US will take steps to wind down legal protections for DACA participants while the admin. conducts a legal review after the Supreme Court rejected in June President Trump's plan to end the program. https:// nbcnews.to/2DdfZbq", "2020-07-28T21:41:23.000Z": "I understand how eager teachers, students, and parents are to hear their schools' plans for fall. We know kids do better learning in-person...yet in-person classes could spread COVID-19. These requirements will help school districts make the most informed, safe decisions.", "2020-07-28T20:14:10.000Z": "Join me at 1:30 for my press conference on schools and more: Press Briefing with Gov. Kate Brown, July 28, 2020 youtube.com", "2020-07-26T22:31:59.000Z": "Some older kids (and some adults) are wondering if it's safe to wear a face covering. Hear the question from Theo, age 9, and the answer about why it's safe - and important - from Dr. Robert Pelz of @PeaceHealth_Ore .", "2020-07-26T17:54:11.000Z": "This pandemic has had a devastating financial impact on so many Oregonians. Congress needs to step up and extend extra $600/week provided by the Federal Pandemic Unemployment Compensation, which ended yesterday. This money has been so important to help people pay bills.", "2020-07-26T14:39:44.000Z": "On the 30th anniversary of the Americans with Disabilities Act, I celebrate the progress we've made in ensuring the civil rights of people with disabilities - and commit myself to continuing to reduce barriers, change perceptions, and fight for fuller inclusion. #ADA30", "2020-07-26T01:29:31.000Z": "Barley, I think I glove you. That face covering is a real home run. Thanks for being a great teammate and protecting the @HillsboroHops players and all of your fellow Oregonians. Quote Tweet the Hop @BarleytheHop dear @OregonGovBrown , what do you think of my mask? #maskupOR Show this thread", "2020-07-25T20:03:39.000Z": "Please respect this request from @CityofBend City Council for visitors to stay home through September 7th. Bend asks tourists to stay away through Labor Day following COVID-19 rise As COVID-19 cases rise in Bend, the city is asking visitors to stay at home. statesmanjournal.com", "2020-07-25T15:21:21.000Z": "Yesterday we hit a hit a grim milestone: a record nine Oregonians died from COVID-19 in a single day. They had lived in Clackamas, Deschutes, Malheur, Marion, Multnomah, and Umatilla counties. Families are mourning across the state. And we mourn with them.", "2020-07-25T15:09:00.000Z": "This pandemic has had a devastating financial impact on hundreds of thousands of Oregonians. With the Federal Pandemic Unemployment Compensation (extra $600/week) ending today, Congress needs to step up and extend this important resource. To get help, call 2-1-1.", "2020-07-24T20:24:37.000Z": "The overwhelming majority (86% of Americans) are doing the right thing and wearing face coverings. 3 in 4 Americans favor requiring people to wear masks in public, poll finds A national poll reveals broad support for face coverings outside the home as coronavirus cases rise across the nation. oregonlive.com", "2020-07-24T18:18:42.000Z": "The power and responsibility of wildfire is in your hands. Please, keep Oregon green. #KeepOregonGreen  #OregonOurOregon", "2020-07-24T16:12:41.000Z": "Starting today, kids ages 5 and up must wear a face covering in public indoor spaces, as well as outdoors when they can't physically distance. To answer their questions, check out Kids Ask, Doctors Answer series. Today's stars Lily, age 6, and Dr. Renee Edwards from @OHSUNews .", "2020-07-24T02:27:52.000Z": "To effectively stop the spread of COVID-19, the people who call to say you may have been exposed to the virus should speak the same languages as who they're calling. Culturally-responsive health programs are a commonsense way to bring racial equity to our COVID-19 response. Quote Tweet OR Health Authority @OHAOregon Today, OHA announced the launch of a new program to fund work by Community Based Organizations (CBOs) to help respond to COVID-19 in culturally- and linguistically-responsive ways in communities across the state. Read our full news release to learn more: http:// ow.ly/2AOw50AGy3o", "2020-07-23T22:46:49.000Z": "Protecting your health means wearing a face covering. It also means keeping up with doctor appointments like well-child visits, care for chronic conditions, as well as emergency care.", "2020-07-23T22:37:16.000Z": "We need to take real and concrete action to reform police training. For law enforcement to have the respect and support of all Oregonians, it is important that police officer training and certification be credible and transparent. https:// bit.ly/2CzcrjT", "2020-07-23T17:01:19.000Z": "Starting tomorrow, kids ages 5 and up must wear a face covering in public indoor spaces and outdoors when they can't physically distance. To answer questions, check out our new series: Kids Ask, Doctors Answer. First up: Baxter, age 6, and Dr. Renee Edwards from @OHSUNews .", "2020-07-22T23:16:38.000Z": "What's at stake: money ($1.2 trillion in federal funding) and power (Congressional seats). I remain committed to making sure that every Oregonian is counted and represented in the Census. Trump's new census directive is almost certainly unconstitutional His memorandum would exclude undocumented immigrants when drawing congressional districts. motherjones.com", "2020-07-22T19:10:13.000Z": "Oregon, we carefully ventured out onto the ice together, but it has begun to crack. COVID-19 is spreading too quickly, particularly in parts of rural Oregon. Before we fall through the ice, it's time to take a step back with new rules to help slow the spread of this disease.", "2020-07-22T17:41:23.000Z": "Tune in at 11am for my press conference: Press Briefing with Gov. Kate Brown, July 22, 2020 youtube.com", "2020-07-21T21:26:25.000Z": "The Trump administration is not interested in problem-solving. The Trump administration is not interested in public safety. They are interested in political theater. Quote Tweet PBS NewsHour @NewsHour \"If they were really interested in problem-solving or in public safety, they would be willing to de-escalate and engage in dialogue,\" says @OregonGovBrown about federal authorities. https:// to.pbs.org/3eQ9PLg", "2020-07-21T19:51:56.000Z": "Our dedicated @OregonGuard service members wear face coverings to slow the spread of COVID-19. Hear why they're asking you to do the same to protect them. Quote Tweet OregonNationalGuard @OregonGuard Oregon National Guard stays healthy and safe by wearing masks!", "2020-07-21T16:05:56.000Z": "Please respect this request from @CityofBend City Council for visitors to stay home through September 7th. Quote Tweet City of Bend, Oregon @CityofBend @CityofBend Issues Order Discouraging Travel:\n\n\"Travel to Bend for recreational, discretionary, or vacation purposes is strongly discouraged and should be avoided through these critical summer months.\"\n\nREAD MORE: https:// bit.ly/2DXlCeh", "2020-07-21T15:12:51.000Z": "It has been incredibly hard for so many to not be able to visit our loved ones in long-term care to protect them from COVID-19. Outdoor visits, with safeguards, will help restore the in-person connections that are so vital for mental and physical health and well-being. Quote Tweet Oregon Department of Human Services @ORHumanServices News Release - Long-term care facilities permitted to offer outdoor visitation with safeguards: https:// go.usa.gov/xfKXy  #LongTermCare  #COVID19  @OregonDHSAPD Show this thread", "2020-07-20T23:30:01.000Z": "This is a democracy, not a dictatorship. We cannot have secret police abducting people in unmarked vehicles. I can't believe I have to say that to the President of the United States. Federal Officers Could Expand Beyond Portland; Trump Searches For Campaign Strategy : Consider This... In Portland, Oregon, federal agents have been using violent force against protesters. Some protesters have been arrested by officers in unmarked vehicles. Governor Kate Brown has asked the Department... npr.org", "2020-07-19T22:23:20.000Z": "The Trump administration needs to stop playing politics with people's lives. Oregon Gov. Kate Brown: Federal Officers Are 'Adding Gasoline To A Fire' NPR's Michel Martin speaks with Gov. Kate Brown about rising tensions between protesters and federal forces. \"The Trump administration needs to stop playing politics with people's lives,\" Brown says. npr.org", "2020-07-19T17:05:12.000Z": "This fall, whether kids are learning in school buildings or online, we must ensure underserved & marginalized students - our kids of color and our low-income kids - get the support & opportunities they need. This pandemic can't increase racial disparities in educational outcomes.", "2020-07-18T17:05:11.000Z": "One of the many great things about Oregon: our craft beers. Breweries across the state are asking you to please wear a face covering so that they can stay safe and stay open for business. @PelicanBrewCo  @PfriemBeer  @ChetcoBrew", "2020-07-18T04:02:33.000Z": "We lost a legend tonight. Congressman John Lewis exuded justice and equality for all. He was the heart & soul of the civil rights movement. In times of darkness, he reminded us to get into that good trouble and carry on the fight.  Now more than ever, we carry his fight with us. Quote Tweet USA TODAY @USATODAY Rep. John Lewis, the civil rights icon who fought for racial justice first with Martin Luther King Jr. and later in the halls of Congress, has died at 80 https:// usatoday.com/story/news/pol itics/2020/07/17/rep-john-lewis-civil-rights-icon-original-freedom-rider-has-died/795340002/ ", "2020-07-18T00:32:31.000Z": "Gov. Brown on Trump's Portland \"invasion\": \n\n\"This is absolutely unacceptable. This was purely a photo opportunity for political theater for the Trump administration. He is trying to distractThey only want to escalate. They want to dominate the streets.\" 'Terrifying for citizens': Oregon gov. reacts to Trump's 'invasion' of Portland Gov. Brown: \"This is absolutely unacceptable. This was purely a photo opportunity for political theater for the Trump administration. He is trying to distract.  They only want to escalate. They want... msnbc.com", "2020-07-17T20:05:10.000Z": "Take it from Dr. Renee Edwards, Chief Medical Officer at @OHSUNews : \"Health care workers have always worn masks to prevent the spread of infectious disease. Masks unequivocally work - and are definitely worth the hassle.\" Edwards: Wearing masks is best, easiest way to halt pandemic 'Businesses cannot fully reopen and we cannot fully enjoy life again unless this pandemic is under control.' pamplinmedia.com", "2020-07-17T15:55:45.000Z": "In America, your bank balance should not impact your ability to vote. Yesterday's #SCOTUS decision allows Florida to silence the voices of nearly one million otherwise-eligible voters simply because of unpaid fines. That's a modern-day poll tax. Supreme Court Allows Restrictions on Voting by Ex-Felons The case concerned a Florida state law that limited the sweep of a voter initiative meant to allow former prisoners to vote. nytimes.com", "2020-07-17T02:40:03.000Z": "Today Oregon set a grim record: the most cases of COVID-19 since the pandemic began. This disease is spreading. It won't disappear just because we want it to. Cancel big indoor get-togethers. Wear your face covering. Protect your community.", "2020-07-16T23:55:24.000Z": "This, coming from the same President who used tear gas to clear out peaceful protesters in Washington, DC to engineer a photo opportunity.\n\nTrump is looking for a confrontation in Oregon in the hopes of winning political points in Ohio or Iowa.", "2020-07-16T23:55:23.000Z": "This political theater from President Trump has nothing to do with public safety. The President is failing to lead this nation. Now he is deploying federal officers to patrol the streets of Portland in a blatant abuse of power by the federal government. Quote Tweet KATU News @KATUNews BREAKING: Homeland Security head, Chad Wolf, is in Portland after saying the city is \"under siege.\" https:// bit.ly/32x7L8m", "2020-07-16T15:19:57.000Z": "Grocery store employees are frontline workers who are risking their health to feed their communities. Learn how to help lower the risk of COVID-19 by being a conscientious shopper.", "2020-07-15T18:11:47.000Z": "Reminder: two new rules to keep Oregonians healthy and safe take effect today. Face coverings must be worn outdoors when you can't distance from others, as well as indoor public spaces. Indoor social get-togethers are capped at 10.\n\nWe must slow the spread of the disease.", "2020-07-15T17:28:08.000Z": "Every day, Oregonians are learning more and more about epidemiology and public health. Gain a better understanding of COVID-19 data in Oregon with a live Q&A featuring @OHAOregon 's public health data experts, today at 12:30pm. https:// oregon.gov/oha/", "2020-07-15T00:58:06.000Z": "Thanks to Oregon legislators for investing in Black communities, supporting small businesses, and helping Oregonians who have lost their jobs. The Oregon Cares Fund is an innovative plan proposed by Black leaders-excited to see this move forward. Oregon Lawmakers Greenlight Aid To Unemployed Workers, Black-owned Businesses Oregon's cultural institutions and quarantining workers also stand to gain from a $200 million package passed Tuesday. opb.org", "2020-07-14T21:31:33.000Z": "My Electric Vehicles Roadmap plan will connect the entire length of the West Coast with charging stations. This will help us power our transportation system with clean energy produced right here, using the wind on our plains, the sun in our deserts, and the water in our rivers. Quote Tweet Western Govs Assoc. @westgov It is a visionary inclination and tendency toward innovation that animates the electric vehicles roadmap initiative, a project that @OregonGovBrown has been scoping and designing and redesigning during the past year as Vice Chair of WGA, Ogsbury said.", "2020-07-14T21:27:56.000Z": "It's a great thing when common sense and human decency prevail. In Oregon, we will always welcome the world's best and brightest students. Trump administration drops plan to deport international students in online-only classes \"This is an extremely significant outcome for international students and colleges,\" an education official said. politico.com", "2020-07-14T18:40:11.000Z": "Congrats to the @TimbersFC for winning your first game last night! \n\nWe can all be good teammates by wearing face coverings so we don't accidentally infect those around us.", "2020-07-14T17:46:35.000Z": "It's cruel to threaten that ICE would target international students who came to this country to study at our colleges and universities, just because classes are temporarily remote. In Oregon, we welcome the best and brightest. Oregon AG, schools file suits to block new visa rule for international students - KTVZ Oregon Attorney General Ellen Rosenblum on Monday joined a coalition of 18 attorneys general in filing a lawsuit to stop a new federal rule that they said threatens to bar hundreds of thousands of... ktvz.com", "2020-07-14T16:11:38.000Z": "Small businesses across Oregon want to stay open while keeping their employees and their customers safe. Listen to why these @CityofBend businesses are asking you to wear a face covering at their shops, restaurants, museums, and other independent businesses. #MaskUp4SmallBiz", "2020-07-13T22:03:59.000Z": "Across the state, more and more people are supporting wearing face coverings.", "2020-07-13T19:00:34.000Z": "Hoy estoy sonando la alarma: estamos en riesgo de que COVID-19 se descontrole en Oregon. \n\nSe requieren cubrebocas en algunos espacios públicos al aire libre y las reuniones sociales tienen un límite de 10 personas en espacios interiores.", "2020-07-13T19:00:25.000Z": "Today I am sounding the alarm: we are at risk of COVID-19 getting out of control in Oregon.\n\nEach of us needs to take immediate action to slow the spread of this disease. \n\nFace coverings are required in some outdoor public spaces and indoor social get-togethers are capped at 10.", "2020-07-13T17:51:43.000Z": "Join me at 11am for my press conference about COVID-19: Press Briefing with Gov. Kate Brown, July 13, 2020 youtube.com", "2020-07-13T17:03:04.000Z": "Mask Up Monday! (and Tuesday, Wednesday, Thursday... you get it.) Quote Tweet The Beavs @BeaverAthletics #MaskUp Monday with @JaydonGrant", "2020-07-12T17:12:48.000Z": "Coronavirus is spreading quickly in Oregon. But you can make a difference by wearing a face covering, staying 6 ft. apart, washing your hands, and staying home when sick. This great video from @OHdeptofhealth helps illustrate the tremendous impact of each of our actions.", "2020-07-11T22:30:56.000Z": "This week marks the start of our statewide fire season, so please review how to be fire-safe. In Oregon, over 70% of wildfires are started by people, often from burning debris or leaving unattended campfires. For more info on how you can help, visit http:// keeporegongreen.org", "2020-07-11T16:45:46.000Z": "No. I refuse to sacrifice grandmothers, WWII veterans, and other cherished older Oregonians to this disease without doing everything we can to keep them safe. Our humanity depends on protecting the most vulnerable members of our society. America Is Sacrificing the Elderly to Coronavirus 132,000 Americans have lost their lives to the pandemic. Almost 40 percent of them lived in nursing homes or assisted-living communities. nymag.com", "2020-07-10T23:24:34.000Z": "One more time, from the cheap seats on the left coast: vote by mail is safe, accessible, and secure. Take it from our Republican @OregonSOS : In our last presidential election, voter fraud accounted for just 0.0001% of ballots cast. Quote Tweet Donald J. Trump @realDonaldTrump Mail-In Ballot fraud found in many elections. People are just now seeing how bad, dishonest and slow it is. Election results could be delayed for months. No more big election night answers? 1% not even counted in 2016. Ridiculous! Just a formula for RIGGING an Election.... Show this thread", "2020-07-10T22:06:47.000Z": "COVID-19 is spreading in Oregon faster now than ever before. The latest projections show that if we don't get this under control, hospital emergency rooms & ICUs will fill up quickly. \n\nWEAR. A. FACE. COVERING. #MaskUpOR", "2020-07-10T19:34:33.000Z": "Across the state, more and more people are supporting wearing face coverings.", "2020-07-10T17:58:50.000Z": "Across the state, more and more people are supporting wearing face coverings.", "2020-07-10T15:28:26.000Z": "An Oregon COVID survivor says, \"I could not feed myself. I couldn't move my arms or legs. I lay there and cried.\"\n\nWe can prevent this. Please stay 6 feet apart & wear a face covering to protect those you love from this disease. A simple cough, a diagnosis of COVID-19 for a Tigard woman and the fight to keep her alive Sent to the intensive care unit at Providence St. Vincent Medical Center, Barbara Spencer, 77, spent 16 days on a ventilator and then required nearly two more weeks of intense therapy. oregonlive.com", "2020-07-09T21:38:17.000Z": "Across the state, more and more people are supporting wearing face coverings.", "2020-07-09T19:00:19.000Z": "Across the state, more and more people are supporting wearing face coverings.", "2020-07-09T17:31:19.000Z": "Coronavirus is spreading quickly in Oregon. You can make a difference. It's vitally important that each of us wears a face covering, stays 6 ft. apart, washes our hands, and stays home when sick.", "2020-07-09T16:10:12.000Z": "Before, during, and after COVID-19, I denounce any form of racism in Oregon. I stand with Black, Latinx, Pacific Islander, Asian, Tribal communities, and all communities of color.\n\nOregon is your home. And we will not tolerate racist behavior here. Oregon AG highlights first data report on new hate, bias crime, incidents law - KTVZ Oregon Attorney General Ellen on Thursday highlighted the results of the first Senate Bill 577 report  from the Oregon Criminal Justice Commission, which is designed to share data on Oregon's new... ktvz.com", "2020-07-08T20:13:19.000Z": "Hmm maybe it's just me, but when it comes to keeping children and educators safe, I actually like the idea of following \"very tough\" guidelines from our country's most trusted doctors and health experts. Quote Tweet Donald J. Trump @realDonaldTrump I disagree with @CDCgov on their very tough & expensive guidelines for opening schools. While they want them open, they are asking schools to do very impractical things. I will be meeting with them!!!", "2020-07-08T18:26:05.000Z": "Masks save lives.\n\nBe like @LindseyHoran and @beckysauerbrunn , and #MaskUpOR !", "2020-07-08T18:29:53.000Z": "Threatening to have ICE target international students may garner the President headlines on Breitbart, but for hardworking students who came to this country to study at world-class colleges & universities, it's just plain cruel. Here in Oregon, we welcome the best and brightest. Quote Tweet POLITICO @politico Trump administration's changes to the Student and Exchange Visitor Program for non-immigrant students could put colleges in a tough spot if they want to keep international students enrolled https:// politico.com/news/2020/07/0 6/trump-international-students-ice-online-classes-349937 ", "2020-07-08T18:17:32.000Z": "I'm committed to continuing the tough, important conversations about racial equity and justice in Oregon. Join me at noon for a live chat with @DralishaMD on \"Leadership in the Era of COVID-19 and Heightened Racial Trauma.\" https:// facebook.com/DralishaMD/", "2020-07-08T18:09:24.000Z": "Today I'm announcing my Public Safety Training and Standards Task Force to fully review law enforcement training, certification, and decertification practices. Thanks to its members for stepping up to this call, and I look forward to reviewing their recommendations.", "2020-07-08T18:09:23.000Z": "Bold action on racial justice and criminal justice reform is long overdue. But words aren't enough; We need action. That's why I called a special session and signed into law the legislative agenda of the People of Color Caucus. This is an important step, with more to come.", "2020-07-08T15:39:53.000Z": "Today's #SCOTUS decision, to uphold a Trump Admin. rule allowing employers to deny birth control coverage to employees, will have dangerous consequences for millions of Americans' health, safety, and financial security. Your employer's beliefs shouldn't affect your health care. Quote Tweet BuzzFeed News @BuzzFeedNews The Supreme Court sided with the Trump administration, granting businesses and universities the ability to refuse to provide birth control coverage for their employees for religious or moral reasons https:// buzzfeednews.com/article/emaoco nnor/supreme-court-birth-control-coverage-mandate-religious?bftwnews&utm_term=4ldqpgc#4ldqpgc  Show this thread", "2020-07-08T00:27:20.000Z": "Some Oregonians will have no symptoms of COVID-19. \n\nSome Oregonians will die.\n\nAnd some Oregonians will survive, but live with health effects for a long, long time. This is not just the flu.\n\nPlease protect yourself and others by wearing a face covering. A ventilator, paralyzed lungs and a long recovery: how Salem Hospital cared for one of the region's... Salem Hospital nurse Sierra Schneider was shocked when Teresa Miranda came into the ICU on March 15 with her lungs shutting down from a serious Covid infection. Now, Schneider details how she and her... salemreporter.com", "2020-07-07T23:25:33.000Z": "This makes zero sense. Why wouldn't you want to collaborate with medical experts all across the world when we're battling a global health crisis? Trump administration moves to formally withdraw US from WHO The White House has officially moved to withdraw the United States from the World Health Organization (WHO), a senior administration official confirmed Tuesday, breaking ties with a global public thehill.com", "2020-07-07T21:40:12.000Z": "I don't want to see that happen, but it is the reality we face. July can be a turning point. Oregonians must continue to wear face coverings and practice physical distancing or we could quickly find that a safe return to the classroom is beyond our reach.", "2020-07-07T21:40:11.000Z": "Today, I convened the first meeting of the Healthy Schools Reopening Council. With the current rise in COVID-19 cases across Oregon, it is clear that we have our work cut out for us in figuring out how students, educators, and staff can return to classrooms safely this fall.", "2020-07-07T18:33:56.000Z": "Wearing a mask is easy and helps protect workers and communities. We're all in this together, #Oregon ! #MaskUp", "2020-07-03T00:30:15.000Z": "Beaver nation..stay safe and wear your masks! Let's all do our part to keep each other safe. Go Beavs!", "2020-07-07T19:44:12.000Z": "Small businesses across Oregon want to stay open while keeping their employees and their customers safe. Listen to why they're asking you to #MaskUp4SmallBiz and wear a face covering at their shops, restaurants, breweries, and other independent businesses.", "2020-07-06T23:25:43.000Z": "As anyone with young children at home knows, Oregon's early learning educators and child care providers have their work cut out for them tending to health, safety, and learning during this pandemic.", "2020-07-06T21:03:11.000Z": "Take it from James Mattis, former Defense Secretary, Retired General, and a Washington state native: we can slow the spread of #COVID19 in Oregon, Washington, and the rest of America: \"Divisiveness will never work to defeat an enemy. We can get through this if we're united.\" Quote Tweet WA Emergency Management @waEMD Our big thanks to fellow Washingtonian, former Defense Secretary Gen. (Ret) James Mattis for joining our efforts to slow the spread of #COVID19 . Gen Mattis knows now is not the time to let down our guard - maintain distance and #MaskupWA . Show this thread", "2020-07-06T20:15:47.000Z": "Oregon is still experiencing a record-breaking spread of COVID-19 in rural and urban communities across the state. \n\nWe can slow the spread of the disease by all practicing the three Ws: Wear a mask Wash your hands Watch your distance", "2020-07-05T16:04:04.000Z": "Oregonians flattened the curve once, and we can do it again. But crushing COVID-19 is going to take each and every one of us doing our part: physical distancing and wearing a face covering around others. Thanks for the good example, @PaulBunyanPDX  @redmondair & Sweet Wife Baking!", "2020-07-04T18:24:43.000Z": "Photo thread: Why do you wear a mask? We asked people in Ontario this week after Gov. Kate Brown on July 1 mandated face coverings for all Oregonians in public indoor spaces. From protecting loved ones and neighbors, Malheur County residents told us why they mask up.", "2020-07-05T01:51:37.000Z": "COVID-19 doesn't take holidays off. But some things COVID can never take from us: a cold Oregon craft beer, a hot dog, and our love for our country. Be careful today and stay safe. Happy Independence Day! Fourth of July, 2020 youtube.com", "2020-07-04T18:47:39.000Z": "Wearing a mask is a simple, common sense way to protect yourself and others. A mask should not be another way to divide us. Masks save lives. This 4th of July, don't accidentally kill someone. Wear a mask and social distance.", "2020-07-04T15:16:34.000Z": "I join nearly two dozen mayors from the coast to the Gorge to central Oregon to eastern Oregon in asking you to celebrate the 4th of July responsibly: Avoid crowds & keep 6 ft apart Think hard about social gatherings Wear a face covering Don't spark a wildfire", "2020-07-04T01:16:12.000Z": "Today we mourn the loss of Michael Gibbons, Oregon's \"poet with a paintbrush.\" Dan and I treasure two of his paintings, which were donated to Mahonia Hall. I took a moment with them to reflect on Michael's contributions to our great state. My thoughts are with his wife, Judy.", "2020-07-03T23:43:55.000Z": "This week several Oregon State Police officers made headlines when they ignored my face covering requirement. I'm focused on saving lives, not firing people for making a single mistake. So today I invited three of them to sit down with me at Mahonia.", "2020-07-03T23:43:54.000Z": "In the world of social media, it's easy to condemn someone when they make a mistake and keep scrolling by. But you can judge a person's character by whether they own up and make things right.", "2020-07-03T21:09:36.000Z": "Don't catch COVID-19 at a bar, restaurant, or BBQ this July 4. Make sure you're keeping your distance and wearing a face covering when not eating or drinking. State inspectors will be out in force ensuring businesses comply with face covering requirements. 7-3-20 COVID-19 Announcement youtube.com", "2020-07-03T18:30:04.000Z": "I am adding eight counties with alarming COVID-19 spread to a Watch List: Jefferson, Lake, Lincoln, Malheur, Morrow, Umatilla, Union, Wasco. Counties on the Watch List to face restrictions if metrics don't improve.", "2020-07-03T16:58:48.000Z": "We all love BBQs on the Fourth - but COVID-19 doesn't take holidays off. Memorial Day gatherings helped spread infections across Oregon.\n\nTake steps to protect your friends and family and think hard about the risks this year.", "2020-07-03T01:24:05.000Z": "+ = Quote Tweet GoDucks @GoDucks Leaders lead wearing masks. @GoDucks head coaches and @TheOregonDuck want you to stay safe and #MaskUp . #GoDucks Show this thread", "2020-07-02T22:58:28.000Z": "We have a chance this 4th of July weekend to keep Oregon's COVID-19 numbers from following the skyrocketing trajectory of Texas, Florida, and Arizona. You can help to save lives again by keeping gatherings small and wearing a face covering. What happens next is up to all of us.", "2020-07-02T21:02:37.000Z": "This is your chance to give the @TimbersFC an assist! We can all be good teammates by wearing face coverings so we don't unknowingly infect those around us. \n\nGood luck to the Timbers at the MLS tournament! Quote Tweet Portland Timbers @TimbersFC Take it from @kingjebo and @DiegoDv8 : COVID-19 is no game. We all want our lives to get back to normal, and we all need to play our part. That starts with wearing a mask in public. #RCTID", "2020-07-02T20:06:53.000Z": "If you want your favorite restaurants and shops to stay open, wear a face covering and practice physical distancing to reduce the spread of the disease. \n \nAll of us must take these simple steps to slow the spread of this deadly virus.\n\nWe're all in this together.", "2020-07-02T20:06:52.000Z": "It is inexcusable that a few Oregon State Troopers disregarded my face covering requirement yesterday & ignored a request from a fellow Oregonian to follow the rule. Oregon State Police Superintendent Hampton & I agree their actions and behaviors were absolutely unacceptable.", "2020-07-02T18:35:04.000Z": "The 56th anniversary of the landmark Civil Rights Act is a time to look back at how far America has come - and to fully commit ourselves to the immense work we still must do in the fight for equity and racial justice. Quote Tweet Thurgood Marshall Institute @TMI_LDF 56 years ago, the Civil Rights Act of 1964 was signed into law. This landmark piece of legislation ended segregation & barred employment discrimination based on race, color, sex, religion, and national origin. It remains a vital tool in the fight racial injustice. #OTD", "2020-07-02T16:06:28.000Z": "Wearing a mask is a simple, commonsense way to protect yourself and others. A mask should not be another way to divide us. Masks save lives. This 4th of July, don't accidentally kill someone. Wear a mask and social distance.", "2020-07-02T01:55:57.000Z": "Protect your health and your community by keeping your 4th of July celebrations small, local, and with face coverings. We saw a lot of new COVID-19 cases after Memorial Day weekend. Another spike from the 4th could mean our hospitals become overwhelmed by new cases within weeks.", "2020-07-01T21:35:41.000Z": "Oregonians, you have made incredible sacrifices over the last several months and saved thousands of lives. Requiring face coverings statewide will protect our friends, families, and neighbors from this disease.", "2020-07-01T19:18:48.000Z": "I want the requirement to wear face coverings and the science that's driving that requirement to be as clear as possible. If you have questions, tune in at 12:30 today for some helpful tips, face covering facts, and a live Q&A with @OHAOregon 's experts to answer your questions. Quote Tweet OR Health Authority @OHAOregon Got questions about face coverings? Join our experts at 12:30 tomorrow, July 1, for some helpful tips, face covering facts and a live Q&A to answer YOUR questions on Facebook: http:// ow.ly/wu7G50Amm8T  #COVID19", "2020-07-01T17:45:34.000Z": "Tune in at 11am for my press conference on the state of COVID-19 in Oregon, including the face covering requirement: Press Briefing with Gov. Kate Brown, July 1, 2020 youtube.com", "2020-07-01T17:13:06.000Z": "Throughout COVID-19 and long before, essential workers in Oregon have provided a model of unity and selfless service to our communities. I've proclaimed July 1-7 as Essential Workers Week to make sure we shown respect and appreciation to these vital Oregonians.", "2020-07-01T03:36:22.000Z": "It's this simple: wearing a face covering may save a life. \n\nYou don't want to be the one who accidentally spreads COVID-19 to someone's grandma, your neighbor, a kid with asthma, or the grocery store clerk.\n\nWear a face covering. Save lives.", "2020-07-01T00:03:24.000Z": "We can disagree about a whole lot of things. But everyone ought to agree that wearing a face covering isn't a political statement. Or a way to divide us. It's a way to save lives. Quote Tweet Leader McConnell @senatemajldr We must have no stigma, none, about wearing masks when we leave our homes and come near other people. Wearing simple face coverings is not about protecting ourselves, it is about protecting everyone we encounter.", "2020-06-30T22:15:48.000Z": "Today, I extended the COVID-19 state of emergency for 60 days. The choices we make will determine if Oregon flattens the curve of new COVID-19 infections, or sees a devastating spike in cases that overwhelms our hospital capacity next month. What happens next is up to all of us.", "2020-06-30T20:05:57.000Z": "This is no time for Oregonians to lose their homes or businesses. Thanks to legislators, today I extended the residential & commercial eviction bans through Sept 30. Renters can repay back rent through March 31, 2021 without late fees or being reported to credit agencies.", "2020-06-30T04:08:01.000Z": "In Oregon, voting from home has bipartisan support. Take it from Republican @OregonSOS Bev Clarno. While COVID-19 has disrupted in-person elections around the country, Oregon had record turnout for the May primary, and no one had to risk their health to cast their ballot. Quote Tweet 60 Minutes @60Minutes \"Try it, you might like it.\"  \n\nOregon's Republican Secretary of State, Beverly Clarno, responds to President Trump's claim that vote by mail is dangerous and subject to fraud. Oregon pioneered the practice in 1998. https:// cbsn.ws/2NDGBUM", "2020-06-29T23:40:20.000Z": "Since the beginning of this pandemic, grocery employees have worked selflessly to keep Oregonians fed. The Northwest Grocery Association is issuing an \"urgent call to the public\" to wear a mask, no matter the grocery store. Please help keep our grocery employees and stores safe.", "2020-06-29T21:01:20.000Z": "Keeping Oregonians safe is my top priority. Over the last month, COVID-19 spread at an alarming rate in both urban and rural counties. That's why I'm requiring face coverings in indoor public places in ALL counties, effective 7/1. We can & must reduce the spread of this disease.", "2020-06-29T16:12:46.000Z": "To lead thriving lives, Oregonians must have the ability to control our own bodies and make informed decisions about our health. Today, the U.S. Supreme Court's decision adhered to decades of its own precedent to maintain protections for our reproductive rights and freedom. Quote Tweet The Associated Press @AP BREAKING: The Supreme Court has struck down a Louisiana law regulating abortion clinics, reasserting a commitment to abortion rights over fierce opposition from dissenting conservative justices in the first big abortion case of the Trump era. http:// apne.ws/WpRMeHH", "2020-06-29T01:31:00.000Z": "Pride is a time to celebrate our successes, and also double down on our efforts to ensure that everyone in our communities has the opportunity to unabashedly be themselves, here in Oregon and across the country. #PrideDay Quote Tweet Governor Kate Brown @OregonGovBrown Today, on June 28th, 1969, a riot started at the Stonewall Inn. The riots were led by black, trans, and bi women, to the continued traditions of this spirited celebration, it's important to celebrate the rich history of all that has created pride in our communities.", "2020-06-29T01:30:31.000Z": "Today, on June 28th, 1969, a riot started at the Stonewall Inn. The riots were led by black, trans, and bi women, to the continued traditions of this spirited celebration, it's important to celebrate the rich history of all that has created pride in our communities.", "2020-06-28T19:24:00.000Z": "I've always admired how Oregonians look out for each other. Now those who have recovered from COVID-19 can help other Oregonians by donating their plasma, which contains critical antibodies that may be used to create an experimental treatment.\nLearn more: COVID-19 Plasma Donations Needed You survived COVID-19 and could help others do the same, by donating your plasma today! cslplasma.com", "2020-06-28T16:45:10.000Z": "Protect yourself, your family, and your community by wearing a face covering. Support your community by buying it from a local business. Where Can I Get a Cloth Face Mask Made in Oregon? - My Oregon News Shop local! There are Oregon-owned businesses and groups are producing quality cloth face masks that will keep you and your community safe myoregon.gov", "2020-06-27T23:42:50.000Z": "When it comes to preventing wildfires, there's a lot at stake. In 2018, we had 897,263 acres burn in Oregon; over 70% of our wildfires are started by people, often from debris burning or unattended campfires. For more info on how you can help, visit http:// keeporegongreen.org", "2020-06-27T19:21:20.000Z": "I'm going live on Facebook in 15 minutes to discuss the end of special session-COVID-19 and police accountability.", "2020-06-27T02:29:48.000Z": "I called a special session to address two crises affecting Oregonians: the economic impacts of the COVID-19 pandemic and the epidemic of police violence. I'm proud of what legislators accomplished, but it's not the end of this work. It's the beginning. End of June 2020 Special Session youtube.com", "2020-06-26T23:49:16.000Z": "Face coverings will save lives. Last week, I announced the 7 counties where it's required to wear a face covering in indoor, public spaces. Other counties can request to opt in.\n\nClatsop County Board of Commissioners requested to join and will be the 8th county, effective 7/1.", "2020-06-26T20:56:34.000Z": "Healthcare reduces human suffering. To rip away protections - in the middle of public health crisis - is extraordinarily cruel.\n\nThanks in part to the Affordable Care Act, 95% of Oregonians have healthcare. If the President gets his way, 546,000+ Oregonians could lose coverage. Quote Tweet The New York Times @nytimes The Trump administration asked the Supreme Court on Thursday to overturn the Affordable Care Act. If successful, this would bring a permanent end to the health insurance program known as Obamacare and wipe out coverage for as many as 23 million Americans. https:// nyti.ms/3i6F7jO", "2020-06-26T17:46:58.000Z": "The success of Oregon's students depends on feeling seen, safe, and welcome, however you identify.  I am committed to supporting strategies that are grounded in equity and will support Oregon's LGBTQ youth on the path to achievement. #Pride Quote Tweet OR Dept of Education @ORDeptEd LGBTQ2SIA+ students have a right to a safe, supportive & inclusive education free from violence, harassment & discrimination. Read more about our LGBTQ2SIA+ Student Success Plan released today: https:// content.govdelivery.com/accounts/ORED/ bulletins/29275c6   #Pride2020", "2020-06-26T16:16:34.000Z": "To all of the Oregonians marching every night to call for racial justice, know that I stand with you. And I want you to stay healthy.", "2020-06-25T22:56:13.000Z": "For weeks, Oregonians have taken to the streets calling for racial justice. Together, we are working toward creating a more racially- and economically-just Oregon. I am hopeful I will be able to sign into Oregon law bills on true police accountability and reform. #orpol  #orleg", "2020-06-25T19:31:19.000Z": "I took immediate action in March to halt evictions so Oregon families could stay in their homes during this pandemic. Now, we need further action to aid Oregonians who, through no fault of their own, have struggled to pay rent during this crisis. #Orleg  #Orpol", "2020-06-25T17:31:59.000Z": "Today marks 7 years since the Voting Rights Act was gutted, leading to voter suppression in communities of color nationwide. The House passed a law nearly 200 days ago to #RestoretheVRA ; now the Senate MUST act. Voting rights shouldn't be partisan. Election chaos renews focus on gutted Voting Rights Act ATLANTA (AP) - When some Georgia voters endured a pandemic, pouring rain and massive waits earlier this month to cast their ballot, President Donald Trump and other Republicans blamed local... apnews.com", "2020-06-24T22:21:56.000Z": "Your health & safety is my top priority during this pandemic. As governors, we have the chance to craft a blueprint that puts the needs of our underserved communities at the forefront, creating a more equitable society. I'm proud to serve Oregon every day. These Governors Are Helping Americans Survive a Global Pandemic None of them expected this fight while in office-but they are doing everything they can to protect their constituents. oprahmag.com", "2020-06-24T15:26:20.000Z": "Today the mask requirement for public indoor spaces goes into effect for Multnomah, Clackamas, Washington, Marion, Polk, Hood River, and Lincoln counties. This will save lives. Let me share with you why I wear a mask, and why I hope you will too.", "2020-06-23T21:40:48.000Z": "There are some mask myths circulating on social media. The fact is, masks are an excellent way to reduce the spread of COVID-19, along with physical distancing and hand washing. \n\nSo wear a mask and spread the word - not the virus.", "2020-06-23T19:15:17.000Z": "Throughout this pandemic, telehealth has provided Oregonians with essential access to health care services that otherwise might have been unavailable. I'd like to thank insurers for partnering with us to continue to make telehealth options available. State of Oregon Announces Telehealth Agreement for Health Insurance Plans - My Oregon News All insurance companies in Oregon are required to continue expanded coverage for telehealth services at the rate established during the COVID-19 pandemic myoregon.gov", "2020-06-22T21:31:43.000Z": "Local businesses will only be able to stay open if each of us does our part to follow health and safety protections like wearing a mask or face covering. The coffee shop, your favorite restaurant, your gym, the brewery down the street: they can only stay open if you stay safe.", "2020-06-22T18:58:45.000Z": "When it comes to preventing wildfires, there's a lot at stake. In 2018, we had 897,263 acres burn in Oregon; over 70% of our wildfires are started by people, often from debris burning or unattended campfires. For more info on how you can help, visit http:// keeporegongreen.org", "2020-06-22T16:17:57.000Z": "Mr. President, please explain: Why should vote-by-mail be reserved exclusively for residents of 1600 Pennsylvania Ave? Quote Tweet Donald J. Trump @realDonaldTrump Because of MAIL-IN BALLOTS, 2020 will be the most RIGGED Election in our nations history - unless this stupidity is ended. We voted during World War One & World War Two with no problem, but now they are using Covid in order to cheat by using Mail-Ins!", "2020-06-21T23:32:05.000Z": "https:// washingtonpost.com/politics/kentu cky-braces-for-possible-voting-problems-in-tuesdays-primary-amid-signs-of-high-turnout/2020/06/19/b7b960ce-b199-11ea-8f56-63f38c990077_story.html  This is bonkers and completely unacceptable. Going from 3700 polling locations down to 200 for Tuesday's election. This isn't what democracy looks like. Kentucky braces for possible voting problems in Tuesday's primary amid signs of high turnout Trepidation about how pandemic-era voting will play out in Kentucky comes on the heels of troubled primaries around the country this spring. washingtonpost.com", "2020-06-21T22:27:13.000Z": "This is First Gentleman Dan here. Help me in wishing my love a great 60th birthday! Thank you for all you do for Oregon and for our family.", "2020-06-21T16:22:55.000Z": "Happy Father's Day to all of Oregon's great dads! One of my life's greatest joys has been seeing Dan be such a loving, devoted father.", "2020-06-20T14:29:33.000Z": "Refugee resettlement in America is a lifeline for the world's most vulnerable. Yet the president reduced refugee acceptance from 110,000 people to only 18,000.\n\nOregon will continue to be a welcoming home to all, especially our refugee communities. World Refugee Day 2020 youtube.com", "2020-06-19T22:15:50.000Z": "Take it from @OregonSOS Bev Clarno: Vote-by-mail is safe, secure, and healthy. While COVID-19 disrupted in-person elections around the country, Oregon had record turnout for the May primary, and no one had to risk their health to cast their ballot. Vote By Mail Works - Especially in a Pandemic - My Oregon News Oregon Secretary of State Bev Clarno celebrates Vote By Mail as 1.3 million Oregonians exercise their right to vote - the highest turn out rate of 2020. myoregon.gov", "2020-06-19T18:13:52.000Z": "It's really this simple: Face coverings save lives.\n\nLearn more ( https:// bit.ly/3ehpO5J ) about the new requirement for wearing face coverings in indoor public spaces beginning June 24 in Multnomah, Clackamas, Washington, Marion, Polk, Hood River, and Lincoln counties.", "2020-06-19T16:31:51.000Z": "On #JUNETEENTH2020 , we mark the anniversary of the day in 1865 when the last enslaved Black Americans in the U.S. were declared free. And we recommit ourselves to keep fighting for change until Oregon - and all of these United States - reflect racial justice.", "2020-06-19T15:25:10.000Z": "Starting 6/24, face coverings are required for indoor public spaces in Multnomah, Washington, Clackamas, Hood River, Marion, Polk, & Lincoln counties. As we live with this disease for the foreseeable future, face coverings need to become a part of our daily lives to stay safe.", "2020-06-18T23:58:17.000Z": "Vic will always be remembered as a stand-up State Representative in the Oregon Legislature who was well respected on all sides of the political spectrum. He brought kindness, levity, and humor to compassionate work, and his legacy will live on. Former Oregon Rep. Vic Gilliam dies A Republican lawmaker who served for a decade in the Oregon Legislature and resigned in 2017 for health reasons has died, the GOP leadership said Thursday. Victor Gilliam, of Silverton, was 66 years... katu.com", "2020-06-18T23:24:58.000Z": "I'm officially proclaiming June 19 as Juneteenth in Oregon and I will introduce a bill in 2021 to make it a state holiday. Celebrating Black freedom this year is fiercely important as people around the world protest systemic racism and undeniably show that Black Lives Matter. Quote Tweet Pharrell Williams @Pharrell . @OregonGovBrown please join Virginia and New York and make Juneteenth a paid holiday in Oregon for state employees. Thank you Show this thread", "2020-06-18T17:51:55.000Z": "Tune in at 11am for my press conference on next steps in the county reopening process: Press Briefing with Gov. Kate Brown, June 18, 2020 youtube.com", "2020-06-18T14:38:14.000Z": "Dreamers, brought to the U.S. as kids, embody the American dream. While @USSupremeCourt kept #DACA in place for now, the president may still try to end it. Oregon's 12,000 valued Dreamers serve in our military, work in our hospitals, pay taxes, & make our communities stronger.", "2020-06-17T21:51:20.000Z": "Starting next week I will be instituting a requirement for face coverings while in indoor, public spaces for the following counties: Multnomah, Washington, Clackamas, Hood River, Marion, Polk, and Lincoln Counties. Full details available shortly. (2/4)", "2020-06-17T21:51:19.000Z": "As we learn more about COVID-19, we're refining our strategies to prevent its spread. This means increased testing, strictly enforcing health and safety standards, a new face covering requirement, and calling on the public to remain cautious. https:// youtube.com/watch?v=wApghm OOZxs  (1/4) 6-17-20 Reopening Announcement youtube.com", "2020-06-17T17:07:09.000Z": "Congratulations to @alyssafarrow_ and all of Oregon's class of 2020. The world needs your talents, skills, and knowledge. And now more than ever, the world needs your compassion and kindness. I can't wait to see what you do next. Quote Tweet alyssa @alyssafarrow_ I graduated college today. First-generation, low-income, and first from my tribe to graduate from Stanford. \nWild. Show this thread", "2020-06-16T23:34:28.000Z": "In Alabama, a state with 25,000 confirmed COVID cases and more than 700 deaths, it's a relief that voters won't have to risk their health to make their voices heard.\n\nAlabama should join Oregon in voting from home. It's healthy, safe, and secure - even the President does it. Quote Tweet CBS News @CBSNews Federal judge blocks Alabama voting restrictions ahead of July runoff https:// cbsn.ws/3e3hWoh", "2020-06-16T17:35:38.000Z": "I'm calling a special session to take up two urgent issues facing our state: police accountability and the COVID-19 pandemic. These are too urgent to wait until the next regular legislative session. It's imperative that the Legislature take action on these issues right away.", "2020-06-16T15:57:16.000Z": "A few recent favorites:\n\nStamped from the Beginning, Ibram X. Kendi\n\nThe New Jim Crow, Michelle Alexander\n\nWashington Black, Esi Edugyan\n\nThe Girl Who Fell From the Sky, Heidi W. Durrow (Oregonian!)\n\nYour Silence Will Not Protect You, Audre Lorde\n\nSalvage the Bones, Jesmyn Ward", "2020-06-16T15:57:15.000Z": "As an avid reader, I'm happy to share some books by Black writers that I read recently and loved. I'm joining the movement to purchase two (or more!) books by Black writers this week to fill bestseller lists with Black voices. #BlackoutBestsellerList", "2020-06-16T04:36:35.000Z": "As the nation's first openly-LGBTQ Governor, today's Supreme Court ruling is personal for me. No one should live in fear that they're going to lose their job because of who they are or who they love. Quote Tweet The Last Word @TheLastWord . @OregonGovBrown tells @Lawrence about her own experiences fighting for LGBTQ rights and praises the Supreme Court ruling prohibiting employers from firing workers based on sexual orientation or gender identity. https:// on.msnbc.com/30PnhvB", "2020-06-16T00:52:31.000Z": "Today's victory comes days after the Trump administration reversed health protections for transgender and non-binary people - reckless and heartless to take away protections from vulnerable people during a global pandemic.", "2020-06-16T00:52:30.000Z": "Today the U.S. Supreme Court took significant action to protect LGBTQ workers from discrimination. Many have feared getting fired simply because of who they are or who they love. This decision marks a historic, necessary change to ensure equality and inclusion for all.", "2020-06-15T18:33:26.000Z": "Oregon's Class of 2020: I can't wait to see what you do next. In case you missed it, you can watch my statewide commencement address here ( https:// youtube.com/watch?v=-fDxET k9wVI&feature=youtu.be  ) celebrating your tenacity and all you've achieved. Congratulations, graduates!", "2020-06-15T15:19:33.000Z": "Victory! Quote Tweet The New York Times @nytimes Breaking News: In a landmark ruling, the Supreme Court found that a 1964 civil rights law protects L.G.B.T. workers from discrimination https:// nyti.ms/3hrVION", "2020-06-14T15:56:16.000Z": "Graduation is a momentous milestone - I remember mine like it was yesterday. Join me today for a statewide commencement address on @OPB TV at 2:30pm & radio from 10:30-11am ( https:// bit.ly/3fcDyPc ) to celebrate all that Oregon's Class of 2020 has achieved. Congrats, graduates!", "2020-06-14T00:51:51.000Z": "The lack of a traditional graduation ceremony can't diminish the magnitude of the Class of 2020's accomplishments. Tomorrow, join me in celebrating all they've achieved with a statewide commencement address on @OPB TV & radio. Governor Kate Brown Delivers Commencement Address to Oregon's 2020 Graduates - My Oregon News The state's high school and college graduates will receive a special message from the Governor on June 14th. myoregon.gov", "2020-06-13T23:50:18.000Z": "Voting by mail should be implemented nationwide. \n\nPass it on.", "2020-06-13T17:35:18.000Z": "Make no mistake about it: Chipping away at anyone's health insurance during a global pandemic is reckless and heartless. The trans community deserves better from this white house and their leaders. This will have devastating impacts and is wrong. Transgender Health Protections Reversed By Trump Administration Trump has reversed Obama-era protections that prohibit discrimination in health care based on gender identity. Critics warn the rule could harm a vulnerable group - LGBTQ people - during a pandemic. npr.org", "2020-06-12T23:56:39.000Z": "Throughout our nation's history, women have served courageously on and off the battlefield. On Women Veterans Day, we celebrate the contributions of the 25,000 women veterans who live in Oregon, as well as all those who came before them. Thank you for your service.", "2020-06-12T22:46:39.000Z": "The statewide one-week pause on additional reopening is the result of an increase in COVID-19 cases in both urban and rural parts of Oregon. This pause will give public health experts time to assess the spread of the virus and determine if we need to adjust our approach.", "2020-06-12T15:42:49.000Z": "Tune in for my press conference at 9am about the one-week statewide pause on pending county applications for reopening: Press Briefing with Gov. Kate Brown, June 12, 2020 youtube.com", "2020-06-12T02:22:51.000Z": "This one-week pause will give public health experts time to assess what factors are driving the spread of the virus. I will use the data we see in the next week to determine whether to lift this pause or extend it.", "2020-06-12T02:22:50.000Z": "As we began reopening nearly a month ago, I was clear that reopening Oregon comes with risks, and that COVID-19 case counts would rise. We now see a significant increase in COVID-19 infections in counties across Oregon and it is cause for concern.", "2020-06-11T18:42:28.000Z": "Glad to see @taylorswift13 joining the vote-by-mail movement! More Oregonians than ever before voted in our recent primary election, and no one had to risk their life to cast their ballot. It's time for every state to vote from home in 2020. Quote Tweet Taylor Swift @taylorswift13 We need to fight for mail-in voting for the 2020 election. No one should have to choose between their health and having their voice heard. http:// VOTE.ORG Show this thread", "2020-06-11T01:11:43.000Z": "I've been inspired to see tens of thousands of Oregonians raising their voices to demand justice and make it clear that #BlackLivesMatter . I stand with you. And I want you to stay healthy.", "2020-06-10T13:53:00.000Z": ". @OregonGovBrown called out President Trump for his baseless claims that vote-by-mail leads to fraud", "2020-06-10T18:04:08.000Z": "The pandemic has disproportionately impacted BIPOC students. My Healthy Schools Reopening Council will include community voices so students can return to school safely with equitable access to the tools to learn and achieve. https:// oregon.gov/newsroom/Pages/NewsDetail.aspx?newsid=36769 ", "2020-06-10T17:04:42.000Z": "The initial 2020-21 school year guidance, entitled Ready Schools, Safe Learners, provides schools flexibility to develop a local blueprint for safely starting school next year. #ReadySchools  #SafeLearners Our release: https:// content.govdelivery.com/accounts/ORED/ bulletins/28fed4a ", "2020-06-10T17:23:04.000Z": "Returning to school in the fall will not look the same as it did before COVID-19. The @ORDeptEd Ready Schools, Safe Learners process will help communities develop reopening plans that keep students safe and provide them with a high-quality education. https:// oregon.gov/ode/students-a nd-family/healthsafety/Pages/Planning-for-the-2020-21-School-Year.aspx ", "2020-06-10T01:44:27.000Z": "In the beginning of this pandemic, we moved quickly to protect residents and staff of long-term care facilities with strict visitation policies. Now, we will test all residents and staff, starting with facilities most at-risk. Governor Kate Brown Announces Comprehensive Coronavirus Testing Plan for Long-Term Care Facilities... Strategy will test all residents and staff, starting with the most at-risk facilities. myoregon.gov", "2020-06-09T22:28:23.000Z": "Every eligible voter deserves to have their voice heard - that's the foundation of our democracy.\n\nBefore November, every state should follow Oregon's lead and enact vote by mail. It's safe, secure, accessible, and protects public health. New voting machines lead to lines and problems on Georgia election day Problems with Georgia's new voting computers plagued the state's primary election Tuesday, leading to lines and voters leaving without casting their ballots. ajc.com", "2020-06-09T15:37:32.000Z": "When it comes to preventing wildfires, there's a lot at stake. Last year, almost 80,000 acres burned in Oregon; over 70% of our wildfires are started by people, often from debris burning or unattended campfires. For more info on how you can help, visit http:// keeporegongreen.org", "2020-06-08T18:16:46.000Z": "The @ORemployment will leave no stone unturned until 100% of eligible Oregonians get their unemployment checks. Starting last week, 154 state employees from across state government volunteered to call Oregonians waiting on claims and clear the backlog. State Employees Volunteer to Clear Unemployment Backlog - My Oregon News Volunteers in the Employment Department step up to help Oregonians receive the benefits they deserve. myoregon.gov", "2020-06-07T16:10:16.000Z": "During #PrideMonth , I'm remembering the trans women of color at Stonewall who kickstarted so much progress on LGBTQ rights. In our quest for justice & equality, we've made big strides - but we still have so far to go. We can't rest until *everyone* is safe, included, and valued.", "2020-06-06T21:09:50.000Z": "As we build a safe and strong Oregon, we must reopen carefully, guided by science. Counties are in baseline, Phase 1, and Phase 2, depending on health metrics. Please stay local to protect our communities. Visit http:// coronavirus.oregon.gov to learn more about your county status.", "2020-06-06T17:01:53.000Z": "On the anniversary of D-Day, when American service members put their lives on the line to end WWII in Europe, we reflect on their bravery and sacrifice. Help @OregonDVA collect their stories, to inspire more generations with their courage and dedication. https:// myoregon.gov/2020/06/05/wwi i-oral-histories/ ", "2020-06-05T21:59:09.000Z": "This should have been Breonna Taylor's 27th birthday. But instead of celebrating, we're mourning that her life was taken 84 days ago by police officers. Today, we remember, we #SayHerName - and we work for racial justice so it never happens again.", "2020-06-05T15:40:32.000Z": "On National Gun Violence Awareness Day, I #WearOrange . Gun violence is yet another way we see the racial inequities in America: Black Americans are 10x more likely to die by gun homicide than white Americans. Every Oregonian deserves to live a life that is safe from violence.", "2020-06-04T20:31:57.000Z": "We must commit to fundamental change. Words are not enough. We need collective action for racial justice. Here is a list of resources to sustain the momentum of this moment and harness this energy toward making true progress. Resources for Supporting Racial Justice in Oregon - My Oregon News Learn about how to get involved with local organizations that have been fighting for decades for racial justice myoregon.gov", "2020-06-04T15:21:30.000Z": "Today we lower Oregon flags to half-staff across the state in honor of George Floyd. As we mourn his death, let us remember the many Black lives that have been taken by unnecessary violence. And let us commit ourselves, and our country, to fundamental change.", "2020-06-03T19:10:43.000Z": "A final reminder: Any reopening comes with risk. Oregonians, you have another chance to shine. A chance to show that you are looking out for your friends, family and neighbors by slowing the spread of the disease.", "2020-06-03T19:10:42.000Z": "Counties that are approved for Phase 2 will be able to relax some of the restrictions and reopen some sectors. In addition, @OHAOregon is issuing updated guidance for the entire state around zoos, museums, outdoor gardens, and sports.", "2020-06-03T19:10:41.000Z": "Ten weeks ago, I announced the Stay Home order. Many of us hoped this would be a quick detour from our normal lives. I know it's frustrating that reopening has to move slowly. I know our economy has taken a devastating blow. But this careful, cautious approach is saving lives.", "2020-06-03T18:09:08.000Z": "*Technical issues causing a delay* The press conference about Phase 2 should be live in a few minutes. Press Briefing with Gov. Kate Brown, June 3, 2020 youtube.com", "2020-06-03T17:07:09.000Z": "La gobernadora @OregonGovBrown ofrecerá una conferencia de prensa para hablar sobre la Fase 2 de la reapertura. Los invitamos a acompañarnos en nuestra página de Facebook, OHA en Español, para escucharla en español, miércoles, 3 de junio a las 11:00 a.m.: https:// facebook.com/OHAespanol/", "2020-06-03T17:50:17.000Z": "Tune in at 11am for my press conference about Phase 2: Oregon Coronavirus Information & Resources Oregon Coronavirus Information & Resources govstatus.egov.com", "2020-06-02T00:24:13.000Z": "I want to ensure that the public can safely raise their voices in this much-needed call for reform. In response to a request from Mayor Wheeler, I'm calling in 50 @OregonGuard members to provide a support function only.", "2020-06-02T00:24:12.000Z": "The killing of George Floyd is a stain on this country. A single senseless death is one too many. To everyone who is hurting right now, I hear you. I stand with you. And I add my voice to yours.", "2020-06-01T21:45:12.000Z": "Watch my 3pm press conference here: Press Briefing with Gov. Kate Brown, June 1, 2020 youtube.com", "2020-05-31T20:19:27.000Z": "Amidst the pandemic, the delays from @ORemployment in delivering unemployment benefits to out-of-work Oregonians are unacceptable. This is an unprecedented crisis, and the problems at the department demand an urgent response. It's time for a change.", "2020-05-31T00:08:25.000Z": "Portlanders: Mayor @tedwheeler has declared a state of emergency with an 8pm curfew tonight. Here are answers to some questions you might have. Temporary Curfew Frequently Asked Questions portland.gov", "2020-05-30T23:18:54.000Z": "George Floyd. \nBreonna Taylor.\nAhmaud Arbery.\nPhilando Castile.\nAlton Sterling.\n \nToo many Black lives taken by racist violence. Far too many. Mourning their loss is not enough. We must commit ourselves to racial justice.", "2020-05-30T14:10:58.000Z": "In these incredibly stressful times, Oregon families are counting on the unemployment benefits they've earned. That includes fixing our computer system and providing \"waiting week\" benefits. We will make this right and ensure all Oregonians receive the maximum benefits.", "2020-05-30T14:10:57.000Z": "If you are waiting for unemployment benefits, I hear your frustration & anxiety. The delays are unacceptable. I've directed @ORemployment to clear the backlog and clearly communicate claim status. My team will not rest until every Oregonian has received what they're owed.", "2020-05-29T23:45:57.000Z": "Oregonians did a great job staying close to home last weekend. This weekend, I ask you to keep it local again, using physical distancing and face coverings. Enjoying your own community helps support local business & lowers the risk of the virus spreading, as we reopen mindfully.", "2020-05-29T22:56:32.000Z": "Los trabajadores agrícolas de OR. están al frente de COVID-19, trabajando incansablemente para proporcionar alimentos a las familias. Esta inversión provee recursos críticos para mantener a los trabajadores seguros y proteger nuestra reserva de alimentos. https:// bit.ly/3eyyDrC", "2020-05-29T22:35:15.000Z": "Oregon's agricultural workers are on the front lines of the COVID-19 crisis, working tirelessly to provide food for Oregon families. This investment provides critical resources to keep workers safe and protect our food supply. Read more: https:// bit.ly/2MdsGnC", "2020-05-29T20:07:24.000Z": "I stand with Oregon's communities of color in outrage and anguish over racism and violence, which opposes the fundamental duty of law enforcement to protect and serve. I honor the memory of George Floyd. Together, we will continue to fight for a more just Oregon, and America.", "2020-05-29T18:56:11.000Z": "We're all in this together, so please \"care enough to cover.\" Wearing a cloth face covering protects those around you. #MaskUpOR", "2020-05-28T23:43:01.000Z": "As our country passes 100,000 lives lost to COVID-19, with 151 in Oregon, it's a time to reflect. By staying home, Oregonians have helped to save the lives of family, friends, frontline workers, and fellow Oregonians. My heart is with all who have been touched by this pandemic.", "2020-05-28T22:11:24.000Z": "Oregon's farmworkers and food processors often work closely in plants or riding to/from fields, and they need protective equipment to stay safe. Now the state is providing 1 million masks, keeping everyone healthier and safer. Oregon National Guard distributes PPE to farmers across the state Recently we heard from farmers about how complying with COVID-19 regulations is going to put them under - now Oregon Governor Kate Brown is directing the distribution of masks and sanitizer t koin.com", "2020-05-28T20:30:57.000Z": "With outbreaks of COVID-19 at food processing and agricultural facilities around the U.S. and here in Oregon, we must take bold steps to keep workers healthy. The state is donating 1 million masks & 5,000 gallons of hand sanitizer to local ag workers, keeping everyone safer.", "2020-05-28T17:21:31.000Z": "Many Oregonians are facing hunger for the first time - but there's help. An additional $30 million for food assistance will allow Oregonians to receive the maximum SNAP benefit for June. Info on food resources is available for all ages and in 11 languages: http:// needfood.oregon.gov", "2020-05-27T22:11:37.000Z": "Oregon's 2020 Poetry Out Loud Oregon State Celebration is tonight at 6 p.m.! \n\nFeatured will be special appearances by former Poet Laureate Kim Stafford and current Oregon Poet Laureate Anis Mojgani @mojgani !\n\nJoin the event here: https:// facebook.com/OregonArtsComm ission/?ref=bookmarks ", "2020-05-27T23:42:25.000Z": "Oregon's dedicated agricultural workers are key to a successful harvest. Today, the state is distributing 1 million masks and 5,000 gallons of hand sanitizer for free to farmworkers and agricultural producers, to reduce the risk of COVID-19. More details: https:// oda.direct/PPEdistribution", "2020-05-27T20:21:49.000Z": "Even during a pandemic, we can all make a difference to protect our state and our neighbors from the dangers of wildfires. Please, do your part this wildfire season to help protect your fellow Oregonians, as well as the beauty & bounty of our great state. Wildfire Prevention May is Wildfire Awareness Month youtube.com", "2020-05-27T17:14:44.000Z": "I love when Oregonian student artists capture the magic of our landscape. Congratulations to Claire Bokovoy, an 11th grader at @HRVHS in Hood River, for being named a finalist in the @westgov 's \"Celebrate the West\" art competition.", "2020-05-27T15:57:04.000Z": "I'm so proud of Oregon's talented and hard-working 2020 U.S. Presidential Scholars. We can't wait to see what you do next. Congratulations!\n*Britton Masback from @catlingabel *Dana Marie Smiley from @LHSCards *Tina Trang Truong from @BensonTechPride", "2020-05-27T15:41:37.000Z": "I'm always impressed with the creativity of Oregon's students. Poetry can connect us and illuminate the world around us. Tonight at 6pm, celebrate 9 Oregon students and Poet Laureates @mojgani & @krs_stafford in a live Poetry Out Loud celebration. Oregon's Poetry Out Loud Celebration Goes Virtual During COVID-19 Pandemic - My Oregon News Nine Oregon high school students advance to the state Poetry Out Loud competition which will take place on May 17 at 6 pm. myoregon.gov", "2020-05-26T23:32:11.000Z": "In times of crisis, whether it's a fire, flood, or pandemic, I've always been proud of how Oregonians step up to take care of one another. I stand with mayors from across the state in appreciating all of you who kept it local over the holiday weekend.", "2020-05-25T16:18:08.000Z": "Today and every day we remember the fallen. We remember their courage and tenacity. We remember their dedication, determination, service, and sacrifice. Together we resolve to remember those who have given their lives in the name of peace and freedom. Honor Oregon Veterans & Service Members this Memorial Day, Close to... Stay local to honor Oregon veterans & active service members, as well as their families, by staying local this Memorial Day weekend. youtube.com", "2020-05-24T17:54:00.000Z": "Please enjoy this Memorial Day Weekend close to home. Phase I counties worked hard to prepare their health systems for reopening and need to proceed with caution. I join 26 mayors from across Oregon in asking you to please be a good neighbor by keeping it local.", "2020-05-23T16:40:50.000Z": "I join 26 mayors from across Oregon in asking you to stay local this Memorial Day Weekend. If you love the Coast, if you love the Gorge, please be a good neighbor by staying close to home for now as we build a safe and strong Oregon.", "2020-05-23T00:53:10.000Z": "Oregon's dedicated agricultural workers are key to a successful harvest. Next week, the state will donate 1 million masks and 5,000 gallons of hand sanitizer to farmworkers and agricultural producers, to reduce the risk of COVID-19. More details: https:// oda.direct/PPEdistribution", "2020-05-22T22:20:19.000Z": "If your trip takes you by one of these helpful reminders from @OregonDOT this Memorial Day Weekend, you might be going too far! Please respect the 26 mayors across the state who have asked you stay close to home for now and visit their towns later this summer.", "2020-05-22T17:10:42.000Z": "Wondering if it's OK to take a  Memorial Day Weekend road trip? Host a small BBQ? Camp? Visit your favorite beach, trail, or park? Check out these FAQs: Memorial Day Weekend FAQs - My Oregon News Wondering if it's OK to take a road trip? Host a small BBQ? Camp? Visit your favorite beach, trail, or park? Get answers here. myoregon.gov", "2020-05-22T16:29:01.000Z": "This Memorial Day Weekend, please be a good neighbor by staying local, staying safe, and supporting your local businesses. Thanks for helping to keep Oregonians healthy and safe.", "2020-05-21T19:37:59.000Z": "Please enjoy this Memorial Day Weekend close to home. Phase I counties worked hard to prepare their health systems for reopening and need to proceed with caution. Today, I joined 26 mayors from across Oregon in asking you to please be a good neighbor by keeping it local.", "2020-05-20T22:38:38.000Z": "Oregon's class of 2020 has made tremendous sacrifices, missing prom, sports, and graduation ceremonies. Yet nothing can diminish your accomplishments. I'm incredibly proud of all of you and so happy to see the innovative ways schools are celebrating. Celebrating Class of 2020 Graduates During the Pandemic - My Oregon News Class of 2020 graduates may not move their tassels and throw their mortarboards together, but Oregon schools still celebrates their accomplishments. myoregon.gov", "2020-05-20T18:37:45.000Z": ". @realDonaldTrump For 22 years in Oregon, we've been voting by mail. The result? Huge voter turnout. No security issues. And bipartisan support. No one had to risk their life to have their voice heard. So what's the problem again? Quote Tweet Donald J. Trump @realDonaldTrump Michigan sends absentee ballot applications to 7.7 million people ahead of Primaries and the General Election. This was done illegally and without authorization by a rogue Secretary of State. I will ask to hold up funding to Michigan if they want to go down this Voter Fraud path!", "2020-05-20T17:44:08.000Z": "Mr. President: Oregon has been voting by mail for 22 years. We just had a great election yesterday. It was safe, secure, accessible. And we protected public health. What more do you need to know to be convinced, @realDonaldTrump ?", "2020-05-20T17:43:59.000Z": ". @realDonaldTrump For 22 years in Oregon, we've been voting by mail. The result? Huge voter turnout. No security issues. And bipartisan support. No one had to risk their life to have their voice heard. So what's the problem again? https:// twitter.com/realDonaldTrum p/status/1263074783673102337  This Tweet is unavailable.", "null": "", "2020-05-20T03:17:33.000Z": "Art sparks connections between people, movements, and new ideas. To put it simply, art makes life better. I am thrilled to celebrate Oregon's best artists and art supporters through the Governor's Arts Awards. Apply by May 26th: Governor Kate Brown announces 2020 Governor's Arts Awards - My Oregon News In celebration of the uplifting power of art, Governor Kate Brown called for nominations for the 2020 Governor's Arts Awards. myoregon.gov", "2020-05-19T23:25:15.000Z": "Through no fault of their own, many Oregon families are facing an abrupt loss of income during this pandemic. @OregonHCS is distributing $8.5 million in rent relief to keep more families housed. State Provides $8.5 Million for Rent Relief in Oregon Communities - My Oregon News OHCS funds local Community Action groups to provide rent relief to Oregonians who need it, and they're taking applications now. myoregon.gov", "2020-05-19T23:08:51.000Z": "It's more important than ever for Oregonians to stay hopeful, informed, and connected. This first monthly issue of the My Oregon Newsletter highlights the creative and innovative ways the state is finding to serve you. https:// mailchi.mp/57a209ea91d2/n ews-from-the-state-of-oregon ", "2020-05-19T19:55:22.000Z": "The vast majority of gun owners in Oregon take seriously the responsibility of safely storing their firearms. With children home a lot more right now, please double-check today that your guns are safely secured. Safe Storage of Firearms Can Save Lives - My Oregon News Since COVID-19 has seen firearm sales increase, Oregonians are encouraged to safely store their firearms to prevent gun violence and shooting deaths myoregon.gov", "2020-05-19T17:30:51.000Z": "Thank you to all of Oregon's hardworking teachers, and congratulations to the Regional Teachers of the Year. During these unprecedented times, you've gone above and beyond to keep students engaged and provide support when they need it most. Quote Tweet OR Dept of Education @ORDeptEd Congratulations to Oregon's 2021 Regional Teachers of the Year! Thanks to @oregon_lottery ​, each teacher wins $500 and one of them will be the 2021 Oregon Teacher of the Year! https:// oregon.gov/ode/about-us/D ocuments/2021%20Oregon%20Regional%20Teachers%20of%20the%20Year.pdf   #ORTOY21", "2020-05-19T16:39:37.000Z": "Never forget: your vote is your voice, and in Oregon, your voice matters. \n\nDrop off your ballot by 8pm tonight at a dropbox location near you ( https:// sos.oregon.gov/voting/pages/d rop-box-locator.aspx  ) and you can feel proud that Oregon is leading the country in voting access. Quote Tweet Matter of Fact @matteroffacttv How common is voter fraud with mail-in ballots? @SoledadOBrien talks with @OregonGovBrown about fraud concerns as states look for ways minimize the risk of COVID-19 at the voting booth. http:// matteroffact.tv", "2020-05-19T03:27:05.000Z": "There are no shortcuts for us to return to life as it was before this pandemic. Moving too quickly could return Oregon to the early days of this crisis, when we braced for overfilled hospitals and ventilators in short supply.", "2020-05-19T03:27:04.000Z": "The Oregon Supreme Court just ruled: My emergency orders to protect the health and safety of Oregonians will remain in effect statewide while the court hears arguments in this lawsuit.", "2020-05-19T03:05:41.000Z": "Every Oregonian should have access to loans that can keep their small business afloat through this storm - but research shows that nationally, women- and minority-owned businesses are getting less aid.\n\nLearn more by calling the Small Business Navigator: 833-604-0880.", "2020-05-18T23:15:31.000Z": "Every Oregonian should have access to loans that can keep their small business afloat through this storm - but research shows that nationally, women- and minority-owned businesses are getting less aid.\n\nLearn more by calling the Small Business Navigator: 833-604-0880. Quote Tweet Portland Biz Journal @PDXBIZJournal As the state starts to reopen, Gov. Kate Brown wants banks and credit unions to increase their efforts to provide federal relief loans to the state's small businesses, especially those owned by women and people of color. https:// bizjournals.com/portland/news/2020/05/15/gov-brown-urges-banks-make-more-ppp-loans.html?ana=TRUEANTHEMTWT_PO&csrc=6398&taid=5ebec9b37d33a000011d38f2&utm_campaign=trueAnthem%3A+New+Content+%28Feed%29&utm_medium=trueAnthem&utm_source=twitter ", "2020-05-18T19:44:17.000Z": "The science behind my executive orders hasn't changed: today's ruling from the Baker County Circuit Court will be appealed to the Oregon Supreme Court within hours to keep my emergency orders in effect, ensuring we can continue to safeguard the health of all Oregonians.", "2020-05-18T03:41:59.000Z": "Wear a face covering to protect your neighbors.\n\nWear a face covering to safeguard older Oregonians.\n\nWear a face covering to defend immunocompromised kids. \n\nWear a face covering to respect doctors, nurses, police, grocery workers, and others who take a risk to serve you.", "2020-05-16T15:00:00.000Z": "Experts predict the coronavirus pandemic will stretch into the fall. Is it time to switch to mail-in only elections? @SoledadOBrien speaks with @OregonGovBrown about how her state has been doing mail only elections for the past two decades. http:// matteroffact.tv", "2020-05-17T18:47:34.000Z": "Asian Americans and Pacific Islanders have been contributing to Oregon's economy and culture for more than 200 years. Especially now, we must stand together against xenophobia, racism, & discrimination. With May as #AAPIHeritageMonth , let's honor and celebrate these communities.", "2020-05-16T22:05:55.000Z": "We will all greatly miss Representative Mitch Greenlick, who spent his career as a fierce advocate for health care and justice reform for Oregonians. Smart as a whip and with a heart of gold, he was a true Lion of the House. Dan and my hearts are with Harriet and their family.", "2020-05-16T17:26:07.000Z": "Thank you to our Armed Forces for all of the sacrifices you and your families make to keep us safe. A great celebration this month was watching the Oregon @AirNatlGuard 's Air Force Salute F-15 Eagle flyovers with Brig. Gen. William J. Prendergast IV. #ArmedForcesDay", "2020-05-16T02:53:31.000Z": "Stay close to home and support your local economy this weekend--the businesses in your community will appreciate the support. Plus, one of the many great things about Oregon is you don't have to go far to experience natural beauty.", "2020-05-15T17:54:12.000Z": "As reopening begins, the Small Business Navigator is here to help Oregon business owners, especially women and people from historically-underserved communities, receive the PPP loans they're eligible for. Call the hotline today: 833-604-0880. Oregon Businesses Encouraged to Apply for Paycheck Protection Loans Now - My Oregon News $100 billion in federal funds still available myoregon.gov", "2020-05-15T17:03:43.000Z": "During #HospitalWeek , let's all celebrate our medical personnel who are working hard, making sacrifices, and providing life-saving care to our communities all year-round. We're so grateful for everything that you do for us. #ThankYouOregonHospitals", "2020-05-15T01:41:15.000Z": "Reopening parts of our state is good news, though it comes with risk. As 31 of Oregon's counties move into Phase 1 tomorrow, we will continue to monitor testing, effectiveness of contract tracing and isolation of new cases, & hospitalizations. More info at http:// coronavirus.oregon.gov", "2020-05-14T23:11:35.000Z": "Three additional counties -- Jefferson, Morrow, and Umatilla -- have just been approved and can begin entering Phase I of reopening on May 15 under my framework for building a safe and strong Oregon. Quote Tweet Governor Kate Brown @OregonGovBrown I was incredibly impressed by the work that many counties put into their reopening applications. After thorough review, I've approved 28 counties to move into Phase 1 tomorrow.\n\nLearn more here: http:// coronavirus.oregon.gov", "2020-05-14T21:30:55.000Z": "I was incredibly impressed by the work that many counties put into their reopening applications. After thorough review, I've approved 28 counties to move into Phase 1 tomorrow.\n\nLearn more here: http:// coronavirus.oregon.gov", "2020-05-14T17:23:57.000Z": "The shared goals of good public health and a strong economy are intimately connected, not either/or. I'm focused on protecting the health and safety of Oregonians, while understanding that job loss has a negative impact on public health. Oregon Coronavirus Information & Resources Oregon Coronavirus Information & Resources govstatus.egov.com", "2020-05-14T16:45:13.000Z": "La @OregonGovBrown ofrecerá una conferencia de prensa para hablar sobre los pasos que se tomarán para reabrir el estado. Los invitamos a acompañarnos mañana, jueves, 14 de mayo a las 10:00 a.m. PST aquí en, OHA en Español: https:// facebook.com/OHAespanol/pos ts/129499615393573 ", "2020-05-14T16:45:28.000Z": "Tune in at 10am for my press conference on building a safe and strong Oregon, and counties that are moving into Phase 1: Press Briefing with Gov. Kate Brown, May 14, 2020 youtube.com", "2020-05-14T15:29:53.000Z": "Your vote is your voice - make sure it's heard. Today is the last day to safely mail in your ballot. You can still drop it off in person until Tuesday, May 19th, at 8pm. Find a drop box location here: https:// sos.oregon.gov/voting/pages/d rop-box-locator.aspx ", "2020-05-13T18:40:07.000Z": "Your vote is your voice - make sure it's heard. Tomorrow is the cutoff for Oregonians to mail in ballots. (You no longer need a stamp!)", "2020-05-13T15:46:42.000Z": "ICYMI: Oregon is one of only nine states ready to reopen, according to @HarvardGH . Throughout this crisis, data and science have informed my decisions - and they remain my guideposts as we build a safe and strong Oregon. Harvard study says only nine states ready to safely reopen Only nine states are running enough COVID-19 tests to contain their outbreaks and reopen by May 15, according to a Harvard-NPR analysis released Thursday. thehill.com", "2020-05-13T00:22:28.000Z": "As we build a safe and strong Oregon, rapid testing will be a key tool to help counties that reopen to stay open. Now that the federal government has finally given us the materials to run these Abbott machines, we can deploy them across the state. https:// tinyurl.com/y7mvg6pl Quote Tweet OR Health Authority @OHAOregon Today, we're announcing that we've distributed 12 additional Abbott ID NOW rapid testing instruments to providers around the state. We distributed the first 3 of a federal shipment of 15 in April but were unable to send the remaining 12 because of a lack of test supplies. Show this thread", "2020-05-12T23:14:20.000Z": "Her story remains largely unknown, but it's an incredible one. Carrie Bertha Shelton served as acting governor three years before women had the right to vote. Leave it to Oregonian women to blaze a trail! The Governor Who Couldn't Vote: Why History Forgot Oregon's 1st Female Head Of State America's first female governor served in Oregon three years before women in the state gained the right to vote. But history has largely forgotten her. That wasn't an accident. opb.org", "2020-05-12T17:21:00.000Z": "If you receive an invite in the mail this week for the @OHSUNews Key to Oregon study, I hope you'll consider volunteering to participate. To make this groundbreaking study work for Oregon, it needs to reflect Oregon's diversity. Thanks for doing your part. http:// OHSU.edu/key-study", "2020-05-11T19:14:29.000Z": "It's clear that COVID-19 will be with us for the foreseeable future - and without federal support, states and cities will be forced to make impossible decisions. That's why our Western States Pact is urgently requesting $1 trillion in relief to states & local governments.", "2020-05-10T16:15:28.000Z": "Happy Mother's Day to all of Oregon's moms, stepmoms, and foster moms. Growing up with the world's best mom, I know how much a mother's love, care, and support means. Though we can't be together today, I'm sending hugs to my mom and all the mamas out there. #MothersDay", "2020-05-09T20:57:56.000Z": "The health of Oregonians is my top priority as we build a safe and strong Oregon. As counties apply to move toward Phase I, we will partner with them to ensure they have taken these data-driven steps to keep communities healthy.", "2020-05-08T23:57:45.000Z": "Welcome to voting by mail, Californians! Trailblazing Oregonians have been accessing our right to vote from home for decades - it's safe, secure, and cost-effective. Other states: join us in helping your citizens make their voices heard. All California voters will be able to vote by mail in November, Newsom says California Gov. Gavin Newsom signed an executive order Friday allowing all registered voters in the state to receive a mail-in ballot for November's election. cnbc.com", "2020-05-08T20:52:51.000Z": "Over 60% of Oregonians have completed the Census - above the national average! The Census guides how federal funds are distributed to states. Oregon stands to get over $19 billion for schools, hospitals and roads. Fill out yours at http:// my2020census.gov ! #oregoncounts2020", "2020-05-08T00:18:13.000Z": "Throughout this crisis, data & science have informed my decisions - and they remain my guideposts as we rebuild a safe & strong Oregon. @HarvardGH agrees: we're on track in meeting the goals that doctors & public health experts have laid out for reopening. Harvard study says only nine states ready to safely reopen Only nine states are running enough COVID-19 tests to contain their outbreaks and reopen by May 15, according to a Harvard-NPR analysis released Thursday. thehill.com", "2020-05-07T18:44:07.000Z": "With science as our guide, and thanks to Oregonians staying home to save lives, we now have the opportunity to begin rebuilding a safe and strong Oregon.\n\nToday I'm announcing the first phase of a county-by-county reopening of our state.\n\nLearn more: Oregon Coronavirus Information & Resources Oregon Coronavirus Information & Resources govstatus.egov.com", "2020-05-07T17:45:21.000Z": "Tune in at 11 for my press conference on my phased approach to building a safe and strong Oregon: Press Briefing with Gov. Kate Brown, May 7, 2020 youtube.com", "2020-05-07T03:41:21.000Z": "No child in Oregon should go hungry. Thank you @OregonDHS and @ORDeptEd for helping 351,000 Oregon families on the free or reduced lunch program receive additional benefits. \n\nLearn more and apply here: https:// tinyurl.com/y7fxb6st", "2020-05-07T00:58:20.000Z": "Nurses deserve our appreciation all year-round, but especially so for the sacrifices they've made during this COVID-19 pandemic. \n\nThank you, Oregon's nurses: you are true heroes who provide life-saving care to many when it's needed the most. #NationalNursesDay  #HealthcareHeroes", "2020-05-05T21:27:08.000Z": "One week isn't nearly enough to thank all of Oregon's hardworking educators, who are going above and beyond to overcome new challenges, and keep students engaged and learning remotely from home. \n\nThank you. We appreciate all you do.", "2020-05-05T19:25:40.000Z": "Enjoying Oregon's beauty and bounty is one of our state's time-honored traditions - and as we begin to slowly open up recreation sites, state parks and ski areas, we must each take personal responsibility and be good stewards of our parks, and each other. Governor Kate Brown Announces Limited Opening of State Recreational Areas - My Oregon News Effective today, some state parks, outdoor recreation facilities, and ski areas will reopen myoregon.gov", "2020-05-04T23:26:35.000Z": "Personal Protective Equipment is critical to keeping our healthcare workers safe. We're partnering with @uoregon to install a Battelle cleaning system to decontaminate PPE, extending the lifespan of masks up to 20 times - this is a game-changer. New Battelle System Disinfects PPE for Reuse - My Oregon News FEMA sends 1 of 60 Battelle Critical Care Decontamination Systems to Oregon to disinfect N95 masks for re-use. myoregon.gov", "2020-05-04T21:44:51.000Z": "During this COVID-19 crisis, no one should have to risk their life to cast their ballot. Oregon's vote-from-home system is a model that should be adopted across the nation so every eligible voter can have their voice heard. Oregon Has Been Voting By Mail For Decades. Now It Will Save Lives. Gov. Kate Brown was \"horrified\" that Wisconsin voters had to risk getting COVID-19 to vote and wants to help other states avoid this in November. huffpost.com", "2020-05-04T01:17:24.000Z": "ICYMI: The @OHSUNews Key to Oregon research study will enroll 100,000 randomly selected Oregonians to voluntarily join a study that will help us better understand COVID-19's infection patterns, helping us more safely reopen Oregon.", "2020-05-03T21:10:36.000Z": "These protections are critical to keeping agricultural workers safe and healthy. But, I know they come at a cost- my administration is working to find solutions to provide financial relief to help farms in meeting these new requirements.", "2020-05-03T21:10:35.000Z": "Thank you to Oregon's farmworkers, including so many members of our immigrant communities, who are on the frontlines working during the COVID-19 crisis to make sure families across our state can continue to have food on the table.", "2020-05-03T19:36:47.000Z": "I'm fighting to make sure we're not leaving any federal money on the table during these difficult times for Oregon families--here's how you can make sure you get your stimulus check. https:// tinyurl.com/y98sckc7", "2020-05-02T01:52:28.000Z": "On #MayDay2020 , International Worker Day, I'm proud to stand with Oregon's workers, including so many immigrants, on the front lines: farm workers, childcare providers, grocery store clerks, home care workers, and so many others. Thank you. We couldn't do this without you.", "2020-05-02T00:03:10.000Z": "By partnering with @OHSUNews to gather reliable data, we will replace fears of COVID-19 with facts about how and where we can contain this disease. Oregonians are the key to reopening our state and keeping it open. Quote Tweet OHSU News @OHSUNews The study's goal is to help get people back to school and work faster, while effectively managing the potential for future COVID-19 outbreaks. https:// bit.ly/3aTy3T3  #KeyToOregon", "2020-05-01T23:57:49.000Z": "As we look to reopen Oregon, it's critical we use science and data to ensure we can safely take steps forward. A strategy of testing and tracing helps us identify who has the disease and who may be at risk of infection - knowledge that is incredibly powerful as we look to reopen.", "2020-05-01T17:11:47.000Z": "Tune in here at 10:30am for my press conference about COVID-19 testing : Press Briefing with Gov. Kate Brown, May 1, 2020 youtube.com", "2020-05-01T02:33:46.000Z": "Expanding testing capacity is critical to reopening Oregon safely. Learn more about testing with this helpful guide from the experts at @OHSUNews .", "2020-04-30T19:33:28.000Z": "Katon met porous me aninis mei wor faniten COVID-19 non kapasen fonuwomw: http:// safestrongoregon.org", "2020-04-30T19:33:27.000Z": "Eeg khayraadyadan iyo macluumaadkan ku saabsan Cudurka Korona Fayraska (COVID-19) ee ku qoran luqadaada : http:// safestrongoregon.org", "2020-04-30T19:33:26.000Z": "COVID-19에 관한 이 자료와 정보를 모국어로 확인하십시오 : http:// safestrongoregon.org", "2020-04-30T19:33:25.000Z": "On http:// safestrongoregon.org , find resources and information on keeping safe from COVID-19 in your language: English, Spanish, Vietnamese, Korean, Chinese, Somali, Russian, Arabic, Hmong, Chuukese, and Marshallese.", "2020-04-29T22:48:09.000Z": "Estamos todos juntos en esto. Sharing accurate information is key to controlling the spread of COVID-19. I was happy to sit down with @tvjam and share resources with Oregon's Spanish-speaking communities. TV JAM on Facebook Watch OREGON: La gobernadora Kate Brow nos respondió cómo ayudará a los inmigrantes. También explicó cómo y cuándo Oregon podría reabrir, entre otros temas... facebook.com", "2020-04-29T03:33:24.000Z": "In Oregon, we use health outcomes, data, and science to guide our decisions. Make sure you're turning to knowledgeable, trusted, science-based sources for information about safe treatment.", "2020-04-29T02:15:31.000Z": "A heartfelt thank you to the Fujian Province, Oregon's sister state in China, for the gift of 50,000 masks. Oregon will pay it forward in the future. China Donates 50,000 Face Masks to Oregon - My Oregon News Fujian Province of China sends gift of personal protective equipment (PPE) for Oregon healthcare professionals and front-line workers myoregon.gov", "2020-04-28T20:44:00.000Z": "TODAY is the last day to register to vote in Oregon's next election. Your vote is your voice - make sure it's heard. \nRegister here: Oregon Secretary of State The Oregon Secretary of State works to maximize voter participation, is a watchdog for public spending, makes it easier to do business in Oregon, and preserves and promotes Oregon history. sos.oregon.gov", "2020-04-28T19:35:05.000Z": "Starting today, @ORemployment is accepting Pandemic Unemployment Assistance applications, which cover the self-employed, 1099 contract workers, gig workers, owners of businesses closed for COVID-19, and more. Get info and apply here: https:// govstatus.egov.com/ui-benefits/CA RES ", "2020-04-28T17:00:02.000Z": "Our @USPS workers are delivering packages with essential items, census forms, prescriptions, ballots for vote by mail, stimulus checks, and letters to our homes. They're on the front lines of this pandemic. Now more than ever, we must support the USPS.", "2020-04-27T16:47:18.000Z": "Oregon, together with Colorado, Nevada, Washington, and California will use health outcomes and science to guide us as we recover from this pandemic: with a shared vision, a common purpose, and individual paths forward tailored to our states' needs. Colorado and Nevada Join the COVID-19 Western States Pact - My Oregon News The states join the Oregon, California, and Washington governors' pact that science - not politics - will guide decisions to modify stay at home orders myoregon.gov", "2020-04-26T17:55:25.000Z": "If you're waiting on an unemployment claim: I hear your frustration. I'm sorry for the delays. I'm committed to ensuring that eligible Oregonians receive the maximum benefits available, as quickly as possible. These benefits are critical during this stressful time.", "2020-04-25T21:32:30.000Z": "Because of the sacrifices we've made to stop COVID-19, our economy and state revenues have taken a large hit. It is a blatant disregard of the challenges states are facing for the U.S. Treasury to prohibit using CARES Act funds for state shortfalls. https:// tinyurl.com/y9cbg3zo", "2020-04-25T19:48:06.000Z": "I'm constantly impressed by Oregonians' ingenuity, creativity, and caring for others. Thank you, Eric, for your work for the lip-reading community. Oregon high school student is making clear face masks so the hearing-impaired can be safe during... Kim doesn't charge and ships the masks for free to anyone who requests one. oregonlive.com", "2020-04-24T23:01:25.000Z": "Thank you @Walgreens for selecting Oregon as one of your first rapid COVID-19 testing sites in the nation.\n\nDrive-through testing will be available by appointment after an online health assessment. Learn more here: http:// Walgreens.com/Covid19Testing", "2020-04-24T19:55:58.000Z": "One small silver lining of this COVID-19 pandemic is that we've seen how telehealth can provide safe, efficient & effective health care. As non-urgent procedures resume, know that many of Oregon's medical providers can continue to provide you with excellent care remotely.", "2020-04-24T19:40:14.000Z": "Thanks to Oregonians adhering to my Stay Home order, researchers estimate that together we have prevented as many as 70,000 cases of COVID-19 and 1,500 hospitalizations so far. Great work, Oregon! Thank you for making sacrifices to care for each other. http:// ow.ly/IKsn50znVC5", "2020-04-24T02:06:54.000Z": "Immigrants and refugees are disproportionately impacted by COVID-19 through disparities in healthcare access, socioeconomics, and immigration status. Now more than ever, it's important for Oregon stand with our immigrant and refugee communities. Executive Order Halting New Green Cards Includes Exceptions The order will affect thousands of people seeking to immigrate to the United States, but it does not apply to immigrants already in the country, nor to those seeking temporary visas. nytimes.com", "2020-04-23T21:20:31.000Z": "All Oregonians should be able to access info about COVID-19 in their preferred language. That's why I launched a new phase of my COVID-19 outreach and education campaign, providing health info and resources in 12 of Oregon's most-spoken languages. Safe + Strong: Gov. Kate Brown Provides Health Info to Hard-to-Reach Oregonians - My Oregon News Governor Brown launches new phase of COVID-19 outreach and education campaign that provides health information and resources in 12 languages myoregon.gov", "2020-04-23T19:42:12.000Z": "Thanks to each and everyone of us doing our part to follow \nsocial distancing measures, Oregon is in a position where I can lift the executive order delaying non-urgent procedures for our hospitals, clinics, surgical centers and dental offices. Governor Kate Brown Issues Guidance for Lifting Order on Non-Urgent Medical Procedures - My Oregon... Procedures may resume May 1 with safeguards in place myoregon.gov", "2020-04-23T19:16:11.000Z": "Ramadan Mubarak to all of the Oregonians celebrating today! I know it's difficult to be apart when you would usually come together for meals, taraweeh prayers, and late-night gatherings. Thank you for creating new ways this month to observe your faith in the age of COVID-19.", "2020-04-23T17:43:06.000Z": "Please tune in at 11 am for my press conference with Dr. Dana Hargunani of the Oregon Health Authority and Dr. Bruce Goldberg of my Medical Advisory Panel: Press Briefing with Gov. Kate Brown, April 23, 2020 youtube.com", "2020-04-23T03:39:33.000Z": "Young Oregonians like @Abner4Action reach out to me to share how important climate action is to them. Let's make Earth Day every day and keep Oregon beautiful for generations to come. #EarthDay2020", "2020-04-23T02:30:57.000Z": "In Oregon, we make it Earth Day every day. Know that as I guide our state through the COVID-19 crisis, I will never stop fighting for climate action, so that the next generation can enjoy the beauty and bounty of Oregon. #EarthDay2020 Earth Day 50th Anniversary Learn how in Oregon, we're making it Earth Day every day youtube.com", "2020-04-22T16:00:55.000Z": "This pandemic has made clear how interconnected our lives, our homes, and our communities really are. We are all in this world together. On the 50th anniversary of #EarthDay , please join me in committing to care for this spectacular place we call home.", "2020-04-22T03:19:56.000Z": "It's hard to be separated from classmates, friends, or family. You may feel lonely. Know you're not alone. We're all in this together, and staying connected is more important than ever.", "2020-04-22T02:54:07.000Z": "I appreciate today's congressional action to provide needed relief for small businesses and hospitals, but we need more federal support to address the toll this pandemic has taken on Oregonians and our economy. https:// oregon.gov/newsroom/Pages/NewsDetail.aspx?newsid=36448 ", "2020-04-21T22:54:28.000Z": "By sharing the truth of history with our young people, including its darkest moments, we will bring change. That's why I require that the Holocaust be taught to age-appropriate students in Oregon, with an emphasis on protecting inclusivity & human rights. #HolocaustRemembranceDay Quote Tweet US Holocaust Museum @HolocaustMuseum Join us today in remembrance of the stories of persecution, of survival, and of resilience as #WeRemember the Holocaust. By reading one story, saying one name, sharing one person's legacy, you keep a memory alive.", "2020-04-19T19:04:20.000Z": "Oregon has proven that voting by mail is safe and secure. During this public health crisis, no one should have to risk their health to access their constitutional right to vote. 'A 20-year history of success': GOP Secretary of State says Oregon shows mail-in voting is secure,... Bev Clarno said Oregon's two-decade-long history of mail-in voting shows it can be done securely and is more accessible to voters. kgw.com", "2020-04-18T22:05:09.000Z": "We all want to get back to work and return to normal life as quickly as possible. But the truth is: the best path forward is a cautious one - a path that proceeds gradually, carefully, and incrementally.", "2020-04-18T16:22:26.000Z": "Your #CARESAct recovery check is meant to provide relief  - not reward debt collection agencies. My new Executive Order ensures you can use that money to cover the costs of essential needs during the COVID-19 crisis. https:// oregon.gov/newsroom/Pages/NewsDetail.aspx?newsid=36438 ", "2020-04-18T00:40:10.000Z": "Couldn't be prouder to see the University of Oregon expand its #ProDuck flock! Congrats to the top #WNBADraft pick, @sabrina_i20 , as well as teammates @BallySatou and @RuthyHebard24 !", "2020-04-17T22:34:46.000Z": "Every generation hopes the next one will continue to move our state, and our country, forward. Congratulations to Oregonian and 2020 Truman Scholar @mlenneville , awarded the @TrumanApp for aspiring public service leaders.", "2020-04-17T21:20:28.000Z": "It's a big day for Oregon women's basketball: the #WNBADraft . Let's go, Ducks and Beavs! Best of luck to @sabrina_i20 , @BallySatou, and @pivec10 !", "2020-04-17T17:27:00.000Z": "When Oregonians see a need, we step up to help when we can. As I continue to pursue every possible avenue for procuring enough PPE, I am in awe of the innovative Oregon students & faculty finding creative solutions to help. PPE 101: Oregon's Students and Teachers Create In-Demand Equipment - My Oregon News Though classes are canceled, resourceful students and teachers across the state are working hard to contribute PPE myoregon.gov", "2020-04-16T23:37:27.000Z": "During this stressful time, it's critical for Oregonians to receive unemployment benefits as quickly as possible. Please know @ORemployment has quadrupled their staff, paid out $97 million in benefits, and created an email address for your questions. https:// myoregon.gov/2020/04/16/the -best-way-to-reach-oregons-employment-department/ ", "2020-04-15T21:14:06.000Z": "", "2020-04-15T21:14:05.000Z": "Oregonians, you are truly superheroes helping flatten the curve. Remember in the coming weeks to keep your cape on.", "2020-04-15T18:26:30.000Z": "To our frontline workers in need of child care right now: A great resource is \"211\" - call to find nearly 2,000 child care providers across Oregon who can offer support. You might even qualify for funding to cover the cost of care. How to Find Emergency Child Care in Oregon - My Oregon News Oregon has the ability to serve approximately 10,000 children; learn who can access child care myoregon.gov", "2020-04-15T17:26:58.000Z": "Having sufficient PPE is critical to keeping Oregon's frontline workers safe and healthy. \n\nThank you @HomeDepot for stepping up and donating tens of thousands of PPE to Oregon communities - your kind donation will truly make a difference.", "2020-04-15T15:31:01.000Z": "I know so many of us feel helpless during these uncertain times. \n\nOne of the best ways I've found to combat those feelings is with kindness, and by helping others. Here are 10 great ways to look out for your fellow Oregonians. How Can I Help with the Coronavirus Effort in Oregon? - My Oregon News The best ways to volunteer, donate, and support your community right now myoregon.gov", "2020-04-14T18:19:31.000Z": "It will not be easy. It will take longer than we want.\n\nThese are the prerequisites necessary for \"when\" we can reopen. Then there's the \"how\" we reopen Oregon, and keep it open. I want to work collaboratively to do that, and we will look at specific sectors of the economy.", "2020-04-14T18:19:30.000Z": "In the early days of this pandemic, I had to take swift action to protect the health & safety of Oregonians from this deadly disease. Now, as we see that these efforts are successfully flattening the curve, we're analyzing how & when to reopen each part of our society & economy.", "2020-04-14T17:53:29.000Z": "I will be holding a press conference at 11am. Tune in here: Press Briefing with Gov. Kate Brown, April 14, 2020 youtube.com", "2020-04-13T21:57:21.000Z": "In times of crisis, no Oregonian should need to wonder where they can find food for their family. This $8 million will support @oregonfoodbank 's efforts to serve Oregonians facing food insecurity. https:// oregon.gov/newsroom/Pages/NewsDetail.aspx?newsid=36356 ", "2020-04-13T19:11:09.000Z": "The West Coast is ahead of the curve on COVID-19. We're going to make sure that stays true.\n\nWA, OR and CA will work together on a shared approach for reopening our economies. #WeGotThisWA", "2020-04-13T19:24:18.000Z": "Today, Governor @GavinNewsom , @OregonGovBrown & @GovInslee announced an agreement on a shared vision for reopening their economies and controlling COVID-19 into the future. #StayHomeSaveLives California, Oregon & Washington Announce Western States Pact | California Governor West Coast states agree region will move toward reopening based on health outcomes SACRAMENTO - Today, California Governor Gavin Newsom, Oregon Governor Kate Brown and Washington Governor Jay Inslee gov.ca.gov", "2020-04-13T19:26:43.000Z": "There is no roadmap to address this unprecedented crisis. But there's power in working together with our neighbors on the West Coast as we plan to reopen our economies - and it's smart to coordinate our metrics, best practices, and processes. This disease knows no borders.", "2020-04-12T22:39:25.000Z": "Oregonians deserve to feel safe at home - now more than ever. Domestic violence and sexual assault shelters & services are open. If you need support or a safety plan, go to http:// ocadsv.org/find-help , call the @ndvh hotline: 1-800-799-7233, or text LOVEIS to 22522 (Español tambien). FIND HELP Our FIND HELP directory lists shelters, advocacy programs, and legal assistance resources throughout Oregon. ocadsv.org", "2020-04-12T20:32:42.000Z": "It's difficult to be apart in April, when faith communities traditionally come together to mark Passover, Easter, Ramadan, Rama Navami, and Vaisakhi. Please know that your sacrifice - finding ways to practice your faith while physically apart - is helping save lives in Oregon.", "2020-04-11T22:16:12.000Z": "Thank you, Oregon, for the sacrifices you are making during this crisis. Staying home is saving lives. New modeling shows we are making progress to slow the spread of COVID-19. Quote Tweet OR Health Authority @OHAOregon It's working! Following @OregonGovBrown 's stay at home orders is preventing a surge in new infections. Projections say social distancing has prevented as many as 18,000 cases of COVID-19 & 500 hospitalizations. Wow! #stayhomesavelives Learn more: http:// ow.ly/AYWY50zbMKF", "2020-04-11T21:26:31.000Z": "Expanding Oregon's testing capabilities is a key part of the fight against COVID-19. @OurLegacyHealth has significantly ramped up capacity and now has the ability to run more than 650 tests per day.", "2020-04-11T20:15:32.000Z": "Some ideas for staying home this weekend: Open your windows. Draw a kind chalk message on the sidewalk. Organize your closet. Dance to a favorite song. Take a walk in your neighborhood (keep 6+ feet from others). Garden. Try a new recipe. Give your dog a bath. FaceTime a friend.", "2020-04-11T17:46:04.000Z": "I'm so grateful for the sacrifices made by Oregon's public health workers - and for those made by each and every one of you who stays home to protect them. Public Health Week I'm so grateful for the sacrifices made by Oregon's public health workers - and for those made by each and every one of you who stays home to protect them. youtube.com", "2020-04-11T00:46:11.000Z": "PPE is critical to keeping our public health workers safe from COVID-19. Today Oregon received 78 pallets of PPE from @USAID and @theOFDA, adding to the state's stockpiles of N95 masks and other PPE.", "2020-04-10T23:36:04.000Z": "A \"camp in place\" event in your backyard or living room, complete with s'mores and campfire songs, is such a creative way to connect with a beloved Oregon pastime while staying home to save lives. Thanks for the inspiration, @WilsonvilleOR and @LakeOswegoInfo", "2020-04-10T22:27:11.000Z": "Oregon has amazing parks, and I know it's hard to stay home when the sun shines. \n\nBut the more Oregonians stay home now, the better we can fight COVID-19 - and the sooner we'll all be able to safely resume enjoying our beloved parks. #ORStateParked Quote Tweet Oregon State Parks @ORStateParks The sun is out, the warm air feels good, & you're stir-crazy. Everyone feels it. But closed means closed, whether you live next door or are planning a trip. This isn't 4ever. Park Ranger Lisa stationed explains it best. For now, we're all #ORStateParked  https:// bit.ly/ORStateParked", "2020-04-10T21:29:02.000Z": "No one should be forced to risk their life to cast their ballot. Here in Oregon, we already have the solution to voting safely and securely, even during a pandemic. Vote By Mail No one should be forced to risk their life to cast their ballot. Here in Oregon, we already have the solution to voting safely and securely, even during a pa... youtube.com", "2020-04-10T16:56:23.000Z": "During this crisis, we are working to connect Oregon families with the food assistance they need. This $60 million partnership with @OregonDHS means more Oregon families will receive the maximum SNAP benefit for April and May. Quote Tweet Oregon Department of Human Services @ORHumanServices Many SNAP recipients are get emergency funds!\n\nEmergency SNAP benefits for April and May will result in more than $60 million in additional SNAP benefits for Oregonians. The emergency allotments will bring all SNAP households up to the maximum benefit. https:// oregon.gov/DHS/DHSNEWS/Ne wsReleases/NR-emergencySNAPbenefits.pdf  GIF", "2020-04-10T15:20:41.000Z": "We have some of the most compassionate, hard-working Oregonians on the frontlines of our COVID-19 response. Proud that in the midst of helping manage our response efforts, the @OregonOEM team still made time to save up to 117 lives by donating blood. Help Ill or Injured Oregonians by Donating Blood - My Oregon News Learn how the Office of Emergency Management rolled up their sleeves (literally) to help - and how you can too myoregon.gov", "2020-04-09T22:50:00.000Z": "Agriculture and food production feeds our communities, and our economy. Thank you to Oregon's 719,000+ agricultural workers, farmers and food processors for working hard every single day to keep Oregon healthy, safe, & fed. Please stay healthy and strong. We're in this together.", "2020-04-09T20:23:29.000Z": "But the number of rapid testing kits we received from the federal government does not even come close to approaching our needs. I am committed to working with our federal partners to secure additional test kits.", "2020-04-09T20:23:28.000Z": "We've delivered COVID-19 rapid testing machines to hospitals in Curry, Morrow, and Lake counties. Expanding our capacity to get COVID-19 test results in minutes will help keep Oregonians healthy and safe. https:// oregon.gov/newsroom/Pages/NewsDetail.aspx?newsid=36326 ", "2020-04-09T20:13:35.000Z": "You may have seen the famous dance moves of @OHSU's Dr. Jason Campbell - he's not only working on the COVID-19 front lines, but also making everyone smile with his social distancing tips. Grateful for these bright moments. Thank you, @DrJCoftheDC ! OHSU doctor writes prescription for fun with viral dance videos during coronavirus pandemic Dr. Jason Campbell is spreading joy to his coworkers at OHSU and around the world through dance videos on social media. kgw.com", "2020-04-09T17:11:37.000Z": "There's no question: cabin fever is setting in and the weather is beautiful.\n\nBut now is the time to stay home. Let's keep building on the great work we've all been doing with social distancing - it will give our hospitals the best chance to meet any future needs. \n\nWe got this.", "2020-04-09T00:30:08.000Z": "Chag Sameach to every Jewish family observing the holiday tonight. May this Passover be a reminder of strength, hope and solidarity during the most difficult times - and the freedom and celebration that comes after.", "2020-04-08T23:50:28.000Z": "The best thing we can do for the health of our children, and for the thousands of educators across Oregon, is to give everyone certainty by announcing the decision today to close in-person classes for the remainder of the school year. Governor Kate Brown Extends Coronavirus School Closures Through End of School Year - My Oregon News Learning will continue using remote means myoregon.gov", "2020-04-08T21:45:08.000Z": "I'm always proud to see an Oregon company taking care of Oregonians. @DutchBros is donating 100% of its April profits to #FirstRespondersFirst , which provides equipment and resources to frontline medical workers. Thank you.", "2020-04-08T19:34:57.000Z": "At 1pm, I will be holding a press conference. Tune in here: Press Briefing with Gov. Kate Brown, April 8, 2020 youtube.com", "2020-04-08T17:26:30.000Z": "Some parts of Oregon are doing better than others at staying home and practicing social distancing.\n\nTo all our Portlanders: as tempting as it is to be out and about, please remember that our #1 priority right now is staying home and social distancing.", "2020-04-07T21:19:10.000Z": "If you are a college student and registered to vote in Oregon please update your mailing address at http:// oregonvotes.gov/myvote to make sure we send the ballot to the address where you are residing now.  We know there have been a lot of moves due to COVID-19", "2020-04-08T16:27:37.000Z": "Mask or no mask, the best way to help flatten the curve of COVID-19 is to stay home. \n\nFor activities like grocery shopping, wearing a cloth mask may help you prevent spreading the virus to others.\n\nRead on for Oregon's new guidance on homemade masks: https:// oregon.gov/newsroom/Pages/NewsDetail.aspx?newsid=36312 ", "2020-04-08T16:14:29.000Z": "If you've lost income because of the COVID-19 pandemic, @SEIU has an easy navigator for unemployment, food, health care, housing, and child care resources: Facing Lost Income Because of COVID-19? Learn more about how to meet your basic needs during the COVID-19 pandemic. gethelpcovidoregon.org", "2020-04-08T03:47:56.000Z": "When the foundation of our society is being rocked, we must ensure the foundation of our democracy remains strong.\n\nNo one should have to choose between risking their health and having their voice heard. States should follow Oregon's lead: vote by mail. Wisconsin Primary Recap: Voters Forced to Choose Between Their Health and Their Civic Duty The state was the first to hold a major election with in-person voting since stay-at-home orders were widely instituted because of the coronavirus. nytimes.com", "2020-04-07T18:16:31.000Z": "To our health care heroes: Endless thanks to all those on the front lines keeping us healthy and safe in these extraordinarily difficult times. I won't stop fighting for you and the resources you need. Thank You, Health Care Heroes youtube.com", "2020-04-06T21:49:07.000Z": "Today @FEMA , @OregonOEM & @OregonGuard shipped 140 of our ventilators to New York. \n\nTo all in New York, Oregon is keeping you in our hearts. We're all in this together.", "2020-04-05T15:41:14.000Z": "Arlene Schnitzer's creative contributions changed Oregon's cultural landscape, bringing the work of women to the forefront. She will be missed, but her impact is forever woven into the fabric of our state. Arlene Schnitzer, Oregon Philanthropist And Art Collector, Dies At 91 Celebrated Oregon philanthropist and art collector Arlene Schnitzer has died at 91 years old. opb.org", "2020-04-04T15:23:25.000Z": "Oregon doesn't have everything we need to fight COVID-19 - we need more PPE and testing - but we can help today with ventilators. We are all in this together.", "2020-04-04T15:23:24.000Z": "New York needs more ventilators, and we are answering their call for help.\n\nWe'll be sending 140 ventilators to help NY because Oregon is in a better position right now. We must do all that we can to help those on the front lines of this response.", "2020-04-03T23:12:37.000Z": "Reminder: All Oregon State Parks are closed, and all trails and rec areas are closed on both the OR and WA sides of the Columbia River Gorge National Scenic Area. This weekend, #stayhomesavelives .", "2020-04-03T01:43:19.000Z": "Today I'm launching a statewide initiative, the Small Business Resource Navigator, to connect Oregon's small businesses with federal, state & local resources. Oregon Small Business Resource Navigator youtube.com", "2020-04-02T16:46:18.000Z": "COVID-19 is making paying rent difficult for many Oregonians. Yesterday, I strengthened my moratorium on residential evictions. Now, tenants can't be charged late fees for nonpayment. Renters and Owners Get New Protections through September - My Oregon News Governor Kate Brown and Oregon Legislature extend protection during COVID-19 myoregon.gov", "2020-04-01T23:37:38.000Z": "Sending happy birthday wishes to Bill on his 104th birthday! He's one of Oregon's honored veterans and has just recovered from COVID-19. \n\nYou can wish him a happy birthday, and brighten the day of other residents at the Lebanon veterans home. Learn more: https:// koin.com/news/health/co ronavirus/operation-well-wish-hopeful-messages-to-lebanon-veterans/ ", "2020-04-01T21:59:32.000Z": "These are difficult times. This order will help Oregon's restaurants and businesses stay in their locations without threat of eviction. https:// oregon.gov/gov/admin/Page s/eo_20-13.aspx ", "2020-04-01T17:06:31.000Z": "Today is #CensusDay ! Take a few minutes to make sure you are counted at http:// my2020census.gov . You can fill out the census by web, phone, or mail. Taking action today will help our communities get essential funding for healthcare, schools, roads, bridges, and more. #2020Census", "2020-04-01T15:37:03.000Z": "The creativity and dedication of our @ORStateParks rangers means Oregonians can whale watch at Depoe Bay - from home. Thanks for helping us continue to enjoy the magic and beauty of Oregon, while staying safe. Bringing Parks to the People - My Oregon News Oregon park rangers bring coastal whale-watching to your computer myoregon.gov", "2020-03-31T23:20:06.000Z": "I love how Oregonians get creative and show up for each other in tough times. Coos Bay resident John is (very enthusiastically) reading a book a day to kids on his YouTube channel as he stays at home to save lives: So It Goes Coffeehouse Coos Bay, Oregon soitgoescoffee@gmail.com youtube.com", "2020-03-31T19:46:16.000Z": "It's the Oregon way to help support each other; proud to see so many come together for our children in foster care & their foster families with groceries, diapers, learning materials, and more through #MyNeighbOR and @ORContingent : My NeighbOR helps Oregon foster families during coronavirus pandemic The 36-county mobilization effort aims to match community goods and services with foster families. kgw.com", "2020-03-31T15:38:23.000Z": "Necessity is the mother of invention, and we need innovative solutions more than ever now. Kyle Kirsch of Silverton, OR, donated 40 masks he 3D printed in just one night. Remember that you can donate new PPE here: How to Donate Surplus PPE - My Oregon News Medical professionals across Oregon are able to donate new masks, gowns, and gloves to the state cache myoregon.gov", "2020-03-31T15:21:56.000Z": "In these difficult times, it's nice to appreciate the little things that make us smile - like the first peeps of this newest member of the @OregonZoo . With pips and peeps, fluffy penguin chick hatches at zoo oregonzoo.org", "2020-03-31T02:23:48.000Z": "One of the things I admire most in Oregonians is that when hard times hit, we always respond with \"How can I help?\" \nMy team has compiled 10 great ways you can volunteer, donate, and show up for each other right now. How Can I Help with the Coronavirus Effort in Oregon? - My Oregon News The best ways to volunteer, donate, and support your community right now myoregon.gov", "2020-03-30T23:26:30.000Z": "Even as the nation faces an unprecedented COVID-19 crisis, the Trump Administration finds a way to roll back auto standards that will increase air pollution by billions of tons. Stunning, but sadly unsurprising. U.S. to Announce Rollback of Auto Pollution Rules, a Key Effort to Fight Climate Change The Trump administration has finalized new fuel efficiency standards, lowering expectations from 54 miles per gallon by 2025 to 40 miles a gallon by 2030. nytimes.com", "2020-03-30T23:05:17.000Z": "Important update: Oregon just added 140 ventilators to our state supply to help with our COVID-19 response, via @HHSGov & @fema . \n\nThey will save lives, but we will need more. I'm going to continue to fight for the critical equipment we need to keep Oregonians safe.", "2020-03-30T21:29:13.000Z": "This is a difficult time for anyone who worries about how to care for their loved ones-which means it's difficult for everyone. But modeling shows if people stay home, together we can all flatten the curve. Keep it up, Oregon. #stayhomesavelives If Oregonians stay home, state hospitals appear capable of handling coronavirus burden Oregon may avoid the worst of the coronavirus, a forecast shows. But people must stay home. oregonlive.com", "2020-03-30T20:23:45.000Z": "Today, I was proud to (virtually) stand alongside Oregonian workers & hear their stories from the front lines of the coronavirus crisis. You have my commitment: we will continue to fight too, for the protective equipment you need. @SEIU  @SenJeffMerkley  @RepBonamici", "2020-03-30T17:50:52.000Z": "In this time of rapid change, we need to make sure everyone has the support they need. If your income has changed and you are pregnant or have a child under 5, you may now qualify for grocery benefits through WIC. Check your eligibility here: https:// wic.fns.usda.gov/wps/pages/preS creenTool.xhtml ", "2020-03-30T14:55:11.000Z": "Hardworking Oregonians deserve every chance possible to access the health coverage they need now more than ever. I've asked the federal government to allow us to re-open the enrollment period for http:// healthcare.gov . https:// healthcare.oregon.gov/marketplace/Do cuments/032320-OR-SEP-request-secAzar-adminVerma-COVID19.pdf ", "2020-03-30T03:30:45.000Z": "More and more businesses are getting creative to meet community needs in this difficult time; Oregon SNAP recipients can now order groceries online @Walmart and @Amazon . Oregonians Can Now Use SNAP to Buy Groceries Online - My Oregon News Users can purchase groceries online from Walmart and Amazon, helping to keep SNAP recipients and their families safe during COVID-19 myoregon.gov", "2020-03-30T02:38:08.000Z": "The coronavirus pandemic is a global and local issue; @Intel , one of Oregon's global companies, is making contributions to relief efforts on both fronts. The Intel Foundation Donates $1 Million to Support Oregon during COVID-19 - My Oregon News Funds will support the Oregon Food Bank, the United Way of the Columbia-Willamette, and the Oregon Community Recovery Fund myoregon.gov", "2020-03-30T01:20:26.000Z": "During this unprecedented crisis, I'm thankful to Oregonians who need to keep working for all of us, and for the Oregonians who are staying home to protect them.", "2020-03-30T00:38:21.000Z": "Oregon is focused on procuring as much PPE as possible for our frontline workers. Donations from groups like @ORdentists truly reflect the Oregon way--coming together in difficult times for the good of Oregonians most in need. https:// oregon.gov/newsroom/Pages/NewsDetail.aspx?newsid=36283 ", "2020-03-29T23:49:13.000Z": "This disaster declaration is an important first step toward unlocking all available resources for COVID-19 response, but more federal action is needed. I will continue to fight for access to every tool available to keep Oregonians safe. https:// oregon.gov/newsroom/Pages/NewsDetail.aspx?newsid=36281 ", "2020-03-29T17:53:41.000Z": "The list goes on of hardworking Oregonians on the front line that I'm grateful for: police and firefighters, devoted medical professionals, and those who work in group homes, long-term care facilities & at-home care professionals. We know the hours are long and we appreciate you.", "2020-03-29T00:26:03.000Z": "My top priority is to keep Oregonians safe and healthy as we focus on stopping the spread of COVID-19 -- whether they are living sheltered or unsheltered. \n\nRead on for further guidance on EO 20-12 as it relates to Oregonians experiencing homelessness. Governor Kate Brown Issues Homelessness Guidance on \"Stay Home, Save Lives\" Order - My Oregon News The guidance outlines exemptions for people experiencing homelessness and social service providers myoregon.gov", "2020-03-28T21:10:57.000Z": "Sharing an update on Oregon's COVID-19 response efforts. Tune in. Oregon Coronavirus Update from Governor Kate Brown Governor Kate Brown gives an update on the state's COVID-19 response efforts. youtube.com", "2020-03-28T18:24:20.000Z": "We are facing an unprecedented crisis - and the single most important thing each of us can do to protect our community right now is stay home. \n\nI want to thank @WiedenKennedy for providing their services to the state during this important time. Statewide COVID-19 Public Awareness Campaign Launches The Stay Home, Save Lives campaign aims to unite Oregonians and save lives, launched by Governor Kate Brown and Wieden + Kennedy. myoregon.gov", "2020-03-28T00:54:51.000Z": "The CARES act has the potential to help many Oregonians and Oregon businesses suffering due to the COVID-19 pandemic. We will use these funds to help people stay healthy, stay in their homes, keep their businesses and feed their families. Trump signs historic $2 trillion stimulus after Congress passes it Friday President Donald Trump signed into law Friday afternoon a historic $2 trillion stimulus package as the American public and the US economy fight the devastating spread of Covid-19. cnn.com", "2020-03-27T18:09:32.000Z": "This is hopeful for our small businesses and workers as we navigate the difficult impacts of COVID-19 on our economy and way of life. I expect President Trump to sign this and get funds out as quickly as possible - Oregonians need it! The House just passed a $2 trillion coronavirus stimulus package. It now heads to Trump's desk. Here's what's in the bipartisan $2 trillion stimulus Congress just passed. vox.com", "2020-03-27T15:29:04.000Z": "It's still safe, and allowed, under my #StayHomeSaveLives executive order to donate blood - in fact, I encourage it. Sign up to donate with @RedCrossCasc today: Upcoming blood drive. Help save lives. Here's information about our upcoming American Red Cross blood drive. Schedule an appointment. redcrossblood.org", "2020-03-27T03:25:02.000Z": "When I closed Oregon's schools, I asked all school districts to keep feeding our most vulnerable students. I'm proud of all the creative ways districts across our state are stepping up: Instead of Picking Up Kids, Bus Drivers Deliver Lunches \"The smile on our kids' face when they feel like they've been remembered in this hard time is huge.\" time.com", "2020-03-27T02:05:35.000Z": "The last thing we need to do during this crisis is turn out more Oregonians struggling to make ends meet from their homes and onto the streets. I've placed a temporary moratorium on residential evictions - this is both a moral and a public health imperative.", "2020-03-26T23:10:38.000Z": ". @ORemployment has doubled the number of employees working on unemployment claims to reduce wait times, and have enacted temporary rules to help more Oregonians affected by COVID-19 business closures. Learn more here: https:// govstatus.egov.com/ORUnemployment _COVID19?fbclid=IwAR05WNJM_AcJfryIeA255QKkthoT1fG6_cNXfttITXlKcxA3N86xoNg9FM8 ", "2020-03-26T21:04:13.000Z": "We owe a huge debt of gratitude to the Oregonians still hard at work, helping us all: grocery store employees, truck drivers, farmers, ranchers, workers in food processing facilities, port employees unloading shipments, utility operators and many more. \n\nThank you, Thank you.", "2020-03-26T20:34:28.000Z": "I know how hard it is to telework while also taking care of your children. Thanks to bosses for understanding that parents now NEED to do double duty - they're ensuring that the limited available child care is reserved for people who must work in essential roles outside the home.", "2020-03-26T15:04:54.000Z": "If you ever doubt that your individual actions matter in slowing the spread of COVID-19, check out this graphic by microbiologist @SiouxsieW : GIF", "2020-03-26T02:04:37.000Z": "In Oregon, construction work is allowed to continue IF certain safety guidelines can be followed. Read on for rules and resources for contractors: Coronavirus Rules and Resources for Oregon Construction Workers and Contractors - My Oregon News Oregon construction workers and contractors are permitted to continue working, as long as they follow new social distancing requirements myoregon.gov", "2020-03-26T02:04:36.000Z": "I'm hearing that there's some confusion from businesses that aren't sure whether they can remain open. Take this simple three question quiz on our website to find out: Oregon Coronavirus Information & Resources Oregon Coronavirus Information & Resources govstatus.egov.com", "2020-03-25T22:37:11.000Z": "Coronavirus doesn't discriminate and can infect anyone -  any age, any race, any level of health. That's why it's so important to stay home to reduce the spread and #flattenthecurveOR", "2020-03-25T20:16:07.000Z": "My #StayHomeSaveLives executive order is designed to keep all Oregonians - and workers - safe.\n\nIf your employer is staying open and not enforcing 6 feet of social distancing, you can report them to Oregon's Occupational Safety and Health (OSHA) division: https:// www4.cbs.state.or.us/exs/osha/hazre p/ ", "2020-03-25T19:26:43.000Z": "I encourage all Oregonians to spread the word about COVID-19 and how we can keep each other safe. We've launched a public awareness campaign to coincide with the #StayHomeSaveLives executive order - help us share these messages. You can find content here: Stay Home. Save Lives. Stay Home. Save Lives. govstatus.egov.com", "2020-03-25T16:03:53.000Z": "Want more info on COVID-19? You can sign up to receive text or email updates about coronavirus from @OHAOregon here  http:// ow.ly/Q2Wd50yzUam", "2020-03-25T00:02:40.000Z": "I know this unprecedented pandemic and its effects can trigger stress, anxiety, depression, and feelings of isolation. Here's a few smart tips from @afspnational on how to take care of your mental health as we all face a new way of living with coronavirus. Taking Care of Your Mental Health in the Face of Uncertainty If you are struggling, here are some things you can do to take care of your mental health in the face of uncertainty. afsp.org", "2020-03-24T21:32:00.000Z": "Feeling sick and not sure if you may have COVID-19? \n\nFollow these instructions if you start feeling symptoms of possible coronavirus. And please remember to stay home.", "2020-03-24T20:37:48.000Z": "Oregonians are known for our friendly, community-centered lifestyle, so staying home might feel strange or unhelpful. I want to remind you: staying home is the #1 way to serve your community right now.", "2020-03-24T17:16:09.000Z": "#StayHomeSaveLives instructions en #Español . Also available in #Arabic , #Chinese , #Somali , #Russian , #Vietnamese & #Marshallese at https:// govstatus.egov.com/OR-OHA-COVID-19", "2020-03-23T18:30:05.000Z": "These social distancing measures are designed to stop the spread of COVID-19 and be more sustainable over time, preserving scarce hospital space and allowing more Oregonians to keep their jobs when their work does not add to the growth of COVID-19 in Oregon.", "2020-03-23T18:29:44.000Z": "I want to make it perfectly clear what's allowed and what's not under my new Executive Order. If you're still not sure about an activity, skip it. Staying home will save lives.", "2020-03-23T18:26:52.000Z": "Today, I am issuing a new statewide order: stay home to the maximum extent possible. Failure to comply with the order will be considered an immediate danger to public health. Oregon Coronavirus Information & Resources Oregon Coronavirus Information & Resources govstatus.egov.com", "2020-03-22T23:23:35.000Z": "So many of us love to get out into nature to de-stress. But these are not normal circumstances, and our trails and beaches were packed this weekend, making social distancing impossible. I urge you again: stay home. Quote Tweet Oregon State Parks @ORStateParks The COVID-19 situation is very fluid & in order to follow @OregonGovBrown 's order to maintain social distance, we have made the difficult decision to close the entire state park system by March 23. The last night any camper can stay is March 22. (1/2) #StayAtHome  #FlattenTheCurve Show this thread", "2020-03-22T23:10:31.000Z": "I'm also asking mortgage lenders, banks, and credit unions to do all they can to ease burdens on property owners and renters, like waiving fees, extending grace periods, postponing collections actions and foreclosures, and more. Coronavirus Guidance for Lenders.pdf drive.google.com", "2020-03-22T23:07:59.000Z": "Making sure families don't lose their homes during this health crisis is the right thing for Oregon families and for preventing spread of COVID-19. That's why I have ordered protections against residential evictions for the next 90 days. Governor Kate Brown Issues Order to Stop Residential Evictions During COVID-19 Crisis - My Oregon... Oregonians won't be evicted from their homes for the next 90 days myoregon.gov", "2020-03-22T17:23:05.000Z": "I am urging all Oregonians to stay home. We just have to look to Washington, California, and New York to see the storm that is coming. But we still have time to change its course.", "2020-03-22T17:23:04.000Z": "On Friday night, I asked all Oregonians, on the eve of spring break, to stay home and stay healthy. Unfortunately, our trails and beaches were packed this weekend. I want to be absolutely clear, you are endangering all Oregonians when not following social distancing orders.", "2020-03-22T03:50:56.000Z": "What does COVID-19 \"social distancing\" look like? Stay home unless absolutely necessary Keep 6 feet away from everyone Don't forget to wash your hands often\n\nThank you to all the Oregonians responsibly following these measures.", "2020-03-22T03:23:15.000Z": "Spring Break is here. \n\nPlease remember: every action we take has impact in this new reality of living with COVID-19. Social distancing done well, and done early can save lives. I ask you to follow these measures and protect yourself and our neighbors. #StayHomeStaySafe", "2020-03-21T01:55:59.000Z": "Watch live: tonight I'm speaking with Chair of the Board of Commissioners in Multnomah County @dkafoury and Mayor @tedwheeler . Oregon Coronavirus Information & Resources Oregon Coronavirus Information & Resources govstatus.egov.com", "2020-03-20T22:00:12.000Z": "The @RedCrossCasc faces a severe blood shortage due to an unprecedented number of blood drive cancellations-73 so far in Oregon, resulting in 2,024 fewer units of blood collected. Since each unit can be used to help 3 people, that will affect at least 6,000 potential recipients.)", "2020-03-20T21:21:37.000Z": "The U.S. Small Business Administration has approved Oregon for low-interest disaster loans to businesses of all sizes, private non-profits, homeowners, and renters. More info here: https:// disasterloan.sba.gov/ela/Informatio n/Index ", "2020-03-20T21:19:53.000Z": "Social distancing is the best tool to flatten the curve, a crucial way to reduce the strain on our healthcare system and save lives. #FlattentheCurveOR Quote Tweet OregonOEM @OregonOEM #COVID19 is scary - as parents, grandparents, sons, and daughters ourselves - we all want our loved ones to be safe. The good news: You can take steps to reduce the impact of COVID-19. Health experts are referring to this as \"flattening the curve.\" Show this thread", "2020-03-19T20:46:56.000Z": "Social distancing, whether indoors or out, is the best tool we have to slow the spread of COVID-19. Quote Tweet Oregon State Parks @ORStateParks Temporary camping closures announced for Oregon state parks (April 3-May 8), forests, and wildlife areas. OPRD, @ORDeptForestry & @myODFW will suspend camping to help reduce the spread of COVID-19. https:// bit.ly/2Uh5kBg  #ORcampinghalt", "2020-03-19T17:29:18.000Z": "If you or your business have stores of gloves, masks, or gowns, please consider donating your surplus items to the state cache for COVID-19 preparedness. You can mail them in or drop them off. Learn how here: How to Donate Surplus PPE - My Oregon News Medical professionals across Oregon are able to donate new masks, gowns, and gloves to the state cache myoregon.gov", "2020-03-19T17:14:38.000Z": "This virus has nothing to do with nationality, race, or ethnicity-it is a global problem. Xenophobia, hate crimes, and perpetuating stigma against Asian-Americans is appalling. This is a time to look out for our neighbors, and to unite against COVID-19.", "2020-03-19T16:16:49.000Z": "The business closures from COVID-19 are unprecedented-so we're enacting new unemployment insurance provisions to cover more affected workers. Learn more here: https:// oregon.gov/employ/Pages/C OVID-19.aspx ", "2020-03-19T16:03:37.000Z": "It is critical that we preserve personal protective equipment in Oregon so that our health care workers can keep themselves safe while treating COVID-19 patients Governor Kate Brown Announces New Order to Preserve Surgical Masks, Gowns, and Gloves - My Oregon... All Oregon hospitals, outpatient clinics, and health care providers will cease non-emergency procedures to preserve personal protective equipment (PPE). myoregon.gov", "2020-03-19T03:15:03.000Z": "I know our students have worked hard this school year, and we're doing everything we can to help them safely finish their learning. \n\nBut we're also learning more about COVID-19 every day, and social distancing is key to keeping Oregonians safe. Governor Kate Brown Announces New Executive Order For Higher Education Institutions New executive order directs Oregon's higher education institutions to move their curriculum to online learning as a way to prevent transmission of COVID-19. myoregon.gov", "2020-03-19T00:27:31.000Z": "Thank you @newseasons  @safeway  @albertsons for stepping up to care for the most vulnerable in our communities. Oregonians always rise to the challenge in times of crisis, and I'm proud we are coming together to help each other out. New Seasons, Albertsons and Safeway set aside hours for 'vulnerable shoppers' None of the companies indicated how or whether they plan to enforce the restrictions. oregonlive.com", "2020-03-18T21:47:20.000Z": "Take a look inside the COVID-19 Response Team's operations center to see how they're working tirelessly keep Oregonians healthy and safe. An Inside View of the COVID-19 Response Team - My Oregon News Check out the Agency Operations Center to see how teams of experts are coming together to share information and fight the coronavirus in Oregon myoregon.gov", "2020-03-18T17:42:54.000Z": "Extending the closure of Oregon's K-12 schools through April 28 keeps critical social distancing measures in place for students, parents, and teachers, slowing the spread of coronavirus and reducing the demands on our healthcare system. Governor Kate Brown Extends Statewide School Closure Until April 28 - My Oregon News New executive order guides public schools in order to slow the spread of coronavirus Portland, OR-Governor Kate Brown today announced an extension of Oregon's statewide school closure to a total of... myoregon.gov", "2020-03-17T21:46:16.000Z": "My team and I have compiled a new website for Oregonians with information and resources about coronavirus. Learn more about it here: Governor Kate Brown Centralizes Online Information about Coronavirus - My Oregon News New website is a one-stop-shop resource to answer common coronavirus questions about health, schools, businesses, and more myoregon.gov", "2020-03-17T17:22:33.000Z": "", "2020-03-16T23:34:16.000Z": "Read more about the steps we're taking here: https:// oregon.gov/newsroom/Pages/NewsDetail.aspx?newsid=36192 ", "2020-03-16T22:24:02.000Z": "Restaurants, bars, and other establishments that offer food or beverages for sale are restricted to carry-out and delivery only, with no on-site consumption permitted. (Food service at hospitals, workplaces and other essential facilities will continue.) [4/6]", "2020-03-16T22:24:01.000Z": "I am putting in place new social distancing measures for Oregon. My goals are to decrease the rate of coronavirus transmission in Oregon, preserve hospital capacity for those who need it most, & decrease economic impacts on Oregonians. [THREAD, 1/6]", "2020-03-16T21:30:56.000Z": "In a global pandemic, days are like weeks, and every hour counts. Tune in to hear the actions we're taking today to save lives. Oregon COVID-19 Update: March 16, 2020 youtube.com", "2020-03-15T20:27:27.000Z": "While Oregon's K-12 schools are closed, I've asked each district to with continue nutrition services. It's wonderful to see our schools step up and take care of students in need by providing grab & go meals. Oregon School Districts Provide Free Meals During COVID-19 Closure - My Oregon News Find the list of the Oregon school districts serving free meals to students myoregon.gov", "2020-03-15T03:32:00.000Z": "Although we knew this day would come, it does not make it any easier to learn of the first Oregonian to pass away from COVID-19. He was an honored veteran who served his country to protect the freedoms we all hold dear. Our thoughts are with his family and friends.", "2020-03-14T16:17:42.000Z": "A sweet story and great advice from a kind Oregonian, @rebecca_mehra : \"Offer to help anyone you can. Not everyone has people to turn to.\" Pro Bend runner helps couple buy groceries amid flu fears Amid the fears sparked by the coronavirus pandemic, a good deed by Bend professional runner Rebecca Mehra about helping an elderly couple buy groceries has gone viral on Twitter. bendbulletin.com", "2020-03-14T00:48:31.000Z": "America faces critical blood shortages during this public health crisis. Help hospitalized Oregonians by donating blood; go to http:// RedCrossBlood.org or call 1-800-REDCROSS ( @redcross is following social distancing & sanitizing rules to prevent exposing donors to coronavirus) Home Page Blood donors report feeling a sense of great satisfaction after making their blood donation. Why? Because helping others in need just feels good. Donate blood today to help those in need. redcrossblood.org", "2020-03-14T00:31:06.000Z": "With Oregonians working and learning remotely, internet access is more important than ever. During these unprecedented times, I'm thankful to @comcast and @GetSpectrum for offering free internet service to students and low-income families. Oregon Utilities Companies Extend Service During COVID-19 Outbreak - My Oregon News Pacific Power, PGE, and NW Natural suspend service disconnections and late fees to support Oregonians dealing with coronavirus myoregon.gov", "2020-03-13T23:27:46.000Z": "Oregon has been increasing our support for families for exactly times like these. Don't forget these resources that are available to you: http:// bit.ly/ORsicktime Quote Tweet Oregon Bureau of Labor & Industries @OregonL_I Timely question.\n\nQ: If my son's school is closed because of #coronavirus can I use sick time?\n\nA: Yes - employees have a right to use available #sicktime for a closure of their child's school (or place of care) by order of a public official due to a public health emergency.", "2020-03-13T18:57:07.000Z": "STARTING AT 12:00PM. Thank you for your patience.", "2020-03-13T18:16:35.000Z": "For all trying to access today's teleconference, we believe there is a network overload. Please standby. We will let you know how to access this conference momentarily. Quote Tweet Governor Kate Brown @OregonGovBrown HAPPENING NOW, INFO for the press teleconference on school closure: \n\nToll-Free: 877-226-8143\n Access Code: 7032200", "2020-03-13T18:11:34.000Z": "HAPPENING NOW, INFO for the press teleconference on school closure: \n\nToll-Free: 877-226-8143\n Access Code: 7032200", "2020-03-13T05:52:46.000Z": "This is a trying time for our community and I am reluctant to increase the burden on families who are already struggling during this crisis. I want to thank all of the teachers and school employees who have worked hard to keep our schools open until now. Governor Kate Brown Announces Statewide School Closure for Students in Oregon from Monday, March 16... In consideration of challenges and concerns due to the threat of coronavirus, Governor Kate Brown today announced a statewide closure of Oregon K-12 schools myoregon.gov", "2020-03-12T23:34:16.000Z": "In this unprecedented time, I appreciate businesses caring for our community in different ways. @portlandgeneral  @PacificPower_OR & @nwnatural are suspending late fees and disconnections during the coronavirus emergency, ensuring Oregonians have one less thing to worry about.", "2020-03-12T22:54:23.000Z": "The 2020 Census starts today! Counting each and every Oregonian matters more than ever: $19 billion in federal funds & a 6th Congressional seat are at stake. Fill it out online, by phone or by mail. Oregon is *counting* on you! Census 2020 youtube.com", "2020-03-12T18:54:43.000Z": "We are now in an unprecedented public health crisis, a rapidly-evolving global pandemic. What is clear is that we must take immediate action to stem the spread of the COVID-19 coronavirus, and act now to protect those who are most vulnerable. Governor Kate Brown Issues Orders on COVID-19 - My Oregon News Governor Kate Brown set new rules to slow the spread of COVID-19 in Oregon, issuing an Executive Order addressing large gatherings and social distancing. myoregon.gov", "2020-03-12T15:46:47.000Z": "I will be discussing these new steps to stem the spread of coronavirus in Oregon this morning at 9am - joined by @OHAOregon , @dkafoury , @tedwheeler , Tri-County health officials, and other state and local officials. \n\nLIVE STREAM: https:// youtube.com/watch?v=PruG7Q BbSUs  Quote Tweet Governor Kate Brown @OregonGovBrown I have announced urgent new rules to slow the spread of COVID-19 coronavirus in Oregon - measures based on the recommendations of @CDCgov , Oregon public health experts, epidemiologists, and health professionals. https:// myoregon.gov/2020/03/11/gov ernor-kate-brown-announces-forthcoming-orders-on-covid-19/ ", "2020-03-12T15:37:24.000Z": "I have announced urgent new rules to slow the spread of COVID-19 coronavirus in Oregon - measures based on the recommendations of @CDCgov , Oregon public health experts, epidemiologists, and health professionals. Governor Kate Brown Announces Forthcoming Orders on COVID-19 Governor Kate Brown announced new rules to slow the spread of COVID-19 in Oregon, following measures based on the recommendations of public health experts. myoregon.gov", "2020-03-11T20:13:02.000Z": "I'm proud to be leading the charge of states taking action on climate change. This is crucial and urgent to protect the Oregon we know and love for generations to come. https:// time.com/5800507/oregon -global-warming-bill/ ", "2020-03-11T19:51:21.000Z": "Young people around the state have made it clear they need today's leaders to take bold, decisive action now - before our planet runs out of time. My executive order directs state agencies to take every step possible to reduce greenhouse gas emissions. Gov. Kate Brown directs Oregon agencies to cut greenhouse gas emissions The order hews to the same greenhouse gas reduction goals envisioned by the supporters of cap and trade, but it does not use the same methods. statesmanjournal.com", "2020-03-10T18:08:03.000Z": "We applaud @OregonGovBrown for taking bold executive action on climate. This is a great step forward to reducing greenhouse gas emissions in Oregon and helping ensure that Oregon does its part in addressing the global climate crisis. #ORclimateaction  #orpol", "2020-03-10T18:56:23.000Z": "I commend @OregonGovBrown for her leadership in moving forward with an executive order directing state agencies to take action on climate, and directing resources to accelerate this important work. Gov. Kate Brown Orders State Action On Climate Change The executive order Gov. Kate Brown issued Tuesday contains similar provisions to a cap-and-trade bill that failed this month. But it adds more sweeping steps, too. opb.org", "2020-03-10T22:36:37.000Z": "Thanks, @CJMcCollum , for the assist. It's a team effort to guard against the coronavirus.", "2020-03-10T19:47:08.000Z": "Charlie, a sophomore at Cleveland High, has been coming to the Capitol since 6th grade to testify for climate action. That's 5 sessions of waiting for adults to do something. I'm proud that today, with Charlie & other students, we put an end to that count. Governor Brown Issues Climate Executive Order, Cheered on By Students - My Oregon News Students around the state advocated for swift, bold action on climate change myoregon.gov", "2020-03-10T18:22:23.000Z": "It's time we put Oregon on a path our children can be proud of. Today I issued an executive order setting new science-based climate goals, and directing state agencies to take urgent action to lower greenhouse gas emissions and address climate change. Governor Kate Brown Takes Climate Action - My Oregon News Governor Kate Brown signed an executive order on climate, putting new measures into effect to lower greenhouse gas emissions to meet Oregon's climate goals. myoregon.gov", "2020-03-10T17:28:46.000Z": "Climate change is the issue of our time. I'm about to make a big announcement on climate action, watch live here: https:// facebook.com/oregongovernor", "2020-03-10T17:28:23.000Z": "I couldn't agree more. Go Women's Ducks! \"I'd challenge anyone to watch Ionescu and these Ducks and not wonder if we're watching the greatest team to ever suit up on behalf of our state.\" Canzano: Oregon dismantles Stanford -- Portland Regional, ready for the Ducks' show? UO leaves no doubt. oregonlive.com", "2020-03-08T19:38:52.000Z": "I have declared a state of emergency, in consultation with @OHAOregon , to ensure that we are able to swiftly and fully deploy the personnel and resources necessary to address coronavirus in Oregon. Governor Kate Brown Declares State of Emergency to Address Coronavirus Governor Kate Brown declared a state of emergency in Oregon to address the spread of the novel coronavirus after seven new cases were identified. myoregon.gov", "2020-03-07T19:51:01.000Z": "This weekend is the 55th anniversary of the Bloody Sunday marches in Selma, where civil rights organizers fought for the right to vote. It's a reminder of how precious that right to vote is and the work still ahead to ensure every eligible voter has access to the ballot.", "2020-03-07T17:06:38.000Z": "State and local health officials are moving quickly to contact people who may have been in close contact with the individuals who tested as presumptively positive cases. Three of the new cases are travel-related; one was a contact of a known case.", "2020-03-07T17:06:11.000Z": "Today we're announcing 4 new presumptive case of #COVID19 in among residents in Jackson, Klamath and Washington counties. #Oregon  #coronavirus", "2020-03-07T03:01:05.000Z": "Thanks to infectious disease professor at @OHSUDoernbecher & @OHSUNews Dr. Dawn Nolt for sharing the 3 simple hand washing tricks we need to be doing to protect ourselves and our families from COVID-19 coronavirus. COVID-19 prevention with hand washing Dr. Dawn Nolt of OHSU gives expert tips on hand washing youtube.com", "2020-03-07T00:31:06.000Z": "I also applaud self-insured Oregon companies that are waiving cost-sharing for their employees for COVID-19 testing, including A-Dec and Daimler, and hope more will follow as a way to keep employees healthy and safe.", "2020-03-07T00:31:05.000Z": "Fearing  medical bills shouldn't prevent anyone who needs a COVID-19 test from getting it. I'm proud to partner with the following Oregon health insurers to announce that there won't be charges to patients for COVID-19 tests if you go in-network: (THREAD) https:// oregon.gov/newsroom/Pages/NewsDetail.aspx?newsid=36097 ", "2020-03-05T20:07:53.000Z": "When it comes to protecting the health and safety of Oregonians, you put aside your differences and stand united. I spoke with VP @Mike_Pence about how we can work together to get Oregon the critical supplies and funding we need. Gov. Kate Brown and Vice President Mike Pence Make Bipartisan Plan for Oregon's Coronavirus... The Governor and the Vice President talked by phone about funding and resources needed to keep Oregonians safe and healthy from the COVID-19 coronavirus. myoregon.gov", "2020-03-05T19:09:39.000Z": "Thanks to @calimapnerd and the @RedCrossCasc team for providing medical treatment, housing & supplies to folks who lost everything in Pendleton. I declared March Red Cross Month to honor their amazing work year-round in Oregon for disaster preparedness, relief, and recovery.", "2020-03-05T04:15:50.000Z": "I know Oregonians have questions about Coronavirus, and my goal is to get you information as quickly as possible. Today I sat down with @OHAOregon Director Pat Allen and epidemiologist Dr. Dean Sidelinger for a Q&A. COVID-19 Q&A, Facebook Live, March 4, 2020 Governor Kate Brown, OHA Director Patrick Allen and Dr. Dean Sidelinger, State Health Officer youtube.com", "2020-03-04T22:06:03.000Z": "At a time when the fundamental right to access reproductive health care is being challenged in states across the nation, I hope the SCOTUS will uphold precedent and protect women's right to choose. Quote Tweet Kirsten Gillibrand @SenGillibrand Today, the Supreme Court begins reviewing a restrictive anti-abortion law in Louisiana. Pay close attention to this case and what happens, because if upheld, it would put every woman's right to safe, legal abortion in serious jeopardy. \n\nI'll tell you more about it: Show this thread", "2020-03-04T19:04:15.000Z": "No eligible voter should have to wait in line for 7 hours to exercise their right to vote. Here in Oregon, we continue to lead the way with vote by mail and automatic voter registration. It should be easy, and without barriers, for eligible voters to make their voices heard. Quote Tweet ed lavandera @edlavaCNN The last voter at Texas Southern University has walked out of the voting booth. It took Hervis Rogers nearly 7 hours to vote tonight. #supertuesday2020", "2020-03-04T03:00:08.000Z": "Join us tomorrow, March 4 at 12:15-12:45 p.m. for a novel coronavirus (COVID-19) Facebook live event with Governor Kate Brown, Oregon Health Authority Director Patrick Allen and Oregon State Health Officer and Epidemiologist Dr. Dean Sidelinger. Join here: https:// facebook.com/OregonHealthAu thority/ ", "2020-03-04T04:09:02.000Z": "From jumping slugs to hissing owls to very adorable Humbolt martens, Oregon is home to many weird, wonderful creatures. For #WorldWildlifeDay , learn more about our native animals and how we can keep them safe for years to come. https:// myodfw.com/wildlife-viewi ng/species/mammals ", "2020-03-04T00:51:08.000Z": "An update on the coronavirus situation in Oregon. March 3 COVID-19 Coronavirus update youtube.com", "2020-03-03T21:06:59.000Z": "The whole country is watching the national public health response to the coronavirus. I sat down with @npratc (hosted by Oregon native @arishapiro ) to share what we know so far and the key steps we're taking here at home to keep Oregonians safe & healthy. Oregon Governor Outlines Her State's Preparation For Coronavirus Impact NPR's Ari Shapiro speaks with Oregon Gov. Kate Brown about how her state is prepping for possible communal spread of the novel coronavirus. npr.org", "2020-03-03T01:28:31.000Z": "I'll be sharing updates regularly about the COVID-19 Coronavirus in Oregon to get information to you as quickly as possible. You can watch my first one now. March 2 COVID-19 Coronavirus update youtube.com", "2020-03-02T00:49:33.000Z": "We are committed to providing up-to-date information on coronavirus and its impact on schools in Oregon. Please review the COVID-19 Resources page on our website and help us spread the word. https:// oregon.gov/ode/students-a nd-family/healthsafety/Pages/COVID19.aspx ", "2020-03-02T04:24:12.000Z": "My thoughts are with the Oregonians who have contracted this virus, as well as their families. The developments of the last 48 hours in Oregon and across the globe are concerning, and we are taking this extremely seriously. Governor Kate Brown on New Coronavirus Case in Oregon Governor Kate Brown on the Oregon Health Authority's announcement of an additional case of the COVID-19 coronavirus in Oregon. myoregon.gov", "2020-03-01T21:57:33.000Z": "I want all Oregonians to know that we are taking the coronavirus situation very seriously, and that our state agencies will share new developments as quickly as possible. To learn more about COVID-19, follow @OHAOregon and check out their website: http:// healthoregon.org/coronavirus .", "2020-02-29T04:23:23.000Z": "I understand this news is concerning, and I want Oregonians to know we are taking this very seriously.  \n\nOur health officials are professionally trained to handle this situation and are responding quickly. Oregon Health Officials Confirm First Case Of Novel Coronavirus The Oregon Health Authority announced a press conference late Friday afternoon to share information on the state's first \"presumed confirmed case\" of novel coronavirus. opb.org", "2020-02-28T22:20:59.000Z": "Let's be clear: we can't pass budgets when Republicans are not in the building. Beginning of story, middle of story, end of story. The Oregon Republican walkout over cap-and-trade comes with a cost PORTLAND, Ore. -- Republican lawmakers were still absent from the Oregon Capitol on Thursday, and there hasn't been any indication that will change soon. The walkout could come at a cost to Oregoni... katu.com", "2020-02-28T18:37:13.000Z": "There are zero confirmed cases of coronavirus in Oregon and the risk to Oregonians of contracting it remains low. However, in an escalating global health crisis, we must make sure we are as ready and informed as we can be. Governor Kate Brown Convenes Coronavirus Response Team Governor Kate Brown today convened a Coronavirus Response Team tasked with coordinating statewide preparations for response to the coronavirus. myoregon.gov", "2020-02-28T05:20:39.000Z": "These talented students stopped by the State Capitol today - the robotics team from Bend's Summit High School. Their team is called Chaos Theory, because they believe in the 'butterfly effect' (that little changes scale up and can matter more than we ever know.)", "2020-02-27T21:29:01.000Z": "When the Republicans walk away from their jobs, deny quorum and shut down government, it puts critical state funding in jeopardy - for wildfires, for foster care, for Pendleton flooding recovery... Absent GOP holds all Oregon legislation hostage They're boycotting the short legislative session to block Gov. Kate Brown's carbon emissions bill from a vote. Without them, there is no quorum - that is, not enough lawmakers on  koin.com", "2020-02-27T04:41:52.000Z": "I have been clear since the flooding happened that I am dedicated to making sure the people of the Umatilla Basin receive recovery support from the state. That commitment doesn't change with Republican lawmakers' decision to walk away from their jobs. Cap-and-trade walkout leaves Umatilla County flood aid money in limbo As Democrats and Republicans appeared to be no closer Tuesday in reaching a compromise over a controversial bill that prompted Republicans to leave the Capitol, residents in Umatilla County continued... katu.com", "2020-02-26T23:53:08.000Z": "We will keep fighting the Trump Administration's attempts to deprive Oregon women access to the family planning, reproductive, and preventative health care services they need to make critical decisions about their own health. US appeals court upholds Trump ban on taxpayer-funded clinics making abortion referrals The 7-4 ruling by the 9th U.S. Circuit Court of Appeals overturned decisions about taxpayer-funded family-planning clinics issued by judges in Washington, Oregon and California. oregonlive.com", "2020-02-26T20:23:17.000Z": "I'm in our State Capitol, ready to work - ready and waiting for the Republicans to show up and do their jobs. #orpol  #orleg Oregon Republicans' walkouts could delay critical spending until 2021 Oregon lawmakers started the session with the goal of passing bills to spend as much as $500 million on priorities such as homelessness services and foster care improvements. Now, it looks increasi... oregonlive.com", "2020-02-26T05:26:59.000Z": "I'm disappointed that Republicans in both the House and Senate have walked off the job. \n\nGood lawmaking comes from consensus and compromise.  If you don't like a bill, then show up and work to make it better.  Or show up and cast your vote against it. Legislative Update from Governor Kate Brown Legislative Update from Governor Kate Brown youtube.com", "2020-02-25T04:33:57.000Z": "I am disappointed that the Republicans have chosen to shut down government. We were elected by the voters to represent our communities and be their voices in our Capitol. It's clear the Republicans who walked out are not against climate policy, but against the democratic process.", "2020-02-24T04:28:59.000Z": "Assemble a welcome basket. Renovate a DHS office. Babysit so foster parents can catch a movie. Show up... \n\nEvery Child believes the child-welfare system is only as strong as the community that comes alongside it. They are doing incredible work. Feds celebrate Oregon's Every Child: Steve Duin column Lynn Johnson, the Assistant Secretary at the Administration for Children and Families, lauds the non-profit for its work with foster children and families oregonlive.com", "2020-02-23T16:14:53.000Z": "I am committed to making sure that Oregonians impacted by the flooding have what they need to stay in place, reopen their businesses and rebuild their lives. This $11.65 million proposal includes relief for businesses, homeowners and for levee repairs. Umatilla River Flooding | Gov. Brown releases funding proposal for Eastern Oregon floods UMATILLA COUNTY - Eastern Oregon got its first dose of financial relief from the state, but local leaders are still waiting to see how many federal agencies will follow suit. eastoregonian.com", "2020-02-21T21:13:06.000Z": "Happy 80th birthday to voting rights champion, @RepJohnLewis . Thank you for leading the way, and inspiring us all to have the courage to stand up against injustice. #GoodTrouble", "2020-02-21T04:48:04.000Z": "Much of our health is determined by how and where we live, work and play. So it's no surprise that doctors are connecting the dots between climate change and its impacts on public health - calling it \"the biggest public health crisis we've ever faced.\" Opinion: Climate change is a public health crisis Dr. Imelda Dacones writes of the effects that climate change, from wildfire smoke to smaller harvests, is having on people's physical and mental health. It's time to do something about it, she writes. oregonlive.com", "2020-02-19T23:42:02.000Z": "On the heels of today's voter access victory in FL, I got together with my friend @SenJeffMerkley to chat about how we can continue expanding voting access in our great state. Merkley-Brown Voting Video youtube.com", "2020-02-19T18:16:04.000Z": "A momentous victory today for voting rights in Florida. Quote Tweet ACLU of Florida @ACLUFL BREAKING! The U.S. Court of Appeals affirms that voting cannot be contingent on one's ability to pay. \n\nThis is a huge victory for our brave clients!", "2020-02-18T20:09:32.000Z": "This morning, I hosted the American Foundation for Suicide Prevention's Advocacy Day to hear survivor and advocate stories firsthand. Today and every day, please remember that you matter. If you're struggling, reach out anytime for help at 800-273-TALK or text \"273TALK\" to 839863", "2020-02-17T21:16:50.000Z": "On this #PresidentsDay , I'm thinking of Jimmy Carter, our oldest living U.S. president. A Nobel Peace Prize recipient, he continues to inspire me through his 30+ years working with Habitat for Humanity and his continued dedication to \"waging peace\" around the world.", "2020-02-17T16:17:23.000Z": "A quick update on the 2020 Legislative Session: GKB Leg Update A quick update about the 2020 Legislative Session. youtube.com", "2020-02-16T18:59:24.000Z": "Life has been completely turned upside down for Oregonians affected by the floods. Damage has impacted infrastructure, housing... I'm confident we can get these communities the resources they need, but it's so important we work together on solutions. Umatilla River Flooding I Gov. Brown steps into the breach PENDLETON - The Umatilla River claimed a new part of Pendleton as its own last week, and the city, county and state are still reckoning with the fallout. eastoregonian.com", "2020-02-16T04:42:02.000Z": "I'm committed to helping change the future trajectory of wildfire in Oregon - thank you @forestservice for joining us in that commitment. And thank you, Chief Christiansen, for the federal partnership around forest management in our state. U.S. Forest Service Recognizes Oregon's Leadership Toward Improving Forest Health The U.S. Forest Service recognized Oregon's leadership towards improving forest health following an agreement between forest and environmental groups. myoregon.gov", "2020-02-15T21:38:07.000Z": "I was able to see the flooded areas of Eastern Oregon firsthand, and the damage is extensive. Please keep these Oregonians in your thoughts as we all work together on recovery efforts. 'The damage is extensive': Gov. Brown tours flooded areas of Eastern Oregon Nearly 500 buildings have been reported as damaged. kgw.com", "2020-02-14T23:50:41.000Z": "Today I surveyed the devastating flood damage in Pendleton. I'm proud of how Oregonians are coming together to help: @TeamRubicon doing veteran-led disaster response, Tracy Curtis of @WellsFargo donating $100k in aid, and the heroic @OregonGuard for rescuing 54 people.", "2020-02-14T20:36:04.000Z": "It's no wonder Oregon's birthday (161 years old today!) falls on Valentine's Day; it's easy to fall in love with this amazing place.", "2020-02-13T16:58:22.000Z": "Black history is Oregon history. This is a great 30-minute @OPB documentary about the contributions of Oregon's Black pioneers from the mid-1800s. #BlackHistoryMonth Oregon's Black Pioneers Long before Oregon became a state, black people were in the Far West. Some were brought to the region as slaves, while others arrived as freemen looking for a new life. They opened boarding houses... opb.org", "2020-02-12T21:54:21.000Z": "Protecting the rights of LGBTQ+ children takes us one step closer to a more inclusive and welcoming Oregon. Lawsuit challenging transgender bathroom policy at Oregon school dismissed DALLAS, Ore. - A lawsuit challenging a rural Oregon school district's policies that protect transgender students was dismissed by the Ninth Circuit Court of Appeals on Wednesday. Parents of Dallas... katu.com", "2020-02-12T05:22:13.000Z": "Antarctica is one of the fastest warming places on Earth, and many of its glaciers are melting due to global warming. \nStop and think: when temps in one of the coldest places are nearly the same as those in Southern California, doesn't that mean something? Antarctica just registered its hottest temperature ever Argentinian scientists measured the hottest temperature ever recorded on the Antarctic continent Friday, beating the previous record set in 2015. It's another ominous sign of the rapid warming... cnn.com", "2020-02-12T00:46:28.000Z": "I've met so many bright, young #WomenInScience here in Oregon - students who are passionate about learning engineering, math, robotics, coding... they tell me \"science is cool.\" I agree! And I'm so happy that hands-on learning and #STEAM classes inspire them.", "2020-02-11T04:22:40.000Z": "We all know that if we work together, we can make Oregon a better place for everyone. And that's exactly what happened here. Gov. Brown introduces landmark compromise to end 'timber wars' Governor Kate Brown announced a landmark compromise between environmental groups and representatives from the timber industry Monday. koin.com", "2020-02-10T22:44:47.000Z": "This pact proves that when we work together with a willingness to compromise, we can create a better future in Oregon. Oregonians want healthy forests & fish, a vibrant forest sector and prosperous rural communities. These are not mutually exclusive goals. Governor Kate Brown Brokers Unprecedented Agreement Between Timber and Environmental Groups A new memorandum of understanding between Oregon's timber industry and environmental groups will chart a new path for science-based forest management. myoregon.gov", "2020-02-08T22:49:32.000Z": "Thank you, @OregonGuard - and all the first responders, state agencies, and volunteers working around the clock to help Oregonians in need right now. 10 people rescued from eastern Oregon flooding by Oregon National Guard As flooding on the Umatilla River continues, the Oregon National Guard reports the agency has rescued 10 people in less than 24 hours, including two National Guard Swift Water rescuers who were... oregonlive.com", "2020-02-07T23:25:00.000Z": "This emergency declaration ensures state resources, emergency response personnel, and equipment can be activated to complement critical local resources. @OregonOEM will continue to provide regular updates.", "2020-02-07T23:24:59.000Z": "Please join me in keeping the families of the Confederated Tribes of the Umatilla Indian Reservation and all those displaced by flooding in Eastern Oregon in your thoughts today.", "2020-02-07T04:02:31.000Z": "Thrilled to celebrate our wonderful @trailblazers ! #RipCity Quote Tweet Portland Trail Blazers @trailblazers 50 years ago today, Harry Glickman brought NBA basketball to Portland. @OregonGovBrown helped celebrate by signing a proclamation declaring today Portland Trail Blazers Day!", "2020-02-06T04:19:16.000Z": "150 years since the 15th amendment, yet states like Texas & Florida are still making it difficult for people of color to access the ballot box through voter suppression tactics. We must keep fighting to ensure every single eligible voter's voice is heard. Black Americans got the right to vote 150 years ago, but voter suppression still a problem On the 150th anniversary of the 15th Amendment, voting rights continue to be assailed. America lacks a national voting right for all citizens. usatoday.com", "2020-02-06T00:45:12.000Z": "These health care leaders' policy recommendations include meeting and strengthening Oregon's greenhouse gas emissions reduction goals.\n\nIn their words: climate change is the \"greatest public health challenge of the 21st century.\" More Than 500 Oregon Health Leaders Declare Climate Change A Public Health Emergency More than 500 health professionals from around the state have declared that climate change is a public health emergency. They are recommending 10 policies that would move the state towards its... opb.org", "2020-02-05T23:34:30.000Z": "For our communities to continue to thrive, Oregon must be resilient and ready to recover from natural disasters, including an eventual Cascadia event - also known as 'The Big One.' We must be prepared and we have to prioritize action as a state. Governor Kate Brown Calls on Legislature to Support Earthquake Resiliency Package A proposed $12.7 million investment for earthquake resiliency will prepare Oregon by building infrastructure and improving citizen awareness and education. myoregon.gov", "2020-02-05T05:06:19.000Z": "The President brought up the marchers of Selma and Martin Luther King Jr. tonight - people who put everything on the line to fight for voter access. We must honor their legacy by restoring the right to vote in this country. \n\nLet's pass HR1 and protect voting rights. #SOTU", "2020-02-05T04:17:02.000Z": "If the President really wants to help Americans with pre-existing conditions, he could stop backing lawsuits that states like Oregon are fighting that could cost 130 million Americans (including 1.6 million Oregonians) their health coverage. #SOTU", "2020-02-04T21:59:06.000Z": "Oregon is one of the most modern, secure and efficient voting systems in the country. We've made safeguarding the sanctity of our elections a priority. Vote-by-mail is one tool we use to ensure every eligible voter has access to the ballot box - it works. Oregon Elections Director: Mail-In Voting Gaining Interest Oregon's elections director says more state elections directors are expressing interest in Oregon's vote-by-mail elections,  as Democratic Party officials in Iowa struggle to announce votes from... usnews.com", "2020-02-04T04:16:48.000Z": "To Kira: I hear you, and I promise you that I too am concerned about your future if we don't take meaningful action on climate change now. \n\nOregon may be small, but I know we can make a huge impact on this crisis by taking urgent action. Don't turn your back on our future I am frightened for my future and there is only a short window to do anything about it. I, and my classmates and friends, need the adults in charge to bendbulletin.com", "2020-02-03T22:57:35.000Z": "Almost every fire season since I became Governor has been a historic fire season. Today I called on the legislature to fund wildfire readiness, response, and recovery - we have a real chance to make a difference ahead of the 2020 fire season, and doing nothing is not an option.", "2020-02-02T23:00:57.000Z": "Legislative session kicks off tomorrow, and I believe it's critically important that we come together for Oregon's future. \n\nOur children have made it very clear: we can't wait to take action on climate change. Previewing 2020 legislative session: Gov. Brown cautiously optimistic cap and trade bill will pass A cap and trade bill failed in the last legislative session after Republican senators walked out. Brown said this bill has concessions for rural Oregon. kgw.com", "2020-02-01T20:57:29.000Z": "This travel ban goes against American values, and does not represent what our country stands for. In Oregon, immigrants strengthen the very fabric of our communities - and will always be welcome. Trump's expanded travel ban just went into effect for 6 new countries Citizens of Myanmar, Eritrea, Kyrgyzstan, Nigeria, Sudan, and Tanzania can still visit the US, but most won't be able to settle here permanently. vox.com", "2020-02-01T04:17:51.000Z": "Climate change is the most pressing issue of our time. In Oregon, we already feel the impacts from voracious wildfires to the diminishing shellfish populations due to ocean acidification - and it's only going to get more challenging. We must act now. Carbon caps part of governor's priorities in 2020 legislative session The Oregon Legislature gets back in session next week and on Monday, Gov. Kate Brown was in Portland talking about her priorities. Some of those include: affordable housing, wildfire response, and... katu.com", "2020-01-31T21:55:13.000Z": "While the FDA falls short regulating vape products, our youth are getting hooked in alarming numbers. Oregon's vaping work group will look for ways to keep our kids healthy and safe. Teens Find a Big Loophole in the New Flavored Vaping Ban The policy allows mint, dessert and fruit flavors to continue to be sold in disposable e-cigarettes, prompting many teens to switch from Juul to those devices. nytimes.com", "2020-01-31T17:16:55.000Z": "When it comes to earthquakes, a matter of seconds can mean the difference between Oregonians reaching safety or facing tragedy. ShakeAlert provides that crucial early warning - and is part of my proposed $12.7 investment to make Oregon more resilient. Governor Brown Introduces ShakeAlert Earthquake Notification System A matter of seconds can shape the outcome for communities in the event of an earthquake. And thanks to a cutting-edge early warning system, one quick and simple notification could mean the difference... myoregon.gov", "2020-01-31T05:40:20.000Z": "From more dollars for our schools and hospitals to ensuring our roads are safe and well kept, the census has a significant impact in the everyday lives of all Oregonians.\n\nMailings from the Census Bureau will begin arriving in March. Mark your calendar! New Census Website from Oregon Governor - The Corvallis Advocate Last week, the office of Gov. Kate Brown launched a new website to encourage participation in the 2020 census.   During the previous legislative session, Brown secured $7.5 million for the purpose... corvallisadvocate.com", "2020-01-30T23:33:15.000Z": "Our oceans absorbs as much as 25% of human-made carbon dioxide.\n\nAnd now those greenhouse gas emissions are causing ocean acidification, threatening Oregon's most commercially valuable shellfish: the Dungeness crab. Ocean acidification is impacting Dungeness crabs, Oregon's most-valuable fishery, study shows \"We didn't think we would see this kind of dissolution until the middle of the century.\" oregonlive.com", "2020-01-30T17:51:34.000Z": "In Oregon, we're working hard to contain the growth of health care costs. Taking health coverage away from our friends, our neighbors, and the Oregonians who need it most is not the solution. Trump pushes forward conservative transformation of Medicaid A new block grant program, rejected by Congress just three years ago, will face swift resistance from Democrats and expected legal challenges. politico.com", "2020-01-29T20:19:28.000Z": "If a major Cascadia earthquake were to strike again, we anticipate that Oregonians would be without essential services for weeks - and possibly months. \n\nWe absolutely must be prepared. Gov. Brown pushes new bill, declares earthquake preparedness week Oregon now has an official week to dedicate to earthquake preparedness. kptv.com", "2020-01-29T03:35:23.000Z": "Our democracy's strength relies on representation, and the 2020 Census is integral to making sure that Oregonians receive their fair share of federal resources and congressional representation over the next decade. Gov. Kate Brown's New 2020 Census Website Could Help Secure Oregon's 6th Congressional Seat Gov. Kate Brown unveiled a new website last week to let Oregonians know about the upcoming 2020 census in hopes of getting full participation so the state is represented accurately. It includes... wweek.com", "2020-01-28T22:43:31.000Z": "The effects of global warming are being felt across the globe - and definitely right here at home. \n\nClimate change is the issue of our time. We need to tackle it now, and preserve a future for our children, and for the generations to come. Milwaukie Becomes 1st City In Oregon To Declare A Climate Emergency Milwaukie has become the first city in Oregon to declare a climate emergency. Its resolution calls for more rapid action on reducing carbon and for the city to become carbon neutral by 2045. opb.org", "2020-01-28T17:54:14.000Z": "We can craft climate policy that protects our environment and grows our economy. Capping and pricing carbon pollution provides a way for Oregon to meet our climate goals and create new, good-paying jobs all over the state. Brown: Climate policy can protect environment, boost economy For the upcoming, short legislative session, Brown placed great importance on addressing climate change, improving wildfire response times, and affordable housing. koin.com", "2020-01-28T03:52:32.000Z": "Thank you, for all that you do for Oregon. Quote Tweet Oregon OSFM @OSFM Jan. 27 is recognized in Oregon as Fire Service Appreciation Day. On behalf of the entire OSFM staff, we extend our sincerest thanks to the men and women of the OR fire service for their professionalism, commitment, and sacrifice in keeping all Oregon residents safe. #Service", "2020-01-27T19:30:26.000Z": "This rule is wrong, and we will not stand for intolerance in America. It was designed by the Trump administration to intimidate working immigrants who live here lawfully, simply for trying to provide for their children. Supreme Court allows Trump to enforce 'public charge' immigration rule The justices lifted a nationwide injunction against a sweeping policy targeting poor immigrants. politico.com", "2020-01-26T22:15:39.000Z": "Thanks to the persistence of our students and their families, and an ongoing commitment of our educators to expand opportunities, Oregon has reached a new milestone: for the first time, 8 of 10 Oregon students graduated high school in four years. Opinion: Graduation rate gains reflect years of persistence, investment Gov. Kate Brown and Oregon Department of Education Director Colt Gill write that specialized programs, increased investment and students' hard work have combined to give Oregon its best high-school... oregonlive.com", "2020-01-26T17:45:00.000Z": "When the next large-scale Cascadia earthquake strikes the PNW, Oregon will face the greatest challenge of our lifetimes. Today marks the anniversary of the last Cascadia earth quake - a good reminder for us all to think about how we can best be prepared. Could you survive for two weeks if 'The Big One' hits? Emergency experts say it's not \"if,\" it's \"when\" the next big one will come and you need to be ready. kgw.com", "2020-01-24T23:18:07.000Z": "\"Participation in this process is an opportunity to participate in democracy the way it is supposed to be,\" says Esperanza Tervalon-Garrett. \n\nShe's leading the We Count Oregon team, working to ensure a full and accurate 2020 Census count in Oregon. Oregon Isn't Taking This Year's Census Lying Down Meet the women of color who are making sure that every Oregonian gets counted. pdxmonthly.com", "2020-01-24T17:36:54.000Z": "We must do something meaningful, and soon, about climate change - this is the issue of our time. Oregon Gov. Brown urges action on climate change Crafting climate change policy in the wake of a landmark bill that failed last year is a top priority during the upcoming short legislative session for Oregon Gov. Kate Brown, bendbulletin.com", "2020-01-24T05:17:50.000Z": "Salem-Keizer School District administrators credit Dwight Roberson with bumping the district's graduation rate for black students to the highest it's been in at least a decade. \n\nHe's an incredible role model, working so hard to help our students succeed. Meet the former NFL linebacker closing gaps for Salem-Keizer's black students | Salem Reporter Dwight Roberson came to Oregon to play football for the Beavers. Now, he's a mentor Salem-Keizer leaders credit with significantly boosting the graduation rate for the district's black students. salemreporter.com", "2020-01-24T00:33:03.000Z": "Spent the day in Bend previewing my priorities for the upcoming legislative session, including addressing climate change and wildfire response. This is so important - left unchecked, climate change will have devastating effects on all that we hold dear. Governor Kate Brown Addresses Climate Change, Wildfire in Central Oregon Governor Kate Brown today previewed her legislative priorities for the upcoming session, including addressing climate change and wildfire response. myoregon.gov", "2020-01-23T18:49:33.000Z": "Every student in Oregon deserves to graduate prepared for lifelong success and with a plan for their future. The historic reinvestment in education made possible by the Student Success Act will further empower our schools to reach new levels of learning. Oregon Graduation Rates Hit 80%, An All-Time High. Here's The Story In 6 Districts. Oregon's graduation rate has hit 80%, an all-time high. But the story is about more than the numbers. opb.org", "2020-01-23T14:56:19.000Z": "Students, educators, and families worked hard to achieve these graduation rates. A consistent focus on equity in education is working to bring up graduation rates for all students in Oregon. Quote Tweet OR Dept of Education @ORDeptEd Closing the Gaps: Statewide Graduation Rate Up to All-Time High of 80 Percent \nRead the release: https:// oregon.gov/ode/about-us/D ocuments/2018-19%20Cohort%20Graduation%20Rate%20Release%20for%20web.pdf ", "2020-01-22T22:23:08.000Z": "Building a welcoming environment at school by creating sports teams made up of students with disabilities and without disabilities playing together. Great work happening at South Salem High, where teachers say this inclusivity is decreasing bullying. Oregon High School Recognized For Inclusivity South Salem High School was nationally recognized recently for its work in building an inclusive environment for students with disabilities. opb.org", "2020-01-22T18:18:42.000Z": "The Supreme Court's landmark ruling in Roe v. Wade affirmed the right to safe and legal abortion. 47 years later, this fundamental right is being challenged across the nation. I'm proud Oregon protects a women's right to choose; let's keep fighting to make sure it stays that way.", "2020-01-22T04:31:11.000Z": "The past decade was the hottest ever recorded - caused in large part by carbon dioxide emissions.\n\n\"What happens in the future is really up to us,\" says one scientist. 2019 capped world's hottest decade in recorded history It also marked the second-warmest year ever. \"What happens in the future is really up to us,\" said one scientist. washingtonpost.com", "2020-01-21T21:27:27.000Z": "Our democracy's strength relies on representation, and the 2020 Census is integral to making sure that Oregonians receive their fair share of federal resources and congressional representation over the next decade. Governor Brown Encourages Full Participation in 2020 Census The Oregon 2020 Census Website is a platform that will help create awareness about the 2020 Census, and encourage participation. myoregon.gov", "2020-01-21T19:50:15.000Z": "The 2020 Census officially kicks off today in a remote fishing village in Alaska. Oregon and other states' count won't roll out until March, but the frozen ground in Alaska now makes it easier to reach remote communities - and everyone needs to be counted. Along The Rim of Alaska, The Once-A-Decade U.S. Census Began In Toksook Bay The 2020 census officially starts in an Alaskan fishing village along the Bering Sea. Starting the count there in January, when the ground is frozen, makes it easier to reach far-flung communities. npr.org", "2020-01-20T18:51:24.000Z": "I keep a rock engraved with these words from #MLK , \"Our lives begin to end when we are silent about the things that matter.\"\n\nI believe in the power of speaking up: for a world where the best of humanity prevails, and where every person has the right to life, liberty and justice.", "2020-01-18T05:17:30.000Z": "Kicking off the weekend with a beautiful interfaith community gathering in celebration of Martin Luther King, Jr. - Thank you Congregation Beth Israel for hosting this special Shabbat service.", "2020-01-17T18:49:58.000Z": "\"Voting is a privilege\"? No Governor, you're wrong. It's a right.\n\nLet's call this out for what it is: voter suppression. Quote Tweet Ron DeSantis @GovRonDeSantis I am pleased that @FLCourts confirms that Amendment 4 requires fines, fees & restitution be paid to victims before their voting rights may be restored. Voting is a privilege that should not be taken lightly, and I am obligated to faithfully implement Amendment 4 as it is defined.", "2020-01-17T04:32:11.000Z": "Amazing game! Was lucky to catch this one in person, and witness @sabrina_i20 score a career-high 37 points. Congratulations, @OregonWBB . #GoDucks Quote Tweet Oregon Women's Basketball @OregonWBB DUCKS WIN!!\n\nNo. 6 Oregon DOMINATES No. 3 Stanford, 87-55, behind a career-high 37 points from @sabrina_i20 ! #GoDucks | @ncaawbb", "2020-01-16T21:44:13.000Z": "Expanding access to clean, renewable energy for Oregonians who may not otherwise be able to afford the investment in solar is the focus of @ODOEnergy 's new solar + energy storage rebate program. Oregon Department of Energy Launches New Solar + Storage Rebate Program A new ODOE program is expanding access to renewable energy to Oregonians who may not otherwise be able to afford the investment in solar. myoregon.gov", "2020-01-16T18:33:23.000Z": "An estimated 70% of people will fill out the 2020 Census this year - the remaining are \"hard-to-count\" as they may not participate, for one reason or another. Local leaders across the state are getting the word out about the importance of participation. Umatilla County is ready to get a complete count UMATILLA COUNTY - Portland State University's 2019 population estimates identified an increase of 395 people in Umatilla County from 2018. But officials working to pin down a complete population count eastoregonian.com", "2020-01-15T19:44:26.000Z": "A step in the right direction: a federal judge has blocked Trump's executive order giving states and local governments the power to reject resettling refugees. \n\nOregon is, and will continue to be, a sanctuary for refugees. #RefugeesWelcome Federal judge temporarily halts Trump administration policy allowing local governments to block... The ruling means jurisdictions cannot refuse refugee resettlements as a Md. lawsuit challenging the president's executive order continues. washingtonpost.com", "2020-01-15T04:29:12.000Z": "Congratulations to The Dalles community on snagging a  top five spot on the TV show, @smbizrevolution ! If enough people vote, they could win a small business \"makeover\" -what an incredible opportunity. The Dalles could become a reality-TV star; Oregon town will get makeover if it wins viewers' hearts The makers of a little-known reality-TV series called \"Small Business Revolution -- Main Street\" want to revitalize The Dalles. oregonlive.com", "2020-01-14T21:13:32.000Z": "On this day, 100 years ago: Oregon ratified the 19th amendment. While we celebrate this milestone, we still have so much work to do. We must keep up the fight to ensure that every eligible voter can have their voice heard.", "2020-01-13T23:20:56.000Z": "\"... research has shown that automatic vote registration is proven to significantly increase the number of unregistered people who get registered.\" \n\nYes. We have seen this firsthand in Oregon. New York is trying to make it easier to register to vote New York could become the 17th state with automatic voter registration. motherjones.com", "2020-01-13T01:08:00.000Z": "I'm a bit speechless reading Craig's story. This former @BeaverFootball star has summited the highest mountain peak on each of the 7 continents - something only ~500 people in history have done! \n\nAnd he climbed 4 of those peaks after an ALS diagnosis. Craig Hanneman: STILL ASCENDING KERRY EGGERS ON SPORTS/PORTLAND TRIBUNE/PART 1: Former OSU football standout climbs three more peaks after ALS diagnosis. pamplinmedia.com", "2020-01-12T17:34:00.000Z": "From improving recycling in multifamily housing in Multnomah County to investing in a farm-to-school program in Jackson County, @OregonDEQ is helping 17 organizations across the state boost projects that benefit our environment. DEQ Awards $600,000 in Grants for Reduce, Reuse, Recycle Programs in Oregon The Oregon Department of Environmental Quality is awarding nearly $600,000 in grants to promote reduction, reuse and recycling of consumer materials. myoregon.gov", "2020-01-12T04:34:37.000Z": "The Oregon Army National Guard is blessed with truly remarkable people - and Task Force Jungleer is no exception. These volunteers will be leaving their jobs in order to serve on a peacekeeping mission in Kosovo. You make Oregon proud. #AmazingOregonians", "2020-01-11T18:32:00.000Z": "Working with local tribal leaders and the National Park Service, @OregonDOT restored the Chief Joseph memorial along Highway 351 in eastern Oregon - a tribute to preserving the past, and ensuring future generations can continue to honor and learn. Preserving the Past to Learn in the Future: Chief Joseph's Memorial ODOT teamed up with local partners to improve the Old Chief Joseph Gravesite Memorial so future generations can continue to learn. myoregon.gov", "2020-01-11T00:03:26.000Z": "A preview of inaction on climate change: as the planet warms (mostly due to increased levels of carbon in the atmosphere) the kinds of things we experience every now and then will happen more frequently - like this weekend's massive tides on the coast. Oregon coast braces for massive king tides this weekend; researchers warn this is the future The tides this weekend could push water up to 4 feet higher than the average high tide. oregonlive.com", "2020-01-10T21:57:01.000Z": "Oregon's CCO system is a national model for community-based health solutions - great to see them working with @OHAOregon to ensure patient care for the Oregon Health Plan's nearly one million members continues uninterrupted during the CCO 2.0 transition. Brown meets with CCO leaders in Southern Oregon ROSEBURG, Ore. - On Wednesday Governor Kate Brown met with CCO leaders and other health care representatives in Southern Oregon to gather feedback about their progress serving the health needs of... klamathfallsnews.org", "2020-01-09T22:35:35.000Z": "Voting is a fundamental right of being a citizen, and people across the country should have the ability to access this fundamental right without barriers like registration. \n\nAutomatic Voter Registration works. Well done, New York. Quote Tweet AJ+ @ajplus New York lawmakers approved automatic voter registration. The law would add people to voter rolls when they fill out forms at state agencies like the DMV. Once the governor signs, it will be at least the 18th state to pass such a law.", "2020-01-09T20:16:01.000Z": "In Ben's words:\n\n\"As a rural natural-resource based business owner, I realize climate legislation may very well impact my bottom line. There is no magical, free solution to this problem. But the cost of inaction will hurt my bottom line much more.\" Opinion: Pass bold climate policy to protect Oregon's natural resource heritage Cap-and-trade legislation may hurt timber businesses like Zena Forest Products, but doing nothing would be worse, writes Ben Deumling. oregonlive.com", "2020-01-08T22:54:55.000Z": "Free public transportation is helping students in Clatsop County get to school and extracurricular activities - an initiative that launches as communities across Oregon are working together to address barriers that students face in getting to school. Free Public Transportation Will Help Students Get To School The Fare Free Student Program will help students in Clatsop County access free public transportation, helping them get to school and back. myoregon.gov", "2020-01-07T23:43:08.000Z": "Hard to see the devastating wildfires in Australia, and reckon with the fact that climate change is making them worse. We join the world in wishing for the safety of all Australians.\n\nGood luck to the Oregon firefighters deploying to help. 15 Oregon Firefighters Travel to Australia to Help Fight Massive Blazes Four Oregon firefighters traveled to Australia today to assist with the country's devastating bush fires. wweek.com", "2020-01-07T20:03:45.000Z": "Excited to follow the work of Oregon's new Teacher of the Year, Mercedes Muñoz. She has a powerful message to share - in her own words: \"Special education students are general education students first - they belong to all of us.\" Oregon Teacher Of The Year Says 'The Year Of Special Education' Is Upon Us Oregon Teacher of the Year Mercedes Muñoz reflects on the role of special education in schools, the emotional toll of teaching, and the need for diversity, equity and inclusion in public education. opb.org", "2020-01-06T20:45:09.000Z": "Huge congratulations to Oregon's @LAIKAStudios for winning the #GoldenGlobes Award for Best Animated Feature Film! \"Missing Link\" looks fantastic - about a 19th Century explorer who comes across Bigfoot in the PNW. Surprise! Oregon film studio Laika wins an unexpected Golden Globe \"I'm flabbergasted,\" director and writer Chris Butler exclaimed as he reached the stage to collect the award. oregonlive.com", "2020-01-04T21:36:01.000Z": "If you haven't yet seen a frozen waterfall on a winter hike, try and catch one! It's pretty remarkable. Dan and I enjoy Silver Falls, the Gorge hikes are great too. Quote Tweet TravelOregon @TravelOregon Winter waterfall watching: Because the only thing more magical than a waterfall is a frozen waterfall. http:// bit.ly/2W5spYe", "2020-01-03T23:34:16.000Z": "The facts are clear: Oregon saw youth e-cigarette use jump by nearly 80% between 2017-2019. By failing to ban all flavored vaping products, the FDA's latest decision falls short of protecting our youth from vaping-related illnesses and a lifetime of nicotine addiction. Quote Tweet OR Health Authority @OHAOregon We've been closely following FDA's announcement of a partial sales ban on flavored nicotine #vaping products and we believe the proposed enforcement action falls short of its stated goal to protect the public's health. http:// ow.ly/AXWT50xMPI3 Show this thread", "2020-01-03T20:05:58.000Z": "Scientists agree that sea levels are rising due to climate change, putting Oregon's coastal communities at risk. \n\nBest-case scenario: if we stop emitting greenhouse gases today, sea levels rise by a foot by the end of the century. Worst-case: 3 feet. Oregon Coastal Towns Confront A Fate Tied To Antarctica's Melting Glaciers Scientists agree that sea levels are rising. The question is: How much and how fast? That's an important question for communities along the Oregon Coast. opb.org", "2020-01-03T17:48:51.000Z": "Yet another attempt to interfere with a woman's right to choose. The government has no place in the conversations between women and their doctors. How is this still happening in 2020? More Than 200 Republicans Urge Supreme Court to Weigh Overturning Roe v. Wade Two House Democrats joined them in signing a legal brief in a case that is certain to inject the divisive politics of abortion into the 2020 presidential race. nytimes.com", "2020-01-03T01:40:40.000Z": "Nick Fish was a devoted public servant, and a true leader who cared so deeply about serving the people of Portland. An advocate for our environment, and a champion for the homeless. I will always remember his kindness. Dan and my thoughts are with his family.", "2020-01-02T23:33:26.000Z": "Thanks to a four step treatment process, Washington County's recycled water can now be used by breweries and distilleries to make beer, whiskey and other adult beverages. Turning Water Into Beer - My Oregon News Recycled water in Washington County can now be used by breweries and distilleries to make beer, whiskey and other adult beverages. myoregon.gov", "2020-01-02T17:10:02.000Z": "Need an easier NY's resolution than running a marathon?\n\nHow about committing to becoming a better recycler? It just takes minutes, is free & easy & doesn't require a gym membership. More: https:// go.usa.gov/xVKsc . #ReduceReuseRecycle  #KnowYourNos  #RecycleRight", "2020-01-02T16:04:58.000Z": "#Flu season is in full swing, but it's not too late to get a flu shot! You can find more information on flu clinics near you by calling @211info or visiting the CDC's vaccine finder site: https:// vaccinefinder.org  #VaccinesWork Oregon's flu season on track to match last year as outbreaks increase more than 300% in a week The flu tends to hit hardest in the first three months of the new year, and Oregon is seeing that trend play out this week. oregonlive.com", "2020-01-02T01:57:55.000Z": "What a game. What a season. Congratulations, Ducks! #RoseBowl  #GoDucks Quote Tweet GoDucks @GoDucks We're champions, baby! #GoDucks", "2020-01-01T20:32:27.000Z": "Wishing everyone a great start to 2020! There is so much I'm looking forward to this year, and topping that list is continuing to work every day to make sure Oregon is a welcoming place to all who call it home, and one where every Oregonian is given the opportunity to thrive.", "2019-12-31T22:57:16.000Z": "With the new year around the corner, I'm reflecting on the last decade - and my past few years serving as your governor. Grateful for our special home, and for all the people who work hard to help make Oregon a wonderful and safe place to live, work and raise a family.", "2019-12-31T18:54:06.000Z": "Great way to kick off the new decade! Hikes will be led by a park ranger or volunteer who will share stories about the park's history, geology, wildlife and plants. Quote Tweet Oregon State Parks @ORStateParks Have you registered for a Jan. 1 First Day Hike? Choose from 37 hikes in 31 Oregon state parks. See locations and times at https:// bit.ly/2AhfJkE See you on the trails! #FirstDayHike", "2019-12-30T22:38:00.000Z": "You can't be what you can't see. In the last few days of this decade, I'm reminded of the great steps we've taken to move forward in both the legal and cultural landscapes for our LGBTQ+ community. A very LGBTQ decade: Gay marriage, trans rights, 'rainbow wave' From the legalization of same-sex marriage across the U.S. to the political \"rainbow wave,\" the 2010s have been filled with LGBTQ milestones. nbcnews.com", "2019-12-30T17:27:56.000Z": "I happily accept your challenge, @GovEvers - feeling really good about our @uoregon Ducks and the upcoming #RoseBowl . I wager back a bottle of Oregon wine, and look forward to Wednesday's game! #GoDucks Quote Tweet Governor Tony Evers @GovEvers Holy (Spotted) Cow! The #RoseBowl game is just around the corner. I've challenged @OregonGovBrown to a friendly wager. I'm wagering a 6-pack of Wisconsin's one-and-only Spotted Cow that the #Badgers will take down the Ducks at the game on Wednesday!", "2019-12-30T16:56:13.000Z": ". @LiveWireRadio showcases artists, thinkers and cultural makers who are shaking things up and pushing the needle in their respective fields. Thanks to support from @OrCulturalTrust , they're growing! Live Wire Radio to Grow Team, Thanks to Cultural Trust - My Oregon News Live Wire Radio, one of Oregon's greatest exports, is about to grow even more with help from an Oregon Cultural Trust grant award. myoregon.gov", "2019-12-28T19:22:00.000Z": "The new year is just around the corner, and @OHAOregon is encouraging folks to consider making health one of their top priorities for 2020. (I'm in!)\n\nSome great tips on how to make that happen ~ OHA's New Year's resolutions for a Healthy 2020 - My Oregon News The Oregon Health Authority is encouraging people to consider making health one of their top priorities in 2020, sharing resources to help. myoregon.gov", "2019-12-28T05:48:27.000Z": "It's not too late to get your flu shot! A few tips from @OHAOregon to help keep you and your family healthy this flu season. Quote Tweet OR Health Authority @OHAOregon If you're concerned about your little ones, here are a few ways to protect them:\n1. Get a #flu shot - it's not too late!\n2. Wash your hands regularly & avoid people who are sick.\n3. If they develop a cough/congestion accompanied by fever, call their primary care provider. twitter.com/KATUNews/statu", "2019-12-27T23:09:02.000Z": "Holidays can be tough for troops abroad, but also challenging at home. You can help connect a veteran in need with resources and support. #bethere  #oregonvet  #veterans  #vnmagazine Handling PTSD During the Holidays - Issuu Holidays can be especially tough for troops deployed abroad, but they can also be challenging for veterans in need. And this holiday season, we have an important message for those who have worn the... issuu.com", "2019-12-27T21:30:00.000Z": "Great work happening at the community level to encourage participation in the 2020 Census - which is critical to ensuring Oregonians receive their fair share of federal resources and congressional representation over the next decade. #WeCountOregon Ensuring Every Oregonian is Counted in the 2020 Census #WeCountOregon is a community-led effort working to ensure that every Oregonian - especially those considered hard-to-count - complete the 2020 Census. myoregon.gov", "2019-12-27T17:59:25.000Z": "This is an important reminder that if left unchecked, warming temperatures across the globe will continue to create a year-round risk of wildfires - with a price tag to match. Decade in Review: Drought and weather patterns sparked smoke in Southern Oregon Southern Oregon's worst summers for wildfires have all fallen within the past six years, coinciding with the region's warmest summers in more than a century. The low point came in 2018, when Rogue... mailtribune.com", "2019-12-27T01:40:00.000Z": "Just sharing a beautiful photo of our stunning Oregon from my husband, Dan. This is Mount Hood looking across at Mount Jefferson and Three Sisters. Dan snapped this on an evening hike during those magical \"golden hour\" moments.", "2019-12-26T21:45:05.000Z": "Wow, incredible accomplishment! Congratulations @colinobrady and team - showing us all where hard work, passion, and perseverance can take you. #AmazingOregonians Quote Tweet Colin O'Brady @colinobrady Yesterday, 10:55a Chilean time, our six man crew on board the Ohana row boat completed the world's first fully human-powered and unsupported crossing of Drake Passage, from Cape Horn in South America to the Antarctica Peninsula. I am deeply proud to be a part of this team. Show this thread", "2019-12-26T19:57:39.000Z": "Wishing warmth and togetherness for all who celebrate Kwanzaa. May your days and the coming year be filled with family, happiness and peace.", "2019-12-26T17:35:00.000Z": "ICYMI: Dozens of gray whales are passing the Oregon Coast every hour right now! http:// ow.ly/CTBX50xClyK   @NOAA", "2019-12-25T00:30:00.000Z": "Wishing everyone a #MerryChristmas ! May this special time be celebrated with loved ones, and filled with peace, joy and smiles.", "2019-12-24T16:53:15.000Z": "Passes are looking good. No significant issues on Oregon highways this morning. It's a good day to go to Grandma's house for hot chocolate and pumpkin pie. #sleighbells  #safetravels  #family GIF", "2019-12-23T21:24:22.000Z": "Astronauts heading to the lunar surface used to train in Oregon's 'Moon Country', where they could be exposed to various types of terrain. Today there's a renewed push to return to the moon, and Oregon may once again play an essential role in that effort. Oregon's Moon Country Before the Apollo astronauts went to the moon, they trained in Central Oregon's Moon Country. opb.org", "2019-12-23T18:44:13.000Z": "More preschool slots and early learning opportunities are coming to Oregon thanks to a competitive $26.6 million federal grant. #ECE  #PDGB5  https:// oregonearlylearning.com/oregon-awarded -26-6-million-federal-grant-to-expand-preschool-early-learning-services/ ", "2019-12-23T17:35:09.000Z": "Great news! @OREarlyLearning was just awarded a competitive federal grant to improve and expand programs that serve Oregon's children and families from birth to age five. Oregon Awarded $26.6 Million Federal Grant to Expand Preschool, Early Learning Services The Early Learning Division was awarded a $26.6 million grant to improve and expand programs to serve Oregon children and families from birth to age five. myoregon.gov", "2019-12-23T02:00:00.000Z": "Wishing a #HappyHanukkah to all who celebrate! May your days be filled with warmth, happiness, friends and family. Chag Sameach.", "2019-12-21T19:05:00.000Z": "Freshwater mussels are extremely important to our lake and stream ecologies here in Oregon, and around the world. But their populations are decreasing, and that's a really big deal - enough so that @MyODFW floated the Owyhee River to learn more. Musseling Down The Owyhee River - My Oregon News Freshwater mussels are important to Oregon's lake and stream ecologies, but their populations are decreasing. ODFW travels the Owyhee River to learn more. myoregon.gov", "2019-12-21T01:53:00.000Z": "What if your holiday gifts for loved ones could also help protect the environment? In the spirit of the holiday shopping season, @OregonDEQ is encouraging Oregonians to think a bit differently when buying clothing gifts. Make Every Thread Count This Holiday Season - My Oregon News \"Make Every Thread Count\" asks people to think differently before buying clothes and find ways to extend the life of clothing before making new purchases. myoregon.gov", "2019-12-20T23:31:07.000Z": "The details are wonky, but in short, this new rule could make abortion cost-prohibitive and put access to abortion out of reach for many. \n\nYet another attack on reproductive health care. The Trump Administration Just Finalized a New Rule That Could Wreck Health Insurance Coverage of... What's at stake? More than 3 million people with health insurance coverage of safe, legal abortion could be affected. plannedparenthoodaction.org", "2019-12-20T21:57:10.000Z": "It's the season of giving, and to me that always feels like a good opportunity to lend a hand to those in need. Even a small gesture can make a huge impact in someone's life.", "2019-12-20T19:38:14.000Z": "Oregon is the #1 producer of Christmas trees in the U.S.! Quote Tweet OSU Ag Sciences @OSUAgSci Oregon leads the nation in #ChristmasTree production! Learn how @OregonState research helps support the industry.  #HappyHolidays Full Video and Article: https:// beav.es/Zjf", "2019-12-19T23:21:29.000Z": "Job training programs can help all Oregonians, not just our recent graduates. This one from @OregonDHS helps older adults contribute to their community while also building new, relevant job skills - leaving a huge impact on their economic well-being. Broadening Skills and Employment Possibilities For Older Oregonians A job training program is providing training for low-income, unemployed older Oregonians so they can contribute and improve their economic well-being. myoregon.gov", "2019-12-19T20:42:27.000Z": "A friendly reminder for all traveling Oregonians this holiday season to be prepared for winter driving conditions. \n\nHere's a few tips from @OregonDOT to help get you where you're going safely. Expect Stormy Conditions as Holiday Travels Get Under Way Holiday travels in Oregon: be prepared for winter driving conditions this holiday season especially with wind and heavy rains forecast before Christmas. myoregon.gov", "2019-12-19T18:14:58.000Z": "The ruling on the Affordable Care Act does not impact health coverage in Oregon today. Quote Tweet OR Health Authority @OHAOregon #Oregon Health Plan members: Your benefits have not changed.\n\nYou may have heard about yesterday's ruling on the #ACA which voided the individual mandate but left much of the law intact. We want you to know that your benefits have NOT changed. http:// ow.ly/ULDt50xEiyy  #Medicaid", "2019-12-19T04:08:10.000Z": "Please note: this ruling will not impact health coverage in Oregon today. \n\nHowever, if ultimately successful, this lawsuit would be a giant step backwards for all who believe that every Oregonian should be able to have quality, affordable health care. Individual mandate ruled unconstitutional, ACA in limbo The decision leaves the fate of the rest of the law in limbo, catapulting questions about insurance coverage and consumer protections to the forefront of the 2020 races. washingtonpost.com", "2019-12-18T22:09:33.000Z": "Such an important program helping children going through the adoption process create connections and foster understanding. One fun and creative part of the program: the kids \"adopt\" Build-A-Bears as a way to go through all the steps of the process. Demystifying the Adoption Process for Oregon's Children A class centered on children starting the adoption process is creating connections and fostering understanding for kids going through the adoption process. myoregon.gov", "2019-12-18T17:41:33.000Z": "Quote Tweet ACLU of New Jersey @ACLUNJ BREAKING: @GovMurphy just signed the bill to restore voting rights to people on probation and parole. \n\nIn 1844, NJ passed a law taking away the right to vote based on a criminal conviction.\n\nToday-175 years later-the stroke of a pen returned that right to 83,000 people.\n\nWatch:", "2019-12-17T22:11:44.000Z": "The Pacific Ocean off the West Coast is acidifying at twice the rate of the rest of the world's oceans - largely due to absorbing carbon dioxide from the atmosphere (... the same greenhouse gas that's driving changes to the climate around the globe). Ocean waters off West Coast acidifying at twice the rate of global average, NOAA researcher finds \"It's going to make the extremes more extreme.\" oregonlive.com", "2019-12-17T18:43:21.000Z": "Don't forget that open enrollment has been extended through midnight tonight! If you, or someone you know, still needs health care coverage for 2020, now is your chance to review health plans and sign up. #GetCovered Five Tips To Sign Up For Health Insurance - My Oregon News Sunday, Dec. 15, is the last day to enroll in a health plan through the Oregon Health Insurance Marketplace, our state's pathway to subsidized coverage. myoregon.gov", "2019-12-17T03:07:00.000Z": "It's that time of year again! (... the holiday season, yes, but also Whale Watch Week!) @ORStateParks have identified over 20 of the best spots on the Oregon coast to spy the Gray whales migrating south, and will have experts on hand to answer questions. 25,000 Gray Whales Are On The Move South This Month Winter Whale Watch Week is Dec. 27 -31. Head to the coast to catch some of the 25,000 Gray whales migrating south past Oregon's coast. myoregon.gov", "2019-12-17T00:28:48.000Z": "Great joining Oregon's business leaders today at the Oregon Business Plan Summit. Vibrant conversations around looking to the future - and what that means for Oregon as a leader - trade, and even my lessons learned so far as governor.", "2019-12-16T22:14:13.000Z": "Open Enrollment for health insurance has been extended through midnight tomorrow - please pass along. Share with friends and family that may still need coverage. Quote Tweet Oregon Health Insurance Marketplace @ORMarketplace Breaking news! Open enrollment has been extended through midnight on Dec. 17. Still need coverage for 2020? Visit http:// OregonHealthCare.gov/WindowShop to get an estimate of the size of your subsidy, review health plan options, & then follow instructions to the http:// HealthCare.gov app.", "2019-12-16T18:11:09.000Z": "Investment in rural assets for innovation like the UAS facility in Pendleton are driving very cool results...\n\nRobo air taxi completes flight testing at Pendleton airport Robo air taxi completes flight testing at Pendleton airport, Airbus moves on Airbus has wrapped up flight testing of a pilotless air taxi in eastern Oregon skies and is moving on. The global aerospace company, along with its rival nwnewsnetwork.org", "2019-12-16T01:43:55.000Z": "This video is sure to bring a smile to your face! The Eugene-Springfield Youth Orchestras' provides musical learning opportunities to kids that may not otherwise have access - and it's leaving a huge impact on them. Cultural Trust Helps Introduce Musical Opportunities To Youth Cultural organizations across Oregon will receive $2.7 million in funding from the Cultural Trust this year, thanks to the state's cultural tax credit. myoregon.gov", "2019-12-14T16:21:00.000Z": "An important tool that ensures the wellbeing of all Oregonians may also be one of the least known: the Oregon Fire Code provides rules to protect the public from hazards like fire, explosions, or dangerous conditions in buildings and other facilities. From Smoke Alarms to Auto Dismantlers: Five Things Every Oregonian Should Know About the New Fire... The Oregon Fire Code provides rules to protect the public from hazards like fire, explosions, or dangerous conditions in buildings and other facilities. myoregon.gov", "2019-12-14T00:53:45.000Z": "Food assistance is a critical component to help our most vulnerable and address hunger, which disproportionately impacts rural Oregonians, low-income communities, and communities of color. The Ripple Effects of Taking SNAP Benefits From One Person A new Trump-administration rule will cut food assistance for nearly 700,000 Americans, also affecting many of their relatives and housemates. theatlantic.com", "2019-12-13T19:05:00.000Z": "Ensuring our state is prepared for a large disaster is critical to ensuring a successful response and recovery. \n\nWe know it's going to happen, we don't know when - and we need to be prepared. Emergency Exercise Prepares State Leadership for Disasters State leaders participated in an emergency response scenario, part of a larger effort to build preparation capacities statewide in the event of a disaster. myoregon.gov", "2019-12-13T04:00:36.000Z": ". @GovAndyBeshear says it well: \"They have done wrong in the past but are doing right now... and they deserve to participate in our great democracy.\"\n\nEvery eligible voter deserves to have their voice heard. Kentucky Gives Voting Rights to Some 140,000 Former Felons The state's new Democratic governor said he would ease one of the nation's strictest policies. Iowa will be alone in barring voting by all felons. nytimes.com", "2019-12-12T15:03:00.000Z": "Time is ticking! There are only three days left to apply and enroll through http:// OregonHealthCare.gov . That's your pathway to getting a subsidy to help fit insurance into your budget. https:// healthcare.oregon.gov", "2019-12-12T19:00:23.000Z": "Events over the course of the past decade have proven that successful emergency response and recovery are the result of proactive preparation - especially at the state level. Our state government leaders take this responsibility seriously. We all need to be prepared. Quote Tweet OregonOEM @OregonOEM The Governor's Disaster Cabinet https:// oregon.gov/gov/Documents/ executive_orders/eo_16-07.pdf  had an exercise today to test emergency response coordination and prioritization capabilities with leaders in Oregon. Check out the scenario here: https:// arcgis.com/apps/MapSeries /index.html?appid=63b2e449dffb407497d93dd39a5a4c68   #OregonEM", "2019-12-12T00:52:26.000Z": "Congratulations to Julie Rowell, Oregon's winner of the Milken Family Foundation Educator Award - also known as the \"Oscar for teaching.\" She's recognized for her incredible work empowering students, especially those for whom English is a second language. Gresham teacher known for her personal touch wins 'Oscar for teaching,' $25,000 award Julie Rowell is one of 40 Milken Foundation award recipients nationwide for the 2019-20 school year and the only Oregon educator to win the distinction. oregonlive.com", "2019-12-11T22:13:59.000Z": "Some great tips from our friends at @ODOEnergy on how to save energy this holiday season. (#4 on this list really speaks to me...) How to Eat Up Less Energy in the Kitchen this Holiday Season As energy consumption ramps up during the holiday season due to seasonal festivities, here's a few tips from the experts to save energy. myoregon.gov", "2019-12-11T19:01:06.000Z": "She inspired a global movement, and brought the climate crisis to the forefront of everyone's minds - all by using the incredible power of her voice. @GretaThunberg , thank you for getting the world's attention on this important issue. It impacts us all. https:// time.com/person-of-the- year-2019-greta-thunberg/ ", "2019-12-10T22:46:06.000Z": "To mark the 75th anniversary of the close of World War II, Oregon communities will be planting special peace trees grown from seedlings that survived the atomic bombing of Hiroshima - a symbol of resilience, and the need for peace in a nuclear-armed world. Oregon Communities Mark 75th Anniversary of World War II's End by Planting Peace Trees Grown From... To mark the 75th anniversary of the close of World War II, more than two dozen Oregon communities will plant peace trees grown from Hiroshima seeds. myoregon.gov", "2019-12-10T18:29:01.000Z": "How powerful school can be when classes inspire critical thinking and help students focus on future career interest. I recently visited Hermiston High School, where hands-on learning is elevating students' education experience and introducing them to valuable career skills.", "2019-12-10T02:25:00.000Z": "Fifty percent of the folks living at Laurelwood are working full time, which tells us what a struggle it is to find affordable housing. I encourage everyone to join me in donating clothes, food and hygiene products to shelters this holiday season. Gov. Brown visits Southeast Portland transitional shelter Gov. Kate Brown toured the Laurelwood Center in Southeast Portland on Friday. It's the first time she's seen the transitional shelter since it opened in August. \"Fifty percent of the folks living... katu.com", "2019-12-09T21:22:51.000Z": "Our aging population deserves an Oregon that serves their financial, mobility, and cultural needs. People are living longer than any generation before - and it's our job to ensure a quality of life that stands the test of time. Great joining @AARPOR this morning. Quote Tweet AARP Oregon @AARPOR That you @OregonGovBrown for kicking off our summit today to make Oregon communities great places for all people to live, work and play! #orpol# #orleg", "2019-12-09T18:03:14.000Z": "We need to do everything we can to help Oregonians prepare for, respond to, and recover from emergencies. Ten communities recently received generators via @OregonOEM which can be used to supply power - especially to rural communities - during emergencies. OEM Grant Program Provides Equipment to Help Oregon Communities During Emergencies A total of $5 million has been allotted to procure emergency preparedness equipment to help Oregon communities prepare, respond & recover from emergencies. myoregon.gov", "2019-12-09T01:04:00.000Z": "An incredible team of nurses are helping reunite families from foster care - a transition that can be difficult for both child and parent. This support, provided through @OregonDHS' Child Welfare Health and Wellness Program, is helping many Oregonians. Nurses Make Home Visits to Help Children Leaving Foster Care Reunite with Their Families - My... SALEM - In Eugene a mother needs help - her child is coming home from foster care and she has complex medical needs. The mom wants to make sure she is doing everything right. In John Day a teenager,... myoregon.gov", "2019-12-07T16:58:00.000Z": "December 15 is the last day to enroll in a health plan for 2020 through the Oregon Health Insurance Marketplace, our state's pathway to subsidized coverage. Here's a few tips from the experts to help guide folks through the process. Five Tips To Sign Up For Health Insurance - My Oregon News Sunday, Dec. 15, is the last day to enroll in a health plan through the Oregon Health Insurance Marketplace, our state's pathway to subsidized coverage. myoregon.gov", "2019-12-06T23:39:40.000Z": "My goal as governor is to make sure every Oregonian has the opportunity to thrive. That means having a warm, safe and ​affordable ​place to call home. \n\nAs a community, we can do more to address housing instability if we all lend a hand to help a neighbor in need.", "2019-12-06T21:38:53.000Z": "I share the deep concerns that our youth have over the future of our planet, and the devastating impacts of climate change. Incredibly powerful seeing our students use their voices to inspire action. I hear you. Local students participate in another round of climate strikes PORTLAND, Ore. - Students are set to skip school again Friday for another climate strike. This isn't the first time students have cut class for the cause and they say it won't be their last. Students... katu.com", "2019-12-06T04:15:21.000Z": "I love the Capitol during this special time of year, when music fills the hallways. This group of choral students from Western Oregon University were fantastic. It's such a treat.", "2019-12-05T20:19:27.000Z": "Planet-warming carbon emissions hit a record high this year. Scientists warn (again and again) that if we want to avoid the most severe consequences of climate change, global carbon emissions need to steadily decline each year. Carbon Dioxide Emissions Hit a Record in 2019, Even as Coal Fades Global consumption of coal declined unexpectedly this year, but a surge in oil and gas pushed up greenhouse gas emissions over all. nytimes.com", "2019-12-05T17:50:56.000Z": "", "2019-12-05T17:50:53.000Z": "We shouldn't be making it harder for struggling Americans to make ends meet and put food on the table. This rule will impact hundreds of thousands of people. Hundreds of Thousands Are Losing Access to Food Stamps The Agriculture Department gave its final approval to the first of three rules that are ultimately expected to cut more than three million from the food stamp rolls. nytimes.com", "2019-12-04T18:30:20.000Z": "Beginning October 1 2020, travelers who are flying will need federally acceptable identification that complies with the Real ID Act. \n\nHere's what you need to know about the Real ID Act in Oregon. Five Things Every Oregonian Should Know About The Real ID Act Beginning October 1 2020, travelers who are flying will need federally acceptable identification to do so that complies with the Real ID Act. myoregon.gov", "2019-12-04T00:42:46.000Z": "The Tribal Summit presents us with the opportunity to renew our common purpose toward collective action - and as the gaming population ages, we must work together to find ways to invest in tribal communities so they can restore, grow, and remain sovereign. Tribal-State Government-to-Government Summit Kicks Off This year's Tribal-State Government-to-Government Summit is focused on ways to enhance economic opportunity in tribal communities. myoregon.gov", "2019-12-03T20:49:43.000Z": "Great meeting everyone and visiting this experiment station, which is just remarkable thanks in part to the partnerships between faculty and growers. The station is the largest grower of onions, mint, potatoes and hemp in the state! Quote Tweet OSU Ag Sciences @OSUAgSci Thank you @OregonGovBrown for visiting our experiment station in Hermiston yesterday, and learning more about the research that supports Oregon agriculture and sustainability! #AgSci  @OregonStateExt  @OregonState", "2019-12-03T18:18:41.000Z": "Kicking off the Tribal-State Government-to-Government Summit in Pendleton. Eager to listen to tribal voices as we move forward with this summit, and looking forward to all of our discussions today.", "2019-12-03T03:53:50.000Z": "The report warns that \"climate change could soon imperil the American way of life... harming the health of virtually every citizen.\" By publishing it on the busiest shopping day of the year, is the hope that we just won't see it? A Grave Climate Warning, Buried on Black Friday In a massive new report, federal scientists contradict President Trump and assert that climate change is an intensifying danger to the United States. Too bad it came out on a holiday. theatlantic.com", "2019-12-02T23:41:41.000Z": "Career Technical Education is unlocking opportunities for our students. I got to spend the afternoon at Hermiston High School learning about their comprehensive CTE programs that are helping students gain valuable skills and knowledge in fields from agriculture to engineering.", "2019-12-02T19:57:30.000Z": "Language can often be a barrier to understanding safe practices on the job, which is why @OregonDCBS ' OSHA is reaching out to underrepresented groups and making sure that they have the same access to proper resources and tools. Oregon OSHA Hosts First Spanish-Language Conference This conference reaches out to underrepresented groups and makes sure they have the same access to proper resources and tools as anyone else. myoregon.gov", "2019-11-30T18:33:39.000Z": "Small businesses are the backbone of Oregon's economy - and we're lucky to have some incredible ones all across the state. Join me this holiday season, and let's support our wonderful, local small businesses. #SmallBusinessSaturday", "2019-11-30T00:08:01.000Z": "Grandma Aggie was a remarkable person, advocate and leader. Thinking of her family and community, and honoring her legacy. Agnes Pilgrim, global advocate of indigenous rights, dies PORTLAND - Agnes Baker Pilgrim, the oldest member of Oregon's Takelma tribe and a vocal advocate for clean water and Native American rights, has died. She was 95. Pilgrim, who was better known as... registerguard.com", "2019-11-29T17:17:02.000Z": "Another great opportunity to #OptOutside today! Quote Tweet ODFW @MyODFW Free Fishing Days!\n\nOn Friday and Saturday, Nov. 29-30, 2019, no fishing licenses or tags (including a Combined Angling Tag or Columbia River Basin Endorsement or Two-Rod Validation) are required to fish, crab or clam anywhere in Oregon. - https:// dfw.state.or.us/news/2019/11_N ov/112119.asp ", "2019-11-29T17:14:35.000Z": "Happy Green Friday! This is becoming one of my favorite holiday season traditions  #OptOutside  #Exploregon Quote Tweet Oregon State Parks @ORStateParks Free parking Nov. 29 at all Oregon State Parks. https:// bit.ly/35oRJMg  #OptOutside", "2019-11-28T16:44:51.000Z": "Dan and I would like to wish everyone a warm and Happy Thanksgiving. So much to be grateful for. Enjoy this time with family, friends and hopefully some delicious food too!", "2019-11-27T21:33:00.000Z": "Climate change isn't looming - it's here. How many reports must the UN issue, and how many warnings must global scientists give before we listen and act? In bleak report, U.N. says drastic action is only way to avoid worst effects of climate change washingtonpost.com", "2019-11-27T18:53:37.000Z": "The holidays are here! And many Oregonians will be hitting the roads to visit family and friends. Please check out these tips from the @OregonDOT experts, and stay safe as we kick off the winter travel season. Over The River And Through The Woods - My Oregon News Thanksgiving is the unofficial start for the winter travel season; here's important tips from the Oregon Department of Transportation for safe travel. myoregon.gov", "2019-11-27T00:49:19.000Z": "#Breaking : A federal court just issued a preliminary ruling saying that POTUS can't prevent family immigration by requiring proof of health insurance. Congrats to AILA and Oregon's own Innovation Law Lab! I am proud of Oregon's leadership role on an amicus supporting this case.", "2019-11-26T21:56:49.000Z": "With Thanksgiving almost upon us, here's a good reminder from @OregonDEQ that curbing food waste is a great way restaurants and individuals can create environmental benefits, such as addressing climate change. Chefs Attend Food Waste Workshop; DEQ Serves Up Advice The Food Waste Stops with Me education revolves around keeping food waste out of landfills, where it takes up space and creates greenhouse gases. myoregon.gov", "2019-11-26T18:44:48.000Z": "Oregon's Farm to School program exposes students to nutritious, locally grown food through a state grant that reimburses school districts for buying local. Wonderful seeing these students enjoy a special holiday meal! Portland students celebrate Thanksgiving with farm to school meal Portland Public Schools is one of many districts that received a grant from the state for the Farm to School program. kgw.com", "2019-11-26T16:33:02.000Z": "A series of winter storm warnings will impact upcoming holiday and other travel activities in OR. Be sure your car is stocked with the essentials for emergencies. ODOT is asking travelers to take protective and preparedness actions now. Visit http:// TripCheck.com . #SafeTravels", "2019-11-26T03:07:00.000Z": "Making the outdoors more equitable and accessible is a passion of Dan's, and important to me - and so many Oregonians. We love our outdoors. Geoff's incredible creativity and drive is taking us one step closer to that goal. When Wheelchairs Failed Him, He Invented A New Way To Hike A Bend, Oregon, inventor designs for more equity in the outdoor adventure community. opb.org", "2019-11-26T00:28:30.000Z": "At DEQ, we believe #cleanwater is a right and no portion of the #CleanWaterAct should be rolled back.\n\nThis is why we helped @OregonGovBrown draft a letter to @EPA , explaining how proposed changes would affect #Oregon 's #waterquality .\n\nRead more at https:// go.usa.gov/xpRKs .", "2019-11-25T23:40:31.000Z": "The @OregonDHS Vocational Rehabilitation​ program works in partnership with communities & businesses to help Oregonians with disabilities get (and keep) a job that matches their skills, interests and abilities. Great program helping many across our state. Lee Bond Wanted to Work - But Feared Losing Access to Benefits Vocational Rehabilitation​ helps Oregonians with disabilities, like Lee Bond, land and keep a job that matches their skills, interests and abilities. myoregon.gov", "2019-11-25T21:11:42.000Z": "Attending school is critical to student success. Wonderful seeing this community involve staff, students and families in this shared goal. Creative ways a Springfield school boosts attendance In the past three years, Douglas Gardens Elementary School involves staff, students and families on a mission to show up and be on time. registerguard.com", "2019-11-25T16:41:34.000Z": "With severe weather in the outlook, practice #SafeTravels as you prepare for the holiday weekend! This includes including emergency kit items in your car and suitcase! Quote Tweet Daniel Stoelb @DanielStoelb is forecasted for #Thanksgiving week! Be sure to check out the latest #snow data using our #LeadershipBriefing  #storymap , which is found here: https:// arcg.is/1Tnz8q . Includes the latest #orwx data from all 4 @NWS offices! @EsriDRP  @EsriSLGov  @GISPublicSafety  @OregonOEM GIF", "2019-11-23T21:01:07.000Z": "Oregon's clean air and water are part of what makes our state a great place to live, work, and play. We must stand up to the federal government's proposed changes of the Clean Water Act - which would impact water quality in Oregon. DEQ Opposes Rollbacks of Clean Water Act Regulations Governor Kate Brown and the Oregon DEQ sent a letter to the EPA detailing concerns over proposed changes to the Clean Water Act. myoregon.gov", "2019-11-22T20:08:26.000Z": "Michael's story is proof of the power in second chances. \n\nThrough @OregonCorrect , he learned job skills and had an opportunity for valuable personal development, helping him release issues from his past so he could unlock a brighter future. Oregon Corrections Enterprises, Showcasing Success - Michael Hale Michael Hale got his second chance thanks to Oregon Corrections Enterprises, which allowed him to learn applicable job skills. myoregon.gov", "2019-11-21T21:02:42.000Z": "Replacing the I-5 bridge that connects OR and WA is absolutely necessary. @OregonGovBrown and I are committed to a new bridge that will: be earthquake safe include high-capacity transit improve traffic flow benefit OR and WA for decades", "2019-11-21T18:45:40.000Z": "Research shows that youth who receive substance use disorder treatment and enroll in a recovery high school are more likely to graduate & maintain recovery. Harmony Academy does just that, helping adolescents in recovery learn in a supportive environment. Harmony Academy Helps Teens Stay in School, Recovery Harmony Academy helps adolescents in recovery learn in a supportive environment alongside classmates, mentors and educators with lived experience. myoregon.gov", "2019-11-21T00:07:23.000Z": "On Transgender Day of Remembrance, we honor the memory of those lost to anti-transgender hate and violence. And we recommit to ensuring that everyone is accepted, welcomed and celebrated for being their true self. #TDOR", "2019-11-20T21:34:24.000Z": "Exciting news: part of this funding will reconfigure a levee system to reconnect 960 acres of historic floodplain habitat and establish native vegetation along a section of the lower Columbia River. This is a huge step toward a resilient shoreline. https:// nfwf.org/whoweare/media center/pr/Pages/nfwf-and-noaa-announce-30-million-in-grants-to-support-coastal-resilience-efforts-across-nation-2019-1118.aspx ", "2019-11-20T18:54:12.000Z": "Check out this Profile in Courage highlighting one of #ODF 's own Stewardship Foresters, Jana Peterson. \nWe're pretty proud of our employees & their dedication to #Oregonians , the health of our forests, and the safety of our communities. https:// myoregon.gov/2019/10/16/pro files-in-courage-jana-peterson-13-fire-seasons-and-counting/ ", "2019-11-20T16:28:40.000Z": "Adding to @ORStateParks waiving fees for Green Friday, @MyODFW is offering free fishing (crabbing or clamming) for the two days after Thanksgiving! Friends and relatives visiting from out of town are welcome to join. Free Fishing in Oregon this Thanksgiving Weekend - My Oregon News Oregon Fish and Wildlife hosts annual Free Fishing Days the two days after Thanksgiving, so ditch the Black Friday crowds and go fishing. myoregon.gov", "2019-11-19T23:31:43.000Z": "Apprenticeships open doors to new opportunities. They help people like Tia Rose learn new skills, such as software development, so she can plug into a growing tech industry in Central Oregon. Inside A Next-Gen Apprenticeship - My Oregon News Through a State Apprenticeship Expansion Grant from the Department of Labor, the HECC is expanding registered apprenticeship in Oregon. myoregon.gov", "2019-11-19T19:20:48.000Z": "When zero-emission vehicles are widely used and charging stations are easily accessible to all, we can support economic development and the environment at the same time. Oregon Revs Up Efforts for Clean Transportation with Senate Bill 1044 Senate Bill 1044 aims to accelerate adoption of ZEVs, like electric vehicles, plug-in hybrids, or hydrogen fuel cell vehicles. myoregon.gov", "2019-11-19T18:01:55.000Z": "During our recent trade mission, we met with SM Line and made the case for continuing connections with our trading partners in Asia. I'm delighted they made the decision to come to Portland. This will create more jobs for Oregonians and more opportunities for local companies. Quote Tweet Port of Portland @PortOfPortland News: SM Line Brings Weekly Container Service to the Port of Portland's Terminal 6 http:// bit.ly/35mIsV3", "2019-11-19T01:28:00.000Z": "Members of the @OregonGuard have been mobilized for deployment, heading to Djibouti and the Middle East. This mobilization of troops marks one of the largest activations in Oregon history. Proud of these incredible Oregonians, thank you for all you do. Oregon National Guardsmen Mobilized Across the State for Diverse Overseas Operations Members of the Oregon National Guard have been mobilized for deployment while being recognized by their communities in ceremonies around the state. myoregon.gov", "2019-11-18T19:57:32.000Z": "We know we must replace the I-5 bridge. It is a safety risk as well as a bottleneck for movement in our region. @OregonGovBrown and I are committed to this. We will work with our legislatures to find a data-driven, robust solution that helps Oregonians and Washingtonians alike.", "2019-11-18T21:12:24.000Z": "This joint effort to replace the interstate bridge is critical to the safety and economies of both Oregon and Washington, and an important step forward as we invest in the growth of our region. Governors Kate Brown and Jay Inslee Begin Joint Project to Replace Interstate Bridge Governors Kate Brown and Jay Inslee signed a memorandum of intent to kick off joint efforts to replace the Interstate 5 bridge spanning the Columbia River. myoregon.gov", "2019-11-18T18:20:13.000Z": "Joining @GovInslee today to kick off joint efforts between our states to replace the interstate bridge spanning the Columbia River. The current bridge is over 100 years old, replacing it is critical to the safety and economies of both Oregon & Washington. Opinion: Giving the green light to a new Columbia River bridge Oregon Gov. Kate Brown and Washington Gov. Jay Inslee write that they are dedicating $44 million to reopen a project office for construction of a new bridge over the Columbia River. oregonlive.com", "2019-11-16T20:53:00.000Z": "The goal was to house 500 vets. Thanks to the dedicated work of community partners, 529 Oregon veterans and their families now have a place to call home #oregonvet  #vnmagazine  #veterans Operation Welcome Home - Issuu More than 500 Oregon veterans, along with countless family members, have stable housing this year, thanks to a new partnership between the Oregon Department of Veterans' Affairs and Oregon Housing... issuu.com", "2019-11-16T17:06:13.000Z": "One of Dan and my favorite post-Thanksgiving traditions is to spend time outdoors with family. @ORStateParks will be waiving fees at all parks across the state for Green Friday (Nov. 29) - a good excuse to go explore! Explore State Parks For Free On Green Friday - My Oregon News Ditch the Thanksgiving eftovers, cancel Black Friday shopping plans and lace up your hiking boots for \"Green Friday\" on Nov. 29. myoregon.gov", "2019-11-15T16:09:51.000Z": "On average, 5 Oregonians die each week from #opioid overdoses. They can, and do, happen anywhere. That's why we're launching a new initiative to prepare employers for opioid overdoses in the workplace. Join us on 11/18 at 9:30 a.m. to learn more: http:// ow.ly/E7c450xc4ep", "2019-11-15T21:38:07.000Z": "As temperatures drop to below freezing, it's more important than ever that we help Oregonians who are experiencing homelessness. @OregonHCS is distributing over $1.7 million to organizations across the state to help provide shelter to people without homes. State Announces Winter Shelter Awards and Homelessness Data Oregon Housing and Community Services (OHCS) provided over $1.7 million to organizations across the state that provide shelter to those without homes. myoregon.gov", "2019-11-15T17:18:48.000Z": "Recycle, and save money for college at the same time? Sounds good to me. Oregon recyclers can now transfer funds from their BottleDrop account to an Oregon College Savings Plan account, providing a new way to save for higher education. #AmericaRecyclesDay Bottles and Cans Add Up to Big Returns for College Bound Oregonians A new program enables recyclers from across the state to transfer funds from their BottleDrop account to an Oregon College Savings Plan account. myoregon.gov", "2019-11-14T23:17:33.000Z": "", "2019-11-14T19:08:18.000Z": "Always exciting to see #Oregon products while traveling overseas! ODA Dir, Alexis Taylor found Oregon #blueberries in a jar at a premium supermarket in Tokyo. ODA is proud to host 4 Oregon delegates during the @OregonGovBrown  #trade mission. #AgIsCool  #WhatWeDo  #thursdayvibes", "2019-11-14T19:48:01.000Z": "During the Iraq War, Oregon Veteran Jessie Miller became one of the first women in American history sent into direct ground combat. Her story is incredible. #AmazingOregonians Lioness: Oregon Veteran Jessie Miller, on the Frontlines of the Iraq War In Iraq, Spc. Jessie Miller became the first female to do solo missions for the Army. The lessons she learned there would change her life forever. myoregon.gov", "2019-11-13T22:55:28.000Z": "\"Oregon's health and education professionals stand united in this: Vaping is a youth epidemic, and there is no time left to wait for the FDA to do its job.\" My View: Flavored vape ban targets youth epidemic Oregon's health and education professionals stand united in this: Vaping is a youth epidemic, and there is no time left to wait for the FDA to do its job. pamplinmedia.com", "2019-11-13T19:30:55.000Z": "Across the state, one of the most critical issues Oregon faces is homelessness.\n\nEnding it means that every community has a comprehensive system in place to prevent homelessness in the first place, or to ensure it is a brief, one-time experience. People Experiencing Homelessness Face Structural Barriers - My Oregon News Elevating Homelessness Requires Systematic Change SALEM - Breaking New Ground, Oregon's five-year Statewide Housing Plan, articulates how Oregon Housing and Community Services (OHCS) will pave the... myoregon.gov", "2019-11-13T17:11:27.000Z": "This is a somber reminder that, left unchecked, warming temperatures across the globe will create a year-round risk of wildfires - with a price tag to match. Report: Oregon Wildfire Costs to exceed $10 billion in 20 years A new study from the governor's office estimates the cost of fighting wildfires in Oregon will total over $10 billion in the next two decades. The Governor's Council on Wildfire Response released the... katu.com", "2019-11-12T21:04:33.000Z": "Make no mistake: if we do not act to address the climate crisis immediately, we will quickly face the prospect of paying the exorbitant costs of wildfire response during a fire season that never ends. Governor's Council on Wildfire Response Reports Total Costs of Wildfires Will Exceed Tens of... The Governor's Council on Wildfire Response predicts the cost of extended wildfire seasons will exceed tens of billions of dollars over the next 20 years. myoregon.gov", "2019-11-12T18:13:13.000Z": "The very fabric of our country is made richer by the contributions of Dreamers and immigrants. \n\nIn Oregon, we will continue working to create an inclusive state and thriving communities, where everyone has the opportunity to provide a better life for their families. Quote Tweet The New York Times @nytimes Breaking News: The U.S. Supreme Court's conservative majority seemed ready to side with the Trump administration on ending DACA, a program protecting young immigrants from deportation. https:// nyti.ms/33Hif2Z", "2019-11-11T16:10:09.000Z": "Enormously grateful today, and everyday, for our brave and dedicated veterans. Thank you for your service. #VeteransDay Celebrating Courage, Sacrifice and Selflessness on Veterans Day The stories of our veterans are a crucial part of our nation's history, and the foundation upon which its legacy has been built. myoregon.gov", "2019-11-11T03:58:44.000Z": "Congratulations @OregonWBB on an incredible win! #GoDucks Quote Tweet Oregon Women's Basketball @OregonWBB DUCKS WIN!!!\n\nNo. 1 Oregon becomes just the second college team EVER to defeat @usabasketball and the first since 1999! #GoDucks", "2019-11-09T21:49:12.000Z": "Our Oregon firefighters that deployed to California to assist in response efforts with the #KincadeFire and #RanchFire are returning home. Proud and grateful for their service, and I hope they all have happy reunions with their families and loved ones.", "2019-11-08T23:44:21.000Z": "We need to be prepared on all fronts for when the next big Cascadia subduction zone earthquake strikes the Pacific Northwest. @OregonGuard just participated in a simulated large scale earthquake exercise, exchanging best practices with 20 countries. Oregon National Guard Participates in International Exercise and Exchange Twenty countries came together for an exercise geared at comparing best practices for disaster relief and simulating a large scale earthquake response. myoregon.gov", "2019-11-08T20:38:26.000Z": "I believe wholeheartedly in the power of STEAM education, and hands-on learning. It provides a pathway for more students to graduate high school, and obtain\ncareer-ready skills critical to their lifelong success. \n\nHappy #NationalSTEAMDay !", "2019-11-08T00:46:17.000Z": "Exchanging ideas and sharing experiences with these incredible women leaders from South Korea's public and private sectors. Our meeting was only an hour and a half, but we could have discussed strategies for enhancing women's leadership all afternoon!", "2019-11-07T19:14:10.000Z": "With ski season almost upon us, it's exciting to see the Santiam Pass Ski Lodge coming back to life thanks to support from the @OrCulturalTrust . This is just one of their many projects across the state, from tribal memorials to children's theaters. Restoring Oregon's Historic Santiam Pass Ski Lodge - My Oregon News Restoration of the Santiam Pass Ski Lodge is funded by the Oregon Cultural Trust, and is one of 89 awards receiving more than $2.7 million in funding. myoregon.gov", "2019-11-07T17:13:21.000Z": "More than 11,000 scientists are trying to convince the world that climate change is real, saying they have a \"moral obligation to tell it like it is.\" \n\nOur children protest in the streets begging us to fight climate change. Think it's time we all listen. 11,000 scientists warn of 'untold suffering' caused by climate change How many scientists does it take to convince the world to take climate change seriously? cnn.com", "2019-11-07T03:06:22.000Z": "More beautiful, local art is coming to the Governor's Office. Darren Orange's \"Those who step into the same rivers\" will be up starting November 21 - if you find yourself at the Capitol, stop by! Darren Orange's \"Those who step into the same rivers\" to be Exhibited in Governor's Office Astoria artist Darren Orange will exhibit \"Those Who Step Into The Same Rivers\" in the Governor's Office from Nov. 14 to Jan. 21. myoregon.gov", "2019-11-06T21:22:31.000Z": "Mr. Keum, CEO of Hae Seong Co. remembers traveling to Oregon over 15 years ago and meeting with @PacificSeafood that eventually led to Pacific pink shrimp being used for their very popular shrimp chips. #yummyfood  #WhatWeDo  #WednesdayThoughts  #agriculture  #relationships  #korea", "2019-11-06T23:47:23.000Z": "Incredibly proud of our Oregon firefighters who were able to step up and help Californians during their time of need. \n\nBut climate change has put more communities at risk than ever before - and will continue to do so until we take real action. Oregon comes to California's aid in fighting hotter fires: 'When help is needed, help will come' As California's fire season grows longer and hotter, more and more out-of-state firefighters - and sometimes out-of-country firefighters - head West. usatoday.com", "2019-11-06T21:18:12.000Z": "Great conversation with Yoo Myung-hee, the Minister of Trade for South Korea. Oregon's 4th-largest export market is South Korea, with $1.7 billion in goods last year - including wheat and semiconductor equipment, which are big Oregon exports to the region.", "2019-11-06T20:39:11.000Z": "1/Asia trade mission in full swing with @OregonGovBrown In Seoul, we met w/ the Korean Forest Service, who purchased 2 Oregon-crafted @EricksonInc firefighting helicopters last year(~$24M each), and considering more after their strong performance in fighting fires this year", "2019-11-05T18:03:58.000Z": "The federal government is walking away from the #ParisAgreement , leaving us to stand alone while every other country in the world moves forward in meeting the challenges of climate change. \n\nState action is more important than ever, and I'm proud Oregon will continue to lead. Quote Tweet US Climate Alliance @USClimate U.S. Governors representing more than half the U.S. population oppose today's action to withdraw from the #ParisAgreement . Read more http:// bit.ly/ParisWithdrawal  #GovsOnClimate", "2019-11-04T21:58:44.000Z": "We have a collective responsibility to protect the future for coming generations. In Oregon, we won't stand by as the federal government fails to act on global climate change. We're committed to doing our part to help tackle this challenge. Trump makes it official: U.S. will withdraw from the Paris climate accord \"It's a sad reminder of where the world's former leader on climate change now stands,\" one critic said. washingtonpost.com", "2019-11-04T18:53:36.000Z": "Thank you, firefighters and @OSFM . Quote Tweet Oregon OSFM @OSFM Nine of the 10 strike teams mobilized by the OSFM to the #KincadeFire in Sonoma County are being demobilized today after serving communities and people in need in California. Thank you and safe journeys to all who contributed to the nearly week-long deployment.", "2019-11-04T02:09:15.000Z": "Gert Boyle inspired us all to overcome great obstacles, and to achieve great things. She was tough, and she was brave. She put her heart on a plate and she had a wicked tongue. Gert was one of a kind, and we will miss her. Gert Boyle, 'One Tough Mother' who led Columbia Sportswear, dies at 95 Boyle inspired the 1984 ad campaign \"One Tough Mother,\" a catch phrase that also graces her 2005 autobiography. oregonlive.com", "2019-11-01T19:00:16.000Z": "Rogue River Blue has taken the top prize at the 2019 World Cheese Awards, marking the first time a US cheese has ever been named World Champion Cheese. For the first time ever, a US cheese is named best in the world Forget the American love affair with Cheez Whiz, blocks of Velveeta and pasteurized processed cheese food slices. An organic blue cheese from Oregon has been named the world's top cheese. cnn.com", "2019-11-01T18:05:07.000Z": "#OpenEnrollment is here, and helping Oregonians like Stephanie and her husband, who own a small business. Since leaving the corporate world, they needed to find their own health care solutions. http:// OregonHealthCare.gov helped them buy their own insurance. Health Insurance for the Do-it-Yourselfer Starts at OregonHealthCare.gov Nov. 1 through Dec. 15 is open enrollment for people who buy their own health insurance. Anyone can sign up for coverage and apply for the subsidies. myoregon.gov", "2019-11-01T03:01:41.000Z": "Lots of little ghosts, goblins and witches roaming the streets of Salem tonight. Great to see so many smiling mini Oregonians having a fun night. #HappyHalloween", "2019-10-31T18:37:28.000Z": "All Oregonians should have quality, affordable health care, regardless of who they are or where they live. I applaud this lawsuit filed in the U.S. District Court in Oregon by advocacy groups to stop the Trump admin's health care ban for immigrants. Immigration advocates are suing Trump administration in federal court The lawsuit seeks to halt the administration's health care ban for immigrants. bizjournals.com", "2019-10-31T17:34:13.000Z": "In the spirit of #Halloween , @OregonDEQ asked recycling processors to snap a few pics of the scary stuff they see at their facilities. Yikes! Good reminder that we can all help protect the environment by reducing waste and recycling right. Scary Stuff at Oregon's Recycling Processing Center - My Oregon News When people put items that don't belong in recycling bins, it can cause problems all along the recycling journey. Recycle responsibly. myoregon.gov", "2019-10-30T21:06:27.000Z": "Health care is a human right. Putting the American Dream beyond the reach of immigrant families, except for those with the means to buy their own health insurance, goes against everything we stand for as a nation where all people are created equal. Governor Brown and Attorney General Rosenblum on Trump Administration's Health Insurance Requirem... A new lawsuit is trying to stop the Trump Administration's proclamation to create new, wealth-based health insurance requirements for immigrants. myoregon.gov"}