{"2020-07-15T19:41:18.000Z": "During the past week, we have seen an unsettling climb in new #COVID19 cases. #COVID19 cases peaked in Pennsylvania on April 9 with nearly 2,000 new cases.\n\nIf we don't act now, medical experts are projecting that this new surge in cases could soon eclipse the peak in April.", "2020-07-30T13:03:36.000Z": "Eid Mubarak to all Pennsylvanians celebrating #EidAlAdha .", "2020-07-30T19:18:50.000Z": "Reminder: Under the orders @SecretaryLevine and I signed on July 15, telework is mandated in Pennsylvania unless it is not possible.", "2020-07-30T17:09:09.000Z": "Today, @GovernorTomWolf visited the Millersville location of @lancaster_ems to thank first responders and to learn about how they are adapting their critical work during the state's response to the COVID-19 pandemic. Gov. Wolf Visits Lancaster EMS to Thank Emergency Responders Gov. Wolf visited Lancaster EMS to thank first responders and learn about how they're adapting their critical work during COVID-19. governor.pa.gov", "2020-07-30T17:22:23.000Z": "Today I'm at Lancaster EMS in Millersville to thank and support these frontline workers who come into our homes to care for us in the most difficult times - including during the #COVID19 pandemic.\n\nThey courageously put themselves in danger to keep the rest of us safe.", "2020-07-29T12:00:01.000Z": "Masks are required in public spaces in Pennsylvania.\n \nWe can get #COVID19 under control if we collectively take it seriously. Wear masks, social distance, and stop the spread. #MaskUpPA", "2020-07-30T15:35:44.000Z": "There are no words that adequately describe my disdain for the antics Rep. Diamond displayed in his latest missive.\n\nI am calling on Republican House leadership to introduce a resolution to censure the representative immediately.", "2020-07-28T16:24:13.000Z": "Wolf challenges Congress to do better on unemployment assistance as initial $600 weekly supplements expire Wolf challenges Congress to do better on unemployment assistance as initial $600 weekly supplements... Some level of aid is expected in the next economic rescue bill. pennlive.com", "2020-07-30T12:00:00.000Z": "Wearing a mask keeps #COVID19 droplets out of the air, and adds a layer of protection for the wearer, as well.\n \nMasks are required in public in Pennsylvania to reduce the risk of COVID transmission. Together we can stop this virus. GIF", "2020-07-24T18:45:00.000Z": "With the Federal CARES Act Programs + State Extended Benefits, understanding which program you should apply for can seem daunting. \n\nOur #Unemployment Compensation Program Progression Guide can help you identify which program is for you! Download here  https:// uc.pa.gov/unemployment-b enefits/UCGuide/Documents/PA_UC_Program_Progression.pdf ", "2020-07-18T15:36:17.000Z": "JUST IN: Governor Tom Wolf voiced his support for the RESTAURANTS Act of 2020, a federal bill that if made into law would provide billions in funds to independently-owned restaurants affected by the Coronavirus pandemic. 'They Need Federal Help': Gov. Wolf Supports RESTAURANTS Act, A Congressional Bill That Would... Governor Tom Wolf voiced his support for the RESTAURANTS Act of 2020, a bill that if made into law would provide billions in funds to independently-owned restaurants nationwide. pittsburgh.cbslocal.com", "2020-07-28T18:15:44.000Z": "I feel that I must personally respond to the multiple incidents of #LGBTQ harassment and specifically transphobia directed at me. \n\nYour actions perpetuate a spirit of intolerance and discrimination against LGBTQ individuals and specifically transgender individuals.", "2020-07-28T18:55:46.000Z": "The anti-Semitic meme shared by Philadelphia NAACP president Minister Rodney Muhammad is vile.\n\nSharing this type of racist content is unacceptable-especially from a civic leader.\n\nI'm joining the call for Minister Muhammad to resign. Hate has no place in Pennsylvania.", "2020-07-27T12:00:00.000Z": "Pennsylvania voters can now sign up to vote by mail ballot in the November 3 general election. Sign up today at http:// VotesPA.com/ApplyMailBallot .", "2020-07-28T16:00:01.000Z": "Why wear a mask? Protect others from #COVID19 if you're carrying it Protect yourself from #COVID19 air particles/droplets Save lives by slowing the spread Keep the economy open by preventing a cluster of cases Show neighbors you care about their health #MaskUpPA", "2020-07-28T14:53:43.000Z": "PA CareerLink offers a variety of online services, such as: job search assistance, job training programs to build skills, and live practice for an interview - including virtual interviews which are new to most of us. \n \nVisit http:// pacareerlink.pa.gov for more.", "2020-07-28T14:53:42.000Z": "Today, I visited PA CareerLink York County to discuss the importance of free programs to get people back on their feet as we battle #COVID19 across the country.", "2020-07-27T17:51:58.000Z": "It's time your voice wasn't drowned out by deep-pocketed special interests. \n\nIt's time to restore your faith that government works for you, not the other way around. \n\nWe're ready to make it happen. #PeopleFirst House Democrats working for more government transparency HARRISBURG, July 27 - House Democratic Leader Frank Dermody, Democratic Whip Jordan Harris and Democratic Appropriations Chairman Matt Bradford welcomed the decision by Gov. Tom Wolf to let... pahouse.com", "2020-07-28T12:00:01.000Z": "Assistance is available for homeowners and renters struggling to make monthly payments due to the COVID-19 pandemic. Apply today at http:// phfa.org/pacares .", "2020-07-27T21:20:57.000Z": "I'm still worried HB 2463 will needlessly put state employees in possible danger.\n\nSome members of the legislature have repeatedly said they don't take #COVID19 seriously.\n\nThey've rallied the fringes of their movement, endangering PA'ians for the approval of President Trump.", "2020-07-27T21:20:56.000Z": "Because this legislation is so poorly drafted, I also want to state my understanding:\n\n1) This legislation simply clarifies that data and models related to a disaster declaration are public records-so long as those records are not exempt from release under the existing RTK Law.", "2020-07-27T21:20:55.000Z": "Yesterday I allowed HB 2463 to become law without my signature.\n\nFrom the start, my administration has had deep concerns with HB 2463-which forces commonwealth employees to physically come to an office to process records requests under dangerous conditions.", "2020-07-27T19:54:00.000Z": "Pediatricians with @AmerAcadPeds and a child advocacy organization weigh in on the importance of wearing masks for all, including children older than two, and echo the @GovernorTomWolf Administration mask-wearing requirement to stop the spread of COVID-19. Pediatricians, Child Advocacy Groups Echo Mask-Wearing for Children Pediatricians with the American Academy of Pediatrics and a child advocacy organization weigh in on the importance of children wearing masks. governor.pa.gov", "2020-07-27T18:00:01.000Z": "Essential workers have put themselves at risk every day during the pandemic and deserve our support.\n\nJuly 31 is the deadline for employers to apply for hazard pay grants. More information: http:// on.pa.gov/32OQ9VS Pennsylvania's governor is granting hazard pay to workers in hospitals, grocery stores and other... During the coronavirus pandemic, essential workers have been putting their lives at risk to keep our hospitals, grocery stores and public transportation running. So Pennsylvania is providing a bit of... cnn.com", "2020-07-27T13:41:35.000Z": "FUNDING: The 2nd application window for the #COVID19 small business grant prgm will be opening in August. See what application items you will need: https:// pabusinessgrants.com  Photo ID Business Financial Info Proof of Business Registration Bank Account Info", "2020-07-27T14:00:01.000Z": "PA manufacturers: Are you able to produce critical medical supplies? We could use your help to stop #COVID19 .\n \nLearn more on the Manufacturing Call to Action Portal Manufacturing Call to Action Portal If you are a current manufacturer of supplies and products or can pivot your existing manufacturing capabilities to meet the necessary demand, we would like to hear from you. dced.pa.gov", "2020-07-27T12:00:01.000Z": "I signed an executive order to create a Citizen Advisory Commission to improve state law enforcement.\n \nMy administration is committed to bipartisan criminal justice reforms that are fair, inclusive, and support public safety.", "2020-07-26T13:00:00.000Z": "The November 3 general election is just 100 days away. Are you registered to vote?\n\nYou may register to vote if you're: U.S. citizen PA resident +18 on Election Day\n\nRegister today at http:// register.votesPA.com .", "2020-07-25T13:00:00.000Z": "Simple precautions can protect your health and the health of others during #COVID19 .\n \nHere is the latest guidance.", "2020-07-24T20:30:00.000Z": "Heading out this weekend? Don't forget your mask.\n\nMasks are the most simple and effective way to protect yourself and others - and they're mandatory in all public spaces. #MaskUpPA", "2020-07-24T19:00:00.000Z": "Gov. Wolf signs bill establishing mental welless, stress management program for first responders;... HARRISBURG >> Governor Tom Wolf signed several bills into law on July 23 including HB 1459, which establishes a mental wellness and stress management program for emergency responders who experience buckslocalnews.com", "2020-07-24T17:48:04.000Z": "Today I'm at Lancaster Health Center to thank staff and give an update on #COVID19 testing and contact tracing.\n \nPlease get tested if you have symptoms or have been exposed to someone with the virus. \n\nFind a testing location on @PAHealthDept 's website: http:// on.pa.gov/testing .", "2020-07-24T15:00:01.000Z": "Police officers shouldn't be able to escape accountability for past actions by switching departments.\n \nThat's why I signed legislation that will require all law enforcement officers to reveal previous employment records when they apply for a new job. Pennsylvania law now requires officers applying for new jobs to submit previous employment records Pennsylvania Gov. Tom Wolf signed a pair of police reforms bills into law on Tuesday, including background checks requiring officers seeking new positions to reveal previous employment records. cnn.com", "2020-07-24T12:55:57.000Z": "Report illegal eviction: http:// on.pa.gov/AGcomplaint  Financial resources: http:// on.pa.gov/2Jb8UYp", "2020-07-24T12:55:56.000Z": "The Federal Pandemic Unemployment Compensation (FPUC) Program ends tomorrow.\n \nState assistance is still available for those who have been relying on this additional $600 federal unemployment benefit: Medicaid: https:// on.pa.gov/2WQrpZA  CHIP: https:// on.pa.gov/2Cx42xm", "2020-07-24T11:00:00.000Z": "Now, more than ever, we need to take care of our minimum-wage earners.\n\nMany of them are our friends and family who put their lives at risk to sustain essential services through the COVID-19 pandemic - earning $7.25 an hour.\n\nIt's time for the legislature to #RaiseTheWage in PA.", "2020-07-24T01:11:52.000Z": "Today is #OpeningDay . Wishing best of luck to the @Phillies and @Pirates this season. #RingTheBell  #LetsGoBucs", "2020-07-23T19:37:34.000Z": "Reminder: New #COVID19 dining restrictions took effect last week. Here's what you need to know What you need to know about Pennsylvania's new coronavirus rules for bars and restaurants Pennsylvania Gov. Tom Wolf and Secretary of Health Dr. Rachel Levine have issued new restrictions on bars, restaurants, events, gatherings and gyms to mitigate the spread of coronavirus. Here is what... mcall.com", "2020-07-23T16:01:15.000Z": "#COVID19 cases are on the rise. Here are three major causes, according to health experts:\n \n❶ Some Pennsylvanians have ignored mask-wearing requirements and social distancing when visiting Pennsylvania bars and restaurants. There, they are spreading and picking up the virus.", "2020-07-23T14:00:00.000Z": "I've extended protections from foreclosures and evictions through August 31 to provide PA homeowners and renters time to apply for COVID-19 pandemic relief through @PHFAtweets . Apply for mortgage or rental assistance today at http:// phfa.org/pacares/ . What to know about the Pennsylvania rental assistance program Here are the details of the new Pennsylvania rental assistance program for residents impacted by the coronavirus pandemic. ydr.com", "2020-07-23T12:00:01.000Z": "Five minutes is all it takes to sign up to vote by mail ballot in the November 3 general election. Registered voters can sign up today at http:// VotesPA.com/ApplyMailBallot .", "2020-07-22T20:09:17.000Z": "I want to talk about the transphobic incident involving the Bloomsburg Fair.\n\nThis is the latest in a relentless series of vile slurs directed at Secretary of Health Dr. Rachel Levine - a highly skilled and accomplished member of my administration.", "2020-07-22T19:44:31.000Z": "Scientific research shows: Masks help stop the spread of #COVID19 . Policies requiring masks can significantly slow community transmission. #MaskUpPA Why you should wear a mask to fight Covid-19, explained by several new studies It's true the evidence for masks was weak before. That's changed. vox.com", "2020-07-22T18:35:00.000Z": "ICYMI: Claimants who exhaust their regular UC + PEUC may now qualify for 13 additional weeks of payments through the state's UC Extended Benefits program. Eligible claimants will receive a letter in the mail. There is no application process. More: https:// uc.pa.gov/unemployment-b enefits/Pages/State-Extended-Benefits-(EB).aspx  GIF", "2020-07-22T14:00:00.000Z": "Are you a PA business owner looking for personal protective equipment (PPE) for your company? Check out the B2B interchange Directory, where you can connect with PPE manufacturers to help you get what you need. COVID-19 PPE & Supplies Interchange Directory Pennsylvania COVID-19 PPE & Supplies Business-2-Business (B2B) Interchange Directory Company and product information provided in this directory were dced.pa.gov", "2020-07-22T12:00:01.000Z": "Mask-wearing is essential to stopping the recent increase in #COVID19 cases in Pennsylvania. \n\nLearn more about what @GovernorTomWolf is doing to stop the spread: http:// bit.ly/3fytroo  #MaskUpPA", "2020-07-22T12:00:02.000Z": "I recently signed the first two pieces of legislation tied to my law enforcement reform executive order.\n \nThese actions requiring officers to undergo pre-employment background checks and mental health evaluations are just a start toward a fairer and better system for everyone.", "2020-07-21T20:21:34.000Z": "Thank you to all the Pennsylvanians who are masking up.\n\nWe know masks are a critical tool in fighting the spread of #COVID19 - and we need as many people as possible to wear them when leaving home. #MaskUpPA A Detailed Map of Who Is Wearing Masks in the U.S. The patterns from hundreds of thousands of survey respondents reflect partisanship, peer pressure and the footprint of the coronavirus itself. nytimes.com", "2020-07-21T17:30:52.000Z": "Masks are required in all public places in Pennsylvania. \n\nLearn more Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-07-21T17:30:51.000Z": "Today I'm joining health experts from @WellSpan York to remind Pennsylvanians of the science behind mask wearing to prevent the spread of #COVID19 .\n\nI want to thank all health professionals at WellSpan and across our commonwealth for their tireless work during this pandemic.", "2020-07-17T14:36:49.000Z": "Three former Pa. governors voice support for Gov. Tom Wolf's COVID-19 mitigation efforts Three former Pa. governors voice support for Gov. Tom Wolf's COVID-19 mitigation efforts While some lawmakers have taken issue with how Gov. Wolf is handling the response to the pandemic, three former Govs. Mark Schweiker, Tom Ridge, and Ed Rendell voiced their support by endorsing his... pennlive.com", "2020-07-21T12:00:01.000Z": "I continue to work with health experts to update #COVID19 safety guidance.\n \nThese current restrictions are designed to keep Pennsylvanians safe at this moment, when we are seeing an unfortunate uptick in illnesses.\n \nMore: http:// governor.pa.gov/plan-for-pennsylvania  .", "2020-07-20T18:00:01.000Z": "If you have been in close contact with someone with #COVID19 , you may receive a call to inform you that you've been exposed and ask you to stay at home and self-quarantine. Answer the call to slow the spread. \n\nLearn more about contact tracing: https:// bit.ly/PAContactTraci ng ", "2020-07-20T19:31:52.000Z": "#MaskUpPA", "2020-07-15T17:00:00.000Z": "Reminder: The Federal Pandemic Unemployment Compensation program ends on July 25.\n \nFor more info on financial programs visit http:// uc.pa.gov", "2020-07-16T18:46:54.000Z": "Using federal CARES Act money, Wolf said at a press conference government wants to \"say thank you to the people who have been at the heart of our ability to make it through this pandemic.\" Pennsylvania announces coronavirus 'hazard pay' program of $3 an hour for front-line workers making... Front-line workers who face risk from coronavirus at work are eligible for additional \"hazard pay\" of $3 an hour under a federally funded $50 million program announced by Gov. Tom Wolf on Thursday. mcall.com", "2020-07-20T12:00:01.000Z": "The pandemic is not over yet, but it is possible to keep our businesses open and keep ourselves safe", "2020-07-19T13:00:00.000Z": "Mental health resources are available for Pennsylvanians.  @CrisisTextLine : Text 'PA' to 741741  @distressline : 800-985-5990 PA's support helpline: 855-284-2494 Coping with #COVID19 stress: http:// bit.ly/covid-coping  COVID-19 resources: http:// mhnational.org/covid19", "2020-07-18T13:00:00.000Z": "More states - including Pennsylvania - are requiring face masks in public to protect people from #COVID19 . More Than 20 U.S. States Now Require Face Masks In Public An alarming surge in coronavirus cases is forcing more states to require face coverings. Two of the worst-hit states - Florida and Arizona - still don't have statewide mandates. npr.org", "2020-07-17T19:03:21.000Z": "Learn more about the latest #COVID19 updates in Pennsylvania: New #COVID19 restrictions Mask-wearing requirement Guidance on travel and quarantine Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-07-17T16:00:00.000Z": "We're now hiring community health nurses. Join Pennsylvania's growing contact tracing program to help save lives by interrupting the spread of COVID-19.\n \nRegistered nurses may apply today  http:// on.pa.gov/ApplyContactTr acing  .", "2020-07-17T14:12:06.000Z": "My administration is committed to bipartisan criminal justice reforms that are fair and inclusive and support public safety.\n\nThis executive order moves us one more step forward to address the systemic failings that have created inequities and public mistrust of law enforcement. Quote Tweet Office of the Governor @GovernorsOffice Today, @GovernorTomWolf signed an executive order creating the Pennsylvania State Law Enforcement Citizen Advisory Commission to further advance law enforcement reform and accountability in the commonwealth. https:// on.pa.gov/3haas41 Show this thread", "2020-07-17T13:48:24.000Z": "Three former Pennsylvania governors today voiced their support for how @GovernorTomWolf and his administration have responded to the COVID-19 pandemic, including endorsing statewide mitigation efforts and mask-wearing Former Pennsylvania Governors Voice Support for Wolf Administration Response to COVID-19 Three former Pennsylvania governors today voiced their support for how Governor Tom Wolf and his administration have responded to the COVID-19 pandemic, including endorsing statewide mitigation... governor.pa.gov", "2020-07-15T05:21:05.000Z": "Pennsylvania Gov. Tom Wolf has signed a pair of police reforms bills into law, including background checks requiring officers seeking new positions to reveal previous employment records Pennsylvania law now requires officers applying for new jobs to submit previous employment records Pennsylvania Gov. Tom Wolf signed a pair of police reforms bills into law on Tuesday, including background checks requiring officers seeking new positions to reveal previous employment records. cnn.com", "2020-07-16T19:00:42.000Z": "JUST ANNOUNCED: $50M is now available for those front-line workers that face the risk of #COVID19 while they are at work. The PA Hazard Pay Grant prgm will give an additional $3/hour as hazard pay to eligible employees who earn less than $20/hour. Pennsylvania announces coronavirus 'hazard pay' program of $3 an hour for front-line workers making... Front-line workers who face risk from coronavirus at work are eligible for additional \"hazard pay\" of $3 an hour under a federally funded $50 million program announced by Gov. Tom Wolf on Thursday. mcall.com", "2020-07-16T19:50:49.000Z": "Yesterday I announced new statewide #COVID19 restrictions in response to a troubling rise in cases.\n\nThis may feel like a step back, but it isn't. It's a stern reminder that we need to get back on track with mask-wearing, social distancing, and successfully mitigating #COVID19 .", "2020-07-16T18:08:24.000Z": "Today, @GovernorTomWolf announced the availability of $50 million in grant funding to help employers provide hazard pay to employees in life-sustaining occupations during the COVID-19 pandemic. Wolf Administration: Hazard Pay Grants Now Available for Front-Line Workers in Life-Sustaining... Governor Tom Wolf announced the availability of $50 million in grant funding to help employers provide hazard pay to employees in life-sustaining occupations during the COVID-19 pandemic. Hazard pay... governor.pa.gov", "2020-07-16T18:20:43.000Z": "This hazard pay will help employees offset costs related to through #COVID19 . This includes buying masks, alternative forms of transportation, and finding child care.\n \nIt also serves as a well-deserved thank you to those who were sometimes taken for granted before #COVID19 .", "2020-07-16T18:20:42.000Z": "Throughout this pandemic, PA'ians from across the commonwealth have put their lives on the line to help protect and serve their communities.\n \nToday, we're supporting them by allocating $50 million in CARES Act funding to provide hazard pay to these heroes.", "2020-07-16T13:35:04.000Z": "\"Wearing a mask is a sign that you care about the people around you.\"- Health Commissioner @DrTomFarley . #MaskUpPHL", "2020-07-16T16:27:42.000Z": "Social distancing, masking, and other safety measures must be in place to protect workers and patrons. Occupancy is limited to 25% for indoor dining, including staff.", "2020-07-16T16:27:41.000Z": "NOW IN EFFECT: New statewide COVID-19 restrictions for bars and restaurants in Pennsylvania.\n\nThread", "2020-07-16T14:00:01.000Z": "Are you wearing your mask properly? wash hands before putting it on be sure it covers nose + mouth be sure you can breathe easily wash hands after removing wash mask or dispose of after each use #MaskUpPA  #COVIDStopsWithMe", "2020-07-10T20:00:45.000Z": "Wearing masks respects and supports businesses, Gov. Wolf says Wearing masks respects and supports businesses, Gov. Wolf says HARRISBURG, Pa. (WHTM) - Governor Tom Wolf and several other officials say that wearing a mask not only helps keep people safe but shows respect for local businesses and their employees. Wolf abc27.com", "2020-07-16T12:37:07.000Z": "In June, I took executive action to begin rolling out law enforcement reforms in PA.\n \nThis week, I signed the first two bills tied to this effort. These new measures will ensure all law enforcement officers have pre-employment background checks and mental health evaluations.", "2020-07-15T21:02:15.000Z": ". @GovernorTomWolf and @PAHealthDept today signed new orders for targeted mitigation efforts in response to the recent rise in COVID cases, detailing the decision for statewide mitigation efforts for bars and restaurants, gatherings and telework. Wolf Administration Announces Targeted Mitigation Efforts in Response to Recent COVID Case Increases Governor Tom Wolf and Sec. of Health Dr. Rachel Levine today signed new orders for targeted mitigation efforts in response to the recent rise in COVID cases, primarily in southwest Pennsylvania, but... governor.pa.gov", "2020-07-15T19:41:19.000Z": "More information about #COVID19 restrictions Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-07-15T18:30:00.000Z": "Today at 3:30 PM, @GovernorTomWolf and @PAHealthDept will provide an update on COVID-19 and outline steps to mitigate the spread of the virus in Pennsylvania. Watch live at http:// governor.pa.gov/live . Pennsylvania Governor's Office LIVE Watch the live stream from the Office of the Governor. governor.pa.gov", "2020-07-15T01:00:01.000Z": "POLICE REFORM BILLS: \"Today Pennsylvania becomes one of the only states in our country to change our laws in the wake of George Floyd's murder,\" Attorney General Josh Shapiro said. Gov. Wolf Signs First George Floyd-Inspired Bills Into Law In Pennsylvania The first bills passed by Pennsylvania's Legislature in response to the killing of George Floyd in Minnesota are now law with Gov. Tom Wolf's signature. pittsburgh.cbslocal.com", "2020-07-15T15:01:10.000Z": "Today, @GovernorTomWolf announced that the CANPACK Group, will redevelop a former brownfield in Lackawanna County, establishing an aluminum can manufacturing facility and Center of Excellence, creating over 400 new good-paying jobs for Pennsylvanians. Wolf Administration: Poland-Based Manufacturer to Establish Aluminum Can Manufacturing Facility and... Governor Tom Wolf announced that the CANPACK Group, a leading international manufacturer of aluminum and steel cans and glass bottles for the food and beverage sector and a subsidiary of Pennsylvan... governor.pa.gov", "2020-07-15T14:07:58.000Z": "Use @PAHealthDept 's early warning dashboard to track #COVID19 increases in your county.\n \nTaking action early when we see an uptick can prevent further spread of this deadly virus. COVID-19 Early Warning Monitoring System Dashboard COVID-19 Early Warning Monitoring System Dashboard health.pa.gov", "2020-07-10T20:30:00.000Z": "Gov. Tom Wolf announced nearly $19 million will go towards mitigating the pandemic's impact on those who are homeless and preventing others from losing their homes. Gov. Wolf Announces $19M In Funding To Lessen Pandemic's Impact On Homelessness Gov. Tom Wolf announced $19 million in funding will go towards mitigating the pandemic's impact on the homeless and preventing others from losing their homes. pittsburgh.cbslocal.com", "2020-07-14T15:00:00.000Z": "FYI PA drivers: Don't forget that the process for renewing your driver's license photo looks a little different now.\n \nFor more info and to renew visit http:// dmv.pa.gov .", "2020-07-14T20:03:44.000Z": "Masks are required in all public spaces in Pennsylvania.\n\nIf you don't want to wear a mask for yourself, wear it for your family, your friends, and your neighbors. #MaskUpPA", "2020-07-10T00:40:00.000Z": "Wolf announces $10M to support smaller food retailers @Backover2u reports. #Pennsylvania  #AllentownPA Wolf announces $10M to support smaller food retailers To be eligible, more than 50 percent of sales must be from staple and perishable foods, and the store must serve customers that live in a low-to moderate income area. wfmz.com", "2020-07-14T14:21:05.000Z": "It's official!!!!! @GovernorTomWolf has signed our critical #PoliceReform bills into law. This is not the end but just the beginning #BlackLivesMatter  #JusticeForAll  @PaHouseDems  @PaSenateDems", "2020-07-14T14:00:46.000Z": "Today I'm signing HB 1841 and HB 1910, which require law enforcement officers to have: Pre-employment background checks Mental health evaluations\n \nThis is one step toward improving law enforcement to make Pennsylvania safe for everyone.", "2020-07-14T13:10:04.000Z": "Today at 9:30 AM, @GovernorTomWolf will sign two law enforcement reform bills HB 1841 and HB 1910, which require pre-employment background checks and mental health evaluations for law enforcement officers. Watch live at http:// governor.pa.gov/live . Pennsylvania Governor's Office LIVE Watch the live stream from the Office of the Governor. governor.pa.gov", "2020-07-13T15:03:01.000Z": "Reminder: free, nutritious meals for kids are available across Pennsylvania this summer via the @USDANutrition 's Summer Food Service Program.\n\nHere's how to find a meal site in your community Summer Food Service Program The Summer Food Service Program ensures children continue to have access to nutritious meals when school is not in session. education.pa.gov", "2020-07-13T19:00:00.000Z": "Here's how you can do your part: Wear a mask when leaving home Stay 6 feet away from others not in your household Wash your hands frequently", "2020-07-13T17:00:00.000Z": "More Research Points to Importance of Masks, Mandatory Mask-Wearing Order Remains in Effect -... HARRISBURG, PA - The Wolf Administration is highlighting recent research studies that further point to the importance of wearing masks to stop the spread of COVID-19. \"The recent uptick in  mychesco.com", "2020-07-13T14:35:40.000Z": "The deadline to file 2019 personal income tax returns is Wednesday, July 15. \n\nRead more: https:// media.pa.gov/Pages/Revenue- Details.aspx?newsid=321   Tax info: http:// revenue.pa.gov/PIT  File: https:// padirectfile.state.pa.us  Phone assistance: 717-787-8201 (Weekdays, 8 a-5p) Online help: http:// revenue.pa.gov/help", "2020-07-13T15:30:00.000Z": "Last week PA started the Extended Benefits prgrm. Eligible claimants will receive a letter in the mail. There is no application process.\n\nThe Extended Benefits prgrm provides up to additional weeks for people who exhaust regular UC + PEUC\n\nMore: https:// uc.pa.gov/unemployment-b enefits/Pages/State-Extended-Benefits-(EB).aspx ", "2020-07-13T14:00:00.000Z": "Experiencing #COVID19 symptoms? Find a testing site near you. COVID-19 Symptoms and Testing How to spot COVID-19 symptoms and what to do if you have them. health.pa.gov", "2020-07-13T12:40:39.000Z": "The first application window for the new #COVID19 relief small business grant will be closing tomorrow, July 14. If you have 25 full-time employees or less & have $1M in revenue or less prior to COVID-19, your small business may be eligible. Learn more: https:// pabusinessgrants.com Quote Tweet Governor Tom Wolf @GovernorTomWolf PA Business owners: @PADCEDNews is now accepting applications for the #COVID19 Relief Pennsylvania Statewide Small Business Assistance program.\n \nThis first application window is open until 11:59 PM on July 14th.\n \nFor details visit http:// pabusinessgrants.com .", "2020-07-13T12:00:01.000Z": "We're all still getting used to wearing masks during the #COVID19 pandemic.\n \nHere's how to keep them the most effective.  #PAProud", "2020-07-12T13:00:01.000Z": "Couldn't be more proud of all the Pennsylvanians helping their neighbors during #COVID19 . A volunteer 'sewing squad' distributed more than 55,000 masks to vulnerable communities in 3... Kristina Wong is an actress and comedian known for her one-women shows. But she traded the stage for a sewing machine and formed a team of volunteers to make masks kmov.com", "2020-07-11T13:00:00.000Z": "Protect yourself, your family, your friends, and people in your community from #COVID19 with these simple actions.", "2020-07-09T18:10:00.000Z": "The Wolf administration is reminding Pennsylvanians to wear masks while enjoying the outdoors when they are not able to consistently maintain social distancing from individuals who are not members of their household. Wolf Administration Reminds Residents to Wear Mask While Enjoying Outdoor Activities Masks are required outdoors if proper social distancing from individuals of the same household cannot be maintained. erienewsnow.com", "2020-07-10T17:51:44.000Z": "#MaskUpPA Quote Tweet Fast Company @FastCompany Researchers find that wearing masks can help avoid devastating economic shutdowns. http:// f-st.co/EQX7ICQ", "2020-07-09T16:30:07.000Z": "Governor Tom Wolf signed a new executive order that protects some homeowners and renters from eviction or foreclosure until August 31. Gov. Wolf extends protections from foreclosures and evictions for some through August 31 Governor Tom Wolf signed a new executive order that protects some homeowners and renters from eviction or foreclosure until August 31. fox43.com", "2020-07-10T16:00:01.000Z": "PA Business owners: @PADCEDNews is now accepting applications for the #COVID19 Relief Pennsylvania Statewide Small Business Assistance program.\n \nThis first application window is open until 11:59 PM on July 14th.\n \nFor details visit http:// pabusinessgrants.com .", "2020-07-10T13:03:12.000Z": "101 days until the October 19, 2020, voter registration deadline. Time flies, so don't wait to register to vote: http:// register.votesPA.com  #votesPA  #ReadyToVotePA  #TrustedInfo2020", "2020-07-10T12:00:00.000Z": "Study after study shows that mask-wearing helps stop the spread of #COVID19 and keep the curve of cases flattened.\n\nThat's why we're requiring masks in public in Pennsylvania. It's the most simple, effective way to protect yourself and others. #MaskUpPA", "2020-07-09T18:30:56.000Z": "The @GovernorTomWolf Administration today released updated frequently asked questions about summer recreation, camps and pools. Wolf Administration Releases Updated FAQs for Summer Recreation, Camps and Pools The Wolf Administration today released updated frequently asked questions (FAQs) about summer recreation, camps and pools. The original FAQs were announced on May 22 to cover summer camps and... governor.pa.gov", "2020-07-09T17:33:16.000Z": ". @GovernorTomWolf and @DCNRnews today reminded Pennsylvanians to wear masks while enjoying the outdoors when they are not able to consistently maintain social distancing from individuals who are not members of their household. Wolf Administration Reminds Pennsylvanians to Wear Mask While Enjoying the Outdoors Governor Tom Wolf and Department of Conservation and Natural Resources Secretary Cindy Adams Dunn today reminded Pennsylvanians to wear masks while enjoying the outdoors when they are not able to... governor.pa.gov", "2020-07-09T17:00:00.000Z": "Masking is now a requirement for all Pennsylvanians when leaving home.\n \nWe're still fighting this virus and right now masking is one of the best weapons we have.\n \nMore info on #MaskUpPA requirements for individuals and businesses Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-07-08T17:31:26.000Z": "Masks are now mandatory in all public spaces in Pennsylvania, including schools.\n\nFind answers to questions like this one and more on our website: https:// education.pa.gov/Schools/safesc hools/emergencyplanning/COVID-19/Waivers/MaskWearing/Pages/default.aspx ", "2020-07-09T14:50:31.000Z": "PSP Liquor Control Enforcement Officers have been working throughout the COVID-19 pandemic to ensure licensees abide by mitigation requirements. Overwhelming majority have been in voluntary compliance. Stats from July 4 weekend are here: https:// psp.pa.gov/COVID-19/Pages/Enforcement.aspx#LCE ", "2020-07-09T15:50:50.000Z": ". @GovernorTomWolf today signed a new executive order that protects Pennsylvanians from eviction or foreclosure until Aug. 31, if they are waiting for assistance from @PHFAtweets or are not already receiving relief through another program or judicial order. Gov. Wolf Announces Protections from Foreclosures and Evictions Through Aug. 31 Governor Tom Wolf today signed a new executive order that protects homeowners and renters from eviction or foreclosure until Aug. 31, if they are waiting for assistance from a new program administe... governor.pa.gov", "2020-07-07T19:03:45.000Z": "Recognize + avoid #COVID19 UC scams\n\nWe are committed to prevent + identify fraud or fraudulent scams. We encourage PA'ians to remain vigilant + to report fraud or any potential concerns of fraud. UC Fraud: https:// uc.pa.gov/Fraud/Pages/de fault.aspx  Report Fraud: https:// uc.pa.gov/Pages/Report-F raud-Here.aspx ", "2020-07-09T15:00:00.000Z": "Mortgage and rent assistance is now available for those financially impacted by #COVID19 .\n \nFind out if you're eligible and apply at http:// phfa.org/pacares . Quote Tweet Philly Daily News @PhillyDailyNews Daily News |  You can apply for mortgage and rent assistance in Pennsylvania right now. Here's how. https:// trib.al/65v9s5n", "2020-07-09T14:11:05.000Z": "Today, I'm visiting the @BroadStMarket to announce the PA Fresh Food Financing Initiative.\n \nIt will provide $10 million in funding to support food access and help food retailing businesses impacted by #COVID19 .\n\nThose providing for underserved communities will be given priority.", "2020-07-09T13:02:08.000Z": "PA voters can now apply online to vote by mail-in ballot for the November election. Apply online: http:// votesPA.com/ApplyMailBallot If you already asked to be on the annual mail-in ballot request list, you do not need to apply again.", "2020-07-09T12:00:01.000Z": "We wear seat belts when we get in our cars to minimize injury if we get in a crash.\n \nWe wear masks during the #COVID19 pandemic to minimize the chance we get or spread the virus when coming in contact with others.\n \nMasks are mandatory in Pennsylvania for everyone's safety.", "2020-07-06T17:15:35.000Z": "On July 1, @SecretaryLevine of the @PAHealthDept signed an order stating masks must be worn whenever anyone leaves home.\n\nHere's what this means for school communities Universal Face Coverings Order Answers to questions school leaders may have regarding the application of this order in school settings. education.pa.gov", "2020-07-08T15:15:03.000Z": "Now that all of Pennsylvania's counties are in the green phase of reopening, we need to continue to keep ALL Pennsylvanians safe. If your business serves the public, you must comply with the Business Safety Guidance: http:// ow.ly/8YWp50AhAz9", "2020-07-02T20:04:36.000Z": "Pa. Gov. Wolf signs law requiring insurers to cover costly supplemental breast cancer screenings Pa. Gov. Wolf signs law requiring insurers to cover costly supplemental breast cancer screenings Gov. Tom Wolf on Wednesday signed into law legislation that will save women at high-risk of breast cancer or with dense breast tissue hundreds, if not thousands of dollars to obtain a breast MRI or... pennlive.com", "2020-07-08T13:54:22.000Z": "Are you registered to vote in the November 3 general election? Register today at http:// Register.VotesPA.com . GIF", "2020-07-08T12:00:01.000Z": "Using rideshare services to get around? Keep these safety tips in mind to stop the spread of #COVID19 .\n \nAnd don't forget your mask!", "2020-07-08T12:00:00.000Z": "Wearing a mask gives us more freedom to do the things we love without an increased risk of contracting #COVID19 .\n\nIn Pennsylvania, masks are required when leaving home. #MaskUpPA", "2020-07-07T20:00:00.000Z": "If you travel to these states, quarantine for 14 days upon return: Alabama Arizona Arkansas California Florida Georgia Idaho Louisiana Mississippi Nevada North Carolina South Carolina Tennessee Texas Utah\n\nInfo: https:// bit.ly/2YQNLvg", "2020-07-07T19:20:00.000Z": "My mask protects you. Your mask protects me.\n\nProtect others from #COVID19 by wearing a mask when you leave home. #MaskUpPA", "2020-07-07T18:20:21.000Z": "Today, state and federal officials joined @GovernorTomWolf in reminding Pennsylvanians to wear a mask to reduce the likelihood of spreading COVID-19. Legislators Join Gov. Wolf in Call for Masking State and federal officials joined Governor Tom Wolf in reminding Pennsylvanians to wear a mask to reduce the likelihood of spreading COVID-19. governor.pa.gov", "2020-07-07T17:10:29.000Z": "See all of the guidance for restaurants COVID-19 Guidance for Businesses in the Restaurant Industry Guidance for Pennsylvania businesses in the restaurant industry to ensure the safety and health of employees and the public. governor.pa.gov", "2020-07-07T17:10:28.000Z": "Restaurants (2/3): Ensure maximum occupancy limits for indoor and outdoor areas are posted and strictly enforced. Assign employee(s) to monitor and frequently clean high touch/shared areas or items. Provide non-medical masks for employees to wear at all times.", "2020-07-07T17:10:27.000Z": "Stay safe as you return to your favorite summer activities - including restaurant dining.\n \nHere is some of the guidance we have in place to reduce the spread of #COVID19 for employees and diners. Thread", "2020-07-07T11:35:04.000Z": "Are you planning on applying for the #COVID19 Small Business Assistance grant program? See what application items you will need: https:// pabusinessgrants.com  Photo ID Business Financial Info Proof of Business Registration Bank Account Info", "2020-07-07T14:00:00.000Z": "Cloth masks prevent respiratory droplets containing #COVID19 from traveling further through the air.\n \nPennsylvanians are required to wear a mask whenever they leave their homes. #MaskUpPA GIF", "2020-07-07T03:48:05.000Z": "Renters impacted by the COVID-19 pandemic can apply for relief through  the Pennsylvania Housing Finance Agency Renters impacted by the COVID-19 pandemic can apply for relief through the Pennsylvania Housing... Starting June, 20, the Pennsylvania Housing Finance Agency will be accepting applications via their website until Sept. 30. fox43.com", "2020-07-06T21:00:00.000Z": "Reminder: Masks are now mandatory in all public spaces.\n\nMask-wearing is essential to stopping the recent increase in #COVID19 cases in Pennsylvania.\n\nMore about this requirement: http:// on.pa.gov/2VFj7Dk", "2020-07-06T18:00:00.000Z": "Looking for information about #COVID19 testing in Pennsylvania? Find information about testing and where you can get a test in your community: https:// bit.ly/PACOVID19Testi ng ", "2020-07-06T19:50:39.000Z": "Today, the @GovernorTomWolf Administration highlighted recent research studies that further point to the importance of wearing masks to stop the spread of COVID-19. More Research Points to Importance of Masks, Mandatory Mask-Wearing Order Remains in Effect The Wolf Administration highlighted recent research studies that further point to the importance of wearing masks to stop the spread of COVID-19. governor.pa.gov", "2020-07-06T19:15:35.000Z": "School Nutrition Programs Temporary Assistance for Needy Families Supplemental Nutrition Assistance Program Senior Farmers' Market Nutrition Program Commodity Supplemental Food Program\n(2/2) Food Security in Pennsylvania agriculture.pa.gov", "2020-07-06T19:15:34.000Z": "If you need help getting food on the table, resources are available.\n\nCheck out our food resource guide to learn more about how you can participate in programs like: WIC Farmers' Market Nutrition Program Congregate and Home-Delivered Meals Local food banks\n(1/2)", "2020-07-06T17:26:29.000Z": ". @GovernorTomWolf visited the child care center at @psecu headquarters in Harrisburg today to announce $53 million in additional financial support for child care providers that have suffered during COVID-19. Gov. Wolf Announces $53 Million in Additional Support for Child Care Providers Governor Tom Wolf visited the child care center at PSECU headquarters in Harrisburg today to announce $53 million in additional financial support for child care providers that have suffered during... governor.pa.gov", "2020-07-06T17:15:33.000Z": "Today I'm with @PAHumanServices at @psecu headquarters in Harrisburg to announce $53 million in #COVID19 financial support for child care providers.\n \nThis funding will help bridge the gap until clientele returns and will cover increased costs that come with the pandemic.", "2020-07-06T14:00:12.000Z": "Q: When do I need to wear a mask ?\n\nA: You're required to wear a face mask when you are: outdoors + unable to consistently stay 6 feet away from those who are not members of your household in any indoor location where the public is generally permitted", "2020-07-06T14:00:01.000Z": "Reminder: @PALaborIndustry now offers an Unemployment Compensation Extended Benefits program.\n \nYou could qualify for 13 additional weeks of payments if you've exhausted your other benefits.\n \nMore information Guide: Unemployment Benefits This guide will help you navigate the process of applying for unemployment compensation and connect you with additional resources available. pa.gov", "2020-07-06T12:00:01.000Z": "Masks are now required in all public spaces in Pennsylvania.\n \nProtect other Pennsylvanians and protect yourself from respiratory droplets containing COVID-19 by masking up every time you leave home.", "2020-07-06T12:00:00.000Z": "Masks are required in public spaces. In businesses, that means no mask = no service.\n \nMask-wearing is critical to stopping the spread of #COVID19 . #MaskUpPA", "2020-07-06T11:11:25.000Z": "Leaving home? Don't forget your mask. Masks are now mandatory in all public spaces. #MaskUpPA", "2020-07-02T19:03:48.000Z": "If you have traveled, or plan to travel, to an area where there are high amounts of #COVID19 cases, it's recommended that you stay at home for 14 days upon return to Pennsylvania.", "2020-07-05T18:00:01.000Z": "Wearing a mask in public is essential to stopping the recent increase in #COVID19 cases in Pennsylvania-it's also mandatory.\n\nDo your part to slow the spread of COVID-19 in PA: wear a mask, keep your social distance + wash your hands often. #MaskUpPA  #COVIDStopsWithMe", "2020-07-01T20:19:04.000Z": "Pennsylvania makes masks mandatory in all public spaces Pennsylvania makes masks mandatory in all public spaces The new order requires masks to be worn whenever anyone leaves home and can't maintain a proper social distance from others. inquirer.com", "2020-07-05T13:00:00.000Z": "We all must do one simple thing to stop the spread of #COVID19 : Wear a mask, Pennsylvania.\n\nIn Pennsylvania, masks are mandatory in businesses and all public spaces.\n\nMore information: http:// on.pa.gov/2VFj7Dk  #MaskUpPA", "2020-07-04T16:38:45.000Z": "On this Fourth of July, @GovernorTomWolf reminded Pennsylvanians that masks are required when leaving home and that they provide more freedom to do the things we love without an increased risk of contracting COVID-19. Gov. Wolf: Wearing Masks Gives Us More Freedom On this Fourth of July, @GovernorTomWolf reminded Pennsylvanians that masks - required when leaving home - provide more freedom to do the things we love without an increased risk of contracting... governor.pa.gov", "2020-07-04T16:00:01.000Z": "Masks are now required in all public spaces in Pennsylvania. Masks protect everyone from the coronavirus - including you Face masks can block respiratory droplets from spreading to others - but experts say they also keep wearers safe. news.yahoo.com", "2020-07-04T12:15:28.000Z": "Happy #FourthOfJuly , Pennsylvania!", "2020-07-03T12:00:01.000Z": "As of today, all Pennsylvania counties are in the green phase of reopening.\n \nMasks are required in all public spaces. Please continue to take other precautions like washing your hands and avoiding large groups.\n \nTogether we can prevent spreading #COVID19 .", "2020-07-03T15:42:11.000Z": ". @GovernorTomWolf 's repeated calls to wear a mask and @SecretaryLevine 's latest order requiring masks to be worn at all times in public are resonating with local elected officials, businesses, and organizations, who today echoed the governor's directives. Local Officials, Business Owners and Organizations Echo Gov. Wolf's Call to Mask Up, PA Governor Tom Wolf's repeated calls to wear a mask and Sec. of Health Dr. Rachel Levine's latest order requiring masks to be worn at all times in public, combined with scientific proof that masks help... governor.pa.gov", "2020-07-02T12:00:01.000Z": "ICYMI: Masks are now mandatory in all public spaces in Pennsylvania. \n\nThis is essential to stopping the recent increase in #COVID19 cases in Pennsylvania.\n\nMore about the requirement: http:// bit.ly/3gilofr  #MaskUpPA", "2020-07-03T14:00:02.000Z": "Reminder: Masks are now mandatory in all public spaces in Pennsylvania.\n \nIt is essential that Pennsylvanians wear masks to prevent the spread of #COVID19 .\n \nMore about this requirement: http:// on.pa.gov/2VFj7Dk", "2020-07-02T19:01:10.000Z": "Although it's typically a time for people to gather for fun festivities, it's important for Pennsylvanians to AVOID large gatherings over the #FourthOfJuly weekend. If you do go out into public spaces, you must wear a mask. \n\nRead more: https:// bit.ly/2YQNLvg", "2020-07-02T21:01:59.000Z": "Let's do our part, #SteelersNation . #MaskUpPA", "2020-07-01T20:20:29.000Z": "Pennsylvania mandates masks for anyone who leaves their home amid coronavirus increases, via @CynthFernandez Pennsylvania mandates masks in public for most people amid coronavirus increases Health Secretary Rachel Levine said the order was necessary to prevent another statewide shutdown, though it comes with some exceptions. spotlightpa.org", "2020-07-02T16:46:44.000Z": "For more information, see @PAHealthDept  @SecretaryLevine 's order, which outlines the situations when a mask must be worn and includes limited exceptions to the face-covering requirement. Gov. Wolf: Sec. of Health Signs Expanded Mask-Wearing Order Expanding on the business safety order signed by Secretary of Health Dr. Rachel Levine in April that requires the wearing of masks in businesses, Governor Tom Wolf today announced a new order signed... governor.pa.gov", "2020-07-02T16:41:30.000Z": "The #FourthOfJuly holiday weekend is here and today we're seeing another spike in cases in Pennsylvania.\n\nThere's one simple thing we all have to do to stop the spread of #COVID19 : Wear a mask.\n\nAll Pennsylvanians are required to wear masks when outside the home. #MaskUpPA", "2020-07-02T16:00:00.000Z": "A mask isn't a political statement. #COVID19 cases are on the rise and it's critical that ALL Pennsylvanians who can wear a mask do so when leaving home.\n\nIn Pennsylvania, masks are mandatory in businesses and all public spaces. #MaskUpPA Trump now says he'll wear a mask if he's in \"close\" proximity to others President Trump said he'll wear a mask as the White House referred to the soaring number of coronavirus cases as \"embers.\" The president also repeated his claim that the virus will \"disappear.\" Ben... cbsnews.com", "2020-07-02T14:30:00.000Z": "With #COVID19 cases again on the rise across the U.S., here are some tips from experts to keep yourself and your loved ones safe.", "2020-07-02T06:07:50.000Z": "Pennsylvania makes mask-wearing mandatory in all public places throughout the state Masks mandatory in all public spaces in Pennsylvania, Gov. Wolf says Governor Tom Wolf signed an expanded mask order on Wednesday. fox29.com", "2020-07-02T13:34:57.000Z": "Thank you, @VP Pence. \n\nWe know masks are a critical tool in fighting the spread of #COVID19 - and we need as many people as possible to wear them when leaving home.\n\nIn Pennsylvania, masks are mandatory in businesses and all public spaces. #MaskUpPA Quote Tweet The Hill @thehill VP Mike Pence: \"Wear a mask.\"", "2020-07-02T12:00:00.000Z": "Reminder: In Pennsylvania, masks must now be worn whenever anyone leaves home.\n\nIt is essential that Pennsylvanians wear masks to prevent the spread of #COVID19 .\n\nMore about this requirement: http:// on.pa.gov/2VFj7Dk", "2020-07-01T20:36:05.000Z": "Making masks cool since the '70s.\n\nStay safe, wear a mask : https:// pens.pe/2VAig6G", "2020-07-01T19:09:36.000Z": "#COVID19 UPDATE: In Pennsylvania, masks must now be worn whenever anyone leaves home.\n\nThis is essential to stopping the recent increase in #COVID19 cases in Pennsylvania.\n\nMore about this requirement: http:// on.pa.gov/2VFj7Dk", "2020-07-01T18:22:50.000Z": ". @GovernorTomWolf today signed Senate Bill 637, which removes outdated licensing barriers so skilled workers with criminal records can get a second chance and start good careers. Gov. Wolf Signs Bipartisan Bill to Remove Barriers to Work for People with Criminal Convictions Building on his criminal justice reforms and fulfilling a recommendation to modernize job licensing, Governor Tom Wolf today signed Senate Bill 637, which removes outdated licensing barriers so... governor.pa.gov", "2020-07-01T18:10:11.000Z": "PA business owners are required to provide non-medical masks for all employees.\n \nNeed help finding masks or other personal protection equipment? Check out the @PADCEDNews B2B Interchange Directory. COVID-19 PPE & Supplies Interchange Directory Pennsylvania COVID-19 PPE & Supplies Business-2-Business (B2B) Interchange Directory Company and product information provided in this directory were dced.pa.gov", "2020-07-01T17:47:18.000Z": "Moments ago, I signed bipartisan legislation to prevent @PAStateDept boards and commissions from denying someone a professional license due to an unrelated crime.\n\nI'm proud this law will help more Pennsylvanians pursue the American dream without being held back by their past.", "2020-07-01T15:41:09.000Z": "Today, the @GovernorTomWolf Administration reminded Pennsylvanians of the requirements put in place for restaurants and bars to protect the health and safety of workers and patrons from COVID-19. Pennsylvania Restaurants and Bars Required to Protect Workers and Patrons During COVID-19 The Wolf Administration reminded Pennsylvanians of the requirements put in place for restaurants and bars to protect the health and safety of workers and patrons from COVID-19. governor.pa.gov", "2020-07-01T14:00:00.000Z": "The Pandemic Unemployment Compensation Program is a temporary federal program that provides 13 additional weeks of unemployment benefits.\n\nApply today: http:// uc.pa.gov", "2020-06-29T12:00:01.000Z": "If you're visiting a business in Pennsylvania, you're required to wear a mask for the entire time you're visiting a business, unless you have an underlying health condition that prevents you from wearing a mask. Children two or younger are not required to wear masks. #MaskUpPA", "2020-06-29T15:50:04.000Z": "Small businesses in Pennsylvania can apply for COVID-19 relief grants this week http:// dlvr.it/RZbjPX", "2020-06-30T18:36:45.000Z": "I'm virtually joining criminal justice advocates, legislators, and participants to celebrate one year of Clean Slate in PA.\n\nSince this first-in-the-nation legislation took effect, 1 million PA'ians with minor criminal records and non-convictions have been given a second chance.", "2020-06-30T15:55:41.000Z": "I signed this first-in-the nation legislation because a criminal record shouldn't be a life sentence to poverty.\n \nLearn more: http:// mycleanslatepa.com", "2020-06-30T15:54:52.000Z": "It has been one year since Clean Slate went into effect in Pennsylvania.\n\nSince then, it has helped more than 1 million Pennsylvanians like Marilyn.", "2020-06-28T20:28:12.000Z": "The standard is the standard. \n\nWear. A. Mask.", "2020-06-30T14:00:02.000Z": "This #PrideMonth , we celebrated a historic nondiscrimination Supreme Court ruling and solemnly reflected on the lives lost to violence against the LGBTQ+ community.\n\nThe Pride flag over our Capitol is a reminder to all of us that the fight for equality continues in PA.", "2020-06-30T12:00:01.000Z": "#COVID19 cases are again on the rise across the U.S.\n \nWearing a mask in public tells people we come in contact with that we care about them and will take the steps necessary to protect them from #COVID19 .\n\nIn Pennsylvania, masks are required in businesses.", "2020-06-29T12:00:00.000Z": "Masks are required in Pennsylvania businesses. No mask = no service.\n\nThe importance of mask-wearing to reduce the spread of #COVID19 and protect people and businesses cannot be overstated.", "2020-06-29T13:00:01.000Z": "Wearing a mask is an essential part of slowing the spread of COVID-19.\n\nWhen you wear a mask, you are showing kindness towards your co-workers, neighbors, and people around you in public. You are helping keep others healthy and doing a big part in keeping Pennsylvania safe.", "2020-06-29T17:33:11.000Z": "Today I'm with health experts at @UPMC Pinnacle Community Osteopathic Hospital in Harrisburg to talk about the importance of mask wearing in the fight against #COVID19 .\n \nWith virus cases rising across the country, masks are crucial to keeping Pennsylvanians safe.", "2020-06-26T13:58:28.000Z": "The federal CARES Pennsylvania Guidance one-pager includes information on what you need to know and do. Download here: https:// uc.pa.gov/COVID-19/Docum ents/CaresAct_ProcessMap_6.9.20.pdf   Updates and Information: https:// uc.pa.gov/COVID-19/CARES -Act/Pages/default.aspx ", "2020-06-29T16:00:01.000Z": "From our small towns to our big cities, people across Pennsylvania are standing together against racism and I couldn't be prouder.\n\nWe can all do better. We must all do better. Change starts now. #BlackLivesMatter  : Johnstown, PA", "2020-06-29T15:00:00.000Z": "If you're a Pennsylvania business owner affected by #COVID19 , there are several financing programs available.\n \nKeep checking back for new opportunities posted on this page: https:// dced.pa.gov/funding-progra ms/  GIF", "2020-06-29T14:00:00.000Z": "No Pennsylvanian should go hungry. Volunteers across the commonwealth have spent thousands of hours making sure families are fed during the COVID-19 pandemic.\n\nIf you or someone you know need help, resources are available: http:// agriculture.pa.gov/food_security .", "2020-06-29T01:00:00.000Z": "This is an unprecedented time. If you are struggling with your mental health, help is available.\n \nInformation and resources: http:// pa.gov/covid-19/#ment al-health  .", "2020-06-28T21:26:29.000Z": "Today, @GovernorTomWolf commended @Allegheny_Co Executive and @HealthAllegheny for the additional mitigations the county is putting in place in response to significant COVID-19 case increases. Gov. Wolf Supports Allegheny County COVID-19 Mitigation Efforts Gov. Wolf commended the Allegheny County for the additional mitigations put in place in response to recent COVID-19 case increases. governor.pa.gov", "2020-06-28T17:00:00.000Z": "Pennsylvanians should wear masks when they leave their homes in order to help prevent the spread of COVID-19.\n \nMasks are proving more effective than first thought against this virus because it spreads through respiratory droplets. #MaskUpPA When, why and how to wear a mask during this pandemic, according to the experts Experts say there's a \"collective responsibility\" to wearing a mask in public. washingtonpost.com", "2020-06-27T12:00:01.000Z": "Here are some tips for reducing #COVID19 risk at your next BBQ with close friends and family. Remember to wear a mask. Stay informed: http:// pa.gov/COVID-19 .", "2020-06-26T19:36:31.000Z": "Reminder: stay safe and wear your mask.", "2020-06-26T18:41:59.000Z": ". @GovernorTomWolf today reminded all Pennsylvania residents and businesses that masks are mandatory when visiting a business. Gov. Wolf: Masks are Mandatory in Pennsylvania Businesses Governor Tom Wolf today reminded all Pennsylvania residents and businesses that masks are mandatory when visiting a business. governor.pa.gov", "2020-06-26T19:00:01.000Z": "Did you know? The U.S. Census Bureau has extended its deadline for the #2020Census to October 31.\n\nHelp build a stronger future for Pennsylvania. Fill out the census\n \nHere's how: http:// pa.gov/census .", "2020-06-26T17:00:01.000Z": "Today 12 more counties moved from the yellow to green phase of #COVI19 reopening: Berks, Bucks, Chester, Delaware, Erie, Lackawanna, Lancaster, Lehigh, Montgomery, Northampton, Philadelphia, and Susquehanna.\n\nLebanon, the final remaining yellow county, will go green on July 3.", "2020-06-26T16:35:05.000Z": "Pre-K to 12 School Sports: Gatherings must be limited to 250 people and the facility as a whole may not exceed 50% of total occupancy. No spectators allowed.", "2020-06-26T16:35:04.000Z": "Sports are starting back up in Pennsylvania.\n \nHere is the health and safety guidance we've issued for counties in the green phase to keep players, coaches, and spectators safe. Thread", "2020-06-26T14:00:00.000Z": "Happy anniversary! #LoveIsLove", "2020-06-26T12:47:13.000Z": "Reminder: Masks are required in Pennsylvania businesses. #MaskUpPA", "2020-06-26T12:03:39.000Z": "As pointed out by @Surgeon_General , face masks aren't meant to infringe on your freedom.\n \nFace masks mean less asymptomatic viral spread - which means more places open (and sooner).\n \nIf more people wear face masks when out in public, we'll all have more freedom to go out.", "2020-06-25T16:29:28.000Z": "Meeting up with friends? Limit your #COVID19 risk: Wear a mask Limit the size of your group Meet outdoors Stay 6 feet apart Wave instead of shaking hands or giving hugs Limit your time together Not feeling well? Stay home\n\nStay safe: Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-06-25T18:00:14.000Z": ". @GovernorTomWolf 's call to wear masks has been endorsed by Pennsylvania businesses that see mask-wearing as vital to protecting customers, employees, communities, and their bottom lines. Gov. Wolf: PA Businesses Endorse Mask-Wearing to Protect Others Governor Wolf's call to wear masks has been endorsed by PA businesses that see mask-wearing as vital to protecting customers, employees, communities. governor.pa.gov", "2020-06-23T18:00:02.000Z": "\"Some feel face coverings infringe on their freedom of choice- but if more wear them, we'll have MORE freedom to go out,\" U.S. Surgeon General Dr. Jerome Adams said in a Twitter post this week. #NCPA  #maks  #COVID19 Research confirms: Masks help stop the spread of COVID-19 Harrisburg, Pa. - Research confirms the importance of wearing masks to stop the spread of COVID-19, and Pennsylvanians are required to wear masks when entering any business in all counties northcentralpa.com", "2020-06-25T14:19:37.000Z": "Today, @GovernorTomWolf released this statement in response to the Trump Administration suspending new work visas, including H-1B visas. Gov. Wolf Releases Statement on Suspension of New Work Visas Governor Tom Wolf released the following statement today in response to the Trump Administration suspending new work visas, including H-1B visas. governor.pa.gov", "2020-06-25T14:00:34.000Z": "Learn more about the safety guidance in place to protect employees and customers during the pandemic, including: Mask requirements Cleaning procedures Social distancing guidelines COVID-19 Guidance for Pennsylvania Businesses This guidance addresses procedures businesses must follow to limit the spread of COVID-19 to the extent they are permitted to conduct in-person operations. governor.pa.gov", "2020-06-25T12:00:01.000Z": "Pennsylvanians have done a great job stopping the spread of #COVID19 .\n \nWhat we do today affects the number of new cases in the days to come.\n \nPlease continue to wear masks, wash hands frequently, and practice social distancing.", "2020-06-22T21:00:57.000Z": "Gov. Tom Wolf announced Monday that the population in state prisons has been reduced by nearly 3,471 which he says likely helped reduce the number of #COVID19 cases in facilities. PA prison populations reduced by record-setting 3,471 since mid-March, Gov. Wolf says Gov. Tom Wolf announced Monday that the population in state prisons has been reduced by nearly 3,471 which he says likely helped reduce the number of COVID-19 cases in facilities. Gov. Wolf said the... wjactv.com", "2020-06-24T19:50:24.000Z": "By wearing a cloth mask, we aren't just protecting others in our community from exposure to #COVID19 ⁠-we're saying THANK YOU to the brave health care professionals working day and night to save our lives. #MaskUpPA", "2020-06-24T19:15:27.000Z": "Today I'm with @PennStHershey and @PAHealthDept to thank Pennsylvania's dedicated health care workers.\n \nI'm also here to discuss with experts how we've handled #COVID19 so far and how to best prepare for a potential surge in cases in the fall.", "2020-06-24T14:00:00.000Z": "Protect yourself and others: Wear masks in public.\n \nIn Pennsylvania, masks are required if you are entering a business. #MaskUpPA Face Masks May Be The Key Determinant Of The Covid-19 Curve, Study Suggests As states reopen during the ongoing Covid-19 pandemic, many are seeing still-rising levels of new cases. Face masks might make all the difference. forbes.com", "2020-06-24T12:02:40.000Z": "Black trans lives matter.\n\nFrances and I send our love to those mourning Dominique Rem'mie Fells and to the LGBTQ and Black communities.\n\nAs governor, I will continue to push for protections for LGBTQ and BIPOC Pennsylvanians. Quote Tweet Pennsylvania @PennsylvaniaGov We remember Pennsylvanian Dominique Rem'mie Fells, who was murdered in Philadelphia earlier this month. #BlackTransLivesMatter . Pennsylvania was founded on the principles of tolerance and freedom, and needs to be a safe place for everyone.\n\nWe do not stand for hate. #SayHerName", "2020-06-18T22:35:00.000Z": "Gov. Tom Wolf today reminded Pennsylvanians that masks are required to enter any business, regardless of what phase of reopening they're in. Gov. Wolf: Masks are required to enter any business in Pennsylvania, regardless of what phase of... Masks are considered critical in stopping the spread of COVID-19, now and in preparation for a possible resurgence of the virus in the fall, Wolf said Thursday. fox43.com", "2020-06-12T22:30:00.000Z": "Grant program established to assist minority-owned businesses impacted by COVID-19 Grant program established to assist minority-owned businesses impacted by COVID-19 Relief is coming for Black-owned businesses that have been severely impacted by the coronavirus crisis. phillytrib.com", "2020-06-23T17:13:10.000Z": "Today, @GovernorTomWolf noted that research confirms the importance of wearing masks to stop the spread of COVID-19 and that Pennsylvanians are required to wear masks when entering any business in all counties in both yellow and green phases of reopening. Gov. Wolf: Masks Help Stop the Spread of COVID-19 Gov. Wolf noted the importance of wearing masks to stop the spread of COVID-19 and that Pennsylvanians are required to wear masks when entering a business. governor.pa.gov", "2020-06-23T16:31:52.000Z": "I send my utmost gratitude to Pennsylvanians and to the leadership and residents of other Northeastern states for the work they've done to flatten the curve.\n \nWe couldn't make the progress we are seeing without everyone working together.", "2020-06-23T14:04:32.000Z": "Today, @GovernorTomWolf visited the York County Food Bank's East York Emergency Food Hub and thanked Pennsylvania food banks, farmers, and volunteers for helping to feed families during the pandemic. Gov Wolf Thanks Pennsylvania's Food Banks for Helping Those in Need Governor Wolf is thanking food banks, farmers, volunteers and others across the state for helping to feed Pennsylvania families during the pandemic. governor.pa.gov", "2020-06-23T14:00:05.000Z": "Need help? Find food resources near you Food Resources for Pennsylvanians agriculture.pa.gov", "2020-06-23T14:00:04.000Z": "Today, I visited the York County Food Bank.\n \nThey have provided 2.4 million meals and volunteers donated more than 4,000 hours in the midst of this pandemic.\n \nWe want to thank every person who has helped keep our food supply chain safe and reliable during #COVID19 .", "2020-06-23T12:00:01.000Z": "You'll need to update your voter registration if you've experienced any of these life events. Update your voter registration in minutes at http:// Register.VotesPA.com .", "2020-06-23T00:00:58.000Z": "Today, @GovernorTomWolf reaffirmed his commitment to combat climate change by providing @PennsylvaniaDEP with a six-week extension to develop a proposed rulemaking to allow Pennsylvania to participate in the Regional Greenhouse Gas Initiative. Gov. Wolf Reaffirms Commitment to Fight Climate Change, RGGI Update Gov. Wolf provided the Department of Environmental Protection with a six-week extension to develop a proposed rulemaking to allow PA to participate in RGGI. governor.pa.gov", "2020-06-22T20:03:22.000Z": ". @GovernorTomWolf announced today that the population of those in state correctional facilities has been reduced by 3,471 individuals since March 1, the largest multiple-month decrease ever experienced by @CorrectionsPA . Gov. Wolf: PA Reduced Prison Population by Record-Setting 3,471 Governor Tom Wolf announced today that since March 1 the population of those in state correctional facilities has been reduced by 3,471 individuals. governor.pa.gov", "2020-06-17T21:27:43.000Z": "CDC: Pennsylvania 1 Of Just 3 States With Downward Trend In COVID-19 Cases For More Than 42 Days @StahlCBS3 reports CDC: Pennsylvania 1 Of Just 3 States With Downward Trend In COVID-19 Cases For More Than 42 Days Still, health officials urge people to continue to wear masks, citing several studies that show they can significantly reduce the spread of the virus. philadelphia.cbslocal.com", "2020-06-22T18:00:00.000Z": "Stay safe while enjoying your favorite summer activities. Here's what we recommend See the full FAQ on summer recreation: https:// on.pa.gov/2NauoGV", "2020-06-17T20:36:51.000Z": "Families: are you preparing for a return to child care? @PAPromise offers tips to help with the transition: https:// papromiseforchildren.com/featured-artic les/five-tips-for-families-returning-to-child-care-after-covid-19/   @PAHumanServices offers answers to FAQs: http:// bit.ly/PACOVID19Child CareFAQ  Find child care centers: http:// findchildcare.pa.gov", "2020-06-22T12:00:01.000Z": "More counties are moving to the green phase of reopening, but we still need to be vigilant.\n\nMask wearing is proven to slow the spread of #COVID19 . That's why we require them for entering Pennsylvania businesses and ask that everyone wears them in public. US Surgeon General: Coronavirus face masks promote freedom The US Surgeon General on Sunday urged people to wear face coverings, saying they will promote freedom during the coronavirus pandemic. cnn.com", "2020-06-21T13:00:00.000Z": "Happy #FathersDay to all Pennsylvania dads.", "2020-06-20T16:00:01.000Z": "It's normal to feel stress around COVID-19. If you need help, please reach out.\n \nFind pandemic mental health resources in our COVID-19 guide: http:// pa.gov/guides/respond ing-to-covid-19/#mentalhealth  13 potential long-term effects the coronavirus pandemic could have on mental health Business Insider spoke with experts about how the pandemic and its varying impacts might affect people's mental health. businessinsider.com", "2020-06-20T13:19:12.000Z": "Stay safe as you head outside this summer to enjoy Pennsylvania's great outdoors.\n\nWear a mask if you'll be around others and stay home if you're not feeling well. Quote Tweet Pennsylvania @PennsylvaniaGov Happy first day of summer, PA! Find \"summerific\" views at a state park or forest near you: http:// DCNR.pa.gov .", "2020-06-19T17:19:37.000Z": "Eight more counties moved into the green phase of COVID-19 reopening today: Dauphin, Franklin, Huntingdon, Luzerne, Monroe, Perry, Pike, and Schuylkill.", "2020-06-19T12:00:01.000Z": "We each play a role in sustaining the self-evident truth that all people are created equal.\n\nToday on #Juneteenth , we celebrate the end of the horrors of African American slavery in the U.S. and recognize the ongoing fight for racial equality throughout the nation.", "2020-06-18T21:28:22.000Z": "Nearly 800,000 Americans faced deportation to a country they left at a young age and may not even remember.\n\nToday's Supreme Court ruling means they can continue to reside in the communities they call home, where they make contributions that benefit all of us.", "2020-06-18T12:00:00.000Z": "Hope is all of us, coming together in a scary time, to help and protect each other.  #PAproud", "2020-06-18T18:19:01.000Z": ". @GovernorTomWolf today reminded Pennsylvanians that mask-wearing is required when entering any business in all counties in the state in both yellow and green phases of reopening. Gov. Wolf: Mask-Wearing is Required, Critical to Stop COVID-19 Spread Governor Tom Wolf today reminded Pennsylvanians that mask-wearing is required when entering any business in all counties in the state in both yellow and green phases of reopening. Masks are conside... governor.pa.gov", "2020-06-18T16:04:33.000Z": "Restaurants: Ensure maximum occupancy limits for indoor and outdoor areas are posted and strictly enforced. Assign employee(s) to monitor and frequently clean high touch/shared areas or items. Provide non-medical masks for employees to wear at all times.", "2020-06-18T16:04:32.000Z": "To keep Pennsylvanians safe, we are returning slowly our favorite summer activities - including restaurant dining.\n\nHere is some of the guidance we have in place to keep employees and diners safe:", "2020-06-18T14:00:00.000Z": "Wearing your face mask whenever you go out can help us avoid a second wave of #COVID19 cases in Pennsylvania.\n \nFace masks are required to be worn inside businesses. 100% face mask use could crush a second or third wave of COVID-19: Study Face masks may be even more important than originally thought in preventing future outbreaks. pennlive.com", "2020-06-18T13:12:44.000Z": "This Friday is the first anniversary of @GovernorTomWolf declaring June 19 as Juneteenth National Freedom Day in Pennsylvania, a state holiday centered around the continued need for a fair and just society. Gov. Wolf Honors Juneteenth National Freedom Day This Friday is the first anniversary of Pennsylvania declaring June 19 as Juneteenth National Freedom Day in Pennsylvania. Governor Wolf is encouraging Pennsylvanians to reflect on the importance of... governor.pa.gov", "2020-06-18T12:00:01.000Z": "A study from researchers at @nature estimates that stay at home orders kept 60 million people in the U.S. from getting #COVID19 .\n \nThe actions we took in Pennsylvania saved lives. And by continuing to practice social distancing and wear masks, we can save even more.", "2020-06-17T19:41:18.000Z": "I'm proud to announce that we are just one of three states with a downward trajectory of #COVID19 cases for more than 42 days.\n \nThis is without a doubt thanks to the hard work and sacrifices of every Pennsylvanian.", "2020-06-17T18:00:00.000Z": "If you've used up your regular state/federal unemployment benefits then you may be eligible for Pandemic Emergency Unemployment Compensation (PEUC).\n\nPEUC extends your benefits for another 13 weeks at your existing rate.\n\nFind out more and apply today Guide: Unemployment Benefits This guide will help you navigate the process of applying for unemployment compensation and connect you with additional resources available. pa.gov", "2020-06-15T16:47:03.000Z": "Additional COVID-19 testings sites will open in areas of Pennsylvania where access to testing is limited. Additional COVID-19 Testing Sites Open Around Pennsylvania New testing locations include News Castle and Grove City. kdkaradio.radio.com", "2020-06-17T14:55:13.000Z": "GREEN PHASE\n \nSafety measures in place: Masks are required when entering a business Gatherings of 250 or more are not allowed Telework strongly encouraged Businesses with in-person operations must follow safety guidance", "2020-06-17T14:55:12.000Z": "YELLOW PHASE\n \nStill closed: ‍ Indoor recreation and health and wellness facilities (such as gyms, spas) ‍Personal care services (such as hair salons, barbershops) All entertainment (such as casinos, theaters, malls) Congregate care, prison restrictions in place", "2020-06-17T14:55:11.000Z": "Our measured phased reopening efforts are proving successful at keeping #COVID19 cases down.\n\nRight now, the entire state is in the yellow or green phase. \n\nHere's what that means:", "2020-06-17T14:00:00.000Z": "States that reopened before us are now seeing their highest #COVID19 case counts.\n\nThis is proof that even though we're tired, we must persevere and continue precautions.\n \nPlease follow guidance, practice good health habits, and wear masks in public. Alarming rise in virus cases as states roll back lockdowns NEW YORK (AP) - States are rolling back lockdowns, but the coronavirus isn't done with the U.S. Cases are rising in nearly half the states, according to an Associated Press... apnews.com", "2020-06-17T12:05:11.000Z": "Weather alert for pet owners:\n \nAs it gets warmer outside, don't forget to protect your pet!\n \nHere are some things to remember", "2020-06-17T12:00:01.000Z": "I recently announced actions to reform Pennsylvania's law enforcement system with guidance from President Obama's 21st Century Policing Task Force.\n \nEnough is enough. We must address looming, systemic failings and longstanding inequalities against people of color.", "2020-06-16T22:30:00.000Z": "For more than 42 days, #COVID19 cases in Pennsylvania have been on a downward trajectory.\n\nThis is a huge accomplishment. And it's all thanks to the tremendous sacrifices made by Pennsylvanians in the last few months.\n\nSource: @CDCgov June 10 analysis of state data", "2020-06-15T23:19:03.000Z": "Pennsylvania is directing $260 million of federal funds to help people with autism and intellectual disabilities continue to get the services they need during the coronavirus pandemic. Wolf allocates $260M to services for people with intellectual disabilities, autism Pennsylvania is directing $260 million of federal funds to help people with autism and intellectual disabilities continue to get the services they need during the coronavirus pandemic. Read more here. kywnewsradio.radio.com", "2020-06-16T19:04:07.000Z": "Allow for social distancing among students and staff in learning spaces. Stagger the use of communal spaces for regular cleaning.\n \nLearn more about school safety guidance: http:// education.pa.gov/COVID19", "2020-06-16T19:04:06.000Z": "Submit a Health and Safety Plan to @PADeptofEd and post it on the school website. Follow phased reopening guidance. Designate a pandemic coordinator or team with defined roles and responsibilities.", "2020-06-16T19:04:05.000Z": "Preliminary guidance for the phased reopening of Pre-K to 12 schools is now available.\n \nHere's how schools can help keep students, teachers, and staff safe.", "2020-06-16T16:05:24.000Z": ". @GovernorTomWolf announced today the availability of $40 million in funding through the CARES Act to support Pennsylvania's dairy industry and food security programs, following months of uncertainty and loss from the COVID-19 pandemic. Gov. Wolf Announces $40 Million in CARES Act Funding Available to Address Dairy Industry Relief,... Governor Wolf announced today the availability of $40 million in funding through the federal Coronavirus Aid, Relief, and Economic Security (CARES) Act to support Pennsylvania's dairy industry and... governor.pa.gov", "2020-06-16T17:00:00.000Z": "New assistance programs are available for small business owners in Pennsylvania through the #CARESAct .\n \nSee the up-to-date list of financing programs for businesses impacted by #COVID19  Funding & Programs - PA Department of Community & Economic Development Funding & Programs To help navigate through the potential financial impact the COVID-19 pandemic has had on Pennsylvania businesses, both the state and dced.pa.gov", "2020-06-09T15:40:42.000Z": "PUA UPDATE: If you don't have a debit card, you'll be receiving one in the mail soon. If you received one, but lost it or discarded it, contact U.S. Bank Reliacard at 888-233-5916 to request a replacement.\n  \nLearn more at http:// uc.pa.gov/PUA", "2020-06-16T13:00:01.000Z": "If you are a trans individual in crisis, help is available. Trans Lifeline connects trans people to the community, support, and resources they need to survive and thrive.\n\nCall (877) 565-8860 between 10am-4am EST. ¿Hablas español? Ayuda esta disponible.", "2020-06-16T14:00:00.000Z": "In Pennsylvania, we're encouraging people to wear face masks when they leave their homes and you're required to wear one when entering a business. #MaskUpPA Face mask use needed to 'prevent COVID-19 second wave' Researchers say even homemade masks with limited effectiveness can dramatically reduce transmission rates. sciencefocus.com", "2020-06-16T12:00:00.000Z": "PA is showing a strong decrease in #COVID19 cases, even as cases continue to rise in some states.\n \nWe're doing something right, and we can't stop our efforts just because the road has been long.\n \nAs we reopen, my team will continue to monitor the situation to keep PA'ians safe.", "2020-06-15T12:00:01.000Z": "Pools throughout Pennsylvania are gradually reopening for the summer season.\n \nHere are some #COVID19 safety tips to keep in mind before heading to a pool near you.", "2020-06-15T19:01:59.000Z": "America has suffered for too long from discriminatory employment practices.\n\nBy recognizing that the Civil Rights Act of 1964 protects against the discrimination of workers who are LGBTQ+, our workforce, our businesses, and our economy will be stronger.", "2020-06-15T18:12:07.000Z": "Today I'm with @PAHumanServices to announce a $260 million investment to support Pennsylvanians with intellectual disabilities or autism.\n \nThis CARES Act funding will help 40,000 Pennsylvanians who have been impacted by #COVID19 .", "2020-06-15T17:01:56.000Z": "Pennsylvania's measured, phased process to reopen has been successful.\n\nWe've relied on science and health experts and asked everyone to do something simple: Wear a mask when you go out in public.\n\nWe'll continue to move forward cautiously.\n\nSource: http:// fortune.com/2020/06/12/cor onavirus-cases-us-covid-19-arizona-florida-alabama-california-texas-utah-north-south-carolina-states/ ", "2020-06-15T16:20:00.000Z": ". @GovernorTomWolf announced new procurement changes to improve opportunities for minority, women, LGBT, veteran, and disabled-owned businesses to compete for state government contracts and succeed in the commonwealth's economy. Pennsylvania Launches New Policies to Increase Diversity Among State Contractors Continuing his commitment to small businesses (SBs) and small diverse businesses (SBDs), Governor Tom Wolf announced new procurement changes to improve opportunities for minority-, women-, LGBT-,... governor.pa.gov", "2020-06-15T15:44:56.000Z": "#BlackLivesMatter", "2020-06-10T17:39:17.000Z": "High school sports teams are now allowed to resume workouts, but there are plenty of rules to follow: https:// wearecentralpa.com/sports/local-s ports/high-school-sports-teams-in-pa-are-now-allowed-to-resume-workouts/ ", "2020-06-15T14:02:47.000Z": "GREEN PHASE\n \nStill closed: Prison and hospital restrictions determined by individual facilities Congregate care restrictions in place", "2020-06-15T14:02:46.000Z": "YELLOW PHASE\n\nOpen: In-person shopping Outdoor dining Child care Schools Professional, collegiate, pre-k to 12, and recreational sports", "2020-06-15T14:02:45.000Z": "Our measured phased reopening efforts are proving successful at keeping #COVID19 cases down.\n\nRight now, the entire state is in the yellow or green phase. \n\nHere's what that means:", "2020-06-15T13:02:03.000Z": "There is only one month left to file your Pennsylvania Personal Income Tax return. July 15th is the deadline! More info: http:// revenue.pa.gov/PIT  File for free: https:// padirectfile.state.pa.us  Need help?: http:// revenue.pa.gov/help GIF", "2020-06-15T12:00:00.000Z": "One recent study shows that shutdown orders kept 60 million Americans from getting #COVID19 .\n \nIn just 60 days in Philadelphia, 7,138 lives were saved.\n \nWe've made extreme sacrifices, and it has been worth it.", "2020-06-10T16:25:31.000Z": "Outdoor minigolf, motorsports, more now allowed in Pa. counties still in yellow phase of Wolf's reopening plan Outdoor minigolf, motorsports, more now allowed in Pa. counties still in yellow phase of Wolf's... The state updated its business guidance on Wednesday. pennlive.com", "2020-06-14T13:00:00.000Z": "#OTD in 1777, the Continental Congress established an outline for our first official national flag. Betsy Ross is credited for designing this version of the flag here in Pennsylvania. #FlagDay", "2020-06-13T17:29:16.000Z": "This rule flies in the face of every policy and protection my administration has put in place.\n\nIt's another attempt to dismantle the ACA and put our LGBTQ community at greater risk - and to do this in middle of a pandemic is especially egregious. http:// nytimes.com/aponline/2020/ 06/12/us/ap-us-trump-transgender-health.html ", "2020-06-13T13:00:00.000Z": "Researchers say wearing face masks dramatically reduces transmission rates of COVID-19, and can prevent a second wave of the pandemic.\n\nWe've all worked too hard and sacrificed too much to go backward. Let's #MaskUpPA and stop the spread.", "2020-06-12T21:02:01.000Z": "Proud to share with @TheEconomist the tremendous job Pennsylvanians have done flattening the COVID-19 curve. How Pennsylvania's governor is battling the pandemic A day on the frontline with Tom Wolf is an unnerving experience economist.com", "2020-06-12T20:27:15.000Z": "As PA implements @GovernorTomWolf 's Process to Reopen, the state is also among a select few with a steady decline in cases, a positive indicator that the state's phased, measured reopening plan is working to balance public health with economic recovery. Gov. Wolf: State's Measured, Phased Reopening Plan Succeeding as Other States See Cases Rise As Pennsylvania continues to implement Governor Tom Wolf's Process to Reopen PA, the state is also among a select few with a steady decline in cases, a positive indicator that the state's phased,... governor.pa.gov", "2020-06-12T19:55:35.000Z": "Guidance for Sports COVID-19 Guidance for Sports Guidance for professional, collegiate, pre-k to 12, and recreational and amature sports in Pennsylvania during the COVID-19 pandemic. governor.pa.gov", "2020-06-12T19:55:34.000Z": "Guidance for Businesses COVID-19 Guidance for Pennsylvania Businesses This guidance addresses procedures businesses must follow to limit the spread of COVID-19 to the extent they are permitted to conduct in-person operations. governor.pa.gov", "2020-06-12T19:55:33.000Z": "Want to know more about the green and yellow phases? See the guidance issued by my administration to keep Pennsylvanians safe as we reopen our commonwealth COVID-19 Guidance and Resources | Governor Tom Wolf See guidance and resources issued by Governor Tom Wolf in response to the COVID-19 pandemic. governor.pa.gov", "2020-06-12T17:30:59.000Z": "Eight counties will move to the green phase of reopening Friday, June 19: Dauphin Franklin Huntingdon Luzerne Monroe Perry Pike Schuylkill Quote Tweet Office of the Governor @GovernorsOffice . @GovernorTomWolf today announced that eight more counties will move to the green phase of reopening from the COVID-19 pandemic at 12:01 a.m. on Friday, June 19. https:// on.pa.gov/2C1QdGt Show this thread", "2020-06-12T15:30:10.000Z": "More Pennsylvania businesses are opening up. People can eat at their favorite restaurants again, and folks can spend the day at a state park or swimming pool.\n \nKids can once again look forward to heading off to summer camp.", "2020-06-12T14:00:00.000Z": "If your regular unemployment compensation benefits have expired, you could be eligible for the ​Pandemic Emergency Unemployment Compensation program.\n\nFind out more and apply today: http:// on.pa.gov/3fbLqR5", "2020-06-11T18:58:19.000Z": "FUNDING UPDATE: The new COVID-19 Relief Statewide Small Business Assistance Program guidelines + additional details are now on our website. Learn more how the program will help those COVID-19-impacted businesses: http:// ow.ly/Ha2V50A5myL CDFI list  http:// ow.ly/HGvw50A5myK", "2020-06-11T20:00:00.000Z": "View even more data on #COVID19 with @PAHealthDept 's new dashboard: http:// on.pa.gov/coronavirus . A new way to look at COVID-19 in Pennsylvania Governor Tom Wolf announced today that his administration launched an enhanced dashboard to pull Pennsylvania's COVID-19 data and information together to inform Pennsylvanians. The dashboard further wilknews.radio.com", "2020-06-11T17:52:41.000Z": "I urge all Pennnsylvanians to reach out for help if they need it. Food pantry map: http:// on.pa.gov/2Ue5aKV  Housing + other resources: http:// uwp.org/pacovid/  Mental health support: Call 1-855-284-2494  #COVID19 help for seniors: http:// on.pa.gov/3dQHaGn", "2020-06-11T16:00:00.000Z": "The November 3 general election is only a few months away. Pennsylvanians may now register to vote in the upcoming election at http:// register.votesPA.com .", "2020-06-11T15:01:07.000Z": "More on the actions I announced last week to address concerns about community relations with law enforcement Gov. Wolf Takes Action to Address Law Enforcement Reform and Accountability After meeting with leaders in Philadelphia and Harrisburg, Governor Tom Wolf announced several actions to improve law enforcement relations with the community and strengthen training and accountabi... governor.pa.gov", "2020-06-11T14:00:01.000Z": "Reminder for parents of school-aged children: If your child gets free meals when school is in session, you can receive money for meals through the Pandemic Electronic Benefit Transfer (P-EBT) program\n \nDetails: http:// on.pa.gov/2MOkvPc .\nApplication: http:// on.pa.gov/3d5j0b6 . P-EBT Program Information for families on the Pandemic Electronic Benefit Transfer (P-EBT) Program. education.pa.gov", "2020-06-11T12:05:11.000Z": "Here's what to expect when taking a driver's skills test during #COVID19 :  @PennDOTNews staff will stay outside the vehicle. The test taker and accompanying driver will stay in the vehicle. Everyone must wear appropriate face masks during testing.", "2020-06-11T12:00:01.000Z": "I'm taking executive action on police reform in Pennsylvania.\n \nWe can't go on without acknowledging that our system was built on a foundation of racism.\n \nWe can do better. We must do better. Change starts now.", "2020-06-10T19:58:39.000Z": "As we reopen, we're asking businesses with in-person operations to follow safety guidelines to keep PA'ians safe. Review and implement guidelines: http:// pa.gov/covid-19  Print and sign #COVID19 Safety Procedures for Businesses flyer Post signed flyer in a common area Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-06-10T18:46:55.000Z": "To be clear, Pennsylvania's disaster declaration remains in effect and was not affected by last night's resolution in the legislature.\n \nRead the declaration here: http:// on.pa.gov/2MONW3z .", "2020-06-10T17:22:23.000Z": "The disaster declaration provides protections for businesses, workers, and residents in the face of a global pandemic.\n \nIt also helps us quickly activate @PANationalGuard to help in nursing homes, deploy commonwealth personnel, and respond to this emergency with less red tape.", "2020-06-10T17:22:22.000Z": "Last night, the Pennsylvania Senate and House passed a resolution to terminate the #COVID19 disaster declaration.\n \nThey said this action would reopen Pennsylvania, but the disaster declaration doesn't have anything to do with re-opening.", "2020-06-10T16:30:00.000Z": "Today at 1 PM, @GovernorTomWolf will address the concurrent resolution passed by the Pennsylvania General Assembly seeking to terminate the COVID-19 Proclamation of Disaster Emergency. Watch live at http:// governor.pa.gov/live . Pennsylvania Governor's Office LIVE Watch the live stream from the Office of the Governor. governor.pa.gov", "2020-06-10T16:15:54.000Z": "The @GovernorTomWolf Administration today issued preliminary guidance for high school and recreational sports teams to resume voluntary workouts and other in-person activities in the state's yellow and green phases. Wolf Administration Provides Guidance to Resume High School and Other Summer Sports The Wolf Administration today issued preliminary guidance for high school and recreational sports teams to resume voluntary workouts and other in-person activities in the state's yellow and green... governor.pa.gov", "2020-06-10T14:06:41.000Z": "Making sure PA has a safe, dependable food supply during #COVID19 is critical. Here's what we've done: Ensured regular cleaning, data logging, and planning for recurring farm deliveries. Created options for contactless shopping, and smaller crowds for farmers markets.", "2020-06-10T12:00:01.000Z": "Pennsylvanians have made tremendous sacrifices since #COVID19 first reached the commonwealth in March.\n \nYour hard work has protected your neighbors and saved lives. Thank you. Shutdowns prevented 60 million coronavirus infections in the U.S., study finds Two reports suggest that the aggressive and unprecedented shutdowns, which caused massive economic disruptions and job losses, were effective at halting the exponential spread of the novel coronavi... inquirer.com", "2020-06-09T11:26:00.000Z": "More economic relief is on the way for small businesses impacted by COVID-19 in Pennsylvania. Pennsylvania unveils $225 million grant program for small businesses affected by COVID-19 Funding comes from federal stimulus provided in CAREs Act phillyvoice.com", "2020-06-09T12:46:53.000Z": "Tips for getting the most out of your cloth face mask  #MaskUpPA", "2020-06-09T18:00:00.000Z": "Keep up with #COVID19 news and #PAproud stories from across the commonwealth by subscribing to my weekly newsletter.\n \nSubscribe here Newsletter Sign-up | Governor Tom Wolf Sign-up for Governor Tom Wolf's newsletter of monthly events, top news stories, new bills, legislative announcements and more. governor.pa.gov", "2020-06-09T16:00:01.000Z": "As the commonwealth continues to reopen, my administration released new guidance to help families stay safe this summer.\n\nSee the full guidance: http:// on.pa.gov/3bXmzhP", "2020-06-09T14:00:12.000Z": "Here are some of the first steps I'm taking to address concerns about community relations with law enforcement: New Deputy Inspector General role will focus on preventing fraud, waste, misconduct, and abuse by law enforcement agencies", "2020-06-09T12:00:01.000Z": "Help is available to Pennsylvanians impacted by #COVID19 .\n\nLearn more about the Pandemic Unemployment Assistance program and apply today: http:// uc.pa.gov .", "2020-06-08T18:26:28.000Z": ". @GovernorTomWolf announced today that his administration launched an enhanced dashboard to pull Pennsylvania's COVID-19 data and information together to inform Pennsylvanians. Gov. Wolf: Enhanced Dashboard Launched that Highlights Demographic, Testing and Reopening Data Governor Tom Wolf announced today that his administration launched an enhanced dashboard to pull Pennsylvania's COVID-19 data and information together to inform Pennsylvanians. The dashboard further... governor.pa.gov", "2020-06-08T19:21:12.000Z": "Thank you to every volunteer for the countless hours you worked to help your neighbors feed their families. Find a food pantry near you: https:// on.pa.gov/2Ue5aKV  For a list of food resources: https:// on.pa.gov/2MDtrXD", "2020-06-08T18:24:20.000Z": "Today I'm announcing new programs that will provide $225 million for grants to small businesses impacted by #COVID19 .\n \nAs PA moves forward in reopening, we need to focus on recovery and remember those who have been hit the hardest by this pandemic.", "2020-06-08T15:05:05.000Z": "As businesses start to reopen in #Pennsylvania , it's important to stay up-to-date with the latest business guidance  http:// ow.ly/zjvp50A1INU  COVID-19 Business Guidance Construction Guidance Real Estate Guidance Restaurant Industry Guidance Safety Flyers", "2020-06-08T16:00:00.000Z": "As more reopens across Pennsylvania, it's important to remember to stay home if you are feeling sick.\n\nIf you suspect your symptoms could be #COVID19 , please call your health care provider for guidance.", "2020-06-08T15:00:01.000Z": "Wishing a happy #PrideMonth to all of our LGBTQ friends, family, and neighbors.\n \nPennsylvania is a better place because of you. Quote Tweet Pennsylvania @PennsylvaniaGov Happy #PrideMonth , Pennsylvania!", "2020-06-08T13:00:00.000Z": "I'm proud of the work we've all done to flatten the curve in Pennsylvania.\n \nThrough staying home and social distancing, we've lowered the number of daily new cases of #COVID19 .\n \nThese aren't just numbers. These are lives saved. These are people kept out of the hospital.", "2020-06-07T17:00:01.000Z": "Your mental health matters. If you need help, please reach out. PA's support helpline: 855-284-2494 Crisis Text Line: Text 'PA' to 741741 Suicide Prevention Lifeline: 800-273-8255", "2020-06-07T13:00:00.000Z": "Pennsylvanians are required to wear face masks when visiting businesses and are strongly encouraged to wear a mask anytime they leave their homes.\n \nRemember: My mask protects you. Your mask protects me. #MaskUpPA", "2020-06-06T14:00:01.000Z": "Facilities at state parks and forests are gradually reopening throughout the commonwealth. Keep up with a state park or forest reopening near you: http:// on.pa.gov/ParksAndForest sStatus  .", "2020-06-06T13:00:01.000Z": "Every Pennsylvanian can be proud of the work they did to help us flatten the #COVID19 curve in our commonwealth.\n \nIt is because of your kindness, dedication, and selflessness that we are now able to begin reopening Pennsylvania.\n \nThank you.", "2020-06-04T22:57:00.000Z": "Governor Wolf introduces law enforcement reforms. Governor Wolf introduces law enforcement reforms HARRISBURG, DAUPHIN COUNTY (WBRE/WYOU-TV) In a press conference Thursday evening, Governor Tom Wolf outlined actions for reforms in the Commonwealth. \"Today, I am taking steps to address concerns a pahomepage.com", "2020-06-05T19:00:00.000Z": "Today the final Pennsylvania counties moved out of the red phase and into the yellow phase of reopening.\n\nThese counties were the hardest hit by COVID-19. It is important that residents proceed with caution.\n \nPlease continue social distancing and wearing cloth masks in public.", "2020-06-05T18:31:10.000Z": "Effective today, all 67 Pennsylvania counties are either in the yellow or green phase of reopening and @GovernorTomWolf announced that 12 additional counties will move to green at 12:01 a.m., June 12. Gov. Wolf: 12 More Counties Going Green on June 12 Effective today, all 67 Pennsylvania counties are either in the yellow or green phase of reopening and Governor Tom Wolf announced that 12 additional counties will move to green at 12:01 a.m., June... governor.pa.gov", "2020-06-05T18:13:17.000Z": "I thank every Pennsylvanian for everything you have done to slow the spread of this deadly illness.\n \nThank you for the sacrifices you have made. Thank you for stepping up to help your neighbors. Plan for Pennsylvania | Governor Tom Wolf Governor Wolf's plan for Pennsylvania's relief, reopening, and recovery from the COVID-19 pandemic. governor.pa.gov", "2020-06-05T18:13:16.000Z": "NEW: These counties will move from the yellow to green phase of reopening June 12 - Adams Beaver Carbon Columbia Cumberland Juniata Mifflin Northumberland Union Wayne Wyoming York", "2020-06-05T16:00:02.000Z": "Now in effect: Outdoor dining is open in counties in the yellow phase of reopening.\n\nFor counties in the green phase of reopening, indoor dining is also open at 50% occupancy.\n \nMore information: http:// on.pa.gov/3c77gmL", "2020-06-05T14:00:00.000Z": "Today we remember lives we have lost to gun violence.\n \nFrances and I send our heartfelt condolences to all Pennsylvanians mourning someone they loved. : 2019 @MomsDemand rally in the Capitol.", "2020-06-05T12:33:29.000Z": "More counties moved into the green phase of reopening today, and all remaining red counties moved into yellow phase.\n\nEven with fewer restrictions, PA'ians are still urged to use caution to prevent the spread of #COVID19 .\n \nLearn more about each phase: http:// governor.pa.gov/plan-for-pennsylvania  .", "2020-06-05T12:05:24.000Z": "The steps we are taking were recommended by @PALegBlkCaucus , President Obama's Task Force on 21st Century Policing, and by the black leaders I have been speaking with across Pennsylvania. \n\nThese actions are just the beginning.", "2020-06-05T12:05:23.000Z": "Yesterday I took action to address violence and oppression against Pennsylvanians of color.\n\nTo start, I'm directing state police and the municipal police training commission to review/revise their training curriculum. We must thoroughly review and revise use-of-force training.", "2020-06-03T19:03:00.000Z": "I'm at today's March Against Injustice and Gun Violence 2020 in Harrisburg in solidarity with our community.\n \nBlack lives matter. Racism must end. I am here to listen.", "2020-06-03T14:57:13.000Z": "Just announced: Preliminary School Reopening Guidance\n\nWe expect students to return to classrooms in some capacity for the 2020-21 school year.\n\nThis guidance will help school leaders build a framework that best meets the needs of their school communities. Preliminary School Reopening Guidance A starting point for school leaders to consider in reopening preparations. education.pa.gov", "2020-06-02T14:49:51.000Z": "Wolf: 'We need to recognize that we have a lot of work to do to address the ills that the protests are about' Wolf: 'We need to recognize that we have a lot of work to do to address the ills that the protests... America needs to correct the deep-seated racism that's caused widespread unrest and left Philadelphia's neighborhoods in a state of devastation, Gov. Tom Wolf said during a visit to the city phillytrib.com", "2020-06-02T23:00:00.000Z": "Less than an hour left to cast your vote in the PA presidential primary election. Voting at the polls? Get to your polling place by 8 PM: http:// votesPA.com/polls . Voting by mail ballot? Return your ballot to your county election office by 8 PM: http:// votesPA.com/county .", "2020-06-02T17:00:24.000Z": "If your ballot is lost, damaged or destroyed, you can vote in person at your polling place on election day using a provisional ballot. Find your polling place for the primary election on June 2: http:// votesPA.com/Polls  #votesPA  #ReadyToVotePA", "2020-06-02T11:30:28.000Z": "If you are going to a polling place on election day, make sure you are practicing social distancing by staying 6 feet away from other people.  \n\nRead more on how to protect yourself: http:// on.pa.gov/AtThePolls", "2020-06-02T12:31:28.000Z": "Casting your vote by mail ballot? You have until 8 PM to drop it off in person at your county election office: http:// votesPA.com/county . Contact Your Election Officials votespa.com", "2020-06-02T12:31:27.000Z": "Today is the Pennsylvania primary election.\n\nPlease practice social distancing and remember to thank your poll workers if you're voting at a polling place today. Find your polling place and learn how to stay safe: http:// on.pa.gov/AtThePolls .", "2020-06-02T11:29:25.000Z": "Today is the presidential primary election in PA! If you're heading to the polls to vote: Check your voter status: http:// votesPA.com/status . Confirm the location of your polling place: http:// votesPA.com/polls . Learn how to stay safe: http:// on.pa.gov/AtThePolls .", "2020-06-01T22:47:02.000Z": ". @GovernorTomWolf this afternoon amended his May 30 disaster emergency declaration to add Erie, Delaware, and Montgomery counties to provide all necessary assistance to these counties as they respond to the escalation of protests. Gov. Wolf Amends Emergency Declaration to Add Erie, Delaware and Montgomery Counties for Assistance... Governor Tom Wolf this afternoon amended his May 30 disaster emergency declaration to add Erie, Delaware and Montgomery counties to provide all necessary assistance to these counties as they respond... governor.pa.gov", "2020-06-01T22:37:57.000Z": ". @GovernorTomWolf today signed an executive order extending the deadline for county election offices in Allegheny, Dauphin, Delaware, Erie, Montgomery, and Philadelphia counties to receive absentee or mail-in ballots by mail to 5 p.m. June 9. Gov. Wolf Signs Executive Order Extending Mail Ballot Deadline in Six Counties to June 9 Amid a surge in mail-in ballots, the COVID-19 public health emergency and civil disturbances in six counties, Governor Tom Wolf today signed an executive order extending the deadline for county... governor.pa.gov", "2020-06-01T21:14:36.000Z": "Touring Philadelphia with community business owners. \n\nShortly, I will speak about protests across Pennsylvania and condemn racism, oppression, and injustice.", "2020-06-01T21:13:39.000Z": "I listened to several generations of black clergy share their perspectives. \n \nTwo major topics they brought up are a need for more jobs and mental health services in the community.", "2020-06-01T19:52:30.000Z": "Taking in the damage at ShopRite on 52nd Street in Philadelphia with @RepDwightEvans , @SenHughesOffice , and business owners.\n \nThis is the result of riots and looting by people who took advantage of unrest over the weekend.", "2020-06-01T19:38:05.000Z": "Socially distanced greetings with @PhillyPolice Chief Danielle Outlaw.\n \nChief Outlaw has spoken out to condemn the death of George Floyd. She reported that this weekend's protests were peaceful -  the criminal activity we saw was not a part of protests, according to police.", "2020-06-01T18:09:53.000Z": "In Philadelphia today to talk about how we can support the black community during this difficult time.\n\nFirst stop: Meeting with @PhillyMayor & @PhillyPolice . \n\nWe know people are hurting. We must move toward ending racism and promoting healing while keeping Pennsylvanians safe.", "2020-06-01T14:02:10.000Z": "Tomorrow is our primary election and the last day to submit your voted mail ballot. Voting by mail ballot? Return your mail ballot in person: http:// VotesPA.com/MailBallot  Voting at the polls? Find your polling place and learn how to stay safe: http:// on.pa.gov/AtThePolls", "2020-05-31T23:43:40.000Z": "Our statement to stop the senseless violence & ensure the #Peaceful message of ending the generations of #systemicracism in law enforcement is being heard loud & clear. #GeorgeFloydProtests  #SayHisName Pennsylvania Legislative Black Caucus calls for peaceful protests and justice in George Floyd case PHILADELPHIA, May 31 - The Pennsylvania Legislative Black Caucus issued the following statement on the ongoing protests in Philadelphia: \"George Floyd. Breonna Taylor. Antwon Rose.... pahouse.com", "2020-05-30T22:08:34.000Z": "Gov. Wolf on Pa. protests about Floyd death: 'We all must look out for each other' Gov. Wolf on Pa. protests about Floyd death: 'We all must look out for each other' The governor said the state has offered help to municipalities \"to keep our communities from suffering from additional violence and pain. \" pennlive.com", "2020-05-31T22:19:55.000Z": "Working with @PEMAHQ and @PADMVA , at the request of municipalities, we activated @PANationalGuard members yesterday to keep our communities safe.\n\nOver 600 Guardsmen have been placed on state active duty to provide support to local law enforcement. Pa. National Guard ready to support local law enforcement FORT INDIANTOWN GAP, Pa. - Under the authority of Governor Tom Wolf and at the direction of the Pennsylvania Emergency Management Agency, the Pennsylvania National Guard has placed over 600 Guardsmen pa.ng.mil", "2020-05-31T18:00:59.000Z": ". @GovernorTomWolf today provided an update on the steps the commonwealth is taking in response to violence and looting following peaceful protests across Pennsylvania over the weekend to condemn racism, oppression, and injustice. Gov. Wolf Addresses Protests, Provides Update on Commonwealth Response Governor Tom Wolf today provided an update on the steps the commonwealth is taking in response to violence and looting following peaceful protests across Pennsylvania over the weekend to condemn... governor.pa.gov", "2020-05-31T17:46:41.000Z": "I don't want to lose sight of why we are here.\n\nI want to again send my condolences to the family and friends of George Floyd, and everyone impacted by oppression, racism, and violence.\n\nEvery day, in every corner of our society, we need to work at eliminating racism.", "2020-05-31T17:46:40.000Z": "As you exercise your rights today, do it in a way that honors our democracy.\n\nSpeak your mind, and speak it with peace.", "2020-05-31T17:46:39.000Z": "Today, many will gather to protest the murder of George Floyd.\n\nThey will also call attention to the crying need for all of us to rededicate ourselves to the commonwealth we deserve.\n\nOne that is decent, equal, and fair to all.", "2020-05-31T17:00:01.000Z": "Today at 1:30 PM, @GovernorTomWolf will address protests taking place across PA over the weekend to condemn racism, oppression, and injustice and provide an update on actions the administration is taking to keep Pennsylvanians safe. Watch live at http:// governor.pa.gov/live . Pennsylvania Governor's Office LIVE Watch the live stream from the Office of the Governor. governor.pa.gov", "2020-05-31T03:34:13.000Z": "This declaration authorizes the commonwealth and its agencies to assist municipalities in their response to de-escalate violence and keep our communities safe: http:// governor.pa.gov/newsroom/gov-w olf-signs-emergency-declaration-to-assist-municipalities-during-protests/ ", "2020-05-31T03:34:12.000Z": "People have every right to speak out and demonstrate, but it's unacceptable to take advantage of protests to incite violence, harm others, and destroy property.", "2020-05-31T02:15:59.000Z": ". @GovernorTomWolf announced this evening that the Commonwealth Response Coordination Center has supplemented center staff to maintain situational awareness of the protests taking place in Philadelphia, Pittsburgh, Harrisburg and other parts of the state. Gov. Wolf: Commonwealth Response Coordination Center Activated in Response to Protests Governor Tom Wolf announced this evening that the Commonwealth Response Coordination Center has supplemented center staff to maintain situational awareness of the protests taking place in Philadelp... governor.pa.gov", "2020-05-31T01:10:54.000Z": "We need more peace - not more violence in Philadelphia.\n\nThe vast majority of protesters today came out to be heard, not to harm anyone. #phillyprotest  #Philly My statement: https:// evans.house.gov/media-center/p ress-releases/evans-what-philly-needs-peace-not-more-violence ", "2020-05-30T21:58:35.000Z": "Please stay safe. Remember: we all must look out for each other as we seek to make our commonwealth more just and fair for everyone.", "2020-05-30T21:58:34.000Z": "Throughout Pennsylvania, people are protesting violence and injustice that occurs far too often against people of color.\n\nEveryone should speak out. No one should be at risk of harm because of oppression or racism.", "2020-05-28T17:45:55.000Z": "Beaches in Pa. state parks to open for swimming next week; most pools are expected to open in mid-June Beaches in Pa. state parks to open for swimming next week; most pools are expected to open in... The Pennsylvania Department of Conservation and Natural Resources announced reopening plans on Thursday amid the coronavirus pandemic. pennlive.com", "2020-05-30T13:03:07.000Z": "Please - no matter what phase of reopening your county is in - continue to take safety precautions like wearing a cloth mask in public and washing your hands. Plan for Pennsylvania | Governor Tom Wolf Governor Wolf's plan for Pennsylvania's relief, reopening, and recovery from the COVID-19 pandemic. governor.pa.gov", "2020-05-30T13:03:06.000Z": "I want Pennsylvanians to - as safely as possible - get back to the activities they most enjoy.\n \nRemember that as long as #COVID19 is a threat, no social activity outside your home where you will run into others is completely without risk of catching this virus.", "2020-05-29T20:33:37.000Z": "Today I signed a budget that sustains education and supports communities amid the pandemic.\n\nThis is an encouraging step in the right direction. But more needs to be done to ensure PA has the resources it needs to protect key programs and investments. http:// on.pa.gov/2XG3onI", "2020-05-29T19:16:25.000Z": "Sending my condolences to the friends and family of George Floyd.\n\nEvery day, in every corner of our society, we need to work at eliminating racism.\n\nThat means we need to do our part to address racism - from the smallest thought to the biggest action - here in Pennsylvania, too.", "2020-05-29T18:11:07.000Z": "PA will now allow outdoor dining in the yellow phase of reopening, and indoor dining (with safety measures in place) in the green phase of reopening.\n \nIn all phases, there are restrictions on large gatherings:\nYELLOW = No more than 25 people\nGREEN = No more than 250 people", "2020-05-29T18:11:06.000Z": "NEW: These counties will move from the yellow to green phase of reopening June 5 - Allegheny Armstrong Bedford Blair Butler Cambria Clinton Fayette Fulton Greene Indiana Lycoming Mercer Somerset Washington Westmoreland", "2020-05-28T14:00:01.000Z": "We're making progress against #COVID19 and beginning to cautiously reopen thanks to the efforts of Pennsylvanians.\n \nThank you for doing your part and for continuing to take precautions to keep your neighbors safe.", "2020-05-29T14:00:07.000Z": "Don't forget there are many options to feed you and your family during #COVID19 : WIC Farmers' Market Nutrition Program Congregate and Home-Delivered Meals Local food banks School Nutrition Programs Temporary Assistance for Needy Families", "2020-05-29T13:15:37.000Z": "Today the first counties moved to the green phase of PA's reopening plan.\n \nSeveral other counties moved from red to yellow today. The counties that remain in the red phase are the ones that have been hardest hit by #COVID19 .\n \nMore on PA's reopening plan: http:// governor.pa.gov/plan-for-pennsylvania ", "2020-05-28T21:00:00.000Z": "We've all sacrificed to save lives, and it's worked. But we know that comes at a cost.\n \nTo help minimize the burden on businesses, many federal and state loans and assistance programs are available.\n \nLearn more from @DCEDNews  Funding & Programs - PA Department of Community & Economic Development Funding & Programs To help navigate through the potential financial impact the COVID-19 pandemic has had on Pennsylvania businesses, both the state and dced.pa.gov", "2020-05-28T18:00:01.000Z": "Farmers are at heart of our commonwealth. Thank you for your kind hearts and hard work, Jobo Holstein Farm. Proudly PA | Family dairy farm donates 6,000 gallons of milk to families in need Agriculture is the back bone of Central Pennsylvania. Dairy farms around the state are giving back in a big way to families who may need extra assistance during the pandemic. The Jobo Holstein Farm... local21news.com", "2020-05-28T16:26:11.000Z": ". @GovernorTomWolf announced today that additional shipments of testing supplies have been sent to hospitals across Pennsylvania this week and that more than 67,000 patients have been tested since March. Wolf Administration Distributes Testing Supplies to Hospitals, More Than 67,000 Patients Tested... Governor Tom Wolf announced today that additional shipments of testing supplies have been sent to hospitals across Pennsylvania this week. Since March 9, the Pennsylvania Department of Health has... governor.pa.gov", "2020-05-28T16:10:36.000Z": "If your regular unemployment benefits have expired or will expire soon, you can now file a claim for the Pandemic Emergency Unemployment Compensation (PEUC) program.\n \nGet details on PEUC and more in our unemployment benefits guide Guide: Unemployment Benefits This guide will help you navigate the process of applying for unemployment compensation and connect you with additional resources available. pa.gov", "2020-05-28T13:01:11.000Z": "Make sure your voice is heard. Return your mail-in or absentee ballot today. All voted ballots must be RECEIVED in your county elections office by 8 pm on June 2. #votesPA Find your county election office and check their hours of operation: http:// votesPA.com/County", "2020-05-28T12:09:21.000Z": "When talking to kids about #COVID19 , give them: your full attention space to share info in an age-appropriate manner reassurance that adults are helping\n\nNeed help finding the right things to say? Tips + resources: http:// education.pa.gov/COVID19  #MentalHealthAwarenessMonth", "2020-05-28T12:00:01.000Z": "We know that social distancing saves lives.\n \nI thank every Pennsylvanian for doing their part to prevent the spread of #COVID19 , and encourage everyone to continue taking precautions until this deadly virus is no longer putting people in harm's way.", "2020-05-27T20:13:28.000Z": "As we reopen our commonwealth, we're also reopening restaurants and bars. Red phase: Carry-out and delivery only Yellow phase: Outdoor dining permitted (effective 6/5) Green phase: Indoor dining permitted with safety guidance in place\n\nMore: http:// on.pa.gov/3c77gmL", "2020-05-27T19:36:03.000Z": "Pittsburgh's @hellodayowls went from making backpacks to producing protective face shields for hospitals  @ThinkingPutty in Norristown made hand sanitizer Employees at Braskem America in Delaware Co. stayed at work for 28 days to make materials for life-saving equipment", "2020-05-27T19:36:02.000Z": "Today I want to shine the spotlight on a few PA businesses that have stepped up to help others during #COVID19 : Textile maker Gitman Brothers in Schuylkill Co. created antimicrobial hospital gowns ‍ @NewPigEnergy of Tyrone expanded operations to make full-face shields", "2020-05-27T15:55:25.000Z": "Businesses open in yellow phase can increase to 75% occupancy Businesses with closed physical locations can open to 50% capacity Businesses should consider special accommodations for vulnerable staff Businesses + individuals must follow CDC and @PAHealthDept guidance", "2020-05-27T15:55:24.000Z": "On Friday, the first Pennsylvania counties move into the green phase of #COVID19 reopening. \n\nSo what does \"green\" mean?  [THREAD]", "2020-05-27T14:01:25.000Z": "Have you returned your voted mail ballot to your county election office?\n\nRemember: your county must receive your voted mail ballot by 8 p.m. on June 2. Learn more at http:// VotesPA.com/MailBallot . Yes 62.3% Not yet", "2020-05-27T12:00:01.000Z": "Q: If I'm wearing a cloth mask, does that mean I don't have to practice social distancing?\n\nA: No, wearing a mask isn't a substitute for social distancing. Masks should be used in addition to keeping space between you and others", "2020-05-27T12:00:00.000Z": "I've said it, before but it's worth repeating: No Pennsylvanian should go hungry.\n \nFind food assistance resources available in your community at http:// agriculture.pa.gov/Food_Security .", "2020-05-26T19:09:45.000Z": "Employees and customers: Here's how you can report #COVID19 health and safety violations: File a complaint with a local health department or a law enforcement agency Submit this form to @PAHealthDept : http:// on.pa.gov/2A8GlK8  File a complaint at http:// OSHA.gov", "2020-05-26T19:09:44.000Z": "Thank you, @RepKenyatta , for standing up for our essential workers.\n\nEssential workers are our family members, our friends, and our neighbors.\n\nI'm committed to ensuring the safety of all Pennsylvanians as we reopen our commonwealth. From NowThis", "2020-05-26T17:30:00.000Z": "All remaining counties in the red phase are expected to move to the yellow phase by June 5.\n \nBusinesses operating in these counties are asked to do so under strict guidelines to keep PA'ians safe and healthy.\n \nSee the complete guidance for businesses at http:// pa.gov/covid-19 .", "2020-05-24T18:57:58.000Z": "L&I has discovered scam attempts using personal information to apply for Pandemic Unemployment Assistance (PUA) benefits. Info will be sent to all PUA claimants via U.S. mail to provide further guidance if they did not submit a PUA application.\n\nInfo: https:// uc.pa.gov/Fraud/Pages/de fault.aspx ", "2020-05-26T15:34:14.000Z": "Thank you to all Pennsylvanians for doing your part against #COVID19 .\n \nBecause of your diligence, our case count continues to trend downward. We are making progress.", "2020-05-26T15:34:13.000Z": "On #MemorialDay yesterday, I spent a lot of time thinking about Pennsylvanians who paid the ultimate sacrifice serving in our military.\n \nTheir lives and their sacrifices are not forgotten.", "2020-05-23T16:00:00.000Z": "Help is always available for Pennsylvanians struggling with opioid use disorder. #NotAlone  Chat online w/ @PADrugAlcohol : http:// on.pa.gov/2uShojF  PA's Get Help Now Hotline: 1-800-662-4357  @SMARTRecovery online meetings: http:// bit.ly/3bpBtNx Guide: Treating Heroin and Opioid Use Disorder Governor Wolf and his administration are working to provide real solutions to save lives. This guide will connect you with heroin and opioid use disorder services. pa.gov", "2020-05-26T14:00:40.000Z": "Our young Pennsylvanians make me proud every day.\n \nThank you, Joey Swentosky, for using your time and energy to collect food for your community. 11-year-old to hold annual food drive helping neighbors in need during COVID-19 BELLEFONTE, Pa. (WJAC) - 11-year-old Joey Swentosky has been holding food drives to benefit the Bellefonte Faith Centre for the last four years and he's continuing the tradition on Saturday, but it's... wjactv.com", "2020-05-26T12:00:00.000Z": "I'm voting by mail ballot in the June 2 primary election. You can, too, if you sign up before today's 5 p.m. deadline.\n\nRegistered voters can sign up, track mail ballot progress, and find their country election office at http:// VotesPA.com/MailBallot .", "2020-05-25T15:00:00.000Z": "Reminder for PA'ians: the #COVID19 resource guide is the best place to go for up-to-date information like: Case numbers What happens in the red, yellow, and green phases When to wear a mask and why Food assistance Financial help with bills Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-05-25T12:00:01.000Z": "Happy #MemorialDay , Pennsylvania.\n \nWe remember and honor those who made the ultimate sacrifice protecting our commonwealth and our country. Did you know? Boalsburg - right here in PA- is considered the birthplace of Memorial Day. #PAProud", "2020-05-24T13:30:00.000Z": "Every Pennsylvanian should feel proud of the work we did to flatten the curve.\n\nWe've all sacrificed to save lives, and it's worked.\n\nBut we're not done yet. Together we can keep fighting for the health of our neighbors, our friends, and our families.", "2020-05-22T12:00:00.000Z": "Today 12 more counties moved from Stay at Home Orders (red) to the Aggressive Mitigation (yellow) phase of my #COVID 19 reopening plan.\n\nThis loosening of restrictions will allow more businesses to open with safety guidance in place.\n\nMore details here: http:// governor.pa.gov/plan-for-pennsylvania  .", "2020-05-23T12:00:00.000Z": "Mental health resources are available for Pennsylvanians. Coping with #COVID19 stress: http:// bit.ly/covid-coping  COVID-19 resources: http:// mhnational.org/covid19   @CrisisTextLine : Text 'PA' to 741741  @distressline : 800-985-5990 PA's support helpline: 855-284-2494", "2020-05-22T23:58:34.000Z": "Centre County requested to delay their move to the green phase by one week to June 5th.\n\nNext week, we are planning to announce that Centre County will move to the green phase effective 6/5.\n \nMore on the announcements we made today Gov. Wolf Adds Eight Counties to Yellow and 17 to Green on May 29, Remainder to Yellow on June 5 Furthering his plan for reopening Pennsylvania, Governor Tom Wolf today announced eight additional counties will move to yellow and 17 to green, effective at 12:01 a.m., May 29. governor.pa.gov", "2020-05-22T21:34:36.000Z": "Today I announced the first PA counties moving from the yellow to green phase of reopening.\n\nThe hallmark of the green phase is self-responsibility. Above all else, it's on us as Pennsylvanians to be entrusted with using good judgment\n\nMore details: http:// on.pa.gov/2TxG8a3", "2020-05-22T20:12:05.000Z": "These counties will move from the red to yellow phase of reopening May 29: Dauphin Franklin Huntingdon Lebanon Luzerne Monroe Pike Schuylkill", "2020-05-22T20:12:04.000Z": "I'm announcing these counties will move from the yellow to green phase of reopening May 29: Bradford Cameron Clarion Clearfield Crawford Elk Forest Jefferson Lawrence McKean Montour Potter Snyder Sullivan Tioga Venango Warren", "2020-05-22T18:00:01.000Z": "Join me in celebrating the graduating class of 2020 for their hard work and sacrifice, especially now. The adversity you have faced will make you stronger in the future. Congratulations graduates! From Governor Tom Wolf", "2020-05-22T16:30:00.000Z": "Domestic violence help is available. Call the @ndvh hotline at 1-800-799-7233, text LOVEIS to 22522, or log on to chat at http:// thehotline.org . Uber, Pennsylvania Coalition Against Domestic Violence Partner to Provide Free Rides to Domestic... The free rides can be used by PCADV's local domestic violence programs to assist victims seeking support services or fleeing violent situations in Pennsylvania fox43.com", "2020-05-22T16:00:01.000Z": "When we're at our most vulnerable, it's important to know we're loved and not alone.\n\nThank you, Stephanie, for keeping the spirit of your uncle alive by volunteering your time to help #COVID19 patients connect with loved ones when they need it the most. Philadelphia-area health-care students are helping patients in isolation connect with loved ones The project hits home for Temple University medical student Stephanie Javier-Fagbemi, whose uncle died from complications from COVID-19 in isolation, denying the family of the ability to \"say... inquirer.com", "2020-05-22T13:34:19.000Z": "We couldn't get through this pandemic without our essential workers.\n \nThis #143DayInPA , join me in thanking essential workers for their hard work and sacrifice. Quote Tweet PA Department of Community & Economic Development @PADCEDnews Happy #143DayInPA ! Pennsylvania challenges you to show essential workers and neighbors some gratitude today. Share your acts of kindness with us by using the hashtag #143DayInPA . http:// pa.gov/143-day", "2020-05-21T20:30:00.000Z": "This isn't partisan. All states, no matter which side of the aisle their leadership falls on, are taking measured steps to reopen safely. \n \nReopening is a process because dealing with a global pandemic is a process.\n \nMore about PA's reopening plan: http:// governor.pa.gov/plan-for-Penns ylvania  .", "2020-05-21T18:39:36.000Z": "The @GovernorTomWolf Administration will be awarding more than $9 million to non-profit entities for projects to fight hunger and prevent food waste. Wolf Administration Awards $9.6 million in Grants to Help the Charitable Food System The Pennsylvania Department of Environmental Protection/Wolf Administration will be awarding more than $9 million to non-profit entities for projects to fight hunger and prevent food waste. governor.pa.gov", "2020-05-21T19:36:25.000Z": "Proud of @ChesterUplandSD , @LincolnHS801 , and Building 21 HS students for being named @MTV  @WhenWeAllVote  #PromChallenge winners.\n\nThese students integrated voter registration in creative ways and will be honored at #MTVPromathon tomorrow. From Michelle Obama", "2020-05-21T17:45:00.000Z": ". @GovernorTomWolf today signed legislation allowing the temporary sale of cocktails-to-go from bars, restaurants, or hotels with a liquor license. The law takes effect immediately. Gov. Wolf Signs Cocktails-to-Go Bill Governor Tom Wolf today signed House Bill 327, now Act 21 of 2020, allowing the temporary sale of cocktails-to-go from bars, restaurants or hotels with a liquor license. The law takes effect immedi... governor.pa.gov", "2020-05-21T13:40:04.000Z": "If your business is located in a yellow phase county or will be turning yellow tomorrow, visit our life-sustaining business list + FAQs to see if you are approved to open in-person operations. FAQs: http:// ow.ly/yMxQ50zMyum  Business List: http:// ow.ly/eKtw50zMyun", "2020-05-21T13:59:59.000Z": "I'm in awe of all the ways Pennsylvanians are stepping up to help others. Thank you, Mindi Hoagey. HOMETOWN HERO: Montgomery County ER nurse serving meals to community in free time An emergency room nurse in Montgomery County, Pennsylvania is using her free time to serve meals to those in her community.", "2020-05-21T12:00:00.000Z": "Voting by mail ballot in the June 2 primary election? Don't wait until June 2 to return your ballot by mail or in person.\n\nFind with your county election office here: http:// VotesPA.com/County .", "2020-05-20T22:51:42.000Z": "Now more than ever, access to secure, safe housing is essential.\n \nHere's what we're doing in Pennsylvania: Ordered a halt to evictions and foreclosures. Prohibited the shut off of utilities due to failure to pay.", "2020-05-20T18:00:01.000Z": "When we wear a mask, we're telling our neighbors we care about protecting their health.\n \nIt is critical that those of us who can wear masks do so when we leave our homes. If you're going to a Pennsylvania business, you must wear a mask to enter. #MaskUpPA GIF", "2020-05-20T16:00:01.000Z": "Six years ago today, marriage equality was recognized in Pennsylvania. Happy anniversary! #LoveIsLove", "2020-05-20T14:31:07.000Z": "Heading outdoors for some fresh air? Here's what's available at state parks and forests throughout Pennsylvania. Keep up with a state park or forest near you: http:// on.pa.gov/ParksAndForest sStatus ", "2020-05-13T14:48:20.000Z": "The department has chosen to work with Sara Alert, a new data collection platform, and has requested a system modification to the platform to collect sexual orientation and gender identity data. Gov. Wolf announces inclusion of gender identity, sexual orientation in COVID-19 data collection HARRISBURG, Pa. (WHTM) - Governor Tom Wolf is announcing ways the LGBTQ community will be counted in COVID-19 data. As counties in the commonwealth move from the red to yellow phases, the Departmen abc27.com", "2020-05-19T19:15:00.000Z": ". @GovernorTomWolf announced that starting today, businesses and employees in the real estate industry may conduct limited business-related activities statewide and provided guidance for this industry to operate in red phase and yellow phase counties. Governor Wolf Announces Real Estate Industry May Conduct Limited Business Transactions Statewide Governor Tom Wolf today announced that starting today, businesses and employees in the real estate industry may conduct limited business-related activities statewide and provided guidance for this... governor.pa.gov", "2020-05-19T19:00:01.000Z": "It's farmers market season in Pennsylvania. @PAAgriculture has guidance in place to keep customers and employees safe during #COVID19 . Are you a WIC recipient? Find out more about the Farmers' Market Nutrition Program: http:// agriculture.pa.gov/foodsecurity Map - Farm Markets | PA Farm Markets pafarm.com", "2020-05-19T15:41:27.000Z": "With @PATreasurer today to announce that @PaRevenue will start issuing early property tax and rent rebates to help older homeowners, renters, and people with disabilities affected by the #COVID19 pandemic. Apply for a rebate for payments made in 2019: http:// revenue.pa.gov/ptrr", "2020-05-19T15:05:14.000Z": ". @GovernorTomWolf and @PATreasurer Torsella today announced that many older homeowners, renters, and people with disabilities will receive early rebates through the Property Tax/Rent Rebate Program. Gov. Wolf, Treasurer Torsella Announce Property Tax/Rent Rebates Arriving Early to Help Seniors,... Governor Tom Wolf and Treasurer Joe Torsella today announced that many older homeowners, renters and people with disabilities will receive early rebates through the Property Tax/Rent Rebate Program. governor.pa.gov", "2020-05-19T13:30:32.000Z": "As more PA counties move from the red to yellow phase of reopening, we ask everyone to proceed with caution. #COVID19 is still here, and it is extremely contagious. Social distancing, wearing masks in public, and practicing good health habits prevent spreading the virus.", "2020-05-19T12:00:01.000Z": "The deadline to sign up to vote by mail ballot in the June 2 primary election is only a week away. Sign up today at http:// VotesPA.com/ApplyMailBallot .", "2020-05-12T14:00:12.000Z": "\"What's wrong with my UC claim?\" troubleshooting guide explains common issues that many claimants may experience please review suggested action steps that can help speed up the process or fix the issue. Access guide here: http:// bit.ly/2YXrOuY", "2020-05-18T20:00:20.000Z": "Do you want to vote on June 2? TODAY is the last day to register to vote. PA voters applying online have until 11:59 pm: http:// register.votesPA.com  #votesPA  #ReadyToVotePA  #TrustedInfo2020", "2020-05-18T18:29:58.000Z": "This weekend, some individuals mistakenly received an email about the Pandemic Emergency Unemployment Compensation (PEUC) program. If you received the PEUC email & it does not apply to your situation, please disregard + continue filing your biweekly UC claims. No action is needed", "2020-05-18T17:38:24.000Z": "Today I'm with @PEMAHQ and @PANationalGuard to talk about their role in protecting Pennsylvanians during #COVID19 .\n \nThe training and planning they do year-round and all of their experience is being acted upon now. We are in good hands.", "2020-05-18T16:00:01.000Z": "Frances and I send warm gratitude to all emergency responders for #EMSWeek .\n \nYour knowledge, dedication, and sacrifice saves lives every day, and has been especially crucial during #COVID19 .", "2020-05-18T13:57:08.000Z": "Since #COVID19 is highly contagious, Pennsylvanians should still minimize contact with others as much as possible to prevent illness.\n\nMore details on the plan to reopen Pennsylvania Plan for Pennsylvania | Governor Tom Wolf Governor Wolf's plan for Pennsylvania's relief, reopening, and recovery from the COVID-19 pandemic. governor.pa.gov", "2020-05-18T13:57:07.000Z": "What opens up when a county moves to the yellow phase of reopening? More businesses (must continue telework where feasible, in-person operations must follow safety orders) Child care (complying with guidance) Retail shopping (curbside/delivery preferred)", "2020-05-18T12:00:00.000Z": "Only a few hours left to register to vote in the June 2 primary election. The deadline to register is tonight at 11:59 PM. It only takes a few minutes to register to vote or update your registration at http:// Register.VotesPA.com .", "2020-05-17T15:38:30.000Z": "Pandemic Emergency Unemployment Compensation (PEUC) is now available! \n\nFYI: Claimants still within their benefit year do NOT need to apply. They will automatically be enrolled + should begin filing biweekly claims. \n\nApply now: https:// uc.pa.gov/unemployment-b enefits/file/Pages/Filing-for-PEUC.aspx ", "2020-05-17T15:00:00.000Z": "We can't have a strong recovery from #COVID19 without maintaining a healthy population.\n \nI'm prioritizing people in my reopening plan by gradually lifting restrictions.", "2020-05-17T12:00:00.000Z": "Are you registered to vote in the June 2 primary election? Check your voter status at http:// VotesPA.com/Status .\n\nNot yet registered? Need to update your information? Visit http:// Register.VotesPA.com to get started.", "2020-05-16T13:00:00.000Z": "Only three days left to register to vote in the June 2 primary election. Register to vote or update your registration today at http:// Register.VotesPA.com .", "2020-05-15T21:01:32.000Z": "Signed a bill for $50 million in medical supplies for hospitals, nursing facilities, and emergency medical services Signed an executive order to provide civil immunity for health care workers during #COVID19 For more info visit Plan for Pennsylvania | Governor Tom Wolf Governor Wolf's plan for Pennsylvania's relief, reopening, and recovery from the COVID-19 pandemic. governor.pa.gov", "2020-05-15T21:01:31.000Z": "Hospitals and medical workers have seen the worst of this pandemic.\n \nHere's what we've done to help: Created the HELP program to provide short-term financial relief for hospitals Signed an order to allow the transfer of critical medical equipment between hospitals", "2020-05-15T19:30:00.000Z": "Today, I announced that these 12 counties will move from the red phase to the yellow phase of reopening on Friday, May 22: Adams Beaver Carbon Columbia Cumberland Juniata Mifflin Perry Susquehanna Wyoming Wayne York\n \nHere's what each phase means", "2020-05-15T18:05:29.000Z": "Through our social distancing efforts, we have not only reversed a trajectory toward a spike in new cases - we have cut it in half.\n \nSo please, keep up your efforts in the fight so we can continue to move more counties to yellow.\n \nMore info: Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-05-15T18:05:28.000Z": "Today, I announced the third round of counties moving from the red to yellow phase.\n \nBeginning at 12:01 a.m. Friday, May 22nd the following 12 counties will join the other 37 yellow phase counties. Adams Beaver Carbon Columbia Cumberland Juniata Mifflin", "2020-05-13T16:13:23.000Z": "FYI: The Pandemic Unemployment Assistance (PUA) Program is a system + works differently than our regular UC benefit system. \n\nTo help you navigate this change, here is a quick walkthrough of some of the key differences in our PUA system. \n\n For more: http:// bit.ly/2WuRAoR", "2020-05-15T14:00:00.000Z": "Make your voice heard in the June 2 primary election: Register to vote or update your registration: http:// Register.VotesPA.com  Sign up to vote by mail: http:// VotesPA.com/ApplyMailBallot OR Find a polling place: http:// VotesPA.com/Polls", "2020-05-15T13:18:34.000Z": "Today 13 western counties moved from Stay at Home Orders (red) to the Aggressive Mitigation (yellow) phase of my #COVID19 reopening plan.\n \nThis loosening of restrictions will allow more businesses to open with safety guidance in place.\n \nDetails: http:// governor.pa.gov/plan-for-pennsylvania  .", "2020-05-14T18:00:01.000Z": "Masks add another layer of protection to help stop the spread of #COVID19 .\n\nIt's important that as many people as possible wear masks when leaving home.\n\nAnd if you're going to a supermarket, pharmacy or other life-sustaining business, you must wear a mask to enter the store.", "2020-05-14T16:00:01.000Z": "As counties move from the red to yellow phase, many businesses will be able to resume in-person operations.\n\nTo keep our workers, customers, and communities safe, we have released guidance for those operating in yellow phase counties.\n\nSee the full list  https:// pa.gov/guides/respond ing-to-covid-19/#ForBusinesses ", "2020-05-14T14:00:02.000Z": "Thank you to all the Pennsylvanians who are stepping up to fight COVID-19.", "2020-05-13T17:52:22.000Z": "Mask up, PA!\n\nThere's thing we can all agree on: people working in grocery stores and other essential businesses are putting themselves on the front lines, allowing us to maintain normalcy. Show respect for their work and safety.\nWear a mask.\n\nMore: https:// bit.ly/BeKindMaskUp", "2020-05-14T12:00:01.000Z": "Last week, I signed an executive order to protect PA homeowners and renters as we work together to slow the spread of #COVID19 .\n\nIf you have been wrongfully evicted from your home or have had your property foreclosed, reach out to @PAAttorneyGen : http:// on.pa.gov/AGcomplaint .", "2020-05-08T18:34:46.000Z": "Thank you for helping save lives in the coronavirus pandemic | Gov. Tom Wolf Thank you for helping save lives in the coronavirus pandemic | Gov. Tom Wolf Our infection rate has flattened and is now showing signs of decline. pennlive.com", "2020-05-13T18:32:44.000Z": "We received 1,200 doses of remdesivir to treat patients in hospitals who have #COVID19 + distributed the doses to 51 hospitals across PA. We will continue to work with federal partners to acquire more doses.\n\nRemdesivir isn't a cure for COVID-19 but it may shorten recovery time.", "2020-05-13T17:00:01.000Z": "Thank you to @Pitt_ATHLETICS leaders, @Steelers , @Penguins , and @Pirates for joining together to support #COVID19 vaccine research at @PittTweet .\n\nTo beat this deadly virus, we must continue to work as one team. Pitt coaches, pro sports teams donate $800,000 to Center for Vaccine Research Pitt athletics' leaders, along with the Steelers, Penguins and Pirates, have linked up to financially support the university's Center for Vaccine Research, ... liber.post-gazette.com", "2020-05-13T13:31:10.000Z": "Need food assistance immediately? Text your zip code to 898-211 to speak with a live specialist through PA 211.", "2020-05-13T13:31:09.000Z": "No Pennsylvanian should go hungry. Here's how you can find: Food banks by county WIC Farmers' Market Nutrition Program markets and farm stands Meals for students Home-delivered meals for seniors Food Resources for Pennsylvanians agriculture.pa.gov", "2020-05-13T12:00:00.000Z": "#COVID19 is highly contagious, but we don't know who has it until it's too late.\n \nSome don't show symptoms at all. Others get seriously ill, but not until after they've been carrying it for 2 weeks.\n \nThe safest thing you can do is  limit your chances of exposure. Here's how", "2020-05-12T21:00:42.000Z": "Clearfield County Commissioner Dave Glass knows firsthand how difficult it is to have friends and family suffer from #COVID19 .\n \nHe urges his fellow commissioners and all Pennsylvanians to follow the process laid out by medical professionals.", "2020-05-12T21:00:41.000Z": "[THREAD]\nI want to share stories from real Pennsylvanians with firsthand #COVID19 experience.\n \nKyasha Tyson survived the virus. It caused her extreme pain, but thankfully she recovered.", "2020-05-12T18:30:34.000Z": "Testing is another essential piece of our efforts to protect residents living in nursing homes. \n\nToday we're announcing a robust universal #COVID19 testing strategy for ALL staff + residents in nursing homes that focuses on ensuring testing is accessible, available + adaptable.", "2020-05-12T16:00:00.000Z": "I am so proud of every Pennsylvanian who has helped their neighbors during #COVID19 .\n \nWith the help of 17 volunteers, @EriePlayhouse has turned old costumes into more than 1,500 masks, which they have donated to @UPMC .", "2020-05-12T13:49:58.000Z": "For those struggling with their mental health, we have one message: Your mental health matters and it's okay to reach out for help.\n \nResources: Coping with #COVID19 stress: http:// bit.ly/covid-coping   @CrisisTextLine : Text 'PA' to 741741", "2020-05-12T12:00:00.000Z": "Only two weeks left to sign up to vote by mail in the June 2 primary election. Sign up at http:// VotesPA.com/ApplyMailBallot to join the 1.2 million Pennsylvania voters choosing to vote from home. Already signed up? Track your progress at http:// VotesPA.com/MailBallotStat us  .", "2020-05-11T20:40:15.000Z": "My reopening plan for Pennsylvania is gradual and prioritizes health and public safety.\n \nThe politicians who are encouraging counties to reopen prematurely are putting all of us at risk of resurgence.\n \nHere is our measured approach to reopening, advised by health experts.", "2020-05-11T13:04:02.000Z": "The PA Constitution gives the Governor broad emergency power & his actions have been ruled constitutional multiple times...", "2020-05-11T16:37:40.000Z": "This is not a time to give up.\n \nThis is not time to surrender.\n \nThis is a time to rededicate ourselves to the task of beating this virus.", "2020-05-11T16:37:39.000Z": "I won't sit back and watch residents who live in counties under Stay at Home orders get sick because local leaders cannot see the risks of #COVID19 and push to reopen prematurely.\n \nToday I am announcing consequences for counties that do not abide by the law to remain closed.", "2020-05-11T13:32:38.000Z": "#PressRelease : #Insurance Department Warns of Risks, Increased Liability with Non-Compliance of Business Closure Orders \n\nThis reminder is offered to all Pennsylvania businesses and residents, regardless of what county they reside. #COVID19 Learn more: https:// media.pa.gov/Pages/Insuranc e-Details.aspx?newsid=427 ", "2020-05-11T12:00:00.000Z": "Only one week until the deadline to register to vote in the June 2 primary election. Register or update your registration today at http:// Register.VotesPA.com . Not sure if you're registered? Check your status at http:// VotesPA.com/Status .", "2020-05-10T18:00:00.000Z": "Check out the #COVID19 resource guide to learn about: Cases by county Financial help for PA'ians Food assistance Which counties are under a Stay at Home order What phased reopening means Universal masking Guidance for businesses Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-05-10T13:00:01.000Z": "Wishing a special #MothersDay to my beloved wife Frances. You have been an incredible mother and role model to Katie and Sarah.\n\nAnd thank you to all PA mothers for everything you do for your families - especially during this difficult time.", "2020-05-04T22:07:05.000Z": "Governor encourages Pennsylvania voters to apply for mail-in ballot for June primary election Governor encourages Pennsylvania voters to apply for mail-in ballot for June primary election Gov. Tom Wolf says polling places will be open, but voting by mail is an option for voters who prefer not to cast their ballots in person because of concerns about the coronavirus. wgal.com", "2020-05-09T13:00:00.000Z": "We are finally beginning to reopen our commonwealth.\n\nGetting here hasn't been easy. It has taken diligence, kindness, and hard work from every Pennsylvanian.\n \nThank you for doing what it takes to protect yourself and others from #COVID19 .", "2020-05-08T20:18:52.000Z": "Today, @GovernorTomWolf signed into law House Bill 360, which sets 18 as the minimum age to obtain a marriage license and extends the time period for child care and school employees to obtain their criminal @FBI background certifications. Gov. Wolf Signs Child Marriage Ban, Psychology Compact Bills Governor Tom Wolf signed into law House Bill 360, which sets 18 as the minimum age to obtain a marriage license and extends the time period for child care and school employees to obtain their... governor.pa.gov", "2020-05-08T19:00:00.000Z": "These 13 counties will move from the red to the yellow phase of reopening on Friday, May 15: Allegheny Armstrong Bedford Blair Butler Cambria Fayette Fulton Greene Indiana Somerset Washington Westmoreland \n \nDetails: http:// governor.pa.gov/plan-for-pennsylvania/ ", "2020-05-08T18:03:31.000Z": "As we look ahead, know that I am continuously working with experts and looking at the latest data to make decisions.\n\nAs much as possible, I want things to get things back to normal for all of you. But we can't make rash decisions that puts the health of Pennsylvanians at risk.", "2020-05-08T18:03:30.000Z": "Today I'm announcing that these 13 counties will move from the red phase to the yellow phase of reopening on Friday, May 15: Allegheny Armstrong Bedford Blair Butler Cambria Fayette Fulton Greene Indiana Somerset Washington Westmoreland", "2020-05-08T16:00:00.000Z": "Have you recently filed for unemployment? Here's what you can expect next From PA Department of Labor & Industry", "2020-05-08T12:35:47.000Z": "If you or a loved one are struggling with a substance use disorder, help is available.\n\nThe Get Help Now hotline is a confidential, 24/7 treatment and information service for individuals and families. Call 1-800-662-HELP.", "2020-05-08T12:06:50.000Z": "Today, the first 24 Pennsylvania counties moved from Stay at Home Orders (red) to the Aggressive Mitigation (yellow) phase of my COVID-19 reopening plan.\n\n\nThis loosening of restrictions will allow more businesses to open with safety guidance in place.", "2020-05-07T20:52:46.000Z": "Our farmers keep farming, Our truckers keep trucking, Our grocery stores keep stocking, Our food banks keep distributing.\n\nAccess to good food is an essential part of life. Learn more about food access in PA & find resources at http:// agriculture.pa.gov/foodsecurity", "2020-05-07T17:27:04.000Z": ". @GovernorTomWolf was joined by @PAAttorneyGen today to announce an executive order that protects Pennsylvanians from foreclosures or evictions through July 10. Gov. Wolf, Attorney General Shapiro Announce Protections from Foreclosures and Evictions Through... Governor Tom Wolf was joined by Attorney General Josh Shapiro today to announce that he signed an executive order that protects Pennsylvanians from foreclosures or evictions through July 10. governor.pa.gov", "2020-05-07T17:07:30.000Z": "While my executive order delays foreclosures and evictions, I encourage you to contact your mortgage company or landlord if you're struggling to make payments and for companies to be cooperative.\n\nWe must help each other out so we can focus on slowing the spread of #COVID19 .", "2020-05-07T17:07:29.000Z": "Stable housing is critical to protect public health and safety during the #COVID19 pandemic.\n\nThank you to @PAAttorneyGen , @PAHealthDept , @PADCEDnews , and @PHFAtweets for working to protect families from foreclosures and evictions and providing resources people without housing.", "2020-05-07T17:07:28.000Z": "Pennsylvania homeowners and renters should not have to worry about losing their homes during a pandemic.\n\nThat's why I am signing an executive order to prevent foreclosures and evictions until July 10.\n\nToday's action will help people to stay home and stay safe.", "2020-05-07T15:01:09.000Z": "My top priority is keeping Pennsylvanians as healthy as we possibly can while we reopen the commonwealth.\n\nThat's why I'm following the data, listening to experts, and working to boost resources critical to a safe reopening.", "2020-05-07T15:01:08.000Z": "Tomorrow, 24 counties will move from the red phase to the yellow phase of reopening.\n\nFind out more about how we're making reopening decisions: http:// on.pa.gov/reopening .", "2020-05-07T14:04:21.000Z": "The Pandemic Unemployment Assistance (PUA) System is fully functional. You can now file your weekly PUA certifications. File here: http:// uc.pa.gov/PUA Learn more: https:// media.pa.gov/Pages/Labor-an d-Industry-Details.aspx?newsid=453 ", "2020-05-07T14:07:26.000Z": "The Office of Advocacy and Reform, established by @GovernorTomWolf 's executive order to protect vulnerable populations, today announced the launch of a volunteer think tank comprised of 25 experts to develop a plan to make PA a trauma-informed state. Gov. Wolf: Office of Advocacy and Reform Announces Plan to Build a Trauma-Informed Pennsylvania The Office of Advocacy and Reform, established by Governor Tom Wolf's 2019 executive order to protect Pennsylvania's vulnerable populations, today announced the launch of a volunteer think tank... governor.pa.gov", "2020-05-07T13:31:54.000Z": "Expedited SNAP benefits Given assistance to food banks Provided senior centers with food distribution alternatives Advocated for more WIC funding Established partnerships to increase food supply Increased volunteer efforts\n\nLearn more at http:// agriculture.pa.gov/Food_Security . Food Security in Pennsylvania agriculture.pa.gov", "2020-05-07T13:31:53.000Z": "I'm committed to ensuring PA'ians have access to food. So far during the #COVID19 pandemic we've: Removed administrative barriers for food banks Reduced extra paperwork for those seeking meals Permitted schools to provide free meals Initiated PA's Feeding Task Force", "2020-05-07T12:03:15.000Z": "More information on when to wear a mask and how to make one Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-05-07T12:03:14.000Z": "Experts say wearing a mask lowers the chance of spreading #COVID19 to others.\n\nThat's why we're going to continue to ask Pennsylvanians to wear masks, even as their counties move from the red phase to the yellow phase of reopening.", "2020-05-06T21:00:00.000Z": "Today, @GovernorTomWolf signed an executive order to afford health care practitioners protection against liability for good faith actions taken in response to the call to supplement the health care provider workforce during the COVID-19 pandemic. Gov. Wolf Signs Executive Order to Provide Civil Immunity for Health Care Providers Today, Governor Tom Wolf signed an executive order to afford health care practitioners protection against liability for good faith actions taken in response to the call to supplement the health care... governor.pa.gov", "2020-05-06T19:55:07.000Z": "There's a slew of food resources available for Pennsylvanians, and they're all here waiting for you.\n\nFind more details and see which are right for you: https:// bit.ly/Food4YouPA", "2020-05-06T19:44:37.000Z": "Today, @GovernorTomWolf announced the Commonwealth Civilian Coronavirus Corps, a public service initiative that will support efforts this fall to increase testing and contact tracing and provide critical new job opportunities in the public health sector. Gov. Wolf Outlines Plans to Create Commonwealth Civilian Coronavirus Corps to Support Fall COVID-19... As Pennsylvania plans to safely reopen the economy and recover from COVID-19, Governor Tom Wolf announced the creation of the Commonwealth Civilian Coronavirus Corps, a public service initiative that... governor.pa.gov", "2020-05-06T19:36:44.000Z": "To reopen our economy to its maximum potential, we need to boost our ability to contain #COVID19 .\n\nThe Commonwealth Civilian Coronavirus Corps is my plan to mobilize Pennsylvanians to assist in the fight.\n\nWorking together, we will get through this crisis.", "2020-05-06T19:36:43.000Z": "Announcing today the creation of a civilian corps to help PA prepare to safely reopen the economy and recover from #COVID19 .\n\nThe Commonwealth Civilian Coronavirus Corps will: Expand contact tracing and testing Reemploy people to assist Invigorate call to public service", "2020-05-06T17:00:00.000Z": "If you are affected by #COVID19 and don't qualify for traditional unemployment benefits, you may quality for Pandemic Unemployment Assistance.\n\nFind out more about PUA and apply today at http:// uc.pa.gov/pua .", "2020-05-06T16:21:38.000Z": "Sending a special thank you to our sign language interpreters in honor of National Interpreter Appreciation Day.\n\nThank you for doing your part to keep ALL Pennsylvanians safe and informed during this pandemic. #COVID19", "2020-05-06T14:12:14.000Z": ". @GovernorTomWolf today announced a program to provide free N95 respirator decontamination to healthcare facilities, first responders, and other eligible organizations that may be experiencing a shortage of the respirators due to limited availability. Gov. Wolf: Free N95 Decontamination System for Healthcare Facilities, First Responders Now Available Governor Tom Wolf announced the availability of a program to provide free N95 respirator decontamination to healthcare facilities, first responders, and other eligible organizations that may be... governor.pa.gov", "2020-05-06T14:26:49.000Z": "Thank you @PAAttorneyGen Shapiro for standing up for Pennsylvanians. #ReproductiveFights Quote Tweet AG Josh Shapiro @PAAttorneyGen Today we make our argument in front of SCOTUS in support of the #ACA 's contraceptive guarantee.\n \nIn a historic first - you can listen along.\n\nWe'll be live tweeting the hearing starting at 10am. Join us and share your thoughts with #ReproductiveFights and #HandsOffMyBC . Show this thread", "2020-05-06T12:00:00.000Z": "This Nurses Day, join me in recognizing nursing staff on the front lines of #COVID19 .\n\nNow more than ever, we thank you for expertise, dedication, and sacrifice.", "2020-05-05T18:24:31.000Z": "PA services during social distancing: Report eviction: http:// on.pa.gov/AGcomplaint . Register to vote: http:// Register.VotesPA.com . Vote by mail: http:// VotesPA.com/ApplyMailBallot . Unemployment: http:// on.pa.gov/UC . Pandemic Unemployment Assistance: http:// on.pa.gov/PUA . Filing for PUA uc.pa.gov", "2020-05-05T16:00:01.000Z": "New #COVID19 business guidance for counties in the yellow phase is now available.\n \nCheck here for the latest updates Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-05-05T14:03:34.000Z": "Join me in celebrating all of our hardworking teachers today and every day.\n \nThis has been a tough school year for everyone, including our educators.\n \nThank you for all you do for the future of our commonwealth. #PAThanksTeachers Quote Tweet PA Department of Education @PADeptofEd \"We're proud of you. We're inspired by you. We believe in you.\"\n\nSecretary Rivera and his daughter, Elena, have a special message for educators.  #TeacherAppreciationWeek  #PAThanksTeachers", "2020-05-05T12:44:58.000Z": "Here's what we're looking at before we relax #COVID19 restrictions for a county or region: Number of COVID cases ICU and bed capacity Population density Population over age 60\n\n(continued )", "2020-05-04T21:40:17.000Z": "To continue to limit the spread of COVID-19, @GovernorTomWolf today provided guidance that details procedures businesses must follow to conduct in-person operations in counties slated to move to the yellow phase of reopening on May 8. Gov. Wolf Provides Business Guidance as Counties Move to Yellow Phase on May 8 To continue to limit the spread of COVID-19, Governor Tom Wolf today provided guidance that details procedures businesses must follow to conduct in-person operations in counties slated to move to the... governor.pa.gov", "2020-05-04T03:30:00.000Z": "\"By working together we can combine our strengths to build the capacities we all need.\" Wolf, Cuomo join other governors in efforts for covid-19 equipment Pennsylvania Gov. Tom Wolf and governors from six other Northeast and Mid-Atlantic states Sunday pledged to join forces to build the manufacturing capacity to make coronavirus testing kits, personal... triblive.com", "2020-05-04T20:00:15.000Z": "Governor Tom Wolf and Pennsylvania Secretary of State Kathy Boockvar announced today that nearly one million voters have applied for a mail-in ballot for the June 2 primary election. Read the full update on the primary election: https:// governor.pa.gov/newsroom/nearl y-1-million-pennsylvanians-have-applied-for-a-mail-in-ballot-for-june-2-primary-election/ ", "2020-05-04T19:41:13.000Z": "Voters can prepare for the June 2 primary election by: Checking their voter registration status at http:// VotesPA.com/Status  Registering or updating their registration at http:// Register.VotesPA.com The deadline to register to vote is only two weeks away: May 18 at 11:59 p.m.", "2020-05-04T19:41:12.000Z": "With @PAStateDept today to provide an update on how PA is preparing for the June 2 primary election.\n\nThere is no more important civic duty than voting, and we're using every tool to make sure voters can vote from the safety of their homes or polling places. #COVID19", "2020-05-04T18:00:00.000Z": "If you are unable to work because of #COVID19 , you may be eligible for unemployment benefits.\n \nPlease know that although there may be long wait times, requests are being processed as quickly as possible.\n \nMore info and guidance Guide: Unemployment Benefits This guide will help you navigate the process of applying for unemployment compensation and connect you with additional resources available. pa.gov", "2020-05-04T14:00:00.000Z": "As we begin to reopen Pennsylvania, we won't risk all of the progress we've already made against #COVID19 through sacrifice and hard work.\n \nWe'll follow expert recommendations and keep a close eye on the data.\n\nDetails: http:// governor.pa.gov/process-to-reo pen-pennsylvania/ ", "2020-05-04T12:00:00.000Z": "My mask protects you, your mask protects me You can't always see if someone around you has a compromised immune system or underlying medical condition. Protect others from #COVID19 by wearing a mask when you leave home + keeping at least 6 feet between yourself + others.", "2020-05-04T12:00:01.000Z": "The deadline to register to vote in the June 2 primary election is only two weeks away.  Check your voter status at http:// VotesPA.com/Status . Register or update your registration at http:// Register.VotesPA.com . Want to vote by mail? Sign up at http:// VotesPA.com/ApplyMailBallot .", "2020-05-03T15:00:00.000Z": "Thank you to Pennsylvanian Marisa Leuzzi for donating life-saving plasma after surviving #COVID19 .\n \nOur commonwealth is great because of people like Marisa who step up to help others in trying times. \n\nNow and always, I am proud to be your governor. Chester County Woman Becomes First American Red Cross Donor to Save 2 COVID-19 Patients A Chester County woman who recovered from the novel coronavirus stepped up to become America's first Red Cross donor to give life-saving plasma to two critically ill COVID-19 patients, including her... nbcphiladelphia.com", "2020-05-03T12:00:00.000Z": "You are #NotAlone this Mental Health Awareness Month.\n \nI know #COVID19 makes life especially challenging. Resources are available throughout this pandemic to help Pennsylvanians with their mental health.", "2020-05-02T17:00:00.000Z": "Starting next week, the first Pennsylvania counties will see eased #COVID19 restrictions as they move from the red phase to the yellow phase.\n\nLearn what each phase means and how we're making these decisions Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-05-02T15:00:00.000Z": "Over the past two months, we've taken collective action to stop the spread of #COVID19 .\n\nThese sacrifices are saving lives and stabilizing new case numbers statewide.\n\nYesterday, I announced the first 24 counties that will shift to the yellow phase and begin to reopen on May 8.", "2020-05-02T12:00:01.000Z": "Only one month until the June 2 primary election. For the first time, all registered voters will have the option to vote by mail ballot. Register to vote or update your registration at http:// Register.VotesPA.com . Sign up to vote by mail at http:// VotesPA.com/ApplyMailBallot .", "2020-05-01T20:55:36.000Z": "Learn more about the data and guidelines we're following to make these decisions Process to Reopen Pennsylvania Governor Tom Wolf's detailed plan to reopen Pennsylvania following the COVID-19 pandemic. governor.pa.gov", "2020-05-01T20:55:35.000Z": "When data shows that counties are doing well and outbreak risks are low, we can look at moving from red to yellow, or from yellow to green.\n \nOn the flip side, if guidelines aren't being followed and risks increase, we may have to regress back to red.", "2020-05-01T20:55:34.000Z": "Earlier today, I announced the first Pennsylvania counties that will move from the red to yellow phase of reopening.\n \nThese counties were selected because the data is promising, and experts feel comfortable that they can safely loosen some restrictions.", "2020-05-01T18:07:37.000Z": "Although some restrictions will be lifted, residents should still practice social distancing and masking.\n\nSome activities/places where vulnerable people could be exposed will remain closed.\n\nSpecific guidance for counties moving into the yellow phase will be available next week.", "2020-05-01T18:07:36.000Z": "Today, I am announcing 24 counties will soon be moving into the yellow phase of reopening.\n\nAt 12:01 AM on May 8, the following counties will have some #COVID19 mitigation restrictions lifted: Bradford Cameron Centre Clarion Clearfield Clinton Crawford Elk", "2020-05-01T17:28:36.000Z": "On May 8, 24 counties will reopen - moving from the red phase of #COVID19 response to the yellow phase. More businesses can open with safety guidance in place Telework must continue where possible Residents should social distance + wear masks to avoid an outbreak", "2020-05-01T12:00:00.000Z": "Want to vote from home? Registered voters can now sign up to vote by mail in the June 2 primary election.  Sign up before 5 PM on May 26 at http:// VotesPA.com/ApplyMailBallot . Once you're signed up, track your ballot progress at http:// VotesPA.com/MailBallotStat us  .", "2020-04-30T18:00:25.000Z": "Pennsylvanians have enough things to worry about during this crisis - feeding your family shouldn't be one of them.\n \nFind out more about what we've done to fight food insecurity across the commonwealth and connect with food assistance resources Quote Tweet PA Department of Agriculture @PAAgriculture In April 2019, PA's network of emergency food providers served 527,000 Pennsylvanians. This April, amidst #COVID19 mitigation efforts, more than 1.4 MILLION were served through our charitable food system.\n\nFind food insecurity info, actions & resources: http:// agriculture.pa.gov/FoodSecurity", "2020-04-30T13:48:54.000Z": "Heavy rain expected across central & eastern #Pennsylvania today, with possible flooding through Saturday. Have multiple ways to get #weather alerts, and NEVER drive or walk through #flooding . #PAwx Quote Tweet Jeff Jumper PEMA @JeffJumperWX 4/30/20: Final day of April to get those \"showers\" in for May flowers!  Rain will be heavy today, mainly central and eastern PA. Have ways to get flood warnings. Expect a 3-6hr period of mod/heavy rain Flash/urban/stream flooding tod/ton River rises thru Sat @PEMAHQ  #PAWX", "2020-04-30T16:00:00.000Z": "We're #PAproud these \"][\"emple Owls are doing their part to help equip health care workers and fight the spread of #COVID19 . Temple University team manufacturing thousands of face shields daily A team from Temple University is working around the clock to provide much needed personal protective equipment for health care workers at Temple Hospital.", "2020-04-30T14:42:37.000Z": "Today, @GovernorTomWolf announced that nearly $324 million has been awarded to 31 hospitals across PA through the Hospital Emergency Loan Program (HELP), providing financial relief to hospitals combating a surge of COVID-19 cases in their area. Wolf Administration: New Funding Awarded to Assist Hospitals Across Pennsylvania Governor Tom Wolf announced that nearly $324 million in funding has been awarded to 31 hospitals across the commonwealth through the Hospital Emergency Loan Program, or HELP, which provides short-t... governor.pa.gov", "2020-04-30T14:01:57.000Z": "Unemployment compensation resources for PA'ians:  #COVID19 Guide: http:// on.pa.gov/3cWGi1S  Pandemic Unemployment Assistance: http:// on.pa.gov/3cZfbmV  Federal Pandemic UC: http:// on.pa.gov/2yY5iYc  UC Claim Status Check: http:// on.pa.gov/2SmoBku From PA Department of Labor & Industry", "2020-04-30T12:00:00.000Z": "#COVID19 is a rapidly changing situation and our top priority is keeping people safe. Our guidance is based on the best available data and expert recommendations.\n \nRight now: Statewide Stay at Home order Assessing where we can begin phased reopenings Masking in public", "2020-04-29T22:18:43.000Z": ". @GovernorTomWolf today signed two bills: one helping cover @PANationalGuard members on active duty if they contract COVID-19 while performing their duties, and another providing for @PAGameComm to pay a fair market value for land in Allegheny County. Gov. Wolf Signs Two Bills into Law, Vetoes Flawed Telemedicine Bill, Releases Cross-Agency Guidance... Governor Tom Wolf today signed into law two bills: House Bill 1869 allows for National Guard members called to active duty to be covered under the Heart and Lung Act if they contract COVID-19 while... governor.pa.gov", "2020-04-29T19:10:37.000Z": "So far we've: Provided 5.5 million free meals for students Allowed takeout/delivery from soup kitchens Provided meals for senior centers Worked with farmers to open farm stands Sped up the Food Recovery Grant Program to help nonprofits buy food storage equipment", "2020-04-29T19:10:36.000Z": "#COVID19 has provided unique challenges across the commonwealth, but we're making sure reliable food access isn't one of them.\n \nNo Pennsylvanian should go hungry.\n \nWe just launched a food security plan and resources for Pennsylvanians.", "2020-04-29T14:03:01.000Z": "If you are a Pennsylvanian who needs help accessing food, there are many resources available: Local food pantries: http:// on.pa.gov/2Ue5aKV  Meals for students: http:// on.pa.gov/2y9TFgt  Groceries for low-income households: SNAP dhs.pa.gov", "2020-04-29T12:00:01.000Z": "It might not feel like it, but by staying home and limiting contact with others, your actions are saving lives.\n \nI know this quarantine is long, but we must stay the course.\n \nYour hard work is getting us through this. Thank you. #COVID19", "2020-04-27T22:53:05.000Z": "Not sure where your UC claim stands in the UC process? Check the status of your claim online! Visit https:// paclaims.pa.gov/ucen/LoginClai mStatus.asp ", "2020-04-27T23:45:00.000Z": "While other states have publicized data on the race of COVID-19 patients for weeks, Pennsylvania lagged behind. Now, Governor Tom Wolf is demanding the collection of more patient data. @talia_kirkland has the story: Wolf Administration creates COVID-19 Response Task Force for Health Disparity Nationally, the COVID-19 pandemic has exposed deep inequities within our healthcare system. While other states have publicized data on the race of COVID-19 patients for weeks, Pennsylvania lagged... local21news.com", "2020-04-28T18:00:01.000Z": "The @CDCgov began to recommend wearing cloth masks in public after studies showed people can transmit COVID-19 without showing symptoms.\n \nMy mask protects you, your mask protects me. #MaskUpPA GIF", "2020-04-28T12:00:01.000Z": "Attention Pennsylvania drivers: Due to #COVID19 , driver deadlines have been extended.\n \nFor more details and FAQs visit: https:// penndot.gov/pages/coronavi rus.aspx ", "2020-04-28T15:03:15.000Z": "The federal CARES Act includes a temporary program called Pandemic Unemployment Assistance (PUA).\n \nPUA is for those who do not qualify for regular unemployment compensation but are financially struggling from #COVID19 .\n \nApply for PUA: http:// uc.pa.gov/PUA", "2020-04-22T17:38:01.000Z": "As Pennsylvania continues mitigation efforts to fight COVID-19, Governor Tom Wolf is encouraging registered voters to apply for a mail-in ballot for the June 2 primary election. Pennsylvania residents encouraged to apply for mail-in ballot HARRISBURG - As Pennsylvania continues mitigation efforts to fight COVID-19, Governor Tom Wolf is encouraging registered voters to apply for a mail-in ballot for the June 2 primary election. delcotimes.com", "2020-04-27T20:51:39.000Z": "PIN UPDATE:  If it's been more than 3 weeks + you still have not received your PIN, please request a new PIN  https:// expressforms.pa.gov/apps/pa/DLI-UC /Pin-Request   Please be assured that once approved, you'll receive back pay for the weeks you were unable to file. We apologize for the inconvenience. GIF", "2020-04-27T20:00:15.000Z": "We need to make smart, data-driven decisions as we reopen Pennsylvania.\n \nWe can't be impulsive.\nWe can't be emotional.\nWe need to follow the science.", "2020-04-27T20:00:14.000Z": "We'll look at testing rates, the ability to investigate cases, contact tracing abilities, and proximity to high-risk settings.\n\nWe're also partnering with @CarnegieMellon on a modeling tool to track public health and economic factors.\n\nMy plan Plan for Pennsylvania | Governor Tom Wolf Governor Wolf's plan for Pennsylvania's relief, reopening, and recovery from the COVID-19 pandemic. governor.pa.gov", "2020-04-27T20:00:13.000Z": "We won't use one single tool to determine how and when we reopen PA, and ultimately #COVID19 will set the timeline.\n \nA county can make the list for consideration to open if they have had fewer than 50 new confirmed cases per 100,000 population reported in the previous 14 days.", "2020-04-27T19:12:18.000Z": ". @GovernorTomWolf today announced that the Wolf Administration is lifting some restrictions on businesses related to certain outdoor activities. Governor Announces May 1 Statewide Reopening of Limited Outdoor Recreational Activities to Help... To ensure that Pennsylvanians have opportunities to safely enjoy outdoor recreation as a way to maintain positive physical and mental health, and in keeping with the commonwealth's stay-at-home... governor.pa.gov", "2020-04-24T23:45:00.000Z": "Resources are available for people having trouble coping or experiencing a mental health crisis spurred by the coronavirus pandemic and the isolation it has wrought. Gov. Wolf: Mental health resources available for pandemic stress, anxiety Resources are available for people having trouble coping or experiencing a mental health crisis spurred by the coronavirus pandemic and the isolation it has wrought. Gov. Tom Wolf on Friday reitera... triblive.com", "2020-04-27T14:00:00.000Z": "Frances and I personally send our gratitude to the essential employees who are keeping Pennsylvania running.\n \nYour sacrifices and hard work do not go unnoticed. Thank you.", "2020-04-27T12:00:01.000Z": "#COVID19 took special moments away from all of us.\n\nJoin me in congratulating an incredible group of young people who got dealt a bad hand and are still keeping their heads up.\n\nCongratulations to the class of 2020.", "2020-04-26T13:00:00.000Z": "More than half a million Pennsylvanians have signed up to vote by mail in the June 2 primary election. The deadline to sign up is only a month away: May 26 at 5 p.m.\n\nSign up today at http:// Votespa.com/ApplyMailBallot .", "2020-04-25T17:00:00.000Z": "So many Pennsylvanians are coming together to protect and support each other. I couldn't be more proud.\n\nThank you to all who are making a difference in this trying time. #MaskUpPA 'Form an army': Central PA seamstresses aid shortage of face masks by sewing their own With a shortage of CDC approved facemasks, many seamstresses throughout central Pa are putting needle to thread to try to bridge the gap. eveningsun.com", "2020-04-25T16:00:55.000Z": "In consultation with public health professionals and in an effort to simplify and to better capture growth, decline, or stability, the Wolf Administration elaborated on the @PAHealthDept metrics and included an example to aid in calculation. Wolf Admin. Elaborates on Data Driven Reopening Standard In consultation with public health professionals and in an effort to simplify and to better capture growth, decline, or stability, the Wolf Administration elaborated on the Department of Health... governor.pa.gov", "2020-04-25T15:40:21.000Z": "In consultation with public health professionals, we've updated @PAHealthDept reopening metrics to better capture growth, decline, & stability of #COVID19 cases.\n\nHere's a mock example of how we'll determine target goals for reopening have been met.\n\nMore: http:// governor.pa.gov/process-to-reo pen-pennsylvania/ ", "2020-04-25T12:00:00.000Z": "This is a stressful time. The best thing we can do is continue to stay calm, stay home, and stay safe. #COVID19 resources for Pennsylvanians: http:// pa.gov/covid-19 .", "2020-04-24T19:23:07.000Z": "We have: Moved staff around to help the UC office Called on experienced retirees Hired more than 100 new employees Launched an automated virtual phone assistant to reduce call wait times Provided help with federal funding", "2020-04-24T19:23:06.000Z": "#COVID19 has brought a carousel of negative emotions for a lot of us.\n \nMany Pennsylvanians are finding it hard to meet basic needs financially and have applied for unemployment.\n \nI've heard these struggles and have made adjustments to try and meet that demand.", "2020-04-24T16:00:01.000Z": "As we head toward reopening our commonwealth, we will continue to depend on partnerships between Pennsylvania manufacturers and distributors to meet our critical medical supply needs.\n \nWinning the battle against #COVID19 takes all of us. Wolf Adminstration mobilizes manufacturers to produce COVID-19 supplies A new online portal has been created to help manufacturers produce medical supplies. wgal.com", "2020-04-24T14:00:00.000Z": "#COVID19 resource for parents, students, and educators Check out the @PADeptofEd FAQ page for answers to common questions like: How can students get meals? How are schools providing continued education? What's the status of state assessments? Answers to FAQs for School Communities Information on this page is updated often - please check back frequently. education.pa.gov", "2020-04-24T12:06:11.000Z": "It's normal to feel stress, fear, and anxiety in the middle of a global pandemic. \n\nMental health resources are available for Pennsylvanians. Please reach out if you could use some support. #COVID19", "2020-04-23T22:20:50.000Z": "As the construction industry prepares to resume work, the @GovernorTomWolf Administration today issued guidance for all construction businesses and employees to mitigate the spread of COVID-19. Wolf Administration Issues Guidance as Construction Industry Prepares to Resume Work May 1 As the construction industry prepares to resume work, the Wolf Administration today issued guidance for all construction businesses and employees to mitigate the spread of COVID-19. governor.pa.gov", "2020-04-23T21:02:25.000Z": "Wishing joy and peace to all Pennsylvanians celebrating #Ramadan . And a special thank you for staying safe and celebrating at home. Quote Tweet Pennsylvania @PennsylvaniaGov #Ramadan Kareem to all Pennsylvanians celebrating.", "2020-04-22T20:02:46.000Z": "Debe usar una mascarilla cada vez que salga de su casa. ¡Mi mascarilla lo protege, su mascarilla me protege a mí! You should wear a mask whenever you leave your house. My mask protects you, your mask protects me! \n\nGracias, @giselefetterman ! #MaskUpPA  #COVID19", "2020-04-23T16:00:00.000Z": "I'm basing my decisions on the advice of health experts to safely plan for our future.\n\nWe'll start easing restrictions in PA on May 8, getting back to business gradually and safely.\n \nMy plan for relief, reopening, and recovery: http:// governor.pa.gov/plan . Deadly resurgence if curbs lifted too early - WHO Countries should be cautious about lifting lockdown measures, the World Health Organization says. bbc.com", "2020-04-23T12:00:00.000Z": "Yesterday I announced the phases of my plan to gradually reopen Pennsylvania.\n \nCurrently, all 67 counties are in the most strict phase of my plan - the red phase. As conditions improve, counties and regions will have fewer restrictions.\n \nDetails: http:// pa.gov/covid-19 .", "2020-04-23T14:14:41.000Z": "Today is #WorldBookDay .\n\nThings haven't been easy lately. There's no better time to retreat into a book, unwind, and relax.\n\nNeed help coping with #COVID19 ? Text PA to 741-741.", "2020-04-22T23:19:01.000Z": "The ultimate goal is to move into the green phase.\n\nGreen = Least amount of restrictions Stay at Home orders lifted Businesses/individuals will follow guidelines from @PAHealthDept and @CDCgov This allows for a reopening that we hope will minimize a resurgence of #COVID19 .", "2020-04-22T23:19:00.000Z": "The yellow phase is the first phase of reopening.\n \nYellow = Fewer restrictions with exceptions Telework must continue where feasible Stay at Home restrictions lifted Retail and child care reopens with strict protections in place", "2020-04-22T23:18:59.000Z": "We are now studying conditions in the north-central and northwest regions with a target of moving from red to yellow on May 8.\n \nAdditional monitoring will take place and direction will be provided in the next week.\n \nMore information on our criteria Process to Reopen Pennsylvania Governor Tom Wolf's detailed plan to reopen Pennsylvania following the COVID-19 pandemic. governor.pa.gov", "2020-04-22T23:18:58.000Z": "All of Pennsylvania is now in the red phase.\n\nRed = Tight restrictions Only life-sustaining businesses are open Limited telework People are staying home, except for critical needs\n \nAs regions hit benchmarks that show they're ready, they'll move to the yellow phase.", "2020-04-22T23:18:51.000Z": "Tonight, I'm announcing our plan to slowly reopen Pennsylvania.\n \nWe will use a measured, scientific approach. We will not just be flipping a switch to go from closed to open.\n \nAnd, ultimately, #COVID19 will set the timeline.\n \nThere will be three phases: red, yellow, and green.", "2020-04-22T15:26:03.000Z": "As Pennsylvania continues mitigation efforts to fight COVID-19, @GovernorTomWolf is encouraging registered voters to apply for a mail-in ballot for the June 2 primary election. Gov. Wolf Encourages Voters to Apply for a Mail-in Ballot As Pennsylvania continues mitigation efforts to fight COVID-19, Governor Tom Wolf is encouraging registered voters to apply for a mail-in ballot for the June 2 primary election. governor.pa.gov", "2020-04-22T15:00:01.000Z": "Pennsylvania business owners: Did you know? You can find #COVID19 resources available to you at http:// dced.pa.gov/resources . GIF", "2020-04-22T14:01:23.000Z": "This is who Pennsylvanians really are: selfless, brave, and strong.\n\nThank you to the Braskem America employees who spent 28 days straight at their plant to create necessary life-saving equipment. More than 40 employees lived at their plant for 28 days to make material to protect health care... Workers at a Pennsylvania manufacturing plant got to clock out and go home for the first time in almost a month after a marathon effort to make material needed for personal protective medical... cnn.com", "2020-04-22T12:00:00.000Z": "Happy #EarthDay , PA! Protect our commonwealth by wearing your mask, and protect our planet by leaving no trash behind the next time you head outdoors.", "2020-04-21T18:00:39.000Z": "Last election, PA native and astronaut, @astrodrewmorgan found a way to vote while orbiting the Earth in the @Space_Station . Voters can request a ballot from anywhere with the new option of mail-in voting.\nApply online: http:// votesPA.com/ApplyMailBallot Learn more: http:// votesPA.com/MailBallot", "2020-04-21T21:09:55.000Z": "We've come together like never before to fight the spread of #COVID19 , and our incredible sacrifices are paying off.\n\nYesterday, I announced steps to continue to protect the health of our people as we walk towards a new normal for our commonwealth.", "2020-04-21T17:55:23.000Z": "Reminder: Local garden centers in Pennsylvania may remain open during this time for delivery.\n\nSee more #COVID19 guidance for community gardens: http:// bit.ly/CovidGardens", "2020-04-21T16:10:17.000Z": "PUA System has been corrected. For individuals who believe they inaccurately received the PUA ineligibility message, please try filing for PUA again at http:// uc.pa.gov/PUA We truly appreciate your patience + understanding as we work with this new system.", "2020-04-21T11:55:05.000Z": "Hey, PA! Remember to stay in your community if you're heading outdoors for some fresh air. Find a park near you at http:// maps.dcnr.pa.gov/localparks .", "2020-04-20T12:00:19.000Z": "Mask wearing DOs: Wear a mask outside of home Be sure it covers your nose + mouth Be sure you can breathe through it Still practice social distancing Wash after each use Wash hands after removing mask #MaskUpPA", "2020-04-21T14:04:30.000Z": "We've lowered the Pennsylvania flag in honor of those we've lost and those we will lose to #COVID19 .\n \nFrances and I send our condolences to all Pennsylvanians mourning right now.\n \nIt's on all of us to prevent future deaths from this illness.", "2020-04-21T12:51:27.000Z": "The Get Help Now hotline is a confidential, 24/7 treatment and information service for individuals and families facing substance use disorder. Call 1-800-662-HELP.", "2020-04-21T12:00:00.000Z": "Our primary election is on June 2. Prepare for Election Day from the comfort of your home: Check voter status: http:// VotesPA.com/Status  Register to vote: http:// Register.VotesPA.com  Sign up to vote by mail: http:// VotesPA.com/ApplyMailBallot  Track mail ballot: http:// VotesPA.com/MailBallotStat us ", "2020-04-20T22:04:55.000Z": "As much as I want get us back to normal, our response must be measured.\n \nLifting restrictions will be a process and cannot happen overnight. Gov. Wolf, Sec. of Health Extend Statewide Stay-at-Home Order Until May 8 Governor Tom Wolf and Secretary of Health Dr. Rachel Levine announced that the statewide stay-at-home orders issued on April 1 to protect Pennsylvanians and mitigate the spread of COVID-19 will be... governor.pa.gov", "2020-04-20T22:04:54.000Z": "I'm working toward a goal date of May 8 to start easing restrictions in Pennsylvania.\n \nMy team is listening to experts, following the data, and prioritizing keeping people safe.", "2020-04-20T17:33:16.000Z": "The actions we have taken and the sacrifices we have made are working.\n\nOur new case numbers have stabilized. We've  prevented the patient surges seen in other places.\n \nWe will get through this together. More on today's announcement Gov. Wolf Announces Online Auto Sale Process, Construction Restart Date, PLCB Curbside Pick Up Governor Tom Wolf announced three actions including online sales of vehicles, which will be enabled by the signing of SB 841, restart of construction projects statewide starting Friday, May 8, and... governor.pa.gov", "2020-04-20T17:11:37.000Z": "Today I'm announcing that we will now allow: Restart of construction projects with strict guidance (May 8) Curbside pickup at Pennsylvania Liquor Control Board stores Online vehicle sales", "2020-04-20T14:45:00.000Z": "I've never been more proud of our commonwealth or more lifted by the spirt of our people\n\nTogether we have protected our most vulnerable from illness. And together we will lift Pennsylvania up from #COVID19 .\n\nMy plan for relief, reopening, and recovery: http:// governor.pa.gov/plan .", "2020-04-15T19:14:07.000Z": "Pa. will now require most customers to wear masks, workers to wear them on the job, to slow COVID-19 spread Pa. will now require most customers to wear masks, workers to wear them on the job, to slow... \"Entry will be denied to any individual not wearing a mask \"unless the business is providing medication, medical supplies, or food, in which case the business must provide alternative methods of... pennlive.com", "2020-04-20T12:00:00.000Z": "Every Pennsylvanian deserves to have access to food.\n \nHere's how you can find food assistance resources near you ​How to Access Emergency Food Assistance During COVID-19 Mitigation During COVID-19 mitigation, food assistance programs are still powering through. Here's how to access services. agriculture.pa.gov", "2020-04-19T17:00:01.000Z": "The @CDCgov recommends wearing a mask to protect others when going out in public. Please wear a cloth mask when you leave your home. Mask guidance for Pennsylvanians: http:// on.pa.gov/masks  Mask guidance for businesses: http:// on.pa.gov/3beFSDJ", "2020-04-18T18:02:54.000Z": "Quote Tweet PA Department of Labor & Industry @PALaborIndustry Thank you for your continued patience as we work through our new PUA system. \n\nWe'll be posting updates and information on our social channels and  \"File for PUA\" web page: https:// uc.pa.gov/unemployment-b enefits/file/Pages/Filing-for-PUA.aspx ", "2020-04-18T17:53:27.000Z": "Thank you for your continued patience as we work through our new PUA system. \n\nWe'll be posting updates and information on our social channels and  \"File for PUA\" web page: https:// uc.pa.gov/unemployment-b enefits/file/Pages/Filing-for-PUA.aspx ", "2020-04-18T17:00:00.000Z": "Register by May 18 to vote in the upcoming primary election - now on June 2.  Check your status: http:// VotesPA.com/Status  Register to vote or update your registration: http:// Register.VotesPA.com  Already registered? Sign up to vote by mail: http:// VotesPA.com/ApplyMailBallot", "2020-04-18T16:09:22.000Z": ". @GovernorTomWolf today announced nearly $16 million in funding for Pennsylvania food banks, which are providing critical assistance to Pennsylvanians during the COVID-19 health crisis. Gov. Wolf Announces Nearly $16 Million in Funding for Pennsylvania Food Banks Governor Tom Wolf today announced nearly $16 million in funding for Pennsylvania food banks, which are providing critical assistance to Pennsylvanians during the COVID-19 health crisis. governor.pa.gov", "2020-04-18T15:19:21.000Z": "Important unemployment compensation update for Pennsylvanians: You can now apply for Pandemic Unemployment Assistance. Quote Tweet PA Department of Labor & Industry @PALaborIndustry Attention: #Pennsylvania 's self-employed, independent contractors, gig workers, and others not eligible for regular #unemployment compensation can begin filing claims for Pandemic Unemployment Assistance #PUA benefits.  https:// uc.pa.gov/unemployment-b enefits/file/Pages/Filing-for-PUA.aspx ", "2020-04-18T11:53:09.000Z": "View my full plan for the relief, reopening, and recovery of Pennsylvania Plan for Pennsylvania | Governor Tom Wolf Governor Wolf's plan for Pennsylvania's relief, reopening, and recovery from the COVID-19 pandemic. governor.pa.gov", "2020-04-18T11:53:08.000Z": "Reopening Pennsylvania won't mean going back to a world of celebrations, concerts, and other large gatherings.\n \nWe'd still need to avoid mass groups of people to keep people safe.", "2020-04-18T11:53:07.000Z": "We need more personal protective equipment and testing to reopen Pennsylvania.\n \nWe simply cannot keep health care workers or our public safe without these supplies.", "2020-04-18T11:53:06.000Z": "Reopening Pennsylvania isn't going to be like ripping off a Band-Aid.\n \nWe will continue to roll out guidelines that make sense given the current situation. We will all need to continue to adapt and do whatever it takes to keep people safe.", "2020-04-18T11:53:05.000Z": "As we look forward to reopening Pennsylvania, we need to keep protections for vulnerable people in place.\n \nThis means that even as we start getting back to work and our lives, stricter protections need to continue for people who could get very sick or die of #COVID19 .", "2020-04-18T11:53:04.000Z": "I want PA to get back to normal just as much as anyone else does. But it won't happen magically, and it won't happen overnight.\n \nMy first focus is on the health and safety of our people, and I refuse to compromise on that. I'm relying on data and experts to plan ahead.", "2020-04-17T18:15:10.000Z": "Relief for Pennsylvanians\n \nWe understand that people have put their lives on hold in order to save others. We also understand that comes at a cost.\n \nThat's why we have resources to help those struggling with food insecurity, loans, furloughs/layoffs, and closed businesses.", "2020-04-17T18:15:09.000Z": "Today I'm announcing my plan for the future of Pennsylvania as we continue to battle #COVID19 .\n \nThe plan includes details on: Relief for Pennsylvanians Reopening Pennsylvania Recovery for Pennsylvanians Plan for Pennsylvania | Governor Tom Wolf Governor Wolf's plan for Pennsylvania's relief, reopening, and recovery from the COVID-19 pandemic. governor.pa.gov", "2020-04-17T14:00:00.000Z": "Need to make a mask? Here's how you can sew your own mask using materials you may already have in your home Can't sew? No problem! Make one at home easily-even if you can't sew. Follow these simple instructions: https:// bit.ly/2K71Mgj  #MaskUpPA", "2020-04-17T14:02:16.000Z": "Thank you to the Pennsylvanians who are lending a helping hand during #COVID19 . #MaskUpPA 'Mask Force 2020': Lehigh Valley volunteers mobilize to make masks for hospital workers facing... Lehigh Valley residents are mobilizing to make homemade masks for health care workers and others affected by the coronavirus pandemic after the CDC relaxed mask standards and doctors nationwide... mcall.com", "2020-04-17T11:59:11.000Z": "Struggling during #COVID19 ? Call @800273TALK (Spanish: 1-888-628-9454) or text PA to 741741 PA's support helpline: 1-855-284-2494 Substance use help: http:// on.pa.gov/covid-sud  Veterans: 1-800-273-TALK (8255) Disaster Distress Helpline: 1-800-985-5990", "2020-04-16T20:00:00.000Z": "OTD two years ago, I signed #TiernesLaw to expand domestic violence protections.\n \nDomestic violence help is available during #COVID19 . Call the @ndvh hotline at 1-800-799-7233, text LOVEIS to 22522, or log on to chat at http:// thehotline.org .\n \nYou are not alone.", "2020-04-14T00:53:12.000Z": "Staying home now and continuing to 'isolate ourselves' will be how we get to 'new normal': Gov. Wolf Staying home now and continuing to 'isolate ourselves' will be how we get to 'new normal': Gov. Wolf Wolf shared the landmarks he believes will let us move on to different stages of getting through the COVID-19 pandemic. pennlive.com", "2020-04-16T14:32:34.000Z": "My mask protects you, your mask protects me When going to a supermarket, pharmacy or other life-sustaining business, you must wear a mask to enter the store. Your mask will help protect our critical workers, like cashiers, those stocking shelves + pharmacists. #MaskUpPA", "2020-04-16T12:00:01.000Z": "Heading outdoors for a breath of fresh air? Here are a few things to keep in mind amid #COVID19 . More tips on how to keep yourself and family safe at http:// pa.gov/covid-19 .", "2020-04-16T12:00:00.000Z": "Yesterday, @SecretaryLevine signed an order to keep our essential workforce safe.\n\nThe order guides businesses on sanitation, social distancing, and handling exposure to #COVID19 .\n\nThese PA'ians deserve to be protected while they're ensuring we have the things we need to survive.", "2020-04-15T20:39:50.000Z": "Today @GovernorTomWolf + @SecretaryLevine announced an order providing worker safety measures to combat #COVID19 . Measures include: providing masks for employees to wear stagger work start/stop times provide space for breaks/meals while maintaining social distance of 6'", "2020-04-15T18:40:57.000Z": "I'm also announcing the creation of the Health Disparity Task Force led by @FettermanLt .\n  \nThis task force will protect our most vulnerable Pennsylvanians as we work to recover from #COVID19 .", "2020-04-15T18:40:56.000Z": "In an effort to better protect workers, I'm announcing @SecretaryLevine 's newest order.\n\nThe order requires businesses to ensure safe work environments to mitigate the spread of #COVID19 .\n\nIt includes guidance on cleaning, social distancing, and handling exposure to the virus.", "2020-04-15T18:12:25.000Z": "Today, @GovernorTomWolf and @FettermanLt announced the creation of a COVID-19 Response Task Force for Health Disparity to help communicate issues with how the pandemic is affecting PA's minority and vulnerable populations. Gov. Wolf, Lt. Gov. Fetterman: New Task Force for Health Disparity to Address How COVID-19 Affects... Amid growing concern for how COVID-19 is disproportionately affecting minority populations in the state and adding to existing health disparity issues, today Gov. Tom Wolf and Lt. Gov. John Fetterman... governor.pa.gov", "2020-04-15T16:00:00.000Z": "Important update for Pennsylvanians who are receiving unemployment compensation Quote Tweet PA Department of Labor & Industry @PALaborIndustry The $600 additional UC funds will start reaching claimants who have already started receiving regular UC during the week of April 12. Please note that it will appear as a separate payment from your regular UC payments. For more information: https:// uc.pa.gov/COVID-19/CARES -Act/Pages/default.aspx ", "2020-04-15T15:03:06.000Z": "Need help finding free meals for kids? visit your school/district website + social media search our map: http:// education.pa.gov/COVID19  monitor #Meals4KidsInPA  check out this list from @PAAgriculture : https:// agriculture.pa.gov/foodforthought /Pages/Article.aspx?post=71 ", "2020-04-15T15:02:03.000Z": ". @GovernorTomWolf today sent a letter to @USDA Secretary Sonny Perdue urging him to immediately publish a plan to support agriculture producers, food processors, workers, and local food systems, regardless of size of operation. Governor Wolf Urges USDA Support of Vital Pennsylvania Agriculture Sectors Governor Tom Wolf today sent a letter to U.S. Department of Agriculture Secretary Sonny Perdue urging him to immediately publish a plan to support agriculture producers, food processors, workers, and... governor.pa.gov", "2020-04-15T14:00:01.000Z": "Frances made masks for us to wear to help protect others from #COVID19 .\n\nI'm asking PA'ians to wear masks to further prevent the spread of illness. Remember: My mask protects you, your mask protects me.\n \nMask guidance and DIY instructions: http:// pa.gov/covid-19 . #MaskUpPA", "2020-04-15T12:00:01.000Z": "The #2020Census is here! Your participation matters.  \n \nYou count and can make a difference. From Pennsylvania", "2020-04-15T12:00:00.000Z": "The big steps we have taken to bend the curve of #COVID19 cases are working in PA.\n\nNow is the time to start looking ahead and taking a measured, careful approach to prepare for the future. But the safety of PA'ians comes first and we must ensure we don't undo all of our efforts.", "2020-04-14T21:00:00.000Z": "No Pennsylvanian should go hungry. Find food help during #COVID19  Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-04-14T20:00:00.000Z": "Folks, let's give Principal Quinones and Governor Wolf Elementary School a break.\n \nHere's how to reach me on social media Twitter: @GovernorTomWolf Facebook: http:// fb.com/GovernorWolf Instagram: http:// instagram.com/GovernorTomWolf How a Bethlehem elementary school finds itself managing Gov. Tom Wolf's Twitter mentions Named for Pennsylvania's seventh governor, the Governor Wolf Elementary School has a Twitter handle that's often confused with that of the 47th governor, Tom Wolf. lehighvalleylive.com", "2020-04-14T18:00:01.000Z": "Pennsylvanians are making great sacrifices to bend the #COVID19 curve, and we're making progress.\n\nThank you for practicing social distancing and for staying home.\n\nOne day we will arrive at a new sense of normal, but right now we must keep doing what we're doing to save lives.", "2020-04-13T19:04:13.000Z": "Pa., NJ, other states work on developing plan to reopen as they deal with outbreak #COVID19  #coronavirus Pa., other Northeastern states to coordinate on plan to reopen as they deal with outbreak The states will work together and share intelligence as they develop plans for their residents. wfmz.com", "2020-04-14T13:17:14.000Z": "Due to current volumes, you may not receive your PIN in time to file biweekly, but you will be able to file for recent and missed weeks once your PIN arrives.  For more PIN updates visit: http:// ow.ly/YEBs50zdDO4 We appreciate your patience during this extraordinary time. GIF", "2020-04-14T14:30:00.000Z": "No one in PA should go hungry due to #COVID19 . Food banks and pantries are offering support to PA residents. They can't do it alone. Donate or volunteer: http:// bit.ly/PAfoodmap  Deliver meals to seniors: http:// mealsonwheelsamerica.org More resources: http:// feedingpa.org", "2020-04-14T14:38:40.000Z": "As part of the effort to help businesses affected by the COVID-19 pandemic, @GovernorTomWolf today announced businesses that collect Pennsylvania sales tax will not have to make Accelerated Sales Tax prepayments over the next three months. Pennsylvania Businesses to Benefit from Waiver for Prepayments of Sales Tax As part of the effort to help businesses affected by the COVID-19 pandemic, Governor Tom Wolf today announced businesses that collect Pennsylvania sales tax will not have to make Accelerated Sales... governor.pa.gov", "2020-04-14T12:03:10.000Z": "Working at an essential business Caring for a family member or pet in another household Returning home from an outside jurisdiction", "2020-04-14T12:03:09.000Z": "Certain activities and travel are still allowed under Pennsylvania's Stay At Home Order, including: Tasks essential to health and safety Picking up essential supplies Outdoor activity that can be done while social distancing", "2020-04-13T21:50:03.000Z": "Reminders: it's okay to ask for help + you're never alone.\n\nTalk to someone at any time: call the PA Support & Referral Helpline: 1-855-284-2494 text \"PA\" to 741-741", "2020-04-13T23:57:00.000Z": "We do not know exactly when we will achieve victory.\n\nFirst, we need tests that can tell us when we are sick and when we are immune.\n\nOnce we have access to better #COVID19 testing, we will move into the second phase. This is when we start to slowly reopen our world.", "2020-04-13T23:56:59.000Z": "Tonight I want to thank Pennsylvanians for all the sacrifices they've made during the #COVID19 pandemic.\n \nOur commonwealth is made up of great people who are willing to step up to help a neighbor in need. It's truly an honor to stand with you all.", "2020-04-13T23:03:13.000Z": "LIVE NOW: @GovernorTomWolf delivers an address on COVID-19 and the ongoing efforts to mitigate the virus in PA.\nWatch live: http:// governor.pa.gov/live .\nEn español: http:// pacast.com/live/es . April 13 COVID-19 Update Join me for an update on the progress Pennsylvania has made in the battle against COVID-19 and our plan for moving forward. facebook.com", "2020-04-13T22:00:00.000Z": "Today at 7:00 PM, @GovernorTomWolf will deliver an address to update Pennsylvanians on the state of the commonwealth and ongoing efforts to mitigate COVID-19. Watch live at http:// governor.pa.gov/live . Pennsylvania Governor's Office LIVE Watch the live stream from the Office of the Governor. governor.pa.gov", "2020-04-13T21:16:17.000Z": "Joining fellow governors @nygovcuomo , @GovMurphy , @GovNedLamont , @JohnCarneyDE , and @GovRaimondo today by phone to announce the creation of a multi-state council to combat #COVID19 and get people safely back to work.", "2020-04-13T20:02:02.000Z": "Recognizing that their states have one regional economy, @GovernorTomWolf , @NYGovCuomo , @GovMurphy , @GovNedLamont , @JohnCarneyDE , and @GovRaimondo today announced the creation of a multi-state council to restore the economy and get people back to work. GOVERNOR WOLF, GOVERNOR CUOMO, GOVERNOR MURPHY, GOVERNOR LAMONT, GOVERNOR CARNEY, GOVERNOR RAIMONDO... Recognizing that their states have one integrated regional economy, Pennsylvania Governor Tom Wolf, New York Governor Andrew M. Cuomo, New Jersey Governor Phil Murphy, Connecticut Governor Ned... governor.pa.gov", "2020-04-13T12:00:00.000Z": "Shout out to @PAHealthDept  @SecretaryLevine . Thank you for your tireless efforts to keep Pennsylvanians safe and informed during #COVID19", "2020-04-12T00:17:10.000Z": "Pennsylvania residents out of work to begin getting extra $600 in federal unemployment benefits next week Pa. residents out of work to begin getting extra $600 in federal unemployment benefits next week The federal benefits are in addition to Pennsylvania's regular unemployment benefit. wfmz.com", "2020-04-13T16:00:00.000Z": "While COVID-19 is serious and people do die from it, it's important to remember that most people have mild illness and are able to recover at home.\n \nIf you are experiencing symptoms, try not to panic. Connect with your health care provider and follow their instructions.", "2020-04-13T14:00:00.000Z": "Our primary election is only 50 days away.\nAre you ready to vote on June 2? Visit http:// PA.gov/Voting to learn how to: Check your voter registration status. Register or update your voter registration. Sign up to vote by mail ballot. Guide: Voting in Pennsylvania Learn how to exercise your right to vote. This guide will help connect you with Pennsylvania's voting and election services. pa.gov", "2020-04-12T17:00:00.000Z": "Get the latest #COVID19 health guidance and Pennsylvania numbers straight from the @PAHealthDept . Coronavirus in Pennsylvania Get the latest, up-to-date information on coronavirus from the Pennsylvania Department of Health health.pa.gov", "2020-04-12T12:02:24.000Z": "Wishing a safe and happy #Easter to all Pennsylvanians celebrating. Thank you for staying home this year. Quote Tweet Pennsylvania @PennsylvaniaGov Happy #Easter , Peeps-ylvania!", "2020-04-11T17:00:00.000Z": "Looking for the latest on #COVID19 in Pennsylvania?\n\nCheck out our guide for the most up-to-date guidance and available resources Guide: Responding to COVID-19 in Pennsylvania All Pennsylvanians have an important role to play in stopping the spread of COVID-19 and saving lives. Here are resources to help you do your part. pa.gov", "2020-04-11T14:00:01.000Z": "Our hospitals should be focused on saving lives, not making ends meet.\n\nYesterday I announced the Hospital Emergency Loan Program to help financially-strained hospitals continue to provide critical care in their communities. #COVID19", "2020-04-10T23:17:19.000Z": ". @GovernorTomWolf announced today @PALaborIndustry is implementing new federal unemployment benefits through the CARES Act, providing an extra $600 per week and making self-employed, independent contractors, and gig workers eligible for benefits. Pennsylvania Begins Implementing New Federal Unemployment Benefits, Eligible Claimants Get Extra... Governor Tom Wolf announced today the Pennsylvania Department of Labor & Industry (L&I) is implementing new federal unemployment compensation benefits provided by the Coronavirus Aid, Relief, and... governor.pa.gov", "2020-04-10T20:00:01.000Z": "No Pennsylvanian should ever go hungry.\n \nHelp us make sure people and families who are suddenly in need of food are getting the assistance they need.\n\nPlease take and share this quick, anonymous food access survey: http:// bit.ly/2xlrVF7  #COVID19", "2020-04-10T18:53:40.000Z": "To assist in the fight against COVID-19, @GovernorTomWolf today announced the Hospital Emergency Loan Program (HELP) to provide short-term financial relief to PA hospitals as they prepare for the growing surge of individuals infected with the virus. Gov. Wolf Announces $450 Million Loan Program for Financially Strained Hospitals There are more than 19,000 COVID-19 cases in the state as of midnight today with numbers expected to continue increasing, highlighting an even greater need to ensure that Pennsylvania's hospitals are... governor.pa.gov", "2020-04-10T18:05:08.000Z": "Today, I am announcing the Hospital Emergency Loan Program (HELP).\n\nHospitals are getting hit hard by the financial stress of #COVID19 .\n\nThey need support to ensure they are equipped to care for patients and workers.\n\nHELP will make sure they have the ​financial support to do so.", "2020-04-10T15:08:12.000Z": ". @GovernorTomWolf today ordered @CorrectionsPA to establish a Temporary Program to Reprieve Sentences of Incarceration to aid the transfer of qualifying individuals to community corrections facilities or home confinement amid the COVID-19 pandemic. Gov. Wolf: Department of Corrections to Establish Temporary Program to Reprieve Sentences of... Under the authority granted to him by the Pennsylvania Constitution and the Emergency Management Services Code, Governor Tom Wolf today ordered Department of Corrections officials to establish a... governor.pa.gov", "2020-04-07T17:34:42.000Z": "New from @Wordsby_CassieM : Help wanted: First Lady Frances Wolf says volunteerism is 'essential' in COVID-19 fight https:// penncapital-star.com/blog/help-want ed-first-lady-frances-wolf-says-volunteerism-is-essential-in-covid-19-fight/   #COVID19 Help wanted: First Lady Frances Wolf says volunteerism is 'essential' in COVID-19 fight | Pennsyl... Despite Gov. Tom Wolf's statewide stay-at-home order, many organizations across the commonwealth are in need of volunteers to perform their essential services such as food distribution. penncapital-star.com", "2020-04-10T00:55:28.000Z": "My fiancé and I are doing our part for #MaskUpPA courtesy of some great masks made by his grandma!", "2020-04-10T12:00:00.000Z": "My mask protects you from #COVID19 . Your mask protects me from #COVID19 .\n \nPlease continue to stay home as much as possible, and wear cloth masks when you go out in public to protect other Pennsylvanians. \n\nHow to make your own mask: http:// on.pa.gov/masks . #MaskUpPA", "2020-04-09T18:52:20.000Z": "While we don't know yet when things will return to normal, we do know that mitigation efforts are working.\n\nThank you for practicing social distancing + staying home. \n\nAnd a BIG THANK YOU to essential workers + health care staff!\n\nWe'll get through this if we do it TOGETHER.", "2020-04-09T20:00:00.000Z": "Our flag now flies at half-staff to honor the lives we've lost, and will lose, to #COVID19 .\n\nSadly, I can't tell you when we'll raise it again - the worst of this crisis is still ahead.\n\nThis flag is a reminder that we must continue to do our part to stop the spread of #COVID19 .", "2020-04-09T18:38:08.000Z": "Earlier today, I announced that schools will remain closed for the rest of the academic year.\n\nThis was a tough but necessary decision to keep PA'ians safe.\n\nThe @PADeptofEd is working with schools to make sure students are getting the education they need. Governor Wolf Extends School Closure for Remainder of Academic Year Continuing his efforts to protect the health and safety of students and communities during the COVID-19 pandemic, Governor Tom Wolf today announced that all schools will remain closed for the... governor.pa.gov", "2020-04-09T18:34:08.000Z": "LIVE NOW: @PAHealthDept provides an update on efforts to mitigate COVID-19 in PA.\nWatch live: http:// governor.pa.gov/live .\nEn español: http:// pacast.com/live/es . April 9 COVID-19 Update Join us for an update on the spread of COVID-19 in the commonwealth and our latest education plans. facebook.com", "2020-04-09T17:58:34.000Z": "Today at 2:30 PM, @GovernorTomWolf and @PAHealthDept will provide an update on the coronavirus known as COVID-19 and efforts to mitigate the virus in Pennsylvania. Watch live at http:// governor.pa.gov/live . Pennsylvania Governor's Office LIVE Watch the live stream from the Office of the Governor. governor.pa.gov", "2020-04-09T18:00:01.000Z": "\"There's no value you can put on human life.\"\n \nA Pennsylvania man is dedicating his time to making masks for health care workers.  #PAProud Fayette Co. man 3D printing masks at home for healthcare workers A Fayette County man is using his time, money and resources to help make masks for healthcare workers. wpxi.com", "2020-04-09T14:33:26.000Z": "Continuing his efforts to protect the health and safety of students and communities during the COVID-19 pandemic, @GovernorTomWolf today announced that all schools will remain closed for the remainder of the 2019-20 academic year. Governor Wolf Extends School Closure for Remainder of Academic Year Continuing his efforts to protect the health and safety of students and communities during the COVID-19 pandemic, Governor Tom Wolf today announced that all schools will remain closed for the... governor.pa.gov", "2020-04-09T14:36:12.000Z": "Read more about this announcement here Governor Wolf Extends School Closure for Remainder of Academic Year Continuing his efforts to protect the health and safety of students and communities during the COVID-19 pandemic, Governor Tom Wolf today announced that all schools will remain closed for the... governor.pa.gov", "2020-04-09T14:30:00.000Z": "In order to keep as many Pennsylvanians as possible safe, schools will remain closed for the rest of the academic year.\n \nSpecial thank you to everyone who is doing their part to ensure our kids continue to learn and grow, even during these tough times.", "2020-04-09T01:37:49.000Z": "Thankful for our health and our multiple walks each day (masks by @jmnelson26 and @hannahnel6 ). #StayHome  #BeSafe  #Masks4All  #MaskUpPA", "2020-04-09T12:00:01.000Z": "This isn't easy, Pennsylvania.\n \nBut the more we avoid contact with others right now - the fewer people who get sick and the fewer people we lose to #COVID19 - the better off we will be on the other side of this.", "2020-04-08T20:15:18.000Z": "Today we added a statewide map where COVID-19 testing is occurring. \n\nSites may require preregistration or a doctor's script in order for a test to be taken, so please check with your health care provider before going to a testing site. View locations: https:// bit.ly/PACOVID19Testi ng ", "2020-04-08T20:00:55.000Z": "Chag Pesach Sameach to all Pennsylvanians celebrating #Passover . And a special thank you for staying safe by avoiding gatherings and celebrating at home. Quote Tweet Pennsylvania @PennsylvaniaGov Happy #Passover , Pennsylvania!", "2020-04-08T18:39:46.000Z": "Our teams have created a new Hospital Preparedness Dashboard that provides county-level information about how many beds and ventilators are in use and available to meet our health care needs.\n\nView the dashboard: http:// bit.ly/CoronavirusPAD OH   #COVID19", "2020-04-08T18:35:03.000Z": "We're also launching a new health care dashboard.\n \nIt provides critical, county-level information on the status of medical needs across the commonwealth.\n \nWe want Pennsylvanians to have access to the knowledge of how we are continuing to battle #COVID19 . Gov. Wolf Signs Order to Provide Targeted Distribution of COVID-19 PPE and Supplies to Hospitals Among myriad actions to support Pennsylvania's health care system during the COVID-19 pandemic, Governor Tom Wolf today signed an order to provide critical aid to hospitals with targeted PPE and... governor.pa.gov", "2020-04-08T18:35:02.000Z": "Today, I'm signing an order to allow the transfer of life-saving equipment between medical facilities.\n \nTo combat #COVID19 we need to be equipped at every hospital in every corner of the commonwealth.\n \nThis way, sick Pennsylvanians can be treated without worry.", "2020-04-08T18:30:31.000Z": "LIVE NOW: @GovernorTomWolf and @PAHealthDept provide an update on the efforts to mitigate the spread of COVID-19 in Pennsylvania. Watch live at http:// governor.pa.gov/live . April 8 COVID-19 Update Join us for the latest developments on COVID-19 and how Pennsylvania plans to help hospitals and staff during and after the pandemic. facebook.com", "2020-04-08T16:00:00.000Z": "┏┓\n┃┃╱╲ in\n┃╱╱╲╲ this\n╱╱╭╮╲╲house\n▔▏┗┛▕▔ we\n╱▔▔▔▔▔▔▔▔▔▔╲\nSTAY (unless we need fresh \nair, health care, food, or medicine)\n╱╱┏┳┓╭╮┏┳┓ ╲╲\n▔▏┗┻┛┃┃┗┻┛▕▔\n \nStay calm, stay home, stay safe. #COVID19", "2020-04-08T15:00:00.000Z": "Staying home saves lives.\n \nStay calm, stay home, and stay safe. #COVID19", "2020-04-08T12:00:00.000Z": "The #2020Census determines how much federal funding #Pennsylvania receives for: healthcare food security education transportation housing and more\n\nHelp shape YOUR future in PA. Find more details at http:// pa.gov/census . #pacounts"}