{"2020-07-28T00:32:42.000Z": ". @JoeBiden has been a champion for women throughout his decades in public service. As President, he'll execute an incredibly ambitious vision to protect women's access to health care, support working families & promote economic equality. Quote Tweet Joe Biden @JoeBiden These policies aren't just the right thing to do - they're also the smart thing to do for the future of our country.", "2020-02-21T20:55:16.000Z": "Bloomberg LP has identified 3 NDAs signed over the past 30+ years with women to address complaints about comments they said I had made. \n\nIf any of them want to be released from their NDAs, they should contact the company and they'll be given a release. https:// mikebloom.bg/2Va9EnR", "2020-02-05T20:52:35.000Z": "Governor @GinaRaimondo has been a trailblazer in Rhode Island. She's made record investments in infrastructure and education and continues to lead the fight against the opioid crisis.\n\nShe gets the tough things done, and I am honored to have her on our team.", "2019-11-17T17:07:37.000Z": "Democrats know that we can be competitive anywhere-in red, blue and purple states-when we talk about issues that matter most to voters. Congrats to @AndyBeshearKY and @JohnBelforLA on big wins!", "2019-09-25T20:57:51.000Z": "This isn't an endorsement. But I agree with Andy. Quote Tweet Andy Moffit @AndyMoffit Through 25 years of friendship, Gina and I have always been inspired by @CoryBooker 's love for America. His call for unity and inclusion goes to the heart of our nation's challenge. http:// corybooker.com/together", "2019-05-29T19:00:29.000Z": "Shannon is an inspiration to every mom fighting to build a better, safer country for our kids. Her story reminds us that, together, we can be a powerful force for change -- and that you should never underestimate a mom's ability to get things done. Quote Tweet Shannon Watts @shannonrwatts TODAY'S THE DAY! My new book, Fight Like a Mother, is out and available on Amazon and book stores near you!\n\nPart memoir, part manual, part manifesto, a majority of proceeds will go to gun safety groups like @MomsDemand .\n\nTweet me selfies with your copies!", "2018-12-25T22:40:12.000Z": "I am heartbroken to hear that Laura Rodríguez has passed. She was the most determined and relentless advocate. She lent her voice to issues and causes that have made our state better and stronger. Her presence will be missed, but her impact on our community is lasting.", "2018-12-01T15:05:11.000Z": "I'm excited and honored to lead the @DemGovs . Across the country, Democratic Governors are bringing the change that Americans need and standing up for job training, health care, and education. 2019 DGA Chair Governor Gina Raimondo youtube.com", "2018-11-07T04:10:16.000Z": "Let's keep going. Go faster. And keep bringing the change.", "2018-11-07T02:40:01.000Z": "Thank you, Rhode Island.", "2018-11-07T01:34:03.000Z": "", "2018-11-07T00:30:00.000Z": "Polls close in 30 minutes. If you're in line before 8p, you can still vote.\n\nVote today.", "2018-11-07T00:00:01.000Z": "There's still time to vote to protect the change Rhode Island needs.\n\nPolls close at 8p.", "2018-11-06T23:29:00.000Z": "Rhode Islanders deserve affordable access to high quality healthcare, including women's healthcare. I've stood up to President Trump when he's tried to take that away, and will continue to stand up when his administration tries to hurt Rhode Islanders.\n\nPolls open until 8p.", "2018-11-06T22:12:00.000Z": "Polls are open until 8p.\n\nLet's keep bringing the change that Rhode Islanders need.", "2018-11-06T12:47:05.000Z": "#BeAVoter today and support @GinaRaimondo : Highest # of jobs in R.I. History Lowest unemployment in 3 decades We're fixing our roads and schools after decades of neglect", "2018-11-06T21:11:01.000Z": "Did you know that the unemployment rate in the trades was ~25% four years ago?\n\nIn the last four years, we're fixing roads and bridges, we've spark redevelopment across the state, and we're back at work fixing school buildings. And we've created 1000s of jobs.\n\nVote today.", "2018-11-06T19:34:30.000Z": "Tripled the number of Pre-K classes State-wide all-day Kindergarten Computer science in every school (elementary, middle and high school)\n\nI'll keep going for Rhode Island students.\n\nVote today.", "2018-11-06T19:27:07.000Z": "Stopped into Julian's for some Election Day fuel. Let's keep bringing the change! Polls are open until 8p.", "2018-11-06T17:45:26.000Z": "Rhode Islanders are hitting the polls. Our neighbors want to keep bringing the change. Have you voted yet?", "2018-11-06T17:08:00.000Z": "We can do this, Rhode Island.\n\nLet's keep bringing the change.\n\nVote today.", "2018-11-06T15:11:00.000Z": "Rhode Island was the 4th state in America to make community college tuition-free, and our RI Promise Scholarship program is outperforming the model program from Tennessee. @MayorFung will end RI Promise. \n\nI want to expand it. \n\nVote today.", "2018-11-06T14:17:25.000Z": ". @AndyMoffit and I voted this morning to protect our change and progress, and to make a once-in-a-generation investment to fix our school buildings.", "2018-11-06T14:00:02.000Z": "Polls in New Shoreham just opened. All polls in Rhode Island are now open and will stay open until 8p.\n\nVote today.", "2018-11-06T13:41:00.000Z": "When I took office, Rhode Island had the worst roads and bridges in America and no plan to fix them. Since then, we've gotten to work fixing our infrastructure and we've created thousands of jobs along the way. \n\nVote today.", "2018-11-06T12:48:00.000Z": "Over the last four years, we've tripled the number of Pre-K classes in RI and brought all day kindergarten to every community.\n\nIn my second term, we'll bring universal Pre-K to RI.\n\nVote today.", "2018-11-06T12:00:00.000Z": "Polls just opened. Please get out to vote today to protect our progress and send a signal that we need to keep bringing change to Rhode Island.", "2018-11-06T11:14:00.000Z": "Today's the day! Polls open at 7a (except on Block Island where it's 9a).\n\nFor four years we've been bringing change RI needs: 19K new jobs Fixing roads and bridges Tuition-free community college Record investments in PK-12 #1 wage growth in 2017\n\nLets keep going.", "2018-11-06T00:47:54.000Z": "This summer, @GinaRaimondo banned concealed weapons from RI's school grounds because our kids deserve safe schools. @MayorFung is endorsed by the @NRA and doesn't believe we should ban guns from schools.\n\nVote tomorrow.", "2018-11-06T00:37:27.000Z": "We're making the final push tonight in Johnston. My opponents want to send Rhode Island backwards, but I won't let that happen. I humbly ask for your support tomorrow so we can keep bringing the change Rhode Island needs. #LetsKeepGoing", "2018-11-05T23:54:02.000Z": "Let's keep bringing the change Rhode Islanders need.\n\nThere are more jobs in RI than ever before.\n\nUnemployment is below 4 percent for the first time since 1989.\n\nLets keep going.", "2018-11-05T21:05:44.000Z": "Excellent pastries at L'Artisan in Wayland Square this afternoon. \n\nIt was great running into supporters and some old friends while I was there. Everywhere I go, Rhode Islanders seem excited to vote tomorrow to protect the change and progress we're bringing.", "2018-11-05T20:02:45.000Z": "Earlier today, Senator Whitehouse and I stopped in to thank some of the nurses at Women and Infants for everything they do to care for Rhode Islanders. I will always stand up to protect Rhode Islanders' access to healthcare.", "2018-11-05T17:00:08.000Z": "Former US Rep Patrick Kennedy taped a robo-call that went out in Bristol last night supporting @GinaRaimondo  @SenWhitehouse  @davidcicilline - and Democratic Town Clerk nominee @MelissaC_KG", "2018-11-05T15:45:07.000Z": "Thank you Seven Stars for helping to keep us going on the last day before Election Day.", "2018-11-05T15:16:32.000Z": "People are back on the job and there are cranes in the sky!\n\nIt was great to start the day with tradesmen and tradeswomen in downtown Providence who are working again thanks to our investments, job training, and focus on economic development.", "2018-11-05T13:36:25.000Z": "There is ONE DAY to go. Election Day is tomorrow. \n\nWe've come so far in four years. We're bringing the change RI needs. We can't put that progress at risk. \n\nI humbly ask for your support tomorrow so we can keep going and keep bringing the change RIers need.", "2018-11-05T00:46:00.000Z": "I love this! Thank you, Ali! https:// twitter.com/MrBatianoRI/st atus/1059238540784082946  This Tweet is unavailable.", "null": "", "2018-11-04T23:34:55.000Z": "Rhode Islanders are fired up to protect the change and progress we're bringing! We had a great rally with @Jorge_Elorza , @repgracediaz and other RIers who want to keeping bringing change to RI.", "2018-11-04T22:00:16.000Z": "As Governor, there is no greater or more humbling honor than being Commander in Chief of the RI National Guard. I am so deeply touched by the sacrifices our servicemembers and military families make. I was so proud to welcome our RING soldiers home today. Quote Tweet Jon Romano @romanojon I'm in awe of the sacrifice our RI National Guardsmen and Guardswomen make. I had the opportunity to be with my boss, @GovRaimondo ,  today when she welcomed RING soldiers home today after a year-long deployment.", "2018-11-04T19:49:14.000Z": "Our team is out across the state knocking on doors and talking with voters about what's at stake on Tuesday for hardworking families and our kids' futures. We can't afford to go backwards, and we can't put our progress and change at risk.", "2018-11-04T18:33:55.000Z": "Thank you to everyone at Sts. Sahag and Mesrob Armenian Church for welcoming me to the annual Food Fair and Bazaar today. \n\nEvery time I'm with the Armenian community, I'm reminded that RI was founded on a principle of inclusion. I'll always stand up to protect those values.", "2018-11-04T17:00:00.000Z": "We're starting our Sunday of GOTV weekend off right with Mass and some time with our friends at the St. Raymond's annual Christmas Bazaar. I'm so thankful for the support and encouragement I'm getting from so many people who want to keep bringing change to RI.", "2018-11-04T14:01:28.000Z": "Two days to go. Let's keep going, and let's keeping bringing the change that's helped create nearly 20,000 jobs, drive our unemployment rate below 4 percent, and ensure that nearly every RIer has health insurance. #BeAvoter ⁠ ⁠", "2018-11-03T22:52:24.000Z": "Canvassing into the night for @GinaRaimondo with @Sterl_Carpenter  #GOVOTE NOV. 6", "2018-11-03T20:57:39.000Z": "Our promise to keep bringing the change and progress Rhode Islanders need got a great reception in Cranston today at the Greek Food Fair and Christmas Bazaar.", "2018-11-03T18:50:03.000Z": "I popped in to surprise some of our #GOTV volunteers in Warwick today. The Rhode Islanders we're talking to across the state don't want to go backwards. They want to see us protect the change and progress we've made over the last four years. \n\n3 days to go!", "2018-11-03T18:24:28.000Z": "I was proud to take a couple minutes off the campaign trail today to speak at the Rally for Peace. As Governor, I've strengthened our gun safety laws and signed the nation's first executive order to establish a Red Flag policy. I'll keep fighting to keep Rhode Islanders safe.", "2018-11-03T14:46:07.000Z": "Thank you to all the volunteers out knocking doors and making calls this weekend. Let's protect the change we've brought to RI so we can give our kids the future they deserve.", "2018-11-03T13:06:22.000Z": "It's three days until Election Day. I've been rooting for Rhode Island and Rhode Islanders since day one. \n\nTogether, we've created nearly 20,000 jobs in the last four years, and we'll do even more in the next four: Universal job training Universal Pre-K Expand RI Promise", "2018-11-02T20:39:38.000Z": "I'll never stop rooting for RI and the Blackstone Valley! \n\nWe broke ground today on the Pawtucket/Central Falls Train Station today. I will keep investing in our infrastructure, and I'm determined to protect and build upon the progress we've made in Northern Rhode Island.", "2018-11-01T23:57:53.000Z": ". @GinaRaimondo already did this. It's called the Wavemaker Fellowship. But you've already said you'd end it. Quote Tweet Mayor Allan Fung @AllanFungRI I would freeze RI Promise and support students on the back end to help give releif to students who stay and work in RI #WeCanDoBetter", "2018-11-01T23:51:53.000Z": "Today in RI, we have: \n\nLowest unemployment rate in 30 yrs Most roadwork happening in decades Record investments in fixing our schools Renewable energy efforts underway VOTE this Tuesday (11/6) to let @GinaRaimondo finish the job.", "2018-11-01T23:50:22.000Z": "Mayor Fung roots against Rhode Island. He was vocally opposed to any attempt to keep the PawSox in RI and when they left he pointed fingers.", "2018-11-01T23:49:19.000Z": "\"He ( @MayorFung ) is lying. He's politicizing public safety to get votes before the election.\" - @GinaRaimondo", "2018-11-01T23:32:36.000Z": "DCYF was broken before Gina took office and she's worked hard to turn the agency around. @MayorFung 's record on child welfare speaks for itself: Cranston kids didn't have access to all-day K He was silent when Trump tried to take health care away from kids", "2018-11-01T23:31:08.000Z": "We've learned from the mistakes of UHIP. Gina's apologized, put new leadership in place and held Deloitte accountable. And we're now seeing progress: Wait times down; 90%+ of applications processed on time. https:// wpri.com/target-12/lobb y-wait-times-down-at-dhs-as-computer-issues-ease/1349480378 ", "2018-11-01T23:30:16.000Z": "The majority of Rhode Islanders - including Gina - believe that we need to ban assault weapons. @MayorFung disagrees. That's why he has an 'A' rating from the NRA. Campaign 2018 poll: Hot-button issues divide R.I. voters, lawmakers and Catholic church A statewide poll reveals a deep disconnect between voters, State House leaders and Bishop Thomas Tobin on issues such as abortion and guns. providencejournal.com", "2018-11-01T23:29:49.000Z": "", "2018-11-01T23:27:09.000Z": "Gina has stood up for better, safer gun laws and safer schools: Banned concealed carry firearms in schools 1st governor to sign Red Flag EO after Parkland Signed Red Flag Law Banned bump stocks Took guns away from abusers", "2018-11-01T23:26:02.000Z": "Every RIer deserves a shot. Gina will bring Universal Job Training to Rhode Island in her second term: Protect RI Promise scholarship Expand RI Promise for adults Two years tuition-free college at URI & RIC Double Real Jobs RI\n\n(P.S. @MayorFung opposes all of it.)", "2018-11-01T23:25:30.000Z": "RI Promise outperformed Tennessee Promise in its first year. TN Promise is the legacy initiative of Bill Haslam, a GOP governor, and was heralded as a national model by @BarackObama , a Democrat.", "2018-11-01T23:23:39.000Z": "RI was the fourth state in the US to guarantee every HS grad a shot to get a degree tuition-free. In a second term, Gina will bring the @RI_Promise scholarship to URI and RIC, and expand the CCRI program to adults.", "2018-11-01T23:23:20.000Z": "Every child deserves a school that is safe, warm and dry. That's why Gina lifted the previous administrations' freeze on school construction and is fighting for a once-in-a-generation statewide investment to fix our school buildings.", "2018-11-01T23:22:16.000Z": "Gina revamped job training in Rhode Island. Instead of train and pray, she's working with employers to train RI for real jobs that exist right now.", "2018-11-01T23:21:45.000Z": ". @ProJo edit board on Gina's Q1: \"[Raimondo] decided to do something about the problem, and [has] placed a bond measure on the ballot to help begin the work. It deserves Rhode Islanders' full support.\" @MayorFung was opposed until just a few weeks ago. Editorial: Vote yes on Question 1 For years, Rhode Island has had a problem with deteriorating schools. Many have become depressing and even dangerous places for students and teachers going about the serious business of education.... providencejournal.com", "2018-11-01T23:21:11.000Z": "", "2018-11-01T23:20:19.000Z": "Gina's commitment to K-12 education: Record investments Ended school building freeze Tripled Pre-K classes Universal Pre-K in 2nd term Statewide All-Day K Free PSAT & SAT College credits in HS Revamped CTE Teaching computer science in every school", "2018-11-01T23:17:02.000Z": "Under Gina's leadership there are more jobs in Rhode Island than ever before.", "2018-11-01T23:15:10.000Z": "Our economic development initiatives will create $270M in new net revenue that we can invest in schools, roads, job training and tax cuts. @MayorFung will gut it and send us backwards.", "2018-11-01T23:14:51.000Z": "More than 25 companies have expanded or relocated to Rhode Island creating more than 3,200 new full-time jobs thanks to the Governor's smart economic development programs and our state's skilled workforce.", "2018-11-01T23:12:15.000Z": "After years on the sidelines, we're competing with other states, and it's working. 3,500+ jobs that pay an average of $64K/year. @MayorFung says he's opposed to the programs, but that means he's against these jobs.", "2018-11-01T23:10:13.000Z": "Gina's record on taxes: Cut the car tax  Cut the sales tax on energy  Cut the UI tax employers pay  Cut the keg tax  Cut the corporate minimum tax  @MayorFung , OTOH, raised taxes six times, including the car tax.", "2018-11-01T23:07:50.000Z": ". @MayorFung has raised taxes 6 times and sent Cranston back to distressed status.", "2018-11-01T23:06:40.000Z": "Gina's been an outsider her whole career and she's bringing change to RI. She fought for campaign finance and ethics reform, and campaigned for the Line Item Veto. @MayorFung , OTOH, was a Smith Hill lobbyist for the insurance industry and has been a politician for 15+ years.", "2018-11-01T22:58:04.000Z": "Final round and ready to go!", "2018-11-01T13:25:26.000Z": "The election is in five days. It's a choice between protecting the change and progress we've brought to Rhode Island or sending our state backwards.\n\nLet's keep going.", "2018-10-31T22:47:15.000Z": "Lots of candy is in store for these trick or treaters! Wishing everyone a happy and safe Halloween.", "2018-10-31T01:29:09.000Z": "I'm proud of what we've done these past four years to strengthen our cities and towns, and what we'll do in the next four years to build on that progress and change. \n\nThank you, Lt. Gov. McKee and Mayors for your support. Let's keep going.", "2018-10-29T17:20:17.000Z": "Way to go Nacasia! \n\nIn my second term, I want to expand RI Promise so adults can go to CCRI tuition-free, too. And bring it to URI and RIC for recent HS grads. \n\nThanks for everything you guys do at @fntpvd to support our local economy. (And congrats on the new 2nd location!) Quote Tweet Frog & Toad @fntpvd Anecdotal note about @RI_promise : our Hopeworks program graduate Nacasia is a student at CCRI, working 2 jobs (here and @henrybearspark ) AND holding down Bs in ALL her classes! Thank you #RIpromise  @GovRaimondo", "2018-10-29T13:12:03.000Z": "It's so great to wake up in @RedSox Nation the morning after winning the World Series! Congrats to the entire team and Sox fans across RI and everywhere else.", "2018-10-28T23:59:22.000Z": "Let's go @redsox . Bring it home tonight! #DoDamage", "2018-10-28T17:13:03.000Z": "Great to be with the mighty, energetic Providence Ward 5 Democratic Committee this morning. We're rallying the team to get out the vote! Nine days to go to protect the change we're bringing to RI.", "2018-10-28T13:48:18.000Z": "I'm honored and humbled to receive the @ProJo 's endorsement for reelection. We're bringing the change that RI needs. Let's keep that going. http:// providencejournal.com/opinion/201810 27/editorial-for-governor-gina-raimondo ", "2018-10-27T15:45:24.000Z": "There should be no room for hate in our society.", "2018-10-27T15:44:45.000Z": "The reports of the shooting and lives lost in Pittsburgh this morning are heartbreaking. I'm praying for the entire Tree of Life congregation and Pittsburgh community. I'm also praying that our national leaders end the crisis of inaction and do something to end gun violence.", "2018-10-27T15:08:43.000Z": "Some things needed to change so our kids can grow up to enjoy the things we hope never change. Job training for good jobs. Investments that are putting cranes in the sky. Record funding for education.\n\nThere are 10 days to go. Let's keep bringing the change RI needs.", "2018-10-25T18:48:21.000Z": "Halloween costumes and a game of bingo always make for a fun time. Thanks to the Cumberland Senior Center, Cherry Hill Manor and Johnston Senior Center for having me!", "2018-10-23T23:58:25.000Z": "Let's go @RedSox ! #DoDamage", "2018-10-22T18:04:59.000Z": "I was joined by federal and state officials this morning to get an up-close look at RIPTA's first zero-emission electric buses. RI is committed to a cleaner & greener future, and these buses mark the beginning steps of our air quality improvement plan to reduce harmful emissions.", "2018-10-21T17:27:56.000Z": "Yesterday's @NERCC Local 330 election rally was a great show of support ahead of November 6th. Thank you for all you are doing -- together we will keep moving Rhode Island forward.", "2018-10-20T16:59:44.000Z": "So much spirit this morning at The Johnston High School Homecoming parade! What a great way to celebrate this long-standing tradition.", "2018-10-19T23:17:41.000Z": "Thanks, Dave! Dave youtube.com", "2018-10-19T23:17:40.000Z": "Thank you @mfgri . Let's keep going. Together, we're rebuilding and reinventing our manufacturing industry. I'll keep working to strengthen our economy and protect our progress. Quote Tweet RI Manufacturers @mfgri Read RIMA Exec Dir. Dave Chenevert's op-ed in the @projo on our endorsement for @GinaRaimondo 's re-election. http:// providencejournal.com/opinion/201810 18/my-turn-dave-chenevert-governor-boosts-ri-manufacturing?rssfeed=true ", "2018-10-19T13:47:42.000Z": "I'm proud of what we've done over the last four years to revive manufacturing in RI and help RI manufacturing workers stay competitive. \n\nWe added 600 new manufacturing jobs last month. \n\nWe're bringing change to RI and I won't let us go backwards. My Turn: Dave Chenevert: Governor boosts R.I. manufacturing The Rhode Island Manufacturers Association recently announced its first-ever endorsement of a political candidate, Gov. Gina M. Raimondo. I write to explain why our non-partisan organization decided... providencejournal.com", "2018-10-18T21:51:26.000Z": "Thank you, Mayor!\n\nTwo years ago, @JamesDiossa brought a group of bipartisan mayors together to rally support for RI Promise. Together, we'll expand it so more Rhode Islanders can get the education and job training they need to compete for jobs that companies are creating here. Quote Tweet James A. Diossa @JamesDiossa The RI Promise program has allowed our students to pursue their dreams of attending college at CCRI. I support our Governor Gina Raimondo's vision of expanding this program to RIC and URI. This is one of many reasons why I stand with her and ask RI to re-elect her on November 6!", "2018-10-18T20:57:37.000Z": "How have we driven our unemployment down from the highest in the U.S. to the lowest since 1989? Investments in things like RI Promise & job training. I want to expand the Promise Scholarship to RIC and URI. @MayorFung wants to end it. I won't pull the rug out from under students.", "2018-10-18T14:17:37.000Z": ". @MayorFung (a college freshman the last time unemployment was this low) wants to gut our job training and economic development programs. He'd willingly make RI less competitive. We can't afford to go backwards. Rhode Islanders will get hurt and their livelihoods will be at risk.", "2018-10-18T14:15:37.000Z": "Our job training and economic development approach is working. We've created 19,300 jobs since 2015 and our unemployment rate is the lowest it's been since 1989. (I was still in high school in 1989.)", "2018-10-17T22:48:25.000Z": "We're taking steps towards a renewable energy future here in Rhode Island. The ribbon cutting of @SouthernSkyRE 's new solar array in North Providence today brings us closer to this goal. #LetsKeepGoing", "2018-10-17T13:40:28.000Z": "\"I've met an awful lot of governors, but Gina's the first who actually did something to help us create jobs.\" - Dave Chenevert, executive director of the RI Manufacturers Association.", "2018-10-16T20:18:26.000Z": "TODAY is the last day to request a mail ballot application. There's so much at stake on November 6th, and every vote counts. Find out how to submit your request here: https:// vote.sos.ri.gov/ovr/voters/vot e_by_mail ", "2018-10-16T18:40:14.000Z": "So many engaged voters this morning at Laurelmead! Thank you for your thoughtful questions and for sharing some Wayland Bakery pastries with me.", "2018-10-16T00:05:31.000Z": "Real change is happening in Rhode Island. Our unemployment rate is the lowest it's been in 20 years. Roads and bridges are being fixed across the state. And record investments have been made in school construction.\n\nVOTE November 6th to let Gina finish the job.", "2018-10-15T23:53:54.000Z": "Before RhodeWorks, Rhode Island had the worst bridges and roads in America. Today, for the first time in at least a generation, we're making necessary investments to improve our infrastructure - and we're creating thousands of jobs along the way. #LetsKeepGoing", "2018-10-15T23:52:29.000Z": "There's a lot at stake in this election. My opponents oppose the changes we've been making and will undo a lot of what's been working. They'll take us back to old way of doing things and Rhode Islanders will lose jobs and get hurt.\n\nI won't let that happen.", "2018-10-15T23:51:05.000Z": "\"We need to do everything we can. We're the Ocean State.\" - @GinaRaimondo on protecting the coast line", "2018-10-15T23:48:03.000Z": "Gina's taking concrete steps to achieve a clean energy future: First and only state with an operational off-shore wind farm Created 5,500 green jobs since 2015 Committed to a future of offshore wind power - not offshore oil drilling #LetsKeepGoing", "2018-10-15T23:43:08.000Z": "Gina stands with the vast majority of Rhode Islanders and will sign the bill to protect women's access to reproductive health care. \n\n@TrilloforGov will not.  @MayorFung doesn't know.", "2018-10-15T23:42:07.000Z": "\"Stop politicizing public safety. It's wrong.\" - @GinaRaimondo", "2018-10-15T23:38:02.000Z": "\"City of Cranston, Mayor Fung - he'd like to meet with Curt to discuss moving his gaming company to Cranston, RI. He would discuss all available incentives.\" - email from C. Schilling's personal flack to Tom Zaccagnio, 38 Studios board member. I-Team: Former high level staffer recalls 38 Studios conversations with Fung A former director of administration for Cranston Mayor Allan Fung says she and the mayor had informal discussions on the possibility of 38 Studios coming to Cranston in 2010. turnto10.com", "2018-10-15T23:25:16.000Z": "Kids learn the building blocks in preschool. Gina's tripled the number of PreK classes in RI, and will guarantee every 4yo a spot in Pre-K in her second term. https:// wpri.com/news/top-video /raimondo-pledges-universal-pre-k-as-rivals-campaign-across-ri_20180911003921/1432748848 ", "2018-10-15T23:24:11.000Z": "Gina's commitment to K-12 education: Record investments Ended school building freeze Tripled Pre-K classes Universal Pre-K in 2nd term Statewide All-Day K Free PSAT & SAT College credits in HS Revamped CTE Teaching computer science in every school", "2018-10-15T23:20:40.000Z": "Under Gina's leadership, Rhode Island is now one of five states to offer access to tuition-free community college. \n\n. @MayorFung will take away the progress we've made to make sure every student gets a good education. We can't let that happen.", "2018-10-15T23:19:49.000Z": "", "2018-10-15T23:18:47.000Z": "A few hundred dollars should never keep someone from getting a college degree. The RI Promise scholarship is a game changer for RI families and RI employers. Let's expand it to URI and RIC.", "2018-10-15T23:13:09.000Z": "Rhode Islanders are better off today than they were four years ago:\nJobs Wages Unemployment Affordable, accessible health care. All-day Kindergarten. Tuition free community college. Safer gun laws. Fixing roads and bridges.", "2018-10-15T23:09:59.000Z": "Everyone hates the car tax, so Gina cut it. (Allan expanded the car tax in Cranston.)", "2018-10-15T23:09:29.000Z": "FACT CHECK: Under Gina's direction, we've saved $100M+ in health care and reinvested in job training, infrastructure, education, tax cuts and economic development.", "2018-10-15T23:06:34.000Z": "This election is about change or bringing Rhode Island backwards. I'm for change.", "2018-10-15T22:58:45.000Z": "Round two - let's go!", "2018-10-15T22:47:50.000Z": "Counting down the minutes until the second gubernatorial debate with some of the greatest supporters around!", "2018-10-15T21:38:17.000Z": "My staff will be tweeting during the @projo / @ThePublicsRadio / @universityofri debate tonight at 7p. \n\nI'm looking forward to talking with RIers about how we're bringing change to RI & how we'll keep moving RI forward. here: http:// stream.uri.edu  on 89.3FM.", "2018-10-14T19:14:18.000Z": "It was an honor participating in the celebration of Pchum Ben - a beautiful Cambodian holiday - this morning at The Buddhist Center of New England.", "2018-10-14T12:04:47.000Z": "For four years, I've been bringing change to RI. One of the first things I did after taking office was lift the freeze on school construction. Let's keep going. It's time to make a once-in-a-lifetime, statewide investment to fix our school buildings. Editorial: Vote yes on Question 1 For years, Rhode Island has had a problem with deteriorating schools. Many have become depressing and even dangerous places for students and teachers going about the serious business of education.... providencejournal.com", "2018-10-12T17:08:35.000Z": "Today, 22% more Latinos are working, wages are higher and 150% more Latino students go to CCRI tuition free. \n\nIt was great to discuss the progress we've made over the past four years with @lamega949fm this morning. Thanks for the conversation!", "2018-10-12T13:41:55.000Z": "Raimondo touts cuts in business regulations PROVIDENCE, R.I. - The state has eliminated almost a third of its regulations in the last two years, Gov. Gina Raimondo said Thursday afternoon flanked by small business owners at an East Side ice... providencejournal.com", "2018-10-11T21:44:26.000Z": "We're making it easier to do business here in RI. By cutting thousands of pages of regulations and cutting red tape, local entrepreneurs are getting the support they need to compete in today's economy. #LetsKeepGoing", "2018-10-11T16:09:59.000Z": "Joined with Regional Sky this morning to announce a new weekday direct flight from @tfgreenairport to Montreal! Starting November 5th, all Rhode Islanders will travel #EasierFasterFurther", "2018-10-11T14:39:03.000Z": "We've worked closely to make record investments in K-12 schools, make community college tuition free, rebuild our school buildings, strengthen Rhode Island's gun laws and address mental health. I look forward to building on that progress in the next four years. 2/2", "2018-10-11T14:38:23.000Z": "Teachers and educators have incredibly difficult and incredibly important jobs. I'm proud to have their support. We've had our differences in the past, and we've had frank, honest conversations over the years. 1/2 Quote Tweet NEARI @NEARhodeIsland The National Education Association Rhode Island Political Action Committee for Education (NEARI-PACE) , in a special meeting, voted last night to recommend Gina Raimondo for Governor. Read the full statement here: http:// bit.ly/PACE-GR", "2018-10-10T17:39:19.000Z": "We're investing in job training and supporting RI businesses to provide manufacturing workers with economic security. I'm so honored and humbled to receive @MFGRI 's first-ever endorsement. Let's keep going.", "2018-10-09T22:20:08.000Z": "Thanks to our 10,000 Small Businesses partnership, job-creation is the new reality for local businesses in the Ocean State. \n\nThe 10,000 Small Business Graduation today showed firsthand the change we're bringing - and that real businesses are getting real results.", "2018-10-09T15:12:43.000Z": "I'm proud of what we've done over the last four years to strengthen RI's economy and support small businesses. We've made real changes that are creating real opportunities for Rhode Islanders. My opponents want to take us backwards. I won't let that happen. Quote Tweet Mike Raia @mikeraia . @GinaRaimondo created the state's first small business loan program, established the nation's first statewide 10,000 Small Businesses partnership, and has cut taxes, cut regulations and cut red tape. She's bringing the change that small businesses need. Show this thread", "2018-10-08T20:08:43.000Z": "Celebrated the closing of Festa Italiana at Newport's Columbus Day Parade this afternoon -- a great wrap to the holiday weekend", "2018-10-08T16:41:04.000Z": "Kicked off Columbus Day at the Autumnfest Parade in Woonsocket this morning! What a festive way to celebrate the long weekend.", "2018-10-08T14:44:25.000Z": "", "2018-10-08T14:43:38.000Z": "Did you see yesterday's @ProJo ? RI's economy keeps getting stronger. I want to continue and expand the successful job training and economic development programs we've created. @MayorFung & @TrilloforGov\nwill gut them, putting jobs and security at risk. http:// providencejournal.com/news/20181007/ providence-journal-economic-scorecard-ris-fortunes-continue-to-brighten ", "2018-10-07T20:25:16.000Z": "From Federal Hill to Westerly, the parades and festivals of these two vibrant communities made for a morning well spent. Happy Columbus Day to all!", "2018-10-06T23:24:14.000Z": "Fun afternoon at the Wakefield Oktoberfest with @WhalersBrewing and @shaidzonbeerco - two great local small businesses here in the Ocean State. Thanks for the tasty beer!", "2018-10-06T21:08:22.000Z": "Congratulations to the @universityofri Rams on a great Governor's Cup game today! It was so fun to celebrate the victory with you all.", "2018-10-06T15:51:17.000Z": "Beautiful morning to stop by the Hope Street farmers market with Andy! Autumn is officially here", "2018-10-05T20:01:58.000Z": "Because every Rhode Islander deserves the job training they need to get a good job. Because every child deserves a great education. Because all Rhode Islanders deserve access to health care. #WhyIRun Quote Tweet EMILY's List @emilyslist There's a lot we're sad, angry, and frustrated about. And surprisingly, there's also a lot to be hopeful for. So today we're asking our pro-choice Democratic women to tell us: Why are you running for office? What are you fighting for? #WhyIRun", "2018-10-05T15:07:22.000Z": "\"[Some] will still make the inflammatory argument that the quality of education is not worth the expense. [...] Areas of study include radiology, animal science, marketing, cyber security & mechanical engineering; not exactly Coloring 101 if you ask us.\" A promise delivered In life, and especially in politics, a promise is not always something to be taken as gospel. Politicians make promises, and break them, all the time. However, just as it is important to call out  cranstononline.com", "2018-10-05T15:04:52.000Z": "\"For cynics who doubt the efficacy of a program - saying it's a waste of money or will only bring in entitled students who don't want to work hard - the argument falls pathetically flat.\" A promise delivered In life, and especially in politics, a promise is not always something to be taken as gospel. Politicians make promises, and break them, all the time. However, just as it is important to call out  cranstononline.com", "2018-10-05T15:03:26.000Z": "The Cranston Herald weighs in on RI Promise.\n\n\"[I]t is abundantly clear that this promise is being delivered upon and is achieving results for students in the state beyond expectations, and well beyond the approximately $3 million price tag to implement.\" A promise delivered In life, and especially in politics, a promise is not always something to be taken as gospel. Politicians make promises, and break them, all the time. However, just as it is important to call out  cranstononline.com", "2018-10-04T15:48:30.000Z": "In 10 years, @MayorFung has raised taxes six times.\n\nSince 2015, I've cut taxes: Eliminated social security income tax Cut corporate minimum tax small businesses pay Eliminated sales tax on energy Cut unemployment insurance tax by $40M\n\nAnd we cut the car tax.", "2018-10-04T01:55:21.000Z": "Over the past four years, we've revamped job training to make sure every Rhode Islander has a shot to compete and get ahead. There's more to do - let's keep going.", "2018-10-03T22:40:57.000Z": "Our Rhode Island Promise scholarship is opening doors to college for thousands of Rhode Islanders. \n\nAnd it's working: The number of CCRI students on track to graduate on time has nearly quadrupled. \n\nI want to expand it to URI and RIC. @MayorFung wants to end it, hurting RIers.", "2018-10-03T16:02:52.000Z": "Great start to the day celebrating the importance of recess in our schools! Thanks to #RecessRocksinRI , the power of play is alive in Rhode Island.", "2018-10-03T00:17:34.000Z": "Thank you, @RICAGV1 , for your continued advocacy to keep our state safe from gun violence. Working together, we will make change for all Rhode Islanders, especially our young people.", "2018-10-02T23:46:55.000Z": "The election is in exactly 5 weeks. We're bringing the change that RI needs, and we need to keep going to finish the job and protect the change and progress we've made.", "2018-10-02T22:20:39.000Z": "With a great crowd of volunteers opening up another Democratic Coordinated Campaign office in the great City of Pawtucket - let's get out the vote!", "2018-10-02T16:41:24.000Z": "We support @GinaRaimondo because she's the only candidate for governor with a proven record of standing up for students. Quote Tweet RI Democratic Party @RIDemParty \"As a proud Cranston native and student at URI, I can't understand why my hometown mayor @MayorFung does not support expanding tuition-free higher education options in Rhode Island.\" \n- Rachel, junior at @universityofri  https:// medium.com/@RIDemocrats/s tudents-cheer-raimondos-r-i-bef30a78d7a7 ", "2018-10-02T15:20:36.000Z": "Thank you for your support, @WeAreUNAP . Nurses and frontline caregivers play an essential role in our ability as a state to provide high quality healthcare. Quote Tweet UNAP @WeAreUNAP \" @GinaRaimondo has been accessible and responsive to the concerns of nurses and front line caregivers during her first term... we consider her an ally in the effort to advance policies that will protect patients and improve working conditions for healthcare professionals.\"", "2018-10-01T22:10:43.000Z": "\"Gina Raimondo is bringing the change that Rhode Islanders need. She's protecting Rhode Islanders' access to health care and investing in job training and education. She deserves four more years to continue this progress.\" - @BarackObama Thank you, Mr. President.", "2018-10-01T17:26:43.000Z": "I am honored to have the support of President Obama. For eight years, he brought much-needed change to our nation. Over the last four years, we've brought similar change to Rhode Island and we cannot afford to put that change at risk. #ThanksObama", "2018-10-01T17:21:17.000Z": "Thanks, Obama. Quote Tweet Barack Obama @BarackObama Today, I'm proud to endorse even more Democratic candidates who aren't just running against something, but for something-to expand opportunity for all of us and to restore dignity, honor, and compassion to public service. They deserve your vote:", "2018-10-01T01:48:00.000Z": "Thank you, @joebiden , for your support. We're bringing change to Rhode Island and strengthening the middle class. 15,000+ jobs lowest unemployment rate in nearly 20 years paid sick leave tuition-free CCRI raised the minimum wage\n\nI'm fired up to finish the job.", "2018-09-30T21:57:31.000Z": "I couldn't agree more. Quote Tweet RI Democratic Party @RIDemParty \"This election is bigger than politics. The core values that built this nation are at risk.\" @JoeBiden", "2018-09-30T21:29:22.000Z": "\"You feeling a little bit mad right now? You feeling a little bit geared up right now? You going to stay that way till November?\n\nGood! Together we are going to take our country back in November!\" @SenWhitehouse", "2018-09-30T21:22:08.000Z": "\"I don't know about you but my stomach turned during those hearings last week - women in Rhode Island should know that their rights are protected here in the great state of Rhode Island!\" - @GinaRaimondo", "2018-09-30T21:28:26.000Z": "Job training. \nTuition-free CCRI. \nJobs and security. \nHealth care.\n\nThat's what's on the ballot this November. Let's keep bringing the change Rhode Islanders need.", "2018-09-30T21:03:29.000Z": "\"Everyone always says it is the most important election of our lifetime - they're lying. THIS, November 6, actually IS the most important election of our lifetime - everything we care about is on the ballot in November!\" - @davidcicilline", "2018-09-30T20:56:49.000Z": "\"We will not let Rhode Island Trump-eteers Trump-itize Rhode Island!\" -Chairman McNamara, kicking off today's Rally with Rhode Island Democrats and @JoeBiden", "2018-09-30T20:24:08.000Z": "Tune in live for the Rally with Joe Biden and the Rhode Island Democrats right now! https:// facebook.com/ridemocrats/vi deos/951822315002707/ ", "2018-09-30T16:39:21.000Z": "Ayer tuve el placer de hablar con los líderes Latinos de Rhode Island. RI siempre será un lugar que le da las bienvenidas a todos. Seguiremos pa'lante! / I had a great time talking with RI's Latino leaders last night. RI will always be a place that is open and welcoming to all.", "2018-09-29T20:44:19.000Z": "It's a perfect afternoon in Middletown for the annual Norman Bird Santuary Harvest Festival.", "2018-09-29T18:58:22.000Z": "There are few things better than a beautiful Saturday afternoon in early fall in Rhode Island. I'm having a great time talking with Rhode Islanders about at the change we're bringing to RI at the North Providence Art in the Park Festival. Come join us.", "2018-09-28T00:03:00.000Z": "Thanks for tuning in! I can't wait to work for every Rhode Islander over the next four years.", "2018-09-27T23:56:41.000Z": "It's so clear. Gina is bringing the change Rhode Islanders need, and @MayorFung will drag us backwards. http:// GinaRaimondo.com", "2018-09-27T23:51:31.000Z": "\"I believe Christine Blasey Ford.\" - @GinaRaimondo", "2018-09-27T23:49:02.000Z": "Mayor Fung roots against Rhode Island. He was vocally opposed to any attempt to keep the PawSox in RI and when they left he pointed fingers.", "2018-09-27T23:47:28.000Z": "Our economic development initiatives will create $270M in new net revenue that we can invest in schools, roads, job training and tax cuts. @MayorFung will gut it and send us backwards.", "2018-09-27T23:45:26.000Z": "Fact Check: August was the 3rd best jobs month in RI history. There are more than 500K jobs in RI right now, and there are more people working than at nearly any other time in the last decade.", "2018-09-27T23:45:05.000Z": "Virgin Pulse to move global headquarters from Mass. to R.I. PROVIDENCE, R.I. - Health-technology company Virgin Pulse, a part of British billionaire Richard Branson's business empire, announced Monday that it's moving its global headquarters from Massachuse... providencejournal.com", "2018-09-27T23:44:34.000Z": "Wexford Innovation Center breaks ground on former highway land in Providence PROVIDENCE, R.I. - Before nearly 200 people gathered on a glorious Monday morning, Wexford Science & Technology President and CEO James Berens spoke of why he has persevered for three years to... providencejournal.com", "2018-09-27T23:40:16.000Z": "We all know how @MayorFung really feels about @realDonaldTrump :", "2018-09-27T23:39:34.000Z": "He can't hide it. @MayorFung supported @realDonaldTrump in 2016 and supports the Trump agenda today.", "2018-09-27T23:39:05.000Z": "Every student deserves to go to school that is gun-free and safe. Every teacher deserves to go to a school that is gun-free and safe. @MayorFung and @TrilloforGov disagree with that.", "2018-09-27T23:36:16.000Z": "", "2018-09-27T23:34:08.000Z": "Gina has stood up for better, safer gun laws and safer schools: Banned concealed carry firearms in schools 1st governor to sign Red Flag EO after Parkland Signed Red Flag Law Banned bump stocks Took guns away from abusers", "2018-09-27T23:31:34.000Z": "Gina's been an outsider her whole career and she's bringing change to RI. She fought for campaign finance and ethics reform, and campaigned for the Line Item Veto. @MayorFung , OTOH, was a Smith Hill lobbyist for the insurance industry and has been a politician for 15+ years.", "2018-09-27T23:30:19.000Z": "#FreeRentFung", "2018-09-27T23:24:51.000Z": "Gina's taking concrete steps to achieve a clean energy future: First and only state with an operational off-shore wind farm Created 5,500 green jobs since 2015 Committed to a future of offshore wind power - not offshore oil drilling #LetsKeepGoing", "2018-09-27T23:24:22.000Z": "Sand Hill Cove Beach is the best in Rhode Island!", "2018-09-27T23:22:52.000Z": "Before RhodeWorks, Rhode Island had the worst bridges and roads in America. Today, for the first time in at least a generation, we're making necessary investments to improve our infrastructure - and we're creating thousands of jobs along the way. #LetsKeepGoing", "2018-09-27T23:21:53.000Z": "Gina will fight for a woman's right to choose no matter what happens in Washington. \n\n. @MayorFung 's record on choice is mixed.  \n\nIt's clear there's only one candidate for governor who will protect women's health care.", "2018-09-27T23:20:45.000Z": "FACT CHECK: Under Gina's direction, we've saved $100M+ in health care and reinvested in job training, infrastructure, education, tax cuts and economic development.", "2018-09-27T23:18:29.000Z": "", "2018-09-27T23:17:18.000Z": ". @MayorFung keeps rooting against RI. The facts are that RI has the 17th best economy in the US, over 500K jobs and the lowest unemployment in nearly 20 years.", "2018-09-27T23:16:42.000Z": "", "2018-09-27T23:15:20.000Z": "After years on the sidelines, we're competing with other states, and it's working. 3,500+ jobs that pay an average of $64K/year. @MayorFung says he's opposed to the programs, but that means he's against these jobs.", "2018-09-27T23:13:02.000Z": "Gina's been an outsider her entire career. She's stood up to the old boy network. @MayorFung was a Smith Hill lobbyist for the insurance industry and has been a politician for 15 years.", "2018-09-27T23:12:38.000Z": ". @MayorFung 's police scandal and legal disputes have likely cost Cranston taxpayers between $5M and $8M.", "2018-09-27T23:03:55.000Z": "We've learned from the mistakes of UHIP. Gina's apologized, put new leadership in place and held Deloitte accountable. And we're now seeing progress: Wait times down; 90%+ of applications processed on time. https:// wpri.com/target-12/lobb y-wait-times-down-at-dhs-as-computer-issues-ease/1349480378 ", "2018-09-27T23:01:36.000Z": "Here we go!", "2018-09-27T22:58:51.000Z": "Positive change is taking place in Rhode Island: \n\nCranes in the sky School repairs underway Pre-K expansion Job training programs Tuition free community college Eliminating the car tax  #LetsKeepGoing", "2018-09-27T22:38:38.000Z": "Follow along on Twitter as my staff live-tweets the debate at 7pm. Stream it here: Politics | WPRI.com WPRI 12 Eyewitness News on WPRI.com is Rhode Island and Southeastern Massachusetts' local news and weather source.WPRI 12 Eyewitness News on WPRI.com is Rhode Island and Southeastern Massachusetts'... wpri.com", "2018-09-27T22:19:28.000Z": "Tune in at 7pm for the @WPRI12 / @myRWU Gubernatorial Debate. We're bringing change to Rhode Island and there's too much at stake to let anyone else take us backwards.", "2018-09-27T15:19:43.000Z": "I agree. Fully and completely.\n\nChristine Blasey Ford's testimony is courageous and moving. I believe her.\n\nThe Senate must not vote on Judge Kavanaugh's nomination, and the allegations against him must be investigated. Quote Tweet Charlie Baker @MassGovernor The accusations brought against Judge Kavanaugh are sickening and deserve an independent investigation. There should be no vote in the Senate.", "2018-09-27T13:36:20.000Z": "We're bringing the change that Rhode Islanders need. We've created 15,000+ jobs, built the nation's 17th best economy and unemployment is the lowest it's been in nearly 20 years. \n\nTune in to @WPRI12 TONIGHT at 7pm for the debate live from @myrwu .", "2018-09-25T15:32:37.000Z": "Thank you @gaylegoldin , @tanzister , @RIDPWomen and Deb Debare for standing up today on behalf of all victims. \n\nRIers deserve to know where @MayorFung and @TrilloforGov stand on Brett Kavanuagh and the credible accusations that have been made against him. https:// ginaraimondo.com/updates/women- call-on-fung-trillo-to-oppose-bullying-of-victims-kavanaugh/ ", "2018-09-24T19:30:08.000Z": "Joe Biden. Sunday. Are you ready Rhode Island? Sign up for your free ticket: http:// bit.ly/RIDemBiden", "2018-09-24T22:10:02.000Z": "The job description of an SRO does not include \"defend school from armed invaders\". We need other solutions for #rhodeisland to #EndGunViolence . @GinaRaimondo  @MomsDemand Quote Tweet Ian Donnis @IanDon . @MayorFung Proposes Putting A Safety Officer In Every RI School http:// tinyurl.com/y7qlnmbt He Wants Half the Money to Come from the General Assembly Budget", "2018-09-24T20:13:23.000Z": "As Governor, I ended the Carcieri freeze on school construction & added $$ for new and priority projects. Most communities applied for new projects, but not @MayorFung . Now, I want to invest $1B across RI to fix school buildings in every city & town, but Mayor Fung's opposed.", "2018-09-21T18:34:37.000Z": "The President's bullying has no place in the public discourse. Christine Blasey Ford deserves our respect. Her allegations must be taken seriously. Every girl and every women deserves to grow up and live in a society free from harassment, abuse and bullying. Quote Tweet Donald J. Trump @realDonaldTrump I have no doubt that, if the attack on Dr. Ford was as bad as she says, charges would have been immediately filed with local Law Enforcement Authorities by either her or her loving parents. I ask that she bring those filings forward so that we can learn  date, time, and place!", "2018-09-21T01:02:40.000Z": "Hurricane Maria devastated Puerto Rico, and many are still recovering. While President Trump immorally dismisses the tragedy, suffering and loss of life, Rhode Islanders stand together with our friends, family and fellow Americans in Puerto Rico.", "2018-09-21T01:01:48.000Z": "El huracán Maria dejó devastado a Puerto Rico y muchos todavía se recuperan. Mientras el presidente inmoralmente ignora la tragedia, el sufrimiento y la pérdida de vidas, en Rhode Island estamos unidos con nuestros amigos, familiares y ciudadanos Americanos en Puerto Rico.", "2018-09-20T19:48:11.000Z": "We are driving real change in Rhode Island, and the numbers show it. With over 15,000 new jobs, Rhode Island's unemployment rate is the lowest since 2000. But Cranston Mayor Allan Fung has underfunded schools by $11m while raising taxes 9 times.", "2018-09-20T19:24:12.000Z": "Thanks for having me, @IanDon and @ScotMackRI . I always enjoy spending time with you and your listeners. Quote Tweet Ian Donnis @IanDon Covered a lot of topics with @GovRaimondo ; tune to @RIPR tom'w am for Roundtable (5:50/7:50) Bonus Q&A (6:50/8:50) or online at http:// ripr.org", "2018-09-20T17:25:09.000Z": "\"Gina is bringing long-overdue change to RI and standing up for working Rhode Islanders. She's fought to raise the minimum wage, expand job training, & rebuild roads, bridges and schools that had been neglected for too long.\"  -- George Nee, @riaflcio  https:// ginaraimondo.com/updates/afl-ci o-endorses-governor-gina-raimondo/ ", "2018-09-20T01:09:35.000Z": "Thank you @riaflcio for your support and endorsement. Together, we'll protect our job training programs, fix our school buildings, create jobs and strengthen Rhode Island's middle class. Let's keep bringing change to Rhode Island.", "2018-09-19T17:10:05.000Z": "In 2015, we ended the Carcieri freeze on school construction and made more money available for new projects. Now, I want to make a record investment in school construction so every student & every teacher has a school that is warm, safe and dry. Quote Tweet NewsTalk 99.7 & AM 630 WPRO @wpro . @GinaRaimondo speaks outside Cranston High School East, criticizes @MayorFung 's management of Cranston school buildings. She asks why he doesn't support her school construction bond, cites flooding that closed East for days this winter. - TR #WPRO Show this thread", "2018-09-18T18:36:45.000Z": "We've created more than a few thousand construction jobs over the last four years, and hard-hit construction workers are finally back on the job. I was proud to join workers and business leaders for the topping off ceremony of the new Residence Inn in Providence earlier today.", "2018-09-18T16:34:39.000Z": "Over the last four years, we've put thousands of Rhode Island construction workers back on the job. We're rebuilding roads and fixing our school buildings. And @MayorFung opposes all of it.", "2018-09-17T22:00:55.000Z": "Since I've been in office, 70 small businesses have help through our first-ever small business loan program, including @rimushroom . Small businesses are hiring RIers. Mayor Fung's plans to gut our economic development programs will hurt RIers. At a mushroom farm, Raimondo launches general election campaign Gov. Gina Raimondo launched her general reelection campaign Monday at the RI Mushroom Co. in West Kingston, a small business that tapped a loan program initiated during her term in office.", "2018-09-16T23:09:24.000Z": "Here in Rhode Island, we must elect leaders in November who will protect our fundamental rights. I am the only candidate for Governor who will protect women's health care and work with advocates and the legislature to enshrine Roe v. Wade in state law.\n\n(2/2)", "2018-09-16T23:09:06.000Z": "I support Christine Ford's courageous decision to come forward. The U.S. Senate must not vote on Judge Kavanaugh's nomination until a thorough investigation is completed. \n\n(1/2)", "2018-09-14T15:19:27.000Z": "The future of public schools like Cumberland Hill is on the ballot November 6th. Stick with me and we'll finally fix our crumbling schools: Summer upgrades complete; Cumberland school officials hope for more with bond referendum CUMBERLAND - Supt. valleybreeze.com", "2018-09-13T01:44:23.000Z": "Together, we will keep bringing the change Rhode Island needs.\n\nOn to November!", "2018-09-12T23:45:00.000Z": "Polls close in 15 minutes (at 8pm). If you're in line when polls close, you can still vote. \n\n(This photo was taken last fall at CCRI when we hosted a 'Dels Party' for the first class of RI Promise scholars.)", "2018-09-12T23:30:00.000Z": "Polls close in 30 minutes (8pm). If you're in line when the polls close, you can still vote.\n\n(This photo was taken after I signed the Red Flag law & bump stock ban. A few weeks after Parkland, I was the 1st governor in the U.S. to sign an exec order creating a Red Flag policy.)", "2018-09-12T23:14:00.000Z": "In four years, we've gone from the highest unemployment rate in America to the most jobs in Rhode Island history.", "2018-09-12T23:11:37.000Z": "Thank you Rep. Diaz and all the volunteers who are making calls to get our neighbors to the polls. We're going to sprint to the finish to protect the change and progress we've brought to Rhode Island.", "2018-09-12T23:00:00.000Z": "Polls close in 60 minutes (at 8pm). If you're in line when polls close, you can still vote. \n\n(This photo was taken earlier this year after I signed legislation protecting Dreamers.)", "2018-09-12T22:47:00.000Z": "Across the country, there are only two Democratic women governors. More than ever before, we need leaders who will stand up to protect women's healthcare, stand up against harassment and fight for equal pay. There's still time to vote: Polls close at 8pm.", "2018-09-12T22:39:11.000Z": "Rhode Islanders across the state are fired up to protect the change and progress we've made. Polls close at 8pm. Thank you for your support. Let's keep going.", "2018-09-12T22:31:00.000Z": "Job training means Rhode Islanders can compete for the jobs we're creating. We can't go backwards. Polls are open until 8pm. Let's keep going.", "2018-09-12T21:57:00.000Z": "We've increased renewable energy and added more than 5,500 green jobs since 2015. \n\nPolls are open until 8p.\n\nElection protection number: 401-298-5851", "2018-09-12T21:27:29.000Z": "The rain is slowing down and there's lots of enthusiasm in Warwick. Thank you for the support. Let's keep going. Polls close at 8pm.", "2018-09-12T20:48:00.000Z": "We're brewing @Gansettbeer in RI again because we've changed the way we do things in Rhode Island. Vote today in the Democratic Primary. Polls are open until 8p.\n\nElection protection number: 401-298-5851", "2018-09-12T19:56:00.000Z": "Two years ago, Rhode Island became the fourth state in America to guarantee every high school graduate tuition-free access to community college. Let's keep going and expand the RI Promise scholarship to RIC and URI.", "2018-09-12T18:48:00.000Z": "If Congress won't act on gun safety, we need to. I'm proud to be endorsed by @Everytown and @RICAGV1 . Working together, we've taken guns out of the hands of abusers and I've taken action to ban guns from schools.", "2018-09-12T17:56:54.000Z": "There's lots of support at the Temple Beth El polling place. Let's keep going!", "2018-09-12T17:24:51.000Z": "We're not going to let a little rain put our progress at risk. Thank you to everyone who has voted already. If you haven't yet, polls close at 8p.", "2018-09-12T17:13:00.000Z": "Computer science in every school. Free PSAT/SAT Universal All Day Kindergarten Tripled Pre-K classes\n\nLet's keep going. Let's invest $1B in school construction and guarantee every 4-year-old a spot in Pre-K.\n\nVote today in the Democratic Primary.", "2018-09-12T16:15:00.000Z": "I stopped in to greet voters at Summit Commons earlier today. Thank you for your support. If you haven't voted yet, polls are open until 8pm", "2018-09-12T15:40:20.000Z": "Un placer ver mis amigos votando esta mañana en el Algonquin House. Las urnas electorales están abiertas hasta las 8pm. Gracias por su apoyo!\n\nGreat to see friends and supporters out voting at the Algonquin House this morning. Polls are open until 8pm.", "2018-09-12T15:26:00.000Z": "Our campaign was endorsed by @ppvotesri . With the Kavanaugh appointment and President Trump in the White House, reproductive health care is on the ballot. In my second term, I'll keep fighting to codify Roe v Wade in RI. Please vote in the Democratic Primary TODAY.", "2018-09-12T14:53:00.000Z": "Four years ago, Rhode Island had the highest unemployment rate in America and the 195 land was empty. Since 2015: 21K new jobs Lowest unemployment rate since 2000 Thousands of new construction jobs Cranes in the sky\n\nWe can't afford to go backwards.", "2018-09-12T14:26:36.000Z": ". @AndyMoffit and I just voted. It was great to see our neighbors at the polls. Polling locations are open today until 8pm. Let's keep going.", "2018-09-12T13:43:00.000Z": "In our first term, we tripled the number of Pre-K classes in Rhode Island. In our second term, we're going to guarantee every four-year-old a seat in Pre-K.\n\nPlease vote TODAY in the Democratic Primary. Polls are open until 8p.\n\nElection protection number: 401-298-5851", "2018-09-12T13:20:04.000Z": "Voting for @GinaRaimondo today!  Without her tech initiatives, I wouldn't be a Software Engineer at General Dynamics! @TechHireRI  @REALJOBSRI  #Vote", "2018-09-12T12:23:00.000Z": "Past leaders neglected our roads and bridges for too long. In my first term, we came together to create RhodeWorks. Now, we're fixing our bridges and we've put thousands of Rhode Islanders to work.", "2018-09-12T11:18:00.000Z": "Every child deserves a school that is warm, safe, and dry. I lifted the previous administrations' freeze on school construction. After years of delay, we're fixing our school buildings. Today is the Democratic Primary. Please vote to protect the change and progress we've made.", "2018-09-12T10:36:00.000Z": "Good morning. Today (Sept. 12) is Primary Day. I humbly ask for your vote so that we can protect the change and progress we've made over the last four years.\n\nMost polls across RI open at 7a and all polls close at 8p. \n\nAll poll hours are listed here: https:// vote.sos.ri.gov/ovr/info/polli ng_place_hours ", "2018-09-12T01:09:00.000Z": "Thank you @TeamRWB and all of our veterans for your service. I'm proud that Rhode Island was able to be a part of this special relay, especially today. Quote Tweet Jennifer Bogdan Jones @JenniferBogdan Governor Raimondo welcomed our veterans and @TeamRWB to the State House today. RI was a stop on the Old Glory relay that will bring the US flag to 24 states by Veterans Day. Proud to work for a governor who is so committed to our veterans.", "2018-09-12T00:51:00.000Z": "With Donald Trump in the White House, everything is at stake this November. I always have and always will stand up to protect Rhode Islanders and Rhode Island values. Please vote tomorrow, Sept. 12, in the Democratic Primary.\n\nElection protection number: 401-298-5851", "2018-09-11T23:55:00.000Z": "We've stood up for better, safer, stronger gun laws. I'm proud to be endorsed by @Everytown . Let's keep going, and let's keep our communities safe. Please vote tomorrow, Sept. 12, in the Democratic Primary.\n\nElection protection number: 401-298-5851", "2018-09-11T23:03:00.000Z": "Right after I took office, we lifted the previous administrations' freeze on school construction. Our kids deserve schools that are warm, safe and dry. Let's keep going. Please vote tomorrow, Sept. 12, in the Democratic Primary.\n\nElection protection number: 401-298-5851", "2018-09-11T22:55:44.000Z": "Thank you to all the GOTV volunteers - young and young-at-heart - who are working to help protect our progress and ensure a bright future for our kids. Tomorrow (Sept. 12) is Primary Day. I humbly ask for your support. Let's keep going.", "2018-09-11T21:42:00.000Z": "They didn't think we could do it, but we made CCRI tuition-free. In my second term, I'll fight to expand the RI Promise scholarship to RIC and URI. Please vote tomorrow, Sept. 12, in the Democratic Primary. I humbly ask for your support.\n\nElection protection number: 401-298-5851", "2018-09-11T20:45:00.000Z": "Since 2015, we've totally revamped job training in Rhode Island. Please vote tomorrow, Wednesday, Sept. 12, to protect job training in Rhode Island.\n\nElection protection number: 401-298-5851", "2018-09-11T19:20:42.000Z": "I humbly ask for your support tomorrow in the Rhode Island Democratic Primary. We need to protect the change and progress we've made over the last four years. There's too much at stake to go backwards.", "2018-09-11T17:27:53.000Z": "I'm proud to be standing up with Rhode Island's LGBTQ+ community. Please #vote in the Democratic Primary tomorrow, Wednesday, September 12. Polls are open from 7a to 8p. If you have questions about where to vote or what to bring to the polls, call 401-298-5851.", "2018-09-11T17:07:44.000Z": "My kids cherish the time they get to spend with my mom. I met some of the St. Elizabeth's Place residents and their grandkids today. I talked with them about how we've restored funding for Meals on Wheels and how we're going to expand tuition-free college to URI and RIC.", "2018-09-11T15:52:04.000Z": "Since I took office, 22% more Latinos are working, we made community college tuition free and now 150% more Latino students go to CCRI! \n\nThanks to Latina 100.3 and DJ Mono for the chance to talk about our progress - let's keep going: vote tomorrow, Wednesday, September 12!", "2018-09-11T15:36:00.000Z": "Four years ago, the 195 land in Providence had been sitting empty for years and there was no real hope for development. We changed that. Today, I toured the Wexford project which is supporting ~1,000 construction jobs and will support ~1,000 permanent jobs when it's complete.", "2018-09-11T13:16:13.000Z": "Our hearts are heavy today as we remember the lives lost 17 years ago. I pray that as we reflect on that day, we can all recall how our nation came together in the days after the attacks and stood up against forces that tried to divide us. #NeverForget", "2018-09-10T22:49:51.000Z": "My go to is a breakfast sandwich on a sesame bagel from the Butcher Shop. Quote Tweet Patrick Anderson @PatrickAnderso_ RI gov candidates: Go to bagel orders? @GinaRaimondo @mattbrownforgov @MayorFung  @repmorgan @giovanniferoce", "2018-09-10T22:26:55.000Z": "I had a great time talking with folks at Briarcliff Manor and Charles St. Apartments today. As Governor, I've stood up for seniors. Restored previous administration's cuts to Meals on Wheels. Doubled funding for senior centers.\n\nLets keep going. Please vote on Wednesday.", "2018-09-10T19:57:34.000Z": "Every time I stop in Brewed Awakenings in Johnston, I ask Rhode Islanders what else we can do to push Rhode Island forward. Some of the best policies we've enacted since I've been Governor - RI Promise, all-day K, Real Jobs RI, PrepareRI - started out as conversations like this.", "2018-09-10T18:58:56.000Z": "We stopped into Scalio Brothers Bakery after Angelo's for a bit of sugar to keep us going through the afternoon. Small businesses like Scalio Brothers and Angelo's are the lifeblood of our economy. I'm committed to continuing to help small business owners grow and hire RIers.", "2018-09-10T18:42:49.000Z": "Happy birthday, @CoachCooleyPC . Quote Tweet PC Men's Basketball @PCFriarsmbb Happy B-Day to our guy!!! @CoachCooleyPC", "2018-09-10T18:15:57.000Z": "In an Italian family like mine, there's always room for pasta. Tommy and I enjoyed stopping in to talk with Rhode Islanders at Angelo's on Federal Hill.", "2018-09-10T17:36:25.000Z": "We've put thousands of tradesmen back to work in the last four years. I enjoyed catching up with some of the crews working on the River House project in Providence earlier this morning.", "2018-09-10T16:46:25.000Z": "Tommy and I are celebrating Taco Tuesday a day early. We just stopped in at @XacoTacoRI for a quick lunch to congratulate the team for its @RIMonthly  #BestOfRI award.", "2018-09-10T16:20:24.000Z": "The National Institute for Early Education Research ranks RI as one of the top three states for Pre-K quality. Let's now make sure every student has a shot to attend high-quality Pre-K.  In my second term, I'll make universal Pre-K a reality in RI. https:// ginaraimondo.com/updates/univer sal-pre-k/ ", "2018-09-10T16:02:39.000Z": "In our first term together, we tripled the number of Pre-K classrooms. In my second term, let's keep going and guarantee a seat in Pre-K for every 4-year-old in Rhode Island. Vote in the primary on Wednesday, Sept. 12.", "2018-09-10T15:07:18.000Z": "Vice President Biden has dedicated his career to helping hardworking Americans keep up and get ahead, and I'm honored to receive his endorsement! Read more: Biden endorses Gina Raimondo for reelection as R.I. governor Influence from her father, a bowl of ice cream for her son make this endorsement \"special,\" she says. providencejournal.com", "2018-09-10T14:34:44.000Z": "¡Gracias por la invitación y no olviden votar el Miércoles 12 de Septiembre! @poder1110", "2018-09-10T00:02:33.000Z": "Great to see old friends at Festival Guatemala. What a crowd! We'll be out in force again, voting on Wednesday.", "2018-09-09T22:04:20.000Z": "Ocean State Beer Fest! We got rid of the keg tax to make it easier for brewers (small businesses!) to open and expand in Rhode Island. Today, I'll put our craft beer scene up against any state, and we're just getting started.", "2018-09-09T18:13:59.000Z": "Inspiring morning speaking with congregations at Elmwood Church of God and Ministerio's Dunamis - thanks for starting the day off right!", "2018-09-09T01:00:39.000Z": "From Pawtucket to Providence to Bristol the fabulous Cranston Greek Festival we've been all over the state today talking about the stakes in Wednesday's primary! \n\nSee you back out there tomorrow.", "2018-09-08T23:07:35.000Z": "Great coffee and company at the Beehive Cafe in Bristol with @SethMagaziner !", "2018-09-08T21:15:05.000Z": "Our team is making and knocking across the state to get out the vote on Wednesday, Sept. 12!\n\nFind your polling place: http:// ginaraimondo.com/vote", "2018-09-08T20:17:37.000Z": "Great to see community in action at Hope St Farmers Market! There's a lot at stake in this election. I'll never stop fighting for Rhode Islanders", "2018-09-08T14:36:23.000Z": "Vice President Biden has dedicated his career to helping hardworking Americans keep up and get ahead, and I'm honored to receive his endorsement!", "2018-09-07T21:55:05.000Z": "I'm honored to be endorsed by @Everytown , a non-partisan organization working to to end gun violence and build safer communities.", "2018-09-06T18:48:23.000Z": "The Democratic Primary is Wednesday, September 12! \n\nFind your polling place here: http:// bit.ly/2wME6HK", "2018-09-06T01:00:28.000Z": "We've put cranes in the sky! Today the hardworking men and women of our building trades are fixing our roads, bridges and schools and strengthening our middle class!\n\nThanks for your energizing support tonight -- let's keep building!", "2018-09-05T21:01:38.000Z": "", "2018-09-02T00:21:34.000Z": "Great food and a good time at the Our Lady of Fatima Feast in Cumberland! Ceci and I loved the shrimp - always a highlight", "2018-09-01T19:26:05.000Z": "It's a great weekend to show your local Rhode Island small businesses some love! \n\n(Photos: Mr. Lemon, Big Tony's Pizza, The Nook, White Elephant)", "2018-08-29T20:11:00.000Z": "Guns do not belong in schools. Raimondo announces ban on carrying guns on school grounds PROVIDENCE, R.I. - Gov. Gina Raimondo and the state's education commissioner took executive action Wednesday to ban all firearms, except those carried by police officers, from public schools and... providencejournal.com", "2018-08-29T18:31:00.000Z": "\"...  investing in high-quality early childhood education is the most effective way to break the cycle of poverty and ensure equal opportunity for all American families.\" \n\nSpot on @kmpperry . Let's keep fighting for Rhode Island kids and families! My Turn: Kris Perry: Raimondo champions early education In this politically divisive time, good news in the policy arena can often be overshadowed by the latest scandal, outrage or ill-timed tweet. Nonetheless, Americans should be encouraged by progress... providencejournal.com", "2018-08-29T17:47:58.000Z": ". @GovRaimondo : \"It isn't hard: Guns don't belong in schools, Even Mississippi bans non-law enforcement officials from carrying guns onto school grounds\" http:// ripr.org/post/raimondo- backs-directive-meant-keep-guns-out-schools#stream/0 ", "2018-08-29T14:23:47.000Z": "Proud to have your support Maria! Let's keep going! Quote Tweet Maria Rivera @MariaForCF With only 2 weeks left before primary I'm proud to support Governor Gina Raimondo! @GinaRaimondo", "2018-08-28T22:32:31.000Z": "Nice to get out of the heat and stop into some great Barrington small businesses today: Piccolo's, @viennabakeryri and The Daily Scoop!", "2018-08-28T19:13:18.000Z": "Thanks to the East Providence Senior Center for hosting me, @davidcicilline and Senator Conley today! I'm so proud that we've been able to double funding for senior centers twice and I pledge to do all I can to keep supporting our state's wisest residents in a second term.", "2018-08-28T13:44:37.000Z": "Visited Fogarty Manor in Pawtucket last night with Councilman Vitali. Thanks for a great time!", "2018-08-27T14:47:45.000Z": "Last night in Johnston was a family affair. @LuigiGourmet macaroni, Original Italian Bakery cannoli, and conversation with friends, new and old, about we can keep helping Rhode Island families keep up and get ahead.", "2018-08-27T01:50:36.000Z": "Great end to a busy Sunday celebrating #WomensEqualityDay with the @RIDPWomen Caucus! Proud to have your endorsement as we head to the September 12th primary.", "2018-08-26T17:52:51.000Z": ". @SenJohnMcCain was a war hero, dedicated patriot and true fighter until the very end. His death is a loss for our nation, but especially for his loved ones. Andy and I are keeping the McCain family in our thoughts and prayers.", "2018-08-26T01:34:00.000Z": "Another great @LPRRI Barbecue! \n\nFrom tripling the number of kids in  public pre-K to free tuition at CCRI, we're making real progress for Rhode Island Latinos - let's keep going. \n\nWatch my full interview here (starts at 1:16): https:// bit.ly/2P5Y1rW", "2018-08-25T20:51:46.000Z": "Thank you to Councilwoman @LMariaRivera, Councilman Solano and many others for putting together a wonderful Family Fun Day in Central Falls!", "2018-08-23T16:32:18.000Z": "Number 1 in public Pre-K quality. All day kindergarten in every public school. Computer science in every classroom. Free PSATs and SATs. $1 billion investment in fixing schools. \n\nAnd this is just the beginning:", "2018-08-22T16:22:00.000Z": "Visited Rumford Towers with Senator Conley yesterday. It's so important that we do all we can to support seniors here in Rhode Island. Thanks for the great conversations!", "2018-08-21T22:03:30.000Z": "Welcome home Coventry Little League! You make Rhode Island so proud.", "2018-08-21T19:28:05.000Z": "Wonderful visit to the Cranston Senior Center with Charlie Fogarty this morning!", "2018-08-21T00:58:14.000Z": "Great small businesses can have such a big impact on the Ocean State. Congrats to Two Little Fish and their commendable efforts to reduce plastic!", "2018-08-21T00:10:24.000Z": "Stopped through J's Deli in Smithfield today - best sandwich shop in the Blackstone Valley! Congrats on your Best of RI wins 9 years in a row!", "2018-08-20T00:28:07.000Z": "Lovely Sunday dinner in North Providence! Great to see so many new faces - together we will keep the progress going in Rhode Island.", "2018-08-19T18:48:10.000Z": "Loved celebrating at the Rhode Island Dominican Parade with Grand Marshall @Angel_Taveras today!", "2018-08-19T01:41:25.000Z": "St. Rocco's Feast! What a great way to close out a jam-packed Rhode Island day. We had a blast!", "2018-08-18T22:33:10.000Z": "Our next stop celebrating RI's rich cultural diversity: the Annual Grecian Festival in Pawtucket! We loved the gyro and baklava!", "2018-08-18T22:05:35.000Z": "Grateful to take part in today's festival of the Virgin of Urkupiña - a beautiful Bolivian celebration! One of Rhode Island's many diverse traditions that make our community so special.", "2018-08-18T20:27:57.000Z": "The contributions of the Armenian community are part of what makes Rhode Island such a wonderful place. Enjoyed the food and dancing at the Sts. Sahag and Mesrob Church Annual Picnic! Can't wait to come back!", "2018-08-18T17:02:53.000Z": "What great visits to Park View and Kennedy Manor in Woonsocket yesterday with @PJK4brainhealth , @SheldonforRI and @davidcicilline ! @NewportCreamery coffee and vanilla ice cream was the perfect treat on a hot summer day", "2018-08-17T14:15:57.000Z": "Thanks to the New Shoreham (Block Island) Democratic Town Committee for your endorsement! With the support of local Democrats across the state we'll keep expanding opportunity for every single Rhode Islander.", "2018-08-16T16:21:31.000Z": "Energizing evening last night with @JorgeElorza2018 and Latinx Real Estate leaders - together we're rebuilding Rhode Island!", "2018-08-15T20:12:18.000Z": ". @SenJackReed was born on the campus of the Elmhurst healthcare center we visited today - where I also ran into some friends of my childhood babysitter. That's Rhode Island for you! I love our tight knit community and I hope I can count on your vote on Sept. 12!", "2018-08-15T14:35:06.000Z": "Thanks to Don, Val and The Original Italian Bakery team for a little behind the scenes look at the making of the best pizza chips!", "2018-08-15T01:23:20.000Z": "Had a lot of great conversations with the residents of Shalom Apartments and Meadowbrook Terrace in Warwick today! It was so fun visiting along with @SenJackReed , @SenLynchPrata, Mayor Joseph Solomon and Rep. David Bennett. Thanks for having us!", "2018-08-14T14:46:05.000Z": "Thank you @cleanwater_ri for your endorsement! Together we will make sure that every Rhode Island family can enjoy our bay, beaches, forests and wetlands for generations to come. Quote Tweet CleanWaterAction RI @cleanwater_ri We are proud to announce our first round of endorsements for this election cycle! These candidates have committed to addressing the most pressing environmental concerns facing our state, including plastic pollution, public health, and climate change.", "2018-08-13T17:21:27.000Z": "Today is the last day you can register to vote before the Primary Election on Wednesday September 12th! \n\nClick here and register now: https:// vote.sos.ri.gov", "2018-08-12T23:03:08.000Z": "Newport! Your Rhode Island Democrats HQ is open for business. Come on down to 221 3rd St. and volunteer to help elect Democrats!", "2018-08-12T21:27:13.000Z": "Haven't signed up to vote? Tomorrow's your last chance! Make sure you're registered or verified to vote before tomorrow's deadline -- let's all get out and VOTE in Rhode Island's Democratic primary on Wednesday, September 12th! Visit https:// vote.sos.ri.gov to sign up now.", "2018-08-12T18:21:03.000Z": "Offshore Oil Drilling. Choice. Gun Safety. Health Care. \n\nThe Governor believes her job is standing up for Rhode Islanders, and sometimes that means standing up to President Trump.", "2018-08-10T01:21:21.000Z": "Great time with friends at the @RILPAC fundraiser tonight - thanks for your energy and leadership in this important election year @JMolinaFlynnEsq and @Marce89", "2018-08-08T22:23:53.000Z": "Great to spend some time checking out the revitalization of Pawtucket and Central Falls with local leaders and stop by the Chinese Christian Church of Rhode Island!", "2018-08-08T15:26:37.000Z": "\"After someone holds a gun to your head, you never forget what the cold pressure feels like.\" \n\nWatch Giovanna's story now:", "2018-08-08T00:05:47.000Z": "Thanks @SEIU1199_NE for coming out to knock some doors tonight! Appreciate your hard work and support.", "2018-08-07T22:02:54.000Z": "Thanks to the Warren Democratic Town Committee for your endorsement!\n\nLet's keep working together to protect our environment, invest in more clean energy, lift up our small businesses, support our workers and make sure our economic recovery reaches every single Rhode Islander.", "2018-08-06T18:12:04.000Z": "Started the week off right with @SenatorMillerRI this morning visiting Cranston's Edgewood businesses! It's been such a blast stopping in to see so many of our #BestofRI winners over the past few days. Keep up the good work everyone!", "2018-08-06T01:53:00.000Z": "What a great time at the Charlestown Seafood Festival!", "2018-08-04T21:52:37.000Z": "A little rain didn't stop a great day in Little Compton! \n\nThe Little Compton Democrats are fired up to keep making progress and the annual Antiques Festival and Car Show at @LCHistSoc is the place to be! Although it was a little scary to see Tommy in the drivers seat ...", "2018-08-04T16:45:57.000Z": "It was an honor celebrating @RigobertMenchu , @repgracediaz and all awardees last night at the 8th Annual Quetzal Award Gala. Congratulations on your extraordinary contributions to the Ocean State!", "2018-08-04T15:54:58.000Z": "Sent our incredible Coventry Little League 12 & 13 year olds off to the New England Regional Championships in style! You make Rhode Island proud.\n\nTune in to @ESPN + tomorrow at 1pm to cheer our guys on vs. Connecticut", "2018-08-03T21:46:37.000Z": "Strong coffee, cool bikes and food - Broadway's got it all. Keep up the great work @thenitrocart  @dashbicycle  @grangeRI !", "2018-08-03T21:26:07.000Z": "+ = The perfect start to a Rhody weekend.\n\nSmall businesses like Pepe's Kitchen make our state great!", "2018-08-03T20:41:05.000Z": "Great to join @proclamationale 's new beer launch earlier this week! We're making it easier for small businesses like Proclamation to expand and thrive in Rhode Island -- having more tasty beer to enjoy is a plus, too! https:// twitter.com/SenLynchPrata/ status/1025046343260270592  This Tweet is unavailable.", "2018-08-03T13:11:58.000Z": "When policies work for women and children, everyone benefits. Had a productive event this week with some strong, passionate Rhode Island women talking about all we can do to support working families.", "2018-08-02T23:35:51.000Z": "Thank you to Romana Ramos, a pillar of Rhode Island's Cape Verdean community, for your support and for hosting a wonderful house party! Let's keep making progress together.", "2018-08-02T22:18:50.000Z": "Promise scholars are some of the smartest, most motivated Rhode Islanders you'll meet. 1,500 are already going to CCRI tuition free -- let's expand the program and make Universal Education and Job Training a reality for all Rhode Islanders! Making college affordable Harrison Tuttle is going to be a sportscaster. He's just going about it a different way then he initially expected.  \"Life doesn't always go the way you planned, and that's okay,\" he  cranstononline.com", "2018-08-02T18:14:16.000Z": "Cliff has been actively working towards social justice and civil rights for decades. This is what he has to say:", "2018-07-31T22:07:27.000Z": "Handed out more of @RIMonthly 's #BestofRI awards at Frog and Toad, Evolve Apothecary and Spa, The Cheeky Hound, Hope Returns, J Marcel and Seven Stars Bakery on Hope Street today! Great small businesses like these are the lifeblood of RI. Thanks for all you do!", "2018-07-31T19:19:26.000Z": "Always fun in Federal Hill -- especially when it's to see some of @RIMonthly 's #BestOfRI winners. Congratulations on your hard work to help make the Ocean State the best it can be!", "2018-07-31T17:10:52.000Z": "Enjoyed chatting about our second term proposals to lift up working families with these expert tax-preparers at Federal Hill House yesterday! Thanks for all you do to help hardworking Rhode Island families take advantage of the EITC: https:// bit.ly/2M3WaCF", "2018-07-29T20:35:45.000Z": "Rhode Island creativity never ceases to impress! It's been a great Bay Day with the family at Sand Hill Cove.", "2018-07-28T22:51:54.000Z": "¡Vamos a votar el 12 de septiembre! #LatinosConGina", "2018-07-28T21:16:46.000Z": "Had a blast presenting the Best In Show Trophy at today's Providence Kennel Club Dog Show!", "2018-07-28T19:06:59.000Z": "It's a beautiful day for @Newportfolkfest ! Today, with the legendary George Wein we announced 25 more years of Folk Fest and Jazz Fest right here in the Ocean State where they belong.", "2018-07-27T17:15:02.000Z": "It was an honor to welcome @kmpperry to Rhode Island yesterday. Thank you, Kris, for your continued advocacy for children, equality and social justice for all! Quote Tweet Kris Perry @kmpperry . @GinaRaimondo is getting big things done for little kids in Rhode Island. @SCActionNetwork applauds her work on child care quality, expanded pre-k and state of the art facilities. #InvestInKids", "2018-07-26T19:52:03.000Z": "Congratulations Marcias! \n\nYour story is proof: Investing in education and job training works. Let's expand our Rhode Island job training programs so everyone has a shot! http:// bit.ly/2LV1p7C Quote Tweet Operation Stand Down @OSDRI_Vets Marine veteran, Marcias Smith, came to OSDRI for housing and sustainable employment. we assisted with housing and were able to find an apprenticeship through Real Jobs RI's Commercial Fisherman Program. He now has a full time job with a locally owned fishing vessel!", "2018-07-26T16:38:35.000Z": "Great to chat with new Promise scholars in CCRI's class of 2020! Let's make this great program available to even more Rhode Islanders - read my Universal Job Training and Education plan: http:// bit.ly/2LV1p7C", "2018-07-26T00:57:04.000Z": "Proud to celebrate our resilient Puerto Rican community today in Central Falls! ¡Que viva Puerto Rico!", "2018-07-25T15:07:39.000Z": "Enjoyed a tasty iced coffee and great conversation with Sen. @SANDRISCANO at the Mad Dog Cafe in Pawtucket - a great woman-owned business. Can't wait to come back, Christina!", "2018-07-25T14:17:26.000Z": "Always great to see our young people making things happen! Had a great visit to @Vertikal6Inc yesterday. Quote Tweet Governor's Workforce Board RI @GWB_RI Thrilled that @GovRaimondo met two of our high school interns from the PrepareRI Internship program. Many thanks to @Vertikal6Inc and CEO Rick Norberg for hosting them this summer! Thanks also to Mayor Solomon and Senator Lynch Prata for their continued support! @SenLynchPrata", "2018-07-23T19:37:06.000Z": "Just announced: My Universal Education and Job Training Plan \n\nWhether you're 18 and just starting out or 50 and need to start over there will be an opportunity for you to get the training and education you need to keep up and get ahead in Rhode Island: http:// bit.ly/2mDwguJ", "2018-07-23T14:20:45.000Z": "I'm announcing our second term universal job training and education plan - watch LIVE: Gina Raimondo Tune in LIVE to learn more about my term two education and job training plan! I want to make sure that every hardworking Rhode Islander gets the education and training they need to build a good... m.facebook.com", "2018-07-22T19:23:16.000Z": "Enjoyed spending some time at @HopeandMain in Warren for a visit to the Farmer's Market and a conversation with @SenWhitehouse and local Democrats!", "2018-07-22T17:07:17.000Z": "Wonderful to be in Cranston with all those braving the rain to celebrate the St. Mary's Feast procession - Buona Festa!", "2018-07-21T21:52:14.000Z": "Loved celebrating Colombia's independence with you all today!  #IndependenciaDeColombia", "2018-07-20T23:16:05.000Z": "Celebrating Mark Weed's life of service with a little Friday night baseball alongside @MTeresaPW and friends. Let's go @NewportGulls !", "2018-07-20T21:57:58.000Z": "Had a great afternoon in Cranston with community leaders at the new @thesimplegreek then checking out the amazing @cocofueltreats with founder Paula Charleson in stores now at many local Whole Foods!", "2018-07-20T20:23:00.000Z": "So proud to have the @ArcticPlayhouse here in WW! Thanks to @GovRaimondo for stopping by to see the great things happening and great things on the way! https:// ricentral.com/kent_county_da ily_times/gov-raimondo-visits-arctic-playhouse/article_d81d198e-8c2d-11e8-a8aa-a3536c69895f.html ", "2018-07-19T20:00:43.000Z": "8 years ago?! Time really does fly. @JamesDiossa your hard work in Central Falls has been critical to our state's comeback. Proud to know you and always grateful for your support. Let's keep going! Quote Tweet James A. Diossa @JamesDiossa #tbt 2010 with then candidate for Treasurer, @GinaRaimondo . I was serving my first few months on the city council. #timeflies", "2018-07-18T18:49:59.000Z": "Stopped by the @ArcticPlayhouse to see how plans are coming along for the new theatre and get some acting lessons their fabulous summer campers. Love to see young Rhode Islanders getting an early start in the arts!", "2018-07-18T18:27:48.000Z": "Wonderful to chat with so many Rhode Islanders @BoneheadWings this afternoon! From the revitalization of the historic Lippitt Mill to fixing roads and bridges around town, we're making progress for West Warwick -- let's keep going.", "2018-07-17T21:57:00.000Z": "Had a great, informative discussion with Woonsocket faith leaders this afternoon -- let's keep making progress for Rhode Island's working families, together.", "2018-07-17T21:28:32.000Z": "", "2018-07-17T11:58:25.000Z": "We must commit to a more sustainable future. Working together, we will end our reliance on single-use plastics and ensure a greener future for our kids!", "2018-07-14T23:02:14.000Z": "Proud to support @repgracediaz 's re-election - she's a strong fighter for the people of South Providence at the State House!", "2018-07-13T00:02:48.000Z": "It's a beautiful evening to advocate for reproductive freedom in Rhode Island! Kudos to @ppvotesri for your great event. #IStandWithPP", "2018-07-11T16:34:13.000Z": "", "2018-07-10T15:13:31.000Z": "I will always stand up for Rhode Islanders and up to Trump. I urge every resident of Rhode Island-the first state founded on the value of tolerance-to urge the Senate not to confirm Kavanaugh: http:// stopkavanaugh.com  #StopKavanaugh", "2018-07-10T15:09:39.000Z": "There's no doubt about it: Confirming Brett Kavanaugh to the Supreme Court would put Rhode Islanders' rights at risk. To protect women's freedoms, LGBTQ+ rights, civil rights, workers' rights and access to affordable, quality health care for decades, we must #StopKavanaugh", "2018-07-07T19:12:16.000Z": "Meet Zach:", "2018-07-07T15:52:53.000Z": ". @rdrigopimentel has it right. Dreamers are Rhode Islanders. Our state was founded on principles of inclusion and tolerance, and taking action to protect our Dreamers is the right thing to do. Letter: Rodrigo Pimentel: Driver's licenses for Dreamers make us all safer Recently, Rhode Island legislators and Gov. Gina Raimondo took decisive action to protect Dreamers in our state. What they passed into law will continue allowing Deferred Action for Childhood... providencejournal.com", "2018-07-06T15:27:47.000Z": "From farming, to manufacturing, to technology, Rhode Island is bouncing back! We're sparking another industrial revolution in the Ocean State. How Rhode Island Is Sparking Another Industrial Revolution Rhode Island has recruited 24 companies in the past two years to either come to the state or expand the presence the company already has in the state. Gov. Gina Raimondo is calling it a modern... forbes.com", "2018-07-05T16:02:00.000Z": "Thank you @ppvotesri for your endorsement! Working together, we will continue to protect reproductive freedom including access to safe and legal abortion care in Rhode Island. It's more urgent than ever to pass the #RHCA . #IStandWithPP", "2018-07-05T15:41:42.000Z": "Proud to be @MomsDemand  #GunSenseCandidate of distinction! With @MomsDemand we passed a ban on bump stocks, red flag legislation and took guns out of the hands of domestic abusers in Rhode Island. Next up: Let's ban assault weapons to keep our families and communities safe.", "2018-07-04T20:25:07.000Z": "So wonderful to see everyone in Bristol this morning. Happy Fourth of July!", "2018-07-04T17:26:27.000Z": "Happy Fourth of July! Proud to be an American and a Rhode Islander - today especially.", "2018-07-03T18:20:46.000Z": "Endorsed Democrats should be candidates who embrace our party's values and stand against the Trump agenda. If I've learned anything, it's that being in the trenches fighting for change and helping people keep up and get ahead matters more than any endorsement.", "2018-06-29T23:30:07.000Z": "Beautiful evening with the hardworking Jamestown Democratic Town Committee! From school committee to town council, keep up the great work!", "2018-06-28T00:35:38.000Z": "Thanks to North Kingstown, Pawtucket, Cranston and Cumberland's Democratic City and Town Committees for your endorsements tonight!", "2018-06-27T22:32:10.000Z": "A Trump Court is a threat to women's rights, LGBTQ+ rights, working families, immigrants and the American dream. It is now more urgent than ever that the legislature pass the Reproductive Health Care Act and protect Rhode Islanders' right to choose. #RHCA", "2018-06-27T15:29:32.000Z": "Rhode Island workers: I have your back. Labor built our middle class, and when our unions are strong, Rhode Island is strong. This decision is wrong-headed, but we will not be deterred -- I will never stop fighting for our workers. Quote Tweet SCOTUSblog @SCOTUSblog #SCOTUS holds requiring nonmembers of public-sector unions to pay fees to cover collective-bargaining activities violates the First Amendment, overruling longstanding precedent Show this thread", "2018-06-26T20:02:00.000Z": "Thanks to the Providence Democratic City Committee and the Middletown Democratic Town Committee for your unanimous endorsements yesterday! #LetsKeepGoing", "2018-06-26T17:12:33.000Z": "In the wake of this devastating decision, let's show the world that there's a place for everyone in Rhode Island -- no matter your religion, your race, where you're from or your immigration status. You are welcome in Rhode Island. #NoMuslimBanEver Quote Tweet The Associated Press @AP BREAKING: Supreme Court upholds Trump ban on travel from several mostly Muslim countries.", "2018-06-26T13:26:57.000Z": "One of the best parts of my job is reading the letters you all send me -- this one was extra special: Seekonk woman spots vintage footage of father in campaign ad A Southern New England woman had the surprise of her life watching television.The woman saw a clip of her father in old footage used in a campaign ad for Gov. Gina Raimondo.Oliver Sullivan was a... turnto10.com", "2018-06-25T21:37:46.000Z": "I'm asking for your support because we need to finish the job we've started together! Rhode Island's progress has not been an accident and we need four more years to make sure everyone is feeling it. Join me: http:// ginaraimondo.com/join", "2018-06-25T00:47:54.000Z": "Thank you Rhode Island Democrats for your endorsement tonight! Look forward to working together to make sure our state's comeback reaches every single Rhode Islander. #LetsKeepGoing", "2018-06-24T22:45:56.000Z": "Thanks for coming out to support tonight at the Rhode Island Democratic Convention!", "2018-06-21T22:05:16.000Z": "Rhode Islanders are getting ahead -- we're on a good path. Let's keep going!", "2018-06-20T22:02:13.000Z": "As long as I am Governor, Rhode Island will not support federal policies that hurt children.", "2018-06-18T00:03:48.000Z": "Always proud to be a Rhode Islander -- this weekend especially. Another fantastic #RIPride is in the books! #PrideMonth", "2018-06-16T19:39:21.000Z": "Happy Pride! You all look great. Loving PrideFest in #PVD today. #pridemonth", "2018-06-16T15:00:01.000Z": "Tonight! Come march with us in the #PrideRI illuminated night parade: http:// bit.ly/marchwithgina  #PVD", "2018-06-14T16:00:11.000Z": "We're making progress, here in the Ocean State. We're now the only state with an off-shore wind farm, and are building solar farms. A cleaner  environment helps the bay, too! It's all part of moving our economy from 36th worst  to ninth best.", "2018-06-14T15:20:57.000Z": "Thank you to the @Teamsters for your support! Together, we will make sure every hardworking Rhode Islander is included in our state's economic comeback. Quote Tweet Teamsters @Teamsters #RI Teamsters endorse @GinaRaimondo for governor. She is standing up for working families in the Ocean State! #1u  #TeamstersLocal251  https:// teamster.org/news/2018/06/r hode-island-teamsters-endorse-gina-raimondo-governor ", "2018-06-13T14:00:01.000Z": "This #PrideMonth , we celebrate our LGBTQ+ community! Our state was founded on the values of tolerance and freedom -- you make Rhode Island a better place. I hope you'll march with me this Saturday! Sign up here: http:// bit.ly/MarchWithGina", "2018-06-12T15:28:16.000Z": "When Washington tries to take away our health care, I will always stand up for the people of Rhode Island. The ACA is working here! Quote Tweet HealthSource RI @HealthSourceRI Because of the ACA places like the Prov Community Health Center can provide health services to more people @GovRaimondo  @SenatorMillerRI", "2018-06-11T19:39:46.000Z": "Rhode Island came out in full force this weekend for another great #PVDFest ! Arts, culture, great food -- our little state has it all. We loved celebrating with everyone!", "2018-06-09T17:56:03.000Z": "Happy Gaspee Days to everyone celebrating! Proud to live in our revolutionary state.", "2018-06-07T14:51:23.000Z": "I worked with the legislature to cut the car tax and we're phasing it out! Your bill is already 23% less, and will be eliminated completely over the next five years.", "2018-06-06T14:52:23.000Z": "I'm proud to accept the endorsement of my friends @UFCWLocal328 . As the granddaughter of a hardworking meat cutter, UFCW's support is especially meaningful. I will never stop fighting for Rhode Island workers! GoLocalProv | Politics | UFCW Local 328 Endorses Raimondo's Re-Election for Governor United Food and Commercial Workers (UFCW) Local 328 has endorsed Gina Raimondo for re-election for Governor. golocalprov.com", "2018-06-02T23:32:46.000Z": "Glad to end a busy day with the active Cumberland Democratic Town Committee at Angelo's talking about everything from fixing Diamond Hill Road to fixing our schools - thanks for having me!", "2018-06-02T21:09:45.000Z": "Thank you!! #letskeepgoing  https:// twitter.com/_andyboardman/ status/1003011953684557825?s=21  This Tweet is unavailable.", "2018-06-02T20:13:28.000Z": "Proud to #WearOrange with @MomsDemand today! Together, we are taking steps to #EndGunViolence .", "2018-06-02T16:58:49.000Z": "It's a great weekend to knock some doors! Kicking off a great Weekend of Action canvass for Rhode Island Democrats.", "2018-06-02T16:17:05.000Z": "Nice to see a great Rhode Island leader Jennie Johnson from @CityYearPVD with her son this morning, at the NAACP Providence Branch Freedom Fund breakfast!", "2018-06-02T16:14:55.000Z": "What inspiring musical selections at this morning's NAACP Providence Branch Freedom Fund breakfast from @Refined313 . Loved clapping along to \"Optimistic!\"", "2018-06-02T14:31:38.000Z": "Wonderful breakfast with Exeter Democrats! Thanks Bob Johnson and the Committee for letting me join the fun.", "2018-06-01T17:07:52.000Z": "Today, Rhode Islanders are safer than they were yesterday. Life-saving red flag legislation and a ban on bump stocks are the law of the land in Rhode Island. Let's keep going. #WearOrange", "2018-05-31T22:06:33.000Z": "I ran for governor to change things, and we have -- but our job's not done yet. Let's make sure our comeback reaches every single Rhode Islander: http:// ginaraimondo.com/join", "2018-05-31T20:48:20.000Z": "Loved stopping through Olneyville today! A dynamic community in the heart of Rhode Island. Quote Tweet ONE NB @1_neighborhood Today @GinaRaimondo joined our Executive Director, @Sabina_Matos and the Olneyville team on a journey through the square! #ovshines", "2018-05-30T18:56:30.000Z": "Rhode Island continues to lead the nation in #OffshoreWind ! Today we announced the new Revolution Wind project -- creating hundreds of #GreenJobs and enough #SustainableEnergy to power 200,000 homes.", "2018-05-29T20:30:57.000Z": "Today, I'm announcing that I'm running for re-election as your Governor! I hope you'll give me the chance to finish the job we've started together: http:// ginaraimondo.com/join", "2018-05-28T20:46:19.000Z": "Great to spend some time with our next generation honoring those who have served our country today. #MemorialDay", "2018-05-26T18:47:04.000Z": "Momentum for offshore wind is building and Little Rhody is leading the way! Offshore wind finally gets blowing in the US It's all happening. vox.com", "2018-05-26T14:31:59.000Z": "Been a busy Saturday morning dropping off Tommy at Button Hole for a golf lesson, picking up pizza and spinach pies at D. Palmieri's and buying some geraniums from the Groden Center Greenhouse! Hope you're enjoying it too.", "2018-05-25T22:32:46.000Z": "It's a great weekend to get outside and explore Rhode Island! Today @CumberlandRI Mayor Murray showed us around the great Mercy Woods conservation project.", "2018-05-24T15:28:37.000Z": "Rhode Island's future is brighter with #Dreamers in it. This is progress -- let's keep going. R.I. Senate passes bill to allow Dreamers to get drivers' licenses PROVIDENCE, R.I. - The state Senate on Wednesday passed legislation that would allow so-called Dreamers, undocumented immigrants who were brought to the United States as children and grew up here, to... providencejournal.com", "2018-05-23T23:34:44.000Z": "Phone banking tonight with @RhodeIsland_NOW in support of Rhode Island's important Fair Pay Bill, the Contraception bill and the Reproductive Healthcare Act. We need to get these bills to the floor for a vote!", "2018-05-22T23:25:04.000Z": "Great to be with @YoungDemsRI tonight at their event - we need you now more than ever!", "2018-05-22T22:29:30.000Z": "The Friends @SalterGroveRI are fantastic advocates for their hometown park! Can't wait to come back and see all of the great improvements we're working on together.", "2018-05-22T22:09:10.000Z": "We must preserve and protect our public lands. Loved checking out all the good that Green Bond funding will do for Salter Grove Park and Playground with @FriendsPawtuxet in Warwick today!", "2018-05-21T19:46:57.000Z": "Our economy keeps getting stronger and our comeback is reaching more and more Rhode Islanders. Let's keep going! http:// ripr.org/post/raimondo- touts-jobs-newly-approved-commerce-incentives#stream/0 ", "2018-05-21T16:47:10.000Z": "Our plan to #fixourschoolsRI will help every Rhode Island school district -- urban, suburban and rural: Editorial: Plan fixes schools in suburbs, too Rhode Island has a big problem with dilapidated schools, and voters will finally be able to do something about it this fall, if lawmakers place a bond for school buildings on the November ballot.... providencejournal.com", "2018-05-17T02:05:43.000Z": "Great to see a victory for #NetNeutrality tonight! Kudos to the Senate Democrats. A free and open internet is essential to our democracy and economy. Let's keep going!", "2018-05-16T14:51:10.000Z": "All Rhode Islanders deserve to live somewhere safe and warm. Let's keep going! http:// wpri.com/news/local-new s/blackstone-valley/historic-housing-project-in-pawtucket-getting-major-facelift/1180813065 ", "2018-05-13T19:27:49.000Z": "Happy Mother's Day from our family to yours! Quote Tweet Providence Mom @Providence_Mom In honor of Mother's Day, Providence Moms Blog had a special visit with Governor @GinaRaimondo and her son Tommy to talk about #allthingsmothersday . https:// providence.citymomsblog.com/local/mothers- day-governor-gina-raimondo/ ", "2018-05-11T20:50:57.000Z": "Thanks to our PrepareRI program high schoolers like Melissa in Pawtucket can take college courses for free! That's progress -- let's keep going. http:// pawtuckettimes.com/news/skipping- school-tolman-senior-heads-to-college-one-year-early/article_72e58908-526b-11e8-9eb6-9b5718406943.html ", "2018-05-10T17:07:17.000Z": "Disappointing to see Mayor Fung play politics with the health and safety of children. Under our school construction plan, ALL communities would receive significantly more funding for repairs.Cranston would be among the largest beneficiaries due to poor condition of many buildings Quote Tweet katherine gregg @kathyprojo This is Fung campaign statement on where he stands on Raimondo's $250m school bond. Still seeking clarification,  but it seems to say: \"failed idea'' if - and only if it skews disproportionate share of the $ to Providence.", "2018-05-08T20:30:39.000Z": "Rhode Island is pushing utility companies to move towards a green energy future -- @Forbes highlights the Ocean State as a national leader: https:// forbes.com/sites/energyin novation/2018/05/07/americas-utility-of-the-future-forms-around-performance-based-regulation/2/#50dc465b7941 ", "2018-05-08T00:11:33.000Z": "Fantastic Monday evening with the Newport Democratic City Committee! We've got a lot of work to do together to keep making progress in Newport and across RI. Let's keep going!", "2018-05-07T16:00:34.000Z": "We took a new approach, we're making record investments in education and job training & we won't settle for anything less than the best for Rhode Islanders. Let's keep going! http:// providencejournal.com/news/20180505/ providence-projects-reflect-ris-solid-growth-in-2017 ", "2018-05-06T18:28:22.000Z": "Great to be with hundreds of our friends and neighbors to celebrate all the great work of our senior Senator, @senjackreed !", "2018-05-04T00:20:05.000Z": ". @OptionsMag is back and better than ever! Great tonight! I will never stop fighting for the LGBTQ+ community.", "2018-05-03T15:41:57.000Z": "\"The governor's engagement and her economic-development programs were a key to making this happen.\" Must read: Rhode Island Boasts The Biggest Climb In 'Best States / Worst States' Rankings Rhode Island engineered the most dramatic leap of any state in the 2018 Chief Executive \"Best States / Worst States for Business\" CEO survey. chiefexecutive.net", "2018-05-02T22:39:28.000Z": "Great to see Bristol Bagel Works' Herb Browne and the Lobster Pot's Jeff Hirsh today to discuss all of the great work they're doing in Bristol's small business community!", "2018-05-01T16:28:23.000Z": "Brioche donuts, secret pizza, stuffies and oysters caught fresh off the dock -- Little Rhody is the best. @todd_w_coleman gets it right: Forget Boston - here's why your next US trip should be to Rhode Island Rhode Island's food culture is often overshadowed by its neighboring city of Boston, but the smallest state in the country has a lot to offer. From pizza and hot dogs, to milkshakes and donuts, Todd... businessinsider.com", "2018-04-29T13:28:27.000Z": "Great to be with Mayor Polisena and Johnston Democrats this morning!", "2018-04-24T17:59:47.000Z": "Rhode Islanders deserve a free and open internet. I'll keep doing everything in my power to protect the interests of Rhode Islanders against the Trump administration's agenda. Governor Raimondo Signs Executive Order Protecting Net Neutrality in Rhode Island | Newport Buzz The Best of Newport, RI. Newport Buzz is the leading News Source for Breaking News, What's New and To-Do in Newport, RI. thenewportbuzz.com", "2018-04-21T17:32:46.000Z": "Nothing says spring in Rhode Island like and Little League - play ball!", "2018-04-20T18:56:16.000Z": "Loved speaking with @Angel_Taveras ' @providencecol class of future Rhode Island leaders yesterday!", "2018-04-20T14:46:25.000Z": "Hats off to students across the country participating in today's #NationalSchoolWalkout ! The majority of Americans support a ban on assault weapons. Let's protect our kids and get it done in Rhode Island.", "2018-04-16T20:03:43.000Z": "Congrats to the incredible #BostonMarathon runners - including 145 Rhode Islanders (!) - who braved the New England \"spring\" today! You inspire us.", "2018-04-14T17:30:00.000Z": "ICYMI: \"Gov. Gina Raimondo and the leaders of the General Assembly have good reason to take a bow. Their incentives program clearly made a difference.\" Editorial: Adding 150 jobs at R.I.'s Amgen Rhode Island's growth and opportunity depend on the creation of good-paying middle-class jobs. That is why Amgen's announcement that it will build a new manufacturing plant on its campus in West... providencejournal.com", "2018-04-13T01:12:44.000Z": "And the Ocean State took another critical step forward for #Dreamers who call Rhode Island home with today's full House vote! Let's keep going. Right of 'Dreamers' to get R.I. driver's licenses gets House OK PROVIDENCE, R.I. - A bill to preserve the right of \"Dreamers\" to get Rhode Island driver's licenses, regardless of what ultimately happens at the national level, won House of Representatives approval... providencejournal.com", "2018-04-13T00:55:56.000Z": "Thank you, RI House for passing bills to ban bump stocks and enact a red flag law. Rhode Islanders are taking decisive action to keep our communities safe.", "2018-04-11T02:10:30.000Z": "Big night for progress in the Ocean State as the RI House votes to #ProtectDreamers ! Rhode Island's future is brighter with Dreamers in it.", "2018-04-10T21:44:05.000Z": "Quote Tweet Gayle Goldin @gaylegoldin Just in time for #EqualPayDay , @RISenate votes 33-0 on my bill that makes wage discrimination illegal for protected classes, bans use of salary history in hiring, makes pay ranges transparent, and allows people to talk to their colleagues about their wages if they'd like to.", "2018-04-07T18:51:36.000Z": "Great day to talk progress with some Bristol Democrats - let's keep going!", "2018-04-06T17:49:39.000Z": "Can't stop in Newport without wishing @SalveRegina President Sister Jane Gerety well! What a mighty legacy you'll leave at RI's gem of an oceanfront university.", "2018-04-06T17:10:45.000Z": "Doesn't get much sweeter than a pile of hugs from the fantastic kids at the Newport MLK center! T.G.I.F.", "2018-04-06T16:26:45.000Z": "May be winter outside but it's like spring here at the Edward King House in Newport! Thanks to the choir for an uplifting performance of 76 trombones!", "2018-02-28T03:37:29.000Z": "Congratulations to Pawtucket Councilwoman @SANDRISCANO on becoming Democratic nominee for State Senate Pawtucket's District 8!", "2017-11-10T16:59:13.000Z": "I believe Leigh Corfman and any other person who has the courage to come forward and tell their story. 2/2", "2017-11-10T16:58:15.000Z": "\"If true\" is a simple phrase, but it too often prevents women from sharing their stories of abuse or confronting their abuser. 1/", "2017-11-09T02:26:56.000Z": "I'm proud to stand with this strong group of women leaders who are moving RI forward and strengthening our party. Quote Tweet Katherine Kazarian @repkazarian Proud to stand united with elected women officials of Rhode Island  #whoruntheworld", "2017-11-08T01:37:57.000Z": "Congrats @RalphNortham + @PhilMurphyNJ . Excited to work with you to expand opportunity and support the middle class. #VAGov  #NJgov", "2017-10-18T21:56:15.000Z": "If he doesn't, I stand with other Democratic leaders to demand action to remove him from his leadership role with our state party. 6/6", "2017-10-18T21:55:52.000Z": "Vice Chair Delorenzo should step down. 5/", "2017-10-18T21:55:32.000Z": "that have trivialized and belittled the experiences far too many women have had with harassment. 4/", "2017-10-18T21:55:14.000Z": "Joe Delorenzo forfeited his standing as a party leader with his comments 3/", "2017-10-18T21:54:56.000Z": "Efforts to belittle individuals who speak out do nothing except pour fire on the very real problem of sexual harassment and bullying. 2/", "2017-10-18T21:54:18.000Z": "Anyone who has the courage to talk about their experience with harassment deserves our support. 1/", "2017-09-20T23:45:29.000Z": "#CassidyGraham is another awful version of Trumpcare & a disaster for RI. It's a tax cut for the richest paid for by the poorest & sickest.", "2017-09-05T19:56:40.000Z": "Rhode Island will always stand up for the American Dream, and the Dreamers like Rodrigo who keep it alive. #DACA Quote Tweet Rodrigo P. Pimentel @rdrigopimentel Replying to @jaketapper I came to US @ 10 months of age. If #DACA ends, I may lose everything I've worked so hard for. My car, my home, my friends.", "2017-09-02T11:57:13.000Z": "Since our founding, immigrants & dreamers have made our state and country stronger. Ending #DACA will rip families apart and destroy lives.", "2017-09-04T15:23:31.000Z": "Happy #LaborDay , and thank you to all the working men and women across Rhode Island who have strengthened our state throughout our history. Quote Tweet Gina Raimondo @GovRaimondo Today we honor the American Labor Movement, which protected workers and built the American middle class. 1/ Show this thread", "2017-08-30T20:14:18.000Z": "Our hearts are with the people of Houston. Support relief efforts with a donation to @RedCross or text HARVEY to 90999. #HarveyRelief", "2017-08-23T17:11:23.000Z": "Today I endorsed a new, bipartisan agreement to cut greenhouse gas emissions across the region by 65% by 2030 + grow RI's green economy. 1/", "2017-08-23T01:05:16.000Z": "Congratulations to RI's newest State Senator, @DawnEuer ! Looking forward to working with you.", "2017-08-17T00:42:25.000Z": "Congratulations @nirval1983, my family's new Providence City Councilwoman. It's so great to have more moms in elected office.", "2017-08-16T00:35:40.000Z": "Replying to @GinaRaimondo RIers stand strong against racism and hate. No American leader can equivocate or be silent against the hate past generations fought to end.", "2017-08-16T00:35:29.000Z": "Replying to @GinaRaimondo \"Everyone shall sit in safety under his own vine and figtree, and there shall be none to make him afraid.\"", "2017-08-16T00:33:19.000Z": "\"a gov't which to bigotry gives no sanction, to persecution no assistance\" - Geo. Washington letter to the Hebrew Congregations of Newport.", "2017-08-10T23:49:11.000Z": "\"Providence is open for business,\" @Bisnow writes: Turning Crimetown Into Boomtown: Providence Is Open For Business Leaders of Providence, Rhode Island, look beyond its infamous past to develop a tax and development toolkit to grow its innovation and tech scene. bisnow.com", "2017-08-08T21:03:35.000Z": "Flying direct to Minneapolis on Feb. 4, 2018. Quote Tweet Tim White @TimWhiteRI Latest airline to come to TF Green: The New England Patriots. http:// espn.com/nfl/story/_/id /20285127/new-england-patriots-first-nfl-team-own-planes  . via @espn", "2017-08-04T15:05:37.000Z": "Happy birthday, @BarackObama . Next time you're in RI, let's get another Death by Chocolate from Greggs. Gregg's customers in Providence thrilled by Obama's visit PROVIDENCE, R.I. - \"He came around to every table,\" said Maureen Mooney, 52, of Pawtucket, as she and her sister-in-law left the Gregg's on North Main after meeting President Obama, who stopped in... providencejournal.com", "2017-07-30T15:33:09.000Z": "#GovBayDay is always one of my favorite days of the year. Hope to see you at the beach today. Quote Tweet Gina Raimondo @GovRaimondo There's nothing like summer in Rhode Island, Enjoy all the Ocean State has to offer today for #GovBayDay ! Free beach parking, fishing + more", "2017-07-28T10:10:41.000Z": "Replying to @GinaRaimondo Also, thank you @SenatorCollins , @lisamurkowski and @SenJohnMcCain for voting against #TrumpCare & preserving working people's health care.", "2017-07-28T10:09:15.000Z": "100K RIers woke up relieved that they'll continue to have access to care. Thank you @SenJackReed , @SenWhitehouse for fighting for the ACA.", "2017-07-28T01:45:22.000Z": "There's nothing skinny about #TrumpCare . It's a big fat tax cut for the wealthy paid for by working families and the most vulnerable.", "2017-07-25T15:10:55.000Z": "Replying to @GinaRaimondo If it passes, TrumpCare will cost Rhode Island ~$2B over six years, threatens coverage for 100K RIers and could cost thousands of jobs.", "2017-07-25T15:08:28.000Z": "The GOP repeal proposal isn't a health care bill, it's a tax cut for the wealthy paid for by working Rhode Islanders & Americans.", "2017-07-22T16:46:16.000Z": "Nothing against Panera, but there's nothing better than a local lobster roll in Newport. Try Midtown on Thames while you're here. https:// twitter.com/chrissyteigen/ status/888778045527556097  This Tweet is unavailable.", "2017-07-22T01:02:24.000Z": "Great to meet you, too, Shirley. Would love to host you in RI. Quote Tweet Shirley Leung @leung Great to finally meet @GinaRaimondo . She was on @BosPublicRadio . Talked VCs, RI jobs, Paw Sox stadium.", "2017-07-21T13:32:37.000Z": "RI jobs are at an all time high. This is good news, but we need to keep working to expand opportunity for all RIers. http:// providencejournal.com/news/20170720/ ri-surpasses-pre-recession-jobs-peak?rssfeed=true ", "2017-06-23T17:41:40.000Z": "RI is set to be the 4th state in US to offer tuition-free community college-a game changer for RIers hoping to compete for good jobs.", "2017-06-03T12:43:14.000Z": "Replying to @GinaRaimondo The Ocean State is home to the nation's first offshore wind farm + thousands of clean energy jobs. We can't afford to go backwards", "2017-06-03T12:41:45.000Z": "Rejecting the Paris Accord endangers American leadership, our economy + our public health. Proud #RI is joining the U.S. Climate Alliance Quote Tweet Tim Kaine @timkaine Trump's decision to retreat from #ParisAgreement reflects an extraordinary lack of faith in American innovation", "2017-05-07T16:15:18.000Z": "Great crowd this AM at @SenJackReed 's annual family bfast! Proud to honor our senior senator and his selfless dedication to Rhode Islanders", "2017-04-09T16:07:11.000Z": "READ former Mass. Gov @DevalPatrick in today's @projo : #RIpromise is \"both good policy and good business\" Deval Patrick: Program key to boosting R.I. economy A decade ago, Massachusetts ranked 47th out of 50 states for job growth. We had suffered the largest labor force shrinkage in the nation and we were losing manufacturing jobs twice as fast as the... providencejournal.com", "2017-04-06T21:25:29.000Z": "I when I'm surrounded by young #RI Dems- you're our next gen of leaders! TY to everyone who joined @TomPerez + I at @RICNews today", "2017-04-06T20:59:38.000Z": "Replying to @GinaRaimondo But we can help #RI 'ers get the job training and the skills and the degrees they need to succeed. That's what #RIpromise is all about", "2017-04-06T20:59:06.000Z": "We've been on this path since the day I took office. I want #RI to be prepared for the future, and a HS degree is just not enough anymore", "2017-04-06T20:42:59.000Z": "Replying to @GinaRaimondo  @RICNews  and 2 others @TomPerez : We need to level the playing field + eliminate \"educational mortgage\" from our vocabulary w ideas like #RIpromise", "2017-04-06T20:39:02.000Z": "Replying to @GinaRaimondo  @RICNews  and 2 others Let's guarantee that #RI gives every student a shot at a college education, + the chance to compete for a good job. That's #RIpromise", "2017-04-06T20:38:17.000Z": "Replying to @GinaRaimondo  @RICNews  and 2 others We're @TheDemocrats . We're the party for working families. We're the jobs party. So let's level the playing field 7/x", "2017-04-06T20:37:23.000Z": "Replying to @GinaRaimondo  @RICNews  and 2 others @TomPerez gets it- during one of his 1st trips to RI as Labor Sec, he told me: \"help ppl get an education and you'll grow the economy\" 6/x", "2017-04-06T20:36:31.000Z": "Replying to @GinaRaimondo  @RICNews  and 2 others #RIpromise will make college more affordable for every #RI 'er. It's not about giving smthg away for free- it's about guaranteeing access 5/x", "2017-04-06T20:35:36.000Z": "Replying to @GinaRaimondo  @RICNews  and 2 others That means unless we do something big, 3/10 jobs will go to ppl in other states. That's not okay. I want #RI 'ers to get those jobs 4/x", "2017-04-06T20:35:02.000Z": "Replying to @GinaRaimondo  @RICNews  and 2 others But we're not out of the woods yet. In the future, 7/10 jobs in #RI will require more than a HS degree. But only 4/10 #RI 'ers have that 3/x", "2017-04-06T20:33:33.000Z": "Replying to @GinaRaimondo  @RICNews  and 2 others For the 1st time since 2005, our unemployment rate is LOWER than the nat'l average. We've added close to 15k jobs. We're seeing results 2/x", "2017-04-06T20:32:56.000Z": "I ran for Gov to get #RI back to work. When I took office, we had one of the highest unemployment rates in the US... but not anymore. 1/x", "2017-04-06T19:29:30.000Z": "Replying to @GinaRaimondo  and  @CCRINews And it's working- @CCRINews is the largest supplier of health care workers in the state!", "2017-04-06T19:28:46.000Z": "In the new health simulation lab, students learn the real-world skills they need for jobs in high-demand markets", "2017-04-06T19:21:23.000Z": "We're showing @TomPerez around the new health simulation lab at the @CCRINews Lincoln campus, where #RI 'ers are getting skills they need", "2017-04-06T13:49:42.000Z": "Looking forward to welcoming @TomPerez to RI this afternoon with @RIDemChair , labor leaders and @RIDemParty ! @TheDemocrats", "2017-04-05T12:45:46.000Z": "With Trump cutting investments in education, states must be the catalyst to create opportunity. RI doing just that GoLocalProv | News | Guest MINDSETTER™ Arne Duncan, \"A Promise Worth Keeping\" For as long as I've been involved in education policy, Democrats have always been the party that embraces education as an investment and a pathway out of poverty. As President Trump threatens to cut... golocalprov.com", "2017-04-05T22:00:51.000Z": "Opportunity is not a partisan issue. Read @arneduncan on #RIPromise : GoLocalProv | News | Guest MINDSETTER™ Arne Duncan, \"A Promise Worth Keeping\" For as long as I've been involved in education policy, Democrats have always been the party that embraces education as an investment and a pathway out of poverty. As President Trump threatens to cut... golocalprov.com", "2017-04-04T00:47:37.000Z": "Our party is better when women run for office. Great to speak to the @RIDemParty women's caucus tonight.", "2017-01-30T22:53:44.000Z": "Let's send a clear message to President Trump & Steve Bannon. Sign on to oppose the #MuslimBan : http:// ginaraimondo.ngpvanhost.com/form/-12318736 76973963520?ms=170130tw ", "2017-01-17T23:55:47.000Z": "Tune in live to the State of the State at 7! http:// bit.ly/1QPoGSE  #RISOTS", "2017-01-16T15:47:45.000Z": "2 years of free college for RIers = better opportunities. Check out my plan: http:// providencejournal.com/news/20170115/ ri-students-to-get-free-tuition-for-2-years-at-state-colleges-under-raimondo-budget--poll   #FreeCollegeRI R.I. students to get free tuition for 2 years at state colleges, under Raimondo budget + poll Plan would be among first in the nation to provide free tuition to students attending any of its public colleges, regardless of family income providencejournal.com", "2016-12-24T20:21:36.000Z": "From our family to yours, have a merry Christmas and happy holidays!", "2016-11-22T01:22:07.000Z": "Thank you @GinaRaimondo for your inspiring words and standing with Planned Parenthood! #wewontgoback  #standwithpp", "2016-11-22T01:20:46.000Z": "\"Speak up against bigotry and hate. It will make a difference.\" - @GinaRaimondo", "2016-11-22T01:19:45.000Z": "\"Women's rights are fundamental. Repro rights are fundamental... &as long as I'm your governor, I will make sure those rights are upheld.\"", "2016-11-21T20:45:21.000Z": "As Democrats + Americans, we must continue to fight for working families. #RI is on the move + we're creating an economy built to last. Quote Tweet WSJ Editorial Page @WSJopinion As Democrats sprint left, Rhode Island's  governor Gina Raimondo is going after economic growth: http:// on.wsj.com/2gsrX4k  @AllysiaFinley", "2016-11-21T20:42:11.000Z": "#RI is counting on me to make progress no matter who is in the White House, but I will never tolerate hate. Quote Tweet Gina Raimondo @GinaRaimondo I disagree w/ many of @realDonaldTrump 's views. I will do everything in my power to make #RI stronger http:// wapo.st/2fkuagx", "2016-11-21T20:41:16.000Z": "I disagree w/ many of @realDonaldTrump 's views. I will do everything in my power to make #RI stronger Cory Booker, Zephyr Teachout and more on the Democrats' future Where does the party go from here? washingtonpost.com", "2016-11-09T02:08:04.000Z": "Ceci presenting her case to @JournalKate to stay up late...think we may have to make an exception for this historic night! We're with her!", "2016-11-09T01:53:31.000Z": "Ceci & I are live with @projo @JournalKate as we watch the returns together, tune in as we chat about what this night means to us", "2016-11-08T23:37:14.000Z": "Meeting voters in Central Falls with @JamesDiossa - make a plan to get to the polls before 8pm!", "2016-11-08T23:14:12.000Z": "Polls close at 8pm, Rhode Island! #BeAVoter Quote Tweet Rhode Island Secretary of State Nellie M. Gorbea @RISecState RT if you have voted! #BeAVoter  #iVoted", "2016-11-08T23:11:22.000Z": "Always great to be with my friends in Pawtucket - and such a treat to meet this 92 year old WWII veteran out voting tonight @DonGrebien", "2016-11-08T22:39:31.000Z": "Out cheering on my friend @MaryellnGoodwin - and meeting new friends along the way! Don't forget to vote tonight!", "2016-11-08T17:34:42.000Z": "We're chatting with @NBC10_Bill about this historic election! Join us at http:// Facebook.com/NBC10 & don't forget to vote!", "2016-11-08T14:53:29.000Z": "This morning I stood with my daughter & voted to elect our first woman president! Don't forget to vote, we can make history today #imwithher", "2016-11-08T01:38:48.000Z": "Make your voice heard, #RI ! Don't forget to vote in tomorrow's historic election - look up your polling place at http:// vote.ri.gov", "2016-11-03T23:33:43.000Z": "When @HillaryClinton is in the White House, it will be because of you....banging on doors, making phone calls #ImWithHer", "2016-11-03T23:30:10.000Z": "This @myrwu student drives to NH every week to volunteer. I know we're tired, but we all have to dig in- every vote matters! @HillaryClinton", "2016-11-03T23:25:23.000Z": "An incredible group of volunteers! We're going to miss @Maggie_Hassan as a Governor, but our country will gain from her being in the Senate Quote Tweet Maggie for NH @Maggie_Hassan These Exeter volunteers are fired up to elect Democrats up and down the ticket - Thanks to @GinaRaimondo for coming down #nhsen  #nhpolitics", "2016-11-03T23:23:39.000Z": "Great to be in New Hampshire tonight with @Maggie_Hassan for a phone bank kickoff. We're with her! @HillaryClinton", "2016-10-08T14:29:09.000Z": "Trump's comments were disgusting & disqualifying. Our kids deserve a president they look up to & we all deserve a president we are proud of", "2016-09-17T15:22:36.000Z": ". @HillaryClinton 's values are values I believe in! Great to open her RI office today #StrongerTogether  #RIforHRC", "2016-09-13T14:55:54.000Z": "Primary elections matter -- don't forget to be a voter today! Look up your polling place here: https:// vote.sos.ri.gov", "2016-09-09T13:29:53.000Z": "Was great to show RI off to our next VP @timkaine last month! He'll fight for everyday Americans w/ @HillaryClinton .", "2016-08-04T22:19:19.000Z": "Happy birthday, @POTUS ! Quote Tweet Gregg's Restaurants @GreggsUSA Happy Birthday @POTUS ! We hope you have a wonderful day and celebrate with a delicious chocolate cake!", "2016-07-29T02:59:55.000Z": "\"When any barrier falls in America, for anyone, it clears the way for everyone...when there are no ceilings, the sky's the limit.\" -Hillary", "2016-07-28T20:56:57.000Z": "The only way we're going to really break through is if people become more accustomed to seeing female leaders: http:// nyti.ms/2au8ewD", "2016-07-28T19:59:27.000Z": "Taping an interview w/ @wpri12 & checking out a great view of the arena - you can feel the excitement! #DemsInPhilly", "2016-07-28T18:11:56.000Z": "Great to see @wendydavis today. We're with her!", "2016-07-28T14:46:37.000Z": ". @GinaForRI : Computer science education in school breaks down barriers #TheHillatDNC  #CSforAll", "2016-07-28T14:44:44.000Z": "\"This is core to American economic competitiveness\" - @GinaForRI  #TheHillatDNC  #CSforAll", "2016-07-28T14:45:00.000Z": "Biz are making decisions about where they want to grow, add jobs for next 20 years. I tell them we'll have a pipeline of talent in RI #CS4RI", "2016-07-28T14:43:07.000Z": "We're going to put computer science in every public school in RI, K-12. Learn more at http:// cs4ri.org", "2016-07-28T14:36:35.000Z": "STEM is the future; if education isn't accessible to women & minorities, they're going to be left out - @GinaForRI  #CSforAll  #TheHillatDNC", "2016-07-28T13:15:24.000Z": "At 10 am, @GinaRaimondo sits down w. @BobCusack to discuss computer science in the classroom. http:// thehillatdnc.eventfarm.com  #TheHillatDNC", "2016-07-28T14:16:50.000Z": "Chatting with @TheHillEvents soon about computer science, preparing our students for the future. Join us live: The Workforce of the Future: A Policy Discussion on STEM and Computer America's long-term global competitiveness is dependent on the development of a strong science, technology, engineering and mathematics (STEM) workforce. In fact, careers in STEM are the fastest thehill.com", "2016-07-28T13:34:42.000Z": "1st female RI Gov. on Clinton nom: Little girls get it... It's hard to describe how historic and powerful this is SnappyTV features are now in Twitter Media Studio SnappyTV features and core functionality can now be found in Media Studio, Twitter's content management platform for publishers. LiveCut in Media Studio allows you to create video clips from your... media.twitter.com", "2016-07-28T12:40:41.000Z": "Tune in around 9:15am, I'll be chatting with the team @Morning_Joe Quote Tweet Morning Joe @Morning_Joe Coming up on #morningjoe ... @BilldeBlasio  @keithellison  @GinaRaimondo  #DNCinPHL", "2016-07-27T17:23:17.000Z": "Bridge closures are like having signs that say RI is closed for biz. We put aside the politics of procrastination & took action #RhodeWorks", "2016-07-27T14:55:36.000Z": ". @GinaRaimondo offers Rhode Island's strategies for increasing transparency to build public trust for infrastructure projects", "2016-07-27T17:21:45.000Z": "Talking w/ @BAFuture  @GovEdRendell  @MartinOMalley  @AlHuntDC  @LIUNA about RhodeWorks, rebuilding RI's roads & bridges", "2016-07-27T14:28:36.000Z": "Fantastic panel featuring @GinaRaimondo  @GovEdRendell  @LIUNA & more discussing infrastructure investment", "2016-07-27T14:08:54.000Z": "Great to be w/ @Maggie_Hassan - women are 1/2 the country. We need you, your perspectives at the table @ElectingWomen", "2016-07-27T13:19:34.000Z": "Proud 2 c our Gov @GinaForRI recognized as national leader & speaking of our progress. @ElectingWomen  #DemsInPhilly", "2016-07-27T13:39:04.000Z": "Powerful AM with women leaders from across the country, encouraging women to run, break down barriers @ElectingWomen", "2016-07-27T03:24:02.000Z": "I agree, @billclinton : @HillaryClinton is the best darn change maker! #ImWithHer", "2016-07-26T22:51:09.000Z": "So proud to stand with this group to vote for @HillaryClinton as our next president! #DemsInPhilly", "2016-07-26T21:57:55.000Z": "Getting ready to cast RI's votes for @HillaryClinton . We're with her!", "2016-07-26T17:03:55.000Z": "Mark Weiner was a friend, community leader and proud RIer whose contributions made waves in RI & beyond. Saddened to hear of his passing.", "2016-07-26T14:45:43.000Z": "\"When they go low, we go high.\" If you missed @FLOTUS 's inspiring speech last night, check it out: https:// youtube.com/watch?v=4ZNWYq DU948   #DemsInPhilly", "2016-07-24T15:48:15.000Z": "I'm lucky to have the best first gentleman by my side! Watch @AndyMoffit on @CBSSunday : Role reversals: America's first gentlemen We don't hear much about the first gentlemen of American politics. Come November, that could change, but there are currently six first gentlemen in the United States. Faith Sallie has more on the... cbsnews.com", "2016-07-23T00:53:59.000Z": "Great pick for VP, @HillaryClinton -- and congratulations @timkaine ! These 2 will fight for working families in the White House! #ImWithHer", "2016-07-14T21:20:19.000Z": "So true: https:// twitter.com/aseitzwald/sta tus/753603127924944900  This Tweet is unavailable.", "2016-07-09T22:52:41.000Z": "Proud to support my friend @repgracediaz who always fights for opportunity for all Rhode Islanders.", "2016-07-08T19:04:12.000Z": "My heart goes out to the victims of the recent string of violence across the country. We need peace. We need justice.", "2016-07-02T23:06:02.000Z": "Elie Wiesel was a great moral voice of our time and a conscience for our world. He was also a dear friend. We will miss him deeply.", "2016-06-28T14:34:32.000Z": "RI's budget invests in skills that matter for jobs that pay. Check out details here: http:// governor.ri.gov/budget/", "2016-06-28T14:01:16.000Z": "Addiction is a disease & recovery is possible. Check out our dashboard to address the opioid crisis: http:// preventoverdoseri.org  #HealthyRI", "2016-06-13T00:55:41.000Z": "Saddened and outraged by today's senseless violence. Praying for victims, and everyone affected. We must do more. Orlando club killings: R.I. LGBT activists to hold event Tuesday PROVIDENCE, R.I. - Governor Raimondo said Sunday evening that she will attend a vigil Tuesday in response to Sunday's massacre at a gay nightclub in Florida. \"It's a bit of a memorial and a bit of an... providencejournal.com", "2016-06-09T22:44:53.000Z": "Welcome to Rhode Island, @GE_Digital ! http:// providencejournal.com/news/20160609/ ge-plans-to-bring-hundreds-of-tech-jobs-to-providence-will-seek-state-incentives ", "2016-06-08T03:05:31.000Z": "An incredible night for our country. Stronger together. #ImWithHer  @HillaryClinton  #HistoryMade", "2016-05-29T21:29:46.000Z": "Beautiful ride with @GinaRaimondo on East Bay Bike Path from Providence to Bristol (and back!) #GetOutdoorsRI", "2016-05-01T16:42:18.000Z": "Always an amazing turnout for @SenJackReed 's annual spring breakfast! Great to see so many RIers.", "2016-04-26T20:23:35.000Z": "Be sure to get out, vote and make your voice heard today Rhode Island! #iVoted", "2016-04-25T21:49:32.000Z": "\"Her hallmark has been stepping up and presenting the case...\" Thanks @RIDemChair ! http:// rollcall.com/news/influenti al-women/rhode-island-pension-overhaul   @rollcall Gina Raimondo's Pension Reform Draws Cheers and Jeers - Roll Call It's true that Gina Raimondo is the first female governor of the state of Rhode Island, but that's not what she's most known for.   What landed Raimondo on Fortune's list of the world's 50 greatest... rollcall.com", "2016-04-25T18:17:45.000Z": "Great having @billclinton back in RI at South Street Landing, supporting @HillaryClinton ! Don't forget to vote tmrw!", "2016-04-23T23:10:12.000Z": "Great to be with @HillaryClinton today! Let's be with her Tuesday, Rhode Island!", "2016-04-23T20:43:04.000Z": "The gang's all here for @HillaryClinton ! @jimlangevin  @davidcicilline  @NellieGorbea  @SenJackReed  @SenWhitehouse", "2016-04-23T16:11:24.000Z": "Phone banking for @HillaryClinton in Providence today!", "2016-04-16T15:09:07.000Z": "Let's get out the vote for @HillaryClinton , Rhode Island!", "2016-04-14T19:15:40.000Z": "Great conversations with Speaker Mattiello President @billclinton & many other friends over lunch at Tommy's Pizza!", "2016-04-14T18:30:50.000Z": "Thanks to the amazing team at Tommy's Pizza for preparing a great lunch! Love showing off our state's food.", "2016-04-14T18:10:52.000Z": "Great to see so many Rhode Island @HillaryClinton supporters out to see @billclinton today! #ImWithHer", "2016-04-14T16:20:11.000Z": "I first met @billclinton in college. Today he's in RI campaigning for @HillaryClinton . #ImWithHer  #tbt", "2016-04-07T23:40:08.000Z": "So great to see @Jorge_Elorza , @SethMagaziner & many others at @HillaryClinton 's Providence office opening!", "2016-04-07T23:37:51.000Z": "This election is too important, we need a woman who's ready day 1! @HillaryClinton  #ImWithHer", "2016-04-07T23:33:24.000Z": "Exciting! @RIDemChair McNamara kicking off @HillaryClinton office opening in Providence. @RIDemParty", "2016-04-03T17:29:47.000Z": "Excited that @Gansettbeer 's next chapter is happening in RI! http:// m.providencejournal.com/news/20160403/ hi-neighbor-narragansett-returns-to-ri-with-craft-brewery-in-pawtucket ", "2016-03-30T21:34:05.000Z": "We also have a voluntary school and family empowerment initiative. You can read about it here: http:// governor.ri.gov/initiatives/st ate-of-education/   #RIED16", "2016-03-30T21:33:26.000Z": "Our plan: expand early childhood ed., expand computer science education, help businesses \"adopt\" a school to help kids, & much more. #RIED16", "2016-03-30T21:33:10.000Z": "We propose investing record funds in schools, but more $ alone isn't enough. We must give every student the opportunity to succeed. #RIED16", "2016-03-30T21:32:55.000Z": "Long term, among the best things we can do to ensure that everyone can \"make it in RI\" is to strengthen our neighborhood schools. #RIED16", "2016-03-13T15:40:23.000Z": "Too many of our schools are falling apart. Our teachers & students deserve better. NBC 10 I-Team: Older school buildings struggle with new technology Gov. Gina Raimondo announced a plan this week to bring computer science classes to every public school in Rhode Island by next year.But the NBC 10 I-Team learned some older school buildings are... turnto10.com", "2016-03-12T15:40:19.000Z": "\"People are going to move businesses to where the talent pools are,\" @Atrion CEO Tim Hebert says: IT service company to donate money to Raimondo's computer science plan Atrion, an IT service company based in Warwick, is already committed to donating money and brain power to Gov. Gina Raimondo's plan to put computer science classes in every school by 2017.Brian... turnto10.com", "2016-03-11T16:52:44.000Z": ". @projo : \" #CS4RI has the potential to ... lift student skills, preparing ... RIers for the 21st century workplace.\" Editorial: R.I., the computer state Gov. Gina Raimondo has rightly made improving education the cornerstone of her effort to build the Rhode Island economy. This week, she unveiled a wonderfully creative and collaborative initiative... providencejournal.com", "2016-03-08T18:02:20.000Z": "\"Women's rights are human rights.\" #IWD2016", "2016-03-07T17:28:21.000Z": "Brown is proud to be part of #CS4RI , positioning RI as a leader to bring computer science to students statewide http:// bit.ly/21hhLb1", "2016-03-07T18:14:37.000Z": ". @Microsoft , #RhodeIsland & @GinaRaimondo leading the way for access to computer science education http:// spr.ly/6019BeVOL  #CS4RI  #CS4All Giving all students a chance to create the future - Microsoft on the Issues Today, I am thrilled to stand with Rhode Island Gov. Gina Raimondo as she leads an initiative to bring computer science education to every public K-12 school across Rhode Island. The governor's focus... blogs.microsoft.com", "2016-03-07T18:43:31.000Z": "Proud to announce our plan to help every public school in RI teach #computerscience classes by Dec 2017: https:// medium.com/@GinaForRI/pre paring-rhode-island-students-for-21st-century-jobs-307b8eea0e2#.p7xkezakw   #CS4RI Preparing Rhode Island Students for 21st Century Jobs Today Rhode Island launched one of the most comprehensive statewide computer science programs in the country - Computer Science for Rhode medium.com", "2016-03-07T16:47:48.000Z": "Excited to announce the launch of a new comprehensive statewide #computerscience initiative at 1pm: Raimondo to announce statewide computer science initiative Monday PROVIDENCE, R.I. - Governor Raimondo, joined by federal and state officials as well as representatives from business and education, will announce the launch of a comprehensive statewide computer... providencejournal.com", "2016-03-02T02:32:23.000Z": "RT if you're ready to make history.", "2016-03-02T04:10:14.000Z": "Congratulations to @HillaryClinton on a big night! #ImWithHer", "2016-02-26T19:10:06.000Z": "Rhode Island proves we can save on health costs without harming low-income people http:// thkpr.gs/3754132", "2016-02-24T20:39:10.000Z": "My favorite donuts getting well deserved recognition: http:// patch.com/rhode-island/n orthkingstown/allies-donuts-named-best-donut-shop-america   @AlliesDonuts Allie's Donuts Named a \"Best Donut Shop in America\" Thrillist had kind words for the Rhode Island institution and the editors were particularly floored by their legendary donut cake. patch.com", "2016-02-18T20:27:00.000Z": "\"Gov Gina Raimondo is on the right track with her plan to make the PSAT & the SAT \"free\" for RI public HS students.\" http:// m.providencejournal.com/article/201602 18/OPINION/160219377 ", "2016-02-13T15:00:25.000Z": "#RhodeWorks is an example of the power of working together to tackle a major problem & create jobs: Raimondo signs Rhode Island truck toll bill Senate voted 25-12 to authorize tolls and $300M in loans to improve bridges providencejournal.com", "2016-02-10T15:30:06.000Z": "Check out this piece in the @projo on the importance of #RhodeWorks : http:// providencejournal.com/opinion/201602 10/editorial-time-to-act ", "2016-02-09T17:12:11.000Z": "RI has the worst bridges in the nation. #RhodeWorks puts our state on a path to rebuild our infrastructure & puts RIers back to work.", "2016-02-07T17:33:55.000Z": "Great editorial in the @projo on our jobs budget for the year ahead: Editorial: A jobs budget Gov. Gina Raimondo seemed to hit her stride Tuesday in her second state of the state address. She was confident, without projecting arrogance; optimistic, without ignoring Rhode Island's serious... providencejournal.com", "2016-02-05T17:31:34.000Z": "This is what RI's new economy looks like: Electric Boat & @CCRINews teaming up to train workers. http:// thewesterlysun.com/home/top/83956 24-129/governor-partnership-key-in-making-westerly-ccri-campus-happen.html ", "2016-02-03T00:24:17.000Z": "ICYMI: Let's make the SAT and PSAT free so everyone has a chance to succeed http:// bit.ly/1QFHoPB  #MakeItInRI  #RIBudget Raimondo plans to offer free SATs, PSATs in budget proposal 'If you want a good job in this economy, you need to receive an education beyond high school,' she tells class at Smithfield High. providencejournal.com", "2016-02-03T01:09:22.000Z": "Did you miss @GinaRaimondo 's State of the State address?  Watch it here: Full Speech: State of the State Address Gov. Gina Raimondo delivers her State of the State Address to the General Assembly on Tuesday, Feb. 2, 2016. turnto10.com", "2016-02-01T22:30:30.000Z": "Looking forward to the State of the State tomorrow night. Here's a preview: Rhode Island governor to talk jobs at State of the State Rhode Island Gov. Gina Raimondo is heading into her second State of the State address buoyed by a flurry of promising news about the state's long-awaited economic recovery but also struggling to... turnto10.com", "2016-01-31T19:10:39.000Z": "RI needs an educated workforce now more than ever. We're focused on ensuring access to post-secondary learning: Shannon Cassidy: Praise to R.I. for holding the line on tuition Praise to the Rhode Island Council on Post-Secondary Education for its recent decision not to raise tuition rates for the state colleges for this coming fiscal year. This is a win for students trying... providencejournal.com", "2016-01-25T14:34:06.000Z": "Excited to sign petition to get @HillaryClinton on the RI primary ballot!", "2016-01-23T18:19:10.000Z": "Travel conditions are deteriorating throughout the state. Rhode Islanders urged to use caution on rds #JonasRI", "2016-01-23T19:06:40.000Z": "For winter weather updates, preparedness info & to report a power outage, visit http:// riema.ri.gov  #JonasRI", "2016-01-23T15:10:46.000Z": "Providence County upgraded to a Winter Storm Warning. In effect til 7 AM Sun http:// inws.wrh.noaa.gov/weather/alerti nfo/28581169   #JonasRI", "2016-01-13T03:09:28.000Z": "Seven years of progress. We need to build on it-not go backwards. #SOTU", "2016-01-13T02:41:29.000Z": "\"Our troops are the finest fighting force in the history of the world.\" - @POTUS  #SOTU", "2016-01-13T02:40:23.000Z": "\"The planet we'll preserve-that's the kid of future our kids and grandkids deserve.\" - @POTUS  #SOTU  #ActOnClimate", "2016-01-13T02:23:25.000Z": "\"Real opportunity requires every American to get the education and training they need to land a good-paying job\" - @POTUS  #SOTU", "2016-01-12T21:28:49.000Z": "Check out this piece in @BostonGlobe on how we're working to remake RI's economy: R.I. governor's road show seeks to remake state economy - The Boston Globe Gina Raimondo, starting her second year in office, is pushing the idea that her state could become a tech hub. bostonglobe.com", "2016-01-01T05:08:44.000Z": "Happy New Year!!", "2016-01-01T02:24:36.000Z": "Great way to close out 2015 together @GinaRaimondo Quote Tweet Gina Raimondo @GovRaimondo New Year's Eve fun on the ice!", "2015-12-31T16:27:33.000Z": "@GinaRaimondo 's fantastic year earned a \"Best of 2015\" nod from @PPI . https:// medium.com/@DmitriMehlhor n/the-best-and-worst-of-2015-5b8deab668dd#.kkb21suuc   #rhodeisland", "2015-12-30T18:23:54.000Z": "Fun article in @projo on @Gansettbeer 's comeback: A new generation of neighbors for R.I.'s Narragansett Beer Ten years into its revival, the iconic brewery is hotter and hipper than ever, far beyond the Ocean State. providencejournal.com", "2015-12-29T15:28:39.000Z": "In 2015, we've worked to get RI's economy moving. We're making steady progress every day: http:// m.providencejournal.com/article/201512 27/OPINION/151229572/13831?template=printart   #ItsWorking", "2015-12-24T22:19:47.000Z": "Merry Christmas from our family to yours @GinaRaimondo", "2015-12-21T17:41:36.000Z": "Check out this great @washingtonpost editorial on my philosophy on problem solving: One governor bucking the bipartisan tradition of passing the buck Rhode Island's Gina Raimondo, a Democrat, is redefining responsible governance. washingtonpost.com", "2015-12-17T15:17:22.000Z": "Tommy getting ready for his holiday show at school this morning. So excited!", "2015-12-16T22:02:25.000Z": "\"Somebody told me that I was like a can of WD-40\" Find out what that means in our year-end intv'w w/ @GinaRaimondo  http:// ripr.org/post/year-end- interview-raimondo-talks-jobs-economy-education-more ", "2015-12-17T04:17:04.000Z": "At summit, leaders brainstorm to attract businesses to #RI . http:// bit.ly/1Ial5Bq", "2015-12-15T02:03:58.000Z": "\"Infrastructure is too important to our quality of life ... to delay action any longer,\" @RayLaHood writes: Ray LaHood: Rhode Island should support RhodeWorks America's infrastructure made this country great. But for too long our roads and bridges have been neglected and fallen into disrepair. America stopped investing in itself when it stopped investing... providencejournal.com", "2015-12-12T22:58:54.000Z": "The strong Paris agreement on climate means a safer, more secure world for our kids. A perfect example of what American leadership can do.", "2015-12-11T18:49:07.000Z": ". @iandon & @ScotMackRI talk with Stefan Pryor about RI's positive momentum and what's next. Listen here: http:// ripr.org/post/bonus-qa- pryor-economic-incentives-superman-building-cambridge-innovation-center-more   #ItsWorking", "2015-12-08T18:15:12.000Z": "As the Ocean State, we're exceptionally vulnerable to climate change. We need to take this opportunity to lead: Raimondo order sets plan to reduce R.I.'s carbon footprint PROVIDENCE, R.I. - In a bid to reduce Rhode Island's carbon footprint, Governor Raimondo has pledged to procure all of the electricity used by state government buildings from renewable sources of... providencejournal.com", "2015-12-06T18:47:16.000Z": ". @cicnow sees opportunity for growth in Rhode Island: http:// m.providencejournal.com/article/201512 05/NEWS/151209536   #ItsWorking", "2015-12-02T14:29:22.000Z": "\"Raimondo and Clinton are blazing their own trail\" Check out this @JenMcDermottAP story on parenting & governing: http:// bit.ly/1TiCmZi", "2015-11-26T21:15:06.000Z": "Ceci & I are bringing chocolate mousse for dessert!", "2015-11-26T16:16:55.000Z": "Go Rams! Fun to be with old friends at the La Salle / East Providence game. Happy Thanksgiving!", "2015-11-26T14:52:07.000Z": "Happy Thanksgiving! Quote Tweet Andy Moffit @AndyMoffit The traditional Thanksgiving chocolate mousse begins with @GinaRaimondo & Ceci separating egg whites and yolks..", "2015-11-25T15:35:18.000Z": "Lighting up the Big Blue Bug: a fitting prize for students who helped make the American burying beetle RI's insect: Nibbles and the burying beetle, a Rhode Island couple PROVIDENCE, R.I. - As a final celebration of their successful mission to make Rhode Island's state insect the American burying beetle, students from the St. Michael's Country Day School will get the... providencejournal.com", "2015-11-24T17:55:13.000Z": "Rhode Island can be an innovation hub. Jim Berens of Wexford Sci & Tech is right: http:// ripr.org/post/wexford-s cience-technology-president-touts-providence-innovation-hub ", "2015-11-23T19:30:38.000Z": "Too many of our children do not have the skills they need to succeed in today's economy. Our kids deserve better. http:// providencejournal.com/article/201511 22/OPINION/151129859/13984 ", "2015-11-23T01:00:54.000Z": "We are pursuing an ambitious economic strategy that will put Rhode Island back in the game. Raimondo launches incentive programs to jump-start economy - Providence Business News PROVIDENCE - Gov. Gina M. Raimondo and Commerce Secretary Stefan Pryor launched three new incentive programs on Wednesday in an effort to grow the state's economy. Applications for the Innovation... pbn.com", "2015-11-20T19:26:22.000Z": "Providing Rhode Islanders with educational opportunities is so important. Proud of these students: http:// m.providencejournal.com/article/201511 19/NEWS/151119183   #ItsWorking", "2015-11-15T03:51:45.000Z": "\"I think the president's job is to do everything possible-everything she can do-to lift up the people of this country.\" -Hillary #DemDebate", "2015-11-15T03:50:35.000Z": "For too long, issues affecting women and families-from childcare to paid leave-have been dismissed as \"women's issues.\" Those days are over.", "2015-11-15T03:20:38.000Z": "As we're seeing tonight, @HillaryClinton has the best vision and ideas to move us forward and keep us safe. #ImWithHer", "2015-11-15T03:16:29.000Z": "We cannot accept 33,000 gun deaths per year as \"normal.\" Most Americans-including law-abiding gun owners-believe we can and must do better.", "2015-11-11T21:26:23.000Z": "Thinking of those who have served our country this Veterans Day. Missing my favorite vet today. #ThankAVet", "2015-11-07T01:05:07.000Z": "Had a great time cooking my family calzone with Chef Frank Terranova @JWUProvidence ! Watch here & get the recipe: Gov. Gina Raimondo's family calzone Makes: 6 large calzonesIngredients:2 pounds pizza dough divided into 6 pieces2 bags of fresh baby spinach1 can black olives drained and diced6 ounces of sliced pepperoni, cut into strips2 cloves of... turnto10.com", "2015-11-05T01:34:44.000Z": "", "2015-11-05T00:20:21.000Z": "Mom challenge of the day: needing to resew pointe shoes. Dance class is tomorrow!", "2015-10-28T15:57:09.000Z": "We're making it easier to do business in RI and kickstarting our economic comeback: Raimondo: Tax credits 'designed to kick-start an economic comeback' PAWTUCKET, R.I. - Businesses interested in getting the first two of the new tax incentives from Rhode Island should move quickly, Governor Raimondo and Commerce Secretary Stefan Pryor told real-est... providencejournal.com", "2015-10-26T23:11:19.000Z": "Happy bday, @HillaryClinton ! Proud to be supporting your campaign to be the youngest woman president ever. #HBDHRC", "2015-10-24T12:35:18.000Z": "Tx to those who helped tear through red tape & take action to fix our crumbling schools, put people to work: http:// valleybreeze.com/2015-10-20/paw tucket/pawtucket-gets-big-bucks-new-fund-fix-schools#.VigmtxNViko ", "2015-10-23T23:25:07.000Z": "Too many schools are falling apart. Kids deserve better. We're fixing them: Council grants Raimondo $20M improve RI schools Gov. Gina Raimondo is trying to improve the education of more than 30,000 students around Rhode Island while also creating jobs.She addressed the Council on Elementary and Secondary Education on... turnto10.com", "2015-10-22T01:34:44.000Z": "This fund will be instrumental in rebuilding RI schools, creating jobs. Quote Tweet Providence Journal @projo #RI awards $19 million in school construction aid, via @PatrickAnderso_ -- http:// bit.ly/1LJIjgV", "2015-10-18T15:02:32.000Z": "Carmen Sanchez is an inspiration for anyone trying to make it in RI. Watch her tell her story: Latino Entrepreneurs | Connections, Resources & Opportunitiy See Rhode Island Latino Entrepreneurs who've turned ideas into reality such as Tornado Architects, Los Andes, Comfort Dental, and Drupal Connect. commerceri.com", "2015-10-17T21:28:50.000Z": "\"I have great hope for my family for my firm but also for our community.\" -- Luis Torrado http:// latinocommerceri.com/faces-of-latin o-success/success-story-3/ ", "2015-10-16T00:45:08.000Z": "Check out our new initiative w/ @CommerceRI that connects Latino businesses with targeted resources + opportunities: Latino Entrepreneurs | Connections, Resources & Opportunitiy See Rhode Island Latino Entrepreneurs who've turned ideas into reality such as Tornado Architects, Los Andes, Comfort Dental, and Drupal Connect. commerceri.com", "2015-09-30T13:14:39.000Z": "Thanks for having me! Quote Tweet James A. Diossa @JamesDiossa Packed house at La Casona @CentralFalls_RI for RI Dem Chairs Assoc. Meeting w/special guest @GinaRaimondo  @RIDemParty", "2015-09-15T14:13:09.000Z": "We're trying to help everyone afford higher education. Meet some of the recipients of RI Promise scholarships: Rhode Island's Promise Rhode Island's Promise invests millions of dollars in Rhode Island students with proven academic performance. The scholarship helps tackle the gap between th... youtube.com", "2015-09-04T00:53:26.000Z": "We're committed to helping the hungry in RI with our friends @RIFoodBank  #hungeractionmonth  #spoontember", "2015-08-05T02:29:13.000Z": "Such a delicious meal @enotecaumberto on Federal Hill. Thank you for your hospitality!", "2015-07-31T13:25:13.000Z": "#RealJobsRI lets employers (rather than government) design training initiatives. It's a win-win-win:", "2015-07-25T17:37:35.000Z": "Great morning exploring Potter Pond in Matunuck", "2015-07-04T17:04:23.000Z": "Happy 4th of July, Rhode Island!", "2015-07-01T18:54:18.000Z": "Hunger doesn't take the summer off.  Please help us to raise 150,000 lbs of food for needy RI families Quote Tweet RI Food Bank @RIFoodBank The 2015 @RIFoodBank Summer Food Drive is underway. Thanks to @wpri12 for helping to spread the word. Now donate! http:// bit.ly/1LDNyiP", "2015-06-29T20:59:26.000Z": "Honored to chair @RIFoodBank Summer Food Drive  - we need your help to hit goal of 150000 lbs of food by August", "2015-06-24T16:51:30.000Z": "Hunger doesn't take summer off. Join @RIFoodBank w/food or funds during the Summer Food Drive. http:// bit.ly/1lwHAPW", "2015-06-26T14:42:25.000Z": "What a historic day for our country. Love won today at the Supreme Court. #LoveIsLove  #MarriageEquality", "2015-06-22T22:32:30.000Z": "I applaud @GinaRaimondo for raising the minimum wage for RI workers. Let's keep the momentum going. #RaiseTheWage Quote Tweet Gina Raimondo @GovRaimondo We're out to spark an economic comeback, and making work pay is part of it. Proud to mark this important step today.", "2015-06-22T22:48:34.000Z": "Gov @GinaRaimondo is working hard to make #RI a place with #OpportunityForAll . #RaiseTheWage", "2015-06-21T16:14:21.000Z": "Great read on 1st steps in our #comebackRI in today's @BostonGlobe . Check it out: A slow climb back for Providence - The Boston Globe Rhode Island's capital is trying to meld its character, low costs, and innovative programs into prosperity. bostonglobe.com", "2015-06-21T12:18:21.000Z": "Making Father's Day breakfast in bed!", "2015-06-20T17:26:56.000Z": "Honored to have had the opportunity to speak with @GinaForRI about the great things happening @WestBroadwayMS today!", "2015-06-19T18:05:35.000Z": "Join me at @Pride_RI 's PrideFest tomorrow! RSVP here: http:// ginaraimondo.ngpvanhost.com/form/-24683932 49663875328?ms=150619tw   #RIPride15", "2015-06-01T14:33:27.000Z": "In RI, @GinaForRI is being praised for bold leadership on rebuilding the state's infrastructure #DemGovResults  http:// ow.ly/NIffu", "2015-05-28T20:00:52.000Z": "Replying to @GinaRaimondo The longer we wait to fix our roads & bridges, the more expensive it becomes. Now is the time.", "2015-05-28T20:00:11.000Z": "Replying to @GinaRaimondo We're not stopping with just a few roads & bridges. This plan will make 90% of RI bridges structurally sufficient by 2024.", "2015-05-28T19:59:40.000Z": "RI bridges are the worst in the country. It's long past time to fix them & we have proposed a plan to do just that: http:// dot.ri.gov/news/rhodework s.php ", "2015-05-16T15:28:46.000Z": "We are so proud of Tommy for making his First Communion!", "2015-05-09T13:32:35.000Z": "\"The system can change.\" Good piece on US healthcare & all the unnecessary spending. We can #ReinventMedicaid in RI. http:// newyorker.com/magazine/2015/ 05/11/overkill-atul-gawande ", "2015-05-07T03:08:25.000Z": "Welcome to Rhode Island, @volvooceanrace ! #VORNewport Quote Tweet Volvo Ocean Race Newport @VOR_Newport Congrats to @DongfengRacing  @dongon their Leg 6 win to #newportri and to @ADORlog their 2nd place finish. Welcome to USA! #VORNewport", "2015-05-05T19:47:56.000Z": "Proud to appear in this video w @NellieGorbea on women holding office in RI! Great piece, @ywca_ri : Women Holding Office: Changing the Conversation YWCA Rhode Island commissioned DuoPictures to create its fourth documentary in a series entitled \"Women Holding Office.\" The documentary focuses on the first... youtube.com", "2015-05-04T17:11:43.000Z": "Governor @GinaForRI with GC students at Roger Williams middle school", "2015-05-02T01:30:26.000Z": "So happy to see my friend former First Lady Dottie Licht tonight @RIFoodBank Food Truck event", "2015-05-02T01:23:38.000Z": "Great times with @dadekian & Andrew Schiff for amazing Food Truck event to benefit @RIFoodBank  #EatDrinkRI", "2015-04-29T19:27:00.000Z": "Does your child like to cook? @FLOTUS wants kids to submit healthy recipes: http:// to.pbs.org/HLC . One RI kid will attend #KidsStateDinner !", "2015-04-29T02:34:18.000Z": "RI knows #LoveCantWait -- now it's time for loving couples everywhere to be recognized!", "2015-04-26T00:51:39.000Z": "Tonight we had another fantastic meal @BlazeEastSide1 , always delivering great food and fun place for whole family", "2015-04-24T16:51:04.000Z": "My husband @AndyMoffit supports our family, and me. More than anything, we're a team. These guys could offer Bill Clinton advice if he gets the 'first spouse' gig A first gentleman could soon be living in the White House, but some men are already defining the role. washingtonpost.com", "2015-04-24T14:11:34.000Z": "We had great time last year, so can't wait for @RIFoodBank 's Food Truck event next Friday http:// rifoodbank.org/NewsEvents/Tru ckStopAFestivalofStreetEats/tabid/257/Default.aspx ", "2015-04-23T17:13:09.000Z": "Business & labor agree: my #JobsPlan is good for RI. Great op-ed from the heads of @Provchamber & RI @BldgTrdsUnions Michael F. Sabitoni and Laurie White: Raimondo's ideas would move R.I. forward Gov. Gina Raimondo got it right in her inaugural address when she said we \"must foster an environment where businesses want to add jobs and where we support our workers. If we do that, if we rebuild... providencejournal.com", "2015-04-17T19:39:01.000Z": "Tomorrow is http:// Do-Over-Day.com in RI. The right time to do-over those cancelled winter nights out. You in? @ProvidenceRI  @RIHospitality Do Over Day goprovidence.com", "2015-04-14T17:46:46.000Z": "We all did too much snow shoveling and not enough going out this winter, so let's do-over our plans this Saturday Do Over Day goprovidence.com", "2015-04-14T13:05:25.000Z": "It's time to end gender discrimination in pay! SIGN ON & RETWEET: Demand Equal Pay for Equal Work Add your name and demand Congress pass equal pay for equal work! signforgood.com", "2015-04-13T01:32:04.000Z": "With @GinaRaimondo and our whole family, Sunday dinner: pizza frita, roasted chicken & asparagus, cc @FrankBruni", "2015-04-12T19:53:13.000Z": "Every family, every small business & every American deserves a path to lasting prosperity. #HillaryforAmerica", "2015-04-12T02:33:34.000Z": "Amazing game @PCAthletics fighting every minute to the finish.  What a third period!", "2015-04-11T22:08:11.000Z": "Our grounds crew #springcleaning", "2015-04-11T15:10:14.000Z": "Amazing homemade wursts and tasty cheeses yesterday @ChezPascal  #EatDrinkRI", "2015-04-09T23:44:34.000Z": "Way to go @PCAthletics !  On to the Frozen Final!", "2015-04-07T18:18:59.000Z": "I had a wonderful time getting to know and learning from the former First Ladies of Rhode Island this morning", "2015-03-30T21:16:02.000Z": "Business & labor leaders agree we need an economic recovery. Check out this @projo op-ed on my #JOBSBudget : George Nee and Donald R. Sweitzer: Governor's budget would spur R.I. Gov. Gina Raimondo submitted her budget recently, and it's exactly what Rhode Island needs: a bold plan to spark an economic recovery and put people back to work.  For too long we've been passive in... providencejournal.com", "2015-03-30T19:15:26.000Z": "Replying to @RIHospitality Thanks for having me! @RIHospitality First Gentleman @AndyMoffit announces Valentines #DoOverDay on April 18th http:// do-over-day.com", "2015-03-30T15:25:22.000Z": "I'm excited to help announce Do-Over Day w/ @goprovidence & @RIHospitality and put this winter behind us http://", "2015-03-30T15:19:27.000Z": "Go @providencecol !  Congrats to @FriarsHockey for making it to the #FrozenFour ! #ncaaHockey", "2015-03-23T13:28:55.000Z": "What's Your Workout: For @GinaRaimondo , fitness and family go hand in hand http:// shar.es/1fBrNv ~ @pelsworth16", "2015-03-22T21:15:19.000Z": "Tommy & Ceci preparing the special fusilli and chicken cacciatore for tonight's dinner #mangia", "2015-03-22T14:40:33.000Z": "My #JOBSbudget will expand opportunity by putting people to work rebuilding infrastructure in new jobs right away:", "2015-03-15T01:23:25.000Z": "Whole family had a ball and tasty dinner at Breaktime Bowl.  Tommy was our high scorer and picked up a spare", "2015-03-15T01:18:53.000Z": "Amazing duckpin bowling with hand-set pins at Breaktime Bowl at Hope Artiste in Pawtucket - very special place", "2015-03-13T01:48:43.000Z": "Last yr, I promised to work every day & put RI to work. Tonight I announced how I'll keep that promise. #JOBSbudget  http://", "2015-03-08T21:47:10.000Z": "Tommy and I tipping the beans for our Sunday family dinner", "2015-03-07T21:49:10.000Z": "\"We honor those who walked so we could run. We must run so our children soar.\" Pres. Obama delivered a powerful, patriotic address. #Selma50", "2015-03-06T22:31:16.000Z": "Check out the amazing work led by our friend @DRBDouglas in Chicago's South Side The Obama Man Turning Around Chicago's South Side Isn't Rahm Emanuel You've probably never heard of Derek Douglas but in Chicago, he is redefining how the city's most powerful university engages with the communities around it. nextcity.org", "2015-03-04T21:30:34.000Z": "Replying to @Amica A few days left to give back to RI through @amica  #75KChallenge : http:// bit.ly/1DUrlJL & help @liveunitedri , @RIFoodBank , @CrossroadsRI", "2015-03-02T01:15:29.000Z": "Before the snow fell too hard, we had a great family walk in the woods at Smithfield @RIAudubon", "2015-02-25T20:28:21.000Z": "Replying to @nokidhungry And thanks for sharing some of RI's amazing food with folks from all over the USA! @nokidhungry  @graciesmatt  @GinaRaimondo  @DemGovs", "2015-02-25T15:30:31.000Z": "It's time to stop RI's decline & spark a comeback. Check out this @projo editorial from the weekend: Editorial: Stop the decline Gov. Gina Raimondo has spent the weeks since her election analyzing the scale of the problem Rhode Island confronts. Last week, she spoke out honestly about the state's dire situation - and the... providencejournal.com", "2015-02-22T22:09:57.000Z": "RBG has blazed a remarkable trail. Admire her comitment to justice for all. Great piece: http:// nytimes.com/2015/02/22/opi nion/sunday/gail-collins-ruth-bader-ginsburg-has-no-interest-in-retiring.html   #NotoriousRBG", "2015-02-16T03:36:34.000Z": "Was awesome to see 3 inspirational, funny women at the @nbcsnl Weekend Update desk for #SNL40 : Amy Poehler, Tina Fey & Jane Curtin", "2015-02-15T18:05:14.000Z": "Staying inside for the blizzard making apple crisp. Mmmm", "2015-02-15T00:57:58.000Z": "We were so impressed with the persistent grit of @PCAthletics Bball & @CoachCooleyPC - big win today for Friars", "2015-02-15T00:14:15.000Z": "Ceci hanging out w Kris Dunn after the game. So fun!", "2015-02-14T23:46:08.000Z": "Great win by the Friars today! Had fun with the kids.", "2015-02-09T02:12:17.000Z": "Tasty birthday dinner by Ceci & @Gina ForRI - Italian pot roast, pappardelle & broccoli rabe #mangia", "2015-02-08T22:08:44.000Z": "Happy birthday to my wonderful husband @AndyMoffit !! Looking forward to a great year ahead!", "2015-02-08T02:06:20.000Z": "Ceci, Tommy and @GinaForRI took me for an amazing birthday dinner at Trattoria Romana in Lincoln #mangia", "2015-02-02T03:08:20.000Z": "Amazing win @Patriots ! Super Bowl champs! Play to the end!!", "2015-02-02T00:48:48.000Z": "Touchdown!!!!!! Go @Patriots !", "2015-02-01T18:22:42.000Z": "Nothing says Super Bowl Sunday like a trip to the pediatrician all together with @GinaForRI", "2015-02-01T16:11:07.000Z": "Tom Brady (of all sizes) ready for the big game.  Go Pats!", "2015-01-31T23:29:43.000Z": "Rhody wins and we celebrate @gorhodyrams", "2015-01-31T23:13:28.000Z": "Great game and great family time at URI Bball v GW @gorhodyrams", "2015-01-27T23:22:46.000Z": "Thanks @RhodeIslandDOC for making sure state employees working on #JunoRI were well fed @RhodeIslandEMA .", "2015-01-27T23:02:43.000Z": "@GinaRaimondo talking to @wolfblitzer live on CNN in just a few minutes", "2015-01-27T21:52:28.000Z": "Very few accidents.  Rhode Islanders have been wonderful and have stayed off roads... @GinaRaimondo  @RIStatePolice", "2015-01-27T21:52:21.000Z": "Based on the latest weather forecast, I am lifting the travel ban at 8pm. Please use caution on road and stay safe.", "2015-01-27T20:38:55.000Z": "Check with your air carrier for flight info. First PVD departure is Wed morn.  Some arrivals later tonight. #blizzardof2015  #TravelTuesday", "2015-01-27T20:52:53.000Z": "Getting the latest on #JunoRI at @RhodeIslandEMA 's Command Readiness Center", "2015-01-26T15:30:36.000Z": "Over 200 residents have signed up for help from our SAFE-D program. SIGN UP NOW to volunteer! https:// surveymonkey.com/s/SRI_SAFE-D", "2015-01-27T20:03:26.000Z": "Read the Executive Order on the Extension of Closure of State Government through 10pm: http://", "2015-01-27T18:57:34.000Z": "If you use oil/propane to heat your home, clear a path to your fill pipe & clear fill vents so that you may receive fuel deliveries #JunoRI", "2015-01-27T16:54:58.000Z": "Due to the duration of Winter Storm Juno and continuing hazardous road conditions, RIPTA will continue to suspend... http:// fb.me/74B70FP9U", "2015-01-27T17:22:52.000Z": "Reminder: Blizzard Warning remains in effect for RI until 8PM http:// inws.wrh.noaa.gov/weather/alerti nfo/20565984   #JunoRI", "2015-01-27T17:16:03.000Z": "Some schools already closed for tomorrow. For updated list of closings, delays & parking bans visit http:// ribroadcasters.com/News_and_Event s/Closings_Delays/  ? #JunoRI", "2015-01-27T16:39:03.000Z": "If you cannot make contact with a loved one and are concerned about their well-being, contact THEIR local police department. #JunoRI", "2015-01-27T17:06:19.000Z": "Clarification on healthcare worker transportation throughout duration of  Restriction on Motor Vehicle Travel http:// ri.gov/press/view/238 94   #JunoRI RIGOV Official Website for the State of Rhode Island ri.gov", "2015-01-27T16:45:59.000Z": "The roads are still not safe and the travel ban is in place until further notice. #JunoRI", "2015-01-27T16:44:25.000Z": "Tonight will be very cold with wind chills. @RIDOT is holding its own and @nationalgridus is working very hard.", "2015-01-27T16:42:16.000Z": "Providing the latest update to the media on #JunoRI .", "2015-01-27T15:08:34.000Z": ". @GinaRaimondo heading out w/ @RIDOTNews to assess roads. Thank you to the hardworking crews!", "2015-01-27T14:07:11.000Z": "Rhode Islanders urged to assist with shoveling out fire hydrants #JunoRI", "2015-01-27T14:30:12.000Z": "Make sure to check on elderly family, friends & neighbors to make sure they are OK & to see if they need assistance w/ shoveling #JunoRI", "2015-01-27T13:41:46.000Z": "Guía en español de números telefónicos y direcciones de Internet durante la tormenta: Via @Projo Solo para (cont) http:// tl.gd/n_1skaa7i", "2015-01-27T13:31:22.000Z": "Here's a handy guide to emergency numbers and web addresses for storm help: http:// providencejournal.com/news/content/2 0150126-emergency-numbers-web-addresses-for-storm-help.ece  Via @projo Emergency numbers, web addresses for storm help For emergencies only: call 911For non-emergency assistance: call 211For reports on road conditions: call 511To report power failure or lines down: National Grid, (800) 465-1212To report a gas leak:... providencejournal.com", "2015-01-27T14:32:00.000Z": "Gobernadora @GinaRaimondo : si necesita ayuda llame al 211 @liveunitedri  #TormentadeNieve  #juno Call 211 for help w storm.", "2015-01-27T14:25:11.000Z": "Need support through #JunoRI ? Call @liveunitedri 's 2-1-1 for assistance.", "2015-01-27T14:02:38.000Z": "Thank you to all Rhode Islanders for being so cooperative with the travel ban so plows can clear the roads. #JunoRI", "2015-01-27T12:28:46.000Z": "Rhode Islanders urged to use caution when shoveling out this AM. Bundle up & take frequent breaks to avoid overexertion #JunoRI", "2015-01-27T13:00:23.000Z": "Keep cell phones, mobile devices & other necessary electronics charged in case you experience a power outage #JunoRI", "2015-01-27T13:13:39.000Z": "BLIZZARD REMINDER:  ALL RIPTA SERVICE SUSPENDED TODAY (TUESDAY, JAN. 27, 2015)  Service will be reinstated as... http:// fb.me/1Di3ALMax", "2015-01-27T02:44:42.000Z": "Reminder: Do not report any incidents on social media. If you need assistance, call 9-1-1 for emergencies and 2-1-1 for anything else.", "2015-01-27T03:15:42.000Z": "Gracias a los policías, guardia nacional, equipo de emergencia que nos están cuidando esta noche.  Txs. to public safety officials!", "2015-01-27T02:33:08.000Z": "Drivers are urged to stay off the roads. If you're still on the roads, get home safe, remain home & hunker down #JunoRI", "2015-01-27T02:51:41.000Z": "For an up to date list of emergency shelters & warming centers, visit our website at http:// riema.ri.gov/response/warmi ngcenters.php   #JunoRI", "2015-01-27T03:14:02.000Z": "Mañana abrirán refugios para calentarse si pierde calefacción.Llame 211 para info. Gobernadora @ginaforri exhorta cuidar por vecinos/familia", "2015-01-27T03:01:57.000Z": "We'll be putting this blower to work; it moves up to 1,800 tons of snow per hour! @GinaRaimondo  @RhodeIslandEMA", "2015-01-26T16:51:17.000Z": "Storm warning- several cancellations.  Check with you airline for flight information. #blizzardof2015", "2015-01-27T00:25:28.000Z": ". @GinaRaimondo talking to MSG Lee-Ann Lyons tracking who is on duty. @RINationalGuard  #JunoRI", "2015-01-26T15:48:26.000Z": "When disposing snow from streets/parking lots, take steps to minimize the impact on public health & the environment. http:// dem.ri.gov/programs/benvi ron/water/permits/ripdes/stwater/t4guide/snowdisp.pdf ", "2015-01-27T00:11:30.000Z": "Read the executive order restricting motor vehicle travel: http:// bit.ly/1H1WOfb", "2015-01-26T23:30:42.000Z": "@GinaRaimondo getting the latest update from Gen. McBride. #JunoRI  @RINationalGuard", "2015-01-26T20:33:25.000Z": "Joint Information Center Operations Announced by RIEMA http:// ri.gov/press/view/238 92   #JunoRI RIGOV Official Website for the State of Rhode Island ri.gov", "2015-01-26T20:50:11.000Z": "For winter weather updates, preparedness info, latest closings & delays, & to report a power outage, visit http:// riema.ri.gov  #JunoRI", "2015-01-26T21:00:29.000Z": "Getting the latest update at @RhodeIslandEMA headquarters. #JunoRI", "2015-01-26T20:11:52.000Z": ". @RIDOTNews getting the latest update on our plowing situation #JunoRI", "2015-01-26T19:20:39.000Z": "I have signed an executive order issuing a State of Emergency for RI. http:// 1.usa.gov/1thjAJP  #JunoRI", "2015-01-26T19:15:10.000Z": "@GinaRaimondo checking on road conditions @RIDOTNews traffic management center", "2015-01-26T18:54:42.000Z": "Keep your cell phones fully charged before the storm hits in preparation for power outages if they occur. #JunoRI", "2015-01-26T15:35:18.000Z": "Do your errands now so that you are not travelling during the height of the storm. Make sure you have gas in your vehicle. #RIsnow", "2015-01-26T18:43:21.000Z": "No matter the time of day, if you are driving in rain, sleet or snow, you must have your headlights turned on. It's the law. #JunoRI", "2015-01-26T18:17:35.000Z": "Please pay attention to your local parking ban. #JunoRI", "2015-01-26T18:16:30.000Z": "Make sure you have the essentials - food, water, blankets, flashlights etc. #JunoRI", "2015-01-26T18:13:35.000Z": "Businesses: please be flexible and keep employee safety in mind. #JunoRI", "2015-01-26T18:12:48.000Z": "Lend a helping hand to your fellow Rhode Islanders. #JunoRI", "2015-01-26T18:12:22.000Z": "Prepare for a multi-day event. #JunoRI", "2015-01-26T18:11:05.000Z": "The message is simple. Prepare. #JunoRI", "2015-01-26T18:09:39.000Z": "My team will be tweeting for me during the duration of #JunoRI .", "2015-01-26T12:49:12.000Z": "The 11a from PJ & the 2:30pm from BI as well as the 4:45pm from PJ & 6:30pm from BI  cancelled  today 1/26/15.  Office open 1-866-783-7996", "2015-01-26T12:39:45.000Z": "Replying to @nationalgridus Please keep our emergency numbers nearby and call if you need us: 1-800-465-1212 in #MA and #RI and 1-800-867-5222 in #UNY .", "2015-01-26T02:10:03.000Z": "Citywide parking ban will go into effect at 7PM on Monday to allow crews to plow. City Rec Centers closed Monday. http:// providenceri.com/mayor/mayor-el orza-outlines-winter-storm-preparedness ", "2015-01-25T23:23:31.000Z": "#Blizzard Warnings posted. Are you prepared? Learn more with #RedCross tips for before, during and after the storm: http:// ow.ly/HUJ3Q", "2015-01-26T00:32:22.000Z": "Snow Removal Volunteers Needed for Anticipated Blizzard #constantcontact  http:// conta.cc/1xVGkvN", "2015-01-26T00:13:13.000Z": ". @NWS issued Blizzard Warning Mon. night - Wed AM. I urge RIers to take steps to be prepared. http:// 1.usa.gov/1zcISLO  #PrepareRI", "2015-01-26T00:26:44.000Z": "Follow @RhodeIslandEMA , @RIDOTNews , @RIPTA_RI & @nationalgridus for important updates on coming blizzard. #PrepareRI", "2015-01-25T19:34:59.000Z": "Great day for family walk in the woods @riaudobon in Smithfield", "2015-01-24T22:32:34.000Z": "Ceci & @GinaForRI making us spinach calzones on a wet & cold winter night #tasty", "2015-01-23T03:13:17.000Z": "Always enjoy seeing my good friends in SEIU. Thanks for your support. Together we'll help rebuild RI's middle class!", "2015-01-21T22:35:58.000Z": "If you haven't yet, check out this feature on RI's 1st First Gentleman, my amazing & wonderful husband, @AndyMoffit : http:// providencejournal.com/politics/conte nt/20150118-as-husband-of-r.i.-gov.-raimondo-andy-moffit-carves-out-new-role-as-first-gentleman.ece ", "2015-01-21T03:12:10.000Z": "\"Let's begin this new chapter together and let's start, right now.\" #SOTU", "2015-01-21T02:36:24.000Z": "Important point from tonight's #SOTU : we need better workforce development and on-the-job training. We can do this in RI!", "2015-01-21T02:34:43.000Z": "Shoutout for RI's own Larry Merlo from @CVSHealth in tonight's #SOTU ! A great example here in our home state!", "2015-01-21T02:29:50.000Z": "Agree w President @barackobama : we need to make pay checks go farther for working families. Time to #RaiseTheWage ! #SOTU", "2015-01-21T02:25:17.000Z": "\"This country does best when everyone gets their fair shot, everyone does their fair share, & everyone plays by the same set of rules\" #SOTU", "2015-01-21T02:22:04.000Z": "\"Expanding opportunity works ... these policies will continue to work, as long as politics don't get in the way.\" #SOTU", "2015-01-19T20:02:33.000Z": "Great afternoon for a family skate at the Providence Rink:", "2015-01-19T18:27:07.000Z": "\"Injustice anywhere is a threat to justice everywhere.\" This #MLKDay let's work together to create opportunity for all!", "2015-01-17T21:54:03.000Z": "Nothing beats Grandma's roasted red peppers and her pizza on a cold day in Smithfield", "2015-01-17T15:05:27.000Z": "Ceci and I just did our first #HourOfCode together! @codeorg", "2015-01-15T00:12:21.000Z": "Great work by @RIStatePolice : http:// ri.gov/press/view/238 00  We must continue to fight human trafficking at every turn. RIGOV Official Website for the State of Rhode Island ri.gov", "2015-01-14T18:04:04.000Z": "\"Nobody should be homeless\": Raimondo, other R.I. officials tour Harrington Hall homeless shelter + Poll http:// shar.es/1borez via @projo", "2015-01-10T17:43:08.000Z": "So proud of Ceci and her teammates for their awesome JUMP! performance:", "2015-01-10T17:38:30.000Z": "Great to see so many Girl Scouts at our packed Open House. 1 of these girls could be a future governor!", "2015-01-09T21:28:59.000Z": "Check out @andymoffit on @TheRhodeShow talking about the inaugural celebration tomorrow: http:// wpri.com/2015/01/09/ope n-house-at-state-house-to-celebrate-inauguration/  Hope to see you there!", "2015-01-09T17:10:42.000Z": "Great time on The Rhode Show inviting all to Saturday's Open House w/ amazing food, performers & skating http:// wp.me/p4ySux-tf1 via @wpri12", "2015-01-08T22:35:08.000Z": "Great shots from @projophoto from my inauguration. Check them out! http:// providencejournal.com/topics/photos/ featured/20150106-scenes-from-the-inauguration-of-rhode-island-governor-gina-raimondo.ece ", "2015-01-06T18:13:14.000Z": "Proud & humbled to be Governor of Rhode Island. We need to ignite a comeback in our state! #MakeItInRI  #inaugRI", "2015-01-06T16:47:03.000Z": "The inauguration starts in less than 15 mins! Thanks to MA Gov-elect @CharlieBakerMA for coming by. #MakeItInRI", "2015-01-06T16:35:11.000Z": "Raimondo tells me her son Tommy asked today to wear the brown hat her late dad wore to her 2010 inauguration. \"He's with us,\" she said.", "2015-01-06T01:45:08.000Z": "Enjoyed spending time with Mayor Grebien at his inauguration in Pawtucket today!", "2015-01-05T22:06:22.000Z": "I look forward to working w Mayor @Jorge_Elorza to create One Providence! Had a great time at his inauguration today.", "2015-01-04T18:33:26.000Z": "Thanks to @mooneyprojo for story on me in today's @projo : http:// providencejournal.com/politics/conte nt/20150103-the-rise-of-gina-raimondo-gallery-video-poll.ece ", "2015-01-03T21:39:22.000Z": "Drivers, please allow extra time to travel as snow is creating slick driving conditions http:// inws.wrh.noaa.gov/weather/alerti nfo/20107268   #RIwx", "2015-01-03T19:33:07.000Z": "Tommy & @andymoffit went on @lprri this am to invite folks to our inaugural events! Schedule: http:// ginaraimondo.com/%E2%80%9Cmake- it-rhode-island%E2%80%9D-inaugural-schedule-events "}