{"2020-07-30T15:39:31.000Z": "The science is clear: our kids should be in schools. The greater risk for our students is not being in school: Noem says 'science is very clear on schools' SIOUX FALLS, S.D. (KELO) - Gov. Kristi Noem said in a news conference in Sioux Falls that the best decision for kids is to have them return to school buildings. keloland.com", "2020-07-17T19:02:31.000Z": "There is a great lesson to be learned from my experience handling COVID...trust your people. Don't lay down mandates that are going to hinder the flexibility that they need to really get through this difficult time. Gov. Noem's advice for states dealing with COVID-19: Trust your citizens, don't 'lay down mandates' U.S. governors should put their faith in the residents of their states and forgo stringent coronavirus mandates, South Dakota Republican Gov. Kristi Noem said Friday. foxnews.com", "2020-06-30T12:23:54.000Z": "George Washington unified our nation.\nThomas Jefferson wrote \"All men are created equal.\"\nAbraham Lincoln ended slavery.\nTeddy Roosevelt was the first President to dine with a black man at the White House.\n\nIt is shameful for @TheDemocrats to slander these great leaders.", "2020-04-27T16:04:06.000Z": "I am working with @POTUS & congressional leaders to ensure states have flexibility in how they use relief funds. Congress can put in place accountability measures while allowing states to use the money to make up for lost revenues as a result of COVID-19. Gov. Noem on COVID stimulus: Give us flexibility, don't bailout... 'Congress has spent plenty of money,' says South Dakota Governor Kristi Noem discussing her states financial response to COVID-19 video.foxnews.com", "2020-04-12T14:00:13.000Z": "With everything going on, it can be easy to lose sight of anything other than the here and now. But on this Easter Sunday, we get to reflect on our blessings and proclaim, He is risen! From my family to yours, #HappyEaster !", "2020-04-10T22:00:04.000Z": "Today we reflect on the ultimate expression of love, when Jesus Christ suffered on the cross for our sins. Because of Him, we are free! #GoodFriday", "2020-04-09T01:35:06.000Z": "Tonight begins the holy celebration of #Passover , and I'd like to wish all of our Jewish friends and citizens a blessed holiday. While our gatherings are different this year, the importance of faith is greater than ever.", "2020-03-17T00:30:04.000Z": "During a time like this, we must do whatever we can to help our small businesses be prepared for whatever comes next. I'm excited to be working with @SBAgov , as well as my economic development team, to assist businesses affected by COVID-19. Gov. Kristi Noem working to activate business loan program amid coronavirus The Governor's Office is working with the SBA to activate the Economic Injury Disaster Loan program in South Dakota. argusleader.com", "2020-03-15T20:06:59.000Z": "On this #NationalDayOfPrayer I am so grateful for God's word that remains the foundation of our faith and guidepost for our daily lives.", "2020-03-15T17:30:04.000Z": "My prayers today are with our nation, the great state of South Dakota, and our families as we seek providence in the fight against this outbreak. I encourage you to join me in prayer today and reach out to your loved ones during a time like this. Trump declares Sunday a National Day of Prayer Hours after declaring a national emergency because of the coronavirus, President Trump suggested the nation look to God for \"protection and strength.\" washingtonexaminer.com", "2020-02-27T22:55:02.000Z": "In the past year, we've made tremendous strides in expanding high-speed internet access across our state. I'm committed to keeping up this momentum by requesting additional funds to help bring our schools, businesses, and communities into the 21st century. South Dakota Governor Pushes for Broadband Expansion Gov. Kristi Noem has continued her push for expanding broadband internet access in the state. usnews.com", "2020-02-26T00:55:03.000Z": "This is great news! No medical facility providing abortions should receive a cent of public funding and I'm proud we have a president who stands for life. #prolife Appeals court upholds Trump administration rules against Title X funding for abortion A federal appeals court on Monday upheld Trump administration rules withdrawing Title X funding from any medical facilities that provide abortions. foxnews.com", "2020-02-24T17:58:19.000Z": "Happy 23rd Birthday there sharpshooter!", "2020-02-22T00:35:08.000Z": "ICYMI: Michael Bloomberg showed us how out of touch he and his liberal elitist friends can be. I challenge him to visit a farm himself and see how hard farmers work every day. Watch me set the record straight here: https:// secure.anedot.com/kristi-for-gov ernor/feb-21-social ", "2020-02-19T15:49:24.000Z": "Congratulations to @SDState 's Cody Wright for receiving the USDA Excellence in College and University Teaching Award for Food and Ag Sciences. Well-deserved! Top Teacher: SDSU professor recognized as one of the top ag teachers in the nation Either in the classroom or out in the pens, Cody Wright has excelled at teaching students at South Dakota State University for many years. Now the animal science professor has agupdate.com", "2020-02-19T03:59:54.000Z": "Thank you for speaking on my behalf tonight Kass at the Hughes County Lincoln Day Dinner in Pierre! I heard you did awesome. . And our cake raised some money too! Appreciate our wonderful Hughes County Republicans!!", "2020-02-19T03:11:45.000Z": "South Dakota Gov. @KristiNoem is right.\n \nBloomberg's insult of America's farmers shows his \"pompous ignorance.\"\n\nFarmers already have a President who fights for them! From RNC Research", "2020-02-18T23:04:38.000Z": "It's senior night for Booker's basketball team! I'm a proud mom - and proud aunt of four nephews on the team too . Love South Dakota!", "2020-02-18T15:24:15.000Z": "Democrat presidential hopeful Mike Bloomberg summed up farming like this: \"You dig a hole, you put a seed in, you put dirt on top, add water, up comes the corn.\"\n\nThese comments are insulting & ignorant. He should spend a day in their shoes. @foxandfriends South Dakota governor slams Bloomberg's 'pompous ignorance' about America's farmers South Dakota Gov. Kristi Noem slammed presidential candidate and former New York City Mayor Michael Bloomberg for his comments that appeared to belittle both farmers and factory workers, saying on... foxnews.com", "2020-02-17T23:10:06.000Z": "Happy #PresidentsDay ! Who is your favorite president?", "2020-02-13T23:44:32.000Z": "Yesterday, I announced the first-ever SD Governor's Student Art Competition. South Dakota is a canvas that inspires creativity, and I'm thrilled to use this competition to encourage our students to pursue art right here, right now. Annual South Dakota Student Art Competition begins The new South Dakota Governor's Student Art Competition was announced by Gov. Kristi Noem during a press conference Feb. 12, in her Capitol reception area. capjournal.com", "2020-02-11T21:55:03.000Z": "I'm working with the National Park Service and U.S. Fish and Wildlife Service to bring fireworks back to Mount Rushmore! You won't want to miss this year's July 3rd celebration! South Dakota Gov. Noem, federal officials continue working on July 3 fireworks celebration Gov. Noem and federal representatives are continuing to work towards the July 3 fireworks celebration at the Mount Rushmore National Memorial. siouxlandproud.com", "2020-02-11T16:02:49.000Z": "We're working to GROW South Dakota's communities. My bill... Protects local control Creates a timely & reliable process to get projects permitted Provides fairness to the process that is essential to growing SD. \n\nCheck this out! https:// agweek.com/news/governmen t-and-politics/4706010-governor-declares-sd-open-business-zoning-rural-development ", "2020-02-08T00:05:03.000Z": "I'm proud to receive support from local, ag, and business leaders as we work to grow and strengthen South Dakota's communities. Our state is OPEN for business. Ag, Business, Community Leaders Support Noem's Legislation to Streamline Rural Development Governor Kristi Noem last week announced that she will introduce legislation that provides certainty and predi... drgnews.com", "2020-02-07T22:10:04.000Z": "President Trump's State of the Union address this week was inspirational. American prosperity is alive and well across our country and right here in South Dakota. Check this out! https:// yhoo.it/2S5Xj2e", "2020-02-06T16:15:05.000Z": "President Ronald Reagan put America first and made sure every single American had the chance to pursue their American Dream. His legacy still resonates through our country and continues to inspire us all. Happy birthday, President Reagan!", "2020-02-05T23:30:04.000Z": "President Trump's bold leadership and free-market agenda have had a tremendous impact on South Dakota. The state of our state and union remains strong! Noem, legislators plan to continue supporting Trump in 'South Dakota values' | INFORUM Johnson, Thune and Rounds all said they plan to continue working within Congress and with Trump as the year progresses. inforum.com", "2020-01-30T22:10:05.000Z": "One thing is clear: it's time America gets back to business. South Dakota Gov.: America needs to get back to business Gov. Kristi Noem, (R-S.D.), discusses how her state is focusing on business and its residents instead of politics. finance.yahoo.com", "2020-01-29T20:35:02.000Z": "The #USMCA is a major win for South Dakota's farmers and producers! Each year, our state exports $586 million worth of goods to Canada & $338 million of goods to Mexico. This trade deal modernizes the old rules and opens up new markets for our businesses. Trump signs USMCA, paving way for job market boom The USMCA, which is the biggest trade deal of all-time, covers more than $1.3 trillion of commerce. foxbusiness.com", "2020-01-29T00:17:59.000Z": "It's time we take steps to help our communities & businesses by expanding housing availability in South Dakota. My administration will utilize the REDI fund to attract developers to invest in our communities & help bring hard-working people into our state. Noem takes steps to increase housing availability in South Dakota The REDI Fund is designed to promote job growth in South Dakota. The low-interest loan fund is available to start-up firms and businesses that are expanding or relocating, and local economic develo... kotatv.com", "2020-01-27T23:25:04.000Z": "Today, we remember the liberation of Auschwitz and the six million Jewish lives that were lost during the Holocaust. We must never forget the evil of antisemitism.", "2020-01-22T20:25:05.000Z": "Today marks the 47th anniversary of the Roe v. Wade decision. Since then, tens of millions of innocent unborn lives have been lost to abortion. As Governor, I am proud to give a voice to the voiceless and proclaim January as the Sanctity of Human Life month.", "2020-01-20T23:55:07.000Z": "Today, we celebrate the life and legacy of Martin Luther King Jr. His passion and dedication to civil rights and nonviolence changed the course of our nation's history forever. #MLKDay", "2020-01-17T16:35:04.000Z": "President Trump kept his promise and succeeded in negotiating a fair trade deal with China. This historic agreement will have a tremendous impact on South Dakota producers. Check this out! Gov. Noem: South Dakota farmers, ranchers thrilled to have a fair... Republican Gov. Kristi Noem praises President Trump for following through on his word to get a fair trade deal with China. video.foxnews.com", "2020-01-16T22:45:04.000Z": "The #USMCA trade agreement finally passed through Congress! I'm incredibly excited about what this means for SD. The USMCA will create thousands of new jobs across the nation & open up new markets for producers & businesses. Senate Passes USMCA Trade Agreement by Wide Margin The agreement will allow free trade between U.S.A, Mexico and Canada among farmers and manufacturers, while updating certain rules in response to recent technological changes. nationalreview.com", "2020-01-16T15:20:06.000Z": "Yesterday, I brought 2 SD producers with me as @realdonaldtrump signed a historic trade deal w/ China. This agreement is an economic WIN for ag. It opens up new markets & advances opportunities for producers to do what they do best: feed the world. Gov. Noem, Sen. Rounds attend signing of US-China Trade Deal at White House - KNBN NewsCenter1 WASHINGTON, D.C. - Gov Kristi Noem and U.S. Sen. Mike Rounds joined Pres. Trump at the White House for the signing of \"phase one\" of a trade agreement between the United States and China. \"The... newscenter1.tv", "2020-01-14T23:48:49.000Z": "South Dakota is the best state in the nation to do business or raise a family. I'm working to expand high-speed internet connection, improve affordable housing options, and create jobs that keep our kids right here in South Dakota. We're OPEN for business! Governor Says South Dakota is Open for Business Governor Kristi Noem says South Dakota is open for business. The governor highlighted expansion of high speed internet services during the state of the listen.sdpb.org", "2020-01-09T15:00:04.000Z": "With a record-high number of abortions, it's time for Congress to eliminate funding for Planned Parenthood once and for all. As Governor, I have been proud to sign pro-life bills that hold Planned Parenthood accountable & protect the rights of the unborn. Planned Parenthood reports record-high abortions, taxpayer funding amid battles with Republicans Planned Parenthood reported record-high abortions and government funding for 2018-2019, despite encountering a wave of Republican-led measures designed to restrict resources and access to the... foxnews.com", "2020-01-06T21:45:04.000Z": "After one of the most difficult years in recent memory, our state's farmers persevered through an incredible set of challenges. I can't think of a more fitting recipient of the Daily Republic's Person of the Year award than South Dakota's farmers! Collectively, South Dakota farmers named The Daily Republic's person of the year | The Mitchell... Farming is inherently challenging. There's risk in almost every decision that needs to be made on what goes into the field, when it should be planted, when it should be harvested, how much to keep in... mitchellrepublic.com", "2020-01-04T00:05:04.000Z": "Last night Qassem Soleimani, one of the world's most brutal terrorists, was eliminated by the U.S. military. I applaud @POTUS for his willingness to show Iran and the rest of the world we will not tolerate any terrorist threats against our citizens. Iran vows 'harsh retaliation' after US airstrike kills Iranian Gen. Qassem Soleimani Iran warned early Friday that the United States would bear all the consequences of the \"foolish\" military attack that killed Iranian Gen. Qassim Soleimani, claiming his assassination would only... foxnews.com", "2020-01-01T15:00:15.000Z": "It's truly amazing how fast 2019 flew by. Serving as South Dakota's governor this past year has been a unique blessing and I appreciate all the support I have received from supporters like you. I hope you and your loved ones have a very safe and happy New Year!", "2019-12-28T23:02:33.000Z": "Portions of I-90 will be closing tonight. Be safe on the roads. I-90 closed in South Dakota I-90 will be closing eastbound from Rapid City to Mitchell and westbound from Mitchell to Wall at 7 p.m. CT, according to the South Dakota Department of Transporation. keloland.com", "2019-12-28T19:45:08.000Z": "Today marks the 74th anniversary of Congress officially recognizing our Pledge of Allegiance. This pledge reminds us of the symbol of freedom the American flag represents and the sacrifices that were made to keep us free. Happy Pledge of Allegiance day!", "2019-12-25T13:45:08.000Z": "Christmas is a special time of year as we gather loved ones to celebrate the birth of our Savior, and share prayers for peace and joy around the world. On behalf of Bryon, Kassidy, Kyle, Kennedy, Booker, and myself, I would like to wish you and yours a very Merry Christmas!", "2019-12-23T18:30:05.000Z": "Today, I want to wish all of our Jewish friends and neighbors across South Dakota a Happy Hanukkah! I hope this season provides you and your loved ones with blessings and comfort.", "2019-12-19T23:30:04.000Z": "Thanks to @POTUS 's leadership, the #USMCA trade agreement has finally passed the House of Representatives. While this should have been approved last year, I'm excited this deal will help open up new markets for South Dakota's businesses and producers. House approves USMCA trade deal after more than a year of talks, sending it to Senate The chamber overwhelmingly approved the United States-Mexico-Canada Agreement, one of President Donald Trump's economic and political priorities. cnbc.com", "2019-12-17T14:50:06.000Z": "Yesterday, President Trump and I met at the White House to discuss ways we can work together to continue streamlining regulations and licenses at the federal and state level. We even talked about bringing back fireworks to Mount Rushmore! 'Very exciting': Trump boasts about fireworks returning to Mount Rushmore for July Fourth President Trump bragged he would be bringing fireworks back to the Independence Day celebration in South Dakota after the practice was stopped a decade ago. washingtonexaminer.com", "2019-12-15T16:15:06.000Z": "Today marks the anniversary of the ratification of the Bill of Rights. Thanks to our founders' wisdom, Americans today enjoy vital freedoms like freedom of speech, freedom of religion, and the right to keep and bear arms!", "2019-12-14T00:55:06.000Z": "The @USNationalGuard has been \"always ready, always there\" for 383 years as of today. Please join me in wishing the National Guard a happy birthday!", "2019-12-12T16:40:05.000Z": "We must teach our kids the dangers of substance abuse. Our new programs are aggressively combating South Dakota's meth epidemic and teaching our kids how to avoid harmful & addictive substances. Together we can eradicate meth from our communities. http:// bit.ly/35hePEI", "2019-12-07T15:15:04.000Z": "On this day, we remember the 2,403 service members and civilians who were killed during the attack on Pearl Harbor in 1941. Thanks to the sacrifices made then, and are made still to this day, we have the opportunity to raise our families in freedom.", "2019-12-06T19:05:23.000Z": "Don't believe everything you read... @RoundsforSenate and @KristiNoem are #BFFs", "2019-12-05T22:33:41.000Z": "Yesterday, I was proud to declare December 4th Women's Vote Centennial Celebration Day and establish the Women's Vote Centennial Delegation. /1 http:// bit.ly/34UC4ED", "2019-12-05T18:02:19.000Z": "A proud day for Watertown and our veterans!! VA opens new outpatient clinic in Watertown (Audio) | Go Watertown December 5, 2019 Mike Tanner KWAT Radio News WATERTOWN, S.D.-A proud day for Watertown today as a... More » gowatertown.net", "2019-11-30T16:50:04.000Z": "On this Small Business Saturday, we have a special chance to help the local businesses that power South Dakota's economy. Show your support by getting out and shopping small!", "2019-11-28T15:30:08.000Z": "I hope that today you are surrounded by friends, family, and loved ones - after all, that's what makes today so special. From my family to yours, Happy Thanksgiving!", "2019-11-19T16:35:03.000Z": "Good news! @POTUS approved our request for a disaster declaration for southeastern SD. These dollars will go a long way in helping our communities rebuild and recover following this year's devastating storms. Noem: Trump OKs disaster declaration for SE South Dakota - KNBN NewsCenter1 PIERRE, S.D. (AP) - Gov. Kristi Noem says President Donald Trump has approved a disaster declaration for southeastern South Dakota for September storm damage. Noem on Monday called the declaration... newscenter1.tv", "2019-11-16T18:35:03.000Z": "This is a huge win for our SD schools! By creating connectivity in classrooms, we arm students with tools they need to prepare for digital careers & revolutionize the future of our economy. Gov. Noem announces advancements in internet access for SD schools - KNBN NewsCenter1 PIERRE, S.D.-  Gov. Kristi Noem announced today that 100% of K-12 school districts in South Dakota now have access to high-speed internet. The high-speed internet access in the schools is now on par... newscenter1.tv", "2019-11-15T23:08:09.000Z": "\"Expanding internet access was a priority and promise Governor Kristi Noem made to the people of South Dakota. After less than a year in office, the governor has already made major strides to improve internet connectivity in the Mount Rushmore State.\" South Dakota GOP Governor Kristi Noem Pledge To Improve Internet Connectivity Is Off To A High-Sp... Expanding internet access was a priority and promise Governor Kristi Noem made to the people of South Dakota. After less than a year in office, the governor has already made major strides, working... rga.org", "2019-11-12T22:05:05.000Z": ". @realdonaldtrump 's announcement to expand ethanol production would be incredible for SD farmers. But the @EPA 's proposed rules fail to fix the problems they've caused. EPA leadership needs to reconsider this approach. South Dakota officials urge EPA to follow President Donald Trump's ethanol plan President Donald Trump directed the EPA to restore the ethanol lost when the EPA exempts oil refineries from the mandate of 15 billion gallons. argusleader.com", "2019-11-11T17:50:06.000Z": "On this Veterans Day, we have the opportunity to honor and celebrate the sacrifice our veterans have made for our country. Thank you for all who have served!", "2019-11-08T15:30:03.000Z": "This first phase in our country's trade deal with China is an exciting step in securing a fair agreement that eliminates barriers & opens up new markets for South Dakota's farmers. Check out my interview w/ Fox News and let me know what you think! Gov. Kristi Noem on phase one of trade deal between US, China South Dakota Republican Gov. Kristi Noem says the trade agreement is not only important for her state but for America as a whole. video.foxnews.com", "2019-11-08T01:05:08.000Z": "I want to hear YOUR STORY. If your family has been impacted by adoption, record a short video and share it using the hashtag #SDAdoptionMonth . Quote Tweet KNBN-TV Rapid City @NewsCenter1 As part of Adoption Month, Noem has encouraged families to record short videos about their adoption experience and share them on social media using the hashtag #SDAdoptionMonth . https:// newscenter1.tv/governor-noem- proclaims-november-as-adoption-awareness-month/ ", "2019-11-07T21:30:00.000Z": "As part of Adoption Month, Noem has encouraged families to record short videos about their adoption experience and share them on social media using the hashtag #SDAdoptionMonth . Governor Noem proclaims November as Adoption Awareness Month - KNBN NewsCenter1 PIERRE, S.D. - Governor Kristi Noem has proclaimed November as Adoption Awareness Month. \"Family is more about what's in your heart than your blood stream,\" said Noem. \"Adoption has had an incredible... newscenter1.tv", "2019-11-07T15:00:07.000Z": "Agriculture plays a key role in South Dakota's economy & this fall's cattle run is no exception. The cattle run will generate millions of dollars in sales and strengthen our rural communities. Fall cattle run boosts South Dakota economy | Agweek The fall cattle run has started in South Dakota, and it has a huge economic impact on the state's cattle producers and rural communities. This is the time of year when most of the calf and yearling... agweek.com", "2019-11-06T22:30:03.000Z": "In June, I joined a horseback ride to raise awareness about the high rate of missing or murdered indigenous women. Afterward, the riders presented a quilt. This week, we displayed it in our Capitol. Grateful and humbled by this gift. Governor Noem joins in honoring missing and murdered indigenous women - KNBN NewsCenter1 PIERRE, SD - On Tuesday Governor Kristi Noem took time to recognize the high rate of missing and murdered indigenous women. The governor displayed an MMIW quilt at the capitol, honoring the women who... newscenter1.tv", "2019-10-29T14:34:54.000Z": "I have requested $17 million in federal assistance to help our communities that were impacted by the September flooding, and tornadoes. Sioux Falls, Madison, and Mitchell need our help, and I hope this is just a first step toward rebuilding & recovery. Gov. Kristi Noem requesting disaster declaration for tornado damage in Sioux Falls The request includes at least $17 million in requested federal assistance for the period of Sept. 9-26. argusleader.com", "2019-10-27T23:41:01.000Z": "A big THANK YOU to Governor Noem, Senator Rounds and Lt. Governor Larry Rhoden for making today's hunt a fun and successful event! @KristiNoem  @SenatorRounds  @lgrhoden Quote Tweet Kristi Noem @KristiNoem Had a great time stopping by the GOP Hunt today! There was an incredible lunch of chili and cinnamon roles (a classic Midwest meal) and a ton of great memories made. Even with the bitter-cold weather, the group bagged over 200 birds! What a great celebration of an SD tradition", "2019-10-27T23:37:10.000Z": "Thank you @KristiNoem for all your support of the @sdgop ! Quote Tweet Kristi Noem @KristiNoem Had a great time stopping by the GOP Hunt today! There was an incredible lunch of chili and cinnamon roles (a classic Midwest meal) and a ton of great memories made. Even with the bitter-cold weather, the group bagged over 200 birds! What a great celebration of an SD tradition", "2019-10-27T22:54:12.000Z": "Had a great time stopping by the GOP Hunt today! There was an incredible lunch of chili and cinnamon roles (a classic Midwest meal) and a ton of great memories made. Even with the bitter-cold weather, the group bagged over 200 birds! What a great celebration of an SD tradition", "2019-10-26T14:15:11.000Z": "Can't wait to cheer on the Jacks today as they beat the Bison!! Any other proud SDSU alumni out there?! #GOJACKS", "2019-10-25T16:15:05.000Z": "Gov. @DougBurgum is getting pretty confident about the #DakotaMarker game this weekend. Overly confident if you ask me. Personally, I think he's going to look great sporting the @GoJacksFB colors after the Jacks pick up the win on Saturday! #GoJack  http:// bit.ly/2BJ9adK", "2019-10-25T03:51:18.000Z": "The Chargers are moving on to the next round of play offs! Congratulations Booker!", "2019-10-24T23:45:04.000Z": "It's always an honor to welcome home National Guard soldiers who've so selflessly served overseas. If you're in the Sioux Falls area, come to Lincoln High School on Saturday at 2:30pm to welcome our heroes back to South Dakota. Hope to see you there! Lincoln High School to host welcome home ceremony for the 147th Field Artillery SIOUX FALLS, S.D. (KELO.com) -- Elements of the South Dakota Army National Guard's 147th Field Artillery receive a welcome home ceremony Saturday at Lincoln High School.  The event starts at 2:30... kelo.com", "2019-10-23T16:15:05.000Z": "Couldn't be more proud of my husband, Bryon! This new initiative will help highlight the tremendous value that our small towns bring to South Dakota and I can't wait for you to hear about our state's hidden treasures. First Gentleman Bryon Noem launches initiative on South Dakota's small towns First Gentleman Bryon Noem will focus on small town life in his new initiative, \"This is South Dakota.\" argusleader.com", "2019-10-20T01:31:28.000Z": "Fun day hunting and harvesting! #sdhunting  #sdinthefield", "2019-10-19T14:00:12.000Z": "Today is the day of the pheasant opener! I hope you all have a safe and abundant season!", "2019-10-16T14:00:07.000Z": "One of my top priorities as Governor is ensuring the safety of the next generation. These grants will better equip us to provide the resources and training our schools need to keep students across South Dakota safe. South Dakota gets $2 million boost for school security initiatives South Dakota school districts will soon have access to more training and threat assessment solutions through new state-funded school security grants, Gov. Kristi Noem's office announced. argusleader.com", "2019-10-14T16:17:57.000Z": "Today is a great day to not only remember the past but celebrate the ways Native American heritage continues to play a big role in South Dakota's legacy. Happy Native Americans' Day!", "2019-10-12T19:32:58.000Z": "Excited to be a part of this event!! @TPUSA", "2019-10-09T14:00:04.000Z": "Expanding our ethanol capabilities is an absolutely critical move for South Dakota farmers & ranchers, as in recent years we have seen lower commodity prices and unstable market conditions. I thank @POTUS for helping provide South Dakotan producers a win! Governor calls Biofuels Plan a \"Big win for producers\" Governor Kristi Noem applauds the Trump administration's new plan to promote biofuels and expand ethanol production. capjournal.com", "2019-10-04T23:10:06.000Z": "I'm proud of the progress we've made in the last nine months, but what many don't have the opportunity to see is the hard work from our public servants that help make South Dakota great. Thank you to all of you who work for a greater cause & serve others. Honoring all who serve South Dakota Albert Einstein once said that \"only a life lived for others is a life worthwhile.\" argusleader.com", "2019-10-01T15:25:04.000Z": "The disfunction happening in Washington shouldn't cause a delay in delivering a win for our farmers. #USMCA will help South Dakota agriculture and boost our economy in the process. Let's get it done! US agriculture industry warns impeachment-related delay in USMCA passage puts off wins for farmers House Democrats' impeachment inquiry against President Trump has evoked concerns passage of the administration's renegotiated North American Free Trade Agreement could stall, leaving agriculture... washingtonexaminer.com", "2019-09-28T23:59:42.000Z": "Today is National Hunting and Fishing Day! Throwback to spending time in the field last year with my family. Great memories. Can't wait for opening day in a few weeks! #NationalHuntingAndFishingDay", "2019-09-27T17:42:51.000Z": "Such a great honor to ride on our world famous South Dakota Buffalo Roundup today! Fantastic morning with great Americans! .", "2019-09-24T22:35:32.000Z": "If @SpeakerPelosi and her caucus spent as much time on legislation as this investigation, they might have passed #USMCA by now. They might have done a lot of good things that South Dakotans need from DC. The 2016 election is over. @realDonaldTrump is president. He has my support.", "2019-09-23T22:30:03.000Z": "It's incredibly important for expecting moms to get the care they need during their pregnancy. These innovation grants will help us find new ways to provide quality care and ensure prenatal and primary care is available throughout South Dakota. Prenatal and Primary Care Innovation Grants awarded The Department of Social Services (DSS) has awarded $1 million of innovation grants to improve primary and prenatal care for women in the Medicaid program. capjournal.com", "2019-09-19T21:35:51.000Z": "Thank you @KristiNoem for hearing our students voices and initiating a much needed change. Noem: DOT to install four-way stop at deadly intersection near Woonsocket State announces improvements for a dangerous intersection in Sanborn County. ksfy.com", "2019-09-20T21:15:04.000Z": "With an evolving marketplace, we need to make sure that we're equipping the next generation with the right skills needed to find a high paying job. We are taking action in our state's schools by pushing for more technical programs to help bridge this gap. Noem, feds push for technical programs in South Dakota PIERRE - Days after a report found that less than half of South Dakota high school graduates are considered college- or career-ready, Republican Gov. Kristi Noem and U.S. Deputy Secretary aberdeennews.com", "2019-09-19T17:15:03.000Z": "The extreme weather we've experienced this year has created a slow-rolling natural disaster of epic proportions. Through it all, though, I'm proud of how our state has stayed strong. We'll keep doing whatever we can to rebuild and restore our communities. Gov. Kristi Noem: Recent weather a 'slow-rolling natural disaster of epic proportions' South Dakota's weather events this year have cumulatively become \"the largest natural disaster our state has ever seen,\" Gov. Kristi Noem said. argusleader.com", "2019-09-11T14:30:08.000Z": "Today, we remember those who lost their lives on 9/11/01. We remember the first responders who risked everything to rescue as many lives as they could. Let us never forget the attacks on our country that day and honor the sacrifices that were made to keep our nation safe today.", "2019-09-05T23:15:05.000Z": "In South Dakota sound financial management is the foundation in everything we do. This GFOA certificate is the highest form of recognition a state can receive for financial reporting & it's an honor for us to be recognized as a national leader in this area South Dakota earns two awards for excellence in financial reporting Governor Kristi Noem today announced that South Dakota has received top awards for financial reporting and management. capjournal.com", "2019-08-30T21:00:05.000Z": "The Connect South Dakota initiative will help us bridge the digital divide in our state, and provide better, more reliable Internet for our rural residents. An important step in the right direction. Grant program funds high-speed internet to rural South Dakota PIERRE | Don and Becky Bergeson are only a 15-minute drive from South Dakota's capitol building. Over the course of the six-mile drive, the landscape transforms from Pierre's small-town atmosphere rapidcityjournal.com", "2019-08-28T23:00:05.000Z": "I'm excited for construction to begin on the brand new State Veterans Cemetery in Sioux Falls. This is a project dedicated to the patriots that made the ultimate sacrifice serving our country & protecting our freedoms. These heroes deserve our gratitude. South Dakota to break ground on State Veterans Cemetery The construction of the new State Veterans Cemetery in Sioux Falls is set to begin next month. argusleader.com", "2019-08-26T20:00:06.000Z": "A new trade deal with Japan would not only be very beneficial for our country, but also\nhelp set the table for future deals in Asia, giving our ranchers & farmers the support they desperately need. Check out my appearance on Fox News this morning: Gov. Noem on what a US-Japan trade deal means for American farmers... South Dakota Gov. Kristi Noem lays out what a trade deal with Japan would mean for her state. video.foxnews.com", "2019-08-23T20:45:05.000Z": "Now more than ever, we need an agreement that re-balances & modernizes the old rules of the road into a 21st century, high-standard trade deal that better serves the interests of farmers & businesses alike. Read my op-ed on why we need the #USMCA here: USMCA: A modernized trade agreement for South Dakota producers Each year, South Dakota producers export $536 million worth of goods to Canada and $345 million to Mexico. argusleader.com", "2019-08-21T19:15:04.000Z": "We must all recognize the role we play in stopping the spread of zebra mussels in our lakes and rivers. You can learn more by watching my PSA here: WATCH: Gov. Noem provides advice on stopping spread of zebra mussels PIERRE, S.D. (KELO.com) -- Gov. Kristi Noem isn't just putting the heft of the governor's office behind the effort to slow the spread of zebra mussels in the Missouri River and other waterways. She... kelo.com", "2019-08-20T20:06:16.000Z": "Glad to have Ed Randazzo helping West River. He's been a rock solid volunteer on our campaigns for years. Now he's officially on the team!", "2019-08-20T19:45:08.000Z": "Planned Parenthood announcing yesterday that they are abandoning federal funds for family planning is welcome news. As Governor, I have been proud to sign several pro-life bills into law & I will continue to lead the way in SD in the fight to protect life. Planned Parenthood abandons Title X federal funds after Trump rule prohibits abortion referrals In a Twitter post on Monday, Planned Parenthood announced it is pulling out of the federal family planning program rather than abide by a new Trump administration rule prohibiting participants from... foxnews.com", "2019-08-18T14:00:15.000Z": "I wouldn't have been able to become South Dakota's first female Governor if it weren't for the hard work of the suffragettes. The 19th amendment was an important step in our nation's proud history which recognized the importance of women's participation in our republic.", "2019-08-17T02:24:48.000Z": "Tonight at the kick off event for the SF Air Show,  I had the opportunity to meet Claude, a 99 year old marine who still to this day salutes his fellow military members and veterans. He makes me so proud to be American. I am grateful for his service.", "2019-08-16T22:00:04.000Z": "It's time for Congress to do what's right and ratify the #USMCA trade agreement. This incredibly important trade deal will create 100K jobs, grow the economy and give South Dakota farmers a fighting chance. Check out my appearance on Fox News this morning: Gov. Kristi Noem on trade: South Dakota farmers want President Trump... South Dakota Gov. Kristi Noem applauds President Trump for fighting for farmers and weighs in on the gun control debate. video.foxnews.com", "2019-08-13T21:30:05.000Z": "Expanding access to high-speed internet requires an all-hands-on-deck approach. I'm thrilled to see the FCC make this investment to expand broadband in SD. These dollars will help as we work to close our digital divide. http:// bit.ly/2Z7MrRS", "2019-08-12T20:30:07.000Z": "Can you believe we're already bringing in a new school year?? As a mom with 1 in high school and 2 having gone through our state's education system, I can say with certainty that we do a lot of things right in our SD schools. Learn more here>> Noem: Bringing in a new school year Find things you are passionate about and act on them. Be bold. See the good in people. Focus each day on leaving this world a little better than you found it. argusleader.com", "2019-08-10T18:51:39.000Z": "We had such a great time at the Castlewood Days parade today!", "2019-08-08T17:00:05.000Z": "During a year of unbelievable damage from storms, South Dakotans have shown incredible resolve at a time when our community has needed it most. I will continue to do whatever I can to support these efforts to rebuild our homes and neighborhoods. Gov. Kristi Noem calls storm damage in Burke 'unbelievable' Governor Kristi Noem visited Burke, SD after an EF1 tornado and wind gusts of up to 100 mph ripped through the city Tuesday night. dakotanewsnow.com", "2019-08-06T21:00:03.000Z": "The Sturgis Motorcycle Rally is always an exciting time for motorcyclists and spectators alike! We encourage all those participating to be safe on the roads and obey all traffic laws. You can find more tips on safe practices in the article below. Highway Patrol urges traffic safety during Sturgis Rally PIERRE, S.D. (KELO.com)  --  South Dakota's Highway Patrol reminds those attending this year's Sturgis Motorcycle Rally not to forget about traffic safety.  The 79th Sturgis Motorcycle Rally began... kelo.com", "2019-08-02T13:54:27.000Z": "Many families are still struggling resuming life as usual after the storms this past spring. Help is available, and I encourage you to read this article to learn more, and to reach out if you need help. Grant funding extended, crisis counseling available to those impacted by spring storms Eligible areas include the Pine Ridge Reservation, Rosebud Reservation, and Cheyenne River Sioux Reservation. kotatv.com", "2019-08-01T18:15:06.000Z": "We've had a tough year in South Dakota, with the storms and flooding causing the largest federally declared disaster in state history. But we're stronger than the disasters and we will recover. Read more about our disaster recovery efforts: NOEM: Dealing with year's big disaster This year has been tough for South Dakotans. The storms this spring brought destruction to homes, businesses, roads and communities throughout the state. Unprecedented flooding made it difficult for... rapidcityjournal.com", "2019-07-31T15:16:31.000Z": "This is good news. When ag thrives, SD thrives. $6.9 billion increase in SD agriculture economic contribution The South Dakota Department of Agriculture has released the 2019 South Dakota Agricultural Economic Contribution Study. capjournal.com", "2019-07-29T21:00:04.000Z": "As a farmer, I understand that this is not only good for farmers and for the local economy, it's good for our state and our entire country. Growing and processing our ag products at home promotes national and food security. Good timing, immediate impact: AGP opens soy processing plant in Aberdeen | Agweek ABERDEEN, S.D. -- Citing good timing for the region's soybean growers, Ag Processing Inc. held the grand opening for its soybean processing plant in Aberdeen on July 17. agweek.com", "2019-07-27T22:45:05.000Z": "We're fortunate enough to live in a beautiful state with so many things to do. Check out the @southdakota events guide to plan your weekend adventure. http:// bit.ly/2SH7Boc", "2019-07-25T19:30:04.000Z": "We should never be afraid to proclaim that we are one nation under God. Thanks to a new law, \"In God We Trust\" will be a part of South Dakota schools this upcoming school year as a humbling reminder of our country's faith tradition. South Dakota public schools to display 'In God We Trust,' under terms of new law All South Dakota public schools will display \"In God We Trust\" in the coming school year after a new law took effect this month, requiring the state's 149 districts to paint, stencil or prominently... foxnews.com", "2019-07-15T13:44:20.000Z": "Congrats, @Dakota_Alliance !! Quote Tweet Dakota Alliance SC @Dakota_Alliance NATIONAL CHAMPIONS!!!!!\nThe DASC U14 Girls just became the USYS PRESIDENTS CUP NATIONAL CHAMPIONS!!!\nThey won 1-0 in overtime vs Century V East.\nThis team did not give up a goal in the entire national tournament and https:// instagram.com/p/Bz6RTI-l6IW/ ?igshid=1bsptm2dwdds6 ", "2019-07-08T20:22:30.000Z": "Strong families have always been the backbone of South Dakota. Now more than ever, we must fight to strengthen the family unit and preserve the values South Dakotans have long embraced. NOEM: Strengthening South Dakota families Strong families have always been the backbone of South Dakota. The kitchen table is where we learn our values. The backyard is where we learn to respect each other. The rapidcityjournal.com", "2019-07-04T17:28:31.000Z": "Lake Norden Triathlon this morning...fun watching Booker and the cousins compete! Thank you to all who serve and protect . Happy Independence Day everyone!", "2019-07-04T15:00:08.000Z": "Happy Independence Day, South Dakota! I'm thankful for the gift of freedom we have in America, and even more grateful for a state that values those freedoms so much. I hope everyone has a happy and safe fourth!", "2019-07-03T20:00:07.000Z": "Charles Mix County continues to deal with the impact of spring floods. Certain roads are still six feet under water. Grateful for the chance to see this first-hand and talk with local leaders on how we can work toward full recovery. Noem surveys storm damage in Charles Mix County Governor Kristi Noem toured flood damage in Lake Andes and met with city and tribal leaders to discuss recovery efforts on Monday. dakotanewsnow.com", "2019-07-02T15:30:04.000Z": "I've been so grateful for the opportunity to host hundreds of our South Dakota High School Activities Association State Champions over the past two months. So much fun celebrating the success of these future leaders. High School State Championship picnics hosted by governor During the months of May and June, hundreds of South Dakota High School Activities Association State Champions were invited by Governor Kristi Noem to three championship picnics at the governor's capjournal.com", "2019-06-27T14:15:03.000Z": "I've been following the development of the Ringneck Energy ethanol plant for quite some time, so I was thrilled to tour the new facility and see the process this week. This plant's new tech will help lead SD into the future of renewable fuels. Ringneck takes flight In conjunction with a visit and tour of the Ringneck Energy ethanol plant by Governor Kristi Noem and Lt. Governor Larry Rhoden, the Onida Chamber of Commerce held a ribbon onidawatchman.com", "2019-06-25T14:30:06.000Z": "Diversity of opinion should be championed on our college campuses, but all too often, we see the opposite. We're working to change that by enacting protections for campus speech, and as a result, serve as a model for the country. South Dakota's Efforts to Protect Speech on Campus Could Be a Model for the Nation A new law strengthening First Amendment protections at state universities is among the first to tackle this growing problem. nationalreview.com", "2019-06-23T00:12:00.000Z": "This is great news for SD. I applaud USDA and the Trump Administration for easing the burden on producers during this difficult year. USDA relieves ranchers, farmers by adjusting grazing, haying date - KNBN NewsCenter1 WASHINGTON, D.C. - Relief is on the way to South Dakota for farmers and ranchers after the U.S. Department of Agriculture adjusted the date for grazing and haying of cover crops on land affected by... newscenter1.tv", "2019-06-21T18:00:04.000Z": "Welcome to South Dakota, @Uber ! I'm looking forward to the increase in convenience and safety that ride sharing will bring to cities across the state. Where are you headed this weekend? Uber comes to South Dakota According to a company news release, on Friday, June 20, Uber officially launched its UberX and UberXL ridesharing service in cities across South Dakota, expanding the options that residents and capjournal.com", "2019-06-20T16:00:04.000Z": "Think you and a few friends could successfully pull a 70,000lb plane? Sign-up for the 2019 Plane Pull hosted at the Maverick Air Center in Sioux Falls this Saturday. The money raised by this awesome event benefits the @sosouthdakota so spread the word! Special Olympics South Dakota holding 'plane pull' this weekend It's an event you might expect to see in \"The World's Strongest Man\" competition - held right here in South Dakota. dakotanewsnow.com", "2019-06-16T14:15:05.000Z": "Happy Father's Day to Bryon! Kassidy, Kennedy, and Booker are so blessed to have you in their lives. And Happy Father's Day to all our South Dakota dads!", "2019-06-14T19:00:07.000Z": "Our flag is a constant reminder of our freedom and the brave men and women who gave their all for our nation. #HappyFlagDay !", "2019-06-14T17:18:55.000Z": "Happy birthday, @realDonaldTrump ! Hope to see you back in South Dakota soon!", "2019-06-10T20:30:14.000Z": "Staff members from the @SDPublicSafety and its @SDEmergencyMgmt already have been working with @femaregion8 officials on how the effort will proceed forward. #keepSDsafe Quote Tweet Kristi Noem @KristiNoem The president's approval of our request for a disaster declaration is great news for our state. Those still recovering from the severe weather will get much-needed assistance. https:// bit.ly/2WzwpDU", "2019-06-10T20:12:47.000Z": "The president's approval of our request for a disaster declaration is great news for our state. Those still recovering from the severe weather will get much-needed assistance. Update: South Dakota Disaster Request Approved PIERRE - President Donald Trump has approved South Dakota's request for a presidential disaster declaration, the office of Gov. Kristi Noem announced Saturday. yankton.net", "2019-06-08T16:07:00.000Z": "It's been a tough few years for folks in agriculture, and sometimes the burden is a lot to bear. If you need to talk with someone, help is available. Consider calling the Farmer Stress Hotline at 800-691-4336. Noem urges farmers to consider calling stress hotline Gov. Kristi Noem has taken to the airwaves to remind farmers of a free stress hotline available to help them cope with what she calls historically tough times. siouxfalls.business", "2019-06-07T21:44:00.000Z": "Today is National Doughnut Day! What's your go-to doughnut shop in South Dakota? Where can you find a good doughnut? South Dakota retailers and sheriffs have a few suggestions Turns out, there are 400 doughnut retailers in South Dakota. That's one per 2,206 of the state's residents. argusleader.com", "2019-06-07T16:21:18.000Z": "Happy birthday, @mike_pence ! I'm incredibly grateful for your leadership and encouragement over the years. Hope to see you back in South Dakota soon!!", "2019-06-06T20:13:35.000Z": "Today we honor the courage, sacrifice, and bravery of the heroes who stormed Normandy Beach 75 years ago. They changed the course of history.", "2019-06-04T20:13:56.000Z": "I love South Dakota, but what I love even more is seeing or hearing about other people falling in love with South Dakota too. Even with our tough winters there is just so much to appreciate about our state. Letter: We love South Dakota I severely underestimated what \"the frozen tundra\" meant. aberdeennews.com", "2019-06-01T01:25:22.000Z": "The next generation will not thrive if they don't have a home... a family to love them. On this Foster Family Appreciation Day, I want to say thank you to the families who are impacting the next generation through foster care. #ThanksFosterFamilies", "2019-05-31T14:14:45.000Z": "Girls State is a wonderful opportunity for young women in South Dakota to get together to learn how to be advocates for themselves and their communities. It was a pleasure to meet with these incredible young leaders. https:// bit.ly/2WB9IOG", "2019-05-29T14:15:25.000Z": "Early on I made a commitment to expand broadband access to rural areas. I'm glad we're setting that plan in motion. Noem office announces broadband grants On Tuesday South Dakota Gov. Kristi Noem's office announced which companies have received grants to help bring broadband to areas less connected. keloland.com", "2019-05-28T16:04:00.000Z": "HUGE congratulations to @AugieSoftball on claiming the Division II National Championship! Incredibly proud of the hard work and dedication that went into this victory. Way to represent South Dakota!! NATIONAL CHAMPS: Augustana Vikings win Division II softball title Vikings overcome 4-0 deficit in championship game argusleader.com", "2019-05-24T16:23:37.000Z": "This years blizzards and floods caused tremendous damage to public and private property across the state. I have asked for a presidential disaster declaration for our state and an allocation of FEMA resources to help our communities to rebuild. https:// bit.ly/2Qi0QrH", "2019-05-17T18:26:18.000Z": "100 years of South Dakota state parks this year! Celebrate with us and take advantage of this weekends Open House and Free Fishing Weekend. Check out all there is do to and see some of our beautiful parks. South Dakota Game, Fish and Parks Department offers free park entrance and free fishing statewide -... PIERRE, S.D. - With this year marking 100 years of state parks in South Dakota, the Department of Game, Fish and Parks (GFP) is kicking off the summer celebration this weekend with freebies and... newscenter1.tv", "2019-05-16T21:34:19.000Z": "South Dakota's high school baseball bracket is here! Do you follow along as they play for the championship? 2019 South Dakota High School Baseball Tournament Brackets The playoffs have arrived for South Dakota high school baseball and multiple Sioux Falls area teams have a chance to play for a title. espn991.com", "2019-05-15T00:10:02.000Z": "While FEMA officials assesses the damage across South Dakota I am hopeful we'll be able to get the assistance necessary for the many South Dakotans impacted by the extreme weather of the past couple months. Click here & get an update on where we are: Federal Funding Depends on FEMA Reports | Radio 570 WNAX Officials with the Federal Emergency Management Agency have fanned out across South Dakota, totaling up the damage to public infrastructure from March storms and flooding. wnax.com", "2019-05-12T15:05:07.000Z": "I am so blessed to be called mom by these guys and can't wait to celebrate with them today! Wishing all our South Dakota moms the best and a very Happy Mother's Day.", "2019-05-08T13:45:37.000Z": "Teachers empower kids to succeed. They're on the front lines of raising up the next generation of leaders. Take some time to thank a teacher today! #TeachersAppreciationWeek", "2019-05-07T19:18:35.000Z": "Thrilled to be bringing Fourth of July fireworks back to Mount Rushmore in 2020! Thanks to President Trump and Secretary Bernhardt for helping us get this done!! 4th of July fireworks could return to Mount Rushmore Fireworks were doused after the 2009 holiday because of wildfire concerns. Now, the sparks may be making a comeback. blackhillsfox.com", "2019-05-06T15:22:15.000Z": "The timing of my pheasant habitat initiative couldn't be better. Following the harsh weather this winter investing in habitat is coming at an important time. https:// bit.ly/2J39V74", "2019-05-02T21:48:21.000Z": "On this National Day of Prayer, please join me in praying for the future of our state and nation.", "2019-04-26T13:59:43.000Z": "The dairy industry is a big part of South Dakota's ag economy, so it's great to see production numbers going up. https:// bit.ly/2IH8sTC", "2019-04-23T18:10:36.000Z": "Congratulations to Johnson Farms of Frankfort on receiving the SD Leopold Conservation Award! The innovation, stewardship, and land ethic of the Johnsons and other producers ensures that our natural resources will be available for future generations. Johnson Farms in Frankfort receives state award Frankfort farm receives award for conservation plainsman.com", "2019-04-22T13:43:17.000Z": "It was an honor to recognize the achievements of our veterans and ROTC cadets at South Dakota State University. Incredibly proud of these outstanding young men and women. Twenty-one cadets honored at 2019 Governor's Day BROOKINGS - South Dakota Gov. Kristi Noem visited the South Dakota State University campus Monday to honor all veterans and recognize the achievements of the U.S. Army and U.S. Air Force ROTC cadets... brookingsregister.com", "2019-04-21T13:21:00.000Z": "Death could not hold him... Jesus is alive! Happy Easter from my family to yours.", "2019-04-20T20:49:00.000Z": "\"If my people who are called by my name will humble themselves and pray and seek my face, then I will turn from Heaven, forgive their sins, and heal their land.\" -2 Chronicles 7:14 Governor Noem attends Faith & Hope Community Breakfast - KNBN NewsCenter1 Business and community leaders gathered at the Faith & Hope Community Breakfast at the Rushmore Plaza Civic Center RAPID CITY, S.D. - The Faith & Hope Community Breakfast took place at the Rushmore... newscenter1.tv", "2019-04-19T18:37:00.000Z": "\"For He was pierced for our transgressions. He was crushed for our iniquities. The punishment that brought us peace was upon him, and by His wounds we are healed.\" -Isaiah 53:5", "2019-04-17T19:26:00.000Z": "I'm proud of the progress made in my first 100 days in office, but there's more work to be done. I'll continue working hard to focus on the needs facing our state and the ways we can best prepare for our future. Governor Noem talks about her first 100 days in office Tuesday marked South Dakota Republican Gov. Kristi Noem's 100th day in office. ksfy.com", "2019-04-15T21:11:15.000Z": "Our state and ag community are facing incredible challenges due to the extreme weather this year. If you have been impacted, please continue documenting new and ongoing damages. South Dakota Disaster Declaration Still Open | Radio 570 WNAX Damages from last weeks blizzard can now be added to last month's flooding. wnax.com", "2019-04-13T02:49:29.000Z": "The folks in Pennington County have always felt like family to me. So glad I could join them tonight for their Lincoln Day Dinner.", "2019-04-12T17:03:58.000Z": "I-90 and I-29 are fully open. https:// news.sd.gov/newsitem.aspx? id=24371  Motorists are cautioned to very icy, snow-packed road conditions with continued wind & blowing snow. Reduce speed,  buckle up & allow plenty of time. #sdwx", "2019-04-11T22:35:42.000Z": "It has been a tough weather-day in SD and it continues at least another day. Don't risk your life or others by trying to get anywhere. Stay home. Check in on elderly neighbors, pets and livestock. Let's help each other get through this storm! #keepSDsafe  #SDwx", "2019-04-11T15:04:03.000Z": "This snowstorm needs to be taken seriously. Please stay off the roads and stay safe. https:// bit.ly/2IbFD1l", "2019-04-11T12:16:55.000Z": "This is a challenging weather day in South Dakota. The best advice -- STAY HOME! Majority of both interstates are closed and many No Travel Advisories posted. Dangerous conditions out there. Check on elderly neighbors. Protect pets and livestock. #keepSDsafe  #SDwx", "2019-04-11T02:11:03.000Z": "Gov. Kristi Noem has closed the same offices that were closed Wednesday. Governor closes state offices in 54 counties due to blizzard Only essential personnel at state offices in 54 counties are reporting to their work stations, according to the Department of Public Safety. argusleader.com", "2019-04-10T17:00:04.000Z": "It's great to see families getting into this! Colman dad bonds with son through Nest Predator Bounty Program Trapping nest predators has historically been used as a management technique to help conserve and sustain the outdoors in South Dakota. dakotanewsnow.com", "2019-04-10T15:33:50.000Z": "Many roads in SD already look like this today. Ask yourself - \"Do I REALLY need to be out in this?\" Stay home. If you MUST travel, pack a winter safety kit. Let someone know your route. If stranded stay with vehicle. #keepSDsafe  #SDwx ( @SDHighwayPatrol file photo)", "2019-04-10T16:00:07.000Z": "I want to send a quick thanks to the plow drivers and emergency responders who are working to keep our roads and people safe during this winter storm. Please make their jobs easier by staying inside!", "2019-04-09T21:20:07.000Z": "It feels like spring today, but more winter storms are headed our way. Start preparing now to make sure you have the supplies you need to stay safe. What to know for this week's winter storm in Sioux Falls, surrounding areas As South Dakota prepares for a potentially heavy bout of snow later this week, here are some things you should know. argusleader.com", "2019-04-06T23:22:07.000Z": "Ellsworth will soon be home to the newest, most powerful bomber in the U.S. Air Force: the B-21 Raider bomber. Ballroom bursts with B-21 pride during celebration of Ellsworth's new mission The ballroom of the historic Hotel Alex Johnson in Rapid City was filled with a sense of South Dakota exceptionalism Friday as state and community leaders formally celebrated Ellsworth Air rapidcityjournal.com", "2019-04-06T03:02:54.000Z": "Prom 2019! Booker and McKenna...", "2019-04-03T15:21:52.000Z": "By investing in habitat preservation & expansion, we preserve our traditions & ensure pheasant hunting lasts for years to come. Gov. Kristi Noem signs pheasant habitat fund legislation into law The fund, formally called the \"Second Century Habitat Initiative,\" allocates $1 million in state money to preserve and expand South Dakota's pheasant habitat. argusleader.com", "2019-03-30T14:52:10.000Z": "Mostly dry in SD today, but flooding continues in some areas. If driving through flooded areas, check roads at @SouthDakotaDOT 's 511 or https:// safetravelusa.com/sd/ . If you have questions about flood cleanup, check @SDPublicSafety 's http:// SDResponse.Gov website. #keepSDsafe  #SDwx", "2019-03-30T05:44:45.000Z": "Incredibly proud of SDSU's @gojackswbb . You played well, and you made history. Quote Tweet Jackrabbit WBB @GoJacksWBB Final from Portland, the Jacks fall to Oregon in the Sweet 16. #Jackpot  #GoJacks  #UnleashChaos", "2019-03-30T04:48:24.000Z": "Miss part of the game? Get live updates here >> http:// argusleader.com/story/sports/2 019/03/26/ncaa-how-watch-south-dakota-state-oregon-ducks-womens-basketball/3281259002/   #GoJacks  #Sweet16 NCAA Tournament: Live updates, how to watch South Dakota State vs. Oregon Ducks women's basketball What you need to know to watch South Dakota State Jackrabbits vs. Oregon Ducks women's basketball in the 2019 NCAA Tournament. argusleader.com", "2019-03-29T16:03:44.000Z": "Too many of our heroes didn't get the welcome home they deserved. On this Vietnam War Veterans Day, we recognize their service and thank them for their sacrifice. #thankaveteran", "2019-03-28T23:27:00.000Z": "Nursing home closures affect real people: our parents, our grandparents. After dozens of conversations with folks earlier in the year, I knew this crisis required action. Read more here. NOEM: Addressing the nursing home crisis Mobridge. Madison. Tripp. Rapid City. Bryant. Rosholt. Huron. Watertown. The common thread between these communities? Nursing home closures. In all, 19 nursing home facilities around our state have... rapidcityjournal.com", "2019-03-28T19:30:23.000Z": "Floods can impact agricultural producers. Questions? Check this link at the @SDPublicSafety 's http:// SDResponse.Gov website.  Information is from the South Dakota Department of Agriculture. @SDAgriculture . #keepSDSafe ( @SDHighwayPatrol File Photo)", "2019-03-27T21:05:37.000Z": "Mission after mission, America has turned to Ellsworth Air Force Base, and the brave men and women serving there have delivered. Today, the @usairforce announced that @28thBombWing would be the first home for the new B-21 bomber. Ellsworth chosen as training base, first to receive B-21 nuclear bombers Ellsworth Air Force Base will be a training center and first site to receive the new B-21 bomber, which will be capable of launching thermonuclear weapons. rapidcityjournal.com", "2019-03-27T18:13:17.000Z": "Many will be re-entering houses impacted by flood waters in the coming days. When doing so, heed these clean-up warnings to ensure you and your family stay safe and healthy. #keepSDsafe", "2019-03-27T20:25:00.000Z": "Last week, Trevor Tridle of Lead won a gold medal in power lifting at the Special Olympics World Championship in Abu Dhabi. Congrats, Trevor! We're very proud of you. Rapid City welcomes home Special Olympics gold medalist - KNBN NewsCenter1 RAPID CITY, S.D. - Cheers and signs welcomed Trevor Tridle of Lead, SD home from the Special Olympics World Championships in Abu Dhabi Saturday afternoon. Tridle came back home with four medals in... newscenter1.tv", "2019-03-27T16:57:00.000Z": "More than 20% of military spouses cite state licensing regulations as one of their greatest challenges. The bill I signed last week changes that reality for SD's military families, fast-tracking military spouses through the licensing process. Military families to get quicker reciprocity for licenses & certifications Military families, mostly spouses, have had trials of time, costs and effort in re-starting work once their families are transferred to South Dakota. A new law aims to ease that capjournal.com", "2019-03-26T15:45:38.000Z": "Congratulations to the incredible @GoJacksWBB for making it to the #Sweet16 ! I know all of South Dakota is so proud, and will be cheering you onto victory! 'This is what history looks like': Twitter reacts to South Dakota State's Sweet 16 berth Twitter came out to support the Jackrabbits on its first Sweet 16 appearance argusleader.com", "2019-03-26T12:29:42.000Z": "Good morning! There are still many flooded roads in Minnehaha County; mind the Road Closed signs and drive carefully (254th St, courtesy of Res. Off. Klebanoff)", "2019-03-26T02:44:02.000Z": "Any other proud alumni out there tonight?? Incredibly excited to see @GoJacksWBB make history tonight as the first South Dakota team to advance to the Sweet 16!! GO JACKS!!  https:// keloland.com/sports/live-bl og-at-6-pm-wbk-jackrabbits-look-to-earn-sweet-16-spot/1875432255?utm_medium=social&utm_source=facebook_KELOLAND_News&fbclid=IwAR0m6mjzoZ4yw3SazgSBmuGU-qvKJxjyDmiNBndtMdmdg9VeqhXaTefViMg ", "2019-03-26T01:04:04.000Z": "#GoJacks !! Quote Tweet Jackrabbit WBB @GoJacksWBB JACKS WIN! South Dakota State advances to the Sweet 16 with a 75-64 win over Syracuse! #Jackpot  #GoJacks  #UnleashChaos", "2019-03-26T00:36:42.000Z": "Cheering on @GoJacksWBB tonight as they compete for a spot in the Sweet 16. Go Jacks!!", "2019-03-25T20:32:35.000Z": "South Dakotans deserve to know where their tax dollars are being spent. The bill I signed last week holds the government accountable by preventing secret lawsuit agreements. If tax dollars are used in a settlement, tax payers deserve to see a receipt. Gov. Noem signs law banning secretive government practice Governments will no longer be allowed to hide agreements argusleader.com", "2019-03-22T16:57:15.000Z": "While our work isn't done until abortion is eliminated completely, the two bills I signed into law on Wednesday are an important step forward for life. https:// goo.gl/RTsZ8H  #prolife", "2019-03-21T15:59:00.000Z": "This is especially important if you live in the southeast part of our state. Check here to see if you live in a flood plain>> https:// msc.fema.gov/portal/search# searchresultsanchor ", "2019-03-21T00:14:00.000Z": "We all have a part to play in storm recovery and flood preparations. If you live in Sioux Falls, this is a great opportunity to help your community. https:// keloland.com/news/local-new s/neighbors-helping-neighbors-at-sioux-falls-sandbagging-site/1863623679 ", "2019-03-20T14:43:47.000Z": "As flooding continues, and increases over the next week, some roads will be impacted.  We just want to remind you to respect the barricade, it's there for a reason.", "2019-03-19T19:26:00.000Z": "If you know me, you know I LOVE Culver's. Today, Culver's is partnering with Midwest Honor Flight to raise money that will send veterans to visit their memorials in DC. Such a great program. Go buy a ButterBurger (or two) and support our veterans!! http:// keloland.com/news/local-new s/culver-s-donating-portion-of-tuesday-s-sales-to-midwest-honor-flight/1851393982?fbclid=IwAR2JiYVLQD4QcYw2WzvTNMq-8S3ewSySt5ffLsoopSWj22XAfXEXqWhZ15M ", "2019-03-19T13:45:30.000Z": "Flooding is not a matter of if, but when. If you live in the Big Sioux Valley, begin preparing for flooding now. https:// kdlt.com/2019/03/18/noe m-encourages-residents-of-big-sioux-river-valley-to-prepare-for-flooding/ ", "2019-03-18T14:45:00.000Z": "Did you know 20% of flood insurance claims come from outside the high-risk flood zone? Just because you aren't in a high-risk area doesn't mean you won't be affected!\n\nAdd flood coverage to your insurance today regardless of risk - it takes 30 days to go into effect. #keepSDsafe", "2019-03-18T19:55:37.000Z": "I was very glad I had the opportunity to visit with Rapid City law enforcement officials on Saturday to thank them for their tireless help and work in the aftermath of this past week's winter storm. Appreciate everything they've done for their community. Governor Kristi Noem recognizes Rapid City law enforcement for help in winter storm Governor Kristi Noem visited Rapid City on Saturday to thank law enforcement for their role in Wednesday's winter storm. kotatv.com", "2019-03-18T02:54:46.000Z": "I was back in the SE corner of the state today. Scare overnight in the Dunes but efforts are working.", "2019-03-18T00:17:58.000Z": "Happy St. Patrick's Day!! Be safe, and have fun!", "2019-03-16T12:43:54.000Z": "There are still road closures in the southeast due to flooding. There are still some No Travel Advisories on roads in central parts of the state & SD1806 S of US83 is still impassable. Winds & light snow overnight caused additional drifting.  Check http:// safetravelusa.com/sd  #sdwx", "2019-03-15T20:30:02.000Z": "If you lost livestock during the storm this week, you may be eligible for some federal assistance through the Livestock Indemnity Program (LIP). Learn more here>> http:// fsa.usda.gov/Assets/USDA-FS A-Public/usdafiles/FactSheets/2018/livestock_indemnity_program_fact_sheet_dec_2018.pdf ", "2019-03-15T19:45:00.000Z": "With the potential for flooding from snowmelt this spring, keep in mind these flood safety tips to keep you and your family safe. #keepSDsafe", "2019-03-15T14:11:21.000Z": "The @SouthDakotaDOT is out working hard to get the roads back open.  Please give them space and be patient.  They are doing a great job and working as fast as they can.  Thank a DOT worker when you have a chance. #keepSDsafe", "2019-03-15T15:05:04.000Z": "Thankful for the men and women at @minnehahaem and @SiouxFallsFire who rescued 17 people from flooding in western and southern Sioux Falls. Amazing to see the selflessness that's been displayed during this weather. Be safe out there everyone! Crews rescue multiple people from flooding in western, southern Sioux Falls About a dozen people were evacuated from their homes in western Sioux Falls after flooding took over roads across the county Thursday. argusleader.com", "2019-03-15T13:49:30.000Z": "It's South Dakota National Guard R.E.D. Day! Remembering Everyone Deployed and wearing my T-shirt all day in honor of those who serve. @sdnationalguard", "2019-03-15T12:10:12.000Z": "The http:// safetravelusa.com/sd map has been updated & there are still many roads marked as impassable/closed. Please be patient & stay off these roads, we know everyone is anxious to get moving.  Thank you. #sdwx", "2019-03-14T20:25:01.000Z": "The National Weather Service not only provides some of the forecasting information that we all rely on, but they also have good safety resources for winter weather. Take a look. https:// weather.gov/safety/winter", "2019-03-14T18:14:58.000Z": "My family has been farming and ranching for many years. It's hard work, especially during weather like this. I hope you'll join me today in thanking the men & women working in our ag industry. Their efforts keep the U.S. fed & clothed. We are so thankful! #NationalAgDay", "2019-03-14T17:53:40.000Z": "In a storm like this, there are always unsung heroes. The folks who are answering phones for first responders. Those who are working at nursing homes and other medical facilities who must care for others 24/7, even on \"snow days.\" Thanks to you and your families for all you do.", "2019-03-14T14:22:56.000Z": "Reminder- don't drive around Road Closed barriers or through flooded roads. It endangers you, your passengers, your vehicle, and all the first responders.  Please retweet.", "2019-03-14T13:41:33.000Z": "My Lt. Gov made me this branding iron which is a great connection to the ag roots that both of us have and carry with us in every decision we make for South Dakota - including the decision to veto a bill if it's not the right thing for our state. Lt. Gov. Rhoden crafts veto branding iron for Gov. Noem Lt. Gov. Larry Rhoden crafted the veto branding iron that Gov. Kristi Noem wielded in a recent video, according to Noem's office. rapidcityjournal.com", "2019-03-14T12:01:47.000Z": "Winds will be a major factor today as we go through this storm. Stay home if you can. All state offices will be closed today.", "2019-03-14T01:42:52.000Z": "These keys to driving in fog apply to the heavy rain & flooding we've seen today. If you're out tonight, keep these keys in mind. Check travel conditions/road closures before you go. The combination of fog & darkness is making water on roadways difficult to see, so slow down!", "2019-03-13T13:42:54.000Z": "A big storm is headed our way. Stay warm and safe. Surviving blizzards starts with preparation A major blizzard will blast through South Dakota and Wyoming Wednesday afternoon through at least Thursday morning. blackhillsfox.com", "2019-03-10T14:22:28.000Z": "Thank you everyone for helping each other out to get thru this weather we have been having. @SDHighwayPatrol  @SouthDakotaDOT cities, counties, and local officials all worked together to keep people safe. Proud of you all", "2019-03-08T18:39:47.000Z": "That's one way to cope with the snow! Anyone else ready to pack away the winter weather gear in exchange for Spring? https:// goo.gl/fyzqwc", "2019-03-05T22:09:00.000Z": "This is great! Love what Groton students are doing to get younger students interested in agriculture. Groton FFA students buddy up with kindergarteners Groton Area School kindergarteners have some new buddies. aberdeennews.com", "2019-03-01T22:49:59.000Z": "My priorities for South Dakota are centered around the belief that everything that we do should be focused on how it impacts the next generation. Governor addresses goals for her administration on statewide tour For all of the goals for her fledgling administration, Gov. Kristi Noem said her primary focus remains on future generations of South Dakotans. rapidcityjournal.com", "2019-02-26T17:43:00.000Z": "Thrilled to see Lake Area Tech expanding apprenticeship programs. Hands-on work experience is the best way for young people to discover new talents and choose a career path. LATI working to increase apprenticeship programs When South Dakota Gov. Kristi Noem outlined her administration's priorities over a week ago at Lake Area Technical Institute in Watertown, she spoke of a desire to increase opportunities for thepublicopinion.com", "2019-02-26T00:42:14.000Z": "It's never okay to mock a group of people. The middle of America is the heart and soul of our country. We feed the world. We serve our nation. I'd like to invite Mr. Maher to come and experience SD. The kindness of our people and quality of life we enjoy is second to none.", "2019-02-25T19:52:01.000Z": "Taxpayers should never be forced to fund abortions. As I continue cracking down on abortion providers in SD, I'm thankful for @realDonaldTrump 's work to defund providers like Planned Parenthood at the national level. This is a step in the right direction. Every life has dignity.", "2019-02-21T22:57:30.000Z": "Once again, South Dakota is leading the nation!! Our state parks are second to none. Which is your favorite to visit? 10 State Parks That Give National Parks a Run for Their Money | Budget Travel With jaw-dropping natural beauty, reasonable entry fees, and convenient locations, these state parks belong on your must-see US parks list. budgettravel.com", "2019-02-20T15:57:09.000Z": "The Hughes County Lincoln Day Dinner was a success last night! Live cake auction... desserts with President Trump's picture... and the Star Spangled Banner by Rep. Finck!!", "2019-02-18T21:45:10.000Z": "Today, we recognize the leaders who've devoted themselves to serving our nation and advancing liberty. Happy #PresidentsDay !", "2019-02-15T22:54:29.000Z": "Empowering families means supporting each family's decisions for education. This legislation levels the playing field for all South Dakota students by removing an unnecessary scholarship barrier imposed on homeschool families. Noem approves legislation to level scholarship playing field for homeschool students - KNBN... PIERRE, S.D. - Gov. Kristi Noem signed a bill on Wednesday that makes homeschool students eligible on an equal basis for the South Dakota Opportunity Scholarship. The scholarship provides up to... newscenter1.tv", "2019-02-12T21:30:00.000Z": "Happy 210th birthday to one of the greatest servants our country has ever seen. Thankful for President Lincoln's courage to fight injustice and his legacy of honesty. May his leadership be an inspiration to us all.", "2019-02-11T23:09:15.000Z": "Please continue praying for Serenity Dennard and her family. Serenity is nine years old and was last seen on February 3 in Pennington County. If you have information or have heard from Serenity, please call 605.394.6115. Weekend search for missing girl in Black Hills unsuccessful Efforts to recover a missing 9-year-old in western South Dakota have continued to be unfruitful, despite searches that lasted all weekend. argusleader.com", "2019-02-11T18:48:02.000Z": "Ag is a way of life, for many, it's their livelihood. All in all, it contributes about $25.6B to the economy; when ag prospers, SD prospers. I'm all too familiar with how tough a business it can be, that's why doing right by the industry is so important. Kristi Noem column: What's good for ag is good for S.D. Agriculture is the foundation of South Dakota's economy and our number one industry - by a significant margin. All in all, it contributes about $25.6 billion to the economy, so thepublicopinion.com", "2019-02-10T21:43:51.000Z": "Congrats to @danlederman for his successful re-election as Chairman of the @sdgop . Look forward to working together to strengthen our party and our state.", "2019-02-07T19:15:30.000Z": "Our economy and security are reliant on an energy supply that is accessible, abundant, and affordable. This bill takes a step toward expanding the potential of South Dakota wind and solar energy. I was proud to sign it into law this week. Gov. Kristi Noem signs legislation to expand South Dakota wind and solar energy potential - KNBN... PIERRE, S.D. - Gov. Kristi Noem has signed legislation that would streamline solar and wind development on state-owned lands. House Bill 1031 would allow the Office of School and Public Lands to... newscenter1.tv", "2019-02-05T21:18:54.000Z": "These kids sure know how to make a guy feel special on his birthday!", "2019-02-02T21:25:00.000Z": "Take a look! Inside the USS South Dakota, there are pictures of Sioux Falls, the Badlands, pheasants, and Mount Rushmore. To all the men and women who will serve onboard, consider this your official invitation to South Dakota! See inside state's new namesake ship: USS South Dakota submarine The vessel includes South Dakota views, state license plate, Deadwood bar stickers, 'Wild Bill's Bistro' argusleader.com", "2019-02-02T15:13:19.000Z": "South Dakota has a proud history of military service, so it's pretty special that the Navy's newest attack submarine holds our name. The USS South Dakota will be commissioned today at 10am CT/9am MT. You can watch the live commissioning here! USS South Dakota (SSN 790) Commissioning - Navy Live The newest Virginia-class attack submarine, USS South Dakota (SSN 790), will be commissioned at Grot navylive.dodlive.mil", "2019-01-30T22:23:16.000Z": "Proud of the work these community leaders are doing to make Yankton a stronger place for the next generation. Great meeting with them on Yankton Day! https:// goo.gl/TsMLKX", "2019-01-25T21:49:59.000Z": "Exactly what I'm going for! Education in South Dakota means a lot to me, and I'm honored by all the kind words of support from these exceptional educators. Teachers Give Noem Education Spending Plan High Grades South Dakota school districts are encouraged by Governor Kristi Noem's plans for education spending in 2020. keloland.com", "2019-01-23T18:59:00.000Z": "Live coverage of @govkristinoem budget address begins now on SDPB. https:// sdpbne.ws/2FyD0Wh", "2019-01-23T16:29:20.000Z": "Today's the day - let's talk budget! Noem committed to fiscal responsibility in first budget address as governor Gov. Kristi Noem proposed spending state revenue on nursing homes, education and fighting the meth epidemic argusleader.com", "2019-01-21T17:31:16.000Z": "Today we remember the life and legacy of Martin Luther King Jr. - a truly incredible leader. May we always remember to treat others with dignity and kindness. #MLKDay", "2019-01-16T20:01:53.000Z": "Last Christmas, 192 kids in South Dakota were in foster care waiting for families to adopt them. Grateful for foster families like the Hendricksons. Check out their story here. Sharing journey of adoption Huron couple adopts four children plainsman.com", "2019-01-12T17:02:01.000Z": "First, we were just colleagues in the House - working on farm policy, fighting for lower taxes, and working to reform the IHS. Now they've become like family. So grateful Jason, Kevin, Markywayne & Christie could be at my inauguration last weekend. Thankful for their friendship.", "2019-01-11T23:21:41.000Z": "A while ago, I promised the Venhuizen kiddos some cotton candy from the Governor's Mansion. They held me to my word! Aren't they just the cutest?!", "2019-01-11T17:53:12.000Z": "", "2019-01-10T22:25:01.000Z": "Meth destroys people. It's ravaging our communities and families. But meth is rarely made in South Dakota anymore. The vast majority is coming from Mexico. Our meth epidemic is the price we are paying for our nation's failure to adequately secure our southern border.", "2019-01-09T23:10:16.000Z": "The sign is up, so now it's official!! Proud to live in such an incredible community.", "2019-01-09T18:39:28.000Z": "It was an honor to deliver my first State of the State address as governor. We've got a lot of work ahead of us on education, expanding broadband access, and keeping South Dakota on the path for success - but I know we can do it. https:// goo.gl/ap3Zry", "2019-01-07T18:43:26.000Z": "Incredibly grateful for the men and women of the South Dakota National Guard, Highway Patrol, and Pierre Police Department who tirelessly served this weekend to ensure a safe and peaceful leadership transition.", "2019-01-06T05:27:01.000Z": "Today, I placed my hand on my dad's Bible and once again made a promise to serve South Dakota... this time as your governor.", "2019-01-05T14:54:21.000Z": "This is the Bible my dad carried in his pocket when he fought in World War II. On the front, it says \"May the Lord be with you.\" As I take the Oath of Office on his Bible today, that's my prayer too. May the Lord be with us in everything that comes our way.", "2019-01-04T14:18:09.000Z": "I learned the value of hard work on my family's ranch in Hamlin County... Not all that different an upbringing from many South Dakotans. That shared determination is a big part of why I love SD so much. I'm ready to get to work! OURS: Celebrating Noem's earned achievement Kristi Noem will take the oath of office at noon Saturday to become South Dakota's 33rd governor. rapidcityjournal.com", "2019-01-03T01:13:02.000Z": "Started moving into the governor's house today! Thanks to everyone who helped!! \n\nI know I've said it before, but it's worth saying again... I really love South Dakota, and I'm so grateful for this opportunity to serve.", "2019-01-01T19:18:56.000Z": "Happy New Year! May this year be filled with opportunities and memories with the ones you love most. The best is still to come!", "2018-12-27T23:03:05.000Z": "Well I thought @DougBurgum forgot...but yesterday this Bison jersey came in the mail and I keep my promises...but I did take a little freedom with my \"accessories\". Tough loss a few weeks ago to NDSU but I'll always be a Jacks fan! #SDSU  #gojacks", "2018-12-21T01:14:00.000Z": "It's the most wonderful time of the year! http:// argusleader.com/picture-galler y/news/2018/12/20/photos-christmas-capitol/2376827002/  3 Attachments Photos: Christmas at the capitol Christmas at the state capitol Wednesday, Dec. 13, at the South Dakota State Capitol in Pierre. argusleader.com", "2018-12-20T23:01:17.000Z": "This afternoon, President Trump signed the #FarmBill into law. Grateful to be part of creating legislation that brings more stability to our South Dakota farmers and ranchers.", "2018-12-19T21:55:00.000Z": "Last week, I was proud to help lead the House in sending the #FarmBill to the president's desk. This legislation provides a safety net so SD farmers and ranchers can do what they do best: feed the world. The farm bill: Protecting America's food supply Between a drought, poor prices, hail, and diminished net farm incomes, South Dakota's agriculture economy has taken a significant hit in recent years. brookingsregister.com", "2018-12-19T02:34:19.000Z": "Took a few minutes this afternoon to climb to the top of the Capitol dome for the first time. What a neat experience! Grateful to live in such a beautiful state with such incredible people. https:// facebook.com/308353252483/posts/10155708847527484/ ", "2018-12-19T01:15:00.000Z": "On Saturday, I was honored to attend the activation ceremony for 114 South Dakota men and women who have answered the call to defend freedom. Please keep these folks and their families in your prayers as they serve in Europe for the next 10 months. 'It's Pretty Impressive' Shane Wieseler has been through this before. yankton.net", "2018-12-18T21:39:54.000Z": "BREAKING>>Greg Whitlock will be joining my administration as the Secretary for Veterans Affairs. \n \nGreg is a proven champion for veterans. I'm grateful to have him on my team, and I look forward to the ways we will work together to prioritize SD's bravest men and women.", "2018-12-18T03:18:43.000Z": "https:// twitter.com/brody2210/stat us/1074848280012558336?s=21  She gets it from her Aunt Kristi . Nice job Chlo Jo! Sure do love you. (Notice Booker watching over her shoulder ) Quote Tweet Brody Grantham @Brody2210 Dang my sister is way more talented than me", "2018-12-18T00:34:00.000Z": "This might be the cutest commercial I've seen in a while. Love the way our Highway Patrol officers get creative in order to spread messages that keep our families safe. Check this out! Watch: South Dakota Highway Patrol K-9s 'sing' for holiday commercial You haven't heard \"We Wish You A Merry Christmas\" like this before. argusleader.com", "2018-12-17T17:43:00.000Z": "No surprise here! #BestState Forbes rates South Dakota as top place to visit in 2019 The Mount Rushmore State was one of 14 places across the country recommended by travel experts and influencers. argusleader.com", "2018-12-17T14:37:03.000Z": "A couple of wonderful young ladies ringing the bells for the Salvation Army in HyVee in Yankton this weekend!! So happy to see them volunteering for such a great ministry.", "2018-12-15T22:23:00.000Z": "Earlier this year, I toured Teen Challenge in Brookings to learn about their work to transform the lives of people struggling with drug addictions.\n\nIf you're combatting addiction, I encourage you to get in touch with a program like Teen Challenge today. http:// goo.gl/YwEiJv", "2018-12-15T20:44:00.000Z": "Meet Liza Clark, who'll serve as Chief Financial Officer. She said:\n\n\"Developing a budget should be common sense - don't spend what you don't have. I'm excited to work with Gov-elect Noem to make sure every tax dollar is used responsibly to create a stronger SD.\" #MeetTheCabinet", "2018-12-15T17:20:00.000Z": "Earlier this week, I was proud to help lead the U.S. House of Representatives in passing the 2018 Farm Bill. This is a significant step toward securing a safety net, not only for South Dakota producers, but for America's food supply. https:// kelo.com/news/articles/ 2018/dec/12/new-farm-bill-headed-to-trump/ ", "2018-12-14T23:24:00.000Z": "The bet is on again! Can't wait to see North Dakota Gov. Burgum wear an SDSU jersey after the Jacks WIN tonight! #GoJacks", "2018-12-14T21:48:05.000Z": "There's no place in the world like South Dakota, and Jim Hagen is just the person to take tourism, our second largest industry, to new heights. I'm grateful to have him on my team as the Secretary of Tourism. #MeetTheCabinet", "2018-12-13T19:17:46.000Z": "The #FarmBill is on its way to the President's desk! https:// facebook.com/kristiforgovernor/videos/770350729975012/?xts[0]=68.ARAZiFkh9Fh6dOc4y1Y6Zh4RXfnX4Dg5WfbyQhLf_hv3c5fi34vXOT2iSki6eUW4vpznRVlMzA6PWQbO1_NsX93bzGxfiJqptaSAm4V3vARTMo-Bic4ZktiKe-CavY5Bb3bbHv6XzaTghAyTHNhNaEqstxnEZoAJdzTpFJ-C9nTFGNCUROZg_JOABbJjPg9XIvTJz8xbJES-mDiC1Z2jAyld-Z5vYlHcaS5_YD54IFNkiArb6B33F6l-ZSyD7BgQw2lxzgqBhlAQgQraSmS-gM5xXMJo3GqkHTZ6JhaQLqikIStFAHx_LrvbDTzGyTmY16-Nxq_hOaH1ASldzR8J5BSNo&tn=-R ", "2018-12-13T15:49:22.000Z": "I stand firmly behind the dedicated work of our law enforcement officers, and I look forward to partnering with Colonel Craig Price, Secretary of Public Safety, as we work to create a safer South Dakota. #MeetTheCabinet", "2018-12-11T23:11:08.000Z": "The historic tax cuts we passed last year gave many families the financial margin they needed, but my work to kickstart the economy has just begun. Read more here. Noem: Continuing to build a stronger economy Noem: Things have gotten better, families have gotten stronger, and the best days are still to come. argusleader.com", "2018-12-07T23:57:00.000Z": "In South Dakota, 1 in 10 jobs are in manufacturing & agriculture is the #1 industry in our state. Smithfield's latest investment bolsters these two key industries, and will have a far-reaching, positive economic impact across the entire state. Sioux Falls' Smithfield plant will add 70 jobs, get $45 million expansion as bacon market sizzles Smithfield Foods will invest $45 million in its Sioux Falls operations, according to a Thursday announcement from the company. argusleader.com", "2018-12-07T22:24:11.000Z": "As we commemorate the anniversary of the attack on Pearl Harbor today, remember to thank the men and women of our military who sacrifice daily to ensure we have the opportunity to raise our families in freedom. https:// kdlt.com/2018/03/31/rec ently-identified-pearl-harbor-sailor-honored/https://www.kdlt.com/2018/03/31/recently-identified-pearl-harbor-sailor-honored/ ", "2018-12-04T23:05:03.000Z": "Light always breaks through darkness. Happy Hanukkah.", "2018-12-01T14:16:53.000Z": "George H.W. Bush was a true man of service. As a war veteran & the leader of our country, President Bush launched a legacy of patriotism that will resonate for generations to come. I pray the Bush family finds comfort in family, faith, & the support of a nation during this time.", "2018-11-30T19:49:55.000Z": "Have you visited Pierre during the Christmas season? This year, our stunning Christmas display made USA Today's list of best public Christmas trees across the nation! Come visit the Capitol this December to see why. You won't regret it! Best public Christmas trees to visit across the USA Towering and elaborately decorated public trees allow visitors to join in local holiday traditions and gatherings. usatoday.com", "2018-11-30T19:44:17.000Z": "Lawrence County As I move toward appointing a qualified, service-oriented individual to fill your vacant House seat, I want to make sure your voice is heard. You have THREE days left to submit nominations to Rachel.Graves@state.sd.us.", "2018-11-30T14:30:27.000Z": "I'm incredibly grateful for the work of South Dakota's law enforcement officers and their courage to respond no matter the call. Special thanks today to Deputy Colter Hendrix who helped bring little Deckard into the world!! 'Thank God the kid is OK': Turner County deputy helps deliver baby in Parker backyard Baby was born minutes after Turner County Sheriff's Office Deputy Colter Hendrix arrived on scene at the family's backyard on Nov. 24 in Parker. argusleader.com", "2018-11-30T02:06:19.000Z": "While we recruit new talent, we must also retain the best and brightest who've already committed themselves to serving SD. I'm thrilled to announce these cabinet secretaries. Together, we'll create an infrastructure of results for the next generation. http:// transition.sd.gov/news/11-29_app lyforopenings.aspx ", "2018-11-28T17:52:02.000Z": "This week, I announced 3 key leadership positions for my governor's office. \n\nHerb Jones - Chief of Staff\nLiza Clark - Chief Financial Officer\nJoshua Shields - Chief of Communications\n\nThis team is experienced, they're people I trust, & they know what it means to serve SD.", "2018-11-24T15:15:06.000Z": "Today is Small Business Saturday. As you prepare for the season of gift-giving, I encourage you to find opportunities to shop small. When you do, you play a mighty role in making South Dakota a better place for all our families to thrive.", "2018-11-22T15:05:08.000Z": "What are you giving thanks for this Thanksgiving? I'm thankful for my family - they're my rock; they keep me grounded. I'm also grateful for you and the trust you've put in me to lead our state as governor. \n\nHave a joy-filled and wonderful Thanksgiving!", "2018-11-20T17:30:04.000Z": "Amazing to see the work being done by folks at Feeding South Dakota. As we reflect on our blessings this Thanksgiving week, I encourage you to go above and beyond to help others in need. South Dakotans thankful for Feeding South Dakota | Agweek SIOUX FALLS, S.D. -- Thousands of cans and boxes of donated food line the shelves from the floor to the roof in the Feeding South Dakota warehouse in Sioux Falls. With this abundance and the produc... agweek.com", "2018-11-19T18:54:29.000Z": "For decades, we've made it an American tradition to spare 2 turkeys from the Thanksgiving table through a presidential pardon. This year, 2 Huron-area turkeys have been honored with the presidential pardon, putting SD ag on national display. Check it out>> http:// goo.gl/MWfvFC", "2018-11-16T16:48:45.000Z": "Career focused training and education opportunities better prepare South Dakota's students for greater success in the workforce. My plan for education was a priority during my campaign and will continue to be a top priority as governor. Career fair caters to Rapid City's eighth-graders The eighth-graders filed out of the Western Dakota Tech classroom with a slide projecting the minimum wage at a fast-food chain frozen on the screen. The presenter, Amanda Dokter, human rapidcityjournal.com", "2018-11-13T22:25:16.000Z": "Getting right to work! I had a very productive budget meeting with Gov. Daugaard today as we get ready to again balance the budget in 2019.", "2018-11-13T22:00:04.000Z": "In my family, there are no \"boy chores\" or \"girl chores.\" There are just things to get done, and that's what we're going to do. I have some big plans for this state. I can't wait to get going. https:// goo.gl/j71FUp", "2018-11-13T18:24:24.000Z": "My 1st priority is balancing the budget without raising taxes. With that as the basis, I'll work to bring high speed internet to every part of the state & improve our education system. Thank you for the opportunity to serve as your next governor. Kristi Noem lists her top priorities while transitioning into Governor role Noem's first priority is balancing the budget without raising taxes, bringing high speed internet to every part of the state, and helping South Dakota's education system improve. kotatv.com", "2018-11-12T23:00:30.000Z": "Happy Veterans Day! Thank you to everyone who came out to our event thanking our campaign volunteers, supporters, team, and veterans. Wonderful to see everyone in Rapid City. Thank you all for spending the afternoon with Bryon and I. https:// facebook.com/308353252483/posts/10155639286197484/ ", "2018-11-11T21:20:08.000Z": "Freedom isn't free. It's paid for every day by the men and women who give of themselves to defend our liberty. To all our veterans and veteran families - thank you. Happy Veterans Day!", "2018-11-10T19:13:57.000Z": "Roger Hunt was a trailblazer. Serving together in the SD Legislature, I was inspired & motivated by Roger's relentless drive to defend the lives of unborn children. Please join Bryon and I in praying for his wife, Sharon, & the rest of the Hunt family during this difficult time.", "2018-11-10T01:25:27.000Z": "Such an amazing Veterans Day Program at the Hamlin Education Center today! Thank you to all the students for putting it together to show our eternal gratitude to our nation's veterans.  http:// facebook.com/308353252483/posts/10155633794562484/ ", "2018-11-09T15:36:48.000Z": "Honored to attend the Law Enforcement Appreciation Game Feed & children's charity dinner on Wednesday night put on by the Abdullah family. It was a great opportunity to thank those who put themselves in harm's way everyday to keep our communities safe. http:// facebook.com/308353252483/posts/10155632902717484/ ", "2018-11-07T07:41:59.000Z": "Thank you, South Dakota!", "2018-11-06T23:00:11.000Z": "We're into the final two hours of this race, & we need to make sure every supporter gets to the polls & makes their voice heard. If you've already voted, great. Thank you. If you haven't, there's still time! Find your polling location & vote! https:// vip.sdsos.gov/viplogin.aspx", "2018-11-06T18:00:03.000Z": "Love seeing all the \"I Voted\" stickers around! Have you gotten yours? Polls are open until 7:00PM, so take a break and go cast your ballot now! Need to know where to vote? Look no further >> https:// vip.sdsos.gov/viplogin.aspx", "2018-11-06T14:05:08.000Z": "If you live in Mountain Time Zone... Polls are official open! They'll stay open until 7:00PM. I would appreciate your support and your vote. Find Your Polling Location >> https:// vip.sdsos.gov/viplogin.aspx", "2018-11-06T13:48:00.000Z": "We are so proud to support #ProLife champion @KristiNoem for #SDgov Kristi has fought to protect unborn babies & worked diligently to get taxpayers out of the abortion business! #SD , vote for Kristi Noem for the protection of unborn, innocent lives! #IVoteProLife", "2018-11-06T13:00:23.000Z": "If you live in Central Time Zone... Polls are official open! They'll stay open until 7:00PM. I would appreciate your support and your vote. Find Your Polling Location >> https:// vip.sdsos.gov/viplogin.aspx", "2018-11-06T13:00:21.000Z": "It's Election Day! I hope you know how grateful my family & I are for the outpouring of support over the last few weeks. We couldn't have gone through this journey without your prayers & encouragement. Please get out the vote! Find Your Polling Location >> https:// goo.gl/wCAmx9", "2018-11-05T23:52:00.000Z": "Wrapping up the #Allin4Kristi bus tour tonight in Watertown. It'd mean the world to see you all there. \n\nWhen: Nov. 5 - 8:00pm-8:40pm\nWhere: Watertown Christian School Gymnasium (15 12th Ave NE, Watertown)", "2018-11-05T21:57:00.000Z": "Castlewood!! The #Allin4Kristi rally is something you won't want to miss. Here are the details: \n\nWhen: Nov. 5 - 6:30pm-7:10pm\nWhere: Kones Korner (18299 US-81, Castlewood)", "2018-11-05T21:00:33.000Z": "In less than 24 hours, Election Day arrives! Our team, and supporters across South Dakota, have built undeniable momentum. But our work isn't over. Tomorrow, we ALL need to cast our ballots if we want to win this race. Find your polling location now! https:// goo.gl/wCAmx9", "2018-11-05T19:55:00.000Z": "Thrilled to have @johnthune as part of the Brookings #Allin4Kristi Rally! Come show your support! \n\nWhen: 4:35pm-5:15pm\nWhere: Research Park - Atrium (2301 Research Park Way, Brookings)", "2018-11-05T18:01:00.000Z": "The #Allin4Kristi bus is headed to Sioux Falls with special guest @johnthune ! \n\nWhen: 2:10pm-3:10pm\nWhere: Holiday Inn Downtown, Falls West (100 W 8th St, Sioux Falls)", "2018-11-05T16:50:00.000Z": "Excited to see everyone at the Mitchell #Allin4Kristi rally in just ONE hour!\n\nWhen: 11:50am-12:30pm\nWhere: Davison County GOP (200 N Main St, Mitchell)", "2018-11-05T16:00:04.000Z": "Have you made a plan to vote tomorrow? Click below to find your polling location and other voter information. It's going to be a very close election. We need to make sure every vote is cast. https:// vip.sdsos.gov/viplogin.aspx", "2018-11-05T15:01:56.000Z": "One day to go! Heading to Montana this morning to campaign with @MattForMontana for US Senate, then on to South Dakota to support @KristiNoem - who will be a GREAT governor!", "2018-11-05T13:32:00.000Z": "If you live near Platte, I'd love to see you. The #Allin4Kristi bus is headed your way! \n\nWhen: 9:35am-10:15am\nWhere: Dutch Oven Bakery (12 W 7th St, Platte)", "2018-11-05T01:59:00.000Z": "LIVE FROM RAPID CITY>>Huge thanks to Matt Michaels for joining the #Allin4Kristi tour today. Check out his speech here! http:// facebook.com/kristiforgovernor/videos/283276135652902/?xts[0]=68.ARBqffiC_RyndE_lV2h8N04_YrShMqWVLUjOS-qrktTyvZ5W-s3vRd25efPEeEd1fmahKLJqdMd8hhrxRyAzIA8-TfdbA5rWRe7VFocoQQUPPdjfTx_44Y0ZTZWcxYFmvUuLMVQPD3A59ia2Ff2iauPjRaU-1AQTsJZt4BL7NmRM08H3r7QFkCfWSpH0kL0ys5Th_3dSW7dXwgUMGWiDs2LrcRm246DpGKV8&tn=-R ", "2018-11-05T01:47:22.000Z": "Thank you, Shauna!", "2018-11-05T01:33:00.000Z": "LIVE FROM RAPID CITY>>It's exciting to see young people so passionate about things like education and family values. Grateful to have you both #Allin4Kristi . http:// facebook.com/kristiforgovernor/videos/549805742107915/?xts[0]=68.ARBvs7SxqO_Bv-k9EZJDuIDvphPpMZDoETLqBO4ozDOWjycwCvKn6vPdWWBh20PxyGgAUOmNpGXmtbqnuL7uWejGWyVlmcRIhk78EEGjKjZNNP3B_jQctVKkZyXvwksRKpQ9Pn4I2BLPwvy9_NHWLPDPYBzapk2NbXFt20uAWkxwCvv41Vq_4FkZTCfPdAYn0b4kEDCVLjQ1VYUG67qn4B928a8vIDcEzL0M&tn=-R ", "2018-11-05T00:03:00.000Z": "Coming to the Get Out the Vote Rally with @mike_pence tomorrow? Please RSVP! Get Out the Vote Rally with Vice President Mike Pence We are days away from electing South Dakota's next governor. Everywhere we go, we can feel the momentum building. People are getting excited about bringing home a win on November 6. Join KRISTI NOEM,... eventbrite.com", "2018-11-04T23:00:02.000Z": "I love South Dakota and have a plan to strengthen families and communities. Too many parents and grandparents have talked to me about young people moving away. We can do better when it comes to creating opportunity. Learn more! Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-11-04T21:01:37.000Z": "Monday's rally with Vice President Mike Pence just got bigger Sens. Lindsey Graham and Cory Gardner will be in Rapid City too! This event is FREE and open to the public. RSVP below! Get Out the Vote Rally with Vice President Mike Pence We are days away from electing South Dakota's next governor. Everywhere we go, we can feel the momentum building. People are getting excited about bringing home a win on November 6. Join KRISTI NOEM,... eventbrite.com", "2018-11-04T19:21:15.000Z": "You can tell a lot about someone's character by the people who surround them. Grateful to have so many friends and family in this with @rhodenforsd and me. #Allin4Kristi  http:// facebook.com/kristiforgovernor/videos/360750671334894/?xts[0]=68.ARDMLN_n1jwoaROBJ1a9lrjSbhfF9c1T7VkOrmoDmzUhAmDvXYYJncbVN_lsF6yaBTAwrrjyZRhlhzUOe3CKqDpCK6pV4xoL_tsx1oFl92JqwfAdkTuBi1anoHaAQFdbGWOnzdsEV5d7TrW-b5nTHM3Wxv-eKRl7AeO9w99UUGrGNiEd11QglIrpUgc3Nvx2GwbGv4S9zqcHjKK24GIO0Re25ybAon938tzq&tn=-R ", "2018-11-04T19:08:35.000Z": "Thank you, @IvankaTrump !! Quote Tweet Ivanka Trump @IvankaTrump I appreciate the great work of @RepKristiNoem to deliver massive tax cuts + much needed relief to hard working American families! \nShe is a tireless champion for the great people of South Dakota!\nVOTE for Kristi Noem for Governor! twitter.com/govkristinoem/", "2018-11-04T18:00:00.000Z": "Hey Rapid City>>Don't forget to come out for the #Allin4Kristi Rally this afternoon. See you soon!!\n\nWhen: 3:00pm-4:00pm\nWhere: First Assembly of God (4905 U.S. 16 Srv Rd, Rapid City)", "2018-11-04T17:52:00.000Z": "Don't miss your chance to attend the Get Out the Vote Rally with Vice President @mike_pence ! RSVP here. Get Out the Vote Rally with Vice President Mike Pence We are days away from electing South Dakota's next governor. Everywhere we go, we can feel the momentum building. People are getting excited about bringing home a win on November 6. Join KRISTI NOEM,... eventbrite.com", "2018-11-04T17:34:52.000Z": "After a short stop at Community Baptist Church of Union Center, we made our way to Spearfish on the #Allin4Kristi Tour. An amazing crowd!! Thank you!  https:// facebook.com/308353252483/posts/10155621405717484/ ", "2018-11-04T17:34:40.000Z": "Kicking off Day 2 of the #Allin4Kristi bus tour in Spearfish! https:// facebook.com/kristiforgovernor/videos/2142491609115035/?xts[0]=68.ARDSvP6VVSIuQ7l8cgaZBnWziJQIczhiT4uo5E_OewPoN0SepAGWHyiiyoz2hQOQTgfrzIyGVtMX2D7efSJc_vJqCJl4NKztdPwdn_IE3tQdMliOhZ0nhl2_PuIOvaMbcjjf7IllpoyDUBnlNMaYWyohpN5_95qjT30ZSbhTOGgqS_E4j9ORI5DU2DgeyYz-CVdTh9AXd44JRmicRrXzPwBgvHd5xUrZKsbdUrk&tn=-R ", "2018-11-04T16:05:00.000Z": "Excited to be in Sturgis today. Come see us at the #Allin4Kristi Rally!\n\nWhen: 11:05am-11:45am\nWhere: Sturgis Community Center (1401 Lazelle St., Sturgis)", "2018-11-04T16:00:20.000Z": "Are you ready for Election Day? With only two more days to go until polls open, I wanted to share this voter portal information with you that provides all the details you'll need to cast your ballot. Check it out now and RT to spread the word! https:// goo.gl/wCAmx9", "2018-11-04T13:30:00.000Z": "Kicking off Day 2 of the #Allin4Kristi bus tour in Spearfish! See you soon! \n\nWhen: 9:30am-10:10am\nWhere: The Pavilion (115 S Canyon St., Spearfish)", "2018-11-04T03:31:47.000Z": "Amazing turnout in Pierre today! Thank you for the support. It means more than you know to have so many families go #Allin4Kristi !! https:// facebook.com/308353252483/posts/10155620313377484/ ", "2018-11-04T00:17:05.000Z": "Thank you so much for these kind words. I agree - strong families create strong states. And strong states create a strong country.", "2018-11-04T00:09:00.000Z": "It's been incredible having @DustyJohnson on the #Allin4Kristi tour today. Check out this video! #GoDustyGo ! https:// facebook.com/kristiforgovernor/videos/189627595257439/?xts[0]=68.ARBlNBOe-TK1939jCivDsgYw3SzClsZDogEp8nmCbPVclvzhfpaT4gmsPJvHm6gXThNZeJHM3pvRo_V9jRZUzK4jGfGuqaLlLQ3Sl0ukY8mF_AyA6rodtQ51VLy-HwycVQdKtOA1P1vOBKI9SaHPs8mZhJbNVoonE6Om5Y5yhNkLRy0psx3FSzdT38dBo8dbHt4m8aBKqrhMz_ABWXKC6uNVn6PmuzyV_NrB&tn=-R ", "2018-11-03T23:28:06.000Z": "Thank you so much to everyone in Miller who came out to support me today. Your feedback has truly encouraged and inspired me. Thank you. #Allin4Kristi  https:// facebook.com/308353252483/posts/10155619927062484/ ", "2018-11-03T23:01:00.000Z": "Thrilled to have @mike_pence in Rapid City on Monday for my Get Out the Vote Rally! Have you RSVP'd yet? Get Out the Vote Rally with Vice President Mike Pence We are days away from electing South Dakota's next governor. Everywhere we go, we can feel the momentum building. People are getting excited about bringing home a win on November 6. Join KRISTI NOEM,... eventbrite.com", "2018-11-03T22:45:00.000Z": "The Pierre #Allin4Kristi Rally starts in TWO hours! Will you be there? \n\nWhen: 7:45pm-8:30pm\nWhere: Ramkota Hotel, Gallery DE (920 W Sioux Ave., Pierre)", "2018-11-03T21:51:53.000Z": "Our #Allin4Kristi Tour just left Huron! Thank you for the warm welcome and huge get out the vote effort! https:// facebook.com/308353252483/posts/10155619718452484/ ", "2018-11-03T21:28:35.000Z": "Great being in Huron this afternoon! So thankful for people who support me and my family. Hannah and Cindy are two of those people. Check out what they had to say. #Allin4Kristi  https:// facebook.com/kristiforgovernor/videos/907304459464687/?xts[0]=68.ARByeAvESsuvFyCUXG3FgJPwgEJobrwihpk1GJr5aFE9yLfNggkUEGMl5zP0e49i_OEB-pByqVtBnhO5pnOF4hxczKJQSxjo8ocWd9xJo8FLsmT9KfZktCj4SAYJUuWGRE84h_kWhZ8ZwxYG2r67KWGsbptfvhm--o8tC9GCwTdM5nb7uaoV5OEINH10nUB9PH00j3nxQ703sM2M0e1Je-PLaMTsZtl2st8Y&tn=-R ", "2018-11-03T21:14:00.000Z": "Do you live near Miller? I'll be in town today! #Allin4Kristi When: 5:20pm-6:00pm\nWhere: Miller Community Center (526 N Broadway Ave, Miller)", "2018-11-03T20:15:00.000Z": "We're only two days away... If you want to come to the Get Out the Vote Rally with Vice President @mike_pence , don't forget to RSVP!! Get Out the Vote Rally with Vice President Mike Pence We are days away from electing South Dakota's next governor. Everywhere we go, we can feel the momentum building. People are getting excited about bringing home a win on November 6. Join KRISTI NOEM,... eventbrite.com", "2018-11-03T19:55:52.000Z": "Had a little extra time before our #Allin4Kristi tour stop in Redfield, so we caught the Redfield Gun Show! Wonderful support. Thank you!! https:// facebook.com/308353252483/posts/10155619536572484/ ", "2018-11-03T19:52:18.000Z": "Wow, Aberdeen! Thank you for filling the room with such incredible energy! The momentum is building across Brown County ahead of Tuesday, November 6. Thank you!! #Allin4Kristi  https:// facebook.com/308353252483/posts/10155619334057484/ ", "2018-11-03T19:50:00.000Z": "I'm Huron bound! The #Allin4Kristi bus is 30 minutes away, and we'd love to catch up with you.\n\nWhen: 3:20pm-4:00pm\nWhere: The Plains - Range Room (906 4th St NE, Huron)", "2018-11-03T19:29:20.000Z": "LIVE FROM REDFIELD>>So good being in Redfield! And thanks Gary and Diane for your support. It means the world to me. #Allin4Kristi  https:// facebook.com/kristiforgovernor/videos/189998668542675/?xts[0]=68.ARBgBq9eRLc7631ALcFZnf02MLlFNw5NeMzXfWFCPyLAlMNy4TnGSlB8iVCNDwj7tbhsN5OFixmfUCAO-3dnCj66zAuyRrgNLwSaZg5hvj1o6cO93pxh-EwQ5m9ULqEUIJNGiW96lYz09lBNDU8VQXgmTiDgkibfMK1_wcdhQYV0PncpfsFA7KSYExnIXOyaj2mrFXc6UyvgaxzxvIw2TtE-K_rEGwbHNnAf&tn=-R ", "2018-11-03T17:42:13.000Z": "LIVE FROM ABERDEEN>>Chase and Logan have been an incredible help to my campaign over the last few months. They really lead by example, and I'm grateful for that. If you'd like to volunteer in the last few days before the election, we have a place for you! https:// facebook.com/kristiforgovernor/videos/595756397509839/?xts[0]=68.ARAd-_lYNUcvp1v617EhxtvLksuIf3v7DKfbBudmESXY7FOztWAGlN5N2BYyjxrMlw2XncPdmLojbQdi-9mHOBecY0XZ97kbC2X60mPf8eSsKbtiiEJt3giUqRhXLKfO7uqmqXYgmeh9OVRAZm28R-4AefW8CJfkImUHatCv_FBq8C_ubgz7FORoRLNltOtj8vVVP2nhsxs6oXrBBw-B3Yi17RrtWOmZ5uv1&tn=-R ", "2018-11-03T17:36:21.000Z": "First Stop on the #Allin4Kristi Tour: Webster! Thanks for the love and support! And thanks to @DustyJohnson for joining in on the fun too! #GoDustyGo ! https:// facebook.com/308353252483/posts/10155619322567484/ ", "2018-11-03T17:27:10.000Z": "Aberdeen - you were amazing. Thank you so much for your support and kind words. https:// facebook.com/kristiforgovernor/videos/258991558141697/?xts[0]=68.ARCEfp2Cs5mlmfZlsMk3W5sqMjAV8VC1n8wQq_ZQrfYomuUwSqlT2dTB1qnNYUN9XtI7tqEf-8U0bIcZ1DUuw74jdyRZgjk4sFt-RiDn93x3y3AS9tFIBje4SRX6BcnV5T828BvXAqjQ0DeyfBS88o_oIOzXPG_xpPkhyKzngK9HVd3cnYD0HRKyloeWzJFs4gwIzNjUA0SX8yrRaNd7IvW9o_pJqabE74Rf&tn=-R ", "2018-11-03T17:20:00.000Z": "I'll be in Redfield in just one hour! Will you be there? \n\nWhen: 1:20pm-2:00pm\nWhere: Leo's Good Food (602 N Main St, Redfield)", "2018-11-03T15:47:48.000Z": "LIVE FROM WEBSTER>>Josh Haeder is a small business owner, a dad, and an experienced manager. He's running for State Treasurer, and I'm excited to have him along with us for the #Allin4Kristi bus tour. https:// facebook.com/kristiforgovernor/videos/2165278727061008/ ", "2018-11-03T15:16:00.000Z": "The #Allin4Kristi bus is headed to Aberdeen. See you soon! \n\nWhen: 11:25am-12:05pm\nWhere: Aberdeen First Assembly (1424 24th Ave NW, Aberdeen)", "2018-11-03T14:05:20.000Z": "This is it - the final 72 hours before the polls open on Election Day! Our team is out and about all across South Dakota getting out the vote, and sharing our message. I can't thank them enough for their help and support. If you've seen or heard from Team Noem, RT & let us know!", "2018-11-03T13:03:00.000Z": "On my way to Webster for the #Allin4Kristi Rally. Hope to see you there!!\n\nWhen: Sat. November 3 - 9:20AM-10:00AM\nWhere: The Galley", "2018-11-03T01:11:00.000Z": "Sure excited to be in Miller tomorrow for the #Allin4Kristi bus tour! Here are the details:\n\nWhen: 5:20pm-6pm\nWhere: Miller Community Center", "2018-11-03T00:31:00.000Z": "PIERRE!! Come join me for an #Allin4Kristi Rally tomorrow night! \n\nWhen: Nov. 3 - 7:45pm-8:30pm\nWhere: Ramkota Hotel, Gallery DE", "2018-11-02T23:54:00.000Z": "Huron folks>>I'd sure enjoy seeing you all tomorrow at my #Allin4Kristi rally!! \n\nWhen: Nov. 3 - 3:20pm-4:00pm\nWhere: The Plains", "2018-11-02T23:19:00.000Z": "Excited to be in the Pheasant Capital of the World tomorrow for the Redfield #Allin4Kristi rally!\n\nWhen: Nov. 3 - 1:20pm-2:00pm \nWhere: Leo's Good Food", "2018-11-02T22:24:00.000Z": "Hey Aberdeen - I'm headed your way tomorrow! \n\nWhen: Sat. November 3 - 11:25AM-12:05PM\nWhere: Aberdeen First Assembly", "2018-11-02T21:01:00.000Z": "WEBSTER>>I'll be in town tomorrow!! Here are the details:\n\nWhen: Saturday, Nov. 3 - 9:20AM-10:00AM\nWhere: The Galley", "2018-11-02T18:15:22.000Z": "We're heading into the final weekend of this campaign, and we need to close strong. If you want to make an immediate impact, vote absentee or sign-up below to join us on the campaign trail!\n\nVote Absentee >> https:// goo.gl/5X29wR Join Our Team >> https:// goo.gl/qH6fYk", "2018-11-02T17:56:27.000Z": "Happy Birthday South Dakota! There is no other place I'd call home. What's your favorite part of living in South Dakota?!", "2018-11-02T17:06:22.000Z": "When I was growing up, there was no such thing as \"boy chores\" or \"girl chores.\" There was just work to do. That's how I've always approached my job. Measure me by the results. #girlgovernor  #Allin4Kristi Girls Couldn't Vote youtube.com", "2018-11-02T15:56:01.000Z": "In just THREE days, @mike_pence will be in Rapid City for my Get Out the Vote Rally! Will you be there? RSVP today! Get Out the Vote Rally with Vice President Mike Pence We are days away from electing South Dakota's next governor. Everywhere we go, we can feel the momentum building. People are getting excited about bringing home a win on November 6. Join KRISTI NOEM,... eventbrite.com", "2018-11-01T22:25:06.000Z": "Did you hear?? @mike_pence will be in Rapid City on Monday to headline my Get Out The Vote Rally! RSVP here: Get Out the Vote Rally with Vice President Mike Pence We are days away from electing South Dakota's next governor. Everywhere we go, we can feel the momentum building. People are getting excited about bringing home a win on November 6. Join KRISTI NOEM,... eventbrite.com", "2018-11-01T15:05:26.000Z": "It's November at last, and you know what that means - there are only five days to go until the November 6 election! LIKE and RT to show your support for our campaign!", "2018-10-31T17:05:18.000Z": "In just six days, we'll be casting our ballots. I'm looking forward to November 6, but wanted to remind you that you can vote absentee early if you'd prefer to avoid the line. Need more information? Check out the link below for absentee voting details. https:// goo.gl/5X29wR", "2018-10-31T00:10:27.000Z": "I love South Dakota, and I really do try to do the best job every single day to make things better for our families in South Dakota. Thank you @KELOBrady for sharing why I'm in this fight and why I'm asking people for their vote on November 6. https:// facebook.com/308353252483/posts/10155611936332484/ ", "2018-10-30T13:15:18.000Z": "COUNTDOWN: One week left until Election Day! We're into the homestretch, and I am overwhelmed by the outpouring of support I've received over this final push. We're almost to the finish line, but I need your help to get a win on November 6. Can I count on your vote?", "2018-10-29T16:56:54.000Z": "A debate between the major party candidates in the governor's race @KristiNoem and @billiehsutton is about to begin in downtown Sioux Falls", "2018-10-29T16:57:36.000Z": "Live now: @KristiNoem and @billiehsutton participate in a gubernatorial debate at the Sioux Falls Downtown Rotary: Money pours in for Kristi Noem, Billie Sutton ahead of final governor's race debate Both sides are pushing for votes in a contest that is competitive for the first time in decades. argusleader.com", "2018-10-29T16:45:32.000Z": "Just over a week to go until Election Day! Want to know more about my plan to address the drug epidemic, improve education, and kickstart our economy? Check out my site now to learn more and RT to spread the word! https:// kristiforgovernor.com", "2018-10-28T16:12:42.000Z": "From WA to FL I covered the Year of the Woman 2018- meet a few of them: ... @KristiNoem  ... @Abby4Iowa  ... @staceyabrams  ...@MBFforCongress ... @DrKimSchrier  ... ...@LucyWins2018 ... @AmyMcGrathKY  ...1/2 Women candidates challenged by history, party and sexism The 2018 midterm elections may have been deemed the \"Year of the Woman,\" but the candidates still had to fight through \"No,\" \"Not yet\" and \"Do it the old way.\" Kyung Lah reports from a year on the... cnn.com", "2018-10-28T14:00:21.000Z": "We're into single digits, now. Just 9 DAYS until we head to the polls. Are you ready to cast your ballot? If you have any questions or concerns, head on over to the South Dakota Voter Information Portal to get all the info you'll need to vote! https:// goo.gl/wCAmx9", "2018-10-27T13:40:19.000Z": "Only two more Saturdays left before Election Day to get out the vote, so we're working around the clock to reach out to voters. Remember: There's still time to vote absentee if you want to avoid the lines on Election Day! https:// goo.gl/wCAmx9", "2018-10-21T16:57:17.000Z": "Please keep the Turbiville family in your prayers today. Chuck was a wonderful colleague in the state legislature and a lifelong public servant. He will be truly missed.", "2018-10-21T16:33:08.000Z": "It was a windy day, but still a great parade at Augustana! Thanks to our volunteers! Wish I could have been there!", "2018-10-19T22:52:45.000Z": "It's almost here! Head to my website to learn more about my plan to preserve our pheasant hunting tradition before the opener!", "2018-10-18T14:00:04.000Z": "Thank you for joining me in Redfield! We are going to fight and we are going to win, but I need your help - and your vote! Noem speaks in Redfield while campaigning for Governor On Thursday, October 11th, Republican Congresswoman Kristi Noem met with Redfield economic and business leaders at Leo's Good Food to discuss issues pertinent to Redfield and South Dakota and inform... redfieldpress.com", "2018-10-18T00:57:41.000Z": "JUST THREE DAYS! That's all we have left until South Dakota's 100th pheasant opener!", "2018-10-16T15:23:35.000Z": "In Congress, I've focused on results like the Farm Bill, disaster relief, historic tax cuts, and tools to fight sex trafficking. As governor, I'll do the same, improving education and making my office open and transparent - without raising your taxes.", "2018-10-15T16:49:09.000Z": "Let the countdown begin... 5 days from South Dakota's 100th pheasant opener! Are you planning to head out this weekend?", "2018-10-14T16:20:05.000Z": "To stabilize the ag economy, we need to expand market access. Ethanol (E15, in particular) is a huge market that we haven't yet been able to fully tap into. But that could be changing... Noem efforts to allow year-round sales of E15 fuel pay off - Ripon Advance U.S. Rep. Kristi Noem (R-SD) this week commended an announcement by the president that the Environmental Protection Agency (EPA) will start lifting restrictions on year-round sales of E15 fuel, which... riponadvance.com", "2018-10-13T21:05:24.000Z": "Kristi is fixin' signs on our way west today...she likes things done right but I'm worried we will be late. If you see a sign floppin' can you fix it for us please? - Beth #ALLIN", "2018-10-13T15:20:07.000Z": "I'll always defend and protect your constitutional right to bear arms. Absentee and early voting has begun. Please make our voice heard. https:// goo.gl/5X29wR", "2018-10-12T17:36:30.000Z": "We need to expose kids to in-demand jobs early by starting career counseling in middle school and expanding tech education in our high schools. Thanks to everyone who took the time to learn more about my plan in Aberdeen this week! Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-10-12T13:39:33.000Z": "I'm grateful every day to have lived most of my life as a farmer and rancher.", "2018-10-11T20:39:23.000Z": "One of the big reasons why this election matters and why I'm asking for your vote on November 6. #prolife Release: Next governor to appoint two Supreme Court Justices; South Dakota needs a consistent,... Next governor to appoint two Supreme Court Justices; South Dakota needs a consistent, pro-life governor to make appointments Rapid City, SD--October 11, 2018: The next governor of South Dakota will... dakotawarcollege.com", "2018-10-11T19:55:02.000Z": "You can't drive through Groton without a stop at DQ! If you know anything about my family, it's that we LOVE ice cream! Thanks for the cool treats and warm welcome! https:// facebook.com/308353252483/posts/10155576399087484/ ", "2018-10-11T18:07:46.000Z": "Stopped by Pereboom's in Webster this morning. A lot of good questions about how I'd like to make healthcare more affordable, get people to work, and fight this drug epidemic. On to Groton!! https:// facebook.com/308353252483/posts/10155576220077484/ ", "2018-10-11T16:42:02.000Z": "I have pledged that I won't raise your taxes. Join me and help make sure South Dakota isn't subjected to a state income tax. Submit your absentee ballot OR vote early! Learn how >> https:// goo.gl/5X29wR", "2018-10-11T04:06:20.000Z": "We stopped in Faulkton and visited with folks at the Senior Citizen Center. Thank you to everyone who came out and offered to volunteer! We also spent some time admiring the beautiful murals in town....Absolutely a special town no one should miss. https:// facebook.com/308353252483/posts/10155574599897484/ ", "2018-10-10T23:41:10.000Z": "Soooo it took me awhile @kevincramer ...but with the dedicated help of my ND friend Sue, I am fulfilling my promise to tweet a pic wearing NDSU gear after our loss to the Bison.... but I  am keeping the tags on  #GoJacks", "2018-10-10T19:01:31.000Z": "Quick stop in Ipswich. We were to go to the paper first and missed her so we went to Subway and visited and ate lunch and then ran into her there! All worked out perfect....Bad weather but great people.  https:// facebook.com/308353252483/posts/10155574427052484/ ", "2018-10-10T18:09:19.000Z": "So many people braved the snow and wind to come visit this morning about the SD Governor's race and support our campaign in Selby! Thank you all for the great conversation and stay safe out there today! Appreciate the Cloverleaf for hosting us! https:// facebook.com/308353252483/posts/10155574223917484/ ", "2018-10-09T01:44:29.000Z": "While we must acknowledge the past, I believe we must actively celebrate the ways in which Native American heritage continues to be woven into SD's story. Happy Native Americans' Day! Enhancing Tribal Relations Learn more about my plan today! kristiforgovernor.com", "2018-10-07T20:46:58.000Z": "Thanks to the work we've done to cut taxes and reduce unnecessary regs, our unemployment rate is at it's lowest since 1969 - 3.7%. For women, at 3.6%, the unemployment rate matches the lowest rate in 65 years.", "2018-10-06T23:19:51.000Z": "So much fun at Festifall at Newton Hills State Park today! Lots of folks out catapulting pumpkins, drinking hot chocolate, making candles, enjoying shopping from the venders & more. Oh and GREAT music! Can't wait to try my plum applesauce and kettle corn! https:// facebook.com/308353252483/posts/10155566394562484/ ", "2018-10-05T21:40:17.000Z": "Vote Early and Vote for @KristiNoem for Governor. Kristi is a trusted conservative voice for South Dakota family values.", "2018-10-05T14:25:04.000Z": "Skip the lines on Election Day and cast your ballot early for this year's election. There's too much at stake for South Dakota for us to stay home. Learn more, SHARE the how-to's, and VOTE >> https:// sdsos.gov/elections-voti ng/voting/absentee-voting.aspx ", "2018-10-05T01:58:25.000Z": "THANK YOU to our amazing volunteers! We couldn't do this without your energy. #Allin4Kristi", "2018-10-04T00:57:22.000Z": "There is no one more deserving of this than Joy. For anyone who's been to Joy Ranch, you know how powerful this place is. Congratulations, Joy. Thank you for doing all you do. 2018 Good Neighbor Joy Nelson Joy Nelson founded the 126-acre Joy Ranch to share her love of open land and horses with others in her community. The fully ADA-accessible ranch is a place w... youtube.com", "2018-10-02T18:14:21.000Z": "Early and Absentee voting is ongoing in South Dakota RIGHT NOW! Don't let your friends and family miss out - RT this post and remind them to get their ballot. Skip the lines, vote early https:// sdsos.gov/elections-voti ng/assets/AbsenteeBallotApplication.pdf ", "2018-10-01T20:31:26.000Z": "#NewProfilePic", "2018-09-29T18:58:55.000Z": "The bet is on! @kevincramer and I have a lot riding on this game.  I believe in you SDSU #GoJacks", "2018-09-28T20:51:12.000Z": "Look at this Noem-Rhoden spirit at the Sioux Falls Christian homecoming parade!! Thank you! #Allin4Kristi", "2018-09-27T13:01:16.000Z": "About the best compliment you could give: \"I truly believe that as Governor, Kristi Noem will go bare-knuckle-toe-to-toe to keep her promises to the people of South Dakota.\" Thanks Ken! Sept. 26, 2018, letters Kristi Noem will keep her promises rapidcityjournal.com", "2018-09-26T21:59:15.000Z": "Stopped into the campaign's Rapid City office today. We had some great volunteers working away. Come by our location in Tuscany Square (325 Omaha Street in Rapid) if you have an extra hour or two. We'd love to have you as part of our volunteer team. #Allin4Kristi", "2018-09-26T21:20:46.000Z": "Join our exclusive Team Noem community on Facebook Messenger! I'll be sharing a special inside look at the race, as well as vital information about our agenda and vision. I might also ask you for feedback on important issues! Sign up now! https:// bit.ly/2Iaf5dY", "2018-09-26T20:43:15.000Z": "Have you picked up your new Noem-Rhoden yard sign yet? William Beal from Moody Co did today! Please stop by one of our offices to get your sign>> http:// kristiforgovernor.com/contact", "2018-09-25T20:40:51.000Z": "These are the types of policies I'll pursue as governor. Let's support our farmers and homegrown energy by moving South Dakota's state vehicle fleet to higher ethanol blends! Quote Tweet U.S. EPA Region 7 @EPAregion7 Today, @EPA approved Nebraska's request for an exemption to conduct a one-year testing program to assess the effects of E15 and E30 blends on vehicle performance, fuel economy, and emissions control systems in state-owned vehicles.", "2018-09-21T14:30:03.000Z": "Skip the Election Day lines and VOTE EARLY! This could be a tight race for governor of South Dakota. Every vote matters. Please do not delay. Vote early or request an absentee ballot today! https:// goo.gl/yZ3sFs", "2018-09-20T13:36:02.000Z": "Mark your >> @ksfynews just announced they'll air our 3rd Gubernatorial Debate on Oct 29! Tune into @keloland on Oct 23 and @SoDakPB on Oct 25 to watch the others. Sioux Falls Rotary Club hosts final gubernatorial debate KSFY News is helping voters prepare for the upcoming gubernatorial election in South Dakota by airing broadcasts of a major debate between the two candidates. dakotanewsnow.com", "2018-09-17T19:23:03.000Z": "Our tax cuts at work>> Take-home pay is up 4.9% in the last year alone! Here's the bottom line: Tax reform was more than just a hatchet to the tax code. We deliberately designed these cuts to benefit families, give folks upward mobility, and rev up our economy... and it worked.", "2018-09-17T00:55:50.000Z": "Happy E15 Freedom Day! Thanks to EVERYONE who came out to Baltic today to fill up with homegrown #ethanol !! We had 30+ volunteers filling tanks, washing windows, checking oil/tire pressure. Also - thanks to the Vollan family at Midway Service! >> https:// facebook.com/308353252483/posts/10155528809532484/ ", "2018-09-16T01:53:53.000Z": "Great Lincoln County GOP dinner tonight. There are a lot of folks out there who are excited about this year's race. We're less than one week away from early voting. It's time to turn that energy into votes.", "2018-09-14T22:59:34.000Z": "Thanks @jfreidel and the entire team in Lake Andes!! Quote Tweet Jeremiah Freidel @jfreidel Out supporting @KristiNoem today in Lake Andes thank you everyone for all the help!!", "2018-09-14T20:53:23.000Z": "Can you believe it? We're just a week away from the start of early voting! Skip the lines on Election Day, and vote early! Learn more >> https:// vip.sdsos.gov/viplogin.aspx", "2018-09-14T15:19:34.000Z": "Hey everyone!! My team and I will be in Baltic on Sunday pumping E15! We're celebrating the summer restrictions being lifted!\n\nDATE: Sunday, September 16\nTIME: 3:30PM-4:30PM\nWHERE: Midway Service (25402 475th Ave, Baltic - off Hwy 115, right outside of Sioux Falls)", "2018-09-12T21:25:04.000Z": "Honored by the support of the South Dakotans who know me best. As they'll tell you - there's no outworking me. As governor, I'll take my experience with ag & small business to Pierre to create opportunity for families & keep SD on the right path forward.", "2018-09-12T15:12:13.000Z": "One of the things I've always admired about the veteran community is their relentless service. So many fought for our nation, returned home, and continue to fight for their fellow service members. Thanks to the SD Veterans Council letting me talk about my plan for veterans today.", "2018-09-12T12:15:08.000Z": "Question>> What's your favorite local business? Met with S.D. Retailers this week on some opportunities I see to kickstart local economies.", "2018-09-11T19:59:54.000Z": "We have a big healthcare problem out there when it comes to affordability and access. I sat down with Wellmark today to talk through some strategies to address some of these challenges. What's happening today isn't working.", "2018-09-11T16:44:48.000Z": "Today, we remember those who lost their lives on 9/11. We remember the first responders. We remember the heroes who sacrificed themselves in a PA field. We remember the lives lost later in an attack on our embassy. We remember everyone who has fought for our freedoms. We remember", "2018-09-09T02:35:24.000Z": "Such a fun night at Wessington Springs! Several stops along the way too. Foothills Bull Bash, Fast Draw, burgers provided by the churches of Wessington Springs, Shakespeare Garden, and M-T Corner TWICE!! Love South Dakota  https:// facebook.com/308353252483/posts/10155512844627484/ ", "2018-09-08T20:23:53.000Z": "Some really incredible cars at the Vintiques Car Show in Watertown today!", "2018-09-07T22:22:51.000Z": "\"I fully support @KristiNoem ...and she is going to be a great great governor,\" - @POTUS  @realDonaldTrump  #kelonews", "2018-09-06T14:30:04.000Z": "Found the perfect video for #TBT ! Can you believe Booker is a JUNIOR in high school already? #wheredoesthetimego Trash Day Kristi Noem's latest ad highlights her fight against the Department of Labor rules that would've banned kids from doing certain chores on the farm. Help us k... youtube.com", "2018-09-04T20:55:27.000Z": "The best of Codington County. Quote Tweet CBS News @CBSNews WATCH: Off-duty cop belts out the national anthem in an empty courthouse with \"awesome acoustics\" https:// cbsn.ws/2PDauU3", "2018-09-03T18:53:42.000Z": "What an incredible team in Wagner today! https:// facebook.com/308353252483/posts/10155502402827484/ ", "2018-09-01T23:24:11.000Z": "I just wanted to give a quick shout out to some of my awesome team (Didn't get pictures of everyone - Sorry!) These folks work so hard for our campaign. We couldn't do it without them.", "2018-09-01T22:41:11.000Z": "What a day! It was filled with so many wonderful friends and even some family. I couldn't ask to be surrounded by more incredible people.  @SDStateFair  https:// facebook.com/308353252483/posts/10155498701372484/ ", "2018-09-01T02:07:12.000Z": "Thank you to everyone who stopped by the State Fair today! My family and I had an absolute blast!! https:// facebook.com/308353252483/posts/10155497018792484/ ", "2018-08-31T17:05:03.000Z": "We cannot underestimate the influence of a good education. Students gain confidence, communities often experience decreased crime rates, and employers get access to a skilled workforce. Read my education plan >> Improving Education's Impact Read more about my initiative to improve education's impact in South Dakota. kristiforgovernor.com", "2018-08-31T16:24:09.000Z": "Hey folks. I want to hear from you. Head over to our Facebook page today for the very first Feedback Friday >> https:// facebook.com/308353252483/posts/10155496102352484/ ", "2018-08-31T13:10:06.000Z": "Hard to believe Kennedy is starting her final semester at SDSU and Booker is a JUNIOR in high school already (and Kassidy is already done and graduated!) Learn what I've done done to get the fed gov't out of their classrooms (and your kids' too)>> Congresswoman Kristi Noem's Weekly Column: Unpacking Education Reform Unpacking Education Reform By Rep. Kristi Noem Boy, did the summer fly by! We fell a little behind on school shopping this year, but after searching the entire eastern side of South Dakota for... dakotawarcollege.com", "2018-08-31T02:39:00.000Z": "Great day in De Smet today! Thank you for the warm welcome, the hot coffee, and the wonderful tour through town. You have to love our small towns!", "2018-08-30T18:54:50.000Z": "Look at these cuties going #Allin4Kristi at the State Fair!!", "2018-08-30T17:05:04.000Z": "I've heard from many SD truckers abt the challenges they're having with the ELD Mandate. Because of our efforts, the Transit Dept is now looking to offer some greater flexibility. Going from paper to electronic logs concerns truckers Truck drivers feel some stress as every second of their runs are recorded electronically. blackhillsfox.com", "2018-08-30T15:33:50.000Z": "Thanks for the kind words today, Zac, and for your vote!! #Allin4Kristi Aug. 30, 2018, letters Noem will be faithful to Trump agenda rapidcityjournal.com", "2018-08-30T14:20:05.000Z": "NEW THIS WEEK>> Pheasant populations are up 47% this year (which is tremendous news), but we still have a ways to go. I've proposed solutions to increase habitat and target predators. Learn more>> Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-08-30T00:57:41.000Z": "We need to get year-round E15 approved. I've told the president that when we've met. I've pushed the USDA and EPA to move much more quickly. We are making progress!! =  #ethanol  #e15 Quote Tweet Sec. Sonny Perdue @SecretarySonny Right before I took the stage with @USDA U/S Bill Northey, I got a phone call from @POTUS . He told me to tell the folks at #FPS18 that we'll soon straighten out #RFS . \n\nHere's what he told me:", "2018-08-29T21:30:04.000Z": "BREAKING >> America's economy grew by even MORE than originally thought. A great testament to what can happen when you lower taxes and cut regulations - the Republican principles I'll found my administration on. https:// goo.gl/DCNJzMT", "2018-08-29T18:30:04.000Z": "Thank you to @SDRTL for your trust and endorsement! I am proud to be #prolife . And if I have the honor of serving as your governor, I will work to proactively defend SD's pro-life policies. https:// goo.gl/xzJcSd", "2018-08-29T17:12:00.000Z": "Very grateful to be part of the Watertown Boys & Girls Club Grand Opening!! A very special place with a very special mission. A grand opening indeed After three years of planning, a year of construction, and five months of a capital campaign that netted $5 million, the new and improved Watertown Boys and Girls Club celebrated thepublicopinion.com", "2018-08-29T15:22:42.000Z": "Operation Rally Point is a plan for how we support and engage our veterans like we never have before. Learn more >> https:// kristiforgovernor.com/policy/operati on-rally-point/ ", "2018-08-29T01:15:30.000Z": "By expanding rural broadband, SD businesses can hire locally but do business globally; families can better connect with their doctors; and students can learn from teachers a world away. I believe in the power of rural broadband. RT if you agree!", "2018-08-28T18:37:10.000Z": "Thank you to Doug and Kathy Noem for hosting a wonderful meet and greet with farmers and ranchers from all over eastern South Dakota.", "2018-08-28T14:30:02.000Z": "Over the past 8 years, I've had an opportunity to forge relationships with tribal leadership and members. As governor, I want to build on that and continue working together to enhance tribal relations, empower folks through economic development, and more. Enhancing Tribal Relations Learn more about my plan today! kristiforgovernor.com", "2018-08-27T20:54:55.000Z": "The way I see it, serving our veterans is as much about thanking them for what they've done, as it is inspiring the next generation to serve. Please RT this article. Help me spread the word about what needs to be done for veterans in our state. Kristi Noem visits Hot Springs HOT SPRINGS - South Dakota's representative in congress and Republican nominee for governor Kristi Noem stopped in Hot Springs Thursday to unveil her plans to better serve the state's veteran rapidcityjournal.com", "2018-08-27T13:41:53.000Z": "Maintaining Hot Springs as \"The Veterans Town\" is a big priority for me. I'm proud of the fight we've put up to save the VA Hospital, and that South Dakota has put a world-class State Veterans Home there too. Read my full veterans agenda: https:// goo.gl/MuyucV", "2018-08-26T14:13:04.000Z": "John McCain lived in service to his country, to his family, to God. He was a role model that so many Americans, especially those serving in our military, could look up to and strive to become.  http:// foxnews.com/politics/2018/ 08/25/john-mccain-dead-at-81.html ", "2018-08-25T17:39:46.000Z": "What's left of my Chops Monster Cookie....I'm not proud I ate the whole thing but I highly recommend you get yourself one....  #pierre", "2018-08-24T19:55:49.000Z": "I want to make sure the SD Dept of Veterans Affairs are experts in public service. Click the link below to read more - and please help me spread the word: LIKE and SHARE my plan for our veterans now! Operation Rally Point Learn more about my plan today! kristiforgovernor.com", "2018-08-23T21:46:09.000Z": "Hot Springs is The Veterans Town. The entire community is dedicated to serving our veterans. So when I started thinking about where to release my proposal for veterans, there was no other place I could imagine doing it than Hot Springs. https:// facebook.com/308353252483/posts/10155480569542484/ ", "2018-08-23T20:47:48.000Z": "I'm announcing OPERATION: RALLY POINT. What is it? Click this link to learn more about my proposal to provide more resources and support to SD's 72,000 veterans >> https:// goo.gl/MuyucV", "2018-08-22T18:20:03.000Z": "Ready to head back to school? Study up on my education plan! It would also be a huge help if you could RT this and help me spread the word about what I'd like to accomplish. Improving Education's Impact Read more about my initiative to improve education's impact in South Dakota. kristiforgovernor.com", "2018-08-22T15:00:05.000Z": "Last year's historic tax cuts were a great start, but we can be doing even more on the state level to really boost our economy. Check out my Kickstarting the Economy Plan to learn more >>> Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-08-22T12:40:37.000Z": "Great day in Mitchell yesterday! #Dakotafest is always fun. Met w some dairy guys, stopped by Farm Credit Services, talked with KWAT & KORN. Saw Ag Unity was meeting, so dropped in to give an update on the farm bill / trade. Check out all the >> https:// facebook.com/308353252483/posts/10155477724892484/ ", "2018-08-21T21:50:05.000Z": "We were in Mitchell today, and there was just no way we were going to leave without stopping by Coburns! Bonnie made me the best tea, and it's always great to see Stan.", "2018-08-21T20:00:05.000Z": "A good internet connection can allow an entrepreneur to sell globally & hire locally. It gives families a better connection to their doctors & students to their teachers. Expanding rural broadband will continue to be a focus of my admin. South Dakota Well Wired for Broadband | Radio 570 WNAX Rural South Dakota is above average for wired broadband services. wnax.com", "2018-08-21T14:15:17.000Z": "With the start of a new school year upon us, I was grateful to visit with WNAX about some of my plans for South Dakota education. I'm excited about them. Take a listen & RT >>> South Dakota Republican Governor Candidate Kristi Noem; \"Passionate About Education\" | Radio 570... Getting better results in the state's classrooms without raising taxes is a goal of republican Governor candidate Kristi Noem wnax.com", "2018-08-19T22:55:03.000Z": ". @LIFERunners1 make it their mission to make sure all can run with endurance, the race God set before us. Thanks for supporting life. I'm optimistic we're close securing permanent protections for the unborn. As gov,I want to make sure SD can play a leading role in that effort", "2018-08-19T13:30:06.000Z": "Do we not have the BEST team?! They work so hard to get our message out and still take the time to make the trailer shine for parades and fairs. They're keepers.", "2018-08-19T12:36:16.000Z": "A few strong governors, who are willing to do big things, can change this country. There's no better place for that kind of governor than SD. We're small, meaning we're nimble & able to go after the big things. I'll talk about this (and more) on @FaceTheNation around 9:30am-CT.", "2018-08-19T11:44:48.000Z": "TODAY: don't miss our interview of @KristiNoem who could become her state's first female governor https:// cbsn.ws/2vXuOYY", "2018-08-19T00:16:55.000Z": "What an amazing crew at the Riverboat Days Parade! Thank you for the incredible support, encouragement, and commitment to being #Allin4Kristi !! https:// facebook.com/308353252483/posts/10155470518302484/ ", "2018-08-17T01:43:03.000Z": "Kenners and I took in the Turner County Fair tonight. Such a wonderful group of people! Thank you for the kind words and support tonight!", "2018-08-16T15:33:24.000Z": "Clint and the folks at Millborn Seeds are the best. Grateful for lunch this week and everything they do to provide conservation, habitat, and cover crops for landowners nationwide.", "2018-08-15T17:49:21.000Z": "There's an E30 Challenge going in Aberdeen right now! Take it! We filled up right outside there at Mina Lake. It's important we lead by example with programs like this. I'll do that as Governor, working to transition the state fleet to higher ethanol blends, such as E-30. =", "2018-08-15T13:14:00.000Z": "We had a wonderful time at the Brown County Fair last night! You'll have to check it out! Of course, when you do, don't forget to stop by the Brown County Republican Booth.", "2018-08-12T21:45:04.000Z": "Look at this Kristi Crew in Geddes! Thanks for the support this weekend! #Allin4Kristi", "2018-08-11T18:19:45.000Z": "Some of my favorite people (and treats!) at the Castlewood Days Parade today! https:// facebook.com/308353252483/posts/10155455787342484/ ", "2018-08-11T17:28:42.000Z": "Look who I ran into at the Castlewood Days parade! It's starting to be a tradition Good to see you @ColeVanBockern and @GunnarJohnson10 .", "2018-08-09T19:31:48.000Z": "In honor of #Sturgis >>> #TBT to last year's Freedom Ride. Have a fun (and safe) time at the Rally!", "2018-08-08T23:42:34.000Z": "A great day at the Sioux Empire Fair's Ag Appreciation Day. From our food to our fuel, we have a lot to thank farmers and ranchers for.", "2018-08-08T20:28:13.000Z": "Kennedy made me post this as payback for all of the videos I've posted of her. (hey, at least everyone can see how much fun we had at the Sioux Empire Fair)", "2018-08-08T19:55:31.000Z": "We had a tremendous discussion about cybersecurity in Madison today. With DSU developing one of the nation's best cyber workforces, we have a huge opportunity to attract state-of-the-art businesses that will keep our kids here for decades to come.", "2018-08-04T20:45:11.000Z": "So grateful to everyone who walked in Aurora, Carthage, and Burke today! I hope you know how much it means to me that you've gone #Allin4Kristi !", "2018-08-04T13:08:49.000Z": "Great to be in Sturgis yesterday to honor Neil Hultman. The only Rally he's missed was the one that happened when he was serving in Korea. A true patriot and one of the Sturgis Motorcycle Rally's greatest ambassadors.", "2018-07-27T16:51:48.000Z": "They said it couldn't be done... But the economy grew at 4.1% last quarter. Please RT and help me spread the good news. We need to show people that deregulation and tax cuts work. Let's keep this momentum going. https:// goo.gl/k2pi1y", "2018-07-27T13:37:29.000Z": "Team Noem was in Flandreau last night at the Moody County Parade! Always a great one. Wish I could have been there too. #Allin4Kristi", "2018-07-26T14:30:20.000Z": ". @GoJacksSDSU is one of eight teams selected in the U.S. Bank Stadium Basketball Classic this fall! #GoJacks ! South Dakota State among eight teams participating in U.S. Bank Stadium Basketball Classic South Dakota State is one of eight men's basketball teams selected to play in the U.S. Bank Stadium Basketball Classic this fall. argusleader.com", "2018-07-26T13:18:45.000Z": "Farmers want to do what we do best: Grow the world's food. And that's exactly what @realDonaldTrump 's announcement to expand soybean exports to Europe lets us do.", "2018-07-25T13:22:50.000Z": "Teen Age Republicans have been out in force this week. THANK YOU!! #Allin4Kristi", "2018-07-23T14:53:40.000Z": "THANK YOU Milbank!! #Allin4Kristi", "2018-07-22T19:51:46.000Z": "We had a great day in Custer's 'Gold Discovery Parade.' Five people deep on both sides of the street!", "2018-07-22T01:55:59.000Z": "Thanks to the team in Mitchell for coming out to support Team Noem today!! #Allin4Kristi", "2018-07-17T19:50:08.000Z": "Incredible to see so many volunteering at the D.C. Booth Fish Hatchery this summer! Just another reason why it was so important that we fought to save this piece of South Dakota tourism! Volunteers Travel to Help Hatchery in South Dakota Nearly a dozen couples volunteer for the summer at the D.C. Booth Historic National Fish Hatchery and Archives in Spearfish. usnews.com", "2018-07-16T21:55:00.000Z": "I am deeply concerned about China's retaliation against American farmers and ranchers. The ag economy has been down for a number of years. We cannot bear the brunt of the retaliation.", "2018-07-15T15:42:56.000Z": "So much gratitude for the supporters who walked in the Valley Springs parade yesterday as well as the law enforcement officers who made sure it all went off without a hitch!", "2018-07-14T19:13:22.000Z": "Thanks for all the support in Wall today! Quote Tweet Lt. Governor Larry Rhoden @lgrhoden Great day in Wall today! Thanks to everyone who came and went #Allin4Kristi !", "2018-07-13T18:48:08.000Z": "Isn't she the sweetest?! Congratulations to Larry and Sandy on becoming grandparents again! Quote Tweet Lt. Governor Larry Rhoden @lgrhoden We are very proud grandparents once again! Meet Sully Jane Rhoden. She's already stolen her brother's heart (and maybe her old grandpa's too).", "2018-07-13T15:29:20.000Z": "The secret's out! South Dakota has been named the best state to retire - and for good reason. Between our low taxes, low cost of living, and overall well-being, it's no wonder why we earned the title! Why South Dakota is now ranked the best state to retire South Dakotans reportedly enjoy not only a low tax burden, but they're also more satisfied with life. foxbusiness.com", "2018-07-12T00:20:46.000Z": "Thanks @BrownCountyGOPS for the warm welcome you gave Larry today! Quote Tweet Lt. Governor Larry Rhoden @lgrhoden Great turnout at the @BrownCountyGOPS Lunch today where I got to talk a bit about Kristi's Four Pillars of Protection (oppose tax hikes, limit government, fight federal overreach, and increase transparency). Thanks for inviting me.", "2018-07-11T18:58:52.000Z": "Another victory for SD energy consumers: @XcelEnergySD will be providing $10.9 million in rebates as a result of the historic tax cuts we enacted with @realDonaldTrump . Xcel Energy to distribute $10.9M in rebates to South Dakota customers The estimated refund for a residential customer will average approximately $55.73, but will vary based on each customer's actual usage. dakotanewsnow.com", "2018-07-11T16:25:08.000Z": "Good group to grab a coffee with in Aberdeen today.", "2018-07-10T15:26:25.000Z": "You're right, @TomHanks ! We're in a league of our own. We have many green miles, but the burbs are nice too. It's a big state, but once you get to the terminal, we'll make sure you can do that thing you do! Quote Tweet Tom Hanks @tomhanks The most optimistic stories, about America! Non-fiction, personal May move to Sioux Falls, at least visit. Rapid City, too.  Others!  Hanx", "2018-07-09T16:45:06.000Z": "Are you a @bhenergy customer? Reduced rates and refunds are on the way as a result of the historic tax cuts we made last year. Tax reform is making an impact and keeping more $$ in your pocket. Black Hills Energy to share federal tax breaks with customers PIERRE | Black Hills Energy has proposed refunding more than $7.6 million to South Dakota customers this year and reducing rates $8.9 million for 2019 and each year after. rapidcityjournal.com", "2018-07-05T01:50:05.000Z": "It was sure something to be in Deadwood, surrounded by dozens and dozens supporters, celebrating our hard-fought independence. Thank you!! #Allin4Kristi", "2018-07-05T00:52:38.000Z": "We had a blast in Lead! Happy Independence Day everyone!! #Allin4Kristi", "2018-07-04T20:45:05.000Z": "Thank you so much to my friends and family in Watertown who walked in today's Independence Day parade. That was really special. Thank you. #Allin4Kristi", "2018-07-04T19:54:21.000Z": "Spearfish knows how to celebrate our independence! Thank you for letting us be part of this wonderful parade. #Allin4Kristi", "2018-07-04T19:50:05.000Z": "Blown away by the statewide support today! Thanks to those in Lennox who went #Allin4Kristi !", "2018-07-04T18:50:05.000Z": "Thanks for the support in Sioux Falls today! #Allin4Kristi", "2018-07-04T18:21:29.000Z": "A few more from this morning in Belle Fourche! Thanks for all the support! #Allin4Kristi", "2018-07-04T17:50:03.000Z": "Happy Independence Day from the Belle Fourche parade! Thank you for the overwhelming support!! #Allin4Kristi", "2018-07-04T17:32:50.000Z": "They parade in style in Miller!  #Allin4Kristi", "2018-07-04T16:17:35.000Z": "Great group in Gregory today! Thanks for the support! #Allin4Kristi", "2018-07-04T15:21:26.000Z": "Wow! Supporters are ready to roll in Ft. Pierre! Thanks team! #Allin4Kristi", "2018-07-04T13:30:07.000Z": "Today, we celebrate those who have fought for our independence and liberty throughout American history - from our Founding Fathers to the men and women in uniform today.  We are so blessed to live in this nation of ours. Happy Independence Day!", "2018-07-04T02:28:47.000Z": "Thanks for the support in Mobridge today!!  #Allin4Kristi", "2018-07-04T01:57:24.000Z": "Look at these AWESOME helpers in Akaska tonight! Thanks guys!! #Allin4Kristi", "2018-07-04T01:00:13.000Z": "Kristi, our families, and I spent some time in Belle Fourche today. They always put on a good rodeo.", "2018-07-03T20:15:51.000Z": ".@rhodenforsd gets the vision, which is grounded in a commitment not to raise taxes or grow government, as well as a promise to fight federal overreach and increase transparency. Proud to have Larry on the team as our Lt. Gov. candidate. https:// goo.gl/ssNvJo", "2018-07-01T16:35:57.000Z": "The team had an AMAZING time at Irene's 125th Anniversary celebration this weekend!", "2018-06-27T19:51:32.000Z": "We can't fix this country from D.C. It's going to take a few strong governors to change the way things are done, to better take care of people, and to set the example for what really can be accomplished. Candidate Profile: Kristi Noem Editor's Note: Kristi Noem was elected governor of South Dakota on November 6. She is the state's first female governor.   By Lucy Powers NFRW 2018 Kabis... nfrw.org", "2018-06-26T20:08:04.000Z": "If a person is fired for falsifying information, they shouldn't be rehired. Seems like commonsense, but it isn't how the IRS has operated in the past. Proud that my legislation to stop this practice is advancing. House committee passes Noem's bill prohibiting rehiring of formerly fired IRS employees - Ripon... The U.S. House Ways and Means Committee has approved a proposal from U.S. Rep. Kristi Noem (R-SD) that would prohibit the Internal Revenue Service (IRS) from rehiring former employees who had been... riponadvance.com", "2018-06-26T17:07:45.000Z": "Proud to support this case. No law should force you to deny your religious convictions. #prolife Quote Tweet SD Right to Life @SDRTL https:// facebook.com/sdrighttolife/ posts/1723175791107372 ", "2018-06-24T21:49:52.000Z": "Team Noem did a great job in the Quarry Days Parade in Dell Rapids this weekend! Thank you!! #Allin4Kristi", "2018-06-24T01:03:53.000Z": "Wonderful evening at the @SDCattlemen Prime Time Gala. Thank you to everyone who helped support Feeding South Dakota tonight!", "2018-06-23T18:00:05.000Z": "Think you've gotten to know @RhodenForSD over the last few days? Head over to my Facebook page to test how much you know about our Lieutenant Governor candidate!", "2018-06-23T17:13:16.000Z": "Proud to be joined by @rhodenforsd on the November ballot! We can do some big things in South Dakota, and it's encouraging to start seeing a team come together that can accomplish our vision. Thank you for the support and encouragement. Quote Tweet South Dakota GOP @sdgop Huge turnout at South Dakota Republican State Convention. 620 Total delegates with over 100 guests. We packed the room and just nominated Larry Rohden @larryfor as our Lt. Governor Candidate to join @KristiNoem on the ballot!", "2018-06-22T17:41:53.000Z": "It's Follow Friday! Get a behind-the-scenes look at running for Lieutenant Governor from Larry Rhoden >> @RhodenForSD", "2018-06-21T21:13:01.000Z": "Good news! The House just passed the Farm Bill, which has strong livestock disaster and crop insurance programs included. The legislation still needs to be considered by the Senate before being sent to President Trump to sign, but this is a big step forward.", "2018-06-21T19:46:30.000Z": ". @KristiNoem 's presented a strong agenda based on the same conservative values that I hold dear. I'm truly humbled to be on this team.", "2018-06-21T16:09:24.000Z": "#TBT to hunting with Larry Rhoden a few years back. @rhodenforsd", "2018-06-20T23:01:34.000Z": "Head over to Facebook and test your knowledge! See how much you know about @RhodenForSD! https:// bit.ly/2yqkXPb", "2018-06-20T21:06:06.000Z": "Just wrapped up an interview with @kotatweets to talk about @KristiNoem 's vision for South Dakota and what my role in it would be as Lieutenant Governor. Tune in tonight to see the full interview.", "2018-06-20T19:48:20.000Z": "Thank you, Governor. Quote Tweet Dennis Daugaard @dennisdaugaard Congrats to @KristiNoem on her selection of Larry Rhoden as her running mate. Larry is an outstanding legislative leader and he will be an excellent lieutenant governor! @rhodenforsd", "2018-06-20T17:51:57.000Z": "Larry Rhoden will be an excellent Lt Governor. He's a friend and a true leader. Good pick, @KristiNoem . @rhodenforsd (dj)", "2018-06-20T15:04:16.000Z": "Meet the family. My wife, Sandy, and I have four boys, two daughters-in-law, and one grandchild (with another on the way in July). #MeetLarryRhoden", "2018-06-20T15:07:26.000Z": "\"Larry, like most ranchers, is plain spoken, direct, and honest,\" @KristiNoem , Republican candidate for #SouthDakota governor, said. Larry Rhoden is her pick for lieutenant governor. https:// aberdeennews.com/news/local/noe m-selects-rhoden-as-lieutenant-governor/article_8af6ed2f-93e5-564f-8b88-eaa80c7023e3.html?utm_medium=social&utm_source=twitter_AberdeenNews ", "2018-06-20T15:19:55.000Z": "The ticket of @KristiNoem and Larry @RhodenForSD is the first in #SDHistory to feature two farmers or ranchers. Larry Rhoden is Noem's running mate Kristi Noem announced today her selection of Larry R. Rhoden as her running mate. She will ask the the State Republican Convention to officially nominate Rhoden for lieutenant governor this weekend sodakgovs.wordpress.com", "2018-06-20T13:35:28.000Z": "I'm so proud to announce... I've chosen Larry Rhoden for Lieutenant Governor! @rhodenforsd Quote Tweet Lt. Governor Larry Rhoden @lgrhoden . @KristiNoem is fighting for something bigger than herself. She expects the same of those in her administration. Proud to be part of the team, as the candidate for Lieutenant Governor. #Allin4Kristi", "2018-06-18T18:52:30.000Z": "Great to have the support of Sioux Falls' new mayor! Thank you, Paul! I look forward to working with you as we create more opportunities throughout South Dakota. https:// goo.gl/BJFSvH", "2018-06-17T20:10:45.000Z": "Today, tribal members in SD are receiving life-threatening 'care' from a broken Indian Health Service. That needs to change - urgently. Click the link to learn more about my reform bill>> Noem bill pushes for better medical staff on reservations Earlier this week the House Natural Resources Committee voted to approve a bill sponsored by Rep. Kristi Noem that aims to recruit better medical staff to Native American reservations. rapidcityjournal.com", "2018-06-17T14:00:07.000Z": "Bryon can be the funny guy, but also a serious motivator. He teaches the kids to be tough and self-sufficient, while making sure they love the Lord. We are so grateful for him! Happy Father's Day!!", "2018-06-16T20:48:40.000Z": "Straight from Garretson! #Allin4Kristi  #parades", "2018-06-16T19:11:46.000Z": "Thanks for the support in Highmore today!! #Allin4Kristi", "2018-06-16T18:38:06.000Z": "Sorry I had to miss the Tea Pot Day Parade! It's a good one! Had some great people there though to represent the team! #Allin4Kristi", "2018-06-15T22:04:43.000Z": "Great Czech Days Parade in Tabor! Thanks to everyone who came out to support Team Noem! #Allin4Kristi", "2018-06-14T16:08:32.000Z": "Wishing a very happy birthday to my fellow tax reform warrior... President @realDonaldTrump !", "2018-06-07T18:45:24.000Z": "It's time to look toward November. My commitment to you remains rooted in 4 Pillars of Protection: No tax increases, smaller government, more transparency, and less federal intrusion. https:// goo.gl/GhYiSM", "2018-06-07T17:46:05.000Z": "Still have a yard sign up? Please stash it in your garage, because we'll need them again before too long! Thanks so much!", "2018-06-06T16:49:54.000Z": "Where it all began! Vic and Eva are proudly wearing their Kristi T-shirts at Kones Korner today. #Allin4Kristi", "2018-06-06T13:31:58.000Z": "Thank you for giving me the opportunity to share our vision of a more prosperous future for South Dakota - a vision where all our kids can come home to communities that look out for one another and solve problems together. I am incredibly grateful.", "2018-06-05T22:59:10.000Z": "Get your chores done and get out to vote! (Yes, it's true... it be a big day today, but that doesn't mean I got out of chores! We needed horse feed... what can I say?!)", "2018-06-05T22:00:06.000Z": "Don't forget to vote! There are only 2 hours left to vote in today's primary. With your support, we can win this and bring genuine accountability to Pierre. Head to your polling location before time runs out and vote Kristi for Governor! https:// goo.gl/Ck2Ofe", "2018-06-05T21:27:29.000Z": "Honk if you see Team Noem in Sioux Falls! #Allin4Kristi", "2018-06-05T21:08:32.000Z": "Way to go!! Thank you for the support! #Allin4Kristi", "2018-06-05T20:33:13.000Z": "I have been thrilled by the excitement and energy we've felt in the weeks leading up to today's primary. Let's translate this excitement into votes! Polls are open! Take a moment to go to your polling place and submit your ballot. Thank you! Noem Visits Sioux Falls on All In Tour youtube.com", "2018-06-05T19:06:11.000Z": "Our Rapid City team is out in full force today! Honk if you see them!! #Allin4Kristi", "2018-06-05T16:00:04.000Z": "Lunch plans? Take a walk and GO VOTE! Polls are open and I'd appreciate your support and your vote. https:// goo.gl/Ck2Ofe", "2018-06-05T12:46:59.000Z": "Great day to get out and vote! For Governor, hands down @KristiNoem is the right person! She has everything this great state needs to lead us the next 4 years!! #Allin4Kristi", "2018-06-05T06:06:22.000Z": "The blood, sweat and tears were worth it for every memory made, friendship created and mile traveled around this great state. #allin4kristi Vote for @KristiNoem", "2018-06-05T15:06:19.000Z": "Pretty special to be able to vote with my mom and one of my daughters today (and I'm glad Booker could come along too). #3generations  #Allin4Kristi  #TakeYourFamilyToVote >>Polls are open until 7PM!!", "2018-06-05T14:52:54.000Z": "Madison and Allison are being ROCKSTARS in Pierre! Thanks to you both! #Allin4Kristi", "2018-06-05T13:05:58.000Z": "25+ years as a farmer, rancher & small business owner. The last 7.5 have been fighting as a farmer in the House, delivering historic tax cuts, approving a 5-year Farm Bill, & working with @POTUS to defund PP. I'd be grateful to serve as your gov. Go Vote! Experience | Kristi for South Dakota youtube.com", "2018-06-05T03:00:45.000Z": "I am so grateful for this community. They've been there through the worst of the worst and in our happiest days. They've watched over our kids, opened their homes, and surrounded us in prayer. Thank you for being along for this wild ride. #Allin4Kristi  https:// facebook.com/kristiforgovernor/posts/10155312497427484 ", "2018-06-05T01:05:27.000Z": "It was a beautiful night in Brookings! We feel incredibly blessed to have so many people praying for us and supporting us in this journey. Wow. Thank you. #Allin4Kristi", "2018-06-04T22:53:13.000Z": "Thank you Sioux Falls! The energy in this room was absolutely electric. #Allin4Kristi", "2018-06-04T20:07:04.000Z": "Yankton came out in full force! I hope you know just how grateful my family and I are for your support ahead of Tuesday's primary. #Allin4Kristi", "2018-06-04T19:45:33.000Z": "#Allin4Kristi", "2018-06-04T19:22:49.000Z": "$8M, that's a BIG number... Since Jackley took over at the AG's office, that's how much more SD taxpayers are paying. Jackley spends beyond his means as the state's top gov lawyer & we can bet he'll do the same in any office. See the numbers yourself! Release - FACT CHECK: Jackley Can't Balance a Budget FACT CHECK: Jackley Can't Balance a Budget AG's Office costs taxpayers $8 million more today than when Jackley took office SIOUX FALLS, S.D. - In Marty Jackley's latest false attack on Noem, the... dakotawarcollege.com", "2018-06-04T18:21:20.000Z": "Having a little too much fun on the bus!  #Allin4Kristi", "2018-06-04T17:06:12.000Z": "How cute is he?! He's been going around encouraging people to vote Kristi for Governor!! Thanks for the support! #Allin4Kristi", "2018-06-04T17:00:14.000Z": "We had such wonderful support in Chamberlain! Thanks to the 40+ people who came out to cheer on our All In Tour! Before we left town, we HAD to snap a few pictures at Dignity too! #Allin4Kristi", "2018-06-04T16:50:05.000Z": "\"Only Noem can turn the page by her very presence.\" I'm ready to bring a new era of genuine accountability to our state government. Thank you, Argus Leader, for recognizing my commitment to a new way of governing.", "2018-06-04T15:30:04.000Z": "Tuesday, June 5 is the South Dakota primary election (yes, that's tomorrow!), and I'm asking for your support and vote. Find your polling location now! Voting starts bright and early at 7AM https:// goo.gl/Ck2Ofe", "2018-06-04T14:47:06.000Z": "Religious liberty is a right that's been enshrined in our Constitution for us & our children. Today, that right was reaffirmed by SCOTUS. I signed on to a formal brief in support of this outcome. Grateful our Constitution was read as originally intended. https:// usatoday.com/story/news/pol itics/2018/06/04/supreme-court-rules-against-gay-wedding-exemptions/1052989001/ ", "2018-06-04T12:51:41.000Z": "#PageOne : @RepKristiNoem listed her #SouthDakota -raised resume and concentrated on undecided voters in the waning hours of the race. At a casual meet and greet Saturday in #AberdeenSD , she also reiterated her four-part platform - take a look: https:// aberdeennews.com/news/local/noe m-treks-across-south-dakota-prior-to-gop-governor-s/article_bc4fdfa1-ed2d-5e5b-a82c-5da5f34cfd34.html?block_id=475371&utm_medium=social&utm_source=twitter_AberdeenNews ", "2018-06-04T13:48:50.000Z": "No trip West River is complete without donuts from Wall Drug! (What can I say, we saw a sign for free ice water!) #Allin4Kristi", "2018-06-04T13:48:04.000Z": "Rapid City... you blew me away! Thank you so much for the support at last night's rally. Your prayers and encouragement have been such a blessing to me and my family. Thank you! #Allin4Kristi  https:// facebook.com/kristiforgovernor/posts/10155311237492484 ", "2018-06-04T12:16:53.000Z": "Heading out on Day 2 of our All In Tour with Black Hills Bagels! #Allin4Kristi", "2018-06-03T21:25:59.000Z": "THANK YOU MOBRIDGE!! Your support means the absolute world to me. #Allin4Kristi", "2018-06-03T19:30:05.000Z": "Thank you, Argus Leader, for recognizing my efforts to reduce taxes for South Dakota families by working with President Trump. As governor, I'll continue the fight for lower taxes, and less government intrusion!", "2018-06-03T19:11:01.000Z": "So proud of my brothers! Quote Tweet SD Game Fish & Parks @SDGameFishParks Rob and Rock Arnold farm near Hazel, South Dakota. With the help of a habitat advisor, the fourth generation farmers use the CRP programs to improve grassland habitat on their land. #HabitatPays  http:// ow.ly/HNcy30kiFsW", "2018-06-03T18:43:25.000Z": "Having a \"roaring\" time on the #allin4kristi bus tour. come see @KristiNoem   Mobridge 6/3 @ 3PM Rapid City 6/3@ 7PM MT Chamberlain 6/4 @ 10AM Yankton 6/4 @ 1:30 PM Sioux Falls 6/4 @ 4:30PM Brookings 6/4 @ 6:45PM Watertown 6/4 @8 :15PM", "2018-06-03T18:49:13.000Z": "You know your friends know you when they text you this days before the primary. Thank you, Holly!! #Allin4Kristi  #Hosmer", "2018-06-03T18:26:32.000Z": "Thank you Aberdeen!! Wow! The excitement was incredible! I can imagine no better way to kick off our All In Tour! Thank you! #Allin4Kristi", "2018-06-03T18:05:04.000Z": "This is your last chance to get an absentee ballot for the June 5 primary election. Do you know what you need? Click this link now to make sure you're all set! https:// goo.gl/5X29wR", "2018-06-03T15:59:07.000Z": "So many great people at Wheel Jam in Huron last night! Thank you for the support and encouragement heading into the June 5 primary! #Allin4Kristi", "2018-06-02T22:04:42.000Z": "\"In a high-stakes showdown for the GOP nomination, one candidate offers the possibility of a bold new vision in state governance that might be too enticing to pass up. That candidate is Kristi Noem.\" - So honored to have the support of the Argus Leader!", "2018-06-02T21:27:08.000Z": "Dakota Niners = Team Kristi  #Allin4Kristi", "2018-06-02T21:05:09.000Z": "There is a role for everyone on Team Noem! Thank you all for stuffing envelopes this afternoon. I truly appreciate your time and your support as we move into the homestretch! #Allin4Kristi", "2018-06-02T20:39:53.000Z": "Thank you to the Morris family for sharing our vision for South Dakota in Mitchell!! #Allin4Kristi", "2018-06-02T18:09:04.000Z": "I have some of the world's best nephews!! Thank you Hunter and Gage for helping out and getting folks excited for the June 5 primary. #Allin4Kristi", "2018-06-02T17:47:16.000Z": "One of the best texts I've gotten in a while: She's proud of her \"Kristi\" sign & supporting in Sioux Falls! Madison has been learning about gov't in the 4th grade. She's intrigued w/ the thought of Kristi becoming the 1st female governor in SD.... that & she likes horses too .", "2018-06-02T15:26:42.000Z": "Having fun in Downtown Sioux Falls! What do you think? Do we look like the sculpture? #SculptureWalk  #SiouxFalls", "2018-06-02T15:24:02.000Z": "Love this! Teams are getting out the vote this morning! Join them by visiting http:// kristiforgovernor.com ! #Allin4Kristi", "2018-06-01T22:15:05.000Z": "The June 5 primary is on Tuesday!! I want to change Pierre, making it more transparent and accountable to you. I'd appreciate your vote to do that. Learn more >> https:// goo.gl/Ck2Ofe", "2018-06-01T21:21:13.000Z": "THANK YOU!!", "2018-06-01T20:31:39.000Z": "BREAKING NEWS>>> Argus Leader endorses Kristi Noem for the GOP Nomination! Proud that they see me as a \"loyal soldier for President Trump\" who has a \"bold new vision for state governance.\" Hit SHARE and help spread the good news! https:// amp.argusleader.com/amp/664509002", "2018-06-01T19:15:03.000Z": "I've been a lifelong farmer/rancher, & small biz owner. I've served in the state leg & represented SD in the House, gaining insight into how fed funds impact our state & changes we can make to better use them. I'm ready to come home & serve as SD's gov. Noem: SD is ready for a governor who can make change Republican candidate for governor, Rep. Kristi Noem, said the South Dakotans are ready for someone they can relate to who can actually make change. dakotanewsnow.com", "2018-06-01T18:53:58.000Z": "Thanks to Justin Nagel for sign waving in Pierre today!! (Love the t-shirt! ) #Allin4Kristi", "2018-06-01T17:14:39.000Z": "Awesome picture!! Love seeing these signs EVERYWHERE!! So thankful for the support! #Allin4Kristi", "2018-06-01T15:20:03.000Z": "Time is running out to request your absentee ballot for the June 5 primary! Click here and make sure you have one now >> https:// goo.gl/5X29wR", "2018-06-01T15:07:35.000Z": "Thank you, PJ!! Quote Tweet PJ Freidel @pjfreidel I don't think I've ever worked for a better boss!! And I definitely have never met anyone who loves the state of South Dakota and the people of South Dakota more than @KristiNoem ! Would be a huge mistake not to make her our next governor https:// twitter.com/kristinoem/sta tus/1002539029718552577 ", "2018-06-01T14:27:01.000Z": "Look at this crew!! Visit http:// kristiforgovernor.com to sign up and help them out in your area! #Allin4Kristi", "2018-06-01T14:10:01.000Z": "Who needs a bouquet when you have a Kristi for Governor sign? Congrats Taylor and Nathan - and thanks for the support!!", "2018-06-01T13:15:05.000Z": "SD has a real choice in the June 5 gubernatorial primary. I won't grow govt. I just don't think you need a govt board or commission to listen to people. Learn more and vote Kristi Noem on June 5. Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-06-01T12:56:24.000Z": "Watch a replay of the @martyjackley and @KristiNoem GOP gubernatorial debate and see more photos: https:// argusne.ws/2Ha3FVz", "2018-06-01T01:42:09.000Z": "I've talked a lot in this campaign about what it means to be a farmer, but no one can explain it quite like Paul Harvey. #GoodDay  https:// youtube.com/watch?v=AMpZ0T GjbWE ", "2018-06-01T01:32:13.000Z": "Thanks for tuning into tonight's debate! Team Noem signing off! #SDGovDebate", "2018-06-01T01:27:57.000Z": "#teamlaurel  #SDGovDebate", "2018-06-01T01:26:22.000Z": "Kristi's Sunshine Initiative reflects her priorities for transparency: Livestream meetings, end confidential settlements, modernize & expand http:// Open.SD.gov , and much more. Check it out>> https:// kristiforgovernor.com/policy/transpa rency-for-state-local-government/   #SDGovDebate Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-06-01T01:20:41.000Z": "Seeing our larger communities flourish is exciting, but Kristi wants to make sure we don't lose SD's rural culture either. As governor, Kristi will work to bring more resources in to rural areas, including rural broadband. Learn more: Rural Revitalization Initiative Learn more about my plan for rural South Dakota. kristiforgovernor.com", "2018-06-01T01:07:04.000Z": "Noem: \"My goal is not to add more people to Medicaid, my goal is to get people off of medicaid and into a health plan that works better for them and their family\" at sustainable rate.\n\nAlso working on fixes for Indian Health Services", "2018-06-01T01:09:27.000Z": "Kristi and @realDonaldTrump repealed the individual mandate, which is the first step in repealing Obamacare. Does Obamacare need to be fully repealed? Yes. But was the repeal of the individual mandate a win for President Trump and Kristi? Absolutely! #SDGovDebate", "2018-06-01T00:56:41.000Z": "Noem notes her background working in tourism. Says it's important that visitors who come to SD have a good experience, need to make sure SD families have more money in their pockets re: tax cuts/strong economy so they can take vacations", "2018-06-01T01:00:31.000Z": "Kristi Noem: \"We need a businessperson in the governor's office to really help our economy grow.\" #SDGovDebate", "2018-06-01T00:58:35.000Z": "Check out Kristi's Second Century Initiative to preserve the state's pheasant hunting tradition>> Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-06-01T00:57:08.000Z": "Did you know... Kristi Noem once owned and operated a hunting lodge in northeast South Dakota? She has the real business experience needed to understand the tourism industry's struggles and opportunities. #SDGovDebate", "2018-06-01T00:44:51.000Z": "Kristi: \"I think our law enforcement are rockstars.\" #SDGovDebate", "2018-06-01T00:44:16.000Z": "Kristi's Record: Successful farmer, rancher, small business owner / Supported a balanced budget all 4 years in state legislature / Cosponsored a Balanced Budget Amendment to the Constitution. >>FACT CHECK: Jackley's record? More spending. More government. #SDGovDebate", "2018-06-01T00:41:22.000Z": "South Dakota Veteran Don Ackerman talks about Kristi's work to keep the Hot Springs VA open. WATCH: Veterans for Kristi Visit https://kristiforgovernor.com/ to learn more. youtube.com", "2018-06-01T00:39:55.000Z": "Kristi's accomplishments are clear. A 5-year Farm Bill. Strong livestock disaster program. Historic tax cuts. Funding for Lewis & Clark. Combating the pine beetle. Expanding the Black Hills Natl Cemetery.  Kept the Hot Springs VA open. More>> https:// kristiforgovernor.com/accomplishment s/   #SDGovDebate Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-06-01T00:33:47.000Z": "Kristi's 4 Pillars of Protection >>No tax increases >>Protect you from a growing government >>Stop federal intrusion on our rights >>Make the state government more transparent https:// kristiforgovernor.com/policy/4-pilla rs/   #SDGovDebate Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-06-01T00:28:43.000Z": "\"We need to lift people into opportunity, not perpetuate poverty.\" Kristi is committed to implementing work requirements that help more South Dakotans get into a good-paying job. #SDGovDebate", "2018-06-01T00:25:19.000Z": "Check out Kristi's full public safety agenda. Ending the cycle of crime is a big priority. Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-06-01T00:18:58.000Z": "Noem: Immigrants are an important part of the workforce, especially in ag. \"But let me be clear: We need to have legal immigration, and we need to make sure that our southern border is secure.\" \n\nAlso says governors should decide state's participation in refugee programs", "2018-06-01T00:18:50.000Z": "On immigration, Kristi talks about the need to #SecureOurBorder and her work with @realDonaldTrump to build the wall. #SDGovDebate", "2018-06-01T00:12:16.000Z": "Q1: What are you going to do to help solve the workforce shortage?  >>Expose young kids to in-demand jobs early >>Embrace apprenticeships >>Streamline licensing. Check out the full plan here: https:// kristiforgovernor.com/policy/kicksta rting-the-economy/   #SDGovDebate Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-06-01T00:03:41.000Z": "Tonight's debate is beginning now and Team Noem is again taking over my Twitter account! Follow along to get live updates. Click below to watch live! Quote Tweet argusleader @argusleader Watch the debate here. https:// argusne.ws/2Ha3FVz", "2018-05-31T20:45:49.000Z": "The primary election is less than a week away, and I'm traveling all over South Dakota for our final push. I want you to have as much information as possible. Watch my interview with KOTA TV now to hear about the war on drugs in our state! Kristi Noem sprinting to the finish line The primary race for South Dakota governor is in its final days as both Republican candidates - Attorney General Marty Jackley and Representative Kristi Noem - sprint to the finish line. kotatv.com", "2018-05-31T19:54:25.000Z": "Busy day yesterday in Mitchell and Huron. It was a great day! Thanks for all the support. Thank you! https:// facebook.com/kristiforgovernor/posts/10155302880352484 ", "2018-05-31T13:43:54.000Z": "Live at 7: Watch as @martyjackley and @KristiNoem participate in GOP gubernatorial debate in downtown Sioux Falls. https:// argusne.ws/2kApYea", "2018-05-30T20:29:02.000Z": "The brave men and women of South Dakota's Ellsworth Air Force Base have successfully knocked out several Taliban narcotics facilities. Fantastic job! Ellsworth bombers strike Taliban drug facilities AL UDEID AIR BASE, Qatar | A B-1 bomber from Ellsworth Air Force Base's 34th Expeditionary Bomb Squadron bombed multiple Taliban narcotics production and storage facilities in Afghanistan during a rapidcityjournal.com", "2018-05-30T14:30:30.000Z": "I love this man. This isn't what he signed up for 26 years ago, but it means the world to me that he's willing to be such an incredible advocate and share a piece of our family with folks ahead of the June 5 primary.", "2018-05-30T03:51:20.000Z": "May God grant the families of South Dakota Rep. Jim Schaefer and his girlfriend Lois comfort tonight after such a terrible and sudden loss. May He give you strength in the days ahead and peace in the years to come.", "2018-05-30T01:57:52.000Z": "Team Noem signing off! Thanks for following along during the #SDPBDebate", "2018-05-30T01:54:33.000Z": "FACT CHECK: Kristi Noem has voted to fund @realDonaldTrump 's border wall. #SecureTheBorder  #SDPBDebate House approves spending bill with funds for Trump's border wall The House approved a national security-themed spending package on Thursday that includes $1.6 billion to start building President Trump's proposed border wall. thehill.com", "2018-05-30T01:51:51.000Z": "Noem discusses how she'll tackle crime and drugs as governor. Check out the full plan here >>> https:// kristiforgovernor.com/policy/communi ties-and-families/   #SDPBDebate Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-05-30T01:49:18.000Z": "Did you know... Kristi Noem would be the first farmer turned governor in decades? #SDPBDebate", "2018-05-30T01:33:51.000Z": "Kristi is committed to bringing genuine accountability to the state government. Learn more about Noem's transparency agenda: https:// kristiforgovernor.com/policy/transpa rency-for-state-local-government/   #SDPBDebate Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-05-30T01:31:43.000Z": "Noem: You don't have to grow government to listen to people. #SDPBDebate", "2018-05-30T01:21:59.000Z": "Noem discusses endorsement by leading pro-life organization @SBAList during #SDPBDebate", "2018-05-30T01:19:53.000Z": "FACT CHECK: South Dakota has experienced a 222% increase in drug crimes, according to data from the State Attorney General's office. https:// argusleader.com/story/news/pol itics/2018/05/14/drug-crimes-south-dakota-candidates-aim-rein-drug-use/597797002/   #SDPBDebate South Dakota gubernatorial candidates aim to rein in drug crime after offenses leap 222 percent in... South Dakota drug offenses tripled since 2008. Candidates vying for governor's office offer plans to curb drug use. argusleader.com", "2018-05-30T01:15:30.000Z": "FACT CHECK: Obamacare's individual mandate was repealed in tax reform, gutting Obama's legacy legislation. @TheHill said it \"fulfilled a longtime GOP goal.\" #SDPBDebate", "2018-05-30T01:07:08.000Z": "Noem: \"We need to grow our economy, and my kickstarting the economy plan will do just that.\" (Learn more: https:// kristiforgovernor.com/policy/kicksta rting-the-economy/  ) #SDPBDebate Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-05-30T01:01:44.000Z": "Hey everyone! Team Noem is taking over Kristi's page tonight to give you LIVE updates from the #SDPBDebate ! Follow along and watch LIVE on South Dakota Public Broadcasting!", "2018-05-29T23:30:02.000Z": "4 things to know before voting on June 5: I will not raise taxes + I won't grow govt + I'll fight federal intrusion on our rights and SD values + I'll make state govt more transparent. Would appreciate your vote! https:// goo.gl/Ck2Ofe", "2018-05-29T16:15:51.000Z": "Well... they keep it real.", "2018-05-29T14:23:16.000Z": "One week until the June 5 primary! You deserve to know exactly what it is your next governor wants to accomplish. I've laid that out in detail. Learn more here: https:// kristiforgovernor.com/policies/ And don't forget to vote Kristi Noem on Tuesday, June 5.", "2018-05-29T14:05:04.000Z": "The South Dakota primary election is on June 5, and I need your vote! Find out all the information on absentee voting here: https:// goo.gl/5X29wR", "2018-05-28T13:00:09.000Z": "May God richly bless those who have laid down their life. #MemorialDay \"Greater love has no one than this: to lay down one's life for one's friends.\" (John 15:13)", "2018-05-26T16:11:00.000Z": "Really incredible map showing the rising tide of suicide in SD (particularly West River): https:// goo.gl/bfYgfq I'm committed to expanding mental health services statewide as governor. Learn more at Kristi Noem for Governor Learn more about Kristi's campaign for South Dakota Governor! Check out our website and join the team. kristiforgovernor.com", "2018-05-26T02:44:06.000Z": "Fun night at the Legion baseball game in Rapid City! I had the chance to catch up with Pauline and watch Post 320 take on Post 22. Great game so far!", "2018-05-25T22:54:56.000Z": "Great news to help deliver as we head into the kickoff of South Dakota tourism season. Thank you @realDonaldTrump and @SecretaryZinke for listening to the needs of South Dakota's outfitters and guides! http:// yankton.net/news/state_ap_ sd/article_a910187a-f6fc-5065-a6fd-33e19978b456.html#ath ", "2018-05-25T20:34:25.000Z": "I stand by President Trump and the results he's delivered for the American people. He's cut taxes, cut red tape, and cut government. I'll do the same as governor.", "2018-05-24T21:44:57.000Z": "Thanks to leading pro-life organization @SBAList for endorsing me for governor! Proud to stand for the unborn, fight alongside @realDonaldTrump to defund Planned Parenthood, and push pro-life policy.", "2018-05-24T20:17:43.000Z": "Aren't they the best?! Thanks, kids, for helping explain my Four Pillars of Protection: >> No tax increases >> Control spending >> Stop federal intrusion >> Increase transparency. Watch NOW", "2018-05-24T01:16:36.000Z": "Aren't they the best?! Thanks, kids, for helping explain my Four Pillars of Protection: >> No tax increases >> Control spending >> Stop federal intrusion >> Increase transparency. Watch NOW", "2018-05-23T21:40:05.000Z": "There is still time to request your absentee ballot! Click this link to learn more now! https:// goo.gl/5X29wR", "2018-05-23T16:55:38.000Z": "Great news. We stand for our anthem. Quote Tweet Fox News @FoxNews JUST IN: NFL adopts policy to fine club if players and personnel don't stand for national anthem https:// fxn.ws/2s4a3sJ", "2018-05-23T10:28:20.000Z": "Happy 26th Anniversary Bryon! I am blessed with a wonderful husband who loves the Lord and his family. I am blessed to be his wife!", "2018-05-21T23:54:14.000Z": "I'm proud to be a #prolife woman, and I thank @realDonaldTrump for moving to cut funding to the abortion industry. We're moving in the right direction. Dozens of Pro-Life Women Legislators Back Trump's Rule Cutting Funding of Planned Parenthood... Today 40 state legislators who are members of the national pro-life group Susan B. Anthony List (SBA List)'s National Pro-Life Women's Caucus released a joi lifenews.com", "2018-05-21T14:59:20.000Z": "Hey! It's me, Kennedy. Look what I found! I don't know how my mom does it. The work she's put into being the best at her job doesn't go unnoticed. But even with everything on her plate, nothing gets in the way of her being an amazing mom. #ProudDaughter  https:// goo.gl/rpRvfJ", "2018-05-20T16:05:03.000Z": "I'll take a tractor over a plane any day. At least you have control over your own destiny!", "2018-05-19T21:50:16.000Z": "Thank you to everyone who has served.", "2018-05-19T20:14:00.000Z": "Democrats refuse to get people back into good-paying, in-demand jobs. Instead, they insist on keeping folks in welfare programs. It's hurting families - and now, farmers too. But I've been through this before. I do not quite. This debate is not done. http:// kelo.com/news/articles/ 2018/may/18/noem-scolds-democratic-opposition-of-farm-bill/ ", "2018-05-19T15:17:00.000Z": "Tax Cuts. Enough said. Mitchell firm reverses its layoffs. Here's why. Geothermal tax credits resulted in Enertech Global LLC hiring back workers at its Mitchell production facility. argusleader.com", "2018-05-17T18:15:19.000Z": "South Dakota is home. It's where we raised our family, made tough business decisions, and built our lives. We'll always be here.", "2018-05-15T23:10:04.000Z": "Have you completed your absentee ballot application for the June 5 primary? Here's what you need to know! https:// goo.gl/5X29wR", "2018-05-15T13:15:03.000Z": "Drug crimes have increased 222% in the last decade. I am proud of our law enforcement officers, but they need to be supported with state policies that help prevent drug abuse/violent crime. I won't pass the buck on this. I will tackle it head on as gov. https:// argusne.ws/2IlBV1N", "2018-05-15T02:27:20.000Z": "Thank you Lucas!!! Appreciate the support! #kristiforgovernor", "2018-05-15T01:54:03.000Z": "Thank you Union County Republicans! Wonderful Lincoln Day Dinner tonight in the Dunes hosted by Chairman Dan Lederman. Thank you for all your support. Don't forget to vote on June 5th! https:// facebook.com/kristiforgovernor/posts/10155270795812484 ", "2018-05-14T22:52:58.000Z": "Thanks to the SF Fraternal Order Of Police who met w me on my public safety plans. I've met with many area officers in recent months to dig into SD's growing crime/drug problem. Their continued insight will be invaluable as we lead the state to a safer future. Thanks for serving!", "2018-05-14T20:08:16.000Z": "Bryon & I are blessed with 3 incredible kids, who are surrounded by family that love them & invest in their edu & upbringing. The family unit is important. I'm committed to being a family-first gov to strengthen families & preserve SD values >> Family First Initiative Click here to read about my Family First Initiative for South Dakota kristiforgovernor.com", "2018-05-14T15:17:39.000Z": "Our law enforcement have some tough jobs - especially with the recent rise of violent crime and drug abuse. I'm proud to stand with our law enforcement officers who work hard to protect us. Thank you for your incredible service. #PoliceWeek", "2018-05-14T13:00:13.000Z": "There's always a way, if you're willing to think outside the box... (Take a look)", "2018-05-13T20:05:05.000Z": "It's vital we win the June 5 primary election. I need your vote! Please find out if voting absentee is for you by following this link: https:// goo.gl/5X29wR", "2018-05-13T16:10:40.000Z": "Oh my goodness... How has my mom impacted my life? Well, she made us a \"praying family.\" I'm so grateful for that, and for all the ways moms have impacted to world. From my family to yours, have a wonderful #MothersDay !", "2018-05-10T20:20:49.000Z": "Wonderful to see @realDonaldTrump boost opportunities for military spouses. It's going to take strong state leadership to help see his vision through. But if I'm elected, I'll find ways to fast-track military families through the licensing process, letting their experience count.", "2018-05-10T19:15:04.000Z": "The June 5 primary election is coming up quick! If you need an absentee ballot, please request one! https:// goo.gl/5X29wR", "2018-05-07T23:30:06.000Z": "This is a must-read. @RepKevinBrady (native SD/USD grad/ @WaysandMeansGOP Chair) had some wonderful words to share about his mom's impact at this wkend's USD commencement. Being a mom isn't always easy, but the mark you leave on this world is profound. USD: Motherly Advice VERMILLION - One of the most powerful men in Washington, D.C., told graduates of the University of South Dakota Saturday to heed the advice of individuals who are more influential yankton.net", "2018-05-07T20:15:04.000Z": "Check out my interview with Todd Epp. We talked about my opposition to tax increases and federal intrusion, resistance to new gov't boards/commissions, and support for transparency. My fav (and not so fav) movies come up too. https:// goo.gl/NrGgBV", "2018-05-07T16:53:43.000Z": "Thank you to all of those who work in corrections! The challenges you undertake transform lives and help protect our communities. Please join me in celebrating our corrections workforce as we mark National Corrections Week! https:// bit.ly/2wepuTH", "2018-05-07T15:15:04.000Z": "Have you voted absentee yet? There's still time to get your ballot! Here are all the details! https:// goo.gl/5X29wR", "2018-05-06T22:36:39.000Z": "The VFW Post 4736 Loyalty Day Parade in Brandon today was AMAZING! So many people honoring those who have served. We are proud of our veterans and grateful for their sacrifice and dedication. GOD BLESS YOU!  https:// facebook.com/kristiforgovernor/posts/10155254474677484 ", "2018-05-06T17:12:57.000Z": "Congratulations Faith Leiseth!!!! Super proud of you! New school record in discus and first place finish at Howard Wood!", "2018-05-06T01:39:20.000Z": "Roberts County Lincoln Day Dinner tonight was fantastic! Wonderful people, great speeches, prime rib AND bread pudding! Thank you to everyone for your hospitality, support, and friendship! You all are the best. https:// facebook.com/kristiforgovernor/posts/10155252948887484 ", "2018-05-05T22:13:25.000Z": "Thank you to the South Dakota Newspaper Association for hosting a debate today between the GOP Governor candidates. Great discussion...and I appreciated the opportunity to talk about South Dakota's future opportunities! https:// facebook.com/kristiforgovernor/posts/10155252646767484 ", "2018-05-05T14:00:03.000Z": "I need your support if we're gong to win the June 5 primary. If you need to request an absentee ballot, please do so now! https:// goo.gl/5X29wR", "2018-05-05T13:30:47.000Z": "I love our state. It's all I've ever known, so I was thrilled to share a glimpse of what our way of life looks like and some of the big ideas I have for South Dakota with the country last night. Click below to watch the whole thing. Kristi Noem aims to break South Dakota's glass ceiling Kristi Noem is trying to make it from her family's farmhouse to the South Dakota governor's mansion as the state's first female chief executive. cnn.com", "2018-05-05T02:43:28.000Z": "Great to chat with @RepKevinBrady (SD native and @WaysandMeansGOP Chair) about the impact our massive tax cuts are making on families. WATCH and learn more Kristi Noem on Facebook Watch Kristi Noem was live. facebook.com", "2018-05-04T14:15:04.000Z": "Our small businesses are the backbone of SD, making up 99% of the businesses in the state! It's up to us to fight for the kind of government that encourages their growth. My Kickstarting the Economy Plan will do just that! #SmallBusinessWeek", "2018-05-04T03:39:45.000Z": "This lady right here is a prayer warrior. Thank you to all those who continuous lift up this country in prayer. It makes a difference. God bless you! #NationalDayofPrayer2018", "2018-05-04T03:37:26.000Z": "I'm so glad we were all there to help Cindy replace fuses in her vehicle tonight. I have no idea what she would have done with us.  #zesto  #zestoisthebesto", "2018-05-03T18:05:07.000Z": "My family has managed a hunting lodge, a farm, and a restaurant. I saw firsthand what's involved in the day-to-day aspects of owning your own business. I want to take that experience and apply it as South Dakota's next governor. #SmallBusinessWeek", "2018-05-03T15:12:27.000Z": "Rise and Shine! Thank you to Volunteers of America Dakotas for sharing testimonies of people impacted by your work in South Dakota. Proud to support you! #VOA", "2018-05-03T13:56:11.000Z": "One of the most incredible gifts God gave us was the ability to have a personal relationship with Him. I can't tell you how many times that gift has transformed me. What has prayer meant to your life? Reply and let me know. #NationalDayOfPrayer", "2018-05-02T16:42:01.000Z": "It's #SmallBusinessWeek ! SD does a lot right when it comes to growing local biz, but there's untapped potential too. Check out my Kickstarting the Economy plan to see what economic development would look like if I, as a lifelong small biz owner, am gov. https:// bit.ly/2Fz4oyQ", "2018-05-02T12:56:41.000Z": "Thank you to Don and AFP for hosting the forum last night in Sioux Falls! I appreciated the opportunity to share my experience and vision for South Dakota. #sdgop  #SiouxFalls  #americansforprosperity", "2018-05-02T12:54:43.000Z": "Congratulations on the victory Paul! Excited about your leadership in Sioux Falls! #SiouxFalls", "2018-05-01T20:10:47.000Z": "The Governor gave such a great speech at Lake Area Tech today I forgot to take many pictures! Oh well... Our technical schools are doing amazing things for students and employers by connecting training to opportunity. Proud to be there today! https:// facebook.com/kristiforgovernor/posts/10155244178782484 ", "2018-04-28T16:25:04.000Z": "Absentee voting for the June 5 primary election is underway NOW! Have you applied for a ballot? Find out all the details here: https:// goo.gl/5X29wR", "2018-04-27T22:45:04.000Z": "We don't need more govt. And that's an important distinction: \"The Republican candidates for SD governor take opposite sides over creating more state govt boards, commissions & task forces. State AG Jackley plans to use them while Rep. Noem rejects them.\" In split from Jackley, Noem stands against any new state boards PIERRE - The Republican candidates for South Dakota governor take opposite sides over creating more state government boards, commissions and task forces. thepublicopinion.com", "2018-04-27T19:46:09.000Z": "Great to see the Prairie AquaTech expansion in Volga. Innovative companies like this are exactly what we need to recruit to South Dakota, and as governor, my Kickstart the Economy agenda is designed to ensure businesses like this can grow in South Dakota! Prairie AquaTech to expand; building new plant in Volga BROOKINGS - Prairie AquaTech, a successful start-up business founded in Brookings in 2012 will be building in Volga about 5 miles west of Brookings and next to one of its several vital \"village\"... brookingsregister.com", "2018-04-25T22:05:29.000Z": "The ability to be thrifty, to budget, to predict - those are things I've always appreciated about farmers and ranchers. That kind of understanding is something I will bring to the governor's office.", "2018-04-25T19:03:53.000Z": "From historic tax cuts to a Farm Bill that delivered strong crop insurance and livestock disaster programs, I've worked to produce real results for South Dakota. I'll take that same drive with me to the governor's office to deliver big results for South Dakota.", "2018-04-24T20:35:36.000Z": "SD's crime rate nearly doubled between 2005 & 2015. To better enable law enforcement success in the field, improvements in our approach to mental health & criminal justice are needed. See my plan to make communities safer &  families stronger >> https:// bit.ly/2KayMD6", "2018-04-23T20:00:05.000Z": "Between a drought and poor prices, South Dakota's farm economy has taken a significant hit. For many producers, the #FarmBill has provided a necessary safety net. Proud to see steady progress being made on the next Farm Bill. 2018 Farm Bill draft released by Noem, Thompson, Moolenaar, House Ag Committee - Ripon Advance U.S. Reps. Kristi Noem (R-SD), Glenn 'GT' Thompson (R-PA), John Moolenaar (R-MI) and members of the U.S House Agriculture Committee on April 12 introduced a bipartisan draft of the 2018 Farm Bill... riponadvance.com", "2018-04-23T14:00:03.000Z": "Great to talk with @MomentSDPB this week about the #FarmBill . Listen and learn the latest progress >> Representative Kristi Noem Discusses Farm Bill In The Moment ... April 18, 2018 Show 318 Hour 1 Can Congress make a deal on the 2018 Farm Bill, or will partisanship derail the efforts? The 2018 Farm listen.sdpb.org", "2018-04-21T00:30:05.000Z": "As governor, I plan to throw open the doors of the state capital and encourage county commission offices and school boards to do the same, giving South Dakotans unprecedented access to the government decision-making process.", "2018-04-20T18:12:05.000Z": "Absentee voting starts today. (Wow!) Learn more about absentee voting here>> https:// sdsos.gov/elections-voti ng/voting/absentee-voting.aspx ", "2018-04-20T15:00:35.000Z": "When bureaucrats looked to charge us for water out of the Missouri River or tell us how to farm, when they sought to limit our 2nd Amendment rights or mandate how 4-H rodeo be run, I fought back - and won. I'll do the same as governor, protecting our rights & our SD way of life.", "2018-04-18T18:11:27.000Z": "Bigger gov rarely produces greater freedom or prosperity. Under my admin, there would be no new boards, no new commissions, & no new blue ribbon task forces. Instead, we would look to scrub each agency, refocusing & streamlining existing departments while cutting red tape.", "2018-04-18T00:48:54.000Z": "Praying tonight for the Bush family. Barbara Bush was a true patriot, a dedicated wife and mother, and an incredible First Lady who was never hesitant about sharing her pearls of wisdom. She will be truly missed. Barbara Bush, former first lady, dead at 92 With her cloud of snow-white hair, signature three strand pearls and compelling presence, Barbara Bush's image was what she laughingly called \"everybody's grandmother.\" foxnews.com", "2018-04-17T20:02:52.000Z": "Isn't this just the best!! We just got a shipment of signs at the Sioux Falls Office! Sign up to get yours today >> https:// kristiforgovernor.com/get-involved/", "2018-04-17T18:30:06.000Z": "The avg SD nurse makes $57,010. The avg truck driver makes $40,850. Let's say they get married and have 3 children. Because we doubled the Child Tax Credit, that family would keep another $3,182 of their hard-earned money - a 3.25% increase in take-home pay! #TaxDay", "2018-04-17T17:30:06.000Z": "The average South Dakota police officer would owe $5,096 under the old law on Tax Day. Thanks to our historic tax cuts, the bill drops to just over $4,105, saving $991. Buy a house and the bill could drop even lower! #TaxDay", "2018-04-17T16:30:07.000Z": "It's #TaxDay and the last time you'll have to file w/o the benefit of the historic tax cuts we made. But don't wait until next year to see your savings! We crunched the numbers for you. Let's say you're a couple making the avg SD teacher salary with 2 kids - you'd save $2,600+!", "2018-04-17T14:42:49.000Z": "Reagan got it right when he said the govt's first responsibility is to protect the people, not run our lives. I am committing to 4 Pillars of Protection. Pillar 1: Protection from Tax Increases. Proud to sign the Taxpayer Protection Pledge, putting this commitment in writing.", "2018-04-13T20:06:25.000Z": "The trucking industry is an important part of South Dakota. I'm thrilled to see them standing by the historic tax cuts I negotiated with @realDonaldTrump . Now... if we can just explore some flexibilities on the ELD mandate. Trucking Industry Leaders Join Trump to Tout Tax Reform A trucking executive and truck driver joined President Donald Trump at the podium during an April 12 White House Rose Garden event held to discuss the effects the tax reform law passed by Congress in ttnews.com", "2018-04-13T19:46:00.000Z": "Storm info ... https:// facebook.com/kristiforgovernor/videos/10155209062732484/ ", "2018-04-12T20:31:50.000Z": "The new Farm Bill was introduced today! Included are: a strong crop insurance program / much-needed Livestock Disaster programs / reforms I wrote to improve the commodity title / more CRP acres and more. We've been working on this bill for many months. Today is an exciting day!", "2018-04-10T23:26:04.000Z": "Thank you, @SecretarySonny ! After months of me raising cain on this issue, USDA finally sided with the rodeo community and not a bunch of lawyers. 4-H youth rodeo can operate AS IT ALWAYS HAS.", "2018-04-10T17:06:08.000Z": "Happy #NationalSiblingDay !", "2018-04-10T16:10:29.000Z": "Empower families. Do more with every taxpayer dollar. Promote civic education. Increase post-secondary affordability. Continue rejecting Common Core. Produce job-holders, not simply degree-holders. Agree? Check out my education proposal - JUST RELEASED! Improving Education's Impact Read more about my initiative to improve education's impact in South Dakota. kristiforgovernor.com", "2018-04-10T01:49:24.000Z": "This Title IX fight with USDA that's been going on for months is stupid, unnecessary, & a complete waste of everyone's time. It adds nothing to the rodeo experience for the kids involved. I will keep standing with SD 4-H until this nonsense is shut down. http:// capjournal.com/news/sd--h-rod eo-told-by-state-federal-officials-to/article_f1d15598-388b-11e8-9ba9-c788c4f1504a.html ", "2018-04-10T01:20:59.000Z": "Busy day in Winner! Visited the hospital, took a tour, went to the assisted living, radio station, ate lunch at the Mexican restaurant, went to Grossenburg's, held a meet and greet at the American Legion, and attended the Lincoln Day Dinner tonight. Whew! https:// facebook.com/kristiforgovernor/posts/10155201469732484 ", "2018-04-09T01:48:41.000Z": "What a great Sunday! Started our day by attending Bethel Assembly of God in Rapid City, then drove to Philip, then to Murdo. Onward now to Winner, where we will spend tomorrow discussing priorities in my Governor's campaign. Come catch up with us! https:// facebook.com/kristiforgovernor/posts/10155199445412484 ", "2018-04-08T18:04:05.000Z": "Spent yesterday in Custer talking tax reform, H2B program, support for @realDonaldTrump , and my vision for reforming state government programs and dealing with our crime and drug problems. Thanks to everyone!! https:// facebook.com/kristiforgovernor/posts/10155197552902484 ", "2018-04-07T22:07:56.000Z": "We had a full day on the campaign trail yesterday, leaving Pierre early, heading first to Sturgis for lunch with Meade County ladies, then to Hot Springs for a Save the VA meeting, meet & greet with community members, & the Fall River Lincoln Day Dinner. https:// facebook.com/kristiforgovernor/posts/10155196361337484 ", "2018-04-07T15:54:59.000Z": "The headline we've been working toward for a long time: BACKPAGE IS SHUT DOWN. This is not the end of our fight to end sex trafficking, but it is a huge step toward shutting down the marketplaces where our children are bought and sold. Infamous sex ads website Backpage has been seized by the FBI and its co-founder has been charged Critics said traffickers used the platform to sell children for sex, however defenders say its ad hosting services are protected under freedom of speech laws. newsweek.com", "2018-04-03T23:30:05.000Z": "You deserve to know the kinds of job growth strategies I'd pursue if elected. Building a skilled, ready-to-work workforce is central to kickstarting the economy. Great things happening at Midwest Railcar Repair, which I toured last week. Training program draws accolades Training program draws accolades argusleader.com", "2018-04-03T17:01:29.000Z": "I'm proud to be from rural South Dakota. But many small towns like ours are struggling today. I want to make sure we don't lose South Dakota's rural culture. Don't miss my latest policy proposal: the Rural Revitalization Project. Rural Revitalization Initiative Learn more about my plan for rural South Dakota. kristiforgovernor.com", "2018-04-02T17:13:33.000Z": "An honor to attend a memorial service for Navy Water Tender 2nd Class Porter Rich of Lake Preston. He was killed in Pearl Harbor and was finally identified and laid to rest. Welcome home.", "2018-04-02T14:00:05.000Z": "Before tax reform, low-tax states like SD were being forced to subsidize liberal states like California. I had to fight hard for our low-tax principles as we negotiated the final deal, but I'm proud we got the win. As governor, I'll do the same.", "2018-04-01T13:30:03.000Z": "I hope today's celebration fills you and your family with the joy found in the empty tomb. Happy Easter! Christ is risen. He is risen indeed! Alleluia!", "2018-03-30T21:37:00.000Z": "It's time to go after that next big industry - much like Gov. Janklow did in the 1980s with financial services. It's time to kickstart South Dakota's economy.", "2018-03-30T20:19:46.000Z": "Busy day talking about my \"Kickstarting the Economy\" initiative in Sioux Falls and Hartford. We discussed affordable housing issues, education, the next big industry in the state, bio-tech, technology and workforce. https:// facebook.com/kristiforgovernor/posts/10155180573557484 ", "2018-03-30T15:30:05.000Z": "I've run a farm/ranch, hunting lodge, & insurance agency. If elected, I'll use those experiences to instill a culture in which agencies think less like bureaucracies and more like the businesses they serve. https:// goo.gl/je3N55", "2018-03-30T00:05:01.000Z": "When Vietnam veterans returned home 45 years ago, many didn't receive the welcome home they deserved. Today, on Vietnam Veterans' Day, I am proud to say: Welcome home & thank you for your service. There is no way to fully repay you for the sacrifices made.", "2018-03-29T18:59:31.000Z": "U.S. Rep. Kristi Noem talks about the farm bill and ag issues with about 30 representatives of South Dakota agricultural groups at the SD Corn office. @kristinoem", "2018-03-29T17:49:29.000Z": "I am so humbled by the Watertown community's support, because it's the people here who know me best. Thank you so much to everyone who came to this week's grand opening of our Watertown Campaign Headquarters!", "2018-03-29T17:45:11.000Z": "Honored to be named a Taxpayer Hero by the Citizens Against Government Waste. I worked directly with @realDonaldTrump to cut taxes by historic proportions, ensuring South Dakota families keep more money in their paychecks.", "2018-03-29T16:01:56.000Z": "Thank you to Northeast Technical High School for showing me around this week! https:// facebook.com/kristiforgovernor/posts/10155177791557484 ", "2018-03-29T13:30:11.000Z": "We need to prioritize education programs that produce job-holders, not just degree-holders. With practical learning opportunities, young people will be ready to fill good-paying South Dakota jobs. Learn more>> https:// goo.gl/je3N55", "2018-03-28T22:30:09.000Z": "With low taxes, low regulations, and a strong work ethic, SD is one of the best places to do business. I want to harness all this to recruit America's next growth industry. https:// goo.gl/je3N55", "2018-03-28T16:03:48.000Z": "As gov, I'll apply the same low-tax, pro-growth principles @realDonaldTrump & I used during tax reform. You've worked hard for your money; our government must respect that. https:// goo.gl/je3N55", "2018-03-27T17:55:05.000Z": "This video is special to me - it features some of the people who know me best, who watched me grow up, stood by me as I stabilized our farm/ranch after my dad's death, got to know me as a member of their community. Pretty humbling to have their trust & support.", "2018-03-26T14:23:55.000Z": "My economic agenda is grounded by the principles of limited govt, personal responsibly, & respect for work. Read how I plan to kickstart our economy & create more opportunity for every South Dakotan to prosper >> https:// goo.gl/wo98Pp", "2018-03-26T02:01:39.000Z": "A wonderful brunch in Rapid City for Catholic Social Services! We celebrated Palm Sunday by focusing on what we can do to serve those around us in need. Thanks Jim for the invite! I felt truly blessed to be there. The message and people touched my heart. https:// facebook.com/kristiforgovernor/posts/10155167473467484 ", "2018-03-24T17:56:48.000Z": "I voted NO on this week's $1.3 trillion spending bill. It continues to fund Planned Parenthood, fails to build President Trump's entire border wall, etc. We need a Balanced Budget Amendment at the federal level.", "2018-03-24T00:28:00.000Z": "Congratulations to the @NorthernStateU Wolves who are headed to the National Championship! The first time in school history! https:// todayskccr.com/northern-state -mens-basketball-advances-to-national-championship-game/ ", "2018-03-23T22:04:06.000Z": "Grateful to have the support of these farm/ranch families. As gov, I'll use my experience as a lifelong producer to develop the state's ag economy and give more young people the opportunity to thrive as farmers and ranchers in SD.", "2018-03-23T18:45:55.000Z": ". @Citi 's move to strong-arm its clients into discriminating against those who exercise their 2nd Amendment rights is troubling and undermines the constitutional liberties of law-abiding Americans. Citi becomes first big bank to press clients to restrict gun sales The bank will require retail clients to only sell guns if the customer has passed a background check, to restrict sales to people under 21, and to refuse to sell bump stocks or high-capacity magazi... politico.com", "2018-03-23T17:27:16.000Z": "Look who's getting married!!! https:// facebook.com/kristiforgovernor/posts/10155161913137484 ", "2018-03-23T16:00:09.000Z": "Best compliment I've gotten on the historic tax cuts me, @realDonaldTrump and others negotiated >> \"It's like a farmer wrote this bill.\" Well, a farmer did write it! Honored to fight for ag during tax reform. #AgWeek", "2018-03-23T02:00:09.000Z": "#TBT to taking on my own party's leadership to get the last Farm Bill done. It worked & we secured a strong livestock disaster program and critical safety nets for producers. #AgWeek House leaders draw flak on farm bill John Boehner and other GOP leaders are feeling the heat from lawmakers sick of screw-ups. politico.com", "2018-03-22T21:00:09.000Z": ". @Walmart paid out $2.1 million to its SD employees this month because of tax reform. Our historic tax cuts continue to put more money in the hands of hard-working people. Walmart employees in South Dakota get $2.1 million in cash bonuses, mostly due to federal tax law... The majority of the bonuses are tied to the federal tax law changes, the company said. argusleader.com", "2018-03-22T16:00:09.000Z": "#TBT to receiving the @FarmBureau 's Golden Plow award last week. Our farmers and ranchers are the backbone of South Dakota. I'll always fight for you. #AgWeek Rep. Kristi Noem receives Farm Bureau Golden Plow award | AGDAILY The American Farm Bureau Federation has presented Rep. Kristi Noem (R-S.D.) with AFBF's Golden Plow award. agdaily.com", "2018-03-21T16:00:09.000Z": "In case you missed it... I released my plan to strengthen South Dakota's ag industry earlier this week. Click to review the full plan. Would appreciate a RT to help spread the message to your followers >> https:// kristiforgovernor.com/policy/agricul ture/   #AgWeek Agricultural Growth Initiative Read more about my Agricultural Growth Initiative for South Dakota! kristiforgovernor.com", "2018-03-20T15:36:23.000Z": "Our Nation was founded by farmers. Our independence was won by farmers. And our continent was tamed by farmers. Our farmers always lead the way -- we are PROUD of them, and we are DELIVERING for them! #NationalAgricultureDay", "2018-03-20T15:00:10.000Z": "Our state is rooted in agriculture, yet we haven't had a farmer/rancher-turned-governor in decades. My ranch has been in our family for generations. I know what the ag community faces and have the experience to help make them stronger. #AgDay  #AgWeek", "2018-03-19T17:05:07.000Z": "The families who provide food for our nation cannot be thanked enough for everything they do. Happy Ag Week, South Dakota!", "2018-03-19T13:00:09.000Z": "As governor, I will again use my experience as a lifelong farmer and rancher to develop the state's agricultural economy and give more young people the opportunity to thrive as farmers and ranchers in South Dakota. Click to see my full plan >> https:// goo.gl/Tgg2xX", "2018-03-17T23:21:06.000Z": "Thank you to everyone who came out to bring a little luck to our campaign today in Sioux Falls! Happy St. Patrick's Day!", "2018-03-15T13:26:57.000Z": "Work is well underway on the next #FarmBill . A strong crop insurance program, CRP improvements, a meaningful livestock disaster program - there's a lot to fight for when it comes to SD ag priorities. https:// goo.gl/DVCyiK", "2018-03-13T23:30:03.000Z": "California's sanctuary cities are harboring criminals- and yet Nancy Pelosi claims the agents protecting our citizens are \"terrorizing communities\" by enforcing the law. We must secure our border & thank the ICE agents who work to stop illegal immigration. 'Beyond The Pale:' ICE Chief Blasts California Dems For Attacking Immigration Agents ICE Acting Director Homan lit into leading California Democrats, saying they were deliberately distorting recent immigration operations in the state. dailycaller.com", "2018-03-13T17:49:36.000Z": "So excited to see @SDState Jacks take on Villanova in the first round of the NCAA Women's Basketball Tournament! Will you be cheering on the Jacks too? #GoJacks Eighth-seeded Jackrabbits draw Villanova in NCAA first round BROOKINGS - South Dakota State earned its second-highest seed all-time - No. 8 - and faces No. 9 Villanova in the first round of the NCAA Women's Basketball Tournament on Friday at 6:30 p.m. at... brookingsregister.com", "2018-03-12T21:12:14.000Z": "I'm thrilled by all the support for our campaign for governor. Will you join our team? Follow the link to sign up and help fight for proven, conservative leadership! Kristi Noem for Governor Learn more about Kristi's campaign for South Dakota Governor! Check out our website and join the team. kristiforgovernor.com", "2018-03-09T14:21:53.000Z": "SD does a lot of things right, but with some smart infrastructure investments, strong partnerships, a larger skilled workforce and the right leadership, we have an opportunity when it comes to transportation. Check out my infrastructure plan today>> https:// goo.gl/Jvnfpq", "2018-03-09T01:05:04.000Z": "I've farmed and ranched my entire life, so earning @FarmBureau 's top award is pretty special. The truth is that it's been the honor of a lifetime to represent our industry in the U.S. House. Thank you for the opportunity! Rep. Noem Honored with Farm Bureau Golden Plow Award The American Farm Bureau Federation today presented Rep. Kristi Noem (R-S.D.) with AFBF's Golden Plow award. fb.org", "2018-03-08T17:27:39.000Z": "We are so excited! @LakeAreaTech is being featured in tomorrow's edition of USA Today! A special section entitled Women In Skilled Trades features a photo ad of 3 young ladies enrolled in non-traditional programs at LATI. Pick up your USA Today when it hits the stands tomorrow!", "2018-03-08T22:08:22.000Z": "Want a sneak peek of our first ad? I thought it was important to share the experience I'd bring to the governor's office. I've been a farmer, rancher, small business owner, conservative policymaker at the state and federal levels, & mom. Take a look>> Tested. Proven. Conservative. For more, please visit: http://kristiforgovernor.com youtube.com", "2018-03-08T17:59:38.000Z": "I hope Kassidy and Kennedy know how unbelievably proud we are of the strong, smart, hard-working, godly women they have become. Love you girls! Happy #InternationalWomensDay !", "2018-03-08T00:30:05.000Z": "You deserve to know who you're voting for & what that person's vision is for the state. We gave our website a remodel to make sure you can easily find info about who I am & what I want to accomplish. It's our front office - and the door is always open! Kristi Noem for Governor Learn more about Kristi's campaign for South Dakota Governor! Check out our website and join the team. kristiforgovernor.com", "2018-03-07T21:31:39.000Z": "All-around Summit League Champs! Congrats SDSU!", "2018-03-07T17:39:28.000Z": "Noem says if elected governor, she'd provide more govt transparency and encourage county commissions, school boards to follow suit http:// nc1.tv/sunshine", "2018-03-06T17:53:59.000Z": "Thanks to everyone who joined my Facebook Live event! To read my Sunshine Initiative, which aims to bring greater transparency to state and local government, please click the following link. Then, RT & reply with your thoughts! https:// goo.gl/ryX4gY", "2018-03-06T14:00:31.000Z": "Designed to improve the transparency of your state and local governments, I'll work through my Sunshine Initiative to shed new light on the inner workings of government. Join me later today for a Facebook Live event on my Sunshine Initiative!", "2018-03-05T16:49:32.000Z": "Caught up with KWAT's Mike Tanner this weekend to talk about the campaign, what I'm working on in the U.S. House, and what's next for South Dakota ag. Click here to hear the full interview >> https:// goo.gl/k4VP8k", "2018-03-03T16:00:04.000Z": "Honored to receive a 100% score from the @FRCdc . Within the last year, we've had a pro-life Justice confirmed to the Supreme Court, passed the Pain-Capable Unborn Child Protection Act, and helped states move toward defunding Planned Parenthood.", "2018-03-02T17:43:20.000Z": "Thank you for your support on this bill, Ivanka. I'm glad we were able to get this passed. #EndTrafficking Quote Tweet Ivanka Trump @IvankaTrump Looking forward to today's House vote on legislation that will help prevent online sex trafficking. The perpetrators of this horrific crime need to be held accountable, and we must continue to take steps to combat all forms of sex trafficking. #SESTA  #FOSTA", "2018-03-01T19:28:40.000Z": "Wow! Thank you for the support! I know the only vote that matters is the one placed at the ballot box, but this is sure encouraging! Quote Tweet USD GOP @USDCollegeRepub Who do you think will win the South Dakota Gubernatorial Republican Primary? Vote now! Show this poll", "2018-03-01T15:01:02.000Z": "#TBT to refereeing last weekend's Coborns Dodge for a Cause in Mitchell. Had an absolute blast!!", "2018-02-28T21:53:31.000Z": "Rev. Billy Graham inspired millions around the world with his loving message of Christianity. His impact was so powerful, that today we honored him as only the fourth private citizen to have a public viewing in the Capitol. Thank you, America's Pastor. Americans pay respects to Billy Graham at US Capitol: 'I love him' Hundreds arrived in Washington Wednesday to see Billy Graham's casket lying in honor and pay their respects. foxnews.com", "2018-02-28T00:06:22.000Z": "Time to pull the plug on websites like Backpage that buy and sell our kids for sex. Their business model is set up to profit off of human trafficking. Proud to see legislation I helped drive pass the House today to go after these sickening websites like never before.", "2018-02-27T19:19:25.000Z": "Pennington County is reporting a 30% increase in meth-related arrests. It's destroying families. Getting a handle on this crisis would be a top priority within my administration. http:// keloland.com/news/article/n ews/meth-arrests-in-pennington-county ", "2018-02-27T16:49:59.000Z": "Websites like Backpage have knowingly facilitated the trafficking of our children for sex - even in SD. We have to pull the plug on these online trafficking marketplaces, which is why I'm proud to support the Allow States and Victims to Fight Online Sex Trafficking Act today.", "2018-02-26T22:45:07.000Z": "County Fair in Mitchell is clearly the place to be on a Saturday morning. Great to see everyone!", "2018-02-26T18:31:45.000Z": "An absolute honor to speak with this group of Vietnam veterans in Mitchell Saturday. An unforgettable opportunity to thank them for their service.", "2018-02-26T01:15:05.000Z": "There is no work ethic like a South Dakotan's work ethic. We need to harness that by putting a greater focus on getting people the skills they need to qualify for good-paying, in-demand jobs. Thanks to these Yankton leaders for sitting down with me to discuss.", "2018-02-25T18:04:18.000Z": "Tourism is SD's #2 industry. It's a huge employer, but more growth is possible. Good discussion with Black Hills tourism leaders who shared concerns abt rising crime & healthcare costs, as well as insight on workforce needs & advertising. We even had some agritourism stop by!", "2018-02-24T21:49:50.000Z": "Workforce development means more than training. It's also about having a place for the newly developed workforce to live. Joined members of the Vermillion Chamber of Commerce this week to talk about housing needs in the area.", "2018-02-24T16:20:07.000Z": "Had a wonderful opportunity to share my vision for South Dakota in Sturgis this week. Thank you so much for the warm welcome!", "2018-02-24T13:18:09.000Z": "Thank you to the Hughes County GOP for putting on a great Lincoln Day Dinner this week. Loved getting to catch up with so many old friends.", "2018-02-23T21:01:34.000Z": "Thank you USD for sharing your questions, concerns and perspectives with me today.", "2018-02-23T20:04:06.000Z": "Thank you so much to Concord Elevator and the Ochsner family for bringing together dozens of producers to talk about my vision for South Dakota agriculture.", "2018-02-23T17:52:27.000Z": "THANK YOU to my Sioux Falls Crew for helping us launch our office there today! So many of these people have been with me from the very beginning. Their encouragement and work has always helped propel us to the top. So grateful to have them on Team Noem again.", "2018-02-23T12:37:53.000Z": "Stopped by the Aberdeen Ag Expo today. Great to see everyone!!", "2018-02-22T20:19:49.000Z": "A powerful testimony from Cari during a public safety listening session I held.  She's faced for years and has now been clean for months. But it's tough and something she deals with every single day. I'm so proud of her for getting clean and having the courage to share her story.", "2018-02-22T03:06:35.000Z": "Absolutely blown away by the opening of my West River headquarters. This area has always fought for me and I for them. Thank you so very much! Check out all the pictures >> https:// facebook.com/kristiforgovernor/posts/10155087721082484 ", "2018-02-21T21:37:46.000Z": "A lot of work needs to be done on mental health services in SD. Without improvements, we're leaving law enforcement to shoulder much of the responsibility. Grateful for the work this group is doing to try some innovative solutions.", "2018-02-21T19:21:25.000Z": "THANK YOU to everyone who fought the blowing snow to meet up with me this week when I was in Pierre. Incredibly grateful to have this time to answer your questions and get your insight.", "2018-02-21T15:54:45.000Z": "Sat down with local officials this week in Pierre. I wanted to hear directly from them what was working and what needs improvement. Heard a lot about the public safety challenges they are facing, both financially and in terms of a changing community culture.", "2018-02-21T14:50:14.000Z": "#BillyGraham , you will be missed.", "2018-02-21T03:14:41.000Z": "Moving medical treatments closer to home is critical for healthcare, but also for workforce development and building a sense of community. Great to see all that Avera is investing to bring world class care to folks throughout South Dakota.", "2018-02-20T19:59:05.000Z": "The NRA would be welcome to South Dakota. We understand the freedoms that come with defending our #2ndAmendment , how it allows us to protect our families and carry on SD's cherished hunting traditions. #2A Quote Tweet The Hill @thehill Top Dallas official tells NRA to find a new location for its annual convention http:// hill.cm/ZvzpBax", "2018-02-20T15:36:05.000Z": "I've done exactly what I said I was going to do: I was going to represent you, speak up for our values here in SD, work to strengthen families & then come home. Our campaign kickoff yesterday was incredible. Thank you! https:// goo.gl/GNQE1k", "2018-02-20T12:38:30.000Z": "Even with the snow! Quote Tweet kennedy noem @KennedyNoem She sure seems happy this early in the morning!", "2018-02-20T02:54:53.000Z": "Thank you to everyone who came out to support me tonight. I can't tell you how much it meant to me to kickoff our campaign in my hometown. Thanks for always blessing me with your support, prayers, and encouragement. You are some of the very best people. https:// facebook.com/kristiforgovernor/posts/10155082958037484 ", "2018-02-19T21:33:24.000Z": "Happy #PresidentsDay ! Question for you - if you could, which U.S. president would you most like to have dinner with? Why? Reply with your answers!", "2018-02-16T15:35:41.000Z": "This year marks 100 years of SD pheasant hunting. As much as pheasant season is a family tradition for us, we made it our family business for years too. Click here to learn about my plan to make sure this tradition lasts a century more >> https:// goo.gl/VY5JQE", "2018-02-14T22:50:48.000Z": "An early poll shows us leading the race for South Dakota Governor, but the only poll that matters is on Election Day. We're going to keep working hard to make our state an even better one. Please join our effort today! Join our team for Kristi! We're pulling ahead, but we need to keep the momentum up. Join our team to elect Kristi today! ourcauseourvoice.com", "2018-02-14T17:05:35.000Z": "I thank God every day that He gave us the opportunity to live life hand-in-hand. Love you, Bryon.  #HappyValentinesDay", "2018-02-14T16:18:50.000Z": "More than 350 companies have increased wages, provided bonuses, and offered new benefits thanks to tax reform. Thrilled to see so much success! Quote Tweet Donald J. Trump @realDonaldTrump", "2018-02-13T17:36:10.000Z": "Heard from many yesterday about how rising crime rates have changed their families, businesses & way of life. Too often, help is found too late, landing folks in jail - or worse. We must do better. Read more from my public safety listening session>> https:// goo.gl/c5dqxF", "2018-02-08T14:30:05.000Z": "Chuck Schumer, Nancy Pelosi, and the Democrats will stand for seemingly everything but the American people.", "2018-02-08T00:47:42.000Z": "Proud to endorse SB67, which would help make sure child trafficking survivors are treated as victims, not criminals - similar to legislation I championed in the House. Click here and check out the anti-trafficking agenda I'd seek to enact as governor>> Kristi for Governor Kristi for Governor kristiforgovernor.com", "2018-02-06T20:25:36.000Z": "Today is President Ronald Reagan's birthday! To celebrate, I wanted to share a few words about the impact he's had on my life - how he's inspired me and influenced the way I view the role of government. Take a look.", "2018-02-05T23:53:17.000Z": "With the passage of tax reform, SD farmers and ranchers will be seeing some changes. I went through those changes with NewsCenter1 recently. Take a look! Changes to Farmer's and Rancher's Taxes BROOKINGS, S.D. - Before sitting down to prepare taxes, South Dakota's agriculture producers need to review some changes that have been made to the Farmers and Ranchers Tax Guide tsln.com", "2018-02-02T22:30:03.000Z": "One month after one of the largest tax cuts in US history and hardworking Americans have already seen the largest pay increase in 8 years. Great news! US added strong 200K jobs in January; pay up most in 8 years U.S. employers added a robust 200,000 jobs in January, and wages rose at the fastest pace in more than eight years, evidence of a consistently healthy job market. foxnews.com", "2018-02-02T18:15:00.000Z": "After pressure from myself, my colleagues, and many South Dakotans, the memo was released. House memo states disputed dossier was key to FBI's FISA warrant to surveil members of Team Trump A much-hyped memo that shows alleged government surveillance abuse has been released to the public and includes testimony from a high-ranking government official who says the FBI and DOJ would not... foxnews.com", "2018-02-02T16:00:00.000Z": "Ellsworth is critical to natl security & an economic engine. Proud to endorse SB40, which will support the base's long-term viability. If elected gov, I'll work w Ellsworth Dev Authority to expand on these efforts, ensuring SD continues to play a major role in defending America.", "2018-02-01T19:49:31.000Z": "The cancellation of the showing of a film at USD is precisely why the South Dakota legislature should pass the campus free speech bill, HB1073. University of South Dakota movie incident looms large in campus free speech debate When lawmakers take up a bill on Friday that guarantees free speech rights on the state's public university campuses, one incident from 2015 will likely be a key example for both supporters and... argusleader.com", "2018-02-01T16:17:19.000Z": "As governor, I pledge to veto any and all efforts to increase taxes. You've worked hard for your money. The government needs to respect that.", "2018-01-31T22:00:03.000Z": "Whether you're a trafficker, a website that facilitates #humantrafficking , or someone who purchases victims for sex, your activity will have no place in SD. We will strengthen our laws and ensure law enforcement officers have the tools needed to make sure those laws are enforced.", "2018-01-31T20:43:41.000Z": "Another very concerning headline. This time, from the @RCJournal : \"The number & frequency of crimes committed in Rapid City saw some dramatic increases in 2017...\" Grateful for the work of SD law enforcement - especially with crime on the rise like this. Quote Tweet Rapid City Journal @RCJournal Today's front page. Crime on the rise. Farm rescue helps rancher hurt by Legion Lake Fire. Federal judge sides with Dick and Jane's. #pageone  #localjournalism", "2018-01-31T18:35:48.000Z": "The right to bear arms is a fundamental constitutional freedom. By enacting constitutional carry legislation, we can further protect the #2ndAmendment rights of law-abiding South Dakotans. As governor, I would work to get a constitutional carry bill passed and signed into law.", "2018-01-31T03:38:32.000Z": "Incredible energy in the room for this great speech. Watch my post-game recap... #sotu", "2018-01-30T19:20:11.000Z": "Violent fugitives should not be able to find haven in our communities. Grateful to work with SD law enforcement & @TGowdySC on a commonsense solution to bring victims justice and protect the communities these dangerous criminals are hiding in. Noem bill targets reservation fugitives With support from several local and area law-enforcement officials, U.S. Rep. Kristi Noem, R-S.D., has introduced federal legislation to address the flight of criminal suspects to Native American... rapidcityjournal.com", "2018-01-29T22:08:12.000Z": "Half of Americans don't have $400 in their savings account. Tax reform is an opportunity to keep more money in their pocket. Great to visit about how these tax cuts will impact SD families in Rapid City last week. Noem talks Tax Reform in Rapid City Congresswoman Kristi Noem discusses the recent Tax Reform bill at Americans for Prosperity luncheon. kotatv.com", "2018-01-28T15:13:35.000Z": "Very grateful to the veterans who came out to learn more about Veterans for Kristi. Would love to have you on the team too! Learn more >> https:// goo.gl/gS7j6H", "2018-01-28T01:36:59.000Z": "Thank you Rushmore Crossfit for having the Noem family for the WOD this morning! You guys are awesome...but I'm not doing anymore burpees today . https:// facebook.com/kristiforgovernor/posts/10155025100352484 ", "2018-01-27T19:17:18.000Z": "Picked up the paper in the hotel this morning and found this on the front page. Tax cuts at work.", "2018-01-27T14:59:04.000Z": "What an uplifting event! These women had the best questions, some incredible advice and unmatched energy. I can't begin to say how grateful I am to them for their encouragement and wisdom.", "2018-01-26T23:59:55.000Z": "Humbled by Don's words. I'm so grateful for his service & of all our veterans. I'm dedicated to fighting for those who defended our freedom. But I also believe we're in this together. I'd love if you'd join Don & others in my Veterans for Kristi coalition! Join Veterans for Kristi Watch our video and join the Veterans for Kristi Coalition ourcauseourvoice.com", "2018-01-25T22:49:52.000Z": "Current SD campaign finance laws could allow corporations and individuals to shatter campaign contribution limits. My campaign is doing things differently. We #LeadByExample . Learn more >> Restoring Transparency and Integrity in South Dakota Campaign Financing It's time to restore transparency and integrity in South Dakota campaign financing. Learn more today! ourcauseourvoice.com"}