{"2019-01-19T18:50:02.000Z": "Thank you, Tennessee, for entrusting me with this incredible honor. I am humbled by your support, and I look forward to what the next four years have in store. #BelieveinTN", "2019-11-06T22:45:15.000Z": "November 6, 2018 - @MariaLeeTN and I will always remember this special day. We're working hard to make life better for every Tennessean and are so grateful for the opportunity to serve this great state. Thank you, Tennessee!", "2019-01-26T00:31:59.000Z": "We've had a great first week in office. I issued my first executive order focused on rural Tennessee and we began work on the budget. We'll be posting regular Fridays from the Farm videos, and I'm excited to post my first one here on my new, official Twitter page:", "2019-01-25T23:24:01.000Z": "New governor, new Twitter account! Follow my new official account - @GovBillLee for the latest posts and updates. I'll be posting my first weekly video recap from the farm later today!", "2019-01-25T17:06:28.000Z": "Departmental Budget Hearings began today for the 2019 - 2020 budget. I am committed to producing a budget that is fiscally conservative and keeps Tennessee on the right track for growth and investment.", "2019-01-25T02:16:46.000Z": "To continue the progress we have made as a state, we need to keep innovating and growing.  It was a pleasure to be with the @nashtechcouncil tonight for the #NTCAwards as they honored some of our state's leaders in the tech sector.", "2019-01-24T23:33:16.000Z": "Budget hearings begin tomorrow for @TNDeptFI , @TNDVS , @TNCommerceInsur , @TNECD and @TNTDOC1 .  Follow along live at https:// web.nowuseeit.tn.gov/Mediasite/Cata log/catalogs/mediasiteadmin-tn-budget-hearings-2019 ", "2019-01-24T18:53:08.000Z": "It was a pleasure to join @CommishTNECD and @GM CEO @mtbarra today in Spring Hill to unveil production of the Cadillac XT6. GM's continued investment in Tennessee affirms what we already know - Tennessee is an excellent place to do business.", "2019-01-24T01:11:40.000Z": "Children truly are a blessing from the Lord - congratulations to you and @carrieunderwood ! Quote Tweet Mike Fisher @mikefisher1212 Jacob Bryan Fisher! You are a gift from our Lord! The last few years has has had its challenges and it makes this moment even more sweet! We didn't know if Izzy would ever have another https:// instagram.com/p/Bs_pZuOBeI2/ ?utm_source=ig_twitter_share&igshid=bie6pizob9s2 ", "2019-01-23T22:21:15.000Z": "Education is more than a test score - it's about preparing a child for success in life. That's why I am proud to recognize this week, January 20-26, as #schoolchoiceweek . Read the full proclamation at https:// tnsos.net/publications/p roclamations/files/1607.pdf ", "2019-01-23T16:50:55.000Z": "I've said that rural TN is one of my top priorities. Today I'm pleased to announce Executive Order No. 1, which begins to address improving the outlook in those areas by calling on our departments to assess their impact on the rural parts of our state. Gov. Bill Lee Issues First Executive Order to Address Accelerated Transformation of Rural Areas NASHVILLE, Tenn. - Today, Tennessee Governor Bill Lee issued his first executive order, requiring all state executive departments to issue a statement of rural impact and provide recommendations for... tn.gov", "2019-01-22T23:18:48.000Z": "Today I was honored to be surrounded by this incredibly qualified and dedicated group of individuals at our first cabinet meeting. I look forward to what we will accomplish together to make this state a better place to live and work for all Tennesseans.", "2019-01-21T15:27:12.000Z": "As we honor the dream of Dr. Martin Luther King Jr. today, let us remember his legacy by asking ourselves what we are doing for others. #MLK2019", "2019-01-21T01:01:50.000Z": "We had a great day today opening the Tennessee Residence to the thousands of folks who came out to join us in the cold. What a great way to spend our second day calling this special place home.", "2019-01-20T16:13:03.000Z": "In case you missed it, here is a link to my full Inaugural Address. I believe in a limited government, that provides unlimited opportunity for we the people to address the greatest challenges of our day. #BelieveinTN Gov. Bill Lee Inaugural Address - 1/19/19 Tennessee Governor Bill Lee's Inaugural Address at the War Memorial Auditorium in Nashville on January 19, 2019. youtube.com", "2019-01-20T02:58:12.000Z": "Thanks @LukeBryanOnline for helping us kick off a great night at the #BelieveinTN Ball. It has been an amazing and humbling day.", "2019-01-19T16:23:19.000Z": "It was a tremendous way to start the morning at our faith service. Thank you to @michaelwsmith , @AllWaltrip , @ScottHamilton84 , @mikefisher1212 and everyone for helping us kick off the special day. #BelieveinTN", "2019-01-19T14:10:26.000Z": "Watch the full Inaugural Address later today live on your local @PBS affiliate throughout Tennessee, or stream online at http:// capitol.tn.gov", "2019-01-19T13:54:50.000Z": "Our greatness has always come from the collective lives, service, commitment and sacrifice of those who came before us-because of what we have always done as a people together, in community with each other, in service to our state and to our neighbors.", "2019-01-19T13:54:49.000Z": "It is important however to remember that the blue circle around the three stars on our flag represents the unity of our state. I believe that Tennesseans have much more that unites us than divides us.", "2019-01-19T13:54:48.000Z": "Government is not the answer to our greatest challenges. Government's role is to protect our rights and our liberty and our freedom. I believe in a limited government, that provides unlimited opportunity for we the people to address the greatest challenges of our day.", "2019-01-19T04:21:59.000Z": "Thank you to everyone who joined us tonight at Boots on Broadway! I am humbled to be surrounded by so many friends and supporters the night before Inauguration. #BelieveinTN", "2019-01-18T18:28:57.000Z": "I believe that every life is precious. As tens of thousands of people from across the country #MarchForLife today, I am proud to stand with those advocating for the rights of our most vulnerable citizens.", "2019-01-17T22:32:24.000Z": "While the weather doesn't seem to be cooperating, we are looking forward to a fantastic inaugural weekend. Be safe, but still also feel welcome to attend this historic event. We are making every effort to accommodate overflow space for those wishing to attend.", "2019-01-17T22:31:32.000Z": "Due to inclement weather, the Inaugural Ceremony has been moved to War Memorial Auditorium. View the full details for the event at http:// BelieveinTN.com", "2019-01-17T19:20:43.000Z": "As a former teacher and seasoned administrator with a solid record of reform, Penny Schwinn will help make TN a leader in the nation as our Commissioner of Education. Her experience is exactly what we need to continue improving education in our state. https:// transition.billlee.com/governor-elect -bill-lee-names-penny-schwinn-education-commissioner/ ", "2019-01-17T18:06:48.000Z": "We have been committed to building a team that represents each Grand Division, and I look forward to working with our newest appointments from West, Middle and East Tennesse to implement a conservative vision for our state. https:// transition.billlee.com/governor-elect -bill-lee-announces-three-cabinet-appointments/ ", "2019-01-16T16:27:06.000Z": "Due to the overwhelming response and enthusiasm from people around Tennessee, the Inaugural Worship Service has moved from the Ryman Auditorium to the Grand Ole Opry. View the full details for the event at http:// BelieveinTN.com/events", "2019-01-16T00:39:42.000Z": "Today, we are pleased to announce three additional members to my cabinet. The knowledge that these individuals bring to the table will go a long way in making this state an even better place to live and work. Read the full release at https:// transition.billlee.com/transition-ann ounces-tdot-commissioner-and-two-additional-appointees/ ", "2019-01-14T21:47:20.000Z": "While today was about the auto industry, whenever we have a signficant investment in Tennessee it sends a signal to industries of all types that this is a great place for business. Honored to be with @BillHaslam to talk about the economic impact these investments will have.", "2019-01-14T16:45:43.000Z": "Great news in the automotive sector as @GM and @VW choose to invest in Tennessee. It was an honor to be with @BillHaslam and @CommishTNECD to make these announcements, and I look forward to building on this momentum and keeping Tennessee as one of the best states to do business.", "2019-01-10T00:11:13.000Z": "I am honored to have @michaelwsmith , @cecewinans , @StevenCurtis , @nicoleCmullen , @matthew_west and other acclaimed performers join us at the Inaugural Worship Service.  Read the full announcement at https:// transition.billlee.com/celebration-of -song-showcases-governor-elect-lee-inaugural-worship-service/ ", "2019-01-09T22:44:58.000Z": "The members of our law enforcement community put their lives on the line every day to ensure that Tennessee neighborhoods are safe.  Thank you all  for your service. #LawEnforcementAppreciationDay", "2019-01-09T20:32:23.000Z": "Congratulations to Comptroller Justin Wilson and Treasurer David Lilliard on your re-elections today! These two men have been exceptional public servants for our state, and I look forward to working alongside them to build on the progress they have made.", "2019-01-08T20:46:26.000Z": "I am pleased to announce the addition of Brandon Gibson to my staff as Senior Advisor today. Judge Gibson is a principled conservative with deep roots in our state, and I am honored that she will be continuing her commitment to public service as part of this administration.", "2019-01-08T19:01:16.000Z": "Congratulations to @ltgovmcnally and @GlenCasada .  I am honored to have the opportunity to work with both of you this session, and I look forward to what we can accomplish together to make this state an even better place for all Tennesseans.", "2019-01-08T15:58:57.000Z": "Congratulations to all of the members of the legislature as they kick off the 111th General Assembly today.  I look forward to working with you in the coming months to continue making Tennessee the best state in the country to live and work.", "2019-01-06T02:51:54.000Z": "It was an honor to attend the annual Tennessee State Guard Banquet tonight. This extraordinary group of men and women serve with distinction, and we are grateful for their service.", "2019-01-03T20:54:50.000Z": "I am pleased to announce six additions to my cabinet today.  I am excited to work with this group and look forward to building solutions for our state.  Read the full announcement here: https:// transition.billlee.com/transition-ann ounces-appointments-for-six-departments/ ", "2019-01-03T19:01:48.000Z": "Congratulations to @JohnRoseforTN , @timburchett , @DrMarkGreen4TN and @MarshaBlackburn on being sworn in as new members of the 116th Congress today.  I look forward to working with you, and with our entire delegation, to make our state an even better place for all Tennesseans.", "2019-01-01T15:30:21.000Z": "Maria and I wish all Tennesseans a very happy New Year!", "2018-12-27T22:12:34.000Z": "We are pleased to add two experienced military leaders to our cabinet today. Our veterans and active duty personnel will be in good hands with these appointments and I look forward to working with them. View the full announcement at https:// transition.billlee.com/department-of- military-and-the-department-of-veterans-services/ ", "2018-12-25T13:00:04.000Z": "Maria and I wish all Tennesseans a merry Christmas! \n\n\"For unto us a child is born, unto us a son is given, and the government shall be upon His shoulders\" - Isaiah 9:6", "2018-12-23T00:00:14.000Z": "One of my favorite things about this time of year is getting to spend time with my grandkids!", "2018-12-21T22:34:44.000Z": "We have announced the details for the events leading up to the inauguration on January 19th. To view the full list of details and to make reservations, go to http:// BelieveinTN.com", "2018-12-18T18:47:23.000Z": "I was honored to join @SecretarySonny at @TNFarmBureau today in Lebanon. Agriculture is a way of life in our state and I'm proud of all the steps we are taking to make sure Tennessee farmers aren't burdened by overregulation.", "2018-12-17T18:31:26.000Z": ". @SenAlexander has faithfully served Tennesseans at the state and federal level for decades. A seventh-generation Tennessean and principled conservative, our state benefited from his thoughtful leadership. I am thankful for Lamar's friendship and wish him the best.", "2018-12-14T21:44:39.000Z": "Congratulations to @TNHighwayPatrol Cadet Class 1218. Each of you has earned this incredible honor through months of rigorous training. Thank you for your commitment to our state.", "2018-12-13T20:57:26.000Z": "It was an honor to sit across from the President today to discuss how we will work together in the years ahead. Thank you for the opportunity, Mr. President. Quote Tweet Donald J. Trump @realDonaldTrump Today, it was my honor to welcome our Nation's newly elected Governors to the @WhiteHouse !", "2018-12-13T19:41:28.000Z": "Honored to be in Washington today meeting with @SenAlexander and Senator-elect @MarshaBlackburn . I'm looking forward to what we will accomplish together.", "2018-12-13T17:05:26.000Z": "While in Washington today, I wanted to make sure I stopped by @Heritage to hear some of their ideas. They've done great work in advancing strong policy solutions and I appreciate their time and insight.", "2018-12-12T21:11:20.000Z": ". @Indigoag bringing 700+ jobs to downtown Memphis is great news for West Tennessee and for the rest of our state. Ag Tech is a growing opportunity for innovation, and Memphis is continuing to build a national reputation as a leader in this sector with this investment.", "2018-12-10T21:12:00.000Z": "I am pleased to announce four additions to my cabinet today. The experience and knowledge that these individuals bring will be invaluable to my administration.  View the full announcement at https:// transition.billlee.com/%E2%80%A8gover nor-elect-bill-lee-announces-cabinet-appointments/ ", "2018-12-07T20:48:22.000Z": "On this day, we remember those who lost their lives 77 years ago in the attacks on Pearl Harbor, and we honor all of those who have come after them in service to our country. #PearlHarborRemembranceDay", "2018-12-07T18:46:31.000Z": "Today I am pleased to announce additions to my legislative affairs team. View the full list at https:// transition.billlee.com/governor-elect -bill-lee-announces-additions-to-governors-staff/ ", "2018-12-06T20:03:58.000Z": "Thank you to the @MemphisChamber for inviting me to speak at their Annual Chairman's Luncheon today. I enjoyed being with @MayorMemphis and other area leaders as we talked about #MovingMemphisForward .", "2018-12-06T18:50:54.000Z": "Spending the day in Memphis today for the @MemphisChamber Luncheon. While here, we stopped by @muddysbakeshop in Midtown for some amazing cookies!", "2018-12-05T22:37:44.000Z": "I enjoyed being in Murfreesboro today with @SenShaneReeves , @ltgovmcnally , @VoteDawn , and @BillKetron . We had a terrific conversation.", "2018-12-04T22:48:46.000Z": "Congratulations to @yarbro on being elected Tennessee Senate Minority Leader and to @RepAkbari on being elected as Caucus Chair. I look forward to working with you and your colleagues in the coming session.", "2018-12-04T01:58:12.000Z": "I am proud to announce Dr. Charlie Hatcher as the next Commissioner of Agriculture tonight. Charlie is a fifth generation Tennessee farmer and has the experience to carry out my administration's priorities in agriculture. https:// transition.billlee.com/governor-elect -bill-lee-announces-dr-charlie-hatcher-to-lead-the-tennessee-department-of-agriculture/ ", "2018-12-03T20:41:55.000Z": "Congratulations to @YagerTweets on being elected Caucus Chair. I look forward to working with you and all of the newly elected @tnsenategop leadership to make Tennessee a leader in the nation.", "2018-12-03T20:34:49.000Z": "Congratulations @SenJohnson on being elected @tnsenategop Majority Leader.  I look forward to working together.", "2018-12-03T20:28:28.000Z": "Congratulations to @ltgovmcnally on your re-election  as Lieutenant Governor. I look forward to working with you in the coming session.", "2018-12-03T17:56:13.000Z": "Happy Hanukkah to all Tennesseans celebrating the Festival of Lights!", "2018-12-01T12:56:52.000Z": "President George H.W. Bush was a tremendous public servant and leader and he was an inspiration to anyone who came into contact with him. Maria and I send our heartfelt prayers and condolences to the entire Bush family.", "2018-11-27T20:17:37.000Z": "Congratulations to @DollyParton and her 14 years of great work through @TNImagination in promoting early childhood literacy and delivering over 34 million books to children in Tennessee!", "2018-11-27T17:02:15.000Z": "Today, I'm proud to announce my first cabinet appointments as well as several key appointments to my gubernatorial staff. http:// transition.billlee.com/news", "2018-11-26T23:20:20.000Z": "It was my pleasure to meet with my friend and the next Speaker of the Tennessee House of Representatives @GlenCasada today. I'm looking forward to working with him on some of the big issues facing our state.", "2018-11-25T23:53:27.000Z": "Congratulations to @camperrep on being elected as Tennessee House Minority Leader and to @repmikestewart on your reelection as Democratic Caucus Chair. I look forward to working with you both this session.", "2018-11-22T15:56:46.000Z": "Maria and I wish all Tennesseans a Happy Thanksgiving!", "2018-11-21T18:03:05.000Z": "We had the opportunity to volunteer today with @2HarvestMidTN . They're helping needy families across Middle Tennessee this Thanksgiving.", "2018-11-20T22:13:49.000Z": "Congratulations to the new @tnhousegop Caucus Chair @CSexton25 and Majority Whip @ricktillisTN . I look forward to working with the new members of House Leadership, and all of the members of the legislature, to make Tennessee a leader in the nation.", "2018-11-20T21:42:18.000Z": "Congratulations to @WilliamLamberth on being elected House Majority Leader. The @tnhousegop is in good hands.", "2018-11-20T21:27:44.000Z": "Congratulations Rep. Bill Dunn, I look forward to working with you as well.", "2018-11-20T20:51:53.000Z": "Congratulations @GlenCasada .  I'm looking forward to working with you in the coming session.", "2018-11-13T16:54:34.000Z": "With two big announcements today, it's clear that Tennessee is a destination for businesses to invest. We look forward to continuing the work to make Tennessee the best place to live, work and play. We are glad to have @amazon and @EY_US expanding their footprints in our state.", "2018-11-13T14:48:39.000Z": "Maria and I are saddened to hear the news of Rep. Charles Sargent's passing. He was a public servant who not only served his district well, but made the state of Tennessee better. We send our prayers and condolences to the Sargent family during this time.", "2018-11-11T20:24:31.000Z": "Happy #VeteransDay to all of our veterans.", "2018-11-10T20:39:02.000Z": "I enjoyed the opportunity to be with @ColonelTDVS this #VeteransDay weekend in Murfreesboro and getting to visit patients at the Alvin C. York VA. Our veterans have done so much for our country, and I look forward to making this the best state for them to live and work.", "2018-11-10T18:38:45.000Z": "Great briefing with @ColonelTDVS and @VeteransHealth staff at the Alvin C. York campus before the #VeteransDay parade in Rutherford County. Our veterans deserve the best care we can give them.", "2018-11-08T19:35:10.000Z": "It was great to be at the Senate Staff Thanksgiving Lunch today with @ltgovmcnally . I look forward to working with all of you in the coming months.", "2018-11-08T18:13:51.000Z": "Today I announced several key members of my transition team and inaugural committee. View the full list at http:// transition.billlee.com/news", "2018-11-08T16:35:43.000Z": "Yesterday, I launched my transition website. We're looking for talented individuals who can help Tennessee thrive, and are dedicated to helping Tennessee lead the nation. Apply to join the team at Bill Lee for Governor of Tennessee I'm a cattle farmer, a businessman, a father and grandfather, a seventh generation Tennessean, and our state's 50th governor. I've spent a good part of my life doing what I can to make life better... billlee.com", "2018-11-07T02:48:25.000Z": "Thank you Tennessee!", "2018-11-07T02:28:42.000Z": "And finally, let me say thank you, again, to the voters of Tennessee. Thank you for trusting me with your vote. Thank you for believing in our positive vision for Tennessee. Thank you for choosing a Tennessee that is not just \"good,\" but \"great.\"", "2018-11-07T02:27:28.000Z": "I believe that if we can embrace the opportunities ahead of us in the coming months and years, Tennessee can be the place other states turn to as a model. Tennessee can not only become a leader in the southeast, but Tennessee can lead the nation", "2018-11-07T02:26:40.000Z": "Now isn't the time to slow down or get complacent. We live in a remarkable state, but we've got some remarkable challenges. And while many parts of our state are doing well, we still have too many places where our neighbors don't have access to opportunity.", "2018-11-07T00:00:02.000Z": "Polls are open for one more hour! Find your polling place at http:// billlee.com/vote and go vote now!", "2018-11-06T21:59:09.000Z": "Just three hours left until polls close! Find your polling location at http:// billlee.com/vote .", "2018-11-06T20:25:51.000Z": "Going to all 95 counties (twice) confirmed one thing that I already knew- Tennessee is a remarkable place to live. It has been an honor to travel our state on the campaign trail, and now I'm asking for your vote. Find your polling location at http:// Billlee.com/vote . GIF", "2018-11-06T19:00:45.000Z": "Polls are open from now until 8pm eastern/ 7pm central! Find your polling place at http:// billlee.com/vote", "2018-11-06T17:06:42.000Z": "#ElectionDay", "2018-11-06T14:12:31.000Z": "Polls are open, and now we need you to get out and vote if you haven't already. Find your polling location at http:// billlee.com/vote .", "2018-11-06T02:01:19.000Z": "What a great way to end our day on the Roadmap to Victory in Memphis! Polls open in less than 12 hours, and I sure would appreciate your vote.  Find your polling place at http:// billlee.com/vote", "2018-11-05T23:58:36.000Z": "We had a great stop in Jackson on the Roadmap to Victory, and we're headed to Memphis next. Polls open tomorrow morning! Find your polling location at http:// BillLee.com/vote .", "2018-11-05T22:10:46.000Z": "Supporters from all around the state have been sending in videos telling us why they're voting for Bill. Reply to this post, or share with your friends, to tell us why you're voting for Bill tomorrow!", "2018-11-05T20:59:44.000Z": "We had a great fourth stop of the day in Rutherford County on the Roadmap to Victory. We're headed to West Tennessee next. We'll see you soon!", "2018-11-05T18:18:08.000Z": "Three stops down and three more to go on the Roadmap to Victory. We had a great stop in Bradley County today, thank you to everyone who came to join us!", "2018-11-05T17:26:36.000Z": "Tomorrow is the big day. Share or comment below and tell us why you're voting for Bill!", "2018-11-05T16:21:17.000Z": "We had a great second stop on the Roadmap to Victory in Knox County this morning, and we're headed to Bradley County next! Polls open tomorrow morning, and you can find your polling location at http:// billlee.com/vote", "2018-11-05T13:56:20.000Z": "Thank you Jonesborough for such a great start on the Roadmap to Victory this morning! We're heading all the way across the state today, and you can see where we'll be next at http:// billlee.com/roadmaptovicto ry  .", "2018-11-04T22:52:00.000Z": "Election Day is just two days away! Find your polling location at http:// billlee.com/vote", "2018-11-04T20:15:03.000Z": "Election Day is this Tuesday, and we're coming your way tomorrow! Join us on the Roadmap to Victory as we travel across the state, and see where we'll be near you at http:// BillLee.com/roadmaptovicto ry ", "2018-11-03T21:33:59.000Z": "Team Lee had a great last Super Saturday today! Thank you so much to all of our volunteers who have put out yard signs, made phone calls and gone door to door for our campaign. You all make me #BelieveinTN !", "2018-11-03T18:03:29.000Z": "We had a great time this morning in Williamson County knocking on doors and talking to voters. Thank you to all of our volunteers who joined us!", "2018-11-03T16:05:51.000Z": "Thank you to everyone that joined us in Franklin this morning to start off Super Saturday. Election Day is next Tuesday, and Team Lee will be out all around the state working to get out the vote. Find your polling location at http:// BillLee.com/vote .", "2018-11-02T23:45:50.000Z": "What a great final stop of the #BelieveinTN tour in Van Buren county tonight. I started my campaign with an event here over a year ago (not nearly as many people showed up), and I'm honored to be surrounded by so many friends and supporters tonight as we're here once again.", "2018-11-02T22:04:16.000Z": "Thank you to everyone who joined us in Bedford County today on the #BelieveinTN tour, and thank you to Pat Marsh and Shane Reeves for hosting us!", "2018-11-02T19:21:06.000Z": "It was great to be at #GOVCON2018 today. Our state truly is a remarkable place to live, and I believe that we can lead the nation.", "2018-11-02T17:19:27.000Z": "I enjoyed the opportunity to be with so many school board members from around the state today at the TSBA Conference. Every where I've been in our state, one of the things Tennesseans want is a good school for their kids. Thank you all for all you do to make that a reality.", "2018-11-02T12:41:03.000Z": "Thank you to @FOXNashville and @JenniferWFox17 for having me on this morning. Always a pleasure to answer viewer questions!", "2018-11-01T22:07:21.000Z": "We've hit 92 counties on the Believe in Tennessee tour, and we have three more to go! Join Bill and Maria on the Roadmap to Victory as they make their way across the state the day before the election! https:// billlee.com/roadmaptovicto ry/ ", "2018-11-01T20:01:13.000Z": "Early voting ends in just a few hours! Don't miss out on your chance to vote early and avoid the Election Day lines. Find a polling location near you at http:// billlee.com/vote", "2018-11-01T18:55:44.000Z": "We had a great stop in Jackson County on the #BelieveinTN tour. Thank you to @JohnRoseforTN and @PaulBaileyforTN for joining me on the trail today!", "2018-11-01T17:24:26.000Z": "I enjoyed the opportunity to be in Cookeville today on the #BelieveinTN tour. Thank you to John Rose, Paul Bailey, and Ryan Williams for hosting us!", "2018-11-01T14:44:44.000Z": "Thank you to everyone who joined us in Wilson County this morning on the #BelieveinTN tour, and thank you to John Rose, Mark Pody, Susan Lynn, and Clark Boyd for hosting us. Today is the last day to early vote! Find your polling location at http:// BillLee.com/vote", "2018-10-31T20:11:55.000Z": "It's exciting to see so many young people participating in the Student Mock Election.  Getting young people engaged and interested in the election process is a great thing for our state. (I liked the outcome too!) Lee, Blackburn win Tenn. student mock election More than 50,000 votes were cast in this year's Tennessee student mock election and Republicans Bill Lee and Marsha Blackburn were the top picks in two major races. newschannel5.com", "2018-10-31T17:24:09.000Z": "Thank you to everyone who joined us in Dickson County today on the #BelieveinTN tour, and thank you to Mary Littleton for hosting us!", "2018-10-31T15:10:17.000Z": "What a great start to our day on the #BelieveinTN tour in Clarksville this morning. Thank you to Curtis Johnson, Jay Reedy, and Tommy Vallejos for hosting me today. Tomorrow is the last day to early vote! Find a polling location near you at http:// BillLee.com/vote", "2018-10-31T00:26:30.000Z": "It was great to be in Clay County tonight for my last stop of the day on the #BelieveinTN tour with Senator Mark Pody and Representative Kelly Keisling. Thank you to everyone who joined us!", "2018-10-30T22:45:51.000Z": "We had a great third stop of the day in Overton County on the #BelieveinTN tour. Thank you Senator Paul Bailey for hosting me, and thank you to everyone who came out!", "2018-10-30T17:27:02.000Z": "Election day is just one week away! Can you help us keep our latest ad on the air by chipping in today? https:// secure.anedot.com/billfortn/good togreat  Quote Tweet Bill Lee @BillLeeTN Well this race is almost over, and you've got a pretty clear choice. Tennessee is a wonderful place, but we've got some big challenges. And in the next four years, we need a governor who can lead us from good to great.  If you agree, I'd sure appreciate your vote.", "2018-10-30T16:15:48.000Z": "What a great stop on the #BelieveinTN tour in Hancock County. Thank you to Congressman Phil Roe, Congressman Bill Jenkins, Senator Frank Niceley, Senator Steve Southerland, Representative Gary Hicks, and Mayor Thomas Harrison for hosting us today!", "2018-10-30T13:53:59.000Z": "Thank you to everyone who joined us in Johnson City this morning on the #BelieveinTN tour, and thank you to Congressman Phil Roe and Mayor David Tomita for hosting us!", "2018-10-29T21:36:16.000Z": "It was great to be in Bristol today with @DrPhilRoe and @lundbergjon . Early voting continues until November 1! Find your polling location at http:// BillLee.com/vote", "2018-10-29T19:01:52.000Z": "Honored to have the endorsement of the Johnson City Press. https:// johnsoncitypress.com/Editorial/2018 /10/28/Endorsements-Lee-for-Tennessee-governor-Bredesen-for-U-S-Senate.html?ci=stream&lp=2&p= ", "2018-10-29T16:30:01.000Z": "We had a great start to our week on the #BelieveinTN tour in White County this morning. Thank you to Senator Paul Bailey for hosting us!", "2018-10-29T15:50:06.000Z": "Well this race is almost over, and you've got a pretty clear choice. Tennessee is a wonderful place, but we've got some big challenges. And in the next four years, we need a governor who can lead us from good to great.  If you agree, I'd sure appreciate your vote.", "2018-10-28T21:27:58.000Z": "This Thursday is the last day to early vote before Election Day on November 6! Find an Early Voting location near you at http:// BillLee.com/vote", "2018-10-27T23:31:42.000Z": "Great to be in Springfield tonight with Senator Kerry Roberts. We had a great day today on the #BelieveinTN tour, and we're coming your way soon!", "2018-10-27T22:16:20.000Z": "We had a great stop in Murfreesboro on the #BelieveinTN tour with so many friends and supporters! Thank you to Bill Ketron, Shane Reeves and Dawn White for hosting me today!", "2018-10-27T21:22:48.000Z": "Thank you so much to all of the volunteers that joined us for Super Saturday! Team Lee has been out around the state knocking on doors and making phone calls, and we would love your help for this final push! Join us and help get out the vote by going to http:// BillLee.com/volunteer", "2018-10-27T20:42:49.000Z": "Thank you to everyone who joined us today in Marshall County for the #BelieveinTN tour! See where we'll be next at http:// BillLee.com/events . We'll see you soon!", "2018-10-27T19:08:53.000Z": "It was great to be in Maury County on the #BelieveinTN tour today. Today is the last Saturday of early voting! Find your early voting location at http:// billlee.com/vote !", "2018-10-27T18:44:01.000Z": "Thank you to everyone that joined us at Puckett's in Maury County for the #BelieveinTN tour, and thank you to Representative Sheila Butt for hosting us!", "2018-10-27T17:38:26.000Z": "Our deep felt prayers go out to the victims and their families of this tragedy in Pittsburgh. We mourn when we see such terrible acts of evil, and we're praying for healing, not only for this community, but for our nation.", "2018-10-27T15:45:09.000Z": "What a great stop in Giles County this morning on the #BelieveinTN tour. Thank you to Mayor Pat Ford and Clay Doggett for hosting us!", "2018-10-27T13:27:45.000Z": "Today is the last Saturday to early vote! Find a polling location near you at http:// BillLee.com/vote", "2018-10-26T22:59:39.000Z": "We had a great end to our day on the #KustoffBusTour in Shelby County this afternoon. We're headed your way soon! See where we'll be next at http:// BillLee.com/events .", "2018-10-26T21:03:14.000Z": "We had a great stop in Tipton County on the #KustoffBusTour . Early voting is going on right now through November 1st! Find your polling location at http:// Billlee.com/vote !", "2018-10-26T18:36:06.000Z": "Great to be in Fayette County today with @DavidKustoff on the #kustoffbustour talking about why I #BelieveinTN . We're heading to Tipton County and Shelby County next!", "2018-10-26T16:28:44.000Z": "I enjoyed the opportunity to speak to the Tennessee District Attorneys General Conference this morning in Memphis. Keeping Tennesseans safe is one of the chief duties of a governor, and I look forward to working with our district attorneys to keep making this a reality.", "2018-10-26T15:22:17.000Z": "\"Bill Lee continues to be a stand out Men of Valor mentor; that's how I met him. Genuine, compassionate, God-fearing. He's mentored, trained and employed many of the men we serve. He's the real deal.\" Marcus Martin, Men of Valor.", "2018-10-25T21:16:04.000Z": "Good luck to all of the future farmers from Tennessee heading to the @NationalFFA convention! Great to be with you on the trail today @JohnRoseforTN ! Quote Tweet John Rose @JohnRoseforTN The @NationalFFA Convention is on & @tnffa has a large delegation in Indianapolis for the annual gathering. From @BillLeeTN & I, good luck to @juliaknaggs & all competing members. #FFAJustOne  #TN6", "2018-10-25T18:54:57.000Z": "What a great third stop of the day on the #BelieveinTN tour in Trousdale County. Thank you to Representative @TerriLynnWeaver and David Baldwin for hosting us today. Early voting is going on right now! Find your polling place at http:// billlee.com/vote .", "2018-10-25T17:26:22.000Z": "We had a great second #BelieveinTN stop of the day in Macon County today. Thank you to @JohnRoseforTN , @mark_pody , Mayor Richard Driver and everyone else who joined us today!", "2018-10-25T16:18:27.000Z": "Honored to have the endorsement of @knoxnews ! https:// knoxnews.com/story/opinion/ editorials/2018/10/25/bill-lee-tennessee-governor-erndorsement-knoxville-news-sentinel/1742616002/ ", "2018-10-25T15:09:59.000Z": "It was great to be in Hendersonville this morning with @JohnRoseforTN , @JohnnyGarrett4 , and Mayor Jamie Clary. Thank you to everyone who joined us! #BelieveinTN", "2018-10-24T22:37:07.000Z": "We've been to 77 counties so far on the #BelieveinTN tour, and we have 18 left to go. See where our campaign will be next at http:// BillLee.com/events !", "2018-10-24T20:20:22.000Z": "Great to be in studio with @Hallerin today in Knoxville. I always enjoy the opportunity to be be on your show. Thanks for having me!", "2018-10-24T18:51:16.000Z": "We had a great #BelieveinTN stop in Knoxville today. Thank you to Eddie Smith, Jason Zachary, Martin Daniel, Richard Briggs, Randy McNally and Tim Burchett for hosting us, and thank you to everyone who joined us.", "2018-10-24T15:42:30.000Z": "It was great to be in Decatur this morning on the #BelieveinTN tour. Early voting continues through November 1st! Find your polling location at http:// BillLee.com/vote", "2018-10-24T14:26:05.000Z": "Thank you to Senator Bo Watson, Representative Mike Carter, Tennessee Young Republicans Chairman Ethan White and everyone who joined us on our first #BelieveinTN stop of the day in Collegedale this morning!", "2018-10-23T21:59:23.000Z": "I enjoyed the opportunity to be with business leaders at the Chattanooga Chamber of Commerce today talking about our state's potential to lead the nation. #BelieveinTN", "2018-10-23T19:47:19.000Z": "Honored to have the endorsement of the @NFIB . Our state is a low tax state, and as governor I will work every day to keep it that way so we can continue to keep our state attractive for business. Quote Tweet NFIB Tennessee @nfib_tn Proud to announce the @NFIB Tennessee PAC's endorsement of @BillLeeTN for governor! #SmallBizVoter  https:// nfib.com/content/news/e lections/small-business-endorses-bill-lee-for-governor/ ", "2018-10-23T18:41:18.000Z": "Thank you to everyone who joined us in Sequatchie County at the Cookie Jar Cafe, and thank you to Representative Ron Travis for hosting us. Early voting is going on right now! Find a polling location near you at http:// billlee.com/vote", "2018-10-23T17:00:35.000Z": "It was great to be in Grundy County this morning! Thank you to Representative Paul Sherrell and Howell Adams for hosting us. We're going all over the state this week on the #BelieveinTN tour! See where we'll be next at http:// BillLee.com/events", "2018-10-23T15:48:46.000Z": "\"If you believe that our state can be a leader in the nation, then I encourage you to join me in voting for Bill and electing a true leader.\" Pastor Frank Stevenson I am a Democrat. This is why am voting for Bill Lee to lead Tennessee. | Opinion The Republican governor's nominee has proved he is a problem solver who cares about the community. tennessean.com", "2018-10-22T18:22:20.000Z": "It was great to be in Henry County today on the #BelieveinTN tour with Senator John Stevens and Sheriff Monte Belew. Early voting is going on right now! Find your closest polling location at http:// BillLee.com/vote .", "2018-10-22T16:12:36.000Z": "It was great to be with the Tennessee Organization of School Superintendents this morning. I appreciated the opportunity to hear from these education leaders on how we can continue to make education better in our state.", "2018-10-22T14:54:16.000Z": "I enjoyed the opportunity to hear from Stewart County educators this morning and discuss how we can better support our small school districts. Teachers are where the rubber meets the road in education, and as governor I will continue to listen.", "2018-10-21T20:05:27.000Z": "Supporters of all ages have been sending in videos of why they're voting for Bill. Tell us why you're voting for Bill by replying to this post or by sending in your own video to info@billlee.com!", "2018-10-20T22:18:22.000Z": "It was great to be with Representative John Ragan in Clinton this afternoon for our last stop of the day on the #BelieveinTN tour. To see where our campaign will be next week go http:// BillLee.com/events !", "2018-10-20T20:49:21.000Z": "Team Lee is working all around the state to get out the vote! Early voting is going on right now and goes through November 1st. Find your polling location at http:// Billlee.com/vote !", "2018-10-20T19:49:24.000Z": "It was great to be in Scott County this afternoon for Fall on the Mall, talking about why I #BelieveinTN . We're coming your way soon!", "2018-10-20T18:15:11.000Z": "Thank you so much to Dennis Powers, Ron Gant, Ken Yager and everyone who joined us in Lafollette for the #BelieveinTN tour!", "2018-10-20T16:00:43.000Z": "Second stop of the day on the #BelieveinTN tour is in the books. Thank you to everyone that joined us in Grainger County this morning. We're heading to Campbell, Scott and Anderson counties next. We'll see you soon!", "2018-10-20T13:44:35.000Z": "Thank you to everyone who joined me in Morristown this morning for my first #BelieveinTN stop of the day, and thank you to Tilman Goins and Steve Southerland for hosting us!", "2018-10-19T23:49:32.000Z": "It was great to be with @JeremyFaison4TN and Steve Southerland in Newport tonight. Thank you so much to everyone who came out and joined us! #BelieveinTN", "2018-10-19T22:07:51.000Z": "We had a great event in Unicoi today on the #BelieveinTN tour! Thank you to Rusty Crowe for hosting us.", "2018-10-19T21:26:30.000Z": "Lacy Upchurch was a lifelong farmer and a dedicated advocate for Tennessee's farming community, serving for a decade as @TNFarmBureau president. Our state will miss his leadership. Maria and I are praying for the entire Upchurch family today.", "2018-10-19T19:40:28.000Z": "Thank you to everyone who joined me in Greene County for my second #BelieveinTN stop of the day, and thank you to David Hawk and Steve Southerland for hosting me.", "2018-10-19T16:31:32.000Z": "We need you to get out and vote! Early voting is going on now and continues through November 1st. Find the closest early voting location to you at http:// BillLee.com/vote .", "2018-10-19T15:50:30.000Z": "It was great to be in Sevier County this morning with @LamarAlexander and so many supporters  on my first #BelieveinTN stop of the day. We're heading to eight more counties in East Tennessee today and tomorrow. We'll see you soon!", "2018-10-18T21:00:41.000Z": "I am humbled to have the support of teachers, administrators, and non-profit leaders from around the state, and I am thankful for their input as part of my statewide education coalition. https:// billlee.com/release-bill-l ee-announces-statewide-education-coalition/ ", "2018-10-18T21:00:10.000Z": "I know what it means to lead with the future in mind - that's exactly what I've done throughout my career, I will pursue education policies that help each child reach his or her full potential and ensure that they are ready to be productive citizens.", "2018-10-18T16:07:03.000Z": "Our schools need to look a whole lot different. Even though my company was named a best place to work, we still have a hard time filling jobs in the trades. We need to start our kids out early. When I'm governor, they're not just going to be different, they're going to be better.", "2018-10-18T14:39:27.000Z": "Honored to have the endorsement of the Chattanooga Free Press. https:// timesfreepress.com/news/opinion/f reepress/story/2018/oct/17/cooper-lee-best-choice-tennessee-governor/481190/ ", "2018-10-17T22:18:02.000Z": "It was great to be with with the Tennessee Fire Service Coalition today. Our first responders put their lives on the line everyday to keep our neighborhoods safe, and I'm honored to have their support.", "2018-10-17T16:49:34.000Z": "Thank you to Nashville community leaders who joined me this morning. I appreciated the opportunity to listen and to share my vision for our state.", "2018-10-17T16:03:33.000Z": "Polls are open! Sign up to get a bumper sticker today at http:// billlee.com/bumpersticker and show your support for Bill everywhere you go!", "2018-10-17T15:05:11.000Z": "Early voting starts today and goes until November 1! Find your polling location at http:// billlee.com/vote", "2018-10-16T23:00:28.000Z": "I enjoyed the opportunity to meet with community leaders in Haywood County this afternoon. The success of West Tennessee is important to the success of our state, and I look forward to working with you all as governor.", "2018-10-16T21:15:51.000Z": "It was great to be with @DavidKustoff and members of our law enforcement community in West Tennessee this afternoon. Thank you all for the work you do to keep our neighborhoods safe.", "2018-10-16T15:28:00.000Z": "It was great to be with so many community leaders in Memphis this morning. Thank you all for all you do for Memphis and for our state!", "2018-10-15T18:34:59.000Z": "Election day is just over three weeks away, and we need your help to get over the finish line! Join Team Lee today by going to http:// BillLee.com/volunteer", "2018-10-14T21:43:37.000Z": "Early voting is just three days away! Find your early voting location at http:// vote.billlee.com .", "2018-10-13T21:47:42.000Z": "Team Lee had a great Super Saturday today! Join us next time by going to http:// BillLee.com/volunteer", "2018-10-13T20:39:15.000Z": "Great to be in Crockett County today for my last stop of the day on the #BelieveinTN tour! And thank you to Carter Edwards for having me at Crockett Gin.", "2018-10-13T17:37:05.000Z": "Great to be with Sheriff Bryan Avery and Commissioner Tony Parker today in Lake County at First Responders Appreciation Day! #BelieveinTN", "2018-10-13T17:11:00.000Z": "Great to be in Dyersburg his morning on the #BelieveinTN tour with my good friends Congressman David Kustoff and Senator Ed Jackson. We'll see you soon!", "2018-10-13T15:11:49.000Z": "Super Saturday is off to a great start! Team Lee is out knocking doors, delivering yard signs, and making phone calls all around the state!", "2018-10-13T14:05:46.000Z": "Happy birthday to the @USNavy ! Quote Tweet U.S. Navy @USNavy Happy #243NavyBday ! Today, we celebrate 243 years of our #USNavy 's critical role in protecting and promoting American interests worldwide and honor our shipmates' immense contributions to our nation's history and security.\nThey've been #ForgedByTheSea !", "2018-10-13T02:26:39.000Z": "Great to be with so many friends and supporters after the #TNGovDebate tonight! You all make me #BelieveinTN", "2018-10-13T01:46:28.000Z": "Thank you to all of our supporters who joined us tonight at #TNGovDebate watch parties all around the state!", "2018-10-13T00:59:10.000Z": "We have to commit to vocational, technical and agricultural education in our state.  Great institutions like Moore Tech should be a part of the solution. #TNGovDebate Quote Tweet Bill Lee @BillLeeTN Awesome time touring Moore Tech, in Memphis today! \nVocational, technical, and agricultural education are a crucial part of workforce development, ensuring we have skilled workers for jobs across the state.", "2018-10-13T00:53:26.000Z": "In business, if you don't manage a budget, you go bankrupt. In government, if you don't manage a budget you raise taxes. As governor, I will manage our state budget, funding our needs before our wants. #TNGovDebate", "2018-10-13T00:30:13.000Z": "We have a healthcare system that is fundamentally flawed, and if we want to improve that system we need to address the root causes of cost, not simply spend more taxpayer money. #TNGovDebate", "2018-10-13T00:23:05.000Z": "As governor, I'll improve our testing system and engage teachers, parents, and school leaders in our plan. #TNGovDebate", "2018-10-13T00:21:16.000Z": "Teachers are where the rubber meets the road in our education system. 70% of teachers in our state say that our testing environment is not conducive to a successful learning environment. #TNGovDebate", "2018-10-12T23:40:45.000Z": "\"As a life-long Nashvillian and a core Democrat, it is a dubious task to find any politician with whom I am aligned on every single issue. However, I believe in Bill Lee's vision for Tennessee.\" - Frank Stevenson, Educator and Pastor", "2018-10-12T23:31:55.000Z": "\"I can say without hesitation that Bill is one of the most caring and decent human beings ever. He has supported the work of organizations that have been instrumental in my own life, some for over 40 years.\" - Van Pinnock, Former Business Owner, Neighborhood Leader", "2018-10-12T23:20:25.000Z": "\"I'm supporting Bill Lee because he's not like every other candidate for office and he has real-world, managerial experience in the private sector and non-profits.\" - Dr. Lois Jordan, First Woman and First African-American Woman Elected to Serve on Nashville Metro City Council", "2018-10-12T23:10:18.000Z": "\"Bill Lee has always brought a humility, curiosity, and genuine commitment to everything he's done as a person, businessman, and non-profit leader. He's proven he cares about solutions that make a real difference in people's lives.\" - Jeremy Kane, Founder of LEAD Public Schools", "2018-10-12T22:59:01.000Z": "\"I support Bill Lee because he has rock solid character, tons of common sense and years of experience getting important things done.\" - David Fox, Former Chairman, Metro Nashville Public Schools Board", "2018-10-12T22:45:20.000Z": "\"I'm voting for Bill Lee for governor is because he is the right person at the right time for a such an important office. He's a dedicated family man and leader whose adult life has been spent in the service of others.\" - Kevin Carroll, Law Enforcement Official, Davidson County", "2018-10-12T22:34:05.000Z": "\"Bill has been deeply involved with ABC and even chaired the board of directors. His commitment to the construction industry, as well as the community, is well known to our members.\" - Toby Compton, President/CEO of Associated Builders and Contractors - Greater Tennessee Chapter", "2018-10-12T21:04:49.000Z": "@BillLeeTN is a leader, innovator and job creator who will continue to strengthen and grow our great state of Tennessee. He is a person of faith and conviction who will be dedicated to making the lives of Tennesseans better. https:// billlee.com/release-nashvi lle-area-leaders-praise-bill-lee/ ", "2018-10-12T22:19:42.000Z": "\"Tennessee citizens will be extremely proud and wise voting for Bill Lee to be our next Governor. Bill is truly a man of the people and as our Governor he will serve us with great distinction.\" - Governor Winfield Dunn", "2018-10-12T22:08:30.000Z": "\"Bill is the right man for the right time.  He is a proven, successful leader with the integrity and compassion that spring from his deep Tennessee roots.\" - Jim Bryson, Business Owner, Former State Senator", "2018-10-12T18:38:01.000Z": "Happy #nationalfarmersday to all of our state's farmers. I grew up on a cattle farm, and still live there today. Agriculture has been a critically important part of my family's life for generations, and as governor that will not change.", "2018-10-12T15:24:11.000Z": "It was great to be with so many mayors from Middle Tennessee this morning! Thank you all for having me, and I look forward to working with you all as governor.", "2018-10-11T23:53:18.000Z": "Congratulations to my good friend @senatornorris on his confirmation. He will make an excellent Federal Judge for West Tennessee!", "2018-10-11T21:10:08.000Z": "Supporters have been sending in videos of why they're voting for Bill all week! Send in your videos of why you support Bill to info@billlee.com.", "2018-10-11T19:32:59.000Z": "We've been to 57 counties so far on the #BelieveinTN tour, and we're going to thirteen next week! See where our campaign is headed next at http:// BillLee.com/events . We'll see you soon!", "2018-10-11T14:18:53.000Z": "Congratulations to Yassin Terou and @Yassin_Falafel on being named the Friendliest Place in America. This is great news for Knoxville and for Tennessee! https:// goodmorningamerica.com/living/story/i nside-nicest-place-america-refugee-owned-falafel-shop-58414615 ", "2018-10-11T01:12:53.000Z": "Tonight in the #TNSenateDebate , Tennesseans heard why we need my friend @VoteMarsha in the U.S. Senate. Early voting starts in one week, and we need to get out and vote!", "2018-10-10T22:18:31.000Z": "Early voting begins one week from today! Be sure to show your support for Bill wherever you are by going to http:// BillLee.com/bumpersticker", "2018-10-10T20:19:51.000Z": "This Saturday is our last Super Saturday before early voting! Volunteer with us this weekend and get your Bill Lee T-Shirt!", "2018-10-10T17:08:48.000Z": "Early voting is just 1 week away, and I would be honored to have your vote. Get involved with our campaign today at http:// BillLee.com/volunteer", "2018-10-10T01:30:20.000Z": "It was great to be in Kingsport with so many supporters for the #TNGovDebate tonight. Thank you so much to everyone that joined us, and thank you all for the birthday wishes!", "2018-10-10T00:30:04.000Z": "Thank you to everyone that joined us tonight at watch parties all across the state for the #TNGovDebate !", "2018-10-09T23:58:15.000Z": "Thank you all for joining me in Northeast Tennessee for a great debate.  Tennessee is a remarkable place to live, and I believe that we can lead nation. #TNGovDebate", "2018-10-09T23:44:53.000Z": "We have ignored vocational, technical and agricultural development in our schools for decades.  We need to be aggressive in these areas, and seriously change the way we look at high school, to develop a skilled workforce and attract industry into our state. #TNGovDebate", "2018-10-09T23:34:29.000Z": "Last year over 1,700 Tennesseans died from an opioid overdose. As governor I will work with treatment providers, community organizations, law enforcement, and families on a comprehensive strategy to solve this crisis. #TNGovDebate", "2018-10-09T23:32:50.000Z": "Supporting jobs requires investing in the technology infrastructure to support jobs. Efforts like the broadband investment by @YourBrightRidge should be supported and expanded all across Tennessee. #TNGovDebate", "2018-10-09T23:30:05.000Z": "I'm proud to have had the opportunity to work with @BillHaslam on pushing a pro-jobs agenda, and I'm honored to have his endorsement. #TNGovDebate Quote Tweet The RGA @The_RGA . @BillLeeTN is the right choice to take Tennessee to the next level. As governor, he'll make Tennessee stronger than ever. #TNGov", "2018-10-09T23:22:48.000Z": "I will not bet our budget on another  top-down government solution. Instead, we'll work with providers and patients to improve outcomes and reduce costs. #TNGovDebate", "2018-10-09T23:22:18.000Z": "In 94, they told us that Medicaid expansion would pay for itself. In 2004 we had to kick 300,000 Tennesseans off those rolls. In 2010, they told us that Obamacare would reduce costs, and Tennessee health insurance premiums have risen 174%. #TNGovDebate", "2018-10-09T23:19:15.000Z": "I'm excited for the new investments that @BalladHealth is making in Northeast Tennessee, and I look forward to working with them and all of our healthcare providers to drive innovation in the healthcare industry. #TNGovDebate", "2018-10-09T23:15:11.000Z": "As someone who has worked in breaking the cycle of recidivism through Men of Valor, I know that we can be both tough on crime and smart on crime at the same time. #TNGovDebate", "2018-10-09T23:10:48.000Z": "Public-private partnerships like the Kingsport Academic Village are a great example of the work we can do when we work together to solve problems. #TNGovDebate", "2018-10-09T22:52:10.000Z": "\"No one has shown a stronger commitment to the people of Tennessee during this campaign than Bill Lee. He is a great man, a great conservative, and he will be a great governor for our state.\" - Kelly Wolfe, Former Jonesborough Mayor", "2018-10-09T22:43:02.000Z": "\"Bill Lee understands the critical role Tennessee's private colleges and universities play in making our state attractive to business, and providing opportunity for young people and adult learners, alike.\" - Alexander Whitaker, University President", "2018-10-09T22:35:05.000Z": "\"I can't wait for folks who haven't gotten to meet and hear Bill to do so on Tuesday. I've never been so energized about a campaign, including my own!\" - Mayor David Tomita, Johnson City Mayor", "2018-10-09T22:25:47.000Z": "\"I support Bill Lee because he a principled man of faith with a deep and sincere desire to improve the life of Tennesseans.\" - Barry Staubus, District Attorney General, 2nd District", "2018-10-09T22:18:17.000Z": "\"Bill is a proven business leader who brings fresh perspective from the private and non-profit sectors. He has the executive experience needed for the job as governor.\" Scott Niswonger, CEO and philanthropist", "2018-10-09T22:13:33.000Z": "\"I believe Bill Lee will most closely lead Tennessee with platform principles that will please God and bring His favor and blessings to the people of this state.\" - Reverend Sheldon Livesay, Founding Director, Of One Accord Ministry", "2018-10-09T21:50:00.000Z": "\"Bill Lee is the only candidate for governor who has built a company, created jobs, and bought health care for his employees and their families.\" - Alan Levine, Executive Chairman, Ballad Health", "2018-10-09T21:40:38.000Z": "\"Bill Lee is a successful businessman, a lifelong farmer, a dedicated Christian and a person with a great positive vision to advance our state.  I highly recommend him to be our next governor.\" - Congressman Bill Jenkins, Former Congressman, 1st District", "2018-10-09T21:32:48.000Z": "\"I have had the privilege to not only spend time with Bill Lee, but also the opportunity to bow our heads and pray together. I know Bill to be man of great character, integrity, and faith.\" - Pastor Bill Houck, NorthStar Baptist Church", "2018-10-09T21:22:30.000Z": "\"I support Bill Lee because he is a Tennessee businessman and not a professional politician.  Bill knows the problems with making payroll and taking care of all the employees that work for him.\" - Major General Gary L. Harrell, US Army, retired", "2018-10-09T21:12:46.000Z": "\"Bill's approach offers opportunity to Washington County citizens without costly government projects while fostering positive relationships between students, tradespeople and our business community.\" Mayor Joe Grandy, Washington County Mayor", "2018-10-09T20:59:55.000Z": "\"Bill Lee is the leader Tennessee is looking for to build on the great strides in education, job creation and smaller government we have experienced over the past eight years.\" - Mayor Dan Eldridge, Former Washington County Mayor", "2018-10-09T20:49:46.000Z": "\"I'm supporting Bill Lee because he represents Tennessee's conservative values and he's a successful business leader with a great vision for our state. I'm very confident Bill's leadership will continue to move Tennessee forward!\" - Mayor John Clark, Kingsport City Mayor", "2018-10-09T17:39:15.000Z": "We live in a remarkable state, but our next governor is still going to face major challenges.  We shouldn't just throw money at problems, we need to look for twenty year solutions.  We need to actually solve the toughest problems.  That's what Tennesseans deserve.", "2018-10-09T16:32:39.000Z": "Happy birthday Bill! - Team Lee", "2018-10-08T21:52:32.000Z": "Join Team Lee for the second debate of the general election at watch parties all around the state! See where the nearest watch party is to you at http:// BillLee.com/events !", "2018-10-08T17:36:14.000Z": "Our phone bank for Bill Lee starts in 2 DAYS! Be sure to join us for FREE FOOD and the chance to win a gift card as we make sure that @BillLeeTN becomes the next governor of Tennessee!", "2018-10-08T17:18:47.000Z": "It was great to be with trucking industry leaders to discuss workforce development and infrastructure this morning.  Thank you to the Tennessee Trucking Association for having me, and thank you Connie Vaughan for your excellent leadership of this organization!", "2018-10-07T23:43:40.000Z": "Thank you @SenJohnson for hosting today in Franklin! Tennessee truly is a remarkable place to live, and I believe we can lead the nation. #BelieveinTN .", "2018-10-07T20:24:49.000Z": "Election Day is 30 days away! Go to http:// billlee.com/volunteer today to help Team Lee get across the finish line!", "2018-10-07T18:53:21.000Z": "Team Lee had a great day yesterday knocking on doors and making phone calls! Join Team Lee today by going http:// BillLee.com/volunteer", "2018-10-06T20:41:05.000Z": "Judge Kavanaugh has had a distinguished career and I'm glad he has been confirmed to be our next Supreme Court Justice. The confirmation process that led to this moment was DC politics at its worst, and I hope our country can learn from it, so not to repeat it.", "2018-10-06T18:48:12.000Z": "Members of our law enforcement community work every day to ensure that Tennessee's neighborhoods are safe, and I am proud to have their support. http:// Billlee.com/lawenforcement .", "2018-10-06T17:18:25.000Z": "Sign up to get your yard sign today by going to http:// BillLee.com/yardsign ! Quote Tweet Forrest Barnwell-Hagemeyer @ForrestBH Signs going up all across the state!\nJust delivered some across East Tennessee this morning. \nBe sure to get yours, and show your support for @BillLeeTN as we work towards victory in November!", "2018-10-05T19:03:18.000Z": "Team Lee is putting out yard signs, knocking on doors, and making phone calls all around the state, and we can't do it without our volunteers! Join us today by going to http:// BillLee.com/volunteer", "2018-10-05T17:35:45.000Z": "I might not be able to rock a bow tie like @RyanWilliamsTN or @SenBoWatson , but I'm proud to support @MetroDrug today for #NASMonthTN . Quote Tweet Metro Drug Coalition @MetroDrug Tomorrow is Pearls & Bowties for Babies day to raise awareness about Neonatal Abstinence Syndrome in TN. Not sure how to caption your picture tomorrow? Check out these ideas! We can't wait to see your photos and don't forget to use the hashtag #NASMonthTN !", "2018-10-05T01:52:52.000Z": "Memphis is buzzing tonight with #MemphisMadness . Welcome back to @Memphis_MBB Coach Hardaway!", "2018-10-04T20:53:24.000Z": "\"I support Bill because he will run the office of governor like he is running his campaign - open, honest, and fair,\" Jerri Siegrist, highest-ranking female commissioned TBI agent in Tennessee history", "2018-10-04T20:50:52.000Z": "\"The foremost role of government under Tennessee's Constitution is public safety, and as prosecutors, we are excited to work with Bill Lee on these important issues,\" District Attorney General Russell Johnson, Roane County", "2018-10-04T20:48:26.000Z": "These men and women risk their lives every day to keep our neighborhoods safe, and I am proud to have their support. http:// BillLee.com/lawenforcement", "2018-10-04T20:43:28.000Z": "The primary duty of a governor is to protect the state and its citizens.  To do that, law enforcement must play a key role. That's why I have brought together a statewide coalition of more than 70 law enforcement leaders including sheriffs, police, and district attorneys.", "2018-10-04T14:46:38.000Z": "It was great to be with the Tennessee Sheriffs' Association this morning. Our law enforcement community works every day to keep our neighborhoods safe, and I was grateful for the opportunity to speak with them.", "2018-10-03T22:27:06.000Z": "Great work by @LamarAlexander in getting this legislation passed. The opioid crisis may very well be the biggest crisis that our next governor will face, and we need to use every tool at our disposal to fight it. Quote Tweet Lamar Alexander @LamarAlexander Today, the U.S. Senate passed legislation I sponsored to help Tennessee fight the opioid crisis. From @washingtonpost : It is one of Congress's most significant legislative achievements this year, a rare bipartisan response to a growing public health crisis...\" twitter.com/washingtonpost", "2018-10-03T19:16:30.000Z": "It has been an absolute privilege to run for governor over the last year and half. If given the opportunity to serve, I will work to make life better for every Tennessean. Because not only do I believe we can make this a better place for all, I believe TN can lead the nation.", "2018-10-03T15:54:20.000Z": "Election Day is just over a month away, and the last day to register to vote is October 9! Register to vote today at http:// GoVoteTN.org", "2018-10-03T01:31:26.000Z": "What a great night with supporters all around the state watching the #TNGovDebate ! Thank you to all of Team Lee for all you do!", "2018-10-02T23:58:43.000Z": "One of our many great watch parties for the #TNGovDebate ! Thank you all for joining us! https:// twitter.com/BenVoytas/stat us/1047262105731321856  This Tweet is unavailable.", "null": "", "2018-10-02T23:47:40.000Z": "In business, we know that you can't improve what you don't measure. But if you measure the wrong thing or measure too much, you won't get the results you want. As governor, I'll improve our testing system and engage teachers, parents, and school leaders in our plan. #TNGovDebate", "2018-10-02T23:43:38.000Z": "As governor, I'll lift up our teaching profession with a positive working environment, and we'll improve compensation to reflect their unique value to our great state. #TNGovDebate", "2018-10-02T23:42:04.000Z": "Technology is changing transportation every day. As a state, we should embrace innovation and think twice before taking on debt for projects that don't address the root cause of the problem. #TNGovDebate", "2018-10-02T23:37:23.000Z": "As someone who has worked in breaking the cycle of recidivism, I know that we can be both tough on crime and smart on crime at the same time. #TNGovDebate Quote Tweet Bill Lee @BillLeeTN It was a special moment for me today to go back to a prison and talk with inmates that helped inspire me to begin this journey in the first place. https:// twitter.com/billleetn/stat us/976877873083703296 ", "2018-10-02T23:35:13.000Z": "Last year over 1,700 Tennesseans died from an opioid overdose. As governor I will work with treatment providers, community organizations, law enforcement, and families on a comprehensive strategy to solve this crisis. #TNGovDebate", "2018-02-01T16:13:08.000Z": "I will be committed to transparency at every level of government. At my company, we've digitized most of our documents, and we should do the same in government. The public should have improved access to records and quicker responses to open records requests. #tnpress", "2018-10-02T23:25:23.000Z": "I don't just talk about workforce development, I've done it. I lead a company that employs folks in the trades, and I know how what it takes to employ them. We need to be aggressive on vocational, technical and agricultural education in this state. #TNGovDebate", "2018-10-02T23:18:31.000Z": "Honored to have the support of Superintendent Dorsey Hopson, who has worked tirelessly to innovate solutions for at-risk schools. Let's give every school leader in our state the tools they need to be creative and help their students succeed. #TNGovDebate", "2018-10-02T23:10:54.000Z": "Every Tennessean deserves to live in a safe neighborhood. I'm proud to have the support of law enforcement across our state, brave men and women who put their lives on the line everyday. I will work to support them and ensure that our communities are safe. #TNGovDebate", "2018-10-02T23:04:05.000Z": "Every Tennessean deserves access to quality healthcare that they can afford. #TNGovDebate", "2018-10-02T22:53:18.000Z": "Team Lee is out in full force tonight all across the state getting ready to watch the #TNGovDebate .", "2018-10-02T22:45:24.000Z": "\"I am very excited about Bill Lee's leadership and his vision for our great state. Bill is a thoughtful and compassionate leader and he is committed to improving the lives of everyday Tennesseans.\" Dorsey Hopson, Superintendent Shelby County Schools", "2018-10-02T22:26:50.000Z": "\"I talked with Bill and what did I find? He presents an opportunity for all people to participate in society.\" Bishop David Allen Hall, Black Farmers and Agriculturalists Association", "2018-10-02T22:07:06.000Z": "\"My meeting with Bill Lee was such a wonderful experience. I think he will be Governor for all the people of Tennessee, not just along party lines.\" Dr. Roosevelt T. Joyner, Former President of the Memphis Baptist Ministerial Association", "2018-10-02T21:46:15.000Z": "\"Bill Lee has lived a life of leadership and service that resonates with my family and me. He will be an outstanding education governor.\" Dr. Marlon King, Superintendent Fayette County Schools", "2018-10-02T21:26:31.000Z": "\"Bill Lee will be a governor who will work tirelessly to ensure that ALL Tennessee students are equipped with the knowledge and skills to succeed.\" Teresa Sloyan, education reformer", "2018-10-02T21:05:57.000Z": "\"Bill Lee is committed to improving our criminal justice system while never forgetting our duty to protect victims\" Amy Weirich, District Attorney General, Shelby County", "2018-10-02T20:47:48.000Z": "\"I was extremely impressed with Bill Lee. I believe he will be competent in his work, loyal to his task, excellent in human relations, and have high character beyond reproach. Therefore, I'm happy to support Bill Lee.\" Bishop E. Lynn Brown", "2018-10-02T20:26:30.000Z": "\"It is easy to trust Bill to lead Tennessee as our governor promoting those values that we cherish. His integrity, passion and vision portray his leadership for the future.\"  Mark Luttrell, former Shelby County Mayor", "2018-10-02T19:48:47.000Z": "\"As someone who has devoted my life to healthcare, I value Bill Lee's compassionate and caring approach because I believe that will make a difference for the wellbeing of Tennesseans.\" - Cato Johnson, Memphis community leader.", "2018-10-01T23:18:15.000Z": "It is an honor to welcome @POTUS back to Tennessee! Elections matter. We're 36 days from November 6th, and we need everyone to turn out and vote for the @GOP . #TeamLee  #TeamMarsha", "2018-10-01T17:03:03.000Z": "Join Team Lee to watch the debate tomorrow at watch parties around the state! Go to http:// BillLee.com/events to find out where the closest watch party is to you!", "2018-09-29T22:55:22.000Z": "Dinner time at Triple L Ranch. Great day on the trail today.", "2018-09-29T22:17:51.000Z": "We had a great Super Saturday today! Volunteers knocked on doors, made phone calls and put out signs all around the state. Join us for our next Super Saturday by going to http:// BillLee.com/volunteer !", "2018-09-29T20:04:17.000Z": "Maria and I had a great time tailgating with fans of two great Tennessee teams today before the TSU-Vanderbilt game.", "2018-09-29T18:13:37.000Z": "More pictures coming in from Super Saturday!", "2018-09-29T17:57:05.000Z": "We had a great second stop of the day in Robertson County on the #BelieveinTN tour. We're coming your way soon, and we'll see you soon!", "2018-09-29T16:21:40.000Z": "What a great event in Ashland City this morning! Thank you to Senator Kerry Roberts for hosting us, and thank you to everyone who joined us! #BelieveinTN", "2018-09-29T15:36:30.000Z": "Super Saturday is off to a great start! Drop by one of our offices around the state any time today to join Team Lee!", "2018-09-28T22:56:22.000Z": "We had a great last stop of the day touring the Lincoln County Industrial Park on the #BelieveinTN tour. We're coming your way soon, and we'll see you soon!", "2018-09-28T21:48:06.000Z": "Great to be at the Moore County High School homecoming parade today! #BelieveinTN", "2018-09-28T20:19:16.000Z": "What a great stop in Lynchburg today with Senator Shane Reeves, Mayor Bonnie Lewis, and Iris Rudder at the Moore County High School homecoming parade. #BelieveinTN", "2018-09-28T20:15:01.000Z": "We had a great event in Winchester on the #BelieveinTN tour. Thank you to Senator Janice Bowling and Iris Rudder for hosting me, and thank you to everyone who joined us!", "2018-09-28T16:35:57.000Z": "Thank you to Senator Janice Bowling and Representative Rick Tillis for hosting us on our first #BelieveinTN stop of the day. We're coming your way soon!", "2018-09-28T11:02:07.000Z": "Maria and I are heartbroken over the loss of Phil Trenary. I have gotten to know him over the past couple of years, and he was a tremendous ambassador for Memphis. We are praying for healing for his family in the days and weeks ahead.", "2018-09-27T19:40:08.000Z": "\"We have 4 out of 10 kids in the state that don't go to college. Every kid in Tennessee ought to have their life changed through the power of a good education.\"\nWe had a great stop in Rhea County this week.  Thank you to the Herald News for joining us! Bill Lee makes campaign stop at Bryan College GOP gubernatorial candidate talks state and private sector's role in education rheaheraldnews.com", "2018-09-27T16:13:16.000Z": "We need your help knocking on doors, making phone calls and putting up yard signs! Go to http:// BillLee.com/volunteer and join Team Lee today!", "2018-09-26T20:56:13.000Z": "Join our campaign for a tailgate before the game on Saturday and get your TSU or Vanderbilt Bill Lee koozie! https:// facebook.com/events/6823836 62141313/ ", "2018-09-26T18:15:37.000Z": "Join Team Lee this Super Saturday for a statewide day of action. Our volunteers will be knocking on doors and making phone calls all day, and we need your help! https:// facebook.com/events/2219007 114982256/?ti=icl ", "2018-09-25T21:55:35.000Z": "Congratulations to @randyboyd on his unanimous confirmation today to be The University of Tennessee's Interim President. He will do a terrific job leading the UT system.", "2018-09-25T21:05:10.000Z": "My latest ad is about experience. I'm a father of 4, a grandfather of 5. I'm chairman of a company with 1,200 employees that's been named the best place to work by the Tennessean. I'm a 7th-generation Tennessean and a 3rd-generation cattle farmer. That's experience that matters.", "2018-09-25T20:28:04.000Z": "What a great event in Pikeville today on the #BelieveinTN tour. Thank you to @PaulBaileyforTN and @RonTravis31 for hosting us!", "2018-09-25T18:43:43.000Z": "Our campaign has been to 50 counties so far since August on the #BelieveinTN tour. Can you chip in $50 today to help us get to the next 45? Bill Lee for Tennessee Join me in supporting Bill Lee for Tennessee - https://secure.anedot.com/billfortn/50counties secure.anedot.com", "2018-09-25T18:15:53.000Z": "Great to be in Rhea County this morning at Bryan College on our 50th stop of the #BelieveinTN tour. We've been to 50 counties so far on our campaign to elect the 50th governor of our state, and we're coming your way soon!", "2018-09-25T15:35:02.000Z": "Today is #NationalVoterRegistrationDay , and October 9 is the last day to register to vote in the upcoming election. Go to http:// GoVoteTN.com and register to vote today!", "2018-09-24T22:08:25.000Z": "Tennessee is a remarkable place to live, but I believe it can be an even better. Like and share if you agree that Tennessee can lead the nation. #BelieveinTN", "2018-09-24T19:27:28.000Z": "\"I think that people, everywhere I go, want a good job and a good school for their kids and a safe neighborhood.\"  We had a great stop in Maryville on Saturday. Thank you to The Daily Times for joining us! GOP gubernatorial nominee Bill Lee visits Maryville Tennessee's GOP gubernatorial nominee Bill Lee hit the campaign trail Saturday, making a stop in Maryville to speak with prospective voters. thedailytimes.com", "2018-09-24T17:51:13.000Z": "Super Saturday is coming up! Our volunteers will be knocking on doors and making phone calls all around the state! Join Team Lee by going to http:// BillLee.com/volunteer", "2018-09-23T22:25:31.000Z": "Since August 3 we've held events in 49 counties, and we're going to all 95 counties before Election Day! To see where we'll be next, go to http:// BillLee.com/events . We're coming your way, and we'll see you soon!", "2018-09-22T22:32:40.000Z": "It's football time in Tennessee! We had a great time tailgating before the game today in Knoxville. #GBO", "2018-09-22T19:11:15.000Z": "Maria and I had a great time going door to door with @timburchett and @RepEddieSmith . Thank you to all the volunteers out with us today, and to all of our volunteers knocking doors around the state!", "2018-09-22T17:55:12.000Z": "Great to be in Maryville today with @LamarAlexander and @timburchett . It's a great day in East Tennessee on the #BelieveinTN tour, see where we'll be next at http:// BillLee.com/events !", "2018-09-22T17:52:01.000Z": "We had a great first stop of the day in Loudon County this morning. Thank you to @timburchett for hosting me, and thank you to everyone who joined us. #BelieveinTN", "2018-09-21T23:38:09.000Z": "What a great event tonight in Cumberland County on the #BelieveinTN tour. Thank you to @PaulBaileyforTN , @CSexton25 , @JohnRoseforTN and everyone who joined us. We're coming your way soon!", "2018-09-21T21:18:18.000Z": "Come join our team and the @TNGOP to tailgate before Tennessee plays Florida, and sign up to volunteer at http:// BillLee.com/volunteer to get your Bill Lee koozie!", "2018-09-21T18:27:59.000Z": "Good to see @ChrisCoxNRA and @TNGOP chair Scott Golden today at CPAC 365: Knoxville.", "2018-09-21T17:28:52.000Z": "Great to be at CPAC 365: Knoxville with @mike_pence . Conservative principles work; that's why our state has low taxes and low debt. And that's why I believe Tennessee can lead the nation. #BelieveinTN", "2018-09-21T15:44:53.000Z": "Honored to have the endorsement of the NRA", "2018-09-21T14:27:47.000Z": "Great to be with the East Tennessee Economic Council in Oak Ridge. Tennessee is an incredible place to live, and I'm humbled by the men and women here who are working hard to support their community, our state, and our nation.", "2018-09-20T22:23:05.000Z": "It was great to be in Union County today on the #BelieveinTN tour. Thank you to @DennisHPowers for hosting me, and to everyone who joined us today.", "2018-09-20T21:07:50.000Z": "Honored to be in Claiborne County today to tour @LMUtweets as part of my #BelieveinTN Tour. LMU is doing remarkable work in higher education, and I'm excited for what they have in store in the future. See where we'll be next at http:// BillLee.com/events", "2018-09-20T15:34:55.000Z": "I enjoyed the opportunity to be with the @_tnhta today talking about the importance of tourism to our state. Thanks for having me!", "2018-09-20T15:03:26.000Z": "Happy Birthday to @KarlFDean. I appreciate the opportunity to share the stage with you and I hope you get to take a minute from the campaign trail to celebrate today. Again, Happy Birthday!", "2018-09-20T13:05:15.000Z": "It was a beautiful morning in Kingsport this morning!", "2018-09-19T21:36:35.000Z": "Volunteers all across the state are out putting up yard signs, making phone calls and knocking on doors for Team Lee. Join our campaign today by going to http:// BillLee.com/volunteer", "2018-09-19T19:54:08.000Z": "It was great to be in Selmer today on the #BelieveinTN tour with so many friends, including Representative @RonGant and Mayor Larry Smith. Thank you to everyone who came out!", "2018-09-19T16:50:28.000Z": "Great to be in Hardin County on the #BelieveinTN tour today. Thank you to Mayor Bob Shutt for hosting me, and to everyone who joined us. We're coming your way soon!", "2018-09-19T15:29:29.000Z": "Congratulations to my friend @RandyBoyd on the opportunity to serve as interim president of the University of Tennessee system. He is a tremendous leader who will help guide the university to even greater heights.", "2018-09-18T20:17:11.000Z": "I enjoyed speaking to fellow business leaders at the @TNchamber today, discussing the issues that drive our state's economy. As governor, I will work with industry leaders to develop a strong workforce and grow more high paying jobs for Tennessee.", "2018-09-18T17:52:21.000Z": "Happy birthday to the U.S. Air Force! Quote Tweet U.S. Air Force @usairforce Today we celebrate 71 years as the world's greatest #AIRPOWER ! #Birthday  #AFBDay", "2018-09-18T16:06:38.000Z": "I was honored to speak today at the opening of Valor Ridge, a facility that will house newly released ex-offenders in Nashville. Over 95% of those who are incarcerated reenter society, and organizations like @MOVnashville help them get back to being productive citizens.", "2018-09-17T22:38:46.000Z": "Maria and I #GotCaughtReading with the grandkids yesterday. @TNImagination has mailed over 33 million books since 2004, and I hope you'll join me this week in celebrating this great organization and the importance of early childhood literacy.", "2018-09-17T21:40:13.000Z": "I was honored to meet with Bishop E. Lynn Brown and members of the Christian Methodist Episcopal church in Memphis today.  I was inspired by your stories of marching with Dr. King; thank you for all you have done and are continuing to do for our state.", "2018-09-17T19:45:31.000Z": "Great to be with so many pastors and faith leaders at @Hope4Memphis today, talking about why I believe faith is important to the future of our state.", "2018-09-17T17:36:51.000Z": "Enjoyed the opportunity to meet with Thomas Burrell and Bishop David Hall of the Black Farmers and Agriculturalists Association in Memphis today to talk about how we can engage our state's youth in agriculture. Organizations like these make me #BelieveinTN !", "2018-09-17T15:56:42.000Z": "\"To live under the American Constitution is the greatest political privilege that was ever accorded to the human race.\" - Calvin Coolidge #ConstitutionDay", "2018-09-16T00:03:13.000Z": "We had a great last stop of the day on the #BelieveinTN tour in Decatur County. Thank you so much to everyone who came out and joined us today!", "2018-09-15T22:51:26.000Z": "What a great Super Saturday with volunteers all across the state. Join us for the next super Saturday on September 29 by going to http:// BillLee.com/volunteer", "2018-09-15T22:15:56.000Z": "Great fourth stop of the day today in Perry County. We're headed to Decatur County next on the #BelieveinTN tour, we'll see you soon!", "2018-09-15T21:53:48.000Z": "Thank you to everyone who joined us in Linden today, and thank you to @mayormoore2002 and Republican Nominee for District 72 State Representative @KirkHaston35IU for hosting me. #BelieveinTN", "2018-09-15T19:48:13.000Z": "Thank you to Senator Joey Hensley, Mayor Danny McKnight and Mayor Jonah Keltner for joining me at the Little Swan Hunting Club Fish Fry this afternoon.  Two more stops today on the #BelieveinTN tour, we're coming your way soon!", "2018-09-15T18:42:33.000Z": "More pictures from super Saturday coming in! Volunteers all across the state are out knocking doors and making phone calls. Join us at http:// BillLee.com/volunteer", "2018-09-15T17:33:01.000Z": "It's always great to be in Wayne County with my good friend Jim Mangabut. Thank you to everyone who joined us today!", "2018-09-15T16:37:24.000Z": "I enjoyed the opportunity to stop by the Walk 4 Water with @HHIupdates in Lawrenceburg today. This is a great organization working to raise money to build wells all over the world.", "2018-09-15T16:04:47.000Z": "Super Saturday is in full swing! This campaign is powered by volunteers across the state. Join Team Lee, as we work towards victory in November! http:// BillLee.com/Volunteer", "2018-09-15T15:32:32.000Z": "We had a great first stop of the day on the #BelieveinTN tour in Lawrenceburg this morning. Four more stops today, we'll see you soon!", "2018-09-15T13:26:49.000Z": "Super Saturday is off to a great start! Come join Team Lee as we work towards victory in November!", "2018-09-14T20:30:01.000Z": "Our campaign is going to all 95 counties in 95 days on the #BelieveinTN tour. We've hit 35 counties as of today, and we'll be visiting 14 more next week! See where we'll be next at http:// BillLee.com/events", "2018-09-14T18:21:09.000Z": "It was great to be in DeKalb County last week on the #BelieveinTN tour. Thank you to WJLE in Smithville for joining us! GOP Governor Candidate Bill Lee Brings His \"Believe in Tennessee Tour\" to Smithville (VIEW VIDEO... wjle.com", "2018-09-14T16:05:00.000Z": "Tomorrow is Super Saturday! We'll be knocking doors and making phone calls all day, and we would love your help.  Drop by your local field office any time during the day and we'll get you plugged in! To find out where the closest office is to you go to https:// facebook.com/events/2982232 74312233/ ", "2018-09-13T23:28:24.000Z": "I enjoyed the opportunity to tour the Frank P. Lashlee Career and Technical Center this afternoon.  Places like this, with programs such as machining, agriculture and construction, are helping Tennesseans make better lives by offering vocational training, and make me #BelieveinTN", "2018-09-13T21:02:58.000Z": "Great to be in Humphreys County with @JayDReedy and so many friends today on the #BelieveinTN tour.  Thank you to everyone who joined us today, we're coming your way soon!", "2018-09-13T18:23:39.000Z": "Thank you to @SenatorRoberts , @StateRepCurcio and everyone that joined us today in Hickman County for a great stop on the #BelieveinTN tour.", "2018-09-13T15:56:09.000Z": "My new ad is on the air today.  At Lee Company, we trained more than 1,000 skilled tradesmen in the last ten years.  I don't just talk about vocational training; I've actually done it.", "2018-09-13T14:04:25.000Z": "Tennesseans have a long history of volunteering when others are in times of need. Proud of these Tennesseans for going above and beyond in their service to others. Quote Tweet Knoxville Fire @KnoxvilleFire Emergency workers from East Tennessee this morning heading over to South Carolina to assist during and after hurricane Florence", "2018-09-12T20:48:51.000Z": "Firefighters put themselves on the line every day to protect their communities.  I am proud to have the support and endorsement of the @tpffa1 in my campaign for governor. Quote Tweet TPFFA @tpffa1 The Tennessee Professional Fire Fighters Association announced today its endorsement of Republican Bill Lee for Governor in the November 6th General Election. \n\n\"Our members put their lives on the line every day to... https:// facebook.com/tpffatn/posts/ 2316810195058400 ", "2018-09-12T19:44:32.000Z": "This Saturday is Super Saturday! Volunteers across the state will be knocking doors and making phone calls all day, and we would love to have your help! Join Team Lee by going to http:// BillLee.com/volunteer , or find your local field office at the link below: https:// facebook.com/events/2982232 74312233/ ", "2018-09-12T16:43:13.000Z": "Only fifty-five days to election day! Donate $55 today and help push Team Lee over the finish line! Bill Lee for Tennessee Join me in supporting Bill Lee for Tennessee - https://secure.anedot.com/billfortn/55days secure.anedot.com", "2018-09-11T22:25:26.000Z": "Thank you to @ltgovmcnally and @senmikebell for joining me at Miracle Lake Ministries today in McMinn County. This phenomenal organization is doing great work helping folks recover from addiction. #BelieveinTN", "2018-09-11T20:47:13.000Z": "Thank you to everyone that joined us in Polk County this afternoon.  We're headed to McMinn county next on the #BelieveinTN tour, we'll see you soon!", "2018-09-11T19:21:42.000Z": "Enjoyed touring Benton Country Hams in Madisonville today. Local businesses like this make me #BelieveinTN .", "2018-09-11T17:36:37.000Z": "Great event in Monroe County today on the #BelieveinTN tour, talking about why I believe that faith and family aren't old fashioned values; they're critically important to the health of our state.", "2018-09-11T16:21:42.000Z": "Awesome morning in Roane County with so many friends and supporters. Thank you to Sheriff Stockton and the other first responders that joined us this morning. #BelieveinTN", "2018-09-11T14:55:40.000Z": "Great morning at @thelegacycentre in Knoxville with my good friends Tim Burchett and Jason Zachary. We have four stops left today on the #BelieveinTN tour; we're coming your way soon and we'll see you soon!", "2018-09-11T11:53:57.000Z": "17 years ago, our country & our way of life came under attack. Today, we take time to honor the victims, their families and the many heroes who defined that day and the aftermath - from first responders to ordinary citizens, many of whom made the ultimate sacrifice. #weremember", "2018-09-10T20:40:19.000Z": "Great to be in Fentress County today on the #BelieveinTN tour. Thank you to everyone that joined us today; we'll see you soon!", "2018-09-10T18:53:45.000Z": "Thank you to Representative Kelly Keisling and Senator Ken Yager for having me today in Pickett County. America is looking for states to lead, and I believe Tennessee can be that state. #BelieveinTN", "2018-09-10T15:11:43.000Z": "It was great to be with the @tnffa at the Tennessee State Fairgrounds this morning for breakfast.  FFA is part of TN's proud ag tradition and we must make sure that way of life is protected and valued.", "2018-09-09T00:19:38.000Z": "Enjoyed being with Bill Ketron and so many friends in Murfreesboro at MTSU before they played UT Martin. Check out where we'll be tailgating next at http:// BillLee.com/events", "2018-09-08T22:09:33.000Z": "Good to be back in Coffee County as part of our #BelieveinTN tour. Thank you so much to my good friend Janice Bowling for hosting us and to everyone who came out to join us today.", "2018-09-08T18:50:19.000Z": "Great day out on the #BelieveinTN tour talking about why I believe Tennessee can lead the nation. We'll see you soon!", "2018-09-08T18:16:22.000Z": "Great to be at the Warren County Fair today on my #BelieveinTN tour. We're going to Coffee County and Rutherford County next. We're coming your way soon and we'll see you soon!", "2018-09-08T16:01:42.000Z": "Thank you to @mark_pody , @ClarkBoydTN and everyone that joined me this morning in Woodbury. I was also very happy to meet Ruby King, who turns 107 today. Happy Birthday!", "2018-09-08T12:04:49.000Z": "The ... @timesnewsonline  headline this morning says it all.", "2018-09-07T23:42:12.000Z": "College football is back, and our campaign looks forward to tailgating with you. Check out when we'll be on your campus for gameday at http:// BillLee.com/events", "2018-09-07T21:33:06.000Z": "Thank you @mark_pody for hosting us at our last stop of the day in Smithville.  I enjoyed the opportunity to be with so many friends talking about why I #BelieveinTN .", "2018-09-07T18:35:43.000Z": "Enjoyed being with so many members of the law enforcement community today in Morgan County. Law enforcement and first responders are on the front lines everyday ensuring that Tennesseans have safe neighborhoods, and it's these men and women that make me #BelieveinTN .", "2018-09-07T14:15:01.000Z": "Great to be in Rogersville this morning on my first #BelieveinTN stop of the day. Thank you to Congressman Bill Jenkins, State Representative Gary Hicks and everyone who came out and joined us today.", "2018-09-06T22:29:18.000Z": "We've been to eighteen counties since August on the #BelieveinTN tour, and we'll be in fourteen more next week. To see where we'll be next, check out http:// BillLee.com/events .", "2018-09-06T21:06:48.000Z": "Thank you to @JeremyFaison4TN and @TilmanGoins for being with me today in Dandridge.  Always great to be surrounded by so many friends and supporters in East Tennessee. #BelieveinTN", "2018-09-06T15:52:51.000Z": "Reading is so important to help everyone get ahead. Maria and I celebrate #NationalReadABook day and we hope you can take some time today to join us.", "2018-09-06T14:13:25.000Z": "Join Bill Saturday on @MTSU campus to tailgate before the Blue Raiders play UT Martin. We'll see you there! For more details, go to https:// facebook.com/events/2920270 38259241/?ti=icl ", "2018-09-05T21:39:56.000Z": "It was an honor to visit @SRVSNews this afternoon in Memphis. Thankful for organizations like this working to enhance the lives of Tennesseans with disabilities.", "2018-09-05T20:20:14.000Z": "It is so inspiring to visit with students, teachers, and parents at Libertas School of Memphis in Frayser. Every child deserves a great education, and innovative schools like this are helping do just that.", "2018-09-05T19:04:18.000Z": "We're continuing our day in Shelby County, this time with so many friends and supporters as part of my #BelieveinTN tour at the Shelby County GOP Headquarters. Thank you to everyone who came out and joined us!", "2018-09-05T17:19:59.000Z": "It's great to be in Shelby County today speaking to such dedicated conservative women at the Republican Women of Purpose this morning. Thanks for what you're doing for West Tennessee!", "2018-09-05T14:56:43.000Z": "Great to be in Somerville this morning for my first #BelieveinTN stop of the day. The farming and agribusiness community is vitally important to our state, and is a community that I care about deeply. Thank you to Willie German for hosting!", "2018-09-05T01:16:17.000Z": "Great to be with the Hardeman County Republican Party in Bolivar tonight to end a great day in West Tennessee on my #BelieveinTN tour", "2018-09-04T23:37:11.000Z": "Ten months ago, I pulled into @freedhardeman as part of our tractor tour, talking about my roadmap for rural Tennessee.  It's great to be back here today with so many friends, both old and new, as part of my #BelieveinTN tour.", "2018-09-04T21:38:51.000Z": "Great to be back at the Princess Theatre in Lexington talking about why I #BelieveinTN . We have four more West Tennessee counties to go to today and tomorrow. See where we'll be next at http:// BillLee.com/events . We'll see you soon!", "2018-09-04T16:53:46.000Z": "I also released a specific ad in the primary highlighting how I will prioritize Memphis and Shelby County.", "2018-09-04T16:51:13.000Z": "ICYMI, I was the first candidate in this race to release a detailed plan on Memphis and Shelby County.  You can read my plan at http:// billlee.com/memphis .", "2018-09-03T20:14:39.000Z": "Had a great Labor Day at the TWRF Heritage Club Dove Hunt in Houston County supporting a remarkable organization working to preserve the legacy of the outdoors all across our state.", "2018-09-03T15:13:18.000Z": "It's such an honor to lead a company of 1,200 plumbers, pipefitters, welders and electricians. Hard work is the core of what we do every day, and it is that same work ethic I pledge to bring to the governor's office. Happy Labor Day.", "2018-09-02T20:10:46.000Z": "Sign up to volunteer at the link below and join Team Lee today! http:// Billlee.com/volunteer", "2018-08-31T23:44:01.000Z": "On our way back from East Tennessee this evening, we stopped to see Adam who just started at Cumberland University and is running track. I'm so proud of him.", "2018-08-31T21:13:14.000Z": "Enjoyed my afternoon at @ORNL with @LamarAlexander and @RepChuck . Great opportunity to see the incredible innovation that is happening right here in Tennessee.", "2018-08-30T16:26:21.000Z": "Entrepreneurship is not a set of skills you learn, it is a mindset that we should introduce to our students through work-based learning. Thank you to @LaunchTN for having me today at @3686Fest", "2018-08-29T16:21:55.000Z": "My first ad for the General Election is on the air today. I've never run for office before and it's an interesting experience. You learn some things, like politics isn't the solution, it's generally the problem. People are the solution.", "2018-08-28T21:55:26.000Z": "Great to be at the Smith County Farmers Market in Carthage today. I felt right at home, because my family has been selling meat to farmers markets like this for years. I enjoyed talking about my ideas for how Tennessee can lead the nation. #BelieveinTN", "2018-08-27T21:17:15.000Z": "In business, we know that good is the enemy of great.  Like and Share if you agree that Tennessee can lead the nation.", "2018-08-26T01:02:46.000Z": "John McCain was an American hero, and a statesman who dedicated his life to the service of others. Maria and I are praying for the entire McCain family this evening as we remember his selfless contributions to our nation.", "2018-08-25T01:12:40.000Z": "Great to be with the Red River GOP Women's Club tonight talking about why I #BelieveinTN", "2018-08-24T20:08:51.000Z": "Last year over 1,700 Tennesseans died from an opioid overdose. Every Tennessean needs to work together to solve this crisis. Thank you @drmannyht for putting together this meaningful #HealthyTN opioid summit today.", "2018-08-24T17:04:13.000Z": "Great to be with so many local leaders from across our state, talking about why I #BelieveinTN .  Thank you to the Association of County Mayors for having me", "2018-08-23T19:14:44.000Z": "Fresh batch of yard signs just came in!  Show your support for the campaign in your area by getting one at http:// billlee.com/yardsign", "2018-08-23T15:17:00.000Z": "Happy birthday @BillHaslam . Thank you for your continued work on behalf of our state.", "2018-08-23T00:46:34.000Z": "Great way to end the day with a fifth stop in Union City at Cox Oil. Had a great day in West Tennessee. We'll be coming your way soon and we'll see you soon! #BelieveinTN", "2018-08-22T22:30:02.000Z": "Good to be in Halls this afternoon at Hurt Seed Company, talking about my vision for the state and why I believe Tennessee can go from good to great. #BelieveinTN", "2018-08-22T20:54:41.000Z": "Great stop earlier in Humboldt with my friend @DavidKustoff . Two more stops left today on our swing through West Tennessee.  We'll see you soon!", "2018-08-22T18:25:06.000Z": "Second stop of the day is in the books! Great to be at the West Tennessee Farmer's market in Jackson, and thank you to the Vietnam Veterans Color Guard for presenting the colors. I am deeply grateful for our veterans and their service. #BelieveinTN", "2018-08-22T15:51:05.000Z": "Enjoyed being with so many supporters at the Chandler's farm shop in McKenzie this morning, talking about why I #BelieveinTN .  We have four more stops left today, and to see where we'll be next go to http:// billlee.com/events", "2018-08-22T15:26:39.000Z": "Great to be in Carroll County this morning on our #BelieveinTN tour with my good friend @StephenFincher .  I'm committed to preserving the future of agriculture and preserving this way of life.  To learn more about my plan for rural Tennessee, go to http:// ruralroadmap.billlee.com", "2018-08-22T12:55:31.000Z": "What happens in rural Tennessee matters to every Tennessean which is why we built a Rural Roadmap for the future of our state. We're on the trail today in five rural West TN counties and invite you to join us in Carroll, Madison, Gibson, Lauderdale and Obion! #BelieveinTN", "2018-08-21T20:05:30.000Z": "Join Team Lee today! Click the link below and let us know how you can get involved! http:// Billlee.com/volunteer", "2018-08-21T17:36:48.000Z": "Our teachers are on the front line, and if we don't set them up for success, then we're failing them & our students. As a CEO, we know that leaders lead best when they listen. I'm glad to see @BillHaslam working with our educators to make sure we keep moving forward.", "2018-08-20T21:20:18.000Z": "\"Tennessee has a culture that is set up to lead the nation and I believe we can.\" - Bill Lee. Read more via @timesnewsonline  #ICYMI State primed for greater things, gubernatorial candidate says KINGSPORT - Tennessee GOP gubernatorial nominee Bill Lee noted there are great things about state government - timesnews.net", "2018-08-19T20:01:05.000Z": "Traveling across our state, Tennesseans have confirmed something I knew when I decided to run: this is a remarkable place. But good is the enemy of great. No matter how well we've done, TN won't reach her potential unless we keep innovating. #BelieveinTN Bill Lee: Believing Tennessee can lead the nation | Opinion We must work to ensure that Tennesseans have good jobs, good schools and safe neighborhoods. tennessean.com", "2018-08-19T00:26:57.000Z": "The Bristol Night Race is one of the best events in sports. It was so much fun to be with so many fans this evening. #BassProNRANightRace", "2018-08-18T21:57:54.000Z": "Good to be back at the Isaiah 117 House in Elizabethton. It is a great organization that is helping their fellow citizens in many ways. #BelieveinTN", "2018-08-18T19:02:49.000Z": "Thank you Elizabethton for the warm welcome on our #BelieveinTN tour @bgc_ecc . To see where we'll be next, check in at http:// Billlee.com/events . We'll see you soon!", "2018-08-18T16:47:02.000Z": "Great to be back in Mountain City this morning to kick off our #BelieveinTN Tour, talking about my vision for our state. Thank you all so much for your support!", "2018-08-17T22:54:50.000Z": "Thank you to the @kptchamber for having me speak this afternoon. We talked about a lot of topics that are important to business, and as governor I look forward to making this an even better state to do business.", "2018-08-17T20:38:33.000Z": "It is great to be back in the Tri-Cities today to speak at the Kingsport Kiwanis Club. We talked about the issues facing Upper East Tennessee and why I believe Tennessee can lead the nation. Thanks for coming out!", "2018-08-16T21:11:37.000Z": "One year ago today we began our Tractor Tour, starting in Mountain City & traveling 758 miles all the way to Memphis. I drove my tractor to bring attention to the issues our rural communities face. To find out more about my plan for rural Tennessee, visit http:// ruralroadmap.billlee.com", "2018-08-16T15:13:45.000Z": "Aretha Franklin, the Queen of Soul, was born in Memphis, and Tennesseans were so proud of her legacy. While she's left us in body today, her music will live on forever. Maria and I send our prayers to her family and her millions of fans who are mourning her passing today.", "2018-08-15T21:45:29.000Z": "Today I formally announced my Believe in Tennessee Tour. Tennessee is a really good place to live, but in business, we know good is the enemy of great. For Tennessee to lead the nation, we need to challenge the status quo and prioritize leadership over politics. #All95Counties", "2018-08-14T19:01:31.000Z": "I'm running for Governor, but I'm not a politician. I'm a cattle farmer, a businessman, a father, grandfather, and a seventh generation Tennessean. Learn more about my life, my campaign and why I chose to run for governor at http:// BillLee.com/about", "2018-08-13T20:01:06.000Z": "Early voting begins in just 65 days! Can you help us win in November by donating $65 today? http:// Billlee.com/donate", "2018-08-11T20:15:27.000Z": "Join the movement across Tennessee. Sign up here to volunteer and help Bill Lee's campaign for governor. https:// billlee.com/volunteer/", "2018-08-11T16:42:41.000Z": "So proud of my son Caleb, he earned his MBA from Belmont!", "2018-08-09T21:50:35.000Z": "Thanks to @FBonTheHill  @TNFarmBureau for having me at your Presidents Conference. Great to be with you and address the importance of agriculture, rural Tennessee and an emphasis on vocational, agricultural and technical education #tnprescon18", "2018-08-08T21:10:10.000Z": "Show your support for Bill! Get your Bill Lee for Governor bumper sticker today! Fill out the form and we'll have a bumper sticker delivered to your doorstep. http:// billlee.com/bumpersticker/", "2018-08-07T00:24:18.000Z": "Enjoyed spending the evening with @Tennessee4H at the Livestock Expo Parade and Auction @Williamsonfair", "2018-08-05T17:52:59.000Z": "Great @TNGOP Unity Rally last night - thanks to everyone for your support. We're united for the general election in November. #TNGOP  #APartyUnited  #LeeForTN", "2018-08-04T17:50:21.000Z": "Such an honor to be with @BillHaslam this morning @PuckettsGrocery in Franklin. Great time with so many friends and supporters.", "2018-08-03T22:14:47.000Z": "Thank you Mr. President and @mike_pence . I'm looking forward to campaigning with you and working with you to make Tennessee even better! Quote Tweet Donald J. Trump @realDonaldTrump Congratulations to Bill Lee of Tennessee on his big primary win for Governor last night.  He ran a great campaign and now will finish off the job in November. Bill has my total and enthusiastic Endorsement!", "2018-08-03T03:21:10.000Z": "Thank you Tennessee!!!", "2018-08-03T00:47:41.000Z": "Votes are coming in. Our Election Night party is underway at The Factory at Franklin! Michael DelGiorno and @AllWaltrip helping kickoff the night. Come on down for the celebration!", "2018-08-02T18:21:36.000Z": "We started this campaign for governor 15 months ago in Van Buren County. Our last stop today before the results tonight is in Van Buren. We've got the momentum & we're looking forward to a positive result tonight. Please vote today before 8pm eastern/7pm central. Thank you!", "2018-08-02T17:15:29.000Z": "Thanks @AllWaltrip - what a special day, brother! Such great momentum! Quote Tweet Darrell Waltrip @AllWaltrip Yesterday was a phenomenal day of campaigning for my great friend @BillLeeTN , we went to Chattanooga, Knoxville, Jonesborough and back to Knoxville last night, back home in Franklin today for the big celebration tonight, praying for a win for @BillLeeTN !!", "2018-08-02T15:49:55.000Z": "Next stop on the campaign trail today is Concord Baptist polling location in Chattanooga. We have the momentum and we're working hard for every vote! I ask for your vote. Please get to the polls today and vote before 8pm eastern/7pm central. Every vote counts!", "2018-08-02T15:09:10.000Z": "Awesome time this morning in Knoxville, meeting voters and asking for their support. Awesome energy and enthusiasm at the polls today! I ask for your vote. Please go vote today before 8pm eastern/7pm central. Thank you!", "2018-08-02T13:56:15.000Z": "It's Election Day and we have the momentum! I'd be honored to serve you as governor. I ask for your vote. Please make sure you go vote today! Polls are open until 8pm Eastern/7pm Central. Thank you, and we'll see you soon!", "2018-08-02T11:02:57.000Z": "Today is Election Day! I'd appreciate your vote! To find your polling location, visit http:// billlee.com/vote", "2018-08-02T03:38:47.000Z": "So grateful to every person we've met along the campaign! You've been a blessing to Maria & me. We finished election eve with a packed house in Jonesborough! We live in a remarkable state & I'd be honored to serve as Tennessee's next governor. Please vote on Thursday, August 2nd.", "2018-08-02T01:26:51.000Z": "Unbelievable turnout in Jonesborough this evening for our last stop of the day! The momentum continues! Great to be here with @AllWaltrip and so many wonderful friends. What a special community. Maria and I are humbled by your support.", "2018-08-02T00:13:07.000Z": "Great event in Knoxville with @AllWaltrip at Love That BBQ for our latest Roadmap to Victory stop. Please make sure you go to the polls tomorrow. I'd be honored to serve you as governor and ask for your vote.", "2018-08-01T21:44:33.000Z": "Amazing turnout and support in Chattanooga for our Roadmap to Victory tour! Great to have @AllWaltrip on the campaign trail with us today. Tomorrow is Election Day - make sure you go to the polls to vote!", "2018-08-01T19:54:09.000Z": "Great to see so many friends at Lee Company as we head towards Election Day tomorrow. I'm grateful for these folks - for the work that they do - and I'm proud of every single one of them.", "2018-08-01T14:57:43.000Z": "Great stop in Jackson for our Roadmap to Victory tour. We can feel the momentum at every stop. Make sure you vote tomorrow - Thursday, August 2nd.", "2018-08-01T13:26:36.000Z": "Tomorrow is Election Day! We're taking the #LeeRV from one end of the state to the other today, but we need your help tomorrow. Visit http:// billlee.com/vote to find your polling location and learn more about how you can volunteer to help us get to victory tomorrow! GIF", "2018-08-01T12:39:29.000Z": "Great start on the campaign trail this morning in Memphis for our Roadmap to Victory Tour. We're going to Jackson, Franklin, Chattanooga, Knoxville and Jonesborough today. Find out more at https:// billlee.com/events/", "2018-08-01T02:51:26.000Z": "Maria and I are humbled by the amazing turnout at our 100th Town Hall Celebration in our hometown of Fairview! With your help - and most importantly your vote - we'll win on Thursday! Great to have more than 600 in attendance including @AllWaltrip  @michaelwsmith  @RickySkaggs .", "2018-07-31T22:32:43.000Z": "Great town hall today in Berlin Springs. Amazing turnout and energy!", "2018-07-31T22:17:55.000Z": "Tonight, we're celebrating our 100th Tennessee Town Hall in Fairview! We're excited to hear from our special musical guests and have a great time with the hundreds who have RSVP'd. Hope you can join us tonight!", "2018-07-31T22:08:39.000Z": "Thanks to the @Tennfirechiefs for having me at their 50th Annual Conference. Our firefighters are a critical part of our communities. It was an honor to be with you today.", "2018-07-31T19:49:22.000Z": "Great turnout for our town hall in Murfreesboro today at the Rutherford County GOP HQ. Appreciate Senator @BillKetron emceeing our event today.  We're going all across Tennessee between now and Election Day. http:// BillLee.com/Events", "2018-07-31T16:31:30.000Z": "Great to be in Robertson County at the Senior Citizen Center in Springfield. Appreciate my good friend State Representative Sabi 'Doc' Kumar for emceeing the event.", "2018-07-31T16:00:01.000Z": "Tonight, we have special musical guests Country Music Hall of Fame Inductee Ricky Skaggs and Grammy Award Winning Artist Gordon Kennedy at our 100th Town Hall Celebration in Fairview! Honored to have Ricky endorse my campaign! Join us tonight - http:// billlee.com/events", "2018-07-31T15:38:32.000Z": "Great town hall this morning in Montgomery County at the William O. Beach Civic Center in Clarksville. Packed day with more town halls in Springfield, Murfreesboro, Berlin Springs and Fairview.", "2018-07-31T14:58:49.000Z": "We are TWO days from the election and there is so much enthusiasm! We're hitting the trail hard today. We started in Clarksville this morning, and we're hitting Springfield, Murfreesboro, Lewisburg and Fairview later today. Come join us! Details at http:// billlee.com/events", "2018-07-31T01:15:34.000Z": "Thanks to the Hamilton County Republican Party HQ for hosting us for a town hall tonight with voters. Always great to be in Chattanooga. I'd be honored to serve you as governor and ask for your vote on Thursday, August 2nd.", "2018-07-31T00:35:50.000Z": "Great town hall this evening in Cleveland. Thank you for your encouragement and support. We've got the momentum. Please make sure you vote on Thursday, August 2nd.", "2018-07-30T22:47:34.000Z": "For someone to say this about over half of Tennessee voters is deeply troubling. http:// foxnews.com/politics/2018/ 07/30/top-tennessee-dem-party-official-snubs-reaching-out-to-trump-voters-calls-them-idiots.html ", "2018-07-30T20:10:06.000Z": "Thanks to everyone in McMinn County for coming to our town hall this afternoon at Michael's Casual Dining in Athens. Great turnout and momentum. We're en route now to town halls in Cleveland and Chattanooga.", "2018-07-30T17:03:09.000Z": "Great town hall this morning in Knoxville at the Historic Southern Railway Station. Amazing support for our campaign. We're heading to three more town halls today in Athens, Cleveland and Chattanooga.", "2018-07-30T16:39:09.000Z": "COL Thomas B. Vaughn (Ret.): Bill Lee's opponent is making dishonest attacks on him and how he treats veterans. It's just wrong. Bill is a good man. He supports veterans. Hires them, trains them and treats them like family. They should be ashamed. Bill Lee should be governor.", "2018-07-30T15:31:56.000Z": "Honored to have the endorsement of @ScottHamilton84 in this race for governor. We're winning, but we need your help to finish with the GOLD! We need your vote on Election Day, this Thursday.", "2018-07-30T13:26:40.000Z": "We are just THREE days from Election Day, and we're campaigning hard. We're in Knox, McMinn, Bradley and Hamilton Counties today. To join us, visit http:// billlee.com/events . We're hitting every part of the state this week as we head to Election Day. The momentum grows every day!", "2018-07-29T20:16:27.000Z": "Maria and I had a great time in Maryville for our town hall on Friday. We're continuing our town hall tour this week where we will complete our 100th town hall. Read more via @DailyTimes . Gubernatorial candidate Bill Lee holds Maryville town hall Republican candidate Bill Lee believes he has what it takes to be the next governor of Tennessee.The businessman and cattle farmer from Franklin said his lack of political experience is thedailytimes.com", "2018-07-29T16:47:32.000Z": "Great to be in Elizabethton yesterday for a town hall with voters. The momentum and energy for our campaign is inspiring. You can read more about our campaign stop via @JCPress Bill Lee makes final week stop in Carter County johnsoncitypress.com", "2018-07-29T13:17:41.000Z": "Honored to have the endorsement of the @JCPress . \"On the right, Lee is checking all the right boxes for traditional Republican voters - Second Amendment protections, limited government, business acumen and tough immigration policy to name a few.\" Lee, Fitzhugh our choices for primaries johnsoncitypress.com", "2018-07-28T22:32:24.000Z": "Great to be back for a second year in a row at the Grainger County Tomato Festival.", "2018-07-28T19:40:06.000Z": "Great town hall this afternoon in Morristown! Appreciate Rep. Tilman Goins emceeing the event. Maria and I are filled with gratitude for your support.", "2018-07-28T18:14:37.000Z": "Awesome Super Saturday leading up to Election Day. Thanks to our volunteers - we're running the most aggressive grassroots campaign in Tennessee history. Maria and I are so grateful for your support.", "2018-07-28T16:39:55.000Z": "Great to be back in Elizabethton for another incredible town hall. Unbelievable turnout. Thank you so much for your support!", "2018-07-28T14:48:33.000Z": "Great Saturday morning in Johnson City. Our first town hall of the day. On our way to Elizabethton for our next town hall. Then on to Morristown and Rutledge. Today is the last day of early voting. Please vote early this Saturday or on August 2nd.", "2018-07-28T12:14:33.000Z": "Today is the last day of early voting, and then Election Day is on Thursday, which is your last chance to vote in the primary! For more details about polling places and how you can show your support on your social media channels, visit http:// billlee.com/vote !", "2018-07-28T01:57:51.000Z": "Awesome day filled with town halls. Thanks to everyone in Bristol for spending your Friday evening with our campaign. You are such a blessing to Maria and me. We're in East Tennessee again tomorrow with town halls in Johnson City, Elizabethton and Morristown.", "2018-07-27T23:09:21.000Z": "Great town hall this afternoon at the East Tennessee Coffee Company in Newport. I'm so encouraged by your support and I'd be honored to serve you as Tennessee's next governor. Please vote on Saturday during early voting or on Thursday, August 2nd on Election Day.", "2018-07-27T22:05:33.000Z": "We're campaigning in East Tennessee today. Great town hall in Maryville. Humbled by the support and momentum. Thank you!", "2018-07-27T18:50:25.000Z": "I'm so proud of @BillLeeTN and the campaign he has run, he has my full support for being the next governor of our great state! Quote Tweet Bill Lee @BillLeeTN . @AllWaltrip has a message for Tennessee voters: \"Boogity, boogity, boogity on down to the polls and vote for Bill Lee!\"", "2018-07-27T18:15:45.000Z": ". @AllWaltrip has a message for Tennessee voters: \"Boogity, boogity, boogity on down to the polls and vote for Bill Lee!\"", "2018-07-27T17:01:15.000Z": "As we're heading up to Bristol today, I wanted to thank my good friend @AllWaltrip for endorsing my campaign for governor. Make sure you're racing to the polls in the last two days of early voting!", "2018-07-27T12:29:04.000Z": "We have a new ad running this morning. Check it out, and share it! We're closing in on Election Day, and the momentum continues to build. I'd sure appreciate your vote.", "2018-07-27T01:28:48.000Z": "Thanks for your support brother! @mikefisher1212 Quote Tweet Mike Fisher @mikefisher1212 Proud to support my buddy billleetn as he runs for governor. Bill is a great man of faith and as genuine as they come! #faith  #family  https:// instagram.com/p/BltupaIFOJe/ ?utm_source=ig_twitter_share&igshid=6oy4q0xtxqk1 ", "2018-07-27T01:08:21.000Z": "Great afternoon in Shelby County with two town halls. Just finished our second town hall in Arlington. Thank you for such a warm welcome. Please remember to vote early on Friday or Saturday - or on election day, August 2nd.", "2018-07-26T20:49:05.000Z": "You can also learn more about my Roadmap for Rural Tennessee here: http:// ruralroadmap.billlee.com", "2018-07-26T20:45:21.000Z": "Great morning in Milan today at the No-Till Day. You can read more about my commitment to farming and agriculture here: https:// billlee.com/farm/", "2018-07-26T19:51:57.000Z": "Great town hall this afternoon in downtown Memphis. Appreciate the warm welcome. We're en route to our second Memphis town hall of the day. You can read more about my Commitment to Memphis and Shelby County here: https:// billlee.com/commitment-mem phis-shelby-county/ ", "2018-07-26T14:44:06.000Z": "It's an honor to have my friend @michaelwsmith support me in this campaign for governor. My faith is the most important thing in my life, and that won't change when I'm governor. Please join us as we have one week to Election Day!", "2018-07-26T12:25:40.000Z": "Great town hall last night in Gallatin at Bagsby Ranch. Amazing way to end a day packed full of town halls! Maria and I are so grateful for your support and encouragement. We're in West Tennessee this morning continuing our blitz across the state.", "2018-07-26T01:07:24.000Z": "Great town hall today in Smyrna. More here from @bundgaard2  @WKRN . Our campaign's momentum is due to voters believing in my positive message and vision for Tennessee as the only conservative outsider in the race. https:// wkrn.com/news/political -news/lee-s-town-halls-aim-to-keep-his-front-running-status-in-gop-gubernatorial-primary/1323911543 ", "2018-07-25T20:40:13.000Z": "Great lunchtime town hall in Murfreesboro. Maria and I are so grateful for your support.", "2018-07-25T19:35:17.000Z": "Our second stop today was in Smyrna, and again, it's humbling to see so many folks turn out to ask me questions about our state. The momentum continues to build!", "2018-07-25T17:21:08.000Z": "We started the day in Mt. Juliet this morning. It was great to see so many folks come out for an early morning meeting!  We're eight days from Election Day, let's keep up the momentum! Please encourage all your friends to vote early or on August 2nd.", "2018-07-25T14:42:03.000Z": "Special thanks to @mikefisher1212 for the kind introduction at last night's event. His commitment to his values, faith and service through sports has been inspiring to so many families and young people, and I'm proud to call him my friend. #GoPreds", "2018-07-25T14:30:00.000Z": "Election Day is in 8 days, but early voting is going on now, through Saturday.\nI'd be honored to have your support and your vote. http:// BillLee.com/Vote", "2018-07-24T20:44:13.000Z": "Awesome town hall this afternoon in Macon County at La Tia in Lafayette. Tremendous turnout. Great momentum. Thank you for the support!", "2018-07-24T20:30:05.000Z": "Early voting runs through Saturday, and Election Day is in just over a week! I'd be honored to have your vote. http:// BillLee.com/vote", "2018-07-24T12:06:20.000Z": "My latest ad is on the air. Why can't politicians stop illegal immigration? As a businessman, it seems pretty clear to me, it's about incentives. We need to oppose policies that will make Tennessee a magnet for illegal immigration.", "2018-07-24T01:37:13.000Z": "Great event tonight in Chattanooga with @RickySkaggs , Gordon Kennedy and @zachwamp . Maria and I appreciate the tremendous support!", "2018-07-23T18:18:45.000Z": "Election day is in 10 days, but don't forget you can early vote today!\nI'd be honored to have your vote. http:// Vote.BillLee.com", "2018-07-23T16:09:09.000Z": "So encouraged by this morning's town hall in Jonesborough at The Corner Cup. Overwhelmed by the turnout and support. With your help we're going to win!", "2018-07-23T00:51:19.000Z": "It's unfortunate my fellow candidates decided to be elsewhere tonight for third & final debate in East TN. I'm glad to be in Knoxville at the debate site for a town hall instead. Thanks to @GlennJacobsTN & @JasonZacharyTN for emceeing the event. Great to be with so many voters.", "2018-07-22T00:47:49.000Z": "Great evening at the @williamsontngop Old Fashioned Fish Fry & BBQ. Wonderful to be with so many Republicans in my home county.", "2018-07-21T19:11:46.000Z": "Great to be at the Shackle Island Volunteer Fire Department in Hendersonville for our town hall. The momentum for our campaign continues! Maria and I are grateful for your support.", "2018-07-21T17:33:02.000Z": "Great to drop by the @FBonTheHill  @TNFarmBureau Young Farmers & Ranchers Conference while we were in Columbia. Enjoyed visiting with our next generation of farmers and ranchers. Agriculture is critical to our state's economy. Hope you have a wonderful conference. #iFarmiVote", "2018-07-21T16:47:00.000Z": "Great town hall this morning in Columbia @PuckettsGrocery . Maria and I are so honored to have your support. Early voting happening now and 12 days until the primary.", "2018-07-21T15:42:52.000Z": "Early voting is happening now through next Saturday, July 28th. I'd be honored to have your vote for governor. Go vote today.", "2018-07-21T14:05:29.000Z": "Early voting is going on now. Find your early vote location and go vote! http:// BillLee.com/Vote", "2018-07-21T02:08:14.000Z": "Great town hall tonight in Carroll County at Mallard's Restaurant in Huntingdon. Appreciate everyone spending their Friday evening with us and to @AndyHolt4TN for emceeing the event.", "2018-07-20T23:48:31.000Z": "Humbled by the turnout at our town hall today in Jackson. Thank you to everyone for your support and for joining us! I'd be honored to serve you as governor.", "2018-07-20T22:51:38.000Z": "Great to sit down with Brad Douglass @WBBJ7News during our time in Jackson today. Appreciate you having me in studio. Always great to share my vision for Tennessee. Please tune in to catch the interview.", "2018-07-20T21:29:59.000Z": "Excited to join my friend @KeithSherley with @NewsTalk1015FM today at 4:35. Tune in here: http:// wnws.com/listen-live/", "2018-07-20T18:43:01.000Z": "Well, I've got three politicians running attack ads against me right now, so I figured I better tell you why. We're winning. And they're scared. Watch my latest ad!", "2018-07-20T18:40:52.000Z": "Always great to be in Shelby County. Thank you for the terrific turnout at our town hall in Germantown. You can read more about my Commitment to Memphis and Shelby County here: https:// billlee.com/commitment-mem phis-shelby-county/ ", "2018-07-20T17:57:08.000Z": "Great to swing by the Piperton polling location today to meet voters. I'd be honored to serve as your governor and I ask for your vote. Early voting now through July 28th and primary day is August 2nd.", "2018-07-20T14:51:54.000Z": "Awesome town hall this morning in Dresden! Appreciate @AndyHolt4TN joining us. Thank you to everyone for coming out and for your support.", "2018-07-20T02:02:25.000Z": "Awesome town hall in Rutherford County at The Messicks Farm in Lascassas. Thank you to everyone for coming - overwhelmed by your tremendous support. With your help, we will win! Election Day is two weeks from today.", "2018-07-19T21:22:34.000Z": "As I have said throughout this campaign, I care deeply for our rural areas in the state. It is an honor to see outlets like The Dunlap News recognize that passion and endorse my campaign for governor. http:// dunlapnews.com/opinion/", "2018-07-19T19:19:28.000Z": "Thank you Wilson County for an awesome town hall today in Lebanon! With your support, we will win.", "2018-07-19T17:19:50.000Z": "I penned an op-ed for the @wherald . With President Trump nominating Judge Kavanaugh, it is a reminder we need a strong conservative voice like @VoteMarsha in the Senate who will support and vote for conservative judges. Commentary: Marsha Blackburn would be a welcome fit in Senate Last week, President Trump announced his nomination for the Supreme Court, Brett Kavanaugh. Judge Kavanaugh is an excellent pick for the court, and he deserves swift confirmation in the Senate. williamsonherald.com", "2018-07-19T01:38:52.000Z": "Grateful for the opportunity to share my heart for Tennessee with so many people. Humbled by the turnout tonight. Thank you, Cookeville!", "2018-07-18T20:34:15.000Z": "Maria and I were blessed to be surrounded by family and friends today as we cast our votes during early voting in Franklin. It's a humbling  and overwhelming experience to be on the ballot as a candidate for governor. What a great country we live in!", "2018-07-18T14:07:25.000Z": "About to hop on with my friend Michael DelGiorno on @997wtn to talk about the race. Listen live at http:// 997wtn.com .", "2018-07-18T01:31:53.000Z": "Thank you to the Nashville Republican Women for inviting me to speak at your member appreciation event. Your involvement in the party and the community is invaluable. Maria and I were honored to join you this evening.", "2018-07-17T22:16:33.000Z": "Great to be with @bobmuellerwkrn  @WKRN for a taping of This Week with Bob Mueller. Thankful for the opportunity to share my vision for our state. Make sure you tune in this Saturday at 6pm central to ABC News Channel 2 to watch my interview.", "2018-07-17T18:36:53.000Z": "Awesome to be in Crossville today for a town hall. Appreciate the tremendous support. Please make sure to vote during early voting now through July 28th or on August 2nd.", "2018-07-17T01:31:34.000Z": "Great way to end the evening in Cleveland at @deliboysonline with @zachwamp . Such an incredible day on the campaign trail. Truly humbled by all the support and thankful to Zach Wamp for his endorsement.", "2018-07-16T22:50:49.000Z": "Awesome event at our Chattanooga Headquarters with @zachwamp . Grateful for Zach's endorsement. Thanks for the amazing support from such a terrific community. We've got the momentum. Please vote early or on August 2nd.", "2018-07-16T19:33:55.000Z": "Thanks to @krisfarley with @6News for sitting down with me today. Tune in this weekend in Knoxville to watch the interview.", "2018-07-16T17:06:02.000Z": "Great to be in studio at @wvlt with @WVLTKelsey. Thanks for having me on to share my vision for our state.", "2018-07-16T16:16:40.000Z": "Great turnout for our town hall this morning with @JasonZacharyTN and @zachwamp in Farragut. Honored to have Congressman Zach Wamp's endorsement.", "2018-07-16T16:12:04.000Z": "Honored to have @zachwamp join our team!", "2018-07-16T01:56:23.000Z": "Getting ready for a full week on the campaign trail. One of the highlights from last week was attending the Tennessee Junior Livestock Expo and speaking to the Tennessee Association of Agricultural Education conference.", "2018-07-14T19:08:26.000Z": "We filled the whole restaurant at the Hardee's in Ocoee in Polk County on this hot Saturday afternoon. The enthusiasm just continues to build as early voting is under way right now. #VoteLee", "2018-07-14T18:17:41.000Z": "Another great Super Saturday in full swing, with volunteers across Tennessee talking to voters about why Bill is the choice for Tennessee conservatives for governor!\nWant to join? Go to http:// BillLee.com/volunteer", "2018-07-14T16:36:24.000Z": "Our second stop of the day is in Madisonville in Monroe County, and again, it's humbling to see so many come out to listen and ask questions. It is a great Super Saturday in Tennessee!", "2018-07-14T13:23:35.000Z": "Our first event of the morning is at Katie's in LaFollette, and it's great to be here in a packed house. It's such a thrill to be with so many amazing Tennesseans who care deeply about our state.", "2018-07-14T00:17:56.000Z": "Honored to address the Campbell County Republican Party Lincoln-Reagan Day Dinner tonight. Great to be with so many Republicans and I'd be honored to serve you as your governor. I ask for your vote. Early voting started today and primary day is August 2nd.", "2018-07-13T23:07:46.000Z": "Great town hall today in Fentress County at the Courthouse in Jamestown. Appreciate everyone showing up and asking questions. We have the momentum and I'd appreciate your vote on August 2nd or during early voting - which started today and goes through July 28th.", "2018-07-13T22:59:03.000Z": "Enjoyed stopping by Express Lunch today in Crossville. Wonderful lunch and great to meet voters including a few who already early voted today.", "2018-07-13T17:58:25.000Z": "Our first event of the day today was in Dunlap at Cookie Jar Cafe. An amazing crowd to start the morning in beautiful Sequatchie Valley!", "2018-07-13T15:08:14.000Z": "After months of campaigning, traveling to every corner of the state and visiting with thousands of Tennesseans, early voting begins today! It's time to make YOUR voice count. I'd appreciate your vote.", "2018-07-13T11:04:34.000Z": "Big news for our campaign! It is an honor to have the endorsement of the @TimesFreePress . \"We urge a vote for [Lee] in the Republican primary on Aug. 2 or in early voting beginning today.\" Cooper: Lee the choice for Republicans Tennessee Republicans can feel fortunate they have an embarrassment of riches in their gubernatorial primary to replace term-limited Republican Bill Haslam. timesfreepress.com", "2018-07-12T20:26:48.000Z": "We are just one day away from early voting beginning! Tomorrow, polls open across state. Click below to find your nearest voting location for early voting, or check out your local election commission page. https:// tnmap.tn.gov/voterlookup/", "2018-07-12T14:25:44.000Z": "Joining my friend Michael DelGiorno on @997wtn at 9:30 to talk about the race and early voting, which begins tomorrow! Listen live at http://", "2018-07-11T19:22:15.000Z": "Humbled by the support at our town hall in Savannah today. Thank you to everyone for coming out and joining Maria and me. Early voting begins Friday, and I hope to have your vote.", "2018-07-11T16:14:30.000Z": "Great town hall this morning in Lawrence County at Square-Forty Restaurant on the square in Lawrenceburg. Thanks to everyone for coming and asking questions. I ask for your vote on August 2nd or during early voting - which starts this Friday.", "2018-07-11T01:31:47.000Z": "Great town hall tonight in Montgomery County at The Pottery Room in Clarksville. Thanks to my good friend @JayDReedy for emceeing. Enjoyed meeting everyone & answering your questions. I ask for your vote for governor. Early voting starts this Friday & election day is August 2nd.", "2018-07-10T21:16:20.000Z": "Looking forward to being in Knoxville on the 22nd! https:// wate.com/news/politics/ debates/democrats-republicans-in-knoxville-for-final-debates/1291677419 ", "2018-07-10T19:01:24.000Z": "Great town hall today in Robertson County in Springfield. Appreciate Doc Kumar for being our emcee today. Thanks to everyone for coming and asking questions. I'd appreciate your vote for governor on August 2nd. Early voting starts this Friday, July 13th.", "2018-07-10T15:29:39.000Z": "It was a lot of fun to have @bundgaard2 join us on the campaign trail yesterday. Click below to see the interview: https:// wkrn.com/news/bill-lee- talks-about-governor-run_20180709220014/1292320266 ", "2018-07-10T12:18:51.000Z": "My latest ad is on the air. What happens in Rural Tennessee impacts us all, and that's why I care so deeply about it. For more, visit http:// billlee.com/rural .", "2018-07-10T10:00:00.000Z": "Brett Kavanaugh is an excellent pick for SCOTUS. He is a strong defender of the Constitution and he deserves a swift confirmation in the Senate. This is also a reminder on the importance of keeping conservatives in the Senate like @VoteMarsha to ensure confirmation.", "2018-07-10T02:05:11.000Z": "Great event tonight at The Big Red Barn in Beersheba Springs. Appreciate the wonderful support for our campaign.", "2018-07-09T22:55:13.000Z": "Thanks @toddstarnes for having me on today! It was a lot of fun being on the show! https:// radio.foxnews.com/2018/07/09/can -a-cattle-farmer-become-the-next-governor-of-tennessee/ ", "2018-07-09T19:38:47.000Z": "More pictures from today's town hall at the Marshall County Community Theatre in Lewisburg. Thanks again to everyone for coming - we can feel the momentum and appreciate your support.", "2018-07-09T19:32:10.000Z": "Great town hall this afternoon at the Marshall County Community Theatre in Lewisburg. Thanks to everyone for coming and asking great questions. I ask for your vote for governor on August 2nd. Early voting starts July 13th.", "2018-07-08T23:31:10.000Z": "Some pictures from this past week's town halls. Find out where we're heading this week at: https:// billlee.com/events/", "2018-07-07T21:47:09.000Z": "More pictures from this afternoon's town hall in Coffee County in Manchester. Thank you to everyone who came - we are feeling the momentum. I ask for your vote for governor on August 2nd.", "2018-07-07T21:41:12.000Z": "Great town hall this afternoon in Coffee County in Manchester. Fantastic turnout and appreciated the opportunity to answer your questions. Thank you for the warm welcome and I ask for your vote for governor on August 2nd.", "2018-07-07T18:41:24.000Z": "Packed house for our town hall in Bedford County at @CoffeeBreak_TN in Shelbyville. Thanks to everyone for showing up and asking great questions. I'd be honored to have your vote for governor on August 2nd. Early voting starts July 13th.", "2018-07-07T15:58:25.000Z": "Great town hall this morning at the Giles County Agriculture Park in Pulaski. Appreciate everyone coming and asking great questions. Thankful for your support and ask for your vote for governor on August 2nd.", "2018-07-07T02:08:14.000Z": "Great afternoon in Memphis today. Enjoyed sitting down with @Local24Richard at @LocalMemphis for a campaign update. Our campaign continues to gain momentum. If you're in Memphis - please tune in to watch the interview.", "2018-07-07T01:58:44.000Z": "Great luncheon meeting earlier today in Memphis with members of the faith and business community. Thank you for the opportunity to share my vision for Tennessee. I ask for your vote for governor on August 2nd.", "2018-07-06T15:50:19.000Z": "Read more about my Ten for Tenn via @leader_news . These are my 10 top conservative priorities for Tennessee. Quote Tweet The Leader @covingtonleader Gubernatorial candidate Bill Lee visits Covington, outlines contract with Tennesseans http:// covingtonleader.com/news/election_ 2018/gubernatorial-candidate-bill-lee-visits-covington-outlines-contract-with-tennesseans/article_d4436e40-805b-11e8-b227-7f2f3e66124d.html#utm_campaign=blox&utm_source=twitter&utm_medium=social ", "2018-07-06T15:32:06.000Z": "Great town hall this morning in Hickman County at the Homestead Restaurant in Centerville. Awesome crowd and great questions. Thank you for coming and I'd appreciate your vote for governor on August 2nd. Early voting starts July 13th.", "2018-07-05T22:38:34.000Z": "Read more about Ten for Tenn - my 10 top conservative priorities for Tennesseans https:// billlee.com/tenfortenn/", "2018-07-05T01:04:15.000Z": "Great evening for the 4th of July at the Smith County Rally on the River. Thank you for the opportunity to speak and share my vision for Tennessee. Appreciate your vote for governor on August 2nd.", "2018-07-04T20:48:45.000Z": "More pictures from today's 31st Annual Town of Farragut Independence Day Parade.", "2018-07-04T19:58:32.000Z": "Thanks @JasonZacharyTN and Holly for inviting Maria and me to your 4th of July cookout! Great time this afternoon - Happy 4th of July!", "2018-07-04T19:41:32.000Z": "Great to be at the 31st Annual Town of Farragut Independence Day Parade. Maria and I had such a great day today - Happy 4th of July.", "2018-07-04T13:15:31.000Z": "Article via @JCPress @ZachVanceJCP on our great town hall yesterday in Unicoi County at Checkerboard Cafe in Erwin. Read more here: Building momentum: Lee confident 'about ability to win' gubernatorial primary johnsoncitypress.com", "2018-07-04T13:14:16.000Z": "Happy 4th!", "2018-07-04T00:41:03.000Z": "More pictures from tonight's town hall in Sevierville. Thanks again to everyone for coming.", "2018-07-04T00:37:24.000Z": "Great town hall tonight in Sevierville. Awesome turnout. Thanks to everyone for attending and asking questions. I'd be honored to serve as your governor and ask for your vote on August 2nd.", "2018-07-03T21:04:10.000Z": "Great town hall earlier today in Mountain City. Thanks to everyone for coming and asking great questions. I'd be honored to have your vote for governor on August 2nd.", "2018-07-03T18:51:20.000Z": "Great town halls today in Mountain City & Unicoi County with another town hall in Sevierville this evening. We are doing town halls all across Tennessee. Find all of our upcoming town halls here: https:// billlee.com/events/", "2018-07-03T18:33:54.000Z": "Great town hall today in Unicoi County at Checkerboard Cafe in Erwin. Thanks to everyone for asking great questions and for the opportunity to share my vision for Tennessee. I'd appreciate your vote for governor on August 2nd.", "2018-07-03T15:08:55.000Z": "Glad to have your support Joe. Conservatives are rallying around this campaign and we're going to win on August 2nd! Quote Tweet Joe Carr @JoeCarrTN I am supporting @BillLeeTN for governor. Here's why... https:// facebook.com/joe.carr.520", "2018-07-03T00:19:12.000Z": "More pictures from tonight's town hall in Kingsport. Thanks again for the tremendous support.", "2018-07-02T23:56:51.000Z": "Awesome turnout tonight for our town hall in Kingsport. Appreciate the tremendous support. Thank you for your questions and the opportunity to share my vision for Tennessee.  Maria and I are grateful and I ask for your vote for governor on August 2nd.", "2018-07-02T17:55:54.000Z": "Thank you @TNFarmBureau  @FBonTheHill . I'm a man of faith, an experienced businessman, a farmer and a product of rural Tennessee. I'd appreciate your vote for governor on August 2nd. #TNGov  #TN  #ag  #ifarmivote Quote Tweet Tennessee Farm Bureau Federation @TNFarmBureau Early voting begins soon - want to learn more about the six major  candidates? Each candidate filmed & sent us answers to questions  regarding agriculture and rural Tennessee - this video focuses on their  thoughts regarding #TN  #ag  #ifarmivote  https:// youtu.be/R1FQ32yNEb4", "2018-07-01T20:09:35.000Z": "Happy Birthday to Governor Winfield Dunn - a great Tennessean and a leader we can all look up to.", "2018-07-01T15:01:34.000Z": "Thank you Fayette County for a great evening yesterday! Momentum is building every day, as we saw last night, and I'm so honored to have your support.", "2018-06-30T21:49:19.000Z": "Another amazing Super Saturday wrapping up soon. Thanks to everyone who joined in today!", "2018-06-30T20:01:40.000Z": "Great to be in Memphis this afternoon, with so many supporters. Thanks for coming out!", "2018-06-30T17:40:36.000Z": "Super Saturday is in full swing, from Mountain City to Memphis. Thanks to all the volunteers who have come out already today!", "2018-06-30T16:09:04.000Z": "Great town hall this morning in Waynesboro. Appreciate the opportunity to share my vision for Tennessee and answer your questions. I ask for your vote on August 2nd.", "2018-06-29T20:09:35.000Z": "We are just 14 days from early voting beginning. Would you chip in $14 today to help spread our message across the state? https:// secure.anedot.com/billfortn/14da ys ", "2018-06-29T17:45:00.000Z": "Amazing town hall today in White County at the Ag Building Fairgrounds in Sparta. Thanks to everyone for attending. Appreciate the opportunity to share my vision for Tennessee and answer your questions.", "2018-06-29T16:43:40.000Z": "I'm proud to have signed the @taxreformer pledge. We will not be raising taxes in Tennessee on my watch. Quote Tweet ATR @taxreformer Great news for Tennessee taxpayers. All GOP candidates running to replace @BillHaslam as governor have pledged in writing to oppose and veto any and all efforts to raise taxes: http:// bit.ly/2IzJ8dC  #tngov  #tnpol", "2018-06-29T15:40:58.000Z": "Thanks for having me on your show @GuardianASP - great to meet you Garry and enjoyed our conversation about my vision for Tennessee. Quote Tweet Garry Thurman @GuardianASP Excited for tomorrow's show with @BillLeeTN ! Bill is running for Governor in TN! Check it out tomorrow morning at 9:30AM on Mix 104.1 or http:// mymix1041.com", "2018-06-29T12:54:14.000Z": "Great town hall this morning in Rhea County at the Dayton Chamber of Commerce. Appreciate everyone coming and asking such terrific questions. I would be honored to have your vote for governor on August 2nd.", "2018-06-29T01:09:21.000Z": "Great evening at the Roane County Reagan Day Dinner. Thank you for the opportunity to share my vision for Tennessee. I would be honored to have your vote for governor on August 2nd.", "2018-06-28T18:44:49.000Z": "Great pictures from our town hall this morning in Knoxville @soknomarket via @knoxnews . Thanks again to @GlennJacobsTN for being our emcee and for everyone who came out. You can view the pictures here: Bill Lee speaking at SoKno Market in Knoxville knoxnews.com", "2018-06-28T17:19:56.000Z": "Great to be at Roane County Community Picnic today. Thanks for inviting me to share my vision for Tennessee.", "2018-06-28T16:52:48.000Z": "Thanks to John North at @wbir for having me in the studio today for an interview. Great to share my vision for Tennessee with voters in Knoxville.", "2018-06-28T16:37:30.000Z": "Great town hall yesterday in McMinn County at the Shoney's in Athens. Appreciate everyone coming and asking great questions. I ask for your vote for governor on August 2nd.", "2018-06-28T15:32:28.000Z": "More pictures from today's town hall at the SoKno Market in Knoxville. Thanks again to everyone for attending and asking such great questions.", "2018-06-28T15:05:12.000Z": "Great town hall this morning in Knoxville at the SoKno Market - especially with the rain. Appreciate my good friend @GlennJacobsTN for being our emcee at today's event. Wonderful to meet everyone and I ask for your vote for governor on August 2nd.", "2018-06-28T00:27:00.000Z": "Great event tonight with supporters in Chattanooga.", "2018-06-27T19:58:21.000Z": "Join us for a town hall in the coming weeks and also come volunteer this Saturday for Super Saturday. Join us this Saturday beginning at 9 am at any of our offices throughout the state. Maria and I will be in Memphis at 2pm - hope to see you there!", "2018-06-27T17:30:24.000Z": "Great town hall this morning in Cleveland at Legacy Senior Living Center's offices. Appreciate Barry Ray hosting Maria and me. Excellent questions and wonderful to meet everyone. I ask for your vote for governor on August 2nd.", "2018-06-26T16:15:19.000Z": "Great article today in the Franklin Home Page about my campaign for governor: \"In this campaign, every candidate talks about how valuable vocational training is, and the trades, like that's a new subject But that's been my whole career.\" Quote Tweet Franklin Home Page @franklinhmpg Bill Lee says heading Lee Company has prepared him for executive leadership, governor's seat https:// franklinhomepage.com/bill-lee-says- heading-lee-company-has-prepared-him-for-executive-leadership-governors-seat/ ", "2018-06-26T14:40:46.000Z": "Great town hall this morning in Franklin County at Sample's in Estill Springs. Thanks to everyone for coming and asking questions. I ask for your vote for governor on August 2nd.", "2018-06-26T12:57:05.000Z": "Our latest ad is running today. Why do I think President Trump has been so effective? Because he came from the outside and is not a politician. We need the same kind of leadership in Tennessee.", "2018-06-26T02:40:10.000Z": "Great gubernatorial forum tonight in Chattanooga hosted by the @TimesFreePress and awesome tailgate with supporters. See y'all out on the campaign trail.", "2018-06-25T23:25:46.000Z": "My new ad is on the air. I talk about some of my most important beliefs including my faith, which is the most important thing in my life, and that will never change.", "2018-06-25T22:06:52.000Z": "Getting ready for the #tfpforum in Chattanooga tonight. Great to be here.", "2018-06-25T17:35:00.000Z": "The @CitizenTribune ​ covered our Town Hall in Hamblen County: \"The crowd gathered at the Davy Crockett Restaurant Friday, stretching beyond the room where Bill Lee, Republican gubernatorial candidate, stood.\" Click below to read the rest of the story! Lee bus tour stops in Hamblen County The crowd gathered at the Davy Crockett Restaurant Friday, stretching beyond the room where Bill Lee, Republican gubernatorial candidate, stood. citizentribune.com", "2018-06-25T15:27:47.000Z": "Here's a link to a great article in the @GreeneSun about my town hall meeting there last week. Lee Stumps In Greeneville At Friday Town Hall Focusing on agriculture, education and crime issues, gubernatorial candidate Bill Lee held a town hall meeting Friday morning to share his vision for Tennessee and answer questions at the Greene greenevillesun.com", "2018-06-25T14:52:39.000Z": "Great to sit down with @franklinhomepg reporter @Bwanser_writes for an interview this morning on the farm.", "2018-06-23T22:36:25.000Z": "Team Lee is out in full force across the state today!", "2018-06-22T23:14:17.000Z": "Great town hall this evening in Grainger County at Liberty Hill Market in Washburn. Appreciate everyone coming out on a Friday night. You can find our upcoming town halls at https:// billlee.com/events/", "2018-06-22T21:38:47.000Z": "Maria and I always enjoy visiting with @FBonTheHill  @TNFarmBureau  @FBITN - great to discuss my Roadmap for Rural Tennessee. #iFarmiVote Learn more here: http:// ruralroadmap.billlee.com", "2018-06-22T20:21:48.000Z": "Awesome time visiting with the Grainger County Farm Bureau @TNFarmBureau  @FBonTheHill  @FBITN  #iFarmiVote  #TNGov", "2018-06-22T20:13:29.000Z": "Great meeting earlier today with the Hawkins County Farm Bureau @TNFarmBureau  @FBonTheHill  @FBITN  #iFarmiVote  #TNGov", "2018-06-22T18:13:24.000Z": "Great town hall today in Morristown at the Davy Crockett Restaurant. Wonderful crowd with excellent questions. On our way to our next town hall this afternoon in Washburn.", "2018-06-22T13:32:27.000Z": "Great to sit down with Reid Seals this morning in Greeneville on radio station WGRV.", "2018-06-22T13:26:40.000Z": "Great town hall this morning in Greeneville at the Greene County GOP HQ. Appreciate everyone attending and all the excellent questions. I ask for your vote on August 2nd.", "2018-06-21T23:56:09.000Z": "Another great town hall today in South Pittsburg. Thanks to David Johnson at Dixie Freeze for hosting us at his business. And, to @janicebowlingtn for emceeing the Q&A. Great to see everyone and would appreciate your vote on August 2nd.", "2018-06-21T23:44:30.000Z": "Awesome town hall today in Van Buren County - where we started our campaign over a year ago. So great to be back at the Yvonne Sutton Fair Barn in Spencer. Thanks to everyone for coming, asking questions and making today's town hall such a special event.", "2018-06-21T16:58:45.000Z": "Maria and I had a honor of visiting Special Kids - a non-profit in Murfreesboro - serving children with both physical and mental needs. As governor I will create an Office of Faith-Based and Community Initiatives to partner with non-profits and faith-based organizations.", "2018-06-21T16:29:01.000Z": "Our view on the way to Van Buren County for our town hall meeting today. I love rural Tennessee!", "2018-06-21T14:39:06.000Z": "More pictures from this morning's town hall at @Slickpigbbq in Murfreesboro. Thanks to everyone for attending and asking great questions. Maria and I had such a great time. Heading to our next town hall in Van Buren county. #TNGov", "2018-06-21T14:34:35.000Z": "Great town hall this morning in Murfreesboro at @Slickpigbbq . Thanks to everyone for showing up, asking questions and supporting the campaign. We can feel the momentum. Honored to have your vote for governor on August 2nd. #TNGov", "2018-06-21T13:55:16.000Z": "Thanks, Jason. Appreciate you coming to the town hall this morning. Great to see you. Awesome crowd and questions. Quote Tweet Mayor Jason Cole @JasonBCole Listening to @BillLeeTN speaking in @Murfreesboro_TN at @Slickpigbbq  #RNRTN", "2018-06-21T03:36:03.000Z": "Vol fans and Tennesseans across the country are mourning the loss of John Ward tonight. For more than 30 years, it wasn't football time in Tennessee until he said so. Maria and I praying for his family for quick healing in the days ahead. Quote Tweet Vol Network @VolNetwork Tennessee has lost its Voice.", "2018-06-21T03:29:55.000Z": "Congratulations Pekka! A great honor. Quote Tweet Nashville Predators @PredsNHL Pekka Rinne wins the Vezina Trophy. Yes, we're crying too. #Preds | #NHLAwards Interactive timeline and story: https:// atnhl.com/2takKKX", "2018-06-21T00:57:28.000Z": "The next governor must believe TN can lead the nation. I believe we can, but only if we're willing to challenge the status quo, realizing there's a big difference between politics & leadership. A clear choice. Tennesseans want a conservative, an outsider & a leader #TNGOVDebate", "2018-06-21T00:55:25.000Z": "Our President is a businessman and a negotiator looking out for whats best for America. I'll support his efforts to improve trade, and I'll advocate on behalf of Tennessee to put us in a strong position globally. #TNGovDebate", "2018-06-21T00:48:02.000Z": "Lee debate watch parties around the state! #TNGovDebate", "2018-06-21T00:25:44.000Z": "Our Constitution is a serious, well-thought out document. We should not be having conversations about how to \"get around\" it. We should be talking about how to respect it. #TNGovDebate", "2018-06-21T00:22:41.000Z": "It's the wrong approach to take away the rights of law-abiding citizens because of the acts of criminals. As governor, I'll defend the Second Amendment. #TNGovDebate", "2018-06-21T00:11:11.000Z": "We can't be a nation without borders, and as governor, Tennessee will continue to support our nation in sending our National Guard to the border. #TNGovDebate", "2018-06-21T00:06:46.000Z": "No one wants to see a child separated from their parents, and I support the President's actions today. However, we got here because politicians in Congress have kicked the can down the road on immigration for far too long. #TNGovDebate", "2018-06-21T00:00:34.000Z": "Getting ready to start tonight's debate. #TNGOVDebate", "2018-06-20T20:18:45.000Z": "It is an honor to have the support of a Tennessee conservative leader like @MaeBeavers . Her leadership in the conservative movement and in the legislature is well known to all, and I am humbled and grateful to have her support. Quote Tweet Mae Beavers @MaeBeavers Honored to lend my support to @billleetn in the #TNGOV race. Like President Donald Trump, Bill Lee is ready to come in from the outside and take on the permanent political class in Nashville.", "2018-06-20T18:40:00.000Z": "PROFILE: @BillLeeTN is one of four candidates participating in tonight's #TNGovDebate . https:// wate.com/news/bill-lee- candidate-for-governor/1122900102?utm_medium=social&utm_source=twitter_6News ", "2018-06-20T00:21:23.000Z": "Great night tonight with so many supporters in Rutherford County at our campaign meet and greet in Murfreesboro!", "2018-06-19T00:31:38.000Z": "It's a beautiful summer evening in Sumner County tonight to meet with some old friends and make some new ones at our campaign meet and greet.", "2018-06-18T17:33:45.000Z": "Maria and I are saddened to hear of Claude's passing. He was a tremendous public servant for his community and for Tennessee. We are praying for his family today and in the weeks ahead. Quote Tweet Times Free Press @TimesFreePress Claude Ramsey, who rose from third-generation Hamilton County strawberry farmer to deputy governor of Tennessee, died Monday at the age of 75. http:// timesfreepress.com/news/breakingn ews/story/2018/jun/18/longtime-public-servant-claude-ramsey-dies/473298/ ", "2018-06-18T15:58:21.000Z": "It was a pleasant surprise to have this pop up in the @TimesFreePress . Thanks Jennifer! Glad to have your support. If you'd like to join her, visit http:// billlee.com/volunteer .", "2018-06-17T13:00:00.000Z": "Being a father is one of the greatest gifts God could have ever bestowed on me. I am truly blessed to have four wonderful kids and five amazing grandkids. Happy Father's Day to all.", "2018-06-17T00:47:10.000Z": "Thanks to the Hamblen County GOP Women for inviting me to be the keynote speaker at your annual summer picnic this evening. Great to be with you and share my vision for Tennessee. I appreciate the opportunity and ask for your vote on August 2nd.", "2018-06-16T22:58:28.000Z": "Enjoyed visiting with folks at the Farmers Livestock Market in Greeneville earlier today. Great time discussing my vision for Tennessee including my Roadmap for Rural Tennessee. Learn more here: https:// billlee.com/roadmap-rural- tennessee/ ", "2018-06-16T17:53:22.000Z": "Great time at the Farmers Livestock Market in Greeneville. Agriculture is critical to the future of our state. Learn more with my Roadmap for Rural Tennessee here: http:// ruralroadmap.billlee.com", "2018-06-16T14:54:53.000Z": "Great town hall this morning in Loudon County at the Carmichael Inn. Appreciate everyone coming on a Saturday morning and asking great questions. I ask for your vote on August 2nd.", "2018-06-16T02:16:48.000Z": "Glad to be in Robertson County and the Sixth Congressional District tonight for the Reagan Ranch Dinner. I'm also honored to have your support with the big straw poll win!", "2018-06-15T21:30:55.000Z": "Maria and I always enjoy being in Jefferson County. Thanks to so many old and new friends for joining us at our town hall today!", "2018-06-15T15:29:46.000Z": "On the way to Jefferson City town hall. Glad Maria is always riding shotgun. See y'all soon.", "2018-06-15T12:49:07.000Z": "Early meeting this morning in Anderson County for coffee and conversations. Great way to start the day! We have several town hall meetings today and can't wait to meet with everyone!", "2018-06-15T01:40:39.000Z": "Great town hall tonight in Humphreys County at Meriwether Lewis Electric in Waverly. Appreciate everyone who attended and hope to earn your vote on August 2nd. Thanks to @JayDReedy and Ronnie Smith for hosting Maria and me.", "2018-06-14T21:31:23.000Z": "Thanks, Ellie! Great to meet you today and thank you for your support. Quote Tweet Ellie Leonard @ellsbells_15 It was great meeting Maria and @BillLeeTN today! They're working hard already for the people of Tennessee letting their lights shine  #vote", "2018-06-14T20:17:55.000Z": "Tremendous turnout for our Town Hall Meeting in Lexington today. It was a terrific meeting and I was honored to meet with so many people who are interested in the future of our state. Thanks for coming out Henderson County!", "2018-06-14T19:30:00.000Z": "Happy Birthday to @realdonaldtrump . He continues to show what someone from outside of politics can do to shake things up. I'm looking forward to seeing what else he has in store for politics as usual in Washington.", "2018-06-14T17:23:19.000Z": "The line is out the door for our Henderson County Town Hall Meeting in Lexington. We even have  attendees from the very important under-five voting block!", "2018-06-14T15:04:27.000Z": "Early morning in Covington today, and we had a great time visiting with folks at our first Tennessee Town Hall Meeting this morning. We're also in Henderson County and Humphreys County today. Visit http:// billlee.com/events for details!", "2018-06-14T14:52:37.000Z": "Today, we honor our flag. It's a symbol that is recognized as the best example of freedom and hope the world has ever known. Happy #FlagDay .", "2018-06-14T14:09:21.000Z": "I think that Tennesseans want a conservative, and I think they want an outsider. I'm the only candidate that brings both. Quote Tweet Bill Lee @BillLeeTN There are four people running for the Republican primary in this race. The others are politicians. They all either worked for the government or been long involved in politics. http:// stategazette.com/story/2530996. html ", "2018-06-14T14:09:12.000Z": "There are four people running for the Republican primary in this race. The others are politicians. They all either worked for the government or been long involved in politics. Gubernatorial candidate Bill Lee holds town hall in Dyersburg BRANDON HUTCHESON bhutcheson@stategazette.com Republican gubernatorial candidate Bill Lee visited Dyer County Wednesday evening as part of his Tennessee Town Hall tour. Lee, wife Maria, and his... stategazette.com", "2018-06-14T12:11:50.000Z": "Great town hall last night in Dyersburg. Thanks to everyone for coming and asking great questions. Appreciate your vote on August 2nd.", "2018-06-13T22:04:43.000Z": "Great afternoon in Dyer County visiting with Wally Childress at Childress Farms in Bogota. Agriculture is 13% of Tennessee's economy and we have to be committed to the ag industry. Learn more with my Rural Roadmap for Tennessee. http:// ruralroadmap.billlee.com", "2018-06-13T17:54:52.000Z": "Thanks again to everyone in Lake County for coming out to the town hall today. Great to see you and such wonderful hospitality.", "2018-06-13T17:49:17.000Z": "Awesome town hall in Lake County this morning. Great to meet everyone and appreciated your questions. Honored to have your vote on August 2nd.", "2018-06-13T14:40:08.000Z": "On the way to our first Town Hall Meeting in Lake County today, we passed 70k miles on the RV! Find out where we'll be next at http:// billlee.com/events . We have eight town hall meetings in the next 96 hours alone!", "2018-06-12T21:31:39.000Z": "Happy Birthday to @GeorgeHWBush who is 94 today. He is the oldest living president in American history. Again, Happy Birthday!", "2018-06-12T19:56:28.000Z": "We've had an overwhelming number of folks asking for yard signs and ways to get involved on the campaign. Please visit http:// billlee.com/volunteer to get signed up today!", "2018-06-11T20:50:32.000Z": "Had a hankering for some @ChickfilA today. Cc: @jack", "2018-06-11T17:32:56.000Z": "Great morning today with Ben Smith and team at Engineered Medical Systems in Bartlett. Enjoyed meeting everybody and touring your 47,500 square foot state of the art facility. Another great Tennessee business - EMS manufactures medical devices.", "2018-06-11T13:59:40.000Z": "Folks have been asking me over the weekend if they could see my speech from the @TNGOP Statesmen's Dinner on Friday. Here it is: Bill Lee at TNGOP Statesmen's Dinner - 6/8/18 Bill Lee speaking at the TNGOP Statesmen's Dinner on June 18, 2018 in Nashville. youtube.com", "2018-06-10T18:41:38.000Z": "Did you miss out on #SuperSaturday yesterday? Join us for the next one, and stay up to date at http:// billlee.com/volunteer . We have even more exciting opportunities to get involved in the weeks ahead.", "2018-06-10T02:19:59.000Z": "More pictures from tonight's @warrentnGOP Lincoln/Reagan Day Dinner. Great to be with so many wonderful friends and supporters. Appreciate your vote on August 2nd. Tennesseans want a conservative and an outsider and I'm the only candidate that gets you both.", "2018-06-10T02:17:13.000Z": "Awesome Lincoln/Reagan Day Dinner tonight at @warrentnGOP . Thanks so much for having me. Great to be with so many wonderful friends including @janicebowlingtn", "2018-06-10T01:52:00.000Z": "Great evening at the Warren Co. Reagan Day Dinner with Bill Lee for governor. #BILLLEEFORTENNESSEE", "2018-06-10T00:06:05.000Z": "Congrats to you all. Keep up the great play! Quote Tweet Tennessee Tech @TNTech_Baseball FINAL | @TNTech_Baseball wins Game 1 of the @NCAACWS Austin Super Regional over @TexasBaseball 5-4! #WingsUp GIF", "2018-06-09T21:23:31.000Z": "Great to be at the @GrundyCountyGOP Reagan Day Picnic and gubernatorial straw poll in Altamont. Appreciate the opportunity to speak at your lunch and it is an honor to win your straw poll. I hope to earn everyone's vote for governor on August 2nd.", "2018-06-09T20:45:39.000Z": "Honored to have such amazing #SuperSaturday turnout in Memphis, even on this hot Saturday!", "2018-06-09T18:50:33.000Z": "#SuperSaturday pics coming in from across the state. Thanks for making it such a great day of action today!", "2018-06-09T16:02:36.000Z": "Out knocking doors in Chattanooga with volunteers for #SuperSaturday . Great day meeting voters. Stop by any of our campaign offices to volunteer. #TNGov  #TNGOP Learn more here: https:// facebook.com/events/1789159 82822969/ ", "2018-06-09T15:48:50.000Z": "#SuperSaturday kicking off in great fashion. We've got volunteers from the Tri-Cities to Memphis knocking doors and making calls. Join us all day today!", "2018-06-09T14:57:13.000Z": "Thankful for all our volunteers gathering around the state today for our first Super Saturday. Great to be at our Chattanooga HQ this morning on Cherry Street. Heading out now to door knock with volunteers. Honored to have your vote on August 2nd.", "2018-06-09T14:47:31.000Z": "Great volunteer Super Saturday kickoff at our HQ in Chattanooga. We're heading out to door knock with volunteers all across the state. Quote Tweet Sam Blevins @BlevinsSam Got to interview and meet Tennessee gubernatorial candidate @BillLeeTN today! Find out why he's in Chattanooga and what today was all about tonight on @newschannelnine at 6!", "2018-06-09T05:32:46.000Z": "Always a great time with fellow Republicans at tonight's @TNGOP 2018 Statesmen's Dinner. Tennessee needs a conservative and an outsider as governor and I'm the only candidate where you get both. #tngop", "2018-06-09T04:46:30.000Z": "Great to speak at tonight's @TNGOP 2018 Statesmen's Dinner with more than 1,800 attendees. For governor, Tennessee needs a conservative and an outsider and I'm the only candidate where you get both. #tngop", "2018-06-08T21:23:09.000Z": "Great town hall today in Dickson at the Clement Railroad Hotel Museum. Thanks to everyone who came today.  It was great to meet you and answer your questions. Excellent discussion on the future of Tennessee. I'd appreciate your vote for Governor on August 2nd.", "2018-06-08T13:38:29.000Z": "Great meet and greet last night at The Grinder House in Crossville. Thanks to everyone for joining us - it was great to meet you and answer your questions. I'd appreciate your vote on August 2nd.", "2018-06-07T22:17:22.000Z": "From @MemphisFlyer : \"Lee left little doubt that he is to be numbered among the conservatives on the Republican ballot, responding to a question about how to solve the gun-violence problem by touting the Second Amendment itself as the solution.\" Tennessee's Gubernatorial Candidates Make the Rounds in Memphis With the coming of bona fide summer weather, the governor's race has heated up accordingly. Last week in Shelby County saw numerous comings and goings... memphisflyer.com", "2018-06-07T21:50:45.000Z": "Awesome town hall this afternoon in Fairfield Glade at the Community and Conference Center. Appreciate all the great questions from folks. A special thank you to my good friend Barb Gregson for hosting us for the town hall.", "2018-06-07T16:02:39.000Z": "About to hop on with my friend Michael DelGiorno on @newstalk987 . Tune in if you're in Nashville, or you can listen here: WOKI-FM Cumulus newstalk987.com", "2018-06-06T17:44:29.000Z": "My new ad is hitting the airwaves! As the only conservative outsider in the race for governor, I hope you'll join me in this campaign by sharing this ad with your friends and family.", "2018-06-05T19:08:43.000Z": "Great town hall yesterday in Elizabethton. As governor I'll bring executive leadership to shake up the status quo. Read more via @JCPress Bill Lee brings campaign to Elizabethton on Monday johnsoncitypress.com", "2018-06-05T01:16:35.000Z": "Great to be with the Greater Kingsport GOP Women for lunch today. Read more below from @HankHhayes Quote Tweet Hank Hayes @HankHhayes What does Bill Lee think about illegal immigration, Trump\\u0027s wall and DACA? http:// timesnews.net/Politics/2018/ 06/04/What-does-Bill-Lee-think-about-illegal-immigration-Trump-s-wall-and-DACA.html  via @TimesNewsOnline", "2018-06-05T00:20:13.000Z": "This Saturday is Super Saturday. Every one of our campaign offices will be working overtime. Come join us across the state from 9am to 8pm! For more details, click here: https:// facebook.com/events/1789159 82822969??ti=ia ", "2018-06-04T19:50:46.000Z": "Great to meet with the Sullivan County Farm Bureau Board of Directors this afternoon. Excellent discussion on the issues including my Roadmap for Rural Tennessee. @TNFarmBureau  @FBonTheHill - learn more about my Roadmap for Rural Tennessee here http:// ruralroadmap.billlee.com", "2018-06-04T17:48:07.000Z": "Great lunch today with the Greater Kingsport GOP Women. Thanks for hosting me today. Enjoyed visiting with you and sharing my vision for Tennessee. Appreciate your vote on August 2nd.", "2018-06-04T16:10:02.000Z": "Glad to see the Supreme Court rule in favor of religious freedom today. This is a great day for those of us who want to practice our faith in the public square. To learn more about my thoughts on this, please visit http:// faith.billlee.com .", "2018-06-04T15:29:21.000Z": "Great to be with everyone in Elizabethton this morning. Great crowd! Quote Tweet Curtis Carden @Curtis_Carden . @BillLeeTN made a stop at the Coffee Company in Elizabethton this morning to speak with voters and discuss some of the topics being tossed around during the 2018 Tennessee gubernatorial race.", "2018-06-04T15:14:54.000Z": "Awesome town hall this morning in Elizabethton at The Coffee Company. Excellent questions from and wonderful conversations with everyone. See you at the next town hall.", "2018-06-03T01:45:56.000Z": "Thanks to the Cumberland County GOP for inviting me to speak at your Reagan Day Dinner tonight. Great to be with you and appreciate your vote on August 2nd.", "2018-06-02T22:56:30.000Z": "While in Cheatham County today - we stopped by the home of Braxton Lee - my 7th great grandfather who moved to Tennessee in 1796.", "2018-06-02T22:31:15.000Z": "Thanks to everyone in Ashland City who came out to our town hall today. So great to visit with you, answer your questions and be in your wonderful community.", "2018-06-02T22:28:24.000Z": "Great town hall today in Ashland City. Such a warm welcome from the community. Maria and I enjoyed visiting with you and answering your questions. Together - we'll make Tennessee an even better place to live.", "2018-06-02T16:53:45.000Z": "Great Tennessee Town Hall this morning in Ashland City in Cheatham County. Enjoyed sharing my vision for making Tennessee even better and how we can lead the nation. Appreciate everyone coming out today and asking questions. We're heading your way soon and we'll see you soon.", "2018-06-01T11:00:00.000Z": "Happy 222nd Birthday Tennessee!", "2018-05-31T15:35:31.000Z": "Thanks to @HLCCmemphis and Greta Brown for hosting our Town Hall today in Cordova. Great crowd with excellent questions.  Look forward to being back in Shelby County again soon. You can find our Tennessee Town Hall dates here: https:// billlee.com/events/", "2018-05-31T11:55:22.000Z": "Thanks for having me. Great to be in Somerville. Wonderful people and beautiful campus. Quote Tweet UT Martin Somerville @utmsomerville Thank you @BillLeeTN for visiting the center today. We appreciate the time you took to come to our community.", "2018-05-30T23:17:10.000Z": "@BillLeeTN joins @ForrestGoodman & me at 7:35 @600WREC & 92.1FM #Memphis .  He is in town on a campaign stop in his bid to be the next Governor of #Tennessee . We will ask him about current issues and his vision for the state's future.", "2018-05-30T21:32:34.000Z": "Great Town Hall today in Fayette County at @utmsomerville . Thanks to @FCRPTN Chairman Angela Courtney for emceeing the event.", "2018-05-30T15:33:04.000Z": "This is terrible news out of Dickson County today. Maria and I are praying for the family of this sheriff's deputy, and we're hopeful law enforcement will bring this perpetrator to justice quickly. Quote Tweet Tennessee Bureau of Investigation @TBInvestigation We're issuing a Tennessee Blue Alert for Steven Wiggins, the person-of-interest in the shooting death of a Dickson County sheriff's deputy. He is believed to be armed and dangerous.\n\nSpot him? Call 911! Show this thread", "2018-05-29T21:15:00.000Z": "Rain won't dampen the spirits of this crowd. Chants of U-S-A and cheering for those in law enforcement as they roll by. Great day.", "2018-05-29T19:26:22.000Z": "Looking forward to seeing @realDonaldTrump in Nashville soon.\nIt's so encouraging to meet with so many people who are passionate about this country and our state!", "2018-05-29T18:34:19.000Z": "And a second TN Repub candidate for governor campaigns among crowd waiting for tonight's @realDonaldTrump rally in Nashville @WKRN", "2018-05-28T19:40:39.000Z": "Earlier today, Maria and I were honored to place flags and attend a ceremony in Fairview. #MemorialDay", "2018-05-28T19:00:00.000Z": "U.S. Army Corporal Jason Hovater of Lake City was killed in the Battle of Wanat on July 13, 2008. He was one of nine killed and 27 wounded in one of the toughest battles in Afghanistan. He was posthumously promoted and awarded the Silver Star for valor. https:// etvma.org/veterans/jason -dane-hovater-12180/ ", "2018-05-28T18:00:00.000Z": "U.S. Army Corporal Thomas Mullins of Harriman went missing on Nov. 2, 1950 while serving in the vicinity of Unsan during the Korean War. He died while being held in a POW camp in North Korea. He was declared deceased by the Army on March 29, 1951. Funeral Announcement For Soldier Captured During The Korean War (Mull The Defense POW/MIA Accounting Agency (DPAA) announced today that the remains of a U.S. serviceman, recently accounted-for from the Korean War, are being returned to his family for burial with full dpaa.mil", "2018-05-28T17:00:02.000Z": "U.S Army Staff Sergeant William Turner of Nashville was presumably killed on December 13, 1943 while serving in World War II. Turner was part of the \"Hell's Fury\" bombing raid. 219 B-26 aircraft flew from England to Holland when they were struck by anti-aircraft artillery.", "2018-05-28T16:00:02.000Z": "U.S. Marine Corps Corporal Henry Andregg of Whitwell was presumably killed during the Battle of Tarawa in World War II on Nov. 20, 1943. Andregg was among the first wave of troops in the assault and was among 1,000 Marines and Sailors killed in the battle. He was 22.", "2018-05-28T15:00:01.000Z": "U.S. Army Staff Sergeant Michael Nelson of Antioch was killed in the line of duty during a training exercise off the coast of Oahu on August 15, 2017. Nelson was 30 years old and served 11 years in the Army.", "2018-05-28T14:00:02.000Z": "U.S. Air Force Technical Sergeant William O'Kieff of Murfreesboro was presumably killed while serving in support of the Vietnam War on Nov. 27, 1970. He was part of a C-123K flight carrying Americans and S. Vietnamese passengers when it crashed. Cause of the crash still unknown.", "2018-05-28T13:00:01.000Z": "U.S. Army Private First Class Reece Gass of Greeneville was presumably killed on January 14, 1945. Gass was\nserving in Belgium in World War II when he was killed in action when enemy fire destroyed his tank. He was 20 years old.", "2018-05-28T12:55:00.000Z": "This year for #MemorialDay , the state of Tennessee honored seven service members who gave the ultimate sacrifice. I'll be sharing their names and their stories throughout today. We thank God for their service, and for the freedom they fought to protect.", "2018-05-28T11:08:31.000Z": "\"Let us, in this solemn presence, renew our pledges to aid and assist those whom they have left among us as sacred charges upon the nation's gratitude-the soldier's and sailor's widow and orphan.\" - Maj. Gen. John Logan, 1868", "2018-05-27T20:36:12.000Z": "Getting ready for some more Tennessee Town Hall meetings across the state. Click https:// billlee.com/events/ to see when we're coming your way.", "2018-05-26T13:30:45.000Z": "Early mornings at the farm.", "2018-05-25T21:56:21.000Z": "As we head into #MemorialDayWeekend , I thought my interview with David Zanotti last week might be a good listen while you have some time with friends and family. We talked about founding principles and what they mean to me. Hope you can listen and share! Bill Lee Interview - WWTN Bill Lee talking with David Zanotti on May 15, 2018. youtube.com", "2018-05-24T18:12:23.000Z": "Thanks to @DanReaves2 and @Cheapseatsbass on @NewsTalk1015FM in Jackson for having me into the studio today. Great speaking with you and sharing my vision for Tennessee with your audience.", "2018-05-24T18:03:32.000Z": "Great town hall today in Jackson at Brooks Shaw's Old Country Store. Thank you to everyone who came and asked questions. Wonderful discussion around my vision for Tennessee.", "2018-05-24T15:10:36.000Z": "About to hop on with Dan Reeves on @NewsTalk1015FM in Jackson. To listen, click here: http:// wnws.com/listen-live/", "2018-05-24T15:04:50.000Z": "Thanks for coming to the town hall in Jackson today! Great crowd and excellent questions. Appreciate your vote on August 2nd. Quote Tweet Gabe Mudd @Gabemudd Bill Lee Tennessee Town Hall @BillLeeTN  #oldcountrystore  #JacksonTN", "2018-05-24T14:41:49.000Z": "For more on my Business Principles for Governing, you can visit http:// business.billlee.com .", "2018-05-24T14:30:31.000Z": "As a business leader who manages a budget, you know that good times don't last forever and you have to be careful to not build up today what you can't take down tomorrow. The next governor will have to make hard choices to take care of our needs before spending on our wants. Quote Tweet Sycamore Institute @SycamoreTN History suggests TN's next governor will have to craft and manage the state budget during a recession. http:// bit.ly/2GMP2ay", "2018-05-23T22:07:07.000Z": "Wonderful visit today at the Dickson County Help Center. This terrific non-profit assisted 2,332 households totaling over 5,535 individuals with food, clothing and financial assistance during 2017. Thanks to Renee, Pam and your staff for hosting Maria and me for a tour today.", "2018-05-23T21:54:50.000Z": "Great visit today at @TCATDickson . A remarkable facility doing remarkable work. As Governor I will expand TCAT partnerships with industry and schools.", "2018-05-23T19:39:27.000Z": "Good @CitizenTribune story about my visit in Morristown yesterday. They labeled me as \"Agricultural guru Republican Bill Lee,\" I like the sound of that! Gubernatorial candidate Bill Lee stops in Morristown On Nov. 6, the Tennessee gubernatorial election will be held to replace Governor Bill Haslam. On Tuesday morning in Morristown, one of those hopefuls stopped by West Main Street to citizentribune.com", "2018-05-23T14:07:07.000Z": "Great to hear about the @NFLDraft coming to Nashville next year. It's another chance to showcase Tennessee to the rest of the country.\n Looking forward to having @NFL in Tennessee next year!", "2018-05-23T02:16:45.000Z": "Bill Lee holds Town Hall in Rogersville Bill Lee holds Town Hall in Rogersville ROGERSVILLE - If you watch a lot of television, you might be thinking there are only two candidates in the Tennessee timesnews.net", "2018-05-23T12:21:51.000Z": "Great Town Hall yesterday in Rogersville at Of One Accord Ministry, The Shepherd Center. Appreciated everyone's questions. Read more here via @HankHhayes  @timesnewsonline  http:// timesnews.net/gallery/Bill-L ee-holds-Town-Hall-in-Rogersville ", "2018-05-23T00:53:59.000Z": "Everyone can read more about my Roadmap for Rural Tennessee here http:// ruralroadmap.billlee.com Quote Tweet Brandon Cobble @brandon_cobble Grundy Co Directors are viewing the @TNFarmBureau Gov. Candidate Forum at their monthly meeting tonight.", "2018-05-23T00:51:57.000Z": "I'm a product of rural Tennessee. I believe Tennessee can be an even better place to live, especially our rural communities. And I believe I know how to lead that change. Read more here https:// billlee.com/farm/ Quote Tweet Brandon Cobble @brandon_cobble Grundy Co Directors are viewing the @TNFarmBureau Gov. Candidate Forum at their monthly meeting tonight.", "2018-05-23T00:50:18.000Z": "Thanks @brandon_cobble  @TNFarmBureau  @FBITN  @FBonTheHill for showing the video to your membership. I know our agricultural community is crucial to the well-being of our state, Everyone can view my video to the Tennessee Farm Bureau here https:// youtube.com/watch?v=I58rfc uegbU  Quote Tweet Brandon Cobble @brandon_cobble Grundy Co Directors are viewing the @TNFarmBureau Gov. Candidate Forum at their monthly meeting tonight.", "2018-05-22T20:17:08.000Z": "Great Tennessee Town Hall today in Rogersville at the Shepherd's Center at Of One Accord Ministries. Terrific work being done by a non-profit to serve the community. Special thanks to Sheldon Livesay for hosting & for everyone in the community who turned out and asked questions.", "2018-05-22T19:06:17.000Z": "The latest in the @GreeneSun about my visit in Greene County yesterday. The momentum is building by the day. Come join us for our Tennessee Town Halls across the state. Bill Lee Stumps In Greeneville With around 75 days left to the Tennessee gubernatorial primary, candidates are ramping up their visits across the Volunteer State. greenevillesun.com", "2018-05-22T02:04:56.000Z": "Thanks to the Halls Republican Club in Knoxville for hosting Maria and me tonight. Great to visit with you and thanks for inviting me to share my vision for Tennessee. Wonderful evening and discussion.", "2018-05-21T18:49:37.000Z": "Thanks @AVYoungblood4 ! It was great to meet you today. Appreciate your support and best of luck during your race at the state track meet this weekend. Quote Tweet Ty Youngblood @AVYoungblood4 Bill Lee for Governor! A Conservative Christian that this state needs. @BillLeeTN", "2018-05-21T18:44:58.000Z": "Thanks to @TNFarmBureau  @FBonTheHill  @FBITN and @YoungbloodTrey3 in Greene County for hosting me for lunch today. It was great to visit with you, share my vision for Tennessee including my Roadmap for Rural Tennessee and answer your questions. See you again soon.", "2018-05-21T16:18:52.000Z": "Glad to see the anti-sanctuary city bill will become law. This is a good step for Tennessee. As governor, I will make sure our law is enforced and that no city in Tennessee will be a sanctuary for lawlessness.", "2018-05-20T17:51:54.000Z": "Took a day off the campaign trail to see my son Jacob graduate from UVA's Darden School of Business today. I'm so proud of him.", "2018-05-19T19:00:29.000Z": "We're putting nearly 2,000 miles on the #LeeRV next week. See where we'll be next on Facebook!", "2018-05-18T18:24:28.000Z": "Great to join Pat Nolan on @NC5  @NC5_PLUS today for Inside Politics where I shared my vision to help make life better for every Tennessean. Tune in tonight at 7pm and several times throughout the weekend. You can also stream the show after it airs on https:// newschannel5.com", "2018-05-18T01:02:50.000Z": "So proud of Adam. He graduated from @LEADAcademyHS today. Congratulations to him and to the Class of 2018. Your future is bright!", "2018-05-17T17:09:40.000Z": "Thanks again to everyone for coming out to last night's Tennessee Town Hall in Morrison. Great to be with everyone and appreciated your questions and the opportunity to meet such great people.", "2018-05-17T17:03:53.000Z": "Great Tennessee Town Hall last night at Prater's BBQ in Morrison. Thanks to all the folks who attended and asked questions. Just announced two more town halls next week on our Facebook page. We'll be coming your way soon and we'll see you soon.", "2018-05-17T00:53:07.000Z": "Thanks, Derek. Appreciate your support! Quote Tweet Derek Robinson @D_Rob The clear vote in TN.  Cut through the news cycle, listen to this man's story, and his platform. https:// twitter.com/billleetn/stat us/996915273537122305 ", "2018-05-17T00:48:17.000Z": "Great Tennessee Town Hall tonight in Warren County at Prater's BBQ in Morrison. More than 60 people showed up to ask questions. Check out our Facebook page throughout the campaign where we will publish event details. 50 plus town halls between now and Election Day on August 2nd.", "2018-05-16T17:16:17.000Z": "Excited that our new ad \"Serve\" is hitting the airwaves statewide  this week. I can't wait to serve the people of Tennessee like I serve my family, my neighbors and twelve hundred employees every day.", "2018-05-16T01:46:36.000Z": "On Parkland: It's common sense: law abiding citizens should not be punished for the actions of criminals. These kids have been through a horrible tragedy. But I've been sickened by how the liberal media and the far left have used these kids as props to push their anti-gun agenda.", "2018-05-16T01:06:35.000Z": "Building a Team: I would select leaders in government I like I do for senior managers in my business. We need to find the most competent people in their fields and recruit them to serve. Character matters. #TNGov  #LTGovForum", "2018-05-16T00:48:10.000Z": "Medicaid Expansion: It would be irresponsible to expand an Obamacare program in Tennessee. That will not happen on my watch. #TNGov  #LTGovForum", "2018-05-16T00:28:52.000Z": "Health Care: Our health care system is broken, but that is because there are no incentives to lower costs for patients, providers and payers. #TNGov  #LTGovForum", "2018-05-16T00:26:34.000Z": "I grew up in Rural Tennessee. We have 45 counties that are at risk or economically distressed. That's why I unveiled my Roadmap for Rural Tennessee last year. - https:// billlee.com/roadmap-rural- tennessee/ ", "2018-05-16T00:21:34.000Z": "School Choice: Parents should have choices in education. With choice, the education system improves. #TNGov  #LTGovForum", "2018-05-16T00:09:30.000Z": "As Maria and I have traveled the state, we know that people want a good job, a good school for their kid and a safe neighborhood. Those would be my top priorities as governor. #LTGovForum  #TNGOV", "2018-05-15T23:26:21.000Z": "Tonight is the @LeadershipTN forum at @lipscomb . We came into our green room and this was on the wall, \"Do nothing out of selfish ambition or vain conceit.\"  I'm running for governor because I want to serve the people of Tennessee. Tune into the forum tonight at 7pm CDT on @WKRN", "2018-05-15T18:54:06.000Z": "Thanks to David Zanotti for having me on the show today. What a great conversation we had on @997wtn . Thanks for listening earlier, and make sure to tune in to the Leadership Tennessee forum tonight on @WKRN .", "2018-05-15T15:01:09.000Z": "Hopping on @997wtn in Nashville today at 10:05 CT to talk about tonight's Leadership Forum. To listen, click here: http:// 997wtn.com .", "2018-05-14T19:30:00.000Z": "While at the Pachyderm Lunch in Chattanooga today, I got to speak to @newschannelnine . Tune in tonight and watch the interview!", "2018-05-14T18:04:48.000Z": "It was an honor to speak to the Hamilton County Pachyderm Club today. Thank you having me. It is so encouraging to see a full house today for lunch. The momentum is building for sure!", "2018-05-13T20:20:08.000Z": "My mom taught me unconditional love. She is an inspiration. Happy Mother's Day to all of the moms out there!", "2018-05-13T02:53:01.000Z": "Thanks! Great to see you too @4n4schools Quote Tweet Allena Bell @4n4schools #Love the Rotary Rodeo Parade @CityOfFranklin . Good to see you @BillLeeTN  @wherald  @franklinspecial  @fssdFMS  #family  #community  @Rotary", "2018-05-12T21:41:04.000Z": "Thanks for being part of our Rodeo parade! @wherald  @FranklinNoon  @franklinrodeo Quote Tweet Bill Lee @BillLeeTN We had so much fun at the Franklin Rodeo today in Williamson County. What a gorgeous day in Middle Tennessee.", "2018-05-12T21:22:19.000Z": "We had so much fun at the Franklin Rodeo today in Williamson County. What a gorgeous day in Middle Tennessee.", "2018-05-12T12:50:20.000Z": "Thanks again to Johnny Woolfolk and Woolfolk Farms for hosting us for \"Politics & Pork.\" Great time visiting with folks in Jackson.", "2018-05-12T00:51:53.000Z": "Thanks for coming tonight. Great to visit with everyone. Wonderful event and evening. Quote Tweet Joe McKinnon @joemckinnon1 @BillLeeTN shares his reasons 4 seeking the TN governor's office @ Woolfolk Farms. @FBonTheHill", "2018-05-11T23:47:56.000Z": "Great to be at Woolfolk Farms for \"Politics & Pork.\" We've been in West TN all week discussing agriculture, vocational & technical training as part of our Roadmap for Rural Tennessee. Great discussions on how to make TN a better place for 6.5 million people & lead the nation.", "2018-05-11T20:12:07.000Z": "Great to be with so many friends at the West Tennessee Strawberry Festival in Humboldt today!", "2018-05-11T18:25:50.000Z": "Thanks for helping out at the Strawberry Festival Parade. A great time and appreciate your support! Quote Tweet Brad Box @bradfordbox21 Box boys had the honor of helping Bill Lee in the Strawberry Festival parade today. #billleeforgovernor", "2018-05-11T14:07:57.000Z": "Great meet and greet in Union City this morning. Excellent discussion with folks. Now we're heading to the Strawberry Festival in Humboldt. Look for us with the RV.", "2018-05-11T00:24:49.000Z": "Great to be at @utmartin  @WestStar20 rural form today. Now ready to cheer on the @PredsNHL . Let's go Preds! Win game 7 #StandWithUs  #Preds  #WPGvsNSH Quote Tweet Nashville Predators @PredsNHL GAME 7. You know what to do. #Preds starters below and complete coverage on @NHLonNBCSports and @1025TheGame . #WPGvsNSH", "2018-05-10T23:34:01.000Z": "Glad to be at @utmartin for tonight's @WestStar20 rural forum. It is an important discussion, and thank you @MegKinnardAP for leading that discussion. For more information about my Rural Roadmap, please visit http:// ruralroadmap.billlee.com .", "2018-05-10T21:30:01.000Z": "Tonight is the WestStar gubernatorial forum. I'll be talking about my vision for our state a little after 6pm, and I hope you'll tune in! http:// utm.edu/2018forum", "2018-05-10T20:31:47.000Z": "Great afternoon with the Weakley County Farm Bureau today, talking about my vision for rural Tennessee. http:// RuralRoadmap.BillLee.com", "2018-05-10T19:34:31.000Z": "Thanks @BillLeeTN for stopping by Weakley County Farm Bureau to visit w farmers this afternoon. @TNFarmBureau  @FBonTheHill", "2018-05-10T14:59:40.000Z": "Great to tour @hatcherfamdairy last week and highlight my Roadmap for Rural Tennessee. As Governor - I'll focus on vocational, technical and agricultural education. Hatcher Yoest was right on the chocolate milk - delicious! Read more via @wherald Lee visits Hatcher Dairy during push to promote rural business, education in Tennessee Gubernatorial candidate Bill Lee, namesake of the Lee Company of Franklin, took a tour of the Hatcher Family Dairy in College Grove last week, paying homage to his own agrarian williamsonherald.com", "2018-05-09T16:57:20.000Z": "So proud of Adam. He's going to @volstatecampus . Congratulations to an amazing young man, and I can't wait to see what is in store for him.", "2018-05-08T20:04:07.000Z": "Great to join @TaneishaWRCB at @WRCB 's studio in Chattanooga to discuss my vision for Tennessee. Thanks for having me on. I enjoyed the conversation.", "2018-05-08T19:45:49.000Z": "Great to be in studio with @WRCB in Chattanooga today. Thanks for having me on to discuss my vision for Hamilton County and all of Tennessee.", "2018-05-08T02:26:33.000Z": "Honored to join Williamson County Sheriff Jeff Long and many others for the Police Memorial Service in Franklin to honor law enforcement officers who have lost their lives in service. We thank and honor law enforcement all across Tennessee and our entire country for their service", "2018-05-07T14:22:03.000Z": "We are just a generation away from losing a way of life in small town Tennessee. If we don't act decisively, we will lose it, and that's something we can't allow to happen. Learn more here: http:// ruralroadmap.billlee.com", "2018-05-07T02:06:53.000Z": "Great week this past week highlighting our Roadmap for Rural Tennessee. Looking forward to more stops this week. Learn more about our Roadmap for Rural Tennessee here: https:// billlee.com/roadmap-rural- tennessee/ ", "2018-05-05T06:46:55.000Z": "Bill Lee on Anti-Sanctuary City Legislation: 'As Governor I Would Sign This Bill' Bill Lee on Anti-Sanctuary City Legislation: 'As Governor I Would Sign This Bill' - Tennessee Star Bill Lee on Anti-Sanctuary City Legislation: 'As Governor I Would Sign This Bill' tennesseestar.com", "2018-05-06T19:00:03.000Z": "ICYMI: Thanks to Roy Exum for the opportunity to visit with you while in Chattanooga. Via @Chattanoogancom - Bill Lee And 'The Fire' Roy Exum: Bill Lee And 'The Fire' chattanoogan.com", "2018-05-06T18:00:02.000Z": "'Unlikely' candidate comes to town http:// tullahomanews.com/unlikely-candi date-comes-to-town/ ", "2018-05-06T18:50:09.000Z": "Via @TullahomaNews on my Meet and Greet with @LaneCurlee1 and @CityofTullahoma citizens. Thanks again for hosting me. It was a great time with wonderful folks. 'Unlikely' candidate comes to town Bill Lee discusses gubernatorial run tullahomanews.com", "2018-05-06T18:32:08.000Z": "Thanks to @LaneCurlee1 & @CityofTullahoma for hosting me for a meet and greet with your amazing community. Great to be with you, learn more about Tullahoma and share my vision for Tennessee.", "2018-05-06T01:43:52.000Z": "Let's get a win tonight #Preds ! Quote Tweet Nashville Predators @PredsNHL We back #Smashville ! #Preds starters below with complete coverage on @NHLonNBCSports and @1025TheGame . #WPGvsNSH", "2018-05-05T23:23:45.000Z": "Great time touring @hatcherfamdairy in College Grove and highlighting my Roadmap for Rural Tennessee. We must focus on vocational, technical and agricultural education to increase the number of high school graduates ready for the workforce. https:// billlee.com/roadmap-rural- tennessee/ ", "2018-05-05T18:58:54.000Z": "Great to join the @tnmed yesterday to discuss how we can work together to ensure our healthcare system is patient-centered and provider-driven. Thanks for having me.", "2018-05-04T21:12:08.000Z": "Great to be with @hatcherfamdairy today to highlight my Roadmap for Rural Tennessee. Faith, families & farming are important to us all. Agriculture is 13% of Tennessee's economy & a critical foundation for our state. We have to support the 67,000 farmers in Tennessee. #FarmStrong", "2018-05-04T16:01:36.000Z": "Great evening last night at the Wilson County GOP Reagan Day Dinner. Appreciate your tremendous support.", "2018-05-04T01:18:55.000Z": ". @realdonaldtrump signed an Executive Order today entitled \"Establishment of a White House Faith and Opportunity Initiative.\"  I agree, and that is why I was the first candidate in this race to call for a similar office in March: Gubernatorial hopeful calls faith community underutilized resource Bill Lee, a Tennessee gubernatorial candidate, announced his intention to seek the office last April and kicked off by visiting 95 counties in 95 days. He followed up with a tractor tour, the \"Rural... clevelandbanner.com", "2018-05-03T22:55:58.000Z": "Great to be @BrdgstoneArena and co-host with @94fmTheFish the Pastors and Public Servant Prayer Breakfast. My faith in Jesus is the most important thing in my life and that will always be true. Thanks to @JasonZacharyTN for joining me at the breakfast.", "2018-05-03T22:41:56.000Z": "Thanks to @BradleySchools for hosting me at the PIE Center. Amazing work being done to support vocational, technical and agricultural training - all of which are essential for Tennessee's success. Bill Lee visit includes trip to PIE Center Bill Lee, a Republican candidate for governor of Tennessee, stopped in Cleveland Wednesday to visit the site of Bradley County Schools' Partnerships in Industry & Education Center, also known  clevelandbanner.com", "2018-05-03T17:17:59.000Z": ". @BillLeeTN shares about the heartbreaking loss of his first wife and the despair that followed. Says the Lord sustained him and made His presence known during that time, tells me his relationship with God is the \"most important.\" #NationalDayOfPrayer", "2018-05-03T14:19:24.000Z": "Awesome morning @BrdgstoneArena with my good friend @BillLeeTN for the Pastors and Public Servant Prayer Breakfast.  Thankful to live and serve in a state that believes in the power of prayer.", "2018-05-03T10:11:03.000Z": "TODAY is the #NationalDayofPrayer . There are several events happening across our area, including the Pastors and Public Servants Prayer Breakfast at @BrdgstoneArena . It's hosted by @94fmTheFish and @BillLeeTN . Doors open at 6:30 am @WKRN  #GMN", "2018-05-03T03:38:10.000Z": "Thanks @CCS_CHScheer for the warm welcome to @clevelandhightn - that was just awesome! Maria and I so enjoyed meeting y'all. Quote Tweet CHS Cheer @CCS_CHScheer CHS welcomes Bill Lee", "2018-05-02T13:16:34.000Z": "GOP candidate for Tennessee Governor Bill Lee visits Chattanooga: GOP candidate for Tennessee Governor Bill Lee visits Chattanooga The primary election in the race for Tennessee Governor is now three months away. We have seen several candidates make stops in Chattanooga the last several weeks. Today Republican Candidate for... newschannel9.com", "2018-05-02T23:07:37.000Z": "Thanks @AutumnOBryanCHS for hosting Maria and me. Amazing work being done with your terrific CTE programs. Quote Tweet Autumn O'Bryan @AutumnOBryanCHS Today we were honored to host Bill Lee, candidate for TN Governor, to visit many of our CTE classes. Our kids did a awesome job showcasing our programs.", "2018-05-02T17:57:28.000Z": "Thank you @BillLeeTN for visiting @clevelandhightn to see our @CCSCTE programs in action.  Our students and teachers are doing amazing work!", "2018-05-02T18:38:00.000Z": "Thanks for the warm welcome this afternoon @clevelandhightn  @drrusselldyer  @CCSCTE and Principal O'Bryan. Such an amazing school and CTE program. Proud of your students, teachers and administrators.", "2018-05-02T18:27:53.000Z": "Special thanks to @drrusselldyer and Principal O'Bryan for inviting Maria and me to tour @clevelandhightn and their wonderful @CCSCTE programs. It's remarkable what they're doing. Vocational, technical and agricultural education are vital for the success of our students.", "2018-05-02T15:51:39.000Z": "To see yesterday's interview, click below: GOP candidate for Tennessee Governor Bill Lee visits Chattanooga The primary election in the race for Tennessee Governor is now three months away. We have seen several candidates make stops in Chattanooga the last several weeks. Today Republican Candidate for... newschannel9.com", "2018-05-02T15:47:38.000Z": "Thanks to Roy Exum at @Chattanoogancom for a great article. To read it, click below: Roy Exum: Bill Lee And 'The Fire' chattanoogan.com", "2018-05-02T15:35:19.000Z": "Great to be with the @PIE_Center_BCS  @BradleySchools . A model of the future for Tennessee. I have a real heart for industry partnering with the education system to transform and create workforce development all across our state because that's what I've been doing all my life.", "2018-05-02T12:53:21.000Z": "Thanks @SheilaButt4TN - great to be with you yesterday Quote Tweet Sheila Butt @SheilaButt4TN A great afternoon hosted by Harrison Dairy Farm with Bill and Maria Lee in Louden, TN! #billleefortennessee", "2018-05-02T04:45:18.000Z": "Great to visit with @joshroe at @newschannelnine on Tuesday while I was in Chattanooga for the 40th Annual Chattanooga Leadership Prayer Breakfast. Enjoyed sharing my vision for all Tennesseans. Learn more about my beliefs and campaign here: https:// billlee.com/beliefs/", "2018-05-02T04:38:10.000Z": "Thanks to Steve Harrison of Harrison Dairy Farm for hosting our campaign on Tuesday. Wonderful group of supporters that understand the importance of my Rural Roadmap for Tennessee http:// ruralroadmap.billlee.com", "2018-05-02T04:31:12.000Z": "Great to visit with volunteers at our Chattanooga office - located downtown on Cherry Street. Please stop by to pick up a yard sign, bumper sticker and to volunteer on the campaign. I appreciate all your support!", "2018-05-02T04:27:55.000Z": "Great to be at the 40th Annual Chattanooga Leadership Prayer Breakfast on Tuesday morning #ChattanoogaPrayerBreakfast . My Faith in Jesus is the most important thing in my life and that will always be true.", "2018-05-02T03:57:21.000Z": "Thanks @brandon_cobble and the Bradley County @TNFarmBureau  @FBonTheHill for having me at your Director's Meeting. Enjoyed visiting with you, hearing your personal stories and sharing my Rural Roadmap for Tennessee http:// ruralroadmap.billlee.com Quote Tweet Brandon Cobble @brandon_cobble Thanks @BillLeeTN for visiting with Bradley County Farm Bureau Directors about your vision for TN and especially Agriculture.", "2018-05-02T00:45:05.000Z": "On Tuesday, NewsChannel 9's @joshroe spoke with @BillLeeTN , GOP candidate in the Tennessee gubernatorial race. The August primaries are only 3 months away! Quote Tweet Josh Roe NC9 @joshroe The August primaries in Tennessee are three months away. Today GOP candidate for governor Bill Lee visited Chattanooga. http:// newschannel9.com/news/election/ gop-candidate-for-tennessee-governor-bill-lee-visits-chattanooga ", "2018-05-02T03:00:04.000Z": "Thanks for the interview @joshroe - look forward to visiting again soon on my next trip to Chattanooga. Quote Tweet Josh Roe NC9 @joshroe The August primaries in Tennessee are three months away. Today GOP candidate for governor Bill Lee visited Chattanooga. http:// newschannel9.com/news/election/ gop-candidate-for-tennessee-governor-bill-lee-visits-chattanooga ", "2018-05-01T21:03:01.000Z": "Great to be with Steve Harrison at Harrison Dairy Farm - appreciate your support, Steve. Amazing work being done. What happens in rural Tennessee matters to all Tennesseans. Great to share my Roadmap for Rural Tennessee with supporters in Loudon.", "2018-05-01T18:43:34.000Z": "Thanks for having me @joshroe  @newschannelnine . Great to visit with you this morning and appreciate the opportunity to share my vision for Tennessee. https:// billlee.com/beliefs/ Quote Tweet Josh Roe NC9 @joshroe Had a conversation with candidate for governor of Tennessee, Bill Lee @BillLeeTN this morning.\n\nHear what he had to say to voters on @newschannelnine at 5:30 & 6", "2018-05-01T18:41:51.000Z": "Thanks for having me - great to be with the Franklin County Farm Bureau @FBonTheHill . Enjoyed visiting with y'all and sharing my vision including my Rural Roadmap for Tennessee http:// ruralroadmap.billlee.com Quote Tweet Adam Brown @adam_g_brown Tennessee Gubernatorial Candidate Bill Lee speaks to Franklin County Farm Bureau Members at their 2018 Annual Meeting", "2018-05-01T13:40:28.000Z": "Today 57 counties in Tennessee are having primary elections for county and judicial positions. If you're in one of these counties have your voice heard! This is the beginning of a busy election season. Get involved, go vote! #iFarmiVote  #GoVoteTN", "2018-05-01T13:29:43.000Z": "Today is Election Day across the state for local elections.  Make sure to get out and vote today!", "2018-05-01T01:59:20.000Z": "Thanks to Thompson Appalachian Hardwoods for hosting us to discuss agriculture and small business issues today in Huntland. Amazing business that is a true Tennessee success story. Our Roadmap for Rural Tennessee will help increase opportunities https:// billlee.com/roadmap-rural- tennessee/ ", "2018-05-01T01:43:50.000Z": "Great to address the Franklin County Farm Bureau's annual meeting tonight. Thanks for having me. A great discussion on many issues including vocational, technical and agricultural education. All part of my Roadmap for Rural Tennessee. Thanks @TNFarmBureau  https:// billlee.com/roadmap-rural- tennessee/ ", "2018-04-30T23:32:04.000Z": "Excellent visit with @WoodallGrain today touring their terrific business, meeting with their employees and discussing our Roadmap for Rural Tennessee. Learn more here: https:// billlee.com/roadmap-rural- tennessee/ "}