{"2020-07-30T15:18:31.000Z": "RIP Herman Cain. \n\nHerman Cain Dies After Being Hospitalized for Covid-19. Herman Cain Dies After Being Hospitalized for Covid-19 Herman Cain, a former Godfather's Pizza chief executive who ran for president as a Republican in 2012 pushing a simplified tax plan he called \"9-9-9,\" has died. He was 74 years old. apple.news", "2020-07-30T02:39:20.000Z": "Justice David Bridges was an outstanding jurist and a dear friend of mine and so many Texans.\n\nWe join his family in mourning his tragic death, while also celebrating his remarkable life.\n\nFlags to be lowered to half-staff as tribute. Flags to be lowered to half-staff as tribute to Justice David L. Bridges July 29, 2020 - To honor the untimely death of our outstanding jurist, Justice David L. Bridges, Texas Governor Greg Abbott has directed county judges in the Fifth Court's jurisdiction  blueribbonnews.com", "2020-07-30T00:48:55.000Z": "Texas is providing hospital beds, medical staff, supplies and equipment to convert the McAllen Convention Center into a healthcare facility to help Rio Grande Valley leaders combat COVID.\n\nWe thank McAllen for providing the location & #RGV local leaders for their collaboration. Quote Tweet Molly Hennessy-Fiske @mollyhf per @GregAbbott_TX \"McAllen Convention Center will be converted into a health care facility to help meet the #RGV hospital capacity needs during #COVID19 pandemic. The health care facility will have the capacity to treat a maximum of 250 patients and will open later this week.\"", "2020-07-29T23:09:31.000Z": "Texas named as 'Best Business Climate in America' for 2020. \n\nTexas remains America's economic leader. #txlege Texas named as 'Best Business Climate in America' by Business Facilities Magazine Texas has been named as the state with the best business climate in America, according to Business Facilities Magazine. kxxv.com", "2020-07-28T19:49:08.000Z": "Horrific flooding in Hidalgo County caused by #HurricaneHanna . \n\nI'm in the #RGV today with the Texas Division of Emergency Management to see how Texas can help. \n\n... @TDEM ", "2020-07-28T19:32:16.000Z": "Surveying flood damage in the #RGV caused by #HurricaneHanna .", "2020-07-28T03:39:52.000Z": "Dip in COVID cases suggests mask order paying off.\n\nBut a decrease in daily COVID cases shouldn't be cause to relax mask wearing & other precautions says Lamar University public health expert.\n\nInstead it just shows that these precautions are working. Dip in caseload suggests mask order paying off On Friday, the seven-day average number of coronavirus cases confirmed across Jefferson County each day was just under 91 - almost a full 10 cases fewer than the Friday prior. beaumontenterprise.com", "2020-07-28T01:02:15.000Z": "Happy Heavenly Birthday to my dear mother, Doris. \n\nHer laughter was contagious and her style was impeccable. No one has ever made a better peach pie. \n\nHer grace through adversity taught me to overcome the accident that left me in a wheelchair. \n\nShe is forever missed.", "2020-07-27T22:51:42.000Z": "Texas has some of the leading universities in the world helping us combat COVID. \n\nThe federal government has approved $265 million to manufacture coronavirus vaccine at Texas A&M facility. \n\n... @TAMU  #GigEm Feds approve $265 million to manufacture coronavirus vaccine at Texas A&M facility Texas A&M University could take a leading role in producing a COVID-19 vaccine next year if an effort from Novavax Inc. makes it through clinical trials.The federal government will spend $265 million... statesman.com", "2020-07-27T20:40:48.000Z": "Texas manufacturing sector's recovery continues in July.\n\n\"The past two months have marked a significant turnaround\"\n\nWe can create more jobs while also using safe practices to contain COVID spread.\n\nWe can do both: save lives & support livelihoods. Texas manufacturing sector's recovery continues in July Despite the coronavirus pandemic's impact on the Texas economy, factory activity in the state continued to rebound in July, according to a new survey of business executives.The state production... statesman.com", "2020-07-27T19:46:17.000Z": "Texans are doing great-taking action needed to slow the spread of COVID. \n\nLet's continue to beat these other states to crush it. \n\nCOVID hasn't disappeared. \n\nWe must continue using masks, keeping safe distances & staying home if possible.", "2020-07-27T03:03:58.000Z": "Texas has heroic emergency responders.\n\nResponding to #HurricaneHanna , the Texas Task-Force 1 water rescue squad rescued 3 from a sinking boat in Corpus Christi.\n\nThey operate under the Texas Division of Emergency Management. @TxTF1  @TDEM Texas A&M Task Force 1 saves three people from sinking vessel during Hurricane Hanna Texas A&M Task Force 1 saves three people from a sinking vessel during Hurricane Hanna near Corpus Christi kbtx.com", "2020-07-27T00:55:47.000Z": "The mask mandate is helping in Texas.\n\n\"Epidemiologists and disease modelers say they are cautiously optimistic that the mandate is helping the state turn a corner in its efforts to contain an outbreak that has killed more than 4,500 Texans.\" Mask mandate appears to be helping in Texas, but experts ask Gov. Greg Abbott not to rule out a... A plateauing of new virus cases would hardly represent a victory over the pandemic, but it would help keep hospitals from being overrun with sick patients. kwtx.com", "2020-07-26T21:07:10.000Z": "FEMA & President Trump have already approved the Texas request relief from #HurricaneHanna .\n\nFEMA is providing reimbursement for mass care, evacuation & shelter support at 75% federal funding.\n\nWe will keep our local committees safe & help them rebuild. FEMA, President Trump approve request for hurricane relief after Hanna's landfall Gov. Greg Abbott today announced Sunday that the Federal Emergency Management Agency (FEMA) and President Donald Trump have granted an emergency declaration request in the wake of damage caused by... ksat.com", "2020-07-26T20:05:33.000Z": "This is how Texans respond to hurricanes. \n\n\"It's raining sideways right now and we can't \"expletive\" move. \n\nBut we got @Whataburger . \n\nSo, we good. Quote Tweet b @cchogiwa texans right now #HurricaneHanna", "2020-07-26T19:37:38.000Z": "Two Texas companies rank the best in America for customer experience. Survey: USAA, H-E-B named top 2 companies with the best customer experience USAA and H-E-B are first and second, respectively, in a recent report ranking U.S. companies based on customer service. expressnews.com", "2020-07-26T17:50:33.000Z": "Great job Galveston to slow the spread of COVID. \n\nYou did it by wearing masks, reducing the size of gatherings, staying home when possible & good distancing practices. \n\nCOVID can't spread if you don't give it a chance to transmit. \n\nDon't let it return. \nKeep crushing it.", "2020-07-26T00:39:37.000Z": "Texas is deploying resources to help local communities respond to #HurricaneHanna .\n\nThe National Guard, Texas Dept. Of Public Safety & Texas Division of Emergency Mgmt deployed high water vehicles, rescue boats & helicopters & medical teams.\n\nStay safe. @TexasGuard  @TDEM  @TxDPS", "2020-07-24T21:33:18.000Z": "Baseball is back in Texas. @Rangers  @Astros", "2020-07-24T15:57:23.000Z": "Houston hospitalizations are trending down. \n\nIt's a start-aided by Texans wearing masks and staying at home when possible. \n\nCOVID hasn't gone away. \n\nBut we won't have to shut down if everyone will continue using safe distancing practices.", "2020-07-24T14:53:45.000Z": "Chris Hayes was silent as Cuomo set records leading New Yorkers to death. \n\nUsing click bait & lacking compassion he attacks Texas-while ignoring CA. \n\nTexas is beginning to slow the spread with increased mask use, distance practices & surging medical teams to care for Texans. Quote Tweet Dan Crenshaw @DanCrenshawTX US House candidate, TX-2 Replying to @chrislhayes Hi Chris, looking for attention? \n\nNever said it was hype. Never used those words. You just lied, while you call yourself the \"news.\"\n\nI've called for panicked rhetoric, like yours, to stop. Also, glad today's Houston hospitalizations continue to decline. Not sure if you saw:", "2020-07-24T01:21:15.000Z": "The Texas coast is under a tropical storm watch.\n\nTexans near the storm area should expect heavy rain & wind.\n\nAvoid flooded roads & heed local warnings.\n\nThe Texas Division of Emergency Management is preparing teams to assist local communities. @TDEM Tropical depression in the Gulf of Mexico expected to strengthen before hitting Texas A tropical depression that has developed in the Gulf of Mexico is expected to strengthen into a tropical storm before making landfall along the Texas coast... dallasnews.com", "2020-07-23T02:41:56.000Z": "Texas is surging medical teams to Harlingen, Del Rio, Eagle Pass, Rio Grande City & other areas hit hard by COVID-19.\n\nWe are providing ventilators & PPE to Cameron and Hidalgo Counties, including over three million surgical masks. Governor Abbott provides aid to Rio Grande Valley hit hard by COVID-19 AUSTIN- Governor Greg Abbott held virtual meetings with mayors, county judges, emergency managers, hospital executives, state legislators, and other local officials from Cameron and Hidalgo Counties... news4sanantonio.com", "2020-07-22T22:10:19.000Z": "Tesla picks Texas for its Cybertruck factory.\n\n...Thanks to .... @elonmusk  & . @Tesla for embracing our great state.\n\nThe Gigafactory will employee thousands of Texans & be a cornerstone for next generation innovation.\n\nIt's been fun to get to know you. \nWelcome to Texas.", "2020-07-20T20:58:29.000Z": "A 30-year-old attended a \"COVID party\" in Texas to see if COVID was real. \n\nHe got it. \n\nHe died. San Antonio doctor warns against deadly 'COVID parties' A physician recalls a story that a Methodist patient went to a 'COVID party' to see if it was a hoax, or real. They died. expressnews.com", "2020-07-20T20:39:06.000Z": "More military teams are headed to Texas to help control COVID-19 spread. \n\nThey are going to the hardest hit areas to help burdened doctors and nurses. More military medical teams headed to Texas to help control coronavirus spread Gov. Greg Abbott said members of the Army's Urban Augmentation Medical Task Forces arrived in Houston on Monday. caller.com", "2020-07-20T19:09:18.000Z": "Scientific Report shows that the mask mandate is successfully slowing the spread of COVID-19 in North Texas.\n\nThe report also shows that a community lock down is not needed as long as masks & other distancing strategies are used. Mask mandate successfully slowing spread of COVID-19 in North Texas, new report says Governor Greg Abbott responded to critics in his own party who think his mask requirement goes too far. fox4news.com", "2020-07-20T18:05:23.000Z": "Texas ranks 3rd best state in America for businesses to survive the COVID pandemic. https:// abc13.com/business/texas -branded-a-top-state-for-businesses-to-survive-the-pandemic/6325699/  via @ABC13Houston Texas branded a top state for businesses to survive the pandemic Despite COVID-19 cases reported in the thousands each day, the Lone Star State is being touted in a study for business survival. abc13.com", "2020-07-19T16:39:53.000Z": "Texas-working with our federal partners-is providing the Rio Grande Valley the medical care it needs for COVID.\n\nTo protect yourself from COVID & save lives wear a mask when going out or stay at home when possible. \n\nMore help for #RGV coming this week. Governor Abbott sends five Navy teams throughout Texas to combat COVID-19 AUSTIN (WOAI/KABB) -Governor Abbott announced Sunday that the U. S. Department of Defense has sent five U. S. Navy teams to four locations in South and Southwest Texas to help combat the spread of... news4sanantonio.com", "2020-07-17T18:50:23.000Z": "Texas Department of Public Safety arrest 2 more after May protests at State Capitol. \n\n... @TxDPS  Texas DPS name 2 women as latest arrests after May protests at State Capitol The Texas Department of Public Safety (DPS) announced two more arrests happened this week related to protests at the State Capitol in May. kxan.com", "2020-07-17T16:34:03.000Z": "Texas gives school districts more say in reopening schools amid pandemic.\n\nThe health & safety of students, teachers & parents is the top priority.\n\nTo ensure students receive the education they need Texas is giving local schools districts flexibility. Texas gives school districts more leeway in reopening schools amid pandemic Facing growing angst among parents and educators, the Texas Education Agency softened its stance on in-person instruction mandates as schools navigate reopening amid the coronavirus pandemic.The... statesman.com", "2020-07-14T23:33:22.000Z": "At this moment 36 years ago I was in a Houston Emergency Room. \n\nMy back was broken & I was paralyzed for life. \n\nLittle did I know that I would one day become Governor of the great state of Texas.\n\nWe all face difficult challenges that we can overcome. \n\nNever give up.", "2020-07-13T22:01:16.000Z": "Texas based H-E-B named best supermarket in America. \n\n... @HEB  H-E-B named best supermarket in the country by Food & Wine, confirming what we all knew No store does more, truly. chron.com", "2020-07-13T01:42:38.000Z": "In Texas we honor the brave law enforcement officers who put their lives on the line to keep our communities safe.\n\nWe mourn the loss of these courageous officers who gave their all.\n\nTexas is eternally grateful for their service. #BackTheBlue  #RGV Abbott orders flags flown at half-staff as tribute to McAllen officers - The Monitor Gov. Greg Abbott granted permission to fly the United States and Texas flags at half-staff in honor of two McAllen police officers who were killed in the line of duty Saturday. \"Today we mourn with a... themonitor.com", "2020-07-11T23:51:03.000Z": "Two of our finest were killed in the line of duty while working to protect residents in their community.\n\nI've spoken with McAllen Police Chief Victor Rodriguez and offered the full support of the State of Texas.\n\nWe unite to #BackTheBlue . #RGV Two McAllen police officers killed in line of duty - The Monitor Two McAllen police officers were shot and killed Saturday, Police Chief Victor Rodriguez said. \"We have lost two brave public servants who sought only to keep peace in our City,\" Rodriguez said via... themonitor.com", "2020-07-11T21:32:03.000Z": "The Federal Government is surging a massive amount of medical personnel and resources to regions across Texas to help our communities and hospitals care for COVID-19 patients. Gov. Abbott announces more resources, including Medical Task Force to help combat COVID-19 AUSTIN, Texas - Governor Greg Abbottannounced Friday night that additional federal resources have been activated and will be sent to the Houston region to combat COVID-19. Based on a press release,... foxsanantonio.com", "2020-07-07T16:14:03.000Z": "The Texas Department of Public Safety arrested two more people accused of rioting and vandalism during recent protests at the Texas State Capitol.\n\nPeaceful protest is legal.\n\nRioting & vandalism won't be tolerated. @TxDPS  #txlege Two more arrested in connection to protests at Texas Capitol The Texas Department of Public Safety on Monday announced that it has arrested two more people accused of rioting and vandalism during recent protests against police brutality at the Texas State... statesman.com", "2020-07-07T15:47:49.000Z": "Today we remember the five @DallasPD officers who were ambushed and killed on July 7, 2016.\n \nWe will never forget their service and sacrifice.\n \nMay God bless these heroes and all those who risk their lives to keep us safe. #BackTheBlue", "2020-07-07T05:34:19.000Z": "Eric-why is Texas tied for the lowest death rate of the 27 most affected states?\n\nWhy have more Texans recovered from COVID than any other state & twice the number of New Yorkers?\n\nWhy is CA spiking more than TX even though it shut down harder & longer than TX? Quote Tweet Eric Holder @EricHolder Why did Governors in Arizona, Texas and Florida delay closing down, rush to reopen & politicize mask use? Idiocy & political gutlessness. Combined with Trump ineptitude this has led to unnecessary suffering that will only get worse over the next few weeks. https:// washingtonpost.com/opinions/2020/ 07/06/here-are-governors-who-hurt-so-many-so-needlessly/ ", "2020-07-04T03:08:04.000Z": "President Trump speaking about Mount Rushmore:\n\n \"This monument will never be desecrated. These heroes will never be defaced! Their legacy will never, ever be destroyed!\"\n\nWhat a sight that monument is. #4thofJuly", "2020-06-29T20:30:11.000Z": "CHINA!!!\n\nAGAIN!!!\n\nThis must end. Flu virus with 'pandemic potential' found in China The new strain, scientists say, is carried by pigs but can infect humans and requires close monitoring. apple.news", "2020-06-23T02:35:08.000Z": "Jack Wilson is a true Texas hero.\n\nHe took down a gunman in a Texas church, preventing countless church worshipers from being slaughtered.\n\nI gave him the Governor's Medal of Courage for putting his life on the line to save others.\n\nTexas needs heroes like Jack Wilson in office. Quote Tweet Bud Kennedy / #ReadLocal @BudKennedy Granbury @RepMikeLang responds to @GregAbbott_TX 's endorsement of opponent Jack Wilson by saying someone needs to stand up to Abbott and \"tyranny.\" (Hood County openly defies state health orders, claiming a loophole.) h/t @BradJ_TX  https:// star-telegram.com/news/politics- government/article243643562.html  Show this thread", "2020-06-21T18:04:02.000Z": "Nothing is better than being a father. #HappyFathersDay2020 to all the fathers who play such an important role in their children's lives.", "2020-06-21T02:33:37.000Z": "This has my support!\n\nRestaurants begin push to make alcohol-to-go permanent in Texas. #txlege Restaurants begin push to make alcohol-to-go permanent in Texas Texas restaurant leaders say they've started the campaign to make alcohol-to-go permanent in Texas. The Texas Restaurant Association announced in a letter on Thursday that it has submitted a proposal... foxsanantonio.com", "2020-06-19T15:14:58.000Z": "Today we celebrate #Juneteenth . \n\nTexas was the 1st state to make Juneteenth a state holiday. \n\nWe celebrate the arrival of the Emancipation Proclamation in Texas & the abolition of slavery.\n\nBut this isn't a one day event--we must expand liberty & opportunity EVERY day.", "2020-06-18T19:58:21.000Z": "The Texas economy is the 5th most racially equal in the U.S. \n\nTexas also has the 3rd lowest poverty rate gap between white and Black people.\n\nWe call this a good start. \n\nTexas always strives to be #1. Study: Texas economy fifth most racially equal in the U.S. The study determined equality by subtracting the values attributed to whites and blacks for a given metric, using on the most recent data from the U.S. Census Bureau, U.S. Equal Employment Opportun... fox7austin.com", "2020-06-16T19:31:06.000Z": "Mattress Mack is a great Texan. \n\nHe is opening a tuition-free charter school that offers vocational training and more. \n\nGallery Furniture is dedicating 15,000 square feet of its north Houston location to the Premier High School. #txlege Mattress Mack opening tuition-free charter school that offers vocational training and more Gallery Furniture is dedicating 15,000 square feet of its north Houston location to the Premier High School. khou.com", "2020-06-14T12:55:51.000Z": "Happy birthday to the incredible @USArmy . \n\nThank you for your 245 years of dedicated service to our country. \n\nWe appreciate all that you do to protect and defend our nation daily. #ArmyStrong", "2020-06-13T16:43:52.000Z": "Defund government bureaucracy--not law enforcement. Top Executive Pay Should Be Cut First; Dallas Mayor to City Manager Amid protesters' talk of 'defunding' police, Dallas Mayor Eric Johnson sent City Manager TC Broadnax a memo Friday saying top executives compensations should be cut first. Coronavirus has crippled... nbcdfw.com", "2020-06-10T17:22:49.000Z": "University of Texas researchers are successfully treating severe coronavirus cases with blood from recovered patients. \n\nThis is another step toward moving beyond #COVID19 . #txlege UT researchers find success treating severe coronavirus cases with blood from recovered patients Recovered COVID-19 patients might hold a solution to treating severe cases of the coronavirus, researchers at the University of Texas say.In a recently published study conducted with scientists at... statesman.com", "2020-06-08T20:39:34.000Z": "Today I spent time with the #GeorgeFloyd family.\n\nThey are wonderful, God loving people.\n\nThey will be the centerpiece of helping America bridge our racial divide & ensure equality, justice & fairness for everyone in America-& ensure what happened in Minn. never happens in TX.", "2020-06-08T05:43:04.000Z": "Seems like Planned Parenthood wants Babies with Disabilities to be killed. \n\nHmmm. As if people with disabilities aren't able to accomplish anything. \n\nHmmm! Babies with Disabilities Shouldn't Be Killed | American Center for Law and Justice Planned Parenthood wants babies with disabilities to die. It's that simple. It's that disgusting. And it should be illegal. One state passed a commonsense... aclj.org", "2020-06-08T03:08:23.000Z": "The busiest airport in the WORLD for the month of May was our very own DFW.\n\nCOVID or Non-COVID, Texas will always be an economic leader. #txlege DFW becomes the world's busiest airport during COVID-19 downturn DFW International Airport was the world's busiest airport in May, leaping ahead of other major travel hubs that have downsized during the COVID-19 pandemic. dallasnews.com", "2020-06-07T04:47:35.000Z": "As my twitter account shows the National Guard has been deployed from the beginning of the protests.\n\nThe hard working men & women of @TexasGuard are deployed across the state & are fully engaged, working alongside the @TxDPS & local law enforcement . https:// twitter.com/Dog2Purple/sta tus/1269320914992152577  This Tweet is unavailable.", "null": "", "2020-06-07T00:19:34.000Z": "No Limits Texas at the ... @TXMotorSpeedway  #Genesys300 . \n\n... @IndyCar ... @IndyCaronNBC ", "2020-06-06T23:58:45.000Z": "I almost got away with this steering wheel. \n\nTurns out he needs it. \n\nAmazing to see this just pop off the car. \n\nI need one of these for my wheelchair. @TXMotorSpeedway  #Genesys300", "2020-06-06T23:47:21.000Z": "At the @TXMotorSpeedway tonight for the first professional sporting event in Texas since #COVID19 . \n\nIt's the #Genesys300 . \n\nI'll be in the pace car to start the race-with the need for speed. @IndyCar", "2020-06-06T13:00:01.000Z": "We pay solemn tribute to the greatest generation, who bravely stormed the beaches of Normandy 76 years ago to change the course of history. \n\nAll gave some, some gave all. #DDay76", "2020-06-05T14:51:04.000Z": "BOOM:\n\nMay sees biggest jobs increase ever of 2.5 million as economy starts to recover from coronavirus. May sees biggest jobs increase ever of 2.5 million as economy starts to recover from coronavirus Nonfarm payrolls in May were expected to decrease by 8.333 million while the unemployment rate was seen rising to 19.5%, according to economists surveyed by Dow Jones. cnbc.com", "2020-06-05T02:28:46.000Z": "Unemployment claims filed in Bexar County have been cut in half. \n\nSimilar trends can be seen across Texas.\n\nTexans are getting back to work.\n\nTexas will lead the way! #txlege Unemployment claims still declining in Bexar County More than 106,000 workers in Texas filed for unemployment last week as total claims have topped 2.3 million throughout the state since mid-March, when the coronavirus pandemic forced mass business... expressnews.com", "2020-06-04T04:39:53.000Z": "Today Texas had the fewest #COVID19 hospitalizations in the past 6 weeks.\n\nAnd, we now rank #1 in America for the most recoveries from COVID. #txlege  #coronavirus", "2020-06-02T18:20:39.000Z": "Abbott: \"We will not be asking the United States military to come into the state of Texas because we know Texans can take care of Texas.\"", "2020-06-02T03:00:23.000Z": "Today Texas had the fewest #COVID19 fatalities since March 30th.\n\nWe also had the fewest Texans testing positive for COVID in the past 6 weeks.\n\nAnd, we have the 2nd most recoveries from COVID in America. #txlege  #coronavirus  https:// txdshs.maps.arcgis.com/apps/opsdashbo ard/index.html#/ed483ecd702b4298ab01e8b9cafc8b83 ", "2020-06-02T00:00:53.000Z": "Today I joined all 4 U.S. Attorneys in Texas to announce that criminals coming to Texas from out of state to loot or commit crimes that violate federal law will be subject to federal prosecution.\n\nPeaceful protest must be allowed free from agitators. Non-Texans caught looting in Texas to be federally prosecuted, Gov. Abbott says Texas Governor Greg Abbott announced Monday that out-of-state \"agitators\" participating in George Floyd protests would be handed over to federal authorities for prosecution if they are caught... newsweek.com", "2020-06-01T21:15:55.000Z": "", "2020-05-31T19:12:47.000Z": "", "2020-05-30T20:19:40.000Z": "The mayor also mentions that he spoke with Governor @GregAbbott_TX , who offered support to the city following last night's protest. About 400 @TxDPS troopers will be in town to work with @houstonpolice and help enhance safety and law enforcement response during the protests.", "2020-05-30T18:54:49.000Z": "", "2020-05-30T00:09:16.000Z": "You heard it here first. \n\nBOTH the Texas Aggies \nAND the Texas Longhorns will beat LSU this season. @AggieFootball  @TexasFootball  #GigEm  #HookEm The following media includes potentially sensitive content. Change settings View", "2020-05-29T23:27:21.000Z": "Texas A&M set to reopen campus in the Fall. #GigEm ... @TAMU  Texas A&M set to reopen campus in the Fall \"You can get a degree online,\" said Chancellor John Sharp \"But it's very hard to be an Aggie online.\" kagstv.com", "2020-05-29T20:12:20.000Z": "This Texas city is the fastest growing in America.\n\nIt will be Texas that leads our Nation out of this COVID-caused downturn. #txlege Frisco earns yet another No. 1 title, thanks to its skyrocketing growth Frisco grew faster than any other large U.S. city over the last decade, according to a new study from the Census Bureau. Frisco had a growth rate of 71.1%... dallasnews.com", "2020-05-29T03:29:58.000Z": "Listen to Chuck Norris...\n\n...or else... Chuck Norris joins Texas' first lady for special storytime reading Chuck Norris doesn't read books. Books read Chuck Norris, unless that book is \"The Very Hungry Caterpillar\" and he is with the Texas First Lady. click2houston.com", "2020-05-28T02:26:48.000Z": "Congratulations @CityofDallas for rejecting a property tax increase. \n\nIt's best for property owners and great for attracting more good paying jobs to your wonderful city.  \n\nYou are a model for other cities. @Johnson4Dallas  #txlege Quote Tweet Jason Whitely @JasonWhitely MORE: Record vote on whether Dallas looks at an 8% property tax increase:\n\nJohnson - NO\nMedrano - NO\nMcGough - NO \nWest - NO \nThomas - Absent\nArnold - NO\nResendez - YES\nNarvaez - NO\nBazaldua - YES\nAtkins - YES\nBlackmon - NO\nKleinman - NO\nMendelsohn - NO\nGates - NO\nBlewett - NO", "2020-05-26T21:28:13.000Z": "Mall food courts, water parks & driver education programs are able to open under Phase 2 in Texas. #txlege Mall food courts, water parks & driver education programs will be able to open under Phase 2 of... Rock'N River Water Park in Round Rock has already announced it will reopen on May 30 with limited capacity, as has Typhoon Texas Austin. kxan.com", "2020-05-26T20:18:36.000Z": "Dallas County reports no coronavirus deaths as cases continue to trend downward.\n\nStories of improvement like this are surfacing across the state.\n\nLet's extend this trend by doing all we can to reduce the spread of #COVID19 and open up Texas. #txlege Dallas County reports no coronavirus deaths as cases continue to trend downward Judge Clay Jenkins urged residents to practice social distancing and said that wearing a mask is the \"quintessential American value of an act of kindness.\" star-telegram.com", "2020-05-26T03:18:53.000Z": "Today Texas had the fewest #COVID19 fatalities since the end of March.\n\nWe also had the fewest COVID hospitalizations since the middle of April.\n\nAnd, we have the 2nd most recoveries from COVID in America. #txlege Texas reports more than 300 new coronavirus deaths, a record high The Texas Tribune is using data from the Texas Department of State Health Services to track how many Texans have tested positive for the novel coronavirus in Texas each day. The state data comes from... apps.texastribune.org", "2020-05-25T18:04:53.000Z": "The promise of America has been kept by those we honor on Memorial Day. \n\nBecause of those who fought & died for our country, America remains the greatest Nation in the history of the world. \n\nWe never forget. #MemorialDay", "2020-05-24T19:05:51.000Z": "Surge response teams are working in 60 Texas communities this weekend to tackle #COVID19 clusters.\n\nThese efforts help us corral #coronavirus hot spots.\n\nThis allows more Texans to get back to work. #txlege Surge response teams active in 60 Texas communities this weekend tackling COVID-19 clusters Emergency management chief Nim Kidd uses a wildfire analogy to explain how the state approaches a community where there's been an outbreak. kxan.com", "2020-05-24T05:28:34.000Z": "Hey @SenTedCruz is that a day at the office in Congress? Quote Tweet Ted Cruz @tedcruz I didn't know I needed this. twitter.com/RexChapman/sta", "2020-05-24T03:09:53.000Z": "All the best for LTC Allen West.\nAll those prayers are gonna be answered. Quote Tweet ✟ Right Scoop ✟ @trscoop UPDATED: Allen West injured in motorcycle accident in Texas, airlifted to a hospital... #prayersforallen  https:// wp.me/pqwpd-1kZ9", "2020-05-23T23:31:25.000Z": "In our continuing effort to protect the health and safety of both our residents and staff, we are expanding COVID-19 testing to all residents and employees in our state supported living centers. #txlege  https:// texastribune.org/2020/05/21/tex as-coronavirus-testing/?utm_campaign=trib-social-buttons&utm_source=twitter&utm_medium=social  via @TexasTribune Texas will test all residents and staff in state-run homes for peop... The test kits for residents of state supported living centers have been ordered and are on their way. The agency is \"working on a broader plan to get the test kits for staff,\" a state official said. texastribune.org", "2020-05-23T16:04:41.000Z": "Great graduation comments by the legend @PatrickMahomes  #WreckEm  @TexasTech Quote Tweet Texas Tech University @TexasTech The man who exemplifies the phrase, \"From here, it's possible.\" #TexasTech | @PatrickMahomes | #TTUGrad", "2020-05-23T05:12:07.000Z": "Texas Emergency Response teams are deployed to North Texas to help respond to severe weather.\n\nKeep our fellow Texans in your prayers over night. #txlege Quote Tweet Gov. Greg Abbott @GovAbbott Deploying Texas Task Force 2 to North Texas following a tornado touchdown.\n\nMore details ↓", "2020-05-23T03:05:24.000Z": "Texas is Opening Safe, Smart, and Strong. #txlege  https:// youtu.be/4J61y63pbyw via @YouTube Opening Texas Safe, Smart, and Strong youtube.com", "2020-05-22T19:14:14.000Z": "Alright, alright, alright. @McConaughey  #TexansHelpingTexans Quote Tweet Matthew McConaughey @McConaughey Thanks to @LincolnMotorCo for donating 110 thousand masks - me and @iamcamilaalves hitting the road to get em to rural hospitals in need across Texas", "2020-05-22T13:29:55.000Z": "CVS Health is opening 44 new #COVID19 testing sites across Texas. \n\nWe are further expanding testing capabilities to mitigate the spread of this virus. @CVSHealth  @cvspharmacy CVS opening 44 new coronavirus testing sites across Texas The free COVID-19 tests will be available by appointment only beginning Friday, May 22. khou.com", "2020-05-21T19:24:43.000Z": "Driver's license offices will begin to open next week. @TxDPS  #txlege Governor Abbott, DPS announce limited reopening of driver license offices Governor Greg Abbott today announced that the Texas Department of Public Safety will begin a phased opening of driver license offices starting May 26th with limited service offerings. kxxv.com", "2020-05-21T18:27:25.000Z": "CONGRATULATIONS to the new @ODNIgov Director John Ratcliffe!\n\nHe's been an outstanding member of Congress. \n\nHis expanded leadership role will be invaluable to America. \n\n@RepRatcliffe Quote Tweet Senate Republicans @SenateGOP CONFIRMED The United States Senate has confirmed John Ratcliffe as our new Director of National Intelligence. @ODNIgov  GIF", "2020-05-21T02:46:01.000Z": "Gov. Abbott, DSHS distribute antiviral drug Remdesivir in Lubbock to treat COVID-19.\n\nThis is being distributed to hospitals across the state.\n\nMore drugs to treat #COVID19 will be added in coming months. #txlege Gov. Abbott, DSHS distribute antiviral drug Remdesivir in Lubbock to treat COVID-19 Governor Greg Abbott today announced that the Texas Department of State Health Services (DSHS) is distributing three cases of the antiviral drug remdesivir to two hospitals across Lubbock. ramar.worldnow.com", "2020-05-20T23:36:54.000Z": "NCAA allows college football activities to resume. NCAA approves athletic activities to resume in three sports .", "2020-05-20T21:05:54.000Z": "As we celebrate #NationalEMSWeek , let's take a moment to honor the tireless efforts from our frontline responders across Texas, especially during these unprecedented times.\n\nThank you for all that you do in our communities. \n\nGod bless you all.", "2020-05-20T05:51:01.000Z": "Whether we're facing times of challenge or times of prosperity-raising taxes on the people of Texas is never the answer. #txlege Gov. Abbott discourages raise property taxes by local governments in Texas Governor Greg Abbott responded to a letter from members of the Texas Democratic Congressional Delegation regarding tax burdens on Texans. In his letter, Abbott voices his support of lessening the tax... kfoxtv.com", "2020-05-18T16:14:18.000Z": "Happy birthday to the King of Country, @GeorgeStrait !", "2020-05-18T22:36:30.000Z": "As Texas moves into Phase 2 of opening business, we have the lowest number of #COVID19 deaths since early April and yesterday we had the lowest COVID hospitalizations since mid April.\n\nTexas is ready to get back to work. #txlege  https:// chron.com/coronavirus/ar ticle/Abbott-OKs-phase-2-reopening-announces-easing-15278485.php?utm_campaign=socialflow&utm_source=sftwitter&utm_medium=referral&utm_campaign=CMS%20Sharing%20Tools%20(Desktop)&utm_source=t.co&utm_medium=referral  via @houstonchron Abbott: Bars, day cares and sports can return under phase 2 of reopening Texas Texas is ready to move onto phase 2 of reopening amid the coronavirus pandemic, according to Gov. Greg Abbott. chron.com", "2020-05-18T05:41:57.000Z": "Hmmm...", "2020-05-16T13:21:21.000Z": "To the brave men and women who answered the call to serve our country: \n\nThank you. \n\nWe salute you for keeping America the greatest nation in the history of the world. #NationalArmedForcesDay", "2020-05-15T23:51:19.000Z": "From a friend.", "2020-05-15T20:21:19.000Z": "Texas was the top destination for corporate moves in 2019.\n\nThat pace continues in 2020 even during #COVID19 .\n\nThere will be many more announcements soon.\n\nAnd many more good paying jobs. #txlege Texas was the top destination for corporate moves in 2019 When it comes to corporate moves, last year Texas was the top destination for people packing up and heading across country. Texas topped the list that... dallasnews.com", "2020-05-15T19:43:38.000Z": "Severe weather will threaten many parts of Texas today and tonight. \n\nStay alert. Stay safe. \n\nListen for local emergency warnings. \n\nThe Texas Division of Emergency Management is preparing teams to assist all regions across Texas. #txlege Gov. Abbott prepares state resources as severe weather threatens parts of Texas On Friday, Governor Greg Abbott placed numerous resources on standby across the state in anticipation of severe weather--including straight-line wind, large hail, and flash flooding--expected to... cbsaustin.com", "2020-05-15T15:18:14.000Z": "Today we honor our brave law enforcement officers who made the ultimate sacrifice on this #PeaceOfficersMemorialDay .\n\nTexas is forever grateful for their service and sacrifice. #BackTheBlue", "2020-05-13T21:19:09.000Z": "Awesome view above our Capitol today. \n\nThanks to the ...Air Force Thunderbirds  for honoring our essential workers. #txlege ... @AFThunderbirds ", "2020-05-13T19:31:21.000Z": "Awesome news. \n\nTexas-based @TitosVodka is giving @Baylor College of Medicine $1M for #COVID19 vaccine research. Tito's Vodka gives Baylor College of Medicine $1 million for COVID-19 vaccine research The money from the Texas-based vodka company will help speed up the process, researchers say. khou.com", "2020-05-13T18:22:12.000Z": "Texas Governor Says He's Talked To Elon Musk About Moving Tesla.\n\nIt's true. Texas is a perfect fit for Tesla. Texas Governor Says He's Talked To Elon Musk About Moving Tesla Production resumed Monday at Tesla's only U.S. assembly plant in defiance of local guidelines for manufacturing businesses. But Wednesday morning there was evidence of a compromise in Musk's ongoing... forbes.com", "2020-05-13T18:09:02.000Z": "The Texas National Guard is launching a disinfection mission for nursing facilities across Texas.\n\nThey are making nursing homes safer for both the residents and staff. #txlege  @TexasGuard Governor Abbott, Texas National Guard Launch Disinfection Mission For Nursing Facilities Governor Greg Abbott announced that the Texas National Guard has activated Facilities Disinfection Teams to support Texans in nursing homes and to help limit the spread of COVID-19. dfw.cbslocal.com", "2020-05-13T15:14:07.000Z": "The @AFThunderbirds are flying over San Antonio and Austin today to salute frontline #COVID19 responders.\n\nThank you to our brave frontline and essential workers for all that you're doing for your fellow Texans.\n\nFlight details are below. #InThisTogether  #AmericaStrong", "2020-05-12T19:04:19.000Z": "Thanks, Texans, for your ongoing support.\n\nWe will keep focusing on opening our economy while also keeping Texas safe from #COVID19 . #txlege Exclusive poll: Amid COVID-19, Gov. Abbott's approval rating is higher than Pres. Trump's in Texas The poll also revealed regardless of who they vote for, 60.6% of Texans surveyed indicated they expected Trump to win in November. kxan.com", "2020-05-12T04:02:08.000Z": "The Harvard Global Health Institute shows Texas is \"already doing enough\" #COVID19 tests to begin reopening business.\n\nThis analysis goes beyond the uninformed notion that one test number fits all states.\n\nStill, Texas is ramping up testing. #txlege Many states short of Covid-19 testing levels needed for reopening - STAT The analysis shows the U.S. is at risk of fumbling the next challenge: testing enough people to determine which cities and states can safely reopen. statnews.com", "2020-05-12T02:47:12.000Z": "National Guard COVID-19 testing helps Gov. Abbott safely reopen Texas.\n\nThanks to @TexasGuard . #txlege  #COVID19  https:// caller.com/story/news/loc al/2020/05/11/national-guard-covid-19-testing-helps-gov-abbott-safely-reopen-texas/3085663001/  via @callerdotcom National Guard COVID-19 testing helps Gov. Abbott safely reopen Texas The National Guard said it is collecting data necessary for Abbott to continue to reopen the state safely. caller.com", "2020-05-11T23:41:01.000Z": "Thank you to all who serve and protect our communities. \n\nWe stand with our brave law enforcement officers. #NationalPoliceWeek  #BackTheBlue", "2020-05-11T22:30:38.000Z": "All nursing home residents and staff will be tested for COVID-19.\n\nThese are the Texans who are most vulnerable to the #coronavirus .\n\nContaining #COVID19 in nursing homes will save lives and reduce the spread of the virus. #txlege Governor Abbott says all nursing home patients, staff will be tested for COVID-19 Governor Greg Abbott today directed the Texas Health and Human Services Commission (HHSC), the Texas Division of Emergency Management (TDEM), and the Texas Department of State Health Services (DSHS)... kxxv.com", "2020-05-11T20:28:50.000Z": "Elon Musk could save billions in taxes if Tesla moves its headquarters to Nevada or Texas. \n\nJust saying. Elon Musk could save billions in taxes if Tesla moves its headquarters By moving his company and his home to Nevada or Texas, Elon Musk could save billions in income taxes apple.news", "2020-05-11T19:02:21.000Z": "Major League Baseball may start its season during the 4th of July weekend. \n\n... @MLB  AP source: MLB owners to propose plan to start season in July Major League Baseball owners gave the go-ahead Monday to making a proposal to the players' union that could lead to the coronavirus-delayed season starting around the Fourth of July weekend in... chron.com", "2020-05-11T02:07:46.000Z": "Help honor our teachers.\n\nIs there a Texas teacher you think deserves special recognition?\n\nSend them a Superstar Teacher certificate by clicking on the link & filling out the form below Teaching Superstars 2020 - Greg Abbott Greg Abbott is fighting for Texas families and Texas values, by creating jobs and defending our constitutional rights and freedoms. gregabbott.com", "2020-05-10T23:06:39.000Z": "The State more than triples aid to the San Antonio Food Bank to help feed the hungry. #txlege  #COVID19 State more than triples aid to San Antonio Food Bank, providing $9 million to help feed the hungry With jaw-dropping figures in hand showing the staggering number of hungry people the San Antonio Food Bank has been feeding since the pandemic started, state officials dramatically increased the... expressnews.com", "2020-05-10T15:50:36.000Z": "#HappyMothersDay to a wonderful mom and a fabulous First Lady.", "2020-05-10T03:15:58.000Z": "Nearly $635 million was sent this week to rural healthcare providers in Texas to respond to #COVID19 . \n\nThanks to the US Health & Human Services for their support. \n\n... @HHSGov  #txlege  #coronavirus", "2020-05-09T19:57:50.000Z": "Quote Tweet Elon Musk @elonmusk Replying to @elonmusk @GerberKawasaki and @thirdrowtesla Frankly, this is the final straw. Tesla will now move its HQ and future programs to Texas/Nevada immediately. If we even retain Fremont manufacturing activity at all, it will be dependen on how Tesla is treated in the future. Tesla is the last carmaker left in CA.", "2020-05-08T21:20:14.000Z": "Thanks Senator @Kseliger to you and to Representatives @FourPriceTX , John Smithee, and @KingForTexas for all you are doing to help corral #COVID19 around the Amarillo area that stem from some meat processing plants.\n\nWorking together, we will get this contained. #txlege Quote Tweet Kel Seliger @kseliger My team and I are closely monitoring the outbreak of coronavirus in Potter and Moore counties at this time. I have been in conversation with Governor @GregAbbott_TX and other local elected officials... 1/2 Show this thread", "2020-05-08T20:52:54.000Z": "Texas is working with the Dallas ISD to launch a statewide effort to provide Internet service to students who lack it.\n\nWe want to ensure all students can access education on line. #txlege Dallas ISD, Texas Gov. Greg Abbott Launch Statewide Effort To Provide Internet To Students Who Lack... While students are continuing to learn from home, state and local leaders are looking to address the lack of internet for hundreds of thousands of students across Texas. dfw.cbslocal.com", "2020-05-08T19:44:17.000Z": "The @AFThunderbirds will honor frontline #COVID19 responders & essential workers with flights over Austin & San Antonio next Tuesday. #AmericaStrong  #InThisTogether Air Force Thunderbirds to fly over San Antonio, Austin on May 13 The United States Air Force Thunderbirds will fly over San Antonio and Austin on May 13 as part of Operation America Strong! \"We are honored to extend our gratitude to Texans in San Antonio and... news4sanantonio.com", "2020-05-08T16:42:15.000Z": "Today is the 75th anniversary of the Nazi surrender in Europe.\n\nWe honor the heroes whose sacrifices led to victory in 1945.\n\nLong live freedom. #VEDay75", "2020-05-08T15:29:30.000Z": "Today we celebrate & honor military spouses who support our brave servicemen & women. \n\nThank you for the sacrifices you make everyday for our country. #MilitarySpouseAppreciationDay", "2020-05-07T20:18:17.000Z": "\"Texas has been phenomenal,\" Trump said.\n\nWe appreciate the President and his team being available 24/7 to help Texas fight against #COVID19 and to put us in a position to open up business.\n\nTexans will prevail. #txlege In White House meeting, Trump praises Abbott for coronavirus response President Donald Trump met Gov. Greg Abbott in the Oval Office Thursday, praising the governor as he continues to loosen restrictions on certain businesses.\"He's a very special governor,\" Trump said.... statesman.com", "2020-05-07T14:32:39.000Z": "Throwing Texans in jail whose biz's shut down through no fault of their own is wrong.\n\nI am eliminating jail for violating an order, retroactive to April 2, superseding local orders.\n\nCriminals shouldn't be released to prevent COVID-19 just to put business owners in their place.", "2020-05-07T03:26:53.000Z": "No one should forfeit their liberty and be sent to jail for not wearing a mask. \n\nI'll make further announcements about this and related issues in the morning. #txlege Abbott on virus restrictions: 'No one should forfeit their liberty and be sent to jail for not... Texas Gov. Greg Abbott joined \"Hannity\" Wednesday to discuss  the case of Dallas hair salon owner Shelley Luther, who was sentenced to seven days in jail Tuesday for operating her business in... foxnews.com", "2020-05-07T00:31:02.000Z": "Happy #NationalNursesDay . \n\nI wouldn't be Governor of Texas today if it weren't for the nurses who helped me after my back was broken in half. \n\nTHANK YOU nurses for all that you do, especially for serving on the frontlines in our efforts to combat #COVID19 . \n\nGod bless you all.", "2020-05-06T17:48:03.000Z": "See the statements from @TXAG and me on the jailing of Dallas Salon Owner Shelley Luther.", "2020-05-06T15:03:01.000Z": "Texas National Guard is offering free COVID-19 testing Wednesday in San Angelo. #COVID19  #coronavirus  #txlege  http:// myfoxzone.com/article/news/h ealth/coronavirus/texas-military-department-offering-free-covid-19-testing-wednesday-in-san-angelo/504-d43c481d-a3ec-46e8-a60c-ab220f57a4ae  via @foxsanangelo Texas Military Department offering free COVID-19 testing Wednesday in San Angelo Free testing will be available from 9-5 Wednesday at the McNease Convention Center. Citizens do not have to have symptoms to receive one of the 180 available tests. myfoxzone.com", "2020-05-06T14:55:49.000Z": "Today the @BlueAngels are saluting our brave frontline #COVID19 responders and essential workers in DFW and Houston starting at 11 AM CT.\n\nFlight paths can be found below. #InThisTogether  #AmericaStrong", "2020-05-06T03:36:31.000Z": "Graduation ceremonies are such special occasions--whether it's kindergarten, high school, or in between.\n\nTexas is providing schools with options to help families capture these special memories. #txlege  http:// kvue.com/article/news/l ocal/texas/texas-coronavirus-greg-abbott-2020-high-school-graduation-ceremonies/269-457c0237-f0cc-44f5-935f-df2c5340e88f  via @KVUE Texas allows 2020 graduation ceremonies to go ahead, with restraints Under Gov. Greg Abbott's plan, the state will allow hybrid graduations, vehicle ceremonies and outdoor ceremonies with appropriate social distancing. kvue.com", "2020-05-05T22:25:46.000Z": "Open Texas continues as Hair and Nail Salons can open on May 8 and Gyms can open on May 18. \n\nThat and more announced today. \n\nEveryone must still do their part to slow the spread of #COVID19 . #txlege 'Open Texas' Continues as Hair, Nail Salons to Open May 8, Gyms on May 18 Texas Gov. Greg Abbott will provide an update on the statewide response to COVID-19 Tuesday afternoon. nbcdfw.com", "2020-05-05T17:51:33.000Z": "Happy #NationalTeachersDay to our incredible educators.\n\nWith the challenge of #COVID19 , we appreciate all that you're doing to create innovative solutions for distance learning.\n\nThank YOU teachers for your tireless efforts to teach the next generation of leaders.", "2020-05-05T14:17:48.000Z": "The \"King of Country\" is taking over my Facebook Live this morning.\n\nJoin @GeorgeStrait at 10 AM CT for a Texas-sized story time for children & parents. \n\nWatch live: http:// Facebook.com/TexansforAbbott", "2020-05-04T21:01:54.000Z": "We are doing #COVID19 tests in every part of the state.\n\nLater this week we will be in Paris, Texas. #txlege  http:// theparisnews.com/article_43bd9a 20-8e42-11ea-b90c-9bd746d860f5.html?utm_medium=social&utm_source=twitter&utm_campaign=user-share  via @TheParisNews State of Texas to offer mobile Covid-19 testing in Paris News of the testing comes after an outbreak of Covid-19 was discovered at Paris Healthcare Center and as Paris-Lamar County Health District officials continue to report increasing cases attributed to theparisnews.com", "2020-05-04T19:24:15.000Z": "Thanks Texans for supporting our approach to the #coronavirus pandemic.\n\nWe will continue the combination of opening our economy while emphasizing your safety.\n\nWe must continue to slow the spread. #txlege  https:// tylerpaper.com/news/education /most-texans-approve-of-gov-abbott-and-local-leaders-approach-to-coronavirus-pandemic/article_4bb04c8e-8e1d-11ea-931d-3b1f95ee8cf0.html?utm_medium=social&utm_source=twitter&utm_campaign=user-share  via @https://twitter.com/Tylerpaper UT Tyler poll: Most Texans approve of Gov. Abbott and local leaders' approach to coronavirus... Over a majority of Texas voters approve of how Gov. Greg Abbott and local leaders are handling the coronavirus pandemic, according to a recent poll by the UT Tyler Center tylerpaper.com", "2020-05-04T19:17:03.000Z": "Navy's Blue Angels and Air Force Thunderbirds will fly over North Texas Wednesday in salute to COVID-19 responders.\n\nWe thank those First Responders for all they do to help us respond to #COVID19 . Here's the route the Blue Angels will fly over North Texas Wednesday to salute COVID-19 responders The U.S. Navy's elite squadron of trick flyers, the Blue Angels, will buzz across North Texas skies Wednesday as part of a nationwide salute to doctors,... dallasnews.com", "2020-05-04T17:39:47.000Z": "The @BlueAngels will be conducting a special flyover in Houston & DFW on Wednesday to honor our brave frontline #COVID19 responders & essential workers.\n\nThis is a powerful symbol of Americans coming together during these unprecedented times. #AmericaStrong  #InThisTogether", "2020-05-04T16:19:42.000Z": "Texas nurses have the highest average starting salary in the nation. \n\nWe thank them for all they do to respond to #COVID19 . #txlege  #coronavirus Texas nurses have the highest average starting salary in the nation As front line workers during the COVID-19 pandemic, nurses have never been more important for Texans than they are right now, and the Lone Star State is one of the best places for them to work,... news4sanantonio.com", "2020-05-03T23:14:56.000Z": "Thanks to Texas Tech University Health Sciences Center for helping to increase Covid-19 testing in Texas. @TexasTech  #txlege  #COVID19  #coronavirus TTUHSC to increase VTM capacity in response to Gov. Abbott's request AMARILLO, Texas (KAMR/KCIT) - Governor Greg Abbott recently talked about increasing testing availability across the State of Texas and Texas Tech University Health Sciences Center looks to play a c myhighplains.com", "2020-05-03T20:59:36.000Z": "The Texas National Guard is providing more than 30 free mobile COVID-19 testing sites statewide this weekend. #txlege  @TexasGuard Texas Military hosting more than 30 free mobile COVID-19 testing sites statewide this weekend The military-administered tests are free, but an appointment is necessary. bigcountryhomepage.com", "2020-05-03T16:34:56.000Z": "GREAT NEWS:\n\nThe number of Texans who have RECOVERED from #COVID19 now exceeds the number of active COVID cases for the past 2 days. \n\nThat's exactly what we want to see.\n\nTexas ranks 3rd highest among states for number of people who have recovered from #coronavirus . #txlege", "2020-05-02T22:45:57.000Z": "Today I worked with Amarillo Mayor Ginger Nelson, @VP Pence & @CDCgov on a plan to corral the #coronavirus flare up arising from meat packing plants in the area.\n\nA state & federal strike force surge is being sent to contain the #COVID19 spread. #txlege DEVELOPING: Amarillo Mayor Ginger Nelson announces federal COVID-19 strike force to be sent to... Governor Greg Abbott in cooperation with Vice President Mike Pence say the federal strike force team will be in Amarillo by Monday to coordinate the investigation into the increased spread of the... newschannel10.com", "2020-05-02T21:46:40.000Z": "Free COVID-19 testing site coming to Harlingen.\n\nThis is part of the Texas National Guard mobile testing team that will test about 3,000 each day.\n\nThey will test for #COVID19 in every corner of the state. #txlege  #coronavirus  @TexasGuard Free COVID-19 testing site coming to Harlingen HARLINGEN, Texas - In an effort to test more of the community, the City of Harlingen will offer a free COVID-19 testing site on Tuesday. The Texas Military is offering the site to Harlingen a valleycentral.com", "2020-05-02T18:55:06.000Z": "We're increasing #COVID19 testing.\n\nThe number of tests reported today increased by almost 29,000.\n\nThe percentage of people who are testing positive remains low: below 5%.\n\nAnd, hospitalizations decreased.\n\nAll good signs in our fight against #coronavirus . #txlege", "2020-05-01T20:29:27.000Z": "This is excellent. \n\nThe San Antonio Food Bank received more than $6M from private companies to supply families in need. \n\nTexans are continuing to come together and show that nothing is more powerful than our Texas spirit. #TexansHelpingTexans Private sector raises millions for Food Bank The San Antonio Food Bank has collected more than $6.1 million in local donations this week, including more than $5.4 million raised by WOAI-TV/KABB Fox 29's \"Feeding San Antonio\" campaign. expressnews.com", "2020-05-01T15:32:55.000Z": "Mattress Mack is giving away free masks at his furniture store in Houston. \n\nFew people do as much to help their community. \n\nHe's been a tremendous help on my advisory committee about reopening business in Texas. Gallery Furniture hosts 2nd mask giveaway at North Freeway store The event didn't cause a traffic jam like the first time around, but plenty of people were still helped! abc13.com", "2020-05-01T13:20:56.000Z": "May is National Military Appreciation Month.\n\nThank you to our brave military members, both past and present, for your service and for the sacrifices you've made for our freedom.\n\nGod bless you all.", "2020-04-30T22:21:40.000Z": "More glimmers of hope as we \"safely\" move forward and open up Texas while containing #COVID19 . \n\nTexas A&M, Texas Tech University & the University of Texas systems expect to reopen in the fall. \n\nA&M is talking about playing football. Texas A&M and University of Texas systems expect to reopen in the f... Texas Tech University also says it's planning for a return to campus for the upcoming school year. texastribune.org", "2020-04-30T02:32:55.000Z": "The First Dogs of Texas--Pancake and Peaches--are sending birthday cards to Texas children.\n\nClick on the link in the story to have one sent for free. @TexasPancake Governor, First Lady Abbott to send birthday cards to Texas children Texas governor Greg Abbott and First Lady Cecilia Abbott announced Tuesday that they will be sending birthday cards to Texas children from Peaches and Pancake, the First Dogs of Texas. Parents can... cbs4local.com", "2020-04-30T01:00:45.000Z": ". @MattressMack is providing meals for Houston-area families as the state continues to respond to #COVID19 .\n\nThank you Mack for all that you're doing for your community. Great work.\n\nGod bless you & God bless Texas. #TexansHelpingTexans Quote Tweet @MattressMack @MattressMack Mattress Mack here asking for volunteers to help package and deliver care packages to our most vulnerable senior citizens. Also- at our 6006 N. Freeway location, we have Grab & Go meals for school aged children, senior citizens and more! Details at http:// bit.ly/3d6YIxR", "2020-04-29T22:13:27.000Z": "Testing for #COVID19 gets easier and easier. \n\nHays County offers free testing for uninsured, underinsured, indigent patients. #txlege  #coronavirus Hays County offers free testing for uninsured, underinsured, indigent patients Beginning April 29, individuals with symptoms who can't afford to pay for testing can begin the screening process by calling the COVID-19 hotline. fox7austin.com", "2020-04-29T19:18:42.000Z": "Texas A&M professor says Texas will be the \"model for the nation\" for the best way to open our economy. \n\nWe use safe strategies based on data and advice from doctors. \n\nWe open as many businesses as possible in ways that contain the spread of #COVID19 . A&M professor says Texas will be the \"model for the nation\" We spoke with an A&M pandemic specialist who believes the re-opening of the Texan economy will serve as a model for other states. kbtx.com", "2020-04-29T17:08:09.000Z": "More #COVID19 testing in Lubbock.\n\nA new drive-thru testing site is available. #txlege  #coronavirus Health Department, Citibus to partner for COVID-19 drive-thru testing site at Patterson Library Beginning Wednesday, April 29, the City of Lubbock Health Department will partner with Citibus to provide transportation to the COVID-19 Drive-Thru testing site at Patterson Library. kcbd.com", "2020-04-29T04:12:59.000Z": "We are organizing an army of 4,000 #coronavirus trackers. \n\nThis will help us corral #COVID19 while also opening up Texas for business.\n\nHere's how they can help stop the virus in its tracks. #txlege  http:// kens5.com/article/news/h ealth/coronavirus/gov-abbott-wants-to-recruit-an-army-of-coronavirus-trackers-how-theyre-important-in-stopping-the-spread-of-the-virus/273-36d1f3df-bec4-49f0-a5a8-9539d498a99a  via @KENS5 Gov. Abbott wants to recruit an army of coronavirus-trackers. Here's how they can help stop the... Contact-tracers investigate after a person tests positive for the virus, identifying all the people the patient may have exposed. kens5.com", "2020-04-29T03:18:37.000Z": "Alcohol-to-go sales can continue after May 1.\n\nFrom what I hear from Texans, we may just let this keep on going forever. #txlege Alcohol-to-go sales may continue after May 1, Texas Alcoholic Beverage Commission states When restaurants reopen in a limited capacity on Friday, May 1st, those that have offered alcohol-to-go will be allowed to continue those sales, according to the Texas Alcoholic Beverage Commission.... cbsaustin.com", "2020-04-28T00:47:22.000Z": "COVID-19 testing like this continues to ramp up across the state.\n\nWe will continue to corral the #coronavirus ...\n\n...as we open up business in Texas. #txlege  #COVID19 APH hoping to test 2,000 people per week for COVID-19 with public form rollout Of the approximately 1,800 people who created an account and filled out the online form since it became live last week, 538 qualified for a test and have one scheduled, the city said. kxan.com", "2020-04-27T19:20:14.000Z": "Today's press conference is at 2:30 PM CT for an update on Texas' response to #COVID19 .\n\nTune in to watch live: http:// kxan.com/live-stream/", "2020-04-25T20:45:16.000Z": "Thanks Texans for supporting our efforts to corral the #coronavirus .\n\nYour success in slowing the #COVID19 spread will allow Texas to open our economy even more.\n\nWe will focus on safety first & be guided doctors & data.\n\nWe will create more jobs & reduce unemployment. #txlege", "2020-04-25T16:32:04.000Z": "Texas has launched an online #COVID19 test collection map to help Texans locate testing sites across the state.\n\nIt shows detailed information on public & private testing sites including mobile, walk-in, & drive-thru locations.\n\nMore are added every week. Texas releases statewide online map for COVID-19 testing sites The map displays detailed information on public and private testing sites including mobile, walk-in, and drive-thru locations. fox7austin.com", "2020-04-24T21:12:29.000Z": "Kendra Scott & Allens Boots are among Texas stores reopening today with retail to go.\n\nTexas entrepreneurs are getting back to business. #COVID19  #txlege  http:// kvue.com/article/news/h ealth/coronavirus/kendra-scott-allens-boots-texas-stores-reopening-retail-to-go/269-9b4fd283-bb50-453e-9495-3e660964cbb3  via @KVUE Kendra Scott, Allens Boots among Texas stores reopening Friday with retail to-go Retail stores in Texas can open back up starting April 24, but it won't be business as usual. It's part of Gov. Abbott's plan to slowly reopen the state. kvue.com", "2020-04-24T16:46:38.000Z": "Texas will help renters with security deposits, lease payments and utility bills.\n\nTexas got waivers from the U.S. Department of Housing and Urban Development that allows us to help renters who've lost jobs or income because of #COVID19 . #txlege Texas has $11.3 million to help renters with payments Texas has as much as $11.3 million to help renters with security deposits, lease payments and utility bills, Gov. Greg Abbott announced Friday. kwtx.com", "2020-04-23T23:25:02.000Z": "Join the legendary @ColtMcCoy tomorrow at 10 AM on Facebook Live for a virtual story time for Texas children. #HookEm  http:// Facebook.com/TexansForAbbott", "2020-04-23T15:04:28.000Z": "Excellent work.\n\nAn Eagle Scout from Texas City is producing hundreds of masks for food bank and healthcare workers in his community. #TexansHelpingTexans  #COVID19 Meet the Eagle Scout sewing hundreds of face masks during the virus outbreak You're doing great, Austin! This Texas City Eagle Scout is sewing up support for his community, one face mask at a time. abc13.com", "2020-04-23T03:17:20.000Z": "We are praying for--and helping--those in East Texas who were ravaged by tornadoes that left at least 2 dead & 10 injured.\n\nMany state agencies are on location to assist the recovery process. Texas governor Abbott vows state help as \"extremely dangerous\" tornadoes leave at least 2 dead, 10... \"Our hearts are with our fellow Texans tonight, and the state will continue to do everything it can to support those affected by this severe weather,\" Governor Abbott said Wednesday. newsweek.com", "2020-04-22T21:45:08.000Z": "More #coronavirus testing announced every day.\n\nSan Antonio could see at least five more additional COVID-19 testing sites. #txlege San Antonio could see at least five more additional COVID-19 testing sites, Metro Health director... Without widespread testing, it's been tough for health officials to get a true picture of how the virus is taking shape in San Antonio. So far, more than 14,000 residents have been tested for... expressnews.com", "2020-04-22T20:42:27.000Z": "Hair salons and shopping inside stores could be coming soon. \n\nWe are working around the clock on safe protocols for both employers and customers. \n\nThis must be done in ways that prevent the spread of #COVID19 . #coronavirus  #txlege Texas Gov. Greg Abbott won't order masks be worn, vows some restaurants, theaters, hair salons will... AUSTIN - Gov. Greg Abbott said on Wednesday that Texans, at least in many parts of the state, will be able early next month to visit hair salons, stores... dallasnews.com", "2020-04-22T18:49:49.000Z": "Elective surgeries are resume as part of the effort to reopen Texas. \n\nMany more announcements coming soon. #COVID19  #txlege Abortions resume as Abbott lifts elective surgery ban Abortions resumed in Texas on Wednesday, one month after Gov. Greg Abbott banned elective surgeries to open up bed space and medical equipment for COVID-19 patients.Abbott gave the go-ahead for... statesman.com", "2020-04-22T15:32:26.000Z": "COVID19 testing is ramping up across the state.\n\nWalmart is opening a #COVID19 testing site in Texas.\nMore to come. #coronavirus  #txlege Walmart to open its first COVID-19 testing site in Texas Walmart is about to open its first coronavirus testing site in Texas. The first one in Texas will be in Lubbock and is scheduled to open Friday. A second... dallasnews.com", "2020-04-22T03:00:40.000Z": "Texas is about to open up for business.\n\nAnd there are nearly half a million jobs waiting to be filled.\n\nWe'll get back to work ASAP...\n...& we will do it safely. #txlege  #COVID19  #caronavirus As Texas prepares to phase out stay-at-home, Governor Abbott says nearly half a million jobs are... Texas Governor Greg Abbott says companies \"big and small alike\" are hiring as the state ramps up efforts to reopen the economy amid the Covid-19 pandemic. newsweek.com", "2020-04-21T23:28:38.000Z": "Awesome work by @Baylor .\n\n900 3D printed tension-relief bands were printed in just one week for our frontline health care workers in Waco in response to #COVID19 . #TexansHelpingTexans Baylor 3D printers making a difference for healthcare workers In just a week they made 550 3D printed tension-relief bands for staff at the Waco Family Health Center and 350 for Baylor Scott & White. kcentv.com", "2020-04-21T18:39:54.000Z": "You can watch today's press conference LIVE on @KXAN_News at 2 PM CT. #COVID19  http:// kxan.com/live-stream/", "2020-04-21T17:14:05.000Z": "I thank @realDonaldTrump for focusing on the oil & gas industry. \n\nI have worked with him and his administration on it. \n\nThey are doing all possible to preserve jobs and to keep America energy independent. Quote Tweet Donald J. Trump @realDonaldTrump We will never let the great U.S. Oil & Gas Industry down. I have instructed the Secretary of Energy and Secretary of the Treasury to formulate a plan which will make funds available so that these very important companies and jobs will be secured long into the future!", "2020-04-21T14:24:40.000Z": "#OTD", "2020-04-21T03:28:05.000Z": "San Antonio restaurant owner leading the way to get Texas restaurants back open for business.\n\nWe're gonna get this done. http:// kens5.com/article/news/h ealth/coronavirus/san-antonio-restaurant-owner-leading-the-way-to-get-texas-restaurants-back-open-for-business/273-c58eb7a9-d797-4b63-bd04-8e5db37b94f4  via @KENS5 San Antonio restaurant owner leading the way to get Texas restaurants back open for business Governor Greg Abbott appointed the owner of Bill Miller Barbecue to his Strike Force, tasked with developing a plan to reopen the Texas economy. kens5.com", "2020-04-21T00:13:57.000Z": "Excellent news.\n\nMore 15- minute drive through testing for #COVID19 in Dallas. Quote Tweet Mayor Eric Johnson @Johnson4Dallas I just got word from @Walgreens that the new 15-minute drive-thru #COVID19 testing sites will go live this Friday at one Southern Dallas location and one Fort Worth location. The @CityOfDallas location will be: 2060 S. Buckner Blvd. Dallas, TX 75217. More details to come.", "2020-04-20T23:28:44.000Z": "The Texas National Guard is mobilizing more than 1,200 personnel to provide COVID-19 mobile testing teams.\n\nWe are ramping up testing across the state. @TexasGuard  #txlege Governor Abbott, Texas National Guard announce COVID-19 mobile testing sites The 45 member teams will be mobilized in various parts of the state providing greater access to medical testing. kxxv.com", "2020-04-20T18:31:32.000Z": "Just spoke to @NASCAR leaders. \n\nThey're working to return to Texas at Texas Motor Speedway very soon.\n\nI hope to announce the exciting details in the near future.\n\nTo prevent spread of #COVID19 it will be without fans. \n\nBut they will put on a great show for TV.", "2020-04-19T02:15:04.000Z": "Our hearts are heavy tonight with the report that San Marcos Police Officers were shot in the line of duty.\n\nJoin Cecilia & me in keeping these officers in our prayers. #BackTheBlue Governor Abbott Statement On San.. http:// tinyurl.com/y8h4hc3x  @woodlandsonline Governor Abbott Statement On San Marcos Police Shooting woodlandsonline.com", "2020-04-18T02:49:19.000Z": "Texas can contain the spread of #COVID19 while also adopting safe standards to begin the process of reopening the state.\n\nThe @GSF_OpenTexas is leading the charge to get the Lone Star State back to being a top 10 economy in the world. #TexasBizStrong Gov. Abbott announces phased reopening of Texas businesses Gov. Greg Abbott announced executive orders Friday that will reopen businesses and state parks, ease surgery restrictions and aim to reduce further spread of COVID-19 in Texas. kxan.com", "2020-04-17T17:00:57.000Z": "LIVE: Press Conference on COVID-19 Greg Abbott @GregAbbott_TX LIVE: Press Conference on COVID-19 pscp.tv", "2020-04-17T16:51:27.000Z": "Watch our statewide announcement LIVE right here on my Twitter at 12 PM CT. #COVID19", "2020-04-17T14:52:45.000Z": ". @TexasFLCA 's Stars of Texas Storytime continues today with special guest @KendraScott .\n\nThis virtual story time program provides entertainment & education for Texas children & a helping hand for parents during the #COVID19 response.\n\nTune in at 10 AM CT: http:// Facebook.com/TexansforAbbott", "2020-04-16T23:13:20.000Z": "Thankful for local businesses stepping up to help fellow Texans as the state continues to respond to #COVID19 .\n\nLockwood Distilling Company in North Texas is turning alcohol into hand sanitizer for essential workers, including police and fire departments. Need hand sanitizer? Distillery in Richardson is selling it and supplying it to those in need Lockwood Distilling Company in Richardson is turning alcohol into hand sanitizer to sell to the public and to help those who need it, including the city's... dallasnews.com", "2020-04-15T22:19:36.000Z": "A LOT of #COVID19 testing sites like this are being set up across Texas. \n\nHere, mobile COVID-19 testing sites are announced for Tomball & Humble. \n\nThe good news: even with more tests, 90% of Texans tested do not have the #coronavirus . #txlege Mobile COVID-19 testing sites announced for Tomball, Humble Harris County Pct. 4 Commissioner Jack Cagle announced April 13 via a news release the opening of two mobile COVID-19 testing sites this month in Tomball and Humble. chron.com", "2020-04-14T22:21:20.000Z": "Texas ranks No. 1 in SBA approvals for PPP loans to help businesses stay afloat and get ready to re-open.\n\nThe SBA approved 88,434 loans for Texas businesses totaling $21.7 Billion.\n\nOn Thursday I'll announce more about opening business in Texas. Louisiana receives over 17,000 approvals for PPP loans, totaling $3.75 billion Gov. John Bel Edwards began his daily, novel coronavirus press briefing about five minutes late. livingstonparishnews.com", "2020-04-14T14:18:03.000Z": "Veteran-owned Whitmeyer's Distilling Co. turned their whiskey distillery into a hand sanitizer operation. \n\nThey've donated over 25,000 gallons of hand sanitizer to hospitals and essential employees in Texas. #TexansHelpingTexans Veterans turn their TX whiskey distillery into hand sanitizer operation, donate thousands of gallons The owners of Whitmeyer's Distilling Co. in Houston aren't just brothers, they're Army combat veterans who have turned their whiskey distillery into a hand-sanitizer operation. To date, they have... ksat.com", "2020-04-13T20:22:30.000Z": "Texas First Lady hosting virtual story time for kids. Texas First Lady hosting virtual story time for kids Texas First Lady Cecilia Abbott announced that she will be hosting a virtual story time for children starting Tuesday. kristv.com", "2020-04-13T17:22:58.000Z": "Thank you to @GoldmanSachs and the @LiftFundUS for providing $50 million in loans to Texas small businesses.\n\nThis partnership is an important first step in our journey to economic recovery in the Lone Star State. #TexasBizStrong Gov. Abbott announces $50M in small business loans in Texas from Goldman Sachs, LiftFund Abbott made the announcement at an April 13 media briefing. kvue.com", "2020-04-13T16:14:47.000Z": "Watch today's press conference livestream at 11:30 AM CT at the link below. #COVID19  http:// kxan.com/live-stream/", "2020-04-12T14:05:00.000Z": "Easter may feel different this year due to #COVID19 , but one thing remains the same:\n\nThe hope that Easter Sunday brings. #HappyEaster and stay safe, Texas.", "2020-04-12T02:14:27.000Z": "Tonight we lit the Texas Governor's Mansion blue to honor our heroic frontline health care workers.\n\nThank you for what you're doing as we continue to respond to #COVID19 .\n\nGod bless you and God bless Texas.", "2020-04-11T00:32:38.000Z": "Alright alright alright. @McConaughey thank you for donating face masks to Austin's brave first responders. #TexansHelpingTexans Matthew and Camila McConaughey donate masks to Austin first responders AUSTIN, Texas (KEYE) - Academy Award-winning actor Matthew McConaughey and his wife Camila donated masks to Austin first responders. Camila posted video of the drop off on her Instagram account,... cbsaustin.com", "2020-04-10T22:26:58.000Z": "Today I announced a new Child Care portal for essential workers.\n \nEssential workers like doctors, nurses, and grocery store employees who do not have other options during the COVID-19 pandemic will be able to go to the online portal to find child care. Texas Gov. Greg Abbott announces Frontline Child Care portal Essential workers who do not have other options during the COVID-19 pandemic will be able to go to the online portal to find child care and other options. fox26houston.com", "2020-04-10T22:19:11.000Z": "From suffering comes perseverance, from perseverance comes character, from character comes hope. \n\nAs we approach Easter weekend, I am filled with hope. \n\nWith #TexansHelpingTexans , we CAN conquer this #COVID19 outbreak together.", "2020-04-10T19:02:50.000Z": "Press Conference on Texas' Response to COVID-19 Greg Abbott @GregAbbott_TX Press Conference on Texas' Response to COVID-19 pscp.tv", "2020-04-10T18:31:13.000Z": "You can watch our press conference live at 2 PM CT today here on my Twitter.\n\nWe're providing an update on Texas' response to #COVID19 . @TDEM  @TexasDSHS  @TexasHHSC", "2020-04-10T13:00:00.000Z": "It is finished. #GoodFriday", "2020-04-10T05:35:14.000Z": "Because you have more important things to do right now. #coronavirus Quote Tweet KCENNews @6NewsCTX No need to worry about that expired vehicle registration sticker right now. Gov. Abbott temporarily waived certain registration rules to protect Texans from the coronavirus. https:// kcentv.com/article/news/h ealth/coronavirus/texas-waives-vehicle-registration-titling-and-parking-placard-regulations/285-6ad7d630-5e4e-45da-9974-6474207bab55 ", "2020-04-10T01:07:00.000Z": "H-E-B is supplying 75,000 meals to health care workers in Texas. \n\nGreat work, @HEB . Thank you for helping our brave front line workers as the Lone Star State responds to #COVID19 . #TexansHelpingTexans H-E-B says it will deliver 75,000 meals to health care workers at hospitals in Texas H-E-B plans to deliver 75,000 chef-inspired meals to hospitals across Texas for health care workers battling the frontlines of COVID-19. ksat.com", "2020-04-09T16:00:19.000Z": "On National Former Prisoner of War Recognition Day, we honor all of service members imprisoned by foreign powers while serving our country.\n\nThank you to the brave men and women who answered the call to protect our freedom.", "2020-04-08T23:46:26.000Z": "A boat company from Abilene switched gears to produce thousands of face masks for local medical professionals in response to #COVID19 . #TexansHelpingTexans Tigé Boats making face shields, personal protective equipment for COVID-19 responders Tigé Boats will make face shields, masks and gowns for coronavirus first responders at its Abilene manufacturing facility. amp.reporternews.com", "2020-04-08T23:01:19.000Z": "Wishing a happy and healthy #Passover to those celebrating today.", "2020-04-08T19:04:56.000Z": "Thank you to Prestige Ameritech and the Texas Military Department for increasing the production of critical face masks for our brave medical professionals. \n\nTexans are responding with resiliency to #COVID19 . #TexansHelpingTexans", "2020-04-08T17:05:12.000Z": "Press Conference on COVID-19 Greg Abbott @GregAbbott_TX Press Conference on COVID-19 pscp.tv", "2020-04-08T16:15:05.000Z": "We're giving an update on the statewide response to #COVID19 today at 12 PM CT.\n\nYou can watch the press conference live stream right here on my Twitter. @TDEM  @TexasDSHS  @TexasHHSC", "2020-04-08T03:32:35.000Z": "This is a solid move  -->  University of Texas at San Antonio announces prorated refunds to students due to #COVID19 . #coronavirus  #txlege University of Texas at San Antonio announces prorated refunds due to COVID-19 pandemic SAN ANTONIO - Officials with University of Texas at San Antonio (UTSA) are reportedly reimbursing students due to the COVID-19 pandemic interrupting classes and services for the Spring 2020 semester.... foxsanantonio.com", "2020-04-08T03:09:35.000Z": "Some Walgreens in Texas will provide drive-thru #coronavirus testing.\n\nThe sites will use the Abbott Labs 15 minute tests.  \n\nEach site could administer as many as 3,000 tests per day. #COVID19  #txlege Where to find Walgreens drive-thru coronavirus testing sites in Louisiana, Florida, Texas and more In an announcement Tuesday, Walgreens disclosed plans to administer COVID-19 tests at 15 new drive-thru locations across seven states. newsweek.com", "2020-04-08T00:35:04.000Z": "Tomorrow, Texans must battle more than just the #coronavirus . \n\nSevere & dangerous weather will hit large swaths of our state.\n\nState resources have been activated to help communities respond to the storm.\n\nStay tuned to the weather & heed local warnings. Gov. Greg Abbott preparing State resources as possible severe weather approaches Central Texas \"Texas is taking necessary precautions to keep our communities safe in the event of severe weather,\" Gov. Abbott said. kvue.com", "2020-04-07T19:08:03.000Z": "Thank you to J.J. and Kealia for helping your community right here in Texas. @JJWatt and @KealiaOhai - you are rockstars on and off the field. #TexansHelpingTexans Texans' J.J. Watt, soccer star Kealia Ohai Watt donate $350,000 to Houston Food Bank Texans star defensive end J.J. Watt and his wife, Chicago Red Stars forward Kealia Ohai Watt, have donated $350,000 to the Houston Food Bank. houstonchronicle.com", "2020-04-06T22:58:08.000Z": "COVID-19 PPE is here!\n\nOver the past week Texas distributed\n1,676,510 face masks\n209,856 face shields\n2,721,350 gloves\n169,231 gowns\n7,594 coveralls \n\nEVEN BETTER\nIn the past 24 hours Texas received 2.5 million face masks with 3 million more on the way. Texas Gov. Greg Abbott 'more confident than ever' about supply of protective gear for the state AUSTIN - Gov. Greg Abbott said Monday that he was bullish about the state's ability to acquire and distribute much-needed personal protective equipment,... dallasnews.com", "2020-04-06T19:06:59.000Z": "Press Conference on #COVID19 Greg Abbott @GregAbbott_TX Press Conference on #COVID19 pscp.tv", "2020-04-06T18:25:01.000Z": "You can watch our press conference LIVE today at 2 PM CT right here on my Twitter. \n\nPosting a broadcast shortly. Stay tuned. #COVID19", "2020-04-06T15:57:55.000Z": "Many small businesses need financial assistance to help them continue business operations.\n\nThis story has 2 important links that provide help.\n\nOne is for the Economic Injury Disaster Recovery Program.\nThe other is the Paycheck Protection Program. SAQ: What resources are available for small businesses? Adriana Cruz, Executive Director of Economic Development and Tourism, details some of the resources Governor Greg Abbott's office has for small businesses. ksat.com", "2020-04-06T15:42:04.000Z": "Today we announced free childcare for frontline workers during #COVID19 pandemic.\n\nThanks to our nurses, doctors, first responders & all healthcare providers for their tireless work to respond to the #coronavirus . #txlege Gov. Abbott announces initiative that provides free childcare membership for frontline workers... Texas Gov. Greg Abbott on Monday announced a new initiative aimed at helping parents working at the frontlines of the coronavirus pandemic. ksat.com", "2020-04-06T06:52:10.000Z": "", "2020-04-06T00:55:06.000Z": "I have waived some regulations to expand health care workforce during the #COVID19 response.\n\nThis allows Physician Assistants, Medical Physicists, Perfusionists, & Respiratory Care candidates for licensure to more quickly enter the workforce. Gov. Abbott waives certain regulations to expand health care workforce during COVID-19 response Under this waiver, Physician Assistants (PA), Medical Physicists, Perfusionists, and Respiratory Care candidates for licensure who have completed all other requirements may enter the workforce under... kxxv.com", "2020-04-06T00:30:18.000Z": "This is such fake news by the Dallas Morning News.\n\nThe audio tape of this episode has been available to the press.\n\nFederal officials told us those resources would be needed elsewhere if Dallas County didn't want them. @DMN should be ashamed. https:// twitter.com/tailsxphile/st atus/1246952296958877699  This Tweet is unavailable.", "2020-04-06T00:22:07.000Z": "Someone posted this blast from the past - showing my commitment to liberty and foundational constitutional principles since I was in high school. \n\nOur Constitution is our guide post-yesterday, today & tomorrow.", "2020-04-05T23:56:02.000Z": "I'm the one who set up the Convention Center for #coronavirus care.\n\nFederal officials said Jenkins said he didn't want to use it.\n\nFor obvious reasons he's quickly walking it back. Dallas County judge tries to convince Abbott to use Kay Bailey Hutchison Convention Center for... Dallas County Judge Clay Jenkins is urging the governor in a letter Sunday to use the Kay Bailey Hutchison Convention Center for hospital and health care use. click2houston.com", "2020-04-05T23:50:26.000Z": "FYI, a test like this would NEVER be \"required by the government\" before you can go back to work.\n\nIt's for anyone who wants to voluntarily take it for their own personal confidence about their ability to interact with others.\n\nIt's particularly helpful for healthcare workers. Quote Tweet Greg Abbott @GregAbbott_TX One thing to look forward to later this month is testing for people who may have immunity to #COVID19 .\n\nMany Texans have that immunity. \n\nThey will be among the first Texans able to return to work and get our economy going again. #coronavirus  https:// fxn.ws/2JGDqcW  #FoxNews", "2020-04-05T21:49:18.000Z": "#NEW What led to the letter from @GovAbbott 's office to @JudgeClayJ was call from a DOD Major General to @chiefkidd expressing confusion after he said the Judge & his team told them the county had no intention of using KBH Convention Ctr as a pop-up medical facility. @CBSDFW", "2020-04-05T21:38:17.000Z": "Thanks to the Chairman of the North Texas Food Bank for all you do to help Texans respond to the #coronavirus . \n\nWe are proud to help and are grateful for the role played by the ... @TexasGuard . #txlege  #COVID19", "2020-04-05T19:06:51.000Z": "Last week Texas DPS pulled over travelers from Louisiana to impose a 14 day self-quarantine requirement.\n\nNow, CHECKPOINTS at La.-TX border will be used to further reduce travelers from Louisiana potentially bringing #COVID19 into Texas. #txlege  @TxDPS Checkpoints at Louisiana-Texas border now open The order does not apply to people traveling for military service, emergency response or healthcare workers coming to assist in the state. NEW ORLEANS (WWL-TV) - Checkpoints to screen vehicles have klfy.com", "2020-04-05T18:06:11.000Z": "To ALL of our grocery store workers who work tirelessly to ensure Texans have the supplies they need: \n\nThank YOU! \n\nEveryone across our state appreciates your hard work to help Texans respond to the #coronavirus . \n\nGod bless you and God bless Texas. #txlege  #COVID19", "2020-04-05T12:04:08.000Z": "We're increasing PPE - Personal Protection Equipment.\n\nIn past 6 days the Supply Chain Strike Force provided:\n*more than 1.4 million face masks \n*more than 190,000 face shields *more than two million gloves\n*more than 160,000 gowns.\n\nMore coming soon. Gov. Abbott: Texas prepared, improving hospital capacity and PPE as demand increases In his latest order, he expanded social distancing guidelines through April 30, closed Texas public schools until at least May 4, and defined \"essential\" businesses. kxan.com", "2020-04-05T07:31:29.000Z": "Here's what the @TexasGuard is doing with the @USACEHQ to provide additional healthcare facilities to respond to the #coronavirus . \n\nOne facility is already open in Dallas. \n\nOther locations around the state are being reviewed now. #COVID19 Quote Tweet U.S. Army @USArmy . @USACEHQ commander, @ESSAYONS54 talks how the complicated problem of taking care of #COVID19 patients, we need to create very simple solutions.\n\nWatch to learn more. #KIllTheVirus  @USArmyNorth", "2020-04-05T02:40:03.000Z": "The Texas National Guard mobilizes to respond to #COVID19 . \n\nThey locate & equip non-medical sites that can treat patients if hospital capacity is exhausted. \n\nWe will ensure Texas is prepared for any possible scenario.\n\n... @TexasGuard  #coronavirus Texas Guard mobilizes to respond to COVID-19 Texas Guard mobilizes to respond to COVID-19 dvidshub.net", "2020-04-04T23:39:08.000Z": "One thing to look forward to later this month is testing for people who may have immunity to #COVID19 .\n\nMany Texans have that immunity. \n\nThey will be among the first Texans able to return to work and get our economy going again. #coronavirus  https:// fxn.ws/2JGDqcW  #FoxNews Texas Gov. Abbott highlights need for more testing on people who show signs of immunity to COVID-19 Texas Governor Greg Abbott praised his residents for their cooperation in fighting COVID-19, and argued that the U.S. needed to perform more testing to determine who has immunity to the virus. foxnews.com", "2020-04-04T19:54:07.000Z": "A ray of sunshine. \n\nFootball may return on schedule. Quote Tweet Pat Ward @WardDPatrick ESPN: In a conference call with major league sports commissioners on Saturday, President Donald Trump said he believes the NFL season should start on time in September, sources familiar with the call told ESPN. https:// espn.com/nfl/story/_/id /28995399 ", "2020-04-04T04:14:43.000Z": "Texas has almost 20,000 hospital beds available to treat patients for #coronavirus .\n\n2,107 intensive-care beds are available & we have 8,741 ventilators.\n\nTexas should avoid the limited health care resources seen in some other states. #txlege  #COVID19 Abbott says Texas' 20,000 hospital beds for coronavirus should help state avoid New York's situation AUSTIN - The number of Texas hospital beds available for coronavirus patients has more than doubled in 15 days, Gov. Greg Abbott said Friday. Though the... dallasnews.com", "2020-04-04T00:54:33.000Z": "Texas school districts and schools will not get accountability ratings in 2020 because of the #coronavirus pandemic. #COVID19  #txlege Texas districts, schools will not get accountability ratings in 2020 The announcement, a mere formality after Gov. Greg Abbott canceled this year's state standardized tests, likely will have no impact on state efforts to replace Houston ISD's school board. houstonchronicle.com", "2020-04-03T22:46:41.000Z": "Texas hospitals are getting tens of thousands of rapid COVID-19 tests to quickly determine if a person has the #coronavirus . \n\nOur testing capacity is increasing 10% each day. \n\nStill, less than 10% of Texans tested are testing positive for #COVID19 . Texas hospitals to receive tens of thousands of rapid COVID-19 tests, Gov. Abbott says \"Our capacity should prevent us from facing the type of situation that New York is having to deal with today,\" Gov. Greg Abbott said. star-telegram.com", "2020-04-03T14:59:31.000Z": "We are providing Comfort Food Care Packages to support Texas youth and families as we combat the #coronavirus . #COVID19  #txlege Gov. Abbott introduces Comfort Food Care Packages to support Texas youth and families Participating restaurants are offering the option to buy care packages that will be delivered. The food in the package can feed a family of 5-6. kxan.com", "2020-04-03T07:22:28.000Z": "So many Texas businesses are stepping up to help respond to the #coronavirus . \n\nReyes Hayashi Automotive which is a supplier to the Toyota plant in San Antonio will produce up to 5,000 face shields a day for health care workers in Texas. #COVID19 San Antonio-based Toyota supplier making face shields for health care workers SAN ANTONIO (KABB) - Another San Antonio-based company will make the switch from making parts for Toyota trucks to making face shields for health care workers. Reyes Hayashi Automotive LLC, which is... foxsanantonio.com", "2020-04-03T03:12:41.000Z": "We want everyone to get full unemployment benefits.\n\nWe changed the unemployment policy to ensure you receive benefits effective when you lost your job rather than when you file your claim.\n\nThe Workforce Comm. is adding staff to process claims quicker. In change to unemployment policy, Texas to pay claims retroactively The Texas Workforce Commission said it will now backdate unemployment claims to the date that workers were laid off, revising its normal procedure. houstonchronicle.com", "2020-04-02T21:36:28.000Z": "A BIG thanks to ... @Apple  for supplying a massive amount of face masks to help us combat the #coronavirus . \n\nThese are being distributed across Texas immediately. \n\n... #COVID19  #TXLEGE", "2020-04-02T20:51:40.000Z": "HealthCare Express begins #COVID19 testing in Longview.\n\nAdditional #coronavirus testing sites like this are being added daily across Texas.\n\nAs a result, we are increasing testing in Texas by about 10% per day, compounded daily. #txlege  http:// cbs19.tv/article/news/l ocal/healthcare-express-begins-covid-19-testing-at-longview-clinic/501-28136acd-c090-471f-b29f-e9db7b15eb3b  via @kytxcbs19 HealthCare Express begins COVID-19 testing at Longview clinic The one-to-two-day period to receive test results is significantly faster than the wait times reported across the state. cbs19.tv", "2020-04-02T06:15:14.000Z": "Got coronavirus antibodies? Tests that show immunity can help beat #Covid19 .\n\nLabs around the world are rolling out an­ti­body tests that can show if a person was re­cently in­fected with the #coronavirus and has de­vel­oped immunity.\n\nGame changer. Opinion | Got Coronavirus Antibodies? Tests that show immunity are crucial to beating Covid-19. wsj.com", "2020-04-01T21:37:28.000Z": "Yesterday I issued an executive order that goes into effect at midnight tonight that requires all Texans to stay home unless you're performing an essential service or activity. \n\nWe must continue to respond to the challenge #COVID19 with strength and resolve.", "2020-04-01T17:54:05.000Z": "Texas Mental Health Support Line Up And Running To Help With Coronavirus Anxiety. #COVID19  #coronavirus Texas Mental Health Support Line Up And Running To Help With Coronavirus Anxiety Texas Health and Human Services announced it launched a statewide mental health support line to help those experiencing anxiety, stress or emotional challenges during the pandemic. dfw.cbslocal.com", "2020-04-01T14:36:23.000Z": "Waco ISD middle school principal-a former Marine-has died from #COVID19 .\n\nThis disease is deadly.\n\nTo prevent its spread stay at home & out of contact with others unless you provide or need services essential for our battle against #coronavirus . Waco ISD middle school principal dies from COVID-19 Waco ISD has confirmed G.W. Carver Middle School principal Phillip Perry has died from COVID-19. kxxv.com", "2020-04-01T00:27:19.000Z": "FACT: \"Gov. Greg Abbott on Tuesday told Texans to stay at home for the next month unless they are taking part in essential services and activities, announcing a heightened statewide standard to stem the spread of the new coronavirus.\" #txlege Gov. Greg Abbott tells Texans to stay home except for essential act... He also said that schools would remain closed until at least May 4 as the state increases its efforts to stop the spread of the new coronavirus. texastribune.org", "2020-03-31T03:09:51.000Z": "We are expanding healthcare capabilities across the state to ensure all healthcare needs will be met in the event of a surge of #COVID19 patients. \n\nDallas convention center will get Texas' first pop-up hospital for #coronavirus . #txlege Dallas convention center will get Texas' first pop-up hospital for coronavirus AUSTIN - The Kay Bailey Hutchison Convention Center in downtown Dallas will be the site of Texas' first pop-up hospital to treat coronavirus patients, Gov.... dallasnews.com", "2020-03-30T23:30:02.000Z": "Today is National Doctors Day. \n\nThis year we especially thank them for serving on the front line in our war against the #coronavirus . \n\nWith their care and expertise we will defeat #COVID19 and return to normal ASAP.", "2020-03-30T22:12:24.000Z": "Texas Dept. of Public Safety is on the Louisiana-Texas border today enforcing my Executive Order requiring self-quarantine for anyone who travels to Texas from Louisiana. \n\nWe want to prevent the #coronavirus from being imported into Texas. #COVID19  #txlege", "2020-03-30T03:55:19.000Z": "Hero!\n\nAustin CEO delivers thousands of masks from to Texas doctors in need of protective equipment. Austin CEO delivers thousands of masks from Mexico to Texas doctors in need of protective equipment Tom Banning's friend told him he had a shipment of 525,000 masks coming to Texas. Banning personally delivered 7,500 of them to doctors in Houston and Austin. kvue.com", "2020-03-30T02:13:36.000Z": "Today I issued an Executive Order preventing the@release of dangerous criminals from prisons & jails. \n\nWe want to prevent the spread of #COVID19 among prison staff & inmates. \n\nBut, releasing dangerous criminals in the streets is not the solution. #txlege  #coronavirus", "2020-03-28T22:46:50.000Z": "We're calling on all nurses to help respond to #COVID19 .\n\nTo increase the available nurses I removed licensing barriers for advanced practice registered nurses.\n\nWe thank all nurses & health care professionals on the front line of battling #coronavirus . Gov. Abbott removes licensing barriers for advance practice registered nurses AUSTIN, Texas - Governor Greg Abbott has waived certain regulations allowing for an expedited licensing reactivation process for Advanced Practice Registered Nurses (APRN) in Texas, according to a... cbsaustin.com", "2020-03-28T01:19:08.000Z": "American innovation knows no limits. \n\nU.S. Approves Abbott Labs Five-Minute 'Rapid' Coronavirus Test. \n\nThe ID NOW COVID-19 tests will be available next week with the ability to deliver 50,000 tests per day. #coronavirus  #COVID19 U.S. Approves Abbott Labs Five-Minute 'Rapid' Coronavirus Test Abbott Laboratories won U.S. Food and Drug Administration approval for its molecular test for the Coronavirus strain COVID-19, which the company says can deliver \"positive results in as little as... forbes.com", "2020-03-27T23:16:18.000Z": "Time to place a food order. Quote Tweet El Arroyo @ElArroyo_ATX Can't wait to see y'all on our Instagram livestream tonight at 5PM (CST) with @GovAbbott  @robertearlkeen & more! TEXT ELARROYO TO 31996 TO DONATE TO TX RESTAURANT RELIEF", "2020-03-27T03:51:21.000Z": "The boundless generosity of Texans during times of challenge is a hallmark of our great state. \n\nRound Rock ISD, other districts donate masks, gloves to fight #coronavirus . #COVID19  #txlege Round Rock ISD, other districts donate masks, gloves to fight coronavirus The Round Rock school district on Thursday donated more than 6,500 masks and 6,000 pairs of gloves to Williamson County in an effort to stop the spread of COVID-19.The supplies, along with hundreds... statesman.com", "2020-03-27T02:07:44.000Z": "A HUGE thank you to all the truckers who are hauling the supplies that Texans need across the state, especially at this time. \n\nTogether we're going to beat the #coronavirus .\n\nIn the meantime, truckers will keep Texas well-stocked.\n\nGod bless you all & God bless Texas. #COVID19", "2020-03-26T11:55:29.000Z": "Retired nurses and out-of-state physicians line up to help during #coronavirus outbreak. \n\nThis is exactly what we need. \n\nIf you are in the healthcare field and want to help Texas respond, go to http:// texas.gov/COVID19 . #txlege  #COVID19 Retired nurses and out-of-state physicians line up to help during coronavirus outbreak Over the weekend, Gov. Greg Abbott made it easier for nurses to reinstate their licenses. kvue.com", "2020-03-25T18:14:14.000Z": "Proud to see @GregAbbott_TX tap @DellTech 's SVP of Worldwide Procurement Keith Miears to serve as Supply Chain Director for the state of Texas to help ensure health care facilities have the supplies they need. Governor Abbott Issues Executive Order Increasing Hospital Capacity, Announces Supply Chain Strike... gov.texas.gov", "2020-03-25T22:19:12.000Z": "Texas is asking the federal government to allow families that rely on SNAP benefits for food to use them at drive-thru restaurants. \n\nThis helps those families and the businesses in Texas that provide food. #coronavirus  #COVID19  #txlege Texas asks USDA to let SNAP benefits be used at to-go restaurants due to coronavirus In February, there were over 3.2 million Texans who were eligible for SNAP benefits, and more than 205,300 individuals eligible in Tarrant County alone. star-telegram.com", "2020-03-25T20:38:09.000Z": "We are grateful that so many Texans are offering help to respond to the #coronavirus .\n\nAnyone who would like to be considered as a vendor, donor, or volunteer please submit your information into the form at https:// texas.gov/covid19 .\n\nThanks for helping Texans. #COVID19  #txlege", "2020-03-25T18:34:46.000Z": "GREAT NEWS. \n\nPresident Trump just granted a Major Disaster Declaration for Texas. \n\nThis will expand the resources available to Texas & speed our ability to robustly respond to #coronavirus . #COVID19  #txlege", "2020-03-25T17:50:06.000Z": "Today we honor our nation's bravest on #MedalofHonorDay . \n\nPlease join us for a quiet Moment of Honor at 2:25 PM CST and fly your American flag in honor of these heroes. Quote Tweet Department of Defense @DeptofDefense Today is National #MedalofHonorDay , a time to remember the 3,500+ heroes who received the nation's highest award for valor. In these extraordinary times, it is important to remember those who came before us and sacrificed much for our nation. Show this thread", "2020-03-25T16:47:16.000Z": "Many Texans have questions about unemployment benefits. \n\nThe Texas Workforce Commission will answer your unemployment questions on Facebook Live at 2:30 p.m. #txlege  #COVID19  #coronavirus Watch: Texas Workforce Commission answer your unemployment questions on Facebook The Texas Workforce Commission will answer your unemployment questions on Facebook Live Wednesday at 2:30 p.m. ksat.com", "2020-03-25T03:22:30.000Z": "Restaurants have food supply chains that don't go through grocery stores.\n\nHelp keep our restaurants open & their employees working by using them as a source for your food needs.\n\nThis waiver makes it easier for you as we all work to respond to the #coronavirus . #COVID19 Quote Tweet Jason Howerton @jason_howerton Thank you, Gov. @GregAbbott_TX .", "2020-03-25T03:02:57.000Z": "Dr. Birx: people traveling from NY \"should be self-quarantining for 14 days to ensure the virus doesn't spread.\"\n\nDr. Fauci: \"We don't want [traveling from NY] to be another seeding point for the rest of the country.\"\n\nI'll address this week. #COVID19 The White House Said People Who Left New York City Recently Need To Quarantine For 14 Days \"What we're seeing now is that, understandably, people want to get out of New York. We don't want that to be another seeding point for the rest of the country.\" buzzfeednews.com", "2020-03-22T01:09:46.000Z": "Is your Texas driver license about to expire? \n\nYou don't need to renew it, for now... #coronavirus  #COVID19  #txlege Is your Texas driver license about to expire? You don't need to renew it, for now... Governor Greg Abbott has waived expiration dates for driver licenses, as part of state efforts to keep people from having to visit public places. This means if your license was about to expire, you... foxsanantonio.com", "2020-03-21T19:46:39.000Z": "Today I cut through regulatory red tap to increase the number of nurses who can help Texas respond to the #coronavirus .\n\nThere will be more announcements like this soon that add to our healthcare capacity to deal with #COVID19 . #txlege  http:// kvue.com/article/news/h ealth/coronavirus/coronavirus-regulations-lowered-for-texas-nurses/269-4248888a-dc85-44c9-9766-178001bcfa6d  via @KVUE Gov. Abbott lowers regulations to expand nursing workforce during coronavirus pandemic The Texas governor said the state will see a rising need for medical professionals to help respond to these challenging times. kvue.com", "2020-03-21T07:10:21.000Z": "RIP Kenny Rogers-a recipient of the Texas Medal of Arts. \n\nThe Houston born singer is a music legend & will be sorely missed. Quote Tweet Kenny Rogers @_KennyRogers The Rogers family is sad to announce that Kenny Rogers passed away last night at 10:25PM at the age of 81.  Rogers passed away peacefully at home from natural causes under the care of hospice and surrounded by his family. https:// ymlp.com/zbjSX9", "2020-03-21T02:51:09.000Z": "Texas Supreme Court halts eviction proceedings through late April due to #coronavirus Texas Supreme Court halts eviction proceedings through late April due to coronavirus The order notes that while filings can still be submitted, no trial, hearing, or other eviction proceeding may be conducted until after April 19. star-telegram.com", "2020-03-21T02:03:25.000Z": "The Minister of Culture is preaching. @McConaughey Matthew McConaughey joins Gov. Abbott in urging Texans: Stay home Public service announcement encourages Texans to \"Stay home, if you can.\" expressnews.com", "2020-03-20T19:04:29.000Z": "I want to thank Tytus for this letter. \n\nThank you for your commitment to school and to staying healthy.", "2020-03-20T16:37:40.000Z": "This is how Texans respond to challenges. @HomeDepot is donating 15,000 medical masks to Dallas Police Department. \n\nExpect more announcements like this as we all work together to respond to the #coronavirus . #COVID19  #txlege Quote Tweet Allison Harris @AllisonFox4News Wow - @HomeDepot donating 15,000 medical masks to Dallas Police Department Show this thread", "2020-03-20T03:14:03.000Z": "Austin-based medical diagnostics company Everlywell will begin offering a home testing kit for COVID-19 early next week.\n\nThe company said 30,000 of the tests will be available starting Monday. #txlege  #coronavirus  #COVID19 Austin's Everlywell set to offer coronavirus home test kits Austin-based medical diagnostics company Everlywell says it will begin offering a home testing kit for COVID-19 early next week to help close the shortage of testing methods during the coronavirus... statesman.com", "2020-03-20T02:37:59.000Z": "Texans have always been resilient when responding to disasters. Our response to #COVID19 is no different.\n\nWe need everyone's collaboration to help contain the spread & protect public health.\n\nTogether we will defeat #COVID19 & soon cont. biz as usual keeping TX the best state.", "2020-03-19T16:38:14.000Z": "Excellent news.", "2020-03-19T03:20:10.000Z": "Today we announced the MealFinder Map.\n\nIt helps parents find where Texas schools serve meals during school closures.\n\nIt launches Friday & will be updated constantly to include the address of each facility & the days & times when meals are served. State launches virtual map to find where Texas schools are serving meals amid closures The map will officially launch Friday and be available on the Texas Education Agency's website. star-telegram.com", "2020-03-19T01:55:38.000Z": "Restaurants in Texas can now deliver alcoholic beverages with food purchases to customers.\n\nIn response to #coronavirus I waived some regulations that hindered that.\n\nThese next few weeks it's important to support our restaurants. They're a great source of food for Texans.", "2020-03-18T05:11:46.000Z": "Baylor Scott & White Opens Drive-Thru #Coronavirus Testing Sites. \n\nYou will see announcements like this across Texas. #COVID19  #txlege How to Get Tested for Coronavirus in the Austin Area There are even more testing locations across the region. spectrumlocalnews.com", "2020-03-18T00:00:45.000Z": "I have waived the 10 day investigation period for individuals applying for unemployment benefits.\n\nWe want you to get your benefits ASAP. http:// twc.texas.gov/news/unemploym  #txlege  #coronavirus  #COVID19  https:// twc.texas.gov/news/unemploym ent-news ", "2020-03-17T22:09:02.000Z": "Today I activated the Texas National Guard to help respond to #COVID19 .\n\nThis precautionary measure ensures the @TexasGuard is prepared to serve at a moments notice.\n\nWe are grateful for the men & women who serve. #coronavirus  #txlege Gov. Abbott activates Texas National Guard in response to COVID-19 pandemic On Tuesday, Gov. Greg Abbott activated the Texas National Guard to be prepared to assist with response efforts for COVID-19. Abbott calls this a preparative measure to ensure that the Texas National... cbsaustin.com", "2020-03-17T00:14:54.000Z": "Drive through testing like this for #coronavirus is coming to a location near you soon.\n\nWe're rapidly expanding testing for #COVID19 in Texas.\n\nSan Antonio & Bexar Co. opened Texas' first facility like this. Dozens will fill the state this week.\n\nCheck out at how it works...", "2020-03-16T23:10:57.000Z": "The #coronavirus may have harmed your business. \n\nIf so you may qualify for a Small Business Administration loan. \n\nCheck out the information below to see if you might qualify and submit the info. \n\n... @SBAgov  #COVID19  #txlege  https:// tdem.texas.gov/covid-19/", "2020-03-16T20:52:18.000Z": "We have ended the wait lines to get your drivers license renewed--at least for now.\n\nTexas DPS temporarily extends expired driver's licenses, ID cards during declaration of disaster. #coronavirus  #COVID19  #txlege Texas DPS temporarily extends expired driver's licenses, ID cards during declaration of disaster Texans will be able to use expiring state driver's licenses and ID cards while the state is under the declaration of disaster for COVID-19, according to officials. kxxv.com", "2020-03-16T14:16:14.000Z": "I have eliminated the STAAR testing requirements for this school year. \n\nWe must empower schools to focus on the health of their students, teachers and families. Gov. Abbott waives STAAR testing requirements Texas Gov. Greg Abbott announced that he has waived the State of Texas Assessments of Academic Readiness (STAAR) testing requirements for the 2019-2020 school year. kxan.com", "2020-03-16T03:03:14.000Z": "Corpus Christi & Nueces County officials unveil plan & site for local COVID-19 testing.\n\nLike many Texas areas, they haven't yet had a case of COVID-19.\n\nBut, they know it's coming & are getting prepared for testing. #txlege \"This . . . is not going to be . . . (like a) drive-through at the Whataburger\" City of Corpus Christi and Nueces County officials have unveiled their process for testing potential COVID-19 patients in Corpus Christi. kristv.com", "2020-03-15T23:02:38.000Z": "To get more supplies in our grocery stores more quickly I will remove any regulatory barrier that stands in the way. \n\nTexas is now allowing trucks that deliver alcohol to also deliver grocery supplies. #COVID19  #coronavirus  #txlege Gov. Abbott waives laws to allow trucks from alcohol industry to deliver grocery supplies Governor Greg Abbott has waived state laws that prohibit trucks from the alcohol industry from delivering supplies to grocery stores. kxxv.com", "2020-03-15T20:33:14.000Z": "Seniors are most at risk for #coronavirus .\n\nTo keep them protected from exposure to the virus Texas Health and Human Services is banning non-essential guests at nursing homes.\n\nThis is temporary & hopefully won't be needed long. #txlege  http:// kvue.com/article/news/h ealth/coronavirus/coronavirus-texas-nursing-homes-guidance/269-db984b96-ffb9-401d-901f-c6e49c8aa080  via @KVUE Coronavirus: Texas Health and Human Services bans non-essential guests at nursing homes Texas HHS said facility access should be restricted to staff, certain medical professionals and other essential service providers. kvue.com", "2020-03-15T18:16:13.000Z": "Drive-through testing for #coronavirus is now open in Austin. More is coming. \n\nThis adds to testing centers in San Antonio and the centers opening in Houston & Dallas later this week.\n\nDrive through testing will continue to increase. #COVID19  #txlege Coronavirus in Texas 3/14: Austin gets a drive-through testing cent... Our staff is closely tracking developments on the new coronavirus in Texas. Check here for live updates. texastribune.org", "2020-03-15T16:45:10.000Z": "This is unacceptable & I'm working to get it fixed.\n\nI have spoken to the official in charge of this--the head of Homeland Security.\n\nThey are working 24-7 to add personnel and make other changes to fix this ASAP. #DFW  #COVID19  #txlege International Travelers Wait in Hours-Long Line Upon Arrival at DFW Airport Long wait times greeted international travelers at DFW International Airport on Saturday night. Viewers reached out to NBC 5 to report they waited 3 to 5 hours in line at U.S. Customs inside Terminal... nbcdfw.com", "2020-03-15T04:35:50.000Z": "Today I fast-tracked temporary licensing of out-of-state doctors, assistants & nurses, to assist in Texas' response to COVID-19. \n\nWe will ensure Texas has all medical personnel needed to fight #coronavirus . #COVID19  #txlele  http:// tinyurl.com/ww7x788  @woodlandsonline Governor Abbott Fast-Tracks Licensing For Out-Of-State Medical Professionals woodlandsonline.com", "2020-03-14T22:55:47.000Z": "I have waived some trucking regulations to help stores restock after supply shortages due to #coronavirus concerns.\n\nRetailers have strong supply sources & there's no need to hoard.\n\nRetailers are ready to restock. #COVID -19 #txlege  http:// 12newsnow.com/article/news/h ealth/coronavirus/trucking-regulations-waived-in-texas/502-502cf115-b008-4493-bc9b-553214a84596  via @12NewsNow Trucking regulations waived in Texas to help stores restock after supply shortages due to coronav... Gov. Abbott waived regulations Saturday", "2020-03-13T20:32:44.000Z": ". @GregAbbott_TX announced in his press conference that #satx is standing up the state's first drive-through testing center.\n\nThis site will be used exclusively for healthcare workers and emergency service personnel on our front lines.\n\n5/13", "2020-03-12T22:53:25.000Z": "Today I held a telephone conference with more than 1,000 local officials to discuss our collaboration in combating #CoronaVirus .\n\nWe talked about proactive strategies to mitigate expansion of the virus & ways to prepare for all potential events. #COVID19 Governor Abbott Holds Call With Texas Legislators, Mayors, And County Judges To Provide Update On... woodlandsonline.com", "2020-03-10T23:52:05.000Z": "Border Patrol apprehends known MS-13 gang member near Alpine, Texas. \n\nGreat work!!! Border Patrol apprehends known MS-13 gang member near Alpine, Texas U. S. Border Patrol agents arrested a man near Alpine, Texas, they say is a known member of the Mara-Salvatrucha, or MS-13, gang. U. S. Customs and Border Protection said Border Patrol agents... kfoxtv.com", "2020-03-10T18:09:18.000Z": "Happy birthday to living legend, Chuck Norris. \n\nHe's turning whatever age he wants to today. @chucknorris GIF", "2020-03-10T02:10:16.000Z": "ANOTHER #1 ranking!\n\nTexas tops the U.S. in commercial building impact and jobs. Texas tops the U.S. in commercial building impact and jobs Oil and cattle have long been the touchstones of Texas business. But real estate also generates big bucks for the Lone Star State. Commercial property... dallasnews.com", "2020-03-09T23:24:01.000Z": "Report: Texas is one of the most prepared states for public health disasters in the U.S.\n\nThe report took into account Texas' hospital preparedness, public health funding, water security, paid time off, seasonal flu vaccines & patient safety. #COVID2019 Report: Texas is one of the most prepared states for public health disasters in the U.S. With several coronavirus cases and zero deaths in the state of Texas so far, a report from QuoteWizard says the Lone Star State is one of the most prepared states in the nation for public health... ksat.com", "2020-03-08T20:51:50.000Z": "Texas aggressively prosecutes voter fraud.\n\nIn this case a man was indicted for providing false information on applications for mail ballots.\n\nThe Court of Appeals allowed prosecution of election fraudster to move forward. #txlege  #voterfraud AG Paxton: 7th Court of Appeals allows prosecution of election fraudster to move forward Texas Attorney General Ken Paxton applauded the 7th Court of Appeals in Amarillo for allowing the prosecution of Erika Lozano-Pelayo, who is charged with multiple counts of election fraud resulting... abc7amarillo.com", "2020-03-08T19:56:42.000Z": "A Texas lab is leading the way on #coronavirus treatment.\n\nWe have a world-class bio-containment lab in TX where the best medical minds are looking for solutions for #COVID -19.\n\nThey're working on a coronavirus vaccine & might be close to a treatment. Texas lab leading the way on coronavirus treatment One of the best weapons on the fight against COVID-19 is right here in Texas - a high security biocontainment lab where some of the best minds in medicine are looking for answers. They're not only... cbsaustin.com", "2020-03-07T03:12:43.000Z": "Great to be with Jack Wilson again tonight. He's a true Texas hero. \n\nAnd a big thank you to the Navarro County Republican Party for having an enthusiastic event! #KeepTexasRed  @navgop", "2020-03-07T02:15:45.000Z": "Price-gouging anyone because of the #coronavirus threat is un-Texan and will not be tolerated in our state.\n\nAnyone who does it can face legal action by the state. \n\nThis is a time to help others in need-not gouge them. #COVID19 Abbott, Paxton warn against price-gouging amid coronavirus threat Those who are price-gouging medical supplies as Texas faces the threat of a new coronavirus will face state prosecution, Texas Gov. Greg Abbott and state Attorney General Ken Paxton warned Friday.\"... statesman.com", "2020-03-06T17:42:42.000Z": "#OTD 184 years ago, a 13 day siege ended as the Alamo fell.\n\nTexans stood their ground & sacrificed their lives for freedom. Thus, the independent Republic of Texas was born.\n\nLet us always #RememberTheAlamo . \n\nGod bless Texas.", "2020-03-06T05:19:26.000Z": "A WILD night at the Lincoln Reagan Dinner in Buda, TX. \n\nThe @HaysRepublican Party is fired up & ready to keep Texas RED", "2020-03-05T23:05:02.000Z": "Today I announced that Texas now has the ability to test for #COVID19 at 10 centers across the state. \n\nThis helps us more swiftly respond to the #coronavirus . \n\nWe continue to work with local health officials to corral this disease.", "2020-03-05T01:15:53.000Z": "THIS!!!!\n\nvia ... @TexasHumor  \n\nBut. Seriously here. \nDo it.", "2020-03-05T00:37:21.000Z": "A Texas-size Happy Birthday to Rick Perry. \n\n... @GovernorPerry ", "2020-03-04T21:40:36.000Z": "8 Governor's Cups in a row #1 state for economic development Record low unemployment \n\nTexas is an economic dynasty. @SiteSelection From Gov. Greg Abbott", "2020-03-04T20:06:02.000Z": "Republicans had some great wins from across the state during the Texas Primary. \n\nNow that we have our candidates, I have one simple message going into November:", "2020-03-04T18:23:13.000Z": "Dallas County Opens First Lab of Its Kind  in Texas With Coronavirus Testing Capabilities.\n\nTarrant Co. not far behind.\n\nThis will speed the process of detection and treatment. \n\nTexans are stepping up to respond to this challenge. #txlege Dallas County's lab will provide coronavirus-testing capabilities Dallas County Health and Human Services says it is working with the state and federal governments to provide quick testing for coronavirus, making it the... dallasnews.com", "2020-03-03T02:13:29.000Z": "On this day in 2005 I argued before the U.S. Supreme Court to defend the Ten Commandments display on the Texas Capitol Grounds.\n\nWe WON!!!\n\nThe Ten Commandments remain at the Texas Capitol.\n\nTexas will always cherish the influences that have made our state so great. #SCOTUS", "2020-03-02T22:04:33.000Z": "Today Texas was awarded the Governor's Cup for a record-breaking 8th year in a row.\n\nThis award goes to the #1 state in America for economic development.\n\nThanks to the businesses that thrive in Texas & to the best workforce in America for making this award possible.", "2020-03-02T14:48:47.000Z": "Today we celebrate Texas Independence Day.\n\nOn this date a Republic was born in the midst of seemingly insurmountable challenges.\n\nTrue Texas grit helped our founders prevail and has inspired generations of Texans ever since.\n\nMay God forever bless the great state of Texas.", "2020-03-01T21:40:27.000Z": "Something that Democrats, Republicans & Independents agree on:\n\nAustin's homeless policies are harmful to the homeless & non-homeless alike & ending the camping ban is wrong & reckless.\n\nCitizens will retake control of the city that leaders have failed. Opinion: City's camping rules a failure. We can change that. We are two Austinites who have lived vastly different lives. One a local Republican leader. The other, a lifelong Democratic party activist.But in recent months we have shared a deep commitment to... statesman.com", "2020-03-01T18:05:38.000Z": "Our lives are not defined by how we are challenged. \n\nInstead we determine our future by how we respond to those challenges. \n\nWe live in a State where a young man can have his back broken in half and still rise up and become Governor. \n\nAnything is possible in Texas.", "2020-02-29T18:56:22.000Z": "Great to be in Gilmer, Texas last night to visit with the great folks of East Texas.\n\nI'm proud of all they do to keep Texas the national economic leader.\n\nCheck out the video. #txlege  http:// cbs19.tv/article/news/l ocal/gov-greg-abbott-serves-as-keynote-speaker-at-upshur-county-republican-partys-inaugural-lincoln-day-dinner/501-9e3fef05-89cb-432b-8822-92aefcfccbbf  via @kytxcbs19 Gov. Greg Abbott serves as keynote speaker at Upshur County Republican Party's inaugural Lincoln... Gov. Abbott took time to answer questions on major topics such as the state's handling of the coronavirus, Super Tuesday and the economy. cbs19.tv", "2020-02-29T05:14:23.000Z": "Texas supports our fire fighters who serve on the border.\n\nWe are providing them more and better resources to help them do their challenging job.\n\nThank you #FireFighters . Governor Abbott announces grant awards for border zone fire departments - Crossroads Today AUSTIN - Governor Greg Abbott announced Friday $1 million in grant funding through the Border Zone Fire Department (BZFD) program to support professional fire departments along the Texas-Mexico... crossroadstoday.com", "2020-02-29T01:51:27.000Z": "Nothing like a Texas sunset. \n\nI'm traveling rural East Texas tonight.", "2020-02-28T04:31:54.000Z": "Great job by @UTAustin & the UT Board of Regents for approving $8 million on the UT Austin campus to beef up security, add more police officers and new security technology in the areas students live, congregate and walk. @SafeHorns  #HookEm Regents OK $8 million to boost security around UT Austin The University of Texas System Board of Regents on Thursday approved spending $8 million on the UT Austin campus to beef up security, adding more police officers and new security technology in the... statesman.com", "2020-02-27T23:50:04.000Z": "Today I met with State Health & Emergency Response Officials to discuss how Texas is responding to the #CoronaVirus . #COVID19 Every agency is on alert & fully prepared.\n\nThey have detailed plans to deal with any possible threat.\n\nThey collaborate with federal & local officials.", "2020-02-27T20:58:13.000Z": ". @JaredLPatterson is the conservative fighter we need to keep in the TX House.\n\nHundreds of people came out to support Jared in #HD106 for his GOTV rally.\n\nWe're seeing strong support from across the state to #KeepTexasRed in Nov.\n\nMake sure to get out & vote early this week.", "2020-02-27T06:03:52.000Z": "Great to see our students are being taught right. Quote Tweet Vance Sherrill @vance_sherrill @tedcruz  @GregAbbott_TX Texas Proud!! Crew's first 4th grade school project.", "2020-02-26T22:47:50.000Z": "Tomorrow I will hold a briefing with the top health agencies & emergency responders in Texas plus federal officials.\n\nThat will be followed by a press conference to announce what Texas is doing about the #coronavirus . \n\nFYI we've been working with CDC for weeks. #txlege Quote Tweet nope @StephanieA2527 Replying to @GregAbbott_TX Governor Abbott, what are we doing to prepare for the Coronavirus? I'm praying it won't hit us, but are there any plans being put in place? Thank you for everything you do for us. Your a great Governor.", "2020-02-26T19:47:47.000Z": "Look at the energy in Baytown, TX to #KeepTexasRed . #HD128 is ready to re-elect the #1 ranked conservative in the TX House, @BriscoeCain .\n\nEarly Voting ends this Friday. \n\nMake sure you get out & vote for conservatives like Briscoe so we can continue making TX the best state.", "2020-02-26T04:40:36.000Z": "A big thank you to @TarletonState for hosting this Lincoln Reagan Dinner tonight. \n\nI know we can always count on Erath County to get out & vote to #KeepTexasRed . \n\nLet's continue that so we can keep Texas, Texas.", "2020-02-25T20:50:17.000Z": "How do you make Pancake smile?\n\nButter her up with her favorite toy. \n\nHappy #NationalPancakeDay from @TexasPancake .", "2020-02-25T17:55:35.000Z": "Texas Attorney General Paxton files suit over Houston-area explosion. Paxton files suit over Houston-area explosion Texas Attorney General Ken Paxton has sued a petrochemical company over violations associated with a November explosion at its Port Neches chemical plant.The lawsuit against TPC Group comes as a... statesman.com", "2020-02-25T01:46:59.000Z": "#OTD William B. Travis reminded us that freedom is worth fighting for.\n\nSurrounded at the #Alamo , facing certain defeat, Travis declared that he would never surrender or retreat.\n\nHe wrote, \"Victory or Death\"\nHe died for independence.\n\nMay we never forget the price of freedom.", "2020-02-24T22:26:55.000Z": "When every girl counts, mankind makes great leaps. \n\nRemembering @NASA mathematician Katherine Johnson. #STEM Quote Tweet NASA @NASA We're saddened by the passing of celebrated #HiddenFigures mathematician Katherine Johnson. Today, we celebrate her 101 years of life and honor her legacy of excellence that broke down racial and social barriers: https:// go.nasa.gov/2SUMtN2", "2020-02-24T20:38:57.000Z": "Save Austin Now launches effort to reinstate ban on homeless camping.\n\nSign the Petition to join the effort to improve the homeless situation in Austin.\n\nAustin is your city and you have the power to determine how it's run. http:// kvue.com/article/news/l ocal/homeless/austins-homeless-save-austin-now-ban-camping-on-streets/269-4f7e17ed-e259-49ea-a1e2-3e353c93804a  via @KVUE Save Austin Now launches effort to reinstate ban on homeless camping This all comes after the Austin City Council voted in June 2019 to lift a ban on camping, sitting and lying on public streets. kvue.com", "2020-02-24T19:24:45.000Z": "Great crowd today for @LaceyHullTx in #HD138 .\n\nWe need to elect conservative candidates like Lacey to the TX House so we can continue making Texas the greatest state in America.\n\nEarly Voting ends this Friday, the 28th. Make sure to get out & vote to #KeepTexasRed .", "2020-02-24T17:44:38.000Z": "And we're back on the road again this week to #KeepTexasRed in November. Quote Tweet Texans for Abbott @AbbottCampaign What a week for @GregAbbott_TX during Early Voting. 6 candidates 5 rallies in 5 different cities 1 goal: #KeepTexasRed  #txlege", "2020-02-24T01:18:24.000Z": "Texas Teachers can make up to $32,000 MORE each year under a new state program.\n\nWe want to recruit & retain the very best teachers to educate our students.\n\nTexas has the 4th best high school graduation rate in America--but we aim to be No. 1. #txlege Teachers can make up to $32,000 more annually under new state program Somerset ISD is looking into a new state program that would allow teachers to receive incentive pay. ksat.com", "2020-02-24T00:42:23.000Z": "A criminal charged with murder and shooting 2 others was given a low cost bail out of jail despite a criminal history.\n\nWhile out on bail, he murders again.\n\nTexas will end this deadly bail system used by Texas Judges. #txlege  https:// abc13.com/family-questio ns-judge-who-gave-suspected-murderer-bond/5945022/  via @ABC13Houston Family questions judge who gave suspected murderer bond Reginald Larry's sister said Gerald Washington should have never been released from jail. abc13.com", "2020-02-23T21:24:53.000Z": "\"Governor Abbott gives the gift of hope by making it easier for trafficking victims to apply for clemency\" @DMNOpinion Governor Abbott gives the gift of hope by making it easier for trafficking victims to apply for... \"Texas is committed to empowering survivors of domestic abuse and human trafficking,\" Abbott said. \"And one of the surest signals of that goal is laying... dallasnews.com", "2020-02-23T16:33:58.000Z": "Last night I thanked law enforcement officers in Longview for all they do to keep Texas safe. \n\nI always remember to #BackTheBlue because they protect you.", "2020-02-23T06:26:29.000Z": "This is how you help the homeless. @gregabbott_tx should be proud of this success story.  You cannot help people who do not want to help themselves. @mayoradler and the atx city council's plan to enable junkies to do whatever they want makes the Austin homeless situation worse. Quote Tweet Olivia Overturf @DoubleO7akaTheC I have BEEN saying all these resources are doing a disservice to these folks. They are treated in the most inhumane ways imaginable. Finding out people are being bribed with PIZZA? That's how low \"orgs\" and \"non profs\" will go. We need accountability. @GovAbbott Show this thread", "2020-02-23T05:21:42.000Z": "This is so amazing!!! Quote Tweet TONYA {K} @TBeansprout Evening Patriots~ Every time we see a baby wearing a hearing aid and hearing his/her parents voice for the first time, the results are always the same #BEAUTIFUL ~ Watch baby Archer's response. (Mark 10:16) #TheBestIsYetToCome", "2020-02-23T03:45:46.000Z": "I'm in Longview tonight for its 150th Birthday Party...& Longview had a huge bash. \n\nI grew up in Longview. \n\nWas in the Boy Scouts & played Little League there. \n\nLongview helped shape who I am. \n\nI wouldn't be living in the Governor's Mansion had I not lived in Longview first.", "2020-02-22T22:29:11.000Z": "Great to run into @SenatorLucio in the #RGV before the kick off of @CharroDays .", "2020-02-22T00:27:22.000Z": "\"In honor of Black History Month, a study was conducted to see which states have the best environment for black entrepreneurs - and Texas rose to the top.\"\n\nTexas was ranked No. 2. \nWe aim to be No. 1. #BlackHistoryMonth2020 Texas named the second best state for black entrepreneurs in new report In honor of Black History Month, a study was conducted to see which states have the best environment for black entrepreneurs - and Texas rose to the top. The Lone ... austin.culturemap.com", "2020-02-21T21:53:03.000Z": "The First Lady and I just cast our ballots during Early Voting this afternoon. \n\nHere's a list of all the candidates I've endorsed across the state: http:// gregabbott.com/category/endor sements/  I urge you to get out & vote so we can continue to make Texas the best state in America. @FLCA", "2020-02-21T19:58:11.000Z": "We're in Fort Bend County today for a GOTV rally with Manish Seth & Jacey Jetton. \n\nWe have exactly one week left of Early Voting before the March 3rd primary. \n\nWe need you to get out & VOTE so we can keep the majority in the TX House. @seth4state  @JaceyJetton", "2020-02-21T16:56:34.000Z": "Texans willing to stomach higher taxes to improve public schools,\n\nGood news for Texans.\n\nWe improved public schools by adding $5 Billion in funding including teacher pay raises & strategies to improve student success.\n\nAt the same time we CUT taxes. Texans willing to stomach higher taxes to improve public schools, poll says Even in a tax-averse state, 62 percent of respondents said they would support raising taxes to help local schools. houstonchronicle.com", "2020-02-21T02:22:51.000Z": "Texas is committed to empowering victims of domestic abuse & human trafficking, and one of the surest signals of that goal is laying out a true path to redemption & restoration.\n\nWe now have that path. #HumanTrafficking Gov. Greg Abbott announces clemency application for survivors of human trafficking, domestic abuse The application will give survivors a path to a potential pardon for crimes committed while under the grip of a trafficker or abusive partner. kvue.com", "2020-02-21T00:12:44.000Z": "Too often, victims of human trafficking are pulled into a vicious cycle of crime.\n\nThat's why TX is announcing an initiative to help survivors apply for clemency with the opportunity to receive a full pardon.\n\nWe are empowering survivors so they may find a second chance at life.", "2020-02-20T22:00:25.000Z": "Great to join Republican members of the TX House today to discuss how we're going to keep our majority in November. \n\nNow more than ever, we need to work together so we can continue to make Texas the best state in the country. @TXGOPCaucusPAC  @TexasGOP  #KeepTexasRed", "2020-02-20T20:08:49.000Z": "Good news about #coronavirus  @CDCgov  lifted the quarantine order for 90 American evacuees in San Antonio.\n\nThe \"people being released from quarantine pose no health risk to the surrounding community, or to the communities they will be returning to.\" CDC confirms quarantine order lifted for 90 American evacuees in San Antonio The Centers for Disease Control confirmed that a federal quarantine order has been lifted for 90 Americans at Joint Base San Antonio-Lackland. The CDC issued a statement on Thursday morning about the... foxsanantonio.com", "2020-02-20T16:33:56.000Z": "Austin homeless camp fire sends 2 to hospital with potentially life-threatening injuries.\n\nAustin's camping policies endanger the homeless.\n\nThey must end camping & provide shelter.\n\nThe state is offering Austin 5 acres of shelter space for $1 per month. Austin homeless camp fire sends 2 to hospital with potentially life-threatening injuries The fire happened just before 3:30 a.m. on East Stassney Lane near I-35 in southeast Austin. kvue.com", "2020-02-20T01:30:03.000Z": "", "2020-02-20T01:21:37.000Z": "Austin leaders can't fool you.\n\nUnlike them you actually know about the stabbings, beatings, fights, urinating, defecating, nudity, & harassment of women and girls.\n\nThey may play pretend, but I will work the the legislature to restore order in Austin. Gun violence, not homeless, driving downtown crime, police say Despite swirling rhetoric on social media painting Austin's homeless policies as a catalyst for increases in violent crime and a hobbled police department unable to enforce laws, Austin Assistant... statesman.com", "2020-02-19T22:08:55.000Z": "Angelica Garcia is the strong, conservative candidate #HD132 needs to flip this district RED in November. \n\nMake sure you get out & vote this week during Early Voting. \n\nEvery vote counts. Let's work together to keep the majority in the TX House.", "2020-02-19T20:19:02.000Z": "UT researchers make 'critical breakthrough' in coronavirus vaccine. \n\n... @UTAustin  #HookEm UT researchers make 'critical breakthrough' in coronavirus vaccine Researchers at the University of Texas announced Wednesday they have made a critical breakthrough toward developing a vaccine for the new coronavirus, which has resulted in the deaths of 2,000 people... statesman.com", "2020-02-19T19:46:51.000Z": "'It's getting bad' in downtown Austin. \n\nEveryone knows it-except for Austin City Council. \n\nDowntown Austin business   owner wants City leaders to acknowledge safety concerns over homeless camps.\n\nThe facts in this story are disturbing. 'It's getting bad' | Downtown Austin business owner wants City leaders to acknowledge safety... The owner of Vince Young Steakhouse said the situation has gotten worse in the past six months. kvue.com", "2020-02-19T06:05:28.000Z": "Texas has the 4th best High School Graduation Rate in America. \n\nWe'll keep working to be #1. #txlege See High School Graduation Rates By State Iowa, Kentucky and North Dakota have the highest high school graduation rates in the country. usnews.com", "2020-02-19T03:45:39.000Z": "We're down in Coastal Bend tonight with Geanie Morrison in #HD30 .\n\nGeanie is a proven leader & an instrumental part of our Republican majority in the TX House. \n\nMake sure you get out & vote during Early Voting so we can cont. to elect strong conservatives & #KeepTexasRed in Nov.", "2020-02-19T03:25:16.000Z": "Abbott hits campaign trail in Waxahachie to endorse Jake Ellzey ahead of March 3 primary. \n\nVote ... @JakeEllzey  in early voting. Abbott hits campaign trail in Waxahachie to endorse Jake Ellzey ahead of March 3 primary On the first day of early voting ahead of the March 3 primary election, Gov. Greg Abbott made an appearance at the Rogers Hotel in downtown Waxahachie on behalf of Texas House District 10 candidate... waxahachietx.com", "2020-02-19T02:02:05.000Z": "This is a classic. Quote Tweet SportsCenter @SportsCenter MJ turns 57 today We throw it back to when he trolled Mutombo by shooting a free throw with his eyes closed (via @NBATV )", "2020-02-19T01:55:38.000Z": "I promised that our school finance reform plan would put teachers on the path to a six-figure salary.\n\nIt's happening in Dallas.\n\nWe want to recruit and retain the very best teachers to educate the next generation of Texans.\n\nThanks @dallasschools for leading the way to $100k. Quote Tweet Dallas ISD @dallasschools Check out the proposed #DallasISD teacher salary scale for next year. \n\nMany teachers could see notable salary increases thanks to the Teacher Excellence Initiative and related $28 million in additional state funding we expect to get under House Bill 3. @TeachDallasISD Show this thread", "2020-02-18T23:09:34.000Z": "When disaster strikes, that's when you find out who your real friends are. Truly blessed that @VP  @Mike_Pence , @GregAbbott_TX , @henrymcmaster , and @DHS_Wolf all reached out about the flooding and how they could help our state recover. The country stands with Mississippi!", "2020-02-19T01:03:14.000Z": "I caught up with ... @TayaKyle  in  Ellis Co. today. \n\nShe promotes the legacy of the husband she lost-... @ChrisKyleFrog -a true American Hero. \n\nTaya is now offering her talents as she runs for the school board.", "2020-02-18T21:33:16.000Z": "Electric energy for Ellzey in #HD10 today. \n\nThis crowd is ready for a fighter like @JakeEllzey in the TX House. \n\nKeeping TX red one county at a time.", "2020-02-18T16:52:21.000Z": "Governor Abbott visits Highland Village.\n\nIncredible turnout for @KrondaForTexas .\n\nTexans are excited about having a Republican once again represent #HD65 Weir: Governor Abbott visits Highland Village - Cross Timbers Gazette | Southern Denton County |... Lewisville ISD Board Member Kronda Thimesch is a Republican candidate running for election to the Texas House in District 65 in the March 3rd GOP primary. On Monday, Ms. Thimesch received the coveted... crosstimbersgazette.com", "2020-02-18T03:47:06.000Z": "A glimmer of good news for @NASCAR driver Ryan Newman. \n\nInjuries aren't life threatening. \n\nPrayers are being answered. \n\nKeep them coming. Quote Tweet Peni Basse Text TRUMP to 88022 @pmbasse Replying to @realDonaldTrump and @NASCAR NASCAR provides an update on Ryan Newman. Thank God his injuries aren't life threatening.. Praise the Lord! \nKeep praying for Ryan Newman's strength and healing.. https:// twitter.com/FOXSports/stat us/1229603075549286400?s=20 ", "2020-02-18T03:41:34.000Z": "Responsible Adult Transition Town. \n\nThe homeless formed a better government than ATX City Council. \n\nThey established rules of conduct and want safety and security at their location. Quote Tweet Olivia Overturf @DoubleO7akaTheC Replying to @Aprildsalazar1 @Austin_Network and 4 others Here's something no one is talking about. The Governor's campsite is actually working for homeless people. They've renamed it Camp R.A.T.T. \nHey have a web designer and everything", "2020-02-18T01:03:43.000Z": "I am proud to be endorsed by Governor @GregAbbott_TX ! Early voting begins tomorrow and runs through February 28th. With your support we will work together to keep Texas the best place in the world to work, live, and raise our families. #txlege  #WestTexas", "2020-02-18T02:26:26.000Z": "It's crowded for Kronda. \n\nVote early tomorrow for Kronda for Texas House seat #HD65 in the Denton Co. area. \n\nShe brings proven conservative ideas that will Keep Texas the best state in America. Quote Tweet KrondaForTexas @KrondaForTexas Standing room only as Governor @GregAbbott_TX talks about why he is supporting @KrondaForTexas for #HD65  #GoKrondaGo", "2020-02-18T01:21:11.000Z": "We kicked off the start of our statewide GOTV tour with the wonderful Kronda Thimesch. @KrondaForTexas is the candidate we need to flip #HD65 red & maintain the majority of the TX House in November.", "2020-02-17T23:17:00.000Z": "First stop: Denton County\n\nHere we come. Greg Abbott plans pre-primary tour supporting GOP state House incum... The governor is hitting the campaign trail for at least 10 House incumbents and candidates whom he has endorsed. texastribune.org", "2020-02-17T15:56:09.000Z": "On #PresidentsDay we celebrate those who shaped our country.\n\nFrom George Washington, Abraham Lincoln, Ronald Reagan, & all of America's great Presidents, we thank you for making the United States of America the greatest nation in the history of the world.", "2020-02-17T04:52:35.000Z": "Watch this video...& remember...\n\nDON'T MESS WITH TEXAS WOMEN. North Austin Homeowner Attempts to take down car thief A North Austin homeowner is speaking out after she attempted to take down a car thief. \"I saw someone in my car, with a hoodie on - rummaging through things, opening the console, going through the... cbsaustin.com", "2020-02-17T01:34:39.000Z": "Early Voting starts this Tuesday, the 18th.\n\nWe need everyone from across the state to make sure they get out & vote to elect strong leaders who will fight for conservative values. \n\nLet's work together to keep Texas, Texas.", "2020-02-17T00:48:56.000Z": "THIS is so true:\n2019 RGV Citizens of the Year: Valley MPO officials.\n\nThey showed that working together they can pave an even better path for their cities counties & the entire #RGV region.\n\nTexas is better because of this collaboration. https:// themonitor.com/2020/02/16/201 9-rgv-citizens-year-valley-mpo-officials/  via @monitornews 2019 RGV Citizens of the Year: Valley MPO officials - The Monitor Many cities and towns comprise the Rio Grande Valley, yet it generally is regarded as a single entity, with common characteristics, goals and problems. Its residents can be seen as one big family.... themonitor.com", "2020-02-16T20:51:16.000Z": "The Beast with @realDonaldTrump speeds around Daytona International Speedway before the start of the #DAYTONA500 !\n\nBUT. Can he beat @KyleBusch Quote Tweet Steve Guest @SteveGuest WATCH:\n\nIn The Beast, @realDonaldTrump and @FLOTUS take a lap around the Daytona International Speedway before the start of the #DAYTONA500 !", "2020-02-16T20:12:34.000Z": "Thanks to the Univ. of Texas police for arresting man suspected in a campus assault & indecent exposure case.\n\nI've heard many complaints from @UTAustin students & parents about safety around campus.\n\nThe Administration is increasing safety. @SafeHorns UT police nab suspect in groping, indecent exposure cases University of Texas police have arrested a man suspected in a campus assault and an indecent exposure case Tuesday morning.Officers responded to a report that a student had been groped from behind in... statesman.com", "2020-02-16T18:15:58.000Z": "Businesses & residents are leaving downtown Austin, & others fear going there because of increases in attacks, feces, etc.\n\nThe response by city leaders: citizens & business are wrong & city leaders know better.\n\nIt's time to start listening to citizens. Mayor Adler addresses safety concerns after business pulls out of Austin farmers' market Last weekend a business at the SFC Farmers' Market announced they would be leaving due to concerns of the increasing number of homeless people in the area. kxan.com", "2020-02-16T05:05:35.000Z": "What a fake survey.\n\nThey didn't even try Texas.\n\nDidn't try @Whataburger with ketchup & fries. #LOSERS  https:// bloomberg.com/news/articles/ 2020-02-15/best-burgers-in-the-world-top-chefs-pick-favorite-hamburgers  via @luxury The World's Best Burgers as Picked by Stars of Gastronomy We asked chefs for their favorites, from New York to Sydney via London. bloomberg.com", "2020-02-16T00:32:57.000Z": "Thank you, Governor! We have greatly appreciated the help of @TxDPS , and we are working hard to keep our residents safe. Quote Tweet Greg Abbott @GregAbbott_TX Other cities in Texas, like Dallas, have seen crime spikes.\n\nAt least they have a Mayor like Eric Johnson who takes public safety seriously and is searching for solutions to reduce crime.\n\nHe wants to keep his citizens safe. @Johnson4Dallas  https:// dallasnews.com/opinion/editor ials/2020/02/13/is-bail-reform-the-cause-of-dallas-climbing-crime/ ", "2020-02-16T00:05:27.000Z": "Other cities in Texas, like Dallas, have seen crime spikes.\n\nAt least they have a Mayor like Eric Johnson who takes public safety seriously and is searching for solutions to reduce crime.\n\nHe wants to keep his citizens safe. @Johnson4Dallas What's causing Dallas crime to spike? By all measures, May 2019 was the deadliest month in Dallas in two decades. Forty people lost their lives to murder. Prior to that, the highest monthly... dallasnews.com", "2020-02-15T22:48:28.000Z": "The homeless who are now camping at the state provided location are doing a better job governing than the City. \n\nThey formed their own city council with elected members. \n\nThey set rules for the homeless at the site. \n\nThey insist on security & safety. https:// kvue.com/mobile/article /news/local/homeless/people-at-state-homeless-camp-start-a-council/269-f88175f7-dfb5-4c39-bd68-7a1631efaae3  Quote Tweet Greg Abbott @GregAbbott_TX In the meantime everyone in Austin has a role to play. \n\nYou have a vote to decide if City leaders should be rejected at the ballot box because they have rejected your pleas for help. \n\nTexas will continue to seek compassion for the homeless while restoring the rule of law. twitter.com/GregAbbott_TX/", "2020-02-15T22:39:29.000Z": "In the meantime everyone in Austin has a role to play. \n\nYou have a vote to decide if City leaders should be rejected at the ballot box because they have rejected your pleas for help. \n\nTexas will continue to seek compassion for the homeless while restoring the rule of law. Quote Tweet Greg Abbott @GregAbbott_TX I raised concerns about this lawlessness when Austin ended the ban on camping.\n\nWhen rules are removed lawlessness ensues.\n\nI will seek legislation overriding Austin's reckless approach.\n\nUntil legislation is passed State law enforcement & health agencies will try to fill gaps. twitter.com/GregAbbott_TX/", "2020-02-15T22:36:12.000Z": "I raised concerns about this lawlessness when Austin ended the ban on camping.\n\nWhen rules are removed lawlessness ensues.\n\nI will seek legislation overriding Austin's reckless approach.\n\nUntil legislation is passed State law enforcement & health agencies will try to fill gaps. Quote Tweet Greg Abbott @GregAbbott_TX Man arrested after threatening to kill children at Austin church playground.\n\nHeadlines of lawlessness in Austin have been posted countless times in the last few days.\n\nCity policing is the City's job.\n\nCity leaders aren't giving police what they need. https:// kvue.com/article/news/c rime/man-threatened-to-kill-children-austin-playground/269-68a4d785-b0e7-4042-99e6-d3748f51254d ", "2020-02-15T22:34:04.000Z": "Man arrested after threatening to kill children at Austin church playground.\n\nHeadlines of lawlessness in Austin have been posted countless times in the last few days.\n\nCity policing is the City's job.\n\nCity leaders aren't giving police what they need. Man arrested after threatening to kill children at Austin church playground, police say Gov. Greg Abbott blamed the incident on Austin city leaders, saying they \"aren't giving police what they need.\" kvue.com", "2020-02-15T03:41:20.000Z": "Public safety must be a top priority of government.\n\nThat's why I called for more anti-gang centers in Texas.\n\nA new one in Tyler will soon open and help the Northeast region of Texas crack down on dangerous gangs. #txlege Sheriff hopeful for East Texas anti-gang center in Smith County The task force will be made up of federal, state, and local law enforcement agencies working together under one roof. kltv.com", "2020-02-14T16:02:41.000Z": "#HappyValentinesDay2020 to my sweetheart-the First Lady of Texas. \n\nThis is also the day we got engaged at the Riverwalk in San Antonio.", "2020-02-14T04:37:53.000Z": "Survey shows people feel less safe in downtown Austin.\n\nThey feel less safe downtown than they have in at least six years. \n\n55% said they don't feel safe walking alone downtown at night. \n\nThose kinds of numbers cause officials to lose elections. Survey shows Austinites feel less safe downtown in 2019 The study, administered by third party company ETC Institute, asked 2,049 people if they feel safe walking alone downtown at night. 55 percent said no. fox7austin.com", "2020-02-14T03:07:34.000Z": "Next session we will dismantle the decriminalization movement adopted in some parts of Texas. \n\nI believe in 2nd chances. \nNot 10th chances.\n\nThis serial burglar has 10 convictions for burglary of a building and 4 convictions for theft. Warrant issued for serial burglar connected to string of 2019 burglaries According to an arrest warrant, police are searching for 53-year-old David Barber Keen after connecting him to a string of burglaries that occurred in Austin between September 2019 and October 2019. fox7austin.com", "2020-02-14T02:05:15.000Z": "Texas passed the Born Alive Act to Stop Infanticide & Care for Babies Born Alive After Abortion. \n\nI signed HB 16 sponsored by ... @leachfortexas . \n\nIt makes it a crime not to care for a baby who survives an abortion. #ProLife  #txlege Texas Gov. Greg Abbott Signs Bill to Stop Infanticide, Care for Babies Born Alive After Abortion Texas Gov. Greg Abbott ceremonially signed a law Thursday to provide stronger protections to infants who survive abortions. Abbott signed the measure into law l lifenews.com", "2020-02-13T22:02:57.000Z": "This is our daughter when we got ... @TexasPancake  5 years ago. \n\nThen here's a picture of Pancake today. \n\nLove the First Dog of Texas.", "2020-02-13T06:18:14.000Z": "This is sheer evil. \n\nIt's murder of a child born alive. \n\nNo one supporting this can say they care about humanity. Quote Tweet The Daily Wire @realDailyWire Colorado Democrats Vote Down Bill Mandating Medical Care To Born-Alive Survivors Of Abortions http:// dlvr.it/RPwTZ2", "2020-02-13T04:17:44.000Z": "Congratulations to the University of Houston on a quick accreditation for its new medical school.\n\nThis landmark achievement is good for UH, for Houston, & for Texas.\n\nUnder Renu Khator's leadership UH continues its prestigious ascent. @UHpres  @UHouston UH medical school officially happening: Granted preliminary accreditation The University of Houston medical school has been granted accreditation, enabling a summer opening of the city's first new medical school in nearly half a century. houstonchronicle.com", "2020-02-13T03:56:31.000Z": "Austin cleaned up homeless camps in some areas.\n\nThey removed 5 tons of material from the campsites.\n\nThis is a start...with a long way to go.\n\nThe location provided by Texas can accommodate homeless while Austin continues to clean up & set up housing. Austin watershed department cleans up homeless camps in waterways, drainage areas Despite this week of rain, Austin Watershed Protection officials say homeless campsite cleanups have already helped decrease flooding across the city. Assistant Director Jose Guerrero says crews have... cbsaustin.com", "2020-02-13T00:17:26.000Z": "Voter fraud involving mail-in ballots is being investigated by law enforcement in Starr Co. Texas.\n\nVoting by mail is illegal for some. \n\nVoter fraud is a serious crime that can lead to jail time.\n\nDon't do it. Starr County to review suspected voter fraud cases RIO GRANDE CITY - Law enforcement in Starr County is already receiving tips of possible voter fraud. Like in years before, the problem is with mail-in ballots. krgv.com", "2020-02-12T17:33:27.000Z": "My jury duty is over. \n\nGet this:  \n\nThe case involved charges against a person accused of illegally parking in a handicap parking space. \n\nNot surprisingly I wasn't picked. \n\nThanks to all who answer the civic call of duty to serve on a jury.", "2020-02-12T16:55:19.000Z": "There are substantial consequences caused by Austin's reckless lawlessness. \n\nFamily-owned business pulls from downtown farmer's market over growing homeless crisis concerns. \n\nPublic safety must be the top priority. Family-owned business pulls from downtown farmer's market over growing homeless crisis concerns Round Rock Honey owner Konrad Bouffard says the location in Republic Square is a hot spot for frequent violent activity and the business thought it'd be best to part ways. fox7austin.com", "2020-02-12T16:00:21.000Z": "Today I'm doing my civic duty by doing jury duty right here in Texas. \n\nI am committed to ensuring justice in whatever case I am assigned to, and I'll keep you updated on what happens.", "2020-02-12T15:21:46.000Z": "Happy 211th birthday to our first Republican President, Abraham Lincoln.\n\nHis leadership united the nation during our most trying time and he \npromoted liberty for everyone.\n\nHe laid the foundation for America to become the most prosperous country in the world. Thanks Abe.", "2020-02-12T01:00:46.000Z": "Lucky to spend time with my daughter for an early birthday celebration. \n\nLiving her best life.", "2020-02-11T20:47:36.000Z": "That's what we call bail deform. \n\nI'm advancing REAL bail reform that will keep dangerous criminals off the streets. \n\nTexas will override dangerous policies adopted by some cities. \n\nWe will restore the rule of law in Texas. #txlege Quote Tweet FAIR @FAIRImmigration Bail Reform Allows Criminal Alien to Skip DWI Charge in Harris County https:// ihr.fm/31QPikX via @KPRCradio", "2020-02-11T20:10:09.000Z": "I'm honored to be endorsed by @GregAbbott_TX ! Early voting starts one week from today.", "2020-02-11T19:48:06.000Z": "Officers with the Lone Star Fugitive Task Force captured an 18-year-old registered sex offender on Monday who was wanted on an aggravated sexual assault charge.\n\nExcellent work to get these criminals off the streets. US Marshals capture registered sex offender wanted for aggravated sexual assault Officers with the Lone Star Fugitive Task Force captured an 18-year-old registered sex offender on Monday who was wanted on an aggravated sexual assault charge. Conlan Turner, 18, was taken into... cbsaustin.com", "2020-02-11T17:47:14.000Z": "Congratulations General McGee. \n\nThank you for your service and God bless.  @TuskegeeAirmen Quote Tweet The White House @WhiteHouse President @realDonaldTrump promoted Charles McGee, one of the last surviving Tuskegee Airmen, to Brigadier General!", "2020-02-10T22:33:01.000Z": "Today at the White House we discussed ways to improve America's infrastructure, reduce regulations & speed the permitting process. \n\nIt's about doing more & doing it faster. \n\n... @WhiteHouse \n\nOfficial White House Photo by Keegan Barber", "2020-02-10T18:50:02.000Z": "Texas is #1 AGAIN.\n\nTexas is the @BizFacilities State Of The Year for a record 4th year. \n\nTexas wins top honors with a bonanza of new investments in projects creating thousands of new jobs in a diverse group of growth sectors throughout the State. Business Facilities' 2019 State Of The Year: Texas Texas wins BF's 2019 State of the Year honor with a bonanza of new investments creating thousands of new jobs throughout the Lone Star State. businessfacilities.com", "2020-02-10T05:41:44.000Z": "Tonight's #Oscar for craziest quote by a Presidential Candidate:\n\nJoe Biden calls a woman a \"lying dog-faced pony soldier\" https:// twitter.com/Breaking911/st atus/1226733643835506690  This Tweet is unavailable.", "2020-02-10T04:13:44.000Z": "Texas always stands out at the @WhiteHouse", "2020-02-10T02:45:54.000Z": "God Bless America", "2020-02-09T23:06:08.000Z": "Thanks @FLOTUS Melania Trump for providing such a beautiful setting for the @WhiteHouse Governors Ball tonight.", "2020-02-09T22:43:54.000Z": "I had the pleasure of meeting with the new Republican Governor of Puerto Rico @wandavazquezg . I look forward to working with her.", "2020-02-09T19:41:36.000Z": "ATX City Council is in denial. Quote Tweet T Wolf @MyTwolffamily As a formerly homeless Heroin addict in recovery I have to say, for a city council member to suggest that used syringes found at a homeless encampment are for insulin and not Heroin/Meth/Fentanyl either shows a lack of understanding or sheer denial. @ALTERforATX  @GregAbbott_TX t.co/kAZAKSHb86", "2020-02-09T19:32:40.000Z": "Some Texas judges release dangerous criminals out on our streets with little or no bail bond.\n\nHouston mom pushes for new bail bond law after daughter & unborn grandchild were stabbed to death.\n\nI'll propose bail reform to prevent these deadly events. Houston mom pushes for new bail bond law after daughter and unborn grandchild were stabbed to death A 20-year-old woman who was five months pregnant would be alive today if it were not for what her mother calls a flaw in the jail bond system. Now she's pushing for a law to prevent tragedies like... fox26houston.com", "2020-02-09T17:43:38.000Z": "Austin's refusal to ban homeless camping isn't compassionate doesn't help the homeless & endangers residents & visitors.\n\nHuman defecation on streets, used needles, frequent assaults & fires won't be tolerated.\n\nLegislation will override this lawlessness. Gov. Abbott working to override Austin homeless camping ordinance Gov. Greg Abbott is currently working on legislation for a statewide camping ban proposal, in direct response to Austin's homeless situation. fox7austin.com", "2020-02-09T17:09:29.000Z": "MS-13 member involved in 9 attempted murders in Dallas area sentenced to life behind bars. \n\nThanks to federal prosecutors for getting these criminals off the streets. \n\nOur collective goal must be to keep communities safe. MS-13 member involved in 9 attempted murders in Dallas area sentenced to life behind bars A gang member accused of taking part in nine attempted murders in the Dallas area in 2017 has been sentenced to life in federal prison. Rolan Ivan... dallasnews.com", "2020-02-09T06:20:32.000Z": "Next time just remind representatives Canales and Guerra that a vote for Republicans IS a vote for a person with disabilities...\ntheir Governor. Quote Tweet Hidalgo County GOP @HidalgoCoGOP For Immediate Release: #DifferentNotLess  #RGV  #HidalgoCo", "2020-02-08T22:54:54.000Z": "Texas welcomes UK Trade Minister @ConorBurnsUK who sees 'Enormous Opportunities' in Texas Post-Brexit.\n\nIt makes sense: \n\nAbout $14 billion is traded between Texas & UK each year;\nTexas has 10th-largest economy in the world:\n& Texas has the fastest-growing economy in the U.S.", "2020-02-08T21:52:23.000Z": "Texas is adding doctors at a record pace.\n\nThe doctor to patient ratio is at a 10-year high.\n\nThis means better access to healthcare for Texans.\n\nAlso I signed a law allowing rural hospitals to use tele-medicine services to have a doctor on call. New Texas doctors set record for state's physician-to-patient ratio Based on the new data, there are now nearly 190 physicians for every 100,000 Texans. kxan.com", "2020-02-08T02:42:11.000Z": "Texas has some of the best teachers in America. \n\nAmarillo High teacher among finalists for presidential teaching award. \n\nOur teachers got a well-earned pay raise this last session. \n\nWe want to recruit & retain the best teachers. Amarillo High teacher among finalists for presidential teaching award An Amarillo High School teacher has been named a finalist for the 2019 Presidential Awards for Excellence in Mathematics and Science Teaching (PAEMST) for grades 7-12 in science. According to the... abc7amarillo.com", "2020-02-07T18:24:27.000Z": "Six Texas cities made the list for the top 10 most affordable places for military veterans to live in 2020.\n\nTexas loves our veterans and we are proud they call Texas home. #Veterans 10 Most Affordable Places For Military Veterans To Live In 2020 Affordability, job market strength, quality of education and cultural attractions are among factors that draw military veterans to these 10 cities. forbes.com", "2020-02-07T03:09:16.000Z": "New High of 90% of Americans Satisfied With Personal Life. \n\nNine in 10 Americans are satisfied with the way things are going in their personal life, a new high in Gallup's four-decade trend. New High of 90% of Americans Satisfied With Personal Life Nine in 10 Americans are satisfied with their personal life, a new high in Gallup's trend. About two-thirds say they are \"very satisfied,\" also a new high. news.gallup.com", "2020-02-07T02:29:06.000Z": "Property taxes makes housing unaffordable.\n\nThe state took the first step to make housing more affordable by cutting skyrocketing property taxes by $5 billion last session, and by limiting the ability of cities to increase property taxes in the future. Poll: majority of Texans want state to step up role in affordable housing A majority of Texans think state and local government should be more involved with providing affordable housing, according to a new poll released Thursday.The Texas Lyceum Poll results show the... statesman.com", "2020-02-06T23:07:48.000Z": "The Texas Department of Public Safety captured 27 fugitives from the Texas 10 Most Wanted list in 2019.\n \nSome were also a part of notorious gangs, including the Texas Mexican Mafia, MS-13, Aryan Brotherhood of Texas. \n\nThanks ...... @TxDPS  Mexican Mafia, MS-13, Aryan Brotherhood members among those captured in Texas The Texas Department of Public Safety captured 27 fugitives from the Texas 10 Most Wanted list in 2019. mysanantonio.com", "2020-02-06T20:46:19.000Z": "Here they are snuggling.  \n\nThanks for asking about @TexasPancake and Peaches. Quote Tweet Mara @alerriebucky Replying to @GregAbbott_TX Can you post more pics of Peaches and Pancake?", "2020-02-06T20:03:10.000Z": "This is gold. Quote Tweet Patrick Mahomes II @PatrickMahomes I went to Texas Tech... prepared me for these moments twitter.com/nfldraftscout/", "2020-02-06T19:53:55.000Z": "Trump's Labor Secretary touts Fort Worth 'blue collar boom.'\n\nThe Administration-like Texas-is focusing on vocational training. \n\nIt provides high paying jobs and the skilled workforce that employers are seeking. \n\n... @realDonaldTrump  Trump's labor secretary touts more vocational training for Fort Worth work force Labor Secretary Eugene Scalia, who was in Fort Worth Wednesday, also touted the new trade agreement with Mexico, Canada star-telegram.com", "2020-02-06T16:26:28.000Z": "To celebrate Ronald Reagan's 109th birthday, may we always remember this:\n\n\"Freedom is never more than one generation away from extinction. We didn't pass it to our children in the bloodstream. \n\nIt must be fought for, protected, and handed on for them to do the same.\"", "2020-02-06T02:10:19.000Z": "Next step should be to reinstate the ban on camping and work with non-profit organizations to assist with shelters. \n\nThat's exactly what I will ask the Texas Legislature to do. Quote Tweet Blastbeat Industries @BlastbeatATX Replying to @RecallAdler @MayorAdler and @GregAbbott_TX @MayorAdler is useless. What an embarrassment... https:// fox5ny.com/news/officials -consider-next-steps-after-large-homeless-camp-fire-in-ne-austin ", "2020-02-06T01:18:44.000Z": "Such a great story. \n\n100-year-old Tuskegee Airman Charles McGee honored at the State of the Union. #SOTU Meet the 100-year-old Tuskegee Airman honored at the State of the Union He credits his longevity to \"thinking positive and the good Lord's many blessings.\" today.com", "2020-02-06T00:32:04.000Z": "Dallas-Fort Worth led America's metro areas in job creation in 2019. \n\nKeeping Texas #1. Dallas-Fort Worth led the nation's metro areas in job creation in 2019 Dallas-Fort Worth led the nation's metropolitan areas in job creation in 2019, marking the region's third straight year topping the charts. New, relocating... dallasnews.com", "2020-02-05T05:44:52.000Z": "Today I spoke with the Dallas Citizens Council.\n\nThese leaders understand the importance of engaging with their community & are dedicated to serving the city of Dallas. \n\nThank you for all that you do for the Great State of TX.", "2020-02-05T04:12:40.000Z": "Great day in Irving, TX with Vistra Energy.\n\nOf the 5,600 employees, 4,000 of those are within Texas. \n\nBusinesses like Vistra Energy help keep Texas the greatest state in America. \n\n@VistraEnergyGA", "2020-02-04T21:40:44.000Z": "I've issued a Proclamation about February 2020 being African-American History Month.\n\nWe are reminded of the tribulations African-Americans have faced in our history, and we celebrate the invalueble contributions they have made to our country & state. Governor Abbott Proclaims February 2020 African-American History Month | Texarkana Today . As a state and nation shaped by the diversity of our citizens, it is vital we recognize and celebrate the different races, nationalities, and backgrounds of the land we love. Having faced slavery,... txktoday.com", "2020-02-04T05:24:58.000Z": "The most important part of democracy is the sanctity of your vote.", "2020-02-03T03:15:04.000Z": "Patrick Mahomes did what he knows best: #WreckEm Congrats to @Chiefs . @PatrickMahomes", "2020-02-02T23:37:45.000Z": "\"Abbott comes to Texoma: Governor updates Grayson County on last legislative session.\" #txlege Abbott comes to Texoma: Governor updates Grayson County on last legislative session Governor Greg Abbott was in Grayson County Saturday night to give area residents an update on last year's legislative session. Abbott was the keynote speaker for the Grayson County Republican Party's... heralddemocrat.com", "2020-02-02T23:13:59.000Z": "Wishing a happy birthday to my friend @JohnCornyn .", "2020-02-02T21:14:41.000Z": "We honor our fallen law enforcement officers. #BackTheBlue Quote Tweet City of Corpus Christi @cityofcc Today @GregAbbott_TX approved the request from our #CCMayor to lower U.S. & Texas flags to half-staff in honor of @CorpusChristiPD Officer Alan McCollum who was killed in the line of duty. The City will lower flags at municipal buildings. We ask our community to do so as well.", "2020-02-02T20:31:30.000Z": "My favorite commercial today!!!! https:// twitter.com/Jeep/status/12 23924066417020929  This Tweet is unavailable.", "2020-02-02T16:51:34.000Z": "Today is Chris Kyle Day in Texas. \n\nIn honor of a Texas son, a Navy SEAL and an American hero - a man who defended his brothers and sisters in arms on and off the battlefield - I declared February 2nd Chris Kyle Day in Texas. \n\nWe remember our heroes.", "2020-02-02T05:08:45.000Z": "If there is any ONE thing that can improve society more than anything else, I'd say it would be for fathers to love and support their children the way Kobe seemed to love and support his. Quote Tweet Kevín @KevOnStage Bruh a video of Kobe helping Gigi makes shot.  With Oceans in the background.  I am tears.  This was an unfair combination.", "2020-02-02T04:10:10.000Z": "Tonight I visited the Sherman-Denison area for the Grayson Co. Lincoln-Reagan Dinner. \n\nGreat group of patriots who are doing their part to keep Texas exceptional. \n\nCheck it out.", "2020-02-01T16:00:40.000Z": "Fixing homelessness in ATX is easy.\n\n1. Put public safety first.\n\n2. Open large shelters that can accommodate > 200 people. \n\n3. Provide mental health, drug addiction help + job training skills.\n\n4. Then focus on long term housing.\n\nAustin doesn't have the leadership to do this.", "2020-02-01T15:42:09.000Z": "Yet ANOTHER stabbing in downtown Austin. \n\nAustin's policies are not compassionate for the homeless or anyone else. \n\nTheir policies are dangerous for everyone. \n\nYou can expect the legislature to once again override Austin's reckless policies. #txlege Police investigating downtown stabbing, Gov. Abbott responds in tweets UPDATE: Governor Abbott responded through Twitter to reports that witnesses at the scene of a stabbing in downtown Austin Friday night claim the suspect was homeless. The governor says Austin's... cbsaustin.com", "2020-01-31T05:39:25.000Z": "Has Tom Brady entered the transfer portal? Quote Tweet Barstool Sports @barstoolsports There are Rumors Out of Nashville Brady & Gisele are Registering Their Kids in School There https:// barstoolsports.com/blog/1764189/t here-are-rumors-out-of-nashville-brady-and-gisele-are-registering-their-kids-in-school-there ", "2020-01-30T21:06:09.000Z": "Republican governors are transforming our states for the better, driving economic growth, reinventing state government, & delivering real results.\n\nThanks to their leadership & hard work the @RGA enters this election year prepared to add more R Governors. RGA Raises $53.1 Million In 2019; Sets Off-Year Fundraising Record WASHINGTON D.C. - The Republican Governors Association (RGA) today announced $53.1 million raised across all entities in 2019. This marks a record sum for the first year of a four-year cycle, an... rga.org", "2020-01-30T19:17:33.000Z": "Thank you Texas for giving me the highest approval rating among political officials.\n\nThat includes 52 % approval among African Americans & 60 % among Hispanic voters.\n\nI'll keep working to make Texas even better. #txlege New Texas Poll Reveals High Approval Rating for Abbott, Hegar Leading Anemic Senate Primary A new poll surveyed likely Texas voters on everything from the governor's job performance and the Senate primary race to President Trump's job performance. thetexan.news", "2020-01-30T17:59:00.000Z": "Happy 2nd birthday to Peaches, the First Puppy of Texas. She's the little sister of @TexasPancake .", "2020-01-30T02:44:12.000Z": "Big shoutout to @JudgeJohnCarter and his team from Williamson County. \n\nThey showed what team work is all about by providing a huge help in HD28 knocking  on all those doors! GOP dashes Democratic hopes of bellwether win in Fort Bend Tuesday's election in Texas House District 28 drew a larger turnout than any House special election runoff since at least 1992, perhaps ever. Democrat Eliz Markowitz had ample resources arrayed on... statesman.com", "2020-01-30T01:21:10.000Z": "Tonight I'm with Lily in Dallas.\n\nI signed a law named after her that allows 5th graders to visit state parks for free.\n\nShe started a movement to help 5th graders see what they learned in Texas History in 4th grade.\n\nThanks to @MorganMeyerTX for his leadership on this. #txlege", "2020-01-29T23:21:13.000Z": "...The @TexasGOP  played a huge role in last night's victory in HD28-the first victory of 2020. \n\nThe leadership & execution showed by Chairman Dickey & the RPT will help us achieve our goal in November to #KeepTexasRed . Republicans Blow Out Beto O'Rourke-Backed Democrat In Key Texas House Race, Report Says Texas Republicans dominated in a key Texas state House race on Tuesday against a leftist candidate backed by failed Senate and failed presidential candidate Robert Francis O'Rourke. \"The victory by... dailywire.com", "2020-01-29T17:06:51.000Z": "Great to be at the @WhiteHouse today for the signing of the #USMCA with @realDonaldTrump .\n\nThis deal is a huge win for the state of Texas & for our country.", "2020-01-29T03:40:32.000Z": "The business leaders of Temple have put this region on the map by providing more opportunity in Central Texas.\n\nThanks to organizations like the @TempleChamber this city has become a hub for innovation.\n\nTexas is fortunate to have such successful communities like Temple.", "2020-01-29T01:59:43.000Z": "Wait.\n\nBeto math was that if he won or was close in a House district then he could help a democrat win.\n\nHe came within 3% in this district.\n\nEarly returns show the Republican winning by about 18% \n\nBeto math doesn't work. \nAll of that $ was incinerated. Beto Pours Political Capital Into Texas House Race Considered Bellwether Fresh off a bruising end to his 2020 presidential campaign, Beto O'Rourke has poured his efforts and fundraising into a Texas State House race. freebeacon.com", "2020-01-29T01:28:33.000Z": "Are there any updates on this race tonight? Beto Pours Political Capital Into Texas House Race Considered Bellwether Fresh off a bruising end to his 2020 presidential campaign, Beto O'Rourke has poured his efforts and fundraising into a Texas State House race. freebeacon.com", "2020-01-28T21:32:24.000Z": "Today is Election Day in #HD28 & #HD148 . \n\nOnly a few hours left to vote. \n\nDemocrats have poured resources from out-of-state groups to try to flip the Texas House blue to advance their leftist agenda.\n\nGo vote for @GatesforTexas & @LaRottaforTexas to help #KeepTexasRed .", "2020-01-28T20:55:56.000Z": "The Texas economy continues to be incredibly strong.\n\n\"Growth accelerated in the Texas manufacturing sector in January, with the production index pushing further into positive territory and the new orders index surging to a 15-month high,\" #txlege Texas factory output continues its rebound Factory output in Texas appears to be perking up, amid a recent easing of the international trade tensions that have been roiling manufacturers statewide and nationally.Growth in the state production... statesman.com", "2020-01-28T01:51:36.000Z": "Excellent turn of events:\n\nAccused Grapevine child predator back in custody & now faces federal child abuse charge.\n\nWe must keep predators off our streets. Accused Grapevine child predator back in custody, faces federal child abuse charge A man who had been out on bond after being arrested three times in two months - including one case where he's accused of sexually abusing a 10-year-old boy at Grapevine's REC facility - was back in... star-telegram.com", "2020-01-28T01:30:22.000Z": "I'm working with Texas Health and Emergency Response leaders to ensure Texas is doing all possible to respond to the #Coronavirus .\n\nWe're working with local health authorities to reduce the spread of this virus & to ensure they have all needed resources. State Leaders Working To Make Sure Communities Have Resources To Respond To Coronavirus \"The Lone Star State will remain vigilant to protect the health and safety of all Texans,\" Governor Greg Abbott said Monday. dfw.cbslocal.com", "2020-01-27T21:37:30.000Z": "Today is International Holocaust Remembrance Day.\n\nWe remembered Holocaust victims & recognized the 75th anniversary of the liberation of the Auschwitz concentration camp.\n\nI also announced my intent to soon create an Anti-Semitism Commission in Texas. Gov. Abbott announces intent to create anti-Semitism commission during Holocaust Remembrance Day at... Gov. Greg Abbott is joining other speakers at an event Monday at the Texas State Capitol commemorating International Holocaust Remembrance Day. (Ed Zavala) kxan.com", "2020-01-27T04:24:42.000Z": "The 10 most popular Governors in America have 1 thing in common.\n\nThey are all Republican. \n\nWe aren't perfect. \n\nBut we strive to be result oriented & responsive to our constituents. \n\n... @The_RGA  Governor Rankings - Morning Consult morningconsult.com", "2020-01-27T00:56:28.000Z": "GOOD NEWS: Texas A&M student doesn't have coronavirus. \n\nBut Texas will remain vigilant. \n\nTomorrow I meet with state health officials to ensure every community has the resources & preventative measures needed to respond to the dangerous #coronavirus . Texas A&M student thought to have coronavirus tests negative, officials said The Texas A&M student who was said to have been a carrier of the coronavirus last week returned negative test results, according to a news release from the university.On Jan. 23, the Brazos County... statesman.com", "2020-01-26T22:12:41.000Z": "Kobe & Gigi living their best lives. \n\nThis is the best way to remember. Quote Tweet ESPN @espn Kobe and Gigi courtside breaking down the game", "2020-01-26T21:58:05.000Z": "It appears UT has already responded to my request earlier today to redouble their efforts to keep their students safe. \n\nThanks @UTAustin  #HookEm Quote Tweet billy pecos @realpecosbill #UTAUSTIN  #SAFETYALERT  @GregAbbott_TX  #Adlerville This just hit all the student email accounts on campus... Show this thread", "2020-01-26T21:23:44.000Z": "Thank you @Franklin_Graham Quote Tweet Franklin Graham @Franklin_Graham Anytime there is tragedy, it is a reminder of the brevity of life and that none of us know when we are going to have to stand before God and give an account for our lives. Are you ready?", "2020-01-26T21:03:30.000Z": "From SLAM", "2020-01-26T19:57:18.000Z": "Kobe Bryant killed in California helicopter crash.\n\nSuch a tragic loss in the sports world. https:// nypost.com/2020/01/26/kob e-bryant-reportedly-killed-in-california-helicopter-crash/?utm_source=twitter_sitebuttons&utm_medium=site%20buttons&utm_campaign=site%20buttons  via @nypostsports Kobe Bryant dead in California helicopter crash Legendary NBA player Kobe Bryant has died in a California helicopter crash, reports said Sunday. He was 41. The retired Los Angeles Lakers star was traveling in his private helicopter over Calabasas nypost.com", "2020-01-26T19:20:24.000Z": "All available Texas agencies are stepping up to stop human trafficking.\n\nThis is state-wide team work to crack down on this heinous crime & to help the victims of it. #txlege  #HumanTrafficking  http:// kvue.com/article/news/p olitics/texas-human-trafficking-awareness-prevention/269-93f70ee4-a747-42d8-a631-2269f0bc7ce6  via @KVUE How Texas agencies are stepping up to stop human trafficking Texas ranks second in the U.S. for the number of reported cases of human trafficking - so more state agencies are getting involved. kvue.com", "2020-01-26T19:01:36.000Z": "The increase in these explosions & chemical accidents is unacceptable.\n\nTexas will work with Houston & Harris County on strategies to reduce--and hopefully eliminate--them. #txlege  https:// houstonchronicle.com/local/article/ Mayor-Sylvester-Turner-More-must-be-done-to-keep-15004373.php?utm_campaign=CMS%20Sharing%20Tools%20(Premium)&utm_source=t.co&utm_medium=referral ", "2020-01-26T18:36:43.000Z": "ANOTHER stabbing in Austin.\n\nThis seems like a daily report.\n\nWhat is happening in Austin leading to this increase in stabbings?\n\nWe'll work to get some answers. Overnight stabbing seriously injures one in northeast Austin Police say one person is in custody and another is being treated at a hospital after suffering stab wounds on Sunday morning. Austin Police and Austin Fire responded to the Ashford Costa Esmeralda... cbsaustin.com", "2020-01-26T17:22:05.000Z": "Thanks Chief for your efforts to improve safety for UT students. \n\nI've heard urgent pleas by UT students about increasing lighting and security tools around campus. \n\nI shared my expectations to UT leaders & expect results next month. \n\nSafety First. @KevinEltife Quote Tweet Chief David Carter @UTPDChiefCarter I was alerted by a Professor of a second student who was attacked by recent knife assailant on 6th st. We notified APD and have connected student to SES for follow on care.  Never hesitate to tell someone if u are assaulted.  Police will always keep your identity confidential.", "2020-01-26T02:42:38.000Z": "Parents concerned after alleged child predator released on bond. \n\nMy office will look into this tragedy. \n\nWe will add this to our bail reform proposals next session. \n\nWe must keep dangerous criminals off the streets. #txlege 'It makes me sick': Parents concerned after alleged child predator out on bond, despite 3 arrests... A man accused of sexually assaulting a child repeatedly over six months was also arrested on separate charges for indecent exposure and showing explicit photos. wfaa.com", "2020-01-25T17:59:24.000Z": "Texas topped nation in 2019 job growth. \n\nThanks to our employers who continue to grow and hire. \n\nThanks also to the best workforce in America. Texas topped nation in 2019 job growth San Antonio's unemployment rate dipped to 3 percent in December. The rate has stayed at or below 3.1 percent since last February, the Federal Reserve Bank of Dallas reports. expressnews.com", "2020-01-25T17:34:12.000Z": "Powerful testimony why we fight for the lives of the unborn. \n\nThanks for sharing. #ProLife Quote Tweet Gilley Estes || || || @DilbertIsMyHero Replying to @TomMcLa07125691 @GregAbbott_TX and @TexasYRs In 1963, my birth year, abortion was still illegal...thank goodness...otherwise I might not be alive. My 16 yo birth mother had two options...raise me or put me up for adoption. Thank goodness she chose adoption. I was 9 days old when I was chosen by my parents. #TxRally4Life", "2020-01-25T00:23:59.000Z": "Awesome to see thousands of people marching in our nation's capital to defend the lives of the unborn. \n\nWe will continue to protect the sanctity of life right here in Texas. #WhyWeMarch  #MarchForLife Quote Tweet March for Life @March_for_Life THOUSANDS of #prolife marchers are heading up Capitol Hill! #WhyWeMarch", "2020-01-24T23:55:42.000Z": "Oh my. \n\nIt's great to be back in Texas. \n\nNo place I've been across the globe is better than the Lone Star State.", "2020-01-24T22:45:21.000Z": "Austin has shown that raising taxes doesn't solve homelessness. \n\nThey increased property taxes to raise more than $20,000 per homeless person in Austin. \n\nThe problem has only gotten worse since then. \n\nAustin needs things money can't buy: action, resolve & common sense. Quote Tweet Is @bugzbony Replying to @GregAbbott_TX Removing encampments isn't going to address root cause of homelessness. Nor will Republicans giving tax cuts to rich, for that matters", "2020-01-24T22:24:33.000Z": "The city's policies are dangerous for both the homeless and non-homeless. \n\nToo many people are being harmed because of them. Quote Tweet Molly Oak @MollyAndAMic (3/4): \"Public endangerment and murder can no longer be tolerated because of the actions-and inactions-by City officials. Mayor Adler and the city council should re-instate the camping ban and restore the rule of law in Austin. Show this thread", "2020-01-23T21:44:24.000Z": "To the Californians moving to Texas:\n\nRemember those high taxes, burdensome regulations, & socialistic agenda advanced in CA?\n\nWe don't believe in that.\n\nWe believe in less government & more individual freedom.\n\nIf you agree with that you'll fit right in. The number of moves from California to Texas is up 36% in latest count The number of California residents headed to Texas grew by more than a third in the latest U.S. migration count. More than 86,000 Californians picked up... dallasnews.com", "2020-01-23T20:51:21.000Z": "Hanging out tonight with @jpmorgan CEO Jamie Dimon and former GB PM Tony Blair. \n\nWe are proud that JP Morgan is one of the largest employers in Texas and growing.", "2020-01-23T18:32:03.000Z": "To honor Spc. Miguel A. Villalon, I've ordered flags to to be lowered to half-staff. \n\nWe are thankful for his service to our country & for making the ultimate sacrifice overseas.\n\nGod bless him & God bless our brave military service members. Governor orders flags be lowered at half-staff to honor Villalon Governor Greg Abbott has ordered that the State and U.S. flags in Cameron County and surrounding counties be lowered and fly at half-staff in honor of Spc. Miguel A. Villalon, who was killed earlier... valleymorningstar.com", "2020-01-23T16:32:28.000Z": "Great to visit with @IvankaTrump today at @wef .\n\nShe's a transformative leader on workforce development solutions. \n\nAnd she's a hero for her efforts to combat human trafficking. #HumanTrafficking", "2020-01-23T13:05:52.000Z": "A productive last day in Davos at the World Economic Forum.\n\nThis morning I met with @francoislegault , Premier of Québec. \n\nTexas has a strong economic relationship with Québec & we are proud to be here to continue & strengthen this bond. @wef  #wef20", "2020-01-23T13:04:16.000Z": "What the heck is going on?\n\nWhy does it seem this problem is getting worse? \n\nWe must have compassion for everyone in Austin but we must put public safety first. Quote Tweet Jacqueline Sarkissian @JSarkissian #BREAKING : @Austin_Police are investigating a suspicious death in Southeast Austin. APD says one man was found with obvious trauma at a homeless camp they didn't even know existed. @fox7austin Show this thread", "2020-01-23T00:04:28.000Z": "Another sign how strong the Texas economy is: Dallas-Fort Worth tops the country in office job growth. \n\nGreat line from the story:\n\n\"A comment we often hear from companies when visiting from out of state is, 'Wow, I had no idea Dallas was this cool!'\" Dallas-Fort Worth tops the country in office job growth Dallas-Fort Worth was the top U.S. market for growth in office jobs in 2019, and it'll be another top generator in 2020, according to a forecast from... dallasnews.com", "2020-01-22T22:53:23.000Z": "Great to spend time with @SempraEnergy CEO Jeff Martin.  \n\nSempra does a lot of business in Texas. Quote Tweet Sempra Energy @SempraEnergy \"At @SempraEnergy , we are pleased to advance energy initiatives in partnership with Texas Governor Abbott here at Davos.\" -JWM @wef  #Davos2020  #Texas", "2020-01-22T22:26:59.000Z": "Healthcare for Texas women just got a $350 million boost.\n\nThe Trump Admin. restored federal funding to Texas' health care program for low-income women. \n\nFunding for the program was cut by the Obama Admin. because Texas kicked out Planned Parenthood. Texas women's program lost funding for kicking out Planned Parenthood. The Trump administration... The Trump administration Wednesday restored federal funding to the state's women's health program. A previous version of the program lost the money seven years ago after Texas officials had excluded... statesman.com", "2020-01-22T18:01:54.000Z": "Meeting with @dkhos the CEO of Uber-talking about their new, second, HQ in Dallas. \n\nThey are leaders of future innovation and we are proud to have them in Texas.\n\n... @Uber ", "2020-01-22T17:11:23.000Z": "Interview tonight - today in Texas - with ... @Varneyco  about the strong Texas economy.", "2020-01-22T14:50:08.000Z": "At an early meeting of world energy leaders @wef in @Davos I explained that if Texas was its own country we'd be the 4th largest producer of oil in the world.\n\nTexas succeeds because our focus is on free markets & innovation.\n\nWe also lead America in wind power generation.", "2020-01-22T12:55:13.000Z": "A candid moment with ... @realDonaldTrump  as he departs the @WEF Conference in Davos.", "2020-01-22T12:20:50.000Z": "The Texas Oil & Gas industry made history in 2019.\n\nMore oil & gas was produced in the state than ever before.\n\nIt brought in over $16 billion worth of tax revenue.\n\nIt helps fund schools, roads & infrastructure in Texas.\n\nGod has blessed Texas. #txlege Texas oil & gas industry breaks records for 2019 fiscal year ore oil and gas was produced in the state than ever before newschannel6now.com", "2020-01-22T12:11:37.000Z": "Wichita Falls organization hopes to get approval from city council to make living spaces for homeless veterans. \n\nThis is a low cost step in the right direction to help the homeless that should be replicated by other Texas communities. Wichita Falls organization hopes to get approval from city council to make living spaces for... WICHITA FALLS, Texas (KFDX/KJTL) - Tomorrow could be a big day for people at Base Camp Lindsey, a local organization aimed at helping veterans find long term solutions. The city council may give th easttexasmatters.com", "2020-01-21T21:53:04.000Z": "Great visits today with Tim Cook of Apple, Steve Demetriou the CEO of Jacobs Engineering, and Onur Genç  the CEO of BBVA. \n\nThey all have substantial operations in Texas, with Jacobs having its HQ in Dallas. \n\nWe all agree that Texas is a fabulous place to do business. @wef", "2020-01-21T18:54:55.000Z": "I visited with long time friend Larry Kudlow at the World Economic Forum. \n\nHe's the National Economic Council Director. \n\nHe's expecting faster economic growth-around 3% this year. \n\nHe says the trade deals will help & Texas will benefit. @larry_kudlow  @WEF", "2020-01-21T17:24:06.000Z": "Yes. \n\nEveryone in Austin expressing concern about the homeless should go to http:// atxhelps.org and provide support. \n\nThey provide services that help the immediate needs of homeless & put them on a pathway toward greater dignity. Quote Tweet @LunsfordMarieDV Replying to @GregAbbott_TX Is there a way we could set something up for the homeless to help train them into getting jobs? Give them a place to shower and get groomed, letting cosmetology students train on them as well too?", "2020-01-21T17:16:47.000Z": "GREAT NEWS:\n\nOne of Texas' most wanted gang members arrested in San Antonio. \n\nThanks to the Bexar County Sheriff's Office and the Lone Star Fugitive Task Force.\n\n... @BexarCoSheriff  One of Texas' most wanted gang members arrested in San Antonio The Bexar County Sheriff's Office announced the arrest of a man described as \"one of the most wanted gang members in Bexar County,\" Xavier Johnson was arrested on Sunday in Universal City by officers... foxsanantonio.com", "2020-01-21T17:04:03.000Z": "Busy day at the World Economic Forum in Davos.\n\nI met with @SecretaryRoss to discuss the USMCA & China trade deals. Texas will be a winner.\n\nSeparately I met with a CEO who is moving his business from another state to Texas.\n\nLeaders love the Texas approach to business. @wef", "2020-01-21T14:25:18.000Z": "Thanks for sharing.\n\nYour feelings and frustrations are important. \n\nI'll look into this--as well as look into whether Austin is violating the Americans With Disabilities Act by allowing people to block wheelchair ramps like your picture showed. Quote Tweet Melanie @Melannnial ... @GregAbbott_TX  ... @GovAbbott  ... @MayorAdler   Why are we allowing this? An innocent walk to Austin's Convention Center and we're stepping over bodies like this? https:// facebook.com/569541393/post s/10156492027581394/  Show this thread", "2020-01-21T11:35:28.000Z": "More by Trump @WEF -Earnings growth for the bottom 10% is exceeding that of the top 10%.\n\n-We're building an economy that works for everyone.\n\n- A nations highest duty is to its own citizens.\n\n-We will never allow radical socialists to destroy our economy.", "2020-01-21T11:19:12.000Z": "President Trump @WEF in Davos may be giving his best speech ever... educating global leaders about the power of American capitalism. \n\n\"I knew if we unleashed the potential of our people, economic prosperity would come roaring back.\"\n\n\"We're lifting up Americans of every race\"", "2020-01-20T11:55:13.000Z": "\"I have a dream that my four little children will one day live in a nation where they will not be judged by the color of their skin, but by the content of their character.\"\n\nWe've made progress toward that dream but must continue striving to achieve that mission. #MLKDay2020", "2020-01-19T23:57:07.000Z": "Hanging out with Wesley Snipes. \n\nIn his movie The Waterdance he uses a wheelchair as well as I do.", "2020-01-19T18:04:00.000Z": "Thanks for sending. \n\nI will have the Texas Dept. of Transportation take care of it. https:// t.co/PwgkMmg7J6 This Tweet is unavailable.", "2020-01-19T12:59:35.000Z": "After a successful economic development and cultural trip to Israel we now head to the World Economic Forum in Davos to explain how the Texas model produces the strongest economy and jobs growth among U.S. States.\n\nTexas is best for business. Gov. Abbott visits Israel, headed to Davos Gov. Greg Abbott on Friday completed an official visit to Israel during which he met with startup entrepreneurs in Tel Aviv and with Prime Minister Benjamin Netanyahu in Jerusalem seeking to streng... statesman.com", "2020-01-18T22:58:28.000Z": "Just for you here's @TexasPancake with a side of Peaches. Quote Tweet Courtney McF @court_mcf Replying to @GregAbbott_TX", "2020-01-18T22:53:03.000Z": "The only @Jeopardy question I'll ever get right.", "2020-01-18T20:19:27.000Z": "It's a tremendous honor to receive the Friends of Zion Award.\n\nThis award recognizes global leaders who have supported the nation of Israel & Jewish people.\n\nTogether, we will continue to build an even stronger friendship between Israel, the Jewish community & the state of Texas.", "2020-01-18T08:24:39.000Z": "Congratulations. \n\nWe look forward to working with you. Quote Tweet Giovanni Capriglione @VoteGiovanni Some exciting news to share: I have been appointed Chairman of the Texas House Appropriations Committee - the budget writing committee.\n\nI thank Speaker Bonnen for this opportunity & I look forward to working with my House and Senate colleagues to craft Texas' budget. #txlege", "2020-01-18T01:59:27.000Z": "Politicians love to say Austin is the safest big city in Texas, but 2020's first two weeks proved otherwise. If #atxcouncil ignores the shortage of @austin_police officers  and fails to address the needs of public safety, violent crime will become more common. #thursdaythinker", "2020-01-17T21:49:48.000Z": "\"Why Texans Overwhelmingly Approving of Gov. Greg Abbott Should Worry Dems.\"\n\n\"People want a better way of life so they come here,\" said Kelly Geissler, who moved from Wisconsin.\n\n\"Why would you want to make it like where it was not so good?\"\n\nKeep TX, TX. An Overlooked Reason Why Texans Overwhelmingly Approving of Gov. Greg Abbott Should Worry Dems The current shade of red over Texas doesn't look any more purple. redstate.com", "2020-01-17T19:26:37.000Z": "Cecilia and I laid a wreath in remembrance of the Holocaust victims at the Yad Vashem Museum in Jerusalem. \n\nTexas will always remember and pray for the victims of this horrific time in human history.\n\nWe must work to ensure it never happens again. \n\n... @yadvashem ", "2020-01-17T13:39:26.000Z": "Cecilia & I visited the U.S. Embassy in Israel at its NEW location in Jerusalem. \n\nThanks ... @realDonaldTrump  for moving it to its rightful location. \n\nThanks to ... @USAmbIsrael  David Friedman for the kind hospitality.", "2020-01-17T00:31:52.000Z": "Thank you Texas. \n\nIn a poll taken this week you gave me the highest job approval rating since I've been Governor.\n\n65% approve of the job I'm doing.\n\nI'll continue working for 100% of you. \n\nI'll put you & your families first & I'll emphasize Texas First Policies. #txlege Quote Tweet Jack Fink @cbs11jack #NEW  @GregAbbott_TX campaign tells me new internal poll shows the Governor has 65% job approval rating, highest yet. Campaign says 800 Texans surveyed- 34% in GOP. Poll done after Gov's much- criticized decision that Texas won't resettle new refugees in fiscal yr. 2020. @CBSDFW", "2020-01-16T21:49:32.000Z": "Visiting tonight with Israel Prime Minister @netanyahu about historical locations in Jerusalem. \n\nWe shared our commitment to freedom and security for Israel and the United States.", "2020-01-16T17:57:00.000Z": "Today I prayed at the Western Wall in Jerusalem that God will continue to bless Israel and that God continue to strengthen the bond between Texas and Israel. \n\nMay peace and prosperity continue to bless our two peoples.", "2020-01-16T17:16:27.000Z": "To expand the state's safety initiative around downtown Austin, the Texas Alcoholic Beverage Commission will provide enhanced patrols downtown and near UT. \n\nThis is in addition to the ... @TxDPS  patrols. TABC to provide enhanced patrols downtown and near UT as part of Gov. Abbott's plan Part of enhanced patrols in the area requested by Gov. Greg Abbott, retailers can ask for an undercover TABC agent to be stationed at the business to help prevent illegal or violent activity on the kxan.com", "2020-01-16T15:57:24.000Z": "... @MayorAdler  I can solve you're funding issue in a single day. \n\nGive me one day to cut the outrageous spending of taxpayer money and devote it to homeless issues.\n\nI'll also cut property taxes & slash regulations to make housing more affordable. Austin Mayor Steve Adler looks to Gov. Abbott to provide funding to aid homelessness in Texas A proposal by California Gov. Gavin Newsom that the state spend more than a billion to tackle the homeless crisis has Austin Mayor Steve Adler calling on Texas Gov. Greg Abbott to do the same. fox7austin.com", "2020-01-16T14:04:24.000Z": "This morning I spoke with business innovators at @StartUpNationHq in Tel Aviv, Israel. \n\nThere's a natural connection between Israel & Texas that is leading to an even brighter future. \n\nProud to be here to strengthen our cultural & economic ties.", "2020-01-16T05:15:39.000Z": "Thanks. \n\nIt will be a wonderful visit. Quote Tweet Israel in the Southwest USA @IsraelinHouston We would like to extend a warm welcome to Texas Governor @GregAbbott_TX as he begins his Economic Development Mission in Israel. https:// gov.texas.gov/news/post/gove rnor-abbott-to-lead-economic-development-mission-to-israel-and-switzerland ", "2020-01-15T19:58:17.000Z": "Texas ranks 2nd nationwide in racial progress between blacks, whites; 4th in integration. \n\nWe aim to be #1 but this is good progress. #txlege Texas ranks 2nd nationwide in racial progress between blacks, whites; 4th in integration Though a majority of Americans call race relations in the country \"generally bad,\" some states demonstrate more \"racial progress\" among whites and blacks than others, a new report found. Texas ranks... cbsaustin.com", "2020-01-15T03:31:35.000Z": "Beto was a big shot when all he had to do was skate on a board and say he wasn't Ted Cruz. \n\nWhen he had to take political positions in his presidential campaign he turned into a 1 % candidate. \n\nEven his own party abandoned him as too radical. Quote Tweet Dan Crenshaw @DanCrenshawTX US House candidate, TX-2 Beto - who wants to confiscate your guns, tear down border walls & remove tax-exempt status for churches - is in Houston tonight stumping for my Democrat opponents.\n\nHe's using his fundraising machine, and I need your help to fight it. Please donate: https:// secure.anedot.com/crenshaw/donate", "2020-01-14T23:58:36.000Z": "US House candidate, TX-2 Beto - who wants to confiscate your guns, tear down border walls & remove tax-exempt status for churches - is in Houston tonight stumping for my Democrat opponents.\n\nHe's using his fundraising machine, and I need your help to fight it. Please donate: CRENSHAW FOR CONGRESS I just donated to @DanCrenshawTX - Learn more about his campaign and how you can help! #GOP https://secure.anedot.com/crenshaw/donate - https://secure.anedot.com/crenshaw/donate secure.anedot.com", "2020-01-15T03:26:17.000Z": "Prayers up for these officers who lost their lives in the line of duty. Quote Tweet Gov. Greg Abbott @GovAbbott Flags in @CityofLubbock will be lowered immediately to half-staff in honor of Lt. Eric Hill, Lubbock Fire & Rescue, & Officer Nicholas Reyna, Lubbock Police Department, who were both killed in the line of duty. The First Lady & I extend our prayers to all. twitter.com/cityoflubbock/", "2020-01-15T03:21:02.000Z": "Making a brief stop in Ireland on way to Israel. \n\nWill update tomorrow with some details about our economic development and cultural visit to Israel. \n\nDarn. I guess that means I missed the #DemocraticDebate", "2020-01-14T08:30:28.000Z": "Too funny This Tweet from @yashar has been withheld in response to a report from the copyright holder. https:// Learn more .", "2020-01-14T08:13:04.000Z": "This is helpful information.\n\nSend the date & location where videos or pictures like this are taken & I'll have the Texas Dept. of Transportation send their cleaning crews.\n\nCamping nears roadways is a hazard that must be removed.\n\nThey will make sweeps several times a week. Quote Tweet Matt Neas @Matt_Neas Replying to @GregAbbott_TX Not working @GregAbbott_TX unfortunately", "2020-01-14T00:40:30.000Z": "Texas DPS increases patrols in downtown Austin and around UT. \n\nTexas will do all it can to ensure the safety of residents and visitors in Austin. Texas DPS increases patrols in downtown Austin and around UT The Texas Department of Public Safety is increasing patrols in downtown Austin and around the University of Texas. Governor Greg Abbott made the order after a recent spike in crime. fox7austin.com", "2020-01-13T21:15:14.000Z": "Today I presented the Governor's Medal of Courage to Jack Wilson. \n\nHe's the hero who risked his life to save the lives of others by stopping a gunman in a deadly shooting at a church near Fort Worth. \n\nIt's the highest award given to civilians in Texas. #txlege", "2020-01-13T18:13:37.000Z": "With a stroke of his pen the governor struck a blow against human trafficking, raised hope for thousands of victims who've been trafficked, & sent traffickers a message that the governor has taken a personal interest in combating the crimes they commit. With a stroke of his pen, Gov. Abbott offers hope and redemption to sex slaves in Texas If it's possible for news to come crackling across the internet, that's what happened on Saturday when Gov. Greg Abbott issued a full pardon to Robbie Ann... dallasnews.com", "2020-01-12T04:00:33.000Z": "The values America needs you to believe in are the:\nU.S. Constitution & the \nDeclaration of Independence. Quote Tweet Ilhan Omar @IlhanMN \"With silent lips. 'Give me your tired, your poor, Your huddled masses yearning to breathe free, The wretched refuse of your teeming shore.'\"\n\nThese are the words that welcomed me and millions of refugees. \n\nI still believe in those values.\nWe shall overcome twitter.com/AP/status/1215", "2020-01-12T03:21:15.000Z": "The Governor's Mansion is lit blue tonight for #HumanTraffickingAwarenessDay . \n\nTexans will continue to be on the frontlines of eradicating this terrible injustice and bringing support to the victims.", "2020-01-11T21:17:54.000Z": "A horrible tragedy in Lubbock when police & firefighters were hit responding to accident.\n\nPlease join me in praying for these victims & their families.\n\nWe must never forget our First Responders & the risks they take every time they put on their uniform. Firefighter, police officer struck, killed while working wreck on I-27 A Lubbock firefighter and police officer are dead and one firefighter remains in serious condition after they were struck by a vehicle while working a wreck on Saturday morning. kcbd.com", "2020-01-11T19:19:24.000Z": "One way to celebrate #HumanTraffickingAwarenessDay is to provide redemption for victims of it.\n\nI'm doing that by granting a pardon for a woman who was lured into human & sex trafficking that led to some petty criminal offenses.\n\nShe turned to God & turned her life around.", "2020-01-11T16:22:03.000Z": "Today is #HumanTraffickingAwarenessDay . \n\nTexas will not tolerate the inhumane practice of human trafficking.\n\nTogether, with the help of our brave law enforcement officers, we will end this heinous crime & deliver justice for survivors.", "2020-01-11T00:33:09.000Z": "TEXANS across most of the state may see warnings like this tonight because of severe weather.\n\nTake precautions to be safe. @TDEM has placed boats helicopters, rescue & medical strike teams, & add'l law enforcement on standby to help local government respond to your needs. Quote Tweet Doug Dunbar @cbs11doug Tarrant county, please don't drive right now. Worst of the line moving through. Tornado warned section timeline shows these arrival times for the part of the storm with a history of rotation.", "2020-01-10T17:04:56.000Z": "On Monday I will present the Governor's Medal of Courage to man who stopped a gunman in a deadly shooting at a church in North Texas. \n \nIt is the highest award given to civilians by the Governor. Gov. Abbott to present Governor's Medal of Courage to man who shot church gunman AUSTIN, Texas (KEYE) - Governor Greg Abbott will present the Governor's Medal of Courage to the man who stopped a gunman in a deadly shooting at a church in North Texas last month. Jack Wilson is the... cbsaustin.com", "2020-01-10T15:32:31.000Z": "Texas is #1. \n\nOnce again Texas leads the nation for the fastest growing state economy in the U.S. \n\nThanks to our employers and the best workforce in America. #txlege", "2020-01-10T04:17:26.000Z": "The Texas Department of Public Safety didn't wait until Monday to start downtown patrols. \n\nThey began...Tonight. \n\nThe goal is to help you be safe. \n\nThanks ... @TxDPS ", "2020-01-10T04:06:16.000Z": "Here's some good news:\n\nRates of new cancer cases and deaths from cancer continue to decline in Texas. Recent data shows rates of new cancer cases, deaths continue to decline in Texas The new data also includes estimates for the causes of new cancer cases and deaths for the year ahead. communityimpact.com", "2020-01-10T03:21:32.000Z": "On this Law Enforcement Appreciation Day I'm especially grateful for my niece & all she does to keep her community safe. \n\nI'll always #BackTheBlue . #LawEnforcementAppreciationDay", "2020-01-10T01:54:40.000Z": "Priceless. Quote Tweet Pat Sajak @patsajak I'm sick of hearing how we celebrities are in some kind of bubble and we don't understand real life. When I'm out in public and people approach me, I'm always interested in what they have to say to my security detail.", "2020-01-09T20:20:40.000Z": "Today is Law Enforcement Appreciation Day. \n\nThank you to the brave men and women who who risk their lives to keep Texas safe today and everyday. We are grateful for your service.\n\nMay God bless you and God bless Texas. #BacktheBlue From Gov. Greg Abbott", "2020-01-09T19:37:43.000Z": "I'm heartbroken about stories I hear about dangers around downtown Austin.\n\nTo improve safety DPS is increasing law enforcement presence around UT & the Capitol area. \n\nYour voice matters. Share your story about any danger you've encountered downtown. Gov. Abbott increases DPS law enforcement presence around UT, Downtown Austin after stabbings Abbott once again criticized the City's handling of homelessness by asking, \"How many people will be killed and injured before Austin reforms its homeless policies?\" kvue.com", "2020-01-09T17:15:21.000Z": "Yesterday in Pleasanton, Texas I met with leaders from Atascosa County for another Grassroots Roundtable. \n\nOn behalf of the state of Texas, we awarded Shifter's American Grill an award of excellence.\n\nKeep up the great work & thank you for your leadership in the Lone Star State.", "2020-01-09T04:00:08.000Z": "Rolling it tonight at Punch Bowl Social.", "2020-01-09T01:56:00.000Z": "Today I spoke with leaders of the Rotary Club of San Antonio.\n\nTexas continues to be the most exceptional state in America because of organizations like the Rotary Club of San Antonio.", "2020-01-08T23:56:12.000Z": "ANOTHER stabbing in downtown Austin-where both the suspect & victim are said to be homeless.\n\nHow many people will be killed and injured before Austin reforms its homeless policies? \n\nI will have DPS increase law enforcement around downtown & UT areas. Man hospitalized after stabbing in downtown Austin Police and paramedics are responding to downtown Austin after a man was stabbed Wednesday morning. kxan.com", "2020-01-08T17:01:30.000Z": "Attempted cyber attacks from Iran against Texas agency websites are occurring about 10,000 per minute.\n\nAll government agencies at all levels-as well as the private sector-must remain vigilant in securing their networks from potential attacks. #txlege Abbott: Cyberattacks increase from inside Iran Websites belonging to Texas agencies have seen an increase in attempted cyberattacks coming out of Iran, amounting to about 10,000 per minute, in the previous two days, Gov. Greg Abbott said Tuesda... statesman.com", "2020-01-08T01:16:59.000Z": "Special Operations Joint Task Force members from Texas who served in the Middle East presented this Texas Flag that they flew in Syria during their duty. \n\nWe thank all who serve. \n\nAnd we take pride when the sovereignty of Texas is displayed across the globe.", "2020-01-07T20:47:58.000Z": "This is Nihar Janga. He is an Austin, TX native attending Vandegrift High School.\n\nNihar is the first contestant in history to win BOTH the Scripps National Spelling Bee & the National Geographic Bee.\n\nProud of your accomplishments & proud you're a Texan!", "2020-01-07T03:19:13.000Z": "DO IT!!!!!! Quote Tweet Chip Roy @chiproytx US House candidate, TX-21 Hey Austin... federalism notwithstanding, I'm thinking about a bill banning cedar.  Just toying with the idea.......", "2020-01-07T01:07:05.000Z": "Beautiful day here in Texas for a front porch interview.\n\nThanks for coming by to chat today, @ChetTripper . @TexasPancake and I enjoyed it.\n\nLooking forward to seeing the final product.", "2020-01-06T23:22:17.000Z": "Business Facilities' Editor: \nTexas Dominated The DECADE\n\n\"Texas has established the most dynamic state economy in the nation by diversifying its growth sectors and developing a rapidly expanding skilled workforce.\" #txlege Business Facilities' Editor: State Of The Year Texas Dominated Decade Editor in Chief Jack Rogers tells News Radio 1080 KRLD that Texas' 2019 State of the Year win is a fitting coda for its dominance in economic development. businessfacilities.com", "2020-01-06T02:08:33.000Z": "Bail reform is needed.\n\nBUT, it shouldn't be used to release violent offenders back onto the streets.\n\nThis editorial shows how violent criminals are sometimes released to the streets with little or no bail requirement.\n\nThat dangerous practice must end. Dallas needs bail reform, but not a policy that puts violent offenders back on the streets Imagine a mother arrested for shoplifting groceries languishing in the county lockup because she can't afford the bail to get out. While she sits in jail,... dallasnews.com", "2020-01-05T22:24:57.000Z": "A new report shows the Texas economy remains robust going into 2020.\n  \n\"business conditions continue to improve and a majority of services firms expect stronger revenues in 2020\"\n\nThanks to Texas business owners & the best workforce in America. #txlege Dallas Fed: Growth in Texas service sector accelerates, retailers optimistic A new report offers more signs that the Texas economy remains robust going into 2020.Texas service sector activity grew at a faster pace in December, with retail sales growth quickening, according to... statesman.com", "2020-01-05T04:47:04.000Z": "EXACTLY!!! Quote Tweet Dan Crenshaw @DanCrenshawTX US House candidate, TX-2 Ok, I'll take this one:\n\n1. They just attacked our Embassy \n2. War Powers Resolution\n3. Disrupt their systematic escalation of violence against us and ensure they know attacks will be met with consequences. \n\nPretty simple. twitter.com/RepSwalwell/st", "2020-01-05T02:18:29.000Z": "O.J. killed the @BuffaloBills chances of winning by leaving the game early. Quote Tweet O.J. Simpson @TheRealOJ32 I should know better.", "2020-01-05T01:16:29.000Z": "...Deshaun Watson is the GOAT. What a comeback by the #HoustonTexans . \n\nTrue magic the way Deshaun played and strong defense by ... @JJWatt . @deshaunwatson  \n... @HoustonTexans ", "2020-01-04T21:23:30.000Z": "Congrats to Dallas ISD's Eric Hale Being One of the America's Best Teachers.\n\nHe's helped DISD be one of the best urban ISDs in America.\n\nHe advised me about reforms we passed into law that pay more to attract great teachers & how to improve our schools. DISD's Eric Hale Is One of the Nation's Best Teachers - D Magazine And it's partly because of his dancing. dmagazine.com", "2020-01-04T17:49:04.000Z": "You are exactly right.\n\nI'm not attacking homelessness.\n\nI'm criticizing the lawlessness promoted by the City of Austin.\n\nThe City's top job is public safety and they are failing. \n\nYesterday's tragic murder is the most recent example. Quote Tweet Baba blacksheep @Bababla30871237 Replying to @DGarzaforD2 What is really tragic @DGarzaforD2 is the fact that your policies are enabling these drug addicts to attack innocent people. Your placing blame on @GregAbbott_TX is shameful and disgusting.Electing you for County Attorney would be an epic mistake. #VoteHerOut  #Atxcouncil  #failure", "2020-01-04T17:24:00.000Z": "This is a savage-and spot on-exposure of hypocrisy @CNN . \n\nMark, let us know when you hear from them. Quote Tweet Mark Davis @MarkDavis Dear #CNN :  Please tell me what #Obama was gnawing on as his piles of cash were delivered to #Iran . #Soleimani", "2020-01-04T04:06:13.000Z": "Exactly. \n\nThis murder must be condemned by Austin leaders. \n\nAn innocent person lost their life this morning at a restaurant & others injured\n\nThe City of Austin must ensure its homeless policy doesn't endanger the lives of innocent people-AND the lives of the homeless. Quote Tweet rudy koski @KoskionFOX7 A high ranking source at APD just told me, The 27-year-old man in custody for the Violent knife attack at Freebirds in South Austin Friday morning is a homeless/transient with a violent criminal history. @fox7austin", "2020-01-03T23:06:09.000Z": "When all facts are revealed I bet you'll learn that the killer was a homeless man with prior arrests.\n\nIf so Austin's reckless homeless policy puts lives in danger to murders like this.\n\nAustin leaders must answer for their perilous policies. SOUTH AUSTIN STABBING: Authorities believe attack that left 1 dead was random A man stabbed one person to death and injured others Friday morning in a random attack that began at a South Austin cafe and ended at a burrito shop, where he jumped from the roof and was eventually... statesman.com", "2020-01-03T19:18:51.000Z": "Texas is #1 in America-AGAIN. \n\nTexas Is Business Facilities' 2019 State Of The Year. \n\nTexas is the first state to win the top honor for the 4th time. \n\nIt's goes to the best state for things like capital investment and new jobs. #txlege Texas Is Business Facilities' 2019 State Of The Year Business Facilities has named Texas its 2019 State of the Year, making it the first state to win the magazine's top honor four times. businessfacilities.com", "2020-01-03T16:25:37.000Z": "This is the good guy with a gun who stopped a bad guy with a gun at the church in White Settlement. \n\nIt took 6 seconds. \n\nHe saved countless lives. \n\nHe is Jack Wilson and a true Texas hero.", "2020-01-03T02:19:55.000Z": "Greater love has no one than this: to lay down one's life for one's friends. John 15:13\n\nRich White lived that teaching when he gave his life saving others from an evil gunman at a Fort Worth area church.\n\nHe's a true Texas hero. Greg Abbott praises church victim: 'Only God knows' who's alive because of Rich White Gov. Abbott made everyone a promise. star-telegram.com", "2020-01-02T03:44:28.000Z": "This is so cool. #HookEm Quote Tweet Sam Ehlinger @sehlinger3 The last Texas football game I got to go to with my Dad was the Alamo Bowl in 2012. I know he was there again with me last night. \n\nGod is great. #AO1", "2020-01-02T03:39:13.000Z": "The post below is from the Webb Co. Sheriff in Laredo. \n\nThe Texas Dept. of Public Safety is already in the area and will work with law enforcement at all levels to maintain safety & security in Texas.", "2020-01-01T22:04:22.000Z": "This DMN editorial is spot on in so many ways.\nHere's one:\n\n\"there have been at least two church shootings in Texas in recent years that ended because law-abiding citizens had the means and willingness to fight back.\"\n\nTexans will not cower to criminals. A church shooting near Fort Worth ends because good guys with guns fought back On Sunday, the kind of news no one wants to see slid across the landscape. There was a shooting at a church in White Settlement outside of Fort Worth, and... dallasnews.com", "2020-01-01T05:41:20.000Z": "Happy NEW YEAR!!!!\n\n2019 was a record setting year for Texas. \n\n2020 will be even better. \n\nGod Bless Texas.", "2019-12-31T17:22:23.000Z": "Texas had the biggest population increase of any state in America last year.\n\nThe beauty of American government is that people can live in the state they like best & that provides the best opportunity.\n\nThat state is Texas with our conservative policies. As Nation's Population Growth Slows, Texas Sees A Jump Texas had the biggest increase in population of any state in the country in the last year, according to estimates released Monday by the U.S. Census Bureau kut.org", "2019-12-30T20:53:17.000Z": "This man confronted an evil killer in a Texas church.\n\nHe could have been killed in a split second. \n\nInstead he saved the lives of hundreds.\n\nPutting your life on the line for others is the ultimate valor.\n\nTexas is grateful for his herorism. #txlege Jack Wilson, Texas Church Shooting Hero: 5 Fast Facts You Need to Know Jack Wilson revealed that he shot and killed the gunman at the West Freeway Church of Christ in White Settlement, Texas. He is being declared a hero. heavy.com", "2019-12-30T04:26:20.000Z": "Heroism.  Texan. Quote Tweet Jason Whitely @JasonWhitely Six seconds is as long as it lasted at the church shooting this morning. For as many people there who were armed - one clearly had recurrent training, knew what to do and fired the fatal shot immediately ending the threat. That's heroism.", "2019-12-29T21:31:21.000Z": "Thanks to security at the church in White Settlement for swiftly ending the attack.\n\nWe're working with local law enforcement & elected officials to ensure they have all resources needed to respond to this event.\n\nTexans will unite as always. 3 Dead After Shooting At West Freeway Church Of Christ In White Settlement Three people are dead, including the gunman, after a shooting at a church in the Tarrant County city of White Settlement, officials said. dfw.cbslocal.com", "2019-12-29T09:33:45.000Z": "This. \nIs. \nInsane. Quote Tweet Barstool Sports @barstoolsports GET IN THE HOLE @foreplaypod (via ig:jaden_cantafio)", "2019-12-29T01:15:11.000Z": "Coming Soon. \n\nTexas' very own gold depository is about to open. Texas Bullion Depository to open in Leander in early 2020 Construction on the Texas Bullion Depository, located off Heritage Grove Road, began at the end of 2018 and is anticipated to be complete in the next couple months communityimpact.com", "2019-12-28T23:54:17.000Z": "45 minutes ago. https:// twitter.com/OnceALeo_Alway s/status/1211072255431708673  This Tweet is unavailable.", "2019-12-28T23:50:38.000Z": "So. When does @LSU pull Joe Burrow?\n\nAsking for a fan. #LSUvsOU Quote Tweet CFB Home @CFBHome Burrow now with 8 total touchdowns. \n\nLSU leads 56-14 over Oklahoma early in the 3rd Quarter. #CFBPlayoff", "2019-12-28T23:07:45.000Z": "100% Quote Tweet Barstool Sports @barstoolsports When you let your friend pour your drink for you and it's 95% Alcohol, 5% mixer https:// twitter.com/buitengebieden _/status/1210635647372996608/video/1 ", "2019-12-28T10:10:48.000Z": "Thanks to the Border Patrol & local law enforcement for remaining vigilant in securing our border from sex offenders & MS-13 gang members. \n\n... @CBP  Sex offenders, MS-13 gang member nabbed near border checkpoints U.S. Border Patrol agents in Arizona and Texas stayed busy before and after Christmas, nabbing three sex offenders and an MS-13 gang member near inland checkpoints. borderreport.com", "2019-12-28T03:08:49.000Z": "This is Texas. Quote Tweet Drew Springer @DrewSpringer Took @katespringer_ out coyote hunting this evening. No dogs but a beautiful sunset. #txlege", "2019-12-27T21:58:39.000Z": "We appreciate our Texas Military Dept. and thank them for their service & sacrifice, especially at this time of year. @TXMilitary Quote Tweet Texas Military Dept @TXMilitary Our TMD troops are sacrificing the holiday season with their families so that we can spend it safely in Texas with ours. Especially at this time of the year, remember that freedom isn't free. https:// stripes.com/news/middle-ea st/troops-in-afghanistan-find-ways-to-cope-with-christmas-away-from-home-1.612410 ", "2019-12-26T23:43:29.000Z": "Headed into 2020 like:", "2019-12-26T20:20:22.000Z": "The Republic of Texas is getting closer to being memorialized in Washington. #txlege Memorial would honor Republic of Texas diplomacy in Washington WASHINGTON - While the brief, colorful history of the Republic of Texas is well known, giving bragging rights to the state that was a country, less known is its diplomatic corps, which established... statesman.com", "2019-12-25T21:14:53.000Z": "As we celebrate Christmas at home, we pray for our military deployed overseas. \n\nThanks to the mightiest military in the history of the world we have the freedom to enjoy Christmas. \n\nMay it forever remain that way.", "2019-12-25T11:15:46.000Z": "Cecilia, Audrey & I wish you and your families a very Merry Christmas.", "2019-12-24T23:38:37.000Z": "", "2019-12-24T17:49:37.000Z": "LOCK HIM UP\nLOCK HIM UP Quote Tweet CBS News @CBSNews BOOKED AND CHARGED: The Grinch tried to steal Christmas in Pascagoula, Mississippi today, but police captured and charged him with Interruption of Merriment and attempted theft of Christmas", "2019-12-24T17:01:20.000Z": "Early Christmas present:\nTexas employers add 37,500 jobs in November.\n\nThe unemployment rate remains at record low 3.4 % for a sixth consecutive month.\n\nEven better, the low unemployment rate has boosted wages for employees. #txlege Texas employers add 37,500 jobs as key sectors carry state through energy woes The state's unemployment rate remained at its historic low of 3.4 percent last month. houstonchronicle.com", "2019-12-24T00:12:36.000Z": "You're post explains why we need to  teach civics. \n\nSBOE members are elected by the people. Voters put them in office.  (See below)\n\nThere's so much like this, as well as constitutional & capitalism principles, that we must teach. https:// tea.texas.gov/About_TEA/Lead ership/State_Board_of_Education/SBOE_Board_Members  Quote Tweet steve eagle @steveeagle2 Replying to @GregAbbott_TX Would be easy if you appoint scholars and teachers to the SBoE, instead of the idiots that believe the world is 4000 years old.  That blame lands squarely in YOUR lap.", "2019-12-23T22:23:19.000Z": "We need to do a better job of teaching civics in school. \n\nWell add this to the list for next legislative session. Quote Tweet Rasmussen Reports @Rasmussen_Poll Among voters who believe most Americans know how their #government works, 22% wrongly say a #president can be impeached by his opponents just because they disagree... http:// bit.ly/2MhYecD", "2019-12-23T22:18:30.000Z": "The adoption of communistic & socialistic policies by elected officials is growing-at the local level (like in this video)-as well as in Congress & in the presidential campaign. \n\nI'll continue to combat these threats in Texas whenever they arise. \n\nWell keep Texas, Texas. Quote Tweet Sean Shannon Collier @ReillocNaes Democrats https:// twitter.com/Serremmy/statu s/1140600454876786689/video/1  Show this thread", "2019-12-23T17:31:17.000Z": "The new USMCA trade agreement advanced by Trump could add over 200,000 local jobs.\n\nThe USMCA is great for Texas. #txlege  https:// kgns.tv/content/news/N ew-trade-agreement-projects-over-200000-local-jobs-566385901.html ", "2019-12-23T17:24:50.000Z": "Texas First Lady Cecilia Abbott Address Philanthropy Group at Brownsville ISD to Inspire Their Communities.\n\nMy wife and I are dedicated to advancing the #RGV . #txlege Texas First Lady Address Philanthropy Group at Brownsville ISD to Inspire Their Communities krgv.com", "2019-12-23T01:17:39.000Z": "Tonight we celebrated the beginning of Hanukkah with the lighting of the Menorah at the Texas Capitol. #HappyHanukkah", "2019-12-22T22:48:55.000Z": "Here's something you'll never see in Texas.", "2019-12-22T19:26:06.000Z": "Happy birthday to the Zodiac Killer. \n\nHere's to many more years of evading arrest. @tedcruz", "2019-12-22T17:39:29.000Z": "An early transformation of Texas into the dominant state it has become. Quote Tweet Traces of Texas @TracesofTexas The Texas state capitol dome under construction in Austin, 1887.  What an awesome historical photo!", "2019-12-22T17:20:34.000Z": "While all eyes in Washington focused on impeachment the Senate continued to confirm more conservative judges to federal courts.\n\nThese are judges who enforce the rule of law.\n\nTrump is transforming federal courts at a near record breaking pace. Trump's transformation of the courts barrels onward WASHINGTON (AP) - Amid intense focus on impeachment and year-end deals on spending and trade, the Senate hurtled this week toward a less-heralded accomplishment: confirming another batch of... apnews.com", "2019-12-22T00:50:52.000Z": "We honored this Daughter of the American Revolution member with the Yellow Rose of Texas Award ( on).", "2019-12-21T22:49:01.000Z": "Congratulations @HoustonTexans winning the South Division. \n\nOutstanding year. \n\nGood luck in the playoffs. #Texans Quote Tweet Houston Texans @HoustonTexans AFC SOUTH CHAMPIONS  #WeAreTexans", "2019-12-21T21:11:54.000Z": "EVERY community in EVERY State must collaborate to eradicate MS-13. \n\nNo sanctuary anywhere. \n\nLet's end this treacherous gang. \n\nMassive MS-13 bust: 96 members charged in gang takedown Massive MS-13 bust: Officials charge 96 members in gang takedown Authorities dealt a staggering blow to the murderous MS-13 gang -- busting 96 members and associates in the largest takedown of the notorious criminal group in New York State history. nypost.com", "2019-12-21T18:08:37.000Z": "Just in time for the holidays.\n\nMore Fritos in Texas. \n\nFrito-Lay's Texas facility set for $128 million expansion. Frito-Lay's Rosenberg facility set for $138 million expansion Officials from Frito-Lay recently announced plans for an $138 million expansion of the Frito-Lay facility in Rosenberg. The Fort Bend County Commissioners Court approved a tax abatement agreement... chron.com", "2019-12-21T07:52:55.000Z": "It's Texas High School Football-so, yeah. \n\nEverything's bigger in Texas. #txhsfb Quote Tweet Barstool Sports @barstoolsports If this isn't the greatest trick play in kickoff return history we don't know what is", "2019-12-20T17:37:11.000Z": "Seems like they hate puppies. \n\nI'm keeping Pancake-the First Dog of Texas. @TexasPancake Quote Tweet The Daily Wire @realDailyWire Environmentalists: To Save The World, Dump Your Pets http:// bit.ly/2OdQJSc", "2019-12-20T17:29:01.000Z": "Texas remains America's leader for new jobs.\n\nTexas posts 115th straight month of jobs gains.\n\nTexas led the nation adding 37,500 new jobs in November.\n\nUnemployment held steady at a historic low rate of 3.4% for the sixth straight month. #txlege Texas records 115th straight month of jobs gains in November Texas employers created 37,500 new jobs in November, marking the 115th straight month of gains, and unemployment held steady at a historic low rate,... dallasnews.com", "2019-12-20T05:07:36.000Z": "Smokey Bear stopped by the Governor's Office today.\n\nWe are celebrating his 75th birthday.\n\nFor 75 years Smokey has done a great job promoting and protecting our forests. \n\nBut remember...\nOnly you can prevent forest fires!\n\n... @smokey_bear ", "2019-12-20T03:36:31.000Z": "Texas is No. 2 on Forbes' 2019 Best States For Business ranking.\n\nSecond is not good enough!\n\nWe're going to have to find more regulations & taxes to cut. #txlege  http:// tylerpaper.com  https:// tylerpaper.com/news/texas/tex as-lands-no-on-forbes-best-states-for-business-ranking/article_f558a89f-e733-58c7-92eb-00575b6bc6bb.html  tylerpaper.com | inform. inspire. involve. tylerpaper.com", "2019-12-19T23:45:55.000Z": "Today I thanked workers who continue cleaning under bridges in Austin & providing the homeless with a more dignified location.\n\nThey've made Austin safer & cleaner while also providing better alternatives for the homeless.\n\nThanks ... @TxDOT  ... @TxDPS  & ... @TDEM ", "2019-12-19T04:41:32.000Z": "CONGRATULATIONS Refugio on winning the State Championship. #txhsfb Quote Tweet Dave Campbell's Texas Football - TexasFootball.com @dctf Refugio is back on top with #UILState title No. !\n\nCongratulations to the 2019 2A DI Champions. Show this thread", "2019-12-18T06:01:55.000Z": "OMG\nSupreme Court Justice Gorsuch said \"Merry Christmas\"\n\nIMPEACH!!!IMPEACH!!!\n\nWhat a joke. Quote Tweet Amee Vanderpool @girlsreallyrule Supreme Court Justice Neil Gorsuch just appeared on Fox and Friends this morning, making a point to parrot the \"Merry Christmas\" talking point of the GOP. If he's willing to go on Fox and throw a shout out to Republican narratives, what ele is he willing to do?", "2019-12-17T06:40:44.000Z": "Big Govt doesn't work.\n\nFreelance writers at Vox Media will lose jobs b/c a new CA law reclassified contractors as employees.\n\nThe law targeted companies like Uber & Lyft to treat free-lance workers to be hired as employees with full benefits. Vox Media to cut hundreds of freelance jobs ahead of changes in California gig economy laws Vox, which owns the sports site SB Nation, is informing freelancers that they'll be losing their jobs when AB5 kicks in next year. cnbc.com", "2019-12-17T03:20:10.000Z": "100%\n\n\"Gov. Greg Abbott says he'll propose law where there's 'no bail for cop killers'\" Gov. Greg Abbott says he'll propose law where there's 'no bail for cop killers' Advocates say the fundamental problem with Texas' bail system is that whether a person is released from jail often hinges on how much money they have. kxan.com", "2019-12-17T02:53:19.000Z": "I'm telling ya.\n\nThis just might be better than the original #TopGun Quote Tweet Tom Cruise @TomCruise See you in the sky. #TopGun", "2019-12-17T01:33:28.000Z": "At the DRC I explained property tax cuts already made:\n\nFrisco ISD cut rates by 7.5%\nRichardson ISD by 8.5%\nDallas ISD by 8.5%\n\nThose property tax cuts won't be eroded by rising valuations because ISDs are capped at a 2.5% property tax revenue increase. #txlege Quote Tweet Greg Abbott @GregAbbott_TX Today at the @DRC 's State of the State Luncheon we discussed the significant economic growth achieved throughout the Dallas region. \n\nOur economy is booming, keeping Texas the best place to live. #txlege  #DRCSOTS19", "2019-12-16T22:19:15.000Z": "Tired of waiting in line to get your driver license?\n\nYou can book an appointment as much as 6 months in advance and avoid the wait. \n\nIf you don't want an appointment, DPS is working to reduce wait times. #txlege This 2020 DPS change could be everything when it comes to getting your driver license The Texas Department of Public Safety is aiming to have Texas drivers spend less time in line at the Driver License office in the new year. abc13.com", "2019-12-16T00:57:25.000Z": "Today we celebrate the Bill of Rights. \n\nThey GUARANTEE your freedoms are safeguarded from government. \n\nWe must be forever vigilant to preserve this rights.\n\nTo learn how I've done this check out my book, Broken But Unbowed.", "2019-12-15T22:07:54.000Z": "Texas supports our military and their families. \n\nA new law will allow military spouses moving to Texas to continue to use their out-of-state occupational licenses. New bill recognizes out-of-state occupational licenses of military spouses A new bill will allow military spouses moving to Texas to continue to use their out-of-state occupational licenses. kxxv.com", "2019-12-15T20:19:46.000Z": "The Dallas area is helping propel the powerful Texas economy.\n\nTexas added about 300,000 new jobs in past year.\nAbout 1/3 of those were in the Dallas area.\n\nThe Texas unemployment rate is at a record low of 3.4 % with DFW's rate even lower at 3.1 %. Governor: DFW engine drives powerful Texas economy Governor Abbott called the Dallas-Fort Worth area \"the most powerful economic region in the entire United States of America.\" wfaa.com", "2019-12-15T05:22:51.000Z": "700,000 people fled California last year.\n\nSEVEN  HUNDRED  THOUSAND.\nIn one year.\n\nAlmost 90,000 of them came to Texas.\n\nA good majority of them voted Republican.\n\nYou'll be in good company here.\n\nAlso, like you, my brother served in the @Navy .\nStationed right there in Corpus. Quote Tweet NavyCombatCorpsman @combatcorpsman Replying to @GregAbbott_TX @Eliza69611490 I'm proud that @GregAbbott_TX is soon going to be my governor. Moving out of Fartbox (SF), California to Corpus Christi and I just cannot wait.", "2019-12-15T02:13:34.000Z": "Congratulations to my High School-Duncanville-on returning to the State Championship. #txhsfb championship. Quote Tweet SportsDayHS @SportsDayHS For the second straight year, Duncanville will play for a #txhsfb championship! They'll face the winner of Galena Park North Shore and Lake Travis. Story: https:// dallasnews.com/high-school-sp orts/football/2019/12/14/duncanville-advances-to-second-straight-championship-game-with-56-14-win-over-rockwall/  Box score: https:// dallasnews.com/high-school-sp orts/dfw/football/boxscore/2019/138408 ", "2019-12-15T01:33:01.000Z": "Great to have you here. \n\nI was once a College Republican. \n\nMaybe one of you will someday be Governor. Quote Tweet Texas College Republicans @txfcr Today, the College Republicans had the opportunity to visit the Governor's Mansion and spend time with @GregAbbott_TX and @TexasFLCA . The First Family of Texas says Merry #Christmas ! #txlege", "2019-12-14T22:28:11.000Z": "Lighten up dude.\n\nIt's a line ripped off of the Pace Picante Get A Rope Commercial https:// youtu.be/mX2AyjVrrck via @YouTube .\n\nPut a smile on your face. \nGo to @Whataburger & order a double with cheese & jalapeños.\n\nBe sure to choose the spicy ketchup!\nTell them @drpepper sent you. This Tweet is unavailable.", "2019-12-14T22:00:59.000Z": "Get a rope. Quote Tweet Josh Woosley @Joshwoos Whataburger was OUT of Dr. Pepper this morning @GregAbbott_TX what are you going to do about this", "2019-12-14T20:15:42.000Z": "... @ArmyVsNavy  \n\nThe winner is the United States of America. \n\nThanks to all who serve.", "2019-12-13T13:45:12.000Z": "Replying to @ToddJeffries  @austintexasgov  and 3 others @MayorAdler was the mastermind behind a propaganda campaign designed to ensure @GregAbbott_TX homeless plan failed.  It's all right here.  Bonus feature:  Adler uses his gmail account to setup the meeting.  Lol.", "2019-12-14T02:27:02.000Z": "25 Million Evangelical Christians are not registered to vote. We are working hard to get them registered! @robertjeffress  @LouDobbs", "2019-12-14T01:06:23.000Z": "This is an excellent course correction.\n\nThere should be no bail for Cop killers. \nPeriod.\n\nI'll propose this law next session. #BackTheBlue  #txlege  https:// chron.com/news/houston-t exas/houston/article/outrage-nassau-bay-cop-killer-bond-HPD-14904021.php?utm_campaign=CMS%20Sharing%20Tools%20(Desktop)&utm_source=t.co&utm_medium=referral  via @houstonchron Suspect in officer's death held without bond after flap over initial bond amount A Harris County district judge on Friday set no bond for a man charged with capital murder in the death of a Nassau Bay police sergeant, quelling concern that the suspect - who has pending cases in... chron.com", "2019-12-13T21:51:23.000Z": "Today I met with Consul General @p_marentes to discuss the USMCA trade deal. \n\nThis will be great for jobs in Texas. \n\nThanks to @realDonaldTrump for getting the USMCA deal done.", "2019-12-13T18:42:03.000Z": "Happy Birthday @USNationalGuard . Thank you keeping us safe and assisting in times of need. \n\nWe appreciate your continued service to our country. #Guard383", "2019-12-13T16:06:50.000Z": "The bail reform I pushed last session would prevent cop killers like this from getting out.\n\nLiberals prevented it from passing. \n\nI'll continue to advance laws that protect law enforcement & keep dangerous killers off the street. #BackTheBlue  https:// twitter.com/Breaking911/st atus/1205330496424759296  This Tweet is unavailable.", "2019-12-13T02:55:08.000Z": "Texas continues to be the most exceptional state in the nation... \n\n& that's how we roll. This media has been disabled in response to a report by the copyright owner.", "2019-12-12T23:40:06.000Z": "Today at the @DRC 's State of the State Luncheon we discussed the significant economic growth achieved throughout the Dallas region. \n\nOur economy is booming, keeping Texas the best place to live. #txlege  #DRCSOTS19", "2019-12-11T19:47:47.000Z": "Twice as many Texas Republican WOMEN are running for Congress in 2020.\n\nMost are women of color.\n\nAll promote our core conservative values. @TexasGOP  #txlege Twice as many Texas Republican women running for Congress in 2020 At least 30 Republican women from Texas have filed to run for election to Congress next year, more than twice as many as in the 2018 elections. houstonchronicle.com", "2019-12-11T04:44:24.000Z": "Texas Tech commands the stage!\n\nCongrats Texas Tech Men's Basketball beating a #1 team for the first time.\n\nIt won't be the last! #WreckEm  @TexasTechMBB  @TexasTech Quote Tweet Texas Tech Basketball @TexasTechMBB Reports of our demise were greatly exaggerated. #4To1 | #WreckEm", "2019-12-11T03:15:31.000Z": "Happy Birthday number 5 to the First Dog of Texas. @TexasPancake  #DogsofTwitter", "2019-12-11T00:43:14.000Z": "Here in Lockhart, the BBQ capital of TX, for a grassroots roundtable with leaders of Caldwell County.\n\nAnd there is nothing better than some tremendous TX BBQ. @KreuzMarket", "2019-12-10T17:02:52.000Z": "U.S. wind capacity hits 100 gigawatts; Texas is the #1 wind state.\n\nIf Texas were a country, it would rank #5 in the WORLD for wind power. #txlege US wind capacity hits 100 gigawatts; Texas is No. 1 wind state The nation has reached a new milestone with 100 gigawatts of installed wind energy capacity, with more than half of that installed in just the past seven years, according to the Department of Energy. chron.com", "2019-12-10T02:34:21.000Z": "Wait for it. \nWAIT FOR IT!!!\n\n... @TexasPancake  brings you Feliz Navidad. #DogsofTwittter  #dogsofinstagram", "2019-12-09T21:59:36.000Z": "U.S. Hiring Strengthened in November, Fueling Economic Expansion.\n\nEmployers added 266,000 jobs, unemployment rate drops to 50-year low of 3.5%.\n\nThe Texas economy is even stronger!\n\nOur unemployment rate is lower & we are powering America's job growth. U.S. hiring strengthened in November, fueling expansion The U.S. job market strengthened in November, as hiring jumped and unemployment fell to a half-century low, adding fuel to the economic expansion. apple.news", "2019-12-09T20:54:38.000Z": "The State of Texas is working to eradicate human trafficking. \n\nI signed more than 20 laws to crack down on human trafficking & help the victims of this crime. #EndHumanTrafficking Texas Nonprofit Building Human Trafficking Data Platform Texas Nonprofit Building Human Trafficking Data Platform apple.news", "2019-12-09T03:55:49.000Z": "The Capitol Christmas Tree was officially lit last night.\n\nMerry Texas Christmas.", "2019-12-09T01:06:06.000Z": "A record number of children were adopted from Texas foster care this past year.\n\nA record was also set for foster care adoptions by relatives.\n\nImprovements at @TexasDFPS are yielding impressive results.\n\nThanks to all families who adopt these children. Record number of children adopted from Texas foster care system, new figures show Children's advocate praises state's effort to place more foster kids in homes with family members. caller.com", "2019-12-08T18:14:55.000Z": "With God, all things are possible. \n\nMatthew 19:28", "2019-12-08T03:27:22.000Z": "Our hearts are heavy tonight as a Houston Police Officer was killed in the line of duty.\n\nSend prayers to lift up the family of this slain officer.\n\nTonight & Every Night we Back The Blue in Houston & across Texas. #BackTheBlue  @HoustonPolice Houston Police Sergeant Shot and Killed; Suspect in Custody A Houston police officer was shot and killed Saturday evening by a man who had been reported for assault, authorities said. Houston Mayor Sylvester Turner announced Sgt. Christopher Brewster's death... nbcdfw.com", "2019-12-08T02:22:05.000Z": "My dog Peaches. \n\nAnd cookies that look like Peaches.", "2019-12-07T19:59:51.000Z": "Socialism always fails. Quote Tweet Turning Point USA @TPUSA TRUTH, @charliekirk11 ! Socialism Fails EVERY. SINGLE. TIME. #SocialismSucks", "2019-12-07T17:41:15.000Z": "78 years ago America was attacked at Pearl Harbor.\n\nWe will never forget the lives lost that day.\n\nWe remember that America is perpetually defined by how we respond to challenges.\n\nThat attack spurred America to win WWII & restore peace in the world. #PearlHarbor78", "2019-12-06T02:05:45.000Z": "The Governor's Mansion is ready for the Holidays... \n\nAnd @texaspancake has been the best helper.", "2019-12-05T16:15:56.000Z": "... @TexasPancake  is now a special guest at political events.", "2019-12-05T04:29:12.000Z": "Great to be with @sehlinger3 and Blake for the Rev Energy Gum launch party tonight.\n\nProud of these young Longhorn entrepreneurs.", "2019-12-05T02:39:06.000Z": "GREAT NEWS!\n\nMore foster care children are finding homes. \n\nThanks to all the families who have adopted these fabulous kids. Quote Tweet Phil Prazan @PhilPrazan Per @TexasDFPS , more children leaving foster care than entering. #txlege made major reforms two years ago. The department says an increase in adoptions made a lot of it happen. @KXAN_News", "2019-12-04T19:08:25.000Z": "The Zodiac Killer strikes again. Quote Tweet New York Post @nypost Ted Cruz has killed the Baby Yoda meme https:// trib.al/e7RiaH9", "2019-12-04T18:47:49.000Z": "Texas First Lady recognized Brownsville students for participating in a Youth in Philanthropy class.\n\nThese students are learning at a young age the importance and the strategies to give back to their communities.\n\nThey truly are making Texas better. Texas First Lady visits with Brownsville students BROWNSVILLE, Texas - The Brownsville Independent School District, the Brownsville Community Foundation and the fall 2019 Youth in Philanthropy class welcome Texas First Lady Cecilia Abbott fo valleycentral.com", "2019-12-04T17:11:52.000Z": "Congress is running out of time to actually pass legislation this year.\n\nThey must act quickly and pass the USMCA trade agreement this month.\n\nTexas families and employers are counting on this. Gov. Abbott: The U.S.-Mexico-Canada Agreement is vital to the Texas economy The United States-Mexico-Canada Agreement, USMCA, is vital to the Texas economy, and it is time for Congress, and especially the Texas delegation,... dallasnews.com", "2019-12-04T01:41:16.000Z": "Oh, I know the Constitution on this. \n\nI argued the case to the U. S. Supreme Court to defend the Ten Commandments Monument on the Texas Capitol Grounds.\n\nWe won!\n\nThe Ten Commandments remain on our Capitol Grounds today! Quote Tweet You about to lose yo job David DeLong @DavidDeLong62 Replying to @GregAbbott_TX Too bad you're so ignorant of the US Constitution. Really if it weren't for the efforts of the Christian Nationalists to create a theocracy, there wouldn't be push-back on minor expressions like this. You have only yourself and your fellow panderers to blame.", "2019-12-03T23:37:29.000Z": "Terribly disappointing. \n\nArmy says faith-based group can no longer put Bible verses on dog tags. \n\nIn God We Trust is our National Slogan. \n\nOur original Commander in Chief - George Washington - invoked God - as have his successors. Army says faith-based group can no longer put Bible verses on dog tags after complaint For the past 20 years, military members have been able to wear dog tags with Bible verses on them, giving them light and hope in some of their darkest times. For some Gold Star families, this is one... foxnews.com", "2019-12-03T20:56:29.000Z": "The 2020 Dem plans could eliminate up to 400K jobs.\n\nI call this the anti-Texas plan. Their plans lead to tax increases and job decreases.\n\nSince 2013, Texas has added more than 1 million new jobs by reining in government and eliminating taxes. Study: 2020 Dem Plans Could Eliminate 413,000 Jobs The tax hikes endorsed by many Democratic presidential candidates will eliminate up to 413,000 jobs, according to a new analysis. freebeacon.com", "2019-12-03T01:05:18.000Z": "The US is now a net exporter of oil. \n\nTexas is a big reason why America will be free from the dictates of OPEC. #EnergyIndependence  #txlege US is net exporter of oil for first time in decades Positive trade balance for September could affect America's ties with allies ft.com", "2019-12-02T04:39:27.000Z": "Not many teams can run plays like this.\n\nCongrats to the @HoustonTexans on a great win over the @Patriots . #NEvsHOU  #Texans Quote Tweet Barstool Sports @barstoolsports The Texans are CLOWNING the Patriots", "2019-12-02T03:17:56.000Z": "NOT\nGONNA\nHAPPEN https:// twitter.com/KBesosa/status /1201245184283029505  This Tweet is unavailable.", "2019-12-01T21:45:18.000Z": "Texas employees are taking home more money. \n\nAs one example, per capita income in metro Tyler, Texas increased 9.3%. \n\nThat's the 4th highest in America. \n\nTwo other Texas cities were in the top 5 in the country. #txlege Per capita income in metro Tyler rises 9.3% If you're living in Tyler, you're probably bringing in more income than other parts of the country. ktre.com", "2019-12-01T20:27:05.000Z": "This is exactly what Texas did this year. \n\nI signed a law protecting free speech on college campuses. \n\nConservative speech was under attack on college campuses. \n\nNow that's against the law in Texas.", "2019-12-01T09:18:03.000Z": "What in the heck is Biden talking about. \n\nThis is truly embarrassing and Biden is oblivious to it. Quote Tweet Simon Conway @SimonRadio1776 So if Biden is the nominee, Trump should just air this. Seriously - the man needs help. Anyone have any clue what this is about? Apart from being extremely scary obviously!", "2019-12-01T00:31:51.000Z": "LET'S GO AGGIES. \n\nBeat LSU. \n\n... @AggieFootball  \n... @TAMU  #Aggies", "2019-11-30T17:18:41.000Z": "So. A terrorist was in jail for committing terrorism. \n\nHe was let out of jail. \n\nHe committed terrorism again. \n\nThat is governmental malpractice. \n\nKeep terrorists behind bars. Period. Quote Tweet Metropolitan Police @metpoliceuk \"This individual was known to authorities, having been convicted in 2012 for terrorism offences. He was released from prison in December 2018 on licence and clearly, a key line of enquiry now is to establish how he came to carry out this attack.\" Show this thread", "2019-11-29T01:58:18.000Z": "Exactly the thought of Pancake. @TexasPancake Quote Tweet Thoughts of Dog® @dog_feelings there are many humans in the household right now. and they all seem to have snacks. so i'm going to convince each and every one of them. that i have not eaten. in several weeks", "2019-11-29T00:35:57.000Z": "It's Turkey time at the Governor's Mansion. \n\nWe are so thankful to serve the people of the greatest state in America. #Happythanksgiving2019 & God Bless Texas.", "2019-11-28T19:15:54.000Z": "This is excellent. Quote Tweet Melinda Buell @M_squaredBuell Replying to @GregAbbott_TX @txst and @Macys And San Antonio's Ronald Reagan Marching Band and Dancer's. Playing \"Joy\" and \"Deep in the Heart of Texas!\" @ReaganBandSA", "2019-11-28T19:10:27.000Z": "A special #Thanksgiving treat to have Texas's very own @txst Strutters leading the @Macys Thanksgiving Parade Quote Tweet Tom Madden @only1tommadden Hey @GregAbbott_TX how about a shout out to Texas's very own @txst Strutters leading the @Macys Thanksgiving Parade", "2019-11-28T17:03:20.000Z": "Happy Thanksgiving.\n\nToday we continue our tradition of delivering Meals on Wheels to the home bound on Thanksgiving.\n\nWe deliver more than a meal.\nWe also deliver compassion & conversation.\n\nWe thank God for the blessing of living in the greatest state & country in the world.", "2019-11-27T22:34:30.000Z": "My staff & I are working with Jefferson Co. Judge Jeff Branick & local officials to ensure they have all resources needed to respond to this.\n\nThe @TCEQ , @TDEM and @TxDPS are providing help. #txlege SE Texas town rocked by chemical plant explosion Three workers at the TPC Group plant in Port Neches were injured in an explosion. The Enterprise is on scene and filing updates. chron.com", "2019-11-27T04:41:17.000Z": "Congratulations to Stephen F. Austin Men's Basketball on beating Duke on their home court. \n\n... @SFA_MBB  \n... @SFA_Athletics  #Lumberjacks", "2019-11-27T00:03:12.000Z": "ATX Helps is helping the homeless toward greater dignity.\n\nThey can help more with your help. \n\nPitch in this Thanksgiving with a donation to http:// atxhelps.org .\n\nYou'll help provide immediate shelter & support for those in need.\n\nHappy Thanksgiving @atxhelps  @AustinChamber Quote Tweet KUT Austin @KUT . @atxhelps , the coalition led by the @AustinChamber and @DowntownATXInfo , launched today and is asking for donations, with a goal of opening a temporary homeless shelter in 2020. https:// kutne.ws/2CprdFS", "2019-11-26T04:38:01.000Z": "Huge news: Charles Schwab is moving its headquarters to Texas.\n\nThe Dallas-Fort Worth area in particular is becoming a financial sector behemoth.\n\nTexas, in particular, is a jobs juggernaut. #txlege  @CharlesSchwab Charles Schwab move creates financial hub in North Texas Financial giant Charles Schwab will acquire competitor TD Ameritrade for $26 billion - that's big news in the financial world, but it's \"enormous news\" for Westlake. star-telegram.com", "2019-11-26T03:24:01.000Z": "Just another day at the Texas State Capitol...", "2019-11-25T23:03:48.000Z": "Look at this good boy being honored today. \n\nGreat work by our special forces. \n\nGod bless the U.S. military men and women who continue to keep us safe. Quote Tweet The White House @WhiteHouse Conan-America's \"hero dog\"-made an incredible recovery after the raid that killed Abu Bakr al-Baghdadi and is already back to work!", "2019-11-25T17:21:45.000Z": "Contrary to what most Texans think, newcomers from out of state are more conservative than liberal.\n\nTed Cruz got 57% of the vote of people who moved to TX from another state.\n\nThat matches a poll by my campaign & one from 2013.\n\nThey flee liberal gov't. Native Texans voted for native Texan Beto O'Rourke, transplants went for Ted Cruz, exit poll shows WASHINGTON -- Sen. Ted Cruz and Rep. Beto O'Rourke fought during the Senate race over who was more Texan. It turns out that native Texan voters... dallasnews.com", "2019-11-25T04:39:00.000Z": "The fastest growing city in America is...\n...Conroe, Texas. \n\n11 of the top 25 are in Texas.\n\nOur secret is out. \nNOW, let's ensure we KEEP Texas the land of opportunity. https:// abc13.com/society/this-h ouston-area-city-is-the-fastest-growing-in-the-country/5706876/  via @ABC13Houston This Houston-area city is the fastest growing in the country They do say everything is bigger in Texas! abc13.com", "2019-11-25T02:48:01.000Z": "THE purpose of life is to build a relationship with God.\n\nJust like in any relationship, both good & bad things happen in our lives. The thing about a relationship with God is that bad events bring us closer to God.\n\nGod's limitless love helps us rise above life's challenges. Quote Tweet Jason Catman @catman_jason Replying to @GregAbbott_TX Funny how people always find a way to praise God for the good things in their life, but find every possible excuse to absolve him of the bad things. \n\nOmnipotence goes both ways, Greg.", "2019-11-24T20:06:19.000Z": "God didn't cause the accident that left me paralyzed, but He did help me persevere over that enormous challenge.\n\nI'm a testament that the glory of God is revealed by a young man's back being broken in half and still rising up to be Governor of Texas.\n\nWith God all is possible. Quote Tweet Game Boy @WJaredGallagher Replying to @GregAbbott_TX God put you in a wheelchair Greg", "2019-11-24T17:42:15.000Z": "We are launching a statewide campaign against human trafficking.\n\nWe aim to crack down on human traffickers while protecting the victims of this evil crime.\n\nThis year I signed more than 20 laws to tackle #HumanTrafficking in Texas. #EndHumanTrafficking Statewide campaign against human trafficking launches in Bryan-College Station Brazos County law enforcement officials, nonprofit leaders, state representatives and other advocates gathered Thursday at Century Square in College Station to announce the launch of the \"Can You See... theeagle.com", "2019-11-24T02:25:45.000Z": "Thanks for your service. \n\nI love the #RGV . Quote Tweet David Navarro Jr @DavidNavarroJr7 Replying to @GregAbbott_TX Proud to have been a part of your security detail when u visited Brownsville Texas in Charro Days...best governor", "2019-11-23T18:01:15.000Z": "Government shouldn't get in the way of your ability to make a living. \n\nSo, I directed all state agencies to roll back burdensome & costly regulations which may hurt both workers and consumers. #txlege Gov. Abbott demands state agencies roll back licensing regulations, fees The Governor said his request can help boost Texas' economy and employ Texans. kxan.com", "2019-11-23T07:10:59.000Z": "That's what I thought before I ended up in a wheelchair. \n\nI've done more AFTER the accident that left me paralyzed than before that accident. \n\nWith God all things are possible. https:// twitter.com/paul_ut97/stat us/1198116839752183808  This Tweet is unavailable.", "2019-11-23T01:25:02.000Z": "Never quit \nNever give up\nOvercome any challenge", "2019-11-22T22:44:22.000Z": "Great to meet with the Acting Secretary of Homeland Security @DHS_Wolf today in Austin. \n\nAppreciate all that @DHSgov is doing to protect our citizens.", "2019-11-22T06:01:45.000Z": "It's wonderful to see our high school students supporting law enforcement. \n\nSuch promise for our future. \n\nMaybe a future Governor in there. #BackTheBlue Quote Tweet Blue Alert @BlueAlertUs Waxahachie, TX.  High students gift police department with 98 handmade Thin Blue Line flags https:// waxahachietx.com/news/20191121/ waxahachie-high-students-gift-police-department-with-98-handmade-thin-blue-line-flags   #LivePD  #LivePDNation  #BackTheBlue  #ThinBlueLine  #Texas  @GregAbbott_TX  #StayReLEntless  #Abigail758", "2019-11-22T01:05:02.000Z": "Honored to have the opportunity to serve as Chairman of @The_RGA during this crucial election year.\n\nWith governor's races in 11 states in 2020, we're focused on defending our incumbents & competing to flip governorships from blue to red.", "2019-11-21T18:54:15.000Z": "Keep the families of these soldiers in your prayers.\n\nThey are patriots who died in service to our country. \n\nAmerica remains the greatest country in the history of the world because of those who have worn the uniform of the U.S. military. Two Fort Hood soldiers die in Apache helicopter crash The Department of Defense announced today the deaths of two soldiers who were supporting Operation Freedom's Sentinel. kxxv.com", "2019-11-21T05:32:21.000Z": "Republican Governors get results. \n\nTheir constituents get jobs. #txlege Quote Tweet The RGA @The_RGA Republican governors are taking state economies to new heights! According to @BLS_gov , the top 5 states for job growth in the past year are run by GOP govs - UT, FL, AZ, TX & ID. \n\nCongratulations @GovHerbert  @GovRonDeSantis  @dougducey  @GregAbbott_TX  @GovernorLittle", "2019-11-21T03:07:47.000Z": "When you hear political candidates promising grand programs for free,\nremember this sage advice:\n\n\"A government big enough to give you everything you want, is a government big enough to take away everything that you have.\"", "2019-11-21T02:32:51.000Z": "Today I explained how Texas leads America in oil & gas + wind energy production. \n\nWe ship clean burning LNG to other countries to reduce their energy cost & clean their air. \n\nWe've done all this while reducing pollution equal to removing 80 million vehicles from TX roads.", "2019-11-19T23:51:12.000Z": "We Texans always remember our early connection with Tennessee. @GovBillLee", "2019-11-19T18:12:39.000Z": "\"Abbott's stance on homelessness found wide support\"\n\nWe improved safety & cleanliness on Austin streets--while also providing the homeless a safer and cleaner place to camp while Austin prepares for long-term solutions. #txlege Abbott's stance on homelessness found wide support \"Vagrants,\" \"derelicts,\" \"filth,\" and \"vermin\" - that's what many Texans called Austin's homeless population in a barrage of online feedback to Gov. Greg Abbott.One Georgetown man suggested Austin's... statesman.com", "2019-11-19T02:55:52.000Z": "The Texas economy remains red hot.\n\nHistoric record low unemployment rate continues in October.\n\nTexas added > 30,000 jobs last month & almost 300,000 over the past year.\n\nBIG THANKS to our employers-and to the best work force in America. #txlege  https:// twc.texas.gov/news/historic- low-continues-october-2019-texas-adds-fifth-month-record-low-unemployment ", "2019-11-19T00:13:13.000Z": "I'm headed to Bill Miller's tonight. Chick-fil-A will end donations to Christian organizations with anti-LGBT values in 2020 Chick-fil-A plans to end cash donations to the Salvation Army and the Fellowship of Christian Athletes in 2020 after years of criticism from LGBT and human... dallasnews.com", "2019-11-18T23:33:21.000Z": "No limits. \n\nWoman in Wheelchair Wants to Compete in Miss USA. Woman Who Survived a Coma Wants to Be the First Woman in a Wheelchair to Compete at Miss USA Madeline Delp placed in the top 10 at the Miss North Carolina USA pageant this weekend people.com", "2019-11-18T02:40:16.000Z": "This hardworking turkey will be spared on Thanksgiving.", "2019-11-18T00:25:19.000Z": "Liberals want more gun laws but don't enforce laws that already exist.\n\nThis shows liberal Houston Judges drop too many criminal charges including felon in possession of  weapon & unlawfully carrying a handgun.\n\nWe must get guns out of criminals' hands. DA Ogg: Judges', magistrates' discretion spurs increase in 'no probable cause' findings Harris County District Attorney Kim Ogg took aim at local courts this week, calling an alarming uptick in findings of no probable cause in more than 3,000 court cases a waste of resources and a... houstonchronicle.com", "2019-11-17T23:06:14.000Z": "Texas is America's #1 state for launching a startup business.\n\nFactors include:\n  Growth of new business applications\n  Rate of new entrepreneurs\n  Corporate tax rate\n  Share of population with college education\n  Labor cost\n  Cost of living index #txlege Study: Texas is best state for launching a startup business A Comparisun study showed Texas is the best state in the U.S. to launch a startup company for many reasons, including zero-percent corporate tax rate. timesrecordnews.com", "2019-11-17T20:11:33.000Z": "Congratulations to ... @JohnCornyn  and his wife Sandy on celebrating their 40th wedding anniversary.", "2019-11-17T17:44:47.000Z": "Some question @kanyewest motives as he speaks of Jesus & performs in jails.\n\nIf he moves just one person closer to God the world will be a more peaceful place. \n\nThe Lord works in mysterious ways. \n\nAs Jesus said: You don't understand what I'm doing now but someday you will. Quote Tweet Greg Abbott @GregAbbott_TX What @kanyewest does to inspire the incarcerated is transformative. \n\nSaving one soul at a time. \n\nInmates who turn to God may get released earlier b/c of good behavior & may be less likely to commit future crimes. \n\nIt would be great if other artists followed Kanye's lead. twitter.com/HoustonChron/s", "2019-11-17T02:08:15.000Z": "Proud to welcome the Oklahoma Governor back into the great state of Texas. \n\nHere's to hoping that the Texas team will prevail this time. \n\nFingers crossed. #SicEm  @BUFootball  @Baylor Quote Tweet Governor Kevin Stitt @GovStitt We meet again @gregabbott_TX  #BoomerSooner", "2019-11-16T17:52:16.000Z": "What @kanyewest does to inspire the incarcerated is transformative. \n\nSaving one soul at a time. \n\nInmates who turn to God may get released earlier b/c of good behavior & may be less likely to commit future crimes. \n\nIt would be great if other artists followed Kanye's lead. Quote Tweet Houston Chronicle @HoustonChron After kicking off with one performance for more than 200 men at the 701 San Jacinto building, @kanyewest ducked down into the underground tunnel and turned up in the main Baker Street jail to do a second show for a smaller crowd of women. https:// chrn.cl/2Xfu1PI Show this thread", "2019-11-16T01:57:48.000Z": "Tonight we are hosting the Nolan Ryan Foundation at the Governor's Mansion. \n\nGreat man. \n\nGreat cause.", "2019-11-15T23:44:32.000Z": "For those sending messages about Rodney Reed please note that the Texas Court of Criminal Appeals halted Rodney Reed's execution and sent his case back to the trial court for further review. Texas court stops Rodney Reed's execution to further review claims ... The ruling came hours after the Texas parole board recommended that Gov. Greg Abbott delay Reed's death for 120 days. texastribune.org", "2019-11-15T02:48:02.000Z": "Good news for North Texas tornado victims.\n\nThe U.S. Small Business Association is offering federal disaster loans to North Texas tornado victims. #txlege U.S. Small Business Administration offers federal disaster loans to North Texas tornado victims The assistance is available in Collin, Dallas, Denton, Ellis, Kaufman, Rockwell and Tarrant counties. fox4news.com", "2019-11-14T21:40:21.000Z": "Today I met with leaders in Ballinger,\nTexas at the Main Street Soda Fountain.\n\nFolks say this is the first ever event by a Governor is this rural town in Runnels County.\n\nTruly a terrific town with wonderful people.\n\nAlso met local staff for TX Health & Human Services. #txlege", "2019-11-13T15:50:04.000Z": "Happy birthday to my wife, the fabulous First Lady of Texas.", "2019-11-13T01:14:54.000Z": "Today, @WalmartOrg invested $5.4 million in the TX workforce.\n\nThank you Walmart for your generosity & partnership with @TXWorkforce & @WFSDallas to provide top-notch training to Texans. \n\nWorking together, we will continue to expand economic prosperity!", "2019-11-12T19:52:46.000Z": "My wonderful wife is providing a helping hand to the homeless during this cold weather.\n\nIt's a far better environment than living under bridges with no access to toilets, sanitation & food. \n\nThis temporary facility will transition to the longer term facility by ATX Helps. Quote Tweet Casey Claiborne @CaseyOnFOX7 Texas First Lady @TexasFLCA Cecilia Abbott handing out blankets at State homeless camp. @fox7austin", "2019-11-11T23:39:09.000Z": "Today in Fredericksburg we honored our Veterans & I met these Vets from WWII. \n\nThen I visited with these young wounded warriors-some who continue to serve. \n\nAmerica is free because we have the mightiest military in the history of the world. #VetransDay2019  #Veterans", "2019-11-11T15:21:15.000Z": "Happy #VeteransDay to my brother- and to all the men and women who have worn the uniform of the greatest military in the history of the world. \n\nThank you for keeping America free.", "2019-11-10T22:51:11.000Z": "New billboards are part of a campaign to increase awareness about human trafficking. \n\nI signed more than 20 laws that crack down on human traffickers & support the victims. \n\nTogether, we can defeat this heinous crime. #txlege New billboards part of campaign to increase human trafficking awareness in Lubbock Advocacy groups on Wednesday debuted new human trafficking awareness billboards around Lubbock.The billboards are part of the \"Can you see me?\" campaign. The signs depict people in common human... lubbockonline.com", "2019-11-10T03:47:31.000Z": "Great to be with two outstanding law enforcement officers tonight. \n\nThanks for your service. #BackTheBlue Quote Tweet The Fuzz @Texanfuzz414 An honor and privilege to get to protect and escort @GregAbbott_TX tonight!", "2019-11-10T00:00:56.000Z": "This is the pre-game confidence of a player who knows he'll make a game winning kick. \n\n... @DickertheKicker  #HookEm  https:// images.app.goo.gl/a5taJ42WyHiMjf nLA ", "2019-11-09T17:30:34.000Z": "This story explains how Eric Holder, Barack Obama, George Soros & others spent $50 million to win Virginia legislative seats to control the redistricting process. \n\nNow they target a Texas takeover. \n\nWe'll remind Eric Holder not to mess with Texas. Opinion | Eric Holder Takes Virginia The Democratic plan to dominate state legislatures has its first electoral success. wsj.com", "2019-11-09T07:01:20.000Z": "Credit to ... @TexasHumor ", "2019-11-09T04:32:23.000Z": "Conduct like this won't be tolerated in Texas classrooms.\n\nThe substitute teacher who committed this heinous act has been arrested & will face serious legal consequences.\n\nThe school district will be investigated by the Texas Education Agency. #txlege Hays CISD substitute teacher arrested for allegedly assaulting Lehman High School student The video shows the woman approaching and then punching the student in the face. The substitute then continues hitting the student as others look on in shock. kxan.com", "2019-11-08T23:16:43.000Z": "Oldest living couple in the world is a husband and wife in Texas.  \n\nTheir combined age is 211. \n\nEverything's bigger in Texas. A husband and wife in Texas are officially the oldest living couple in the world With a combined age of 211 years, one couple in Austin, Texas, has been named the oldest living couple in the world, according to Guinness World Records. cnn.com", "2019-11-07T17:56:35.000Z": "The Texas economy is ranked #1 in America.\n\nWe have the fastest growing GDP in the country. \n\nThanks to our innovative entrepreneurs and the best workforce in the USA. \n\nLet's KEEP Texas the most exceptional state in the greatest country in the history of the world.", "2019-11-07T02:07:07.000Z": "Texas gets it done.\n\nHere are before & after photos of areas the Texas. Dept. of Transportation is cleaning up.\n\nAlso Texas is providing the homeless with acres of area to camp + portable potties, hand sanitation & food all in one place for health workers to treat them. #txlege", "2019-11-07T00:07:03.000Z": "Great news for Veterans looking for jobs.\n\nThe Texas Workforce Commission is hosting a Statewide Hiring Red, White & You job fair on November 7.\n\nThis gives employers the opportunity to hire our trained & skilled veterans.\n\nHire a Veteran. #Veterans 'Hiring Red, White and You' job fair Thursday The Texas Workforce Commission will host the 8th Annual Statewide Hiring Red, White and You job fair on November 7. newschannel6now.com", "2019-11-06T04:27:30.000Z": "Texas Voters Approve Constitutional Amendment Banning State Income Tax.\n\nTHANK YOU TEXANS!!!!\n\nFuture generations of Texans will thank you too.\n\nKeep Government out of your pocketbook. #txlege  http:// kfyo.com/texas-voters-a pprove-constitutional-amendment-banning-state-income-tax/?trackback=twitter_mobile   @kfyo Texas Voters Approve Proposition 4 Banning Income Tax Texas voters approved nine out of ten constitutional amendments in Tuesday's statewide election, including the highly publicized Proposition 4. kfyo.com", "2019-11-05T04:37:52.000Z": "How 'Bout Them Cowboys. @dallascowboys Quote Tweet Patrick @PatSportsGuy And with this win, Dallas owns all the NFC East tiebreakers. GIF", "2019-11-05T03:18:30.000Z": "Jobs, jobs, & more jobs! \n\nToday we broke ground on a brand new Aisin manufacturing plant in Cibolo. This plant is creating 900 new jobs for this region.\n\nPartnerships like this help Texas expand economic prosperity across the entire state.", "2019-11-05T01:02:54.000Z": "Join me to keep Texas a no income tax state. \n\nOn Tuesday, November 5th, vote FOR Prop. 4 to prevent an income tax in Texas. \n\nKeep Texas, Texas. \n\n.........@VoteFORProp4 #txlege", "2019-11-04T19:51:40.000Z": "Today the Texas Dept. of Transportation began cleaning under bridges in Austin.  \n\nIt's a slow process and won't be completed in one day, but steady progress is being made. \n\nOur goal is to make Austin safer while also providing better alternatives for the homeless. #txlege", "2019-11-04T15:55:51.000Z": "Texas Maintains Record Low Unemployment Rate of 3.4 Percent for Fourth Consecutive Month.\n\nTexas employers added 300,000 jobs over the year.\n\n\"Texas continues to be a national leader in job creation and the premier place to do business.\" #txlege Texas Maintains Record Low Unemployment Rate of 3.4 Percent for Fourth Consecutive Month AUSTIN ⎯ In September, the Texas economy added 7,600 seasonally adjusted Total Nonfarm positions. The unemployment rate held steady for the fourth month in a row at 3.4 percent matching the all-tim myhighplains.com", "2019-11-04T03:54:40.000Z": "Economic prosperity is spreading to every region of Texas.\n\nThat includes this new Sterling Lumber manufacturing facility in Lufkin.\n\nSterling said: It's a connection of cutting edge technology with the great resources of East Texas - People and Timber. Texas governor visits Sterling in Lufkin to promote manufacturing in Deep East Texas The Lufkin CLT manufacturing facility is more than 375,000-square-feet situated on about 50 acres on US-69 southeast of the city. ktre.com", "2019-11-03T22:06:58.000Z": "Do your part to keep Texas a no income tax state.\n\nTHIS Tuesday, November 5th, Vote YES on Proposition 4.\n\nYes to Prop 4 means NO to state income tax.\n\nIf Prop. 4 passes it will 2/3 of Legislators to put an income tax on the ballot.\n\nKeep Texas, Texas. Yes to Prop 4 means no to state income tax Proposition 4 is one of ten on the November ballot and it is expected to be a draw to the polls. Texas is one of 7 states that does not have a state income tax and if you want to ensure it won't in... news4sanantonio.com", "2019-11-03T17:23:37.000Z": "San Francisco chose to tolerate homelessness & drug use.\n\nIt did so in the name of com­pas­sion for the home­less.\n\nIt made the problems worse.\n\nThe re­sult: Street squalor & mis­ery in­creased, while gov­ern­went ex­pen­di­tures ballooned.\n\nNo SF in TX. Opinion | The Streets of San Francisco The city made a choice to tolerate vagrancy and encourage drug use, with dire consequences. wsj.com", "2019-11-03T03:10:24.000Z": "My team & I are very familiar with Mobile Loaves & Fishes.\n\nWe're working with them as we craft ways to help the homeless.\n\nMy family has made meals for @mobileloaves & delivered them. \n\n(That sound you hear is my critics cringing. They thought I was heartless. ) Quote Tweet Ad Astra @adastra23 Replying to @GregAbbott_TX and @TogetherSwarm Have you heard of Mobile loaves and fishes, governor?", "2019-11-02T20:05:50.000Z": "\"A homeless man living under a downtown highway overpass was found dead in a tent on Thursday police said\"\n\nAustin's homeless policy is unsafe for both the homeless & non-homeless\n\nThe status quo isn't working\n\nThe State will start changing this next week Man Found Dead Under Downtown Austin Bridge Officers found the deceased man in a tent under the Interstate 35 overpass at Cesar Chavez Street on Thursday morning. patch.com", "2019-11-02T16:19:52.000Z": "Yesterday I joined Dallas Mayor @Johnson4Dallas , State Representative @MorganMeyerTX , Dallas Co. Judge @JudgeClayJ , & Emergency Management Chief @chiefkidd to survey the damage caused by the tornadoes in Dallas. \n\nWe are working together to speed the recovery process. #txlege", "2019-11-02T02:14:07.000Z": "Already done it...\n\n\"Texas Governor Greg Abbott signs law banning sanctuary cities\"\n\nReport violations to the Texas Attorney General. https:// nbcnews.com/news/us-news/t exas-gov-greg-abbott-signs-law-banning-sanctuary-cities-n756136  Quote Tweet Oracle @shineangel2020 @GregAbbott_TX Ban Sanctuary Cities!!!", "2019-11-02T01:39:12.000Z": "\"Austin's homeless problem is out of control, and Gov. Abbott is right to act\"\n\n\"local governments appear to have all but given up on any policy beyond enabling people to live in the meanest conditions possible.\"\n\nThat \"shouldn't be policy in Texas.\" Austin's homeless problem is out of control, and Gov. Abbott is right to act It's hard to understand how permitting people to live in danger and squalor is the compassionate approach to governing. It is, in fact, the opposite. Yet... dallasnews.com", "2019-11-02T00:32:26.000Z": "Today we broke ground on the new Uber Headquarters in Dallas.\n\nTexas is proud of this innovative business and the 3,000 jobs it will provide.\n\nWorking together, we will keep the Texas economy the economic engine of America. @uber  @dkhos  #txlege", "2019-11-01T00:04:01.000Z": "Today we celebrate the re-opening of @BP_America 's Westlake Campus in Houston. \n\nThis re-opening symbolizes the resilience of the Houston community after Hurricane Harvey. \n\nThank you BP for your continued partnership with the Lone Star State!", "2019-10-31T23:51:32.000Z": "Well in case you didn't catch this...", "2019-10-31T22:34:08.000Z": "Every time you watch this chart you see the same 2 things:\n\nTexas > Venezuela\nCapitalism > Socialism Quote Tweet Prof. Steve Hanke @steve_hanke Capitalism vs. Socialism: oil production in Texas vs. Venezuela", "2019-10-31T19:52:53.000Z": "I hope you're right that I'll be playing golf next October. \n\nFingers crossed. https:// t.co/Pwdc1qswy2 This Tweet is unavailable.", "2019-10-31T19:44:06.000Z": "#HookEm  #HornsUpForSafety Quote Tweet SafeHorns @safehorns @GregAbbott_TX we appreciate your team meeting w/us today. #HornsUpForSafety  #PublicSafetyFirst  #Hookem", "2019-10-31T13:24:10.000Z": "Before & after @TexasPancake reaches the candy bowl...\n\nHappy Halloween!", "2019-10-31T04:08:05.000Z": "We love you @Astros . \n\nThanks for the incredible season. \n\nYou'll be back again to take back the #WorldSeries . GIF", "2019-10-31T00:59:16.000Z": "Congratulations to Master Sgt. Matthew Williams on being awarded the Medal of Honor today for his acts of bravery overseas. \n\nFrom one Texan to another, thank you for your service. God bless.", "2019-10-29T20:20:33.000Z": "Today is a day of action. \n\nWe began posting notices that TxDOT will clean up homeless camps under highways in Austin starting Monday. \n\nSafety will improve soon. \n\nThe homeless will be offered options for shelter, food,\nclothing & healthcare. #txlege Abbott Says TxDOT Will Start Cleaning Up Homeless Camps Under Highways In Austin Starting Monday Gov. Greg Abbott's office says it's forging ahead with cleanups of homeless encampments under overpasses in Austin.Ahead of a Nov. 1 deadline for keranews.org", "2019-10-29T18:38:22.000Z": "Welcome to Texas, @VP !", "2019-10-29T02:38:19.000Z": "Today I appointed Adriana Cruz as the new Executive Director of Economic Development and Tourism. \n\nShe's a proven economic development leader who will keep Texas #1. https:// haysfreepress.com/2019/10/28/400 47/  via @haysfreepress Abbott names Adriana Cruz executive director Of Economic... AUSTIN - Governor Greg Abbott today announced his appointment of Adriana Cruz as the Executive Director of the Economic Development and Tourism (EDT) division within the Office of the Governor... haysfreepress.com", "2019-10-29T01:19:11.000Z": "ME: We must ensure the safety of all Texans.\n\n... @MayorAdler : Fake News. Austin is safe. The Governor needs to leave Austin alone.\n\nREALITY: A man identified as a transient threw a brick through a car window almost hitting a woman in downtown Austin. Police: Man throws brick through car window almost hitting passenger in downtown Austin A man is accused of throwing a brick through a car window, almost hitting a woman sitting in the front passenger seat in downtown Austin, according to court documents. kxan.com", "2019-10-28T23:10:58.000Z": "Happy birthday to mi suegra, Lucy.", "2019-10-28T20:26:29.000Z": "Fantastic work by our military and U.S. special forces, especially this K-9! Quote Tweet Donald J. Trump @realDonaldTrump We have declassified a picture of the wonderful dog (name not declassified) that did such a GREAT JOB in capturing and killing the Leader of ISIS, Abu Bakr al-Baghdadi!", "2019-10-28T18:26:59.000Z": "The 10 most popular Governors in America have one thing in common:\n\nThey are all Republican. \n\nRepublicans deliver results. #txlege ... @TexasGOP  Governor Rankings - Morning Consult morningconsult.com", "2019-10-28T16:24:10.000Z": "Met with @SecretaryCarson this morning to discuss the homeless issue here in Austin. \n\nWe talked about best strategies to reduce homelessness that ensures both compassion and public safety. #txlege", "2019-10-28T05:22:36.000Z": "I can't stop watching this video... https:// twitter.com/HumphreyTron69 /status/1188211129639505921/video/1 ", "2019-10-28T00:07:11.000Z": "WaPo can't even correctly write a correction.\n\nThe issue isn't how the headline was READ, it's how it was WRITTEN. WaPo should never have written--or even thought of it--the way it did.\n\nNewspapers seem to be the only business whose motto is: The Customer Is Always Wrong. Quote Tweet Kristine Coratti Kelly @kriscoratti Regarding our al-Baghdadi obituary, the headline should never have read that way and we changed it quickly.", "2019-10-27T19:14:34.000Z": "Austin @MayorAdler insists on \"recent\" evidence of dangers posed by his reckless homeless policy.\n\nLet's help him.\n\nI'll start with this showing used needles collected from homeless camps. @MayorAdler suggested there's no public health problem. From #ThePersistence", "2019-10-27T17:57:46.000Z": "Texas Rangers & Texas Dept. of Public Safety are working aggressively with local & federal officials to respond to the #TexasAMCommerce shooting.\n\nSome misinformation will be clarified. \n\nIn meantime they'll identify the shooter & help the victims. US news At least two killed and several injured in shooting at party in Texas", "2019-10-27T16:25:35.000Z": "This is huge. \n\nThe most wanted terrorist in the world was taken out over night. \n\nThanks to the President, the intel community, and our US Special Forces for making the world safer. Quote Tweet The Hill @thehill President Trump: \"Last night, the United States brought the world's number one terrorist leader to justice -- Abu Bakr al-Baghdadi is dead. He was the founder and leader of ISIS, the most ruthless and violent terror organization anywhere in the world.\" http:// hill.cm/ryJ0zzP", "2019-10-26T21:59:29.000Z": "Quite a game today in College Station. Congratulations @AggieFootball on the win against Mississippi State! #Whoop  #GigEm", "2019-10-26T16:07:11.000Z": "Here in Aggieland watching the @aggiefootball take on Mississippi State.  #GigEm  #12thMan", "2019-10-26T15:10:34.000Z": "Thanks for making my point.\n\nThat video was before you altered the homeless policy that made public safety WORSE.\n\nYou fool no one. Everyone knows the dangers downtown. \n\nAttacks have INCREASED since that video.\n\nStop ignoring the dangers & keep people safe. #txlege Quote Tweet Mayor Adler | wear a mask. @MayorAdler Governor, that video is almost two years old, well before any recent ordinance changes. This isn't the first time you've fallen victim to social media trolls trying to mislead and scare Austinites. Let's focus on actually ending homelessness. #LetsEndHomelessness  twitter.com/GregAbbott_TX/", "2019-10-26T03:13:44.000Z": "Austin's policy of lawlessness has allowed vicious acts like this.\n\nAustin's inability to restore order will compel the State to act beginning November 1st if action is not taken to ensure public safety. #txlege Quote Tweet Austin Skidrow @AustinSkidrow Downtown Austin.  \n\nVideo captured by https:// instagram.com/cosmicblues/ Show this thread", "2019-10-25T04:00:39.000Z": "Rep. Leach: Texans must vote to make a state income tax nearly impossible.\n\nI agree 100%.\n\nDo YOUR part to prevent an income tax in Texas.\n\nVote YES for Proposition 4.\n\nIt's on the ballot now. @leachfortexas  #txlege Rep. Leach: Texans must vote to make a state income tax nearly impossible As a policymaker who represents one of the fastest growing counties in Texas, I'll admit, wrestling with our state's readiness for this population growth... dallasnews.com", "2019-10-25T00:32:48.000Z": "There are many reasons TX is exceptional. One stands out: our economy.\n\nOur state's success wouldn't be possible without a strong workforce.\n\nThat's why we signed the TX Industry-Rec. Apprenticeship Prgm. to ensure our economy continues to outperform other COUNTRIES across the", "2019-10-23T23:58:04.000Z": "FYI the matter of 7 year old James Younger is being looked into by the Texas Attorney General's Office and the Texas Department of Family and Protective Services. #JamesYounger", "2019-10-23T04:08:46.000Z": "We were so proud to recognize this couple on celebrating their 82nd Wedding Anniversary.\n\nCONGRATULATIONS! Texas' longest married couple celebrates 82nd anniversary in Paris The longest-married couple in Texas was recognized by Governor Greg Abbott last week after they celebrated their 82nd wedding anniversary. kxii.com", "2019-10-23T01:54:01.000Z": "Texas believes in empowering People not Government:\n\n\"How Greg Abbott's libertarian renaissance is benefiting the state of Texas\" How Greg Abbott's libertarian renaissance is benefiting the state of Texas People like freedom theblaze.com", "2019-10-23T00:44:41.000Z": "Texas Maintains Record Low Unemployment Rate of 3.4 % for Fourth Consecutive Month.\n\nThanks to the many entrepreneurs & innovators who are hiring the best workforce in America.\n\nTexas will continue to create an environment that supports business. #txlege Texas Maintains Record Low Unemployment Rate of 3.4 Percent for Fourth Consecutive Month AUSTIN ⎯ In September, the Texas economy added 7,600 seasonally adjusted Total Nonfarm positions. The unemployment rate held steady for the fourth month in a row at 3.4 percent matching the all-tim myhighplains.com", "2019-10-22T22:07:08.000Z": "The future of the oil & gas industry is on the line in 2020. That's why we need to work together to make sure we elect great Reps. who will continue to support our thriving industry right here in Texas.\n\nThank you @TXOGA for all of your hard-work & happy 100th birthday! #txlege", "2019-10-22T02:09:39.000Z": "As we gather here today, in what is a perfect fall day here in East Texas...\n\nWe must remember in our hearts & in our prayers....\n\nThose in other regions of the state who suffered overnight because of catastrophic tornados.", "2019-10-22T00:10:14.000Z": "Welcoming another business in East Texas today. \n\nThe new Sterling Manufacturing Facility in Lufkin helps keep Texas the economic engine of America.", "2019-10-21T23:38:11.000Z": "Vote YES on Proposition 4 to ban an income tax is Texas.\n\nIt's on the ballot NOW. \n\nDo your part to prevent future generations of legislators from imposing an income tax in Texas. https:// twitter.com/MARINE_99ZULU/ status/1186409816807346177  This Tweet is unavailable.", "2019-10-21T19:37:51.000Z": "To help Texans respond to the devastation caused by storms last night I have issued a Disaster Declaration for 16 counties. \n\nThis provides resources to speed the recovery. #txlege  #Tornado Texas Gov. Greg Abbott issues disaster declaration following severe weather Texas Governor Greg Abbott has issued a disaster declaration Monday for 16 Texas counties as a result of severe weather sustained across Texas last night. According to a release, the declaration wi valleycentral.com", "2019-10-21T06:44:04.000Z": "We are sending prayers. \n\nWe are also sending the Texas Division of Emergency Management to provide assistance. @TDEM Stay safe Texans. https:// twitter.com/rosedixontx/st atus/1186152008492994560  This Tweet is unavailable.", "2019-10-21T03:41:00.000Z": "TEXANS: Treacherous weather will continue to strike various regions of the state - especially North & East Texas. \n\nBe alert. Heed warnings. Stay safe. \n\nThe Texas Division of Emergency Management will work with local officials to provide any assistance needed. @TDEM Quote Tweet Pete Delkus @wfaaweather TORNADO WARNING also continues for southern Dallas and northern Ellis counties. Circulation about to cross I-45 near Ferris. #wfaaweather", "2019-10-21T00:09:55.000Z": "Tonight we celebrated the Festival of Lights with the Indian-American community in Texas.\n\nWe lit Diwali lamps on display in the Governor's Mansion.\n\nWe discussed Prime Minister Modi's visit to Texas. \n\nWe celebrated the victory of light over darkness. @narendramodi  #Diwali", "2019-10-20T04:34:10.000Z": "Congratulations @Astros returning to the #WorldSeries . \n\nThank you #Altuve . \n\nWinners gonna win. GIF", "2019-10-19T22:28:07.000Z": "Panhandler threatened to stab woman when she refused to give him money.  \n\nConstant crimes like this is compelling the State to step in. #txlege Police: Panhandler threatened to stab woman when she refused to give him money A man asked a woman to give him money and threatened to stab her when she refused, police said. kxan.com", "2019-10-19T17:45:28.000Z": "Today we hosted Secretary of the Army Ryan McCarthy & General John Murray. \n\nWe are collaborating on the Army Futures Command located in Texas. \n\nThey presented this fabulous U. S. Army knife. @USArmy", "2019-10-19T04:16:31.000Z": "Amen! Quote Tweet Texas Humor @TexasHumor Y'all can't even deny that Texas is the best-shaped state in the US.", "2019-10-19T02:17:28.000Z": "Joining me tonight is Lyric.\n\nAs a teenager she was homeless on the streets of Austin.\n\nDetermination led her out of homelessness & to a job.\n\nNow she's dining at the Governor's Mansion.\n\nShe's sharing strategies that help the homeless & also protect the safety of everyone.", "2019-10-16T19:08:35.000Z": "It's a packed house in Longview at the @RWofGC_TX meeting to learn about Abbott U.  The ladies are ready to defend E. Texas and Beyond ! @AbbottCampaign  @GregAbbott_TX  @sarahsaiz1", "2019-10-17T23:02:13.000Z": "Here's how I see things today.", "2019-10-17T01:07:46.000Z": "The only thing better than watching a UT game is watching it with my daughter.", "2019-10-16T21:18:24.000Z": "Dozens of women WHO HAVE BEEN ATTACKED in Austin have thanked me for trying to make the community safer. \n\nI will do what must be done to ensure safety for those women and for all Texans. Quote Tweet KXAN News @KXAN_News Mayor Adler says he's received thanks from dozens of women in Austin who are experiencing homelessness. Here's why: http:// bit.ly/35DwEyz", "2019-10-16T18:27:00.000Z": "We are working with Microsoft to develop a tech-savvy, highly skilled workforce. \n\nThis leads to high paying jobs and encourages employers to hire more Texans. #txlege Microsoft partners with businesses, schools to develop tech-savvy border workforce Microsoft Corp. is doubling-down on its workforce development investment in El Paso, adding 15 public schools to its computer skills program and investing $1.5 million in a binational business acce borderreport.com", "2019-10-16T16:27:25.000Z": "Some special visitors to the Governor's Mansion today.", "2019-10-16T02:52:08.000Z": "Today we deployed $61 million in Homeland Security Funds to support state and local efforts to prevent terrorism.\n\nWe remain forever vigilant in countering terrorism at all levels. #txlege Governor Abbott announces funding to counter terrorism The office of Governor Greg Abbott says today they announced $61.2 million in Homeland Security Grant Program funding to support state and local efforts to prevent terrorism and prepare for the... kcbd.com", "2019-10-14T23:39:11.000Z": "Great to be back in El Paso working with @Microsoft TechSpark today. \n\nThis program fosters job creation and economic opportunity right here in Texas.", "2019-10-14T20:36:32.000Z": "The outrageous death of Atatiana Jefferson: What was Fort Worth cop possibly thinking when he shot?  \n\nThat's the key question. The outrageous death of Atatiana Jefferson: What was Fort Worth cop possibly thinking when he shot? A Fort Worth police officer's split-second decision to fatally shoot 28-year-old Atatiana Jefferson in her mother's home early Saturday morning seems... dallasnews.com", "2019-10-14T15:55:27.000Z": "I spent 3 days in downtown Dallas & saw ZERO homeless laying around or camping on sidewalks.\n\nNo feces & no used needles.\n\nDallas has more homeless people than Austin but is able to retain public health & safety.\n\nAustin's problem isn't the homeless; it's lack of leadership. Quote Tweet 𝗘𝘃𝗲𝗿𝘆 𝗧𝗲𝘅𝗮𝗻 @urban9uprising @MayorAdler  @GregAbbott_TX  @chiproytx twitter.com/partycat/statu", "2019-10-14T05:01:22.000Z": "HOUSTON, WE HAVE A WALK-OFF!!!", "2019-10-14T05:02:14.000Z": "Carlos Correa walks it off for the Astros and the ALCS is tied 1-1 From FOX Sports: MLB", "2019-10-14T01:22:21.000Z": "From the Texas State Fair...\n...baby goats born this week.", "2019-10-13T20:30:47.000Z": "Vote YES on Prop. 4 to prevent a state income tax in Texas.\n\nCurrent Texas law allows a majority of lawmakers to call a statewide vote to impose an income tax. \n\nProp. 4 requires 2/3 of legislators to propose an income tax, making it nearly impossible. Proposition 4 prohibits a state income tax Texas has long prided itself on not having a state income tax and Proposition 4, which will appear on November's ballot, seeks to keep it that way, proponents say. The Texas Constitution currently... statesman.com", "2019-10-13T19:30:08.000Z": "In true Texas fashion. Congratulations @Simone_Biles ! Well deserved. Quote Tweet Team USA @TeamUSA . @Simone_Biles isn't just the most decorated woman in world championships history... \n\nShe's the most decorated gymnast in world championships history PERIOD.  #Stuttgart2019 Show this thread", "2019-10-13T19:05:35.000Z": "Happy 244th Birthday, @USNavy !\n\nThank you to all the brave men & women who continue to defend and serve our great nation. #244NavyBday", "2019-10-12T22:51:51.000Z": "Smokey Quote Tweet Matt Foster @mattmfoster One of the reasons you should never mess with #Texas : Our Governor, ... @GregAbbott_TX  , has a cannon and isn't afraid to use it... #TexasFight  #Txlege", "2019-10-12T22:39:03.000Z": "Hard fought battle today. Always proud to be a Longhorn. #HookEm", "2019-10-12T19:58:30.000Z": "Great game for the #RedRiverRivalry . \n\nI think we will see these two teams play again for the Big 12 Championship. #HookEm Quote Tweet Texas Longhorns @TexasLonghorns Longhorn Nation, thank y'all for coming to Dallas and supporting this team. GIF", "2019-10-12T18:54:53.000Z": "Let's do this, Coach. #HookEm  @TexasFootball", "2019-10-12T04:24:31.000Z": "Every restaurant in Dallas tonight. #HookEm", "2019-10-12T01:30:02.000Z": "Honored to appoint and swear in the first judge for the newly created 471st District Court, Andrea Bouressa. \n\nJudge Bouressa is a 4th generation Texan from Murphy. She will uphold the Constitution and enforce the rule of law. #txlege", "2019-10-11T19:41:04.000Z": "Big 12 penalty flag on that.\nBut game on. Quote Tweet Governor Kevin Stitt @GovStitt @OU_Football is ready to remind the nation tomorrow that we're a step above TX! I'll wager @GovAbbott some @BillySimsBBQ & Dead Armadillo beer...\n\nJoin me in displaying your horns down & I'll give you a retweet! #BoomerSooner  #RedRiverRivalry", "2019-10-11T16:15:29.000Z": ". @GovStitt you can't spell HORNS UP without OU. \n\nI'll wager some great @RailheadBBQ & @LoneStarBeer on the game. What's Oklahoma putting up other than no points tomorrow? #HookEm  #RedRiverRivalry  @TexasFootball", "2019-10-11T05:27:30.000Z": "Good questions. State agencies are already working on these concerns. \n\nWe will announce information about it soon. Quote Tweet Melanie @Melannnial Replying to @GregAbbott_TX Has the LCRA investigated these areas of concern? Curious to know how this will impact our watershed. \n\nHow about the Health Department? Are there field biologists out there currently investigating these disaster zones?", "2019-10-11T03:43:07.000Z": "The City of Austin is dedicating more than $20,000 PER HOMELESS PERSON in Austin.\n\nThe problem isn't resources. It's prioritization. \n\nIt's inaction & word salad on an urgent public health & safety issue.\n\nHaven For Hope in San Antonio works.\n\nLawlessness is never the answer. Quote Tweet Greg Abbott @GregAbbott_TX Reinstating the ban on homeless camping in Austin is an essential first step to improve the safety & health of all people who live in and visit Austin. \n\nAustin can do it at next Thursday's Council meeting. \n\nRead more here: https:// statesman.com/news/20191010/ governor-tells-austin-to-reinstate-camping-ban ", "2019-10-11T01:05:06.000Z": "Reinstating the ban on homeless camping in Austin is an essential first step to improve the safety & health of all people who live in and visit Austin. \n\nAustin can do it at next Thursday's Council meeting. \n\nRead more here: Governor tells Austin to reinstate camping ban Gov. Greg Abbott on Thursday sent a letter to Mayor Steve Adler telling him to reinstate bans for people experiencing homelessness to camp in public places. \"The consequences of repealing the ban are... statesman.com", "2019-10-09T20:28:48.000Z": "So proud of Simone Biles as she Becomes the Most Decorated Female Gymnast in History With 21st Medal.\n\nAlso proud to call her a Texan. Simone Biles Becomes Most Decorated Female Gymnast in History Simone Biles' win at the world gymnastics championships in Germany on Tuesday, October 8, made her the most decorated female gymnast in history - details usmagazine.com", "2019-10-09T16:02:08.000Z": "UT professor wins Nobel prize in chemistry for his work in developing lithium-ion batteries. \n\nOur universities are home of the very best who are improving the world around us. #txlege UT professor wins Nobel prize in chemistry for work on lithium-ion batteries The man behind one of the most important inventions in modern technology won a Nobel Prize on Wednesday. And he just happens to be a Texan. John Goodenough, a professor at the University of Texas... statesman.com", "2019-10-09T15:30:13.000Z": "Watch this video. \n\nIs Austin's policy of allowing the homeless to do whatever they want really helping the homeless?  \n\nWe know it's bad for Austin. Quote Tweet Mitch Carney @MECarney_ Folks are now being attacked on their way to work in downtown Austin. Homeless man attacks commuter and throws scooter through his car window.  Thanks @MayorAdler Cc: @_morganlloyd", "2019-10-09T02:59:10.000Z": "We continue to see property tax cuts like these resulting from the property tax reforms passed this legislative session.\n\nSpring Independent School District approves the lowest property tax tax rate in 20 years. #txlege  https:// communityimpact.com/houston/spring -klein/education/2019/10/08/spring-isd-board-of-trustees-approves-lowest-tax-rate-in-20-years/ ", "2019-10-08T23:45:52.000Z": "Two years ago you DEMANDED the State provide Houston with advance funding to respond to the hurricane & predicted dire results if you didn't get it.\n\nIn Sept. 2017 I immediately handed you checks for more than $100 million. Today 35% of that remains unspent. \n\nWhere'd it go? Quote Tweet Sylvester Turner @SylvesterTurner The state of Texas has taken over spending federal money for flood mitigation. But the state has failed to expedite previous spending-Houston is still getting money for Ike recovery. This is a money grab by the state to spend it in places outside Houston and Harris County.", "2019-10-08T21:37:01.000Z": "Lincoln Riley knows what's up. \n\nHe saw the score & went all #HookEmHorns in the middle of the last #RedRiverRivalry . #HookEm", "2019-10-08T18:45:01.000Z": "Mayor you DEMANDED that Houston get its own allocation of over $1 billion in Fed. funds to rebuild housing.\n\nYou've rebuilt less than 10. Where did all the money go?\n\nDuring that same time the General Land Office has rebuilt almost 1,000.\n\nThe GLO didn't slow you down. You did. Quote Tweet Sylvester Turner @SylvesterTurner The state of Texas has taken over spending federal money for flood mitigation. But the state has failed to expedite previous spending-Houston is still getting money for Ike recovery. This is a money grab by the state to spend it in places outside Houston and Harris County.", "2019-10-08T18:26:48.000Z": "Homeless man charged with arson in connection to 7-Eleven fire by UT campus.\n\nYesterday there was a story about a homeless man arrested for trying to steal from a convenience store & assaulting its owner.\n\nMy goal is to end these crimes & restore safety. Homeless man charged with arson in connection with 7-Eleven fire near UT campus A homeless man has been arrested in connection with a September fire behind a 7-Eleven near the UT campus. kxan.com", "2019-10-08T03:34:34.000Z": "The #1 Cowboy fan. Quote Tweet Carolyn M. Price @cowboy1fanprice Sugh a blessing to meet you at the #Cowboys game Sunday Governor @GregAbbott_TX Love and blessings Ms Price your @dallascowboys #1 fan!  #CowboysNation", "2019-10-07T21:31:29.000Z": "\"By just about any measure Texas stands out as the nation's leader for logistics.\n \nFor the 17th year in a row Texas topped the nation as the number one exporting state.\n\nFor 15th consecutive year Texas was named the Best State for Business.\"\n\nJust sayin' U.S. Ports: Sizing Up The Logistics Industry U.S. ports are in it for the long haul: expanding their services and dredging harbors to make way for ships carrying gigantic containers. businessfacilities.com", "2019-10-07T17:05:28.000Z": "A surge of border crossings is expected this weekend.\n\nSo I'll shut down all border crossings on the Red River for 72 hours beginning Thursday Oct. 10th. \n\n\n\nJust kidding. \nThe last thing I'd do is to stop the Sooners coming to Texas to lose again. #Hookem  #RedRiverRivalry"}