{"2020-07-09T18:23:32.000Z": "If we can't change their minds, we have to change their seats. It's exactly what Virginians did last November. Elections matter. Quote Tweet Virginia Democrats @vademocrats Exactly one year ago, Republicans in the General Assembly ended a special legislative session on gun violence in just 90 minutes with no progress.\n\nToday Democratic leaders joined @GovernorVA to sign landmark gun safety bills into law. https:// nbc12.com/2020/07/09/gov -northam-holding-ceremonial-bill-signing-gun-legislation/ ", "2020-07-01T21:10:45.000Z": "A monumental day in Richmond that begins the important process of removing these painful symbols of our past.\n\nThank you, next.", "2020-06-24T02:13:54.000Z": "Congratulations to @QasimRashid , @Donald_McEachin  @DrCameronWebb , and @ElectConnolly on your primary wins tonight. Let's keep working to keep Virginia blue!.", "2020-06-23T13:48:34.000Z": "Today is #PrimaryDay ! Polls will be open until 7:00 PM. Please remember to wear a mask.  If you requested your absentee ballot, but did not complete it and decided to go to the polls today, you must take your ballot with you or you will be required to vote a provisional ballot.", "2020-06-09T16:40:52.000Z": "A picture is worth a thousand words. This monument is deeply connected to the other two articles on the @RTDNEWS front page. \n\nMake no mistake: it will come down.", "2020-06-06T22:11:40.000Z": "Today, we remember the brave forces who stormed the beaches at Normandy, risking everything to defeat fascism. \n\nAs the world honors their sacrifice on this 76th anniversary of #DDay , may their example inspire us to unite in the cause of freedom and justice for all.", "2020-06-05T13:19:42.000Z": "Happy Birthday, Madam Speaker! @EFillerCorn", "2020-05-16T17:39:30.000Z": "US House candidate, VA-10 A big thank you to @PamNorthamVA & @AtoosaReaser for joining today's #JavawithJennifer . Don't worry if you couldn't watch live! Our full conversation on early childhood education and childcare can be found on my on my Facebook page  https:// facebook.com/JenniferTWexto n/live ", "2020-05-12T23:18:25.000Z": "Today, I was proud to help distribute 40,000 units of PPE to underserved neighborhoods in @CityRichmondVA . This health crisis continues to expose deep-rooted inequities experienced by communities of color, and we must remain focused on advancing equity as we respond to #COVID19 .", "2020-05-12T15:00:12.000Z": "Virginia Gov. Ralph Northam and Arkansas Gov. Asa Hutchinson join The Post for back-to-back interviews on the impact of the coronavirus pandemic in their states. The Washington Post @washingtonpost Virginia Gov. Ralph Northam and Arkansas Gov. Asa Hutchinson join The Post for back-to-back interviews on the impact of the coronavirus pandemic in their states.", "2020-05-09T20:54:54.000Z": "7 CD's down, 4 to go!  Exciting day - lots of energy! Quote Tweet Andrew Whitley @AndrewWhitleyVA Another round of incredible conventions today. Today more than 600 Democrats across the Commonwealth tuned in!\n\nShoutout to our amazing CD Chairs, our Chairwoman, and all our special guests. We're continually grateful for your leadership, friendship, and support. Onwards!", "2020-05-05T19:12:55.000Z": "This #TeacherAppreciationWeek , @FirstLadyVA and I want to thank Virginia's teachers and all they do to ensure our students have the tools they need to build successful lives.\n\nNow more than ever, let's show them our gratitude and #ThankATeacherVA : https:// thankateacherva.com", "2020-05-02T15:14:47.000Z": "Enjoyed speaking with great Democrats in the 3rd and 9th Congressional districts with Speaker @EFillerCorn and @BobbyScott . Let's win in November. @vademocrats", "2020-05-02T13:21:14.000Z": "Honored to address 1st District Democrats this morning with Speaker @EFillerCorn . Let's win in November. @vademocrats", "2020-04-24T23:51:11.000Z": "Our #ForwardVirginia blueprint will help guide the Commonwealth on when and how to begin easing public health restrictions safely.", "2020-04-24T00:39:08.000Z": "As Muslims across Virginia and around the world mark the beginning of Ramadan and find new ways to connect amid these difficult times, Pam and I extend our best wishes for blessed month that brings good health, peace, and happiness to all who observe. #RamadanMubarak !", "2020-04-23T12:37:09.000Z": "I thank legislators for their hard work during yesterday's reconvened session, especially under such unprecedented circumstances. I am grateful for their support of my proposals to help ease the impacts of the #COVID19 pandemic on Virginians, our economy, and our state budget.", "2020-04-22T00:58:41.000Z": "Let's work together to fix this health crisis. Quote Tweet MSNBC @MSNBC Virginia Gov. Northam says \"mixed messages\" from President Trump on Twitter \"counterproductive.\"\n\n\"We've obviously want to follow the CDC guidelines ... when we can responsibly and safely lift these restrictions, we'll do it in Virginia.\" https:// on.msnbc.com/2wWCFK4", "2020-04-21T01:45:33.000Z": "As #YomHaShoah begins tonight, #WeRemember the lives of the six million Jews and countless other victims killed during the Holocaust. We must strive to honor the legacy we commemorate on this day by working to build a world that is free from hate and welcoming of all.", "2020-04-19T13:47:23.000Z": "Gov. Ralph Northam on President Trump's call to \"liberate\" Virginia: \"This is not the time for protests, this is not the time for divisiveness. This is time for leadership that will stand up and provide empathy ... it's the time for truth\" #CNNSOTU", "2020-04-19T00:30:13.000Z": "EXCLUSIVE: @GovernorVA  @RalphNortham joins @jaketapper on #CNNSOTU .", "2020-04-17T13:42:50.000Z": "Virginia's tireless LGBTQ advocates win legal protection at last. Opinion | Virginia's tireless LGBTQ advocates win legal protection at last Ralph Northam signed a bill adding sexual orientation and gender identity as part of the state's anti-discrimination law. washingtonpost.com", "2020-04-16T15:16:02.000Z": "Today, we honor 32 members of the @virginia_tech community who tragically lost their lives, and those who were wounded, on this day thirteen years ago. We will never forget them or stop fighting for a world free from this senseless violence. #VTWeRemember  https:// governor.virginia.gov/newsroom/procl amations/proclamation/virginia-tech-remembrance-day.html ", "2020-04-15T13:32:38.000Z": "Congrats Martha, well earned! Quote Tweet Delegate Martha Mugler @MarthaMugler Thrilled to be named VEAs Legislative Rookie of Year! twitter.com/VEAFund/status", "2020-04-13T19:25:01.000Z": ". @GovernorVA made Election Day a holiday in Virginia, removed the ID requirement, and expanded early voting.\n\n\"Voting is a fundamental right, and these new laws strengthen our democracy by making it easier to cast a ballot, not harder.\" Virginia governor makes Election Day a holiday and expands early voting Virginia Gov. Ralph Northam announced Sunday that he signed a series of new measures into law aimed at expanding access to voting in the commonwealth. cnn.com", "2019-01-17T14:09:28.000Z": "As my friend, @RalphNortham , would say. There's no excuse that a group of legislators, most of whom are men, should be telling women what they can and cannot do with their bodies. Quote Tweet NARAL Pro-Choice VA @NARALVirginia . @SenatorLocke and @JennMcClellanVA bills to repeal some TRAP restrictions were rolled together by the Education & Health Committee and will now be voted on as one. @SenatorLocke : \"Women know what they're doing.\" #REPEALAct", "2019-01-14T22:34:21.000Z": "Thank you to all those who helped us kick off a fantastic first year in office during inauguration weekend. We look forward to three more years of exciting progress and service to the Commonwealth! Quote Tweet Pam Northam @PamNorthamVA For the next four years @RalphNortham and I look forward to working to make a difference in the lives of children. To me that is what #TheWayAhead is all about. Let's start at the beginning with our greatest treasure. Our children.", "2019-01-13T01:49:52.000Z": "Congratulations to @IbraheemSamirah on winning the Democratic nomination for the 86th House District. I am looking forward to working with you to keep Virginia's progress going.", "2019-01-12T19:53:30.000Z": "Congratulations, Senator! Quote Tweet Jennifer Boysko @JenniferBoysko Thank you to everyone who made this possible - for your hard work, dedication and commitment to a better Virginia for everyone. Let's get to work!", "2019-01-10T17:29:04.000Z": "In the age of federal gridlock, @GovernorVA said last night, \"This isn't Washington. We come to Richmond to do the people's work.\"\n\nDemocratic Leader @EFillerCorn echoed this sentiment this morning floor, with a willingness to work across the aisle for the common good of VA.", "2019-01-10T17:56:49.000Z": "When we work together, there is nothing we can't achieve for Virginia's future. https:// google.com/url?sa=i&sourc e=web&cd=&ved=2ahUKEwjXsPfX5OPfAhVDiOAKHatrC9YQzPwBegQIARAC&url=https%3A%2F%2Fwww.richmond.com%2Fnews%2Fvirginia%2Fgovernment-politics%2Fgeneral-assembly%2Fin-era-of-national-gridlock-and-division-northam-urges-virginia%2Farticle_9d8c5072-d55c-5c16-a2f8-fd259fbd8b63.html&psig=AOvVaw04IansFPknf5Czx4jbzXoA&ust=1547229367459202 ", "2019-01-09T16:40:28.000Z": "Tonight I'll give an update on the State of our Commonwealth-but before that, I want to look back at all we've achieved together during my first year in office. http:// governor.virginia.gov/yearone  #OneYearStrongerVA", "2019-01-09T00:42:46.000Z": "Congratulations to @JenniferBoysko on your victory this evening. I look forward to continuing to work with you as you take on your new role in the Virginia Senate. The people of the 33rd District are in good hands.", "2018-12-03T20:38:34.000Z": "I am thrilled to announce our unity in partnership with Governor @ralphnortham , Leader @dicksaslaw , and Leader @deltoscano and @thedlcc's $1M early investment in flipping Virginia blue in 2019. (1/8)", "2018-11-18T01:11:35.000Z": "Congratulations to @JenniferBoysko on her nomination this evening. Together, we will keep making progress for the Commonwealth.", "2018-11-14T00:29:36.000Z": "The Commonwealth will have great new representation come January. Quote Tweet Elaine Luria @ElaineLuriaVA US House candidate, VA-2 Great to see @JenniferWexton and @SpanbergerVA07 tonight! Looking forward to working together to do good work for VA!", "2018-11-07T04:26:32.000Z": "Congratulations to @ElaineLuriaVA and @SpanbergerVA07 on their wins tonight. They will make outstanding members of Congress for Virginia.", "2018-11-07T00:51:38.000Z": "Congratulations to @timkaine and @JenniferWexton on their victories! #BringItHome", "2018-11-06T12:25:35.000Z": "I encourage all Virginians to go out and vote today. I am supporting @timkaine  @SpanbergerVA07  @ElaineLuriaVA  @JenniferWexton @TeamCockburn @Vangie4Congress and the other great Democratic candidates this year. No matter who you support, go out and vote!", "2018-11-06T00:58:42.000Z": "US House candidate, VA-7 #VA07 Election Eve Rally @RalphNortham", "2018-11-06T00:52:59.000Z": "We are ready to bring it home in Virginia for @timkaine  @SpanbergerVA07 . #GOTV  #VA07  #vasen", "2018-11-06T00:29:46.000Z": "Getting ready to fire up the crowd in JR Tucker for @timkaine and @SpanbergerVA07", "2018-11-05T11:40:44.000Z": "Let's bring it home in the 7th with @SpanbergerVA07 and @timkaine . Quote Tweet Abigail Spanberger @SpanbergerVA07 US House candidate, VA-7 Join #TeamSpanberger and Sen. @timkaine for an Election Eve Rally TOMORROW in #Henrico ! Special guest Gov. @RalphNortham will be with us at Tucker High School as we fire up the crowd to #Flipthe7th and reelect Sen. Kaine! Register below: http:// bit.ly/elecrally  #VA07", "2018-11-04T21:58:19.000Z": "#GOTV Quote Tweet Virginia Democrats @vademocrats Governor @RalphNortham , @Vangie4Congress Williams & DPVA Chair @SusanRSwecker = Democratic Dream Team!  #GOTV  #VA01", "2018-11-04T19:26:04.000Z": "US House candidate, VA-7 Governor @RalphNortham visited our Orange office today and met with our spectacular volunteers! Thank you, Governor. Thank you, #TeamSpanberger . #VA07  #GOTV", "2018-11-04T20:21:33.000Z": "Out in Fredericksburg, and they are fired up for @timkaine and @Vangie4Congress . Let's bring it home.", "2018-11-04T18:39:49.000Z": "Orange County Democrats are ready to bring it home for @timkaine and @SpanbergerVA07 . #BringItHome", "2018-11-04T18:08:44.000Z": "It was a great crowd in Spanberger HQ in Orange with @SusanRSwecker . @SpanbergerVA07 is going to be a great Congresswoman for Virginia.", "2018-11-04T17:12:22.000Z": "Kicking off a canvass today in Charlottesville to elect @TeamCockburn and @timkaine . #BringItHome", "2018-11-04T00:06:12.000Z": "US House candidate, VA-2 I'm running for Congress because #VA02 deserves better than the division we see coming out of Washington.", "2018-11-03T16:54:04.000Z": "So grateful to have @RalphNortham join us in #FL18 to get out the vote for @AndrewGillum , @SenBillNelson , and Democrats up and down the ballot!", "2018-11-03T22:52:29.000Z": "We had a great day campaigning for @AndrewGillum today. Tomorrow we are working hard for @timkaine and  Virginia Democrats.", "2018-11-03T15:48:58.000Z": "Bringing it home with @FairfaxJustin for @AndrewGillum .", "2018-11-03T14:58:25.000Z": "Great to be out campaigning today for @AndrewGillum . He will make a great Governor for Florida and finally expand Medicaid for over 1 million Floridians who need health care. #bringithome .", "2018-08-25T19:56:09.000Z": "US House candidate, VA-2 Thank you @RalphNortham for your leadership today as we work to create change for #VA02 . #TeamElaine", "2018-08-25T14:46:25.000Z": "Virginia is better for reporters like @DaveRess1 and I'm saddened by the news he suffered a heart attack on his way to do what he does best: break news. If you're able to support Dave and his family, his @DailyPress colleagues have set up this page Rally 'Round Ress organized by Leah Price Our intrepid friend Dave Ress, who has been gleefully poking around in the most important issues in our r Leah Price needs your support for Rally 'Round Ress gofundme.com", "2018-08-23T20:57:00.000Z": "US House candidate, VA-2 We are so pleased to be welcoming @RalphNortham and his support this Saturday, August 25. Join us at 3pm for canvassing, phone banking, or to pick up one of our new yard signs! https:// events.mobilizeamerica.io/luriaforcongre ss/event/14837/ ", "2018-08-07T13:50:46.000Z": "Thank you Justin Fairfax for doing the important work of electing more Democratic Lieutenant Governors across the country this year. The Democrats' Latest Weapon Is...Lieutenant Governors? Yes, Really. | Washingtonian (DC) Virginia Lieutenant Governor Justin Fairfax will spearhead the launch of the Democratic Lieutenant Governors Association. washingtonian.com", "2018-07-26T18:24:26.000Z": "US House candidate, VA-2 I am incredibly honored to receive @GovernorVA 's endorsement. I'm looking forward to continuing the momentum he started last year by flipping his home seat blue this November! #VA02", "2018-06-30T13:51:15.000Z": "US House candidate, VA-7 Thank you, Governor @RalphNortham . I value your support and encouragement, and I look forward to working together to improve the lives of our hard-working, Central Virginia families. #VA07", "2018-06-19T18:17:24.000Z": "Today I'm recalling four Virginia National Guard soldiers and one helicopter from Arizona. Virginia will not devote any resource to border enforcement actions that support the inhumane policy of separating children from their parents. Governor Northam Recalls Virginia National Guard Troops from U.S. Southwest Border Governor Ralph Northam today issued the following statement after he ordered the recall of four Virginia National Guard Soldiers and one helicopter from the U.S. Southwest border in response to the... governor.virginia.gov", "2018-06-13T17:57:57.000Z": "Virginians are looking for leaders with a moral compass-that's my friend @timkaine all the way. He speaks to the best in us, his opponent speaks to the worst. I'm ready to work hard to send him back to the Senate- are you ready to join us? http:// timkaine.com/volunteer", "2018-06-01T00:42:22.000Z": "Glad to join 13 other governors to say #NoGagRule . This dangerous proposal poses serious risks to women's health. Democratic governors threaten to sue over Trump abortion rule The rule would effectively make it harder for Planned Parenthood to obtain federal family-planning grants. nbcnews.com", "2018-05-31T00:16:21.000Z": "The loudest voices in this long-standing conversation on Medicaid expansion have been those of Virginians. We have heard you. Thank you. Quote Tweet Ralph Northam @GovernorVA Today a bipartisan group of leaders in the Virginia Senate voted to make history and make people's lives better. #MedicaidExpansionVA", "2018-05-08T15:03:08.000Z": "It's time for Senate Republicans to come to the table. Editorial: Playing chicken with Virginia's credit score It's hard to know how much of the current game of chicken House Republicans and Senate Republicans are playing is mostly just positioning and theater, and how much of it richmond.com", "2018-04-23T14:22:30.000Z": "At 16 years old, Barbara Johns led a strike to protest unequal conditions in her school, a stand that led to the landmark Brown v. Board decision. Today in Virginia we celebrate this civil rights icon's life and legacy with the first ever Barbara Johns Day.", "2018-04-19T18:46:20.000Z": "Sharing with @LinkedIn my vision for training a 21st-century workforce and building an economy in Virginia that works for everyone.", "2018-04-16T13:46:50.000Z": "Today we honor the memory of 32 students and faculty who were taken us from us on April 16, 2007 at @Virginia_Tech . Let's commit to do everything we can to keep our families and communities safe.", "2018-04-04T19:43:37.000Z": "Today I've signed into law the commonsense criminal justice reform package that will raise Virginia's felony larceny threshold for the first time in decades. I applaud leaders from both sides of the aisle for coming together to get this done for the Commonwealth.", "2018-04-04T12:28:15.000Z": "The nation lost Dr. King 50 years ago today, but his inspiring words are eternal: \"Make a career of humanity. Commit yourself to the noble struggle for equal rights. You will make a better person of yourself, a greater nation of your country, and a finer world to live in.\" #MLK50", "2018-04-03T17:33:52.000Z": "There's no one better for Virginia than my friend @timkaine . Good to be with him in Norfolk as he kicks off his campaign! #TK4VA", "2018-03-25T21:12:41.000Z": "During Desert Storm I treated soldiers on the receiving end of weapons of war and I can tell you that no student should have to do the same. It's time for us to do what is asked of us as elected officials and take action. Quote Tweet CNN Breaking News @cnnbrk Former GOP Sen. Rick Santorum suggests students protesting for gun control would be better served by taking CPR classes https:// cnn.it/2G40V0h", "2018-03-25T17:21:56.000Z": "Join me in supporting @anniepeavy , an inspiring para-equestrian I'm proud to call my friend #Peavy4Sullivan Quote Tweet US Equestrian @USequestrian Thanks to everyone who voted, @anniepeavy is now a FINALIST for the 88th @TheRealAAU James E. Sullivan Award! Let's take her all the way!!\n\nVOTE  http:// bit.ly/AngelaPeavy4Su llivan   or use #Peavy4Sullivan  https:// usef.org/media/press-re leases/us-para-dressage-athlete-annie-peavy-named-a ", "2018-03-24T16:36:15.000Z": "The energy here at the #MarchForOurLives is inspiring-we owe it all of our kids to keep this energy going beyond today.", "2018-03-24T13:42:20.000Z": "Honored to be with #Parkland students, families, and teachers this morning before we join them at the #MarchForOurLives . We should all be spurred to take action to end gun violence and ensure this happens #NeverAgain", "2018-01-14T19:42:00.000Z": "Thank you Virginia for a historic and memorable weekend. Here's to the next four years. #TheWayAhead", "2018-01-14T17:46:08.000Z": "I'm so proud to have you as my partner on this adventure, Pam. Quote Tweet Pam Northam @PamNorthamVA Thank you all for joining us this morning for our First Lady's brunch! #TheWayAhead", "2018-01-13T17:22:32.000Z": "I'm ready, Virginia. Follow @GovernorVA to keep up with the swearing-in ceremony and for official updates over the next four years.", "2018-01-13T15:34:52.000Z": "Thank you to the pastors who joined me on this special morning for breakfast and prayer.", "2018-01-12T14:38:33.000Z": "Looking good to me! It'll be an honor to have you with me tomorrow @VMI1839 . VMI cadets prepare for special march in governor's inaugural parade As the largest performer in the parade, the Corps of Cadets will certainly draw attention and they hope it's for all the right reasons. wsls.com", "2018-01-12T01:54:04.000Z": "Kicking off the inaugural weekend with @TerryMcAuliffe , @DSMcAuliffe , @RalphNortham , @FairfaxJustin , my campaign team and friends from all over Virginia!", "2018-01-11T22:09:21.000Z": "This is a bad idea-withholding health coverage for people who can't work will only make it harder for them to get a job and realize their full potential. Quote Tweet The Washington Post @washingtonpost Trump administration to allow work requirements for Medicaid recipients, a major shift that could bring legal challenges http:// wapo.st/2Ftpvnh", "2018-01-11T20:47:12.000Z": "I've got a couple saved for you, @TerryMcAuliffe . Quote Tweet The Way Ahead @TheWayAheadVA Bottoms up The inauguration is almost here! Check out the bottles for InaugurALE, the custom-made beer for the inauguration, brewed by @COTUbrew", "2018-01-11T17:57:46.000Z": "It's been an honor serving as your lieutenant governor. I'm looking forward to continuing our friendships and our work to make life better for every Virginian, no matter who you are, no matter where you're from.", "2018-01-11T15:44:57.000Z": "The decision to exempt Florida from the administration's offshore drilling plan is encouraging. Today I'm asking that the same exemption be made for Virginia.", "2018-01-11T00:53:53.000Z": "I've said this before, but it bears repeating: @TerryMcAuliffe has been the right person at the right time for Virginia. Thank you and your family for your service to this great Commonwealth.", "2018-01-10T17:33:44.000Z": "Keeping your seat warm until Saturday, @FairfaxJustin .", "2018-01-10T13:38:58.000Z": "At this morning's Commonwealth Prayer Breakfast, I shared my prayer with all of our legislators that we can root for each other, work together, and make Virginia a little better today than it was yesterday.", "2018-01-10T03:07:59.000Z": "We'd like a word in Virginia. Quote Tweet Secretary Ryan Zinke @SecretaryZinke After talking with @FLGovScott, I am removing #Florida from the draft offshore plan.", "2018-01-09T22:14:11.000Z": "Well, it is 2018. Quote Tweet Fenit Nirappil @FenitN . @RalphNortham says he'll be the first Virginia governor with a majority-female cabinet. His answer on why is a little longer than \"Because it's 2018\" https:// washingtonpost.com/local/virginia -politics/ralph-northam-assembles-a-majority-female-cabinet-a-first-for-virginia-governors/2018/01/09/573c6262-f57d-11e7-beb6-c8d48830c54d_story.html?tid=ss_tw-bottom&utm_term=.2949cf94ffba ", "2018-01-09T19:36:24.000Z": "Great things ahead for the New Virginia Economy with the team I announced today. Esther Lee will join my administration as Secretary of Commerce & Trade and Brian Ball as Special Advisor for Economic Development and Deputy Secretary.", "2018-01-09T03:38:22.000Z": "Just a few short days before we get to work on making life better for every Virginian. Quote Tweet Jennifer McClellan @JennMcClellanVA Great kickoff to the week leading into 2018 General Assembly Session at the @VLBC2 Capitol Reception. #20Strong", "2018-01-07T16:07:31.000Z": "Ahead of a big week, I'm glad to be back for Sunday morning worship at First Baptist in Charlottesville.", "2018-01-05T17:36:45.000Z": "Like I said, all it takes is one exploration gone wrong to do Virginia immeasurable harm. Trump's Interior Department Is Ill-Prepared to Deal with the Next Big Spill - Center for American... The Trump administration's plan for offshore drilling could put oil rigs along every coastline in America-at the same time as its policies make the next Deepwater Horizon oil spill more of an... americanprogress.org", "2018-01-04T23:38:09.000Z": "Celebrating the amazing career of Virginia State Police Superintendent, Colonel Steve Flaherty! 42 years of service, including the last 14 as Superintendent. What a ride, thanks Colonel!", "2018-01-04T19:48:14.000Z": "Today's announcement puts the progress we've made at risk. Full statement here: http:// bit.ly/2qmgkBH Quote Tweet The Washington Post @washingtonpost Trump to allow drilling in all U.S. waters, despite concerns of Pentagon and coastal communities https:// washingtonpost.com/news/energy-en vironment/wp/2018/01/04/trump-administration-plans-to-allow-drilling-off-all-u-s-waters/ ", "2018-01-03T23:43:36.000Z": "Be safe and stay warm, folks. Quote Tweet Ralph Northam @GovernorVA Governor McAuliffe has declared a state of emergency ahead of the impending winter storm that is expected to impact many parts of the Commonwealth over the next 24-48 hours. http:// bit.ly/2lRjokz", "2018-01-03T20:24:54.000Z": "My thoughts and prayers are with Speaker Howell and his family. Wishing him a swift recovery. Virginia House Speaker Bill Howell hospitalized after emergency heart surgery Retiring Virginia House of Delegates Speaker William J. Howell, R-Stafford, had emergency heart surgery Tuesday night after suffering chest pains, according to a spokesman. richmond.com", "2018-01-01T01:44:18.000Z": "Let's make 2018 what #TheWayAhead is all about-staying united as one Commonwealth as we work together to lift each other up. I look forward to Virginia's bright future in 2018, and wish everyone a happy and healthy New Year.", "2017-12-29T14:59:56.000Z": "We're putting together a great team. I'm looking forward to the next four years with these great public servants by my side. Gov.-elect Northam announces picks for Secretary, Administration Change is coming to the Commonwealth as Gov.-elect Ralph Northam prepares his administration picks. wavy.com", "2017-12-25T13:25:14.000Z": "Wishing you a very Merry Christmas from our family to yours!", "2017-12-21T23:42:18.000Z": "The honor was mine. Thanks for having me, Beville. Quote Tweet Beville Library @BevilleLibrary Honored to have Virginia Governor-Elect Ralph Northam in our library to announce that our very own Atif Qarni, 8th grade Civics teacher, is the next Virginia Secretary of Education! @RalphNortham  @pwcdanica  #AtifQarni", "2017-12-21T19:15:22.000Z": "Had a great time at Beville Middle School this afternoon announcing one of their very own as our next Secretary of Education. Congratulations Atif Qarni.", "2017-12-19T21:04:43.000Z": "Every vote matters-congratulations @shelly_simonds . Looking forward to partnering with you to make life better for every Virginian, no matter who you are, no matter where you live. Quote Tweet Post Local @postlocal Democrat flips Va. House seat in recount by a single vote, creating a rare 50-50 tie in legislature http:// washingtonpost.com/local/virginia -politics/democrat-wins-va-house-seat-in-recount-by-single-vote-creating-50-50-tie-in-legislature/2017/12/19/3ff227ae-e43e-11e7-ab50-621fe0588340_story.html ", "2017-12-19T19:14:46.000Z": "I want to thank Colonel Steven Flaherty for his years of invaluable, dedicated service to the Commonwealth. The Public Safety & Homeland Security team I announced today have big shoes to fill. https:// govelect.virginia.gov/newsarticle?ar ticleId=22001 ", "2017-12-19T15:27:31.000Z": "Can't think of a better way to inaugurate the kegerator @TerryMcAuliffe 's generously leaving behind. Quote Tweet The Way Ahead @TheWayAheadVA Yesterday, @RalphNortham visited @COTUbrew to check in on the production of the inauguration's official beer, InaugurALE. A Belgian-style blonde ale, 100% of the ingredients used in InaugurALE are grown in Virginia", "2017-12-18T20:07:20.000Z": "I want to thank Governor McAuliffe and his team for the time and effort they put into the budget plan that will guide the work of my administration and the General Assembly in the coming legislative session. Quote Tweet Ralph Northam @GovernorVA Governor McAuliffe's address unveiling his biennial budget to the Joint General Assembly Money Committees: http:// bit.ly/2D03MCo", "2017-12-17T17:38:29.000Z": "I have and will continue to advocate for Medicaid expansion because it is a no-brainer for Virginia families, our budget, and our economy. We can also come together on smart policy choices that will allow us to deliver better care at lower cost.", "2017-12-15T16:41:47.000Z": "Today is the last day of #OpenEnrollment ! Go to http:// HealthCare.gov for more information about how to sign up for healthcare plans or to pick a new one. #GetCovered", "2017-12-14T21:50:59.000Z": "We should honor the victims and families affected by the senseless violence at #SandyHook with action. It's time to pass common-sense gun legislation in this country and this commonwealth. Quote Tweet Twitter Moments @TwitterMoments See how families affected by #SandyHook are advocating for justice, five years later. https:// twitter.com/i/moments/9413 06141707067392 ", "2017-12-14T20:25:43.000Z": "Congratulations to Bettina Ring on this exciting appointment. We will miss her leadership as our State Forester, but look forward to continuing our good work together to promote and manage Virginia's forests. @bkr7 Quote Tweet Ralph Northam @RalphNortham I'm proud of the team we're assembling. Today I announced Bettina Ring as our next Secretary of Agriculture & Forestry and Matt Strickler as the incoming Secretary of Natural Resources.", "2017-12-14T20:10:40.000Z": "I'm proud of the team we're assembling. Today I announced Bettina Ring as our next Secretary of Agriculture & Forestry and Matt Strickler as the incoming Secretary of Natural Resources.", "2017-12-13T18:18:14.000Z": "Transportation is vitally important to our economic progress-that's why I'm proud to share with the Hampton Roads Chamber that Shannon Valentine will be our next Secretary of Transportation.", "2017-12-13T15:43:36.000Z": "Glad I can still count on you to join me on the @kojoshow , Tom. Quote Tweet Mark Segraves @SegravesNBC4 After 28 years @tomsherwood is leaving @nbcwashington at the end of 2017. Tom will continue to contribute to @wamu Politics Hour", "2017-12-13T04:00:43.000Z": "We can build a country that works for everyone, everywhere if we choose progress over fear. Tonight proves that. Congratulations Senator-elect! Quote Tweet Doug Jones @DougJones US Senate candidate, AL Thank you ALABAMA!!", "2017-12-12T21:31:35.000Z": "Happy Hanukkah! Wishing all who celebrate a holiday filled with light, love, and peace.", "2017-12-12T19:16:35.000Z": "Would love you to join me in Richmond. #TheWayAhead Quote Tweet The Way Ahead @TheWayAheadVA NEW: You can now request tickets to attend the swearing-in of Virginia's 73rd Governor, @RalphNortham → http:// vainauguration2018.com/ceremony-ticke ts   #TheWayAhead", "2017-12-12T13:16:50.000Z": "We're all invested in ensuring our kids have access to a world-class education. I'm sharing my vision for how we'll get it done at #VAEdSummit this morning.", "2017-12-11T22:09:26.000Z": "As a pediatric neurologist, I've treated kids who rely on Medicaid and CHIP for their care. No more excuses. Congress must act. Quote Tweet Mallory Noe-Payne @MalloryNoePayne This letter is going out tomorrow to the nearly 70,000 children who get health insurance through CHIP in Virginia. Also going out in Spanish.", "2017-12-11T18:23:52.000Z": "Glad to join over 200 of Virginia's innovators at today's Virginia Is For Entrepreneurs launch.", "2017-12-07T19:27:31.000Z": "#TheWayAhead isn't just the theme of @RalphNortham 's inauguration-it's his approach to leading an exciting era of progress for all Virginians. Learn more about the celebration here: https:// vainauguration2018.com", "2017-12-05T19:53:44.000Z": "Today I sat down with Virginia's congressional delegation in Washington to discuss how we can grow our economy and make life better for every Virginian.", "2017-11-23T16:50:57.000Z": "Pam, Wes, Aubrey and I are wishing y'all a very happy Thanksgiving. This year, we're especially grateful for our friends, our colleagues, and everyone who put their faith in our ability to build a Virginia that works for everyone.", "2017-11-11T17:08:55.000Z": "Happy Veterans Day to all those who've served and their families. Thank you is hardly enough for your sacrifice.", "2017-11-08T04:16:47.000Z": "Tonight, we made history. Couldn't be prouder to be a member of the @VADemocrats . Together we'll build a commonwealth that works for everyone-no matter who you are, no matter where you're from. Congratulations to all our delegate candidates on their wins tonight!", "2017-11-08T03:35:15.000Z": "\"We live in a very diverse society  it is that diverse society that makes this country great, and as long as I'm governor, I will make sure we're inclusive.\" -Ralph", "2017-11-08T03:34:48.000Z": "\"They want to live in communities that are safe, where there aren't guns on every street corner.\" -Ralph", "2017-11-08T03:34:10.000Z": "\"They want to make sure that their children have access to a quality education.\" -Ralph", "2017-11-08T03:33:21.000Z": "\"Virginians want a job that they can support themselves and their families with.\" -Ralph", "2017-11-08T03:31:31.000Z": "\"I want you to know how humbled and honored I am to have your trust.\" -Ralph", "2017-11-08T03:28:50.000Z": "\"In Virginia, it's going to take a doctor to heal our differences, to bring unity to our people.\" -Ralph", "2017-11-08T03:28:05.000Z": "LIVE: We couldn't have done it without you, Virginia. Thank you for fighting with us-together we'll keep making progress every day. Ralph Northam on Facebook Watch LIVE: We couldn't have done it without you, Virginia. Thank you for fighting with us-together we'll keep making progress every day. facebook.com", "2017-11-08T02:25:05.000Z": "THANK YOU VIRGINIA! Tonight, Virginians sent an unmistakable message that will be heard across this nation. I am so honored that you have chosen me to serve as your attorney general for ANOTHER four years.", "2017-11-08T01:07:29.000Z": "I don't quite have the words to describe how humbled and grateful I am to be re-elected to serve as your Delegate in the 93rd District! Thank you to all of the endless support from volunteers, friends, neighbors, and Monty Mason. Let's get to work in Richmond!", "2017-11-08T01:27:43.000Z": "Thank you everyone. Looking forward to representing #va34 again in Richmond.", "2017-11-08T01:40:21.000Z": "We did it! Thank you, I am so humbled and grateful.", "2017-11-08T02:19:44.000Z": "Congratulations to a great friend and public servant @FairfaxJustin on his win tonight! Looking forward to building a stronger Virginia alongside you.", "2017-11-08T02:16:54.000Z": "Congratulations to my friend @MarkHerringVA on his win tonight. Our commonwealth is so lucky to have you-let's keep fighting for VA!", "2017-11-08T01:29:56.000Z": "Tonight we proved that we're stronger when we value and fight for one another. Onward to Richmond!", "2017-11-07T23:44:41.000Z": "If you are in line before polls close, you can vote! Have a question? Call 844-4VA-VOTE", "2017-11-07T23:10:05.000Z": "Less than ONE HOUR until polls close. Sign up to make calls for Ralph now! → http:// ralphnortham.com/makecalls", "2017-11-07T23:07:25.000Z": "Polls are closing soon! Go vote now: http:// iwillvote.com/va If you've already voted, RT so your friends do, too.", "2017-11-07T22:15:28.000Z": "You have two hours left to cast your ballot for @FairfaxJustin , @MarkHerringVA , and Ralph. Confirm your polling location, and go vote NOW: http:// iwillvote.com/va", "2017-11-07T21:06:56.000Z": "Ralph is running for governor to build a better future for our kids. Vote for him this #ElectionDay : http:// iwillvote.com/va", "2017-11-07T17:12:16.000Z": "This transplant patient just voted for @RalphNortham and @vademocrats down the ticket. What's your excuse? #GameOnVA  #ElectionDay  #VAGov", "2017-11-07T20:03:32.000Z": "Already voted? Text a friend and remind them to cast their ballot for Ralph! http:// iwillvote.com/va  #ElectionDay I Will Vote Be a voter in the 2020 election. iwillvote.com", "2017-11-07T19:23:00.000Z": "@vademocrats just left the hospital with our 3 day old baby and first stop was to #vote . If we can, you can!@roanoketimes @RalphNortham", "2017-11-07T19:10:22.000Z": "It's Election Day! Thousands of Virginians have cast their votes for Ralph-join them and confirm where you vote: I Will Vote Be a voter in the 2020 election. iwillvote.com", "2017-11-07T16:45:06.000Z": "If you're a Virginian who needs to find their polling place today, go to http:// iwillvote.com/va . Go vote! #GameOnVA", "2017-11-07T18:51:48.000Z": "In Virginia, gun safety champions @RalphNortham , @MarkHerringVA , and @FairfaxJustin are fighting for a safer future.", "2017-11-07T18:01:26.000Z": "\"Honesty, integrity, a willingness to put others before yourself: That's the way that Ralph has always lived his life.\" - @BarackObama", "2017-11-07T17:48:04.000Z": "It might be chilly out today but the polls at #VCU are on FIRE for @RalphNortham and the Dems! #GameOnVA", "2017-11-07T17:48:54.000Z": ". @RalphNortham is dedicated to making people's lives better in Virginia and will help guide our country in the right direction. Quote Tweet Ralph Northam @RalphNortham It's #ElectionDay , Virginia! What time are you heading to the polls? Confirm where you vote here: http:// iwillvote.com/va", "2017-11-07T17:03:38.000Z": "Have you taken your lunch break yet? Go vote! Confirm your polling place here: I Will Vote Be a voter in the 2020 election. iwillvote.com", "2017-11-07T16:37:05.000Z": "Virginians: my friends @RalphNortham  @FairfaxJustin  @MarkHerringVA need you to show up and vote to get across the finish line.", "2017-11-07T16:05:05.000Z": "The sky's her limit. \n\nRalph will make sure of it. http:// iwillvote.com/va  #ElectionDay", "2017-11-07T16:00:02.000Z": "We need to elect leaders who will fight for equal opportunity for every child. Vote @RalphNortham , @FairfaxForLG & @MarkHerringVA  #PinkOutVA", "2017-11-07T15:08:38.000Z": "Today #Ivoted for @vademocrats  @RalphNortham  @FairfaxJustin  @MarkHerringVA & @debrarodman73 Please vote today & keep #Virginia blue", "2017-11-07T15:26:00.000Z": "Vote @RalphNortham today - polls are open until 7 pm! #GameOnVA  #Election2017", "2017-11-07T15:18:51.000Z": "US Senate candidate, VA Just cast my ballot for @RalphNortham , @FairfaxforLG, and @MarkHerringVA . Retweet if you did too!  http:// iwillvote.com/va  #GameOnVA", "2017-11-07T15:08:42.000Z": "Thousands of Virginians are turning out to vote for Ralph. Make sure you're one of them! http:// iwillvote.com/va  #GameOnVA", "2017-11-07T14:53:47.000Z": "This growing family of #Democrats voted this morning! #GameOnVA  #IVoted  @RalphNortham  @shelly_simonds  @vademocrats", "2017-11-07T14:40:06.000Z": "Proud to cast my vote for @RalphNortham , @FairfaxJustin , @MarkHerringVA & @DelegateMark in #Virginia today. #GameOnVA - let's go win this!", "2017-11-07T12:23:25.000Z": "Beyond proud to vote VA dems today! @RalphNortham  @MarkHerringVA  @FairfaxJustin  @Lopez4VA  #GameOnVA", "2017-11-07T14:05:34.000Z": "Today, I voted for a Virginia that works for everyone-I hope you will do the same. Confirm your polling location: http:// iwillvote.com/va", "2017-11-07T13:39:35.000Z": "VA @MomsDemand proud to cast my vote 4 @RalphNortham  @FairfaxJustin  @MarkHerringVA Make sure you get out and vote today! #GameOnVA", "2017-11-07T13:19:39.000Z": "This one's for you @RalphNortham !  #GameOnVA  #RocktheVote  #VAGov  #ElectionDay  #TeamBlue", "2017-11-07T13:23:44.000Z": "Happy to vote w/ @blebude for @RalphNortham  @FairfaxJustin  @MarkHerringVA today! Psyched to get next gen excited abt voting #Election2017", "2017-11-07T13:25:48.000Z": "Ok Virginians!  It's game day. Vote for @RalphNortham and the Democratic ticket. Today we stand together as one commonwealth and one nation.", "2017-11-07T12:21:34.000Z": "The cookie says it all. Get out there and vote for Ralph Northam, Justin Fairfax, and Mark Herring today!!!! #gameonVA", "2017-11-07T12:57:57.000Z": "Cast your ballot for a lifelong public servant. Vote for Ralph Northam. Confirm your polling location: http:// iwillvote.com/va  #ElectionDay", "2017-11-07T12:25:12.000Z": "Voted @RalphNortham  @FairfaxJustin  @MarkHerringVA @debrarodman73!! #GameOnVA  #PinkOutVA  @IndivisRichmond  @IndivisibleTeam  @PPAVirginia", "2017-11-07T12:27:20.000Z": "I just voted for @RalphNortham , Justin Fairfax, @MarkHerringVA , and the Democratic ticket! Now off to volunteer. Let's win this! #GameOnVa", "2017-11-07T12:02:10.000Z": "I just voted here in Richmond for @RalphNortham , @FairfaxJustin , and @MarkHerringVA ...get out there and vote, Virginia!! #GameOnVA", "2017-11-07T12:10:07.000Z": "US House candidate, VA-8 Today's the day. I have a message for my friend @RalphNortham : I've got your back. Vote Ralph for governor today! #GameOnVA", "2017-11-07T12:03:34.000Z": "So proud to have just cast my vote for @RalphNortham  @FairfaxJustin & @MarkHerringVA this morning! I hope you'll join me.", "2017-11-07T11:58:19.000Z": "Polls are open! Confirm where you'll cast your vote for Ralph and down-ballot Democrats: http:// iwillvote.com/va  #ElectionDay", "2017-11-07T11:22:10.000Z": "Up bright & early to cast my vote for @FairfaxJustin  @RalphNortham & @MarkHerringVA (see my pinned tweet for full story) #GameOnVa", "2017-11-07T11:32:26.000Z": "Ballot cast for @RalphNortham ; now it's your turn.\n\n6am-7pm http:// iwillvote.com/va  #gameonva", "2017-11-07T11:03:27.000Z": "It's #ElectionDay , Virginia! What time are you heading to the polls? Confirm where you vote here: http:// iwillvote.com/va", "2017-11-07T01:39:05.000Z": "Ralph's a fighter-and he's not taking anything for granted this #ElectionDay . http:// iwillvote.com/va", "2017-11-07T00:56:30.000Z": "Election Day is almost upon us! Tell your neighbors and tell your friends-then get out and vote tomorrow! http:// iwillvote.com/va  #GameOnVA", "2017-11-06T23:49:40.000Z": "Do you have plans tomorrow? They better involve getting you and your friends to the polls! http:// iwillvote.com/va  #GameOnVA", "2017-11-06T22:21:22.000Z": "Tomorrow, polls in Virginia are open from 6am until 7pm. Find your polling location: http:// every.tw/2xYNS8i  #GameOnVA  #VAGov", "2017-11-06T23:27:33.000Z": "#GOTV in Blacksburg on Election Eve! Tomorrow is the day VA! #GameOnVA  @ChrisHurstVA  @RalphNortham  @FairfaxJustin  @MarkHerringVA", "2017-11-06T23:17:33.000Z": "To do tomorrow: Find your polling location http:// iwillvote.com/va  Vote Tell your friends to vote Make calls at http:// ralphnortham.com/makecalls I Will Vote Be a voter in the 2020 election. iwillvote.com", "2017-11-06T22:38:41.000Z": "What's the best way to refute Trump's lies? Vote. http:// iwillvote.com/va Quote Tweet Donald J. Trump @realDonaldTrump The state of Virginia economy, under Democrat rule, has been terrible. If you vote Ed Gillespie tomorrow, it will come roaring back!", "2017-11-06T22:09:31.000Z": "What are you going to do tomorrow? VOTE! \n\nWhere are you going to do it? Find out here: http:// iwillvote.com/va", "2017-11-06T21:49:17.000Z": "Replying to @ofirahy This group just finished 416 doors in Manassas for @RalphNortham  @FairfaxJustin  @MarkHerringVA  #GameOnVA  #vagov", "2017-11-06T21:26:39.000Z": "Questions about voting tomorrow?\n\nCall 844-4VA-VOTE!", "2017-11-06T20:43:03.000Z": "Look at this setup! @DemsatUVA are fired up for @RalphNortham , @FairfaxJustin , @MarkHerringVA and @vademocrats down ballot! #GameOnVA", "2017-11-06T20:37:51.000Z": "Do you know where you're voting tomorrow? #GameOnVA", "2017-11-06T20:19:44.000Z": "2nd #GOTV event today. @rweingarten & @AFTUnion are all in for Northam, Fairfax, Herring & down ballot candidates. #GameonVA  #Flip42Blue", "2017-11-06T19:59:47.000Z": "This son of the Eastern Shore has spent his life in service to others. Now he wants to do it as governor of Virginia.", "2017-11-06T19:15:43.000Z": "Tomorrow's the day! Make sure you know where your polling location is: http:// iwillvote.com/va", "2017-11-06T18:44:53.000Z": "5 miles btwn each house, but having great conversations with voters out in rural Crozet! Bringing it home for @RalphNortham ! #GameOnVa", "2017-11-06T18:08:08.000Z": "Who do we want fighting for our health, rights and all Virginians? Simple. Get out tomorrow! #GameOnVA  http:// ppact.io/2zmAH2q", "2017-11-06T18:18:47.000Z": ". @BarackObama knows Ralph's the best person to be VA's next governor. \nDo you know where you're voting tomorrow? http:// iwillvote.com/va", "2017-11-06T17:52:11.000Z": "Make a plan Show up tomorrow VOTE  #GameOnVA", "2017-11-06T17:39:26.000Z": "The most important thing you can do tomorrow? \n\nVOTE! http:// iwillvote.com/va  #GameOnVA", "2017-11-06T16:57:13.000Z": "The crowd for @RalphNortham in Roanoke the day before Election Day #GameOnVA", "2017-11-06T17:05:08.000Z": "We only have one more day to show folks why Ralph's the best guy for the job. Will you help spread the word? Ralph's got the momentum going into Election Day. Election Day is just two weeks away - and we're feeling the momentum across the commonwealth! From his rally with President Obama in medium.com", "2017-11-06T16:21:52.000Z": "Do you know where you're voting tomorrow? http:// iwillvote.com/va  #GameOnVA", "2017-11-06T15:41:19.000Z": "Take it from Vice President @JoeBiden : Ralph's the kind of guy you want leading Virginia.", "2017-11-06T15:24:21.000Z": "Ready to go on this beautiful Monday! #gameonVA  @RalphNortham  @FairfaxJustin  @MarkHerringVA", "2017-11-06T15:06:40.000Z": "Morning Fredericksburg have you made a plan to vote?  #GameOnVA", "2017-11-06T15:13:41.000Z": "Everyone from the LAV team is out knocking on doors to elect @RalphNortham & VA Dems! #GameOnVA", "2017-11-06T15:12:37.000Z": "With only one day left, we need you to make a plan to vote and look up your polling place! http:// iwillvote.com/va  #GameOnVA", "2017-11-06T14:44:25.000Z": "Go canvass! Go vote!", "2017-11-06T14:22:44.000Z": "Serving people is in Ralph's DNA.\n\nThat's exactly what he plans to do as governor.", "2017-11-06T02:16:04.000Z": "So proud of Team @NARALVirginia  @NARAL for rockin' #GOTV weekend! We're it bringing home for @RalphNortham  @FairfaxJustin & @MarkHerringVA Quote Tweet NARAL Pro-Choice VA @NARALVirginia Thank you volunteers Let's keep up the momentum! #GameOnVA  #GOTV  #DayTwo", "2017-11-06T00:28:56.000Z": "Amazing phonebank w/the Muslim community --200+ volunteers made more than 5,000 calls for @RalphNortham ! #GameOnVA", "2017-11-06T00:46:50.000Z": "Knocking doors with @vademocrats to keep Virginia on the path of progress!  #GameOnVA", "2017-11-06T01:03:08.000Z": "Really-time's running out. We can elect Ralph and Democrats down the ballot, but we can't do it without you. http:// events.vademocrats.org", "2017-11-06T00:11:22.000Z": "Do you know where you're voting on Tuesday? http:// iwillvote.com/va  #GameOnVA", "2017-11-06T00:00:31.000Z": "Incredible canvass launch this evening with @FairfaxForLG, @AGMarkHerring , @RalphNortham , and @TerryMcAuliffe ! #HowWeWin  #GameOnVA", "2017-11-05T22:45:40.000Z": "Who says you can't knock when it's dark? These vols won't let daylight savings get in the way of getting out the vote! #GameOnVA", "2017-11-05T23:38:45.000Z": "President @BarackObama knows Ralph's the best choice for Virginia.", "2017-11-05T23:30:06.000Z": "A big crowd to go door knocking in Lorton today for @RalphNortham & Kathy Tran @RepDonBeyer", "2017-11-05T18:46:13.000Z": "My 9-month pregnant wife and I are door knocking for Democrats in Virginia. Every person we spoke with is enthusiastic & voting! #GameOnVa", "2017-11-05T22:57:16.000Z": "A little rain won't stop us from fighting to ensure Ralph's the next governor of Virginia! http:// events.vademocrats.org  #GameOnVA", "2017-11-05T22:38:30.000Z": "When you can't believe you've trained more than 90 canvassers in one day for @RalphNortham , @FairfaxJustin , & @MarkHerringVA  #gameonva", "2017-11-05T22:39:11.000Z": "Gorgeous fall day knocking on doors for @RalphNortham  @FairfaxJustin  @MarkHerringVA in Alexandria VA today. Stakes enormous Tues. #GameOnVA", "2017-11-05T22:14:38.000Z": "We've got momentum, baby! http:// bit.ly/2yKckOt  #GameOnVA Ralph's got the momentum going into Election Day. Election Day is just two weeks away - and we're feeling the momentum across the commonwealth! From his rally with President Obama in medium.com", "2017-11-05T22:02:29.000Z": "No matter how long it takes, Caroline and Jack ALWAYS finish their packets. An example for us all. #GameOnVA", "2017-11-05T21:41:53.000Z": "Watch this. Then make a plan to vote for Democrats up and down the ballot Tuesday.", "2017-11-05T19:29:24.000Z": "Great to check out the fall foliage while we GOTV for @RalphNortham  @FairfaxJustin  @MarkHerringVA with @MomsDemand  #GameOnVA", "2017-11-05T21:35:22.000Z": "Friends that canvass together are the best kind of friends #GameOnVA", "2017-11-05T21:06:52.000Z": "Big showing at Sunday PM Fredericksburg @vademocrats canvass launch! Lots of doors for @RalphNortham , @FairfaxJustin , and @MarkHerringVA !", "2017-11-05T21:08:37.000Z": "It's folks like you who'll help us get the vote out-sign up to volunteer today. https:// events.vademocrats.org", "2017-11-05T16:29:53.000Z": "Day 2 of GOTV and volunteers are out in force to elect @RalphNortham ! #GameOnVA  #VirWINia", "2017-11-05T19:27:10.000Z": "Rain doesn't scare Simi. She's out knocking today for @RalphNortham & #votingrights champions! #GameOnVA", "2017-11-05T19:13:24.000Z": "Virginia's Muslim community working hard @RalphNortham to keep VA an open & welcoming Commonwealth. We're ready to win on Tuesday! #GameOnVA", "2017-11-05T20:32:46.000Z": "In VA, we have a name for finishing your first walk packet of the day - HALFTIME. #GameOnVA", "2017-11-05T20:33:22.000Z": "Locate your polling place and make a plan to vote on Tuesday! http:// iwillvote.com/va", "2017-11-05T20:24:21.000Z": "Call me a lover because Virginia is for me  #GOTV  #GameOnVA  @RalphNortham", "2017-11-05T19:43:49.000Z": "Praying for those injured this morning in an act of senseless violence at First Baptist Church of Sutherland Springs in Texas.", "2017-11-05T19:01:44.000Z": "Ralph's fighting to build a better Virginia for our kids. \n\nVote Tuesday.", "2017-11-05T18:43:33.000Z": ". @TerryMcAuliffe  @DPVAChair  @kmurphyva out on the trail thanking our amazing Muslim volunteers. @RalphNortham  #gameonva", "2017-11-05T18:45:53.000Z": "Make a plan to vote Nov 7th VA. #GameOnVA cc @RalphNortham", "2017-11-05T18:25:40.000Z": "Nothing like tacos, tamales & @TomPerez getting out Manassas' Latino vote for @RalphNortham ! Gracias #LaJarochita  #GameOnVA  #VAVota", "2017-11-05T18:30:33.000Z": "Over 150 STRONG at the Muslims for @RalphNortham phone bank w/ @TerryMcAuliffe  @DPVAChair FIRING up this diverse crowd. #GameOnVA", "2017-11-05T18:11:20.000Z": "How are you getting out the vote today? Sign up to help! http:// events.vademocrats.org", "2017-11-05T00:16:47.000Z": "Our next governor and the futures we're fighting for. #GameOnVA", "2017-11-05T17:57:35.000Z": "it's the most beautiful time of the year  #GameOnVA", "2017-11-05T17:09:20.000Z": "The rain won't stop us or our special guest, Rep. @DonBeyerVA . We're gonna elect Democrats. #YoungGetsItDone", "2017-11-05T17:45:07.000Z": "Andi on @RalphNortham for #VAgov : \"There are lots of important women in my life & I want to elect someone who'll fight for them.\" #GameOnVA", "2017-11-05T17:46:18.000Z": "Do you know where you're voting for @RalphNortham on Tuesday? If not, go to http:// iwillvote.com/va and find out now! #GameOnVA", "2017-11-05T17:30:53.000Z": "Ed won't stand up to Trump-heck, Steve Bannon just endorsed him.\n\nGet out and vote Tuesday.", "2017-11-05T17:22:00.000Z": "Ryan and Erica are ready to knock doors! #GameOnVA  #KeepGMUBlue", "2017-11-05T17:19:24.000Z": "Canvassers PACKED out into the parking lot (!) to go and knock for @RalphNortham , @MarkHerringVA , @FairfaxJustin , and @kmurphyva ! Game. On.", "2017-11-05T17:17:53.000Z": "I guess @TomPerez didn't get enough of Woodbridge yesterday! Hes back canvassing for @HalaAyala  @RalphNortham  @FairfaxJustin  @MarkHerringVA", "2017-11-05T17:06:00.000Z": "Even Sweet Pea knows that making a plan will increase your chances of casting a ballot on Tuesday! #GameOnVA  #GOTV", "2017-11-05T13:52:49.000Z": "An extra hour of sleep makes for happy SL Captains. Ready to #GOTV for @RalphNortham @fairfaxforlg @MarkHerringVA ! #gameonVA", "2017-11-05T17:01:05.000Z": "New sweatshirt Clip board ready Beautiful fall weather Ready to win on Tuesday\nMust be #GOTV2  #GameOnVA", "2017-11-05T16:57:12.000Z": "Can't knock doors today? Sign up to make calls! It's easy. http:// ralphnortham.com/makecalls", "2017-11-05T16:22:45.000Z": "This is @messystephy 's first time knocking doors EVER and she's doing it for @RalphNortham  #GameOnVa  #GOTV", "2017-11-05T16:16:54.000Z": "Can't canvass? Make calls  http:// ralphnortham.com/makecalls  #GameOnVA Quote Tweet Tom Perriello @tomperriello Next VA Gov will shape district maps that last until 2031. To prevent a 14 year hangover, take two walk packets today, Mon & Tues. #GameOnVA", "2017-11-05T16:14:56.000Z": "We have to spread the word about Ralph-especially now that Steve Bannon endorsed Gillespie. Knock doors, make calls, and vote!", "2017-11-05T16:08:57.000Z": "It's a beautiful day to knock doors in Hampton, VA! Julia & Bella are fired up to #GOTV for @RalphNortham , @FairfaxJustin & @MarkHerringVA !", "2017-11-05T15:58:35.000Z": "Think a little rain will stop @MomsDemand volunteers like me from canvassing for @RalphNortham and VA Dems? THINK AGAIN! #GameOnVA", "2017-11-05T15:46:01.000Z": "Half way thru first packet of the day. Down in Hampton Roads knocking for @RalphNortham @fairfaxforlg @MarkHerringVA and @shelly_simonds", "2017-11-05T15:34:42.000Z": "On our way to knock some doors in Lorton for @RalphNortham , @FairfaxJustin , and @MarkHerringVA  #knockvember  #GameOnVA", "2017-11-05T14:54:53.000Z": "Bannon & Co trying to bring their bigotry and hatred to VA.  Stay out.  VOTE Tuesday! Bannon: Trump, Stewart Voters Going to Win Virginia Governorship for 'Bush Guy' Gillespie Populist-Nationalist 2018 U.S. Senate candidate Corey Stewart addressed the Remembrance Project National Conference in Washington, DC. breitbart.com", "2017-11-05T15:39:25.000Z": "Kate & Noor on why they support @RalphNortham : \"Women's rights are under attack. Northam has a proven track record of standing w/ us\" #VAgov", "2017-11-05T15:44:57.000Z": "President @BarackObama knows Ralph's a man of integrity-and he's the best choice to serve Virginia.", "2017-11-05T15:20:14.000Z": "US House candidate, VA-10 A little rain won't stop us from knocking in Leesburg for @WendyforDel, @RalphNortham , @MarkHerringVA and @FairfaxJustin ! #GOTV  #GameOnVA", "2017-11-05T15:37:46.000Z": "Go team @NARAL  @NARALVirginia . We need every vote for @RalphNortham to send strong message to White House - #reprorights are #HumanRights Quote Tweet NARAL @NARAL NARAL members are ready for day 2 of #GOTV canvassing for @RalphNortham and pro-choice Democrats up and down the ticket! #GameOnVA  #VAgov", "2017-11-05T15:31:31.000Z": "NARAL members are ready for day 2 of #GOTV canvassing for @RalphNortham and pro-choice Democrats up and down the ticket! #GameOnVA  #VAgov", "2017-11-05T15:19:20.000Z": "The rain won't stop us from taking out six packets on a Sunday morning for @RalphNortham , @FairfaxJustin , and @MarkHerringVA  #GameOnVA", "2017-11-05T15:00:00.000Z": "Do you know where you're voting for @RalphNortham on Tuesday? If not, go to http:// iwillvote.com/va and find out now! #GameOnVA", "2017-11-05T15:10:50.000Z": "Help elect Democrats up and down the ballot and make sure you know where you're going on Tuesday, November 7! https:// iwillvote.com/VA", "2017-11-05T15:00:09.000Z": "TWO MORE DAYS! Election day in Virginia is this Tuesday. We're proud to support @RalphNortham for #VAGov !", "2017-11-05T14:25:02.000Z": "Rain or Shine, I got Ralph (and Dems) on my mind. I'm knocking 4 packets today, you? #GOTV  #2MoreDays  #VAGov  #GameOnVA  @RalphNortham", "2017-11-05T14:21:47.000Z": "Vote Tuesday.", "2017-11-05T14:11:57.000Z": ". @RalphNortham back at @themountleads for Sunday morning worship & to remind folks about a little Election on Tuesday #GameOnVA  #VAGov", "2017-11-05T14:07:59.000Z": "Steve Bannon just endorsed Ed Gillespie, leaving no doubt what's at stake in this election. Make a plan to vote NOW: I Will Vote Be a voter in the 2020 election. iwillvote.com", "2017-11-05T13:17:47.000Z": "Typical day of listening to @taylorswift13 and knocking doors in VA  #GameOnVa  #gotv  @jessalynsays", "2017-11-05T13:25:05.000Z": "Yesterday I did 18,000 steps and 10 Miles knocking on doors to GOTV for @RalphNortham and the team. Values matter! #VoteNortham  #VoteBlue Quote Tweet Terry McAuliffe @TerryMcAuliffe The rain can't stop us! Hundreds here in a Fairfax downpour are fired up for @RalphNortham , @FairfaxJustin , and @MarkHerringVA ! #GameOnVA", "2017-11-05T12:02:35.000Z": "Do you know where you're voting for @RalphNortham on Tuesday? If not, go to http:// iwillvote.com/va and find out now! #GameOnVA", "2017-11-05T01:12:10.000Z": "Three days. #GameOnVA", "2017-11-05T01:02:01.000Z": "Final NoVa rally before Election Day for @RalphNortham , greeting supporters afterward in the rain @nbcwashington", "2017-11-05T00:31:34.000Z": "A little rain won't slow us down! #GameOnVA", "2017-11-04T23:48:49.000Z": "Dems showing UP in the pouring rain for the last rally before go time! @kmurphyva  @RalphNortham  @MarkHerringVA @fairfaxforlg", "2017-11-04T23:51:09.000Z": "Carpenters turn out strong to support @RalphNortham on GOTV this weekend. Proud of all of my members and reps!", "2017-11-04T21:46:40.000Z": "Knocking in the rain = HIGH contact rates. Highlight: Spoke to a VMI classmate of @RalphNortham 's #gameonVA  #gotv  #flipthe40th", "2017-11-04T23:00:24.000Z": "Canvassed 2 routes today, then met @RalphNortham and @MarkHerringVA Let's get out the vote, Virginia! #GameOnVA", "2017-11-04T19:56:39.000Z": "Huge afternoon canvass shift in Henrico! Folks tell me responses are amazing on the doors for @RalphNortham and team! #Momentum  #GameOnVA", "2017-11-04T22:18:56.000Z": "Yes it is raining, but @pselker & I are still knocking! #GOTV for @RalphNortham & the Dems is too important-We're comin for you Ed #gameonva", "2017-11-04T22:24:00.000Z": "US Senate candidate, VA Only 3 days until election day in Virginia! Commit to vote, make a plan, and VOTE https:// iwillvote.com/commit/  #GameOnVA", "2017-11-04T21:33:49.000Z": "Ed Gillespie won't stand up to Trump-he's standing right next to him.", "2017-11-04T20:46:21.000Z": "@SEIUVA512 Pres and family out talking to working people about voting on Nov 7 for champions @RalphNortham  @FairfaxJustin  @MarkHerringVA", "2017-11-04T20:25:08.000Z": "Just a tab bit of excitement for @RalphNortham and the ticket! #GameOnVa", "2017-11-04T20:30:40.000Z": "If you need to feel more hopeful about America, go spend some time with Democratic volunteers and voters. #GameOnVA", "2017-11-04T20:42:12.000Z": "The energy is ALL on our side!!  Let's win on Nov. 7th! #GameOnVA Quote Tweet DMZ @grassrootsyaya Great launch with @TerryMcAuliffe knocking Henrico doors for @RalphNortham  @FairfaxJustin  @MarkHerringVA @debrarodman73 #GameOnVA", "2017-11-04T20:11:48.000Z": "People will not stop canvassing! #GameOnVA", "2017-11-04T20:07:52.000Z": "Ralph's whole life has been about service to others-and he's ready to serve Virginia as governor.", "2017-11-04T18:43:33.000Z": "Truly humbled to have the support of such incredible young people. Quote Tweet Young Democrats of Puerto Rico @pryoungdems PR Young Dems making calls into #Virginia . Not even #HurricaneMaria can keep us from #GOTV for @RalphNortham & @vademocrats  #GameOnVA", "2017-11-04T18:00:02.000Z": "Election Day is TUESDAY! If you care about Virginia's future, make a plan to vote for @RalphNortham ! → http:// iwillvote.com/va", "2017-11-04T16:12:01.000Z": "Educators invasion in VA for #GOTV ! Supporting @RalphNortham  @FairfaxJustin  @MarkHerringVA and @HalaAyala  #GameOnVA", "2017-11-04T18:22:45.000Z": "These #FairFamSouth volunteers are sooooo hungry for packets!!! #GameOnVA", "2017-11-04T15:08:36.000Z": "Thank you @NBisno for knocking doors in PWC for champions for working people @RalphNortham  @FairfaxJustin  @MarkHerringVA  #TogetherWeRise", "2017-11-04T17:55:55.000Z": "Can't make it out to canvass? You can still help elect Ralph and down-ballot Democrats! Sign up to make calls here: http:// ralphnortham.com/makecalls", "2017-11-04T16:28:41.000Z": "Another quick Starbucks stop while canvassing! Lady in line asked me for my @RalphNortham sticker! Yea! Happy Voting!", "2017-11-04T14:00:03.000Z": "Hear why Pulse survivor Brandon Wolf supports @RalphNortham . He'll stand up to the NRA like he's done for years. Opinion | Pulse survivor on why Northam is best for Va. governor Sensible reforms will help rein in gun violence washingtonblade.com", "2017-11-04T17:10:16.000Z": "Huge crowd in Ashburn ready to knock some doors! Sign up for a GOTV event in your neighborhood: http:// events.vademocrats.org  #GameOnVA", "2017-11-04T16:33:48.000Z": "Thank you @Schriock1 of @emilyslist for firing up our MASSIVE noon launch in Lakeridge to GOTV for @RalphNortham and @HalaAyala !! #GameOnVa", "2017-11-04T16:25:20.000Z": "Herndon looks ready to #GOTV , don't you think? #GameOnVA", "2017-11-04T16:17:10.000Z": "Ran into a whole big family of @RalphNortham fans here in downtown Petersburg! Was able to recruit them for a few canvass shifts tomorrow!", "2017-11-04T16:33:06.000Z": "So much enthusiasm today for @RalphNortham with special guest Ambassador @RichardRVerma and lots of #AAPI supporters. #GameOnVA", "2017-11-04T16:26:11.000Z": "Ralph's whole life has been centered around serving people. He cares, listens, and is the best choice for Virginia. #GameOnVA", "2017-11-04T16:12:39.000Z": "Never forget -- the future is bright for Virginia's children but we must fight to keep that way. I know one good Dr is ready for that fight! @EFillerCorn  @SenDaveMarsden  @BraddockDems  @RalphNortham  #GameOnVA", "2017-11-04T15:02:43.000Z": "These staging location volunteers who just launched 51 canvassers for @JCarrollFoy  @RalphNortham @fairfaxforlg @MarkHerringVA ! #GameOnVA", "2017-11-04T15:12:09.000Z": "Coming to a door near you (to make sure you vote for @RalphNortham  @FairfaxJustin  @MarkHerringVA  ) #GameOnVA  #GOTV", "2017-11-04T15:19:19.000Z": "#LAVfield team is making sure Virginians have a plan to vote for @RalphNortham & #votingrights champions on November 7. #GameOnVA", "2017-11-04T14:38:12.000Z": "Great GOTV canvass kickoff with @MarkHerringVA and @DSMcAuliffe for @WendyforDel and @RalphNortham . Let's go win this thing!! #GameOnVA", "2017-11-04T14:59:55.000Z": "Double the reason to vote on Tuesday! http:// iwillvote.com/va  #GameOnVA", "2017-11-04T14:40:00.000Z": "Had my door knocked by @RalphNortham canvassers and was happy to tell them I'll be voting for #RalphNortham on Tuesday! #VAGov  #GameOnVA", "2017-11-04T14:37:27.000Z": "were excited to be on the doors here in #FairFamSouth this morning!!! #GameOnVa @Tanner4Delegate @RalphNortham  @FairfaxJustin  @MarkHerringVA", "2017-11-04T14:30:01.000Z": "Happy #GOTV from @NARALVirginia ! We're so excited to knock doors for @RalphNortham , @fairfaxforlg , and @MarkHerringVA ! #GameOnVA", "2017-11-04T14:01:01.000Z": "Hey Virginians! Election Day is TUESDAY! If you care about VA's future, make a plan to vote for @RalphNortham ! I Will Vote Be a voter in the 2020 election. iwillvote.com", "2017-11-04T14:24:25.000Z": "We want to know-what are you doing this weekend to help Ralph win? Making a plan to vote Knocking on doors Calling voters #GameOnVA", "2017-11-04T13:54:47.000Z": "Ralph's the right guy for the job. See for yourself. #GameOnVA", "2017-11-04T12:39:45.000Z": "Yellow Dog Trooper is ready to #GOTV for @VAHouseDems  @MarkHerringVA  @FairfaxJustin and @RalphNortham  @DNC  #gameonVA", "2017-11-04T12:00:42.000Z": "US House candidate, VA-8 3 days until we elect @RalphNortham . Have you made your Election Day plan? Do it now → http:// iwillvote.com/va  #GameOnVA", "2017-11-04T01:36:06.000Z": "I know #VA will speak up this Tuesday & vote against @EdWGillespie & the corrupt @potus he speaks for and vote FOR #America & @RalphNortham", "2017-11-04T01:19:14.000Z": "\"We've got the victory in our sight but we can't let the pedal down!\"- @RalphNortham  #GameOnVA  #VAGov", "2017-11-04T01:17:01.000Z": ". @FreePressRVA endorses @RalphNortham for #VAGov ! http:// bit.ly/2ha01ny", "2017-11-03T23:22:53.000Z": "Birds of a feather ...", "2017-11-03T22:03:03.000Z": "Anti-immigrant, anti-abortion, pro-Confederate statues - meet Virginia's Trump-endorsed Republican candidate for governor", "2017-11-03T22:28:27.000Z": "We're counting on you to help keep Virginia blue! http:// iwillvote.com/va  #GameOnVA I Will Vote Be a voter in the 2020 election. iwillvote.com", "2017-11-03T20:30:03.000Z": "Four days left, Virginia! Let's keep up the enthusiasm and win this thing. http:// bit.ly/2yKckOt  #GameOnVA Ralph's got the momentum going into Election Day. Election Day is just two weeks away - and we're feeling the momentum across the commonwealth! From his rally with President Obama in medium.com", "2017-11-01T19:11:20.000Z": "Proud of my friend @RalphNortham . Help us elect him and Democrats up and down the ticket in Virginia next week. http:// iwillvote.com Quote Tweet Ralph Northam @RalphNortham The @Washingtonpost , @Virginianpilot , and @Daily_Press all endorsed Ralph. They know he'll be a governor for all Virginians.", "2017-11-03T19:43:37.000Z": "According to one Norfolk native, the world could use many more Dr. Northams. The World Needs More Dr. Northams One patient's story of Ralph's compassion medium.com", "2017-11-03T19:09:19.000Z": "Asian Americans will play key role in choosing Virginia's governor. There's only one choice: @RalphNortham  #GameOnVA Northam Is the Only Choice for Asian Americans in Virginia By Chris Lu medium.com", "2017-11-03T19:08:44.000Z": "We can't take this election for granted. Sign up for a shift and help your friends make a plan to vote: https:// events.vademocrats.org", "2017-11-03T17:18:55.000Z": "Ralph's G3 agenda is targeted toward workers and small businesses. Ed's tax cut agenda is targeted toward the rich. Northam's G3 Plan Supports Virginia Small Business Growth Next Tuesday Nov. 7th, Virginia voters will have a choice between two economic agendas: one invests in our workers and small businesses; the other sacrif... huffpost.com", "2017-11-03T16:45:58.000Z": "Replying to @RalphNortham This makes us so happy to endorse, support, and vote for @RalphNortham . #PinkOutVA Quote Tweet Ralph Northam @RalphNortham Ralph Northam's spent a lifetime fighting for Virginians. This Tuesday, he needs your vote.", "2017-11-03T16:23:29.000Z": "Wow! #Virginia I'm feeling inspired! Let's get it done! @RalphNortham The #Vote is Tuesday. Quote Tweet Ralph Northam @RalphNortham Ralph Northam's spent a lifetime fighting for Virginians. This Tuesday, he needs your vote.", "2017-11-03T16:43:00.000Z": "4 days to go. All hands on deck. Sign up here to go door to door this weekend: https:// events.vademocrats.org  #GameOnVA Quote Tweet Ralph Northam @RalphNortham Ralph Northam's spent a lifetime fighting for Virginians. This Tuesday, he needs your vote.", "2017-11-03T16:43:52.000Z": "Do you want to see Democrats elected up and down the ballot? Commit to vote. It's easy. http:// iwillvote.com/commit", "2017-11-03T16:14:12.000Z": "Ralph Northam's spent a lifetime fighting for Virginians. This Tuesday, he needs your vote.", "2017-11-03T15:35:28.000Z": "Election Day's only 4 days away, and we couldn't be more excited. Ralph's got the momentum going into Election Day. Election Day is just two weeks away - and we're feeling the momentum across the commonwealth! From his rally with President Obama in medium.com", "2017-11-03T15:19:44.000Z": "Let's do this Virginia! Making calls to elect @RalphNortham   @letamericavote  #GameOnVA", "2017-11-03T15:21:12.000Z": "At stake on Tuesday: a pragmatic progressive or a fringe fanatic.\n\nWe're with @RalphNortham . #GameOnVA", "2017-11-03T15:07:44.000Z": "Ed Gillespie's and Donald Trump's policies are more alike than Ed would like to admit.", "2017-11-03T14:29:57.000Z": "The @FreePressRVA knows how important Tuesday's election is. That's why it just endorsed the Democratic ticket. Top of the ticket We cannot stress enough the importance of voting in Tuesday's election for Virginia's next governor, lieutenant governor and attorney general. richmondfreepress.com", "2017-11-03T13:57:59.000Z": "Before Ralph ever ran for office, he was a pediatrician. Read this story from one of his patients: The World Needs More Dr. Northams One patient's story of Ralph's compassion medium.com", "2017-11-02T23:58:01.000Z": ". @RalphNortham \"I don't know about you but I'm proud to be a @vademocrats and ready to win on Nov 7th!\" @fairfaxblue  @ssurovell  @KrizekForVA  #GameOnVa", "2017-11-02T23:29:20.000Z": "we're ready for @RalphNortham are you? #GameOnVA  #FairFamSouth", "2017-11-02T23:34:57.000Z": "Latina women make 54 cents for every dollar a white man makes. It's long past time we ensure equal pay for equal work. #LatinaEqualPay", "2017-11-02T23:02:00.000Z": "As a national service program alum, @RalphNortham 's G3 plan is one of the reasons I'm honored to work on his campaign team! #GameOnVA Quote Tweet Ralph Northam @RalphNortham Ralph's G3 plan will be a boon to Virginia's economy. http:// bit.ly/2gUA87N", "2017-11-02T22:29:27.000Z": "Help elect Democrats up and down the ballot on November 7 and sign up for a shift here: Democratic Party of Virginia Providing news, issues, links and volunteer opportunities. vademocrats.org", "2017-11-02T21:26:52.000Z": "Ralph's G3 plan will be a boon to Virginia's economy. Northam's G3 Plan Supports Virginia Small Business Growth Next Tuesday Nov. 7th, Virginia voters will have a choice between two economic agendas: one invests in our workers and small businesses; the other sacrif... huffpost.com", "2017-11-02T20:56:12.000Z": "Just met Sunnie, a @PPAVirginia volunteer. We're both knocking doors for pro-choice candidates @RalphNortham and @VoteforFowler! #GameOnVA", "2017-11-02T20:21:50.000Z": "Do you know where you'll vote? Do you know when you'll head to the polls? Make a plan. I Will Vote Be a voter in the 2020 election. iwillvote.com", "2017-11-02T19:01:01.000Z": "Taking healthcare away from millions to give a massive tax cut to the rich is unconscionable. Virginians deserve better.", "2017-11-02T18:05:49.000Z": "With only five days until voters head to the polls, Ralph's got the momentum. Trump Factor Dominates in Tight VA Governor Race Virginia voters hit the polls Nov. 7 for a high stakes governor's race, one of only two in the country and the first competitive statewide contest since Dona... youtube.com", "2017-11-02T17:01:44.000Z": ". @RalphNortham is a true champion for #reprofreedom - and NARAL members are excited to support his campaign for #VAgov ! #GameOnVA", "2017-11-02T17:00:41.000Z": "The half-baked tax bill Republicans put forward is a tax giveaway for the rich while hardworking families suffer-and we're not buying it.", "2017-11-02T15:36:47.000Z": "Vice President @JoeBiden tells it like it is-and he knows Ralph's the best guy for the job.", "2017-11-02T13:45:58.000Z": "Halloween may have passed, but our Broad St. phone bankers still need some fuel. 5 days left to get out the vote! #GameOnVA", "2017-11-02T14:09:30.000Z": "Virginia's fired up and ready to vote for Ralph on November 7. See for yourself: Ralph's got the momentum going into Election Day. Election Day is just two weeks away - and we're feeling the momentum across the commonwealth! From his rally with President Obama in medium.com", "2017-11-02T01:17:24.000Z": "Virginia, in six days you can show our country that division and hatred do not reflect the ideals of who we are.", "2017-11-02T00:20:54.000Z": "Virginia women will have a clear choice for attorney general. Proud to have support of so many VA women legislators! An Open Letter To The Women Of Virginia On The Importance Of Voting For Attorney General We've run enough campaigns to know that things can get pretty silly towards the end. The dubious claims and accusations start to fly and voters just wind... huffpost.com", "2017-11-01T23:53:33.000Z": "The kind of growth that Ralph's G3 plan would facilitate is critical to keeping VA economically competitive. Northam's G3 Plan Supports Virginia Small Business Growth Next Tuesday Nov. 7th, Virginia voters will have a choice between two economic agendas: one invests in our workers and small businesses; the other sacrif... huffpost.com", "2017-11-01T22:08:04.000Z": "Kids shouldn't have to worry about their safety coming home from school. VA needs commonsense gun safety. After Richmond school bus hit by gunfire for third time in less than two years, district taking... A Richmond school bus carrying 12 students from Armstrong High School was shot multiple times in the city's East End on Wednesday afternoon. richmond.com", "2017-11-01T21:51:33.000Z": "It's going to take all of us to keep Virginia blue. Here's how you can help: http:// events.vademocrats.org  #GameOnVA Democratic Party of Virginia Providing news, issues, links and volunteer opportunities. vademocrats.org", "2017-11-01T20:41:16.000Z": "Take it from President @BarackObama : Ralph's served Virginia his whole life. That's just who he is.", "2017-11-01T19:28:55.000Z": "What's Ed Gillespie's worst nickname? \"Architect of gerrymandering\" is close to the top of the list. Gillespie took partisan mapmaking to a new level. Try turning that into a bumper sticker. The Republican for Virginia governor helped the GOP win control of statehouses around the country. washingtonpost.com", "2017-11-01T18:25:54.000Z": "As of now, Virginia will run out of funds for CHIP at the end of January. We can't let this happen to our children. http:// bit.ly/2iijAH2", "2017-11-01T17:19:11.000Z": "It's simple: Ralph's been dedicated to Virginians his whole life-that's why he'll make a great governor. The lure of the steady physician: Is Northam's résumé enough in the age of Trump? His background as a country doctor and Army vet drew him to politics. Now he faces a polished Republican in a tight race. washingtonpost.com", "2017-11-01T16:07:41.000Z": "The most important thing we can do in this election is turn out voters. You can help ensure that. http:// iwillvote.com/commit", "2017-11-01T15:04:02.000Z": "Get excited, Virginia. http:// bit.ly/2yKckOt  #GameOnVA Ralph's got the momentum going into Election Day. Election Day is just two weeks away - and we're feeling the momentum across the commonwealth! From his rally with President Obama in medium.com", "2017-11-01T14:09:47.000Z": "Open enrollment starts today. Go to http:// healthcare.gov to #GetCovered .", "2017-11-01T00:56:13.000Z": "I might be running for governor, but these guys will be saving the world soon enough. Happy Halloween!", "2017-10-31T23:39:23.000Z": "This guy wins the prize for best costume this year hands down.", "2017-10-31T23:11:45.000Z": "Y'all, she even nailed the tie!", "2017-10-31T21:51:52.000Z": "My heart breaks for the families of those killed and injured today in New York City. Virginians are sending prayers and love your way, NYC.", "2017-10-31T19:20:20.000Z": "Thanks @RalphNortham for discussing deputy sheriff recruitment, retention and  healthcare at mtg with @vasheriffs association leadership.", "2017-10-31T18:27:24.000Z": "We're getting down to the wire, and we need your help to keep Virginia blue. http:// iwillvote.com/commit", "2017-10-31T17:04:05.000Z": "Today Pam and I are enjoying sweet memories of trick-or-treating with Wes and Aubrey. Happy Halloween from our family to yours!", "2017-10-31T16:10:24.000Z": "happy call-o-ween! #7days  #gameonva  #fieldwins", "2017-10-31T15:33:58.000Z": "Ralph's been dedicated to serving Virginians his whole life-and that's exactly what he'll do as governor.", "2017-10-31T14:20:51.000Z": "We want to thank @RalphNortham for bringing Halloween treats to kids (and our caregivers) at #InovaChildrensHospital ! Quote Tweet Ofirah Yheskel @ofirahy . @RalphNortham is wishing the residents, staff, & patients at @InovaHealth Children's a Happy Halloween with all treats, no tricks this AM", "2017-10-31T14:05:59.000Z": "1 week to go so obvi sporting my Wonder Woman t-shirt this Halloween. Let's do this VA! Text VIRGINIA to 21333 & get knocking! #GameOnVA", "2017-10-31T14:06:30.000Z": "Tell your neighbors, tell your friends-Election Day is right around the corner, so make a plan to vote. http:// iwillvote.com/commit", "2017-10-31T00:40:50.000Z": "These activists know: Ed Gillespie is bad for Virginia.", "2017-10-31T00:10:15.000Z": "The opioid epidemic can't wait. We need to find solutions for Virginia families. Analysis | The Health 202: Appalachian death from drug overdoses far outpace nation's So says a new University of Chicago study. washingtonpost.com", "2017-10-30T22:49:45.000Z": "We can't keep Virginia blue without our volunteers. Bring and friend, and find an event near you. https:// events.vademocrats.org  #GameOnVA", "2017-10-30T22:25:06.000Z": "We couldn't agree more. Let's get out and vote for @RalphNortham , @FairfaxJustin , & @MarkHerringVA on November 7: http:// bit.ly/2zR5VxQ", "2017-10-30T21:55:05.000Z": "The @Washingtonpost , @Virginianpilot , and @Daily_Press all endorsed Ralph. They know he'll be a governor for all Virginians.", "2017-10-30T21:20:01.000Z": "ICYMI: The Washington Post endorsed @RalphNortham  @FairfaxJustin and @MarkHerringVA -\n our full pro-choice ticket! https:// washingtonpost.com/opinions/the-posts-endorsements-in-virginia/2017/10/28/be2ef512-bb52-11e7-be94-fabb0f1e9ffb_story.html?utm_term=.ecf2222a36e6 ", "2017-10-30T20:05:45.000Z": "President @BarackObama knows Ralph will build a Virginia for everyone, no matter who you are, no matter where you're from.", "2017-10-30T18:49:11.000Z": "Ralph and Tom are making a stop by the Charlottesville office to thank our amazing vols #VAGov  #GameOnVA", "2017-10-30T18:53:35.000Z": "We can't afford to put children's health on the line. Urge Congress to do the right thing and reauthorize CHIP. http:// bit.ly/2z1Wo9R Quote Tweet Kyle Griffin @kylegriffin1 It's been 30 days since Congress let CHIP, the children's health insurance program that insures 9,000,000, expire.", "2017-10-30T18:13:34.000Z": "All treats and no tricks at the Virginia Beach Blvd office today. 8 days left to scare up some votes! #GameOnVa", "2017-10-30T17:07:01.000Z": "As someone who's served Virginia his whole life, Ralph's the best candidate for the job. The lure of the steady physician: Is Northam's résumé enough in the age of Trump? His background as a country doctor and Army vet drew him to politics. Now he faces a polished Republican in a tight race. washingtonpost.com", "2017-10-30T16:37:42.000Z": "It wasn't all this past weekend - these @vademocrats vols had beautiful sun while they knocked.   Come to VA for GOTV! #GameOnVA", "2017-10-30T14:38:36.000Z": ". @RalphNortham joins Lynchburg leaders to kick off @Amtrak service to Roanoke: \"As they say, all aboard and congratulations.\"", "2017-10-30T15:47:21.000Z": "Volunteers across the commonwealth are excited to elect Democrats up and down the ballot! #GameOnVA", "2017-10-30T14:16:57.000Z": "Ralph has volunteered at RAM clinics to treat folks who don't have healthcare. \n\nEd can't say the same.", "2017-10-29T22:54:33.000Z": "Do you want to elect Democrats up and down the ballot? We can't do it without you. http:// iwillvote.com/commit", "2017-10-29T21:34:38.000Z": "I tell ya what, today I saw a fired-up #RoanokeForRalph . Canvass after canvass. Church all morning. And of course a quick pause for paws.", "2017-10-29T22:04:59.000Z": "Blacksburg is FIRED UP for @RalphNortham and @ChrisHurstVA ! #PR1de", "2017-10-29T21:17:45.000Z": "Attacking a person's identity is bigotry-plain and simple. Campaign flier paid for by Virginia GOP 'misgenders' Democratic candidate Despite misstating the candidate's gender, the state party said the mailers \"do not attack\" her identity. It did not say whether the fliers would be corrected. washingtonpost.com", "2017-10-29T19:31:24.000Z": "Well they sure are ready for DOORS! & @RalphNortham in Roanoke this afternoon #GameOnVa  #VAgov", "2017-10-29T18:24:51.000Z": "It's raining throughout the commonwealth but that won't keep us from knocking for @RalphNortham , @FairfaxJustin & @MarkHerringVA ! #PinkOutVA", "2017-10-29T18:50:53.000Z": "Rain won't stop @AghaebrahimVA and I from knocking doors for pro-choice @RalphNortham , @MarkHerringVA , @FairfaxJustin ! #PinkOutVA  #GameOnVA", "2017-10-29T19:19:34.000Z": ". @washingtonpost , @Daily_Press , and @virginianpilot endorsed Ralph-because they know he'll be a governor for all Virginians.", "2017-10-29T17:29:15.000Z": "The Washington Post's profile of Ralph may be the best thing you read this week. 11 Things To Know from the Washington Post's Profile on Ralph 11 quick things you might have missed from the Washington Post's new candidate profile on Ralph: medium.com", "2017-10-29T15:57:20.000Z": "November 7th is just 9 days away, and we couldn't be more excited to get to the polls! #GameOnVA GIF", "2017-10-29T16:06:32.000Z": "Volunteers are storming the Godolphin staging location. #gameonVA  #fairfamsouth", "2017-10-29T16:32:29.000Z": "STAY ON THE DOORS! A little rain never hurt anyone, but not voting has! #GameOnVA  #RVAlph  #RainOrShine", "2017-10-29T15:36:04.000Z": "Rain can't stop us! Crowds of volunteers coming to knock doors in Portsmouth for @RalphNortham  @FairfaxJustin & @MarkHerringVA  #GameOnVa", "2017-10-29T15:45:12.000Z": "After getting migraines as a kid, Ian's mom searched and searched for a doctor. That doctor was Ralph. The World Needs More Dr. Northams One patient's story of Ralph's compassion medium.com", "2017-10-29T14:13:28.000Z": "We're fired up and ready to elect Ralph as Virginia's next governor! http:// bit.ly/2yKckOt  #GameOnVA Ralph's got the momentum going into Election Day. Election Day is just two weeks away - and we're feeling the momentum across the commonwealth! From his rally with President Obama in medium.com", "2017-10-29T01:15:50.000Z": "Any night I get to sit in with not 1 but 2 bands, cut a rug, AND stump for my friend @RalphNortham is a good night. Floyd, great to be back!", "2017-10-28T23:41:16.000Z": "It's simple: If a 6 year old is in pain, Ralph will treat him. Period. The World Needs More Dr. Northams One patient's story of Ralph's compassion medium.com", "2017-10-28T22:38:58.000Z": "BREAKING: The Washington Post Endorses Justin Fairfax for Lt. Governor of Virginia!  The choice is crystal clear.... Opinion | The Post's endorsements in Virginia In statewide elections Nov. 7, we support Ralph Northam, Justin Fairfax and Mark Herring. washingtonpost.com", "2017-10-28T22:51:09.000Z": "Honored that @RalphNortham , @FairfaxJustin , and I have all earned the endorsement of @PostOpinions . Vote Nov. 7! https:// washingtonpost.com/opinions/the-posts-endorsements-in-virginia/2017/10/28/be2ef512-bb52-11e7-be94-fabb0f1e9ffb_story.html?utm_term=.8a3a0cf51c70 ", "2017-10-28T22:15:29.000Z": "BREAKING: The @WashingtonPost endorses Ralph for governor! Opinion | The Post's endorsements in Virginia In statewide elections Nov. 7, we support Ralph Northam, Justin Fairfax and Mark Herring. washingtonpost.com", "2017-10-28T21:29:53.000Z": "We're counting on folks like you to keep Virginia blue! https:// events.vademocrats.org  #GameOnVA", "2017-10-28T19:43:52.000Z": "Take it from President @BarackObama : Ralph's the best guy for the job.", "2017-10-27T18:23:02.000Z": "It was so exciting to be asked by the @RalphNortham campaign to share my experience. He was so good to me. He'll be great for Virginia. Quote Tweet Ralph Northam @RalphNortham As a child, Ian's medical insurance prevented him from finding a doctor to treat his migraines. Then he met Ralph. http:// bit.ly/2yPjpgF", "2017-10-28T18:35:35.000Z": "ICYMI: Here are 11 takeaways from the Washington Post's profile on Ralph. 11 Things To Know from the Washington Post's Profile on Ralph 11 quick things you might have missed from the Washington Post's new candidate profile on Ralph: medium.com", "2017-10-28T17:57:26.000Z": "I'm out here for my mom and my sister, because @RalphNortham knows to #TrustWomen . Proud to canvass for a @NARAL & @NARALVirginia champion!", "2017-10-28T17:30:32.000Z": "We are dancing in the streets/knocking on all the doors for @RalphNortham and @KathyKLTran  #GOTV  #GameOnVA  @BlaireGoodrick", "2017-10-28T17:10:38.000Z": "Grab a clipboard, and grab a friend! Election Day will be here before you know it, so find an event near you! https:// events.vademocrats.org", "2017-10-28T17:05:09.000Z": "Manassas volunteers are fired up to knock on doors and get out the vote! #GameOnVA  @pwcdanica  @RalphNortham  @FairfaxJustin  @MarkHerringVA", "2017-10-28T16:55:05.000Z": "Chesterfield is ready for DOORS! #GameOnVA  #VAGov", "2017-10-28T14:10:03.000Z": "Trained and ready to knock on DOORS for @RalphNortham , @FairfaxJustin , & @MarkHerringVA . Voting is easy and everyone's doing it!! #gameonva", "2017-10-28T16:33:38.000Z": "We're voting 4 @RalphNortham  @FairfaxJustin  @MarkHerringVA 4 better healthcare for all Virginians! #TogetherWeRise  #GameOnVA  #CutestVol", "2017-10-28T16:20:51.000Z": "Springfield volunteers are pumped to Get Out the Vote 4 @RalphNortham  @FairfaxJustin  @MarkHerringVA & @EFillerCorn ! #GameOnVA  #FairFamSouth", "2017-10-28T15:48:33.000Z": "Ralph's spent his whole life serving Virginians. Take it from a patient who was treated by him as a kid. The World Needs More Dr. Northams One patient's story of Ralph's compassion medium.com", "2017-10-28T15:21:10.000Z": "NARAL & @NARALVirginia members and volunteers are up bright and early this Saturday to hit the doors & GOTV for @RalphNortham ! #VAGov", "2017-10-28T14:44:19.000Z": "Henrico is ready to #PinkOutVA with @TerryMcAuliffe for @RalphNortham today. #GameOnVA", "2017-10-28T14:14:40.000Z": "November 7 is fast approaching, so make sure you have a plan to vote. http:// iwillvote.com/commit", "2017-10-28T13:45:35.000Z": "Great team from @PPAVirginia out on the doors for @RalphNortham ticket. GOP & @EdWGillespie are wrong for Virginia's women. Vote Nov 7!!", "2017-10-28T00:22:54.000Z": "What's a football game without the halftime show? Thanks for having me, Petersburg! I did y'all a favor by leaving my French horn at home!", "2017-10-27T21:54:13.000Z": "RT if you're canvassing this weekend.\nLike if you're making calls.\nReply if you're bringing a friend! http:// events.vademocrats.org  #GameOnVA Democratic Party of Virginia Providing news, issues, links and volunteer opportunities. vademocrats.org", "2017-10-27T19:32:11.000Z": "Fear-mongering isn't the Virginia way. \n\nAnd we're still waiting for Ed to denounce Trump.", "2017-10-27T18:12:04.000Z": "As a child, Ian's medical insurance prevented him from finding a doctor to treat his migraines. Then he met Ralph. The World Needs More Dr. Northams One patient's story of Ralph's compassion medium.com", "2017-10-27T16:48:57.000Z": "Ralph knows the key to building up Virginia's economy is creating more jobs for Virginians.", "2017-10-27T15:39:00.000Z": "Excitement is building! http:// bit.ly/2yKckOt  #GameOnVA Ralph's got the momentum going into Election Day. Election Day is just two weeks away - and we're feeling the momentum across the commonwealth! From his rally with President Obama in medium.com", "2017-10-27T13:05:12.000Z": "US House candidate, VA-8 . @RalphNortham , @fairfaxforlg, and @MarkHerringVA have our backs. We need to have theirs. Make a plan to vote: http:// iwillvote.com/commit", "2017-10-27T14:09:04.000Z": "Ralph Northam is different from most career politicians-he's led a life of service. The lure of the steady physician: Is Northam's résumé enough in the age of Trump? His background as a country doctor and Army vet drew him to politics. Now he faces a polished Republican in a tight race. washingtonpost.com", "2017-10-26T22:56:48.000Z": "I'll work with businesses to make vocational training and apprenticeships available for all Virginians.", "2017-10-26T21:34:13.000Z": "New Mexico ranked 49th in unemployment and economic growth under Governor Martinez's leadership. Quote Tweet Ed Gillespie @EdWGillespie Great discussion with Northern Virginia business leaders and @Gov_Martinez about my plans to get Virginia's economy growing again.", "2017-10-26T20:24:53.000Z": "Glad Trump agrees we need to address the opioid crisis, but this doesn't go nearly far enough. VA families can't wait any longer for help.", "2017-10-26T19:19:31.000Z": "With only 12 days until Election Day, we need your help to elect Democrats up and down the ballot. https:// events.vademocrats.org", "2017-10-26T17:32:17.000Z": "Fired up, ready to go! Momentum is building toward Election Day, and folks are ready to elect Ralph. http:// bit.ly/2yKckOt  #GameOnVA Ralph's got the momentum going into Election Day. Election Day is just two weeks away - and we're feeling the momentum across the commonwealth! From his rally with President Obama in medium.com", "2017-10-26T15:41:06.000Z": "While I was treating patients at the RAM clinic, Donald Trump was golfing in Sterling.\n\nYou tell me who doesn't show up for Virginians.", "2017-10-26T14:31:04.000Z": "Virginia unemployment is 3.7%. National unemployment is 4.2%. Stop tweeting and get to work. Quote Tweet Donald J. Trump @realDonaldTrump Ed Gillespie will turn the really bad Virginia economy #'s around, and fast. Strong on crime, he might even save our great statues/heritage!", "2017-10-26T14:15:05.000Z": "I served 8 years in the Army, took care of sick kids, and am running to build a more inclusive Virginia. Don't talk to me about showing up. Quote Tweet Donald J. Trump @realDonaldTrump Ed Gillespie will be a great Governor of Virginia. His opponent doesn't even show up to meetings/work, and will be VERY weak on crime!", "2017-10-26T14:03:53.000Z": "Virginia's economy is moving in the right direction-but we still have a lot of work to do.", "2017-10-25T23:16:57.000Z": "Ralph's much more than a political candidate. Here are 11 things you should know about his life of service: 11 Things To Know from the Washington Post's Profile on Ralph 11 quick things you might have missed from the Washington Post's new candidate profile on Ralph: medium.com", "2017-10-25T17:05:30.000Z": "Another rural town, another huge crowd of Democrats #GameOnVA", "2017-10-25T22:05:35.000Z": "Virginia's fired up and ready to vote for Ralph on November 7. See for yourself: http:// bit.ly/2yKckOt  #GameOnVA Ralph's got the momentum going into Election Day. Election Day is just two weeks away - and we're feeling the momentum across the commonwealth! From his rally with President Obama in medium.com", "2017-10-25T20:57:38.000Z": "This is a flat-out assault on the rights of every woman in this country. Quote Tweet James Owens @JamesDakinOwens BREAKING: GOP announce hearing on bill to ban abortion at 6 weeks--before many women find out they're pregnant.", "2017-10-25T20:43:29.000Z": "Gov. McAuliffe knows Gillespie's campaign has been based on fear, division, and dog-whistle politics. Ed Gillespie's Attack On Rights Restoration Would Drag Virginia Backward His ad is clearly designed to scare and confuse voters. huffpost.com", "2017-10-25T19:22:03.000Z": "Giving this little guy on his Halloween costume!", "2017-10-25T18:38:44.000Z": "This is why President @BarackObama knows Ralph is the right choice for governor.", "2017-10-25T17:25:37.000Z": "Here are a few things you may have missed from the Washington Post's profile of Ralph: 11 Things To Know from the Washington Post's Profile on Ralph 11 quick things you might have missed from the Washington Post's new candidate profile on Ralph: medium.com", "2017-10-25T15:53:41.000Z": ". @RalphNortham FIRES up a huge crowd of energized Dems in Purcellville w/ @FairfaxJustin  @MarkHerringVA @Tia4Delegate @WendyforDel", "2017-10-25T16:16:44.000Z": "Gillespie's cynical ad is clearly designed to scare and confuse voters. Take it from Gov. McAuliffe: Ed Gillespie's Attack On Rights Restoration Would Drag Virginia Backward His ad is clearly designed to scare and confuse voters. huffpost.com", "2017-10-25T15:07:52.000Z": "A veteran, pediatrician, Eastern Shore native-you're going to want to read this profile of Ralph. The lure of the steady physician: Is Northam's résumé enough in the age of Trump? His background as a country doctor and Army vet drew him to politics. Now he faces a polished Republican in a tight race. washingtonpost.com", "2017-10-25T13:11:59.000Z": ". @EdWGillespie 's latest attack is the lowest point yet in his divisive, Trump-style campaign. http:// huffingtonpost.com/entry/ed-gille spies-cynical-attack-on-rights-restoration-would-drag-virginia-backward_us_59efd190e4b04917c5941292?ncid=engmodushpmg00000004  # via @HuffPostPol Ed Gillespie's Attack On Rights Restoration Would Drag Virginia Backward His ad is clearly designed to scare and confuse voters. huffpost.com", "2017-10-25T14:26:59.000Z": "Honored to have the International Brotherhood of Police Officers endorsement. They work selflessly every day and have my highest respect.", "2017-10-25T13:17:36.000Z": "NEW: Like President @BarackObama said last week, Ralph wants progress. He's going to take us forward, not backward.", "2017-10-24T23:11:02.000Z": "Building a stronger economy means helping folks get the resources they need, like jobs skills training and a good education.", "2017-10-24T21:52:31.000Z": "President @BarackObama knows Virginians can count on Ralph. 5 reasons President Obama knows Ralph's the best guy for the job \"Ralph's whole life has been about honest, responsible service to others.\" -President Barack Obama medium.com", "2017-10-24T20:07:37.000Z": "Ralph is from rural Virginia, and as governor, you can count on him to restore jobs and create opportunities in the Southwest.", "2017-10-24T18:34:51.000Z": "Women can count on Ralph to fight for their reproductive rights. Quote Tweet NowThis @nowthisnews These two gubernatorial candidates have drastically opposing views on abortion", "2017-10-24T17:50:19.000Z": ". @HRC is proud to partner with @EqualityVA to elect pro-equality candidates like @RalphNortham & Danica Roem ( @pwcdanica ) in Virginia #VApol", "2017-10-24T17:09:03.000Z": "When it comes to public education, only one gubernatorial candidate will put students and teachers first. http:// bit.ly/2gxwMau", "2017-10-24T15:49:39.000Z": "With only two weeks until Election Day, we need your help! Text VIRGINIA to 21333 and see how you can get involved.", "2017-10-24T14:16:48.000Z": "NEW: As governor, Ralph will fight to restore jobs to rural Virginia by building a stronger, more skilled workforce.", "2017-10-24T01:15:26.000Z": "Proud to be with members of @EqualityVA , @HRC , and @Pride_Fund to talk about building a more inclusive commonwealth that works for all VA.", "2017-10-23T23:59:09.000Z": "This is how you win elections, with old-fashioned hard work. Get in on the action yourself: Text VIRGINIA to 21333. Northam touts 212k weekend door knocks in Virginia - while DNC was fretting about race Democratic gubernatorial campaign says field operations are better than Clinton, McAuliffe at a similar point washingtonpost.com", "2017-10-23T22:29:30.000Z": "This is unacceptable. It's time for Trump to call this what it is-a national emergency. Nineteen people a week overdose in Richmond. Dozens are dying. Hundreds are being revived. To the sharply dressed crowd spilling past her at closing time last Sunday, the woman passed out next to the elevators appeared to have had too many $12 cocktails at richmond.com", "2017-10-23T18:18:50.000Z": "The #BigTENt all together to shift-a-ton during our All state CALL-A-THON. For @RalphNortham and the @vademocrats ticket. #GameOnVA", "2017-10-23T21:11:44.000Z": "Ralph's a man of integrity. Take it from President @BarackObama . 5 reasons President Obama knows Ralph's the best guy for the job \"Ralph's whole life has been about honest, responsible service to others.\" -President Barack Obama medium.com", "2017-10-23T20:13:34.000Z": "All law-abiding Virginians who've served their time should have their rights restored. Ed knows that. He should be ashamed. Quote Tweet Kevin Robillard @Robillard . @EdWGillespie out with new 60-second ad hitting @RalphNortham on McAuliffe's felon rights restoration: https:// youtube.com/watch?v=bRGldO X5lEk&feature=youtu.be   #VAGov", "2017-10-23T19:16:37.000Z": "Turn up the volume and RT this one! President Obama on why we need to help the 54 challengers running for House of Delegates on 11/7.", "2017-10-23T18:47:25.000Z": "We're only two weeks away from Election Day! Make sure you're signed up to help us turn out every single vote at Democratic Party of Virginia Providing news, issues, links and volunteer opportunities. vademocrats.org", "2017-10-23T17:39:26.000Z": "Excited to support @RalphNortham to be VA's next governor! Spoke w/ students @GeorgeMasonU on all the ways Ralph's fighting Trump's agenda.", "2017-10-23T16:55:02.000Z": "FACT: Ed Gillespie thinks abortion should be banned. Quote Tweet NowThis @nowthisnews These two gubernatorial candidates have drastically opposing views on abortion", "2017-10-23T01:39:22.000Z": "Proud of @vademocrats - this weekend we had over 5,000 vols knock on almost 215,000 doors across the commonwealth!! #GameOnVA  #OrganizeToWin", "2017-10-23T15:24:28.000Z": "I'm fighting to build a Virginia that works for everyone. Ed Gillespie? Not so much. http:// bit.ly/2h2vhSt", "2017-10-23T14:13:23.000Z": "My niece's 1st voting & proud to cast our ballots for @RalphNortham  #GameOnVA", "2017-10-23T14:08:03.000Z": "Ralph cares for Virginians-it's that simple.", "2017-10-23T13:23:40.000Z": "Back at Greenspring Retirement Community in Springfield to talk to some of the most engaged voters in the commonwealth #VAGov  #GameOnVA", "2017-10-22T21:45:35.000Z": "The only thing more appalling than Gillespie's lobbying history is the fact that he's proud of it.", "2017-10-22T17:58:53.000Z": ". @timkaine fires up a HUGE diverse crowd in Woodbridge on electing @RalphNortham  @FairfaxJustin  @MarkHerringVA & all Dems on Nov 7 #GameOnVA", "2017-10-22T21:15:39.000Z": "As an Olympian, I support the authentic values of @RalphNortham let's leave anti equality dinosaurs like @EdForVirginia to roam in the past.", "2017-10-22T21:00:06.000Z": ". @RalphNortham is popping by our Fredericksburg @vademocrats office to thank fantastic phone bankers this afternoon #GameOnVa  #VAGov", "2017-10-22T18:56:39.000Z": "Reunited and it feels so good  @tomperriello joins @RalphNortham in Charlottesville to send off great vols to the DOORS! #GameOnVa  #VAGov", "2017-10-22T20:14:49.000Z": "Perfect fall afternoon to be knocking on doors for @WendyforDel and @RalphNortham . Sign up for a shift before it's too late. #GameOnVA", "2017-10-22T20:14:20.000Z": "When it comes to protecting Virginia from gun violence, you can count on Ralph. A Letter to Virginia Voters When we founded our organization, we said that if lawmakers didn't find the courage to support life-saving, responsible gun policies, we'd resistthegunlobby.org", "2017-10-22T20:02:01.000Z": "Great day canvassing for @RalphNortham and other Dems out in Loudoun County! #Vote  #Nov7", "2017-10-22T19:51:38.000Z": "*obligatory canvassing for @RalphNortham selfie* #GameOnVA", "2017-10-22T19:55:02.000Z": "Just talked to Barbara and John, who were on the fence and are now going to vote and knock doors for @WendyforDel + @RalphNortham  #GameOnVA", "2017-10-22T19:54:34.000Z": "Headed out to knock even more doors - this time in Fairfax City! #KeepGMUBlue  #GameOnVA  @RalphNortham  @DavidBulova", "2017-10-22T18:50:39.000Z": ". @EdWGillespie wants to see abortion be banned. Quote Tweet NowThis @nowthisnews These two gubernatorial candidates have drastically opposing views on abortion", "2017-10-22T17:30:14.000Z": "FACT: Ed Gillespie has a history of putting his business interests ahead of Virginians. Ed Gillespie's lobbying career included work for firms with vast interests in Virginia Companies that paid the GOP gubernatorial nominee's consulting and lobbying firms more than $3 million contract directly with the state and lobby in Richmond. washingtonpost.com", "2017-10-22T16:02:37.000Z": "Virginia children need a governor who will always have their backs.", "2017-10-22T14:09:46.000Z": "Excited to be out knocking doors for @RalphNortham @fairfaxforlg @MarkHerringVA and @guzman4delegate", "2017-10-22T14:43:05.000Z": "President @BarackObama knows Ralph's the only candidate ready to be the next governor of Virginia. 5 reasons President Obama knows Ralph's the best guy for the job \"Ralph's whole life has been about honest, responsible service to others.\" -President Barack Obama medium.com", "2017-10-21T22:54:10.000Z": "Ralph grew up in rural Virginia. He understands it, and folks know he's committed to investing in SWVA. Letter: Northam will invest in Southwest Virginia The gubernatorial debate held at UVA-Wise was a game changer for our region. Hosting the debate adds relevance to far southwestern Virginia. We were offered a seat at the policy roanoke.com", "2017-10-21T20:40:34.000Z": "I got my dad to canvass with me in 2016, and now he's a pro at reshifting volunteers as a GOTV captain. #GameOnVA  #FairFamSouth", "2017-10-21T20:52:47.000Z": "Packed house & canvass launch today for @RalphNortham in Church Hill, with @BedellforVA  @David89Sperry and some #FIREDUP vols! #GameOnVa", "2017-10-21T21:05:15.000Z": "Fired up and ready to win this thing for @RalphNortham , @FairfaxJustin , @MarkHerringVA & @VVforDelegate ! #GameOnVA", "2017-10-21T21:22:20.000Z": "Ralph knows we can achieve more united than we can divided. Take it from President @BarackObama : 5 reasons President Obama knows Ralph's the best guy for the job \"Ralph's whole life has been about honest, responsible service to others.\" -President Barack Obama medium.com", "2017-10-21T20:01:30.000Z": "I can assure you-I have a decidedly pro-playground agenda. http:// bit.ly/2gzrhMj", "2017-10-21T19:31:28.000Z": "Had a great time with the Chamberlayne Packers today-the same name as my youth team on the Shore!", "2017-10-21T17:14:21.000Z": "Obligatory canvassing selfie: on the doors today for @RalphNortham and the Dems -- who else is out here? #GameOnVa", "2017-10-21T18:26:28.000Z": "At this point, the list of Virginians Ed Gillespie *hasn't* sold out is shorter than the folks he has. Ed Gillespie's lobbying career included work for firms with vast interests in Virginia Companies that paid the GOP gubernatorial nominee's consulting and lobbying firms more than $3 million contract directly with the state and lobby in Richmond. washingtonpost.com", "2017-10-21T17:41:22.000Z": "I drove 7 hours to knock doors in my home state for @WendyforDel + @RalphNortham because I believe their leadership is needed! #GameOnVa", "2017-10-21T17:19:56.000Z": "Knocking doors for @RalphNortham  @FairfaxJustin  @MarkHerringVA makes us smile #GameOnVA", "2017-10-21T17:13:30.000Z": ". @MomsDemand and  @MWrightBaylor are out in full force to elect @RalphNortham for #VAGov today! So stoked to be able to join them. #GameOnVA", "2017-10-21T16:46:15.000Z": "Second Tidewater canvass launch today. Volunteers are ready to help @RalphNortham  @FairfaxJustin  @MarkHerringVA & House Dems win in 17 days!", "2017-10-21T16:56:52.000Z": "NEW: Gillespie's record as a DC lobbyist says it all: He can't be trusted.", "2017-10-21T15:54:34.000Z": "Canvass Kickoff #2 underway in Richmond today. So many folks ready to knock DOORS! for @RalphNortham  #GameonVA  #VAGov", "2017-10-21T15:37:21.000Z": "Improving education is the first step to building a stronger economy-and it should be a priority for everyone. http:// bit.ly/2gSDvwq", "2017-10-21T13:50:23.000Z": "When your Cville getaway itinerary includes voter contact and Fight Song on repeat #GameOnVA", "2017-10-21T14:05:16.000Z": "Being governor isn't an easy job, but neither is directing a children's hospice-and Ralph's been doing it for 18 years.", "2017-10-21T13:24:56.000Z": "Just a couple of Keydets! @VMI1839 Class of '52 and '81.", "2017-10-20T21:50:00.000Z": "Virginians want quality, affordable healthcare-but Ed Gillespie advocated for less competition and higher costs. Ed Gillespie's lobbying career included work for firms with vast interests in Virginia Companies that paid the GOP gubernatorial nominee's consulting and lobbying firms more than $3 million contract directly with the state and lobby in Richmond. washingtonpost.com", "2017-10-20T20:06:19.000Z": "I love your motto, John: \"be you, be authentic, and have fun doing it.\" Proud to be a Keydet. Captain Of Virginia Military Institute Swim Team Comes Out As Gay John Kim decided that as a team leader, he needed to set an example. huffpost.com", "2017-10-20T19:03:15.000Z": "At last night's rally, President @BarackObama told us why Ralph's the best man for the job. 5 reasons President Obama knows Ralph's the best guy for the job \"Ralph's whole life has been about honest, responsible service to others.\" -President Barack Obama medium.com", "2017-10-20T18:11:04.000Z": "NEW: Ralph wants to make sure that every family in Virginia can afford quality healthcare when they need it.", "2017-10-20T16:33:44.000Z": "Folks across Virginia were blown away by Ralph's rally with @BarackObama last night. See what they had to say Ralph Northam @RalphNortham President Obama campaigns for Ralph Northam in Richmond President Obama knows how important it is we elect Ralph governor. Check out these highlights from last night's rally.", "2017-10-20T14:43:54.000Z": "\"America is a story of progress. Ralph Northam wants progress-he wants to take us forward, not backward.\" - @BarackObama", "2017-10-20T01:08:24.000Z": "Good things happen when we elect Democrats.", "2017-10-20T00:55:48.000Z": "\"Elections matter. You can't sit this one out.\" - @BarackObama  #GameOnVA", "2017-10-20T00:42:37.000Z": "I teared up a few times listening to @BarackObama rally for @ @RalphNortham . True class acts", "2017-10-20T00:42:35.000Z": ". @BarackObama & @RalphNortham make clear that Virginia Democrats are the party of liberty & justice for all! @FairfaxJustin  @MarkHerringVA", "2017-10-20T00:06:38.000Z": "Signing up volunteers after Obama rallies for Northam in Richmond #VAGov", "2017-10-20T00:27:40.000Z": "When we elect Democrats, good things happen. #GameOnVa", "2017-10-20T00:39:19.000Z": "We love you, @RalphNortham and @BarackObama !!!! #VOTE", "2017-10-20T00:07:33.000Z": "Virginia can be as great as @RalphNortham & @BarackObama think we can be. We just have to put in the work for 18 more days #Virginia4Northam", "2017-10-19T22:26:35.000Z": "W/my daughter in Richmond, VA to hear @BarackObama . We're fired up, ready to go 4 #GunSense champ @RalphNortham . Vote on Nov 7! @MomsDemand", "2017-10-20T00:12:58.000Z": "If you leave a political rally for @RalphNortham with @BarackObama and have your voice...did you even rally?!? #PinkOutVA  #GameOnVA", "2017-10-20T00:32:04.000Z": "Virginia is ready to vote for @RalphNortham ! Thank you President @BarackObama !", "2017-10-20T00:29:45.000Z": "We. Need. Your. Help. Sign up to volunteer! Quote Tweet Ralph Northam @RalphNortham Fired up, ready to vote! Sign up here to volunteer: http:// bit.ly/2fz5AaM  #GameOnVA", "2017-10-20T00:19:00.000Z": "Happy to see @BarackObama in RVA supporting @RalphNortham , @fairfaxforlg , and @AGMarkHerring tonight.  #yeswecan  #keepvablue", "2017-10-20T00:20:38.000Z": "At rally for @RalphNortham Pres @BarackObama says this election is about a better vision for America", "2017-10-20T00:20:49.000Z": "nov 7 !!!!!!! @RalphNortham  @BarackObama  #va4northam", "2017-10-20T00:19:53.000Z": "Fired up, ready to vote! Sign up here to volunteer: http:// bit.ly/2fz5AaM  #GameOnVA", "2017-10-19T23:12:20.000Z": "We're in Richmond with President @BarackObama ! Tune in now to join us live: http:// nbc12.com/liveevents  #GameOnVA Watch Live Newscasts nbc12.com", "2017-10-19T21:48:02.000Z": "Everyone is welcome in Virginia! Quote Tweet Lisa Geller @lisabgeller Step 1: move to Virginia ; Step 2: attend @RalphNortham rally with @BarackObama  ; Step 3: vote for Northam, Herring, and Fairfax in Nov!", "2017-10-19T21:26:49.000Z": "Three generations for Ralph! #GameOnVA", "2017-10-19T21:08:39.000Z": "HEY #RVA ! Who's excited to welcome @BarackObama back tonight?! @RalphNortham , @FairfaxJustin , and I are honored by his support! #GameOnVA", "2017-10-19T20:54:40.000Z": "In case you can't tell, we are REALLY EXCITED to see @BarackObama rally w/repro health champ @RalphNortham tonight #GameOnVA  #VAGov", "2017-10-19T19:41:35.000Z": "People are fired up for tonight's event with President @BarackObama ! #GameOnVA", "2017-10-19T18:38:42.000Z": "Wishing a happy #Diwali to all celebrating! May this holiday bring light, love, and peace to your family.", "2017-10-19T17:12:33.000Z": "If @JoeBiden and @BarackObama can text, so can you! Be sure to text VIRGINIA to 21333 to get involved before Election Day. #GameOnVA", "2017-10-19T15:40:44.000Z": "This is a public health crisis, and we need to do more. As governor, I'll make ending the opioid crisis a priority. http:// bit.ly/2hP7Wmv", "2017-10-19T14:18:33.000Z": "Vice President @JoeBiden knows Ralph will fight for all Virginians-no matter who you are, no matter where you're from.", "2017-10-19T00:17:25.000Z": "Ed's agenda for Virginia is backwards. We're not kidding. https:// gillespiefacts.com", "2017-10-18T22:37:10.000Z": "The thing I admire most about Ralph ... is the authenticity\" -Vice President @JoeBiden", "2017-10-18T20:55:37.000Z": "Great conversation this afternoon with Richmond metro teachers and parents about the vision @RalphNortham has for k12 as #VaGov .", "2017-10-18T20:28:44.000Z": "Deb, please tell them I'm honored to have their support. These young activists have a lot to teach folks-climate change is real! Quote Tweet Deb Dudley @debTWP My 13yo & friend made this for school & @RalphNortham because they're deeply concerned about #ClimateChange  #VAGov  https:// m.youtube.com/watch?v=Pq_fyw X_UdY ", "2017-10-18T19:16:52.000Z": "Happy to see Democrats and Republicans come together to help Americans get the healthcare they need-despite Trump's efforts to thwart it. Quote Tweet Donald J. Trump @realDonaldTrump I am supportive of Lamar as a person & also of the process, but I can never support bailing out ins co's who have made a fortune w/ O'Care.", "2017-10-18T17:32:34.000Z": "There are only 3 weeks until Election Day, and we need your help to keep Virginia blue. http:// bit.ly/2fz5AaM", "2017-10-18T15:47:55.000Z": "As a native of the Eastern Shore, Ralph knows Virginia-and he'll fight for all Virginians. Son of the Shore A late political bloomer, Ralph Northam sought office out of frustration with the state legislature. richmondmagazine.com", "2017-10-18T13:40:56.000Z": "I had the pleasure of meeting @RalphNortham yesterday! After working hard for his campaign. I got to shake his hand! #flipVAblue  #VAGov", "2017-10-18T14:05:36.000Z": "You can count on Ralph to provide all Virginians with opportunity. Take it from Vice President @JoeBiden .", "2017-10-18T13:28:42.000Z": "Our fallen servicemembers deserve to be treated with dignity and honor. Anything less than that is shameful and wrong.", "2017-10-17T13:24:06.000Z": "We're on a mission to save lives from gun violence. Stand with us and show the #CourageToFight for a safer future. https:// giffords.org", "2017-10-17T23:23:59.000Z": "Just dropped off Halloween sweets for our amazing Hampton volunteers. 21 days left! Text \"VIRGINIA\" to 21333 to join us. #GameOnVA", "2017-10-17T22:19:00.000Z": "Warning: Ed Gillespie's vision for Virginia is as backwards as it is dangerous. See for yourself: https:// gillespiefacts.com", "2017-10-17T20:48:53.000Z": "While Ed tweets Bank of America's promoted hashtag, remember: He fought for them while they laid off hundreds of Virginians. Quote Tweet Ed Gillespie @EdWGillespie . @RalphNortham it's \"Pay Back A Friend Day\" and Virginians would like our $1.4 M you wasted on a Chinese company's scam #PBAFD  #FriendsAgain", "2017-10-17T18:32:27.000Z": "You learn about hard work growing up on a farm-everybody in the family has to chip in and do their share. Son of the Shore A late political bloomer, Ralph Northam sought office out of frustration with the state legislature. richmondmagazine.com", "2017-10-17T16:56:14.000Z": "This is the kind of hate @EdWGillespie 's campaign is provoking. Help us out by reporting it. http:// bit.ly/2xMjRwd", "2017-10-17T16:18:36.000Z": "Ralph Northam knows the devastating impact of gun violence. Take it from Gabby Giffords: A Letter to Virginia Voters When we founded our organization, we said that if lawmakers didn't find the courage to support life-saving, responsible gun policies, we'd resistthegunlobby.org", "2017-10-17T15:09:32.000Z": "Looking for a way to help get out the vote in VA even if you don't live in the Commonwealth? Text WINVA to 21333. Our candidates thank you!", "2017-10-17T14:03:26.000Z": "Our commonwealth is a diverse and inclusive place. As governor, I will continue to protect Virginia's values. Northam: Virginia needs inclusiveness, common-sense gun laws Northam, who is facing Republican Ed Gillespie in the November election, said it's time for common sense discussions on guns, that decisions about Confederate monuments are best left to the dailyprogress.com", "2017-10-17T00:43:52.000Z": "In just three weeks, you have a choice to make, Virginia. Make sure you have all the info you need by starting here: https:// gillespiefacts.com", "2017-10-16T22:58:39.000Z": "As a veteran myself, I know the importance of helping our servicemembers transition from service to civilian life with good-paying jobs.", "2017-10-16T20:30:07.000Z": "Virginians, in 2017 you're on the frontline in the fight for women's health - and the choice is clear. https:// plannedparenthoodaction.org/elections/ralp h-northam ", "2017-10-16T21:34:23.000Z": "We only have 3 WEEKS to tell folks Ralph is the right candidate for governor! Sign up to help here: https:// events.vademocrats.org", "2017-10-16T17:50:00.000Z": "I've never been more convinced that we need to elect Ralph Northam in Virginia. Quote Tweet Ralph Northam @RalphNortham Ending the opioid crisis means making sure recovery resources are available to those who need them. http:// bit.ly/2gHiWma", "2017-10-16T20:06:50.000Z": "The gun lobby is spending $1.5 million to elect Gillespie. Read what Gabby Giffords has to say to Virginia voters: A Letter to Virginia Voters When we founded our organization, we said that if lawmakers didn't find the courage to support life-saving, responsible gun policies, we'd resistthegunlobby.org", "2017-10-16T18:39:09.000Z": ". @JoeBiden was in Virginia this weekend to remind everyone that moving Virginia forward starts with electing Ralph. Biden says a Northam victory in Virginia governor's race would 'give people hope' His campaign trail appearance come hours before Vice President Pence was set to rally for Gillespie. washingtonpost.com", "2017-10-16T17:23:49.000Z": ". @RalphNortham has the courage to fight gun violence. Here's my letter on why he should be the next governor of VA: A Letter to Virginia Voters When we founded our organization, we said that if lawmakers didn't find the courage to support life-saving, responsible gun policies, we'd resistthegunlobby.org", "2017-10-16T17:22:31.000Z": "REMINDER: Today's the last day to register to vote in VA, and we need every vote we can get to win this November! http:// IWillVote.com", "2017-10-16T15:41:57.000Z": "I'm fighting every day to build an economy that works for all Virginians. Will you join me? http:// IWillVote.com/commit", "2017-10-16T14:02:20.000Z": "Does Ed Gillespie really think that his record of working against Virginia families makes him qualified to be governor...?", "2017-10-15T23:04:23.000Z": "Latham got really good at canvassing when his mom ran for the House of Delegates. He was pumped to on the doors again for @RalphNortham !", "2017-10-16T00:04:28.000Z": "Fact: Ed Gillespie lobbied to keep student loan rates high.", "2017-10-15T23:04:51.000Z": "If we're going to keep VA blue, we need every vote we can get. Help us get there by committing to vote on Nov. 7: http:// IWillVote.com/commit", "2017-10-15T21:27:42.000Z": "Ending the opioid crisis means making sure recovery resources are available to those who need them. http:// bit.ly/2gHiWma", "2017-10-15T20:32:05.000Z": "Great day on the doors for @RalphNortham  @FairfaxJustin  @MarkHerringVA . Ran out of commit to vote cards & grabbed new vols. #GameOnVA", "2017-10-15T20:09:35.000Z": "Ed Gillespie stands by his time working for: Predatory student lenders Climate change deniers Companies shipping jobs overseas", "2017-10-15T18:54:29.000Z": "The jobs of the future are here. I'm ready to build a workforce to fill them. http:// bit.ly/2yKz9i9", "2017-10-15T18:19:10.000Z": "We've had a busy weekend knocking doors for @RalphNortham  @FairfaxJustin  @MarkHerringVA and down-ballo races across VA! #GameOnVA", "2017-10-15T17:57:55.000Z": "Macy is back at it today, knocking on doors for @RalphNortham & Virginia #votingrights champions. #GameOnVA", "2017-10-15T17:32:47.000Z": "Beautiful day to be out knocking doors for @RalphNortham @fairfaxforlg @MarkHerringVA and @DavidReidVA !", "2017-10-15T17:16:42.000Z": "As governor, I'll honor the sacrifices our veterans have made.", "2017-10-15T16:25:23.000Z": "Great morning in the 41st District at Olam Tikvah's Candidates Brunch. I was honored to introduce our next Governor, @RalphNortham", "2017-10-15T14:11:06.000Z": "My @RalphNortham volunteer team is really coming together! Took a small break during our canvass yesterday to enjoy some of Zora's cooking", "2017-10-15T15:28:55.000Z": "We weren't kidding when we said Ed Gillespie was Trump's top lobbyist in Virginia. Virginia's Governor Race Is About to Tell Us How Effective Racist Appeals Might Be in 2020 Ed Gillespie is attempting a kind of Trump maneuver. slate.com", "2017-10-15T14:09:41.000Z": "Access to contraception provides economic security for women and families. Expanding that access is a no-brainer. During Monday's debate, Ralph voiced his support for expanding long-acting reversible His plans for women and families don't end there. medium.com", "2017-10-14T23:35:14.000Z": "I want to make college more affordable-Gillespie made a career lobbying for predatory student loan lenders. Virginia gubernatorial candidates pitch plans for higher education The deadline to register to vote is October 16. wtvr.com", "2017-10-14T22:08:13.000Z": "Why don't you come down here and show us what that looks like? Quote Tweet Donald J. Trump @realDonaldTrump The Democrats in the Southwest part of Virginia have been abandoned by their Party. Republican Ed Gillespie will never let you down!", "2017-10-14T16:43:56.000Z": "Saturdays are for knocking doors for @RalphNortham  @FairfaxJustin  @MarkHerringVA & @vademocrats  text VIRGINIA to 21333 to get in the game!", "2017-10-14T20:45:38.000Z": "Trump's top lobbyist isn't welcome in SWVA. http:// bit.ly/2kBAhSc", "2017-10-14T18:15:01.000Z": ". @HRC members & supporters are canvassing in Virginia to help elect pro-equality candidates @RalphNortham , @MarkHerringVA and @pwcdanica .", "2017-10-14T18:25:47.000Z": "It was an honor and pleasure to have @JoeBiden join me today to talk about how we plan to strengthen Virginia's workforce.", "2017-10-14T16:40:35.000Z": "The effects of brain trauma for adolescents are serious. That's why I helped pass legislation for handling concussions in VA schools. Quote Tweet Times-Dispatch @RTDNEWS Not just an NFL problem | Brain damage and Richmond-area high school football, Part 1: The Culture http:// richmond.com/sports/high-sc hool/football/not-just-an-nfl-problem-brain-damage-and-richmond-area/article_9e0c8a30-ae0d-11e7-b0c1-33e9f74e180c.html ", "2017-10-14T15:35:40.000Z": ". @JoeBiden was so fired up to help elect @RalphNortham they had to call in the fire squad #VAGov  #FiredUpReadyToGo  #GameOnVA", "2017-10-14T14:08:05.000Z": "We're LIVE with @JoeBiden in Reston to discuss my G3 jobs plan to build our workforce and elevate our economy. Ralph Northam on Facebook Watch We're LIVE with Joe Biden in Reston to discuss my G3 jobs plan to build our workforce and elevate our economy. facebook.com", "2017-10-14T02:04:29.000Z": "Clear eyes.\nFull hearts.\nCan't lose. #GameOnVA", "2017-10-13T22:06:22.000Z": "Happy 242nd birthday, @USNavy . To our Virginia sailors, thank you for your service and commitment to keeping our country safe! #242NavyBday", "2017-10-13T21:07:23.000Z": "If only Ed Gillespie had been this defensive of Virginia's healthcare...", "2017-10-13T19:44:10.000Z": ". @BarackObama is coming to Richmond to help us get out the vote! Sign up to join him now: http:// bit.ly/2z7coEy", "2017-10-13T18:17:05.000Z": "I'm committed to making progress every single day. Will you commit to do the same? Take the pledge here: I Will Vote Be a voter in the 2020 election. iwillvote.com", "2017-10-13T17:06:12.000Z": "PREDICTION: Trump won't campaign with @EdWGillespie -AKA Luther Strange 2.0. Doesn't want to be seen with another establishment loser. Sad!", "2017-10-13T16:02:22.000Z": "Read Ralph's response to the president's deliberate move to destabilize the Affordable Care Act:", "2017-10-13T14:33:44.000Z": "It's well past time we ensure equal pay for all, regardless of gender. Here's how I'll fight for it: http:// bit.ly/2yj6a5a", "2017-10-13T00:33:18.000Z": "Ralph grew up on the Chesapeake Bay, and as governor he'll continue fighting for its restoration. Town: Northam is the right choice for our environment By Michael Town roanoke.com", "2017-10-12T22:55:54.000Z": "Your friends say a lot about you. Ed's friends? Enron The DeVos Family NRA  \n\nRead more: https:// gillespiefacts.com", "2017-10-12T20:30:03.000Z": ". @RalphNortham has laid out a plan to help level the playing field between women & men. @EdWGillespie ? Not so much. http:// bit.ly/2yGaQF6", "2017-10-12T21:37:24.000Z": "I was raised on a farm on the Eastern Shore-our VA ag community is extra special to me. #NationalFarmersDay  http:// bit.ly/2z2pin5", "2017-10-12T19:59:21.000Z": "We can't play political games with women's health, and you can count on Ralph to stop attacks on their healthcare. During Monday's debate, Ralph voiced his support for expanding long-acting reversible His plans for women and families don't end there. medium.com", "2017-10-12T19:08:20.000Z": "@ me next time. Quote Tweet Ed Gillespie @EdWGillespie Ralph, this is false and you know it. I said as much on Monday night. https:// twitter.com/RalphNortham/s tatus/918544566122401792 ", "2017-10-12T18:31:04.000Z": "Trump's agenda cuts the Appalachian Regional Commission, healthcare and school funding. By association, Ed could do the same.", "2017-10-12T16:58:12.000Z": "Thank you for your support, Alex! Keep up the great work advocating for a more accepting and inclusive VA. I promise to do the same. Quote Tweet Alex Sprague @TheAlextrifier Everyone! Here is my full story on why I am supporting @RalphNortham for governor! #GameOnVA  #NoAutisticChildrenLeftBehind", "2017-10-12T15:33:20.000Z": ". @BarackObama &\nRalph Northam&\nYou!\n\nSign up now: http:// bit.ly/2gyWR9s", "2017-10-12T14:06:44.000Z": "NEW: As governor, I'll make sure those who serve our country are always taken care of.", "2017-10-12T00:01:22.000Z": "Take it from Executive Director of @VirginiaLCV Michael Town: Ralph is the right choice for Virginia's environment. Town: Northam is the right choice for our environment By Michael Town roanoke.com", "2017-10-11T22:29:46.000Z": "Ed Gillespie cashed in working for climate change deniers. How can we trust him to protect our environment?", "2017-10-11T21:31:40.000Z": "NEW: Ralph knows strong women and families are vital to Virginia's economic prosperity. Read his new policy here: http:// bit.ly/2ybZ6ti", "2017-10-11T20:28:40.000Z": "We're in RVA at the Women for @RalphNortham Policy Rollout & Happy Hour! Excited to talk about Ralph's policy vision for VA women! #GameOnVA", "2017-10-11T19:39:56.000Z": "@BrodieAvL having a great time canvassing for . @RalphNortham in the great autumn weather! #GameOnVA  #FairFamSouth", "2017-10-11T19:33:46.000Z": "Monday night's debate proved it: Ralph's the best candidate for the job. 5 Ways Ralph Won Last Night's Debate Last night was the final debate between Ralph Northam and Ed Gillespie, and the results were clear: Ralph is the only candidate with a real medium.com", "2017-10-11T18:06:43.000Z": "Fired up, ready to go! Join @BarackObama and Ralph for a get-out-the-vote rally in Richmond: http:// ralphnortham.com/obama", "2017-10-11T17:24:12.000Z": "Happy #NationalComingOutDay to our LGBT community. Your identity is valid-and we are a stronger VA because of you.", "2017-10-11T17:00:43.000Z": "VA is an inclusive and diverse community-we won't put up with Ed Gillespie's racist rhetoric and fearmongering. Richmond-area Latinos say Gillespie's 'sanctuary cities' ads give hurtful message Alfredo Martinez was working on a construction project when he heard a radio ad about \"illegal immigrants\" and the gang MS-13 committing rape. richmond.com", "2017-10-11T16:22:28.000Z": "NEWS Text VIRGINIA to 21333 right now for a special announcement at 2:00 p.m. You won't want to miss this one. #GameOnVA", "2017-10-11T14:51:22.000Z": "NEW: Virginia can't afford to go backwards when it comes to protecting our environment. The health of our families depends on it.", "2017-10-11T13:34:50.000Z": "\"We have so much to be proud of with our colleges and universities in Virginia,\" says @RalphNortham to @growth4va summit.", "2017-10-11T00:05:12.000Z": "Last night confirmed that while Ralph was building a career serving Virginia, Ed built one working against it. In their final debate for Va. governor, Northam and Gillespie spar over records, economy, taxes In a state where population centers get the most attention, they tried to attract rural votes. washingtonpost.com", "2017-10-10T22:29:51.000Z": "Thank you, @WendyDavis , for joining @PamNorthamVA on the trail today to discuss the importance of women's access to healthcare in Virginia.", "2017-10-10T21:49:29.000Z": "After last night's debate, it's clear. Ralph is the only one who'll move VA forward. 5 Ways Ralph Won Last Night's Debate Last night was the final debate between Ralph Northam and Ed Gillespie, and the results were clear: Ralph is the only candidate with a real medium.com", "2017-10-10T20:01:08.000Z": "If you only remember one key moment in the #VAGovDebate last night, let it be this:", "2017-10-10T18:45:41.000Z": "So happy to have @JoeBiden join us this Saturday to talk about how we can bring new collar jobs of the 21st century to Virginia. #GameOnVA Quote Tweet Julie Carey @JulieCareyNBC Former VP Biden is coming to #Virginia to campaign for @RalphNortham . He's doing a workforce event Saturday in Reston @nbcwashington", "2017-10-10T17:27:10.000Z": "We have a few questions about where Ed stands on guns, but he could start by releasing his NRA survey. Gillespie backs 'bump stock' restrictions; declines to release NRA questionnaire Gun control advocates demand Gillespie release his responses to the NRA that earned him its endorsement washingtonpost.com", "2017-10-10T16:55:47.000Z": "US House candidate, TX-21 I'm thrilled to be in the Commonwealth supporting @RalphNortham and all the D House of Delegates candidates who support women's health Quote Tweet Ivana  Hall @MissTexas2013 Love seeing my fellow Texan @wendydavis talking to Virginian's about Ralph and his amazing record of protecting women's rights. https:// twitter.com/mo_shatara/sta tus/917777436682735616 ", "2017-10-10T15:32:46.000Z": "We've made so much progress in the last four years, let's keep it going by voting blue this November! #GameOnVA Virginia named one of the 'Top States for Doing Business' The Commonwealth of Virginia has been named one of the \"Top States for Doing Business,\" according to Area Development, a leading executive magazine. wtvr.com", "2017-10-10T14:33:44.000Z": "'In this particular election, wmns healthcare is clearly at stake. We have the opportunity to go forward' w/ @RalphNortham says @wendydavis", "2017-10-10T13:51:27.000Z": "NEW: Ed Gillespie is proud of his history lobbying against Virginia's families. #VAGovDebate", "2017-10-10T12:22:07.000Z": "Ed Gillespie is Donald Trump's candidate. We need to help his opponent, @RalphNortham become the next #VAGov : I just gave! Join us! Contribute today. secure.actblue.com", "2017-10-10T02:12:10.000Z": "Proud of @RalphNortham in the #VAGOVdebate and how he has and will continue to support #reprorights Quote Tweet Ralph Northam @RalphNortham Ed Gillespie would defund Planned Parenthood and wants to see abortion \"be banned\". Ralph Northam has been a champion for women's health.", "2017-10-10T01:37:29.000Z": "Standing Ovation for our next Virginia Governor @RalphNortham Judge a candidate by how he has lived his life serving others Quote Tweet VEA Fund @VEAFund Packed house at the @RalphNortham  #VaGovDebate victory party in Wise!", "2017-10-10T01:30:58.000Z": "Proud of @RalphNortham for fighting  for Virginians from Northern Virginia to Wise and everywhere in between", "2017-10-10T01:25:27.000Z": "Proud of @RalphNortham tonight!", "2017-10-10T00:51:40.000Z": "Once again, @RalphNortham showed us why he's the choice to lead VA. 29 days left to remind neighbors and friends to vote Nov 7! #GameOnVA", "2017-10-10T00:37:00.000Z": "29 days out-time is a flat circle. Quote Tweet Laura Vozzella @LVozzella . @RalphNortham just wished everyone a great weekend. It's Monday.", "2017-10-10T00:26:07.000Z": ". @RalphNortham is strong at these debates, but the real reason to vote for him is a lifetime of service: veteran, doctor, Senator. #VAGov", "2017-10-10T00:28:43.000Z": "I've known Ralph for a long time. Cannot say enough good things about him.  He will work hard for all of us as Governor. @RalphNortham Quote Tweet Ralph Northam @RalphNortham Ralph just won his third and final debate! RT to show how proud you are to vote for him as governor of Virginia! #VAGovDebate", "2017-10-10T00:26:25.000Z": "With tonight's final #VAGovDebate , @RalphNortham once again showed why he's ready to be our next governor & fight for our values. 29 days!", "2017-10-10T00:20:44.000Z": "The choice is clear. @RalphNortham is the only candidate who will increase access to healthcare & fight for equality for all. #VaGovDebate", "2017-10-10T00:20:12.000Z": "I'm proud, excited, fired up, and happy to be helping others get ready to vote for @RalphNortham - Join our efforts!! DM for dets #GameOnVA Quote Tweet Ralph Northam @RalphNortham Ralph just won his third and final debate! RT to show how proud you are to vote for him as governor of Virginia! #VAGovDebate", "2017-10-10T00:17:50.000Z": "Replying to @RobynGLC  and  @RalphNortham Thanks, Ralph, for your dedication, consistency, and service. We know who you are.", "2017-10-10T00:19:52.000Z": "We stand with @RalphNortham and utterly reject @EdWGillespie 's consistent racist fear mongering. VA deserves better. #VAGovDebate Quote Tweet Ralph Northam @RalphNortham Ed's fear mongering is about scaring immigrant communities and dividing Virginians, not keeping VA safe. #VAGovDebate", "2017-10-10T00:19:33.000Z": "Pledge to vote on November 7 for the only candidate who embraces an inclusive Virginia, @RalphNortham  https:// casainaction.org  #VAGovDebate", "2017-10-10T00:19:00.000Z": "Shout out to the \"F Ratings\" club! Proud to join @RalphNortham in that! Quote Tweet Ralph Northam @RalphNortham A study in contrasts:\n\nThe @NRA is spending $1 million on Ed Gillespie's behalf.\n\nMeanwhile, Ralph is proud of his F-rating. #VAGovDebate", "2017-10-10T00:17:08.000Z": "Could not be prouder of @RalphNortham 's debate performance! He won because he showed Virginians he has what it takes to be next #VAGov", "2017-10-09T23:57:27.000Z": ". @RalphNortham has been a champion of a safer Virginia for years. He'll stand up to the gun lobby and protect our communities. #VAGovDebate", "2017-10-10T00:02:53.000Z": "I'm not sure proud does it justice! Fired up and ready to go for this last month. Time for another Dem sweep!... http:// fb.me/1GBUOsZRk", "2017-10-10T00:11:45.000Z": "Tonight's #VAGovDebate was a reminder that @RalphNortham won't back down when it comes to VA women & families. We're proud to support him!", "2017-10-10T00:08:35.000Z": "Talk about a clear contrast: Ed Gillespie doubled down on Trumpian fear-mongering. @RalphNortham presented clear, progressive vision for VA!", "2017-10-10T00:08:00.000Z": "Tonight, @RalphNortham showed us again that he will be a governor for all Virginians. Four weeks to victory! #VAGovDebate", "2017-10-10T00:02:29.000Z": "Congratulations to @RalphNortham on his #VAGOVDebate win tonight! You have the support of Va's educators!", "2017-10-10T00:06:18.000Z": "It's no surprise @RalphNortham raised #reprofreedom in tonight's #VAGovDebate when no one else would. He has always put women's rights 1st:", "2017-10-10T00:05:37.000Z": "I'm proud to run with him and I'll be proud to vote for him. @RalphNortham will be a great Governor. Tonight he showed us why #VAGovDebate Quote Tweet Ralph Northam @RalphNortham Ralph just won his third and final debate! RT to show how proud you are to vote for him as governor of Virginia! #VAGovDebate", "2017-10-10T00:05:39.000Z": "The choice is easy. On November 7, vote for @RalphNortham . #VAGovDebate", "2017-10-10T00:04:01.000Z": "Only one candidate had the right answers in tonight's #VAGovDebate on education, jobs, choice, and progress-his name is @RalphNortham .", "2017-10-10T00:00:06.000Z": "Ralph just won his third and final debate! RT to show how proud you are to vote for him as governor of Virginia! #VAGovDebate", "2017-10-09T23:58:21.000Z": "A study in contrasts:\n\nThe @NRA is spending $1 million on Ed Gillespie's behalf.\n\nMeanwhile, Ralph is proud of his F-rating. #VAGovDebate", "2017-10-09T23:54:53.000Z": "Ed's fear mongering is about scaring immigrant communities and dividing Virginians, not keeping VA safe. #VAGovDebate", "2017-10-09T23:50:43.000Z": "Ed Gillespie would defund Planned Parenthood and wants to see abortion \"be banned\". Ralph Northam has been a champion for women's health.", "2017-10-09T23:50:03.000Z": ". @RalphNortham takes his ONE QUESTION in this debate to talk about access to contraception. this is what a feminist looks like! #vagovdebate", "2017-10-09T23:48:26.000Z": "BOOM! @RalphNortham asks @EdWGillespie AGAIN if he will expand access to birth control as Gov. #VAGovDebate", "2017-10-09T23:42:54.000Z": "Gillespie on his lobbying clients: \"I was effective on their behalf\"\nClients like: Predatory student loan lenders Big banks #VAGovDebate", "2017-10-09T23:37:45.000Z": "US House candidate, VA-8 . @RalphNortham shows up for VA -- as lt. governor and in our military in Desert Storm. Ed Gillespie is busy lobbying in DC. #VAGovDebate", "2017-10-09T23:36:58.000Z": "As an Army doctor and pediatric neurologist, Ralph's been serving VA for years. Ed shows up for whoever pays him. #VAGovDebate", "2017-10-09T23:34:57.000Z": "We need to connect Virginians with good-paying jobs and affordable education and training. Here's how: G3 - Get Skilled - Get a Job - Give Back Restoring the dignity of work medium.com", "2017-10-09T23:30:36.000Z": "Ralph has a reputation for bringing people together to work for the common good. That's how he'll expand access to broadband in rural VA.", "2017-10-09T23:27:38.000Z": "Benefits of having a doctor, rather than a DC lobbyist, as governor. #VAGovDebate Quote Tweet Ralph Northam @RalphNortham As a doctor, Ralph has treated babies suffering from opioids. He brings that compassion to his plan to address it: https:// ralphnortham.com/opioids/", "2017-10-09T23:26:28.000Z": "As a doctor, Ralph has treated babies suffering from opioids. He brings that compassion to his plan to address it: https:// ralphnortham.com/opioids/", "2017-10-09T23:22:50.000Z": "We should be making it easier to vote-not harder. http:// bit.ly/2r5z0EE  #VAGovDebate Virginia Votes Expanding voting rights and increasing government transparency medium.com", "2017-10-09T23:22:01.000Z": "FACT: Ed Gillespie was the architect of partisan gerrymandering in this country. Ralph won't sign a map unless it's fair and nonpartisan.", "2017-10-09T23:19:58.000Z": "ICYMI: Today Ralph earned the endorsement of the United Mine Workers of Virginia.", "2017-10-09T23:16:11.000Z": "Ed Gillespie says he wants to raise teacher pay, but his budget plan would gut our education system. We can't trust him to fund our schools.", "2017-10-09T23:12:51.000Z": "There is power in every child-they just need a quality education to unlock it: https:// ralphnortham.com/education/", "2017-10-09T23:11:20.000Z": "\"As a doctor, I have a plan to resuscitate rural Virginia.\" -Ralph http:// bit.ly/2veG6Gw  #VAGovDebate My plan for economic growth in rural Virginia I'm from rural Virginia, and as governor, I am committed to making sure Virginia's economy works for everyone - no matter who you are, no medium.com", "2017-10-09T23:08:54.000Z": "\"I believe in investing in Virginians because when we do, there is no other state that can beat us.\" -Ralph at the #VAGovDebate", "2017-10-09T23:02:50.000Z": "We're LIVE from Wise County at the final #VAGovDebate ! Watch Ralph share his plans to keep VA moving forward here: http:// bit.ly/2wIiZEl", "2017-10-09T22:40:11.000Z": "Let's win this for her. #GameOnVA", "2017-10-09T18:33:37.000Z": "#VAGovDebate is in Wise tonight. Under @EdWGillespie , schools in Wise County stand to lose $399 per student. http:// tinyurl.com/y8d4lthj  #VAGov", "2017-10-09T21:02:11.000Z": "While Ed Gillespie sat silent on several attempts to gut healthcare in VA, these folks were camping out overnight for one day of treatment.", "2017-10-09T20:02:28.000Z": "Ed Gillespie's dangerous tax plan could cost Virginia schools $404 million. See how it could hurt your family: http:// tabsoft.co/2kAhDtO", "2017-10-09T18:32:27.000Z": "Ed Gillespie wants to take away a woman's right to choose.\n\nWe won't let him get away with it.", "2017-10-09T17:12:13.000Z": "It's debate day, and tonight @RalphNortham will again show how he's the best candidate to move Virginia forward! \n\nGo, Ralph, go! #GameOnVA", "2017-10-09T16:31:51.000Z": "When healthcare comes up in tonight's #VAGovDebate , remember: Every day the VA GOP refuses to expand Medicaid, more lives are put at risk.", "2017-10-09T15:40:24.000Z": "NEW: Ed Gillespie's tax plan would be devastating to schools in your neighborhood. See for yourself: http:// tabsoft.co/2kAhDtO", "2017-10-09T14:24:44.000Z": "NEW: Ed Gillespie has a history of selling out folks in Virginia. Don't expect that to change anytime soon.", "2017-10-09T13:45:54.000Z": "Honored to receive the endorsement of the United Mine Workers of America. Together we can build a stronger economy for folks across VA.", "2017-10-08T23:03:11.000Z": "Ed Gillespie's fear-mongering tactics are not Virginia values.", "2017-10-08T20:40:06.000Z": "Ran the 10 miler & now I'm knocking on doors for @RalphNortham @fairfaxforlg @MarkHerringVA & @pwcdanica  #RunArmyRunStrong  #GameOnVA  #SEIU", "2017-10-08T20:50:05.000Z": "Hate and intolerance are not Virginia values. White nationalists stage torch-lit rally at Charlottesville's Lee statue Saturday night CHARLOTTESVILLE - White nationalists, including \"alt-right\" leader Richard Spencer, assembled once again at the foot of Charlottesville's Robert E. Lee statue in Emancipation Park, armed with torches... richmond.com", "2017-10-08T18:53:07.000Z": "VA deserves to know whether Gillespie will put the profits of the gun lobby over the safety of Virginia families. Gillespie backs 'bump stock' restrictions; declines to release NRA questionnaire Gun control advocates demand Gillespie release his responses to the NRA that earned him its endorsement washingtonpost.com", "2017-10-08T17:22:23.000Z": "\"Gillespie, the godfather of the GOP gerrymander\" http:// thebea.st/2hSBAv3", "2017-10-08T15:58:04.000Z": "ICYMI: Ralph Northam will always advocate on behalf of women and their reproductive choices.", "2017-10-08T14:47:03.000Z": "White supremacists are not welcome in Virginia, and they will not win.", "2017-10-08T01:53:56.000Z": "Hey, @EdWGillespie . Next time you talk to Trump, tell him we're sick of this here in Virginia. Quote Tweet Richard Spencer @RichardBSpencer Charlottesville 3.0 was as success.", "2017-10-07T21:56:07.000Z": "Ed Gillespie's baseless attacks are just that-baseless.", "2017-10-07T20:17:30.000Z": "I've seen the effect of the opioid epidemic on our children's health. I won't allow it to continue. Speaking out on behalf of the voiceless As parents, we'll go to the ends of the earth for our kids. As soon as they're born - and during pregnancy - we hope and pray for their medium.com", "2017-10-07T18:30:01.000Z": "We can't let Trump's racist, misogynist agenda win in #VA . We stand w/ @RalphNortham bc he stands w/ women. Donate: I just gave! Join us! Contribute today. secure.actblue.com", "2017-10-07T18:08:40.000Z": "How many hardworking Virginians are shouldering student loan debt because Ed lobbied for lenders? Critics say Gillespie firm's lobbying for lenders raises questions about commitment to college... Virginia's Republican gubernatorial contender bills himself as someone who will improve college affordability, but for years his lobbying firm Quinn Gillespie & Associates fought to do the exact... washingtonpost.com", "2017-10-07T15:53:54.000Z": "NextGen Virginia organizers mobilizing with @PPGenAction for day of action to elect @RalphNortham & other statewide progressives! #GameOnVa Quote Tweet Annie Kuenning @anne_kuenning Hey @EdWGillespie & @realDonaldTrump - keep your hands off our birth control!! #GameOnVA  #PinkOutVA", "2017-10-07T15:49:35.000Z": "Ed Gillespie would end a woman's right to choose.", "2017-10-07T14:07:00.000Z": "The past couple of months have been hard, but our Virginia National Guard has stepped up. A quick thank you to Virginia's National Guard The past couple of months have been hard - not only for Virginians, but for all Americans - with damaging hurricanes in Texas, Florida, and medium.com", "2017-10-06T23:19:08.000Z": "Last night, Trump tried to link Ralph to MS-13 violence with a tweet endorsing his top lobbyist. Ralph's response:", "2017-10-06T21:04:31.000Z": "I want to take a moment and recognize the efforts of Virginia's National Guard. A quick thank you to Virginia's National Guard The past couple of months have been hard - not only for Virginians, but for all Americans - with damaging hurricanes in Texas, Florida, and medium.com", "2017-10-06T19:26:06.000Z": "Addiction does not discriminate. This issue impacts folks of all backgrounds-take it from the Democratic ticket.", "2017-10-06T18:07:44.000Z": "Ed Gillespie blaming Ralph for MS-13 violence is nothing more than a page from Trump's playbook.", "2017-10-06T17:39:44.000Z": "Shameful and wrong. A woman's body and reproductive choices are just that: her own. #HandsOffMyBC Quote Tweet The Washington Post @washingtonpost Trump administration issues rule narrowing women's access to birth-control coverage under the Affordable Care Act http:// wapo.st/2fXOuaw", "2017-10-06T16:23:50.000Z": "If you're mad about Trump's move on contraception, remember @JohnAdamsforVA helped pave the way for this w/ his work supporting Hobby Lobby.", "2017-10-06T16:44:30.000Z": "RT if you agree that Ed Gillespie should share the questionnaire that earned him the NRA's endorsement.", "2017-10-06T14:49:12.000Z": "NEW: Women's healthcare choices are best left between a woman and her doctor.\n\nEd Gillespie disagrees.", "2017-10-06T02:10:17.000Z": "TBH I've been expecting this. Donate here: http:// bit.ly/2ggnAY8 Quote Tweet Donald J. Trump @realDonaldTrump Ralph Northam,who is running for Governor of Virginia,is fighting for the violent MS-13 killer gangs & sanctuary cities.  Vote Ed Gillespie!", "2017-10-06T00:25:35.000Z": ". @FairfaxJustin proved to everyone tonight that he's the right candidate for LG. Can't wait to get to work! #VALGForum  #GameOnVA", "2017-10-06T00:09:18.000Z": "Bump stocks and high capacity magazines have no place in civil society. As governor, I'll propose legislation to ban them. Quote Tweet CNN @CNN How does a 'bump stock' on a semi-automatic weapon work? @JohnKingCNN explains http:// cnn.it/2y36Qxr  http:// cnn.it/2fPgGsy", "2017-10-05T22:46:04.000Z": "Good luck to my friend, @FairfaxJustin in tonight's #VALGForum . There's no doubt in my mind that he'll be a great lieutenant governor.", "2017-10-05T21:18:51.000Z": "Small businesses aren't built on the backs of hardworking Virginia families, Ed.", "2017-10-05T19:00:32.000Z": "Brandon Wolf, Pride Fund Board Member, voices his strong support for @RalphNortham in Virginia's gubernatorial race. Opinion | Pulse survivor on why Northam is best for Va. governor Sensible reforms will help rein in gun violence washingtonblade.com", "2017-10-05T19:10:16.000Z": "We care deeply about ensuring that fewer Virginians have to undergo the devastation that opioid addiction wreaks on a family.", "2017-10-05T17:33:50.000Z": "As parents we'll go to the ends of the earth to protect our kids' health and that includes ending the opioid crisis. Speaking out on behalf of the voiceless As parents, we'll go to the ends of the earth for our kids. As soon as they're born - and during pregnancy - we hope and pray for their medium.com", "2017-10-05T15:06:53.000Z": "Ed Gillespie enlisted #MOGov Eric Greitens - who wasted thousands in taxpayer $$ to restrict abortion - to help him campaign. #VAGov", "2017-10-05T15:38:57.000Z": "Virginia is a great place to live and to do business. The latest investment from Facebook proves it. http:// bit.ly/2xgkjm9", "2017-10-05T14:02:01.000Z": "Ed Gillespie's \"small businesses\" are neither small nor economically beneficial to Virginia families.", "2017-10-05T13:01:16.000Z": "Love these Latina leaders. Their passion for comunidad & a bright future is contagious. Thx for supporting @Ralphnortham ! #VAVota  #GameOnVA", "2017-10-04T23:37:21.000Z": "Thank you to all who signed up to volunteer for @RalphNortham at @VagabondRVA tonight. Grateful for your help! 34 days left. #GameOnVA", "2017-10-04T22:33:30.000Z": "With only 34 days left until Election Day, we need to reach every Virginia voter we can. Text VICTORY to 21333 to help us get it done!", "2017-10-04T20:36:24.000Z": "Ralph knows that working with law enforcement is critical to ending the opioid crisis in VA. Read his plan here: http:// bit.ly/2hPnZop", "2017-10-04T18:54:06.000Z": "Ending Virginia's opioid epidemic for good starts with recognizing that addiction is a disease. Speaking out on behalf of the voiceless As parents, we'll go to the ends of the earth for our kids. As soon as they're born - and during pregnancy - we hope and pray for their medium.com", "2017-10-04T17:09:17.000Z": "Virginia needs a governor who will fight for college affordability-not one with a history of lobbying against it. Critics say Gillespie firm's lobbying for lenders raises questions about commitment to college... Virginia's Republican gubernatorial contender bills himself as someone who will improve college affordability, but for years his lobbying firm Quinn Gillespie & Associates fought to do the exact... washingtonpost.com", "2017-10-04T15:40:06.000Z": "Business leaders want to help create pathways for students to good-paying jobs. A skilled workforce means a stronger economy. Quote Tweet News 5 WCYB @news5wcyb United Way of SWVA hopes to launch apprenticeships, but they need assistance to get the programs running. http:// wcyb.com/news/virginia/ industry-leaders-assist-in-promoting-career-opportunities-for-students/627107243 ", "2017-10-04T13:46:03.000Z": "NEW: Ralph just released his plan to tackle the opioid crisis in Virginia. http:// bit.ly/2ynZO7s", "2017-10-03T21:31:33.000Z": "We have a chance to build a school-to-jobs pipeline that will create a workforce unmatched in skills and training. Let's make it happen.", "2017-10-03T19:03:26.000Z": "As governor, I'll work to make Virginia a leader in technology by focusing on workforce development in our schools.", "2017-10-03T16:42:07.000Z": "Every Virginian should have access to a quality education-especially our veterans. Always faithful Lots of people are familiar with the U.S. Marine Corps motto - \"Semper Fi\" - but few could actually define it. \"Semper Fi,\" or \"always medium.com", "2017-10-03T14:11:41.000Z": "When our children receive a quality education, there's nothing they can't overcome.", "2017-10-03T00:31:08.000Z": "Ralph is attending @CSGV 's vigil for the victims of last night's shooting in Las Vegas. Ralph Northam on Facebook Watch Ralph is attending Coalition to Stop Gun Violence's vigil for the victims of last night's shooting in Las Vegas. facebook.com", "2017-10-02T19:27:46.000Z": "Praying for a quick recovery for Allison and Andrew from Norfolk, injured during last night's shooting in Las Vegas. Couple from Norfolk injured in Las Vegas shooting Allison Crute and her boyfriend, Andrew Kampe, both were injured when a gunman opened fire from a hotel room above a packed, outdoor concert in Las Vegas.", "2017-10-02T11:56:16.000Z": "Pam and I are praying for everyone involved in last night's mass shooting in Las Vegas. Make no mistake: This is terrorism. We have got to do more to prevent events like this moving forward. I'm tired of waking up to horrific news like this, and I'm sure you are, too.", "2017-10-02T00:18:48.000Z": "Great to see @RalphNortham firing up Dems at the Kennedy-King dinner in Arlington tonight!", "2017-10-01T22:50:25.000Z": "Honored to introduce Virginia's next Governor @RalphNortham at a rally at Eden Center where diversity is our strength, and Ralph knows it!", "2017-10-01T22:40:08.000Z": "Just casually committing voters one door at a time for @RalphNortham and @vademocrats down the ticket!!!  #GameOnVA  #BigTENt", "2017-10-01T19:55:16.000Z": "#SoCo students for @RalphNortham ! Thanks for coming out to #KeepVABlue guys! #GameOnVA  #FairFamSouth", "2017-10-01T21:10:56.000Z": "Ed Gillespie's loyalties lie with whoever is paying him.", "2017-10-01T18:40:35.000Z": "What better way to spend a Sunday than phone banking for @RalphNortham ? @NARAL  @NARALVirginia  #organize  #VoteBlue", "2017-10-01T18:02:31.000Z": "Fall leaves? Sneakers? Clipboard for canvassing? Must be an election coming up. Vote for @RalphNortham ! #GameOnVA", "2017-10-01T17:58:26.000Z": "Canvassing is the name of the game! Talking to neighbors about @RalphNortham , @FairfaxJustin , and @MarkHerringVA  #GameonVA", "2017-10-01T19:34:57.000Z": "Ed Gillespie's tax plan looks a lot like ... Trump's. That's a red flag. Trump's Tax Plan Has Echoes Of The Kansas Tax Cut Experiment Republican Gov. Sam Brownback said the 2012 tax cuts would deliver a \"shot of adrenaline\" to the state's economy. Instead, revenues crashed, spending cuts, borrowing and accounting tricks followed. npr.org", "2017-10-01T14:49:31.000Z": "Happy KNOCKtober Virginia! Can't wait to watch #SuperNoVA crush it on the doors again today!  #GameOnVA  #WeekendOfAction", "2017-10-01T17:17:54.000Z": "It's a beautiful day to elect democrats! Thank you to our amazing Springfield volunteers!  #GameOnVA  #FairFamSouth", "2017-10-01T18:00:03.000Z": "Here's what you need to know about Donald Trump's top lobbyist in Virginia: https:// gillespiefacts.com", "2017-10-01T16:41:22.000Z": "Beautiful day for a father daughter canvass! #GameOnVA", "2017-10-01T16:44:50.000Z": "I'm fighting to build a Virginia that works for everyone, but I need your help. Will you join me? https:// events.vademocrats.org", "2017-10-01T14:58:51.000Z": "Investing in the success of our children and workforce is how we build an economy that thrives for years to come.", "2017-10-01T14:01:05.000Z": "Election day for #VAGov is just over a month away! @RalphNortham has a message for NARAL members working to get out the vote before 11/7:", "2017-10-01T13:14:00.000Z": "As a doctor, I'm concerned. As a human being, I'm disgusted. This could hurt Virginia kids. They deserve better. Quote Tweet ABC News @ABC Congress misses deadline to reauthorize Children's Health Insurance Program; funding will expire at end of the month http:// abcn.ws/2fyZYNF", "2017-09-30T23:00:57.000Z": "Gillespie is bad news for Virginia. See for yourself. https:// gillespiefacts.com", "2017-09-30T20:33:07.000Z": "High School students working together to knock doors for @RalphNortham and Democrats down the ticket!  #GameOnVA  #FairfaxNorth  #BigTENt", "2017-09-30T21:00:38.000Z": "Virginia's port is on course to becoming one of the greatest in the country. That's progress. http:// bit.ly/2fZPjwh", "2017-09-30T19:42:43.000Z": "Too many canvassers to fit inside in Albemarle! 38 days left to elect @RalphNortham and our full Dem ticket. #GameOnVA", "2017-09-30T16:10:11.000Z": "Unbelievable Weekend of Action turnout this morning! Proud to introduce @RalphNortham as he fired up volunteers! #GameOnVA  #JonesFor89", "2017-09-30T19:09:24.000Z": "We have a chance to build an economy that works for everyone, but it's going to take all of us. Join the fight here: https:// events.vademocrats.org", "2017-09-30T18:20:18.000Z": "Beautiful day in Virginia knocking doors and talking to some awesome people about @RalphNortham for Governor.", "2017-09-30T17:19:29.000Z": "Canvassers practicing voter conversations before heading out to knock on doors! Excitement for @RalphNortham in #alexandria ! #GameOnVA", "2017-09-30T16:45:49.000Z": "These leaders know that we have to continue to fight for progress in our communities. Great discussion today with @RalphNortham", "2017-09-30T16:02:34.000Z": "It's a family affair! Knocking doors with my son today to elect @RalphNortham for #VAGov , @FairfaxJustin for LG & @MarkHerringVA for AG!!", "2017-09-30T14:23:02.000Z": "Weekend of Action off to a great start! #fairfamsouth", "2017-09-30T16:19:35.000Z": "By investing in our tech sector, we can bring new jobs to Virginia and revitalize our economy. http:// bit.ly/2yKz9i9", "2017-09-30T15:30:02.000Z": "A morning well spent canvassing for @RalphNortham , @MarkHerringVA , and @JenniferBoysko", "2017-09-30T15:10:58.000Z": "We had a great morning here in Norfolk w/ @RalphNortham & @jonesjay joining us bright and early to kick-off our Weekend of Action! #GameOnVA", "2017-09-30T14:01:54.000Z": "By improving Virginia's mental health resources, we can help ensure folks get the care they need. State official: Without action, Virginia's public mental hospitals will overflow by 2024 State-run mental hospitals will overflow by 2024 if Virginia does not change how it funds and administers public mental health treatment, the state's behavioral health czar told lawmakers on Thursday. richmond.com", "2017-09-29T23:00:10.000Z": "Lt. Gen. Silveria is right-discrimination has no place in the Air Force or our communities. http:// n.pr/2xLochJ", "2017-09-29T22:00:56.000Z": "Yom Tov to those observing Yom Kippur. Wishing you an easy fast and peaceful reflection this holiday.", "2017-09-29T21:22:19.000Z": "For many Virginians, access to healthcare hangs by a thread. That's unacceptable. Health-Care Access in Virginia Pulls Focus in Political Landscape - Rewire.News Health care has often been a central issue in the lead up to November's high-profile gubernatorial race. rewire.news", "2017-09-29T20:13:21.000Z": "Grab a friend and grab a packet. It's time to knock doors and remind folks how important this election is! https:// events.vademocrats.org", "2017-09-29T18:29:49.000Z": "What does your Saturday morning routine say about you? http:// bit.ly/2xRkROM", "2017-09-29T17:36:20.000Z": "Ed Gillespie: Political insider Career lobbyist DC swamp creature", "2017-09-29T15:51:02.000Z": "@EdForVirginia 's edu plan doesn't even mention pre-K. @RalphNortham has a career dedicated to kids and is the right choice for #VAGov . Quote Tweet Ralph Northam @RalphNortham By expanding access to pre-K in VA, we'll get one big step closer to closing the inequality gap that starts early on. https:// twitter.com/Wonkblog/statu s/912689207977676800 ", "2017-09-29T15:33:44.000Z": "By expanding access to pre-K in VA, we'll get one big step closer to closing the inequality gap that starts early on. Quote Tweet Post Economy @PostEconomy By age 3, inequality is clear: Rich kids attend school. Poor kids stay with a grandparent http:// wapo.st/2foMnc1", "2017-09-29T00:04:01.000Z": "Enjoyed visiting bright kids at Ginter Park ES today w/ @RalphNortham  @JeffMBourne  @JennMcClellanVA , @CindyMenzErb", "2017-09-29T14:02:08.000Z": "The only thing more dangerous than the VA GOP's backwards agenda is the Republican candidate for governor. https:// gillespiefacts.com", "2017-09-28T23:42:26.000Z": "Feminine hygiene products are a necessity, not a luxury. Thank you, @BRAWSorg , for your work! Local organization provides women in need with hygiene necessities BRAWS has a mission to bring dignity and empowerment to women in shelters and schools by providing undergarments and feminine hygiene products. localdvm.com", "2017-09-28T22:16:20.000Z": ". @RalphNortham kicking things off at the Radio One #VAGov forum hosted by @COMMUNITYCLO here in Richmond", "2017-09-28T22:25:53.000Z": "Ed's tax plan could cost\nthe commonwealth billions and\nhelp the rich stay rich. #NationalPoetryDay  http:// bit.ly/2h88KX6", "2017-09-28T20:10:24.000Z": ". @VEAFund and I are doing everything we can to elevate education in VA. Ed's tax plan directly threatens that.", "2017-09-28T19:26:45.000Z": "Systemic inequality is real. It's wrong. And it's why I'm so proud of @RalphNortham 's work expanding pre-K access. https:// washingtonpost.com/news/wonk/wp/2 017/09/26/by-age-3-inequality-is-clear-rich-kids-attend-school-poor-kids-stay-with-a-grandparent/?tid=sm_fb&utm_term=.4a2e693df5ae ", "2017-09-28T18:13:27.000Z": "NEW: Ed Gillespie is running for governor to be Trump's top lobbyist in VA. Find all the facts in one place here: https:// gillespiefacts.com", "2017-09-28T16:37:09.000Z": "VEA analysis of Gillespie tax plan forecasts $404 million hit to public schools. https:// tinyurl.com/y7p7bv5p  @RalphNortham  @LevarStoney", "2017-09-28T16:21:49.000Z": "We tried to hear Ed out, but got #rejectED  #VAgov", "2017-09-28T16:04:12.000Z": "The opioid crisis is a public health emergency. Overdoses up, but fatalities down, across Richmond area so far in 2017 A woman who drew her last breath behind Franklin Military Academy in the city's East End was among the 80 to die of an opioid overdose this year in the richmond.com", "2017-09-28T14:36:43.000Z": "WARNING This Republican candidate may come with negative side effects. Ed's been lining his pockets at the expense of hardworking Virginians for years. His work for Bank of America is just one example. medium.com", "2017-09-28T00:35:45.000Z": "Don't underestimate Ed Gillespie-one of the biggest gators in Trump's swamp. He's ruthless.", "2017-09-27T23:03:46.000Z": "\"Dr. Northam's only allegiance is to the people of Virginia. And he's served us faithfully for decades.\" Morgan, Arthur, Millholland and Kincaid: Northam will keep Virginians safe As sheriffs from Frederick County to Arlington County, from Fairfax County to Newport News, we share one mission: keeping the people of Virginia safe. roanoke.com", "2017-09-27T21:33:20.000Z": "I couldn't agree more. VA's commitment to higher education will continue to bring new business to our commonwealth. W. Taylor Reveley IV column: Higher ed makes Virginia the best choice for Amazon's new home Dear Jeff Bezos, richmond.com", "2017-09-27T20:00:23.000Z": "Let this failure to pass Trumpcare settle it: It's time for Congress to work on a bipartisan fix to the ACA. Ralph Northam on Graham-Cassidy Senate failure - Augusta Free Press Dr. Ralph Northam comments on the U.S. Senate's latest failure to pass Graham-Cassidy, an attempt to repeal and replace the Affordable Care Act. augustafreepress.com", "2017-09-27T18:12:51.000Z": "NEW: Ed Gillespie has a history of prioritizing big corporations over Virginia families.", "2017-09-27T17:05:58.000Z": "These sheriffs agree: Ralph is the right candidate for governor. Morgan, Arthur, Millholland and Kincaid: Northam will keep Virginians safe As sheriffs from Frederick County to Arlington County, from Fairfax County to Newport News, we share one mission: keeping the people of Virginia safe. roanoke.com", "2017-09-27T15:32:36.000Z": "Republican politicking in congress is threatening the health of Virginia families. That's not OK. Premiums expected to jump nearly 60 percent in Va.'s 2018 individual market As many see their options for health plans dwindle down to one insurer, premiums are simultaneously set to rise by an average of 57.7 percent next year in Virginia's individual richmond.com", "2017-09-27T14:03:33.000Z": "By partnering with business leaders, schools can better prepare students to fill high-demand jobs here in VA. New business initiative aims at economic growth through higher education For the next 100 days, a new coalition of business and higher education leaders will push an aggressive agenda for state funding of public colleges and universities, with an eye richmond.com", "2017-09-27T02:05:14.000Z": "Congrats to Dems in FL and NH on their wins tonight! Only 42 days until our turn in VA. Sign up to get involved: http:// bit.ly/2wScJON", "2017-09-26T23:28:38.000Z": "As a doctor, I always recommend reading the warning labels. Ed Gillespie's is pretty bad.", "2017-09-26T22:01:22.000Z": "We have to work together if we want to end VA's opioid crisis. Thank you to @UVA for hosting this important event. http:// bit.ly/2xzyj7P", "2017-09-26T20:30:47.000Z": "This is what happens when Republicans create uncertainty in the marketplace. http:// bit.ly/2wRszcq", "2017-09-26T19:01:26.000Z": "Stopping dangerous bills like Trumpcare starts at the ballot box. Let's make it count this November. Sign up now: http:// bit.ly/2xukmu6", "2017-09-26T17:31:39.000Z": "This #NationalVoterRegistrationDay , make sure you're ready to vote in this year's critical election --> http:// bit.ly/1hRyUI6", "2017-09-26T15:56:14.000Z": "The Senate is voting on Trumpcare tomorrow. Call 202-224-3121 to help protect our care.", "2017-09-26T14:13:26.000Z": "Opposing a bill that could hurt hundreds of thousands of Virginia families is a no-brainer. (Unless you're Ed.) Virginia Republican Flip-Flops Almost Immediately On Opposing GOP Health Care Bill The Graham-Cassidy bill is causing problems for Virginia gubernatorial candidate Ed Gillespie. huffpost.com", "2017-09-25T23:54:53.000Z": "The GOP would benefit from a medical ethics lecture ... or two. I taught medical ethics - Trumpcare would fail The Republican alternative to Obamacare leaves too many behind medium.com", "2017-09-25T22:41:58.000Z": "Northam focuses on #GrahamCassidy in speech \"It's pitiful...It's unamerican. It's a tax cut for the rich on the working class' back\" #VAGov", "2017-09-25T22:29:25.000Z": "Expanding work credential programs will give folks the opportunity to learn the skills needed for good-paying jobs. The Road to a Stable Job-Without Crippling Student Debt A novel grant program in Virginia is helping workers earn career-boosting occupational credentials. washingtonmonthly.com", "2017-09-25T21:13:44.000Z": "Investing in tech programs like these will help us bring more good-paying jobs to Virginia. http:// bit.ly/2wQYqoI", "2017-09-25T19:34:18.000Z": "Ed's spent his career working for big corporations that've laid off hundreds of hardworking Virginians. Seriously. Ed's been lining his pockets at the expense of hardworking Virginians for years. His work for Bank of America is just one example. medium.com", "2017-09-25T18:06:53.000Z": "Ralph has been fighting for Virginians' health his whole career. He'll continue to do so as governor.", "2017-09-25T16:30:33.000Z": "The new Trumpcare bill doesn't pass any medical ethics standards-just compare it to the Northam Test. I taught medical ethics - Trumpcare would fail The Republican alternative to Obamacare leaves too many behind medium.com", "2017-09-25T14:03:47.000Z": "Is this why Ed Gillespie refuses to come out against the bill? Virginia gov: Cassidy-Graham bill 'nothing more than a tax cut for Virginia Gov. Terry McAuliffe (D) on Monday spoke out against Republicans' latest ObamaCare repeal effort in the Senate. thehill.com"}