{"2020-07-28T16:08:45.000Z": "I entered public service in 1985, fighting for a new public school in Selah. \n\nAnd 35 years later, I'm more dedicated than ever to improving the lives of Washingtonians and creating a stronger, more just future for all of us. Read Trudi and my story: https:// jayinslee.com/about", "2020-07-30T19:21:52.000Z": "WATCH: I'm holding a media availability at 2:30 PM today.\n\nTune in live: https:// tvw.org/watch/?clientID=9375922947&eventID=2020071143 ", "2020-07-30T19:36:06.000Z": "\"Ordinary people with extraordinary vision can redeem the soul of America by getting in what I call good trouble, necessary trouble.\"\n\nA beautiful farewell from John Lewis. And a rousing call to action that will not be ignored. Thank you, Congressman. Opinion | John Lewis: Together, You Can Redeem the Soul of Our Nation Though I may not be here with you, I urge you to answer the highest calling of your heart and stand up for what you truly believe. nytimes.com", "2020-07-30T15:49:24.000Z": "Vote by mail is safe and secure.\n\nYou can't delay the election.\n\n150,000 Americans have died from #COVID19 . \n\nStop tweeting. Do your job. Quote Tweet Donald J. Trump @realDonaldTrump With Universal Mail-In Voting (not Absentee Voting, which is good), 2020 will be the most INACCURATE & FRAUDULENT Election in history. It will be a great embarrassment to the USA. Delay the Election until people can properly, securely and safely vote???", "2020-07-30T01:05:47.000Z": "College isn't the only path to success.\n\nThat's why we launched Career Connect Washington, connecting 100,000 students with career-ready education like apprenticeships and technical education to build the skills they need to earn good-paying jobs. Jay's Top Priorities: Education jayinslee.com", "2020-07-30T00:09:53.000Z": "I'm extending the additional protections we created for workers at high risk from COVID-19.\n \nAs long as we're under a state of emergency, these worker protections will be in place. Inslee extends high-risk employee proclamation Gov. Jay Inslee today announced the extension of proclamation 20-46.1, first issued in April, which relates to protections for high-risk employees and workers' rights. governor.wa.gov", "2020-07-29T16:05:51.000Z": "Success is the sum of many small efforts. \n\nWearing a mask doesn't take much effort, but science shows that the impact really adds up. Quote Tweet NPR @NPR Researchers analyzed the data from every study on the protective effect of masks. \n\nTheir bottom-line estimate: If 95% of people wear cloth masks, it reduces transmission by at least 30%.\n\nWith this example, here's what happens over seven 5-day cycles  https:// trib.al/J5UZfeG", "2020-07-28T21:49:21.000Z": "Hey, Washington: Ballots are due in just one week! Every election and every vote matters-and as the saying goes, democracy is not a spectator sport. \n\nHere's everything you need to know: https:// bit.ly/3hJnS7h  #waelex", "2020-07-28T21:04:09.000Z": "Federal officers have left WA, confirmed by @DHSgov . \n\nThat means Washingtonians no longer have to worry about the White House's aim to provoke confrontation and undermine peaceful protests. Joint response to the demobilization of federal agents in Seattle Today, Seattle Mayor Jenny Durkan received confirmation that the Department of Homeland Security's Border Patrol Tactical Unit has demobilized and left the Seattle area. Last week, Gov. governor.wa.gov", "2020-07-27T17:51:13.000Z": "I've gotten to enjoy a lot of incredible conversations the last few weeks. I'm really looking forward to this next one, too-will you hop on a Zoom call with @KamalaHarris and me TODAY at 4 PM PT? Hop on Zoom with Jay and Kamala You won't want to miss this conversation. secure.actblue.com", "2020-07-26T00:54:17.000Z": "Vote-by-mail is the easiest, safest, most reliable method of voting there is, period. \n\nWe already know that here in Washington state-and in traditionally red states like Utah, too. This isn't a partisan issue.", "2020-07-25T19:36:18.000Z": "Election Day is only a few months away, and it's time to talk about what's at stake and how we win. \n\nI'm so excited to do just that with @KamalaHarris next week. I hope you'll join us. Hop on Zoom with Jay and Kamala You won't want to miss this conversation. secure.actblue.com", "2020-07-24T22:08:44.000Z": "Happy #OpeningDay , @Mariners . It's been awhile, but put me in, coach! #TrueToTheBlue  #MasksOn", "2020-07-24T04:29:02.000Z": "Now we are hearing a different story where they have a limited number of agents who are in the area on standby, if needed. I am concerned that anything could aggravate the situation, and in their rush they are not listening to @mayorjenny and Chief @carmenbest .", "2020-07-24T04:29:01.000Z": "After a day of conflicting messages from the federal government, where they told my staff repeatedly that there was no surge of additional personnel to Seattle, it appears they are doing just that.", "2020-07-24T02:13:58.000Z": "We know what works in the fight against this virus: Wash your hands Wear a mask Physically distance Three simple acts can stop Covid-19 outbreaks, study finds Coronavirus could be stopped if everyone used masks, washed their hands and stayed apart, anew study finds. cnn.com", "2020-07-24T00:09:53.000Z": "Today, Washington passed 50,000 confirmed cases of COVID-19. Across the state, our numbers are heading in the wrong direction. \n\nSo we're imposing some new restrictions to get this virus back under control. 1/4", "2020-07-24T00:32:12.000Z": "I'm extending the eviction moratorium until October 15th. \n\nThis virus hasn't gone away, and neither have the impacts on renters. \n\nThe last thing people should have to worry about is losing their home because they can't pay rent during this pandemic.", "2020-07-23T21:51:24.000Z": "Today @JayInslee takes new public safety actions to fight virus transmissions, extends moratorium on evictions #waleg Inslee tightens restrictions on bars, restaurants, weddings as Washington COVID cases rise Inslee also announced a 10 p.m. last call for drinks at restaurants and a limit on how many clients can visit a gym or fitness studio. seattletimes.com", "2020-07-23T21:45:53.000Z": "WATCH: Update on State Response to COVID-19 Governor Jay Inslee @GovInslee WATCH: Update on State Response to COVID-19 pscp.tv", "2020-07-23T16:24:10.000Z": "Release the Kraken! GIF", "2020-07-22T20:51:22.000Z": "The sign of a real leader is a willingness to listen and embrace new ideas. \n\nI'm thrilled @JoeBiden has put forth a visionary climate plan that will put millions of people to work in good-paying, union jobs. 'It's Something I've Never Seen Before' The Washington governor who set the bar for climate pledges discusses Biden's ambitious new policy and how the pandemic radicalized the nominee. nymag.com", "2020-07-22T16:25:55.000Z": "I know this: Our democracy is stronger when more people vote. \n\nThat's why we've worked hard to make registering to vote simple and easy here in Washington State. Here's how to make sure your voice is heard in the August 4 primary http:// VoteWA.gov From Washington Secretary of State", "2020-07-21T21:55:40.000Z": "People often misuse the term unconstitutional. This is not one of those times. \n\nThis is brazenly unconstitutional and a blatant effort to disenfranchise residents for President Trump's own benefit. With No Final Say, Trump Wants To Change Who Counts For Dividing Up Congress' Seats The president is calling for unauthorized immigrants to be excluded from census numbers used to divide seats in Congress. The Constitution says the count must include every person living in the U.S. npr.org", "2020-07-20T20:29:41.000Z": "Primary ballots dropped in Washington state on Friday. If you believe steady, moral leadership should always win-not hateful rhetoric and policies that exclude those who need our help the most-invest in our campaign today. Chip In To Support Jay Inslee's Reelection Early to bed, early to rise, work like hell and organize. Let's get to work building an even greater Washington together. secure.actblue.com", "2020-07-21T16:05:26.000Z": "Wearing a seatbelt isn't a political statement. Not smoking indoors isn't a political statement. And putting on a mask isn't a political statement. \n\nThis is about following the science and taking care of ourselves and our neighbors. #MaskUpWA", "2020-07-20T16:25:06.000Z": "I know it's been a long few months. I know we're all eager to get back to normal life. But this virus isn't going to just disappear-we have to beat it. #MaskUpWA Washington State Beat Back Covid-19. Now It's Rising Again. Washington was the initial epicenter of the nation's coronavirus outbreak, and an early lockdown helped contain it. Six months later, cases are spiking again, and the future looks uncertain. nytimes.com", "2020-07-20T01:26:20.000Z": "In Washington, we've proved that vote-by-mail works and works well. It's safe, reliable, and secure. \n\nEvery voter, in every state should be able to vote by mail-especially in the middle of a pandemic.", "2020-07-19T16:43:42.000Z": "Public health shouldn't be political. #MaskUpWA Quote Tweet MSNBC @MSNBC Washington Gov. Inslee: \"We can't have this partisan divide on masks. This virus doesn't know Republicans or Democrats and we know masks work for both for Republicans and Democrats.\" https:// on.msnbc.com/3hc6fgn", "2020-07-18T04:33:09.000Z": "Whenever I walked to the Capitol to vote next to John Lewis, I always felt like I was walking with justice in the flesh. I did not know MLK but I knew John Lewis, and the spirit, and the inspiration, to me were on the same exalted plane. He made us all better. Thank you John.", "2020-07-17T20:27:12.000Z": "The National Guard has been critical to Washington state's efforts to slow the spread of the virus-supporting COVID-mapping missions, assembling test kits, and operating community-based test sites. Inslee requests federal funding for National Guard through end of year to help with COVID response Guard members have been a part of Washington's pandemic response since early April. seattletimes.com", "2020-07-17T17:03:06.000Z": "\"At this critical juncture when COVID-19 is resurging, broad adoption of cloth face coverings is a civic duty.\" #MaskUpWA CDC director: We can control virus in 4 to 8 weeks if everyone in the US wears a mask CDC Director Robert Redfield told JAMA mask wearing is key because \"there is ample evidence\" that asymptomatic people are keeping the pandemic alive. businessinsider.com", "2020-07-15T17:57:00.000Z": "Tonight, I'll be joining @BetoORourke for a conversation about what's happening in Washington and Texas-and what we can all do to make our country more equitable for everyone. I hope you'll join us. Join Jay and Beto O'Rourke for a Digital Conversation about the Path Forward You won't want to miss this conversation. secure.actblue.com", "2020-07-14T23:55:51.000Z": "I'm extending the pause on our phased approach to reopening through at least July 28th.\n\nCOVID-19 is continuing to spread in Washington. Counties will pause in their current phases until it's responsible to resume reopening.", "2020-07-14T23:52:15.000Z": "From day one, our nation needed a leader to vigorously, comprehensively, and using science, attack the COVID-19 pandemic. And from day one, without exception, Donald Trump has failed us. United States running low on PPE again as COVID-19 cases soar Right now, the United States is running short on masks, gowns and gloves - again. Health-care workers are scrambling for supplies and re-using equipment as coronavirus cases surge. Here in Washington... komonews.com", "2020-07-14T21:35:06.000Z": "WATCH: Governor Inslee Media Availability Governor Jay Inslee @GovInslee WATCH: Governor Inslee Media Availability pscp.tv", "2020-07-14T20:42:01.000Z": "This climate plan is a jobs plan. @JoeBiden is meeting this moment-we need to put people back to work in good union jobs and mobilize the entire federal government to defeat the climate crisis.", "2020-07-14T18:23:03.000Z": "Trudi and I join Washingtonians in mourning the loss of one of Bothell's police officers.\n\nI send my deepest condolences to the family and friends of this public servant killed serving their community.", "2020-07-14T16:52:04.000Z": "In April, when I endorsed @JoeBiden on Earth Day, I said I was convinced beyond the shadow of a doubt that he would increase his commitment to climate action and make it a major driving force in his administration.", "2020-07-14T15:48:47.000Z": "Today at 12ET/9PT @JayInslee joins @mitchellreports  #AMR to talk Biden climate plan and COVID leadership.", "2020-07-13T18:40:23.000Z": "As Trudi has said, when you're in a big endeavor like this pandemic, every one of us can do our part. You don't have to be a rocket scientist or a neurosurgeon or a millionaire. \n\nEveryone can wear a mask.", "2020-07-13T00:05:18.000Z": "Washington state has sued to put a stop this administration's egregious policies many times before. And we're not stopping now. State to sue over Trump threat to revoke international student visas SEATTLE - The Trump administration's threat to revoke the visas of international students who attend classes remotely this fall is being challenged in a federal lawsuit by Washington state Attorney... komonews.com", "2020-07-12T18:00:50.000Z": "The decision on whether or not Washington will open schools this fall will be decided by Washington. We won't be bullied into putting our kids and educators in danger. Inslee says schools decision up to state, not Trump Washington Governor Jay Inslee will give an update on the state's COVID-19 response in a press conference on Thursday afternoon. koin.com", "2020-07-11T21:21:07.000Z": "Denial, disengagement & deceit isn't going to beat this virus. While the White House fails to step up, governors have had to step in & lead the way. If you support thoughtful, steady leadership, consider chipping in to my reelection http:// bit.ly/324AKQZ From Anderson Cooper 360°", "2020-07-10T23:42:52.000Z": "We want businesses open. We want more people to go back to work. \n\nAnd here's the good news: We know what works in the fight against #COVID19 . When we mask up, we can open up.", "2020-07-10T16:28:41.000Z": "Wearing a mask is not as controversial as you may think. In fact, a clear majority of Americans report wearing them all or most of the time. #MaskUpWA Most Americans say they regularly wore a mask in stores in the past month; fewer see others doing it 65% of U.S. adults say that they have personally worn a mask in stores or other businesses all or most of the time in the past month. pewresearch.org", "2020-07-09T23:36:32.000Z": "I want schools to reopen this fall. And we are currently on pace to make that happen.\n\nBut I will not send our kids and educators back if it is unsafe to do so. \n\nOur number one priority from the beginning has been keeping Washingtonians safe. That has not changed.", "2020-07-09T21:09:50.000Z": "There is an easy, low-cost, and near-universally available tool to help us save lives in Washington. \n\nAnd that's a mask. #MaskUpWA", "2020-07-09T19:31:05.000Z": "WATCH: I'm holding a media availability at 2:30 PM today.\n\nTune in live: https:// tvw.org/watch/?clientID=9375922947&eventID=2020071019 ", "2020-07-09T15:31:24.000Z": "\"We are all in this together. This is not an infringement of our rights as society has many mandates for the greater good-the wearing of seat belts or banning of smoking in public places, for example.\" Guest editorial: Reminder: Wearing a mask in public is mandatory Gov. Jay Inslee announced a statewide mandate requiring facial coverings in public.The key word in that sentence is \"mandate.\" Yet, many - too many - have the impression that wearing lmtribune.com", "2020-07-09T01:08:52.000Z": "This proposal includes big investments in clean energy, centers environmental justice, and includes strong standards I've pushed hard for, like 100% clean electricity by 2035. Let's get to work.", "2020-07-09T00:31:01.000Z": "Thank you to the Biden-Sanders task force for putting together a shared path forward on how to defeat the climate crisis and create millions of jobs in an economy run on clean energy.\n\nLet's unite to defeat this president and build our clean energy future. Sanders-Biden climate task force calls for carbon-free power by 2035 A unity task force made up of supporters of both Sen. thehill.com", "2020-07-08T21:09:15.000Z": "Our nation's future is on the ballot this November. \n\nListen to @AdyBarkan on why we must all unite under our shared values at this pivotal moment to make sure @JoeBiden takes the oath of office on January 20, 2021. Quote Tweet Ady Barkan @AdyBarkan . @JoeBiden is everything Trump is not. He has turned loss into purpose: the purpose of public service.\n\nAlthough he & I have different perspectives on the world, winning this election is essential.\n\nThen we can continue our struggles for justice with a compassionate president. Show this thread", "2020-07-08T18:00:39.000Z": "Let me be clear: This is a dangerous attack on essential health care and reproductive freedom. \n\nBut our fight isn't finished. If the Court won't stop the Trump administration, voters must this fall. Quote Tweet NARAL @NARAL BREAKING: #SCOTUS decided against reproductive freedom today in 𝘛𝘳𝘶𝘮𝘱 𝘷. 𝘗𝘦𝘯𝘯𝘴𝘺𝘭𝘷𝘢𝘯𝘪𝘢. They ruled that virtually any employer can deny their employees health insurance coverage of birth control just because they have personal objections. #HandsOffMyBC", "2020-07-07T16:29:31.000Z": "Mask up to open up. #MaskUpWA", "2020-07-06T23:28:03.000Z": "I can't wait for this one: On July 8, I'll be joined for some music and conversation with my friend @PaulSimonMusic . Better yet, you can be part of this special event from wherever you are. Join Jay and Paul Simon for an Evening of Music and Conversation Join Jay and Paul Simon on July 8th for an evening of uplifting beats and good conversation, all from the safety and comfort of your own home. secure.actblue.com", "2020-07-06T16:18:10.000Z": "\"Shifting guidelines may have sowed confusion among the public about the utility of masks. But health experts say the evidence is clear that masks can help prevent the spread of COVID-19 and that the more people wearing masks, the better.\" Still Confused About Masks? Here's the Science Behind How Face Masks Prevent Coronavirus We talked to UCSF epidemiologist George Rutherford, MD, and infectious disease specialist Peter Chin-Hong, MD, about the CDC's reversal on mask-wearing, the current science on how masks work, and... ucsf.edu", "2020-07-05T23:17:30.000Z": "Our work to protect reproductive freedom-here in Washington and around the country-is far from over. Quote Tweet NARAL @NARAL Monday's #SCOTUS decision protected abortion access in Louisiana-for now. But there are at least 16 anti-choice cases at appeals courts that are all intended to gut abortion access. We have to keep fighting back against these relentless attacks. https:// nyti.ms/2CZ0jbL", "2020-07-05T18:12:14.000Z": "This is not about whether you're a Republican or a Democrat. \n\nThis is about looking out for each other. \n\nMask up, Washington.", "2020-07-04T17:53:43.000Z": "From our family to yours, Trudi and I are wishing everyone across Washington a happy, festive, and safe #FourthofJuly .", "2020-07-04T00:41:36.000Z": "If you miss live music the way I do, I hope you can join me on July 8 for some uplifting beats and conversation with one of the greatest musicians of all time, @PaulSimonMusic . Join Jay and Paul Simon for an Evening of Music and Conversation Join Jay and Paul Simon on July 8th for an evening of uplifting beats and good conversation, all from the safety and comfort of your own home. secure.actblue.com", "2020-07-03T18:14:09.000Z": "We're doing everything we can to stabilize and restart our state's economy in the wake of #COVID19 . These funds are going to those who need it the most-renters, small businesses, tribes and non-profit organizations working with young people. Coronavirus updates: Inslee announces distribution of $365 million in federal funds Gov. Jay Inslee announced the state has distributed nearly $365 million in federal funds to help with COVID-19 response and relief efforts. thenewstribune.com", "2020-07-02T22:07:27.000Z": "WATCH: Governor Inslee Media Availability Governor Jay Inslee @GovInslee WATCH: Governor Inslee Media Availability pscp.tv", "2020-07-02T14:38:04.000Z": "I'll say it again: It's a shame that Donald Trump cares more about dead Confederates than living Americans.", "2020-07-01T16:07:40.000Z": "I am honored to have the support of the Human Rights Campaign-and I remain committed to ensuring equality for the LGBTQ+ community and for all. Quote Tweet Human Rights Campaign @HRC From giving LGBTQ people a voice in government, to legislation banning anti-LGBTQ policies, Gov. @JayInslee has one of the strongest pro-equality records of any governor in America. We're proud to endorse him for reelection. https:// hrc.org/blog/hrc-endor ses-governor-jay-inslee-for-reelection ", "2020-06-30T23:34:42.000Z": "We're distributing $365 million in federal COVID-19 aid to support: low-income renters small businesses nonprofits tribal recovery efforts child care support contact tracing testing food assistance and more Inslee announces funding for rent assistance, tribal recovery Gov. Jay Inslee today announced the state has distributed nearly $365 million in federal funds to help with COVID-19 response and relief efforts across Washington. governor.wa.gov", "2020-06-30T17:12:48.000Z": "I'm grateful to see a bold and detailed plan like this from the House Select Committee on the @ClimateCrisis .\n \nIt is an important step toward the strong federal leadership we desperately need on #climate change. House Democrats just put out the most detailed climate plan in US political history A new select committee report is perfectly in tune with the growing climate policy alignment on the left around standards, investments, and justice. vox.com", "2020-06-30T19:12:40.000Z": "I'm excited to talk to my friend-and co-author of the #GreenNewDeal -Sen. @EdMarkey TONIGHT about how we can defeat the climate crisis and move our country forward with clean energy. Just two climate guys talking shop. Join us. Join Ed Markey and Jay Inslee for a Climate Conversation Tonight Hear from two of the original climate champions-join this virtual event with Governor Jay Inslee and Senator Ed Markey secure.actblue.com", "2020-06-30T16:17:02.000Z": "LGBTQ+ rights are human rights. Pass it on.", "2020-06-29T22:19:41.000Z": "I've been dedicating all my time and energy to working for the people of Washington and fighting COVID-19. I didn't fundraise or campaign between December and mid-June. \n\nBut I'm still up for election this November. If you can, chip in today. Donate to Governor Jay Inslee Every day Jay has been governor, he has focused his efforts on improving the lives of Washingtonians. secure.actblue.com", "2020-06-29T17:54:25.000Z": "In Washington state, reproductive freedom is a fundamental right. No one, no matter what state they call home, should be denied access to a safe, legal abortion. \n\nToday's #SCOTUS ruling is a huge victory-but this fight is far from over. Quote Tweet ilyseh @ilyseh BREAKING: #SCOTUS upholds abortion access in Louisiana!\n\nThis is great news, but the battle continues, folks. As long as Kavanaugh is on the bench, our rights are on the line-and we need your help to flip the Senate.\n\nDonate here to join the fight: https:// naral.us/scotus2020 Show this thread", "2020-06-28T23:44:52.000Z": "Masks are about showing respect and care for our fellow Washingtonians. We have to beat this virus to save lives and help businesses reopen. #MaskUpWA", "2020-06-28T18:27:02.000Z": "#Pride began as a protest in June 1969-and in June 2020, the fight continues. \n\nOn the 51st anniversary of the #Stonewall Riots, I promise you this: As long as I'm governor, Washington will always defend the rights of the LGBTQ+ community.", "2020-06-28T15:07:03.000Z": "#MASKUP : @GovInslee to @jdickerson \"100 percent masking means 100 percent opening up and all of us should be on that bandwagon\"", "2020-06-27T23:22:10.000Z": "The Trump administration continues to target LGBTQ+ Americans and their health care, housing, and employment rights. But no matter what happens in the other Washington, we'll always protect LGBTQ+ rights in our state. Inslee, Kreidler call out Trump administration for targeting transgender patients during Pride... Submitted by the Washington State Officer of the Insurance Commissioner sanjuanjournal.com", "2020-06-27T17:53:00.000Z": "There's no doubt: Our democracy is stronger when more people participate. Washington state has proven that vote-by-mail is dependable, secure, and empowers more people to vote. Washington has proved vote-by-mail improves democracy Republicans have forced Americans to choose between their health and their vote. Our state knows there's a better way. crosscut.com", "2020-06-26T22:42:25.000Z": "I wish President Trump cared as much about living Americans as he does about dead Confederates. Quote Tweet CNN Politics @CNNPolitics Washington Gov. Jay Inslee slams President Trump for his \"failure of leadership\" as coronavirus cases spike across the US: \"To have the President of the United States effectively tell people in my state that effectively they shouldn't wear masks ... this is infuriating\"", "2020-06-26T21:29:37.000Z": "Five years ago, we took a big step in America's long road to justice for all. The Supreme Court ruled on what we already knew to be true-each and every one of us deserves to marry the one we love. #LoveIsLove", "2020-06-26T18:21:02.000Z": "Health care is a human right. While Trump tries to gut the ACA, Washington is committed to not only protecting access to affordable health care-we're expanding it.", "2020-06-26T18:20:23.000Z": "In the middle of a deadly pandemic. Cruel and shameless. Trump administration asks Supreme Court to strike down Obamacare House Speaker Nancy Pelosi (D-Calif.) denounced the move as \"an act of unfathomable cruelty\" during the pandemic. washingtonpost.com", "2020-06-26T16:41:03.000Z": "Quick history lesson for @POTUS : Voting by mail has worked, in one way or another, for more than 150 years. How do you know voting by mail works? The U.S. military's done it since the Civil War. Advocates and lawmakers believe it could be a model for November because of coronavirus. nbcnews.com", "2020-06-25T23:32:25.000Z": "Couldn't agree more. Thanks, General Mattis. #MaskUpWA Quote Tweet WA Emergency Management @waEMD Our big thanks to fellow Washingtonian, former Defense Secretary Gen. (Ret) James Mattis for joining our efforts to slow the spread of #COVID19 . Gen Mattis knows now is not the time to let down our guard - maintain distance and #MaskupWA . Show this thread", "2020-06-25T21:26:10.000Z": "DC should be a state. Pass it on. Quote Tweet Ed Markey @EdMarkey DC should be a state. Pass it on. twitter.com/ewarren/status", "2020-06-25T16:04:03.000Z": "This chemical is known to damage brain development in children. And the Trump administration is inexplicably okay with it being in the water they drink. Trump administration will not regulate rocket fuel chemical in drinking water EPA claims federal government, states and public water systems have already taken steps to reduce perchlorate levels theguardian.com", "2020-06-25T14:21:27.000Z": "From giving LGBTQ people a voice in government, to legislation banning anti-LGBTQ policies, Gov. @JayInslee has one of the strongest pro-equality records of any governor in America. We're proud to endorse him for reelection. HRC Endorses Gov. Jay Inslee for Reelection As Governor, Jay Inslee has been a champion for the LGBTQ community. Inslee and the legislature created Washington's first LGBTQ Commission appointing members of the community from across the state... hrc.org", "2020-06-24T22:03:05.000Z": "LIVE: Governor Inslee COVID-19 Press Conference Governor Jay Inslee @GovInslee LIVE: Governor Inslee COVID-19 Press Conference pscp.tv", "2020-06-24T21:27:26.000Z": "It's simple: Masks are one of the easiest and most powerful ways we can save lives-and reopen our communities faster. #WearAMaskWA Just put on a damn mask already, America. The science is clear. Public-health officials have had difficulty enforcing mask requirements since the policy has become politically charged. businessinsider.com", "2020-06-24T21:25:07.000Z": "WATCH: I'm giving an update on our state's response to COVID-19 at 3:00 PM. \n\nTune in live: https:// tvw.org/watch/?clientID=9375922947&eventID=2020061170 ", "2020-06-24T16:21:27.000Z": "Asking people to vote in person during a deadly pandemic is voter suppression. Vote by mail is the right of every Washingtonian, and it should be the right of every American.", "2020-06-23T22:43:23.000Z": "If nurses and doctors can put their lives on the line, we can put a mask on. #WearAMaskWA", "2020-06-23T22:10:44.000Z": "WATCH : Governor Inslee Press Availability Governor Jay Inslee @GovInslee WATCH : Governor Inslee Press Availability pscp.tv", "2020-06-23T20:10:06.000Z": "WATCH: I'm giving an update on our state's response to COVID-19 at 3 PM. \n\nTune in here: https:// tvw.org/watch/?clientID=9375922947&eventID=2020061162 ", "2020-06-23T17:16:32.000Z": "Easy, safe, and reliable. There is no reason not to make mail-in voting a reality nationwide-especially during a pandemic. From ABC News", "2020-06-23T16:09:25.000Z": "Slowing down testing means more Americans will die. That is what matters. Quote Tweet Donald J. Trump @realDonaldTrump Cases are going up in the U.S. because we are testing far more than any other country, and ever expanding. With smaller testing we would show fewer cases!", "2020-06-22T23:48:28.000Z": "Our fight against COVID-19, our fight to end systemic racism, and our fight to defeat climate change are linked in so many ways. We're working for a better and more equitable world. And that's always worth the fight. (via @Grist ) https:// bit.ly/2NrJ2cR", "2020-06-22T22:32:53.000Z": "We are going to take a hard look at how we manage independent investigations of police use of force in WA. \n\nOur new task force will recommend actions we can take to create a more just WA. It includes community leaders, impacted family members and law enforcement representatives.", "2020-06-22T20:03:04.000Z": "Let's be clear: Trump himself has voted by mail many times. He's not on a crusade against fraud. He's terrified to his core that if more people vote, America will make him a one-term president. Quote Tweet Donald J. Trump @realDonaldTrump RIGGED 2020 ELECTION: MILLIONS OF MAIL-IN BALLOTS WILL BE PRINTED BY FOREIGN COUNTRIES, AND OTHERS. IT WILL BE THE SCANDAL OF OUR TIMES!", "2020-06-21T19:39:27.000Z": "Proud of the men all three of these boys have become. Happy #FathersDay , Washington!", "2020-06-20T15:56:44.000Z": "I promise you this: No matter what happens in Washington, DC, Washington state will always be a place of refuge and opportunity for the people who need it most. Refugees make our state and our nation stronger #WorldRefugeeDay", "2020-06-19T17:01:21.000Z": "#Juneteenth is a powerful reminder: Systemic racism didn't end with slavery. Black lives matter, and it's up to all of us to create a country that finally fulfills the promise of equality and justice for all.", "2020-06-18T15:36:10.000Z": "#DACA is here to stay. Dreamers are here to stay-at home, in the United States, where they belong. Supreme Court blocks Trump from ending DACA in big win for Dreamers Chief Justice John Roberts was the swing vote in the 5-4 decision, dealing a big legal defeat to President Trump on the issue of immigration. nbcnews.com", "2020-06-17T21:40:51.000Z": "Governor Inslee Press Availability Governor Jay Inslee @GovInslee Governor Inslee Press Availability pscp.tv", "2020-06-16T01:32:13.000Z": "I'm focused on fighting COVID-19 and against systemic racism. It's too bad the president isn't focused on either.", "2020-06-15T18:55:28.000Z": "No one should be fired for who they are. We already knew that to be morally right; now it is law nationwide, just as it's been here in Washington since 2006. #SCOTUS Supreme Court says federal law protects LGBTQ workers from discrimination Federal civil rights law protects gay, lesbian and transgender workers, the Supreme Court ruled Monday. cnn.com", "2020-06-12T18:12:26.000Z": "Interracial marriage bans ended 53 years ago. And it was only because Mildred and Richard Loving, and thousands of others, had the courage to fight against racial injustice.\n\nThat fight lives on in those demanding justice for Black lives today. #LovingDay What is Loving Day? June 12 marks landmark Supreme Court decision for interracial marriage Loving Day commemorates the anniversary of the Supreme Court striking down state bans on interracial marriage on June 12, 1967. usatoday.com", "2020-06-11T21:35:43.000Z": "Every time Trump tweets, I'm more energized than ever to vote him out this November. \n\nHelp put @JoeBiden -a real leader-in the White House and re-elect me as Washington's governor: https:// bit.ly/JoeAndJay Quote Tweet Donald J. Trump @realDonaldTrump Sleepy Joe Biden refuses to leave his basement \"sanctuary\" and tell his Radical Left BOSSES that they are heading in the wrong direction. Tell them to get out of Seattle now. Liberal Governor @JayInslee is looking \"the fool\". LAW & ORDER!", "2020-06-11T04:51:31.000Z": "A man who is totally incapable of governing should stay out of Washington state's business. \"Stoop\" tweeting. https:// twitter.com/realDonaldTrum p/status/1270914092295950337  This Tweet is unavailable.", "null": "", "2020-06-11T01:37:14.000Z": "What happened in Georgia yesterday is not what democracy looks like. \n\nEvery American in every state should be able to vote by mail. We've made it a reality in Washington and it's time to make it a reality across the nation.", "2020-06-10T22:04:47.000Z": "WATCH: Governor Inslee Press Availability Governor Jay Inslee @GovInslee WATCH: Governor Inslee Press Availability pscp.tv", "2020-06-10T19:18:33.000Z": "I have become convinced the Pierce County Sheriff should not complete the investigation of the death of Manuel Ellis. \n\nThere will be a new investigation and charging decision made independent of Pierce County law enforcement. 1/5 Inslee announces new investigation into death of Manuel Ellis \"I have become convinced that the Pierce County Sheriff should not complete the investigation of the death of Manuel Ellis and the county prosecutor should not review the investigation and make governor.wa.gov", "2020-06-09T23:17:41.000Z": "Quote Tweet Governor Jay Inslee @GovInslee We cannot undo systemic racism overnight. But we can and must do more to ensure just, humane treatment by police.\n\nA start: independent misconduct investigations/prosecutions restricting chokeholds and other use of force holding officers accountable for one another Show this thread", "2020-06-09T23:17:40.000Z": "Washingtonians around the state are calling, loud and clear, for justice and an end to systemic racism. \n\nThis is a moment unlike anything we've seen. It's a moment to do things differently, to do them better, and to do them with a real commitment to change.", "2020-06-09T20:33:09.000Z": "As George Floyd is laid to rest in Houston today, we cannot rest until justice is delivered and we create lasting change as Americans and Washingtonians. Because #BlackLivesMatter .", "2020-06-08T22:12:00.000Z": "WATCH: Governor Inslee Press Availability Governor Jay Inslee @GovInslee WATCH: Governor Inslee Press Availability pscp.tv", "2020-06-04T00:21:26.000Z": "Watch my full interview with @Crosscut here: https:// crosscut.com/2020/06/inslee -confident-trumps-military-threat-all-bluster  Quote Tweet Jay Inslee @JayInslee In Washington state and across the country, people are expressing pain and anger from generations of systemic racism.\n\nThe murders of George Floyd in Minnesota, Ahmaud Arbery in Georgia, and countless others are horrific. Their lives mattered. Black lives matter. Show this thread", "2020-06-03T22:58:54.000Z": "One of the ways to show your commitment is supporting @NAACP_LDF . \n\nDonations fund the fight toward winning landmark legal battles, protecting Black voters across the nation, and advancing the cause of racial justice, equality, and an inclusive society: https:// bit.ly/3cvoGtx", "2020-06-03T22:56:36.000Z": "When President Trump had law enforcement use tear gas on peaceful protestors for a photo op, that was one of the most outrageous abuses of public office that I've seen in my entire life. \n\nHe has repeatedly proven he is incapable of governing.", "2020-06-03T22:56:35.000Z": "In Washington state and across the country, people are expressing pain and anger from generations of systemic racism.\n\nThe murders of George Floyd in Minnesota, Ahmaud Arbery in Georgia, and countless others are horrific. Their lives mattered. Black lives matter.", "2020-06-03T21:34:09.000Z": "WATCH: Governor Inslee Press Availability Governor Jay Inslee @GovInslee WATCH: Governor Inslee Press Availability pscp.tv", "2020-06-02T01:44:20.000Z": "This president has repeatedly proven he is incapable of governing. He has shown nothing but false bravado throughout the chaos that has accompanied his time in office. \n\nMy full statement: https:// bit.ly/TrumpMil", "2020-05-29T21:42:24.000Z": "WATCH: Update on Washington's Stay Home, Stay Healthy Order Governor Jay Inslee @GovInslee WATCH: Update on Washington's Stay Home, Stay Healthy Order pscp.tv", "2020-05-29T19:44:22.000Z": "WATCH: Today I'll be giving an update on my Stay Home, Stay Healthy order. \n\nTune in here at 2:30 PM: https:// tvw.org/watch/?clientID=9375922947&eventID=2020051096 ", "2020-05-28T20:22:12.000Z": "WATCH: Today, I'm giving an update on our long term care facility testing plan as well as additional protections for our farm workers. \n\nTune in at 2:30 PM: https:// tvw.org/watch/?eventID =2020051095 ", "2020-05-27T21:34:36.000Z": "WATCH: Update on State Response to COVID-19 Governor Jay Inslee @GovInslee WATCH: Update on State Response to COVID-19 pscp.tv", "2020-05-27T18:07:12.000Z": "WATCH: I'm giving an update on our COVID-19 response at 2:30 PM. \n\nTune in live here: https:// tvw.org/watch/?eventID =2020051089 ", "2020-05-26T19:22:50.000Z": "7 more counties advanced to Phase 2 over the weekend: Cowlitz Grant Island Jefferson Mason Pacific San Juan\n\n2 more are now eligible: Klickitat Walla Walla\n\nThanks for everyone's hard work to keep cases down. #WeGotThisWA", "2020-05-25T17:39:15.000Z": "On #MemorialDay , I am remembering all those brave souls who gave their lives to defend our nation. It's a debt we can never repay. May we honor their memories by living up to the values they fought to defend.", "2020-05-24T01:00:10.000Z": "#EidMubarak ! As the holy month of Ramadan ends, Trudi and I want to wish Muslim families across Washington a happy, joyous, and blessed Eid al-Fitr.", "2020-05-21T16:40:56.000Z": "Happy birthday, Trudi! I'm so lucky to be in tandem with you.", "2020-05-21T01:24:02.000Z": "Case and contact tracing is how we can reopen slowly and contain COVID-19. It is: confidential voluntary", "2020-05-20T16:11:56.000Z": "When we invest in education, we invest in a better future for all of us. \n\nTomorrow marks one year since we created the best financial aid program in the country-making sure more than 110,000 Washingtonians have access to free or low-cost tuition. Inslee signs package of education bills, ushers in one of the most progressive education Gov. Jay Inslee signed a major education bill Tuesday that establishes one of the most progressive higher education investments in the medium.com", "2020-05-19T16:41:11.000Z": "WATCH: Today I'm talking about expanding county variances and the Working WA Small Business Grant program with @WADeptHealth Secretary John Wiesman, @WAComDirector Lisa Brown and business owner Rob Owens. \n\nTune in at 11 AM: https:// tvw.org/watch/?eventID =2020051073 ", "2020-05-19T00:16:39.000Z": "Today, all health services can restart in WA. \n\nAs long as they operate within new safety guidelines, non-essential medical procedures, including dental visits, can resume. #WeGotThisWA Inslee announces restart of all medical services in Washington Inslee provides guidance for medical and dental procedures medium.com", "2020-05-16T18:13:08.000Z": "#ArmedForcesDay is a day for all of us to express our gratitude for those who serve and to honor their sacrifices. From Trudi and me both: Thank you for all you do.", "2020-05-14T22:35:27.000Z": "WATCH: Update on State Response to COVID-19 Governor Jay Inslee @GovInslee WATCH: Update on State Response to COVID-19 pscp.tv", "2020-05-14T18:32:22.000Z": "Trudi's mom, Gertrude Tindall, turns 103 today! Here we are on Mother's Day last year. \n\nOur family is looking forward to celebrating her birthday in person as soon as we can, but today we'll have an online celebration instead. Trudi and I love you, Lulu!", "2020-05-14T15:27:54.000Z": "We should listen to scientists. Quote Tweet WA Emergency Management @waEMD 40 years ago today, people pushed the state to reopen areas around Mt. St. Helens citing tourism & the economy against advice of scientists. Five days later, the volcano erupted. #msh40 twitter.com/USGSVolcanoes/ Show this thread", "2020-05-13T23:59:53.000Z": "We cannot lose sight of the climate emergency around us. Together, we must do everything we can to address this existential threat. Join our virtual town hall @VarshPrakash , @billmckibben , @JayInslee , and @dwallacewells live now: Bernie Sanders @BernieSanders SAVING OUR PLANET FROM THE EXISTENTIAL THREAT OF CLIMATE CHANGE (LIVE AT 8PM ET)", "2020-05-13T21:04:47.000Z": "Tonight: watch our live town hall featuring special guests on the existential threat of climate change and what we can do to save our planet. Tune in at 8 p.m. ET at http:// live.berniesanders.com .", "2020-05-13T01:44:45.000Z": "Until a treatment or vaccine is developed, contact tracing is the fastest and safest path to recovery.\n\nHere's what it will look like in Washington Inslee announces contact tracing initiative Confidential efforts will help businesses open and stop spread of the virus. medium.com", "2020-05-12T20:34:46.000Z": "WATCH: Update on State Response to COVID-19 Governor Jay Inslee @GovInslee WATCH: Update on State Response to COVID-19 pscp.tv", "2020-05-12T18:47:00.000Z": "WATCH: I'm giving an update on our COVID-19 response at 1:30 PM. \n\nTune in live here: https:// tvw.org/watch/?clientID=9375922947&eventID=2020051043 ", "2020-05-10T18:20:00.000Z": "Today, I'm thinking back on warm memories of my mom, Adele. And I'm feeling grateful to have many other wonderful mothers in my life - including Trudi, the best mom to our three boys, and her mother, Gertrude Tindall. \n\nHappy #MothersDay , Washington!", "2020-05-08T21:36:56.000Z": "WATCH: Update on State Response to COVID-19 Governor Jay Inslee @GovInslee WATCH: Update on State Response to COVID-19 pscp.tv", "2020-05-07T22:18:01.000Z": "To the teachers in Washington state and the teachers across the country: Thank you. One million times, thank you. #TeacherAppreciationWeek Teachers like Marissa and Analisa This Teacher Appreciation Week, I'm saying thank you. medium.com", "2020-05-07T16:46:02.000Z": "We have updated our Risk-Assessment Dashboard. \n\nThis week, we saw progress in: Testing Capacity and Availability Case and Contact Investigations Risk to Vulnerable Populations\n\nSee why some dials moved while others did not: https:// bit.ly/5_6_Dials  #WeGotThisWA", "2020-05-06T19:48:28.000Z": "Nurses care for us in our hardest and sometimes happiest moments. Here in Washington, we're grateful for their steady commitment and compassion - on #NationalNursesDay and every day. And we can honor their work by continuing to #StayHomeStayHealthy .", "2020-05-05T18:52:20.000Z": "WATCH: I'm giving an update on our COVID-19 response at 3:30 PM. \n\nTun in live here: https:// tvw.org/watch/?eventID =2020051017 ", "2020-05-04T20:19:47.000Z": "COVID-19 brought unprecedented challenges to our state. So far, Washingtonians have stepped up.\n\nThere are more challenges ahead. But tomorrow, we enter Phase 1 of Safe Start, our phased approach to re-opening Washington's economy: https:// bit.ly/SafeStartWA  #WeGotThisWA", "2020-05-01T22:01:43.000Z": "TVW @TVWnews TVWnews was LIVE pscp.tv", "2020-05-01T17:37:41.000Z": "WATCH: I'm giving an update on our COVID-19 response at 2:30 PM. I'll be joined by @WADeptHealth Secretary John Wiesman and Vice Admiral Dr. Raquel Bono.\n\nTune in here: https:// tvw.org/watch/?eventID =2020051012 ", "2020-05-01T17:15:35.000Z": "All across Washington, we're seeing folks come together and support each other. I want to share some of the incredible work Washingtonians are doing right now.\n\nLet me know: Who's stepping up in your community? #WeGotThisWA Who is stepping up in your community? I want to share some of the incredible work Washingtonians are doing right now. medium.com", "2020-04-29T21:48:42.000Z": "WATCH: Update on State Response to COVID-19 Governor Jay Inslee @GovInslee WATCH: Update on State Response to COVID-19 pscp.tv", "2020-04-29T00:05:24.000Z": "#WorkersMemorialDay is especially important this year as we remember those who have perished from COVID-19. \n\nIn honor of those who have died, we must redouble our efforts to fight for all workers-including the right to organize, a safe workplace, and fair pay.", "2020-04-27T21:36:38.000Z": "WATCH: Update on State Response to COVID-19 Governor Jay Inslee @GovInslee WATCH: Update on State Response to COVID-19 pscp.tv", "2020-04-27T17:26:38.000Z": "WATCH: I'm giving an update on our COVID-19 response today at 2:30 PM.\n \nI'll be joined by Public Lands Commissioner @Hilary_FranzCPL , @WDFW Director Kelly Susewind and @WAStatePks Commission Director Don Hoch.\n \nTune in here: https:// tvw.org/watch/?eventID =2020041080 ", "2020-04-24T20:00:51.000Z": "Washington: thank you for staying home and staying healthy. It's working. \n\nWhile we have a long way to go, we're taking the first small step toward recovery today. 1/4 #WeGotThisWA", "2020-04-22T21:41:00.000Z": "WATCH: Update on State Response to COVID-19 Governor Jay Inslee @GovInslee WATCH: Update on State Response to COVID-19 pscp.tv", "2020-04-22T18:25:03.000Z": "WATCH: I'm giving an update on our COVID-19 response at 2:30 PM.\n \nTune in here: https:// tvw.org/watch/?eventID =2020041073 ", "2020-04-22T18:56:31.000Z": "On #EarthDay50 , our commitment to defeat the climate crisis has never been more important. We must embrace a 100% clean energy future. #voicescarry2020", "2020-04-22T16:58:37.000Z": "Early to bed, early to rise, work like hell and organize. Let's go get 'em, @JoeBiden . \n\nMy full statement: (3/3)", "2020-04-22T16:58:36.000Z": "Today, I am proud to endorse @JoeBiden for President of the United States. He'll be a president who believes in science, responds to facts, and understands the responsibility of the office he will soon hold. (1/3) #EarthDay50 Jay Inslee Endorses Biden, Citing Private Conversations on Climate Policy The governor of Washington State, one of the Democratic Party's most prominent environmentalists, urged progressives to get on board with the presumptive presidential nominee's campaign. nytimes.com", "2020-04-22T00:15:23.000Z": "One month ago, WA faced an unmitigated public health and economic disaster. Washingtonians have answered the call to slow the spread. \n\nThough we have a long way to go, we can now plan how to recover from this crisis. Here's the outline of WA's Recovery Plan. 1/8", "2020-04-21T23:59:36.000Z": "Live Address: Washington's COVID-19 Recovery Plan Governor Jay Inslee @GovInslee Live Address: Washington's COVID-19 Recovery Plan pscp.tv", "2020-04-21T19:32:41.000Z": "This fight is far from over. But tonight, I will lay out WA's plan for recovery.\n\nTune in at 5:00 PM: https:// tvw.org/watch/?clientID=9375922947&eventID=2020041065 ", "2020-04-18T17:46:17.000Z": "And we're stronger because of it. Washington State Now Has the Most Diverse Supreme Court In History The court represents a vision of what the federal judiciary could look like under a Democratic president. slate.com", "2020-04-18T22:32:27.000Z": "Donald Trump's tweets yesterday were dangerous and unhinged - putting American lives at risk. From CNN Politics", "2020-04-17T19:46:55.000Z": "The president's statements this morning encourage illegal and dangerous acts. He is putting millions of people in danger of contracting COVID-19. \n\nHis unhinged rantings and calls for people to \"liberate\" states could also lead to violence. We've seen it before. 1/7", "2020-04-16T22:34:50.000Z": "WATCH: Update on State Response to COVID-19 Governor Jay Inslee @GovInslee WATCH: Update on State Response to COVID-19 pscp.tv", "2020-04-16T21:27:12.000Z": "WATCH: I'm giving an update on our COVID-19 response at 3:30 PM today. I'll be joined by @ESDCommish Suzi LeVine.\n\nWatch live here: https:// tvw.org/watch/?eventID =2020041055 ", "2020-04-15T22:04:47.000Z": "WATCH: Update on State Response to COVID-19 Governor Jay Inslee @GovInslee WATCH: Update on State Response to COVID-19 pscp.tv", "2020-04-15T20:46:36.000Z": "WATCH: I'm giving an update on our COVID-19 response at 3:00 PM. \n\nTun in here: https:// tvw.org/watch/?clientID=9375922947&eventID=2020041048 ", "2020-04-14T19:56:06.000Z": "These are challenging times. But I have never been more proud to be a Washingtonian. #WeGotThisWA", "2020-04-13T22:20:12.000Z": "It is an honor to announce the appointment of Judge G. Helen Whitener to the Washington State Supreme Court. Inslee appoints Judge G. Helen Whitener to the Washington State Supreme Court Gov. Jay Inslee today announced the appointment of Judge G. Helen Whitener to the Washington State Supreme Court. She replaces Justice medium.com", "2020-04-13T21:35:16.000Z": "Gov. Inslee appoints new State Supreme Court Justice Governor Jay Inslee @GovInslee Gov. Inslee appoints new State Supreme Court Justice pscp.tv", "2020-04-13T19:11:09.000Z": "The West Coast is ahead of the curve on COVID-19. We're going to make sure that stays true.\n\nWA, OR and CA will work together on a shared approach for reopening our economies. #WeGotThisWA", "2020-04-12T16:33:13.000Z": "This is a challenging time. But this Easter Sunday, I take incredible hope from the way Washingtonians are looking out for one another. \n\nMay you all find hope and connection today. Happy Easter.", "2020-04-10T16:49:28.000Z": "In Washington state, we know that voting by mail is the best way to ensure everyone has a safe, secure way to vote. It should be the right of every American across this country", "2020-04-09T18:40:34.000Z": "Washington, you have responded to the call to stay home. That means we should have more good news to share. But know this:\n\nIf we relax now, we risk undoing all the progress we've made together.\n\nNow more than ever - Stay home. Stay healthy. #WeGotThisWA", "2020-04-09T01:21:29.000Z": "This Passover may be different than years past, but Trudi and I hope all those celebrating are having a safe and joyous holiday. Chag Pesach samech!", "2020-04-08T21:06:55.000Z": "Today we're returning the field hospital stationed at Century Link to @FEMA so it can be redeployed to a state with a more significant need.\n\nI'm proud that our diligence has saved lives across the state, and am even more proud that we can now help save lives across the country.", "2020-04-08T20:29:29.000Z": "And to journalists in Washington and around the country: Thank you for the critical work you're doing to keep us informed, especially during these challenging times.", "2020-04-08T20:29:08.000Z": "#COVID19 is impacting businesses across our state, including local newspapers. But the work of journalists bringing us timely, accurate information is more important than ever. \n\nIf you can, please consider becoming a subscriber to your hometown paper or supporting local radio.", "2020-04-07T20:24:06.000Z": "I'm proud of our efforts to combat COVID-19 in Washington. \n\nToday, I want to update you on our economic plan and programs to support our small businesses. 1/7 #WeGotThisWA", "2020-04-07T20:02:51.000Z": "WATCH: COVID-19 Update Governor Jay Inslee @GovInslee WATCH: COVID-19 Update pscp.tv", "2020-04-07T15:59:24.000Z": "We're launching WA Food Fund to ensure every Washingtonian can put food on the table during this crisis.\n\nNo one should go hungry in our state. \n\nLearn more  https:// bit.ly/FoodFundLaunch Donate  https:// bit.ly/WAFoodFund  #WeGotThisWA", "2020-04-06T21:46:03.000Z": "A little over 3 weeks ago, @waOSPI Superintendent Chris Reykdal and I closed schools across the state to keep our students, educators and their families, safe.\n\nToday, I'm making the hard decision to extend the closure order through the end of the school year. 1/5", "2020-04-06T21:37:13.000Z": "WATCH: Update on COVID-19 plan for K-12 schools. Governor Jay Inslee @GovInslee WATCH: Update on COVID-19 plan for K-12 schools. pscp.tv", "2020-04-06T21:11:51.000Z": "WATCH: I'm addressing our plan for K-12 schools today at 2:30 PM with @waOSPI Superintendent Chris Reykdal.  \n\nLive here: https:// player.invintus.com/?clientID=9375 922947&eventID=2020041020 ", "2020-04-05T18:47:27.000Z": "Every state in America is united in the fight to save the lives of our people. Though our mission is the same, our needs are different.\n\nToday, Washington is returning 400 ventilators so states like New York and others can have them. #WeGotThisWA  #StayHomeStayHealthy", "2020-04-03T02:22:22.000Z": "WATCH: I'm joining @donlemon on @CNN to talk COVID-19. Tune in.", "2020-04-03T00:13:01.000Z": "Washingtonians: thank you for staying home. I'm proud of our efforts as a state. \n\nBut we have an obligation to ourselves and our loved ones to recognize the hard road ahead\n\nSo tonight I'm extending the \"Stay Home, Stay Healthy\" order for one month. 1/7", "2020-04-02T19:11:11.000Z": "Q: I know you guys are working hard to get help to us fast! But I had to close the doors to my barbershop. I'm a single income household. I have 4 kids. What should I do to get help now? #AskGovInslee - @jaimethebarber A:", "2020-04-02T02:10:56.000Z": "We are asking health care workers and first responders to save the lives of COVID-19 patients. The least we can do is make sure they have PPE to stay safe.\n\nWA businesses are stepping up to produce them.\n\nBut we need a national effort. We need the Defense Production Act. @maddow Quote Tweet Maddow Blog @MaddowBlog Inslee: \"We are so desperate for PPEs. We are desperate for test kits. We are sending nurses in who don't have what the need for PPEs and we need to have a national mobilization of the manufacturing base of the US as we had in WWII so we can get these nurses what they deserve...\"", "2020-04-01T21:11:58.000Z": "I'm giving an update on our COVID-19 response in WA. Governor Jay Inslee @GovInslee I'm giving an update on our COVID-19 response in WA. pscp.tv", "2020-04-01T20:23:20.000Z": "I'm giving an update on our COVID-19 response today at 2 pm.\n\nWatch here: https:// player.invintus.com/?clientID=9375 922947&eventID=2020041009 ", "2020-04-01T16:21:54.000Z": "Washington: I need 10 minutes of your time. \n\nThe Census helps WA get the national resources and representation we need. Today, those needs are crystal clear.\n\nHelp our state. Be Counted.  http:// 2020census.gov  844-330-2020 #CensusDay2020", "2020-03-30T23:05:53.000Z": "We're seeing signs our measures are starting to slow the spread in the Puget Sound region. I'm grateful to Washingtonians for stepping up.\n\nBut we know some individuals and businesses are not complying. Today, we're laying out how we will handle violators. UW model says social distancing is starting to work - but still projects 1,400 coronavirus deaths... Modeling from the UW's Institute for Health Metrics and Evaluation (IHME) forecasts that hospitalizations will generally peak in mid-April, with 64,000 more patients than licensed beds nationwide. seattletimes.com", "2020-03-30T21:04:46.000Z": "WATCH: I'm giving an update on our COVID-19 response with @AGOWA and police chiefs. \n\nLive here: https:// player.invintus.com/?clientID=9375 922947&eventID=2020031192 ", "2020-03-29T15:59:08.000Z": "We need to make decisions based on science and reality, and there are some hard realities we have to understand. \n\nUnless we continue a vigorous social distancing program, this is going to continue spreading like wildfire. @jaketapper  @CNNSotu Quote Tweet CNN @CNN Responding to ideas floated by the Trump administration to loosen social distancing guidelines, Washington Gov. Jay Inslee says \"we need to make decisions based on science and reality.\"\n\n\"Boy, I would not want to be responsible for opening the door to this virus\" #CNNSOTU", "2020-03-28T20:54:09.000Z": "The field hospital at Century Link will address non COVID-19 medical needs to free up our health delivery system to deal with this virus. \n\nThanks to partners at the federal, state and local levels for making this happen.", "2020-03-28T00:00:56.000Z": "I'm not going to let personal attacks from the president distract me from what matters: beating this virus and keeping Washingtonians healthy.", "2020-03-27T03:36:19.000Z": "We need a national mobilization of the industrial base in this country. That's how we won WWII. \n\nTo get that, we need a president to lead. \n\nWashingtonians' lives depend on it. Trump: I Don't Think Governors 'Need' the Medical Equipment They're Begging For \"I have a feeling that a lot of the numbers that are being said in some areas are just bigger than they are going to be. I don't believe you need 40,000 or 30,000 ventilators.\" thedailybeast.com", "2020-03-26T18:06:03.000Z": "Governor Jay Inslee @GovInslee GovInslee was LIVE pscp.tv", "2020-03-24T23:58:25.000Z": "Stay Home. Stay Healthy. Save Lives.\n\nMy proclamation: https:// bit.ly/StayHomeStayHe althyProc ", "2020-03-24T16:46:28.000Z": "Last night, I issued a Stay Home Order in WA. \n\nThe more people stay home, the quicker we can return to the many things we love about life in Washington. #WeGotThisWA Learn more: https:// medium.com/wagovernor/ins lee-announces-stay-home-stay-healthy-order-4891a7511f5e ", "2020-03-24T01:50:40.000Z": "Stay Home. Stay Healthy. #WeGotThisWA Inslee announces \"Stay Home, Stay Healthy\" order Tonight, Gov. Jay Inslee spoke directly to Washingtonians to announce he will sign a statewide order that requires everyone in the state medium.com", "2020-03-24T00:33:46.000Z": "To protect Washingtonians from COVID-19, I am issuing a 'Stay Home, Stay Healthy' order.  \n\nHere is what it means for you and your family.", "2020-03-24T00:31:15.000Z": "Governor Jay Inslee @GovInslee GovInslee was LIVE pscp.tv", "2020-03-23T18:53:18.000Z": "Tonight, I will deliver a direct address to Washingtonians about our COVID-19 response.\n\nWatch live here at 5:30 PM: https:// player.invintus.com/?clientID=9375 922947&eventID=2020031185 ", "2020-03-22T18:08:52.000Z": "Today, I named ret. Navy Vice Admiral Raquel C. Bono Washington state director for COVID-19 Health System Response Management.", "2020-03-21T23:22:13.000Z": "We heard reports that a @target in Seattle was selling n95 masks.  \n\nMy staff and others stepped in. \n\nThose masks are now on their way to the health care workers who desperately need them. Quote Tweet Fuse Washington @FuseWA UPDATE: state and local leaders intervened with @Target corporate & these masks have been pulled from the shelves for medical use. Thanks to @SEIU1199NW & @UFCW21 for highlighting this & @GovInslee , @kcexec , & @MayorJenny teams for quick action. #Covid_19  #CoronavirusPandemic twitter.com/FuseWA/status/", "2020-03-20T23:38:26.000Z": "WATCH: I am discussing protections for at-risk employees during the COVID-19 outbreak.  \n\nLive here: https:// player.invintus.com/?clientID=9375 922947&eventID=2020031184 ", "2020-03-19T17:00:35.000Z": "The state created a website for all COVID-19 related information. Resources available to families, workers and businesses Health recommendations Statistics Emergency actions And more  http:// coronavirus.wa.gov", "2020-03-18T22:05:30.000Z": "We're taking extreme measures to protect the health and safety of our state.\n \nToday, I'm announcing a new set of policies to reduce the impact on Washingtonians.", "2020-03-18T20:21:41.000Z": "I will announce new steps to limit the impact of COVID-19 on Washingtonians at 3:00 PM today. \n\nWatch live here: https:// tvw.org/watch/?clientID=9375922947&eventID=2020031180 ", "2020-03-18T02:35:44.000Z": "Stay Home. Save Lives. Pass it on. #WeGotThisWA", "2020-03-17T22:12:26.000Z": "Today, I signed 5 bills that will help our state respond to COVID-19. \n\nThe first allocates $200 million to: increase hospital capacity expand testing provide resources to local and tribal health orgs better care for our most vulnerable", "2020-03-17T01:21:33.000Z": "Here is what is and isn't allowed as of today.", "2020-03-17T18:57:40.000Z": "Last week, the Legislature unanimously approved $200 million for our COVID-19 response. \n\nI'm grateful they stepped up as a unified body to help protect Washingtonians.\n\nI will sign that bill today. #waleg Quote Tweet Austin Jenkins N3 @AustinJenkinsN3 Today at 2pm @GovInslee will sign into law a $200M #coronavirus emergency funding measure that draws from the state's rainy day fund.", "2020-03-16T20:06:21.000Z": "The governor @GovInslee signed an emergency proclamation today banning gatherings over 50 people. #COVID19WA  #COVID19  https:// medium.com/@GovInslee/ins lee-announces-statewide-shutdown-of-restaurants-bars-and-expanded-social-gathering-limits-bb19095b2251   @GovInslee firmó hoy una proclamación de emergencia que prohíbe las reuniones de más de 50 personas. Inslee announces statewide shutdown of restaurants, bars and expanded social gathering limits Gov. Jay Inslee announced today an emergency proclamation that mandates the immediate two-week closure of all restaurants, bars, and medium.com", "2020-03-16T02:21:12.000Z": "COVID-19 is spreading in WA and around the globe. \n\nTo protect our people, we must continue to escalate our response. 1/6", "2020-03-15T18:34:42.000Z": "Most Washingtonians are helping slow COVID-19's spread by practicing strong social distancing. \n\nTo those of you that can be but are choosing not to: Your actions could kill someone. \n\nStop it.", "2020-03-13T18:33:24.000Z": "The state is working hard to combat COVID-19 in Washington. \n\nFor health info and stats on COVID-19 in WA, visit the @WaDeptHealth COVID-19 webpage  http:// bit.ly/CoronavirusWA For all other state resources available to Washingtonians, visit our site COVID-19 Resources and Information Links to state and local government information about the coronavirus (COVID-19) outbreak in Washington state. governor.wa.gov", "2020-03-15T03:38:20.000Z": "While fighting COVID-19, we must also fight against rumors and false information. \n\nLet me be clear: Neither me nor my staff are engaged in conversations to quarantine or seal off any part of Washington state.", "2020-03-13T20:43:41.000Z": "The COVID-19 outbreak is evolving quickly. We are not waiting to take the measures needed to contain it.\n \nToday, I am expanding my school closure order to all K-12 schools statewide. They will close by Tuesday, March 17 and will remain closed through at least Friday, April 24.", "2020-03-13T19:29:03.000Z": "Today at 1:30 PM, I am holding a press conference to address our continued response to COVID-19 in Washington.\n \nWatch live here: https:// tvw.org/watch/?clientID=9375922947&eventID=2020031174 ", "2020-03-13T17:33:50.000Z": "Here are other options to give blood throughout the state: \n\nVitalant: https:// myinbc.org The American Red Cross: Upcoming blood drive. Help save lives. Here's information about our upcoming American Red Cross blood drive. Schedule an appointment. redcrossblood.org", "2020-03-13T16:49:04.000Z": "Our region's blood stores are extremely low due to concerns about COVID-19. But we cannot let fear from one health issue create another. I encourage everyone to donate blood and help their communities.\n\nI know this: Here in WA, we take care of each other. https:// schedule.bloodworksnw.org/DonorPortal/De fault.aspx ", "2020-03-12T21:07:02.000Z": "I am directing the closure of all K-12 schools in King, Pierce and Snohomish counties in response to the COVID-19 outbreak.\n \nSchools must close by Tuesday, March 17th  and stay closed through Friday, April 24.", "2020-03-12T19:43:01.000Z": "I will announce new school guidelines related to COVID-19 at 2 PM today.\n\nWatch live here: https:// tvw.org/watch/?clientID=9375922947&eventID=2020031168 ", "2020-03-12T18:30:49.000Z": "I wanted to reach out with some updates on our response to the COVID-19 outbreak in Washington state. \n\nI'm more certain than ever we can get through this if we work together -and we will. Important information and updates regarding COVID-19 Some updates on our response to the COVID-19 outbreak in Washington state medium.com", "2020-03-11T17:22:53.000Z": "The health and well-being of Washingtonians during the COVID-19 outbreak remains our top priority.\n \nStarting today, we will prohibit events of more than 250 people in King, Snohomish and Pierce Counties to slow the spread of this virus.", "2020-03-10T21:12:23.000Z": "Through careful planning and by working together, we can mitigate the economic hardships COVID-19 is going to cause. \n\nToday, I announced the expansion of state policies to support workers and businesses financially impacted by this outbreak. Inslee announces support for workers and businesses impacted by Gov. Jay Inslee announced the expansion of state policies today to support workers and businesses financially impacted by COVID-19. governor.wa.gov", "2020-03-10T16:15:44.000Z": "WATCH: I'm announcing new measures to help mitigate the impacts of our COVID-19 response on WA workers and businesses. \n\nLive here: https:// tvw.org/watch/?eventID =2020031146 ", "2020-03-10T03:40:19.000Z": "We must stay ahead of our state's COVID-19 needs. \n\nThat's why we're expanding our capacity to test and care for new cases in WA. @maddow Quote Tweet MSNBC @MSNBC Gov. Inslee says Washington is increasing its medical capacities in hospitals to fight coronavirus after 3 more deaths in the state.\n\n\"We might have a thousand people infected today in Washington, but this doubles every week in an epidemic like this.\" Show this thread", "2020-03-10T01:50:14.000Z": "Remember: Ballots must be postmarked by tomorrow to vote in Washington's presidential primary. This is an incredibly important election-and even with concerns of COVID-19, I'm hoping Washingtonians step up to make their voices heard.\n\nFind out more here: https:// voter.votewa.gov/WhereToVote.as px ", "2020-03-07T00:46:31.000Z": "This week, I declared a state of emergency and put in place steps to respond to the coronavirus (COVID-19). I'm committed -along with the entire state -to an unprecedented effort to address this outbreak with the urgency it demands. Washington's response to COVID-19 Small changes make a big impact. medium.com", "2020-03-05T21:53:51.000Z": "My emergency proclamation has allowed us to bring down cost barriers to COVID-19 testing. We've directed WA health insurers to waive deductibles and copays for COVID-19 tests. https:// insurance.wa.gov/news/kreidler- orders-washington-health-insurers-waive-deductibles-and-copays-coronavirus-testing ", "2020-03-05T18:36:59.000Z": "WATCH: I am holding a press conference to provide an update on the state COVID-19 response. \n\nTune in live here: https:// tvw.org/tvchannels/tvw 2/ ", "2020-03-03T22:24:47.000Z": "We are using every tool available to us to combat COVID-19. \n\nThanks to @RepDelBene and our entire WA delegation for their efforts to secure federal funding that will help keep Washingtonians safe and healthy. Quote Tweet Rep. Suzan DelBene @RepDelBene As my constituents back home are suffering from COVID-19, I am fighting for the federal resources we need to mitigate this outbreak. https:// seattletimes.com/opinion/rep-su zan-delbene-we-need-federal-resources-and-science-to-combat-covid-19/ ", "2020-02-29T18:34:12.000Z": "It is a sad day as we learn a Washingtonian has died from COVID-19. Our hearts go out to his family and friends. \n\nWe are strengthening our preparedness and response efforts to keep Washingtonians healthy, safe and informed.\n\nFull statement: https:// governor.wa.gov/news-media/ins lee-statement-death-washington-state-covid-19 ", "2020-02-28T17:04:02.000Z": "\"Humanity was only ever as doomed as it believed itself to be. Vanquishing that belief was our true legacy.\" What the world could look like in 2050 if we do everything right on climate In a new book, 'The Future We Choose,' two of the negotiators of the Paris climate agreement envision the future we could live in if the world comes together to fight climate change. fastcompany.com", "2020-02-28T04:09:09.000Z": "I just received a call from @VP Mike Pence, thanking Washington state for our efforts to combat the coronavirus. \n\nI told him our work would be more successful if the Trump administration stuck to the science and told the truth.", "2020-02-28T02:10:04.000Z": "We're leading the nation with our historic paid family and medical leave program. \n\nFrom now on, Washingtonians won't have to choose between providing for their families or being there for them when they're needed most. 80% Of Americans Support Paid Family And Medical Leave, Yet Less Than 20% Have Access Recently, during his Statue of The Union address, President Trump even called for support for a paid family leave policy. forbes.com", "2020-02-27T20:37:59.000Z": "Since 1975, Washington has accepted more than 145,000 refugees from around the world. \n\nWe will never shut our doors to those seeking opportunity, asylum, or refuge. Immigrants make our communities stronger.", "2020-02-27T16:46:41.000Z": "We have so many beautiful islands in our state, but there's no doubt Bainbridge is Trudi's and my favorite. Seattle Day Trips: 9 Washington islands to explore From Orcas Island to Whidbey, Vashon and Bainbridge, here are nine gorgeous islands to explore a mere ferry ride away. mercurynews.com", "2020-02-26T04:17:55.000Z": "The @DNC told us: \"We're going to talk about climate change early, often, and in depth.\"\n\nWe're still waiting. #DemDebate Quote Tweet Alexandria Ocasio-Cortez @AOC US House candidate, NY-14 Not a single climate change question. Horrifying.", "2020-02-26T22:56:04.000Z": "Homelessness is a statewide problem that needs a statewide solution. \n\nBut we also must give each city and county the flexibility to tackle homelessness in a way that works best for their communities. Gov. Inslee talks homelessness, health care, economy with Daily World editorial board | The Daily... Gov. Jay Inslee stopped by the Daily World offices during his tour of Twin Harbors schools Wednesday and covered a range of topics, including the state's initiative against homelessness, which would... thedailyworld.com", "2020-02-21T03:11:05.000Z": "Governor Inslee joins in celebrating the grand opening of @iTechPrep . Thank you to our dedicated voter community! #VPSAmazing", "2020-02-26T16:40:19.000Z": "We were ready to respond quickly and efficiently to the coronavirus in our state because we've invested in a robust public health system. Grateful to the doctors and medical staff who ensured this man made a full recovery. Quote Tweet USA TODAY @USATODAY A Washington state man who was the nation's first confirmed case of the new, deadly coronavirus has made a full recovery and is no longer quarantined, health officials announced. https:// usatoday.com/story/news/nat ion/2020/02/20/coronavirus-china-us-patient-released-south-korea-iran/4817428002/ ", "2020-02-26T00:02:18.000Z": "As we fight to defeat the climate crisis, never forget: We're also fighting for a more equitable and just world. This is both a daunting challenge and an extraordinary opportunity.", "2020-02-21T04:41:26.000Z": "Thanks to @CareerConnectWA , Washingtonians are training for careers in their communities. That means quality jobs for workers and a skilled workforce to power our economy. \n\nIt was great to hear what it means for interns with the SW WA High Tech Council today.", "2020-02-25T15:22:16.000Z": "Climate change is already impacting our water systems, and about 70% of Washingtonians live near the coast. It will affect our lives and livelihoods - we must do everything in our power to defeat this crisis. UW summarizes Washington climate impact on water | Seattle Weekly The report localizes information from the United Nations. seattleweekly.com", "2020-02-25T00:45:03.000Z": "It's always a good day when @JayInslee visits campus! He also got to spend some time with Butch this past Friday. #GoVanCougs  #wsuv", "2020-02-24T22:53:46.000Z": "There's no question: A parent should be able to stay home with a newborn. A son or daughter should be able to care for a sick parent. We all should be able to take time to heal from injury or sickness. It just makes sense. From Jay Inslee", "2020-02-24T20:20:44.000Z": "The investments we've made in AbSci could help dramatically reduce the cost of insulin and other drugs, while creating good jobs in southwest Washington. It's money well spent. Inslee: State's investment in Vancouver's AbSci is money well-spent In the brick Hudson Building in downtown Vancouver, biotechnology company AbSci is experiencing massive growth. columbian.com", "2020-02-21T20:53:36.000Z": "Thank you @GovInslee for visiting with us today at our Fire Station to discuss issues about Public Safety. @CityBonneyLake  @BLPoliceDept  @Edgewood_PD We appreciate your support.", "2020-02-22T23:12:19.000Z": "Our seniors deserve to age with dignity. WA's first-in-the-nation long-term care program makes that possible. \n\nI enjoyed sharing the good news at the Bonny Lake Senior Center yesterday.", "2020-02-24T16:22:07.000Z": "Our state's natural habitat and outdoor recreation destinations are part of what makes living in Washington so unique. Invasive species threaten our economy, environment, recreation and even our health. Washington Governor Jay Inslee Highlights Need to Stop Invasive Species  Newstalk KBKW Gov. Jay Inslee has proclaimed Feb. 24-28 as Invasive Species Awareness Week in Washington to highlight the importance of managing and preventing invasive species, which pose a $137 billion annual... kbkw.com", "2020-02-23T22:29:03.000Z": "Candidates running for city council to the White House, take note: \"Protecting the environment and tackling climate change have climbed up the list of Americans' political priorities this year.\" Climate Change Rises as a Public Priority. But It's More Partisan Than Ever. Protecting the environment and tackling climate change have climbed up the list of Americans' political priorities, but there are startling differences between members of different parties. nytimes.com", "2020-02-23T18:53:36.000Z": "Too many people in Washington are going through homelessness. We have a plan to help solve it. \n\nThrough the work of community partners like HopeWorks Station and state investment, we can and we will bring people inside with dignity and compassion. From Governor Jay Inslee", "2020-02-22T21:58:34.000Z": "It's been proven over and over, here in Washington and beyond: Common sense gun measures like red flag laws save lives. Quote Tweet Gun Responsibility @WaGunResponsib In 2016, voters approved Initiative 1491 creating Extreme Risk Protection Orders in Washington state. Now, more than a dozen other states across the country are considering similar legislation. Here's what you need to know about ERPOs. https:// thetrace.org/2020/02/states -are-embracing-red-flag-laws-for-gun-owners-heres-how-they-work/ ", "2020-02-22T16:02:04.000Z": "\"This is the decade in which, contrary to everything humanity has experienced before, we have everything in our power\" to defeat climate change. I couldn't agree more, @CFigueres . Christiana Figueres on the climate emergency: 'This is the decade and we are the generation' The leader of the 2015 Paris accord talks about her new book, The Future We Choose, and why it's crunch time for humanity theguardian.com", "2020-02-21T23:56:54.000Z": "Better yet, this new terminal will charge some of our all new hybrid-electric ferries! How cool is that? Take a look inside the new Mukilteo ferry terminal Expected to open this fall, the $187 million facility will replace the existing terminal and dock that, built in 1957, is vulnerable in an earthquake. seattletimes.com", "2020-02-21T20:55:49.000Z": "Climate activists around the country are fired up and ready for real leadership on this crisis. \n\nAnd let me be clear: We are winning. Quote Tweet Data for Progress @DataProgress For the blog, @leahstokes , @narayansub and @jnoisecat argue that progressives like @JayInslee , @AOC , @BernieSanders and @ewarren are winning a climate policy paradigm shift from carbon pricing to performance standards, public investment and justice. https:// dataforprogress.org/blog/2020/2/18 /the-fingerprints-of-the-green-new-deal-are-all-over-the-clean-future-act ", "2020-02-21T18:29:28.000Z": "A hearty Cougar thank you to @JayInslee for your committed support of the @WSUVancouver Life Sciences Building and the Coug Nation across #WA .  We look forward to our continued work together supporting the next generation of world class talent and innovative research. #GoCougs", "2020-02-14T01:32:56.000Z": "WA has the best college financing program in the country. Thousands more students can now afford our universities, colleges, technical schools and apprenticeship programs.\n \nI shared the good news with high school students yesterday. Learn more  https:// wsac.wa.gov/wcg", "2020-02-20T19:17:03.000Z": "I'm proud of and inspired by the @WaGunResponsib , @Everytown , and @MomsDemand activists fighting for common sense gun laws in Washington. #waleg Gun safety advocates push for tighter laws on Parkland anniversary kiro7.com", "2020-02-20T16:30:56.000Z": "Caucuses exclude parents of young children, people who don't work typical 9-5 jobs, those with disabilities, and deployed military. \n\nThat is not what democracy looks like. Former 2020 Democrat Jay Inslee: Caucuses are 'exclusionary and anti-ethical' Caucuses, for decades a key part of the Democratic presidential nominating process, were already under scrutiny before the Iowa disaster that delayed results for more than a week after Feb. 3. Now, a... washingtonexaminer.com", "2020-02-20T00:26:36.000Z": "College isn't the only pathway for students to achieve success in life. \n\nThat's why we created @CareerConnectWA - so students like Olivia can find meaningful, high-wage careers no matter what path they take. Quote Tweet Spokane Schools @spokaneschools ICYMI: Shadle Park senior Olivia Perkins received a special shoutout from @GovInslee last month, during his 2020 State of the State address.\n\nHear about this once in a lifetime experience in Olivia's words.", "2020-02-19T21:10:47.000Z": ". @dwallacewells is exactly right: If the world has any hope of defeating the climate crisis, we must do everything in our power to make Donald Trump a one-term president. What Would Four More Years of Trump Look Like? The death of global climate efforts. Escalating trade wars. Nuclear brinkmanship. Here, 19 visions of a future that seems more possible than ever. nymag.com", "2020-02-19T19:31:54.000Z": "On this day in 1942, FDR signed the executive order allowing internment of Japanese Americans. They began in Bainbridge Island, WA. \n\nToday, we must stand strong against fear and race-based division. Because when we allow it to divide us, injustice can happen anywhere.", "2020-02-19T17:22:00.000Z": "We cannot let Donald Trump and his minions in the Republican party strip away health insurance from hundreds of thousands of people. \n\nHealth care is a human right and we're working hard to increase access (and reduce costs) here in Washington. Gov. Inslee talks homelessness, health care, economy with Daily World editorial board | The Daily... Gov. Jay Inslee stopped by the Daily World offices during his tour of Twin Harbors schools Wednesday and covered a range of topics, including the state's initiative against homelessness, which would... thedailyworld.com", "2020-02-18T02:31:32.000Z": "I sound like a broken record, but we must stop breaking climate records. Temperature in Antarctica soars to near 70 degrees, appearing to topple continental record set days... The temperature beats a milestone set days earlier by nearly 5 degrees. washingtonpost.com", "2020-02-18T21:59:46.000Z": "ALERT: The state legislature is debating an important measure that's vital to our health and our climate.\n\nIf you live in WA, call your state senator today and ask him or her to pass the Clean Air Authority bill (SB6628) and restore the state's authority to protect clean air.", "2020-02-18T22:39:55.000Z": "For folks in Washington State. Call your local state senator and ask them to pass the Clean Air Authority bill (SB6628). It just takes a minute, I just did it. Quote Tweet Jay Inslee @JayInslee ALERT: The state legislature is debating an important measure that's vital to our health and our climate.\n\nIf you live in WA, call your state senator today and ask him or her to pass the Clean Air Authority bill (SB6628) and restore the state's authority to protect clean air. Show this thread", "2020-02-17T18:49:40.000Z": "Thank you, @GovInslee , for stopping by and taking a tour of HopeWorks Social Enterprises, visiting with some of our residents and staff, and getting a little shopping in at ReNew Works Home &Decor. We appreciate your time, support and your business. Thank you!", "2020-02-18T17:17:31.000Z": "Through career-connected learning in Spokane and a lot of hard work, Olivia Perkins is making her dream of creating metal artwork a reality. You make Washington proud, Olivia! Shadle Park High School student gets nod from Gov. Jay Inslee for welding prowess As Gov. Jay Inslee talked about apprenticeships and technical education during his State of the State speech, he turned toward Olivia Perkins and beckoned her to stand. \"My dad thought I was going to... spokesman.com", "2020-02-15T19:35:03.000Z": "Everyone, everywhere deserves reproductive freedom - no matter what their zip code is or how much money they make.", "2020-02-17T19:09:13.000Z": "It is often black women who push America to live the values we espouse. \n\nWomen like Sojourner Truth, Angela Davis, Maya Angelou and countless others whose names have been erased from history, are responsible for the greatest moments of American progress. #BlackHistoryMonth", "2020-02-17T16:29:46.000Z": "Career Connect Washington connects students of all ages with internships, registered apprenticeships, career exploration programs, and other learning opportunities to make sure they can provide for their families in an ever-changing economy. From Governor Jay Inslee", "2020-02-16T21:41:15.000Z": "Your vote matters! We've made it easier than ever to vote in Washington. Here's how to make your voice heard during the presidential primary. Get ready, Washington voters: Ballots arriving this month for 2020 presidential primary Washington voters will have to choose a party for the presidential primary. Ballots must be postmarked by March 10. kitsapsun.com", "2020-02-16T17:30:55.000Z": "This is about making sure the people who need it most have the chance to get a world-class education and the job of their dreams. Inslee signs college grant funding bill into law OLYMPIA - Gov. Jay Inslee on Monday signed the first new law of this year's legislative session, a measure that changes the structure of a new business and occupation tax surcharge levied on some prof columbian.com", "2020-02-15T23:22:47.000Z": "At my direction, Washington state now has the country's strongest overtime rules. This is about rebuilding our middle class and putting workers before giant corporations. \n\nEvery American deserves the same protections we have, wherever they live. Sign the Petition: Tell 2020 Democratic Presidential Candidates to Commit to Supporting Overtime... act.jayinslee.com", "2020-02-15T20:39:21.000Z": "Thank you @JayInslee for always, always speaking AND acting! Reproductive freedom is not a women's issue. It's a question of control, oppression and a desire to maintain power. It's a fight for all people and Jay has always been on the frontline with us. Quote Tweet Jay Inslee @JayInslee Everyone, everywhere deserves reproductive freedom - no matter what their zip code is or how much money they make.", "2020-02-14T19:36:56.000Z": "Join me and @WAGunResponsib in calling on lawmakers to pass HB 2240/SB 6077, which limits high capacity magazines. \n\nContact your legislator today and tell them to vote YES on these important bills to keep Washingtonians safe from gun violence: http:// bit.ly/2SIjuuo", "2020-02-14T19:34:31.000Z": "It remains one of the deadliest school shootings in the history of this country. And since then, Republicans in the Senate and President Donald Trump have done nothing to prevent more tragedies like it. #MSDStrong", "2020-02-14T19:34:30.000Z": "Too many days mark tragic anniversaries. Today is one.\n\nTwo years ago, a gunman walked into Marjory Stoneman Douglas High School in Parkland, Florida and used a semi-automatic rifle to murder 17 people and wound 17 others. #MSDStrong", "2020-02-14T17:11:00.000Z": "Happy #ValentinesDay , Washington!", "2020-02-14T01:28:48.000Z": "We're transitioning some of our biggest and dirtiest ferries and building an all-new 144-car electric ferry. \n\nAnd better yet, we're creating more jobs for shipyard workers and ensuring a safer and cleaner future for our state. How Washington state plans to create the world's largest hybrid-powered, auto-carrying ferries The world's maritime industry is beginning to transition from air-fouling, climate-warming diesel fuel to cleaner energy - and Washington state's ferry fleet is getting on board. geekwire.com", "2020-02-13T01:57:29.000Z": "Our house is on fire. We do not have time to keep kicking the can down the road on the climate crisis.", "2020-02-13T20:40:08.000Z": "Climate change must be part of our strategy to take back the White House. \nClimate change must be part of our strategy to take back the White House. \nClimate change must be part of our strategy to take back the White House. Trump's Biggest Vulnerability Isn't What You Think The polling numbers don't lie. motherjones.com", "2020-02-13T16:56:50.000Z": "Six years ago this week, I suspended the death penalty in our state. Now it's time to end it for good. #waleg Washington Senate passes bill to end death penalty The measure would remove capital punishment as a sentencing option for aggravated murder and mandate instead a sentence of life in prison without possibility of parole. seattletimes.com", "2020-02-12T20:39:47.000Z": "I am in awe of what parents around our country have done to end gun violence and protect our kids. I am ashamed that the US Congress has not mustered the courage to do the same. How moms are quietly passing gun safety policy through school boards In the face of inaction by Congress, parent activists have found success in a new approach to convincing people to lock up their guns at home. nbcnews.com", "2020-02-12T17:17:49.000Z": "They say a picture is worth a thousand words, but I just have one: Wow! Quote Tweet Q13 FOX Seattle @Q13FOX We've missed you, Mt. Rainier Twilight in Gig Harbor by George Campbell Photography", "2020-02-12T02:19:59.000Z": "Caucuses are exclusionary and antithetical to the inclusive democracy our Democratic Party has been trying to build for years.\n\nThat's why WA decided to end caucuses last year. And that's why it's time for more states to follow. \n\nAdd your name: https:// bit.ly/2vrPnzi", "2020-02-11T19:48:44.000Z": "When Donald Trump pretends to care about clean air, clean air, and our health, remember this: He is lying. Trump $4.8 trillion budget proposal includes 26% cut to EPA The plan relies on an optimistic forecast for economic growth of 3%, which economists say is unlikely to be reached. cbsnews.com", "2020-02-11T17:08:19.000Z": "I'm very happy for this man and his family. I'm also incredibly proud of Washington's robust public health system that ensured our response to coronavirus was swift and efficient. Snohomish County man with novel coronavirus discharged from hospital A Snohomish County man believed to be the first person in the United States to be diagnosed with the novel coronavirus has been discharged from an Everett hospital, where he'd been treated in... seattletimes.com", "2020-02-10T20:00:01.000Z": "We're lucky to have a leader like @JayInslee with the courage to fight to end gun violence. Quote Tweet Jay Inslee @JayInslee Since I took office in 2013, I've been committed to ending gun violence in our state. In the last 6 years, we've: Banned bump stocks Toughened access to assault weapons Expanded background checks\n\nAnd we're not done yet.", "2020-02-10T18:58:56.000Z": "Everyone deserves a pathway to meaningful work that pays a fair wage and provides a lifetime of opportunity. \n\nThat's why we created @CareerConnectWA - connecting students of all ages with learning opportunities so they can provide for their families in an ever-changing economy.", "2020-02-09T22:57:34.000Z": "There's no other livable option: We must defeat the climate crisis. Quote Tweet David Wallace-Wells @dwallacewells \"By 2030, possibly two hundred million Indians could be exposed to lethal heat waves, in which the temperature could kill a well-hydrated person who spent only four hours outside, even in the shade...\" https:// newyorker.com/news/annals-of -a-warming-planet/will-big-business-finally-reckon-with-the-climate-crisis  Show this thread", "2020-02-10T14:52:16.000Z": "Since I took office in 2013, I've been committed to ending gun violence in our state. In the last 6 years, we've: Banned bump stocks Toughened access to assault weapons Expanded background checks\n\nAnd we're not done yet.", "2020-02-09T19:36:54.000Z": "It's appalling that the US is one of the only developed nations in the world not to offer paid family leave. In Washington state, we're leading the way - offering up to 12 weeks of paid leave a year for people who need it. 'I was risking my life': why one in four US women return to work two weeks after childbirth The US is one of only three of the most developed countries in the world not to offer statutory paid maternity leave, according to an analysis theguardian.com", "2020-02-09T00:35:16.000Z": "The impact of our carbon emissions isn't limited to life on land. Climate change has serious implications for life under the sea. The world's oceans are speeding up - another mega-scale consequence of climate change New research finds an acceleration across 76 percent of the global ocean. washingtonpost.com", "2020-02-08T21:48:42.000Z": "My dad, Frank Inslee, was a high school biology teacher and coach. It's our duty to invest in teachers and students. \n\nA huge thank you to all of Washington state educators for your tireless work! Quote Tweet Clark College @ClarkCollege Thank you to the #waleg and @GovInslee for helping thousands of our state's students turn their dreams into reality. Your investment in higher education, including the Washington College Grant, is an investment in our shared future. #waedu", "2020-02-08T18:17:46.000Z": "Trudi and I had a great time visiting @PierceCollege in Puyallup earlier this week. Thanks to a lot of hard work by educators and students, the school has earned a spot in the top 5 community colleges in the entire nation. Governor Jay Inslee visits Pierce College Puyallup Pierce College students, faculty and staff from across the district had the unique opportunity to sit down with Gov. Jay Inslee during a special visit to Pierce College Puyallup on Monday, Feb. 3.  thesubtimes.com", "2020-02-07T17:45:57.000Z": "Great to chat with real-life superhero @ChrisEvans for his new project, #AStartingPoint . The more people can engage with our democracy, the stronger we are as a country. \n\nAnd, of course, we talked climate change.", "2020-02-07T19:44:16.000Z": "\"Any lawmaker worth holding office ought to do everything reasonable to protect constituents during the modern mass-shooting epidemic.\" \n\nLet me be clear: I couldn't agree more. #waleg Washington state lawmakers must pass assault-weapons ban After three sessions of indecision, it's time for the Washington Legislature to take a vote on a proposed assault-weapons ban or put the issue on the November ballot. seattletimes.com", "2020-02-07T16:09:16.000Z": "The next president of the United States - as well as leaders up and down the ballot - must treat climate change as the greatest existential threat of our time. Because it is. Rise in sea levels is accelerating along U.S. coasts, report warns The rate of sea level rise along most of the U.S. coastline continues to accelerate, a new report says, calling the pattern a \"game changer.\" usatoday.com", "2020-02-07T00:16:36.000Z": "I'm proud of the work @PierceCollege is doing for students getting an education there. Funding community and technical colleges is critically important for our state's future. Quote Tweet piercecollege @piercecollege Students, faculty and staff sat down with Gov. Jay Inslee yesterday for a special roundtable discussion. Learn more below about Gov. Inslee's visit to Pierce College Puyallup! http:// bit.ly/2Si23R5", "2020-02-06T21:34:58.000Z": "There should not be weapons of war on our streets. In 2019, we ended the sale of assault weapons to people under 21. \n\nThis year, I'm working with #waleg and @BobFergusonAG to ban them altogether. Washington State Bans Sale of Semiautomatic Assault Rifles to Those Under 21 The ban comes as dozens of gun control measures have been passed across the country, spurred on by public pressure after deadly mass killings. The N.R.A. has filed suit. nytimes.com", "2020-02-06T16:12:30.000Z": "Climate change is not one issue. It's every issue - including migration and where we call home. Where America's Climate Migrants Will Go As Sea Level Rises 13 million U.S. coastal residents are expected to be displaced by 2100 due to sea level rise. Researchers are starting to predict where they'll go. bloomberg.com", "2020-02-06T03:12:45.000Z": "We lost a talented and courageous  man today. Besides a spectacular movie career, Kirk Douglas gave Dalton Trumbo screen credit after he was blacklisted during the McCarthy era. We honor him.", "2020-02-06T02:12:03.000Z": "By voting to convict the president today, Sen. @MittRomney showed true courage and patriotism. History will not be kind to his Republican colleagues in the Senate.", "2020-02-05T23:25:23.000Z": "Homelessness is a statewide problem and it demands a statewide response. I'm grateful to legislators for working hard to create solutions that meet the scale of the problem. #waleg Legislature making progress on bills addressing homelessness Several bills are expected to move forward in the House and Senate, legislative leaders said Tuesday. thenewstribune.com", "2020-02-03T20:57:38.000Z": "Thank you to @GovInslee for visiting Pierce College #Puyallup and sitting down with our students, faculty and staff to learn more about the work we're doing to help each of our students be successful!", "2020-02-05T05:02:07.000Z": "I know this: During the next #SOTU , the president will talk about the climate crisis and commit to action - because it is the most pressing issue of our time.\n\nI know this because the president will not be Donald Trump. #SOTU2020", "2020-02-05T16:46:15.000Z": "No matter what company a person works for, they shouldn't have to choose between being there for family or earning a paycheck. \n\nThat's why we've made paid family and medical leave a reality here in WA. The Parental Leave Boomlet in the U.S. Is Leaving Women Behind Big companies in industries where women make up the bulk of the workforce are less likely to offer paid time off to new parents. bloomberg.com", "2020-02-04T23:06:51.000Z": "We can bank on it: Climate change presents very real risks to our economies and financial systems. \n\nJust one more reason we need a full-scale mobilization to address the climate crisis. Analysis | Why Big Central Banks Are Becoming Climate Warriors washingtonpost.com", "2020-02-04T19:58:26.000Z": "Responding to homelessness is about giving people the tools and resources they need to get back on their feet. It's about prevention, it's about rent assistance, and it's about supportive housing for our most vulnerable individuals. Inslee talks housing affordability at Skagit County meeting MOUNT VERNON - Gov. Jay Inslee talked Friday with leaders in Skagit County about homelessness, housing affordability and his $146 million plan to fight homelessness. lmtribune.com", "2020-02-03T21:50:41.000Z": "Thank you for your leadership, Gov. @JayInslee . Quote Tweet Jay Inslee @JayInslee \"Like the effects of global warming, the economic case for addressing climate change should become increasingly obvious.\" \n\nExactly. When we act on climate change, we're acting to protect our environment, ourselves, and our economy. https:// heraldnet.com/opinion/editor ial-climate-action-neednt-cost-us-a-good-economy ", "2020-02-02T20:57:21.000Z": "The US Senate has become a legislative graveyard. Mitch McConnell calls himself the grim reaper. \n\nIf we have any hope of making progress in this country, we must eliminate the filibuster for good.", "2020-02-03T20:50:17.000Z": "Sam Strahan's act of courage may have saved others from the same fate. Now, his mother Ami is summoning the courage to do the same. \n\nIt's up to all of us to courageously fight for common sense gun laws in our state and in our country. Sam Strahan's mother meets Gov. Inslee amid gun control debate in Olympia \"Sam's act of courage may have saved others from the same fate. Now, Ami is summoning that courage to do the same,\" Inslee wrote. krem.com", "2020-02-02T16:41:24.000Z": "Have you tried a Cosmic Crisp yet? I'm over the moon. Washington takes a bite out of the Cosmic Crisp apple The Washington Cosmic Crisp apple is probably the most famous apple you knew about before actually taking a bite. medium.com", "2020-02-02T02:06:57.000Z": "\"As environmental degradation and stress on ecosystems increases, that in turn creates scarcity and stress for people, and the evidence shows that, where environmental pressures increase, gender-based violence increases.\" Climate breakdown 'is increasing violence against women' Exclusive: attempts to tackle crisis fail because gender issues are not addressed, report finds theguardian.com", "2020-01-25T01:42:16.000Z": "Aerospace companies like @toolgauge continue to grow in WA. They are using @AJACtraining and @careerconnectWA 's apprenticeship programs to fuel that growth. \n\nThat means good jobs for Washingtonians and the skilled workforce needed to keep us the world leader in aerospace.", "2020-02-01T18:00:47.000Z": "These are folks who care for us as we age, who take care of our children, who take care of our homes. It's time we take care of domestic workers and protect their rights in our state. Domestic workers rally for statewide labor protections Legislation coined the \"Domestic Workers Bill of Rights\" would give nannies and house cleaners the minimum wage and termination protections. king5.com", "2020-01-31T22:14:50.000Z": "For many people, there are barriers to getting the education, training, or experience they need to find family-wage careers. \n\nWe established @CareerConnectWA to change that - building pathways to high-wage, high-demand careers people can depend on. https:// careerconnectwa.org", "2020-01-31T18:48:26.000Z": "This week, Trudi and I were proud to meet with the dedicated @MomsDemand  @Everytown activists working to make our communities safer and end gun violence in Washington. Quote Tweet Rebecca Elbaum @iamelbaum Thank you ... @GovInslee  for being a Gun Sense Champion! ... @MomsDemand  #endgunviolence  #WALeg ... @Everytown  Show this thread", "2020-01-31T15:03:57.000Z": "Reproductive freedom and health care for all.", "2020-01-14T19:27:16.000Z": "Washington state has extraordinary leaders, pushing hard to provide extraordinary opportunities to young people. Thank you @GovInslee for being a leader and champion of this work! Quote Tweet Governor Jay Inslee @GovInslee WA's economy is strong. And we're in need of skilled workers at every level. @CareerConnectWA is giving students of all ages the skills they need for meaningful careers right here in WA. \n\nIt's investments like this that make us the best state in the nation. #waleg Show this thread", "2020-01-30T20:06:46.000Z": "\"Give me your tired, your poor, your huddled masses yearning to breathe free\" is written clearly at the Statue of Liberty's feet. \n\nTrump's \"public charge\" rule is deeply un-American and cruel. This ruling is outrageous. Supreme Court Allows Trump's Wealth Test for Green Cards The new policy revised the so-called public charge rule, making immigrants ineligible for permanent legal status if they use public benefits like Medicaid and food stamps. nytimes.com", "2020-01-30T17:17:38.000Z": "\"Like the effects of global warming, the economic case for addressing climate change should become increasingly obvious.\" \n\nExactly. When we act on climate change, we're acting to protect our environment, ourselves, and our economy. Editorial: Climate action needn't cost us a good economy | HeraldNet.com The City of Everett can adopt a climate plan that shows the economic benefits of acting on the emergency. heraldnet.com", "2020-01-30T04:54:16.000Z": "I applaud the House for passing bold climate legislation for the people of Washington tonight. Our state continues to lead the nation on clean energy and climate action. #waleg Quote Tweet WA House Democrats @WAHouseDems \"I'm voting yes on this bill because it gives me hope...Because our children deserve to inherit a strong economy. They deserve healthy forests and oceans. And they deserve to breathe clean air.\" - Rep. Ramel during floor debate on a #LowCarbonFuelStandard  #waleg  #cleanfuels", "2020-01-30T01:27:58.000Z": "Hundreds of Washington @MomsDemand volunteers showed up at the State Capitol today with Gov. @JayInslee to support a bill requiring Concealed Pistol License applicants to show proof of safety training, and a bill to establish an Office of Firearm Violence Prevention. #waleg", "2020-01-29T18:03:19.000Z": "Thank you @GovInslee for consistently advocating for gun safety laws for WA state! @MomsDemand  @Everytown  #WALeg  #EndGunViolence", "2020-01-29T21:35:22.000Z": "There's no question: Immigrants and refugees make our communities and our country stronger. We will never stop protecting immigrants and their inalienable rights in Washington state.", "2020-01-24T22:03:44.000Z": "Thanks to @CareerConnectWA , high school students are gaining the skills and experience they need to be hired when they graduate.\n\nYesterday, I met Stadium HS students getting hands-on training in robotics, health care, computer programming, culinary arts and aerospace.", "2020-01-29T16:16:22.000Z": "We've worked hard to build a robust economy in our state. \n\nWith @CareerConnectWA , we're making sure students have the skills they need to earn high-wage, high-demand jobs right here at home. From Governor Jay Inslee", "2020-01-29T00:23:15.000Z": "When you invest in workers and their wellbeing, you see some pretty extraordinary results. Proud the Evergreen State is showing the nation how it's done. Govs Get It Done: Gov. Jay Inslee Oversees Record Low Unemployment | Democratic Governors Associa... Washington State reported 4.3% unemployment, the lowest since 1976 as reported by the U.S. Bureau of Labor Statistics Today, the U.S. Bureau of Labor Statistics (BLS) announced that Washington State... democraticgovernors.org", "2020-01-28T20:55:29.000Z": "The climate crisis can feel like an enormous, intractable problem. \n\nBut I'm here to remind you that the solutions are already available today. We just have to put them to work - now.", "2020-01-28T17:27:41.000Z": "Every student deserves meaningful work and a lifetime of opportunity. \n\nThat was our guiding principle when we created @CareerConnectWA , and it's incredible to see it become a reality. https:// careerconnectwa.org", "2020-01-28T01:16:02.000Z": "Today marks three years since Trump signed his heinous Muslim ban. I was proud to be the first governor to stand up against the ban - in WA, we know Muslim people make our communities stronger. \n\nIt's time to get the white nationalist out of the White House.", "2020-01-28T00:19:00.000Z": "Thanks to @GovInslee 's investments in Washington's workforce and business diversity, WA has been ranked the best state in the country for business and for workers - and has record low unemployment! Govs Get It Done: Gov. Jay Inslee Oversees Record Low Unemployment | Democratic Governors Associa... Washington State reported 4.3% unemployment, the lowest since 1976 as reported by the U.S. Bureau of Labor Statistics Today, the U.S. Bureau of Labor Statistics (BLS) announced that Washington State... democraticgovernors.org", "2020-01-27T21:37:25.000Z": "Wow! Beautiful shot of Mt. Rainier. \n\n(Not a bad looking ferry either - soon, Washington's ferries will be going electric: https:// bit.ly/2RKMP7a ) Quote Tweet Wild NW Beauty Photography @WildNWBeauty It was SO nice to see Mount #Rainier again this afternoon! Hello, fresh #snow and #sunshine !  #PNW  #wawx  #ferry Show this thread", "2020-01-27T19:00:27.000Z": "When we say #NeverAgain , we must mean it not only in words, but in action - dedicating ourselves every day to fight back against anti-semitism, hatred, and bigotry. \n\nSilence is complicity. Never again is now. #HolocaustMemorialDay Quote Tweet US Holocaust Museum @HolocaustMuseum \"I don't have to say how I felt. I thought it was the end of, of us all then. I was 15 years old, and I was all alone in this hell.\"-Lilly Malnik, Holocaust survivor #OTD 75 years ago, Soviet troops liberated #Auschwitz , where 1.1 million people had been murdered. #WeRemember", "2020-01-27T16:12:53.000Z": "\"I have no problem dedicating myself to an employer. I also have to take care of myself and my family.\" - Sidney Kenney\n\nPeople need to be paid for the time they work. And under WA's new, stronger overtime rules, they will be. From Governor Jay Inslee", "2020-01-26T22:39:49.000Z": "WA's ferry system is the largest consumer of diesel fuel in the state, with ferries using more than 18 million gallons every year. It's also the largest generator of GHG emissions in state transportation. \n\nWe're changing that. How Washington state plans to create the world's largest hybrid-powered, auto-carrying ferries The world's maritime industry is beginning to transition from air-fouling, climate-warming diesel fuel to cleaner energy - and Washington state's ferry fleet is getting on board. geekwire.com", "2020-01-26T17:44:14.000Z": "Bold climate action is a winning issue for Democrats. Republican and Democratic voters actually agree on many climate change fixes. So why no action? From energy efficiency to modernizing the electric grid, voters actually agree on many climate change solutions, a poll by USA TODAY and Ipsos finds usatoday.com", "2020-01-25T22:28:45.000Z": "Hurricane Ridge tops my list of favorites! We're lucky to live in such a beautiful state - and we must continue to act on climate change to protect all this natural beauty. Magical Must-Do Hikes in Olympic National Park Trek through the rainforest, along the shoreline, and atop towering peaks. nationalgeographic.com", "2020-01-25T20:20:52.000Z": "Washington will not stand idly by as the Trump administration eviscerates critical protections for our natural resources. @BobFergusonAG and I are reviewing the final rule and exploring all options to protect clean water for all Washingtonians. 'Washington will not stand idly by': Gov. Inslee, AG Ferguson condemn recent EPA ruling - KXLY Governor Jay Inslee and Attorney General Bob Ferguson released a joint statement condemning a recent EPA ruling, which they say will end federal protection for streams, wetlands and other bodies of... kxly.com", "2020-01-24T20:39:46.000Z": "I'm calling on all the 2020 Democratic presidential candidates to take up Washington's overtime rules. Because we must rebuild our middle class. \n\nIf you want to see them make a commitment to salaried employees in every state, add your name right now. Sign the Petition: Tell 2020 Democratic Presidential Candidates to Commit to Supporting Overtime... act.jayinslee.com", "2020-01-24T16:07:40.000Z": "\"We will look back at this and realize we really helped people age with purpose and dignity.\" Last year, we made Washington the first state to pass long-term care into law. Washington Passes Long-Term Care Insurance Bill The state of Washington passed a state-run, long-term care insurance benefit. It would help people afford care at home and nursing home stays. aarp.org", "2020-01-24T01:40:29.000Z": "The maritime industry is part of who we are as Washingtonians. I was proud to be on board for launch of our first maritime startup accelerator. \n\n(I'm sure they'll run a tight ship.) Gov. Inslee helps launch Washington's first maritime startup accelerator in Seattle The maritime industry has long been an anchor to Washington's economy. Government and business leaders want to make sure that continues, especially with climate change and sustainability concerns geekwire.com", "2020-01-23T23:12:32.000Z": "\"This unprecedented rule will destroy more clean water protections than any other single act in American history.\" -... @JayInslee  and ... @BobFergusonAG  Inslee and Ferguson joint statement on Trump administration's Gov. governor.wa.gov", "2020-01-23T22:46:51.000Z": "In the last 7 years, we've made enormous strides to improve health care for all Washingtonians. We've passed: The nation's first public option The nation's best paid family and medical leave program Publicly funded long-term care Reproductive parity And more", "2020-01-23T03:49:56.000Z": "My full statement: https:// governor.wa.gov/news-media/ins lee-statement-seattle-shooting ", "2020-01-22T21:58:58.000Z": "Today marks 47 years since #RoevWade was decided by the Supreme Court.\n\nLet me be clear: I will continue to protect (and expand) reproductive freedom and health care in Washington. Our next president must codify Roe into law. Quote Tweet NARAL Pro-Choice WA @ProChoiceWA We are so lucky to live in a state where we have not passed a single abortion restriction in the past decade and have only increased the number of providers. http:// bit.ly/39z3LFB  #ProChoiceAndProud  #AbortionIsHealthcare", "2020-01-22T16:15:57.000Z": "So here in Washington state, we're doing something about it. It's hard to overstate how important this new policy is - not just for Washington families, but as a progressive model for the entire country. Washington OKs some of the nation's toughest overtime rules KOMO 4 TV provides news, sports, weather and local event coverage in the Seattle, Washington area including Bellevue, Redmond, Renton, Kent, Tacoma, Bremerton, SeaTac, Auburn, Mercer Island, Bothell,... komonews.com", "2020-01-22T16:06:52.000Z": "Most salaried employees are working well over a traditional 40-hour week, and between childcare and bills piling up at home, it can be impossible to keep up.\n\nIt's yet another way big companies are squeezing the middle class. And it's wrong.", "2020-01-21T23:01:27.000Z": "I'd like to thank @WaDeptHealth , @CDCgov and @SnoHD for their quick response to the novel coronavirus. \n\nBased on what we know now, risk to the general public is low at this time. \n\nMy full statement: http:// bit.ly/coronavirusWA", "2020-01-21T00:20:43.000Z": "Two years ago: Senate Democrats passed the Washington Voting Rights Act, part of a package of bills that made it easier for more WA voters to make their voices heard. #waleg  #AccessToDemocracy  #VotingRights Quote Tweet WA Senate Democrats @WASenDemocrats The Washington State Voting Rights Act passed the Senate by a vote of 29-19. It's great week for democracy in Washington! #waleg", "2020-01-20T16:22:21.000Z": "Dr. King once said, \"Injustice anywhere is a threat to justice everywhere.\"\n\nThat's why we can't ignore what's happening in our frontline communities. Climate change is our biggest existential threat as a nation, and it's widening the gulf of inequality between us. #MLKDay", "2020-01-20T23:56:19.000Z": "In Washington, we've built multiple paths to meaningful careers. We recognize every student for who they want to be in any workplace. High-school apprenticeship programs give kids a chance to earn money, credit, work experience More than 100 high-school students across the state will participate in apprenticeships this coming school year, part of a push to more closely link work to education. seattletimes.com", "2020-01-20T16:45:18.000Z": "I'm asking all 2020 Democratic presidential candidates to take up my Community Climate Justice plan to advance environmental, economic, and racial justice to build an inclusive, clean energy economy for all. \n\nAdd your name to join me. Add Your Name: Tell Democratic Presidential Nominees to Lead on Climate Justice act.jayinslee.com", "2020-01-20T16:37:25.000Z": "Communities of color and low-income communities are hit first and worst by climate change, and that's why justice must be at the center of any plan to combat the climate crisis. #MLKDay", "2020-01-18T21:06:37.000Z": "For those who doubt that we need to do more on climate change in Washington and in the United States, look at Australia today. \n\nThat is all of our futures - not just Australia's.", "2020-01-20T02:38:50.000Z": "Washington state indeed embodies the best of America. We've been honored to be both the best place to do business and the best place to be an employee. \n\nThat combination is a rare and powerful testament to the place we call home.", "2020-01-19T22:45:20.000Z": "Presidential candidates must treat climate change with the urgency it deserves. \n\nAnd state and local governments must do the same, because defeating this crisis will take every single one of us. Quote Tweet March for Science @MarchForScience We are 100 days away from Earth Day (4/22) when the world will unite to combat the climate crisis. We are calling on pres.  candidates to embrace the urgency of the IPCC 1.5C Report & commit to passing climate legislation in their first 100 days. Join us! http:// bit.ly/SciNotSi", "2020-01-19T19:19:03.000Z": "Ahem, or too old. Quote Tweet Ed Markey @EdMarkey No one is too young to be a climate warrior. Join the @sunrisemvmt , demand climate action, and fight for a Green New Deal at http:// sunrisemovement.org/hubs .", "2020-01-18T22:35:08.000Z": "How about we save Earth instead? https:// twitter.com/RandPaul/statu s/1218634368228503557  This Tweet is unavailable.", "2020-01-18T17:49:49.000Z": "Let me be clear: Washington state will always welcome refugees with open arms. Federal judge temporarily halts Trump administration policy allowing local governments to block... State and local officials cannot block refugees from being resettled in their jurisdictions, a federal judge ruled Wednesday, finding the Trump administration's new refu­gee policy is likely to be... msn.com", "2020-01-17T20:29:35.000Z": "Warmest. \nDecade. \nEver. \n\nThe reality is stark: We are running out of time to defeat climate change. The last decade was the warmest ever recorded, 2019 the 2nd warmest year in history Last year was the second warmest year on record around the globe, making the last decade the warmest in recorded history, according to new data released Wednesday. abcnews.go.com", "2020-01-17T18:45:14.000Z": "\"If you honor all work, then you honor students who want to manufacture the plane as much as you honor the student who wants to engineer the plane.\"\n\nThat's what @CareerConnectWA is all about. https:// careerconnectwa.org From Governor Jay Inslee", "2020-01-16T02:49:31.000Z": "Skilled workers across all industries are crucial to our state's economy. @CareerConnectWA trains students with the technical skills they need to be successful. Proud to work with @GovInslee on this shared vision. #waleg Quote Tweet Governor Jay Inslee @GovInslee WA's economy is strong. And we're in need of skilled workers at every level. @CareerConnectWA is giving students of all ages the skills they need for meaningful careers right here in WA. \n\nIt's investments like this that make us the best state in the nation. #waleg Show this thread", "2020-01-16T21:55:05.000Z": "Voting is a right, not a privilege, Governor. Quote Tweet Ron DeSantis @GovRonDeSantis I am pleased that @FLCourts confirms that Amendment 4 requires fines, fees & restitution be paid to victims before their voting rights may be restored. Voting is a privilege that should not be taken lightly, and I am obligated to faithfully implement Amendment 4 as it is defined.", "2020-01-16T21:27:55.000Z": "In the US, women now outnumber men in the workforce. \n\nPaid leave benefits all of us, regardless of gender. But this trend is just one more reason why the US should follow Washington's lead and implement a robust paid family and medical leave program. Women Now Outnumber Men in the American Workforce And that could push the U.S. toward paid family leave. fortune.com", "2020-01-16T16:01:20.000Z": "Ferries are part of who we are as Washingtonians. So it just makes sense to make sure they run on clean energy, for our families and our future. Quote Tweet Terri Hansen Indigenous @TerriHansen Washington state is transitioning its massive ferry fleet to zero-emission electric. Gov. Jay #Inslee said the conversions will generate jobs and result in cleaner water, better health, and end one of the largest emitters of #CO2 in the state. @WAStateGov  https:// link.medium.com/iaqAoyj2w2 Show this thread", "2020-01-16T00:36:03.000Z": "At the #DemDebate , four candidates brought up climate in response to questions about trade and national security - long before moderators asked one question about it specifically.\n\nIt's proof our climate movement is working, and candidates are listening. At the 7th Democratic debate, candidates took every opportunity to talk climate Debate moderators may take ages to get around to climate change in these debates, but the candidates have gotten increasingly adept at weaving the issue into their answers to other questions. grist.org", "2020-01-15T18:59:57.000Z": "Transportation accounts for nearly half of our state's greenhouse gas emissions. We're working to change that - and a statewide low-carbon fuel standard is an important piece to solving this puzzle. At Sea-Tac Airport, where emissions are rising, Gov. Inslee pitches low-carbon fuel standard Even as emissions from Seattle-area residents have declined slightly, greenhouse gases attributed to air travel have increased. seattletimes.com", "2020-01-13T18:38:01.000Z": "It's 2020, so it should go without saying:\n\nReproductive rights are human rights. Period.", "2020-01-15T15:54:45.000Z": "Monday marked the beginning of Washington's legislative session. I look forward to working with #waleg to continue our work building a better, fairer Washington all. Q&A | Gov. Jay Inslee on homelessness, climate change and problems with Washington prisons With his presidential campaign behind him, and a run for a third term as governor now on his calendar, Jay Inslee sat for a wide-ranging interview. seattletimes.com", "2020-01-14T21:01:59.000Z": "Thank you to Governor @JayInslee for ensuring Washington will continue to lead on bold, progressive policies to combat our climate crisis! #CleanFuelsNow  #waleg  #StateofTheState Quote Tweet Governor Jay Inslee @GovInslee \"We know this: Washington state is not a state of climate denial. It is a state of climate science acceptance.\n\n\"For those who say we should not take action, I say climate inaction is just as deadly as climate denial.\" #waleg Show this thread", "2020-01-14T22:57:04.000Z": "It sounds daunting, but we've done it before and we can do it again - and more. \n\nIf you're ready to commit to the fight ahead, add your name to join me and fight for a better Washington now: https:// act.jayinslee.com/sign/state-of- the-state-2020/  (8/8) #waleg", "2020-01-14T22:37:31.000Z": "We have our next big challenge ahead: Homelessness. In 2018, Washington had an estimated 22,304 people experiencing homelessness on any given day.\n\nSimply put: We cannot look the other way. We need a plan to combat this. (7/8) #waleg 'We have an obligation to help solve the problem': Inslee calls on Washington lawmakers to reduce... OLYMPIA - Gov. Jay Inslee used the final State of the State address of his term to urge state lawmakers Tuesday to address homelessness and pass a low-carbon fuel standard. Inslee's remarks came on... seattletimes.com", "2020-01-14T22:34:51.000Z": "We've adopted the most aggressive overtime rules in the nation - ensuring protection and fair compensation for workers in Washington. (6/8) #waleg New overtime rules will help restore work-life balance for Washington workers Washington state's new overtime rule is the right thing to do, and it's long overdue. seattletimes.com", "2020-01-14T22:33:42.000Z": "We've passed nation-leading 100% clean energy legislation - good for our climate, for our families, and for our economy. (5/8) #waleg Washington State Commits to Running Entirely on Clean Energy by 2045 If you're depressed by the climate politics of Washington, D.C., may I suggest checking out the other Washington. On Thursday, the state legislature officially passed one of the most ambitious clean... earther.gizmodo.com", "2020-01-14T22:30:26.000Z": "More Washingtonians have a path to a meaningful career thanks to Career Connect and the largest college financial aid grant program in the country, which has helped more than 78,000 people since 2012. (4/8) #waleg Inslee signs package of education bills, ushers in one of the most progressive education Gov. Jay Inslee signed a major education bill Tuesday that establishes one of the most progressive higher education investments in the medium.com", "2020-01-14T22:29:10.000Z": "Washingtonians don't have to choose between a paycheck and being with their family in life's hardest moments. Instead, they can rely on one of the strongest paid family medical leave programs in the nation. (3/8) #waleg Washington state's new Paid Family Leave law takes effect q13fox.com", "2020-01-14T22:23:56.000Z": "We've embraced big ideas that have made Washington the best place to be a worker and do business. \n\nHere's just some of what we've accomplished to make lives better in our state: (2/8) #waleg", "2020-01-14T22:18:53.000Z": "We embrace big ideas in Washington - we don't just imagine them. Last year in our state legislature, we had one of the most productive sessions in the nation. (1/8) #waleg", "2020-01-14T21:04:02.000Z": "On homelessness: \"I believe we have an obligation to help solve the problem. Our compassion will not allow us to look the other way.\" - @JayInslee 'We have an obligation to help solve the problem': Inslee calls on Washington lawmakers to reduce... OLYMPIA - Gov. Jay Inslee used the final State of the State address of his term to urge state lawmakers Tuesday to address homelessness and pass a low-carbon fuel standard. Inslee's remarks came on... seattletimes.com", "2020-01-14T20:03:42.000Z": "Tune in as I give the State of the State address: https:// tvw.org/watch/?eventID =2020011030   #waleg", "2020-01-14T00:46:46.000Z": "I was filled with pride on the House floor today as I watched Speaker Jinkins take the gavel. I look forward to Laurie's leadership and I am grateful for her deep commitment to the rights of disadvantaged communities and access to health care. Our state's future is bright.", "2020-01-14T00:46:45.000Z": "A historic day in Washington: Rep. Laurie Jinkins was sworn in as speaker of the state House of Representatives. She's the first female and openly lesbian speaker in our state's 130 year history. From Drew Mikkelsen", "2020-01-13T21:23:07.000Z": "\"Ferries are an icon of our state-they are on every postcard with Mount Rainier and orcas-and it's time we cleaned them up.\" @JayInslee Washington State ferries go electric. #RenewableEnergy  #cleanenergy Clean transportation advances with hybrid-electric ferries Washington is taking the first steps to clean up one of the biggest pollution sources in state transportation by switching from diesel medium.com", "2020-01-12T02:17:56.000Z": "Washington State's ferries are ditching diesel and going electric! And it's not only good for our climate-it's good for orcas, for taxpayers, and for jobs. Clean transportation advances with hybrid-electric ferries Washington is taking the first steps to clean up one of the biggest pollution sources in state transportation by switching from diesel medium.com", "2020-01-13T18:49:48.000Z": "Welcome back everyone for the 2020 legislative session. I have no doubt that we'll accomplish great things. \n\nI'm excited to see all we can do together this year for Washingtonians. Let's get to work. #waleg", "2020-01-13T19:06:24.000Z": "Should go without saying but must be shouted from the rooftops. Quote Tweet Jay Inslee @JayInslee It's 2020, so it should go without saying:\n\nReproductive rights are human rights. Period.", "2020-01-13T00:28:21.000Z": "The climate crisis is not one issue-it's every issue. Here in the Pacific Northwest, we're proving that everyone, from scientists to shellfish growers, can be part of the solutions. Washington's oysters are a case study of hope in the face of environmental disaster When climate change started killing the Pacific Northwest's oysters by the millions, scientists and growers taught the world how to safeguard an ecosystem. crosscut.com", "2020-01-10T20:26:05.000Z": "If we have any hope of defeating climate change, ending gun violence, or protecting reproductive freedom in the US, one thing is crystal clear: \n\nWe must eliminate the filibuster. The Impact of the Filibuster on Federal Policymaking - Center for American Progress This report looks at the impact of the filibuster on legislative policymaking, describing how the filibuster came to be; its increased use; the disproportionate power it provides to a small segment... americanprogress.org", "2020-01-12T18:17:32.000Z": "Paid family leave is what's right for families. But the reality is that it's great for our economy, too. \n\nJust one more reason I'm proud Washington now has the best paid family and medical leave in the country. https:// marchofdimes.org/news/new-study -reveals-paid-family-leave-policies-lead-to-20-fewer-women-leaving-the-workforce.aspx ", "2020-01-11T16:31:55.000Z": "Earlier this week, I had the honor of welcoming Justice Raquel Montoya-Lewis to the Washington state Supreme Court. \n\nShe brings decades of experience and is exactly the kind of exceptional judge that should be serving on the highest court in our state. Washington's first Native American Supreme Court Justice sworn in Raquel Montoya-Lewis is connected to two tribes. \"It's an overwhelming experience, but it felt wonderful too,\" she said. king5.com", "2020-01-10T18:14:08.000Z": "\"We never want to be a county, we cannot be a country, constitutionally or morally, where citizens are treated differently because they're African-American, Jewish, Iranian-American, you name it.\"\n\nI'm proud to work alongside Lt. Governor @CyrusHabib . 'I'm Iranian-American': Washington Lt. Gov. Cyrus Habib reacts to reports of border detainment Habib is the first and only Iranian-American to hold a statewide elected office in the Unites States. king5.com", "2020-01-09T21:57:20.000Z": "Health care is a human right. And no matter what happens in the other Washington, we will protect and expand health care access for the people of Washington state.", "2020-01-06T19:30:58.000Z": "Washington state's new overtime rule is the right thing to do, and it's long overdue, Joel Sacks, director, Washington State Department of Labor & Industries, writes in an Op-Ed. New overtime rules will help restore work-life balance for Washington workers Washington state's new overtime rule is the right thing to do, and it's long overdue. seattletimes.com", "2020-01-07T01:58:17.000Z": "Congratulations to the newest member of the Washington State Supreme Court, Justice Montoya-Lewis! Quote Tweet Washington Courts @WACourts \"It's quite a view from up here.\" Justice Montoya-Lewis taking her seat on the bench for the first time at the Temple of Justice. Congratulations and welcome to the Washington State Supreme Court!", "2020-01-09T15:46:09.000Z": "\"Washington state is adopting some of the nation's most aggressive overtime rules, restoring protections for hundreds of thousands of salaried workers and taking what supporters say is a crucial step toward rebuilding the middle class.\" Washington OKs some of the nation's toughest overtime rules KOMO 4 TV provides news, sports, weather and local event coverage in the Seattle, Washington area including Bellevue, Redmond, Renton, Kent, Tacoma, Bremerton, SeaTac, Auburn, Mercer Island, Bothell,... komonews.com", "2020-01-08T23:34:53.000Z": "We had some incredible, landmark victories in 2019. And in 2020, I'll be working with #waleg to keep building a better Washington for all. Our top 2019 stories We published 71 stories on Gov. Jay Inslee's Medium site this year. The state's new public health care option snagged our No. 1 most-read medium.com", "2020-01-08T21:09:46.000Z": "When you invest in workers, raise wages, and support unions, you can build the best economy in the nation. I know because we've done it here in Washington.", "2020-01-08T17:45:35.000Z": "\"People should get paid fairly for a hard day's work. And if we work overtime, we expect to get paid for that, too.\" \n\nAnd that's exactly what we're making sure will happen here in WA. New overtime rules will help restore work-life balance for Washington workers Washington state's new overtime rule is the right thing to do, and it's long overdue. seattletimes.com", "2020-01-07T20:35:59.000Z": "Congratulations to Raquel Montoya-Lewis, #WA Supreme Court's newest Justice! As our court's 1st Native American Justice, you give hope & possibility to so many. Thank you for your wisdom in administering true justice. Excellent appointment, @GovInslee ! Inslee appoints first Native American to Washington Supreme Court In a barrier-breaking appointment, Washington Gov. Jay Inslee has selected a Whatcom County judge to serve as the first known Native American justice on... kuow.org", "2020-01-07T19:27:02.000Z": "We must live up to our nation's promises of diversity, equality, and inclusion. In WA, we know our diversity is our strength -  and I'll never stop fighting for the rights and protections of all Washingtonians.", "2020-01-07T16:30:02.000Z": "Governor @JayInslee is rolling out one of the most generous paid family leave programs in the country.\n\nWashingtonians can now access up to 12 weeks a year to care for themselves, a sick/injured family member, or to bond with their newborn. Read more Washington rolls out best paid leave program in the nation The nation's newest - and most generous - Paid Family and Medical Leave program went into effect this week, ushering in significant change medium.com", "2020-01-07T16:07:29.000Z": "This move is reckless and shortsighted. But I'd expect no less from the Trump administration. Trump Rule Would Exclude Climate Change in Infrastructure Planning The administration will propose that federal agencies be allowed to disregard climate change when assessing the environmental effects of major projects. nytimes.com", "2020-01-06T20:54:31.000Z": "Let me be clear: What Americans endured in Blaine this weekend is unacceptable.\n\nNo one should be treated differently due to where they come from, how they look, or what language they speak.\n\nI will continue to stand up for the rights of all Washingtonians. Gov. Inslee on border detainments: 'This will not stand' | Bainbridge Island Review Washington Gov. Jay Inslee said the reports of Iranian-Americans being detained at the U.S.-Canadian border were \"deeply alarming\" as well as bainbridgereview.com", "2020-01-06T23:10:37.000Z": "Stunning! Washington will always be the most beautiful state in my book. Quote Tweet Marv Vandehey @MarvVandehey Mount Rainier on a mostly sunny day with very thin clouds in early autumn, Paradise, Mount Rainier National Park, Washington state. https:// fineartamerica.com/featured/majes tic-mount-rainier-marv-vandehey.html ", "2020-01-06T19:06:21.000Z": "We are so grateful to have leaders in our state like Gov. Jay Inslee on the frontlines of reproductive freedom for ALL Washingtonians! Quote Tweet Jay Inslee @JayInslee We're not just protecting reproductive freedom in our state. We're expanding it. twitter.com/ProChoiceWA/st", "2020-01-06T15:51:13.000Z": "We're not just protecting reproductive freedom in our state. We're expanding it. Quote Tweet NARAL Pro-Choice WA @ProChoiceWA We are so lucky to live in a state where we have not passed a single abortion restriction in the past decade and have only increased the number of providers. http:// bit.ly/39z3LFB  #ProChoiceAndProud  #AbortionIsHealthcare", "2020-01-05T23:04:37.000Z": "If you or someone you know is affected by this, contact our office or use one of these resources listed here to help: Immigration and Refugee Resources President Donald Trump signed a series of executive orders and is implementing numerous policies and actions that have the potential to impact Washingtonians who are working, living, studying or governor.wa.gov", "2020-01-05T23:03:46.000Z": ". @DHSgov has informed my office they did not issue an order to detain or refuse entry to Iranian Americans. However, we are continuing to seek answers from federal officials and talk to those caught at the border.", "2020-01-05T22:59:33.000Z": "My office is closely tracking reports that Iranian Americans, including U.S. citizens and lawful permanent residents, have been detained at the WA-Canada border.", "2020-01-05T17:59:09.000Z": "\"The US remains one of the few developed countries in the world that does not offer a public long-term care insurance program. Only one state-Washington-has created such a benefit.\"\n\nIn WA, we're creating a progressive blueprint for the nation to follow. The 2020s Will Be A Tipping Point For Elder Care In The US The first Baby Boomers will turn 80 in just five years, making the new decade a tipping point in elder care. forbes.com", "2020-01-05T02:41:23.000Z": "Some people say climate action costs too much. But inaction is costing us, dearly, every day. \n\nI'm heartbroken for the people of Australia. Quote Tweet Ed Hawkins @ed_hawkins This remarkable photo was taken in daytime in Victoria, Australia. \n\nAllison Marion takes her sons, wearing masks, out in a boat on the lake to stay safe from the bushfires. #Mallacoota  https:// m.facebook.com/ABCGippsland/posts/10157271660594825  Show this thread", "2020-01-04T20:19:59.000Z": "Paid family and medical leave is all about peace of mind during life's most challenging moments. \n\nFrom now on, Washingtonians won't have to choose between providing for their families or being there when they're needed most. It just makes sense. http:// paidleave.wa.gov", "2020-01-04T19:26:53.000Z": "Many folks don't realize that our new family leave policy includes military leave. If you have a family member leaving for deployment or returning from overseas, you can qualify for paid leave. Find out how paid leave works - Washington State's Paid Family and Medical Leave Washington Paid Family and Medical Leave is available when you need time off to care for yourself or a family member. Learn more about how it works. paidleave.wa.gov", "2020-01-04T18:22:48.000Z": "If you worked 820 hours last year (or about 16 hours per week) in Washington and you experience a qualifying event, you are now eligible for paid leave. It really is that simple.", "2020-01-04T18:01:02.000Z": "Far too often, new parents and those with aging or sick loved ones face no-win decisions - pitting the need for a paycheck against the need to be there for their family. \n\nWe're changing that. Paid leave is now a reality for Washington workers.", "2020-01-04T00:43:32.000Z": "We cannot allow our country to become embroiled in yet another unnecessary war in the Middle East.", "2020-01-03T23:59:11.000Z": "In the past three years, the Trump administration has dismantled a nuclear deal with Iran and brought us to the brink of war, without presenting any plan to achieve a nuclear-free Iran or eliminate threats of violence.", "2020-01-02T23:35:57.000Z": "Unbelievable. The country is on fire and big polluters like you fueled it. Quote Tweet ExxonMobil Australia @exxonmobil_aus Stay safe and have fun this new year, from all of us at ExxonMobil Australia.", "2020-01-02T20:58:38.000Z": "The United States is the only industrialized country in the world that does not offer national paid leave. That's completely unacceptable - so Washington is stepping up. https:// paidleave.wa.gov Quote Tweet Pew Research Center @pewresearch Among 41 countries, only the U.S. lacks paid parental leave https:// pewrsr.ch/2ssTw4F", "2020-01-02T19:32:26.000Z": "We're starting 2020 off by making history. As of January 1, Washington state has the best paid family and medical leave in the nation. Paid time off now available for Washington workers when most needed SEATTLE - The new year brings new benefits for people who are about to have a child or are in the throes of a major medical emergency. Starting Jan. 2, applications will begin to be processed for the... komonews.com", "2020-01-02T17:45:12.000Z": "We are beyond excited that the benefit is available to Washingtonians! If you have experienced a qualifying event, apply now. You've already earned it! http:// PaidLeave.wa.gov/apply-now  #paidleaveWA  #paidleave  #wabiz  #smallbiz", "2020-01-01T22:18:34.000Z": "Happy #NewYear , Washington! Today and every day, I resolve to keep fighting for our shared future - and to build on our unique record of progress and economic success for everyone in our great state.", "2020-01-01T01:24:05.000Z": "As I look back on 2019, there is so much for which to be grateful. \n\nAs I look forward to 2020, I'm optimistic about the promise of all that we will accomplish together. \n\nTrudi and I are wishing everyone a happy and safe #NewYearsEve !", "2020-01-01T00:16:21.000Z": "#WashingtonWins : We've accomplished so much together in 2019. I look forward to continuing our vital work to improve the lives of all Washingtonians in 2020 - and if I earn your vote in November, for another 4 years proudly serving as governor. Jay Inslee for Governor Jay Inslee's thoughtful, steady leadership has built Washington into a state based on the values we all share. jayinslee.com", "2019-12-31T22:28:13.000Z": "#WashingtonWins : And we're not done yet. In 2020, I'll be working with #WALeg and @AGOWA to ban assault weapons in our state. \n\nBecause there shouldn't be weapons of war on our streets. Ferguson, Inslee seek ban on sale of assault weapons Washington Gov. Jay Inslee and Attorney General Bob Ferguson say they want to make mass shootings less likely in the state by banning the sale of high-capacity gun magazines and so-called assault... seattletimes.com", "2019-12-31T21:01:42.000Z": "#WashingtonWins : This and other common-sense gun laws in Washington have already proven to save lives. Quote Tweet Shannon Watts @shannonrwatts Seattle investigators removed a cache of firearms from a man believed to be a leader of the most violent extremist group in the country. They were able to do so thanks to the state's Red Flag law, passed by ballot initiative in 2016. #waleg  https:// nytimes.com/2019/10/17/us/ atomwaffen-kaleb-cole.html ", "2019-12-31T18:30:16.000Z": "#WashingtonWins : This year, we put a ban on ghost guns - which are especially dangerous. These weapons are made with 3-D printers and can go undetected by scanners. New Washington laws target 'ghost guns,' tighten firearm rules The law enacts criminal penalties for owning or buying an undetectable firearm. king5.com", "2019-12-31T17:04:30.000Z": "#WashingtonWins : In 2019, we undertook crucial efforts to protect orcas. These iconic creatures are part of our identity as Washingtonians. Inslee signs bill package to protect, aid, grow orca and salmon population in Salish Sea Gov. Jay Inslee signed five crucial orca recovery bills into law that protect the safety and livelihood of the Southern Resident orca medium.com", "2019-12-31T04:29:18.000Z": "If the last decade was the decade we woke up to the climate crisis, let's make this the decade we defeat it. We have no other option for life as we know it.", "2019-12-31T04:29:04.000Z": "It's well past time to get our political act together. Quote Tweet Jeff Goodell @jeffgoodell Our collective response to the emerging catastrophe verges on suicidal.... \"We are in a race against time,\" says Rep. Jay Inslee. \"Mother Nature isn't sitting around waiting for us to get our political act together.\" @rollingstone , 2010. #thelostdecade  https:// rollingstone.com/politics/polit ics-news/as-the-world-burns-2-199797/ ", "2019-12-31T00:53:02.000Z": "#WashingtonWins : And starting January 1, WA's paid family and medical leave goes into effect. We worked with business owners to develop this historic program.\n\nEach of us deserve time to take care of a new child or a loved one without going broke. Washington begins best paid family and medical leave in country January 1 TACOMA, Wash. -- Washingtonians will be able to access one of the best paid family and medical leave programs in the country come January 1. It provides paid time off when you need it most. Washing... komonews.com", "2019-12-30T22:45:05.000Z": "Our public option - we call it Cascade Care - will ensure that Washingtonians have high-quality healthcare insurance and an option they can afford that is available across the state. #WashingtonWins Washingtonians to get public option on state's health-insurance exchange The Washington governor hailed it as the first such law in the nation and an effort to lower health insurance costs and boost coverage across the state. seattletimes.com", "2019-12-30T19:06:57.000Z": "Long-term care really matters. As the nation's first state program of its kind, it's been called a \"monumental achievement.\" \n\nNo one should have to go bankrupt to get essential care as they grow older. #WashingtonWins Washington Becomes First State to Approve Publicly Funded Long-Term Care The measure is hailed as a monumental achievement for advocates working nationally to tackle the rising and formidable costs of care work and old age. theintercept.com", "2019-12-28T17:30:29.000Z": "#WashingtonWins : In 2019, we were proud to pass the nation's best 100% clean energy bill. Washington State Commits to Running Entirely on Clean Energy by 2045 If you're depressed by the climate politics of Washington, D.C., may I suggest checking out the other Washington. On Thursday, the state legislature officially passed one of the most ambitious clean... earther.gizmodo.com", "2019-12-28T17:22:39.000Z": "As 2019 draws to a close, I'm reminded of everything we accomplished in the great state of Washington this year. Over the next few days, I'll be highlighting some of our biggest #WashingtonWins of 2019. \n\n(I've said it before: Look west for success!)", "2019-12-30T18:06:43.000Z": "In 2019, we had two huge healthcare victories for the people of Washington: passing long-term care and a first-in-the-nation public option. #WashingtonWins Washington state to launch first-in-the-nation health care option for all and new long-term care The 2019 legislative session wrapped up with health care legislation that includes two landmark bills. One creates a public option health medium.com", "2019-12-30T16:53:02.000Z": "#WashingtonWins : While Donald Trump and Republicans continue their assault on our nation's healthcare system, we're protecting and expanding access to affordable healthcare here in Washington state.", "2019-12-30T00:47:42.000Z": "One of my favorite #WashingtonWins of 2019? When @SoundersFC brought the MLS Cup back home to Seattle where it belongs. What an incredible day!", "2019-12-29T17:43:07.000Z": "Washington Career Connect: We're expanding on our work to connect students with learning opportunities that prepare them for high-demand, high-wage jobs - and that doesn't always have to be college. #WashingtonWins Expand career-connected learning across Washington state Washington is building out a stronger system of connecting school students to college and careers. seattletimes.com", "2019-12-29T17:18:06.000Z": "The Washington College Grant: There's a lot of talk around the country about free and reduced college tuition. In WA, we're making it a reality for families in need. \n\nAnd better yet? The companies who rely most on skilled workers will be paying for it. #WashingtonWins", "2019-12-29T16:49:22.000Z": "In 2019, I was proud to sign a suite of education bills into law - and I want to highlight two big wins in particular.\n\nThese two programs are changing the lives of students in our state for the better. #WashingtonWins Inslee signs package of education bills, ushers in one of the most progressive education Gov. Jay Inslee signed a major education bill Tuesday that establishes one of the most progressive higher education investments in the medium.com", "2019-12-29T16:39:42.000Z": "#WashingtonWins : Here in Washington, we know that robust investments in education (and our educators) mean a better future for all of us.", "2019-12-28T19:42:34.000Z": "And we aren't done yet. Next year, we're going to build on that success by focusing on our state's transportation sector in the fight to defeat climate change. #WashingtonWins Inslee focuses on transportation in next stage of climate fight Gov. Inslee proposed several bills to combat climate change including adopting a clean fuel standard and requiring 25% of vehicles sold to be zero-emissions by 2025. king5.com", "2019-12-27T17:48:28.000Z": "Washington state is leading the nation on bold climate action. But we're not done yet. Low-carbon fuel standard, requirements for ride-hailing companies among Gov. Inslee's climate... Gov. Jay Inslee is asking the Legislature to pass a low-carbon fuel standard and other measures to \"align Washington's emission targets with the latest science,\" which would make them more ambitious.... seattletimes.com", "2019-12-26T16:50:19.000Z": "Trudi and I are both passionate about early childhood education. Because when we invest in it, we invest in strong futures for our children.", "2019-12-25T19:05:47.000Z": "Santa outdid himself with this new little bundle of joy under the tree, Anne Hazel Inslee.", "2019-12-25T15:15:10.000Z": "A very merry Christmas from the Inslee family to yours! \n\nWe already got our best gift this year with the birth of our new grandchild, Annie Hazel. Wishing everyone peace and joy this holiday season.", "2019-12-24T19:33:09.000Z": "On January 1, we're making history here in Washington state! Here's what you need to know about Washington's Paid Family and Medical Leave program The state Paid Family and Medical Leave program offers partial wage replacement and covers workers in businesses of all sizes. thenewstribune.com", "2019-12-24T15:34:01.000Z": "What I do while recovering from surgery. (It's a terrible side effect.) \n\nMerry Christmas Eve, everyone!", "2019-12-23T22:34:17.000Z": "\"At a time when the federal government is turning its back on best practices for ending homelessness, we are proud the governor is leading with real solutions and significant new investments in the services that we know work to end homelessness.\" Inslee's budget proposal lays out aggressive plan to combat homelessness statewide Governor proposes to reduce homelessness by 50 percent over the next two years. medium.com", "2019-12-23T18:21:14.000Z": "Washingtonians deserve a choice for cleaner fuels and cleaner cars - and they're going to get both. Inslee announces bold climate legislation as part of supplemental budget rollout Gov. Jay Inslee proposed five pieces of climate legislation and a direct order to a state agency Thursday during his second day of rolling medium.com", "2019-12-22T23:50:14.000Z": "Chag Sameach! Trudi and I are sending warm wishes to all the families celebrating Hanukkah - an important reminder that, through the power of resilience and light, we can always overcome darkness", "2019-12-22T22:06:13.000Z": "\"It's time for the American electorate to make climate change a political do-or-die, up and down the ticket we will need leaders who boldly steer us out of the climate crisis instead of off the cliff.\" The 2020 election must be a time of reckoning on climate change - The Boston Globe American voters should make climate change the priority at the polls. bostonglobe.com", "2019-12-20T00:29:24.000Z": "Thanks @GovInslee for recognizing the continued election security demands by providing critical funding in the 2020 budget! As we embark on a busy election year, these resources will help bolster our state's effort in combating cyber threats. #waleg", "2019-12-22T18:09:56.000Z": "Australia had its hottest day ever on Tuesday. \n\nAnd one day later, it was even hotter - a searing 107.4°F. \n\nThis is a dire warming: We must defeat the climate crisis. Australia all-time temperature record broken again Parts of Australia continue to struggle with record-high December temperatures and raging bushfires. bbc.com", "2019-12-21T21:53:35.000Z": "Take it from a doctor here in Washington:\n\n\"It is time for the medical community to go beyond talking about the harms of climate change and start restructuring its own systems to address the active harm it is causing.\" The health-care sector must address climate change It is time for the medical community to go beyond talking about the harms of climate change and start restructuring its own systems to address the active harm it is causing. seattletimes.com", "2019-12-21T18:15:01.000Z": "Governor @JayInslee has proposed $300 million for tackling the Washington state homelessness crisis, aiming to cut unsheltered homelessness in half statewide.\n \nEvery person should have a roof over their head. Read more: Gov. Inslee proposes slashing unsheltered homelessness in half by spending $300 million Gov. Jay Inslee on Wednesday proposed spending more than $300 million over three years to build emergency shelters and expand housing programs, with the goal of cutting unsheltered homelessness in... seattletimes.com", "2019-12-21T18:47:04.000Z": "Having a career shouldn't stand in the way of starting a family. And we've made sure of that here in WA. \n\nStarting in January, we've made it so parents of newborns can take up to 12 weeks of paid leave - while also protecting small business owners. https:// paidleave.wa.gov/2019", "2019-12-21T00:41:03.000Z": "Translation? We just lived through what will almost certainly be the second-hottest year on record. \n\nWe can't kick the can down the road on the climate crisis any longer. Quote Tweet Gavin Schmidt @ClimateOfGavin With Nov GISTEMP anomalies posted, 2019 is #2 YTD, and this will be 99.9% likely to be the ranking for the full year. \n- 5th year clearly > 1°C above late 19th C\n- closes out warmest decade in record", "2019-12-20T19:02:32.000Z": "While Donald Trump keeps trying to drag us backwards, Washington state will continue to fight back for our nation's future. Quote Tweet Washington State Attorney General @AGOWA AG Ferguson: \"The Trump Administration continues to assault sound, scientifically supported environmental policy.\" More info: https:// atg.wa.gov/news/news-rele ases/ag-ferguson-asks-court-block-epa-s-attempt-repeal-clean-water-rule ", "2019-12-19T22:45:38.000Z": "Jay Inslee isn't done with innovative climate policy Quote Tweet Governor Jay Inslee @GovInslee WA is leading the climate fight. But we have more work to do. \n\nIt's time for our next wave of climate action like: Tougher GHG emission limits Clean fuel standards More electric vehicles on the road Community-based solar incentives https:// link.medium.com/bgBU1HMny2", "2019-12-20T16:45:33.000Z": "Washington is a progressive beacon for our nation. And we've built a strong economy by looking out for workers - not in spite of it. Three big changes should benefit Washington workers beginning in 2020 Starting next year, thousands more people will be paid when they work overtime, will be free to switch jobs as they wish, and will be covered for time away from work to care for their families or... seattletimes.com", "2019-12-20T01:05:51.000Z": "Inslee focuses on transportation in next stage of climate fight Inslee focuses on transportation in next stage of climate fight Gov. Inslee proposed several bills to combat climate change including adopting a clean fuel standard and requiring 25% of vehicles sold to be zero-emissions by 2025. king5.com", "2019-12-19T23:17:48.000Z": "\"With today's order, @GovInslee is living up to his commitment to climate leadership\"\n\nIn Groundbreaking Directive, Inslee Calls for Comprehensive Climate Analysis of Proposed Fossil Fuel Projects: In Groundbreaking Directive, Inslee Calls for Comprehensive Climate Analysis of Proposed Fossil... Today, Governor Jay Inslee directed the Washington State Department of Ecology to adopt new rules that would apply the most current climate science to environmental assessments and ensure that the... sierraclub.org", "2019-12-19T21:46:10.000Z": "Thank you @JayInslee for including funding for crucial gun violence prevention work in your proposed budget! https:// ofm.wa.gov/sites/default/ files/public/budget/statebudget/highlights/budget20/2020_ReduceFirearmViolence.pdf ", "2019-12-19T23:37:47.000Z": "Without meaningful action on the climate crisis, the road ahead will (quite literally) be a rough one. As climate change melts Alaska's permafrost, roads sink, bridges tilt and greenhouse gases release The accelerating melt is a global concern: Permafrost, which mostly lies in the northern reaches of the planet, is a vast carbon storehouse of frozen plants and animals that release greenhouse gases... seattletimes.com", "2019-12-19T20:13:49.000Z": "Yesterday, the House took a historic step to defend our democracy and our American values. Donald Trump has threatened our national security, exploited our diplomatic relations, and abused the office of the president for his own, selfish political gain.", "2019-12-19T01:12:40.000Z": "Difficult to understand how refusing to allow witnesses to testify under any circumstance is consistent with the Constitution. Quote Tweet House Intelligence Committee @HouseIntel President Trump \"is preventing the testimony of witnesses with direct knowledge of the events under investigation. If the President were innocent, as he claims, surely these witnesses would be able to testify to that.\" - @CongressmanRaja", "2019-12-18T21:38:27.000Z": "Everyone in Washington should be able to benefit from our state's shared prosperity. \n\nHomelessness is a statewide problem and we're going to implement a statewide solution. Inslee's budget proposal lays out aggressive plan to combat homelessness statewide Governor proposes to reduce homelessness by 50 percent over the next two years. medium.com", "2019-12-18T18:53:30.000Z": "Agreed. Quote Tweet MSNBC @MSNBC Jake Levine, fmr. climate aide to Pres. Obama: \"If we had a president who exhibited even half of the leadership that Greta Thunberg has shown, or even half of her intelligence or half of her moral clarity on this issue, we'd be in a much different place.\" https:// on.msnbc.com/2rUtcQS", "2019-12-16T18:06:59.000Z": "Yep. @JayInslee listened to thousands of workers in WA who were asking for more time, money, or a bit of both. Flexibility and work-life balance can't just be for the rich. Reviving our overtime rules should be a baseline Dem party position. Quote Tweet Michael Tomasky @mtomasky New Column: Jay Inslee did something last week that Dem candidates *really* need to pay attention to, and it had nothing to do with climate change. @NickHanauer  https:// thedailybeast.com/everyone-feels -overworked-and-underpaid-why-arent-the-democratic-presidential-candidates-talking-about-it?source=twitter&via=desktop  via @thedailybeast", "2019-12-17T23:24:19.000Z": "We are working diligently for a day where no one in Washington state loses a friend or family member to gun violence. Quote Tweet Gun Responsibility @WaGunResponsib Last week, @BobFergusonAG and @JayInslee announced a package of gun safety policies they are advocating for next session. On their agenda and ours: restricting access to high-capacity magazines and strengthening standards for purchasing ammo. https:// komonews.com/news/local/mas s-shootings-renew-interest-in-adding-washington-gun-safety-measures?fbclid=IwAR3L9szG7tXKfTi1vFQwBkWsDgVfBqLiNNpoGEmx1DPB2KQf3QlqkgTwW2o   #waleg", "2019-12-16T22:02:01.000Z": "The Daily Beast calls @JayInslee 's new overtime rule \"the country's most sweeping and comprehensive set of regulations regarding overtime pay for middle-class workers.\"\n\nProud of my state for making sure workers get paid fairly for the hours they work. Everyone Feels Overworked and Underpaid. Why Aren't the Democratic Presidential Candidates Talking... \"Overtime pay is for the middle class what the minimum wage is for the working class.\" thedailybeast.com", "2019-12-17T19:02:55.000Z": "Next year's election is important for the future of our country and our democracy.\n\nIt's clear that our votes will also help decide the future of climate action on a global scale. #COP25 United Nations climate talks collapse after Trump shuns Paris pact Other countries are \"waiting for the U.S. election,\" one diplomat lamented. politico.com", "2019-12-17T00:10:35.000Z": "\"Last Wednesday, Gov. Jay Inslee put into effect the country's most sweeping and comprehensive set of regulations regarding overtime pay for middle-class workers.\"\n\nI know this: To build a strong economy, you must build a strong middle class. Everyone Feels Overworked and Underpaid. Why Aren't the Democratic Presidential Candidates Talking... \"Overtime pay is for the middle class what the minimum wage is for the working class.\" thedailybeast.com", "2019-12-11T21:41:47.000Z": "My district & #WA state has made great strides in protecting worker rights, and @GovInslee 's leadership on this issue is the step in the right direction. \n \nWe must respect workers and ensure they are paid fairly for their time. Washington now leads nation with overtime protections for workers The Department of Labor and Industries announced a nation-leading overhaul Wednesday that restores overtime protections for thousands of medium.com", "2019-12-16T17:21:38.000Z": "We must protect what we love. We must protect what we value. And that doesn't happen accidentally. It requires action. It's a choice. https:// rei.com/blog/stewardsh ip/washington-gov-jay-inslee-want-to-fight-climate-change-experience-what-were-fighting-for ", "2019-12-15T23:32:57.000Z": "We owe it to our kids and grandkids to do better and to do more to defeat this crisis. Carbon Dioxide Emissions Hit a Record in 2019, Even as Coal Fades Global consumption of coal declined unexpectedly this year, but a surge in oil and gas pushed up greenhouse gas emissions over all. nytimes.com", "2019-12-10T17:20:03.000Z": "Friends of the Earth Action is proud to endorse environmental champion @JayInslee for reelection as Washington governor!\n\nTo solve the climate crisis, we need more elected officials like him who will fight every day for people and the planet. https:// foeaction.org/news/friends-e arth-action-endorses-progressive-incumbents-2020-democratic-primaries/ ", "2019-12-15T18:25:52.000Z": "Climate change is not just one issue - it's every issue. It impacts every part of our lives. How Rising Temperatures Due to Climate Change are Shortening Pregnancies Paying a price even before birth time.com", "2019-12-11T20:19:14.000Z": "Thank you Governor @JayInslee for ensuring thousands of workers will be fairly compensated for their hard work! Quote Tweet Governor Jay Inslee @GovInslee WA is restoring overtime protections for thousands of workers. \n\nThanks to these updates, our rules are now the most progressive in the nation. https:// medium.com/wagovernor/was hington-now-leads-nation-with-overtime-protections-for-workers-ec00b378b810 ", "2019-12-14T20:34:08.000Z": "Domestic abusers should not have access to a firearm. Ever. Domestic Violence & Firearms in Washington | Giffords Law Center to Prevent Gun Violence Firearm Prohibitions for Domestic Violence Misdemeanants in Washington Washington prohibits possession of a firearm by anyone who has been convicted or found not guilty by reason Read more lawcenter.giffords.org", "2019-12-14T00:05:44.000Z": "Michelle Obama's words of kindness, empowerment, and truth break through the noise of juvenility and hate. Greta, the world and history are on your side. \n\nNot to mention, with Michelle and Greta on the same team, that's what we call a powerhouse. Quote Tweet Michelle Obama @MichelleObama . @GretaThunberg , don't let anyone dim your light. Like the girls I've met in Vietnam and all over the world, you have so much to offer us all. Ignore the doubters and know that millions of people are cheering you on.", "2019-12-13T18:37:09.000Z": "As a member of Congress in 1994, I voted for the assault weapons ban. It cost my my seat. But it was the right thing to do then and it's the right thing to do now.\n\nWeapons of war should have no place in our streets, our schools, or our places of worship. Ferguson, Inslee seek ban on sale of assault weapons Washington Gov. Jay Inslee and Attorney General Bob Ferguson say they want to make mass shootings less likely in the state by banning the sale of high-capacity gun magazines and so-called assault... seattletimes.com", "2019-12-13T17:10:40.000Z": "A bad internet connection should not limit any Washingtonian's ability to learn, innovate, or connect - whether it is students researching ideas at home, first responders handling an emergency, or entrepreneurs launching a business.", "2019-12-13T02:06:55.000Z": "We've made incredible progress in Washington, from tuition-free college, to a statewide public healthcare option, to dramatically reducing our carbon footprint. Can you help us defend and expand on our progress and donate today? Fundraising Freeze: Deadline December 13 Because of the Washington state legislative freeze, Jay can't raise any money until the legislative session ends in the spring. secure.actblue.com", "2019-12-12T16:53:49.000Z": "Workers should be paid fairly for the hours they work. That's why I'm proud to announce an overhaul of our state's overtime rules.\n\nWA's workers will now be protected by the strongest overtime rules in the nation - making 400k salaried workers eligible for overtime pay by 2028. Quote Tweet Civic Action @civicaction On behalf of the #RestoreOT coalition and over 400,000 workers in Washington, thank you @GovInslee for your leadership on creating the strongest overtime rule in the country. #Demcast  #DemcastWA Show this thread", "2019-12-11T22:33:06.000Z": "The internet allows students to connect with researchers all around the world. It allows small businesses to compete in the global marketplace. It's allowed the free flow of information and ideas in one of the greatest demonstrations of free speech in our history.", "2019-12-11T17:33:40.000Z": "Earlier this year, I was proud to launch Career Connect Washington to make sure young people in our state are connected to high-demand, high-wage careers. Expand career-connected learning across Washington state Washington is building out a stronger system of connecting school students to college and careers. seattletimes.com", "2019-12-10T20:35:42.000Z": "On December 13 at midnight, my campaign has to stop all fundraising for at least three full months because of Washington's legislative freeze. Can you chip in before the freeze and help us keep our momentum strong? Fundraising Freeze: Deadline December 13 Because of the Washington state legislative freeze, Jay can't raise any money until the legislative session ends in the spring. secure.actblue.com", "2019-12-10T16:58:16.000Z": "From gerrymandering, to voter suppression, our democracy is being attacked across the country. @DemGovs ' Every State Every Vote will fight to make sure every voice is heard in our elections. Thank you to my friends @OregonGovBrown and @StaceyAbrams for leading this effort. Quote Tweet Democratic Governors @DemGovs ICYMI: This morning we launched Every State, Every Vote with @FairFightAction , @OregonGovBrown and @StaceyAbrams to protect voters and increase ballot access across the country. http:// EveryStateEveryVote.com", "2019-12-10T00:08:15.000Z": "Exactly. Quote Tweet Prof. Katharine Hayhoe @KHayhoe \"I'm passionate about climate change for the same reason people who are drowning are passionate about lifeguards.\" - @JimmyKimmelLive", "2019-12-09T17:50:35.000Z": "Access to quality, affordable broadband internet creates jobs, improves public safety and health services, and increases education opportunities. And here in Washington, we're making sure every corner of the state has equal access.", "2019-12-08T22:59:26.000Z": "The NRA is a dangerous, extremist organization that profiteers off of gun violence. We have them on the run here in Washington. But we're not done yet. Governor Inslee Signs Package of Gun Violence Prevention Bills Into Law - Alliance for Gun Respon... OLYMPIA, WA - This morning, Governor Jay Inslee signed seven gun violence prevention bills into law. This marked the end of the most successful legislative session in the Alliance for Gun Responsib... gunresponsibility.org", "2019-12-08T00:48:33.000Z": "America's largest ferry fleet is going all-electric. @JayInslee and Washington state continue to show the nation what bold climate action looks like. World's Second-Largest Ferry Operator Switching From Diesel to Batteries Washington State Ferries consumes as much fuel as a midsized airline. greentechmedia.com", "2019-12-07T23:18:22.000Z": "\"For a few hundred dollars, tools and some elbow grease, you can make your own rifle or handgun. It's all perfectly legal.\"\n\nNot here in Washington. Earlier this year, we banned dangerous ghost guns. Washington Post: Breaking News, World, US, DC News & Analysis Breaking news and analysis on politics, business, world national news, entertainment more. In-depth DC, Virginia, Maryland news coverage including traffic, weather, crime, education, restaurant... washingtonpost.com", "2019-12-05T18:45:00.000Z": "\"In the face of a federal default on climate, the initiative passes to governors,\" writes Washington Governor @JayInslee . How States Are Leading on Climate Action In the face of a federal default on climate, the initiative passes to governors. prospect.org", "2019-12-07T19:24:19.000Z": "Not possible. It's out of this world. https:// twitter.com/molly_quinton/ status/1201208592751153152  This Tweet is unavailable.", "2019-12-07T15:39:28.000Z": "\"This is a matter of public health, of clean air, of clean water, of our children, of the survival of our economies, of the prosperity of the world, of national security, justice and equality.\" - @SpeakerPelosi US Congress commits to act on climate crisis, despite Donald Trump Nancy Pelosi tells UN conference in Madrid that commitment is 'iron-clad' theguardian.com", "2019-12-06T23:52:09.000Z": "Not a bright statement. Quote Tweet The Washington Post @washingtonpost Trump jokes that environmentally friendly lightbulbs \"gives you an orange look.\"\n\n\"I hate to say it, it doesn't make you look as good. Of course, being a vain person that's very important to me.\" Show this thread", "2019-12-06T17:54:05.000Z": "For 30 days leading up to the Washington state legislative session and for every day during session, our campaign can't raise any money.  \n\nWe set an aggressive goal that will fuel us through this big freeze. Can you chip in today? Fundraising Freeze: Deadline December 13 Because of the Washington state legislative freeze, Jay can't raise any money until the legislative session ends in the spring. secure.actblue.com", "2019-12-05T22:15:11.000Z": "Washington just got a little more wonderful with our newest citizen, Anne Hazel Inslee - Trudi and my fourth grandchild. Connor and Claire will be incredible parents. Joy all around!", "2019-12-05T19:40:51.000Z": "Best State, Best Governor - I'm happy to tell everyone that @JayInslee  @washdems Quote Tweet Jay Inslee @JayInslee \"Turns out Washington isn't just good, it's the best.\"\n\nI could have told 'em that. https:// bellinghamherald.com/news/state/was hington/article238034469.html ", "2019-12-05T18:22:46.000Z": "\"Turns out Washington isn't just good, it's the best.\"\n\nI could have told 'em that. Our secret is out - Washington tops list of this Best States ranking A study released by governing.com earlier this year found that people are moving to Washington state at such a rate that a number of counties actually have fewer native Washingtonians than adults who... bellinghamherald.com", "2019-12-04T20:41:02.000Z": "Our #DemGovs are providing their constituents with resources to thrive.\n\nThe Trump administration? They're doing what they've done since day one-hurting the most vulnerable among us. Quote Tweet Governor Jay Inslee @GovInslee For the third time this year, the Trump administration is cutting food assistance to vulnerable people across the country. \n\nTheir rule is cruel, short-sighted and will do real harm to Washingtonians. \n\nMy letter to Secretary Perdue: https:// governor.wa.gov/sites/default/ files/FINAL%20SUA%20Standardization%20Response.pdf ", "2019-12-04T20:37:30.000Z": "\"I was honored to attend today's historic announcement. Judge Montoya-Lewis is a respected jurist who will be a tremendous addition to the court. She also brings a unique perspective on issues facing rural and tribal communities, and I know she will serve our state well.\" -BF Quote Tweet Governor Jay Inslee @GovInslee I'm honored to appoint Judge Raquel Montoya-Lewis to the WA State Supreme Court. She brings 20 years of judicial experience and a commitment to children's and tribal issues.\n\nShe will also be the first Native American Supreme Court justice in WA history. https:// medium.com/wagovernor/ins lee-names-first-native-american-to-washington-state-supreme-court-3ef83769d961 ", "2019-12-04T22:59:43.000Z": "Congratulations to newly-appointed Justice Raquel Montoya-Lewis, who will be the first Native American justice on our Supreme Court! Quote Tweet The Seattle Times @seattletimes NEW: Gov. Jay Inslee has appointed Whatcom County Superior Court Judge Raquel Montoya-Lewis to the Washington State Supreme Court.\n\nThe appointment makes Montoya-Lewis, 51, the first Native American justice on the court. (via @OlympiaJoe ) https:// st.news/2reBGCe", "2019-12-04T20:00:03.000Z": "Today, I was proud to appoint Judge Montoya-Lewis to the WA Supreme Court. She embodies intelligence, courage, compassion, temperament, and fairness. \n\nIt's also historic! Judge Montoya-Lewis will be the first Native American to sit on our Supreme Court. https:// opb.org/news/article/w ashington-supreme-court-first-native-american-justice-jay-inslee-appointment/ ", "2019-12-01T23:30:06.000Z": "It's simple: Reproductive rights are human rights. Period.", "2019-12-03T16:43:32.000Z": "I want to be very, very crystal clear: He's lying. Quote Tweet Aaron Rupar @atrupar TRUMP: \"Climate change is very important to me. I've done many environmental impact statements over my life and I believe very strongly in very, very crystal clear, clean water and clean air. That's a big part of climate change.\" Show this thread", "2019-12-03T22:35:09.000Z": "The Trump administration wants to gut the #ACA , jeopardizing health coverage for hundreds of thousands of Washingtonians. Thank you to @GovInslee and @WA_OIC for working to #ProtectOurCare and raising the alarm about what this lawsuit means for our state. Quote Tweet Governor Jay Inslee @GovInslee Thanks to the #ACA , 800,000 people in WA gained affordable health coverage.\n \nA Trump administration backed lawsuit would reverse all that progress. @OIC_WA Mike Kreidler, Exchange CEO Pam MacEwan and I shared what's at stake. http:// governor.wa.gov/news-media/sta te-leaders-warn-congressional-delegation-pending-health-care-lawsuit  Show this thread", "2019-12-03T20:51:36.000Z": "Sen. @KamalaHarris has fought resolutely for justice her entire career, and her environmental justice plans raised the bar for climate action, in this race and beyond.\n\nKamala, your passion and commitment to fighting #ForThePeople make our party stronger. Thank you.", "2019-12-03T16:44:51.000Z": ". @realDonaldTrump , here's your environmental impact report. No president has wreaked more havoc on our air, water, and climate than you have. The Trump Administration Is Reversing 100 Environmental Rules. Here's the Full List. A New York Times analysis found nearly 70 environmental policies officially rolled back under Mr. Trump, with more than 30 rollbacks still in progress. nytimes.com", "2019-12-03T15:11:01.000Z": "#DemGovs like Governor @JayInslee are committed to protecting and expanding voters' access to the ballot box. Quote Tweet Jay Inslee @JayInslee \"Washington state is leading the pushback against national moves to curtail ballot access.\"\n\nWhen we protect voter rights, we protect our democracy. And last year, we made big moves to not only protect voter rights in WA - but to expand them. (1/8) https:// motherjones.com/politics/2018/ 03/all-of-a-sudden-voting-rights-are-expanding-across-the-country/  Show this thread", "2019-12-03T00:04:50.000Z": "\"Climate change is the most extreme human rights challenge of our time, and a human rights-based approach is needed to solve it.\"\n\nThank you, President Carter. Jimmy Carter: How Empowering Women and Girls Can Help Solve the Climate Crisis We have to think bigger, act quicker, and include everyone, writes the former President time.com", "2019-12-02T20:16:50.000Z": "When we fight and we vote, we win. Well said, @StaceyAbrams . Quote Tweet NAACP @NAACP \"We will fight to protect our right to vote, because when we fight and we vote we win!\" - @StaceyAbrams  #DemDebate  #WhenWeFightWeWin GIF", "2019-12-02T17:17:21.000Z": "We put footprints on the moon.\nWe were the first in flight. \nWe invented the internet. \n\nDon't ever doubt the United States can solve the climate crisis, too. World is heading toward irreversible climate 'tipping point,' researchers say Scientists are calling for urgent international action to avoid \"an existential threat to civilization.\" cnn.com", "2019-12-01T21:17:08.000Z": "World War Zero will mobilize Americans across the political spectrum, proving that we can find common ground to take climate action. \n\nThank you for your tireless dedication to defeating this crisis, Sec. @JohnKerry . John Kerry Launches Star-Studded Climate Coalition John Kerry and a group that includes some Republicans, some military members and a lot of Hollywood, are launching a new coalition to push for public action on climate change. nytimes.com", "2019-12-01T17:45:51.000Z": "The right to vote is the foundation of our democracy. Here in Washington, we're protecting and expanding voting rights - just like we should be around the country.", "2019-12-01T01:36:25.000Z": "John Kerry is using his political capital to solve the climate crisis. Thank him John Kerry Launches Star-Studded Climate Coalition John Kerry and a group that includes some Republicans, some military members and a lot of Hollywood, are launching a new coalition to push for public action on climate change. nytimes.com", "2019-12-01T01:27:50.000Z": "The kids are (more than) alright. Hundreds of thousands of students join global climate strikes Large turnouts in Madrid before UN summit, and in Sydney after deadly wildfires theguardian.com", "2019-11-30T22:47:39.000Z": "Washington is the first state in the nation to protect #NetNeutrality . Because whatever Donald Trump does in the other Washington, we'll do what's right here at home. Washington's Net Neutrality Laws Could Help Keep the Internet Fair As the nation battles for the internet's soul, Washington's network neutrality rules can be a model for other states. seattlemet.com", "2019-11-22T17:29:31.000Z": "You know what you call a solar spill? A nice day. Keystone pipeline spill affecting nearly 10 times more land than The Keystone pipeline spill has affected nearly 10 times more land in eastern North Dakota than first thought, officials told The Hill Monday. thehill.com", "2019-11-30T02:13:53.000Z": "President Cauce sure knows how to clutch an #AppleCup trophy to prevent fumbles. Congrats to the Dawgs. (And go Cougs!)", "2019-11-29T23:42:23.000Z": "The Husky band played the Cougar fight song in honor of the Cougar band playing \"Bow Down\" last year. A united state! #AppleCup2019", "2019-11-27T01:03:51.000Z": "Climate change is a winning issue for Democrats. \nClimate change is a winning issue for Democrats. \nClimate change is a winning issue for Democrats. Young Republicans think GOP boomers are on the wrong side of the climate debate 52% of millennial Republicans say the federal government does too little to reduce the effects of climate change. qz.com", "2019-11-29T21:07:28.000Z": "A house divided. #AppleCup", "2019-11-28T23:25:49.000Z": "Our annual Thanksgiving game produced many touchdown passes - but not enough for my team to take the win! \n\nI hope everyone is having a wonderful holiday with their family and friends.", "2019-11-28T19:50:53.000Z": "From our family to yours, we're wishing everyone a very happy Thanksgiving full of joy and gratitude (and of course, turkey and mashed potatoes.)", "2019-11-27T20:02:12.000Z": "Bill Ruckelshaus was a pillar of integrity. His unwavering commitment to the Constitution, his deep concern for the natural world and his leadership will be greatly missed.  \n\nThere was no one in Washington state with a stronger environmental legacy. William Ruckelshaus, Who Quit in 'Saturday Night Massacre,' Dies at 87 As deputy attorney general he refused Nixon's order to fire the special prosecutor Archibald Cox in the Watergate scandal. He was earlier the E.P.A.'s first leader. nytimes.com", "2019-11-27T20:45:42.000Z": "This week, we're offering a special extended cut of our interview with @JayInslee . Listen now: https:// climate2020podcast.com/episodes/episo de-10 ", "2019-11-27T23:30:20.000Z": "Here in Washington, we're proud to be protecting voter rights and our democracy. \n\nDo your part, too, and register to vote today. (8/8) Register to Vote in Washington State The Secretary of State is the state's chief elections officer, chief corporations officer, and supervisor of the State Archives and State Library. sos.wa.gov", "2019-11-27T23:26:45.000Z": "\"Voters have a right to know who is influencing our elections. While the Trump admin is taking action to reduce transparency and increase the opportunity for corruption, we are focused on increasing accountability and strengthening our democracy.\" (7/8) http:// sdc.wastateleg.org/billig/2018/07 /17/washington-state-disclose-act-ensures-election-transparency-despite-federal-action ", "2019-11-27T23:23:15.000Z": "Campaign finance transparency: Dark money has no place in our state's elections. \n\nThat's why I was proud to sign the DISCLOSE Act into law, which mandates that every nonprofit is transparent about the money it spends on our elections. (6/8)", "2019-11-27T23:09:46.000Z": "WA Voting Rights Act: Every voice deserves to be heard in our elections, but communities of color often don't get fair representation. \n\nThis law promotes more equal representation by allowing district-based elections or other voting systems to best suit each community. (5/8)", "2019-11-27T22:54:32.000Z": "Same day registration: Here in Washington, everyone can register to vote all the way up until Election Day. And that's how it should be in every state in the union. (4/8)", "2019-11-27T22:28:07.000Z": "Pre-registration for 16 and 17-year olds: Young Washingtonians can pre-register to vote so that the day they turn 18, their voices can be heard. It just makes sense. (3/8)", "2019-11-27T21:54:45.000Z": "Automatic voter registration: When you get a license or ID card here in WA, you're automatically registered to vote. It's imperative that we make it easier to vote, especially when voter suppression efforts are influencing elections across the US. (2/8) What you need to know about Washington's new same-day voter registration Washington now joins 20 other states and the District of Columbia in having some form of same-day registration. Proponents hope it will boost turnout and voter participation. seattletimes.com", "2019-11-27T20:47:23.000Z": "\"Washington state is leading the pushback against national moves to curtail ballot access.\"\n\nWhen we protect voter rights, we protect our democracy. And last year, we made big moves to not only protect voter rights in WA - but to expand them. (1/8) All of a sudden, voting rights are expanding across the country Washington state is leading the pushback against national moves to curtail ballot access. motherjones.com", "2019-11-27T14:35:15.000Z": "Big polluters knew the reality of climate change long ago.\n\nThey spent millions to hide it. \n\nThey must be held responsible. Big Coal Trashed the Climate and Got Away With It It wasn't just Big Oil that misled the public for decades rollingstone.com", "2019-11-25T19:29:24.000Z": "We're less than three weeks away from our legally mandated fundraising freeze.\n\nOn December 14th, we have to stop fundraising for nearly four months during the Washington state legislative session.\n \nCan you help power our campaign and chip in today? Deadline: November 27 Donate now to support Jay before the freeze next month! secure.actblue.com", "2019-11-26T21:19:01.000Z": "Facts from Governor @JayInslee Quote Tweet Governor Jay Inslee @GovInslee The Trump administration's proposal to remove key methane emission limits is indefensible.\n \nIt threatens our public health, ignores the EPA's own science and increases the likelihood of catastrophic climate impacts. https:// npr.org/2019/08/29/755 394353/epa-aims-to-roll-back-limits-on-methane-emissions-from-oil-and-gas-industry ", "2019-11-26T22:52:33.000Z": "We have no time to waste to avoid the worst impacts of climate change. The @EPA 's unwinding of regulations on big polluters is an outrageous abdication of duty to protect the American people. EPA Aims To Roll Back Limits On Methane Emissions From Oil And Gas Industry \"This would be a huge step backward,\" said one environmental advocate. \"It would cause greatly increased pollution.\" The Trump administration says it will help the oil and gas industry save money. npr.org", "2019-11-26T19:34:16.000Z": "Our democracy is stronger when more people participate. That's why I was proud to make universal voter registration a reality here in Washington. Wash. gov signs universal voter registration law Washington Gov. thehill.com", "2019-11-25T22:24:00.000Z": "More than 80 environmental rules and regulations have been rolled back since Trump took office.\n \nNow, more than ever, we need to #ElectDemGovs - our strongest line of defense against policies that hurt our environment and threaten our future. Quote Tweet Governor Kate Brown @OregonGovBrown Oregon's clean air and water are part of what makes our state a great place to live, work, and play. We must stand up to the federal government's proposed changes of the Clean Water Act - which would impact water quality in Oregon. https:// myoregon.gov/2019/11/23/deq -opposes-rollbacks-of-clean-water-act-regulations/ ", "2019-11-24T18:23:22.000Z": "\"The reason we've been so successful is because we have elected so many women to the Washington State Legislature.\" Preach it, @JayInslee (and let's go elect some more). #electwomen", "2019-11-25T02:49:18.000Z": "In Washington, we're making publicly funded long-term care a reality - and that's not just great for seniors, it's a big step forward for homecare workers. \n\nEvery single one of us deserves the right to join a union, fair pay, and good benefits. #UnionsForAll Quote Tweet SEIU @SEIU #HomeCare workers like Debra are joining together and creating better jobs and raising care standards. That's why she wants presidential candidates to support affordable long term care and #UnionsForAll . RT if you agree: http:// seiu.org/homecare", "2019-11-24T15:29:28.000Z": "\"We're in a deep hole over the climate crisis and we need to stop digging.\" Fossil fuel production on track for double the safe climate limit 'We're in a deep hole over the climate crisis and we need to stop digging,' warn experts theguardian.com", "2019-11-23T23:53:08.000Z": "Exactly. And that's why, here in Washington, we're making publicly funded long-term care a reality. Quote Tweet Caring Across Generations @CaringAcrossGen Living longer is a blessing! But our supports and policies need to match up to our new demographic realities. twitter.com/josephcoughlin", "2019-11-23T18:39:51.000Z": "Our nation's farmers, the people who make sure we have food on our plates, are bearing much of the burden of climate change. That must stop. Quote Tweet Christopher Flavelle @cflav Heavy rains made 2019 an exceptionally brutal year for agriculture, writes @jswatz : 13% of corn acreage went unplanted, and bankruptcies are up 24%. \n\nAnother reminder that climate change will ripple through the economy. http:// nytimes.com/2019/11/21/cli mate/farms-climate-change-crops.html ", "2019-11-22T22:04:49.000Z": "Apples have long been a core part of the Washington story. Glad to see these folks preserving a slice of \"homesteader history.\" Botanists scour old Northwest homesteads for long-lost apple varieties The two botanists with the nonprofit Lost Apple Project scour county fair records, newspaper clippings and nursery sales ledgers to figure out which varieties existed in the area. The task is huge.... seattletimes.com", "2019-11-21T22:45:10.000Z": "One question is better than none - but it's still not enough.\n\nIt's clear to me that the candidates are ready to talk about climate change.\n\nModerators have a duty to ask early and often how our next president will defeat this crisis. #DemDebate Climate change gets a single question at the fifth Democratic debate But candidates still found ways to bring it up. grist.org", "2019-11-21T03:15:00.000Z": "PNW Pride. @CristianRoldan x @GovInslee", "2019-11-21T17:58:31.000Z": "As @saritasgupta said, \"We have really been trying to help people go from seeing care work as an individual burden to a shared responsibility that we're all going to face.\"\n\nHere in WA, we're rising to that responsibility. We aren't leaving our seniors or caregivers behind. (5/5)", "2019-11-21T17:53:29.000Z": "Home health care workers, and the essential services that they provide, are consistently undervalued. We're changing that and investing in caregivers here in Washington. (4/5)", "2019-11-21T17:51:29.000Z": "Long-term care is not only a huge step forward for taking care of seniors. It's also a step in the right direction for our state's caregivers. (3/5)", "2019-11-21T17:47:46.000Z": "Health care, at any age, is a right - not a privilege. But long-term care is out of reach for most people.\n\nBut starting in 2022, Washingtonians can receive up to $36,500 to ease the burden of paying for a caregiver, nursing home, dementia support, transportation, and more. (2/5)", "2019-11-21T17:45:19.000Z": "No one should have to go bankrupt to get essential care as they  grow older. \n\nThat's why earlier this year, I signed the nation's first publicly funded long-term care into law - a huge step in improving the lives of people in Washington. (1/5) Washington Becomes First State to Approve Publicly Funded Long-Term Care The measure is hailed as a monumental achievement for advocates working nationally to tackle the rising and formidable costs of care work and old age. theintercept.com", "2019-11-20T22:57:12.000Z": "It's long been clear. But it's never been more more clear than today: \n\nDonald Trump is unfit for office. He must be impeached. #ImpeachmentHearing", "2019-11-20T19:13:55.000Z": "Don't \"hope\" for a climate question.\n\nDemand a climate question. (Or better yet: multiple!) #DemDebate Quote Tweet Jay Inslee @JayInslee There were zero questions about climate during the last debate. And certainly not enough time focused on climate in the debates before that, either.\n\nThis will only change if we come together and demand it. Add your name today. #DemDebate  https:// act.jayinslee.com/sign/pres-clim ate-debate?utm_source=twitter&utm_campaign=debate-2&utm_medium=social ", "2019-11-20T18:35:18.000Z": "There were zero questions about climate during the last debate. And certainly not enough time focused on climate in the debates before that, either.\n\nThis will only change if we come together and demand it. Add your name today. #DemDebate Add Your Name: Demand Climate-Focused Questions and Answers from the DNC Debate act.jayinslee.com", "2019-11-19T21:45:02.000Z": "Governor @JayInslee is expanding paid family leave and making it easier for hardworking Washingtonians to take care of themselves or a family member: Quote Tweet Jay Inslee @JayInslee Each and every one of us deserves time off to take care of ourselves or of others. And none of us should have to grow broke to do so. \n\nStarting in January, we've made sure Washington workers can take up to 12 weeks paid leave a year. Here are the facts.", "2019-11-19T19:07:37.000Z": "I'll take, \"If I'm going to be mistaken for another governor, I'm not mad it's @GavinNewsom \" for $500 please. Quote Tweet Jamal Raad @jamalraad Well lookie here. @JayInslee was an answer (or I guess question?) on @Jeopardy last month. Show this thread", "2019-11-19T17:33:30.000Z": "There's a lot of talk around the country about free and reduced college tuition. Here in Washington, we're making it a reality. \n\nAnd better yet, the companies who rely most on skilled workers will be the ones paying for it. Washington opens wider the door to higher education with new College Grant program Working-class families in Washington should know that doors are opening wider to their children at state colleges and universities. Tuition should not limit their opportunity to attend, under... seattletimes.com", "2019-11-19T03:44:16.000Z": "This is what it looks like to live in a climate changed world. We have no time to waste - we must take action. Venice mayor blames record flood on climate change A state of disaster is declared as the Italian city is hit with a high tide of more than 1.87m. bbc.com", "2019-11-18T22:47:00.000Z": "Innovative new legislation signed into law by Washington's @JayInslee will create the nation's first social-insurance program for long-term care: Quote Tweet Jay Inslee @JayInslee \"When Americans age or need help with the basic tasks of living, they often have no one to turn to but their family members. A groundbreaking program in Washington will change that for residents of the state.\"\n\nI'm proud to have signed this bill into law. https:// thenation.com/article/long-t erm-care-insurance-washington-elderly ", "2019-11-18T23:32:44.000Z": "Each and every one of us deserves time off to take care of ourselves or of others. And none of us should have to grow broke to do so. \n\nStarting in January, we've made sure Washington workers can take up to 12 weeks paid leave a year. Here are the facts.", "2019-11-18T18:19:21.000Z": "\"It is baffling that the Trump Admin. continued to work so hard to allow domestic abusers, felons and terrorists access to untraceable, undetectable 3D-printed guns.\"\n\nProud to have an AG like @BobFergusonAG holding Trump accountable, again and again. Blueprints for 3-D Printed Guns Cannot Be Posted Online, Judge Says The judge said the Trump administration did not follow the right procedures when it moved to allow the blueprints to be posted. The organization that wants to publish the blueprints plans to appeal. nytimes.com", "2019-11-17T23:39:03.000Z": "To save our oceans and stop climate change, we must leave dirty energy in the past where it belongs. Why Saving the Oceans Is as Vital as Protecting Rain Forests Ayana Elizabeth Johnson, a marine biologist, talks about phytoplankton, plastic straws and the best fish to eat. nytimes.com", "2019-11-17T19:58:22.000Z": "Congratulations to Gov. Edwards and the DGA for a hard won fight. As of January 2020, Democrats will hold 24 governors seats across the US. That's incredible! \n\nWe have more work to do - but I'm proud of the work the DGA has done. Quote Tweet Democratic Governors @DemGovs Tonight @JohnBelForLA made history as the first Democratic governor in Louisiana to win re-election in 44 years.\n\nLouisianans chose to re-elect Gov. Edwards because they know he'll keep moving LA in the right direction. #LAGov", "2019-11-16T22:14:30.000Z": "Climate change is not just lines on a graph - it's a justice issue. We have to ensure that people with disabilities aren't left shouldering the biggest burden of climate impacts. Pay More Attention to Climate Perils People with Disabilities Face, Experts Warn Increased disease exposure and extreme weather events pose heightened risks for already vulnerable communities scientificamerican.com", "2019-11-16T19:13:45.000Z": "\"When Americans age or need help with the basic tasks of living, they often have no one to turn to but their family members. A groundbreaking program in Washington will change that for residents of the state.\"\n\nI'm proud to have signed this bill into law. Washington State Has Created the Nation's First Social-Insurance Program for Long-Term Care When Americans age or need help with the basic tasks of living, they often have no one to turn to but their family members. A groundbreaking program in Washington will change that for residents of... thenation.com", "2019-11-16T00:47:41.000Z": "Gov. @JayInslee talks impeachment with Q13's @BrandiKruse : \"We expect our president to work for all Americans, not himself... I just don't think it's right that we should have a president more interested in his political prospects than in the security of the United States.\"", "2019-11-16T01:49:27.000Z": "Science shows what Trump is doing to our environment is dangerous and wrong. \n\nSo what does a man without any moral fiber do? Scrap the science and do it anyway. Appalling. E.P.A. to Limit Science Used to Write Public Health Rules A new agency rule would restrict the science that can be used in drafting health regulations by requiring researchers to turn over confidential health data. nytimes.com", "2019-11-15T20:27:42.000Z": "\"Voters are ready to support a president who uses executive orders to protect the environment.\"\n\nOur next president must make the climate crisis a top priority. And executive orders will be absolutely necessary to making that a reality. Quote Tweet Data for Progress @DataProgress The next Democratic President will need to use executive power to implement a climate agenda. The good news is that we find a progressive climate executive order agenda is popular. https:// dataforprogress.org/memos/climate- executive-orders ", "2019-11-15T16:08:13.000Z": "Here in Washington, we're proud to have the nation's best paid family leave program. \n\nBecause every single one of us deserves time to recover from serious illnesses, to care for a new child, or to help our aging parents.", "2019-11-14T04:17:22.000Z": "Privilege to hear @JayInslee speak today in Yakima. Was able to talk to him about opioids, chronic pain and opioid use disorders. Need for more investment in prevention and early intervention along with integrated behavioral health. @PNWUHealth", "2019-11-12T23:41:39.000Z": "When @CalebHeimlich still can't answer the same question @BrandiKruse has been asking him since June, it's because there's no one left in the Trump-supporting @WAGOP who can mount a credible challenge to @JayInslee 's record of progressive leadership. #waelex", "2019-11-14T03:59:39.000Z": "In 1994, I voted to ban assault weapons while representing Washington's 4th district. \n\nI lost my seat in Congress because of it, but I want to tell you this: I have never regretted that vote. Not for one second.\n\nToday, I'm more committed than ever to ending gun violence in WA.", "2019-11-14T03:59:38.000Z": "I was glad to be back in the Yakima Valley today, where Trudi and I raised our three boys. Talked with community leaders, law enforcement and advocates about the need to reduce gun violence in our state.", "2019-11-12T23:03:43.000Z": "Soon, we have to stop raising money. \n\nHere in WA, we have a \"legislative session freeze\" that keeps any state officials from fundraising in the 30 days before and then during the legislative session.\n\nCan you chip in before the freeze goes into effect? Deadline: November 14 Donate now to support Jay before the freeze next month! secure.actblue.com", "2019-11-13T22:28:00.000Z": "Here in Washington, we're loud and we're proud. Go @SoundersFC ! Each time Seattle scored in the MLS Cup final, the fans' reaction registered on earthquake measur... The Seattle Sounders FC scored three goals in their win over Toronto FC in the MLS Cup championship and fans were so excited, their celebrations registered on earthquake-sensing equipment. cnn.com", "2019-11-13T17:09:53.000Z": "Climate scientists have been sounding the alarm for years - while Big Polluters have done everything in their power to distract and deceive us. Quote Tweet Leah Stokes @leahstokes Dear @nytopinion :\n\nIt's wrong to publish an article that lays the blame at climate scientists' feet, while letting fossil fuel companies and politicians off the hook. This is inaccurate and unhelpful. Please: DO BETTER.\n\nSincerely, All living beings https:// nytimes.com/2019/11/08/opi nion/sunday/science-climate-change.html  Show this thread", "2019-11-13T15:20:53.000Z": "\"Personally, I find the leadership of @VarshPrakash and the @sunrisemvmt to be some of the greatest sources for hope in our fight against the climate crisis. The young people are leading this fight, and because of them, we will all win.\"\n\n- Gov @JayInslee  https:// time.com/collection/tim e-100-next-2019/5718838/varshini-prakash/ ", "2019-11-13T00:24:00.000Z": "Thanks to Governor @JayInslee , affordable higher education is now a reality for more of Washington's hardworking families. Quote Tweet Governor Jay Inslee @GovInslee Higher education should be accessible to everyone. Too often, the biggest barrier is cost. \n\nWe're changing that in Washington. https:// seattletimes.com/opinion/editor ials/washington-opens-wider-the-door-to-college/  Show this thread", "2019-11-12T17:22:58.000Z": "Exactly. #HomeIsHere Quote Tweet Rep. Pramila Jayapal @RepJayapal This is false, divisive, fear-mongering to distract us from the cruelty of Trump's attempts to end DACA\n\nDACA recipients help make this country the best it can be. Their stories and passion for our nation, in the face of great hostility, exemplify the American Dream. #HomeIsHere twitter.com/realDonaldTrum", "2019-11-12T15:56:58.000Z": "Three things are true: Mitch McConnell is not a man on the verge of an epiphany to work with Democrats. Climate change is an existential threat. We will not be able to defeat this existential threat unless we take the filibuster away from McConnell.", "2019-11-12T00:46:31.000Z": "Let me be clear: Washington will remain a place of safety and security for those fleeing persecution and violence. \n\nRefugees make our communities stronger. They are an integral part of Washington's past, present, and future.", "2019-11-11T20:39:27.000Z": "Today, beautiful Washington state turns 130! (And it doesn't look a day over 129 if you ask me.)", "2019-11-11T18:20:45.000Z": "Today we honor our nation's veterans - their service, their sacrifice, and their patriotism. Thank you. #VeteransDay", "2019-11-10T22:52:26.000Z": "Go @SoundersFC !", "2019-11-10T22:06:16.000Z": "Sounders win the #MLSCup ! Proud to be a Washingtonian today and every day. Quote Tweet Seattle Sounders FC @SoundersFC We've done it, Seattle! We are the 2019 MLS Cup Champions!", "2019-11-10T20:03:40.000Z": "We delivered donuts to the Toronto box and their families as an act of Washington welcoming. \n\nLet's bring home the cup. Scarves up! Go SOUNDERS! #SoundersMatchday", "2019-11-10T16:44:22.000Z": "It's game day! I'll be proudly rooting on the @SoundersFC for the #MLSCup . Let's do this - time to bring that trophy home to Seattle again! #SoundersMatchDay Quote Tweet Seattle Sounders FC @SoundersFC It's officially #SoundersMatchday in Seattle. This Is It | #MLSCup", "2019-11-10T01:40:29.000Z": "Make no mistake: Climate change will continue to surprise us with \"unexpected impacts\" the longer we delay action. A deadly virus is spreading in marine mammals. Scientists say climate change is to blame. The study adds to growing research that global warming is having some unexpected impacts on animal and human health. nbcnews.com", "2019-11-09T22:12:08.000Z": "We can't let President Trump continue to lie and say that climate action means killing American jobs. The fact is, defeating climate change is a jobs message - we will create millions of new jobs across America.", "2019-11-09T18:04:29.000Z": "\"We're the future so we need to step up and make change right now.\" Young people are saving the world - here in Washington and beyond. 'Rolling up their sleeves': Tacoma students work to bring solar panels to Jason Lee Middle School q13fox.com", "2019-11-08T21:14:31.000Z": "Everyone deserves the freedom to decide. Quote Tweet NARAL @NARAL We're pro-CHOICE. If you want or need an abortion, we support your decision. If you choose adoption, we support your decision. If you want to give birth and parent, we support your decision. CHOICE looks different for everyone-and everyone deserves the freedom to decide.", "2019-11-08T18:56:01.000Z": "We're glad @JayInslee isn't going away. His presidential campaign pushed every candidate toward a stronger climate position and we need his voice (and yours!) to push our leaders to #ActOnClimate . Jay Inslee Isn't Going Away Washington Governor Jay Inslee may be out of the 2020 race, but his ideas are shaping the future of climate policy rollingstone.com", "2019-11-08T17:09:09.000Z": "Climate change is not just an enormous challenge - it's an enormous opportunity. We can create a stronger economy and a more equitable world by defeating this crisis.", "2019-11-08T01:17:51.000Z": "Climate action should and must be transformational. As a Boomer, I accept this challenge. \n\nThank you for your courage, @_chloeswarbrick .", "2019-11-08T01:16:04.000Z": "I'm a Boomer and it's time for our generation to do our part to defeat climate change. Ok, Boomers?\n\n(Did I do that right?) Quote Tweet CNN @CNN 25-year-old New Zealand lawmaker Chlöe Swarbrick was giving a speech supporting a climate crisis bill when she was heckled by an older member of Parliament. She simply said, \"OK boomer,\" and kept talking, unfazed. https:// cnn.it/2WRP2j1", "2019-11-07T20:00:57.000Z": "#BREAKING : Spokane judge finds Trump Administration \"conscience rule\" unlawful, strikes down nationwide. Learn more: https:// atg.wa.gov/news/news-rele ases/spokane-federal-judge-agrees-ag-ferguson-strikes-down-unlawful-trump-conscience ", "2019-11-05T23:43:29.000Z": "We cannot allow ourselves to be paralyzed by the scope of this problem. Every day, we must recommit ourselves to defeating the climate crisis. Jay Inslee Isn't Going Away Washington Governor Jay Inslee may be out of the 2020 race, but his ideas are shaping the future of climate policy rollingstone.com", "2019-11-07T17:25:26.000Z": "Unions are critical for protecting workers and building a thriving economy. It's no coincidence that Washington state has: The strongest unions The strongest economy Been rated a top state to do business https:// smartasset.com/checking-accou nt/states-with-the-strongest-unions-2019 ", "2019-11-07T02:39:24.000Z": "The filibuster is archaic. It has paralyzed progress in our country. It must be eliminated.", "2019-11-06T20:38:36.000Z": "Gov. @JayInslee is proud to welcome refugees to WA state: \"Refugees contribute to all sectors of our economy - as teachers, service members, doctors and more - while adding to our cultural landscape. They are an integral part of Washington's past, present and future.\" Quote Tweet Governor Jay Inslee @GovInslee The state of Washington wholeheartedly consents to welcoming and resettling refugees into our communities. \n\nIt is a long and proud tradition we intend to continue. https:// governor.wa.gov/news-media/ins lee-welcomes-refugee-resettlement-washington ", "2019-11-06T21:40:48.000Z": "Thank you for your kind words, Robin. I'm proud to be with you in this fight! Quote Tweet Robin Leigh @robinskyleigh I'm so grateful to @JayInslee for his tireless work in bringing climate change to the fore, whether it is politically expedient or not. Because it is the right thing to do. Because it is life or death. He'll keep fighting.\n\nAnd so will we. #ClimateCrisis  https:// rollingstone.com/politics/polit ics-features/jay-inslee-climate-plan-influence-902461/?fbclid=IwAR1mbmfMZG3yNzbPIIcp3oG33K4JwXYKCBeZ1-WNZWbhnphKXKYjRz3754Q ", "2019-11-06T16:55:25.000Z": "Trump has broken his promise to America's coal workers. \n\nWe cannot leave them behind - we must make a just transition reality. Quote Tweet Newsweek @Newsweek Eight coal companies have filed for bankruptcy since Trump took office https:// trib.al/4aW1JRQ", "2019-11-06T03:30:28.000Z": "Democratic governors have now won 8 states that went for Trump in 2016.\n\nIf we stay determined, stay dedicated, and stay true to our values - we can win back the White House and our country in 2020. #KYGov Quote Tweet Democratic Governors @DemGovs Congratulations to Governor-Elect @AndyBeshearKY for his hard-fought victory tonight! His victory proves that strong Democrats running smart campaigns can win anywhere. #KYGov Show this thread", "2019-11-05T18:28:33.000Z": "Still need to register? You have time! Go to http:// votewa.gov to find your county elections office, you have until 8 p.m. tonight to register in person, fill out your ballot, and have it count! #GoVoteWA  #waelex", "2019-11-05T20:00:45.000Z": "Washingtonians-This is it. #ElectionDay is upon us. \n\nLet's make history tonight by becoming the 43rd state to allow for affirmative action. #Approve1000 via Ref 88!", "2019-11-05T18:20:24.000Z": "Today is #ElectionDay ! \n\nMake sure to drop off your ballot by 8 PM tonight. I hope you'll join me in voting YES on I-1000 and NO on I-976. #Approve1000  #NoOn976 Quote Tweet Jay Inslee @JayInslee #ElectionDay is tomorrow! Don't forget: Here in WA, you can still register in person before 8 PM on election day. Return your ballot to an official ballot box by 8 PM on election day. Your voice matters - there are critical initiatives on the ballot!", "2019-11-05T18:36:29.000Z": "Gina McCarthy has been steadfast champion for people and the planet for more than 35 years. With her at @NRDC 's helm, I'm more optimistic than ever that the we will defeat the climate crisis. Quote Tweet NRDC @NRDC Big news! Excited to announce @NRDC 's new president: Gina McCarthy! Our statement: https:// on.nrdc.org/2Nj66LT Show this thread", "2019-11-05T17:03:33.000Z": "\"It is not abstract, it is real. It is everywhere and it is everybody and it is everyday.\" - @JayInslee Quote Tweet Crooked Media @crookedmedia Washington votes on whether to repeal the state's ban on affirmative action. Gov. @JayInslee weighs in on Trump backing out of the Paris Climate Agreement. #WhatADay : \"We'll Always Have The Paris Agreement\" http:// apple.co/whataday  http:// crooked.com/whataday", "2019-11-04T17:11:54.000Z": "#ElectionDay is tomorrow! Don't forget: Here in WA, you can still register in person before 8 PM on election day. Return your ballot to an official ballot box by 8 PM on election day. Your voice matters - there are critical initiatives on the ballot!", "2019-11-04T23:00:36.000Z": "That's funding we need to keep our roads and bridges safe, to ease traffic, and to create a public transit system that achieves our climate pollution goals. (5/7) #waelex Quote Tweet NO on I-976 @voteno976 Thank you @JayInslee for endorsing #NoOn976 & for your leadership on climate & transit in our state. Tim Eyman's I-976 would have devastating effects-both for our environment & our communities. Let's keep Washington moving forward & not let Eyman grind our progress to a halt.", "2019-11-04T23:00:35.000Z": "The deadline for turning in your ballot is tomorrow at 8 PM! \n\nHere are two important initiatives and how I'm voting on them. (1/7) #waelex Quote Tweet Washington Secretary of State @secstatewa Don't wait until Election Day! Vote today. Go to http:// votewa.gov for information about voting center and ballot drop box locations near you. #waelex Show this thread", "2019-11-04T21:36:31.000Z": "Donald Trump may be hellbent on withdrawing from the Paris Agreement, but that's why @JerryBrownGov , @NYGovCuomo , and I founded the @USClimate Alliance. \n\nAnd today, 25 governors have committed their states to uphold the goals of the Agreement, with or without Trump. Quote Tweet Kyle Griffin @kylegriffin1 WASHINGTON (AP) -- Trump administration has notified UN that it has started process of withdrawing US from Paris climate agreement.", "2019-11-04T20:15:01.000Z": "\"The 68-year-old governor of Washington state is a founding father of the climate movement.\"\n \nWe're incredibly proud of #DemGov  @JayInslee for his role in the fight against climate change. Quote Tweet Rolling Stone @RollingStone Washington governor Jay Inslee talks to us about the power of Greta Thunberg, the Green New Deal, the best climate candidate and more https:// rol.st/2Cb7N7J", "2019-11-04T19:51:33.000Z": "\"It's not climate change, just rake the leaves.\" \n\nThanks, but I don't think Gov. @GavinNewsom or the rest of us will take advice from the guy who looked directly at the sun during an eclipse. Quote Tweet Donald J. Trump @realDonaldTrump The Governor of California, @GavinNewsom , has done a terrible job of forest management. I told him from the first day we met that he must \"clean\" his forest floors regardless of what his bosses, the environmentalists, DEMAND of him. Must also do burns and cut fire stoppers..... Show this thread", "2019-11-04T18:00:14.000Z": "Time for Congress to use WA state as a model for how to provide free or reduced tuition (key: that covers students' books and cost of living).\n\nThanks to @JayInslee 's leadership, 110,000 families per year can finally afford college without crippling student debt. Quote Tweet StudentDebtCrisis @DebtCrisisOrg Today, the student debt crisis reached $1,677,707,799,289", "2019-11-01T19:27:33.000Z": "This election, @DougBaldwinJr will be voting to #Approve1000 via Referendum 88. \n\nHear why he thinks it's imperative that Washington level the playing field to address entrenched inequalities.", "2019-10-31T21:31:06.000Z": "The last thing we need is to slash transit funding for seniors, students, and people living with disabilities. But that's exactly what Tim Eyman's Initiative 976 will do. #NoOn976  #DontCutMyBus", "2019-11-01T18:12:33.000Z": "Washington newspapers agree that Tim Eyman's I-976 would be a disaster. Vote NO on Tim Eyman's I-976 and remember to return your ballot by November 5! #waelex  #NoOn976", "2019-11-04T02:10:26.000Z": "Seattle knows how to put on a twilight - especially after a #Seahawks win!", "2019-11-04T01:11:47.000Z": "The #Seahawks set the stage for a Sounders victory at Century Link!", "2019-11-03T21:36:45.000Z": "One year from today, we're going to make Donald Trump what he deserves to be: A blip in history.", "2019-11-01T19:49:47.000Z": "Everything you need to know about what is on your ballot is in here! \n\nDid you know the pamphlet is also available online in multiple languages? You can find it here  https:// sos.wa.gov/elections/vote rs-guide/2019/general-election.aspx ", "2019-11-03T15:25:25.000Z": "Climate change is not just data points on a graph. It's the health and well-being of the people we love, here in Washington state and beyond. Climate change will spread disease faster. Scientists want to keep us informed - and unafraid As more Western communities encounter new diseases like Valley fever, Washington health leaders grapple with how to report risks without creating panic. crosscut.com", "2019-11-03T00:24:44.000Z": "\"Politicians should take heed: they are going to win or lose based on whether they support taking bold climate action. We're uniting by the millions because millions of lives will be lost if nothing changes.\" - @JayInslee + @VarshPrakash  #GreenNewDeal The Youth-Led Climate Movement Will Not Be Ignored | Crooked Media Rising leaders know we face an urgent climate crisis and addressing it is a matter of life and death. They're acting like it. The rest of us must, too. crooked.com", "2019-11-02T22:53:28.000Z": "Hey WA Dems! The countdown to get out the vote is on! Remember to return your ballots by mail or a certified dropbox before Nov. 5th! #WAElex  #GOTV", "2019-11-02T20:15:17.000Z": "I-976 threatens more than $25 billion in road, rail, and public transportation investments. \n\nThese investments connect millions of people to jobs, education, health care, and each other every year. I urge Washington voters to vote #NoOn976 . Quote Tweet NO on I-976 @voteno976 You've learned about the myriad negative impacts of Eyman's I-976-now hear from the broad coalition of state and local organizations opposing this disastrous initiative. #waelex", "2019-11-02T15:29:46.000Z": "Climate change and clean energy jobs are winning messages in every county and every zip code in the United States. Jay Inslee to the candidates: Take my climate plan, please The Washington governor and former 'climate candidate' took climate change on the campaign trail. Here's what he learned. grist.org", "2019-11-02T01:09:19.000Z": "Donald Trump knows he's incredibly vulnerable on climate and the environment. And voters know he has no excuse for his terrible record. \n\nDemocrats must make climate change a prime part of our strategy to take back the White House. https:// climate2020podcast.com/episodes/episo de-5 ", "2019-11-01T20:27:20.000Z": "Washington state is a place where we value diversity, promote opportunity for all, and honor the service of our veterans and military. \n\nI hope Washington voters approve I-1000 to help level the playing field for everyone Quote Tweet *Approve I-1000 via Referendum 88* @WAFairness ICYMI: Approve I-1000 via Referendum 88 has a huge coalition of partners. These organizations understand how important it is to create a level playing field for everyone. After all, we all do better when we all do better.", "2019-11-01T15:11:17.000Z": "Here in Washington, we take big ideas and make them reality. Three years running, @UW has been named the most innovative public university in the nation. University of Washington once again named world's most innovative public university For the third year in a row, the University of Washington has won the title of the world's most innovative public university, according to an annual ranking by Reuters and Clarivate Analytics. geekwire.com", "2019-10-31T15:03:26.000Z": "In our most recent podcast episode, @JayInslee weighs in on how climate change could help the Dems in the 2020 election. Listen now: https:// climate2020podcast.com/episodes/episo de-5 ", "2019-10-31T19:31:15.000Z": "The president has broken the law again and again. That's why Washington has taken him to court 50 times and we haven't lost once. \n\nToday, Democrats in the House have done their constitutional duty. \n\nWe must hold Donald Trump accountable. We must protect our democracy.", "2019-10-31T14:48:23.000Z": "Trudi and I want to wish everyone a #HappyHalloween ! Here's one of my favorite photos from when our little superheroes were even littler.", "2019-10-30T20:07:24.000Z": "For those who say that climate action costs too much, look at what climate change is costing California right now.", "2019-10-30T16:26:14.000Z": "Born in Nineteen-Seventy-Four,\nSounders! Sounders!\n \nAnd now we win like never before,\nSounders! Sounders!\n \nWe love our boys in famous green,\nthe greatest team you've ever seen\n \nSeattle Sounders,\nBorn in Seventy-Four! Quote Tweet Seattle Sounders FC @SoundersFC Waking up with a and a ticket to #MLSCup !", "2019-10-29T22:41:47.000Z": "Will you help me keep fighting for progress as Washington's governor? We have a huge deadline coming up on Thursday, and your support really does make a world of difference. Donate Today and Help Fund Our Fight Winning campaigns aren't made in November 2020, they're made right here, right now. secure.actblue.com", "2019-10-28T20:12:38.000Z": ". @JerryBrownGov is right: California's devastating new normal is the face of climate change. And it's a heartbreaking reminder of what's at stake if we fail to act. #GettyFire Brown: California fires show 'the horror' world will face from climate change \"It's a real threat, but it has to be managed. This is the world we live in. And it will get more dangerous.\" politico.com", "2019-10-28T13:56:28.000Z": "Special guest @JayInslee joins our show to discuss what a 2020 win for the Democrats would mean for the climate: https:// climate2020podcast.com/episodes/episo de-5 ", "2019-10-28T16:07:29.000Z": "The science has been abundantly clear. We must stop bankrolling dirty energy. Banks Funneled $1.9 Trillion Into Fossil Fuels Since Paris Agreement A new report published this week shows that 33 global banks provided $1.9 trillion to fossil fuel companies since the adoption of the Paris Climate Agreement at the end of 2015 and that the amount of... cleantechnica.com", "2019-10-27T18:39:00.000Z": "Happy #Diwali to all those who celebrate. In times like these, Diwali's message of a victory of light over darkness feels especially important. Trudi and I wish you all a joyful holiday.", "2019-10-27T18:32:07.000Z": "In Washington, we've taken bold moves to protect our elections and your votes. Now, what we've built here is helping states around the country do the same. These ballot boxes keep your vote safe from fire, rain and rampaging SUVs The welded steel dropboxes got their start in the Puget Sound, but are now in demand across the country. crosscut.com", "2019-10-27T01:30:29.000Z": "No doubt about it: Washington is the most beautiful state in the union. Quote Tweet Emily Thomas @emitoms Fall in Washington state", "2019-10-26T17:14:08.000Z": "Thank you @JayInslee for endorsing #NoOn976 & for your leadership on climate & transit in our state. Tim Eyman's I-976 would have devastating effects-both for our environment & our communities. Let's keep Washington moving forward & not let Eyman grind our progress to a halt.", "2019-10-26T19:31:44.000Z": "Big Polluters are scared. \n\nGood. They should be. Quote Tweet ExxonMobil @exxonmobil Don't be misled by news reports. WATCH to learn the real story behind #ExxonKnew .", "2019-10-25T21:45:02.000Z": "While the Trump administration damages our environment and threatens our health care, #DemGovs like @JayInslee are making important strides to protect their constituents: Quote Tweet Jay Inslee @JayInslee Our state is a progressive leader for the nation. Just last year, we passed: The nation's best 100% clean energy bill The nation's first public option Free or low-cost college for families in need A ban on ghost guns A ban on fracking\n\nAnd more - but we're not done yet.", "2019-10-25T16:23:48.000Z": "The transportation sector is our largest source of carbon pollution. But we can confront that - and create union jobs manufacturing the clean cars of the 21st century - with bold action. This plan from @SenSchumer and others is one part of that future. Opinion | Chuck Schumer: A Bold Plan for Clean Cars I have a proposal that is supported not just by environmentalists but also by labor and large automakers. nytimes.com", "2019-10-25T15:34:43.000Z": "\"I was so inspired, meeting Americans all over the country. The people out there are engaged, they're positive, they really want to work in a united fashion  and make sure that Donald Trump is a blip in history.\" - @jayinslee Jay Inslee to the candidates: Take my climate plan, please The Washington governor and former 'climate candidate' took climate change on the campaign trail. Here's what he learned. grist.org", "2019-10-25T15:01:21.000Z": "I applaud the Weather Channel for continuing to push the candidates on the climate crisis.\n\nI hope the focus is how our next president can effectively mobilize our nation to defeat this crisis - and leave out questions about burgers and straws. Quote Tweet The Weather Channel @weatherchannel On November 7th, The Weather Channel will be debuting our new special, 2020: Race to Save the Planet. \n\nWe speak with nine presidential candidates in some of the very areas being most affected by climate change.", "2019-10-25T01:34:43.000Z": "Our state is a progressive leader for the nation. Just last year, we passed: The nation's best 100% clean energy bill The nation's first public option Free or low-cost college for families in need A ban on ghost guns A ban on fracking\n\nAnd more - but we're not done yet.", "2019-10-24T21:49:07.000Z": "Every election and every voice matters. And remember: There's still time to register to vote! Quote Tweet Washington Secretary of State @secstatewa Important dates for the Nov. 5 General Election!\n\nMissing your ballot or need a replacement? Contact your county elections office: https:// sos.wa.gov/elections/audi tors/  Need to register to vote or update your info? Do it online at https:// votewa.gov or by mail until October 28. #waelex", "2019-10-24T18:39:15.000Z": "What @JayInslee said. #ClimateJustice Quote Tweet Jay Inslee @JayInslee Climate change disproportionately harms low-income communities and communities of color - and is a major contributor to ongoing economic and racial inequality. \n\nAny climate plan put forward must also meaningfully address climate justice.", "2019-10-24T15:05:48.000Z": "Last year, BP spent $13,000,000 to block climate action in Washington state. Quote Tweet bp @bp_plc The first step to reducing your emissions is to know where you stand. Find out your #carbonfootprint with our new calculator & share your pledge today!", "2019-10-22T23:33:23.000Z": "Thank you @JayInslee for standing up for affirmative action in Washington!", "2019-10-23T19:39:44.000Z": "Climate change disproportionately harms low-income communities and communities of color - and is a major contributor to ongoing economic and racial inequality. \n\nAny climate plan put forward must also meaningfully address climate justice.", "2019-10-22T20:46:01.000Z": "\"This is just one more example of the Trump Administration's unprecedented assault on the environment, and we will not stand for it. We will fight to protect the people who live in our states.\" #DemGovs like @JayInslee & @NYGovCuomo are leading the charge to protect our water. Quote Tweet Andrew Cuomo @NYGovCuomo The Trump Administration is unlawfully attempting to limit the authority of states to protect our water under the Clean Water Act.\n\nThis is the latest example of their unprecedented assault on the environment, and we will not stand for it.\n\nMy full statement with @GovInslee :", "2019-10-23T00:06:13.000Z": "I'm proud to support this initiative because it brings us closer to a fair and equal Washington state. \n\nI hope you'll join me and approve I-1000.", "2019-10-23T00:05:58.000Z": "I-1000 is a historic initiative on the ballot this year. \n\nIf approved, it will protect Washington women, veterans, persons with disabilities, people of color, members of the LGBTQ community, students and seniors from discrimination. Quote Tweet *Approve I-1000 via Referendum 88* @WAFairness Thank you @JayInslee for standing up for affirmative action in Washington!", "2019-10-22T17:12:03.000Z": "Proud to have #DemGovs like @JayInslee who make investing in our schools, students and teachers a top priority! Quote Tweet Jay Inslee @JayInslee That's why we've: Invested billions in K-12 education Achieved the highest average increase in public school teacher pay of any state Provided free-and-low-cost public college to 110,000 Washingtonians from families in need And more Show this thread", "2019-10-22T18:05:47.000Z": "This year, I signed a bill into law which guarantees more than 110,000 students in need can attend college for free or at a low cost.\n\nNo matter your income, you should be able to afford college and fulfill your dreams. We're making that a reality in WA.", "2019-10-22T00:01:13.000Z": "Impeachment shouldn't be taken lightly, and it shouldn't be about a political disagreement - impeachment should be about a threat to our democracy.\n\nTo put it plainly: Of course the president has broken the law. It's time for him to be impeached.", "2019-10-21T16:50:01.000Z": "The Trump Administration is unlawfully attempting to limit the authority of states to protect our water under the Clean Water Act.\n\nThis is the latest example of their unprecedented assault on the environment, and we will not stand for it.\n\nMy full statement with @GovInslee :", "2019-10-21T18:37:06.000Z": "A huge congratulations to the Washington state recipients of the Presidential Excellence Awards in Science, Mathematics, and Engineering! \n\nWe're fortunate to have incredible educators in our state. Thank you for all the work you do and for your dedication to Washington's kids.", "2019-10-21T01:22:59.000Z": "The GOP and Big Oil will do anything they can to buy their way into the governor's residence next year. \n\nWe have to be prepared - and every single grassroots donation makes a difference. Can you chip in today? Donate Today and Help Fund Our Fight Winning campaigns aren't made in November 2020, they're made right here, right now. secure.actblue.com", "2019-10-20T18:33:23.000Z": "My dad was a biology teacher and coach right here in Washington - and I know how crucial it is to invest in educators and students.", "2019-10-20T03:52:45.000Z": "\"Confronting climate change will require a full-scale mobilization - a national mission that must be led from the White House. This is the challenge we face and the choice facing American voters in 2020.\" - @JayInslee Opinion | The next president must make climate change the top priority Climate change can't wait. Neither can the next president. washingtonpost.com", "2019-10-20T02:42:26.000Z": "I heard through the grapevine that we hit a big milestone. Cheers to Washington state's booming wine industry! Quote Tweet Washington Wine @Wa_State_Wine History made us, and now, we're making history! We are thrilled to share that we've passed the 1,000 winery mark! Cheers to everyone who has made, and continues to make, #WAwine what it is!", "2019-10-19T17:53:10.000Z": "\"This was an individual who had access to firearms and was preparing for a race war.\"\n\nCommon sense gun laws are saving lives in Washington. Quote Tweet Shannon Watts @shannonrwatts Seattle investigators removed a cache of firearms from a man believed to be a leader of the most violent extremist group in the country. They were able to do so thanks to the state's Red Flag law, passed by ballot initiative in 2016. #waleg  https:// nytimes.com/2019/10/17/us/ atomwaffen-kaleb-cole.html ", "2019-10-18T19:09:21.000Z": "I-976 puts more than $25 billion in critical transportation funding improvements at risk. This misguided initiative: Is fundamentally unfair Is too costly Puts public safety at risk Would lead to more time in traffic for Washington families #NoOn976", "2019-10-18T16:43:48.000Z": "It's amateur hour at the White House. There's no \"pro\" in this quid pro quo. Quote Tweet Caroline Orr @RVAwonk Mick Mulvaney is denying that he said there was a quid pro quo.\n\nHere's Mick Mulvaney admitting that there was a quid pro quo.", "2019-10-17T21:27:55.000Z": "I got the chance to help reopen the @BurkeMuseum last week. The museum will now be open for generations to come - to help us remember history, to nurture curiosity, and to promote dialogue. Can't wait to visit again! Washington Gov. Jay Inslee and students cut the ribbon to open New Burke Museum Washington Gov. Jay Inslee got a helping hand from students when he cut a hand-woven cedar ribbon to mark this weekend's opening of the New Burke Museum. geekwire.com", "2019-10-17T17:33:58.000Z": "Today, we lost a great man and fearless leader. I was proud to serve with Rep. Elijah Cummings in the House - his stalwart dignity and strong sense of decency and justice was a reassurance to us all. \n\nTrudi and I send our love and condolences to his family.", "2019-10-17T00:37:49.000Z": "Proud to join @NextGenAmerica  @NRDC_AF  @LCVoters at #GiveGreen to introduce MY gov @JayInslee , whose visionary leadership & moral clarity as a climate champion had a tremendous impact on the 2020 debate.\n\nThank you, Governor, for leading with integrity & a deep sense of justice.", "2019-10-16T22:53:41.000Z": "Our nation deserves far, far better than the current occupant of the Oval Office.", "2019-10-15T22:54:43.000Z": "Wow, what a sight! We're working diligently to protect tiny Tl'uk and the other orcas that call our waters home. A rare white orca calf was spotted off the Washington coast, delighting whale watchers and resear... Noone knows how Tl'uk got his coloring -- it first worried researchers who first thought he was sick. But nearly one year later, the young orca is growing and packing on pounds. cnn.com", "2019-10-16T19:19:01.000Z": "Senator Murray is exactly right. We must #ProtectX and put an end to Trump's draconian gag rule. Quote Tweet Senator Patty Murray @PattyMurray Who is most affected by the harmful Trump-Pence #TitleX gag rule? Young people, women with low incomes, and women of color. \n\nWe must continue to fight to #ProtectX and ensure everyone, no matter where they live or who they are, can get quality, affordable health care.", "2019-10-16T02:59:40.000Z": "Not one single question about the climate crisis. \nNot one single question about the climate crisis. \nNot one single question about the climate crisis. \n\nThis is the existential crisis of our time. Not one single question, and that's completely inexcusable. #DemDebate", "2019-10-16T01:28:40.000Z": "Nearly 90 minutes without a single question about the climate crisis. \n\nThat's completely unacceptable. #DemDebate", "2019-10-15T16:49:28.000Z": "\"There is no middle road on the climate crisis. We will either address the problem meaningfully and in accordance with scientific consensus, or we will not.\" Well said, @AOC . From NowThis", "2019-10-15T01:16:34.000Z": "ICYMI: A federal judge has blocked a cruel \"public charge\" rule that would make it more difficult for immigrants to become permanent residents if they rely on public benefits. \n\nThe cruelty is the point. And we won't stand for it. Federal judge in Eastern Washington blocks the Trump administration's 'public charge' rule A federal judge in Eastern Washington has issued a nationwide preliminary injunction against the Trump administration's \"public charge\" rule, which would knkx.org", "2019-10-14T20:38:00.000Z": "#DemGovs and @DemocraticAGs are continuing to fight for our values - and win. Quote Tweet Jay Inslee @JayInslee", "2019-10-14T18:21:19.000Z": "On #IndigenousPeoplesDay , we celebrate and honor Native American communities, cultures, and contributions. \n\nIn WA, we respect the sovereignty and history of tribal communities, and I am deeply grateful to work with Tribal Leaders on our shared challenges and opportunities.", "2019-10-11T15:21:24.000Z": "Delivered a special message to @GovInslee from Mr. Washington's class at @GeneseeHill Elementary! \n\nThese students are getting engaged early and wanted our elected officials to know their legislative priorities!", "2019-10-13T18:43:16.000Z": "Climate change is not a single issue. It's every issue.", "2019-10-12T04:36:46.000Z": "@WCVoters was proud to early endorse @GovInslee today at our breakfast of champions. Thank you Gov. for leading our great state to a clean energy future. You are a true champion of our environment! Quote Tweet Jay Inslee @JayInslee . @WCVoters was the first to endorse me in 2012 - and I'm proud to have their endorsement again today. \n\nEarly to bed, early to rise, work like hell and organize. Let's go build a clean energy future! #WCVbreakfast", "2019-10-12T19:59:01.000Z": "Bainbridge Fire Department pancake breakfast with my grandson Chase!", "2019-10-12T18:49:10.000Z": "Hear, hear! Quote Tweet Jay Inslee @JayInslee I'm proud to have banned conversion \"therapy\" in Washington. This cruel and unnecessary practice must be banned across the country.", "2019-10-12T18:06:35.000Z": "I'm proud to have banned conversion \"therapy\" in Washington. This cruel and unnecessary practice must be banned across the country.", "2019-10-12T14:51:44.000Z": "I've said it before, and I'll say it again: We can no longer allow a white nationalist to be in the White House.", "2019-10-11T20:32:33.000Z": "24-0. \n\nWashington will continue to fight back against the Trump administration's egregious policies.\n\nNot tired of winning. Quote Tweet Washington State Attorney General @AGOWA #BREAKING", "2019-10-11T16:22:46.000Z": "Heartwarming moment of the morning. As our CEO Joan Crooks retires, @JayInslee names her Washingtonian of the year  #wcvbreakfast", "2019-10-11T18:53:00.000Z": "\"A record number of voters say climate change is the issue they care about most. This shift is led by young people: 78 percent of Millennials and Generation Z voters support a Green New Deal.\"\n\n- @JayInslee + @VarshPrakash The Youth-Led Climate Movement Will Not Be Ignored | Crooked Media Rising leaders know we face an urgent climate crisis and addressing it is a matter of life and death. They're acting like it. The rest of us must, too. crooked.com", "2019-10-11T16:02:58.000Z": ". @WCVoters was the first to endorse me in 2012 - and I'm proud to have their endorsement again today. \n\nEarly to bed, early to rise, work like hell and organize. Let's go build a clean energy future! #WCVbreakfast", "2019-10-11T15:42:16.000Z": ". @WCVoters was the 1st organization to endorse @JayInslee in 2012 and we're proud to be the first to endorse him again for 2020! Quote Tweet Jamal Raad @jamalraad Breaking: @WCVoters surprise endorses @JayInslee for reelection at their annual fundraising breakfast", "2019-10-10T17:10:53.000Z": "Millions of people in California are without power.\n\nThis is a harrowing glimpse into our future if we do not defeat the climate crisis. California's climate dystopia comes true \"Out go the lights.\" mashable.com", "2019-10-10T22:25:53.000Z": "Thank you, Ann! I'm looking forward to working with #waleg to continue our work building a better Washington during the next legislative session. Quote Tweet Ann Kempski @kempann Replying to @JayInslee I'd also like to thank you for your great work on health care and enacting a public option.", "2019-10-09T16:57:59.000Z": "@JayInslee & @VarshPrakash : \n\n\"To win a Green New Deal, we must come together by the millions to repeatedly disrupt business as usual and force those in power to do what's necessary to give young people a livable future.\" The Youth-Led Climate Movement Will Not Be Ignored | Crooked Media Rising leaders know we face an urgent climate crisis and addressing it is a matter of life and death. They're acting like it. The rest of us must, too. crooked.com", "2019-10-09T21:15:39.000Z": ". @VarshPrakash and I come from different generations and different backgrounds, but we see the same thing: Young people have changed the game on the climate crisis, and politicians better listen up now. The Youth-Led Climate Movement Will Not Be Ignored | Crooked Media Rising leaders know we face an urgent climate crisis and addressing it is a matter of life and death. They're acting like it. The rest of us must, too. crooked.com", "2019-10-09T22:16:10.000Z": "Your cable or internet provider shouldn't get to be a gatekeeper to the internet. \n\nThey shouldn't get to slow down or block access to the sites you love, or be able to charge you extra if you use a service like Twitter or Netflix.", "2019-10-09T16:00:32.000Z": "Gov @jayinslee & @VarshPrakash for @crookedmedia : \"Politicians should take heed: they are going to win or lose based on whether they support taking bold climate action.\" http:// go.crooked.com/iwEito cc @sunrisemvmt The Youth-Led Climate Movement Will Not Be Ignored | Crooked Media Rising leaders know we face an urgent climate crisis and addressing it is a matter of life and death. They're acting like it. The rest of us must, too. crooked.com", "2019-10-09T00:09:02.000Z": "GIF Quote Tweet Jay Inslee @JayInslee Here's your weekly reminder: To defeat climate change, we must eliminate the filibuster.", "2019-10-09T00:45:43.000Z": "This morning, Governor Jay Inslee met with students, faculty, and staff while taking a tour of CPTC's brand new CAMT building! Students in our Manufacturing Technologies, Mechatronics, and NDT programs were excited to share their experiences with Govenor Inslee. #respect4tech", "2019-10-08T22:49:09.000Z": "Here's your weekly reminder: To defeat climate change, we must eliminate the filibuster.", "2019-10-08T19:10:12.000Z": "AG Ferguson statement on the U.S. Supreme Court rejecting a legal challenge to Washington collective bargaining laws:", "2019-10-08T18:58:41.000Z": "LGBTQ+ rights are human rights. No matter what happens at the Supreme Court today, that doesn't change. \n\nAnd let me be clear: In Washington state, we will never stop protecting our LGBTQ+ community.", "2019-10-07T21:56:00.000Z": "This right here  #ElectDemGovs Quote Tweet Jay Inslee @JayInslee It is absolutely essential for the future of humanity that we elect leaders who understand, value, and are willing to act on climate science.", "2019-10-07T23:14:24.000Z": "Washington state is on the frontlines of fighting back against Trump's egregious and harmful policies. We're lucky to have an attorney general like @BobFergusonAG . By his count, Washington attorney general hasn't lost a case against Trump yet Bob Ferguson, Washington state's attorney general, has sued the Trump administration over mostly environmental and immigration issues. latimes.com", "2019-10-06T23:00:11.000Z": "It is absolutely essential for the future of humanity that we elect leaders who understand, value, and are willing to act on climate science.", "2019-10-07T17:38:56.000Z": "Life without art? I couldn't bear it. \n\nCheck out some of my #JayDoodles at \"Nonp(art)isan,\" hosted in MU Gallery in downtown Tacoma. Quote Tweet The Olympian @theolympian Jay Inslee displays a fondness for bears in Tacoma art show. https:// trib.al/RUZ37q5", "2019-10-06T19:05:12.000Z": "Washington state was the first in the nation to protect #NetNeutrality . No matter what happens in the other Washington, we will continue to safeguard a free and open internet for all. Net neutrality rules could return at state level under mixed U.S. court decision Internet providers could face a variety of state internet regulations after a U.S. court ruled on Tuesday that the federal government cannot block states from passing their own net neutrality laws,... reuters.com", "2019-10-06T15:32:38.000Z": "Dream team! Together, Washington state and British Columbia will invest in local economies and build a clean energy future for the Cascade region. Washington state and B.C. launch Joint Clean Grid Initiative to align renewable energy transition Washington state and British Columbia are partnering to share resources and work together as each government pursues ambitious clean energy goals. Washington Gov. Jay Inslee and British Columbia geekwire.com", "2019-10-05T23:45:31.000Z": "We based the plan on four principles: Setting standards to reach net-zero emissions Investing trillions in public and private funding on infrastructure and clean energy R&D Eliminating fossil fuels Confronting environmental and economic injustice Meet the Jay Inslee staffers who wrote 'the next president's' climate plan Democratic presidential candidates are jostling to be the next \"climate candidate\" after the original one, Jay Inslee, dropped out of the race. washingtonexaminer.com", "2019-10-04T20:06:22.000Z": "It is great to see that some politicians really \"get it\" - thank you @JayInslee for continuing to lead on #ClimateChange Quote Tweet Jay Inslee @JayInslee The next president will be a climate change president, whether they like it or not. We must elect someone who can rise to this challenge and meet it with the aggressive solutions it demands.", "2019-10-05T18:29:33.000Z": "Every day, we wake up to a new attack on reproductive freedom. It's clear: The next president must codify Roe v. Wade into law. Supreme Court agrees to review Louisiana's abortion law that could limit women's access The 2014 law, which has not gone into effect, requires doctors at abortion clinics to have admitting privileges at nearby hospitals. washingtonpost.com", "2019-10-04T23:09:35.000Z": "Proud that @JayInslee isn't gambling on women's reproductive care in WA. He's already passed legislation to protect access to abortion and birth control - so WA women don't have to worry about far-right DC lawmakers hellbent on taking their rights away. Quote Tweet The New York Times @nytimes Breaking News: The Supreme Court will hear its first abortion case since President Trump picked 2 justices. A big ruling could come late in the 2020 campaign https:// nyti.ms/2MfNTwS", "2019-10-04T20:41:29.000Z": "Thanks to @nowthisnews for capturing @JayInslee at the @UN Youth #ClimateAction Summit. His role in the intergenerational town hall was powerful. \n\n& thanks to the Governor for continuing to press leaders on the urgency of acting on the #climateemergency . Quote Tweet Jay Inslee @JayInslee The next president will be a climate change president, whether they like it or not. We must elect someone who can rise to this challenge and meet it with the aggressive solutions it demands.", "2019-10-03T21:36:44.000Z": "Happy to be in Seattle with @GovInslee today, talking about #cleanenergy , daylight saving time - and hockey, of course!", "2019-10-04T18:57:05.000Z": "The next president will be a climate change president, whether they like it or not. We must elect someone who can rise to this challenge and meet it with the aggressive solutions it demands. From NowThis", "2019-10-04T15:26:37.000Z": "We must find new methods to better support co-existence between Washington's livestock industry and gray wolves in our state. \n\nThe status quo of annual lethal removal is simply unacceptable. http:// bit.ly/2IkEumr", "2019-10-03T21:10:35.000Z": "Thank you Governor @JayInslee and @BobFergusonAG for fighting to keep our internet free and open! Quote Tweet Governor Jay Inslee @GovInslee WA was the first state to enact our own #NetNeutrality law, and today's ruling upholds our clear authority to protect Washingtonians. This is a major victory against the Trump @FCC 's assault on a free and open internet. https:// reuters.com/article/us-usa -internet/u-s-court-says-fcc-cannot-bar-states-from-setting-net-neutrality-rules-idUSKBN1WG462   @AGOWA", "2019-10-03T20:20:12.000Z": "Listening to Premier @jjhorgan and Governor @JayInslee of Washington State discuss the future of the Cascadia region and how they're working together to help its growth. There's huge potential for innovation, economic development, new transportation, & tourism between BC & WA.", "2019-10-03T19:50:34.000Z": "Washington Gov @JayInslee and BC Premier @jjhorgan announce the creation of a Joint Clean Grid Initiative to build an electrical grid with a steady reliable source of energy #cascadia2019", "2019-10-03T14:41:18.000Z": "Thank you, @JayInslee ! So proud to have you as MY Governor! Quote Tweet Jay Inslee @JayInslee Don't mess with @RepJayapal . Proud to have her representing Washington state.", "2019-10-03T16:20:06.000Z": "This is a dangerous and despicable abdication of leadership. AIR POLLUTION: EPA about-face lets emissions soar at some coal plants The coal-fired power industry again took a big hit last year, with total generation falling 6% by one group's count. But the industry's emissions of two dangerous pollutants didn't uniformly follow... eenews.net", "2019-10-02T23:17:44.000Z": "Rick Steves' Europe is investing $1 million annually to empower nonprofits fighting climate change. That's incredible, and I'd expect no less from a guy like Rick. \n\nLearn more about their Climate Smart Commitment. Quote Tweet Rick Steves @RickSteves Our tour company takes 30,000 people to Europe every year. \n\nWe think we should pay for the impact all those flights have on our environment - and until our government requires us to do so, we're doing so voluntarily: http:// ricksteves.com/climate", "2019-10-02T23:12:15.000Z": "It was great seeing my friend @RickSteves earlier this week. \n\nDefeating the climate crisis takes every one of us - and Rick, a business owner here in WA, has stepped up as a real leader.", "2019-10-02T02:03:56.000Z": "Join me and environmental leaders at The Riveter in Seattle on October 8!\n\nWe'll be discussing how Washington state can play a pivotal role in leading on green energy, and protecting our clean air and clean water. https:// facebook.com/events/9442485 65933206/ "}