{"2020-07-30T18:11:23.000Z": "From the beginning, our response to this pandemic has been guided by data and science-that hasn't changed. That's why today I signed an statewide emergency order requiring folks ages five and over to wear masks or face coverings in public spaces with some limited exceptions.", "2020-07-28T16:08:04.000Z": "This is great news for folks with disabilities. Thanks to Secretary @FrostmanDWD and @WIWorkforce for their work and advocacy these past few months to get this done. Unemployment benefits OK'd for disabled people in Wisconsin MADISON, Wis. (AP) - Wisconsin residents who receive disability benefits and who had been denied additional unemployment benefits made available due to the coronavirus pandemic can now receive... apnews.com", "2020-07-24T23:14:23.000Z": "Whether #OpeningDay is in March, April, or July, it's always a great day to be a @Brewers fan. #ThisIsMyCrew Quote Tweet Milwaukee Brewers @Brewers It's (finally) time to #PlayBall !\n\nTune in: : @fswisconsin  : @620wtmj  #OpeningDay | #ThisIsMyCrew", "2020-07-23T17:48:42.000Z": "No matter what the fall brings, it is critical that our educators, kids, and schools are prepared. That's why we are putting $46.6 million toward schools most in need so they have the resources to ensure every kid has the tools to succeed. Press Release: Gov. Evers Announces K-12 Schools Eligible for $46.6 Million content.govdelivery.com", "2020-07-22T22:39:41.000Z": "Yesterday we saw a concerning record high of new positive cases with more than 1,100 confirmed cases in a day. We need to get back to working together to flatten the curve and slow the spread of this virus. #SaferAtHome  #MaskUpWisconsin", "2020-07-22T20:24:33.000Z": "While there is still time to register in-person to vote, today is the last day to register online or by-mail for the Aug. 11 primary. Head over to http:// myvote.wi.gov to make sure you are registered and to request your absentee ballot by Aug. 6 to vote safely and securely.", "2020-07-20T14:40:05.000Z": "We are devastated by Ben's death, and our thoughts and prayers are with Ben's family and friends as we all mourn the loss of an exceptional young man who was taken from us far, far too soon.", "2020-07-18T17:05:02.000Z": "Wearing masks is critical for everyone's safety, so I want to thank the many local retailers- and even national folks like Woodman's, Kroger's, and Kohl's- that are doing their part to keep workers and consumers safe by requiring masks in their stores. Major retailers including Kohl's, Walmart, Kroger among stores now requiring customers to wear face... As COVID-19 cases soar across the U.S., retailers are requiring shoppers to wear face coverings to try to slow the spread of the virus. jsonline.com", "2020-07-18T13:44:19.000Z": "Kathy and I are saddened to hear of the passing of Congressman John Lewis. He was a giant among us and his memory will continue to inspire our pursuit for a better, more equitable world. Quote Tweet The Hill @thehill Civil rights legend Rep. John Lewis dies at 80 after battle with cancer http:// hill.cm/P4WL583", "2020-07-16T19:20:55.000Z": "Folks, I am as worried as you are about school this fall, but I can tell you that the work we do now will set the stage for later. Please stay home whenever you are able, always wear a mask out in public, and practice social distancing. Wisconsin Sees Record High 964 Daily New COVID-19 Cases There were 964 new positive cases of COVID-19 in Wisconsin on Tuesday, according to the state Department of Health Services. There were six new deaths from the virus. wpr.org", "2020-07-16T17:22:14.000Z": "Today I pardoned 18 individuals-the largest group since re-establishing the Pardon Advisory Board. While a pardon won't fix the challenges facing our criminal justice system, it can have a tremendous impact on a person's life. More on today's pardons here: Press Release: Gov. Evers Grants Eighteen Pardons - Largest Group So Far content.govdelivery.com", "2020-07-13T17:21:24.000Z": "Remember, when you wear your mask, you are doing your part to slow the spread of COVID-19. #MaskUpWisconsin", "2020-07-15T19:09:31.000Z": "The People's Maps Commission will play a critical role in not only the integrity of the redistricting process, but the integrity our democracy for the next decade. Learn more and apply to serve on the Commission here: http:// wisconsin.gov/peoplesmaps", "2020-07-14T21:42:23.000Z": "The work we do now will be critical to ensuring our state is a good place come this fall. Let's do this together, Badgers. #MaskUpWisconsin  #OnWisconsin Quote Tweet Wisconsin Badgers @UWBadgers We're in this fight together, Badgers\n\nThe defensive game plan is simple: Wear a mask in public spaces Wash your hands regularly Physically distance 6 feet #BadgersDefend Show this thread", "2020-07-14T18:14:22.000Z": "Join us today at 1:30 pm as we provide an update on COVID-19 in Wisconsin. Tune in live at the link below Quote Tweet WIDeptHealthServices @DHSWI Live at 1:30: a #COVID19 -WI update w/ @GovEvers , #DHSWI Secretary-designee Andrea Palm, Chief Medical Officer Dr. Ryan Westergaard, and Ryan Nilsestuen, Chief Legal Counsel. We'll talk rising case counts, our response, and how you can help #SlowTheSpread : https:// youtu.be/8O8k0aAAlxk", "2020-07-14T16:46:27.000Z": "Today we announced our new Task Force on Broadband Access. As folks have adapted to COVID-19 by working, going to school, or visiting with their doctor from home, this pandemic has only underscored that access to reliable, high-speed broadband is not a luxury, it's a necessity.", "2020-07-14T15:02:51.000Z": "Proud to be a part of @WisDems and their best fundraising quarter ever. Even prouder to lead that effort.", "2020-07-14T14:47:38.000Z": "With the news today, we know that Republicans are going to start to panic. Seeing our massive haul, they'll start making plans to pour unlimited sums of dark money into Wisconsin.", "2020-07-14T14:47:37.000Z": "NEWS: My priority as a leader in the Democratic Party of Wisconsin is to invest in Democrats at every level and we're putting in the work to do just that!\n\nIt was @WisDems best fundraising quarter. Ever. Wisconsin Democratic Party raises $10M as battle for the state heats up Flipping Wisconsin back into the blue column in the Electoral College is goal No. 1 for state Democrats in 2020. politico.com", "2020-07-14T14:04:34.000Z": "All of us have a role to play in preventing the spread of COVID-19 and looking out for our neighbors, especially the folks disproportionately impacted by this deadly virus. Stay home, wear a mask when out, and don't risk it. Health Disparities Leave Native Americans More Vulnerable To COVID-19 Tribal communities in Wisconsin haven't seen a spike in COVID-19 cases like some in other parts of the country, but Native Americans are among groups at higher risk for contracting the virus. wpr.org", "2020-07-13T17:16:38.000Z": "Wear a mask, take care of your neighbors, and let's get through this storm together. #MaskUpWisconsin Governor Evers continues calls for wearing masks in public as COVID-19 cases rise dramatically -... As county and local governments start to issue their own mask and health orders, Governor Tony Evers says it might take some time to do so statewide. Evers says his Administration is exploring... wrn.com", "2020-07-10T20:19:30.000Z": "Whether it's a school, cheese plant, or restaurant, we are doing everything we can to ensure folks have the resources they need to prevent the spread of COVID-19. Learn more about @ReadyWisconsin 's work to distribute PPE statewide here: Press Release: Gov. Evers Announces Statewide Efforts to Distribute PPE to Schools, Food Processo... content.govdelivery.com", "2020-07-10T22:15:14.000Z": "1/3 As we work to eliminate racial disparities across our state, we cannot forget our kids and our schools. And folks, we have a lot of work to do. Despite Gains, State's Share Of Teachers Of Color Lags Far Behind The A report from the Wisconsin Policy Forum shows gaps between the percentage of teachers of color and students of color have grown over the last decade. wpr.org", "2020-07-10T19:14:25.000Z": "It's the last day of Wisconsin Main Street Days! Wisconsin's small, main street businesses are the heart of our economy. Support them safely by doing curbside pickup or by shopping on online at http:// mainstreetwi.com .", "2020-07-09T17:53:48.000Z": "I believe, and Wisconsinites do, too, that the people should get to choose their elected officials, not the other way around. When I ran for governor, I promised I would lead the fight for fair, nonpartisan maps, and by golly, we're going to make good on that promise.", "2020-07-09T14:44:29.000Z": "We had a race for governor in 2018. I won. Unfortunately, things got off on the wrong foot because Republicans immediately passed a law overriding the will of the people and the election, and they've been sour grapes ever since.", "2020-07-08T15:48:59.000Z": "A shout out to our local public health officers from @GovEvers , and a plea for everyone to be kind to one another. \nICYMI: You can watch yesterday's #COVID19_WI briefing here: https:// youtu.be/V2IiIpeSABI", "2020-07-07T18:04:56.000Z": "Join us at 1:30 pm today for our live media briefing for an update on COVID-19 in Wisconsin. Quote Tweet WIDeptHealthServices @DHSWI Live at 1:30. Today's briefing to update the status of the #COVID19_WI response. Watch @GovEvers , #DHSWI Secretary-designee Andrea Palm, Chief Medical Officer Dr. Ryan Westergaard, and Ryan Nilsestuen, Chief Legal Counsel in the Office of the Governor: https:// youtu.be/V2IiIpeSABI", "2020-07-06T15:52:03.000Z": "Each of us has a part to play in slowing the spread of COVID-19. Wearing your mask helps keep your community safe and healthy. #MaskUpWisconsin", "2020-07-04T17:01:08.000Z": "Staying home is the most effective way to prevent becoming infected with #COVID19 and to prevent spreading infection. But we know all of you aren't going to do that. So please, take precautions. Physically distance when you can, wash  hands often and wear a mask when appropriate.", "2020-07-05T18:15:49.000Z": "Health insurance should be affordable and accessible for everyone. That's why @OCIWisconsin launched the http:// WisCovered.com website. #GetCovered  https:// wausharaargus.com/latest-health/ new-online-resource-help-wisconsinites-get-health-insurance ", "2020-07-03T19:45:18.000Z": "Folks, we have to double down on best practices to keep our families and communities safe even during a holiday weekend. Avoid unnecessary travel, maintain social distancing, limit contact with others, and wear a mask whenever you are out. DHS: Half Of Wisconsin Counties Have High COVID-19 Activity Level There have been 29,199 positive cases of COVID-19 in Wisconsin as of Wednesday, according to the state Department of Health Services. That's an increase of 540 cases from the day before. wpr.org", "2020-07-02T21:55:38.000Z": "The #FoodSecurityInitiative is now accepting applications until 5:00 PM July 22. Food banks and pantries can apply for grants to help with costs incurred related to COVID-19. More info: http:// FoodSecurity.wi.gov  #Wisconsin  #Wisconsinfood  #WIDATCP", "2020-07-03T16:10:28.000Z": "Be like #OurCrew . Wear a mask, folks. Quote Tweet Milwaukee Brewers @Brewers The boys are back in town. #WelcomeBackCam  #ThisIsMyCrew", "2020-07-03T13:19:31.000Z": "I've always said we must take a 72 county approach that invests in Wisconsinites, from their education and training goals to their entrepreneurial spirit. WEDC proposes broadband upgrades, training incentives in report on COVID's impact The guidelines detailed in the report underscore previous statements by Hughes and Gov. Tony Evers that WEDC will be taking a new direction under Hughes' leadership, with a larger focus madison.com", "2020-07-02T19:19:47.000Z": "As we head into the holiday weekend, please remember to celebrate safely. If you do choose to set off your own fireworks, @ReadyWisconsin encourages you to consider these safety tips: Public Encouraged to Keep Fireworks Celebrations Safe - OnFocus MADISON, Wis. - As the Independence Day holiday approaches, ReadyWisconsin is encouraging everyone to keep their celebrations safe this summer. \"With several communities canceling their public... onfocus.news", "2020-07-02T15:58:56.000Z": "Celebrating July 4th shouldn't put families, friends, and neighbors at risk. COVID-19 has not gone away, folks-it is still very present and spreading in our communities. Don't risk it. Stay home, practice social distancing, and always wear a mask. Gov. Evers: Don't Risk It, Wear a Mask Celebrating July 4th shouldn't put families, friends, and neighbors at risk. COVID-19 has not gone away, folks-it is still very present and spreading in... facebook.com", "2020-07-01T20:49:16.000Z": "Charlie's right-wear a mask. It's the Midwest nice thing to do to keep our neighbors and communities safe. Wear Yer Gosh Darn Masks Thank you to Charlie Berens (Manitowoc Minute) for helping us to spread the message that we need to wear our \"gosh darn\" masks! And tell yer folks to... facebook.com", "2020-07-01T17:38:08.000Z": "Today, we announced $1.5 million in grants that will be awarded to 39 projects in Wisconsin's coastal communities to support wetland protection, Great Lakes education, and green infrastructure through @WisconsinDOA 's Wisconsin Coastal Management Program.", "2020-06-30T22:11:49.000Z": "The only thing wearing a mask says about you is that you care about other people. My mask protects you and your mask protects me. Let's continue to work together to keep our communities healthy and safe.", "2020-06-28T19:46:46.000Z": "As we continue to celebrate #PrideMonth , let's work together to reduce the economic and health disparities faced by the LGBTQ community, particularly transgender individuals and LGBTQ people of color, and continue our work to build a Wisconsin for everyone.", "2020-06-26T23:10:00.000Z": "COVID-19 is still very present and spreading in our communities. So, folks, don't risk it. Please continue to follow best practices to keep yourself and your neighbors healthy and safe.", "2020-06-26T19:32:06.000Z": "Everyone should be able to have access to quality, affordable healthcare. Visit http:// WisCovered.com and get connected to an expert who can help make sure you can get covered and find healthcare coverage that's right for you and your family.", "2020-06-23T13:19:02.000Z": "The @WisconsinDOA Routes to Recovery: Local Government Aid Grants program guide is now available: https:// buff.ly/3esuqG4 . @WisCounties  @LeagueWIMunis  @PeterWBarca  @JohnTDickert", "2020-06-23T15:55:21.000Z": "Unfortunately, with any major event like the #COVID19 pandemic there are always bad actors who want to take advantage of the situation. We want you to feel comfortable if you get a call from one of our contact tracers. Learn what to expect: http:// dhs.wisconsin.gov/covid-19/seoc. htm ", "2020-06-25T15:48:51.000Z": "The remnant prairie along WIS 133 in Grant Co. is a rare high-quality plant community within a #WisDOT right of way. Less than a fraction of a percent of all tallgrass prairies across the U.S. are still intact today, this is one of them. #PollinatorWeek", "2020-06-25T18:25:12.000Z": "I'm proud The People's Budget included a $31-million investment in the Fincantieri Marinette Marine shipyard to support worker training and infrastructure development, including $29 million through @WisconsinDOT 's Harbor Assistance grant program for the Port of Marinette. Quote Tweet WPR @WPR President Donald Trump will visit battleground Wisconsin Thursday, stopping at a shipyard in Marinette and taping a Fox News town hall in Green Bay. https:// wpr.org/president-trum p-making-wisconsin-stops-thursday ", "2020-06-23T21:05:31.000Z": "The Governor's Task Force on Climate Change is hosting its first virtual listening session tonight at 6 p.m.! @LGMandelaBarnes and the task force members want to hear from folks across our state on the impacts of climate change so register to join here: Governor's Task Force on Climate Change: Virtual Listening Session #1 Please sign up to participate in the Governor's Task Force on Climate Change Listening Session #1-hosted by Lieutenant Governor Mandela Barnes. Listening Session #1 will take place on Tuesday, June... docs.google.com", "2020-06-23T18:22:43.000Z": "Join us at 1:30 for our live media briefing at the link below: Quote Tweet WIDeptHealthServices @DHSWI The #COVID19_WI response has reached an important milestone. Live in 15, the update from @GovEvers , Secretary-designee Andrea Palm, #DHSWI Chief Medical Officer Dr. Ryan Westergaard & Ryan Nilsestuen, Chief Legal Counsel in the Office of the Governor: https:// youtu.be/LWPtAoujNSw", "2020-06-23T17:02:25.000Z": "Healthcare shouldn't be a privilege afforded only to the healthy and wealthy. Today @WisconsinOCI launched WisCovered to help folks get connected to quality, affordable health insurance. \n\nGet started at https:// wiscovered.com .", "2020-06-22T23:20:30.000Z": "Violence interrupter community programs do great work to build resiliency and strength in our communities. That's why we are calling on the Legislature to pass $1 million in support for these programs like 414LIFE. Let's do this, together. 'We're the disease stoppers': A new team in Milwaukee is treating violence like a public health... 414LIFE is based on the \"Cure Violence\" model, which takes a public health approach to gun violence. projects.jsonline.com", "2020-06-22T13:24:00.000Z": "TIME IS RUNNING OUT! Apply by 11:59 p.m. 6/23! Make sure your #smallbiz doesn't miss out on a #Wisconsin  #WeAreAllIn grant. https:// wedc.org/programs-and-r esources/wai-small-business-grant/   #SmallBizRelief  #COVID19  @GovEvers  @WWBIC  @KABAConnectHere  @MomentumWestWI  @TheNewNorth  @EnvisionGrtrFDL  @MadisonRegion", "2020-06-19T13:18:00.000Z": "ICYMI: When you submit your #WeAreAllIn grant application, make sure to double-check all your materials are complete, signed, and ready to go. Your work now will reduce delays later! https:// wedc.org/programs-and-r esources/wai-small-business-grant/   #smallbusinesses  @WisconsinSBDC  @SBA_Wisconsin  @GovEvers  @LeagueWIMunis", "2020-06-21T20:16:22.000Z": "Happy #FathersDay , Wisconsin! Wishing all the dads out there a great day.", "2020-06-21T01:19:04.000Z": "June is Alzheimer's & Brain Awareness month. Kathy and I would like to thank everyone who has been a good neighbor to aging and older adults and those with dementia during the pandemic, and all the caregivers for the care you provide to keep loved ones and vulnerable folks safe.", "2020-06-20T18:32:07.000Z": "Our state parks are the perfect place to get outside and enjoy Wisconsin's beautiful summer weather safely and responsibly. Everyone can feel safe and have fun if we continue to practice social distancing, wear masks, and maintain good hygiene habits. Free Fun Weekend brings crowds to Devil's Lake Families took advantage of free access and warm weather despite the pandemic. nbc15.com", "2020-06-20T21:47:42.000Z": "We must be willing to listen, to be uncomfortable, and to show up and do the work that needs to be done to dismantle racism in our state. It's on all of us, together. Tony Evers, Mandela Barnes unveil bills banning police chokeholds and limiting use of force Gov. Tony Evers and Lt. Gov. Mandela Barnes unveiled Friday a package of bills that would ban the use of chokeholds by Wisconsin police officers, as well as limit other lacrossetribune.com", "2020-06-18T14:45:28.000Z": "It's #NursingAssistantsWeek . Thanks to this proclamation by @GovEvers , it's the perfect time to thank our #DHSWI nursing assistants and those around the state for their hard work and dedication every day, and especially during the #COVID19 pandemic. We appreciate you!", "2020-06-19T21:32:40.000Z": "Today we celebrate #Juneteenth , one of the oldest annual commemorations of the end of slavery in the U.S. This year we celebrated by raising the Juneteenth flag over the State Capitol building for the first time in state history.", "2020-06-19T15:59:01.000Z": "Our country promises the opportunity of justice and equity and in the wake of the murders of George Floyd and Breonna Taylor and the calls for justice across our state and nation, and as we celebrate Juneteenth today, we are called to deliver on that promise.", "2020-06-06T16:00:37.000Z": "Think you need a test & can't connect w/your doctor? Make sure you take the #COVID19_WI self-checker from our partners at @RCWLaCrosse . You'll get the guidance you need about your results from trained medical professionals in less than 1 hour. Get started: http:// wihealthconnect.com", "2020-06-18T18:46:37.000Z": "Whether it is COVID-19 or maternal and infant health, we have to get to work addressing the health disparities faced by Black Wisconsinites. One of the answers is right in front of us: Medicaid expansion. Evers and Barnes Demand The GOP Stop Holding Healthcare Fixes Hostage Progress hindered on numerous fronts by Trump to state-level GOP leaders upnorthnewswi.com", "2020-06-18T14:41:59.000Z": "The immigrant community is at the heart of the founding of our state. Our immigrant families and kids are part of the fabric of our state, enriching our culture, communities, workforce, and so much more. Supreme Court Rules For DREAMers, Against Trump The decision is a dramatic victory for immigration advocates and gives a new lease on life for the so-called DREAMers, immigrants who were brought to the U.S. illegally as children. npr.org", "2020-06-17T18:45:47.000Z": "Educators, faculty, staff, and students have risen to the challenges caused by #COVID19 , but it hasn't been easy. What's best for our kids is what's best for our state, and that means ensuring schools, colleges, and universities can keep doing their good work during this pandemic", "2020-06-17T14:15:47.000Z": "Today @LGMandelaBarnes and I announced the Juneteenth Flag will fly over the State Capitol building for the first time in Wisconsin state history. \n\nRead the executive order here", "2020-06-16T21:12:34.000Z": "Wisconsin's tax filing season was extended to July 15, but @wi_revenue recommends you don't delay! Wisconsinites have just under a month left to file. \n\nLearn more here: https:// revenue.wi.gov/Pages/News/202 0/OneMonthRemainsToFileTaxes.pdf ", "2020-06-16T18:26:34.000Z": ". @WEDCNews has had more than 9,000 small businesses apply for our We're All In grant program. The good news is that there is still time for your small business to apply. Make sure to update your internet browser and apply here: We're All In Small Business Grant | WEDC Read More wedc.org", "2020-06-14T23:30:03.000Z": "We know #COVID19 is still present and spreading in Wisconsin. And we thank you for all you are doing to help keep Wisconsin healthy. Get more tips to avoid illness: http:// dhs.wisconsin.gov/covid-19/prote ct.htm ", "2020-06-16T14:42:43.000Z": "June Dairy Month is a proud tradition in our state and there's no better way to start the summer than by eating plenty of curds and ice cream to support our farmers and Ag. industry. \n\nWe're America's Dairyland, and that's one thing COVID-19 won't change. Gov. Evers: Even During COVID-19, America's Dairyland Celebrates June Dairy Month - Mid-West Farm... It's June in Wisconsin, and that means June Dairy Month. From my days working in a cheese plant, I've never missed the chance to... Read More midwestfarmreport.com", "2020-06-15T21:07:38.000Z": "Kathy and I are sorry to hear of the passing of Congressman Sensenbrenner's wife, Cheryl. She was a staunch advocate for the rights of folks with disabilities and by all accounts a wonderful woman. Our thoughts are with the Congressman and his family during this difficult time.", "2020-06-15T19:42:47.000Z": "Here in Wisconsin, we recognize that diversity makes us stronger and smarter. This is great news for LGBTQ-identified folks across our state and country. No one should have to worry about being fired for who they love or how they identify. #PrideMonth Quote Tweet NPR @NPR BREAKING: The Supreme Court has delivered a historic victory for LGBTQ people - ruling that the federal law that bars sex discrimination in employment does apply to LGBTQ employees. Show this thread", "2020-06-15T13:41:25.000Z": "The Wisconsin Farm Support Program application is now LIVE. To apply through @wi_revenue , head to: https:// tap.revenue.wi.gov/farm  #Wisconsinagriculture  #widatcp  #Wisconsin  #Wisconsinfarmers", "2020-06-14T23:16:11.000Z": "Tomorrow morning, WEDC will begin accepting applications for Wisconsin's We're All In grant initiative. This is the largest grant program for small businesses in @WEDCNews history so don't miss out. \n\nLearn more here: https:// wedc.org/programs-and-r esources/wai-small-business-grant/ ", "2020-06-14T16:37:47.000Z": "As you get outside and enjoy Wisconsin's beautiful summer weather make sure you are taking steps to stay healthy and safe. Help #StopTheSpread and avoid getting sick by staying 6 ft away from others, wearing a mask, and washing your hands frequently.", "2020-06-13T15:28:32.000Z": "I want to thank the peaceful protesters who continue to make their voices heard around the state for keeping this conversation going and demanding change. This is a watershed moment for our state and nation and inaction is not an option. Evers urges local leaders to bolster community services as protests continue Gov. Tony Evers on Tuesday pushed for state and local-level action in the aftermath of George Floyd's death in Minneapolis police custody. madison.com", "2020-06-12T22:42:01.000Z": "If you've been out in large groups, it's possible you've been exposed to #COVID19 . Help everyone stay healthy and safe by getting tested, monitoring yourself for symptoms, continuing to practice social distancing, and always wearing a mask. #StopTheSpread", "2020-06-08T17:25:19.000Z": "Access to safe #affordablehousing is a basic human right. We support #socaljustice and work to drive change. Together, let's build a more equitable future. Read more: https:// bit.ly/2Ys84ht .", "2020-06-12T18:23:05.000Z": "Earlier this week, @WisDCF awarded just over $32 million to 2,367 early care and education providers through the Child Care Counts: COVID-19 Emergency Payment Program. The second application period is open through June 19. \n\nTo apply visit: https:// dcf.wisconsin.gov .", "2020-06-11T18:31:52.000Z": "Join us live now at the link below: Quote Tweet WIDeptHealthServices @DHSWI Live at 1:30 - @GovEvers , #DHSWI Secretary-designee Andrea Palm, Chief Medical Officer Dr. Ryan Westergaard & Ryan Nilsestuen, Chief Legal Counsel in the Office of the Governor will update our #COVID19_WI response, w/a focus on grants & safety. Watch: https:// youtu.be/DuSKpt5tX2s", "2020-06-08T14:14:00.000Z": "Applications for $2,500 #WeAreAllIn grants open next Monday, 6/15! Is your #smallbiz eligible and prepared to apply? https:// wedc.org/programs-and-r esources/wai-small-business-grant/   #witrep  #SmallBizRelief  #SmallBusinesses  #covid19  @GovEvers  @LeagueWIMunis  @WisconsinSBDC  @TheNewNorth  @MomentumWestWI We're All In Small Business Grant | WEDC Read More wedc.org", "2020-06-10T15:00:16.000Z": "Tests are available. If you have any symptoms, even if they're mild, or you think you've been exposed to #COVID19_WI , you can get a test. Call your provider or log on to find a testing site near you: http:// dhs.wisconsin.gov/testing", "2020-06-08T18:53:55.000Z": "Chairperson Valcq and @GovEvers announced that on September 1, the PSC will begin accepting applications for the 2021 Broadband Expansion Grants!  \n\nNow is the time to start planning to apply for a grant to expand access to unserved areas of our state. https:// psc.wi.gov/Documents/Pres sReleases/GovernorEversPSCAnnounceDatesFor2021BroadbandExpansionGrant.pdf ", "2020-06-09T15:46:18.000Z": "The #COVID19 virus hasn't gone away. If you've been out in large groups, whether at a protest or at work, get tested for free at a local testing site in your area. COVID-19: How to Get Tested Who should get tested? Anyone with symptoms of COVID-19 or who has been exposed to COVID-19 should get tested. If you think you need to get tested: dhs.wisconsin.gov", "2020-06-06T13:13:04.000Z": "Happy #PrideMonth , Wisconsin! Pride was born out of a movement not unlike what we see today, and as we celebrate the diversity and resiliency of the LGBTQ community this month, it also is a reminder of the work we must do to ensure our state is inclusive and just for all.", "2020-06-06T19:47:37.000Z": "Throughout the #COVID19 pandemic, we have seen the disproportionate burden this virus has had on people of color. Black people make up only 6% of our state's population, yet represent 19% of the total cases and 25% of the state's deaths. Racism is a public health crisis.", "2020-06-05T22:32:26.000Z": "I #WearOrange to honor the survivors and victims of the tragic and preventable gun violence that plagues our state and our nation. We will not give up. #GunViolenceAwarenessDay Gov. Evers: Why I #WearOrange I #WearOrange to honor the survivors and victims of the tragic and preventable gun violence that plagues our state and our nation. We will not give up.... facebook.com", "2020-06-05T21:02:35.000Z": "Today would have been Breonna Taylor's 27th birthday. As we reflect today on Breonna's life, we must also reflect on the systemic change needed to address the disease of racism in our state and our country. Her life mattered and her family deserves justice. #SayHerName", "2020-06-05T20:45:09.000Z": "\"Racism itself is a public health crisis, one that impacts every facet of our lives.\" See @GovEvers ' full remarks: https:// youtu.be/fcW0vX1ETto", "2020-06-04T19:02:49.000Z": "Join me in honoring the life of George Floyd today at 2:45 CT with 8 minutes and 46 seconds of silence to reflect on his life and on the work we have to do to build equitable and just communities. Quote Tweet NAACP @NAACP Tomorrow at 3:45 PM ET, join us in observing a moment of silence for 8 minutes and 46 seconds. If you can, stop everything, and take those moments to honor the life of George Floyd. #WeAreDoneDying", "2020-06-02T17:34:30.000Z": "There was no empathy or humanity in George Floyd's death, but there must be empathy and humanity in our response to it. We must offer our compassion, we must offer our support, but most of all, we must offer our action. Gov. Evers: We Must Confront Society's Comfort with Racism There was no empathy or humanity in George Floyd's death, but there must be empathy and humanity in our response to it. We must offer our compassion, we must... youtube.com", "2020-05-31T02:42:27.000Z": "We cannot let the work of a few undermine the pain felt by our Black neighbors or distract from the source of this grief and anger-we must remember George Floyd, his life matters, he should still be alive today.", "2020-05-29T16:00:15.000Z": "Earlier this week, another Black life was extinguished before our eyes. His name was George Floyd. He was 46. His life matters and his family deserves justice. There was no empathy or humanity in his death.", "2020-05-28T15:52:25.000Z": "We all want to get back to our favorite local spots, but social distancing remains the best tool we have to prevent the spread of #COVID19 . Support Wisconsin's small businesses by using WEDC's new Main Street Marketplace website. As giant retailers dominate online shopping, Wisconsin small businesses turn to new searchable... The web portal connects shoppers to more than 230 local businesses in Main Street communities such as Green Bay, Wausau and Fond du Lac. postcrescent.com", "2020-05-28T17:27:21.000Z": "Last week, I sent a letter to the @WI_Elections Commission urging critical action to support our local governments who have gone above and beyond to keep voters safe and to protect voters with expanded absentee voting.", "2020-05-27T21:52:20.000Z": "Here in Wisconsin, we take care of our neighbors. One way you can do that is by wearing a mask correctly and safely. #COVID19", "2020-05-26T17:29:19.000Z": "Interested in learning about the WI Rental Assistance program announced by @GovEvers last week? Contact the WI Community Action Program Association agency in your area to see if you are eligible for WRAP & other assistance programs. List of agencies here: http:// bit.ly/2XnoxCY", "2020-05-27T18:02:21.000Z": "Join us for the 1:30 pm media briefing today. Live at the link below: Quote Tweet WIDeptHealthServices @DHSWI Live in 30: Today's media briefing w/ @GovEvers & #DHSWI Secretary-designee Andrea Palm focused on our #COVID19_WI response & ensuring everyone who needs a test can get one. You'll also hear from a Milwaukee doctor on the front line. Tune in at 1:30 - https:// youtu.be/yPhXuZ2YjfE", "2020-05-26T19:05:40.000Z": "Whether you own a gym, salon, hotel, bar, or store, there are basic guidelines you can follow to improve safety for your employees and customers. \n\nDon't risk it. Learn more here: WEDC Focus Forward Reopen Guidelines Wisconsin businesses look forward to a future when they can return to providing products and services to their customers. That future will require the gradual adoption of new business practices that... wedc.org", "2020-05-24T22:07:41.000Z": "To prevent spreading #COVID19 , make sure you are taking steps to protect your health and the health of your family and neighbors, such as: Staying 6 ft. away from others Washing your hands frequently Avoiding gatherings Checking out COVID-19: Avoid Illness To prevent getting and spreading COVID-19, make sure you practice good personal health habits and avoid being exposed to the virus. dhs.wisconsin.gov", "2020-05-26T13:31:00.000Z": "DEADLINE IS TONIGHT! WEDC's Ethnic Minority Emergency Grants provide $2K for diverse #smallbusinesses in #Wisconsin with up to 5 employees with losses due to #COVID19 . Apply NOW. More: https:// wedc.org/programs-and-r esources/minority-business-development/   @WisconsinSBDC  @SBA_Wisconsin  @LeagueWIMunis  @WisconsinMC  @UWSystemBiz Minority Business Development | WEDC This program supports minority business development through business creation, expansion and attraction. Read More wedc.org", "2020-05-26T14:57:11.000Z": "ICYMI: Last week we announced our robust $1 billion plan to box in #COVID19 across Wisconsin, focusing on testing, contact tracing, operations, and resources for local communities. #Thread", "2020-05-24T19:00:13.000Z": "Updated #COVID19_WI numbers. Get all the information you need: http:// dhs.wisconsin.gov/covid-19/index .htm ", "2020-05-23T20:30:00.000Z": "Plans for the weekend? If they include getting outside (and they should) remember to keep six feet between yourself & others, wear a mask, take along hand sanitizer, & relax. We're all in this together! More tips at https:// go.usa.gov/xw3Nz  #COVID19_WI", "2020-05-24T15:51:56.000Z": "Great work, Adija! As we weather this storm, we are going to get through it with great acts of kindness and compassion such as this and by looking out for our neighbors, friends, and communities. #HowWIHelp  https:// milwaukeenns.org/2020/05/19/com munity-heroes-shes-making-life-a-little-sweeter-for-essential-workers/?fbclid=IwAR3c4X2hL0LnwvJt5slhJ1AIYsmU1NNokasC6Z8TgDebGVRw5u5J92z0enc ", "2020-05-23T15:25:13.000Z": "It may seem simple, but when done correctly, hand washing is the single most effective way to prevent the spread of communicable diseases. As we to work to box in this virus, continue to be mindful about best practices to protect you and your community. What You Need To Know About Handwashing This video answers important questions about hand washing and hand sanitizer. Transcript: https://www.cdc.gov/cdctv/video-assets/healthyliving/hygiene/handwa... youtube.com", "2020-05-23T19:04:52.000Z": "ICYMI: We announced our We're All In grant initiative, providing $75 million in assistance for Wisconsin's small businesses. As more businesses continue to reopen around the state, we need to go all in on doing this together. https:// content.govdelivery.com/accounts/WIGOV /bulletins/28c2d0c ", "2020-05-22T16:09:00.000Z": "#COVID19 is a statewide challenge, but that doesn't mean it affects everyone in the same way. Some may need more specific resources. That's why we're expanding #ResilientWisconsin - because we see you & want you to know it's okay to ask for help. Details: Resilient Wisconsin Expands Reach Today the Wisconsin Department of Health Services (DHS) announced an expansion of the Resilient Wisconsin initiative. The initiative, which was launched last month, provides strategies for Wisconsi... dhs.wisconsin.gov", "2020-05-22T13:11:45.000Z": "\"Building resilience, the ability to bounce back from adversity, is key for our healthcare providers; it is also integral to our own health as individuals.\" #DHSWI Secretary-designee Andrea Palm explains why we're expanding #ResilientWisconsin . More: http:// resilient.wisconsin.gov", "2020-05-20T17:20:28.000Z": ". @GovEvers and DOA Secretary Joel Brennan announced a new program today to help Wisconsinites whose budgets have been impacted by the #COVID19 crisis & need help w/ their rent. Learn more about the Wisconsin Rental Assistance Program here: http:// bit.ly/3bMgvJ2  #WereAllIn", "2020-05-22T19:00:07.000Z": "As we head into the holiday weekend, we want to continue to encourage you to stay close to home and in your community, maintain 6 ft. of distance between yourself and others, and continue to follow @DHSWI guidelines to stay healthy and stay safe. GIF", "2020-05-22T14:48:17.000Z": ". @WisHistory has put together some great content about big moments in Wisconsin history for teachers, students, and Wisconsin History buffs to enjoy while we are all staying safer at home. \n\nLearn more here: https:// wisconsinhistory.org/BIGHistoryIsHa ppening  First Lady Kathy Evers: Connect with History While Staying Safer at... The Wisconsin Historical Society has put together some great content about big moments in Wisconsin history for teachers, students, and Wisconsin History... facebook.com", "2020-05-21T21:55:01.000Z": "\"Fear is a normal reaction to a pandemic. But hate is not.\" @GovEvers & #DHSWI Secretary-designee Andrea Palm updated the status of our #COVID19_WI response & made it clear - the virus doesn't discriminate; people shouldn't either. See the entire briefing: http:// youtu.be/9Fn1exlp5vs", "2020-05-21T23:57:05.000Z": "Deadly viruses don't go away on their own and they don't go away because the Supreme Court tells them to. COVID-19 is still spreading in our communities. Don't risk it. Stay safe, stay healthy, and stay home. #WIStaysHome", "2020-05-21T14:29:25.000Z": "The National Guard has played a critical role in responding to the #COVID19 pandemic. From testing to helping at the polls, to mortuary assistance, there's no way we would be anywhere near as successful as we have been without them. Thank you, @WI_Guard . National Guard has been Wisconsin's Swiss Army Knife in coronavirus pandemic Thousands of Wisconsin National Guard troops have been integral to handling the coronavirus pandemic. jsonline.com", "2020-05-21T18:30:08.000Z": "Remember, testing for COVID-19 is free under most private insurance plans. If you don't have health insurance but need a test, visit https:// dhs.wisconsin.gov/covid-19/testi ng.htm  for a list of free community testing sites. GIF", "2020-05-21T19:00:30.000Z": "We recognize the burden the COVID-19 response has had on our long-term care facilities, home and community-based services, and emergency medical services and the integral role they play in ensuring the health and safety of some of our most vulnerable Wisconsinites.", "2020-05-20T14:44:06.000Z": "When Wisconsinites come together we can make things happen. Let's do our part to box in this virus, keep our communities safe, and get back to our Wisconsin way of life. #COVID19  #SaferAtHome", "2020-05-20T16:35:12.000Z": "We know that folks have been hit hard by the COVID-19 pandemic, both emotionally and financially. Making sure you have a roof over your head should be the last thing on your mind.", "2020-05-19T19:00:25.000Z": "An increase in numbers because of expanded testing. It is the key to helping us #SlowTheSpread of #COVID19_WI . And tests are available. If you have any symptoms or think you've been exposed, call your provider or log on to find a testing site near you: http:// dhs.wisconsin.gov/testing", "2020-05-19T18:40:08.000Z": "Today we announced our robust $1 billion statewide effort to support #COVID19 testing, contact tracing, operations, and resources for local communities.", "2020-05-18T18:35:37.000Z": "Join us now for our live briefing as we discuss the We're All In grant initiative and updates on the state's response to COVID-19. Link below Quote Tweet WIDeptHealthServices @DHSWI Live in 15: #DHSWI Secretary-designee Andrea Palm joins @GovEvers , @WEDCNews Secretary Missy Hughes, Chief Medical Officer Ryan Westergaard & Chief Legal Counsel Ryan Nilsestuen to update the status of our #COVID19_WI response. Watch at 1:30 on YouTube: https:// youtu.be/7l5_ahRm30A", "2020-05-18T14:42:34.000Z": "This virus has not gone away. There is currently no vaccine or standard treatment for #COVID19 and the risks of spreading the infection remain. Make sure you are taking every precaution to protect your business, your employees, and your customers. \nVisit: WEDC Focus Forward Reopen Guidelines Wisconsin businesses look forward to a future when they can return to providing products and services to their customers. That future will require the gradual adoption of new business practices that... wedc.org", "2020-05-18T16:02:59.000Z": "We announced today our $75 million \"We're All In\" initiative. This grant program celebrates and helps Wisconsin's small businesses get back on their feet, while supporting best practices to keep consumers, employees, and communities safe. More here: https:// lnks.gd/2/HP9bHz .", "2020-05-16T18:52:44.000Z": "Morgan's virtual lemonade stand is a great example of what happens in Wisconsin when times get tough. Wisconsinites roll up their sleeves, they band together, and they take care of their neighbors. Great work, Morgan! #HowWIHelp This 7-year-old's Virtual Lemonade Stand Raised Enough Money to Feed 600 Families for a Week The girl raised enough money to feed 600 needy families for a week through Madison restuarant Little John's. upnorthnewswi.com", "2020-05-15T21:05:39.000Z": "Thank you, @ServeWisconsin for continuing to serve our kids and communities. From connecting with students virtually to delivering meals, we appreciate all you do! AmeriCorps COVID-19 Video PASS AmeriCorps members continue serving youth while schools and community centers are closed due to COVID-19. Not even a pandemic can stop this dedicated te... youtube.com", "2020-05-16T15:00:09.000Z": "Staying home is about more than protecting your health. When you stay home, you are helping keep your neighbors, your postal worker, your doctor, your grocery clerk, and so many more folks healthy and safe. Why do you stay home? #WIStaysHome", "2020-05-14T23:49:44.000Z": ". @GovEvers says staying the course & staying #SaferAtHome is the best way to keep our families, our neighbors & our communities safe. And he's hearing from many who pledge to do just that because they know lives depend on it. Everything he had to say: http:// youtu.be/MWWO4kpI03M", "2020-05-15T14:33:15.000Z": "We've got some great businesses in Wisconsin and we all are eager to get back to our favorite spots, but consumers need to be confident in their safety when they return. That's why WEDC put together industry specific tools for businesses, find them here: WEDC Focus Forward Reopen Guidelines Wisconsin businesses look forward to a future when they can return to providing products and services to their customers. That future will require the gradual adoption of new business practices that... wedc.org", "2020-05-14T19:00:25.000Z": "373 #COVID19_WI cases & 13 deaths since yesterday. Burnett County is reporting a death for the first time, which is also the county's first case. Pepin County, also reporting a first case. Just 2 of Wisconsin's 72 counties have 0 cases - Langlade & Taylor: http:// dhs.wisconsin.gov/covid-19/data. htm ", "2020-05-14T18:03:51.000Z": "Join us at 1:30 pm for our live media briefing. \n\nTune in here Quote Tweet WIDeptHealthServices @DHSWI Live in 30: @GovEvers and #DHSWI Secretary-designee Andrea Palm update our response to #COVID19_WI . Watch here: https:// youtu.be/MWWO4kpI03M", "2020-05-14T02:03:49.000Z": "Up to now, we were in a pretty good place in our battle against #COVID19 . We had reached almost all our gating criteria. We had opened up small businesses across the state, putting folks back to work, and that was because of the good work of Wisconsinites across our state.", "2020-05-14T01:42:22.000Z": "Look, Wisconsin Republicans want a supermajority. But you can do something to help me stop them by visiting: Save the Veto savetheveto.com", "2020-05-13T18:59:43.000Z": "Numbers are up, but trendlines are down in several of the criteria we need to hit in the #BadgerBounceBack plan to get Wisconsin moving again. See where we are: http:// dhs.wisconsin.gov/covid-19/prepa re.htm ", "2020-05-13T18:48:12.000Z": "Social or physical distancing remains the best and most effective tool in reducing the spread of #COVID19 . As we continue to work to box in this virus, remember to take precautions to protect yourself, your family members, and our communities.", "2020-05-13T12:57:31.000Z": "Today the first meeting of the Governor's Task Force on Student Debt will be held virtually at 10 a.m. CT to address the growing student debt crisis in Wisconsin. See the public meeting notice, @GovEvers ' appointments, and task force website here: https:// bit.ly/2zusSvV", "2020-04-28T18:24:05.000Z": "¿Necesita información sobre el COVID-19 en español? Esta serie de videos habla de: ¿Qué es COVID-19?. Protéjase a sí mismo y a los demás de COVID-19, y Si piensas que estás enfermo. #StopTheSpreadEC COVID-19 Información en español youtube.com", "2020-05-13T15:00:00.000Z": "Will payments from federal #CARESAct programs (PUA, FPUC, PEUC) be subject to income taxes like regular unemployment? We're answering your #COVID19 workforce questions in our FAQ: https:// dwd.wisconsin.gov/uiben/caresact /#collapse1-29 ", "2020-05-12T23:11:27.000Z": "Good news, Wisconsin-we continue to make progress to box in this virus. Once we meet all six of the gating criteria we will move out of our #SaferAtHome order and into Phase 1 of our #BadgerBounceBack plan. COVID-19: Badger Bounce Back Badger Bounce Back is Wisconsin's plan to reopen and contains the recommendations of our public health experts. Based on the science of the virus and public health practices, a gradual, phased... dhs.wisconsin.gov", "2020-05-12T22:16:23.000Z": "You all have sacrificed a lot to stay safer at home, but it has paid off. Lives have been saved and we have prevented hospitalizations. Let's continue to work together to stay safe and stay healthy, Wisconsin. #SaferAtHome #SaferAtHome: We're All in this Together You are #SaferAtHome: https://www.dhs.wisconsin.gov/covid-19/prepare.htm youtube.com", "2020-05-12T20:34:19.000Z": "We laid out our #BadgerBounceBack plan almost a month ago, and we've made significant progress in expanding testing, contract tracing, access to #PPE , and building up our health care capacity. There's still more to do, but we're resilient people, and we will bounce back.", "2020-05-11T20:41:55.000Z": "Anyone who needs a test should go get tested and help protect your community and family from this virus. Use the online screening tool and find a free testing site near you here: https:// dhs.wisconsin.gov/covid-19/testi ng.htm  .", "2020-05-11T23:59:58.000Z": "Increased testing & contact tracing are core elements of #BadgerBounceBack and are critical to helping #SlowTheSpread of #COVID19_WI - @GovEvers . #DHSWI is working w/ @WI_Guard & local health departments to ensure anyone who needs a test can get one: http:// dhs.wisconsin.gov/testing", "2020-05-11T17:57:16.000Z": "Today we announced another turn of the dial for Wisconsin businesses by adding in-person retail shopping for up to 5 customers at a time for standalone or strip-mall based stores. And, movie goers will be able to catch a show at any drive-in theater. Press Release: Gov. Evers Announces Another Turn of the Dial for Wisconsin Businesses content.govdelivery.com", "2020-05-11T16:04:02.000Z": "The National Guard is conducting FREE public COVID-19 testing at two MKE sites. Open to the public, no one will be turned away. We especially encourage those experiencing symptoms and our essential workers (healthcare, transportation, food, manufacturing, etc.) to be tested!", "2020-05-11T14:07:22.000Z": "#WisconsinNationalGuard troops, in support of Waukesha County Public Health, are testing residents for #COVID19 at the Waukesha County Expo Center today and tomorrow. Testing at this site is by appointment only, so make sure to call in advance. #AlwaysReady  #AlwaysThere", "2020-05-11T12:48:37.000Z": "TODAY: WEDC Secry and CEO Missy Hughes will answer YOUR questions at 11 about #SmallBusiness recovery from the #COVID19 pandemic. Check it out on our new Focus Forward website: http:// wedc.org/focus-forward  @WisconsinMC  @GovEvers  @DHSWI  @widatcp  @WIWorkforce  @WisconsinSBDC  @repvos WEDC Focus Forward - Working Together To Make Wisconsin Prosper Focus Forward provides financial and operational assistance programs from the WEDC and other state and federal partners that fuel economic recovery. wedc.org", "2020-05-11T14:56:09.000Z": "#ResilientWisconsin is a source of support during this challenging time. Find helplines, hotlines, and virtual meetings to help you manage #stress and adapt to change: http:// dhs.wisconsin.gov/covid-19/help. htm   #InThisTogether", "2020-05-10T13:26:24.000Z": "Happy #MothersDay to all the moms and mother-figures out there! While COVID-19 has brought new challenges and some chaos into our lives and households, today we take a moment to appreciate all you do.", "2020-05-09T19:33:06.000Z": "A #WisconsinNationalGuard specimen collection team is testing residents for #COVID19 at the St. Croix Valley Business Innovation Center in River Falls until 5 p.m today #AlwaysReady  #AlwaysThere", "2020-05-10T18:06:39.000Z": "ICYMI: @WI_DSPS crafted helpful training modules for the best and most effective use of #PPE for workers who may not typically use PPE in their work. Learn more and find the modules here: https:// dsps.wi.gov/Documents/DSPS ReleasesPPETrainingModules.pdf ", "2020-05-10T20:45:41.000Z": "This #NationalNursesMonth comes at a time of unprecedented public health challenges, which have only highlighted the importance of Wisconsin's nursing workforce. We commend you and thank you for your selflessness and profound resilience. #ThankYouNurses", "2020-05-09T22:50:25.000Z": "One thing is for certain: Wisconsin communities are tight knit. It's great to see folks all over our state supporting each other through this difficult time. Way to go, Waupun Little League! https:// nbc15.com/content/news/W aupun-Little-League-pays-it-forward-to-local-businesses--569198251.html ", "2020-05-09T17:10:16.000Z": "COVID-19 is still present and spreading through our communities. If we turn the dial too soon or too fast, we will undo the good progress we have made. Let's move Wisconsin forward, folks, by staying home and staying safe. #SaferAtHome Dr. Westergaard: The virus is like a wildfire youtube.com", "2020-05-08T18:31:51.000Z": "Live now: @GovEvers and #DHSWI Secretary-designee Andrea Palm update our #COVID19_WI response, with an emphasis on testing. That's the key to beating this virus and to the #BadgerBounceBack . \nWatch: COVID-19 Media Briefing - 5/8/2020 COVID-19 Media Briefing - 5/8/2020 youtube.com", "2020-05-08T18:19:53.000Z": "Wisconsin businesses have done a great job of adapting to the #SaferAtHome order. As we begin to turn the dial, WEDC has put together a guide for what folks need to know to reopen safely so that employees and customers can feel confident when they return. WEDC Focus Forward Reopen Guidelines Wisconsin businesses look forward to a future when they can return to providing products and services to their customers. That future will require the gradual adoption of new business practices that... wedc.org", "2020-05-08T12:45:04.000Z": "\"This virus is so insidious & difficult to control, but we're actually making progress.\" @GovEvers has often said it's about science, and science proves #SaferAtHome is working. What else we need to do under #BadgerBounceBack to get Wisconsin moving again: http:// dhs.wisconsin.gov/covid-19/prepa re.htm ", "2020-05-08T15:38:31.000Z": "With Mother's Day right around the corner, consider supporting your local florist or flower farmer during the #COVID19 public health emergency. \n\nNot sure where to look? Reach out to your local farmer's market for local vendors: https:// travelwisconsin.com/things-to-do/l ocal-foods/farmers-markets  . Wisconsin Farmers Markets | Travel Wisconsin Over 70 Wisconsin farmers markets are spread throughout the state. Find a farmers market near you to enjoy fresh fruits, vegetables and more! travelwisconsin.com", "2020-05-07T17:43:57.000Z": "We are making the shift from boxing in Wisconsin to boxing in the virus. With these disciplined steps we can and will bounce back together. \n\nLearn more about the Badger Bounce Back plan here: https:// dhs.wisconsin.gov/covid-19/prepa re.htm ", "2020-05-06T19:23:39.000Z": "The @CDCgov has expanded the list of symptoms for #COVID19 . Watch the below video to learn more about these symptoms and when to seek care. Quote Tweet WIDeptHealthServices @DHSWI DYK? @CDCgov recently expanded the list of symptoms for #COVID19 . If you are experiencing these, as #DHSWI Secretary-designee Andrea Palm explains, we encourage you to ask your healthcare provider for a test. Testing is available. Know what to look for: http:// dhs.wisconsin.gov/covid-19/sympt oms.htm ", "2020-05-06T01:21:29.000Z": "Much appreciation to @WI_Guard for answering the call at #COVID19_WI testing sites around the state. Testing is a key component of #BadgerBounceBack , ensuring everyone who needs a test can get one, helping us track & #SlowTheSpread . More: http:// dhs.wisconsin.gov/covid-19/prepa re.htm  Quote Tweet WisconsinGuard @WI_Guard DYK: A community #COVID19 testing site opened yesterday at the Resch Center in Green Bay. #WisconsinNationalGuard Troops are on site supporting Brown County Health & Human Services to ensure anyone experiencing COVID-19 symptoms can get tested. #AlwaysReady  #AlwaysThere", "2020-05-06T15:13:34.000Z": "On #NationalNursesDay , Kathy and I want to thank the frontline healthcare workers serving our communities and caring for those who are sick. We are thinking of you and will continue to fight for support for your emotional, physical, and financial well-being during this crisis.", "2020-05-06T16:18:38.000Z": "Happening now! Tune in on Facebook Live Quote Tweet Wisconsin DOT @WisconsinDOT Live in 30: Have questions about Wisconsin #DMV 's pilot programs for online driver license renewal and teen road test waivers?  DMV Administrator Kristina Boardman will answer them on #FacebookLive at 11 a.m. Join us! https:// facebook.com/WisDOT/live/", "2020-05-05T21:59:20.000Z": "\"...an innovative solution that will help dramatically extend the life of N95 masks & address the concerns many frontline workers have expressed about the safety of reusing masks.\" @GovEvers on the @Battelle system that can decontaminate 80K N95 masks/day: New Critical Care Decontamination System Coming Online \"It doesn't replace the need for more personal protective equipment, but this is an innovative solution that will help dramatically extend the life of... facebook.com", "2020-05-05T20:27:58.000Z": "May 5th is the National Day of Awareness for Missing and Murdered Indigenous Woman and Girls. Instances of violence against Indigenous women are often undercounted and ignored, but this erasure is a form of violence, too. 1/2 #MMIWGActionNow  #MMIWG  #WearRed  #NotInvisible", "2020-05-05T17:16:16.000Z": "Eleven specimen collection teams from the @WI_Guard are supporting state and local health departments to increase COVID-19 testing across the state. #InThisTogether Wisconsin Guard conducts mobile testing around state MADISON, Wis. - Eleven specimen collection teams from the Wisconsin National Guard are supporting state and local health departments to increase COVID-19 testing across Wisconsin. The teams, comprised nationalguard.mil", "2020-05-05T20:09:24.000Z": "Testing is a critical part of our Badger Bounce Back plan and everyone who needs a test should get a test. Learn more about our plan here: https:// bit.ly/3diw24o", "2020-05-05T15:19:34.000Z": "It's Teacher Appreciation Week! @LGMandelaBarnes and I wanted to take a moment to thank all the teachers out there who are working tirelessly to build virtual classrooms and support our students. Thank you, Wisconsin Educators! It's Teacher Appreciation Week! Lieutenant Governor Mandela Barnes and I wanted to take a moment to thank all the educators out there who are working... facebook.com", "2020-05-04T23:40:28.000Z": "Thank you, @ChrisAbeleMKE for your leadership for Milwaukee County and congratulations, @DavidCrowleyWI ! I look forward to working with you to tackle the issues in front of us. Quote Tweet Journal Sentinel @journalsentinel David Crowley sworn in as next Milwaukee County executive https:// jsonline.com/story/news/loc al/milwaukee/2020/05/04/david-crowley-sworn-next-milwaukee-county-executive/3077157001/ ", "2020-05-04T11:33:00.000Z": "It's Teacher Appreciation Week! THANK YOU to educators across Wisconsin who have risen to the unexpected challenges brought about by #COVID19_WI and who continue to support and engage their students in innovative and meaningful ways. #ThankATeacher  #wiedu", "2020-05-04T22:42:26.000Z": "ICYMI: @GovEvers outlined the #BadgerBounceBack testing plan during today's media briefing. The goal - to ensure every Wisconsin resident or worker who needs a test receives a test, so we can track and #SlowTheSpread of #COVID19_WI . Watch: Badger Bounce Back testing plan ICYMI: Governor Tony Evers outlined the #BadgerBounceBack testing plan during today's media briefing. The goal - to ensure every Wisconsin resident or... facebook.com", "2020-05-04T19:05:31.000Z": "#SlowTheSpread  http:// dhs.wisconsin.gov/covid-19/index .htm ", "2020-05-04T18:10:28.000Z": "Join us at 1:30 pm for our live media briefing. \n\nLink below Quote Tweet WIDeptHealthServices @DHSWI Live in 25: Today's media briefing with @GovEvers and #DHSWI Secretary-designee Andrea Palm focused on Wisconsin's #COVID19 response, Badger Bounce Back, and PPE. You can also expect remarks from a Madison-area nurse. Tune in: http:// youtu.be/6yb9XILr0gk", "2020-05-04T16:43:04.000Z": "Deadly viruses don't wait around while bureaucrats and politicians jump through procedural hoops. I am ready to put partisan politics behind us and work together to ensure public safety. Let's get to work to save Wisconsin lives. Listen here: Gov. Tony Evers Radio Address -- April 30, 2020 It's a new day in Wisconsin! Listen and subscribe to the latest updates from Wisconsin Governor Tony Evers and Lieutenant Governor Mandela Barnes. soundcloud.com", "2020-05-03T19:02:12.000Z": "As @GovEvers says, \"We can't think of this like flipping a light switch-it's like turning a dial.\" Please, stay #SaferAtHome when you can: http:// dhs.wisconsin.gov/outbreaks/inde x.htm ", "2020-05-03T21:05:50.000Z": "#WisconsinNationalGuard Soldiers and Airmen are at St. Croix Casino Campground in Turtle Lake supporting the Barron County DHHS with #COVID19 testing for residents who may be experiencing symptoms of the virus. #AlwaysReady  #AlwaysThere", "2020-05-02T16:03:41.000Z": "I have been so overwhelmed by the good work happening in communities all across our state. Feeding your community, teaching your students, and repairing fences, great work, Kaelyb. #HowWIHelp  https:// gazettextra.com/news/state/lon e-beloit-gardener-to-feed-community-amid-virus-outbreak/article_c6591903-b69e-57ad-98a5-e1171e5cd0b8.html?utm_medium=social&fbclid=IwAR2iQ-YKSrOvHSm9fLENpeV5bTyvpSsNVj2oPAXtyRyoOaff05ku9yv5uws ", "2020-05-01T22:08:37.000Z": "Public health is everyone's responsibility and viruses don't stop at county lines. Make sure you are taking precautions to protect your neighbors and communities across our state by staying close to home and in your own community. #SaferAtHome", "2020-05-02T13:00:47.000Z": "You've cheered them on. Now they're cheering for you for staying #SaferAtHome to #SlowTheSpread of #COVID19_WI . Thank you @terryporter30 , @GregGard , Casey FitzRandolph, @TonyGranato & @MattLepay . And thanks to you for your help w/ #BadgerBounceBack to get our state moving again.", "2020-05-01T15:53:57.000Z": "In March we issued Emergency Order #15 prohibiting evictions and foreclosures during the #COVID19 public health emergency. @WisLiteracy put together a helpful guide for what this means for you.\n\nAdditional information and resources are available at: http:// tenantresourcecenter.org", "2020-05-01T12:01:26.000Z": "Happy School Lunch Hero Day !! Our sincerest Thank You goes out to all of the amazing food service workers continuing to show up to work each day during this global crisis. You all are heroes today and everyday. #SchoolLunchHeroDay  #WISchoolMealsRock  #SummerFoodRocks", "2020-05-01T14:56:01.000Z": "As we continue to turn the dial, we must continue to be mindful, take precautions, and follow the safety recommendations of health professionals to get more of our workers and businesses back on their feet. #BadgerBounceBack Gov. Evers: Let's Bounce Back Together As we continue to turn the dial, we must continue to be mindful, take precautions, and follow the safety recommendations of health professionals to get... facebook.com", "2020-04-30T16:39:05.000Z": "As our state grapples with this crisis, we're seeing disproportionate numbers of Black Wisconsinites getting sick and dying from COVID-19. Today I'm joining the WI Legislative Black Caucus for their Tele-Town Hall at 3 PM to discuss this issue and what we're doing to address it.", "2020-04-30T15:50:19.000Z": "We've got some great businesses here in Wisconsin and we need their help to keep our workers and communities safe. Learn more about the safe business practices outlined to keep workers and consumers safe here: https:// wedc.org/wp-content/upl oads/2020/04/WEDC-BBB_Safer-at-Home-Safe-Business-Practices.pdf ", "2020-04-30T00:31:40.000Z": "When helping others is your calling, sometimes asking for help can be difficult. Recognize the signs of toxic stress and trauma, find tools to cope, and take time for yourself and loved ones. \nLearn more through the Resilient Wisconsin Initiative here: Resilient Wisconsin Find healthy ways to cope with stress and trauma. dhs.wisconsin.gov", "2020-04-29T21:49:05.000Z": "Last week, Legislative Republicans asked the Court to block Safer at Home without offering any alternative plan to combat the #COVID19 pandemic. #Thread", "2020-04-29T19:15:43.000Z": "I want to offer a huge thank you to these folks who are working hard to ensure every Wisconsinite has access to critical public health information.  \n\nThank you Lisa, Carly, and the whole Office of Deaf and Hard of Hearing team at @DHSWI . https:// wkow.com/2020/04/27/uns ung-heroes-sign-language-interpreters-stepping-up-during-a-pandemic/ ", "2020-04-29T14:59:28.000Z": "Starting Wednesday, businesses across our state will have more opportunities to operate using delivery, mailing, and curbside pick-up and drop-off services.  \n\nMake sure your business is prepared to do so safely by reviewing the safety requirements here: https:// bit.ly/3bKSBy7", "2020-04-28T23:22:41.000Z": "Deadly viruses don't wait around while bureaucrats and politicians jump through procedural hoops. This lawsuit puts lives at risk by trying to take away #SaferAtHome , the best and most effective tool we have to save lives and prevent hospitalizations. Press Release: Evers Administration Seeks to Save Lives, Stop Republican Lawsuit content.govdelivery.com", "2020-04-28T20:45:54.000Z": "Do you have student loans? If so, learn what the #CARESAct means for your student loans and tips for avoiding #COVID19 student loan relief scams here: https:// bit.ly/2VMT2Tb", "2020-04-28T20:45:23.000Z": "We've gotten so many questions about why #SaferAtHome needs to be statewide and why we can't reopen regionally. @GovEvers explains. Listen to his remarks, along with those from #DHSWI Secretary-designee Andrea Palm: https:// youtu.be/WvRZjZnn2JI", "2020-04-28T20:12:29.000Z": "If you're a business who wants to start doing deliveries, mailings, or curbside pick-up or drop-off, we still need you to help us make sure that our workers and folks across our state can stay safe while supporting our local businesses. Visit http:// WEDC.org for more.", "2020-04-28T15:00:27.000Z": "\"Badger Bounce Back is a community effort, and that is why we want you to have this information on our progress. Because it's your progress too. And as we make progress together, we will continue to turn the dial.\" Learn how: http:// dhs.wisconsin.gov/covid-19/prepa re.htm ", "2020-04-28T17:34:16.000Z": "People in their reentry journeys are particularly vulnerable and at-risk during this pandemic. Watch our latest #MeetFace2Face video with #Wisconsin  @GovEvers to learn more about the challenges that people on supervision face. #SecondChanceMonth Face to Face: Gov. Evers Asks How Wisconsin Can Support People on... For more Face to Face videos from The Council of State Governments Justice Center, visit https://csgjusticecenter.org/projects/face-to-face/. youtube.com", "2020-04-28T18:01:54.000Z": "Live in 30: #DHSWI Deputy Secretary Julie Willems Van Dijk and Maj. Gen. Paul Knapp, Wisconsin's Adjutant General & Commander of @WI_Guard talk about work happening at the State Emergency Operations Center. We're testing, tracing and tracking #COVID19_WI : COVID-19 Media Briefing - 4/28/2020 COVID-19 Media Briefing - 4/28/2020 youtube.com", "2020-04-24T14:32:48.000Z": "If you or someone you know needs assistance finding food, paying housing bills, accessing free childcare or other essential services, follow this link or call 211 to speak to someone who can help: https://", "2020-04-28T14:43:09.000Z": "The best way to get your federal Economic Impact Payment questions answered is by visiting the IRS frequently asked questions page. #Stimuluscheck  #stimuluspayment Quote Tweet IRS #COVIDreliefIRS @IRSnews More than 150 million Economic Impact Payments will be sent out to Americans by #IRS . If you have questions about your payments, please check the FAQs at http:// irs.gov/eipfaq  #COVIDreliefIRS", "2020-04-28T13:44:15.000Z": "I know how important getting outside and enjoying Wisconsin's beautiful spring weather is for both physical and mental health. This morning we announced that 34 state parks and forests will be reopening on May 1. \n\nLearn more here: Press Release: Gov. Evers Directs DNR to Reopen Several State Parks and Forests with Special... content.govdelivery.com", "2020-04-27T21:46:50.000Z": "\"We want you to know where we're going, how we're going to get there, and where we are in our progress along the way.\" #DHSWI Secretary-designee Andrea Palm highlights new data dashboards w/criteria needed to reopen the state. The Badger Bounce Back: http:// dhs.wisconsin.gov/covid-19/prepa re.htm ", "2020-04-27T21:27:01.000Z": "Brad Pfaff is a dedicated, passionate advocate for WI communities. He's also someone who never forgets his roots and I look forward to him bringing his western Wisconsin values to the state senate. Follow @pfaff4senate Press Releases - Pfaff for Senate bradpfaff.com", "2020-04-27T14:20:37.000Z": "Individuals currently collecting regular unemployment benefits will start receiving back payments of the $600/wk stimulus payments later this week. Weekly benefit payments will include an additional $600/wk in federal stimulus dollars until July 25, 2020. (1/2)", "2020-04-27T19:00:00.000Z": "Another day with an increase in cases. And today, Manitowoc County is reporting a death for the first time. Learn about the Badger Bounce Back plan and what we need to do to get #Wisconsin moving again: http:// dhs.wisconsin.gov/covid-19/prepa re.htm ", "2020-04-27T18:59:24.000Z": "We've got some great businesses in Wisconsin and we need them to help protect public health. For questions regarding safety precautions, businesses should visit http:// WEDC.org and review the documents below:", "2020-04-27T18:59:23.000Z": "No one wants to see our economy gain momentum as much as I do, and we're working to do everything we can to make sure we can do so as soon as we safely and responsibly can. #Thread", "2020-04-26T23:52:42.000Z": "On April 24th Wisconsin's updated #SaferAtHome order went into effect. Make sure you are up to speed on the changes by visiting https:// bit.ly/2VYEWNn . \nTranslated documents are available. #SaferAtHome  #StayHome Wisconsin COVID-19 Coronavirus Information Information regarding COVID-19 (Coronavirus) in Wisconsin govstatus.egov.com", "2020-04-24T17:25:28.000Z": "The new #SaferAtHome Order is now in effect. And that means you can do more things, like curbside pickup at your local library. So log on or call ahead and order your favorite books. Check out the order FAQs for more information: https:// content.govdelivery.com/attachments/WI GOV/2020/04/16/file_attachments/1428997/2020-04-16%20Safer%20at%20Home%20extension%20FAQ.pdf ", "2020-04-25T15:01:31.000Z": "We #SlowTheSpread w/contact tracing, ensuring we interview everyone confirmed to have #COVID19_WI & follow up w/those they've been in contact with, offering guidance & next steps, while keeping a case patient's information private. How we'll turn the dial: http:// dhs.wisconsin.gov/covid-19/prepa re.htm ", "2020-04-24T17:59:13.000Z": "If you're isolated with an abuser, the most important thing to remember is that you are not alone. Call the National Domestic Violence Hotline at 1-800-799-7233, text LOVEIS to 22522, or go to http:// thehotline.org for free and confidential support. #YouAreNotAlone", "2020-04-24T19:06:18.000Z": "Public health is a team sport. Make sure you are prepared to help keep your friends, family, neighbors, and community safe by reviewing the #SaferAtHome FAQ here: https:// bit.ly/2Vy2BoY", "2020-04-24T16:45:35.000Z": "As a bobblehead enthusiast myself, it is absolutely an honor to join the @BobbleheadHall roster alongside some governors who I think are doing an excellent job leading their respective states and listening to the science and public health experts to keep their people safe. Quote Tweet WFRV Local 5 @WFRVLocal5 The @GovEvers bobblehead is part of a series of governor bobbleheads that include Gov. @GavinNewsom of California, Gov. @andrewcuomo of New York, and Gov. @MikeDeWine of Ohio. https:// wearegreenbay.com/coronavirus/bo bblehead-of-wisconsin-governor-unveiled-part-of-series-of-governor-bobbleheads/ ", "2020-04-23T22:51:54.000Z": "Nearly 3,000 Wisconsinites have stepped up to the plate and volunteered to help during the #COVID19 public health emergency through WEAVR. I can't thank you all enough. If you would like to volunteer, visit https:// weavrwi.org .", "2020-04-21T12:45:14.000Z": "#SaferAtHome is working. Chief Medical Officer Dr. Ryan Westergaard explains how we know that. Protect yourself and your family: http:// dhs.wisconsin.gov/covid-19/index .htm ", "2020-04-23T16:45:18.000Z": "We're all in this together. And @GovEvers is asking us to come together to help those on the front lines in communities that need personal protective equipment ( #PPE ). Log on to sell or donate: https:// covid19supplies.wi.gov/Donations  #SlowTheSpread  #COVID19_WI", "2020-04-23T16:20:09.000Z": "Folks, this isn't like flipping a switch. We need to continue to protect our healthcare system from being overwhelmed and build up the tools to manage this virus, so we can turn the dial and reopen our economy. #BadgerBounceBack  #COVID19", "2020-04-22T22:30:27.000Z": "Take it from @LGMandelaBarnes and I - we know it's hard not to see your friends, but catching up virtually is safer for everyone. #SaferAtHome  #StayHome", "2020-04-22T22:12:16.000Z": ". @GovEvers and @WIS_DFI are warning debt collectors against \"harassing\" debtors during the coronavirus pandemic. Learn what you should do if you have questions or concerns about a collection agency's activities via @WPR . #COVID19 Wisconsin Regulators Warn Debt Collectors To Back Off During Pandemic The Wisconsin Department of Financial Institutions is warning debt collectors against \"harassing\" debtors during the coronavirus pandemic. wpr.org", "2020-04-22T20:47:46.000Z": "No matter how old you are, the message of The Lorax by Dr. Seuss is evergreen. In just about 15 minutes, I'll be reading it live on YouTube. Tune in at 4 PM at the link below  #EarthDay  https:// youtube.com/watch?v=LAhGYa GI1nY&feature=youtu.be&fbclid=IwAR3DlzwlQM_xnnhU2QAmcOwGU66b3MoDtSbL1uTdxyySGRNUOprK2G4JfBo ", "2020-04-22T18:02:30.000Z": "Viruses and economies go beyond borders. That's why I have teamed up with @GovWhitmer (MI), @GovMikeDeWine (OH), @GovPritzker (IL), @GovTimWalz (MN), @GovHolcomb (IN), and @GovAndyBeshear (KY) to coordinate an approach to reopen our economies and tackle #COVID19 together.", "2020-04-22T17:12:29.000Z": "My benefits are being held pending review, what does that mean? Take a look at how we define common eligibility issues from the employer handbook: https:// dwd.wisconsin.gov/ui201/b7201.htm", "2020-04-22T16:53:25.000Z": "It's the 50th anniversary of Earth Day! In celebration of this momentous occasion, WI @GovEvers has signed a proclamation that recognizes @NelsonInstitute namesake, Gaylord Nelson as the founder of Earth Day. To view the proclamation visit: https:// bit.ly/2VOoqPX", "2020-04-22T15:00:59.000Z": "From the Great Lakes to the Driftless region, to our pine filled forests, conservation is core to who we are as Wisconsinites. Happy 50th #EarthDay , Wisconsin!", "2020-04-21T16:46:45.000Z": "Starting April 24, there's some new flexibilities and changes under our #SaferAtHome order. \n\nLearn more here: https:// bit.ly/2yCjDZR", "2020-04-21T23:31:06.000Z": "Republicans are exploiting a global pandemic to further their attempts to undermine the will of the people. But what's at stake goes far beyond political power--lives are on the line. #THREAD", "2020-04-21T14:45:07.000Z": "#SaferAtHome is saving lives, and now it's time to turn the dial and begin to reopen our state. That begins with the Badger Bounce Back. Learn about Wisconsin's plan to get moving again: http:// dhs.wisconsin.gov/covid-19/prepa re.htm ", "2020-04-21T00:40:07.000Z": "ICYMI: #DHSWI Secretary-designee Andrea Palm joined @GovEvers and #WEDC Secretary Missy Hughes to outline the Badger Bounce Back, the way we will reopen the state without opening ourselves up to another wave of #COVID19_WI . Watch the entire briefing: http:// youtu.be/N5gC9P-EvyI", "2020-04-20T18:18:28.000Z": "Today we announced our Badger Bounce Back plan. This plan takes the steps Wisconsin needs to take to decrease #COVID19 cases and deaths and increase capacity in our healthcare system so that a phased reopening of businesses is possible and we can get people back to work. #Thread", "2020-04-20T01:11:53.000Z": "I want to take a moment to thank three state leaders who have announced within the last few weeks that they are retiring from the Legislature this year, and recognize them for their service to our state. #Thread", "2020-04-20T14:32:54.000Z": "Wisconsinites, I am once again calling on you to rise to the challenge. Safer at Home is working. We have reduced cases, prevented hospitalizations, and saved lives. So let's get this done together. #SaferAtHome  #COVID19 Gov. Evers: Let's Get This Done Together Wisconsinites, I am once again calling on you to rise to the challenge. Safer at Home is working. We have reduced cases, prevented hospitalizations, and... facebook.com", "2020-04-20T16:34:36.000Z": "Wisconsin is taking big steps to increase #COVID19 testing capacity throughout the state. Increased testing, and expanded contact tracing as a result, are some of the first steps to turning the dial and reopening our state.  \n\nMore here Press Release: Gov. Evers Announces Wisconsin is Taking Big Steps to Increase COVID-19 Testing... content.govdelivery.com", "2020-04-15T13:33:17.000Z": "Thank you to all the helpers who are doing everything they can to make the world a little less scary. \n\nWe see you. \nWe appreciate you. \nWe thank you.", "2020-04-19T19:00:10.000Z": "#SaferAtHome  #SlowTheSpread  http:// dhs.wisconsin.gov/outbreaks/inde x.htm ", "2020-04-19T20:48:06.000Z": "We all have to do our part to keep our family, friends, neighbors, and communities safe. #DoYourPart  #SlowTheSpread  #COVID19 COVID-19 and You As we mover deeper into the COVID-19 pandemic, it remains crucially important to keep up physical distancing. However, this new normal is also... facebook.com", "2020-04-19T15:59:00.000Z": "During a crisis, Wisconsinites rise to the challenge. Here's some ways you can help from @ServeWisconsin . #HowWIHelp", "2020-04-18T23:09:06.000Z": "As we work towards safely reopening our economy, we are going to need a lot more #PPE . The state continues to pursue #PPE through every avenue and I want to thank our federal delegation for their help in doing that.  \n\nIf you have #PPE to donate, visit: https:// covid19supplies.wi.gov/Donations .", "2020-04-18T21:30:31.000Z": "Need help? Call 800-273-8255 or text HOPELINE to 741741. http:// dhs.wisconsin.gov/prevent-suicid e/index.htm   #PreventSuicide", "2020-04-17T23:53:24.000Z": "This weekend, many of us will go out and get our weekly supply of groceries, but be sure to act with kindness, stay six feet away from the people around you, and thank the grocery store workers who are working extra hard to keep our stores safe and clean.", "2020-04-18T16:40:23.000Z": "Are you an active or retired healthcare or behavioral health professional looking to volunteer during the #COVID19 public health emergency? Get connected to opportunities to help through the Wisconsin Emergency Assistance Volunteer Registry (WEAVR) here: https:// dhs.wisconsin.gov/preparedness/w eavr/index.htm  . Wisconsin Emergency Assistance Volunteer Registry (WEAVR) The Wisconsin Emergency Assistance Volunteer Registry (WEAVR), is a secure, password-protected, Web-based volunteer registration system for health care and behavioral health professionals. dhs.wisconsin.gov", "2020-04-17T21:29:51.000Z": "As we head into the weekend, I want to thank you all for stepping up and staying home. The coming weeks are going to be tough. So grab that fish fry to-go or catch up with friends on FaceTime, and let's double down on social distancing and get through this together. #SaferAtHome", "2020-04-17T12:45:04.000Z": "\"Extending #SaferAtHome will give Wisconsin the time to finish building up the tools we need to actively manage the virus and begin our return to a new normal.\" - #DHSWI Secretary-designee Andrea Palm\nRead the order: https:// evers.wi.gov/Documents/COVI D19/EMO28-SaferAtHome.pdf ", "2020-04-17T16:05:26.000Z": "COVID19 #identitytheft  #taxscams are on the rise. We or the IRS will not call, email or text you unknowingly. If contacted, disconnect, delete and report to us or the IRS. Never give personal information. Check https:// buff.ly/2VEPbWP and https:// buff.ly/3bfXFKU for more.", "2020-04-17T17:12:24.000Z": "Yesterday we announced we are extending our #SaferAtHome order, but we also announced some important changes and flexibilities.", "2020-04-17T14:48:19.000Z": ". @hesaonlineinfo wants to remind you, that staying home-no matter your age-saves lives. #SaferAtHome  #StayHome  #COVID19 Slow The Spread Your decisions today impact our tomorrow. Be the solution, not the problem. #SlowTheSpread #HighRiskCOVID19 For more information on how to... facebook.com", "2020-04-17T15:00:00.000Z": "Like you, our crews practice #socialdistancing . Workers are encouraged to minimize interaction and do their best to keep 6 feet of distance between themselves and other crew members at project sites. #ConstructSafeWI", "2020-04-17T14:57:00.000Z": "WEDC Secretary and CEO Missy Hughes spoke with @AlysonBruner of @SpectrumNews1WI about our efforts to help small businesses and #Wisconsin farmers. Watch: Wisconsin Economic Development Corporation talks coronavirus pandemic WEDC CEO sits down to talk about small businesses. spectrumnews1.com", "2020-04-16T21:01:42.000Z": "The @USDA Meals for Kids Site Finder has been developed to help families find meals in response to #COVID19 school closures. It includes directions to nearby sites, as well as hours of operation and contact information. https:// fns.usda.gov/meals4kids", "2020-04-16T22:32:39.000Z": "It's not easy for anybody, but the best tool we have right now to keep each other safe is to #StayAtHome . But remember, just because we're physically apart, that doesn't mean we can't stay connected to our friends and loved ones.", "2020-04-16T21:42:59.000Z": "Here in the Midwest, we are bound by our commitment to our community. I am proud to be working with a bipartisan group of governors from our neighboring states to safely reopen our economy so hardworking people can get back to work and businesses can get back on their feet. Quote Tweet Governor Gretchen Whitmer @GovWhitmer Grateful to partner with @GovPritzker , @GovMikeDeWine , @GovEvers , @GovTimWalz , @GovHolcomb & @GovAndyBeshear in taking a bipartisan, fact-based, data-driven approach to reopening our economy in a way that protects families from the #COVID19 spread. More: https:// michigan.gov/whitmer/0,9309 ,7-387-90499_90640-526088--,00.html ", "2020-04-16T18:29:43.000Z": "A few weeks ago, we had a pretty grim outlook for what COVID-19 could mean for our state, but safer at home is working, folks. Our data shows we have saved lives and we have helped flatten the curve, which has resulted in fewer cases and hospitalizations. #THREAD", "2020-04-16T14:12:17.000Z": "Thank you, @RedCrossWIS and volunteers! I can't tell you how much we appreciate your tireless work to keep our communities healthy and safe. Quote Tweet Red Cross - Wisconsin @RedCrossWIS Replying to @GovEvers Our volunteers at the American Red Cross continue to amaze us, helping people with ongoing disasters like home fires & supporting our partners in need, like the National Guard at isolation sites. This compassion & teamwork serve as an inspiration during this tough time.", "2020-04-15T20:44:57.000Z": "When it comes to avoiding #COVID19_WI , a cloth face cover is not a substitute for physical distancing and #handwashing . However, you wearing a #mask can help protect others from germs you may be spreading without knowing it. Get details: http:// dhs.wisconsin.gov/covid-19/prote ct.htm   #SlowTheSpread", "2020-04-15T19:25:53.000Z": "In cooperation with @WisconsinDPI , the PSC has created a web tool to help people find emergency internet resources near them during the #covid19 health emergency. #broadband  https:// psc.wi.gov/Documents/Pres sReleases/EmergencyInternetFinder.pdf ", "2020-04-15T23:49:06.000Z": "It's no secret that #COVID19 is disrupting lives and paychecks. Whether it's putting food on the table, accessing broadband, or mental health counseling, help is available. Text COVID19 to 211-211, visit http:// 211wisconsin.org/coronavirus , or call 2-1-1 to speak with a specialist. 211 Wisconsin CommunityOS is an I&R, Disaster, and Public Health client database and case management system.", "2020-04-15T19:21:27.000Z": "I just signed Assembly Bill 1038, providing critical support and relief for Wisconsinites during the #COVID19 public health emergency. It's a good first step, but there is still more work to do for Wisconsin workers, families, first responders, businesses, and farmers.", "2020-04-15T15:17:20.000Z": "One of my favorite things to do when I visit schools is to read to students, so today I wanted to share a book with Wisconsin students called, \"Say Something\" by Peter H. Reynolds. \n\nWatch here: Storytime with Governor Evers Thank you to the many Wisconsin students and parents who are tackling school from home. It's not easy, but I appreciate your efforts to help keep our... facebook.com", "2020-04-15T16:33:13.000Z": "COVID-19 presents significant challenges, but I've never doubted Wisconsinites' resilience, empathy, or compassion. Reply and tell me your stories of the healthcare workers, first responders, neighbors, educators, businesses-you name it-who are stepping up to help.", "2020-04-15T18:04:44.000Z": "This bill is finally a step in the right direction, but there is much more work to be done. \n\nMy full statement on the Wisconsin State Senate's passage of #COVID19 response legislation is available below:", "2020-04-15T00:16:15.000Z": "Social distancing when we make our essential trips to the grocery store or pharmacy is one of the best tools we have to slow the spread of #COVID19 . Let's work together to #FlattenTheCurve .", "2020-04-14T18:18:45.000Z": "As #Wisconsin keeps physically healthy by staying #SaferAtHome , children have fewer interactions with many of the professionals trained to observe & mandated to report suspected child abuse. We need YOUR help.", "2020-04-14T18:53:00.000Z": "Thanks to you, Wisconsin, Safer at Home is working. The steps you continue to take are helping to flatten the curve and and are making things safer for everyone. Keep up the good work. Learn more at https:// go.usa.gov/xvKtw  #COVID19_WI  @GovEvers  @WIPublicHealth", "2020-04-14T16:40:48.000Z": "Find activities your family can do while staying #SaferAtHome . #WisconsinStrong  #wiedu Quote Tweet PBS Wisconsin @PBSWI Our PBS Wisconsin staff's @PBSKIDS share what they are doing while staying safe at home! Find family educational resources, activities and more at http:// pbswisconsin.org/familyresources .", "2020-04-13T19:23:56.000Z": ". @GovEvers has suspended several provisions of the Assistance to Needy Veterans Grant (ANVG) program, providing more low-income veterans access to emergency financial aid. More: https:// dva.wi.gov/Documents/news MediaDocuments/2020/04.07.20%20-%20ANVG%20Rules%20Suspension%20Press%20Release.pdf   #WisVets", "2020-04-14T16:49:15.000Z": "While our #SaferAtHome is important to protecting the health and safety of Wisconsinites, I recognize that for some, home isn't the safest space. If you need to talk to somebody about your situation or make a safety plan, contact an advocate here: Get Help - End Domestic Abuse Wisconsin Use the map below to choose the region of Wisconsin in which you live to find help and support as close to you as possible, or, select a region listed here: Northern Northeastern Southeastern... endabusewi.org", "2020-04-13T20:19:00.000Z": "The pandemic didn't create the inequities in healthcare, housing, and economic opportunities, but it has made it clear that it is unacceptable going forward. \n\nAmerica needs to invest heavily in communities that have been left behind for too long. Analysis | 4 reasons coronavirus is hitting black communities so hard Black Americans are disproportionately dying from coronavirus. Here's a look at why. washingtonpost.com", "2020-04-14T14:14:30.000Z": "Our website is now updated with more information on the Federal #CARESAct , including additional information for regular claimants, PUA claimants and those seeking extended unemployment benefits: https:// dwd.wisconsin.gov/uiben/caresact/", "2020-04-14T14:00:01.000Z": "\"We are starting to see #Wisconsin flattening the curve, which means that #SaferAtHome is working\" - @GovEvers at a briefing w/ #DHSWI Secretary-designee Andrea Palm yesterday, thanking you for social distancing to help #StopTheSpread of #COVID19_WI : Governor Evers: SaferAtHome is Working \"We are starting to see #Wisconsin flattening the curve, which means that #SaferAtHome is working.\" Governor Tony Evers laid it all out at a briefing... business.facebook.com", "2020-04-14T00:36:17.000Z": "Here are some simple tips for making sure you are complying with Wisconsin's #SaferAtHome order and helping to #FlattenTheCurve", "2020-04-13T19:23:58.000Z": "Increases to report when it comes to #COVID19_WI . In fact, two counties, #Jackson and #Juneau , are reporting deaths for the first time. More: http:// dhs.wisconsin.gov/covid-19/data. htm ", "2020-04-13T20:53:05.000Z": "Today I joined 11 other governors in calling on the federal government to open a special enrollment period for http:// healthcare.gov during the #COVID19 crisis. \n\nMore here  https:// content.govdelivery.com/attachments/MI EOG/2020/04/13/file_attachments/1425515/ACA%20Special%20Enrollment%20Letter%204.13.2020.pdf ", "2020-04-10T21:43:17.000Z": ". @FrostmanDWD has signed an agreement with @USDOL to participate in the unemployment provisions approved in the #CARESAct .\n\nIndividuals now eligible under Pandemic Unemployment Assistance should be able to submit applications the week of April 21. (1/4)", "2020-04-13T14:43:56.000Z": "Each one of us has a role to play in keeping us all safe, caring for one another, and using this challenge to bring out our best humanity. #COVID19  #SaferAtHome Quote Tweet WIDeptHealthServices @DHSWI A message from @GovEvers , who joined #DHSWI Secretary-designee Andrea Palm at Friday's #COVID19 briefing. Thank you to Wisconsin's essential workers and to everyone who is staying #SaferAtHome : http:// dhs.wisconsin.gov/covid-19/prepa re.htm ", "2020-04-12T16:45:00.000Z": "Some stress is natural. And remember, you're not alone. We're all in this together, and we'll get through this together. Learn how: http:// resilient.wisconsin.gov  #ResilientWisconsin", "2020-04-12T15:11:39.000Z": "On behalf of Kathy and myself, we'd like to wish all who celebrate a very happy Easter! While the holiday may look a little different this year, we hope you are able to connect with friends and family safely and have a great Easter while #SaferAtHome .", "2020-04-10T18:27:32.000Z": "We will be giving our live 1:30 pm media briefing with the latest updates on #COVID19 in just a few minutes. Tune in at the link below: Quote Tweet WIDeptHealthServices @DHSWI Live in 30: a #COVID19_WI media briefing. @GovEvers will be joined by #DHSWI Secretary-designee Andrea Palm, @WisVets Secretary Mary Kolar, Chief Medical Officer Ryan Westergaard, & Ryan Nilsestuen, Chief Legal Counsel in the Office of the Governor. Watch: https:// youtu.be/SPnIOxuyX0w", "2020-04-10T18:10:00.000Z": "Today @DHSWI and I announced the Wisconsin Emergency Assistance Volunteer Registry (WEAVR). Through WEAVR we are proactively creating a wide network of volunteers to increase capacity and care. And folks, we need your help. #THREAD", "2020-04-09T23:32:47.000Z": "Today I gave the weekly Democratic Radio Address to thank voters, poll workers, and reporters, and remind Wisconsinites to monitor themselves for symptoms, follow guidance provided by @DHSWI , and #StayHome . #SaferAtHome  #COVID19  Listen here: Gov. Tony Evers Radio Address - April 9, 2020 It's a new day in Wisconsin! Listen and subscribe to the latest updates from Wisconsin Governor Tony Evers and Lieutenant Governor Mandela Barnes. soundcloud.com", "2020-04-10T16:33:18.000Z": "Wisconsinites are helpers by nature-- it's in our DNA. During challenging times we are called upon to remember our character and our Wisconsin values of kindness and empathy.\n\nHere are some ways you can help your neighbors and community. Be kind, stay safe, and #StayHome .", "2020-04-09T13:29:11.000Z": "Traffic volume data shows Wisconsinites are taking the health emergency seriously and staying #SaferAtHome . By the end of March, passenger vehicle traffic was down 50% compared to the week of March 1-7, before @GovEvers issued COVID-19 directives.", "2020-04-09T20:32:47.000Z": "Join @WisVets Secretary Mary Kolar and I today at 4 p.m. for our Veterans Virtual Town Hall as we discuss programs, benefits, and services available for veterans and their families. Quote Tweet Wisconsin Department of Veterans Affairs @WisVets The Veterans Virtual Town Hall is TODAY! Join us at 4:00 p.m. to hear what's happening with WDVA programs, benefits and services, and submit your questions related to veterans issues. Click here to join: https:// join-noam.broadcast.skype.com/dva.wisconsin. gov/9e96e25faa974835825189ed2ae05837 ", "2020-04-09T16:45:16.000Z": "Reduce #COVID19 worry and risk daily: stay #SaferAtHome , wash your hands a lot for 20 seconds or more, cover your coughs and sneezes, and keep 6 feet away from others. We are #ResilientWisconsin : http:// resilient.wisconsin.gov", "2020-04-09T18:05:00.000Z": "Live now: #DHSWI and @WIWorkforce are answering your #COVID19_WI questions on #Facebook . Tune in: https:// facebook.com/DHSWI/", "2020-04-09T14:42:36.000Z": "WEDC needs your input. Please fill out the survey TODAY! Quote Tweet Milwaukee 7 @M7Region BUSINESS LEADERS: How has #COVID -19 affected your business? We need YOU to complete this survey to assist our state's recovery efforts: http:// uwo.sh/covid-19-econ- disruption  Deadline tomorrow April 10. @LeagueWIMunis  @WisconsinSBDC  @SBA_Wisconsin  @UWSystemBiz  @WisconsinMC  @WEDCNews", "2020-04-09T14:13:28.000Z": "Due to unprecedented crowds, littering and vandalism, the following Wisconsin State Parks in the Northeast Region are now closed effective Friday, April 10 for the duration of the COVID-19 emergency:", "2020-04-09T14:05:54.000Z": "I want to take a moment to thank Wisconsin students for the sacrifices they are making to stay #SaferAtHome . Gov. Evers: Thank you, Wisconsin Students I want to take a moment to thank Wisconsin students for the sacrifices they are making to stay #SaferAtHome. It's not easy. I know many of you miss... facebook.com", "2020-04-08T20:48:27.000Z": "It's time to get serious. We need to get to work and do our part to make sure our state is equipped to keep people safe and support the families, workers, and small businesses who need our help right now. #COVID19 Republicans propose giving finance committee the power to cut school aid, slash spending as part of... Republican lawmakers are developing legislation that would give a handful of them the ability to cut school aid and slash state spending. jsonline.com", "2020-04-08T17:54:52.000Z": "The American @RedCross continues to need donations during this challenging time. \n\nIf you can, please consider making an appointment to donate by: Using the Red Cross Blood Donor App, Visiting http:// RedCrossBlood.org , or Calling 1-800-RED CROSS (1-800-733-2767). Home Page Blood donors report feeling a sense of great satisfaction after making their blood donation. Why? Because helping others in need just feels good. Donate blood today to help those in need. redcrossblood.org", "2020-04-08T15:17:45.000Z": "Across our state, state employees are working tirelessly to address not only this public health emergency, but the critical needs of individuals, families, businesses, and communities. Thank you for all that you do for Wisconsinites. Gov. Evers: Thank You State Employees Across our state, state employees are working tirelessly to address not only this public health emergency, but the critical needs of individuals,... facebook.com", "2020-04-07T23:13:03.000Z": "Both as commander-in-chief of the Wisconsin National Guard and as a Wisconsinite, I could not be more proud of our Citizen Soldiers and Airmen for carrying out this important mission to protect our democracy and keep folks safe. Quote Tweet WisconsinGuard @WI_Guard \"As a traditional Guardsman drilling with an Air National Guard unit nearly two hours away from home, it feels good to be able to support my own friends and neighbors\"\n-Staff Sgt. Alan Hughes, 115th Fighter Wing #NeighborsHelpingNeighbors  #ElectionDay  #NationalGuard", "2020-04-07T19:20:42.000Z": "#SaferAtHome shouldn't mean social isolation. If you know of a family who may be struggling, help is available: domestic abuse: 1-800-799-7233 child abuse: https:// dcf.wisconsin.gov/reportabuse  crisis counselor: 1-800-985-5990", "2020-04-07T19:00:01.000Z": "We are reporting another 138 #COVID19_WI cases since yesterday, 77 hospitalizations, and 15 deaths. Please stay #SaferAtHome and help #StopTheSpread . More: http:// dhs.wisconsin.gov/outbreaks/", "2020-04-07T17:27:06.000Z": "Although I remain deeply concerned about the public health implications of voting in-person today, I am overwhelmed by the bravery, resilience, and heroism of those who are defending our democracy by showing up to vote, working the polls, and reporting on this election.", "2020-04-06T19:09:47.000Z": "#COVID19_WI  #SaferAtHome", "2020-04-06T18:34:23.000Z": "In the absence of legislative action, today I signed Executive order #74 suspending in-person voting for the April 7 spring election until June 9, 2020.", "2020-04-06T18:32:20.000Z": "Please join us for our 1:30 pm live media briefing. Tune in below: Quote Tweet WIDeptHealthServices @DHSWI Join us for today's media briefing, live at 1:30. @GovEvers , #DHSWI Secretary-designee Andrea Palm, and Chief Medical Officer Dr. Ryan Westergaard will update you on the #COVID19_WI response. \nWatch: https:// youtu.be/Esli3blev7w", "2020-04-06T13:27:11.000Z": "We're all in this together. By practicing safe hygiene and safe driving habits, for essential trips only, we can help ensure everyone's health and safety. #MondayMotivation", "2020-04-06T14:32:28.000Z": "Join us for today's media briefing, live at 1:30. @GovEvers , #DHSWI Secretary-designee Andrea Palm, and Chief Medical Officer Dr. Ryan Westergaard will update you on the #COVID19_WI response. \nWatch: COVID-19 Media Briefing - 4/06/2020 COVID-19 Media Briefing - 4/06/2020 youtube.com", "2020-04-05T22:52:36.000Z": "Ensuring first responders and healthcare professionals have the personal protective equipment they need is critical for their health and safety. We are continuing to pursue every option, including donations. If you have #PPE you can donate, visit: https:// covid19supplies.wi.gov/Donations .", "2020-04-05T15:42:33.000Z": "Following my request earlier this week, Wisconsin has been granted a federal major disaster declaration that is going to enable us to access critical resources for all 72 Wisconsin counties and for our tribal communities. \n\nMore here Press Release: Wisconsin Granted Federal Disaster Declaration Due to COVID-19 Pandemic content.govdelivery.com", "2020-04-04T23:29:49.000Z": "Republicans in the Legislature are playing politics with public safety and ignoring the urgency of this public health crisis. It's wrong. No one should have to choose between their health and their right to vote.", "2020-04-04T20:17:46.000Z": "Getting outside is good for your mental and physical health, but remember to stay close to home and six feet away from others. \n\nAlso, keep your in-person interactions to your immediate household. Now is not a time to go fishing or hiking with friends. #COVID19  #SaferAtHome Quote Tweet Wisconsin DNR @WDNR Hi Cheeseheads! WI state parks and trails are open for you to #OutWiGo -- enjoy some fresh air. We encourage you to stay close to home and within your community.\n\nSocial distance is key to slowing #COVID19 . Stay at least 6ft away from others - but don't forget about the air fives!", "2020-04-04T15:45:00.000Z": "We're all in this together. And @GovEvers is asking us to come together to help those on the frontlines in communities that need personal protective equipment ( #PPE ): https:// covid19supplies.wi.gov/Donations  #StopTheSpread  #COVID19_WI", "2020-04-04T14:59:29.000Z": "What we are doing is working, Wisconsin. Thank you for staying home and keeping your social circles small. We will get through this together from afar. #StayHome  #SaferAtHome", "2020-04-03T21:30:24.000Z": "A big thank you to first responders & health professionals on the frontlines of #COVID19_WI . And a message from @GovEvers : it's okay to ask for help. Being resilient doesn't mean you need to do this alone. We see you. We support you. #ResilientWisconsin : http:// dhs.wisconsin.gov/resilient/seco ndary-trauma.htm ", "2020-04-03T18:22:54.000Z": "Folks, today I'm announcing that I signed an Executive Order calling the Legislature to meet in Special Session tomorrow, Saturday, April 4th at 4:00 p.m. to take up changes to the upcoming spring election. Gov. Evers Calls for Special Session on Spring Election Folks, today I'm announcing that I signed an Executive Order calling the Legislature to meet in Special Session tomorrow, Saturday, April 4th at 4:00... facebook.com", "2020-04-03T17:59:28.000Z": "Don't forget to request your absentee ballot TODAY before 5PM CST. Use your voice and safely vote absentee. Get your ballot here: https:// myvote.wi.gov/en-US/VoteAbse ntee ", "2020-04-03T14:32:39.000Z": "Another media briefing today at 1:30. @GovEvers will be joined by #DHSWI Secretary-designee Andrea Palm, our Chief Medical Officer, and Chief Legal Counsel in the Office of the Governor to answer questions about our response to #COVID19_WI . \nWatch live: COVID-19 Media Briefing - 4/03/2020 COVID-19 Media Briefing - 4/03/2020 youtube.com", "2020-04-03T15:39:00.000Z": "The severity of this disease in the African American community is a crisis within a crisis. That's why the state added further resources and support to help communities, raise awareness, and ensure access to care. Nearly 100 state health workers are helping trace the coronavirus outbreak in the Milwaukee area Nearly 100 state health staffers are now helping the City of Milwaukee and two other communities try to trace the spread of the coronavirus outbreak. jsonline.com", "2020-04-03T00:50:07.000Z": "Understanding the #SaferAtHome order is important. Do your part to help #FlattenTheCurve and #StayHome by reviewing our updated FAQ document, available here: https:// evers.wi.gov/Pages/Home.aspx", "2020-04-02T22:08:25.000Z": "In the absence of the Legislature doing its part to ensure a fair and safe election, I appreciate that the court chose to implement some of the common-sense solutions that I've been advocating for. 1/3", "2020-04-02T19:54:13.000Z": "Updated numbers. Also, a new website that will connect you w/the Wisconsin #COVID19 Nurse Triage Line. If you are concerned that you may be infected w/the virus, log on to complete a health screening assessment &a licensed practitioner will contact you: http:// wihealthconnect.com", "2020-04-02T17:15:57.000Z": "The sad reality is that some scammers will take advantage of the #COVID19 crisis to take advantage of folks looking for help. Protect yourselves and your family by following these tips to prevent fraud:", "2020-04-02T14:33:00.000Z": "Protecting the health and safety of Wisconsinites is going to take not only aggressive federal action, but state action as well. Let's get this done. #COVID19 Evers one-on-one: Governor discusses state and federal response to COVID-19 MADISON, Wis. (CBS 58) - Governor Tony Evers is optimistic and confident about the state's ongoing response to the COVID-19 outbreak, though he admits that the situation will get worse before it cbs58.com", "2020-04-02T00:10:56.000Z": "We have three branches of government to ensure a system of checks and balances, and questions about our elections typically rely on all three playing a role. If I could have changed the election on my own I would have but I can't without violating state law.", "2020-04-01T20:24:58.000Z": "THREAD: Addressing this public health emergency is going to take aggressive action not only from the federal government, but from the state. What's happened on the national level is a great first step, but it doesn't go far enough for Wisconsin workers, families, and businesses.", "2020-04-01T16:58:00.000Z": "If you're experiencing a loss of income due to #COVID19_WI WIC is here to help.  Find out if you're eligible at https:// go.usa.gov/xvaJg  #WICWednesday  #WICsconsin", "2020-04-01T16:35:49.000Z": "It's on all of us to help keep our families and our communities safe. Do your part by staying home, staying six feet away from others, and staying up-to-date by following @DHSWI . \n\nWisconsin is tough and we will get through this together. #FlattenTheCurve  #StayHome  #SaferAtHome", "2020-03-31T20:50:29.000Z": "The #COVID19 outbreak has caused a lot of anxiety and many Wisconsinites are feeling overwhelmed. You are not alone. We're all in this together. There are free, confidential resources available.\n\nText TalkWithUs to 66746 or call the disaster distress hotline at 1-800-985-5990.", "2020-03-31T17:32:34.000Z": "Today I asked the president to issue a major disaster declaration for the entire state of Wisconsin. The response to #COVID19 has required tremendous action from the state and all of its communities that far exceeds the resources currently available to us.", "2020-03-30T16:41:21.000Z": "Are you an essential workforce family in need of #childcare during #COVID19 ? Find child care near you with @WisDCF new interactive map: https:// dcf.wisconsin.gov/covid-19/child care/map ", "2020-03-30T21:22:14.000Z": "It's #NationalDoctorsDay ! Take a moment to celebrate by sending a thank you note and word of encouragement to a doctor at @UWHealth . #ThankYouDoctors  #COVID19  https:// wkow.com/2020/03/30/its -national-doctors-day-heres-how-to-send-a-note-of-thanks-to-uw-health/ ", "2020-03-30T22:50:25.000Z": "THREAD: Expanding Wisconsin's testing capacity is a critical step in ensuring the health and safety of Wisconsinites. That's why today we announced a new public-private partnership to increase Wisconsin's laboratory testing capacity for COVID-19. 1/8", "2020-03-30T20:22:16.000Z": "An important message from Wisconsin State Patrol Superintendent Tony Burrell, who outlines the facts of the #SaferAtHome order.", "2020-03-30T19:16:36.000Z": "Updated numbers for you. And the number of people with negative test results for #COVID19_WI now reflects Wisconsin residents only and excludes duplicate lab results. Get specifics: http:// dhs.wisconsin.gov/outbreaks/", "2020-03-30T18:15:41.000Z": "Join us at 1:30pm for the Monday media briefing with @DHSWI for updates on #COVID19 . Live stream link below Quote Tweet WIDeptHealthServices @DHSWI We have another media briefing coming up. @GovEvers will be joined by #DHSWI Secretary-designee Andrea Palm and Chief Medical Officer Dr. Ryan Westergaard to answer questions about our response to #COVID19_WI . \nTune in at 1:30 to watch it live: https:// youtu.be/lsLuv8_5nJs", "2020-03-30T17:00:00.000Z": "I have led the Wisconsin Congressional delegation in supporting @GovEvers requests to @FEMA for additional testing supplies and #PPE for first responders and health care workers.", "2020-03-30T14:37:26.000Z": "It's important to know the facts about #COVID19 and to get the most up-to-date, accurate information, so I urge you to follow @DHSWI for the latest public health information, visit http:// wisconsin.gov/covid19 , and stay connected with trusted Wisconsin news sources. #SaferAtHome Wisconsin COVID-19 Coronavirus Information Information regarding COVID-19 (Coronavirus) in Wisconsin govstatus.egov.com", "2020-03-29T21:15:13.000Z": "http:// myvote.wi.gov/en-US/VoteAbse ntee   #SaferAtHome", "2020-03-29T19:48:25.000Z": "THREAD: I wanted to provide some updates on Wisconsin's 24/7 whole-of-government response to the #COVID19 crisis. I am incredibly grateful to have the leadership and support of @WI_Guard and @ReadyWisconsin as we work around the clock to keep our communities safe.", "2020-03-28T17:00:16.000Z": "While we want you to stay #SaferAtHome , #healthcare services are essential, so facilities remain open, although they are postponing elective and non-urgent procedures because of #COVID19_WI . For more clarity, read our recommendations for providers: http:// dhs.wisconsin.gov/covid-19/provi ders.htm ", "2020-03-28T22:10:26.000Z": "I can't say it enough-- thank you to all the healthcare professionals who are working tirelessly to care for and protect our communities through #COVID19 .\n\nWe can help them continue to do their important work by helping to #FlattenTheCurve by staying home. #SaferAtHome", "2020-03-28T16:31:54.000Z": "This is a great idea to connect communities while following the #SaferAtHome order. We are in this together, Wisconsin. #StayHome  #FlattenTheCurve Hearts up! Paper hearts of all sizes and colors have been appearing in windows and doors and on mailboxes. People are encouraged to \"hunt\" for hearts when they go on walks. When hngnews.com", "2020-03-27T23:34:51.000Z": "Looking for ways to help out your neighbors while following the #SaferAtHome order this weekend? @WI_UnitedWays and @ServeWisconsin have volunteer opportunities you can do from home. \n\nFind an opportunity that fits your abilities here: http:// volunteerwisconsin.galaxydigital.com/need/?s=1&need _init_id=2976  .", "2020-03-27T22:24:36.000Z": "Staying at home means saving lives. #SaferAtHome", "2020-03-27T21:07:53.000Z": "While many people love the beauty and character our state has to offer, we ask that you do not travel to your seasonal homes or rental cabins for the safety and well-being of our rural counties and tribal communities. #SaferAtHome  #FlattenTheCurve Rural Northern Counties Urge Seasonal, Second Homeowners To Stay Put Rural northern Wisconsin counties have issued travel advisories to seasonal and second homeowners asking them to stay in their home area. County leaders and health officials say they're asking people wpr.org", "2020-03-27T18:21:22.000Z": "Tune in for our 1:30 pm media briefing for the latest updates on #COVID19 . Quote Tweet WIDeptHealthServices @DHSWI Watch live at 1:30 - a media briefing about #COVID19_WI with @GovEvers , #DHSWI Secretary-designee Andrea Palm, DHS Chief Medical Officer Dr. Ryan Westergaard, and Ryan Nilsestuen, Chief Legal Counsel in the Office of the Governor. Tune in: https:// youtube.com/channel/UCbKdq bB5x1oJdf-jiSf4gVw/live ", "2020-03-27T17:31:08.000Z": "My focus has been and will continue to be ensuring everyone has the opportunity to cast their ballot in the upcoming election. That's why today I am calling on the Legislature to act to send an absentee ballot to every registered voter in Wisconsin.", "2020-03-26T17:30:40.000Z": "Remember, folks, trips to the grocery store are allowed under the #SaferAtHome order. Please try to limit your trips to once a week, and thank the folks working hard to keep food on the shelves and on your table.", "2020-03-26T12:45:00.000Z": "Do you have questions about #COVID19_WI , #SaferAtHome , and the best ways to protect yourself, your family, and your community? Post them here, then join us at 1:30. Log on to http:// facebook.com/DHSWI/", "2020-03-26T02:32:26.000Z": "Understanding the #SaferAtHome order is important. Do your part to help #FlattenTheCurve and #StayHome .", "2020-03-25T17:00:02.000Z": "There are nearly 79,000 semi-truck, industrial and delivery drivers in Wisconsin that are a crucial part of the supply chain as we navigate #COVID19 . Thank you for putting in the extra hours helping Wisconsin businesses and citizens!", "2020-03-25T23:03:27.000Z": "The more we have people staying home and avoiding this virus, the sooner Wisconsin can begin to recover. #FlattenTheCurve  #StayHome  #SaferAtHome EXCLUSIVE: One-on-one with Governor Tony Evers We joined Governor Tony Evers for a one-on-one interview, where Evers discussed economic and health issues related to the coronavirus. nbc26.com", "2020-03-25T22:06:00.000Z": "Thank you, @MachinistsUnion (IAM) Local 1406, for rising to the needs of our state, nation, and globe. We are in this together and I want to thank you for your good work. Wisconsin Machinists Union Members Race to Meet Global Ventilator Shortage Amid COVID-19 Crisis -... Media Contact: LaToya Egwuekwe-Smith legwuekwe@iamaw.org (815) 404-1710   FOR IMMEDIATE RELEASE Madison, Wisconsin, Thursday, March 19, 2020 - Members of Machinist Union (IAM) Local 1406 employed at... goiam.org", "2020-03-25T19:26:40.000Z": "This wasn't a decision I took lightly. We issued this order not only with public health and the business community in mind, but with leaders at the table. We will do everything we can as a state to aid small businesses during this uncertain time. #SaferAtHome  #StayHome Quote Tweet Nick Williams @NWilliamsMBJ Gov. Evers: 'I understand small businesses across the state are struggling' https:// bizjournals.com/milwaukee/news /2020/03/24/govevers-i-understand-small-businesses-across-the.html  via @MKEBizJournal", "2020-03-25T14:47:57.000Z": "#StayHome because frankly, folks, it's safer for everyone when you do. #SaferAtHome  #FlattenTheCurve Quote Tweet Governor Tony Evers @GovEvers Remember, folks: the best thing you can do to help protect not only you and your family, but our healthcare workforce is #StayHome . #COVID19", "2020-03-24T22:44:27.000Z": "ICYMI: @GovEvers joined #DHSWI Secretary-designee Andrea Palm to explain what #SaferAtHome is and how it can help #StopTheSpread of #COVID19_WI , protecting you, your family, and your community. Watch here: Governor Evers explains Safer At Home ICYMI: Governor Tony Evers joined #DHSWI Secretary-designee Andrea Palm to explain what #SaferAtHome is and how it can help #StopTheSpread of... facebook.com", "2020-03-24T18:02:20.000Z": "Thank you #childcare providers & workers for your commitment and compassion during the #COVID19 response. Because of your dedication to Wisconsin children and families, health care professionals are able to continue providing necessary care to those in need. #ThankYou", "2020-03-24T19:23:17.000Z": "Today's counts show an increase in positive test results for #COVID19_WI . Please, stay #SaferAtHome . Learn how: https:// evers.wi.gov/Documents/COVI D19/EMO12-SaferAtHome.pdf ", "2020-03-24T18:35:01.000Z": "Please join @DHSWI and I live now at our 1:30 pm briefing on the COVID-19 public health emergency and our #SaferAtHome order. \n\nWatch here: COVID-19 Media Briefing - 3/24/2020 COVID-19 Media Briefing - 3/24/2020 youtube.com", "2020-03-24T16:55:58.000Z": "The Safer at Home order I issued today, isn't a joke. It's a necessary precaution that will help protect the health and lives of many. #StayHome because it's #SaferAtHome for you, your family, your neighbors, and our communities. \n\nReview the order here: Press Release: Gov. Evers Directs DHS to Issue Safer at Home Order content.govdelivery.com", "2020-03-24T02:45:00.000Z": "We've been asking you to practice social distancing and stay 6 feet away from others for awhile now. #DHSWI Chief Medical Officer Dr. Ryan Westergaard explains why it's so important for you, your family, and our communities. Learn more: http:// dhs.wisconsin.gov/covid-19/  #COVID19_WI", "2020-03-23T21:45:05.000Z": "At the direction of Governor Tony Evers, Insurance Commissioner Mark Afable today ordered insurers operating in Wisconsin to assist restaurants that have begun offering delivery service to customers during the COVID-19 public health crisis. Learn more: https:// oci.wi.gov/Pages/PressRel eases/20200323RestaurantsCOVID-19.aspx ", "2020-03-23T18:24:02.000Z": "Tune in at 1:30 pm for our #COVID19 updates. Link below! Quote Tweet WIDeptHealthServices @DHSWI We know you have questions about #COVID19_WI , so today's media briefing w/ @GovEvers , Adjutant General Maj. Gen. Paul Knapp, #DHSWI Secretary-designee Andrea Palm & Chief Medical Officer Ryan Westergaard will be live at 1:30: https:// youtu.be/XmXeGrPuyu0  @WI_Guard  @ReadyWisconsin", "2020-03-23T12:45:00.000Z": "Together we can stop the spread of #COVID19 . \nLearn more: http:// dhs.wisconsin.gov/outbreaks/", "2020-03-23T14:34:56.000Z": "We have been working hard to ensure the health and safety of the people of our state as we have responded to COVID-19. We've taken important steps, but folks, time is of the essence. So today I'm announcing we'll be issuing a #SaferAtHome order tomorrow. Here's what this means", "2020-03-23T00:54:26.000Z": "I directed @PSCWisconsin to temporarily order further consumer protections amid the #COVID19 outbreak. When paychecks are disrupted, it is important people can keep the lights on, heat on, and water running.", "2020-03-22T19:06:52.000Z": "More positive test results to report today, and 4 deaths in our state from #COVID19 among patients who range in age from early 30s to 90s. This virus does not discriminate. Please, stay home. Practice social distancing; stay 6 feet away from others:. More: http:// dhs.wisconsin.gov/outbreaks/", "2020-03-22T23:04:33.000Z": "With the closure of schools statewide due to #COVID19 , @WisconsinDPI will be suspending administrative rules related to hours of instruction, student teacher assessments, and to provide general flexibility. Review the order here: Press Release: Gov. Evers Announces New Order Relating to Department of Public Instruction content.govdelivery.com", "2020-03-22T21:55:51.000Z": "Today I wrote to President Trump and our federal partners to stress the importance of rapid federal assistance to ensure that our state, our communities, and our tribal nations have the resources and the flexibility to respond to emerging and urgent needs.", "2020-03-20T14:37:00.000Z": "WEDC has developed a resource for small businesses, esp restaurants and retailers, to help them cope with the changes wrought by #COVID19 . Learn more: https:// wedc.org/wp-content/upl oads/2020/03/WEDC_Resources-for-COVID-19.pdf   @WisconsinSBDC  @SBA_Wisconsin  @UWSystem  @UWSystemBiz  @GovEvers  @WisconsinDOA  @WIWorkforce  @LeagueWIMunis", "2020-03-22T15:00:31.000Z": "This is a rapidly evolving situation. Keep up to date on #COVID19 in Wisconsin: http:// dhs.wisconsin.gov/outbreaks/", "2020-03-22T18:18:47.000Z": "", "2020-03-22T15:11:20.000Z": "With personal protective equipment in high demand, we are doing everything we can to ensure our first responders have the gear they need as they work to protect the public's health and safety. More on our request here", "2020-03-21T19:09:40.000Z": "Please practice social distancing; stay 6 feet away from others. #COVID19 : http:// dhs.wisconsin.gov/covid-19/", "2020-03-21T22:18:25.000Z": "Remember, folks: the best thing you can do to help protect not only you and your family, but our healthcare workforce is #StayHome . #COVID19", "2020-03-21T14:11:17.000Z": "These disaster loans from @SBAgov are another step in providing much-needed assistance to Wisconsin's small businesses during this challenging and uncertain time. Quote Tweet WEDCNews @WEDCNews HAPPENING NOW: @sba has approved #Wisconsin to access federal small business disaster loans, @GovEvers announces. Check our website at http:// wedc.org or @SBA_Wisconsin or @WisconsinSBDC for details.", "2020-03-20T21:39:26.000Z": "We know it's been a tough week, and because of #COVID19 we've released a lot of guidance telling you where not to go. But this weekend, go outside. It's okay. Stay at least 6' away from other people, but get some fresh air and do something you enjoy.", "2020-03-21T00:42:18.000Z": "ICYMI: @GovEvers joined #DHSWI Secretary-designee Palm for an  update on #COVID19 in Wisconsin. He had sad news to share, along w/a message that we'll all get through this together. Get information you need to protect yourself, your family & community: http:// dhs.wisconsin.gov/covid-19/", "2020-03-20T20:57:42.000Z": "We are calling on the federal government to take whatever steps are necessary to ensure a steady stream of facemasks, gloves, gowns and other protective items for Wisconsin's healthcare workers. \nMore information on this topic is available here: Press Release: Gov. Evers Works to Increase Wisconsin Medical Provider Access to Critical Supplies content.govdelivery.com", "2020-03-20T20:19:54.000Z": ". @DHSWI Secretary-designee Andrea Palm and I were live earlier to answer questions related to COVID-19 and provide some updates on our response. Quote Tweet WIDeptHealthServices @DHSWI Are you watching? @GovEvers and #DHSWI Secretary-designee Andrea Palm are talking #COVID19 : https:// youtu.be/-PWrN2k84h4", "2020-03-20T17:54:23.000Z": "Remember folks, be mindful of your friends and neighbors. Stay home when you can and practice social distancing. We are all in this together. #COVID19  #StayHome  #ThisIsMyCrew Quote Tweet Milwaukee Brewers @Brewers A special message from Brewers Manager Craig Counsell. \n\nLearn more at https:// dhs.wisconsin.gov", "2020-03-20T16:00:01.000Z": "Thank you to @WILaborers for donating much needed N95 masks to their local hospital. Your donation helps critical care workers fight #COVID19 . #InThisTogether", "2020-03-20T16:09:44.000Z": "Yesterday, we did a Facebook Live to answer your #COVID19 questions. Today, we're holding a media briefing, and you are invited to watch as it happens. Tune in at 1:30 - COVID-19 Media Briefing - 3/20/2020 COVID-19 Media Briefing - 3/20/2020 youtube.com", "2020-03-20T14:52:07.000Z": "The American Red Cross needs your help. Those who are healthy and feeling well are encouraged to make an appointment to donate blood as soon as possible by calling 1-800-RED CROSS (1-800-733-2767), using the Red Cross Blood Donor App, or visiting http:// RedCrossBlood.org . Home Page Blood donors report feeling a sense of great satisfaction after making their blood donation. Why? Because helping others in need just feels good. Donate blood today to help those in need. redcrossblood.org", "2020-03-19T21:36:50.000Z": "", "2020-03-19T17:59:21.000Z": "I have always said that Wisconsinites are helpers by nature. It's in our DNA. If you are looking for ways you can help during these challenging times, check out the COVID-19 Response Initiative established by @WI_UnitedWays and @ServeWisconsin : http:// volunteerwisconsin.galaxydigital.com/need/?s=1&need _init_id=2976 ", "2020-03-19T16:55:39.000Z": "While it is important to stay informed with the latest news regarding COVID-19, it can also cause a lot of fear, stress, and anxiety. \n\nIf you need to talk, support is available. Call @DistressLine at 1-800-985-5990 or text TalkWithUs to 66746. #NoStigma", "2020-03-19T15:11:54.000Z": ". @LGMandelaBarnes and I wanted to take a moment to thank all of those working on the frontlines to keep our families and communities safe during COVID-19. Thank you.", "2020-03-18T20:43:15.000Z": ". @WisDCF is working to ensure that child care providers have the resources and supplies they need. If you are a child care provider who needs assistance during the COVID-19 public health emergency, contact DCF here: https:// dcf.wisconsin.gov/childcare-supp lies?fbclid=IwAR23-U2vJVzKmKypU_4w4XKpqGXp1nI6Y2RrHtbKi37hgNbWu53_bwvXD1Q ", "2020-03-18T16:52:39.000Z": "I requested federal financial assistance for Wisconsin businesses. COVID-19 is impacting even the best operators. As a state, we extend our promise to work with our federal and state officials to be a partner to you during these uncertain times. More here: Press Release: Gov. Evers Submits Request for Economic Injury Disaster Loan Assistance for Small... content.govdelivery.com", "2020-03-18T18:51:55.000Z": ". @GovEvers orders child care centers to scale down to 10 or less teachers and 50 or less children effective 8 a.m. on March 19. Providers encouraged to prioritize families of essential workers, such as first responders/health care staff. Read full order at https:// content.govdelivery.com/attachments/WI GOV/2020/03/18/file_attachments/1404852/DHS%20Order_3.18.2020.pdf ", "2020-03-18T16:56:58.000Z": ". @GovEvers has put together a central location for all of your #COVID19 related government topics. You can find info from multiple government agencies as well as sign up for alerts: http:// wisconsin.gov/covid19", "2020-03-18T14:15:31.000Z": "Yesterday, we limited gatherings to 10 or less people for the health and safety of the public. If you have questions about how our latest order impacts your life or business, we have an FAQ available here: https:// evers.wi.gov/Documents/COVI D19/Mass%20Gathering%20FAQ%203.17.20.pdf ", "2020-03-17T22:52:39.000Z": "And remember to thank retail staff for keeping the shelves stocked and for staying on the job! Many of them are working long hours and facing stressed customers. Quote Tweet Governor Tony Evers @GovEvers Grocers across the state are working hard to keep shelves stocked. When shopping, please be mindful of your friends and neighbors, as stockpiling can lead to unnecessary shortages and will hurt us all down the road. \n\nWe are all in this together, folks.", "2020-03-17T21:09:10.000Z": ". @GovEvers & @WIWorkforce DWD issued an emergency order waiving work search requirements for unemployment insurance benefits. Have also asked the legislature to repeal one week waiting period for benefits so affected workers are supported quickly. Visit: http:// bit.ly/2TXa9AB", "2020-03-17T22:51:58.000Z": "Grocers across the state are working hard to keep shelves stocked. When shopping, please be mindful of your friends and neighbors, as stockpiling can lead to unnecessary shortages and will hurt us all down the road. \n\nWe are all in this together, folks.", "2020-03-17T18:17:21.000Z": "I will be joining @DHSWI on the media briefing call at 1:30 pm. Tune in here: https:// youtu.be/rv9lwwZdtTk Quote Tweet WIDeptHealthServices @DHSWI We have a media briefing at 1:30 w/ @GovEvers , Secretary-designee Andrea Palm, and #DHSWI & Wisconsin State Laboratory of Hygiene at @UWMadison experts. They'll talk #COVID -19, the testing process & guidance to keep you & your family safe.\nWatch live: https:// youtu.be/rv9lwwZdtTk", "2020-03-17T19:18:48.000Z": "A few moments ago, I announced that at 5pm tonight bars will be closed and restaurants will be take-out or delivery only statewide. Our top priority at this time is to keep Wisconsinites safe and healthy by reducing the spread of COVID-19, especially for those who are high-risk.", "2020-03-17T15:00:28.000Z": "1/2 The American Red Cross needs your help. Those who are healthy and feeling well are encouraged to make an appointment to donate blood as soon as possible by using the Red Cross Blood Donor App, visiting http:// RedCrossBlood.org or calling 1-800-RED CROSS (1-800-733-2767). Home Page Blood donors report feeling a sense of great satisfaction after making their blood donation. Why? Because helping others in need just feels good. Donate blood today to help those in need. redcrossblood.org", "2020-03-17T02:08:23.000Z": "These permits will allow us to get more supplies and resources on the shelves and to the folks who need them. Thank you to @WisconsinDOT for their work to get this done. WisDOT to issue COVID-19 relief permits to speed up store inventory deliveries COVID-19 Relief Effort Supply Permits will allow for additional supplies to be moved across Wisconsin interstates, most highways and local roadways by increasing weight limits and waiving truck... nbc15.com", "2020-03-16T23:43:31.000Z": "Limiting gatherings to 50 people or less is another critical step forward in slowing the spread of COVID-19. I know this is hard for many communities, but keeping the public safe and healthy is our top priority. \n\nMore here: Press Release: Gov. Evers Directs DHS to Prohibit Mass Gatherings of 50 People or More content.govdelivery.com", "2020-03-16T22:21:22.000Z": "As part of our COVID-19 response, the Office of the Commissioner of Insurance has requested that health plan issuers be flexible on prescription drug supply limitations and early refill limitations. \n\nLearn more at https:// oci.wi.gov/Pages/Regulati on/Bulletin20200306COVID-19.aspx  .", "2020-03-16T17:08:18.000Z": "Folks, it's on all of us to practice social distancing and take every step possible to mitigate the spread of COVID-19. That is why I have directed @DHSWI Secretary-designee Andrea Palm to order a ban on mass gatherings of 50 or more people. 1/3", "2020-03-16T14:05:08.000Z": ". @WisconsinDPI is working diligently to ensure our kids have nutritious meals while schools are closed due to COVID-19 by applying for a waiver that allows them to send meals home to kids. More at: Child Nutrition Program COVID-19 Information Overview The Wisconsin School and Community Nutrition Teams have created a webpage to help School Food Authorities, Summer Food Service Program (SFSP) and Child and Adult Care Food Program (CACFP)... dpi.wi.gov", "2020-03-16T00:35:07.000Z": "Thank you to all the healthcare workers, direct care workers, public employees, and those on the frontlines for rising to the need of our communities during COVID-19. Your service to our state and communities is greatly appreciated.", "2020-03-16T00:07:31.000Z": "Yesterday I sent a letter to @SenatorBaldwin and @SenRonJohnson asking for them to support bipartisan legislation to address the COVID-19 public health emergency.", "2020-03-14T17:30:00.000Z": "If all the talk about #COVID19 is making you feel overwhelmed or frightened, support is available. Call @distressline at 1-800-985-5990 or text TalkWithUs to 66746. You are not alone. #COVID19_WI  #NoStigma  @GovEvers  @DHSWI", "2020-03-15T14:57:59.000Z": "Did you watch? @GovEvers and #DHSWI Secretary-designee Andrea Palm appeared on @WKOW and #CapitalCitySunday this morning, talking #COVID19 , the public health emergency declaration, and what's next for Wisconsin: http:// wkow.com/2020/03/15/cap ital-city-sunday-gov-evers-dhs-sec-andrea-palm-on-covid-19-response/ ", "2020-03-15T15:18:21.000Z": "On Thursday, I declared a public health emergency in Wisconsin relating to COVID-19 to make sure Wisconsin is proactive in slowing and preventing the spread of the virus. \n\nWatch here: https:// facebook.com/GovernorTonyEv ers/videos/825613747916941/  . Governor Tony Evers on Facebook Watch LIVE: Governor Evers press conference on COVID-19 facebook.com", "2020-03-14T20:01:52.000Z": "At the direction of Governor Evers, the Wisconsin Department of Transportation may issue permits for the transportation of inventory to supply grocery retailers impacted by the #COVID -19 pandemic. https:// wisconsindot.gov/Pages/about-wi sdot/newsroom/news-rel/031429-COVID19Permits.aspx ", "2020-03-14T22:40:28.000Z": "Being mindful about using best practices, like washing your hands frequently and avoiding direct contact with others will help protect not only you, but your friends, family, and neighbors from the spread of COVID-19. #COVID19", "2020-03-14T17:08:45.000Z": "We know the #COVID19 situation is evolving quickly. Check out our guidance on gatherings and advice for social distancing, then get all the information you need: http:// dhs.wisconsin.gov/covid-19/index .htm ", "2020-03-13T21:28:45.000Z": "Today, I directed @DHSWI to issue an agency order mandating the closure of all K-12 Wisconsin schools, public and private, as part of our efforts to respond to and contain the spread of COVID-19 in Wisconsin.", "2020-03-13T17:22:49.000Z": "Each one of us has a role to play in reducing and slowing the spread of #COVID19 . Do your part. Be mindful, be prepared, and stay informed by following @DHSWI .", "2020-03-12T23:38:10.000Z": "Things you can do to help prevent illness and avoid being exposed to #COVID19 : Wash your hands Avoid touching your face Cover your mouth when you cough or sneeze Stay home if you're sick Stay informed by visiting COVID-19 (Coronavirus Disease) COVID-19: Wisconsin data dhs.wisconsin.gov", "2020-03-12T17:10:44.000Z": "1/ This morning I declared a public health emergency in the state of Wisconsin related to COVID-19. This will allow @DHSWI and other state agencies to utilize every tool available to them to prevent the spread of coronavirus and protect public health. Press Release: Gov. Evers Declares Public Health Emergency Due to COVID-19 content.govdelivery.com", "2020-03-11T16:02:00.000Z": "Happening now. What do you want to know about #COVID -19? We're answering your questions in a #Facebook live. Log on: http:// facebook.com/DHSWI", "2020-03-10T12:45:02.000Z": "More labs across the country are able to test for #COVID -19. And now, Wisconsin clinicians can order tests without public health approval. We expect the number of tests will be increasing, but remember, tests don't necessarily mean infections. Learn more: http:// dhs.wisconsin.gov/disease/covid- 19.htm ", "2020-03-11T14:20:47.000Z": "I'm going to keep fighting for Wisconsin's farmers, no matter what. Plain Talk: Republicans bungled Wisconsin's farm crisis at every turn Wasn't it rich last month watching Wisconsin legislative Republicans trip all over themselves to finally help Wisconsin farmers weather this ruinous rural economy? madison.com", "2020-03-10T21:10:31.000Z": "Last year I met with folks in Trempealeau County as they were recovering from devastating floods and I listened to their needs as a community. Today I announced bipartisan legislation inspired by those conversations and took it back to the community to get folks' thoughts.", "2020-03-10T20:37:37.000Z": "We must do more to address the health disparities that continue to plague communities of color in Wisconsin, especially in infant and maternal health. Thank you @StateSenLaTonya for highlighting this important issue! Sen. LaTonya Johnson: Glaring infant mortality rates demand state action As a mother and former child care provider, the health and well-being of our children - regardless of their zip code - is one of the most prominent reasons I madison.com", "2020-03-09T21:18:13.000Z": "We're planning a #FacebookLive to answer your #COVID -19 questions. Send them to us by replying to this tweet, or posting on our Facebook page - @DHSWI . We'll see you Wednesday morning.", "2020-03-09T21:39:28.000Z": "Kathy and I joined @DHSWI Secretary-designee Andrea Palm today in La Crosse for a roundtable on caregiving to hear from local professionals and family members who are caring for loved ones about the unique challenges they face caring for folks across our state every day.", "2020-03-09T19:23:56.000Z": "Today Kathy and I visited the Wisconsin Alzheimer's Disease Research Center. With more than 100,000 Wisconsinites living with Alzheimer's or dementia, we must continue to support the good work of folks like the @WisconsinADRC and @WAI_Alzheimers .", "2020-03-09T14:20:50.000Z": "This weekend Kathy and I celebrated the first maple tree tapping of the season at Inthewoods Sugar Bush! Maple syrup producers are an integral part of our state's economy and culture, which is why I declared March 15 through April 15 as Maple Syrup Month in Wisconsin.", "2020-03-08T02:42:31.000Z": "#OnWisconsin  Quote Tweet Wisconsin Basketball @BadgerMBB BIG TEN CHAMPIONS   #OnWisconsin » #Badgers", "2020-03-07T16:24:39.000Z": "ICYMI: This week @WisconsinDOT and I announced a $75 million investment in Wisconsin roads. Marathon County will be using the funds for a new roundabout, improving safety, and addressing traffic congestion. More here: https:// wsaw.com/video?vid=5685 02582 ", "2020-03-06T21:56:47.000Z": "It's National Employee Appreciation Day! I want to thank all the state employees who spend day in and day out serving the people of Wisconsin from health services to corrections, to transportation. Thank you! #EmployeeAppreciationDay", "2020-03-06T19:44:43.000Z": "We cannot delay in providing critical support to Wisconsin farmers. They've had our back for generations and it's time to have theirs. I look forward to the Senate taking up the bills on agriculture this month. #FarmFriday 'America's Dairyland': Wisconsin's farmers see bleak future Collapsing prices, the rise of mega farms in warmer states and fluctuations in demand have led to a spate of bankruptcies theguardian.com", "2020-03-06T17:25:35.000Z": "Teachers play an enormous role in our kids' lives. They help kids navigate their most formative years, often at the expense of their own time, money, and emotional bandwidth. To quote @KristinKarnitz , \"Teachers are not just educators.\" Opinion: Teachers aren't losers. They're lifesavers On Monday night, Donald Trump Jr. told a campaign rally crowd to \"Keep up that fight. Bring it to your schools. You don't have to be indoctrinated by these loser teachers.\" In response, this mom... pbs.org", "2020-03-04T21:46:56.000Z": "Good luck to all the Wisconsin producers competing in Madison this week at the World Championship @cheesecontest ! Folks come from all over the world to compete, so let's show them what America's Dairyland has to offer and bring home some wins. #CheeseContest", "2020-03-04T19:31:49.000Z": "No matter where you go in Wisconsin, folks can all agree that we need to fix our crumbling roads. Today I joined @WisconsinDOT Secretary-designee Thompson in announcing funding for 152 local road projects across the state in nearly all of Wisconsin's 72 counties.", "2020-03-03T18:47:16.000Z": "The People's Maps Commission is about ensuring Wisconsinites are empowered to have a voice in the redistricting process, something has has been severely lacking in the past. I look forward to seeing the good, nonpartisan work of this commission. Wisconsin governor sets up unique redistricting panel Wisconsin Gov. Tony Evers (D) is taking a new weapon into the fight for control of the decennial redistricting process in a state where Democrats say Republicans have consistently built themselves a thehill.com", "2020-03-01T17:10:32.000Z": "Finished our trip up north campaigning with Rep. Beth Meyers in Bayfield! \n\nAlways excited to travel up north and fight to re-elect Democrats. Thank you to everyone who came out to support Rep. Meyers!", "2020-02-29T21:12:36.000Z": "Stopped by @ThirstyPagan in Superior to support @NickMilroy ! \n\nThank you to everyone who came out today to support Nick. And, it's always great to grab some pizza in Superior.", "2020-02-29T18:13:43.000Z": "I stopped by the 54665 Podcast to talk about economic development in Wisconsin's rural communities with @viroqua_chamber and @wiscochef ! Listen here: 54665 \"54665\" is a podcast for entrepreneurs who are on the go. Whether you are at the idea stage or are having the seven-year itch, \"54665\" is about meeting people where they are. All of us are just... stitcher.com", "2020-02-29T16:03:42.000Z": "Look who we ran into on a beautiful Saturday morning in #Wisconsin  @Tony4WI  #wispolitics  #voteblue2020", "2020-02-29T16:50:52.000Z": "Up early to join the @WisDems County Chairs Association for breakfast in the Dells! \n\nOur County Chairs do hard work on behalf of grassroots Democrats and I appreciate that they took the time to hear from me this morning about our fights in 2020!", "2020-02-28T15:39:00.000Z": "Clean hands are essential to avoid catching and spreading viruses, like the flu and COVID-19. Download & print this poster & put it in a place everyone will see it & follow it. Find it at https:// go.usa.gov/xddgR  #FightFlu  #COVID19_WI", "2020-02-27T21:04:29.000Z": "Clinicians are available to offer support, guidance, & connect anyone who needs assistance to available resources. \n\nMKE County's 24-Hour Crisis Line is 414-257-7222. #MilwaukeeStrong Milwaukee County offering 24-hour crisis line after Molson Coors mass shooting After the mass shooting at Molson Coors Beverage Company, services are available to help those impacted by the tragedy. tmj4.com", "2020-02-27T19:23:36.000Z": "Good news, folks. Under my education plan we can do both. Quote Tweet MULawPoll @MULawPoll Which is more important, reducing property taxes or increasing school spending? 56% say schools, 38% say property taxes. #mulawpoll", "2020-02-27T00:16:10.000Z": "I want to say thank you to the folks at Molson Coors and our first responders who acted quickly to contain the situation and get folks and students in the nearby areas to safety.", "2020-02-25T16:47:25.000Z": "It's the last week of #BlackHistoryMonth , but there are still plenty of ways to celebrate with the Legislative Black Caucus. Find an event here:", "2020-02-24T23:05:52.000Z": "Frankly, nothing is \"dead.\" The Wisconsin State Legislature is a full-time legislature and these folks are elected to serve until the end of the year. There are issues that I know both parties want to get to work on, so let's get to work. There's no rest for the elected. Quote Tweet Scott Bauer @sbauerAP After a wild week in the Wisconsin Legislature, here's a look at what's dead, what's not dead yet and what's likely to become law: https:// apnews.com/73df73e5e360f7 37441d92900853cc08 ", "2020-02-24T19:22:46.000Z": "It's We Love Our Public Schools week! Some of the most meaningful moments in my life have happened in a public classroom, from meeting my wife in kindergarten to my first teaching job in Baraboo, to the schools I visit today as governor. I am #PublicSchoolProud .", "2020-02-24T15:21:27.000Z": "My administration is working diligently to continue to expand inclusivity and diversity in state government. That includes a paid internship opportunity for students over the age of 18 to explore careers in state government. Learn more here: https:// bit.ly/2TmKyBo", "2020-02-23T15:58:51.000Z": "From determining how our next electoral maps will be drawn to how much federal funding we receive for our schools, roads, and healthcare, the 2020 Census will set the stage for our state for the next decade. Learn more about getting involved here: Census Bureau reaches 65% of recruiting applicant goal, still needs over 18,000 Wisconsin census-... The United States Census Bureau said it reached nearly 65% of its recruiting applicant goal in Wisconsin, though it still needs over 18,000 people to apply for census taker positions throughout the... channel3000.com", "2020-02-22T15:04:01.000Z": "Our state has survived on the resiliency of Wisconsin farmers, but we know times are tough. Stop by a free workshop hosted by @widatcp to discuss stress management techniques and resources available to you and your family. Quote Tweet Wisconsin DATCP @widatcp As part of its efforts to support farmers facing increased stress due to economic challenges, the Wisconsin Farm Center is hosting a series of one-day workshops called 'Unexpected Tomorrows.' https:// datcp.wi.gov/Pages/News_Med ia/UnexpectedTomorrowsPressRelease.aspx ", "2020-02-21T17:43:54.000Z": "These days broadband isn't a luxury, but a necessity. It is critical to expanding access to education, ensuring business growth, and connecting our communities. We made the largest state investment in broadband in our state's history so let's get to work to get folks connected. Quote Tweet WPR @WPR This year, Wisconsin will provide a record $24 million for broadband internet in underserved areas of the state through a grant program, but it received double that amount in requests. https:// buff.ly/38o0Qyz", "2020-02-21T21:32:53.000Z": "It's National Caregivers Day, Wisconsin! Our Task Force on Caregiving is working to find ways to strengthen our direct care workforce and better support those in the field. Thank you, caregivers, for all your hard work.", "2020-02-21T15:23:02.000Z": "There's some pretty interesting characters on our #Census2020 Complete Count Committee, including Captain Census from @WisVoices and he's got a message for you:", "2020-02-20T15:17:30.000Z": "In my administration we believe in second chances and I had the pleasure of pardoning 7 more folks who have been working to better themselves and their communities. \n\nLearn more about the pardon application process here: https:// evers.wi.gov/Pages/pardon-i nformation.aspx  'It's all been forgiven': Gov. Tony Evers grants 7 more pardons So far, Gov. Tony Evers has granted nearly 30 pardons after his predecessor, former Gov. Scott Walker, issued zero. \"This is one of the best parts of my job,\" Evers madison.com", "2020-02-20T02:58:45.000Z": "I know there are Republicans concerned about the high price tag of their own unsustainable tax bill that shortchanges our rainy day fund. My plan invests in our kids and property tax relief. There's still time to do the right thing.", "2020-02-19T18:04:57.000Z": "Folks, this isn't sustainable for our schools, for our kids, or for the future of our state. We cannot allow our school districts to continue to rely on referenda to find funding. Under my proposal, school districts like Nekoosa would get the bump in funding they greatly need. Quote Tweet Wisconsin Rapids Daily Tribune @wrtribune \"We're taking away services in the classroom that are needed.\" https:// wisconsinrapidstribune.com/story/news/202 0/02/06/nekoosa-schools-referenda-april-2020-academic-athletic-upgrades-avoid-closures/2620555001/ ", "2020-02-19T15:34:54.000Z": ". @LGMandelaBarnes and I had a great time volunteering at the @KCCorp , @Huggies , @UnitedWayGMWC , @UnitedFoxCities , and @DiaperNetwork 's diaper repack event last week. Thanks for your hard work everyone and thank you for having us!", "2020-02-18T17:39:19.000Z": "Kathy and I stopped by our polling place this morning to vote. Wisconsinites, what's your plan to vote today? Reply below", "2020-02-18T03:00:42.000Z": "Excited to be there tonight for @SheliaStubbs4WI 's birthday party!", "2020-02-17T20:16:15.000Z": "Our schools and our taxpayers--especially in rural communities--need this support and they need it now. Let's put people above politics and get this done. Evers Calls for $250 Million in School Spending - Door County Pulse Kitchens doubts proposals will go anywhere Door County schools would get a small influx of revenue under a package of education bills proposed by Gov. Tony Evers, but Republicans say the proposals... doorcountypulse.com", "2020-02-16T18:39:07.000Z": "Our state has a rich history of opening its doors to people of all backgrounds, experiences, and walks of life. The Hmong community is an integral part of the fabric of our state, and we will stand with and support our Hmong neighbors. Evers Calls On Trump Administration To Halt Negotiations On Hmong Gov. Tony Evers is calling on the U.S. State Department to reconsider negotiations that would allow the U.S. to deport Hmong residents to Laos. wpr.org", "2020-02-17T15:06:24.000Z": "The spring primary is tomorrow and it is important to make sure your registration information is up to date. Make sure you're registered by visiting http:// myvote.wi.gov or by calling your municipal clerk's office. Remember: you can register when you go to the polls tomorrow! Quote Tweet Wisconsin State Journal @WiStateJournal To see if you are among the 232,000 voters who were sent a mailing in October, search the database below. https:// madison.com/wsj/news/local /govt-and-politics/elections/check-to-see-if-you-re-on-the-list-of/article_fcadff84-1c96-5d88-8630-71b7ed6fa0ec.html?utm_medium=social&utm_source=twitter_WiStateJournal ", "2020-02-14T20:05:03.000Z": "The Wisconsin Rural School Alliance is right-- my proposal is a win-win for students and for taxpayers. Let's get this done to bolster our rural communities and support our students. http:// thewheelerreport.com/wheeler_docs/files/021020wrsa.pdf ", "2020-02-12T15:22:54.000Z": "Yesterday we kicked off our #Census2020 Complete Count Committee, chaired by @LGMandelaBarnes . Having an accurate count in the 2020 Census is critical to ensuring every Wisconsinite has the same visibility and voice. Learn more here: https:// wicount.wi.gov/Pages/home.aspx", "2020-02-10T18:47:16.000Z": "We need to ensure that higher education and further career training doesn't come at the cost of decades of crippling debt. Student debt is holding back students, families, and ultimately, our state. With student loan debt in Wisconsin surpassing $24 billion, Evers creates task force to seek... Student loan debt disproportionately affects women and first-generation college students. Wisconsin Gov. Tony Evers has appointed a panel to study the problem. jsonline.com", "2020-02-09T18:29:01.000Z": "I was proud to sign this bipartisan bill into law with the ones it most directly impacts-- the students. These programs provide the tools students need to navigate these difficult mental health conversations, and could quite frankly save lives. Quote Tweet Journal Sentinel @journalsentinel A new state law will fund suicide prevention programs in Wisconsin schools. Here's how they work. https:// jsonline.com/story/news/sol utions/2020/02/05/grants-boost-peer-based-suicide-prevention-wisconsin-schools/4658928002/ ", "2020-02-10T15:29:29.000Z": "From our Blue Ribbon Commission on Rural Prosperity to my proposal to invest $10 million in sparsity aid for rural schools, I am committed to working to bolster our rural communities and economy. Report: Growing number of state's rural counties are losing residents The new report from Forward Analytics points to a shift in Wisconsin from slow population growth in the state's rural counties into a growing loss of residents. madison.com", "2020-02-05T18:17:41.000Z": "\"The need for us to address the crisis that we're facing in rural Wisconsin couldn't be more apparent. It's for the survival of this state. It's to keep our economy strong. It's to keep the culture of the State of Wisconsin strong.\" \n\nI couldn't agree more, @LGMandelaBarnes . Quote Tweet WPR @WPR Dairy Business Association President Tom Crave said his group appreciates the focus on farmers: \"The governor and lawmakers of both parties clearly understand the significance of a vibrant farm economy to our state.\" https:// buff.ly/2vhu7fM", "2020-02-06T17:29:58.000Z": "Every kid deserves access to high-quality, public education regardless of their identity, economic status, or zip code. Today I called for a special session of the Legislature to take up a proposal that invests $250 million in our kids and schools across our state.", "2020-02-06T17:30:02.000Z": "I've always said that what's best for our kids is what's best for our state and, by golly, I mean it. This is a no-brainer, folks. We know the bipartisan support is there, we just need elected officials to put people before politics.", "2020-02-06T19:07:32.000Z": "I am disappointed to hear that both @SpeakerVos and @SenFitzgerald oppose my plan to provide $130M to help reduce property taxes while also investing $120M in our schools. Our schools and our taxpayers--especially in rural communities--need this support and they need it now.", "2020-02-05T02:10:11.000Z": "Excited to see my friend @gretchenwhitmer deliver tonight's response! \n\nMidwest Governors know how to get things done. #SOTUResponse", "2020-02-04T22:50:23.000Z": "The Census will be here before we know it! Next month, we'll all be invited to participate either online, by phone, or by mail. It's important that we get an accurate count of communities across our state, so be sure to take time to complete the Census before April 1!", "2020-02-03T17:33:12.000Z": "Today I joined the Legislative Black Caucus for their Black History Month kick-off press conference. #BlackHistoryMonth is an opportunity to reflect on the many contributions of black Wisconsinites and Americans to our state and society.", "2020-02-01T18:15:38.000Z": "I made entrepreneurship and innovation a priority at @InWisconsin , so this is great news. But it is also just further evidence of what every Wisconsinite already knows--Wisconsin is a great place to live, work, raise a family, and even start a business! https:// wqow.com/2020/01/15/wis consin-ranks-among-best-states-for-start-up-businesses ", "2020-01-31T15:42:19.000Z": "As I told Laura and Jarred, we're in this together. The future of our state depends on the future of our dairy industry. #FarmFriday  https:// wkow.com/2020/01/29/sta te-helping-farmers-cope-with-stress-of-tough-industry/ ", "2020-01-27T17:54:56.000Z": "Voters should choose their elected officials, not the other way around. That's why this morning I signed Executive Order #66 establishing The People's Maps Commission. 1/2", "2020-01-26T00:24:12.000Z": "Ensuring that our elections are fair, our farmers are supported, and we are addressing student debt are great places to start to move forward together. Tony Evers releases sweeping plan to help Wisconsin's struggling dairy farmers, draw new legislat... Democratic Gov. Tony Evers is creating a new panel to draw new legislative maps and announced a sweeping plan to help dairy farmers. jsonline.com", "2020-01-24T15:07:12.000Z": "This isn't about politics. It's about investing in and supporting our rural families and communities. Wisconsin isn't America's Dairyland without the hardwork and dedication of the generations of farmers who built it. This is about people. Gov. Evers focuses on help for Wisconsin farmers in State of State address Wisconsin Gov. Tony Evers urged lawmakers during his State of the State speech Wednesday to work together to address the state's farm crisis, calling a special session of the Legislature as part of a... wisn.com", "2020-01-23T21:24:39.000Z": "Last night at my State of the State Address I announced my three-pronged plan to support and invest in our rural communities and farmers. Today, I put that plan into motion by signing two executive orders. Let's get to work.", "2020-01-23T01:38:56.000Z": "The challenges we face will test both the depth of our empathy and the strength of our selflessness, but I have never been more hopeful about the future we're going to create. I know we are up to the task. Because as Wisconsinites, it is in the fabric of our DNA. \nOn Wisconsin!", "2020-01-23T01:35:21.000Z": "When elected officials are able to ignore the will of the people, folks, something's wrong. That's why I'm creating The People's Maps Commission. #WISOTS", "2020-01-23T01:27:21.000Z": "Wisconsin is known as America's Dairyland, and it's for good reason. We produce more cheese than any other state and account for 14% of the nation's milk. But, unfortunately, as too many Wisconsin families know firsthand, we also lead the nation in farm bankruptcies.", "2020-01-23T01:20:35.000Z": "But folks, there is still much work to do. We can't find comfort in complacency. We must be resolved to confront the challenges we face today and we must be eager to embrace what may come tomorrow. #WISOTS", "2020-01-23T01:17:34.000Z": "We will be establishing a task force on student debt, because education-related debt is holding back our kids, our families, and our state. It's about connecting the dots to help folks leave their debt in the past and help us move forward together. #WISOTS", "2020-01-23T01:15:12.000Z": "The elected officials weren't the only ones who were busy this year: my cabinet secretaries were hard at work making sure that Wisconsin works for everyone. #WI4Us  #WISOTS", "2020-01-23T01:09:24.000Z": "While a lot of great work happened inside the Capitol building, one of the best parts of my job is visiting with folks all over the state. From farms to schools to businesses, we visited each one of Wisconsin's 72 counties. And holy mackerel, we had fun doing it!", "2020-01-23T00:50:18.000Z": "LIVE NOW: Governor Tony Evers Delivers Wisconsin's 2019 State of the State Address #WISOTS  https:// evers.wi.gov/Pages/Home.aspx", "2020-01-20T15:43:17.000Z": "Today, let us celebrate the life and legacy of Dr. Martin Luther King, Jr. and renew our commitment to working together to build a state that is more equitable, fair, and inclusive for all Wisconsinites. #MLKDay", "2020-01-17T20:12:04.000Z": "I stopped by Heartwood Farms today to chat with Jarred and Laura about their family farm and the future of the dairy industry in our state. Family farms have supported our state for generations. We're all in this together.", "2020-01-17T14:29:41.000Z": "The people of Wisconsin elected us to get to work on the issues important to them and their communities. 2019 was a good year for our state and we are putting our best foot forward in 2020. Q&A: Gov. Evers' First Year In Office. What Are His 2020 Priorities? Gov. Evers is laying out his agenda for the coming year. spectrumnews1.com", "2020-01-14T22:20:56.000Z": "Thank you for having me! I always enjoying discussing how we can work together on these important issues. Quote Tweet Rep. David F. Bowen @DavidFBowen Yesterday the Legislative Black Caucus met with @GovEvers to talk about #EquityandInclusion in Wisconsin, Juvenile Justice reform, and many other legislative priorities. I'm grateful that Gov. Evers has taken the time to regularly meet with the Caucus to help further our agenda!!", "2020-01-07T14:48:58.000Z": "For me as Governor, the Convention will be a window to Wisconsin for the entire world. I truly believe the good, hard-working folks of this state will elect our new President.", "2020-01-02T17:41:09.000Z": "2019 was a successful year for our state. Our budget was a down-payment on the priorities important to Wisconsinites- improving our roads, supporting kids and schools, and expanding access to health care. We're ready to hit the ground running in 2020. Newsmakers: Gov. Tony Evers 2019 Year End Interview - WisconsinEye On December 23, 2019, WisconsinEye Senior Producer Steve Walters sat down with Governor Tony Evers (D) to review 2019. wiseye.org", "2019-12-27T22:17:58.000Z": "2020 is right around the corner and with it comes another year of opportunity to tackle the issues facing our state. From fair maps to clean water, it's time to put politics aside and get to work for the people of this state. Evers: Fair maps, clean water and mental health are 2020 goals After being in office for nearly a full year, Gov. Tony Evers is taking the legislative break to take a breath and look forward to a fresh start in 2020. nbc15.com", "2019-12-24T20:28:23.000Z": "Merry Christmas and happy holidays from our family to yours! We hope you have a wonderful time and safe travels as you visit your family and loved ones this holiday season.", "2019-12-21T01:22:13.000Z": "Another bad news day for America's democracy.", "2019-12-13T23:26:59.000Z": "Voting is a fundamental right, and we should be making it easier for folks to vote, not harder. It's time for Republicans to move on from the election we had more than a year ago and start working on the pressing issues facing our state.", "2019-12-13T23:25:48.000Z": "I won the race for governor by less than 30,000 votes. This move pushed by Republicans to remove 200,000 Wisconsinites from the voter rolls is just another attempt at overriding the will of the people and stifling the democratic process. Quote Tweet Journal Sentinel @journalsentinel BREAKING: An Ozaukee County judge ordered the state to remove more than 200,000 Wisconsin voters from list. https:// jsonline.com/story/news/pol itics/2019/12/13/judge-orders-wisconsin-purge-more-than-200-000-voters-list/4412776002/ ", "2019-12-10T22:54:00.000Z": "Thank you to everyone who stopped by the Executive Residence for the annual tree lighting ceremony. It was great to see so many folks come out to kick off the holiday season with us!", "2019-12-10T00:46:22.000Z": "If you're celebrating yesterday's Packers win like I am, be sure to join us in Madison on Sunday, December 15th, for a Packers-Bears Game Watch Party!\n\nFor event details and to RSVP, click here: Join Us for a Packers Watch Party! RSVP Today secure.actblue.com", "2019-12-08T01:32:46.000Z": "Great start to the game! #Badgers  #OnWisconsin Quote Tweet Wisconsin Football @BadgerFootball G A M E  O N  TOUCHDOWN, WISCONSIN Jonathan Taylor up the middle for the score from 44 yards out!\n\nBadgers on the board first! #OnWisconsin GIF", "2019-12-01T16:26:35.000Z": "Get healthcare coverage through the Affordable Care Act and make sure you are protected from unexpected medical costs and worst-case scenarios. Head to http:// healthcare.gov by December 15th to get covered!", "2019-11-30T00:31:23.000Z": ". @LGMandelaBarnes and I put something special together for our neighbors to the west for Axe Week! We're coming to take back what's rightfully ours. @GovTimWalz and @LtGovFlanagan , you've been warned... #OnWisconsin", "2019-11-28T14:48:57.000Z": "Kathy and I want to wish everyone a Happy Thanksgiving! This year I am thankful for the opportunities I have had as governor to meet folks in every corner of our state. You all have welcomed me to your homes, farms, businesses, and schools and I couldn't be more grateful.", "2019-11-14T22:53:35.000Z": "Great questions, kids! I can't wait to see your ornaments! #WICapitolTree  #WICelebrateScience Quote Tweet Shana Callahan @shanarcallahan Get ready Madison! The first step in our Science ornament project  is complete! #celebratescience  #holidaytree  @TosaRoosevelt  #tosaproud  @Tony4WI  @MollyBeck", "2019-11-07T20:53:11.000Z": "If Republicans were serious about behavioral and mental healthcare, they would have expanded Medicaid, which 70% of Wisconsinites support and would have allowed us to invest more than $100 million into mental health initiatives.", "2019-11-07T18:00:15.000Z": "There are 132 members of the legislature, and @SpeakerVos and @SenFitzgerald are only two of them. That's why today I sent them a letter asking them to at least give these two proposals that could save lives a debate and a vote on the floor of the legislature.", "2019-11-07T18:00:14.000Z": "Last month, I called for a special session of the legislature to take up bills on extreme risk protection orders and universal background checks-two pieces of legislation supported by 80 percent of Wisconsinites, including a majority of gun owners across our state.", "2019-11-07T02:14:34.000Z": "We aren't going to get farmers the resources they need or challenge the stigma around mental health and suicide if Republicans refuse to confront the problem. Farmers need action-now. https:// wkow.com/news/top-stori es/2019/11/05/this-was-a-vote-against-wisconsin-farmers-gov-evers-reacts-to-ag-secretary-fired-from-his-job/ ", "2019-11-02T19:39:24.000Z": "We have one year to win in 2020-and I am absolutely amazed at the hard work being done in living rooms and coffee shops across Wisconsin this weekend. #1Year2Win", "2019-11-02T15:42:55.000Z": "It was exciting to see so many dedicated volunteers this morning in Sun Prairie. Thanks for mobilizing to win in 2020! #1Year2Win There's still time to get involved this weekend. Sign up for a volunteer shift near you at http:// wisdems.org/2020", "2019-11-01T16:16:07.000Z": "Open enrollment starts today and we are kicking it off in Milwaukee at the Outreach Community Health Center. \n\nDon't wait to #GetCovered ! Call or text 2-1-1 or visit http:// GetCovered.WI.gov and find a plan that works for you and your family.", "2019-10-28T20:08:42.000Z": "The people of this state expect more of their elected officials. When 80% of the state supports legislation that can save lives, I think legislators should come to work and make that happen. Jessie Opoien: When proposals with 80% support can't get a hearing in the Wisconsin Legislature,... Republican legislative leaders say there aren't the votes to pass Gov. Tony Evers' gun control proposals. They're probably right, but voters deserve to hear why. madison.com", "2019-10-22T21:17:46.000Z": "Republican leaders need to listen to the people of this state who overwhelmingly support these proposals. It's time for them to do their jobs, give these bills a vote, and let the vote speak for itself. Gov. Tony Evers calls for special session on gun control legislation Evers made the announcement in a Monday statement, prior to a press event in Milwaukee. madison.com", "2019-10-21T17:50:23.000Z": "Today I called the Legislature to meet to take up 2 critically important bills that will save lives and reduce gun violence in Wisconsin by requiring universal background checks and creating an ERPO process. These bills are supported by an overwhelmingly majority of Wisconsinites", "2019-10-17T20:57:25.000Z": "Today, I signed Executive Order #52 creating the Task Force on Climate Change. Through this task force, we're putting forth a collaborative effort with individuals from all around Wisconsin, who will make recommendations on how our state combats the effects of climate change.", "2019-10-16T20:59:30.000Z": "Folks, it's time to get serious about investing in our kids, our schools and our educators. I believe that what's best for our kids is what's best for our state. Gov. Tony Evers: What's best for our kids is what's best for our state It's time to get serious about investing in our kids, our schools and our educators. madison.com", "2019-10-15T18:19:07.000Z": "That feeling when your friends go get curds without you... Quote Tweet Lt. Governor Mandela Barnes @LGMandelaBarnes It's a great day for a cheese curd! Or in @FrostmanDWD 's case, a whole bag of them. Happy #NationalCheeseCurdDay , Wisconsin!", "2019-10-08T21:34:50.000Z": "Today, I declared October 14th as Indigenous Peoples' Day. Wisconsin is home to 11 recognized nations and tribal communities, and this day will serve as a reminder to all of us to celebrate the historic, cultural, and contemporary significance of Wisconsin's Native Nations.", "2019-10-08T15:52:36.000Z": "Today, the U.S. Supreme Court is considering three cases that could decide whether federal non-discrimination laws apply to LGBTQ people. \n\nIt is vital that #SCOTUS upholds LGBTQ employment protections. @HRC is proud to join partners today and #RiseUpOct8 .", "2019-10-07T23:00:47.000Z": "Folks deserve a second chance in Wisconsin. I was happy to issue pardons today, the first pardons issued since 2010, to 4 well-deserving individuals. These pardons serve as fresh start to move forward, not only for these folks, but for our state.", "2019-10-01T21:37:18.000Z": "President Trump and Sec. Perdue may be ready to give up on family farmers, but I'm certainly not. Our state was built on the backs of our farmers and their families for generations, and we are going to fight like hell to protect and support them. Trump ag secretary Sonny Perdue says dairy farms will survive, but may have to get bigger Sonny Perdue spoke after holding a town hall meeting with farmers and dairy industry officials at the annual World Dairy Expo in Madison. jsonline.com", "2019-09-26T17:29:24.000Z": "It was an honor to join @WHEDAadvantage Exec. Director Altoro, @PSCWisconsin Chairperson Valcq, and @RepZamarripa for the #HispanicHeritageMonth celebration at the Capitol today. The Hispanic community makes our state stronger, bringing diverse voices and experiences to the table", "2019-09-26T02:02:11.000Z": "#ThisIsMyCrew Quote Tweet Milwaukee Brewers @Brewers We're in! Now it's time to #MKEHistory .", "2019-09-24T20:08:11.000Z": "Extreme Risk Protection Orders allow family members to take action when they believe a loved one is a threat to themself or others. It is a common sense policy that is supported by the majority of Wisconsinites and it could save countless lives.", "2019-09-21T21:16:29.000Z": "Great day to be a Badger. On, Wisconsin!", "2019-09-19T15:10:19.000Z": "The most recent @MULawPoll showed that 81% of Wisconsinites support ERPO legislation. It's time to listen to the will of the people who overwhelmingly want elected officials to start taking gun violence seriously for our kids, our communities, and our state.", "2019-09-19T15:10:18.000Z": "Today, I joined @Rep_Melissa , @SenTaylor , and @WisDOJ in announcing the introduction of legislation to create an extreme risk protection order (ERPO) process that would allow a judge to remove guns from people who have been found by a judge to be a danger to themselves or others", "2019-09-16T17:56:31.000Z": "I have always believed that what's best for our kids is what's best for our state. Prioritizing our kids and their success in our public schools through robust and equitable funding should be on the forefront of everyone's minds. Op Ed: Legislature Should Put Students First Long-term school funding, teacher experience, student test scores are all down. urbanmilwaukee.com", "2019-09-16T20:12:11.000Z": "Our annual Barn Party is less than a week away! I hope you'll join us in Fitchburg this Sunday, September 22nd. \n\nThere's nothing more Wisconsin than a beautiful afternoon on the farm. Plus, we'll have some great food and live music. \n\nRSVP: RSVP to Attend Tony's Barn Party! Can We Count You In? secure.actblue.com", "2019-09-11T18:04:40.000Z": "On this Day of Remembrance, my thoughts are with the survivors, family and loved ones, service members, and first responder heroes who courageously acted in our time of need. I join the nation as we mourn the lives lost on this day 18 years ago and reflect on our resilience.", "2019-09-02T22:12:19.000Z": "Enjoyed a beautiful afternoon at LaborFest in Madison! I'm proud to stand with the hardworking men and women of Wisconsin.", "2019-09-02T12:13:00.000Z": "Today we reflect on the contributions workers have made to our state and our country. But we also renew our commitment to fighting for equal pay, livable wages, and safe and inclusive workplaces knowing that we have much more work to do to ensure our economy works for everyone.", "2019-08-26T18:38:37.000Z": "A visit to Green Bay is never complete without a stop at @hinterlandbeer , lunch at Kroll's, and a visit with the @packers , even though I barely recognized @AaronRodgers12 without the Canadian tuxedo.", "2019-08-25T00:34:18.000Z": "It was great to see so many Fox Valley Democrats this afternoon! Thank you to the @WinnebagoDemsWI for having me at your annual corn roast.", "2019-08-22T19:01:28.000Z": "Enjoyed some great ice cream and some great company at @CedarCrestCones in Manitowoc today!", "2019-08-21T20:47:31.000Z": "Healthcare should be more affordable, and more accessible. That's why we're going to keep fighting for Medicaid expansion here in Wisconsin. Gov. Evers, Senators Shilling and Baldwin speak on Medicaid at Scenic Bluffs Community Health Center Two months after the state budget committee rejected Gov. Tony Ever's plan to expand Medicaid, the governor, along with U.S. Sen. Tammy Baldwin and state Sen. Jennifer Shilling, stressed their lacrossetribune.com", "2019-08-15T14:21:51.000Z": "Our nation has been devastated by two mass shootings in Dayton and El Paso that occurred in about a 24-hour period, and just yesterday, six police officers were shot in Philadelphia.", "2019-08-06T14:33:50.000Z": "This should be an easy decision. I'm calling on Republican leadership to #JustSayYes to Medicaid expansion. Quote Tweet Wisconsin Assembly Democrats @AssemblyDemsWI Medicaid Expansion: Lowers private health insurance premiums by 7 to 11% Saves over $320 million in state taxpayer dollars Stops the outflow of Wisconsin dollars to fund Medicaid programs in other states GIF", "2019-07-29T15:40:17.000Z": "Water is one of our most important natural resources here in Wisconsin, and we need to make sure that it's safe for all Wisconsinites, present, and future! Learn how water can impact your health in a variety of ways: https:// dhs.wisconsin.gov/water/index.htm", "2019-07-23T17:27:16.000Z": "Today and every day, thank you to the folks at the @WI_Guard for your service to our communities, our state, and our country. Wisconsin National Guard assists in storm clean-up tmj4.com", "2019-07-18T22:28:05.000Z": "Happy birthday to one of the best places for custard, cheese curds, and butterburgers - @culvers ! Thanks for all you've done for our incredible state over the past 35 years. Quote Tweet Culver's Restaurants @culvers", "2019-07-18T15:58:55.000Z": "Great to have Sergeant Price and K-9 Yachi stop by my office. Thanks for all you do to make sure everyone stays safe when visiting the Capitol!", "2019-07-13T16:28:29.000Z": "ICE raids will be taking place starting tomorrow. From @ACLU : know your rights. Quote Tweet Rep. Gwen Moore @RepGwenMoore ICE raids are set to begin on Sunday.  Remember, you have rights.  ICE comenzará redadas de inmigraciόn este domingo.  Recuerde, que tiene derechos.", "2019-07-12T15:52:42.000Z": "Thank you to @LULAC for having me at your 90th annual convention! I am going to continue fighting to do everything I can to make our state a more equal, equitable, and inclusive place to live.", "2019-07-10T16:05:33.000Z": "Our first act as new owners of the U.P. will be putting in a @KwikTrip . #TravelWI  #DEWnited  @PureMichigan", "2019-07-09T15:27:04.000Z": "I promised the people of Wisconsin that I would remove our state from the #ACA lawsuit. I'm proud that was a promise kept.\n\nWe cannot go back to a time when folks with pre-existing conditions were charged more or unable to get insurance altogether. Obamacare Is Going Back On Trial, With Insurance For 20 Million At Stake The Republican lawsuit hasn't gotten a lot of attention lately, but it should. huffpost.com", "2019-07-08T21:58:38.000Z": "By signing SB 152 today, cities across our state will be able to \"scoot\" into the future - we're giving local governments the power to make the best decisions for their communities and increase access to affordable transportation while attracting new businesses to our state.", "2019-07-04T17:40:41.000Z": "On Independence Day, we remember those who've defended our freedom and our values and fought against injustice, inequity, and oppression throughout our country's history. Every day we must reaffirm our commitment to working toward a more perfect union. #FourthofJuly2019", "2019-07-03T16:31:59.000Z": "I have always said that what's best for our kids is best for our state. I'm adding nearly $100 million more in per-pupil aid for our schools compared to the budget passed by the legislature.", "2019-07-03T16:29:18.000Z": "I am pleased that Republicans followed my lead in working toward paying for our infrastructure, something they were unwilling to do over the last eight years.", "2019-07-03T16:28:56.000Z": "I also promised the people of Wisconsin that I would provide the leadership it took to fix our roads and bring people together to find a long-term solution on which everyone could agree. Our transportation budget delivers that.", "2019-07-03T16:27:55.000Z": "The bills I will sign today deliver on my campaign promise to deliver a 10% tax cut for working families, including $500 million in overall tax cuts targeted to working, middle-class Wisconsinites across our state.", "2019-07-03T16:27:25.000Z": "The budget I am signing today is just a down payment on The People's Budget and the priorities of the people of Wisconsin. There is much more work for us to do.", "2019-07-03T16:25:54.000Z": "I'm reminded of another inscription in the governor's conference room today. I made promises to the people of Wisconsin - to put politics aside, to find common ground, and to get things done. That's what we're doing here today.", "2019-07-03T16:24:32.000Z": "The People's Budget Fully funded schools Expanded Medicaid to 82,000 Wisconsinites Brought $1.6B back to Wisconsin Offered long-term, sustainable solutions to fix the darn roads", "2019-07-03T16:22:14.000Z": "It was in the spirit of the words in the governor's conference room that we crafted a budget - The People's Budget - that represents the will of the people of Wisconsin.", "2019-07-03T16:13:59.000Z": "LIVE NOW: Gov. Evers takes action on the 2019-21 biennial budget https:// facebook.com/GovernorTonyEv ers/videos/2359007570805231/ ", "2019-07-01T00:33:24.000Z": "Tonight we will close the books on our first official fundraising report since I became governor in January. \n\nCan you chip in before midnight to ensure we're in a strong position to keep fighting for what's important to Wisconsinites? I just gave to Tony Evers! Public Filing Deadline: Tonight At Midnight secure.actblue.com", "2019-06-28T22:08:09.000Z": "#FridayFeeling", "2019-06-24T20:22:51.000Z": "Thanks to Senator Wirch for setting the record straight on Medicaid expansion. Expanding Medicaid is the right thing to do and it's what the people of this state want. Let's get it done. Commentary by Senator Bob Wirch: Setting the record straight on Medicaid It has been more than five years since states were given the opportunity to expand Medicaid health care coverage to more low-income families, with the federal government covering the bulk journaltimes.com", "2019-06-21T20:02:55.000Z": "I just vetoed AB 179, AB 180, AB 182, and AB 183. Everyone should have access to quality, affordable healthcare, and that includes reproductive healthcare. Politicians shouldn't be in the business of interfering with decisions made between patients and their healthcare providers.", "2019-06-20T16:06:26.000Z": "If a kid needs an extra lift, they should get an extra lift. We need to make sure our schools have the resources they need to do what's best for our kids. That's why The People's Budget includes an unprecedented $600 million investment in special education.", "2019-06-20T16:05:19.000Z": "And after years of neglect, The People's Budget proposed a sustainable solution to our transportation funding crisis so we can fix the dang roads already. And our solution ensures that out-of-state drivers pay their fair share.", "2019-06-20T16:04:04.000Z": "Our budget saves money while drawing down more than $1B in new federal funds to help make healthcare affordable and accessible. We're already paying $1B a year for other states like New Jersey to expand their Medicaid program. That's your money, folks. Period.", "2019-06-20T16:03:44.000Z": "The people of Wisconsin spoke loud and clear last November. They wanted us to work together to fully fund public education at every level, ensure quality healthcare is affordable and accessible, and fix our crumbling roads and bridges. And that's what The People's Budget does.", "2019-06-20T16:01:57.000Z": "LIVE NOW: Governor Evers Holds a Press Conference on The People's Budget Governor Tony Evers on Facebook Watch Governor Evers Holds a Press Conference on The People's Budget facebook.com", "2019-06-19T22:51:22.000Z": "Joined my friend and Wisconsin's first Black lieutenant governor, @LGMandelaBarnes , at Milwaukee's Juneteenth celebration this afternoon! Thanks to all who came out to celebrate and to advocate for equity and equality in Wisconsin.", "2019-06-19T14:21:24.000Z": "Via @CapTimes : \"There is no evidence that the people of Wisconsin share Vos' fantasy. For the most part, we share the sentiments of Tony Evers, the man we recently elected governor, and of Franklin Roosevelt, the man we repeatedly backed for president.\" Editorial: Robin Vos insults the intelligence of Wisconsinites Assembly Speaker Robin Vos opposes expanding Medicaid even though a Marquette University Law School poll found that 70 percent of Wisconsinites favor expansion. madison.com", "2019-06-19T17:02:55.000Z": "Juneteenth Day is a time to recognize the struggles of African Americans in our country's modern history. While we use this time to reconcile with our past, we must also continue to make progress by moving forward in solidarity and strength.", "2019-06-19T01:38:22.000Z": "Justice Shirley Abrahamson will be remembered for many things - her wit, her passion for our judicial and legal institutions, and for instilling that same passion in so many who came after her. On behalf of the people of Wisconsin, thank you, Justice Abrahamson.", "2019-06-15T00:32:53.000Z": "Ready to fix the damn roads and clean up the damn water in Michigan and Wisconsin!", "2019-06-10T22:06:33.000Z": "100 years ago today, Wisconsin became the first state to ratify the 19th Amendment. Thank you, Kathy, for leading our state's efforts to mark this special anniversary! Quote Tweet Governor Tony Evers @GovEvers Honored to be able to join Kathy today to celebrate the 100th anniversary of Wisconsin's ratification of the 19th Amendment!", "2019-06-10T17:10:09.000Z": "LIVE NOW: watch Governor Tony Evers, First Lady Kathy Evers, and women from across government celebrate the 100th anniversary of the ratification of the 19th Amendment. Quote Tweet NBC15 News @nbc15_madison WATCH LIVE NOW: Ceremony at the Capitol. Wisconsin celebrates 100th anniversary of the state's ratification of the 19th Amendment which gave women the right to vote https:// nbc15.com/livestream2  #NBC15", "2019-06-07T19:28:19.000Z": "It's a great day to be a Wisconsinite.", "2019-06-05T14:04:24.000Z": "We've seen this before, folks. You know what to do  Call your legislators. Write letters to the editor. Find 5 friends to do the same. \n\nShow the GOP we mean business. We're not letting our foot off the gas pedal in the #Fight4Medicaid .", "2019-06-05T14:04:23.000Z": "ICYMI: Under the cover of darkness last night, Republicans on the Joint Finance Committee chose to play politics with Wisconsinites' healthcare yet again.", "2019-06-04T19:21:42.000Z": "Mary Ellen from Lodi supports Medicaid expansion in Wisconsin because \"more people will have health coverage.\" \n\nShe's right. An estimated 82,000 Wisconsinites would be able to access more affordable healthcare coverage if we expand Medicaid in our state.", "2019-06-04T15:24:20.000Z": "Today, the State Legislature's Joint Finance Committee is voting on whether to keep Medicaid expansion in our state's budget. Call your legislator today at 1-800-362-9472. Retweet and encourage your friends and family members to call. Quote Tweet Governor Tony Evers @GovEvers I've been traveling all over Wisconsin and talking to folks about how Medicaid expansion will make our state healthier and stronger. What does Medicaid expansion mean to you?", "2019-06-04T02:02:52.000Z": "Every Wisconsinite deserves access to affordable, high-quality healthcare. By expanding Medicaid, we'll bring our state closer to that reality.", "2019-06-03T22:31:36.000Z": "There are lots of reasons to support Medicaid expansion for our state.\n\nWhat's yours? \n\nContact your legislator at 1-800-362-9472 to make your voice heard on this important issue.", "2019-06-03T22:30:54.000Z": "Tomorrow, the State Legislature's Joint Finance Committee is planning to vote on whether to keep Medicaid expansion in our state's budget. \n\nAnn from Appleton wants to expand Medicaid because \"82,000 more people in Wisconsin will have healthcare!\"", "2019-06-02T02:26:49.000Z": "I think if we remember these two takeaways from 2018, November 2020 is going to be a year full of successes for Democrats in Wisconsin. #WisDems19", "2019-06-02T02:25:00.000Z": "We shouldn't be afraid to have a spirited primary-so long as, when all is said and done, we remember we're all on the same team. #WisDems19", "2019-06-02T02:23:57.000Z": "We focused on the issues. We made a decision not to be distracted by the things that divided us.", "2019-06-02T02:22:23.000Z": "Once last year's primary was over, we put the primary behind us, and everyone worked together to make sure we had Democratic victories up and down the ticket. #WisDems19", "2019-06-02T02:21:08.000Z": "And here I am tonight standing before you as governor of the great state of Wisconsin with one of the most powerful veto pens in the country. So to them I say: Who's boring now? #WisDems19", "2019-06-02T02:20:12.000Z": "There's nothing boring about fighting for our kids so that every kid, regardless of their zip code, has access to a high-quality, public education from kindergarten through 20.", "2019-06-02T02:19:44.000Z": "There's nothing boring about filling those Scott-holes and fixing the damn roads.", "2019-06-02T02:19:24.000Z": "There's nothing boring about protecting the Affordable Care Act and the 2.4 million Wisconsinites who have pre-existing conditions.", "2019-06-02T02:18:50.000Z": ". @MandelaForWI and I make a great team. But a lot of people said during the campaign that we were too Wisconsin Nice. A lot of folks even called us, especially me, boring. And you know what we said? To hell with that. #WisDems19", "2019-06-02T02:16:29.000Z": "Watch Tony's speech at #WisDems19 State Convention live here  https:// wiseye.org/live/?event=22 626 ", "2019-06-02T01:31:24.000Z": "Enjoying a cone before taking the stage at #WisDems19 State Convention! Looking forward to seeing everyone in our hospitality suite later.", "2019-06-01T14:46:16.000Z": "Today I'll be at #WisDems19 State Convention! Stop by our table and tell us what Medicaid expansion means to you. Quote Tweet Governor Tony Evers @GovEvers I've been traveling all over Wisconsin and talking to folks about how Medicaid expansion will make our state healthier and stronger. What does Medicaid expansion mean to you?", "2019-05-30T17:23:08.000Z": "Today I asked kindergartners in Platteville what they learned this school year, and they said they learned about empathy. I hope one of them grows up to be governor someday, because that's one of the most important qualities a governor - or any elected official - can have.", "2019-05-29T16:01:48.000Z": "ICYMI: Join us this Friday in Stevens Point for a Healthcare Town Hall. Details and RSVP link below Quote Tweet Governor Tony Evers @GovEvers Why is Medicaid expansion important to you? Share your stories with me, @RepRonKind , and other elected officials this Friday at UW-Stevens Point. RSVP here: http:// bit.ly/EversHCTownHall  #Fight4Medicaid", "2019-05-29T14:04:52.000Z": "Happy 171st birthday, Wisconsin! I couldn't be prouder to live in this state and to be your governor. I think I'm going to celebrate with some @OrganicValley Muenster.", "2019-05-23T15:29:10.000Z": "What's best for our kids is what's best for our state. That's why The People's Budget invests $1.4B in our kids and our schools, and makes an historic $600M-investment in special education. Unfortunately, the plan announced today by Republicans doesn't get us where we need to be.", "2019-05-23T17:36:40.000Z": "It was great to see so many friendly faces last night at the @LaborSCFL 's 60th Annual Bean Feed!", "2019-05-22T22:14:59.000Z": "According to the CDC, \"black babies in Wisconsin are nearly three times more likely to die than white babies.\" That's just unacceptable. Our Healthy Women, Healthy Babies initiatives will help to make sure all moms and babies get a good start. Milwaukee's Mortality Rate For Black Babies Is High. Why, And What's Being Done About It? So for a lot of families, there's this thing that happens when they find out they're expecting a baby. Once they get past the Is this really happening? wuwm.com", "2019-05-21T20:32:11.000Z": "We shouldn't be limiting the right for women to make their own healthcare decisions. That's why I'll veto the bills passed by the Assembly last week if they arrive on my desk. It's time to listen to women. #StopTheBans", "2019-05-20T17:55:57.000Z": "\"Imagine what [Medicaid expansion] could do to improve access to hospitals and doctors for families and individuals in La Crosse County.\"\nWell, Supervisor Burke, we could do a heck of a lot. Vicki Burke: Medicaid refusal costs area $85 million As a La Crosse County Board Supervisor, I was disappointed and frankly frustrated with the rejection of Medicaid Expansion funds by the Republicans in Madison. This initiative would bring $1.6 lacrossetribune.com", "2019-05-17T22:21:10.000Z": "I was glad to see the House passed the #EqualityAct today, bringing us one step closer to equality for LGBTQ folks across our country. Everyone deserves equality under the law. Period.", "2019-05-15T20:31:52.000Z": "Healthy Women, Healthy Babies is more than a catchy name, it's a plan to finally do right by women in our state. By expanding Medicaid, we can support new moms, invest in preventative care, and empower women to make their own healthcare decisions.", "2019-05-13T16:32:22.000Z": "\"This much is clear: The state under Republicans has turned down lots of federal money in a variety of ways, largely for political reasons - and that needs to stop.\" - @WiStateJournal Note to GOP: Taking federal Medicaid money makes financial sense OUR VIEW: More federal dollars will provide better care for poor, free up state money madison.com", "2019-05-09T16:07:32.000Z": "The Joint Finance Committee is beginning their meeting. Keep up the pressure. Let them know you support Medicaid expansion. Remind them that the will of the people is the law of the land. #WI4Us", "2019-05-08T00:02:00.000Z": "Ice cream? Muenster? Supporting a great Wisconsin business? I'd say it was a successful visit to Sassy Cow Creamery this afternoon!", "2019-05-06T19:20:52.000Z": "Happy #NationalNursesDay ! Thank you to all of Wisconsin's nurses who work day in and day out to keep our communities healthy.", "2019-05-03T14:59:09.000Z": "70% of Wisconsinites support Medicaid expansion and I'm going to fight like hell to make sure it happens. Tell Republicans in the Legislature to join me. 800-362-9472 https:// wkow.com/news/top-stori es/2019/05/02/gov-to-fight-like-hell-to-expand-medicaid-gop-leader-not-going-to-give-in/ ", "2019-05-01T19:43:34.000Z": "Immigrants make Wisconsin stronger, not weaker. On this #DayWithoutLatinxs , @LGMandelaBarnes and I are reaffirming our commitment to making driver's licenses available to undocumented Wisconsinites - it makes our state safer and it's just common sense.", "2019-05-01T01:51:37.000Z": "Congratulations to the newest member of the Wisconsin Assembly, @Tip4WI !", "2019-04-29T23:11:21.000Z": "By accepting federal Medicaid dollars, we'll open the door to an additional $1.5B and do a heck of a lot for our state: Improve healthcare for women and babies Help 82,000 people get insurance Expand dental care Support aging and older Wisconsinites", "2019-04-24T22:54:27.000Z": "Join us in Milwaukee tomorrow night to talk about The People's Budget and what it means for you and your family with me, @LGMandelaBarnes , and your representatives. RSVP here: http:// bit.ly/WI4UsMKE", "2019-04-23T14:55:47.000Z": "The People's Budget touches issues that impact families across all of our state's 72 counties. Come to Milwaukee on Thursday evening to discuss the issues in our budget that matter the most to you. Sign up: http:// bit.ly/WI4UsMKE", "2019-04-22T20:52:39.000Z": "Proud to support two fantastic Wisconsin industries today! By working together, Menasha Packaging and New Glarus brewing are doing right by our entire state - supporting good-paying jobs, and, of course, making it easier for folks to get their Spotted Cow.", "2019-04-22T18:27:00.000Z": "There's still time to sign up for tomorrow's listening session in Oshkosh! @LGMandelaBarnes and I have been all across Wisconsin listening to constituents about The People's Budget, and we can't wait to hear from you. RSVP here: http:// bit.ly/WI4UsOshkosh", "2019-04-22T14:16:02.000Z": "This #EarthDay , let's remember that the Earth does not belong to one political party or another. Climate change and the impact it is having on our communities is something we need to address together. The future of our state and our planet depends on it.", "2019-04-21T14:02:00.000Z": "From the Evers family to yours, happy Easter!", "2019-04-19T17:44:03.000Z": "That's a wrap! The First Lady and I spent part of our morning with the legendary @DiscoverWI . Proud to help promote our beautiful state on the nation's longest-running tourism show. GIF", "2019-04-19T15:34:35.000Z": "It was great to speak with the @CollegeDemsWI last night. Thank you for having @MandelaForWI and I at your meeting!", "2019-04-18T21:11:41.000Z": "Great column by @SenSchachtner . By accepting federal Medicaid dollars, we'll be able to add nurses and caretakers to the workforce and make high-quality long-term care accessible for more Wisconsinites. Sen. Patty Schachtner: Gov. Evers' budget provides a start on long-term care As our population ages, it's important to prepare for the increased demand for long-term care services. Currently, challenges faced by nursing home facilities and our caregivers ignite questions... madison.com", "2019-04-18T16:28:44.000Z": "Too many Wisconsinites who work 40 hours a week are being forced into poverty. That's why we're raising Wisconsin's minimum wage. #WI4Us Quote Tweet Wisconsin Department of Workforce Development @WIWorkforce More than 12 percent of #Wisconsinites live in poverty and tens of thousands earn wages that cannot support a family. @GovEvers ' changes to the #MinimumWage will give #Wisconsinites the opportunity to succeed. #WI4Us Show this thread", "2019-04-17T22:43:00.000Z": "Let's fix the darn roads. https:// wearegreenbay.com/news/local-new s/local-leaders-fed-up-with-state-lawmakers-removing-hwy-15-project-money-from-governor-s-budget/1928163486 ", "2019-04-17T18:30:12.000Z": "When we stop the bickering and actually listen and talk to each other, we create a better Wisconsin for everyone. Thanks to all who came out to our listening session in Eau Claire last night!", "2019-04-16T22:35:56.000Z": "Today is my and @LGMandelaBarnes ' 100th day in office! We couldn't be prouder of what we've accomplished in these first 100 days, and we look forward to serving you for the next 100 days and beyond.", "2019-04-16T14:56:33.000Z": "From Baraboo to Bayfield, every kid should have access to a high-quality public education at every level, regardless of their zip code, and if a kid needs an extra lift, they should get an extra lift. Baraboo School Board members seek special ed, mental health funding in meeting with legislators With an audience of two state legislators and a congressional aide, members of the Baraboo School Board advocated Monday for more special education and mental health funding for schools, as wiscnews.com", "2019-04-15T20:24:21.000Z": "When employees are falsely classified as \"independent contractors,\" it hurts our families, our communities, and our whole state. Executive Order 20 makes sure everyone who puts in an honest day's work gets the compensation and benefits they've earned.", "2019-04-15T15:28:59.000Z": "Our budget supports families and communities across our entire state. Tomorrow, I'm traveling to Eau Claire to hear from folks in the Chippewa Valley about what The People's Budget means for them and their families. Sign up here: Gov. Evers and Lt. Gov. Barnes \"The People's Budget\" Tour - Eau Claire (4/16) Join Gov. Evers and Lt. Gov. Barnes on April 16 at a community budget listening session. We will be hosting a round-table discussion for members of the community to share how the Governor's budget... docs.google.com", "2019-04-14T16:24:09.000Z": "The People's Budget tour gives an opportunity for folks to build upon ideas, connect the dots, and listen to each other. That's what democracy is about. That's what these listening sessions are about. Evers takes in input from community on various topics at listening session Gov. Tony Evers moved inconspicuously around the room - holding nothing but a pen and notepad - as local residents sounded off about questions and concerns with the state budget. kenoshanews.com", "2019-04-13T19:25:31.000Z": "Had a great time today at the annual Easter egg roll at the residence-kids are always the perfect antidote to politics as usual. Thanks to everyone who came out!", "2019-04-12T20:00:47.000Z": "Folks in Wisconsin work hard. They shouldn't have to choose between buying groceries and paying the rent. Frankly, that's the reason I'm so adamant about raising the minimum wage-we need to make sure folks who work full time can support their families.", "2019-04-11T17:22:05.000Z": "Wisconsinites shouldn't be in the dark when it comes to the rising cost of their prescription drugs. That's why I want drug manufacturers and health insurance companies to be transparent when it comes to price increases. Gov. Tony Evers wants prescription drug companies and other entities to disclose information on... How much of the information would be publicly disclosed, and what its effect would be on prices, is unknown. jsonline.com", "2019-04-10T16:58:08.000Z": "Every dot on this map represents an address where kids tested positive for lead poisoning. Why the heck wouldn't we do everything in our power to fix this?", "2019-04-09T19:43:17.000Z": "I don't make promises I can't keep. Today, I'm proud to say that we fulfilled our promise to remove Wisconsin from the GOP lawsuit to gut the Affordable Care Act. It's time for Republicans to stop blocking the will of the people and start working with us to expand healthcare.", "2019-04-08T20:41:28.000Z": "I'll be on the road again Wednesday to hear from folks in Kenosha about how The People's Budget can make a difference in their community. I hope you'll join us because @LGMandelaBarnes and I are ready to listen. Click here to register: Gov. Evers and Lt. Gov. Barnes \"The People's Budget\" Tour - Kenosha (4/10) Join Gov. Evers and Lt. Gov. Barnes Wed., April 10 from 5:30-7 p.m. at a community budget listening session. We will be hosting a roundtable discussion for members of the community to share how the... docs.google.com", "2019-04-05T17:46:01.000Z": "It's pretty simple - I want a fairer tax system that gives hard-working Wisconsinites a 10% tax cut. Republicans want to protect giveaways to millionaires. That's not right. Tax reform should lift middle-class families up, not help those at the top get richer. Quote Tweet PolitiFact Wisconsin @PolitiFactWisc Yes, 80% of the state's manufacturing/agriculture tax credit goes to people making $1M or more. @RepDanielRiemer gets a True rating from @micasoellner in our latest fact check.   \n\nRead it here: http:// bit.ly/2Uif9l7", "2019-04-04T15:23:24.000Z": ". @LGMandelaBarnes and I had a great time in Stevens Point last night at our first stop on The People's Budget tour! Our next stop is in Kenosha next Wed., April 10, from 5:30 to 7 p.m.-I hope you'll join us. Click here to register: Gov. Evers and Lt. Gov. Barnes \"The People's Budget\" Tour - Kenosha (4/10) Join Gov. Evers and Lt. Gov. Barnes Wed., April 10 from 5:30-7 p.m. at a community budget listening session. We will be hosting a roundtable discussion for members of the community to share how the... docs.google.com", "2019-04-03T21:33:23.000Z": "Healthcare was on the ballot this past November. We promised we'd work to: increase access to quality, affordable healthcare services protect the 2.4 million Wisconsinites who have pre-existing conditions lower the costs of prescription drug prices", "2019-04-03T21:11:54.000Z": "Healthcare shouldn't be a privilege afforded only to the healthy and wealthy. Period.", "2019-04-03T15:23:15.000Z": "And then we took what we heard from people and we crafted a budget that fully funds our public schools fixes our crumbling roads and bridges works to make sure health care is accessible and affordable", "2019-04-03T15:23:14.000Z": "In December, Mandela and I traveled across our state - stopping in Green Bay, Wausau, Milwaukee, La Crosse, and Superior - to hear directly from the people of Wisconsin about what they wanted to see in our budget.", "2019-04-02T22:32:07.000Z": "Access to healthcare isn't something that's promised only to the healthy and the wealthy.", "2019-04-02T22:32:06.000Z": "We just had an election on healthcare and it didn't go @realDonaldTrump 's way. A whole bunch of folks like me won because we ran on strengthening the Affordable Care Act and preserving protections for people with pre-existing conditions.", "2019-04-02T17:00:47.000Z": "We're only one day away from our first stop on The People's Budget listening tour. I want to hear from you about what's important so we can all work together to build a better Wisconsin. I'm ready to listen. I hope you'll join me. Click here to register: Governor Evers and Lt. Governor Barnes \"The People's Budget\" Tour - Stevens Point (4/3) Join Governor Evers and Lieutenant Governor Barnes on April 3rd at a community budget listening session. We will be hosting a round-table discussion for members of the community to share how the... docs.google.com", "2019-04-02T14:57:53.000Z": "There are lots of important elections today, Wisconsin! Be sure to make a plan to vote.\n\nFind your polling place here: http:// myvote.wi.gov", "2019-03-28T21:45:33.000Z": "It's a perfect day for a @Brewers win!", "2019-03-27T19:25:34.000Z": "The potholes in our state are no joke! Let's get this budget passed so we can finally fix our roads - and so we don't have to be on pothole patrol.", "2019-03-26T20:25:49.000Z": "For the second time in less than a week, an impartial judge ruled against legislative Republicans and their lame duck session.", "2019-03-25T18:35:22.000Z": "Too many transportation projects have gone underfunded for too long, and that's causing drivers and communities to suffer. We're not kicking the can down the road any longer - we're finally fixing Wisconsin's roads. Evers' Budget Will Begin Conversation About State's Roads, Transportation officials in Wisconsin say Gov. Tony Evers' budget proposal should start a discussion in the Legislature about raising needed revenue for road repairs. wpr.org", "2019-03-23T15:31:26.000Z": "Nine years ago today, President Obama signed the Affordable Care Act - the most sweeping overhaul of our healthcare system since Medicare and Medicaid were introduced in the 1960s.", "2019-03-22T17:08:43.000Z": "I'm here at @UWLaCrosse this morning because folks in the Coulee region deserve a capital budget that invests in them. It's time to support critical rebuilding projects that will bring top talent and thousands of jobs to Wisconsin.", "2019-03-21T19:25:03.000Z": "Statement from @GovEvers on today's court ruling Quote Tweet Governor Tony Evers @GovEvers Today's ruling is a victory for the people of Wisconsin and for preserving the Wisconsin Constitution. Show this thread", "2019-03-15T21:26:33.000Z": "Rapid snowmelt and rain have caused flooding that has impacted homes, businesses, and cities and towns across Wisconsin. Today I declared a State of Emergency to provide additional personnel and resources as needed to assist in emergency response and recovery operations.", "2019-03-14T23:14:00.000Z": "It's simple: every kid should have an equal chance to get ahead in our state. New state superintendent sees early childhood education as key to closing racial gap Carolyn Stanford Taylor grew up in the segregated South before rising to become Wisconsin's top educator. madison.com", "2019-03-13T20:22:55.000Z": "I have authorized @WisDOJ to join the coalition of states challenging @realDonaldTrump 's unconstitutional national emergency declaration. This manufactured crisis harms communities, taxpayers, & our country while ignoring the true crisis of separating kids from their families.", "2019-03-12T20:40:18.000Z": "The entrepreneurial and leadership skills of Wisconsin's Girl Scouts had an impact on me - today I brought in one of the many boxes of Girl Scout cookies I have at home! Thanks to the @girlscouts for empowering young women across our state and nation.", "2019-03-11T20:55:47.000Z": "Today is a great day for our state, and I look forward to welcoming folks from around the country to Milwaukee next July! #Milwaukee2020 Quote Tweet Milwaukee 2020 Host Committee @milwaukee2020 It's official: The Democratic National Convention is coming to Milwaukee! \n\nWe've always known that our city is energetic, diverse, and thriving-and can't wait for the rest of the world to see it shine! #Milwaukee2020", "2019-03-09T01:49:37.000Z": "It was great to see everyone tonight at the Bodega in La Crosse!", "2019-03-08T16:45:59.000Z": "As a cancer survivor, I know the toll a cancer diagnosis can take. @MedicalCollege 's commitment to cancer research has provided countless Wisconsin families with top-notch care. I'm proud to continue the state's partnership with MCW.", "2019-03-08T16:41:47.000Z": ". @MedicalCollege is home to some of the best and brightest minds in cancer research in the country. Our capital budget includes a $15 million investment in a new world-class Cancer Research Facility so they can do more life-saving work.", "2019-01-08T23:27:53.000Z": "This morning, I toured @gundersenhealth in La Crosse to talk about how we can work together to give Wisconsinites the best healthcare possible. Thank you for having me! Quote Tweet Gundersen Health @gundersenhealth Gundersen welcomed Wisconsin Gov. Tony Evers for his first official public visit following his inauguration Jan. 7. We look forward to continuing partnerships with Gov. Evers , state, & federal elected officials to help achieve better health and well-being for our communities.", "2019-01-09T00:44:00.000Z": "We need a healthcare system that works for everyone. Today, I signed two executive orders that will make sure all Wisconsinites can have access to quality, affordable healthcare while saving taxpayer dollars.", "2018-12-27T16:18:55.000Z": "If one of your New Year's plans was to apply for a job in the Evers administration, do it now! Our portal closes at the stroke of midnight on December 31 along with 2018: http:// bit.ly/ApplyEvers", "2018-12-27T19:46:54.000Z": "Last month, WI said it was time for a change in leadership to improve the direction of our state. We're entering a new era in our state's history. Tell us in a short video what the @GovElectEvers administration means for you & your family. http:// bit.ly/2QSjY2V  #OurWIOurValues 2019 Wisconsin Inauguration Video Submission Form The incoming administration is one that prioritizes the voice of the people. We want to hear from you. What does it mean for you and your family to have Governor-elect Tony Evers' administration... docs.google.com", "2018-12-19T23:47:21.000Z": "Listening to group discussions on what residents want to see in the next #WIBudget . We've heard a lot of ideas on job creation, public school funding, early childhood education, mental health services, health care, and criminal justice reform.", "2018-12-19T23:57:11.000Z": "From the very start our \"Building the People's Budget\" tour has been about listening to your ideas. Every single idea presented is being recorded by our team. @TheOtherMandela and I are committed to ensuring the next state budget reflects your priorities. #WIBudget", "2018-12-20T00:18:39.000Z": "Julia Underwood says she's been to a dozen Joint Finance Commission hearings & walked away feeling like she wasn't heard. She told us, \"This is totally different. This is organic. This is listening to people, and it's inspiring, and it's true grassroots democracy.\" #WIBudget", "2018-12-20T00:39:05.000Z": "Tonight was the last stop on the \"Building the People's Budget\" tour, but you can still share your thoughts with our team. We want to hear from you. Submit your #WIBudget thoughts online: http:// bit.ly/WIBudget19", "2018-12-19T18:19:00.000Z": "It's time we return Wisconsin to a place where we treat each other with respect and dignity, we stop pitting Wisconsinites against each other, and we actually talk and listen to each other.", "2018-12-19T18:17:00.000Z": "We'll accomplish our goals by running an efficient, effective government that is focused on bipartisan solutions, not political fights.", "2018-12-19T18:15:00.000Z": "Wisconsinites can rest assured that we're building a team that will bring science back to the Department of Natural Resources; reform our criminal justice system and address racial disparities while improving public safety; and highlight for the world all that WI has to offer.", "2018-12-19T18:13:11.000Z": "Today, I'm happy to announce Joel Brennan as Department of Administration secretary; Sara Meaney as Department of Tourism secretary; Preston Cole as Department of Natural Resources secretary; and Kevin Carr as Department of Corrections secretary.", "2018-12-18T17:57:51.000Z": "A packed crowd for the listening session for Governor-elect Tony Evers and Lt. Governor-elect Mandela Barnes. The listening session at American Legion Post 52 will be starting shortly.", "2018-12-18T01:29:29.000Z": "\"I came to the budget listening session because I try to expose my son, Axel, to the idea that being part of democracy is showing up and sharing the concerns you have.\" \n\n- Charmaine Swan from Ashland", "2018-12-18T16:12:00.000Z": "Your input is critical to creating the next state budget. That's why we're traveling the state to hear from you directly. If you can't make it to a listening session we still want to hear from you. Submit your #WIBudget thoughts online. Budget Listening Sessions Survey You will return to this page after each section, so that you can comment on whichever sections you are interested in. When you are done, select Finish and then click submit on the next page. docs.google.com", "2018-12-18T17:00:48.000Z": "We will be covering @GovElectEvers Building the People's Budget Tour in #LaCrosse today at 12 PM. Visit http:// wiseye.org to watch!", "2018-12-15T20:38:53.000Z": "Wisconsin, the deadline to get health insurance for 2019 is TODAY! Make sure you #getcovered -- head to http:// HealthCare.gov to sign you and your family up for insurance coverage today.", "2018-12-15T18:13:00.000Z": ". @TheOtherMandela and our team are traveling to Superior on Monday for our next #WIBudget listening session. Register today and make a plan to be a part of the discussion. http:// bit.ly/WIBudgetSuperi or ", "2018-12-15T17:00:00.000Z": "Don't forget to register for our #WIBudget listening session in La Crosse next week. Come discuss your priorities for the next state budget. I hope to see you there! Building the People's Budget - La Crosse Budget Brainstorming Session with Governor-elect Evers and Lieutenant Governor-elect Barnes eventbrite.com", "2018-12-14T20:38:35.000Z": "@JohnKasich , con't: \"You talk about divisions and cynicism. So I win the election, you try to take my power away. What are you, kidding?\"\n\n\"It flabbergasts me to see what people are willing to do in pure partisanship and pure power.\"", "2018-12-14T20:37:31.000Z": "As governor, I will put the people of Wisconsin first and work to find common ground because that's what the people of this state deserve.", "2018-12-14T20:37:30.000Z": ". @GovWalker chose to ignore and override the will of the people of Wisconsin. Wisconsin residents expect more from their government than what has happened in our state over the past few weeks.", "2018-12-14T19:37:25.000Z": "\"The people of Wisconsin deserve better\" than the extraordinary session legislation, @GovElectEvers says. \"Wisconsinites deserve a government that works for them.\"", "2018-12-14T19:35:24.000Z": ".@GovElectEvers says Walker signing extraordinary session bills \"flies in the face\" of what Wisconsin voters want. \"The will of the people was ignored.\"", "2018-12-13T21:29:22.000Z": "Even the smallest Wisconsinites are joining us on our #WIBudget listening tour. Max & his dad came out to the Wausau listening session to learn more about our \"What's Best for Kids\" Advisory Council. We want to hear from you, too. Submit your feedback: http:// bit.ly/WIBudget19", "2018-12-13T18:36:00.000Z": "Wisconsin, you still have two days to #getcovered . Don't wait. Head over to http:// HealthCare.gov now and sign up for a plan that is right for you & your family.", "2018-12-13T17:56:00.000Z": "Tremendous turnout for yesterday's #WIBudget listening session in Wausau. We can't wait to hear from you in Superior, La Crosse, and Milwaukee next week. We would love to hear from you even if you can't make it. Submit your feedback: Budget Listening Sessions Survey You will return to this page after each section, so that you can comment on whichever sections you are interested in. When you are done, select Finish and then click submit on the next page. docs.google.com", "2018-12-13T16:13:44.000Z": "\"You feel like you're a real person whose opinions matter. Seeing neighbors, teachers, and elected officials from my own community motivate me to keep going. We need more tolerance in talking about our ideas together.\" - Rogelino Romano on the Wausau #WIBudget listening session", "2018-12-13T02:12:54.000Z": "The people of Wisconsin are coming out to discuss issues that are important to them. We're collecting all of their thoughts to shape the next state budget. #WIBudget", "2018-12-13T01:58:27.000Z": "We had a great #WIBudget listening session in Wausau this afternoon. Folks discussed budget priorities on criminal justice reform, the environment, health care, the economy, and public education.", "2018-12-12T22:31:18.000Z": "Get more information on the latest #WIBudget events & more on our Facebook page: http:// bit.ly/GovElectEversFB", "2018-12-12T21:06:34.000Z": "\"Building the People's Budget\" Tour Coming to Superior\n \nMADISON-Governor-elect Tony Evers and Lt. Governor-elect Mandela Barnes today announced an additional stop on their statewide 'Building the People's Budget' tour... https:// facebook.com/RepMilroy/post s/1502982539804511 ", "2018-12-12T20:59:00.000Z": "We would love to hear from you, even if you can't attend a budget listening event in person. Submit your #WIBudget feedback here: Budget Listening Sessions Survey You will return to this page after each section, so that you can comment on whichever sections you are interested in. When you are done, select Finish and then click submit on the next page. docs.google.com", "2018-12-12T20:37:00.000Z": "Just three days left to #getcovered , Wisconsin. Head over to http:// HealthCare.gov today and sign up for a plan that is right for you & your family.", "2018-12-12T19:40:00.000Z": "\"The budget session facilitated really good conversations with the entire crowd. Having these kinds of roundtable conversations with our community is really important.\" Tehassi Hiil of the Oneida Nation on the Green Bay #WIBudget listening session.", "2018-12-12T18:54:36.000Z": "\"This was a great forum to be able to talk with other people hear what other people have to say. [...] Which I think is really important especially when this is being called the people's budget.\" - Melissa Fredricks #WIBudget", "2018-12-12T18:35:05.000Z": "Holy mackerel! We had more than 200 people show up to the #WIBudget listening session in Green Bay yesterday. The way we will build a budget that reflects the values and priorities of Wisconsinites is by listening to everyone's ideas. Tony Evers, Mandela Barnes hold Green Bay listening session amid lame-duck tension Evers labeled the event a stark contrast to the Legislature's recent lame-duck session. greenbaypressgazette.com", "2018-12-12T18:11:40.000Z": "Packed house for @GovElectEvers budget listening session.", "2018-12-12T18:18:29.000Z": ". @Tony4WI arrives in Wausau as part of four-stop public budget listening tour. Calls open event a \"stark contrast\" compared to GOP pushing lame-duck legislation last week.", "2018-12-11T22:44:29.000Z": "Governor-elect Tony Evers and Lieutenant Governor-elect Mandela Barnes kicking off the first of four public listening sessions on the 2019-2021 biennial budget in Green Bay. \"We are here to listen to you! Let's get to work!\"", "2018-12-11T22:41:11.000Z": "Full house for @Tony4WI & @TheOtherMandela budget listening session. @uwgb  @BrownWIExec", "2018-12-11T22:39:01.000Z": "Governor-elect Tony Evers and Lt Gov-elect Mandela Barnes are hosting a public listening session at @uwgb to hear what people would like included in the next two-year budget.", "2018-12-09T14:56:54.000Z": "FULL INTERVIEW: \"The entire thing is a mess. It's a hot mess,\" @Tony4WI says on the Wisconsin legislature liming the power of the governor before he comes into office. #MTP  https:// nbcnews.to/2RNx9ii", "2018-12-09T14:57:48.000Z": "WATCH: Governor-Elect Tony Evers (D-Wisc.) discusses possible litigation if Gov. Scott Walker signs legislation to limit his power. \n\n@GovElectEvers: \"I need to stand up for the people of Wisconsin.\" #MTP", "2018-12-09T01:25:04.000Z": "Former GOP Gov. Scott McCallum urges Scott Walker to reject lame-duck plans https:// jsonline.com/story/news/pol itics/elections/2018/12/08/former-gop-gov-mccallum-urges-walker-reject-lame-duck-plans/2251097002/  via ... @WisVoter  Former GOP Gov. Scott McCallum urges Scott Walker to reject lame-duck plans Walker is urged by a GOP predecessor to reject parts of the Republicans' lame-duck legislation, saying it looks like a power grab and damages faith in the system. jsonline.com", "2018-12-09T02:01:31.000Z": "Sheldon Lubar says Scott Walker signing lame-duck plans would 'destroy' him Sheldon Lubar says Scott Walker signing lame-duck plans would 'destroy' him \"He's the only one that can stop it,\" Lubar said. \"I think it will fail in court, but that won't change how the history of Wisconsin looks on him.\" jsonline.com", "2018-12-08T22:41:37.000Z": "Gov.-elect Evers and Lt. Gov.-elect Barnes to kick off budget listening tour across Wisconsin on... The public is invited to offer input on budget priorities for incoming Gov. Tony Evers and Lt. Gov. Mandela Barnes in four cities beginning Tuesday. jsonline.com", "2018-12-06T18:10:24.000Z": ". @SykesCharlie calls for a veto of the WI emergency session bills: \"Gov Walker needs to reflect on the kind of legacy he is going to leave...This would be a moment to celebrate democracy, the norms, and the peaceful and reasonable transition of power.\" https:// msnbc.com/hardball/watch /dems-in-uproar-after-wisconsin-gop-rams-through-power-grab-1389852227725 ", "2018-12-06T14:50:43.000Z": "Gov-elect @Tony4WI addresses capacity gathering at annual @TheNewNorth summit at @cityofappleton  @foxcitiesec . #NNSummit18", "2018-12-06T14:53:35.000Z": "LIVE: Gov.-elect @Tony4WI is in #Appleton at the 15th annual New North Summit: https:// fox11online.com/news/local/gov -elect-tony-evers-visits-appleton ", "2018-12-05T15:41:13.000Z": "Statement from WI Gov.-elect @Tony4WI on extraordinary session", "2018-12-05T11:39:27.000Z": "\"If the head of WEDC isn't a trusted, even central, part of the governor's cabinet, the whole economic development enterprise will suffer. And so will Wisconsin's economy,\" the eight wrote in a lengthy statement released Tuesday. Eight former economic development directors tell lawmakers not to change job creation board Eight former heads of the state's job-creation efforts are urging Republican lawmakers to drop changes to the Wisconsin Economic Development Corp. jsonline.com", "2018-12-05T04:55:39.000Z": "Democratic Gov.-elect Tony Evers calls the Republicans' attempt to strip the incoming leaders of key powers \"embarrassing,\" adding that \"this is bad public policy and it's telling the people of Wisconsin that their vote doesn't count.\" https:// cnn.it/2Eeisla", "2018-12-05T04:36:05.000Z": "Lame duck session: Republican Sheldon Lubar accuses Walker of overreach - via @MegJonesJS Influential Republican businessman Sheldon Lubar sharply criticizes Walker for lame-duck session Influential Republican businessman Sheldon Lubar sent a sharply worded email to Scott Walker asking him not to support limiting the governor's power. jsonline.com", "2018-12-04T18:56:54.000Z": "Always great to be back in Milwaukee with @Gwen4Congress and @MayorOfMKE ! It's time we focus on working together to solve the problems facing our state.", "2018-12-03T14:27:05.000Z": "On November 6th, Wisconsin voters said it's time for a change. Instead, Republican are trying to rig the rules and cling to control. Call your legislators and tell them not to override the will of the people. #OverrideWI", "2018-11-11T15:30:49.000Z": "Thank you to everyone who has served our country. Today, and every day, let's honor those who have served and commit to do better by those who have sacrificed so much. #VeteransDay", "2018-11-09T00:07:10.000Z": "Wrapped the campaign the way it began: working to find ways we can put our kids first and ensure every child has an opportunity to grow and thrive.\n\nThank you to the Boys and Girls Club of Dane County for the tour!", "2018-11-08T22:58:55.000Z": "Thank you, Wisconsin!", "2018-11-08T17:30:30.000Z": "Let me be clear: the Republicans and Speaker Vos should stop any and all attempts to play politics and weaken the powers of the governor's office in Wisconsin before I take the oath.", "2018-11-07T23:11:26.000Z": "I want to thank @ScottWalker and his family - as well as @RebeccaforReal and her family - for their years of service to our state.", "2018-11-07T08:22:28.000Z": "Today marks a new day for our state. A change is coming, Wisconsin!", "2018-11-07T04:06:34.000Z": "We're passing the time with a little game of Euchre.", "2018-11-07T01:29:46.000Z": "If you're in line at your polling place by 8 PM you can vote! Stay in line and make your voice heard! http:// IWillVote.com", "2018-11-07T01:00:31.000Z": "It's crunch time. Polls close in just ONE hour!\n\nIf you haven't voted yet there's still time to make your voice heard! Head to http:// IWillVote.com to find your polling location, grab your photo ID, and get there by 8 PM!\n\nIf you're in line at 8 PM you can vote!", "2018-11-06T22:00:14.000Z": "4 hours until polls close! We're seeing incredible turnout across Wisconsin - and with the race neck and neck, your vote is crucial. \n\nFind your polling location at http:// IWillVote.com , grab your photo ID, and head to the polls before 8 PM!", "2018-11-06T21:05:17.000Z": "Wisconsinites across the state are making their voices heard at the ballot box and voting for Tony & Mandela. Don't miss your chance to make your mark on our state's future.\n\nConfirm where you vote at http:// IWillVote.com , grab your photo ID, and head to the polls before 8 PM! GIF", "2018-11-06T19:18:37.000Z": "There's too much at stake to sit this election out - go vote for Democrats up and down the ticket! http:// IWillVote.com", "2018-11-06T18:44:30.000Z": "Have any questions about voting in Wisconsin? Call our voter hotline for help 414-998-0400 #ElectionDay", "2018-11-06T17:04:14.000Z": "What a humbling morning - Kathy and I just wrapped up voting at the Madison Public Library.\n\nWith the race neck and neck, every vote is crucial. Get out and vote, Wisconsin! http:// IWillVote.com", "2018-11-06T14:03:25.000Z": "It's time to get out and vote, Wisconsin! Polls are open until 8 PM and you can find where you vote at http:// IWillVote.com .\n\nGrab a friend, your photo ID, and head to the polls to make your voice heard!", "2018-11-06T13:01:36.000Z": "It's Election Day! Polls are open now until 8 PM. Find your polling location at http:// IWillVote.com  Grab a friend and your photo ID Head to the polls to make your voice heard!", "2018-11-06T03:26:05.000Z": "What an incredible GOTV Birthday Rally - thank you to everyone who came out!\n\nAfter 14 months on the campaign trail, it all comes down to tomorrow. Go vote, Wisconsin! http:// IWillVote.com  #TourForChange", "2018-11-06T01:22:41.000Z": "Wisconsin faces a clear choice tomorrow - four more years of @ScottWalker putting himself first, or a new direction for the state of Wisconsin.\n\nShare this with friends and family to make sure they see it before polls open!", "2018-11-05T21:46:23.000Z": "It's time for a change. http:// IWillVote.com", "2018-11-05T21:14:02.000Z": "Heartbroken to hear of the passing of Phil Neuenfeldt, a champion for the working men and women of Wisconsin. He will be dearly missed.", "2018-11-05T21:03:33.000Z": "Education is on the ballot. Health care is on the ballot. Our Wisconsin values are the ballot.\n\nThat's why Janesville is fired up to get out and vote tomorrow! Join them  http:// IWillVote.com  #TourForChange", "2018-11-05T19:23:12.000Z": "Breaking: @JenShillingWI is reporting that #EversFever is taking over Wisconsin!", "2018-11-05T18:23:39.000Z": "Beloit is fired up to vote for change tomorrow!\n\nHave you made your plan to vote yet? http:// IWillVote.com  #TourForChange", "2018-11-05T17:33:22.000Z": "It all comes down to tomorrow.\n\nIgnore the polls, ignore the predictions - there's too much at stake to sit this one out. Get out and vote! http:// IWillVote.com", "2018-11-05T16:03:06.000Z": "Kathy surprised me with a special birthday Egg McMuffin on the #TourForChange bus!", "2018-11-05T15:19:01.000Z": "With less than 24 hours until polls open, now is the time to make your plan to vote!\n\nFind everything you'll need for Election Day  http:// IWillVote.com", "2018-11-05T03:55:54.000Z": "Stopped by our @UWMadison campus office to deliver some pizza and cheer on the @Packers ! #TourForChange  #GoPackGo", "2018-11-05T02:55:13.000Z": "Milwaukee knows there's too much at stake on Tuesday to sit on the sidelines - that's why this fired up room is doing everything they can to get folks to the polls. \n\nSign up to help  http:// tonyevers.com/get-involved/  #TourForChange", "2018-11-05T01:22:04.000Z": "Wisconsin is covered in green and gold tonight, but here's to hoping it's blue on Tuesday.", "2018-11-05T00:32:56.000Z": "I love this state. And I've loved traveling all across Wisconsin the last week, talking about our positive vision for WI, and firing people up to volunteer and get out the vote.\n\nCheck out a few of the highlights from our trip so far . #TourForChange Tour For Change youtube.com", "2018-11-04T22:27:10.000Z": "Hopping on the Tour for Change bus with @Tony4WI ! Head over to Facebook to watch something special soon: http:// facebook.com/tammybaldwin", "2018-11-04T22:29:40.000Z": "Stopped in Kenosha to fire up our incredible volunteers before they hit the doors. With less than 52 hours until polls close, it's all hands on deck to get out the vote!\n\nSign up to help when it counts the most  https:// tonyevers.com/get-involved/  #TourForChange", "2018-11-04T20:53:34.000Z": "It may be cold and rainy outside - but Racine is fired up and feeling the #EversFever . Let's hit the doors and get out the vote! #TourForChange", "2018-11-04T19:24:58.000Z": "Great morning visiting churches throughout Milwaukee and chatting with folks about the change they want to see happen in Wisconsin.", "2018-11-04T18:37:39.000Z": ". @ScottWalker has been talking out of both sides of his mouth when it comes to pre-existing conditions. He says he will protect them, yet he's in court to gut them.\n\nI'll drop Wisconsin from the lawsuit on day one and always protect people with pre-existing conditions.", "2018-11-04T17:13:40.000Z": "Proud to be endorsed by the @LaCrosseTribune !\n\n\"Throughout his career, he has shown sincerity in the power of improving education to improve our economy and our quality of life.\n\nTo us, that's the priority Wisconsin needs. And Tony Evers will provide it.\" La Crosse Tribune endorsements in Tuesday's election 94th Assembly District: Steve Doyle lacrossetribune.com", "2018-11-04T02:39:21.000Z": "Stopped by our Bay View office to take a few selfies and thank our incredible volunteers for a great first day of get out the vote.\n\nThree more days, let's finish strong! #TourForChange", "2018-11-04T01:48:50.000Z": "Waukesha is fired up to take our state back on Tuesday! #TourForChange", "2018-11-04T00:17:42.000Z": "This Plymouth progressive is thrilled to be back in The Cheese Capital of the World!\n\nThe Plymouth values of kindness, respect, and working together made me who I am - it's time we brought those values to the Governor's Mansion in Madison. #TourForChange", "2018-11-03T23:46:13.000Z": "What a homecoming in Plymouth! #TourForChange", "2018-11-03T23:17:49.000Z": "It may be cheesy, but it's Gouda to be back in Plymouth - The Cheese Capital of the World! #TourForChange", "2018-11-03T22:47:07.000Z": "Fond Du Lac is ready to get out the vote and turn Wisconsin blue on Tuesday! #TourForChange", "2018-11-03T22:29:43.000Z": "Our kids can't afford four more years of @ScottWalker attacking our schools.\n\nMy education plan fully funds our public schools and puts our kids first. Let's get it done, Wisconsin! #TourForChange", "2018-11-03T21:36:05.000Z": "#WhichWalker do you believe?\n\nThe one who spent the last 8 years trying to repeal the ACA and gut protections for pre-existing conditions?\n\nOr the one lying about his record with 3 days until Election Day.\n\nWe know better, @ScottWalker .", "2018-11-03T20:46:11.000Z": ". @ScottWalker has made it his mission to divide and conquer our state - he even said it himself.\n\nWe deserve better. As governor, I'll work every day to unite our state, repair the damage of the last 8 years, and create a better Wisconsin for all. Evers stresses 'positive vision' Five days before the midterm elections, Democratic gubernatorial candidate Tony Evers shared a clear message Thursday with supporters about the importance of the Chippewa Valley to his chances of... leadertelegram.com", "2018-11-03T19:06:41.000Z": "Stopped in Appleton to talk with folks about our plan to ensure every Wisconsinite has access to quality, affordable health care. #TourForChange", "2018-11-03T18:43:13.000Z": "Stopped by Nala's Cheese & Wine in De Pere to pick up a snack for the road and chat with folks about making a plan to vote. #TourForChange", "2018-11-03T16:54:11.000Z": ". @TheOtherMandela and I are hitting the doors to get folks out to vote! \n\nIt's going to take all of us pitching in what we can this weekend to win on Tuesday - join us  http:// wiwill.vote  #TourForChange", "2018-11-03T16:05:55.000Z": "The weekend we've been waiting for is finally here - it's time to Get Out The Vote! \n\nIt all comes down to our grassroots army hitting the doors and getting folks to the polls - that's why @TammyBaldwin and I spent the morning firing up volunteers in Green Bay. #TourForChange", "2018-11-03T15:00:44.000Z": "Good morning, Green Bay! #TourForChange", "2018-11-03T14:44:23.000Z": "Milwaukee: \nLAST CHANCE for Early Voting! \n\nToday & Tomorrow \n11AM - 5 PM\n\nINFO: http:// wisdems.org/MKE  #VoteBlueWI   #blueWI2018", "2018-11-03T03:10:37.000Z": "Stopped by the Brown County Dems office for a late night visit to thank our incredible organizers for all their hard work.\n\nIt's finally Get Out The Vote weekend, let's finish strong! #TourForChange", "2018-11-03T02:40:56.000Z": "Stopped by a Friday Fish Fry in Manitowoc to fire up supporters and talk about what's at stake on Tuesday.\n\nLet's get out and vote, Wisconsin! #TourForChange", "2018-11-03T01:04:02.000Z": "Squeezing in a quick game of Euchre with @TheOtherMandela , @SarahforWI , and @DanKohlWI in between #TourForChange stops!", "2018-11-03T00:03:30.000Z": "Packed rooms full of fired up volunteers are how we take our state back on Tuesday. Thank you, Oshkosh! #TourForChange", "2018-11-02T23:16:03.000Z": ". @ScottWalker rejected the Medicaid expansion money to boost his own political career and it cost Wisconsin $1.1 billion. We deserve better.\n\nI'll take the federal money and expand Medicaid on day one. #TourForChange", "2018-11-02T20:40:57.000Z": "UW-Stevens Point knows that education is on the ballot this Tuesday. \n\nAfter eight years of attacks under @ScottWalker , it's time to invest in our UW System, treat our educators with respect, and tackle the student debt crisis in Wisconsin. #TourForChange", "2018-11-02T20:07:19.000Z": "Wausau is fired up to vote for change and a governor who puts us first! #TourForChange", "2018-11-02T18:17:52.000Z": "It's great to be back in Wisconsin to support @Tony4WI & my friend @TammyBaldwin ! We need Tammy back in the Senate to keep fighting for health care & Social Security. Get out and vote, Wisconsin!", "2018-11-02T17:27:00.000Z": "Health care is on the top of the ballot on Tuesday.\n\nAs governor, I would accept the Medicaid expansion and ensure everyone gets the care they need - @ScottWalker will keep putting himself first. The 2018 Elections Will Decide If Millions Of People Will Gain Health Insurance Through Medicaid Two competing forces are going to war during these midterms, and Medicaid could grow or be transformed dramatically depending on who wins. buzzfeednews.com", "2018-11-02T16:48:57.000Z": "Always great to be back in Rhinelander talking about our plan to bring back science and common sense to the state of Wisconsin. \n\nWe must protect our natural resources. #TourForChange", "2018-11-02T16:25:39.000Z": "Good morning, Rhinelander! #TourForChange", "2018-11-02T15:40:55.000Z": "There are just FOUR days until Election Day and that means there are just a few days left to talk with folks and get them out to vote! \n\nWe can't turn Wisconsin blue without your help. Sign up to help this final weekend  https:// tonyevers.com/get-involved/", "2018-11-02T04:10:31.000Z": "Wrapped up day two of our #TourForChange with great stops in Superior and Ashland!\n\nCreating a government that works for us means making sure it works for all Wisconsinites. I'll always put people first and ensure no corner of the state gets left behind.", "2018-11-02T03:23:09.000Z": "So excited to have @JanetBewley4WI on the #TourForChange bus! Together, we'll strengthen our public schools, fight for affordable health care, and ensure northern Wisconsin gets the resources and support it deserves.", "2018-11-02T01:42:07.000Z": "Thank you for the warm welcome, Superior! #TourForChange", "2018-11-02T01:18:01.000Z": "I'm proud to stand with @BarackObama , a President who did what @ScottWalker doesn't have the backbone to do: fight to expand health care and protect those with pre-existing conditions. Walker: Obama is 'the biggest liar in the world' Wisconsin Gov. Scott Walker (R), who is locked in a tight reelection bid, called former President Obama the \"biggest liar in the world\" at a campaign event on Thursday. thehill.com", "2018-11-01T23:03:58.000Z": "This packed room in Hudson is fired up to take our state back and elect Democrats up and down the ballot. Thank you to @ChrisCoons for joining us! #TourForChange", "2018-11-01T21:14:14.000Z": "With five days until Election Day, @ScottWalker is ramping up his lies on health care.\n\nRetweet and help us set the record straight.", "2018-11-01T19:44:37.000Z": "Incredible energy at our #TourForChange stop at UW-Eau Claire! Students are fired up to vote for a governor who will invest in our UW System and tackle the student debt crisis.", "2018-11-01T19:27:57.000Z": "Stopped by local businesses in downtown Eau Claire to shake a few hands and chat with folks about what's at stake on Tuesday. #TourForChange", "2018-11-01T18:36:54.000Z": "Couldn't swing through Osseo without stopping by Norske Nook for some great pie and great conversation. #TourForChange", "2018-11-01T17:00:43.000Z": "\"More than ever, we need women and men of character in public office.\" - @JoeBiden Wisconsin faces a clear choice this election - four more years of a governor who always puts himself first, or a lifelong educator who will do what's best for us. It's time for a change.", "2018-11-01T16:22:40.000Z": "This is rich coming from the guy who has spent 8 years trying to repeal the ACA and gut protections for pre-existing conditions every chance he's gotten. We can't trust Scott Walker.\n\nThe only way to protect pre-existing conditions is to get out & vote  http:// IWillVote.com Quote Tweet Patrick Marley @patrickdmarley At a stop in Waukesha today, Gov. @ScottWalker went much further than he's gone before and said he would put into state law \"the exact same language\" as Obamacare as it relates to covering pre-existing conditions. Show this thread", "2018-11-01T16:00:16.000Z": "In just FIVE days we have the chance to take back our state and turn Wisconsin blue - but we can't do it without your help.\n\nTalk to five friends and family about why you're supporting Tony & @TheOtherMandela and get them out to vote!", "2018-11-01T15:25:21.000Z": "Kicked off day two of our statewide #TourForChange in my old home of Tomah! It's always great to be back in a community that means so much to me and my family.", "2018-11-01T13:33:40.000Z": "For eight years, Scott Walker has put his personal political ambitions above what's best for Wisconsin and we've paid the price.\n\nThat's why four former cabinet secretaries are speaking out against him before Tuesday's election. It's time for a change.", "2018-11-01T00:04:46.000Z": "Took a quick break from the campaign trail to go trick-or-treating with the grandkids - even stopped by our old home in Verona. #HappyHalloween everyone!", "2018-10-31T22:15:15.000Z": "La Crosse has a clear message: It's time for a change. #TourForChange", "2018-10-31T21:26:32.000Z": "Always great to be with @kindforcongress and @jenshillingwi !\n\nFrom rural broadband to good schools - there's so much at stake for western Wisconsin this November  http:// IWillVote.com  #TourForChange", "2018-10-31T20:39:17.000Z": "It's time for a cone. #TourForChange", "2018-10-31T20:04:25.000Z": "Yeah, well, you know, that's just, like, your opinion, man. Quote Tweet Molly Beck @MollyBeck So this @Tony4WI ad appears to reference \"The Big Lebowski\": https:// youtube.com/watch?v=-w4scA D_GHo ", "2018-10-31T19:08:36.000Z": "It wouldn't be a tour across Wisconsin without a stop at a family owned dairy farm. Thank you to the Servais family for showing us around! #TourForChange", "2018-10-31T18:29:32.000Z": "Breaking: The latest Marquette Law School Poll has us TIED with Scott Walker. We've never been this close to beating him so close to Election Day. This is our chance Donate: http:// TonyEvers.com/donate Volunteer: http:// TonyEvers.com/get-involved/ Vote: http:// IWillVote.com", "2018-10-31T17:03:02.000Z": "Great stop in Platteville where we talked about our plan to put people first and invest in our UW System again. After eight years of Scott Walker attacking education, it's time for a change. #TourForChange", "2018-10-31T16:08:11.000Z": "So excited to have @Kriss4Wisconsin with us for the first leg of our #TourForChange . Together, we're going to repair our roads and get rid of those Scott-holes once and for all!", "2018-10-31T15:09:10.000Z": "Thank you to everyone who came out to say hello at our first stop in Dodgeville! #TourForChange", "2018-10-31T14:31:50.000Z": "Incredible welcome at our first #TourForChange stop in Dodgeville. Folks are fired up to take our state back this November!", "2018-10-31T13:15:38.000Z": "Today we're officially kicking off our statewide #TourForChange ! Over the next 6 days we'll be traveling around the state, talking about our positive vision for Wisconsin, and firing up people to get out and vote.\n\nFind an event near you  https:// bit.ly/2qmc3LQ", "2018-10-30T23:57:24.000Z": "Wisconsin faces a big choice this election - four more years of a governor who puts politics over people, or a governor who will do what's best for us.\n\nIt's time for a change and I humbly ask for your vote on November 6th.", "2018-10-30T22:19:47.000Z": "Incredible energy at this afternoon's Early Vote Rally with @JoeBiden & @TheOtherMandela in Milwaukee. We have just seven days to go - let's win this thing and take our state back! http:// IWillVote.com", "2018-10-30T20:10:17.000Z": "We're live in Milwaukee at our Early Vote Rally with Vice President @JoeBiden ! Tune in  http:// Facebook.com/Tony4WI", "2018-10-30T17:55:11.000Z": "Excited to have Vice President @JoeBiden on the campaign trail in Wisconsin today!\n\nThere's so much at stake for young people in this election - that's why this packed room of UW-Madison students is fired up to vote early for Tony, Mandela, and our incredible Democratic ticket.", "2018-10-30T14:55:20.000Z": "There's just ONE week until we take back our state and turn Wisconsin blue.\n\nWe can't do it without you. Make your plan to vote today  http:// IWillVote.com", "2018-10-30T13:33:07.000Z": "With one week to go, our momentum is surging in every corner of Wisconsin. People are fired up to take back our state and turn Wisconsin blue on November 6th.\n\nIt's time for a change.", "2018-10-30T00:24:48.000Z": "The @CollegeDemsWI have a challenge for you:\n\nTake out your phone , text friends, and get them out to early vote ! There's too much at stake this November to let anyone you know sit on the sidelines.", "2018-10-29T23:43:25.000Z": "\"Wisconsin was once looked up to as a national leader in protecting the environment and natural resources. Vote for Tony Evers.\"\n\nThis is bigger than politics - let's restore Wisconsin's leadership and protect our natural resources for generations to come. Your Views: Walker is no friend of conservation Gov. Scott Walker has played a major role in harming Wisconsin's environment and natural resources for eight years. Here are just a few examples: The 2015-17 budget eliminated 16 Department gazettextra.com", "2018-10-29T23:03:32.000Z": "Last Call Don't miss your chance to see @JoeBiden at tomorrow's early vote rallies in Madison and Milwaukee!\n\nRSVP for Madison: http:// bit.ly/2PUWOnZ RSVP for Milwaukee: http:// bit.ly/2PpfkIs", "2018-10-29T21:22:41.000Z": "#TeamTony isn't fueled by wealthy special interests - we're fueled by folks pitching in what they can to build a better Wisconsin. With your help, we've raised over $6 million with an average online contribution of $18.\n \nHelp take us over the finish line: https:// bit.ly/2OezJuO", "2018-10-29T18:31:45.000Z": "My promise to Wisconsin is simple: As governor, I'll always put people over politics and work to ensure everyone has access to the quality, affordable health care they deserve.", "2018-10-29T18:31:43.000Z": "Now that it's election season, @ScottWalker is claiming he'll keep protections for pre-existing conditions and protect our health care after years of working to do the opposite.\n\nWe see right through the election year lies.", "2018-10-29T18:31:41.000Z": "By putting politics above people, @ScottWalker has cost Wisconsin $1,100,000,000.\n\nWe deserve better.", "2018-10-29T18:31:39.000Z": ". @ScottWalker 's attacks on our health care don't stop with pre-existing conditions.\n\nIn order to boost his own political career, he has rejected the federal money to expand BadgerCare - hurting the health care of Wisconsin families.", "2018-10-29T18:31:38.000Z": "On day one, I'll do what @ScottWalker has failed to: put people above politics and withdraw Wisconsin from the lawsuit to gut protections for pre-existing conditions.", "2018-10-29T18:31:35.000Z": "Over and over again, I've challenged @ScottWalker to do what's best for Wisconsinites and drop Wisconsin out of the lawsuit to gut pre-existing condition protections.\n\nHis response? Silence every time.", "2018-10-29T18:31:21.000Z": "His passion for repealing the ACA didn't stop after his failed presidential bid. Just this year, he ordered Wisconsin to sue the government over the ACA.\n\nIf successful, pre-existing condition protections would be gutted and the health care of millions would be on the line.", "2018-10-29T18:31:19.000Z": "For eight years, @ScottWalker has made repealing the ACA and gutting protections for pre-existing conditions a hallmark of his political career.\n\nIn fact - he promised to repeal the ACA on day one as president.", "2018-10-29T18:31:17.000Z": "I've said it before and I'll say it again: @ScottWalker is not telling the truth.", "2018-10-29T17:36:31.000Z": "Students across Wisconsin are fired up to vote early!", "2018-10-29T16:07:02.000Z": "Great morning with UW-Madison students talking about what's at stake in this election for young people and the importance of early voting.\n\nEarly voting is quick and easy! Make your plan today  http:// IWillVote.com", "2018-10-29T01:08:30.000Z": "This Tuesday, @JoeBiden is coming back to Wisconsin for early vote rallies in Madison and Milwaukee! You won't want to miss this, RSVP today.\n\nJoin us in Madison: http:// bit.ly/2PUWOnZ Join us in Milwaukee: http:// bit.ly/2PpfkIs", "2018-10-29T00:03:49.000Z": "Big News: I've officially been endorsed by the @WiStateJournal !\n \n\"After eight years of one-party rule, and with Republicans rigging voting district maps to their favor, electing Evers governor will provide some much-needed balance to state decisions.\" Our endorsement: Elect Tony Evers for unity, balance After years of one-party rule, Democrat is best choice for governor madison.com", "2018-10-28T23:06:55.000Z": "Couldn't ask for a better Sunday than visiting Milwaukee churches throughout the city. Was a pleasure meeting everyone all morning and afternoon.", "2018-10-28T20:12:18.000Z": "Let's go @Packers - beat the Rams! #GoPackGo", "2018-10-28T18:52:18.000Z": ". @BarackObama laid out what's at stake in this election. From the health care of millions to a politics that's decent and honest - it's all on the ballot this November. \n\nIt's up to us to show up to the polls and vote for the change we seek: http:// IWillVote.com", "2018-10-28T17:26:55.000Z": "What unites us as Wisconsinites is far greater than what divides us. It's time to put an end to the divide and conquer politics of the last eight years and come together to solve the problems facing our state. Wedge Issues: Tony Evers wants to be known as a uniter Join political reporter Jessie Opoien for Wedge Issues, a podcast catching you up with the candidates, strategists, analysts and power players in the 2018 election. madison.com", "2018-10-28T15:37:02.000Z": "I'm more fired up than ever for these final 9 days! Let's win this, Wisconsin. http:// IWillVote.com", "2018-10-28T00:14:04.000Z": "Thank you @JayInslee for joining us for a great afternoon on the campaign trail!", "2018-10-27T23:41:20.000Z": "10 days until Election Day means there are just 10 days left to reach as many voters as possible. That's why these fired up volunteers in Algoma are doing everything they can to spread the word. Sign up to help  https:// tonyevers.com/get-involved/", "2018-10-27T21:58:52.000Z": "Hear it straight from @BarackObama : @ScottWalker is flat-out lying about keeping protections for pre-existing conditions.", "2018-10-27T20:23:06.000Z": "Incredible energy at this afternoon's canvass kickoff in Green Bay with @TammyBaldwin and @JayInslee . With just 10 days to go, our momentum growing in every corner of the state.", "2018-10-27T18:34:19.000Z": ". @ScottWalker continues to talk out of both sides of his mouth. He says he'll keep protections for pre-existing conditions, yet he's suing to gut them.\n\nActions speak louder than words. https:// vox.com/policy-and-pol itics/2018/10/11/17955688/2018-midterm-elections-preexisting-conditions-obamacare ", "2018-10-27T17:08:23.000Z": "Our places of worship are places of sanctuary for all of us. My heart breaks for the victims, families, and first responders whose lives have been shattered by this act of violence in Pittsburgh. We must join together against anti-semitism and hate in all its forms.", "2018-10-27T15:28:05.000Z": "Kicked off a busy Saturday on the trail with a stop by the Milwaukee Community Brainstorming Forum. Great discussions on how we can work together to tackle the issues facing the city and our state."}