{"2020-06-19T23:43:49.000Z": "REMINDER: CA, you are now REQUIRED to wear a mask in public spaces.\n\nWe're seeing too many people with faces uncovered. Wearing a face covering is critical for keeping people safe and healthy, keeping businesses open and getting people back to work.\n\nDo your part. Wear your mask.", "2020-07-30T14:44:50.000Z": "Today's #laearthquake is a reminder to be prepared! Follow 5 steps for emergency preparedness in @ListosCA 's disaster ready guide. http:// listoscalifornia.org  Get the \"My Shake\" app for early warning notifications of 4.5M+ earthquakes in your area. http:// bit.ly/MyShakeApp GIF", "2020-07-30T06:21:20.000Z": "\"There should be no barriers between Californians and the benefits they have earned,\" @GavinNewsom explained. Governor Gavin Newsom unveils new task force to tackle EDD backlog Newsom says a task force is being created to play catch-up amidst a daunting backlog, and help tighten up operations. abc7news.com", "2020-07-30T00:00:14.000Z": "Better schools. Safer roads. Healthier neighborhoods. \n\nAll Californians can help their communities secure these resources and more by participating in the #2020Census .\n\nAll you have to do is answer 9 easy questions online. #ICount   http:// my2020census.gov", "2020-07-29T22:48:45.000Z": "Governor @GavinNewsom announced a series of actions to better serve workers that have experienced job loss during the #COVID19 pandemic, including the formation of an @CA_EDD strike team, and a renewed focus on processing unpaid claims. Governor Newsom Takes Action to Strengthen State Unemployment Insurance Delivery System | Califor... New strike team will set path for needed reforms at the Employment Development Department New efforts transform EDD's customer service delivery, including faster and improved communications SACRAME... gov.ca.gov", "2020-07-29T22:05:22.000Z": "We can flatten this curve -- but we have to do it together. Taking basic actions like washing our hands.\n\nListen to @BillNye :", "2020-07-29T21:18:37.000Z": "Me again:\n\nYou\nreally\n really\n   really\n     really\n       really\n       really\n     really\n   really\n really\n really\n  really\n    really\n      really\n     really\n  really\nneed to wear a mask.", "2020-07-29T18:39:20.000Z": "Governor @GavinNewsom today announced that over $1 billion has gone back into the pockets of more than 3.6 million working Californians and their families through the #CalEITC and Young Child Tax Credit. #CaliforniaforAll California Puts Money Back Into the Pockets of Millions of Working Californians Amid COVID-19... Over $1 billion goes back into the pockets of more than 3.6 million Californians and their families, through the California Earned Income Tax Credit and Young Child Tax Credit Nearly half a million gov.ca.gov", "2020-07-29T21:04:54.000Z": "Important Quote Tweet CA SOS Vote @CASOSvote FACT CHECK: Earlier this week, the USPS issued guidance to voters on returning vote-by-mail ballots. In CA, as long as your ballot is postmarked by Election Day, #November3rd , & received by the 17th day after the election, your ballot will be processed. #VoteSafeCA  #VoteCalifornia", "2020-07-29T18:00:01.000Z": "This November keep voting locations safe for voters and election workers! You can skip the line by turning in your completed vote-by-mail ballot, vote early at an early voting location, & follow safety procedures. Learn more at http:// Vote.ca.gov  #VoteSafeCA  #VoteCalifornia", "2020-07-29T18:02:39.000Z": "Today's #COVID19 update:\n\n- 99,600 tests reported yesterday\n- 8,755 positive cases\n- Positivity rate has slightly dropped to an average of 7.4%.\n\nTragically, CA surpassed another somber milestone today: 197 deaths. Our highest reported in a single day.\n\nPlease -- WEAR A MASK.", "2020-07-29T15:39:39.000Z": "Today, Members of Congress sadly said goodbye to our friend, Congressman John Lewis, as he left the U.S. Capitol for the last time. Thank you to all who helped give John the beautiful farewell he received over the last two days.", "2020-07-29T14:38:38.000Z": "CA is making $600M available to house homeless individuals in innovative ways--like buying hotels.\n\nProject Roomkey has successfully moved tens of thousands of homeless people into hotel rooms during #COVID19 .\n\nNow, we're expanding & making that permanent. Bay Area counties can spend millions buying hotels for homeless people, but timeline is tight Bay Area officials are racing to put together proposals to buy hotels and motels as the state prepares to hand out hundreds of millions of dollars in the coming weeks for properties that can be... sfchronicle.com", "2020-07-29T00:55:00.000Z": "Listen to the scientists: Wear a mask.", "2020-07-29T02:30:02.000Z": "#COVID19 is disproportionately impacting Latinos in CA, particularly in the Central Valley. \n\nGovernor @GavinNewsom announced a proposed $52M for eight Central Valley counties to help expand disease investigation, contact tracing & quarantine efforts. Newsom wants to send $52 million to help Central Valley fight coronavirus surge California's governor is sending \"strike teams\" to eight counties while asking lawmakers to approve $52 million for testing, tracing and isolation protocols in those regions. latimes.com", "2020-07-28T16:01:55.000Z": "The $5 mill XPRIZE RAPID COVID TESTING starts now. The mission: develop COVID-19 testing solutions that are frequent, fast, cheap and easy, so the world can safely move forward.  REGISTER NOW  https:// bit.ly/307AeQJ  #covidtesting  #takeactionnow  #prizelaunch", "2020-07-28T16:44:47.000Z": "\"Competition is the key to innovation and @xprize is seizing this moment to challenge the best and brightest minds around the world to develop #COVID19 testing that is high-quality, affordable and accessible.\" - Governor @GavinNewsom XPrize to give $5 million to creator of cheap, fast COVID-19 testing Google and Amazon are backing it, among others. mashable.com", "2020-07-28T23:20:15.000Z": "The fact is -- we don't know enough about how #COVID19 has impacted communities across our state. This is a step in the right direction. California Will Now Collect LGBTQ Coronavirus Data Advocates had been pushing for the state to collect such data for months, arguing that LGBTQ people are left out of California's response to the outbreak. forbes.com", "2020-07-28T16:00:22.000Z": "Exclusive: Democrats introduce a bill to fund legal assistance for those facing eviction. A wave of evictions is coming. Democrats are proposing a lifeline. Exclusive: Reps. Ayanna Pressley and Rosa DeLauro and Sen. Kamala Harris introduce a bill to fund legal assistance for Americans facing eviction. vox.com", "2020-07-28T21:02:55.000Z": "1 year ago today a gunman opened fire at the Gilroy Garlic Festival. People ran for their lives.\n\n3 lives were lost. So many more altered forever.\n\n1 year later and the @GOP continue to block any and all commonsense gun reforms. It's sick.\n\nWe cannot continue like this. Vote. Quote Tweet Gavin Newsom @GavinNewsom This is nothing short of horrific.  Tonight, CA stands with the Gilroy community. My office is monitoring the situation closely. Grateful for the law enforcement's efforts and their continued work as this situation develops. twitter.com/GilroyPD/statu", "2020-07-28T16:32:05.000Z": "WATCH LIVE AT 12PM: @CHHSagency Secretary Dr. Mark Ghaly hosts a video conference call to provide an update on #COVID19 in California. CHHS Secretary Dr. Mark Ghaly Provides Update on COVID-19 in Califo... youtube.com", "2020-07-28T03:26:04.000Z": ". @RobertGarciaLB -- our hearts are with you and your family tonight. There's no easy way to cope with losing a mother, but know that her remarkable legacy of service, passion, and dedication to her community lives on with you. California is a better place thanks to her.", "2020-07-27T22:31:22.000Z": "#COVID19 disproportionately impacts the Latinx community.\n\nRising rates in the Central Valley are concerning. CA is making $52M available to increase testing, contact tracing and quarantine efforts, and sending strike teams to 4 counties with increased cases and hospitalizations.", "2020-07-27T19:23:51.000Z": "Today's #COVID19 update:\n\n128,439 tests were reported yesterday, with 6,891 positive cases.\n \nCA's positivity rate remains at an average of 7.5%.\n\nTragically, 29 fatalities were reported yesterday bringing our current average to 109 lives lost every day.\n\nPlease -- wear a mask.", "2020-07-27T19:05:19.000Z": "TUNE IN NOW for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on California's response to #COVID19 . https:// twitter.com/i/broadcasts/1 ynJOqPBqWQKR ", "2020-07-27T16:03:32.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to #COVID19 . Watch live at 12:00 PM.\nYouTube: https:// youtu.be/PJLh9oTC9tk Facebook: https:// bit.ly/CAcovid727 Twitter: @CAgovernor", "2020-07-27T00:31:40.000Z": "To the woman who truly does it all -- Our rock. My forever love. Your passion and purpose inspire me every day. Happy anniversary, @JenSiebelNewsom ! Here's to 100 more.", "2020-07-26T16:06:15.000Z": "WATCH: The casket of Rep. John Lewis has made the final journey across the Edmund Pettus Bridge in Selma, Alabama. https:// cbsn.ws/2WW5a4z", "2020-07-26T18:21:40.000Z": "Quote Tweet Jennifer Siebel Newsom @JenSiebelNewsom Happy anniversary my love @GavinNewsom ! Seeing you rise to every occasion with love, grace, and compassion- always with ALL Californians in heart and mind- makes me so proud to be your partner in life. Love you to the moon and back!", "2020-07-25T15:26:21.000Z": "Wearing a mask in public helps slow the spread of #COVID19 . \n\nWearing a mask while swimming? Probably not safe. \n\nBe a hero like @jackblack . Wear a mask. #YourActionsSaveLives From Jack Black", "2020-07-25T15:18:21.000Z": "It's the weekend. So yes, I will repeat this again:\n\nWEAR A MASK.", "2020-07-25T01:00:00.000Z": "We are heading into the weekend! You know what that means... Hanging out with people in your household Wearing a face covering to slow the spread Practicing physical distancing to protect vulnerable Californians Washing your hands frequently", "2020-07-24T19:31:55.000Z": "Today's #COVID19 numbers:\n\nNew cases: 9,718\n7-day average: 9,881\n\nAverage positivity rate for tests: 7.5%\n\nA lot of numbers that tell us one thing: take this seriously. We can't let up.\n\nIt takes all of us -- acting TOGETHER -- to slow the spread.\n\nWEAR A MASK.", "2020-07-24T19:15:25.000Z": "From this graph, you can see why @CAgovernor  @GavinNewsom is focusing on farm workers and many others. http:// kpix.com/live", "2020-07-24T19:23:12.000Z": "Stopping the spread of #COVID19 depends on keeping our essential workforce safe.\n\nToday CA announced new actions to increase safety including:\n-increasing preventative measures like ability to quarantine when exposed\n-increasing employer education & a new employer safety handbook", "2020-07-24T19:01:34.000Z": "TUNE IN NOW for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . https:// twitter.com/i/broadcasts/1 MYxNVBRWNnxw ", "2020-07-24T16:04:43.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to #COVID19 . Watch live at 12:00 PM.\nYouTube: https:// youtu.be/pHR97d0viMA Facebook: https:// bit.ly/CAcovid724 Twitter: @CAgovernor", "2020-07-24T01:50:43.000Z": "This will deprive states of one of the most effective strategies to reverse decades of racially driven housing segregation. White House scraps fair housing rule as Trump bids for suburban voters Administration officials briefed select congressional staff on Wednesday on the new proposal. politico.com", "2020-07-23T19:54:50.000Z": "Today, CA reached a somber milestone: 157 deaths. Our highest\nreported in a single day.\n\nWe cannot afford to ignore #COVID19 , or simply hope it goes away. We have to take action. TOGETHER.\n\nWear a mask. Physically distance. Wash your hands.\n\nYour actions can literally save lives.", "2020-07-23T17:53:00.000Z": "A \"friendly\" reminder from @OscarTheGrouch -- stay home when you can and practice physical distancing!\n\nHelp slow the spread of #COVID19 . From Sesame Street", "2020-07-22T22:35:09.000Z": "Governor @GavinNewsom announced CA has moved to secure an additional 120 million N-95 masks & 300 million more surgical masks for distribution to front-line workers & will maintain a stockpile of 100 million N-95 respirators & 200 million surgical masks. Governor Newsom Announces Enhanced State Stockpile, Purchase of 420 Million New Protective Masks |... State will maintain a stockpile of 100 million N-95 respirators and 200 million surgical masks to increase preparedness heading into the fall California also moves to secure an additional 120 million gov.ca.gov", "2020-07-22T20:24:59.000Z": "We've been working w/ the Newsom admin &hospitals to get more PPE. @gavinnewsom announced today a record # of new #COVID19 cases. He said the state has procured 111mil N95 masks &ordered 120mil more. Thank you, @gavinnewsom for your work on PPEs as we continue in this crisis.", "2020-07-22T19:27:05.000Z": "From Day 1 of this pandemic, @GavinNewsom has prioritized the health & safety of workers. With the uptick of cases, PPE for essential workers is more important than ever. We deeply appreciate @CAgovernor 's efforts to procure more PPE to ensure health & safety remains paramount. Quote Tweet Gavin Newsom @GavinNewsom CA has taken unprecedented steps to ensure we have the PPE we need to keep CA safe.\n\nDistributed so far:\n86.4 million N95 masks\n297 million surgical masks\n\nThose distributions will continue. To protect our nurses, doctors, farmworkers, and more -- and help CA flatten the curve.", "2020-07-22T19:32:25.000Z": "Thank you, @GavinNewsom , for your tireless support of essential industries and workers.\n\nThrough his distribution of PPE, the Governor has helped California's grocery community meet this moment, keeping stores safe for workers and shoppers during the #COVID19 pandemic. Quote Tweet Gavin Newsom @GavinNewsom CA has taken unprecedented steps to ensure we have the PPE we need to keep CA safe.\n\nDistributed so far:\n86.4 million N95 masks\n297 million surgical masks\n\nThose distributions will continue. To protect our nurses, doctors, farmworkers, and more -- and help CA flatten the curve.", "2020-07-22T19:25:42.000Z": "Thank you @CAgovernor for helping California physicians get the PPE we need to keep us and our patients safe. CMA will distribute millions of gloves, masks and gowns provided by the state to physician practices across CA in the coming days. https:// cmadocs.org/newsroom/news/ view/ArticleId/48957/CMA-partners-with-State-of-California-to-provide-free-personal-protective-equipment-to-physician-practices   @GavinNewsom CMA partners with State of California and Altais to provide free PPE to physician practices In an effort to ensure California physicians can continue to provide care to patients during the COVID-19 outbreak, the... cmadocs.org", "2020-07-22T19:19:49.000Z": "CA has taken unprecedented steps to ensure we have the PPE we need to keep CA safe.\n\nDistributed so far:\n86.4 million N95 masks\n297 million surgical masks\n\nThose distributions will continue. To protect our nurses, doctors, farmworkers, and more -- and help CA flatten the curve.", "2020-07-22T19:09:29.000Z": "Today, CA is reporting a record high number of cases:\n\nSingle day #: 12,807\n7-day average: 9,420\nTotal: 413,576\n\nYesterday's test #: 127,487\nTotal: 6,664,419\n7-day positivity rate: 7.6%\n\nThose are a lot of numbers that tell us one thing: we MUST take this seriously.\n\nWEAR A MASK.", "2020-07-22T19:01:23.000Z": "TUNE IN NOW. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . https:// twitter.com/i/broadcasts/1 zqKVekOBXpxB ", "2020-07-22T16:02:54.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to #COVID19 .\n\nWatch live at 12:00 PM. \nYouTube: https:// youtu.be/x3E9cWY4g7Q Facebook: https:// bit.ly/CAcovid722 Twitter: @CAgovernor", "2020-07-22T14:01:56.000Z": "This isn't complicated:\n1) wear a mask\n2) wash your hands\n3) practice physical distancing. Three simple acts can stop Covid-19 outbreaks, study finds Coronavirus could be stopped if everyone used masks, washed their hands and stayed apart, anew study finds. cnn.com", "2020-07-22T04:13:21.000Z": "This is the right move. Exclusive: Santa Clara County DA abandoning death penalty pursuit in all cases Drastic policy shift likely to headline announcement of reforms Wednesday; four death-penalty cases under Jeff Rosen have yielded no trips to death row. mercurynews.com", "2020-07-21T20:17:34.000Z": "\"In California, we will not back down from our historic work to achieve a fair and accurate Census count.\"\n\nRead Governor @GavinNewsom 's full statement on the Trump administration's memorandum to exclude undocumented immigrants from the #2020Census . Governor Newsom Statement on Trump Administration's Census Memorandum Excluding Immigrant Communi... SACRAMENTO - Governor Gavin Newsom issued the following statement today on the Trump administration's memorandum for the Secretary of Commerce to exclude undocumented immigrants when determining gov.ca.gov", "2020-07-16T17:40:03.000Z": "Wear a !!! @CAgovernor  @CAPublicHealth  @GavinNewsom  #YourActionsSaveLives  #COVID19", "2020-07-21T21:38:24.000Z": "Do as she says not as she does. Don't be like @Lilly -- #wearamask ! #youractionssavelives", "2020-07-21T19:00:08.000Z": "Tune in! Quote Tweet CA Public Health @CAPublicHealth LIVE NOW: @CHHSagency Secretary Dr. Mark Ghaly hosts a video conference call to provide an update on #COVID19 in California: https:// youtu.be/phBogH_sE-8", "2020-07-21T18:04:56.000Z": "Tune in at 12pm for a #COVID19 update from Sec. Ghaly. Quote Tweet CA Public Health @CAPublicHealth WATCH LIVE AT 12PM: @CHHSagency Secretary Dr. Mark Ghaly hosts a video conference call to provide an update on #COVID19 in California: https:// youtu.be/phBogH_sE-8", "2020-07-20T21:43:32.000Z": "CA released new guidelines today allowing for hair salons and barbershops to operate outdoors. #COVID19 Gov. Newsom on New Guidelines for Barbershops, Hair Salons to Operate Outdoors Safely Gov. Gavin Newsom released new guidelines for barbershops and hair salons to operate outdoors in a safe environment Monday. knx1070.radio.com", "2020-07-20T19:36:27.000Z": "YOU have the power to slow the spread of #COVID19 .\n\nBe smart. Do your part. Quote Tweet Office of the Governor of California @CAgovernor Our decisions have the power to determine: how we connect with family and friends when children go back to school when businesses reopen \n\nReduce your risk of getting or giving #COVID19 ! #YourActionsSaveLives", "2020-07-20T19:11:56.000Z": "Our decisions have the power to determine: how we connect with family and friends when children go back to school when businesses reopen \n\nReduce your risk of getting or giving #COVID19 ! #YourActionsSaveLives", "2020-07-20T18:56:25.000Z": "LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . Office of the Governor of California @CAgovernor CA COVID-19 Update", "2020-07-19T01:50:00.000Z": "Remembering John Lewis' pivotal speech from the March on Washington. He was only 23 then. From Kamala Harris", "2020-07-19T00:00:00.000Z": "If we can see your nose and mouth, you aren't wearing it correctly.\n \nPull those masks up, California! #YourActionsSaveLives", "2020-07-18T03:52:49.000Z": "\"When you see something that is not right, not just, not fair, you have a moral obligation to do something.\" \n\nTonight, the world lost a legend. Let us honor his life and memory with action. \n\nRest in power, @repjohnlewis . From Kyle Griffin", "2020-07-17T23:26:10.000Z": "A huge victory in an unwarranted and vindictive lawsuit against California. #COVID19 is not the only unprecedented challenge and crisis we're facing right now -- we cannot afford to waver in our efforts to fight the existential threat of climate change. U.S. Court Rules That California Work With Quebec on CO2 Market Is Constitutional usnews.com", "2020-07-17T21:35:11.000Z": "Continued learning is a non-negotiable. But the health and safety of our teachers, students, and staff must be our top priority. Newsom orders virtual instruction in most California counties About 80 percent of California's population lives in a watch list county. politico.com", "2020-07-17T19:48:42.000Z": "The health and safety of our teachers, students, and staff must be our top priority -- while also allowing our students to continue to learn during the #COVID19 pandemic.", "2020-07-17T19:48:41.000Z": "", "2020-07-17T19:48:40.000Z": "When does a physically open school need to close?\n\nFollowing a confirmed case of #COVID19 at school, those exposed should be quarantined for 14 days. The school should revert to distance learning when multiple cohorts have cases or 5% of students & staff test positive in 14-days.", "2020-07-17T19:48:39.000Z": "In CA, science will determine when a school can be physically open--and when it must close. But learning must be non-negotiable.\n\nSchools must provide meaningful learning during #COVID19 . And we must do everything we can to keep our teachers, staff & students safe. That means:", "2020-07-17T19:06:30.000Z": "TUNE IN NOW for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom announces #COVID19 guidance for schools and provide an update on the state's response to the pandemic. https:// twitter.com/i/broadcasts/1 DXxyAbOBLnxM ", "2020-07-17T16:09:49.000Z": "TODAY: Governor @GavinNewsom will announce #COVID19 guidance for schools and provide an update on the state's response to the pandemic. \n\nWatch live at 12 PM\nYouTube: https:// youtu.be/dvv-BySKBBo Facebook: https:// bit.ly/CAcovid717 Twitter: @CAgovernor", "2020-07-17T14:26:12.000Z": "The world lost a legend today. Rest In Peace, Rev. C.T. Vivian. C.T. Vivian, Civil Rights Leader, Is Dead at 95 A close associate of the Rev. Dr. Martin Luther King Jr., he was a disciplined advocate of nonviolence in the battle for racial justice. nytimes.com", "2020-07-17T03:30:18.000Z": "Listen to @jackblack :\n\nBE A HERO.\n\nWEAR A MASK. #YourActionsSaveLives From Jack Black", "2020-07-16T19:09:22.000Z": "Don't be selfish -- \n\nWear a mask.\n\nWe can crush this curve, but we have to do it TOGETHER.", "2020-07-16T17:45:30.000Z": "Building on the success of Project Roomkey, Governor @GavinNewsom announced the availability of $600 million in funding for Homekey, the next phase in the state's response protecting Californians experiencing homelessness who are at high risk for #COVID19 . Governor Newsom Announces $600 Million in Homekey Funds Now Immediately Available for Local... Cities and counties to use funds to acquire hotel/motel rooms and other buildings to convert to permanent housing The Department of Housing & Community Development is issuing a Notice of Funding gov.ca.gov", "2020-07-15T19:25:12.000Z": "Well deserved, @MichaelDTubbs . You are leading in strategic, humane, loving ways. \"May I stress the need for courageous, intelligent, and dedicated leadership.\" #MLK Quote Tweet One Young World @OneYoungWorld #OYW Politician of the Year 2020: @MichaelDTubbs is Stockton's first African-American Mayor & youngest mayor in the history of the US to represent a city with a population over 100,000. Under his leadership, he saw a 30% reduction in homicide.\n\nRead more: https:// bit.ly/2CCOyHq Show this thread", "2020-07-15T15:17:24.000Z": "It's #TaxDay ! California has an automatic extension to file your income taxes to October 15. However, the deadline to pay is today. For more info visit http:// ftb.ca.gov  #FTB", "2020-07-15T14:30:00.000Z": "#COVID19 isn't going away anytime soon and it's up to all of us to keep CA healthy. Wear a mask. Wash your hands. Physically distance. Avoid mixing with people outside your household. #YourActionsSaveLives", "2020-07-14T20:51:32.000Z": "Great news. This cruelly political and absurd rule should've never been proposed in the first place. Quote Tweet The New York Times @nytimes Breaking News: The Trump administration walked back a policy that would have stripped foreign college students of their visas if their courses were entirely online https:// nyti.ms/2WkEwBZ Show this thread", "2020-07-13T04:09:33.000Z": "Perpsective: Your mask feels uncomfortable? Get over it. As a surgeon, I know how vital they are. Perspective | Your mask feels uncomfortable? Get over it. As a surgeon, I know how vital they are. In the operating room, you wear a mask to protect the patient from infections. Mask-wearing during a pandemic protects other people. washingtonpost.com", "2020-07-13T23:13:16.000Z": "Shutting down is a difficult decision, but @GavinNewsom is right to do so given the surge in COVID-19 infections across California.\n\nWe all must do our part to slow the spread and save lives by social distancing and wearing masks.\n\nWe must act now, or things will only get worse. Quote Tweet Gavin Newsom @GavinNewsom NEW: #COVID19 cases continue to spread at alarming rates.\n \nCA is now closing indoor operations STATEWIDE for:\n\n-Restaurants\n-Wineries\n-Movie theaters, family entertainment\n-Zoos, museums\n-Cardrooms\n\nBars must close ALL operations.", "2020-07-14T19:04:54.000Z": "Tune in! Quote Tweet CA Public Health @CAPublicHealth LIVE NOW: @CHHSAgency Secretary Dr. Mark Ghaly hosts a video conference call to provide an update on CA's efforts to get testing resources to those most in need and #COVID19 in California. https:// youtu.be/Q7Y_xzOBDIw", "2020-07-14T17:30:41.000Z": "Tune in at 12pm for a #COVID19 update with CA's HHS Secretary Dr. Mark Ghaly. Quote Tweet CA Public Health @CAPublicHealth Watch live at 12pm: @CHHSagency Secretary Dr. Mark Ghaly hosts a video conference call to provide an update on CA's efforts to get testing resources to those most in need and #COVID19 in California. https:// youtu.be/Q7Y_xzOBDIw", "2020-07-14T17:03:59.000Z": "LIVE NOW: First Partner @JenSiebelNewsom hosts a virtual & bilingual storytime as a part of the #CASummerReading challenge.  : https:// bit.ly/CASummerReadin g714  Quote Tweet CA State Library @CAStateLibrary Ready for Storytime?! Join @JenSiebelNewsom this morning at 10 am for a Facebook Live Storytime! https:// facebook.com/jensiebelnewso m/ ", "2020-07-14T16:30:36.000Z": "Even without symptoms, you can spread #COVID19 .\n\nTake this seriously.\n\nWear a mask. Slow the spread. #YourActionsSaveLives From Office of the Governor of California", "2020-07-13T18:33:53.000Z": "Voting by mail shouldn't be a partisan issue--especially during a pandemic. Everybody should be able to request an absentee ballot, and make their voice heard in every election. Why Is Voting By Mail (Suddenly) Controversial? Here's What You Need To Know President Trump's warnings of potential fraud don't line up with what elections experts predict or with how most Americans feel about voting by mail. Here are the facts about mail ballots. npr.org", "2020-07-13T20:52:56.000Z": "Counties impacted:\n\nColusa\nContra Costa\nFresno\nGlenn\nImperial\nKings\nLA\nMadera\nMarin\nMerced\nMonterey\nNapa\nOrange\nPlacer\nRiverside\nSacramento\nSan Benito\nSan Bernardino \nSan Diego\nSan Joaquin\nSanta Barbara \nSolano\nSonoma\nStanislaus\nSutter\nTulare\nYolo\nYuba\nVentura\n*", "2020-07-13T19:07:58.000Z": "NEW: As #COVID19 cases and hospitalizations continue to rise, 30 counties will now be required to CLOSE INDOOR OPERATIONS for:\n\n-Fitness Centers\n-Places of Worship\n-Offices for Non-Critical Sectors\n-Personal Care Services\n-Hair Salons and Barbershops\n-Malls", "2020-07-13T19:04:49.000Z": "NEW: #COVID19 cases continue to spread at alarming rates.\n \nCA is now closing indoor operations STATEWIDE for:\n\n-Restaurants\n-Wineries\n-Movie theaters, family entertainment\n-Zoos, museums\n-Cardrooms\n\nBars must close ALL operations.", "2020-07-13T19:00:23.000Z": "TUNE IN NOW for a major #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . https:// twitter.com/i/broadcasts/1 eaKbzyOoLBKX ", "2020-07-13T16:05:03.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to #COVID19 . Watch live at 12:00 PM.\nYouTube: https:// youtu.be/i3WBmNQ9R60 Facebook: https:// bit.ly/CAcovid713 Twitter: @CAgovernor", "2020-07-13T01:30:00.000Z": "Wear a mask for essential workers, for your neighbors and for your loved ones. Together we can slow the spread! #YourActionsSaveLives", "2020-07-10T23:37:15.000Z": "WEEKEND REMINDER: #COVID19 is not over just because you may be over it.", "2020-07-09T21:30:23.000Z": "Listen to @BillNye (who uses the word \"literally\" much more \"literally\" than I do) --\n\nWearing a mask will LITERALLY save lives.", "2020-07-09T02:58:38.000Z": "A test is not a passport to party.\n\nJust because you test negative for COVID-19 doesn't mean you should get together with people outside your household. We all need to continue to avoid gatherings. This virus is deadly and we must stop the spread.", "2020-07-09T20:30:51.000Z": "#COVID19 has created unique challenges for CA to fight wildfires but that isn't slowing us down from preparing.\n\nSince 2019, CA has: Completed 35 fuel projects to protect high-risk locations Invested in firefighting tech Worked to develop more responsive utilities\n& more", "2020-07-09T19:36:13.000Z": "WEAR. A. MASK.", "2020-07-09T19:16:37.000Z": ". @CAL_FIRE 's new Blackhawk helicopter will help California fight fires more quickly and effectively.\n \nThese new helicopters have a top speed that is 14% faster and can hold 3 xs more water than @CAL_FIRE 's current \"Super Huey\" helicopters. From CAL FIRE", "2020-07-09T19:03:05.000Z": "Tune in now for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor Live now: Governor @GavinNewsom provides an update on California's wildfire preparedness and response efforts amid #COVID19 . #YourActionsSaveLives  https:// twitter.com/i/broadcasts/1 yoKMXgabWwxQ ", "2020-07-08T16:59:20.000Z": "This is your reminder to #ShopSafeShopLocal . @CaliforniaOSBA has put together a website to help small businesses encourage people to stay safe while shopping locally. https:// goo.gle/3gBWNT0", "2020-07-08T20:30:18.000Z": "Public health workers will never ask for your Social Security number, immigration status, or financial information. To learn more about contact tracing, visit http:// californiaconnected.ca.gov", "2020-07-08T19:44:32.000Z": "NEW: #COVID19 cases continue to spread at alarming rates in some CA counties.\n \nCA is now asking Napa, San Benito, and Yolo to close indoor operations for:\n\n-Restaurants\n-Wineries\n-Movie theaters\n-Zoos, museums\n-Cardrooms\n\nBars must close ALL operations.", "2020-07-08T19:40:20.000Z": "CA's hospitalizations for #COVID19 are up 44% over the last 2 weeks. Our hospitals are still only at 8% capacity -- but that could quickly change.\n\nWe MUST take this SERIOUSLY. Wear your mask. Wash your hands. Practice physical distancing. #YourActionsSaveLives", "2020-07-08T19:13:39.000Z": "#LIVE : @GavinNewsom says California currently has 232 million procedure masks and 46 million N-95 masks in its supply inventory http:// abc7.la/3edJo1T", "2020-07-08T18:59:33.000Z": "Tune in now for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @gavinnewsom provides an update on California's response to #COVID19 . https:// twitter.com/i/broadcasts/1 eaKbzZYrwVKX ", "2020-07-07T22:29:44.000Z": "We can't right the wrongs of our past, but we can recognize them and commit to building a more equitable, just future for all. This move is symbolic -- but an important recognition of that promise. Columbus statue removed from California capitol rotunda SACRAMENTO, Calif. (AP) - Crews carried out a statue of Christopher Columbus from the center of the California Capitol rotunda on Tuesday, three weeks after legislative leaders announced it would... apnews.com", "2020-07-07T18:32:18.000Z": "", "2020-07-07T19:34:58.000Z": "What a brave and important piece. Thank you @Lenny_Mendonca for your courage to share your story. Your service to CA was an incredible blessing. Quote Tweet Lenny Mendonca @Lenny_Mendonca A different and more personal editorial from me\n\n\"Culture change starts at the top. We must do more than give lip service to eradicate the shame and stigma associated with having and treating mental health.\" https:// calmatters.org/commentary/my- turn/2020/07/i-faced-a-challenge-one-out-of-every-three-people-in-america-has-depression-and-anxiety/ ", "2020-07-07T17:22:14.000Z": "It's simple: Wear a mask. Practice physical distancing. Wash your hands. Slow the spread of #COVID19 . : @attn", "2020-07-07T16:24:17.000Z": "Listen to @tomhanks --\n\n\"The idea of doing one's part should be so simple: wear a mask, social distance, wash your hands. That alone means you are contributing to the betterment of your house, your work, your town, your society as a whole.\" From TODAY", "2020-07-06T21:15:35.000Z": "In a brutally difficult budget year, @CAgovernor  @GavinNewsom came through with state legislative leaders to find nearly $1 billion to get California's #homeless housed, in partnership with @CABigCityMayors .  Thank you for your leadership, Governor! A glimpse at some of what's in California's new $202-billion state budget While some California budget choices were supported by legislators from both major parties, the enacted plan largely reflects the priorities of majority Democrats. latimes.com", "2020-07-06T20:12:50.000Z": "NEW: #COVID19 CA case update. GIF", "2020-07-06T19:21:19.000Z": "NEW: #COVID19 cases continue to spread at alarming rates in some CA counties.\n \nCA is now asking Colusa, Madera, Marin, Merced, Monterey & San Diego to close indoor operations for:\n\n-Restaurants\n-Wineries\n-Movie theaters\n-Zoos, museums\n-Cardrooms\n\nBars must close ALL operations.", "2020-07-06T18:59:56.000Z": "Tune in now for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . #YourActionsSaveLives  https:// twitter.com/i/broadcasts/1 gqxvaPejLOJB ", "2020-07-06T16:24:24.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to #COVID19 . Watch live at 12:00 PM.\nYouTube: https:// youtu.be/SxuxjZV_oY8 Facebook: https:// bit.ly/CAcovid76 Twitter: @CAgovernor", "2020-07-05T22:44:07.000Z": "We cannot ignore #COVID19 because it's inconvenient or we're ready to go back to normal.\n\nIf we work together, we can flatten the curve.\n\nWear a mask. Wash your hands. Physically distance. Take this SERIOUSLY. #YourActionsSaveLives", "2020-07-04T22:56:38.000Z": "Happy Fourth! Let's #KindlyMask to keep each other safe! You're up @Jaymelemons  @laurabrown99  #NaomiWatts", "2020-07-04T20:40:05.000Z": "Happy #FourthofJuly - though we are all celebrating differently this year, let us summon the courage that drove our Founders, and the courage that drives all those who fight for America's promise today as we protect one another from #COVID19 .", "2020-07-04T19:30:00.000Z": "It's a holiday weekend, but #COVID19 isn't taking time off.\n\nBe safe, be smart, stay healthy. #YourActionsSaveLives", "2020-07-02T22:57:43.000Z": "A simple piece of fabric makes a big statement: I care. \n\nWear a mask. Let's all do our part to slow the spread. \n\nFor more, visit http:// covid19.ca.gov", "2020-07-03T22:00:19.000Z": "Take it outside this #4thofJuly weekend! While certain places may be closed, this is the perfect weekend to ride a bike, have a picnic or go swimming with the people in your household.\n\nStay safe to slow the spread! #YourActionsSaveLives", "2020-07-03T20:34:03.000Z": "We're going to have to celebrate differently this year. Everyone should cancel plans with others for the 4th of July. You shouldn't gather with anyone who doesn't live in your household.\n\nPlease stay home and save lives - it's that simple.", "2020-07-03T17:30:07.000Z": "Putting your mask under your nose defeats the purpose of wearing a mask in the first place. \n\nWear a mask the right way and stay 6ft away from others to slow the spread of #COVID19 .  http:// covid19.ca.gov", "2020-07-03T16:02:15.000Z": "This 4th of July weekend, protect the people you love by wearing a face covering to #SlowtheSpread of #COVID19 when in public or when physical distancing is not an option. #YourActionsSaveLives Learn more at http:// covid19.ca.gov", "2020-07-03T21:04:00.000Z": "Thank you to @DrBurkeHarris and @BTWFoundation for nominating me for the #KindlyMask challenge. I wear a mask for my kids, for my parents -- and for ALL of California! I challenge @lisaling , @LauraDern , & Aquaman himself, Jason Momoa- Who do you #KindlyMask for?", "2020-07-03T15:20:37.000Z": "Listen to @SteveKerr . Wear a mask. Quote Tweet Golden State Warriors @warriors It'll take a team effort to slow the spread of COVID-19.\n\nMask up, #DubNation » http:// covid19.ca.gov", "2020-07-02T19:14:30.000Z": "Un pedacito de tela demuestra que los demás te importan. \n\nEste fin de semana del cuatro de julio, protege a la gente que amas - usa mascarilla para reducir la propagación de #COVID19 . http:// covid19.ca.gov/es", "2020-07-02T19:11:00.000Z": "#COVID19 can spread up to 26 feet if you sneeze.\n\nWEAR A MASK.\n\nThis isn't about politics. It's about science.", "2020-07-02T19:06:55.000Z": "TUNE IN for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . https:// twitter.com/i/broadcasts/1 DXGyAzzlYbGM ", "2020-06-27T22:50:37.000Z": "Throwing SHADE if you're not wearing a mask. #WearADamnMask ⠀⠀⠀⠀⠀⠀⠀⠀⠀\nP.S. Happy #NationalSunglassDay", "2020-06-29T23:32:27.000Z": "It's a Beautiful Day to Save Lives. @DempseyCenter  #WearAMask  #COVID19  #YourActionsSaveLives", "2020-07-02T17:12:55.000Z": "Wear a mask. Slow the spread. #YourActionsSaveLives From Office of the Governor of California", "2020-07-02T13:52:36.000Z": "REMINDER: #COVID19 does not take the summer off. Does not take the weekend off. And will not take 4th of July off.", "2020-07-01T20:44:50.000Z": "Wearing a mask is a sign of toughness. Of resolve. \n\nA sign of someone who gives a damn. Who wants to solve a problem. Who takes responsibility.\n\nI think that's a beautiful thing.", "2020-07-01T19:21:11.000Z": "NEW: All parking facilities at state beaches in Southern CA and the Bay Area will be CLOSED for the upcoming weekend. #COVID19 does not take 4th of July off. Avoid crowds. Do not gather with people you do not live with.\n\nWear a mask. Physically distance. Be smart. Do your part.", "2020-07-01T19:13:48.000Z": "This applies to the following counties:\n\n- Contra Costa\n- Fresno\n- Glenn\n- Imperial\n- Kern\n- Kings\n- LA\n- Merced\n- Orange\n- Riverside\n- Sacramento\n- San Bernardino\n- San Joaquin\n- Santa Barbara\n- Santa Clara\n- Solano\n- Stanislaus\n- Tulare\n- Ventura", "2020-07-01T19:09:33.000Z": "#COVID19 continues to spread at an alarming rate.\n\nEffective immediately, 19 counties must close indoors operations for the following sectors:\n\n- Restaurants\n- Wineries\n- Movie theaters & family entertainment\n- Zoos, museums\n- Cardrooms\n\nBars must close ALL operations.", "2020-07-01T19:00:30.000Z": "TUNE IN NOW for a major announcement and #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . https:// twitter.com/i/broadcasts/1 kvKpegyAMmGE ", "2020-07-01T03:35:22.000Z": "Governor @GavinNewsom signed SB 350, which protects CA by giving the state the authority to hold PG&E accountable if the company fails to adhere to public safety policies, & to put safety, reliability & its customers at the center of its business model. Governor Newsom Signs SB 350, Giving the State Protection that PG&E will be Transformed into a... Signing follows 18 months of unprecedented state intervention to transform PG&E and put safety, reliability and its customers at the center of its business model SACRAMENTO - Today gov.ca.gov", "2020-06-30T20:24:32.000Z": "#COVID19 is on the rise.\n\nWe flattened the curve once, we can do it again.\n\nWe can crush this pandemic. We can get past this. But we have to be tougher and we have to do it TOGETHER.\n\nWear your mask. Practice physical distancing. Do your part.\n\nYour actions will save lives.", "2020-06-30T20:12:31.000Z": "During this pandemic, CA has housed over 14,000 homeless individuals in hotels across our state.\n\nNow -- we're leading the nation by expanding that program and making it permanent. Coronavirus: More than 14,000 homeless Californians moved into hotels, Newsom says Gov. Gavin Newsom touts \"significant milestones\" in his Project Roomkey initiative. mercurynews.com", "2020-06-30T19:09:44.000Z": "TUNE IN NOW for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's initiative to secure hotel & motel rooms to protect homeless individuals from #COVID19 . https:// twitter.com/i/broadcasts/1 vOGwkmNRwRGB ", "2020-06-30T19:03:32.000Z": "Tune in shortly for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor TODAY: Governor @GavinNewsom will provide an update on the state's initiative to secure hotel & motel rooms to protect homeless individuals from #COVID19 . Watch live @ 12 PM.\nYouTube: https:// youtu.be/xbMVFlNxWhY Facebook: https:// bit.ly/CAcovid630 Twitter: @CAgovernor", "2020-06-30T02:30:02.000Z": "California is taking steps to limit the spread of #COVID19 in the counties that are seeing the biggest increases. Newsom orders bars closed in 7 California counties, including L.A., due to coronavirus spread Bars in these California counties are immediately affected by the state order: Los Angeles, Fresno, Kern, San Joaquin, Tulare, Kings and Imperial. latimes.com", "2020-06-29T20:07:13.000Z": "CA's response to #COVID19 is based on science.\n\nThat's why we asked counties that are experiencing high transmission and positivity rates to close down bars & toggle back re-openings.\n\nWe will continue to monitor counties across the state & take appropriate action when necessary.", "2020-06-29T19:06:55.000Z": "TUNE IN for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on California's response to #COVID19 . https:// twitter.com/i/broadcasts/1 RDxlrBZdjlGL ", "2020-06-29T16:31:44.000Z": "LIVE AT 12:00PM: Governor @GavinNewsom will provide an update on California's response to #COVID19 . Tune in \nYouTube: https:// youtu.be/8jUyJFIiLUc Facebook: https:// bit.ly/CACOVID629 Twitter: @CAgovernor", "2020-06-29T16:41:57.000Z": "An incredible victory against the latest attempt to effectively eliminate access to abortion.\n\nA woman's right to choose is a constitutional right -- and today, the Supreme Court once again affirmed that. Quote Tweet MSNBC @MSNBC BREAKING: US Supreme Court strikes down Louisiana abortion law. https:// on.msnbc.com/3eKzTZd Show this thread", "2020-06-29T01:45:32.000Z": "Week ahead reminder:\n- #COVID19 has not gone away.\n- Wash your hands.\n- Practice physical distancing.\n- Wear a mask.\n- TAKE THIS SERIOUSLY.", "2020-06-28T19:17:19.000Z": "NEW: Due to the rising spread of #COVID19 , CA is ordering bars to close in Fresno, Imperial, Kern, Kings, Los Angeles, San Joaquin, and Tulare, while recommending they close in Contra Costa, Riverside, Sacramento, San Bernardino, Santa Barbara, Santa Clara, Stanislaus, & Ventura.", "2020-06-28T18:55:23.000Z": "Never been a more urgent election --  and CA Democrats have never been more energized, united and ready to elect our next President.\n\nAt this moment in history, I'm proud that our Delegation will be chaired by those who reflect the diversity and dynamism of our great state. Quote Tweet Rusty Hicks @rustyhicks Per agreement between the Biden & Sanders Campaigns... \n\nTomorrow, Delegates will have the opportunity to confirm 3 outstanding Co-Chairs to lead our 2020 California Delegation: @BLeeForCongress  @HildaSolis  @RoKhanna  #OnwardToNovember   @CA_DEM", "2020-06-27T16:03:53.000Z": "Be kind. Wear a mask. Quote Tweet Reese Witherspoon @ReeseW Hey Everybody! Wearing a mask is not a political statement. It means you care about other people's health and safety. Be KIND, wear a mask!", "2020-06-26T23:48:27.000Z": "\"This victory, won by a coalition of states led by CA, protects taxpayers from wasteful spending on an empty campaign promise that will not make us safer & puts border communities at risk during the current pandemic.\"\n\nGovernor Newsom's statement on today's border wall ruling:", "2020-06-27T00:15:13.000Z": "Today, Governor @GavinNewsom visited Tri Tool, a California manufacturing company where he announced a new online marketplace run by @cmta that will help California companies access non-medical grade PPE. \n\nCA companies can learn more here: http:// SafelyMakingCA.org", "2020-06-26T23:59:33.000Z": "Love connects every single one of us. For that to be denied simply because you love someone of the same sex is just wrong.\n\nIn 2004, we defied the law and began marrying same sex couples in SF.\n\n5 years ago today, we saw that become the law of the land. 5 Years After Same-Sex Marriage Decision, Equality Fight Continues Since the legalization of same-sex marriage in all 50 states, the LGBTQ rights movement has expanded its vision. This year's celebration comes after another big Supreme Court decision last week. npr.org", "2020-06-26T19:02:34.000Z": "Dick Cheney says WEAR A MASK. #realmenwearmasks", "2020-06-26T19:34:11.000Z": "We're thrilled to announce a new partnership with Gov. @GavinNewsom and State of CA to help California safely reopen.\n\nManufacturers are launching the #SafelyMakingCA Marketplace, allowing CA's businesses to get the protective gear they need. http:// safelymakingca.org  #camfg Safely Making California | A CMTA Initiative Together with the State of California, the California Manufacturers & Technology Association is launching the Safely Making California Marketplace to help pave the way for the state's safe reopening. safelymakingca.org", "2020-06-26T20:00:01.000Z": "Don't be selfish. Wear a mask.", "2020-06-26T19:40:31.000Z": "NEW: Yesterday CA conducted over 76k #COVID19 tests.\n\nPositivity rate: 5.7% over 7 days.\n\nThat rate in Imperial County, however, is at 23%. Hospitals there are overwhelmed.\n\nSo today we're working with the county to reinstate a stay at home order.\n\nWe have to take this seriously.", "2020-06-26T19:06:11.000Z": "TUNE IN NOW. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to the #COVID19 pandemic. https:// twitter.com/i/broadcasts/1 gqxvawomZQJB ", "2020-06-25T23:37:05.000Z": "California is now the first place in the world to mandate zero-emission trucks by 2045 - addressing air pollution in the state's most disadvantaged & polluted communities.\n\nRead Governor @GavinNewsom 's statement on the @AirResources Board vote today. #CalforniaForAll", "2020-06-25T21:04:31.000Z": "Listen to @SarahKSilverman -- but please DON'T lick people's teeth.\n\nPlease DO wear a mask. From Office of the Governor of California", "2020-06-25T20:08:37.000Z": "Dr. Fauci is right -- this isn't about politics. It's about SCIENCE.\n\nWearing a mask will help slow the spread of #COVID19 . Quote Tweet ABC7 Eyewitness News @ABC7 #CoronavirusPandemic : Dr. Fauci praises California, says mask wearing is \"purely a public health issue,\" not a political one https:// abc7.la/2Ntp29X", "2020-06-25T19:55:31.000Z": "NEW: California has made our #COVID19 modeling and data public for the first time so that scientists, researchers and anyone can help the state and the world through access to data.  http:// calcat.covid19.ca.gov  GIF", "2020-06-25T19:22:51.000Z": "Yesterday CA conducted over 100k #COVID19 tests.\n\nPositivity rate:\n- 5.1% over 14 days\n- 5.6% over 7 days\n\nYesterday we had a high of 7,149 new cases.\n\nToday, that dropped to 5,349--still higher than it should be.\n\nCA -- WEAR A MASK. Wash your hands. Practice physical distancing.", "2020-06-25T19:00:19.000Z": "Tune in now for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . https:// twitter.com/i/broadcasts/1 djGXojMMBRKZ ", "2020-06-25T16:45:40.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to #COVID19 . \n\nWatch live @ 12 PM.\nYouTube: https:// youtu.be/HnPlVcDwRlY Facebook: https:// bit.ly/CACOVID625 Twitter: @CAgovernor", "2020-06-25T17:06:43.000Z": "Your actions can literally save lives. Wear your mask.", "2020-06-24T23:39:29.000Z": "#COVID19 has not gone away. Do your part to slow the spread. Wear a mask.", "2020-06-24T18:32:35.000Z": "Wear your mask. \n\nThis isn't about politics. It's about SCIENCE. \n\nProtect others. Protect yourself. Help slow the spread of #COVID19 .", "2020-06-24T18:19:29.000Z": "In the last 14 days, CA has conducted 1,052,101 tests with a #COVID19 positivity rate of 5.1%.\n\nThis is an increase that we are tracking very closely.\n\nCalifornians need to remain vigilant and act responsibly.\n\nWear a face covering. Wash your hands. Practice physical distancing.", "2020-06-24T17:57:12.000Z": "Did you feel it? 6.0 magnitude registered in central part of the state. Remember to Drop, Cover & Hold On when the ground shakes. http:// earthquake.ca.gov", "2020-06-24T18:01:38.000Z": "Tune in now. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to the #COVID19 pandemic. https:// twitter.com/i/broadcasts/1 BRKjYDjeQBxw ", "2020-06-24T17:00:14.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to the #COVID19 pandemic. \n\nWatch live @ 11 AM.\nYouTube: https:// youtu.be/80CXdR4yLSE Facebook: https:// bit.ly/CACOVID624 Twitter: @CAgovernor", "2020-06-23T21:42:19.000Z": "List of things you should do today:\n- wear a mask\n- wash your hands\n- practice physical distancing\n\nYour actions can literally save lives.", "2020-06-23T19:39:41.000Z": "#COVID19 can spread up to 26 feet if you sneeze.\n\n6 feet if you cough.\n\n4.5 feet if you exhale.\n\nPlease. WEAR YOUR MASK. #YourActionsSaveLives", "2020-06-23T16:41:06.000Z": "DAILY REMINDER: WEAR YOUR MASK.", "2020-06-22T19:54:24.000Z": "#COVID19 can spread up to 26 feet through droplets!\n\nEven if you are not showing symptoms, you could be unknowingly spreading the virus. \n\nWear a face covering and maintain distance to significantly #SlowTheSpread and keep your community healthy!  #YourActionsSaveLives", "2020-06-22T13:07:15.000Z": "Wearing a mask protects the people around you. It isn't political. It isn't weak. It's the right thing to do. It lets us get back to work. Do it. #YourActionsSaveLives From attn", "2020-06-22T19:47:28.000Z": "Tune in now for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . https:// twitter.com/i/broadcasts/1 vOGwkLjvYDGB ", "2020-06-22T16:21:40.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to #COVID19 . Watch live at 12:00 PM.\nYouTube: https:// youtu.be/4o8ZB_sybQ0 Facebook: https:// bit.ly/FBCOVID622 Twitter: @CAgovernor", "2020-06-22T13:35:51.000Z": "Wear your mask.\n\nHelp slow the spread of #COVID19 . \n\nJust do it. From attn", "2020-06-21T21:14:20.000Z": "Quote Tweet Jennifer Siebel Newsom @JenSiebelNewsom Happy #FathersDay  @GavinNewsom ! I am so grateful that our children have you to look up to! Your empathy & kindness shows through in all you do. I know that when the kids look back on these years & the sacrifices that you made, they will be so proud of their dad. Love you so much!", "2020-06-20T15:58:12.000Z": "Do your part. Slow the spread. Wear a mask. From Office of the Governor of California", "2020-06-20T14:29:13.000Z": "CA Capitol last night -- lit up in honor of #Juneteenth . Quote Tweet Office of the Governor of California @CAgovernor This #Juneteenth the CA State Capitol is lit in the pan-African colors of red, black & green, which represent the African diaspora to enslavement in the New World; as those of us who work in the building continue to advance policies that promote equity & right historic wrongs.", "2020-06-19T22:21:37.000Z": "Say it with me now...\n\nNo one. Should. Have to. Risk. Their health. To exercise. Their right. To VOTE. Gov. Gavin Newsom signs bill sending mail ballot to every active California voter California is likely to take the unprecedented step of mailing a ballot to every active registered voter this fall after lawmakers approved a bill Thursday intended to protect the November election... sfchronicle.com", "2020-06-19T16:51:15.000Z": "Juneteenth has never been a celebration of victory, or an acceptance of the way things are. It's a celebration of progress. It's an affirmation that despite the most painful parts of our history, change is possible--and there is still so much work to do. Opinion | Why Juneteenth Matters It was black Americans who delivered on Lincoln's promise of \"a new birth of freedom.\" nytimes.com", "2020-06-19T20:25:30.000Z": "Happy birthday to the love of my life!! @JenSiebelNewsom , your grace, compassion, and strength never cease to amaze me. Montana, Hunter, Brooklynn, Dutch and I are so incredibly lucky.", "2020-06-19T19:46:45.000Z": "Tonight, CA's Capitol will be lit up to honor #Juneteenth and remind us all that 155 years later, Black Americans still feel the impacts of government-sponsored racism.\n\nWe cannot shy away from our past, but we can choose to create a brighter future-built on equality and justice. Quote Tweet Office of the Governor of California @CAgovernor This year, #Juneteenth celebrations take place as calls for justice fuel important reforms toward building a more perfect union - where liberty and justice are indeed \"for all.\"\n\nRead Governor @GavinNewsom 's Juneteenth proclamation: https:// bit.ly/JuneteenthCA", "2020-06-19T18:42:53.000Z": "As we celebrate #Juneteenth , let us commit to a new path forward where we don't shy away from our history, but seek to rectify our wrongs with empathy and restorative justice. \n\nTogether, let's reflect on on what this day means, and how we can ALL help create a #CaliforniaForAll . Quote Tweet Office of the Governor of California @CAgovernor This year, #Juneteenth celebrations take place as calls for justice fuel important reforms toward building a more perfect union - where liberty and justice are indeed \"for all.\"\n\nRead Governor @GavinNewsom 's Juneteenth proclamation: https:// bit.ly/JuneteenthCA", "2020-06-19T18:15:13.000Z": "This year, #Juneteenth celebrations take place as calls for justice fuel important reforms toward building a more perfect union - where liberty and justice are indeed \"for all.\"\n\nRead Governor @GavinNewsom 's Juneteenth proclamation: https:// bit.ly/JuneteenthCA", "2020-06-19T17:30:01.000Z": "A day before Juneteenth, the City of Fresno officially made June 18th \"Black Lives Matter Day\" in the city - and hundreds came together to paint the street in front of City Hall. Hundreds paint \"Black Lives Matter\" on Central California street App description abc30.com", "2020-06-18T17:21:47.000Z": "\"Yes, how dare we try to allow people their fundamental and constitutional right to vote in a way that keeps them safe and healthy...\" - California Governor @GavinNewsom on the Trump administration's opposition to his executive order about voting by mail.", "2020-06-19T04:50:41.000Z": "Our history is filled violence and exploitation. We cannot undo those wrongs -- but we can acknowledge truth and begin to heal. 1 year ago, CA issued a formal apology to the Native American community. Now, we remove this statue. Let's continue that work. Christopher Columbus statue will be removed from California state house A statue of Christopher Columbus will be removed from California's state capitol in Sacramento, state lawmakers announced Tuesday. cnn.com", "2020-06-18T22:00:00.000Z": "Last June, Governor @GavinNewsom formally apologized to California Native Americans for the exploitation & violence inflicted upon them.\n\nOn the 1 year anniversary of this apology, the state recommits itself to recognizing & honoring California Native Americans. #CaliforniaForAll", "2020-06-18T23:09:36.000Z": "This is 100% the right move. This will help us beat this terrible virus. The science is unanimous - if we all wear masks, we slow down the spread and can reopen safely. It's not a political issue. Anyone making it a political issue is an absolute moron who can't read. Quote Tweet Gavin Newsom @GavinNewsom NEW: Californians are now REQUIRED to wear face coverings in public spaces.\n\nTogether -- we can slow the spread.\n\nDo your part. Wear a mask.\n\nLEARN MORE: http:// covid19.ca.gov", "2020-06-18T21:59:07.000Z": "Be smart. Wear a mask. From Office of the Governor of California", "2020-06-18T19:20:03.000Z": "NEW: Californians are now REQUIRED to wear face coverings in public spaces.\n\nTogether -- we can slow the spread.\n\nDo your part. Wear a mask.\n\nLEARN MORE: COVID19.CA.GOV Official website for California Coronavirus (COVID-19) Response daily updates and resources. Stay home - save lives. Find information and services to help you and help others. covid19.ca.gov", "2020-06-18T14:44:52.000Z": "HERE TO STAY.\n\nToday is a major victory and sigh of relief for Dreamers everywhere.\n\nNow -- the fight continues for true, comprehensive immigration reform. Quote Tweet NPR @NPR BREAKING: The Supreme Court has upheld DACA - handing a dramatic victory to immigration advocates and allowing the program that has permitted about 650,000 \"Dreamers\" to stay and work in the U.S. legally to continue. https:// trib.al/kz3AS0a", "2020-06-18T00:45:41.000Z": "California Governor @GavinNewsom joins @JKCorden on the #LateLateShow tonight!", "2020-06-17T21:14:51.000Z": "We're excited to join the @JenSiebelNewsom for #CASummerReading . Ready to start a good book? Quote Tweet Jennifer Siebel Newsom @JenSiebelNewsom Calling all California families!\n\nToday we launched the 5-week #CASummerReading challenge and we want YOU to participate. First-up: sign up online for your local library's summer program.\n\nTogether let's keep our kids reading and learning all summer long. @CAStateLibrary", "2020-06-17T21:10:16.000Z": "Calling all California families!\n\nToday we launched the 5-week #CASummerReading challenge and we want YOU to participate. First-up: sign up online for your local library's summer program.\n\nTogether let's keep our kids reading and learning all summer long. @CAStateLibrary", "2020-06-16T22:28:08.000Z": "This is the right move. Fort Bragg, named after a Confederate general, will consider changing its name The California city of Fort Bragg is considering changing its name in the wake of calls to remove Confederate monuments and statues across the United States, according to a post on the city's... sfgate.com", "2020-06-16T19:35:41.000Z": "Going to REPEAT, REPEAT, REPEAT: #COVID19 is still here.\n\nWear a face covering. Wash your hands. Practice physical distancing. Be smart.", "2020-06-16T17:34:32.000Z": "Smart. Gun. Laws. Save. Lives. Editorial: New reports confirm what should be obvious: Smart gun laws save lives A fresh round of studies affirms that smart laws restricting easy access to firearms results in fewer people getting shot to death. latimes.com", "2020-06-16T01:46:27.000Z": "An important step. This is nothing short of a tragedy -- Robert's family deserves a full and independent investigation. Quote Tweet CBS News @CBSNews California Attorney General Xavier Becerra says he's sending investigators to Palmdale, California to investigate the hanging death of 24-year-old Robert Fuller https:// cbsn.ws/37yxqya", "2020-06-15T19:42:22.000Z": "It's simple -- \n\nBe smart.\n\nWear a face covering. \n\nPhysically distance. \n\nWash your hands. #YourActionsSaveLives", "2020-06-15T19:36:41.000Z": "CA's #COVID19 hospitalization rate remains stable.", "2020-06-15T19:20:29.000Z": "CA's #COVID19 testing rate has increased.\n\nOur positivity rate has significantly dropped over time -- from 40.8% to 4.5% -- and has remained stable over the last two weeks.", "2020-06-15T19:01:54.000Z": "Tune in now for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to the #COVID19 pandemic. https:// twitter.com/i/broadcasts/1 eaKbzEDgYqKX ", "2020-06-15T16:45:58.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to the #COVID19 pandemic. Watch live @ 12 PM\nYouTube: https:// youtu.be/KhW_l5YliI4 Facebook: https:// bit.ly/CACOVID615 Twitter: @CAgovernor", "2020-06-15T14:56:47.000Z": "You should never have to fear losing your job simply because of who you are or who you love.\n\nTo see that righted today is an extraordinary thing. The fight for true equality continues. Civil Rights Law Protects Gay and Transgender Workers, Supreme Court Rules The court said the language of the Civil Rights Act of 1964, which prohibits sex discrimination, applies to discrimination based on sexual orientation and gender identity. nytimes.com", "2020-06-15T02:17:16.000Z": "#COVID19 has not gone away.\n\nWash your hands.\n\nPractice physical distancing.\n\nWear a face covering.\n\nDO YOUR PART.\n\nYour actions can literally save lives.", "2020-06-14T15:02:41.000Z": "REMINDER: Californians have access to FREE #COVID19 testing.\n \nType in your zip code and find a testing site in your area today. Testing and treatment How can I find a coronavirus testing location near me? Find a testing location Types of tests Two kinds of tests are available for COVID-19: Tests for current COVID-19 infection (also known as viral... covid19.ca.gov", "2020-06-14T00:34:31.000Z": "Maintaining 6 ft of distance from others, washing hands regularly, wearing face coverings & disinfecting frequently touched surfaces can help stop the spread of #COVID19 . #YourActionsSaveLives Get the latest info  http:// covid19.ca.gov", "2020-06-12T22:04:39.000Z": "During a GLOBAL PANDEMIC. Pride month. And the 4th anniversary of the Pulse Nightclub shooting. Quote Tweet NPR @NPR BREAKING: The Trump administration just finalized a rule that would remove nondiscrimination protections for LGBTQ people in health care and health insurance. Show this thread", "2020-06-12T19:38:48.000Z": "We all have one universal need and desire -- to love and to be loved. It was only 53 years ago that Mildred and Richard had to fight for that right.\n\nToday, we honor their courage and continue the fight for true equality and racial justice. #LovingDay", "2020-06-12T18:50:43.000Z": "This is HUGE!! And about time. #RepresentationMatters Quote Tweet New York Times Arts @nytimesarts Films will have to meet an inclusion standard to be eligible for the Oscars, the academy announces. The details are still being worked out. https:// nyti.ms/3hfDb8i", "2020-06-11T00:02:02.000Z": "\"This is the time for us to finally make a difference.\" - @KingJames  #VOTE LeBron James and Other Stars Form a Voting Rights Group \"This is the time for us to finally make a difference,\" the N.B.A. superstar said of the new group, which will aim to protect African-Americans' voting rights. nytimes.com", "2020-06-10T20:41:01.000Z": "Congrats, John!! Thanks for bringing so much joy to our office every day! Quote Tweet Office of the Governor of California @CAgovernor This week our very own John Masterson celebrates 13 years of service in the Governor's Office. \n\nCongratulations, John!", "2020-06-10T18:30:10.000Z": "James Baldwin's body of work continues to shape the activism of community leaders who are still fighting for racial and economic equality.\n \nDuring Pride Month, CA honors the legacy of James Baldwin that is guiding and shaping this moment. What to Stream: James Baldwin's Tour of Black San Francisco in \"Take This Hammer\" In Richard O. Moore's documentary, which was broadcast in 1964, Baldwin finds the city's young black people keenly aware of the discrimination, exclusion, and violence that they face. newyorker.com", "2020-06-10T16:39:49.000Z": "#COVID19 is still here. \n\nBe safe.\n\nBe smart.\n\nDo your part. Quote Tweet Office of the Governor of California @CAgovernor While counties across the state are gradually reopening businesses, it does not mean things are back to normal. #COVID19 is still here and still spreading.\n \nDo your part to keep yourself and your community healthy, California.", "2020-06-10T00:19:21.000Z": "Addressing systemic injustice and racism starts with listening and learning. \n\nToday, Governor @gavinnewsom met with Oakland community leaders to discuss the policing & criminal justice reforms CA is pursuing & the persistent inequities that impact CA. #CaliforniaForAll", "2020-06-09T21:43:20.000Z": "Everyone has the right to protest peacefully and safely -- without being intimidated. \n\nI don't want to see rubber bullets. Tear gas. We need a new statewide standard for use of force in protests. From Nick Cannon", "2020-06-09T01:22:23.000Z": "Tune in tomorrow morning to @Power106LA I will be on with @GavinNewsom at 10:40am PST or listen live at http:// power106.com/listenlive  #NickCannonRadio", "2020-06-08T20:48:00.000Z": "When used appropriately, contact tracing is an important tool to help slow the spread of #Covid19 .\n \nHowever, scammers are now using phony contact tracing to try to commit fraud.\n\nReal contact tracers will never ask for personal info like your Social Security # or financial info.", "2020-06-04T23:30:35.000Z": "Why is contract tracing so important? Director of @CAPublicHealth , Dr. Sonia Y. Angell explains. \n\nLearn more at http:// covid19.ca.gov  #YourActionsSaveLives", "2020-06-05T15:31:33.000Z": "\"The mother's pay gap is a result of a combination of factors, and each one is more insidious for women of color,\" writes @JenSiebelNewsom Why the Pay Gap for Working Moms Is a Race Issue Too Cycles repeat themselves unless checked, and systemic is, by definition, ingrained. time.com", "2020-06-07T00:23:00.000Z": "Working to chart the challenging path to recovery with @CAGovernor  @GavinNewsom in Leimert Park. @hotandcoolcafe  @ArtAndPractice  @HarunCafe  @CBVentures1 'Don't Say Something, Do Something': Gov. Newsom Meets With Community Members In South LA Amid... Gov. Gavin Newsom also called for comprehensive reform of law enforcement, mental health care, education and other essential sectors of public life and said he would reject President Donald Trump's... losangeles.cbslocal.com", "2020-06-06T23:27:08.000Z": "\"Let's come together, all of us, no matter the color of our skin, and stand together to make this a kind and safe place to live for everyone.\" From CNN", "2020-06-06T15:45:22.000Z": "#BlackLivesMatter .\n.\n.\nArtist: #bamr_theartist  : @GuysontheGrid", "2020-06-06T01:56:37.000Z": "An important step by Governor Newsom. And a big thanks to @DrShirleyWeber and @KevinMcCartyCA for their persistent leadership throughout the years in championing reforms on police accountability, which has made California a model for other states. Quote Tweet Gavin Newsom @GavinNewsom Protesters have the right to protest peacefully -- not be harassed. Not be shot at by rubber bullets or tear gas.\n\nToday I am calling for the creation of a new statewide standard for use of force in protests. Acts of violence against peaceful protestors will not be tolerated.", "2020-06-05T21:42:30.000Z": "Our justice system is not blind. It discriminates based on the color of your skin.\n\nWe've accepted that as normal. Normalcy created the conditions that led to this moment.\n\nIf you want to go back to normalcy-I'm not going there with you.\n\nWe deserve more. From Office of the Governor of California", "2020-06-05T20:09:53.000Z": "The carotid hold blocks the flow of blood to the brain. It's a dangerous tactic that should not be used by law enforcement. Washington Post: Breaking News, World, US, DC News & Analysis Breaking news and analysis on politics, business, world national news, entertainment more. In-depth DC, Virginia, Maryland news coverage including traffic, weather, crime, education, restaurant... washingtonpost.com", "2020-06-05T19:44:34.000Z": "Protesters have the right to protest peacefully -- not be harassed. Not be shot at by rubber bullets or tear gas.\n\nToday I am calling for the creation of a new statewide standard for use of force in protests. Acts of violence against peaceful protestors will not be tolerated.", "2020-06-05T19:07:40.000Z": "Tune in now. Quote Tweet Office of the Governor of California @CAgovernor LIVE: Governor Newsom holds a press conference following meetings throughout the state with community, faith and youth leaders, small business owners and elected officials this week on racism, systemic injustice and how we move forward as a state. https:// twitter.com/i/broadcasts/1 ypJdQqddjyxW ", "2020-06-05T16:14:02.000Z": ". @GavinNewsom issued an executive order to ensure access to safe in-person voting options ahead of November elections: Extends early voting to three days before election day Makes ballot drop-box locations available from October 6 to November 3 Every State, Every Vote: California Gov. Gavin Newsom Continues to Ensure Access to Fair and Secure... On Wednesday, Democratic California Gov. Gavin Newsom issued an executive order to ensure access to safe in-person voting options ahead of the upcoming November election. The measure instructs... democraticgovernors.org", "2020-06-04T18:56:56.000Z": "This year, #MomsEqualPay Day falls on June 4, marking the 156 extra days moms have to work to make what dads made last year. And no, this is not because of women's \"choices.\" It is a result of a combination of factors, and each one is more insidious for women of color. 1/5", "2020-06-04T18:30:15.000Z": "\"Stockton: Rise Up! Rise up, as one. As one, we rise.\"\n\nMeeting with @MichaelDTubbs and folks in the community about what this moment means. Nothing short of inspired -- by their actions, their hope, and their desire to create change, together.", "2020-06-04T18:25:14.000Z": "Visiting Stockton's Waterfront Warehouse, meeting with local small business owners to hear firsthand the challenges we are facing during these difficult times @GavinNewsom  #reinventStockton  #Stocktonstrong Quote Tweet Mike Luery @KCRALuery ... @GavinNewsom  arrives in Stockton with Mayor Tubbs to meet with businesses affected by Covid crisis.", "2020-06-04T17:14:34.000Z": "This #MomsEqualPay Day comes in the midst of unspeakable tragedy and turmoil in our country. And that is exactly why we must talk about it. \n\nWorking moms, but especially moms of color, need a new reality NOW.  \n\nMore of my thoughts via @TIME Why the Pay Gap for Working Moms Is a Race Issue Too Cycles repeat themselves unless checked, and systemic is, by definition, ingrained. time.com", "2020-06-04T02:26:36.000Z": "Did you feel that #California ? @Cal_OES and @MyShakeApp issued an alert for the recent earthquake near Searles Valley in #SanBernardino County. If you don't have the app, find out more here: https:// earthquake.ca.gov/mobile-applica tion/ ", "2020-06-04T04:09:53.000Z": "Thank you @GavinNewsom for visiting Assembly District 54 today. Pleased to be a part of this group and to experience your compassion and willingness to listen to our community. Quote Tweet Gavin Newsom @GavinNewsom You can't lead if you don't listen. Listen to the pain. Listen to the anger. Listen to the frustration.\n\nIn LA today -- meeting with leaders, talking about what has led to this moment, and packing up lunches for Californians impacted by #COVID19 .", "2020-06-03T22:56:44.000Z": "If institutions are to make the systemtic change needed, we must listen.\n\nToday Governor @GavinNewsom met with local leaders & visited small businesses in Leimert Park to hear directly from the community. #CaliforniaForAll", "2020-06-03T22:19:09.000Z": "You can't lead if you don't listen. Listen to the pain. Listen to the anger. Listen to the frustration.\n\nIn LA today -- meeting with leaders, talking about what has led to this moment, and packing up lunches for Californians impacted by #COVID19 .", "2020-06-03T20:05:18.000Z": ". @GavinNewsom is in South Los Angeles meeting with community members & local leaders about #GeorgeFloyd & #coronavirus . \n\nI told him about breaking news of new charges for officers. \n\n\"It's about time!\" \n\nInterview will be seen throughout the day on @FOXLA", "2020-06-03T19:55:02.000Z": "Working with Governor @GavinNewsom to chart the challenging path to recovery, as we pack meals for seniors and support local businesses and community orgs in Leimert Park. @hotandcoolcafe  @ArtAndPractice  @HarunCafe  @CBVentures1", "2020-06-03T17:46:30.000Z": "Visiting #LeimertPark  @hotandcoolcafe with @GavinNewsom  @mridleythomas discussing their meal programs. They offer meals three times a week-Mon, Wed & Fri. #COVID19  #BlackBusinessMatters", "2020-06-03T15:46:38.000Z": "Congratulations, @Ella4Ferguson ! Quote Tweet NPR @NPR Ella Jones made history on Tuesday by becoming the first black mayor of Ferguson, Mo.\n\nWhen asked what her historic victory means to her, she responded: \"That means I got work to do.\" https:// trib.al/bODk0BO", "2020-06-03T04:19:23.000Z": "Quote Tweet Axios @axios BREAKING: Rep. Steve King has been defeated in Iowa's Republican primary. https:// axios.com/steve-king-iow a-primary-0f573843-c5e3-4246-a92c-1c0ce72efcdf.html?utm_source=twitter&utm_medium=social&utm_campaign=organic&utm_content=1100 ", "2020-06-03T03:23:22.000Z": "If we're going to rise to this moment with the attention and action that it fully deserves, we better start listening. We better own up to our own responsibility that led to this moment. And we better start inviting change.", "2020-06-01T23:59:01.000Z": "\"Let's do this another way. Let's stop thinking our voice don't matter and vote. Not just for the president...educate yourself and know who you're voting for. And that's how we're going to hit 'em.\" Quote Tweet NBC News @NBCNews WATCH: Full speech by George Floyd's brother, Terrence Floyd, at site of George Floyd's death.", "2020-06-01T22:21:32.000Z": "A moment in prayer today.\n\nThis is a time of action.\n\nBut it's also a time to listen.", "2020-06-01T21:01:09.000Z": "The Black community is not responsible for what's happening in this country right now -- we are. Our institutions are. \n\nWe are accountable to this moment. People have lost patience -- I've lost patience -- because they haven't seen progress. From Office of the Governor of California", "2020-06-01T19:35:28.000Z": "Tune in now. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on demonstrations across the state and California's response to #COVID19 . https:// twitter.com/i/broadcasts/1 YqGoQooyqzxv ", "2020-06-01T18:53:02.000Z": "Today's press conference will begin closer to 12:30PM. \n\nWatch live Facebook: http:// bit.ly/CAupdate61 YouTube: http:// youtu.be/1z4HTQ49jWI Twitter: @CAgovernor Quote Tweet Office of the Governor of California @CAgovernor TOMORROW: Governor @GavinNewsom will provide an update on demonstrations across the state and CA's response to #COVID19 . \n\nWatch live at 12pm.", "2020-06-01T17:59:45.000Z": "Tune in today around 12pm. Quote Tweet Office of the Governor of California @CAgovernor TOMORROW: Governor @GavinNewsom will provide an update on demonstrations across the state and CA's response to #COVID19 . \n\nWatch live at 12pm.", "2020-06-01T14:15:57.000Z": "I wrote out some thoughts on how to make this moment a real turning point to bring about real change--and pulled together some resources to help young activists sustain the momentum by channeling their energy into concrete action. How to Make this Moment the Turning Point for Real Change As millions of people across the country take to the streets and raise their voices in response to the killing of George Floyd and the medium.com", "2020-05-30T00:10:56.000Z": "Before you say those things that you don't truly understand or think that thought you've been trained to think, listen to this and dig deeper. #13th  #JusticeForGeorge  https:// twitter.com/Nick_Talley/st atus/1266519939256594433/video/1 ", "2020-05-31T15:11:03.000Z": "Black communities have not received equal justice under law for centuries. Black blood has stained America's sidewalks. The pain is real. It's deep. It's legitimate. We must listen, acknowledge that, and take action to transform our communities.", "2020-05-31T18:25:38.000Z": "On this day in history (May 31): the Tulsa riot / massacre of 1921 Tulsa Race Massacre: In aftermath, no one prosecuted for killings, and insurance claims were... It isn't that Tulsa did nothing for the victims of the race massacre. It's that it didn't do as much as it could have or, in the opinion of many, tulsaworld.com", "2020-05-31T19:02:49.000Z": "\"We shouldn't have to feel like this.\"", "2020-05-30T21:54:29.000Z": "Powerful image of the protest in Santa Cruz this morning. Mayor Justin Cummings and Police Chief Andrew Mills took a knee in solidarity. ( : Shmuel Thaler.)", "2020-05-30T13:21:27.000Z": "Racism is not a difference of opinion.", "2020-05-31T05:29:09.000Z": "Governor Newsom has authorized assistance after a request from @LACity and @CountyofLA , and proclaimed a state of emergency in Los Angeles County. Governor Authorizes Assistance After Request from Los Angeles & Proclaims State of Emergency |... SACRAMENTO - Governor Gavin Newsom this evening authorized assistance after a request from the city and county of Los Angeles, and proclaimed a state of emergency in Los Angeles County. gov.ca.gov", "2020-05-30T23:48:42.000Z": "The racial inequities that exist in our society are evident all around us.\n\nJust look at #COVID19 .\n\nCommunities of color are overwhelmingly impacted.\n\nWe must continue to work toward a more just, equitable future.", "2020-05-30T21:55:37.000Z": "Millions of people are lifting their voices in anger -- rightfully outraged at the systemic racism that persists in America.\n\nOur state and nation must build from this moment -- united and more resolved than ever -- to address the reality of racism and its root causes.", "2020-05-30T03:10:51.000Z": "Governor Gavin Newsom issued an executive order extending authorization for local governments to halt evictions for renters impacted by the #COVID19 pandemic, through July 28. Governor Newsom Signs Executive Order on Actions in Response to COVID-19 5.29.20 | California... SACRAMENTO - Governor Gavin Newsom today issued an executive order extending authorization for local governments to halt evictions for renters impacted by the COVID-19 pandemic, through July 28. gov.ca.gov", "2020-05-29T23:26:30.000Z": "NEW: 1.8 million people have been tested in CA for #COVID19 .\n\nWe have seen an average of 4.1% positive tests over the last 2 weeks.", "2020-05-29T22:21:03.000Z": "When will it end?\n\nWe are faced with that question over and over again.\n\nThe structural racism in our society persists. Our incapacity to wake up to that reality continues.\n\nEvery. Single. Day. in America. #GeorgeFloyd From Office of the Governor of California", "2020-05-29T19:09:19.000Z": "Tune in now. Quote Tweet Office of the Governor of California @CAgovernor Governor @GavinNewsom provides an update on the state's response to the #COVID19 pandemic. https:// twitter.com/i/broadcasts/1 OwxWQXyRBkGQ ", "2020-05-29T16:04:44.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to the #COVID19 pandemic. \n\nWatch live at 12:00 pm.\nYouTube: https:// youtu.be/jtJcXC_jQik Facebook: https:// bit.ly/FBcovid529 Twitter: @CAgovernor", "2020-05-28T22:00:00.000Z": "With schools closed due to #COVID19 , families who are eligible for free or reduced-price meals can get food benefits in addition to community \"grab-n-go\" meals! \n\nLearn more about Pandemic EBT or P-EBT: https:// ca.p-ebt.org/info", "2020-05-28T18:55:07.000Z": "Tune in! Quote Tweet The View @TheView TOMORROW: California Gov. @GavinNewsom joins us to discuss his state's handling of the pandemic and more.", "2020-05-28T00:02:48.000Z": "100,000.\n \n100,000 human beings - mothers, fathers, sisters, brothers, friends - in the United States that have died because of #COVID19 - over 3,800 human beings in California alone.\n\nWe still have a long way to go and, together, we can get through this. #YourActionsSaveLives", "2020-05-27T17:21:01.000Z": "Live now! Quote Tweet Office of the Governor of California @CAgovernor TUNE IN: Governor @GavinNewsom & members of his Task Force on Business & Jobs Recovery speak with Californians in the fitness industry about what recovery can look like in the wake of #COVID19 . Watch live at 10:15 AM here: https:// youtube.com/watch?v=R-0cak x3Ni0 ", "2020-05-27T16:16:20.000Z": "TUNE IN: Governor @GavinNewsom & members of his Task Force on Business & Jobs Recovery speak with Californians in the fitness industry about what recovery can look like in the wake of #COVID19 . Watch live at 10:15 AM here: Economic Recovery Listening Tour: Fitness Governor Gavin Newsom & members of his Task Force on Business & Jobs Recovery speak with a Californians in the fitness industry about their experiences and i... youtube.com", "2020-05-26T23:37:50.000Z": "EXCLUSIVE: @SavannahGuthrie sits down with Gov. of California @GavinNewsom to discuss new guidelines taking effect in the state as it slowly reopens. \n\nTune in tomorrow -- only on @TODAYshow", "2020-05-26T19:33:05.000Z": "Scenes from this weekend: \n\nPraying I don't end up looking like Gov. Exotic", "2020-05-26T19:29:43.000Z": "NEW: Starting today, many counties across California can choose to reopen hair salons and barbershops -- with serious modifications in place.\n\nLEARN MORE HERE: County variance info County data monitoring California is monitoring COVID-19 closely in each local community and keeping the public informed. We're teaming up with counties to fight it with every tool we have: current... covid19.ca.gov", "2020-05-26T19:21:57.000Z": "CA #COVID19 UPDATE:\n\nOver the last 14 days, CA has seen:\n- 6.7% decline in hospitalizations.\n- 0.6% increase in the number of ICU patients.\n\nCA is flattening the curve. Expanding testing. And carefully re-opening businesses. But we MUST continue to take this seriously.", "2020-05-26T19:01:06.000Z": "TUNE IN for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on California's response to the #COVID19 pandemic. #YourActionsSaveLives  https:// twitter.com/i/broadcasts/1 DXxyedrRWZxM ", "2020-05-26T18:55:12.000Z": "Tune in at 12pm for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE AT 12:00PM: Governor @GavinNewsom will provide an update on California's response to #COVID19 . Tune in \nYouTube: https:// youtu.be/yVch-nIQ4A0 Facebook: https:// bit.ly/CAcovid526 Twitter: @CAgovernor", "2020-05-25T21:58:19.000Z": "NEW: Counties can now begin re-opening houses of worship and in-store shopping for retail.\n\nCA has continued to flatten the curve because folks are staying home, practicing physical distancing, and taking this seriously.\n\nLet's keep it up.\n\nLEARN MORE: Resilience Roadmap State of California's roadmap to reopening businesses safely. The current phase is Stage 2. Guidance for adapting workplaces to prevent COVID-19 / coronavirus infection. covid19.ca.gov", "2020-05-25T14:50:05.000Z": "Today we honor and remember those who made the ultimate sacrifice in the name of service to our country.\n\nMay your courage and patriotism inspire us every day. #MemorialDay2020", "2020-05-24T19:31:35.000Z": "It's a 3 day weekend.\n\nIt's nice outside.\n\nThat doesn't mean #COVID19 has gone away.\n\nWash your hands.\n\nStay 6 feet apart.\n\nWear a face covering.\n\nBe smart.\n\nYour actions can literally save lives.", "2020-05-24T19:25:27.000Z": "Testing and treatment How can I find a coronavirus testing location near me? Find a testing location Types of tests Two kinds of tests are available for COVID-19: Tests for current COVID-19 infection (also known as viral... covid19.ca.gov", "2020-05-24T15:24:24.000Z": "REMINDER: you can get tested for #COVID19 for FREE.\n\nFind a testing site near you by simply typing in your zip code   http:// covid19.ca.gov/testing-and-tr  Quote Tweet Office of the Governor of California @CAgovernor Did you know Californians have access to free #COVID19 testing? \n\nFind a testing site near you: http:// covid19.ca.gov/testing-and-tr eatment ", "2020-05-24T00:28:41.000Z": "They were not simply names on a list.\n\nThey were us.", "2020-05-23T15:06:05.000Z": "As we head into the 3 day weekend --\n\nIt's unbelievably important that we act in a safe and responsible way.\n\nBE SMART. \n\nWash your hands.\n\nPractice physical distancing.\n\nStay local. #COVID19 has not gone away. Your actions could literally save lives.", "2020-05-23T14:48:05.000Z": "Grateful for the firefighters and first responders on the scene. Stay safe, San Francisco. Quote Tweet CNN @CNN San Francisco firefighters are battling a four-alarm warehouse fire on Pier 45, the city's fire department says. https:// cnn.it/2ZwrEek", "2020-05-23T02:38:04.000Z": "Towards the end of Ramadan and start of Eid-al-Fitr, grateful for the Muslim community across California celebrating the holiest time of the year safely -- staying healthy and slowing the spread of #COVID19 .", "2020-05-22T20:30:00.000Z": "Harvey Milk embodies San Francisco's celebration of diversity and inclusion.\n\nGovernor @GavinNewsom joins California in celebrating #HarveyMilkDay and honoring the life and legacy of a true civil rights hero. #CaliforniaForAll", "2020-05-22T23:51:37.000Z": "As Ramadan comes to an end, mosques across California are forgoing their largest gathering of the year, during the holiest time of the year, to slow the spread of #COVID19 . Thank you! \n \nCA thrives because of self-less actions.", "2020-05-22T19:06:39.000Z": "TUNE IN NOW. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . https:// twitter.com/i/broadcasts/1 MnxnQMaoYkJO ", "2020-05-22T14:29:49.000Z": "38 million Americans are out of a job.\n\nAmerica is experiencing depression era unemployment.\n\nThis isn't a red or blue state issue.\n\nThe federal government has a moral & ethical obligation to provide aid states & cities need to recover from this pandemic. From PBS NewsHour", "2020-05-21T22:06:36.000Z": "The Santa Susana toxic site should have been cleaned up long ago. Grateful for the partnership of @ENERGY - moving this project forward and helping ensure all those in the area are healthy and safe. U.S., California Strike Deal to Clean Up Nuclear Site Near L.A. The Trump administration announced a deal with California to jump start the cleanup of a Cold War-era nuclear test site northwest of Los Angeles that has become the focus of celebrity activists. wsj.com", "2020-05-20T23:10:28.000Z": "Great to join @Ava , @Netflix 's Ted Sarandos, @Jon_Huertas, and more today to talk about how the film and TV industries in CA have been impacted by #COVID19 -- and what a re-opening of the workplace could look like.", "2020-05-20T21:49:25.000Z": "LIVE NOW: Governor @GavinNewsom joins @Ava  @Netflix 's Ted Sarandos, @Jon_Huertas & more to talk about how the film & TV industries are dealing with #COVID19 . Economic Recovery Listening Tour: Entertainment Industry Governor Gavin Newsom continues the Economic Recovery & Reinvention Listening Tour with members of California's Task Force on Business & Jobs Recovery. This ... youtube.com", "2020-05-20T21:44:15.000Z": "Tune in! Quote Tweet Office of the Governor of California @CAgovernor TODAY: Governor @GavinNewsom will host a virtual roundtable with Californians who work in the film and television industry for his Economic Recovery & Reinvention Listening Tour. Watch live @ 2:45 PM. https:// youtu.be/3sMbh6kR6NM", "2020-05-20T17:20:57.000Z": "TODAY: Governor @GavinNewsom will host a virtual roundtable with Californians who work in the film and television industry for his Economic Recovery & Reinvention Listening Tour. Watch live @ 2:45 PM. Economic Recovery Listening Tour: Entertainment Industry Governor Gavin Newsom continues the Economic Recovery & Reinvention Listening Tour with members of California's Task Force on Business & Jobs Recovery. This ... youtube.com", "2020-05-19T20:46:18.000Z": "NEW: CA has 81,795 confirmed cases of #COVID19 :\n+1.7% from yesterday.\n\n3,073 of those are in hospitals:\n+1.2%.\n\n1,076 of those are in the ICU:\n+0.0%.", "2020-05-19T15:01:20.000Z": "Top execs from Netflix, Disney, Salesforce and more call on Congress to provide $1 trillion in coronavirus relief to local governments Top execs from Netflix, Disney, Salesforce and more call on Congress to provide $1 trillion in... The House of Representatives passed a bill that includes $1 trillion for local governments, but the Senate is not expected to approve it. cnbc.com", "2020-05-19T17:43:56.000Z": "When #COVID19 hit--Californians came together and met the moment. \n\nWe stayed home. Worked hard to keep each other safe.\n\nNow, we're starting to re-open our communities. But the fight against COVID-19 isn't over.\n\nLet's stay the course and stop the spread. From Office of the Governor of California", "2020-05-19T00:20:53.000Z": "Great to join you all! Quote Tweet Rob Bonta @RobBontaCA Met Gov @GavinNewsom today with the @APILegCaucus to uplift the urgent concerns of our #API communities. With #COVID19 our communities are suffering from anti-Asian hate & facing language/resource barriers & are in need of policy solutions I know we can work together to provide!", "2020-05-18T21:25:54.000Z": "This year's graduates embody the passion and determination of the California spirit.\n\nCongrats to the class of 2020! Trailblazers In Their Families, Now They're Forging A Path Through A Pandemic Graduation The coronavirus is robbing students of the opportunity to celebrate their high school graduations. patch.com", "2020-05-18T22:35:00.000Z": ". @GavinNewsom on the moral imperative to send aid to the states: \"The next time they want to salute and celebrate our heroes, our first responders, our police officers and firefighters, consider the fact that they are the first ones that will be laid off by cities and counties.\"", "2020-05-18T19:54:21.000Z": "CA is allowing more counties to accelerate their re-opening process.\n\nThis will be based on each county's ability to increase testing, work with nursing homes, and stabilize their hospitalization and case rates.\n\nLEARN MORE: County variance info County data monitoring California is monitoring COVID-19 closely in each local community and keeping the public informed. We're teaming up with counties to fight it with every tool we have: current... covid19.ca.gov", "2020-05-18T19:18:27.000Z": "NEW: Over the last 14 days, CA has seen:\n- 7.5% decline in hospitalizations.\n- 8.7% decline in the number of ICU patients statewide.", "2020-05-18T19:01:35.000Z": "TUNE IN NOW for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . #YourActionsSaveLives  https:// twitter.com/i/broadcasts/1 MnGnQpeYMBKO ", "2020-05-18T16:49:09.000Z": "Tune in. Quote Tweet Office of the Governor of California @CAgovernor TODAY: Governor @GavinNewsom will provide an update on the state's response to #COVID19 .\n\nWatch live on Twitter and Facebook @ 12 PM. #YourActionsSaveLives", "2020-05-17T18:09:41.000Z": "States across our country are experiencing massive deficits due to #COVID19 .\n\nThis isn't a red or blue issue.\n\nWe cannot do this alone.\n\nThe federal govt has a moral and ethical obligation to support states so we can support our heroes on the frontlines. From State of the Union", "2020-05-17T15:00:26.000Z": "Practicing physical distancing protects our first-responders, essential workers and our #COVID19 vulnerable neighbors.\n \nLet's do our part to keep each other safe by keeping our distance. #YourActionsSaveLives  http:// covid19.ca.gov", "2020-05-17T02:55:34.000Z": "Grateful for the brave firefighters and first responders on the scene battling these flames tonight. Quote Tweet KTLA @KTLA BREAKING: 10 firefighters were injured and multiple buildings were set ablaze after an explosion in downtown Los Angeles, officials say https:// ktla.com/news/local-new s/10-firefighters-injured-multiple-buildings-on-fire-after-explosion-in-downtown-l-a/  Show this thread", "2020-05-16T19:19:33.000Z": "To California's college graduates:\n\nA huge CONGRATULATIONS to the class of 2020! @JenSiebelNewsom and I know this isn't *quite* what you imagined for this major milestone -- but that doesn't change its importance.\n\nWe can't wait to see what you do next. From Office of the Governor of California", "2020-05-16T02:15:35.000Z": "A global health crisis has led to a global economic crisis. The magnitude of what we're facing requires a response only the Federal Govt can provide.\n\nThe Senate must put partisanship aside and provide the relief we need to protect our healthcare workers, teachers & firefighters. Quote Tweet USA TODAY @USATODAY Democratic-led House passes $3 trillion coronavirus stimulus package with more $1,200 payments, plan faces pushback in GOP-majority Senate https:// usatoday.com/story/news/pol itics/2020/05/15/coronavirus-stimulus-bill-houses-3-trillion-bill-opposed-gop/5195061002/ ", "2020-05-15T18:22:22.000Z": "We're facing a recession worse than the Great Recession.\n\n36 million Americans have lost their jobs.\n\nStates simply cannot recover from this alone.\n\nCongress must pass the #HeroesAct and provide states and cities the relief they need. From Nancy Pelosi", "2020-05-14T19:46:23.000Z": "Californians have come together and met the moment. Serving on the frontlines. Staying home.\n\nWe've had each other's backs.\n\nNow the federal government should have ours.\n\nCA, OR, WA, NV, and CO have asked for $1 trillion to protect our public schools, health, and safety programs.", "2020-05-14T19:46:22.000Z": "A global health crisis has triggered a global financial crisis.\n\nThe U.S. GDP is projected to decrease by 26.5% this quarter. Job loss is at an all time high. We're facing a recession worse than the Great Recession.", "2020-05-14T19:01:31.000Z": "TUNE IN NOW. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom releases his revised 2020-21 state budget proposal. https:// twitter.com/i/broadcasts/1 mnGeQdopAEGX ", "2020-05-13T23:51:16.000Z": "As we continue our fight against #COVID19 , we must also continue to prepare for and fight wildfires across CA.\n\nWe simply can't pull back on priorities that keep us safe. Quote Tweet Los Angeles Times @latimes Gov. Gavin Newsom said on Wednesday that California's response to the COVID-19 pandemic has not blunted efforts to prepare for what is expected to be an active wildfire season.", "2020-05-13T22:30:07.000Z": "California has conducted over 1 million #COVID19 diagnostic tests.\n\nThe state will continue to ramp up its testing capacity in order to keep Californians healthy and to stop the spread of #COVID19 . More than 1 million California residents tested for COVID-19; efforts to increase testing capacity... More than 1 million residents statewide have been tested for the coronavirus, Gov. Gavin Newsom said Tuesday, but the efforts to increase testing capacity continue. Over the past few days an averag ktla.com", "2020-05-13T19:26:16.000Z": "From January to May 10 last year we had 675 wildfires.\n\nFrom January to May 10 this year we've had 1,130 wildfires.\n\nA 60% increase.\n\nAs we continue to fight #COVID19 we can't pull back on priorities that keep us safe. We will continue invest, prepare & fight wildfires across CA.", "2020-05-13T19:04:43.000Z": "TUNE IN NOW. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's wildfire preparedness amid #COVID19 . https:// twitter.com/i/broadcasts/1 yNGaQYnZRrGj ", "2020-05-13T16:38:40.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's wildfire preparedness amid #COVID19 .\n\nWatch live on Twitter and Facebook @ 12 PM.", "2020-05-12T19:36:50.000Z": "New guidance can be found here: COVID19.CA.GOV Official website for California Coronavirus (COVID-19) Response daily updates and resources. Stay home - save lives. Find information and services to help you and help others. covid19.ca.gov", "2020-05-12T19:36:26.000Z": "NEW: CA has released guidance for the re-opening of more industries such as:\n\n-Offices (that cannot telework)\n-Malls and strip malls (for curbside / outdoor pickup)\n-Outdoor museums.\n\nCA is flattening the curve but we MUST continue to allow science and public health to guide us.", "2020-05-12T19:17:00.000Z": "NEW: CA has conducted over 1,000,000 #COVID19 tests.\n\nThis is an important milestone but we still have work to do. We must continue to ensure everyone has access to COVID-19 testing --  regardless of their zip code.", "2020-05-12T19:00:55.000Z": "TUNE IN NOW for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . https:// twitter.com/i/broadcasts/1 BRKjQnOlnexw ", "2020-05-12T16:36:19.000Z": "TUNE IN: Governor @GavinNewsom will provide an update on the state's response to #COVID19 .\n\nWatch live on Twitter and Facebook @ 12 PM.", "2020-05-11T23:00:12.000Z": ". @mycalVet 's Dr. Vito Imbasciani is dedicated to serving veterans and working to prevent the spread of #COVID19 in veterans homes. #CaliforniaForAll Meet the 73-year-old surgeon working to keep California veterans safe from COVID-19 Even as COVID-19 has ravaged nursing homes around the country, California has managed to keep the virus at bay at its eight state-run homes for frail and older veterans. What exactly went right? latimes.com", "2020-05-11T19:25:51.000Z": "NEW: Without federal support, states will be forced to make impossible decisions.\n\nToday-CA, OR, WA, NV, CO, and our legislative leaders have joined together to ask the federal government for $1 trillion to protect our schools, public health, and public safety services.", "2020-05-11T19:00:59.000Z": "TUNE IN NOW for a #COVID19 update. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . https:// twitter.com/i/broadcasts/1 MYGNkmwDzVJw ", "2020-05-11T16:12:31.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to #COVID19 .\n\nWatch live on Twitter and Facebook @ 12 PM.", "2020-05-10T17:55:52.000Z": "The love of my life. The mom that does it all. Thank you for teaching our kids to lead with empathy and compassion.\n\nHappy Mother's Day to @JenSiebelNewsom -and all the amazing moms out there. You're the glue that keeps so many of us together during this crazy time.\n\nWe love you!!", "2020-05-09T15:30:00.000Z": "CA is moving into stage 2 of modifying the stay-at-home order, but #COVID19 is still spreading.  \n   \nMaintaining 6 ft of distance from others, washing hands regularly and staying home is still the best way to stop the spread. #YourActionsSaveLives  http:// covid19.ca.gov", "2020-05-08T22:01:17.000Z": "CA is now a vote by mail state.\n\nEvery registered voter will receive a mail-in ballot for the Nov election.\n\nWe'll also provide safe in-person voting options.\n\nThe right to vote is foundational to our democracy. No one should be forced to risk their health to exercise that right.", "2020-05-08T19:06:17.000Z": "TUNE IN NOW. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . https:// twitter.com/i/broadcasts/1 rmGPAzwYmmJN ", "2020-05-08T17:28:15.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to #COVID19 .\n\nWatch live on Twitter and Facebook @ 12 PM.", "2020-05-07T21:27:57.000Z": "UPDATE! Now 18 food trucks and rest stops around the state!\n\nSee a list of the locations here: https:// dot.ca.gov/programs/traff ic-operations/food-trucks-rest-areas/srras-food-trucks-list  CC: @CAgovernor  @GavinNewsom  @CA_Trans_Agency  @CAGoBiz  @Caltrux  #CaliforniaForAll Quote Tweet Caltrans HQ @CaltransHQ UPDATE! There are now a total of 15 food trucks serving meals at rest stops around the state. We hope this helps those who must be out on the road!\n \nSee a list of the locations here: https:// dot.ca.gov/programs/traff ic-operations/food-trucks-rest-areas/srras-food-trucks-list  CC: @CAGovernor  @GavinNewsom  @CA_Trans_Agency  #CaliforniaForAll (1/3) Show this thread GIF", "2020-05-07T19:42:35.000Z": "NEW: Today CA released guidance for some lower risk industries to begin re-opening.\n\nStarting TOMORROW places like:\n-clothing stores\n-bookstores\n-florists\n-sporting goods\n\nAlong with manufacturing and logistics associated can start to re-open.\n\nLEARN MORE: http:// covid19.ca.gov", "2020-05-07T18:59:59.000Z": "Tune in now: Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . https:// twitter.com/i/broadcasts/1 vAxRBrQBqqxl ", "2020-05-07T16:17:26.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to #COVID19 .\n\nWatch live on Twitter and Facebook @ 12 PM.", "2020-05-07T00:20:26.000Z": "Nurses' contributions are invaluable in the fight against #COVID19 ! On #NationalNursesDay , California celebrates nurses across the state and their dedication to protecting public health during this crisis.", "2020-05-06T22:06:35.000Z": "NEW: CA has 58,815 confirmed cases of #COVID19 :\n+ 4.6% from yesterday.\n\n3,334 of those are in hospitals:\n-1.0%.\n\n1,140 of those are in the ICU:\n-1.5%.\n\nCA: we are flattening the curve -- but we must continue to take this seriously.\n\nYour actions can save lives.", "2020-05-06T22:00:44.000Z": "California's small businesses, like Display:California, are the backbone of the state's economy. \n\nYesterday Governor @GavinNewsom met with Roshaun and Maritza to discuss how they envision their business operating once California moves into stage 2.", "2020-05-06T19:51:22.000Z": "To our front line workers who test positive for #COVID19 : we have your back.\n\nCA is now streamlining the process and making it easier for you to qualify for workers' compensation benefits -- retroactive from March 19th and through the next 60 days.", "2020-05-06T19:19:50.000Z": "Governor Newsom's order today adds a vital layer of protection to essential workers putting their lives at risk to provide for our families during the #coronavirus pandemic. Our statement here: https:// calaborfed.org/press-releases /california-labor-federation-applauds-gov-newsoms-workers-compensation-executive-order/   #EssentialWorkers  #ProtectAllWorkers  #1u  @CAgovernor", "2020-05-06T19:16:47.000Z": "NEW: CA has launched a new site that will allow you to find a #COVID19 test near you. http:// Covid19.ca.gov will allow you to search by your zip code and find testing sites statewide where you can book an appointment. COVID19.CA.GOV Official website for California Coronavirus (COVID-19) Response daily updates and resources. Stay home - save lives. Find information and services to help you and help others. covid19.ca.gov", "2020-05-06T19:00:42.000Z": "TUNE IN NOW. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . https:// twitter.com/i/broadcasts/1 nAKEdAdAdgxL ", "2020-05-06T15:34:57.000Z": "This pandemic exposed how critical it is that our policies support women, and how vulnerable ALL of us are when they don't. \n\nThat's why we must center women in our economic recovery. Read on to learn more from me and @womenswealthgap via @CNN . Opinion: Our economic recovery depends on policies that benefit women Our public policies and private sector practices are rarely designed to support the dual roles of women, leaving us all vulnerable as a result, write Jennifer Siebel Newsom, the First Partner of... cnn.com", "2020-05-06T16:58:42.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to #COVID19 . \n\nWatch live on Twitter and Facebook at 12 PM PT.", "2020-05-05T19:34:44.000Z": "NEW: CA has 56,212 confirmed cases of #COVID19 :\n+2.3% from yesterday.\n\n3,369 of those are in hospitals:\n+2.6%.\n\n1,157 of those are in the ICU:\n-1.9%.\n\nCA: you are flattening the curve -- but we must continue to take this seriously and allow our reopening to be guided by science.", "2020-05-05T19:04:55.000Z": "TUNE IN NOW. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 & meets with a small business owner in Sacramento to discuss how businesses are adapting to reopen. https:// twitter.com/i/broadcasts/1 MYxNkVAAvzKw ", "2020-05-05T17:32:10.000Z": "Starting FRIDAY lower risk workplaces in Stage 2 such as:\n- bookstores\n- clothing stores\n- florists\n- sporting goods\n\nCan begin to re-open with modifications and adaptations like curbside pickup. From Office of the Governor of California", "2020-05-05T16:50:25.000Z": "TODAY: Governor @GavinNewsom will meet with a small business owner in Sacramento to discuss how businesses are adapting to reopen while continuing to preserve public health.\n\nWatch live on Twitter and Facebook @ 12 PM.", "2020-05-05T17:19:11.000Z": "Quote Tweet California Department of Aging @CalAging Sheltering in place doesn't mean you're sitting on the sidelines! Meet Anita who has been sewing beautiful face masks for those in need! #MakeYourMark  #OCM2020  #DejeSuHuella", "2020-05-05T00:31:52.000Z": "We have signed a contract with a hotel in Downtown L.A. to deliver more than 460 new rooms for Project Roomkey, bringing our total to more than 3,000 hotel/motel rooms across the county. This is a major milestone in our efforts. Every room can help save a life.", "2020-05-04T21:14:24.000Z": "US House candidate, CA-33 Being in lockdown until we find a cure is not sustainable. At the same time, allowing large numbers of deaths from a lethal virus is also not sustainable. Glad to see Governor @GavinNewsom taking a data driven, measured approach to reopening safely. Quote Tweet Los Angeles Times @latimes Breaking: California Gov. Gavin Newsom says reopening California will begin this week https:// latimes.com/california/sto ry/2020-05-04/california-reopening-coronavirus-gavin-newsom-phases-begin-retail-pickup ", "2020-05-04T22:02:36.000Z": "California is thankful to the men and women in uniform who have assisted in protecting our communities from wildfires and other emergencies. On #InternationalFirefightersDay and every day, we are grateful for their service. #CaliforniaForAll", "2020-05-04T22:04:20.000Z": "NEW: CA has 54,937 confirmed cases of #COVID19 :\n+2.5% from yesterday.\n\n3,284 of those are in hospitals:\n-1.0%.\n\n1,179 of those are in the ICU:\n+0.9%.\n\nCA is flattening the curve--but we must continue to take this seriously and allow our reopening to be guided by data and science.", "2020-05-04T19:33:25.000Z": "What DOES this include? \nPlaces like:\n- clothing stores\n- florists\n- bookstores\n- sporting goods stores\n\nAll with curbside pick-up.\n\nWhat does this NOT include at this time?\nPlaces like:\n- Offices (can continue telework)\n- Restaurants (seated dining)\n- Shopping Malls", "2020-05-04T19:33:24.000Z": "CA is led by data and SCIENCE.\n\nBased off our progress, we'll begin to gradually move into Stage 2 this FRIDAY.\n\nSome sectors where there's a lower risk of transmission will be able to adapt & re-open with modifications.\n\nThis will include some retail and manufacturing/logistics.", "2020-05-04T19:04:23.000Z": "TUNE IN NOW. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on California's response to the #COVID19 outbreak. https:// twitter.com/i/broadcasts/1 vOxwokDMOgxB ", "2020-05-03T16:45:10.000Z": "#COVID19 doesn't take the weekend off. Stay 6 feet apart when out for essentials.\n\nLet's continue to flatten the curve, California! #StayHomeSaveLives", "2020-05-03T17:00:00.000Z": "Every voter in #CD25 (portions of LA & Ventura County) and #SD28 (Riverside County) will receive a vote-by-mail ballot for the May 12, 2020 Special General Elections. You don't have to worry about finding a stamp, return postage is covered. #VoteCalifornia  #CA25", "2020-05-01T19:26:37.000Z": "NEW: CA has 50,442 confirmed cases of #COVID19 :\n+3.1% from yesterday.\n\n3,428 of those are in hospitals:\n-2.0%.\n\n1,192 of those are in the ICU:\n+0.0%.\n\nWe've now tragically lost 2,073 people to #COVID19 in CA.\n \nRemember: Your actions impact the lives of others. #StayHomeSaveLives", "2020-05-01T19:03:48.000Z": "On International Workers Day, CA honors its essential workers & health care workers on the frontlines of #COVID19 , as well as those who are struggling.\n\nSince the start of this pandemic, CA has jumped into action to make sure its workers are taken care of at home and at work:", "2020-05-01T19:01:01.000Z": "TUNE IN NOW. Quote Tweet Office of the Governor of California @CAgovernor LIVE NOW: Governor @GavinNewsom provides an update on the state's response to #COVID19 . #StayHomeSaveLives  https:// twitter.com/i/broadcasts/1 OyJAYYdzjrJb ", "2020-05-01T16:15:10.000Z": "TODAY: Governor @GavinNewsom will provide an update on the state's response to #COVID19 .\n\nWatch live on Twitter and Facebook @ 12 PM. #StayHomeSaveLives", "2020-05-01T01:14:21.000Z": "Tune in! Quote Tweet Late Night with Seth Meyers @LateNightSeth Tonight, @SethMeyers chats with @CAGovernor Gavin Newsom and @unfoRETTAble ! Plus, #ACloserLook at the current state of the #Covid_19 pandemic.", "2020-04-30T16:30:00.000Z": "Tonight, @SethMeyers chats with @CAGovernor Gavin Newsom and @unfoRETTAble ! Plus, #ACloserLook at the current state of the #Covid_19 pandemic.", "2020-05-01T00:41:21.000Z": "NEW: CA will now allow adults to obtain marriage licenses via videoconferencing for the next 60 days."}