{"2020-07-30T11:04:54.000Z": "Making progress to modernize state government even during a pandemic.  Great partnership and many thanks to @ConnDAS  @CTDigitalS  @SOTSMerrill  @CTDECD  @CTDOL  @CTDRS  @CTDCP  @Advance_CT  @GovNedLamont Quote Tweet Stephen Singer @SteveSinger10 A new online tool has been launched to help Connecticut businesses navigate state's rules and paperwork https:// courant.com/business/hc-bi z-business-portal-20200729-qer4z4befrghfok2fpsiz3akni-story.html ", "2020-07-30T02:10:02.000Z": "The outcome of these bills will keep the cost of insulin down, reimagine healthcare through tele-health, ensure no one has to risk their health to vote and reinforce Connecticut as a leader when it comes to trust and transparency between police and our communities.", "2020-07-30T02:09:01.000Z": "We called the legislature into a special session to pass critical pieces of legislation and I salute legislative leadership for helping to make it happen.", "2020-07-29T23:44:12.000Z": "Oz Griebel's heart was with the State of Connecticut - he loved this state and the people who live in it, and he enthusiastically believed that its best days are ahead.", "2020-07-29T20:14:04.000Z": "Today's COVID-19 update in Connecticut: 12,367 tests were administered and 79 came back positive This is a 0.6% positivity rate 53 patients are hospitalized (a decrease of 1) There have been 2 COVID-related deaths\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-29T18:37:57.000Z": "Streamlining the interactions businesses have with state government is a priority. http:// Business.ct.gov will make it much easier to manage those interactions so that entrepreneurs can spend their time focusing on what they do best. Quote Tweet Stephen Singer @SteveSinger10 A new online tool has been launched to help Connecticut businesses navigate state's rules and paperwork https:// courant.com/business/hc-bi z-business-portal-20200729-qer4z4befrghfok2fpsiz3akni-story.html ", "2020-07-29T18:26:42.000Z": "Today we're launching http:// business.ct.gov - a one-stop resource for new and existing businesses to seamlessly interact with state gov't.\n\nIt's been our priority to get more services online and create a true digital gov't where biz owners can spend time online - not in line.", "2020-07-29T18:04:14.000Z": "HAPPENING NOW: News briefing to announce the launch of Connecticut's business portal - a one-stop-shop where entrepreneurs can easily find info and create a checklist with everything required to start up or manage a business in the state. WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-29T03:07:29.000Z": "Too often, students of color and those in low-income communities are disproportionately disadvantaged by not having access to the learning technologies they need. Today, I announced measures to close this inequitable digital divide and ensure all students are set up to succeed.", "2020-07-29T03:06:21.000Z": "There are few responsibilities more important to me as Governor than ensuring all students in CT receive a high-quality, world-class education. It is paramount that every student has access to high-speed internet, quality digital learning content and an effective learning device.", "2020-07-29T00:52:12.000Z": "This is a critical component of closing the digital divide so that all students - regardless of their zip code or family income - can have access to a quality education. Connecticut launches $43.5M initiative to boost access to internet and technology as schools... As Connecticut school districts prepare for the possibility of reopening this fall with online and hybrid learning programs, Gov. Ned Lamont Tuesday announced a $43.5 million initiative to boost... courant.com", "2020-07-28T22:29:45.000Z": "Enormous thanks to @GovNedLamont for addressing head-on the digital divide in Connecticut. Today's announcement marks the launch of important work to get every student connected for the fall: https:// bit.ly/3f8SfCn  @EducateCT , @CTEDUNET , #KeepCTLearning Governor Lamont Announces the Everybody Learns Initiative: A $43.5 Million Program to Close the... Governor Ned Lamont announced today that his administration is launching the Everybody Learns initiative: a $43.5 million investment in remote learning solutions to close the digital divide in... portal.ct.gov", "2020-07-28T20:03:55.000Z": "Today's COVID-19 update in Connecticut: 7,638 tests were administered and 94 came back positive (1.2% positivity rate) 54 patients are hospitalized (a decrease of 5) There have been 5 COVID-related deaths\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-28T19:45:11.000Z": "Hat tip to @HARTransit in 'Hat City' for helping distribute free masks to Danbury bus riders. Keep yourself, other passengers, and transit workers safe. #WearAMask  #KeepCTSafe  #StopTheSpread  #CTRespect", "2020-07-28T19:44:02.000Z": "Transit workers from @CTDOTOfficial are handing out free face masks to bus commuters at @CTTRANSIT bus stops throughout the state today. Whenever you take public transit, please remember to wear a for the safety of the riders and staff! #KeepCTSafe  #ConnecticutRespect", "2020-07-28T19:06:40.000Z": "Today we launched the #EverybodyLearns initiative - a $43.5 million state investment to improve remote learning for students in under-resourced communities.\n\nThis includes: Laptops for 50,000 students", "2020-07-28T18:00:18.000Z": "HAPPENING NOW: Governor Lamont is in #Waterbury making an announcement about state investments that will improve remote learning within under-resourced communities during the upcoming school year. WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-28T17:51:46.000Z": "While our primary focus has been containing COVID, @GovNedLamont 's team has remained busy modernizing and consolidating government operations to reduce cost and improve services.  This is a good example, we'll announce another exciting one tomorrow. Quote Tweet Joe Cooper @JoeCooperHBJ State office shuffle to save $7 million; CRDA to redevelop Trinity Street building @JoshGeballe  @ConnDAS  https:// hartfordbusiness.com/article/state- office-shuffle-to-save-7m-crda-to-redevelop-trinity-st-building  Show this thread", "2020-07-28T17:04:44.000Z": "Connecticut's travel advisory has been expanded to include Illinois, Kentucky, Minnesota, Puerto Rico, and Washington DC.\n\nAnyone traveling to CT from locations with significant community spread of COVID-19 must self-quarantine for 14 days.\n\nFull list Travel in or Out of CT Learn the latest guidance on travel and what to know when traveling in or out of the state of Connecticut during the Covid-19 crisis. portal.ct.gov", "2020-07-28T15:50:02.000Z": "Getting kids back in the classroom is one of the most important things we can do to support their development during these difficult times if public health metrics allow it. We're going to continue to support our teachers, parents and kids as they navigate getting back to school. Quote Tweet WTNH News 8 @WTNH 76% of students expect to return to the classroom this fall, state survey finds: https:// wtnh.com/news/health/co ronavirus/76-of-students-expect-to-return-to-the-classroom-this-fall-state-survey-finds/ ", "2020-07-27T21:32:14.000Z": "76% of students expect to return to the classroom this fall, state survey finds: 76% of students expect to return to the classroom this fall, state survey finds According to a state-issued survey given to parents and students by school districts, 76% of students expect to attend in-person, even though remote learning is optional. wtnh.com", "2020-07-28T14:22:01.000Z": "Mask giveaway to bus riders across the state with @CTTRANSIT & other transit operators today! Masks on the move in New Haven this morning.  #KeepCTSafe  #StopTheSpread  #CTRespect", "2020-07-27T21:28:07.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 in Connecticut Governor Lamont's July 27, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-07-27T20:50:38.000Z": "\" @NutmegStateFCU Glastonbury branch will offer so-called DMV Express services starting this fall. That includes driver's license and ID renewals and replacements, and name and address changes on licenses.\" \n\n- @HartfordBiz Nutmeg State Financial CU, AAA team up to launch Glastonbury DMV services Nutmeg State Financial Credit Union's partnership with the Department of Motor Vehicles is expanding into Hartford County. hartfordbusiness.com", "2020-07-27T20:02:20.000Z": "Today's COVID-19 update in CT (from Fri-Sun): 31,960 tests were administered and 207 came back positive This is a 0.65% positivity rate 59 patients are hospitalized (decrease of 12) There have been 5 COVID-related deaths\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-27T20:00:10.000Z": "HAPPENING NOW: News briefing to discuss the latest COVID-19 updates in Connecticut WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-27T19:30:00.000Z": ". @WalletHub has ranked #CT 's public schools the 2nd best in the nation. Public Schools in CT Ranked #2 in U.S. ctbythenumbers.news", "2020-07-27T16:06:42.000Z": "I will hold a news briefing today at 4:00PM to discuss the latest updates on COVID-19 in Connecticut. Watch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-07-27T12:38:35.000Z": "Masks to be given to bus riders in CT https:// ctpost.com/local/article/ Masks-to-be-given-to-bus-riders-in-CT-15436261.php?utm_campaign=CMS%20Sharing%20Tools%20(Desktop)&utm_source=t.co&utm_medium=referral  via @connpost Masks to be given to bus riders in CT Masks will be available for bus riders in the morning and the afternoon on Tuesday. ctpost.com", "2020-07-25T20:00:00.000Z": "Check out our FAQ on the new Travel Advisory. Get the facts here! https:// portal.ct.gov/Coronavirus/tr avel ", "2020-07-25T17:19:53.000Z": "Yesterday, I hosted a student roundtable to hear about learning during COVID. I know many didn't get the senior year, graduaiton or prom they were looking forward to-but so many have stepped up in and outside the classroom and turned a challenging time into a positive experience.", "2020-07-24T20:00:01.000Z": "Attention Connecticut residents! Change your backdrop for a whole new view. Connecticut is calling. Ready to plan an outing? #GoodToCT", "2020-07-24T18:30:00.000Z": "Are you Connecticut resident? Look closer. See more. Discover all that's waiting in Central Connecticut today! #GoodToCT", "2020-07-24T17:00:00.000Z": "Calling all Connecticut residents! New normal. New perspectives. Rediscover what you've been missing, all right in Connecticut. Plan your outing today! #GoodToCT", "2020-07-24T15:30:00.000Z": "We've missed you, Connecticut residents! It's time to see through fresh eyes. Adventure is all right in Western Connecticut. Discover new favorites today! #GoodToCT", "2020-07-24T20:02:00.000Z": "Today's COVID-19 update in Connecticut: An out-of-state lab today provided the state with previously unreported data going to back to mid-May on cases involving CT residents. This data set amounts to approximately 12,000 tests, 440 of which were positive.\n\n(1/2)", "2020-07-24T19:36:26.000Z": "As we plan for fall, our students & partners will continue to have a seat at the table bc their diverse perspectives are informing this work. Providing as many outlets as we can for #StudentVoice ensures our learners views are reflected in the process. @GovNedLamont  @teachcardona", "2020-07-24T19:51:28.000Z": "This afternoon, I spent time with students from West Haven & New Haven along w/ @teachcardona .  Listening to their stories during COVID, it's clear that our students have been throughout this pandemic & school year. Their voices are so critical as we plan to come back to school.", "2020-07-24T14:34:48.000Z": "I want to thank @GovNedLamont for standing with #essentialworkers , issuing an executive order giving workers who got sick in CT's big first wave (3/10 to 5/20) a presumptive right to worker's compensation. They had our backs- let's have their backs. #ThankYouEssentialWorkers", "2020-07-24T14:00:01.000Z": "It's good to see you, Connecticut residents! Make new memories and revisit old favorites. It's all right in Connecticut. Plan your outing today! #GoodToCT", "2020-07-24T14:17:39.000Z": "Our state owes a debt to all of the essential workers who served vital roles during the earliest and darkest stages of this public health crisis.\n\nThis executive order I signed today is an important step to ensuring our essential workers are made whole. Governor Lamont Signs Executive Order Strengthening Workers' Compensation Claims for Essential... Governor Ned Lamont today announced that he has signed an executive order creating a rebuttable presumption that workers who contracted COVID-19 in the early days of the pandemic contracted it on the... portal.ct.gov", "2020-07-23T23:06:59.000Z": "Three Governors and their teams worked together and made public health a priority, there's still more work to be done and we will continue to fight this virus. Cc: @melissadderosa  @ghelmy Quote Tweet Governor Phil Murphy @GovMurphy New Jersey, New York, and Connecticut are the only THREE STATES in the nation making progress in the fight against #COVID19 , according to an analysis by @voxdotcom .\n \nOur tri-state partnership with @NYGovCuomo and @GovNedLamont is literally saving lives. https:// vox.com/2020/5/28/2127 0515/coronavirus-covid-reopen-economy-social-distancing-states-map-data ", "2020-07-23T22:57:09.000Z": "New Jersey, New York, and Connecticut are the only THREE STATES in the nation making progress in the fight against #COVID19 , according to an analysis by @voxdotcom .\n \nOur tri-state partnership with @NYGovCuomo and @GovNedLamont is literally saving lives. Just 3 states meet these basic criteria to reopen and stay safe Most states still need to reduce coronavirus cases and build up their testing capacity. vox.com", "2020-07-23T20:00:07.000Z": "Today's COVID-19 update in Connecticut: 13,483 tests were administered and 83 came back positive This is a 0.6% positivity rate 72 patients are hospitalized (an increase of 9) There have been 4 COVID-related deaths\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-23T19:45:00.000Z": "The @CTRedCross is looking for new volunteers who are interested in supporting the Red Cross response during disasters. Join them for a virtual info session on 7/29 from 12:30 - 1:30 p.m. to learn how you can get involved and register to donate by visiting https:// eventbrite.com/e/american-red -cross-of-ct-and-ri-virtual-volunteer-recruitment-event-registration-113362977718  The following media includes potentially sensitive content. Change settings View", "null": "", "2020-07-23T19:00:01.000Z": ". @Pfizer 's lab in Groton is helping to develop a potential COVID-19 vaccine that the U.S. government has agreed to buy 100 million doses. Pfizer gets $1.95 billion to develop COVID-19 vaccine www.hartfordbusiness.com", "2020-07-23T15:04:19.000Z": "One stop.\nOne solution.\nComing soon.", "2020-07-23T00:33:39.000Z": "Severe thunderstorm watches and warnings have been issued across the state this evening.... Keep an eye on the weather if you are venturing out tonight. Take protective measures if you are in the path of a storm. https:// ready.gov/thunderstorms- lightning ", "2020-07-22T20:59:45.000Z": "I'm appreciative of the superintendents from Southeastern Connecticut who met with me this afternoon to discuss the safety of our schools this upcoming academic year. #ConnecticutRespect", "2020-07-22T20:00:09.000Z": "Today's COVID-19 update in Connecticut: 11,529 tests were administered, 127 are positive (1.1% positivity rate) 63 patients are hospitalized (+1) Thankfully, for the second day in a row there's no COVID-related deaths to report\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-22T19:03:11.000Z": "Science is going to lead the way through this crisis.\n\nHere in Connecticut we have some of the top researchers in the world at @Pfizer developing treatments and creating a vaccine that will get us past this.\n\nThey deserve our thanks for their work & we're proud to have them here.", "2020-07-22T14:59:49.000Z": "HAPPENING NOW: News briefing with @Pfizer at the company's #Groton facility to discuss the development of a COVID-19 vaccine\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-22T13:27:20.000Z": "I'm headed to @Pfizer 's campus in #Groton where some of the nation's leading COVID research is taking place. Looking forward to learning more about the efforts to find new treatments and develop a vaccine. #ConnecticutRespect", "2020-07-22T01:33:48.000Z": "Quote Tweet Ben Berkowitz @benberkowitz CT is currently the only State in the nation 'on track to contain COVID.' Source: @CovidActNow", "2020-07-22T00:47:45.000Z": "I've signed an executive order strengthening our travel advisory for people entering from states with high rates of COVID-19. Travelers will be required to fill out a form upon entry.\n\nFill out the form here: http:// ct.gov/travelform Info on the advisory: http:// ct.gov/coronavirus/tr avel ", "2020-07-21T20:01:30.000Z": "Today's COVID-19 update in Connecticut: 5,548 tests were administered, 41 came back positive This is a 0.7% positivity rate 62 patients are hospitalized (increase of 8) Thankfully, there are no COVID-related deaths to report\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-21T18:40:44.000Z": "Had a quick bite to eat during a lunch meeting at Bart's Drive-In Restaurant in #WindsorCT . Perfect day for a hot dog!", "2020-07-21T17:16:06.000Z": "10 more states added to Connecticut's travel advisory: Alaska, Delaware, Indiana, Maryland, Missouri, Montana, North Dakota, Nebraska, Virginia, Washington\n\nOne state has been removed: Minnesota\n\nList now includes a total of 31 states Travel in or Out of CT Learn the latest guidance on travel and what to know when traveling in or out of the state of Connecticut during the Covid-19 crisis. portal.ct.gov", "2020-07-20T21:10:19.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 in Connecticut Governor Lamont's July 20, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-07-20T20:12:15.000Z": "Today's COVID-19 update in CT (from Fri-Sun): 27,323 tests were administered; 162 came back positive (0.59% positivity rate) 54 patients hospitalized (decrease of 12 and lowest since 3/23) There's been 10 COVID-related deaths\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-20T20:01:19.000Z": "HAPPENING NOW: News briefing to discuss the latest COVID-19 updates in Connecticut WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-20T18:57:06.000Z": "On a video call with @VP and the @WhiteHouse Coronavirus Task Force to discuss the latest updates on COVID-19", "2020-07-20T18:00:08.000Z": "It is an honor to nominate the following judges to fill vacancies on Connecticut's highest courts: Judge Christine Keller to the Supreme Court Judge Joan Alexander to the Appellate Court Judge Melanie Cradle to the Appellate Court Judge Jose Suarez to the Appellate Court", "2020-07-20T15:30:01.000Z": "I will hold a news briefing today at 4PM to discuss the latest updates on COVID-19 in Connecticut.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-07-18T16:23:33.000Z": "As a mark of respect for the memory and longstanding public service of civil rights icon Congressman John Lewis, I am directing flags in Connecticut lowered to half-staff. Governor Lamont Directs Flags Lowered to Half-Staff in Honor of U.S. Representative John Lewis Governor Ned Lamont today announced that he is directing U.S. and state flags in Connecticut to be lowered to half-staff as a mark of respect for the memory and longstanding public service of U.S.... portal.ct.gov", "2020-07-18T12:01:16.000Z": "On behalf of the State of Connecticut, I thank Congressman John Lewis for the decades of service he gave to our nation, and the impact he made throughout the entire country in the ongoing effort to bring positive change in the face of injustice.", "2020-07-18T05:25:25.000Z": "Not many of us get to live to see our own legacy play out in such a meaningful, remarkable way. John Lewis did: My Statement on the Passing of Rep. John Lewis America is a constant work in progress. What gives each new generation purpose is to take up the unfinished work of the last and carry it medium.com", "2020-07-18T00:13:17.000Z": "Topics for next week's special session include: Absentee ballots for the upcoming election Greater transparency and accountability for law enforcement Expansion of telehealth services Cost controls on prescription drugs, equipment, and supplies used to treat diabetes", "2020-07-18T00:05:21.000Z": "I've just signed a proclamation calling the #CTGeneralAssembly to meet in special session beginning July 21 to consider several urgent topics.\n\nThrough my discussions with legislative leaders, I'm glad that we've reached a consensus on the importance of getting these done.", "2020-07-17T21:17:29.000Z": "In response to ongoing discussions & engagement with partners incl students, districts, educators, families & advocacy organizations, we compiled this FAQ to help answer outstanding questions about \"Advance, Adapt, Achieve\" & assist local planning efforts: https:// tinyurl.com/y4j2qghs", "2020-07-17T20:02:29.000Z": "Swimming areas will be open at the following inland parks: Stratton Brook State Park, Wharton Brook State Park, Day Pond State Park, Gay City State Park, Chatfield Hollow State Park, Black Rock State Park, Hopeville Pond State Park and Lake Waramaug State Park.", "2020-07-17T20:02:28.000Z": "DEEP will open inland swimming areas at eight state parks and will also re-open Seaside State Park and the marsh boardwalk at Silver Sands State Park tomorrow. For more info: https:// portal.ct.gov/DEEP/News-Rele ases/News-Releases---2020/DEEP-Opening-Eight-Inland-Swim-Areas-and-Seaside-State-Park ", "2020-07-17T20:04:36.000Z": "Today's COVID-19 update in Connecticut: 14,417 tests were administered and 143 came back positive (0.99% positivity rate) 66 patients are hospitalized (same as yesterday) There have been 7 COVID-related deaths reported\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-17T19:55:54.000Z": "Investing in our local communities is critical to our state's economic future. Proud to announce funding for a project in Ansonia that will reinvent the past by taking a brownfield and making it available for future development. @KaraRochelleCT  @SenGeorgeLogan  #Valley  #Recharged", "2020-07-17T18:54:40.000Z": "There's a lot of heart and activity in the #Valley ! Ansonia's downtown is thriving with amazing restaurants and expansive development. Had the chance to tour the downtown and meet some local business owners with Mayor Casetti, @SenGeorgeLogan and Rep. @KaraRochelleCT . #Recharged", "2020-07-17T18:39:02.000Z": "Spent the afternoon with school superintendents from Ansonia, Derby, Shelton, Oxford, Seymour, Naugatuck and Region 16 listening to their feedback on our school reopening guidelines. Appreciated hearing the thoughts and concerns conveyed by teachers and parents alike. #Valley", "2020-07-17T17:26:49.000Z": "Connecticut owes a debt to the health care professionals, grocery store clerks, and other essential workers who stood at their posts during the darkest days of this pandemic. (1/3)", "2020-07-17T12:54:13.000Z": "Yesterday, I was joined by former FDA commissioner @ScottGottliebMD to hear his thoughts on Connecticut's school reopening plan. Scott shared what he thinks we're doing right and what the future may look like for students and teachers.", "2020-07-16T21:22:37.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 in Connecticut Governor Lamont's July 16, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-07-16T20:06:14.000Z": "Today's COVID-19 update in Connecticut: 11,453 tests were administered and 114 came back positive (0.995% positivity rate) 66 patients are hospitalized (1 fewer than yesterday) There have been 9 COVID-related deaths reported\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-16T20:00:22.000Z": "HAPPENING NOW: News briefing to discuss the latest COVID-19 updates in Connecticut WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-16T15:44:20.000Z": "HAPPENING NOW: News briefing with Governor Lamont, @ChrisMurphyCT and @SenBlumenthal urging the US Senate to adopt COVID-19 relief legislation WATCH LIVE: CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-16T11:20:21.000Z": "I will hold my daily news briefing with updates on COVID-19 today at 4:00PM. We'll be joined by former FDA commissioner @ScottGottliebMD . Tune in to hear more about Connecticut's education reopen plan from one of America's leading public health experts.", "2020-07-16T00:42:15.000Z": "\"Connecticut has consistently had one of the lowest rates of transmission (R numbers) of any state in the country. An R number represents how many people each infected person is likely to go on and infect, on average.\" 'From worst to first': These states have tamed coronavirus, even after reopening. Here's how... While more than half the states have paused or backtracked reopenings due to increased Covid-19, several states have decreasing rates of infection, hospitalizations and deaths -- paving the way for... cnn.com", "2020-07-15T20:03:32.000Z": "Today's COVID-19 update in Connecticut: 12,338 tests were administered and 106 came back positive (0.8% positivity rate) 67 patients are hospitalized (increase of 1) There have been 8 COVID-related deaths reported\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-14T21:59:26.000Z": "*Attention Commuters* COVID has changed a lot, including commutes. Complete our CTDOT- @CTrides survey about your past/present/future commuting habits & help inform transit service decisions related to you. Read more: https:// bit.ly/3exkA50 Survey: https:// bit.ly/3j6icFM", "2020-07-14T21:03:49.000Z": "Today's COVID-19 update in Connecticut: 2,447 tests were administered and 20 came back positive* This is a 0.8% positivity rate 66 are hospitalized (decrease of 8 since yesterday) There has been 1 COVID-related death reported\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-14T21:00:29.000Z": "HAPPENING NOW: News briefing to discuss plans for a special session of the state legislature WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-14T20:38:52.000Z": "This policy should never have been enacted in the first place and I am glad that it was reversed. We're proud to have these students in Connecticut and contributing to the strength of our communities. Trump administration backs down on restrictions for international students A judge announced Tuesday the administration is rescinding its directive blocking international students from staying in the United States while taking online-only classes. nbcnews.com", "2020-07-14T14:54:28.000Z": "Four states added to CT travel advisory: Minnesota, New Mexico, Ohio, Wisconsin\n\nOne removed: Delaware\n\nIf you're traveling to CT from the following states you need to quarantine 14 days: \n\nAL AR AZ CA FL GA IA ID KS LA MN MS NC NM NV OH OK SC TN TX UT WI Travel in or Out of CT Learn the latest guidance on travel and what to know when traveling in or out of the state of Connecticut during the Covid-19 crisis. portal.ct.gov", "2020-07-13T23:16:53.000Z": "Today, @AGWilliamTong , @GovNedLamont and I stood against the decision barring international students from staying here if their classes are entirely online during the fall semester. It's a policy driven by hostility toward immigrants and not based in science.", "2020-07-13T21:55:03.000Z": "Masks make a difference! Following the implementation of our executive order requiring masks be worn, we saw a decrease in cases that helped make Connecticut a leader in combatting coronavirus and flattening the curve.", "2020-07-13T21:53:48.000Z": "COVID-19 hospitalizations in Connecticut peaked at 1,972 patients on April 22 and have been going down since.\n\nThe order directing face coverings to be worn went into effect on April 21.\n\nKeep looking out for each other, Connecticut. What you're doing is having an impact.", "2020-07-13T21:11:13.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 in Connecticut Governor Lamont's July 13, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-07-13T20:09:13.000Z": "Today's COVID-19 update (from Fri-Sun): 31,101 tests administered; 223 are positive (0.7% positivity rate) 74 are hospitalized (decrease of 3) Today's report includes 23 deaths, 17 of which occurred over last several weeks\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-13T19:59:40.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-13T16:23:43.000Z": "\"Adapt, Advance, Achieve\" receives 12 out of 12 on @JohnsHopkins eSchool+ Initiative's analysis of 50 state's school reopening plans; examines ways plans support students & teachers. CT's plan addresses all criteria: https:// tinyurl.com/y95ywag7 . @GovNedLamont  @Covid19Ct  @teachcardona Quote Tweet Johns Hopkins University @JohnsHopkins The new School Reopening Policy Tracker provides real-time analysis of the latest K-12 reopening guidance for every state.\n \nLearn more and explore the tracker: https:// hub.jhu.edu/2020/07/09/reo pening-schools-policy-tracker/  Show this thread", "2020-07-13T18:31:07.000Z": "I will hold a news briefing today at 4:00PM to discuss the latest COVID-19 updates in Connecticut.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-07-13T17:33:02.000Z": "HAPPENING NOW: News briefing regarding the new policy enacted by the Trump administration that requires international college students to leave the country if their classes are moving online during the COVID-19 pandemic. WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-11T19:09:46.000Z": "Don't let your guard down! CT has made great progress, but we all still have our part to do Quote Tweet CT National Guard @CTNationalGuard Don't Become Complacent! \n\nLearn the ways to properly use your mask of choice!", "2020-07-11T01:49:17.000Z": "One last contestant for our mask PSA contest. Spare me one last #Hamilton reference! Hamilton Mask-up Parody Medley I am not throwing away this mask. I am not throwing away this mask. This really should be bipartisan. Come on now, how hard is it? I am not throwing away thi... youtube.com", "2020-07-10T22:22:12.000Z": "DEEP & the Dept. of Agriculture seek public feedback on a draft spend plan that details proposed disbursement guidelines for $1.8M in federal CARES Act funds for marine fishery participants impacted by the #COVID19 pandemic. Comments due by July 19! More: https:// portal.ct.gov/DEEP/Fishing/C ommercial/CT-CARES-Act-Assistance-to-Fisheries-Participants ", "2020-07-10T19:22:59.000Z": "Across the state, high school graduates are signing up to learn new skills and pursue a degree. Don't forget to apply by July 15th to be eligible for free community college! Visit http:// ct.edu/pact for more information.", "2020-07-10T20:37:40.000Z": "More positive news for CT's rail service. Check out added trains on @hartfordline starting Monday. #WearAMask  #StopTheSpread  #ConnecticutRespect Quote Tweet CTrail Hartford Line @hartfordline Service Increasing! Additional trains will be added to the CTrail Hartford Line schedule on Monday, July 13. For more details visit http:// HartfordLine.com !", "2020-07-10T19:45:15.000Z": "UConn announces zero positive COVID-19 tests among student athletes who have returned to campus UConn announces zero positive COVID-19 tests among student athletes who have returned to campus Members of the men's basketball team was the first to return to campus on June 19, followed by the football team on July 1, ahead of voluntary workouts. courant.com", "2020-07-10T19:28:52.000Z": "Very happy to meet at @bigelowtea with @GovNedLamont  @CMcCarthyVahey  @BrendaKupchick to celebrate a $2 million federal grant to the Workplace in Bridgeport. Money will go to apprenticeships for young people to train them in manufacturing and other great jobs! Thank you @crbigs", "2020-07-10T18:49:07.000Z": "A lot of people worked tirelessly to get us here.  Huge shout out to @CTDPH  @CTDEMHS  @ctdss  @ComptrolLembo  @CTNationalGuard  @ConnDAS  @ConnOPM  @HartfordHealthC  @ynhhealth  @cthosp  @jacksonlab  @sema4  @BCG  @YaleSPH  @shellygilman and so many more.  Let's keep it going! Quote Tweet Mark Pazniokas @CTMirrorPaz The COVID tracking project says  CT is one of only 12 states doing the recommended number of tests. Others include NY, NJ, MA, VT & ME. https:// nytimes.com/interactive/20 20/us/coronavirus-testing.html?referringSource=articleShare ", "2020-07-10T12:28:59.000Z": "The COVID tracking project says  CT is one of only 12 states doing the recommended number of tests. Others include NY, NJ, MA, VT & ME. Is Your State Doing Enough Coronavirus Testing? The number of daily coronavirus tests conducted in the United States is only 40 percent of the level necessary to mitigate the spread of the virus, according to estimates by researchers at the... nytimes.com", "2020-07-10T17:53:43.000Z": "Service Alert Starting Monday, returning service on the @MetroNorth  #DanburyBranch . #WearAMask  #StoptheSpread  #ConnecticutRespect Quote Tweet Metro-North Railroad. Wear a Mask-Stop the Spread. @MetroNorth Danbury Branch - Train Service Resumes Monday, July 13", "2020-07-10T17:32:00.000Z": "Today's COVID-19 update in Connecticut: 12,594 tests were administered and 78 came back positive (0.6% positivity rate) 77 people are hospitalized, a decrease of 13 since yesterday There are no COVID-related deaths to report\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-10T16:35:08.000Z": "Just got the good news that we've had another day of no COVID-related deaths in the state. I appreciate everyone's support to help mitigate the impact of this virus on our state. We'll have more info to report on today's metrics in a little bit. #ConnecticutRespect", "2020-07-10T16:20:03.000Z": "We're continuing to monitor the potential impact of Tropical Storm #Fay on CT.\n\nRight now, it appears the heaviest rain will be in western CT, which could see about 2-4\". Eastern CT can expect about 1-2\".\n\nFlood watches are in effect for the entire state. Stay safe!", "2020-07-10T15:18:53.000Z": "Mood: #ConnecticutRespect", "2020-07-10T14:52:31.000Z": "A message for CT's amazing teachers from State Board of Education Member & proud educator Erin Benham. Together, #WeGotThis ! @benhamerin  @teachcardona  @2020CTtoy  @AFTCT  @ceanews  @CTTOYCouncil  @teachCTorg  @GovNedLamont", "2020-07-10T13:30:33.000Z": ". @GovNedLamont is asking businesses to pause for 10 mins on July 10 @ 10am to complete the 2020 U.S. Census. Both people and businesses depend on an accurate Census for Medicare, Medicaid, emergency preparedness & school lunch programs.  Take the Census >> https://", "2020-07-09T23:15:27.000Z": "A Tropical Storm has formed off of the North Carolina coast. Tropical Storm Warnings have been issues for the Connecticut Coast. Flood Watches have been issued for the rest of the state.\nStay informed by following trusted media sources. Hurricane Season Preparedness portal.ct.gov", "2020-07-09T21:43:24.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 in Connecticut Governor Lamont's July 9, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-07-09T20:10:21.000Z": "There were 221 people who tested positive for the 1st time or had onset of symptoms in the past 7 days.\n\nOf these, 213 were among people who reside in the community and 8 were among ppl in congregate settings (nursing homes, assisted living facilities, correctional facilities).", "2020-07-09T20:03:34.000Z": "Today's COVID-19 update in Connecticut: 8,171 tests were administered; 101 came back positive Cases continue to hold steady, around a 1% positivity rate 90 people are hospitalized (increase of 2) There have been 5 fatalities\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-09T19:59:04.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-09T19:49:30.000Z": "COST applauds Governor Lamont for releasing $15 million in STEAP funding. This will provide a much needed boost for small towns struggling to position their towns for economic recovery. @GovNedLamont  @MaxReiss", "2020-07-09T19:42:25.000Z": "Our small towns have been hit hard by COVID-19 and are in need of our help to fund these projects.\n\nReinstating the #STEAP program is a way that we can help move these infrastructure improvements forward. Governor Lamont Reinstates Small Town Grant Program to Support Local Capital Improvement Projects In an effort to support Connecticut's municipalities while implementing projects that will give a boost to the economy and help in their response to the ongoing COVID-19 pandemic, Governor Ned Lamont... portal.ct.gov", "2020-07-09T19:20:46.000Z": "For the entire month of July residents can use promo code \"WearAMask\" for 3 hours of free parking when they use the Parkmobile app in City garages. This code can be used once per day and is only valid in parking garages.", "2020-07-09T16:53:15.000Z": " #ConnecticutRespect Quote Tweet Jillian Gilchrest @Jilchrest Experts agree: the #1 thing you can do to help stop the spread of COVID-19 is wear a mask. If we all take this simple precaution, countless lives could be saved. #InThisTogether", "2020-07-09T16:14:17.000Z": "I will hold a news briefing today at 4PM to discuss the latest updates on COVID-19 in Connecticut. WATCH LIVE Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-07-09T15:21:53.000Z": "HAPPENING NOW: @EducateCT discussion on PreK-12 school reopening plans WATCH LIVE Reopen Plan Webinar - Adapt, Advance, Achieve: CT's Plan to Learn and... The Connecticut State Department of Education will be hosting a live moderated webinar to discuss the newly released fall re-open document: Adapt, Advance, A... youtube.com", "2020-07-09T14:33:52.000Z": "We must take a look at who our monuments honor, but vandalism does not represent our Connecticut values or solve the systemic problems we face. I support taking a look at removing statues and honoring those more reflective of our communities without destroying our communities.", "2020-07-09T12:54:27.000Z": "TODAY at 11am - Join @EducateCT  @teachcardona , @GovNedLamont & @CTDPH Commissioner Giffords to get answers to your questions on CT's plan for returning to school in the fall. \n\nCatch the livestream here:\nYouTube https:// tinyurl.com/y8782qol Facebook Live https:// tinyurl.com/yc8nt5ns Quote Tweet CT Dept of Education @EducateCT \"Adapt, Advance, Achieve\" is built on six principles that will guide the development of local plans. Tomorrow at 11am we'll provide an overview & answer your questions. View the live stream:\nYouTube broadcast https:// tinyurl.com/y8782qol ; or\nFacebook Live https:// tinyurl.com/yc8nt5ns", "2020-07-08T23:03:53.000Z": "The ACA was created to end discrimination in health care - including coverage for contraception for women.\n\nThe #SCOTUS decision today reversing that will negatively impact women's health.\n\nBirth control is basic health care and we will do everything we can in CT to protect this.", "2020-07-08T20:33:47.000Z": "Today's COVID-19 update in Connecticut: 7,335 tests were administered and 75 came back positive Cases are holding steady at around a 1% positivity rate 88 people are hospitalized (increase of 5) There have been 5 fatalities\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-08T19:30:00.000Z": "Calling all #CT restaurant owners! Register for @CTDECD and @HEDCOInc 's Restaurant Summit on July 13th for industry information and resources. CT Restaurant Summit us02web.zoom.us", "2020-07-08T20:00:01.000Z": "A $1.5M emergency loan program has been set up for women- and minority-owned small businesses in New Haven and the lower Naugatuck Valley. New Haven's effort to help the hardest hit ctmirror.org", "2020-07-08T18:29:44.000Z": "HAPPENING NOW: News briefing to discuss today's #SCOTUS decision rolling back access to birth control under the Affordable Care Act WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-08T17:55:17.000Z": "CT, it's not too late to respond to the 2020 Census! That's why we are launching the Take 10 at 10 initiative. Take 10 minutes on July 10 at 10 a.m. to respond to the decennial count. http:// 2020Census.gov 1-844-330-2020\n\nWe're counting on you to be counted! #Take10at10CT", "2020-07-08T17:15:01.000Z": "CTDOL has new phone numbers Local Access 860-967-0493 & 203-941-6868 Toll-Free 800-956-3294. Or, for immediate help (or to submit a help request) click on Ask DOL at the bottom of the screen here --> http:// Filectui.com . @GovNedLamont . @LGSusanB", "2020-07-08T16:24:07.000Z": "One year ago today @GovNedLamont signed our bill making mental health parity the law of land. \n\nBecause of it, no one in CT can be treated differently when it comes to insurance because they have a disease of the brain instead of a disease of the body.", "2020-07-08T15:23:49.000Z": "Connecticut @GovNedLamont says it's \"extraordinary news\" that the state reported zero coronavirus deaths for the first time in months.\n\n\"But we have to be very cautious, especially when you look at what's going on around the rest of the country,\" he warns. https:// cnn.it/31RNuKC From CNN Newsroom", "2020-07-08T12:30:51.000Z": "The Connecticut State Department of Education will be holding a Q&A tomorrow at 11AM via videoconference to discuss plans for PK-12 schools during the upcoming academic year. Quote Tweet CT Dept of Education @EducateCT \"Adapt, Advance, Achieve\" is built on six principles that will guide the development of local plans. Tomorrow at 11am we'll provide an overview & answer your questions. View the live stream:\nYouTube broadcast https:// tinyurl.com/y8782qol ; or\nFacebook Live https:// tinyurl.com/yc8nt5ns", "2020-07-08T10:50:00.000Z": "As of today, all state campgrounds are now officially open for the 2020 season. All campers must make reservations in advance of their stay. Walk-in campers will not be permitted this season.\n\nReservations can be made online on the @CTDEEPNews website. Camping - CT State Parks and Forests portal.ct.gov", "2020-07-07T20:50:44.000Z": "Connecticut is ranked best in the nation in COVID-19 growth rate.\n\nLet's keep wearing masks. Let's keep getting tested. Let's look out for one another.\n\nThe way we're going to keep these numbers low is by working together.\n\nSource: https:// rt.live  #ConnecticutRespect", "2020-07-07T20:00:04.000Z": "Today's COVID-19 update in Connecticut: 5,745 tests were administered and 57 came back positive (0.99% positivity rate) 83 people are hospitalized For the 1st time since March, there are no COVID-related deaths to report today\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-07T15:13:59.000Z": "UPDATE: If you're traveling to New Jersey from the following states, you should self-quarantine for 14 days: AL, AR, AZ, CA, DE, FL, GA, IA, ID, KS, LA, MS, NC, OK, NV, SC, TN, TX, UT \n \nLearn more: https:// nj.gov/governor/news/ news/562020/approved/20200707a.shtml ", "2020-07-07T16:24:30.000Z": "If you're traveling to New York from the following states you must self-quarantine for 14 days.\n\nThe states are: AL, AR, AZ, CA, DE, FL, GA, IA, ID, KS, LA, MS, NC, NV, OK, SC, TN, TX, UT.", "2020-07-07T15:03:37.000Z": "Stay up to date with the latest in PK-12! Subscribe to the @EducateCT newsletter: https:// tinyurl.com/yy42e6mx . \n\nIn the July 7th edition: \nFall reopen plan; \n #CTLearningHub ; \nSummer Learning Opportunities; \n @ciacsports guidelines.\n \nCheck it out: https:// tinyurl.com/ycpml33a", "2020-07-07T14:18:20.000Z": "Three more states have been added to our travel advisory: Delaware, Kansas, Oklahoma\n\nIf you're traveling to CT from the following states you need to self-quarantine for 14 days: AL, AR, AZ, CA, DE, FL, GA, IA, ID, KS, LA, MS, NC, NV, OK, SC, TN, TX, UT Travel in or Out of CT Learn the latest guidance on travel and what to know when traveling in or out of the state of Connecticut during the Covid-19 crisis. portal.ct.gov", "2020-07-06T22:39:52.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 in Connecticut Governor Lamont's July 6, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-07-06T20:03:56.000Z": "Today's COVID-19 update in Connecticut (from Fri-Sun): 24,692 tests were administered; 259 came back positive (1.0% positivity rate) 26 fewer people are hospitalized; total of 69 (lowest since 3/23) There have been 3 fatalities\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-06T20:00:23.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-29T18:00:18.000Z": "Did you know that 211 Connecticut has built-in translation functionality with support for more than 30 languages (powered by Google Translate)? https://", "2020-07-06T14:47:15.000Z": "I will hold a news briefing today at 4:00PM to discuss the latest updates on COVID-19 in Connecticut. WATCH LIVE Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-07-06T14:45:43.000Z": "Don't forget to mask up! #ConnecticutRespect", "2020-07-04T14:56:33.000Z": "Tune into WILI AM radio, check their Facebook page or listen live here: WILI AM wili.com", "2020-07-04T14:55:30.000Z": "Happy Independence Day to all in Connecticut! One of my favorite traditions for the Fourth of July is marching in the Boom Box Parade in #Willimantic with so many friends. One of the most fun parades to be a part of-this year we're safely celebrating virtually.", "2020-07-03T19:19:50.000Z": "As the #4thofJuly approaches, please remember to: Be safe. Wash your hands. Frequently. Wear a mask. Over your nose. Practice social distancing by staying 6 ft. apart. #COVID19 is still spreading. Please be smart.\n\nHave a good holiday everyone! #ConnecticutRespect", "2020-07-03T19:03:35.000Z": "Today's COVID-19 update in Connecticut: 10,370 tests were administered and 71 came back positive (0.7% rate of positivity) Total hospitalizations decreased by 6 for a total of 95 (lowest since 3/24) There have been 9 fatalities\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-02T22:47:40.000Z": "If you haven't been to the @MaritimeAqua , you should go! \n\nLooking to experience more of our beautiful state? Check out http:// ctvisit.com . #GoodToCT Quote Tweet Maritime Aquarium @MaritimeAqua We were thrilled to welcome Connecticut Lt. Governor Susan Bysiewicz and State Rep. Travis Simms (D-140) to the Aquarium today! \n\nThis visit was one of several stops by @LGSusanB to promote the reopening of the state's tourist attractions.", "2020-07-02T21:11:54.000Z": "Well hello there, Professor Wharton! Thank you for this PSA. Quote Tweet Governor Ned Lamont @GovNedLamont #ConnecticutRespect with Professor Wharton @SCSU  @PreppyProf", "2020-07-02T18:21:17.000Z": "See how tourism attractions across Connecticut are reopening safely. #GoodToCT", "2020-07-02T21:28:37.000Z": "We've updated our #COVID19 travel advisory with more guidance.\n\nIf arriving from a state with high rates of COVID, quarantining remains the best option. If that's not possible, travelers may enter CT if they test negative within 72 hrs.\n\nCheck out the FAQ: Travel in or Out of CT Learn the latest guidance on travel and what to know when traveling in or out of the state of Connecticut during the Covid-19 crisis. portal.ct.gov", "2020-07-02T21:08:17.000Z": "A public health and testing campaign is critical to reinforce what we all need to be doing to show some #ConnecticutRespect so that we can keep the spread of #COVID19 down.\n\nWhich of these PSAs do you like best? Professor Wharton 25.3% Stew Leonard 24.9% Lifeguard 8.7% Coach Auriemma", "2020-07-02T21:08:11.000Z": "#ConnecticutRespect with @UConnWBB Coach Geno Auriemma @UConn  @UConnHuskies", "2020-07-02T21:08:10.000Z": "#ConnecticutRespect with a lifeguard", "2020-07-02T21:08:08.000Z": "#ConnecticutRespect with @StewLeonards", "2020-07-02T21:08:06.000Z": "#ConnecticutRespect with Professor Wharton @SCSU  @PreppyProf", "2020-07-02T20:09:27.000Z": "CT Department of Motor Vehicles Resumes Select Testing and Registration Services - #CTDMV Expands Service Options During Week Two of the Agency's Reopening CT Department of Motor Vehicles Resumes Select Testing and Registration Services CT DMV Expands Service Options During Week Two of the Agency's Reopening. portal.ct.gov", "2020-07-02T20:08:20.000Z": "Over the last 7 days, there were 281 new cases of COVID-19 in CT.\n\nOf these, 250 were people who reside in the community, and 31 were people in congregate settings (nursing homes, assisted living, correctional facilities).\n\nHere's a map showing the distribution of the 250 cases.", "2020-07-02T20:01:24.000Z": "Today's COVID-19 update in Connecticut: 11,461 tests were administered and 74 came back positive This is a 0.6% rate of positivity 101 people are hospitalized, an increase of 1 There have been 2 fatalities\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-02T17:22:41.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 in Connecticut Governor Lamont's July 2, 2020 11AM Coronavirus Update Governor Ned Lamont's 11:00 a.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronavir... youtube.com", "2020-07-02T17:22:03.000Z": "\"Connecticut went from a state with one of the highest infection rates to one of the lowest. This was accomplished by implementing policies based on science, data, and facts - not politics.\" - @LGSusanB", "2020-07-02T17:12:50.000Z": "Thank you Nate and Grace for your help during today's press conference! \n\nWe wish you all a happy and safe 4th of July weekend!", "2020-07-02T14:59:06.000Z": "HAPPENING NOW: News briefing to discuss the latest COVID-19 updates in Connecticut WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-02T14:56:55.000Z": "Effective Monday, July 20, the Judicial Branch is planning to resume operations in eight additional courthouses, bringing the total to 25 open courthouses. For more information, visit: https:// jud.ct.gov/HomePDFs/Jud_E xpands_Court_Ops.pdf ", "2020-07-02T14:00:42.000Z": "I will hold a news briefing today at 11AM to discuss the latest updates on COVID-19 in Connecticut. WATCH LIVE Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-07-02T02:40:33.000Z": "We need people to stand up. We need people to stand up each and every day for justice, decency and respect. We cannot get anything done if we don't change hearts.", "2020-07-01T20:32:47.000Z": "Connecticut's restaurants are going above and beyond to ensure a safe and enjoyable experience for diners. Make your reservation today! #GoodToCT What's Open Now: Restaurants www.ctvisit.com", "2020-07-01T20:03:36.000Z": "Today's COVID-19 update in Connecticut: 11,448 tests were administered and 58 came back positive At 0.5%, this is the lowest rate of positivity to date 100 people are hospitalized, an increase of 2 There were 2 fatalities\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-07-01T18:08:38.000Z": "Today I joined @govnedlamont  @lgsusanb & other community leaders to denounce the recent hate crimes in #connecticut & call for the dismantling of systemic racism. \n\nNow's our moment to act & bring meaningful change to CT & our communities. We shall not be moved. #blacklivesmatter", "2020-07-01T19:51:05.000Z": "\"We are emancipated, but we are not yet free. We are not yet free from redlining. We are not yet free from police brutality. We are not yet free from working all your life to get a house, but getting a worse mortgage and neighborhood because of the color of your skin.\" @DonBellCT", "2020-07-01T19:47:34.000Z": "\"I'm the youngest of five children. My father taught me at a very young age that I have to be twice as good as a Black man just to be the same.\"", "2020-07-01T19:45:11.000Z": "\"We're a country that respects our diversity, respects each and every individual, respects people standing up. We're a country that stands up for decency. We're never going to keep racism down unless each and everyone of you stand up.\"", "2020-07-01T15:59:37.000Z": "HAPPENING NOW: News briefing in #ManchesterCT to denounce racism and hate crimes WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-07-01T12:30:13.000Z": "See how Connecticut's restaurants are reopening safely. #GoodToCT", "2020-06-29T15:45:50.000Z": "ICYMI: The #CTDMV is open by appointment only! Visit http:// ct.gov/dmv to learn more or to schedule your appointment. Connecticut Department of Motor Vehicles portal.ct.gov", "2020-06-25T11:43:16.000Z": "REMINDER: Deadlines have been extended. Eligible #CTDMV credentials that expire between July 1, 2020 and July 31, 2020 will be extended by 90-days.\n\nFor a complete list of extensions and details, visit https:// CTDMV.info", "2020-06-30T20:03:55.000Z": "Today's metrics, with an all-time high in tests reported and all-time low in test positivity rate, reflect momentum in our testing strategy and discipline from the people of Connecticut to wear , keep their distance, and follow safety guidelines. Quote Tweet Governor Ned Lamont @GovNedLamont Today's COVID-19 update in CT: 21,416 tests were administered and 152 came back positive (0.7%) This is the largest day of testing and lowest rate of positivity to date Hospitalizations declined to 98 There were 2 fatalities\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-06-30T20:02:05.000Z": "Today's COVID-19 update in CT: 21,416 tests were administered and 152 came back positive (0.7%) This is the largest day of testing and lowest rate of positivity to date Hospitalizations declined to 98 There were 2 fatalities\n\nFor more data, visit http:// ct.gov/coronavirus", "2020-06-30T14:38:41.000Z": "In coordination with our neighboring states, we've updated the list of states with high COVID-19 infection rates that are covered under our regional travel advisory.\n\nAs of today, there are currently 16 states that meet this criteria. They include:\n\n- Alabama\n- Arkansas\n\n(1/2)", "2020-06-30T01:23:19.000Z": "As @teachcardona mentions, the @AmerAcadPeds supports key aspects of our education plan and \"strongly advocates that all policy considerations for the coming school year should start with a goal of having students physically present in school.\"", "2020-06-26T21:40:03.000Z": "The @AmerAcadPeds says the goal for the coming school year should be to have students \"physically present.\" According to interim guidance on re-entry, \"schools are critical to addressing racial and social inequity.\" Read more at http:// ow.ly/mjEP50Ajb2t", "2020-06-29T17:20:05.000Z": "Hats off to the bears in ... @ElizabethParkCT  who follow the rules of the road!! ...Be like Yogi! Always use #crosswalks . ... @WeHartford  Even Bears Like the Roses at Elizabeth Park, and Follow the Traffic Rules - We-Ha | West Hartford... A West Hartford resident spied a bear - properly using the crosswalk - in Elizabeth Park Sunday morning. By Ronni Newton West Hartford resident Bill Gleason was visiting Elizabeth Park Sunday... we-ha.com", "2020-06-29T23:09:48.000Z": "Connecticut has been a national leader when it comes to wearing a mask to help prevent the spread of COVID-we know the importance. One more reminder though--whether you listen to Freddy Mercury or the amazing Coach Auriemma, don't forget that \"if you have to ask, wear a mask.\"", "2020-06-29T22:08:17.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 Governor Lamont's June 29, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-06-29T20:03:41.000Z": "Today's COVID-19 update in Connecticut:\n\nAn additional 6,354 tests were performed, and 59 came back positive (0.93% of total).\n\nHospitalizations decreased to 99 (4 fewer since yesterday).\n\nThere were 4 COVID fatalities.\n\nFor more data, visit http:// ct.gov/coronavirus .", "2020-06-29T20:00:58.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-29T19:48:40.000Z": "Details released today on the state's plan to reopen schools for the 2020-21 academic year.\n\nThe release of this document follows the announcement last week of a framework to allow all students the opportunity to have access to in-school, full-time instruction this fall. Quote Tweet CT Dept of Education @EducateCT Together we lived through #COVID19 's disruption to PK-12 in a way not experienced in +100 years & together we'll recover. Prioritizing safety & ensuring access & equity for all, \"Adapt, Advance, Achieve\" is the first step to returning to school in 2020-21: https:// tinyurl.com/y78cjx7b", "2020-06-29T16:37:48.000Z": "I will hold a news briefing today at 4PM to discuss the latest updates on COVID-19 in Connecticut. WATCH LIVE Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-29T16:18:02.000Z": "During this COVID crisis, many renters and homeowners are having a hard time paying the costs of housing.\n\nThis emergency assistance will help provide housing stability and relieve some of the financial burden our families have faced during this pandemic. https:// bit.ly/CTCovidHousing", "2020-06-29T16:03:32.000Z": "#ConnecticutRespect", "2020-06-28T22:48:43.000Z": "Congratulations to your 2020 #TravelersChamp winner, @DJohnsonPGA  !", "2020-06-28T20:54:32.000Z": "Severe thunderstorms are moving across the state. Please remain aware of changing weather conditions.", "2020-06-28T14:02:58.000Z": "Today's COVID-19 update in Connecticut:\n\nAn additional 9,077 tests were performed, and 97 came back positive (1.1% of total).\n\nHospitalizations decreased to 103 (3 fewer since yesterday).\n\nThere were 5 COVID fatalities.\n\nFor more data, visit http:// ct.gov/coronavirus .", "2020-06-27T14:26:44.000Z": "Today's COVID-19 update in Connecticut:\n\nAn additional 12,678 tests were performed, and 147 came back positive (1.2% of total).\n\nHospitalizations decreased to 106 (21 fewer since yesterday).\n\nThere were 4 COVID fatalities.\n\nFor more data, visit http:// ct.gov/coronavirus .", "2020-06-26T21:14:14.000Z": "Throughout the course of this crisis, our goal has been to provide guidance based on real, expert medical advice.\n\nI'm grateful to so many of Connecticut's residents who are doing what's right.\n\nKeep it up, Connecticut. Quote Tweet Joe DeLong @joedelongCCM Governor Pete Ricketts of Nebraska warned Nebraska Counties that if they required masks he would pull all of their state funding. I have no words other than to thank @GovNedLamont and state legislators for their collaboration and support.", "2020-06-26T20:08:21.000Z": "With a 0.8% positive rate, today's new cases are one of the lowest rates to date since the start of the pandemic. Quote Tweet Governor Ned Lamont @GovNedLamont UPDATE: Daily COVID-19 data in Connecticut\n\n- 46,059 people have tested positive (+65)\n- 4,307 people have died (+9)\n- 127 people are currently hospitalized (+5)\n- 414,889 tests have been reported (+7,922)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-26T20:02:40.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 46,059 people have tested positive (+65)\n- 4,307 people have died (+9)\n- 127 people are currently hospitalized (+5)\n- 414,889 tests have been reported (+7,922)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-26T18:13:15.000Z": "Connecticut is the 4th most innovative state in the nation, according to Bloomberg @business 's 2020 State Innovation Index. California, Massachusetts Rank as Most Innovative States America's top two most-innovative states share similar paths to success. bloomberg.com", "2020-06-26T16:25:00.000Z": "We have made difficult decisions throughout this pandemic, but we have proven to make many of the right decisions. Quarantining travelers from states with hot spots is meant to protect our residents and maintain our incredible public health progress.", "2020-06-25T14:29:33.000Z": "NEW: State officials are pointing to reopened bars as a cause of local spikes in coronavirus cases. Bars are tailor-made for the spread of the virus, with a cacophony of conversations that require raised voices and alcohol. : @jordanrau & @LizLaw1126 Packed Bars Serve Up New Rounds Of COVID Contagion State officials are pointing to reopened bars as a cause of local spikes in coronavirus cases. Bars are tailor-made for the spread of the virus, with a cacophony of conversations that require raise khn.org", "2020-06-26T10:59:19.000Z": "Even with this great news, please continue to wear your mask and social distance. Quote Tweet Governor Ned Lamont @GovNedLamont Compared to where we were over two months ago, we couldn't be more proud of the low case numbers you see today-but we have to keep doing everything we've been doing to keep them down. Wear a mask, remain socially distant and get tested. Keep it up, Connecticut!", "2020-06-25T22:04:34.000Z": "ICYMI: Watch today's news briefing outlining our back-to-school plans for students to return to the classroom for the 2020-21 academic year. Governor Lamont's June 25, 2020 4PM Coronavirus Update and School... Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts, including the announcement of the back-to-sch... youtube.com", "2020-06-25T21:49:58.000Z": "Over the last 7 days, there were 293 new cases of COVID-19 in CT.\n\nOf these, 265 were people who reside in the community, and 28 were people in congregate settings (nursing homes, assisted living, correctional facilities).\n\nHere's a map showing the distribution of the 265 cases.", "2020-06-25T20:24:48.000Z": "Working with public health experts and the support of our educators, we are preparing a number of steps that protect the health and safety of everyone who makes contact with our school system.\n\nCheck out an overview of our plan for the 2020-21 school year: Governor Lamont Announces Plans for the 2020-21 School Year Amid the Ongoing COVID-19 Pandemic Governor Ned Lamont and Education Commissioner Miguel Cardona today announced details of the framework to allow all students - in all school districts statewide - the opportunity to have access to... portal.ct.gov", "2020-06-25T20:03:13.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 45,994 people have tested positive (+81)\n- 4,298 people have died (+11)\n- 122 people are currently hospitalized (-2)\n- 406,967 tests have been reported (+6,576)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-25T20:00:28.000Z": "HAPPENING NOW: News briefing to discuss the impact of COVID-19 on the upcoming school year WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-25T18:42:53.000Z": "Nonprofits are on the frontlines of the COVID emergency, providing critical services to vulnerable people. #ConnectiCorps is a great way to provide support to nonprofits and offer young people the opportunity for public service in these times of challenge Governor Lamont Announces ConnectiCorps Service Opportunity Governor Ned Lamont, in partnership with the Connecticut Community Nonprofit Alliance and the Hartford Foundation for Public Giving, today announced the launch of ConnectiCorps, a new community... portal.ct.gov", "2020-06-25T17:27:07.000Z": "Signs have gone up at @Bradley_Airport informing people about the travel advisory that is now in effect.\n\nThose arriving from states with high rates of COVID-19 should self-quarantine for 14 days.\n\nThe list of states will continue to be updated here: https:// portal.ct.gov/Coronavirus/Co vid-19-Knowledge-Base/Travel-In-or-Out-of-CT ", "2020-06-25T17:19:51.000Z": "I will hold a news briefing today at 4PM with @EducateCT Commissioner Miguel Cardona ( @teachcardona ) to discuss the impact of #COVID19 on the upcoming school year. WATCH LIVE Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-25T12:25:08.000Z": "Compared to where we were over two months ago, we couldn't be more proud of the low case numbers you see today-but we have to keep doing everything we've been doing to keep them down. Wear a mask, remain socially distant and get tested. Keep it up, Connecticut!", "2020-06-25T11:14:07.000Z": ". @GovNedLamont speaks out about why CT, NY and NJ state governors have mandated a quarantine for people arriving from nine \"hot spot\" states. https:// gma.abc/2Z74g5n", "2020-06-24T20:50:59.000Z": "Connecticut has made incredible strides in flattening the COVID curve, decreasing hospitalizations and positivity rates-but not without regional leadership from neighboring governors. Our coalition of states have worked tirelessly and together to combat this virus.", "2020-06-24T20:10:34.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 45,913 people have tested positive (+14)\n- 4,287 people have died (+10)\n- 124 people are currently hospitalized (-14)\n- 400,391 tests have been reported (+1,175)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-24T15:32:36.000Z": "In New York City making an announcement. Watch Live: Andrew Cuomo @NYGovCuomo In New York City making an announcement. Watch Live: pscp.tv", "2020-06-24T20:08:28.000Z": "Quote Tweet Meg Tirrell @megtirrell Cities with fastest #COVID19 case growth in past week:\n1. Phoenix \n2. Tampa\n3. San Antonio\n4. Orlando\n5. Austin\n\nLargest slowdowns:\n1. Bridgeport\n2. Indianapolis\n3. Detroit\n4. Hartford\n5. New Haven\n\n(Via Evercore ISI) Show this thread", "2020-06-24T19:33:17.000Z": "COVID-19 tests are available at @CHCConnecticut locations across Connecticut every weekday from 9AM-1PM.\n \nFree of charge. Even if you don't have symptoms.\n \nWalk up. Drive up. Get tested.", "2020-06-24T19:33:14.000Z": "Las pruebas COVID-19 están disponibles en las ubicaciones de @CHCConnecticut en Connecticut todos los días de la semana de 9 a.m. a 1 p.m.\n\nGratis. Incluso si no tienes síntomas.\n\nHágase la prueba.", "2020-06-24T18:30:47.000Z": "Today, @NYGovCuomo , @GovNedLamont , and I announced a joint incoming travel advisory - all visitors to our region from states highly-impacted by #COVID19 should self-quarantine for 14 days.\n \nWe MUST keep our region moving in the right direction and tri-state residents safe.", "2020-06-24T16:56:58.000Z": "NY, NJ and CT will continually update and publish on their respective websites a list of states to which the new advisory applies.\n\nAs of today, the list of states includes: Alabama, Arkansas, Arizona, Florida, North Carolina, South Carolina, Texas, Utah & Washington. Quote Tweet Andrew Cuomo @NYGovCuomo I am announcing with @GovMurphy and @GovNedLamont a joint travel advisory. All individuals traveling from states with significant community spread of COVID into NY, NJ, or CT must quarantine for 14 days.\n\nThis travel advisory is effective midnight tonight.", "2020-06-24T16:57:47.000Z": "Connecticut is one of only 4 states in the nation that are on track to contain COVID-19, according to a study by @CovidActNow .\n\nThanks to our residents who are wearing a and taking this seriously.\n\nLet's keep the trend moving in the right direction.", "2020-06-24T16:38:42.000Z": "Let's see....oh, CT only state down 50% on Covid cases. \nWell done. \nCongrats ... @GovNedLamont ", "2020-06-24T15:39:30.000Z": "I am announcing with @GovMurphy and @GovNedLamont a joint travel advisory. All individuals traveling from states with significant community spread of COVID into NY, NJ, or CT must quarantine for 14 days.\n\nThis travel advisory is effective midnight tonight.", "2020-06-24T16:10:30.000Z": "We're implementing a travel advisory w/ @NYGovCuomo & @GovMurphy . Individuals traveling from states with significant community spread of COVID into CT, NY, or NJ need to self-quarantine for 14 days.\n\nGoes into effect tonight at midnight. We'll have more on our website shortly.", "2020-06-24T16:03:09.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut. WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-24T15:32:58.000Z": "HAPPENING NOW: Governor Lamont, @NYGovCuomo and @GovMurphy are making an announcement regarding #COVID19 and interstate travel. WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-24T14:30:06.000Z": "The Connecticut Department of Motor Vehicles reopened select offices on June 23, 2020. Services will be offered by appointment only. #CTDMV All details here CT DMV Partially Reopens by Appointment Only The Connecticut Department of Motor Vehicles will reopen select offices on June 23, 2020. Services will be offered by appointment only portal.ct.gov", "2020-06-23T22:32:22.000Z": "The latest map on @CNN from @JohnsHopkins today has us looking stellar. The only reason for this is that we followed protocols. The only way this keeps up is if we keep wearing our masks , washing our hands and minding our distance between ourselves & others. We've got this #CT !", "2020-06-23T21:12:17.000Z": ". @GovNedLamont and @CTDMV announced today the in-person services that are partially resuming at DMV branches across the state. Appointments are required. To schedule your appointment, visit http:// portal.ct.gov/dmv .", "2020-06-23T21:25:04.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 45,899 people have tested positive (+117)\n- 4,277 people have died (+14)\n- 138 people are currently hospitalized (-2)\n- 401,986 tests have been reported (+6,396)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-23T21:09:01.000Z": "ICYMI: Watch today's news briefing announcing that the @CTDMV has partially reopened for certain in-person services News briefing on the reopening of certain Connecticut DMV services The Connecticut Department of Motor Vehicles reopened select offices today for in-person services, however due to the pandemic customers are required to make... youtube.com", "2020-06-23T16:35:51.000Z": "I'm with you, @GovernorTomWolf . Working together to fight this virus without politics is the right approach. Our residents and businesses are looking out for each other. Quote Tweet Governor Tom Wolf @GovernorTomWolf I send my utmost gratitude to Pennsylvanians and to the leadership and residents of other Northeastern states for the work they've done to flatten the curve.\n \nWe couldn't make the progress we are seeing without everyone working together.", "2020-06-23T16:11:36.000Z": "Appointments are now being offered, click below to learn more #CTDMV  Make an Appointment portal.ct.gov", "2020-06-23T15:14:56.000Z": "HAPPENING NOW: News briefing to announce the details of certain in-person services that are now available at @CTDMV  WATCH LIVE: CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-23T14:32:48.000Z": "Certain in-person services at @CTDMV are reopening today, however appointments are required in advance. We'll discuss the details during our news briefing at 11:15AM. WATCH LIVE: Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-23T00:55:43.000Z": "Knocking on a door near you! Quote Tweet Connecticut Post @connpost Bysiewicz takes to the street to try to lift Bridgeport census numbers https:// trib.al/cUAtYR6", "2020-06-22T21:44:12.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 Governor Lamont's June 22, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-06-22T21:00:00.000Z": ". @CTvisit is asking all hotels, restaurants, casinos, tourist attractions, entertainment venues, historic sites, and cultural and arts institutions to share their best #GoodToCT pictures for a chance to be included in their new \"So Good to See You, Connecticut!\" campaign.", "2020-06-22T20:08:31.000Z": "COVID-19 hospitalizations in Connecticut peaked around April 22 when there were nearly 2,000 people with the virus who were hospitalized.\n\nToday there are 140 people with COVID-19 in the hospital.", "2020-06-22T20:01:20.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 45,782 people have tested positive (+27)\n- 4,263 people have died (+3)\n- 140 people are currently hospitalized (-9)\n- 395,590 tests have been reported (+2,115)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-22T19:59:26.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-22T14:34:49.000Z": "CT DOC COVID-19 update:", "2020-06-22T19:00:01.000Z": "Here's an overview of the new #PPP loan rules giving small business owners greater flexibility. Small biz owners now have more time to use their PPP loans www.hartfordbusiness.com", "2020-06-22T16:28:44.000Z": "I will hold a news briefing today at 4:00PM to discuss the latest updates on COVID-19. WATCH LIVE Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-21T18:04:31.000Z": "To learn, sometimes you have to listen. I recently gathered with state and local leaders in Bloomfield to hear about real change and actual solutions we can make here in our state and communities. We've had moments like this before and must not waste them.", "2020-06-21T16:50:47.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 45,755 people have tested positive (+40)\n- 4,260 people have died (+9)\n- 149 people are currently hospitalized (-1)\n- 393,475 tests have been reported (+3,772)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-20T20:55:57.000Z": "Businesses ask Congress to bail out governments, sensing tax targets on their backs Estimates show the deficit nationwide across state and local governments could near $1 trillion. politico.com", "2020-06-20T18:24:30.000Z": "While @Apple is making the difficult decision to close retail stores in states that are experiencing #COVID flare ups-here in CT, they are safety open. That's because so many are following the respectful protocol of wearing a mask. Thank you, Connecticut! #IfYouHaveToAskWearAMask", "2020-06-20T16:04:53.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 45,715 people have tested positive (+158)\n- 4,251 people have died (+13)\n- 150 people are currently hospitalized (-22)\n- 389,703 tests have been reported (+11,772)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-19T21:44:32.000Z": "We need to learn from & listen to one another so we can create a movement of real change & real reform.  \n\nThank you to the local & state leaders from Bloomfield, Bridgeport, Hartford, New Haven & New London who joined us to discuss ways to create equality for all #JuneteenthDay", "2020-06-19T21:37:56.000Z": "Three days in a row where new cases are less than 2% of total tests and Connecticut is now estimated to have the lowest rate of transmission (Rt) in the nation. https:// rt.live Wear those and let's keep it there. Quote Tweet Governor Ned Lamont @GovNedLamont UPDATE: Daily COVID-19 data in Connecticut\n\n- 45,557 people have tested positive (+117)\n- 4,238 people have died (+12)\n- 172 people are currently hospitalized (-4)\n- 377,931 tests have been reported (+7,293)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-19T21:21:35.000Z": "Schools aren't immune from the systemic racism still in place from 1865 (and our nation's founding). \n\nAs we reflect on that history, let's commit to doubling down on doing all we can to advance racial equity & access in our schools. Together, let's #BeTheChange ! #JuneteenthDay Quote Tweet Governor Ned Lamont @GovNedLamont Today I've declared June 19, 2020 as #JuneteenthDay in Connecticut.\n\nBut simply recognizing a day and educating people about our country's history is not enough. We must do more. We must take action to reach the goal of a more equal and just society.", "2020-06-19T20:07:20.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 45,557 people have tested positive (+117)\n- 4,238 people have died (+12)\n- 172 people are currently hospitalized (-4)\n- 377,931 tests have been reported (+7,293)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-19T16:27:12.000Z": "Holding a chat right now with @jahimes . Watch live: Representative Jim Himes on Facebook Watch Live with Governor Lamont and Congressman Himes facebook.com", "2020-06-19T15:27:34.000Z": "Today I've declared June 19, 2020 as #JuneteenthDay in Connecticut.\n\nBut simply recognizing a day and educating people about our country's history is not enough. We must do more. We must take action to reach the goal of a more equal and just society.", "2020-06-18T21:11:17.000Z": "For those following the CT COVID-19 data closely, some new insights added this week by the hard working team at @CTDPH include recent cases and testing town-by-town, splitting out community and congregate settings. Quote Tweet Governor Ned Lamont @GovNedLamont Over the last 7 days, 30,484 COVID-19 tests were conducted in CT.\n\n870 tested positive. Of those, 561 were people who tested positive for the 1st time.\n\nOf the new cases, 391 (70%) were among people in the community and 170 (30%) were among people who live in congregate settings.", "2020-06-18T20:10:39.000Z": "FREE TESTING !!!! Friday, June 19th \n10:30am - 3:30pm\nTrumbull Gardens\n505 Trumbull Avenue\n\n No appointment, no symptoms required, it's FREE! #BPTUpdates  #BPTTesting  #Coronavirus  #CovidTesting", "2020-06-18T20:08:15.000Z": "Over the last 7 days, 30,484 COVID-19 tests were conducted in CT.\n\n870 tested positive. Of those, 561 were people who tested positive for the 1st time.\n\nOf the new cases, 391 (70%) were among people in the community and 170 (30%) were among people who live in congregate settings.", "2020-06-18T20:06:35.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 45,440 people have tested positive (+81)\n- 4,226 people have died (+7)\n- 176 people are currently hospitalized (-10)\n- 370,638 tests have been reported (+4,722)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-18T18:10:43.000Z": "Dreamers are integral members of our society. They make our country better and stronger. Any decision to remove them is heartless. Good to see that #SCOTUS today upheld legal protections for young immigrants. Quote Tweet NBC Connecticut @NBCConnecticut BREAKING: U.S. Supreme Court has rejected a bid by the Trump administration to end legal protections for young immigrants under the Deferred Action for Childhood Arrivals - or DACA -- Program. http:// nbcct.co/qDNYkmz  #NBCCT", "2020-06-18T17:22:55.000Z": "CT State Parks has immediate openings for campground staff at #Hammonasset Beach and #Macedonia Brook locations among others. Apply at http:// jobapscloud.com/ct", "2020-06-18T17:37:41.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 Governor Lamont's June 18, 2020 11AM Coronavirus Update Governor Ned Lamont's 11:00 a.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronavir... youtube.com", "2020-06-18T16:51:17.000Z": "SCOTUS affirmed what we have been saying all along - #Dreamers are members of our communities and any attempt to change that would be unjust and wrong.\n\nWe should be doing everything in our power to make our country stronger. This attempt to end DACA would have done the opposite. Quote Tweet NPR @NPR BREAKING: The Supreme Court has upheld DACA - handing a dramatic victory to immigration advocates and allowing the program that has permitted about 650,000 \"Dreamers\" to stay and work in the U.S. legally to continue. https:// trib.al/kz3AS0a", "2020-06-18T15:01:56.000Z": "HAPPENING NOW:  News briefing to discuss the latest updates on COVID-19 in Connecticut. WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-18T13:30:35.000Z": "I will hold a news briefing today at 11AM to discuss the latest updates on COVID-19. WATCH LIVE Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-17T15:22:35.000Z": "Connecticut Gov. Ned Lamont signs an order to ban chokeholds and increase state police transparency: \"Policing is about trust, and trust means involving the community. So obviously, a chokehold sent a signal that this is not about trust in the community\" https:// cnn.it/37AbYsG", "2020-06-17T21:00:01.000Z": "Today @SBAgov and @USTreasury posted a revised, borrower-friendly #PPP loan forgiveness application implementing the #FlexibilityAct and also published a new EZ version. Click the link to find out more details. SBA & Treasury Announce New EZ and Revised Forgiveness Applications home.treasury.gov", "2020-06-17T21:00:00.000Z": "It's been a priority of mine to build a team that reflects the amazing diversity of our state.\n\nThis includes our recruitment efforts for law enforcement.\n\nJoining the @CT_STATE_POLICE is an amazing place to make a difference.", "2020-06-17T20:07:38.000Z": "We're seeing the right trends in CT.\n\nOut of the 6,430 tests since yesterday's update, only 80 came back positive - 1.2%.\n\nWe also have the lowest hospitalizations since mid-March.\n\nWe're one of the exceptions to the trends around the country. Together, let's keep it that way.", "2020-06-17T20:06:47.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 45,429 people have tested positive (+80)\n- 4,219 people have died (+9)\n- 186 people are currently hospitalized (-15)\n- 365,916 tests have been reported (+6,430)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-17T19:50:31.000Z": "Quote Tweet Mark Zinni @MarkZinni I actually find there is a lot of pride here in people who WANT to wear masks and maintain social distancing.\n\nThat's nice to see, there is an attitude that we can beat this -- together we can keep making progress. twitter.com/GovNedLamont/s", "2020-06-17T19:36:53.000Z": "Incredible vineyards and homegrown wines right here in Connecticut.", "2020-06-17T19:33:28.000Z": "Today, CT begins Phase 2 of our state's reopening. Although 95% of our economy is now open, it's important we safely support many of our favorite businesses. I visited @JEdwardsWinery in North Stonington to hear how they've fared during the pandemic and plan to open up.", "2020-06-17T19:15:31.000Z": "Connecticut is one of only a handful of states to receive a \"green\" rating because of our efforts to make progress beating back COVID-19.\n\nThe people of our state are having an impact.\n\nIt's up to each of us to continue doing our part to prevent a renewed spread of this virus.", "2020-06-17T18:17:31.000Z": "Thank you again to the hard working farmers growing all of our favorite foods. Be sure to support your local farm as they've supported all of us. #nofarmsnofood", "2020-06-17T18:13:37.000Z": "This morning I joined @LGSusanB and DOAG Comm. @bryanhurlburt along with local leaders for a tour of @FullHeartFarm in #Ledyard and to thank local farmers for working to supply CT families, food banks and grocery stores with affordable and nutritious food during the pandemic.", "2020-06-17T15:43:26.000Z": "FREE TESTING TODAY!!!! No appointment, no symptoms required, it's FREE! \n\nWednesday, June 17th \n1:00pm - 5:00pm\nCentral High School\n\nEnter from Madison Ave - just before / after Brasa's restaurant or Micalizi's. #BPTUpdates  #BPTTesting  #Coronavirus  #CovidTesting", "2020-06-16T21:54:32.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 Governor Lamont's June 16, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-06-16T20:54:04.000Z": "@GovNedLamont reported the lowest number of COVID19 deaths today as the state prepares for a second round of business openings on Wednesday. Huge thanks to our healthcare workers for helping Connecticut get healthy and back to work. Lamont Reports Lowest Number Of One-Day COVID-19 Deaths Connecticut reported its lowest number of one-day deaths due to the coronavirus Monday, as the state prepares for a second round of business openings wnpr.org", "2020-06-16T20:02:53.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 45,349 people have tested positive (+114)\n- 4,210 people have died (+6)\n- 201 people are currently hospitalized (-2)\n- 359,486 tests have been reported (+5,041)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-16T20:00:03.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-16T18:00:00.000Z": "Tomorrow marks the #reopening date for phase 2 businesses in #CT . Here's a reminder of what types of businesses will be allowed to #reopen and how they'll operate. Here's a list of what's reopening in Connecticut on Wednesday www.courant.com", "2020-06-16T16:12:02.000Z": "I will hold a news briefing today at 4:00PM to discuss the latest updates on COVID-19. WATCH LIVE Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-16T14:00:03.000Z": "HAPPENING NOW: News briefing with the #CTGeneralAssembly 's Bipartisan Women's Caucus regarding the impact of COVID-19 on nursing homes. WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-16T03:13:47.000Z": "This. Quote Tweet Governor Ned Lamont @GovNedLamont \"As we begin to work on proposals, I am excited that this administration is open to having that conversation to figure out how collectively we can come up with some legislation that has teeth.\" - @RepBMcGee  https:// courant.com/news/connectic ut/hc-news-lamont-police-executive-order-20200615-q43cff7bdbd5pabktlqf4eqygu-story.html ", "2020-06-16T00:10:46.000Z": "As @GovNedLamont moves us to Phase 2 of CT's reopen we are well positioned on a range of key metrics and one of only six states to earn a \"green\" rating.  How do we stay green?  Follow the guidelines and wear your Tracking Our COVID-19 Response - covidexitstrategy.org Each state's progress towards a new normal covidexitstrategy.org", "2020-06-15T22:58:28.000Z": "It was a great opportunity to discuss job growth and see the latest economic development happenings in #Danbury ! Quote Tweet Mayor Mark Boughton @MayorMark Thank you Governor Lamont for stopping by our new Amazon facility. Work is already under way! #DanburyPride  https:// ift.tt/2ufTJ7w", "2020-06-15T22:41:05.000Z": "\"As we begin to work on proposals, I am excited that this administration is open to having that conversation to figure out how collectively we can come up with some legislation that has teeth.\" - @RepBMcGee Gov. Lamont imposes reforms on Connecticut state police, including chokehold ban, body camera... Gov. Ned Lamont announced Monday he will impose a series of reforms on the state police department, including a ban on chokeholds, a mandate that officers use body cameras and dashboard cameras and... courant.com", "2020-06-15T22:17:33.000Z": "\"It's a signal that the LGBT community has rights and you cannot push us aside and say we're not people or we don't have the same rights as everyone else...\" said Jessica Riley, a transgender businesswoman who lives in Old Saybrook. 'They finally got it right': LGBTQ advocates, Connecticut officials applaud Supreme Court discrim... Job discrimination protections long granted to LGBTQ employees in Connecticut are now the law throughout the U.S., following a Supreme Court decision applauded by local advocates and officials Monday. courant.com", "2020-06-15T22:13:41.000Z": "The data on newest class of @CT_STATE_POLICE recruits is showing some improvements in our efforts to increase diversity.\n\nHaving a police force that reflects the people who live in our state is important, and I want to make sure we continue these efforts. https:// cspnews.org/state-police-s taffing-demographics ", "2020-06-15T21:34:15.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 and the announcement regarding today's executive order on police use of force and accountability Governor Lamont's June 15, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-06-15T20:27:03.000Z": "Here is the executive order that I signed today on police use of force and accountability.\n\nThis is just one step. Working with our partners in the legislature and with input from the community, I want this conversation to continue so that we can enact further, meaningful reforms", "2020-06-15T20:06:54.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 45,235 people have tested positive (+147)\n- 4,204 people have died (+3)\n- 203 people are currently hospitalized (-2)\n- 354,445 tests have been reported (+7,255)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-15T19:59:32.000Z": "HAPPENING NOW: News briefing to discuss the latest updates in Connecticut. WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-15T19:44:05.000Z": "I'm going to sign an executive order this afternoon regarding police accountability and transparency. Will announce details at my news briefing today at 4PM.", "2020-06-15T18:59:47.000Z": "I love this state. Quote Tweet Governor Ned Lamont @GovNedLamont It feels especially right to have the pride flag on top of the State Capitol building today.\n\nHappy #PrideMonth everyone!", "2020-06-15T17:18:39.000Z": "It feels especially right to have the pride flag on top of the State Capitol building today.\n\nHappy #PrideMonth everyone!", "2020-06-15T16:17:33.000Z": "CT Drivers, keep an eye out for our crews mowing along highways and state routes to ensure safe travel and sightlines. Be prepared to slow down & give Highway Maintenance crews plenty of room to work. This #MowingMonday , teams spotted on I-84 in Farmington.", "2020-06-15T16:06:16.000Z": "I will hold a news briefing today at 4:00PM to discuss the latest updates on COVID-19. Watch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-15T16:05:03.000Z": "Happy #PrideMonth !", "2020-06-15T15:40:18.000Z": "Nobody should be fired because of who they love or the gender in which they identify.\n\nThis decision is a long overdue win for LGBTQ Americans and a signal that despite the best efforts of the current administration, the US continues to stand for equality and justice for all. Quote Tweet CNN @CNN BREAKING: Federal civil rights law protects gay, lesbian and transgender workers, the Supreme Court rules. The landmark ruling will extend protections to millions of workers nationwide and is a defeat for the Trump administration. https:// cnn.it/37v2X45 Show this thread", "2020-06-13T15:30:10.000Z": "Join us 6/17 from 12:30 - 1:30 p.m. for a virtual volunteer recruitment event! We are looking for volunteers to help support our teams collecting lifesaving blood. Please join us to learn more about how you can volunteer with the Red Cross! RSVP Here: https:// bddy.me/3fn6X9y .", "2020-06-14T20:27:18.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 45,088 people have tested positive (+94)\n- 4,201 people have died (+15)\n- 205 people are currently hospitalized (-28)\n- 347,190 tests have been reported (+4,852)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-13T19:15:15.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 44,994 people have tested positive (+305)\n- 4,186 people have died (+27)\n- 233 people are currently hospitalized (-11)\n- 342,338 tests have been reported (+13,985)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-12T23:18:57.000Z": "Wake up, Hartford - wear your mask!", "2020-06-12T22:54:53.000Z": "At a time when the rest of the country is having a conversation about what we can do to eliminate discrimination, the Trump administration is going the extra mile to do what they can to increase it. This decision is unnecessarily harsh on LGBTQ Americans and is a step backward. Quote Tweet POLITICO @politico The Trump administration formally rolled back an Obama-era policy that protected LGBTQ patients from discrimination and required robust language translation services https:// politico.com/news/2020/06/1 2/trump-lgbtq-patient-protections-315819 ", "2020-06-12T22:16:14.000Z": "Thank you @GovNedLamont for spending some time answering my constituents' concerns today Quote Tweet jodi latina @jodilatina8 ... @GovNedLamont  on a business tour with ... @RepBMcGee  in Hartford's north end to talk about reopening the economy and race relations. ... @WTNH  ... @ctcapitolreport  #dunnriver  #Jamaican  #food", "2020-06-12T20:32:25.000Z": "Rollin Cook has been a reliable, steady hand at @CTCorrections , and I am grateful for his service and leadership. I can't thank him enough for all of the work and thoughtfulness he has brought to the position. Governor Lamont Announces Correction Commissioner Rollin Cook to Depart Service With the State of... Governor Ned Lamont today announced that Department of Correction Commissioner Rollin Cook plans to depart his position with the State of Connecticut effective July 1, 2020. portal.ct.gov", "2020-06-12T20:04:48.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 44,689 people have tested positive (+228)\n- 4,159 people have died (+13)\n- 244 people are currently hospitalized (-2)\n- 328,353 tests have been reported (+8,309)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-12T19:30:00.000Z": "In preparation for Phase 2 #reopening , here's an overview of some key guidelines that #CT businesses in each sector must follow to #reopen to the public. Here is what you need to know about phase 2 www.fox61.com", "2020-06-12T00:31:45.000Z": "\"I've got to do everything I can to make sure that people have trust in the police and the police have trust in the community,\" @GovNedLamont on police reform: http:// bit.ly/2C2fn81", "2020-06-11T23:45:01.000Z": "When it comes to building confidence in our justice system and addressing the inequities that have persisted for too long, I don't want to wait.\n\nWorking with the legislature, it is critical for us to act quickly and with focus on these persistent issues.", "2020-06-11T22:41:11.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 in Connecticut Governor Lamont's June 11, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-06-11T22:06:14.000Z": "I will be participating in this discussion tonight at 8PM on @WTNH Quote Tweet WTNH News 8 @WTNH Join us tonight at 8p.m. for \"The State of Race\" - a candid discussion with the state's top leaders we hope will be a catalyst for positive change. https:// bit.ly/3e5zSPj?utm_me dium=social&utm_source=twitter_WTNH ", "2020-06-11T22:02:57.000Z": "Tune into @WFSBnews tonight at 7PM for this important conversation Quote Tweet Dennis House @DennisHouseTV Still time to submit questions for tonight's special Face the State on race and justice.  Join Juan Castillo @943WYBC and me on @wfsbnews as we talk with @GovNedLamont  @RepJahanaHayes  @Scotxe of @NAACPCT Ndidi Moses of @ctbar and Keith Mello @CT_PoliceChief @MilfordCT_PD", "2020-06-11T20:43:22.000Z": ". @GovNedLamont said it perfectly at his COVID-19 daily briefing today when responding to those who are asking when and where they should wear a mask: \"If you have to ask, wear a mask\".", "2020-06-11T20:14:20.000Z": "We've launched the #CTBackToWork Initiative.\n\nThis resource will help job seekers who've been impacted by the economic fallout from COVID-19. Search job openings in CT Obtain online skills job training Attend a virtual jobs fair event on June 16-18 Jobs and Resources portal.ct.gov", "2020-06-11T20:03:08.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 44,461 people have tested positive (+114)\n- 4,146 people have died (+26)\n- 246 people are currently hospitalized (-24)\n- 320,044 tests have been reported (+5,030)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-11T19:59:02.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19. Watch live CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-11T17:05:53.000Z": "In the wake of recent events, many of our Guardsmen share the pain felt by our fellow Americans. I challenge CTNG leaders to engage with their Soldiers and Airmen in meaningful discussions about current events. Together, we can learn, grow, and heal. #ConnecticutsHomeTeam", "2020-06-11T16:19:48.000Z": "I will hold a news briefing today at 4PM to discuss the latest updates on COVID-19. Watch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-10T23:11:20.000Z": ". @CHHospital has worked tirelessly caring for residents throughout Northwest Connecticut and combating coronavirus. Today I met with their leadership team for a tour, to thank staff for saving countless lives and hear how they brought their hospitalization rate to zero.", "2020-06-10T22:15:03.000Z": "Thanks @GovNedLamont for visiting Charlotte Hungerford Hospital with Rep Michelle Cook and me today, and to Dr Scalise for sharing medical expertise about fighting #COVID19 at #CHH , which now has no infected patients. #ListenToScience  #Torrington", "2020-06-10T20:02:01.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 44,347 people have tested positive (+168)\n- 4,120 people have died (+23)\n- 270 people are currently hospitalized (-23)\n- 315,014 tests have been reported (+4,360)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-10T19:51:19.000Z": "Thank you Friendly Hands for your great work helping Torrington families - great to see Rep Cook and @GovNedLamont out there! Quote Tweet Governor Ned Lamont @GovNedLamont So many incredible nonprofits are stepping up all throughout CT during this pandemic-including the Friendly Hands Food Bank, which is helping families in need today until noon @ Torrington Middle School & will be doing so through August. Joined Rep. Cook this morning. Show this thread", "2020-06-10T15:23:35.000Z": "Thanks again for all you do for those in need!", "2020-06-10T15:21:23.000Z": "So many incredible nonprofits are stepping up all throughout CT during this pandemic-including the Friendly Hands Food Bank, which is helping families in need today until noon @ Torrington Middle School & will be doing so through August. Joined Rep. Cook this morning.", "2020-06-10T13:48:50.000Z": "I want our front line workers getting raises, but Connecticut as a state needs to defer other raises to lead by example as we move through this crisis.", "2020-06-10T13:48:06.000Z": "I treasure the people on the front lines of our state everyday-especially those who have been fighting COVID. We've seen Connecticut residents furloughed, laid off, and take pay cuts.", "2020-06-10T11:22:53.000Z": "We've learned a lot during this pandemic. When I was first elected, I wanted to ensure we were doing all we could to work together across the aisle and across various sectors by finding ways to do things better while lifting silos.", "2020-06-09T22:37:28.000Z": "We have huge issues to tackle and a lot of hard work ahead, but that's what our constituents elected us to do. I am ready! #ctpolitics  #District19 Quote Tweet Governor Ned Lamont @GovNedLamont I've sent the leaders of the #CTGeneralAssembly the following letter notifying them of my intention to call the legislature into special session to resolve the issue of absentee ballots for the November election, and also to take action on police transparency and accountability.", "2020-06-09T21:49:07.000Z": "The time is now for the legislature to convene a special session. Thank you, Governor. Quote Tweet Governor Ned Lamont @GovNedLamont I've sent the leaders of the #CTGeneralAssembly the following letter notifying them of my intention to call the legislature into special session to resolve the issue of absentee ballots for the November election, and also to take action on police transparency and accountability.", "2020-06-09T21:24:54.000Z": "I've sent the leaders of the #CTGeneralAssembly the following letter notifying them of my intention to call the legislature into special session to resolve the issue of absentee ballots for the November election, and also to take action on police transparency and accountability.", "2020-06-09T20:22:00.000Z": "#CT businesses that are part of Phase 2 must self-certify that they understand and will follow all of their sector's rules before #reopening . Businesses can now self-certify here: https:// bit.ly/3f7GSuQ Self-Certify your business service.ct.gov", "2020-06-09T20:06:17.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 in Connecticut Governor Lamont's June 9, 2020 11:30AM Coronavirus Update Governor Ned Lamont's 11:30 a.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronavir... youtube.com", "2020-06-09T20:04:41.000Z": "More good news with the number of hospitalizations dropping and positive rate <2%. Amazing to see how we were able to flatten the curve after exponential growth in March/April to steady declines since through social distancing. Quote Tweet Governor Ned Lamont @GovNedLamont UPDATE: Daily COVID-19 data in Connecticut\n\n- 44,179 people have tested positive (+87)\n- 4,097 people have died (+13)\n- 293 people are currently hospitalized (-31)\n- 310,654 tests have been reported (+4,658)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-09T20:01:21.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 44,179 people have tested positive (+87)\n- 4,097 people have died (+13)\n- 293 people are currently hospitalized (-31)\n- 310,654 tests have been reported (+4,658)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-09T15:29:13.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 Watch live CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-09T15:25:11.000Z": "\"SHE NEEDED ME TO SAY YES\"\nHeather Kjos, a foster and adoptive mother from Westbrook, Connecticut, captivated the interest of TV Producers for the Live with Kelly and Ryan Show. Good News of the Day: Foster Mom Talks About Taking in Sick Child https:// kellyandryan.com/guide/june-8-2 020/?fbclid=IwAR0KtJ559n501eHxaH2Pgz6hcFRyUf2uQ9fYFj2elvEWG4B6v-ohAyK_Evc ", "2020-06-09T14:22:42.000Z": "OCR Resolves Complaints after State of Connecticut and Private Hospital Safeguard the Rights of Persons with Disabilities to Have Reasonable Access to Support Persons in Hospital Settings During COVID-19 OCR Resolves Complaints after State of Connecticut and Private Today, the Office for Civil Rights (OCR) at the U.S Department of Health and Human Services (HHS) announces that it has reached an Early Case Resolution (ECR) with the State of Connecticut after the hhs.gov", "2020-06-09T14:17:53.000Z": "I will hold a news briefing today at 11:30AM to discuss the latest updates on COVID-19. Watch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-08T23:00:20.000Z": "Lamont tells police accountability task force to 'pick up the pace' on recommendations for reform... Gov. Ned Lamont on Monday urged a special task force on police accountability to move quickly to propose reform measures in the aftermath of the murder of George Floyd in Minneapolis. courant.com", "2020-06-08T22:20:50.000Z": "\"Those police officers on scene [in Minneapolis], including those that stood around and did nothing, simply failed...  For the sake of the community, for the sake of good law enforcement officers everywhere and for the sake of our country, enough is enough.\" - @CT_STATE_POLICE", "2020-06-08T21:37:19.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 in Connecticut Governor Lamont's June 8, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-06-08T21:00:00.000Z": "The state has released #reopening guidelines for Phase 2 businesses. Read the guidelines to find out the safety measures and rules that these businesses must follow. Sector Rules and Certification for Reopen portal.ct.gov", "2020-06-08T20:02:00.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 44,092 people have tested positive (+124)\n- 4,084 people have died (+13)\n- 324 people are currently hospitalized (-9)\n- 305,996 tests have been reported (+5,715)\n\nFor more data, visit http:// ct.gov/coronavirus and click Data Tracker.", "2020-06-08T19:59:40.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-08T19:22:19.000Z": "As we prepare for the possibility of a second wave of COVID-19, this third-party report of Connecticut's nursing homes and assisted living facilities will analyze how the pandemic has been addressed at these locations and what can be improved. Governor Lamont Orders Independent Analysis of COVID-19 in Connecticut's Nursing Homes and Assisted... Governor Ned Lamont today announced that he is ordering an independent, third-party review to be conducted of the preparation and response to the COVID-19 pandemic inside of Connecticut's nursing... portal.ct.gov", "2020-06-08T18:12:46.000Z": "I will hold a news briefing today at 4PM to discuss the latest COVID-19 updates. Watch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-08T17:38:31.000Z": "The oldest continuously operated ferry service in the country--the Rocky Hill-Glastonbury Ferry--resumes operations on Saturday, June 20, 2020. Read more Connecticut River Ferries Resume Operations The Connecticut Department of Transportation today announced the resumption of service by the two ferry services across the Connecticut River, between Rocky Hill and Glastonbury and Chester and... portal.ct.gov", "2020-06-08T17:01:09.000Z": "HAPPENING NOW: Meeting of the Connecticut Police Transparency and Accountability Task Force WATCH LIVE  https:// youtu.be/etaKxjI95xY", "2020-06-08T15:20:40.000Z": "Thank you to everyone who invited me to join this service - I appreciate everything you are doing for the community. @reprosario128  http:// connecticut.news12.com/story/42219680 /dont-give-up-the-fight-gov-lamont-attends-outdoor-church-service-in-bridgeport ", "2020-06-08T15:02:29.000Z": "Today at 1PM, I will a participate in a meeting of the Connecticut Police Transparency and Accountability Task Force. Watch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/etaKxjI95xY", "2020-06-07T20:02:02.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 43,968 people have tested positive (+150)\n- 4,071 people have died (+16)\n- 333 people are currently hospitalized (0)\n- 300,281 tests have been reported (+6,807)\n\nFor more data sets, visit http:// ct.gov/coronavirus and click Data Tracker", "2020-06-07T19:27:38.000Z": "#COVID19 is still a serious threat to families across CT - but testing is a critical tool. I just got tested by a drive thru @cvspharmacy in #RockyHill . Fast, easy, painless, free. #staysafe", "2020-06-07T16:27:49.000Z": "Gracias por invitarme y por todo lo que hacen por la comunidad. Dios los bendiga.", "2020-06-07T16:27:47.000Z": "Esta mañana me uní a mis amigos @reprosario128 y Rep. Antonio Felipe en la Iglesia Bautista Emanuel. En donde cientos de personas se reunieron de manera segura desde sus vehículos para una mañana profundamente espiritual.", "2020-06-07T14:49:21.000Z": "La Fase 2 de nuestra reapertura comienza pronto. Hemos proporcionado reglas claras para las empresas para guiarlos durante esta nueva fase. Los requerimientos específicos por industria están disponibles para la Fase 2, que empieza el 17 de junio. Sector Rules for Reopen Review the rules for reopening businesses by sector portal.ct.gov", "2020-06-07T14:28:25.000Z": "Phase 2 of Connecticut's reopening efforts takes effect on June 17. Today we released a series of documents detailing safety protocols for businesses to follow during this phase. Sector Rules for Reopen Review the rules for reopening businesses by sector portal.ct.gov", "2020-06-06T21:36:23.000Z": "Connecticut's campgrounds will reopen on July 8.\n\nCampers can begin making new reservations for the season using the online reservation system beginning on June 20. Quote Tweet DEEP @CTDEEPNews Looking forward to going camping this summer? DEEP will be opening State Park and Forest campgrounds for tent and RV camping July 8. We're actively working to prepare campgrounds to offer safe recreation in compliance with health guidance.", "2020-06-06T20:29:26.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 43,818 people have tested positive (+358)\n- 4,055 people have died (+17)\n- 333 people are currently hospitalized (-17)\n- 293,474 tests have been reported (+8,160)\n\nFor more data sets, visit http:// ct.gov/coronavirus", "2020-06-06T18:44:30.000Z": "Welcome home and thank you for your service! Quote Tweet Maj. Gen. Fran Evon @CTNGTAG Great day to welcome home four of our Army Aviators who this afternoon returned from their deployment to the Middle East. Welcome Home! #connecticutshometeam", "2020-06-05T20:10:49.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 43,460 people have tested positive (+221)\n- 4,038 people have died (+31)\n- 350 people are currently hospitalized (-23)\n- 285,314 tests have been reported (+5,857)\n\nFor more data sets, visit http:// ct.gov/coronavirus", "2020-06-05T17:43:51.000Z": "Building trust between our communities and public safety officials is critical. Part of that is transparency and accountability. @10SDDem  @SteveStafstrom", "2020-06-05T16:29:29.000Z": "DDS has released a reopening timeline memo for day and employment services as well as visitation in residential settings. Please visit https:// portal.ct.gov/-/media/DDS/CO VID-19/DDS_reopening_timeline_memo_FINAL_6_5_20.pdf?la=en  to read the full memo. Connecticut Department of Developmental Services portal.ct.gov", "2020-06-05T14:58:51.000Z": "To avoid having Phase 2 of Connecticut's reopening efforts take effect during a busy Father's Day weekend, we're going to move it up a few days earlier to June 17.\n\nWe'll release additional safety guidance for businesses that fall under Phase 2 in the next couple of days.", "2020-06-05T12:52:45.000Z": "\"The moral arc of the universe bends at the elbow of justice.\" -MLK", "2020-06-05T12:28:42.000Z": "I'm going to call into #Bridgeport radio station @WICC600 in a few minutes to chat with @SheketoffNews about the latest updates here in Connecticut.\n\nShould be on the air around 8:30AM. Listen live: WICC-AM WICC600 wicc600.com", "2020-06-01T15:21:50.000Z": "Losing insurance either from your job is considered a Qualifying Life Event, opening a Special Enrollment Period. However you only have 60 days before or after coverage ends to apply through Access Health CT. If you have questions, we're here to help at http:// AccessHealthCT.com . GIF", "2020-06-04T18:35:33.000Z": "Effective June 29, the Judicial Branch is targeting the resumption of limited operations in four additional courthouse locations: the Judicial District courthouses in Danbury, Milford and Stamford, and the Geographical Area No. 11 in Danielson. More info: https:// jud.ct.gov/HomePDFs/opera tionsexpansion6420.pdf ", "2020-06-04T23:21:31.000Z": "More than 45 banks and credit unions in Connecticut have agreed to extend the mortgage relief program through July 30, giving homeowners one less thing to worry about during the COVID-19 crisis. @CTBanking Governor Lamont Provides Update on Connecticut's Coronavirus Response Efforts As the State of Connecticut continues taking actions in response to the global spread of coronavirus disease (COVID-19), Governor Ned Lamont provided the following updates as of 6:30 p.m. on Thursd... portal.ct.gov", "2020-06-04T22:49:02.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 in Connecticut Governor Lamont's June 4, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-06-04T20:26:51.000Z": "This first round of #COVID19 reimbursements to our towns and cities is only the beginning. We are reimbursing municipalities for their full cost of their expenses to date, and we stand with them amid the continued efforts to protect our communities. 404 Error Page portal.ct.gov", "2020-06-04T20:04:54.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 43,239 people have tested positive (+148)\n- 4,007 people have died (+18)\n- 373 people are currently hospitalized (-33)\n- 279,457 tests have been reported (+5,061)\n\nFor more data, visit http:// ct.gov/coronavirus and click \"Data Tracker.\"", "2020-06-04T20:01:35.000Z": "HAPPENING NOW: News briefing to discuss the latest COVID-19 updates in Connecticut WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-04T15:34:55.000Z": "I will hold a news briefing today at 4PM to discuss the latest COVID-19 updates in Connecticut.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-03T21:43:15.000Z": "ICYMI: Watch today's news briefing with the latest updates on COVID-19 in Connecticut Governor Lamont's June 3, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-06-03T21:23:11.000Z": ". @AAAHartford has reopened 8 of its stores and is now providing @CTDMV licensing services, however appointments must be made in advance.\n\nAs a reminder, all licenses expiring between March 10 and June 30 are automatically extended 180 days.\n\nMake an appt: https:// hartford.aaa.com/dmv-ct Quote Tweet AAA Hartford News @AAAHartfordNews We're back! @AAAHartford has reopened its 8 stores - including its @CTDMV licensing centers -- BY APPOINTMENT. Make an appt. HERE: https:// hartford.aaa.com/dmv-ct  #reopening", "2020-06-03T20:10:58.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 43,091 people have tested positive (+112)\n- 3,989 people have died (+17)\n- 406 people are currently hospitalized (-28)\n- 274,396 tests have been reported (+5,824)\n\nFor more data, visit http:// ct.gov/coronavirus and click \"Data Tracker.\"", "2020-06-03T20:07:41.000Z": "HAPPENING NOW: News briefing to discuss the latest updates in Connecticut. WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-03T19:25:14.000Z": "We're letting school districts know that they can begin holding in-person graduation ceremonies beginning July 6, following certain health and safety protocols.\n\nI'll have more details during my 4PM news briefing today. Tune in!", "2020-06-03T16:23:07.000Z": "I will hold a news briefing today at 4:00PM to discuss the latest updates in Connecticut.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-03T14:58:20.000Z": "Third round of emergency SNAP benefits coming for 108,000+ households, as announced in @GovNedLamont covid briefing. These extra benefits (avg $150) will be on EBT cards Friday, June 12. Details at http:// ct.gov/snap . TY @USDANutrition & all partners helping feed CT!", "2020-06-03T14:10:26.000Z": "Thank you @GovNedLamont for visiting us. We're glad you enjoyed the tour of our next-generation jet engines and seeing the health & safety measures that allow our expanded workforce to return. Quote Tweet Governor Ned Lamont @GovNedLamont I had an opportunity to visit the @prattandwhitney facility in #MiddletownCT today, and the work they are doing to keep their employees and the local community safe during the COVID-19 pandemic is truly impressive. (1/2) Show this thread", "2020-06-03T13:38:01.000Z": "This partnership, with the support of charitable funding from the philanthropic community through @4_connecticut , will support Connecticut residents who are otherwise excluded from receiving desperately needed federal COVID-19 emergency relief assistance. 404 Error Page portal.ct.gov", "2020-06-03T13:02:27.000Z": "HAPPENING NOW: News briefing to announce COVID-19 emergency relief for Connecticut residents who are ineligible from receiving assistance through federal pandemic programs. WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-03T12:45:18.000Z": "NOW AVAIL (devel. by ReOpen CT PK12 Subcommittee with input of educators, students, parents, public feedback & health officials) Rules for operating Summer School during #COVID19 : https:// tinyurl.com/y7qq3cf7 & Preparing for a Safe Return to Classroom Learning: https:// tinyurl.com/y7jzc8vy", "2020-06-03T00:50:52.000Z": "I commend @prattandwhitney for taking a thoughtful approach to the health of their employees as more people are returning to work.\n\nConnecticut is proud to have P&W as a driving force in making Connecticut an aerospace hub. (2/2)", "2020-06-03T00:49:17.000Z": "I had an opportunity to visit the @prattandwhitney facility in #MiddletownCT today, and the work they are doing to keep their employees and the local community safe during the COVID-19 pandemic is truly impressive. (1/2)", "2020-06-02T21:38:52.000Z": "ICYMI: Watch today's news briefing with the latest updates here in Connecticut Governor Lamont's June 2, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-06-02T20:07:05.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 42,979 people have tested positive (+239)\n- 3,972 people have died (+8)\n- 434 people are currently hospitalized (-20)\n- 268,572 tests have been reported (+9,252)\n\nFor more data, visit http:// ct.gov/coronavirus and click \"Data Tracker.\"", "2020-06-02T20:00:05.000Z": "HAPPENING NOW: News briefing to discuss the latest updates in Connecticut WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-02T18:23:51.000Z": "New data: #COVID19 cases and associated deaths at assisted living facilities in Connecticut, updated weekly: http:// data.ct.gov/d/wjua-euxh", "2020-06-02T16:21:28.000Z": "I will hold a news briefing today at 4PM to discuss the latest updates.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-02T15:12:21.000Z": "Great news--we're launching online food purchasing for SNAP enrollees today! Details at http:// ct.gov/snap . Thanks to first participating retailers @ShopRiteStores  @Walmart  @Amazon , plus @USDANutrition  @GovNedLamont  @RosaDeLauro  @211CT  @EndHungerCT  @CAFCA_Inc & all partners", "2020-06-02T13:52:43.000Z": "+1,500 @WaterburySchool 1st Graders were made very happy yesterday! They all rec'd @LEGO_Group Replay brick boxes to support the Power of Play & quality at-home learning options. @GovNedLamont Learn From Home Taskforce & LEGO ensuring more donations in coming months. @VernaRuffin", "2020-06-01T23:10:29.000Z": "Thank you @RepJahanaHayes for your powerful words & insights today during @GovNedLamont 's update, specifically about the role educators can & must play. You continue to be such a beacon, such a positive leader, inspiring teachers, students, politicians & citizens alike. Quote Tweet Governor Ned Lamont @GovNedLamont . @RepJahanaHayes : \"It is our responsibility to hear people, to not try to explain away their concerns or tell them what they feel or why they should be feeling this, but just to sit and listen.\"", "2020-06-01T22:37:00.000Z": "ICYMI: Watch this afternoon's news briefing Governor Lamont's June 1, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-06-01T22:23:22.000Z": ". @RepJahanaHayes : \"It is our responsibility to hear people, to not try to explain away their concerns or tell them what they feel or why they should be feeling this, but just to sit and listen.\"", "2020-06-01T22:23:06.000Z": "We've got to do a better job of building a government that reflects the diversity of the people it serves.", "2020-06-01T20:07:26.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 42,740 people have tested positive (+539)\n- 3,964 people have died (+20)\n- 454 people are currently hospitalized (-27)\n- 259,320 tests have been reported (+9,274)\n\nFor more data, visit http:// ct.gov/coronavirus and click \"Data Tracker.\"", "2020-06-01T20:01:50.000Z": "HAPPENING NOW: News briefing to discuss the latest updates in Connecticut WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-06-01T15:20:19.000Z": "Just a gu(a)y on the roof of the CT State Capitol raising the #Pride flag in support of and in solidarity with my fellow #LGBTQ brothers and sisters.  Show some extra love this month, y'all. We need it. #PrideMonth2020", "2020-06-01T16:09:15.000Z": "Misinformation can be dangerous. \n\nWe all have questions about #COVID19 , and we need accurate information. \n\nFor information from official sources and credible subject matter experts. visit http:// ct.gov/coronavirus  @CT_STATE_POLICE  @LtFoley", "2020-06-01T16:24:37.000Z": "I will hold a news briefing to discuss the latest updates today at 4:00PM.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-06-01T15:06:06.000Z": "I'm about to participate in a White House video conference w/ POTUS, law enforcement, national security officials and the nation's governors. It's my hope that we can have an honest conversation about our justice system, it's impact on Americans and the safety of our communities", "2020-06-01T15:04:14.000Z": "It fills me with much pride to officially proclaim June as LGBTQ Pride Month in the State of Connecticut. We will always celebrate the diversity of our community here in our state, and we will continue doing everything we can to end discrimination in all its forms.", "2020-06-01T12:22:47.000Z": "I'm going to call into @WNPR 's @WhereWeLive this morning at 9AM. Listen live: Where We Live Where We Live is a call-in talk show about who we are in Connecticut and our place in the world. On any given day, we explore topics you may be talking wnpr.org", "2020-06-01T00:59:17.000Z": "I want to thank the good samaritans who bravely spoke out to defend George. The fellow officers should have done more. We all should do more.", "2020-05-31T15:15:34.000Z": "To all the protesters, we hear your message and I want to give a special thank you for keeping the peace.", "2020-05-30T20:04:37.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 42,022 people tested positive (+260)\n- 3,912 people have died (+44)\n- 533 patients are currently hospitalized (-44)\n- 246,935 tests have been reported to the state (+5,542)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-29T23:37:47.000Z": "I just signed an Executive Order that takes two actions: Relaxes the previously enacted limits on large gatherings by raising limit to 10 people indoors and 25 people outdoors; and also allows for larger religious gatherings Permits barbershops and hair salons to open June 1", "2020-05-29T19:06:23.000Z": "Today I joined Mayor @joeganim in getting tested for COVID-19. It's quick, easy to do, took less than 10 minutes, and was painless! \n\nThank you to all of our healthcare warriors who are on the frontlines working tirelessly to keep us safe.", "2020-05-29T21:06:26.000Z": "Earlier today, @teachcardona visited three districts to see firsthand some of the great work being done by our food service heroes & school personnel to get meals, @Scholastic book packs (donated by @IndraNooyi ) & other critical learning resources into the hands of students. Wow!", "2020-05-29T19:33:10.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 41,762 people tested positive (+203)\n- 3,868 people have died (+42)\n- 577 patients are currently hospitalized (-71)\n- 241,393 tests have been reported to the state (+5,868)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-29T19:30:03.000Z": "ICYMI: Watch today's news briefing with updates on COVID-19 Governor Lamont's May 29, 2020 12:30PM Coronavirus Update Governor Ned Lamont's 12:30 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronavir... youtube.com", "2020-05-29T17:51:22.000Z": "As the metrics continue moving in the right direction, I will be signing an executive order later today that will ease some of the guidelines on gatherings. This will include raising the limits to 10 people for indoors and 25 people outdoors.", "2020-05-29T16:32:40.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut.\n\nWatch live CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-29T15:15:32.000Z": "#TalkItOut When it Builds Up, Talk It Out... http:// talkitoutct.com", "2020-05-29T15:09:50.000Z": "I will hold a news briefing to discuss the latest updates on COVID-19 today at 12:30PM.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-29T12:38:15.000Z": "Welcome aboard, @CTDOTOfficial . Your on-time performance for trains and buses is a lot better than catching social media trends! Quote Tweet Connecticut Department of Transportation @CTDOTOfficial CTDOT is finally getting ONBOARD the Twitter TRAIN. To be FARE, we've been a bit busy, but it's time. Who knew Twitter was such a great VEHICLE to BRIDGE communications w/people abt #transportation !?! Any advice on how to NAVIGATE this? Or ways to DRIVE people to follow us!? Show this thread", "2020-05-28T22:47:12.000Z": "I will be on @WFSBnews tonight at 7PM for a special edition of Face the State with @DennisHouseTV Quote Tweet Dennis House @DennisHouseTV STAND BY:  I invite you to join me coming up on @WFSBnews at 7 o'clock for a special Thursday night edition of  Face the State.  We are joined by @GovNedLamont and @LGSusanB who are taking your questions about the coronavirus pandemic", "2020-05-28T20:32:59.000Z": "We're appreciative to have partners like @SaintFrancisCT in the effort to expand COVID-19 testing.\n\nThrough a partnership w/ @The_Charter_Oak , their mobile clinic will visit 19 locations around the Hartford area in the coming weeks.\n\nView the schedule  https:// trinityhealthofne.org/find-a-service -or-specialty/covid-19/drive-through-covid-19-screening  Quote Tweet Saint Francis Hospital @SaintFrancisCT Free, walk-up COVID-19 testing now be available through a partnership with @The_Charter_Oak Charter Oak Health Center, Inc.\n\nTo find the mobile clinic's daily locations visit https:// bit.ly/2XshhWm Dates are weather permitting and subject to change.", "2020-05-28T20:02:32.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 41,559 people tested positive (+271)\n- 3,826 people have died (+23)\n- 648 patients are currently hospitalized (-36)\n- 235,525 tests have been reported to the state (+5,756)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-28T16:42:19.000Z": "WATCH: Today's roundtable discussion of the Reopen Connecticut Advisory Group's community committee regarding the impact of COVID-19 on the state's most vulnerable populations Reopen Connecticut Advisory Group community roundtable Roundtable discussion of the community committee of the Reopen Connecticut Advisory Group regarding the impact of COVID-19 on the state's most vulnerable pop... youtube.com", "2020-05-28T16:37:39.000Z": "ICYMI: Watch today's news briefing with updates on COVID-19 Governor Lamont's May 28, 2020 10AM Coronavirus Update Governor Ned Lamont's 10:00 a.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronavir... youtube.com", "2020-05-28T14:01:01.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19\n\nWATCH LIVE  https:// youtu.be/etaKxjI95xY", "2020-05-28T13:18:28.000Z": "I will hold a news briefing today at 10:00AM.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/etaKxjI95xY", "2020-05-27T19:09:55.000Z": "On Monday, June 8, limited operations will resume in the Middlesex Judicial District Courthouse, the geographical area courthouse in Rockville and the Litchfield Judicial District Courthouse in Torrington. For more information, view: https:// jud.ct.gov/HomePDFs/Limit edResume.pdf  .", "2020-05-28T02:38:21.000Z": "Thank you to law enforcement members from the @CT_STATE_POLICE and local PD, as well as those from each of our neighboring states, for their dedicated commitment regarding this matter. We are appreciative of their unified approach to this disturbing situation. Quote Tweet CT State Police @CT_STATE_POLICE **UPDATE**Suspect, Peter Manfredonia has been found & is in custody. CSP Eastern District Major Crime are on scene in Hagerstown, MD. No injuries to any law enforcement personnel or Manfredonia. More info will be provided on Thurs, May 28 @PAStatePolice  @FBINewHaven  @FBI  @MDSP", "2020-05-28T01:57:47.000Z": "The Reopen Connecticut Advisory Group's Community Committee will hold a roundtable discussion tomorrow at 10AM regarding CT's most vulnerable communities. This is the meeting that was rescheduled from last week.\n\nHave a question? Send it to reopen@ct.gov. Governor Lamont Announces Reopen Connecticut Advisory Group to Hold Community Roundtable Thursday... Governor Ned Lamont today announced that members of the Reopen Connecticut Advisory Group's community committee will hold a roundtable discussion on Thursday, May 28, 2020 at 10:00 a.m. regarding how... portal.ct.gov", "2020-05-27T17:39:05.000Z": "Free COVID-19 testing is being offered on the #NewHaven Green until 4PM today. No doctors referral needed, and you don't have to be exhibiting any symptoms.\n\nCall 203-946-4949 for more info.\n\nCome on out an get tested! @MayorElicker  @SenBlumenthal", "2020-05-27T17:28:06.000Z": "Thank you so much to Governor Lamont and Senator Blumenthal for joining me today on the New Haven Green to highlight the importance of testing. We are asymptomatic testing until 4PM today so please get tested! Call 203-946-4949 for more information. @GovNedLamont  @SenBlumenthal", "2020-05-27T16:42:18.000Z": "HAPPENING NOW: News briefing at a mobile testing site in #NewHaven to discuss the latest updates on COVID-19. WATCH LIVE: https:// media.wtnh.com/nxs-wtnhtv-med ia-us-east-1/livestream/wtnh-livestream-event.html ", "2020-05-27T14:22:42.000Z": ". @teachcardona and I have prioritized improving educational outcomes and making sure every student in CT has equitable access to a quality education and the opportunity to succeed. Achieving a record-high graduation rate is a sign that we are headed in the right direction. Quote Tweet CT Dept of Education @EducateCT Positive news on the education front: CT's on-time Graduation Rates show continued improvement; are the highest since 2010-11. Improvements are testament to collective efforts of all our educators supporting students to persevere through challenging times: https:// tinyurl.com/yazpblbx", "2020-05-27T14:01:32.000Z": "Thank you to the @CTNationalGuard for their assistance Quote Tweet Maj. Gen. Fran Evon @CTNGTAG CT Guardsmen working hard packaging nearly 2,300 test kits for delivery today to 23 different nursing homes around the State #InThisTogether", "2020-05-27T02:20:26.000Z": "Trooper Baron dedicated his life to protecting others, both here in Connecticut and beyond our state's borders. He answered the call of duty after 9/11, putting his own life at risk to help search for survivors. His tremendous courage and bravery will never be forgotten. Quote Tweet Governor Ned Lamont @GovNedLamont As a mark of solemn respect and remembrance in honor of @CT_STATE_POLICE Trooper First Class Eugene Kenneth Baron, Jr., who passed away yesterday from injuries and exposure in the line of duty, I am directing flags in Connecticut lowered to half-staff. https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/05-2020/Governor-Lamont-Directs-Flags-to-Half-Staff-in-Honor-of-State-Police-Trooper-First-Class-Baron  Show this thread", "2020-05-26T21:45:00.000Z": "As a mark of solemn respect and remembrance in honor of @CT_STATE_POLICE Trooper First Class Eugene Kenneth Baron, Jr., who passed away yesterday from injuries and exposure in the line of duty, I am directing flags in Connecticut lowered to half-staff. https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/05-2020/Governor-Lamont-Directs-Flags-to-Half-Staff-in-Honor-of-State-Police-Trooper-First-Class-Baron ", "2020-05-26T20:05:13.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 41,303 people tested positive (+430)\n- 3,769 people have died (+27)\n- 694 patients are currently hospitalized (-12)\n- 225,362 tests have been reported to the state (+3,636)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-26T19:59:07.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-26T19:49:29.000Z": "Joined some friends at Lake Waramaug this weekend to celebrate and thank area first responders.", "2020-05-26T19:41:46.000Z": "I've asked West Hartford Mayor @Cantorshari and Greenwich First Selectman @fcamillo to join me at my news briefing today to discuss the latest developments regarding the impact of COVID-19 within their respective communities.\n\nWe'll be getting started at 4PM.", "2020-05-26T18:29:43.000Z": "Participating in a @WhiteHouse video call with @VP Pence to discuss the latest updates on COVID-19", "2020-05-26T16:32:25.000Z": "Share how you feel: please look for details from your school on how to participate. All responses are anonymous and take as little as 5 - 10 minutes to complete; however, you can come back at any time & complete questions at your own pace. We appreciate your insight!", "2020-05-26T16:32:24.000Z": "STUDENTS: As Gov Lamont, @EducateCT & CT leaders consider decisions on reopening schools, we want YOU to be part of this important conversation! We're using @thoughtxchng to directly engage #studentvoice on how to improve distance learning should we need it again for fall 2020-21", "2020-05-26T15:19:36.000Z": "I will hold a news briefing today at 4:00PM to discuss the latest updates on COVID-19 in Connecticut.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-22T17:30:10.000Z": "CT DMV Announces Additional Extensions and Waivers - acting on the recent Declaration signed by @GovNedLamont - Eligible DMV credentials that expire between March 10, 2020 and June 8, 2020 are automatically covered by this extension #CTDMV CT DMV Announces Additional Extensions and Waivers portal.ct.gov", "2020-05-26T02:00:00.000Z": "Coast Guard Petty Officer 3 Nathan Bruckenthal of #Ridgefield died in Iraq in 2004. He had been selected for an elite training assignment with the Coast Guard's Tactical Law Enforcement Team. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-26T01:45:00.000Z": "Air Force Staff Sgt. Todd J. Lobraico Jr. of #Fairfield died in Afghanistan in 2013. He was posthumously awarded the Bronze Star for his bravery in preventing an ambush on his own squad near Bagram Airfield. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-26T01:30:00.000Z": "Air Force Maj. Raymond G. Estelle of #NewHaven died in Afghanistan in 2011. He served 20 years with the Air Force and was devoted to his family, his community and his faith. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-26T01:15:00.000Z": "Navy SEAL Chief Petty Officer Brian R. Bill of #Stamford died in 2011 in Afghanistan. He was a member of the elite Navy SEAL special forces unit, considered to be the toughest warriors in the world. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-26T01:00:00.000Z": "Navy SEAL Petty Officer Jason Dale Lewis of #Brookfield died in 2007 in Iraq. He loved rock climbing, bicycling, fly fishing and other outdoor sports. He dreamed of being a Navy SEAL since high school. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-26T00:45:00.000Z": "Marine Lnc. Cpl. Tyler Griffin of #Voluntown died in Afghanistan in 2010 at the age of 19. He was supporting Operation Enduring Freedom as part of 1st Battalion 2nd Mar, (RCT-2, MEB-A Fwd), 2nd Mar Division. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-26T00:30:00.000Z": "Marine Cpl. Xhacob LaTorre of #Waterbury died in Afghanistan in 2009. He was a 2005 graduate of Crosby High School, where he was in the ROTC for three years. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-26T00:15:00.000Z": "Marine Cpl. Christian Cotner of #Waterbury died in Iraq in 2008. At a memorial service held at his family's church, many wore tropical shirts and leis as an acknowledgment of his free spirit. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-26T00:00:00.000Z": "Marine Cpl. Kevin J. Dempsey of #Monroe died in Iraq in 2004. He was a wrestler and football star at #NewCanaan High School, and earned the nickname \"Jack\" after the boxing legend with the same last name. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T23:45:00.000Z": "Marine Lnc. Cpl. Philip Johnson of #Enfield died in Iraq in 2006 at the age of 19. He was only 11 years old when he joined a Young Marines detachment at Westover Air Reserve Base in nearby Massachusetts. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T23:30:00.000Z": "Marine Cpl. Jordan Pierson of #Milford died in Iraq in 2006. He was a Marine Corps Reservist and deployed with Charlie Company, 1st Battalion, 25th Marine Regiment, 4th Marine Division out of #Plainville . #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T23:15:00.000Z": "Marine Capt. Brian S. Letendre of #NewBritain died in Iraq in 2006. He was assigned to the Marine Forces Reserve's Inspector and Instructor Staff, 1st Battalion, 25th Marine Regiment, 4th Marine Division. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T23:00:00.000Z": "Marine Cpl. Stephen Bixler of #Suffield died in Iraq in 2006. A cross-country and track star in high school, he took up snowboarding and surfing when he joined the Marines in 2003. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T22:45:00.000Z": "Marine Sgt. David Coullard of #Glastonbury died in Iraq in 2005. The plumbers and pipefitters school in #Meriden , which is visible on Interstate 91, is named in his honor. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T22:30:00.000Z": "Marine Lnc. Cpl. John Schmidt III of #Brookfield died in Iraq in 2005. He was a computer whiz who loved playing hockey and snowboarding, and joined the Marines at the age of 19. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T22:15:00.000Z": "Marine Lnc. Cpl. Lawrence Philippon of #WestHartford died in Iraq in 2005 at the age of 22. He was a standout hockey goalie for Conard High School, and served as a Marine rifleman. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T22:00:00.000Z": "Marine Cpl. Kemaphoom Chanawongse of #Waterford died in Iraq in 2003. He became an American citizen at the age of 9 after coming from Thailand and dreamed of serving his adopted country as a Marine. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T21:45:00.000Z": "Army Captain Andrew Pedersen-Keel of #Madison died in Afghanistan in 2013. He graduated from Avon Old Farms High School in 2002 and earned a Bachelor of Science from the U.S. Military Academy. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T21:30:00.000Z": "Army Spec. Philip C.S. Schiller of #Winsted died in Afghanistan in 2012 at the age of 21. He was assigned to the 1st Battalion, 23rd Infantry Regiment, 3rd Stryker Brigade Combat Team, 2nd Infantry Division. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T21:15:00.000Z": "Army Staff Sgt. Ari R. Cullers of #Waterford died in Afghanistan in 2011. He enlisted in the Army after graduating from Waterford High School in 2001. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T21:00:00.000Z": "Army Sgt. Edward J. Frank II of #Hartford died in Afghanistan in 2011. He was a squad leader and member of the 1st Battalion, 32nd Infantry Regiment, 3rd Brigade Combat Team, 10th Mountain Division. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T20:45:00.000Z": "Army Pfc. Eric D. Soufrine of #Woodbridge died in Afghanistan in 2011 at the age of 20. An artillery vehicle gunner, he graduated in 2009 from Amity Regional High School, and joined the Army in May 2010. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T20:30:00.000Z": "Army Spec. Richard C. Emmons III of #NorthGranby died in Afghanistan in 2011. He was a signal support systems specialist with the 2nd Battalion, 30th Infantry Reg., 4th Brig. Combat Team, 10th Mountain Div. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T20:15:00.000Z": "Army Staff Sgt. Frank Adamski III of #Plainfield died in Afghanistan in 2011. He graduated from Plainfield High School in 2002 and joined the Army in March 2005. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T20:00:00.000Z": "Army Sgt. 1st Class Dae Han Park of #Watertown died in Afghanistan in 2011. A graduate of Watertown High School, he joined the Army in 1998 as an infantryman. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T19:45:00.000Z": "Army Spec. David R. Fahey Jr. of #Norwalk died in Afghanistan in 2011 at the age of 23. He was killed in action when an IED detonated beneath his vehicle. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T19:30:00.000Z": "Army PFC Gebrah Noonan of #Watertown died in Afghanistan in 2010. He served in the 3rd Battalion, 15th Infantry Regiment, 4th Infantry Brigade Combat Team out of Fort Stewart, GA. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T19:15:00.000Z": "Army Sgt. Steven DeLuzio of #Glastonbury died in Afghanistan in 2010. He was co-captain of the 2003 state champion Glastonbury High School hockey team and joined the Army in response to the 9/11 attacks. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T19:00:00.000Z": "Army Staff. Sgt. Edwin Rivera of #Waterford died in Afghanistan in 2010. He served with the @CTNationalGuard Alpha Company 1st Battalion, 102nd Infantry Regiment. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T18:45:00.000Z": "Army Spec. Dennis Pratt of #Southington died in Afghanistan in 2009. He was a member of the 4th Battalion, 25th Field Artillery, 3rd Brigade Combat Team, 10th Mountain Division out of Fort Drum, N.Y. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T18:30:00.000Z": "Army Sgt. Edward Kramer of #Southington died in Iraq in 2009. An expert marksman, he was a member of the North Carolina National Guard Company A, 1st Battalion, 120th Infantry and a civilian firefighter. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T18:15:00.000Z": "Army Staff Sgt. Ronald Spino of #Waterbury died in Afghanistan in 2009. He was killed by insurgent fire while he and several soldiers were unloading medical supplies. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T18:00:00.000Z": "Army Capt. Benjamin Sklaver of #Hamden died in Afghanistan in 2009. He graduated from Hamden High School, @TuftsUniversity , and had a master's degree from @FletcherSchool . #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T17:45:00.000Z": "Army First Lt. Thomas J. Brown of #Shelton died in Iraq in 2008. He graduated from @GeorgeMasonU in 2004 with a B.A. in Government and International Politics and joined the Army in 2005. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T17:30:00.000Z": "Army Sgt. Jason Lantieri of #Killingworth died in Iraq in 2007. He graduated from Haddam-Killingworth High School and earned a bachelor's degree at @WNEUniversity before joining the Army in 2005. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T17:15:00.000Z": "Army PFC Andre Craig of #NewHaven died in Iraq in 2007 at the age of 24. A graduate of @Wilbur_Cross_HS , he died of wounds sustained when an improvised explosive device exploded near his convoy in Baghdad. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T17:00:00.000Z": "Army PFC Orlando E. Gonzalez of #Bridgeport died in 2007 in Iraq at the age of 21. He was killed when an improvised explosive device detonated near his vehicle. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T16:45:00.000Z": "Army 1st Lieut. Keith Heidtman of #Norwich died in Iraq in 2007 at the age of 24. He was a 2001 graduate of @nfaschool , and graduated from @UConn in 2005, with honors, receiving a B.S. in resource economics. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T16:30:00.000Z": "Army PFC Stephen K. Richardson of #Bridgeport died in Iraq in 2007. He attended Bassick High School in Bridgeport and @UBridgeport before joining the Army in 2004. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T16:15:00.000Z": "Army Sgt. Richard Ford of #EastHartford died in Iraq in 2007. He received the Bronze Star, Purple Heart, and an Army Commendation Medal with a V for Valor, for saving members of his crew under fire in Mosul. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T16:00:00.000Z": "Army Staff Sgt. Joseph E. Phaneuf II of #Eastford died in Afghanistan in 2006. He was also a member of the Eastford Volunteer Fire Department and coached basketball, T-ball, and baseball. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T15:45:00.000Z": "Army Capt. Jason R. Hamill of #Salem died in Iraq in 2006. He was born in #NewHaven , grew up in Salem, and graduated from @UConn before joining the @USArmy in 1998. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T15:30:00.000Z": "Army PFC Nicholas Madaras of #Wilton died in Iraq in 2006 at the age of 19. He attended Wilton High School and enlisted in the Army shortly after graduation. He was awarded the Bronze Star and Purple Heart. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T15:15:00.000Z": "Army Major Stephen C. Reich of #WashingtonCT died in Afghanistan in 2005. He attended @WestPoint_USMA , where he pitched for the Army baseball team. He holds the record for most wins by a West Point pitcher. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T15:00:00.000Z": "Army Spec. Christopher Hoskins of #Danielson died in Iraq in 2005 at the age of 21. He was born in #NewLondon and graduated from Killingly High School, where he competed on the wrestling team. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T14:45:00.000Z": "Army Staff Sgt.Thomas Vitagliano of #NewHaven died in Iraq in 2005. He attended @notredamewh in #WestHaven until his sophomore year, and then transferred to Virginia's Hargrave Military Academy. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T14:30:00.000Z": "Army Spec. Robert Hoyt of #Ashford died in Iraq in 2004 at the age of 21. He grew up in #Mansfield , was a 2001 graduate of @EOSmithHS , and enlisted in the @CTNationalGuard in 2002. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T14:15:00.000Z": "Army Staff Sgt. Henry Irizarry of #Waterbury died in Iraq in 2004. Born in Puerto Rico, he moved to Connecticut with his wife Jessica and their children in 1997. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T14:00:01.000Z": "Army Lt. Col. Michael J. McMahon of #WestHartford died in Afghanistan in 2004. He graduated from @ConardCHS , and from the US Military Academy. He and his wife, Jeanette, also a Lt. Colonel, have 3 children. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T13:45:00.000Z": "Army Sgt. Joseph M. Nolan of #Waterbury died in Iraq in 2004 at the age of 27. His great-grandfather served in WWI, his grandfather served in the Navy during WWII, and his father was a Marine in Vietnam. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T13:30:00.000Z": "Army Chief Warrant Officer William Brennan of #Bethlehem died in Iraq in 2004. After receiving his associate's degree, he joined the @USArmy and pursued his dream of flying helicopters. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T13:15:00.000Z": "Army Spec. Jacob Martir-Gutierrez of #Norwich died in Iraq in 2004 at the age of 21. He attended @nfaschool and enlisted at 17. He was awarded the Purple Heart and a Bronze Star for meritorious service. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T13:00:00.000Z": "Army PFC Melissa Hobart of #EastHaven died in Iraq in 2004 at the age of 22. She attended nursing school at Trident Tech for a year and a half before joining the Army in 2003. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T12:45:00.000Z": "Army Sgt. Felix DelGreco of #Simsbury died in Iraq in 2004 at the age of 22. He was an Eagle Scout who enlisted in the @CTNationalGuard when he was still attending Simsbury High School. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T12:30:00.000Z": "Army Spec. Tyanna Avery Felder of #Bridgeport died in Iraq in 2004 at the age of 22. She attended Kolbe Cathedral H.S., where she played basketball and sang in the choir, and attended @SCSU before enlisting. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T12:15:00.000Z": "Army Sgt. Benjamin Gilman of #Meriden died in Afghanistan in 2004 at the age of 28. He was a graduate of Orville H. Platt High School and was active in the area's Big Brother/Big Sister program. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T12:00:00.000Z": "Army Capt. Eric Paliwoda of #Farmington died in Iraq in 2004 at the age of 28. He graduated from @WestPoint_USMA in 1997 with a Bachelor of Science and was commissioned as a Second Lieutenant in the @USArmy . #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T11:45:00.000Z": "Army PFC Jeffrey Braun of #Stafford died in Iraq in 2003. Adopted from Honduras as an abandoned infant, he dreamed of one day going back to his native country to build an orphanage and children's school. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T11:30:00.000Z": "Army Sgt. Maj. Philip Albert of #Terryville died in Afghanistan in 2003. He had joined the Army when he was 18 and was getting ready to retire when the 9/11 attacks occurred, prompting him to reenlist. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T11:15:00.000Z": "Army PFC Anthony D'Agostino of #Waterbury died in Iraq in 2003 at the age of 20. Born on an Army base in Georgia where his father was stationed, he decided to join the service after the 9/11 attacks. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T11:00:00.000Z": "Army Sgt. David Travis Friedrich of #Naugatuck died in 2003 in Iraq at the age of 26. He was working on a master's degree in forensic science at @UNewHaven when he was called into active duty. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T10:45:00.000Z": "Army Staff Sgt. Richard Eaton, Jr. of #Guilford died in Iraq in 2003. Fluent in Korean, Spanish and Arabic, he became a published author in the counterintelligence community. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T10:30:00.000Z": "Army Specialist Wilfredo Perez, Jr. of #Norwalk died in Iraq in 2003. Known as \"Junior,\" he was selflessly devoted to his family, often caring for ill relatives and taking his grandmother shopping. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T10:15:00.000Z": "Marine Staff Sgt. Phillip Jordan of #Enfield died in Iraq in 2003. He was the first Connecticut service member killed in Operation Iraqi Freedom. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T10:02:00.000Z": "Air Force Tech. Sgt. John Chapman of #WindsorLocks died in Afghanistan in 2002. He was the first Connecticut military member killed in combat after 9/11 and was posthumously awarded the Medal of Honor. #CTWallofHonor → https:// portal.ct.gov/WallofHonor  #MemorialDay  #HonorTheFallen", "2020-05-25T10:01:00.000Z": "The #CTWallofHonor is a tribute to members of the Armed Forces from #Connecticut who gave their lives in Iraq and Afghanistan since 9/11. Located in the State Capitol, it features photos of each service member. Watch this year's ceremony: https:// youtu.be/D-pJch5i4A8  #MemorialDay", "2020-05-25T10:00:00.000Z": "Our nation's service members put their lives on the line in order to protect the freedoms and liberties that make this country the greatest in the world. On #MemorialDay , we honor and pay tribute to each of the fallen heroes.", "2020-05-22T17:46:44.000Z": "Now more than ever ...\n\nOn this, old adversaries agree: Connecticut must remove the religious exemption to vaccines On this, old adversaries agree: Connecticut must remove the religious exemption to vaccines One person's choice not to vaccinate their child becomes a community choice when it puts other people's health at risk. courant.com", "2020-05-24T20:10:20.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 40,486 people tested positive (+446)\n- 3,693 people have died (+18)\n- 701 patients are currently hospitalized (-23)\n- 214,136 tests have been reported to the state (+5,769)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-23T19:55:44.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 40,022 people tested positive (+382)\n- 3,675 people have died (+38)\n- 724 patients are currently hospitalized (-16)\n- 208,367 tests have been reported to the state (+6,039)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-23T11:05:00.000Z": "U.S. @RepJoeCourtney is among a bipartisan group of more than 70 lawmakers calling on the Pentagon to extend the mobilization of National Guard troops, who have been crucial to states' responses to the #coronavirus pandemic. https:// bit.ly/3cWxCJt", "2020-05-22T20:03:23.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 39,640 people tested positive (+432)\n- 3,637 people have died (+55)\n- 740 patients are currently hospitalized (-76)\n- 202,328 tests have been reported to the state (+5,881)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-22T19:11:53.000Z": "Sure, it's gorgeous out but are last winter's heating bills still hanging around? You can apply for help by June 1 thru the CT Energy Assistance Program. Info at http:// ct.gov/staywarm or call 2-1-1. @GovNedLamont  @CAFCA_Inc  @211CT  https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/05-2020/Governor-Lamont-Reminds-Connecticut-Residents-of-June-1-Deadline-to-Apply-for-Home-Heating ", "2020-05-22T18:05:00.000Z": "All you need to know is how you feel! There are no right or wrong answers. And checking-in with the #HowWeFeel app only takes about 30 seconds. Download & share: @HowWeFeel Help track Coronavirus in your area howwefeel.org", "2020-05-22T17:57:40.000Z": "A big congratulations to the three Connecticut high school students named 2020 U.S. Presidential Scholars! Cynthia Chen - Greenwich High School Brandon Demkowicz - Farmington High School Elizabeth Ann Wozniak - Platt High School (Meriden) Governor Lamont and State Education Commissioner Cardona Congratulate Three Connecticut Students... Governor Ned Lamont and State Education Commissioner Miguel Cardona today are congratulating three Connecticut residents who were named as 2020 U.S. Presidential Scholars for their accomplishments in... portal.ct.gov", "2020-05-22T16:56:54.000Z": "Online access to certain food retailers coming for SNAP enrollees in early June, as announced in @GovNedLamont briefing yesterday. More info: http:// ct.gov/snap . Thank you @USDANutrition  @RosaDelauro & partners @ShopRiteStores  @Walmart  @Amazon . @211CT  @EndHungerCT  @CAFCA_Inc", "2020-05-21T23:57:33.000Z": "Our hearts will forever be with their families for all that they've sacrificed. Here's the full video of today's ceremony: https:// youtu.be/D-pJch5i4A8", "2020-05-21T23:57:31.000Z": "It was an honor today to deliver remarks at the 13th annual #CTWallofHonor ceremony, saluting the 65 heroes from #Connecticut who died serving our nation in the Armed Forces since the 9/11 attacks. We will never forget what they've given for our country.", "2020-05-21T22:53:30.000Z": "Tune into @WFSBnews tonight at 7PM. I'll be on a special live edition of #FaceTheState taking some of your questions about COVID-19. Quote Tweet Dennis House @DennisHouseTV We are about to get new details about the re-opening of Connecticut.  I invite you to join me in a few minutes at 7 o'clock on @WFSBnews as I ask @GovNedLamont some of the thousands of questions you have been submitting to us.", "2020-05-21T22:23:07.000Z": "We're grateful to have generous partners like @Sikorsky in Connecticut. This $515,000 donation to @CTFoodBank will go a long way in helping those who have been impacted by this pandemic. Quote Tweet CT Food Bank @CTFoodBank We're grateful on #ThankfulThursday for a grant from @sikorsky and @lockheedmartin that will help provide food to our network of 500 partners & programs. The need has never been greater, and we thank Sikorsky for supporting our neighbors.", "2020-05-21T21:30:13.000Z": "HAPPENING NOW: 13th annual #CTWallofHonor ceremony, honoring the lives of the 65 service members from Connecticut who died in the line of duty since the 9/11 attacks. WATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-21T18:29:31.000Z": "Thank you @GovNedLamont & @CVSHealth for including East Hartford to the growing list of testing sites. Testing is free and quick! Quote Tweet Governor Ned Lamont @GovNedLamont With these 13 additional #COVID19 drive-thru test sites, @CVSHealth is now operating 25 of these locations at their pharmacies throughout Connecticut.\n\nTesting is free and quick. Learn how to make an appointment: https:// bit.ly/3bQOVu0", "2020-05-21T17:47:43.000Z": "With another testing site opening at @cvspharmacy on Wethersfield Ave, we now have 9 permanent testing sites in #Hartford - PLUS mobile locations like Phillips Church today and Batchelder School tmrw. No prescription, no symptoms, no insurance, no ride... no problem! #GetTested", "2020-05-21T17:27:05.000Z": "With these 13 additional #COVID19 drive-thru test sites, @CVSHealth is now operating 25 of these locations at their pharmacies throughout Connecticut.\n\nTesting is free and quick. Learn how to make an appointment: https:// bit.ly/3bQOVu0", "2020-05-21T16:30:41.000Z": "ICYMI: Watch today's news briefing with updates on COVID-19 Governor Lamont's May 21, 2020 10AM Coronavirus Update Governor Ned Lamont's 10:00 a.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronavir... youtube.com", "2020-05-21T15:35:54.000Z": "Join us LIVE with @GovNedLamont right now! Our @DanHaarColumns will be asking some reader-submitted questions about #COVID19 and Connecticut's reopening. Q&A: Lamont answers your questions about reopening Connecticut amid coronavirus Join the governor and Hearst Connecticut Media Group Columnist and Editor Dan Haar on Thursday, May 21 at 11:30 a.m. ctpost.com", "2020-05-21T15:09:48.000Z": "Today at 11:30AM, I will join Hearst Connecticut Media Group columnist and editor @DanHaarColumns for a live video chat to answer some of your #COVID19 questions.\n\nWant to participate? Have a question? Register here  https:// us02web.zoom.us/webinar/regist er/WN_jL4O2-r7TJilIjaEkCeT3w ", "2020-05-21T14:58:16.000Z": "We will hold the state's 13th annual #CTWallofHonor ceremony today at 5:30PM, honoring the lives of the 65 service members from Connecticut who died in the line of duty since the 9/11 attacks. Watch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-21T14:11:39.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 39,208 people tested positive (+191)\n- 3,582 people have died (+53)\n- 816 patients are currently hospitalized (-71)\n- 196,447 tests have been reported to the state (+5,729)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-21T13:59:23.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-21T13:22:10.000Z": "I will hold a news briefing this morning at 10:00AM to discuss the latest updates on COVID-19.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-21T12:57:26.000Z": "I agree with Gov. Lamont. Voter access is at the core of our democracy, and Americans should be able to cast absentee ballots to make their voices heard -- no matter what. No one should have to choose between exercising their rights and their health. Quote Tweet Governor Ned Lamont @GovNedLamont Nobody should need to make a decision between their health and their right to vote.\n\nAllowing voters to cast absentee ballots is a responsible step to ensuring that Connecticut residents are safe and we continue mitigating the spread of COVID-19. https:// bit.ly/2yktRhX", "2020-05-21T11:16:58.000Z": "We will continue to tweet if boat launches are closed. Check out the operation plan for state parks, beaches and trails below or follow parks to stay current @CTStateParks Quote Tweet DEEP @CTDEEPNews DEEP has released an operational plan that outlines for current guidelines around the operation and use of state park grounds, trails, beaches, boat launches and other areas as we continue to navigate the COVID-19 pandemic. Read the plan here: https:// portal.ct.gov/deep-parkscovi d19 ", "2020-05-21T11:10:20.000Z": "Thankful @GovNedLamont has taken this step to allow everyone to remain safe and healthy when they vote in the August primary. Now we in the legislature needs to do the same for November. Quote Tweet Governor Ned Lamont @GovNedLamont Nobody should need to make a decision between their health and their right to vote.\n\nAllowing voters to cast absentee ballots is a responsible step to ensuring that Connecticut residents are safe and we continue mitigating the spread of COVID-19. https:// bit.ly/2yktRhX", "2020-05-20T15:08:28.000Z": "DEEP has released an operational plan that outlines for current guidelines around the operation and use of state park grounds, trails, beaches, boat launches and other areas as we continue to navigate the COVID-19 pandemic. Read the plan here: https:// portal.ct.gov/deep-parkscovi d19 ", "2020-05-21T01:30:29.000Z": "Fully agree @GovNedLamont . I have received countless emails from constituents who have voiced their concerns over voting at the polls. When we live in age that you can get your groceries delivered to your home, you should be able to also get your ballot that way. Quote Tweet Governor Ned Lamont @GovNedLamont Nobody should need to make a decision between their health and their right to vote.\n\nAllowing voters to cast absentee ballots is a responsible step to ensuring that Connecticut residents are safe and we continue mitigating the spread of COVID-19. https:// bit.ly/2yktRhX", "2020-05-20T23:48:04.000Z": "We're very grateful to @GovNedLamont for keeping ALL voters safe during this pandemic. Continue to rock, Ned! Quote Tweet Governor Ned Lamont @GovNedLamont Nobody should need to make a decision between their health and their right to vote.\n\nAllowing voters to cast absentee ballots is a responsible step to ensuring that Connecticut residents are safe and we continue mitigating the spread of COVID-19. https:// bit.ly/2yktRhX", "2020-05-20T23:50:43.000Z": "How to Reopen: Connecticut Governor Ned Lamont Lamont discusses his top priorities and policies. fortune.com", "2020-05-20T23:13:25.000Z": "ICYMI: Watch today's news briefing with updates on COVID-19 Governor Lamont's May 20, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-05-20T22:36:44.000Z": "Thank you @GovNedLamont for this responsible step! #safeandfair Quote Tweet Governor Ned Lamont @GovNedLamont Nobody should need to make a decision between their health and their right to vote.\n\nAllowing voters to cast absentee ballots is a responsible step to ensuring that Connecticut residents are safe and we continue mitigating the spread of COVID-19. https:// bit.ly/2yktRhX", "2020-05-20T22:30:46.000Z": "Nobody should need to make a decision between their health and their right to vote.\n\nAllowing voters to cast absentee ballots is a responsible step to ensuring that Connecticut residents are safe and we continue mitigating the spread of COVID-19. https:// bit.ly/2yktRhX", "2020-05-20T20:05:13.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 39,017 people tested positive (+587)\n- 3,529 people have died (+57)\n- 887 patients are currently hospitalized (-27)\n- 190,718 tests have been reported to the state (+5,198)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-20T19:58:31.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-20T16:41:35.000Z": "\"Data is one thing, but behavior impacts that data so closely... so far the folks have really taken this seriously. They know how serious it is that you be careful.\"\n\n@GovNedLamontCT details the state's focus as it begins reopening. https:// cnn.it/36s920N", "2020-05-20T15:13:40.000Z": "I will hold a news briefing today at 4:00PM to discuss the latest updates on COVID-19 in Connecticut.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-20T01:32:26.000Z": "Connecticut has been fortunate to have former FDA Commissioner @ScottGottliebMD at the table providing thoughtful suggestions on how to make progress in flattening the curve and population based mitigation.", "2020-05-20T00:44:52.000Z": "As Dr. @ZekeEmanuel has stated, because of swift action and strong public health measures, Connecticut is a state where cases are decreasing and testing is quickly increasing-critical metrics that will help us to carefully and safely reopen.", "2020-05-19T23:15:20.000Z": "ICYMI: Watch today's news briefing with updates on COVID-19 Governor Lamont's May 19, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-05-19T20:06:34.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 38,430 people tested positive (+314)\n- 3,472 people have died (+23)\n- 914 patients are currently hospitalized (-6)\n- 185,520 tests have been reported to the state (+7,841)", "2020-05-19T19:58:22.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut.\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-16T21:44:33.000Z": "CT bond outlook holding steady amid plummeting tax revenues due to pandemic; faring better than 7 states, including New York, New Jersey; CT's $2.5 billion rainy day fund is key; treasurer touts state's fiscal record - Hartford Courant Connecticut bond outlook holding steady amid plummeting tax revenues due to pandemic; faring better... Despite plummeting tax revenues in multiple categories, Connecticut's bond-rating outlook is holding steady. That was the determination Friday from top Wall Street ratings agencies as the state... courant.com", "2020-05-19T18:06:46.000Z": "Today's Community Committee roundtable is being rescheduled to a time that has yet to be determined. We'll have more info soon. Quote Tweet Governor Ned Lamont @GovNedLamont Members of the Reopen Connecticut Advisory Group's community committee will hold a roundtable discussion on May 19 at 2PM regarding COVID-19 on the most vulnerable populations. It will stream live on @CTNetworkTV .\n\nSend your questions to reopen@ct.gov. https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/05-2020/Governor-Lamont-Announces-Reopen-Connecticut-Advisory-Group-to-Hold-Community-Roundtable-Tuesday ", "2020-05-19T15:37:40.000Z": "Proud to get laptops into the hands of tens of thousands of kids to help them further their educations during this crisis. Thank you to Barbara and Ray Dalio for their efforts, and for the Governor Ned Lamont for his leadership on the need for new educational thinking!", "2020-05-19T14:31:54.000Z": "I will hold my daily news briefing with updates on COVID-19 today at 4:00PM. We'll be joined by former FDA commissioner @ScottGottliebMD and leading health policy expert Ezekiel Emanuel.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-19T11:37:32.000Z": "Happening today at 2PM Quote Tweet Governor Ned Lamont @GovNedLamont Members of the Reopen Connecticut Advisory Group's community committee will hold a roundtable discussion on May 19 at 2PM regarding COVID-19 on the most vulnerable populations. It will stream live on @CTNetworkTV .\n\nSend your questions to reopen@ct.gov. https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/05-2020/Governor-Lamont-Announces-Reopen-Connecticut-Advisory-Group-to-Hold-Community-Roundtable-Tuesday ", "2020-05-19T10:28:16.000Z": "Detailed @GovNedLamont Reopen Phase 1 criteria achieved in last month: Bent the curve, COVID-19 hospitalizations 53% Dramatically testing, >45k in past week New contact tracing system online Testing the most vulnerable PPE stockpile Detailed workplace safety rules Quote Tweet Hartford Courant @hartfordcourant COVID-19 hospitalizations in Connecticut have been on the decline for almost four weeks now and are 53% below their peak https:// bit.ly/2TiSUcl", "2020-05-18T23:04:18.000Z": "Tune into @WTNH right now. I'm participating in their COVID-19 town hall. #CTTownHall Quote Tweet WTNH News 8 @WTNH Thanks for joining us for tonight's virtual town hall!  We're live from 7-9pm. You can tweet along through the night using the hashtag #CTTownHall . https:// bit.ly/3cMosPu", "2020-05-18T21:56:23.000Z": "Members of the Reopen Connecticut Advisory Group's community committee will hold a roundtable discussion on May 19 at 2PM regarding COVID-19 on the most vulnerable populations. It will stream live on @CTNetworkTV .\n\nSend your questions to reopen@ct.gov. https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/05-2020/Governor-Lamont-Announces-Reopen-Connecticut-Advisory-Group-to-Hold-Community-Roundtable-Tuesday ", "2020-05-18T21:13:00.000Z": "ICYMI: Watch today's news briefing with updates on COVID-19 Governor Lamont's May 18, 2020 2:30PM Coronavirus Update Governor Ned Lamont's 2:30 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-05-18T19:05:45.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 38,116 people tested positive (+697)\n- 3,449 people have died (+41)\n- 920 patients are currently hospitalized (-17)\n- 177,679 tests have been reported to the state (+7,072)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-18T18:28:05.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-18T17:59:17.000Z": "I thank the working group of dental hygienists, dental assistants, and dentists for sitting down with leadership at @CTDPH and thoughtfully coming to an agreement on this guidance, which provides a thorough analysis of best practices for dental offices. Governor Lamont Releases Dental Guidance Agreed Upon by Working Group of Dentists, Hygienists, and... Governor Ned Lamont today released the guidance document that was developed through a collaborative working group organized by his administration and provides best practices for dentist offices that... portal.ct.gov", "2020-05-18T17:19:26.000Z": "We've been hearing a lot of feedback, and at this time I think the best approach is that we hit pause on the reopening of hair salons and barbershops, take a step back, and allow some more time as preparations continue to be made. Governor Lamont and Governor Raimondo to Align Hair Salon and Barber Shop Reopenings in Early June As their administrations continue developing strategies for the safe reopening of sectors of the economy amid the COVID-19 pandemic, Governor Ned Lamont of Connecticut and Governor Gina Raimondo of... portal.ct.gov", "2020-05-18T13:18:19.000Z": "We know that this time has been challenging for licensed family child care homes - CTCARES can help. CTCARES for Family Child Care is designed to help you during the COVID-19 emergency. For more info about the resources available to you, visit http:// ctoec.org/covid-19/ctcar es-for-family-child-care/ ", "2020-05-18T13:12:46.000Z": "I will hold a news briefing today at 2:30PM to discuss the latest updates on COVID-19 in Connecticut.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-18T12:35:33.000Z": "Tech HS students are meeting the needs for skilled healthcare workers during #COVID19 . 11th and 12th Health Technology students from @WolcottTHS & @WindhamTHS are working in long-term healthcare facilities to provide vulnerable populations with care. #cte  #HealthcareHeroes", "2020-05-14T19:48:02.000Z": "This is not a good time to mix macroeconomic policy and moralizing. States Were Prudent; Here's Why They Need a Bailout Anyway Without federal help, frugal and profligate states alike will have to tighten their belts, deepening the recession and slowing the recovery, which is not in the federal government's interest. wsj.com", "2020-05-17T17:00:26.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 37,419 people tested positive (+716)\n- 3,408 people have died (+69)\n- 937 patients are currently hospitalized (-57)\n- 170,607 tests have been reported to the state (+5,852)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-16T18:48:38.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 36,703 people tested positive (+618)\n- 3,339 people have died (+54)\n- 994 patients are currently hospitalized (-39)\n- 164,755 tests have been reported to the state (+8,847)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-16T14:00:01.000Z": "Today we pay tribute our brothers and sisters in arms from all the different branches of the U.S. Military. #ArmedForcesDay  #AllInThisTogether", "2020-05-16T01:59:21.000Z": "It provides vital support for our health care workers, teachers, firefighters, and police officers. It enhances food assistance, preserves access to affordable health care, provides protections for those who have lost their jobs, and helps safeguard our communities. (2/3)", "2020-05-16T01:59:20.000Z": "Governors of both parties spoke with a unified voice when we asked Congress to deliver urgently needed relief to state and local governments and the citizens we serve. The #HEROESAct answers the call. (1/3)", "2020-05-16T00:27:42.000Z": "Severe thunderstorm watches and warnings have been issued for parts of northern Connecticut this evening.", "2020-05-14T19:58:22.000Z": "Moody's: CT poised to be 1 of just 7 fiscally safe states Moody's: CT poised to be 1 of just 7 fiscally safe states Connecticut's budget would fall behind by less than 1 percent in a moderate recession, compred with a 50-state average of 9.7 percent. stamfordadvocate.com", "2020-05-15T22:38:01.000Z": "Reminder: CTDOT strongly encourages the public to reserve using the train for ESSENTIAL TRAVEL only such as getting to and from work or for procuring essential needs.\n\nPassengers should wear a mask or cloth face covering on all trains and at stations.", "2020-05-15T18:58:13.000Z": ". @GovNedLamont on getting people back to work in very thoughtful way with public health and public safety as the number one priority.", "2020-05-15T18:25:10.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 36,085 people tested positive (+621)\n- 3,285 people have died (+66)\n- 1,033 patients are currently hospitalized (-70)\n- 155,908 tests have been reported to the state (+6,346)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-15T17:46:04.000Z": "Eligible #CT businesses that are planning on reopening must fill out the self-certification form online to ensure they will comply with the state's safety guidelines. Biz Planning to Reopen May 20 Must Self-Certify www.hartfordbusiness.com", "2020-05-15T17:36:18.000Z": "ICYMI: Watch today's news briefing with updates on COVID-19 Governor Lamont's May 15, 2020 10AM Coronavirus Update Governor Ned Lamont's 10:00 a.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronavir... youtube.com", "2020-05-15T13:10:49.000Z": "CT's CVS Minute Clinic, a rapid testing site in New Haven, is open with same-day appointments and results in 30 minutes. No doctor's note needed. Just complete the quick online form: https:// bit.ly/3cwk1IJ . For other drive-through sites that are not the same day, call 2-1-1.", "2020-05-15T16:12:29.000Z": "We've secured these infrared thermometers for our businesses, nonprofits, and places of worship because having adequate screening measures is an important step in keeping people safe. https:// bit.ly/3696NPB", "2020-05-15T13:58:40.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut.\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-15T13:18:02.000Z": "I'll be joined by @CVSHealth Executive Vice President and Chief Policy Officer Tom Moriarty at my news briefing this morning to discuss our coordinated efforts to expand COVID-19 testing throughout Connecticut. We'll be getting started at 10AM.", "2020-05-15T11:41:09.000Z": "I will hold a news briefing this morning at 10:00AM to discuss the latest updates on COVID-19.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-15T11:15:00.000Z": "Thank you to every member of law enforcement for your dedication to the safety of our communities.\n\nWe salute and honor those who have given their lives in the line of duty. Their memories will never be forgotten. #NationalPoliceWeek  #PeaceOfficersMemorialDay", "2020-05-14T16:00:00.000Z": "In this interview w/ @boston25 , I explained how outdated zoning laws may impede safe reopening of businesses: https:// bit.ly/2Li0aRp CT is the first state to address these issues statewide. REGISTER for a webinar TOMORROW, where I'll do Q&A on key issues: https:// bit.ly/3dDyT8c", "2020-05-15T00:02:09.000Z": "In the coming days, COVID19 tests will be available at *8* locations in #Hartford - in addition to mobile testing & with more likely open soon. You do not need symptoms, you do not need insurance, you do not need a prescription. #GetTested", "2020-05-14T22:43:37.000Z": "I'll be joining host @DennisHouseTV tonight at 7PM for a special edition of Face the State on @WFSBnews Quote Tweet WFSB Channel 3 @WFSBnews ONE HOUR AWAY from a LIVE Face the State with Governor Lamont just before the state gets ready for the partial reopening. Join us at 7pm tonight on CH.3", "2020-05-14T20:27:40.000Z": "ICYMI: Watch today's news briefing with updates on COVID-19 Governor Lamont's May 14, 2020 2PM Coronavirus Update Governor Ned Lamont's 2:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-05-14T18:19:14.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 35,464 people tested positive (+609)\n- 3,219 people have died (+94)\n- 1,103 patients are currently hospitalized (-55)\n- 149,562 tests have been reported to the state (+6,619)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-14T17:58:55.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut.\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-14T16:35:50.000Z": "Flyover to honor healthcare workers at Hartford Hospital as Nurses and Docs gathered on the Helipad to watch. @CTNationalGuard  @HartfordHealthC  #Hartford", "2020-05-14T17:33:46.000Z": "Great photo! @CTNationalGuard  #ThankYouHealthHeroes Quote Tweet Ashley Afonso @AshleyAfonso Frank from Cromwell captured this awesome photo of the flyover from Middletown.", "2020-05-14T17:24:32.000Z": "Speaking live right now with @hartfordcourant Quote Tweet Hartford Courant @hartfordcourant Watch live: We're interviewing Gov. Lamont on coronavirus testing, plans to reopen the state, the economic impact of the crisis and more https:// bit.ly/2y6TYZG", "2020-05-14T16:58:50.000Z": "ICYMI: Watch this morning's roundtable discussion of the Reopen Connecticut Advisory Group's business committee Reopen Connecticut Advisory Group business roundtable Roundtable discussion of the business committee of the Reopen Connecticut Advisory Group regarding the impact of COVID-19 on the state's business community. ... youtube.com", "2020-05-14T15:32:32.000Z": "UPDATE: @GovNedLamont announces CT receives $111 Million in PK-12 #COVID19 Relief Aid. @EducateCT will allocate via expedited process; grant allows districts flexibility to meet areas of greatest need & cont. providing equitable education to all students: https:// tinyurl.com/y8vkbjx7", "2020-05-14T15:17:22.000Z": "I will hold a news briefing today at 2:00PM to discuss the latest updates on COVID-19.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-14T15:08:54.000Z": "REMINDER: @CTNationalGuard is conducting Operation American Resolve today, which includes a flyover salute of the Guard's C-130H aircraft over hospitals and health care facilities across Connecticut.\n\nHere's the schedule. Times are estimates within +/- 5 minutes.\n\n(1/4)", "2020-05-14T14:46:34.000Z": "U.S. and state flags in Connecticut will remain lowered on Friday, May 15, in recognition of Peace Officers Memorial Day. https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/05-2020/Governor-Lamont-Directs-Flags-to-Remain-Lowered-Friday-for-Peace-Officers-Memorial-Day ", "2020-05-14T13:58:59.000Z": "HAPPENING NOW: Business committee of the Reopen Connecticut Advisory Group is holding a roundtable discussion about the impact of COVID-19 on the state's businesses.\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-14T12:12:50.000Z": "Increasing the amount of testing that's being done is a critical component of our efforts to keep Connecticut safe.\n\nI'm grateful to @CVSHealth for their commitment to expand testing in our state through the addition of these 12 new test sites. https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/05-2020/Governor-Lamont-Applauds-CVS-Health-Announcement-on-12-New-Test-Sites ", "2020-05-14T00:37:04.000Z": "I signed an Executive Order today that continues to take several actions on mitigating the spread of COVID-19 in our state. This includes extending the date of the suspension of the fee on single-use plastic bags through June 30. https:// portal.ct.gov/-/media/Office -of-the-Governor/Executive-Orders/Lamont-Executive-Orders/Executive-Order-No-7NN.pdf?la=en ", "2020-05-13T22:54:52.000Z": "Here is the video of our news briefing this afternoon with the latest updates on COVID-19 Governor Lamont's May 13, 2020 4:30PM Coronavirus Update Governor Ned Lamont's 4:30 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-05-13T13:05:38.000Z": "Do you have questions about child care in the time of COVID-19? Visit the Office of Early Childhood FAQ page for answers: https:// ctoec.org/covid-19/coronavirus-covid-19-faq/ ", "2020-05-13T20:42:33.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 34,855 people tested positive (+522)\n- 3,125 people have died (+84)\n- 1,158 patients are currently hospitalized (-31)\n- 142,943 tests have been reported to the state (+4,122)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-13T20:28:18.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-13T18:14:42.000Z": "Wallingford 11:55 a.m.\nMeriden 11:57 a.m.\nHarford 12:08 p.m.\nFarmington 12:18 p.m.\nNew Britain 12:19 p.m.\nBristol 12:20 p.m.\nManchester 12:23 p.m.\nVernon 12:24 p.m.\nMiddletown 12:25 p.m.\nNew London 12:32 p.m.", "2020-05-13T18:14:41.000Z": "Locations and times include:\nTorrington 11:08 a.m.\nSharon 11:13 a.m.\nWaterbury 11:21 a.m. and 12:15 p.m.\nDanbury 11:27 a.m.\nGreenwich 11:34 a.m.\nStamford 11:36 a.m.\nNorwalk 11:37 a.m.\nNew Canaan 11:39 a.m.\nBridgeport 11:43 a.m. and 12:09 p.m.\nNew Haven 11:48 a.m.\nDerby 11:50 a.m.", "2020-05-13T18:12:55.000Z": "The 103rd Airlift Wing's #FlyingYankees have scheduled a salute to Connecticut health care workers tomorrow, May 14th with C-130H Hercules aircraft conducting flyovers of hospitals and healthcare facilities throughout the state as part of Operation American Resolve.", "2020-05-13T17:13:47.000Z": "Great news for #CT from @GovNedLamont : the state has received its largest #PPE shipment yet. These crucial supplies must get to our frontline workers, especially in nursing homes, assisted-living facilities & hospitals, ASAP.", "2020-05-13T16:55:33.000Z": "I will hold a news briefing today at 4:30PM to discuss the latest updates on COVID-19.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-13T15:32:53.000Z": "Members of the Reopen Connecticut Advisory Group's business committee will hold a roundtable discussion on May 14 at 10AM regarding the impact of COVID-19 on businesses. It will stream live on @CTNetworkTV .\n\nHave a question? Send it to reopen@ct.gov. https:// bit.ly/3dFAyKs", "2020-05-12T23:14:41.000Z": "JUST IN: @GovNedLamont Order unleashes outdoor activities! Happy to have helped @CTBar & @CT_APA in advising on it. Check out my Friday @UConnCLEAR webinar, w/special guest @DDSHartford Aimee Chambers: https:// bit.ly/3dDyT8c Quote Tweet Governor Ned Lamont @GovNedLamont I signed an Executive Order today that will help expedite the various approval processes so that restaurants can expand outdoor dining areas. (1/2) Show this thread", "2020-05-12T23:09:07.000Z": "[Pages 5-7]\n\n(2/2)", "2020-05-12T23:09:06.000Z": "I signed an Executive Order today that will help expedite the various approval processes so that restaurants can expand outdoor dining areas. (1/2)", "2020-05-12T22:31:01.000Z": "Here is the video of our news briefing from this afternoon with updates on COVID-19 Governor Lamont's May 12, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-05-12T20:06:48.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 34,333 people tested positive (+568)\n- 3,041 people have died (+33)\n- 1,189 patients are currently hospitalized (-23)\n- 138,424 tests have been reported to the state (+5,916)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-12T19:58:36.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-12T17:42:22.000Z": "Over the last several days, the state received its largest shipment of PPE to date: 6 million surgical masks 500k protective masks 100k surgical gowns 100k temporal thermometers @CTNationalGuard will distribute the gear to frontline workers. https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/05-2020/Governor-Lamont-Announces-Connecticut-Receives-Its-Largest-Shipment-of-PPE ", "2020-05-12T17:00:07.000Z": "I will hold a news briefing today at 4:00PM to discuss the latest updates on COVID-19 in Connecticut.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-11T17:55:30.000Z": "Students: you have the power to make a difference! @LGSusanB  #COVID19 Computing Challenge asks you to consider COVID's impact on your community & use #STEM skills to help design creative solutions to address problems that have arisen due to the pandemic: https:// tinyurl.com/y9t7kpoe .", "2020-05-11T23:17:34.000Z": "Thank you to @AthenaHCS for their partnership in this effort to improve protections for some of our most vulnerable.", "2020-05-11T23:03:12.000Z": "Proud to be leading the way with our COVID-19 recovery centers that we know will save lives. Thanks to @CTDPH for putting this plan together and a heartfelt thank you to the nursing home workers who need to be celebrated for their hard work and dedication. https:// nbcnews.com/news/us-news/c onnecticut-launches-bold-new-approach-virus-crisis-covid-19-only-n1204546 ", "2020-05-11T22:09:51.000Z": "Here is the video of our press conference from this afternoon with updates on COVID-19 in Connecticut. Governor Lamont's May 11, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-05-11T20:03:34.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 33,765 people tested positive (+211)\n- 3,008 people have died (+41)\n- 1,212 patients are currently hospitalized (-30)\n- 132,508 tests have been reported to the state (+2,316)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-11T19:58:47.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-11T19:20:51.000Z": "Potentially severe thunderstorms are moving across the state. Please remain aware of changing weather conditions. #Preparedness  #CTDEMHS  #EmergencyManagement", "2020-05-11T17:49:38.000Z": "ICYMI: Roundtable discussion of the education committee of the Reopen Connecticut Advisory Group Reopen Connecticut Advisory Group education roundtable Roundtable discussion of the education committee of the Reopen Connecticut Advisory Group regarding the impact of COVID-19 on the state's education system. #... youtube.com", "2020-05-11T16:53:34.000Z": "I will hold a news briefing today at 4:00PM to discuss the latest updates on COVID-19 in Connecticut.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-11T15:29:21.000Z": "I'm at the State Emergency Operations Center in #Hartford participating in a video conference coordinated by the @WhiteHouse Coronavirus Task Force with the governors of every state to review the latest info on COVID-19.", "2020-05-11T15:04:24.000Z": "HAPPENING NOW: Roundtable discussion of the Reopen Connecticut Advisory Group's education committee regarding the impact of COVID-19 on schools.\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-11T12:33:50.000Z": "I'm going to call into @WNPR 's @WhereWeLive this morning at 9:00AM to discuss the latest updates on COVID-19. Listen live: https:// wnpr.org", "2020-05-10T18:14:55.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 33,554 people tested positive (+570)\n- 2,967 people have died (+35)\n- 1,242 patients are currently hospitalized (-59)\n- 130,192 tests have been reported to the state (+6,623)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-10T16:35:38.000Z": "Yesterday, @CTDPH distributed 800 iPads to nursing homes across Connecticut in time for #MothersDay . The facilities are required to utilize the technology to help arrange video chats with family during this COVID-19 crisis. Nursing homes get iPads to keep residents connected HARTFORD, Conn. (AP) - NURSING HOMES The state health department distributed iPads to Connecticut nursing homes Saturday with an order to help residents who have been unable to have... apnews.com", "2020-05-10T16:23:23.000Z": "Los documentos que detallan las reglas específicas de la industria en la fase 1 de los planes de reapertura de Connecticut, que esperamos comiencen el 20 de Mayo, ahora están disponibles para leer en español.\n\nHaga clic aquí: 404 Error Page portal.ct.gov", "2020-05-10T12:06:39.000Z": "Members of the Reopen Connecticut Advisory Group will hold a roundtable on May 11 at 11AM regarding the impact of COVID-19 on the education system.\n\nHave a question about COVID-19 and schools? Send it to reopen@ct.gov.\n\nIt will air live on @CTNetworkTV . https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/05-2020/Governor-Lamont-Announces-Reopen-Connecticut-Advisory-Group-to-Hold-Education-Roundtable ", "2020-05-10T11:37:39.000Z": "Wishing a #HappyMothersDay to all of the extraordinary moms who go above and beyond. Thank you for every hug, word of encouragement, and support you have provided. You are pillars of strength, and we appreciate you so much.", "2020-05-10T00:50:36.000Z": "Our administration has issued an order implementing standards at nursing homes to ensure loved ones can speak with their families either through windows or video conferencing", "2020-05-09T18:27:52.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 32,984 people tested positive (+573)\n- 2,932 people have died (+58)\n- 1,301 patients are currently hospitalized (-35)\n- 123,569 tests have been reported to the state (+3,028)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-09T14:59:58.000Z": "Today we released documents detailing rules for businesses under Phase 1 of Connecticut's reopening plans, which we expect to begin May 20, including:\n\nHair salons/barbershops\nMuseums/zoos (outdoor)\nOffices\nRestaurants (outdoor)\nRetail\n\nRead the docs: https:// portal.ct.gov/DECD/Content/C oronavirus-Business-Recovery/Sector-Rules-for-May-20-Reopen ", "2020-05-08T22:45:08.000Z": "Personal services (hair) guidance for Phase 1:\n\nPermitted to operate with strict safety protocols in place. (5/5)", "2020-05-08T22:45:00.000Z": "Retail guidance for Phase 1:\n\nThis next phase allows some walk-ins with certain safety perameters. (4/5)", "2020-05-08T22:44:51.000Z": "Office guidance for Phase 1:\n\nNo more than 50% capacity, and recommending that staff is assembled in teams to limit potential spread among the entire staff. (3/5)", "2020-05-08T22:44:45.000Z": "Restaurant guidance for Phase 1:\n\nOutdoor dining only with certain rules, as recommended by the CDC. (2/5)", "2020-05-08T22:44:36.000Z": "Our administration has been working closely with medical experts and businesses on a reopen strategy for Connecticut that focuses on the protocols necessary to keep us safe.\n\nHere's some details about what we're looking at for the first phase of reopening on May 20. (1/5)", "2020-05-08T22:24:23.000Z": "Here is the video of our news briefing from this afternoon. It includes a discussion on our guidance for the first phase of our reopening plans. Governor Lamont's May 8, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-05-08T21:24:11.000Z": "During our news briefing that just concluded, we outlined some details that will be included in Phase 1 of our May 20 reopening plans. We're finalizing those guidance documents now and expect to have them later tonight or tomorrow. We'll post them here as soon as they're ready.", "2020-05-08T20:06:15.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 32,411 people tested positive (+627)\n- 2,874 people have died (+77)\n- 1,336 patients are currently hospitalized (-49)\n- 120,541 tests have been reported to the state (+4,367)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-08T19:59:15.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut.\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-08T19:08:04.000Z": "David Lehman, Commissioner of @CTDECD , will join me at my news briefing this afternoon to discuss the latest guidance for businesses on #COVID19 . We'll be getting started at 4:00PM.", "2020-05-08T17:12:26.000Z": "As of May 7th, the Connecticut National Guard has distributed 14,233,459 pieces of personal protective equipment throughout the state on behalf of the Department of Public Health. #InThisTogether  #ConnecticutsHomeTeam  #COVID19", "2020-05-08T14:27:07.000Z": "I will hold a news briefing to discuss the latest updates on COVID-19 today at 4:00PM.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-08T14:24:11.000Z": "+1,550 @BridgeportPSchl students are learning-through-play at home bc of LEGO's Replay program. Judging from the thank you notes & smiles, the brick boxes are a hit! @GovNedLamont Learn From Home Taskforce is partnering w @LEGO_Group to expand donations to even more CT students", "2020-05-08T11:22:24.000Z": "#DCF  #COVID  #WeGotThis The Middletown Press\nby Cassandra Day\nTeens at Middletown state psychiatric center learn art can heal https:// middletownpress.com/middletown/art icle/Teens-at-Middletown-state-psychiatric-center-15254905.php ", "2020-05-07T23:19:09.000Z": "Suspending these regulations will help our state significantly increasing the number of people who are being tested for COVID-19, particularly for those in underserved communities or who may not have a primary care physician. Governor Lamont Announces Suspension of Regulations to Support a Major Expansion of COVID-19 Testing Governor Ned Lamont today announced that his administration is lifting certain regulations on who can order diagnostic tests to allow for a major expansion of COVID-19 testing in the state. portal.ct.gov", "2020-05-07T23:14:17.000Z": "There are things in life you're forever grateful for and people you'll never forget. Our nurses are just that. The nurses I've had to chance to meet during this crisis have made an unforgettable impact on thousands of families. We'll never forget you or what you've done for us.", "2020-05-07T22:39:18.000Z": "Here is the video of our news briefing from earlier today, during which I outlined our seven criteria for Phase 1 of reopening. Governor Lamont's May 7, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-05-07T22:10:30.000Z": "I'm inspired by so many of the nurses in our state who take on numerous roles for patients and their families during times of need. They are true heroes.\n\nThanks to the nurses at @SaintFrancisCT for allowing me to stop by and share my gratitude with you today. #NursesWeek", "2020-05-07T21:04:10.000Z": "\"Each and every one of you are called for this moment. Each and every one of you is stepping up.\" - @GovNedLamont The Governor visited Saint Francis today to meet with our nurses and to learn more about the care they are providing COVID-19 patients. #TrinityHealthTogether", "2020-05-07T20:38:00.000Z": "Updated data on COVID-19 hospital discharges in Connecticut:\n\n- 9,389 patients have been hospitalized to date\n- 1,385 patients are currently hospitalized\n- 5,413 patients have been discharged from hospitals", "2020-05-07T20:20:30.000Z": "We'll continue to monitor these areas over the coming days as we move toward Phase 1 of reopening.", "2020-05-07T20:20:29.000Z": "We've set seven criteria to meet for Phase 1 of reopening.", "2020-05-07T20:04:09.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 31,784 people tested positive (+789)\n- 2,797 people have died (+79)\n- 1,385 patients are currently hospitalized (-60)\n- 116,174 tests have been reported to the state (+4,727)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-07T19:58:53.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-07T19:04:06.000Z": "complete filing applications for Pandemic Unemployment Assistance #PUA . The site, located on http:// filectui.com , can be identified by a #redbutton labeled with the PUA designation. http:// ctdol.state.ct.us/communic/2020- 5/5-7%20PUA%20application%20posted%20to%20filing%20site.pdf ", "2020-05-07T19:03:48.000Z": "In The News: Pandemic Unemployment Assistance Link for Self-Employed Now Active & Posted To Filing Site. More than 38,000 complete first step and can now file on PUA site. Today, the Connecticut Department of Labor made active the filing site so those who are #selfemployed can...", "2020-05-07T15:51:49.000Z": "I will hold a news briefing today at 4:00PM to discuss the latest updates on COVID-19.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-07T13:57:15.000Z": "Thank you @USDANutrition ! This will support food security for 270,000 Connecticut children. More at http:// ct.gov/snap & scroll to: @GovNedLamont announces federal approval of increased SNAP food assistance for children in school meals program. @EducateCT Quote Tweet USDA Nutrition @USDANutrition Innovative program to feed children during school closures has been extended in Connecticut! Read more http:// ow.ly/wRE530qDLxX  @ctdss  @EducateCT  #COVID19", "2020-05-07T11:59:25.000Z": "From defending titles to defending #CT against #COVID19 , Ray Allen has joined the #4CT team to help us stand up and protect our most vulnerable in this time of need. Learn how you can join the team at http:// 4-ct.org . https:// youtube.com/watch?v=Usv_Kf NkS5Y ", "2020-05-06T19:01:29.000Z": "We're proud to announce that @GovNedLamont is teaming up with us @SavewithSummer to help CT residents tackle their student debt so they can focus on critical needs such as food and medical supplies. Read more about our partnership here: https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/05-2020/Governor-Lamont-Announces-Free-Advisory-Support-for-Student-Loan-Borrowers ", "2020-05-06T23:10:39.000Z": "Here is the video of our news briefing this afternoon with updates on COVID-19. Governor Lamont's May 6, 2020 3PM Coronavirus Update Governor Ned Lamont's 3:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-05-06T20:38:55.000Z": "I had the opportunity today to stop by @hartfordhosp and thank some of the nurses in-person for everything they provide our state.\n\nI am in awe by their energy, compassion, and dedication, and I cant thank them enough for everything they do. #NationalNursesDay  #ThankYouNurses", "2020-05-06T20:07:04.000Z": "Since March 17, DEEP has allowed retailers to temporarily suspend their redemption activities, providing them with greater flexibility to more effectively maintain and manage their store environments with a focus on product supply and safety measures during the COVID-19 pandemic.", "2020-05-06T20:07:03.000Z": "Following extensive discussion between DEEP and many stakeholders, retailers will resume bottling redemption activities on a limited basis beginning May 20, with a full resumption of operations by June 3. #Recycling  #BottleRedemption", "2020-05-06T19:22:02.000Z": "The education committee of the Reopen Connecticut Advisory Group is recommending a gradual reopening of higher education campuses - at the discretion of each institution and depending on health conditions - based on factors detailed in a report today: https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/05-2020/Governor-Lamont-Receives-Recommendations-for-a-Phased-Reopening-of-Colleges-and-Universities ", "2020-05-06T19:02:29.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 30,995 people tested positive (+374)\n- 2,718 people have died (+85)\n- 1,445 patients are currently hospitalized (-55)\n- 111,447 tests have been reported to the state (+2,804)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-06T18:59:49.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-06T16:31:33.000Z": "I will hold a news briefing to discuss the latest updates on COVID-19 today at 3:00PM.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-06T15:13:01.000Z": "Connecticut residents who have been financially impacted by COVID-19 can receive free assistance managing student loans through @SavewithSummer .\n\nThe service helps borrowers find, compare and enroll in dozens of loan assistance and forgiveness programs. https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/05-2020/Governor-Lamont-Announces-Free-Advisory-Support-for-Student-Loan-Borrowers ", "2020-05-06T13:56:11.000Z": "The Office of the Attorney General announced today the formation of a joint state-federal task force with the U.S. Attorney's Office, FBI and Chief State's Attorney's Office to investigate and prosecute COVID-19 fraud.", "2020-05-06T13:39:47.000Z": "Yesterday, Airmen from the 103rd Airlift Wing helped the Department of Public Health distribute personal protective equipment to representatives from healthcare facilities at a distribution point in New Haven. #InThisTogether  #ConnecticutsHomeTeam  #COVID19", "2020-05-06T11:35:39.000Z": "Happy #NationalNursesDay to all of the courageous, dedicated nurses across our state.\n\nNurses work tirelessly to keep us safe and healthy. It's an incredibly tough job, made even more difficult in recent weeks. Thank you for protecting our families, neighbors, and loved ones.", "2020-05-05T22:27:15.000Z": "Here is the full video of our news briefing from this afternoon, which mainly dealt with the impact of COVID-19 on our education system. Governor Lamont's May 5, 2020 4PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-05-05T22:21:46.000Z": "Early Childhood Commissioner Beth Bye announcing that summer camps in Connecticut can open on June 29: \"We've developed guidelines to ensure added protective measures to reduce the likelihood of exposure to the virus.\"\n\nThat guidance will be released by May 15. @CT_OEC  @BethBye5", "2020-05-05T22:04:45.000Z": "State Education Commissioner Miguel Cardona: \"For the students listening, your school year has not ended. Your teacher, school, and district leaders and staff are committed to supporting your learning for the remainder of the school year.\" @EducateCT  @teachcardona", "2020-05-05T21:53:04.000Z": "Having to finish the school year this way breaks my heart. I wanted to do everything we could to get schools open for at least a couple of weeks and give students some sense of conclusion.\n\nI applaud the many teachers who've been going above and beyond throughout this crisis.", "2020-05-05T20:03:48.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 30,621 people tested positive (+648)\n- 2,633 people have died (+77)\n- 1,500 patients are currently hospitalized (+36)\n- 108,643 tests have been reported to the state (+3,313)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-05-05T19:59:24.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-05T19:00:00.000Z": ". @GovNedLamont announced statewide expansion of free online job training program SkillUp CT. CT expands 'SkillUp' online training for coronavirus job victims Free program offers 5,000 courses spanning information technology, business analysis, health, project management and other fields. newstimes.com", "2020-05-05T18:13:01.000Z": "While this current situation is truly difficult to digest, we've seen teachers showing up for students in every way possible & they'll cont. to educate w sense of urgency & passion! #SendTeachersLove (vids, pics, etc) so they know how much they mean to us! #TeacherAppreciationDay", "2020-05-05T16:40:38.000Z": "Live now answering questions from @Record_Journal  Quote Tweet Record-Journal @Record_Journal Live interview now with @GovNedLamont follow here for highlights and tune in on Facebook. https:// facebook.com/recordjournaln ewspaper/videos/631811417373821/  Show this thread", "2020-05-05T13:56:21.000Z": "I will hold my daily COVID-19 news briefing today at 4PM. We'll be joined by @EducateCT Commissioner @teachcardona and @CT_OEC Commissioner @BethBye5 , who will discuss the latest info on schools.\n\nWatch live Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-05T13:43:18.000Z": "#BREAKING : Due to the ongoing pandemic, in-person classes at K-12 schools in Connecticut will remain canceled for the rest of the academic year.\n\nGiven the circumstances, this is the best course of action for the safety of students, educators, and staff. https:// bit.ly/2WoBw6Q", "2020-05-05T11:30:00.000Z": "Happy National Teacher Day!\n\nI cannot thank every teacher enough for what they do for our state.\n\nI am thankful that the best teachers in the world are right here in Connecticut. We appreciate each of you. #ThankATeacher  #TeacherDay2020  #SendTeachersLove", "2020-05-04T22:58:42.000Z": "Here's the video of our news briefing from earlier today with updates on COVID-19. Governor Lamont's May 4, 2020 4:15PM Coronavirus Update Governor Ned Lamont's 4:15 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-05-04T20:17:35.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-04T19:51:19.000Z": "REMINDER: VA and SSI recipients with eligible children need to act by TOMORROW May, 5th to add dependent information for their automatic Economic Impact Payment. \n\nPlease visit: Economic Impact Payment Information Center | Internal Revenue Service Mailed Check Payments May Be Sent As Debit Cards If Get My Payment says your Economic Impact Payment will be issued as a check, you may instead get a debit card in a plain envelope from \"Money... irs.gov", "2020-05-04T19:32:47.000Z": "I've asked two Connecticut state legislators who are also doctors - @SaudAnwarCT and @docpetit_art - to join me at my news briefing today to share some of their insights on COVID-19.\n\nWe'll be getting started around 4:15PM.", "2020-05-04T19:19:06.000Z": "UPDATE: Today's news briefing will begin at 4:15 p.m. Quote Tweet Governor Ned Lamont @GovNedLamont I will hold a news briefing today at 4:00 p.m. to discuss the latest updates on COVID-19 in Connecticut.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-04T17:08:54.000Z": "I will hold a news briefing today at 4:00 p.m. to discuss the latest updates on COVID-19 in Connecticut.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-04T15:54:56.000Z": "@GovNedLamont announced yesterday that the Governors of the 7-state regional re-open effort that CT is participating in agreed to the following working principles around the procurement of PPE.", "2020-05-03T17:58:53.000Z": "We announced a joint multi-state agreement to develop a regional supply chain for personal protective equipment, other medical equipment & testing.\n\nWe need a consistent approach for moving our states out of this crisis. That includes ensuring a sufficient supply of PPE & tests.", "2020-05-03T17:10:05.000Z": "BREAKING: NJ, NY, CT, PA, DE, RI and MA are launching a regional supply chain for PPE and other medical equipment.\n\nWe shouldn't be competing against each other for lifesaving resources. There is strength in our unity.", "2020-05-03T16:34:11.000Z": "Combining the efforts several states into a regional purchasing initiative will help our states obtain needed PPE, tests, and other medical equipment without competing against each other.\n\nThanks to our neighbors in NY, NJ, RI, MA, PA, and DE for joining us in this initiative. Quote Tweet Andrew Cuomo @NYGovCuomo #BREAKING : NY, NJ, CT, PA, DE, RI and MA are launching a regional purchasing consortium to jointly procure PPE, tests, ventilators and other medical equipment.\n\nThis will increase our market power and help prevent price-gouging.\n\nStates are stronger when we work together.", "2020-05-03T16:25:01.000Z": "In a few minutes I'll be joining @NYGovCuomo and several governors from our neighboring states to make an announcement regarding a PPE supply chain in the northeast. Quote Tweet Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus . Watch Live: https:// pscp.tv/w/cX2SDDIyNjcx MDN8MXlOR2FRQmFXcnJHakU9AbzlxdJi06QrF1dBagnQKK7YO4IRTYX630bIkEHX  Show this thread", "2020-05-02T23:00:37.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 29,287 people tested positive (+523)\n- 2,436 people have died (+97)\n- 1,551 patients are currently hospitalized (-41)\n- 102,493 tests have been reported to the state (+2,236)\n\nFor more data sets, visit http:// ct.gov/coronavirus", "2020-05-02T16:00:00.000Z": "Do you have experience working in the medical field or are studying to one day? CT hospitals have put out a call for volunteers to help them combat the Coronavirus. If you have the capability to help, please go to http:// ctresponds.ct.gov to sign up today!", "2020-05-02T15:21:05.000Z": "Congratulations to two of our newest  Connecticut State Guard members who have stepped forward to assist with the COVID response. Alexandra Mooney, a Connecticut pharmacist, just swore into the Connecticut State Guard this morning. Alecia Haythe sworn in as a nurse on Tuesday.", "2020-05-02T13:43:19.000Z": "The @CTNationalGuard led by @CTNGTAG are on the front lines of @GovNedLamont 's response to the COVID-19 crisis, constantly answering the call for any and every mission, 24/7. Quote Tweet Maj. Gen. Fran Evon @CTNGTAG At 10:00 last evening these great Americans thought they were sleeping in today. This morning they are delivering testing supplies to nursing homes on behalf of DPH.  Crusader Company- 1/102nd Infantry leading the way. #connecticutshometeam Show this thread", "2020-05-02T13:08:23.000Z": "At 10:00 last evening these great Americans thought they were sleeping in today. This morning they are delivering testing supplies to nursing homes on behalf of DPH.  Crusader Company- 1/102nd Infantry leading the way. #connecticutshometeam", "2020-05-02T13:34:06.000Z": "More emergency SNAP benefits coming for nearly 100,000 CT households, as announced in @GovNedLamont briefing summary yesterday. These extra federal benefits will be on EBT cards Friday, May 8. Details at Food Assistance - SNAP The Supplemental Nutrition Assistance Program (SNAP), formerly known as Food Stamps, helps eligible individuals and families afford the cost of food at supermarkets, grocery stores and farmers'... portal.ct.gov", "2020-05-01T21:05:26.000Z": "With nice weather forecast for this weekend, CTDEEP anticipates several state parks will reach capacity and close for the day. Please practice social distancing in the parks and follow the rules so everyone can safely enjoy the outdoors. Follow @CTStateParks for closure info.", "2020-05-01T21:07:47.000Z": "Heroes work here. Today, I joined Mayor @joeganim , @ChrisMurphyCT , @SenBlumenthal and @LGSusanB to say thank you to the dedicated healthcare workers and heroes at Northbridge Healthcare Center in Bridgeport. They're working around the clock and we couldn't be more proud of them.", "2020-05-01T15:22:42.000Z": "We are resuming stocking trout into Fairfield County waters open to the public for fishing. Some waters may remain closed and will not get stocked. Social distancing is a must, and anglers must remain at least 6 feet from one another (unless fishing with household members).", "2020-05-01T20:33:43.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 28,764 people tested positive (+1,064)\n- 2,339 people have died (+82)\n- 1,592 patients are currently hospitalized (-58)\n- 100,257 tests have been reported to the state (+3,124)\n\nFor more data sets, visit http:// ct.gov/coronavirus", "2020-05-01T17:20:53.000Z": "Here is the video of our press conference from earlier today with updates on COVID-19. Governor Lamont's May 1, 2020 10:45AM Coronavirus Update Governor Ned Lamont's 10:45 a.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronavir... youtube.com", "2020-05-01T14:45:14.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-05-01T14:04:41.000Z": "Members of the Connecticut National Guard assisted the Department of Public Health distribute personal protective equipment to representatives from hospitals and first responders at a distribution center at the Bethlehem Fairgrounds. #InThisTogether  #ConnecticutsHomeTeam  #COVID19", "2020-05-01T12:58:50.000Z": "questions visit: https:// facebook.com/RepRobynPorter/ You may also send your questions in advance at Robyn.Porter@cga.ct.gov", "2020-05-01T12:58:29.000Z": "Join #CTDOL Deputy Commissioner Dante Bartolomeo & Representative Robyn Porter for a Virtual Facebook Live Town Hall @ 3:30 p.m TODAY (5/1/20). They will discuss #labor and #unemployment changes due to the ongoing #COVID -19 crisis. To see the live feed and to participate with ...", "2020-05-01T12:50:38.000Z": "UPDATE: The start time for today's news briefing has been changed to 10:45AM. Quote Tweet Governor Ned Lamont @GovNedLamont I'm going to hold a news briefing today at 11:00AM to discuss the latest updates on COVID-19 in Connecticut.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-05-01T12:22:45.000Z": "I'm going to call into #Bridgeport radio station @WICC600 in a few minutes to chat with hosts Tony and @SheketoffNews about the latest updates on COVID-19.\n\nShould be on the air around 8:30AM. Listen live: WICC-AM WICC600 wicc600.com", "2020-05-01T12:09:02.000Z": "I'm going to hold a news briefing today at 11:00AM to discuss the latest updates on COVID-19 in Connecticut.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-04-30T22:50:21.000Z": "We're looking at May 20 for the next phase of reopening, targeting certain industries, some of which will need modifications to ensure safety measures are in place so we don't cause another spike.", "2020-04-30T22:50:07.000Z": "We're looking at a phased-in approach on reopening depending upon what can be done in certain industries in a safe way.\n\nWe're taking several factors into account, including: Contact proximity Contact length Number of contacts", "2020-04-30T22:49:47.000Z": "The reopening strategy that we're developing contains several criteria to ensure that we can return to a new normal in the safest way possible, based on scientific, data-driven principles.", "2020-05-01T11:18:39.000Z": "I'm going to call into @WTIC1080 in a few minutes to talk about the latest COVID-19 updates. Should be on the air around 7:20AM.\n\nListen live: Homepage 1080 AM WTIC NEWSTALK - Connecticut News and Talk wtic.radio.com", "2020-05-01T00:15:11.000Z": "Check out the summary of all the announcements from our office today on COVID-19. This includes: Presentation on phased-in reopening strategy Up-to-date data on every nursing home and assisted living facility https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/04-2020/Governor-Lamont-Coronavirus-Update-April-30 ", "2020-04-30T23:40:21.000Z": "Thank you @GovNedLamont for this thoughtful, detailed approach to reopening CT Quote Tweet Governor Ned Lamont @GovNedLamont The reopening strategy that we're developing contains several criteria to ensure that we can return to a new normal in the safest way possible, based on scientific, data-driven principles.", "2020-04-30T23:40:51.000Z": "We've made progress flattening the curve in Connecticut, but moving forward we need to act carefully without causing additional harm.\n\nThere will be a phased-in reopening approach based on the risk posed.\n\nHere's a look at our strategy right now on how to get this done.", "2020-04-30T22:59:15.000Z": "I'm about to go on @WFSBnews with host @DennisHouseTV to answer some of your COVID-19 questions.\n\nTune in now! Quote Tweet WFSB Channel 3 @WFSBnews Coronavirus in Connecticut: @GovNedLamont is joining @DennisHouseTV for a special LIVE edition of Face the State to answer your coronavirus questions. Stream it live here: https:// wfsb.com/news/livestrea m/ ", "2020-04-30T19:43:44.000Z": "Effective immediately, parties who have an agreement may have their family court cases resolved without having to come to court. For more information, visit: https:// jud.ct.gov/HomePDFs/Handl ingFamilyMattersRemotely.pdf  .", "2020-04-30T20:06:14.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 27,700 people tested positive (+933)\n- 2,257 people have died (+89)\n- 1,650 patients are currently hospitalized (-41)\n- 97,133 tests have been reported to the state (+2,315)\n\nFor more data sets, visit http:// ct.gov/coronavirus", "2020-04-30T20:01:29.000Z": "HAPPENING NOW: News briefing with updates on COVID-19 in Connecticut\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-04-30T18:01:20.000Z": "Today, our Guardsmen assisted the Department of Public Health distribute PPE to representatives from hospitals and first responders at Mohegan Sun. #InThisTogether  #ConnecticutsHomeTeam  #COVID19", "2020-04-30T16:57:47.000Z": "In the News: Labor department launches new system today for #Selfemployed to apply for federal #unemployment benefits. http:// ow.ly/S0LW50ztgwl", "2020-04-30T16:49:00.000Z": "I will hold a news briefing today at 4PM to discuss the latest updates on COVID-19.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-04-30T15:59:56.000Z": "Beginning today, @CTDOL is accepting claim applications for self-employed Connecticut residents to apply for federal unemployment benefits. http:// ctdol.state.ct.us/communic/2020- 4/Labor%20Department%20Launches%20New%20System%20Today%20For%20Self-Employed%20To%20Apply%20For%20Federal%20Unemployment%20Benefits.pdf ", "2020-04-30T14:33:33.000Z": "Workers & Employers, please join CTDOL's UI Weekly Webinar today (4/30/20)​ at 11 AM. This week we will cover Stimulus Payment Updates, Overpayment Claims, Access Health, and answers to your questions​. Register here: https:// register.gotowebinar.com/register/78945 45570944055563  ...", "2020-04-30T01:23:31.000Z": "Sincere thanks to #Connecticut  @GovNedLamont for joining us to answer viewer questions on #COVID19 . \nWe're all looking forward to the day when we emerge from this #pandemic . #AskGovLamont  @news12ct", "2020-04-29T23:28:51.000Z": "Shout out to Luann's Bakery Cafe in Ellington for sending baked goods to the DOC staff taking care of COVID-19 patients at Northern Correctional.", "2020-04-29T23:44:20.000Z": "COST stands ready to support our towns in this effort, including assisting small towns in collaborating with neighboring communities on a regional basis to set the stage for long-term recovery and meet the needs of our residents and businesses. Quote Tweet Governor Ned Lamont @GovNedLamont Emergency response is most effective when state-level recovery teams work with coordinated efforts on the local level. That's why we're asking communities to establish Local Long-Term Recovery Committees. @LGSusanB will help lead these efforts.\n\nINFO: https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/04-2020/Governor-Lamont-Urges-Local-Governments-and-Community-Partners ", "2020-04-29T23:27:53.000Z": "Tune into @News12CT tonight at 8:30PM. I'll be answering some of your questions on #COVID19 . #AskGovLamont Quote Tweet Eric Landskroner @ericlandskroner . @GovNedLamont answers YOUR #covid19 questions tonight at 8:30 @News12CT . Join us for #AskGovLamont", "2020-04-29T23:16:26.000Z": "Especially as summer approaches, I know that this pandemic is having a real impact on all of us. Working with our medical experts, we are going to continue providing the best guidance we can as soon as we can so that we can do our best to keep people safe.", "2020-04-29T23:09:46.000Z": "Emergency response is most effective when state-level recovery teams work with coordinated efforts on the local level. That's why we're asking communities to establish Local Long-Term Recovery Committees. @LGSusanB will help lead these efforts.\n\nINFO: https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/04-2020/Governor-Lamont-Urges-Local-Governments-and-Community-Partners ", "2020-04-29T22:49:19.000Z": "Rudy Marconi is a fighter, but his experience overcoming COVID-19 was not easy. I'm happy that he's back to form and could join us today to share his firsthand account. #StaySafeStayHome  #InThisTogetherCT", "2020-04-29T22:34:39.000Z": "Here is the video of our 4PM news briefing from earlier today. Governor Lamont's April 29, 2020 4:00PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-04-29T21:44:49.000Z": "...and happy birthday, Javier!  @Javstwtr", "2020-04-29T21:38:43.000Z": "I wanted to sing this myself, but my staff wouldn't let me. So, we got Connecticut resident and @NBCTheVoice champion @Javstwtr to deliver this message instead. #StaySafeStayHome  #InThisTogetherCT  #COVID19", "2020-04-29T21:13:15.000Z": "This is a huge step for our State and toward attacking COVID-19! Thank you @GovNedLamont Quote Tweet Governor Ned Lamont @GovNedLamont Contact tracing will help stop the spread of COVID-19 in our communities, and prevent small clusters or individual cases from turning into larger outbreaks.\n\nConnecticut's plan - ContaCT - builds off of local efforts to coordinate and scale contact tracing across the state.", "2020-04-29T20:58:21.000Z": "Unfortunately the fire alarm at the State Capitol caused our news briefing to be cut short today. @CTCapitolPolice tells us a contractor was doing work and accidentally set it off. We were briefly evacuated but all is good. We'll resume our daily news briefing tomorrow!", "2020-04-29T20:09:58.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 26,767 people tested positive (+455)\n- 2,168 people have died (+79)\n- 1,691 patients are currently hospitalized (-41)\n- 94,818 tests have been reported to the state (+2,073)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-04-29T19:59:31.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-04-29T19:47:54.000Z": "I've asked First Selectman Rudy Marconi of Ridgefield & State Rep. Jane Garibay of Windsor to join me at our 4PM briefing to discuss their experiences recovering from COVID. @LGSusanB will also discuss efforts encouraging communities to build Local Long-Term Recovery Committees.", "2020-04-29T19:00:00.000Z": "#CT  #manufacturers : Hear from Colin Cooper, the state's chief manufacturing officer, and other experts and find out how to deal w #COVID -19 disruptions on free @CCATInc - @CohnReznick webinar April 30. Now. Next. New. for CT Manufacturers With CohnReznick | Connecticut Center for Advanced Technology,... By CT Manufacturers for CT Manufacturers THURSDAY, APRIL 30 | 12:00-1:00 PM Co-hosted by AMEP In the wake of the coronavirus pandemic, many organizations are dealing with disruptions to customer... ccat.us", "2020-04-29T16:58:55.000Z": "The @CVSHealth rapid COVID-19 test site in #NewHaven continues to take appointments 7-days a week. Free for all patients Results within 30 minutes Does not require medical referral\n\nAnyone wanting to be tested must make an appointment in advance. https:// cvs.com/minuteclinic/c ovid-19-testing?icid=covid_testing_dt_banner ", "2020-04-29T16:11:23.000Z": "I will hold a news briefing today at 4:00 p.m. to discuss the latest updates on COVID-19.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-04-29T15:30:02.000Z": "Thank you to @GuidasDairy for their donations to @foodshare that will benefit so many families during this difficult time. Their generosity demonstrates the true spirit of supporting our neighbors. #InThisTogetherCT  #CTGrown", "2020-04-29T15:22:04.000Z": "We are grateful to the staff and volunteers at @foodshare who continue to provide nutritious food to thousands of families in need across Connecticut. \n\nWe will get through this #together .", "2020-04-29T11:44:24.000Z": "Contact tracing will help stop the spread of COVID-19 in our communities, and prevent small clusters or individual cases from turning into larger outbreaks.\n\nConnecticut's plan - ContaCT - builds off of local efforts to coordinate and scale contact tracing across the state.", "2020-04-28T23:52:29.000Z": "Expanding the base of who we are testing will reduce the spread of this virus in a dramatic way. That is why we are ramping up testing as quickly as we can.", "2020-04-28T22:31:02.000Z": "Here is the video of our 4PM news briefing from earlier today. Governor Lamont's April 28, 2020 4:00PM Coronavirus Update Governor Ned Lamont's 4:00 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-04-28T21:09:57.000Z": "Going live with @wolfblitzer on @CNN to discuss my approach to reopening Connecticut as well as provide the latest updates on our response to COVID-19. Tune in!", "2020-04-28T20:05:11.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 26,312 people tested positive (+315)\n- 2,089 people have died (+77)\n- 1,732 patients are currently hospitalized (-26)\n- 92,745 tests have been reported to the state (+1,999)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-04-28T20:02:15.000Z": "HAPPENING NOW: News briefing to discuss the latest updates on COVID-19 in Connecticut.\n\nWATCH LIVE CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-04-28T19:46:44.000Z": "To explain our state's plan to increase contact tracing, I've asked two of our epidemiologists from @CTDPH - Matt Cartter and Kristen Soto - to join me at today's news briefing.\n\nThis is a critical component of our efforts to reopen the state.\n\nWe'll be getting started at 4PM.", "2020-04-28T18:45:50.000Z": "Take it from @Chris_Meloni : Let's protect each other. #StaySafeStayHome  #InThisTogetherCT  #COVID19", "2020-04-28T16:36:58.000Z": "I will hold a news briefing to discuss updates on COVID-19 today at 4:00 p.m.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-04-28T14:54:40.000Z": "This morning, our Guardsmen assisted DPH distribute PPE to town representatives at a distribution center in West Hartford. This PPE is scheduled to be further distributed by the municipalities to local small businesses in the coming days. #InThisTogether  #ConnecticutsHomeTeam", "2020-04-28T13:53:36.000Z": "Press Release: Governor Lamont Announces #Labor Department Has Begun Issuing Supplemental $600 Stimulus Payments for State #Unemployment Benefits. http:// ctdol.state.ct.us/communic/2020- 4/Governor%20Lamont%20Announces%20Labor%20Department%20Has%20Begun%20Issuing%20Supplemental%20$600%20Stimulus%20Payments%20For%20State%20Unemployment%20Benefits.pdf ", "2020-04-28T11:55:21.000Z": "Happening today in the #Stamford area a little after 12pm Quote Tweet CT National Guard @CTNationalGuard If you're in the Stamford area, make sure to look to the skies tomorrow as the Air Force Thunderbirds and U.S. Navy Blue Angels will be conducting the #AmericaStrong flyover, a salute to those working on the frontlines of the battle against COVID-19. #InThisTogether", "2020-04-27T16:28:52.000Z": "For every $1 Connecticut taxpayers send the federal govt, we receive $0.74 back in federal support.\n\nWe're happy to do our part. The point of having a federal govt is that we're all in this together.\n\nI hope the President learns that soon. If not, feel free to send our $$ back. Quote Tweet Donald J. Trump @realDonaldTrump Why should the people and taxpayers of America be bailing out poorly run states (like Illinois, as example) and cities, in all cases Democrat run and managed, when most of the other states are not looking for bailout help? I am open to discussing anything, but just asking?", "2020-04-28T01:40:09.000Z": "We want to get Connecticut back to work and we want to do it safely. Protecting public health must take priority, and our efforts have been working.", "2020-04-28T00:55:31.000Z": "Tonight I'll be going on @CNN 's @CuomoPrimeTime with host @ChrisCuomo to discuss the latest updates on COVID-19 in Connecticut. Should be on the air around 9:15 p.m.", "2020-04-28T00:35:15.000Z": "*New today: A total of 90,746 COVID-19 tests have been reported to @CTDPH to date. This count replaces the total number of patients tested for COVID-19 and includes persons who were tested multiple times or multiple specimens tested from the same person.", "2020-04-28T00:35:14.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 25,997 people tested positive (+728)\n- 2,012 people have died (+88)\n- 1,758 patients are currently hospitalized (-8)\n- 90,746 people have been tested*\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-04-27T22:44:36.000Z": "The change in hospital admissions is a key indicator by which we can make determinations on reopening elements of our state. We're about seven days into a downslope. Working with our state's health experts, we'll continue monitoring this data as we develop our reopening plans.", "2020-04-27T22:25:39.000Z": "Here's the video of our 4:15 p.m. news briefing from earlier today. Governor Lamont's April 27, 2020 4:15PM Coronavirus Update Governor Ned Lamont's 4:15 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-04-27T20:33:39.000Z": "The CTNG has been hard at work helping DPH distribute Personal Protective Gear, ventilators, and hospital equipment to those on the frontline of the battle against #COVID19 and we're prepared to continue to help until the battle is won. #InThisTogether  #ConnecticutsHomeTeam", "2020-04-27T20:19:47.000Z": "HAPPENING NOW: News briefing with updates on COVID-19 in Connecticut.\n\nWatch live CT-N Instant Stream Please note that this stream has a 30 second delay. CT-N Instant is providing a live, raw feed of this event as it's happening. Look for the finished program... youtube.com", "2020-04-27T20:03:45.000Z": "Update: We will be starting today's press briefing at 4:15 p.m. Quote Tweet Governor Ned Lamont @GovNedLamont I will hold a news briefing with updates on COVID-19 in Connecticut today at 4:30 p.m.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-04-27T16:43:31.000Z": "I will hold a news briefing with updates on COVID-19 in Connecticut today at 4:30 p.m.\n\nWatch live on Facebook: https:// facebook.com/GovNedLamont YouTube: https:// youtu.be/z01EcoaR1kk", "2020-04-27T12:25:06.000Z": "This partnership between the State of Connecticut, @CBIANews , and @CONNSTEP will provide face masks to employees of essential small businesses. Face Masks for Connecticut Small Business Employees CONNSTEP and CBIA have partnered with the state of Connecticut to help distribute recently donated surgical masks to eligible small businesses. cbia.com", "2020-04-27T12:21:39.000Z": "Connecticut #smallbiz can apply for federal Paycheck Protection Program loans or Economic Injury Disaster Loan funds from 10:30 am today. #COVID19 Congress Approves New Small Business Relief Program Funding The U.S. Congress this week approved $381 billion in new funding for two critical small business coronavirus relief programs. cbia.com", "2020-04-27T11:20:04.000Z": "Childcare providers do so much for our communities and I'm enormously grateful for their work nurturing our youngest. @CT_OEC continues to partner with providers to ensure these services are available for the children of front line workers. https:// nbcconnecticut.com/news/local/hos pital-daycares-give-frontline-workers-a-lifeline/2260750/   @4_connecticut", "2020-04-27T11:04:53.000Z": "Using the @HowWeFeel app is a way for each of us - whether you're feeling healthy or under the weather - to lend a hand and help in the effort to stop the spread of #COVID19 . Quote Tweet Erin Dunleavy Benham @benhamerin I'm using #HowWeFeel to help track and fight COVID-19. For each new user HWF is donating a meal through @FeedingAmerica . 451,568 meals donated so far! Download it here: https:// get.howwefeel.org/share", "2020-04-26T20:24:04.000Z": "A large shipment of PPE donated by @RaytheonTech was delivered to the state's warehouse today. Their total donation includes:", "2020-04-26T20:01:27.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 25,269 people tested positive (+687)\n- 1,924 people have died (+62)\n- 1,766 patients are currently hospitalized (-44)\n- 79,811 people have been tested (+2,209)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-04-25T20:33:13.000Z": "We've partnered with @CBIANews and @CONNSTEP to distribute face masks to essential small businesses in Connecticut that have fewer than 50 employees.\n\nEligible businesses can request a maximum of two masks per employee.\n\nMore info: https:// cbia.com/news/small-bus iness/face-masks-connecticut-small-business-employees/  Quote Tweet CBIA @CBIANews Does your #smallbiz need face masks for employees? CBIA, @CONNSTEP partnering with state to distribute donated masks to eligible Connecticut small businesses. #COVID19  https:// bit.ly/2x724kk", "2020-04-25T20:19:49.000Z": "UPDATE: Daily COVID-19 data in Connecticut\n\n- 24,582 people tested positive (+661)\n- 1,862 people have died (+98)\n- 1,810 patients are currently hospitalized (-67)\n- 77,602 people have been tested (+3,564)\n\nFor more data sets, visit http:// ct.gov/coronavirus .", "2020-04-25T15:00:41.000Z": "#SocialDistancing is helping to #flattenthecurve in Connecticut. It might not be easy, it might not be fun, but @GovNedLamont is right: #ConnecticutTogether can get this right. Join our effort by visiting and donating at http:// 4-ct.org .", "2020-04-25T00:29:40.000Z": "Incredible act of kindness from complete strangers in #Hartford . Nice work! Quote Tweet Hartford Police CT @HartfordPolice #Hartford residents jump into action and pull driver and his to safety after single vehicle crash on Main St. -LT.PC Show this thread", "2020-04-25T00:12:44.000Z": "Here is the video of our 4:15PM news conference from earlier today. Governor Lamont's April 24, 2020 4:15PM Coronavirus Update Governor Ned Lamont's 4:15 p.m. news briefing today with updates on Connecticut's coronavirus response efforts. For more resources and guidance on coronaviru... youtube.com", "2020-04-24T22:29:00.000Z": "Our thanks to @GovNedLamont and to our employees that coordinated the logistics of charter transportation and medical-grade personal protective equipment to support front line workers as they meet the challenge of COVID-19. Quote Tweet Governor Ned Lamont @GovNedLamont Getting #PPE to frontline workers is a top priority, and we are appreciative to have partners like @RaytheonTech that are utilizing their resources and supply chain to boost Connecticut's supplies and get this gear to those who need it most. https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/04-2020/Governor-Lamont-Announces-Donation-of-Personal-Protective-Equipment-by-Raytheon-to-Connecticut ", "2020-04-24T23:12:30.000Z": "\"Connecticut has been home to Pratt & Whitney for 95 years, and we feel strongly that if we all band together to help our communities, we will get through this moment of great need,\" - Pratt & Whitney President Chris Calio. Quote Tweet Governor Ned Lamont @GovNedLamont Getting #PPE to frontline workers is a top priority, and we are appreciative to have partners like @RaytheonTech that are utilizing their resources and supply chain to boost Connecticut's supplies and get this gear to those who need it most. https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/04-2020/Governor-Lamont-Announces-Donation-of-Personal-Protective-Equipment-by-Raytheon-to-Connecticut ", "2020-04-24T22:18:31.000Z": "Getting #PPE to frontline workers is a top priority, and we are appreciative to have partners like @RaytheonTech that are utilizing their resources and supply chain to boost Connecticut's supplies and get this gear to those who need it most. https:// portal.ct.gov/Office-of-the- Governor/News/Press-Releases/2020/04-2020/Governor-Lamont-Announces-Donation-of-Personal-Protective-Equipment-by-Raytheon-to-Connecticut "}