{"2020-06-17T21:35:19.000Z": "Be respectful of others. Wear a mask. Back up a little in the Wawa line. That's the least we can all do to keep each other safe, and protect our progress against COVID-19.", "2020-07-29T20:16:42.000Z": "Delaware businesses can download printable signs to place on their doors and windows, updated with the most recent COVID-19 guidelines. \n\nDownload the signs at: https:// business.delaware.gov/coronavirus/de lawares-recovery-phase-2-guidance/ ", "2020-07-29T15:52:59.000Z": "COVID-19 has taken the lives of more than 150,000 Americans - including more than 580 Delawareans. Each one was a precious life.\n\nLet's remember those lives lost. And let's commit to doing our part to reduce the toll of this disease. Judge Blocks Green Card Wealth Tests, Citing Pandemic Hardships Deaths top 150,000 in the United States. A $600 unemployment benefit is likely to lapse on Friday, a top official said. In Iran, religious ceremonies and college-entrance exams are in limbo. nytimes.com", "2020-07-28T22:54:12.000Z": "Wearing a mask is the best thing we can all do to protect our family members, friends, neighbors, and our state's hard-fought progress against COVID-19. #MaskUpDE Carney: Wearing masks is key to opening everything Delaware residents could help knock the state's infections rate down by getting tested even if they don't think they COVID-19, Carney said. townsquaredelaware.com", "2020-07-28T17:52:36.000Z": "WATCH LIVE: I am giving a COVID-19 briefing joined by Dr. Rick Hong, Medical Director of the Delaware Division of Public Health and Jamie Mack, Chief, Health Systems Protection in the Delaware Division of Public Health. View the livestream here: 7/28/2020: COVID-19 Briefing For the latest COVID-19 updates: de.gov/coronavirus Text \"add\" to 302-460-2501 for text updates from the State of Delaware. livestream.com", "2020-07-27T14:42:01.000Z": "Free saliva-based testing continues this week throughout the state. \n\nWhether you're showing symptoms or not, please consider getting a test. That will help Delaware more accurately track our positivity rate, and prevent the spread of this disease.  http:// de.gov/gettested", "2020-07-27T13:58:22.000Z": "Aktyalizasyon sou kowonavirus nan Delaware - Semèn nan 27 jiyè, 2020\n\nPou plis enfòmasyon vizite http:// de.gov/coronavirus", "2020-07-27T13:58:21.000Z": "Here is what's happening this week: Read the guidance the State of Delaware released for the reopening of schools for the 2020-21 academic year: http:// de.gov/schoolguidance  Face coverings have been proven to dramatically slow the spread of COVID-19. Do your part. #MaskUpDE", "2020-07-26T17:13:01.000Z": "Even if you don't have symptoms, get tested to know your COVID-19 status. \n\nFind testing locations: http:// de.gov/gettested", "2020-07-25T18:38:46.000Z": "Delawareans are doing their part, but don't let up. Help us stop the spread by getting a free test.\n\nFind a site near you: Delaware COVID-19 Testing - Delaware's Coronavirus Official Website Find a testing location near you in Delaware. Testing is available for those with or without symptoms. Testing is for everyone and there is a test for you. coronavirus.delaware.gov", "2020-07-25T18:38:45.000Z": "DATA: This map from the @JohnsHopkins Coronavirus Resource Center shows new tests per 1,000 people, by state. Testing for COVID-19 helps us track the spread of this virus and prevent outbreaks.\n\nView the interactive map: http:// coronavirus.jhu.edu/testing/tracke r/map/new-tests-per-1-000-people ", "2020-07-24T23:19:57.000Z": "We announced Phase 2 Interim Steps today. Delawareans have made real progress against this disease, but COVID-19 is still active in our communities. And we've seen what has happened in other states when you let your guard down. \n\nMore info: https:// news.delaware.gov/2020/07/24/gov ernor-carney-signs-24th-modification-to-state-of-emergency-declaration/ ", "2020-07-24T18:39:07.000Z": "Delaware's Compassionate Champion Awards highlight the outstanding achievement by individuals and organizations that provide services using the trauma-informed approach.\n\nLearn more about the program and submit your nominations by July 31, 2020: http:// de.gov/cca", "2020-07-24T15:27:56.000Z": "Getting tested for COVID-19 will help us track the spread of this virus. http:// de.gov/gettested", "2020-07-23T20:07:49.000Z": "Proud to announce the 2020 and 2021 inductees to the Delaware Women's Hall of Fame. These outstanding women have made a tremendous impact in our state. @DelawareWomen Governor Carney Announces Hall of Fame of Delaware Women Inductees for 2020 and 2021 - State of... Governor John Carney announced on Thursday that eight women were selected for induction into the Delaware Women's Hall of Fame for 2020 and 2021. The Delaware Women's Hall of Fame Committee selected... news.delaware.gov", "2020-07-23T14:28:43.000Z": "Lots of slots are open at the testing event in Milford tomorrow. This test is fast and easy, and helps us track the spread of this disease to manage potential outbreaks.\n\nSign up here: http:// delaware.curative.com Learn more: http:// de.gov/gettested", "2020-07-22T21:54:39.000Z": "Severe Thunderstorm Warning for Kent and New Castle County in DE until 6:45pm. Tune in NOAA Weather Radio for more", "2020-07-22T21:26:18.000Z": "\"It's easy to look at where we are now and think that we've won. But this virus is still highly contagious and is still out there in our community.\" - Dr. John Fink, Medical Director of @BayhealthDE Wear a mask. Wash your hands frequently. Keep your distance. #MaskUpDE", "2020-07-22T18:36:22.000Z": "We're missing @WilmBlueRocks baseball this summer, but here's a good reminder from Rocky to look out for your neighbors. #MaskUpDE", "2020-07-21T17:51:29.000Z": "WATCH NOW: I am giving a COVID-19 briefing joined by Dr. Karyl Rattay, Director of the Delaware Division of Public Health, and AJ Schall, Director of the Delaware Emergency Management Agency. View the livestream here: 7/21/20: COVID-19 Briefing For the latest COVID-19 updates: de.gov/coronavirus Text \"add\" to 302-460-2501 for text updates from the State of Delaware. livestream.com", "2020-07-20T15:15:21.000Z": "Free saliva-based community testing is available this week at locations throughout the state. \n\nFor a full testing calendar, visit http:// de.gov/gettested Register in advance at: http:// delaware.curativeinc.com", "2020-07-19T18:29:02.000Z": "Learn more about COVID-19 testing: http:// de.gov/gettested Find testing sites in Delaware: https:// coronavirus.delaware.gov/testing-events/ Delaware COVID-19 Testing - Delaware's Coronavirus Official Website Find a testing location near you in Delaware. Testing is available for those with or without symptoms. Testing is for everyone and there is a test for you. coronavirus.delaware.gov", "2020-07-19T18:29:01.000Z": "From @Delaware_DHSS :\nBecause of the extreme heat across DE, COVID testing drive-thru hours will be reduced Monday to 9am-noon at the three Walgreens locations offering that testing:\n\n-Bridgeville: 9202 Commercial Centre Dr\n-Dover: 1215 S State St\n-Middletown: 700 S Ridge Ave", "2020-07-18T20:46:42.000Z": "We are expecting excessive heat in Delaware over the next few days. \n\nIn addition to remaining vigilant against COVID-19, I urge all Delawareans to practice heat safety during this stretch of high temperatures. \n\nMore on how to stay safe and beat the heat: https:// news.delaware.gov/2020/07/18/gov ernor-carney-urges-delawareans-to-stay-safe-during-excessive-heat/ ", "2020-07-18T14:08:25.000Z": "Nobody will replace Congressman Lewis. But we should all work to be more like him, to honor his legacy, and treat each other with more respect.", "2020-07-18T14:08:24.000Z": "One of the real privileges I had as a member Congress was the opportunity to get to know Congressman John Lewis - and to join him on the Civil Rights Pilgrimage through Alabama in 2012. He was a civil rights icon and a living saint.", "2020-07-17T23:04:07.000Z": "The vast majority of Delawareans are doing the right thing, and wearing masks in public settings. \n\nThank you for all your efforts to keep Delaware communities healthy. #MaskUpDE A Detailed Map of Who Is Wearing Masks in the U.S. The patterns from hundreds of thousands of survey respondents reflect partisanship, peer pressure and the footprint of the coronavirus itself. nytimes.com", "2020-07-17T17:50:24.000Z": "Today I am signing House Bill 348, which allows certain telemedicine services through July 1, 2021 and Senate Bill 201, which creates the Delaware Perinatal Quality Collaborative to improve pregnancy outcomes for women. \n\nWatch here: Bill Signings: HB 348 and SB 201 Governor Carney will sign House Bill 348, legislation that will allow certain telemedicine services through July 1, 2021. Prime sponsors: Representative David Bentz and Senator Bryan Townsend... livestream.com", "2020-07-16T22:47:52.000Z": "Wear a mask. Keep your distance. Wash your hands. \n\n\"Doing so is an act of love and kindness for those that you care about, but also for the broader community, including our health care professionals, doctors, nurses and others...\" - Dr. Rose Kakoza, @christianacare  #MaskUpDE", "2020-07-16T19:50:25.000Z": "But we've seen that number can rise fast when states let their guard down. Stay vigilant. \n\nAnd whether you're showing symptoms or not, please consider getting a test. That will help Delaware more accurately track our positivity rate statewide, and prevent spread of this disease.", "2020-07-16T19:50:24.000Z": "DATA: The @WHO recommends that positivity rates of COVID-19 should remain below 5 percent to prevent greater community spread. \n\nDelaware is currently one of 19 states meeting that target - at 4.1 percent over the last week. \n\nSource: @JohnsHopkins - https:// coronavirus.jhu.edu/testing/testin g-positivity ", "2020-07-16T14:39:15.000Z": "Lots of slots left at the testing event tomorrow in Laurel. This test is fast and easy, and helps us track the spread of this disease to manage potential outbreaks. \n\nSign up here: http:// delaware.curative.com Learn more: http:// de.gov/gettested", "2020-07-15T21:44:49.000Z": "Until then, let's all do our part. \n\nWear a mask. \nStay home if you feel sick. \nKeep your distance from others. \nStay vigilant.", "2020-07-15T21:44:48.000Z": "We need to get DE children back in school - but in a way that's safe for students, educators and staff.\n\nThis guidance from @DEDeptofEd will help public schools plan for a safe return to school, based on three different levels of COVID community spread. http:// de.gov/schoolguidance", "2020-07-15T19:27:30.000Z": "Whether or not you have symptoms, consider getting a free test: Delaware COVID-19 Testing - Delaware's Coronavirus Official Website Find a testing location near you in Delaware. Testing is available for those with or without symptoms. Testing is for everyone and there is a test for you. coronavirus.delaware.gov", "2020-07-15T19:27:29.000Z": "Testing is the best way to track the spread of COVID-19. That's why we're thankful for this partnership with Walgreens, which will make testing even more accessible across Delaware. Delaware forges drive-thru coronavirus testing partnership with Walgreens The testing at pharmacies will begin with a pilot program at one store in each of the state's three counties and soon expand, public health officials said. whyy.org", "2020-07-15T17:52:48.000Z": "Wilmington is home to the new Margaret Rose Bridge, which connects the Riverfront and Southbridge. \n\nA bridge is a welcoming symbol.\n\nA bridge connects people and communities.\n\nDedicating this bridge in honor of former State Senator Margaret Rose Henry could not be more fitting.", "2020-07-14T17:58:50.000Z": "WATCH NOW: I am giving a COVID-19 briefing joined by Dr. Karyl Rattay, Director of the Delaware Division of Public Health, and Secretary Susan Bunting of the Delaware Department of Education. View the livestream here: 7/14/20: COVID-19 Briefing For the latest COVID-19 updates: de.gov/coronavirus Text \"add\" to 302-460-2501 for text updates from the State of Delaware. livestream.com", "2020-07-14T16:52:40.000Z": "Col. Zebley has a tremendous track record of leadership at the Delaware State Police over her 28-year career, and she has the trust of community leaders up and down our state. \n\nThank you to Col. Zebley for taking on this important challenge and leading our largest police agency.", "2020-07-14T16:52:39.000Z": "Congratulations to Col. Zebley, who was sworn in as the first female Superintendent of the @DEStatePolice .", "2020-07-13T16:48:40.000Z": "Aktyalizasyon sou kowonavirus nan Delaware - Semèn nan 13 jiyè, 2020\nPou plis enfòmasyon vizite http:// de.gov/coronavirus", "2020-07-13T16:48:27.000Z": "13 de julio: Estas son las novedades semanales sobre el coronavirus en Delaware.\n\nPara obtener más información, ingrese en http:// de.gov/coronavirus", "2020-07-13T16:48:26.000Z": "Here is what's happening this week: Free and fast testing is available at locations throughout the state. Visit http:// de.gov/gettested to find a location near you. Learn more about contact tracing: http:// coronavirus.delaware.gov/contact-tracin g/ ", "2020-07-12T20:00:15.000Z": "Full details from @bestfriends Animal Society A new digital tool for saving dogs and cats How close is your state to achieving no-kill? Are your local shelters getting the support they need? Find out exactly what your community's shelters need and how you can help save more pets. bestfriends.org", "2020-07-12T20:00:14.000Z": "We look out for each other in Delaware, including our four-legged friends. \"Brandywine Valley SPCA leads way in making Delaware no-kill state\" https:// delawarestatenews.net/news/brandywin e-valley-spca-leads-way-in-making-delaware-no-kill-state/   @BrandywineSPCA (Photo: @TheStateNews / Glenn Rolfe)", "2020-07-11T18:14:57.000Z": "Wear a mask. \nKeep your distance. \nProtect your neighbors. #MaskUpDE", "2020-07-10T18:31:36.000Z": "DATA: Stay informed by visiting http:// de.gov/healthycommuni ty  , where you can track the latest COVID-19 trends in Delaware.\n\nThese graphs show Delaware's infection rates and hospitalizations over the last 14 days, and going back to the first cases this spring.", "2020-07-09T22:46:28.000Z": "Wear a mask. It's required in public places. Get a free test at one of our community sites - http:// de.gov/gettested . Wash your hands. Don't gather in large groups.\n\nStay vigilant. Delaware COVID-19 Testing - Delaware's Coronavirus Official Website Find a testing location near you in Delaware. Testing is available for those with or without symptoms. Testing is for everyone and there is a test for you. coronavirus.delaware.gov", "2020-07-09T22:29:10.000Z": "This is Delaware's COVID-19 infection rate looking back to our first cases in March. \n\nDelawareans fought hard to pull that curve down. Now's not the time to let up. \n\nWe need to protect our progress.", "2020-07-09T18:16:42.000Z": "Lt. Col. Zebley has a tremendous track record of leadership at the Delaware State Police, and is the right person to lead our largest police agency. Zebley makes history as 1st female Delaware State Police Superintendent Lt. Col. Melissa Zebley has been appointed as the Superintendent of Delaware State Police, becoming the first woman to assume the command. wdel.com", "2020-07-09T16:36:37.000Z": "TODAY: The State of Delaware is hosting a free, saliva-based testing event in Georgetown. To reduce check-in time, pre-register at: http:// delaware.curativeinc.com .\n\nTo find a date and testing location near you: http:// de.gov/gettested", "2020-07-09T15:44:04.000Z": "Thank you to the @DelawareNG , to @DelawareEMA and the Delaware Division of Public Health for their unrelenting work to track the spread of COVID-19 and keep Delawareans healthy. Quote Tweet Delaware National Guard @DelawareNG Yesterday, 1,220-plus people took advantage of free saliva-based testing for #COVID19 at Rehoboth Beach.\n\nAbout 25 @USNationalGuard Soldiers and Airmen joined staff with @DelawareEMA to run the walk-up testing site. For more photos, visit http:// flickr.com/photos/delawar enationalguard/albums   #StopTheSpread", "2020-07-08T20:30:07.000Z": "From @BeebeHealthcare 's Dr. Tam in @coastalpoint : https:// coastalpoint.com/opinion/expert s_corner/beebe_experts/now-is-not-the-time-to-relax-on-covid-19-safety-measures/article_d1961396-c082-11ea-b653-7787467b1e1e.html ", "2020-07-08T20:05:29.000Z": "Wise words from @davidatammd - whose team at @BeebeHealthcare has been on the frontlines of the COVID-19 crisis since Day 1. \n\nAll Delawareans can help sustain our recovery, and protect the progress we've made against this virus. #maskupDE Now is not the time to relax on COVID-19 safety measures A few months ago, Beebe Healthcare's message was clear - it was a critical time to wear a face covering in public for the safety of the community. coastalpoint.com", "2020-07-08T16:38:26.000Z": "If you are struggling with the challenges surrounding mental health, especially during this difficult time as we face the coronavirus pandemic, you are not alone.\n\nThe Div. of Substance Abuse and Mental Health's phone line, 1-(833)-9 HOPEDE, is dedicated to helping Delawareans.", "2020-07-07T20:56:56.000Z": "REMINDER If you are a registered Democrat or Republican and didn't vote in the presidential primary election by absentee ballot, polls are open TODAY, July 7 until 8:00 p.m. \n\nFor polling locations: http:// ivote.de.gov Quote Tweet Delaware.gov @delaware_gov VOTE.", "2020-07-07T17:54:55.000Z": "WATCH NOW: I am giving a COVID-19 briefing joined by Dr. Karyl Rattay, Director of the Delaware Division of Public Health, and A.J. Schall, Director of the Delaware Emergency Management Agency. View the livestream here: 7/7/20: COVID-19 Briefing On Livestream livestream.com", "2020-07-06T21:05:20.000Z": "Whether or not you have symptoms, consider getting a test to help us track the spread of this disease. \n\nFree saliva-based community testing is available throughout the state. For a full testing calendar, visit http:// de.gov/gettested . \n\nRegister at: http:// delaware.curative.com", "2020-07-06T19:59:44.000Z": "Wear a mask in public settings (still required).\nWash or sanitize your hands frequently.\nKeep your distance from others outside your household.\n\nWe know from public health experts that following these basic health precautions is the best way to prevent community spread.", "2020-07-06T19:59:43.000Z": "For months, Delawareans and Delaware businesses have made significant sacrifices to flatten the curve, and protect the health of their family members, friends, and neighbors. We are beating COVID-19. Let's not go backwards. https:// news.delaware.gov/2020/07/06/gov ernor-carney-formally-extends-state-of-emergency-2/ ", "2020-07-05T16:26:00.000Z": "#MaskUpDE", "2020-07-05T12:57:33.000Z": "Wearing a face mask in public is one of the best things Delawareans can do to help reduce the spread of COVID-19, to spare seniors and other vulnerable people the risk of becoming sick or hospitalized, and to help keep our economy moving forward. #MaskUpDE  http:// de.gov/coronavirus", "2020-07-04T14:56:10.000Z": "Happy Fourth of July, Delaware! Please celebrate safely.", "2020-07-03T18:29:52.000Z": "On June 19, we held a discussion about Juneteenth. It was an important conversation on the ugly history around race and slavery in DE and the U.S. As we approach Independence Day, I encourage you to watch this discussion and learn more. Discussion on Juneteenth - Delaware Governor John Carney On Juneteenth (June 19), Governor Carney hosted a live discussion about the history of the holiday with Dr. Reba Hollingsworth, Vice Chair of the Delaware He... youtube.com", "2020-07-03T16:11:07.000Z": "Wear a mask in all public places. Avoid large gatherings & parties. Maintain your distance from anyone outside your household, especially at our beaches.\n\nEnjoy Independence Day weekend but remember that your actions affect your family, friends & neighbors. Keep each other safe.", "2020-07-03T16:09:24.000Z": "We're asking Delawareans and visitors to enjoy the beautiful outdoors this July 4th weekend, but please celebrate safely. Video: COVID-19 concerns for beachgoers this holiday weekend Gov. John Carney joins \"GMA\" to discuss the actions Delaware is taking to prevent the coronavirus spread. abcnews.go.com", "2020-07-03T01:05:57.000Z": "Thank you, Brittany, for getting tested and sharing good information. Quote Tweet Brittany Horn @brittanyhorn I've got to give it to Delaware -- COVID-19 saliva testing is quick, painless + frankly easy. \n\nThe best part? Results were back in my inbox in less than 24 hours with good news: I tested negative. #netde Show this thread", "2020-07-02T19:25:37.000Z": "Removing this whipping post was the right thing to do. It doesn't belong in a public square, and should have been placed in a museum long ago. Delaware residents celebrate departure of local whipping post from public land The whipping post in Georgetown was put on display on The Circle in 1993. It's headed for storage, and may be displayed in a museum in the future. delawareonline.com", "2020-07-02T17:38:29.000Z": "Please celebrate safely this weekend. #MaskUpDE", "2020-07-02T15:50:31.000Z": "Getting tested for COVID-19 will help us track the spread of this disease and manage potential outbreaks.\n\nIt is especially important to get tested if you think you may have been exposed to someone COVID-19 positive or were in a large group.\n\nLearn more: http:// de.gov/gettested", "2020-07-02T01:50:21.000Z": "#MaskUpDE Quote Tweet DHSS @Delaware_DHSS We wear our face masks to help protect those who are vulnerable - seniors, people of any age with underlying health conditions, people with disabilities, pregnant women, individuals who are immunocompromised, workers in public-facing jobs. To learn more: http:// de.gov/coronavirus", "2020-07-01T19:25:12.000Z": "This is still an extremely difficult time for many Delawareans and Delaware families - and this initiative is about continuing to support our neighbors through this COVID-19 crisis.  https:// news.delaware.gov/2020/07/01/gov -carney-ag-jennings-dsha-delaware-judiciary-announce-joint-effort-on-foreclosure-eviction-prevention/ ", "2020-07-01T14:32:35.000Z": "WATCH LIVE: I am signing House Bill 346, which will allow Delawareans to vote by mail in the 2020 primary, general and special elections.\n\nView the livestream: Bill Signing: House Bill 346 Governor Carney will sign House Bill 346, legislation sponsored by House Majority Leader Valerie Longhurst that will allow Delawareans to vote by mail in the 2020 primary, general and special... livestream.com", "2020-07-01T04:30:52.000Z": "Joined the Senate's virtual session tonight to pay tribute to Sen. Harris McDowell. I can't think of another legislator who has done more for Delawareans. It's been a privilege to call Sen. McDowell my friend and my state senator. Thank you for 44 years of service to our state.", "2020-07-01T01:23:44.000Z": "We don't want to lose the progress we have made in our state to flatten the curve. Now's not the time to let up.\n\nWe've heard and seen concerns, especially in our beach communities. Wear a mask in public settings. Keep your distance from those outside your household.", "2020-06-30T22:20:18.000Z": "Know your status by getting tested - especially if you have spent time in our beach communities. \n\nVisit http:// de.gov/gettested to find a local testing site. Delaware COVID-19 Testing - Delaware's Coronavirus Official Website Find a testing location near you in Delaware. Testing is available for those with or without symptoms. Testing is for everyone and there is a test for you. coronavirus.delaware.gov", "2020-06-30T22:20:17.000Z": "Delawareans and Delaware businesses have made significant sacrifices to flatten the curve. We are beating this disease. But COVID-19 has not gone away.\n\nWe need to protect our progress, and stay vigilant.  https:// news.delaware.gov/2020/06/30/gov ernor-carney-issues-modification-to-state-of-emergency/ ", "2020-06-30T21:01:12.000Z": "I'll be on @CNNSitRoom soon. Watch live: https:// go.cnn.com/?stream=cnn", "2020-06-30T17:54:37.000Z": "WATCH NOW: I am giving a COVID-19 briefing joined by Dr. Karyl Rattay, Director of the Delaware Division of Public Health, and Mike Jackson, Director of the Delaware Office of Management & Budget. View the livestream here: 6/30/20: COVID-19 Briefing For the latest COVID-19 updates: de.gov/coronavirus Text \"add\" to 302-460-2501 for text updates from the State of Delaware. livestream.com", "2020-06-29T20:27:59.000Z": "We will advocate for additional funding for broadband technology and new support for children living in poverty and students who are still learning English.", "2020-06-29T20:27:58.000Z": "If we hope to seriously address the systemic issues around race and poverty in this country, we have to commit to the hard work of strengthening public schools for all children. Quote Tweet SREB @srebeducation SREB news release: Gov. Carney of Delaware elected SREB Board chair. http:// ow.ly/heEC50Al4ua  @JohnCarneyDE  #delaware  #de", "2020-06-29T19:33:38.000Z": "DEADLINE EXTENDED: The deadline for nominations for the Compassionate Champion Award has been extended to July 31.\n\nThe Compassionate Champion Award highlights individuals and organizations that provide trauma-informed services in DE.\n\nSubmit a nomination: http:// de.gov/cca", "2020-06-29T17:22:31.000Z": "29 de junio: Estas son las novedades semanales sobre el coronavirus en Delaware.\n\nPara obtener más información, ingrese en http:// de.gov/coronavirus", "2020-06-29T17:21:18.000Z": "Aktyalizasyon sou kowonavirus nan Delaware - Semèn nan 29 jen, 2020\n\nPou plis enfòmasyon vizite http:// de.gov/coronavirus", "2020-06-29T17:19:39.000Z": "COVID-19 is still active in Delaware. #MaskUpDE and do your part to help stop the spread. We have testing locations throughout the state. Find your nearest testing location and learn more: http:// coronavirus.delaware.gov/testing", "2020-06-28T23:49:29.000Z": "Delawareans made real sacrifices to help us flatten the curve. Let's not go backwards.", "2020-06-28T23:49:28.000Z": "We are seeing an increase in COVID19 cases in the beach area. Act responsibly, social distance, wear a mask, get tested, and answer the call if @Delaware_DHSS contact tracers reach out to help us stop the spread.", "2020-06-28T17:08:53.000Z": "Reminder: Free COVID-19 testing event on Monday, June 29 at The Starboard. \n\nPre-register here (on-site registration will be limited)  http:// delaware.curativeinc.com", "2020-06-27T19:51:24.000Z": "Getting tested for COVID-19 will help us track the spread of this disease, and manage potential outbreaks before they get out of control.\n\nIf you're in the Dewey Beach area, consider stopping by The Starboard on Monday for a free test - whether or not you have symptoms.", "2020-06-27T19:33:20.000Z": "Walk-up COVID-19 Testing Event at @thestarboard on Monday 6/29 from 1pm-6pm. Register in advance at http:// delaware.curativeinc.com or register on site! #COVID19Delaware  #netde  #GetTested  #maskupDE", "2020-06-27T17:56:44.000Z": "Follow these 5 tips to limit community spread, to keep others safe, and to protect Delaware's hard-fought progress against COVID-19.\n\nFind testing locations: http:// de.gov/gettested  #MaskUpDE", "2020-06-26T21:18:02.000Z": "Wear a mask. Protect your neighbors. #MaskUpDE", "2020-06-26T13:48:56.000Z": "Thank you for your leadership, Rep. Chukwuocha. Quote Tweet Tom Lehman @teelehman Delaware's House has passed a ban on police chokeholds. It's expected to get a vote in the Senate later today. \n\nHere's what the chief sponsor, Rep. Nnamdi Chukwuocha (D-Wilmington), said after the vote. http:// wboc.com/story/42290176 /delaware-house-passes-ban-on-police-chokeholds   #NetDE  #KentDE  @wboc  #GeorgeFloyd  #LegDE", "2020-06-25T20:55:20.000Z": "Too many Delawareans and visitors are not following basic public health precautions. We've heard and seen concerns especially in our beach communities, in restaurants, in gyms, and at sporting events. Now's not the time to let up.", "2020-06-25T20:55:19.000Z": "We intend to make a decision early next week regarding the start of Phase 3.", "2020-06-25T20:51:57.000Z": "I know many Delawareans expected us to move into Phase 3 on Monday, June 29 - and that had been my hope, as well. But we are delaying that decision so we can get a better handle on what's going on in DE and around the country. \n\nFull statement: https:// news.delaware.gov/2020/06/25/sta tement-governor-carney-announces-delay-in-phase-3-of-economic-reopening/ ", "2020-06-25T15:01:06.000Z": "Talk is cheap. It's on us to make progress.\n\nAs I said last week, these are first steps that we can take administratively to improve the relationship between law enforcement agencies and communities of color in Delaware.\n\nMore on Executive Order #41: https:// news.delaware.gov/2020/06/25/gov ernor-carney-signs-executive-order-on-law-enforcement-policy/ ", "2020-06-25T02:52:05.000Z": "We should continue to act responsibly.\n\nLet's get the other budget bills done.", "2020-06-25T02:52:04.000Z": "We are not laying off state employees, or cutting their benefits. State workers have been on the front lines of this crisis, and we owe them our gratitude.", "2020-06-25T02:52:03.000Z": "This FY 2021 budget protects critical investments in public education and the jobs and livelihoods of Delaware's state workers. That's because we responsibly set aside surplus revenue into savings during good times. Delaware House passes $4.5 billion budget; other big money bills still being debated The budget bill now heads to the governor's desk for signage into law. The state's fiscal year runs from July 1 to June 30. delawareonline.com", "2020-06-24T22:06:56.000Z": "Travel may look a little different this year, but if you plan ahead, you will still enjoy your visit to DE. Wear a face covering. Wash your hands. Practice social distancing. If you're sick, stay home. Go-to guide to Summer Safely in Delaware youtube.com", "2020-06-24T22:06:55.000Z": "We can all help stop the spread of COVID-19 in our state while enjoying Delaware's favorite attractions if we follow public health guidance and act responsibly with a sense of community. \n\nCheck out @DelawareTourism 's Go-To Guide for travel: Go-to Guide If you're visiting, or traveling in, Delaware this summer, it's important to do so safely. visitdelaware.com", "2020-06-24T21:00:28.000Z": "This has been a difficult several months for Delaware, to be sure. Thank you members of the General Assembly - and especially members of the Joint Finance Committee - for their work under challenging circumstances to pass a responsible, balanced budget. https:// news.delaware.gov/2020/06/24/gov ernor-carney-issues-statement-on-general-assembly-passage-of-fiscal-year-2021-budget/ ", "2020-06-24T15:25:33.000Z": "This is our @DelawareNG . Stepping up. Helping their neighbors. Thank you to our Guardsmen and women for everything they're doing to get Delaware through this crisis stronger than ever. \n\nCredit to Captain Mackie on the great photos. Photos: National Guard helps with coronavirus testing, food distribution in Delaware The Delaware National Guard helped out with food distribution and coronavirus testing at a number of sites around the state. delawareonline.com", "2020-06-24T14:29:30.000Z": "REMINDER: The State of Delaware is hosting free saliva-based testing events around the state today. \n\nLimited on-site registration will be available at all locations. Pre-register for testing at: http:// delaware.curativeinc.com", "2020-06-23T23:50:20.000Z": "The bottom line is: we don't want to go backwards. We are most concerned about folks not observing social distancing practices, and not wearing face coverings. \n\nBe respectful. Be safe. Think about your neighbor.", "2020-06-23T23:50:19.000Z": "Make sure you get tested, especially if you think you may have been exposed to someone positive for COVID-19 or if you are in a large group. For a full list of testing sites: Delaware COVID-19 Testing - Delaware's Coronavirus Official Website Find a testing location near you in Delaware. Testing is available for those with or without symptoms. Testing is for everyone and there is a test for you. coronavirus.delaware.gov", "2020-06-23T23:48:02.000Z": "Keep your six foot distance from those outside your household, recognizing that you could catch the virus from anyone or you could be an asymptotic carrier.", "2020-06-23T23:48:01.000Z": "Wear a mask when you are in public. When you wear a mask, you show that you are concerned about your neighbor, that you're concerned about the community health, and you want our economy to be strong.", "2020-06-23T23:47:59.000Z": "We need everyone to act with a sense of responsibility, community, and awareness of the fact that your actions affect your neighbor.", "2020-06-23T22:46:13.000Z": "Congratulations to Molly Magarik on her confirmation to serve as the next Secretary of @Delaware_DHSS , as well as the distinguished Delawareans who were confirmed by the Senate today to serve on our world-class judiciary.  https:// news.delaware.gov/2020/06/23/gov ernor-carney-issues-statement-on-senate-confirmations-2/ ", "2020-06-23T17:50:45.000Z": "Subtítulos en Español: 6/23/20: Respuesta de Delaware al COVID-19 On Livestream livestream.com", "2020-06-23T17:50:37.000Z": "WATCH NOW: I am giving a COVID-19 briefing joined by Dr. Karyl Rattay, Director of the Delaware Division of Public Health, and AJ Schall, Director of Delaware Emergency Management Agency. View the livestream here: 6/23/20: COVID-19 Briefing On Livestream livestream.com", "2020-06-22T16:20:07.000Z": "Aktyalizasyon sou kowonavirus nan Delaware - Semèn nan 22 jen, 2020\n\nPou plis enfòmasyon vizite http:// de.gov/coronavirus", "2020-06-22T15:02:56.000Z": "22 de junio: Estas son las novedades semanales sobre el coronavirus en Delaware.\n\nPara obtener más información, ingrese en http:// de.gov/coronavirus", "2020-06-22T14:56:16.000Z": "Latest youth & adult recreational sports guidance: http:// de.gov/youthsports  Help protect more vulnerable Delawareans: Wear a face covering. Stay 6ft from others outside your household. Wash your hands. Stay home if sick. Find COVID-19 testing: http:// coronavirus.delaware.gov/testing", "2020-06-22T13:18:56.000Z": "I encourage Delawareans, with or without symptoms, to get tested at one of the many saliva-based community testing locations throughout the state this week. \n\nFor a full testing calendar, visit: http:// coronavirus.delaware.gov/testing Register in advance at http:// delaware.curativeinc.com", "2020-06-21T16:00:55.000Z": "Thinking about all the good memories we had and all the lessons we learned from my dad. I wouldn't be the person I am today without him.\n\nHappy Father's Day to all Delaware dads and father figures.", "2020-06-20T14:23:03.000Z": "Wear a mask. https:// wdel.com/news/3-teens-t est-positive-for-covid-19-after-spending-senior-week-at-delaware-beaches-prompting/article_963b2b92-b2a4-11ea-bf09-671364bda418.html  Get a test: http:// de.gov/covidtesting 3 teens test positive for COVID-19 after spending senior week at Delaware beaches, prompting call... At least three teens who participated in recent senior week activities at the Delaware beaches have tested positive for COVID-19, prompting state health officials to call for widespread testing among wdel.com", "2020-06-19T20:51:29.000Z": "We are expanding youth sports activities starting on June 20 and increasing personal care services to 60% occupancy on June 22, if safety guidelines are followed to prevent infection and community spread of COVID-19. \n\nDetails: https:// news.delaware.gov/2020/06/19/gov ernor-carney-announces-additional-interim-steps-for-phase-2/ ", "2020-06-19T15:33:09.000Z": "WATCH NOW: I am hosting a discussion on Juneteenth: https:// livestream.com/stateofdelawar e/juneteenth2020 ", "2020-06-19T14:47:53.000Z": "Today we recognize #Juneteenth and commemorate the emancipation of the last enslaved African Americans in the U.S. Please join us today at 11 a.m. for a live discussion. \n\nWhere to watch: http:// de.gov/live or http:// facebook.com/johncarney", "2020-06-19T01:52:45.000Z": "Thanks for your advocacy, @Pharrell . I signed an executive order this morning closing state offices in honor of Juneteenth: https:// news.delaware.gov/2020/06/18/gov ernor-carney-closes-state-of-delaware-offices-in-honor-of-juneteenth/  Tune in tomorrow for our discussion about Juneteenth: http:// de.gov/live Quote Tweet Pharrell Williams @Pharrell . @JohnCarneyDE , please join Virginia and New York and make Juneteenth a paid holiday in Delaware for state employees. Thank you Show this thread", "2020-06-18T19:12:01.000Z": "Our revamped Office of Equity and Innovation will provide districts, charters, school leaders, and educators with the resources and guidance to have hard yet vital conversations with students and colleagues about race and inequity in Delaware and our country. Quote Tweet DE Dept of Education @DEDeptofEd . @JohnCarneyDE and Sec. Bunting announce creation of Office of Equity and Innovation, chief equity officer at DOE: https:// doe.k12.de.us/site/default.a spx?PageType=3&DomainID=4&ModuleInstanceID=20&ViewID=6446EE88-D30C-497E-9316-3F8874B3E108&RenderLoc=0&FlexDataID=24488&PageID=1   #netde  #edude", "2020-06-18T17:54:13.000Z": "Preserving farmland is not just about passing a farm down to the next generation, it's about making sure future generations have food grown locally available to feed their families.", "2020-06-18T17:54:12.000Z": "Our state's Aglands Preservation Program has been critical to keeping Delaware farms in production. \n\nWe can all agree through the pandemic, we learned how important family farmers are to ensuring food is readily available.  https:// news.delaware.gov/2020/06/18/del aware-aglands-program-ranks-second-in-the-united-states-for-preserving-farmland/ ", "2020-06-18T16:08:15.000Z": "Make no mistake: this is a huge victory for these young American DREAMers, for their families, and for our values as a country. Thank you to the U.S. Supreme Court. Supreme Court blocks Trump's bid to end DACA, a win for undocumented 'dreamers' The 5 to 4 decision was written by Chief Justice John G. Roberts Jr. and joined by the court's four liberals. washingtonpost.com", "2020-06-18T14:08:37.000Z": "If we don't educate ourselves and acknowledge our ugly history around race, we can't begin to understand the anger and frustration that I've heard from so many Delawareans in the last several weeks.\n\nBut we shouldn't stop there.", "2020-06-18T14:08:36.000Z": "Over the last several weeks, we have seen largely peaceful protests demanding racial justice and equality across our state. I have spent much of this time listening, and trying to chart a productive path forward. We can make meaningful change, and I believe we will.", "2020-06-17T20:43:06.000Z": "Join @Dartfirststate 's \"Stuff The Bus\" Food Drive in support of the @FoodBankofDE 's COVID-19 relief efforts. Food collection events will occur in locations throughout the state, beginning Monday, June 22 in Rehoboth.\n\nFor more details: DART Launches \"Stuff the Bus\" Food Drive to Support Food Bank of DE June 22 - June 26 - State of... DART has announced their \"Stuff The Bus\" Food Drive in support of the Food Bank of Delaware's COVID-19 relief efforts. Since the beginning of the pandemic, the Food Bank of Delaware has distributed... news.delaware.gov", "2020-06-17T19:12:36.000Z": "The data we're releasing today shows that Delaware's progress is broad, and that Delaware's educators are committed to helping all of their students succeed. That work continues.", "2020-06-17T19:12:35.000Z": "More Delaware students are graduating high school ready for college or a career. That has been a focus of Secretary Bunting and her team at the @DEDeptofEd since we took office in 2017 - and it's great news for the future of our state.  https:// news.delaware.gov/2020/06/17/del aware-graduation-rates-at-highest-level-in-a-decade/ ", "2020-06-17T01:08:44.000Z": "In the era of social media, this is the kind of thing that can set someone back for life. This change is overdue.", "2020-06-17T01:08:43.000Z": "I'm pleased to report that - with Colonel McQueen's leadership - Delaware State Police is ending the practice of posting mug shots of juveniles this week. The only exception will be when public safety is imminently at risk. Some Delaware police post mugshots of arrested youth. Lawmakers want it to stop. It's one of the simplest proposals in black lawmakers' agenda for police reform, but it failed to get a vote last session. delawareonline.com", "2020-06-16T22:56:50.000Z": "Throughout her career, and especially as Deputy Secretary, Molly built important relationships and trust with members of the General Assembly, our health care systems, agency staff, and Delawareans throughout the state.", "2020-06-16T22:56:49.000Z": "I'm pleased to nominate @Delaware_DHSS Deputy Secretary Molly Magarik to serve as the next Secretary of the Department of Health and Social Services. Molly is a proven leader, problem solver and committed public servant who has been second-in-command at DHSS for the last 3.5 yrs.", "2020-06-16T22:43:59.000Z": "Sec. of @Delaware_DHSS  @DrKaraWalker has been a central part of the most qualified and diverse cabinet in DE's history. She has managed our health and social services programs with grace, poise, and with a steadfast focus on helping the Delawareans who are most in need.", "2020-06-16T21:07:13.000Z": "I agree with Senator Darius Brown, who said \"Dismantling systemic racism in Delaware must begin with our founding document.\"\n\nThank you to members of the Delaware Senate for taking this important first step to guarantee equality in Delaware's Constitution. Delaware Senate unanimously passes 1st leg of constitutional amendment, banning discrimination... The Delaware state Senate has unanimously passed the first leg of a constitutional amendment that bans discrimination based on race, color, or national origin, adding the language to the Equal wdel.com", "2020-06-16T17:48:50.000Z": "WATCH NOW: I am giving a COVID-19 briefing joined by Dr. Karyl Rattay, Director of the Delaware Division of Public Health, and Damian DeStefano, Director of the Delaware Division of Small Business. View the livestream here: 6/16/20: COVID-19 Briefing For the latest updates: de.gov/coronavirus Text \"add\" to 302-460-2501 for text updates from the State of Delaware. livestream.com", "2020-06-16T14:41:20.000Z": "The @FoodBankofDE is hosting Drive-Thru Mobile Food Pantries in each county:\n\n6/19 in New Castle County\nRegister: http:// JuneNewCastleCountyFood.eventbrite.com 6/22 in Sussex County\nRegister: http:// JuneSussexCountyFood.eventbrite.com 6/24 Kent County\nRegister: http:// JuneKentCountyFood.eventbrite.com", "2020-06-16T00:55:00.000Z": "Today's Supreme Court decision is a landmark victory for the LGBTQ+ community and for our country. Supreme Court grants federal job protections to gay, lesbian, transgender workers The ruling came in three cases involving two gay men and a transgender woman from Georgia, New York and Michigan. usatoday.com", "2020-06-15T21:36:54.000Z": "It's selfish - plain and simple - to not wear a face covering in public places. \n \nWear a mask to protect your family, your friends, your neighbors, and Delaware's hard-fought progress against this disease. Quote Tweet Governor John Carney @JohnCarneyDE This coronavirus crisis is a real test. \n\nThe question is: are you just thinking about yourself?\n\nIs this every man or woman for themselves?\n\nOr are we all in this together?\n\nIf we act with a sense of community, and care for others, we'll get through this more quickly. Show this thread", "2020-06-15T18:27:37.000Z": "Wear a mask. \n\nKeep away from others in public settings. \n\nWash your hands. \n\nProtect others around you.", "2020-06-15T15:02:58.000Z": "Aktyalizasyon sou kowonavirus nan Delaware - Semèn nan 15 jen, 2020\n\nPou plis enfòmasyon vizite http:// de.gov/coronavirus", "2020-06-15T14:54:32.000Z": "15 de junio: Estas son las novedades semanales sobre el coronavirus en Delaware.\n\nPara obtener más información, ingrese en http:// de.gov/coronavirus .", "2020-06-15T14:47:25.000Z": "Take a look at what's happening this week in Delaware. We are now in Phase 2: http:// coronavirus.delaware.gov/reopening/phas e2/   Learn more about contact tracing: http:// coronavirus.delaware.gov/contact-tracin g/ ", "2020-06-14T13:00:00.000Z": "Today is World Blood Donor Day. If you are able, make an appointment to donate blood today. You may save a life. Visit https:// donate.bbd.org/donor/schedule s/zip  to find a donation location near you. #GiveBlood", "2020-06-13T21:04:31.000Z": "When talking about the Phase 2 guidance for different sports, Delaware Division of Public Health Director Dr. Karyl Rattay said no one wants to change the games themselves, \"... it's temporary.\" https:// de.gov/1T9  #netde  #coronavirusdelaware Delaware's COVID-19 guidance to play safely When talking about the Phase 2 guidance for different sports, Divisioin of Public Health Director Dr. Karyl Rattay said no one wants to change the games them... youtube.com", "2020-06-13T01:13:36.000Z": "We know that this pandemic has not been easy on our businesses. But I've seen the creative measures that businesses have taken during our rolling reopening. \n\nIt's up to all Delawareans to take basic health precautions while we also help support our businesses.", "2020-06-12T17:54:33.000Z": "WATCH NOW: I am giving a COVID-19 briefing joined by Dr. Karyl Rattay, Director of the Delaware Division of Public Health, and AJ Schall, Director of the Delaware Emergency Management Agency. View the livestream here: 6/12/20: COVID-19 Briefing For the latest updates: de.gov/coronavirus Text \"add\" to 302-460-2501 for text updates from the State of Delaware. livestream.com", "2020-06-12T15:09:56.000Z": "This law enforcement memorial in front of Legislative Hall helps us remember the brave men and women - in Delaware and across our country - who have made the ultimate sacrifice protecting all of us. This kind of vandalism is unacceptable. Delaware Law Enforcement Memorial in Dover vandalized Dover Police are looking for the suspect who took an axe to the Delaware Law Enforcement Memorial on Martin Luther King Boulevard (South) in the pre-dawn hours of Friday, June wdel.com", "2020-06-12T01:40:57.000Z": "Free saliva-based COVID-19 testing continues this Friday and Saturday in New Castle County. This simple test is available to Delawareans with or without symptoms; no doctor referral is needed. \n\nReserve your time slot at: http:// delaware.curativeinc.com", "2020-06-11T17:17:31.000Z": "SAVE THE DATE: Join Tracey and @DELibraries for a virtual kick-off of the \"Imagine Your Story\" Summer Reading Program on Wednesday, June 17 at 10 a.m. \n\nA healthy reading habit motivates, encourages creativity and prevents the summer slide.\n\nMore details: https:// lib.de.us/programs/summe rreading/ ", "2020-06-11T14:40:41.000Z": "Thank you to Lt. Governor Bethany Hall-Long and the chairs of the Pandemic Resurgence Advisory Committee. This distinguished group will help us look forward, and develop a comprehensive plan for managing a potentially dangerous second wave of COVID-19. Delaware preparing for pandemic resurgence with advisory committee headed by Lt. Gov. Hall Long Delaware will be prepared for any resurgence of novel coronavirus COVID-19. wdel.com", "2020-06-10T22:22:05.000Z": "We should recognize the ugly history around race in Delaware and across our country, and work together in good faith to make meaningful change.", "2020-06-10T22:22:04.000Z": "I was proud to stand alongside Senator Darius Brown and the entire Delaware Legislative Black Caucus today - as well as our Attorney General Kathy Jennings. Black Delaware lawmakers, attorney general call for police accountability with proposed reforms Attorney General Kathy Jennings, a Democrat, and the Legislative Black Caucus are calling for sweeping law changes that would affect police. delawareonline.com", "2020-06-10T21:18:39.000Z": "I want to thank the working groups who are providing recommendations for a safe return to school. Emma Brower, a senior at Sussex Tech, is providing a much needed student perspective on the health and wellness working group. http:// doverpost.com/news/20200610/ sussex-tech-senior-helping-advise-delaware-school-reopening-efforts ", "2020-06-10T19:13:50.000Z": "It's easy to get tested for COVID-19 in Delaware. Here is what the process will look like for those without symptoms: Delaware's free saliva test for coronavirus is a snap - and nothing gets shoved up your nose The state opened sites to offer quick, easy testing, even for those without symptoms. A WHYY reporter navigated the drive-thru gauntlet. whyy.org", "2020-06-10T13:51:10.000Z": "Nominations are now open for the Compassionate Champion Award, the State of Delaware's trauma-informed care recognition program that highlights outstanding achievement by individuals and organizations that provide trauma-informed services.  https:// news.delaware.gov/2020/06/09/nom inations-open-for-delawares-compassionate-champion-award/ ", "2020-06-10T01:35:04.000Z": "Reporters have a fundamental right to cover the demonstrations we're seeing in Delaware and across our country. They should not be arrested for doing their jobs. That's not acceptable. Quote Tweet USA TODAY @USATODAY A USA TODAY Network journalist was arrested on Facebook Live while covering protests in Delaware. Show this thread", "2020-06-09T19:36:12.000Z": "I encourage Delawareans, with or without symptoms, to get tested at one of the many saliva-based community testing locations throughout the state this week.\n\nFor a full testing calendar, visit: http:// coronavirus.delaware.gov/testing Register in advance at http:// delaware.curativeinc.com", "2020-06-09T17:56:16.000Z": "Subtítulos en Español: 6/9/20: Respuesta de Delaware al COVID-19 On Livestream livestream.com", "2020-06-09T17:56:15.000Z": "WATCH NOW: I am giving a COVID-19 briefing joined by Dr. Karyl Rattay, Director of the Delaware Division of Public Health, and Damian DeStefano, Director of the Delaware Division of Small Business. View the livestream here: 6/9/20: COVID-19 Briefing On Livestream livestream.com", "2020-06-09T15:50:30.000Z": "The COVID-19 emergency presents enormous financial challenges for every state including DE. Delawareans can be proud of the work we've done with the General Assembly to boost the State's finances prior to this unanticipated event, so we are better prepared to weather the storm.", "2020-06-09T15:50:29.000Z": "Delaware continues to receive high marks for fiscal management which allows us to sustain the important investments we've made in our schools, our communities and our economy, including efforts to address the impacts of COVID-19.  https:// news.delaware.gov/2020/06/09/del awares-triple-a-bond-ratings-reaffirmed/ ", "2020-06-08T13:48:59.000Z": "TOMORROW: The @FoodBankofDE is hosting a Drive-Thru Mobile Food Pantry at Absalom Jones Community Center in Wilmington starting at 11:30 a.m.\n\nRegister in advance at http:// Juneabsalomjones.eventbrite.com .", "2020-06-07T21:20:42.000Z": "As part of DE's rolling reopening, personal care services and private instruction businesses can reopen starting Monday, June 8. \n\nFor the latest Phase 1 industry guidelines, visit: http:// de.gov/phase1", "2020-06-07T01:03:10.000Z": "Thinking tonight about the men and women of the U.S. military - of this generation and of 76 years ago today - who have fought on the front lines and made the ultimate sacrifices for our freedoms. #DDay", "2020-06-06T14:57:06.000Z": "As your Governor, it's my responsibility to make sure that we make progress. That we improve relationships between law enforcement and the people of our state.", "2020-06-06T14:57:05.000Z": "To all the Delawareans who showed up and stayed through the rain to peacefully protest- thank you. I especially want to thank the organizers of Friday night's demonstration.\n\nI hear you. #blacklivesmatter", "2020-06-05T20:50:45.000Z": "Taking part in a community clean up on the East Side of Wilmington. Glad to have cleaned up with @teacher_city and the crew.", "2020-06-05T17:49:09.000Z": "WATCH NOW: I am giving a COVID-19 briefing joined by Secretary Cerron Cade of the Delaware Department of Labor and Col. Nathaniel McQueen, Jr. of the Delaware Department of Safety & Homeland Security. View the livestream here: 6/5/20: COVID-19 Briefing On Livestream livestream.com", "2020-06-05T14:08:31.000Z": "Thank you Professor @MuqtedarKhan for inviting me to discuss these important issues. Now more than ever, we need more conversation. Quote Tweet Dr. Muqtedar Khan @MuqtedarKhan A Khanversation with Governor John Carney \nIn this Khanversation @JohnCarneyDE addresses rebuilding the economy, entrenched racial bias and the need for social and criminal justice reforms.  @John_Carney @ChrisCoonsforDE  @LisaBRochester  @PeleskoJ  @udcpc  https:// youtu.be/qFH6c2crgag", "2020-06-04T00:46:06.000Z": "This week I'm using my social media accounts to promote Delaware voices - we're calling it #DelawareSpeaksUp .\n\nThanks to Evelyn for this heartfelt, moving message.\n\nAre you a Delawarean? Send in a video! Talk about what you're feeling and thinking and what change you want to see.", "2020-06-03T22:55:13.000Z": "During the month of June, we recognize LGBTQ #PrideMonth . This is an opportunity to celebrate and remember the history of the LGBTQ community and show support and appreciation for LGBTQ Delawareans.", "2020-06-03T13:04:19.000Z": "ICYMI: Phase 2 will begin on Monday, June 15. We also announced an update as part of our rolling reopening. Starting on Monday, June 8, personal care service businesses can at 30 percent of stated fire occupancy. Read the full guidelines on Phase 2: http:// news.delaware.gov/2020/06/02/gov ernor-carney-announces-phase-2-of-delawares-economic-reopening-to-begin-on-june-15/ ", "2020-06-02T17:51:38.000Z": "Subtítulos en Español: 6/2/20: Respuesta de Delaware al COVID-19 On Livestream livestream.com", "2020-06-02T17:51:37.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Karyl Rattay, Director of the Division of Public Health, and AJ Schall, Director of @DelawareEMA . View the livestream here: 6/2/20: COVID-19 Briefing On Livestream livestream.com", "2020-06-01T22:33:41.000Z": "In the meantime, Delawareans need to remain vigilant. Visit your favorite restaurant, but maintain social distance in all public settings. Wash or sanitize your hands frequently. Wear face coverings, and please stay home if you feel sick. Now is not the time to let up.", "2020-06-01T22:33:40.000Z": "This pandemic is not over. The COVID-19 virus is still active in Delaware, and there's a real risk of a dangerous second wave in fall 2020. That's why we created the Pandemic Resurgence Advisory Committee (PRAC).  https:// news.delaware.gov/2020/06/01/gov ernor-carney-creates-pandemic-resurgence-advisory-committee/ ", "2020-06-01T19:09:59.000Z": "The State of Delaware is hosting three saliva-based testing events this week. This testing is for Delawareans with and without symptoms.\n\nPre-register at http:// delaware.curativeinc.com to reserve your place and reduce check-in time. On-site registration will be available.", "2020-06-01T18:26:08.000Z": "On a Facebook Live Q&A with @delawareonline reporters @MereNewman and @JeanneKuang . \n\nWatch live: Live Q&A with Gov. John Carney Gov. John Carney will speak live with reporters Meredith Newman and Jeanne Kuang to discuss the state's reopening and local George Floyd protests at... facebook.com", "2020-06-01T17:20:58.000Z": "Today marks Phase 1 of our economic reopening. It's important to remember that COVID-19 is still active in Delaware. We need folks to keep following public health precautions.\n\nBusinesses can download signs in English and Spanish here: https:// coronavirus.delaware.gov/for-businesses/", "2020-06-01T14:57:24.000Z": "Destruction isn't the way. Random acts of vandalism and violence are counterproductive. Frankly, it's an insult to the cause.\n\nBut the anger is real. I've heard that anger and frustration from so many Delawareans in the days since George Floyd's death. I share that anger.", "2020-05-31T16:25:32.000Z": "I have great faith in the people of our city and of our state. Destruction isn't the way. The vast majority of folks are focused on the good. Out on Market Street in Wilmington today, you can see that goodness as the community and business owners come together to rebuild.", "2020-05-31T01:43:24.000Z": "In the days and months ahead, we all need to commit ourselves to healing the racial discord and addressing the systemic inequality that gives rise to it. But we need to do so peacefully and in good faith.", "2020-05-31T01:43:23.000Z": "I've heard the anger and frustration from so many Delawareans in the days since George Floyd's death. I share that anger.", "2020-05-29T23:23:00.000Z": "COVID-19 is still active in Delaware, even as we take steps to reopen Delaware's economy and get Delawareans back to work. \n\nIt's important that we continue to follow basic health precautions to protect ourselves, our families and our neighbors.", "2020-05-29T23:22:46.000Z": "DE businesses: As you prepare for Phase 1 on June 1, take a look at these printable signs with public health guidance to display on your doors and windows.\n\nView and download the signs here: https:// coronavirus.delaware.gov/for-businesses/", "2020-05-29T19:10:21.000Z": "It is important that everyone remember that this virus has not gone away. It's up to all Delawareans and visitors to take basic health precautions to limit community spread of COVID-19. Act with a sense of community and protect others.", "2020-05-29T19:10:20.000Z": "Today, we issued guidance for summer camps and summer school programs as Delaware continues a rolling reopening of the economy. \n\nSummer camps and summer school programs will be permitted to open effective Phase 2 of the economic reopening.  https:// news.delaware.gov/2020/05/29/gov ernor-carney-releases-guidance-on-summer-camp-summer-school-programs/ ", "2020-05-29T17:55:16.000Z": "Subtítulos en Español: 5/29/20: Respuesta de Delaware al COVID-19 On Livestream livestream.com", "2020-05-29T17:54:30.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Karyl Rattay, Director of the Division of Public Health, and AJ Schall, Director of @DelawareEMA . View the livestream here: 5/29/20: COVID-19 Briefing On Livestream livestream.com", "2020-05-29T16:44:45.000Z": "My heart aches to see this senseless loss of life in Minnesota. We need real national leadership - not political division and threats of violence from the President of the United States. \n\nI continue to think about George Floyd and his family. 'Absolute Chaos' in Minneapolis as Protests Grow Across U.S. Minnesota's governor said the police and National Guard had been overwhelmed by protests, which raged even after a former police officer was charged with murdering George Floyd. nytimes.com", "2020-05-26T20:34:38.000Z": "Please join DDOE on Thursday, May 28, 2020 at 2pm as we host the first COVID-19 School Reopening Working Groups meeting. More info: https:// tinyurl.com/y96ytf4x", "2020-05-27T22:38:49.000Z": "Congratulations to Col. Nathaniel McQueen, Jr., our next Secretary of the Department of Safety and Homeland Security, and all the distinguished Delawareans who were confirmed to serve on our world-class judiciary.  https:// news.delaware.gov/2020/05/27/gov ernor-carney-issues-statement-on-senate-confirmations/ ", "2020-05-24T13:41:44.000Z": "Testing event Thursday May 28 in Harrington at Lake Forest Elementary School campus. To register go to http:// delaware.curativeinc.com  #netde  #harringtonDE  #COVID19Delaware", "2020-05-26T20:06:23.000Z": "DE hoteliers, learn about how to clean your hotel and other steps you'll need to follow to protect your guests and employees from COVID-19 in this free webinar on Friday.\n\nLearn how to register: http:// ow.ly/DH5A50zQHMS  #delbiz  #smallbiz  #coronavirus  #COVID19", "2020-05-26T20:00:26.000Z": "DE retailers, learn about how to clean your store and other steps you'll need to follow to protect your customers and employees from COVID-19 in this free webinar on Friday.\nLearn how to register: http:// ow.ly/7i0350zQHlZ  #delbiz  #smallbiz  #coronavirus  #COVID19", "2020-05-26T19:54:13.000Z": "DE restaurant owners, learn about how to clean your restaurant and other steps you'll need to follow to protect your customers and employees from COVID-19 in this free webinar Friday.\nLearn how to register: http:// ow.ly/bAwu50zQH29  #delbiz  #smallbiz  #coronavirus  #COVID19", "2020-05-26T18:21:06.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Karyl Rattay, Director of the Division of Public Health, and AJ Schall, Director of @DelawareEMA . View the livestream here: 5/26/20: COVID-19 Briefing On Livestream livestream.com", "2020-05-26T16:30:48.000Z": "Today we announced that on June 1, the ban on short-term rental units and the mandatory 14-day quarantine for out-of-state travelers will be lifted.\n\nWe want visitors to enjoy Delaware, but it's important that we remember that COVID-19 is still active. https:// news.delaware.gov/2020/05/26/gov ernor-carney-announces-lifting-of-short-term-rental-ban-out-of-state-quarantine-on-june-1/ ", "2020-05-25T21:00:53.000Z": "I'll be joining @wolfblitzer on @CNNSitRoom soon. \n\nWatch live: http:// go.cnn.com/?stream=cnn", "2020-05-25T17:35:27.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Jamie Mack, Chief of Health Systems Protection in the Delaware Division of Public Health. View the livestream here: 5/25/20: Press Briefing On Livestream livestream.com", "2020-05-25T16:37:55.000Z": "Picked up some fries from Thrasher's while I was in @CityofRehoboth", "2020-05-25T16:25:41.000Z": "I stopped by the Rehoboth Beach Boardwalk today. I'm really pleased to see that folks are social distancing and wearing face coverings. \n\nThank you to everyone following these public health precautions and making sure we can reopen safely.", "2020-05-25T13:09:22.000Z": "We remember and honor all of those who made the ultimate sacrifice for our country. We will never forget the price these men, women, and families paid for all of us. Quote Tweet Delaware.gov @delaware_gov", "2020-05-25T00:53:21.000Z": "This Memorial Day in Delaware will be different than any I can remember, but the purpose of the holiday remains the same.\n\nWe are called to remember, to reflect, and to live together in a way that honors the fallen men and women of our armed services.", "2020-05-25T00:52:56.000Z": "We honor their memory at this difficult time by caring for each other and protecting those in our communities who are more vulnerable than ourselves. We offer our compassion and support to those who have made their own sacrifices during this public health crisis.", "2020-05-25T00:52:16.000Z": "We come together on Memorial Day to remember the men and women of our armed forces who made the ultimate sacrifice defending of our country and our way of life.", "2020-05-24T16:28:22.000Z": "While this year's Eid al-Fitr celebrations will be different than past years due to social distancing, I hope Delaware's Muslim community is able to celebrate and create lasting memories with close family members.", "2020-05-24T16:28:21.000Z": "As Muslims throughout Delaware observe Eid al-Fitr and celebrate the end of Ramadan, I hope they find comfort and strength in their faith. Quote Tweet Delaware.gov @delaware_gov Thank you for staying safe, socially distancing, and reflecting at home during the Holy Month.", "2020-05-23T19:46:54.000Z": "Sharing this again as a reminder this Memorial Day weekend.\n\nLook out for others. \n\nAct with a sense of community.\n\nBe safe.", "2020-05-22T22:11:06.000Z": "We look forward to welcoming Delawareans back at the beach this weekend, but we all need to take basic precautions to prevent the spread of COVID-19. Governor Carney Launches Public Education Campaign with Beach Towns as Delaware Beaches Reopen -... Effort aims to raise awareness on beach restrictions, individual responsibility in COVID-19 mitigation, ahead of Memorial Day Weekend and summer season WILMINGTON, Del. -  Governor John Carney on... news.delaware.gov", "2020-05-22T19:26:00.000Z": "The partnership between the Division of Public Health, @DelawareEMA , Delaware hospital systems, primary care physicians & other providers, Federally Qualified Health Centers, pharmacies, and community-based organizations, will help increase access in DE to 80,000 tests monthly.", "2020-05-22T19:25:59.000Z": "We know that widespread community testing needs to be in place before we can safely reopen our economy. Today, we announced an update on our effort to increase access to community-based testing statewide.  http:// news.delaware.gov/2020/05/22/gov ernor-carney-announces-proactive-community-based-covid-19-testing/ ", "2020-05-22T17:55:39.000Z": "Subtítulos en Español: 5/22/20: Respuesta de Delaware al COVID-19 On Livestream livestream.com", "2020-05-22T17:55:38.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Karyl Rattay, Director of the Division of Public Health, AJ Schall, Director of @DelawareEMA and Mike Jackson, Director of the Delaware Office of Management and Budget View the livestream here: 5/22/20: COVID-19 Briefing On Livestream livestream.com", "2020-05-22T14:12:46.000Z": "REMINDER: The Delaware Division of Revenue, Delaware Division of Unemployment Insurance, and the IRS are holding a COVID-19 Relief Discussion on a public conference call today at 11:30 a.m.\n\nLearn more: Revenue Announces Joint Public Call with Unemployment and the IRS - State of Delaware News Together with the IRS and Delaware's Department of Labor Unemployment Insurance Division, the Division of Revenue has announced a COVID-19 Relief Discussion this coming Friday, May 22, 2020, at 11:30... news.delaware.gov", "2020-05-21T22:49:14.000Z": "ICYMI: The @FoodBankofDE is hosting a Drive-Thru Mobile Pantry tomorrow in New Castle County.\n\nWhen: Friday, May 22 starting at 11 a.m.\nWhere: Glasgow High School, 1901 S. College Ave., Newark, Del.\nRegister in advance at: http:// MayNewCastleCountyFood.eventbrite.com", "2020-05-21T20:16:26.000Z": "Successful testing event today in #MiddletownDE with approx. 1,000 people tested in just 4 hours! Next testing event is Sunday in Dover, make sure to register at http:// delaware.curativeinc.com to reserve your spot!", "2020-05-21T19:44:19.000Z": "Delawareans should stay vigilant. Keep your distance from others. Wear a face covering in public settings, including on the boardwalk. Wash or sanitize your hands frequently. \n\nWe need to get this right and personal behavior matters. Now's not the time to let up.", "2020-05-21T19:44:18.000Z": "Widespread community testing for COVID-19 and contact tracing are keys to reopening Delaware's economy safely while protecting our most vulnerable neighbors. These additional federal resources will be a real help in that effort. Division of Public Health Awarded $67 Million Grant - State of Delaware News Grant to be Used to Implement Expanded Testing and Data Capacity for COVID-19 DOVER (May. 21, 2020) - The Division of Public Health (DPH) is announcing it was awarded a $67 million Epidemiology... news.delaware.gov", "2020-05-21T18:37:57.000Z": "If you're healthy and able, please consider donating blood to make sure our hospitals/medical centers have a sufficient supply.\n\nSocial distancing and other precautions are being taken to ensure donor, staff and volunteer safety.\n\nTo make an appointment: http:// delmarvablood.org/give-blood Quote Tweet Blood Bank Delmarva @DelmarvaBlood As Delmarva begins to slowly reopen and hospitals anticipate the return of elective surgeries, we are issuing an urgent call for donors. The need for blood has rebounded to pre-COVID-19 levels, but supply is dangerously low.  PLEASE sign up to give now: http:// smarturl.it/BBD_UrgentTW", "2020-05-21T14:24:20.000Z": "First meeting of school building reopening working groups is at 2 p.m. today. You also can email your ideas to reopeningideas@doe.k12.de.us. Find meeting details here: https:// publicmeetings.delaware.gov/Meeting/66051? fbclid=IwAR2YDrzEhgIEpACremj1nDfG9P4jsT36rv5oTtb0yWIkZ9lhLTXH5cgnjck   #netde  #edude", "2020-05-21T02:21:00.000Z": "\"My message to Delawareans is, social distancing is working, but now is not the time to let up as we gradually reopen our economy. Let's focus on staying safe, wearing masks, keeping distant from one another, no large gatherings,\" Gov. John Carney says about reopening plans. From The Situation Room", "2020-05-20T23:22:38.000Z": "During the small business recovery town halls, we heard that small businesses were worried about customers feeling comfortable visiting their shops.\n\nThe Delaware Div. of Small Business developed \"COVID-19 Customer Protection Standards\" based on Phase 1 guidance, & DPH guidance.", "2020-05-20T21:00:15.000Z": "I'll be joining @wolfblitzer on @CNNSitRoom soon. \n\nWatch live: https:// go.cnn.com/?stream=cnn", "2020-05-20T15:20:56.000Z": "This week we celebrate the first responders who work around the clock to keep Delawareans safe and healthy. Thank you to all of the Emergency Medical Responders, Emergency Medical Technicians, and Paramedics throughout our state for your service. #NationalEMSWeek", "2020-05-20T14:20:51.000Z": "The Delaware Division of Revenue, Delaware Division of Unemployment Insurance, and the IRS are hosting a COVID-19 Relief Discussion on a public conference call this Friday, May 22 at 11:30 a.m.\n\nLearn more: Revenue Announces Joint Public Call with Unemployment and the IRS - State of Delaware News Together with the IRS and Delaware's Department of Labor Unemployment Insurance Division, the Division of Revenue has announced a COVID-19 Relief Discussion this coming Friday, May 22, 2020, at 11:30... news.delaware.gov", "2020-05-19T22:30:55.000Z": "During Mental Health Awareness Month, @bethanyhalllong is among state officials offering ways they are taking care of their emotional health during COVID-19. Need help? Reach out 24/7 to DHSS' new free Hope Line: 1-833-9-HOPEDE #mentalhealth  #COVID19  #netDE", "2020-05-20T02:54:24.000Z": "This coronavirus crisis is a real test. \n\nThe question is: are you just thinking about yourself?\n\nIs this every man or woman for themselves?\n\nOr are we all in this together?\n\nIf we act with a sense of community, and care for others, we'll get through this more quickly.", "2020-05-19T17:48:42.000Z": "Subtítulos en Español: 5/19/20: Respuesta de Delaware al COVID-19 On Livestream livestream.com", "2020-05-19T17:48:41.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Karyl Rattay, Director of the Division of Public Health, Jennifer Cohan, Secretary of @DelawareDOT , and Damian DeStefano, Director of @delbiz . View the livestream here: 5/19/20: COVID-19 Briefing On Livestream livestream.com", "2020-05-19T17:26:14.000Z": "This is another step forward in the rolling reopening of Delaware's economy. It's our hope that these additional steps will safely bring some relief to Delaware businesses and workers who have made real financial sacrifices during this COVID-19 crisis.", "2020-05-19T17:26:13.000Z": "Today, we announced additional steps allowing retail establishments and restaurants to expand operations - while maintaining social distancing to prevent spread of COVID-19. For details on the interim steps in today's announcement: http:// news.delaware.gov/2020/05/19/gov ernor-carney-announces-additional-interim-steps-for-retail-restaurant-businesses-to-expand-operations/ ", "2020-05-18T21:34:22.000Z": "Excited to co-chair the health and wellness workgroup related to reopening Delaware schools. Such important work, focusing on both physical and mental health- and equity for all students, as we address how to approach a safe return to school. #COVID19  #mentalhealth  #decovid Quote Tweet Governor John Carney @JohnCarneyDE Today, with Secretary Susan Bunting of the @DEDeptofEd , we announced that three COVID-19 School Reopening Working Groups will create a plan for the safe reopening of Delaware school buildings.  https:// news.delaware.gov/2020/05/18/gov ernor-carney-secretary-bunting-announce-working-groups-to-plan-safe-return-to-school-buildings/  Show this thread", "2020-05-18T21:05:48.000Z": "The working groups will focus on: Health and Wellness Academics and Equity Operations and Services\n\nThese working groups will provide important recommendations to Secretary Bunting and school and district leaders on how to safely return to school.", "2020-05-18T21:05:47.000Z": "Today, with Secretary Susan Bunting of the @DEDeptofEd , we announced that three COVID-19 School Reopening Working Groups will create a plan for the safe reopening of Delaware school buildings.  https:// news.delaware.gov/2020/05/18/gov ernor-carney-secretary-bunting-announce-working-groups-to-plan-safe-return-to-school-buildings/ ", "2020-05-18T18:48:30.000Z": "Do your best to practice your faith virtually. Wear a cloth face covering if you attend an in-person service. Remain at least 6 feet away from others. Wash/sanitize your hands frequently.\n\nNow's not the time for Delawareans to let up.", "2020-05-18T18:48:29.000Z": "In coordination with @Delaware_DHSS Public Health and the Delaware Council of Faith-Based Partnerships, we have updated the guidance for churches and other houses of worship.  https:// news.delaware.gov/2020/05/18/gov ernor-carney-issues-guidance-for-churches-houses-of-worship/ ", "2020-05-18T14:15:26.000Z": "Delaware will host a saliva-based testing event from 10am-2pm Thursday May 21 at Middletown High School. Pre-register at http:// delaware.curativeinc.com , limited on-site registration available. Watch the video http:// de.gov/testing . #covid19delaware  #netde  #delaware  #middletownde", "2020-05-18T14:45:20.000Z": "TODAY: @FoodBankofDE is having Drive-Thru Mobile Food Pantry in Sussex County. Delawareans must bring ID and proof of residency.\n\n5/20 in Kent County\nPre-register: http:// MayKentCountyFood.eventbrite.com 5/22 in New Castle County\nPre-register: http:// MayNewCastleCountyFood.eventbrite.com", "2020-05-15T18:00:37.000Z": "We can't have a healthy, functioning economy again until our communities are healthy. Your actions have driven down cases and hospitalizations statewide. That will help us reopen Delaware's economy safely in the coming weeks - while protecting the most vulnerable Delawareans.", "2020-05-15T18:00:36.000Z": "Today, we released guidance for Phase 1 of Delaware's rolling reopening. Our Phase 1 reopening plan provides general and sector-specific guidance for Delawareans and Delaware businesses. Phase 1 of Delaware's economic reopening will begin on June 1.  https:// news.delaware.gov/2020/05/15/gov ernor-carney-releases-phase-1-economic-reopening-guidance/ ", "2020-05-15T17:57:44.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Karyl Rattay, Director of the Division of Public Health, and AJ Schall, Director of @DelawareEMA . View the livestream here: 5/15/20: COVID-19 Briefing On Livestream livestream.com", "2020-05-15T14:42:40.000Z": "The @FoodBankofDE is having Drive-Thru Mobile Food Pantries next week in all three counties. \n\n5/18 in Sussex County\nPre-register: http:// MaySussexCountyFood.eventbrite.com 5/20 in Kent County\nPre-register: http:// MayKentCountyFood.eventbrite.com 5/22 in New Castle County\nPre-register: http:// MayNewCastleCountyFood.eventbrite.com", "2020-05-14T19:24:03.000Z": "Summer at the beach and the pool is a huge part of life for so many Delawareans. \n\nAs we ease our way into a new normal, we're trying to find ways for Delawareans to enjoy the outdoors and the company of their families.", "2020-05-14T19:24:02.000Z": "After consulting @Delaware_DHSS Public Health and mayors of DE's beach towns, we will lift restrictions on DE beaches and community pools at 5 pm on Friday, May 22, subject to strict social distancing requirements and other restrictions.  https:// news.delaware.gov/2020/05/14/gov ernor-carney-announces-reopening-of-beaches-to-delawareans/ ", "2020-05-14T12:50:31.000Z": "**TESTING EVENT TODAY**\nFree #COVID19 testing event today from 10am-2pm at @SeafordBluejays , 1 Swain Rd in @cityofseaford . Preregister at http:// delaware.curativeinc.com or register on site. This event is for people with and without symptoms. #seafordde  #covid19delaware  #netde  #delaware", "2020-05-13T22:13:29.000Z": "May is Foster Care Awareness Month. During this month, we recognize all the foster children and youth, and celebrate all the foster families in our state. Thank you to all the foster parents who continue to adapt and support children so they can be successful in life. @DelKids", "2020-05-12T22:23:27.000Z": "Joining @GovMurphy for a live Q&A. \n\nWatch live on @delawareonline : Ask the governors: Live coronavirus Q&A with NJ Gov. Phil Murphy and Delaware Gov. John Carney Join us as we host a live COVID-19 Q&A with New Jersey Gov. Phi Murphy and Delaware Gov. John Carney. delawareonline.com", "2020-05-12T17:46:03.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Karyl Rattay, Director of the Division of Public Health, and AJ Schall, Director of @DelawareEMA . View the livestream here: 5/12/20: COVID-19 Briefing On Livestream livestream.com", "2020-05-12T17:14:15.000Z": "We entered into an agreement with the nonpartisan research institution NORC at the University of Chicago to build Delaware's statewide contact tracing program to contain COVID-19, limit Delawareans' exposure to the disease, and restart our economy.  https:// news.delaware.gov/2020/05/12/gov ernor-carney-announces-statewide-contact-tracing-plan-for-covid-19/ ", "2020-05-12T12:23:00.000Z": "First Lady Tracey Quillen Carney continued her visits to meal sites across the state last week to thank child nutrition workers for helping feed our students while school buildings are closed. @JohnCarneyDE  #netde  #edude", "2020-05-12T16:16:17.000Z": "May 15 is Peace Officers Memorial Day. We pay tribute to the local, state, and federal peace officers who have died or who have been disabled in the line of duty. Thank you @DECorrection for this tribute to Lt. Steven Floyd and Delaware's law enforcement. DOC Pay Tribute to Lt. Steven R. Floyd and all those in law enforce... During National Police Week, and in observance of Peace Officers Memorial Day on May 15, DOC pays tribute to Lt. Steven R. Floyd and all those in law enforce... youtube.com", "2020-05-11T17:43:25.000Z": "There is nothing better than heading to a farmers' market in the spring as Delaware grown produce starts to become available. \n\nThere is a sense of community pride around farmers' markets that includes supporting our local economy and our family farms.", "2020-05-11T17:42:54.000Z": "With the help of the farmers' market managers and the staff at @AgricultureDE and the Division of Public Health, farmers' market will be allowed to begin opening on May 15 as long as they are able to enact the protocols issued by the Dept. of Agriculture. Delaware Farmers' Markets To Open Under New COVID-19 Protocols - State of Delaware News With the assistance of the Delaware Farmers' Market Coalition, a group of market managers from across the state, the Delaware Department of Agriculture (DDA) is issuing protocols to help farmers'... news.delaware.gov", "2020-05-11T16:43:54.000Z": "The @DelawareDOL issued these steps for self-employed & independent contractors to apply for Pandemic Unemployment Assistance (PUA).  \n\nFor more information, visit https:// dol.delaware.gov/uifaqs", "2020-05-11T16:18:13.000Z": "The Hall of Fame of Delaware Women Applications are closing tomorrow, Tuesday, May 12. This is an important opportunity to recognize the remarkable women in our state and the impact they have made. \n\nVisit http:// de.gov/women to submit your application. Quote Tweet DELAWARE WOMEN @DelawareWomen Have you nominated a #RemarkableDEWoman ? Applications are due TOMORROW! Don't miss out on the opportunity to recognize an outstanding #DelawareWoman . Submit your application today.", "2020-05-10T20:14:52.000Z": "Happy Mother's Day to my mom, Ann Carney. Though we are celebrating differently this year, we thank you for your wonderful love and care for all nine of your kids and all of your grandkids. \n\n(photo from 2017)", "2020-05-09T18:44:30.000Z": "If we continue to follow public health guidelines, we have a real shot of getting DE moving again starting June 1.\n\nNCC & Kent numbers: moving in the right direction. But there is an ongoing threat in Sussex. We need everyone to lean into reducing COVID-19 spread in southern DE. Quote Tweet Governor John Carney @JohnCarneyDE Important reminders from @Delaware_DHSS : \n\nWash your hands often\nWear a face covering\nDon't go out in public unnecessarily\nDisinfect surfaces\nDon't gather in large groups\nCover your cough or sneeze\nAvoid touching your face\n\nLearn more: http:// coronavirus.delaware.gov/what-delawarea ns-can-do/ ", "2020-05-09T18:20:38.000Z": "Important reminders from @Delaware_DHSS : \n\nWash your hands often\nWear a face covering\nDon't go out in public unnecessarily\nDisinfect surfaces\nDon't gather in large groups\nCover your cough or sneeze\nAvoid touching your face\n\nLearn more: http:// coronavirus.delaware.gov/what-delawarea ns-can-do/ ", "2020-05-09T00:28:41.000Z": "As we head into Mother's Day weekend, I'd like to wish a happy Mother's Day to all the mothers, grandmothers, and mother figures in our state. \n\nThis year, we have to celebrate in a different way and be mindful of gathering together.\n \nHave a safe and happy Mother's Day.", "2020-05-08T18:02:23.000Z": "Delawareans can't let up. We still need to maintain social distancing to avoid a dangerous rebound in cases. Wash your hands. Don't go out in public unnecessarily. \n\nIf we continue follow public health guidelines, we have a  shot at getting Delaware moving again starting June 1.", "2020-05-08T18:02:22.000Z": "Today we announced the target date for Phase I of Delaware's economic reopening is June 1st. Delaware's State of Emergency declaration, including the stay-at-home order and its other modifications, will be extended through May 31.  https:// news.delaware.gov/2020/05/08/gov ernor-carney-releases-statement-on-economic-reopening-announces-june-1-as-target-for-phase-i/ ", "2020-05-08T17:55:33.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Karyl Rattay, Director of the Division of Public Health, and AJ Schall, Director of @DelawareEMA . View the livestream here: 5/8/20: COVID-19 Briefing On Livestream livestream.com", "2020-05-08T16:09:30.000Z": "We know that widespread community testing needs to be in place before we can safely reopen our economy.\n\nFinding a reliable supply of reliable tests has been a serious challenge, but we've put a plan in place that gets us to the starting line.\n\nLearn more: https:// news.delaware.gov/2020/05/08/gov ernor-carney-announces-significant-expansion-of-statewide-testing-program-for-covid-19/ ", "2020-05-08T12:27:21.000Z": "I joined @Maxima953fm host Kevin Andrade this morning to talk about our interim steps for reopening and the COVID-19 situation in Sussex County and statewide. Entrevista exclusiva con John Carney Gobernador de Delaware #COBERTURACONTINUA | Coronavirus (COVID-19) vimeo.com", "2020-05-07T22:02:24.000Z": "WATCH NOW: Lieutenant Governor Bethany Hall-Long is hosting the final virtual town hall to collect public feedback that will inform Delaware's recovery effort. This town hall will be focused on Southern New Castle County. Watch on Livestream: Recovery Town Hall On Livestream livestream.com", "2020-05-07T16:07:45.000Z": "DE's presidential primary will be on July 7. Eligible registered voters in DE will receive an absentee ballot application in the mail.\n\nDelawareans have a basic, fundamental right to vote. These changes will allow DE voters to safely exercise that right. https:// news.delaware.gov/2020/05/07/gov ernor-carney-reschedules-presidential-primary-for-july-7/ ", "2020-05-06T23:55:30.000Z": "For guidance on face coverings and tips on how to make your own, visit: https:// coronavirus.delaware.gov/guidance-for-f ace-coverings/  Quote Tweet YoUDee @YoUDee00 Stay safe!! twitter.com/UDBlueHens/sta", "2020-05-06T23:33:54.000Z": "WATCH NOW: Lieutenant Governor Bethany Hall-Long is hosting a virtual town hall to collect public feedback that will inform Delaware's recovery effort. This town hall will be focused on Sussex County. Watch on Livestream: Recovery Town Hall On Livestream livestream.com", "2020-05-06T21:12:36.000Z": "I'll be joining @wolfblitzer on @CNNSitRoom soon.\n\nWatch live: https:// go.cnn.com/?stream=cnn", "2020-05-06T20:24:04.000Z": "REMINDER: The deadline to register to vote for Delaware's June 2nd presidential primary is this Saturday, May 9th. Social distancing due to COVID-19 is a valid reason to vote by absentee ballot. Register to vote or request an online absentee ballot: http:// ivote.de.gov/voterview", "2020-05-06T18:53:03.000Z": "Today we celebrate #NationalNurseDay . This year, we especially recognize the vital role of nurses, who take care of our loved ones with compassion and dedication. Thank you to the nurses and all the health care professionals working on the front lines. Quote Tweet Delaware.gov @delaware_gov Happy National Nurses Day! Thank you for protecting us. Celebrate our health care heroes by sending a thank you note to Delaware nurses. Download a template and mailing instructions here: https:// coronavirus.delaware.gov/wp-content/upl oads/sites/177/2020/03/Thank-You-Note-for-Health-care-Workers.pdf ", "2020-05-06T16:45:59.000Z": "ICYMI: Today beginning at 3:15 p.m., Dover Air Force Base will be conducting a C-17 Globemaster III flyby throughout Delaware in a show of support for COVID-19 frontline workers. #DoverAFBSalutes", "2020-05-05T14:05:58.000Z": "A huge thank you to those working on the frontlines, keeping Delawareans safe! #ThanksDE  #weappreciateyou  #thankyou  #Delaware", "2020-05-05T01:31:45.000Z": "Tonight we #lightitblue to honor those working on the frontlines, \nwho risk it all so we can stay safe at home. We thank you. #thanksde", "2020-05-05T00:49:27.000Z": "Thank you to all the frontline and essential workers for everything you do ... these blue lights are for you!  #ThanksDE", "2020-05-05T18:28:39.000Z": "The people of Delaware grabbed the curve and pulled it down. That didn't happen on its own.\n\nWhat we are doing is working. We are seeing the curve flattening out. But we can't let up yet. We need to stay the course and lean in. \n\nWe need to pull that curve down even more.", "2020-05-05T17:57:43.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Karyl Rattay, Director of the Division of Public Health, and AJ Schall, Director of the Delaware Emergency Management Agency. View the livestream here: 5/5/20: COVID-19 Briefing On Livestream livestream.com", "2020-05-05T17:41:43.000Z": "Our goal is to provide economic relief to Delaware citizens and businesses - while maintaining strict adherence to health and safety guidelines. \n\nWe also announced announced a plan to test all residents and staff of Delaware long-term care facilities for COVID-19.", "2020-05-05T17:41:42.000Z": "Today we announced a series of interim steps allowing small businesses to resume limited operations effective 8 a.m. on Friday, May 8. Read the full announcement: Governor Carney Announces Interim Steps Allowing Small Businesses; Universal Testing in Nursing... Retail, hair dressers able to resume limited services while maintaining health guidelines WILMINGTON, Del. - Governor John Carney on Tuesday announced a series of interim steps allowing small... news.delaware.gov", "2020-05-05T15:47:51.000Z": "Un mensaje de Albert Pujols de los Angelinos de Anaheim.\n\nPara más información: http:// coronavirus.delaware.gov/recursos-en-es panol  Watch in English/Mira el video en el inglés: https:// youtube.com/watch?v=eHbnqW 7rI5s ", "2020-05-05T01:27:03.000Z": "Starting at 7pm tonight, areas across our state showed their support for all those working on the front lines during the COVID-19 pandemic by lighting up blue. Share your photos using #ThanksDE  @DelawareTourism", "2020-05-04T22:01:00.000Z": "WATCH NOW: Lieutenant Governor Bethany Hall-Long is hosting a virtual town hall to collect public feedback that will inform Delaware's recovery effort. This town hall will be focused on Northern New Castle County. Watch on Livestream: Recovery Town Hall On Livestream livestream.com", "2020-05-04T19:48:28.000Z": "It's National Teacher Appreciation Week. Thank you to all the educators who are stepping up to support their students in unprecedented ways.  \n \nShare your teacher appreciation stories using #IloveDEteachers or submit your stories online: https:// doe.k12.de.us/cms/module/sel ectsurvey/TakeSurvey.aspx?SurveyID=240&fbclid=IwAR3Z3uwPPYNSZ1UmmQIk553aGnT9qXBFfOkWTRZgcOcYo-KP_Gx3C7Rc5pw ", "2020-05-03T17:58:53.000Z": "We announced a joint multi-state agreement to develop a regional supply chain for personal protective equipment, other medical equipment & testing.\n\nWe need a consistent approach for moving our states out of this crisis. That includes ensuring a sufficient supply of PPE & tests.", "2020-05-03T16:36:40.000Z": "27:19 Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus. Watch Live: pscp.tv", "2020-05-03T16:22:06.000Z": "I will be joining @NYGovCuomo , @GovMurphy , @GovernorTomWolf , and @GovNedLamont for an update on our partnership with surrounding states around a PPE supply chain in the northeast. Quote Tweet Andrew Cuomo @NYGovCuomo Holding a briefing with updates on #Coronavirus . Watch Live: https:// pscp.tv/w/cX2SDDIyNjcx MDN8MXlOR2FRQmFXcnJHakU9AbzlxdJi06QrF1dBagnQKK7YO4IRTYX630bIkEHX  Show this thread", "2020-05-02T19:00:18.000Z": "May 4-8 is Teacher Appreciation Week. Educators throughout Delaware are working hard to continue engaging their students from a distance during these difficult times. \n\nShow appreciation for our great educators, and submit your #IloveDEteachers stories: https:// doe.k12.de.us/cms/module/sel ectsurvey/TakeSurvey.aspx?SurveyID=240&fbclid=IwAR3Z3uwPPYNSZ1UmmQIk553aGnT9qXBFfOkWTRZgcOcYo-KP_Gx3C7Rc5pw ", "2020-05-01T17:01:03.000Z": "#Scammers are ready to take your personal information including your bank account and Social Security information. Do not fall for these scams. We are here to protect you. \n\nEmail any #COVID19 related scams to Covid.DOJ@delaware.gov. \n \nLearn more: http:// ow.ly/PoY050ztnyn", "2020-05-02T00:12:02.000Z": "By staying home, we are reducing the risk of infecting others, including our loved ones. We need to stay the course. What we are doing is working. We are flattening the curve. \n \nThank you to everyone who has been staying home. We can't let up yet. \n\nWho do you #StayHomeDE for? GIF", "2020-05-01T18:12:18.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Karyl Rattay, Director of the Division of Public Health, and AJ Schall, Director of the Delaware Emergency Management Agency. View the livestream here: 5/1/20: COVID-19 Briefing On Livestream livestream.com", "2020-05-01T14:53:35.000Z": "Today is School Lunch Hero Day. Please join us in thanking all of the committed individuals, and the organizations that support them, for continuing to provide essential, nutritious meals to children throughout our state during this difficult time. 5/1/20: School Lunch Hero Day youtube.com", "2020-05-01T02:13:26.000Z": "Konte Sussex vin tounen yon plas cho pou COVID-19 la.\n\nYo pral fè tès ak kontak sansibilizasyon yo nan plizyè kominote Sussex yo nan sant ki pou epidemi COVID-19 la nan Delaware.  http:// coronavirus.delaware.gov/testing/", "2020-05-01T02:13:25.000Z": "Sussex County has become a hot spot for COVID-19. \n\nCommunity testing and outreach will be conducted in several Sussex communities that are at the center of Delaware's COVID-19 epidemic. For more information, visit: http:// coronavirus.delaware.gov/testing", "2020-04-30T20:38:14.000Z": "Our updated State of Emergency Declaration provides additional protections for Delaware renters during the COVID-19 pandemic, and extends the application deadline for Delaware's Senior School Property Tax Credit Program until June 1. https:// news.delaware.gov/2020/04/30/gov ernor-carney-issues-14th-modification-to-emergency-declaration/ ", "2020-04-30T13:20:42.000Z": "I want to commend and thank my good friend @RepLBR for her graceful response to the hateful and vulgar comments on Zoom yesterday. Quote Tweet Rep. Lisa Blunt Rochester @RepLBR While participating in a Zoom event for Delaware small businesses this evening, a message of hate appeared on our screens.\n\nHere's my response.", "2020-04-30T01:28:54.000Z": "We have to make decisions everyday to protect our residents based on what we have now, not what we have six months from now. We have to protect our people and protect our economy. Quote Tweet The Situation Room @CNNSitRoom \"If we know that we have treatment for folks that are hospitalized, that's a whole different ball game with respect to the risks that we're currently taking.\" Delaware Gov. Carney discusses the remdesivir study and how it could potentially impact the state's path to reopening.", "2020-04-29T22:06:12.000Z": "WATCH NOW: Lieutenant Governor Bethany Hall-Long is hosting a virtual town hall to collect public feedback that will inform Delaware's recovery effort with a focus on Kent County. Watch on Livestream: Recovery Town Hall On Livestream livestream.com", "2020-04-29T21:00:18.000Z": "I'll be joining @wolfblitzer on @CNNSitRoom soon.\n\nWatch live: https:// go.cnn.com/?stream=cnn", "2020-04-29T19:44:41.000Z": "Thank you to school nutrition workers, bus drivers, and all volunteers across the state who have been making sure children have access to nutritious meals while schools are closed. First lady of Delaware thanks school district for feeding kids Delaware First Lady Tracey Quillen Carney stopped by to thank essential school employees as they distributed 18,000 meals to local students. delawareonline.com", "2020-04-29T14:12:57.000Z": "Thank you to the @DelawareNG , the @FoodBankofDE , volunteers, and partners for helping their neighbors during this health emergency.\n\nTOMORROW: The Food Bank of Delaware is hosting a Drive-Thru Mobile Food Pantry starting at 10 am in New Castle County.  http:// eventbrite.com/e/caanan-bapti st-mobile-food-distribution-tickets-102907846138?fbclid=IwAR3Qmr5z5IELwC8xSk0y2eLP6XJyrEi0mbNWZTVjHdXyQVeOymabn8nnkuk  Quote Tweet Delaware National Guard @DelawareNG 1:40 Sgt. 1st Class Annette Wright had the opportunity to serve and support her neighbors and community in their time of need, with the Delaware National Guard & the Food Bank of Delaware // @FoodBankofDE // @DelawareEMA // @DelawareNG", "2020-04-28T23:40:01.000Z": "Community testing sites and outreach will be conducted in coordination with @Delaware_DHSS , the Delaware Division of Public Health, hospital systems, Federally Qualified Health Centers, community organizations, and Sussex County employers.", "2020-04-28T23:40:00.000Z": "Sussex County has become a hot spot for COVID-19, especially in areas along the Route 113 corridor. We are working with community partners to expand testing sites and share educational information in those communities.  http:// news.delaware.gov/2020/04/28/gov ernor-carney-declares-covid-19-hot-spot-in-sussex-county-announces-expansion-of-community-testing-sites/ ", "2020-04-28T19:08:13.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Karyl Rattay, Director of the Division of Public Health, and AJ Schall, Director of the Delaware Emergency Management Agency. View the livestream here: 4/28/20: COVID-19 Briefing On Livestream livestream.com", "2020-04-28T16:41:32.000Z": "Today around 2:15, the @blueangels and @AFThunderbirds will fly over northern Delaware in recognition of frontline workers. Thank you to all of Delaware's health care workers, first responders, and everyone on the front lines fighting COVID-19. Quote Tweet Blue Angels @BlueAngels (1 of 2) #AmericaStrong ANNOUNCEMENT: We're heading your way New York City, Newark, Trenton and Philadelphia on Tuesday! Check out the overhead times and route on the graphic below. #InThisTogether  #HealthCareHeroes  @NYGovCuomo  @NYCGov @NYCHealthCareSystem @NJGov  @phillymayor", "2020-04-28T13:50:02.000Z": "DELAWARE SPOTLIGHT: ILC Dover in Frederica has been working tirelessly to produce  and deliver critical protective equipment to health care workers. Thank you to the employees of ILC Dover and all the Delawareans who are supporting our health care workers on the front lines.", "2020-04-28T13:04:52.000Z": "Face coverings are now required in public places in Delaware. Learn how to make a face covering from a t-shirt (no-sewing required). How to Make Your Own Face Covering Surgeon General, Dr. Jerome Adams, shares ways to create your own face covering in a few easy steps. Comments on this video are allowed in accordance with ou... youtube.com", "2020-04-28T12:19:52.000Z": "Nou toujou gen yon sitiyasyon trè grav nan Delaware, ak espesyalman nan Konte Sussex la. Nou bezwen pou tout moun fè pati yo nan ede ralanti viris sa a gaye. Apati jodi a 8 a.m., nou pral mande pou kouvri figi an piblik.", "2020-04-28T12:18:48.000Z": "Todavía tenemos una situación muy grave en Delaware, especialmente en el condado de Sussex. Necesitamos que todos hagan su parte para ayudar a frenar la propagación del virus. Desde hoy a las 8:00 a.m., exigiremos el uso de mascarilla (cubreboca) en espacios públicos.", "2020-04-28T12:18:47.000Z": "We still have a very serious situation in Delaware, and especially in Sussex County. We need everyone to do their part to help slow the spread of this virus. Beginning today at 8 a.m., we are requiring face coverings in public. Learn more: http:// coronavirus.delaware.gov/guidance-for-f ace-coverings ", "2020-04-27T01:10:56.000Z": "Apati madi 28 avril, a 8:00 a.m. Delawareans yo ap oblije  kouvri figi yo nan plas piblik, ki gen ladan boutik, magazen, famasi, biwo medikal ak transpò piblik yo. https:// news.delaware.gov/2020/04/26/del awareans-yo-ap-oblije-kouvri-figi-yo-nan-plas-piblik/ ", "2020-04-27T01:08:11.000Z": "A partir de las 8:00 a.m. del martes, 28 de abril, los residentes de Delaware deberán usar mascarilla en lugares públicos, incluidos mercados, tiendas, farmacias, consultorios médicos y medios de transporte público.\n \nLeer declaración completa: https:// news.delaware.gov/2020/04/26/los -residentes-de-delaware-deberan-usar-mascarilla/ ", "2020-04-25T21:37:33.000Z": "Now is not the time for Delawareans to get complacent. We face a very serious situation, with additional cases of COVID-19 and hospitalizations statewide. \n\nThat's why starting 8am on Tues, 4/28, Delawareans are required to wear face coverings in public. https:// news.delaware.gov/2020/04/25/gov ernor-carney-requires-delawareans-to-wear-face-coverings-in-public-settings/ ", "2020-04-24T19:53:51.000Z": "Nothing replaces in-person instruction, and the services that are delivered in our schools every day, but the health and safety of Delawareans is our first priority.", "2020-04-24T19:53:50.000Z": "We made the difficult decision today - in consultation with superintendents across our state - to close schools through the rest of the academic year. I know this will be difficult for a lot of Delawareans, and Delaware students. Carney announces Delaware schools will close for the year All Delaware schools will be closed for the remainder of the 2019-2020 school year, the governor announced Friday. delawareonline.com", "2020-04-24T17:54:29.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Kara Odom Walker, Secretary of @Delaware_DHSS , and AJ Schall, Director of @DelawareEMA . View the livestream here: 4/24/20: COVID-19 Briefing Governor Carney, Dr. Kara Odom Walker (Secretary, Delaware Department of Health and Social Services), AJ Schall (Director, Delaware Emergency Management Agency) For the latest updates: de.gov/coron... livestream.com", "2020-04-23T12:54:00.000Z": "Ramadan Kareem from Delaware. Celebrate the festival of lights online. Learn more about how you can set up your own online meeting for free at https:// troopmessenger.com/blogs/video-co nferencing ", "2020-04-23T23:09:15.000Z": "We owe a real debt of gratitude to our front line health care workers and emergency responders. They have been risking their own health and safety to protect Delawareans and save lives.\n\nThank you.", "2020-04-23T23:09:14.000Z": "Delaware's fight against COVID-19 is far from over. \n\nThis updated declaration will allow even more health care workers to assist in DE's response. https:// news.delaware.gov/2020/04/23/gov ernor-carney-removes-restrictions-on-out-of-state-health-care-workers-to-assist-in-covid-19-response/ ", "2020-04-23T21:03:44.000Z": "DELAWAREAN SPOTLIGHT: Danielle Smith, a teacher in @cape_sd , fed over 100 families in the Dover area and created the group Feeding Our Kids Delaware. Thank you, Danielle, and all of the Delawareans who are working to deliver meals to those who need it. http:// doverpost.com/news/20200421/ magnolia-teacher-feeds-over-100-families ", "2020-04-23T19:48:02.000Z": "Our @LtGovernorDE Bethany Hall-Long also will host virtual town halls with members of the public to collect feedback that will inform Delaware's recovery effort. We'll post links to those virtual town halls on social media.", "2020-04-23T19:48:01.000Z": "We're still seeing increased infections of COVID-19, so this fight is far from over.\n\nAt the same time, we need to look forward. We need to plan for safely reopening our economy under a new normal.", "2020-04-22T21:30:51.000Z": "Delaware Gov. John Carney explains why he isn't reopening the state: \"The worst thing I think is to start to turn the lights back on and then have to turn them off because we have a rebound or a resurgence of the virus.\"", "2020-04-22T21:03:20.000Z": "I'll be joining @wolfblitzer on @CNNSitRoom soon.", "2020-04-22T20:43:59.000Z": "Today we celebrate the 50th Anniversary of Earth Day. We can all do our part to make Delaware and our planet a healthier, cleaner place to live.\n\nRead these ways to celebrate Earth Day while staying safe and practicing social distancing: http:// destateparks.blog/2020/04/16/5-w ays-to-celebrate-earth-day-2020/   #EarthDayDE Quote Tweet Delaware State Parks @DEStateParks Happy Earth Day from Delaware State Parks! #destateparks  #EarthDay2020", "2020-04-22T17:59:35.000Z": "We've seen a significant surge in COVID-19 cases in communities across Sussex County. \n\nThis new testing program is designed to save lives. \n\nMore info: https:// news.delaware.gov/2020/04/22/gov ernor-carney-partners-with-health-providers-and-sussex-employers-on-community-testing-sites-outreach-education/ ", "2020-04-22T14:02:44.000Z": "Thank you to all the volunteers and partners who are helping distribute food today at the @FoodBankofDE 's Drive-Thru Mobile Pantry at Dover Downs International Speedway.", "2020-04-21T22:00:35.000Z": "Thank you Secretary Cerron Cade from @DelawareLabor and Director Mike Jackson from @de_omb for joining me in today's live COVID-19 briefing. Rewatch the briefing here: 4/21/20: COVID-19 Briefing Governor Carney, Delaware Department of Labor Secretary Cerron Cade, and Office of Management and Budget Director Mike Jackson For the latest updates: de.gov/coronavirus Text \"add\" to 302-460-2501... livestream.com", "2020-04-21T21:20:51.000Z": "DELAWAREAN SPOTLIGHT: Justin Xu, a junior at The Charter School of Wilmington, is coordinating the 3-D printing club's efforts to print protective face shields. Thank you, Justin, and all the Delawareans who are stepping up to support health care workers on the front lines.", "2020-04-21T17:52:56.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Delaware Department of Labor Secretary Cerron Cade, and Office of Management and Budget Director Mike Jackson View the livestream here: 4/21/20: COVID-19 Briefing Governor Carney, Delaware Department of Labor Secretary Cerron Cade, and Office of Management and Budget Director Mike Jackson For the latest updates: de.gov/coronavirus Text \"add\" to 302-460-2501... livestream.com", "2020-04-21T01:26:39.000Z": "Thank you to the @FoodBankofDE , @DelawareNG , @DelDOT , @DHSS , volunteers and all partners for helping their neighbors during this health emergency. Quote Tweet Delaware National Guard @DelawareNG Today @DelawareNG members assisted the @FoodBankofDE at a drive-thru mobile pantry in Newark, Delaware. About 25 service members helped distribute much-needed pantry items to address the increased demand for food assistance amid the coronavirus pandemic.", "2020-04-20T17:35:04.000Z": "Thank you @AstraZenecaUS for donating surgical masks to the State of Delaware. These masks will be used to help keep our frontline workers safe. @Delaware_DHSS  @delaware_gov  @DelawareEMA", "2020-04-20T15:50:00.000Z": "DELAWAREAN SPOTLIGHT: During this difficult time, educators throughout our state have stepped up to the challenge of remote learning. This video from Ms. Ashlyn Clark with Seaford School Dist. shows the creative ways that educators are engaging their students from a distance.", "2020-04-20T13:33:34.000Z": "𝐃𝐞𝐥𝐚𝐰𝐚𝐫𝐞𝐚𝐧𝐬 𝐦𝐮𝐬𝐭 𝐛𝐫𝐢𝐧𝐠 𝐈𝐃 𝐚𝐧𝐝 𝐩𝐫𝐨𝐨𝐟 𝐨𝐟 𝐫𝐞𝐬𝐢𝐝𝐞𝐧𝐜𝐲. Please stay in your vehicles and have your trunk cleared out ahead of time. \n\nThank you @FoodBankofDE and other organizations for coming together to help one another when it is needed most.", "2020-04-20T13:33:33.000Z": "Starting today, @FoodBankofDE will host a Drive-Thru Mobile Pantry in each county:\n\n𝟒/𝟐𝟎 in New Castle County\nPre-register: http:// newcastlecountyfood.eventbrite.com 𝟒/𝟐𝟐 in Kent County\nPre-register: http:// kentcountyfood.eventbrite.com 𝟒/𝟐𝟒 in Sussex County\nPre-register: http:// sussexcountyfood.eventbrite.com", "2020-04-19T18:39:34.000Z": "We need healthy communities before we can have a healthy economy again. At the same time, it is important for Governors to look forward. We will work with surrounding states to share intelligence and make decisions deliberately, based on science and the situation on the ground. Quote Tweet City of Atlanta, GA @CityofAtlanta Mayor @KeishaBottoms joined @JohnCarneyDE on @MSNBC with @AliVelshi to discuss how local leaders are managing the #COVID19 pandemic. #ATLStrong", "2020-04-18T17:25:25.000Z": "Now is not the time for a vacation or tax-free shopping in our state. Our economy in Delaware relies on a strong tourism economy, and tourism here is driven by our great beach towns-but we can't have a healthy economy until our communities are healthy. Summer tourists want to know: Will East Coast beaches open? Maybe, but with some changes. From North Carolina to Maine, beach towns fear economic ruin if states are too slow to reopen or tourists stay home. washingtonpost.com", "2020-04-18T16:23:00.000Z": "Thank you, Pfc. Jason Mackey, and all the members of the @DelawareNG who have been working tirelessly to make sure health care workers on the front lines receive protective equipment to fight COVID-19.\n\nWe are all in this together. Quote Tweet Delaware National Guard @DelawareNG Pfc. Jason Mackey is part of a @DelawareNG team assisting @Delaware_DHSS at the state's strategic stockpile warehouse. These #CitizenSoldiers are working hard to distribute much-needed PPE to health care and frontline workers to combat the coronavirus. #InThisTogether  #netDE", "2020-04-17T19:09:57.000Z": "The @FoodBankofDE is having a Drive-Thru Mobile Pantry on Monday, April 20 at the Christiana Mall in Newark beginning at 11 a.m. Delawareans must bring ID and proof of residency. You can register in advance at: http:// newcastlecountyfood.eventbrite.com  Learn More: http:// fbd.org", "2020-04-17T17:48:16.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Karyl Rattay, Director of the Division of Public Health, and AJ Schall, Director of the Delaware Emergency Management Agency. View the livestream here: 4/17/20: COVID-19 Briefing Governor Carney, Dr. Karyl Rattay (Director, Division of Public Health), AJ Schall (Director, Delaware Emergency Management Agency), give a COVID-19 briefing. For the latest updates: de.gov/coronav... livestream.com", "2020-04-17T14:17:40.000Z": "DELAWAREAN SPOTLIGHT: Engineering Teacher Brian Clifton from @AppoSchools is producing ear guards using a 3-D printer, like the ones in his classroom, to help health care workers on long shifts. Thank you, Brian and Project Lead the Way for supporting those on the front lines.", "2020-04-16T23:29:49.000Z": "Delaware native and @WNBA MVP @De11eDonne has a message for her fellow Delawareans.\n\nWe are all in this together. Do your part. Stay home. Protect your neighbors. #StayHomeDE", "2020-04-16T21:12:16.000Z": "On @CNNSitRoom with @wolfblitzer . \n\nWatch live: https:// go.cnn.com/?stream=cnn", "2020-04-16T16:45:11.000Z": "This is what Delaware is all about.  Delawareans are stepping up for their neighbors to get through this crisis. Sign up to help here: http:// coronavirus.delaware.gov/community-call -to-action-portal/  Answering the call: More than 100 healthcare volunteers sign up - Delaware State News DOVER - Given the option to take a volunteer spot on the front line against the COVID-19 epidemic, most people would probably just assume take a pass - much too dangerous, little reward and a... delawarestatenews.net", "2020-04-16T01:04:12.000Z": "We are in this together. \n\nYour actions affect your neighbors. \n\nTheir actions affect you. #StayHomeDE to protect your family, friends and neighbors - especially those who are immunocompromised.", "2020-04-15T22:06:00.000Z": "We will be working with other Governors in our region to sort out the best way to bring our economies back online, and to do it in a way that's safe. We have to have a healthy community before we can have a healthy economy again. Coronavirus Delaware: Gov. John Carney Warns Residents It's Not Time To Relax Restrictions In State... Delaware has partnered with several nearby states for a multi-state coalition about reopening businesses. philadelphia.cbslocal.com", "2020-04-15T19:04:42.000Z": "Keep doing what you're doing, Delaware. Stay home to protect your family, friends and neighbors - especially those who are immunocompromised.\n \nWe'll get through this together.\n\nStay informed: http:// de.gov/coronavirus", "2020-04-15T17:24:53.000Z": "Thank you to the health care workers who are helping Delawareans fight COVID-19. \n\nAnd we can't say it enough: this is still a serious situation, and it's important that we keep our distance to protect our neighbors.", "2020-04-15T17:23:45.000Z": "This is a heartwarming recovery story. Congratulations, Miss Veronica, a longtime Irish dance instructor. Great to see the community welcome her home- from a distance. Heartwarming homecoming for Delaware dance teacher who beat coronavirus Veronica McAleer, 76, was supposed to be the Grand Marshall for the Wilmington Saint Patrick's Day Parade. But not only was the parade canceled, she also tested positive for the coronavirus.", "2020-04-15T16:22:15.000Z": "The decisions to open the economy back up are going to be even more difficult than the decisions to close it down. \n\nWe have to have a healthy community before we can have a healthy economy again. From ABC News Live", "2020-04-15T15:25:56.000Z": "DELAWAREAN SPOTLIGHT: Over the past few weeks, Pamela D'Occhio has helped communicate key information to the deaf and hard-of-hearing community. Thank you, Pamela, for helping inform Delawareans as we face this difficult and ever-evolving situation. Sign of the times: Delaware woman helps convey key information to hard of hearing - Delaware State... DOVER - Imagine the governor is going to make a very important announcement about breaking news. You have tuned in and are watching closely, but when the governor starts speaking, you haven't a clue... delawarestatenews.net", "2020-04-15T13:53:17.000Z": "Our elderly populations, and especially Delawareans in long-term care facilities, are at very high risk for COVID-19 infection and hospitalization. \n\nThese stricter measures that we're issuing today are intended to save lives.  https:// news.delaware.gov/2020/04/15/gov ernor-carney-requires-stricter-measures-in-long-term-care-facilities-to-fight-covid-19/ ", "2020-04-14T23:36:06.000Z": "\"I think the decisions to open the economy back up are going to be even more difficult than the decisions to close it down,\" Delaware Gov. @JohnCarneyDE says. https:// abcn.ws/3cjI4Kc \"We have to have a healthy community before we can have a healthy economy again.\"", "2020-04-14T23:14:00.000Z": "On @ABCNewsLive with @LinseyDavis Watch: ABC News Politics @ABCPolitics On @ABCNewsLive, we have the latest on the novel coronavirus pandemic after over 1.9 million people worldwide have been diagnosed. Plus, we speak with Gov. Carney about East Coast governors' respon... pscp.tv", "2020-04-14T23:00:08.000Z": "On @ABCNewsLive , we have the latest on the novel coronavirus pandemic after over 1.9 million people worldwide have been diagnosed. Plus, we speak with Gov. Carney about East Coast governors' response. WATCH LIVE: ABC News Politics @ABCPolitics On @ABCNewsLive, we have the latest on the novel coronavirus pandemic after over 1.9 million people worldwide have been diagnosed. Plus, we speak with Gov. Carney about East Coast governors' respon... pscp.tv", "2020-04-14T20:49:20.000Z": "Listen to audio from @JohnCarneyDE 's #COVID19 Briefing on WTMC Radio this evening or tomorrow morning #NetDE  @Delaware_DHSS  @DelawareEMA", "2020-04-14T20:10:14.000Z": "The @USTreasury and #IRS launched a new online tool to help those who normally don't file taxes to register for Economic Impact Payments. View the online tool at: http:// irs.gov/eip  #COVIDreliefIRS Economic Impact Payments | Internal Revenue Service Mailed Check Payments May Be Sent As Debit Cards If Get My Payment says your Economic Impact Payment will be issued as a check, you may instead get a debit card in a plain envelope from \"Money... irs.gov", "2020-04-14T17:59:13.000Z": "WATCH NOW: I am giving a COVID-19 briefing with Dr. Karyl Rattay, Director of the Division of Public Health, and AJ Schall, Director of the Delaware Emergency Management Agency. View the livestream here: 4/14/20: COVID-19 Briefing Governor Carney, Dr. Karyl Rattay (Director, Division of Public Health), AJ Schall (Director, Delaware Emergency Management Agency), give a COVID-19 briefing. For the latest updates: de.gov/coronav... livestream.com", "2020-04-14T15:17:38.000Z": "DELAWAREAN SPOTLIGHT: Tilesha, Tameka, and Jacque have delivered over 20,000 pounds of food to families, schools, and senior living facilities. Thank you to all Delawareans who have gone above and beyond in this difficult time to help those in need. From giving food to free car repairs: Reader-nominated local heroes during coronavirus A new organization sprung up by two sisters and their friends to help feed the many who are now unable to get food due to the coronavirus pandemic. delawareonline.com", "2020-04-13T19:20:28.000Z": "Show your favorite local DE restaurant some love. Join the national #takeouttuesday movement by ordering a meal tomorrow for takeout or delivery. #delbiz  #smallbiz  #coronavirus  #COVID19", "2020-04-13T19:06:00.000Z": "Join us today at 6:00 pm for a live chat with @JohnCarneyDE Live chat with Gov. John Carney about coronavirus in Delaware Gov. John Carney will be taking questions from Delaware Online staff and readers Monday. facebook.com", "2020-04-13T18:16:16.000Z": "This is new terrain for all of us.\n\nAs we make life-saving decisions there is strength in unity.\n\nThank you for coordinating with us @GovMurphy , @GovNedLamont , @GovernorTomWolf , @JohnCarneyDE and @GovRaimondo .", "2020-04-13T20:06:48.000Z": "To be clear: We still have a situation in DE that is getting worse.\n\nInfections of COVID-19 and hospitalizations are rising. \n\nStay home. Don't go out in public unnecessarily. Don't visit DE unless you need to see a doctor or care for family. You'll only increase everyone's risk.", "2020-04-13T18:18:28.000Z": "On a conference call with @NYGovCuomo  @GovMurphy  @GovNedLamont  @GovernorTomWolf  @GovRaimondo Listen live: ABC News @ABC HAPPENING NOW: Governors of Northeast states make announcement amid COVID-19 battle. pscp.tv", "2020-04-13T14:39:12.000Z": "Secure loose items, stay indoors, and charge electronic devices to prepare for likely power outages! #netde  #emgtwitter  #DEwx Quote Tweet NWS Mount Holly @NWS_MountHolly Dangerous wind gusts up to 70 mph are occurring across Delaware and Maryland. These will continue to work northward this morning. Prepare for power outages!  #PAwx  #NJwx  #MDwx  #DEwx", "2020-04-12T23:26:33.000Z": "Thank you to Delaware's first responders, child care workers, our grocery store employees, teachers, state workers, community organizations, reporters, and all Delawareans who are stepping up for their neighbors during this difficult time.", "2020-04-12T23:26:32.000Z": "Thank you to all of Delaware's health care workers who have been on the front lines, risking their own health and safety to protect others.", "2020-04-12T17:16:03.000Z": "Wishing a happy Easter to all Delawareans celebrating today. Thank you for staying home and for gathering only with your immediate family. \n\nStay safe, stay home, and have a #HappyEaster . Quote Tweet Governor John Carney @JohnCarneyDE Easter is an important holiday for Delaware families across our state. \n\nThis year will be different for all of us who celebrate Easter. We ask that you gather only with those who are in your immediate family. \n\nIf we all work together in the days ahead, we will get through this.", "2020-04-11T23:16:18.000Z": "A face covering isn't a substitute for handwashing + social distancing.\n\nPurpose: protect OTHERS in public settings where social distancing is difficult-like grocery stores. #StayHomeDE but if you have to go out, wear a face covering #GoBirds More info: https:// coronavirus.delaware.gov/guidance-for-f ace-coverings/ ", "2020-04-11T15:30:42.000Z": "We need all Delaware citizens, businesses, and nonprofits to support Delaware's response to COVID-19. \n\nIf you have experience in health care or child care especially, please sign up: http:// de.gov/coronavirus More info on our community call-to-action: https:// news.delaware.gov/2020/04/11/gov ernor-carney-urges-delawareans-with-health-care-child-care-experience-to-assist-in-covid-19-response/ ", "2020-04-10T22:32:21.000Z": "It is important that Delawareans receive reliable and up-to-date information about COVID-19. We are partnering with @Nextdoor , a social networking platform that will reach Delawareans at a neighborhood level. More about today's announcements: http:// news.delaware.gov/2020/04/10/gov ernor-carney-formally-extends-state-of-emergency-partners-with-nextdoor-on-neighborhood-outreach/ ", "2020-04-10T16:11:39.000Z": "Easter is an important holiday for Delaware families across our state. \n\nThis year will be different for all of us who celebrate Easter. We ask that you gather only with those who are in your immediate family. \n\nIf we all work together in the days ahead, we will get through this.", "2020-04-10T02:54:22.000Z": "Stay safe.\nStay home.\nStay informed. Text \"add\" to 302-460-2501 for text updates from the State of Delaware. Sign up for email updates: https:// coronavirus.delaware.gov/subscribe/", "2020-04-09T17:11:17.000Z": "Grateful for our partnership with @dogfishbeer to produce hand sanitizer and support those on the front lines. \n\n100% of the profits will go into the Restaurant Industry E.A.T. (Emergency Action Trust), which supports DE restaurant workers. Opinion | Craft-Brewed Hand Sanitizer There's a dire need for masks and gowns and other supplies. Some unexpected businesses are stepping up to help. nytimes.com", "2020-04-08T21:41:07.000Z": "Consistent with guidance from the CDC, @Delaware_DHSS Division of Public Health recommends that Delawareans should wear cloth face coverings in public settings where social distancing measures are difficult to maintain -- like grocery stores and pharmacies.", "2020-04-08T18:22:29.000Z": "Before the start of Passover, I want to wish the Jewish community of Delaware a Chag Sameach. \n\nThough we are experiencing difficult times fighting COVID-19, Passover reminds us that if we work together, we will get through this. Governor Carney - Passover Message Governor Carney shares a message ahead of Passover. youtube.com", "2020-04-07T17:49:41.000Z": "@JohnCarneyDE says \"the next two weeks are really critical to our state\" in terms of positive cases, hospitalizations and managing capacity at the state's hospitals. #StayHomeDE  #StayHome  #coronavirusDE", "2020-04-06T23:17:23.000Z": "Delawareans also should not go out in public unnecessarily.\n\nStay safe. Stay home. Protect your neighbors.\n\nWe'll get through this - but it's going to take all of us. #StayHomeDE", "2020-04-06T23:17:22.000Z": "All of DE's restrictions are intended to prevent a surge in cases, preserve our hospital capacity, and save lives.\n\nStarting April 7 at 8pm, we are banning all short-term rental units - including vacation home rentals, hotels, motels and condo rentals. https:// news.delaware.gov/2020/04/06/gov ernor-carney-issues-updated-state-of-emergency-bans-short-term-rentals/ ", "2020-04-06T22:05:33.000Z": "Thank you @DelawareNG and @AppoSchools for your efforts to deliver meals to children that need it most. Quote Tweet Delaware National Guard @DelawareNG The Delaware National Guard assisted @AppoSchools by delivering nearly 300 school lunches to school-aged children, who are unable to attend school, to receive the meals in the area's neediest neighborhoods. This program provides a critical lifeline for food-insecure families.", "2020-04-06T13:42:22.000Z": "WATCH LIVE: Gov. @JohnCarneyDE is addressing Delaware's response to the coronavirus outbreak after getting a federal disaster declaration over the weekend. http:// on.nbc10.com/zoqjbjh", "2020-04-06T12:33:48.000Z": "Joining us now: @JohnCarneyDE", "2020-04-06T11:21:22.000Z": "Today I'll be on @Morning_Joe to talk about Delaware's response to COVID-19. Tune in to @MSNBC around 8:25am.", "2020-04-06T00:07:55.000Z": "Thank you @WSmallwood28 for helping us share the #StayHomeDE message.", "2020-04-05T23:58:42.000Z": "It's definitely not football season, but Delaware native and the NFL's Wendell Smallwood (former @Eagles running back - #GoBirds ) has a message for his fellow Delawareans this Sunday.\n\nDo your part: Stay home. Protect your neighbors. #StayHomeDE  @Delaware_DHSS  @delaware_gov", "2020-04-05T19:54:26.000Z": "Our goal is to prevent a surge in COVID-19 cases that would overwhelm our hospital capacity. Do your part to slow the spread.  \n\nStay home. Stay safe. #StayHomeDE  @Delaware_DHSS GIF", "2020-04-05T16:49:38.000Z": "All of Delaware's restrictions are intended to prevent a surge in COVID-19 infections, protect our hospital capacity, and save lives. #StayHomeDE Troopers in Delaware can stop drivers with out-of-state tags during coronavirus pandemic Troopers in Delaware now have the authority to pull over out-of-state drivers during the coronavirus pandemic.", "2020-04-04T22:07:59.000Z": "How can you help this weekend?  Stay home. \n\nIf you are a business or nonprofit that has supplies to offer in support of Delaware's response:\n\n1. Visit http:// de.gov/coronavirus", "2020-04-04T22:00:52.000Z": "We all need to work together and support Delaware's response to COVID-19. Our health care workers deserve our respect, our gratitude, and our support. These test kits will help us more effectively test our first responders so we can safely keep them on the front lines. Quote Tweet DHSS @Delaware_DHSS Delaware Division of Public Health received its delayed shipment of 5,000 rapid test kits. After validation byDPH Lab, the kits will be used to test health care workers, first responders & in possible long-term care #coronavirusDE outbreaks. http:// de.gov/coronavirus  @JohnCarneyDE", "2020-04-04T18:07:09.000Z": "Delaware native @JohnGallagherJr has a message for his fellow Delawareans: \"The superpower that we all have is to stay home.\"\n\nStay home. Protect your neighbors. #StayHomeDE  http:// de.gov/coronavirus", "2020-04-03T17:06:58.000Z": "I'm holding a press briefing to answer questions from members of the press about Delaware's response to coronavirus disease. \n\nWatch the briefing here: https:// livestream.com/stateofdelawar e/events/9069676  or at http:// de.gov/coronavirus . Coronavirus - Delaware's Coronavirus Official Website Find the lab-confirmed cases by county, learn what you can do, find resources for businesses, schools, health care, and more. coronavirus.delaware.gov", "2020-04-02T17:26:28.000Z": "We launched an online tool at http:// de.gov/coronavirus to connect Delawareans offering materials and supplies with organizations, medical providers and others in need of assistance. Fill out the form at http:// de.gov/coronavirus .", "2020-04-02T02:06:13.000Z": "It's important that Delawareans get reliable information about COVID-19. Text \"add\" to 302-460-2501 for text updates from the State of Delaware. Sign up for email updates from my office: http:// de.gov/coronavirus", "2020-04-01T22:08:08.000Z": "We will be further limiting public gatherings and ordering essential businesses to take specific steps to enforce social distancing. \n\nWe will take action to enforce these restrictions if Delawareans, visitors, and businesses don't comply voluntarily.  https:// news.delaware.gov/2020/04/01/gov ernor-carney-restricts-gatherings-requires-businesses-to-strictly-comply-with-social-distancing/ ", "2020-04-01T17:41:55.000Z": "Today is Census Day. It's important that all Delawareans are counted in the 2020 Census to ensure that all available resources are reaching residents in our state who need them most. \n\nGo online to http:// my2020census.gov or call 1-844-330-2020 to complete your Census form today.", "2020-04-01T00:14:46.000Z": "This is a serious situation. Violating an emergency order is a criminal offense. We need everyone to do their part. \n\nStay home. \n\nProtect your neighbors.\n\nStay informed: Coronavirus - Delaware's Coronavirus Official Website Find the lab-confirmed cases by county, learn what you can do, find resources for businesses, schools, health care, and more. coronavirus.delaware.gov", "2020-04-01T00:13:44.000Z": "Delaware's stay-at-home order means stay home unless it's essential to go out for work, or for the health and well-being of your family. \n\nDon't go to businesses that remain open just to \"get out\" -- you are putting folks at risk. #StayHomeDE", "2020-03-30T22:33:10.000Z": "This order will make sure Delaware's health care workers and other first responders can stay at work, and keep our communities healthy, by providing them access to emergency child care services.", "2020-03-30T22:33:09.000Z": "Starting April 6 and continuing until the State of Emergency is lifted, child care may only be provided by child care centers and child care homes that have been designated as \"Emergency Child Care Sites\" by @DelKids .  \n\nMore info on our latest order: https:// news.delaware.gov/2020/03/30/gov ernor-carney-signs-order-to-designate-emergency-child-care-sites-for-essential-personnel/ ", "2020-03-30T17:11:34.000Z": "This is a very serious situation. Stay home. Only leave for essential work or for the well-being of your family. \n\nStay informed: http:// de.gov/coronavirus  #StayHomeDE Carney: Delaware could see 3,000 coronavirus cases, 500 hospitalizations in coming weeks In an interview with Delaware Online/The News Journal, Gov. John Carney said he anticipates Delaware will have a spike in cases and hospitalizations. delawareonline.com", "2020-03-30T11:49:48.000Z": "Gov. @JohnCarneyDE LIVE on @WDEL at 8:45a to talk about the latest in the #COVID19 crisis. | LISTEN: http:// player.listenlive.co/44291  #netDE WDEL 1150AM & 101.7FM Delaware's Newsradio 1150AM and 101.7FM, Wilmington, DE player.listenlive.co", "2020-03-30T01:54:47.000Z": "Please share this message from Tracey with your family and friends! Our school districts and community partners are delivering meals for DE children to communities throughout the state.\n\nFamilies can check the current list of meal sites here: http:// de.gov/covid19edu  @DEDeptofEd", "2020-03-29T21:25:34.000Z": "Starting March 30 at 8 a.m., all out-of-state travelers into Delaware must immediately self-quarantine for 14 days to fight the spread of COVID-19.  \n\nMore info: https:// news.delaware.gov/2020/03/29/gov ernor-carney-orders-out-of-state-travelers-to-immediately-self-quarantine-for-14-days/ ", "2020-03-29T16:02:54.000Z": "Thank you @SenatorCarper , Sen. @ChrisCoons and @RepLBR for the hard work you put into this federal aid package.\n\nWorkers, families and small businesses are facing extremely challenging times. We hope this will get real support to DE families who need it. Q&A: How could the historic $2 trillion coronavirus economic recovery package benefit you? The stimulus package will provide checks to many Americans while also offering financial support in other ways. We explain some of the key provisions. usatoday.com", "2020-03-28T15:08:55.000Z": "Now's the time to stay at home. Do not go out in public unnecessarily. Our goal is to limit a surge in cases that would overwhelm our hospitals.\n\nStay informed: http:// de.gov/coronavirus DE Gov.: Getting people back to work would send 'wrong message' Delaware Governor John Carney (D) joins Ayman Mohyeldin to discuss his state's response to the COVID-19 crisis. The governor pushes back on the White House plan to open the country back up one county... msnbc.com", "2020-03-28T12:40:39.000Z": "Listen to the audio of @JohnCarneyDE 's Q&A with @Delaware_DHSS Secretary Dr. Kara Odom Walker from yesterday, at 10 a.m. this morning and 1 p.m. this afternoon on WTMC Radio. You can also download the free DelDOT app to hear it there. #NetDE", "2020-03-27T19:13:17.000Z": "We continue to hear instances of people gathering together in groups. 𝗧𝗵𝗶𝘀 𝗻𝗲𝗲𝗱𝘀 𝘁𝗼 𝘀𝘁𝗼𝗽. \n\nWe all need to do our part, and to take this public health threat seriously.\n\nStay home.\nSocial distance.\nWash your hands. http:// de.gov/coronavirus GIF", "2020-03-27T15:04:54.000Z": "Watch our Virtual Q&A here: Virtual Q&A with Governor Carney Governor Carney and Dr. Kara Odom Walker, Secretary of the DE Department of Health and Social Services, host a virtual Q&A session to answer questions about the coronavirus and DE's response. For the... livestream.com", "2020-03-27T14:12:29.000Z": "I'll be on @MSNBC around 10:15 am to talk about Delaware's response to COVID-19.", "2020-03-27T12:56:32.000Z": "Today at 11 am, I'm hosting a virtual Q&A with @Delaware_DHSS Secretary @DrKaraWalker about COVID-19 and DE's response. Reply with your questions and watch here: http:// de.gov/coronavirus", "2020-03-27T01:09:53.000Z": "We're doing everything we can do to slow the spread. We're asking all of you to do your part by taking this threat seriously and following the guidance we've issued to stay at home. \n\nWe must protect those who are most vulnerable to the threat of COVID-19.", "2020-03-27T01:09:52.000Z": "It is with a heavy heart that we've announced a 2nd Delawarean has passed away due to COVID-19. My prayers are with his family & friends-and with residents & staff of Little Sisters of the Poor Jeanne Jugan Residence. @Delaware_DHSS is working to ensure resident & staff safety. Quote Tweet DHSS @Delaware_DHSS Delaware Announces First Long-Term Care Facility Coronavirus-Related Death; Additional Cases Also Confirmed in Newark Nursing Home #coronavirus  https:// de.gov/1SAj", "2020-03-26T17:30:04.000Z": "Delaware, We are in this together! #chalkthewalkdelaware  #chalkthewalk  #delaware  #bringjoy  #positivemessages  #netde  #share  #spreadlove  #savingdelawarehistory", "2020-03-26T17:08:10.000Z": "This is a sad day, and this is a scary time. Please, please, take this threat seriously- and do your part to stem the spread of COVID-19.", "2020-03-26T17:08:09.000Z": "The @Delaware_DHSS Division of Public Health just reported the sad news that a 66-year-old Delawarean from Sussex County has died from COVID-19. He had underlying health conditions and was critically ill.\n \nToday, our thoughts are with his family and friends. Quote Tweet DHSS @Delaware_DHSS Delaware announces first death of a resident from #coronavirus  #COVID19  https:// de.gov/1Sz", "2020-03-25T14:34:06.000Z": "We must be prepared to ensure our health care workers are protected and safe on the front lines. Thank you to the health care workers and child care providers for all that you're doing. From NGA", "2020-03-25T13:09:03.000Z": "This is important: In yesterday's modified state of emergency, @JohnCarneyDE requires that insurers not cancel or fail to renew the insurance policies of those people/businesses facing economic impacts from #COVID19 More info (English & Spanish) @HOYenDE : Commissioner Navarro statement on sixth modification to state of emergency (Version en español al final). DOVER, DE (March 24, 2020) - In consultation with the Delaware Department of Insurance, Governor John Carney today issued a sixth modification to the state of emergency... hoyendelaware.com", "2020-03-25T12:52:15.000Z": "Joining us now: @JohnCarneyDE", "2020-03-25T12:22:37.000Z": "Today I'll be on @Morning_Joe to talk about Delaware's response to COVID-19. Tune in to @MSNBC around 8:45am.", "2020-03-24T21:15:28.000Z": "We need Delawareans to stay home when it's not essential to go out. And when you must to go out, practice social distancing by keeping 6ft of space between you and others. \n\nStay safe. Stay at home. Protect your neighbors. From CNN Newsroom", "2020-03-24T20:53:56.000Z": "The additional protections in this updated order are essential to help support Delawareans- especially our most vulnerable neighbors-as this situation evolves.", "2020-03-24T20:53:55.000Z": "We moved Delaware's presidential primary to June 2, 2020. \n\nDelawareans have a basic, fundamental right to vote. \nToday's order will preserve that right. Read more: https:// news.delaware.gov/2020/03/24/gov ernor-carney-moves-presidential-primary-date-to-june-2/ ", "2020-03-24T16:01:48.000Z": "Tune in to @CNN . I'll be talking with @JohnKingCNN about what we're doing to combat the spread of COVID-19.", "2020-03-24T14:54:14.000Z": "To all of Delaware's health care workers who are on the front lines of our response: thank you. \n\nWe owe you all a debt of gratitude.", "2020-03-24T14:46:48.000Z": "Delawareans should follow basic hygiene practices and stay home unless it's essential to go out for work, or for the health and well-being of your family. \n\nWe'll get through this, but we all need to pitch in and take this threat seriously.", "2020-03-24T14:46:47.000Z": "ICYMI I declared a Public Health Emergency. @DelawareEMA & @Delaware_DHSS Public Health issued an order to strengthen DE's health care workforce. These orders will help ensure DE has the supplies & health care professionals necessary to respond to COVID19. https:// news.delaware.gov/2020/03/23/gov ernor-carney-declares-public-health-emergency-phe/ ", "2020-03-24T02:33:53.000Z": "Working together to flatten the curve. \n\nThinking of our neighbors.\n\nThat's how we get through this.", "2020-03-23T22:09:06.000Z": "On March 13, after significant discussion with superintendents and charter school leaders, I ordered public schools to close through this Friday, March 27. \n\nThis two-week period was intended to help school leaders and educators plan for what came next.", "2020-03-23T22:07:51.000Z": "I've ordered all Delaware schools to remain closed through at least Friday, May 15 to fight the spread of coronavirus. #eduDE   https:// news.delaware.gov/2020/03/23/gov ernor-carney-closes-delaware-schools-through-may-15/ ", "2020-03-23T17:00:46.000Z": "DelDOT's WTMC Radio will rebroadcast at 1:00 p.m., 4:00 p.m., and 7:00 p.m. today the audio of Governor John Carney's briefing from Sunday. WTMC Radio is available statewide at 1380 AM and at 98.5 FM for the majority of New Castle County. #NetDE", "2020-03-23T17:46:47.000Z": "Trying to figure out if your industry has been ordered to close? We've created this graphic to help you. #smallbiz  #delbiz  #coronavirus  #covid19", "2020-03-23T18:23:36.000Z": "We need folks to stay home. The more seriously we all take this now, the sooner we can get to the other side of this. Your actions affect your neighbors, and theirs affect you. We can do this. But we need your help. \n\nStay safe. Stay home. http:// de.gov/coronavirus", "2020-03-21T21:16:28.000Z": "Delaware businesses: can you make or do something to help with the coronavirus outbreak? Contact below: Quote Tweet Delaware Division of Small Business @delbiz If your business can do or make something that can help DE fight coronavirus, contact Government Support Services at https:// gss.omb.delaware.gov  #delbiz  #smallbiz  #coronavirus  #COVID19", "2020-03-23T02:49:22.000Z": "If you have any questions about whether you should be staying home or going out, stay home. Go to work, and go straight back home. If you don't need food or other essential items, stay home.\nYour actions affect your neighbors, and theirs affect you.\nThat's what this is all about.", "2020-03-22T21:04:21.000Z": "Watch our COVID-19 update: Delaware COVID-19 Update On Livestream livestream.com", "2020-03-22T21:02:51.000Z": "I've issued a stay-at-home order for Delawareans, and ordered non-essential businesses to close at 8 a.m. Tuesday, March 24.\n\nList of essential and non-essential businesses: https:// coronavirus.delaware.gov/wp-content/upl oads/sites/177/2020/03/Delaware-list-of-essential-and-nonessential-businesses-March-22-2020.pdf ", "2020-03-21T23:49:07.000Z": "More and more grocery stores in Delaware are offering separate hours for seniors and other vulnerable populations. This video offers details on the stores we had as of Friday, March 20. Check with your store if it's not listed. #coronavirusDE  #netde  http:// de.gov/coronavirus", "2020-03-21T20:12:58.000Z": "#NetDE - ALL: DelDOT Operational Changes Update for March 21 [ https:// deldot.gov/coronavirus/in dex.shtml  ]\n\n[ https:// deldot.gov/About/news/ind ex.shtml?dc=release&id=8037&type=News&fbclid=IwAR2ncC6xWwKjEoD_lNCwHIqQAZgF6LrKzV9ncr0DMA4JSUHaZ-EgL29GSkQ  ]", "2020-03-21T21:32:35.000Z": "TONIGHT @ 6pm I'll be on @CBSPhilly during the 6pm broadcast to talk about Delaware's coronavirus response.", "2020-03-21T20:32:38.000Z": "If your business can do or make something that can help DE fight coronavirus, contact Government Support Services at https:// gss.omb.delaware.gov  #delbiz  #smallbiz  #coronavirus  #COVID19", "2020-03-21T19:49:52.000Z": "We are considering all options to keep people safe and slow the spread of coronavirus. This is a serious situation, and we need everyone's help. \n\nStay informed: http:// de.gov/coronavirus Delaware Gov. Carney 'absolutely' considering stay-at-home order Delaware Gov. John Carney says he is \"absolutely\" considering a stay-at-home order after seeing a lack of social distancing in his state. He says is speaking with Gov. Tom Wolf of Pennsylvania, Gov.... msnbc.com", "2020-03-21T16:53:50.000Z": "At 5pm on 3/21, the public is prohibited from accessing the beach except to exercise or walk their dogs where dogs are permitted-- but you must practice social distancing.\n\nThis was a difficult decision, but we need folks to follow the rules to help #flattenthecurve .", "2020-03-21T16:53:49.000Z": "We saw too many people on the beaches yesterday, and we weren't seeing the kind of social distancing that we need in order to slow the spread of coronavirus. That's why I issued orders to close Delaware beaches beginning at 5:00 p.m. today, March 21.  https:// news.delaware.gov/2020/03/21/gov ernor-carney-issues-third-update-to-state-of-emergency/ ", "2020-03-21T03:04:20.000Z": "We need everyone's help to slow down the spread of coronavirus: Wash your hands. Practice social distancing. Cover your cough. Don't touch your face. Stay home.\n\nThanks to Dover High School grad @UkeeWashington for giving an update on @CBSPhilly . Coronavirus In Delaware: COVID-19 Cases In State Rise To 39 There are currently 27 coronavirus cases in New Castle County, five in Kent and seven in Sussex. philadelphia.cbslocal.com", "2020-03-21T01:02:34.000Z": "ICYMI: The story behind how @dogfishbeer 's distillery became a hand sanitizer-maker. And how the profits will go to out-of-work restaurant workers statewide. https:// delawareonline.com/story/life/202 0/03/20/dogfish-head-distillery-manufacturing-hand-sanitizer-state/2877491001/ ", "2020-03-20T20:46:33.000Z": "Gov. @JohnCarneyDE on @WDEL NOW: http:// player.listenlive.co/44291 | #netDE", "2020-03-20T20:25:43.000Z": "Thank you @dogfishbeer for stepping up in a time of such significant need to provide hand sanitizer and assist Delaware restaurant workers who've been affected so significantly by the coronavirus outbreak. #netde  #COVID19de Quote Tweet Dogfish Head Brewery @dogfishbeer While we may be known for our off-centered ales, we've been distilling spirits in Delaware since 2002 and have now partnered with the @delaware_gov to make more, much-needed hand sanitizer available to the state government. http:// dogfish.com/blog/dogfish-h ead-scratch-made-hand-sanitizer  Show this thread", "2020-03-20T15:05:09.000Z": "Proud to work with @FoodBankofDE  @MonsterMile and the Dover Police Department! #netde Quote Tweet Food Bank of DE @FoodBankofDE The amazing team at @DelawareDOT and @MonsterMile is out in full force assisting with today's distribution #COVID19US  #netde  #delaware", "2020-03-20T15:35:50.000Z": "The application is now open for the state of Delaware's HELP loan program for small hospitality businesses affected by the coronavirus outbreak.\nGet the application here: http:// ow.ly/svQO50yR8Ni  #delbiz  #smallbiz  #coronavirus  #COVID19", "2020-03-20T15:35:21.000Z": "I'm doing a live interview on Delaware's response to #COVID19 with @delawareonline reporter @MereNewman . \n\nWHERE TO WATCH\n\nFacebook: https:// facebook.com/Delawareonline /videos/1091855731180629/  Web: Watch: Gov. Carney talks about dealing with coronavirus in Delaware On Friday, Gov. John Carney speaks with reporter Meredith Newman about the coronavirus pandemic and its effects on Delaware. Watch that interview here. delawareonline.com", "2020-03-20T13:55:53.000Z": "The @Delaware_DHSS coronavirus call center has extended their hours to include evenings and weekends. For #coronavirus questions call 1-866-408-1899 or email DPHcall@delaware.gov. For more information, visit: http:// de.gov/coronavirus", "2020-03-20T03:28:32.000Z": "We need everyone to really focus on slowing the spread of #COVID19 . Wash your hands. Avoid social contact. Stay home.\n\nThis is a serious effort to protect those most vulnerable to the virus: those with health conditions & our senior citizens-our moms, dads, grandmoms, grandpops.", "2020-03-19T23:05:00.000Z": "Tune in to @MSNBC : I'm giving an update on COVID-19 in Delaware and our response.", "2020-03-19T23:02:36.000Z": "COVID-19 is taking a toll across our state, on families who are losing income & child care providers who care for our youngest Delawareans every day. We're working to help ensure Delawareans have access to child care, especially DE's health care workers. https:// news.delaware.gov/2020/03/19/gov ernor-carney-signs-executive-order-on-child-care/ ", "2020-03-19T18:19:36.000Z": "The best way to do that? Follow the hygiene info you've heard over & over again:\n\nWash your hands.\nCover your cough.\nIf you're sick, stay home.\nAvoid social interaction.\n\nIf we follow these rules & stick together as we do in DE when we have big problems, we'll get through this.", "2020-03-19T18:18:44.000Z": "We all need to work together to #flattenthecurve to reduce the spread of COVID-19 now on the front end. We need to protect the population that is most at risk - our senior citizens. Our grandparents. Our moms and dads. And those with compromised health situations.", "2020-03-19T15:03:23.000Z": "Does your company provide goods & services to help Delaware's response to COVID-19?  All vendors wanting to offer their capabilities should send an email to the state's central contracting team at: contracting@delaware.gov.  See https:// gss.omb.delaware.gov  #GSS  #OMB", "2020-03-19T14:53:06.000Z": "𝐓𝐨 𝐤𝐞𝐞𝐩 𝐞𝐯𝐞𝐫𝐲𝐨𝐧𝐞 𝐬𝐚𝐟𝐞, 𝐩𝐥𝐞𝐚𝐬𝐞 𝐬𝐭𝐚𝐲 𝐢𝐧 𝐲𝐨𝐮𝐫 𝐯𝐞𝐡𝐢𝐜𝐥𝐞𝐬 𝐚𝐧𝐝 𝐡𝐚𝐯𝐞 𝐲𝐨𝐮𝐫 𝐭𝐫𝐮𝐧𝐤 𝐜𝐥𝐞𝐚𝐫𝐞𝐝 𝐨𝐮𝐭 𝐚𝐡𝐞𝐚𝐝 𝐨𝐟 𝐭𝐢𝐦𝐞. Workers will keep a safe distance & frequently wash their hands. For updates: Coronavirus - Delaware's Coronavirus Official Website Find the lab-confirmed cases by county, learn what you can do, find resources for businesses, schools, health care, and more. coronavirus.delaware.gov", "2020-03-19T14:53:05.000Z": "ICYMI: @FoodBankofDE is hosting a Drive-Thru Mobile Pantry TODAY in Sussex and TOMORROW in Kent. 𝑵𝑶𝑻𝑬: 𝑻𝒉𝒆 𝑲𝒆𝒏𝒕 𝑪𝒐𝒖𝒏𝒕𝒚 𝒍𝒐𝒄𝒂𝒕𝒊𝒐𝒏 𝒉𝒂𝒔 𝒃𝒆𝒆𝒏 𝒄𝒉𝒂𝒏𝒈𝒆𝒅 𝒂𝒏𝒅 𝒘𝒊𝒍𝒍 𝒏𝒐𝒘 𝒕𝒂𝒌𝒆 𝒑𝒍𝒂𝒄𝒆 𝒂𝒕 𝑫𝒐𝒗𝒆𝒓 𝑰𝒏𝒕. 𝑺𝒑𝒆𝒆𝒅𝒘𝒂𝒚", "2020-03-18T21:33:54.000Z": "We've also temporarily lifted regulations to expand access to telemedicine.\n\nMore info: Governor Carney Issues Second Update to Emergency Declaration - State of Delaware News Second update provides support to restaurant industry WILMINGTON, Del. -  Governor John Carney on Wednesday issued a second modification to his emergency declaration that allows any restaurant,... news.delaware.gov", "2020-03-18T21:33:12.000Z": "Starting tomorrow (3/18) at 8:00 am, bowling alleys, concert events, movie theaters, sports facilities, fitness centers, and health spas must cease operations to prevent the spread of coronavirus in DE.", "2020-03-18T21:32:19.000Z": "At 8:00pm, any restaurant/brewpub/tavern/taproom w/ a valid on-premise license can sell alcoholic beverages as part of take-out or drive thru food transactions. We know restaurants & small biz are among those most seriously impacted by COVID19 prevention https:// news.delaware.gov/2020/03/18/gov ernor-carney-issues-second-update-to-emergency-declaration/ ", "2020-03-18T21:03:01.000Z": "We're providing an update on coronavirus in Delaware. Watch here: WPVI News Live Streaming Video Watch live streaming video on 6abc.com and stay up-to-date with the latest WPVI news broadcasts as well as live breaking news whenever it happens.", "2020-03-18T18:24:19.000Z": "Restaurants, bars, hotels, and other hospitality-related businesses, and their workers, are among those most seriously impacted by COVID-19 in Delaware. We're taking steps to help these businesses and their employees.  \n\nMore info: https:// news.delaware.gov/2020/03/18/gov ernor-carney-announces-help-program-to-support-delaware-small-businesses/ ", "2020-03-18T14:35:06.000Z": "ICYMI: I authorized @DelawareLabor Secretary Cerron Cade to issue new guidelines to protect Delaware workers and ensure that unemployment benefits are available for Delawareans whose jobs are affected by the coronavirus outbreak. The Delaware Department of Labor Expands Unemployment Benefits to Workers Affected by the COVID-19... In accordance with the Governor's amended State of Emergency declaration, the Honorable Cerron Cade, Secretary of Labor for the State of Delaware has issued new guidelines to enhance the flexibility... news.delaware.gov", "2020-03-18T13:37:26.000Z": "Watch LIVE --  Coronavirus update from @Delaware_DHSS 3/18/20: Coronavirus Update Dr. Kara Odom Walker, Secretary of the Department of Health and Social Services, and Dr. Karyl Rattay, Director of the Division of Public Health, provide an update on coronavirus situation in... livestream.com", "2020-03-17T23:54:50.000Z": "As governors lead the response to the #coronavirus pandemic in their states, they are calling on the Senate to pass legislation to help prevent the spread of the virus, provide medical treatment, and offer assistance to families. https:// nga.org/news/press-rel eases/governors-urge-senate-passage-of-families-first-coronavirus-response-act/ ", "2020-03-17T23:18:22.000Z": "We understand that not every resident in our state can watch a livestream. That's why we're providing information through every medium so every Delawareans are aware of:\n\n-how we are responding to the presence of COVID-19 in DE \n\n-latest guidance from medical professionals", "2020-03-17T23:18:21.000Z": "ICYMI: @DelawareDOT 's WTMC Radio is rebroadcasting my virtual town hall with @Delaware_DHSS . Tune in now: 1380 AM (statewide) and 98.5 FM (most of New Castle County)", "2020-03-17T20:50:21.000Z": "Delaware Public Health announced 8 additional positive cases of #coronavirus disease bringing statewide total to 16. Seven of the eight individuals are New Castle Co. residents, and one is the first reported case in Sussex Co. Public Health Announces Additional Positive Cases of Coronavirus - State of Delaware News DOVER (March 17, 2020) - The Delaware Division of Public Health (DPH) is announcing eight additional positive cases of coronavirus disease 2019 (COVID-19) bringing the statewide total to 16. Seven of... news.delaware.gov", "2020-03-17T20:01:31.000Z": "To keep everyone safe, please stay in your vehicles and have your trunk cleared out ahead of time. For meals and resources for students, please visit http:// doe.k12.de.us/covid19 . For updates on coronavirus, visit Coronavirus - Delaware's Coronavirus Official Website Find the lab-confirmed cases by county, learn what you can do, find resources for businesses, schools, health care, and more. coronavirus.delaware.gov", "2020-03-17T20:01:30.000Z": "Thank you @FoodBankofDE and other organizations for coming together to help one another when it is needed most. Starting tomorrow, the Food Bank of Delaware will host a Drive-Thru Mobile Pantry in each county:\n\n3/18 in New Castle County\n3/19 in Sussex County\n3/20 in Kent County", "2020-03-17T18:34:00.000Z": "While these statewide restrictions remain in place to stop the spread of coronavirus, I encourage you to order take-out or delivery from your favorite DE restaurants to help support them during this period of time. For the latest updates: http:// de.gov/coronavirus", "2020-03-17T17:54:09.000Z": "The efforts operating out of SHOC include a coronavirus call center, a Joint Information Center, and a team of epidemiologists. Thank you to everyone for the work you're doing to keep Delawareans healthy and informed. For more info, visit: http:// de.gov/coronavirus  @Delaware_DHSS Coronavirus - Delaware's Coronavirus Official Website Find the lab-confirmed cases by county, learn what you can do, find resources for businesses, schools, health care, and more. coronavirus.delaware.gov", "2020-03-17T17:54:08.000Z": "I visited the State Health Operations Center (SHOC), the center for Delaware's response to the coronavirus, and was impressed by the diligence and focus of our team of experts who are leading the efforts to get the most up to date information. Look inside the brain of the fight against the coronavirus in Delaware Take a look inside the State Health Operation Center as they plan the battle against the coronavirus. delawareonline.com", "2020-03-17T14:45:46.000Z": "We know that the public health restrictions we put in place to reduce the spread of coronavirus will hit DE's small business community especially hard. That's why we are taking steps to help small businesses impacted during this period of time.\n\nMore info: https:// news.delaware.gov/2020/03/17/gov ernor-carney-requests-federal-assistance-for-small-businesses/ ", "2020-03-17T14:19:13.000Z": "I just got off the air with @WDEL 's Allan Loudell. I talked about our response to #COVID19 & how this situation requires a great deal of flexibility from all of us. Social distancing is especially important to help flatten the curve & reduce the number of positive cases at once.", "2020-03-17T13:14:26.000Z": "Public Health's Coronavirus Call Center is up and running this morning and ready to find answers to your questions on #coronavirus  #COVID2019  #netDE .", "2020-03-17T01:33:19.000Z": "After our virtual town hall, I stopped by @bigchefguy 's Toscana To Go to pick up my to-go order of capellini. I encourage you to order take-out or delivery from your favorite DE restaurants while these tough statewide restrictions remain in place.", "2020-03-16T22:26:36.000Z": "Around 6:30pm, I'm holding a virtual Q&A with Dr. Kara Odom Walker, Secretary of @Delaware_DHSS . We know there are a lot of questions, and we hope you'll tune in. Virtual Q&A On Livestream livestream.com", "2020-03-16T18:40:23.000Z": "Restaurants also remain a critical source of food for vulnerable populations. \n\nBut this is a very serious situation, with a significant amount of uncertainty.", "2020-03-16T18:38:15.000Z": "Tonight, 3/16 at 8pm, we're taking more action to prevent the spread of coronavirus. These restrictions will hit DE's restaurants & bars especially hard. Please continue to support these businesses and their workers by ordering take-out/delivery. \n\nMore: https:// news.delaware.gov/2020/03/16/gov ernor-carney-limits-restaurants-to-take-out-and-delivery/ ", "2020-03-16T15:13:16.000Z": "We know that many students rely on school meals for nutrition.\n\nPlease take a look at @DEDeptofEd 's list of open meal sites for students: http:// de.gov/covid19edu", "2020-03-15T19:27:54.000Z": "Public Health announces another positive #coronavirus  #COVID19 case for Delaware #netDE Public Health Announces Additional Positive Case of Coronavirus in Delaware - State of Delaware News DOVER (March 15, 2020) - The Delaware Division of Public Health (DPH) is announcing one additional positive case of coronavirus disease 2019 (COVID-19). The case involves a New Castle County woman... news.delaware.gov", "2020-03-15T15:51:53.000Z": "We can all take steps to help stop the spread of coronavirus. This article explains why social distancing is important to help flatten the curve and reduce the number of positive cases at once. These simulations show how to flatten the coronavirus growth curve The early trickle of new coronavirus infections has turned into a steady current. By creating simple simulations, we can see how to slow it down. washingtonpost.com", "2020-03-14T15:52:22.000Z": "Some helpful advice for keeping our devices clean. #coronavirus  #coronavirusDE  #COVID19 GIF", "2020-03-14T13:35:01.000Z": "We understand that customers may have concerns about visiting locations frequented by the public due to current public health concerns. We'd like to remind our customers that myDMV offers over 20 services online. To register visit: http:// mydmv.delaware.gov  #NetDE", "2020-03-14T15:55:38.000Z": "2 more #coronavirus cases - both associated with the UD community - announced this morning by Division of Public, bringing Delaware's total to 6 cases. More details: https:// news.delaware.gov/2020/03/14/dph -announces-2-more-presumptive-positives-individuals-associated-with-ud-community/ ", "2020-03-13T19:41:26.000Z": "ALL: DelDOT Urges Use of DMV Online Services News Room deldot.gov", "2020-03-13T15:39:52.000Z": "#Coronavirus testing is not recommended for people who do not have symptoms. For people with symptoms (fever, cough, or shortness of breath), their primary care provider can collect specimens & send them to our Public Health Lab or LabCorp for testing. http:// de.gov/coronavirus", "2020-03-13T23:28:15.000Z": "We will specifically prepare for the potential impact of extended school closures on Delaware children and their families. Public school leaders should also undertake a deep cleaning of their facilities during the two-week closure.", "2020-03-13T23:28:14.000Z": "Over the next two weeks, the State of Delaware will work with school leaders and public health experts to create a plan for Delaware students and educators as this coronavirus outbreak continues.", "2020-03-13T23:24:34.000Z": "I've directed schools to close from March 16-27 to prepare for potential spread of coronavirus. \n\nFull letter: https:// news.delaware.gov/2020/03/13/gov ernor-carney-directs-two-week-closure-of-delaware-public-schools/ ", "2020-03-13T11:57:19.000Z": "Gov. @JohnCarneyDE to talk LIVE on @WDEL about the State of Emergency in Delaware tied to the #coronavirus at 8:45a.  | LISTEN: http:// player.listenlive.co/44291 | #netDE WDEL 1150AM & 101.7FM Delaware's Newsradio 1150AM and 101.7FM, Wilmington, DE player.listenlive.co", "2020-03-12T21:19:16.000Z": "Updated numbers on #coronavirus disease in Delaware as of March 12 at 5 pm Delaware Division of Public Health Provides Update on Individuals Being Tested - State of Delaware... DOVER (March 12, 2020) - The Delaware Division of Public Health (DPH) is providing an update on the number of individuals currently being tested for coronavirus disease 2019 (COVID-19). In Delaware,... news.delaware.gov", "2020-03-12T20:57:38.000Z": "𝐒𝐭𝐚𝐭𝐞 𝐨𝐟 𝐄𝐦𝐞𝐫𝐠𝐞𝐧𝐜𝐲 𝐖𝐈𝐋𝐋 𝐍𝐎𝐓:\n Require schools or businesses to close their facilities\n\n Implement any driving restrictions in Delaware\n\n Close state office buildings", "2020-03-12T20:56:07.000Z": "𝐒𝐭𝐚𝐭𝐞 𝐨𝐟 𝐄𝐦𝐞𝐫𝐠𝐞𝐧𝐜𝐲:\n Requires @DelawareNG to take precautionary & responsive actions \n\n Advises DE event organizers to cancel non-essential public gatherings of 100+ people\n\n Allows State to conduct public meetings electronically\n\n Prohibits price gouging", "2020-03-12T20:10:59.000Z": "Today's emergency declaration will make sure we have the authority and resources necessary to effectively prevent the spread of the coronavirus. Governor Carney Declares State of Emergency to Prepare for Spread of Coronavirus (COVID-19) - State... Governor John Carney on Thursday issued a State of Emergency declaration to prepare for the spread of Coronavirus (COVID-19). The State of Emergency directs the Delaware Emergency Management Agency... news.delaware.gov", "2020-03-12T16:22:34.000Z": "Delawareans with questions about COVID-19 or your exposure risk can contact the Division of Public Health's Call Center:\n\n1-866-408-1899 or TTY 1-800-232-5460 \nM-F, 8:30 am to 4:30 pm \nEmail: DPHCall@delaware.gov\n\nFor the latest on DE's response: http:// de.gov/coronavirus Quote Tweet DHSS @Delaware_DHSS Delaware announces three additional presumptive positive cases of #coronavirusdisease  #COVID19  https:// news.delaware.gov/2020/03/12/dph -announces-additional-cases/ ", "2020-03-11T22:54:36.000Z": "I'm holding a virtual town hall with Dr. Kara Odom Walker, Sec. of @Delaware_DHSS . Watch live: 3/11: Virtual Town Hall Governor Carney is hosting a virtual town hall to talk about issues important to the state. He will be joined by Dr. Kara Odom Walker, Secretary of Delaware's Department of Health and Social Servic... livestream.com", "2020-03-11T20:21:57.000Z": "The @Delaware_DHSS Division of Public Health announced the first presumptive positive case of coronavirus in Delaware. \n\nPress conference at 4:30pm: COVID-19 Update On Livestream livestream.com", "2020-03-10T22:27:49.000Z": "Delaware has no confirmed or presumptive #coronavirus cases. As of March 10, 3 tests are pending and 31 people are being monitored. For more info: http:// de.gov/coronavirus  @delaware_gov", "2020-03-10T22:28:07.000Z": "Out of an abundance of caution, we postponed our Town Hall on Wed, 3/11 at Newark Senior Center.\n\nSo we're having a virtual town hall instead. Wed, 3/11 @ 6:30pm\n\nWhere to watch:\nFB- http:// facebook.com/johncarneyde Livestream- http:// livestream.com/stateofdelaware Website- http:// de.gov/live", "2020-03-10T01:22:04.000Z": "The @Delaware_DHSS Division of Public Health recommends taking commonsense steps to prevent the spread of all germs- like not touching your face, eyes, nose, or mouth with unwashed hands. \n\nMore tips and DE updates on coronavirus: http:// de.gov/coronavirus", "2020-03-09T20:58:25.000Z": "I was grateful to be at the grand opening of @BrandywineSPCA 's new Dover facility this weekend. This full-service animal shelter will be an asset to the community. Thank you for your important work.", "2020-03-07T20:26:56.000Z": "#Coronavirus prep: Clean surfaces frequently in your home, office or elsewhere with disinfectants. More household guidance from @CDCgov : https:// cdc.gov/coronavirus/20 19-ncov/community/home/cleaning-disinfection.html  Delaware updates: http:// de.gov/coronavirus", "2020-03-08T15:36:37.000Z": "Happy International Women's Day Delaware! Are you a woman in Delaware? Participate in statewide listening sessions to voice your experiences. Register online by following this link: https:// docs.google.com/forms/d/e/1FAI pQLSfDMvD32mi2bAiA4iqzZfRP1WgthLZeQahgVhTwMv3j_ZeYvw/viewform   @Delawarewomen  #Delawarewomen  #internationalwomensday", "2020-03-08T00:22:12.000Z": "Congratulations to @morgihurd from Middletown for winning the women's all-around title at the #AmericanCup ! #Delaproud U.S.'s Hurd wins all-around at American Cup Morgan Hurd is turning the page from a frustrating 2019 season and going for her first Olympic berth. espn.com", "2020-03-07T15:06:44.000Z": "Ria Allman, manager of the Division of Public Health's Lab in Smyrna, talks about the steps needed to test for the coronavirus. Delaware has tested 10 people for the virus; all have been negative. To learn more about Delaware's response, visit http:// de.gov/coronavirus", "2020-03-06T14:29:52.000Z": "The Del. Div. of Public Health's coronavirus call center is open to take questions from the public, schools, medical providers, state agencies and community organizations. The number is 1-866-408-1899. Call 8:30 a.m. to 4:30 p.m. M-F #coronavirusDE  #netde  #coronavirus", "2020-03-05T16:01:50.000Z": "The @Delaware_DHSS Division of Public Health opened a call center to answer any questions you have about the coronavirus: 1-866-408-1899\n\nYou also can email your questions: DPHcall@delaware.gov \n\nFor the latest DE updates, visit http:// de.gov/coronavirus", "2020-03-04T17:44:37.000Z": "First Lady Carney was at MOT Charter for #nsbw2020 . More National School Breakfast Week photos from across the state here: https:// facebook.com/pg/DeDeptEduca tion/photos/?tab=album&album_id=2836376216419391   @JohnCarneyDE  #netde  #edude", "2020-03-04T01:55:38.000Z": "#ThisIsDelaware Great footage of @cityofwilmde Video: @tfurlong From Tim Furlong", "2020-03-03T23:20:25.000Z": "Full house tonight at our #DESOTS Town Hall in Bear. \n\nWatch live:  http:// de.gov/live OR  http:// Facebook.com/johncarneyde GIF", "2020-03-03T15:19:19.000Z": "I had a great time reading to students at @StubbsEarlyEd for #ReadAcrossAmerica Day! \n\nAlways a crowd favorite: \"Pete the Cat and His Four Groovy Buttons\" #edude  @DEDeptofEd", "2020-03-02T20:52:20.000Z": "Update from @Delaware_DHSS - The risk of coronavirus remains low for Delawareans. Best practices to stay healthy and avoid spreading germs:\n Wash hands\n Cover cough\n Disinfect surfaces frequently\n Stay home if sick\n\nFor DE updates on coronavirus: http:// de.gov/coronavirus", "2020-03-02T18:10:02.000Z": "Happening now: #Delaware  @Delaware_DHSS officials provide an update on the response to #coronavirus . Updates on Coronavirus Department of Health and Social Services (DHSS) Secretary Dr. Kara Odom Walker and Division of Public Health (DPH) Director Dr. Karyl Rattay join other officials in providing updates on Delaware's... livestream.com", "2020-03-02T15:11:47.000Z": "This morning First Lady Carney visited F. Niel Postlehwait Middle School ( @CaesarRodneySD ) to kick off School Breakfast Week in Delaware and nationwide. @JohnCarneyDE More pics: https:// facebook.com/pg/DeDeptEduca tion/photos/?tab=album&album_id=2836376216419391&xts%5B0%5D=68.ARBJZs7N3vcnHaMI6Y1U0M-TlQwrCH6rvmtQSkChHZlicpWhTif-pNuXdpCbJszaz3f328oAYATc2pe9a5CTpAl19rJHAIU07TznIXdBn9NunDlxXbSzNa5pDMew7kjMdXn3l7SJwj01-1FEhCflzL-KtaTZd675FWRXgYe7xBbk-m9ix7PEXi9cMoKhpwTzNn9xS5gu8g0rSL-b8z26yBodNhyRFbhHgY8NKFawcDn9n3mKuCGU7LlTQmSeC51bUqn5PkKT4plpmmqaHx2_vnP8BYIcGwsRi7fqv97J1UWbHDCD81l1bYaMqUaUlFehmaUwb9A-WEHTsMSWI7CBLegeuRujaIRX-qwwiKhnbWgV8m6Esm6qwE0AkV2kG6Li2oFHEMHnw3bECZr1ufgwjYqS1imBS5K5dTOFFUC1WJCeccVNlvarknuuAqgX1iv-Rel4gjKjWSjxFcVGAa3q&tn=-UC-R   #netde  #edude", "2020-03-02T14:34:40.000Z": "Watch live at 1pm today, as Delaware officials update the public on the response to #coronavirus . Learn the steps you can take and the steps Delaware is taking to prevent the spread. https:// livestream.com/StateofDelawar e/COVID19-03022020   @delaware_gov  @DrKaraWalker  @JohnCarneyDE  #publichealth  #netde Updates on Coronavirus Department of Health and Social Services (DHSS) Secretary Dr. Kara Odom Walker and Division of Public Health (DPH) Director Dr. Karyl Rattay join other officials in providing updates on Delaware's... livestream.com", "2020-03-01T19:13:50.000Z": "While I was in Laurel this week, I had the chance to meet and recognize Ka'Myre Snead- a real hero. Ka'Myre saw a fellow student choking at lunch and performed the Heimlich maneuver. Way to go, Ka'Myre! #Delaproud Laurel Middle School student honored by Del. Governor John Carney - 47abc LAUREL, Del. - A Laurel Middle School student was honored by Delaware Governor John Carney on Thursday. Two weeks ago, sixth grader Ka'myre Snead acted fast in the lunch room when he saw a friend... wmdt.com", "2020-02-29T19:38:55.000Z": "Delaware's public health experts are prepared for the coronavirus. \n\nVisit http:// de.gov/coronavirus for tips on what you can do and the latest information from the @Delaware_DHSS Division of Public Health. #netde", "2020-02-29T00:47:39.000Z": "It's always exciting to see students from across the state competing against one another in this event. I was impressed by their skills, and I'm glad I could see some of the competition today. \n\nGreat job to everyone- the food looked delicious!", "2020-02-29T00:44:48.000Z": "Congratulations @CaesarRodneySD on winning the @DEProStart Student Invitational culinary competition for the second year in a row, and to Seaford for winning the management competition!  @derestaurant  @DEDeptofEd  @DelawareDOL  #netde  #edude  #dpsi2020", "2020-02-28T17:25:55.000Z": "Governor @JohnCarneyDE recently announced that the application period for the student representative position on the State Board is now open. Applicants must be a rising 11th or 12th grade student. Apply by March 20th. More info here: https:// news.delaware.gov/2020/02/27/gov ernor-carney-application-period-is-open-for-student-representative-on-state-board-of-education/ ", "2020-02-26T18:59:21.000Z": "So many of us stand on the shoulders of women who came before us like Mary Ann. Her memory and legacy deserve to be preserved in the First State.", "2020-02-26T18:59:19.000Z": "Pioneer Abolitionist Suffragist \n\nToday, I'm honored to join with @virginiafoxx to introduce the Mary Ann Shadd Cary Post Office Dedication Act. Blunt Rochester Introduces Resolution to Honor Delaware Abolitionist, Mary Ann Shadd Cary bluntrochester.house.gov", "2020-02-27T13:46:00.000Z": "Proud to declare February 24-28 as #PublicSchoolsWeek in #Delaware ! Thank you to public school teachers and staff for working hard every day to educate DE children. #edude", "2020-02-27T01:32:08.000Z": "Bravo Good luck, Jason! Video of Opera Singer at Del. Starbucks Goes Viral A Delaware man is working hard hoping to one day get noticed for his beautiful voice. NBC10's Delaware Reporter Tim Furlong tracked him down after seeing a viral video of him singing opera at his... nbcphiladelphia.com", "2020-02-27T01:12:10.000Z": "Civil rights activist. Suffragist. Howard High School teacher. Poet. Take a moment to learn about Alice Dunbar-Nelson. \n\nThank you to UD's Special Collections librarian Jesse Erickson for sharing her story. #blackhistorymonth", "2020-02-26T21:13:15.000Z": "My staff told me they were so upset that they weren't in this @Wawa yesterday", "2020-02-26T21:10:33.000Z": "Never know who you'll run into at a #Delaware  @Wawa !\n\nAnd great mantra, @Harry_Styles : \n\"Treat People With Kindness\" #kindDE Yes, that was former One Direction singer Harry Styles at a Delaware Wawa When the superstar singer walked into a Delaware Wawa, little did he know a superfan was working there. delawareonline.com", "2020-02-20T16:07:16.000Z": "#Startups in #bioscience , #chemistry , #advancedmaterials , #agriculture and #financial & #business services will vie for funding, visibility and connections during #Startup302 at the first #Delaware  #neoFest . Enter by 3/2. Details at https:// hubs.ly/H0n4_C40 . #choosedelaware  #netde", "2020-02-26T16:55:19.000Z": "Lake Forest School District is using their Opportunity Funding to hire new teachers and paraprofessionals expand tutoring at schools \n\nLearn more: http:// de.gov/opportunity", "2020-02-26T15:50:08.000Z": "Visiting Lake Forest Central Elementary School this morning to see how they are using Opportunity Funding to support their students. @DEDeptofEd  #edude", "2020-02-26T02:36:26.000Z": "Talking to folks in Odessa tonight about our responsible budget plan and our priorities outlined our 2020 State of the State Address.\n\nWe are focused on: Strengthening Delaware's economy Investing in our public schools Protecting our natural environment #DESOTS GIF", "2020-02-25T21:13:12.000Z": "Wonder what our #DESOTS Town Halls are like? \n\nJoin us tonight in Odessa. Tuesday, 2/25 @ 6pm \nOdessa Fire Company", "2020-02-25T02:47:48.000Z": "From the article: \"The company has hired 88 people - truck drivers, warehouse personnel, management roles and support staff. The facility will employ 125 within its first year of operation growing to 200 by 2022.\" @DotFoodsCareers  #netde", "2020-02-25T02:41:56.000Z": ". @DotFoods is making a real commitment to #Delaware : $37 million distribution center new jobs in DE DOT Foods cuts ribbon at Bear distribution center - Delaware Business Now Dot Foods, Monday cut the ribbon at its $37 million site in Bear. The 188,000-square-foot facility is located on 35 acres at 301 American Boulevard, near the intersection of Red Lion and Wrangle Hill... delawarebusinessnow.com", "2020-02-24T19:38:54.000Z": "Thinking of our neighbor @GovMurphy . Sending good thoughts to the Governor and his family. Quote Tweet Governor Phil Murphy @GovMurphy Friends - I've got a tumor on my left kidney and will undergo a partial nephrectomy in early March to remove it. The prognosis is very good and I'm profoundly grateful to my doctors for detecting the tumor early. Show this thread", "2020-02-22T19:25:16.000Z": "Our #budgetDE keeps our commitment to: responsibly manage taxpayer dollars \n\nAND make investments where they can make the most difference for #Delaware families", "2020-02-19T00:50:51.000Z": "It's National Kindness Week! #kindde  #wilburinspired  #5thgrade  #kindkids  #choosekind", "2020-02-20T14:17:44.000Z": "DHSS Secretary @DrKaraWalker is interviewed by her 8-year-old daughter about mentors, inspiration and giving back. https:// youtu.be/kOUUKMryJds  #netDE  #BlackHistoryMonth DHSS Secretary Walker on Black History Month DHSS Secretary Kara Odom Walker sat down for an interview this week about what Black History Month means to her. The interview was done by her daughter, Sara... youtube.com", "2020-02-19T23:23:38.000Z": "At State of the State Town Hall, @JohnCarneyDE touts the almost 20% reduction in premiums on Delaware's Health Insurance Marketplace that resulted in 6% increase in enrollment. @ChooseHealthDE  #healthde  #netde", "2020-02-19T23:38:39.000Z": "@JohnCarneyDE is currently hosting a State of the State Town Hall with State Senator @TizzyLockmanDE , State Representative @SherryDorseyDE , State Representative Stephanie Bolden and State Representative Franklin Cooke Wed, Feb 19, 2020, Wilmington DE.  @monsterphotoiso", "2020-02-18T17:54:48.000Z": "Love this bulletin board that our red team put together in their hallway! #KindDe", "2020-02-18T13:55:00.000Z": "Celebrate Kindness Week by spreading positivity. Create a wall of kind words using notes or post-its. Where would you leave a kind note? #KindDE  #Kindnessweek", "2020-02-19T14:31:03.000Z": "\"That's why three multimillion-dollar initiatives in the governor's proposed budget for the fiscal year starting in June are so critical for Sussex County.\" Clean water initiatives worth celebrating Delaware's greatest natural resources are its environment and its mid-Atlantic location in close proximity to one of the nation's largest megalopolises. Gov. John Carney's recent comments about the... capegazette.com", "2020-02-18T19:28:31.000Z": "Join us at @delawaretech 's George Campus in Wilmington for our next State of the State Town Hall. Wednesday, Feb. 19 6:00 pm 300 N Orange St, Wilmington #netde  #wilmde  #DESOTS", "2020-02-17T23:01:12.000Z": "#KindDE We are ready to celebrate National Kindness Week at Wilbur Elementary!  Excited for our students to be the \"I\" in KIND! #wilburinspired  @JohnCarneyDE  @ColonialSDstrct  #powerofwecsd", "2020-02-17T21:57:04.000Z": "Today I signed a proclamation declaring February as #BlackHistoryMonth . I am proud to honor the African American community and lucky to be surrounded by the women of @dstinc1913 as we announce the @DEPublicArchive exhibit highlighting their role in the women's suffrage movement.", "2020-02-17T17:29:33.000Z": "Keep on spreading kindness, @CaesarRodneySD 1st graders!  #KindDE  #netDE Quote Tweet Delaware.gov @delaware_gov To kick off Kindness Week 2020, we asked 1st graders at Caesar Rodney School District what kindness meant to them. #KindDE  @CaesarRodneySD  #CRSD", "2020-02-17T16:47:55.000Z": "Share stories of kindness in your communities using #KindDE .", "2020-02-17T16:47:53.000Z": "Kindness matters.\n\nOne simple act of kindness can make a real difference. \n\nThat's why we're celebrating Kindness Week in #Delaware .", "2020-02-17T14:00:00.000Z": "This week is Kindness Week in \nDelaware. What will be your act of kindness today? #KindDE", "2020-02-16T22:03:19.000Z": "On April 4, USS Delaware, a brand new Virginia class nuclear submarine, will be commissioned at the Port of Wilmington. If you're interested in attending the commissioning ceremony, sign up for tickets by March 4: https:// ussdelawarecommissioning.org/request-ticket s/   #netde", "2020-02-14T16:30:01.000Z": " #HappyValentinesDay , Delaware! We love you and just want you to get to your destination safely. Do so by driving sober. #ArriveAliveDE  #ValentinesDay", "2020-02-14T19:47:01.000Z": "Today and every day. #KeepDELitterFree  #netde  #thisisdelaware  #ValentinesDay", "2020-02-14T15:26:35.000Z": "I will nominate @DEStatePolice Superintendent Colonel Nathaniel McQueen Jr. to serve as our next Secretary of @Delaware_DSHS .\n\nI've known Colonel McQueen a long time. He's dedicated his career to law enforcement, to protecting our communities, and to keeping Delawareans safe.", "2020-02-14T15:15:53.000Z": "There are few people across our state who are more well-respected, and more committed to serving the people of Delaware, than @Delaware_DSHS Secretary Coupe.", "2020-02-14T13:06:38.000Z": "Congrats to Charlie Kahler from Newark who plays Young Simba in the touring version of The Lion King. Break a leg in your upcoming shows! #Delaproud Newark 10-year-old debuts as Young Simba on national tour of Broadway's 'The Lion King' Charlie Kahler is preparing to travel across the country with the touring Broadway show (and his mom). delawareonline.com", "2020-02-13T22:19:59.000Z": "The future of our state depends on the success of all our children. \n\nThat's why my budget will continue investing in schools across Delaware. \n\nLearn more about Opportunity Funding: Opportunity Funding - Governor John Carney - State of Delaware For the first time in Delaware, districts and charter schools are receiving weighted funding to better support the state's most disadvantaged students. Working with the General Assembly, Governor... governor.delaware.gov", "2020-02-13T22:19:58.000Z": "Because of Opportunity Funding, @AppoSchools expanded pre-k enrollment and created a program that provides extra supports for low-income students, English learners & students with special needs. \n\nThanks @bmedolphins Preschool Center for welcoming me into your classrooms! #eduDE", "2020-02-12T21:53:17.000Z": "We are on the road talking with Delawareans about the state of our state. Join us at 6pm tonight at the Carlisle Fire Company in Milford. \n\nCheck out upcoming town halls here: http:// de.gov/sots  #DESOTS", "2020-02-11T23:13:35.000Z": "Proud to recognize February 11th as Delaware 2-1-1 Day.\n\nDelaware 2-1-1 provides free assistance to connect those in need to essential community-based services. \n\nLearn more: http:// delaware211.org  @UnitedWayDE", "2020-02-11T22:23:53.000Z": "Opportunity Funding provides $75M over 3 years for additional resources in classrooms for students who need our help most. We're working with educators & investing in the unique needs of communities up & down our state. We'll track results & invest in what works for DE students.", "2020-02-11T22:23:52.000Z": "Thank you teachers, students, and staff for letting me into your classrooms at Georgetown Middle & Elementary. I enjoyed meeting students and educators and learning more about how @IndianRiverDE is using Opportunity Funding. #eduDE", "2020-02-09T20:15:50.000Z": "Have you seen @DEStateParks ' Airstream? \n\nPretty cool stuff!  @DelawareTourism  #VisitDE  #DEStateParks JetSet | Delaware State Parks' sweet ride takes center stage at national travel show Delaware took center stage at the largest consumer travel show in North America as it aimed to bring outsiders to the First State for the first time. wdel.com", "2020-02-08T15:00:50.000Z": "Three weeks left to apply for an EDGE Grant from the Delaware Division of Small Business. Find out if you're eligible and download an application: http:// ow.ly/56uo50yfvyI  #delbiz  #smallbiz", "2020-02-08T19:10:44.000Z": "Our budget includes $50 million to build a state-of-the-art school to replace Bancroft, and to renovate Bayard and Stubbs.\n\nOver the last three years, we've built or renovated nearly 30 schools statewide.\n\nWilmington students deserve no less. #eduDE  #budgetDE", "2020-02-07T14:39:42.000Z": "Tornado Warning including Wilmington DE, Newark DE, Bear DE until 10:15 AM EST", "2020-02-06T14:15:00.000Z": "February is Black History month. Today we are spotlighting Louis L. Redding, a prominent lawyer and civil rights advocate from Delaware. He is most famous for being part of the NAACP legal team that challenged school segregation in the Brown v. Board of Education case.", "2020-02-06T23:35:37.000Z": "\"When a should becomes a must human beings do extraordinary things.\"  Thank you, Justice Montgomery-Reeves for being extraordinary @DariusJBrown  @JohnCarneyDE Justice Montgomery-Reeves: Stay open to opportunities - Delaware Business Times Delaware's new Supreme Court Justice, Tamika Montgomery-Reeves, talks with DSU President Tony Allen about what her career path and about breaking barriers delawarebusinesstimes.com", "2020-02-07T01:07:02.000Z": "This is why we need more investment to make sure all Delaware families have access to clean water. \n\nOur budget includes $50 million to fund a new Clean Water Trust - in partnership with @RepLonghurst and Sen. McBride. Aging infrastructure, fluctuating temps taking toll on Dover's water mains - Delaware State News DOVER - Water mains within the city of Dover seemed to be spewing water like geysers between Dec. 1 and Jan. 16. Jason Lyon, assistant director of Public Works for the city of Dover, said there were... delawarestatenews.net", "2020-02-04T23:23:32.000Z": "Full house tonight in Lewes for our #DESOTS Town Hall. \n\nWatch live:\n- http:// Facebook.com/johncarneyde - http:// de.gov/live GIF", "2020-02-03T14:30:00.000Z": "\"One of the best ways we can take pride in our communities is to keep them clean.\" - Governor @JohnCarneyDE  #KeepDELitterFree", "2020-02-03T23:30:34.000Z": "We had just such an opportunity a few months ago when the Senate confirmed #Delaware 's first African American Supreme Court Justice. \n\nJustice Montgomery-Reeves' swearing in before a crowd of hundreds at Howard High School was a moment I won't soon forget. #DESOTS", "2020-02-03T23:29:27.000Z": "When people have confidence in government, it helps give them hope for the future. Inspiring that hope is our job too.\n\nThere are some things we can do in government that don't require a new program, spending, or idea. Yet, they can inspire that same hope and faith in government.", "2020-02-03T22:24:51.000Z": "Join us tomorrow, February 4th at 6pm for a #DESOTS Town Hall. Lewes Fire Station #2 \n32198 Janice Road, Lewes, DE 19958 #netde  https:// facebook.com/events/2700702 616692906/ ", "2020-02-03T21:04:18.000Z": "Welcome to Wilmington, @CSCGlobal ! \n\nThis investment from CSC is another vote of confidence in our state, in the City of Wilmington, and the potential for growth in our largest city. CSC moves next door to Wilmington train station One of Delaware's oldest professional names is moving to Wilmington. wdel.com", "2020-02-02T18:00:28.000Z": "What's your game plan? Make sure you have one to celebrate the #SuperBowl responsibly. #ArriveAliveDE", "2020-02-02T22:52:18.000Z": "Had a great time today at the Polar Bear Plunge. Lots of folks braved the weather (and water!) to support a good cause. Congratulations on your record-breaking event! @SODelaware  #plungeDE", "2020-02-01T19:30:00.000Z": "February is Black History Month. Today we are spotlighting Pauline A. Young, an African-American teacher, librarian, historian, lecturer, community activist, and humanitarian. She was a devoted lifelong member of her local and national chapter of the NAACP.", "2020-01-31T23:34:20.000Z": "Over the next decade, we will plant 1 million trees across Delaware. \n\nThat's a tree for every Delawarean.  #DESOTS  #netde", "2020-01-30T15:22:22.000Z": "Today at 11:15 am, I'm presenting my #budgetDE proposal for Fiscal Year 2021. \n\nWatch LIVE: http:// facebook.com/johncarneyde or http:// de.gov/budget2021", "2020-01-28T18:02:14.000Z": "Welcome back @FlyFrontier to @FlyWilmILG ! A big thank you to the Delaware River and Bay Authority for working hard to bring affordable and convenient travel to Delawareans. #netDE", "2020-01-28T00:10:28.000Z": "In remembering the millions of lives senselessly lost during the Holocaust, we honor those who survived one of humanity's darkest periods, and recommit ourselves to opposing hatred and intolerance wherever it exists. Never again. #HolocaustMemorialDay  #WeRemember", "2020-01-27T16:46:53.000Z": "Water is #Delaware 's most basic and valuable resource, and we should protect that resource for future generations. \n\nThat's why we're partnering with @RepLonghurst , Senator David McBride, and members of the General Assembly to invest $50 million in #cleanwaterDE .", "2020-01-24T20:37:52.000Z": "Good news: Delaware's economy is prospering and Governor Carney's recommended budget plan will make it stronger still with investment in schools, clean water, infrastructure and jobs. #choosedelaware  #DelawareOneStop  #Readyin6  https:// governor.delaware.gov/state-of-the-s tate/ ", "2020-01-24T13:37:15.000Z": "Thanks a \"million\" to @JohnCarneyDE for mentioning #trees in his 2020 #DESOTS address. The Delaware Forest Service is ready to help #planttrees ! #netde", "2020-01-24T02:11:08.000Z": ". @JohnCarneyDE is proposing tens of millions of dollars in capital investments to strengthen Delaware's economic infrastructure. Gov. John Carney focuses on economy, environment, schools in speech Gov. John Carney is proposing tens of millions of dollars in capital investments to strengthen Delaware's economic infrastructure.", "2020-01-23T21:28:55.000Z": "#DESOTS", "2020-01-23T21:03:59.000Z": "Three years ago, we promised Delawareans we'd make investments that move our state forward, while getting our state's finances in order. \n\nAfter digging out of a $400 million deficit, we've had two years of stronger revenues.\n\nAnd we've been disciplined about how we've spent it.", "2020-01-23T20:58:23.000Z": "All across Delaware, from Dover to Middletown to Rehoboth, we've built or renovated nearly 30 beautiful schools in the last three years.\n\nOur children in Wilmington deserve no less.", "2020-01-23T20:57:32.000Z": "While students across our state need our attention, students in the City of Wilmington need our help the most.", "2020-01-23T20:55:14.000Z": "We know that an early start is key to this success. \n\nThat's why, over the next three years, we'll increase state-funded ECAP pre-k seats by 50 percent statewide. #eduDE  #DESOTS", "2020-01-23T20:49:11.000Z": "My budget will continue this investment, not only because it's the right thing to do, but because the future of our state depends on the success of our children. #eduDE  #DESOTS", "2020-01-23T20:43:53.000Z": "Laurel's represented today by Jessica Nowacki, their behavioral health coordinator hired through Opportunity Funding.\n\nPublic schools across DE are using this funding to hire more than 200 new educators and professionals focusing on low-income and English learners. #eduDE  #DESOTS", "2020-01-23T20:43:52.000Z": "Examples: \n\nAppoquinimink is expanding pre-K enrollment.\n\nIn Red Clay, Dorrell Green and his team are reducing class sizes and providing additional mental health supports.\n\nLaurel educators are placing a specific focus on behavioral health in the classroom.", "2020-01-23T20:43:51.000Z": "For the first time in our state's history, we're targeting resources toward these students who need our help the most. \n\nWe call it Opportunity Funding. Districts are already putting the money to good use.", "2020-01-23T20:35:28.000Z": "Today, I can report that graduation rates for low-income students and English learners are the highest they've been in 10 years. #eduDE  @DEDeptofEd  #DESOTS", "2020-01-23T20:35:27.000Z": "The promise we made three years ago to our children is probably the most important of all. \n\nWe promised that at the end of our term, more children would be graduating ready for what comes next. \n\nAnd with a sense of promise about the future.", "2020-01-23T20:28:46.000Z": "Since I took office in January 2017, 1,280 members of the @DelawareNG have deployed overseas and at home. \n\nProud to have Captain Steinbrunner and Specialist Toussaint with us today at the #DESOTS .\n\nThank you for your service to our state and our country.", "2020-01-23T20:28:45.000Z": "In addition to helping their fellow citizens, many of our state employees put their lives on the line to protect all of us. @DelawareNG guardsmen and women set an example of selflessness and sacrifice.", "2020-01-23T20:22:03.000Z": "We passed the nation's best parental leave policy for state workers and educators. \n\nMore than 200 state employees have been able to spend twelve weeks at home with their newborn babies. \n\nThank you Rep. Heffernan for your #leadonleaveDE . #DESOTS Paid Parental Leave Law: April 1, 2019 Delaware's Paid Parental Leave law went into effect April 1, 2019. youtube.com", "2020-01-23T20:18:16.000Z": "That's going to change this spring, when a USS Delaware, a brand new Virginia class nuclear submarine, is commissioned at the Port of #WilmDE .\n\nFor details about the commissioning ceremony and events, and to sign up for tickets, visit: http:// USSDelawareCommissioning.org  #DESOTS", "2020-01-23T20:18:15.000Z": "Warships named after the First State have sailed under a U.S. flag dating back to the Revolutionary War. \n\nBut it's been over 100 years since we've had a Navy ship named #Delaware .", "2020-01-23T20:17:55.000Z": "This year, we are taking our commitment to the environment a step further.\n\nOver the next decade, we will plant 1 million trees across Delaware. \n\nThat's a tree for every Delawarean.  #DESOTS", "2020-01-23T20:09:13.000Z": "In 2018, we welcomed a record 9.2 million visitors to our state. \n\nThat translates into $3.5 billion coming to Delaware -- also a record. @DelawareTourism  #VisitDE  #DESOTS", "2020-01-23T20:02:38.000Z": "We've preserved 134,000 acres of farmland. \n\n25 percent of Delaware's family farms are now preserved forever. #DESOTS  @AgricultureDE", "2020-01-23T19:59:18.000Z": "We plan to work with my friend Senator McDowell to set a new Renewable Portfolio Standard. \n\nBy 2035, we want 40 percent of Delaware's energy to come from renewable sources. #DESOTS", "2020-01-23T19:59:17.000Z": "Delaware has made great strides over the last decade to reduce our reliance on fossil fuels, and we should continue to be a leader on this issue.", "2020-01-23T19:56:30.000Z": "Through @DelawareDOT 's leadership last year, we picked up close to 50,000 bags of trash. #KeepDELitterFree  #DESOTS", "2020-01-23T19:56:29.000Z": "Last year, we launched the #KeepDELitterFree campaign to get cities, towns and community groups on board.", "2020-01-23T19:53:58.000Z": "It drives my security detail crazy, but if you see me walking down the street, you'll often see me stopping to pick up a Wawa bag or an empty bottle of soda. \n\nWe have a litter problem in Delaware. And I'm determined to stop it. #KeepDELitterFree  #DESOTS Pledge to Keep DE Litter Free Delaware is a beautiful state. Our beaches, our parks, and outdoor space are part of what makes our state so special. But we have a big litter problem. That's why Governor Carney, in partnership with... governor.delaware.gov", "2020-01-23T19:53:57.000Z": "Even when you're Governor, making Delaware better starts with the little things.", "2020-01-23T19:52:14.000Z": "That's why we're partnering with Representative Longhurst and Senator McBride to invest $50 million in clean water. #DESOTS  https:// governor.delaware.gov/clean-water/", "2020-01-23T19:52:12.000Z": "From the Brandywine to Rehoboth Bay to Trapp Pond, we have beautiful natural areas in our state.\n\nWe all agree that families in Blades, here in Dover - and across our state - deserve to know that the water coming out of their faucets is clean. #cleanwaterDE", "2020-01-23T19:48:10.000Z": "Access to quality healthcare is also about having doctors in your community. \n\nIn some areas of our state, we simply don't have enough physicians.", "2020-01-23T19:47:07.000Z": "We have seen significant progress since the passage of the Affordable Care Act a decade ago. \n\nToday, almost 95% of Delawareans have health insurance. #DESOTS  @Delaware_DHSS", "2020-01-23T19:47:06.000Z": "Nothing causes more fear or anxiety than when you or a loved one gets sick.\n\nThanks to legislation sponsored by Representative Siegfried, we reduced rates on the ACA health insurance marketplace by almost 20% this year.", "2020-01-23T19:45:37.000Z": "Mayda Berrios is in the audience today for the #DESOTS . \n\nMayda spent several years in foster care and graduated from St. George's. Today, she's a sophomore at @DelStateUniv , and president of a campus organization that mentors children in foster care.", "2020-01-23T19:45:35.000Z": "I think we can all agree that our children should be our focus. \n\nAnd there are perhaps no children more vulnerable than those in our foster care system.", "2020-01-23T19:40:02.000Z": "One of the best ways to achieve that is a simple one: Give children books. \n\nI'm proud to announce that with the leadership of @DELibraries State Librarian Annie Norman, we're launching a pilot of the Dolly Parton Imagination Library. @dollyslibrary  #DESOTS", "2020-01-23T19:39:10.000Z": "In partnership with the Food Bank, our libraries and other non-profits, First Lady Tracey Quillen Carney is leading efforts to ensure that our children come to school ready to learn and thrive.", "2020-01-23T19:37:06.000Z": "We've also established the 1st overdose system of care in the nation, expanding access to treatment for those who are ready to seek help.\n\nThere is much more work to do. But thanks to @LtGovHall_Long and Dr. Walker @Delaware_DHSS , we are becoming a model for the country. #DESOTS", "2020-01-23T19:35:45.000Z": ". @LtGovHall_Long and a committed group of volunteers led by Dr. Sandy Gibney knock on doors and visit homeless encampments in the middle of the night to deliver naloxone. \n\nDr. Gibney is here with us today. #DESOTS", "2020-01-23T19:34:39.000Z": "No one is working harder than @LtGovHall_Long to combat our opioid epidemic. \n\nThrough the Behavioral Health Consortium, the Lieutenant Governor and others have given naloxone to more than 7,000 Delawareans. #DESOTS", "2020-01-23T19:34:20.000Z": "Last year, I signed an Executive Order to help ex-offenders more successfully reenter their communities. It's in everyone's interest that these individuals leave prison better off than when they entered. #DESOTS  @DECorrection", "2020-01-23T19:32:22.000Z": "These laws have already been used 35 times to date. \n\nAnd they have helped save lives. #DESOTS", "2020-01-23T19:32:21.000Z": "Three years ago, we promised to make Delawareans feel safer in their neighborhoods, and in our towns and cities. \nThanks to Rep. @DaveBentz and members of the General Assembly in both parties, we passed the Beau Biden Gun Violence Prevention Act and another, similar red flag law.", "2020-01-23T19:29:59.000Z": "At the end of three years as your Governor, I'm pleased to report that the state of our state is strong, and getting stronger. #DESOTS", "2020-01-23T19:29:10.000Z": "Kimberly's representing the thousands of Sussex and Kent Countians who now have access to this crucial, 21st century technology. \n\nCheck out Kimberly's story: https:// youtu.be/52Kz9tqYRYU  #DESOTS", "2020-01-23T19:29:09.000Z": "Kimberly Hopkins is an educator from Seaford. \n\nWithout access to high-speed internet, Kimberly couldn't grade papers online at night. Her son with autism couldn't get his videos to buffer. \n\nKimberly participated in our broadband pilot and is here with us today.", "2020-01-23T19:29:08.000Z": "New investments in our technology infrastructure have already brought high-speed internet to the areas around Laurel, Seaford and Bridgeville - where service was spotty or nonexistent. @DE_DTI", "2020-01-23T19:26:50.000Z": "Delawareans expect to be able to get to and from work quickly and safely.\n\nThat's why we're investing $4.5 billion over the next six years to modernize our roads, bridges, and public transit. @DelawareDOT  #DESOTS", "2020-01-23T19:25:50.000Z": "Thanks to the Delaware Prosperity Partnership, there are over a thousand new jobs in #Delaware . @choosedelaware  #DESOTS", "2020-01-23T19:24:11.000Z": "One of those business owners is Santiago Rojas-Carbonell with @DE_W7energy . He and his team are developing battery technology for zero-emissions electric vehicles. #DESOTS", "2020-01-23T19:24:09.000Z": "So last spring we started a new grant program through @delbiz : Encouraging Development, Growth and Expansion, or EDGE for short.\n\nWe've awarded nearly $1.5 million in EDGE Grants to 20 companies.", "2020-01-23T19:22:26.000Z": "With a strong economy, it's the right time for us to invest in our future.\n\nMore than half of Delawareans working are employed at small businesses. They're the engine of our economic growth.  \n\nOur future success depends on finding ways to grow our small businesses. #DESOTS", "2020-01-23T19:21:38.000Z": "Today, I have good news to report:\n\nCompared to when I took office, 20,000 more people go to work every day in Delaware.  \n\nMore Delawareans are working than at any point in our state's history. #DESOTS", "2020-01-23T19:20:08.000Z": "Take a look at some of what we've accomplished: https:// youtube.com/playlist?list= PLLlbsN6y3DuDWv5dtsn5F8e14eHtTKkoI  Check out more of our progress: Initiatives - Governor John Carney Governor Carney took office on January 17, 2017 focused on making Delaware's economy more competitive, preparing Delaware's children to succeed, and building a long-term, sustainable financial plan.... governor.delaware.gov", "2020-01-23T19:19:47.000Z": "This is the 4th time I'm addressing this body as your Governor. As we start the last year of my first term, it feels appropriate to take stock.\nOf where we were three years ago.\nOf the promises we made. \nOf the promises we've made good on. \nOf the work we have left to do. #DESOTS", "2020-01-23T19:18:11.000Z": "Senator Harris McDowell will be retiring at the end of this year. Harris is someone who has left his mark on this state in more ways than can be counted. \n\nThank you to my state Senator & one of my oldest friends, Harris McDowell, for your tremendous service to our state. #DESOTS", "2020-01-23T19:16:35.000Z": "Thank you for inviting me into the House chamber today. #DESOTS", "2020-01-23T19:14:06.000Z": "Here we go! #DESOTS", "2020-01-23T14:28:36.000Z": "TUNE IN around 2pm today for my State of the State Address, where I'll outline our priorities for strengthening #Delaware 's economy, improving our public schools, and protecting our quality of life.  http:// facebook.com/JohnCarneyDE or http:// de.gov/sots  #DESOTS", "2020-01-22T15:09:52.000Z": "In the #budgetDE proposal I'll submit to the General Assembly next week, we are including a $50 million investment to build a NEW state-of-the-art school on the East Side of Wilmington and fund extensive renovations at Stubbs Early Education Center and The Bayard School. #eduDE", "2020-01-22T14:50:23.000Z": "I'm at Stubbs Early Education Center with members of the General Assembly and public education advocates to announce new investments in Wilmington schools. \n\nWatch live: http:// Facebook.com/johncarneyde or http:// de.gov/live", "2020-01-22T12:51:04.000Z": "@JohnCarneyDE has proposed  $50 million to clean up Delaware's drinking #water and #waterways . #CleanWaterDE  https:// news.delaware.gov/2020/01/21/gov ernor-carney-legislators-announce-major-investments-in-clean-water/ ", "2020-01-22T01:57:37.000Z": "@RepLonghurst  @DENatureSociety  @CleanH20DE  @DelawareEstuary  @YourDNREC  @Delaware_DHSS  @SUEZwaterDE  @ACEC_Delaware  @desierraclub", "2020-01-22T01:52:59.000Z": "We are proposing $50 million in our budget to clean up Delaware's drinking water and waterways.\n\nAll Delawareans deserve clean water. \nIt's as simple as that. #CleanWaterDE VIDEO | Delaware Clean Water Trust proposed to fund water projects, address flooding and drainage... Do you just turn on the water and presume that it's safe? Some Delawareans cannot. That may change if the state enacts a proposed Clean Water Trust. wdel.com", "2020-01-21T18:24:16.000Z": "Watch live: http:// de.gov/live OR http:// Facebook.com/johncarneyde Live Event - Governor John Carney - State of Delaware Watch the live stream from Governor John Carney's events. governor.delaware.gov", "2020-01-21T18:21:09.000Z": "Today we are announcing a proposal to make a $50 million investment in clean water across Delaware. #CleanWaterDE", "2020-01-20T14:52:13.000Z": "Let's celebrate Dr. King's legacy by serving our communities, showing compassion for one another, and uniting to make Delaware a better place. #MLKDay", "2020-01-20T14:52:12.000Z": "\"If you can't fly then run, if you can't run then walk, if you can't walk then crawl, but whatever you do you have to keep moving forward.\" - Dr. Martin Luther King, Jr. \n\nWe are moving forward in Delaware. And by working together, we'll keep moving forward.", "2020-01-18T02:51:54.000Z": "Hal was a towering leader in DE and will be missed. Tracey and I are thinking about Hal's family and his many friends today. Former Wilmington mayor and congressmen Hal Haskell dies at 98 Hal Haskell served one term as Delaware's congressmen during the 1950s; and one term as mayor of Wilmington from 1969 to 1972. delawareonline.com", "2020-01-18T02:51:53.000Z": "Hal was a really good man and a good friend. Until recently, I would see Hal at the Central YMCA, and he would often stop me to share an idea or comment on issues important to our city and state.", "2020-01-18T02:51:52.000Z": "I was sad today to learn of the passing of Hal Haskell, a former Congressman and Mayor of the City of Wilmington who dedicated his career to serving the people of Wilmington and our state."}