{"2020-07-30T15:57:28.000Z": "So honored to call @THEHermanCain a friend and supporter. Saddened by his passing but know without a doubt that Herman made a significant and long lasting  impact on our state and country. #gapol", "2020-07-29T18:21:56.000Z": ". @GovKemp : As we mourn his passing, we should all recommit ourselves to the principles he fought for: our country's core foundation in liberty, freedom, and justice for all. #gapol", "2020-07-29T18:20:17.000Z": "Gov. Kemp: \"In our country's most trying moments, Congressman Lewis taught us the lesson of joyful, steadfast commitment to ideals bigger than one man or one movement.\" #gapol", "2020-07-29T13:53:23.000Z": "Hunker down, mask up, and let's stop the spread of COVID-19 in Georgia! #gapol", "2020-07-28T18:02:15.000Z": "Businesses across rural Georgia are \"in.\" Our @RuralWorksGA division has more on how our small cities and towns are looking out for their fellow neighbors by taking the #GeorgiaSafetyPromise : https:// georgia.org/newsroom/blogs /rural-georgia-businesses-protect-neighbors-commit-georgia-safety-promise ", "2020-07-27T19:47:18.000Z": "Hunker down and mask up, Georgia! #gapol Quote Tweet Georgia EM&HS @GeorgiaEMA Wearing a mask is important to slowing the spread of #COVID19 . Remember to #MaskUpGA !", "2020-07-26T00:10:04.000Z": "Great way to start the season! #ForTheA Quote Tweet Atlanta Braves @Braves Braves WIN!\n\nFinal: #Braves 5, Mets 3. #ForTheA", "2020-07-24T21:01:49.000Z": "Given the new case totals, I continue to urge Georgians to do 4 things for 4 weeks: Practice social distancing Wear a mask Wash your hands Follow @GaDPH & state guidance", "2020-07-24T21:01:48.000Z": "Today marked a new high for tests reported to @GaDPH (45,506) and a 11.2% positive rate, which is below Georgia's current 7 and 14-day average in that statistic. \n\nCurrent COVID-19 hospitalizations have remained stable this week.", "2020-07-24T17:18:04.000Z": "My goal is simple - to give a voice to the voiceless. By strengthening our laws to protect our most vulnerable, we are doing just that. Gov. Brian Kemp signs bills amending Georgia's foster care system After making it a priority for the 2020 legislative session, Gov. Brian Kemp has signed a package of legislation revamping the state's foster care system, including allowing guardians to leave foster... ajc.com", "2020-07-24T15:12:08.000Z": "Launched \"4 Things for 4 Weeks\" campaign Filed lawsuit to stop business closures Recruited, announced hundreds of new jobs\n\nHunker down and mask up! We will win this war TOGETHER! #gapol", "2020-07-24T15:12:07.000Z": "Our recent actions to protect the lives and livelihoods of all Georgians: Signed new contract to ramp up COVID-19 testing Continued partnership with hospitals to expand bed capacity Secured millions of masks for local government", "2020-07-23T19:12:58.000Z": "We are asking Georgians to do 4 things to help stop the spread of COVID-19:\n\n1. Wear a mask\n2. Practice social distancing\n3. Wash your hands  \n4. Follow the Public Health guidelines\n\nRT to spread the word. Together, we will flatten the curve & emerge stronger than ever! #gapol", "2020-07-22T23:38:55.000Z": "We are fortunate to have two great candidates for Congress in Georgia's 9th District. @MatthewGurtler and @Clyde4Congress are rock solid conservatives; either will represent Georgia well in Washington. #gapol  #ga9", "2020-07-22T20:03:50.000Z": "Human trafficking is an evil industry and we must do everything in our power to end it. #gapol Georgia Gov. Kemp signs new law to strip human traffickers of commercial driver's licenses for life Georgia Gov. Brian Kemp signed a batch of new laws Tuesday aimed at bolstering foster care and battling human trafficking in the Peach State, including a bill that will ban traffickers from driving... foxnews.com", "2020-07-22T16:21:41.000Z": "Now: @govkemp speaks as Dr. C.T. Vivian lies in state. #gapol \"During one of the most turbulent times in our nation's history, C.T. Vivian was steadfast and calm, grounded in the knowledge that he fought for something much bigger than the obstacles in front of him.\"", "2020-07-22T17:19:07.000Z": "Georgians are struggling to make ends meet. The Mayor's rollback plan will make it even harder by closing Atlanta businesses. This is NOT the time for pandemic politics. We must stand together to protect people & their paychecks! #gapol Business owners caught in middle of pandemic politics Atlanta business owners are having to decide how to make ends meet while keeping customers safe. fox5atlanta.com", "2020-07-22T12:49:32.000Z": "To stop the spread of COVID-19, we are asking Georgians to do 4 things for 4 weeks: Wear A Mask  Practice Social Distancing  Wash Your Hands  Follow Executive Order", "2020-07-22T12:07:39.000Z": "On Tuesday, I signed legislation to improve Georgia's foster care system, crack down on human trafficking, & keep our children safe. GA is a state that values life & these reforms reflect our strong commitment to protecting the most vulnerable among us. Gov. Brian Kemp signs bills amending Georgia's foster care system After making it a priority for the 2020 legislative session, Gov. Brian Kemp has signed a package of legislation revamping the state's foster care system, including allowing guardians to leave foster... ajc.com", "2020-07-21T12:10:00.000Z": "As demand for COVID-19 testing has soared across the country, many private labs have been unable to process tests quick enough to aid in contact tracing and mitigation. Some Georgians are waiting well over a week for their results, which is simply unacceptable.", "2020-07-21T11:28:40.000Z": "ICYMI: Last week, I signed several bills into law that will ensure access to healthcare for new mothers, reduce surprise medical bills, & improve health outcomes in every corner of our state. We continue to shake up the status quo & put patients first. Kemp signs bills to extend maternal Medicaid, limit 'surprise billing' Gov. Brian Kemp on Thursday signed several health care bills that, among other things, intend to regulate medical billing and extend Medicaid for new mothers during a ceremony at a Marietta hospital. ajc.com", "2020-07-20T02:08:07.000Z": "We have challenging days ahead but with a measured, balanced approach that keeps people healthy, jobs protected, and families strong, we will weather this pandemic. Together, we will recover quickly and build a safer and more prosperous future for all Georgians.", "2020-07-20T02:08:06.000Z": "Sadly, the Mayor of Atlanta violated our Executive Order & undermined economic stability in the process. She told citizens to stay at home & ordered businesses to dramatically scale back operations. Her reckless decision required swift and decisive action from the state.", "2020-07-20T02:08:05.000Z": "We are fighting to protect the lives and livelihoods of all Georgians. This is a war on two fronts, and we need everyone united to ensure victory. #gapol Georgia gov defends suit against Atlanta over rolling back reopening: 'We're fighting two battles... Georgia Republican Gov. Brian Kemp joined \"The Ingraham Angle\" Friday to discuss his lawsuit against the city of Atlanta, and accused Mayor Keisha Lance Bottoms and other local officials of \"playing... foxnews.com", "2020-07-18T13:25:46.000Z": "Congressman John Lewis was a Civil Rights hero, freedom fighter, devoted public servant, and beloved Georgian who changed our world in a profound way. The Kemp Family is praying for his loved ones as they honor his life & mourn his passing. #RIPJohnLewis John Lewis, civil rights hero, Georgia congressman, dies at 80 Georgia Congressman John Lewis died Friday after a battle with cancer. He was 80 years old. Lewis, a Democrat who represented Atlanta in Congress, played an outsized role on America's stage, includ... ajc.com", "2020-07-17T16:57:29.000Z": "Our state & country lost a giant today. Rev. C.T. Vivian was a bold leader of the Civil Rights Movement who earned a Presidential Medal of Freedom for his incredible life of service. We are praying for Rev. Vivian's loved ones as they mourn his passing. C.T. Vivian, civil rights hero and intellectual, dead at 95 One of Martin Luther King Jr.'s most valuable lieutenants, the slim and trim C.T. Vivian was known for his intellect and philosophical reasoning, as well as his wit and humor. He died at 3 a.m. on... ajc.com", "2020-07-15T12:13:09.000Z": "We are working around the clock to enhance hospital bed surge capacity, ramp up testing, and provide staffing and resources to healthcare facilities throughout our state. #gapol Governor continues to urge Georgians to wear masks as he tours new wing at Piedmont Hospital The governor says he is especially concerned about the rise in the number of younger patients. wsbtv.com", "2020-07-14T22:35:10.000Z": "Today, we announced a partnership with @PiedmontHealth to enhance hospital bed surge capacity for patients in Georgia. This is another strategic step forward in our fight against COVID-19. #gapol Georgia inks deal with Piedmont Healthcare for expanded bed capacity ajc.com", "2020-07-13T21:27:24.000Z": "Mask Up & Go Dawgs! Quote Tweet Georgia Football @GeorgiaFootball New Profile Picture", "2020-07-13T19:53:44.000Z": "Georgia is a state that values life and our fight to protect the innocent unborn is far from over. #gapol  https:// ajc.com/news/state--re gional-govt--politics/federal-judge-throws-out-georgia-anti-abortion-law/WKIkpZp5AUFvP6o43T99FK/ ", "2020-07-12T14:02:14.000Z": ". @GRAToday is working hard to protect lives & livelihoods across our great state. Let's do our part to help GA restaurant owners & employees weather the pandemic by eating locally. Together, we will emerge from this stronger than ever! #gapol Georgia Restaurant Association says it will follow Kemp?s guidelines, allow restaurants to stay open The organization issued a statement Saturday saying it remains supportive of Gov. Brian Kemp?s executive order to allow restaurants to reopen, despite Mayor Keisha Lance Bottoms announcement she was... ajc.com", "2020-07-11T15:40:50.000Z": "We stand with our men and women in uniform who act with integrity, serve with compassion, and sacrifice their lives to protect our families and communities.", "2020-07-11T13:35:50.000Z": "\"This is not just a drug bust. This is the disruption of a criminal element.\" #gapol 48 charged in NE Georgia drug trafficking busts, GBI says ajc.com", "2020-07-09T13:32:29.000Z": "Great reminder from hospital leaders about the 3W's that can help us protect the lives and livelihoods of all Georgians:\n\n1. Wear a Mask\n2. Wash your Hands \n3. Watch your Distance\n\nRT to spread the word! #gapol Opinion: 3W's that can keep you safe from COVID-19 ajc.com", "2020-07-09T02:48:05.000Z": "To keep our friends and neighbors safe from COVID-19, we have to do our part. It's time to mask up, Georgia! #gapol", "2020-07-08T14:20:22.000Z": "ICYMI: Georgia Gov. Brian Kemp launches campaign for COVID-19 safety awareness #gapol Georgia Gov. Brian Kemp launches campaign for COVID-19 safety awareness Gov. Brian Kemp's office has launched a marketing campaign for Georgia businesses to show they are keeping up good social distancing, sanitizing and masking practices amid the COVID-19 pandemic. gwinnettdailypost.com", "2020-07-08T13:41:45.000Z": "Free #COVID19 testing is available with an appointment for all Georgians regardless of whether symptoms are present. You can find a testing site near you and schedule an appointment by calling the Direct Patient Line for your @GaDPH District. COVID-19 Testing/Direct Patient Lines Testing is available to all Georgians who request it, whether they have symptoms or not. Individuals wanting to be tested can contact any Georgia public health department to schedule an appointment... dph.georgia.gov", "2020-07-08T00:03:06.000Z": "Today, I encouraged local leaders throughout our state to join us in the fight against COVID-19. With a unified voice, we will encourage all Georgians to wear a mask, wash their hands, practice social distancing, & heed the advice of public health officials.", "2020-07-07T00:17:44.000Z": "Peaceful protests were hijacked by criminals with a dangerous, destructive agenda. Now, innocent Georgians are being targeted, shot, and left for dead. This lawlessness must be stopped and order restored in our capital city.", "2020-07-05T16:51:01.000Z": "In Georgia, we stand against violence and with law enforcement. Rest assured, these criminals will be held accountable for their destructive and dangerous behavior. #gapol Group vandalizes state public safety HQ, causes 'extensive damage' ajc.com", "2020-07-04T14:03:11.000Z": "We are fortunate to live in a country w/ unmatched liberty & opportunity for all Americans. During these challenging times, I urge you to use your freedom for good. Do the right thing & let's stop the spread of COVID-19. Happy Independence Day & God Bless America! #gapol  #July4th", "2020-07-03T18:17:33.000Z": "This weekend, we celebrate our country's independence, thank those who have protected our freedom, and re-affirm our commitment to this nation's highest ideals. Together, we will preserve the American Dream for generations to come. #July4th  #gapol", "2020-07-03T16:27:50.000Z": "Surgeon General @JeromeAdamsMD :\"Wearing a face covering or a mask is not a restriction of your freedom As a matter of fact, this is an instrument of freedom because we know if we wear face coverings we will have less spread in our communities & more places will be open.\" #gapol", "2020-07-02T12:07:21.000Z": "Good morning, Georgia. @GovKemp & I have an important message for you. #COVID19", "2020-07-02T20:52:33.000Z": "We all agree that it's a good idea to wear a mask. I have great trust in our citizens to heed the call and do the right thing. Georgians came together before to help flatten the curve, and we will do it again to stop the spread. (Video Credit: @WRDW_WAGT ) #gapol", "2020-07-02T20:43:27.000Z": "The Kemp Family is praying for our friend and fellow Georgian, @THEHermanCain ! #gapol Atlanta's Herman Cain hospitalized with COVID-19 ajc.com", "2020-07-02T20:39:09.000Z": "To stop the spread of COVID-19, we each have to do our part. By wearing a mask and following the guidance provided by public health officials, we can protect the lives - and the livelihoods - of Georgians in every part of our great state. #gapol Kemp on COVID tour: Take individual responsibility, wear masks in public Gov. Brian Kemp made a stop in Dalton on his \"Wear a Mask\" flyover tour Thursday morning. Joined by U.S. Surgeon General Vice Admiral Jerome M. Adams and Georgia Department northwestgeorgianews.com", "2020-07-02T20:29:11.000Z": "Honored to have Surgeon General Dr. @JeromeAdamsMD travel with us today as we urge Georgians to do their part to stop the spread of COVID-19 in Georgia. #gapol Kemp, US Surgeon General stress wearing masks as a way to get college football, Masters in fall Before their scheduled visit in Augusta on Thursday, Georgia Gov. Brian Kemp and US Surgeon General Jerome Adams had a simple message: wear a mask or no football this fall. wrdw.com", "2020-07-02T13:00:11.000Z": "ICYMI: Gov. Kemp says people need to 'hunker down' and wear masks #GoDawgs  #gapol Gov. Kemp says people need to 'hunker down' and wear masks One of UGA's biggest fans warned that the college football season is at risk if more people don't start wearing masks. That fan is Brian Kemp, governor for the state of Georgia. \"If people, especia... dawgnation.com", "2020-07-01T12:44:12.000Z": "HB 987 strengthens our collective efforts to protect elderly Georgians in these unprecedented times. #gapol Kemp signs bill to bring sweeping reforms to senior care in Georgia Georgians living in senior care homes won new protections Tuesday when Gov. Brian Kemp signed a bill to reform an industry that too often failed to provide adequate care. The laws apply to assisted... ajc.com", "2020-06-30T15:23:12.000Z": "Masks help #slowthespread of COVID-19. Masks/face coverings act as simple barriers to help prevent respiratory droplets from traveling in the air and onto other people when the person wearing the mask coughs, sneezes, talks, or raises their voice. https:// bit.ly/2CVXp7v", "2020-06-30T13:42:02.000Z": "Ahead of the July 4 holiday, we are traveling the state to urge folks to wear a mask, practice social distancing, wash hands regularly, & follow the guidance provided by health officials. Let's do the right thing & stop the spread of COVID-19 in GA! #gapol Kemp extends COVID-19 restrictions, plans statewide tour to encourage mask use The state's coronavirus restrictions were set to expire on Wednesday, July 1.", "2020-06-29T15:55:06.000Z": "Wear a mask, practice social distancing, wash your hands, and continue to follow the guidance provided by public health officials. Together, we can protect the lives - and livelihoods - of all Georgians! #gapol", "2020-06-29T15:55:05.000Z": "While encouraged by our progress (hospital surge capacity, increased testing, PPE availability, etc.), the fight against COVID-19 is far from over.", "2020-06-29T09:03:23.000Z": "ICYMI: 'SK innovation' plans $940 million expansion in Georgia #gapol 'SK innovation' plans $940 million expansion in Georgia A battery company plans a $940 million expansion of a manufacturing plant in Georgia, Gov. Brian Kemp's office said Thursday. fox5atlanta.com", "2020-06-27T14:14:56.000Z": "ICYMI: 'Georgia is too great to hate': Kemp signs hate crimes bill #gapol 'Georgia is too great to hate': Kemp signs hate crimes bill Georgia has made history, joining nearly all U.S. states with hate crime laws. wsav.com", "2020-06-25T18:47:58.000Z": "We are STILL in this fight together. Do the right thing and let's protect the lives - and livelihoods - of all Georgians! #gapol Gov. Kemp says despite progress, 'deadly' virus 'remains a threat' He encouraged Georgians to wear a mask and practice social distancing.", "2020-06-25T18:40:10.000Z": "ICYMI: Milletech Systems Inc. to move operations to Georgia, create 465 jobs in Fulton County #gapol Tech company set to bring over 400 jobs to Atlanta ATLANTA, Ga. (CBS46) -- A woman-owned, Georgia State Minority certified, business is making its way to Atlanta, and is bringing with it over hundreds of new high-tech jobs. cbs46.com", "2020-06-25T18:33:08.000Z": "For years, cartels have used GA as a distribution hub for drugs, weapons, & lives. By working in coordination w/ fed, state, & local law enforcement, we are dismantling their supply chain & protecting communities from dangerous, violent criminals. #gapol 47 charged after massive drug busts net $1.7 million worth of meth ajc.com", "2020-06-25T00:40:22.000Z": "While I'm proud of our swift response to COVID-19 & measured steps forward, we cannot grow complacent. Wear a mask, practice social distancing, & continue to follow guidance from health officials. Stay vigilant to keep our communities safe! #gapol With recent spike in cases, Gov. Kemp urges Georgian's to stay vigilant in COVID-19 fight Georgia's governor is urging residents to \"remain vigilant\" in the fight against COVID-19 following a recent spike in confirmed positive cases. fox5atlanta.com", "2020-06-24T17:31:21.000Z": "We are making strong progress in the fight against COVID-19 but now is NOT the time to rest on our laurels. Stay vigilant, follow the guidance, and let's stop the spread together! #gapol Quote Tweet Governor Brian P. Kemp @GovKemp Please watch this video for an update on COVID-19 from Governor Kemp.", "2020-06-24T12:43:50.000Z": "Exciting news yesterday from @HHS_ASH . @Morehouse will \"lead the initiative to coordinate a strategic network of...organizations to deliver COVID-19-related information to communities hardest hit by the pandemic.\" #gapol Morehouse School of Medicine receives $40 million to fight COVID-19 in vulnerable communities The U.S. Department of Health and Human Services of Minority Health selected Morehouse School of Medicine as the recipient of a new $40 million initiative to fight COVID-19 in racial and ethnic... wsbtv.com", "2020-06-23T19:15:10.000Z": "SB 435, the Survivors First Act, was just passed by the House and is headed to @GovKemp 's desk for signature. My thanks to Representative @BonnieRichForGa , Senator @StricklandForGA , and their co-sponsors!", "2020-06-23T15:30:41.000Z": "While much has changed over the last several months, my priorities remain the same. To keep our state moving forward & minimize the long-term impact of COVID-19 on students, I strongly recommend that we cont. to prioritize public school education. #gapol  https:// ajc.com/news/state--re gional-govt--politics/kemp-releases-new-revenue-estimate-seeks-reduction-school-cuts/GlhhQPGhyhPcwGuQRUPxPM/ ", "2020-06-21T11:22:08.000Z": "God blessed me w/ three daughters - Jarrett, Lucy, & Amy Porter. I am so proud of their many accomplishments, hard work, & strong commitment to public service. While honored to serve as your Governor, \"Dad\" remains my favorite job and title to date. Happy Father's Day! #gapol", "2020-06-19T10:44:08.000Z": "Appreciate Dwayne Gilbert's service to our state and nation. Applaud his commitment to family, friends, and the #DawgNation . Prayers for his loved ones as they celebrate a life well lived! #GoDawgs Dwayne Gilbert, who attended 508 straight UGA football games, passes away at 93 In his lifetime, Dwayne Gilbert was many things - a Depression-era baby, a U.S. Marine during World War II, A Georgia State Trooper, the sheriff (on two occasions) of Spalding County, a U.S. Marsha... onlineathens.com", "2020-06-19T10:21:47.000Z": "Encouraging news from the Georgia Department of Labor but there's more work to be done. Stay safe, support your local businesses, and keep choppin'. Together, we will revive our economy and ensure a prosperous future for ALL Georgians! #gapol Georgia's unemployment rate drops in May The state preliminary unemployment rate fell to 9.7% in May, down 2.9% from 12.6% in April, and more than 144,000 people returned to work during May compared to the previous month, the Georgia... savannahnow.com", "2020-06-18T18:19:35.000Z": "\"Blessed are the peacemakers: for they shall be called the children of God.\" - Matthew 5:9 #gapol  #BackTheBlue Quote Tweet Governor Brian P. Kemp @GovKemp Georgia backs the Blue! https:// youtu.be/FcSbyZuwVaA", "2020-06-18T14:39:13.000Z": "John Waggoner was a great American who served as the Mayor of Colbert for 41 years. He is the definition of a public servant and will be missed greatly by his community and those who were honored to call him a friend. #gapol John Waggoner 1935 - 2020 - Obituary View John Waggoner's obituary, send flowers and sign the guestbook. legacy.com", "2020-06-18T14:35:31.000Z": "Congratulations to Peachtree Ridge alum and @BaseballUGA shortstop Cam Shepherd on signing with the @Braves ! #ForTheA  #GoDawgs Braves sign Georgia shortstop Cam Shepherd as undrafted free agent ajc.com", "2020-06-17T12:08:27.000Z": ". @champbailey is a Damn Good Dawg who has definitely earned a spot in the @cfbhall . Best of luck, Champ. The #DawgNation is proud of you! Georgia football legend Champ Bailey named to 2021 College Football Hall of Fame ballot ATHENS - Former Georgia football All-American defensive back Champ Bailey was among the names announced on the 2021 College Football Hall of Fame ballot on Tuesday. The National Football Foundation... dawgnation.com", "2020-06-14T16:11:56.000Z": "Happy Birthday to the @USArmy ! So grateful for our American heroes who have served this great nation! #gapol Quote Tweet GA National Guard @GeorgiaGuard Today, we recognize the @USArmy 's 245 years of bravery, commitment and service. #ArmyBday  #ServeWithHonor", "2020-06-14T16:09:47.000Z": "On #FlagDay , we remember our nation's story and the challenges faced along the way. We honor our heroes who answered the call of duty to protect freedom and opportunity for generations to come.", "2020-06-14T16:08:48.000Z": "RT to join me in wishing President @realDonaldTrump a very, Happy Birthday! #gapol", "2020-06-13T14:46:46.000Z": "Thanks to multiple partnerships, we have tested 97% of nursing home patients in GA. Our aging population is the most vulnerable in the fight against COVID-19 & this new milestone highlights our cont. efforts to keep these Georgians safe & healthy. #gapol Georgia says 97 percent of nursing home residents have now been tested The governor said that across all long-term care facilities, 74% of residents and 54% of staff members have been tested for COVID-19.", "2020-06-12T16:16:41.000Z": "We continue to take measured steps forward in the fight to stop COVID-19 and re-vive Georgia's economy. Stay safe, buy local, and let's emerge from this pandemic stronger than ever! #gapol Gov. Kemp lifts more COVID-19 restrictions for restaurants, conventions and concert venues The governor has decided to reopen some live music venues and allow buffets to return to restaurants. wsbtv.com", "2020-06-09T01:03:27.000Z": "What an honor to host @GOPconvention CEO @Marcialeekelly in Georgia today. We toured the @SAVConvCenter , Historic District, and several of the local hotels. We appreciate the opportunity to show why Savannah is called the \"Hostess City of the South!\" #gapol", "2020-06-06T13:21:05.000Z": "\"At the core, the American citizen soldiers knew the difference between right & wrong, & they didn't want to live in a world in which wrong prevailed. So they fought, & won, & we, all of us, living & yet to be born, must be forever profoundly grateful.\" - Stephen Ambrose #DDay", "2020-06-06T13:18:52.000Z": "On June 6, 1944, Allied forces stormed the beaches of Normandy to liberate Europe from tyranny. 76 years later, we remember those soldiers who sacrificed everything to ensure freedom for generations to come. Now, more than ever, we seek to live in a way that honors their service.", "2020-06-06T13:16:58.000Z": "RT to join me in thanking the @GeorgiaGuard for their service to this state and country. We are forever grateful for these brave and hardworking Georgians! #gapol Quote Tweet GA National Guard @GeorgiaGuard Always ready...always there. Your Georgia National Guard. #GeorgiaStrong  #InThisTogether  #SharedPurpose", "2020-06-05T17:45:39.000Z": "I remain optimistic that as we take measured steps forward in re-opening GA, our outlook - & our state revenues - will continue to improve. By prioritizing education, healthcare, & public safety, we can ensure that our best days are still to come. #gapol Gov. Kemp to scale back budget cuts ATLANTA - Citing \"reassuring signs of fiscal resilience\" in Georgia, Gov. Brian Kemp announced Wednesday, June 3, that cuts to next year's state budget won't be as deep as originally northwestgeorgianews.com", "2020-06-05T17:42:51.000Z": "Businesses throughout Georgia have stepped up in the fight against COVID-19. Big shoutout to High Performance Product Engineering in Columbus for producing hand sanitizer in this time of need! #gapol Gov. Brian Kemp visits Columbus plant making sanitizer, calls it 'a hell of a story' Two months ago, Georgia Gov. Brian Kemp put out the call for companies to produce essential items needed in the fight against the COVIDD-19 virus. One Columbus company, High Performance Product Eng wrbl.com", "2020-06-03T13:54:16.000Z": "Proud of our @GA_DOI Commissioner John King for longstanding commitment to public service. Please join us in praying for General King and his team during their deployment. #gapol Georgia insurance chief to deploy again for National Guard duties ajc.com", "2020-06-02T23:26:41.000Z": "For those who are here to infiltrate peaceful gatherings and cause chaos: You are in the wrong state. We will not tolerate your dangerous, destructive, or violent behavior. We will do what's necessary to preserve peace and keep Georgians safe. #gapol GBI: Intelligence shows out-of-state organizations came to create problems during Atlanta protests Gov. Brian Kemp reiterated his support for the peaceful protests during an afternoon news conference Tuesday, but he also warned the non-peaceful ones that they will not stand down. wsbtv.com", "2020-06-02T23:25:35.000Z": "We're in this fight together: The fight against COVID-19. The fight to revive our economy. And the fight to ensure liberty and justice for all. Please pray for our state and country. Pray for peace and for a better, brighter tomorrow. #gapol 'A precarious point' Kemp calls for calm in Georgia ahead of more protests ajc.com", "2020-06-02T02:09:45.000Z": "Georgia National Guard chaplain of the 201st Regional Support Group, Captain Paul McCabe, pray with Soldiers after they patrolled streets during protests in Atlanta.", "2020-06-01T02:06:46.000Z": "Members of the @GeorgiaGuard have been stationed at Centennial Olympic Park throughout the night to provide support, ensure peaceful assembly, and enforce the curfew that is now in effect.", "2020-06-01T01:08:38.000Z": "Scenes from Centennial Park as Georgia National Guardsmen stand with local law enforcement to maintain peace in downtown Atlanta, Georgia, May 31, 2020. \n\nU.S. National Guard photos by Major William Carraway.", "2020-05-31T23:50:29.000Z": "Saddened by the loss of Col. @OscarPooleBBQ . He was a fixture in the Georgia Republican Party, served incredible BBQ, and delivered so much joy to his loved ones and customers. The \"Colonel Sanders of Barbeque\" will be sorely missed. His family is in our prayers. #gapol", "2020-05-31T22:00:03.000Z": "Guardsmen arrive at Centennial Park to ensure protesting remains peaceful and safe for all citizens.", "2020-05-31T22:03:36.000Z": "Members of the Georgia National Guard stand alongside local law enforcement at the state captiol to ensure citizens are safe and protected as they exercise their right to protest peacefully.", "2020-05-31T15:40:17.000Z": "The @GeorgiaGuard", "2020-05-31T12:18:48.000Z": "\"Don't be afraid, for I am with you. Don't be discouraged, for I am your God. I will strengthen you and help you. I will hold you up with my victorious right hand.\" - Isaiah 41:10\n\n( : January 13, 2019)", "2020-05-30T23:43:53.000Z": "Due to Mayor Bottoms' executive order establishing a citywide curfew at 9 p.m., trains will be ending service early tonight until further notice. The last departures are as follows: Indian Crk 8:40 p.m., H.E. Holmes 8:41 p.m., Vine Cty 8:2... http:// ma.v12.net/m?136116", "2020-05-31T00:05:15.000Z": "Georgia Army National Guardsmen continue to observe protests that are taking place in Atlanta May 30, 2020.\n\nU.S. Army National Guard photo by Major William Carraway.", "2020-05-30T23:44:23.000Z": "The Governor addresses Department of Corrections Joint Specialty Units at GEMA/DPS Headquarters. They are trained for highly complex situations and ready for assignment if needed.", "2020-05-30T23:40:21.000Z": ". @GeorgiaGuard troops are out at the Governor's Mansion on West Paces Ferry Road, ready to keep the peace and ensure nonviolent protests.", "2020-05-30T20:41:41.000Z": "Georgia National Guard MPs heading to downtown #Atlanta on I-20", "2020-05-30T21:45:02.000Z": "\"This was an opportunity for Georgians to honor the life of George Floyd, to demand justice and fair treatment under the law. This was not a time to burn police cars, destroy local businesses and create fear in the hearts of nearby Georgians.\" #gapol Quote Tweet Governor Brian P. Kemp @GovKemp Please watch this video for a message from Governor Kemp regarding recent protests in Atlanta. https:// m.youtube.com/watch?v=Ar2sjU BXqlQ ", "2020-05-30T21:46:45.000Z": "Military Police of the Georgia Army National Guard assemble at locations across Atlanta to ensure public safety, May 30, 2020.\n\nU.S. National Guard photos by Major William Carraway", "2020-05-30T21:39:09.000Z": "This is not a time for violence. This is chance for us to unite. Too much has been destroyed. Let's build a safer, stronger Georgia together. I know the days ahead won't be easy. But we are Georgians and it can be done. #gapol A Message from Governor Brian P. Kemp Please watch this video for a message from Governor Kemp regarding recent protests in Atlanta. facebook.com", "2020-05-30T21:36:40.000Z": "We will do our part - in conjunction w/ local leaders- to plan, mobilize, & respond appropriately to threats that undermine public safety. We will not back down from those who peddle conflict & chaos. We will do what's necessary to keep the peace. #gapol A Message from Governor Brian P. Kemp Please watch this video for a message from Governor Kemp regarding recent protests in Atlanta. facebook.com", "2020-05-30T04:09:42.000Z": "They will deploy immediately to assist @ga_dps , @GaDNRLE , @GA_Corrections & local law enforcement who are working tirelessly to subdue unlawful activity & restore peace. We will continue to make all state resources available to local leaders during this emergency situation. (2/2)", "2020-05-30T04:09:41.000Z": "At the request of Mayor @KeishaBottoms & in consultation with public safety & emergency preparedness officials, I have issued a State of Emergency for Fulton County to activate as many as 500 @GeorgiaGuard troops to protect people & property in Atlanta. (1/2)", "2020-05-29T16:29:38.000Z": "ICYMI: Kemp describes COVID-19 war as a battle on 2 fronts: Health and business https:// wrdw.com/nbc26/content/ news/Kemp-describes-COVID-19-war-as-a-battle-on-2-fronts-Health-and-business-570830101.html   #gapol", "2020-05-28T15:21:43.000Z": "To enhance hospital surge capacity, we ordered temporary medical units for key regions of our state. With hospitalizations of COVID-19 patients declining, I am proud to report that Navicent Health in Macon has yet to use this overflow space. #gapol Gov. Kemp says temporary medical units can fight COVID-19, but are also a future investment Governor Brian Kemp came to Macon Wednesday to tour Navicent Health's temporary medical units.", "2020-05-25T11:31:13.000Z": "Today, we honor and remember our fallen soldiers. These American heroes paid the ultimate price for our freedom and we are forever grateful for their service and sacrifice. #gapol  #MemorialDay2020", "2020-05-24T17:10:05.000Z": "The Kemp Family is praying that @AllenWest has a swift recovery. Great to hear that he's heading home soon! #gapol Quote Tweet Allen West @AllenWest Team West update:\n\nLTC West is resting and in stable condition. We anticipate him being released tomorrow and heading home. Thank you for your prayers and support. He will be taking a week off to recoup and looks forward to seeing you all again soon. #PrayersForAllen", "2020-05-23T20:28:20.000Z": "My oldest daughter, Jarrett, had a great time picking strawberries and supporting #GeorgiaGrown at Moon Farms in Colbert! #gapol", "2020-05-23T11:20:00.000Z": ". @VP : \"In a very real sense, I think history will record that Georgia helped lead the way back to a prosperous American economy.\" #gapol In Atlanta, Pence calls Georgia's reopening an 'example to the nation' ajc.com", "2020-05-23T01:06:40.000Z": "I wholeheartedly agree with @realDonaldTrump : Places of worship - especially during these difficult times - are ESSENTIAL! #gapol", "2020-05-23T00:33:04.000Z": "Georgia's First Lady Marty Kemp and Junior Senator @KLoeffler supporting our state's business community and workforce! #gapol", "2020-05-22T17:26:23.000Z": ". @GAFirstLady and I are honored to welcome Vice President @Mike_Pence back to Georgia! #gapol", "2020-05-22T15:58:10.000Z": "Welcome to Georgia Vice President @mike_pence ! \n\nSupporters from across the state are greatful for the excellent job President @realDonaldTrump and our @VP are doing to #ReOpenAmerica !  #gapol  #MAGA", "2020-05-22T00:49:03.000Z": "Today, @AUG_University announced a partnership w/ @SharecareInc to launch http:// wellbeinggeorgia.com , which provides COVID-19 resources & directs traffic to the AU Health ExpressCare app for free virtual screenings, 24/7 w/ no appointment required. #gapol Sharecare, Augusta University forge public-private partnership to accelerate Georgia's recovery... Sharecare announced a strategic partnership with Augusta University and Augusta University Health to support Gov. Brian Kemp's efforts to better inform Georgians about the COVID-19 pandemic while... jagwire.augusta.edu", "2020-05-22T00:41:26.000Z": "ICYMI: Georgia reached another important milestone this week. As of 1PM today, we have less than 1,000 COVID-19 patients hospitalized in our state. That's a 38% drop since May 1. #gapol Gov. Kemp: Less than 1,000 people hospitalized with COVID-19 throughout state WATCH the news conference LIVE on Channel 2 Action News, streaming on WSB Now on your on your Roku, Amazon Fire and Apple TV. wsbtv.com", "2020-05-21T16:07:51.000Z": "\"Georgia showed that an effective response is possible without tyranny. The separation of powers is one of the principles that led to America's greatness. It works, and it's how it's done in Georgia.\" #gapol Avella and Dugan: Georgia vs. coronavirus - these principles of democracy made all the difference Michigan Gov. Whitmer's actions are merely one example of a politician using dire circumstances to arbitrarily infringe on the freedoms of those they claim to govern. foxnews.com", "2020-05-19T21:19:26.000Z": "In Georgia, 986 COVID-19 positive patients are currently hospitalized. That's a 34% decrease since May 1. While these numbers are encouraging, we must remain focused on our efforts to combat this dangerous virus. Georgia's COVID-19 hospitalizations drop by a third, state's data shows ajc.com", "2020-05-16T21:50:03.000Z": "ICYMI: App from @AUG_University offers streamlined COVID-19 testing http:// ow.ly/2H3A50zI44u  #gapol App from Augusta University offers streamlined COVID-19 testing The app allows Georgians to speak virtually with a medical professional and get a referral to be tested for COVID-19.", "2020-05-16T19:10:06.000Z": "Great feature on Georgia's sign language interpreter, David Cowan. He has played a vital role in our fight against COVID-19. We truly appreciate his service! http:// ow.ly/Z1Ut50zI43R  #gapol Meet the breakout star of Governor Kemp's press conferences: sign language interpreter David Cowan David Cowan's expressive style of signing frequently captures the public's attention-most recently when he was interpreting onstage at Governor Brian Kemp's coronavirus press conferences. atlantamagazine.com", "2020-05-16T15:50:05.000Z": "I'm proud of what we've done to battle the COVID-19 hotspot in Northeast Georgia but local government, business, and community leaders deserve all the credit. They are working around the clock to stop the spread and it's working! http:// ow.ly/QSbl50zI3I1  #gapol Kemp praises \"good people of Gainesville\" during community tour Governor Brian Kemp's message to the community following his tour of Hall County on Friday was two-fold- thanking community members for their hard work and encouraging them to keep it up. accesswdun.com", "2020-05-16T14:03:24.000Z": "We have worked for weeks to provide resources and support to Hall County as they battle the spread of COVID-19 in the chicken processing industry. Now, new cases of COVID-19 among local poultry workers have dropped 75%. http:// ow.ly/3ZB150zI3EW  #gapol Kemp touts gains made in Hall County COVID-19 hotspot Gov. Kemp visits poultry plant and COVID-19 testing site", "2020-05-16T12:57:24.000Z": "Inspirational story, especially during these difficult days, about the power of persistence, faith, and hard work. Congratulations to Shedrick Wynn on graduating from the @universityofga . Go Dawgs! http:// ow.ly/3RFF50zI2iV  #gapol  #DGD Cedar Shoals football assistant, former UGA player shows power of persistence ATLANTA (AP) - For all its ills, there are times when college athletics gets it just right.Meet Shedrick Wynn, who arrived at Georgia in 1999 to play football but never finished his college degree.... onlineathens.com", "2020-05-14T15:11:56.000Z": "While I am proud of our progress in the war against COVID-19, the fight is not over. Stay vigilant, practice social distancing, follow CDC guidance, and do your part to keep the most vulnerable among us healthy. http:// ow.ly/fkt850zGhlQ  #gapol Kemp: Positive trends continue in battle against virus ATLANTA | Georgia's governor said he continues to see positive signs in the state's battle against the coronavirus, even as the state's death toll from the virus surpassed 1,500 and some health... onlineathens.com", "2020-05-13T12:01:26.000Z": "In Georgia, COVID-19 hospitalizations, ventilator use, and the percentage of positive cases continue to drop. However, we remain vigilant in the fight against this dangerous virus.", "2020-05-11T23:58:25.000Z": "I'm proud to call Mike a fraternity brother, fellow Dawg, & close friend. We spent days on his family's farm - working, hunting, & making memories. There's no doubt, he lived every day to the fullest. Our prayers are w/ the Malcom Family as they mourn. Michael Malcom Obituary - Athens, GA Celebrate the life of Michael Malcom, leave a kind word or memory and get funeral service information care of Bernstein Funeral Home and Cremation Services. dignitymemorial.com", "2020-05-10T23:31:28.000Z": "Encouraging data as we battle COVID-19 in GA: Lowest # of COVID-19 patients hospitalized (1,203) Lowest # of ventilators in use (897) 110k tested in the last 11 days w/ testing available for all Georgians Declining percentage of Georgians testing positive (14%)", "2020-05-09T21:55:04.000Z": "Great partnership between @PSHP and @QuestDX to deliver 1,000 COVID-19 test kits each week to Federally Qualified Health Centers in our state! http:// ow.ly/Iyas50zBzhh  #gapol", "2020-05-09T19:00:18.000Z": "Thanks to our partnership w/ @AUG_University , we have rapidly expanded COVID-19 testing capacity. Now, all Georgians are eligible. To begin the process, call (706) 721-1852, visit http:// ow.ly/C14950zBzeA , or download the AU Health ExpressCare app. http:// ow.ly/o0fJ50zBzel  #gapol", "2020-05-09T16:50:05.000Z": "Today, the number of COVID-19 patients currently hospitalized (1,203) and the # of ventilators in use (897 w/ 1,945 available) is the LOWEST since hospitals began reporting this data on April 8, 2020. http:// ow.ly/eBcA50zBzBJ  #gapol Context on the numbers: What hospitalization numbers reveal about COVID-19 spread in Georgia Kemp said that Saturday marked the lowest number of COVID-19 positive patients currently hospitalized statewide since the data started being reported April 8.", "2020-05-09T15:58:03.000Z": "\"Not only has the virus curve flat­tened in the Peach State. Data from the last 14 days show a wel­come trend of de­clin­ing new cases & deaths. And GA even has an an­swer for the crowd that de­mands more test­ing be­fore un­lock­ing lib­erty.\" http:// ow.ly/zvNo50zBz1g  #gapol Opinion | The Georgia Model An encouraging escape from lockdown. wsj.com", "2020-05-08T14:21:18.000Z": "ICYMI: Gov. Kemp says there are enough coronavirus tests and urges all Georgians to take one http:// ow.ly/N1j750zALoR  #gapol Gov. Kemp says there are enough coronavirus tests and urges all Georgians to take one This comes as every county in the state is now reporting confirmed cases of COVID-19. wsbtv.com", "2020-05-06T15:45:13.000Z": "Great national story on our partnership with @AUG_University . Together, we are enhancing access to COVID-19 testing and boosting capacity throughout Georgia. http:// ow.ly/D1Bp50zyxRd  #gapol Augusta University aids state's COVID-19 response Augusta University is responding quickly to the state's COVID-19 testing needs. There are Georgia Army National Guard personnel on campus doing pre-screening and dental residents 3-D printing nasal... news.yahoo.com", "2020-05-06T13:18:33.000Z": "ICYMI: Kemp visits Albany, tours Phoebe facility -> http:// ow.ly/mTET50zytSt  #gapol", "2020-05-05T19:35:04.000Z": "With over 50 testing sites, record high hospital surge capacity, reduced number of hospitalized patients, and a drop in the percentage of Georgians testing positive, we are making progress in this war against COVID-19 by working TOGETHER! #gapol", "2020-05-04T14:17:15.000Z": "Check out my new OpEd in the @AUG_Chronicle about our efforts to enhance COVID-19 testing in Georgia -> Column: AU is crucial to successful COVID-19 testing For weeks, testing was our Achilles' heel as we fought COVID-19 in Georgia. The status quo was unacceptable and undermined our efforts to keep Georgians safe, so we launched countless initiatives to... augustachronicle.com", "2020-05-03T12:09:44.000Z": "While these are difficult days in our great state, we are making progress: Declining percentage of Georgians testing positive for COVID-19 Record number of Georgians tested New testing opportunities for vulnerable populations", "2020-05-02T17:22:38.000Z": "We are fighting two wars and the outcomes of both have incredible impact on the future of our great state. http:// ow.ly/6xBS50zv0nd  #gapol Gov. Kemp says state is battling 2 wars: Coronavirus and the economy Kemp said he is well aware of those who have loudly opposed his partial opening of the economy last week. wsbtv.com", "2020-04-29T14:40:56.000Z": "ICYMI: In Georgia, testing hit a record high, ventilator use is at a record low, hospital bed capacity is strong, and @GaDPH data continues to trend in the right direction. http:// ow.ly/86NZ50zrVgQ  #gapol Department of Health numbers show Georgia's COVID-19 curve flattening Gov. Brian Kemp says the use of ventilators is at a low point following the height of the pandemic in Georgia. wsbtv.com", "2020-04-29T14:34:47.000Z": "On Tuesday, we set a testing record in Georgia. While proud of our efforts to boost testing capacity and expand access, there's more work to be done. Gov. Kemp: More Georgians tested for COVID-19 today than any other day The state of Georgia has seen more people tested for COVID-19 today than any other single day during the pandemic, according to Governor Brian Kemp. wtvm.com", "2020-04-28T12:51:07.000Z": "Strong surge capacity in Georgia hospitals Continued mobilization of the Georgia Guard Additional resources for frontline workers New COVID-19 Dashboard to track data", "2020-04-28T12:51:06.000Z": "During Monday's press conference, we announced: Increased total testing Enhanced testing capacity New partnership to improve testing access", "2020-04-28T12:45:32.000Z": "ICYMI: Kemp announces new mobile testing initiative for Georgia http:// ow.ly/DeFq50zqBXp  #gapol Kemp announces new mobile testing initiative for Georgia As the state begins to loosen restrictions in place to stem the coronavirus outbreak, Gov. Brian Kemp is announcing a new mobile testing initiative for Georgia communities without easy access to test washingtontimes.com", "2020-04-27T15:45:15.000Z": "On Monday, April 27, state officials and faith leaders from across Georgia will participate in a Day of Prayer service. Please join us via livestream at 10AM ( http:// fb.com/GovKemp ) as we pray for God's continued protection, guidance, and grace. #gapol", "2020-04-27T13:05:15.000Z": "Lots of Georgia athletes taken in the #NFLdraft . Proud of these hardworking men for their efforts on the field and look forward to seeing what they accomplish next. Praying for their success and safety! http:// ow.ly/hbAD50zoPKT  #gapol Players from Georgia colleges, high schools taken in 2020 NFL draft ajc.com", "2020-04-26T15:28:59.000Z": "As GA takes measured steps forward, we remain laser focused on testing in our state. Through this partnership w/ Walmart, eTrueNorth, & local communities, we will expand access and continue to protect the lives - and livelihoods - of all Georgians. http:// ow.ly/n3v450zoPyz  #gapol Kemp, Walmart, eTrueNorth announce mobile COVID-19 testing initiative for GA CSRA residents Atlanta, GA - Today Governor Brian P. Kemp announced the launch of a mobile COVID-19 testing initiative to set up drive-thru sites in communities without access to testing. Beginning Monday,  wjbf.com", "2020-04-25T19:37:08.000Z": "Congratulations to Georgia's own, @FrommJake ! Best of luck in the @NFL ! #godawgs  #gapol Quote Tweet Georgia Football @GeorgiaFootball There he goes. @FrommJake is officially a Buffalo Bill. #NFLDraft  LIVE: @ESPN , @ABCNetwork , @NFLNetwork", "2020-04-24T22:10:06.000Z": "ICYMI: Media Criticism of Governor Kemp for Reopening Georgia Is Dishonest and Hypocritical http:// ow.ly/gNdk50znG5J  #gapol Media Criticism of Governor Kemp for Reopening Georgia Is Dishonest and Hypocritical pjmedia.com", "2020-04-24T16:23:01.000Z": "To enhance COVID-19 testing, we have partnered w/ @AUG_University to offer free virtual screenings to Georgians in every corner of the state. If you are experiencing symptoms, call (706) 721-1852, visit http:// ow.ly/Vjuw50znKMs , or download the AU Health ExpressCare app. #gapol", "2020-04-24T01:09:54.000Z": "Big congrats to @allforgod_55 ! We know he will make the #dawgnation proud in the @NFL ! #NFLDraft  #godawgs Quote Tweet Georgia Football @GeorgiaFootball From Athens to the Big Apple Congratulations @allforgod_55  #NFLDraft  #DawgsInTheNFL", "2020-04-22T01:55:02.000Z": "To dramatically expand testing in Georgia, we have partnered with @AUG_University to offer free virtual screenings for symptomatic Georgians. If you are feeling ill, call (706) 721-1852, visit http:// augustahealth.org , or download the AU Health ExpressCare app on your Smartphone.", "2020-04-21T22:10:05.000Z": "Given the favorable data trends, enhanced testing through @AUG_University , & advice of state healthcare leaders, we are taking another measured step forward. We remain focused on protecting lives - and livelihoods - in every part of Georgia. http:// ow.ly/747450zkFv3  #gapol Gov. Kemp announces 'limited, sensible' steps to reopen Georgia Kemp also said he is allowing the statewide shelter-in-place order to expire on April 30 at 11:59 p.m. wsbtv.com", "2020-04-21T21:25:03.000Z": "In Georgia, data is moving in the right direction, hospitals have surge capacity, & testing partnerships w/ @AUG_University & @GeorgiaGuard are underway. Informed by data, science, & the advice of healthcare experts, we are taking another step forward. What to know about Kemp's decision to ease coronavirus restrictions What businesses will open and what will remain closed in plan by Georgia Gov. Brian Kemp to reopen some Georgia businesses? Key details, dates and answers to questions compiled by the AJC ajc.com", "2020-04-21T20:55:05.000Z": "ICYMI: @AUG_University to lead expansion of coronavirus testing across Georgia -> http:// ow.ly/Uq4r50zkG8d  #gapol", "2020-04-21T19:58:55.000Z": "We are urging symptomatic Georgians to call (706) 721-1852, visit http:// augustahealth.org , or download the AU Health ExpressCare app on your Smartphone. Healthcare providers at @AUG_University are available around the clock. RT to spread the word! http:// ow.ly/INpG50zkEbt  #gapol Georgia Governor Kemp taps Augusta University to lead fight against COVID with statewide testing Atlanta (WJBF)- Thousands of Georgians to be screened through Augusta University app and tested with Augusta University swab technology. On Monday afternoon, Governor Kemp announced that Augusta Un wjbf.com", "2020-04-20T22:10:06.000Z": "As we begin this process, let's reaffirm our commitment to each other & Georgia's future. I am confident that together, we will emerge victorious from this war. With your help & God's grace, we will build a safer, stronger state for our families & generations to come. #gapol", "2020-04-20T21:35:12.000Z": "Throughout this entire process, we have relied on data, science, and the advice of healthcare professionals to guide our approach and decision-making. Every day, we are doing our best to protect lives - and livelihoods - in every part of Georgia. http:// ow.ly/KPsw50zjAbD  #gapol CORONAVIRUS IN GEORGIA: Shelter in place to end April 30 Watch Channel 2 Action News RIGHT NOW for live updates on this developing story. wsbtv.com", "2020-04-18T19:04:36.000Z": "\"We are cautiously optimistic and deeply grateful to all of the frontline workers, community leaders, and Georgians who keep fighting this battle with us,\" says @GovKemp  #gapol Following possible peak in deaths, Kemp working on when to reopen Ga. A widely cited model suggests Georgia may have already passed its peak for deaths from the coronavirus and use of hospital resources. ajc.com", "2020-04-18T20:36:16.000Z": "Stay hunkered down and keep choppin', #DawgNation ! #godawgs  #gapol Quote Tweet Georgia Football @GeorgiaFootball Battle hymn.  #VirtualGDay", "2020-04-18T19:34:59.000Z": "Many thanks to fellow Southeastern Governors @GovernorKayIvey , @TateReeves , @henrymcmaster , @GovRonDeSantis & @GovBillLee for a great call this afternoon discussing how to safely reopen our states. Appreciate their support & leadership as we fight #COVID19 ! We'll emerge stronger!", "2020-04-17T21:50:04.000Z": "Georgia farmers are working hard to weather the financial impact of COVID-19. Now, more than ever, we need to support our ag industry by purchasing #GeorgiaGrown products! http:// ow.ly/jhUB50zhcbQ  #gapol Innovation helps Georgia farmers stay afloat during the pandemic ATLANTA, Ga. (CBS46) -- Leaders from the state and federal levels are sending a message for citizens to help those who feed the country: farmers. cbs46.com", "2020-04-17T19:10:10.000Z": "In the coming days, I'll announce our plan to move GA forward. Rest assured, the fundamentals of our economy are solid, & I'm confident we will emerge victorious from this crisis. W/ your help, we will build a safer, stronger, & more prosperous GA! http:// ow.ly/ACG050zhbkc  #gapol Kemp devising plan to reopen Georgia for business Gov. Brian Kemp has quietly begun planning to reopen Georgia for business, weeks before the expected peak of the coronavirus pandemic. ajc.com", "2020-04-17T15:55:08.000Z": "So thankful for the @GeorgiaGuard and their efforts to keep our families and communities safe. These citizen soldiers are on the frontlines of this war against COVID-19 and we are forever grateful for their service. http:// ow.ly/mzrg50zhaZK  #gapol Behind the scenes look at the Georgia National Guard's command post From helping distribute meals at the food bank to disinfecting nursing homes, the Georgia National Guard is stepping up to help communities fight the coronavirus. fox5atlanta.com", "2020-04-15T18:39:29.000Z": "We are grateful for all the sacrifices made by our first responders, doctors, nurses, and medical staff. Thanks to their service, Georgia will defeat COVID-19 and emerge stronger than ever. RT to help me thank these local heroes! #gapol", "2020-04-14T23:35:19.000Z": "I am so thankful to @BrianKempGA and @universityofga for their commitment to researching neurocognitive diseases like Parkinson's. Actions like this provide hope for a brighter tomorrow and bring us closer to finding a cure. Quote Tweet Brian Kemp @BrianKempGA Through the John H. \"Johnny\" Isakson Chair for Parkinson's Research at the @universityofga , we will use technology and innovation to break new ground. With the grit and resolve of @JohnnyIsakson , we will move one step closer to a cure. http:// ow.ly/jx4R50zegAJ  #gapol", "2020-04-15T16:33:53.000Z": "We have partnered w/ the private sector to bring 570 healthcare professionals to targeted communities throughout Georgia. With additional staffing, we can help our doctors, nurses, & medical staff meet the pressing & future needs of their patients. http:// ow.ly/uyzz50zf4Or  #gapol State partners with company to increase staffing at healthcare facilities across Georgia, Kemp says Governor Brian Kemp announced in a press briefing Monday that healthcare facilities across Georgia will be receiving staffing support to fight the coronavirus outbreak. wsav.com", "2020-04-14T22:15:07.000Z": "We are making progress but still have a long journey ahead. We are in this fight together and need your full cooperation. So stay hunkered down, be safe, and make the right decisions today to ensure a safer, healthier, and more prosperous tomorrow. #gapol", "2020-04-14T21:34:30.000Z": "Through the John H. \"Johnny\" Isakson Chair for Parkinson's Research at the @universityofga , we will use technology and innovation to break new ground. With the grit and resolve of @JohnnyIsakson , we will move one step closer to a cure. http:// ow.ly/jx4R50zegAJ  #gapol Regents OK Isakson Chair for Parkinson's Research UGA raises $1.6 million so far to fight debilitating disease. news.uga.edu", "2020-04-14T18:50:05.000Z": "Our team is working around the clock to address pressing needs and plan for whatever comes next. Right now, we are laser focused on expanding surge capacity in communities throughout Georgia. http:// ow.ly/XpBj50zdX7H  #gapol Hospital surge capacity top of mind as Kemp expands COVID-19 screening State leaders say they will expand the testing criteria to allow anyone who's had direct contact with positive COVID-19 patients to test and allow state officials to schedule tests directly w wsav.com", "2020-04-13T18:50:07.000Z": "Great to see @AUG_University using 3D printers to ensure that frontline healthcare workers have the resources and supplies they need to stay safe and help stop COVID-19 in Georgia. This innovative approach is literally saving lives. http:// ow.ly/rwoC50zcE38  #gapol AU uses 3D printers to make coronavirus face shields Lynsey Ekema, of the Augusta University Center for Instructional Innovation, talks about the coronavirus medical face shield's that are being made with 3D pr... youtube.com", "2020-04-13T15:50:08.000Z": "In preparation of a potential surge, we are building out a temporary facility w/ 200 beds at the GA World Congress Center. We are fortunate to have our state's best, brightest, & most dedicated public servants working on this critically important project. Georgia to convert Atlanta convention center to temporary hospital ajc.com", "2020-04-13T13:53:14.000Z": "If your property was damaged during last night's severe weather, take pictures and fill out the form at the link below. GEMA Engaged Citizens Damage Assessment GeoForm gema-soc.maps.arcgis.com", "2020-04-13T14:12:15.000Z": "Soldiers of the 1st Battalion 121st Infantry are working with civilian partners at Piedmont Healthcare and Piedmont Athens Regional Medical Center to #CrushTheCurve . #InThisTogether", "2020-04-12T13:21:50.000Z": "Today, we celebrate the greatest moment in history that should bring joy and hope to us all. We remember that Jesus Christ overcame sin and death. On Easter Sunday, he walked out of the grave to give us life, purpose, and a bright future. #HappyEaster  #gapol", "2020-04-12T13:17:08.000Z": "As we work to stop the spread of #COVID19 in our state, this Easter message is timely. God Bless! #gapol Quote Tweet Governor Brian P. Kemp @GovKemp These are difficult times, but tomorrow we will reflect on the greatest moment in history that should bring joy, peace, and hope to us all. @GAFirstLady , the girls, and I pray that everyone has a safe and blessed Easter!", "2020-04-10T20:37:50.000Z": "Inspiring words from @GA_DOI Commissioner/Maj. General John King: \"This is what Americans do. This is what Georgians do. We rise to the challenge. We've confronted crises in the past that we've overcome. And we will overcome this. I'm convinced.\" http:// ow.ly/7jSj50zbjqt  #gapol Ga. Insurance Commissioner deployed in coronavirus fight ATLANTA - Thousands of U.S. Army National Guard troops have been deployed throughout all 50 states, helping with tasks from disinfecting nursing homes to building makeshift hospitals in convention... valdostadailytimes.com", "2020-04-10T15:34:11.000Z": "#GaFightsFraud  #COVID19 Fraud Task Force is moving rapidly to investigate & shut down fraudulent activities. Report complaints to NCDF 1-888-720-5721 or Ga's AG 1-800-869-1123 @USAttorneys  @BrianKempGA  @Georgia_AG  @NDGAnews  @SDGAnews  @FBIAtlanta  @GBI_GA Joint state-federal COVID-19 fraud task force makes its first case A Fayeteville woman is charged with selling unregistered pesticide which she marketed on eBay as Virus protection. fox5atlanta.com", "2020-04-10T15:20:45.000Z": "On #GoodFriday , we remember the old rugged cross where Jesus Christ made the ultimate sacrifice for mankind. As the gospel writer pens, He came not to condemn the world but to save it. #gapol", "2020-04-09T15:41:41.000Z": "The challenges are great but we are working tirelessly to keep Georgians safe. Your prayers energize us. We are blessed by your kindness. I know these are troubling times but we are in this fight together. With your help & God's grace, we will stop COVID-19 and emerge victorious.", "2020-04-08T15:32:17.000Z": "We are extending the Public Health State of Emergency through May 13. This will allow us to continue deploying resources, lend support to frontline healthcare workers, and help as we prepare for a potential patient surge in our hospitals. http:// ow.ly/FwlT50z8VTW  #gapol Gov. Kemp extends shelter-in-place order until the end of April The governor also announced he is activating another 1,000 guard members in the fight against the virus. LIVE coverage at 11 p.m. on WSB Tonight. wsbtv.com", "2020-04-07T20:00:16.000Z": "It's National Public Health Week. There has never been a more fitting time to acknowledge the work of public health and healthcare professionals than during the COVID-19 pandemic. The nation's health is PUBLIC HEALTH. #NPHW", "2020-04-06T21:33:31.000Z": ". @USDA has launched an online tool \"Meals for Kids\" to help families find meals for children while schools are closed during the #COVID19 outbreak. https:// bit.ly/2XdvJ61", "2020-04-07T17:13:39.000Z": "Incredibly proud of Comm. John King for working around the clock to keep the American people safe from COVID-19. Even while deployed, King continues to lead @GA_DOI & play a vital role on our Coronavirus TF. Stay safe & keep choppin', General! http:// ow.ly/k8aP50z7U58  #gapol Georgia insurance commish deployed to help coronavirus response ajc.com", "2020-04-07T14:05:05.000Z": "Appreciate @PresKeel and @AUG_University for playing a vital role in the fight against COVID-19. By expanding testing in rural hospitals, we can keep all Georgians safe and healthy - no matter their zip code. http:// ow.ly/UpNr50z7Eks  #gapol Augusta University Health to extend COVID-19 testing to rural hospitals Augusta University Health announced on Monday, Apr. 6 that they will be expanding their COVID-19 testing to medical centers in rural Georgia and South Carolina. wfxg.com", "2020-04-06T13:10:07.000Z": "ICYMI: Kemp issues new guidelines on how to stay safe while shopping -> http:// ow.ly/UNdK50z6kNB  #gapol Kemp issues new guidelines on how to stay safe while shopping As coronavirus cases surge in Georgia, Gov. Brian Kemp has issued some new guidelines on how to stay safe when you make necessary shopping trips. wsbtv.com", "2020-04-06T12:43:17.000Z": "Expanding access to testing remains a top priority. Today, we kicked off another public-private partnership between @CVSHealth & @GeorgiaTech that will identify more positive cases, prevent further infection, & help Georgians receive the care they need. Coronavirus in Georgia on April 6 Here is the latest look at the cases om April 6", "2020-04-02T21:24:36.000Z": "Get what you need from the grocery store and leave the rest for your neighbors. We are in this together. #gapol Quote Tweet GaDeptPublicHealth @GaDPH When it comes to preventing the spread of #COVID19 , it's crucial to only buy what your family needs; no more than a two-week supply. This allows grocery stores time to restock and it ensures that the people around you have what they need to remain virus-free. #COVID19GA", "2020-04-02T12:25:04.000Z": "Apple, HHS, CDC and the White House Coronavirus Task Force has partnered together and released an app providing guidance on social distancing and isolating, monitoring symptoms, recommendations on testing, and when to contact a medical provider. Learn more http:// ow.ly/qibR30quIGH", "2020-04-01T21:12:55.000Z": "In keeping w/ our promise to let data & experts guide our decisions, I announced another strategic step forward. Tomorrow, I will sign a statewide shelter in place order. We will issue guidance soon so Georgians can prepare for the next phase in the fight against COVID-19. #gapol", "2020-03-31T21:55:04.000Z": "ICYMI: Gov. Kemp sending National Guard to Georgia long-term care facilities -> http:// ow.ly/HwQV50z1vi6  #gapol Gov. Kemp sending National Guard to Georgia long-term care facilities Gov. Brian Kemp and the Georgia National Guard are sending soldiers to nursing homes and assisted living facilities that have cases of the coronavirus. fox5atlanta.com", "2020-03-31T21:30:31.000Z": "\"Our training has prepared us to fight this virus, and we are eager to lend a hand in this battle.\" - Adjutant General Tom Carden http:// ow.ly/mo4450z1vmI  #gapol Gov. Kemp sending National Guard to Georgia long-term care facilities Gov. Brian Kemp and the Georgia National Guard are sending soldiers to nursing homes and assisted living facilities that have cases of the coronavirus. fox5atlanta.com", "2020-03-31T21:27:06.000Z": "This innovative partnership will help us dramatically increase testing capacity. Now, health officials will have a more complete picture of COVID-19's impact on our state, which will better inform our collective decisions going forward. http:// ow.ly/sqmm50z1vdP  #gapol Georgia announces surge coming in coronavirus test processing ajc.com", "2020-03-31T02:45:04.000Z": "Proud to partner with the Georgia Department of Community Affairs to expand access to High Speed Internet for Georgians who are working or learning from home. http:// ow.ly/qrMd50z0wL1  #gapol Kemp, DCA launches new resources for Georgians to access high-speed internet during coronavirus Governor Brian Kemp and the Georgia Department of Community Affairs (DCA) launched a new website to inform Georgians about ways to connect to high-speed internet amid the coronavirus oubreak on Wed wsav.com", "2020-03-29T15:06:22.000Z": "OpEd: \"These are challenging times in SW Georgia & throughout our state & country. Rest assured, we are working diligently w/ local officials & the business community to provide whatever it takes to keep your loved ones safe & community strong.\" http:// ow.ly/hJZw50yYW8N  #gapol 'These are challenging times in Southwest Ga.': Gov. Brian Kemp pens COVID-19 op-ed These are challenging times in Southwest Georgia and throughout our state and country. walb.com", "2020-03-28T02:18:16.000Z": "My friend, Greyson Kennedy, has chopped a lot of wood and completed his final cancer treatment today. So proud of his determination. Keep choppin', Greyson! #gapol", "2020-03-27T19:10:07.000Z": "ICYMI: Atlanta TV Stations come together to host coronavirus town hall with Gov. Kemp http:// ow.ly/5KWn50yXQZb  #gapol Atlanta TV Stations come together to host coronavirus town hall with Gov. Kemp In what has been a tough time for our state, Georgia united to bring you important information and get your questions answered about coronavirus and what the state is doing to combat it. wsbtv.com", "2020-03-27T17:26:53.000Z": "There's no cure. There's no vaccine. It's up to us - hardworking Georgians in every part of our state - to raise awareness and help #stopthespread . #gapol 'It is up to all of us': Governor Brian Kemp details plans to fight COVID-19 during town hall There are more than 1,600 confirmed cases in Georgia.", "2020-03-26T16:19:39.000Z": "Important Georgia schools news: @GovKemp has issued an order \nkeeping public elementary+secondary schools closed through April 24, and public colleges/universities stay closed through rest of semester. #gapol", "2020-03-26T16:10:12.000Z": "Proud of @MCG_AUG for joining the fight against #COVID19 . After taking an online course in pandemic medicine, these medical students are deployed throughout Georgia to help meet healthcare workforce needs - especially in rural communities. http:// ow.ly/ZSuP50yWnTl  #gapol MCG pandemic course will give students unique learning and aid rural health response The novel coronavirus crisis in Georgia is about to become a learning opportunity for students at Medical College of Georgia. augustachronicle.com", "2020-03-26T13:15:57.000Z": "Tonight is our Coronavirus Town Hall, which will be televised statewide. Tune in at 8PM as we review @CDCgov guidance, answer Frequently Asked Questions, recap Georgia's strategic response to the global pandemic, and discuss our next steps in this fight to #StopTheSpread . #gapol", "2020-03-25T15:46:14.000Z": "\"We've never been through anything like this. Yes, the world is turned upside down right now. This is tough on a lot of people. But we're going to get through this.\" - Coach Vince Dooley https:// si.com/college/tmg/to ny-barnhart/vince-dooley   #gapol Hall of Fame coach, now 87, says staying at home is a small price to pay if we can slow down the... Hall of Fame coach, now 87, says staying at home is a small price to pay if we can slow down the spread of the virus si.com", "2020-03-25T15:01:49.000Z": "MARK YOUR CALENDAR: On Thursday at 8PM, we will host a televised Town Hall to discuss COVID-19 and our state's efforts to stop the spread. I hope you will tune in for this important conversation. Click the link for details. http:// ow.ly/siPV50yVqv3  #gapol Kemp to headline televised pandemic town hall on Thursday Georgia Gov. Brian Kemp will headline a televised town hall about coronavirus response at 8 p.m. Thursday. Find what time, what channels, how to watch. Participants include Atlanta Mayor Keisha Lance... ajc.com", "2020-03-24T17:58:00.000Z": "On Monday, we issued an order to help stop the spread of COVID-19. By closing down bars, enforcing social distancing, & keeping the medical fragile indoors, we can protect our citizens from this dangerous virus. Together, we will win this battle! http:// ow.ly/hflR50yUy40  #gapol AJC Interview: Kemp says he still has 'arrows left in the quiver' to fight coronavirus ajc.com", "2020-03-23T13:19:49.000Z": "Please join us in praying for Emma and all who are battling COVID-19. Now, more than ever, we need to re-affirm our commitment to stopping the spread. By following @CDCgov guidance, we can keep our families safe and healthy. http:// ow.ly/IjV350ySZCr  #gapol 12-year-old girl with coronavirus is on a ventilator and fighting for her life Emma, a 12-year-old girl, is \"fighting for her life\" in an Atlanta hospital after testing positive for the coronavirus, according to her cousin. cnn.com", "2020-03-22T20:28:03.000Z": "We are in this together and that means following the guidance provided by @realDonaldTrump  @CDCgov and the @GaDPH . With your help, we will stop the spread of #COVID19 and keep our families & communities safe! #gapol Quote Tweet CDC @CDCgov We all have a role to play to reducing and slowing transmission of #COVID19 . Physical or social distancing is one way to prevent the spread of COVID-19. This means avoiding crowded places and maintaining distance from others. More tips: http:// cdc.gov/covid19 . #StayAtHome", "2020-03-22T03:00:54.000Z": "My friend and Oconee County Commissioner Bubber Wilkes passed away earlier today. He was a good man and great public servant! #gapol", "2020-03-21T13:47:11.000Z": "Sad to hear that Georgia resident and country music icon, @_KennyRogers , has passed. He was an incredibly talented artist and successful entrepreneur who entertained the world. Kenny's music and legacy will live on for generations to come! #gapol  #KennyRogersRIP", "2020-03-20T20:30:49.000Z": "To stop the spread of COVID-19 in Georgia, we must follow the guidelines provided by @realDonaldTrump , @CDCgov , and the @HHSGov . RT to help us flatten the curve and keep Georgia families safe! #gapol", "2020-03-19T21:50:06.000Z": "Proud to partner w/ @GADeptEarlyCare and YMCA of Metro Atlanta to provide childcare for doctors, nurses, & medical staff who are on the frontlines in this battle against COVID-19. Together, we will stop the spread & ensure a healthy future for our state. Medical workers to get childcare help during coronavirus outbreak ATLANTA, Ga. (CBS46) -- Governor Brian Kemp along with the Georgia Department of Early Care and Learning and YMCA of Metro Atlanta announced on Wednesday a partnership to dedicate several cbs46.com", "2020-03-19T19:00:23.000Z": "Health officials are urging us to begin prioritizing COVID-19 tests for vulnerable populations & those responsible for their care. This action will conserve medical supplies, which are becoming difficult to secure bc of overuse, bans, & hoarding. http:// ow.ly/2Kpe50yQdEK  #gapol Gov. Brian Kemp says vulnerable populations, first responders and healthcare workers must be... Gov. Brian Kemp is calling on Georgians to hold off on getting tested for the coronavirus disease known as COVID-19 if they can so vulnerable populations, health workers and first gwinnettdailypost.com", "2020-03-19T17:27:31.000Z": "ICYMI: Gov. Brian Kemp urges Georgians to donate blood amid coronavirus outbreak -> http:// ow.ly/8J2O50yQdho  #gapol Gov. Brian Kemp urges Georgians to donate blood amid coronavirus outbreak Gov. Brian Kemp issued a call to Georgians on Tuesday to support the American Red Cross as the coronavirus outbreak continues to spread around the world. gwinnettdailypost.com", "2020-03-18T21:02:26.000Z": "Great update from Sen. @StricklandForGA ! #gapol Quote Tweet Brian Strickland @StricklandForGA Here's an update on #COVID19 . Stay strong, GA! We got this. Please follow the facts from @GovKemp , @GaDPH  @CDCgov  @GEMA  #gapol", "2020-03-18T17:29:36.000Z": "We have partnered with the @GeorgiaDOL , public officials, and private sector leaders to help hardworking Georgians impacted by the spread of COVID-19. Together, we will keep our top notch workforce safe and stable. http:// ow.ly/HNdV50yP9sq  #gapol Kemp, Dept. of Labor focus on assisting workers affected by COVID-19 Today Gov. Brian Kemp and the Georgia Department of Labor addressed an increase in the number of partial claims filed as a result of businesses reducing work hours or temporarily mdjonline.com", "2020-03-18T02:49:50.000Z": "ICYMI: Gov. Kemp encouraging Georgians to support local restaurants, drive-thrus -> http:// ow.ly/wiT350yOvMI  #gapol Gov. Kemp encouraging Georgians to support local restaurants, drive-thrus Gov. Brian Kemp is asking Georgians to do what they can to support the state's small businesses. wsbtv.com", "2020-03-17T19:23:43.000Z": "To help provide relief to Georgia companies during the coronavirus pandemic, we have filled paperwork with @SBAgov . Through this process, we can help job creators access loans to keep their business running and Georgians working. http:// ow.ly/WbkC50yOeAh  #gapol Georgia seeks small business relief from feds amid coronavirus pandemic ajc.com", "2020-03-17T19:10:08.000Z": "Join the Kemp Family in praying for our doctors, nurses, & medical staff who are risking their well-being in this battle against COVID-19. \"Be strong & courageous. Do not be afraid; do not be discouraged, for the Lord your God will be with you wherever you go.\" - Joshua 1:9", "2020-03-17T15:45:10.000Z": "ICYMI: Kemp orders public K-12 schools, colleges in Georgia closed through end of March -> http:// ow.ly/Zg0v50yNTXc  #gapol Kemp orders public K-12 schools, colleges in Georgia closed through end of March ajc.com", "2020-03-17T15:08:58.000Z": "I ask Georgians to continue to follow best practices - washing their hands regularly, isolating the elderly and chronically ill, and avoiding large events in the days and weeks ahead. We are in this together. Hunker down and let's stop COVID-19 in Georgia. #gapol", "2020-03-17T02:00:20.000Z": "A temporary restriction on visitation at long-term care facilities is critical as we fight to prevent the spread of COVID-19 and ensure the safety of our state's most vulnerable citizens. http:// ow.ly/vhUh50yNe3F  #gapol Gov. Kemp urging Georgia's long-term care facilities to restrict visitors \"There is a significant risk that individuals who seem healthy could visit a facility and unintentionally endanger residents.\" fox5atlanta.com", "2020-03-16T22:36:11.000Z": "To keep students, teachers & administrators safe & mitigate the spread of #COVID19 , I'm ordering the closure of all public elementary, secondary & post-secondary schools in GA from March 18 to March 31. Read more here: https:// bit.ly/2UdR4cq . @georgiadeptofed  #gapol Kemp: Public Elementary, Secondary, Post-Secondary Schools Closed March 18 to March 31 For Immediate Release Monday, March 16, 2020 Kemp: Public Elementary, Secondary, Post-Secondary Schools Closed March 18 to March 31 Atlanta, GA - I... madmimi.com", "2020-03-17T00:57:38.000Z": "Social distancing will help #FlattenTheCurve . RT to share this informative graphic from @GeorgiaEMA ! #gapol Quote Tweet Georgia EM&HS @GeorgiaEMA You don't necessarily have to stay in your house to practice social distancing. Check out the graphic for examples of activities you can participate in and activities you should avoid. #COVID19", "2020-03-16T22:00:16.000Z": "ICYMI:Gov. Kemp warns of fake emergency information spreading online http:// ow.ly/WBLy50yNe1b  #gapol", "2020-03-16T19:51:08.000Z": "ICYMI: Gov. Kemp on preventing spread of virus in nursing facilities http:// ow.ly/ZmOf50yNe8j  #gapol Gov. Kemp on preventing spread of virus in nursing facilities Gov. Kemp and the Georgia Health Care Association issued a joint statement on Monday regarding measures to prevent the spread of COVID-19 in skilled nursing facilities, assisted living communities,... mdjonline.com", "2020-03-16T12:29:35.000Z": "\"Time after time, as a nation, we have risen to the occasion of all our challenges and emerged from them stronger and more committed to the beliefs that we collectively hold. Tested? Yes. Broken? Never.\" @CalvinSmyre lead @GaHouseHub in prayer, urging bipartisan support. #gapol", "2020-03-16T01:17:50.000Z": "Thanks for working to share these updates and guidance with your constituents. Together, we will stop the spread of COVID-19 and keep Georgia families safe! #gapol Quote Tweet Wes Cantrell @wcantrell Just got off a conference call with @GovKemp , Dr. Toomey from @GaDPH . Summary:\n1 Cases are increasing rapidly\n2 Testing is free for all\n3 Social distancing is key\n4 Stay home\n5 Wash your hands\n6 Do your part!\n\nGo here for latest info: https:// dph.georgia.gov/covid-19-daily -status-report ", "2020-03-14T18:55:05.000Z": "I appreciate the hard work of @GeorgiaEMA , @GaDPH , & Monroe County officials to protect the health and safety of all Georgians. Building this quarantine space is one of many pro-active actions that we're taking to prepare for any scenario. http:// ow.ly/LSGA50yLIHX  #gapol Quarantine space under construction in Monroe County MONROE COUNTY, Ga. -- TheGeorgia Public Safety Training Center campus in Monroe County will be serving as a quarantine space for patients who test positive for coronavirus. On Friday Governor Brian... wgxa.tv", "2020-03-14T15:55:05.000Z": "If you are going to the grocery store in the days ahead, purchase what you need and save one for your neighbor. Be prepared and remain calm. http:// ow.ly/P3zM50yLIGw  #gapol Spreading coronavirus unleashes mad dash to supermarkets, Kemp urges calm The panic really escalated at a Sam's Club in Hiram, where a FOX 5 viewer witnessed a pair of shoppers fighting over a hot ticket item; at least one person was seen on video being rolled out in a... fox5atlanta.com", "2020-03-14T14:40:41.000Z": "Moments ago, I declared a Public Health State of Emergency. This historic action will help strengthen our efforts to combat #COVIDー19 in Georgia. #gapol Quote Tweet Candice Broce @candicebroce . @GovKemp issues Public Health State of Emergency for #COVID19 >> https:// gov.georgia.gov/executive-acti on/executive-orders-0/2020-executive-orders   #gapol", "2020-03-14T14:13:42.000Z": "BREAKING: Kemp declares public health emergency; 66 coronavirus cases in Ga. UPDATE: Kemp declares public health emergency; 66 coronavirus cases in Ga. ajc.com", "2020-03-14T14:26:08.000Z": "We are grateful for @realDonaldTrump , @VP , our federal partners and Georgia's congressional delegation for working so hard to secure the resources and funding we need to combat #COVID19 . #gapol Quote Tweet Kelly Loeffler @KLoeffler We have taken significant steps to address coronavirus & are working to leverage every resource to keep Georgians healthy. I'm going to continue working with @realDonaldTrump & @BrianKempGA to ensure our state has what it needs. https:// kellyforsenate.com/updates-on-cov id-19/ ", "2020-03-14T13:13:30.000Z": "WATCH http:// Facebook.com/GovKemp or http:// gpb.org/coronavirus at 10:00AM for a #COVID19 update. #gapol Coronavirus: News and Resources gpb.org", "2020-03-14T13:05:06.000Z": "\"Continue to support one another, be mindful of potential exposure, use best practices to prevent infection, and pray for your fellow Americans in the weeks ahead.\" http:// ow.ly/huMo50yLIEx  #gapol Gov. Brian Kemp to declare first ever public health emergency in Ga. Georgia Governor Brian Kemp is issuing a public health emergency for the state. wtoc.com", "2020-03-14T12:00:27.000Z": "ICYMI: Georgia to declare public health emergency amid coronavirus outbreak -> http:// ow.ly/Ty7s50yLIuy  #gapol", "2020-03-12T21:08:41.000Z": "During today's press conference, we urged the vulnerable to avoid crowds, ordered state employees to tele-work, empowered local leaders to make the decision on school closures, and announced an expansion of the task force. Read more -> http:// ow.ly/PXZG50yKqoY  #gapol Kemp orders most state employees to work from home amid coronavirus outbreak Kemp orders most state staffers to telework amid coronavirus outbreak ajc.com", "2020-03-12T17:20:43.000Z": "The Kemp Family is praying for the family and loved ones of this individual. We are grateful for our medical providers and staff for their hard work and focus. #gapol Quote Tweet Governor Brian P. Kemp @GovKemp Update: @GaDPH Confirms First #COVID19 Death in Georgia >>> https:// bit.ly/2Q8aHBs  #gapol Show this thread", "2020-03-12T02:16:29.000Z": "President @realDonaldTrump is right: \"We are all in this together. We must put politics aside, stop the partisanship, and unite together as one nation and one family. As history has proven time and time again, Americans always rise to the challenge and overcome adversity.\" #gapol", "2020-03-12T02:02:29.000Z": "We are working around the clock w/ the Trump Admin, state partners, & local leaders to reduce the spread of COVID-19 & prepare for all possible scenarios. We are in this fight together & will continue to put the health & safety of Georgians first. http:// ow.ly/9Blz50yJBhn  #gapol Trump imposes major restrictions on travel from Europe The president made the announcement after the number of coronavirus cases in the United States passed 1,000 and the stock market plummeted. nbcnews.com", "2020-03-11T22:10:05.000Z": "Chelsea's story is a powerful reminder that every life matters & has value. We must always speak up - & fight for - the most vulnerable among us. We must do our part to ensure that every Georgian has the opportunity to live in a safe & loving home. http:// ow.ly/UiqE50yJofF  #gapol Opinion: State can do more to help challenged foster kids ajc.com", "2020-03-11T20:42:20.000Z": "We kicked off the year with strong job growth, historically low unemployment rates, and record workforce participation. By championing policies that empower the private sector, we are building a safer, stronger, and more prosperous Georgia! #gapol", "2020-03-11T20:08:43.000Z": "Proud of the @MariettaPD for keeping our streets - and families - safe! Keep up the good work! http:// ow.ly/g3qH50yJnZY  #gapol Hundreds of pills, drugs, guns found during Marietta traffic stop Marietta police said K-9 Atos alerted on the presence of drugs inside a truck during a traffic stop Sunday on Franklin Gateway. ajc.com", "2020-03-10T12:23:30.000Z": "More than 50,000 hardworking Georgians will be diagnosed with cancer this year. We can do our part to support research at the @GACancerCenter through @pacelineride . Learn more -> https:// youtube.com/watch?v=v-iT_o CrWjo   #curecancerfaster Join the Paceline! youtube.com", "2020-03-10T01:11:15.000Z": "Important legislation to protect some of the most vulnerable among us in Georgia! Quote Tweet First Lady Marty Kemp @GAFirstLady Today HB 911 unanimously passed the House chamber. This legislation closes a dangerous loophole in state law and protects foster children. As it moves to the Senate, we're asking for the same solid support! #gapol", "2020-03-10T01:06:05.000Z": "Today, I provided an update on confirmed & presumptive cases of coronavirus. Members of the task force discussed preparedness efforts and shared practical ways for citizens to stay healthy. Rest assured, we are working to keep Georgia families safe. https:// wsbtv.com/news/local/geo rgia-officials-preparing-part-state-park-coronavirus-patients/TN3G7WXMCNBGPDWBV37UTFUZGA/?fbclid=IwAR3o4dwJPCGXXA8meT4hAjjMmV2dlooeSZBD-Xg_LSRGcbB-JZa1eWmAPQc   #gapol Gov. Kemp confirms 6 positive cases, 11 presumptive cases of coronavirus across state LIVE coverage on the Channel 2 Action News Nightbeat at 11 p.m. wsbtv.com", "2020-03-09T13:05:12.000Z": "Please join our family in lifting up @RepTomGraves ' son, John, who was seriously injured during a cycling race in Calhoun. We pray for a full and speedy recovery! #gapol Quote Tweet Tom Graves @RepTomGraves Yesterday morning our son, John, a member of Georgia Tech's cycling team, was critically injured during the Calhoun Downtown Criterium and airlifted to a trauma unit. He remains in intensive care and is being cared for by a top-notch team of doctors and medical professionals. Show this thread", "2020-03-08T19:20:19.000Z": "Toured @CDCGov on Friday with @realDonaldTrump , @perduesenate , and @BrianKempGA . Our teams are in constant communication & working to keep Georgians safe. For more info, visit http:// cdc.gov .", "2020-03-07T11:59:42.000Z": "Dropped my middle daughter, Lucy, off at the airport this morning for her mission trip to Jamaica. I know she's going to make a huge impact in the lives of those she encounters along the way!  #dgd  #gapol", "2020-03-07T00:39:58.000Z": ". @GAFirstLady and I are blessed to spend the evening with so many hardworking Georgians at the annual @GA_FFA Gala in Atlanta. Proud of the State Officer Team for their leadership! #gapol", "2020-03-06T23:27:43.000Z": "Honored to welcome @realDonaldTrump back to Georgia for a tour of the @CDCgov . Our state is working in close collaboration with the President, @VP , and Trump Administration to prepare for #COVIDー19 and keep Georgia families safe. #gapol Quote Tweet Greg Bluestein @bluestein President Trump has arrived in Atlanta to visit the CDC to discuss his approach to the coronavirus #gapol Show this thread", "2020-03-06T14:06:02.000Z": ". @ajc :\"The strikingly low unemployment rate came with Georgia's labor force growing to 5.15 million people, up 1.1% from a year ago.\" https:// ajc.com/business/georg ia-sees-solid-job-growth-low-unemployment-january/kA7ZHSXGCwCc0k9r1thVaN/   #gapol Georgia sees solid job growth, low unemployment in January Georgia unemployment rate at all-time low pre-virus ajc.com", "2020-03-06T14:03:54.000Z": "Great news! Georgia's unemployment rate dropped to 3.1% - the lowest in state history! https:// ajc.com/business/georg ia-sees-solid-job-growth-low-unemployment-january/kA7ZHSXGCwCc0k9r1thVaN/   #gapol Georgia sees solid job growth, low unemployment in January Georgia unemployment rate at all-time low pre-virus ajc.com", "2020-03-06T13:58:50.000Z": ". @ajc :\"While the post-holiday job market is typically weak, the state saw solid growth in logistics, healthcare & hospitality, continuing a nearly decade-long expansion that has added more than 700k jobs & slashed unemployment rates to record lows.\" https:// ajc.com/business/georg ia-sees-solid-job-growth-low-unemployment-january/kA7ZHSXGCwCc0k9r1thVaN/   #gapol Georgia sees solid job growth, low unemployment in January Georgia unemployment rate at all-time low pre-virus ajc.com", "2020-03-05T20:13:40.000Z": "ICYMI:Ga Dept. of Corrections Extends 287(g) Program https:// allongeorgia.com/georgia-state- politics/ga-dept-of-corrections-extends-287g-program/   #gapol Ga Dept. of Corrections Extends 287(g) Program The 287(g) program enables Georgia Department of Corrections officers to be cross-trained as designated immigration officers in a correctional setting and aid ICE in national security, public safety,... allongeorgia.com", "2020-03-05T13:32:29.000Z": "ICYMI: I'm pleased to announce the continued partnership between @GA_Corrections & @ICEgov . Through the 287(g) program, we will continue to track & deport members of Mexican cartels who are using our state as a distribution hub for drugs, weapons, & innocent children. #gapol", "2020-03-05T02:39:49.000Z": "Dr. Cabaniss was a great Georgian and a Damn Good Dawg who made an incredible impact on my life. Marty, the girls, and I mourn his loss but celebrate his remarkable legacy of service, kindness, and care. (2 of 2) #gapol", "2020-03-05T02:39:27.000Z": "Today, my stepfather, Dr. William Cabaniss, passed away at the age of 93. A veteran, rural physician, husband, father, and friend, Dr. Cabaniss was a thoughtful and generous man who practiced medicine for over 50 years. (1 of 2)", "2020-03-04T15:43:46.000Z": "Georgia's coronavirus task force is working on preventative measures, deployment of resources, & collaboration across all levels of government. Here are some easy steps you can take to help prevent the spread of Coronavirus. For more information, visit http:// cdc.gov .", "2020-03-03T23:37:38.000Z": "\"Remain calm.\" @GovKemp speaks with @JovitaMoore and @JustinFarmerWSB about two confirmed coronavirus cases in metro Atlanta -- http://", "2020-03-04T01:54:50.000Z": "Quick interview with @bluestein about coronavirus and our preparations as a state -> https:// ajc.com/blog/politics/ ajc-interview-kemp-urges-calm-amid-what-ifs-about-coronavirus/PdQiNbzYvPuYEQJFRaJkJM/   #gapol AJC Interview: Kemp urges calm amid 'what-ifs' about coronavirus ajc.com", "2020-03-03T03:23:00.000Z": "More details from Georgia Governor Brian Kemp's office about the two cases of COVID-19 ( #coronavirus ) in Fulton County. Both live in the same house and both have \"mild symptoms; they are isolated at home with other relatives to keep the illness from spreading.\" #gapol", "2020-03-03T03:13:40.000Z": "Tonight @BrianKempGA confirmed the first two cases of Coronavirus in the state of Georgia.\n\nThe latest details coming up tonight on @WJCLNews at 11.", "2020-03-03T03:25:39.000Z": ". @GovKemp just held a press conference with @GaDPH and other members of the Coronavirus Task Force to announce two confirmed cases of COVID-19 in Georgia. \n\nRead more: https:// bit.ly/2IaFglN Watch: https:// bit.ly/39iiaW1  #gapol", "2020-03-01T23:45:08.000Z": "Prayers for Josef! #UniteAndConquer  #ATLUTD Quote Tweet Atlanta United FC @ATLUTD Josef Martinez suffers torn ACL. https:// atlutd.com/post/2020/03/0 1/josef-martinez-suffers-torn-acl-right-knee ", "2020-02-28T18:08:04.000Z": "Our state's coronavirus task force will work on preventative measures, deployment of resources, and collaboration across all levels of government. Learn more -> http:// ow.ly/hCvN50yyOCe  #gapol Gov. Brian Kemp names Georgia coronavirus task force ajc.com", "2020-02-27T20:02:34.000Z": "ICYMI #gapol Quote Tweet WSAV News 3 @WSAV Some relief in sight for Georgia farmers impacted by Hurricane Michael @BrianKempGA and @GaDeptAg announced a $347 million recovery program today; applications start March 18 >>> https:// wsav.com/news/local-new s/georgia-news/ga-officials-announce-357m-hurricane-recovery-program-for-farmers/?utm_medium=social&utm_source=twitter_WSAV  via @ArchithNEWS", "2020-02-26T17:10:13.000Z": "Proud of @DekalbCountyPD for fighting on the frontlines to keep our children safe from predators. Keep up the good work! http:// ow.ly/uciU50ywmm8  #gapol Police: Man tried to seduce 14-year-old girl but instead met an undercover DeKalb cop ajc.com", "2020-02-26T13:50:06.000Z": "Thanks to strong collaboration at the federal, state, and local level, we are stopping dangerous drugs like meth from entering our state - and flooding our communities. http:// ow.ly/TMsK50ywmfz  #gapol Man tried to smuggle 100 pounds of meth and heroin - disguised as candy - to Atlanta ajc.com", "2020-02-26T13:48:45.000Z": "In the coming weeks, we will partner with the General Assembly to hold sex traffickers accountable, give survivors a second chance, & strengthen protections for foster children. We will end this evil industry & ensure a safe future for our state. http:// ow.ly/rYxe50ywpBv  #gapol 'Give a voice to the voiceless': Gov., First Lady Kemp applaud anti-human trafficking legislation... They say the bills are sending a strong message to the perpetrators.", "2020-02-24T20:00:37.000Z": "Great to see @realDonaldTrump and @FLOTUS in India to show their support for one of America's closest allies. We are united in the fight against terrorism! http:// ow.ly/TbP850yulak  #gapol Trump in India: From DDLJ to Sachin: Key quotes of Donald Trump at Motera Stadium | India News -... India News: NEW DELHI: US President Donald Trump mentioned DDLJ (Dilwale Dulhania Le Jayenge), Sholay, Sachin Tendulkar and Virat Kohli as he addressed the crowd . timesofindia.indiatimes.com", "2020-02-24T17:27:20.000Z": "With 477 wins, 11 state championships, and 33 region titles, Larry Campbell is one of the most successful high school coaches in history. What an honor to spend some time with him in Lincoln County on Saturday. #gapol", "2020-02-24T17:10:12.000Z": "ICYMI: Georgia Tops the List of Best States for Black Entrepreneurs -> http:// ow.ly/MMfU50yufEU  #gapol  @MiddleGACEO Georgia Tops the List of Best States for Black Entrepreneurs middlegeorgiaceo.com", "2020-02-24T12:44:44.000Z": "We owe all our servicemen and women every ounce of support that we can while they serve overseas, but also when they return back to Georgia. The Cobb County Veterans Accountability and Treatment Court does just that -> http:// ow.ly/Rb5V50yu9D3  #gapol Veterans court offers a second chance in Cobb MARIETTA - As he makes his way to the front of the courtroom, not a crease in his brand-new suit, the military veteran has the attention of some of Georgia's mdjonline.com", "2020-02-22T17:15:07.000Z": "ICYMI: Center for teen trafficking victims in Georgia to open next week -> http:// ow.ly/Kila50ytfbR  #gapol Center for teen trafficking victims in Georgia to open next week Boys, girls, and transgender individuals between the ages of 12-17 will have a place to get immediate mental and physical care. ajc.com", "2020-02-22T16:22:38.000Z": "Excited to be down in Lincoln County this morning as Commission Chairman Walker Norman officially switched to the Republican Party. This fall will be Walker's first time running as a Republican since he first ran for office over 40 years ago. #gapol", "2020-02-22T14:53:04.000Z": "Georgia farmers work tirelessly to feed the world. They sweat, sacrifice, & weather whatever storms come their way. Proud of @universityofga student, Laurabeth Bland, for reminding @MikeBloomberg that these hardworking folks deserve respect & gratitude. Georgia college student responds to Mike Bloomberg's farming comments video.foxnews.com", "2020-02-21T13:00:48.000Z": "My balanced budget fully funds public school education, provides a well-deserved pay raise to our teachers, cracks down on dangerous gangs, & spurs economic growth & opportunity. These investments will keep our state safe, strong, and prosperous! http:// ow.ly/HNnI50yrGye  #gapol Kemp optimistic about his budget plan Gov. Brian Kemp said Wednesday he is optimistic about the state's midyear budget, even though the House is poised to pass a budget that restores many of the cuts the governor had wanted. accesswdun.com", "2020-02-21T11:31:40.000Z": "Georgia is a distribution hub for Mexican drug cartels. Through Operation Crystal Shield, federal, state, & local law enforcement will work to \"attack the entire supply chain\" and keep meth from being trafficked in Georgia & throughout the country. http:// ow.ly/wo1d50ysk1g  #gapol New enforcement operation focuses on meth trafficking hubs ATLANTA |ederal authorities are targeting methamphetamine \"transportation hubs\" around the country in an effort to block the distribution of the highly addictive drug, officials announced Thursday.... onlineathens.com", "2020-02-19T19:35:00.000Z": "The facility is Georgia's latest step in the fight against sex trafficking. Gov. @BrianKempGA and @GAFirstLady founded the GRACE Commission shortly after the governor took office. Georgia set to open first residential center for sex-trafficked youths The Receiving Hope Center in Paulding County has 20 private rooms, as well as classrooms and medical space. ajc.com", "2020-02-20T23:56:20.000Z": "Honored to be with you, Coach! #gapol Quote Tweet Coach Chad Lunsford @chadlunsford Awesome Night at the Evening with the President Event in Atlanta ... Always great to talk about Georgia Southern! #GATA", "2020-02-20T23:00:23.000Z": "#TBT : Last year, we prioritized school safety by providing $69 million in grants & doubling funding for mental health services in High Schools. We will continue to advance policies that put our students - and their safety - first! http:// ow.ly/RLMB50yrHik  #gapol Governor Kemp adds millions to mental health services in schools - 41NBC News | WMGT-DT MACON, Georgia (41NBC/WMGT)- Governor Brian Kemp is adding millions of dollars in a new mental health fund to schools.", "2020-02-20T17:06:36.000Z": "Human trafficking is a problem - not just in Metro Atlanta - but throughout Georgia. I applaud the Cecil Police Department in Cook County for doing their part to combat this evil industry and keep their citizens safe. http:// ow.ly/Qxe950yrFAN  #gapol Cecil Police Dept. arrests 3 in human trafficking, drug cases This is an ongoing investigation and police said it may result in more arrests. walb.com", "2020-02-19T14:00:33.000Z": "ICYMI: Georgia set to open first residential center for sex-trafficked youths -> http:// ow.ly/o3zP50yqeGF  #gapol Georgia set to open first residential center for sex-trafficked youths The Receiving Hope Center in Paulding County has 20 private rooms, as well as classrooms and medical space. ajc.com", "2020-02-19T11:23:13.000Z": "Hardworking Georgians agree: Our teachers deserve a pay raise! http:// ow.ly/R8Ft50yqeDt  #gapol UGA poll: Georgians back Kemp's teacher pay hike ajc.com", "2020-02-18T22:50:05.000Z": "In 2017, 194 veterans committed suicide in Georgia. We are working to change that. These men and women sacrificed for our freedom. We will do our part to keep them safe. http:// ow.ly/pAG050ypJyd  #gapol Gov. Kemp joins initiative to prevent and reduce veteran suicides Georgia Governor Brian Kemp recently visited the Emory Healthcare Veterans Program in DeKalb County to tour the facility and sign a letter joining the Governors' Challenge that aims to help mdjonline.com", "2020-02-18T19:52:49.000Z": "Together, we will enhance access to quality healthcare providers in every part of our state! #gapol Quote Tweet Kennesaw State @kennesawstate In case you missed the announcement - KSU and @WellStarHealth have joined forces to address Georgia's nursing shortage. Thank you @BrianKempGA for joining us today.", "2020-02-18T19:51:39.000Z": "Georgia is a state that values life and it's abundantly clear that Georgia's junior Senator, @kloeffler , does too! #gapol Quote Tweet Kelly Loeffler @KLoeffler Great morning with @BrianKempGA & @marjoriesba at First Care Women's Clinic in Cobb County. Honored to have @SBAList 's support. I'll always defend life & advance policies that protect the most vulnerable. #gapol  #gasen", "2020-02-18T19:50:43.000Z": "So grateful for our American heroes & honored to do my part to help keep these brave men and women safe. #gapol Quote Tweet IAVA @iava Georgia Gov. @BrianKempGA agreed to join a federal initiative for preventing suicides among U.S. service members, veterans and their families. http:// bit.ly/2UY7xTY", "2020-02-14T21:21:18.000Z": "Congratulations  to the three veterans on their graduation from #CobbCounty Veteran's Court this morning! #cobbsheriff Thank you @BrianKempGA  @RepLoudermilk We appreciate your support & attendance today! https:// instagram.com/p/B8j9lDhJC-v/ ?igshid=17fetbn6hddm8 ", "2020-02-17T23:10:05.000Z": "Good reminder of what's important in life...and great reference to @GAFirstLady 's speech from Weekend for Wildlife. Keep choppin'! #gapol", "2020-02-17T22:26:10.000Z": ". @GAFirstLady and Amy Porter made a stop in Greensboro to show their support for U.S. Senator @kloeffler ! Truly appreciate the Senator's hard work in Washington and commitment to Georgia values! #gapol", "2020-02-17T12:55:48.000Z": "It all starts in the classroom. That's why I am championing another pay raise for Georgia teachers. By investing in our educators, we will ensure a safer, stronger, and more prosperous future for our state. http:// ow.ly/AiKX50yofa8  #gapol Gov. Kemp Reaffirms Intention To Give Teachers Raises | 90.1 FM WABE On Thursday, Gov. Brian Kemp restated his commitment to giving teachers a $2,000 raise this year. The governor made the comments after taking a tour of the Career Technical and Agricultural Education... wabe.org", "2020-02-16T04:33:52.000Z": "Honored to attend the Georgia Historical Society 2020 Trustees Gala tonight in Savannah with @GAFirstLady . Enjoyed spending some time with Coach Vince Dooley, Attorney General Barr, and Georgia Trustee Bob Jepson. #gapol", "2020-02-15T20:15:06.000Z": "Two years ago, we lost Coach Billy Henderson but his legacy lives on in the hearts of those who were honored to know him. Today and every day we remember: It Can Be Done! http:// ow.ly/La0050ynhC8  #gapol COACH BILLY HENDERSON DOCUMENTARY: \"IT CAN BE DONE\" \"IT CAN BE DONE\" - The Story of Coach Billy Henderson. A friend of mine in Athens, GA who played football for Coach Henderson at Clarke Central HS, sent me t... youtube.com", "2020-02-15T17:00:18.000Z": "When traveling the state, educators & parents often complain ab the abundance of mandated tests that make it difficult for students to focus & learn. This year, we will cut the # of high tests & empower teachers to do what they do best - TEACH! http:// ow.ly/p7QL50ynhsx  #gapol Georgia looking at fewer, shorter, different big tests Gov. Brian Kemp's rollback of the Georgia Milestones tests would also make them shorter, change when they are taken and remove comparisons to nation ajc.com", "2020-02-15T14:22:09.000Z": "Last year, we launched the Gang Task Force to help local LEOs & prosecutors fight organized crime in their community. Now, I am adding more agents at the @GBI_GA so we can Stop and Dismantle dangerous street gangs in Georgia! http:// ow.ly/hDtH50ynhdR  #gapol Governor Kemp proposes seven new GBI positions to fight gangs in Georgia ATLANTA (WRBL)- The Georgia Bureau of Investigation - or the GBI hopes to get more state funds to tackle a growing problem in Georgia - gangs. Georgia Governor Brian Kemp wants to creat wrbl.com", "2020-02-14T22:28:49.000Z": "\"And now these three remain: faith, hope and love. But the greatest of these is love.\" - 1 Corinthians 13:13\n\nHappy Valentine's Day to my wife and our First Lady, Marty Kemp! #gapol", "2020-02-14T14:12:13.000Z": "\"And now these three remain: faith, hope and love. But the greatest of these is love.\" - 1 Corinthians 13:13\n\nHappy Valentine's Day to my wife and our First Lady, Marty Kemp! #gapol", "2020-02-14T14:10:13.000Z": "Together, we can dismantle the remnants of Common Core, reduce high stakes testing, retain the best teachers, and enhance educational outcomes in every part of our state. With your help, we will build a safer, stronger, & more prosperous Georgia! http:// ow.ly/1Jfv50ym9ke  #gapol Kemp seeks support for teacher pay raise during Cobb school visit Gov. Brian Kemp traveled to a high school to promote his budget, which includes $2,000 teacher pay raise that may conflict with lawmakers' priorities ajc.com", "2020-02-14T03:18:11.000Z": "To realize our full potential as a state, we must fully fund public school education, champion our educators, and put students - not the status quo - first. http:// ow.ly/3kSD50ym9jO  #gapol Kemp seeks support for teacher pay raise during Cobb school visit Gov. Brian Kemp traveled to a high school to promote his budget, which includes $2,000 teacher pay raise that may conflict with lawmakers' priorities ajc.com", "2020-02-13T16:17:29.000Z": "\"Dot\" Burns was a longtime leader of the #GAGOP who blazed a trail for people like me to follow. She will be sorely missed by many but her legacy of service will live on for years to come. http:// ow.ly/AYlc50ylDYq  #gapol Dorothy Burns Obituary - Brunswick, GA Celebrate the life of Dorothy Burns, leave a kind word or memory and get funeral service information care of Edo Miller and Sons Funeral Home. dignitymemorial.com", "2020-02-12T13:13:17.000Z": "As a pro-life governor, I am proud of our efforts to protect the unborn. Now, we must champion the most vulnerable among us when they leave the delivery room. http:// ow.ly/XGE750yknXw  #gapol Kemp begins rolling out Georgia foster care overhaul bills ajc.com", "2020-02-10T23:42:23.000Z": "Thanks to @realDonaldTrump and the efforts of @sendavidperdue  @SenatorLoeffler and @RepBuddyCarter , SHEP is moving closer to completion. This is a HUGE economic development win for our state and country! http:// ow.ly/KIry50yiQn9  #gapol Trump budget seeks $93.6 million this year for deepening of Savannah port ajc.com", "2020-02-10T23:37:25.000Z": "Glad to be back in Georgia after meeting with  Governors at the @WhiteHouse to discuss expanding STEM education and workforce development opportunities, enhancing access to healthcare, lowering prescription drug costs, & reducing burdensome regs. Great group of  leaders! #gapol", "2020-02-10T15:33:36.000Z": "#FakeNews headline. Governors from around the country gathered to thank @realDonaldTrump for championing vets, cracking down on sex trafficking, passing #USMCA . He applauded efforts on the state level to grow jobs & opportunity. Great evening! http:// ow.ly/44ES50yijtR  #gapol Trump hosts governors, claims credit for their performance WASHINGTON (AP) \" President Donald Trump claimed some of the credit Sunday as he congratulated America's governors for what he said is the 'tremendous' yet sometimes difficult job they're doing... onlineathens.com", "2020-02-10T15:24:12.000Z": ". @AUG_Chronicle : \"Kemp's plan deserves an A-plus.\" http:// ow.ly/h3yS50yiiz1  #gapol Editorial: Give testing proposal a passing grade Does it seem like your children and grandchildren are always taking tests at school?They are.Students take tests to show their teachers what they've learned. And on top of that, they take standardi... augustachronicle.com", "2020-02-10T01:33:08.000Z": "Incredible evening at the @WhiteHouse with @realDonaldTrump  @Mike_Pence  @SecretarySonny and Governors from across the country. Great time to celebrate the President's leadership on #USMCA and pro growth policies that are creating jobs and opportunity on the state level. #gapol", "2020-02-10T01:01:29.000Z": "Ran into \"The Gipper\" at the @WhiteHouse and had to snap a photo with @GAFirstLady ! #gapol", "2020-02-09T18:08:27.000Z": "It's outrageous that our men & women in uniform are being targeted by criminals. Thankfully, these two NYPD officers are ok but who is next? We must re-affirm support for our LEOs. In this dangerous environment, they need it more than ever. http:// ow.ly/yA7d50yhzz0  #gapol Two NYPD Officers Shot in Incidents Being Called Assassination Attempts Two on-duty New York Police Department officers were shot in the Bronx within hours of each other over the weekend, in two incidents that police and city officials called assassination attempts. wsj.com", "2020-02-08T23:00:08.000Z": "Georgia is a state that cherishes life. We believe that every person has value. That's why we are championing legislation to keep foster children safe, encourage adoption, & ensure that every young Georgian has the opportunity to live in a loving home. Gov. Kemp's foster-care package starts moving in General Assembly ATLANTA - Legislation that would close a loophole in Georgia law pertaining to sexual misconduct by a foster parent was introduced in the state House of Representatives last week. mdjonline.com", "2020-02-08T22:14:57.000Z": "So proud of @GAFirstLady for her commitment to supporting sex trafficking survivors and destroying this evil industry! #gapol Quote Tweet First Lady Marty Kemp @GAFirstLady \"Know there's a way out. Know that we are here to help them... we are fighting hard for them every day so they don't have to choose that life.\" http:// bit.ly/38lWg45  #gapol", "2020-02-08T21:21:24.000Z": "Powerful profile piece in @USATODAY about @GAFirstLady and her tireless work through the GRACE Commission to end sex trafficking in our state. I am so proud of what she's accomplished and remain 100% committed to shutting down this evil industry. http:// ow.ly/ro6q50yhgkQ  #gapol 3,600 kids become victims of sex trafficking in Georgia each year. The first lady is trying to stop... Each year, thousands of children are sold for sex in Georgia. The state's first lady, Marty Kemp, is on a mission to put an end to it. usatoday.com", "2020-02-07T17:15:16.000Z": "ICYMI: Here's why local officials support Brian Kemp's plan to reduce standardize tests -> http:// ow.ly/CTjr50ygmUg  #gapol Here's why local officials support Brian Kemp's plan to reduce standardized tests When Gov. Brian Kemp and state Superintendent Richard Woods announced a plan Tuesday to cut five mandatory standardized tests for Georgia public school students, it was a welcome message to Lee Ann... forsythnews.com", "2020-02-07T14:50:43.000Z": "The Georgia Criminal Street Gang Database will help law enforcement and prosecutors \"Stop and Dismantle\" criminal networks in our state. Together, we will keep our families safe and Georgia's future bright. http:// ow.ly/rXAx50ygmND  #gapol Gov. Kemp: Georgia Criminal Street Gang Database now operational ATLANTA, GA (WRBL) - A major development in the state of Georgia's efforts to combat gang violence. Wednesday Governor Brian Kemp announced a new database that will serve an information wrbl.com", "2020-02-06T21:15:33.000Z": "Stopped by Jimmie's in Albany for a three-in-one (chili, cheese, and slaw) dog. Great food, great people, great day to be a Georgian! #gapol", "2020-02-05T13:07:07.000Z": "Last night, @realDonaldTrump delivered a powerful #SOTU address that highlighted his historic accomplishments at home & abroad. He honored the true heroes among us & shared a bold vision for a safer, stronger nation. I'm proud to back @POTUS and his efforts to Keep America Great!", "2020-02-05T01:49:05.000Z": "On the campaign trail, I promised to empower teachers and enhance educational outcomes by reducing the number of standardized tests that Georgia students are forced to take. Today, we took a huge step forward in turning that promise into reality. http:// ow.ly/MKnN50ydMLb  #gapol Kemp wants fewer tests, especially in high school Georgia governor backing legislation to cut five Milestones exams ajc.com", "2020-02-04T03:29:43.000Z": "Really sad to read about Rush Limbaugh's lung cancer diagnosis. As a longtime listener, I always look forward to hearing his perspective on pressing issues of the day. He's one of the most powerful voices of the conservative movement & our prayers are with him! #ElRushbo  #gapol", "2020-02-02T23:57:13.000Z": "On Saturday, Dep. Sheldon Whiteman was laid to rest. He was honored for his service & will be remembered always for his commitment to public safety. Our prayers are w/ his family, loved ones, and fellow LEOs. May God's peace be with them today & every day. Hundreds of officers attend funeral for fallen Long County deputy sheriff A sea of blue flashing lights filled Highway 57 through Ludowici on Saturday as law enforcement vehicles approached Long County High School, where the funeral service for fallen Long County Deputy... savannahnow.com", "2020-02-02T04:07:43.000Z": "Honored by the warm welcome tonight at Weekend for Wildlife. Proud to support the Georgia Natural Resources Foundation and their efforts to preserve what makes our state great! #gapol", "2020-02-01T23:00:09.000Z": "Appreciate Newton County Sheriff Ezell Brown's strong support of our efforts to stop and dismantle gangs in Georgia. Together, we will keep our families and communities safe from violence. http:// ow.ly/aaQk50yb0hc  #gapol Sheriff Brown supports Gov. Kemp's gang initiatives NEWTON COUNTY, Ga. - Newton County Sheriff Ezell Brown said Thursday that he supports Georgia Governor Brian Kemp's initiatives to fight violent street gangs. covnews.com", "2020-02-01T15:24:34.000Z": "Always enjoyed watching Terry Fair play. He was a tough player and a Damn Good Dawg! May peace be with his family and friends during this time of mourning. http:// ow.ly/etXw50yaTJf  #gapol Georgia basketball star Terry Fair dies ajc.com", "2020-01-31T19:50:06.000Z": "A decade ago, Deborah Rider lost her 10-year old son, Nicholas, to gang violence. Today, we are doing our part to honor his life and ensure that no parent has to endure the pain of losing a child. http:// ow.ly/eHqr50yagMb  #gapol A mom thanks Kemp for gang plan. Defense attorneys cry foul Georgia Gov. Brian Kemp on Thursday, Jan. 30, 2020, proposed harsher sentences for gang members. A mother says thanks. Defense lawyers cry foul. ajc.com", "2020-01-31T16:55:08.000Z": "I am a big believer of the tourism industry in Savannah. If the Convention Center is bigger, it can house more events & bring more people to our state. Click the link to learn more about our efforts to spur growth in Coastal GA & beyond -> http:// ow.ly/gYjE50yagc4  #gapol Governor Kemp and state lawmakers discuss Savannah plans and projects ATLANTA (WSAV) - This week Savannah city leaders were in the state capitol presenting their wish list to Governor Brian Kemp and lawmakers as part of Savannah Chatham Day. Senator Ben Watson  wsav.com", "2020-01-31T02:55:03.000Z": "Another gang leader behind bars and away from our families. Well done, @CobbSheriff & @FBI ! http:// ow.ly/oABW50y9sYC  #gapol Feds arrest alleged gang leader in Marietta ajc.com", "2020-01-31T02:37:50.000Z": "Great to have my youngest daughter, Amy Porter, with me today for a tour at @RobinsAFB_GA and dinner with the @DodgeChamber . Long day but we kept choppin'! #gapol", "2020-01-30T22:45:06.000Z": "We have the highest workforce participation in state history but...we need more hardworking Georgians to meet the market demand! http:// ow.ly/H4gY50y9sS7  #gapol Kemp emphasizes workforce development in speech to Kiwanis But at the state Capitol, senators had just OK'd a cap on dual enrollment. saportareport.com", "2020-01-30T21:00:15.000Z": "This year, we are turning another campaign promise into reality. With tougher sentencing, resources for prosecutors & LEO, & staff to support the Task Force, we will Stop & Dismantle gangs. Together, we will keep our families, communities, & state safe. Kemp pitches stiff sentences in gang cases, more GBI power ajc.com", "2020-01-30T20:16:50.000Z": "Incredibly proud of the Spalding County Sheriff's Office and U.S. Marshals for tracking down - and arresting - one of the highest ranking gang members in the region. Keep up the good work! http:// ow.ly/iUBy50y9sNN  #gapol Sheriff: Gang leader arrested after hiding in attic, falling from ceiling ajc.com", "2020-01-29T20:10:11.000Z": "ICYMI: \"These record-breaking numbers are a testament to what we all know to be true: GA is leading the nation in business-friendly government and workforce development....we will continue to invest in our citizens & ensure GA remains at the top.\" http:// ow.ly/1ewy50y84Ol  #gapol Kemp: Georgia hits all-time low for unemployment Governor Brian Kemp is applauding record job growth numbers in 2019, saying the state has hit an all-time low for unemployment. cbs46.com", "2020-01-29T16:55:09.000Z": "To combat the gang crisis and keep Georgia families safe, we are going to empower prosecutors and law enforcement. Stay tuned for details on our legislative efforts to stop and dismantle street gangs in the Peach State! http:// ow.ly/kLX550y84Jt  #gapol Gov. Kemp pushing anti-gang measures in Georgia Georgia Governor Brian Kemp is trying to make good on his plan to reduce gang violence in the state. wtoc.com", "2020-01-29T15:29:04.000Z": "The Georgia Recovers campaign is actively working to change the social norms surrounding substance misuse and addiction. Together, we can save lives, restore families, strengthen our communities, and make Georgia a safer and healthier state for all. http:// ow.ly/nxBx50y84pJ  #gapol Addiction Recovery Community Reminds Kemp 'We're Everywhere' Gov. Brian Kemp made an appearance Tuesday morning at the Georgia Freight Depot, where hundreds of people in longterm recovery from addiction gathered... gpb.org", "2020-01-29T14:43:04.000Z": "Proud of @SouthernCompany for standing in support of our HBCUs in Georgia and throughout the country! http:// ow.ly/cwO850y80Kb  #gapol Southern Co. commits $50 million to historically black colleges Money will go to scholarships, internships, technology ajc.com", "2020-01-28T14:32:02.000Z": "The gang crisis in our state is VERY REAL and we are doing something about it. http:// ow.ly/gRT450y6Wmi  #gapol Gang 'crisis' in Georgia? It's real, safety officials tell lawmakers The GBI hopes Georgia lawmakers will grant the agency the power to investigate gang violence cases without an invitation from local law enforcement. ajc.com", "2020-01-27T22:45:08.000Z": "Under the leadership of @GAFirstLady , the GRACE Commission is \"raising awareness, working to disable legal and societal loopholes, and connecting with survivors to help them heal and hold their captors accountable.\" http:// ow.ly/IF5s50y5ceB  #gapol Opinion: Ga. will persist in fighting human trafficking ajc.com", "2020-01-27T20:00:57.000Z": ". @GAFirstLady : \"Brian and I are determined to end human trafficking in our home state, once and for all.\" http:// ow.ly/uYMe50y5ccU  #gapol Opinion: Ga. will persist in fighting human trafficking ajc.com", "2020-01-27T16:55:12.000Z": "\"With this legislation, we are showing the world that Georgians care about everyone who calls our state home - even those who feel invisible, even those who have no voice.\" Read @GAFirstLady 's OpEd about our efforts to end sex trafficking in GA -> http:// ow.ly/vCXa50y5cbk  #gapol Opinion: Ga. will persist in fighting human trafficking ajc.com", "2020-01-27T14:00:50.000Z": "Congratulations to DA Joyette Holmes for being named \"The 2019 @mdjonline Cobb Citizen of the Year!\" So proud of her hard work and tireless efforts to keep Cobb safe, strong, and prosperous. http:// ow.ly/Pxi350y5bOM  #gapol Connecting with people is what makes Cobb special, says Joyette Holmes, Cobb County's Citizen of... The 2019 MDJ Cobb Citizen of the Year Award goes to a woman dedicated to serving justice in Cobb County. mdjonline.com", "2020-01-26T23:55:58.000Z": "The Kemp Family is praying for the loved ones of @kobebryant and all who were on his helicopter today. Such a terrible tragedy. #gapol", "2020-01-26T18:02:45.000Z": ". @GAFirstLady penned an incredibly powerful OpEd about efforts to \"end human trafficking in our home state, once and for all.\" Click to read about this evil industry and proposed legislation to \"make Georgia a safe haven for survivors, not abusers.\" http:// ow.ly/T1FC50y5c6g  #gapol Opinion: Ga. will persist in fighting human trafficking ajc.com", "2020-01-24T12:40:13.000Z": "Thanks to @realDonaldTrump & Georgia lawmakers, the Peach State's unemployment rate is now at 3.2%. That's the lowest in Georgia history. http:// ow.ly/CThP50y3X5D  #gapol Georgia caps decade with modest hiring, record low unemployment Georgia hiring modest in December; trade wars a drag ajc.com", "2020-01-24T11:43:09.000Z": "\"Operation Benchwarmers,\" which was the largest law enforcement operation in ACC history, was a huge success. Thanks to the @TheJusticeDept , @FBI , & local LEOs working in concert, 23 drug and gun traffickers are behind bars & away from our children. http:// ow.ly/Bc5f50y3U4h  #gapol 2 dozen charged in drug, gun trafficking bust in Athens ajc.com", "2020-01-23T22:45:08.000Z": "As a pro-life Governor, I believe that we need to protect the unborn & the born. Our goal is clear: to keep kids safe, encourage adoption, & ensure that every Georgian has the opportunity to live in a safe and loving home. http:// ow.ly/Brps50y2VuG  #gapol  #TBT Kemp Pledges Teacher Raises, Adoption And Health Care Changes In State Of The State Address | 90.1... In his second State of the State address and proposed state budget, Gov. Brian Kemp has pledged a $2,000 pay raise for public school teachers, after having demanded budget cuts of most state agencies... wabe.org", "2020-01-23T20:00:42.000Z": "\"We must help victims tell their story in the courtroom without fear of retaliation. We must support survivors who want to enter the workforce but still bear the scars of the past.\" - Brian Kemp, State of the State address (January 17, 2020) #TBT  #gapol", "2020-01-23T16:55:11.000Z": "To support our students & teachers, care for the vulnerable, & grow jobs, we must be good stewards of your hard-earned tax $ & prioritize  financial resources. That means streamlining ops, eliminating duplicative gov't programs, & leveraging tech to best serve Georgians. #gapol", "2020-01-23T14:15:18.000Z": "ICYMI: Kemp budget adds staff to investigate surge in harassment complaints -> http:// ow.ly/ildC50y2E4M  #gapol Kemp budget adds staff to investigate surge in harassment complaints ajc.com", "2020-01-22T16:45:12.000Z": "This year, we will implement reforms that put our families first. Working with patients, providers, & private sector, we'll craft a remedy to reduce surprise medical billing. We will demand transparency, embrace empathy, & insist on fairness. http:// ow.ly/8sKe50y1TXC  #gapol Kemp targets surprise billing, pays homage to Isakson with Parkinson's research initiative georgiahealthnews.com", "2020-01-22T15:24:49.000Z": "On National Sanctity of Human Life Day, we re-affirm our commitment to protecting the innocent unborn and most vulnerable among us. Together, we will ensure that all Georgians have the opportunity to live, grow, and prosper. http:// ow.ly/EElJ50y23VP  #gapol", "2020-01-22T14:00:23.000Z": "Gangs continue to grow in size & scope, impacting every county in every part of our state. They are flooding our streets with weapons, drugs, violence, & fear - ripping apart the fabric of our communities & eroding the foundations of our families. http:// ow.ly/quoK50y1TRZ  #gapol Gov. Brian Kemp's 2020 agenda targets gangs, human trafficking ATLANTA - Gov. Brian Kemp made going after criminal gangs and human traffickers key planks in his 2018 campaign platform, and he made initial forays in those areas during his northwestgeorgianews.com", "2020-01-22T00:36:01.000Z": "This is absolutely outrageous! I'm stopping by @Academy on Atlanta Highway next time I'm home in @VisitAthensGA to help re-fill Michael Davenport's donation box. Hope you will join me. Together, we can make this right. http:// ow.ly/lN0m50y1wAK  #gapol  #GoDawgs Armless Athens artist robbed of donation bucket, supplies ajc.com", "2020-01-21T22:20:49.000Z": "So proud of @GAFirstLady & the GRACE Commission for partnering w/ local orgs to craft legislation that will help combat sex trafficking in GA. Together, we will protect the vulnerable, put traffickers behind bars, & help survivors recover & prosper. http:// ow.ly/CUvR50y1qoT  #gapol Georgia governor's human trafficking crackdown targets 'modern slavery' ajc.com", "2020-01-20T13:50:09.000Z": "Our logistics infrastructure, top-ranked workforce, & nationally recognized business climate have earned us the distinction of No. 1 State for Business 7 years in a row, & Amazon's investments are a testament to that record of success. http:// ow.ly/Q07050xZh17  #gapol Amazon to open new distribution center in Newnan, Ga., create 500 jobs Amazon will lease a more than 1-million-square-foot facility at The Cubes at Bridgeport in Coweta County. bizjournals.com", "2020-01-20T12:56:07.000Z": "Dr. King was a transformational leader who put his mission ahead of personal comfort. A minister, missionary, & champion of the Civil Rights Movement, he forever changed our culture. His legacy inspires us to treat all people w/ the dignity & respect they deserve. #MLKDay", "2020-01-19T17:34:04.000Z": "ICYMI: @amazon opening new fulfillment center in Newnan -> http:// ow.ly/ERXx50xZgZh  #gapol Gov. Kemp: Amazon opening new fulfillment center in Newnan The online retail giant will expand its presence in metro Atlanta, adding about 500 full-time jobs at the new facility.", "2020-01-19T17:21:15.000Z": "ICYMI: \"The State of the State is strong and we are just getting started!\" Watch here -> https:// tinyurl.com/tptlk8a  #gapol", "2020-01-18T21:58:42.000Z": "Thanks to @toddmr for stopping by this week. Honored to help out in the #IceBucketChallenge ! https:// youtu.be/OXkMVUaiRH4  #gapol Todd Rehm - Ice Bucket Challenge with Governor Brian Kemp youtube.com", "2020-01-19T03:11:28.000Z": "Honored to participate in the annual Savannah Hockey Classic where @UGAHockey and @GTHockey will battle it out for the Thrasher Cup. Awesome crowd for this great event! #gapol  #GoDawgs", "2020-01-17T19:45:32.000Z": "Georgia Governor @BrianKempGA continues to be a national leader in recruiting and retaining hardworking teachers!\n\n. @AP : Gov. Kemp wants more than $380 million for Georgia teacher pay raises => https:// wjcl.com/article/gov-br ian-kemp-wants-more-than-dollar380-million-for-georgia-teacher-pay-raises/30561820#   #gagov  #gapol Gov. Brian Kemp wants more than $380 million for Georgia teacher pay raises Georgia Gov. Brian Kemp says his budget proposal includes a $2,000 pay raise for public school teachers, at a projected cost of more than $380 million. wjcl.com", "2020-01-19T03:04:53.000Z": "Big thanks to the @UGAHockey for the jersey! #GoDawgs  #gapol Quote Tweet Lyndsey Gough @LGonTV . @BrianKempGA gets his own #IceDawgs ( @UGAHockey ) jersey.", "2020-01-19T01:30:01.000Z": "Georgia governor Brian Kemp ( @GovKemp ) made his way down to Savannah for the ceremonial puck drop between @UGAHockey and @GT_Hockey . @BrianKempGA  #SAVhockey", "2020-01-19T03:03:24.000Z": "Honored to be here! #gapol Quote Tweet Frank Sulkowski WJCL @TheBigGuyWJCL The Savannah Hockey Classic is so big even @BrianKempGA rolls into town for the action twitter.com/AmyZimmerWJCL/", "2020-01-19T01:05:45.000Z": "We've got @BrianKempGA and Uga in the house as @UGAHockey gets set to take on @GT_Hockey A win and the Dawgs take home another Thrasher Cup @WSAV  @WSAVBlitz", "2020-01-19T00:30:38.000Z": "We are down in Coastal Georgia for the @GeorgiaHockey  @GTHockey game. Had to stop by Spanky's - Home of the Original Chicken Finger - for a quick bite! Great to spend some time with Ansley Williams at this Savannah staple. #gapol", "2020-01-16T22:17:35.000Z": "This morning, I delivered my second State of the State Address and cast a bold vision to continue building a state that gives all Georgians the opportunity to live, grow, and prosper. We are doing great work, so we can't stop choppin'! #gapol", "2020-01-14T19:45:11.000Z": "The legislature is back in session and I remain focused on keeping Georgia families safe. Building off of our momentum from 2019, we will continue to crack down on street gangs and human trafficking in Georgia. http:// ow.ly/eRU650xUFDx  #gapol Kemp 2020 agenda targets gangs, human trafficking ATLANTA - Gov. Brian Kemp made going after criminal gangs and human traffickers key planks in his 2018 campaign platform, and he made initial forays in those areas during his first year in office.W... savannahnow.com", "2020-01-14T17:05:15.000Z": "To continue the fight against human trafficking in Georgia, we have launched an educational website, will encourage training for state employees, and asked the Georgia Public Safety Training Center to host two self-defense classes on Jan. 30. http:// ow.ly/kXyW50xUFzt  #gapol Georgia Sets Anti-Trafficking Training For Employees, Others | 90.1 FM WABE Georgia is offering a new online training course to educate people on how to recognize human trafficking and how to take action if someone spots it. Gov. Brian Kemp and first lady Marty Kemp announ... wabe.org", "2020-01-14T15:48:49.000Z": "Marty, the girls, and I are truly thankful for @IvankaTrump 's efforts to combat sex trafficking in our country. Together, we will make it clear that Georgia - and our nation - will not rest until this evil industry is destroyed. http:// ow.ly/ec2R50xVa37  #gapol Ivanka Trump to meet sex trafficking survivors in Georgia Ivanka Trump is scheduled to arrive in Atlanta on Tuesday to tour facilities that help human trafficking survivors. wsav.com", "2020-01-14T14:05:14.000Z": "ICYMI: State launches human trafficking awareness website -> http:// ow.ly/9F7550xUFsT  #gapol State launches human trafficking awareness website ATLANTA - Gov. Brian Kemp launched a website aimed at training state workers and the general public in how to detect and respond to warning signs of human trafficking. mdjonline.com", "2020-01-14T03:14:30.000Z": "Every day, innocent children are bought and sold in Georgia. Under the leadership of @GAFirstLady and the GRACE Commission, we are working to change that. http:// ow.ly/OxPQ50xUFs2  #gapol Georgia launches human trafficking awareness website ATLANTA | Gov. Brian Kemp launched on Monday a website aimed at training state workers and the general public in how to detect and respond to warning signs of human trafficking.The Georgia Department... onlineathens.com", "2020-01-13T02:13:39.000Z": "Proud of the Gilmer County Sheriff's Office for leading efforts to stop and dismantle gangs in North Georgia. This arrest is a step toward a safer tomorrow! #gapol  http:// ow.ly/K5MJ50xTune  #gapol Cops: 2 Ghost Face Gangsters arrested, $20K worth of meth seized in North Georgia ajc.com", "2020-01-13T02:06:28.000Z": "Congratulations to the Georgia Air National Guard's new wing commander, Col. Amy Holbeck! Honored to be on hand for this historic day in our state! http:// ow.ly/95YD50xTugJ  #gapol First female Georgia Air National Guard wing commander takes reins Sunday - 41NBC News | WMGT-DT WARNER ROBINS, Georgia (41NBC/WMGT) - The Georgia Air National Guard will see its first female wing commander ever. 116th Air Control Wing vice wing commander Col. Amy Holbeck will take command Jan....", "2020-01-11T20:45:14.000Z": "Under the leadership of @GAFirstLady and the GRACE Commission, Georgia is working to end modern slavery. RT to participate in #HumanTraffickingAwarenessDay . Together, we can undermine this evil industry and save innocent lives. #gapol Quote Tweet First Lady Marty Kemp @GAFirstLady Today is #HumanTraffickingAwarenessDay . Join our family in wearing blue to raise awareness about this terrible industry. I encourage you all to learn the warning signs to identify possible instances of trafficking and who to contact for help - doing so will help save lives!", "2020-01-10T17:10:12.000Z": ". @NFIB : \"One reason our members feel confident is that Gov. Brian Kemp has is committed to enhancing the small business climate and prioritized it since he came into office.\" http:// ow.ly/H8c350xShs9  #gapol A lot to be happy about in 2019 Georgia small businesses had a lot to be happy about in 2019. November's unemployment rate fell to a historic record low of 3.3%. In fact, the biggest complaint from business owners is that they... coastalcourier.com", "2020-01-10T14:49:08.000Z": "We launched the @GBI_GA Gang Task Force to not only curb violence but to completely dismantle organized crime. By partnering w/ local law enforcement & prosecutors, we will protect our families from harm & ensure a safer, stronger future. http:// ow.ly/YTFs50xScmu  #gapol MS-13 Gang Tied to Fewer Murders on Long Island After Takedown The arrest of alleged leaders of the MS-13 street gang in Nassau County two years ago has led to a sharp drop in killings associated with the violent group, law-enforcement officials said this week. wsj.com", "2020-01-09T14:36:12.000Z": "Appreciate our LEOs and the sacrifices they make to keep us safe! #gapol Quote Tweet Governor Brian P. Kemp @GovKemp \"Today is Law Enforcement Appreciation Day. I want to thank all those men and women who work hard every day, serving our local communities and our state. I hope all Georgians, when they see a law enforcement officer today, will thank them for their service.\" #gapol", "2020-01-09T14:05:14.000Z": "Proud of Gilmer County Deputies and U.S. Marshalls for working in tandem to put dangerous gang members behind bars. Appreciate their commitment to public safety and Georgia's future. http:// ow.ly/DIYu50xQOw0  #gapol Cops: Ghost Face Gangster arrested on meth trafficking charges in North Georgia ajc.com", "2020-01-09T04:11:24.000Z": "Congratulations to @FrommJake on his many accomplishments at the @universityofga . He's a winner, a leader, and a Damn Good Dawg. We wish Jake all the best in the @NFL ! #GoDawgs  #gapol Quote Tweet JakefromStateFromm @FrommJake Go Dawgs and God Bless", "2020-01-07T13:50:06.000Z": "To keep our state moving in the right direction, we have to crack down on gangs and sex trafficking, and help the most vulnerable among us. It can and will be done! http:// ow.ly/vzCu50xOZQf  #gapol One-on-one with Gov. Brian Kemp FOX 5's Claire Simms sits down with Gov. Brian Kemp a week before the 2020 Georgia Legislative Session begins fox5atlanta.com", "2020-01-06T23:10:07.000Z": "\"Since the legislative session ended last spring - together with State School Superintendent Richard Woods - we have reduced high-stakes testing and begun the formal process to ultimately dismantle Common Core in our state...\" http:// ow.ly/4SJo50xNUN2  #gapol A historic year for Georgia In January of 2019, I took the Oath of Office and officially became Georgia's 83rd Governor. Since then, I have worked around the clock to make good on campaign promises northwestgeorgianews.com", "2020-01-06T21:20:06.000Z": "\"Above all, we will continue to put hardworking Georgians first in 2020. We will stand with our farmers, support our veterans, defend our conservative values, and always protect the most vulnerable among us.\" http:// ow.ly/68MR50xNUZh  #gapol A historic year for Georgia In January of 2019, I took the Oath of Office and officially became Georgia's 83rd Governor. Since then, I have worked around the clock to make good on campaign promises northwestgeorgianews.com", "2020-01-06T19:55:08.000Z": "\"..in 2019, teachers received the largest pay raise in state history. We prioritized the safety of our children, teachers, & staff w/ nearly $70m in locally-controlled school security grants, and we doubled funding for mental health services...\" http:// ow.ly/3aon50xNUL2  #gapol A historic year for Georgia In January of 2019, I took the Oath of Office and officially became Georgia's 83rd Governor. Since then, I have worked around the clock to make good on campaign promises northwestgeorgianews.com", "2020-01-06T18:40:07.000Z": "\"...we will continue to value life by championing reforms to our state's foster care & adoption laws. We will invest in education, strengthen our anti-gang and human trafficking laws, & spur economic growth by eliminating red tape for job creators.\" http:// ow.ly/4slP50xNUXx  #gapol A historic year for Georgia In January of 2019, I took the Oath of Office and officially became Georgia's 83rd Governor. Since then, I have worked around the clock to make good on campaign promises northwestgeorgianews.com", "2020-01-06T17:05:13.000Z": "\"By starting the GRACE Commission, @GAFirstLady is raising awareness and coordinating efforts to end trafficking in the Peach State...they are providing expertise and training, and they will be leading the way this legislative session...\" http:// ow.ly/ZYSV50xNUv7  #gapol A historic year for Georgia In January of 2019, I took the Oath of Office and officially became Georgia's 83rd Governor. Since then, I have worked around the clock to make good on campaign promises northwestgeorgianews.com", "2020-01-06T15:35:05.000Z": "\"I am confident we can continue to deliver critical services to the public while also budgeting conservatively and living within our means-just as millions of Georgians do every day.\" http:// ow.ly/K3wF50xNUVB  #gapol A historic year for Georgia In January of 2019, I took the Oath of Office and officially became Georgia's 83rd Governor. Since then, I have worked around the clock to make good on campaign promises northwestgeorgianews.com", "2020-01-06T13:55:14.000Z": "\"This legislative session, I look forward to working with the General Assembly to strengthen anti-gang laws and give law enforcement greater tools to shut down illegal operations.\" http:// ow.ly/AZcs50xNUrw  #gapol A historic year for Georgia In January of 2019, I took the Oath of Office and officially became Georgia's 83rd Governor. Since then, I have worked around the clock to make good on campaign promises northwestgeorgianews.com", "2020-01-06T13:30:23.000Z": "\"It is a great time to be a Georgian...Georgia was recently named the top state for business for an unprecedented 7th straight year. The unemployment rate - 3.3% - is the lowest in state history, & the number of jobs in our state has never been higher.\" A historic year for Georgia In January of 2019, I took the Oath of Office and officially became Georgia's 83rd Governor. Since then, I have worked around the clock to make good on campaign promises northwestgeorgianews.com", "2020-01-06T12:45:06.000Z": "\"we have partnered...to draft two unique, innovative healthcare waivers that meet the needs of hardworking Georgians, keep our budget balanced, & reflect our values, vision. These proposals shake up the status quo and put patients first.\" http:// ow.ly/yVvr50xNUQo  #gapol A historic year for Georgia In January of 2019, I took the Oath of Office and officially became Georgia's 83rd Governor. Since then, I have worked around the clock to make good on campaign promises northwestgeorgianews.com", "2020-01-06T12:12:03.000Z": "In 2019, we made history but there's still more work to be done. Looking ahead, we remain focused on building a safer, stronger, and more prosperous state. Above all, we will put hardworking Georgians first. http:// ow.ly/f1JL50xNUkl  #gapol A historic year for Georgia In January of 2019, I took the Oath of Office and officially became Georgia's 83rd Governor. Since then, I have worked around the clock to make good on campaign promises northwestgeorgianews.com", "2020-01-04T23:44:19.000Z": "Big win for @UGABasketball ! #GoDawgs  #gapol Quote Tweet Georgia Basketball @UGABasketball UPSET FINAL - 65 UGA 62 UM", "2020-01-04T04:00:36.000Z": ". @DAndreSwift is a talented football player who made a HUGE impact on and off the football field. While we will miss watching DAndre play between the hedges, we will cheer for him as he fulfills his dream of competing in the @NFL . #godawgs  #dgd Quote Tweet SWIFT @DAndreSwift SE7EN ERA", "2020-01-03T17:10:10.000Z": "Great to see that Georgia's next U.S. Senator @kloeffler made a trip to Savannah to meet with local leaders and learn about the incredible economic impact of our ports. I know she will do her part to keep Georgia growing! http:// ow.ly/Gjib50xMocy  #gapol Senator-designate Loeffler visits Georgia Ports Authority, says she'll vote 'no' on impeachment Georgia Senator-elect Kelly Loeffler paid a visit to Georgia Ports Authority on Thursday, where she spoke highly of the port expansion project and said she would give a 'no' vote during President... savannahnow.com", "2020-01-03T13:53:02.000Z": "ICYMI: Georgia Awarded an \"A\" for Anti-Human Trafficking Efforts -> http:// ow.ly/eYqe50xMnJN  #gapol  @SharedHope", "2020-01-02T12:18:00.000Z": ". @KirbySmartUGA and the Dawgs hunkered down and chopped a lot of wood to become @SugarBowlNola champs! Well done and #GoDawgs ! #gapol Quote Tweet Georgia Football @GeorgiaFootball HOW 'BOUT THEM DAWGS  #SugarBowl  #GoDawgs", "2019-12-30T20:46:10.000Z": "Gwinnett Animal Shelter just received some new - and adorable - animals in need of a loving home. Start the New Year off right by adopting a dog, cat, or even a bunny! https:// bit.ly/2MGAJKw", "2019-12-30T20:10:07.000Z": "Best of luck to the @GeorgiaStateFB as they take on Wyoming in the @novaAZBOWL on Tuesday. Go Panthers! http:// ow.ly/gzDL50xJTDW  #gapol Wyoming vs. Georgia State: Arizona Bowl preview and picks against the... Georgia State and Wyoming both have wins over SEC teams in 2019. sports.yahoo.com", "2019-12-30T17:15:12.000Z": ". @AUG_Chronicle : \"That more people are employed has to be connected with Georgia's years-long ranking as the No. 1 state in which to do business. Whichever circumstance is helping drive the other, by all means let's see it keep going.\" #gapol Editorial: Good news for jobs, health care A regular recounting of good news and bad news we haven't yet managed to touch on:GOOD TOSS: Just in time for Christmas, Georgia Attorney General Chris Carr got a great gift from the Fifth Circuit of... augustachronicle.com", "2019-12-30T14:00:35.000Z": "Excited to see that unemployment rates in Savannah have dropped to 2.6%. Our entire state continues to see the positive impact of low taxes, business-friendly government, and pro-growth policies! http:// ow.ly/UIK650xJz2w  #gapol Savannah makes history with record low unemployment rates Finding a job is something many people struggle with, but the City of Savannah is paving the way with a historic low employment rate. wsav.com", "2019-12-29T23:31:55.000Z": "John Lewis has always been a fighter and I know he will approach this challenge the same way: with passion, grit, and determination. Along with millions of people, @GAFirstLady , the girls, and I are praying for @repjohnlewis and his family. #gapol Quote Tweet AJC @ajc The 79-year-old Atlanta Congressman and civil rights icon said that he is prepared to fight. http:// bit.ly/2F2Ooar", "2019-12-28T23:50:37.000Z": "Incredibly sad news out of Lafayette, LA earlier today. I hope you will join us in praying for the McCord and Ensminger families during this dark time. May God provide peace to all who mourn. #gapol Quote Tweet First Lady Marty Kemp @GAFirstLady Our hearts are absolutely broken for  the McCord and Ensminger families. Brian, the girls, and I pray the Lord is with them and comforts the entire LSU community following this tragic loss. http:// Bit.ly/2SyUhnK", "2019-12-28T02:45:03.000Z": "\"With well-over one million gang members in the United States, 70,000 of which are in Georgia, we face a gang crisis.  Fortunately, Governor Kemp is not only prepared to confront that crisis, but to battle it-and win.\" http:// ow.ly/IyxJ50xIVRy  #gapol GBI: Working to \"Stop and Dismantle\" Gangs in Georgia | Vald GBI Director Vic Reynolds submits to Valdosta Today this op-ed on dismantling gangs in Georgia valdostatoday.com", "2019-12-27T23:00:10.000Z": ". @GBI_GA Dir. Vic Reynolds: \"The wantonness of gang lawbreaking is exemplified in cases all over the state of Georgia.  This is not simply a metropolitan Atlanta problem, but an issue we are seeing in suburban and rural areas of our state as well.\" http:// ow.ly/pOI550xIVQu  #gapol GBI: Working to \"Stop and Dismantle\" Gangs in Georgia | Vald GBI Director Vic Reynolds submits to Valdosta Today this op-ed on dismantling gangs in Georgia valdostatoday.com", "2019-12-27T21:38:33.000Z": ". @GBI_GA Director Vic Reynolds: \"GBI is committed to Governor Kemp's anti-gang vision. We are prepared to continue this fight- and win it- for the safety of law-abiding Georgians everywhere.\" http:// ow.ly/a0bW50xIVND  #gapol GBI: Working to \"Stop and Dismantle\" Gangs in Georgia | Vald GBI Director Vic Reynolds submits to Valdosta Today this op-ed on dismantling gangs in Georgia valdostatoday.com", "2019-12-26T20:17:16.000Z": "Back at @TheVarsity1928 . What'll ya have! #gapol", "2019-12-25T18:44:58.000Z": "Appreciate our State Troopers for working around the clock - and on Christmas - to keep Georgians safe! #gapol  @ga_dps", "2019-12-25T16:39:57.000Z": "\"For unto us a child is born...\" - Isaiah 9:6\n\nFrom the Kemp Family to yours, we wish you VERY Merry Christmas and a Happy New Year! #gapol  #MerryChrismas", "2019-12-25T14:07:30.000Z": "From our family to yours, Merry Christmas! #gapol Quote Tweet Governor Brian P. Kemp @GovKemp \"And the angel said unto them, Fear not: for, behold, I bring you good tidings of great joy, which shall be to all people. For unto you is born this day in the city of David a Saviour, which is Christ the Lord.\" Luke 2:10-11\n\nMerry Christmas from the Kemp Family!", "2019-12-23T11:58:27.000Z": "Congratulations to @AtlantaFalcons WR @juliojones_11 on setting a new @NFL record! #RiseUp  #gapol Quote Tweet Atlanta Falcons @AtlantaFalcons \"It's a great achievement but it's for my teammates.\" - Julio Jones on becoming the fastest ever to reach 12,000 receiving yards.", "2019-12-22T23:42:24.000Z": "Happy #Hanukkah from The Kemp Family! We wish all of our Jewish friends and neighbors the very best this holiday season! #gapol", "2019-12-22T13:19:43.000Z": "Please join us in praying for the Shepherd Family and all who mourn. Quote Tweet Governor Brian P. Kemp @GovKemp James Shepherd will be dearly missed. His contributions have changed the lives of patients here in the State of Georgia and across the southeast. His legacy will never be forgotten and will live on through the work of the @ShepherdCenter . http:// Bit.ly/2QbgHsn", "2019-12-21T19:55:06.000Z": ". @SavannahNow : \"The Savannah community is better for Gov. Kemp's efforts to improve the state's small business climate. As he enters his second year, we support him in that work.\" #gapol Editorial: Gov. Kemp enhancing state's business climate Candidate Brian Kemp, for all his polarizing campaign rhetoric, based his gubernatorial run on making Georgia the best state for small business.Nearly a year after taking office, and standing before... savannahnow.com", "2019-12-21T16:54:37.000Z": "I'm proud of what we've accomplished and appreciate the kind words of support from @SavannahNow ...but we can't rest on our laurels. It's time to hunker down and keep choppin'! http:// ow.ly/BjXh50xFW3X  #gapol Editorial: Gov. Kemp enhancing state's business climate Candidate Brian Kemp, for all his polarizing campaign rhetoric, based his gubernatorial run on making Georgia the best state for small business.Nearly a year after taking office, and standing before... savannahnow.com", "2019-12-21T16:50:03.000Z": "One more sex trafficker is off the street. Proud of @USMarshalsHQ and @CobbSheriff for their hard work! http:// ow.ly/Xzoj50xFVZR  #gapol 'Self-proclaimed pimp' arrested, accused of trafficking women in Cobb ajc.com", "2019-12-20T12:36:04.000Z": "Through the @GBI_GA Gang Task Force, we are shutting down stash houses, taking drugs off the street, and putting criminals behind bars. By working together, we will continue to dismantle street gangs and keep Georgia families safe. http:// ow.ly/Zrw650xF5WT  #gapol Gwinnett gang raids are a win for Kemp administration, GBI says The GBI Gang Task Force counted its latest victory this Tuesday, raiding two alleged Sureños (Sur 13) gang drug and gun stash houses in Gwinnett. ajc.com", "2019-12-20T00:19:38.000Z": "Just had a great cheeseburger with Jarrett at The @TrumpDC .  #GAPOL", "2019-12-19T23:50:09.000Z": "Congratulations to @SenatorLoeffler on the new committee assignments. Georgia farmers, veterans, and families will continue to have a strong champion in Washington! #gapol  #georgiagrown", "2019-12-19T21:22:54.000Z": "Merry Christmas from the @WhiteHouse ! Honored to be here with my oldest daughter, Jarrett, to celebrate the holiday season! #gapol", "2019-12-19T20:10:09.000Z": "ICYMI: Georgia Unemployment at Lowest in State History -> http:// ow.ly/1gET50xEp0T  #gapol", "2019-12-19T17:15:14.000Z": "Unemployment rates are at historic lows. Employment rates are at an all-time high. We are the top state for business - 7 years in a row. Job creators have Georgia on their minds. http:// ow.ly/6rMM50xEbjp  #gapol Georgia's unemployment rate reaches record low of 3.3% Georgia's economy added 6,500 jobs in November, pushing the jobless rate to 3.3%, the lowest since the state started tracking it in 1976. ajc.com", "2019-12-19T14:16:32.000Z": "Breaking: Georgia's unemployment rate reaches record low of 3.3% -> http:// ow.ly/gpWU50xEb6m  #gapol Georgia's unemployment rate reaches record low of 3.3% Georgia's economy added 6,500 jobs in November, pushing the jobless rate to 3.3%, the lowest since the state started tracking it in 1976. ajc.com", "2019-12-19T13:55:08.000Z": "Great to be back in Albany to talk about economic development in Georgia. Appreciate the Albany Area Chamber of Commerce for their hard work and look forward to carrying this positive momentum into 2020! http:// ow.ly/XdMR50xDTty  #gapol Gov. Brian Kemp makes stop in Albany for Chamber dinner ALBANY - Tuesday was a busy day for officials involved in economic development, one that was punctuated in the evening by an appearance by Gov. Brian Kemp at a dinner albanyherald.com", "2019-12-16T18:06:32.000Z": "American hero. We are forever grateful for his service and sacrifice. #gapol", "2019-12-16T14:00:25.000Z": "ICYMI: @GwinnettPd to host informational class on human trafficking -> http:// ow.ly/jQAg50xAY8y  #gapol Gwinnett County PD to host informational class on human trafficking Want the truth and statistics on human trafficking? The Gwinnett County Police Department is hosting an informational class on the topic, open to the first 120 people who RSVP. gwinnettdailypost.com", "2019-12-16T13:07:46.000Z": "To honor the life of Airman Apprentice Cameron Scott Walters, flags at all state buildings in Georgia will be lowered to half-staff today. Cameron was an American hero and we are forever grateful for his service to this great nation. http:// ow.ly/U5B450xAY36  #gapol Georgia lowers flags to honor sailor killed in Pensacola shooting ajc.com", "2019-12-13T15:54:17.000Z": "Honored to be named the 2019 Pro-Life Champion by @GaLifeAlliance . Proud of our efforts under the Gold Dome to protect the unborn and ensure that all Georgians have the opportunity to realize their full, God-given potential. #gapol Quote Tweet GA Life Alliance @GaLifeAlliance We have been so fortunate to have a friend and a partner in @GovKemp . Honored to present @BrianKempGA with our 2019 #ProLife Champion award for his support for the #HeartbeatBill , the Dignity for Incarcerated Women Act, and the Positive Alternatives Pregnancy Center Grant! #gapol", "2019-12-13T15:10:56.000Z": "Georgia @GovKemp just signed an executive order to free up state resources to respond to flooding that damaged 200 rooms at Grady Memorial Hospital in Atlanta. #gapol", "2019-12-11T17:10:13.000Z": "Forever grateful for our brave men and women in uniform. They take risks and make sacrifices on a daily basis to keep our families and communities safe. These hardworking Georgians are true heroes and deserve every accolade we can give! http:// ow.ly/bGPO50xxpTJ  #gapol Covington Officer Matt Coopers honored by Gov. Brian Kemp Covington Police Officer Matt Cooper, who continues to recover from being shot in the face in the line of duty, gets honored by Gov. Brian Kemp. fox5atlanta.com", "2019-12-10T20:10:09.000Z": "Glad to see that the film industry has South Georgia on their mind! http:// ow.ly/fG8y50xwwqI  #gapol Lights, camera, action: Film industry likes SW Georgia Albany, Tifton, Thomasville, Valdosta, and Fitzgerald are some of the cities where productions were filmed in 2019. walb.com", "2019-12-10T17:00:28.000Z": "After chemo and radiation, 10-year old Bryan Thompson beat cancer and loudly rang the bell at Beverly Knight Olson Children's Hospital in Macon. Incredibly proud of Bryan for his resilience and grateful for his doctors, nurses, and hospital staff! http:// ow.ly/3STI50xwwlf  #gapol 'I just beat it:' 10-year-old celebrates beating cancer at Beverly Knight Olson Children's Hospital Bryan Thompson got to ring the bell signifying the end of treatment, and he also received a special message from UGA coach Kirby Smart", "2019-12-08T13:24:23.000Z": "The Kemp family is praying for the loved ones and friends of the #NASPensacola victims. Georgian Cameron Scott Walters of Richmond Hill was among them. We ask God to provide comfort and healing to all following this unthinkable tragedy. Quote Tweet AJC @ajc The three sailors who were shot Friday morning at Naval Air Station Pensacola were identified by the Navy. https:// ajc.com/news/saudi-stu dent-opens-fire-florida-naval-base-killing/FPPrdNecfXqSLEp3spMJRI/ ", "2019-12-07T20:59:07.000Z": "It's time to hunker down. Let's Go Dawgs! #godawgs  #DawgsOnTop Quote Tweet Georgia Football @GeorgiaFootball Suit up. Show out. #SECChampionship  #GoDawgs", "2019-12-06T23:00:27.000Z": "Historic jobs report today! Conservative leadership and policies continue to empower the private sector, grow jobs, and ensure economic opportunity for hardworking folks in every part of our great nation! http:// ow.ly/NLlY50xtyyT  #gapol U.S. Hiring Strengthened in November, Fueling Expansion The U.S. job market strengthened in November, as employers added 266,000 jobs and unemployment matched a 50-year low, fueling the economic expansion. wsj.com", "2019-12-06T19:55:10.000Z": "It's a great time to be a Georgian...and the Peach State remains the best place for business! http:// ow.ly/XhZw50xticA  #gapol Kemp: A great time to do business in Georgia COOLIDGE - Entrepreneurs see opportunities to grow in Georgia, Gov. Brian Kemp said Thursday at Hurst Boiler & Welding Co. Inc. in Coolidge. timesenterprise.com", "2019-12-06T18:20:05.000Z": "ICYMI: Governor Kemp visits South GA for major grand opening -> http:// ow.ly/WxIn50xtOX5  #gapol Governor Kemp visits South GA for major grand opening Governor Brian Kemp is celebrating the opening of a facility set to bring in over 300 new jobs to South Georgia. walb.com", "2019-12-06T17:15:18.000Z": "ICYMI: Taurus USA officially opens in Bainbridge -> http:// ow.ly/DE5j50xtiaQ  #gapol Taurus USA officially opens in Bainbridge After months of anticipation, Taurus USA in Bainbridge is officially open. wtxl.com", "2019-12-06T15:40:07.000Z": "My friend and Athens songwriter, Mike Dekle, just released a great song about the @SEC Championship game on Saturday. Proud to be a part of the process and appreciate his strong support. Take a listen and Go Dawgs! http:// ow.ly/EJRK50xtzX0  #GoDawgs  #gapol", "2019-12-06T14:05:14.000Z": "Thanks to the generosity of state employees far and wide, over 1,000 children in foster care will have presents under the tree this Christmas. http:// ow.ly/IUaB50xtiap  #gapol Kemp: Toy donation drive sees big success Kemp said his family is truly humbled by the generosity of state employees from across the Peach State. walb.com", "2019-12-03T16:45:14.000Z": "\"Georgia is on a roll economically.\" -> http:// ow.ly/DBP050xq9dk  #gapol EDITORIAL: Georgia's economy hums, business climate best in U.S. Georgia's economy is humming along at a strong pace with recent record growth in jobs and an unemployment rate matching the all-time low set 18 years ago. And once again, mdjonline.com", "2019-12-03T14:00:42.000Z": "ICYMI: Georgia's economy hums, business climate best in U.S. -> http:// ow.ly/yZeg50xq9cm  #gapol EDITORIAL: Georgia's economy hums, business climate best in U.S. Georgia's economy is humming along at a strong pace with recent record growth in jobs and an unemployment rate matching the all-time low set 18 years ago. And once again, mdjonline.com", "2019-11-30T23:07:34.000Z": "Proud of the Dawgs for hunkerin' down and choppin' a lot of wood today. The Governor's Cup is staying in Athens...right where it belongs! #godawgs  #gapol", "2019-11-29T17:05:15.000Z": "ICYMI: Gov. praises Trump's plan to designate drug cartels as terrorist orgs -> http:// ow.ly/zb2b50xnKCD  #gapol", "2019-11-29T13:55:08.000Z": "Thanks to collaboration at the state and local level, 13 gang members were arrested earlier this week. Proud of the Appalachian Regional Drug Enforcement Office (ARDEO) for their hard work and commitment to public safety! http:// ow.ly/JpwH50xnKoN  #gapol Investigation uncovers Aryan Brotherhood ties in north Georgia, 13 arrested ARDEO has arrested people in two states after serving two search warrants in Habersham County.", "2019-11-28T16:18:25.000Z": "The second wave of State Troopers just rolled up to the Mansion for a Thanksgiving meal. Thank you for your service! @ga_dps  #gapol", "2019-11-28T15:20:03.000Z": "Serving up @GAFirstLady 's family recipe - Country Ham and #GeorgiaGrown King's Hawaiian rolls - to some of the State Troopers who are working today. Please help me thank these hardworking Georgians by driving safe on the roads. #gapol  @ga_dps", "2019-11-28T15:15:12.000Z": "Welcoming State Troopers to the Governor's Mansion for a quick meal before they begin their Thanksgiving Day shift.", "2019-11-28T13:41:20.000Z": "We have so much to be grateful for this holiday season. From the Kemp Family to yours, Happy Thanksgiving and God Bless! #gapol  #Thanksgiving", "2019-11-27T18:06:44.000Z": "The attacks and games are absolutely absurd. Frankly, I could care less what the political establishment thinks. Happy Thanksgiving! More information after the holiday! (2 of 2) #gapol", "2019-11-27T18:05:25.000Z": "I stand with hardworking Georgians and @POTUS . The idea that I would appoint someone to the U.S. Senate that is NOT pro-life, pro-2nd Amendment, pro-freedom, and 100% supportive of our President (and his plan to Keep America Great) is ridiculous. (1 of 2) #gapol", "2019-11-26T20:05:09.000Z": "Great news -> Georgia awarded 'A' for anti-human trafficking efforts http:// ow.ly/fgYR50xl56P  #gapol Georgia awarded 'A' for anti-human trafficking efforts Shared Hope International awarded Georgia an \"A\" on the strength of its laws to combat sex trafficking - an improvement from previous years. covnews.com", "2019-11-26T16:45:10.000Z": "ICYMI: 455 jobs coming to McRae-Helena -> http:// ow.ly/MleA50xl4ZT  #gapol 455 jobs coming to McRae-Helena - 41NBC|WGMT A Brazilian stone manufacturing plant is moving to Georgia. The facility is projected to create 455 jobs.", "2019-11-26T14:43:50.000Z": "Chairman Powell was a trusted public servant and bold leader who made a big impact in his community and the state of Georgia as a whole. Please join us in praying for Jay's family, loved ones, and fellow lawmakers as they mourn his sudden passing. #gapol Georgia House Representative found dead this morning; lawmakers in mourning Channel 2 Action News has learned that state House Rep. Jay Powell has died. wsbtv.com", "2019-11-25T22:55:05.000Z": "\"This year, Georgia Gov. Brian Kemp has given more Georgians a reason to hope. On the healthcare front, he is seeking unprecedented waivers from the federal government that would give the state greater flexibility.\" http:// ow.ly/7BDc50xk24j  #gapol Georgians have many reasons to give thanks - The Citizen The Georgia Public Policy Foundation hosted the 2019 Georgia Legislative Policy Forum on November 15, an event it has held since 2010. In a year of landmark policy successes, the [] thecitizen.com", "2019-11-25T20:05:09.000Z": "Awesome to see @RoquanSmith1 partner with @BGCA_Clubs to feed families in his hometown of Montezuma, GA. Roquan is a #DGD who is making a HUGE impact on and off the field. http:// ow.ly/wZGG50xk1LW  #gapol  #GoDawgs  #DawgNation Roquan Smith feeds 65 families in his hometown of Montezuma, Ga. NFL star Roquan Smith has never forgotten where he came from. This weekend, the former UGA linebacker partnered with the Boys & Girls Club of Macon to feed around 65 families in his hometown of... dawgnation.com", "2019-11-25T18:25:05.000Z": "\"While the governor's Georgians First Commission is working to achieve his goal of making Georgia the best state for small business, the employment rate in the state is probably the reason more Georgians than ever can celebrate this Thanksgiving\" http:// ow.ly/6mkp50xk29V  #gapol Georgians have many reasons to give thanks - The Citizen The Georgia Public Policy Foundation hosted the 2019 Georgia Legislative Policy Forum on November 15, an event it has held since 2010. In a year of landmark policy successes, the [] thecitizen.com", "2019-11-25T17:10:15.000Z": "Metro Atlanta continues to grow jobs and generate economic opportunity for Georgians throughout the region. Unemployment is holding steady at 2.9% - the lowest in two decades. http:// ow.ly/ScRI50xjHLX  #gapol Metro Atlanta hiring strong last month; jobless rate remains 2.9% Atlanta added more jobs than usual in October, as the unemployment rate stayed steady at a low 2.9%. ajc.com", "2019-11-25T13:50:07.000Z": "Great to see local churches come together in the CSRA to support - and feed - our soldiers at Ft. Gordon! http:// ow.ly/4Kma50xjHBD  #gapol Fort Gordon soldiers get a Thanksgiving surprise Hundreds of Fort Gordon soldiers knew they wouldn't be able to go home for the holidays, but what they didn't know is that they would be surprised with a Thanksgiving meal. wjbf.com", "2019-11-23T20:38:26.000Z": "Great to be with @SecretarySonny and his team today. Appreciate his leadership and strong support! #gapol Quote Tweet Sec. Sonny Perdue @SecretarySonny Joined @Govkemp in signing a Shared Stewardship Agreement between @forestservice and @georgiagov . Looking forward to continuing our work to help manage Georgia's forests and keep them healthy and beautiful", "2019-11-23T20:36:04.000Z": "Great to see so many hardworking Georgians on campus today. Let's hunker it down and keep choppin! #godawgs  #gapol", "2019-11-22T02:50:04.000Z": "Powerful story about Nick Marshall, teen suicide, and the power of kindness. I hope you will read, share, and remember that \"Nothing Beats Nice\" -> http:// ow.ly/HArx50xhvwb  #gapol", "2019-11-22T00:45:04.000Z": "So grateful for Gainesville police and local school leaders. They literally saved many, innocent lives at Bethel African Methodist Episcopal Church this week. http:// ow.ly/k8pT50xhvIv  #gapol 16-year-old girl arrested in plot to attack predominantly black Georgia church ajc.com", "2019-11-21T23:10:05.000Z": "Operation Hidden Eye put more than 30 gang members behind bars. Proud of the Bibb County Sheriff's Office - especially the Gang Unit - for their hard work! http:// ow.ly/KStg50xhudw  #gapol Operation Hidden Eye: More than 30 arrested in Bibb County gang investigation Sheriff Davis showed a video that appeared to be a man showing a child gang signs and encouraging him to fight", "2019-11-20T20:10:10.000Z": "Incredibly powerful and well-deserved tribute. Thank you for your service, Sen. @JohnnyIsakson ! http:// ow.ly/4HIV50xgcvJ  #gapol 'Two icons from Georgia' embrace during moving tribute to Sen. Isakson Members of Georgia's congressional delegation gathered on Tuesday to pay tribute to retiring U.S. Sen. Johnny Isakson, and one emotional moment with U.S. Rep. John Lewis highlighted his bipartisan... ajc.com", "2019-11-20T17:10:11.000Z": "Last night, Richmond County Narcotics Investigator Cecil Ridley was shot and killed in the line of duty. Our prayers are with his family, loved ones, and fellow LEOs at the @RCSOGA . We are forever grateful for his service. http:// ow.ly/1eJx50xg6P3  #gapol  #rcsostrong Richmond County Investigator killed in Augusta shooting AUGUSTA, Ga. (WJBF) - Richmond County Deputies are mourning the loss of one of their own. Richmond County Narcotics Investigator Cecil Ridley was shot and killed Tuesday night around 9 p.m. I wjbf.com", "2019-11-20T12:27:33.000Z": "Great news as we work together to end human trafficking in Georgia! #gapol Quote Tweet UGA @universityofga UGA has been selected to receive $15.75 million from the U.S. Department of State to expand programming and research to measurably reduce human trafficking. https:// t.uga.edu/5rc  @UGASocialWork  @PublicHealthUGA  @UGAFranklin", "2019-11-20T02:50:05.000Z": "In Georgia, we can make anything for anybody anywhere in the world. It's our job to let people know that! http:// ow.ly/tdIX50xfgRM  #gapol  #GeorgiaMade Governor Brian Kemp focused on employment growth in South Georgia Growing employment and Georgia-made industries are top priorities for Governor Brian Kemp. walb.com", "2019-11-20T00:55:04.000Z": "ICYMI: Kemp stops in Cordele, tours Big Tex Trailers -> http:// ow.ly/NFBb50xfgMA  #gapol Kemp stops in Cordele, tours Big Tex Trailers - Cordele Dispatch Georgia Governor Brian Kemp toured Big Tex Trailers' Cordele manufacturing and sales facility Monday morning as part of his statewide tour promoting products manufactured in Georgia. The first-term... cordeledispatch.com", "2019-11-19T22:50:05.000Z": "ICYMI: Irving Tissue investment in Macon nears $1 billion -> http:// ow.ly/vBeV50xfgw0  #gapol Irving Tissue investment in Macon nears $1 billion ATLANTA - Gov. Brian Kemp announced that Irving Tissue, one of North America's leading manufacturers of household paper products, will expand its operations in Macon, creating more than 150 jobs albanyherald.com", "2019-11-19T21:35:04.000Z": "Kia is celebrating 10 years in West Point, GA. KMMG employs over 3,000 hardworking Georgians - generating economic opportunity and prosperity throughout the region! http:// ow.ly/veyB50xfgK8  #gapol Kia celebrating ten years in West Point - Valley Times-News WEST POINT - On Nov. 16, 2009, Kia Motors Manufacturing Georgia rolled its first 2011 Sorento CUV off the production line to signify the plant was open for production. Ten years later, the company in... valleytimes-news.com", "2019-11-19T19:55:06.000Z": "We are incredibly fortunate to have folks who work around the clock to keep our communities - and families - safe. Big thanks to Paulding County detectives for catching this predator who was actively looking to harm young children in the region. http:// ow.ly/inee50xfghy  #gapol Cartersville man arrested, accused of planning to have sex with 8-year-old girl ajc.com", "2019-11-18T23:00:32.000Z": "\"There is no \"silver bullet\" in health care - and this, my friends, is the first year of my administration. However, the submission of Georgia Pathways and Georgia Access is a huge step in the right direction.\" http:// ow.ly/xeH750xdDpI  #gapol Column: Our plan to make health insurance accessible, affordable in Georgia Georgia is experiencing historic job growth and unmatched economic opportunity in every corner of the state. Participation in the job market is at record highs; unemployment recently dropped to a... augustachronicle.com", "2019-11-18T20:10:11.000Z": "\"Georgia Pathways and Georgia Access will work in tandem to lift our friends, neighbors, and family members out of poverty. They form a path to opportunity, success, and prosperity for all Georgians - no matter your ZIP code.\" http:// ow.ly/XXOJ50xdDma  #gapol Column: Our plan to make health insurance accessible, affordable in Georgia Georgia is experiencing historic job growth and unmatched economic opportunity in every corner of the state. Participation in the job market is at record highs; unemployment recently dropped to a... augustachronicle.com", "2019-11-18T17:15:18.000Z": "\"we have partnered w/ experts, medical professionals, stakeholders, lawmakers & citizen advocates to draft two unique & innovative healthcare waivers that meet the needs of hardworking Georgians, keep our budget balanced, reflect our values as a state.\" Column: Our plan to make health insurance accessible, affordable in Georgia Georgia is experiencing historic job growth and unmatched economic opportunity in every corner of the state. Participation in the job market is at record highs; unemployment recently dropped to a... augustachronicle.com", "2019-11-18T13:55:10.000Z": "OpEd: Our plan to make health insurance accessible, affordable in Georgia -> http:// ow.ly/P75w50xdDb8  #gapol Column: Our plan to make health insurance accessible, affordable in Georgia Georgia is experiencing historic job growth and unmatched economic opportunity in every corner of the state. Participation in the job market is at record highs; unemployment recently dropped to a... augustachronicle.com", "2019-11-17T02:44:39.000Z": "SEC East Champions for the 3rd consecutive year. How 'Bout Them Dawgs! #godawgs Quote Tweet Georgia Football @GeorgiaFootball FINAL  #GoDawgs  #UGAvsAU  #ATD", "2019-11-15T22:50:05.000Z": "HUGE win for Georgia's ag industry! Incredibly proud of @SecretarySonny for his leadership and hard work! http:// ow.ly/qPHU50xbTkd  #gapol Georgia's giant poultry industry licks chops after China trade thaw Georgia is the top U.S. chicken producer and set to benefit from China allowing U.S. poultry imports for the first time in nearly five years. ajc.com", "2019-11-15T19:50:08.000Z": "ICYMI: This dangerous disease is killing deer across country, state responds -> http:// ow.ly/LVnw50xbT2r  #gapol", "2019-11-15T18:30:09.000Z": "ICYMI: Georgia's logistics network helps state stay No. 1 -> http:// ow.ly/ktot50xc9Bw  #gapol Portside column: Georgia's logistics network helps state stay No. 1 Site Selection Magazine formally announced last week it has ranked Georgia's business climate No.1 in the country again this year, making it the only state to receive the distinction seven consecut... savannahnow.com", "2019-11-15T17:10:14.000Z": "Georgia's unemployment rate is 3.4% - the lowest in 43 years. Keep choppin'! #gapol Georgia's jobless rate drops, matches all-time low Georgia adds 5,400 jobs, but workforce growth stagnates. ajc.com", "2019-11-14T16:50:08.000Z": "Proud of our LEOs at the Covington Police Department for working diligently to track down those who are exploiting local children and teenagers. Their efforts have not gone unnoticed. http:// ow.ly/Dq8L50xb1rF  #gapol Cops: Man pretended to be teen so Covington 14-year-old would send him nude photos ajc.com", "2019-11-13T22:55:05.000Z": ". @mdjonline : Kemp health care plans debate is just beginning -> http:// ow.ly/AZnW50xa4Uv  #gapol EDITORIAL: Kemp health care plans debate is just beginning Gov. Brian Kemp has rolled out two proposals to improve access to health care for low-income residents. The first is a plan to reduce premiums for people buying health insurance mdjonline.com", "2019-11-13T19:50:06.000Z": ". @GACyberCenter is a state-of-the-art facility in Augusta that serves as a collaboration hub for academia, industry leaders, & government. We are training the cyber workforce, supporting innovation, & protecting our national interests - all under one roof. Georgia Cyber Center Recognized for Economic, Workforce Impact The facility designed and built to serve as a hub for cybersecurity industry, academia and government collaboration has continued to see success in bolstering the IT workforce and the state's economy. govtech.com", "2019-11-12T20:10:09.000Z": "Proud to support our rural towns and cities in Georgia and beyond. Sad that some fail to appreciate the incredible value of these communities and the positive impact of the hardworking Americans that choose to live there. http:// ow.ly/Rhmy50x8WwV  #gapol  #GeorgiaGrown Berkeley 'instructor': 'Rural Americans' are 'bad people' That's not all he said... campusreform.org", "2019-11-11T16:45:15.000Z": "\"Unlike Medicaid expansion... these reforms actually target working Georgians and...help not only those who earn little but also middle-income workers. Unlike Medicaid expansion, these reforms have a chance of working for Georgia.\" http:// ow.ly/Q4jb50x7EZh  #gapol Wingfield: Governor's health care reforms can work for Georgia Gov. Brian Kemp unveiled part 2 of his health reform plan this past week. Consider it just that: a piece that complements the first part. Last week, I described the first reform, which addresses the... onlineathens.com", "2019-11-11T13:56:22.000Z": "Today, we pause to honor our veterans for their service, sacrifice, and patriotism. Thanks to these brave men and women, we live in a country where opportunity abounds and freedom shines bright! #gapol  #VeteransDay  #veteransday2019  #Veterans", "2019-11-09T16:39:11.000Z": "Big thumbs up for @POTUS and his entire team that came down to Georgia on Friday. Together, we will Keep America Great! #gapol", "2019-11-08T22:06:36.000Z": "Always enjoy spending time with our friend and Vice President, Mike Pence. Keep choppin', @VP ! #gapol", "2019-11-08T22:03:17.000Z": "The Kemp Family was honored to welcome President @realDonaldTrump back to Georgia! #gapol Quote Tweet Natalie Fultz FOX 5 @NatalieFFOX5 Governor @BrianKempGA walks with his family to greet @realDonaldTrump !", "2019-11-08T19:55:08.000Z": "This new policy reduces burdensome & costly double-testing for advanced courses in high schools w/o compromising accountability in the classroom. It's another way we can empower educators, enhance outcomes, & put students ahead of the status quo. http:// ow.ly/OIop50x5LUP  #gapol", "2019-11-08T17:10:16.000Z": "\"Gov. Brian Kemp came down to Cook County in May specifically to address the issue of criminal street gangs and his support was one of the driving forces behind this operation. We will not let criminal street gangs freely roam our streets.\" #gapol Dozens arrested in Cook gang crackdown ADEL - Dozens of arrests were made in Cook County Thursday as several law-enforcement agencies worked to crack down on gang members, according to the Alapaha district attorney. valdostadailytimes.com", "2019-11-08T13:55:07.000Z": "Proud of federal, state, and local law enforcement for working together to put dozens of dangerous gang members behind bars. Operation Clean Sweep will keep families in our state safe and prosperous. #gapol Dozens arrested in Cook gang crackdown ADEL - Dozens of arrests were made in Cook County Thursday as several law-enforcement agencies worked to crack down on gang members, according to the Alapaha district attorney. valdostadailytimes.com", "2019-11-08T02:47:35.000Z": "Big congrats to @ronaldacunajr24  @FreddieFreeman5 and @ozzie ! #BravesNation  #ChopOn  @Braves Quote Tweet Atlanta Braves @Braves Only team with !", "2019-11-08T02:43:18.000Z": "Great show of support today for @BillWerkheiser . Appreciate his hard work under the Gold Dome and in District 157. #gapol", "2019-11-08T02:34:01.000Z": "Great to be down in Dublin with Chairman @jmatthatchett . Proud of our work during the 2019 Legislative Session where we advanced policies that put hardworking Georgians first! #gapol", "2019-11-07T23:10:07.000Z": "Our friend and cancer fighter, Greyson Kennedy, is back home and making good progress. He wants to deer hunt this weekend and I'm on board 100%! Keep choppin', Greyson! #gapol", "2019-11-07T19:45:17.000Z": "Thanks to the @AUG_Chronicle , Deputy Eric Madison is getting the praise he deserves! #gapol", "2019-11-07T17:10:16.000Z": "I look forward to working with Georgia-Pacific in the years ahead as they continue to expand the forestry industry and create opportunity in rural communities across Georgia! http:// ow.ly/jwXP50x4gjZ  #gapol Georgia-Pacific Completes $135 Million Lumber Facility in Warren County Georgia-Pacific News: Georgia-Pacific Completes $135 Million State-of-the-art Lumber Facility In Warren County, Georgia. Read Now. gp.com", "2019-11-07T14:00:39.000Z": "ICYMI: Georgia No.-1 for business seventh year in a row -> http:// ow.ly/bfd050x4gi4  #gapol Georgia No.1 for business seventh year in a row If it's November, it must be time for Georgia to win designation as the No.1 state in which to do business. bizjournals.com", "2019-11-07T03:00:21.000Z": "\"In short, this would be a transformative step for the individual health-insurance market in Georgia. More choices. Lower prices. More flexibility and customization.\" http:// ow.ly/7uWj50x4eaA  #gapol Kyle WIngfield column: Georgia to be better because of health care waivers Georgia doesn't often get to claim a leading role in matters related to health care. At least, not in a good way. That is changing, in a very big way. After months of behind-the-scenes work, Gov.... savannahnow.com", "2019-11-07T02:25:03.000Z": "What an honor to be with Louis Graziano, a World War II veteran from Thomson, to celebrate the expansion of @GeorgiaPacific 's mill in Warren County. Forever grateful for his service! @JodyHice  @votegaryblack  #gapol", "2019-11-07T02:16:59.000Z": "Today, Georgia was named the #1 State for Business by Site Selection Magazine for the seventh year in a row! #gapol Georgia business climate, Cyber Center attracting companies and jobs Georgia was named best business climate for a seventh year in a row by one magazine and Georgia Cyber Center's unique ecosystem is also attracting companies and jobs to the state, officials said. augustachronicle.com", "2019-11-07T02:07:12.000Z": "Today, I was honored to be in Waynesboro to present the Medal of Valor to Burke County Deputy Eric Madison. His courage and bravery will be remembered for generations to come. http:// ow.ly/4pWp50x4fZh  #gapol Burke County deputy receives Medal of Valor for life-saving act A Burke County Sheriff's deputy was honored Wednesday for his split-second decision that saved the life of a kidnapping victim last summer.Gov. Brian Kemp presented the Medal of Valor to Deputy Eric... augustachronicle.com", "2019-11-07T01:55:07.000Z": "It's time to bring the hammer down on Mexican drug cartels that are flooding Georgia communities with drugs, guns, and violence. http:// ow.ly/TI2n50x4fcF  #gapol Atlanta News Videos | WSB-TV Watch Atlanta news videos from WSB-TV. The latest local news videos from the Atlanta Metro area. Sports, crime, and the latest entertainment. wsbtv.com", "2019-11-07T01:20:03.000Z": "\"Georgia doesn't often get to claim a leading role in matters related to health care. At least, not in a good way. That is changing, in a very big way.\" http:// ow.ly/kC8p50x4e9b  #gapol Kyle WIngfield column: Georgia to be better because of health care waivers Georgia doesn't often get to claim a leading role in matters related to health care. At least, not in a good way. That is changing, in a very big way. After months of behind-the-scenes work, Gov.... savannahnow.com", "2019-11-07T00:58:31.000Z": "Great column that highlights the positive impact of our healthcare reform measures. \"Kemp and his team have taken great advantage of the opportunities that are possible through the waivers, and Georgians will be better off for it.\" http:// ow.ly/89cx50x4eeO  #gapol Kyle WIngfield column: Georgia to be better because of health care waivers Georgia doesn't often get to claim a leading role in matters related to health care. At least, not in a good way. That is changing, in a very big way. After months of behind-the-scenes work, Gov.... savannahnow.com", "2019-11-05T16:50:11.000Z": "Proud of Brendon Todd for hunkering down to win The Bermuda Championship! Keep choppin'! #DGD  #gapol Watkinsville's Todd back on track, claims PGA Tour title Times had gotten so bad on the golf course for Watkinsville's Brendon Todd that he was thinking of other options in his professional life. \"Probably a year ago I was considering opening up a restau... onlineathens.com", "2019-11-05T16:39:43.000Z": "Earlier today, I met with the Minority Business Taskforce - part of the Georgians First Commission - to discuss ways that we can make it easier to start, expand, and operate a company in the Peach State. Appreciate all of these local leaders for their time and insight. #gapol", "2019-11-05T02:50:03.000Z": "Medicaid Expansion is a risky, one-size fits all approach that costs too much and fails to deliver. Georgia Pathways is innovative, affordable, and tailored to meet the healthcare needs of Georgians in every part of the Peach State. http:// ow.ly/iKnW50x1Ybx  #gapol Gov. Brian Kemp unveils health care waiver ATLANTA - Gov. Brian Kemp joined members of the General Assembly on Monday to unveil Georgia Pathways, a 1115 demonstration waiver to provide an opportunity for 408,000 Georgians to have albanyherald.com", "2019-11-05T02:10:05.000Z": "Unlike Medicaid Expansion, which will undermine access to care and cost GA taxpayers over a billion and a half dollars in the first five years, Georgia Pathways enhances eligibility for thousands of Georgians w/o undermining our values as a state. http:// ow.ly/VopQ50x1YiB  #gapol Governor Brian Kemp releases plans for health care In Georgia, Governor Brian Kemp says his newly unveiled plan to overhaul the state's health insurance market will give \"more stability and predictability\" to families. walb.com", "2019-11-05T01:35:02.000Z": "By crafting two unique waivers that work in tandem to create a pathway to affordable healthcare for hardworking Georgians and reduce private sector insurance premiums for families, we are shaking up the status quo and putting patients first! #gapol", "2019-11-05T01:30:10.000Z": "Through the Georgia Pathways Innovation Waiver, we will shake up the status quo and give 408,000 Georgians the opportunity to purchase affordable health insurance. http:// ow.ly/l4qO50x1Y6X  #gapol Gov. Brian Kemp unveils health care waiver ATLANTA - Gov. Brian Kemp joined members of the General Assembly on Monday to unveil Georgia Pathways, a 1115 demonstration waiver to provide an opportunity for 408,000 Georgians to have albanyherald.com", "2019-11-01T22:22:40.000Z": "There's a big game on Saturday & I'm so confident in the #Dawgs that I made a friendly wager with FL @GovRonDeSantis . We win & Ron comes to S. Georgia for feral hog hunting. We lose & I'm hunting pythons in the Everglades. Let's hunker down & keep choppin'! #GoDawgs ! #ATD  #gapol Quote Tweet Ron DeSantis @GovRonDeSantis 0:46 Hey @GovKemp - there's a big game tomorrow in Jacksonville, and you know I'm taking @GatorsFB to get the win over @GeorgiaFootball .\n\nI'm so confident, I'm even willing to offer a friendly wager. #GoGators  #UFvsUGA", "2019-11-01T13:05:12.000Z": "Georgia Access lowers insurance premiums through a modest reinsurance program, removes ridiculous regulations to empower consumers, and gives employers the opportunity to invest in the health and well-being of their employees. http:// ow.ly/frkE50wYXkv  #gapol Kemp unveils proposals to overhaul Georgia individual health plans Georgia Gov. Brian Kemp's plan would invest in reinsurance with a goal of lowering premiums. Web brokers would also become part of the process. ajc.com", "2019-11-01T03:41:48.000Z": "HUGE win tonight for @GeorgiaSouthern ! Go Eagles! #beatapp  #gapol Quote Tweet Georgia Southern Football @GSAthletics_FB EAGLES WIN!!!!!! \n24-21 #BEATAPP", "2019-11-01T02:11:08.000Z": "Through Georgia Access, we will lower insurance premiums,  foster competition in the marketplace, & give Georgians the opportunity to choose a plan that fits their needs. Above all, this plan shakes up the status quo & puts patients first! http:// ow.ly/v9zu50wYXeX  #gapol Kemp unveils proposals to overhaul Georgia individual health plans Georgia Gov. Brian Kemp's plan would invest in reinsurance with a goal of lowering premiums. Web brokers would also become part of the process. ajc.com", "2019-10-30T17:41:11.000Z": "Under the bold leadership of Lt. Gov. @GeoffDuncanGA , @AdvanceGeorgia will work to share our story, vision, & success with Georgia voters. Together, we will build a grassroots army that can deliver victory for conservative candidates up & down the ballot! #gapol  #advancegeorgia Quote Tweet Advance Georgia @AdvanceGeorgia #advancegeorgia is a committee led by @GeoffDuncanGA to preserve and protect the Republican majority in the Georgia Senate. #gapol  https:// ajc.com/blog/politics/ geoff-duncan-aims-fortify-senate-with-advance-georgia-plan/PBnWnIuAPEC6luJ0lU84JM/ ", "2019-10-30T14:07:38.000Z": "We are praying for Congressman @JodyHice and family as they mourn the loss of his father, Tom Hice. Clearly, he lived a full and impactful life. #gapol Quote Tweet Jody Hice @JodyHice US House candidate, GA-10 We lost my Dad today.\n\nTom Hice was a godly man, family man, business man, and a humble, gentle man. A giant among men.\n\nHe taught us to love God... To hunt, work, fix and build things... And to be respectful to others.\n\nI love you, Dad! We miss you! Thank you for the legacy!", "2019-10-28T13:10:13.000Z": "We are so proud of U.S. Special Operations Forces and intelligence officials who worked tirelessly to bring Abu Bakr al-Baghdadi to justice. Thanks to their service and sacrifice, our world is a safer place to live. http:// ow.ly/FDgz50wUTE1  #gapol ISIS leader's death marks latest defeat of once-powerful group U.S. sources have confirmed that ISIS leader Abu Bakr al-Baghdadi is dead, apparently using a suicide vest to kill himself during a U.S. raid on a compound located in northwest Syria. foxnews.com", "2019-10-28T12:33:14.000Z": "Fulton County SWAT showed real courage this morning after a home invasion turned into a hostage situation. We appreciate these hardworking Georgians and pray for LEOs throughout our state who risk life & limb to keep us safe. http:// ow.ly/v3sI50wViG6  #gapol Owner rescued, 2 in custody after home invasion leads to SWAT standoff ajc.com", "2019-10-25T12:50:09.000Z": "Sen. Leroy Johnson was a bold and dynamic leader who shook up the status quo and helped move our state forward. His legacy of service will live on for generations to come. #gapol First black Georgia state senator elected after Reconstruction has died Leroy Johnson, an attorney and former teacher, was elected to the Georgia Senate as a Democrat in 1962 and served until 1975. His inclusion in the 1963 class of freshman lawmakers marked him as a... ajc.com", "2019-10-24T19:00:24.000Z": "Proud of @cobbsheriff and @usmarshallhq Southeast Regional Fugitive Task Force for doing their part to keep our families safe by putting violent gang members behind bars where they belong. #gapol Florida rapper arrested in Cobb, charged with murder in gang-related shooting ajc.com", "2019-10-23T12:55:09.000Z": "We are praying for former President Jimmy Carter's quick recovery. It's hard to slow down such a hardworking Georgian! #gapol Pelvic fracture lands Jimmy Carter in the hospital The 95-year-old Jimmy Carter was admitted to the Phoebe Sumter Medical Center for what his spokesperson called a \"minor pelvic fracture.\" ajc.com", "2019-10-23T01:24:19.000Z": "Col. John Hall is a great American who flew 126 combat missions. We appreciate his service to our great nation! #gapol", "2019-10-22T22:00:27.000Z": "With historic teacher pay raises, $69 million in school security grants, and more $$ for mental health services in Georgia High Schools, we continue to champion education and those who inspire our students! http:// ow.ly/jPXF50wRoUA  #gapol Georgia Governor Brian Kemp, Continued Investment in Education Brian Kemp, Governor of the State of Georgia, discusses the investments they made in education in the legislative sessions including a historic teacher pay-raise. metroatlantaceo.com", "2019-10-22T18:55:10.000Z": "On our 7th stop of the #GeorgiaMade Tour, we toured Claxton Poultry in Sylvania. Incredible facility that employs nearly 200 hardworking Georgians! http:// ow.ly/UGuK50wRoId  #gapol Governor Kemp visits Claxton Poultry Sylvania facility Governor Kemp visits Claxton Poultry Sylvania facility wjcl.com", "2019-10-21T16:05:16.000Z": "As Georgia employees, teachers, & other personnel begin open enrollment for the state health benefit plan this week, I encourage all to visit http:// BeWellSHBP.com & learn their Real Age. Together, we can ensure a healthier future for our state! #gapol  @SharecareInc @ @GADCH", "2019-10-21T12:50:08.000Z": "A year has passed, but Officer Antwan Toney - who was killed in the line of duty - is not forgotten. We continue to pray for his family and loved ones. Officer Toney's legacy of service inspires Gwinnett and the entire state. http:// ow.ly/Ie9S50wQ6fq  #gapol Remembering slain Gwinnett police officer Antwan Toney, one year later Gwinnett County Police Officer Antwan Toney was killed in the line of duty on Oct. 20, 2018. ajc.com", "2019-10-20T21:42:13.000Z": "Today, three American heroes died and three more were injured during a training exercise at Fort Stewart. Our hearts are broken and our prayers are with those impacted by this terrible tragedy. http:// ow.ly/ul6E50wPKSi  #gapol Fort Stewart training accident leaves 3 soldiers dead, 3 injured, officials say Three soldiers were killed and three others were hospitalized after a training accident at Fort Stewart in Georgia on Sunday, according to officials. foxnews.com", "2019-10-19T12:12:42.000Z": "Great event last night in Athens for Rep. @houstongaines and Rep. Marcus Wiedower. Appreciate their efforts in the State House and proud to support their campaigns for re-election! #gapol", "2019-10-18T15:45:16.000Z": "Jobs, Jobs, Jobs: Parsons Corporation, which is cybersecurity technology firm in Augusta, is bringing more than 80 new jobs to the Georgia Cyber Center. http:// ow.ly/uzlF50wOdRz  #gapol Parsons Corporation bringing 80 jobs to Georgia Cyber Center In another sign of the expanding cyber industry in Augusta, Parsons Corp. is adding another 80 jobs to its operations at Georgia Cyber Center and is having an economic impact outside the center as... augustachronicle.com", "2019-10-18T12:45:13.000Z": "ICYMI: Ball Corporation is building a new aluminum cups manufacturing plant in Rome (Floyd County), which will create more than 180 new jobs and invest more than $200 million in the project. http:// ow.ly/vxke50wOdQv  #gapol New $200 million plant in Rome to create 180 jobs, governor says The Ball Corporation is expanding its operations in Floyd County with the plant.", "2019-10-17T00:22:39.000Z": "Big thanks to the @UGACRs for having The Kemp Family at tonight's meeting. It was great to share a few stories, highlight our legislative accomplishments, & thank the countless volunteers from the 2018 election who helped us earn victory at the ballot box. Keep choppin'! #gapol", "2019-10-14T17:12:53.000Z": "In its 2nd year, Jam for Cam raised over $100,000 for @CureMelanoma , @CampCarolina and The Preston Robert Tisch Brain Tumor Center at @DukeU . What a great way to honor the life of Cameron Fearon and help raise awareness about melanoma. Jam for Cam raises $100,000 for skin cancer charities with local band lineup at Southern Brewing... When the band Jester played its last show during AthFest this year, the members said there was only one event they would get back together for: Jam for Cam. redandblack.com", "2019-10-14T16:06:11.000Z": "Heading down to Moultrie for the \"Farmer of the Year\" lunch and had to stop by @CarrollSausage for some #georgiagrown burgers. #gapol", "2019-10-14T12:46:22.000Z": "Master Sgt. Mark Allen was a member of ... @GeorgiaGuard  48th Infantry Brigade Combat Team. He was a true American hero who will be missed by our entire country. ... @GAFirstLady , the girls, and I extend our thoughts and prayers to his loved ones. Master Sgt. Mark Allen dies 10 years after being shot while searching for Army deserter Retired Army Master Sgt. Mark Allen has died 10 years after he was shot while looking for a soldier who went missing in Afghanistan back in 2009. foxnews.com", "2019-10-14T14:07:36.000Z": "If you haven't listened to #GeorgiaGrown country music artist, @craigcampbelltv , you should! #gapol", "2019-10-11T18:50:12.000Z": "A large part of our growth, success, & reputation as the best place to live, work, & play is made possible by organizations like @Gwinnett_CB who understand that we need to protect our natural resources & keep our communities safe, clean, and green. Gov. Brian Kemp: Gwinnett 'on the front lines' for environmental issues in Georgia As Gov. Brian Kemp delivered his first-ever Governor's Environmental Address to Gwinnett Clean and Beautiful and community leaders at the Infinite Energy Center Thursday, he talked about the state's... gwinnettdailypost.com", "2019-10-11T15:55:12.000Z": "ICYMI: Coca-Cola UNITED to Build New Facility in Tift County, Create 200 Jobs -> http:// ow.ly/zhMl50wIvml  #gapol", "2019-10-11T13:00:26.000Z": "You wouldn't know it from the headline, but our teacher listening session was incredibly positive for all involved. As I often say: We must reduce testing, empower educators and parents, dismantle Common Core, and ultimately put students first! http:// ow.ly/J5SC50wIveh  #gapol Ga. educators give Kemp earful about tests that make kids cry, vomit The state's top educator commiserated and said there are plans to reduce the number of tests ajc.com", "2019-10-10T16:00:37.000Z": "ICYMI: Marty Kemp visits kids in Bogart to promote Pre-K Week -> http:// ow.ly/VEGA50wHyFM  #gapol Marty Kemp visits kids in Bogart to promote Pre-K Week \"Good morning, Mrs. Kemp,\" teacher Tara Lystad said as Marty Kemp walked into her classroom. \"Good morning,\" the group of Pre-K students shouted in unison. Kemp, the wife of Georgia Gov. Brian Kemp,... onlineathens.com", "2019-10-10T13:07:52.000Z": "With 7 All-Star appearances, 6 Silver Slugger awards, & a World Series Championship, catcher Brian McCann made Georgia proud during his incredible career in baseball. We wish Brian & his family the very best in retirement! #ChopOn  #BravesNation  #gapol Braves' Brian McCann announces his retirement ajc.com", "2019-10-10T00:55:04.000Z": "On Sunday, I presented Dr. Charles Stanley with a proclamation honoring his 50 years of \"faithfully preaching the Gospel of Jesus Christ at First Baptist Atlanta, Georgia.\" We are so grateful for Dr. Stanley's service & impact! http:// ow.ly/oi2650wH7na  #gapol First Baptist Atlanta celebrates 50 years with Charles Stanley On Sunday, Oct. 6 members and guests joined at First Baptist Atlanta to celebrate the church's 50-year ministry relationship with Charles Stanley. christianindex.org", "2019-10-09T13:51:08.000Z": "Proud of U.S. Attorney Bjay Pak and his team for their efforts to crush gangs and keep Georgia families safe. Keep up the good work, @bjaypak ! http:// ow.ly/6M0b50wGB1H  #gapol 2 Gangster Disciples leaders from Atlanta found guilty of Macon triple murder ajc.com", "2019-10-09T00:31:18.000Z": "Big thanks to The Jones Family for hosting tonight's fish fry at their home in Jackson, GA. Great crowd of hardworking Georgians! #gapol", "2019-10-08T21:55:26.000Z": "As sundown approaches, @GAFirstLady and I wish everyone observing Yom Kippur a meaningful fast! #gapol", "2019-10-07T13:05:13.000Z": "\"Criminals network in syndicates, violent street gangs and conspiracies. To protect our communities, law enforcement and prosecutors at all levels are working together. In short: We've ganged up to fight gangs.\" http:// ow.ly/2g2x50wEbJS  #gapol Column: Prosecuting gangs, drugs, violent crime: It takes a network In the War on Terror, we've learned that you fight a network with a network. Criminal gangs are networks of thieves trafficking in drugs, guns, violence and humans - slavery by any other name. Across... augustachronicle.com", "2019-10-07T12:18:30.000Z": "Glad to see that former President Jimmy Carter is back at it - sporting a @Braves cap and supporting @Habitat_org - after falling on Sunday. Keep choppin', 39! #gapol Ex-President Jimmy Carter has black eye, stitches after fall NASHVILLE, Tenn. (AP) \" Former President Jimmy Carter had a black eye and 14 stitches after falling Sunday at his Georgia home, but made it to an evening concert in Tennessee to rally volunteers... onlineathens.com", "2019-10-07T00:58:40.000Z": "What. A. Game. #RELENTLESS", "2019-10-07T00:20:45.000Z": "Great column in the @AUG_Chronicle by U.S. Attorney Bobby Christine on coordinated efforts to stop and dismantle gangs in Georgia. Read here -> http:// ow.ly/Sq0u50wEbLp  #gapol Column: Prosecuting gangs, drugs, violent crime: It takes a network In the War on Terror, we've learned that you fight a network with a network. Criminal gangs are networks of thieves trafficking in drugs, guns, violence and humans - slavery by any other name. Across... augustachronicle.com", "2019-10-04T21:45:08.000Z": "ICYMI: This federal grant will enhance our state partnership to raise literacy rates & ultimately improve educational outcomes for Georgia students. http:// ow.ly/avsw50wBFfT  #gapol Georgia awarded nearly $180 million for literacy in schools The award builds on prior federal funding, with some schools saying it has helped ajc.com", "2019-10-04T18:50:07.000Z": "We will continue to do everything in our power, every single day, to end sex trafficking in Georgia. We will stand with victims to help them recover, restart, and realize their God-given potential. http:// ow.ly/cPI550wBEZZ  #gapol Lawmakers, hotel operators target human trafficking ATLANTA - Federal and state lawmakers joined forces with the hospitality industry against human trafficking. valdostadailytimes.com", "2019-10-04T16:10:13.000Z": "ICYMI: Governor and first lady stop at YKK plant in Macon -> http:// ow.ly/8Ryt50wBEPy  #gapol Governor and first lady stop at YKK plant in Macon MACON, Ga. -- The governor and first lady make a stop in Middle Georgia Tuesday. Governor Brian Kemp and First Lady Marty Kemp toured the YKK manufacturing plant on Chestney Rd. in Macon. The... wgxa.tv", "2019-10-04T13:30:08.000Z": "On the campaign trail, I promised to be a Governor for the entire state of Georgia. Our cities outside of Metro Atlanta, rural counties, and farm towns are always on my mind. http:// ow.ly/1Kwt50wBFt6  #gapol Kemp: South Georgia not forgotten VALDOSTA - Gov. Brian Kemp sang the praises of South Georgia Wednesday during the Home Builders Association of South Georgia 54th Installation of Officers Awards and Annual Membership Luncheon. valdostadailytimes.com", "2019-10-03T22:42:44.000Z": "Former @Braves Otis Nixon and I are cheering on the home team from Perry. Go Braves! #RELENTLESS  #ChopOn  #gapol", "2019-10-03T21:40:58.000Z": "Let's keep choppin' and be #relentless , @Braves ! #ChopOn  #gapol", "2019-10-03T20:53:29.000Z": "Go @Braves . Be #RELENTLESS . #gapol", "2019-10-03T01:01:06.000Z": "Couple of hardworking Georgians at the @UGACRs meeting. Appreciate @RepDougCollins for his strong leadership in Washington and so proud of my daughter, Lucy, for her focus & determination in the classroom! #gapol", "2019-10-02T13:06:06.000Z": "Great event this morning down in Lake Park. Awesome crowd in support of Rep. John Corbett! #gapol", "2019-10-01T15:09:06.000Z": "Proud to partner with @GAFirstLady and the GRACE Commission to end human trafficking in Georgia! #gapol Quote Tweet AHLA @AHLA We thank @GAFirstLady Marty Kemp for her dedication to ending human trafficking through her vital work with the #GRACECommission  #NoRoom", "2019-09-30T13:00:41.000Z": "What an honor to visit with so many hardworking folks on our Georgia Made Tour. Together, we will keep our state strong, safe, and prosperous. http:// ow.ly/sLyh50wwEpg  #gapol Gov. Brian Kemp stops in Hall, focusing on economy Gov. Brian Kemp reflected on economic growth in the state and outlined goals of his administration when he spoke Thursday at the Greater Hall Chamber of Commerce's Board of Directors meeting. gainesvilletimes.com", "2019-09-29T22:53:48.000Z": "Saddened to learn of former Cobb Chairman Tim Lee's passing. He was a bold leader who made a huge impact in Cobb County and beyond. Our prayers are with his family and loved ones as they mourn. http:// ow.ly/fDcI50wvPzQ  #gapol Former Cobb commission chairman Tim Lee dies after cancer diagnosis Leader negotiated deal that brought SunTrust Park, Atlanta Braves to Cobb County ajc.com", "2019-09-29T22:45:46.000Z": "The Kemp Family would like to wish our Jewish friends and neighbors a Happy and Healthy New Year! #RoshHashanah  #gapol", "2019-09-28T13:00:34.000Z": "Thanks Gov. @BrianKempGA for your support of National Hunting and Fishing Day! Celebrate today at a FREE event near you: http:// bit.ly/2DdD9hg", "2019-09-25T17:44:25.000Z": "Great to open up @onlineathens and see this full page ad from @NotreDame fans who enjoyed their time in Georgia. Incredibly classy move by the Irish. Proud of the #DawgNation ! #gapol  #godawgs", "2019-09-24T19:15:14.000Z": "\"Georgia is ranked second in growth of number of women-owned firms since 2014 with a 27.2% increase, seventh in growth of jobs created with a 9.6% increase and sixth in growth of firm revenues with a 16% increase.\" http:// ow.ly/LM6I50woy7p  #gapol Report: Georgia second in growth of women-owned businesses ATLANTA - Georgia has an estimated 533,030 women-owned businesses, employing 285,237 and attributing roughly $57,120,180,000 to the state's economy, according to the ninth annual State of Women-Owned... albanyherald.com", "2019-09-24T13:06:46.000Z": "Today is #NationalVoterRegistrationDay Our office is committed to fair elections and we are excited to launch our new paper based ballot system. For more information on voting, visit: http:// bit.ly/2khOXX4", "2019-09-24T15:55:10.000Z": "Great column by @kbwingfield on our efforts - through the Georgians First Commission - to streamline government so Georgians can getting into the workforce quicker and for less $$$ -> http:// ow.ly/6J9T50woxnk  #gapol Speeding up Georgia's vocational licensing programs It's bad enough that almost half a million Georgians - about 1 in 10 of us with a job - need the government's permission to work in their chosen field. thebrunswicknews.com", "2019-09-24T01:50:03.000Z": "Appreciate the SWAT unit from the Floyd County PD and applaud their courage and focus. These hardworking Georgians risked their lives to keep local neighborhoods and families safe. http:// ow.ly/oEnY50wn7od  #gapol Suspected gang member killed in officer-involved shooting in Floyd County ajc.com", "2019-09-23T22:10:07.000Z": "Georgia earns encore as 'Top State for Business' -> http:// ow.ly/vxSU50wmqkw  #gapol EDITORIAL: Georgia earns encore as 'Top State for Business' Georgia has garnered the title \"Top State for Business\" for the sixth year in a row, evidence of a successful commitment to economic growth combined with the indispensable incentives to mdjonline.com", "2019-09-23T18:55:07.000Z": "ICYMI: Gov. Kemp visits Roper Corp. in LaFayette with 'Georgia Made' tour -> http:// ow.ly/Zr4h50wmqbj  #gapol Gov. Kemp visits Roper Corp. in LaFayette with 'Georgia Made' tour Georgia Gov. Brian Kemp visited and toured Roper Corp. in LaFayette on Friday, Sept. 20, as part of his \"Georgia Made\" tour to highlight Georgia-made products and bring new business mdjonline.com", "2019-09-23T16:10:13.000Z": "Thanks to strong, visionary leadership, our ports are firing on all cylinders! Check out this column on one of Georgia's top success stories -> http:// ow.ly/t6zK50wmq7y  @gaports  #gapol You could argue, with good reason, that this is Georgia's greatest success story I've covered the State of the Port address in Savannah about six or seven times now. The meeting hosted by the Georgia Ports Authority and the Savannah chapter of the Propeller Club of the United... ledger-enquirer.com", "2019-09-23T13:32:35.000Z": "Yesterday, @GAFirstLady and I welcomed home soldiers from the @48thIBCT after a 9 month deployment to Afghanistan. Thank you for your selfless service to our state and nation! #gapol", "2019-09-22T13:42:14.000Z": "Quick bite at Sunnyside Up in Savannah before we welcome our @NationalGuard troops back home from Afghanistan. #gapol", "2019-09-21T01:57:56.000Z": "Congratulations to the @Braves ! #ChopOn  #gapol Quote Tweet Atlanta Braves @Braves BACK. TO. BACK.\n\nThe Atlanta Braves are 2019 National League East Champions! #ChopOn", "2019-09-21T01:37:02.000Z": "Just informed @CoachLouHoltz88 that his prediction for tomorrow's game is \"fake news.\" Go Dawgs! #gapol  #dawgnation", "2019-09-20T18:00:28.000Z": "On Thursday, Alabama @GovernorKayIvey announced that she is undergoing treatment for lung cancer. I hope you will join the Kemp Family in praying for Governor Ivey's quick and full recovery! #gapol", "2019-09-20T13:37:06.000Z": "Honored to participate in \"Return the Favor\" at the @CollegeFBHoF in Atlanta. Great crowd to thank @NDFootball fans for their hospitality a couple of years ago in South Bend. #GoDawgs Quote Tweet Governor Brian P. Kemp @GovKemp I hope #DawgNation will join the Kemp family as we #ReturnTheFavor to our friends from South Bend! \n\nWe're looking forward to Saturday! Go Dawgs! @GAFirstLady  #gapol  #BeatTheIrish", "2019-09-20T13:29:49.000Z": ". @GeorgiaNTC 's ribbon cutting this morning proves that Georgia leads the nation in workforce development. Thanks to private sector partners, @TCSG , and local community support, northwest Georgia is choppin' some wood! #gapol", "2019-09-20T01:50:02.000Z": "ICYMI: RAI Industrial Fabricators to Build New Facility in Banks County, Create 30 New Jobs -> http:// ow.ly/QeQC50wgPD1  #gapol", "2019-09-20T00:05:06.000Z": "ICYMI: Gov. Brian Kemp speaks at parental accountability court graduation -> http:// ow.ly/ZUT350wgRgA  #gapol Gov. Brian Kemp speaks at parental accountability court graduation Governor Brian Kemp attended a huge celebration Tuesday for local graduates. But these aren't just any graduates. fox5atlanta.com", "2019-09-19T22:15:07.000Z": "While I am incredibly proud of these record breaking job creation numbers, we cannot take our foot off the gas. We must budget conservatively, invest wisely, and advance policies that ensure a safer, stronger Georgia! http:// ow.ly/NYLi50wgPyF  #gapol Georgia posted strongest August job growth in two decades Georgia's August job growth was the strongest in two decades, adding 20,800 jobs, nearly double the average of the last five Augusts. ajc.com", "2019-09-19T21:10:06.000Z": "We are grateful that Tyson Foods is continuing their investment in Georgia and excited for the new opportunities that this expansion will create for Mitchell County & the region. http:// ow.ly/cdpE50wgQdV  #gapol Kemp announces 100 Tyson Foods jobs in Mitchell County Construction recently wrapped up on a Tyson Foods 35,000-square-foot expansion, and the construction of a new \"mega line\" has prompted the company to hire 100 new team members in Camilla albanyherald.com", "2019-09-19T20:58:35.000Z": "Congratulations to Georgia's own, @RhettAkins , on earning the Academy of Country Music's Songwriter of the Decade Award. Rhett is an incredibly talented artist and we are proud of his continued success! http:// ow.ly/cBzS50wgRzm  #gapol Rhett Akins Wins Inaugural ACM Songwriter of the Decade Award The Academy of Country Music announce the addition of seven new ACM Decade Awards: Song of the Decade, Album of the Decade, Artist-Songwriter of the Decade, Breakout Artist of the Decade, Single of... thecountrydaily.com", "2019-09-19T01:54:34.000Z": "Stopped at Carver's Country Store in Hawkinsville for some hotdogs. Appreciate the warm welcome and great food! #gapol", "2019-09-18T15:55:11.000Z": "Rural Georgia is ripe for economic development and I'm laser focused on bringing projects of regional significance to communities that want to grow. http:// ow.ly/1jXW50weUld  #gapol Kemp Launches 'Rural Strike Team,' Tour Highlighting Georgia-Made Products Gov. Brian Kemp is launching a new statewide initiative to promote Georgia-made products and bring new business to rural parts of the state. At Faircloth gpbnews.org", "2019-09-16T22:00:26.000Z": "September is National Preparedness Month. Develop a plan, secure flood insurance, and be ready for whatever weather comes our way. RT and encourage your neighbors and friends to be \"Prepared, Not Scared.\" http:// ow.ly/52Yq50wbqcQ  #gapol September is National Preparedness Month Governor Brian Kemp has declared September as National Preparedness Month, with the goal of Georgians being \"Prepared, Not Scared,\" for floods and any other disasters, both physically and financially. allongeorgia.com", "2019-09-16T19:00:36.000Z": "ICYMI: Gov. Kemp announces Rural Strike Team, statewide 'Georgia Made' tour -> http:// ow.ly/aHDm50wbq6V  #gapol Gov. Kemp announces Rural Strike Team, statewide 'Georgia Made' tour ATLANTA - Along with local and state economic development leaders at Faircloth Forest Products in Swainsboro, Ga., Thursday, Gov. Brian Kemp announced the creation of a rural strike team to moultrieobserver.com", "2019-09-16T16:05:15.000Z": "Last week, I announced the formation of a Rural Strike Team, which will work with local leaders to identify & market economic development opportunities throughout our state. By partnering , we can ensure a more prosperous future for all Georgians! http:// ow.ly/H1AX50wbpXq  #gapol Gov. Kemp announces Rural Strike Team, statewide 'Georgia Made' tour ATLANTA - Along with local and state economic development leaders at Faircloth Forest Products in Swainsboro, Ga., Thursday, Gov. Brian Kemp announced the creation of a rural strike team to moultrieobserver.com", "2019-09-13T16:05:15.000Z": "I am so proud of my wife, @GAFirstLady , for leading efforts to end human trafficking in Georgia. Through the GRACE Commission, she is working every day to keep our children - and our communities - safe. http:// ow.ly/nKyL50w8BUh  #gapol \"How is this happening?\" First lady Marty Kemp tackles trafficking Newly formed Grace Commission aims to combat the issue ajc.com", "2019-09-13T13:46:44.000Z": "Incredibly proud of the #DawgNation for uniting around this great cause! #GoDawgs  #PinkOut  #WearPinkForWendy  http:// ow.ly/lhR350w8tpA  @universityofga UGA fans launch impromptu 'Pink Out' for Georgia-Arkansas State game ajc.com", "2019-09-12T11:58:29.000Z": "Proud of my friend, Greyson Kennedy. Fighting cancer and getting a limit of doves! Keep choppin'! #gapol  #cancerfighter", "2019-09-11T22:05:08.000Z": "ICYMI: Gov. Brian Kemp announces record year for global commerce and film -> http:// ow.ly/Xlay50w5tuH  #gapol Gov. Brian Kemp announces record year for global commerce and film The 332 projects located by the global commerce team in FY19 include new locations and existing industry expansions along with the record-breaking investment of $7.4 billion and 28,960 new jobs. gwinnettdailypost.com", "2019-09-11T19:05:11.000Z": "Proud of the Spalding County Sheriff's Office for doing their part to dismantle gangs and keep Georgia families safe. Keep choppin! http:// ow.ly/ovmT50w5tra  #gapol  @SpaldingSheriff 19 arrested, 7 sought after meth, cocaine, opioids trafficking sting in Griffin ajc.com", "2019-09-11T16:43:56.000Z": "Many years have passed since #september11 but we will #neverforget the innocent lives lost, bravery of our first responders, and the strength of American resolve. #neverforget911  #september11th  #gapol", "2019-09-11T16:25:07.000Z": "With record-breaking years in global commerce and film, Georgia remains the \"Top State for Business.\". We are the Hollywood of the South, and companies across the globe have Georgia on their minds as a great place to invest, expand and relocate. http:// ow.ly/Dv6950w5tAZ  #gapol Gov. Brian Kemp announces record year for global commerce and film The 332 projects located by the global commerce team in FY19 include new locations and existing industry expansions along with the record-breaking investment of $7.4 billion and 28,960 new jobs. gwinnettdailypost.com", "2019-09-10T17:16:25.000Z": ". @GovKemp today announced that Georgia has been named the \"Top State for Business\" by @AreaDevelopment , a leading publication covering corporate site selection and relocation, for the sixth year in a row! https:// georgia.org/newsroom/press -releases/gov-kemp-georgia-named-top-state-business-6th-straight-year ", "2019-09-10T15:31:30.000Z": "I was honored to join @AreaDevelopment Magazine today to announce that Georgia is the #1 State for Business for the 6th straight year! #gapol  #KeepChoppin", "2019-09-10T00:41:53.000Z": "By creating a Rural Strike Team that partners with local leaders to recruit economic development projects of regional significance, we can grow jobs & enhance opportunity in every corner of our state. Kemp outlines new 'strike team' to boost economy in rural Georgia ajc.com", "2019-09-08T23:35:21.000Z": "Great to be back with our day one supporters in Thomson. Let's keep choppin'! #gapol", "2019-09-08T15:14:31.000Z": "Saturday was Opening Day of dove season. Good folks. Good weather. Great Georgia tradition! #gapol", "2019-09-07T20:32:55.000Z": "It's official. #gapol  #dgd  #godawgs", "2019-09-07T14:25:31.000Z": "Last night, the Kemp Family was honored to be with @KirbySmartUGA  @HerschelWalker and some damn good Dawgs to honor Coach Vince Dooley and celebrate his incredible impact on the @universityofga . #gapol  #dgd  #godawgs", "2019-09-06T22:05:10.000Z": "Proud of Insurance Commissioner John King for his leadership before, during, and after #HurricaneDorian . Keep choppin', General! http:// ow.ly/4jNV50vZtF7  #gapol Georgia Insurance Commissioner King Announces Hurricane Dorian Relief Actions athensceo.com", "2019-09-06T19:05:10.000Z": "We must lower insurance premiums, improve access to quality care, and dramatically improve healthcare outcomes. Through the Patients First Act, we will do just that -> http:// ow.ly/AGc350vZt63  #gapol The fragile state of Georgia health care Gov. Brian Kemp hired the consulting firm Deloitte to report back to him on the landscape of Georgia health care. ajc.com", "2019-09-05T22:54:16.000Z": "Just heard from @POTUS who called to check in on Georgia after Hurricane #Dorian . We're immensely grateful for his strong leadership and coordination through our storm preparation, response, and recovery.", "2019-09-05T16:10:19.000Z": ". @GADeptofTrans has inspected and cleared the US-17 Savannah River Bridge for public use. Thank you to the crews for working hard after #Dorian to check our roads and bridges for safety. Greatly appreciated! #gapol", "2019-09-05T14:37:04.000Z": "Good news from our crews in @GeorgiaDOTSE . The Sidney Lanier Bridge has been inspected and is fully reopened! Thank you to our crews for working efficiently to get this open to the traveling public. #WorkingForYou", "2019-09-05T19:31:25.000Z": "Thanks to state and local law enforcement coming together for a multi-county drug and weapons operation, members of a dangerous street gang are behind bars. @GBI_GA  @ga_dps  @Atlanta_Police  @ClaytonCountySO 3 suspected gang members arrested in drug, weapons sting ajc.com", "2019-09-04T21:33:04.000Z": "When the clouds form and the rain pours how prepared are you? Flash flooding can occur due to heavy rainfall, watch the @fema video below to learn what you can do to #BePreparedNotScared  #PreparednessMonth  #HurricaneDorian", "2019-09-04T22:19:51.000Z": "At @GeorgiaEMA for 5:30 PM update on Hurricane #Dorian . Reports of trees down, power outages in Chatham County, and concerning water levels along the coast. We'll continue to provide updates as they're available.", "2019-09-04T18:49:51.000Z": "Thanks to acting @fema Administrator Pete Gaynor for coming down today to assist with #HurricaneDorian response at @GeorgiaEMA HQ. We appreciate your support and the great work your staff is doing for those in the storm's path! #gapol", "2019-09-04T20:02:10.000Z": "Just got off the phone with Maj. Gen. Aguto at @USAGStewartHAAF . I appreciate his support as we coordinate the response to #HurricaneDorian . Thanks for all you do! #gapol Quote Tweet Fort Stewart-Hunter Army Airfield @USAGStewartHAAF Fort Stewart-Hunter Army Airfield and the 3rd Infantry Division leadership are taking appropriate precautions in preparing for #HurricaneDorian .", "2019-09-04T16:36:46.000Z": "Joint @FEMA & @GeorgiaEMA GeorgiaEMA press conference at 1 PM. Stream >> http:// bit.ly/2RQhoI3 . Here at GEMA HQ, we're hearing new reports of several trees down in Glynn & Wayne Counties. Downed trees may mean downed power lines, which are life-threatening. Be extremely careful", "2019-09-04T03:41:12.000Z": "As we continue to monitor the path of Hurricane #Dorian , we're mobilizing @GeorgiaGuard to aid in transportation and distribution of life-sustaining resources on our coast. We've got all hands on deck for this powerful storm. Please stay vigilant. #gapol Quote Tweet Brad Nitz @BradNitzWSB", "2019-09-04T09:51:55.000Z": "Based on 5 AM forecast for #Dorian , I've issued an Executive Order expanding the State of Emergency to include Appling, Bacon, Bulloch, Clinch, Echols, Evans, Screven, Tattnall & Ware Counties. Tropical storm winds are expected in these areas. Price-gouging is prohibited. #gapol", "2019-09-04T01:18:29.000Z": "INBOX: tomorrow @GovKemp 's noon briefing will include acting @fema administrator Pete Gaynor and a slew of statewide officials ahead of Hurricane #Dorian 's impact in GA. #gapol", "2019-09-03T17:21:30.000Z": "According to @GeorgiaEMA , here's where Hurricane #Dorian will be at roughly 9 PM tomorrow. Coastal Georgians and visitors, please follow evacuation orders. Dangerous conditions and severe flooding are imminent. #gapol", "2019-09-03T15:12:28.000Z": "We're headed over to @GeorgiaEMA HQ to coordinate with state agencies involved in #HurricaneDorian response. Stay tuned for further updates! #gapol", "2019-09-03T20:00:41.000Z": "Tune in at 5:30pm for a live update from @GovKemp and @GeorgiaEMA 's meteorologist Will Lanxton on #HurricaneDorian 's projected coastal impact >> http:// bit.ly/2RQhoI3  #gapol", "2019-09-03T18:22:01.000Z": "Really appreciate Adjutant General Carden and General King for their hard work and leadership. We are working side-by-side to prepare for #HurricaneDorian and keep our people safe from harm. #gapol  @GeorgiaGuard  @NationalGuard", "2019-09-03T13:41:00.000Z": "Contra-flow has begun on I-16. Stay informed. \nFor traffic or road conditions contact 511 Georgia (*511 from your cell phone.) Buckle Up and Stay Safe.", "2019-09-02T19:50:39.000Z": "Evacuating and need shelter for your pet? Go to https:// gema.georgia.gov/emergencies-0/ hurricane-dorian  for info on pet shelters and pet-friendly hotels.", "2019-09-03T12:32:31.000Z": "Contraflow on I-16 has begun. If you're traveling from Florida or south Georgia, keep alternate routes in mind, be patient and don't drive distracted.", "2019-09-03T12:42:55.000Z": "Incredibly proud of the @Braves for their generosity and hospitality. If you know of any evacuees in the Atlanta metro area, please share this article with them -> http:// ow.ly/kArC50vUWgC  #gapol Braves to give complimentary tickets to Hurricane Dorian evacuees ajc.com", "2019-09-02T19:42:07.000Z": "Ensure you and your pets are prepared ahead of #HurricaneDorian .", "2019-09-02T19:42:09.000Z": "Make a Plan :\n\n-Map out pet friendly hotels along your evacuation route \n\n-Identify boarding facilities, veterinarians, and animal hospitals near your evacuation destination \n\n-Ensure your pet's microchip information is up-to-date", "2019-09-02T23:08:08.000Z": "Tonight I've issued an Executive Order authorizing GA Department of Defense to provide up to 2,000 GA National Guardsmen for #Dorian prep, response & recovery. Adjutant General Carden is now empowered to call up Guardsmen to State Active Duty upon request of @GeorgiaEMA . #gapol", "2019-09-02T15:25:29.000Z": "Evacuation reminders: 1. Know where you are going before getting on the road. 2. Be patient as heavy traffic expected on Interstates and major highways. 3. Wear Seat Belts. 4. Drive with on road & not . 5. Watch for & slow down for law enforcement officers directing traffic.", "2019-09-02T15:32:03.000Z": "\"This storm is still moving. It's massive. I would not take any chances.\" Gov. Kemp is urging people along the Georgia coast to heed evacuation orders. THE LATEST: https://", "2019-09-02T15:26:04.000Z": "#BREAKING : Trump declares emergency in Georgia ahead of #HurricaneDorian . https:// on-ajc.com/2lzfOOx", "2019-09-02T16:22:13.000Z": ". @GovKemp held a news conference at the Georgia Ports Authority, encouraging Coastal Georgia residents to evacuate ahead of Hurricane Dorian. GPA terminals will be closed Tuesday. Stay tuned to http:// gaports.com for updates. #HurricaneDorian  #Georgia  #dorian", "2019-09-02T01:55:26.000Z": "Starting noon tomorrow, individuals east of I-95 in Bryan, Camden, Chatham, Glynn, Liberty, and McIntosh Counties must evacuate due to Hurricane #Dorian . @GeorgiaEMA and @GADeptofTrans will start westerly contraflow on I-16 at 8 AM on Tuesday, Sept. 3. Stay vigilant and be safe.", "2019-09-01T13:12:17.000Z": "\"Getting Ready for Hurricane #Dorian \"\n\nA lot of great information has been shared this week on how to prepare for hurricanes. We've collected a wide variety of tips and resources in this Moment: Readygov @Readygov Getting Ready for Hurricane #Dorian #Dorian is a good reminder to be prepared, as September is typically the most active month of hurricane season. Have a plan, make a kit, be informed.", "2019-09-01T17:40:08.000Z": "At the @GeorgiaEMA State Operations Center for a video conference with @POTUS , @fema , @henrymcmaster , @NC_Governor , & @GovRonDeSantis on Hurricane #Dorian .", "2019-09-01T12:33:15.000Z": "For the latest on #HurricaneDorian , visit http:// gema.ga.gov or follow the Georgia Emergency Management and Homeland Security Agency on Facebook and Twitter ( @GeorgiaEMA ). Stay alert and be prepared! #gapol", "2019-08-31T23:37:23.000Z": "Please pray for #Odessa and #Midland . Tragically, several lives have been lost and many people, including law enforcement, are injured. @GAFirstLady , the girls, and I send our deepest condolences to the State of Texas. Texas shooting: Names of victims released by City of Odessa ajc.com", "2019-09-01T01:27:03.000Z": "Congratulations to @GeorgiaStateFB for the HUGE #UpseT win today over the Vols! The entire state of Georgia is celebrating with you! #gapol Quote Tweet GSU Football @GeorgiaStateFB #UpseT  #OurCity | #WITNESS2020", "2019-08-31T13:35:24.000Z": "#HurricaneDorian projections have now shifted more toward Coastal Georgia. I urge Georgians in these areas to stay vigilant, keep an eye on storm developments, and take all necessary precautions. #gapol Hurricane Dorian remains powerful Category 4 storm; Georgia still at risk We're using the most powerful weather technology to bring you the latest on Dorian's track on Channel 2 Action News wsbtv.com", "2019-08-30T23:50:41.000Z": "President @realDonaldTrump spoke with Georgia @GovKemp and Florida @GovRonDeSantis about Hurricane #Dorian today. He will be monitoring the storm this weekend. If you are in the affected areas, listen to the instructions of state and local officials.", "2019-08-30T20:03:39.000Z": "I was honored to speak with @POTUS today regarding #HurricaneDorian preparations here in Georgia as state, local, and federal partners work to keep our citizens safe. Thank you for your continued support, Mr. President! #gapol", "2019-08-30T00:20:35.000Z": "Many thanks to ...... @gdecd  for developing this resource to connect people with hotel and lodging availability, visitor information centers, and other important emergency resources as we prep for Hurricane #Dorian . #gapol  https:// exploregeorgia.org/travel-alerts", "2019-08-29T22:46:17.000Z": "Those who take advantage of consumers fleeing #Dorian 's path will be held accountable. \n\nOur #ConsumerProtection Division is authorized to investigate scams/price gouging - penalties can range from $2,000 to $15,000 per violation. \n\nRead more -> https:// law.georgia.gov/press-releases /2019-08-29/carr-warns-potential-scams-and-price-gouging-related-hurricane-dorian ", "2019-08-29T20:43:11.000Z": "To ensure an uninterrupted supply of petroleum products, emergency supplies, and food, I've issued an Executive Order temporarily suspending federal rules and regulations which would otherwise limit the hours that operators of commercial vehicles may drive. (1/2) #gapol", "2019-08-29T20:43:13.000Z": "This Executive Order also temporarily waives specific weight, height, and length restrictions for vehicles traveling through Georgia for purposes of disaster preparation or relief, subject to @ga_dps oversight and permitting. (2/2) #gapol", "2019-08-29T20:13:30.000Z": "Ahead of #Dorian , I've declared a State of Emergency in Brantley, Bryan, Camden, Charlton, Chatham, Effingham, Glynn, Liberty, Long, McIntosh, Pierce & Wayne Counties to assist with prep, response & recovery. OCGA 10-1-393.4 - prohibiting price-gouging - is now in effect. #gapol", "2019-08-29T19:19:26.000Z": "Great to see my friend Greyson Kennedy from Statesboro fighting hard @childrensatl ! #TeamGreyson  #choa", "2019-08-28T19:28:56.000Z": "Marty and I really appreciate @gingerhoward7 and her years of support, friendship, and hard work on behalf of the #GAGOP . Keep choppin', Ginger! #gapol Quote Tweet David Perdue @Perduesenate US Senate candidate, GA . @gingerhoward7 is doing an outstanding job serving Georgia as our Republican National Committeewoman. It was great catching up today in Perry! #gapol  #gasen  @GaRepublicans twitter.com/gingerhoward7/", "2019-08-28T15:58:52.000Z": "\"No one embodies the heart & soul of Georgia more than @JohnnyIsakson . Our state and country have been immeasurably blessed by his leadership...our family is forever grateful for the friendship that Johnny and Dianne have shown us over the years...\" http:// ow.ly/tioD50vMEtk  #gapol", "2019-08-27T22:00:19.000Z": "On Monday, I met with Vietnamese business leaders in Gwinnett to discuss Georgia's strong economy and our efforts to make our state #1 for small business. http:// ow.ly/Htsh50vLlTw  #gapol Atlanta News Videos | WSB-TV Watch Atlanta news videos from WSB-TV. The latest local news videos from the Atlanta Metro area. Sports, crime, and the latest entertainment. wsbtv.com", "2019-08-27T18:50:10.000Z": "Gangs are flooding communities throughout Georgia with violence, drugs, and fear. Through our Task Force, we will give local law enforcement and prosecutors the tools they need to dismantle gangs and keep our citizens safe. http:// ow.ly/fzgO50vLlIC  #gapol New gang charges for 3 accused in killing, aggravated assault of teens ajc.com", "2019-08-27T00:45:03.000Z": "Earlier this year, we budgeted $69 million for school security upgrades in Georgia. On Friday, @GAFirstLady and @sendavidperdue stopped by Mashburn Elementary School to see how local leaders are using these funds to keep students safe. http:// ow.ly/dChp50vKvPf  #gapol Sen. Perdue, Marty Kemp tour school security improvements A handful of state leaders toured a Forsyth County elementary school Friday to learn about security improvements made for this school year. fox5atlanta.com", "2019-08-24T16:12:07.000Z": "Honored to be at the #GAGOP 8th District Fish Fry today in Perry. Together, we have advanced a bold, conservative agenda that grows economic opportunity, enhances access to quality, affordable healthcare, protects our families, and puts hardworking Georgians first! #gapol", "2019-08-24T15:14:17.000Z": "A native Georgian, trusted counsel, and man of integrity, Court of Appeals Judge Stephen Goss will be sorely missed by countless people across our state and nation. The Kemp family asks God to give comfort to his loved ones, friends, and colleagues in this difficult time. Quote Tweet The Albany Herald @Albany_Herald ALBANY -- Albany police say Georgia Court of Appeals Judge Stephen Goss died Saturday from a single gunshot wound in a wooded area on the 600 block of Greenwood Drive. https:// albanyherald.com/local/court-of -appeals-judge-stephen-goss-found-dead/article_5a0eda54-c675-11e9-a2d7-dfa09c65b300.html#utm_campaign=blox&utm_source=twitter&utm_medium=social ", "2019-08-24T15:00:11.000Z": "Great morning walking the show barns in Perry with @GAFirstLady and Georgia's Insurance and Fire Safety Commissioner John King. Lots of hardworking Georgians out here! #gapol", "2019-08-23T20:57:53.000Z": "New polls have @UGA_CollegeofAg and @universityofga football ranked #3 in the nation. It's time to hunker down, chop wood, and earn the #1 spot. #GoDawgs  #gapol 2020 Best Colleges for Agricultural Sciences Ranking of Top 100 colleges for agricultural science majors. niche.com", "2019-08-22T19:00:18.000Z": "Appreciate our LEOs in Johns Creek and Alpharetta for not only raiding this drug house but saving the baby and dogs inside. Thank you for working around the clock to keep our communities, people safe. https:// ajc.com/news/local/pol ice-raid-filthy-alleged-alpharetta-drug-house-remove-baby-and-dogs/UlFZ9n0uSTKsxsFbaC0EOK/   #gapol Police raid 'filthy' alleged Alpharetta drug house, remove baby and dogs Officers raided a north Fulton County drug house, finding narcotics along with a baby and two dogs in unfit conditions, Alpharetta police said Tuesday. ajc.com", "2019-08-22T17:24:33.000Z": "With record employment, sustained job creation, & economic growth, it's a great time to be a Georgian. To keep moving in the right direction, we must continue to budget conservatively, spend wisely, & always put hardworking Georgians first. http:// ow.ly/Yv7250vG61S  #gapol Ga. Gov. Brian Kemp touts economic wins but says Georgia will prepare for 'rainy day' Gov. Brian Kemp offered two economic messages as he addressed the Gwinnett Chamber at the Infinite Energy Center in Duluth Monday: business is good and be prepared for a possible gwinnettdailypost.com", "2019-08-22T15:15:14.000Z": "Let's keep choppin', Georgia! #gapol Quote Tweet The RGA @The_RGA Georgia's unemployment rate is lower right now than it has been in more than 18 years, with @BrianKempGA at the helm, more people are working in the state than ever before. #GAGov  #GAPol", "2019-08-22T01:57:58.000Z": "Great night at @SunTrustPark with @GAFirstLady , Amy Porter, @GeoffDuncanGA & the boys. Also honored to meet World Series champ, Ryan Klesko! @Braves  #ChopOn  #gapol", "2019-08-22T01:45:00.000Z": "Celebrity sighting at @SunTrustPark. Thanks @MrRyderDuncan for snapping a photo with some of your biggest fans! #gapol", "2019-08-20T21:50:06.000Z": "ICYMI: Ga. Gov. Brian Kemp touts economic wins but says Georgia will prepare for 'rainy day' -> http:// ow.ly/LjLi50vDspB  #gapol Ga. Gov. Brian Kemp touts economic wins but says Georgia will prepare for 'rainy day' Gov. Brian Kemp offered two economic messages as he addressed the Gwinnett Chamber at the Infinite Energy Center in Duluth Monday: business is good and be prepared for a possible gwinnettdailypost.com", "2019-08-20T19:05:10.000Z": "Great to be with the @GwinnettChamber yesterday to highlight our economic growth and discuss ways to ensure a safer, stronger Georgia. http:// ow.ly/H89250vDseX  #gapol Ga. Gov. Brian Kemp touts economic wins but says Georgia will prepare for 'rainy day' Gov. Brian Kemp offered two economic messages as he addressed the Gwinnett Chamber at the Infinite Energy Center in Duluth Monday: business is good and be prepared for a possible gwinnettdailypost.com", "2019-08-20T18:00:16.000Z": "I told voters we would streamline government, budget conservatively, and prioritize education and healthcare. We are \"choppin' wood\" to ensure a better, brighter tomorrow. http:// ow.ly/9WCP50vDsuW  #gapol Ga. Gov. Brian Kemp touts economic wins but says Georgia will prepare for 'rainy day' Gov. Brian Kemp offered two economic messages as he addressed the Gwinnett Chamber at the Infinite Energy Center in Duluth Monday: business is good and be prepared for a possible gwinnettdailypost.com", "2019-08-19T19:10:12.000Z": "ICYMI: Georgia sets jobs record in July, unemployment rate approaching all-time low -> http:// ow.ly/EQ9y50vBQ0N  #gapol Georgia sets jobs record in July, unemployment rate approaching all-time low Georgia added 3,400 jobs in July, pushing the total to 4.62 million jobs - a new record for the state.", "2019-08-19T16:10:14.000Z": ". @mdjonline : \"In our view, the governor has acted prudently to tighten state spending and move toward long-term reform of fiscal policies in keeping with his well-known conservative philosophy...\" http:// ow.ly/WesE50vBPHq  #gapol EDITORIAL: State budget cuts a prudent move by governor Gov. Brian Kemp has taken an unusual step in directing state agencies to cut their budget proposals by 4% this fiscal year and an additional 6% in the next fiscal mdjonline.com", "2019-08-19T13:15:13.000Z": "Big congrats to @GeorgiaTech golfer @andy_ogletree for winning the U.S. Amateur on Sunday! Big things in store for this Yellowjacket! http:// ow.ly/5K3Z50vBMi3  #gapol Georgia Tech's Andy Ogletree wins U.S. Amateur ajc.com", "2019-08-19T01:15:41.000Z": "Perfect way to end the weekend. #gapol", "2019-08-16T21:55:06.000Z": "ICYMI: Kemp orders cybersecurity training for nearly all state workers after cyberattacks -> Kemp orders cybersecurity training for nearly all state workers after cyberattacks Kemp ordered cyber security training twice a year for nearly all state workers. It's all part of an executive order he just signed. wsbtv.com", "2019-08-16T19:15:14.000Z": "I applaud Atlanta PD for cracking this case. Anyone who targets law enforcement will be found and should be prosecuted to the fullest extent of the law. http:// ow.ly/k8Yq50vzsmM  #gapol Brothers arrested, accused of firebombing Atlanta police officer's home ajc.com", "2019-08-16T17:05:12.000Z": "After months consistent growth, Georgia's unemployment rate is the lowest in 18 years. To keep our state moving in the right direction, we must budget conservatively, invest wisely, and always put hardworking Georgians ahead of the status quo. http:// ow.ly/Ay8750vzFdL  #gapol Georgia added 3,400 jobs in July, lowering unemployment rate to 3.6% No sign of recession in Georgia as 3,400 jobs added in July, Labor Department report says. ajc.com", "2019-08-16T15:55:12.000Z": "Staff Sgt. Dustin Wright, a Green Beret from Santa Claus who died during a mission in 2017, was posthumously given the Silver Star for valor. His family remains in our prayers. We are forever grateful for Sgt. Wright's service & sacrifice. http:// ow.ly/9PKM50vzs6D  #gapol Georgia Green Beret posthumously awarded the Silver Star for valor Staff Sgt. Dustin Wright was killed during a 2017 ambush in Niger. ajc.com", "2019-08-15T02:14:22.000Z": "The Kemp Family is praying for the Philadelphia Police Officers injured in the line of duty today. Our LEOs risk life and limb for the sake of public safety. We appreciate their service and sacrifice. #gapol", "2019-08-15T01:11:42.000Z": "Great history lesson and innovative thinking from @AmbAndrewYoung and friends. Really appreciate their time, input, and commitment to public service. #gapol", "2019-08-14T22:10:08.000Z": "ICYMI: Governor Brian Kemp Cuts Ribbon to Open PCOM South Georgia -> http:// ow.ly/LIUL50vxnj2  #gapol Governor Brian Kemp Cuts Ribbon to Open PCOM South Georgia /PRNewswire/ -- Close to 700 people who have a stake in the opening of PCOM South Georgia came to a ribbon-cutting ceremony on August 6, 2019, at the newly... prnewswire.com", "2019-08-14T19:10:11.000Z": "Proud of @Delta playing a vital role in the fight against human trafficking. Truly appreciate @GAFirstLady 's leadership and efforts through the GRACE Commission to end modern day slavery in Georgia. http:// ow.ly/zLnh50vxmCQ  #gapol Delta Air Lines donates $1.5M to anti-human trafficking nonprofit Delta's contribution will support the organization for the next three years, and follows a $1 million donation it provided in 2017. bizjournals.com", "2019-08-14T16:00:34.000Z": "Thanks to business-friendly government, low taxes, and undeniable southern hospitality, more jobs, investment, and economic opportunity are coming to South Georgia! http:// ow.ly/scAu50vxlUL  #gapol Grand opening celebrates second factory, $16M investment THOMASVILLE - On Tuesday, August 6, Check-Mate celebrated the grand opening of a second factory with Governor Brian Kemp, as well as industry and community leaders. timesenterprise.com", "2019-08-14T15:00:21.000Z": "It's settled. Uga is the greatest mascot in college football. #GoDawgs  #gapol Ranking the best mascots in college football history In honor of the 150th anniversary of college football, we present an all-time ranking of the best mascots in the sport. si.com", "2019-08-12T18:55:09.000Z": "$123 million plant and 150 new jobs coming to South Georgia -> http:// ow.ly/abM150vvpxm  #gapol Gov. Kemp: Manufacturer to bring 150 jobs, $123 million plant to south Georgia Georgia Gov. Brian Kemp said the manufacturing plant \"will generate exciting opportunities for hardworking Georgians.\" wjcl.com", "2019-08-12T15:50:10.000Z": "With low unemployment and record job growth, it's a great time to be a Georgian. To keep our state moving in the right direction, we must spend wisely and budget conservatively. We must put hardworking Georgians - not the status quo - first! http:// ow.ly/U4Nu50vvpfK  #gapol Spending cuts can exists in a strong economy When it comes to state government, we have been conditioned to think of spending cuts as ominous. The state must balance its budget, so spending cuts ostensibly mean falling revenues thebrunswicknews.com", "2019-08-11T21:06:22.000Z": "We were honored to join with The Duncan Family, Superintendent Woods, and Dr. Brian Hightower at @fbcwoodstock to pray for Georgia students, educators, and parents. Really appreciate @wcantrell for having us at his church! #gapol", "2019-08-10T15:57:22.000Z": "I hope you will join us in praying for Sheriff Thomas Smith's family, loved ones, and community. #gapol Quote Tweet 13WMAZ News @13wmaznews Washington County Sheriff Thomas Smith passes away https:// 13wmaz.com/article/news/l ocal/washington-county-sheriff-thomas-smith-passes-away/93-8c6d09c0-8c30-4915-923a-7482278790bf ", "2019-08-08T12:50:10.000Z": "A month ago, we mourned the loss of Deputy Nicolas Dixon, who was killed in the line of duty. This week, Hall County Sheriff's Deputies escorted his son on the 1st day of school. We appreciate our local heroes in uniform. They protect & inspire. http:// ow.ly/rEba50vrBHN  #gapol Hall County deputies escort son of slain colleague to first day of school ajc.com", "2019-08-07T18:55:08.000Z": "Building on our success as the top state for commerce, I am proud to see Georgia receive top marks for our small business climate. Together, we can make Georgia the #1 place for small business. http:// ow.ly/J9Xf50vqXol  #gapol Georgia receives A+ for small business friendliness; Kemp says they are 'backbone' of state's... Small business owners on the website Thumbtack awarded Georgia an A+ this year, ranking fourth in a survey in 49 states.", "2019-08-07T15:50:09.000Z": "Yesterday, we cut the ribbon at PCOM South Georgia, which will help train medical professionals who can serve the needs of rural communities throughout our state. https:// albanyherald.com/news/gov-brian -kemp-helps-to-cut-ribbon-on-pcom-south/article_79a50d28-b88a-11e9-a653-f720b002ea7e.html   #gapol Gov. Brian Kemp helps to cut ribbon on PCOM South Georgia in Moultrie Gov. Brian Kemp, with the help of officials from Moultrie, Colquitt County and the Philadelphia College of Osteopathic Medicine officially cut the ribbon on the new PCOM South Georgia campus albanyherald.com", "2019-08-07T00:43:14.000Z": "To secure a brighter future for our state, we must continue to budget conservatively, spend wisely, & put taxpayers first. By reducing waste and ending duplication in government, we can keep Georgia the best place to live, work, and raise a family. http:// ow.ly/1SXC50vqgn0  #gapol", "2019-08-06T21:55:06.000Z": "Keeping Georgia families safe is a top priority of my administrationI applaud Attorney General Carr and the Consumer Protection Division for their dedicated work in exposing scams and predatory behavior out in the marketplace. http:// ow.ly/dbZT50vq1qg  #gapol Carr: Consumer Protection Division yields more than $109M for Georgia consumers and State Treasury Attorney General Chris Carr announced that the Georgia Department of Law's Consumer Protection Division generated more than $109 million", "2019-08-05T18:45:11.000Z": "By eliminating the remnants of Common Core, we will reject the status quo and ensure that young Georgians are given the best opportunity to learn, grow, and succeed. We will do the heavy lifting now to ensure a better, brighter tomorrow! http:// ow.ly/ru4Q50vnYMh  #gapol Kemp unveils 'laborious' plan to dismantle Common Core standards ajc.com", "2019-08-05T15:45:17.000Z": "\"Gov. Brian Kemp has a better option. By pursuing \"waivers\" - flexibility in how Georgia administers Medicaid as well as the subsidies for care under the Affordable Care Act - he can make both programs work better and lower prices for Georgians.\" http:// ow.ly/zJa950vnY6A  #gapol Opinion: Gov. Kemp's right to pursue health care waiver ajc.com", "2019-08-05T13:10:12.000Z": "As we begin another school year, I want to wish our students, parents, educators, and staff the very best. The days ahead will be filled with incredible opportunities and challenges that build character. Work hard, stay focused, and keep choppin'! http:// ow.ly/ZMOe50vnVZ2  #gapol Opinion: Back to school, not the status quo ajc.com", "2019-08-05T12:49:32.000Z": "In keeping with promises made on the campaign trail, we are continuing to review academic standards in our state. We will do the heavy lifting now to ensure a better, brighter tomorrow. We will reject the status quo and put students first. http:// ow.ly/GvCP50vnXUX  #gapol Opinion: Back to school, not the status quo ajc.com", "2019-08-05T12:48:42.000Z": "We know that burdensome regulations & mandates make it difficult for teachers to actually teach...our students are tested too much, educators are overworked, parents need more input and choice...one-size fits all really doesn't fit anyone at all http:// ow.ly/CghZ50vnXST  #gapol Opinion: Back to school, not the status quo ajc.com", "2019-08-05T12:46:50.000Z": "I'm proud of what we accomplished in just a few months to champion our teachers, schools, & students. While honored to receive awards & accolades for these promises kept, I truly believe that there is more we can do in the months and years to come. http:// ow.ly/AWS650vnXN4  #gapol Opinion: Back to school, not the status quo ajc.com", "2019-08-05T12:46:02.000Z": "During the '18 session, the General Assembly offered grants to schools for security initiatives. This year, I doubled down on this priority by allocating $69M - $30,000 per school...through this allocation, we can prevent...a national tragedy. http:// ow.ly/cmkY50vnXtA  #gapol Opinion: Back to school, not the status quo ajc.com", "2019-08-05T12:43:17.000Z": "To help students battling anxiety, depression...we expanded the APEX program to...alleviate the burden on teachers, ensure safety in the classroom, and help students overcome the challenges they face on their path to academic success. http:// ow.ly/DVrz50vnXmq  #gapol Opinion: Back to school, not the status quo ajc.com", "2019-08-05T12:41:39.000Z": "To help incentivize the best and brightest to remain in the classroom, we championed - and passed - the largest pay raise for educators, counselors, and specialists in Georgia history. This $3,000 pay raise...is an investment in Georgia's future. http:// ow.ly/3mcj50vnXkb  #gapol Opinion: Back to school, not the status quo ajc.com", "2019-08-05T12:39:37.000Z": "There are plenty of changes underway in Georgia schools to improve teacher retention rates, address lingering mental health challenges, enhance educational outcomes, and keep our students safe from violence and fear -> http:// ow.ly/r0ed50vnXeT  #gapol Opinion: Back to school, not the status quo ajc.com", "2019-08-05T12:38:29.000Z": "Check out my OpEd: Back to school, not the status quo -> http:// ow.ly/VMKD50vnXdH  #gapol Opinion: Back to school, not the status quo ajc.com", "2019-08-03T21:33:07.000Z": "The Kemp Family is praying for Texas in the aftermath of the #ElPasoShooting . Our hearts go out to the victims and their loved ones. We are deeply grateful for law enforcement, first responders, and citizens lending critical aid in this time of need. El Paso Walmart shooting: Suspect's mother asked police about weapons, lawyers say President Donald Trump is visiting Texas on Wednesday, days after a gunman opened fire inside a crowded Walmart in El Paso, Texas, Saturday morning, killing 22 people and injuring dozens more. wsbtv.com", "2019-08-03T14:47:54.000Z": "Always enjoyed watching @TonyGonzalez88 on the football field and agree that he's one of the best tight ends of all time. I join @AtlantaFalcons fans everywhere in celebrating his induction into the @ProFootballHOF ! Well done, Tony! Gonzalez revolutionized the tight end position on his way to the Hall of Fame ajc.com", "2019-08-03T14:41:25.000Z": "Today, @champbailey 's incredible - and inspiring - career in football will be honored with his well deserved induction into the @ProFootballHOF . Congratulations, Champ! #DGD  #gapol Long way from Folkston to Canton, Ohio for Champ Bailey ajc.com", "2019-08-03T02:00:22.000Z": "ICYMI: Schools upgrade security in different ways with $30,000 state grants -> http:// ow.ly/4WNq50vlVgZ  #gapol Back to School: Security upgrades lessen fears in metro Atlanta Local school districts upgrade security measures with $30,000 state grants ajc.com", "2019-08-02T23:50:06.000Z": "ICYMI: Italian manufacturer to open first U.S. facility in Buford -> http:// ow.ly/DFPh50vlVrZ  #gapol Italian manufacturer to open first U.S. facility in Buford Gov. Brian Kemp announced Thursday, Aug. 1, that Rivacold, a manufacturer of refrigeration systems, will create 140 jobs and invest $5 million in a new facility in Buford. The jobs will include... gainesvilletimes.com", "2019-08-02T22:10:05.000Z": "Great to see @SenatorTimScott this morning at The @Resurgent Gathering in Atlanta.  Appreciate his efforts to advance policies that grow jobs and economic opportunity in every corner of our country! #gapol", "2019-08-02T21:01:32.000Z": "We are honored to welcome Rivacold to the Peach State with the opening of their first U.S. facility in Buford -> http:// ow.ly/n7Ew50vlVzt  #gapol Italian manufacturer to open first U.S. facility in Buford Gov. Brian Kemp announced Thursday, Aug. 1, that Rivacold, a manufacturer of refrigeration systems, will create 140 jobs and invest $5 million in a new facility in Buford. The jobs will include... gainesvilletimes.com", "2019-08-02T20:56:44.000Z": "The Amended 2019 Budget invests $69 million in security upgrades at all 2,294 schools in our state. By providing one-time, $30,000 grants, local leaders can determine the most effective way to keep our students, teachers, and staff safe. http:// ow.ly/Dtdp50vlVl6  #gapol Back to School: Security upgrades lessen fears in metro Atlanta Local school districts upgrade security measures with $30,000 state grants ajc.com", "2019-08-01T16:15:21.000Z": "The @GAFirstLady 's first trip to Nu-Way Weiners. Needless to say, we had a great lunch! #gapol", "2019-08-01T13:05:15.000Z": "ICYMI: Porsche Digital picks Georgia for 2nd U.S. headquarters -> http:// ow.ly/EaeD50vjiLg  #gapol", "2019-08-01T10:30:04.000Z": "BREAKING: Manhunt underway after officer shot, woman killed in DeKalb County Search for suspect continues after woman killed, DeKalb officer shot ajc.com", "2019-07-31T16:10:14.000Z": "Great report that highlights our state's world class workforce. It's no surprise that innovative companies from around the globe have Georgia on their mind. http:// ow.ly/mSrV50viwhZ  #gapol Atlanta among top 10 cities in North America for tech talent, CBRE report says Since 2013, Atlanta's tech talent pool has grown at the seventh fastest pace of the 50 largest markets across the United States and Canada, according to CBRE's 2019 Scoring Tech Talent Report. ajc.com", "2019-07-31T11:30:22.000Z": "Really sad to read Megan Forde's story but encouraged to see the community come together to lend a helping hand. Hope you will join us in praying for her family during this difficult time. http:// ow.ly/uEXU50vicya  #gapol 'Everything is gone': Family of fallen soldier left without home after fire Megan Forde and her three children spent Monday morning running errands. When they came back, their Kennesaw home was on fire. wsbtv.com", "2019-07-30T15:55:00.000Z": "\"Our ports are firing on all cylinders,\" Gov. @BrianKempGA said. \"This success is a testament to the men and women who work throughout our entire supply chain and make a difference for Georgia...every day. Georgia's Savannah port sets shipping record amid global trade tension Georgia's Savannah port posted another record fiscal year for container traffic for the 12 months ended in June. ajc.com", "2019-07-29T18:50:09.000Z": "This year, we funded school safety initiatives, doubled resources for mental health services, and gave educators a well-deserved pay raise. Now, it's time to dismantle Common Core, reduce high stakes testing, trust parents, and put students first. http:// ow.ly/dhHh50vf3cx  #gapol Georgia state leaders make moves to change education standards Georgia parents who had to re-learn how to do math to help their kids under Common Core standards may have to learn a new system. This week, Georgia education leaders started the process of repealing... wtoc.com", "2019-07-29T15:45:15.000Z": "Congratulations to Leslie Irby on making history. Such an inspirational story! #MotivationMonday  #gapol This Georgian is first black woman with a disability to receive pilots license One Georgian recently made history as the first black woman with a disability to receive a pilots license. ajc.com", "2019-07-29T13:00:22.000Z": "Remembering the life and honoring the legacy of Ed Spivia - \"the catalyst of the film and television industry in Georgia.\" http:// ow.ly/Tplf50veZhN  #gapol Remembering Ed Spivia, Georgia's ambassador to thriving film industry ajc.com", "2019-07-28T23:40:30.000Z": "Sending our very best to @Braves right fielder, Nick Markakis, who was recently injured. Best wishes and lots of prayers for a speedy recovery. #ChopOn Braves' Nick Markakis likely out 6-8 weeks because of fractured wrist ajc.com", "2019-07-28T14:10:00.000Z": ". @ajgreen_18 is a great football player and #dgd . Praying that he has a quick and full recovery! Former Bulldog A.J. Green leaves NFL practice on cart after injury ajc.com", "2019-07-27T15:38:11.000Z": "The Kemp Family made a pit stop at the peanut stand in Bainbridge. Lots of hardworking Georgians around town today! #gapol", "2019-07-26T13:29:25.000Z": "Big congratulations to @OliviaSmoliga for earning Gold - and setting a new American record - at the 2019 World Championships! We are incredibly proud of Olivia, @UGACoachBauerle , and the team! #gapol Olivia Smoliga Sets American Record, Wins Women's 50 Back Gold Olivia Smoliga set a new American Record en route to winning gold in the final of the women's 50 back, clocking a time of 27.33. swimswam.com", "2019-07-26T12:01:30.000Z": ". @GAFirstLady and her Dad, Rep. Bob Argo, with Governor George Busbee. #FBF  #gapol", "2019-07-26T01:43:05.000Z": "Great night in Jackson (Butts County) with @sendavidperdue . Keep choppin, Senator! #gapol", "2019-07-26T00:49:07.000Z": "I was honored to spend the morning with law enforcement leaders and prosecutors from every corner of our state. Together, we will dismantle gangs and keep Georgia families safe from harm. Georgia authorities make gang crackdowns a top priority Georgia law enforcement officers and prosecutors said they see gangs as the state's top threat to public safety. ajc.com", "2019-07-22T13:15:21.000Z": "From peanut farmer in South Georgia to engineer at @NASA , Lewis Wooten's journey proves that dreams really do come true. Check out his story -> http:// ow.ly/CW2c50v73jM  #gapol  #apollo50th 'Dream Come True': NASA Is One Giant Leap For A Georgia Peanut Farmer Growing up in rural Georgia, Lewis Wooten felt light years away from the long, illustrious career he has built at NASA. boston.cbslocal.com", "2019-07-20T22:00:35.000Z": "ICYMI: We are leading efforts to lower healthcare costs, reduce premiums, and enhance access to quality care throughout our state. Our goal is simple: To put patients first! https:// wabe.org/georgias-medic aid-waiver-application-process-reaches-next-step/   #gapol Georgia's Medicaid Waiver Application Process Reaches Next Step | 90.1 FM WABE An effort to expand Georgia's Medicaid rolls is moving into its next phase. An advisory board gathered Thursday in Atlanta to hear an update. The consulting group Deloitte, which got a nearly $2... wabe.org", "2019-07-20T18:50:06.000Z": "Proud of U.S. Attorney @BJPakGA and his team for taking sex traffickers off the street and putting them behind bars where they belong. http:// ow.ly/Wz4950v6Css  #gapol Georgia man pleads guilty to sex trafficking of minors ajc.com", "2019-07-20T16:15:10.000Z": "Great to talk with @MarthaZoller about Georgia's strong economy and laws we passed during the session that will ensure a bright future for our families -> http:// ow.ly/LRGB50v6CkT  #gapol Kemp says Georgia's economy 'on a roll' Gov. Brian Kemp said Friday the state's economy is continuing to grow and should be able to handle a downturn, should one occur. accesswdun.com", "2019-07-20T14:40:06.000Z": "Thanks to the Gwinnett Metro Task Force, Mexican drug cartels have one less \"stash house\" in Georgia. We appreciate these hardworking law enforcement officers for risking their lives for our safety. http:// ow.ly/gX7l50v6Cz0  #gapol Gwinnett man convicted of trafficking drugs for Mexican cartel A Lawrenceville man has been convicted of seven criminal charges related to trafficking drugs for a Mexican cartel, the Gwinnett County District Attorney's Office said. ajc.com", "2019-07-20T13:55:49.000Z": "New @NBCNews poll supports our priorities under the Gold Dome. We are committed to policies that create economic opportunity. We back LEOs & efforts that undermine organized crime. We will continue to lead on healthcare reform that puts patients first. NBC News SurveyMonkey Georgia Poll 7 19 Source document contributed to DocumentCloud by NOS Support (NBC News). documentcloud.org", "2019-07-19T19:36:09.000Z": "Great to see Nicholas Jackson and his family at CJ's Bar-B-Q in Woodville. Highly recommend stopping by if you live in the region or just passing through! #gapol", "2019-07-18T22:00:23.000Z": "\"Folks, we have never ever had anybody who spoke up for public education the way that Brian Kemp does.\" Read more -> http:// ow.ly/CfBI50v4RK5  #gapol Gov. Kemp keeps his promises on education When then-candidate Brian Kemp was running for governor, he pushed educational priorities. In less than a year in office, Kemp has held up his promises when it comes to education thebrunswicknews.com", "2019-07-18T18:55:10.000Z": "\"When then-candidate Brian Kemp was running for governor, he pushed educational priorities. In less than a year in office, Kemp has held up his promises when it comes to education initiatives.\" http:// ow.ly/cHcu50v4RGw  #gapol Gov. Kemp keeps his promises on education When then-candidate Brian Kemp was running for governor, he pushed educational priorities. In less than a year in office, Kemp has held up his promises when it comes to education thebrunswicknews.com", "2019-07-18T15:50:12.000Z": "Thanks to federal, state, and local law enforcement/prosecutors, 7 gang members were indicted this week in Emanuel County. Proud of these men and women for working around the clock to keep our families, communities safe. http:// ow.ly/sJhg50v4PHU  @GBI_GA  #gapol GBI: 7 Blood gang members indicted in Emanuel County Authorities say seven members of a \"Bloods-affiliated racketeering enterprise\" have been indicted on multiple charges, including murder, drugs and gang-related activity. wsav.com", "2019-07-18T14:05:11.000Z": "By allowing companies to resolve their differences quickly and judiciously through the business court, businesses can get back to doing what they do best: creating jobs and opportunity for hardworking Georgians. http:// ow.ly/fp6R50v4S38  #gapol How the Governor Staged a Dramatic Reveal of His Pick for Business Court Judge | Daily Report With over 17 years of private-sector experience, Walt Davis will bring invaluable business law expertise to this new statewide court,\" Gov. Brian Kemp said. \"I am truly honored to nominate him to... law.com", "2019-07-18T13:45:20.000Z": "Proud of Jay Bailey, the Russell Family, and everyone at @rcie_atlanta for their efforts to back African-American entrepreneurs with co-working and meeting space, resources, and funding. Through these investments and initiatives, they are building a stronger Georgia! #gapol", "2019-07-18T02:05:14.000Z": "Hope you will join the Kemp Family in praying for U.S. Senator @JohnnyIsakson . We know he will be back on his feet soon! #gapol Quote Tweet Greg Bluestein @bluestein Johnny Isakson was hospitalized after fracturing four ribs in a fall. His spokeswoman says the Republican senator is \"in pain but resting and doing well.\" #gapol  https:// ajc.com/blog/politics/ johnny-isakson-hospitalized-after-fall/zpEdmfS3BFPsQuWJWz7k8K/ ", "2019-07-17T18:15:06.000Z": "We are celebrating National Hotdog Day with lunch at The Varsity (Atlanta). How about you? #GAGOP  #HotDogDay", "2019-07-17T00:24:07.000Z": "Incredibly proud of the volunteers, lifeguards, & hardworking Georgians of @CoastalGADNR for working so hard to save the whales on East Beach at #SSI . #gapol Video shows 47 pilot whales beached on St. Simons Island A Facebook Live video shows beachgoers trying to help the whales back into the water. firstcoastnews.com", "2019-07-16T15:55:10.000Z": "Proud of @cboling60 for representing the #DawgNation well during his eight seasons in the @NFL . All the best in retirement! #DGD Former UGA standout retires from NFL due to 'medical reasons' Clint Boling, one of UGA's rags-to-riches stories in football, announced his retirement from the NFL on Monday. The former UGA offensive lineman played his entire eight-year NFL career with the... dawgnation.com", "2019-07-16T02:28:19.000Z": "Strong crowd this evening at the 30th Annual Corn Boilin' in Cobb County! #gapol", "2019-07-15T16:05:18.000Z": "This year, we funded historic pay raises for educators, invested in school safety, and advanced legislation to enhance educational outcomes in every corner of our state. Above all, we put students - not the status quo - first! http:// ow.ly/ek1S50v0PEE  #gapol Kemp emphasizes education priorities during conference address Gov. Brian Kemp received a warm welcome Sunday at the kick-off event of the 45th annual Georgia Association of Educational Leaders summer conference. thebrunswicknews.com", "2019-07-15T13:10:14.000Z": "Georgia is excited to welcome Stitch Fix to Douglas County. Without question, the company's investment in the Peach State is a testament to our business-friendly climate, access to top talent and world-class logistics infrastructure. http:// ow.ly/bhbA50v0lMx  #gapol Stitch Fix to bring 900 jobs to metro Atlanta area ATLANTA - Gov. Brian Kemp announced this week that Stitch Fix, the leading online personal styling service, will open a new distribution center in Lithia Springs, creating more than 900 albanyherald.com", "2019-07-13T18:28:21.000Z": "Celebrating #NationalFrenchFryDay at Frosty's on St. Simons.   #gapol", "2019-07-13T16:01:14.000Z": "Big thanks to Austin at The Barber Shop in Brunswick for the fresh haircut. Lots of hardworking Georgians in the building! #gapol", "2019-07-12T11:47:59.000Z": "Honored to participate in The Home Depot's \"Board Cutting Ceremony\" at their new technology center in Pennant Park. This expansion will generate thousands of new jobs and economic opportunities for hardworking Georgians! #gapol", "2019-07-11T21:55:09.000Z": "Our top-notch logistics network, world-class business environment, and highly skilled work force make Georgia a great choice for Preci-Dip. Excited that this Swiss manufacturer is bringing 100 jobs, millions in investment to Bryan County http:// ow.ly/oHVl50uYH80  #gapol Swiss company to invest $13.6 million in Georgia ATLANTA - Gov. Brian Kemp announced Wednesday that Preci-Dip, a Swiss manufacturer of electronic connector pins, will open its first U.S. production facility in Bryan County. The company will invest albanyherald.com", "2019-07-11T16:40:07.000Z": "ICYMI: Gov. Kemp officially swears in Jeffery Monroe to the Macon Judicial Circuit -> http:// ow.ly/fwqj50uYHl4  #gapol Gov. Kemp officially swears in Jeffery Monroe to the Macon Judicial Circuit ATLANTA - Jeffery Monroe was officially sworn in by Georgia Governor Brian Kemp to the Superior Court of the Macon Judicial Circuit in a ceremony at the statehouse July 10. Macon-Bibb County says... wgxa.tv", "2019-07-11T02:08:35.000Z": "Today, we formally announced that Amazon is creating 1,000 jobs in Georgia. This new facility will generate millions and create incredible opportunities for local families and businesses. http:// ow.ly/NoEv50uYaFO  #gapol", "2019-07-10T19:17:22.000Z": ". @GovKemp signed an executive order to lower the flags at the state Capitol to half-staff tomorrow in memory of Nicolas Dixon, the Hall County deputy who was shot and killed this week. #gapol", "2019-07-10T16:05:17.000Z": "Through innovation and hard work, we can tackle the doctor shortage, reduce healthcare costs and insurance premiums, and expand access to quality care in every part of our state. Together, we will put patients - not the status quo - first. http:// ow.ly/JvoC50uXuz9  #gapol Gov. Kemp in Augusta, talks healthcare solutions Georgia Governor Brian Kemp was in Augusta today getting a tour at Augusta University. He talked today about the roles of the cyber and cancer centers here in Augusta. wrdw.com", "2019-07-10T13:10:14.000Z": "By funding an historic pay raise for Georgia teachers, counselors, and specialists, we can boost retention rates for educators and educational outcomes for our students -> http:// ow.ly/Z7Ju50uXoSr  #gapol Are Columbus area teachers, staff getting raises passed by the Georgia Legislature? It's up to each school district to determine how to use the funds, so which Columbus area school employees are receiving raises, how much and when? ledger-enquirer.com", "2019-07-09T21:14:40.000Z": "As governor, I am focused on bringing projects of regional significance to every part of our state so all Georgians - no matter their zip code - have the opportunity to prosper. http:// ow.ly/RHWN50uWXf7  #gapol GA Gov. Kemp visits CSRA, Georgia Cancer Center (WJBF) - Georgia Governor Brian Kemp is in town. One stop he's made is to the Georgia Cancer Center Research Building. Kemp was also in Thomson, a town hard hit by job losses when a pla wjbf.com", "2019-07-08T10:23:12.000Z": "Terrible news out of Hall County today. Our prayers are with the deputy's loved ones as they mourn and local law enforcement as they work to catch the suspects. http:// ow.ly/i2NK50uVmb1  #gapol Family recalls fallen young deputy: 'He loved what he did' Slain deputy Nicolas Dixon has been with the Hall County Sheriff's office for three years and was a father of two ajc.com", "2019-07-08T09:27:37.000Z": "Saddened by the passing of Michael Chien. He was an inspiring leader, passionate Republican, and community advocate.Please keep Michael's family and friends in your thoughts and prayers during this time of mourning. #gapol", "2019-07-05T13:55:00.000Z": "Incredible display of patriotism and pride at MidWay Straw Company in Wrightsville. What a great way to honor our veterans, fallen heroes, and active duty military! #gapol  http:// ow.ly/cjIw50uU7iO  #gapol 'It comes from the heart:' Johnson County farmers paint barn-sized American flag William Sumner said they did it to show their support for America's troops", "2019-07-04T17:56:07.000Z": "Happy Independence Day, y'all! #gapol", "2019-07-04T14:07:55.000Z": "Great to see Commissioner Tripp Strickland and Ag Commissioner Gary Black in Colbert! #gapol", "2019-07-04T13:45:00.000Z": "Kicking off the day at the 50th Colbert Georgia Fourth of July Independence Day Parade! #gapol", "2019-07-04T09:55:09.000Z": "Today, we celebrate America's independence and honor those who made incredible sacrifices to protect and preserve our freedom. We thank our veterans for their courage and patriotism. We remember those who are in harm's way and pray for their safe and swift return. #gapol", "2019-07-03T17:15:05.000Z": "Hot Thomas is known for their Bar-B-Que but they have good hotdogs too!", "2019-07-02T21:55:06.000Z": "Proud of Joyette Holmes and know she will serve the community well as Cobb's new District Attorney -> http:// ow.ly/xDve50uS6ki  #gapol Joyette Holmes Appointed First African American and Woman Chief Prosecutor in Cobb County History was made in Cobb County as Joyette Holmes become the first African American, and also the first woman, to be the county's new Chief Prosecutor and law enforcement official. waok.radio.com", "2019-07-02T01:55:03.000Z": "What an honor to welcome members of the 48th Infantry Brigade Combat Team back to Georgia this morning after serving our country overseas. We are so proud of these brave men and women, and remain forever grateful for their service. #gapol Gov. Kemp welcomes home service members A special ceremony took place early Monday morning for service members returning home to Georgia. fox5atlanta.com", "2019-07-01T23:30:12.000Z": "ICYMI: Acting Insurance Commissioner Takes Oath, Makes History -> http:// ow.ly/xNlp50uRdKM  #gapol Acting Insurance Commissioner Takes Oath, Makes History | 90.1 FM WABE Georgia officially has a new acting insurance commissioner. John King has become the second in that role to take the oath of office this year. King replaces Jim Beck, who just five months into his... wabe.org", "2019-07-01T22:46:58.000Z": "As Georgia's Insurance Commissioner, General John King will champion our families and businesses. He will always put hardworking Georgians first. http:// ow.ly/ifGN50uRdpH  #gapol King new insurance chief, Georgia's first Hispanic statewide official Longtime Doraville Police Chief John King was sworn in as Georgia's acting insurance commissioner Monday. ajc.com", "2019-07-01T19:15:14.000Z": "Through criminal justice reform, we are reducing recidivism rates, strengthening families & communities, and helping Georgians develop skills that meet workforce needs. Click the link to learn more -> http:// ow.ly/6WC750uQGRe  #gapol Overcoming obstacles, Gwinnett Department of Corrections graduates second class of welders As a preteen, Gage Bryant should have been spending time with kids his age; instead, he gravitated to a group much older than he was and fell in with a gwinnettdailypost.com", "2019-07-01T16:15:22.000Z": "This year, we championed historic pay raises for Georgia teachers, counselors, & school specialists. Thanks to these hardworking Georgians - who inspire, mentor, lead, & educate our students - our state's future is bright! http:// ow.ly/wzb450uQGKe  #gapol Georgia among 15 states to give teachers raises ajc.com", "2019-06-30T00:42:06.000Z": "Cooking up a couple of #georgiagrown burgers for @GAFirstLady and me. Great to be back home! #gapol", "2019-06-29T15:50:06.000Z": "Thanks to the Cherokee Multi-Agency Narcotics Squad for their hard work and dedication to public safety. This was the largest one-time heroin seizure in county history and will help keep families/the community safe -> http:// ow.ly/f9mp50uPM1A  #gapol Heroin processing facility allegedly discovered at Woodstock home ajc.com", "2019-06-28T16:14:11.000Z": "LEOs across the state are fighting the street gang epidemic in the communities they serve. Under the leadership of GBI Director Vic Reynolds & the Gang Task Force, we will dismantle these criminal networks and keep Georgia families safe. http:// ow.ly/HkUL50uP9NH  #gapol GBI investigating more gangs, calling it an epidemic in some areas The Georgia Bureau of Investigation (GBI) said criminal street gangs are becoming an epidemic in areas across the state. walb.com", "2019-06-27T02:23:10.000Z": "It's time to vote, @Braves fans! Join me in casting a ballot for @FreddieFreeman5  @ozzie  @joshdonaldson  @BringerOfRain20  @LieutenantDans7  @ronaldacunajr24  @NickMarkakis and Brian McCann. Best of luck and #chopon Quote Tweet Atlanta Braves @Braves THE POLLS ARE OPEN! \n\nUse BOTH of these links to #VoteBraves !  http:// Braves.com/vote   https:// google.com/search?q=mlb+v ote ", "2019-06-26T13:44:21.000Z": ". @GovKemp was honored to spend the day @Kia_Motors , touring its R&D facility & corporate HQ in Korea. In February, Kia started production of the Telluride SUV for assembly in West Point, GA. Kia's economic footprint represents a $3.7 billion investment in the Peach State. #gapol", "2019-06-25T16:05:15.000Z": "\"This is just one sign that in Georgia, solar is booming.\" http:// ow.ly/UXTO50uMlyy  #gapol How Georgia Became A Surprising Bright Spot In The U.S. Solar Industry Solar is booming in Georgia, and it's not because of state mandates supporting renewable energy or concerns about climate change. Instead, powerful market forces are driving the growth. npr.org", "2019-06-25T10:12:52.000Z": "Day 2: @GovKemp is choppin' away in South Korea. He met with U.S. Ambassador Harry Harris, industry prospects, and the Korean Importers Association (KOIMA). #gapol", "2019-06-24T19:10:11.000Z": "ICYMI: GE Appliances grows in Georgia with $130M investment, 300 new jobs -> http:// ow.ly/cg3j50uLxSu  #gapol GE Appliances grows in Georgia with $130M investment, 300 new jobs ATLANTA, Ga. (CBS46) - GE Appliances is expanding its operations in Georgia through a $130 million investment and job growth initiative. cbs46.com", "2019-06-24T16:10:12.000Z": "We are in South Korea this week to recruit businesses to the Peach State. By strengthening current relationships and making new ones, we can grow jobs, expand economic opportunity, and ensure prosperity in Georgia! http:// ow.ly/zMkP50uLxsT  #gapol Brian Kemp makes first international trip to South Korea to lure more business to Georgia His visit was covered in a front-page spread in an English-language newspaper.", "2019-06-23T23:08:52.000Z": ". @GovKemp was truly honored to see this cover in the Korea JoongAng Daily today. In the last 12 months, South Korean companies have invested $2B into Georgia's economy. Kemp looks forward to a week of productive economic development meetings with Korean leaders. #gapol", "2019-06-24T11:02:59.000Z": ". @GovKemp toured Sangsin Brake in Daegu, Korea to meet company leaders and see operations firsthand. In March, Sangsin Technology America announced plans to build its U.S. headquarters in Henry Co. with a $20 million investment and 200 new jobs for hardworking Georgians. #gapol", "2019-06-23T23:47:56.000Z": "It might be Sunday evening in Georgia, but it's Monday morning in Korea. Governor Kemp is headed to Sangsin Brake to meet with executives, discuss their plans to open a $20 million plant in Henry Co. with 200 jobs, and thank them for having Georgia on their minds. #gapol", "2019-06-24T13:10:13.000Z": "Georgia's own, @Delta , showing some southern hospitality to students in need -> http:// ow.ly/5IWK50uKWwn  #gapol  #keepclimbing Delta Air Lines helps group of stranded fifth graders after another airline canceled flight Delta Air Lines recently lent a helping hand to a group of fifth graders after a canceled flight left them stranded in Oklahoma. ajc.com", "2019-06-21T21:41:55.000Z": "Big thanks to Tommy the Barber for the fresh haircut before we travel to South Korea. Keep choppin'! #gapol", "2019-06-21T12:55:14.000Z": "Appreciate the collaboration between local, state, and federal law enforcement agencies. Together, they are keeping our families and communities safe from harm. http:// ow.ly/I9Jb50uJHaf  #gapol 2 from metro Atlanta among 11 arrested in multi-agency drug operation ajc.com", "2019-06-20T21:55:07.000Z": "Proud of @GBI_GA Director Reynolds and his efforts to crack down on gangs in Georgia. Together, we will stop & dismantle organized crime, and keep our families/communities safe! http:// ow.ly/CBQj50uJ3WJ  #gapol Months into new position, GBI director vows crackdown on gangs in Georgia Recently appointed Georgia Bureau of Investigation Director Vic Reynolds knew when he served as Cobb County's district attorney that Cobb had a gang problem. gwinnettdailypost.com", "2019-06-20T18:50:10.000Z": "With low taxes, business-friendly government, and a highly-skilled workforce, Georgia remains the best place for businesses to expand and prosper! http:// ow.ly/O8Ia50uJ3R1  #gapol E-commerce retailer Wayfair adding third support center in Georgia Online retailer Wayfair will invest more than $8 million in a customer-support facility in Athens, Ga., that will create 500 jobs, Gov. Brian Kemp announced Wednesday. bizjournals.com", "2019-06-20T12:45:11.000Z": "Really excited to see that McLendon Acres is one of the five farms picked to help grow cotton for @Wrangler 's Rooted Collection, which is a \"limited, premium line made from 100 percent sustainable, locally sourced cotton.\" http:// ow.ly/NvMu50uIKJf  #georgiagrown  #gapol Area farmer to provide cotton for Wrangler specialty jeans collection LEARY - That next pair of jeans may be blue on the outside, but they could be green - as in grown in an environmentally friendly fashion - on the albanyherald.com", "2019-06-19T18:50:09.000Z": "We appreciate @realDonaldTrump 's strong, steadfast support of Georgia. Together, we will Keep America Great! http:// ow.ly/idcJ50uHGTI  #gapol President Trump unveils 2020 slogan to replace 2016 rallying cry during campaign rally President Trump revealed the 2020 re-election campaign slogan to replace his Make America Great Again mantra from 2016. foxnews.com", "2019-06-19T16:05:20.000Z": "There is a gang outbreak in our state. Thankfully, we have state leaders, law enforcement officers, & prosecutors who refuse to accept the status quo. Together, we will undermine organized crime & ensure a safer, stronger future for GA families. http:// ow.ly/nlsP50uHByG  #gapol Atlanta News Videos | WSB-TV Watch Atlanta news videos from WSB-TV. The latest local news videos from the Atlanta Metro area. Sports, crime, and the latest entertainment. wsbtv.com", "2019-06-19T13:15:16.000Z": "Today, I toured EmployAbility in Savannah and learned more about what this awesome non-profit is doing to prepare adults with developmental disabilities for employment and integration into the community. Proud of their efforts. Keep choppin'! http:// ow.ly/J1Ct50uHBaC  #gapol Gov. Kemp tours Savannah nonprofit EmployAbility Gov. Brian Kemp toured EmployAbility in Savannah on Tuesday, a nonprofit organization that helps adults with developmental disabilities find work and engage with their community. The organization has... savannahnow.com", "2019-06-17T12:27:19.000Z": "#HappeningNow : Governor @BrianKempGA welcomes home the @48thIBCT from a 9-month deployment to Afghanistan in support of Operation Freedom's Sentinel and NATO Operation Resolute Support.", "2019-06-15T14:42:07.000Z": "What a great night celebrating Lucy's graduation with @ThomasRhett and a few friends! #gapol", "2019-06-14T21:50:05.000Z": "Proud of @DrewCharter for taking home the state championship and making history along the way. Best of luck to the Eagles as they compete on the national stage! Drew Charter golf team makes history Nineteen years ago, Drew Charter School became the educational foundation of the revitalization of Atlanta's East Lake Community. The school partnered with East Lake Country Club's First Tee program... fox5atlanta.com", "2019-06-14T16:33:22.000Z": "Proud of the hardworking Georgians at @ATLairport who keep passengers safe and on time at the world's busiest airport! #gapol", "2019-06-14T14:36:03.000Z": "Today, we celebrate the flag and remember all that it represents. We salute our veterans and pray for those in harm's way. #flagday  #gapol", "2019-06-14T01:45:04.000Z": "The Peach State's AAA Bond Rating emphasizes the strength of our economy and shows companies that we are a well-managed, reliable place to invest. http:// ow.ly/wCrX50uDzFJ  #gapol Georgia maintains highest bond ratings ATLANTA - Georgia Gov. Brian Kemp announced Thursday that Georgia again secured the highest ratings of AAA with a stable outlook from the three main credit rating agencies: Fitch, Moody's, albanyherald.com", "2019-06-13T22:15:09.000Z": "General King will restore faith in the Department of Insurance & will always do the right thing - even when no one is looking. I know he will continue to be a bold leader and champion for the people. http:// ow.ly/UoUZ50uDkiS  #gapol Gov. Kemp appoints first Hispanic insurance commissioner in Georgia history John King is the current chief of the Doraville Police Department.", "2019-06-13T18:55:08.000Z": "Our state has received over $2 billion of investment from Korean companies in just the last 12 months. We are traveling to South Korea to make this partnership even stronger. http:// ow.ly/pAYm50uDkbo  #gapol Georgia Gov. Brian Kemp sets economic development trip to South Korea ATLANTA - Georgia Gov. Brian Kemp announced plans Wednesday for an economic development trip to South Korea, his first overseas trip as governor. Kemp said the trip will include four days of business... savannahnow.com", "2019-06-13T17:15:13.000Z": "Judge Holmes is a servant leader in her community, and I am very excited to select her as Cobb's new District Attorney. http:// ow.ly/wR6d50uDkoX  #gapol Gov. Kemp names first woman, African American as Cobb district attorney Judge Joyette Holmes replaces Vic Reynolds who was recently named the director of the Georgia Bureau of Investigation.", "2019-06-13T16:10:12.000Z": "Big thanks to @ga_dps and @GBI_GA for working around the clock to keep Georgia families safe. We appreciate your service and dedication to public safety. http:// ow.ly/gjx950uDjI6  #gapol 3 arrested after $200K worth of marijuana seized during Gwinnett traffic stop ajc.com", "2019-06-13T16:07:49.000Z": "General King will restore trust in the Department of Insurance and put Georgia families first! #gapol Quote Tweet GA National Guard @GeorgiaGuard Congratulations Major General John King on being appointed by Governor @BrianKempGA as the first Hispanic American Insurance Commissioner in Georgia's history!", "2019-06-12T22:05:07.000Z": "Congratulations to Billy Payne for his well-deserved induction into the @GolfHallofFame ! #DGD  #gapol Former UGA football player Billy Payne inducted into World Golf Hall of Fame Former UGA football player Billy Payne was inducted into the World Golf Hall of Fame on Monday. For many Bulldogs fans, the 71-year-old Payne is best known for UGA's indoor football facility, which... dawgnation.com", "2019-06-12T18:50:08.000Z": "We are going to overhaul our healthcare system to reduce cost, improve access and enhance quality. We are going to address Georgia's problems with innovative, Georgia solutions to ensure a brighter, healthier future for our state. http:// ow.ly/nxH450uCsKo  #gapol Kemp speaks at Early Bird Breakfast, visits Charlie Joseph's - LaGrange Daily News Gov. Brian Kemp spoke about the progress the state has seen during his short time in office Tuesday morning in LaGrange. lagrangenews.com", "2019-06-11T21:00:27.000Z": "After talking economic development with the Lagrange-Troup County Chamber of Commerce, I stopped by Charlie Joseph's to complete Georgia's \"Hotdog Trifecta.\" #gapol", "2019-06-11T18:12:06.000Z": "Have you registered for our next Pet Adoption Day at the Governor's Mansion? https:// bit.ly/2ww4hSp  #gapol", "2019-06-10T19:00:26.000Z": "Powerful moment when Arthur Blank chipped in another $15 million to fund a handful of great charities and initiatives backed by his friend/business partner Bernie Marcus - who was celebrating his 90th birthday. $117 million raised in total. Great night for Georgia! #gapol", "2019-06-09T02:00:17.000Z": "I'm proud of our delegation for their hard work in Washington. Now, we must hunker down and rebuild South Georgia! http:// ow.ly/KAyM50uzJyq  #gapol Ready for disaster relief: Kemp, Perdue, Scott, Bishop visit South Georgia DOERUN - Georgians are one step closer to receiving disaster aid funds but there is no clear timeline for when the money will flow. valdostadailytimes.com", "2019-06-08T22:40:02.000Z": "Proud of our @GBI_GA agents who work around the clock to ensure a safer, stronger Georgia! Keep choppin'! http:// ow.ly/dAAq50uzJvv  #gapol 3 arrested after 80 pounds of marijuana was found at Atlanta airport ajc.com", "2019-06-08T13:26:04.000Z": "My commitment to every Georgian now is to work with @SecretarySonny to ensure these much needed disaster dollars reach farm families as quickly and efficiently as possible. https:// on-ajc.com/2wSJ5GJ  #gapol", "2019-06-07T16:00:41.000Z": "Proud of our efforts to put students - not the status quo - first. Let's keep choppin'! http:// ow.ly/aE9L50uyR96  #gapol New governor's office and education leader have 'fantastic' relationship Georgia Gov. Brian Kemp seeks to 'streamline' his education agency's mission, eliminating duplication with the state schools leader ajc.com", "2019-06-07T13:15:15.000Z": "Kemp, Ga. senators applaud Trump for signing long-delayed $19.1B disaster aid bill -> http:// ow.ly/K06l50uyQRg  #gapol Kemp, Ga. senators applaud Trump for signing long-delayed $19.1B disaster aid bill Georgia leaders praised President Donald Trump on Thursday for signing a $19.1 billion disaster relief bill that will provide aid to those in the state affected by last October's Hurricane mdjonline.com", "2019-06-06T22:24:06.000Z": "It's now time to focus on rebuilding livelihoods devastated by Hurricane Michael and ensuring these hardworking Georgians have a bright, prosperous future. https:// bit.ly/2QRhm2d  #gapol Governor Kemp Applauds President Trump, Georgia Delegation on Disaster Relief For Immediate Release Thursday, June 6, 2019 Governor Kemp Applauds President Trump, Georgia Delegation on Disaster Relief Atlanta, GA - Today, Gov... madmimi.com", "2019-06-06T11:46:04.000Z": "75 years later, we remember the sacrifices made on D-Day by the thousands of troops who stormed the beaches of Normandy. Thanks to their heroism, we live in a safe, prosperous, and free country. #gapol  #dday", "2019-06-02T13:05:47.000Z": "Great to see so many friends and familiar faces down in Coastal Georgia! #gapol", "2019-06-01T18:50:05.000Z": "ICYMI: Kemp signs budget supporting major projects at Georgia Southern campuses -> http:// thegeorgeanne.com/news/article_0 3a52918-82f8-11e9-a82a-1f40bf8073d7.html   #gapol Kemp signs budget supporting major projects at Georgia Southern campuses Georgia Southern University was shown support in the state of Georgia's budget for the 2020 fiscal year, signed by Governor Brian P. Kemp earlier this May, with the funding of thegeorgeanne.com", "2019-06-01T15:55:05.000Z": "By appointing Markette Baker to the Coweta Judicial Circuit Superior Court, I am confident that she will seamlessly adapt to her new role and serve Georgians well for many years to come. http:// ow.ly/iwYJ50uuoGY  #gapol Baker makes history - named to superior court bench The Troup County Solicitor General was appointed to the Coweta Judicial Circuit superior court bench by Gov. Brian Kemp. times-herald.com", "2019-06-01T01:42:00.000Z": "Great to see one of the best cooks in Coastal Georgia tonight at Skippers! Great food. Incredible service. Good times! #gapol", "2019-05-31T23:39:08.000Z": "Our hearts go out to the victims and families affected by this senseless act of violence. Our thoughts and prayers are with the people of Virginia Beach. https:// on-ajc.com/2Xi4RPt", "2019-05-31T02:00:27.000Z": "Jobs, Jobs, Jobs: Plethora is bringing 250 jobs, millions to Cobb County. Learn more -> http:// ow.ly/wLNn50ut9qd  #gapol Manufacturer: 250 jobs coming to Cobb with new facility MARIETTA - A California-based manufacturer of prototypes and end-production parts expects to bring 250 jobs to Cobb County over the course of three years, starting with the opening of its mdjonline.com", "2019-05-30T22:00:16.000Z": "ICYMI: Gov. Kemp announces new Human Trafficking Prosecution Unit -> http:// ow.ly/POcP50ut9ls  #gapol Gov. Kemp announces new Human Trafficking Prosecution Unit Gov. Brian Kemp, joined by First Lady Marty Kemp, Attorney General Chris Carr, Speaker of the House David Ralston and members of the Georgia General Assembly, recently announced the creation mdjonline.com", "2019-05-30T20:00:17.000Z": "Georgia's unmatched pro-business environment has repeatedly served as a magnet for many global headquarters, but there is no greater endorsement than when one of our own chooses to grow and invest in the Peach State. http:// ow.ly/dAiH50ut9FS  #gapol UPDATED: Invesco to add 500 jobs in Atlanta with $70M expansion ajc.com", "2019-05-30T00:43:48.000Z": "So excited that the @Braves and @SunTrustPark will host the 2021 @MLB All-Star Game! #ChopOn", "2019-05-29T22:53:44.000Z": "Incredible news for the @Braves @SunTrustPark @CityofAtlanta and the great state of Georgia! #ChopOn Quote Tweet Atlanta Braves @Braves The Atlanta Braves & @SunTrustPark will host the 2021 @MLB All-Star Game! It is a tremendous honor to bring the Midsummer Classic back to Atlanta! #ChopOn", "2019-05-28T19:05:12.000Z": "When it comes to keeping students safe, local administrators, educators, and parents - not state government - know best -> http:// ow.ly/90G950uqUEq  #gapol State leaves school security decisions to locals, for now DOUGLASVILLE, Ga. - The door was locked and lights turned off. Students stopped their work and huddled together on the floor away from the door and windows. A robotic voice moultrieobserver.com", "2019-05-28T16:05:17.000Z": "We are a state that values life and seeks justice for the innocent. That's why we doubling down on efforts to end sex trafficking in Georgia -> http:// ow.ly/zDmn50uqUtk  #gapol 'Not just the low-hanging fruit': Advocates praise new unit for human trafficking prosecutions The six-person office announced Friday will work out of Attorney General Chris Carr's office.", "2019-05-27T12:07:39.000Z": "Today, we remember the great American heroes who paid the ultimate price for our freedom. We recall their stories, pray for their families, and vow to always live in a way that honors their service and sacrifice. #gapol", "2019-05-26T00:45:04.000Z": "ICYMI: Georgia leaders announce new unit dedicated to fight against human trafficking -> http:// ow.ly/T9UB50upDo8  #gapol Georgia leaders announce new unit dedicated to fight against human trafficking On Friday, Georgia leaders announced their plan to fight human trafficking. Georgia has the 8th highest human trafficking rate in the country according to the National Human Trafficking H wjbf.com", "2019-05-25T00:55:04.000Z": "Yesterday, the U.S. Senate finally put hardworking Americans ahead of partisan politics. It's time for the House to cut their vacation short, return to Washington next week, and do the same. http:// ow.ly/i7H250upeYz  #gapol GOP conservative temporarily blocks $19B disaster bill that would help Georgia farmers Texas Republican Chip Roy, a former aide to Texas firebrand Sen. Ted Cruz, objected to speeding the measure through a nearly empty chamber.", "2019-05-22T16:05:15.000Z": "ICYMI: I look forward to working with these highly qualified individuals from across our state as we continue to reform state government and put people ahead of politics. Together, we will ensure Georgia's best days are always ahead. http:// ow.ly/ifsw50umGrH  #gapol Kemp Appoints 15 To Boards Gov. Brian Kemp has appointed 15 people to five different state boards and commissions, including the Georgia Department of Economic Development Board... gpb.org", "2019-05-21T12:50:08.000Z": "Strong, sustained growth at the Savannah Port, which supports thousands of jobs in every part of our state. Keep up the good work, @GaPorts ! http:// ow.ly/rVEm50ukWeK  #gapol Georgia ports post April record, appoint new chairman The Georgia Ports Authority on Monday said its Savannah terminal reported its busiest April on record. ajc.com", "2019-05-20T16:10:13.000Z": "ICYMI: Hitachi Automotive Systems Americas Inc. is expanding operations in Monroe. 100 more jobs and $100+ million in investment. http:// ow.ly/GW1050ujKyb  #gapol Hitachi to invest up to $330 million in Monroe ATLANTA - Gov. Brian Kemp announced last week that Hitachi Automotive Systems Americas Inc., a Tier 1 supplier of world-class products to the global automotive market, is planning to create albanyherald.com", "2019-05-20T14:44:03.000Z": "Honored to join @BrianKempGA , @GAFirstLady & our courageous military veterans for a Memorial Day ceremony under the Gold Dome. Let us always appreciate, celebrate & remember the brave sacrifices of our fallen soldiers and their families. God bless our troops.", "2019-05-19T21:27:51.000Z": "HUGE congratulations to my daughter, Lucy, who graduated from High School today! We are so proud of her! #gapol"}