{"2018-11-07T03:58:20.000Z": "Nineteen months ago I announced I was running for governor. And In that time we've come together to fight for a state that has been broken. We made plans to rebuild Illinois, so that we may create a better future for Illinois families.", "2020-07-30T15:03:05.000Z": "Under @realDonaldTrump 's failed leadership, over 150,000 Americans have now died from Covid-19. Rather than working to keep Americans safe, he's focused on thwarting democracy with a power grab by proposing to move Election Day. Let's be clear: He has no authority to do this.", "2020-07-18T18:18:11.000Z": "Rep. John Lewis was an icon whose life and work should serve as an example to us all. He never stopped fighting for justice, equality, and a more perfect union. It's on all of us to carry on his legacy by working together to create a better America. John Lewis, lion of civil rights and Congress, dies at 80 ATLANTA (AP) - John Lewis, a lion of the civil rights movement whose bloody beating by Alabama state troopers in 1965 helped galvanize opposition to racial segregation, and who went on to a long... apnews.com", "2020-06-26T18:20:50.000Z": "5 years ago today, #LoveWon when the Supreme Court ruled in favor of marriage equality in the U.S. Despite how much progress we've made, we still have a lot of work ahead of us, and I'll always keep up my lifelong commitment to this fight.", "2020-06-18T16:09:54.000Z": "Great to see the Supreme Court ruled against the Trump administration's attempt to end DACA. This is a huge victory for all the Dreamers in America, but we still have work to do to protect and support our immigrant communities - something we'll always do in Illinois. #HomeIsHere Quote Tweet NBC News @NBCNews BREAKING: US Supreme Court rules Trump admin. cannot end DACA. https:// nbcnews.to/3hHh8Yw Show this thread", "2020-06-15T14:51:05.000Z": "Today's Supreme Court ruling is a victory for liberty, justice, and equality. No one should ever live in fear of discrimination over who they are or who they love. The work is far from over, but this is monumental progress in the fight for LGBTQ rights. Quote Tweet Human Rights Campaign @HRC BREAKING NEWS: In a landmark decision, #SCOTUS affirms that sexual orientation and gender identity are protected characteristics under Title VII of the Civil Rights Act.", "2020-05-25T14:14:08.000Z": "Today and every day, let's pause to remember and honor all the brave Americans who made the ultimate sacrifice to defend our country and our freedom. #MemorialDay", "2020-05-16T17:18:14.000Z": "We all have to work together to limit the spread of COVID-19 and keep our families, communities, and state safe. Do your part by going #AllInIllinois and committing to stay home this weekend. All In Illinois In response to the COVID-19 outbreak, Illinois pledged to be \"all in\", practicing social distancing and doing what we can to lower the spread of Corona Virus. enjoyillinois.com", "2020-05-15T20:17:52.000Z": "COVID-19 has left many Illinoisans without employment, and the Get Hired Illinois program is seeking to fix that as we work to get our economy back on its feet. Whether you're looking for a job or to hire for an open position, visit the jobs portal today: https:// www2.illinois.gov/gethired/pages /default.aspx ", "2020-05-11T02:36:33.000Z": "Finally been able to watch #TheLastDance . Agree with MJ - 45 is not a great number.", "2020-05-10T17:40:29.000Z": "As we celebrate #MothersDay , I'm more grateful than ever for MK and the love, strength, and support she shows our children and me every single day. Thank you to all of the hardworking moms and mother figures for all that you do!", "2020-05-08T15:05:01.000Z": "Our essential workers are doing everything they can to keep us safe during this pandemic. We can thank them by staying home and doing our part to limit the spread of COVID-19. Go #AllInIllinois today! All In Illinois In response to the COVID-19 outbreak, Illinois pledged to be \"all in\", practicing social distancing and doing what we can to lower the spread of Corona Virus. enjoyillinois.com", "2020-05-07T14:55:42.000Z": "We all want to see our state reopen, but we can't do that until science, data, and medical experts say it's safe to do so. That's why we've put together Restore Illinois, our public health plan for reopening the state in phases. Learn more about it here: Gov. J.B. Pritzker lays out five-phase, regional plan for reopening Illinois Gov. J.B. Pritzker on Tuesday laid out a regional, five-phase plan to reopen the state based on public health data and health care availability in different parts of the state. chicagotribune.com", "2020-05-06T22:41:37.000Z": "We can't limit the spread of COVID-19 unless we all do our part. Help keep your community safe by going #AllInIllinois ! All In Illinois In response to the COVID-19 outbreak, Illinois pledged to be \"all in\", practicing social distancing and doing what we can to lower the spread of Corona Virus. enjoyillinois.com", "2020-05-06T18:02:24.000Z": "Yesterday, we released Restore Illinois, our framework for how we'll reopen the state in phases based on science, data, and the best medical advice to keep our state safe. Read the full plan here: https:// coronavirus.illinois.gov/sfc/servlet.sh epherd/document/download/069t000000BadS0AAJ?operationContext=S1 ", "2020-04-30T23:10:32.000Z": "Here's something that'll brighten up your day  #AllInIllinois Quote Tweet Kristina Bittorf @kristinabittorf Here's a little bit of joy for your week. Our talented neighbors in the building next door giving our 2yo the best concert ever. #AllInIllinois Show this thread", "2020-04-30T20:44:10.000Z": "Former health care professionals like Kate have stepped up to help our state during this pandemic by returning to the health care workforce. Let's thank them by staying home and doing our part to limit the spread of COVID-19. \n\nGo #AllInIllinois today! Bakery Owner Returns To Old Job As Nurse To Fight Coronavirus: 'I Couldn't Sit Idly By' Edge of Sweetness owner Kate Merrill left Mount Sinai Hospital in 2018 to focus on her bakery. But she's now back in the North Lawndale hospital's surgical intensive care unit. blockclubchicago.org", "2020-04-14T23:35:05.000Z": "Illinoisans across our state have stepped up to help bend the curve and limit the spread of COVID-19 - but our work is far from over.\n\nContinuing to stay inside is the best thing you can do for your community and our state. Be a hero and go #AllInIllinois ! All In Illinois In response to the COVID-19 outbreak, Illinois pledged to be \"all in\", practicing social distancing and doing what we can to lower the spread of Corona Virus. enjoyillinois.com", "2020-04-03T17:15:11.000Z": "There's never been an easier way to be a hero and help protect your community. Stay inside and help stop the spread of COVID-19. #AllInIllinois All In Illinois In response to the COVID-19 outbreak, Illinois pledged to be \"all in\", practicing social distancing and doing what we can to lower the spread of Corona Virus. enjoyillinois.com", "2020-04-02T20:27:34.000Z": "Stay home, stay safe and #GoBears ! I promise I'm #AllInIllinois ! Check out more at http:// allin.illinois.gov", "2020-04-02T22:56:45.000Z": "For our neighbors, health care professionals, first responders, grocery store workers, and so many others, we all need to do our part to help stop the spread of COVID-19. Staying in keeps us all safe. #AllInIllinois All In Illinois In response to the COVID-19 outbreak, Illinois pledged to be \"all in\", practicing social distancing and doing what we can to lower the spread of Corona Virus. enjoyillinois.com", "2020-04-02T19:38:23.000Z": "I'm #AllInIllinois ! And so is Handsome Rumi. Pledging our commitment to the cause. Join me--stay home, stay safe, learn more at http:// allin.illinois.gov", "2020-04-02T20:21:51.000Z": "Things you can do while staying inside:\n\n Knit a sweater\n Catch up on your favorite shows\n Call your friends and family\n Read a book\n Help stop the spread of COVID-19\n\nDo your part to help protect your community and our state. #AllInIllinois All In Illinois In response to the COVID-19 outbreak, Illinois pledged to be \"all in\", practicing social distancing and doing what we can to lower the spread of Corona Virus. enjoyillinois.com", "2020-02-28T15:42:00.000Z": "Great to visit Quincy yesterday to discuss the benefits for our state from the Rebuild Illinois plan! Our capital projects will help revitalize communities throughout Illinois by fixing our broken infrastructure, supporting jobs, and growing our economy. Gov. JB Pritzker shares multi-billion dollar plan to rejuvenate Quincy Illinois Governor JB Pritzker made his first visit to Quincy in 2020 to share his vision to rebuild Illinois to revitalize the city. He stopped at the Oakley Lindsay Center to celebrate the Rebuild... khqa.com", "2020-02-25T21:31:40.000Z": "I'm proud of these hardworking students for achieving high scores on their AP tests and finishing high school with college credits under their belts! My administration is committed to making sure our kids are ready for college no matter what school district they come from. Quote Tweet Illinois State Board of Education @ISBEnews Illinois ranks No. 1 for largest year-over-year increase in the percentage of graduating students scoring a 3 or higher on an Advanced Placement Exam. Learn more at https:// isbe.net/Lists/News/New sDisplay.aspx?ID=1313  .", "2020-02-19T19:14:30.000Z": "Our investments in early childhood programs, education, public safety, environmental resources, and infrastructure will grow our economy and maintain our status as a world leader.", "2020-02-19T19:14:29.000Z": "Today, I proposed a budget that fulfills my campaign promise to rebuild Illinois from the mismanagement of the past and builds on our accomplishments from last year. Gov. J.B. Pritzker's $42 billion state budget promises added funding for schools, public safety -... Democratic Gov. J.B. Pritzker delivered a state budget address Wednesday acknowledging a \"challenging\" picture of Illinois' finances and offering improved funding for government services if voters... chicagotribune.com", "2020-02-10T16:00:37.000Z": "Congratulations to Chicago native @MatthewACherry on your Oscar win for Best Animated Short Film for Hair Love! #RepresentationMatters Quote Tweet Matthew A. Cherry @MatthewACherry", "2020-02-07T17:14:39.000Z": "It was great to be in Peoria yesterday meeting with the next generation of operating engineers! Thanks to Rebuild Illinois, we're increasing the number of skilled labor jobs in our state while making the infrastructure investments that are long overdue. https:// week.com/2020/02/06/in- mapleton-pritzker-sees-skilled-labor-boost-from-rebuild-illinois/ ", "2020-02-06T20:44:12.000Z": "I'm proud of these Illinoisans who are brave enough to say what the Republican Party won't: Donald Trump is guilty. The people of Illinois won't forget what Trump and his party have done when it comes time to vote them out of office this November. Quote Tweet Indivisible Illinois @IndivisibleIL Freezing wind chill didn't stop Springfield, IL residents from taking it to the streets.  We will remember, come November! #VoteThemOut Our Message \"Trump is Guilty.\" @IndivisibleTeam  #RejectTheCoverup  #twill  @SJRbreaking  @nprillinois", "2020-02-06T15:46:50.000Z": "Proud to announce the first round of matching funds in our effort to bring broadband internet to all of Illinois! High-speed internet is vital to growing our economy, providing educational and medical services, and revitalizing our communities. Gov. Pritzker announces $50 million first round of matching funds in statewide broadband expansion SPRINGFIELD, Ill. (WMBD) - Gov. J.B. Pritzker announced on Wednesday that the state is releasing $50 million in funding for the first round of matching grants of Connect Illinois, the new $420 mill centralillinoisproud.com", "2020-02-05T21:41:20.000Z": "Can't wait to congratulate the winner of IMA's Makers Madness poll in April! From amazing craft beers to bats used by MLB greats to the next generation of electric vans, Illinois has always led the way in making the best products this nation has to offer. https:// makersmadnessil.com", "2020-02-04T02:17:09.000Z": "If you're looking for a state whose people represent the diversity of America, look no further than Illinois. It's time for the most representative state in the country to be the first in the nation. The Perfect State Index: If Iowa, N.H. Are Too White To Go First, Then Who? Critics say Iowa and New Hampshire aren't demographically representative of the country. And, that's true. So, we've created the Perfect State Index to determine which state is a true microcosm. npr.org", "2020-01-17T22:35:53.000Z": "With plans to engage with all who make up the big tent of our party, increase voter education and diversity, and strengthen the Democratic Party's presence in McLean County, I know she'll make an excellent chairwoman.", "2020-01-17T22:35:52.000Z": "I'm proud to endorse @NRichardsIL for chair of the McLean County Democratic Party! Along with being a Navy veteran, Nikita is a fighter for social justice and voting rights and has a bright future in our party. Richards to run for McLean County Democratic Party chair Nikita Richards is running for chair of the McLean County Democratic Party. Richards, a United States Navy veteran, is the first candidate to announce publicly for the seat. pantagraph.com", "2019-11-11T16:24:49.000Z": "To all of the Veterans who have bravely served our country and fought to protect Americans and our freedom: Thank you. Today and every day in Illinois, we honor you, your families, and the sacrifices you've made for our country.", "2019-08-19T17:15:24.000Z": "Congratulations to @Kena1019 on being named the Chairwoman of the @CookCountyYD ! I'm proud of the big things you continue to achieve.", "2019-07-29T20:35:35.000Z": "Proud to see Illinois is heading in the right direction, with statewide job growth reaching a turning point this past year! Illinois' job engine suddenly kicks into high gear The state gained nearly 100,000 new non-farm jobs in the past year, according to new data. Now, will a population turnaround follow? chicagobusiness.com", "2019-07-25T18:01:49.000Z": "In Illinois, we're committed to creating a state where everyone can not only feel safe, but also thrive. Here are just a few things we've done in the past 6 months since I've taken office to protect immigrant families and create a #WelcomingIL :", "2019-07-24T00:14:25.000Z": "I'm proud of our state and the big things we were able to accomplish in my first 6 months in office. 6 Months In, Most Rookie Governors Are Thriving Following years of turmoil and gridlock in many states, newly elected governors are getting a lot done. governing.com", "2019-07-23T18:04:18.000Z": "With investments in child care and early childhood education, we're ensuring that Illinois' children and families have the tools they need to succeed.", "2019-07-23T01:20:00.000Z": "The recent post by the Kanakee Democratic County Chairman is wrong and lacks the civility our politics should demand.", "2019-07-22T18:21:05.000Z": "Unfortunately, it exists right here in Illinois, a state that prides itself on our diversity. I applaud the elected members of the Illinois GOP who joined Democrats in calling out this hateful language. But simply speaking out this one time isn't enough.", "2019-07-22T18:21:04.000Z": "Yesterday's post by the Illinois Republican County Chairs was a shameful display of the type of racism, bigotry, and xenophobia that ought to have no acceptance in our politics or our country. Yet people across our nation encounter it daily.", "2019-07-19T16:59:53.000Z": "We're working hard to help small businesses thrive all across Illinois.", "2019-07-18T21:29:19.000Z": "Every Illinois family deserves the chance to thrive - and by expanding child care assistance, we're well on our way to making that happen.", "2019-07-18T16:55:37.000Z": "This bipartisan capital plan is the largest infrastructure investment in Illinois history!", "2019-07-15T20:36:44.000Z": "I urge you all to call the @ILGOP , Republican candidates, and elected officials to tell them to speak out against racism.", "2019-07-15T20:33:36.000Z": "If you refuse to call out racism for what it is, you're perpetuating a cycle of bigotry and hatred that Americans of color are all too familiar with. This isn't a time to sit in silence. It's a time to stand up for what's right.", "2019-07-15T20:33:35.000Z": "The @ILGOP has remained silent and refuses to condemn the President's racist actions. The people of Illinois deserve leaders who will stand up for all of our communities - not anyone who cowers behind party loyalty.", "2019-07-15T20:23:04.000Z": "What @realDonaldTrump said yesterday wasn't just offensive and inappropriate - it was racist. Time and time again, this President has attacked people and communities of color, and his own party does nothing to stop him.", "2019-06-14T11:32:47.000Z": "Congratulations to Rockford's very own @FredVanVleet", "2019-03-11T20:23:55.000Z": "Congratulations to Milwaukee for being chosen to host the 2020 Democratic National Convention! This event will put an important spotlight on America's heartland and will increase economic opportunity for the entire region. It's a great day for our neighbors to the north!", "2019-02-02T14:38:13.000Z": "I agree @GovernorVA must resign immediately. Editorial: Northam must resign Gov. Ralph Northam has served his nation and commonwealth with admirable distinction and dedication. So it gives us no pleasure to see his rapid fall from grace. He is by richmond.com", "2019-01-14T20:26:46.000Z": "Today, I was sworn in as the 43rd governor of Illinois. This state has a bright future, and I am looking forward to taking on big challenges and working to improve the lives of all Illinoisans.", "2019-01-14T17:09:16.000Z": "Today is the big day! Watch live as @JulianaforLG and I get sworn in as governor and lieutenant governor of Illinois. Governor JB Pritzker on Facebook Watch Following along as Lt. Governor Juliana Stratton and I get sworn in as governor and lieutenant governor of Illinois here: facebook.com", "2019-01-14T15:52:50.000Z": "I started off Inauguration day at an interfaith service at First Presbyterian in Springfield.", "2019-01-13T23:44:27.000Z": ". @JulianaforLG and I were thrilled to see SO many people across the state PARTICIPATE in a day of service yesterday!", "2019-01-13T22:10:26.000Z": "Thank you to everyone who came out and made our open house at the Old State Capitol in Springfield a success!", "2019-01-13T01:04:51.000Z": "I finished the day of service in Aurora where I helped serve dinner to seniors at the Lutheran Social Services of Illinois Senior Apartments. Thank you to everyone who made today a success!", "2019-01-12T23:36:11.000Z": "Next, I participated in an emergency preparedness service event in Rockford with the Red Cross and @RockfordFire .", "2019-01-12T16:59:20.000Z": "I started off the day of service by visiting the Foglia Youth Center in East Garfield Park with @AldermanBurnett .", "2019-01-12T16:59:17.000Z": "I am kicking off Inauguration weekend with a day of service across the state. You can follow along in this thread!", "2019-01-11T03:12:48.000Z": "Congratulations to @repgregharris for making history by being named House Majority Leader. @JulianaforLG and I are looking forward to working with you!", "2019-01-11T01:20:46.000Z": "Tonight, @JulianaforLG and I attended a reception hosted by the @CGLA in Chicago. Cabrini Green Legal Aid works tirelessly to defend those living in poverty and we are proud to support them.", "2019-01-10T22:02:15.000Z": "The second best part of the @Eagles playoff victory over the @ChicagoBears on Sunday?\n \nA big box of @ElisCheesecake from my bet with Illinois governor-elect @JBPritzker . Thanks for being a good sport. #GoBirds  #FlyEaglesFly  #PAproud  #Unboxing", "2019-01-10T20:30:02.000Z": "There is still time to get tickets for @JulianaforLG and my inauguration celebration this Monday in Springfield! You can find tickets here: Governor's Inaugural Celebration eventbrite.com", "2019-01-10T02:30:55.000Z": "I ended my day by speaking at the Illinois Legislative Latino Caucus Inauguration Ball!", "2019-01-10T01:44:05.000Z": "I had a great time greeting members of the 101st General Assembly at the Illinois Legislative Black Caucus Inaugural Celebration reception!", "2019-01-10T01:09:59.000Z": "This afternoon, I stopped by an Inauguration reception hosted by Leaders Bill Brady and Jim Durkin. @JulianaforLG and I are committed to working with lawmakers from across the aisle to find solutions to the problems facing Illinois.", "2019-01-09T21:05:00.000Z": "Have any plans this Sunday? I will be holding an Open House at Old State Capitol Plaza in Springfield. Make sure to stop by and say hello! http:// ilinauguration19.com/schedule/", "2019-01-09T19:15:00.000Z": "Congratulations to the members of the 101st General Assembly who were sworn in today! I am excited to work with the legislature to improve the lives of families across the state.", "2019-01-09T18:06:56.000Z": "The humanitarian crisis at the border is one of this president's own making. Immigrant families make our state and our country strong and I will fiercely defend them as governor.", "2019-01-09T18:06:55.000Z": "Last night, we saw @realDonaldTrump cling to his border wall fantasy and refuse to #endtheshutdown as federal workers and immigrant families pay the price. I will work every day to make sure this type of hate has no home in Illinois.", "2019-01-09T16:40:49.000Z": "I'd particularly like to thank Speaker Madigan, Leader Durkin, President Cullerton, and Leader Brady for their work to move this legislation forward.", "2019-01-09T16:40:48.000Z": "I applaud the General Assembly for taking bipartisan action to begin restoring public trust in our state government.", "2019-01-08T18:43:17.000Z": "We're gearing up for the big night next Monday! Join us at our Inaugural Celebration in Springfield. Click here for tickets: https:// eventbrite.com/e/governors-in augural-celebration-tickets-53544456912 ", "2019-01-07T19:49:20.000Z": ". @ElisCheesecake was founded in 1980, making its debut at the first Taste of Chicago. Just last month, Eli's helped Illinois celebrate our bicentennial with a birthday cake unlike any other.", "2019-01-07T19:49:19.000Z": "200 slices of Chicago's Finest @ElisCheesecake are headed your way, @GovernorTomWolf ! It was a tough loss for #DaBears , but Illinois is proud to be home to the world's best football fans and some of the best cheesecake.", "2019-01-06T16:46:16.000Z": "Here in Illinois, we all know the @ChicagoBears are winning today's playoff game against the @Eagles , so I made a friendly bet with @GovernorTomWolf . We will be wagering cheesesteaks from @TonyLukes in Philadelphia against Chicago's own @ElisCheesecake ! #DaBears", "2019-01-01T06:06:09.000Z": "From my family to yours, happy New Year!", "2018-12-28T20:54:11.000Z": "Former Aurora Mayor Tom Weisner was a committed public servant who dedicated his life to improving his city and our state. I'm saddened to hear of his passing and am praying for his loved ones during this difficult time.", "2018-12-28T19:56:12.000Z": "Join @JulianaForLG and me at our inaugural celebration in Springfield on January 14! Tickets can be purchased here. Governor's Inaugural Celebration eventbrite.com", "2018-12-28T19:19:21.000Z": "Inauguration is on January 14, and we'd love to have you join us at the ceremony! Tickets are complimentary and available on a first-come, first-served basis, so click here to request your ticket today: http:// ilinauguration2019.com/Content/Defaul t/GetStarted.aspx ", "2018-12-27T17:22:52.000Z": "Brian Sleet was a beloved figure in local politics, a good friend, and a mentor to many. He will be missed dearly. My thoughts are with his loved ones during this difficult time. May he rest in peace.", "2018-12-25T15:05:49.000Z": "Wishing a very merry Christmas to everyone celebrating in Illinois and around the world! Hope everyone is having a great holiday season surrounded by family and friends.", "2018-12-21T17:15:18.000Z": "Congratulations to @WBEZSarabia on a long and successful career. Wishing you all the best and a happy retirement! #ThanksTony", "2018-12-18T23:50:07.000Z": "Today, @JulianaforLG and I visited @OldIrvingBeer for a tour and tasting. We're proud to support @IllinoisBeer and all that they do for our state's economy. Thanks for having us!", "2018-12-18T19:31:37.000Z": "I'm heartbroken for the families of the two Chicago police officers who lost their lives yesterday while working to protect our communities. My thoughts are with their loved ones and the Chicago Police Department during this difficult time. Body camera video recovered after 2 CPD officers fatally struck by train The Chicago Police Department mourned Tuesday, a day after two rookie officers were fatally struck by a train while chasing a suspect on the South Side. abc7chicago.com", "2018-12-15T18:40:46.000Z": "It was a great morning to attend this year's Christmas in the Wards and to celebrate the holiday season with families from the South and West sides of Chicago!", "2018-12-15T01:38:24.000Z": "This evening, I attended the 6th Annual Vigil for All Victims of Gun Violence to honor the lives and loved ones lost. Thank you to the community leaders who organized this important event and to those who keep working to end this public health epidemic.", "2018-12-14T21:33:58.000Z": "I was honored to join Secretary of State Jesse White for his 54th Annual Turkey and Ham Giveaway in Chicago this morning! I admire the hard work and commitment put into this annual event that helps communities during the holidays.", "2018-12-11T01:23:07.000Z": "We ended our third and final day of our statewide thank you tour meeting with supporters in Rockford. Thank you to everyone for all the hard work in this election. It's time to get to work!", "2018-12-10T20:44:03.000Z": ". @JulianaforLG and I later met with supporters in Galesburg and Rock Island to thank them for helping to bring a blue wave to Illinois!", "2018-12-10T17:54:38.000Z": "We kicked off the third day of our statewide thank you tour in Springfield this morning. Thanks to the hard work of supporters like you, November 6 was a success for Democrats up and down the ticket.", "2018-12-10T02:33:33.000Z": ". @JulianaforLG and I were so happy to meet with supporters in Franklin County and Metro East today. Thanks to everyone who attended and for all your hard work in this election!", "2018-12-09T22:20:19.000Z": "This afternoon, Juliana and I participated in a roundtable discussion on vocational training in Marion. We have the best workforce in the nation. Illinois' labor unions are proof of that. Let's prepare the next generation to rebuild our roads, bridges, and waterways.", "2018-12-09T19:38:43.000Z": "We kicked off day two of our statewide thank you tour meeting with supporters in Effingham this morning! You helped make November 6 a success - now let's work together to create jobs, affordable healthcare for all, and quality education for our children.", "2018-12-09T02:15:15.000Z": "We ended our day meeting with supporters in Champaign! @JulianaforLG and I are incredibly thankful for all the hard work you put in to bringing a blue wave to Illinois.", "2018-12-08T23:18:18.000Z": "This evening, we met with supporters in Decatur to thank them for their hard work in this election. Last month, your hard work helped us win, and together, we're going to put Springfield back on the side of working families.", "2018-12-08T20:58:03.000Z": ". @JBPritzker , @SenatorDurbin , @JulianaforLG and @AndyManar among thosing touring tornado damage in Taylorville today #twill", "2018-12-08T22:39:48.000Z": "From Peoria, we headed to Taylorville where we took a tour and got briefed on the recovery and clean-up efforts in the aftermath of last weekend's devastating tornado. We're grateful to everyone taking part in the recovery.", "2018-12-08T19:05:20.000Z": "Today, Juliana, @RepJGB , and I participated in a listening tour on Peoria County Jail's Re-entry Life Skills Program with their staff and got to learn more about the program and the important work they do.", "2018-12-08T18:52:44.000Z": ". @JulianaforLG and I kicked off our three-day statewide thank you tour in Peoria this morning! Thank you to all of our supporters for knocking on doors, making phone calls, and getting out the vote in this election. Let's get to work!", "2018-12-07T18:29:28.000Z": "I loved speaking at the Illinois Business Immigration Coalition's New American Dreams Forum today about uniting Illinois around commonsense immigration solutions to grow our economy, create jobs, and keep families together.", "2018-12-07T17:40:07.000Z": "Since 1964, the Chicago Leadership Prayer Breakfast has brought together leaders of all faiths. I was proud to attend this year's breakfast and speak to leaders across business, government, and nonprofits about our shared values.", "2018-12-06T01:37:56.000Z": "It was an honor to attend the 20th Annual Holiday Party & Toy Drive hosted by the 100 Black Men of Chicago! This organization is making a lasting impact in communities through mentoring, education, health, and economic empowerment. I look forward to the work we'll do together.", "2018-12-04T02:36:38.000Z": "Illinoisans of all backgrounds have united and pushed our state forward for 200 years. It was an honor to attend Illinois' Bicentennial Birthday Celebration tonight and to celebrate as one Illinois!", "2018-12-03T19:17:22.000Z": "To learn more about the Job Creation and Economic Opportunity transition committee and its members, see here: https:// jbpritzker.com/gov-elect-prit zker-lt-gov-elect-stratton-announce-job-creation-and-economic-opportunity-committee/ ", "2018-12-03T19:17:20.000Z": "Today, Juliana and I are proud to announce our Job Creation and Economic Opportunity transition committee. Comprised of business and nonprofit leaders and elected officials across our state, this committee will work hard to expand economic opportunity throughout Illinois.", "2018-12-03T02:58:58.000Z": "From my family to yours, we'd like to wish a happy Hanukkah to everyone celebrating in Illinois and throughout the world! Chag Sameach!", "2018-12-02T17:57:12.000Z": "I'm devastated for the communities in central Illinois affected by yesterday's tornadoes. We're thankful for the emergency responders who acted swiftly and to all of those assisting with the recovery efforts. Dozens injured as 22 tornadoes reported in central Illinois abcnews.go.com", "2018-12-01T05:59:14.000Z": "President George H.W. Bush dedicated his life in service to our country. His legacy will never be forgotten. Our thoughts are with his family and loved ones during this difficult time.", "2018-11-29T23:09:43.000Z": "Congratulations to Rep. @CheriBustos on her new position as Chair of the @DCCC ! Your leadership is putting the Midwest on the map and you're just what the DCCC needs to help get Democrats elected throughout the country. Illinois is proud! https:// chicago.suntimes.com/columnists/rep -cheri-bustos-an-illinois-democrat-wins-race-to-be-new-dccc-chair/ ", "2018-11-27T18:01:27.000Z": "With leaders like State Sen. @AndyManar , @RepChrisWelch , @kathigrif , @janicejackson and many others on board, we're excited for this committee to get to work!", "2018-11-27T18:01:26.000Z": "Today, I announced our Educational Success Committee. Juliana and I believe that the greatest investment a state can make is in its children. Every single child in this state deserves a quality education, regardless of their background, and every teacher deserves to be revered.", "2018-11-22T15:50:00.000Z": "Happy Thanksgiving! This year, more than ever, my family and I are thankful for the hardworking Illinoisans who bring so much light, richness, and diversity to our state. We hope your Thanksgiving is filled with family and friends.", "2018-11-20T20:21:59.000Z": "Today, we honor the lives lost to violence and transphobia. In 2018 we've already seen 22 trans people killed. This must stop. We will always fight for justice for Dejanay Stanton, Ciara Minaj Carter Frazier, and the many others whose lives were taken. #TransDayofRemembrance", "2018-11-20T01:35:50.000Z": "We are praying for the victims and the families affected by the Mercy Hospital shooting. Thank you to the first responders who immediately fought to protect those inside. It's devastating to hear of yet another act of violence in our city.", "2018-11-15T19:27:26.000Z": "To ensure the success of our state we must make sure we're taking care of all of our families. Today, I was proud to announce our Healthy Children and Families Committee, which will focus on finding ways to rebuild social services and help families build better lives.", "2018-11-13T18:15:47.000Z": "This committee, which includes Secretary of State @JesseWhite2018 and US Senator @TammyforIL , will work to make sure that our state lives up to its commitment to Veterans and their families.", "2018-11-13T18:15:45.000Z": "Juliana and I know the obligation we have to our nation's heroes - that's why we were so excited to announce our Serving Illinois' Heroes Committee yesterday. They served us, defended us, and risked their lives for us. Now, it's our turn to serve them.", "2018-11-12T20:07:44.000Z": "Juliana and I are ready to hit the ground running! Last week, we announced our Budget and Innovation Committee. A balanced budget is vital to move our state forward, and there are no better people to help create one than those on our committee.", "2018-11-11T19:13:37.000Z": "Thank you to all the Veterans who have selflessly served our country and fought to protect all Americans. Today and every day, we honor you and your sacrifices. #VeteransDay", "2018-11-08T16:39:57.000Z": "In the last three weeks we've seen several horrific acts of violence and hate take place. First, at a Kroger in Kentucky, then at the Tree of Life Synagogue in Pittsburgh and today, at the Borderline Bar and Grill in Thousand Oaks. https:// nytimes.com/2018/11/08/us/ shooting-california-thousand-oaks.html ", "2018-11-07T21:19:42.000Z": "Juliana and I spent the first day as Lt. Governor-elect and Governor-elect meeting you all and shaking hands at the Roosevelt L stop. We could not have done this without you. Thank you for your vote and your support!", "2018-11-07T04:01:28.000Z": "Juliana and I do not take your faith in us lightly. We understand that you have entrusted us to put Illinois back on track for every family, and we are going to treat that responsibility with the gravity it deserves. Thank you. Let's get to work!", "2018-11-07T04:01:01.000Z": "Together we will continue the fight. The fight to protect immigrant communities to help entrepreneurs who are creating jobs across the state, to lift up young people and people of color who have rejected old narratives and chosen to write their own stories. We will fight for you.", "2018-11-07T03:08:37.000Z": "WATCH LIVE - Thank you. This victory is ours to share, and it's just the beginning. Together, with the help of every single one of you, @JulianaforLG and I will continue to fight for Illinoisans as your next Lieutenant Governor and Governor of Illinois. https:// facebook.com/jbpritzker/vid eos/352595338834371/ ", "2018-11-06T23:46:37.000Z": "Nothing like finishing off #ElectionDay with my family! My dad taught me the importance of canvassing, and I'm so glad I can pass that on to my 16yr old sister Maeve by taking her to knock doors for @JBPritzker and @JulianaforLG", "2018-11-07T00:03:09.000Z": "My last stop was to meet voters at the Ogilvie Transportation Center. Evening commutes can be inconvenient, but voting doesn't have to be! Polling places are open until 7PM, find yours here: https:// iwillvote.com/il", "2018-11-06T23:20:30.000Z": "I stopped by Little Village, where I thanked some volunteers and organizers who are working incredibly hard to make sure that Illinoisans have all the information they need to vote today!", "2018-11-06T21:32:32.000Z": "@JBPritzker My 3 year old daughter has been chanting \"JB! JB! JB!\" almost every morning since Labor Day. Even she knows what Illinois needs! #JBForGov  #ElectionDay2018  #change", "2018-11-06T20:11:20.000Z": "I voted for the very first time. Voted Democratic down the ticket for @JBPritzker  @JulianaforLG for Gov & Lt. Gov., @KwameRaoul for Attorney General, @BetsyforIL for #IL13 , & @MikeforIllinois for Treasurer. #BlueWaveComing  #IVoted", "2018-11-06T18:57:00.000Z": "Make sure to go out and vote today. Thank you to @JBPritzker for coming to Manny's today for some lunch! We welcome all parties. That's what makes Manny's so special. You'll never know who you'll see.", "2018-11-06T20:09:56.000Z": "It wouldn't be Election Day without lunch at @mannysdeli ! It was great to come together with Democrats up and down the ticket to celebrate this Election Day tradition.", "2018-11-06T18:22:17.000Z": "Honored to have our next governor @JBPritzker help us get out the vote in the #Fightin47th . Great gathering of 47th Ward Democrats: @Ameya_Pawar_IL Sen. Pres. John Cullerton, @Annwilliams2010  @repgregharris  @MikeforIllinois , Mike Carbonargi. #Vote2018  #JBforGov", "2018-11-06T17:53:07.000Z": "Next, I made my way to the Welles Park voting location, to speak with some voters about to cast their ballots! Afterwards, I met with Secretary of State @JesseWhite2018 and @AldermanBurnett to get out the vote!", "2018-11-06T17:00:58.000Z": "I just voted for @JBPritzker , @JulianaforLG , @KwameRaoul , @MikeforIllinois , @susanamendoza10 , @RepMikeQuigley , @toniforchicago , and many other great Democrats. I voted, puffy eye and all! #ILGov  #twill", "2018-11-06T16:34:41.000Z": "There's no better way to kick off Election Day than shaking hands with voters on their way to work at the Western, 95th Street, 63rd Street, and Roosevelt L stops!", "2018-11-06T14:08:31.000Z": "Happy Election Day! Make your voice heard today-- go vote for @JBPritzker , @JulianaforLG , @KwameRaoul , @susanamendoza , Mike Frerichs, and Dems up and down the ballot! Find out where to vote here: http:// lil.ms/2o5u/4r9aik", "2018-11-06T14:49:29.000Z": "Today is the big day! Polls are open now until 7PM - Find your polling place and make your voice heard: https:// iwillvote.com/il", "2018-11-06T14:02:32.000Z": "Happy Election Day! It's the last day to vote so lets get out there and catch that #bluewave !! @JBPritzker @LUnderwood630 @KwameRaoul  @SeanCasten and the rest of the amazing Dem ticket President Obama talked about are counting on YOU! #ElectionDay2018", "2018-11-06T13:01:00.000Z": "It's been over a year and a half. We've traveled thousands of miles and met thousands of Illinoisans in every corner of the state, all leading up to today. It's been one of the most incredible journeys of our lives. Let's win big today.", "2018-11-06T01:25:10.000Z": "We ended the day at a GOTV Rally in Peoria! Thank you so much for coming out all across the state to meet us. Let's win big tomorrow!", "2018-11-05T22:37:32.000Z": "Big crowd this afternoon in the Capital City for Election Day Eve rally to Get-Out-The-Vote! Let's #FinishStrong ! @JBPritzker  @JulianaforLG  @DickDurbin  @KwameRaoul  @MikeforIllinois  @VoteforDoris", "2018-11-05T22:55:08.000Z": "Afterwards, we went to a GOTV Rally in Marion, and later in Springfield!", "2018-11-05T19:25:15.000Z": "Great GOTV rally for #GunSenseCandidates  @JBPritzker and @JulianaforLG ( #JulianaIsAmazing ) in Belleville, IL! Can't wait for them to be our new Governor and Lt Governor! @MomsDemand Metro East thanks @SenatorDurbin for all he does to reduce gun violence in our country!", "2018-11-05T19:01:21.000Z": "Our next stop was Belleville, where we had a blast at an Election Day Eve Rally! Only one more day until we elect progressive leaders across Illinois. Find your polling place: https:// iwillvote.com/il", "2018-11-05T15:26:21.000Z": "From Rockford, we made our way to Moline! This is one of the most important elections of our lifetimes and it's crucial that we do everything we can to speak to Illinoisans about the issues that matter.", "2018-11-05T14:43:29.000Z": "We kicked things off in Rockford today! Juliana, MK and I were so excited to be joined by US Senator @DickDurbin , Treasurer @mikeforillinois , and State Sen. @KwameRaoul as we spoke to voters.", "2018-11-05T13:13:30.000Z": "One more day! Get ready for tomorrow - Get registered, make a plan to get to the polls, and bring a few friends! Don't miss your chance to make a difference in Illinois: https:// iwillvote.com/il", "2018-11-05T03:45:03.000Z": "US Senate candidate, IL We need to elect a strong slate of Democrats up and down the ballot in IL. RT if you're voting for: @JBPritzker for Governor @JulianaforLG for LG @JesseWhite2018 for SOS @KwameRaoul for AG @susanamendoza10 for Comptroller @MikeforIllinois for Treasurer", "2018-11-05T00:52:27.000Z": "Make sure you have everything you need for election day, or find your early vote location here: I Will Vote Be a voter in the 2020 election. iwillvote.com", "2018-11-05T00:52:26.000Z": "With two days left, we were joined by President @BarackObama and Democratic candidates for a get out the vote rally in Chicago. We need your help to bring change across the state - We are one Illinois and we are going to make sure that this state works for everyone.", "2018-11-04T22:50:34.000Z": "WATCH LIVE as we're joined by President @BarackObama , @SeanCasten , @LUnderwood630, and Democrats up and down the ballot at a rally in Chicago! https:// facebook.com/jbpritzker/vid eos/323616858435425/ ", "2018-11-04T19:34:11.000Z": "This morning I attended church services in Chicago with Secretary of State @JesseWhite2018 ! Thank you for welcoming us into your congregations.", "2018-11-04T01:28:00.000Z": "I'm so proud to have the endorsement of the @rrstar Editorial Board! Our View: J.B. Pritzker is best choice for Illinois governor Illinois residents should ask themselves two questions before they cast their ballots this election cycle. Is the state better off than it was four years ago? Do you have any confidence things will... rrstar.com", "2018-11-04T01:07:45.000Z": "I ended the day joined by Rep. @Foster4Congress , @SenatorHolmes , State Reps @RepKifowit and @lindachapalavia at a rally in Aurora with the labor community.", "2018-11-03T23:23:44.000Z": "It's inspiring to see how many Democratic women are on the ballot across the state - Let's do all we can to get them into office in three days! Join Team JB for GOTV! - Illinois Governor JB Pritzker jbpritzker.com", "2018-11-03T23:23:43.000Z": "Our next stops were a meet and greet with @DuPage_Dems and later, the Illinois Democratic Women of Will County, where we were joined by State Senators @49JBT , @PatMcGuire43 and so many other great leaders.", "2018-11-03T19:24:42.000Z": "Afterwards, Rep. @Schneider4IL10 , State Sen. @Melinda4Senate , and State Rep. @repjcarroll joined us as we went to meet supporters and volunteers who were getting ready to knock on doors for @MaryforIL ! Mary is going to be a great State Rep. who will fight for the 51st District!", "2018-11-03T18:13:28.000Z": "Juliana, State Sen. @KwameRaoul , and I kicked off the final stretch towards Election Day at the @lcdiwomen canvass kick off with @VoteJoyceMason !", "2018-11-03T16:30:27.000Z": "It's almost #DaylightSavingsTime ! We may be falling back tonight, but make sure you have everything you need to spring Illinois forward on Tuesday! https:// iwillvote.com/il", "2018-11-03T15:19:02.000Z": "@SenDuckworth and @BetsyforIL firing up an enthusiastic crowd of canvassers for @JBPritzker , @KwameRaoul , and Dems down the ticket here in Springfield! #gotv", "2018-11-02T22:43:39.000Z": "Voted early today in the #Midterms2018 for @18thIL , @JBPritzker , and @KwameRaoul while also really hoping for @BetsyforIL . Thanks @PodSaveAmerica for the motivation!", "2018-11-03T00:18:18.000Z": "US House candidate, IL-2 I was thrilled that @JBPritzker joined my friend @repalriley and me in Park Forest this afternoon. We had a great discussion with residents of Garden House about the issues impacting them. #Twill  #ILGov  #BlueWave", "2018-11-02T20:39:41.000Z": "For my IL Dems! #GetOutTheVote  @JBPritzker  @JulianaforLG", "2018-11-02T21:50:21.000Z": "Later I met seniors in Olympia Fields with State Sen. @ToiHutchinson , and Park Forest with Rep. @RobinLynneKelly !", "2018-11-02T20:31:07.000Z": "Voting is one of the most important things you can do to make a difference in your community! Believe in its power and find your polling place here: https:// iwillvote.com/il", "2018-11-02T19:33:05.000Z": "Healthcare is on the ballot this election. Today, I joined Democrats up and down the ticket, like State Sen. @KwameRaoul , to talk about how in Springfield, we will fight to ensure that it is a right, and not a privilege in Illinois.", "2018-11-02T18:00:02.000Z": "It's time for a change in Illinois. Help us fight for our state and get out to vote. https:// iwillvote.com/il", "2018-11-02T16:20:31.000Z": "I joined @JBPritzker  @JesseWhite2018  @KwameRaoul and @MikeforIllinois at a press conference to discuss the importance of healthcare in Illinois. Only 4 days left, vote for the most qualified democratic ticket in Illinois history! #twill", "2018-11-02T14:44:10.000Z": "Need some plans this weekend? Grab a friend and go vote! Look up your polling place here: https:// iwillvote.com/il GIF", "2018-11-02T02:22:30.000Z": "Bruce Rauner has done whatever he can to weaken unions; it's disgraceful. With your help and your vote, we're going beat Bruce Rauner and get Springfield back on the side of working families.", "2018-11-02T02:22:29.000Z": "This evening Juliana and I attended the @IBEW Local 134 membership meeting alongside Treasurer @mikeforillinois , Comptroller @susanamendoza10 , and State Sen. @kwameraoul !", "2018-11-01T22:32:51.000Z": "IEA members calling voters to support ... @JBPritzker  with IEA Friend of Education award winner ... @RepChrisWelch !", "2018-11-01T20:44:24.000Z": "I was extremely proud to join my committeeman @kayarbro today to introduce our friend @JBPritzker to seniors at the West Suburban Senior Services Center in Bellwood.  He promised to fight and protect our most vulnerable and they promised to #GoVote for #TeamJB", "2018-11-01T20:31:37.000Z": "Thank you to Committeeman @kayarbro and @ChrisWelch_JD for joining me at a meet and greet with the senior community in Bellwood!", "2018-11-01T19:35:29.000Z": "Today, alongside Secretary of State @JesseWhite2018 , Clerk @AnnaValenciaIL and State Sen. @KwameRaoul , I spoke with and thanked the community leaders who have welcomed us into their congregations over the last year and a half.", "2018-11-01T15:36:29.000Z": "We're giving away tickets for @JBPritzker and @JulianaforLG 's Get Out the Vote rally with @BarackObama at our 1051 W. Belmont office. Come by while tickets are still here!", "2018-11-01T16:20:39.000Z": "There is too much at stake in this election for anyone to sit out, so join me, Dolores, and thousands of Illinoisans in casting your ballot for Democrats up and down the ticket. I Will Vote Be a voter in the 2020 election. iwillvote.com", "2018-11-01T16:20:00.000Z": "I'm so honored to have the support of @DoloresHuerta , a trailblazer for labor and civil rights. Together, we're going to continue Dolores' life's work by fighting for the issues that matter to working families and moving this state forward.", "2018-10-31T20:31:20.000Z": "Sent in my absentee ballot for @JBPritzker  @JulianaforLG  @KwameRaoul  @susanamendoza10  @MikeforIllinois  @fritz4assessor  @janschakowsky and Dems up and down the ticket today, + grateful for Chicago BOE Vote By Mail program's enfranchisement of IL resident, voting college students!!", "2018-10-31T22:29:57.000Z": "I can't think of a better Halloween treat than a Get Out the Vote rally with Vice President @JoeBiden , @Kelly4SouthrnIL , and Democrats across the ticket. Don't get tricked into thinking that your vote doesn't matter - Together, we can make a real difference in Illinois.", "2018-10-31T20:59:51.000Z": "Afterwards, I met with seniors at Casa Maravilla Senior Center, and later at Congressman George Collins Senior Home in Pilsen.", "2018-10-31T19:30:07.000Z": "I had so much fun meeting voters at @CafeForMuertos with @ChuyForCongress and Juan Ochoa!", "2018-10-31T18:35:57.000Z": "Gotta start'em young. Go #vote  for my friends @KwameRaoul & @JBPritzker please and thank you  #TeamKwame  #TeamJB  #ByeBruce", "2018-10-31T18:06:22.000Z": "Still need a spooky costume for #Halloween ? #TeamJB might have an idea https:// iwillvote.com/il", "2018-10-31T16:31:08.000Z": "#HappyHalloween ! What is the spookiest thing @BruceRauner has done as governor? 736-day budget crisis 46.2% Wavered on women's rights 10.2% Wasted a billion 21.6% Possibly voted for Trump", "2018-10-31T15:22:40.000Z": "How does #TeamJB celebrate two days until election day? A Get Out the Vote Rally with President @BarackObama ! Come join us this Sunday to get energized and ready for November 6th! \"ObamaCare Signups Surge\" in Spite of Trump and Rauner's Sabotage Efforts - Illinois Governor JB... Chicago, IL - Despite Donald Trump and Bruce Rauner's attempts to sabotage the ACA, health insurance enrollment is surging. jbpritzker.com", "2018-10-31T02:06:26.000Z": "Forget the pundits and political prognosticators, my 5-year old made  his prediction about @JBPritzker after we voted this evening! #TeamJB", "2018-10-31T00:33:33.000Z": "Things got a little spooooooky at the @JBPritzker family phone bank night tonight. One week to go!  #jbforgov  #BlueWave  #BlueWave2018", "2018-10-30T18:13:06.000Z": "17 months as Campaign Manager and Deputy Campaign Manager for @JBPritzker ...feels good to vote today.", "2018-10-30T23:17:10.000Z": "Later in the afternoon, I met with seniors in Palos Hills to discuss the ways Juliana and I will be advocates for the senior community and provide them with the resources they need like healthcare, affordable housing, and job training.", "2018-10-30T19:53:14.000Z": "Election Day is one week away! Make sure that you're registered and ready to cast your ballot! https:// iwillvote.com/il GIF", "2018-10-30T20:41:14.000Z": "This morning, I greeted some commuters at the Western L Stop to remind them: there is only one week until Election Day! Are you ready to make a difference and cast your ballot? Find your polling place and get ready for Nov. 6th: https:// iwillvote.com/il", "2018-10-30T17:24:25.000Z": "Juliana is one of the coolest, smartest people I know. So, it makes sense that her daughter, Cassidy, would be just as passionate about voting as her mom! Watch as they talk about why they're so excited to vote, and why your vote and your voice matter this and every election.", "2018-10-30T16:09:19.000Z": "There's only ONE week to go until Election Day! Find your polling place and get ready for the big day: https:// iwillvote.com/il GIF", "2018-10-30T15:07:38.000Z": "That's 3 votes for @JBPritzker  @JulianaforLG  @KwameRaoul  @susanamendoza10  @fritz4assessor and @rashidforcook Fulfill your civic duty, exercise your right, and VOTE! #Elections2018  #MidtermsMatter  #TeamJB  #BlueWaveComing2018", "2018-10-30T01:27:26.000Z": "This evening @JulianaforLG and I had a blast at the North Lake Front Progressives GOTV rally! We were joined by Reps. @QuigleyCampaign , @RepSchakowsky , @carolronen , and State Sen. @heathersteans . We are working to get every Democrat to the polls to fight for our state.", "2018-10-30T00:30:16.000Z": "US Senate candidate, IL #Illinois , join me in voting for these Democratic champions: Governor: @JBPritzker  Attorney General: @KwameRaoul  Secretary of State: @JesseWhite2018  Comptroller: @susanamendoza10  Treasurer: @MikeforIllinois", "2018-10-29T20:46:19.000Z": "Afterwards, I met with State Sen. @DanielBiss and State Rep. @Laura4Illinois at @Curts_Cafe , a cafe dedicated to giving a-risk youth valuable work experience and training opportunities.", "2018-10-29T18:24:31.000Z": "Today is all about knocking on doors and getting out the vote! I started off my day canvassing with State Rep. @repjcarroll in Northbrook!", "2018-10-29T16:12:45.000Z": "And with his support, Juliana and I are ready to bring Illinoisans together to bring back jobs across Illinois and invest in the future of our state. Now it's the time to do what Democrats do best: vote! Get ready for election day: I Will Vote Be a voter in the 2020 election. iwillvote.com", "2018-10-29T16:09:11.000Z": "We're honored to have your support, Vice President @JoeBiden ! Vice President Biden knows the importance of getting out the vote better than most.", "2018-10-29T01:21:06.000Z": "Jeanette knows that @BruceRauner is not looking out for Illinois' families. As governor I will fight to provide resources for Illinois' children so that they have the best chance to succeed.", "2018-10-29T00:48:38.000Z": "It was a pleasure to spend the evening at @FrankZTeam 's annual Mostaccioli Dinner with @JBPritzker , @JulianaforLG , @susanamendoza10 , and @MikeforIllinois . Proud to be part of this team. Only 9 days to go!", "2018-10-29T00:06:30.000Z": "Juliana and I ended the day at the Thornton Township's Annual Mostaccioli Dinner. We're fighting for everything we believe in, and over the next nine days we're going to make sure that we pound the pavement and get out the vote. Come join us! https:// jbpritzker.com/volunteer", "2018-10-28T23:07:50.000Z": "Later, Juliana and I joined Comptroller @susanamendoza10 , Treasurer @mikeforillinois , Rep. @RobinLynneKelly and many others for a rally with the @DWSSInfo ! We're so excited to have you all by our side as we get out the vote for these great Democrats!", "2018-10-28T20:43:02.000Z": "AWESOME day of Getting Out the Vote! @JBPritzker  @JulianaforLG with my sorority sister @ChiEbonyEsq", "2018-10-28T18:40:48.000Z": "This morning I attended church services with Secretary of State @JesseWhite2018 in Chicago. Now more than ever, we need to come together and work to lift up and invest in our communities.", "2018-10-28T17:15:29.000Z": "Having a lazy Sunday on this rainy day? Take some time to early vote! There are nine days left but you don't have to wait to cast your ballot: https:// iwillvote.com/il", "2018-10-28T02:50:02.000Z": "Had the opportunity to introduce the next Governor of Illinois @JBPritzker to Elgin residents at Art Harvest before we headed to Danny's Pizza for a GOTV Rally with our next Attorney General @KwameRaoul and other candidates on the November ballot. #bluewave  #byebyebruce", "2018-10-27T22:00:12.000Z": "@LUnderwood630 @JBPritzker ! She knows how important this election is! Couldn't just stay home!", "2018-10-28T02:50:57.000Z": "I ended the day in Elgin. First, I canvassed with State Senators Anna Moeller, @CastroforIL22 and @Kevin4Cook . Afterwards, we celebrated at a post-canvass party!", "2018-10-28T01:41:14.000Z": "In the afternoon, I had so much fun meeting with members of the Fox Valley community. This election is so important to Juliana and me because we're fighting for our values. We want to make sure that all Illinoisans have the tools they need to reach their potential.", "2018-10-27T23:58:02.000Z": "The Hebrew Immigrant Aid Society saved my great grandfather Nicholas Pritzker's life by bringing him to the United States in 1881. On this tragic night, let's recognize the incredible work of @HIASrefugees and combat this hate by lifting up and remembering their mission. https:// twitter.com/JamesFallows/s tatus/1056241699578658817  This Tweet is unavailable.", "null": "", "2018-10-27T23:16:26.000Z": ".@BruceRauner is a desperate failure and voters will make him keenly aware of that on November 6.", "2018-10-27T23:15:04.000Z": "And as @realDonaldTrump incites hatred and division across our country, @BruceRauner says nothing far too often. It's only fitting that Bruce Rauner closes out his four years of failing the people of Illinois by running to Donald Trump's side for a last-ditch photo op.", "2018-10-27T23:15:02.000Z": "When @realDonaldTrump tried to strip healthcare from a million Illinoisans, @BruceRauner said nothing. As Donald Trump's tariffs have hurt farmers across Illinois, Bruce Rauner has said nearly nothing.", "2018-10-27T22:38:40.000Z": "Next, I canvassed with @Karina4D49!", "2018-10-27T20:27:50.000Z": "Afterwards, @SuzyGlowiak , @TCHfor48 and I did what Democrats do best - We pounded the pavement and knocked on doors to speak with people about why this election is so important!", "2018-10-27T19:35:58.000Z": "I began my Weekend of Action at a canvass kick-off in DuPage with @SenTomCullerton and Deb Conroy. This weekend is all about meeting voters and getting everyone the information they need to cast their ballot. Let's give it all we've got these next 10 days! https:// iwillvote.com/il", "2018-10-27T19:02:57.000Z": "Today, innocent people were slaughtered in a house of worship during a bris, a sacred family tradition. My family and I are devastated and we stand with the Tree of Life Synagogue in the face of this horrific tragedy.", "2018-10-27T15:13:47.000Z": "DRY RUN DAY 3! @JBPritzker & @JulianaforLG Elections ALWAYS have consequences! We're almost there! #ThinkBIG  https:// jbpritzker.com/commit/", "2018-10-26T22:35:00.000Z": "I know that places like @FlyRFD are contributing so much to the economy of Rockford. Thank you to Rep. @CheriBustos and Mayor @tmcrkfd for showing me a piece of what makes Rockford so great. Quote Tweet Tom McNamara @tmcrkfd @FlyRFD grew 1,000 jobs in 2017! @RepCheri has consistently been one of our community's greatest advocates and especially great to our Airport.  It's great see @JBPritzker gets it. JB has now been to @FlyRFD more times than Rauner has since he's been Gov.", "2018-10-26T17:11:22.000Z": "Excited to #voteearly and cast my ballot for @JBPritzker / @JulianaforLG , @KwameRaoul , @susanamendoza10 , @JesseWhite2018 , & @CarolAmmons4IL ! #TeamFrerichs is #StandingTall with you! #twill Get a head start & vote early!  http:// bit.ly/IL-EarlyVoting", "2018-10-26T21:06:04.000Z": "Come help #TeamJB get out the vote for our last Weekend of Action! Early Vote Weekend of Action October 27-28 - Illinois Governor JB Pritzker jbpritzker.com", "2018-10-26T20:00:01.000Z": "Juliana and I are fighting for kids like Olivia! No child should have to worry about their insurance being taken away by the people that are supposed to represent them. Quote Tweet a.n.n.i.e @annielorri @JBPritzker my five years olds take on the election", "2018-10-26T19:03:39.000Z": "This race is deeply important because our values are on the ballot - Make sure you're ready to stand up against Bruce Rauner and cast your vote: I Will Vote Be a voter in the 2020 election. iwillvote.com", "2018-10-25T22:24:33.000Z": "Hey Region 11, your HQ fan club is cheering you on! You got this! @ErikaNickelson  @hanpanmancan  @LurigioMichael  @CarterGunnigle  @NathanOnTheLeft Karolina, Michelle, Rebecca, & Robert! #HQFanClub  #TeamJB  #BooPage  #DuPage", "2018-10-26T16:29:17.000Z": "Wishing my friend, Secretary @HillaryClinton , a very happy birthday! Your lifetime of public service has inspired me and generations of men and women around the world. I'm proud to have your confidence in this race.", "2018-10-25T21:39:34.000Z": "Yay early voting! With so much at stake, I am proud I could cast my ballot for proven, progressive Illinois leaders like @JBPritzker  @JulianaforLG  @KwameRaoul & @MikeforIllinois . #BlueWave  #VoteSaveAmerica  #twill", "2018-10-26T00:34:00.000Z": "We must do more to protect the transgender community from these attacks, and create an environment in which everyone can live openly without fear. #WontBeErased", "2018-10-26T00:33:59.000Z": "As Donald Trump seeks to erase the trans community at the federal level, I pledge to be a governor who listens and acts to keep transgender Illinoisans and our LGBTQ community as a whole safe. #justice4ciaraanddejanay  https:// nytimes.com/2018/10/21/us/ politics/transgender-trump-administration-sex-definition.html ", "2018-10-26T00:33:57.000Z": "Across our country, violence continues to be carried out against the transgender community at disturbing rates, particularly with transgender women of color. Here in Illinois, we need justice for Dejanay Stanton, Ciara Minaj Carter Frazier, and so many others.", "2018-10-25T22:28:47.000Z": "US House candidate, IL-17 I had a great time welcoming @JBPritzker to the Chicago Rockford International Airport. JB gets what an important economic engine the airport is and, unlike our current governor, he'll work with us to invest in our regional economy to create jobs and raise wages!", "2018-10-25T19:56:19.000Z": "Come get a #TeamJB lawn sign! We might have a couple extra", "2018-10-25T18:30:00.000Z": "Voting early is easy, and you can vote on your schedule. Skip the lines on Election Day and vote anytime between today and November 6th! Go to http:// iwillvote.com/il to find your polling place now.", "2018-10-25T15:50:00.000Z": "We're happy to have your vote! Quote Tweet Joe/Kamala2020! @dadabygrace Happy to have voted early for @JBPritzker , @susanamendoza10  @JulianaforLG and @KwameRaoul !! Voting for healthacre and progress!", "2018-10-25T14:59:58.000Z": "EARLY VOTING DAY 4!\nKeep it up, Northfield Township! Get out the vote! Tweet a reply to this post or DM if you can work an Election Day shift! Thanks! - Committeeperson @tracykatzmuhl  #BlueWave  #VoteDem  #JBforGov", "2018-10-24T20:00:01.000Z": "We have had so much fun on the campaign, and now there are only 13 days left. Look up your polling place and get ready for November 6th: https:// iwillvote.com/il", "2018-10-24T18:16:54.000Z": "I just voted for @JBPritzker  @JulianaforLG  @KwameRaoul and me! Early Voting is very quick and easy. Get it done  #twill  #ILGov", "2018-10-24T18:00:02.000Z": "Happy #NationalBolognaDay , @BruceRauner!", "2018-10-24T15:45:17.000Z": "Just voted for @JBPritzker and @JulianaforLG . I hope you will too!", "2018-10-24T15:19:17.000Z": "This is wrong. As a nation, we have fought to help immigrants find protection and seek a better life. As governor, I won't stand silently as you attack and vilify immigrant communities with your racist, xenophobic rhetoric. Quote Tweet Donald J. Trump @realDonaldTrump We are a great Sovereign Nation. We have Strong Borders and will never accept people coming into our Country illegally!", "2018-10-24T00:45:18.000Z": "Afterwards, I went to @BenU1887 and met with some of the great members of @benudems . There was so much potential in the room and as governor, I want to make sure that we invest in the success of students like these.", "2018-10-23T23:41:39.000Z": "Do you have a plan to vote?  Helping #TeamJB bundle make a plan cards!!  If you live in IL get out to vote for @JBPritzker on November 6th. #twill", "2018-10-23T18:13:51.000Z": "It's always an honor to have @JBPritzker join us. We have 14 days left before we vote to send a REAL LEADER to Springfield.", "2018-10-23T18:17:42.000Z": "The @AFFILeg has shown so much consistent, enthusiastic support for Juliana and me that I was so excited to attend their meeting today. Thank you for helping us get out the vote, and for protecting our communities!", "2018-10-23T16:15:00.000Z": "A year ago today, @BruceRauner announced that he was seeking re-election. What can we expect from four more years of Rauner? Another blame game, where he refuses to take responsibility for his failures at every turn.", "2018-10-23T15:03:20.000Z": "There's still time to help out #TeamJB over the next two weeks! Sign up for a shift and get out the vote in your community: https:// jbpritzker.com/volunteer", "2018-10-22T21:00:00.000Z": "Today, I helped out in \"Packetland\" and boxed some canvassing materials for all of our organizers and volunteers. #TeamJB is committed to getting out the vote for great candidates across the state!", "2018-10-22T17:54:34.000Z": "We are TEAM JB! #gotv  #gunsensecandidate  #teamjb  #momsdemandaction  @MomsDemand  @JBPritzker", "2018-10-22T17:46:10.000Z": "I was excited to start out this beautiful, sunny day by voting for @JBPritzker , @JulianaforLG , @KwameRaoul , @susanamendoza10 , @ILTreasurer and so many other great candidates.  Please get out there and help us ride the #BlueWave ! #Vote", "2018-10-22T17:46:21.000Z": "Early voting has expanded! There are now more early vote locations open across the state - Skip the Election Day rush and cast your ballot today. Find your early voting location here: https:// iwillvote.com/il", "2018-10-22T15:49:12.000Z": "Early voting begins today in Northfield Township! Vote @JBPritzker for Governor!", "2018-10-22T15:15:00.000Z": ".@BruceRauner refused to negotiate a budget for over two years, and Illinoisans are still suffering the consequences because of it. We need to get the state back on track, and as governor I will step up and work with leaders across the aisle to pass a balanced budget.", "2018-10-21T20:55:08.000Z": "The @MomsDemand volunteers in central Illinois DO NOT STOP! Out canvassing for #gunsense candidates @BetsyforIL  @cemcunningham and @JBPritzker again today!!", "2018-10-21T18:15:00.000Z": "Today is the last day to register to vote online! You don't want to be left out of this election. Register and make sure that your voice is heard on November 6th. http:// iwillvote.com/il", "2018-10-21T16:00:00.000Z": "Juliana and I had a blast marching to the polls with members of @SEIU ! We are one Illinois and it's time we had a governor in Springfield who will fight for what's right alongside working families.", "2018-10-20T22:54:44.000Z": "I ended the day with Rep. @RobinLynneKelly at a University Park GOTV meet and greet! We need all hands on deck if we're going to beat Bruce Rauner and sweep a blue wave across Illinois in 17 days. Make sure that you and your friends are registered to vote. https:// iwillvote.com/il", "2018-10-20T21:55:31.000Z": "I had so much fun at a meet and greet with the Grundy County Dems. Thank you, State Sen. @ToiHutchinson and @ElectHeidiHenry for helping us get out the vote! We're excited to beat Bruce Rauner and get real leadership back in Springfield.", "2018-10-20T17:14:06.000Z": ". @JBPritzker is inVESTed in making sure working families have a voice in Springfield. #ilgov  #twill", "2018-10-20T19:10:07.000Z": "US Senate candidate, IL Glad to join @SEIULocal1  @SEIU73 & @SEIUhciimk to get out the vote for @JBPritzker !", "2018-10-20T18:28:49.000Z": "Next, I stopped by Weber's Bakery to meet some voters who were grabbing an afternoon snack!", "2018-10-20T16:18:09.000Z": "Our members are voting and they're voting EARLY! Hundreds of members from @SEIUhciimk  @SEIULocal1 and Local 73 are lined up downtown ready to support @JBPritzker  @JulianaforLG !", "2018-10-20T16:38:43.000Z": "Afterwards, we marched to the early voting location to make sure that everyone was registered and ready to vote! https:// iwillvote.com/il", "2018-10-20T16:38:41.000Z": "I kicked off my Saturday in one of the best ways possible: A rally with @SEIU to get out the vote! Juliana and I were excited to be joined by US Senator @DickDurbin , State Sen. @KwameRaoul and hundreds of SEIU members from across the state.", "2018-10-20T16:00:14.000Z": "Local 50 for @JBPritzker  #affiEndorsed  #saturdaysupporters  #WeSupportThoseWhoSupportUs", "2018-10-20T14:30:55.000Z": "Love my Union Guys!! It's Game Time!! #TeamJB  @JBPritzker  @JulianaforLG", "2018-10-20T00:30:34.000Z": "I had a blast at the @Local150 Rally with Secretary of State @JesseWhite2018 , Comptroller @susanamendoza10 , Treasurer @mikeforillinois and State Sen. @KwameRaoul this evening! 18 days to go - don't wait to cast your ballot! https:// iwillvote.com/il", "2018-10-19T18:30:01.000Z": "Early voting is easy and convenient! There are only 18 days left, make sure your voice is heard! https:// iwillvote.com/il", "2018-10-19T16:00:01.000Z": "Ever wonder what life is like on the road with #TeamJB ? Hear from Gabriel and Taylor, two people who have been by my side as we've traveled thousands of miles across the state to meet Illinoisans!", "2018-10-19T00:48:32.000Z": "I ended the day at an event in support of @GPacIllinois where I was proud to be one of the recipients of the Profile in Courage Award. This award and endorsement confirms G-PAC's belief that we are committed to protecting our communities from the devastation of gun violence.", "2018-10-18T21:16:00.000Z": "Voted early and for Democrats up and down the ballot! @JBPritzker  @JulianaforLG  @susanamendoza10  @TheDemocrats  @cookcodems  @demsforillinois  @dnc", "2018-10-18T19:45:08.000Z": "This afternoon, I met with community members at @chicagosinai . I grew up in a home where social justice and equality were a priority, and today I was proud to speak about my longstanding commitment to them.", "2018-10-18T16:29:12.000Z": "Listening to parents who lost children to gun violence is incredibly painful but spurs me into action. I'm honored to have the support of @GPACIllinois and @GiffordsCourage , and proud to stand with them, @JBPritzker , @JulianaforLG , and others to talk about commonsense solutions.", "2018-10-18T16:47:19.000Z": "When we're in Springfield, Illinois is going to address gun violence head on. We are one Illinois, and it's time to recognize that gun violence in any part of our state is a problem for our entire state. The only way to confront it and overcome it is to act together.", "2018-10-18T16:47:18.000Z": "Juliana and I are so grateful to have the endorsements of @GPacIllinois and @GiffordsCourage , two incredible organizations who are on the front lines of the fight to end gun violence.", "2018-10-18T15:17:00.000Z": "Dorothy has seen the devastation @BruceRauner brought to Illinois, and she knows that to fix it - we must get new leadership in Springfield.", "2018-10-17T16:30:11.000Z": "Juliana and I started off our morning with Secretary of State @JesseWhite2018 , Comptroller @susanamendoza10 , and State Sen. @KwameRaoul at the Southland Ministerial Health Network. In Springfield we will make sure that every Illinoisan is getting the health care they need.", "2018-10-16T23:31:21.000Z": "Across the country, women are making their voices heard, and I'm so proud to stand with them in the fight for equality.", "2018-10-16T23:30:00.000Z": "This weekend, I was proud to stand alongside many strong women and allies at the Women's March to the polls. We need a governor who will fight for women's reproductive rights and equal pay for equal work - That's the governor I'll be for you in Springfield.", "2018-10-16T22:08:15.000Z": "Afterwards, we met with members of the Springfield & Central Illinois Trades & Labor Council to talk about ways to get out the vote over the next 21 days, and how we will fight for all working families to ensure that unions remain the backbone of our middle class.", "2018-10-16T20:51:43.000Z": "This afternoon, State Sen. @AndyManar and I attended the @actionillinois1 pre-election meeting to talk to volunteers about how exciting the next 21 days will be! Every single issue we care about is on the ballot and this is our chance to fight for them.", "2018-10-16T15:04:04.000Z": "Replying to @JBPritzker Our family already did it! @JBPritzker @LUnderwood630 \n@Karina4D49 @susanamendoza10  @KwameRaoul  @JesseWhite2018  #VoteEarly", "2018-10-15T22:30:00.000Z": "This Tuesday and Thursday at 6 p.m., we're phone banking for @JBPritzker and @KwameRaoul -- join us and help send environmental champions to Springfield on Nov. 6! #SierraVotes  https:// facebook.com/events/2291508 624458991/ ", "2018-10-15T21:00:00.000Z": "Sunday canvassing is fun for the whole family! Quote Tweet Mary C. Roberson @Mary_C_Roberson Thanks to my big and little bro for canvassing for me, @cemcunningham , @Gaither4IL , @JBPritzker , @JulianaforLG . @VermilionDems  #BlueWave  #Family  #Roberson4Clerk", "2018-10-13T22:55:37.000Z": "The AFFI was well represented today at the Maywood office of @JBPritzker . Locals from Franklin Park, Chicago, Forest Park, Oak Park, Riverdale, and North Riverside were in attendance. #AFFIendorsed", "2018-10-15T17:05:53.000Z": "What an honor to have @JBPritzker on the bimah with us at @BJBEcommunity yesterday. So grateful to all of the candidates who came to meet and speak with the North Shore Jewish Community. Quote Tweet JB Pritzker @JBPritzker I was honored to speak at the @BJBEcommunity candidate forum. I've been fighting for social justice my entire life and I'm proud of the work we've done, especially at the @ihmec , to help educate and tell the stories of so many survivors. Thank you for having me.", "2018-10-15T15:30:01.000Z": "Game on, Bruce Rauner! Early voting is so easy - find your polling place today so we can get Rauner out of Springfield. https:// iwillvote.com/il", "2018-10-15T02:32:32.000Z": "Thank you @JBPritzker for speaking at our dinner. We will be working hard to get you elected as our next Governor! Quote Tweet JB Pritzker @JBPritzker I ended the day at the @NewTrierDems annual dinner honoring @cookcountyclerk and Dan O'Brien for their service and volunteerism in Illinois.", "2018-10-15T00:00:58.000Z": "I ended the day at the @NewTrierDems annual dinner honoring @cookcountyclerk and Dan O'Brien for their service and volunteerism in Illinois.", "2018-10-14T22:32:24.000Z": "Thank you to everyone who came out to the GOTV canvass kick offs in Maywood and Niles this weekend! After seeing the hard work of #TeamJB and the energy in these rooms, I know we can beat Bruce Rauner this November!", "2018-10-14T21:09:07.000Z": "I was honored to speak at the @BJBEcommunity candidate forum. I've been fighting for social justice my entire life and I'm proud of the work we've done, especially at the @ihmec , to help educate and tell the stories of so many survivors. Thank you for having me.", "2018-10-14T17:56:59.000Z": "Afterwards, I attended the Schaumburg Area Democrats annual breakfast with some great candidates on the statewide ticket! We had lot of fun getting the crowd energized to get out the vote for Democrats!", "2018-10-14T17:07:58.000Z": "I kicked off my morning in Chicago, attending church services and later meeting some Chicagoans grabbing a Sunday breakfast!", "2018-10-14T00:24:44.000Z": "My clipboard is just for taking extensive notes on how to give a good handshake. Thanks to @emfiander and @JBPritzker for showing me how it's done.", "2018-10-14T14:18:38.000Z": "I voted! Did you?\n\nTwenty. Three. Days. 23.\n\nFor all 23, we fight for #Illinois . \n\nLet's do this! #JBforGov  #JBandJulianaForIllinois  @JBPritzker  @JulianaforLG", "2018-10-13T22:05:50.000Z": "Thank you to @JBPritzker for standing with @MomsDemand to fight to #EndGunViolence ! @Everytown endorses JB for governor and @JulianaforLG for Illinois! Vote on November 6! @womensmarchchi  #MarchToThePolls  #WeekendOfAction  #twill", "2018-10-13T21:06:41.000Z": "I was so glad to speak at the @ieanea One Conference this afternoon. We are stronger united, and in Springfield Juliana and I will always fight for our state's educators.", "2018-10-13T19:39:39.000Z": "Afterwards, I was proud to use my voice and vote for a better future for all Illinoisans. The rights of women across the country are on the line - make sure you're ready to cast your ballot. http:// Iwillvote.com/il  #TeamJB", "2018-10-13T17:56:23.000Z": "With Brett Kavanaugh's confirmation, we need unwavering leaders in Springfield who are committed to protecting women's rights. Make sure you're ready to vote, and elect change in November: I Will Vote Be a voter in the 2020 election. iwillvote.com", "2018-10-13T17:56:22.000Z": "Today, I stood alongside Juliana, amazing supporters and inspirational allies at the Women's March to the Polls. Women are leading the movement - they're volunteering, running for office and voting across the country.", "2018-10-13T01:41:56.000Z": "This evening I spoke at the Quad Cities @aflcio Hall of Fame event to talk about why we need to elect Democrats that will fight for working families, not only in Illinois, but across the country.", "2018-10-13T00:29:02.000Z": "Thank you to all the hardworking organizers and volunteers in our Moline field office! I had so much fun stopping by - 25 days left, let's keep up the momentum!", "2018-10-12T21:50:01.000Z": "I'm honored to have received the endorsement of the @suntimes editorial board. We are one Illinois and as governor, I will continue to fight for what's right and stand with families in every single corner of the state.", "2018-10-12T01:00:36.000Z": "\"We are one Illinois\" - @JBPritzker . Our state deserves a governor who will stand with all of us. #Ilgovdebate .", "2018-10-12T16:00:01.000Z": "Michael voted for @BruceRauner in 2014. Now, after four years of broken promises and failures, he won't do it again.", "2018-10-12T15:24:10.000Z": "Can you believe?! Thank you, @KaramoBrown for coming out to last night's debate and cheering on @JBPritzker with us! You and the rest of the Fab Five are welcome to come out on the campaign trail with #TeamJB anytime.", "2018-10-12T02:58:39.000Z": ". @JBPritzker is the Governor that Illinois deserves! Happy to be supporting him. Quote Tweet Jordan Abudayyeh @JordanAbudayyeh Thank you to @KaramoBrown for coming out to support @JBPritzker at the debate in Quincy! This election is too important for us to sit out! #twill  #ilgov  #ilgovdebate", "2018-10-12T00:58:56.000Z": "This campaign is about fighting for our values. Juliana and I have fought for what's right our entire lives and that won't stop when we're in Springfield. #ILGovDebate", "2018-10-12T00:49:39.000Z": ".@BruceRauner has constantly bashed Illinois, even going so far as to call our teachers \"virtually illiterate.\" We deserve a governor that is proud of our state and will highlight its accomplishments, rather than insult it at every chance. #ILGovDebate", "2018-10-12T00:48:11.000Z": "I'm proud to have helped create over 7,000 new tech jobs in Illinois. Illinois is the fifth largest economy in the US, and to maintain and advance our place, Juliana and I have a plan to bring back jobs in Illinois. #ILGovDebate  https:// jbpritzker.com/think-big-plan -illinois-jobs/ ", "2018-10-12T00:46:58.000Z": "Juliana and I know that to address gun violence we must partner with the organizations already doing the work. We will lead efforts to treat gun violence as a public health epidemic, rebuild communities, and increase firearm safety. #ILGovDebate", "2018-10-12T00:44:11.000Z": "Unlike @BruceRauner, as governor, I'll bring real change to Illinois. #ILGovDebate", "2018-10-12T00:37:06.000Z": "There is nothing more important to the future of our state and our economy than a quality public education for every child in Illinois. Unlike @BruceRauner, I want to invest in our children by investing in their education. #ILGovDebate", "2018-10-12T00:25:02.000Z": "I believe that a fair tax will allow the state to invest in important priorities like education and help rebuild the social safety net that so many Illinoisans rely on. #ILGovDebate", "2018-10-12T00:24:03.000Z": "A company @BruceRauner owned called Sterigenics has released cancer-causing toxins that devastated surrounding communities. Rauner tried to downplay this and even said \"this is not an emergency.\" High cancer risk in southeast DuPage County linked to company co-owned by Rauner's former firm People living near Sterigenics International face some of the nation's highest cancer risks from toxic air pollution, according to a new federal report. chicagotribune.com", "2018-10-12T00:19:51.000Z": "During @BruceRauner's time in office, job growth has plummeted in Illinois. We need a leader that has a proven track record of creating jobs and will work to revitalize our economy. The Rauner economy? Impasse surely took toll on Illinois jobs. The uncertainty created by the budgetary chaos almost certainly hurt the state's economy. Here's a look at the numbers. chicagobusiness.com", "2018-10-12T00:13:16.000Z": "14 of our nations heroes and their spouses died after getting sick from Legionnaires at the Quincy Veterans' Home, a crisis that was mismanaged by @BruceRauner. In the time since, Rauner continuously avoided questions and shifted blame. Our Veterans deserve better. #ILGovDebate", "2018-10-12T00:06:57.000Z": ".@BruceRauner's fatal mismanagement at the Quincy Veterans' Home led to the deaths of 14 Veterans and their spouses after becoming sick with Legionnaires', with families still waiting for answers from their failed governor. #ILGovDebate Surviving War, But Not The Veterans' Home Since July 2015, 13 residents of a veterans' home in west central Illinois have died from Legionnaires' disease. Eleven families are suing the state for negligence. interactive.wbez.org", "2018-10-11T23:56:50.000Z": "Thank you to @KaramoBrown for coming out to support @JBPritzker at the debate in Quincy! This election is too important for us to sit out! #twill  #ilgov  #ilgovdebate", "2018-10-11T20:10:24.000Z": "Video speaks for itself thank you for giving my family such a far reaching platform to simply tell my dad's story with no strings attached. Being able to get it out gives all of the families a brief moment of healing! Quote Tweet JB Pritzker @JBPritzker As the son and grandson of Veterans, I've seen the sacrifice brave men and women make for our country. That's one reason why it was so heartbreaking to hear the story of Eugene Miller, a Veteran who tragically died at the Quincy Veterans' Home during the Legionnaires' outbreak. Show this thread", "2018-10-11T19:03:57.000Z": "Eugene, his family, and Veterans across Illinois deserve better than @BruceRauner. We need a governor that will honor Veterans and work to provide them with vital resources, not one that will turn their back on the needs of our nation's heroes.", "2018-10-11T19:02:00.000Z": "As the son and grandson of Veterans, I've seen the sacrifice brave men and women make for our country. That's one reason why it was so heartbreaking to hear the story of Eugene Miller, a Veteran who tragically died at the Quincy Veterans' Home during the Legionnaires' outbreak.", "2018-10-11T18:00:01.000Z": "Today is the 30th anniversary of #NationalComingOutDay ! MK and I are proud to stand alongside allies and dear friends, like Stephen and Dale, on this day, just as we have our entire lives. We wish everyone a loving and supportive day.", "2018-10-11T17:00:00.000Z": "Every single girl around the world deserves a quality education. When girls are provided with resources for education, we are creating a better future for them, ourselves, and communities around the world. #DayOfTheGirl", "2018-10-11T15:47:05.000Z": "Welcome to Illinois, @KaramoBrown and the @QueerEye team! I'm glad to hear you support our plan for investing in education, and we're so excited to see you all spread your positivity across Illinois! @tanfrance , what are your thoughts on vests for a future governor? Quote Tweet Karamo @Karamo . @JordanAbudayyeh yep we are here. I'd love to see this debate. I support @JBPritzker plan to prioritize and invest in education system so that teachers, children, and families have the tools they need for success which is the opposite of what republican Governor Rauner has done. twitter.com/JordanAbudayye", "2018-10-10T22:30:00.000Z": "This Saturday, Juliana and I will be celebrating the Women's March to the Polls and we would love if you joined us. https:// jbpritzker.com/marchtothepoll s/ ", "2018-10-10T18:45:00.000Z": "Early voting is no joke! Look up your polling place now and go vote today! http:// iwillvote.com/il", "2018-10-10T16:30:01.000Z": "Today is #WorldMentalHealthDay . I was proud to visit @sipofhopecoffee , an organization that's fighting to raise awareness and give back to the community. It's time we eliminate the stigma, talk openly, and focus on getting mental health resources to those who need it most.", "2018-10-10T01:36:29.000Z": "My dad and I with the next governor of Illinois, thank you to my friend Maggie and former boss who helped us get the picture it is an honor and privilege to work on this campaign especially with Maggie and Patrick you guys are awesome the whole campaign is awesome", "2018-10-10T02:38:31.000Z": "I loved opening #TeamJB 's 32nd field office in Barrington! We're pounding the pavement and showing no signs of stopping. There's still time to join us: https:// jbpritzker.com/volunteer", "2018-10-10T00:26:52.000Z": "This evening I was proud to stand alongside Comptroller @susanamendoza10 , Senate President John Cullerton and many other supporters of labor. In Springfield we're going to fight for your rights, and fight to protect working families across our state.", "2018-10-09T19:10:07.000Z": "Yes, I did!! ... @JBPritzker  ... @JulianaforLG  ...... @LGJustinFairfax ", "2018-10-09T15:26:52.000Z": "Come join us as we make our voices heard and march to the polls this Saturday! Meet Up Before the Women's March to the Polls! - Illinois Governor JB Pritzker jbpritzker.com", "2018-10-09T17:00:01.000Z": "I'm incredibly proud to be endorsed by the @CrainsChicago Editorial Board. Thank you for trusting that Juliana and I have the best vision for Illinois.", "2018-10-09T15:30:30.000Z": "Found in Lake Michigan? This alligator is an Illinoisan! Quote Tweet Governor Gretchen Whitmer @GovWhitmer Hey @AndrewGillum , is this yours? https:// twitter.com/LSJNews/status /1049411385468186624 ", "2018-10-09T00:29:18.000Z": "With Brett Kavanaugh's confirmation, Juliana and I know that women's rights are in jeopardy. Today, we were proud to receive the endorsement of @Illinois_NOW , and to meet with leaders committed to resisting all attacks on women coming from Washington and Springfield.", "2018-10-08T22:04:04.000Z": "Thanks @JBPritzker for taking time for photos with a few of our #apgov students. #TheBestAreWithCPS  @CPSAdvPlacement  #democracyschools", "2018-10-08T22:15:17.000Z": "Sterigenics should be completely shut down until we determine it can operate safely. Our top priority must always be keeping communities safe. Quote Tweet Stop Sterigenics @StopSterigenics Good question. @JBPritzker where do you stand on the cancer causing emissions from #Sterigenics ?  You've condemned @GovRauner for taking so long to act, but we have yet to hear about your plan and stance on this important #health issue. twitter.com/Susan21167672/", "2018-10-07T20:24:38.000Z": "US House candidate, IL-2 I want to thank @JBPritzker & @JulianaforLG for this opportunity to address gun violence. This is an important & necessary discussion.", "2018-10-07T22:01:15.000Z": "It's important to us to speak with activists about the best ways to reinvest in marginalized communities across Illinois, and how we can take care of families affected by gun violence. Thank you all for sharing your stories and joining this important discussion.", "2018-10-07T22:01:14.000Z": "This afternoon, Juliana and I sat down with @RepDannyDavis , @RobinLynneKelly , and several advocates to discuss how to treat gun violence, and how we can bring economic opportunity to underserved communities.", "2018-10-07T19:12:55.000Z": "I loved attending church services across Chicago with Secretary of State @JesseWhite2018 this morning!", "2018-10-06T21:22:10.000Z": "I had a blast at the DuPage Get Out the Vote Rally and Concert! We have the chance to elect Democrats up and down the ballot but first, we need to make sure everyone is registered to vote. Early vote is now open! Make sure you're prepared: http:// iwillvote.com/il", "2018-10-06T20:48:58.000Z": "Thank you to all the volunteers who came out to the canvass kick off at our Joliet field office! Juliana and I are in awe of all your hard work to reach voters across the state, and we're so excited to fight for you in Springfield.", "2018-10-03T23:48:30.000Z": "First @JBPritzker pumpkin of the season at the Highwood Pumpkin Festival!", "2018-10-06T19:10:45.000Z": "This afternoon I spoke at the UAW Fall Conference about our commitment to protecting the rights of workers in Illinois. For the last four years we've had an anti-union governor. It's time for a leader that will work to get Springfield back on the side of working families.", "2018-10-06T17:16:49.000Z": "I@love this.  \"Fiddlesticks\" says it all!  Well, \"Fiddlesticks\" and Imma make sure I get out and vote for @JBPritzker ! Quote Tweet JB Pritzker @JBPritzker .@BruceRauner has been @realDonaldTrump 's sidekick for so long that sometimes it's hard to tell them apart. So, we asked Illinoisans: Can you tell the difference between a Trump quote and a Rauner quote?", "2018-10-06T16:27:42.000Z": "Leyden Township Democrats ready to walk for @JBPritzker  @JulianaforLG  @susanamendoza10 and Democrats up and down the ticket", "2018-10-05T22:15:47.000Z": "From day one, I have opposed Brett Kavanaugh's nomination. He threatens the rights of millions of Americans and now he's facing multiple sexual assault allegations. It's shameful that @BruceRauner would call for a Senate vote instead of believing women and protecting Illinoisans.", "2018-10-05T18:58:47.000Z": "Today, Jason Van Dyke was held accountable for his role in the tragic death of Laquan McDonald.", "2018-10-05T16:00:26.000Z": ".@BruceRauner has been @realDonaldTrump 's sidekick for so long that sometimes it's hard to tell them apart. So, we asked Illinoisans: Can you tell the difference between a Trump quote and a Rauner quote?", "2018-10-05T03:10:34.000Z": "I ended my day at the St. Clair County Democrats Dinner, where I spoke about the need to get Bruce Rauner's disastrous leadership out of office, and the importance of electing Democrats up and down the ballot.", "2018-10-05T00:32:55.000Z": "Later, I went to a phone bank at our Belleville field office! If we want to win in 33 days we need to knock on every door and meet with every voter across the state. Thank you all for coming out and volunteering with #TeamJB !", "2018-10-04T16:35:38.000Z": "I kicked off my morning speaking with voters at the Fullerton L stop!", "2018-10-04T00:27:38.000Z": "Proud to be supporting @JBPritzker for governor. Tonight, he stood strong for a progressive income tax, investments in higher education, immigration, and accountability for sexual harassment in the workplace. #ILGovDebate  #JBForGov", "2018-10-04T14:55:09.000Z": "Thank you to all the members of #TeamJB that came out to last night's #LGovDebate !", "2018-10-04T04:42:59.000Z": "#JBTHECHANGE  #BlueWave  #EstamosConJB  #Southside  #TeamJb  #ChicagoProud We can't tolerate four more years of failure from @BruceRauner. Good to see @JBPritzker holding him accountable. #ilgov  #twill", "2018-10-03T23:57:36.000Z": ".@BruceRauner, four years ago you said this to Illinoisans and four years later you have no results to show for it. You've made it clear: It's time to throw you out and get new leadership in Springfield. #ILGovDebate", "2018-10-03T23:50:57.000Z": "Illinois should be a welcoming state where immigrant families feel safe and have the tools they need to thrive. I've been an outspoken critic of Trump and I will continue to resist his bigoted policies as governor. #ILGovDebate JB's Priorities for Protecting Immigrant Families - JB Pritzker for Governor jbpritzker.com", "2018-10-03T23:48:23.000Z": "Affordable higher education is the key to keeping our state competitive and keeping our highly qualified students in the state. #ILGovDebate  https:// jbpritzker.com/highereducation", "2018-10-03T23:43:52.000Z": "Because of @BruceRauner's budget crisis, Illinois universities were forced to lay off hundreds of employees and cut dozens of programs. #ILGovDebate  http:// chicagotribune.com/news/local/bre aking/ct-budget-crisis-regional-universities-20170316-story.html ", "2018-10-03T23:41:46.000Z": "While @BruceRauner tries to distract Illinoisans from his failures with desperate attacks, the truth is: his budget would have sent property taxes skyrocketing. #ILGovDebate", "2018-10-03T23:36:54.000Z": "Illinois' working families have a right to their pensions. As governor, I will make sure our state lives up to its obligations to our workers. #ILGovDebate", "2018-10-03T23:35:20.000Z": "In an attempt to drum up support with his base, @BruceRauner vetoed commonsense gun safety legislation and proposed reinstating the death penalty. As governor, I won't play politics with the safety of our communities. #ILGovDebate", "2018-10-03T23:33:37.000Z": "Juliana and I have fought for social justice and civil rights our entire lives and when we're in Springfield, we will continue that advocacy by expanding economic opportunity to communities suffering from disinvestment. #ILGovDebate JB's Plan for Economic Inclusion - JB Pritzker for Governor jbpritzker.com", "2018-10-03T23:30:36.000Z": ". @JulianaforLG and I have a plan to combat gun violence in our communities. It starts with calling it what it is: a public health epidemic. https:// jbpritzker.com/gunviolence/", "2018-10-03T23:28:57.000Z": "For over two years, Bruce Rauner's budget crisis decimated anti-violence programs, slashed mental health services, and shut communities out of opportunity. #Ilgovdebate", "2018-10-03T23:25:12.000Z": "We can't afford four more years of this.", "2018-10-03T23:24:25.000Z": ".@BruceRauner has a pattern of putting himself and his interests before the safety and welfare of Illinoisans. We've seen it in the tragic Sterigenics crisis and the mismanagement of the Quincy Veterans Home and his company's nursing home neglect.", "2018-10-03T23:20:06.000Z": "I've spent my career building businesses and creating jobs. I founded @1871Chicago , a tech incubator which has created over 7,000 jobs and has made Illinois one of the top tech hubs in the world. #ILGovDebate", "2018-10-03T23:10:18.000Z": ".@BruceRauner is intentionally twisting facts and spreading lies about the fair tax to hide his own failures. The truth is: He doesn't support a fair tax and wants working families to pay the same rates as him. #ILGovDebate PolitiFact - Rauner distorts Dems' message on Illinois income tax PolitiFact is a fact-checking website that rates the accuracy of claims by elected officials and others on its Truth-O-Meter. politifact.com", "2018-10-03T23:04:15.000Z": "I believe that supporting Illinois' Veterans means investing in their education, incentivizing businesses to hire them, and supporting opportunities for their families to build better lives. Issues Archives - Illinois Governor JB Pritzker jbpritzker.com", "2018-10-03T23:02:31.000Z": ".@BruceRauner's administration is now facing a criminal probe over their handling of the Quincy Veterans home. Rauner Administration Faces Criminal Probe From Attorney General Dem attorney general targets GOP Gov. Rauner's administration over handling of deadly Legionnaires' disease outbreaks at a state vets' home. wbez.org", "2018-10-03T19:44:54.000Z": "Come join Juliana, other allies, and me on October 13th before we march to the polls! Meet Up Before the Women's March to the Polls! - Illinois Governor JB Pritzker jbpritzker.com", "2018-10-03T15:26:10.000Z": "Every day, we've waited for @BruceRauner to speak out against @realDonaldTrump , and every day he has remained silent. We need a governor that will fight back against the attacks from the White House, and stand up when Illinoisans need it most.", "2018-10-02T20:34:12.000Z": "I'm so sorry to hear of the passing of my friend and Menard County Chair, Shirley McCombs. Shirley has been a mentor, volunteer, and tireless advocate for Democrats across Illinois and for the people of Menard County. Her optimism is irreplaceable and she will be dearly missed.", "2018-10-02T18:00:01.000Z": "My grandfather came to America as an immigrant, seeking refuge from persecution. Every day I am grateful for the resources our state provided that helped him survive. I understand what's at stake and as governor, I will always stand up for immigrant communities in our state.", "2018-10-02T15:10:33.000Z": "As governor, I will defend the rights of all Illinoisans, and I'm glad the @HRC will be there to help us.", "2018-10-02T15:09:55.000Z": "As LGBTQ History Month begins, Juliana and I are so proud to have the @HRC by our side as we fight to uplift our state's LGBTQ community and move Illinois forward.", "2018-10-02T13:30:01.000Z": ". @HRC endorses equality champion @JBPritzker in his bid to become the next governor of Illinois. #ILGov HRC Endorses J.B. Pritzker for Governor of Illinois Pritzker is committed to fighting hate wherever it occurs by rooting out bullying in schools and enforcing workplace non-discrimination laws. hrc.org", "2018-10-02T01:55:26.000Z": "I ended the evening speaking with @MediaDervish about our plans to lift up communities that have been ignored and how we're going to bring progressive leadership to Illinois.", "2018-10-02T00:21:30.000Z": "Secretary of State @HillaryClinton , @JulianaforLG , and I spent an amazing afternoon hearing from several impressive young women at a roundtable discussion. It's imperative that we support our next generation of women leaders in every possible way.", "2018-10-01T21:05:24.000Z": "The general election is 36 days away. I'm doing everything I can to help elect @JBPritzker and @JulianaforLG and Democrats up and down the ticket and I hope you'll help too!", "2018-10-01T18:13:03.000Z": "I started my morning speaking with seniors in Chicago. I was so excited to see my good friend Lilly Patterson, who came to vote with me in the Primary!", "2018-10-01T16:37:37.000Z": "I congratulate and stand in solidarity with the members of @UniteHerelocal1 that have reached new contract agreements with hotels across the city of Chicago.", "2018-10-01T15:40:00.000Z": "State Sen. @DanielBiss said it best - Our future is on the line and we need to fight for it by getting progressive leadership in Springfield. Every single voice matters, make sure that yours is heard. http:// iwillvote.com/il", "2018-10-01T12:26:22.000Z": ". @MaxTemkin  Yes! I will absolutely sign it. We need to fight to keep a free and open internet and as governor I'll make it a priority. https:// twitter.com/MaxTemkin/stat us/1046572184674729985  This Tweet is unavailable.", "2018-09-30T00:21:06.000Z": "GREAT DAY WORKING TO GET @JBPritzker & @JulianaforLG ELECTED IN #ILLINOIS", "2018-09-30T20:30:00.000Z": "Can't make this Weekend of Action? Don't worry, there are still opportunities to get involved with #TeamJB across the state! Volunteer - Illinois Governor JB Pritzker jbpritzker.com", "2018-09-29T21:57:29.000Z": "Reunited with some of my favorite #teamJB volunteers during the Weekend of Action! Had to take a quick selfie break!", "2018-09-30T17:20:58.000Z": "We are so excited to have you out here in Illinois with us, Lt. Governor @FairfaxJustin ! Quote Tweet Justin Fairfax @FairfaxJustin From #Virginia to #Illinois with a #BlueWave ! See you tomorrow in Chicago, @JulianaforLG ! #DemLGs  #WeRiseTogether  @DemocraticLGs", "2018-09-29T16:03:58.000Z": "At @iftaft Local 571's legislative breakfast. As the mother of a son in kindergarten @ChiPubSchools , I hold IL teachers close to my . I prioritize education spending to put #Illinois children first. Let's elect @JBPritzker who will prioritize our children & teachers. #twill", "2018-09-29T21:56:02.000Z": "#TeamMorgan58 is proud to stand  w/ leaders like @JulianaforLG  @JBPritzker & @Schneider4IL10  #Vote  #KnockDoors  #Call  #SpeakUp  @BobMorganIL", "2018-09-29T17:52:20.000Z": "Our 18th Ward Volunteers are out in full swing as we small business canvass in the community this afternoon! All in support of @JBPritzker  @JulianaforLG  @KwameRaoul and Democrats up and down the ticket! #TeamJB  #WeekendOfAction  #JBtheChange  #BlueWave", "2018-09-29T18:00:00.000Z": "Early vote is now open! Register, grab a friend (or two), and get out to vote! You can find your polling place here: https:// iwillvote.com/il", "2018-09-29T16:27:09.000Z": ". @JulianaforLG and I are excited to see you all out there, pounding the pavement, for this Weekend of Action! Quote Tweet Sophia Powers @sophiacpowers Getting ready to knock doors in #LakeView tomorrow for Day 1 of #TeamJB 's #WeekendOfAction ! With only 5 weekends left to knock doors, it's more important than ever that we talk to our neighbors to elect @JBPritzker , @KwameRaoul , & Democrats up and down the ticket on Nov. 6!", "2018-09-28T23:24:44.000Z": "I was honored to stand alongside @ChicagoWTA to call for new leadership in Springfield and Washington that will work to defend and protect women's rights. Together, we are fighting against this Supreme Court nomination.", "2018-09-28T17:04:40.000Z": ". @JBPritzker stands with women and has been clear in his opposition on Kavanaugh. #stopkavanaugh", "2018-09-28T20:47:17.000Z": "Juliana and I loved meeting with bishops of the Greater Tabernacle Cathedral Church of God in Christ in the historic Pullman neighborhood this afternoon.", "2018-09-28T19:36:34.000Z": "I was proud to join @IndivisibleIL 's rally in support of Dr. Christine Blasey Ford. I'm adding to the voices of men and women across the country when I say: Thank you for your courage and bravery, Dr. Ford.", "2018-09-28T01:03:32.000Z": "I stand with Dr. Christine Blasey Ford and commend her incredible courage today. I've opposed Kavanaugh from day one because he poses a threat to women's rights, healthcare, and environmental protections.", "2018-09-28T00:28:27.000Z": "This evening I spoke at @ilenviro 's annual reception. Clean energy is on the ballot this year. As governor, I won't stay silent while Trump rolls back policies that protect our environment and our health.", "2018-09-27T21:17:03.000Z": "I was so proud to cast my ballot today for our amazing group of Democrats running to bring real change to Illinois. There are 40 days left but Illinoisans can start voting today! This is one of the most important elections of our lifetimes. Make sure your voice is heard.", "2018-09-27T18:10:00.000Z": "The @ILDCCA staff took a short break this morning to go Early Vote. Want to make your voice heard now? Go Early Vote! @JBPritzker  @demsforillinois  @susanamendoza10  @JesseWhite2018  @MikeforIllinois  @KwameRaoul  #BlueWave  #Democrats", "2018-09-27T16:26:49.000Z": "Afterwards, I went to the @ChicagoTemple to speak with pastors and worshipers about the first day to early vote!", "2018-09-27T15:22:30.000Z": "It was a great morning to meet voters at the Roosevelt L stop and remind them: Early vote is now open!", "2018-09-27T01:12:14.000Z": "I ended the day at a phone bank in Proviso Township hosted by Committeeman @kayarbro . It's so exciting seeing volunteers gearing up for November 6th! Thank you for your support!", "2018-09-27T00:08:24.000Z": "Afterwards, State Sen. @DonHarmonIL , State Rep. @replilly78 and I stopped by the @OP_Dems phone bank!", "2018-09-26T18:47:13.000Z": "Affordable, innovative higher education is the key to boosting Illinois' economy and keeping our highly qualified graduates in the state. Today, Juliana and I were proud to roll out our higher education plan at ISU. Check it out here: https:// jbpritzker.com/highereducation", "2018-09-26T15:53:00.000Z": "It's no surprise that our state is facing a teacher shortage with the way @BruceRauner talks about our educators. Our public school teachers are some of our state's hardest workers and as governor, I'll make sure they receive the respect they deserve.", "2018-09-26T00:59:10.000Z": "Juliana and I ended the day by meeting with churchgoers and faith leaders from the Fox Valley. We had a great time talking about our plans for Illinois, alongside so many great Democratic leaders like @RepKifowit , @SenatorHolmes , @LUnderwood630, and @HainforKane .", "2018-09-25T23:38:57.000Z": "Thank you to @RepKifowit and all the volunteers that participated in the phone bank at our Aurora field office today!", "2018-09-25T17:33:54.000Z": "This morning, I met with State Sen. Steve Landek and community leaders in Bridgeview to discuss the importance of a having a diverse administration in Springfield, and how Juliana and I will be advocates for our state.", "2018-09-25T12:11:06.000Z": "Illinois needs a Governor who will make sure our communities don't miss out on #cleanenergy jobs & savings. My column with @SenatorSteans in the @suntimes - http:// bit.ly/2OQ0YNy  #twill", "2018-09-25T15:29:53.000Z": "It's #NationalVoterRegistrationDay ! There are only 42 days left to get yourself and your friends ready for election day - make sure that you're prepared to make a difference on November 6th by registering to vote! https:// iwillvote.com/il", "2018-09-24T22:19:47.000Z": "@JBPritzker and @PJK4brainhealth thank you for sharing your story & for listening. I know you are committed to fixing mental health & addiction treatment in Illinois. \nTeamwork makes the dream work.\nWe need a Governor that listens and that is YOU ! Quote Tweet JB Pritzker @JBPritzker Today I sat down with Rep. @PJK4brainhealth and @StateRepSara to talk with mental health treatment providers and recipients about the challenges they've faced over the last few years. Mental health care and substance abuse treatment are essential and lifesaving. Show this thread", "2018-09-24T21:42:36.000Z": "We need to remove the barriers to treatment, and that starts with eliminating the stigma and making sure that our providers are fully funded and staffed.", "2018-09-24T21:42:35.000Z": "Today I sat down with Rep. @PJK4brainhealth and @StateRepSara to talk with mental health treatment providers and recipients about the challenges they've faced over the last few years. Mental health care and substance abuse treatment are essential and lifesaving.", "2018-09-24T16:29:11.000Z": "In one day you can see all the signs of @BruceRauner's four years of failure. We shouldn't have to deal with another four years of this. New leadership is long overdue.", "2018-09-23T15:56:09.000Z": "#TeamJB is running hard to the finish line on Nov. 6! @JBPritzker is going to defeat @GovRauner and put Springfield back on the side of working families!", "2018-09-23T17:48:43.000Z": "We're helping Democrats in Illinois get the best digital, field, and messaging training and capacity needed to win in November. Will you join us? Donate to Blue Wave Illinois 2018 and help get Democrats elected up and down the ticket! Support Blue Wave Illinois 2018 Join us! Contribute today. secure.actblue.com", "2018-09-22T22:05:19.000Z": "Juliana and I had a great time at the #ChicagoFootballClassic at Soldier Field. Watching two HBCUs face off in Chicago is a fantastic tradition! Good luck @MorehouseFB and @miles_football !", "2018-09-22T20:00:07.000Z": "We are so proud of the work our volunteers are doing. #TeamJB is pounding the pavement and talking to voters across the state. There are 45 days left and we would love your help. Join us: http:// jbpritzker.com/volunteer", "2018-09-22T20:00:06.000Z": "There's no better way to kick off Saturday than a canvass launch at our South Holland field office! We've seen the lies and destruction that Bruce Rauner is capable of creating, and we need to elect Democrats up and down the ballot to get Illinois back on track.", "2018-09-22T02:33:14.000Z": "This evening, I was proud to attend the 4th Annual @ChiLatinoCaucus Foundation Gala. It's great to see an organization that is committed to removing the barriers to higher education and scholarships for Latino youth. Thank you for having me.", "2018-09-21T18:59:26.000Z": "We're fighting for the future of kids like her! Thank you for your support, @RepJGB ! Quote Tweet Jehan Gordon-Booth @RepJGB I knew before, but tonight was confirmation... @JBPritzker is the kind of leader that we need to move the state forward for today, tomorrow and the future! Our kids are depending us us to get this right! #ILGovForum  #twill", "2018-09-21T15:15:28.000Z": "Last night's #ILGovForum made it clear that we need all hands on deck to combat Bruce Rauner's lies and defeat him in November. Sign up here to join #TeamJB : Volunteer - Illinois Governor JB Pritzker jbpritzker.com", "2018-09-20T22:49:35.000Z": "Chicagoland LIUNA members phone banking for #Labor2018 , we're with ... @JBPritzker  for Governor! #UnionStrong ...@LiUNA_GLR", "2018-09-21T00:24:29.000Z": ".@BruceRauner is desperately trying to push his destructive agenda. Another four years of his \"leadership\" is another four years of failure.", "2018-09-21T00:07:47.000Z": "Congrats to @JBPritzker on a great #ILGov Debate! We can't wait to work with you to protect and expand women's rights and access to vital healthcare. #ILGov  #ProChoice  #JBforGov", "2018-09-21T00:10:39.000Z": "Tonight solidified that @JBPritzker has the vision and leadership to be the next governor of Illinois. He'll protect workers' rights & invest in high quality public education for all students regardless of zip code, income or the color of their skin. #ILGovForum  #jbforgov", "2018-09-20T23:58:55.000Z": "From his support of Brett Kavanaugh to his decision to veto legislation ensuring equal pay, @BruceRauner has shown his disregard for the well-being of the women of Illinois. @JBPritzker has and will continue to fight for women's rights across the board. #JBforGov  #ILGovForum Quote Tweet JB Pritzker @JBPritzker I've been an advocate and an ally for women my entire life and that won't stop as governor. I'm proud to stand alongside women in the fight for equal pay for equal work, and healthcare, and the right to choose. #ILGovForum  https:// jbpritzker.com/womensrights/", "2018-09-20T23:56:48.000Z": "REALITY CHECK: @BruceRauner ducks responsibility and blames others at every turn. #ILGovForum  http:// chicagotribune.com/news/local/pol itics/ct-met-bruce-rauner-madigan-not-in-charge-20171204-story.html ", "2018-09-20T23:52:00.000Z": "For four years, @BruceRauner dragged the state from crisis to crisis, failing to accomplish anything.", "2018-09-20T23:42:13.000Z": "REALITY CHECK: Rauner says we need to secure elections but he vetoed the bill that would have ended Crosscheck. I'm committed to protecting our voter information. https:// chicago.suntimes.com/opinion/bruce- rauner-crosscheck-voter-suppression/   #ILGovForum EDITORIAL: Illinois should be protecting voters, not undercutting them Getting Illinois out of Crosscheck would be step toward more accurate elections. We hope the state finds a way to do so soon. chicago.suntimes.com", "2018-09-20T23:34:35.000Z": "The decision of NFL players to take a knee to protest racial injustice is entirely American. We should have a conversation about how we address what they're protesting, not their right to protest. #IlGovForum", "2018-09-20T23:32:16.000Z": "Gun violence is a public health epidemic, taking far too many lives and impacting too many communities. It's time for us to step up and protect our communities. https:// chicago.suntimes.com/crime/gun-cont rol-jb-pritzker-chicago-shootings-op-ed/ ", "2018-09-20T23:27:19.000Z": "I've been an advocate and an ally for women my entire life and that won't stop as governor. I'm proud to stand alongside women in the fight for equal pay for equal work, and healthcare, and the right to choose. #ILGovForum JB's Commitment to Women's Rights - JB Pritzker for Governor jbpritzker.com", "2018-09-20T23:24:52.000Z": "Illinois should be a welcoming state where immigrant families feel safe and have the tools they need to thrive. I've been an outspoken critic of Trump and I will continue to resist his bigoted policies as governor. JB's Priorities for Protecting Immigrant Families - JB Pritzker for Governor jbpritzker.com", "2018-09-20T23:22:25.000Z": "Under @BruceRauner, Illinois' job growth has slowed and people are fleeing the state. #ILGovForum", "2018-09-20T23:19:02.000Z": "I believe that pensions are a promise made to hardworking public servants. @BruceRauner would rather send Illinois into bankruptcy than ensure the state fulfill its obligations. POLITICO Illinois Playbook: RAUNER wants SECOND TERM -- GOVERNOR lobbying CONGRESS to revamp state... politico.com", "2018-09-20T23:18:12.000Z": "REALITY CHECK: I have never proposed a vehicle mileage tax and fact checkers have called @BruceRauner out on his constant lies. #ILGovForum  http:// wsiltv.com/story/39071949 /truth-test-does-jb-pritzker-support-a-mileage-tax ", "2018-09-20T23:17:04.000Z": "Illinoisans know: We can't trust a word that is coming out of @BruceRauner's mouth. Lie after lie, he has tried to deceive Illinoisans in an attempt to hide his failures. #ILGovForum", "2018-09-20T23:09:14.000Z": "REALITY CHECK: As governor, I will fight for a fair tax so the middle class and those striving to get there pay less, while those who can afford it pay more. #ILGovForum", "2018-09-20T23:07:44.000Z": "Unlike @BruceRauner, when I'm governor, I will be in charge.", "2018-09-20T22:25:02.000Z": "I'm ready to hold Bruce Rauner accountable for his disastrous four years in office and I'm ready to show Illinoisans why @JulianaforLG and I have the right plans to move Illinois forward. Let's do this!", "2018-09-20T22:25:00.000Z": "It was great to see so many members of #TeamJB outside the #ILGovForum ! Your support and enthusiasm are going to bring us to victory in November.", "2018-09-20T20:27:56.000Z": "These ladies have been on the doors all day today talking to their co-workers about how important it is to elect @JBPritzker and send @GovRauner packing. #HCIIVotes  #RaunerFailedMe  #twill  #ILGov  #WeRise", "2018-09-20T16:52:29.000Z": "We proudly welcomed @JBPritzker & running mate @JulianaforLG at the Carpenter Training Center recently to rub shoulders with our skilled men and women building their unions careers. Oh, yeah... @JoeBiden was there, too! We thank them greatly for championing union labor!", "2018-09-19T18:58:53.000Z": ".@BruceRauner has constantly lied to Illinoisans throughout his four years in office. In 2015, he pushed ethics aside and met with a business partner to discuss a private investment on the back porch of the Governor's Mansion. Gov. Rauner met about investments while in office, lawsuit says CHICAGO - Illinois Gov. Bruce Rauner participated in meetings about his cut of a $67.5 million settlement months after taking office in 2015 despite declaring publicly that he'd give up contr wgntv.com", "2018-09-19T01:20:03.000Z": "Pre-Schoolers for @JBPritzker  #teamJB", "2018-09-19T14:15:33.000Z": "Wishing an easy and meaningful fast to all those observing Yom Kippur. G'mar chatimah tovah.", "2018-09-18T21:25:48.000Z": "This afternoon I joined Rep. Conyears-Ervin and @aldermanervin at the Greencastle senior home and the William Jones senior home to talk about getting out to vote!", "2018-09-18T15:15:00.000Z": "We're all so proud to see these students make a difference in their communities by working hard to raise mental health awareness and giving back to those less fortunate. Student athletes donate thousands of sweatshirts to shelter as winter approaches CHICAGO - On Chicago's West Side, a warm mission arrived by semi truck Sunday as more than a dozen student athletes from around the Chicago area unloaded dozens of donated sweatshirts at a homeless wgntv.com", "2018-09-18T01:19:33.000Z": "I was glad to participate in a roundtable with @SEIUhciimk this evening. I heard the stories of several healthcare workers and learned about their organizing campaign. Healthcare is a right, not a privilege, and together we will make sure that everyone has access to quality care.", "2018-09-17T19:50:50.000Z": "Keep up the great work! Quote Tweet loc_andsoul_rebel @cindiafields Canvassed with Labor 2018 in support of @AFLCIO  @afscme31  @AFSCME candidates @JBPritzker (Gov) and @Kelly4SouthrnIL (Congress 12th District). #1u  #twill  #afscmestrong", "2018-09-17T16:35:00.000Z": "This is the reality of @BruceRauner's failures. Rauner has not only made it more difficult for people with disabilities to live independent lives, he has also held back vital resources for caregivers and vetoed a bill that would have given them a raise.", "2018-09-15T14:15:02.000Z": "@IEASP1750 Chair Katie Barr and me with the next Governor of Illinois @JBPritzker Woot woot  @ieanea Future Teachers! #JBPritzker  #BlueWave  #Vote2018  #Election2018", "2018-09-16T01:37:48.000Z": "Glenn Poshard rallying #democrats tonight in Montgomery Co for @JBPritzker & @JulianaforLG ! #TeamJB", "2018-09-16T20:09:18.000Z": "This morning, Juliana and I attended church services across Chicago. Thank you all for welcoming us into your communities!", "2018-09-16T17:08:43.000Z": "Vice President @JoeBiden has been an advocate and fighter for hardworking families his entire career. We were excited to walk with him and check out what the @carpenters1256 students were learning.", "2018-09-16T17:08:42.000Z": "Juliana and I were proud to stand alongside Vice President @JoeBiden and meet with labor leaders to take a tour of @Carpenter1256 last week.", "2018-09-16T01:05:45.000Z": "I ended my Saturday at the Calhoun County Hog Roast!", "2018-09-15T23:40:39.000Z": "US House candidate, IL-13 The Edwardsville Volunteer Hub is open for business!! Thanks to @DickDurbin , @JBPritzker , @Rachelle4Senate , @RepKatieStuart , @DebMingMendoza , Mark Von Nida and Rep. Jay Hoffman for getting the party started!", "2018-09-15T22:15:51.000Z": "Next, I went to support @BetsyforIL at her Edwardsville office opening! #TeamJB is standing behind Betsy and her volunteers 100% - We know that she is going to make an amazing congresswoman for the 13th district!", "2018-09-15T17:28:52.000Z": "Local 73 members knocking on doors today in support of @JBPritzker & @JulianaforLG . JB will stand up for workers' rights and work hand-in-hand with the labor movement to fight against harmful legislation that lowers wages.", "2018-09-15T20:47:57.000Z": ". @JBPritzker took the time to talk with @aftunion members at the Southwestern IL #laborpicnic today. He's a champion for public education and for working families. #AFTvotes", "2018-09-15T20:21:15.000Z": "I had a great time getting the crowd fired up at a Metro East Labor Rally with Treasurer @mikeforillinois , State Rep. Jay Hoffman and so many others! Unions built the middle class - that's why we're fighting for them to succeed.", "2018-09-15T17:55:32.000Z": "We can't take this election for granted. That's why I was so glad to speak at the @IEANEA board meeting and IFPE Local 4408 this morning. Juliana and I are ready to stand with state workers and public employees!", "2018-09-15T16:16:13.000Z": "Today is the start of #HispanicHeritageMonth ! Juliana and I look forward to celebrating the contributions of the Hispanic community and recognizing the many ways they have enriched our communities.", "2018-09-15T14:08:05.000Z": "We were proud to join @ChuyForCongress , @RepGutierrez , @susanamendoza10 , @RepArroyoIL and many others.", "2018-09-15T14:08:03.000Z": "We were so excited to attend a meet and greet with the Latino community last night! In the last few years we've seen unprecedented attacks on the Latino community in Illinois, and we need to make sure that they have representation and a voice in Springfield.", "2018-09-14T15:56:32.000Z": "Trust me, I'm the lucky one to have a friend like @TyroneGayle - but thank you very much for your support! Quote Tweet JB Pritzker @JBPritzker I think we all would feel really lucky to have a friend like @JesseLehrich . I'm proud to donate to help out @TyroneGayle and his family. I hope you'll consider donating too: https:// gofundme.com/gayle-nation . Good luck in the #ChicagoMarathon , Jesse!", "2018-09-14T15:35:37.000Z": "I'm proud to work on the campaign to elect @JBPritzker as our next governor for the State of Illinois. This election is critically important for all of us! Quote Tweet Emma Fiander @emfiander Thank you to @JamesCappleman (and Jean Marie and Larry!) for coming out to make calls for #TeamJB ! He understands we need to do everything we can to help elect Democrats up and down the ballot to bring real change to Illinois!", "2018-09-14T17:15:53.000Z": "This morning, Juliana and I spoke at the historic @CityClubChicago about our vision for mental health care in Illinois and the kind of leaders we will be in Springfield.", "2018-09-14T16:16:45.000Z": "The intensity of #HurricaneFlorence is a reminder that climate change is making extreme weather events more frequent and severe. We need to step up efforts to make our state more resilient and less vulnerable to the devastating effects of climate change; it's long overdue.", "2018-09-14T16:16:44.000Z": "My thoughts are with those affected by #HurricaneFlorence . Please observe all safety precautions and listen to the advice of emergency personnel. I urge anyone who is able to donate to hurricane relief to do so here: I just gave! Join us! Contribute today. secure.actblue.com", "2018-09-14T15:14:37.000Z": "I think we all would feel really lucky to have a friend like @JesseLehrich . I'm proud to donate to help out @TyroneGayle and his family. I hope you'll consider donating too: https:// gofundme.com/gayle-nation . Good luck in the #ChicagoMarathon , Jesse! 26.2 for TOG organized by Jesse Lehrich For those who don't know Tyrone, let me try to quickly describe him (though that's an impossible task)...  Jesse Lehrich needs your support for 26.2 for TOG gofundme.com", "2018-09-14T13:30:00.000Z": "The only thing @BruceRauner has learned from his four years in office is how to shift blame and avoid responsibility. We can't afford another four years of his disastrous decision-making. We need new leadership in Springfield.", "2018-09-13T19:33:16.000Z": "Lie after lie, @BruceRauner has tried to deceive Illinoisans in an attempt to hide his failures. APNewsBreak: Private Business Meeting on Rauner's Calendar Gov. Bruce Rauner's scheduler set up a May 2015 meeting at the Executive Mansion with a former business partner who claims in a lawsuit they discussed a personal business deal. usnews.com", "2018-09-13T19:24:50.000Z": "REALITY CHECK: By his own standards, @BruceRauner is a \"miserable failure\" on jobs. https:// jbpritzker.com/reality-check- bruce-rauner-miserable-failure-jobs-according-standards/ ", "2018-09-13T19:22:39.000Z": "As a result of @BruceRauner's budget crisis, the state bill backlog tripled. http:// chicagotribune.com/news/local/pol itics/ct-illinois-unpaid-bills-20171010-story.html   #twill Billions in Illinois bills not sent for payment A review obtained by The Associated Press shows $7.5 billion worth of unpaid bills hadn't been sent to the official who writes the checks by the end of June. chicagotribune.com", "2018-09-13T19:20:09.000Z": "I will fight for a fair tax so that the middle class and those striving to get there pay less. @BruceRauner can try to twist this all he wants but the fact is: Rauner's tax plan will hurt working families. PolitiFact - Rauner distorts Dems' message on Illinois income tax PolitiFact is a fact-checking website that rates the accuracy of claims by elected officials and others on its Truth-O-Meter. politifact.com", "2018-09-13T19:18:36.000Z": "Every child in Illinois deserves a quality education, and as governor I will invest in K-12 to make sure that every child has the tools they need to succeed. Early Childhood Education - JB Pritzker for Governor jbpritzker.com", "2018-09-13T19:13:30.000Z": ".@BruceRauner, courage is taking responsibility. This isn't courage.", "2018-09-13T01:02:52.000Z": "Had an incredible and inspiring time at the #TeamJB GOTV Training. This team is ready to #JBtheChange and close the last weeks out strong to win for @JBPritzker , @JulianaforLG , and Democrats up and down the ticket.", "2018-09-13T01:18:48.000Z": "This evening I stopped by Bill Lowry's phone bank and talked with volunteers and supporters about his ideas for Cook County. I know Bill, and he has the vision and the fight to be a great commissioner. Let's get him and other progressive leaders elected in November!", "2018-09-12T21:29:12.000Z": ". @JBPritzker knows that Brett Kavanaugh poses a very real threat to #RoevWade - that's why he did not hesitate to come out in opposition to Kavanaugh's nomination. This is one of many reasons that J.B. is the leader Illinois needs. Pledge to vote today → http:// bit.ly/PPIAGov", "2018-09-12T20:02:24.000Z": "The energy of these incredible organizers at yesterday's get-out-the-vote training with @JBPritzker and @JulianaforLG truly inspired me! With your help, we are going to make the #BlueWave a reality this November.", "2018-09-12T17:20:14.000Z": "Clean energy is on the ballot in 2018, and I'm proud to be one of @LCVoters  #CleanEnergyForAll candidates. I'm committed to putting our state on the path towards 100% clean, renewable energy. Over 1,400 Candidates Nationwide Make 'Clean Energy for All' Commitment to 100 Percent Clean Energy... San Francisco, California - As leaders from around the country and the world gather in San Francisco this week for the Global Climate Action Summit, the League of Conservation Voters (LCV) Action... lcv.org", "2018-09-12T00:49:05.000Z": "For over 20 years, Juliana has been the proud owner of a small business. I was honored to help build @1871Chicago , a small business incubator that has brought thousands of jobs to Illinois.", "2018-09-12T00:49:04.000Z": "This evening, Juliana and I met with small business owners in Chicago to discuss our economic inclusion plan, and how we can better support small businesses across our state.", "2018-09-11T15:11:42.000Z": "17 years ago on #September11th , our lives were changed forever as our nation watched a horrific terrorist attack take place in our own country. Today is about honoring the lives lost and remembering the acts of heroism and patriotism that took place that day. #NeverForget", "2018-09-10T21:13:52.000Z": "Thank YOU, @JBPritzker .  More than just trusting your history of creating good jobs, I see it proven every day with every startup company I meet in Chicago. You are a leader but also a strong believer in others, and have inspired so many to pursue their dreams, including me :) Quote Tweet JB Pritzker @JBPritzker Thank you, @rumimorales for trusting my diverse history in job creation to get Illinois back on track! To repair the damage Rauner has done to Illinois, we need a governor in office who will fight for our state, not turn their back on it - I'm excited to be that leader.", "2018-09-10T18:00:00.000Z": "Thank you, @rumimorales for trusting my diverse history in job creation to get Illinois back on track! To repair the damage Rauner has done to Illinois, we need a governor in office who will fight for our state, not turn their back on it - I'm excited to be that leader.", "2018-09-10T17:06:47.000Z": "A message from my niece, Emma. She wants @JBPritzker and @JulianaforLG to see this. #JBTheChange  #BlueWave", "2018-09-10T15:06:18.000Z": "It will be great to have a Governor like @JBPritzker who will make community mental health and substance abuse treatment services a top priority,. #twill Quote Tweet JB Pritzker @JBPritzker Mental health care is always something that should be prioritized. On #WorldSuicidePreventionDay let's recognize the life-saving resources that help raise awareness of warning signs and assist people struggling. No one needs to suffer alone. https:// suicidepreventionlifeline.org", "2018-09-10T15:00:01.000Z": "Mental health care is always something that should be prioritized. On #WorldSuicidePreventionDay let's recognize the life-saving resources that help raise awareness of warning signs and assist people struggling. No one needs to suffer alone. https:// suicidepreventionlifeline.org", "2018-09-10T13:13:26.000Z": "Our endorsed pro-equality statewide ticket for Nov. 6: @JBPritzker  @JulianaforLG  @KwameRaoul  @susanamendoza10  @MikeforIllinois and Jesse White! #LGBTQ  #election  #fairness  #Illinois  #twill  #equality", "2018-09-10T00:10:00.000Z": "L'Shanah Tovah! From my family to yours, have a happy and sweet new year! #RoshHashanah", "2018-09-09T19:12:34.000Z": "#TeamJB had the best time marching in the 49th Annual Mexican Independence Day Parade this afternoon! We were so proud to celebrate the Mexican community and walk alongside Rep. @LuisGutierrez , @SenatorSandoval, State Sen. @CastroforIL22 and so many others!", "2018-09-09T16:18:06.000Z": "I started off my Sunday at services at @roabc and later, Proviso Missionary Baptist Church!", "2018-09-08T20:47:59.000Z": "I loved going to the Annual Celebration of Education Jamboree with @AldermanHarris this afternoon! It's always great to see communities come together to celebrate and make sure that students are ready to go back to school. Thanks for having me!", "2018-09-08T17:20:27.000Z": "So blessed to make it another year! This birthday, I'm grateful for the gift of amazing parents, mentors, and teachers who taught me early on that my voice is powerful and that #RepresentationMatters .", "2018-09-08T17:30:16.000Z": "Happy birthday to someone who brings so much life and passion to this campaign, and to all of our lives. @JulianaforLG , you're a role model - I'm thankful to have you as a partner in this race, and to be able to call you a friend.", "2018-09-08T16:33:02.000Z": "Great group of volunteers making calls in support @JBPritzker and@JulianaforLG  this morning!", "2018-09-08T02:52:04.000Z": "This evening I attended the 7th Annual Penny Severns Memorial Reception in Macon County with US Senator @DickDurbin , Comptroller @susanamendoza10 , Treasurer @mikeforillinois and so many others. We're putting all of our efforts towards getting Democrats elected all over the state!", "2018-09-07T23:07:56.000Z": "IL State Rep. Julianna Stratton. @JulianaforLG is running for Lt. Gov. along with JB Pritzker as Gov. Julianna is a super candidate and very worthy of recognition. #BlackBoldPolitical", "2018-09-07T22:49:22.000Z": "President @BarackObama 's legacy is a great reminder of the power of voting, and what hope and change can bring. Your vote in November is more important now than ever - we have a chance to make a real difference in Illinois, but we need your help to do it.", "2018-09-07T22:49:21.000Z": "Now, this was an amazing way to spend an afternoon. @JulianaforLG and I had a blast visiting a coffee shop in Urbana with President @BarackObama today. We've had so much fun on the campaign trail this year, and grabbing coffee with President Obama has definitely been a highlight.", "2018-09-07T14:59:27.000Z": "Thank you for helping us sweep the blue wave across Illinois, Laura! We look forward to seeing more leaders like you in Springfield. Quote Tweet Laura Fine for State Senate (IL-9) @Laura4Illinois A big thank you to the @JBPritzker staff and volunteers for hosting Bluewave night! Looking forward to continuing to work together! #bluewave", "2018-09-06T22:19:11.000Z": "Signed up & will be rocking the vote this November, @JBPritzker  #RockTheVote", "2018-09-06T21:31:45.000Z": "What's next? Come join #TeamJB and help us get other Illinoisans, like you, registered to vote! https:// jbpritzker.com/volunteer/ Quote Tweet Christina @ChristiMarie449 Look what I did today, now what's next?\n\nI live in the Chicago suburbs & would love ideas to become more politically active in my area and state. @JBPritzker  #election2018  #RockTheVote", "2018-09-05T19:40:36.000Z": "Congratulations to @JBPritzker and @JulianaforLG on the Equality Illinois endorsement. Well deserved for your long and strong  support of the LGBT community and our families Quote Tweet Equality IL PAC @EQILPAC We are proud to endorse @JBPritzker for Governor & @JulianaforLG for Lieutenant Governor in the #Illinois General #Election on November 6. #Pritzker has lead out front on #LGBTQ civil rights for decades, & we believe he will continue to do so as Governor. http:// tinyurl.com/EI-PAC-Pritzker", "2018-09-06T18:15:40.000Z": "Students and teachers across Illinois have headed back to school these last few weeks, but many are still feeling the effects of @BruceRauner's 736-day budget crisis. Our schools shouldn't have to suffer because of this failed governor.", "2018-09-06T16:25:33.000Z": "I'll admit she's a much better dancer too! Quote Tweet Senator Sara Feigenholtz @SenatorSara6 @JBPritzker  @JulianaforLG This is hilarious. SORRY JB she is slightly funnier and designs her own dresses. twitter.com/JBPritzker/sta", "2018-09-05T19:02:00.000Z": "Have you ever wondered what Juliana's favorite dance move is? What about my best dad joke (there are almost too many options!)? Find out the answers, as Juliana and I answered some of the most important questions of the election!", "2018-09-05T15:59:02.000Z": "Replying to @JBPritzker  and  @fred_guttenberg It was an honor meet you last month in Champaign-Urbana, JB! These @MomsDemand volunteers are proud to support a Gun Sense Candidate who will keep working alongside activists like @fred_guttenberg to reduce gun violence.", "2018-09-05T16:06:49.000Z": "We are proud to endorse @JBPritzker for Governor & @JulianaforLG for Lieutenant Governor in the #Illinois General #Election on November 6. #Pritzker has lead out front on #LGBTQ civil rights for decades, & we believe he will continue to do so as Governor. http:// tinyurl.com/EI-PAC-Pritzker", "2018-09-05T17:01:08.000Z": "Juliana and I are so honored to have the support of @EQILPAC . Illinois' diverse LGBTQ community deserves to be heard and have a real partner in the governor's office who will stand up to hate and empower every person in our state.", "2018-09-05T15:53:33.000Z": "Juliana and I were honored to meet Fred back in June. We were proud to meet an advocate that's turned his own unspeakable tragedy into activism, and has become a source of hope for families of victims of gun violence. He deserves better.", "2018-09-05T15:51:59.000Z": "This picture says so much. Yesterday, Brett Kavanaugh ignored the handshake of @fred_guttenberg , the father of Jaime Guttenberg, a Parkland victim. Quote Tweet Andrew Harnik @andyharnik Fred Guttenberg, the father of Jamie Guttenberg who was killed in the shooting in Parkland, Fla., left, tries to shake hands with @realDonaldTrump 's Supreme Court nom., Brett Kavanaugh, right, during a lunch break. Kavanaugh did not shake his hand. (AP Photo/Andrew Harnik) @ap", "2018-09-05T01:23:01.000Z": "This evening I attended the Lake County Democrats' Blue Wave Rally. With only 63 days left, I was excited to see so many enthusiastic Democrats that are ready to get out the vote!", "2018-09-04T18:14:52.000Z": "We can't count on Bruce Rauner to be a voice for Illinoisans and stand up to Trump and this Supreme Court nomination. With so much at stake, we need to get Democrats in office that will stand up for our communities, fight back and defend our rights.", "2018-09-04T15:07:23.000Z": "Brett Kavanaugh's unjust confirmation hearings begin today. His shaky record has shown that in the #SupremeCourt he will be an ally to Trump - we can't trust him to protect our rights. There is too much at risk to sit on the sidelines. We must #ResistKavanaugh .", "2018-09-04T01:43:02.000Z": "@JBPritzker Thanks for inspiring this young democrat! She loved meeting you. Thanks for taking the time! #voteforJB", "2018-09-04T01:05:58.000Z": "We ended the day at the African Festival of Arts in Chicago, where we had a great time celebrating and learning about the contributions of African cultures.", "2018-09-03T18:42:36.000Z": "Peyton showing ... @JBPritzker  her JB bear @ the Labor Day Union Picnic!", "2018-09-03T22:10:40.000Z": "Thank you @AFFILeg for the amazing show of support for @JBPritzker and @JulianaforLG on Labor Day in Granite City!  Thank you to the fire fighters and their families for your public service.", "2018-09-03T21:17:18.000Z": "Next, we made our way to the 51st annual @RICoDemocrats Salute to Labor event. In Springfield, Juliana and I will always be allies to working families across Illinois.", "2018-09-03T19:45:50.000Z": "Today, Juliana and I reaffirmed our commitment to hardworking Illinoisans, and signed the @ILAFLCIO 's Contract with the Middle Class. We believe in protecting collective bargaining rights, equal pay for equal work, and expanding access to affordable healthcare. #LaborDay", "2018-09-03T18:33:32.000Z": "Happy #LaborDay from #TeamJB ! Proud to represent @JBPritzker & @JulianaforLG with the @ChampaignCoDems ! #JBtheChange", "2018-09-03T17:53:26.000Z": "Excited for ... @JBPritzker  and ... @JulianaforLG  at the taste of Polonia #BlueWave2018", "2018-09-03T17:38:28.000Z": "Juliana and I kicked off our Labor Day at the Support Working Peoples Freedom parade in Peoria! We were so proud to walk alongside Peoria County Dems, Rep. @CheriBustos , Comptroller @susanamendoza10 , Treasurer @mikeforillinois , and State Sen. @KwameRaoul .", "2018-09-03T17:03:39.000Z": "Amazing turnout and enthusiasm as we marched in the capital city for @JBPritzker and @JulianaforLG at todays Springfield & Central Illinois Trades and Labor Council Parade while celebrating the achievements of working people!! #JBthechange", "2018-09-03T16:25:00.000Z": "Happy #LaborDay ! Working families across our state are better off today because of the tireless work of the labor movement, and on Labor Day, let's celebrate the progress we've made and get ready for the fight ahead.", "2018-09-02T23:12:29.000Z": "Internships are a great way to get involved with the campaign while earning some college credit! If you're interested in helping us sweep the Blue Wave across Illinois, #TeamJB might be right for you. Join us: https:// jbpritzker.com/internships/", "2018-09-02T00:51:07.000Z": "Our fantastic Fellow Josh and dear volunteer Sandy met the two candidates they know are fighting for them and their values this Midterm Election. Find your local organizer & join us in the fight as a Fellow or Volunteer:  https:// go.jbpritzker.com/page/s/organiz ingfellow ", "2018-09-02T18:30:12.000Z": "Congrats, California! Let's make sure that Illinois is next in protecting a free and open internet. #NetNeutrality  https:// nytimes.com/2018/08/31/tec hnology/california-net-neutrality-bill.html ", "2018-09-01T21:43:48.000Z": "Thanks for marching today @JBPritzker and @JulianaforLG Happy #Labor Day!", "2018-09-02T01:00:19.000Z": "We ended the day at a rally hosted by the Will County Dems and @Teamsters Local 179! Juliana and I are ready to get out the vote for other pro-labor candidates who will fight for you in Congress and in Springfield -we hope you'll join us!", "2018-09-01T21:43:15.000Z": "Next, we met State Sen. @KwameRaoul , Rep. @Foster4Congress , @LUnderwood630 and many others at the @AuroraDemocrats Salute to Labor rally.", "2018-09-01T20:15:55.000Z": "Afterwards, we joined the 10th Ward Friends of Labor Festival and showed our support for worker's rights!", "2018-09-01T18:30:16.000Z": "Juliana and I kicked off our Labor Day weekend at the 10th Ward Labor Day Parade! We're excited to spend the weekend honoring labor and working families across Illinois. Thank you to everyone that came out and marched with us!", "2018-09-01T18:01:14.000Z": "This sounds familiar @GovRauner ? Quote Tweet Lisa Desjardins @LisaDNews President Trump about the campaign:  I wasn't in charge, people like to say that, but I wasn't in charge.", "2018-09-01T17:42:22.000Z": "Enjoyed stopping by the Taste of Melrose Park before the rains came last night and seeing my friends, Bellwood Mayor Andre Harvey and Democratic Nominee for Illinois Governor @JBPritzker !  Great event put on by Mayor Ron Serpico and the Village. Food and fun all weekend long!", "2018-09-01T01:03:26.000Z": "Juliana and I loved spending some time at the Taste of Melrose Park this evening!", "2018-08-31T20:46:55.000Z": "I kicked off this Friday visiting Montclare Senior Residences with @AldermanHarris ! Thank you to all the residents that took time to talk to me about their hopes for Illinois (and of course, their love for @JulianaforLG )!", "2018-08-31T18:30:00.000Z": "#FridayFeeling", "2018-08-31T02:17:26.000Z": "Got to meet the next governor of IL @JBPritzker and hear about his plans for the state! Thanks @IndivisibleChi !", "2018-08-31T15:30:00.000Z": "After six days, over 20 stops, and nearly 1,400 miles, we brought our third #ThinkBigTour to a close a few weeks ago. Juliana and I feel so lucky that we were able bring Democrats together and meet Illinoisans in 21 counties across the state - check out some of our highlights!", "2018-08-31T01:56:35.000Z": "Thank you to @IndivisibleChi for hosting such a great meet and greet. In Springfield, Juliana and I will always fight to protect and defend the rights of Illinoisans by ending things like the unsafe and wasteful Crosscheck Program. We appreciate your support!", "2018-08-30T18:30:17.000Z": "AMVOTE PAC was delighted to host a special Meet & Greet Reception with JB @JBPritzker last night. It was a wonderful event and great opportunity for our community to meet the next Governor of Illinois! Quote Tweet JB Pritzker @JBPritzker I ended the day at a meet and greet hosted by @amvotepac . I'm proud to be endorsed by an organization that understands: our strength is in our diversity and we need leaders in Springfield that not only understand this, but will also resist any racist or bigoted agendas.", "2018-08-30T16:00:02.000Z": "There are less than 10 weeks until election day and we need all hands on deck. #TeamJB knows that when everything we value is on the line, it's the time to stand up for what we believe in. Join the team that's ready for the fight in November: https:// jbpritzker.com/volunteer", "2018-08-30T02:32:03.000Z": "I ended the day at a meet and greet hosted by @amvotepac . I'm proud to be endorsed by an organization that understands: our strength is in our diversity and we need leaders in Springfield that not only understand this, but will also resist any racist or bigoted agendas.", "2018-08-30T01:53:59.000Z": "Today we opened our 25th field office in Beverly! Our volunteers and organizers are so excited to begin knocking on doors and getting to know the people of Beverly better - sign up to join us: https:// jbpritzker.com/volunteer/", "2018-08-29T20:01:10.000Z": ". @JulianaforLG and I were proud to stand in solidarity with labor at the @chicagoaflcio luncheon this afternoon. Despite attacks from the governor and disappointing Supreme Court rulings, we are as committed as ever to defending the rights of labor in Illinois.", "2018-08-29T15:05:58.000Z": "@BrookfieldAle was packed last night as we welcomed @JBPritzker to Brookfield IL!! Thank you to ALL who attended!! So proud to co-host this event with @brookfield_dems and Lyons Township Dems!! Now is the time for all shades of blue to unite!!! @IndivisibleIL", "2018-08-29T14:47:03.000Z": "Young, selfless entrepreneurs like Emerson are what make Illinois so great. Her fight for equality, even on the playground, is something we all can admire and learn from. Keep up the great work, Emerson! We're rooting for you. Illinois girl runs lemonade stand to raise money for playground for kids with special needs HIGHLAND, Ill. - A young girl is using a lemonade stand to raise money so a playground can be built for her brother and sister, both of whom have special needs. Emerson Daley, 6, and her crew wgntv.com", "2018-08-29T01:22:28.000Z": "This evening I discussed our commitment to protecting labor at the @IUBAC Local 21's Annual Meeting. This election is about beating a failed governor who attacks working families. Together, we can get Springfield back on the side of Illinoisans.", "2018-08-28T23:11:44.000Z": "I had a great time at a meet and greet with @Indivisible347 today! I was so excited to be around energized Democrats who are ready to get out the vote and get progressive leaders elected in all 102 counties in our state.", "2018-08-28T17:15:00.000Z": "Kristi is a great entrepreneur,  philanthropist, and friend.  I'm proud to have her confidence and as governor, I look forward to fighting for more small businesses like hers to succeed.", "2018-08-28T15:33:28.000Z": "", "2018-08-27T00:26:42.000Z": "Thanks to Homer and his daughter Michelle, who canvased 12 businesses today for @JBPritzker @RepStratton5 @KwameRaoul . #JBTheChange", "2018-08-27T11:56:31.000Z": "@JBPritzker future voters", "2018-08-27T14:00:02.000Z": "I hope kids like Mia are inspired seeing all the incredible women like @LUnderwood630, @BetsyforIL , @RichardsMCClerk (and of course, @JulianaforLG ) running for office, and will consider adding their names to the ballot one day.", "2018-08-26T22:14:30.000Z": "As governor, I will fight for our state and support 100% clean, renewable energy.", "2018-08-26T22:14:28.000Z": ". @realDonaldTrump 's move to repeal the #CleanPowerPlan is shameful, but not surprising. A clean energy economy will bring investments and high-paying jobs to our state, yet Trump and Rauner are rejecting this. Trump throws coal plants a lifeline, but Illinois among states showing no signs of turning back President Donald Trump is proposing to gut the centerpiece of the Obama administration's plan to fight climate change, but Illinois and many other states already are shifting away from dirty coal to... chicagotribune.com", "2018-08-26T20:33:39.000Z": "You want signs? We've got SIGNS. I couldn't have asked for a better group of volunteers on day 2 of #WeekendofAction . We're looking forward to making some real change in Illinois by electing @JBPritzker this November! #TeamJB  #JBtheChange  #BlueWave", "2018-08-26T21:02:33.000Z": "Later in the afternoon I attended a @MomsDemand meeting for Kane and Kendall County. I'm incredibly proud to be a Moms Demand Gun Sense Candidate. I know that with support from organizations like Moms Demand Action, we can get sensible gun violence prevention laws passed.", "2018-08-26T19:48:24.000Z": "It's hotter outside than canvasser Marty Schmidt's Hawaiian shirt, but my cool volunteers are dialing up a storm  #TeamJB  #WeekendofAction", "2018-08-26T19:40:55.000Z": "I loved stopping by our St. Charles canvass kick off! Thank you to all the organizers and volunteers for coming out to knock on doors this weekend. Juliana and I are always inspired after reading your tweets about the connections you all are making - keep up the good work!", "2018-08-26T18:40:12.000Z": "Later, I met with several fellow Democratic candidates at an ice cream social with the Kendall County Democrats! We're all determined to sweep a blue wave across Illinois and get Democrats elected up and down the ticket in November.", "2018-08-26T17:21:47.000Z": "This morning @RepKifowit , @SenatorHolmes , and I went to at Alden Gardens to talk to some seniors about the kind of leadership they want to see in Springfield.", "2018-08-26T16:31:47.000Z": "Today, #WomensEqualityDay marks the 98th anniversary of the 19th Amendment. I'm proud to stand alongside the many women that are leading the fight for equality. We need to ensure that women, especially women of color, are always given an equal opportunity to succeed in Illinois.", "2018-08-25T23:43:57.000Z": "We had a blast marching in the DuQuoin State Fair parade with @JBPritzker and @JulianaforLG", "2018-08-26T01:47:44.000Z": "MK and I send our deepest thoughts and prayers to the McCain family. Senator John McCain was a hero and an unwavering leader. His commitment to public service, his dedication to family, and his military career will forever inspire us, and millions around the world.", "2018-08-25T17:39:52.000Z": "What a wonderful Saturday to knock some doors and talk to voters here in Lemont and talk about what @JBPritzker will do to move Illinois forward. It was great to have @VoteBridgetFitz come out as we try to elect Democrats up and down the ticket. #JBtheChange", "2018-08-25T23:22:46.000Z": "I ended the day at the Taste of @Thorntontwp ! I loved meeting you all, discussing our plans to defeat Bruce Rauner, and learning about what makes Thornton Township so special.", "2018-08-25T22:15:08.000Z": "The back to school celebrations continued at @AldermanBurnett 's 24th Annual Stay in School Picnic. Events like these are so important for getting students the supplies they need to get started off on the right foot for the school year.", "2018-08-25T20:48:56.000Z": "All smiles for getting the word out about @JBPritzker and turning DuPage blue! #BlueWave  #JBtheChange  #WeekendOfAction", "2018-08-25T20:14:18.000Z": "I had so much fun celebrating back to school season at the First Church of Deliverance's carnival and Summer Fest West with @aldPatDowell3rd , Rep. Conyears-Ervin, and @aldermanervin !", "2018-08-25T18:15:24.000Z": "Afterwards I stopped by the Paul G. Stewart Family Palooza to meet with @AldPatDowell3rd and talk to residents in the community.", "2018-08-25T16:34:12.000Z": "This morning I attended the 4th Ward Annual Healthcare Fair. I'm so proud to attend an event that works to provide health care resources in the 4th Ward community. Thanks for showing me around, @aldsophiaking !", "2018-08-25T16:22:54.000Z": "US House candidate, IL-17 At the start of a Day of Action for the @JBPritzker Governor campaign this morning in Peoria. This little pup, Isabella, helped get our day off to a good start.", "2018-08-25T00:54:51.000Z": "This evening, we marched in the Du Quoin Twilight Parade! It's no secret that Juliana and I love marching in parades, and this one was no exception. Thank you to all the volunteers that came out and joined us!", "2018-08-24T21:43:17.000Z": "Afterwards, we attended an Agriculture Roundtable in Marion, where we spoke with farmers about the challenges they have faced and how we can be better partners in Springfield to ensure that our agricultural economy stays one of the best in the US.", "2018-08-24T19:41:35.000Z": "Our next stop was the Union County Fair! We had so much fun stopping by the fair and meeting you all!", "2018-08-24T16:15:44.000Z": "It was an honor to speak alongside @JBPritzker , @JulianaforLG , @MikeforIllinois , @susanamendoza10 , @JesseWhite2018 and many others at the Jackson County Democrats' Annual Dinner last night. Let's work hard together to win in November! #BlueWave", "2018-08-24T17:05:58.000Z": "Today, Juliana, MK and I took a tour of the @Centerstone facility in Carterville. Health care providers, like Centerstone, have been devastatingly impacted by the budget crisis. As governor, I'll fight to ensure they have the resources needed to continue their critical services.", "2018-08-24T14:59:36.000Z": "Welcome JB and Juliana to Southern Illinois! @JBPritzker and @JulianaforLG visited the Laborers' Training Center in Marion this morning to tour the facility. They know that skilled labor will be the key to rebuilding the middle class in Illinois.", "2018-08-24T15:26:15.000Z": "Juliana and I started off the day stopping by a class at the Illinois Laborers' and Contractors Joint Apprenticeship and Training Program. We spoke with students about the projects they're working on and the benefits of the program.", "2018-08-24T13:09:40.000Z": "Yesterday ended with Juliana, our friends Sec. of State @JesseWhite2018 , Comptroller @susanamendoza10 , Treasurer @mikeforillinois , and many others at the Jackson County Democrats' Annual Dinner where we spoke about our plans to bring real leadership back to Springfield!", "2018-08-23T22:20:37.000Z": "Later, I was joined by State Sen. @KwameRaoul at a meet and greet with @DemocratsMarion !", "2018-08-23T19:21:01.000Z": "Afterwards, I made my way to a meeting with the Fayette County Democrats. This election is about electing Democrats up and down the ballot in all 102 counties in Illinois, and I'm confident that with the enthusiasm in rooms like this, we will do that.", "2018-08-23T16:44:04.000Z": "Good to have @JBPritzker in Montgomery Co this morning w/ a big crowd of supporters! #IL48", "2018-08-23T16:33:41.000Z": "My first stop today was in Hillsboro at a meet and greet with the Montgomery County Democrats!", "2018-08-23T15:30:38.000Z": "Over the next couple of days, @JulianaforLG and I are headed back downstate to meet more Illinoisans and learn about the issues that matter most to you. We hope you'll come out and meet us!", "2018-08-23T01:25:09.000Z": "This evening I spoke at the @ILFarmBureau forum to discuss our priorities in the agricultural community. Our state's farmers are major job creators that contribute so much to the economy. As governor, I will fight to ensure that our farmers have a thriving agricultural economy.", "2018-08-22T15:30:00.000Z": "Juliana and I are proud to have the confidence of so many great supporters and friends. They know our priorities, they know our character, and they know that we'll always fight for Illinoisans, no matter what.", "2018-08-21T23:50:56.000Z": "Indivisible Illinois is proud to endorse @JBPritzker . #Indivisible  @IndivisibleTeam", "2018-08-21T19:00:01.000Z": "Thanks for the kind words, Bridget and Sofia! I've been proud to call myself a feminist and march for women's rights my entire life. Juliana and I know what's at stake for women in November and we will never stop fighting for equality.", "2018-08-21T15:45:00.000Z": "Juliana and I are incredibly proud to receive the endorsement of @IndivisibleIL . Organizations like Indivisible Illinois give me hope for the future of our state and I'm so honored to have their support as we take on Bruce Rauner in the fall.", "2018-08-21T14:24:43.000Z": "To all those celebrating Eid al-Adha this year, #EidMubarak ! MK, Juliana, and I hope you have a blessed day filled with family and friends.", "2018-08-20T14:32:41.000Z": "I was proud to play a role in his historic presidency when I led the White House Summit on Early Childhood Education, and I'm proud to have his endorsement in this election. I look forward to fighting to preserve and build on his legacy as Illinois' next governor.", "2018-08-20T14:31:12.000Z": "President Obama has done so much to move our country forward: expanding healthcare for millions, leading our country out of the Great Recession, and standing up as a model of leadership and integrity for millions across our great state and nation.", "2018-08-20T14:29:50.000Z": "Juliana and I are incredibly honored to have the support of President @BarackObama as we fight for the values that defined his presidency.", "2018-08-19T17:30:00.000Z": "We're making sure Democrats have the resources they need to win in November. Will you join us? Donate to Blue Wave Illinois 2018 and help get Democrats elected up and down the ticket! Support Blue Wave Illinois 2018 Join us! Contribute today. secure.actblue.com", "2018-08-18T18:25:11.000Z": "Local 73 members are knocking on doors now supporting @JBPritzker for governor of IL. JB will stand up 4 workers' rights.", "2018-08-18T16:03:05.000Z": "We're fighting to get Springfield back on the side of working families and we need your help. Come join our team as a Fall Organizing Fellow! https:// go.jbpritzker.com/page/s/organiz ingfellow ", "2018-08-17T22:04:29.000Z": "We're glad to have someone as passionate as Bebe on #TeamJB ! Quote Tweet Perry Ter Molen @perry_ter Last night I had the huge pleasure of introducing Bebe, who is 93, to her first time volunteering for a campaign! She's determined to make a change in Illinois that will last for generations! @JBPritzker  #JBTheChange  @OP_Dems", "2018-08-17T20:43:59.000Z": "US Senate candidate, IL Great time with the @McLeanCoDems on my way to the State Fair! Thanks for having @JBPritzker and I, and for all your work to elect him the next Governor of Illinois.", "2018-08-17T18:04:43.000Z": "Nikita, we were so glad to see you again this past week. You're going to make a great leader and County Clerk for the people of McLean County! Quote Tweet Nikita Richards @NRichardsIL Yes, I'm crying right now and my friends and I have lost our voices from screaming because THIS candidate for McLean County Clerk was just personally highlighted in this room of 3000 people by our next IL Governor JB Pritzker and placed in the ILDCCA promotional video. Show this thread", "2018-08-17T15:30:01.000Z": "I think it's safe to say: #TeamJB definitely had the most fun at the #BudBilliken Parade last weekend! Thank you to all the volunteers that came out, marched, danced, and cheered with us. We had a great time taking part in this historic Chicago tradition!", "2018-08-16T18:56:43.000Z": "Obligatory state fair photo w our next governor @JBPritzker !", "2018-08-16T22:00:01.000Z": "That's a wrap! Our third #ThinkBigTour is officially over. Juliana and I want to thank you all for coming out to meet us and our friends, getting fired up to elect Democrats across Illinois, and making this #ThinkBigTour the best one yet. See you soon!", "2018-08-16T19:59:08.000Z": "Our final stop of the #ThinkBigTour was the @ILStateFair , where Juliana and I hosted a reception at the Budweiser Tent! We had a blast enjoying Democrats' Day at the fair and meeting you all. We can't wait to go to the fair again (on Governor's Day) next year!", "2018-08-15T21:11:05.000Z": "My Volunteers are amazing! Ms. Ella was so thrilled to meet @JBPritzker at our Alton Office yesterday that she messaged me and said \"he's sooo down earth! And @JulianaforLG energy was amazing! I was like you go girl!\"", "2018-08-16T17:09:23.000Z": "Honored to stand alongside an amazing democratic ticket at the IDCCA Brunch this morning. Let's take the fight to every county in Illinois! @JBPritzker  @JulianaforLG  @JesseWhite2018  @KwameRaoul  @ILDCCA  #twill", "2018-08-16T16:47:49.000Z": "We were inspired and motivated by the words of Secretary of State @JesseWhite2018 , Comptroller @susanamendoza10 , State Sen. @kwameraoul , State Rep. @repcurrie , and U.S. Senator @DickDurbin . We're all ready to get Springfield back on the side of Illinoisans.", "2018-08-16T16:47:48.000Z": "Juliana and I were so excited to start the last day of the #ThinkBigTour at the @ILDCCA 's Annual County Chairs' Brunch. We know what's at stake in November - women's rights, LGBTQ rights, the rights of unions and working families - and we're gearing up for the fight.", "2018-08-16T14:38:28.000Z": "An important election is coming up please join me in supporting @JBPritzker and the Democratic ticket. Also, remember to register to vote because if you don't vote you lose your gripe rights. -JW", "2018-08-16T01:25:33.000Z": "We ended Day Five at the @ildemwmn 's event!  I'm proud to stand alongside women across Illinois and call for equality. Juliana and I will always fight for women's rights, as we've done our entire lives, and make sure that across the state, their voices are heard.", "2018-08-16T00:13:21.000Z": "In the evening we attended the @ILAFLCIO Labor Appreciation event, and celebrated the labor community with allies Treasurer @mikeforillinois , Comptroller @susanamendoza10 , State Sen. @kwameraoul , @Kelly4SouthrnIL , and @lunderwood630.", "2018-08-15T21:20:08.000Z": "US House candidate, IL-13 Great to join @JBPritzker and Dems up and down the ticket in Decatur this afternoon! Thanks for having us.", "2018-08-15T21:30:59.000Z": "Our next stop was a meet and greet with the @maconcountydems ! Juliana, State Sen. @AndyManar , @MayorMooreWolfe , and I spoke about our priorities to invest in higher education and infrastructure in areas like Macon County.", "2018-08-15T19:32:43.000Z": "Later, Secretary of State Jesse White joined as we spoke to a great crowd of @ChampaignCoDems alongside State Sen. @ScottBennett52 . Only a failed governor could find something bad to say about Champaign. As we saw, the people are great and are fired up to get Democrats elected!", "2018-08-15T15:05:07.000Z": "Fired up for Democrats Day! @SenatorDurbin  @JBPritzker @RichardsMCClerk", "2018-08-15T16:31:37.000Z": "It's Day Five of the #ThinkBigTour ! We started the day off at a meet and greet with @McLeanCoDems . Juliana and I were excited to be joined by U.S. Senator @DickDurbin again, and to welcome @ErikRankin and @RichardsMCClerk to the tour!", "2018-08-15T01:02:10.000Z": "Yesterday was unbelievable! \nThanks to UAW Local 974 and all who came out to meet other Peoria residents, knock doors, and celebrate with a room full of Democratic volunteers, voters, and candidates  @JBPritzker  @susanamendoza10  #Day3  #ThinkBigTour  #PeoriaCounty", "2018-08-15T02:17:26.000Z": "We ended Day Four by listening to some inspiring speeches at the 7th annual Obama Dinner, hosted by the East St. Louis Democrats. Juliana and I were glad to participate in such an important event and share our plans for the future of Illinois. #ThinkBigTour", "2018-08-14T23:50:53.000Z": "Alton is ALL in for the fight and ready to unite. Thank you to our dedicated volunteers ready to elect @MikeforIllinois  @Kelly4SouthrnIL and @JBPritzker and @JulianaforLG . We are the #BlueWave !", "2018-08-15T00:03:45.000Z": "Afterwards, we brought U.S. Senator @DickDurbin and Treasurer @mikeforillinois along for a phone bank at our Alton field office! Our volunteers are one of our driving forces - thanks for being a part of #TeamJB ! #ThinkBigTour", "2018-08-14T22:50:26.000Z": "Later, we made our way to the Metro East Labor Rally. It was an honor to speak alongside U.S. Senator @DickDurbin , Rep. Jay Hoffman, and @Kelly4SouthrnIL about the importance of working families in our state and ways we can fight for them.", "2018-08-14T19:40:13.000Z": "Great to have @JBPritzker  @JulianaforLG  @MikeforIllinois back in #Taylorville . Our grassroots organization is growing every day in #IL48 . Democrats are fired up all over Downstate IL!", "2018-08-14T19:18:36.000Z": "Day Four of the #ThinkBigTour started off at a meet and greet with the Christian County Democrats, State Sen. @AndyManar , and @ClarkStateRep ! Thanks for joining us for Day Four!", "2018-08-14T18:11:05.000Z": "I appreciate your kind words, Maggie. We're happy to have you on the team. Quote Tweet Maggie @Maggie13194884 Replying to @alexhanns and @JBPritzker JB is one of the best human beings I know.   Just look at what he has done in his private life and what he proposes to do as governor.  Illinois desperately needs him as governor", "2018-08-14T15:06:28.000Z": "Yesterday, @BruceRauner vetoed HB 4572, an important anti-discrimination bill. Rauner has made it clear that he cannot be trusted to stand up for marginalized communities across our state. As governor, I will sign this legislation without hesitation. Quote Tweet Equality Illinois @EqualityILL BREAKING: Gov. Rauner vetoed significant legislation that would have strengthened the Illinois Human Rights Act's non-discrimination protections in the workplace. We condemn this veto. https:// equalityillinois.us/about-us/press -releases/equality-illinois-condemns-gov-rauners-veto-of-legislation-that-would-strengthen-illinois-non-discrimination-protections-in-the-workplace/   #LGBTQ  #HB4572  @WillGuzzardi  @LIUNAmidwest  @senatorcastro", "2018-08-14T01:40:37.000Z": "Day three of the #ThinkBigTour ended at the Truman Dinner hosted by the Schuyler County Democrats! We are fighting to elect Democrats up and down the ballot in every part of our state. Together we can sweep this blue wave across Illinois!", "2018-08-13T23:00:46.000Z": "Our next stop was a meet and greet with the Fulton County Democratic party! Bruce Rauner has continued to turn his back on our unions and state workers but we know with your support we can get him out of Springfield and get Illinois back on the side of hard working families.", "2018-08-13T21:17:33.000Z": "Later, we were joined by U.S. Senator @DickDurbin , Treasurer @mikeforillinois , and @SenatorKoehler at a meet and greet with @UAW Local 974. Juliana and I are proud to stand with Veterans and hardworking families and will fight to make sure your rights are protected.", "2018-08-13T19:15:19.000Z": "We canvassed East Moline today with a few very special guests! Honored to be joined by our democratic ticket for governor, @JBPritzker and @JulianaforLG , and our state Comptroller fighting everyday for us, @susanamendoza10 . We have listeners and fighters at the top of our ticket!", "2018-08-13T19:44:49.000Z": "There's no better way to start Day Three of the #ThinkBigTour than with some door knocking in East Moline and Peoria!", "2018-08-13T17:55:03.000Z": "Did anyone have more fun at #BudBilliken than us? Quote Tweet LEAR JET @lear_jet S/O TO THE COOLEST NEXT LT GOV OF IL @JulianaforLG HAVING FUN AT THE #BudBilikenParade IN #CHICAGO IT'S #TEAMJB ALL DAY", "2018-08-13T17:30:00.000Z": "Keep up the good work, Graham! It was great meeting you yesterday! Quote Tweet Graham Derfner @ghderfner What an honor to introduce @susanamendoza10  @JulianaforLG and @JBPritzker to the amazing Rock Island County volunteers. Phone calls today = success in November. Keep up the great work #quadsquad  #teamJB", "2018-08-13T15:24:16.000Z": "Thanks for coming along with us, Susana! We've got some more fun stops lined up on the #ThinkBigTour today. It'll be a blast! Quote Tweet Susana A. Mendoza @susanamendoza10 Greeting phone bankers at JB Pritzker's Quad Cities' campaign office! Thanks to them and all the other volunteers across the state who are working hard to get JB, Juliana, and the Democratic ticket elected. @JulianaforLG  @JBPritzker  #twill", "2018-08-13T01:44:46.000Z": "We ended Day Two of the #ThinkBigTour at a meet and greet with the @RICoDemocrats hosted by @Doug_DEM_House . Juliana and I always love visiting Rock Island; your enthusiastic support means so much to us!", "2018-08-13T00:58:29.000Z": "We later stopped by a phone bank in our Moline field office! Keep up the great work, team! #ThinkBigTour", "2018-08-12T20:00:30.000Z": "Just came from the DeKalb office opening for @JBPritzker Huge, enthusiastic crowd there to see him, @JulianaforLG , @susanamendoza10 Great job, @TaylorLGodwin ! #IL14  #IL16", "2018-08-12T22:31:47.000Z": "We then took a tour of @TRBrewingCo 's brewery and farm. Craft breweries like Tangled Roots are big jobs creators and as governor, I will work with them to support the agricultural community (and bring great-tasting beer!) across our state. Thanks for showing us around today!", "2018-08-12T19:07:14.000Z": "On our second stop we spoke to a room packed full of volunteers at @JBPritzker 's DeKalb County campaign office. JB is ready to fight for the people of Illinois! #twill  #Elections2018", "2018-08-12T20:48:24.000Z": "Afterwards, @JulianaforLG , @susanamendoza10 , and I made our way to DeKalb, where we opened our 24th field office! Juliana and I are so proud of the hard work of #TeamJB . We're going to get Democrats elected up and down the ballot because of your dedication!", "2018-08-12T17:38:51.000Z": "Next, @susanamendoza10 joined us at the Boone County Fair where we spoke about how we're going to defeat Bruce Rauner in November! #ThinkBigTour", "2018-08-12T16:22:43.000Z": "We started off Day Two of the #ThinkBigTour by attending services at St. Luke Missionary Baptist Church in Rockford. Thank you to Pastor Malone, First Lady Malone, and Rep. @LitesaWallace for welcoming us!", "2018-08-11T20:47:55.000Z": "@JBPritzker will make Illinois future so bright we gotta wear shades", "2018-08-12T13:47:17.000Z": "Great night with a great turnout!!! Thank you @JBPritzker , Nick Hyde, David Simpson and everyone involved to help make this event a success!! #JBforGov  #SideWithHyde  #SimpsonFor45th  #BlueWave Quote Tweet JB Pritzker @JBPritzker We ended Day One of the bus tour at a meet and greet with @Steph_Co_IL_Dem ! A great ending to an exciting day!", "2018-08-12T13:03:32.000Z": "We ended Day One of the bus tour at a meet and greet with @Steph_Co_IL_Dem ! A great ending to an exciting day!", "2018-08-12T03:18:54.000Z": "Next, we went to a @WinnDems Blue Wave event! We're so proud of the blue wave that's sweeping across the state - together we're going to bring progressive leadership back to Springfield.", "2018-08-12T01:06:52.000Z": "Later, we hopped on the #ThinkBigTour bus and made our way to Naperville with Rep. @Foster4Congress , and then Rockford with Mayor @tmcrkfd , where we met with supporters and volunteers!", "2018-08-11T21:12:54.000Z": "Afterwards, we went to the @ChiDefender for a post-parade lunch. The Chicago Defender has been a staple in journalism for nearly a century, and Juliana and I were excited to celebrate the success of the @BudParade with them and show our support!", "2018-08-11T19:55:17.000Z": "We started Day One of the #ThinkBigTour at the #BudBilliken Parade in Chicago! This parade is always one of our favorites and a great way to celebrate the summer season!", "2018-08-11T18:38:48.000Z": "Juliana and I are so excited to kick off our third statewide #ThinkBigTour ! We're going to be traveling all over the state, heading towards the @ILStateFair . Make sure you text to see where we're headed to next!", "2018-08-10T21:41:24.000Z": "One year ago today I gained an invaluable partner. @JulianaforLG brings energy, passion, and fun to our campaign every day, and I am honored to have her as a running mate and friend.", "2018-08-10T18:45:00.000Z": "Want to help us turn Illinois blue this November? Sign up to become a Fall Organizing Fellow and #JBtheChange ! https:// go.jbpritzker.com/page/s/organiz ingfellow ", "2018-08-10T19:00:00.000Z": "This past weekend in Chicago was devastating. We can't keep waking up to hear about people being shot and killed in our communities. And we can't keep offering thoughts and prayers to families whose lives will never be the same. Read more: https:// chicago.suntimes.com/crime/gun-cont rol-jb-pritzker-chicago-shootings-op-ed/ ", "2018-08-10T16:15:00.000Z": "Our mental health services have been reduced and people are going without the critical care they need - it's unacceptable. @sipofhopecoffee has decided to step up and use their trade to fight to save lives. Thank you all for your work, I was honored to help out.", "2018-08-10T01:47:36.000Z": "Some great volunteers from yesterday's Elgin Office Opening! #JBforGov  #BlueWaveComing2018  #JB  #ElginLovesJB", "2018-08-10T01:08:53.000Z": "Juliana and I had so much fun kicking off the @ILStateFair in the Twilight Parade! Thank you to all the volunteers that came out, marched, and celebrated \"200 Years of Amazing\" with us!", "2018-08-09T21:58:43.000Z": "Illinois needs a governor who will work with WA to fight climate change, and commit to the Paris agreement, not stand with Trump and the biggest, most powerful polluters. Go @JBPritzker ! Quote Tweet JB Pritzker @JBPritzker . @realDonaldTrump 's dirty energy policies are wrong for Illinois - they compromise the health and safety of our families and put us all at risk. As governor, unlike @BruceRauner, I will work to move Illinois toward a clean energy future. https:// thesouthern.com/news/local/pol iticians-leaders-discuss-future-of-the-coal-industry-at-illinois/article_3736e7e5-7d81-5363-bab9-8cfbfa228d4b.html ", "2018-08-09T20:29:44.000Z": "Thank you for having Juliana and me at the @ieanea conference event this afternoon! Our educators are on the frontlines; every day they work to prepare our students for the future. We wish them the best of luck on their first day of school!", "2018-08-09T19:47:21.000Z": "Preventing employers from asking salary history is an important step to level the playing field in the workplace. Women deserve a partner in the governor's office that will move our state toward gender parity and make sure they have every opportunity to succeed.", "2018-08-09T17:00:01.000Z": "The wage history bill championed by Rep. @annamoeller , Sen. @CastroforIL22 , my running mate @JulianaforLG , and activists across our state is critical legislation that will help close the wage gap in Illinois, and I urge Bruce Rauner to sign it immediately.", "2018-08-09T15:30:00.000Z": ". @realDonaldTrump 's dirty energy policies are wrong for Illinois - they compromise the health and safety of our families and put us all at risk. As governor, unlike @BruceRauner, I will work to move Illinois toward a clean energy future. Politicians, leaders discuss future of the coal industry at Illinois Coal & Mining Expo opening MARION - This year's Coal & Mining Expo opened Wednesday at the Marion Cultural and Civic Center. thesouthern.com", "2018-08-08T23:33:14.000Z": "This evening, I celebrated the opening of our Elgin field office alongside Mayor Kaptain, State Rep. Moeller, and Congressman @RajaForCongress . This wouldn't be possible if not for the hard work of our volunteers and organizing team - thank you all for joining the fight!", "2018-08-08T18:32:50.000Z": "Today @BruceRauner is leading a coal pep rally with the same coal barons who are colluding with @realDonaldTrump to take America backward and out of the global clean energy economy. Statement on Governor Rauner Headlining Wednesday Coal Rally With Trump Allies Governor Rauner is scheduled to headline at a rally today alongside coal company executives that have been instrumental in creating Trump Administration policies aimed at reversing many American... sierraclub.org", "2018-08-08T18:00:02.000Z": "Thank you to all of our #JBforGov summer interns! We were so excited to have you all with us this summer, and we can't wait to see how you make a difference in the future!", "2018-08-08T15:00:42.000Z": "Thank you all for having such a powerful, important discussion with us - we are fighting alongside you for equality. Quote Tweet AFSCME Council 31 @afscme31 On #BlackWomensEqualPayDay AFSCME Local 2258 Prez Charlene Raickett (far left), Local 505 Prez Cherone Gladney-Morris (center) & @AFSCME31 Dir. of Intergov. Affairs @DriXander joined @JBPritzker & @JulianaforLG . #Unions close the wage gap for black women workers!", "2018-08-08T00:17:18.000Z": "Thank you, @RepLauraFine for hosting a meet and greet in Glenview this evening! I was glad to meet you all and discuss our gun violence priorities and my longstanding support for women's rights.", "2018-08-07T21:12:49.000Z": "Thank you to everyone that came to our #BlackWomensEqualPayDay event. Black women are leaders and advocates, fighting to ensure that everyone receives equal pay for equal work. Together we can raise awareness of the pay gap in our workforce and fight to eliminate it.", "2018-08-07T19:32:26.000Z": "As we've seen everywhere from Alabama to Virginia, Black women are showing their power at the polls and voting for candidates that are committed to pay equity. As governor, I want to be a partner that listens and works with groups to make this a statewide priority.", "2018-08-07T19:16:01.000Z": "This disparity is unacceptable and has drastic implications in the lives of Black women. We need to openly discuss ways to fight for workplace equality. We also need to fully recognize the unique challenges that Black women face, and stand with them to #DemandMore .", "2018-08-07T19:03:25.000Z": "In 2018, Black women are making 63 cents for every dollar a white man makes. Today, #BlackWomensEqualPayDay , is about raising awareness and fighting the bias, discrimination, and lack of transparency that contribute to the wage gap.", "2018-08-07T16:44:44.000Z": "Enjoyed co-hosting a breakfast this morning with Cook County Recorder of Deeds @kayarbro and Assistant Majority Leader State Senator @LLCoolK_4 where we heard from Gubernatorial candidate @JBPritzker and his running mate @JulianaforLG on economic empowerment. #JB &Juliana #TeamJB", "2018-08-07T17:06:32.000Z": "Juliana and I kicked off the day in Proviso Township with @LLCoolK_4 , @RepChrisWelch , and Committeeman Yarbrough! Thank you to everyone that came out to hear about our plan to bring jobs to Illinois!", "2018-08-07T16:11:00.000Z": "The support of @LUnderwood630 means so much to me and Juliana. Lauren's a tireless leader who will fight for Illinois' families and make sure that their rights are protected. We can't wait to work with her in Springfield!", "2018-08-07T00:39:31.000Z": "This evening I was glad to attend a meet and greet with members of the Asian American community. Asian Americans are the fastest growing population in Illinois and Juliana and I will fight to make sure that you all have a voice in Springfield.", "2018-08-06T16:30:00.000Z": "Linda and Marcia have been good friends of mine for nearly three decades. They know my character and they've helped guide me, and so many others, in the fight for women's rights. I'm proud to have them by my side.", "2018-08-06T14:31:58.000Z": "Make sure that your voice is heard this November. Register to vote here: I Will Vote Be a voter in the 2020 election. iwillvote.com", "2018-08-06T14:21:36.000Z": "Today marks the 53rd anniversary of the #VotingRightsAct . The #VRA , which Dr. Martin Luther King Jr and so many others fought for, should serve as a reminder to us today that voting is a fundamental right and it's our duty to ensure that no American is wrongly disenfranchised.", "2018-08-05T23:00:00.000Z": "We had a lot of fun helping out! Quote Tweet Evan Chen @evakche8 We had @JBPritzker and @JulianaforLG in our South Holland office today to speak to volunteers and make some phone calls! #JBTheChange", "2018-08-05T20:30:00.000Z": "Deven is a pretty cool kid. Quote Tweet Jordan Abudayyeh @JordanAbudayyeh 8 year old Deven (who seems more like he's 18) says he's supporting @JBPritzker ! #twill  #ilgov", "2018-08-05T18:17:22.000Z": "Trump's plan to restrict #CleanerCars standards is one of his most dangerous climate moves yet. It's an attack on public health and it undermines the ability of states to confront climate change by setting more aggressive standards. Trump Administration Unveils Its Plan to Relax Car Pollution Rules The proposal would freeze rules requiring cleaner, more efficient cars and unravel one of President Obama's signature policies to fight global warming. nytimes.com", "2018-08-05T00:43:00.000Z": "Great day in Macoupin County! After knocking doors, we saw amazing enthusiasm in Dorchester from supporters at the homecoming parade and festival! #teamjb  #jbthechange  @JBPritzker", "2018-08-05T01:04:37.000Z": "We ended the day at a meet and greet in Olympia Fields hosted by Kaye Wilson. Thank you all for coming out and meeting us. Communities like these have seen the devastation that Bruce Rauner has caused, and are fighting to bring change to Illinois. Thank you for having us!", "2018-08-04T23:53:10.000Z": "Next, Juliana and I went to a canvass kick-off at our South Holland field office! We had a blast making phone calls and getting to know our volunteers. We hope to see you all out there next week, knocking on doors and getting out the vote!", "2018-08-04T21:38:34.000Z": "Afterwards, I joined @repalriley as we walked and got to know you all at the Park Forest Jazzin' in the Park Festival and later, the Hazelnut Festival in Hazel Crest!", "2018-08-04T17:05:27.000Z": "I grew up in Frankfort and I didn't think I'd ever see a room packed with Democrats! @JBPritzker already won the Abudayyeh household though. #twill  #ilgov", "2018-08-04T17:55:25.000Z": "I kicked off my Saturday at a meet and greet with the Frankfort Township Democrats. I loved speaking to this enthusiastic group about our fight to beat Bruce Rauner this November.", "2018-08-04T16:37:20.000Z": "Happy birthday, President @BarackObama ! Your leadership, and your humanity inspire us to be better and fight for what's right. #ObamaDay", "2018-08-03T21:33:56.000Z": "We ended the day at the 2018 @CollegeDems Summer Convention. Juliana and I were so excited to speak to the students. Young people in rooms like these are the future of the Democratic Party. They are engaged, they are passionate, and they are ready for the fight. #CDA18", "2018-08-03T19:44:43.000Z": "In Chicago today to campaign for my good friends @JBPritzker and @JulianaforLG , Illinois' next Gov and Lt Gov.  Loved joining @ChicagoVote roundtable with local voting right advocates to talk about the work we've done in Va to restore disenfranchised citizens right to vote.", "2018-08-03T19:41:02.000Z": "Today, Juliana, Former Governor @TerryMcAuliffe , and I took part in a voting rights roundtable hosted by @ChicagoVotes . As governor, Terry fought to protect and expand the voting rights of Virginians. In Illinois we're following the lead with automatic voter registration.", "2018-08-03T14:51:27.000Z": "I'm so happy (and unsurprised) to see that Illinois has 14 of the top 100 public high schools in the US! Our schools are leading the way and the hard work of our teachers and students is being celebrated across the country. Congratulations! Illinois Has 14 of the Top 100 Public High Schools in the US, Ranking Says Fourteen of the top 100 public high schools in the country are in Illinois, according to a report released Wednesday. nbcchicago.com", "2018-08-02T22:17:52.000Z": "Later, @SSadlowskiGarza joined us as we stopped by the Hegewisch community (and interrupted a passionate game of bingo) to speak about our plan to provide seniors with the tools they need to thrive! Thanks for having us and congratulations to the winners!", "2018-08-02T21:00:01.000Z": "I'm a Capricorn and @JulianaforLG is a Virgo! We're both predicting democratic victories across Illinois (hopefully the stars align in our favor!). Quote Tweet Timmy Knudsen @timmyknudsen What's your sign @JBPritzker @RepStratton5 ? I'm a Gemini. twitter.com/capitolfax/sta", "2018-08-02T18:29:35.000Z": "Juliana and I had a great time at the Bloom Township Senior Picnic this afternoon! We loved getting to know the senior community in Bloom Township, and speaking with you all about our commitment to protecting Illinois' seniors and Veterans.", "2018-08-02T15:37:04.000Z": "Thank you for your kind words, @RepJGB ! Juliana and I will fight to move this state forward with the support and partnership of leaders like you.", "2018-08-02T00:51:49.000Z": "I ended the day at an event in support of Kim Foxx. Kim inspires me every day through the work that she does to protect Cook County - We need to keep unwavering, reformative leadership like hers in office.", "2018-08-01T22:49:24.000Z": "Later in the day, Juliana and I toured the Farm on Ogden, an urban garden that's focused on job training and youth programs. The Farm on Ogden is doing great work to provide jobs and resources to people, especially young people, across Chicago. We're so excited to see them grow!", "2018-08-01T20:03:38.000Z": "This morning, I attended the monthly meeting of the Marshall Square Resource Network. Thank you all for coming out and discussing our priorities in education, health, and immigration in the Latino community.", "2018-08-01T17:18:39.000Z": "Juliana and I are thrilled to receive the endorsement of President @BarackObama . President Obama has been a source of hope to all Americans, especially Illinoisans who have followed him his entire career.", "2018-08-01T16:20:04.000Z": "Today I'm proud to endorse such a wide and impressive array of Democratic candidates - leaders as diverse, patriotic, and big-hearted as the America they're running to represent:", "2018-08-01T15:20:23.000Z": "We're glad to have @tenthdems on the team! Quote Tweet Tenth Congressional District Democrats(Tenth Dems) @tenthdems Spotted: Tenth Dems interns and volunteers. We're fired up to help elect @JBPritzker and so many other Democrats this November! #IL10  #ILGov  #twill  https:// twitter.com/JBPritzker/sta tus/1023296794825052160 ", "2018-08-01T01:42:57.000Z": "Nice to meet you too, Franklin! I hope to see you out on the trail. https:// twitter.com/N1LKN4RF/statu s/1023680233424277505  This Tweet is unavailable.", "2018-07-31T23:23:29.000Z": "Looks like fun! Thanks for your hard work! Quote Tweet So, Here's the Thing! @fidelrecruits Just finishing the weekend of action, smiling with @JBPritzker volunteers! #TeamJB", "2018-07-31T21:06:27.000Z": "In Springfield, I will propose an office of Criminal Justice Reform and Economic Opportunity and I can't think of a more qualified person to head it than Juliana. We will make sure that our young people don't unnecessarily enter the criminal justice system in the first place. Quote Tweet Juliana Stratton @JulianaforLG I've been an advocate for criminal justice reform my entire career. You can read @JBPritzker and my plan to end mass incarceration and give our communities the support they need to thrive here: https:// jbpritzker.com/criminal-justi ce/ ", "2018-07-31T19:30:00.000Z": ". @JulianaforLG and I have a vision for the future of Illinois: We see universal preschool, we see affordable college, and we see international companies coming to Illinois because of our workforce. Help us fulfill this vision and bring real leadership to Springfield in November.", "2018-07-29T02:57:45.000Z": "Out canvassing in Champaign Illinois in support of Gun Sense Candidate @JBPritzker ! It's only 100 days until November 6, let's #KeepGoing , @MomsDemand", "2018-07-29T18:07:08.000Z": "Coffee & Canvassing for @JBPritzker and @JulianaforLG with my amazing fellows during our Weekend of Action!! #JBTheChange", "2018-07-30T19:22:54.000Z": "Today marks the 53rd anniversary of Medicaid and Medicare being signed into law. For 53 years, these programs have helped millions of Americans access quality, affordable healthcare. We must keep fighting to protect and expand these programs in Illinois and throughout the U.S.", "2018-07-30T18:23:58.000Z": "There are 99 days until Election Day! That's 99 days to canvass, get people registered, and find out why Juliana and I are the best team to get Illinois back on track. Make sure you're ready for the big day and register to vote here: http:// iwillvote.com/il", "2018-07-29T23:33:38.000Z": "I couldn't have asked for a more fun place to end the day than at the DuPage County Fair. I enjoyed meeting so many of you and seeing all the fun DuPage has to offer!", "2018-07-29T21:01:51.000Z": "Had a blast at the Tri-Cities Summer Picnic - thanks for having me! I'm so excited for the work we'll do together to elect Democrats in the Tri-Cities and throughout the state.", "2018-07-29T19:04:29.000Z": "I loved meeting all of the hardworking volunteers at our Aurora canvass office! Our team is stronger with every single one of you on board. Thanks for being on #TeamJB !", "2018-07-29T18:00:12.000Z": "I had a blast at the Aurora Puerto Rican Day Parade this morning! The Puerto Rican community brings so much to the culture of Aurora and our state, and I was excited to march alongside them and meet so many members of the community!", "2018-07-28T23:29:11.000Z": "It's always a fun time attending one of my favorite events - @FiestaDelSol ! Thank you so much for inviting me to take part in such a fun celebration with the Latino community.", "2018-07-28T20:23:13.000Z": "Beautiful day to stop by the Lake County Fair this afternoon!", "2018-07-28T19:59:02.000Z": "I was so excited to see all of the dedicated volunteers at our canvass kick-offs in Highland Park and Gurnee today! Thanks for helping us reach voters in communities around the state during this Weekend of Action! Let's go #TeamJB !", "2018-07-28T17:53:28.000Z": "Today, I got to take a tour of the Midwest Veterans Closet and learn more about the work they do for our Veterans. Thanks for having me today and for a great discussion - I look forward to the work we'll do together to help Illinois' Veterans thrive.", "2018-07-28T15:38:25.000Z": "Happy birthday to our champion - a devoted, genuine, thoughtful, undaunted campaign manager, @anacaprana . Nobody does it better than you, Anne. Here's to your biggest winning year yet - an @Eagles Super Bowl in Feb, a primary in March, and the big one in Nov!", "2018-07-27T20:04:28.000Z": "Today, I visited @sipofhopecoffee to learn more about their suicide prevention efforts and the work they do to raise awareness about mental health. Their mission is inspiring and their hard work is life-saving. I'm proud to see the staff fighting for these important causes.", "2018-07-27T19:40:53.000Z": "After @realDonaldTrump 's visit to Illinois yesterday, will @BruceRauner finally answer the question of whether or not he voted for Trump?", "2018-07-26T23:19:35.000Z": "This evening, @AldPatDowell3rd and I met with a group of seniors in Chicago. We discussed how we will fight to protect their rights and make sure that they're always included in the decision making that affects them. Thank you for welcoming us!", "2018-07-26T17:55:53.000Z": "Today, we celebrate the 28th anniversary of the Americans with Disabilities Act - the landmark law that prohibits discrimination based on disability. As we celebrate, let's remember that the fight isn't over. We must keep fighting to protect and expand disability rights. #ADA28", "2018-07-26T15:57:07.000Z": "For nearly two years, @realDonaldTrump has shown that he's a threat to our national security, our democracy, and the rights of every American across the country. Join me and let's make our state a firewall against this administration.", "2018-07-26T15:57:06.000Z": "Today, @realDonaldTrump is in our state. And while he won't be appearing with @BruceRauner, I have no doubt that he will continue to disgrace our nation and promote his offensive agenda while Rauner cheers him on from the sidelines.", "2018-07-26T03:29:18.000Z": "I ended the day at an event in support of the Chicago Black Aldermanic Caucus. The Caucus is made up of public servants that work hard to create opportunity African Americans in Chicago. I'm incredibly proud to show my support for them.", "2018-07-26T00:58:03.000Z": "This evening I spoke at a reception for the @BGAlliance , which does important work to bring labor unions and environmental organizations together to build a strong economy and tackle environmental issues. All of us benefit when collaborative organizations like BGA thrive.", "2018-07-25T23:12:29.000Z": "Afterwards, I attended the monthly meeting of the Retired State Employee Association. I believe that we need to honor our obligations to state employees and retirees, and as governor I will fight to protect these obligations, which include pensions and benefits.", "2018-07-25T21:07:11.000Z": "Thank you to all the kids at the @BGCCIL for giving me a tour! The kids were great leaders who showed me everything the Boys & Girls club offers and why they love it so much. After the tour, they handed me an apron and told me to help out by getting to work!", "2018-07-25T19:50:40.000Z": "This unanimous vote shows the power of Ida's legacy and will serve as a reminder of her hard work as a civil rights activist, suffragette, and journalist.", "2018-07-25T19:50:39.000Z": "Congratulations to @aldsophiaking , the City Council, and all the supporters and advocates for your success in renaming Congress Parkway to honor Ida B Wells! https:// bit.ly/2mGZ1q8", "2018-07-25T17:40:00.000Z": ". @realDonaldTrump is coming to Illinois Thursday, but @BruceRauner won't be there to appear with him. It seems odd that Rauner wouldn't come out to support his friend, Trump - It looks like they've been silent partners for a long time.", "2018-07-25T16:51:25.000Z": "I loved stopping by our 87th street canvass office yesterday! Thank you all for your hard work - We can't build this Blue Wave across Illinois without the determination and excitement of teams like yours.", "2018-07-25T15:58:04.000Z": "I was glad to go to our Washington Park office! Keep up the great work! Quote Tweet Sunny @atchThaRaes So thoughtful! Our candidate took time out his busy day to bring our staff a quick bite ! That was so sweet. Thank you so much @JBPritzker  !!! #DemsDoItBetter  #TeamJB  #YouWannaPizzaMe  #WeLoveJB", "2018-07-24T18:05:00.000Z": "Everything is at risk with Brett Kavanaugh's nomination. We need a Supreme Court justice that won't ignore the facts and understands that most Americans support Roe v. Wade and want it to remain intact. Even most Republicans want to keep Roe v. Wade A new Wall Street Journal/NBC News poll has support among all voters at 71 percent. vox.com", "2018-07-24T14:34:36.000Z": "On Thursday, @realdonaldTrump will be in Illinois where he will most likely use the opportunity to continue spreading his hateful, racist, bigoted rhetoric in our state. And while @BruceRauner is sitting in silence, figuring out how to praise him, I'll be speaking out.", "2018-07-23T18:13:45.000Z": "US House candidate, IL-2 Thank you @JBPritzker and @JulianaforLG for hosting us at the Women's Rights & Resistance Brunch last week. Both @SenGillibrand and @KimFoxxforSA were inspiring Quote Tweet JB Pritzker @JBPritzker I'm immensely proud of our Women's Rights & Resistance Brunch last week.  The motivating, stirring words of @JulianaforLG , @SenGillibrand , and @KimFoxxforSA will inspire future generations of women to take the reins and resist, persist, and insist.", "2018-07-23T17:30:00.000Z": "I'm immensely proud of our Women's Rights & Resistance Brunch last week.  The motivating, stirring words of @JulianaforLG , @SenGillibrand , and @KimFoxxforSA will inspire future generations of women to take the reins and resist, persist, and insist.", "2018-07-23T16:03:36.000Z": "It should be no surprise that Mark Janus is joining a right-wing think tank that was once heavily backed by his anti-union accomplice, @BruceRauner. Mark Janus quits state job for conservative think tank gig after landmark ruling Janus will start Aug. 1 with the Illinois Policy Institute as a senior fellow, after the think tank that bankrolled his Supreme Court win. chicago.suntimes.com", "2018-07-21T17:37:39.000Z": "Always been one of my favorite things about @JBPritzker ...\n\nHe listens so intently.\n\nWarms my heart to watch him listen to so many across #Illinois .", "2018-07-21T18:17:03.000Z": "Thank you to everyone that came out and marched with me in the Disability Pride Parade this afternoon! In Springfield, Juliana and I will be partners to the disability community. We will make sure that our administration is always inclusive and welcoming.", "2018-07-21T16:44:23.000Z": "Congrats to the 12 amazing women who presented their startups after completing @1871Chicago 's WiSTEM program. These founders make Illinois proud! Way to go! Tech hub 1871 celebrates its seventh cohort of female start-up founders By Alexa Adler Medill Reports The seventh cohort of WiSTEM, 1871's pre-accelerator program for female start-up founders, celebrated the completion of its 12-week program and pitched its compa news.medill.northwestern.edu", "2018-07-20T18:35:00.000Z": "Come join me in the Disability Pride Parade tomorrow! #TeamJB is so excited to show our support for everyone in the disability community and we hope you'll join us: March with JB in the Disability Pride Parade! - Illinois Governor JB Pritzker jbpritzker.com", "2018-07-20T15:30:00.000Z": "My wife, MK, has been a fierce advocate, friend, and ally to women in business her entire life. She's supported them through challenges and celebrated their victories. I'm inspired by her powerful, moving words about lifting up women and claiming your seat at the table.", "2018-07-20T02:04:35.000Z": "We had so much fun at our monthly #LGBTQ + phone bank in #LakeView tonight!  @JBPritzker & @JulianaforLG are incredible allies in our fight for LGBTQ+ rights, and we love celebrating that every month! #TeamJB  #JBforGov  #JBtheChange  #twill", "2018-07-20T02:40:18.000Z": "Had a blast at tonight's House Party in Mascoutah!! Great Conversation about JB and his plan for Illinois! Want to join the fun? Go to http:// jbpritzker.com/volunteer and join us! #TeamJB  @JBPritzker  @JulianaforLG", "2018-07-19T19:01:39.000Z": "If this is what Bruce Rauner thinks leadership is, we don't need four more years of this in Illinois.", "2018-07-19T19:00:01.000Z": "It's disturbing that @BruceRauner called @mike_pence \"one of the greatest leaders in American history.\" Mike Pence has spent nearly his entire career attempting to roll back rights for women and the LGBTQ community.", "2018-07-19T16:30:01.000Z": "Illinois is full of thoughtful, caring teachers like Kimber Bermudez. I'm happy to see people across the country recognize the hard work of our teachers and the resources they still need. Passengers overhear a teacher talking about how her students need school supplies and open up their... Passengers gave $530 to Chicago teacher Kimber Bermudez. cnn.com", "2018-07-19T15:23:21.000Z": "On this day, 170 years ago, the Seneca Falls Convention was held. While the convention was the start of something revolutionary, today we're still marching and fighting for rights that will ensure gender equality.", "2018-07-18T20:30:01.000Z": "The fight to #EndCrosscheck won't stop with @BruceRauner's veto. I'm committed to fighting alongside all of the great organizations doing the important work to eliminate voter suppression and protect our information. Quote Tweet #EndCrosscheck @endcrosscheck Unsurprisingly, yet still disappointing, @GovRauner has vetoed #SB2273 .\n\nThis is a short-term setback. We hope to work with a future Governor @JBPritzker in 2019 to protect IL voters.\n\nThank you ALL for your support in this fight! #EndCrosscheck  #twill  https:// endcrosscheck.com/news/2018/7/17 /activists-vow-to-continue-fight-against-voter-suppression ", "2018-07-18T17:00:02.000Z": "My entire life I've always been proud to be a feminist and an advocate for women. From HB40 and access to healthcare, to equal pay laws and the ERA, @JulianaforLG and I will fight to defend rights and empower women across Illinois.", "2018-07-18T15:13:47.000Z": "All of us on #TeamJB are pretty tired of him too. https:// jbpritzker.com/volunteer/ Quote Tweet Just Elise @yesjustelise I've had so much more than enough of this guy. Hey @JBPritzker , need another volunteer for your campaign? https:// twitter.com/chicagotribune /status/1019370382535680000 ", "2018-07-18T01:33:23.000Z": "Thank you to everyone that came out to the 9th CD meet and greet! Illinoisans know that this election is about values. That's why I'm so proud to talk about protecting women's rights, and investing in education - Because these are the values that are at risk in November.", "2018-07-17T18:06:30.000Z": "Planned Parenthood knows that @JBPritzker & @JulianaforLG will be the leaders Illinois needs. #twill Quote Tweet JB Pritzker @JBPritzker This morning, Juliana and I visited @PPIAction and met with some of the hardworking, determined staff. Planned Parenthood's work to protect women's healthcare decisions is crucial. We need them now more than ever.", "2018-07-17T17:35:16.000Z": "This morning, Juliana and I visited @PPIAction and met with some of the hardworking, determined staff. Planned Parenthood's work to protect women's healthcare decisions is crucial. We need them now more than ever.", "2018-07-17T15:27:44.000Z": "Yesterday, Trump cozied up to a foreign power that intentionally hacked our election - We need to take all steps to ensure that our information is protected, and that starts with ending Crosscheck. We Urge Governor Rauner to Act Now to Protect Illinois Voters - #EndCrosscheck News of Russian hackers targeting Illinois adds urgency to signing of SB 2273 The Russian hacking of Illinois' voter database is further galvanizing activists in support of a bill which would close a... endcrosscheck.com", "2018-07-17T15:27:43.000Z": "Today is the deadline for @BruceRauner to sign SB 2273 - A bill supported by @IndivisibleChi , @KwameRaoul and many others that will #EndCrosscheck and protect voter information from being compromised. @letamericavote  @endcrosscheck  @IndivisibleTeam", "2018-07-17T04:52:07.000Z": "@JBPritzker Today was an Awesome Day! I spent it with my two favorite ppl, and Illinois Next Governor & Lieutenant Governor,  JB Pritzker & Julianna Stratton", "2018-07-16T21:22:15.000Z": "Honored to have attended the second annual Women's Rights and Resistance Brunch hosted by @JBPritzker . Leaders like @SenGillibrand , @JulianaforLG , and @KimFoxxforSA serve as a powerful reminder that women are the leaders of tomorrow. We will #resist and #persist . #twill", "2018-07-16T21:42:45.000Z": "Today we saw a sitting U.S. President cozy up to our enemies, disrespect our allies, disgrace our country, and embarrass our democracy on a world stage. I don't know what side @realDonaldTrump is on, but it's not ours.", "2018-07-16T19:43:19.000Z": "I'm in awe of the power of women after our Women's Rights and Resistance Brunch. It was inspiring to listen to @SenGillibrand , @KimFoxxforSA , @JulianaforLG and many others speak on the power of the resistance. Women are leading the fight and I'm so proud to stand alongside them.", "2018-07-16T18:07:38.000Z": ". @JBPritzker and @JulianaforLG understand that we are taking this fight for those who don't have a seat at the table!", "2018-07-16T18:05:57.000Z": "PPIA was proud to support today's women's rights and resistance brunch w/ @JBPritzker ! #twill  #TheFutureisFemale", "2018-07-16T17:46:45.000Z": "Joined the women's resistance lunch today with @JBPritzker  @KimFoxxforSA @RepStratton5 hearing powerful women of color leaders speak about the change to come. Thank you Linda for this invitation!", "2018-07-16T16:42:41.000Z": "Women have always been leading the fight - The fight for representation, for their rights, and for equality. And now more than ever, we see them leading the resistance against this administration's attacks. I'm committed to being an ally as we march towards equality.", "2018-07-15T21:00:00.000Z": "Come join our hardworking team! Volunteer - Illinois Governor JB Pritzker jbpritzker.com", "2018-07-15T17:47:48.000Z": "We love your passion and we're excited to have your support, Austin! Quote Tweet Austin Beasley @austin_beasley4 I had a wonderful time at @JBPritzker 's Naperville office opening. I met some wonderful democrats both behind and in the front lines of his campaign. These men and women truly have a passion for making this state a better place and I look forward to supporting them in doing so.", "2018-07-14T20:40:48.000Z": "Later, I had an opportunity to speak at a @MomsDemand meeting in Naperville. @JBPritzker and I will do everything in our power to end gun violence in our communities. You can read about our public health approach to gun violence here: https:// jbpritzker.com/gunviolence/", "2018-07-14T21:19:32.000Z": "I'm incredibly proud to be a @MomsDemand Gun Sense Candidate. Gun violence is a public health epidemic and we are not doing enough to fight it. As governor I will work alongside organizations like Moms Demand Action to enact common-sense safety legislation that will save lives.", "2018-07-14T16:33:58.000Z": "#TeamJB is having a great day knocking doors for @JBPritzker & @KwameRaoul in Chicago! #JBforGov  #twill", "2018-07-14T16:08:53.000Z": "I'm so excited to march with you all in the Railroad Days parade tomorrow! See you there", "2018-07-14T15:22:59.000Z": "As governor, I will sign legislation like SB35 to ensure that these families can live everyday lives without worrying about their safety. #WelcomingIL", "2018-07-14T15:22:58.000Z": "I urge @BruceRauner to protect immigrant families and sign SB35. Immigrants in Illinois deserve a governor who will fight for them. Immigrant Rights Advocates Call On Illinois Gov. To Sign Bills As news has centered on the plight of hundreds of families who have been separated while trying to enter the US through Mexico, concern has been raised news.wsiu.org", "2018-07-13T16:56:29.000Z": "Elevator pitch about @UIResearchPark and growing tech jobs in Champaign-Urbana, the fastest growing city in IL, with @JBPritzker - leverage strong innovation, workforce, AgTech, Biotech, Data Science, Robotics"}