{"2020-07-29T18:31:40.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 29", "2020-07-29T18:15:46.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 29", "2020-07-29T17:30:38.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 29", "2020-07-29T12:17:31.000Z": "Through his decades of servant leadership and sacrifice, Joe Kernan modeled all the best of what it means to be a Hoosier and his legacy will continue to live on in each of us whom he inspired.", "2020-07-29T12:17:30.000Z": "Distinguished isn't a strong enough word to describe him. Without regard for personal cost, Joe Kernan devoted every ounce of his life, time and again, to upholding the oath he took, and serving the country and state he loved.", "2020-07-29T12:17:29.000Z": "Indiana mourns the loss of Joe Kernan, a bone fide American hero, decorated Navy officer, and truly selfless statesman who always placed the interests of his fellow Hoosiers first.", "2020-07-27T14:42:37.000Z": "Who are you masking up for? #MaskUpHoosiers", "2020-07-27T14:17:30.000Z": "Hoosiers have worked hard to get where we are today with businesses open & people back at work. We want to keep it that way. We don't want to dial things back. Face coverings can & will help us blunt the increase of this virus. #MaskUpHoosiers  https:// bit.ly/3jFtn93", "2020-07-25T13:33:26.000Z": "Cheering for the @IndianaFever as they tip off the season today!", "2020-07-23T21:25:24.000Z": ". @GovHolcomb : \"For nearly 35 years, @subaru_usa has been an important partner in supporting Indiana's economy and creating great career opportunities in the community.\"", "2020-07-23T19:22:05.000Z": "Today we're excited to join @GovHolcomb , local officials and @subaru_usa as the company breaks ground on a $158 million expansion at its @City_Lafayette assembly plant!", "2020-07-23T17:10:18.000Z": "The #Indy500 is a tradition as Hoosier as it gets - & the track's health & safety plan is detailed & extensive. Looking forward to the 104th running!", "2020-07-22T20:48:46.000Z": "The state will approach enforcement of the face covering requirement with an emphasis on education. A penalty can be levied under the authority of state law.  Local governments may impose more restrictive guidelines.", "2020-07-22T20:48:45.000Z": "The face covering executive order will have exceptions for medical purposes, disabilities, exercising, eating & drinking.", "2020-07-22T20:48:44.000Z": "Face coverings will be required in schools for students in the 3rd grade & , faculty, staff, volunteers & anyone else in schools. \n\nMasks are also required for co-curricular & extra-curricular activities with exceptions for strenuous physical activity.", "2020-07-22T20:48:43.000Z": "A mask or other face covering may be: factory-made sewn by hand improvised from household items such as scarfs, bandanas & t-shirts. \n\nIt should cover the mouth & nose.", "2020-07-22T20:48:42.000Z": "As we continue to monitor the data, we've seen a concerning change in some of our key health indicators. \n\nHoosiers have worked hard to help re-open our state & we want to remain open. \n\nBy masking up, we can & will save lives & slow the spread of #COVID19 .", "2020-07-22T20:48:41.000Z": "Today, I announced I'll sign an executive order requiring Hoosiers to wear face coverings in most public settings, beginning Monday.", "2020-07-22T18:29:09.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 22", "2020-07-22T17:39:45.000Z": "At 2:30 p.m. ET (1:30 p.m. CT), I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live: Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 22", "2020-07-22T14:47:47.000Z": "As we gear up to safely go #BackToSchool , our @Indiana_EDC procured over 3 million reusable masks for Indiana's K-12 students. Currently, 472 schools across Indiana are participating and will receive reusable masks as well as disposable masks and hand sanitizer supplies. #COVID19", "2020-07-21T20:22:23.000Z": " https:// bit.ly/3hsfmcR", "2020-07-21T19:32:04.000Z": "As we combat #COVID19 , health care workers, educators & job creators need civil liability protection when following health practices.\n\nJoined by 20 governors from across the country, I wrote a letter calling on Congress to enact common sense protections for employees & employers.", "2020-07-21T14:49:03.000Z": ". @GovHolcomb : \"With homegrown Hoosier companies like @PalmerTrucks at the wheel, Indiana will continue to position our state for long-term economic stabilization and growth.\"", "2020-07-21T14:14:14.000Z": "#NEWS : Family-Owned Logistics Company Plans Major Indiana Expansion, 200+ New Jobs - https:// mailchi.mp/iedc/newsfamil y-ownedlogistics-company-plans-major-indiana-expansion200-new-jobs  | @GovHolcomb  @IndyMayorJoe", "2020-07-20T21:40:51.000Z": "Ensuring Hoosiers have tools & training to succeed in high-wage, high-demand careers, no matter where you start out in life, is a priority. Earning a credential or learning new career skills opens doors & propels you on your pathway to personal prosperity. Gov. Eric Holcomb: Workforce readiness essential to recovery As governor of Indiana, one of my top priorities is ensuring Hoosiers have the tools and training to succeed in high-wage, high-demand careers, no matter where you start out in kokomotribune.com", "2020-07-18T14:36:58.000Z": "With Rep. John Lewis' passing, our nation lost a towering leader & powerful voice for freedom, civil rights & love.", "2020-07-17T16:28:08.000Z": "It's almost time to go #BackToSchool ! This year, your kids may be asked to wear a cloth face mask at school for part of the day to help keep everyone safe. Talk with your child about how to wear a mask and why it's important to #MaskUpHoosiers", "2020-07-16T19:50:11.000Z": "The state has updated its requirements for events that are permitted according to Stage 4.5. Events that expect more than 250 attendees are now required to submit a safety plan to their local health department for approval prior to opening. This is effective July 23.", "2020-07-16T19:50:10.000Z": "As we actively track our health indicators and monitor the data, we continue to see the need to maintain our current levels found on Indiana's #BackOnTrack roadmap.", "2020-07-16T19:50:09.000Z": "I have announced the majority of the state will remain in Stage 4.5 of the #BackOnTrack Indiana plan through at least July 31.\n\nElkhart County will remain in Stage 4 as it has for the last two weeks. Local governments may impose more restrictive guidelines.", "2020-07-16T18:29:20.000Z": "Indiana's forward momentum is propelled by perfect partnerships and strong relationships. The growing demand for @MonoSolLLC products and their growing presence in our state combined with Indiana's pro-growth business climate and quality of place adds up to a formula for success.", "2020-07-16T12:57:07.000Z": "Indiana Adjutant General Dale Lyles wears his mask to protect our @INGuardsman . Who do you wear your mask for? #MaskUpHoosiers", "2020-07-15T18:29:21.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 15", "2020-07-15T18:15:03.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 15", "2020-07-15T17:30:23.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 15", "2020-07-15T16:46:44.000Z": ". @IndianaDOC Commissioner Rob Carter wears his mask to help protect people at risk from #COVID19 like his mother-in-law. Who do you wear your mask for? #MaskUpHoosiers", "2020-07-15T13:29:24.000Z": "Hoosiers across the state are coming together to protect the people around them.\n\nWill you wear your mask to protect them?\n\nVisit http:// coronavirus.in.gov/maskuphoosiers to share who you are wearing your mask for. #INthistogether  #MaskUpHoosiers", "2020-07-14T15:27:36.000Z": "Workforce readiness is essential on the road to recovery & #COVID19 has made skilling up Americans more essential than ever. #FindSomethingNew will help provide the tools necessary to empower you, no matter your zip code, to achieve your potential. http:// FindSomethingNew.org", "2020-07-14T13:08:47.000Z": "Wearing a face mask can make it difficult to communicate through speech reading, but it's important that everyone do their part to slow the spread of #COVID19 . Keep your neighbors safe and #MaskUpHoosiers !", "2020-07-13T22:00:28.000Z": "Wearing a mask may be uncomfortable, but we all need to #MaskUpHoosiers . \n\nProlonged use of face mask should not interfere with your normal breathing and will help prevent you from spreading #COVID19 .", "2020-07-13T19:14:01.000Z": "Wearing a face mask is new and uncomfortable for many of us, but it's still important that you #MaskUpHoosiers ! Follow these tips from @StateHealthIN to help you adjust to regularly wearing your face mask in public.", "2020-07-13T15:07:54.000Z": "Wearing a mask can help you protect other people with #COVID19 . #MaskUpHoosiers Quote Tweet Indiana State Department of Health @StateHealthIN We need you to #MaskUpHoosiers and help save lives.\n\nWearing a cloth face mask can prevent 99% of your respiratory droplets from spreading and infecting others with diseases like #COVID19 . \n\nDo your part. We're all #INthistogether", "2020-07-02T14:36:13.000Z": "Meet Emma. \n\nShe lives with cerebral palsy and would struggle fighting off #COVID19 .\n\nEmma's mom wants you to think of her daughter when you are wearing your mask. \n\nHoosiers like Emma are the reason to wear a mask when out in public, because they are worth it. #MaskUpHoosiers The following media includes potentially sensitive content. Change settings View", "null": "", "2020-07-13T12:41:01.000Z": "Check out these great tips from Dr. Weaver and @StateHealthIN on how to properly wear and store your mask to help slow the spread of #COVID19 . #MaskUpHoosiers Quote Tweet Indiana State Department of Health @StateHealthIN It's time to #MaskUpHoosiers ! \n\nThe weekend is the busiest shopping time of the week and wearing a face mask when you're in public helps slow the spread of #COVID19 . \n\nFollow this guide from Dr. Weaver to make sure you wear and store your mask properly.", "2020-07-10T17:53:49.000Z": "I was proud to join @SWINChamber for their annual #SWINLunchWithTheGovernor .", "2020-07-10T17:05:02.000Z": "Meet Abby! She's a bright and energetic young girl, and she's one of the many Hoosiers who are at a high risk of becoming severely ill from #COVID19 . We need you to #MaskUpHoosiers and help keep people like Abby safe and healthy while we get #BackOnTrack .", "2020-07-09T22:30:06.000Z": "Have you visited http:// BackonTrack.in.gov to read the guidelines for Stage 4.5?\n\nCheck out what things have changed from Stage 4. #INThisTogether", "2020-07-10T12:58:56.000Z": "I'm tipping my cap to honor the 100th anniversary of the Negro Leagues. Thank you all for what you did, paving the way for better baseball and a better America. #TippingYourCap", "2020-07-09T22:30:20.000Z": "From day one, @GovHolcomb has made combating the drug epidemic a top priority. By making #naloxone more readily available to Hoosiers, people will have a second chance to get back into recovery, or maybe enter recovery for the first time. http:// ow.ly/Goxo50Aufxx via @NicoleK_WTWO Funding the Fight Against Opioids: How Naloxone distribution benefits struggling Hoosiers TERRE HAUTE, Ind. (WTWO/WAWV) - The pandemic has taken a toll on day-to-day life for most people, including those in the recovery community. From the loss of in-person recovery meetings, to u mywabashvalley.com", "2020-07-09T18:15:53.000Z": "Who do you wear your mask for? #MaskUpHoosiers", "2020-07-09T14:30:36.000Z": "As we get #BackOnTrack , @StateHealthIN wants all Hoosiers to know the DOs and DON'Ts of properly wearing cloth face masks.\n\nHere's a quick checklist to follow. #MaskUpHoosiers", "2020-07-09T13:43:08.000Z": "Indiana 211 is a free service that connects Hoosiers with assistance and answers from thousands of health and human service resources - quickly, easily and confidentially.", "2020-07-09T13:43:07.000Z": "I have announced Indiana's statewide community resource referral agency, Indiana 211, is now part of the @FSSAIndiana .", "2020-07-08T22:23:13.000Z": "Dr. Weaver, @StateHealthIN 's Chief Medical Officer, wears her mask to protect her daughters, family and patients.\n\nWill you wear a mask for her? #MaskUpHoosiers  http:// coronavirus.in.gov/maskuphoosiers", "2020-07-08T18:31:18.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 8", "2020-07-08T18:15:07.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 8", "2020-07-08T17:30:06.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 8", "2020-07-08T16:32:06.000Z": ". @blue wears his mask for @Colts nation. Who do you wear your mask for? #MaskUpHoosiers", "2020-07-08T16:14:40.000Z": "Very proud to see @INDairport continue to receive the recognition it deserves. Quote Tweet Indianapolis Airport @INDairport IND has been named the Top Domestic Airport by Travel + Leisure World's Best Awards ! Awards like this are only possible because of the front line workers who continue to deliver exceptional customer service to all passengers. Thank you for all you do! https:// bit.ly/2Z5yHdu", "2020-07-08T13:41:33.000Z": "As Indiana reopens and gets #BackOnTrack , @StateHealthIN recommends that all Hoosiers wear a cloth face mask in public settings. \n\nRemember that N95 respirators and surgical masks are critical supplies that should be reserved for healthcare personnel. #MaskUpHoosiers", "2020-07-07T21:12:31.000Z": "Have an old T-shirt lying around at home?\n\nFollow this step-by-step guide to make your own homemade cloth face covering-no sewing necessary.\n\nWe all need you to #MaskUpHoosiers and help protect others from #COVID19 .", "2020-07-07T14:54:24.000Z": "Our Director wears her mask for child welfare workers. What about you? #MaskUpHoosiers  #INThisTogether Quote Tweet Terry Stigdon @tstigdon I wear my mask for child welfare workers. Who do you wear your mask for? #MaskUpHoosiers", "2020-07-06T21:57:54.000Z": "One of the few times you should not #MaskUpHoosiers is when you're exercising! So, if you choose to exercise outside, we recommend that you maintain a safe 6 feet of social distance between yourself and others to slow the spread of #COVID19 .", "2020-07-06T12:45:32.000Z": ". @StateHealthIN needs all Hoosiers to mask up and do their part to keep our state safe and healthy. To help slow the spread of #COVID19 , avoid these common mask-wearing mistakes, and make sure you wear your face mask correctly. #MaskUpHoosiers", "2020-07-04T13:02:49.000Z": "Happy Independence Day, Hoosiers!", "2020-07-02T19:08:19.000Z": "Happy Anniversary to my incredible wife @FLJanetHolcomb !", "2020-07-02T17:37:27.000Z": "Cloth face masks help protect others from your germs, reducing the risk of spreading #COVID19 . Remember that you may unknowingly be sick, so it's important to wear a face mask in public even if you don't have symptoms. #MaskUpHoosiers", "2020-07-02T16:04:44.000Z": "Wearing a mask may seem inconvenient, but it can save lives. #MaskUpHoosiers The following media includes potentially sensitive content. Change settings View", "2020-07-02T14:14:30.000Z": "Wearing a face mask is one of the simplest, most effective ways to slow the spread of the virus, but we need everyone to do their part to keep our state safe. \n\nAs you make plans to enjoy this holiday weekend, remember to #MaskUpHoosiers ! \n\nLEARN MORE  https:// bit.ly/38osI6k", "2020-07-01T22:30:06.000Z": "Who are you wearing your mask for?\n\nUse #MaskUpHoosiers and share who you are protecting by wearing your mask. http:// coronavirus.in.gov/maskuphoosiers", "2020-07-01T20:20:20.000Z": "Today the #USMCA goes into effect. I support free and fair trade that works for Hoosiers and the United States-Mexico-Canada Agreement provides certainty and stability while also expanding markets for Hoosier-made products. Holcomb: USMCA deal is crucial to Hoosier economy This new trade deal is an improvement on NAFTA and better serves the interests of Hoosier workers and career creators. courierpress.com", "2020-07-01T20:19:05.000Z": "of #COVID19 , saving lives and allowing the state to continue its phased re-opening. Additional photos and videos will be featured as the educational campaign progresses. Visit http:// coronavirus.in.gov/maskuphoosiers to learn more.", "2020-07-01T20:19:04.000Z": "Outdoor visitation is required at assisted living facilities and nursing homes beginning July 4 and indoor visitation may begin. Hospital visitations with precautions are encouraged.", "2020-07-01T20:19:03.000Z": "Dining room food service may continue operations at up to 75 percent capacity as long as social distancing is observed. Bar seating in restaurants may continue operations at 50 percent capacity.", "2020-07-01T20:19:02.000Z": "I have used data to drive decisions since the state's first case of the novel coronavirus in early March & I will continue to do so as the state continues a sector-by-sector reset. The state will move to reopen while continuing to monitor & respond to these 4 guiding principles:", "2020-07-01T20:19:01.000Z": "Today I announced the state will modify the #BackOnTrack Indiana plan through at least July 17.\n\nWhile a few restrictions will lift on July 4 in version 4.5 of the plan, most will stay in place. Elkhart County will remain fully in Stage 4 until at least July 17.", "2020-07-01T19:35:01.000Z": "Wearing a face mask is one of the simplest, most effective ways to slow the spread of the virus, but we need everyone to do their part to keep our state safe. That's why we are asking all Hoosiers to mask up and speak up about how wearing your mask can save lives. #MaskUpHoosiers", "2020-07-01T18:29:15.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 1", "2020-07-01T18:15:06.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 1", "2020-07-01T17:33:30.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - July 1", "2020-07-01T13:16:25.000Z": "Starting today, Hoosiers cannot use their mobile device while driving unless they are utilizing hands-free technology. Help us keep our roads safe! Visit http:// HandsFreeIndiana.com for more info. #HandsFreeIN", "2020-06-30T21:00:51.000Z": "Over the past 3+ years, businesses here and around the world have committed to creating 100,000 new jobs in Indiana over the next several years - an all-time state record! 2020 has brought new challenges for us all, but we have remained committed to getting #BackOnTrack .", "2020-06-30T19:17:12.000Z": "Utilities regulated by the Indiana Utility Regulatory Commission must follow the order issued Monday by the commission prohibiting service disconnections through Aug. 14. Under Executive Order 20-33, non-regulated utility companies must also extend service until Aug. 14.", "2020-06-30T19:17:11.000Z": "Today I signed Executive Order 20-33 to extend the prohibition on evictions, foreclosures, and the disconnection of utility services.", "2020-06-30T18:47:00.000Z": "Everyone reacts differently to stressful situations like #COVID19 . You may feel anxiousness, anger, sadness, or overwhelmed. \n\nIf you or a loved one is feeling overwhelmed, get support 24/7 at the phone numbers below. \n\nLearn more at https:// bewellindiana.com", "2020-06-27T19:01:27.000Z": "Running errands this weekend? Don't forget your mask!\n\nTake action to slow the spread of #COVID19 by wearing a cloth face covering in public spaces, keeping at least 6 feet of physical distance & frequently washing your hands.\n\nLearn more at https:// bit.ly/2Ravt42 .", "2020-06-29T13:55:45.000Z": "For more information, please visit http:// HandsFreeIndiana.com .\n\nHands Free Indiana is a partnership between the @INDOT , @IndStatePolice , @IndianaCJI , @INBMV , @INconstructors , @intrucking and @ACECIndiana .", "2020-06-29T13:55:44.000Z": "Once the law takes effect, drivers on Indiana roads will be prohibited from having a mobile device in their hands while their vehicles are moving, with the exception of dialing 911 in an emergency.", "2020-06-29T13:55:43.000Z": "I am reminding drivers that beginning Wednesday, Indiana law will prohibit drivers holding mobile devices, such as smartphones and tablets, in their hands while driving to reduce distracted driving and improve safety on Hoosier roadways.", "2020-06-26T19:59:32.000Z": "I'm thrilled the President signed an executive order focusing on skill-based hiring for federal agencies. In Indiana, we've partnered with @JoinSkillful to encourage skills-based hiring. Employers will be able to fill open positions faster & increase diversity.", "2020-06-26T14:25:47.000Z": "Earlier this month, I launched #Indiana 's \"Rapid Recovery for a Better Future\" initiative & dedicated $50 million in CARES Act funding to help Hoosiers recover from the economic impacts of #COVID19 .  https:// calendar.in.gov/site/gov/event /gov-holcomb-launches-50-million-initiative-to-help-hoosiers-economically-recover/ ", "2020-06-26T14:25:46.000Z": "I'm so pleased to partner with the Administration & our nation's top leaders on the American Workforce Policy Advisory Board to share Hoosier successes & develop a strategy to empower the American workforce to better meet today's challenges.", "2020-06-26T14:25:45.000Z": "Today I'm attending the 6th meeting of the American Workforce Policy Advisory Board at the @WhiteHouse .   \n\nNow more than ever, as #Indiana & the country grapple with the economic impacts of #COVID19 , I remain focused on investing in people & their potential.", "2020-06-25T21:44:16.000Z": "Looking forward to joining @IvankaTrump and @SecretaryRoss for the American Workforce Policy Board in Washington D.C. to discuss innovative ideas to expand pathways for our nation's workers.", "2020-06-25T11:05:20.000Z": "As Indiana gets #BackOnTrack and our branches welcome walk-in customers, please remember there may be longer than usual wait times. Before heading out, check branch hours at http:// ow.ly/GGkL50AchSS and prepare for the weather as lines may be outside. Thank you for your patience!", "2020-06-24T21:12:54.000Z": "Rental assistance through this program is available to residents in all Indiana counties except Marion, where a local $15 million CARES Act-funded program will provide aid to Marion County renters.", "2020-06-24T21:12:53.000Z": "Today I announced the Indiana #COVID19 Rental Assistance Program, which will use $25 million in federal CARES Act funding to help Hoosiers struggling to pay rent due to the impact of #COVID19 .", "2020-06-24T18:29:04.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 24", "2020-06-24T18:15:11.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 24", "2020-06-24T17:30:12.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 24", "2020-06-24T17:03:03.000Z": "Donating blood helps our hospitals and first responders save lives. @indianablood will be at the @IndyStateFair 4-H Exhibit Hall tomorrow for the Healthcare Heroes Tribute Blood Drive. \n\nClick here to sign up: https:// donate.indiana.versiti.org/donor/schedule s/drive_schedule/142903  The following media includes potentially sensitive content. Change settings View", "2020-06-24T16:31:20.000Z": "Thanks to @RepWalorski and the @WaysMeansCmte Worker and Family Support Subcommittee for allowing @FSSAIndiana 's @confectionsmd to highlight the great work being done in our state to ensure essential childcare is available during the #COVID19 pandemic.", "2020-06-24T13:47:07.000Z": "Tune in today at 2:30 p.m. ET (1:30 p.m. CT) for updates from @GovHolcomb , @LGSuzanneCrouch , @StateHealthIN Comm'r Dr. Kristina Box, @IHCDA Executive Director Jason Sipe, and other state leaders in the fight against #COVID19 . Facebook Watch Party: http:// bit.ly/2yKQPhR", "2020-06-23T17:38:08.000Z": "Thank you to all of you who work for the public.\n\nNot just during times of a pandemic, but everyday you go to work and help those in need.\n\nToday is #PublicServiceDay and we thank you for your service!", "2020-06-22T21:05:14.000Z": "As a reminder, the Real ID deadline has been extended to October 1, 2021. Learn which documents are needed to upgrade to a Real ID at http:// RealID.IN.gov .", "2020-06-22T19:51:47.000Z": "Traditional public school corporations, public charter schools, accredited non-public schools, higher education institutions, and other education-related entities are eligible to apply.\n\nThe deadline is Friday, July 17. To apply, click here: https:// doe.in.gov/GRANTS/GEER", "2020-06-22T19:51:46.000Z": "Our Governor's Emergency Education Relief funds will help meet technology needs and grow educator development while working to reduce the disparities between districts.", "2020-06-22T19:51:45.000Z": "Today I announced Indiana PK-12 schools and higher education institutions can now apply for a needs-based, competitive $61.6 million grant program providing funding to improve remote learning.", "2020-06-22T17:42:09.000Z": "In case you have forgotten, masks are still recommended when out in public.\n\nHow to wear a mask: Wash your hands Secure the mask behind your ears Make sure the mask covers your mouth and nose Pinch down the nose to make it snug Don't touch the front of your mask!", "2020-06-19T14:46:26.000Z": "#Indiana has access to millions of dollars in federal funding through the Paycheck Protection Program (PPP). It's designed to help you keep your business in business and your employees employed. Applications are due by June 30! Learn more at http:// stayINbiz.org .", "2020-06-19T15:00:01.000Z": "During the pandemic, HIP, SNAP and TANF assistance are still available. Click here for more information: https:// in.gov/fssa/5756.htm", "2020-06-19T13:10:51.000Z": "Today I issued a proclamation celebrating #Juneteenth , an opportunity to reflect, rejoice and plan for a brighter future.", "2020-06-18T14:12:50.000Z": "Keeping Hoosier students focused on fitness & healthy living is key to letting them grow up & live fulfilling lives. Wellness in all aspects is more important now than ever & we're thankful to @BodyByJake for bringing the DON'T QUIT! Campaign to our state. https:// bit.ly/3eeztdi", "2020-06-17T18:28:37.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 17", "2020-06-17T17:30:01.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 17", "2020-06-17T16:12:07.000Z": "encouraging and supporting minority small businesses, entrepreneurs & startups. Chapters - Indiana Black Expo indianablackexpo.com", "2020-06-17T16:12:06.000Z": "to raise awareness of available resources and funding, enhancing participation in critical economic and workforce recovery programs.", "2020-06-17T16:12:05.000Z": "Today I provided updates on the state's efforts to support Indiana small businesses and entrepreneurs, announcing a new partnership with @INBlackExpoInc to increase access to economic and workforce recovery programs for minority employers and encouraging", "2020-06-17T13:27:22.000Z": "During this #COVID19 pandemic, it's important that we stay home as much as possible, but sometimes home is not a safe place for everyone. If there is a domestic violence problem, please use these resources and guidelines from @IN_Coalition . #BeWellIndiana Domestic Violence Support | Be Well Indiana \"Home\" is not always a safe place. If you or someone you know is experiencing domestic violence, learn tips and helpful resources here. bewellindiana.com", "2020-06-16T18:30:02.000Z": "Looking for some summer camp fun? Summer camps look a little different this year at the #IndianaStateMuseum , but we still want to bring fun summer camp experiences and memories to you...at home! Learn more and choose your Camp in a Box kit here: https:// bit.ly/3cSX6HE", "2020-06-16T13:20:57.000Z": "Here are the guidelines for Stage 4 of our #BackOnTrack plan.\n\nLearn more here: http:// backontrack.in.gov This Tweet is unavailable.", "2020-06-15T17:25:35.000Z": ". @INBMV branches have resumed regular business hours for walk-in customers. Hoosiers can complete all transactions in-branch with the exception of driving skills exams.\n\nVisit https:// in.gov/bmv/2415.htm to view branch hours. Quote Tweet Indiana BMV @INBMV Ready to visit the BMV? Before hitting the road make sure you're ready! Be prepared and view our checklist for your upcoming visit.", "2020-06-15T13:18:05.000Z": "Free tests are now available through @Optum to any Hoosier that wants to get tested for #COVID19 .\n\nTo register, call 888-634-1116 or visit: https:// bit.ly/2YE4qma Quote Tweet Indiana State Department of Health @StateHealthIN Starting tomorrow, #Indiana is opening @Optum -operated sites to ANY Hoosier who wants to get tested for #COVID19 . Symptomatic/asymptomatic Any age Live or work in Indiana\n\nThe tests are free.\n\nTo register, call 888-634-1116 or visit: https:// bit.ly/2YE4qma", "2020-06-12T19:51:37.000Z": "Starting Monday, every OptumServe site in the state will be open to any Hoosier who wants to be tested.\n\nSymptomatic Asymptomatic Any age High risk Live or work in Indiana  Learn more and find a site here  https:// coronavirus.in.gov/2524.htm", "2020-06-12T18:28:42.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 12", "2020-06-12T18:15:08.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 12", "2020-06-12T17:30:14.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 12", "2020-06-12T13:23:46.000Z": ". @EducateIN recently released guidance for the 2020-2021 school year amid #COVID19  https:// bit.ly/2UAL5zw To prepare for the upcoming school year, make sure your child is up-to-date on vaccinations.\n\nVisit @VaccinateIN or https:// bit.ly/2BUvUKV for vaccinations by age.", "2020-06-11T17:20:41.000Z": "Answers to frequently asked questions and instructions to file for COVID-19-related unemployment are available at http:// Unemployment.IN.gov .", "2020-06-11T17:20:40.000Z": "Raceways may open at 50 percent grandstand capacity.\n\nPari-mutuel horse racing may begin with no spectators at Hoosier Park and Indiana Grand facilities. Charity gaming and casinos may open Monday, June 15 with the approval of the Indiana Gaming Commission.", "2020-06-11T17:20:39.000Z": "Amusement parks, water parks and similar facilities may open at 50 percent capacity. Reservations are encouraged to limit the number of customers at any one time. Playgrounds may reopen.", "2020-06-11T17:20:38.000Z": "In Stage 4, Hoosiers 65 and over and those with high-risk health conditions - who are the most vulnerable to the coronavirus - should remain at home as much as possible. Face coverings in public places are recommended.", "2020-06-11T17:20:37.000Z": "The state retains its ability to test all Hoosiers who are #COVID19 symptomatic as well as health care workers, first responders, & frontline employees Health officials have systems in place to contact all individuals who test positive for #COVID19 & expand contact tracing", "2020-06-11T17:20:36.000Z": "I'm grateful to Hoosiers who have helped maintain our momentum & slow the spread of #COVID19 by exercising caution & following health guidance. As we advance to Stage 4 & further reopen Indiana for business, we'll continue to monitor our progress & make data-informed decisions.", "2020-06-11T17:20:35.000Z": "As health indicators remain positive, I have announced all 92 counties in the state can advance to Stage 4 of the #BackOnTrack Indiana plan on Friday, June 12. #BackOnTrack has five stages. Local governments may impose more restrictive guidelines. https:// backontrack.in.gov", "2020-06-11T14:49:59.000Z": "Across Indiana, a reserve workforce of more than 15,000 healthcare professionals and students has stepped up to help those in need during the #COVID19 pandemic. We are thankful to all Hoosiers helping their neighbors in this time of need. #INthistogether", "2020-06-11T13:03:06.000Z": "Keeping kids safe is critical. If you suspect abuse or neglect, please call our hotline at 1-800-800-5556. Quote Tweet Indiana DCS @IndianaDCS This is an important message to share. Just because calls are down does not mean children are safe or are not being harmed. If you suspect abuse or neglect, please call our hotline at 1-800-800-5556. @GovHolcomb  @tstigdon  https:// wibc.com/news/coronavir us/child-abuse-reports-are-way-down-but-abuse-may-not-be/ ", "2020-06-10T18:28:28.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 10", "2020-06-10T18:15:19.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 10", "2020-06-10T17:30:06.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 10", "2020-06-10T13:55:14.000Z": "Help prevent the spread of respiratory illnesses like #COVID19 by taking these daily precautions.\n\nLearn more  http:// coronavirus.IN.gov", "2020-06-09T17:29:14.000Z": "ISDH is proud to partner with @INBlackExpoInc to open a new #COVID19 testing site in #Indy .\n\nLocated at the IBE headquarters, the site is offering FREE testing (Mon-Fri) until June 30. 601 N Shortridge Rd 9a-7p\n\nRegister here https:// lhi.care/covidtesting Indiana Black Expo partners with the Indiana State Department of Health to Provide Covid-19 Testing... Indiana Black Expo and the Indiana State Department of Health will provide COVID-19 testing during the month of June at the IBE headquarters located at 601 North Shortridge Road, Indianapolis,... indianablackexpo.com", "2020-06-09T15:00:00.000Z": "Many food pantries are still open to serve people who are struggling to find food. Visit the map to find locations near you. And if you're healthy and under the age of 60, consider volunteering! Click here for more information: https:// in.gov/fssa/dfr/5768. htm ", "2020-06-09T12:33:49.000Z": "If you have 150 employees or less and are unable to secure PPE on your own, visit the PPE Marketplace to request free supplies.\n\nYou can find the PPE Marketplace at http:// bit.ly/3cd5bqq Quote Tweet Indiana State Department of Health @StateHealthIN Indiana small business owners!\n\nIf you have 150 employees or less and are unable to secure #PPE on your own, please visit the PPE Marketplace to request #FREE supplies.\n\nVisit  https:// bit.ly/3cd5bqq", "2020-06-08T15:49:15.000Z": "IMPORTANT OPERATIONS UPDATE! Beginning June 15, all BMV branches will resume walk-in service! Appointments can still be scheduled. All transactions will be available to complete in a branch with the exception of driving skills exams. Learn more at http:// ow.ly/IByq50A1VDj .", "2020-06-08T16:13:42.000Z": "Students across the state have stepped up to aid in a variety of healthcare needs during the #COVID19 pandemic. More than 950 undergraduates answered the call and joined the Indiana Healthcare Student Volunteer Task Force. #INthistogether", "2020-06-07T23:00:00.000Z": "Indiana: We made it to Stage 3 together, but #COVID19 is still out there.\n\nProtect yourself and others: Cover your coughs/sneezes Wash your hands Wear a cloth mask in public Practice social distancing Clean and disinfect surfaces\n\nLearn more http:// coronavirus.IN.gov", "2020-06-06T15:59:02.000Z": "We should all be comforted knowing her legacy will live on for generations to come. 3/3", "2020-06-06T15:59:01.000Z": ". @FLJanetHolcomb and I were heartbroken to hear of the passing of a great community leader Christel DeHaan, and we are keeping her family in our thoughts. Christel was a world renown humanitarian, rooted in her expertise in business and expressed through immense compassion. 1/3", "2020-06-05T20:38:13.000Z": "I was able to spend some time with the incredible healthcare team running the Fairbanks testing @IvyTechCC . If asked, please participate in this study to help us learn more about #COVID19 . https:// bit.ly/2XEy2z3", "2020-06-05T19:45:28.000Z": "Expand the Employer Training Grant to serve 25,000 more Hoosiers, specifically supporting women-, minority- and veteran-owned businesses; and doubling the amount of reimbursable funds to employers", "2020-06-05T19:45:27.000Z": "CARES Act funding enables Indiana to: Grow short-term education and training by enhancing the Workforce Ready Grant to provide support to at least 10,000 more Hoosiers in the following ways:", "2020-06-05T19:45:26.000Z": "In addition, the Rapid Recovery initiative is providing enhanced, consolidated and simplified resources for employers with the partnership of the @IndianaChamber . Institute for Workforce Excellence Indiana Vision 2025 Top Victories Policy Center How Legislators Voted District Maps IBRG PAC Workforce Institute The Institute for Workforce Excellence® is dedicated to helping businesses attract,... indianachamber.com", "2020-06-05T19:45:25.000Z": "Connect to opportunities with the assistance of career coaches and navigators to empower Hoosiers to assess and develop their skills and gain better understanding of job needs and opportunities.", "2020-06-05T19:45:24.000Z": "A comprehensive outreach network will share the state's resources with Hoosiers from their own trusted sources: community leaders, pastors or other faith leaders and employers.", "2020-06-05T19:45:23.000Z": "\"Rapid Recovery for a Better Future\" combines the leadership of the GWC, Indiana employers, education & training providers, policymakers & state & local partners with the goal of ensuring Indiana's recovery from #COVID19 & providing a pathway to a better future for every Hoosier.", "2020-06-05T19:45:22.000Z": "Today I announced a new initiative to help Hoosiers, communities and businesses get back to work and connected to the resources that can help people move forward during the #COVID19 pandemic.", "2020-06-05T18:28:15.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 5", "2020-06-05T18:15:07.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 5", "2020-06-05T17:30:15.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 5", "2020-06-05T13:50:32.000Z": "There's still time to sign up for those selected to participate in the second phase of the #COVID19 impact study with @FSPH_IUPUI . If you receive a text or postcard from us, PLEASE RESPOND - even if you've been tested before and don't have symptoms. (1 of 2)", "2020-06-04T23:24:10.000Z": "We understand that #COVID19 has been challenging - on every level - but we're not in the clear yet. Wash your hands Wear a cloth mask in public Practice social distancing Stay home if you feel sick\n\nKeep going, Indiana. #INThisTogether   http:// coronavirus.IN.gov", "2020-06-04T21:07:16.000Z": "The @IndyStateFair is an incredible annual tradition that I and thousands of Hoosiers look forward to every year. While I'll miss celebrating new memories with all the great food, animals, and exhibits, I support the decision to prioritize safety and hold 1/2", "2020-06-04T14:48:41.000Z": "TESTING SITES If you're looking for a list of #COVID19 testing sites in #Indiana , check out this interactive map.\n\nAlong with locations, you'll find hours of operation, requirements and important FAQs.\n\nVisit  https:// bit.ly/35v3i5P", "2020-06-04T14:15:51.000Z": "The first round awarded $28.4 million for 14 broadband expansion infrastructure projects across 18 counties.", "2020-06-04T14:15:50.000Z": "For this round of funding, service providers were able to apply for up to $5 million per project to expand service to unserved areas.", "2020-06-04T14:15:49.000Z": "Now more than ever affordable, high quality internet is essential for Hoosiers, and I'm thrilled to be taking the next step to expand access through #NextLevelConnections - the largest single state investment in broadband.", "2020-06-04T14:15:48.000Z": ". @LGSuzanneCrouch and I announced that the second round of the #NextLevelConnections Broadband Grant program has received 72 applications requesting a total of nearly $100 million in funding.", "2020-06-04T12:10:29.000Z": "More information may be found at the @StateHealthIN website at http:// coronavirus.in.gov and the @CDCgov website at https:// cdc.gov/coronavirus/20 19-ncov/index.html  . Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-06-04T12:10:28.000Z": "I also signed Executive Order 20-31 which allows older youth to remain in foster care beyond the age of 18 for the duration of the public health emergency. This will allow them to continue to receive education, workforce training and health benefits.", "2020-06-04T12:10:27.000Z": "I have signed Executive Order 20-30 to extend the public health emergency for an additional 30 days to July 4th.", "2020-06-03T20:03:31.000Z": "The HIP Workforce Bridge program will be especially important during our state's recovery from the COVID pandemic and as Indiana's economy evolves.\n\nClick here to learn more: https:// bit.ly/2XsVnU4", "2020-06-03T18:30:59.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 3", "2020-06-03T18:15:08.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 3", "2020-06-03T17:30:09.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - June 3", "2020-06-03T15:59:38.000Z": "To restart Indiana's economic engine, it's critical that we provide Hoosier businesses and entrepreneurs with the support they need to grow and get #BackOnTrack . Quote Tweet Indiana Economic Development Corp. @Indiana_EDC The application for the Small Business Restart Grant is live at http:// BackOnTrack.in.gov ! These grants provide working capital for eligible businesses to cover expenses related to the global pandemic, such as rent/mortgage payments, utilities, lease payments & safety investments.", "2020-06-03T14:29:30.000Z": "Many food pantries remain open to assist Hoosiers during the #COVID19 emergency.\n\nVisit this statewide interactive map to find food assistance in your area.  https:// bit.ly/3ab0TxJ", "2020-06-02T13:47:10.000Z": "June 1-7 each year is National CPR and AED Awareness Week, spotlighting how lives can be saved if more Americans know CPR and how to use an AED. Learn how you can help save a life because every second counts. #CPRAEDAwarenessWeek", "2020-06-01T22:03:00.000Z": "Help the @INRedCross prevent a blood shortage amid the #COVID19 pandemic. Blood donations are urgently needed. In appreciation, those who come to #DonateBlood or platelets in June will get a $5 Gift Card by email, thanks to Amazon. \n\nDetails: http:// rcblood.org/together", "2020-06-01T20:42:49.000Z": "We don't have more time or lives to lose.\n\nHoosiers - whether in the privacy of your own home or at a peaceful demonstration - engage in efforts that bridge, not divide.\n\nOnly then, will these tense and turbulent times give way to the more optimistic days ahead.", "2020-06-01T17:29:08.000Z": "Governor Eric Holcomb @GovHolcomb News conference with public safety officials to discuss weekend events", "2020-06-01T17:15:02.000Z": "In 15 minutes, I'll hold a virtual press conference to discuss the events of the weekend.\n\nTune in live at 1:30 p.m. ET (12:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb News conference with public safety officials to discuss weekend events", "2020-06-01T16:30:12.000Z": "In one hour, I'll hold a virtual press conference to discuss the events of the weekend.\n\nTune in live at 1:30 p.m. ET (12:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb News conference with public safety officials to discuss weekend events", "2020-06-01T14:47:20.000Z": "Today I'll hold a virtual press conference to discuss the events of the weekend.\n\nTune in live at 1:30 p.m. ET (12:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb News conference with public safety officials to discuss weekend events", "2020-06-01T12:27:40.000Z": "Proud to have @IMS helping test for #COVID19 . Quote Tweet Indiana State Department of Health @StateHealthIN The world's largest sporting venue is now perhaps the world's largest #COVID19 testing site.  @IMS is in the fight. https:// fox59.com/news/indianapo lis-motor-speedway-opens-as-new-covid-19-testing-site/ ", "2020-05-30T17:21:48.000Z": "In the days ahead, peaceful assembly and clear voices will be important if we are to make progress.  Violence and vandalism will set us back in our shared desire to resolve differences.  Let us again, each of us, be part of the solution. 3/3", "2020-05-30T17:21:47.000Z": "Hoosiers have long been people who find solutions to the challenges we face, whether it be in response to a pandemic or to an injustice like the world witnessed so tragically inflicted upon Mr. George Floyd in Minnesota. 1/3", "2020-05-29T19:55:49.000Z": "Since its inception, Indiana has received 26,130 orders for PPE and has fulfilled 25,500 orders, shipping bundles of hand sanitizer, face masks and face shields to companies across the state. To learn more about other #COVID19 resources, visit http:// iedc.in.gov/response .", "2020-05-29T19:55:48.000Z": "Additionally, according to the @SBAgov , Indiana is home to approximately 104,335 small businesses that employ fewer than 150 associates, supporting 941,578 Hoosiers across the state.", "2020-05-29T19:54:16.000Z": "Indiana's manufacturing & small business sectors play critical roles in supporting the state's economy. W/ more than 8,500 manufacturing facilities & the highest concentration of manufacturing jobs in the U.S., manufacturing accounts for 27.8% of Indiana's total economic output.", "2020-05-29T19:54:15.000Z": "More information on EASE, which is funded through the state's 21st Century Research and Technology Fund, is available here: https:// mcusercontent.com/1c7397d5fea5d8 18a66609a67/files/3cb264fd-6713-4b38-8697-f486c3decbbd/EASE_Handout_Final.pdf ", "2020-05-29T19:54:13.000Z": ". @Indiana_EDC will partner with industry stakeholders to develop a project scope for the Smart Manufacturing Studio Lab, mapping out next steps and a plan to source and supply the equipment, working toward a studio launch in early 2021.", "2020-05-29T19:54:12.000Z": "Of these programs, the SAM Focus Fund will launch immediately while the Manufacturing Readiness Grant applications are expected to be available in July with initial grant recommendations beginning in August.", "2020-05-29T19:54:11.000Z": "A planned Smart Manufacturing Studio Lab, which will provide lab space and access to state-of-the-art smart manufacturing equipment, enabling businesses to train employees, validate technologies for their business models, and conduct third-party pilot manufacturing.", "2020-05-29T19:54:10.000Z": "companies investing in health care manufacturing technology, providing financial assistance to manufacturers supporting critical #COVID19 response efforts; and", "2020-05-29T19:54:08.000Z": "prioritizing startup investment and resources, technology modernization and development, and training assistance.\n\nThe three EASE initiatives include:", "2020-05-29T19:54:07.000Z": "Manufacturing Support & Long-Term Growth: The @Indiana_EDC board of directors approved $10 million to launch the Economic Activity Stabilization and Enhancement (EASE) program aimed at supporting technology and operational advancements in the manufacturing industry, which has", "2020-05-29T19:54:06.000Z": "Services will be available through the Indiana SBDC's 10 regional offices across the state and are expected to focus on financial assistance, e-commerce, business adaptation and innovation, disaster resiliency and planning, and reopening plans.", "2020-05-29T19:54:05.000Z": "The funding, which will nearly double the organization's annual federal appropriations, will enable Indiana SBDC to increase no-cost services, such as counseling and training, for businesses that were in operation prior to and that have been impacted by #COVID19 .", "2020-05-29T19:54:04.000Z": "Small Business Relief & Planning Resources: The Indiana Small Business Development Center (Indiana SBDC) received nearly $3.7 million from the @SBAgov through the CARES Act to support increased resources for Hoosier entrepreneurs and small businesses over the next 18 months.", "2020-05-29T19:54:03.000Z": "Of the $30 million allocated to the fund, at least $5 million will be reserved for certified minority- and women-owned businesses. \n\nMore information on the program, including additional eligibility requirements, is available here: https:// mcusercontent.com/1c7397d5fea5d8 18a66609a67/files/2ac98567-1c53-44a1-bea1-c5910b641251/BackOnTrack_IN_FAQ_Small_Business_Restart_Fund.pdf ", "2020-05-29T19:54:02.000Z": "the global pandemic. Indiana small businesses with fewer than 50 employees and $5 million in annual revenue that have experienced a 40% drop in revenue will be eligible to be reimbursed for up to 80% of qualified expenses, such as rent or mortgage payments, utilities, lease", "2020-05-29T19:54:01.000Z": "Small Business Restart Fund: I approved $30 million in federal funding made available through the CARES Act to small business restart grants, helping accelerate the speed of economic recovery activity by providing working capital to cover certain expenses related to", "2020-05-29T19:53:59.000Z": "To safely guide a return to economic activity, the state is committed to deploying federal relief funds under the CARES Act in coordination with Indiana's Economic Relief and Recovery Team, while targeting initiatives aimed at achieving long-term economic stabilization.", "2020-05-29T19:53:58.000Z": "To restart Indiana's economic engine, it's critical that we provide Hoosier businesses and entrepreneurs with the support they need to grow and get #BackOnTrack .", "2020-05-29T19:53:57.000Z": "Today I announced several new economic recovery initiatives designed to bolster critical relief efforts while encouraging long-term planning and investments to stimulate Indiana's economy well into the future.", "2020-05-29T18:29:37.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 29", "2020-05-29T18:15:45.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 29", "2020-05-29T17:30:10.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 29", "2020-05-29T14:10:31.000Z": "You can visit your doctor from home and practice social distancing. You can do both by contacting your doctor for telehealth visits. Click here for more information: https:// in.gov/fssa/5756.htm", "2020-05-29T12:29:25.000Z": "The Class of 2020 will make Indiana and our world a better place. Here's a great message for graduates from the @Pacers and @IndianaFever . Congratulations To The Class of 2020 A special message from Pacers Broadcaster Chris Denari, Pacers Head Coach Nate McMillan, and Fever Head Coach Marianne Stanley. youtube.com", "2020-05-29T01:55:38.000Z": "Thanks @realdonaldtrump for this $100M investment of @USDOT transit funds in the West Lake Corridor Project. @RepVisclosky  @SenToddYoung  @SenatorBraun  @RepWalorski  @RepJimBanks  @RepJimBaird  @SusanWBrooks  @GregPenceIN  @RepAndreCarson  @RepLarryBucshon  @RepTrey  @SecElaineChao  @vp Quote Tweet Donald J. Trump @realDonaldTrump Indiana is set to receive $100M in @USDOT transit funds for the @southshoreline to connect people to jobs around the State and the Chicago-area and help cut down on traffic. @GovHolcomb has worked very hard on this project!", "2020-05-28T15:42:38.000Z": "Find trusted, reliable resources and connect with organizations that are here to support your mental health and http:// BeWellIndiana.com .", "2020-05-28T12:29:22.000Z": "Social distancing continues to be critical as Indiana gets #backontrack . Keep at least 6 feet between yourself + others Wear a cloth mask in public", "2020-05-28T13:09:10.000Z": "I'm confident that the Class of 2020 will make Indiana and our world a better place. Congratulations graduates!", "2020-05-27T18:29:53.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 27", "2020-05-27T17:30:06.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 27", "2020-05-27T15:01:56.000Z": "Today, @GovHolcomb and @confectionsmd will welcome Dr. Ukamaka Oruchi of @IUSONIndy to discuss how #COVID19 is impacting kids' mental health. For a preview, watch her #BeWellIndiana video with tips to help children with emotional or behavioral challenges. Parenting Children with Behavioral Challenges | Be Well Indiana Find parenting tips to help you care for children with emotional or behavioral challenges and yourself during this unprecedented time. bewellindiana.com", "2020-05-27T12:43:58.000Z": "We have seen a wide range of healthcare workers step up to aid Hoosiers during the #COVID19 pandemic. One group of nearly 125 doctors graduated early from medical school to join in the fight. #INthistogether", "2020-05-26T15:08:00.000Z": "Stage 3 of Indiana's #BackOnTrack plan started on May 22 for most counties. \n\nHere's a snapshot of what that means.\n\nVisit: http:// BackOnTrack.IN.gov  #INThisTogether", "2020-05-26T13:07:16.000Z": "Thinking about traveling? Before you go, @CDCgov says you should consider the following: \n\n Is #COVID19 spreading where you're going? \n Is #COVID19 spreading in your community? \n\nFor more considerations visit: http:// bit.ly/2IZicXj", "2020-05-25T22:05:00.000Z": "UPDATE: The ISDH call center hours have recently changed. If you have questions about #COVID19 , we're available every day from 8:00 a.m. to 8:00 p.m. 877-826-0011\n\nLearn more: http:// coronavirus.IN.gov", "2020-05-25T13:18:05.000Z": "Today we honor the lasting legacy of those who valiantly served and gave their all. #COVID19 may keep us from gathering, but it can't dampen our resolve to honor the memory of those who were taken from us too soon. #MemorialDay", "2020-05-22T18:12:05.000Z": "#ICYMI : @GovHolcomb 's Executive Order yesterday included important extensions.\n\nExtended until July 1 Prohibition on turning off utilities Prohibition on filing mortgage foreclosures/evictions Certain motor vehicle transactions\n\nRead the order: https:// bit.ly/2Tu8IZP", "2020-05-22T18:29:51.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 22", "2020-05-22T18:15:15.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 22", "2020-05-22T17:30:12.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 22", "2020-05-21T18:23:02.000Z": "Today I joined @IBAHome for a virtual meeting with their members. I had an opportunity to discuss @GovHolcomb 's updated Back on Track plan and answer their questions on how Indiana is responding to COVID-19.", "2020-05-22T12:26:09.000Z": "#INthistogether Quote Tweet Indiana Economic Development Corp. @Indiana_EDC We are grateful for our friends at @CookMedical for donating 45K gowns to the state and for @BHA for transporting them to Indianapolis! Indiana businesses continue to step up to keep our health care workers on the front line safe. #INthistogether  @GovHolcomb  @StateHealthIN twitter.com/CookMedical/st", "2020-05-22T02:22:28.000Z": "Congratulations to Hoosier @ChaseBriscoe5 on your incredible win today at Darlington, while racing with a heavy heart. Our prayers are with your family in this difficult time.", "2020-05-21T19:47:30.000Z": "Answers to frequently asked questions and instructions to file for COVID-19-related unemployment are available at http:// Unemployment.IN.gov .", "2020-05-21T19:47:29.000Z": "If health indicators remain positive, the state will move to stage 4 in mid-June. To learn more about the different stages and the associated dates to get a better understanding about where we're going as a state, click here to see the full plan: http:// BackOnTrack.in.gov", "2020-05-21T19:47:28.000Z": "Restaurants and bars with restaurant services may continue to operate at 50% capacity, but bar seating must remain closed.", "2020-05-21T19:47:27.000Z": "Community pools may open according to @CDCgov guidance. Community tennis and basketball courts, soccer and baseball fields, YMCA programs, and similar facilities may open with social gathering and social distancing guidelines in place.", "2020-05-21T19:47:26.000Z": "In Stage 3, Hoosiers 65 and over and those with high-risk health conditions - who are the most vulnerable to #COVID19 - should remain at home as much as possible. Face coverings in public places are recommended. Hoosiers who can work from home are encouraged to continue to do so.", "2020-05-21T19:47:25.000Z": "The state retains its ability to test all Hoosiers who are COVID-19 symptomatic as well as health care workers, first responders, & frontline employees Health officials have systems in place to contact all individuals who test positive for #COVID19 & expand contact tracing", "2020-05-21T19:47:24.000Z": "We continue to remain vigilant about protecting Hoosiers' health while taking responsible steps to further open our state's economy. Moving to stage 3 is possible because Hoosiers across the state have worked together and made sacrifices to slow the spread.", "2020-05-21T19:47:23.000Z": "Today I announced that because health indicators remain positive, most of the state will advance to stage 3 of the #BackOnTrack Indiana plan on Friday, May 22.", "2020-05-21T14:08:42.000Z": "Most people are experiencing some amount of grief, stress or worry due to #COVID19 . For some, those feelings can become overwhelming. \n\nSupport is available at: http:// BeWellIndiana.com  #MentalHealthAwarenessMonth", "2020-05-20T17:27:00.000Z": "There is a critical need for blood donation in Indiana and around the country, and the need is increasing with each passing day. \n\nMake an appointment today to donate! We're all #INThisTogether ! Urgent need for blood donations across the nation Versiti Blood Center of Indiana has an urgent need for blood donations from O negative and O positive donors​. wthr.com", "2020-05-20T19:39:51.000Z": "You may be struggling with hunger and experiencing food insecurity. \"Operation Food\" was created to help ensure Hoosiers are fed across the state. Please visit http:// operationfood.in.gov for food assistance and know we are #INthistogether . Here's @confectionsmd with more.", "2020-05-20T18:30:43.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 20", "2020-05-20T18:15:11.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 20", "2020-05-20T17:30:05.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 20", "2020-05-20T14:05:07.000Z": "Before heading to a BMV branch, don't forget to schedule an appointment! While many BMV branches have reopened, Hoosiers are required to schedule an appointment online at http:// ow.ly/z9ii50zGhka before making the trip. #INBMV  #INThisTogether", "2020-05-20T12:57:00.000Z": "Teachers across our state have stepped up during a pandemic to continue helping kids learn. Congratulations to our Hoosier teachers for being recognized as 2021 Indiana Teacher of the Year! Quote Tweet Indiana State Department of Health @StateHealthIN Indiana's teachers have gone above and beyond this year to keep students learning during the #COVID19 pandemic.\n\nThat is why @EducateIN has named all Indiana teachers as the 2021 Indiana Teacher of the Year!\n\nRead More: https:// wthr.com/article/indian a-department-education-recognizes-all-teachers-2021-teacher-year ", "2020-05-19T15:05:00.000Z": "Farmers who have lost income due to COVID-19 will be able to apply for aid under the Coronavirus Food Assistance Program. \n\nSignup begins soon, but you can start preparing now. \n\nLearn more: http:// farmers.gov/CFAP", "2020-05-19T17:48:57.000Z": "#INthistogether Quote Tweet Suzanne Crouch @LGSuzanneCrouch This morning @INTourismPR and I joined @IndianaRLA for a Q&A forum with their members. This industry was immediately impacted by COVID-19 and we are working alongside them on their road to recovery.", "2020-05-19T13:07:22.000Z": "Testing capacity has expanded across Indiana. @StateHealthIN asks Hoosiers to get tested for #COVID19 if you are experiencing symptoms, are in a high risk group, or have been in contact with someone who has COVID-19. Register at http:// lhi.care/covidtesting or by calling 888-634-1116.", "2020-05-19T11:36:42.000Z": "Responding to nearly 1,000,000 calls each year in our State, the Indiana EMS system remains the front line of medical treatment and care. Thank you to all EMS personnel who spend shifts in an ambulance or riding a fire truck, never knowing what the next call may bring. #EMSstrong", "2020-05-18T19:06:02.000Z": "Our Hoosier EMS professionals spring into action & answer the call every day ⁠- & we're so grateful. Thank you for all you continue to do during #COVID19 . #EMSWeek2020", "2020-05-18T18:30:49.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 18", "2020-05-18T18:15:10.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 18", "2020-05-18T17:30:08.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 18", "2020-05-18T13:27:23.000Z": "May 17-23 marks the 46th annual National EMS Week. On behalf of the IDHS staff, we are proud to honor Hoosier EMS during national EMS Week. #EMSstrong", "2020-05-18T13:54:33.000Z": "Effective July 1, Indiana Health Coverage Programs, which includes the Healthy Indiana Plan, Hoosier Healthwise, Hoosier Care Connect and Traditional Medicaid, will reimburse specialty providers who bill the state after a naloxone administration.", "2020-05-18T13:54:32.000Z": ". @FSSAIndiana and @IDHS also announced today that Indiana's emergency medical responders will be reimbursed in full through the state's Medicaid program when they administer naloxone.", "2020-05-18T13:54:31.000Z": "Naloxone is a critical tool for individuals, families, first responders and communities to help reduce opioid overdose deaths. Access to naloxone, however, continues to be limited in some communities.", "2020-05-18T13:54:30.000Z": "Naloxone, or Narcan, is a medication approved to prevent overdose by opioids. Naloxone is given when a person is showing signs of opioid overdose.\n\nIt blocks the toxic effects of the overdose and is often the difference between a patient living and dying.", "2020-05-18T13:54:29.000Z": "Today @FSSAIndiana and I announced the state will fund a nearly $1 million distribution of the opioid reversal agent naloxone to ensure the medication reaches Hoosiers who are at-risk of overdose.", "2020-05-18T12:50:52.000Z": "Here are some great resources for Hoosiers as we fight #COVID19 . Quote Tweet Indiana State Department of Health @StateHealthIN Indiana has resources available to assist Hoosiers during this crisis.\n\nHere are to know COVID-19 http:// coronavirus.IN.gov  Mental health http:// BeWellIndiana.com  Food map https:// bit.ly/3ab0TxJ  Unemployment http:// unemployment.IN.gov  Back on Track http:// BackOnTrack.IN.gov", "2020-05-15T18:29:38.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 15", "2020-05-15T18:15:08.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 15", "2020-05-15T17:30:09.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 15", "2020-05-15T16:20:54.000Z": "It takes a special person to run towards danger when everyone else is running away. Thank you to all of our heroes who have made the ultimate sacrifice to keep us safe. #PeaceOfficersMemorialDay", "2020-05-15T12:17:56.000Z": "Did you know it is #MentalHealthAwarenessMonth ? \n\nIt's always important to take care of your mental health, but during the #COVID19 emergency, we wanted to provide a few tips for healthy ways to cope with this crisis.", "2020-05-14T17:52:07.000Z": "#ShareTheGoodIN Quote Tweet Indiana Homeland Security @IDHS We want to \"share the good\" that Hoosier first responders and their communities are doing during #COVID19 . If you have a story of a first responder that deserves recognition, please share them with us here: http:// bit.ly/ShareTheGoodIN . #ShareTheGoodIN", "2020-05-14T12:39:24.000Z": "Washing your hands often and thoroughly is one of the best ways to protect yourself and others from #COVID19 . Follow these handwashing tips from @StateHealthIN and help keep Hoosiers safe while we get #BackOnTrack .", "2020-05-13T20:57:36.000Z": "Thank you to the Shelby County Tourism and Visitors Bureau for the work you are doing in your community and for sending me this shirt to help spread the word during today's #COVID19 press conference. #INthistogether", "2020-05-13T18:33:16.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 13", "2020-05-13T18:15:11.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 13", "2020-05-13T17:31:02.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 13", "2020-05-12T23:03:36.000Z": "To slow the spread of #COVID19 , it's important to regularly clean and disinfect high-touch surfaces. Remember to throughly disinfect everyday electronics like your phone and computer. #BackOnTrack", "2020-05-13T12:17:32.000Z": "Our state's food banks and pantries are stepping up to feed Hoosiers in need. They need your help and support. #INthistogether Quote Tweet Indiana State Department of Health @StateHealthIN Across the state, food banks and pantries are stepping up to feed Hoosiers in need during the #COVID19 pandemic. They now need your support to continue their work. Please call your local food bank today and make a donation. #INthistogether", "2020-05-12T19:02:49.000Z": "Starting this week, we've moved our press conferences to Monday, Wednesday, & Friday at 2:30 p.m. ET @StateHealthIN will continue to update our numbers daily at https:// coronavirus.in.gov .\n\nWe'll continue to provide #COVID19 updates as we work together to get Indiana #BackOnTrack .", "2020-05-12T16:36:51.000Z": "You've heard of \"contact tracing,\" but do you know what it means and how it works to help keep you, your families and communities safe from #COVID19 ? Watch this and learn! #INthistogether  #BackonTrack  @StateHealthIN  @GovHolcomb", "2020-05-11T14:53:23.000Z": "We want to hear from small business owners to assess impact + immediate and future needs of small businesses during the COVID-19 pandemic. #INSmallBiz owners are encouraged to fill out this confidential form ASAP. http:// bit.ly/INSmallBiz", "2020-05-12T12:51:12.000Z": "We are opening 50 #COVID19 testing sites across the state. The test is free for all Hoosiers. If you have symptoms, have been exposed to #COVID19 , or are at a higher health risk, make an appointment today. #INthistogether", "2020-05-11T18:28:42.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 11", "2020-05-11T18:15:08.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 11", "2020-05-11T17:44:47.000Z": "Hope happens when good people attend to needs and a calling. Quote Tweet General Motors Manufacturing @MFG_GM Indiana's @GovHolcomb said it best when he wrote, \"Hope happens when good people attend to needs and a calling\". We are so proud of our employees in Kokomo, IN, and we're glad their work is being recognized.", "2020-05-11T17:30:47.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 11", "2020-05-11T13:36:50.000Z": "As Hoosiers prepare for the safe reopening of our economy, we know many business owners across the state likely have questions about the necessary changes and requirements before opening their doors. We stand ready to help you through each phase of this reopening. #INthistogether", "2020-05-10T13:04:00.000Z": "Social distancing is an essential part of safely reopening Indiana and getting #BackOnTrack . Remember to stay 6 feet apart, and follow these guidelines from @StateHealthIN as Hoosiers return to work.", "2020-05-08T21:26:12.000Z": "The executive order also extends specific individual and business tax deadlines to match federal law.\n\nClick here to see the executive order: https:// in.gov/gov/2384.htm", "2020-05-08T21:26:11.000Z": "Today I signed Executive Order 20-27 to further extend @INBMV renewal deadlines. Driver's licenses, identification cards and vehicle registrations that expire prior to June 4 will now be valid through June 4.", "2020-05-08T18:29:30.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 8", "2020-05-08T18:15:45.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 8", "2020-05-08T17:30:19.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 8", "2020-05-08T15:13:17.000Z": "Vuelta al camino el plan de Indiana explicado.", "2020-05-08T14:43:55.000Z": "The Indiana SBDC is collecting data to assess the impact + immediate and future needs of small businesses during the COVID-19 pandemic. #INSmallBiz owners are encouraged to fill out this confidential form ASAP to help get Indiana's economy back on track! http:// bit.ly/INSmallBiz", "2020-05-07T23:03:25.000Z": ". @CDCgov recently updated the list of #COVID19 symptoms. Watch the video to learn more.\n\nIf you are symptomatic or at a higher risk please call your healthcare provider. You can also register for a free test at https:// lhi.care/covidtesting or by calling 888-634-1116.", "2020-05-07T18:30:27.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 7", "2020-05-07T18:15:09.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 7", "2020-05-07T17:30:19.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 7", "2020-05-06T12:52:10.000Z": "#COVID19 can be scary and stressful for some Hoosiers. Mental Health professionals across Indiana are here to help you. Watch this video to learn the signs that you or a loved one might need to talk to a professional.", "2020-05-07T12:16:15.000Z": "What you eat and how you spend your time can affect your mental health. Make thoughtful decisions throughout the day to help improve your well-being. http:// BeWellIndiana.com  #BeWellIndiana", "2020-05-06T20:26:08.000Z": "Today & every day, thank you to our nurses who are on the front lines caring for Hoosiers during #COVID19 . #NationalNursesWeek", "2020-05-06T18:29:35.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 6", "2020-05-06T18:15:04.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 6", "2020-05-06T17:30:07.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 6", "2020-05-06T17:00:37.000Z": "The Indiana Small Business PPE Marketplace is live! Visit http:// BackOnTrack.in.gov to learn more. Quote Tweet Indiana Economic Development Corp. @Indiana_EDC The Indiana Small Business PPE Marketplace is live on http:// BackOnTrack.in.gov ! This online hub will serve as a resource for eligible Indiana small businesses and nonprofits that are in need of PPE, ensuring the health and safety of their workforce. @GovHolcomb Show this thread", "2020-05-05T22:38:20.000Z": "As we continue to navigate #COVID19 , it's important for us to help our children and teens learn how to cope. Here are some tips for navigating this challenging time.", "2020-05-06T12:34:56.000Z": "Registration is open now at http:// lhi.care/covidtesting . Quote Tweet Indiana State Department of Health @StateHealthIN FREE TESTING Registration begins tomorrow for 20 #COVID19 testing sites across the state, managed by ISDH and @Optum .\n\nTesting is FREE and insurance is not required. However, if you have private insurance, please bring that information with you.\n\nRegister https:// lhi.care/covidtesting Show this thread", "2020-05-05T21:29:52.000Z": "Thank you teachers for inspiring classrooms across Indiana during this difficult #COVID19 pandemic. #TeacherAppreciationDay Quote Tweet Janet Holcomb @FLJanetHolcomb I've met virtually with teachers and students across our state over the past several weeks. I'm blown away by the passion each educator has for the kids in their class. Happy #TeacherAppreciationDay ! Thank you for the hard work you all put in daily.", "2020-05-05T12:23:48.000Z": "During #COVID19 , it's important that we stay home as much as possible, but home is not a safe place for all Hoosiers. If you or someone you know is experiencing domestic violence, use these resources to help them plan the best strategy to get through this time safely.", "2020-05-05T18:31:15.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 5", "2020-05-05T18:15:08.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 5", "2020-05-05T17:30:07.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 5", "2020-05-05T14:33:31.000Z": "Thanks to the discipline and actions of 6.7 million Hoosiers, we're ready to move ahead in a measured way. Let's safely open Indiana's economy and remain vigilant about protecting our health and well-being. Ultimately, we will get #BackOnTrack and create an even stronger Indiana.", "2020-05-04T23:08:31.000Z": "The uncertainties and fear around #COVID19 may lead to severe feelings of anxiety or panic. Remember your feelings are valid and you are not alone. Follow these techniques and strategies to help manage your anxiety, and seek help if your symptoms deeply affect your daily life.", "2020-05-03T19:15:09.000Z": "Before heading to a branch, make sure to schedule an appointment! While a select branches have reopened, Hoosiers must schedule an appointment online at http:// ow.ly/5BFr50zuuOq . As a reminder, many transactions can be completed online or at a kiosk. #INBMV  #INThisTogether", "2020-05-04T18:29:30.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 4", "2020-05-04T18:15:49.000Z": "In fifteen minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 4", "2020-05-04T17:30:09.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - May 4", "2020-05-04T14:34:43.000Z": "Students in all 92 counties across our state are continuing to connect & learn during the #COVID19 pandemic. Thank you to all the dedicated educators that are ensuring a bright future for Hoosiers for years to come.\n\nTeacher Appreciation Week proclamation: https:// in.gov/gov/files/Gove rnor_Holcomb_Teacher_Appreciation_Week_proclamation.pdf ", "2020-05-04T13:01:07.000Z": ". @StateHealthIN will be offering 5 new #COVID19 drive-thru testing clinics this week. Quote Tweet Indiana State Department of Health @StateHealthIN Announced today, ISDH will be offering 5 new #COVID19 drive-thru testing clinics this week.\n\nMay 4-5 (9am to 6pm CT) East Chicago\n\nMay 6-9 (9am to 6pm ET) Lafayette New Castle Plymouth Seymour\n\nLearn more  https:// theindychannel.com/news/coronavir us/covid-19-healthcare/state-health-department-announces-5-new-covid-19-drive-thru-clinics  Show this thread", "2020-05-02T12:25:06.000Z": "The @500Festival  #IndyMini may look different this year, but I'm still cheering for everyone who is participating while social distancing. Good luck! Quote Tweet Governor Eric Holcomb @GovHolcomb And they're off! Good luck to all of today's @500Festival  #IndyMini participants.", "2020-05-01T20:05:08.000Z": "The Critical Industries Hotline continues to be available from 9 a.m. to 6 p.m. ET Monday through Friday to respond to business and industry questions about whether a business is considered essential. 877-820-0890 covidresponse@iedc.in.gov", "2020-05-01T20:05:07.000Z": "If health indicators remain positive, the state will move to Stage 3. To learn more about the different stages and the associated dates to get a better understanding about where we're going as a state, click here to see the full plan: http:// BackOnTrack.in.gov", "2020-05-01T20:05:06.000Z": "Restaurants & bars that serve food may open starting May 11 @ 50% capacity, but bar seating will remain closed. Personal services - hair salons, barber shops, nail salons, spas and tattoo parlors - may open on May 11 by appointment only & must follow social distancing guidelines.", "2020-05-01T20:05:05.000Z": "Essential travel restrictions will be lifted, and social gatherings of up to 25 people will be permitted following the @CDCgov 's social distancing guidelines.", "2020-05-01T20:05:04.000Z": "Indiana #BackOnTrack has five stages. Beginning Monday, May 4, nearly all of Indiana will move to stage 2. For three counties - Cass, Lake and Marion counties - stage 2 will begin at a later date. Phase 2 may begin on Monday, May 11 for Lake and Marion counties.", "2020-05-01T20:05:03.000Z": "The state retains its ability to test all Hoosiers who are #COVID19 symptomatic as well as health care workers, first responders, & frontline employees Health officials have systems in place to contact all individuals who test positive for #COVID19 & expand contact tracing", "2020-05-01T20:05:02.000Z": "Across Indiana, we've witnessed a spirit of cooperation & caring for others that has touched my heart. May this spirit of appreciation for one another carry on long after #COVID19 is behind us. Hoosiers have done this together & together we'll come out a stronger Indiana.", "2020-05-01T20:05:01.000Z": "Today I announced the #BackOnTrack Indiana plan to safely open the economy and remain vigilant about protecting Hoosiers' health and wellbeing.", "2020-05-01T19:33:02.000Z": "Thanks to the discipline and actions of 6.7 million Hoosiers, we are ready to move ahead in a measured way. \n\nThis is our 5-Stage plan to get Indiana #BackOnTrack . It's a\nmethodical, step-by-step plan for steady progress which we'll carefully monitor. http:// BackOnTrack.in.gov", "2020-05-01T18:29:27.000Z": "Governor Eric Holcomb @GovHolcomb Indiana #COVID19 Update - May 1", "2020-05-01T18:15:33.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana #COVID19 Update - May 1", "2020-05-01T17:30:04.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana #COVID19 Update - May 1", "2020-05-01T14:21:38.000Z": "We extend our sincere gratitude to Indiana's healthcare workers, first responders and essential workers! \n\nYou truly are Hoosier Heroes! #INThisTogether", "2020-05-01T13:27:55.000Z": "I'm thankful for our @INGuardsman during this #COVID19 pandemic. Quote Tweet Indiana State Department of Health @StateHealthIN #COVID19 isn't the first big challenge our state has faced, but it is unlike any we've faced before.\n\nFortunately, we have soldiers. https:// nationalguard.mil/News/Article/2 171067/indiana-national-guard-helps-collect-covid-19-data/ ", "2020-04-30T22:16:01.000Z": ". @GM went from a stop to a sprint to make and deliver more than 600 ventilators in just a few weeks. It was inspiring to tour their Kokomo facility to see how they have stepped up alongside @VP and @SecElaineChao . #INthistogether", "2020-04-30T21:00:08.000Z": "Today, Vice President @Mike_Pence , @SecElaineChao and @GovHolcomb visited our Kokomo, IN, facility to meet the team who made it possible for us to deliver more than 600 @MyVOCSN critical care ventilators in only a few short weeks. Read more: https:// s.gm.com/3lesd", "2020-04-30T18:31:48.000Z": "Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - Apr 30", "2020-04-30T18:15:05.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - Apr 30", "2020-04-30T17:30:08.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live Governor Eric Holcomb @GovHolcomb Indiana COVID-19 Update - Apr 30", "2020-04-29T14:55:05.000Z": "Many food pantries will remain open to assist Hoosiers during the COVID-19 emergency. Visit the statewide interactive map to find food pantries in your area. Click here for more information: https:// in.gov/fssa/dfr/5768. htm ", "2020-04-29T19:30:06.000Z": "Living with older family members or others at higher risk of severe illness from #COVID19 ? Help protect your household by only leaving your house when absolutely necessary. Get more info here: https:// bit.ly/2KAILDa .", "2020-04-29T21:37:00.000Z": "Plans call for hiring at least 500 employees, who will be trained in contact tracing and investigations by @StateHealthIN subject matter experts. The call center is expected to be operational around May 11.", "2020-04-29T21:36:59.000Z": "Centralizing this work will allow us to quickly identify individuals who need to be quarantined, reduce the risk of additional infections and take actions to ensure our schools, workplaces and public settings are safe.", "2020-04-29T21:36:58.000Z": "Today I announced the state is partnering with Maximus to centralize contact tracing and investigations for Hoosiers who test positive for #COVID19 .", "2020-04-29T18:15:15.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live https:// twitter.com/i/broadcasts/1 DXGyeegEZyGM ", "2020-04-29T17:30:11.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Twitter live https:// twitter.com/i/broadcasts/1 DXGyeegEZyGM ", "2020-04-29T16:01:28.000Z": "Since the beginning of the year, there has been a significant increase in speeding citations. @IndStatePolice Superintendent Doug Carter asks all Hoosiers to please slow down and stay safe.", "2020-04-27T18:54:13.000Z": "ANNOUNCING: New website, http:// BeWellIndiana.org provides Hoosiers free expert mental health resources during\nCOVID-19: https:// in.gov/fssa/files/BeW ellIndiana_press_release_FINAL.pdf ", "2020-04-28T19:55:24.000Z": "Across #Indiana , over 275 schools have stepped up to provide daily meals for families during the #COVID19 emergency. Thanks to schools like Mooresville and other dedicated Hoosiers, over 850,000 meals each week are prepared and distributed to families in need. #INthistogether", "2020-04-28T20:16:17.000Z": "More information about #COVID19 may be found at the @StateHealthIN website at http:// coronavirus.in.gov and the @CDCgov website at https:// cdc.gov/coronavirus/20 19-ncov/index.html  . Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-04-28T20:16:16.000Z": "Hoosiers will receive results within 48 hours on average. Results will be provided to the patient via a phone call if the test is positive or via an email or text if the test is negative.", "2020-04-28T20:16:15.000Z": "Hoosiers can get tested without visiting a healthcare provider. @StateHealthIN Commissioner Dr. Kris Box will issue a standing order for the test for any Hoosier who meets the criteria.", "2020-04-28T20:16:14.000Z": "Today I announced OptumServe Health Services, powered by Logistics Health, Inc., will open sites across Indiana in the next seven days to begin large-scale testing of Hoosiers.", "2020-04-28T18:43:40.000Z": "Governor Eric Holcomb @GovHolcomb Governor Holcomb provides updates in the fight against #COVID19", "2020-04-28T18:15:04.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-28T17:30:05.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-28T12:55:45.000Z": "Many of us are feeling stressed due to the uncertainty of #COVID19 . These feelings are normal, but it's important to take care of your mental health. Here's Dr. Kyle Jamison from @IUMedSchool with ways to manage your stress and get help if it leads to depression. #BeWellIndiana", "2020-04-28T12:49:12.000Z": "Scientific testing is in progress to learn the true spread of #COVID19 , giving us info for data-driven decisions. If you receive a text or postcard from @StateHealthIN , please respond and help your community and our state fight coronavirus.", "2020-04-27T19:49:53.000Z": "More information about #COVID19 may be found at the @StateHealthIN website at http:// coronavirus.in.gov and the @CDCgov website at https:// cdc.gov/coronavirus/20 19-ncov/index.html  . Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-04-27T19:49:52.000Z": "To help individuals and families cope during this time, there are resources and recommendations ranging from homeschooling tips, ways to work from home, information on coping with a job loss, and addressing medical questions and concerns.", "2020-04-27T19:49:51.000Z": "Hoosiers can visit http:// BeWellIndiana.org to find trusted resources curated by @FSSAIndiana 's Division of Mental Health and Addiction, including information ranging from coping mechanisms, crisis counseling, how to self-monitor for signs of stress, domestic violence resources,", "2020-04-27T19:49:50.000Z": "Today I announced that the @FSSAIndiana has launched a new website, http:// BeWellIndiana.org , that will provide Hoosiers with free mental health resources that have been vetted by experts.", "2020-04-27T18:15:04.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-27T17:30:10.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-27T15:25:11.000Z": "JOB SEEKERS! Check out these upcoming virtual job fairs.\n\nFutures in healthcare at IU Health April 28 2-3p\n\nMultiple employers May 5 10:30-11:30a\n\nGM hiring 1,000 workers (Kokomo) May 6 11-12p\n\nMultiple employers May 7 1-2:30p\n\nINFO https:// bit.ly/2W1yIMT", "2020-04-26T20:10:15.000Z": "Social (physical) distancing is a critical tool in our fight to slow the spread of #COVID19 . \n\nEvery Hoosier can make a positive impact. We're all #INthistogether .", "2020-04-24T23:03:10.000Z": "While meeting with leaders in the Indiana General Assembly this afternoon, we took a call from @VP where I was able to update him on the progress we are making in Indiana against #COVID19 .", "2020-04-24T21:04:28.000Z": "NEWS: State Doubles PPE Orders, Donations with Totals Topping 6.3 Million - https:// mailchi.mp/iedc/news-indi ana-businesses-working-to-support-covid-19-response-922536 ", "2020-04-24T20:34:27.000Z": "More information may be found at the @StateHealthIN website at http:// coronavirus.in.gov and the @CDCgov website at https:// cdc.gov/coronavirus/20 19-ncov/index.html  . Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-04-24T20:34:26.000Z": "Today I signed Executive Order 20-24 to allow health care providers & facilities to resume elective medical procedures provided they have sufficient quantities of PPE & consult the best practices & recommendations developed by their medical associations or industries.", "2020-04-24T20:27:03.000Z": "More information may be found at the @StateHealthIN website at http:// coronavirus.in.gov and the @CDCgov website at https:// cdc.gov/coronavirus/20 19-ncov/index.html  . Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-04-24T20:27:02.000Z": "Providers include hospital, veterinarians, dentists and others listed in Executive Order 20-22.\n\nClick here to see the executive order: https:// in.gov/gov/2384.htm", "2020-04-24T18:15:18.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-24T17:30:05.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-24T13:32:07.000Z": "Friends and neighbors celebrating Ramadan, thank you for everything you're doing to slow the spread. Even in these difficult times, what matters most remains the same: faith, family and friendship. Quote Tweet Muslim Alliance IN @IndianaMuslims Ramadan Kareem & blessings to all those celebrating! \n\nA special message from @GovHolcomb for #IndianaMuslims observing #RamadanINside across the state:", "2020-04-24T12:44:40.000Z": "The executive order 20-23 allows the @WorkforceIND to hire additional staff to review the appeals.", "2020-04-24T12:44:39.000Z": "Yesterday I signed an executive order to speed up the review of unemployment insurance claim appeals during the fight against #COVID19 .", "2020-04-23T21:05:12.000Z": "THREAD: Today, we announced that we'll be collaborating with @FSPH_IUPUI to conduct a scientific study to measure the spread of #COVID19 across #Indiana .\n\nOnce complete, we'll be able to use the data to better understand how the virus is affecting Hoosiers statewide.\n\n(1 of 4)", "2020-04-23T18:15:08.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-23T17:30:07.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-23T14:23:44.000Z": "Direct support professionals are showing the meaning of Hoosiers Serving Hoosiers.  We have jobs available for direct care workers all over Indiana.  Visit http:// fssa.in.gov to learn more.", "2020-04-23T13:00:17.000Z": "He was a quote machine. One of the last things he ever said to me was, \"Holcomb, you could never jump over a dime\", and of course he was right. We always hung onto his every word and wanted to live up to his expectation for ourselves. Besides, he demanded it.", "2020-04-23T13:00:16.000Z": "For anyone who ever had Ed Siegel in class or on the court, yesterday, we lost a legend to heavens call.\n\nIf you knew this larger than life Indianapolis Pike High School teacher & coach, please take a knee in prayer for the Siegel family.", "2020-04-22T18:53:53.000Z": "ICYMI: @IndianaOCRA and I just announced that 13 rural Hoosier communities will receive ~$2 million in funding through the new COVID-19 Response Program.\n\nCheck out the list of recipients and their plans  https:// calendar.in.gov/site/ocra/even t/lt-gov-crouch-announces-13-covid-19-response-recipients/ ", "2020-04-22T19:39:29.000Z": "Nearly 170,000 doctors and nurses across #Indiana are dedicating their time to save lives and fight against the spread of #COVID19 . Thank you to all of our Hoosier healthcare professionals. We are #INthistogether .", "2020-04-22T18:15:40.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-22T17:30:09.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-22T16:02:09.000Z": "Great work from @INGuardsman ! #INthistogether Quote Tweet Indiana National Guard @INGuardsman Today, the @IndStatePolice picked up critical supplies to be delivered to facilities in need, supporting Hoosiers as we continue to flatten the COVID-19 curve. #InThisTogether", "2020-04-22T13:45:57.000Z": "This week is #NationalWorkZoneAwarenessWeek . @IndStatePolice Superintendent Doug Carter reminds all Hoosiers to slow down and drive safely to protect other motorists, as well as the dedicated men and women working on our roads.", "2020-04-21T22:52:59.000Z": "With Hoosiers staying at home, parents of children with behavioral challenges may be facing new difficulties. @FSSAIndiana offers advice for parents as they support their children through this #COVID19 crisis.", "2020-04-22T00:29:16.000Z": "While the coronavirus pandemic keeps us physically apart, nothing can keep us from assembling in spirit and in remembrance of the Holocaust. #YomHaShoah Quote Tweet Indianapolis JCRC @Indy_JCRC This Yom HaShoah we are separated by distance but some of Indiana's elected officials came together via video to remember the Holocaust. Thank you all for your words! @GovHolcomb , @SenToddYoung , @senatorbr , @RepAndreCarson , @SusanWBrooks , @IndyMayorJoe  https:// youtu.be/PsxnASNCog0", "2020-04-21T19:48:33.000Z": "Here at FSSA, we're introducing a new series of Mental Health Check videos to help you and your families stay safe and strong during the #COVID19 pandemic. In the first, Dr. Kory Carey from @voaohin helps you learn ways to cope with a crisis. (Much more to come!)", "2020-04-21T18:15:05.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-21T17:30:10.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-21T12:47:29.000Z": "With the help of the Indiana State Department of Health ( @StateHealthIN ), the Indiana National Guard ( @INNationalGuard ) and others, the State Emergency Operations Center has created strong partnerships in the fight against COVID-19. Thank you for your support. #INthistogether", "2020-04-21T13:50:06.000Z": "Through the #NextLevelRoads plan, @INDOT is investing in a record number of construction projects in 2020. Show your appreciation during #NationalWorkZoneAwarenessWeek by driving responsibly and protecting the workers who make #Indiana the Crossroads of America. #INthistogether", "2020-04-21T12:45:46.000Z": "#INthistogether Quote Tweet Indiana State Department of Health @StateHealthIN These Fort Wayne teens are doing their part in the fight against #COVID19 ! #INThisTogether  https:// wfft.com/content/news/L ocal--569783731.html ", "2020-04-20T21:01:45.000Z": "A link to the updated Stay-At-Home Order FAQ may be found here: https:// in.gov/gov/3232.htm Please refer to this FAQ page for guidance and clarifications.", "2020-04-20T21:01:44.000Z": "operating hours for the elderly and other vulnerable customers, and comply with the social distancing, sanitation and other mitigation measure to protect its employees and the public. Pet grooming at a pet salon, store or mobile unit is permitted.", "2020-04-20T21:01:43.000Z": "Any restrictions involving medical procedures will be evaluated every seven days for appropriate and timely modifications that could be implemented.", "2020-04-20T20:58:12.000Z": "Continuing the course at this time is essential to flattening the curve while we also prepare to safely reopen Indiana for business.", "2020-04-20T20:58:11.000Z": "As of today, 11,686 people have tested positive and 569 people have died from the disease in Indiana. There are now positive tests in 92 of 92 counties. Click here to see the executive order: https:// in.gov/gov/2384.htm", "2020-04-20T20:58:10.000Z": "Today I issued a revised Stay At Home order that lasts through May 1 and is designed to limit interactions among Hoosiers to increase containment of #COVID19 .", "2020-04-20T18:15:07.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-20T17:30:09.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-20T16:45:34.000Z": "This year, @INDOT is partnering statewide on over 1,000 construction projects across all #Indiana counties. For #NationalWorkZoneAwarenessWeek , Commissioner Joe McGuinness asks all Hoosiers to do their part to keep our road workers safe.", "2020-04-19T17:05:00.000Z": "Just how wide of a distance is six feet?\n\nCheck out this Hoosier Guide to Social Distancing. #INThisTogether", "2020-04-17T14:46:00.000Z": "We're proud to partner with #Purdue and Indiana hospitals to expand the state's #COVID19 testing capacity.\n\nLearn more  #INThisTogether   @LifeAtPurdue | #BoilerUp Purdue starts limited COVID-19 testing in diagnostic lab; goal to expand state's capacity in... Purdue University is continuing to lend expertise and resources to help fight the COVID-19 pandemic through increasing Indiana's testing capacity for the virus thanks to a partnership with the... purdue.edu", "2020-04-17T18:15:12.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-17T17:30:06.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-17T14:45:34.000Z": "We're incredibly proud to have Andy be a part of our daily updates to help keep the Hoosier deaf community informed about what our state is doing to fight #COVID19 . Interpreter provides Indiana deaf community with vital COVID-19 updates - WISH-TV | Indianapolis... \"Written English is deaf people's second language. American Sign Language would be their first.\" wishtv.com", "2020-04-17T12:55:05.000Z": "A message from Principal Trumpet of the @Indy_Symphony Conrad Jones about staying safe and being sure to check in on friends and family.", "2020-04-16T21:16:34.000Z": "Over time, people will go back to work, restaurants will reopen, and things will go back to normal. We look forward to working together as one region to tackle this challenge together.", "2020-04-16T21:16:33.000Z": "Our number one priority when analyzing when best to reopen our economy is the health and safety of our citizens. We will make decisions based on facts, science, and recommendations from experts in health care, business, labor, and education.", "2020-04-16T21:16:32.000Z": "Here in the Midwest, we are bound by our commitment to our people & the community. We recognize that our economies are all reliant on each other, & we must work together to safely reopen them so hardworking people can get back to work & businesses can get back on their feet.", "2020-04-16T21:16:31.000Z": "Today, @GovWhitmer , @GovMikeDeWine , @GovEvers , @GovTimWalz , @GovPritzker , @GovAndyBeshear , and I announced that we will work in close coordination to reopen the economy in the Midwest region.", "2020-04-16T19:54:59.000Z": "Together we can stop the spread of #COVID19 . Thanks to @davidboudia for this message. #INthistogether", "2020-04-16T18:15:05.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-16T17:30:04.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-15T18:09:43.000Z": "Don't forget: Tax Day has been moved to July 15 Individuals and businesses have an extra 90 days to file and pay their individual income and corporate #taxes .\n\nLearn more  https:// bit.ly/2V8EuwK", "2020-04-15T21:28:54.000Z": "More information may be found at the @StateHealthIN website at http:// coronavirus.in.gov and the @CDCgov website at https:// cdc.gov/coronavirus/20 19-ncov/index.html  . Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-04-15T21:28:53.000Z": "Today I signed an executive order to allow pharmacy students who have successfully completed all required course work to join the fight against #COVID19 .\n\nClick here to see the executive order: https:// in.gov/gov/2384.htm", "2020-04-15T20:01:58.000Z": "Across Indiana, nearly 40,000 firefighters and EMS personnel are fighting on the front lines against #COVID19 . Thank you for everything you do to keep Hoosiers safe.", "2020-04-15T18:20:10.000Z": "In 10 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-15T17:30:21.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-15T16:04:12.000Z": "Chris Lingner from the @indyballet has a message for Hoosiers. #INthistogether", "2020-04-15T15:23:53.000Z": "Indiana residents who need help feeding their families during the #COVID19 pandemic will have greater access to assistance from food banks and pantries around the state.\n\nThread", "2020-04-15T13:16:46.000Z": "During this #COVID19 emergency, blood donations are critical as we fight to maintain a sufficient supply for those in need. #Indiana EMS Medical Director Michael Kauffman asks that you consider donating blood and thanks everyone for their generosity while we are #INthistogether .", "2020-04-14T20:01:18.000Z": "We'll get through this. Be strong and be smart. Thanks to Ryan Kelly of the @Colts for the great message. #INthistogether", "2020-04-14T18:16:40.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-14T17:30:12.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-14T15:59:40.000Z": "A wonderful message about fighting #COVID19 from the Principal Pops Director of the @Indy_Symphony Jack Everly. #INthistogether", "2020-04-14T14:30:40.000Z": "During this time all BMV branches are closed to the general public. Many transactions including registration renewal, driver's license renewal, and obtaining your official driver record can be completed online. Learn more and stay up to date at http:// in.gov/bmv .", "2020-04-14T13:20:10.000Z": "#COVID19 has impacted every corner of Hoosier communities. We all feel the stress of not knowing what's next. The best response is to have a plan in place before someone in your home gets sick.", "2020-04-13T23:07:02.000Z": ". @StateHealthIN Chief Medical Officer, Dr. Lindsay Weaver tells you why social distancing a crucial step to keeping Hoosiers safe during the COVID-19 emergency. We're all #INthistogether !", "2020-04-13T20:50:11.000Z": "More information may be found at the @StateHealthIN website at http:// coronavirus.in.gov and the @CDCgov website at https:// cdc.gov/coronavirus/20 19-ncov/index.html  . Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-04-13T20:49:11.000Z": "Worldcell Extrusions (Elkhart County) has adjusted production to produce lightweight face shields for medical workers.\n\nIn total, the state has ordered more than: 1 million face masks, 763K face shields, 141K gloves, 68K gowns, 10K goggles, and 6.7K bottles of hand sanitizer.", "2020-04-13T20:49:10.000Z": "Tiedemann-Bevs Industries (Wayne County), has been operating in Richmond since 1974. TBI, which manufactures interior casket components and distributes essential textiles to hundreds of casket manufacturers in the industry, is now producing 1,000 isolation gowns per week.", "2020-04-13T20:49:09.000Z": " @RoyerCorp (Jefferson County) is utilizing its resources to create face shields for medical workers. The Madison-based, family-owned company plans to produce 75,000 weekly pieces, sending 20,000 to support the state's efforts so far.", "2020-04-13T20:49:08.000Z": " @jordanmfg (Newton & White Counties), has shifted production at its Indiana facilities in Monticello and Kentland to make isolation gowns to support healthcare providers, producing 11,500 for the state.", "2020-04-13T20:49:07.000Z": "GDC Inc. (Elkhart County) plans to start manufacturing disposable full face shields in April and expects to provide 500,000 pieces to the state.", "2020-04-13T20:49:06.000Z": " @BerryGlobalInc (Vanderburgh County) is accelerating production of plastic face shields & aims to soon reach production of 150,000 per week. The company will provide 30,000 face shields to the state, helping provide an added protection for first responders & medical personnel.", "2020-04-13T20:49:05.000Z": "The purchased and donated products are being delivered to @StateHealthIN for distribution to Indiana's hospitals, first responders, long-term care facilities and health care providers treating #COVID19 patients.", "2020-04-13T20:49:04.000Z": "Of these, more than 1.9 million items are being made by 15 Indiana manufacturers across a diverse range of specialties, from automotive to RVs to caskets and consumer products, while more than 440,000 are being donated by Hoosier businesses and organizations.", "2020-04-13T20:49:03.000Z": "The state's manufacturers are leveraging their resources, supply chains and Hoosier workers to produce personal protection equipment for health care providers, while business and community leaders have stepped up to source and donate additional materials.", "2020-04-13T20:49:02.000Z": "Today I announced Indiana businesses across the state are answering the call to support the #COVID19 response effort.", "2020-04-13T18:15:14.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-13T17:30:09.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-13T15:40:00.000Z": "Social distancing and staying home are key to beating #COVID19 . Here is an encouraging message from @Hinchtown . #INthistogether", "2020-04-12T23:31:54.000Z": "Here are a few #SocialDistancing tips for the new week!", "2020-04-12T21:49:47.000Z": "Happy Easter Hoosiers from my family to yours.", "2020-04-10T21:14:09.000Z": "Today I announced a taskforce to plan, administer and account for federal relief funds the state of Indiana receives from the CARES Act.", "2020-04-10T18:15:15.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-10T17:30:04.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-10T13:54:21.000Z": "More information may be found at the @StateHealthIN website at http:// coronavirus.in.gov and the @CDCgov website at https:// cdc.gov/coronavirus/20 19-ncov/index.html  . Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-04-10T13:54:20.000Z": "Executive order 20-20 waives incomplete requirements such as school bus drills and emergency preparedness drills. It also outlines options for school corporations to complete 2019-2020 annual staff performance evaluations.", "2020-04-10T13:54:19.000Z": "Today in coordination with @EducateIN Superintendent of Public Instruction Jennifer McCormick, I signed an executive order to waive education requirements that cannot be met due to school buildings being closed to prevent the spread of #COVID19 .", "2020-04-10T12:45:50.000Z": "Across Indiana, nearly 40,000 firefighters and EMS personnel are fighting on the front lines against #COVID19 . Thank you for everything you do to keep Hoosiers safe.", "2020-04-09T22:26:41.000Z": "I ask every Hoosier to join me in honoring Officer Leath's courageous service and dedication to her community. She will be forever remembered for being the finest among us. 2/2", "2020-04-09T22:26:40.000Z": "Officer Leath gave her life as she answered the call of duty. Janet and I are heartbroken for her family, friends and the @IMPDnews . 1/2", "2020-04-09T20:17:01.000Z": "The @CDCgov has provided the following guidance for the faith community: https:// cdc.gov/coronavirus/20 19-ncov/community/organizations/guidance-community-faith-organizations.html ", "2020-04-09T20:17:00.000Z": "No one may exit a vehicle at any time. Portable bathrooms are not allowed on the premises and no church facilities may be used by attendees.", "2020-04-09T20:16:59.000Z": "Livestream or other virtual services are best.\n\nThe minimum number of necessary personnel should be used at all times for any services.\n\nStaff and volunteers who are not speaking should wear masks.", "2020-04-09T20:16:58.000Z": "During this time of uncertainty, faith is more important than ever, and I am deeply grateful to our religious leaders for their efforts to find safe and creative ways to serve their communities.", "2020-04-09T20:16:57.000Z": "Today @StateHealthIN Commissioner Kris Box and I issued guidance for places of worship in an effort to slow the spread of #COVID19 .", "2020-04-09T18:15:13.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-09T17:30:07.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-09T16:13:34.000Z": "Spending time with these students virtually was so fun. They told me all about how they are learning from home and asked me some great questions. https:// duboiscountyherald.com/b/first-lady-h olcomb-shares-social-studies-lesson ", "2020-04-09T12:51:42.000Z": "Our Indiana businesses, organizations and nonprofits have always stepped up when Hoosiers are in need.\n\nIf you are a business or nonprofit that wants to help us fight #COVID19 : 317-238-1715 PrivateSector@dhs.in.gov", "2020-04-08T22:55:47.000Z": "We may be facing difficult times, but faith is as important as ever. Happy #Passover to all of you celebrating.", "2020-04-08T20:07:30.000Z": "We have a strong history of Hoosiers helping Hoosiers and we need that support right now during this #COVID19 emergency. #INthistogether", "2020-04-08T18:15:08.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-08T17:30:08.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-07T15:53:39.000Z": ". @StateHealthIN is looking for available licensed healthcare workers who can volunteer to support our workers on the front lines. With your help, our healthcare workforce can continue to protect #Indiana and fight against this #COVID19 pandemic.", "2020-04-08T13:46:29.000Z": ". @FirstDogHenry and I are virtually meeting with students across the state to answer their questions and to ask how e-learning is going.\n\nThank you to all of the schools, teachers, students and parents who are helping us meet. #INthistogether", "2020-04-08T12:47:04.000Z": "Our healthcare workers step up to help people in their greatest hour of need. Our state is so thankful for each and every one of you. We're #INthistogether .", "2020-04-07T21:15:09.000Z": "More information may be found at the @StateHealthIN website at http:// coronavirus.in.gov and the @CDCgov website at https:// cdc.gov/coronavirus/20 19-ncov/index.html  . Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-04-07T21:15:08.000Z": "without reinstatement or approval by the Indiana EMS Commission if they work under the supervision of a licensed EMS or health care professional. 2/2", "2020-04-07T21:15:07.000Z": "Today I signed an executive order to allow retired and inactive EMS professionals to join the fight against #COVID19 .", "2020-04-07T20:56:00.000Z": "I'm focused on doing all we can to fight #COVID19 . We may be temporarily further apart, but we are #INthistogether .", "2020-04-07T18:15:12.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-07T17:30:19.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-07T13:25:26.000Z": "Stay safe, stay well, and stay home. A great message from @johngreen to Hoosiers as we fight #COVID19 . We are #INthistogether !\n\nMore information about #COVID19 may be found at the @StateHealthIN website at http:// coronavirus.in.gov and the @CDCgov website at https:// cdc.gov/coronavirus/20 19-ncov/index.html ", "2020-04-07T13:14:24.000Z": "I'll provide updates today in the fight against #COVID19 at our daily virtual press conference.\n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-06T20:37:14.000Z": "More information may be found at the @StateHealthIN website at http:// coronavirus.in.gov and the @CDCgov website at https:// cdc.gov/coronavirus/20 19-ncov/index.html  . Coronavirus Disease 2019 (COVID-19) Coronavirus disease 2019 (COVID-19) is a virus (more specifically, a coronavirus) identified as the cause of an outbreak of respiratory illness first detected in Wuhan, China. cdc.gov", "2020-04-06T20:37:13.000Z": "The Critical Industries Hotline will be available from 9 a.m. to 6 p.m. ET Monday through Friday to respond to business and industry questions about whether a business is considered essential. 877-820-0890 covidresponse@iedc.in.gov", "2020-04-06T20:37:12.000Z": "In addition to IOSHA investigations, I have directed the creation of a multi-agency enforcement response team, led by the Indiana Alcohol and Tobacco Commission to respond to and investigate other violations of the new order.", "2020-04-06T20:37:11.000Z": "Hoosiers are reminded that all public and private gatherings of any kind that include more than 10 people are prohibited.", "2020-04-06T20:37:10.000Z": "limit hours of operation to restock and clean; and comply with all mitigation measures to protect employees and the public. A list of such businesses is included in the executive order. 2/2", "2020-04-06T20:37:09.000Z": "While the Stay At Home order chiefly continues as is, modifications and restrictions have been made to limit interactions among people. Here are some highlights of EO 20-18:", "2020-04-06T20:37:08.000Z": "Click here to see the executive order: https:// in.gov/gov/2384.htm As a part of this action, I also extended for two weeks the orders that limit in-person public activity at state government offices and put restrictions on the operation of restaurants, bars and nightclubs.", "2020-04-06T20:37:07.000Z": "Today I issued a new two-week Stay At Home order designed to limit interactions among Hoosiers to increase containment of #COVID19 . As of today, 4,944 people have tested positive and 139 people have died from the disease. There are now positive tests in 89 of 92 counties.", "2020-04-06T15:28:23.000Z": "Today is the start of National Public Health Week.\n\nIn our nation's history, there's never been a more important time to talk about public health.\n\nThat's why we'll be focusing each day this week on a different health topic as it relates to #COVID19 - starting with mental health.", "2020-04-06T18:19:50.000Z": "In 10 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-06T17:34:58.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-06T12:36:07.000Z": ". @JimIrsay is donating 10,000 N-95 masks to help us fight #COVID19 . I'm so proud of our Indiana team! #INthistogether Quote Tweet Indiana State Department of Health @StateHealthIN Today's \"play of the game\" comes from @JimIrsay , who is donating 10,000 N-95 masks to #Indiana 's fight against #COVID19  On behalf of the entire state, thank you! #MVP   #INThisTogether | @espn  https:// google.com/amp/s/www.espn .com/nfl/story/_/id/28997449/colts-owner-jim-irsay-donates-10000-n95-masks%3fplatform=amp ", "2020-04-05T19:51:46.000Z": "Tonight's @60Minutes includes @EvaMozesKor . Be sure to tune in! @TheStoryOfEva Quote Tweet TheStoryOfEva @TheStoryOfEva Good news! This Sunday's @60Minutes includes @EvaMozesKor ! The second segment that evening will feature holograms of Holocaust survivors, and @LesleyRStahl interviews Eva's hologram. We were thrilled to be able to contribute materials and can't wait to see it! #IWillTellYourStory Show this thread", "2020-04-05T00:27:54.000Z": "In today's novel coronavirus mythbuster, @StateHealthIN reminds Hoosiers to check their facts before believing alternative methods of prevention. Ingesting silver and gargling salt water or vinegar will not protect you from COVID-19.", "2020-04-03T20:48:20.000Z": "Six @INBMV branches will be open by appointment only beginning Monday, April 6 to process new Commercial Learner's Permits, new Commercial Driver's Licenses, and upgrade/downgrade for the CDL to add the tank vehicle or hazardous materials endorsement credential transactions.", "2020-04-03T20:48:19.000Z": "This weekend @INGuardsman , the U.S. Army Corps of Engineers and the @StateHealthIN will scout locations for potential alternative care sites. Hoosiers may see the Indiana National Guard members traveling in communities and should not be alarmed.", "2020-04-03T20:48:18.000Z": "Additional steps taken today include:", "2020-04-03T20:48:17.000Z": "The funding can be used to cover costs of emergency needs including crisis counseling, food programs, temporary shelters, protective equipment, safety resources and personnel.", "2020-04-03T20:48:16.000Z": "Today I announced that Indiana has been granted a federal Major Disaster Declaration, which provides funds to help communities recover from #COVID19 .", "2020-04-03T20:00:44.000Z": "This is a great illustration of the importance of social distancing. Great work from @blue ! #INthistogether Quote Tweet Blue @blue STAY HOME & practice social distancing! @GovHolcomb  @ProcterGamble  #DistanceDance  #INthistogether", "2020-04-03T18:15:04.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-03T17:31:56.000Z": "In one hour, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-03T16:50:04.000Z": "#INthistogether Quote Tweet Indiana Department of Environmental Management @idemnews We saw an opportunity to help, and so we did.\n\nPersonal protection equipment such as gloves, safety glasses, and Tyvek suits, were gathered by our ER team and are on the way to help @StateHealthIN . #INthistogether", "2020-04-03T14:16:07.000Z": "While we're doing our part to win the fight against #COVID19 by delivering supplies & keeping our highways maintained, we wanted to say thank you & express our gratitude to healthcare workers. We appreciate everything you are doing for Hoosiers. We truly are #INThisTogether !", "2020-04-03T12:23:36.000Z": "5 EASY STEPS TO PROTECT YOURSELF AND OTHER INDIANA RESIDENTS DURING THE #COVID19 EMERGENCY\n\n1. Clean and Disinfect\n2. Cover Coughs and Sneezes\n3. Wash Your Hands Often \n4. Avoid Touching Your Face\n5. Stay Home if You are Sick and Avoid Close Contact for more details.", "2020-04-02T20:01:14.000Z": "Meets any virtual or remote learning participation requirements established by the governing body of the local school corporation in response to the statewide school closure order issued by the me.", "2020-04-02T20:01:13.000Z": "All K-12 schools will need to submit a plan for review and approval by @EducateIN by April 17. The plan can include eLearning, extended learning, project-based 1/2", "2020-04-02T20:01:12.000Z": "Today I signed an executive order requiring all K-12 schools in Indiana to provide instruction via remote learning for the remainder of the 2019-2020 school year and outlines options for districts to continue education during the fight against #COVID19 . https:// in.gov/gov/2384.htm", "2020-04-02T18:15:01.000Z": "In 15 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-02T17:45:51.000Z": "In 45 minutes, I'll hold a virtual press conference to provide updates in the fight against #COVID19 . \n\nTune in live at 2:30 p.m. ET (1:30 p.m. CT). Watch livestream: http:// bit.ly/3bhQu4i  Facebook Live: http:// bit.ly/2Jcd4zd", "2020-04-02T13:59:12.000Z": "How are you staying healthy, both physically and mentally, as we practice social distancing?\n\nShare your tips, tricks and creative ideas! \n\nWe are #InThisTogether !", "2020-04-01T19:15:40.000Z": "#INthistogether   #StayHomeStayStrong"}