{"2020-07-29T17:18:35.000Z": "US Senate candidate, IA No veteran should have to wait weeks to see someone when they are struggling. That's why I wrote the law to expand veterans' mental health services, and continue to fight to ensure our veterans get the care they need.", "2020-07-29T02:24:13.000Z": "US House candidate, IA-4 It's always a pleasure getting to spend time with my favorite Governor, @KimReynoldsIA Thank you to Sioux Center for hosting us, and @IowaGOP for putting together such a great event! #IA04  #FeenstaDelivers", "2020-07-17T19:44:34.000Z": "Sen. @joniernst and Sen @ChuckGrassley are unwavering advocates of our biofuels industry! Joni and Chuck are fighting for Iowa farmers in the US Senate, in the Oval Office, and every chance they get! U.S. Iowa senators hope to include biofuels aid in next coronavirus relief package U.S. lawmakers from Iowa are trying to add aid for the biofuels industry into a pending coronavirus relief package in the Senate, U.S. Senator Chuck Grassley said on Friday. reuters.com", "2020-07-14T18:48:01.000Z": "Grounded in Clarion is a must stop! Locally sourced beef makes the burgers a must get!", "2020-07-14T18:25:34.000Z": "Thanks Jim and Patty Walker!", "2020-07-13T13:27:07.000Z": ". @GreenfieldIowa is lying about not taking corporate donations. She's taken over $500k from corporate lobbyists, executives, and CEOs. Including from big oil and big pharma. If she's lying to Iowans about her own fundraising, what else is she lying about?", "2020-07-09T22:55:23.000Z": "The Cy-Hawk game is an Iowa tradition and a hallmark for college football! This year's game will be greatly missed by fans across our state. Wishing both @CycloneFB and @HawkeyeFootball much luck with their seasons. No Cy-Hawk game: Big Ten confirms conference-only schedule in 2020 According to a news release from the Big Ten, the conference will limit sports schedules as a preventative measure during the COVID-19 pandemic. kcci.com", "2020-07-09T21:08:15.000Z": "In 11 short weeks, @KimReynoldsIA has implemented a critical strategy to significantly expand COVID testing in our state. These robust steps have protected Iowans and our state's economy. Thank you governor for your steady leadership in these uncertain times. Quote Tweet Gov. Kim Reynolds @IAGovernor 100,000 Tests! We just hit a major milestone with Test Iowa. Do your part, go to http:// TestIowa.com , take an assessment and get tested! https:// youtube.com/watch?v=5qi8Ml YYeHI&feature=youtu.be ", "2020-07-09T19:50:46.000Z": "100,000 Tests! We just hit a major milestone with Test Iowa. Do your part, go to http:// TestIowa.com , take an assessment and get tested! Test Iowa Milestone: 100,000 Tests youtube.com", "2020-07-06T12:48:33.000Z": "US Senate candidate, IA Check out our first ad of the campaign! \n\nIn Iraq, my job was to make sure the supply chain stayed intact. \n\nNow we face a different supply chain threat - this one from Communist China. We must move our supply chain back home and reduce our dependence on China.", "2020-07-04T15:06:33.000Z": "One nation under God. Happy 4th of July! #IndependenceDay", "2020-07-01T18:24:33.000Z": "Happy Birthday @joniernst ! Thanks for being such a great friend and I am so proud of what you do for us in Washington!", "2020-07-01T13:50:00.000Z": "Thanks to the hard work of @realDonaldTrump , @joniernst , @ChuckGrassley , @KimReynoldsIA , & @MikeNaigIA , the #USMCA officially goes into effect today. \n\nThis renegotiated trade deal is a huge win for Iowa farmers and manufacturers! RPI Statement on the Implementation of the USMCA This renegotiated trade deal is a huge win for Iowa farmers and manufacturers iowagop.org", "2020-06-30T16:16:08.000Z": "The \"Brisket Bomb\" is bomb! Family Traditions Meat Company", "2020-06-24T20:25:00.000Z": "In Iowa, our legislature put politics aside and passed police reform legislation unanimously. We need more of Iowa in Washington.", "2020-06-24T20:07:01.000Z": "200 confirmed federal judges since @realdonaldtrump became President! With strong allies like @GrassleyWorks and Sen @JoniErnst , he's getting things done! Vote to keep it going in November. Senate confirms Trump's 200th judicial nominee, filling all circuit court vacancies With the confirmation of Cory Wilson to the 5th Circuit, Mr. Trump has filled all vacancies on the circuit courts. cbsnews.com", "2020-06-16T21:57:32.000Z": "Thank you, @Winnebago ! It was incredibly inspiring to visit an American company with @IAGovernor , where hard working men and women are getting the people of this Nation back on the road! We are Opening Up America Again!", "2020-06-16T17:14:56.000Z": "Sally's is a must stop in Forest City! Kevin and I enjoying lunch w/ VP @Mike_Pence and @RandyFeenstra  #OpeningUpAmericaAgain  #KeepIowaMoving  #FeenstraDelivers", "2020-06-16T16:22:39.000Z": "Hello from Iowa, where the Great American Comeback has begun!", "2020-06-16T15:09:11.000Z": "Wheels up to the Hawkeye State to visit @Winnebago , a US company that has kept America on the move for over 60 years. See you soon!", "2020-06-14T14:30:07.000Z": "Wishing President @realdonaldtrump a very Happy Birthday! #AmericaFirst", "2020-06-10T21:47:13.000Z": "I support the State Fair Board's decision and appreciate their thoughtful & deliberative approach. Already looking forward to next year!", "2020-06-05T14:35:21.000Z": "An outstanding jobs report! We still have a way to go, but America will come back stronger than before. Unemployment rate drops to 13.3% in May, signaling return of US jobs Economists surveyed by Refinitiv expected the report to show that unemployment rose to 19.8 percent in May. foxbusiness.com", "2020-06-03T20:22:01.000Z": "Congratulations on the victory, onto November! #IA04  #Feenstradelivers  #KeepIowaMoving Quote Tweet Randy Feenstra @RandyFeenstra US House candidate, IA-4 Great to see @KimReynoldsIA and @AdamGreggIA today! I'm ready to deliver for Iowans and Keep Iowa Moving in Congress. Grateful for their support. #IA04  #Feenstradelivers", "2020-06-03T03:40:39.000Z": "Congratulations @hinsonashley , @millermeeks , @youngforiowa , and @randyfeenstra ! Looking forward to Republican victories up and down the ballot this November! #KeepIowaMoving", "2020-06-02T15:07:32.000Z": "It's Election Day! There's strong Republican candidates up and down the ballot. Now it's time to vote! #KeepIowaMoving", "2020-06-01T02:39:29.000Z": "#Powerful Quote Tweet Rachel DrozeTV @RachelDrozeTV Protesters abide by curfew and go home after police kneel in solidarity with them. #GeorgeFloydProtests  #DesMoines  #desmoinesprotest", "2020-05-30T17:37:04.000Z": "We respect our neighbors, cherish our community, follow the rule of law, and that is how we will move forward together.\n\nRead my full statement on last night's protest and violence in Des Moines: https:// governor.iowa.gov/press-release/gov-reynolds-and-mayor-cownie-release-statement-on-des-moines-protest-and-violence?fbclid=IwAR1_YXMLRIvkfkqpDDCkaBTAdQL8TWt5MM1BI35wqDcE3t_cvdKscpYDlU4 ", "2020-05-29T21:48:45.000Z": "Appreciate all the positive messages from Iowans! We are all in this together!", "2020-05-25T13:38:23.000Z": "Remembering those who have made the ultimate sacrifice in defense of our country and our freedom. #MemorialDay Commemorating Memorial Day youtube.com", "2020-05-20T18:04:25.000Z": "Play Ball! Safely! It's 'PLAY BALL' for Iowa high school summer sports It's on. Play ball. thegazette.com", "2020-05-10T13:52:21.000Z": "Happy Mother's Day to my loving, caring and amazing mom! Thanks for always being there. I love you!!", "2020-05-08T20:17:09.000Z": "To our farmers, processors, and frontline workers, thank you for all you do to keep our state and country fed!", "2020-05-08T18:43:23.000Z": "Thank you to the faith community for being thoughtful and prayerful in deciding how to reopen.", "2020-05-08T17:29:27.000Z": "Welcome back to Iowa @VP Mike Pence! Appreciate the partnership from @POTUS and the entire team.", "2020-05-06T21:50:15.000Z": "I signed a new proclamation continuing the public health disaster, permitting dental services, reopening some businesses, and other measures. \n\nRead more here: https:// governor.iowa.gov/press-release/gov-reynolds-signs-new-proclamation-continuing-the-state-public-health-emergency-1 ", "2020-05-06T23:34:17.000Z": "President Trump met with @IAGovernor in the Oval Office.", "2020-05-07T00:12:10.000Z": ". @IAGovernor : \"On a per capita basis, we've tested one in 50 Iowans.\"", "2020-05-06T20:30:11.000Z": "\"The partnership and collaboration as we went through this pandemic has been incredible,\" @IAGovernor said.", "2020-05-06T11:54:30.000Z": "It's quite an honor for our state's ldr Gov Reynolds 2b invited by @realDonaldTrump for personal mtg in Oval abt IA virus response Gr8 opportunity 2talk Test Iowa/rural healthcare/Ag/biofuels/workers etc Thx Pres Trump for caring abt Iowa We will get thru this 2gether #IowaStrong", "2020-05-06T14:19:32.000Z": "Meeting with @POTUS later today to discuss Iowa's plans to reopen safely! The President and his team have been an outstanding partner in combatting the COVID19 pandemic.", "2020-05-05T22:30:17.000Z": "Great idea @MaddiePoppe  #CedarValleyStrong ! Maddie Poppe to give online concert to support local businesses The concert is to help support and benefit Cedar Valley businesses. wcfcourier.com", "2020-05-03T13:10:13.000Z": "Last week, we took a step forward to \"normal.\" And while so much has changed in a short period of time because of COVID-19, Iowans will get through this together. Kim Reynolds: We're reopening the state by partnering with Iowans Our ability to keep reopening the state relies on all of you. We need Iowans to be diligent in social distancing and using all that we've learned. desmoinesregister.com", "2020-05-02T17:39:39.000Z": "Was on @TeamCavuto this morning talking about the nation's food supply and how we are safely reopening Iowa. IA Gov. Reynolds on reopening her state, testing at meat processing... video.foxnews.com", "2020-05-02T15:41:10.000Z": "About to go live with @TeamCavuto this morning. Tune in to hear about how we are reopening the state of Iowa! #COVID19", "2020-05-01T18:31:44.000Z": "Great work, thank you! Quote Tweet ChemistryMatters @AmChemMatters Yesterday, 4000 gallons of donated bleach were delivered to the Iowa Emergency Management warehouse by @AmChemistry 's Chlorine Chemistry Division. The ready-to-use bleach bottles will be distributed across Iowa for surface disinfection during the #COVID19 pandemic. #IAGov", "2020-04-26T14:53:34.000Z": "Join me in wishing Lt. Gov. @AdamGreggIA a very Happy Birthday!", "2020-04-25T23:27:48.000Z": "Successful launch today of the first Test Iowa test site! A critical component of our plan to reopen Iowa. @IowaNatGuard  @iowastatepatrol  @iowadot", "2020-04-24T15:58:33.000Z": "Go to http:// TestIowa.com . Fill out an assessment today! #TestIowaChallenge Governor's Test Iowa initiative an important step in battling pandemic, opening businesses The data available through Test Iowa gives the state the ability to respond and manage resources related to fighting the COVID-19 pandemic. desmoinesregister.com", "2020-04-21T22:18:14.000Z": "I accept the challenge from @ChuckGrassley ! Let's #crushthecurve , Iowa! I encourage the agriculture associations, @John_D_Lawrence , @BilliHunt , @SweeneyforIowa and @IowaAgRadio to join the #TestIowaChallenge . Start by taking the assessment at http:// TestIowa.com", "2020-04-21T19:42:36.000Z": "We have just hit over 25,000 completed assessments since launching earlier today. Go to http:// testiowa.com right now and help us double it! Quote Tweet Gov. Kim Reynolds @IAGovernor Kicking off the #TestIowaChallenge . It's as easy as 1...2...3! I challenge @IALtGov , @TheCarsonKingF1 , @SenJoniErnst , @ChuckGrassley , @aplusk , @MurphyKeith , @MikeHousholder to visit http:// TestIowa.com , take the assessment & then challenge 5 people you know to do the same.", "2020-04-21T19:32:48.000Z": "I challenge @8en , #JasonMomoa , @MaddiePoppe , @BrandonJRouth , @slipknot , and @pmarca to the #testiowachallenge so we can #crushthecurve . Go to http:// testiowa.com to start the assessment, and then challenge 5 people you know to do the same.", "2020-04-21T16:08:04.000Z": "New effort underway in Iowa to significantly expand #COVID19 testing and track source of infections. @IAGovernor says it should expand testing by 3,000 per day. http:// testiowa.com is the new website for this. @WHOhd", "2020-04-21T17:13:22.000Z": "US House candidate, IA-4 Thanks @IAGovernor Check out http:// TestIowa.com Quote Tweet Gov. Kim Reynolds @IAGovernor Kicking off the #TestIowaChallenge . It's as easy as 1...2...3! I challenge @IALtGov , @TheCarsonKingF1 , @SenJoniErnst , @ChuckGrassley , @aplusk , @MurphyKeith , @MikeHousholder to visit http:// TestIowa.com , take the assessment & then challenge 5 people you know to do the same.", "2020-04-21T18:00:39.000Z": "Great initiative by @KimReynoldsIA & IDPH. This partnership will allow thousands more Iowans to be tested and help us #CrushTheCurve sooner rather than later. \n\nFor more information, visit http:// TestIowa.com Gov. Reynolds announces testing initiative that aims to assess every Iowan for COVID-19 There have been 23,974 negative tests total. ketv.com", "2020-04-21T18:44:13.000Z": "Thanks @IAGovernor ! I took the #TestIowaChallenge I challenge @ejohnsonNEWS  @idaveprice  @JeffAngeloRadio  @DougWagner  @SenatorRobHogg", "2020-04-21T18:01:53.000Z": "I challenge @drakecoachjb , @hbarnes , @ikeboettger , @IASTATEAD ,  and @coachjake_uni to the #TestIowaChallenge , and help Iowa #CrushtheCurve .\n\nGo to http:// TestIowa.com and start the assessment. And then challenge 5 people you know to do the same. Quote Tweet Gov. Kim Reynolds @IAGovernor 0:16 Kicking off the #TestIowaChallenge . It's as easy as 1...2...3! I challenge @IALtGov , @TheCarsonKingF1 , @SenJoniErnst , @ChuckGrassley , @aplusk , @MurphyKeith , @MikeHousholder to visit http:// TestIowa.com , take the assessment & then challenge 5 people you know to do the same.", "2020-04-21T17:10:59.000Z": "Kicking off the #TestIowaChallenge . It's as easy as 1...2...3! I challenge @IALtGov , @TheCarsonKingF1 , @SenJoniErnst , @ChuckGrassley , @aplusk , @MurphyKeith , @MikeHousholder to visit http:// TestIowa.com , take the assessment & then challenge 5 people you know to do the same.", "2020-04-21T17:36:31.000Z": " #TestIowaChallenge  #CrushTheCurve  http:// testiowa.com I was challenged by @IAGovernor and I challenge @ChrisMWilliams  @JodiLongWHO13  @MarkFreundTV  @SamLozada  @AmberAwx to do the survey and challenge 5 friend!", "2020-04-21T17:46:53.000Z": "Thx @IAGovernor  #TestIowaChallenge I challenge @MikeNaigIA  @uihealthcare  @BRTalentSearch  @Fareway_Stores  @quinnwho  @principal to help Iowa #CrushTheCurve Now it's up to u to challenge 5 more ppl to take the assessment at http:// testiowa.com . 2gether we will beat this virus", "2020-04-20T22:29:42.000Z": "Bless his heart!! Above and beyond.", "2020-04-14T21:04:41.000Z": "We join Governor Kim Reynolds in saluting Iowa's First Responders who stand tall for our safety, and serve as beacons of calm and assurance in our communities during COVID-19 and everyday. https:// youtu.be/M53PDDO7TDU  #IowaFirstResponders  #Shoulder2Shoulder  #LawEnforcement Iowa Governor Kim Reynolds Thanks First Responders youtube.com", "2020-04-15T17:10:51.000Z": "Yesterday, we updated http:// coronavirus.iowa.gov to keep Iowans better informed about #COVID19 Read more here: https:// governor.iowa.gov/press-release/state-of-iowa-releases-updated-coronavirus-dashboard-additional-cases-and-deaths  Iowa COVID-19 Information Discover the latest resources, maps, and information about the coronavirus (COVID-19) outbreak in your community. coronavirus.iowa.gov", "2020-04-16T20:24:15.000Z": "We all have a role to play and by staying home, we can limit the spread of #COVID19 . Thank you Ashton Kutcher for being a part of this PSA. Gov. Reynolds and Ashton Kutcher release PSA on the Importance of... youtube.com", "2020-04-12T12:36:50.000Z": "Happy Easter!", "2020-04-10T19:37:54.000Z": "Iowans are answering the call to feed their own. Thanks to @KimReynoldsIA for creating the Feeding Iowans Task Force. The @IADeptAg is proud to be part of these important efforts to ensure food security for all Iowans #IowaAg  #ThisIsIowa  Quote Tweet NEWSRADIO 1040 WHO @WHORadio WHO RADIO NEWS: Iowa food banks demand up 65-percent https:// ift.tt/2Rsrujf", "2020-04-09T18:32:28.000Z": "Thank you Pastor Rex Deckard for sending care baskets to my teams at the emergency operations center and the Iowa State Capitol!", "2020-04-09T12:04:26.000Z": "REMINDER: Join us Online RIGHT NOW! - https:// mailchi.mp/iowaprayerbrea kfast.com/access-link-9263112 ", "2020-04-08T21:22:11.000Z": "Now more than ever, we should pray for each other, pray for a neighbor, pray for all in need of aid and all those on the front lines in delivering it. Reynolds declares 'Day of Prayer' for Thursday in light of COVID-19 Thursday is also the first day of the Jewish holiday Passover and the Christian holiday of Maunday Thursday. kcci.com", "2020-04-06T22:43:54.000Z": "Appreciate @POTUS for being a partner in our efforts to fight #COVID19 . Very good conversation with Dr. Fauci today! @WhiteHouse", "2020-04-06T18:03:50.000Z": "Had a productive and positive phone call w/ Dr. Fauci and @GovRicketts today... Dr. Fauci was 100% supportive, saying that IA and NE are \"on the same page\" with guidance he's providing other states.", "2020-04-04T19:41:28.000Z": "Appreciate @POTUS and his team for supporting IA's efforts to combat the spread of #COVIDー19 . Read more: https:// governor.iowa.gov/press-release/iowa-receives-44-million-for-reimbursement-of-covid-19-response-costs ", "2020-04-01T17:44:39.000Z": "Thank you, @KimReynoldsIA , for taking the #DSMlocalchallenge and supporting #DSMUSA businesses. #DSMstrong Quote Tweet Kim Reynolds @KimReynoldsIA Great idea @AdamGreggIA ! Just sent @FongsPizza to our team at the Iowa State Capitol who are hard at work answering constituent calls! @JustinSurrency , @LDonovanKCCI, @SabrinaAtiya you are up! #DSMLocalChallenge", "2020-04-01T17:42:41.000Z": "Great idea @AdamGreggIA ! Just sent @FongsPizza to our team at the Iowa State Capitol who are hard at work answering constituent calls! @JustinSurrency , @LDonovanKCCI, @SabrinaAtiya you are up! #DSMLocalChallenge", "2020-03-31T15:59:14.000Z": "Every day, Iowans are stepping up during this health care crisis! #ThisIsIowa Quote Tweet Winnebago @Winnebago Community over everything. Our #Winnebago Stitchcraft\nTeam is sewing 6,000 medical masks for @MercyOneNorthIA hospital: https:// bit.ly/3au6Jex  #BoundByTheW  #COVID19", "2020-03-29T21:01:50.000Z": "Appreciate the update. Thanks for being such a strong voice for Iowa! Quote Tweet Joni Ernst @SenJoniErnst WATCH: I'm joining @IAGovernor 's press conference. Tune in here: https:// facebook.com/iowapbs/videos /3249117698477823/?vh=e&d=n ", "2020-03-27T13:40:49.000Z": "We're all in this together. Great innovation and teamwork happens in Iowa! @HawkeyeCollege  @northerniowa  @WaterlooPL Cedar Valley 3D printers help plug face shield shortage The Cedar Valley's educational and manufacturing community are stepping up to produce face shield and other items desperately needed by medical providers battling the COVID-19 pandemic. wcfcourier.com", "2020-03-25T20:56:53.000Z": "Appreciate @realDonaldTrump 's quick approval of our disaster declaration. Critical for Iowa! President Trump approves major disaster declaration for Iowa Iowa Gov. Kim Reynolds said Wednesday that President Donald Trump on Tuesday approved her request for a Presidential Major Disaster Declaration for COVID-19. kwqc.com", "2020-03-25T01:35:36.000Z": "Thank you @POTUS for quick approval on our disaster declaration, opening federal resources to Iowa's efforts to combat the spread of #COVID19 !", "2020-03-23T16:49:40.000Z": "UPDATE: 15 additional positive cases of Iowans with #COVIDー19 , for a total of 105 positive cases.\n\nThere have been a total of 2,043 negative tests to date, which includes testing reported by the State Hygienic Lab and other labs.\n\nRead more below: https:// governor.iowa.gov/press-release/additional-covid-19-cases-in-iowa-reynolds-to-hold-press-conference-today-0 ", "2020-03-22T18:28:45.000Z": "Faith leaders and worshippers across Iowa are finding innovative ways to keep their congregations connected. Church leaders put their faith in technology to serve their congregations Local church leaders are using use technology and social media platforms to serve the spiritual needs of their congregations while their churches remain closed to the public. wcfcourier.com", "2020-03-20T14:38:40.000Z": "I issued an additional State Public Health Emergency Declaration effective immediately providing additional regulatory relief to Iowans impacted by #COVIDー19 . https:// governor.iowa.gov/press-release/gov-reynolds-signs-additional-state-public-health-emergency-declaration-will-hold?fbclid=IwAR0hpLxlWGTClQ9gMcsERUTIelnEh_PamRkNjVaRfYzQGjjClRW0i-x5i00 ", "2020-03-20T13:46:53.000Z": "To the heroes in the U.S. food supply chain, we salute you.", "2020-03-20T20:50:15.000Z": "Together, Iowa can weather this storm! We will get through this together! youtube.com", "2020-03-21T17:21:39.000Z": "#COVIDー19 Update: 23 new cases, we are recommending those who have traveled outside the state of Iowa self isolate. Read more here: https:// governor.iowa.gov/press-release/additional-covid-19-cases-in-iowa-1 ", "2020-03-19T21:23:19.000Z": "Join us, the JLF, and Foundry Distilling Co. for FREE sandwiches, and free hand sanitizer. Details here: https:// facebook.com/events/5614454 47802341/   #catchdsm  #dsmstrong  #dsmusa  #wdmstrong", "2020-03-18T19:54:43.000Z": "So grateful for the team at @IAPublicHealth working around the clock on the state's response to #COVIDー19 !", "2020-03-18T20:01:48.000Z": "VIDEO: Who should get tested for #COVIDー19 ? We ask Dr. Pedati from the @IAPublicHealth . Who should get tested, I ask Dr. Pedati from the Iowa Department of... youtube.com", "2020-03-18T23:11:16.000Z": "Working with @POTUS , the @CDCgov , and everyone across Iowa to #stopthespread over the next 15 days! President Trump's 15 Days to slow the spread youtube.com", "2020-03-19T17:45:52.000Z": "I am holding a press conference at 3:30 p.m. to give an update on #COVID19 . There will be a livestream on Facebook: https:// facebook.com/IAGovernor/ Read more here: https:// governor.iowa.gov/press-release/advisory-gov-reynolds-to-hold-a-press-conference-on-covid-19-at-330-pm?fbclid=IwAR0xlbN1Fb_yyxDIkOEEZ0mHpEgg_GTbD0yK6GBJ5K-Zt-bCC0DqeFnhqn0 ", "2020-03-19T22:45:24.000Z": "#COVIDー19 Update:\n\n6 additional positive cases of Iowans with COVID-19, for a total of 44 positive cases. 642 negative tests have been conducted at the State Hygienic Lab. \n\nRead more here: https:// governor.iowa.gov/press-release/additional-covid-19-cases-in-iowa-reynolds-held-a-press-conference-today-at-330-pm ", "2020-03-19T12:12:56.000Z": "Sticking together while keeping your (social) distance! #ThisIsIowa Following senior center closures, Meals on Wheels volunteers still on road As the new coronavirus continues to restrict the movement of traffic and services, local agencies face a potential loss of volunteers, who themselves often are among those at highest risk telegraphherald.com", "2020-03-18T17:00:01.000Z": "Des Moines is ranked #3 in the Midwest for women working in a STEM field according to Commercial Cafe. Did you know that 51% of local management jobs are occupied by women? Read more: Top U.S. Cities for Women Working in STEM We ranked the top U.S. cities for women working in STEM! Check out the nationwide top 10, as well as the top cities in each U.S. region. commercialcafe.com", "2020-03-18T19:26:30.000Z": "If you are healthy, please consider making an appointment to give blood. I did mine at http:// LifeServebloodcenter.org w/ fast pass. Took no time at all!", "2020-03-18T14:45:35.000Z": "THIS is Iowa! Swisher distillery turns alcohol into hand cleaner after COVID-19 strains supplies SWISHER - A local distillery is partnering with an entrepreneur and doctor to make hand sanitizer, which has become difficult to find in the wake of the COVID-19 pandemic. thegazette.com", "2020-03-17T23:50:36.000Z": "Love my team! Quote Tweet Gov. Kim Reynolds @IAGovernor Team Capitol working the phones! We are here for you!", "2020-03-16T22:50:00.000Z": "#COVID19 Update: \n\n1 new additional case\n\nI held a press conference to update the state of Iowa. \n\nRead more here: https:// governor.iowa.gov/press-release/gov-reynolds-provides-update-to-the-state-of-iowa-additional-covid-19-case-in-iowa ", "2020-03-17T15:45:58.000Z": "I have issued a State of Public Health Disaster Emergency. These are unprecedented times and the state of Iowa will do whatever is necessary to address this public health disaster.  \n\nRead more here: https:// governor.iowa.gov/press-release/gov-reynolds-issues-a-state-of-public-health-disaster-emergency ", "2020-03-17T16:26:45.000Z": "Casinos and Gaming Facilities\n\nGatherings of more than 10 people -- Social, community, spiritual, religious, recreational, leisure and sporting gatherings\n\nSenior Citizen and Adult Daycare Facilities \n\nRead more here: https:// governor.iowa.gov/press-release/gov-reynolds-issues-a-state-of-public-health-disaster-emergency  (2/2)", "2020-03-17T16:25:37.000Z": "This declaration means the following facilities are closed, with the noted exceptions:\n\nRestaurants and Bars -- Carry-out, drive-through and delivery services of food and beverage can be continued\n\nFitness Centers\n\nTheaters\n\n(1/2)", "2020-03-16T18:04:05.000Z": "I have announced assistance for employees and employers affected by #COVID19 related layoffs: https:// governor.iowa.gov/press-release/governor-reynolds-announces-assistance-for-employees-and-employers-affected-by-covid ", "2020-03-14T18:25:55.000Z": "Appreciate the partnership and seamless coordination, communication between our teams! Quote Tweet Joni Ernst @SenJoniErnst It's so important in a time of crisis that we're working in a coordinated effort to support folks across Iowa. Today, at the State Emergency Operations Center, I met with @IAGovernor & her team, and spoke with local grocers, to discuss the needs of Iowans as we combat #COVID19 .", "2020-03-15T02:03:29.000Z": "COVID-19 community spread confirmed in Iowa. Read More here: https:// governor.iowa.gov/press-release/covid-19-community-spread-confirmed-in-iowa-state-agencies-take-additional-measures ", "2020-03-15T15:46:00.000Z": "We have seen evidence of #COVIDー19 community spread in Iowa. Here's official guidelines for mitigation put together by the @IAPublicHealth : https:// bit.ly/2QiFLhV", "2020-03-16T01:42:10.000Z": "I'm recommending Iowa schools close for four weeks to combat the spread of COVID-19. Read more below: https:// governor.iowa.gov/press-release/gov-reynolds-recommends-iowa-schools-close-for-four-weeks-will-hold-a-press-0 ", "2020-03-16T16:50:51.000Z": "I will hold a press conference today from the State Emergency Operations Center (SEOC) to provide an update to the state of Iowa on COVID-19. Read more here: https:// governor.iowa.gov/press-release/advisory-gov-reynolds-to-hold-a-press-conference-on-covid-19-at-430-pm ", "2020-03-13T14:52:02.000Z": "Pass the #InvestInIowaAct ! Principal, soybean officials: Let's pass the Invest in Iowa Act Iowa has a history of finding solutions that support our agricultural base while connecting with the priorities of urban residents. desmoinesregister.com", "2020-03-12T23:13:09.000Z": "COVID-19 Update: https:// governor.iowa.gov/press-release/state-of-iowa-provides-covid-19-update ", "2020-03-10T13:40:03.000Z": "Let's get this done! #InvestInIowaAct Invest in Iowa Act Shows Momentum Gov. Kim Reynolds' signature proposal for 2020 legislative session, the Invest in Iowa Act, is showing signs of momentum as she and allies push to see its passage before this year's session adjourns. iowafieldreport.com", "2020-03-09T18:40:11.000Z": "We continue to hear great feedback from Iowans on the #InvestInIowaAct !", "2020-03-09T14:39:21.000Z": "These are pork burgers, not steaks, Theresa. A \"scrappy farm girl\" should know the difference. #IASen  #IApolitics Quote Tweet Theresa Greenfield @GreenfieldIowa US Senate candidate, IA Happy to see my friend @SteveBullockMT in the race for U.S. Senate in Montana. Looking forward to flipping seats with you, just like we flipped steaks!", "2020-03-08T16:11:24.000Z": "The Sioux City Journal Editorial Board called the #InvestInIowaAct a bold plan that strikes the right chords. I agree! OUR OPINION: Invest in Iowa Act strikes right chords Ten years ago, more than 90 percent of Iowa legislators voted to put the Iowa's Water and Land Legacy constitutional amendment to voters. By a vote of 63 to 37 siouxcityjournal.com", "2020-03-06T22:50:55.000Z": "Good to see @YoungForIowa in Council Bluffs today! He's working hard to win #ia03 and I am proud to support him!", "2020-03-06T19:19:13.000Z": "Bob's right! The #InvestInIowaAct is a win for rural Iowa. Thanks for coming to our town hall today.", "2020-03-06T19:26:25.000Z": "Strong support for the #InvestInIowaAct across the state! Quote Tweet Gov. Kim Reynolds @IAGovernor Nancy thank you for being in Harlan today to support the #InvestInIowaAct !", "2020-03-06T16:21:32.000Z": "With @joniernst in the United States Senate, Iowa is in good hands!", "2020-03-06T14:12:56.000Z": "#KeepAmericaGreat  #KeepIowaMoving Job growth smashes expectations for February as unemployment falls back to 3.5% The Labor Department reported Friday that the U.S. economy added 273,000 new jobs during the month, while the unemployment rate was 3.5%. cnbc.com", "2020-03-06T00:14:13.000Z": "She's an inspiration whose legacy will live on forever! Rosalind P. Walter, the original Rosie the Riveter, dead at 95 Rosalind P. Walter, also known as \"Rosie the Riveter,\" died Wednesday at the age of 95 in New York City. foxnews.com", "2020-03-05T21:27:58.000Z": "Iowa is #1 when it comes to being employed! #KeepIowaMoving Iowa is a national leader when it comes to a key workforce stat No state saw a greater increase in working-age employment from 2018 to 2019 than the gains recorded in Iowa. desmoinesregister.com", "2020-03-05T13:34:45.000Z": "Bonnie informed, entertained, and befriended listeners across Iowa for 25 years. Kevin & I were honored to be a part of her last show in the @WHORadio studio! @vanandbonnieWHO", "2020-03-05T00:58:16.000Z": "The #InvestInIowaAct is an investment in our future!", "2020-03-04T23:22:48.000Z": "Thanks for your support! Quote Tweet Jamie Cook @j_samuelcook Had the opportunity yesterday to chat with @IAGovernor  @KimReynoldsIA and other conservation and tourism partners like Rod Marlatt about the Invest in Iowa Act.  Conservation and Tourism work for Iowa!!!! #InvestInIowaAct  #ITC20  @IowaPFQF  @Travel_Iowa", "2020-03-03T19:23:43.000Z": "Record High! #KeepIowaMoving", "2020-03-03T15:26:00.000Z": "#InvestInIowaAct = \nLower Taxes Mental Health Funding Water Quality Better Quality of Life GIF", "2020-03-02T20:14:06.000Z": "Happy Birthday @MikeNaigIA !", "2020-03-02T18:55:51.000Z": "As a mom, a grandma, and a governor, fighting for the unborn is who I am. Honored to speak at today's Prayer Rally for Life!", "2020-03-02T17:57:42.000Z": "Quote Tweet Joni Ernst @joniernst US Senate candidate, IA I just turned in 23,812 ballot access petition signatures! That's 7 times the required amount, and we qualified in all 99 counties! Thank you so much to everyone who worked so hard to make this happen!", "2020-03-02T15:04:22.000Z": "The #InvestInIowaAct lowers taxes and invests in mental health, water quality, and will improve our overall quality of life.", "2020-02-29T02:21:03.000Z": "Great event!! Quote Tweet Jeff Kaufmann @kaufmannGOP Packed house for our reception in Davenport tonight! Thanks to @joniernst , @KimReynoldsIA , and all of our supporters who attended. #KeepIowaGreat", "2020-02-28T17:04:36.000Z": "Iowans are engaged and want action on the priorities I laid out in the #InvestInIowaAct ! Thanks for being here! Quote Tweet Carrie Koelker @CarrieKoelkerIA . @dubuquechamber what a packed house to listen to our amazing @IAGovernor about the Invest in Iowa initiative! Retaining Iowans and recruiting new residents is key. @KimReynoldsIA Thanks for sharing your energy and vision to grow Iowa and turning to Iowan's for input. #ialegis", "2020-02-26T18:29:52.000Z": "#InvestInIowaAct Lower Taxes Mental Health Funding Water Quality Better Quality of Life GIF", "2020-02-25T14:55:04.000Z": "I am holding 6 town halls this week to talk about the #InvestInIowaAct . Here's where I am going to be: https:// governor.iowa.gov/press-release/gov-reynolds-lt-gov-gregg-release-public-schedule-update-6 ", "2020-02-24T23:39:26.000Z": "Iowans want lower income & property taxes, they want us to invest in priorities like mental health, water quality, and quality of life. People have supported these ideas for years, now we have an opportunity to get it done. Poll finds majority of Iowans favor tax changes similar to Gov. Kim Reynolds' proposal DES MOINES - A slight majority of Iowans favor tax changes similar to the plan Gov. Kim Reynolds has proposed that would raise the sales tax to pay for mental health and other services and reduce... thegazette.com", "2020-02-24T00:14:52.000Z": "The #InvestinIowaAct is a big idea and bold reform. It's the tree that we can plant today to provide limitless opportunity for future generations of Iowans. Reynolds: Plan for tomorrow, invest in Iowa There's an old Greek proverb that says, a society grows great when people plant trees in whose shade they know they will never sit. And even though opportunity lives here today, with a strong,... thegazette.com", "2020-02-22T20:44:10.000Z": "Thanks for coming to see me at the Knapp Center today, @IAGovernor ! I look forward to celebrating \"Griff Day in Iowa\" with you later this Spring. GO BULLDOGS! #DSMHometownDog  #DSMHometownTeam  #ForeverOurDog  @DrakeUniversity  @DrakeWBB", "2020-02-20T20:53:56.000Z": "Thanks Wyatt for inviting grandma to your class today!", "2020-02-18T21:26:24.000Z": "IA Gov. Kim Reynolds rips Mike Bloomberg for insulting farmers: \"unconscionablebeyond the pale\" https:// youtu.be/tJsLMMJX7NY", "2020-02-18T17:01:41.000Z": "\"[Bloomberg has] no idea what generations of farmers have been doing, and the technology, innovation, & science that is a part of farming today. It is unbelievable.\" Thank you @KimReynoldsIA -- we can always count on you to stand up for rural Iowa! #iagov Governor Reynolds Explodes Over Bloomberg's Comments On Farmers | NEWSRADIO 1040 WHO Jeff plays comments by Michael Bloomberg from a 2016 for Governor Kim Reynolds and she explodes! In the comments. Bloomberg implies that farming doesn't take intelligence and the Governor of Iowa has... whoradio.iheart.com", "2020-02-14T23:27:51.000Z": "Blessed!!", "2020-02-14T20:39:44.000Z": "#ThisIsIowa Quote Tweet Andrew Lauver @AndrewLauver Uber Driver in FL: Where are you from? \n\nMe: Iowa! \n\nUber Driver: No way! I want to move there. I've lived here my whole life and have been reading about IA. You have the top rated quality of life. It sounds so amazing! \n\nMe: It is. And you should! @IALtGov  @IAGovernor", "2020-02-13T23:35:30.000Z": "Yes! Thank you to those in the Iowa Senate who stood up for life. Iowa Senate passes amendment to constitution on abortion rights The amendment does not guarantee a right to an abortion. kcci.com", "2020-02-12T23:01:00.000Z": "Applications for our STEM BEST Program are now open! \n\nExtend the learning continuum from school to careers by applying for this unique opportunity. Learn more on our website: https:// iowastem.gov/STEMBEST/appli cation ", "2020-02-12T22:43:17.000Z": "American Gothic. Eldon, IA.", "2020-02-11T15:45:00.000Z": "Since 2011, funding for Iowa schools has increased by more than 34% while the Midwest Consumer Price Index (inflation) has only increased 13.5% #ialegis  #iagop", "2020-02-10T21:42:29.000Z": "Always ready to answer the call! Thank you! Iowa Army National Guard 'Ironman Battalion' receives deployment orders The United States Army announced Thursday that Iowa Army National Guard 'Ironman Battalion' received orders for a deployment to the Mideast. kcrg.com", "2020-02-08T00:00:17.000Z": "US House candidate, IA-1 My letter in the @gazettedotcom \"Make women's health care more accessible\" - Hinson: Make women's health care more accessible While many of us are relieved the chaos of the caucuses are behind us, Iowa families deserve more than just politics from their representatives, they deserve sound policy. thegazette.com", "2020-02-07T16:59:34.000Z": "Thank you, Mr. President! #IACaucus Quote Tweet Donald J. Trump @realDonaldTrump Iowa and New Hampshire will not be moved from the Primary Schedule as long as I am President. Great tradition!", "2020-02-06T23:44:21.000Z": "Now Congress can get back to work! \nHigher Wages Lower Taxes Better Trade Deals  #KAG  #KeepIowaMoving", "2020-02-06T19:55:37.000Z": "Happy Birthday President Ronald Reagan! In 2020, let's win another one for The Gipper!", "2020-02-05T03:57:22.000Z": "Tonight, President @realDonaldTrump talked about the great American comeback and how the best is yet to come for our nation and every single American! #SOTU  #KAG  #KeepIowaMoving", "2020-02-04T12:54:11.000Z": "Last night, @realDonaldTrump received a historic turnout for an incumbent, shattering all previous records!\n\n\"Our liberties we prize and our rights we will maintain.\" \nThe great people of Iowa get it!", "2020-02-04T04:48:23.000Z": "Outstanding support on the ground today for @realDonaldTrump ! #KAG  #KeepIowaMoving Quote Tweet Donald J. Trump @realDonaldTrump Big WIN for us in Iowa tonight. Thank you!", "2020-02-04T01:19:46.000Z": "Packed house in Osceola! Kevin and I are ready to caucus for President @realDonaldTrump ! #KAG  #KeepIowaMoving", "2020-02-03T23:09:00.000Z": "Thank you @KimReynoldsIA -- and thanks for all you do to keep Iowa first! #IACaucus  #FITN", "2020-02-03T17:18:06.000Z": "Getting ready to caucus for President @realDonaldTrump ! #KAG  #KeepIowaMoving  #iacaucus Quote Tweet Iowa GOP @IowaGOP Today is the day!! Double check your caucus location by clicking here: https:// iowagop.org/2020-caucus-lo cations  We hope to see YOU tonight at 7 PM! #IACaucus  #FITN", "2020-02-03T02:43:14.000Z": "So great to see you!! Thanks for coming to Iowa. Quote Tweet Dan Patrick @DanPatrick Surrogates who will be speaking for @POTUS  @realDonaldTrump at the #IowaCaucuses tomorrow are watching #SuperBowl2020 tonight - here with @SecretaryPerry and @KimReynoldsIA  #KeepAmericaGreat2020", "2020-02-03T02:38:45.000Z": "Thanks for coming to Iowa! Quote Tweet Elise Stefanik @EliseStefanik US House candidate, NY-21 Wonderful to meet @IAGovernor  @KimReynoldsIA and discuss #NY21 and Iowa #Ag and the importance of passing #USMCA", "2020-02-02T17:31:59.000Z": "Proud to host Kellyanne Conway! Supporting @realDonaldTrump , @joniernst , and the GOP Team! #KAG  #KeepIowaMoving", "2020-02-01T22:09:12.000Z": "Because of President @realDonaldTrump 's pro-growth policies, Iowa is moving in the right direction. #KAG  #KeepIowaMoving Iowa Gov.: We're moving in the right direction Iowa Gov. Kim Reynolds discusses the growing economy and how phase one of U.S.-China trade will impact farmers in her state. video.foxbusiness.com", "2020-02-01T17:27:47.000Z": "Great to be on @TeamCavuto this morning highlighting Iowa's success. #KAG  #KeepIowaMoving Watch here: https:// bit.ly/37OgSBJ", "2020-01-30T21:27:05.000Z": "Awesome stopping by @culvers with  Governor @kimreynoldsIA to meet some great Iowans while on our way to Des Moines!", "2020-01-31T03:16:37.000Z": "Four. More. Years. Thank you @realDonaldTrump !!! #KAG2020  #KeepIowaMoving Quote Tweet Donald J. Trump @realDonaldTrump This November, we are going to defeat the Radical Socialist Democrats and win the Great State of Iowa in a Historic Landslide! #KAG2020", "2020-01-31T00:27:43.000Z": "Welcome to Iowa, President @realDonaldTrump !!! We have a packed house waiting to hear from you! #KAGA2020  #KeepIowaMoving", "2020-01-30T21:58:38.000Z": "Leaving Michigan now, great visit, heading for Iowa. Big Rally!", "2020-01-30T19:20:34.000Z": "Time for lunch! #KAG2020  #KeepIowaMoving", "2020-01-30T18:00:46.000Z": "It was a privilege to be in Iowa with Governor @KimReynoldsIA and the #EvangelicalsforTrump as we fight for four more years of the most pro-life President our Nation has ever seen, President @realDonaldTrump !", "2020-01-30T16:19:51.000Z": "Packed house here in Sioux City for Vice President @Mike_Pence ! Value voters are ready to #KAG2020 and #KeepIowaMoving", "2020-01-30T13:05:56.000Z": "On the campaign trail with @realDonaldTrump and @Mike_Pence today because they continue to deliver for IA: Lower Taxes Less Regulations Rising Wages Stronger Trade Deals Judges that Respect the Law Standing up for Life #KAG  #KeepIowaMoving", "2020-01-29T16:56:17.000Z": "#USMCA Signed! Thank you @realDonaldTrump for negotiating an agreement that works for Iowa! #KAG2020  #KeepIowaMoving", "2020-01-26T16:53:26.000Z": "Mark Shields: Lay off Iowa; the state has an impressive record when it comes to voting and picking candidates https:// dailyherald.com/discuss/202001 21/in-defense-of-iowa  via @dailyherald In defense of Iowa Columnist Mark Shields: We have reached that time in every presidential nominating year when distinguished, national opinion leaders beat up on Iowa and that admirable state's influential role in... dailyherald.com", "2020-01-22T18:36:53.000Z": "Life is precious, life is sacred, and life must always be protected. It's why Roe v. Wade should be overturned. I am proud to be a part of the pro-life movement, lead one of the most pro-life states in the country, and I will never stop fighting for the unborn. Quote Tweet Gov. Kim Reynolds @IAGovernor Life is precious, life is sacred, and life must always be protected. I am proud to proclaim January 22nd, 2020 Sanctity of Life Day in Iowa!", "2020-01-15T16:52:06.000Z": ". @realDonaldTrump is doing great things for Iowa!  Quote Tweet The White House @WhiteHouse . @IAGovernor : \"Today's signing will have a tremendous impact, not only on our farmers and producers, but on our rural economy.\"", "2020-01-15T15:39:47.000Z": "Ran into an old friend at the @WhiteHouse this morning! Big Day for Iowa!!!!", "2020-01-13T13:17:29.000Z": "Great turnout for our annual Legislative Breakfast! GOP leaders are ready to keep moving this state forward. #ialegis  #iagov  @IAHouseGOP  @IASenateGOP", "2019-12-28T04:50:01.000Z": "Congratulations 2019 @HolidayBowl champions! . #iowahawkeyes", "2019-12-28T01:26:37.000Z": "Cheering on the Hawkeyes with my brothers! #GoHawks", "2019-12-28T00:50:26.000Z": "Go @CycloneFB ! Make us proud!!! Iowa Gov. Reynolds and Indiana Gov. Holcomb make friendly wage over Camping World Bowl game On Friday, Iowa Governor Kim Reynolds and Indiana Governor Eric Holcomb agreed to a friendly wager to the highlight the Camping World Bowl football game in Orlando, Fla. on Saturday. siouxlandproud.com", "2019-12-24T22:33:58.000Z": "Merry Christmas From the Reynolds family", "2019-12-23T02:08:03.000Z": "Go Bears!! Quote Tweet Will Keeps @willkeeps28 Chillin with my Boys watching the Chicago Bears Game!!! Kevin Reynolds is in the building!!! @KimReynoldsIA", "2019-12-20T19:20:06.000Z": "Wishing you, your students a very Merry Christmas!!! Hope to stop by your classroom very soon! Gov. Reynolds reads \"Santa's Sleigh is on the way to Iowa\" At the request of Mrs. Nettles' 4th Grade class, Gov. Reynolds read a Christmas story to her students. youtube.com", "2019-12-16T00:43:48.000Z": "Enjoyed hosting so many people at Terrace Hill this afternoon!! Santa, Reindeer and a little snow!! Beautiful", "2019-12-14T18:59:23.000Z": "What a fun night at the Celebrate Iowa Gala celebrating Iowa's History, Arts, Food, Film and Culture! #CelebrateIowa", "2019-12-14T14:59:30.000Z": "I sure would!!! Quote Tweet Kelsie Larie Nettles @klnettles23 Replying to @KimReynoldsIA and @EdWilsonWX13HD @KimReynoldsIA  @IAGovernor My OABCIG 4th grade classroom got asked if they could choose 1 person to read them a Christmas story who would it be? They replied Gov. Kim Reynolds! Would you be willing?", "2019-12-14T00:56:12.000Z": "Hey, it's @EdWilsonWX13HD at the #CelebrateIowa Gala!", "2019-12-11T18:18:36.000Z": "I've watched this clip of Kevin Reynolds saying Santa's coming to Terrace Hill too many times today", "2019-12-10T20:46:35.000Z": "Santa Claus , live Reindeer, and much more this Sunday at Terrace Hill. Merry Christmas! Terrace Hill celebrates 150th Christmas Open House We're getting a first look at Terrace Hill before its 150th celebration and Christmas Party. kcci.com", "2019-12-10T13:58:50.000Z": "TUESDAY I'M FOLLOWING:\n\nTerrace Hill is a holiday dream! Seriously gawking after walking into the 1869 Victorian mansion. Special thanks to @IAGovernor and the First Gentleman for the tour. Still reeling over all I've learned! \n\nWanna check it out? There's an open house Sunday!", "2019-12-07T15:43:19.000Z": "Today we remember the lives lost that day, honor the sacrifices made, and once again fully reflect on the true cost of freedom. Gov. Reynolds calls on Iowans to fly flags at half-staff Saturday on Pearl Harbor anniversary Gov. Kim Reynolds ordered that flags be flown at half-staff for Pearl Harbor Remembrance Day. desmoinesregister.com", "2019-12-06T17:01:23.000Z": "Thanks for hosting @GovHolcomb Quote Tweet Governor Eric Holcomb @GovHolcomb We had an incredible American Workforce Policy Advisory Board meeting at the Indiana Women's Prison. \n\nI'm honored to be a part of this group led by @IvankaTrump and @SecretaryRoss and am proud of innovative ideas on addressing the defining issue of the next decade.", "2019-12-06T14:48:00.000Z": "Strong jobs report, wages rising! President @realDonaldTrump 's pro-growth policies are working. #KeepIowaMoving  #KAG US job growth roars back in November, with 266,000 added Economists expected the U.S. economy to have added 180,000 jobs in November. foxbusiness.com", "2019-12-04T21:38:40.000Z": "Wishing these kids luck as they head out to compete in wrestling nationals in Virginia Beach!", "2019-11-30T17:58:09.000Z": "Enjoying some holiday shopping with my daughter while supporting #SmallBusinessSaturday at Give in West Des Moines and Little House on Main in Bondurant, two businesses that both donate a portion of their sales to support local charities. Thanks for a fun morning!", "2019-11-29T20:09:24.000Z": "Cheering on the Hawkeyes!!", "2019-11-26T22:32:27.000Z": "The official pardon still stands! Happy Thanksgiving! Quote Tweet Zach Boyden-Holmes @Boydenphoto There was a minor flap this morning as @KimReynoldsIA pardoned Benjamin and Franklin this morning. Check out the photo https:// desmoinesregister.com/picture-galler y/news/2019/11/26/gov-kim-reynolds-pardons-turkeys-benjamin-and-franklin/4309198002/  via @DMRegister", "2019-11-26T21:10:02.000Z": "Thank you Hillis Elementary School for doing this, showing students the sacrifice men and women in uniform make and the true cost of freedom! Des Moines Students Take Time Out of Class to Honor WWII Veteran DES MOINES, Iowa  -  Students at a Des Moines elementary school were given a lesson in sacrifice on Friday, and taught a lesson in patriotism. Kids at Hillis Elementary School stepped away fr who13.com", "2019-11-25T16:00:14.000Z": "Perfect day yesterday to get our tree at Strautman's Christmas Tree Farm with Kevin and some of the grandkids!!", "2019-11-23T18:57:29.000Z": "Let's go cyclones!!  #BradyBrave", "2019-11-20T22:12:21.000Z": "Thankful to all the volunteers, Kevin, and the girls, who came over to help decorate Terrace Hill for Christmas! Tis the season!", "2019-11-17T15:04:24.000Z": "Wishing the happiest of birthdays to a mentor, friend and America's outstanding Ambassador to China, Terry Branstad!", "2019-11-17T01:29:23.000Z": "Congratulations @ISUFootball and @HawkeyeFootball on 2 big wins today!!", "2019-11-16T21:17:11.000Z": "Let's go Cyclones!!", "2019-11-14T00:48:03.000Z": "It's been a honor to lead the delegation on our recent trade mission to Japan. Thank you for being such great representatives of Iowa agriculture!", "2019-11-13T20:34:39.000Z": "Today, Congress is talking impeachment when they should be focused on ratifying #USMCA ! Quote Tweet Gov. Kim Reynolds @IAGovernor The USMCA is a WIN for our farmers, small businesses, and workers. It's time for Congress to step up, do their job, and ratify the USMCA. #USMCAnow", "2019-11-08T16:36:05.000Z": "Proud to support you and have you as a friend! #ia02 Quote Tweet Dr. Miller-Meeks @millermeeks US House candidate, IA-2 Thank you ... @KimReynoldsIA  for your support! We have never quit fighting for what we believe in! #ia02  #iapolitics  https:// press-citizen.com/story/news/201 9/11/07/gov-reynolds-endorses-miller-meeks-2nd-district/2519736001/ ", "2019-11-06T22:43:00.000Z": "Congratulations. One year on the job and Gov. @KimReynoldsIA  #KeepsIowaMoving  #IAPolitics", "2019-11-06T17:23:36.000Z": "US Senate candidate, IA Congratulations @KimReynoldsIA for your one year anniversary of being the first woman ever elected Governor of Iowa! Thank you for being a great leader of our state, and a great friend.", "2019-11-06T13:57:08.000Z": "One year ago today... THANK YOU! It's an incredible honor to serve the people of Iowa and a state I love. I appreciate your continued support and prayers. #KeepIowaMoving Iowa Election 2018: Kim Reynolds wins full term, a validation of the Republican policies she has led Kim Reynolds, a Republican, and Fred Hubbell, a Democrat, have battled across the state, in living rooms, on buses, and on the airwaves. desmoinesregister.com", "2019-11-06T00:14:23.000Z": "Casting my vote! Still time to get out there and make your voice heard. Polls close at 8: https:// sos.iowa.gov/elections/vote rreg/pollingplace/search.aspx ", "2019-11-03T21:54:16.000Z": "Happy a Birthday Kay!! Quote Tweet Dave Price @idaveprice Sure, it's one year until #2020Election . But it's also the day that we honor the Iowa journalistic legend born on this day a few years ago:) Happy birthday @okayhenderson ! https:// images.app.goo.gl/FYzZUhz3GmuJSR rv8 ", "2019-11-02T16:07:40.000Z": "Governor's Pheasant Hunt 2019. Beautiful fall morning! Thanks North Polk and Jasper County @pheasants4ever Chapters for hosting us.", "2019-11-01T20:51:45.000Z": "Thank you to the Iowans who make this state what it is. I am so honored to serve and visit all corners of this incredible place we all call home! #99CountyTour 99 County Tour 2019 youtube.com", "2019-10-31T17:44:40.000Z": "Voted best tenderloin in Iowa! Have to agree. The Pub at the Pinicon", "2019-10-21T17:49:08.000Z": "Wishing a very Happy Birthday to Barbara Grassley!!! Hope to see you both soon! Quote Tweet Grassley Works @GrassleyWorks RT birthday blessings today for Barbara Grassley. #HappyBirthday", "2019-10-19T17:21:31.000Z": "US House candidate, IA-3 Dallas County didn't let the weather keep them from dedicating their new Freedom Rock this morning in Minburn. @TheFreedomRock \"Bubba\" Sorensen did another wonderful job painting this 82nd county rock in Iowa. #IA03", "2019-10-20T13:48:21.000Z": "Ready....Set...GO!! Thank you IMT for 18 years of running with IMT!", "2019-10-18T22:04:38.000Z": "Today marked one giant leap for WOMANkind - the FIRST all-female spacewalk! \n\nChristina & Jessica, you are an inspiration for women & girls around the world. As @POTUS said when he called to congratulate you, up next, a woman on the moon!", "2019-10-18T21:15:05.000Z": "What an amazing story! Iowan identified in historic Iwo Jima photograph! Marines correct ID of second man who raised flag at Iwo Jima The Marine Corps has corrected the identity of another of the men who were photographed raising the American flag at Iwo Jima during World War II. kcrg.com", "2019-10-17T13:10:03.000Z": "I know @hinsonashley will roll up her sleeves and do the hard work of building consensus and getting things done! Gov. Kim Reynolds endorses Ashley Hinson in 1st District Race CEDAR RAPIDS - State Rep. Ashley Hinson, a Marion Republican who is seeking her party's nomination in Iowa's U.S. House 1st District, has landed the endorsements of Gov. Kim Reynolds and Lt. Gov.... thegazette.com", "2019-10-13T15:48:30.000Z": "Happy Anniversary!! Quote Tweet Governor Mike Parson @GovParsonMO Happy 34th Anniversary to my wife Teresa - an incredible mother, grandmother, and First Lady of Missouri. \n\nLife has brought us good days and hard days, but I'm glad God gave me you through it all. #HappyAnniversary", "2019-10-12T01:02:03.000Z": "Great update!  Thanks for being a partner in driving STEM and Computer Science! Quote Tweet NewBoCo @NewBoCo Governor Kim Reynolds dropped by NewBoCo today to hear about our STEM educational initiatives, from training teachers to teaching computer science to @DeltaVCode . @IAGovernor", "2019-10-10T21:07:29.000Z": "Busy day on the road, but we did make time for lunch! Aroma's Pizza and cookies from LeShawn and Pearl!", "2019-10-09T19:56:02.000Z": "Welcome back to Iowa! Quote Tweet Vice President Mike Pence @VP It's a great day to be in the Hawkeye State! Thanks for the warm welcome, Iowa!", "2019-10-07T19:13:26.000Z": "US Senate candidate, IA The American people sent us to Washington to do our jobs, not play politics. If House Democrats use impeachment to delay #USMCAnow , they will be hurting Iowans. https:// nonpareilonline.com/news/national/ impeachment-inquiry-threatens-to-overtake-capitol-upend-trade-and-spending/article_89d5eb3d-20cc-55b1-afd1-53f6bb95d9ad.html ", "2019-10-04T19:33:43.000Z": ". @DMAMRotary met at the State Capitol and had the privilege of visiting with @IAGovernor this morning. What a great way to start you day.", "2019-10-04T14:13:11.000Z": "BREAKING: @realDonaldTrump Delivers on a Key Promise to American Farmers as @EPA , @USDA Announce Agreement on Promoting Biofuels http:// usda.gov/media/press-re leases/2019/10/04/president-trump-delivers-key-promise-american-farmers-epa-usda ", "2019-10-02T23:42:00.000Z": "US Senate candidate, IA If House Democrats were serious about helping Iowans, they'd pass #USMCAnow .", "2019-10-02T11:32:32.000Z": "#ProudIowan Quote Tweet Carson King @CarsonKing2 I'm honestly at a loss for words. Almost 3 Million Dollars for @UIchildrens . I have suspended my Venmo account, but you can still donate at http:// givetoiowa.org . Thank you everyone. And to the kids and their families, keep on fighting!", "2019-09-30T23:34:25.000Z": "#FTK .  Carson King Countdown! Thank you @CarsonKing2 Quote Tweet Keith Murphy @MurphyKeith Governor Reynolds stops by Carson King Coundown Benefit Concert. Many people are just driving up and dropping off cash donations. Really cool. \n\nTotal now past $2.5 million #FTK", "2019-09-30T22:27:35.000Z": "Thank you ... @IAGovernor  for stopping by the ... @CarsonKing2  Countdown!!  ... @MurphyKeith  ... @venmo ", "2019-09-30T16:39:31.000Z": "Gr8 news: The state of Iowa has $289+ million budget surplus Proving Gov Reynolds & Republican led state legislature are responsible stewards of taxpayer $$", "2019-09-30T16:53:29.000Z": "Our state's fiscal health is strong!", "2019-09-30T15:19:41.000Z": "\"'Iowa's fiscal health is strong, and it's a reflection of a vibrant economy as well as our ability to live within our means,' said @IAGovernor  @KimReynoldsIA .\" Quote Tweet The Gazette @gazettedotcom Iowa ends fiscal year with $289 million surplus http:// thegazette.com/subject/news/g overnment/iowa-ends-fiscal-year-with-289-million-surplus-gov-kim-reynolds-20190930 ", "2019-09-28T18:03:02.000Z": "Congrats Carson! #FTK Quote Tweet Keith Murphy @MurphyKeith Another angle of this wonderful moment. @CarsonKing2 dressed in his Cyclone gear, at game because of Hawkeye fans, waving to the kids and families at @UIchildrens for whom he raised $2 million in two weeks.  #FTK We needed this. \n\nVideo from @MarkFreundTV", "2019-09-27T23:40:54.000Z": "We just hit over 2 Million Dollars for @UIChildrens !! #ForTheKids", "2019-09-25T22:09:48.000Z": "You can make a mistake in your life, and still go on to do amazing things. @CarsonKing2 , thank you for reminding us all of that! #IowaProud", "2019-09-24T17:14:14.000Z": "Not an option! Gov. Kim Reynolds: Ending Iowa-Iowa State football game not an option DES MOINES - Gov. Kim Reynolds said Tuesday ending the Iowa-Iowa State football rivalry is not an option and she believes presidents at the two regent universities will work out safety concerns that... thegazette.com", "2019-09-22T02:19:02.000Z": "Great to be in #Iowa today to support @KimReynoldsIA at the Annual Harvest Festival. She's getting things done in the Hawkeye State! @ReynoldsGregg", "2019-09-22T02:26:34.000Z": "Such a pleasure to host you in Iowa!! Great message! Quote Tweet Karen Pence @KarenPence Great to be in #Iowa today to support @KimReynoldsIA at the Annual Harvest Festival. She's getting things done in the Hawkeye State! @ReynoldsGregg", "2019-09-22T01:18:48.000Z": "Thank you for coming! It was a huge success!!!!! Quote Tweet Julie Kenney @JulieKenneyIA It was all smiles for Governor @KimReynoldsIA at her annual harvest festival.", "2019-09-22T00:13:06.000Z": "Thanks so much for coming! Quote Tweet Brett Barker @brettbarker The girls had a great time at the Harvest Festival! It was so much fun to introduce them to my friends Governor @KimReynoldsIA and Senator @joniernst . They are strong leaders and incredible role models!", "2019-09-21T23:45:36.000Z": "What an amazing turnout at tonight's Harvest Festival! Thank you @AdamGreggIA , @KarenPence , @GrassleyWorks , @joniernst , @YoungForIowa and everyone who came out to celebrate the progress we are making to #KeepIowaMoving !", "2019-09-21T23:39:10.000Z": "US House candidate, IA-3 What a crowd tonight at @KimReynoldsIA 's annual Harvest Fest! The state of Iowa is in great hands under her leadership. #KeepIowaMoving  #IA03", "2019-09-21T23:19:13.000Z": "Iowa's Governor ... @KimReynoldsIA   knows how to get great things done!  Kim's Harvest Festival.", "2019-09-21T22:58:13.000Z": "@joniernst says she & @KimReynoldsIA are \"small town girls who grew up with big dreams...We didn't grow up with a whole heck of a lot. She wore bread bags as well, yes, she did.\" #iapolitics", "2019-09-21T22:46:54.000Z": "We are behind Gov. @KimReynoldsIA and she is a fantastic leader for Iowa! #HarvestFestival  #KeepIowaMoving", "2019-09-21T22:38:45.000Z": "US Senate candidate, IA Great to be with friends and family at @KimReynoldsIA Harvest Festival!", "2019-09-21T15:00:01.000Z": "Today is the day! Come on out to my 3rd Annual Harvest Festival with your family and friends. Make sure to get tickets here! https:// reynoldsgregg.com/harvest-festiv al/ ", "2019-09-20T22:00:00.000Z": "Tomorrow will be a fun-filled evening with great company, delicious BBQ, face painting, pumpkin decorating and special guest @SecondLady Karen Pence! I hope to see you at my 3rd Annual Harvest Festival. https:// reynoldsgregg.com/harvest-festiv al/  GIF", "2019-09-20T14:51:22.000Z": ". @IowaStateU ROTC Cadets leaving the Iowa State Capitol for a 36 mile run back to Ames in recognition of Iowa POW/MIA Day. So grateful for these young men and women acknowledging the sacrifices made by those who came before them.", "2019-09-20T00:29:22.000Z": "With Governor @KimReynoldsIA of #Iowa and President @HashimThaciRKS we just co-signed a declaration announcing #KosovoYearinIowa at @DMACCNews , our education partner educating 28 Kosovar women, participating in #WomeninEnergy Scholarship Program.", "2019-09-20T02:51:09.000Z": "So inspired!! Quote Tweet Vlora Çitaku @vloracitaku Together with the Governor of #Iowa  @KimReynoldsIA supporting 28 women from #Kosovo studying #Engineering and other related fields in #Energy sector. Proud beyond words! #WomenPower  #KosovoWomen  #WomenRule", "2019-09-19T20:02:25.000Z": "Inspiring experience meeting w/ the International Visitor's Leadership Group, an initiative focused on overcoming the barriers women face in countries all over the globe. #wgdp  @IvankaTrump", "2019-09-19T17:16:58.000Z": "Hanging out with Iowa's Governor @KimReynoldsIA ! Thank you for ALL you do for for STEAM education! #CodeBreaker", "2019-09-18T17:00:00.000Z": "Only a few days left until my 3rd Annual Harvest Festival with special guest, @SecondLady Karen Pence. Tickets are still available here! https:// reynoldsgregg.com/harvest-festiv al/ ", "2019-09-17T20:00:00.000Z": "Please join special guest, @SecondLady Karen Pence and me for a fun-filled, fall evening at my 3rd Annual Harvest Festival. https:// reynoldsgregg.com/harvest-festiv al/  GIF", "2019-09-16T22:27:49.000Z": "Spoke with @IAGovernor this afternoon about her recent trip to DC to meet with @POTUS Iowans are lucky to have such a strong, hard-working advocate like @KimReynoldsIA in the Governor's office #iagov  #ialegis  #iagop", "2019-09-17T15:08:12.000Z": "A true statesman and advocate for Iowa, Happy Birthday Senator @ChuckGrassley !", "2019-09-16T14:30:00.000Z": "Don't forget to join us this Saturday for the 3rd Annual Harvest Festival! BBQ, face painting, pumpkin decorating and special guest, @SecondLady Karen Pence! It's not too late to purchase your ticket -> https:// reynoldsgregg.com/harvest-festiv al/ ", "2019-09-14T15:31:33.000Z": "Who is going to win today's Iowa-Iowa State game? Comment below before kickoff at 3!!! #CyHawk  @CollegeGameDay  @uiowa  @IowaStateU", "2019-09-13T21:30:00.000Z": "I hope to see you next Saturday at my 3rd Annual Harvest Festival with special guest, @SecondLady Karen Pence. It will be fun for the whole family! Get your ticket today! https:// reynoldsgregg.com/harvest-festiv al/ ", "2019-09-12T23:28:02.000Z": "Appreciated the opportunity to meet with @realDonaldTrump at the White House today to discuss the importance of ethanol to rural America! We know how important this industry is to our hard working farmers and I will never stop fighting for it.", "2019-09-10T17:00:00.000Z": "My 3rd Annual Harvest Festival with special guest @SecondLady Karen Pence, will be September 21st at the Elwell Family Food Center at the Iowa State Fair from 4-7pm. I hope to see you there! Purchase your ticket here! https:// reynoldsgregg.com/harvest-festiv al/ ", "2019-09-09T00:21:09.000Z": "What's happening in Jefferson will be a model for rural communities across the country to follow! Reynolds: Jefferson initiative to bring high-tech jobs to rural Iowa could be model for nation New Jefferson tech center is \"a launchpad for careers, it's a hub for lifelong learning and it's a model for small towns across our state and country.\" desmoinesregister.com", "2019-09-08T18:12:14.000Z": "Happy National Grandparents Day!!!! So blessed!", "2019-09-08T15:53:22.000Z": "Our fans are 2nd to none, and I can't think of a better way to showcase this year's Cy-Hawk than @CollegeGameDay !!!! Quote Tweet College GameDay @CollegeGameDay AMESDAY IT IS! \n\nFor the first time ever, we're coming to Iowa State! \n\n(  @HomeDepot )", "2019-09-06T15:00:00.000Z": "I'm excited to announce @SecondLady Karen Pence will be my special guest at my annual Harvest Festival on September 21! RSVP today! https:// reynoldsgregg.com/harvest-festiv al/  GIF", "2019-09-02T18:00:09.000Z": "A little lake time with the family! Have a happy and safe Labor Day!", "2019-09-02T15:00:00.000Z": "Happy Labor Day! GIF", "2019-09-01T18:00:52.000Z": ". @KimReynoldsIA discusses what makes the Iowa economy unique during a #TalksAtGS with $GS ' Chairman and CEO David Solomon at the Iowa State Fair: https:// click.gs.com/9lkc", "2019-08-30T14:01:19.000Z": "Excited to announce my 3rd Annual Harvest Festival on September 21! Get your tickets today! https:// reynoldsgregg.com/harvest-festiv al/ ", "2019-08-25T19:56:35.000Z": "It's the Birthday Boys!  Happy Birthday Kevin & August!!", "2019-08-21T13:00:52.000Z": "\"We're really proud of our agricultural heritage because we feed and fuel the world.\" - @KimReynoldsIA discusses the Iowa economy with $GS ' Chairman and CEO David Solomon during a #TalksAtGS at the Iowa State Fair: https:// click.gs.com/gsyk", "2019-08-21T00:59:37.000Z": "Thanks to @KimReynoldsIA for her passion for STEM and supporting young women who want to go into tech/engineering.     Follow your dreams, Lily.", "2019-08-18T21:33:16.000Z": "Wrapping up my last day at the @IowaStateFair , an incredible celebration of some of the best our state has to offer! #NothingCompares", "2019-08-18T19:03:18.000Z": "Just cast my kernel at the @WHOhd @IowaStateFair Tent for @realDonaldTrump ! #Trump2020", "2019-08-17T20:40:46.000Z": "Thank You!! So important!! Quote Tweet NewBoCo K-12 Education @ImaginationIowa The brains behind Iowa Girls Code Camp is @khrubz . She's dedicated to helping girls learn how to code. #GirlsWhoCode", "2019-08-17T20:40:45.000Z": "AWESOME!!! Quote Tweet NewBoCo K-12 Education @ImaginationIowa This is what it looks like when 50 females in Iowa get together to code like a girl.  #GirlsinSTEM  #GirlsWhoCode", "2019-08-17T19:22:39.000Z": "#ButterCow selfie at the @IowaStateFair with @joniernst and the Iowa Dairy Princess! #NothingCompares", "2019-08-17T00:33:15.000Z": "How about that! ... @iowa_corn ", "2019-08-16T19:12:34.000Z": "Hey! Look who came by our booth at the @IowaStateFair .", "2019-08-16T13:26:26.000Z": ". @IAGovernor  @CournoyerIA strolling the fairgrounds at the Iowa State Fair, its amazing who you run into. Our Governor is sharing her passion and being present everyday interacting with Iowans. #IowaStateFair  #thisisiowa  #ialegis  #10dayfair", "2019-08-14T02:52:25.000Z": "Congratulations to Troy Anderson of Fort Dodge, the 2019 Iowa Farm Bureau Cookout Contest champion at the #IowaStateFair", "2019-08-13T23:31:07.000Z": "Took my grandkids to see Wilson, my steer in the Governor's Charity Steer Show. Proud to set a record this year with $284,000 raised for the @rmhdesmoines to help families in need!!!", "2019-08-13T18:17:12.000Z": "Thanks again Brandon and @KIX101_1 for having me come by during the @IowaStateFair .", "2019-08-13T18:07:56.000Z": "The grandkids and I take on the giant slide! @IowaStateFair  #NothingCompares", "2019-08-13T02:03:05.000Z": "It's how we do it in Iowa! Opinion | My day at the Iowa State Fair reaffirmed a little of my battered faith in America I left reassured that the normal rhythms of Iowa life continue as they have for generations, despite the various pathologies on display in modern America. washingtonpost.com", "2019-08-12T18:56:55.000Z": "Thanks @WHORadio for some great coverage of the @IowaStateFair !", "2019-08-11T00:39:04.000Z": "Congratulations!! Quote Tweet David Kochel @ddkochel Married this amazing lady ten minutes ago... love you Marisa! Show this thread", "2019-08-11T00:35:58.000Z": "Some fair time with the kids!", "2019-08-10T16:26:52.000Z": "Stood alongside Iowa farmers at the @IowaStateFair to encourage Democrats running for President to join me in calling on Congress to ratify #USMCA !", "2019-08-10T14:38:41.000Z": "Keep Iowa Moving!", "2019-08-09T23:11:03.000Z": "Let's go Team Iowa!", "2019-08-09T19:01:06.000Z": "Chuckies Tenderloin and the new Pork Strip Basket! @AdamGreggIA and I are splitting baskets to get the best of both worlds. #FairFavorites  #NothingCompares", "2019-08-09T17:23:00.000Z": "Great picture. Fair is for families. #iowastatefair Quote Tweet Kim Reynolds @KimReynoldsIA With Mom and Dad at the @IowaStateFair ! #FairFavorites  #NothingCompares", "2019-08-09T17:20:26.000Z": "With Mom and Dad at the @IowaStateFair ! #FairFavorites  #NothingCompares", "2019-08-08T21:37:56.000Z": "Looking forward to the big concert tonight at the @IowaStateFair ! #IowaProud Quote Tweet Simon Conway @SimonRadio1776 Up next from the Crystal Studio @IowaStateFair is @MaddiePoppe who's going to sing for us on my show @WHORadio  @newsradio600 Join us!", "2019-08-08T20:41:17.000Z": "And the winner of the Big Boar contest is..... Captain weighing in at 1,254 pounds!!!", "2019-08-08T20:35:26.000Z": "So much fun cheering on the Mutton-busting! Some tough kids participating!! @IowaStateFair", "2019-08-08T11:52:23.000Z": "Just went live with @LDonovanKCCI @KCCINews at the @IowaStateFair ! This is a Berkshire Bacon Ball from The Bacon Box. It's bacon cheese wrapped in 9 strips of bacon. Did you know it's gluten free?", "2019-08-07T18:15:55.000Z": "Can't wait!!! Nothing compares! Quote Tweet Iowa State Fair @IowaStateFair The countdown is on! Less than 24 hours remain until the 2019 Iowa State Fair begins! Are you ready?! What's the first thing you'll do when you get here?  #FairFavorites  #ISF2019  #nothingcompares", "2019-08-03T16:11:50.000Z": "Farmers Market!", "2019-07-23T22:43:54.000Z": "USMCA is a strong, balanced, and modern trade agreement that will bring our trade relationship with Mexico and Canada into the 21st century. Quote Tweet Vice President Mike Pence @VP Hello, Iowa! Great to be in the Hawkeye State today with @KimReynoldsIA , Roger Hargens, and the men and women of Accumold! This company is an extraordinary example of American innovation. It's an honor to stand among so many hardworking Americans!", "2019-07-23T20:58:17.000Z": "Happy Birthday to our Great Speaker and my good friend!! Appreciate your leadership! @SpeakerUpmeyer", "2019-07-23T18:10:07.000Z": "Welcome back to Iowa!! Quote Tweet Devin O'Malley @VPPressSec . @VP just touched down in Iowa to meet with jobs creators & talk about how the USMCA will benefit American manufacturing and America's farmers! He's joined by Iowa's great Governor @KimReynoldsIA !", "2019-07-19T15:55:29.000Z": "Partnerships!!! Quote Tweet Ivanka Trump @IvankaTrump The Iowa success story..\nSince the election Unemployment rate is 2.4%, lowest since '76 Manufacturing jobs by 7.2% = 15,300 NEW jobs Labor force participation rate is than national avg Wages surged in private industries\nKeep on winning Iowa! #PledgetoAmericasWorkers", "2019-07-16T21:19:55.000Z": "Yum! Photos: New Iowa State Fair foods for 2019 The new foods for the 2019 Iowa State were unveiled in a contest July 16, 2019, at the Iowa State Fairgrounds. desmoinesregister.com", "2019-07-14T18:08:35.000Z": "At the fairgrounds for some summer fun at @mikenaig family cookout!", "2019-07-10T16:50:27.000Z": "In Iowa, we eat corn! #SupportOurFarmers  #SweetCornDay  @MikeNaigIA", "2019-07-07T19:24:34.000Z": "Having fun with the grandkids at Lake of Three Fires!! One of Iowa's many great state parks!!", "2019-07-04T17:06:29.000Z": "Celebrating Independence Day at the Urbandale Fourth of July Parade!", "2019-07-01T16:47:17.000Z": "Happy Birthday @joniernst ! You are a true public servant, and a great friend. We are so lucky to have you!", "2019-06-30T21:17:39.000Z": "Getting ready for camping with the family over the 4th - kayaks, tents, food and s'mores.  Kevin wants to know what the girls are bringing", "2019-06-28T16:20:57.000Z": "Been at this rural Iowa journalism gig for 22 years. We cover a wide swath of rural Iowa, from business to politics to schools and sports. I'm close to 2,000 followers on Twitter. Help an old school newspaper cat out and retweet and follow to get rural voices and ideas into mix", "2019-06-20T23:40:00.000Z": "US Senate candidate, IA Thanks again to @NikkiHaley and @KimReynoldsIA for helping show young women everywhere that a woman can do whatever she sets her mind to, including becoming a Governor, Senator, and UN Ambassador. #GirlPower", "2019-06-20T15:56:14.000Z": "Great day in Iowa with kick off of Homes For Iowa @IowaCorrections  @IAGovernor . Second chances for some, first chance for participating in American Dream of home ownership especially in rural IA. Bonus: +skilled workers", "2019-06-20T16:01:46.000Z": "More pics. So excited about new @IowaCorrections Director Beth Skinner who is going to really drive this & other apprenticeships as path to rehabilitation & reduced recidivism. @DebiDurham  @IALtGov  @IAGovernor", "2019-06-19T22:39:37.000Z": "Appreciate @POTUS for following through on this after our conversation in Iowa last week. Cannot stress enough how helpful he and his team have been for recovery efforts in Iowa! Quote Tweet Gov. Kim Reynolds @IAGovernor With @fema extension of disaster incident period, assistance will be available for more Iowans & communities to help recover from spring's destructive flooding/storms. The damage didn't stop May 16, and neither has the need for help to rebuild and recover. https:// governor.iowa.gov/2019/06/fema-e xtends-incident-period-for-iowa-disaster ", "2019-06-17T20:58:20.000Z": "\"We have jobs that are looking for people.\" - Governor @KimReynoldsIA", "2019-06-17T15:26:07.000Z": "I'm excited to celebrate our new effort to encourage people from across the nation to consider visiting, living and working in Iowa! Watch New Yorkers realize how cost-effective living in our state really is. https:// youtube.com/watch?utm_medi um=email&utm_source=govdelivery&v=R3FPtb2v6Zc   #ThisIsIowa This Is Iowa: Real Estate Stunt in NYC Watch as New Yorkers realize how cost-effective Iowa is, even given modern amenities, short commutes and award-winning recreation and culture. youtube.com", "2019-06-17T12:50:30.000Z": "In this vibrant economy we are laser-focused on bringing people off the sidelines and fostering economic growth inclusive of all Americans.\n\nLooking forward to our 2nd American Workforce Policy Advisory Board Meeting tomorrow in Charlotte, NC! Trump officials, including Ivanka, to visit Charlotte for workforce development event Two high-level Trump administration officials are coming to Charlotte next week. charlotteobserver.com", "2019-06-16T17:06:47.000Z": "We all need someone to believe in us... encourage us... and inspire us!! I love you for being that person!  Happy Father's Day to you and all the amazing dads.", "2019-06-15T20:56:35.000Z": "So great to join @IAGovernor and @GrassleyWorks in kicking off @joniernst re-election campaign! Thank you Iowa for your amazing hospitality and support of Joni!", "2019-06-15T19:54:40.000Z": "No better day to be in Boone, Iowa as @joniernst kicks off her campaign alongside @KimReynoldsIA and @NikkiHaley ! #RoastAndRide", "2019-06-15T20:42:53.000Z": "Incredible day w/ these two outstanding women leaders #RoastAndRide", "2019-06-15T18:44:18.000Z": "US Senate candidate, IA \"It's more important than ever to keep her there for us\" @KimReynoldsIA says of Joni finding solutions in the midst of partisan games in Washington", "2019-06-15T18:48:32.000Z": "\"We know @joniernst , and we know that she fights for Iowans. She has the unique ability to work with people to get things done.\" - @KimReynoldsIA  #RoastAndRide", "2019-06-15T19:01:06.000Z": "You can always trust @joniernst to fight for Iowa in Washington!!! #RoastAndRide Quote Tweet Joni Ernst @joniernst US Senate candidate, IA \"Iowa is blessed to have her as our Senator and I am so, so grateful to call her my friend\" Show this thread", "2019-06-15T17:20:53.000Z": "US Senate candidate, IA While Joni's on the road, make sure to head to Facebook for the #RoastAndRide show → https:// facebook.com/joniforiowa  @KimReynoldsIA is on now!", "2019-06-15T16:47:48.000Z": "All in for my good friend @joniernst !!!! #RoastAndRide", "2019-06-14T23:03:44.000Z": "Happy Birthday @realdonaldtrump , appreciate your commitment to Iowa and service to our country!", "2019-06-12T01:21:39.000Z": "Beautiful afternoon in Iowa. Thank you to all of our Nation's Farmers. May God bless you, and may God Bless America!", "2019-06-10T15:16:04.000Z": "Important topics at @AsaHutchinson  #CSSummit19  @KimReynoldsIA  @henrymcmaster  @AnthonyOwenADE  @JohnnyKey_AR", "2019-06-08T19:27:37.000Z": "Can't wait!! Quote Tweet Joni Ernst @joniernst US Senate candidate, IA Join @NikkiHaley , @GrassleyWorks , @KimReynoldsIA , and myself next Saturday in Boone as we come together to honor our veterans and benefit a great Iowa charity, Retrieving Freedom Inc., a veterans charity working to provide veterans with service dogs. https:// eventbrite.com/e/joni-ernsts- campaign-kick-off-at-roast-and-ride-saturday-june-15th-2019-tickets-60526489359 ", "2019-06-07T21:02:50.000Z": "Can't wait to be back this year!!! Quote Tweet Joni Ernst @joniernst US Senate candidate, IA #FlashbackFriday to last year's Roast and Ride with @KimReynoldsIA ! We can't wait for another day of riding to Boone, Iowa BBQ, and honoring our vets. We're hoping you'll join us! Purchase your ticket for this year's Roast and Ride here: https:// eventbrite.com/e/joni-ernsts- campaign-kick-off-at-roast-and-ride-saturday-june-15th-2019-tickets-60526489359 ", "2019-06-07T19:19:55.000Z": "Happy Birthday VP @mike_pence , appreciate your friendship and service to our country!", "2019-06-06T13:12:36.000Z": "RGA Releases New \"Simply Stated\" Video Highlighting Governor @KimReynoldsIA 's Efforts To Empower Iowa's Workforce https:// rga.org/rga-releases-n ew-simply-stated-video-highlighting-iowa-governor-kim-reynolds-efforts-to-empower-iowas-workforce/   #IAGOV RGA Releases New \"Simply Stated\" Video Highlighting Governor Kim Reynolds' Efforts To Empower... Today, the Republican Governor's Association released the latest installment of its \"Simply Stated\" digital video series profiling GOP governors' work to transform their states through pro-growth... rga.org", "2019-06-06T20:10:53.000Z": "Proud to have you  in Iowa! The power of partnerships!! #greatnessSTEMSfromIowans Quote Tweet The Tech Interactive @TheTechInteract Proud to announce a new partnership today to help teachers in rural Iowa bring STEM to more students! @corteva Show this thread", "2019-06-06T19:22:21.000Z": "Thank you @POTUS for your quick action on behalf of Iowa communities hit hard by severe flooding! Quote Tweet Donald J. Trump @realDonaldTrump Just signed Disaster Aid Bill to help Americans who have been hit by recent catastrophic storms. So important for our GREAT American farmers and ranchers. Help for GA, FL, IA, NE, NC, and CA. Puerto Rico should love President Trump. Without me, they would have been shut out!", "2019-06-05T15:32:18.000Z": "Here at the @IowaABI Annual  Conference and I just got to welcome @Peggynoonannyc to Iowa!", "2019-05-25T14:32:52.000Z": "Proud to have you on my team Adam! Iowa is lucky to have you serving as Lt. Governor. Quote Tweet Adam Gregg @AdamGreggIA Very honored to have been serving alongside @KimReynoldsIA as her LG for 2 years now! I'm especially thankful for my family who have kept me humble from day one, as this pic with Lauren proves!", "2019-05-24T17:25:08.000Z": "Two years ago today, I was sworn in as the 43rd Governor of Iowa. It's been the honor of a lifetime to serve a state I love, I truly believe there is no better place to live, work, or raise a family. And here's the best part, we are just getting started! #KeepIowaMoving", "2019-05-21T17:33:05.000Z": "It's not a stop in Decorah without a visit to Mabes Pizza!!!", "2019-05-12T16:48:36.000Z": "Happy Mother's Day to all those amazing women we call Mom!! Love you mom!", "2019-05-07T22:15:15.000Z": "To my daughter and all of Iowa's phenomenal educators, happy #TeacherAppreciationDay !", "2019-05-04T20:35:24.000Z": "And we are off! #TulipTime", "2019-05-04T18:13:33.000Z": "The economy keeps getting stronger as a result of pro-growth polices at the state and federal level! Wages and Taxes! https:// wsj.com/articles/u-s-h iring-jumps-in-april-unemployment-falls-to-3-6-11556886731 ", "2019-05-03T17:53:31.000Z": "Kevin and I will be there tomorrow! Quote Tweet Des Moines Register @DMRegister It's #TulipTime ! You may want to consider heading to #Pella this weekend. https:// desmoinesregister.com/picture-galler y/news/2019/05/02/tulip-time-pella/3655946002/ ", "2019-04-30T19:36:02.000Z": "Another reason to get excited for the @IowaStateFair ! Go @MaddiePoppe ! https:// weareiowa.com/amp/news/local -news/maddie-poppe-to-perform-at-2019-iowa-state-fair/1964957565 ", "2019-04-30T15:30:37.000Z": ". @dustinjmiller thanks for bringing by your little bundle of joy the other day! So CUTE!", "2019-04-27T16:23:48.000Z": "Promise made, promise kept! Fact Check: IPERS not impacted by property tax bill Iowa Democrats claim a property tax bill will undermine the state's public pension system, despite the bill not having any direct impact on the program. kcrg.com", "2019-04-26T18:14:05.000Z": "Happy Birthday, Lt. Gov. @AdamGreggIA !!! Your passion and enthusiasm for Iowa is evident, and I am grateful to have you as a partner to help lead our state.", "2019-04-25T20:10:01.000Z": "Regarding recently passed property tax bill, SF 634: This bill does not alter the employers' obligation to pay the employer portion of IPERS' contributions as established annually under Iowa Code Section 97B.11. This bill does not affect a member's or retiree's pension.", "2019-04-21T14:02:24.000Z": "For God so loved the world that he gave his one and only Son, that whoever believes in him shall not perish but have eternal life. - John 3:16", "2019-04-20T18:37:11.000Z": "Easter Service with the family! HE has Risen... Happy Easter.", "2019-04-17T13:20:38.000Z": "We moved closer to establishing a first of its kind statewide children's mental health system, one of my top priorities for this year. Governor gets children's mental health plan DES MOINES - The Iowa Senate voted 46-2 Tuesday to create a first-ever statewide children's mental health system, sending Gov. Kim Reynolds one of her top priorities of the 2019 wcfcourier.com", "2019-04-15T22:07:48.000Z": "There is no one more deserving of our recognition than Sen. Chuck Grassley!!! Thank you for your leadership and many years of service to Iowans. @grassleyworks Sen. Chuck Grassley now the namesake of Iowa GOP's headquarters DES MOINES - As they dedicated their state party headquarters in his honor, Republicans repeatedly referred to Sen. Chuck Grassley as a 'living legend.' thegazette.com", "2019-04-13T01:12:47.000Z": "Earlier today I had the opportunity to give @POTUS an update from the ground while the @VP was in Iowa. Look forward to their critical support throughout the recovery and rebuilding process.", "2019-04-12T20:42:52.000Z": "Senate Democrats voted AGAINST Iowans like Dennis Lincoln. The Lincoln's home was flooded, crops destroyed, and their entire lives have been uprooted. Iowans deserve better. It's time for Congress to do its job!", "2019-04-12T18:40:11.000Z": "The next time @ewarren , @BernieSanders , @CoryBooker , @amyklobuchar or @SenGillibrand come to Iowa asking Iowans for their support -  Iowans should ask them why they all voted AGAINST disaster assistance for Iowa! Iowa is still flooded, families need help. Congress must act NOW!", "2019-04-03T18:43:25.000Z": "Happy Anniversary Kevin!  Best husband- father and grandpa. So blessed. Love you!", "2019-04-01T16:30:34.000Z": "Congratulations to @IowaWBB for making it to the Elite 8!!! Way to make Iowa proud! Make sure to cheer on the Hawkeyes at 6 pm tonight.", "2019-03-30T17:20:12.000Z": "HAWKS WIN!!!! HAWKS WIN!!!!!\n\nIowa continues to dance into the ELITE EIGHT!! #NcaaW  #Hawkeyes", "2019-03-26T01:52:40.000Z": "Let's go State!!!! @CycloneWBB", "2019-03-24T20:48:19.000Z": "Way to go @IowaWBB ! Quote Tweet NCAA Women's Basketball @ncaawbb THE IOWA HAWKEYES ARE HEADED TO THE SWEET 16! #ncaaW | @IowaWBB", "2019-03-24T17:45:16.000Z": "Congratulations Drew! NCAA Wrestling: Northern Iowa's Drew Foster wins national championship Drew Foster is an NCAA Champion. amp.desmoinesregister.com", "2019-03-24T17:32:52.000Z": "Congratulations Spencer! Iowa's Spencer Lee Wins Back-to-Back National Championships PITTSBURGH, Pennsylvania - Spencer Lee emerged as a wrestling star in his first year at Iowa. The charismatic Lee won many fans and the national championship. In his sophomore season, Lee los who13.com", "2019-03-23T23:56:14.000Z": "Huge win for @CycloneWBB !!! Congrats! Quote Tweet Cyclone Basketball @CycloneWBB WE'RE MOVING ON! No. 3 seed Iowa State will face No. 11 seed Missouri State on Monday!", "2019-03-22T18:34:13.000Z": "Congratulations #Hawkeyes !!!!!!! Quote Tweet Iowa Basketball @IowaHoops IOWA. Sharpie. #Hawkeyes", "2019-03-17T21:09:13.000Z": "RIGHT NOW: Kim Reynolds speaking at SUX Gateway Airport following her stop in Hornick earlier this afternoon. @KimReynoldsIA", "2019-03-16T01:03:52.000Z": "Cyclones WIN!", "2019-03-14T20:40:15.000Z": "Go State!!!!!!! #CyclONEnation Quote Tweet Iowa State Men's Basketball @CycloneMBB Cyclones WIN!", "2019-03-13T17:57:42.000Z": "I am so honored to serve Iowa and be a part of history. #WomensHistoryMonth  https:// youtube.com/watch?v=PlyWLO z9Bx0&feature=youtu.be ", "2019-03-08T19:32:57.000Z": "Every time a young girl visits my office, I invite her to sit in my chair.  It lets her know women can be or do anything they want in this world. The opportunities are endless! #InternationalWomensDay", "2019-03-02T21:54:01.000Z": "Kevin and I want to wish Simon Estes a Happy Birthday! He makes Iowa proud every single day.", "2019-03-01T18:19:54.000Z": "Women are breaking barriers, shattering glass ceilings, and leading change. It's not crazy, it's the future. @Nike  @NAWBONational  #WomensHistoryMonth  https:// twitter.com/Nike/status/10 99723184369152001  This Tweet is unavailable.", "null": "", "2019-02-28T17:43:23.000Z": "Five Lab puppies have arrived in Iowa and are now service dogs in training with the Puppy Jake Foundation @puppyjakefdn . Meet PACO, JACKPOT, RONALD, CECIL and RAY! Charlie Mike guys... @MarcusLuttrell  @mchooyah  @PopularPups  #Veterans  #Military  #honor", "2019-02-19T19:11:49.000Z": "Record investments for schools Selfie w/ North Polk students Only Tuesday!", "2019-02-18T19:51:48.000Z": "Kevin and I offer our sincerest and deepest best wishes to Fred and his family as he recovers from this tragic accident.", "2019-02-14T18:38:31.000Z": "Happy Valentine's Day, love you Kevin!!!!!", "2019-02-01T23:02:27.000Z": "Taking a baby's life is not health care, let's call it for what it is, murder. What politicians in New York and Virginia are calling for is abhorrent, barbaric, and unconscionable. This is not who we are as a people, and we should never stop fighting for the unborn.", "2019-01-31T00:37:48.000Z": "Even on the coldest day, Iowans have the warmest hearts!!!!", "2019-01-25T22:38:03.000Z": "One week ago I was sworn in as Iowa's first elected female governor, an honor I am so humbled and proud to be blessed with. Thank you for giving me the opportunity to serve as this state's 43rd governor. https:// youtu.be/qromr60tHO8", "2019-01-18T17:15:04.000Z": "I am incredibly honored and humbled to stand before you today to take the oath as the first woman elected governor of our great state. I am grateful for the faith you have placed in me, I am humbled by the generosity you've shown me, and I am eager to serve the people of Iowa.", "2019-01-18T16:27:58.000Z": "If we do that, we will have lived a life we can be proud of. A life that is worthy of the freedoms we've been given. A life that is truly Iowan. Quote Tweet Kim Reynolds @KimReynoldsIA Let's worship God and take care of our neighbors. Let's strive to teach our children the same values, and let's give them a life that is better than our own.", "2019-01-18T16:27:18.000Z": "Let's worship God and take care of our neighbors. Let's strive to teach our children the same values, and let's give them a life that is better than our own.", "2019-01-18T16:26:54.000Z": "When it comes to the qualities that define our great State, let's not let the world change us. Let's change the world.", "2019-01-18T16:24:26.000Z": "But there are still Iowans who are struggling. They work hard but feel like they can't get ahead. They want something more, but believe that time has passed them by. For those Iowans, I'm here to tell you it's not too late. I'm living proof of that.", "2019-01-18T16:23:41.000Z": "We must do more than just prepare our kids for a career. We have to teach them to be moral, productive members of society. We must instill in them the Iowa values that our parents instilled in us.", "2019-01-18T16:21:50.000Z": "If we look up and to each other, we will see that great things are happening in this State. And if we put our energy into action instead of outrage, we will find that there are even greater days to come.", "2019-01-18T16:20:49.000Z": "My ask of all Iowans, as we go into the next four years, is that you devote less time to online political arguments and more time to each other. That you don't let a screen steal time from your family and friends, from your community or school.", "2019-01-18T16:19:55.000Z": "Too often, across the country, people are looking not to themselves but to government to solve their neighbors' problems. They are focused less on what they can do and more on what they believe someone else is doing wrong.", "2019-01-18T16:19:17.000Z": "Government didn't make Iowa the best state in the nation, and government can't keep it that way.", "2019-01-18T16:18:35.000Z": "Iowans work hard, but not so much for themselves. They're ambitious, but not at at the expense of others.", "2019-01-18T16:17:31.000Z": "I've been fortunate to travel to all 99 counties every year for eight years. ... I get to see Iowa as a whole, and when I do-when I take a step back, squint my eyes and focus-here's what I see: one, big small town.", "2019-01-18T16:15:56.000Z": "We worship God; we take care of our neighbors; and we strive to teach our children the same values and give them a life that is better than our own. It's that simple. And it's why Iowa is the best state in the nation.", "2019-01-18T16:13:45.000Z": "I cannot think of a better place to grow up. My life has been so blessed because of it!", "2019-01-18T16:11:09.000Z": "I am eager to continue to serve the great people of Iowa!", "2019-01-18T04:36:26.000Z": "Tonight we kicked off the 2019 Inauguration with a powerful Service of Dedication at Lutheran Church of Hope. Thank you to @chrisweaver , @jonmero , Simon Estes, and more for your wonderful musical performances! Next up is the Swearing-In Ceremony tomorrow morning!", "2019-01-12T19:32:51.000Z": "ICYMI: Due overwhelming demand for tickets we're hosting a second Inaugural Ball on 1/18. Get your tickets today before they sell out! Visit http:// ReynoldsGregg.com to reserve your spot. Kim Reynolds - Iowa Governor Governor Kim Reynolds and Lt. Governor Adam Gregg are committed to building a better Iowa. Join the team today! reynoldsgregg.com", "2019-01-11T18:49:25.000Z": "The 2019 @ReynoldsGregg Inauguration will benefit four charities. One of which, @FoldsofHonor , is providing education scholarships to the children and spouses of our fallen and disabled service members. What a great cause!", "2019-01-01T20:29:07.000Z": "Huge win for @HawkeyeFootball ! #OutbackBowl2019", "2019-01-01T14:13:54.000Z": "Happy New Year! Excited for what this new year will bring to our state!", "2018-12-28T21:45:15.000Z": "", "2018-12-25T16:41:38.000Z": "Merry Christmas!", "2018-12-24T20:37:19.000Z": "From our family to yours, Merry Christmas!", "2018-12-21T19:27:06.000Z": "Great News: Iowa's Unemployment Rate is now tied for the lowest in the nation!", "2018-12-21T17:29:05.000Z": "The last time Iowa had the lowest unemployment rate in the nation was March 2000. #iagov  https:// governor.iowa.gov/2018/12/iowa-t ied-for-lowest-unemployment-rate-in-nation ", "2018-12-19T22:40:36.000Z": "That's a wrap! Finished up my 99 county tour for 2018 this afternoon at Central Springs Elementary School in Manly in Worth County! Thanks to these students for helping me celebrate! #iagov", "2018-12-19T15:45:07.000Z": "Congratulations, Sen. @ChuckGrassley for the major role you played in getting this historic criminal justice reform legislation passed! Quote Tweet ChuckGrassley @ChuckGrassley After yrs of bipartisan work w Sens Durbin & Lee The First Step Act passed the Senate 2night w a big bipartisan victory 87-12 vote Historic criminal justice reform happens once in a generation Now on its way 2 House & Pres Trump waiting w a pen to sign", "2018-12-19T15:25:42.000Z": "For Iowa to truly be successful, we have to see growth in every corner of our state. The recommendations from the Empower Rural Iowa Initiative are just the beginning, & I can't wait to see how we will continue to empower rural communities in the future. What does rural Iowa need? High-speed internet and housing, task forces tell governor DES MOINES - Rural Iowa needs more assistance from the state to address housing shortages and limited access to high-speed internet, three state task forces told the governor Tuesday. thegazette.com", "2018-12-07T16:56:32.000Z": "Remembering the lives lost at Pearl Harbor 77 years ago today, including several Iowans whose remains have recently been identified. #iagov More from @AP : Remains of Pearl Harbor sailors return home after 77 years HONOLULU (AP) - More than 75 years after nearly 2,400 members of the U.S. military were killed in the Japanese attack at Pearl Harbor, some who died on Dec. 7, 1941, are finally being laid to rest in... apnews.com", "2018-12-06T17:00:34.000Z": "While we lost a great leader and patriot, I believe Americans showed that we will remember the legacy of @GeorgeHWBush and everything he stood for. Today he is being laid to rest in College Station, Texas. #Remembering41 President George H.W. Bush laid to rest next to wife, daughter The president was buried in Texas after a funeral service markedly different from the one the nation watched on Wednesday in Washington, D.C. abcnews.go.com", "2018-12-01T14:38:37.000Z": "Our hearts and our prayers continue to go out to the Bush family. It is my hope that as a nation, we will remember his legacy and as leaders in public service, we will work to meet the standard he set for many years to come. (3/3)", "2018-12-01T14:38:09.000Z": "Last night, we didn't just lose a patriot who dedicated his life to serving America, but also a loving husband, father and grandfather who now leaves behind a grieving family. (2/3)", "2018-12-01T14:37:22.000Z": "My statement on the passing of @GeorgeHWBush : \n\nAmerica lost a great leader with the passing of George HW Bush. A man whose legacy is one of service, statesmanship and values. (1/3)", "2018-11-29T22:41:02.000Z": "I'm humbled that my fellow Republican Governors have entrusted me with this role. I look forward to helping elect Republican Governors around the country! Quote Tweet The RGA @The_RGA Congratulations to our new RGA Executive Committee - a strong group of Republican governors who know how to win: @GovRicketts , @GregAbbott_TX , @DougDucey , @AsaHutchinson , @KimReynoldsIA , @CharlieBakerMA , @PhilBryantMS , @DougBurgum and @KristiNoem ! https:// goo.gl/L6LSh9", "2018-11-22T15:13:00.000Z": "Kevin & I hope the blessings of Thanksgiving fill your home and heart with happiness and cherished moments. Happy Thanksgiving!\n\n(Photography by @lnwphoto )", "2018-11-16T17:53:14.000Z": "NEWS: Iowa's Unemployment Rate falls even lower. Our pro-growth policies are working, and we are just getting started!", "2018-11-14T20:00:18.000Z": "Proud of my dear friend @joniernst ! Ernst elected to Senate GOP leadership Ernst becomes the first woman to be elected to Senate GOP leadership since 2010. thehill.com", "2018-11-14T16:00:01.000Z": "I am excited to get back to work on behalf of Iowans because we are just getting started! Job skills, education, tax cuts, mental health top Gov. Kim Reynolds' 2019 legislative priorities \"I believe that if we can get job creators the workers they need, we are going to see this economy just explode,\" Gov. Reynolds said. desmoinesregister.com", "2018-11-11T16:51:43.000Z": "Wishing the brave men and women who put everything on the line to serve this country a Happy Veterans Day.", "2018-11-07T06:10:14.000Z": "I am proud to say I am the first elected woman governor in our state. I am proud of the direction we are going. And even better WE ARE JUST GETTING STARTED!", "2018-11-07T00:59:58.000Z": "There's still time to vote. Polls don't close until 9:00 P.M. #KeepIowaMoving", "2018-11-06T23:37:53.000Z": "Remember: Polls don't close until 9:00p.m. So #GOTV ! Not sure where your polling location is? Find out here! Vote TODAY! Vote TODAY! Learn more here. reynoldsgregg.com", "2018-11-06T22:03:34.000Z": "Have you voted yet? Share if you've already voted for the Republican team!\n\nIf you haven't, make sure you get to your polling location! Find yours here: https:// sos.iowa.gov/elections/vote rreg/pollingplace/search.aspx   #ElectionDay  #KeepIowaMoving", "2018-11-06T21:12:37.000Z": "Get out and vote today! #KeepIowaMoving", "2018-11-06T19:42:40.000Z": "If you haven't already, please vote for our great Governor @KimReynoldsIA ! #KeepIowaMoving Quote Tweet Kim Reynolds @KimReynoldsIA Get out and vote today! #KeepIowaMoving", "2018-11-06T20:09:11.000Z": "So proud of my vote today to keep Iowa going in the right direction! Thank you @KimReynoldsIA let's keep moving forward #TeamKim", "2018-11-06T19:44:36.000Z": "Had time to stop by campaign HQ on this Election Day to once again thank all of our hardworking volunteers. We are going to win this!! #KeepIowaMoving", "2018-11-06T18:59:42.000Z": "Many years it can feel like a duty to vote, but this year it was absolutely my honor to vote for ... @KimReynoldsIA  ... @adamgregg16 . Thank you for LEADING our state with passion and integrity! #keepiowamoving  #1state", "2018-11-06T19:40:56.000Z": "Get out and vote today! #KeepIowaMoving", "2018-11-06T14:24:55.000Z": "Remember to vote for @Shannon_Latham and @KimReynoldsIA today!!!! #republicansforiowa", "2018-11-06T16:50:25.000Z": "I proudly cast my vote for @KimReynoldsIA this morning.  \nKim is a great leader. We need to keep her as Governor!\nShe won't bury Iowa in new taxes, and regulations like Fred Hubbel. #IVoted  #GoVote  #Midterm2018", "2018-11-06T14:31:46.000Z": "Today is Election Day and I humbly ask for your vote to #KeepIowaMoving in the right direction! http:// reynoldsgregg.com/vote", "2018-11-06T12:59:39.000Z": "Polls are open! I humbly ask for your vote so that we can #KeepIowaMoving !", "2018-11-06T01:18:26.000Z": "We are in Sioux Center for our final rally of the #KIM RV Tour! 70+ stops starting on October 24th. I think it's safe to say that we are fired up to #KeepIowaMoving !!!!", "2018-11-06T01:07:02.000Z": ". @culvers stop before our final event of the day. Cheese curds are top notch!", "2018-11-05T22:46:53.000Z": "UFC Hall of Famer @patmiletich wants to Keep Iowa Moving with Team @ReynoldsGregg !", "2018-11-05T23:08:25.000Z": "Talk about last minute, I didnt have time to put my shoes on. Kim Reynolds for the win! Quote Tweet Megan Kirik @MegsKirik UFC Hall of Famer @patmiletich wants to Keep Iowa Moving with Team @ReynoldsGregg !", "2018-11-05T20:19:09.000Z": "No one covers more ground than @KimReynoldsIA  @ReynoldsGregg Keep up the good work and #KeepIowaMoving Quote Tweet Kim Reynolds @KimReynoldsIA Strong turnout in Davenport! Another big day on the #KeepIowaMoving Tour, and we have 9 stops tomorrow.", "2018-11-05T20:03:47.000Z": "Excited to be up in Mason City to talk about the stakes in this election. We either #KeepIowaMoving in the right direction! Strong turnout!!!", "2018-11-05T19:57:20.000Z": "\"Our state is booming, let's keep it that way.\" #KeepIowaMoving  http:// messengernews.net/opinion/editor ial/2018/10/support-kim-reynolds-for-governor/ ", "2018-11-05T18:48:34.000Z": "Made it to Waterloo! And we have a packed room supporting our entire ticket! #KeepIowaMoving", "2018-11-05T17:23:47.000Z": "Iowa has the RIGHT leadership in place RIGHT now to #KeepIowaMoving ! @KimReynoldsIA  @ReynoldsGregg", "2018-11-05T17:26:17.000Z": "Iowa's U.S. senators agree: Let's #KeepIowaMoving and re-elect @ReynoldsGregg ! @KimReynoldsIA  @joniernst", "2018-11-05T17:20:05.000Z": "Vote to #KeepIowaMoving !", "2018-11-05T16:32:05.000Z": "Great to be back in Cedar Rapids one more time before the Election! Let's finish strong and elect Republicans up and down the ballot to #KeepIowaMoving !", "2018-11-05T15:50:13.000Z": "Just left Ankeny, the first of 9 stops with the Republican Team that will #KeepIowaMoving !", "2018-11-05T14:38:18.000Z": "Let's #KeepIowaMoving ! Vote TOMORROW!", "2018-11-05T02:50:26.000Z": "Go team! Quote Tweet Nick Boeyink @BoeyinkNick Standing room only for @KimReynoldsIA in Davenport at the Machine Shed Restaurant! Scott County is ready to #KeepIowaMoving !", "2018-11-05T01:53:36.000Z": "Strong turnout in Davenport! Another big day on the #KeepIowaMoving Tour, and we have 9 stops tomorrow.", "2018-11-04T20:35:17.000Z": "Out in Ottumwa knocking on doors with @millermeeks . We are working hard in these last few days to #KeepIowaMoving !", "2018-11-04T20:15:45.000Z": "Here's why Senator @joniernst is voting to #KeepIowaMoving !", "2018-11-04T17:56:42.000Z": "A hero's welcome in @KimReynoldsIA hometown of Osceola! #ReynoldsGregg The following media includes potentially sensitive content. Change settings View", "2018-11-04T17:03:31.000Z": "Heading to our first stop of the day, hometown rally in Osceola! So blessed to have the grandkids come along because it's a reminder of what we are fighting for. This Tuesday, I need your vote to #KeepIowaMoving for Iowa's future!", "2018-11-04T15:52:01.000Z": "This race will go down to the wire! I need you to get out and vote for me and the Republican Team so that we can #KeepIowaMoving . http:// reynoldsgregg.com/vote", "2018-11-03T21:31:16.000Z": "The Gov is making GOTV calls from the HQ! Sign up to help out during these final few days! http:// ReynoldsGregg.com/volunteer  #KeepIowaMoving", "2018-11-03T21:27:37.000Z": "Made it over to Campaign HQ to thank our hardworking volunteers making a difference today. Our team is fired up and ready to #KeepIowaMoving ! #VoteKIM", "2018-11-03T18:04:03.000Z": "Getting ready to watch some @UNIFootball  #UNIFight !", "2018-11-03T17:53:46.000Z": "With @ChuckGrassley talking with Iowans at the @northerniowa Football Game! #GoPanthers", "2018-11-03T16:57:04.000Z": "#KeepIowaMoving tour came to #VanMeter this morning. #iapolitics  #Election2018  #KIM", "2018-11-03T15:38:59.000Z": ". @KimReynoldsIA speaks first at the Van Meter spot on the Victory Express tour full of Republicans running for election. #iapolitics", "2018-11-03T15:10:04.000Z": "Only 3 days left! Let's #KeepIowaMoving !", "2018-11-03T14:58:21.000Z": "Kicking off the Whistle Stop Victory Tour for my good friend @YoungForIowa . This Republican Team gets results and it's why we need to #KeepIowaMoving ! #KIM  #DavidDelivers", "2018-11-02T22:33:40.000Z": "We are now just four days out! With your vote, we are going to #KeepIowaMoving ! \n\nAre you with me?", "2018-11-02T22:10:19.000Z": "We are now just four days out! With your vote, we are going to #KeepIowaMoving !\n\nAre you with me?", "2018-11-02T17:50:16.000Z": "Our unemployment rate is the 2nd lowest in the country, wages are going up, and taxes are going down! Let's not turn back, I need your vote to #KeepIowaMoving !", "2018-11-02T15:21:25.000Z": "Exciting morning with two incredible women, @IvankaTrump and @hinsonashley . Talking about how we #KeepIowaMoving through pro-growth policies at the state and federal level!", "2018-11-02T15:09:42.000Z": "We only have 4 DAYS left! Vote early to #KeepIowaMoving ! http:// reynoldsgregg.com/vote", "2018-11-02T14:53:15.000Z": "Greatness STEMS from Iowans! Quote Tweet Caroline Cummings @CaroRCummings \"The future of work requires digital literacy,\" says @IvankaTrump , talking about STEM education. She says she works with @KimReynoldsIA , other governors, industry leaders on the issue. #iagov  #iapolitics Show this thread", "2018-11-02T14:12:15.000Z": "\"The voice of governors at the White House is absolutely critical,\" says @IvankaTrump at @KimReynoldsIA campaign event in WDM #iagov  #iapolitics", "2018-11-02T01:40:00.000Z": "Thumbs UP for our @IowaGOP supporters tonight with @IvankaTrump  @KimReynoldsIA and @YoungforIowa . Let's #KeepIowaMoving  #iapolitics", "2018-11-02T01:22:30.000Z": "US House candidate, IA-3 I was honored to join @KimReynoldsIA and @IvankaTrump at our Campaign HQ tonight to talk about #Iowa 's booming economy, workforce development programs and to get out and #vote to #KeepIowaMoving ! #IA03", "2018-11-02T01:15:24.000Z": "Thank you @IvankaTrump ! Welcome to Iowa, can't wait for tomorrow. #KeepIowaMoving", "2018-11-02T01:12:46.000Z": "Thank you @IvankaTrump for stopping by the victory office and rallying the troops! See you tomorrow morning to talk more about how we can #KeepIowaMoving !", "2018-11-01T21:22:30.000Z": "Overflowing crowd in Dubuque today. You can actually feel the momentum! #KeepIowaMoving  #iagov", "2018-11-01T16:46:34.000Z": "Dubuque wants lower taxes, higher wages and thats what we are working. It's why I need Iowans to get out there and vote to #KeepIowaMoving !!!!", "2018-11-01T16:04:12.000Z": "I need your vote to #KeepIowaMoving in the right direction!", "2018-11-01T15:56:14.000Z": "Team @ReynoldsGregg and @IowaGOP rolls into Maquoketa for the #KeepIowaMoving Tour. We lowered taxes, delivered on promises, and now Iowans are coming out in force to keep it going!", "2018-11-01T15:34:36.000Z": "We only have 5 days to go! I need your vote to #KeepIowaMoving ! http:// reynoldsgregg.com/vote", "2018-11-01T13:16:19.000Z": "I look forward to welcoming @IvankaTrump back to Iowa and talking about pro-growth policies that will #KeepIowaMoving ! Ivanka Trump to campaign with Kim Reynolds on Friday in Iowa governor's race Ivanka Trump will campaign for Iowa Gov. Kim Reynolds at an invitation-only event in West Des Moines Friday. desmoinesregister.com", "2018-11-01T00:46:27.000Z": "RV Pic w/ the Pleasant Valley High School Marching Band! #KeepIowaMoving", "2018-10-31T22:18:34.000Z": "Watch Senator @ChuckGrassley help explain why I need your vote to #KeepIowaMoving !", "2018-10-31T21:44:35.000Z": "#KeepIowaMoving Tour rolled into Columbus Junction! Iowans are fired up about the direction we are going in and want to move forward, not backwards!", "2018-10-31T19:25:10.000Z": "Packed house in Ottumwa on a Wednesday afternoon! Voters in every corner of Iowa want to #KeepIowaMoving !", "2018-10-31T18:45:09.000Z": "After almost 40,000 votes cast we project @KimReynoldsIA the winner of the Iowa Youth Straw Poll in #iagov race. @RodBlum the winner in #IA01 @DrPeters4Iowa in #IA02  @DavidYoungIA in #ia03  @SteveKingIA in #ia04 Results are unscientific. https:// sos.iowa.gov/youth/poll/res ults.aspx   #BeAVoter", "2018-10-31T17:29:36.000Z": "We had an awesome morning in Indianola, Pella, and Oskaloosa! The #KeepIowaMoving Tour is coming to a town near you, come on by, honk your horn if you like tax cuts, and don't forget to VOTE @ReynoldsGregg & the Republican Team!", "2018-10-31T16:30:29.000Z": "Another great day on the road with @GrassleyWorks and @joniernst ! Couldn't ask for better friends and supporters as we close out the campaign and vote to #KeepIowaMoving !", "2018-10-31T14:15:49.000Z": "Only 6 days left! Let's #KeepIowaMoving by voting early! http:// reynoldsgregg.com/vote", "2018-10-30T21:40:14.000Z": "We have a great story to tell, and with your vote we can #KeepIowaMoving ! https:// youtube.com/watch?v=UU42Yo 4zUSw&feature=youtu.be ", "2018-10-30T17:04:06.000Z": "With low unemployment, rising wages, and lower taxes, Iowa is working! And we are just getting started! But we can't reverse course now, so I need your vote to #KeepIowaMoving !", "2018-10-30T14:47:55.000Z": "Great profile of Gov. @KimReynoldsIA worth a watch! #KeepIowaMoving  @ReynoldsGregg Reynolds vying for governor seat in 'best state in the country' Republican Governor Kim Reynolds is in a tight race with Democratic challenger Fred Hubbell. kcci.com", "2018-10-30T15:16:22.000Z": "In Carroll hearing from Iowans about why we need to #KeepIowaMoving with lower taxes, better wages, and our historic investments into education. We are just getting started! Vote!", "2018-10-30T14:06:28.000Z": "I need your vote so I can #KeepIowaMoving ! Get out and VOTE! http:// reynoldsgregg.com/vote", "2018-10-30T13:24:19.000Z": "Good morning Harlan! Fired up crowd one week out from Election Day as the #KeepIowaMoving Tour rolls on!", "2018-10-29T23:40:00.000Z": "I need your help to Keep Iowa Moving! Vote Early! https:// reynoldsgregg.com/vote-early/", "2018-10-29T22:19:19.000Z": "Join our team today so we can Keep Iowa Moving! Only 8 days left! Sign up to volunteer for our campaign below: Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-10-29T21:54:08.000Z": "Folks in Council Bluffs are 100% behind the Republican Team and want to #KeepIowaMoving !!!", "2018-10-29T20:44:56.000Z": "#GirlPower W/ @joniernst and State Auditor @MaryMosiman !!! (All three of us started off as county officials) #KeepIowaMoving", "2018-10-29T14:35:58.000Z": "Good Morning Winterset!!!! Love the energy and momentum behind our fight to #KeepIowaMoving !", "2018-10-29T14:12:30.000Z": "My opponent will say anything at this point because our unemployment rate continues to be at a historic low of 2.5%, the second lowest in the country! If you want to keep our economy growing, make sure to get out and vote so we can #KeepIowaMoving !", "2018-10-29T13:18:26.000Z": "\"Iowa is doing well. The economy is healthy and growing. State government is well-managed. Taxpayers are seeing their money spent wisely and with frugality. Unemployment is at a historic low.\" http:// messengernews.net/opinion/editor ial/2018/10/support-kim-reynolds-for-governor/ ", "2018-10-29T00:46:16.000Z": "Busy day on the road but it's been fun to have Kevin along with me! #KeepIowaMoving", "2018-10-29T00:26:08.000Z": "Ending Day 5 of the #KeepIowaMoving Tour with a packed house in Crawford County!", "2018-10-28T20:38:00.000Z": "She CARES about #Iowa . \nShe's got the RIGHT message. She's the BEST candidate. #Vote for Gov. @KimReynoldsIA . #IApolitics  #KeepIowaMoving OUR OPINION: Kim Reynolds represents best choice for governor If you look across Iowa's landscape and see mostly successes and growing opportunities for the future, then you likely will vote for incumbent Kim Reynolds for governor because that's the siouxcityjournal.com", "2018-10-28T21:43:43.000Z": "Stop #4 on the #KeepIowaMoving Tour in Sioux City! We had a lot of people come out to talk about how Iowa is moving forward!", "2018-10-28T18:30:22.000Z": "That time @KimReynoldsIA Facetimed with her volunteers just to say hi & thanks! #KeepIowaMoving", "2018-10-28T18:07:53.000Z": "Sioux City Journal endorses @KimReynoldsIA for Iowa Governor OUR OPINION: Kim Reynolds represents best choice for governor If you look across Iowa's landscape and see mostly successes and growing opportunities for the future, then you likely will vote for incumbent Kim Reynolds for governor because that's the siouxcityjournal.com", "2018-10-28T17:48:29.000Z": "Strong turnout here in Storm Lake because Iowans in every corner of the state are fired up about more opportunity, higher wages, lower taxes, and investments in education. The #KeepIowaMoving Tour is coming to a town near you!", "2018-10-28T15:28:08.000Z": "Emmetsburg wants to #KeepIowaMoving !", "2018-10-28T14:52:00.000Z": "\"Our view of Iowa is much closer to the bright, optimistic vision of Reynolds than the gloom and doom Hubbell describes. As a result, The Journal editorial board today endorses Republican Reynolds over Democrat Hubbell.\" OUR OPINION: Kim Reynolds represents best choice for governor If you look across Iowa's landscape and see mostly successes and growing opportunities for the future, then you likely will vote for incumbent Kim Reynolds for governor because that's the siouxcityjournal.com", "2018-10-28T13:12:17.000Z": "Stop #1 on Day #5 on the #KeepIowaMoving Tour! Thank you Garner!", "2018-10-27T23:37:46.000Z": "Packed house in Hamilton County as the #KeepIowaMoving Tour hits Webster City!", "2018-10-27T22:45:05.000Z": "Just hit 1,000 miles on our #KeepIowaMoving Tour!!", "2018-10-27T19:49:12.000Z": "Today is the last day to pre-register to vote! We need you to get out there and support our team so that we can #KeepIowaMoving ! Quote Tweet Iowa GOP @IowaGOP Today is the last day to register to vote before Election Day. Make sure your voice is heard in this election! Get registered now  http:// iowagop.org/vote  #KeepIowaMoving", "2018-10-27T19:17:41.000Z": "Newton is on Team @ReynoldsGregg because we are going to #KeepIowaMoving !", "2018-10-27T15:54:27.000Z": "Going door to door w/ @CournoyerIA , talking to voters about how we are cutting taxes and investing in schools! We are everywhere talking about the importance of this election & why we need to #KeepIowaMoving !", "2018-10-27T15:14:43.000Z": "Be on the lookout, @KimReynoldsIA and @CournoyerIA are out knocking doors in Le Claire this morning! #KeepIowaMoving", "2018-10-27T14:00:38.000Z": "With my good friend Senator @joniernst out on the campaign trail. The message is simple: Get out and vote for the Republican Team so we can #KeepIowaMoving !!!!", "2018-10-27T13:05:09.000Z": "Senator @joniernst is kicking off the day w @KimReynoldsIA in Davenport! The #KeepIowaMoving Tour rolls on!", "2018-10-26T22:37:17.000Z": "It's a FACT: We have invested more into K-12 education than ever before, and my administration will continue to make education a priority. #FactCheckFriday", "2018-10-26T19:48:17.000Z": "Clinton, IA is on Team @ReynoldsGregg ! #KeepIowaMoving tour rolls on!", "2018-10-26T15:23:29.000Z": "Huge turnout in Burlington for the beginning of Day 3 on the K.I.M. tour, everyone is fired up to get out and vote to #KeepIowaMoving ! Special shoutout to the 5th grade class from North Hill, thank you for coming. I enjoyed meeting every one of you!", "2018-10-26T13:12:18.000Z": "Amazing turnout for @KimReynoldsIA in Burlington at the Ivy Bake Shoppe this morning! No time is too early for these folks to KEEP IOWA MOVING! #iagov  #KeepIowaMoving", "2018-10-25T23:09:00.000Z": "Huge turnout in Keokuk, and Iowans are fired up about the positive momentum we are seeing! Wages going . Taxes going . And with your vote we #KeepIowaMoving  Forward!", "2018-10-25T21:08:57.000Z": "My opponent will say anything over these next two weeks because the first thing he wants to do is roll back historic tax reform! We can't let that happen. I need your vote to #KeepIowaMoving ! Gov. Kim Reynolds signs largest tax cut in Iowa history thegazette.com", "2018-10-25T20:08:13.000Z": "We are out in Washington, IA today talking about tax cuts, our budget surplus, and historic investments in education. While Democrats have scare tactics, we have results! Vote to #KeepIowaMoving !", "2018-10-25T15:49:55.000Z": "I love being a grandma! And with your vote, we will #KeepIowaMoving for all of our grandkids!", "2018-10-25T15:34:54.000Z": "Folks in Cedar Rapids want to #KeepIowaMoving ! Energy, enthusiasm, and excitement is high because Iowa is on the right track!", "2018-10-25T14:40:36.000Z": "Waterloo wants to #KeepIowaMoving . Folks are fired up as the bus tour rolls into Day 2!!!", "2018-10-25T02:40:24.000Z": "What a FUN evening!!! Thank you, @KimReynoldsIA ! With @PatGrassley  @MaryMosiman and our outstanding Hardin County Ticket. #KeepIowaMoving  #VoteSweeney  #SD25", "2018-10-24T23:40:20.000Z": "Proud of what this Team of state and local candidates are doing to #KeepIowaMoving !", "2018-10-24T22:21:51.000Z": "What 2 words do you need to know about #IOWA Gov. @KimReynoldsIA ? Listen and #VOTE to #KeepIowaMoving . #iapolitics", "2018-10-24T19:47:57.000Z": "If you see us on the road today do us a favor, honk if you like tax cuts!!!! #KeepIowaMoving", "2018-10-24T19:41:53.000Z": "Thank you Marshalltown! This state is behind you and the community will come back stronger than before! Great turnout for our #KeepIowaMoving Bus Tour Stop!", "2018-10-24T16:23:07.000Z": "Team #ReynoldsGregg absolutely PACKED the house this morning in Central Iowa! #KeepIowaMoving on Nov. 6th!", "2018-10-24T17:51:24.000Z": "Iowa is heading in the right direction, look no further than Story County - one of the lowest unemployment rates in the country! Let's #KeepIowaMoving !", "2018-10-24T16:14:07.000Z": "Boone wants to #KeepIowaMoving ! 13 days out, go vote at http:// reynoldsgregg.com/vote-early !", "2018-10-24T14:40:16.000Z": "Thank you to everyone who stopped by this morning as we kicked off our #KeepIowaMoving Bus Tour in Waukee!", "2018-10-24T14:13:31.000Z": "\"Honk if you like tax cuts\" on back on @KimReynoldsIA tour bus", "2018-10-24T13:48:34.000Z": "@KimReynoldsIA arrives at rally to see @ChuckGrassley in the crowd #iapolitics", "2018-10-24T13:11:12.000Z": "13 Days until Election Day on November 6th!!! Get out and vote!!! Vote early, vote absentee, because every single vote counts. http:// reynoldsgregg.com/vote-early", "2018-10-24T01:38:00.000Z": ". @KimReynoldsIA , @ReynoldsGregg I enjoyed this ad, well done.  #iagov  #iapolitics New Reynolds TV Ad Focuses on Her Role as a Grandmother | Caffeinated Thoughts Iowa Governor Kim Reynolds' campaign released an ad that focuses on how being a grandmother of 10 has prepared her in her role as Governor. caffeinatedthoughts.com", "2018-10-24T01:03:40.000Z": "I'm hitting the road tomorrow! Join me at one of our 5 stops to hear how we'll keep Iowa Moving with low unemployment rates, job training programs, and historically low taxes. Check out the events close to you by heading to our website: Events Archive - Kim Reynolds reynoldsgregg.com", "2018-10-23T21:56:27.000Z": "The #KeepIowaMoving Bus Tour starts tomorrow. Come to the Jethros in Waukee at 8:30 a.m. for the RV reveal and our first official stop!", "2018-10-23T21:10:00.000Z": "This election will be close, so we need you off the sidelines! Sign up to volunteer on our campaign and do your part to keep this state moving forward. Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-10-23T19:09:00.000Z": "We are two weeks out! Make sure to vote early at the polls or vote absentee! Go to: http:// reynoldsgregg.com/vote", "2018-10-23T17:08:00.000Z": "Our budget is balanced, our rainy day fund is full, and we have a surplus of $127 million. We need to continue to build on this economic growth, we need to Keep Iowa Moving! Iowa budget surplus four times bigger than expected 'Our economy is growing, incomes are rising and our state's budget is a reflection of that.' kimt.com", "2018-10-23T15:47:04.000Z": "Iowans deserve to keep more of their hard-earned money, that's why I've signed into law the biggest tax cut our state has ever seen.", "2018-10-23T00:48:30.000Z": "Let's get out there and win this Election. I need your vote to #KeepIowaMoving !", "2018-10-23T00:17:11.000Z": "44 sheriffs endorse @KimReynoldsIA to #KeepIowaMoving , while only 8 sheriffs support @FredHubbell - It's CRYSTAL CLEAR: Iowa's law enforcement community supports #ReynoldsGregg . 44 GOP, Democratic sheriffs endorse Reynolds for Iowa governor CEDAR RAPIDS - Citing her support for law enforcement and background in local government, more than 40 Iowa county sheriffs endorsed Gov. Kim Reynolds on Monday. thegazette.com", "2018-10-22T23:50:35.000Z": "I am proud to have the support of county sheriffs in every corner of Iowa and I know that law enforcement will continue to be a partner as we make Iowa an even better, safer place to live. 44 GOP, Democratic sheriffs endorse Reynolds for Iowa governor CEDAR RAPIDS - Citing her support for law enforcement and background in local government, more than 40 Iowa county sheriffs endorsed Gov. Kim Reynolds on Monday. thegazette.com", "2018-10-22T23:24:04.000Z": "Great crowd tonight at the HQ! Thanks to all the @ReynoldsGregg volunteers helping across the state! #KeepIowaMoving  @KimReynoldsIA  @DavidYoungIA", "2018-10-22T22:35:00.000Z": "Don't wake up in 15 days and wish you'd done more, join our team today! 15 days until the election. Let's Keep Iowa Moving! http:// reynoldsgregg.com", "2018-10-22T20:45:38.000Z": "Iowa taxpayers cannot afford @FredHubbell !", "2018-10-22T19:59:38.000Z": "Get the facts! We are investing more than ever before in K-12 education. Even in last year's tough budget cycle, we didn't cut K-12, instead we increased funding. I am a mom, a grandma, and one of my daughters is a public school teacher! Trust me when I say education matters.", "2018-10-22T18:59:52.000Z": "I am a strong supporter of IPERS. Gov. Reynolds: 'Under my watch, your IPERS is safe. It will not change; it will be protected' \"As governor, I am reiterating that this promise will be kept. We will maintain and honor the commitments made to people in the IPERS system.\" desmoinesregister.com", "2018-10-22T15:42:47.000Z": "We are 15 days out and I need your vote to Keep Iowa Moving! Vote Early, Vote Absentee...our state is worth fighting for! Let's get out there and make it happen!", "2018-10-21T19:46:00.000Z": "Cedar Rapids wants to #KeepIowaMoving !", "2018-10-21T18:13:15.000Z": "I am a strong supporter of IPERS. We will not take away IPERS. Glad I was able to address this important issue during this morning's debate.", "2018-10-21T16:31:17.000Z": "Stopped in Davenport post debate to talk about what we saw on stage. If you want lower taxes, jobs, balanced budgets, and historic education funding, then I am your candidate to get it done!", "2018-10-21T14:54:24.000Z": "Another debate where I get to talk about the positive things going on across our state. Iowa is working! The budget is balanced, unemployment is at a record low, wages are going up, and taxes are going down! I humbly ask for your vote to #KeepIowaMoving !!!", "2018-10-21T14:22:48.000Z": "Republicans are proud to stand with @KimReynoldsIA , who just had another great debate. We're going to continue working in every corner of the state to ensure that we #KeepIowaMoving in November! Join us here: http:// iowagop.org/action  #iagov  #iagovdebate", "2018-10-21T14:02:14.000Z": "No question @KimReynoldsIA swept the debate series 3-0. #NoContest  #IAGovDebate  #iagov", "2018-10-21T14:04:19.000Z": ". @FredHubbell seems about as unprepared for this debate as he is to be governor. @KimReynoldsIA is consistently articulating Iowa's positive economic record and a strong vision for the future. #KeepIowaMoving  #iagov", "2018-10-21T13:47:56.000Z": "US Senate candidate, IA . @FredHubbell would reverse our progress, #KeepIowaMoving by voting for @KimReynoldsIA ! #IAgov  #IAgovdebate", "2018-10-21T13:50:37.000Z": "FACT: @FredHubbell sure does like taking tax credits! #IAGovDebate", "2018-10-21T13:49:16.000Z": "FACT: Our budget is balanced! Our surplus is $127 million. We are going to be able to keep taxes low invest in Iowa's future for years to come. #IAGovDebate", "2018-10-21T13:47:02.000Z": "Wages are going up, taxes are going down. Unemployment is at 2.5%, 2nd lowest in the country. We are going to #KeepIowaMoving ! #IAGovDebate", "2018-10-21T13:43:21.000Z": "The State of Mental Health in America 2018: In 2016, Iowa ranked 8th; in 2017, Iowa ranked 7th; and in 2018 Iowa ranked 6th #KeepIowaMoving  #IAGovDebate", "2018-10-21T13:42:40.000Z": "#IAGubernatorialDebate  @KimReynoldsIA \"Iowa taxpayers cannot afford Fred Hubbell.\"", "2018-10-21T13:37:44.000Z": "Gov. @KimReynoldsIA is about changing the culture in state government. https:// youtube.com/watch?v=mMzt1c SLFbM ", "2018-10-21T13:28:05.000Z": "FACT: The last administration in Iowa to cut education funding was Democrat Chet Culver. Hubbell was a part of that administration.", "2018-10-21T13:25:57.000Z": "Fact: Under Governor @KimReynoldsIA , there have been historic investments in K-12 education. Get the facts at http:// FactCheckFred.com", "2018-10-21T13:13:54.000Z": "Iowans won't be fooled by @FredHubbell . Regardless of what he says now, here's what he's said on taxes:\n\nHubbell's going to \"peel back\" the income tax cuts, and clarified that he was talking about \"all the tax cuts.\" #IAGov  #iagovdebate", "2018-10-21T13:12:53.000Z": "US Senate candidate, IA . @KimReynoldsIA balanced Iowa's budget, with a $127 million surplus! #IAgov  #IAgovdebate", "2018-10-21T13:10:02.000Z": "Here's @FredHubbell on taxes: \"We're going to have to peel back all those tax cuts.\" Hubbell wants higher taxes on Iowans. #IAGov  #iagovdebate IPTV - Fred Hubbell Would \"Peel Back All Those Tax Cuts\" youtube.com", "2018-10-21T13:11:33.000Z": "US Senate candidate, IA Iowa has historically low unemployment and rising incomes due to tax cuts - @FredHubbell wants to RAISE YOUR TAXES! #IAgov", "2018-10-21T13:10:44.000Z": ". @FredHubbell is lying about his record again, he wants to raise taxes on Iowans all across our state! #IAGovDebate", "2018-10-21T13:10:00.000Z": "Gov. @KimReynoldsIA supports lower taxes for Iowa families, individuals, and small businesses. @FredHubbell wants to raise your taxes. #IAGovDebate  #KeepIowaMoving", "2018-10-21T13:05:07.000Z": "Gov. @KimReynoldsIA : My story is the Iowa story. I have led on cutting taxes, investing in education, and Iowa is working! #IAGovDebate  #KeepIowaMoving  https:// youtube.com/watch?v=9BNl-l epWQ8 ", "2018-10-21T12:03:43.000Z": "It's early, it's cold, but @KimReynoldsIA supporters posted up outside the 3rd and final debate want to #KeepIowaMoving ! #IAGovDebate", "2018-10-21T11:07:26.000Z": "Handing off my account to the campaign team for the debate! Don't forget to tune in this morning at 8am! #IAGovDebate  #KeepIowaMoving Quote Tweet Kim Reynolds @KimReynoldsIA The 3rd debate is being held in Davenport at 8 AM tomorrow! Tune in on KWQC, KCRG, or WOWT as we talk about important issues & how with your support I can #KeepIowaMoving ! It will be streamed online on http:// KWQC.com , http:// KCRG.com , or http:// WOWT.com .", "2018-10-21T02:14:17.000Z": "The 3rd debate is being held in Davenport at 8 AM tomorrow! Tune in on KWQC, KCRG, or WOWT as we talk about important issues & how with your support I can #KeepIowaMoving ! It will be streamed online on http:// KWQC.com , http:// KCRG.com , or http:// WOWT.com .", "2018-10-20T20:35:22.000Z": "We are making historic investments in K-12 education. As long as I am governor, we are going to continue to put our kids first!", "2018-10-20T19:01:29.000Z": ". @FredHubbell 's not fooling anybody. He will raise taxes on hardworking Iowans. #iagov", "2018-10-20T19:13:06.000Z": "Let's keep Iowa moving in the right direction. With your vote in November, we can continue focusing on jobs, education, health care and public safety. My story is the Iowa story. I love this state, our people and this job. Reynolds: Keep Iowa moving forward Every day, I'm working to build a better Iowa. It's the first thing I think about in the morning and on my mind at night. I take this job seriously because Iowans trust me to do what's right. thegazette.com", "2018-10-20T15:40:37.000Z": "It is an incredible honor to serve as the Governor of this great state. If you work hard, dream big anything is possible. My story is the Iowa Story.", "2018-10-20T14:33:53.000Z": "\"We're not just satisfied being number one, we want to stay number one and we wake up every day passionate about that. We're good, but we can be even better.\" https:// lemarssentinel.com/story/2560025. html   @KimReynoldsIA  @ReynoldsGregg  #KeepIowaMoving Gregg hits campaign trail: 'Every vote counts' LE MARS -- The days are counting down to the gubernatorial election on Nov. 6, and Iowa's Lt. Gov. Adam Gregg is traveling the state, making the case Iowans should choose him and Gov. Kim Reynolds'... lemarssentinel.com", "2018-10-19T21:15:05.000Z": "GREAT afternoon in Iowa supporting my friend & one of America's best governors - @KimReynoldsIA ! Kim puts the people of Iowa first! She's an advocate for our veterans & troops, she fights for Iowa's farmers & she stands proudly with @RealDonaldTrump ! She has my full support.", "2018-10-19T21:35:00.000Z": "We need to #KeepIowaMoving ! We can only do that if you, your friends, and family show up and vote for our Republican Team! Vote early today http:// reynoldsgregg.com/vote", "2018-10-19T20:14:35.000Z": "Sounds like he wants to raise taxes!", "2018-10-19T19:27:44.000Z": "\"Iowa is considered one of the best run states in America, and the second lowest unemployment rate in the country.\" @mike_pence touts @KimReynoldsIA . #ia03  #iagov  #iapolitics", "2018-10-19T18:14:29.000Z": "Iowa's unemployment rate remains the 2nd LOWEST in the country! Our pro-growth policies are working, wages are going up, taxes are going down, and we can't turn back now! Let's #KeepIowaMoving !!!!", "2018-10-19T16:03:26.000Z": "This is a hard working team that is putting on a tremendous @futurereadyiowa summit! Quote Tweet Future Ready Iowa @futurereadyiowa Good morning from Des Moines and the largest Future Ready Iowa summit yet. Here's the @Iowa_WORKS staff that's making it happen! #FutureReadyIA", "2018-10-18T22:12:56.000Z": "Great crowd in Mason City! We're going to Keep Iowa Moving, but in order to do so I need you to vote! Visit http:// ReynoldsGregg.com and check out the VOTE 2018 tab for more details! #KeepIowaMoving", "2018-10-18T21:59:00.000Z": "We need you off the sidelines. Here's how you can volunteer for my campaign today: Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-10-18T21:01:57.000Z": "Senator @ChuckGrassley wants to Keep Iowa Moving! Help us do that with your vote this November. @GrassleyWorks", "2018-10-18T17:52:58.000Z": "Next stop: Spencer! Northwest Iowa is fired up to Keep Iowa Moving. Great to see so many supporters and thank you Rep Megan Jones for the kind intro! #KIM  #KeepIowaMoving", "2018-10-18T17:02:29.000Z": "We are changing the culture in state government, putting more women in leadership, and I want every little girl to know that in Iowa you can and be anything you want to be! https:// youtube.com/watch?v=mMzt1c SLFbM&feature=youtu.be ", "2018-10-18T15:26:05.000Z": "Kicked off the day in Rock Rapids! What a great way to spend the morning after the second debate. Thank you to @drcodyhoefert for organizing!", "2018-10-18T02:46:00.000Z": "#Vote for Gov. @KimReynoldsIA  #KeepIowaMoving  #iapolitics", "2018-10-18T01:36:22.000Z": ". @KimReynoldsIA had ANOTHER strong debate performance tonight. Kim is the only candidate who is going to #KeepIowaMoving ! #iagov  #iagovdebate", "2018-10-18T00:40:44.000Z": "US Senate candidate, IA WOW! Nice job, Kim! Iowa is lucky to have such a strong woman leader in our state. #IAgov", "2018-10-18T01:02:56.000Z": "Gov. @KimReynoldsIA is about changing the culture! #IAGovDebate", "2018-10-18T00:56:56.000Z": "US Senate candidate, IA . @KimReynoldsIA has been working day in, and day out, to make Iowa #1. Does @FredHubbell even WANT to be governor? #IAgov", "2018-10-18T00:56:24.000Z": "Another great performance by @KimReynoldsIA tonight, and a doubling down of @FredHubbell 's lack of vision for the state. We're proud to be on team #ReynoldsGregg", "2018-10-18T00:56:14.000Z": "Iowa is working. Taxes are going down and wages are going up. We are the best place in America to live - let's keep it that way.", "2018-10-18T00:52:33.000Z": "US Senate candidate, IA . @KimReynoldsIA makes promises, and keeps them. #IAgov", "2018-10-18T00:49:30.000Z": "FACT CHECK FRED: This is Fred Hubbell's real record putting women in leadership. 17 Men, 1 woman. Source: Equitable of Iowa Cos., SEC Form 14A Filings 1994 #IAgovdebate", "2018-10-18T00:49:40.000Z": "\"We're gonna have to feel back all those tax cuts\" - Fred Hubbell...He's gonna raise your taxes, @KimReynoldsIA is cutting your taxes. #iagov  https:// youtu.be/W7i2MSLwPDE", "2018-10-18T00:39:21.000Z": "FACT: More money is spent on K-12 education than ever before.", "2018-10-18T00:37:00.000Z": "I was proud to pass bipartisan, comprehensive mental health reform into law this year which will expand mental health services in our state by creating 6 new regional access centers. We are helping some of our most vulnerable Iowans. Gov. Reynolds signs Iowa mental health, suicide prevention bills in emotional ceremony The bills make sweeping changes in Iowa's mental health system and require suicide prevention training for school employees. desmoinesregister.com", "2018-10-18T00:30:44.000Z": ". @FredHubbell , Medicaid isn't about politics! #IAGovDebate", "2018-10-18T00:25:23.000Z": "FACT CHECK FRED: The tax credit review panel recommended eliminating the Assistive Device Tax Credit, which was hailed as \"milestone and a victory for small businesses and Iowans with disabilities\" by the University of Iowa. #IAGovDebate", "2018-10-18T00:24:26.000Z": ". @KimReynoldsIA is cleaning @FredHubbell 's clock on rural Iowa. Who received Iowa Farm Bureau's endorsement? Not Hubbell. #iagov  #iagovdebate", "2018-10-18T00:21:35.000Z": "\"Nobody wins in a trade war.\" - @KimReynoldsIA Governor @KimReynoldsIA is a champion for Iowa farmers. She will continue to be an advocate for free and fair trade - she also has a record to back it up! #KeepIowaMoving", "2018-10-18T00:15:45.000Z": "Governor Reynolds isn't satisfied with the status quo and is working to make changes to Iowa's Medicaid System. We can't go back to the old unsustainable system, that's an election year tactic from @FredHubbell . #KeepIowaMoving Reynolds says she's making Medicaid better; vows to 'up the penalties' for late payments if needed CEDAR RAPIDS, Iowa - Gov. Kim Reynolds said she has heard enough. siouxcityjournal.com", "2018-10-18T00:15:23.000Z": "Chairman @kaufmannGOP is right! @FredHubbell has no plan! Don't even bother asking how he would pay to go back to the old system. #IAgovdebate Quote Tweet Jeff Kaufmann @kaufmannGOP Give me a break, @FredHubbell . When I was in the state legislature, we had to approve supplemental funding nearly every year as costs grew faster than everything else in the budget. We knew the old system was unsustainable - and you don't have a real plan. https:// youtu.be/KSJR9AX3Ikk?t= 173 ", "2018-10-18T00:13:13.000Z": ". @FredHubbell can't commit to lowering taxes. \n\nFact: He wants to raise them! #IAgovdebate", "2018-10-18T00:12:35.000Z": "I-Jobs was a failed boondoggle by Fred Hubbell and Chet Culver! It's still costing Iowans to this day!", "2018-10-18T00:12:10.000Z": "FACT: K-12 Education is a priority! #IAGovDebate", "2018-10-18T00:10:17.000Z": "We are seeing incomes rising and our economy is booming because our priorities are in the right place. Right now, Iowans are seeing more of their paycheck than ever before thanks to @KimReynoldsIA  #KeepIowaMoving  #IAgovdebate", "2018-10-18T00:09:03.000Z": "Gov. @KimReynoldsIA is fighting for lower taxes, @FredHubbell is not. Our budget is balanced, there's a surplus, and Iowa is moving forward! Fred wants to throw all of that away. #IAGovDebate", "2018-10-18T00:04:33.000Z": "Help us #KeepIowaMoving by helping us #FactCheckFred  #IAGovDebate Fact Check Fred Fact Check Fred reynoldsgregg.com", "2018-10-18T00:02:26.000Z": "Team @KimReynoldsIA here! We will be tweeting from the account while the Governor is on stage! #IAGovDebate  #KeepIowaMoving Quote Tweet Kim Reynolds @KimReynoldsIA The second debate is being held in Sioux City at 7 pm tonight, tune in and see how I plan to #KeepIowaMoving ! Watch on KTIV, KWWL, or KTTC on your television, or live streamed online at http:// KTIV.com or http:// KWWL.com !", "2018-10-17T23:28:40.000Z": "The second debate is being held in Sioux City at 7 pm tonight, tune in and see how I plan to #KeepIowaMoving ! Watch on KTIV, KWWL, or KTTC on your television, or live streamed online at http:// KTIV.com or http:// KWWL.com !", "2018-10-17T22:43:03.000Z": "We're fired up to cheer on @KimReynoldsIA in the debate tonight #KeepIowaMoving", "2018-10-17T22:37:39.000Z": "RT if you want to #KeepIowaMoving !", "2018-10-17T19:43:34.000Z": "I know the value of the dollar, that's why I fought for the biggest tax cut our state has ever seen. Now you can keep more of YOUR hard-earned money!", "2018-10-17T15:38:49.000Z": "Our unemployment rate is the second lowest in the nation! That means more jobs and opportunities for Iowans. But we are just getting started and now is not the time to reverse course!", "2018-10-17T02:14:39.000Z": "From Scott County all the way up to Hawarden, Iowans are fired up about this election and are voting to #KeepIowaMoving !", "2018-10-17T02:01:21.000Z": "Great evening with Scott County GOP at their annual Reagan Dinner! @KimReynoldsIA  @MaryMosiman  @PateforIowa  @jeremyndavis @DrPeters4Iowa", "2018-10-16T23:22:43.000Z": "Packed room of volunteers in Hawarden keeping busy and doing the work for @adamgregg16 and @KimReynoldsIA  #KeepIowaMoving", "2018-10-16T21:51:38.000Z": "With three straight quarters of rising incomes and a record low unemployment rate, Iowa's economy has never been better. Iowa is on the right track, and we are just getting started.", "2018-10-16T20:27:01.000Z": "We need your help to keep Iowa as the #1 State in the nation. If you are wondering how you can help? Join our campaign team today: Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-10-16T19:24:46.000Z": "Before tomorrow's debate, will you stand with our campaign and vote early? Let's Keep Iowa Moving!", "2018-10-16T15:04:59.000Z": "Here's what is at stake in this election... Our budget is balanced and we have a surplus of $127 million! This allows us to keep YOUR taxes low, while still investing in the same priorities like K-12 education and health care. Iowa budget surplus four times bigger than expected 'Our economy is growing, incomes are rising and our state's budget is a reflection of that.' kimt.com", "2018-10-16T01:22:21.000Z": "Massive crowd tonight in Fort Dodge for the Webster County Republicans! Fired up to support @KimReynoldsIA and @IowaGOP candidates up and down the ticket! @ReynoldsGregg", "2018-10-15T21:29:00.000Z": "Iowa is a great state with low living costs and high paying jobs. I need your vote and support to Keep Iowa Moving! Sign up to volunteer today: Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-10-15T18:51:00.000Z": "Get excited, stay engaged, and do me a favor... Grab a friend and go vote early. I need your vote so that we can Keep Iowa Moving! #VoteKIM", "2018-10-15T16:08:20.000Z": "We are putting more money into K-12 education than ever before. Here are the facts:", "2018-10-15T14:47:10.000Z": "Thank you @IAGovernor , @ChuckGrassley , and @SenJoniErnst . Your support made year-round #E15 a reality, fueling our rural economy and giving consumers a choice at the pump. We are proud to have sponsored this ad that ran in the @DMRegister on Sunday 10/14. #FuelYourKnowledge", "2018-10-15T14:15:26.000Z": "I want to thank Sarah Sanders for coming to Iowa to support my campaign, here's what she had to say on Saturday:", "2018-10-14T23:31:42.000Z": "This issue is a priority! We can and will do more, and I look forward to building on that progress. (7/7)", "2018-10-14T23:31:11.000Z": "Mercy will have a new 100-bed psychiatric hospital in the Des Moines metro. https:// kcci.com/article/mercy- unveils-new-psychiatric-clinic/23320929  (6/7) Mercy unveils new psychiatric clinic This morning, Mercy Medical Center unveiled their new psychiatric clinic. kcci.com", "2018-10-14T23:29:08.000Z": "While the state serves an important role in providing mental health care to Iowans, I am proud of the public-private partnerships that exist. Bettendorf is opening a new psychiatric hospital w/ 75 beds for Iowans with the most acute mental health needs. (5/7)", "2018-10-14T23:28:13.000Z": "This spring, I signed a significant mental health care bill that represents a strong step toward improving access. This bill passed the legislature unanimously. I also signed Executive Order 2 to create a Children's Mental Health Board! (4/7)", "2018-10-14T23:27:35.000Z": "We've expanded access to mental health care to 150,000 Iowans and invested $4 million in a new psychiatric medical residency program to help recruit and retain more psychiatrists. (3/7)", "2018-10-14T23:26:47.000Z": "Since 2013, we've made great strides in improving Iowa's mental health care system. We redesigned our system to ensure ALL Iowans have access to the same core services - regardless of where they live. (2/7)", "2018-10-14T23:26:04.000Z": "It was an honor to speak at the @DMRegister 's Mental Health Forum today. Mental health has been and will continue to be at the forefront of my administration. (1/7)", "2018-10-14T17:28:37.000Z": "I want to thank everyone who made my 2nd Annual Harvest Festival an amazing success! Now it's time to stay fired up, stay engaged, and VOTE so we can Keep Iowa Moving!", "2018-10-14T02:37:42.000Z": "Can you believe that!!!! Huge win for @IowaStateU ! #Cyclones", "2018-10-14T02:24:15.000Z": "Wow, what a night! Was proud to MC another great @KimReynoldsIA Harvest Festival! Bigger and better event than last year! Lots of @ReynoldsGregg momentum heading into the final weeks!", "2018-10-14T02:26:39.000Z": "Great to welcome @SarahHuckabee back to Iowa for the @KimReynoldsIA Harvest Festival tonight! @CariGregg  @ReynoldsGregg", "2018-10-14T01:40:55.000Z": "It was great to get out and support @IAGovernor  @KimReynoldsIA and the @ReynoldsGregg ticket! Looking forward to a full 4-years of her continued leadership to #KeepIowaMoving !", "2018-10-14T01:18:24.000Z": "A packed crowd tonight at @KimReynoldsIA 's Harvest Festival alongside special guest @SarahHuckabee . Republicans are ready now more than ever to #KeepIowaMoving in November! #iagov  #iapolitics", "2018-10-14T00:57:50.000Z": "US Senate candidate, IA #KeepIowaMoving ! Iowa is number one in the nation, with record low unemployment, low taxes and comprehensive mental health reform! Kim, thank you! You listen to your constituents and we thank you!", "2018-10-14T00:19:26.000Z": "Thank you Senator @ChuckGrassley for coming to my 2nd Annual Harvest Festival! Iowa and this country can't thank you enough for your leadership! @GrassleyWorks", "2018-10-13T22:52:37.000Z": "Family Fun @KimReynoldsIA Fall Harvest Fundraiser. For those keeping track at home, the balloon animals lasted 10 minutes until they popped on the car ride home! #teardrop", "2018-10-13T21:50:48.000Z": "Things seen at @KimReynoldsIA Harvest Festival:\n-face painting.\n-balloon animals.\n-a cover band playing CCR.\n- @ChuckGrassley .", "2018-10-13T21:03:53.000Z": "Great to be back in Iowa! Looking forward to being with @KimReynoldsIA !", "2018-10-13T16:47:55.000Z": "Welcoming @FriendsforZach back from his 2 week deployment overseas! Thank you for your dedicated service to our country, the state of Iowa, and I am looking forward to you joining the incredible team over at the Iowa State Senate.", "2018-10-13T15:46:00.000Z": "Our unemployment rate is at a historic low! Incomes are rising, our budget is balanced, and we aren't going to stop here. We need to Keep Iowa Moving!", "2018-10-13T15:00:01.000Z": "We need you off the sidelines. Here's how you can volunteer for my campaign today: Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-10-13T13:48:00.000Z": "Early voting has started! I need your vote, your help, and support to Keep Iowa Moving! #VoteKIM", "2018-10-13T13:24:48.000Z": "FACT: We have continued to invest money into K-12 education, because investing in our kids is investing in their future and Iowa's future!", "2018-10-12T21:46:03.000Z": "Iowa farmers feed and fuel the world. They are the backbone of the Iowa economy, and I will always stand in their corner! #NationalFarmersDay", "2018-10-12T21:17:13.000Z": "I need your vote to Keep Iowa Moving! Bring a friend with you today and vote early! https:// reynoldsgregg.com/vote-early/", "2018-10-12T18:58:35.000Z": "Miss Wednesday's debate? Check out this quick recap. \n\nLet's #KeepIowaMoving !", "2018-10-12T16:01:05.000Z": "Here's today's #FactCheckFriday : Iowa's budget is balanced and we have a $127 million surplus. That means we can keep taxes low and you get to keep more of your hard-earned money!", "2018-10-12T15:19:47.000Z": "This crew in Linn County is fired up to support @KimReynoldsIA and the @ReynoldsGregg campaign! Working to Keep Iowa Moving with lower taxes and fiscal responsibility!", "2018-10-11T21:59:00.000Z": "26 days until Election Day! Sign up to volunteer for my campaign so we can Keep Iowa Moving. Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-10-11T21:25:18.000Z": "Fired up from last nights debate? It's time to get out and vote early! Let's Keep Iowa Moving! http:// reynoldsgregg.com/vote", "2018-10-11T18:10:57.000Z": "We have the 2nd lowest unemployment rate in the nation, and I'm just getting started. I need your vote to Keep Iowa Moving!", "2018-10-11T16:05:01.000Z": "During last night's debate, I reiterated my priority of lower taxes to help Iowa families keep more of their hard earned money. I believe you deserve a break! Gov. Kim Reynolds signs largest tax cut in Iowa history thegazette.com", "2018-10-11T02:00:00.000Z": "No contest. @KimReynoldsIA is RIGHT for #Iowa . #1 state in nation second lowest unemployment $127 million state surplus pro-life Future Ready Iowa Vote @ReynoldsGregg  #KeepIowaMoving  #IaPolitics", "2018-10-11T01:51:53.000Z": "Thank you to the @DMRegister and @KCCINews for hosting the first debate. I look forward to having two more opportunities to share with Iowans how I'm going to #KeepIowaMoving !", "2018-10-11T01:39:34.000Z": "#KeepIowaMoving ! Here's my recap from tonight's #iagov Debate!", "2018-10-11T01:37:03.000Z": ". @FredHubbell calls me \"the woman\" in the House. My name is Linda but he can call me Madam Speaker\n\nLike @KimReynoldsIA , @joniernst & @MaryMosiman I'm proud to be part of the trailblazing Republican women making history to Keep Iowa Moving #iagov  #iapolitics  #ialegis", "2018-10-11T00:27:50.000Z": "The definition of female empowerment, poise, and grace is our governor on this debate stage right now #iagov", "2018-10-11T01:24:18.000Z": "I'm so proud of @KimReynoldsIA right now. She was amazing telling Iowa's story. There's no doubt Iowa is moving in the right direction, and she's just getting started! #iagov", "2018-10-11T00:57:44.000Z": "Clear win for @KimReynoldsIA tonight. More personable, better grasp of issues, more passion.", "2018-10-11T00:50:50.000Z": "Fact: @FredHubbell 's failed IJobs program is still costing Iowans. We can't print money Fred!", "2018-10-11T00:46:11.000Z": "The budget is balanced. @FredHubbell just wants to raise taxes. Iowa budget surplus four times bigger than expected 'Our economy is growing, incomes are rising and our state's budget is a reflection of that.' kimt.com", "2018-10-11T00:37:32.000Z": "Tonight's debate marks 141 days since @FredHubbell promised to release his tax returns. He still won't release them. What's he hiding? http:// hubbelltaxreturns.com", "2018-10-11T00:24:06.000Z": "Wow, I can't even keep track of all the lies @FredHubbell has told on Medicaid. #iagov", "2018-10-11T00:27:05.000Z": "Here it is again from @FredHubbell , \"On Day One as governor, I will work to bring Medicaid back under state control.\" Fred Hubbell Promises New Path Forward On Medicaid | Iowa Starting Line Every day brings new heartbreaking stories of Medicaid privatization's failures. Fred Hubbell plans to change that. iowastartingline.com", "2018-10-11T00:25:00.000Z": "Here's @FredHubbell saying he will take it back to the old system: \"I'm going to bring it back under state control.\" Beyond the Podium: Fred Hubbell says his leadership will bring change to Iowa Retired businessman Fred Hubbell believes Iowa is heading in the wrong direction after two years of complete GOP control in Des Moines, vowing to \"put people first again\" if elected to the state's... cbs2iowa.com", "2018-10-11T00:19:43.000Z": "Fact: @FredHubbell was part of the last administration that actually cut K-12 Education!", "2018-10-11T00:15:58.000Z": "#HypocriteHubbell", "2018-10-11T00:10:03.000Z": "Lower Taxes for Iowa Families! #KeepIowaMoving", "2018-10-11T00:08:28.000Z": "#FactCheckFred Historic K-12 Investments. We need to #KeepIowaMoving", "2018-10-11T00:06:14.000Z": "Future Ready Iowa is revolutionary. It will help Iowans find the skills for the good-paying jobs that exist right now! #KeepIowaMoving", "2018-10-11T00:05:03.000Z": "My story is the Iowa story, it's so reflective of the opportunities that exist here! Focused on cutting taxes, growing jobs, wages, and opportunities. #KeepIowaMoving", "2018-10-10T21:51:53.000Z": ". @KimReynoldsIA is the only candidate who will #KeepIowaMoving . Share if you stand with Kim in tonight's debate! #iagov", "2018-10-10T22:41:23.000Z": "#KimCanDoIt  #ReynoldsGregg  #KeepIowaMoving", "2018-10-10T22:45:12.000Z": "#KeepIowaMoving !!!", "2018-10-10T23:59:44.000Z": "Help #KeepIowaMoving tonight, spread the governor's positive vision as well as help the team fact check @FredHubbell go to: http:// factcheckfred.com for everything you need! #iagov", "2018-10-10T23:56:25.000Z": "Handing off the @Twitter to Team @KimReynoldsIA ( @ReynoldsGregg )! Help support the team and help #KeepIowaMoving Quote Tweet Kim Reynolds @KimReynoldsIA WATCH #iagov Debate: Watch live on broadcast: KCCI (Channel 8 in Des Moines)\n\nOr online: \n-KCCI.com and or news app\n-KCCI's Facebook page\n-DesMoinesRegister.com\n-Des Moines Registe's Facebook Page", "2018-10-10T23:55:04.000Z": "WATCH #iagov Debate: Watch live on broadcast: KCCI (Channel 8 in Des Moines)\n\nOr online: \n-KCCI.com and or news app\n-KCCI's Facebook page\n-DesMoinesRegister.com\n-Des Moines Registe's Facebook Page", "2018-10-10T20:25:54.000Z": "Join our team today so we can Keep Iowa Moving! Sign up to volunteer for our campaign below: Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-10-10T14:45:56.000Z": "Tonight's debate will be an opportunity to talk about how Iowa is working! Low unemployment, higher incomes, a balanced budget ... our state is moving forward! Don't forget to tune in!", "2018-10-10T03:45:53.000Z": "Amazing night supporting the @IowaGOP Team and welcoming President @realDonaldTrump back to Iowa! Lower taxes, better trade deals, and year-round E15 will help Keep Iowa Moving!", "2018-10-09T22:15:34.000Z": "Cannot thank our volunteers enough! Please join the team in these last few weeks. Go to http:// reynoldsgregg.com/volunteer Quote Tweet Nick Boeyink @BoeyinkNick Some fired up ladies in the @KimReynoldsIA Davenport office today helping to get absentee ballot requests out! #KeepIowaMoving", "2018-10-09T21:21:01.000Z": "Thank you @IAGovernor for being a champion of American-made #biofuels and #E15YearRound ! Quote Tweet Gov. Kim Reynolds @IAGovernor Today's decision from @POTUS  @realDonaldTrump is a big win for IA. I'm grateful he's following through on promise to allow sale of E15 year round-a decision that will bring greater stability to ag econ. Once again, he's showing his commitment to farmers in IA/rest of country. Show this thread", "2018-10-09T21:38:00.000Z": "Come join me and my family for the 2nd Annual Kim Reynolds Harvest Festival, with special guest Sarah Sanders! It will be a night of family activities for Iowans of all ages! http:// reynoldsgregg.com/harvest-festiv al ", "2018-10-09T21:16:49.000Z": "While rain is interrupting the harvest, I hope Iowa farmers take the time today to get out and vote early or request an absentee ballot. This election is so important and I need your vote to Keep Iowa Moving! Go to http:// reynoldsgregg.com/vote :", "2018-10-09T19:35:00.000Z": "Early voting has started! I need your vote, your help, and support to Keep Iowa Moving! #VoteKIM", "2018-10-09T19:26:58.000Z": "Had the opportunity to address @AgribusinessIA to talk about ag, trade, workforce and the progress we are seeing on these important issues!", "2018-10-09T17:00:01.000Z": "28 days until Election Day! Sign up to volunteer for my campaign so we can Keep Iowa Moving. http:// reynoldsgregg.com/volunteer", "2018-10-09T15:30:51.000Z": "This decision from President @realDonaldTrump is a big win for Iowa. I am grateful to the president for following through on his promise to allow the sale of E15 year round - a decision that will bring greater stability to the ag economy. Trump will make good on a promise to Iowa farmers, open door to year-round E15 \"It's wonderful for the American farmer,\" says an ethanol advocate. desmoinesregister.com", "2018-10-08T21:22:00.000Z": "We know what #works . Let's #KeepIowaMoving . Early voting begins today. Make your vote count. #iapolitics Quote Tweet Kim Reynolds @KimReynoldsIA Check out our new ad: Iowa is Working! \n\nWith your vote, we can keep it that way! Help me Keep Iowa Moving (KIM)!", "2018-10-09T01:16:18.000Z": "Today's decision from @POTUS  @realDonaldTrump is a big win for IA. I'm grateful he's following through on promise to allow sale of E15 year round-a decision that will bring greater stability to ag econ. Once again, he's showing his commitment to farmers in IA/rest of country.", "2018-10-08T20:53:54.000Z": "Today marks the start of early voting. I need your vote, and the support of your friends and family so that we can Keep Iowa Moving! #VoteKIM", "2018-10-08T18:35:06.000Z": "President @realDonaldTrump will be in Iowa tomorrow! Make sure to reserve your ticket here: https:// donaldjtrump.com/rallies/ia-oct -2018/?utm_medium=web&utm_source=djt_web&utm_content=rally_list ", "2018-10-08T17:22:48.000Z": "Early voting begins today! Make sure you're registered and have a plan to vote: http:// iowagop.org/vote  #iapolitics  #KeepIowaMoving", "2018-10-08T16:17:36.000Z": "Check out our new ad: Iowa is Working! \n\nWith your vote, we can keep it that way! Help me Keep Iowa Moving (KIM)!", "2018-10-08T01:39:33.000Z": "Ran into a familiar face at the Republicans of Black Hawk County  GOP Fall Dinner. So proud of Senator @ChuckGrassley .", "2018-10-08T00:48:15.000Z": "Speaking to a packed crowd at the @bhcGOP dinner. Republicans are energized, united, and want to Keep Iowa Moving!", "2018-10-07T21:31:00.000Z": "Join my family and I for the 2nd Annual Kim Reynolds Harvest Festival on October 13th from 4-7pm, along with special guest speaker Sarah Sanders. I hope to see you there, and bring your family! RSVP at http:// reynoldsgregg.com/harvest-festiv al ", "2018-10-07T20:30:00.000Z": "Check out our website! Find out how you can help the campaign: Kim Reynolds - Iowa Governor Governor Kim Reynolds and Lt. Governor Adam Gregg are committed to building a better Iowa. Join the team today! reynoldsgregg.com", "2018-10-07T19:38:35.000Z": "We can shatter this glass ceiling in Iowa and Keep Iowa Moving forward! Kim Reynolds faces the hardest glass ceiling to break: The race to be Iowa's next governor Kim Reynolds is one of only 39 women to serve as a governor in the United States. She's currently running for election against Democrat Fred Hubbell. desmoinesregister.com", "2018-10-06T22:24:00.000Z": "Join my family and I for the 2nd Annual Kim Reynolds Harvest Festival on October 13th from 4-7pm, along with special guest speaker Sarah Sanders. I hope to see you there, and bring your family! RSVP at http:// reynoldsgregg.com/harvest-festiv al ", "2018-10-06T20:23:00.000Z": "Join our team today so we can Keep Iowa Moving! Sign up to volunteer for our campaign below: Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-10-06T16:39:06.000Z": "The @iowafrw and College Republicans are teaming up this Saturday to help elect @KimReynoldsIA ! We want to Keep Iowa Moving! KIM!", "2018-10-06T19:15:35.000Z": "Hitting the pavement today for @KimReynoldsIA and @YoungForIowa in Johnston. We want to Keep Iowa Moving!! #iagov  #IA03", "2018-10-06T18:21:00.000Z": "Our unemployment rate is at a historic low! Incomes are rising, our budget is balanced, and we aren't going to stop here. We need to Keep Iowa Moving!", "2018-10-06T16:18:00.000Z": "As a product of rural Iowa, I want to invest in every single community. That's why I created the Empower Rural Iowa initiative, with the goal of investing, growing, and connecting rural Iowa. Reynolds hears calls for better broadband in rural Iowa HOLSTEIN, Iowa - Initiatives in other states could be instructive in the quest to bring speedy, reliable broadband access to rural parts of Iowa, Gov. Kim Reynolds and Lt. Gov. siouxcityjournal.com", "2018-10-06T13:57:21.000Z": "I won't stop until every Iowan has the access to the good-paying jobs that exist in our state. Through collaboration with employers, educators, and initiatives proposed in the Future Ready Iowa Act, we will make Iowa even better than it is today. Gov. Reynolds tours Arconic, talks filling jobs at Future Ready Iowa Summit After testing the strength of aluminum at Arconic's Davenport Works plant Tuesday afternoon, Gov. Kim Reynolds said more people need to learn about manufacturing and other local jobs waiting to qctimes.com", "2018-10-06T00:23:21.000Z": "Back in Osceola tonight to support the Clarke County GOP and a strong candidate for county attorney, Adam Ramsey! Republicans are fired up to keep our state on track.", "2018-10-05T20:27:31.000Z": ".... @IAGovernor  talks about importance of #iamfg to economy. Thanks Burke for their investment in IA. 200+ increase in jobs. #MFGDay18", "2018-10-05T23:39:00.000Z": "We are 32 days away from the election. And I want to know.. Are you with me? Kim Reynolds faces the hardest glass ceiling to break: The race to be Iowa's next governor Kim Reynolds is one of only 39 women to serve as a governor in the United States. She's currently running for election against Democrat Fred Hubbell. desmoinesregister.com", "2018-10-05T22:33:58.000Z": "I am thrilled Sarah Sanders will be our special guest speaker at my 2nd Annual Harvest Festival on October 13th. Hope to see you there! Here's how you can RSVP: http:// reynoldsgregg.com/harvest-festiv al ", "2018-10-05T17:55:00.000Z": "Our unemployment rate is the second lowest in the nation! The economy has never been better and that means more opportunities for Iowans.", "2018-10-05T16:22:33.000Z": "You deserve to keep more of your paycheck! I'm proud to have implemented the state's biggest tax cut, because hard-working Iowans deserve it.", "2018-10-05T01:12:17.000Z": "Look forward to joining Governor @KimReynoldsIA at her annual Harvest festival next week in Des Moines!", "2018-10-04T21:22:38.000Z": "Join my family and me for the 2nd Annual Kim Reynolds Harvest Festival on October 13th from 4-7pm, along with special guest speaker Sarah Sanders. I hope to see you there, and bring your family! RSVP at http:// reynoldsgregg.com/harvest-festiv al ", "2018-10-04T18:03:04.000Z": "Iowa has a $127 million budget SURPLUS. This is a reflection of fiscal responsibility, rising incomes, and a thriving economy. I need your vote to Keep Iowa Moving!", "2018-10-04T17:29:00.000Z": "This trade deal is huge for Iowa and for our farmers. Free and fair trade allows Iowa farmers to do what they do best, produce! Reynolds and Naig say USMCA trade deal a positive step - Radio Iowa Republican office-holders in Iowa are celebrating this weekend's break-through on a deal that will replace the North American Free Trade Agreement. President Trump calls it the U.S. Mexico Canada... radioiowa.com", "2018-10-04T14:22:37.000Z": "Business has never been better. That means opportunity for Iowans to find a career they love, a good-paying, family supporting job. There's more to do, but I need your help this November to Keep Iowa Moving (KIM)! Business Council survey finds most member optimism ever - Radio Iowa The Iowa Business Council released its latest quarterly economic outlook survey Monday, and executive director Georgia Van Gundy, says the results find a lot of optimism. \"Our member show that this... radioiowa.com", "2018-10-04T13:58:50.000Z": "Thank you Kristin! https:// twitter.com/kristin_hurd/s tatus/1047688179736870913  This Tweet is unavailable.", "2018-10-03T22:44:46.000Z": "Come be a part of our team! Sign up to volunteer for our campaign below. #KIM Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-10-03T19:27:05.000Z": "Great discussion about ways to improve Iowa's workforce at yesterday's @FutureReadyIowa Summit hosted by @SukupMfg Thanks to @IALtGov  @adamgregg16 for attending! I appreciate both him and @IAGovernor  @KimReynoldsIA 's commitment to our workforce! #ialegis  #iagop  @iagov", "2018-10-03T17:33:25.000Z": "I am always going to fight to help you keep more of your paycheck!", "2018-10-03T16:50:30.000Z": "Thank you all so much for having me today!", "2018-10-03T16:50:29.000Z": "Laura Smith - CIO of Unity Point Health", "2018-10-03T16:50:28.000Z": "I am thrilled to point out that four of the five board members are women, setting a great example for young girls across our state!", "2018-10-03T16:50:27.000Z": "Sat down with @TechnologyIowa and @IowaBio in Cedar Rapids to talk about STEM careers and job training programs to help Iowans who are looking for that next opportunity or career right here in Iowa!", "2018-10-03T13:20:32.000Z": "We've really worked to bring businesses, schools, and community colleges together so we can expose our young kids to what the workforce looks like. There are opportunities right here at home. Gov. Reynolds tours Arconic, talks filling jobs at Future Ready Iowa Summit After testing the strength of aluminum at Arconic's Davenport Works plant Tuesday afternoon, Gov. Kim Reynolds said more people need to learn about manufacturing and other local jobs waiting to qctimes.com", "2018-10-02T21:40:25.000Z": "Thanks for having me today. We have incredible opportunities all over our state thanks to companies like @arconic ! Quote Tweet John Riches @jriches1 Great to show Governor @KimReynoldsIA the updated testing lab @arconic Davenport Works today and discuss STEM and @futurereadyiowa to keep job pipeline open and business growing", "2018-10-02T19:38:00.000Z": "Want to Keep Iowa Moving? Join our team! Sign up to volunteer below: Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-10-02T17:16:15.000Z": "Join my family and me for the 2nd Annual Kim Reynolds Harvest Festival on October 13th from 4-7pm, along with special guest speaker Sarah Sanders. I hope to see you there, and bring your family! RSVP at http:// reynoldsgregg.com/harvest-festiv al ", "2018-10-02T14:33:53.000Z": "Our budget is balanced, and the $127 million surplus is proof of a strong economy, fiscal responsibility, and that we are moving in the right direction. But we can't stop now, we have to Keep Iowa Moving forward! Iowa budget surplus four times bigger than expected 'Our economy is growing, incomes are rising and our state's budget is a reflection of that.' kimt.com", "2018-10-01T21:18:11.000Z": "I signed the largest middle-class tax cuts in our state's history because taxpayers who are working hard for their money deserve a break. Like and Retweet if you agree!", "2018-10-01T19:53:37.000Z": "We had quite the group of visitors this morning.  Governor of Iowa @KimReynoldsIA Senator Tim Kraayenbrink and Ann Meyer for State House!", "2018-10-01T19:58:19.000Z": "I am thrilled to announce Sarah Sanders as our special guest speaker at my 2nd Annual Harvest Festival. Hope to see you there! \n\nHere's how you can RSVP: http:// reynoldsgregg.com/harvest-festiv al ", "2018-10-01T14:27:56.000Z": "Appreciate @IAGovernor coming to Fort Dodge to kick off the @futurereadyiowa Regional Summit. Shout out to @IowaCentral for hosting. @DanKinney10  @FDCSD  #thisisfortdodge", "2018-10-01T16:52:22.000Z": "Starting off my week by touring @mistyharborboat in Fort Dodge! This small business manufactures pontoons, employing around 175 Iowans. We are glad to have companies like this choosing to do business in Iowa, one of the reasons our economy is thriving and Iowans are working!", "2018-10-01T14:10:08.000Z": "Personal income growth in Iowa is 5.1%, tied for 6th highest in the nation! With growing paychecks and a historically low unemployment rate, Iowans are seeing results. With your vote, we can build on this success and Keep Iowa Moving! https:// bea.gov/news/2018/stat e-quarterly-personal-income-2nd-quarter-2018 ", "2018-09-30T18:25:21.000Z": "The 2nd Annual Kim Reynolds Harvest Festival will be held this year on Saturday, October 13th. Come join in on the fun and bring the whole family as we celebrate this important season in Iowa!\n\nFind additional details and get tickets by going to Harvest Festival Harvest Festival - Saturday, September 21, 2019 reynoldsgregg.com", "2018-09-30T17:29:49.000Z": "What we're doing is working! Our economy is expanding and that means more opportunities for Iowans. Waldinger Corp. to add 115 Des Moines jobs with $21 million facility The mechanical, electrical and sheet metal contractor will purchase 28 acres of vacant land on the city's far southwest side. desmoinesregister.com", "2018-09-29T18:08:01.000Z": "Speaking at the @LinnCountyGOPIA Picnic about how important it is that we get out and vote to Keep Iowa Moving!", "2018-09-29T17:15:54.000Z": "Pretty good week for Iowans: The unemployment rate dropped again to 2.5% Quarterly personal income growth was 6th in the US The state's surplus ended 4 times higher than expected\n\nThere's only one direction that we need to go. Let's #KeepIowaMoving with @KimReynoldsIA !", "2018-09-29T17:22:16.000Z": "Busy day in Marion out knocking on doors and putting up signs! Happy to be out supporting strong leaders like Rep. @hinsonashley .", "2018-09-29T15:26:48.000Z": "Making our way through the Swamp Fox Parade in Marion! Thank you to everyone who came out.", "2018-09-29T14:42:42.000Z": "Getting ready for the Swamp Fox Parade in Marion! Strong Republican Team up and down the ticket.", "2018-09-29T12:19:47.000Z": "Amazing concert last night! No better example for young women across our state than @MaddiePoppe ! Work hard, dream big, because anything is possible.", "2018-09-28T20:55:00.000Z": "We are investing in our schools! With $765 million in new money put into Iowa's education since 2011, only 3 other states are investing in a higher rate. K-12 education will always be a top priority.", "2018-09-28T17:37:00.000Z": "Join our team and help us Keep Iowa Moving! Sign up to volunteer on the campaign below: Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-09-28T15:35:14.000Z": "Our budget is balanced. Incomes are rising, our economy is growing, and our budget surplus is FOUR TIMES higher than expected! Let's keep Iowa moving!", "2018-09-27T20:08:08.000Z": "Want to be the first to know who the mystery special guest is at our 2nd Annual Harvest Festival? Text \"harvest\" to 515-305-2748 to sign up for the EXCLUSIVE ANNOUNCEMENT!", "2018-09-27T18:48:00.000Z": "On any given day in Iowa there are over 62,000 jobs ready to be filled. These are good paying jobs like a Sales Account Executive in Sheldon, a CNA in Centerville, or a Welder in Osceola. \n\nExplore the opportunities in our state! https:// www1.iowajobs.org/jobs/login.seek", "2018-09-27T00:42:36.000Z": "Already the #beststate , but we are just getting started! Thanks for coming @KimReynoldsIA .", "2018-09-26T22:45:00.000Z": "Iowa is being recognized nationally for what we've always known, we're the #1 state. Get the facts, and let's Keep Iowa Moving (KIM) in November. https:// reynoldsgregg.com/why-iowa-is-1/", "2018-09-26T20:42:01.000Z": "On any given day in Iowa there are over 62,000 jobs ready to be filled. These are good paying jobs like a Sales Account Executive in Sheldon, a CNA in Centerville, or a Welder in Osceola. \n\nExplore the opportunities in our state! https:// www1.iowajobs.org/jobs/login.seek  #WorkforceWednesday", "2018-09-26T20:31:11.000Z": "Want to be the first to know who the mystery special guest is at Governor Reynolds' 2nd Annual Harvest Festival? Text \"harvest\" to 515-305-2748 to sign up for the EXCLUSIVE ANNOUNCEMENT!", "2018-09-26T18:42:06.000Z": "Iowa no longer has an all male Supreme Court! I was honored to appoint Judge Suzy Christensen to our state's Supreme Court. She has always upheld Iowa's constitution and will continue to adhere by the rule of law. Susan Christensen sworn in as Iowa's newest Supreme Court justice Gov. Kim Reynolds appointed Christensen, of Harlan, to the seven-member court in August. desmoinesregister.com", "2018-09-26T16:21:58.000Z": "Toured Osmundson Manufacturing today, a company that has been doing business in Iowa for 115 years! 5th generation family-owned companies like this are what makes Iowa the #1 state in the nation!", "2018-09-26T12:56:32.000Z": "Got my first welding lesson yesterday in Burlington. There's real opportunities in every corner of Iowa and the @futurereadyiowa Act will help Iowans young and old find a good-paying career right here at home. Gov. Kim Reynolds gets welding lesson at Burlington manufacturer She toured Flint Cliffs Manufacturing while in town for a Future Ready Iowa summit. thehawkeye.com", "2018-09-26T00:35:48.000Z": "Our end of the year fiscal budget will have an extra $127 million, FOUR TIMES bigger than expected. This is a reflection of our growing economy, rising personal incomes and fiscal responsibility. But we aren't done. We need to Keep Iowa Moving! Iowa budget surplus four times bigger than expected 'Our economy is growing, incomes are rising and our state's budget is a reflection of that.' kimt.com", "2018-09-25T23:20:30.000Z": "Personal income growth in Iowa is 5.1%, tied for 6th highest in the nation! With growing paychecks and a historically low unemployment rate, Iowans are seeing results. We must build on this success and Keep Iowa Moving! Quote Tweet BEA News @BEA_News Where does your state rank in personal income growth? Read our blog for\nthe latest second-quarter results. https:// go.usa.gov/xPjdM", "2018-09-25T21:00:00.000Z": "With $765 million in new money invested into K12 education since 2011, there are only 3 other states in the country investing in education at a faster rate than Iowa. We are making education a priority.", "2018-09-25T20:00:01.000Z": "Our unemployment rate has gone down EVEN LOWER to 2.5%! With lower taxes and innovative training programs, we are going to Keep Iowa Moving.", "2018-09-25T17:43:31.000Z": "Stopped at Flint Cliffs Manufacturing in Burlington for a tour and a lesson in welding. Great opportunities exist in manufacturing companies all across Iowa! They help keep this economy moving!", "2018-09-25T02:19:08.000Z": "Dubuque was fired up tonight to #KeepIowaMoving ! A vote for Republicans is a vote for lower taxes, higher paychecks, and reforms that will keep our state #1 in the country! #iapolitics  #iagov", "2018-09-24T22:50:00.000Z": "We need you off the sidelines. Here's how you can volunteer for my campaign today: http:// reynoldsgregg.com/volunteer", "2018-09-24T19:28:55.000Z": "Check out how Iowa is stacking up to the rest of the country. HINT: we're pretty proud of our state and we need to keep it that way! Get the facts here --> https:// reynoldsgregg.com/why-iowa-is-1/", "2018-09-22T23:12:21.000Z": "Thank you @IAGovernor Kim Reynolds for spending your day with @Winnebago ! #winnebago  #Iowa", "2018-09-24T15:08:36.000Z": "The 2nd Annual Kim Reynolds Harvest Festival will be held this year on Saturday, October 13th. Come join in on the fun and bring the whole family as we celebrate this important season in Iowa!\n\nFind additional details and get tickets by going to Harvest Festival Harvest Festival - Saturday, September 21, 2019 reynoldsgregg.com", "2018-09-23T21:00:00.000Z": "Join our team so we can Keep Iowa Moving! You can sign up to volunteer below: Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-09-23T20:59:00.000Z": "To invest in the future of Iowa, we must continue to invest in our kids and our schools. Reading proficiency among K-3 students increasing - Radio Iowa Officials say reading test scores among Iowa students in the early elementary grades are rising. The reading proficiency of students in kindergarten through third grade went up nearly a percentage... radioiowa.com", "2018-09-23T17:54:00.000Z": "More jobs coming to Iowa! Hormel Foods adding 210 jobs, nearly doubling size of its Iowa plant The Iowa Economic Development Authority board awarded $10.5 million in incentives toward the expansion project. desmoinesregister.com", "2018-09-23T02:00:33.000Z": "Check out this crowd!!! What an amazing evening celebrating values with the Iowa @FaithandFreedom Coalition! A room packed full of conservatives who understand that we can never stop fighting for our beliefs.", "2018-09-22T14:42:27.000Z": "Happy to have hosted @IAGovernor  @KimReynoldsIA for some Friday night football. We discussed important issues such as concessions stand food, STEM & @futurereadyiowa Thanks for visiting.", "2018-09-22T23:33:24.000Z": "Big showing at the @FaithandFreedom banquet and even bigger support for @KimReynoldsIA ! #ReynoldsGregg The following media includes potentially sensitive content. Change settings View", "2018-09-22T21:12:31.000Z": "I was so proud to join with these strong women leaders at the Iowa Federation of Republican Women Fall Conference! Together we can Keep Iowa Moving!", "2018-09-22T18:50:00.000Z": "Want to Keep Iowa Moving? Join our team! Sign up to volunteer below: Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-09-22T16:30:09.000Z": "Iowa's unemployment is at a historic low! We need to continue this momentum, not reverse it. Let's Keep Iowa Moving! Iowa unemployment rate second-lowest in the nation Iowa's unemployment rate dropped from July to August, and is now behind only one state nationally. siouxlandproud.com", "2018-09-22T15:56:45.000Z": "Getting the morning started right at BecMar Diner! This new small business was packed with Iowans who want to keep our state MOVING forward!", "2018-09-22T15:31:53.000Z": "Visited the @theartofed in Osage. This husband and wife team are creating life long learning opportunities for teachers across Iowa and the United States.", "2018-09-22T13:04:52.000Z": "No better way to start the day then some coffee from @CabinCoffee ! Highly recommend the Pumpkin Spice Palomino.", "2018-09-22T03:03:22.000Z": "With the fall season brings two very important things to our state: harvest and Friday night football! So glad that tonight I got to catch the Mason City vs. Waukee game! #iahsfb", "2018-09-22T01:53:05.000Z": "Kevin and I are new fans of the @RibCrib in Mason City! The ribs were delicious!", "2018-09-22T00:23:00.000Z": "Congratulations to Wendy Wintersteen on becoming the first woman president of @IowaStateU . It was an honor to have the opportunity to attend the ceremony. Iowa State is in good hands under your leadership! Iowa State University's first woman president installed in ceremony on Ames campus - Radio Iowa A ceremony in Ames today formally installed the first woman to hold the top leadership position at Iowa State University. Wendy Wintersteen was already the dean of the I.S.U. College of Agriculture... radioiowa.com", "2018-09-21T22:07:53.000Z": "Judge Suzy Christensen has officially been sworn in as Iowa's newest Supreme Court Justice. She will uphold Iowa's constitution and strongly adhere to the rule of the law. Congratulations Judge Christensen! Quote Tweet Stephen Gruber-Miller @sgrubermiller Justice Susan Christensen was just sworn in as Iowa's newest Supreme Court justice. Here she is hugging Gov. ... @KimReynoldsIA  after the ceremony.", "2018-09-21T19:11:29.000Z": "For the past two months, Iowa has the second lowest unemployment rate! This is great news for the great state of Iowa! Thank you, @IAGovernor for your leadership!", "2018-09-21T14:51:46.000Z": "Iowa's unemployment rate falls even LOWER to 2.5%. It's the 2nd lowest in the country. This election, I need your vote to Keep Iowa Moving!", "2018-09-21T03:48:53.000Z": "At Senator Rick Bertrand's fundraiser in Sioux City. Iowans need him in the legislature to continue delivering results for communities, like pushing for the completion of the 4-lane on Highway 20, a project 60 years in the making.", "2018-09-21T01:50:38.000Z": "Met with my good friends @joniernst & @MaryMosiman at the Chamber of Commerce's Annual Dinner in Sioux City. I also saw the keynote speaker @ErikWeihenmayer , the first blind person to reach the summit of Mt Everest. What an inspiration, thanks for sharing your message with Iowa!", "2018-09-20T21:22:49.000Z": "Follow this guy . He's hitting the road with a truckload of @KimReynoldsIA swag. Coming to a county near you! The following media includes potentially sensitive content. Change settings View", "2018-09-20T17:12:15.000Z": "Our economy is going , taxes are going , and Iowa is #1! Let's Keep Iowa Moving KIM!", "2018-09-20T14:41:02.000Z": "Great seeing you Pete! #HockeyHistory Quote Tweet Pete Jeffries @petejeffries Great seeing #IAGov  @KimReynoldsIA at #TheWell last nite as Iowa's Capitol City made #HockeyHistory by hosting its first-ever @NHL game! And, #DSMUSA packed the house with nearly 14,300 fans in attendance. Final: @StLouisBlues 3, @MNWild 2. #MNWild  #StLBlues", "2018-09-20T01:29:59.000Z": "Thanks to ... @KimReynoldsIA  for joining us ... @MercyDesMoines  for the opening of our Psychiatry Residency Program.  What an great day for Iowa and for a future with more access to behavioral health services for our loved ones.", "2018-09-19T18:05:57.000Z": "Join our team so we can Keep Iowa Moving! Sign up below: Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-09-19T16:12:37.000Z": "The Obama-era Waters of the US (WOTUS) Rule was federal overreach that placed unnecessary burdens on Iowa farmers. We will continue fighting to permanently end the WOTUS Rule. Iowa gets injunction to halt federal water rules A federal judge on Tuesday said Iowa may join states that have an injunction halting implementation of the 2015 Waters of the United States rule. thegazette.com", "2018-09-19T14:43:09.000Z": "Spread the word and help honor Celia by wearing yellow to Saturday's @IowaStateU football game Quote Tweet Kyle Kempt @KyleKempt My prayers go out Celia's friends, family, and everyone affected by this terrible tragedy. If you are attending the game this Saturday, please wear yellow to honor Celia at the request of her teammates.", "2018-09-19T00:05:53.000Z": "If we want to invest in the future of Iowa, we first need to invest in Iowa's schools. That's why I am proud of our historic investments into K-12 education!", "2018-09-18T20:23:15.000Z": "We need your help to keep Iowa the #1 state in the country. Sign up today: Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-09-18T15:35:57.000Z": "Another horrific, senseless death. My heart goes out to the family of Celia Barquin Arozamena - as well as the entire @IowaStateU family - as they grieve this loss. #iagov  https:// twitter.com/CycloneWGOLF/s tatus/1041893840360271873  This Tweet is unavailable.", "2018-09-18T17:13:00.000Z": "Iowa incomes are growing, while our state's poverty rate is falling. We have more to do, but I need your support to Keep Iowa Moving! Iowa incomes up, according to census data Incomes crept upward in Iowa and the Quad-Cities last year, while poverty fell, according to new government figures that reinforce a picture of an economy that's improving. wcfcourier.com", "2018-09-17T22:00:00.000Z": "The campaign trail is always better with family! My grandpa and his brother loved seeing Governor @KimReynoldsIA in Waterloo today.", "2018-09-17T22:18:10.000Z": "Here is how we made Iowa an even better place to live: Cut Taxes for Working Families Historic K-12 Investments into K-12 Education Comprehensive Mental Health Reform\n\nWith your support, we can Keep Iowa Moving!", "2018-09-17T20:10:24.000Z": "Join our team and help us Keep Iowa Moving. Sign up to volunteer on the campaign! Volunteer We want you to be a part of the Iowa story and would love to have you on our team. Join us today! reynoldsgregg.com", "2018-09-17T19:27:25.000Z": "I am in Waterloo with @waltrogersforIA , Chairman of the House Education committee. He's been a partner in helping our young people get a quality education right here in Iowa!", "2018-09-17T15:47:28.000Z": "Wishing a very happy birthday to my good friend, Senator @ChuckGrassley ! I hope you enjoy a @DairyQueen Blizzard to celebrate!", "2018-09-17T14:20:57.000Z": "Iowa's unemployment rate is at 2.6%, one of the lowest our state has ever seen. Iowa is seeing growth, our economy is heading in the right direction, but we can't stop here! Let's Keep Iowa Moving!", "2018-09-16T20:23:03.000Z": "I'm proud to fill up with E15 today and support our Iowa farmers who feed & fuel the world. The summertime ban on E15 ends today. Anxiously awaiting EPA approval to sell E15 year-round.", "2018-09-16T16:12:56.000Z": "Iowa's economy is heading in the right direction. But we need to build on this progress, not reverse it. Iowa incomes up, according to census data Incomes crept upward in Iowa and the Quad-Cities last year, while poverty fell, according to new government figures that reinforce a picture of an economy that's improving. wcfcourier.com"}