{"2019-12-09T21:44:45.000Z": "In 2015, we began ushering in a new era of professionalism and responsibility, and there are not enough minutes in this video or room in this post to fully pay tribute to the transformative and constructive change Kentucky has experienced the past four years...", "2019-12-09T21:45:44.000Z": "Thank you, from the bottom of my heart. \n\nKentucky is truly the most spectacular state in America...our best days are still ahead, because #WeAreKY .\n\n- Matt Bevin", "2019-12-09T21:45:37.000Z": "We have set the standard for the nation on how good government should operate - in everything from shattering economic records to reforming foster care and adoption - and I am sincerely grateful for the opportunity I have had to serve our Commonwealth.", "2019-12-09T20:33:32.000Z": "Proud of this administration's unwavering commitment to protecting the sanctity of life, and grateful that today's #SCOTUS ruling has allowed HB 2 to take effect in Kentucky > > > https:// bit.ly/2P3w8n6  #ProLife  #WeAreKY", "2019-12-09T19:30:08.000Z": "The POW/MIA Missing Man Chair Memorial will serve as a permanent reminder of the men, women and families who have scarificed so much to secure the blessings of liberty for future generations... #WeAreKY", "2019-12-09T18:10:36.000Z": "Live now on Facebook for the MIA/POW Missing Man Chair Dedication Ceremony > > > http:// facebook.com/govmattbevin", "2019-12-08T21:29:24.000Z": "So grateful for all the incredible progress Kentucky has made over the last four years... #WeAreKY", "2019-12-08T00:07:14.000Z": "Bringing in Kentucky's Christmas season with the Annual Frankfort Christmas Parade... #WeAreKY", "2019-12-07T16:21:13.000Z": "Read more about pension spiking in, \"Future Shock: Kentucky Politicians' Opulent Pensions Have Become a Modern-Day Gold Rush,\" > > > http:// freedomkentucky.org/images/9/9d/Fu tureShockGoldRush.pdf?fbclid=IwAR0T8fHk_uN0erEcDx1mBYUIpIFk23v6JTtS7B2eDX-dudq51MPus4_bFOw ", "2019-12-07T16:20:05.000Z": "#ICYMI : @RockyforKY & @DorseyRidley voted against fully funding teacher's pensions while voting for the \"greed bill\" to enrich their own pension.\n\nNow, they could make millions on the backs of Kentuckians as part of @AndyBeshearKY 's admin.\n\nRead more here: http:// bit.ly/EndPensionSpik ing ", "2019-12-06T17:17:23.000Z": "Join us this afternoon via Facebook LIVE at approx. 1:20 pm EST for our annual Christmas tour of the Kentucky Governor's Mansion... #WeAreKY", "2019-12-05T21:37:38.000Z": "It is outrageous for elected officials to receive millions of dollars in retirement that they did not earn. > > > http:// bit.ly/EndPensionSpik ing ", "2019-12-05T19:26:08.000Z": "Jobs, new business investment, unemployment and workforce participation rates...\n\n2019 has been another record-breaking year for Kentucky! #WeAreKY Regional Report: Kentucky Continues to Break Records in 2019 - Area Development Low business costs are drawing businesses to Kentucky, as the state also tries to equalize opportunity in its rural areas through Opportunity Zone incentives. areadevelopment.com", "2019-12-04T22:48:19.000Z": "What an incredible, transformative year for the Commonwealth...\n\nCheck out our 2019 highlight video below! #WeAreKY 2019: A Year in Review Gov. Bevin shares a highlight of 2019. youtube.com", "2019-12-04T22:07:38.000Z": "On now with @terrymeiners on @840WHAS ...Join us! NewsRadio 840 WHAS - Kentuckiana's News, Weather & Traffic Station Louisville's News Radio 840 WHAS. whas.iheart.com", "2019-12-04T14:18:43.000Z": "Joining @GregDunker on WKYX...Tune in : http:// v6.player.abacast.net/1046", "2019-12-04T14:06:03.000Z": "Live now with Alan Watts on @WKDZ ...Join us! WKDZ Radio 106.5 FM wkdzradio.com", "2019-12-04T13:39:57.000Z": "COMING UP: Joining @LelandShow on @NewsRadioWLAP at 8:45 am > > > NewsRadio 630 WLAP - Lexington's News Talk Radio Lexington's News Talk Radio wlap.iheart.com", "2019-12-04T13:19:19.000Z": "Live now with Chad Young on @Talk104 ...\nJoin us! https:// radio.securenetsystems.net/cwa/index.cfm? stationCallSign=WKCT ", "2019-12-04T12:45:57.000Z": "COMING UP: Will be live with Brian Thomas on @55KRC at approx. 8:05 > > >", "2019-12-04T12:35:54.000Z": "On with Larry Smith and WVLC FM (Campbellsville)...Join us! WVLC-99.9 FM WVLC-99.9 FM wvlc.com", "2019-12-04T12:06:21.000Z": "Live now with @TomRoten on @800_WVHU ...join us! NewsRadio 800 WVHU - Huntington's Home for News Your home for the Tom Roten Morning Show, local news, and weather, NewsRadio 800 WVHU! Catch all your favorites in one place, including Glenn Beck, Rush Limbaugh and Sean Hannity!", "2019-12-03T20:30:50.000Z": "It's #GivingTuesday ! Find out how you can join the movement at http:// givingtuesday.org ... #WeAreKY", "2019-12-02T16:49:37.000Z": "Congratulations to the newest National Honor Society inductees from @TFCARoyals ! #WeAreKY", "2019-12-01T21:29:55.000Z": "Within days of launching @USPS ' Operation Santa website, every single letter was adopted, and they asked for more deserving children to send Santa a letter! \n\nLet's do what we can to continue that momentum & help someone's Christmas dreams come true > > > Help Santa Deliver Cheer This Year! Santa receives more letters than he can answer. You can help! Adopt a letter today and fulfill someone's holiday wish with USPS Operation Santa®. uspsoperationsanta.com", "2019-11-30T20:17:40.000Z": "Getting  ready to present the Governor's Cup to the ... @UKFootball  team as the prevailed handily against the ... @UofLFootball  team on a cold and rainy day in Lexington...", "2019-11-30T18:45:47.000Z": "LIKE and RT if you're thankful for Kentucky's small businesses and the pivotal role they play in our communities...\n\nWhat small businesses are you supporting today? #WeAreKY  #ShopSmall", "2019-11-29T21:19:20.000Z": "YOU'RE INVITED: \n\nHelp us kick off Kentucky's Christmas season at the Capitol on Dec. 7! \n\nThe parade will begin at 6 pm EST, followed by the Christmas tree lighting at approximately 7 pm and cookies at the Governor's Mansion...\n\nHope to see you there! #WeAreKY", "2019-11-28T13:58:40.000Z": "So much to be thankful for...\n\nHappy Thanksgiving, Kentucky. #WeAreKY", "2019-11-27T20:00:48.000Z": "\"Give thanks to the Lord, for He is good.\"\n\nWe have so much to be grateful for as we approach Thanksgiving Day #WeAreKY", "2019-11-26T22:01:32.000Z": "Since Dec. 2015, Kentucky has seen:\n- More than 57,000 new jobs\n- More than $22 billion in new business investment\n- More than 1,000 new foster families\n- More than 25% of over-burdensome red tape regulations cut or ammended\n- 10 #ProLife bills signed into law", "2019-11-26T22:01:12.000Z": "Thankful for an administration that has demonstrated the last four years that good government creates great opportunities... #WeAreKY", "2019-11-25T22:16:48.000Z": "Honored to present Jeffrey Denny with the Law Enforcement Purple Heart today...\n\nGrateful for men and women like Jeffrey who live their lives in service of others and make us proud to say #WeAreKY ...", "2019-11-24T23:42:00.000Z": "#ICYMI : Farmers are a vital part of Kentucky's economy, and this new KSFTC program will help ensure our state benefits from its bountiful supply of agricultural land to the fullest extent possible > > > https:// lanereport.com/119346/2019/11 /kentucky-launches-selling-farmers-tax-credit-program-to-sustain-agricultural-industry/ ", "2019-11-24T21:16:04.000Z": "Congratulations to the National @4H Livestock Judging Champions, Chevy, Kasey, Lydia and Will! \n\nIncredible work over the past few years to get to this level... #WeAreKY", "2019-11-23T19:12:33.000Z": "Adoption is SO worth it! \n\nLearn more about how your family can foster, adopt, or support other families at http:// adopt.ky.gov . #NationalAdoptionDay  #WeAreKY", "2019-11-22T19:43:03.000Z": "What would Bluegrass...and country music...be without the legacy of Bill Monroe? \n\nCheck out this video from Ohio County's newly-opened Bill Monroe Museum to learn more about this Kentucky legend and the Father of Bluegrass... #WeAreKY Bill Monroe Museum Gov. Bevin highlights the Bill Monroe Museum in Ohio County, Kentucky. youtube.com", "2019-11-21T22:46:52.000Z": "In Kentucky,  we're helping students chart their own paths to success, whether they want to pursue a traditional 4-yr. college degree or a career in advanced mfg./ other highly-skilled industry. \n\nDemand for high-skilled jobs will only continue to grow! Gen Z Is the Answer to the Skills Gap- They Just Don't Know It Yet Having witnessed the student-loan crisis, this generation may be more open to educational paths other than four-year college. industryweek.com", "2019-11-21T20:32:18.000Z": "#DYK : The @KYStateParks have hosted a Thanksgiving buffet for more than 40 years, each year serving approximately 10,000 guests. #WeAreKY Kentucky State Parks serving Thanksgiving Day buffet - ABC 36 News The annual Kentucky State Resort Parks Thanksgiving Day buffet will be held on Thanksgiving Day. wtvq.com", "2019-11-21T00:20:25.000Z": "Learn more about our registered apprenticeship program, here: https:// bit.ly/33IRU4t", "2019-11-21T00:20:01.000Z": "Apprenticeship programs are essential to equipping the workforce of the future...\n\nAnd Kentucky is already leading the way. The best way to help companies find workers with the right skills? Apprenticeships, a new report... Accenture surveyed 1,000 community college students and 400 community college counselors. Nearly 60% of students said they want to pursue in-demand tech professions, but 80% said they will need... cnbc.com", "2019-11-20T20:42:27.000Z": "Considering adoption? It's SO worth it. \n\nMeet children currently eligible for adoption, here: https:// bit.ly/2QEz9vd  #AdoptKY", "2019-11-19T21:06:35.000Z": "Enjoyed celebrating outstanding foster and adoptive parents this past weekend\n\nThankful for their passion for making Kentucky's foster care and adoption system the gold standard in America. #WeAreKY  #AdoptKY", "2019-11-19T12:40:30.000Z": "Sun rising in the promised land...\n\nAnother great day to be an American  #WeAreKY", "2019-11-18T22:16:07.000Z": "Learn more about how our administration is helping transform Kentucky's workforce, here: https:// educationcabinet.ky.gov/Initiatives/Pa ges/default.aspx ", "2019-11-18T22:15:44.000Z": "We must, in the 21st century, make sure we equip Kentuckians with the training they need to work the jobs that exist.\n\nA well-trained, highly-skilled workforce is essential and attracts incredible opportunities to communities across the Commonwealth. #WeAreKY", "2019-11-18T19:00:13.000Z": "Calling all aspiring student entrepreneurs: the deadline to apply for this year's @kentuckygse is January 20, 2020Visit http:// KentuckyGSE.com/apply TODAY! #WeAreKy", "2019-11-17T20:31:46.000Z": "#ICYMI : Since 2015, we've seen adoptions in Kentucky increase by nearly 40%, and we are gaining momentum...\n\nWant to join the movement? Visit http:// adopt.ky.gov today to view currently waiting children! #WeAreKY  #AdoptKY", "2019-11-16T21:15:30.000Z": "Incredibly grateful for the foster and adoptive parents who are providing loving homes for children across the Commonwealth... #WeAreKY", "2019-11-16T14:17:14.000Z": "A beautiful, crisp November morning here in Kentucky...\n\nThe mighty Ohio River is one of America's greatest economic corridors...\n\nSo much upside potential!", "2019-11-16T13:46:27.000Z": "Will be live on @foxandfriends at approx.\n 9:15 am EST...Join us!", "2019-11-15T14:43:52.000Z": "Excited to welcome PPI to Kentucky and wish them many years of success here in the commonwealth...\n\nWe are grateful for PPI's creation of 100-plus new jobs, and we congratulate Mason County on this outstanding addition to their community. > > > https:// bit.ly/33SZIkq  #WeAreKY", "2019-11-14T17:04:40.000Z": "The hearts of Kentuckians are broken today for the students, teachers, staff & families of those at Saugus High School in Santa Clarita, California...For those who know the power of prayer, please pray for peace that is beyond our ability to understand Two dead in LA-area high school attack; it was suspect's birthday, officials confirm Two people were killed and three others were wounded at Saugus High School in yesterday's attack. Officials confirm it was the suspect's birthday. apple.news", "2019-11-14T00:58:13.000Z": "We must create a level playing field between the USA and our North American neighborsAmerican families are depending on it. \n\nIt is time to ratify the #USMCA grateful for @POTUS ' leadership as he works with Congress to modernize NAFTA. #USMCANow", "2019-11-13T18:57:07.000Z": "#ICYMI : GREAT news for Perry County as Dajcor Aluminum announces 265 full-time jobs at its first U.S.-based location...\n\nNo better place in USA to engineer and manufacture great products than Kentucky, and we are grateful to Dajcor for this significant investment. #WeAreKY", "2019-11-13T00:30:36.000Z": "Learn more about how to register an apprenticeship for your company, here: https:// bit.ly/33IRU4t", "2019-11-12T19:24:59.000Z": "Apprenticeships are a POWERFUL tool for training and developing highly skilled workers\n\nKentucky has nearly 4,000 registered apprentices, and we have allotted $1.5 million in federal funding to grow apprenticeship opportunities. #NationalApprenticeshipWeek", "2019-11-11T17:12:30.000Z": "Today we honor millions of our fellow citizens who have served the United States of America in uniform...\n\nThank you for defending the values of this nation.\n\nHappy #VeteransDay , Kentucky. #WeAreKY", "2019-11-10T21:14:06.000Z": "America is the land of the free because of the brave...\n\nThis weekend, we honor those who have worn our nation's uniform and remember those who paid the ultimate sacrifice to secure our freedom. #WeAreKY", "2019-11-09T18:34:01.000Z": "#ICYMI : @KYTC just finished its 100th bridge restoration as part of \"Bridging Kentucky,\" which will restore 1,000 Kentucky bridges over the next six years. Kentucky Transportation Cabinet finishes 100th bridge restoration project - Transportation Today The Kentucky Transportation Cabinet (KYTC) announced this week the completion of its 100th bridge restoration project as part of the six-year Bridging Kentucky Program. Number 100 is a three-span... transportationtodaynews.com", "2019-11-09T12:08:58.000Z": "A beautiful day dawning in the land of the free...  #WeAreKY", "2019-11-08T19:33:18.000Z": "Adoption is SO worth it!  \n\nVisit https:// bit.ly/2Cs9td2 to view children in Kentucky who are ready to be adopted! #NationalAdoptionMonth  #WeAreKY", "2019-11-07T23:54:51.000Z": "The Appalachian Opportunity Zone Initiative offers a pointed strategy to encourage investment in areas of the commonwealth that need it most > > > https:// lanereport.com/118836/2019/11 /kentucky-awarded-1-2m-grant-for-appalachian-opportunity-zone-initiative/ ", "2019-11-07T20:39:40.000Z": "A huge thank you to Rabbi Shlomo Litvin and @uofl for going above and beyond to share love and compassion with a young lady in the state's foster care system. #NationalAdoptionMonth Meet McKayla Rabbi Shlomo Litvin and the University of Louisville surprise foster youth and longtime Louisville fan, McKayla. youtube.com", "2019-11-07T00:32:44.000Z": "Current/former members of the nation's armed forces can receive lodging discounts at Kentucky State Parks with the \"USA Military Discount\" program until March 31, 2020 > > > https:// bereaonline.com/2019/11/kentuc ky-state-parks-offering-discounts-to-current-military-retirees-veterans/ ", "2019-11-06T18:07:01.000Z": "Great news for Madison County! Hyster-Yale has been a strong economic partner in Madison County, and we are excited to see the company build upon its impressive track record of success... Hyster-Yale breaks ground on $25.7 million expansion - ABC 36 News The plant shipped over 100,000 forklifts worldwide in 2018. wtvq.com", "2019-11-05T22:38:10.000Z": "VOTE\n\nBecause some can't...\n\nWe should!\n\nSome gave all to ensure that  we have the right to choose our leaders... \n\nPolls close at 6:00 today!\n\nVOTE", "2019-11-05T22:20:00.000Z": "#ICYMI : Kentucky will always UNAPOLOGETICALLY defend human life, no matter the fight the @ACLU , #PlannedParenthood or other organizations bring. Why? Because we stand on the side of right, and we stand on the side of life. #PromisesMadeAndKept", "2019-11-05T22:00:00.000Z": "Signed 10 #ProLife Bill Into Law > > > #PromisesMadeAndKept", "2019-11-05T21:47:26.000Z": "Polls close at 6:00pm...\n\nPlease exercise your greatest privilege as an American...\n\nVOTE", "2019-11-05T21:42:37.000Z": "KENTUCKY: \n\nStill time to VOTE...\n\nRegistered voters still have 80 minutes in the Eastern Time Zone\n\n140 minutes in the Central Time Zone\n\nGet to the polls and let your voice be heard!\n\nVote your values, not your party and the future will be bright indeed! #WeAreKY", "2019-11-05T21:30:00.000Z": "#ICYMI : \n\n(Record) BREAKING NEWS: Jobs Keep Coming to Kentucky!\n\nHundreds of communities across the Commonwealth are feeling the positive impact of our administration's pro-economic development policies! #PromisesMadeAndKept", "2019-11-05T21:00:00.000Z": "Creating a Pro-Business Environment > > > #PromisesMadeAndKept", "2019-11-05T20:30:00.000Z": "#ICYMI : Eight Bills. One Session. Honored to ceremonially sign these bills into law this year alongside incredible legislative partners and members of our military #PromiseMadeAndKept", "2019-11-05T20:00:00.000Z": "Taking Care of Those Who Take Care of Us > > > #PromisesMadeAndKept", "2019-11-05T19:30:00.000Z": "#ICYMI : Our \"Kentucky Trained. Kentucky Built.\" apprenticeship program is a powerful tool for training and developing workers for advanced manufacturing jobs! #PromisesMadeAndKept", "2019-11-05T19:00:00.000Z": "Transforming Workforce Development > > > #PromisesMadeAndKept", "2019-11-05T18:30:00.000Z": "ICYMI: After DECADES of neglect by previous administrations, our @KYStateParks are once again beginning to shine\n\nBetween #RefreshingtheFinest and #RestoringtheFinest campaigns, our administration is investing in our state parks at record levels. #WeAreKY  #PromisesMadeAndKept", "2019-11-05T18:00:01.000Z": "Promoting Tourism in the Commonwealth > > > #PromisesMadeAndKept", "2019-11-05T17:30:00.000Z": "#ICYMI : The pension can was kicked down the road for far too long in this state, but our administration has made the FULL funding of our pension system a priority #PromisesMadeAndKept", "2019-11-05T17:00:00.000Z": "Strengthening Kentucky's Fiscal Foundation > > > #PromisesMadeAndKept", "2019-11-05T16:31:00.000Z": "#ICYMI : Our administration's pro-jobs policies are shattering economic records left and right > > > 57,644 New Jobs (HISTORIC RECORD!) 22.3 BILLION in New Business Investment (HISTORIC RECORD!) 111 BILLION in Exports (HISTORIC RECORD!) #WeAreKY  #PromisesMadeandKept", "2019-11-05T16:05:00.000Z": "Record-Setting Economic Development > > > #PromisesMadeAndKept", "2019-11-05T15:35:00.000Z": "#ICYMI : Foster Homes in Kentucky\nOct. 2015: 4,341\nOct. 2019: 5,477\n\nIn four years, foster homes in Kentucky increased by more than 1,000... #PromisesMadeAndKept", "2019-11-05T15:07:56.000Z": "Criminal Justice Reform > > > #PromisesMadeAndKept", "2019-11-05T14:41:47.000Z": "It's #ElectionDay , Kentucky...As Americans, we have a tremendous responsibility to vote and let our voices be heard. \n\nPolls close at 6 pm local time! #VoteKY  #WeAreKY", "2019-11-05T14:05:32.000Z": "Keeping Kentucky Moving > > > #PromisesMadeAndKept", "2019-11-05T13:35:00.000Z": "#ICYMI : 2018 Overdose Deaths\nKentucky = 15%\nUSA = 5%\n\nStill much work to be done, but we are extremely grateful to see such a significant decline...\n\nOur dedication to eradicating the scourge of the opioid epidemic is resulting in unprecedented progress. #PromisesMadeAndKept", "2019-11-05T13:14:15.000Z": "Fighting the Opioid Epidemic > > > #PromisesMadeAndKept", "2019-11-05T12:44:51.000Z": "#ICYMI : As the parents of nine children, four of whom are adopted, Glenna and I know firsthand: Adoption is SO worth it!\n\nThat's why we have worked so diligently to make sure Kentucky's foster care and adoption system becomes the gold standard in America... #PromisesMadeAndKept", "2019-11-05T12:02:09.000Z": "Reforming Foster Care and Adoption > > > #PromisesMadeAndKept", "2019-11-05T11:36:55.000Z": "#ICYMI : Fully funding our teacher pension system is one of many ways our administration is showing our commitment to educators, administrators, and students across the state. #PromisesMadeAndKept", "2019-11-05T11:03:43.000Z": "Investing in Our Education System > > > #PromisesMadeAndKept", "2019-11-05T04:32:50.000Z": "Grateful for the stellar work tonight by the @lexkypolice and the @kystatepolice who kept the crowds moving smoothly and safely in & out of @Rupp_Arena tonight, for the visit to KY by @POTUS , @realDonaldTrump So proud of Kentucky's incredible law enforcement officers! #WeAreKY", "2019-11-04T20:30:00.000Z": "Our pro-growth policies are working FOR Kentucky families, unleashing economic opportunity at a historic rate. #PromisesMadeAndKept", "2019-11-04T20:24:45.000Z": "I would be honored to hang this flag in the Governor's office in our Kentucky State Capitol or in any other public/state building that the artists would prefer\n\nIn Kentucky, we love & respect our men & women in law enforcement \n\n...Thx ... @dbongino  ! 'A national disgrace': Bongino calls out Maryland county exec for banning 'thin blue line' flag The \"thin blue line\" flag, labeled by some as a \"blue lives matter\" flag - in response to the \"Black Lives Matter\" movement - was banned by a county executive in Maryland. apple.news", "2019-11-04T19:30:00.000Z": "#ICYMI : \"This is a game-changer for the region. This is a high tech company with 200 plus jobs.\" - @RepHalRogers Hundreds celebrate groundbreaking ceremony for Dajcor Aluminum Bringing more than 200 jobs to the area, the support behind this Canadian business is massive. wymt.com", "2019-11-04T17:30:00.000Z": "(Record) BREAKING NEWS: Jobs Keep Coming to Kentucky!\n\nHundreds of communities across the Commonwealth are feeling the positive impact of our administration's pro-economic development policies! #PromisesMadeAndKept", "2019-11-04T16:11:05.000Z": "With the strongest workforce in Kentucky's history, pro-econ. dev. policies & unmatched work ethic/skills...Companies like @Intuit know the Commonwealth is the prime location for their business. \n\nIn communities like Perry County, and across KY, our best days are ahead of us!", "2019-11-03T23:35:00.000Z": "We will CONTINUE to defend #ProLife laws in Kentucky, no matter the fight the @ACLU , #PlannedParenthood or other organizations bring. Why? Because we stand on the side of right, and we stand on the side of life. #PromisesMadeAndKept", "2019-11-03T22:39:08.000Z": "Was saddened to hear of the earthly passing of former Johnson county Judge Executive, Tucker Daniel...\n\nThe prayers of many are with his family as they mourn his death...\n\nMay you be blessed with a peace that truly passes understanding... Former Judge Executive Passes Former Johnson County Judge Executive Roger T. \"Tucker\" Daniel passed away on Saturday. Our Sincer... wklw.com", "2019-11-03T21:52:49.000Z": "Kentucky is leading the charge in this critical fight for the heart/soul of our great nation, not only fighting for life in the Commonwealth but also joining 8 #ProLife amicus briefs w/ other states...\n\nWe will continue moving forward in the defense of life. #PromisesMadeAndKept", "2019-11-03T19:18:21.000Z": "Kentucky will always UNAPOLOGETICALLY defend human life... #PromisesMadeAndKept", "2019-11-02T23:00:00.000Z": "The pension can was kicked down the road for far too long in this state, but our administration has made the FULL funding of our pension system a priority #PromisesMadeAndKept", "2019-11-02T22:15:00.000Z": "It is IMPERATIVE that we save Kentucky's pension system, for the sake of every man, woman and child in the Commonwealth. The future of this state depends on it.", "2019-11-02T21:30:00.000Z": "#ICYMI : This summer we announced a budget surplus of nearly $200 million Our strong finish this fiscal year shows that KY's forward-thinking economic policies are working FOR Kentuckians. #PromisesMadeAndKept  https:// kentucky.gov/Pages/Activity-stream.aspx?n=KentuckyGovernor&prId=979 ", "2019-11-02T20:45:00.000Z": "Our administration is focused on being a good steward of taxpayer dollars, allowing us to invest back in our public servants like never before. #PromisesMadeAndKept", "2019-11-02T19:30:00.000Z": "From pay raises for CHFS, JPSC, and KYTC employees to funding for upgrades to @kystatepolice vehicles and equipmentour administration is committed to serving those who serve us. #PromisesMadeAndKept", "2019-11-02T18:45:00.000Z": "#ICYMI : In June, we announced an increase to the midpoint wage in the state's salary schedulethe first salary scale adjustment in over a decade. #PromisesMadeAndKept Quote Tweet Governor Matt Bevin (2015-2019) @GovMattBevin Our administration is committed to serving those who serve us...\n\nWatch this video to learn more about an exciting announcement we made today and read more here: https:// kentucky.gov/Pages/Activity-stream.aspx?n=KentuckyGovernor&prId=971   #WeAreKY", "2019-11-02T17:12:44.000Z": "Reply Tweet: Read our proposed bill prohibiting sanctuary policies in Kentucky, here: Draft Bill - Sanctuary City Policies.rtf Shared with Dropbox dropbox.com", "2019-11-02T17:00:00.000Z": "#ICYMI : \"Sanctuary\" policies in Kentucky would tie the hands of law enforcement officers and jeopardize their ability to do their jobs...\n\nLocal, state, and federal collaboration among law enforcement agencies is essential for public safety... #PromisesMadeAndKept", "2019-11-02T16:30:32.000Z": "Exciting groundbreaking for Dajcor today with @RepHalRogers in Perry County...\n\nThis new project, w/ 265 full-time jobs, will have a substantial impact on the local economy and represents the type of opportunities we are working to bring to Eastern Kentucky...", "2019-11-02T15:07:09.000Z": "Blessed to live in the land of the FREE & the home of the BRAVE...Where the men who drove tanks like this made the sacrifices necessary to ensure that we don't see scenes like this rolling across our landscape today\n\nFreedom is paid for at a great price\n\nMay we never forget.", "2019-11-02T13:32:32.000Z": "Grateful for the opportunity to visit with veterans at the Eastern Kentucky Veterans Center this morning... #WeAreKY", "2019-11-02T01:54:06.000Z": "So proud to do the Senior Walk Out with our daughter, Olivia, for all graduating senior athletes before tonight's football game... #Blessed", "2019-11-01T22:30:00.000Z": "There is no reason a child eligible for adoption should have to live without a home to call their own. Together, we CAN find forever families for children in KentuckyVisit http:// kyfaces.ky.org today! #PromisesMadeAndKept", "2019-11-01T21:45:00.000Z": "Our administration is reforming our foster care and adoption system from the top to the bottom #PromisesMadeAndKept", "2019-11-01T20:45:00.000Z": "Foster Homes in Kentucky\nOct. 2015: 4,341\nOct. 2019: 5,477\n\nIn four years, foster homes in Kentucky increased by more than 1,000... #PromisesMadeAndKept Learn how you can help us make Kentucky the gold standard for foster care in America: http:// foster.ky.gov .", "2019-11-01T19:45:00.000Z": "We are grateful to @POTUS ' admin for moving to repeal this Obama-era rule, which drastically limits faith-based institutions' ability to help address this nation's foster care/adoption crisis Donald Trump moves to repeal Obama rule against faith-based foster-car President Trump moved on Friday to repeal an Obama-era regulation that bars federally funded adoption and foster-care programs from serving families based on their religious beliefs. washingtontimes.com", "2019-11-01T19:05:09.000Z": "As the parents of nine children, four of whom are adopted, Glenna and I know firsthand: Adoption is SO worth it!\n\nThat's why we have worked so diligently to make sure Kentucky's foster care and adoption system becomes the gold standard in America... #PromisesMadeAndKept", "2019-11-01T16:36:25.000Z": "\"You never outgrow the need for a loving and supportive family.\"\n\nPowerful PSA from @AdCouncil \n\nWatch this video, and please consider visiting https:// bit.ly/2C5nBJg to view Kentucky children that are currently eligible for adoption, many of whom are teens. #AdoptKY The following media includes potentially sensitive content. Change settings View", "null": "", "2019-10-31T20:46:33.000Z": "Today's news from KCC Manufacturing is one of many economic development announcements that have come about in the past four years because of our administration's pro-job policies > > > https:// bit.ly/2WwZcW4  #PromisesMadeAndKept", "2019-10-31T18:02:45.000Z": "We are grateful for KCC's continued commitment to the commonwealth, and we congratulate them on 40 years of success in the Bluegrass State. #WeAreKY", "2019-10-31T18:01:16.000Z": "We are thrilled to see KCC Manufacturing grow its footprint in the commonwealth with an additional facility in Louisville, nearly doubling the company's workforce...", "2019-10-31T03:54:44.000Z": "Congratulations to #WorldSeries2019 Champions, @Nationals !\n\nWhat a season and what a World Series!\n\nNever quit!\n\nGotta love baseball in October!", "2019-10-31T00:05:00.000Z": "#ICYMI : @POTUS  @realDonaldTrump returned to Kentucky this summer to sign an E.O. directing @USEDGOV to eliminate student loan debt owed by permanently disabled American veterans  #PromisesMadeAndKept", "2019-10-30T23:35:00.000Z": "#ICYMI : Eight Bills. One Session. Honored to ceremonially sign these bills into law this year alongside incredible legislative partners and members of our military #PromiseMadeAndKept", "2019-10-30T23:00:00.000Z": "All gave somesome gave all. Our administration is grateful for our service members and military families, and we are determined to ensure the sacrifices of these honored warriors are not made in vain. #PromisesMadeAndKept", "2019-10-30T22:00:00.000Z": "This year we expanded veterans' preference for state jobs to include military spouses.\nRead firsthand from a current state employee and military spouse how this new law benefits Kentucky's military families > > > https:// bit.ly/2NLKUAg  #PromisesMadeAndKept Guest Opinion: Expanding veterans' preference in Ky. Gov. Bevin recently signed legislation into law expanding veterans' preference for state jobs to include military spouses. The opportunities that this preference presents, which will aide in the... dailyindependent.com", "2019-10-30T21:00:00.000Z": "In 2016, we established Kentucky's Service-Disabled Veteran-Owned Small Business (SDVOSB) Certification Program, which supports veterans in their entrepreneurial endeavors Apply for certification by visiting http:// vetbiz.ky.gov ! #PromisesMadeAndKept", "2019-10-30T20:40:00.000Z": "Proud to have signed statewide legislation providing occupational licensing reciprocity to military spouses (and veterans) to use their occupational licenses, issued in any other state, in Kentucky as well. https:// wapo.st/2XVNPqq  #PromisesMadeAndKept Opinion | Military spouses face added challenges while trying to find jobs. This could help. Too often they find themselves underemployed, with jobs few and far from the bases. washingtonpost.com", "2019-10-30T20:04:52.000Z": "Our military personnel and families make tremendous sacrifices\n\nWe are abundantly grateful for their service, and we are committed to making Kentucky the most military-friendly state in the nation.\n\nVisit http:// kcma.ky.gov to learn more. #PromisesMadeAndKept", "2019-10-30T18:41:23.000Z": "Appreciate @NatlGunRights ' recognition of Kentucky's efforts to support our Second Amendment rights...\n\nHonored to receive the .50 Caliber Freedom Award today alongside the bill sponsors of SB 150, Kentucky's Constitutional Carry bill.", "2019-10-30T15:48:09.000Z": "I am grateful to @JusticeKentucky for their work to leverage federal dollars to assist additional groups, and I applaud each grant recipient for all they do to help their fellow Kentuckians. They truly embody what it means when we say: #WeAreKY .", "2019-10-30T15:47:31.000Z": "VOCA grants are one way that the state can come alongside victim advocacy groups and assist them with the resources they need to carry out their important work.", "2019-10-29T22:00:00.000Z": "After previous administrations failed to address pension funding for decades, our administration is not only investing historic levels of fundingwe are allocating 100% of what is required. #PromisesMadeAndKept  #WeAreKY", "2019-10-29T21:00:01.000Z": "Our administration is investing in our students like never before, with the highest levels of per-pupil spending ever seen in Kentucky. #PromisesMadeAndKept  #WeAreKY", "2019-10-29T20:00:00.000Z": "In 2016, our administration ended the sweeping of Kentucky Lottery funds\n\nSince then, those funds have helped provide dual credit opportunities to high school students, giving them an upper hand as they begin post-secondary school #PromisesMadeAndKept", "2019-10-29T19:00:00.000Z": "Fully funding our teacher pension system is one of many ways our administration is showing our commitment to educators, administrators, and students across the state. #PromisesMadeAndKept", "2019-10-29T17:24:20.000Z": "When the Kentucky Lottery began, the proceeds were promised to fund education\n\nOur administration has ENSURED that the lottery funds go DIRECTLY to education, instead of being swept for other purposes #PromisesMadeAndKept", "2019-10-28T22:18:13.000Z": "Because of the extraordinarily brave actions of his elite Joint Special Operations Command team, one of the world's most despicable terrorists is no longer a threat. (3/3)", "2019-10-28T22:17:44.000Z": "As Kentuckians and as Americans, we owe a deep debt of gratitude to Lt Gen Howell and to all the valiant men and women in our military and intelligence communities who sacrifice so much to keep us safe. (2/3)", "2019-10-28T22:17:15.000Z": "We are very proud of Trigg County native Lt Gen Scott Howell for the critical role he played in this weekend's historic operation in Syria that killed ISIS leader Abu Bakr al-Baghdadi. (1/3)", "2019-10-28T22:00:00.000Z": "Kentucky's growing tourism industry is making its mark across the state. \n\nVisitors the world over are excited to experience what our Commonwealth has to offer, and their interest in Kentucky is having a huge economic impact #WeAreKY  #PromisesMadeAndKept", "2019-10-28T21:35:00.000Z": "Mountains, plains, waterways, historic sites, events, urban destinationsvisitors to Kentucky are seeing what our state has to offer\n\nWith each passing year, our administration is ensuring our tourism industry continues to grow. #PromisesMadeAndKept  #WeAreKY", "2019-10-28T21:04:21.000Z": "After DECADES of neglect by previous administrations, our @KYStateParks are once again beginning to shine\n\nBetween #RefreshingtheFinest and #RestoringtheFinest campaigns, our administration is investing in our state parks at record levels. #WeAreKY  #PromisesMadeAndKept", "2019-10-28T18:22:34.000Z": "Thankful for these uplifting words from Brandon Pierson & the Blackjewel miners\n\nTheir determination inspired the country, & we are grateful our work alongside @POTUS ' admin provided welcome news for the miners & their families > > > https:// bit.ly/36eqJ3l  #WeAreKY", "2019-10-28T01:13:59.000Z": "Granted, after overwhelming outrage, the @washingtonpost changed its headline from the one they chose below , but how truly DESPICABLE that they would choose to mark the death of the most sadistic and evil man on the planet in the 21st century in such a glowing way...", "2019-10-27T23:35:09.000Z": "Our \"Kentucky Trained. Kentucky Built.\" apprenticeship program is a powerful tool for training/developing workers for advanced manufacturing jobs! #WeAreKY  #PromisesMadeAndKept", "2019-10-27T21:37:33.000Z": "This program is equipping individuals of all ages for the high-demand careers available today...At the same time, it is strengthening our workforce & continuing to make KY the ideal location for businesses to thrive/grow.  > > > https:// workreadykentucky.com  #PromisesMadeAndKept", "2019-10-27T14:10:26.000Z": "CONFIRMED: ISIS leader is dead...\n\nGrateful for our military who made this historic operation possible... \n\nWe are blessed to have a Commander in Chief @POTUS / @realDonaldTrump who puts America first and empowers and supports  our military... US official: IS leader believed dead in US military assault WASHINGTON (AP) - Abu Bakr al-Baghdadi, the shadowy leader of the Islamic State group who presided over its global jihad and became arguably the world's most wanted man, is believed dead after... apnews.com", "2019-10-27T00:30:00.000Z": "The opioid epidemic affects countless families across Kentucky...our helpline connects callers to community resources that can make a real difference. #PromisesMadeAndKept  #WeAreKY", "2019-10-26T23:30:00.000Z": "Are you, or a loved one, struggling with substance use disorder? Find IMMEDIATE treatment openings near you at http:// findhelpnowky.org together, we CAN put an end to the opioid epidemic! #PromisesMadeAndKept  #WeAreKY", "2019-10-26T22:24:54.000Z": "#ICYMI : Since we launched it in late 2016, nearly 150 Kentuckians have received help through the @kystatepolice 's Angel Initiative...including 22-year old Misty Patton, who has now been in recovery for seven months. #PromisesMadeAndKept 'He saved my life' | Kentucky State Police helps people combat drug addictions Since its launch in 2016, the Kentucky State Police's Angel Initiative has helped 140 people find treatment programs to battle drug addictions. wbir.com", "2019-10-26T20:05:31.000Z": "2018 Overdose Deaths\nKentucky = 15%\nUSA = 5%\n\nStill much work to be done, but we are extremely grateful to see such a significant decline...\n\nOur dedication to eradicating the scourge of the opioid epidemic is resulting in unprecedented progress. #PromisesMadeAndKept  #WeAreKY", "2019-10-26T18:21:23.000Z": "God bless America and the men and women who have served this great nation through the years....\n\nAnd the family members of those service members...\n\nBy God's grace, may we always be the land of the free and the home of the brave!", "2019-10-26T17:42:35.000Z": "Kentucky has received several important grants from @POTUS ' administration to combat our opioid epidemic\nGrateful for a @WhiteHouse that recognizes the dangers of the opioid crisis & is tackling it head onencourage people to participate in National #TakeBackDay ! #WeAreKY Quote Tweet Donald J. Trump @realDonaldTrump My Administration is fighting hard to end the Opioid Crisis. Join with us by disposing unused or expired prescription medications at over 4,000 locations across this great Country. Find a location TODAY from 10am-2pm at http:// TakeBackDay.DEA.gov . #TakeBackDay", "2019-10-26T15:54:19.000Z": "Our administration's policies and reforms are becoming a model for the nation...we intend to put a stop to the scourge of the opioid epidemic. #PromisesMadeAndKept  #WeAreKY", "2019-10-25T22:45:00.000Z": "Our administration is determined to continue working w/ @POTUS  @realdonaldtrump to create opportunities that will empower Kentuckiansand Americansto live their own version of the American Dream. #PromisesMadeAndKept", "2019-10-25T21:45:00.000Z": "Grateful for @POTUS ' commitment to addressing issues like #CJReform \n\nThe American people are hungry for this type of \"across-the-aisle\" legislation that transcends partisanship & I was honored to work with his admin to make the #FirstStepAct a reality. https:// c-span.org/video/?c476949 2/user-clip-kentucky-governor-matt-bevin-makes-remarks-white-house-signing-ceremony-criminal-justice ", "2019-10-25T20:42:23.000Z": "Our administration is helping shape the national conversation on key issues like never before\n\nHonored to work with @POTUS ' administration to help make Kentuckyand Americathe best version of itself.  #PromisesMadeAndKept  #WeAreKY", "2019-10-25T19:26:03.000Z": "Kudos to ... @LindseyGrahamSC  for calling for what should be expected in a free society\n\nThe ...blindly, vitriolic efforts by the @DNC  to undermine our ... @POTUS  , ... @realDonaldTrump  are an embarrassment to themselves &  to our nation Chairman Graham Introduces Resolution Condemning House of Representatives' Closed Door Impeachment... United States Senate Committee on the Judiciary judiciary.senate.gov", "2019-10-25T18:36:32.000Z": "KY= NATIONAL LEADER\n\nOur cabinet secretaries & representatives from the First Lady's office, @ThinkKentucky, @JusticeKentucky & @CHFSKy are a constant presence in D.C., spearheading nat'l conversations on Kentucky's key initiatives w/ @POTUS ' admin. #WeAreKY  #PromisesMadeAndKept", "2019-10-25T15:09:17.000Z": "The updates to the Adoption Benefit Program will support our hardworking public employees in their adoption journey, while also helping more children find their forever homes with Kentucky families. #WeAreKY  #PromisesMadeAndKept  #AdoptKY", "2019-10-25T15:06:57.000Z": "NEWLY ANNOUNCED: State employees who adopt may now receive up to $5K for a standard adoption/up to $7K if the child is certified by @CHFSKy as having special needs... #AdoptKY  #WeAreKY  #PromisesMadeAndKept Kentucky's State Employee Adoption Benefit Program Gov. Bevin discusses Kentucky's State Employee Adoption Benefit program. youtube.com", "2019-10-24T21:45:00.000Z": "We are our brother's keeper\n\nI am confident that we can find forever families for children ready for adoption in Kentucky! #PromisesMadeAndKept  #WeAreKY", "2019-10-24T20:45:00.000Z": "RESULTS \n\nSince 2015, we've seen adoptions in Kentucky increase by nearly 40%, and we are gaining momentum...\n\nWant to join the movement? Visit http:// adopt.ky.gov today to view currently waiting children! #PromisesMadeAndKept  #WeAreKY", "2019-10-24T20:04:28.000Z": "Through our foster care and adoption portal, KY FACES, Kentuckians can view waiting children, access critical resources, learn about kinship care, and so much more. Visit http:// adopt.ky.gov or http:// foster.ky.gov today! #PromisesMadeAndKept  #WeAreKY", "2019-10-24T18:45:00.000Z": "Adoptions >> Up by 37.5% since 2015\n\nFoster Homes > > Added More than 1,000\n\nKentucky's child welfare system is undergoing an incredible transformation. #PromisesMadeAndKept  #WeAreKY Promises Made. Promises Kept.: Transforming Kentucky's Foster/Adopt... Gov. Bevin and First Lady Glenna Bevin share why they're passionate about reforming Kentucky's foster care and adoption system. youtube.com", "2019-10-24T17:36:09.000Z": "May we always appreciate the hard work of our coal miners, and may we always fight as hard on their behalf as they do to keep the lights on in our communities. #WeAreKY  https:// bit.ly/2MJ2Ett (2/2)", "2019-10-24T17:35:14.000Z": "Our Labor Cabinet has worked diligently with @POTUS ' Administration since July to ensure that the miners affected by the Blackjewel closing are rightfully compensated...Grateful that our perseverance has provided welcome and deserving news for the miners and their families. (1/2)", "2019-10-24T13:00:48.000Z": "Nothing finer than a fall morning in Kentucky...", "2019-10-23T22:15:00.000Z": "46 years following Roe v. Wade, the fight for life continues with more momentum than ever before. We WILL prevail. #WeAreKY  #PromisesMadeAndKept  #ProLife", "2019-10-23T21:15:00.000Z": "Our administration has been clear from day one: we will ALWAYS fight against the barbaric and gruesome practice of live dismemberment abortion, which seeks to undermine and devalue the sanctity of human life. #PromisesMadeAndKept  #WeAreKY  #ProLife Gov. Matt Bevin Awaits Ruling On Kentucky Abortion Law Kentucky's only abortion clinic and the ACLU are fighting a law that bans a second trimester abortion procedure called dilation and extraction. Shannon Bream... youtube.com", "2019-10-23T20:15:00.000Z": "Kentucky is UNAPOLOGETICALLY #ProLife and leading the charge in this vitally important fight for the heart and soul of our great nation. #PromisesMadeAndKept  #WeAreKY", "2019-10-23T18:23:10.000Z": "4 Legislative Sessions > > > 10 #ProLife Bills\n\nThe sanctity of human life should NOT be controversial, and our administration is committed to protecting it. #PromisesMadeAndKept  #WeAreKY", "2019-10-23T15:49:57.000Z": "Read more, here: https:// kentucky.gov/Pages/Activity-stream.aspx?n=KentuckyGovernor&prId=1072  (3/3)", "2019-10-23T15:49:24.000Z": "KY stands ready to work collaboratively w/ Air Pollution Control District to eliminate reformulated gasoline requirement. Alternative means of reducing emissions are available and affordable. Let's work together to improve both our environment and our financial well-being. (2/3)", "2019-10-23T15:48:51.000Z": "Today, I call on Mayor Fischer to direct the Louisville Metro Air Pollution Control District to move forward on finding the most cost-effective offsets that will help eliminate RFG and save the citizens of Louisville more than $73 million a year...(1/3)", "2019-10-22T23:30:00.000Z": "In September, Kentucky had its LARGEST LABOR FORCE EVER! #PromisesMadeAndKept  #WeAreKY", "2019-10-22T22:30:00.000Z": "Economic opportunity continues to grow in the Commonwealthand with it, opportunity for Kentucky's workforce! #PromisesMadeandKept  #WeAreKY", "2019-10-22T21:39:05.000Z": "Sometimes the \"Thin Gray Line\" is almost invisible...\n\nGrateful to the men and women who are there protecting and serving us even where we don't see them... #WeAreKY", "2019-10-22T21:30:00.000Z": "Kentucky Makes!  Our manufacturing sector is proving day in and day out why our reputation as the center of excellence in engineering and manufacturing in North America continues to grow. Visit https:// bit.ly/2p3PoXv to learn more! #PromisesMadeAndKept  #WeAreKY", "2019-10-22T20:30:00.000Z": "\"Without vision, the people perish.\" Our vision for Kentucky is transforming the state's economy like never before. #PromisesMadeAndKept  #WeAreKY", "2019-10-22T20:21:27.000Z": "Over the past four years, Kentucky has experienced firsthand the transformative results of eliminating burdensome, outdated government regulations...\n\nOur historic Red Tape Reduction initiative has already cut or amended more than 27% of all state administrative regs...(2/2)", "2019-10-22T20:20:55.000Z": "We are honored to work closely with @POTUS  @realDonaldTrump and @VP  @mike_pence on the new Governor's Initiative on Regulatory Innovation to continue moving Kentucky and America forward... (1/2)", "2019-10-22T19:45:00.000Z": "Kentucky continues moving forward! #PromisesMadeAndKept  #WeAreKY", "2019-10-22T18:48:01.000Z": "Our administration is laser-focused on growing Kentucky's economy, and the results are proof-positive that our policies are working FOR Kentucky families! #PromisesMadeAndKept  #WeAreKY", "2019-10-22T16:38:40.000Z": "Our administration's pro-jobs policies are shattering economic records left and right > > > 57,644 New Jobs (HISTORIC RECORD!) 22.3 BILLION in New Business Investment (HISTORIC RECORD!) 111 BILLION in Exports (HISTORIC RECORD!) #WeAreKY  #PromisesMadeandKept", "2019-10-22T15:29:23.000Z": "Excited to officially break ground on KY's newest airport here in Gallatin County...\n\nThis long-anticipated project will bring aviation access to NKY's I-71 corridor, enhancing emergency response capabilities, economic growth, & recreational opportunities for the entire region.", "2019-10-21T23:06:28.000Z": "Fire and rain as the day winds to a close here in paradise... #WeAreKY", "2019-10-21T20:59:56.000Z": "Southeast State Correctional Complex will not only help KY ease overcrowding in county jails, but will also create up to 200 jobs...\n\nThis innovative solution will allow us to move forward quickly in opening the facility/hiring the local work force necessary to staff it. #WeAreKY", "2019-10-21T14:10:48.000Z": "Interested in joining the Southeast State Correctional Complex team? Check out one of these upcoming job fairs! #WeAreKY", "2019-10-20T23:44:49.000Z": "#ICYMI : The lease of the Southeast State Correctional Complex will allow us to simultaneously address overcrowding in our prison system while being smart with state resources... #WeAreKy Gov. Bevin announces state will run prison in Eastern Kentucky to address jail overcrowding Kentucky officials have announced plans to lease a private prison in Floyd County to provide relief for overcrowded jails in the state. wlky.com", "2019-10-20T19:01:59.000Z": "Remember the Sabbath Day... #WeAreKY", "2019-10-20T13:18:55.000Z": "Good morning, Kentucky! #WeAreKY", "2019-10-19T23:19:21.000Z": "Grateful for all the businesses, large and small, who call Kentucky home...\n\nEmploying people, paying taxes and helping our Commonwealth to thrive... #WeAreKY", "2019-10-19T20:09:50.000Z": "The Post Clinic's dedicated volunteer professionals provide vital medical services to area residents in need. This impactful project will increase their capacity to deliver services to even more families within Montgomery and surrounding counties. #WeAreKY", "2019-10-19T20:09:27.000Z": "Excited to join @RepAndyBarr , @DLG_KY , state and local officials to announce a $500,000 Community Development Block Grant allocation for the City of Mount Sterling to construct a new medical facility...", "2019-10-19T14:56:23.000Z": "Looking for weekend plans? Check out @KentuckyTourism 's event guide > > > https:// bit.ly/2Wvc5Cv  #WeAreKY", "2019-10-18T19:00:05.000Z": "Appreciate the stellar efforts of @JusticeKentucky & @KYPersonnel cabinets as they have worked together to develop this innovative solution. \n\nToday's announcement will allow us to move forward quickly in opening the facility & hiring the local workforce necessary to staff it.", "2019-10-18T18:58:52.000Z": "The lease of the Southeast State facility will allow us to simultaneously address overcrowding in our prison system while being smart with state resources... #WeAreKy", "2019-10-18T17:15:18.000Z": "While in Floyd County today, I enjoyed stopping by Bevinsville...one of many communities that represents the greatness of this state. #WeAreKY", "2019-10-18T15:14:06.000Z": "Join us now for a major community announcement in Floyd County! #WeAreKY  https:// facebook.com/WYMTNews/video s/1087696611438036/ ", "2019-10-18T14:39:58.000Z": "Foothills of Appalachia... #WeAreKY", "2019-10-17T21:52:58.000Z": "Please join us tomorrow in Wheelwright for a community announcement... #WeAreKy", "2019-10-17T21:16:05.000Z": "#ICYMI : Congratulations to the Camp KYSOC team on winning this year's Beautify the Bluegrass Governor's Award...\n\nThe Carrollton community really came together to make the restoration of this historic campground an incredible success! #WeAreKY  #BeautifyKY", "2019-10-17T16:12:14.000Z": "Lillyann and Alexus, both 15 years old, have still not given up hope that they will find a forever family...\n\nInterested in learning more about adopting Alexus or Lillyann? 1-800-232-KIDS Christina.Dettman@ky.gov Wednesday's Child: Teenage girls in foster care for years admit 'it's not easy' Some of the kids have been in the system for more than a decade. They've endured years of trauma, and their stories are not easy to hear. But that doesn't mean we're not listening. wlky.com", "2019-10-16T20:41:34.000Z": "Visit https:// bit.ly/2VOm1V4 to learn more of Abdul's powerful story! Abdul Samad | Out Of My Hands With no hands and no left eye, Abdul Samad tells a story of hope and encouragement. Get your copy of Out Of My Hands today! authorabdul.com", "2019-10-16T20:40:50.000Z": "Decades after coming to America to receive vital medical treatment, Abdul Samad is a familiar friendly face at the @GalileanHome 's Bread of Life Café...and a shining example of perseverance in the face of insurmountable odds. #WeAreKY Overcoming Adversity: Abdul Samad Gov. Bevin highlights Abdul Samad, author and employee of the bread of Life Cafe in Liberty, Kentucky. youtube.com", "2019-10-16T17:09:54.000Z": "#ICYMI : @Toyota announced it will add 400 workers at the @VisitToyotaKY plant in Georgetown.\n\nCheck out the link to apply here: http:// toyotaky.com/jobs/ Kentucky keeps moving forward... Quote Tweet Cabinet for Econ Dev @CEDkygov On Tuesday, @Toyota announced it seeks to add 400 workers immediately at its Georgetown @VisitToyotaKY plant, the company's largest in the world. Toyota Motor Manufacturing KY, which employs approximately 8,000, is gearing up to start producing the RAV4 Hybrid in January Show this thread", "2019-10-15T22:04:00.000Z": "\"The cattle on a thousand hills...\" #WeAreKY", "2019-10-15T20:58:22.000Z": "Grateful for the opportunity to address @CommerceLex this afternoon and discuss how our administration's policies are moving Kentucky forward! #WeAreKY", "2019-10-15T16:27:36.000Z": "I was honored to serve as Grand Marshal for Fleming County's 16th annual Tractor Parade...\n\nThe sense of enthusiasm for agriculture and overall community pride was a shining example of what makes our Commonwealth such a special place to call home. #WeAreKY", "2019-10-15T01:09:08.000Z": "Saturday, we were excited to announce discretionary road funds for Letcher County and Fleming-Neon, along with a $1 million ARC Grant for the final phase of replacing water lines around Jenkins...\n\nKentucky keeps moving forward! #WeAreKY", "2019-10-14T21:47:36.000Z": "Grateful to all who came out to our community forum today in McKee, and thanks to Opal's Restaurant for hosting us! #WeAreKY", "2019-10-14T18:48:02.000Z": "Kentucky's reputation as the center of excellence in engineering and manufacturing continues to grow, and we are grateful for all who are training up a highly-skilled generation of students ready to answer that call. #KYMakes  #WeAreKy", "2019-10-14T18:47:45.000Z": "After meeting this impressive group last year at @SOAR_EKY , I wanted to help them get their car to @KySpeedway for a test run ahead of their competition in Texas. #WeAreKY", "2019-10-14T18:47:05.000Z": "Congratulations to these students from @Bathcoschools on finishing fourth at their first national @HighSchoolSolar appearance! Kentucky Solar Cats Gov. Bevin highlights the Kentucky Solar Cats, a student group from Bath County High School that placed fourth in the national Solar Car Challenge. youtube.com", "2019-10-14T15:31:04.000Z": "Mayor Charles E. Long dedicated his life to public service, serving as the mayor of Booneville for 60 years. \n\nHonored to join the Owsley County community today as we celebrated Mayor Long's legacy of humility, integrity, tenacity and service... #WeAreKY", "2019-10-14T13:21:07.000Z": "This past Saturday, my boys and I spent a wonderful day celebrating the bicentennial of world famous Harlan County, named for Silas Harlan who lived an extraordinary life before his death at Blue Licks at the age of only 29...\n\nEnjoyed a piece of the most extraordinary cake ever!", "2019-10-13T20:39:25.000Z": "Looking forward to tomorrow's community forum in Jackson County...Hope you can join us! #WeAreKY", "2019-10-13T16:30:32.000Z": "Our \"Refreshing the Finest\" initiative was an important first step to address deferred maintenance, and now the \"Restoring the Finest\" initiative will allow us to build on our momentum and advance further improvements within our state park system. #WeAreKY", "2019-10-13T16:29:55.000Z": "#ICYMI : After decades of neglect and mismanagement under previous administrations, we are committed to investing in and improving our @KYStateParks for the next generation. #RestoringtheFinest", "2019-10-12T19:14:20.000Z": "The Commonwealth is rapidly becoming America's center for engineering and manufacturing excellence, and Barbourville's new state-of-the-art Work Ready Training Center will equip hundreds of additional Eastern Kentucky residents each year for success. #WeAreKY", "2019-10-12T19:13:30.000Z": "Excited to join @RepHalRogers & Senate Pres. Stivers to announce grant funding for a new high-tech workforce training center in Barbourville...\n\nFed, state & local funds, coupled w/ the Forcht family's generous facility donation, made this Work Ready Training Center possible...", "2019-10-12T13:40:40.000Z": "Interested in construction trades and working with your hands? \n\nCheck out @IKORCC 's Open House to learn more about their apprenticeship program NEXT Thursday! #WeAreKY", "2019-10-12T11:49:52.000Z": "Good morning, Kentucky!\n\nMay your day be warmer than your morning ,  and may all your favorite football teams win...   #WeAreKY", "2019-10-12T03:02:00.000Z": "Good night, moon... Good night, Kentucky...", "2019-10-11T23:49:53.000Z": "Last minute weekend plans? Check out our Governor's Guide to the weekend for events happening around the state, or visit: https:// bit.ly/2Wvc5Cv  #WeAreKY", "2019-10-11T20:43:34.000Z": "Honored to serve as the Grand Marshal for the 16th annual Tractor Parade in Flemingsburg...\n\nThe support Fleming County has given its farming community is incredible, and embodies what we mean when we say \" #WeAreKY .\"", "2019-10-11T15:26:35.000Z": "Enjoyed participating in the Fleming County FFA Town Hall and visiting with students and faculty this morning... #WeAreKY", "2019-10-11T11:32:16.000Z": "Good morning, Kentucky!\n\nIt's another great day to be an American...", "2019-10-11T02:37:31.000Z": "I truly don't understand how the haters continue to froth at the mouth in their efforts to destroy our @POTUS , @realDonaldTrump ...\n\nHis genuine love for America and the American people is something we have not seen in Washington for many, many years...\n\nMay God bless the USA", "2019-10-10T21:57:02.000Z": "Evening settling in here in the most beautiful state in the greatest nation on planet earth... There are many thousands of properties like this across our commonwealth that are just waiting for you to ...@ThinkKentucky #WeAreKY", "2019-10-10T20:47:24.000Z": "Camp KYSOC (Carroll County) was completely transformed during our annual Beautify the Bluegrass competition, thanks to the efforts of hundreds of volunteers...\n\nEnioyed partnering with @KentuckyLiving today to celebrate their hard work and commitment to community! #WeAreKY", "2019-10-10T17:29:00.000Z": "#ICYMI : @IgniteAtRIC , a tuition-free #STEAM public education center in Erlanger, is an INCREDIBLE example of public/private collaboration\n\nThanks to @Toyota , educators, state leadership and all community partners who made this project a reality for NKY students #WeAreKY", "2019-10-10T14:55:10.000Z": "This significant investment by @DeltaRegional in six projects will help fund critical services and address infrastructure needs, affecting hundreds of Kentucky families... #WeAreKY  https:// themoreheadnews.com/news/dra-annou nces-million-investment-into-kentucky-communities/article_5cf600f8-eace-11e9-ac32-3bacf2b3b2ed.html ", "2019-10-09T19:51:20.000Z": "#ICYMI : $750 MILLION Investment. 1,000 HIGH-PAYING Jobs. \n\nGrateful for the continued commitment of @UPS to the highly skilled workers of Kentucky...\n\nWe look forward to further expanding this strong partnership as we move into the future. #WeAreKY", "2019-10-09T14:37:19.000Z": "Excited to announce $200,000 in discretionary road funds for the city of Grayson this morning...\n\nKentucky keeps moving forward! #WeAreKY", "2019-10-09T12:07:06.000Z": "This is the day that the Lord has made...\n\nAnother beautiful day dawning in paradise... #WeAreKY", "2019-10-09T00:42:16.000Z": "#ICYMI : Our 'Refreshing the Finest' initiative was an important first step to address deferred maintenance, & now the 'Restoring the Finest' initiative will allow us to build on our momentum and advance further improvements within our state park system. Gov. Bevin announces improvements to Pine Mountain State Park - Middlesboro News Governor Matt Bevin today announced more than $1 million in improvements to Pine Mountain State Resort Park. middlesboronews.com", "2019-10-08T20:44:54.000Z": "How can we NOT be great?\n\nYou couldn't recreate what this state is blessed with for any price...the world is looking for what we have in Kentucky.\n\nWatch my full speech from the @AshlandAlliance Annual Dinner, below. #WeAreKY How can we NOT be great? Gov. Bevin delivers the keynote address at the Ashland Alliance Annual Dinner. youtube.com", "2019-10-08T15:27:10.000Z": "4H is an incredible program, encouraging students to pledge their head, heart, hands and health to serving their community and world... Enjoyed celebrating National @4H Week in Kentucky with @KY4H ! #WeAreKY", "2019-10-07T19:53:11.000Z": "In each of the last few years, we've had record levels of capital investment, record levels of jobs being created, & so much more...\n\nIt's not by coincidence; it's a direct result of good policy.\n\nRead more about my vision for Kentucky in my interview with AMAC, below. #WeAreKY", "2019-10-07T14:30:09.000Z": "Beginning Oct. 1, Kentucky became one of the first states to participate in the Family First Prevention Act, which provides preventative services and resources to keep families together... #WeAreKY New Kentucky program to keep children out of foster care system The Family First Prevention Act in Kentucky wants to give families resources to help them through rough times before a social worker has to take children away from home. wkyt.com", "2019-10-06T18:55:11.000Z": "Kentucky is leading the fight against opioids. Together, we CAN put an end to this epidemic! #WeAreKY", "2019-10-06T18:54:48.000Z": "Since its launch near the end of 2016, nearly 150 Kentuckians have received help through the @kystatepolice 's Angel Initiative...including 22-year old Misty Patton, who has now been in recovery for seven months. 'He saved my life' | Kentucky State Police helps people combat drug addictions Since its launch in 2016, the Kentucky State Police's Angel Initiative has helped 140 people find treatment programs to battle drug addictions. wbir.com", "2019-10-06T16:15:04.000Z": "Kentucky keeps moving forward... #WeAreKY Road improvements coming to Greenup and Boyd counties Kentucky Governor Matt Bevin announced road improvements coming to Greenup and Boyd counties Saturday. wsaz.com", "2019-10-05T22:08:20.000Z": "#ICYMI : @UPS to invest $750 MILLION and create 1,000 jobs > > > Gov. Matt Bevin, UPS celebrate $750 million investment in Louisville Governor Matt Bevin and local leaders joined with UPS to formally announce a massive investment into Louisville. wlky.com", "2019-10-05T17:15:59.000Z": "Our @KYTC has worked closely with local officials to identify priority projects that will significantly enhance safety, access, and economic opportunity for this community.", "2019-10-05T17:15:38.000Z": "A beautiful day in Boyd County...\n\nPleased to announce the investment of discretionary road funding for Boyd County and the cities of Ashland and Catlettsburg! #WeAreKY", "2019-10-04T22:43:09.000Z": "Last minute weekend plans? Check out our Governor's Guide to the weekend or visit https:// bit.ly/2Wvc5Cv ! #WeAreKY", "2019-10-04T19:28:45.000Z": "September is the 2nd month in 2019 with more than $1 BILLION in new business investment, and the 7th month since the beginning of our administration. \n\nCheck out the September projects that made this possible > > > http:// bit.ly/2lqr3Jz  #WeAreKY", "2019-10-04T19:28:34.000Z": "Kentucky's economy is growing at an INCREDIBLE pace because we are out there hustling every SINGLE day to bring new jobs and business opportunities to the Commonwealth... #WeAreKY", "2019-10-04T16:44:05.000Z": "Thank you to the Bullitt County Fiscal Court for hosting this morning's community forum...\n\nExcited to announce more than $350,000 in discretionary road funds for this community! #WeAreKY", "2019-10-04T11:53:52.000Z": "Good morning from Shepherdsville, KY! #WeAreKY", "2019-10-04T00:49:09.000Z": "Looking forward to being in Bullitt County tomorrow morning! #WeAreKY", "2019-10-03T22:06:57.000Z": "EXCITING DEVELOPMENT @UPS to invest $750 MILLION and create 1,000 jobs > > > https:// bit.ly/31Kqx99 UPS is a great corporate citizen and a significant economic driver for the commonwealth. \n\nWe are thrilled to see the company's continued growth here! #WeAreKY", "2019-10-03T21:29:59.000Z": "Live now with @terrymeiners ...Join us! NewsRadio 840 WHAS - Kentuckiana's News, Weather & Traffic Station Louisville's News Radio 840 WHAS. whas.iheart.com", "2019-10-03T19:54:04.000Z": "Tune in to our Facebook page at approx. 4:00 pm EDT to watch an EXCITING jobs announcement with @UPS : http:// facebook.com/govmattbevin ! #WeAreKY", "2019-10-03T16:20:33.000Z": "One month. $1+ BILLION in new business investments in Kentucky\n\nSeptember is the 2nd month in 2019 with more than $1 billion invested, and the 7th month since the beginning of our administration. \n\nOur pro-job, pro-biz policies are working FOR Kentucky families! #WeAreKY", "2019-10-02T17:44:29.000Z": "Manufacturers across the Commonwealth are proving every day why Kentucky's reputation as the center of excellence in engineering/manufacturing in North America continues to grow.", "2019-10-02T17:43:10.000Z": "Want something made right? Make it in Kentucky. \n\nNearly every major industry in the USA has a business presence in the Commonwealth...Advanced manufacturing MOVES our economy! #WeAreKY  #ManufacturingWeek", "2019-10-02T15:18:36.000Z": "#DYK : Kentucky's geographic location is IDEAL for businesses that want to thrive and grow! #WeAreKY", "2019-10-01T20:48:33.000Z": "STUDENTS  #BringYourBible to School Day is THIS Thursday, Oct. 3! \n\nThe Judeo-Christian principles that are bound in this book are timeless, containing an amazing amount of history, knowledge, wisdom and guidance...\n\nBring it. Read it. Share it. #WeAreKY", "2019-10-01T16:10:46.000Z": "Our @KYTC has worked closely with these communities to identify priority projects that will significantly enhance safety, access, and economic opportunity for local residents.", "2019-10-01T16:10:08.000Z": "Yesterday, we announced discretionary funding in Christian County, Oak Grove, Guthrie, Russellville and Auburn...Kentucky keeps moving forward! #WeAreKY", "2019-09-30T19:36:19.000Z": "Thank you to the Hopkinsville Sportsplex for hosting our executive cabinet meeting this morning in Christian County... #WeAreKY", "2019-09-30T19:29:35.000Z": "Getting near the end of the harvest season here in God's country...\n\nHas been a bit dry of late here in Todd County and across the commonwealth, but we are blessed to live in Kentucky, in the middle of the greatest nation in earth!", "2019-09-30T17:43:10.000Z": "Because you only live once and you want to keep the tastebuds happy... At the L&R Soda Bar-n-Eatery in Elkton, KY...", "2019-09-30T12:07:02.000Z": "A beautiful start to the day along the mighty Ohio River...\n\nGood morning, Kentucky!", "2019-09-30T00:27:13.000Z": "Wishing the Jewish community in Kentucky and around the world a Happy New Year...\n\nShana Tova! #RoshHashanah", "2019-09-29T20:18:18.000Z": "The Victim Advocate Support Service program will ensure that victims are immediately connected with trained professionals who will be available during every step of the process. #WeAreKY", "2019-09-29T20:17:57.000Z": "#ICYMI : Grateful to @TheJusticeDept for partnering with the @kystatepolice to ensure that every single state police post in the Commonwealth has a trained advocate that can provide compassionate care and essential resources to victims of crime...", "2019-09-29T17:28:31.000Z": "There is HOPE and HELP for those struggling with substance use disorder... #WeAreKY Welcome to Hope and Help KY Van Ingram, Executive Director for the Kentucky Office of Drug Control Policy, welcomes you to hopeandhelpKY.com, a new website providing hope and help to th... youtube.com", "2019-09-28T19:29:00.000Z": "Enjoyed spending time with these students from @panthersCES this week...\n\nExcited for the future of Kentucky! #WeAreKY", "2019-09-28T14:40:14.000Z": "#ICYMI : It is easy to aspire to be \"carbon free\" when we're sitting comfortably in rooms powered by fossil energy \n\nWatch my keynote address from the @SSEnergyBoard Annual Meeting, here: Southern States Energy Board: Keynote Address Gov. Bevin delivers the keynote address of the 2019 Southern States Energy Board Annual Meeting. youtube.com", "2019-09-28T02:14:42.000Z": "I am calling upon the men of Kentucky to step up and be bold leaders in the lives of the children they parent, coach, teach, and mentor... #WeAreKY", "2019-09-28T02:12:45.000Z": "There's an undeniable correlation between the presence of fathers in the lives of our children and how our children are able to succeed as they grow into adults...", "2019-09-27T21:29:51.000Z": "Last minute weekend plans? Check out our Governor's Guide to the weekend or visit http:// bit.ly/2zTwGCo ! #KYShines", "2019-09-27T15:20:15.000Z": "Grateful for the opportunity to address today's Fatherhood Summit, and for the hundreds of non-profit representatives, law enforcement officers, legislators, and faith-based leaders who are willing to come together to chart a course for the future of fatherhood. #WeAreKY Quote Tweet chfsky @CHFSKy At Fatherhood Summit, @GovMattBevin explains why keeping Kentucky's families intact is so important.", "2019-09-27T00:50:37.000Z": "Spent the day speaking with veterans, senior citizens & elected officials from across Kentucky\n\nFrom east to west, w/very little dissent, they stand firmly with @POTUS , @realDonaldTrump KY is proud of a leader who STANDS TALL for America in the face of idiocy from all sides", "2019-09-26T22:54:09.000Z": "Sun slowly going down on another beautiful day in Kentucky...", "2019-09-26T22:22:14.000Z": "BIG NEWS today for Kentucky! #WeAreKY UPS creating 1,000 high-paying jobs with $750 million investment More details on the projects will be shared next week. bizjournals.com", "2019-09-26T21:25:04.000Z": "We are grateful to local officials across the Commonwealth and @KYTC for working together to identify priority projects that enhance safety and economic opportunity... #WeAreKY", "2019-09-26T21:24:31.000Z": "Excited to announce more than $120,000 today in discretionary funds to the City of Crittenden, which will be used to advance infrastructure in their community...", "2019-09-26T20:53:22.000Z": "Grateful to Jeff and Pennie Dunaway,  Grant CJE Chuck Dills, Mayor Camilla \"Kay\" Patton, and the great folks of Crittenden for the warm welcome to town earlier today... #WeAreKY", "2019-09-26T16:27:00.000Z": "Huge turnout for the Grant  County Senior Bash...\n\nIncredible things happening in the community as the economy is BOOMING thanks to the investments made by the ... @ArkEncounter  and the great work of Grant County CJE, Chuck Dills, and other local officials... #WeAreKY", "2019-09-26T15:40:02.000Z": "The newly-launched #HopeandHelpKY website features powerful testimonials of hope & links to real-time access to help through Kentucky-based addiction treatment providers...\n\nIf you or a loved one are struggling w/ addiction, please visit today > > > http:// hopeandhelpky.com", "2019-09-26T15:30:03.000Z": "Germaine Dunn knows firsthand that there is HOPE and HELP for those struggling with substance use disorder... #HopeandHelpKY Germaine Dunn, Harrodsburg, KY - Overpowered Addiction Germaine Dunn shares his inspiring testimony of a life in addiction, its terrible consequences, and his new life in recovery that allows him to \"never look b... youtube.com", "2019-09-25T23:15:42.000Z": "Today we wrapped up the @SSEnergyBoard Annual Meeting...\n\nGrateful to all who participated in meaningful discussions about the  future of affordable energy. #SSEB19", "2019-09-25T18:43:31.000Z": "On this last Wed. of September, the 1st official \"Day of Prayer for Kentucky Students,\" I pray for Kentucky students what I pray for my own children: \n\nThat you will know the difference between what is right & wrong, & that you'll have the courage to do the right thing. #WeAreKY", "2019-09-25T14:57:21.000Z": "#ICYMI : The long-anticipated William Thomason Byway extension will provide enhanced safety, access and economic opportunity for this region of the state > > > After accidents and gridlock, central Kentucky town closer to better bypass \"We're doing what's right with your money,\" the governor said. \"Simple as that.\" wdrb.com", "2019-09-24T21:25:15.000Z": "I joined @GovStitt and @GovernorGordon today to talk about these issues and more at the @SSEnergyBoard Annual Meeting. #SSEB19 See our joint comments to the press in the video below: Gov. Bevin: The Future of Energy Gov. Bevin addresses media alongside Gov. Stitt and Gov. Gordon during the Southern States Energy Board Annual Meeting. youtube.com", "2019-09-24T21:23:55.000Z": "We must have an honest conversation to ensure that our abundance of energy remains reliable and affordable. \n\nThis is crucial to securing capital and new businessand further growing our economy. #SSEB19", "2019-09-24T21:23:28.000Z": "It is easy to aspire to be \"carbon free\" when we're sitting comfortably in rooms powered by fossil energy \n\nInformed, experienced voices and verifiable facts must take precedence over emotions and wishes. #SSEB19 Southern States Energy Board: Keynote Address Gov. Bevin delivers the keynote address of the 2019 Southern States Energy Board Annual Meeting. youtube.com", "2019-09-24T19:00:51.000Z": "Blessed by the wisdom and vast life experience that proven leaders like @EnergyDepSec , Dan Brouillette, are applying on behalf of the American people at @ENERGY", "2019-09-24T18:28:08.000Z": "Another remarkable Kentucky native, @ScottPruittOK , former AG for Oklahoma and former Administrator for the @EPA addressing the 59th Annual Meeting of the @SSEnergyBoard ...", "2019-09-24T17:25:55.000Z": "Proud to be hosting Kentuckian, ... @FERC  Chairman, ... @FERChatterjee here at the 59th Annual Meeting of the ... @SSEnergyBoard As Chairman of the ... @SSEnergyBoard , I believe that informed, experienced voices & verifiable facts take precedence over emotions & wishes", "2019-09-24T14:31:30.000Z": "Great morning session at #SSEB19 with @GovStitt and @GovernorGordon ...", "2019-09-24T11:46:06.000Z": "Good morning, Kentucky!\n\nMake it a great day!", "2019-09-23T21:17:54.000Z": "Honored to welcome the Southern States Energy Board to Kentucky for the SSEB's Annual Meeting... #WeAreKY  #SSEB19", "2019-09-23T19:17:17.000Z": "Was a great privilege to spend yesterday at #HowdyModi with 2 great world leaders, @POTUS , @realDonaldTrump and @PMOIndia , @narendramodi Incredible opportunity lies before us...Two great Republics with leaders democratically chosen by \"We the People\"...\nUnlimited upside ahead!", "2019-09-23T16:04:16.000Z": "Happy #FirstDayofFall , Kentucky! #WeAreKY", "2019-09-22T20:08:21.000Z": "Staff Sgt. Daniel P. Keller was ready to answer the call of history...\n\nBecause of his truly heroic behavior, many lives were saved.\n\nHonored to be part of this month's ceremony as he received the Air Force Cross, the nation's 2nd highest medal for combat valor ... #WeAreKY", "2019-09-22T16:20:51.000Z": "Excited to be at Howdy, Modi alongside @POTUS  @realDonaldTrump to welcome Prime Minister @narendramodi to America in Houston... Howdy, Modi on Facebook Watch Howdy, Modi was live. facebook.com", "2019-09-21T21:09:27.000Z": "Last night, I was honored to join the Whitley County community to celebrate the heroism of three first responders, who pulled an Emlyn woman from her burning home in July, saving her life... #WeAreKY", "2019-09-21T16:05:23.000Z": "If you've not been to Pikeville in recent years, you need to come check it out!\n\nNew economic activity is bringing enthusiasm and excitement to this town, and many other communities across the state...\n\nKentucky keeps moving forward! #WeAreKY", "2019-09-21T00:28:59.000Z": "On National #POWMIA Recognition Day, we honor the sacrifices and memories of those who were prisoners of war, and those who are still missing in action... #NeverForgotten", "2019-09-20T23:34:08.000Z": "A picture perfect Friday night for football here in God's country... #WeAreKY", "2019-09-20T20:11:58.000Z": "House Bill 166 designates the last Wednesday of every September as a Day of Prayer for Kentucky Students, and I was honored to ceremonially sign the bill today at South Laurel High School among some incredible students and faculty... #WeAreKY", "2019-09-20T16:05:13.000Z": "\"Being 17, a forever family is something I would want, a forever family would be amazing.\"\n\nNick is an incredible young man, and he is waiting for a family just like yours! #AdoptKY  #WeAreKY Wednesday's Child: Some of Kentucky foster care's oldest children not giving up hope for forever... Nearly 8-percent of children in Kentucky's foster care system are about to turn 18-years-old. That transition period can be one of the biggest challenges in child welfare. wlky.com", "2019-09-19T22:42:10.000Z": "Visit http:// HopeandHelpKY.com today! #WeAreKY  #HopeandHelpKY", "2019-09-19T22:41:08.000Z": "This week, more than 300 Kentuckians who are winning their battles against addiction joined us in Frankfort to celebrate recovery...\n\nKentucky is standing united to deliver both HOPE & HELP to families & communities as we work together to break the cycle of addiction. #WeAreKY", "2019-09-19T14:56:53.000Z": "Great crowd last weekend for Hometown Rising, and great job by the @KyVenues team!\n\nTwo more exciting weekends of music festivals ahead... #WeAreKY Hometown Rising draws big crowds, boosts confidence in 2 upcoming festivals More than 70,000 people flooded the fairgrounds at the Kentucky Expo Center over the weekend for the inaugural Hometown Rising country music festival. wlky.com", "2019-09-18T22:30:00.000Z": "Since launching last year, more than 130 Kentuckians have participated in @kystatepolice 's Angel Initiative...\n\nPrograms like the Angel Initiative are transforming the lives of Kentuckians and our communities... #WeAreKY More than 130 battling addiction taking advantage of Kentucky State Police Angel Initiative Kentucky State Police are seeing results in their efforts to get people to turn over their drugs and get help. wkyt.com", "2019-09-18T19:42:27.000Z": "Since 1947, the @usairforce has helped protect and defend America...\n\nTo all who have served or are currently serving: thank you. #ThisIs72  #HBDUSAF", "2019-09-18T12:02:09.000Z": "The world has lost one of the finest men to ever live\n\nIn the course of a lifetime, a person would be fortunate to ever meet someone of the combined intellect, generosity, humility and all around caliber of David A. Jones\n\nHe was a true giant among men... Humana founder and Louisville business titan David Jones Sr. dies David Jones Sr., who once didn't have two dimes to rub together, helped found a company that is now a health insurance colossus worth $37 billion courier-journal.com", "2019-09-17T23:21:08.000Z": "Exciting news for @corning in Harrodsburg! #KYMakes  #WeAreKY Quote Tweet Cabinet for Econ Dev @CEDkygov Great news for @corning , a precision glass supplier for iPhone, Apple Watch & iPad! @Apple today announced Corning will receive $250 million from Apple's Advanced Mfg. Fund, following up a $200 million award from the same fund Corning received in 2017: https:// apple.co/2mh6b7C Show this thread", "2019-09-17T21:57:56.000Z": "Announced more than $100,000 in discretionary road funds for the City of Liberty this afternoon...\n\nAlways great to be in Casey County! #WeAreKY", "2019-09-17T15:41:51.000Z": "''Tis the season...\n\nPlease be bother patient and careful on Kentucky's rural roads as crops are moved (safely, but slowly at times) from the fields to the markets...\n\nWe are blessed to live in the land of plenty...  #WeAreKy", "2019-09-17T14:54:56.000Z": "The crowd included Kentuckians in recovery, family members of those affected by SUD and advocates who gathered together to celebrate recovery & hope in the face of this nationwide epidemic. \n\nThere is hope and help for those struggling with addiction > > > http:// hopeandhelpky.com", "2019-09-17T14:52:42.000Z": "Hundreds of Kentuckians celebrated at the Capitol yesterday, united with a single message: there is hope and help for those struggling with substance use disorder. #WeAreKY  #HopeandHelpKY", "2019-09-16T21:06:36.000Z": "Looking forward to being in Casey County tomorrow afternoon...Join us! #WeAreKY", "2019-09-16T14:47:43.000Z": "Read more, here: https:// bit.ly/2kjRgZL (3/3)", "2019-09-16T14:47:16.000Z": "The Beshears & Conway carefully negotiated the settlement to ensure that the lawyers were paid $4M in full, while Kentucky had to wait 8 years to get its full payment. \n\nPurdue's announced bankruptcy now jeopardizes the paltry remaining money that Kentuckians are due. (2/3)", "2019-09-16T14:46:50.000Z": "Kentuckians woke up this morning to find that they had once again been fleeced by the self-serving corruption of Steve and Andy Beshear and Jack Conway. \n\nThe crooked $24 million settlement with Purdue Pharma is even more crooked than we thought. (1/3)", "2019-09-16T14:15:41.000Z": "Crowd starting to gather for the celebration of ... @MarathonPetroCo 's designation as the 14th ever VPP certified employer in Kentucky history...A huge accomplishment that speaks volumes about the priorities of safety and health for ... @MarathonPetroCo  employees!", "2019-09-16T11:35:01.000Z": "Good morning, KY!", "2019-09-15T23:31:23.000Z": "Are you, or a loved one, struggling with substance use disorder? You can find IMMEDIATE treatment openings near you by visiting http:// findhelpnowky.org ! #WeAreKY", "2019-09-15T18:46:56.000Z": "Join us tomorrow at the Capitol as we celebrate HOPE and HELP for those suffering from a substance use disorder...\n\nThe Walk for Recovery begins at 2:30 pm...\n\nUnited, we CAN put an end to the opioid epidemic. #WeAreKY", "2019-09-14T17:14:50.000Z": "Nucor's most recent investment in Kentucky is an exciting example of how this company, and this state, continue to grow and THRIVE.\n\nKentucky's momentum continues to build... #WeAreKY", "2019-09-14T13:27:18.000Z": "Truman's is an innovative startup company offering a business model of sustainability for the cleaning supplies industry. We are proud to have this venture in KY , as it promises to be a great opportunity for the Louisville community & its workforce > > > https:// bit.ly/2mcPOcc", "2019-09-13T20:11:36.000Z": "When history called on Staff Sgt. Daniel P. Keller to step up, he answered the call...and because of his courage many lives were saved.\n\nHonored to be part of today's ceremony as he received the Air Force Cross, the nation's 2nd highest medal for combat valor ... #WeAreKY", "2019-09-13T15:46:20.000Z": "The @IgniteAtRIC project is an incredible example of public/private collaboration...\n\nThanks to @Boone_County , @Toyota , @KyEdWorkforce , @KyDeptofEd and all community partners who made this tuition-free #STEAM public ed center a possibility for NKY students... #WeAreKY", "2019-09-12T18:08:17.000Z": "We are grateful to the federal @TheJusticeDept for partnering with us on the Victim Advocacy Support Service program, and I am confident that this initiative will allow us to better serve and support crime victims who need it most.", "2019-09-12T18:07:11.000Z": "Proud of @kystatepolice for leading the charge to ensure that every single state police post in the Commonwealth has a trained advocate that can provide compassionate care and essential resources to victims of crime > > > https:// bit.ly/2kJZIBR  #WeAreKY", "2019-09-12T15:00:05.000Z": "#ICYMI : Last week, @RepHalRogers and I joined @WYMT to talk about @SOAR_EKY , economic development in Eastern Kentucky and more... Issues and Answers: Governor Matt Bevin and Congressman Hal Rogers They covered a variety of topics Friday in Pikeville during the SOAR Summit. wymt.com", "2019-09-11T21:23:11.000Z": "This crooked deal by @kyoag and company is one of the biggest frauds ever committed on Kentuckians...\n\nDeeply troubled that Kentucky is forced to stand helplessly by as more than 20 states receive a settlement worth approx. $12B with Purdue Pharma, makers of OxyContin...", "2019-09-11T19:15:02.000Z": "Congratulations to @USAmbUN who was sworn in last night in the Oval Office by @VP after intro by @POTUS ...We are proud to have this wise and gracious Kentuckian representing our nation on the world stage...", "2019-09-11T19:01:41.000Z": "\"We felt the building move...we saw the flames and metal go by our windows.\" \n\nWatch Finance Sec. Landrum share his firsthand account of being in the Pentagon when Flight 77 crashed into the corridor beside him > > > https:// youtube.com/watch?v=ToHCe1 bvbeY&feature=youtu.be   #NeverForget  #911Anniversary Sec. William Landrum III recalls his 9/11 encounter Kentucky Personnel Cabinet youtube.com", "2019-09-11T13:52:43.000Z": "As we honor #911Anniversary and the loved ones lost, may we resolve to #NeverForget the courage, unity and love that emerged from the rubble. \n\nWe are ALL Americans. \n\nAnd we are strongest when we stand united.", "2019-09-10T21:53:02.000Z": "The #USMCA will strengthen our economy and support American families\n\nKentucky is grateful for @POTUS  @realdonaldtrump 's leadership in modernizing NAFTA, and it is time to ratify this trade agreement... #USMCANow", "2019-09-10T19:14:19.000Z": "Kentuckians deeply value the sanctity of human life and our administration will CONTINUE to defend the inalienable rights of unborn children at every opportunity!", "2019-09-10T19:14:04.000Z": "We are proud to join a 19-state coalition in filing an amicus brief to support North Carolina's 20-week abortion ban > > > https:// bit.ly/2lOH63y  #WeAreKY  #ProLife", "2019-09-10T16:23:51.000Z": "Congratulations to the talented winners of the 2019 Governor's Awards in the Arts... #WeAreKY", "2019-09-10T01:53:54.000Z": "Phil Shepherd openly & publicly supports @AndyBeshearKY at the exact same time that he's the judge ruling on lawsuits brought to his courtroom by Beshear\n\nShepherd's clear conflict of interest & his refusal to recuse himself, undermines the confidence of Kentuckians in our courts", "2019-09-10T01:51:23.000Z": "With his blatant partisan support for Democrats (including multiple \"on the record\" examples via social media in the past several years), Franklin Circuit judge, Phil Shepherd, is making a mockery of the judicial system in Kentucky...", "2019-09-09T21:48:12.000Z": "Grateful to @RepHalRogers for his partnership in securing AML Pilot Grants that will not only help with this park's expansion, but will assist multiple economic development projects in the region. #WeAreKY Read more about these grants, here: https:// bit.ly/2lHL7ah", "2019-09-09T21:47:39.000Z": "We had a great time exploring some scenic Knott County trails this weekend...\n\nThe Knott County Mine Made Adventure Park is MADE for outdoor lovers! #WeAreKY", "2019-09-09T15:31:28.000Z": "Abigail Gay, the current Kentucky High School Rodeo Queen, has a message for Kentucky middle and high school students: \n\nIf you love horseback riding or rodeo events, you should definitely check out Kentucky's @OfficialNHSRA program > > > https:// facebook.com/kyhsra/", "2019-09-08T19:55:30.000Z": "Family-owned businesses like Mitchell's Chili, which began in 1929, are the heart and soul of Kentucky communities... #WeAreKY Gov. Bevin Visits Mitchell's Chili Gov. Bevin visits Mitchell's Chili in Barbourville. youtube.com", "2019-09-08T16:45:46.000Z": "#ICYMI : Last week, I joined @RepHalRogers to announce more than $34 million in AML Pilot Program investments for 20 economic development projects across Eastern Kentucky... $34.4 million announced for economic development, job creation in Eastern Kentucky 20 large grants totaling $34.4 million were announced at the 2019 Shaping Our Appalachian Region (SOAR) Summit in Pikeville Friday morning. wymt.com", "2019-09-07T18:11:22.000Z": "Kentucky continues moving forward! #WeAreKY Read more about these federal grants, here: https:// bit.ly/2kx5ner", "2019-09-07T18:11:10.000Z": "#ICYMI : This week, I joined @RepHalRogers to announce more than $7M in federal funding that will be used to benefit residents of Martin County\n\nGrateful for these significant investments, which will expedite water system improvements/spur new econ opportunities in Eastern KY.", "2019-09-07T14:56:20.000Z": "This is a testament to the strong economic growth resulting from Kentucky's business-friendly practices...\n\nWe congratulate United Systems and Software on this milestone and look forward to future successes > > > https:// bit.ly/2lBKwH8", "2019-09-07T00:25:21.000Z": "The end of another day in paradise...So blessed to be a Kentuckian...So blessed to be an American...  #WeAreKY", "2019-09-06T21:45:11.000Z": "Looking for a fun day out with your friends and family? Bring your ATV and join me tomorrow at the Mine Made Adventure Park in Knott County to ride the trails!\n\nThe event begins at 8 am > > > https:// facebook.com/events/1330464 997091506/ ", "2019-09-06T17:58:18.000Z": "Grateful to @RepHalRogers and the entire KentuckyWired team for their tireless work to bring broadband access not only to the 39 Eastern and Southeastern Kentucky counties in the 1B and 2 rings, but to the other 81 Kentucky counties as well... #WeAreKY", "2019-09-06T17:57:36.000Z": "With construction of the 1B and 2 rings complete, Eastern Kentucky is poised to benefit from the economic opportunities and growth that are possible with access to high-speed broadband.", "2019-09-06T17:57:14.000Z": "Today, we are excited to announce the continued forward progress of the KentuckyWired project under our administration...", "2019-09-06T15:37:19.000Z": "Coming Up: Joining @RepHalRogers at annual @SOAR_EKY Summit to announce a major KentuckyWired milestone! \n\nTune in, here > > > SOAR Summit 2019 Watch: Several big announcements were made at the Shaping Our Appalachian Region Summit in Pikeville this morning. Read More >> http://bit.ly/2ZRvw6q facebook.com", "2019-09-06T15:24:09.000Z": "These funds will assist the region'\u0080\u0099s communities in providing vital healthcare access, workforce training, infrastructure development, tourism enhancement, and economic opportunity.", "2019-09-06T15:23:38.000Z": "Excited to join @RepHalRogers today in announcing more than $34 million in AML Pilot Program investments for 20 economic development projects across Eastern Kentucky! #SOAR19  #WeAreKY", "2019-09-06T13:15:03.000Z": "Back stage with local, state and federal elected officials as we kick off the #2019Soar Summit in Pikeville, KY...Great things happening!", "2019-09-06T13:07:01.000Z": ". @SOAR_EKY is live NOW > > > SOAR Summit 2019 Watch: Several big announcements were made at the Shaping Our Appalachian Region Summit in Pikeville this morning. Read More >> http://bit.ly/2ZRvw6q facebook.com", "2019-09-06T12:40:20.000Z": "Unable to attend today's @SOAR_EKY Summit in Pikeville? @WYMT will be streaming it live, beginning at 9 am! WYMT | Eastern Kentucky News WYMT | Eastern Kentucky News wymt.com", "2019-09-06T12:28:38.000Z": "A patchwork quilt of fog lies loosely over the rolling green hills and fields and scattered villages of Kentucky... \n\nAnother beautiful day dawning in paradise...", "2019-09-06T11:24:28.000Z": "Grateful for all those who are responsible for the lights that came on in my home this morning...Starts with our coal miners, upon whom the success of the industrial revolution was built in America and who still fuel 80% of Kentucky's low-cost electricity... #WeAreKY", "2019-09-06T02:20:12.000Z": "Our hearts break tonight for the wife and children of the young miner who was killed today in a tragic accident in Western KY...\n\nWe often take for granted what it takes for us to power our 21st century lifestyles...\n\nWe shouldn't... Name of miner killed in western Kentucky coal mine released His fellow miners carried him back to the surface, where they were met by emergency crews. The miner was pronounced dead around 4:45 p.m. wymt.com", "2019-09-05T19:26:02.000Z": "Learn more about these significant investments through the Abandoned Mine Lands (AML) Pilot Program and the @USACEHQ , here: https:// bit.ly/2kx5ner", "2019-09-05T19:24:32.000Z": "Excited to join @RepHalRogers today in announcing more than $7M in federal funding to benefit residents of Martin County...\n\nThese significant investments will expedite critical water system improvements and spur new economic opportunities for Eastern Kentucky families.", "2019-09-05T14:30:19.000Z": "Good morning from Kentucky's Capitol! #WeAreKY  #KYShines", "2019-09-04T22:32:43.000Z": "Americans are standing united against the opioid epidemic...\n\nGrateful to @POTUS and @HHSGov for this significant investment in Kentucky as we work together to end this scourge... #WeAreKY Quote Tweet Leader McConnell @senatemajldr Kentucky is leading the national response to the devastating opioid epidemic, and the federal resources ($31.48 Million for KY) announced today will reinforce their life-saving work. https:// mcconnell.senate.gov/public/index.c fm/pressreleases?ID=FC5E3BF1-FDD2-4910-8176-630FF54978C9 ", "2019-09-04T18:35:10.000Z": "TODAY > > > Joined @Intuit and @SYKES_US_Canada to announce 300 full-time jobs in Hazard!   \n\nThis is an incredible announcement for the workforce in Southeastern Kentucky...Our economy keeps moving forward! #WeAreKY", "2019-09-04T15:57:14.000Z": "Great progress being made on the KY Hwy. 15 corridor in Perry County where today we announced another 300 great jobs with a GREAT American company, @Intuit Grateful for the amazing partnership between them and Sykes & the local community that made this possible", "2019-09-04T03:00:57.000Z": "Today our family & our commonwealth lost a dear friend, retired ... @kystatepolice  Trooper & fmr member of the Executive Security Detail, D. Loren Holliday\n\nNo words exist to fully describe the heartbreak felt tonight by so many of his friends & family Former trooper identified in deadly head-on crash on the Hal Rogers Parkway A pick-up truck and a semi-truck wrecked Tuesday afternoon at mile marker 24. wymt.com", "2019-09-03T21:05:47.000Z": "By standing united with one mind, we CAN find meaningful solutions to end human trafficking and reform foster care across the United States...\n\nJoin the national, bipartisan One Mind movement by emailing onemind@ky.gov today! #OneMindConf", "2019-09-03T21:05:17.000Z": "We cannot afford to be apathetic.\n\nLast month, First Lady Glenna Bevin and I welcomed hundreds of state leaders, business executives, nonprofit organizations, and private individuals from across the country to Louisville for #OneMindConf ...", "2019-09-03T16:52:00.000Z": "Last week, I was honored to ceremonially sign multiple bills, including HB 64, HB 118, HB 130 and SB 30Thanks for helping Kentucky continue moving forward!\n \nLearn more about these bills, here: https:// tinyurl.com/y3o5vses  #KYGA19  #WeAreKY", "2019-09-03T00:26:57.000Z": "A quiet Labor Day evening in Frankfort was shattered by a tragedy unfolding in an east side park... @kystatepolice are assisting local law enforcement to get answers and provide security\n\nMultiple casualties resulting from a dispute...More details as they are known #PrayForPeace", "2019-09-02T15:19:31.000Z": "To the men and women who keep our economy, and state, moving forward day after day: thank you. \n\nHappy #LaborDay , Kentucky. #WeAreKY", "2019-09-01T17:56:21.000Z": "Check out these young people from Johnson County Middle School, who played a critical role in advancing a new law to protect public health! \n\nIt was an honor to ceremonially sign HB11 alongside this incredible group of students, teachers & admins in Paintsville... #WeAreKY", "2019-09-01T16:03:49.000Z": "#ICYMI : Fibonacci cuts ribbon on $5.8M HempWood manufacturing plant in Calloway County > > > http:// lanereport.com/116395/2019/08 ", "2019-08-31T17:44:00.000Z": "MAJOR ANNOUNCEMENT\n\nThis week, we surpassed more than $21B in new biz investment...more than any previous EIGHT-YEAR. admin has ever seen! \n\nOur policies are working FOR Kentucky families & moving the state forward like never before\n\nThis is only the beginning! #WeAreKY", "2019-08-31T15:21:55.000Z": "Meggitt PLC is creating up to 83 full-time jobs in Danville with a nearly $82.7 million investment > > > https:// lanereport.com/116576/2019/08 /meggitt-to-add-83-jobs-substantially-increase-carbon-brake-manufacturing-capacity-in-danville-with-82-7m-investment/ ", "2019-08-30T21:24:33.000Z": "Congratulations to Fibrotex and the McCreary County community! #WeAreKY  #KYMakes", "2019-08-30T20:28:38.000Z": "Excited to announce more than $5 million in grants to fund critical projects in Kentucky communities...  Proud of @DLG_KY 's  commitment to fund projects that accelerate Kentucky's incredible transformation and continues building on our historic momentum... #WeAreKY", "2019-08-30T13:58:40.000Z": "Fibrotex will create substantial new economic opportunity in Southeast Kentucky, while also providing crucial, high-tech products for our nation's armed forces... #WeAreKY", "2019-08-30T13:58:25.000Z": "Outdoor Venture Corporation has been an integral part of McCreary County's industrial sector for more than 35 years, and it is great to see the company bring another great business to the region.", "2019-08-29T21:48:03.000Z": "Thankful for @Ford and their new $550M investment here in KY\n\nI am grateful for their continued confidence in the incredible work ethic and quality from our @UAW workers at the @FordTrucks Plant\n\nFirst new car I ever bought was a 25th anniversary @FordMustang  icon then and now", "2019-08-29T20:49:49.000Z": "Exciting announcement from @Ford this afternoon as they prepare to launch a new version of the Escape SUV and begin building the Lincoln Corsair this fall > > > Ford to spend $550 million on Louisville plant upgrades The investment is primarily going to Louisville Assembly Plant and makes Ford eligible to collect an additional $40 million in public money as an economic development incentive. wdrb.com", "2019-08-29T16:02:38.000Z": "If @kyoag Andy Beshear feels that he and his office are not competent to fight against the opioid manufacturers, he can still hire outside counsel, but he must do it legally. (5/5)", "2019-08-29T16:02:24.000Z": "With today's ruling, Andy Beshear can no longer engage in this type of soft corruption and will be subject to the same procurement laws and financial oversight as other state agencies. (4/5)", "2019-08-29T16:01:54.000Z": "If allowed to continue, that practice could take millions of dollars away from Kentuckians who need it most and put it in the pockets of Andy's largest campaign contributors. (3/5)", "2019-08-29T16:01:26.000Z": "As @kyoag , Andy Beshear claimed that he is above the law and attempted to put his campaign donors ahead of the interest of Kentuckians in ongoing cases with opioid manufacturers. (2/5)", "2019-08-29T16:01:12.000Z": "The Supreme Court of Kentucky today unanimously held that Andy Beshear broke the law in awarding outrageous, uncapped state legal contracts to his friends and campaign donors.  (1/5)", "2019-08-28T23:36:51.000Z": "Yesterday, I ceremonially signed Senate Bill 84, which establishes licensing standards and procedures for Certified Professional Midwives (CPM) in Kentucky.\n\nLots of support for this bill from all ages...  #WeAreKY", "2019-08-28T20:06:46.000Z": "#ICYMI : @POTUS  @realdonaldtrump returned to Kentucky last week and directed the @usedgov to eliminate student loan debt for permanently disabled American veterans Gov. Bevin praises Trump for easing student loan debt for disabled... Kentucky Republican Gov. Matt Bevin says he was honored to join the president for the announcement and responds to a complaint from the Kentucky Democrat Party on donations to his reelection campaign. video.foxnews.com", "2019-08-28T14:20:38.000Z": "The @KYBloodCenter is back at the Capitol until noon...\n\nStop by and save a life today  > > > http:// bit.ly/2ngPcND  #WeAreKY Give Life: Kentucky Blood Center How would you like to potentially save not just one, but up to three lives - just by donating a single pint of blood? The time it takes to donate is very sma... youtube.com", "2019-08-28T00:43:54.000Z": "Day is done...\nGone the sun... #WeAreKY", "2019-08-27T22:13:18.000Z": "Kentucky stands with @Israel", "2019-08-27T19:11:33.000Z": "Kentucky condemns the #BDS movement and refuses to tolerate boycott-related tactics used to threaten the sovereignty and security of @Israel or other allies of the United States...", "2019-08-27T19:10:40.000Z": "In 2018, we exported nearly $32 billion in goods and services around the world. The Commonwealth benefits from open trade with other nations, including @Israel ...", "2019-08-27T19:09:45.000Z": "I am honored to ceremonially sign SB 143... \n\nThis law codifies the Executive Order signed in 2018 prohibiting state agencies to contract with businesses or entities that boycott our trading partners...", "2019-08-27T15:10:07.000Z": ". @HempWood_ is developing a product unlike anything else on the market, and we are grateful they have selected the commonwealth for this innovative venture...\n\nCongratulations to Fibonacci LLC and the Calloway County community! #WeAreKY  #KYMakes", "2019-08-27T03:20:12.000Z": "Great announcement today from @POTUS at #G7Summit ...\n\nLooking forward to the additional opportunities this trade deal will bring to ...@ThinkKentucky and our longtime trading partner, Japan... G-7 summit: Trump strikes 'billion-dollar' trade deal with Japan Two of the world's countries with the largest GDP have agreed to a trade deal they plan to confirm at the U.N. General Assembly in September. foxbusiness.com", "2019-08-26T21:08:17.000Z": "Live now with @terrymeiners on @840WHAS ...Join us! NewsRadio 840 WHAS - Kentuckiana's News, Weather & Traffic Station Louisville's News Radio 840 WHAS. whas.iheart.com", "2019-08-26T15:24:38.000Z": "Call 800-232-KIDS or visit https:// prdweb.Chfs.Ky.Gov/kyfaces to learn more about adopting from @CHFSKy 's KAPE program! #AdoptKY  #WeAreKY", "2019-08-26T15:20:29.000Z": "Watch this video, and I am sure you will agree: Ethan is an incredible young man.\n\nAre you the forever family he has been waiting for? #AdoptKY Wednesday's Child returns to WLKY, continuing tradition of helping children in foster care find... For nearly 40 years WLKY and Wednesday's Child have brought you stories featuring Kentucky children waiting to be adopted. We're thrilled to now continue that tradition. wlky.com", "2019-08-25T18:02:01.000Z": "Last week, hundreds of Kentuckians joined us at #UnitingKentucky / @FocusFamily  #WaitNoMore events and began the process of registering to become foster and/or adoptive parents\n\nFind out how YOU can join them and be part of the solution> > > https:// bit.ly/2MAK340", "2019-08-25T18:00:46.000Z": "THIS IS DOABLE!\n\nOut of more than 4 MILLION people, I am confident that we can find forever families for the over 2,000 kids who are ready for adoption in Kentucky! #YOUniteKY  #AdoptKY  #FosterKY  #WeAreKY", "2019-08-25T02:07:13.000Z": "Getting ready to present the winning trophy to the $100,000 champion in the Five Gaited World's Grand Championship at Freedom Hall on a picture perfect final night at the ...... @kystatefair  #WeAreKY", "2019-08-24T18:07:58.000Z": "We are abundantly grateful for the sacrifices members of our military have made, and we look forward to seeing the incredible effect this will have on our nation's heroes and their families.", "2019-08-24T18:07:11.000Z": ". @POTUS  @realDonaldTrump returned to Kentucky this week to make an exciting announcement, directing the @usedgov to eliminate student loan debt owed by permanently disabled American veterans President Trump Makes Historic Announcement in Louisville President Trump attends the 75th annual AMVETS National Convention in Louisville, Kentucky. youtube.com", "2019-08-24T16:20:15.000Z": "Planning on visiting the @kystatefair this weekend? For a daily schedule of events, check out > > > https:// kystatefair.org  #WeAreKY", "2019-08-23T19:27:26.000Z": "Grateful for the opportunity to meet with these Monroe County community members and servant leaders today... #WeAreKY", "2019-08-23T15:24:44.000Z": "Thank you to the Monroe County Extension Office for hosting this morning's cabinet meeting in Tompkinsville! #WeAreKY", "2019-08-23T03:42:37.000Z": "Grateful for the men and women who do jobs at all hours of the day and night that we pray we never need done on our behalf, and hope will be there if we do... #WeAreKY", "2019-08-23T01:06:41.000Z": "Honored to ceremonially sign HB11 this afternoon alongside an incredible group of students, teachers and administrators at Johnson County Middle School in Paintsville...\n\nThese young people played a critical role in advancing a new law to protect public health! #WeAreKY  #KYGA19", "2019-08-22T20:27:04.000Z": "Excited to join @FOXandFriends this morning to showcase the 2019 @KYStateFair .\n\nIt's not too late to come enjoy the very best of the distinctive sights, sounds and tastes of the Commonwealth! Full details here >> https:// kystatefair.org 2019 Kentucky State Fair Gov. Bevin joined FOX & Friends to showcase the 2019 Kentucky State Fair. youtube.com", "2019-08-22T13:47:39.000Z": "This is what a $1M ham looks like...Great turn out today at the ... @kystatefair  for the ...56th Annual @KYFB  Ham Breakfast... #WeAreKY", "2019-08-22T10:18:11.000Z": "Joining @foxandfriends at approx. 6:30 am...Tune in > > > http:// foxnews.com", "2019-08-22T02:45:09.000Z": "Will join @foxnewsnight at approx. 11 pm tonight...Tune in > > > http:// foxnews.com", "2019-08-21T20:21:40.000Z": "Excited to welcome @POTUS  @realDonaldTrump back to Kentucky as he addressed the 75th Annual @AMVETSHQ National Convention, signing a memorandum that ensures permanently disabled veterans receive the Federal student loan debt discharges they are entitled...", "2019-08-21T17:10:38.000Z": "While you're visiting Health Horizons at the @KyStateFair , make sure to stop by the @CHFSKy booth! #WeAreKY Quote Tweet chfsky @CHFSKy Here is CHFS Secretary @AdamMeier20 giving a tour of our booth at the @kystatefair . Lots of great resources. Watch the full video on our Facebook page: https:// facebook.com/46889266988183 4/posts/2001954516575634?s=100007775675144&v=e&sfns=mo ", "2019-08-21T14:27:38.000Z": "Visiting the @KYStateFair ? Stop by the Health Horizons area in South Wing B for NO-COST health screenings and assessments > > > https:// kystatefair.org/attractions/he alth-horizons/ ", "2019-08-21T00:45:06.000Z": "Daylight fades away at the end of another day in paradise... #WeAreKY", "2019-08-20T22:06:33.000Z": "Just wrapped up a great meeting with coal county judge/executives...  \n\nExcited about the future of economic development in these Kentucky communities...the Commonwealth is moving forward! #WeAreKY", "2019-08-20T19:08:29.000Z": "Nearly 10,000 Kentucky children are in need of safe, loving homes and YOU can be part of the solution...\n\nJoin us in Florence TONIGHT at 6 pm EDT with @FocusFamily ... #YOUniteKY  #WeAreKY", "2019-08-20T12:48:25.000Z": "Live with @wkct and Chad Young now...Join us! http:// talk104fm.com", "2019-08-20T12:32:30.000Z": "Live now on @55KRC w/ Brian Thomas. Join us! Listen to 55KRC Live - Cincinnati's Place For Talk | iHeartRadio Listen to 55KRC Live for Free! Stream News & Talk songs online from this radio station, only on iHeartRadio. iheart.com", "2019-08-20T12:21:46.000Z": "Live now with @TomRoten on @800_WVHU ...Join us! NewsRadio 800 WVHU - Huntington's Home for News Your home for the Tom Roten Morning Show, local news, and weather, NewsRadio 800 WVHU! Catch all your favorites in one place, including Glenn Beck, Rush Limbaugh and Sean Hannity!", "2019-08-19T22:21:53.000Z": "A wonderful non-partisan message!", "2019-08-19T19:04:11.000Z": "#ICYMI : Phoenix Paper is investing $200 million to expand the Wickliffe paper mill by adding a paper recycling facility > > > https:// messenger-inquirer.com/news/local/m-r ecycling-facility-coming-to-ballard-county-mill/article_a9235452-6351-5c54-83c6-9efcd317a959.html ", "2019-08-19T15:53:07.000Z": "While you're checking out the @KYStateFair this week, make sure to visit AgLand for exhibits that highlight Kentucky's farm and field heritage > > > https:// bit.ly/2HeEwMm", "2019-08-18T23:39:53.000Z": "Start the process of becoming a foster parent, or learn how to help support foster families in your community, by attending a @FocusFamily Wait No More event this week! #YOUniteKY  #WeAreKY Learn more about \"Uniting Kentucky,\" here: https:// bit.ly/2Kt47D3", "2019-08-18T20:06:53.000Z": "Every child deserves a safe home and loving family, and YOU can help make that a reality for children across Kentucky!\n\nJoin us next week at a Uniting Kentucky/ @FocusFamily Wait No More event near you... #YOUniteKY  #WeAreKY Wait No More, Kentucky: Uniting Kentucky for Foster Care and Adoption Gov. Bevin invites Kentuckians who are interested in becoming foster parents, or provide support services for foster parents, to attend a Wait No More event ... youtube.com", "2019-08-18T16:01:29.000Z": "MAKE A DIFFERENCE > > > More than 2,000 children are currently eligible for adoption in Kentucky...With your help, each one of them can find a forever family. Visit http:// adopt.ky.gov today! #AdoptKY", "2019-08-17T22:15:58.000Z": "#WeAreKY", "2019-08-17T18:46:55.000Z": "There's so much to see and do at the @KyStateFair , from now until Aug. 25...\n\nDon't miss out on this opportunity to celebrate Kentucky and show your pride in our great Commonwealth! #WeAreKY", "2019-08-17T15:28:57.000Z": "The hearts of many across Kentucky & across our nation grieve with the Jones family today as they mourn the loss of a truly extraordinary wife, mother and grandmother... She blessed the lives of many in ways that have forever changed the course of history Betty Jones, wife of Humana co-founder, dies at 86 Betty Lee Ashbury Jones, wife of Humana founder David Jones, died on Friday, according to a Humana spokesman. courier-journal.com", "2019-08-17T13:46:50.000Z": "The @KyStateFair runs from now until Aug. 25...\n\nYou don't want to miss it! http:// kystatefair.org", "2019-08-16T22:54:52.000Z": "So grateful to live in the land of the free and the home of the brave...", "2019-08-16T20:41:53.000Z": "Excited to announce nearly $3.5M in CDBG funding that will help dozens of families in central, north, east and west Kentucky...\n\nIncreasing safe, affordable housing is vital to strengthening our communities and promoting economic opportunity > > > https:// bit.ly/2ZbA9aS", "2019-08-16T15:59:04.000Z": "We are grateful to @Anixter Inc. for their significant investment and job creation in the Bluegrass State, and we look forward to watching the company continue to grow in the years ahead > > > https:// bit.ly/2YTKNrr", "2019-08-15T18:11:16.000Z": "Come on out to the ... @kystatefair ...Big pumpkins, big watermelons and Elvis...\n\nWhat more could you ask for on a sunny Thursday afternoon? #WeAreKY", "2019-08-15T17:50:57.000Z": "There are many interesting attractions at the @kystatefair , including \"Pride of the Counties,\" which is located in South Wing B > > > https:// bit.ly/2KyhjH0  #WeAreKY", "2019-08-15T15:09:00.000Z": "The 115th @KYStateFair has officially arrived! #WeAreKY", "2019-08-14T23:00:06.000Z": "Congratulations to the Russell County 15U Babe Ruth all-star team, who proudly represented the Commonwealth in the Babe Ruth World Series in North Dakota!  #WeAreKY RUSSELL CO BABE RUTH 15U LOSES TO CALIFORNIA AT WORLD SERIES; THANKS COMMUNITY FOR SUPPORT The Russell Co. 15u Babe Ruth team falls to California in the quarterfinals at the Babe Ruth World Series in North Dakota 8-0. The team finishes in the top 6 in the U.S. with a record ... ridingthewave.com", "2019-08-14T17:53:15.000Z": "We are grateful to @uofl , CommonSpirit Health, & our legislative leadership for their joint efforts to preserve vital healthcare programs, services, & jobs for @uofl , the @uoflmedschool , Metro Louisville, and the entire Commonwealth...", "2019-08-14T17:48:48.000Z": "I am confident that this acquisition will further the incredible medical research occurring at these facilities, while simultaneously meeting the growing demand for quality, cutting-edge healthcare services.", "2019-08-14T17:48:12.000Z": ". @uofl 's acquisition of the CommonSpirit facilities will maintain more than 5,000 jobs in the healthcare sector and ensure that our healthcare delivery system in Metro Louisville is preserved.", "2019-08-14T15:04:13.000Z": "#ICYMI : Yesterday, @ATT announced it would be giving $50K to @JAGnational as part of \"Believe Louisville\" initiative...\n\nCollege and career readiness initiatives like JAG are essential to ensure students have every resource they need to succeed > > > AT&T pledges $200,000 for 'Believe Louisville' initiative The program funds everything from expungement clinics to campaigns to end homelessness. It also aims to level the educational playing field for students. wlky.com", "2019-08-14T01:13:10.000Z": "Swordfish sunset...  #WeAreKY", "2019-08-13T23:05:43.000Z": "Read my joint op-ed with former Gov. Jerry Brown (CA) to learn how the @CouncilonCJ is transcending politics and working with states across the country to reform our criminal justice system > > > The US has barely scratched the surface on criminal justice reform By focusing on facts and finding common ground through this collaborative approach, we can preserve and accelerate progress on an issue that once profoundly divided us. thehill.com", "2019-08-13T19:11:11.000Z": "Honored to ceremonially sign Senate Bill 57 last week, which expands the number of felonies eligible for expungement, providing more second chance opportunities for Kentuckians... #CJReform  #WeAreKY  #KYGA19", "2019-08-13T15:33:34.000Z": "The Kentucky Conference on Leadership and Diversity begins Sept. 18 at the @KYConvention Center...\n\nReserve your tickets today: Kentucky Conference on Leadership and Diversity You're not going to want to miss this! See the incredible lineup of speakers, agenda, and more at leadership.ky.gov. Join the conversation. #KYCOLD19 The Kentucky Conference on Leadership and Dive... kyipmahr-events.ticketleap.com", "2019-08-13T00:30:22.000Z": "Grateful for the incredible investment that @NucorCorp has made (and continues to make) in Kentucky!\n\nA great company led by a great CEO, John Ferriola...\n\nOne of Kentucky's (and America's) finest employers... \n\nAlso grateful for their many suppliers and customers...  #WeAreKY", "2019-08-12T23:30:00.000Z": "#ICYMI : Phoenix Paper is investing $200 million to expand the Wickliffe paper mill by adding a paper recycling facility > > > Local leaders excited about new Phoenix Paper investment Phoenix Paper announces they are expanding their operation in Wickliffe by building a recycling mill. wpsdlocal6.com", "2019-08-12T20:49:41.000Z": "The hypocrisy of the left is astounding.\n\nStates like New York celebrate the \"inhumanity\" of declawing cats...\n\nWhile simultaneously cheering and applauding the ability to kill unborn children. \n\nWatch my interview w/ @foxandfriends below: The Rank Hypocrisy of the Left Gov. Bevin is interviewed on the Fox and Friends morning show, Aug. 11, 2019. youtube.com", "2019-08-12T14:07:42.000Z": "#ICYMI : Bowling Green Eastern LL is going BACK to the Little League World Series! \n\nGood luck, team...  #WeAreKY  #LLWS Quote Tweet Little League @LittleLeague What a moment! Congrats to Bowling Green Eastern LL on earning a trip to the Little League Baseball World Series! #EveryLLMoment  #LLWS  @Honda", "2019-08-12T00:42:16.000Z": "Sun going down on another beautiful day in the Commonwealth... #WeAreKY", "2019-08-11T22:25:19.000Z": "Senate Bill 9, or the Heartbeat Bill, bans abortion after the detection of a fetal heartbeat. \n\nLearn more about Kentucky's Fight for Life, here: https:// kentucky.gov/Pages/Activity-stream.aspx?n=KentuckyGovernor&prId=1010 ", "2019-08-11T17:26:37.000Z": "This week, I ceremonially signed four #KYGA19  #ProLife bills\n\nKentucky is leading the charge in this vitally important fight for the heart and soul of our great nation, and we will continue to advance critical pro-life protections for the most vulnerable among us. #WeAreKY", "2019-08-11T11:35:19.000Z": "Live now on @FoxandFriends ...Join us!", "2019-08-10T18:43:30.000Z": "#ICYMI : Overdose fatalities nearly 15% in '18\n\nWe are extremely grateful to see a significant decline...\n\nWe will continue our strong partnerships as we allocate unprecedented resources to combat this scourge and save lives. #WeAreKY  https:// kentucky.gov/Pages/Activity-stream.aspx?n=Corrections&prId=206 ", "2019-08-10T16:20:23.000Z": "This week, @VP & @HHSGov  @SecAzar visited Manchester alongside @RepHalRogers , announcing more than $9M in federal grants to help combat the opioid epidemic... \n\nWe are grateful for this announcement, which is critical as Kentucky continues the fight to end this scourge. #WeAreKY", "2019-08-09T21:15:38.000Z": "Phoenix Paper has announced they're investing $200 MILLION to build a paper-and-pulp recycling facility in Wickliffe!\n\nKentucky is leading the way in laying the groundwork for future job-creation opportunities between USA & China #WeAreKY BREAKING: Phoenix Paper Announces $200 MILLION Investment in Ballard... Gov. Bevin discusses a recent investment in West Kentucky by Phoenix Paper. youtube.com", "2019-08-09T16:00:45.000Z": "Congratulations to TAZ Trucking,  a company that is truly on the move, and to the Bowling Green region, where we continue to see remarkable progress and job creation > > > https:// bit.ly/2YDnLoC  #WeAreKY", "2019-08-09T01:41:19.000Z": "Today I ceremonially signed four #ProLife bills...\n\nKentucky is leading the charge in this vitally important fight for the heart & soul of our great nation. \n\nLook forward to additional work w/ our strong legislative partners in building on this historic momentum... #WeAreKY", "2019-08-08T22:55:06.000Z": "This announcement from @VP and @SecAzar of additional grant funding for the Commonwealth's opioid response and treatment efforts is critical as we continue the fight to end this scourge... #WeAreKY", "2019-08-08T21:03:17.000Z": "Visited Operation Coal Country this afternoon alongside @VP , @SecAzar , & @RepHalRogers ... @IRTsWin has provided no-cost medical services in EKY & we're grateful to military personnel for their dedication to serving Kentuckians. #WeAreKY", "2019-08-08T19:30:09.000Z": "Grateful to @VP Pence and @SecAzar for announcing more than $9 MILLION in federal funding to continue Kentucky's fight against the opioid epidemic... #WeAreKY Quote Tweet Vice President Mike Pence @VP President @realDonaldTrump and @GovMattBevin have been standing with the people of Kentucky and making real progress since day one. Since President Trump took office, 34% fewer opioids have been prescribed in this country & overdose death has decreased by nearly 5%.", "2019-08-08T17:09:05.000Z": "We are live now > > > http:// facebook.com/govmattbevin Quote Tweet Governor Matt Bevin (2015-2019) @GovMattBevin Join us live on Facebook at approximately 12:45 pm EDT, with @VP Pence and @SecAzar !", "2019-08-08T15:37:16.000Z": "Join us live on Facebook at approximately 12:45 pm EDT, with @VP Pence and @SecAzar !", "2019-08-08T15:03:54.000Z": "Great to see the ... @VP  touching down in London, KY...", "2019-08-07T22:56:22.000Z": "From yesterday's interview on the @guypbenson show and @FoxNewsRadio :\n\nThe history of the world has always called upon good men and women to step up and lead. Gov. Matt Bevin on The Guy Benson Show: \"We're Blessed to be Americ... Gov. Bevin is interviewed by Guy Benson on Fox News Radio. youtube.com", "2019-08-07T20:28:00.000Z": "Enjoyed meeting with The Barkley Regional Airport Board of Directors this morning... #WeAreKY", "2019-08-07T13:45:27.000Z": "Live with @LelandShow on @840WHAS ...Join us! NewsRadio 840 WHAS - Kentuckiana's News, Weather & Traffic Station Louisville's News Radio 840 WHAS. whas.iheart.com", "2019-08-07T01:23:20.000Z": "Last of the day slipping away here in Kentucky...", "2019-08-06T21:54:37.000Z": "Looking forward to welcoming @VP and HHS @SecAzar to Kentucky this Thursday... Quote Tweet Vice President Mike Pence @VP On Thursday, I will be traveling to Manchester, KY to join @GovMattBevin and HHS @SecAzar for a briefing on Innovative Readiness Training as well as deliver remarks on the opioid crisis sweeping our nation.", "2019-08-06T21:17:19.000Z": ". @teamfastrax never disappoints Thanks for dropping in on us today and helping us celebrate the Kentucky Veteran's Hall of Fame!\n\nWe are so grateful for our #veterans ' service- not only to the Commonwealth, but to this great nation.\n\nMay God continue to bless America", "2019-08-06T19:28:44.000Z": "COMING UP: Joining @guypbenson on @foxnewsradio at approx. 3:35 pm EDT > > > https:// radio.foxnews.com/player-files/r adio.php ", "2019-08-06T14:37:51.000Z": "Do you also stand with those who are chanting death threats and calling for the massacre of the @senatemajldr ? Or is there an idealogical limit to the conviction/motivation behind your \"stand\"? Quote Tweet Mayor Greg Fischer @louisvillemayor I stand with those calling on @senatemajldr to return to DC and protect our families from more death. Our people deserve that. Show this thread", "2019-08-06T04:12:22.000Z": "Seriously, @louisvillemayor ? Stop embarrassing the city of Louisville and the Commonwealth of Kentucky by allowing this public disorder...\n\nWould you stand for this on your street? Doubt it... \n\nWe deserve better leadership in @louisvillekygov Quote Tweet Dennis J. Ting @DennisJTing About 20-some people are outside Mitch McConnell's home protesting. Some police out here too but they're standing back. There are also some people standing in front of McConnell's home in front of the protestors. @WHAS11 Show this thread", "2019-08-05T22:14:02.000Z": "We cannot afford to be apathetic. \n\nThis is the beginning of a unified, bipartisan effort to eliminate human trafficking across our nation. We are confident that the solutions discussed at today's summit will transcend party and state lines... #OneMindConf", "2019-08-05T22:12:44.000Z": "Glenna and I are so grateful to the hundreds of state leaders, business executives, nonprofit organizations, and private individuals from across the country who came together today to stand united in ending human trafficking and reforming foster care/adoption... #OneMindConf", "2019-08-05T18:27:15.000Z": "Now @ #OneMindConf > > > Gov. Matt Bevin\n\nUniting as One Mind\n\nWatch here: https:// youtube.com/watch?v=oNawO8 gkVUY ", "2019-08-05T18:11:09.000Z": "Now @ #OneMindConf > > > Jim Daly\n\nOne Foster Child's Story\n\nWatch here: https:// youtube.com/watch?v=oNawO8 gkVUY ", "2019-08-05T17:53:50.000Z": "Now @ #OneMindConf > > > Eric Clark\n\nChild Welfare Belongs to All of Us\n\nWatch here: https:// youtube.com/watch?v=oNawO8 gkVUY ", "2019-08-05T17:35:11.000Z": "Now @ #OneMindConf > > > Dr. Krista Thomas\n\nFamily First Prevention Services Act\n\nWatch here: https:// youtube.com/watch?v=oNawO8 gkVUY ", "2019-08-05T17:11:36.000Z": "Now @ #OneMindConf > > > Lynn A. Johnson\n\nStrong and Thriving Families\n\nWatch here: https:// youtube.com/watch?v=oNawO8 gkVUY ", "2019-08-05T16:46:25.000Z": "Now @ #OneMindConf > > > Andrea Sparks\n\nEnding Child Sexual Exploitation in Texas: Progress, Hope and What We Are Learning So Far\n\nWatch here: https:// youtube.com/watch?v=oNawO8 gkVUY ", "2019-08-05T16:26:35.000Z": "Now @ #OneMindConf > > > Dr. Nikhil Rao\n\nPicking Up the Missing Pieces: Recovering from Childhood Neglect, Abuse and Trauma\n\nWatch here: https:// youtube.com/watch?v=oNawO8 gkVUY ", "2019-08-05T15:25:01.000Z": "Now @ #OneMindConf > > > Dr. Michael Stone\n\nComplications that May Arise\n\nWatch here: https:// youtube.com/watch?v=n8YLbdOid10 ", "2019-08-05T15:05:04.000Z": "Now @ #OneMindConf > > > Craig \"Sawman\" Sawyer\n\nHuman Trafficking at the Border\n\nWatch here: https:// youtube.com/watch?v=n8YLbdOid10 ", "2019-08-05T14:34:16.000Z": "Now @ #OneMindConf > > > Richard Wistocki\n\nUnmasking Sex Trafficking Traps\n\nWatch here: https:// youtube.com/watch?v=n8YLbdOid10 ", "2019-08-05T14:21:11.000Z": "Now @ #OneMindConf > > > Robert Lotter\n\nInternet Crimes Against Children\n\nWatch here: https:// youtube.com/watch?v=n8YLbdOid10 ", "2019-08-05T13:44:04.000Z": "Now > > > Barbara Y. Brown \n\nThe Face of Human Trafficking\n\nWatch here: https:// youtube.com/watch?v=n8YLbdOid10 ", "2019-08-05T13:25:44.000Z": "Now > > > Kat WeHunt\n\nHuman Trafficking: How I Escaped\n\nWatch here: https:// youtube.com/watch?v=n8YLbdOid10 ", "2019-08-05T13:23:25.000Z": "Now > > > Brooke Burris: Why Local Collaboration is Key\n\nWatch here: https:// youtube.com/watch?v=n8YLbdOid10 ", "2019-08-05T13:18:30.000Z": "Now > > > William Edwards: One Mind Can Save Many Lives\n\nWatch here: https:// youtube.com/watch?v=n8YLbdOid10 ", "2019-08-05T13:15:24.000Z": "\"I am confident that at the end of this day, you will be compelled to stand up, and fight for our children. But if we're going to do this, if we're going to do this with excellence, we have to stand as a united front. We cannot do this alone.\" - First Lady Glenna Bevin", "2019-08-05T13:11:15.000Z": "Now > > > Glenna Bevin: One Mind Can Save Many Lives\n\nWatch here: https:// youtube.com/watch?v=n8YLbdOid10 ", "2019-08-05T13:05:08.000Z": "By standing united with one mind, we can find meaningful solutions to end human trafficking  and reform foster care across the United States...\n\nJoin us now LIVE for the #OneMindConference on YouTube > > > https:// youtube.com/watch?v=n8YLbdOid10 ", "2019-08-04T23:49:39.000Z": "Join us tomorrow, beginning at 8:30 am ET, as we stream OneMind: Uniting the States for Our Children, live from Louisville!", "2019-08-04T14:51:37.000Z": "Yet another heartbreaking tragedy unfolded last night in our neighboring state of Ohio...\n\nWe have a cultural and spiritual crisis taking place in America...\n\nTo think otherwise is to turn a blind eye to reality...\n\nMay God heal our land... 'When is enough enough?' Gunman kills 9, injures 27 in Dayton mass shooting Police say 10 were killed, including an armor-clad gunman with extra magazines, in a shooting in Dayton, Ohio's Oregon District early Sunday morning. cincinnati.com", "2019-08-04T00:19:33.000Z": "From the fertile fields of western Kentucky, which happens to be home to the National Quilt Museum in Paducah, to the eastern hills of Kentucky which resemble a Natural quilt of splendorous color and texture...\n\nWe are certainly blessed to be Kentuckians...", "2019-08-03T22:27:35.000Z": "The hearts of Kentuckians break tonight with those of our fellow Americans in Texas...\n\nMay God heal our land... El Paso shooting: 20 people dead, 26 injured, suspect in custody, police say Gov. Greg Abbott called it \"one of the most deadly days in the history of Texas.\" apple.news", "2019-08-03T22:08:30.000Z": "We must continue taking a smarter approach to #CJReform . From \"Banning the Box\" on state employment applications to streamlining apprenticeship programs in our prisons, we are helping Kentuckians find their second chance, while creating safer, stronger communities. #WeAreKY", "2019-08-03T18:45:49.000Z": "We are determined to make Kentucky's foster care and adoption system the gold standard in America. #WeAreKY", "2019-08-03T16:19:00.000Z": "Life is worth fighting for, and this administration will continue fighting with all we have to defend the innocent. #WeAreKY", "2019-08-03T14:31:40.000Z": "View a copy of the brief filed by Gov. Bevin's legal team: Dropbox - Link not found Dropbox is a free service that lets you bring your photos, docs, and videos anywhere and share them easily. Never email yourself a file again! dropbox.com", "2019-08-03T14:31:08.000Z": "\"The General Assembly's passage of HB5 and SB9 shows that Kentuckians value life, and the Bevin Administration will defend these laws to the fullest extent and all the way to the U.S. Supreme Court, if necessary.\" Steve Pitt, General Counsel", "2019-08-02T23:37:50.000Z": "Kentucky keeps moving forward! #WeAreKY", "2019-08-02T15:58:14.000Z": "The council will bring together medical professionals and experts from across the state to work on advancing research, diagnosis, and treatment efforts. \n\nKudos to Sen. Raque Adams and the General Assembly for passing this legislation with overwhelming, bipartisan support! #KYGA", "2019-08-02T15:57:36.000Z": "Honored to ceremonially sign SB16 this morning... \n\nThe creation of the Rare Disease Advisory Council will provide an important mechanism to raise public awareness about rare diseases and develop centralized resources for patients, caregivers, and family members... #WeAreKY", "2019-08-02T01:28:39.000Z": "Kentucky bids farewell and Godspeed to ... @POTUS  , ... @realDonaldTrump  and #AirForceOne ...We'll see you again soon...Thank you for putting America's interests first...", "2019-08-02T00:15:00.000Z": "A rocking' crowd welcoming the arrival of the ... @POTUS  , ... @realDonaldTrump  at the ... @USBankArena ...  #FiredUp", "2019-08-01T22:24:04.000Z": "\"We should all be very excited about the opportunities ahead.\" - @ThinkKentucky Interim Secretary Vivek Sarin Ky. Economic Dev. Official Talks 'Breaking Down Silos' And Building 'Team Kentucky' \"Have you heard the good news?\" asked Kentucky Cabinet for Economic Development Interim Secretary Vivek Sarin to a room of community and economic wkms.org", "2019-08-01T15:52:29.000Z": "Victim identified following massive gas pipeline explosion in Lincoln County Authorities say a massive explosion has killed one person in Lincoln County early Thursday morning. wkyt.com", "2019-08-01T15:50:29.000Z": "Tragic news from Lincoln County following early-morning pipeline explosion\n\nPlease continue to pray for all those affected by both the loss of life & the devastating injuries\n\nGrateful for quick response of all who helped extinguish fires, evacuate, & transport people to hospital", "2019-07-31T22:16:19.000Z": "Congratulations to Kentuckian and dear friend  Kelly Knight Craft, on her confirmation as ...US Ambassador to the @UN ...\n\nKelly is a GREAT American and will serve our nation well in the years ahead just as she has done as ... @USAmbCanada ... Kelly Knight Craft confirmed as Trump's next U.N. ambassador in vote largely on party lines Many Democrats weren't satisfied with Craft's qualifications. washingtonpost.com", "2019-07-31T20:51:32.000Z": "Harlan County Community Action Agency's GoFundMe page can be found, here: Donate To Harlan BlackJewel Coal Miners organized by April Vargas gofundme.com", "2019-07-31T20:50:54.000Z": "With Love from Harlan's GoFundMe page can be found, here: Blackjewel Bankruptcy Victims organized by Jordan Smith Blackjewel LLC, one of the country's largest coal companies, has filed for bankruptcy. Em Jordan Smith needs your support for Blackjewel Bankruptcy Victims gofundme.com", "2019-07-31T20:50:33.000Z": "PLEASE consider showing your support for these families by helping these groups meet and exceed their fundraising goals.\n\nLet's take care of each other. This is what being a familywhat being a Kentuckianis all about. #WeAreKY", "2019-07-31T20:49:56.000Z": "Coal miners in Harlan County NEED our help after BlackJewel Mining left them without jobs and their most recent paychecks\n\nTwo Harlan-based groups are raising money to help these miners pay their bills and more.", "2019-07-31T12:35:11.000Z": "Live now with Greg Dunker on @NewsTalk943 ...Tune in! http:// v6.player.abacast.net/1046", "2019-07-31T12:07:31.000Z": "Live now with Alan Watts on @WKDZ ...Join us! WKDZ Online Web player player.prostreaming.net", "2019-07-31T00:24:59.000Z": "You can register now for @KYPersonnel 's Annual Conference on Leadership and Diversity, featuring Keynote Speaker Tamika Catchings > > > https:// bit.ly/2SQnvN3", "2019-07-30T19:36:54.000Z": "In Nov. 2016, I drove Logan Corp.'s first truck out of their brand new facility... ( http:// bit.ly/2ebaJri )\n\nAs of April 2019, they have made more than 1,000 custom truck beds...and counting!\n\nThis is what bringing opportunity to KY looks like...Congrats, Logan Corp! #WeAreKY", "2019-07-30T15:06:04.000Z": "VOTE NOW to help choose the winner of this year's Beautify the Bluegrass competition...Voting is open until Aug. 5! #beautifyKY Beautify the Bluegrass 2019 Finalists - Kentucky Living [] kentuckyliving.com", "2019-07-29T22:36:00.000Z": "#ICYMI : The U.S. @DeptofDefense , the U.S. Military's Reserve Forces, and @DLG_KY will provide no-cost medical screenings, dental exams, optical exams and one pair of single-prescription glasses at four Eastern Kentucky locations, beginning Aug. 3 > > > http:// bit.ly/2SAVo4j", "2019-07-29T19:52:21.000Z": "Kentucky unapologetically stands for life, and in the end we will prevail, because we stand on the side of right...\n\nWe stand on the side of life. #WeAreKY  #ProLife", "2019-07-29T14:43:03.000Z": "We are training people and investing dollars in programs that will allow people to have jobs back in the counties they come from... \n\nYou watch in a generation from now - this city, London, will be everything Chattanooga is... #WeAreKY Gov. Bevin announces completion of KY 30 Gov. Matt Bevin announced the plan to complete the last stages of KY 30 at the Kentucky Transportation Cabinet Maintenance Garage in London on Friday, saying he is hoping to sentinel-echo.com", "2019-07-28T18:21:57.000Z": "Sixteen states have joined Kentucky in support of HB 454, which bans the brutal and grotesque practice of live dismemberment abortions > > > https:// bit.ly/2GyEpL7  #ProLife", "2019-07-28T14:34:55.000Z": "#ICYMI : We look forward to seeing how this corridor will further accelerate economic growth in Eastern Kentucky and beyond > > > Gov. Matt Bevin, KYTC announce $70M construction project to continue Mountain Parkway expansion Matt Bevin joined local elected officials in Magoffin County today to announce the Kentucky Transportation Cabinet (KYTC) will begin construction in August on the newest segment of the Mountain... news-expressky.com", "2019-07-28T02:26:35.000Z": "As Wolf Steel looks to make its Napoleon products available to even more North American customers, we are proud that they are doing so right here in the commonwealth.\n\nWe look forward to their continued success in the month and years ahead > > > https:// bit.ly/2OCDG2f", "2019-07-28T01:34:37.000Z": "This announcement is great news for the Lyon County community, and we are grateful to Resonate Foods for its commitment to the Bluegrass State > > > https:// bit.ly/2YcjOav", "2019-07-28T00:37:54.000Z": "We are proud to welcome this company to our state, and we are grateful to PatienTech for creating 100 new jobs for our dedicated workforce > > > https:// bit.ly/2JYKliG", "2019-07-27T21:40:50.000Z": ". @ElToroDotCom has found a perfect home in the Louisville area...\n\nThey've made tremendous strides in a very short time, and we look forward to seeing that strong momentum continue well into the future, as Kentucky's tech sector soars to new heights > > > https:// bit.ly/2yfmrJ4", "2019-07-27T19:49:00.000Z": ". @MegafitMeals ' rapid rise is a testament to the entrepreneurial spirit and drive for success that is engrained in the Commonwealth... \n\nCongratulations to MegaFit Meals and the Marshall County community on this announcement > > https:// bit.ly/313V29x", "2019-07-27T17:42:49.000Z": "Excited to welcome Faneuil to the Bluegrass State...\n\nTheir commitment to community service will also be a strong asset to the Lexington area, and we look forward to a long and prosperous partnership > > > https:// bit.ly/311XwFj", "2019-07-27T14:31:19.000Z": "Since Thursday, we have announced the arrival of 1,639 new jobs and $70.1 million in new business investment...\n\nOur pro-growth policies are working FOR Kentucky families, unleashing economic opportunity at historic rates. \n\nKentucky continues moving forward! #WeAreKY", "2019-07-27T02:51:31.000Z": "As Governor, I agree with the ... @POTUS  and the #SCOTUS ...\n\n... @AndyBeshearKY , what is your opinion?\n\nShould ... @realDonaldTrump  use #Pentagon funds to secure our borders?\n\nKentuckians want to know even if your friends in the media don't Supreme Court: Trump can use Pentagon funds for border wall WASHINGTON (AP) - The Supreme Court cleared the way for the Trump administration to tap billions of dollars in Pentagon funds to build sections of a border wall with Mexico. The court's five... apnews.com", "2019-07-26T21:15:19.000Z": "May we never take for granted the sacrifices our law enforcement officers make as they serve and protect our communities...\n\nPraying for a speedy recovery for Officer Straman...\n\nGod bless the #ThinBlueLine ... #WeAreKY LMPD officer grazed during early morning shooting identified Officer Noah Straman was shot just before 1:30 a.m. near 36th Street and West Broadway, according to LMPD. wave3.com", "2019-07-26T20:33:26.000Z": "Excited to announce the start of construction on final KY 30 segment...Completion of this long-anticipated transportation project will significantly improve safety, reduce travel times, & create new econ opportunities for residents in Laurel, Jackson, Owsley & adjacent counties.", "2019-07-26T16:59:16.000Z": "Not easy to cut hay in the mountains of eastern Kentucky...", "2019-07-26T16:56:58.000Z": "Milestone moment in Salyersville for the Mountain Parkway Expansion...\n\nGrateful to @RepHalRogers , @KYTC , local officials & all those who have tirelessly fought for this project...\n\nWe're literally moving mountains to bring greater opportunity to communities along this corridor.", "2019-07-26T15:07:06.000Z": "Enjoyed meeting with @OneEastKY County Judge/Executives and local officials this morning to discuss economic development...\n\nTogether,  we are working to bring unprecedented economic opportunities to Eastern Kentucky. #WeAreKY", "2019-07-26T12:12:06.000Z": "The Kentucky River begins in Beattyville, KY and meanders 259 miles through the commonwealth until it joins the Ohio river in Carrollton, KY...", "2019-07-26T12:03:19.000Z": "Fog rising from the Kentucky River as it slowly wends its way past the Kentucky sate Capitol in Frankfort...", "2019-07-26T11:10:57.000Z": "\"This is the day that the Lord has made, let us rejoice and be glad in it...\"\n\nSun coming up on a foggy morning here in God's Country...  #WeAreKY", "2019-07-26T00:33:17.000Z": "A picture perfect night here in Frankfort, KY...\n\nLove seeing all the folks from KY and beyond, enjoying the breathtaking beauty of our Capitol grounds... #WeAreKY", "2019-07-25T17:05:23.000Z": "We are excited to support @AtlasAirWW 's growth on a global scale & appreciate their commitment to Kentucky. \n\nWith unparalleled advantages in geography, infrastructure, workforce and economic climate, KY is an ideal partner to help dynamic companies like Atlas deliver... #WeAreKY", "2019-07-25T01:58:45.000Z": "Great to spend time this evening with ... @POTUS , ... @realDonaldTrump ...\n\nGrateful for his support for Kentucky and for working class men and women across America...", "2019-07-24T22:09:40.000Z": "UPDATE: HB1 is now law in Kentucky. \n\nHB1 delivers critical pension relief and a path forward for community agencies and regional universities. #WeAreKY  #KYGA", "2019-07-24T17:45:47.000Z": "Coming up > > > Tune in to http:// facebook.com/govmattbevin at 2 pm EDT #KYGA", "2019-07-24T13:45:00.000Z": "Faith in action...\n\nAfter adopting a child of their own from foster care, Bryan and Stephanie Proctor wanted to help provide other foster and adoptive families with a community of support.\n\nWatch below to learn more about ACE Ministries... #WeAreKY ACE Ministries: Faith in Action Gov. Bevin highlights a non-profit organization that serves foster and adoptive families in Kentucky. youtube.com", "2019-07-23T20:32:28.000Z": "Looking forward to being part of the @CouncilonCJ ...\n\nKentucky is a national leader on #CJReform and we look forward to collaborating closely with the Council's diverse, nonpartisan coalition of partners to continue our strong momentum > > > https:// counciloncj.org/news/461994/Pr ess-Release-Council-Launch.htm ", "2019-07-23T16:50:28.000Z": "Great leadership today by @kychrismcdaniel and the Senate GOP committee members who put Kentucky's financial solvency and what is best for pensioners and taxpayers ahead of petty, partisan politics and passed HB1 out of committee...\n\nWell done!\n\nNow on to the full KY Senate...", "2019-07-23T16:32:13.000Z": "Had a great meeting this morning with @VP to discuss the importance of getting the #USMCA ratified by the US Congress and the positive impact that will have on @ThinkKentucky and our economic growth...\n\nGrateful to have the @VP as both a personal friend and a strong friend of KY! Quote Tweet Vice President Mike Pence @VP . @RepBrianBabin is right! The #USMCA is a trade deal that will benefit Americans across the country. President @realDonaldTrump & our Administration have always fought to put Americans first & now it is time for Congress to do the same & pass this deal! https:// houstonchronicle.com/opinion/outloo k/article/Babin-Texans-deserve-fair-trade-and-border-14109693.php?cmpid=gsa-chron-result ", "2019-07-23T14:42:32.000Z": "Show your support for the @kystatepolice > > >  Help them retain the \"Best Looking Cruiser\" title...voting is open until July 30! #WeAreKY KSP Looks to Keep Title of Best Looking Cruiser KSP hopes to land on the pages of a calendar spectrumnews1.com", "2019-07-22T23:21:36.000Z": "Tonight, Dep. Chief of Staff Bryan Sunderland will join @PubAffairsKET on Kentucky Tonight to discuss the latest on the special session...Tune in to @KET at 8 pm ET.", "2019-07-22T19:40:12.000Z": "The U.S. @DeptofDefense , the U.S. Military's Reserve Forces, and @DLG_KY will provide no-cost medical screenings, dental exams, optical exams and one pair of single-prescription glasses at four Eastern Kentucky locations, beginning Aug. 3 > > > https:// bit.ly/2SAVo4j", "2019-07-22T14:41:11.000Z": "Kentucky taxpayers & pensioners are grateful for the solid work by ... @KYGOP  House members last week & this...Soon to move on to the KY Senate\n\nThe days of ... @KyDems  kicking the can down the road & lying about this crisis are ending #WeAreKY House Republicans are taking the responsible path in Kentucky's pension crisis The critical state of Kentucky's quasi-governmental organizations demand action beyond the failed Democratic policies of the past. courier-journal.com", "2019-07-21T18:18:39.000Z": "#ICYMI : Overdose fatalities nearly 15% in 2018\n\nWe are extremely grateful to see a significant decline in overdose fatalities, but there is still much work to do. #WeAreKY Read more, here: https:// bit.ly/2y264PW", "2019-07-21T14:20:07.000Z": "Are you or someone you know struggling with addiction? Visit http:// FindHelpNowKY.org  Call 1-833-8KY-HELP Text HOPE to 96714\n\nGet real-time substance use disorder treatment resources! #WeAreKY", "2019-07-20T20:21:35.000Z": "At this moment, 50 years ago, the world watched as we achieved the impossible...\n\nWhen we are united, there is no limit to what we can accomplish. \n\nMay God continue to bless the United States of America...  #Apollo50th", "2019-07-20T17:06:37.000Z": "Gen. Counsel Steve Pitt's letter responding to @kyoag 's comments on special session > > > https:// bit.ly/2Z0q3KV  #KYGA", "2019-07-20T14:57:28.000Z": "Bevin Administration to discuss Special Session call...Tune in to http:// Facebook.com/GovMattBevin", "2019-07-19T20:37:19.000Z": "KENTUCKY'S HISTORIC MOMENTUM $20 BILLION in New Business Investments 53,793 New Jobs 1,180 New/Expanded Facilities $100 Billion in Exports Nearly $200 Million Budget Surplus in FY 2019\n\nKentucky is moving FORWARD! #WeAreKY", "2019-07-19T15:28:39.000Z": "Congrats to @MercedesBenzUSA Louisville on their grand opening, and to the upcoming first graduating class of Mercedes Benz certified technician systems apprentices! #WeAreKY", "2019-07-19T01:57:00.000Z": "Kentucky-built products like the @Chevrolet Corvette are world-renowned for their quality and craftsmanship... \n\nYou can watch the highly-anticipated reveal of the next-gen #Corvette live tonight, beginning at 10:50 pm EDT > > > https:// media.chevrolet.com/nextgenCorvette", "2019-07-18T19:09:18.000Z": "Live now with @terrymeiners on @840whas ...Join us! NewsRadio 840 WHAS - Kentuckiana's News, Weather & Traffic Station Louisville's News Radio 840 WHAS. whas.iheart.com", "2019-07-18T18:05:11.000Z": "Overdose fatalities nearly 15% in '18\n\nWe are extremely grateful to see a significant decline...\n\nWe will continue our strong partnerships as we allocate unprecedented resources to combat this scourge and save lives. #WeAreKY  https:// kentucky.gov/Pages/Activity-stream.aspx?n=Corrections&prId=206 ", "2019-07-18T14:47:29.000Z": ". @DLG_KY is partnering with the Air Force Reserve Command and other branches of the U.S. military to offer health care at no cost to citizens in four eastern Kentucky counties starting Aug. 3 > > > No-cost health care offered to eastern Kentuckians - Harlan Enterprise FRANKFORT - The Kentucky Department for Local Government is partnering with the Air Force Reserve Command and other branches of the U.S. military to offer health care at no cost to citizens in four... harlanenterprise.net", "2019-07-18T00:55:29.000Z": "Even the heavens declare the handiwork of God that is the beauty of Kentucky!\n\nHow blessed we are... #WeAreKY", "2019-07-17T21:44:23.000Z": "Read our proposed bill prohibiting sanctuary policies in Kentucky, here: Draft Bill - Sanctuary City Policies.rtf Shared with Dropbox dropbox.com", "2019-07-17T21:43:38.000Z": "\"Sanctuary\" policies in Kentucky would tie the hands of law enforcement officers and jeopardize their ability to do their jobs...\n\nLocal, state, and federal collaboration among law enforcement agencies is essential for public safety.", "2019-07-17T20:18:07.000Z": "Dep. Dustin Tyler Watkins, of McCreary County, is in our prayers today as he recovers from serious injuries sustained in the line of duty...\n\nMay God bless him, his family, and all those who protect and serve Kentucky... #WeAreKY Troopers identify McCreary County deputy seriously injured in shooting; 1 arrested Kentucky State Police tell WKYT a McCreary County deputy was shot Tuesday after responding to a domestic dispute. wkyt.com", "2019-07-17T15:46:13.000Z": "Today: @KYTC awards $16.6M for non-traditional community projects...\n\nFunds from this program enable local communities to implement important transportation projects that increase connectivity for diverse populations... #WeAreKY  https:// lanereport.com/115062/2019/07 /transportation-cabinet-awards-16-6m-for-non-traditional-community-projects/ ", "2019-07-17T00:55:37.000Z": "...Planned Parenthood shows its true priorities by ousting the only MD in 50 yrs to lead ... @PPFA  because, apparently, she had the crazy idea that a \"women's healthcare organization\" was supposed to focus on all healthcare rather than simply abortion Planned Parenthood ousts leader after less than a year Leana Wen's departure comes as the health care and reproductive rights group faces political and financial peril over its commitment to abortion services. washingtonpost.com", "2019-07-16T23:43:08.000Z": "As the commonwealth becomes a focal point for hemp-related businesses, this latest project significantly accelerates our progress. We are grateful for IFE's strong commitment to Kentucky, and we look forward to a long and successful partnership > > > https:// bit.ly/2JIfNAu", "2019-07-16T19:43:16.000Z": "If you love Kentucky and racing, @NASCAR 's Quaker State 400 at The @KySpeedway should DEFINITELY be on your bucket list...\n\nCheck out this behind-the-scenes look from another exhilarating #QS400 ... #WeAreKY", "2019-07-16T15:12:23.000Z": "Text \"In Demand\" to 74700 for more info on Kentucky's high demand career sectors! #WeAreKY  #KYinDemand", "2019-07-15T21:57:30.000Z": "In honor of #PrimeDay , read about how @Amazon 's Prime Air hub at @CVGairport is already transforming Northern Kentucky's economy... Amazon Air Hub Spurring Northern Kentucky Growth Northern Kentucky has seen a lot of economic development. spectrumnews1.com", "2019-07-15T16:59:13.000Z": "", "2019-07-15T16:58:47.000Z": "The Kentucky General Assembly will be convened into special session Friday, July 19, at 8 am EDT to save Kentucky's quasi-agencies and regional universities from the financial stress caused by Kentucky's looming public pension crisis. https:// kentucky.gov/Pages/Activity-stream.aspx?n=KentuckyGovernor&prId=983 ", "2019-07-15T15:53:09.000Z": "#ICYMI : State finishes fiscal year with nearly $200 million surplus > > > State finishes fiscal year with nearly $200 million surplus FRANKFORT, Ky. (KT) - State revenue topped predictions, resulting in surpluses in both the General Fund and Road Fund, for the fiscal year that ended June 30. kentuckytoday.com", "2019-07-14T19:37:43.000Z": "$20B in announced business investment since Dec. '15...\n\nPro-biz policies implemented by this administration/our legislative partners are unleashing unprecedented economic success/creating long-term opportunities for KY families. #WeAreKY Read more, here: https:// bit.ly/2xM0PnB", "2019-07-14T16:00:41.000Z": "Kentucky keeps moving forward! Visit http:// thinkkentucky.com to learn more. #WeAreKY", "2019-07-14T03:28:02.000Z": "Congratulations to ... @KurtBusch  on a great win in the ... @QuakerState  400 at ... @KySpeedway ...\n\nAnother picture perfect night in Kentucky...", "2019-07-14T03:25:57.000Z": "The end of a great evening at the ... @KySpeedway  after an epic finish in the ... @QuakerState  400...The battle of the Busch brothers! \n\nCongratulations ... @KurtBusch  on a terrific victory!", "2019-07-13T23:52:39.000Z": "What a cool moment for Kentucky Governor Matt Bevin!\n\nHe got to take a Joyride with Jeff Burton, presented by @ToyotaRacing !", "2019-07-13T23:16:29.000Z": "About to take a hot lap live on ... @NASCARonNBC  with Jeff Burton....\n\nCruising in Kentucky made ...... @ToyotaMotorCorp  Camry...", "2019-07-13T21:08:00.000Z": "It's almost time for the #QS400 at @KySpeedway ...Be sure to tune in tonight at 7:30 pm ET! #WeAreKY", "2019-07-13T19:28:20.000Z": "Make hay while the sun shines... #WeAreKY", "2019-07-13T15:14:32.000Z": "We must never allow petty politics to jeopardize the safety of our law enforcement personnel or the tools they need to serve and protect our communities. (2/2) #WeAreKY Read proposed legislation, here > > > Draft Bill - Sanctuary City Policies.rtf Shared with Dropbox dropbox.com", "2019-07-13T15:13:04.000Z": "#ICYMI : \"Sanctuary\" policies handcuff our law enforcement personnel and pose a significant risk to public safety. Communication and collaboration among federal, state and local police are essential. (1/2)", "2019-07-13T00:32:43.000Z": "Completely agree about Bill Hagerty! He is as hard working an Ambassador as any now serving America & that is a high hurdle!\n\nHis presence will be missed in Japan , but his service to America will continue...\n\nHe will be a great US Senator for TN & a strong DC ally to @POTUS Quote Tweet Donald J. Trump @realDonaldTrump Tennessee loving Bill Hagerty, who was my Tennessee Victoy Chair and is now the very outstanding Ambassador to Japan, will be running for the U.S. Senate. He is strong on crime, borders & our 2nd A. Loves our Military & our Vets. Has my Complete & Total Endorsement!", "2019-07-12T21:00:17.000Z": "Today, we proposed legislation prohibiting \"sanctuary cities\" in Kentucky. This legislation will ensure local law enforcement can effectively coordinate with federal agencies, giving them the tools they need to serve and protect our communities > > > Draft Bill - Sanctuary City Policies.rtf Shared with Dropbox dropbox.com", "2019-07-12T17:30:36.000Z": "LIVE NOW: Announcement Regarding 'Sanctuary City' Policies > > > Gov. Matt Bevin (2015-2019) on Facebook Watch Announcement Regarding 'Sanctuary City' Policies facebook.com", "2019-07-12T13:06:11.000Z": "Good morning, Kentucky! \n\nAbout to speak with business leaders and job creators at the @KyChamber Business Summit, and I have some INCREDIBLE news to share with you! #20BILLION  #WeAreKY", "2019-07-11T17:28:04.000Z": "I am grateful for the partnership with our House and Senate leadership, as we work together to continue growing our economy and strengthening Kentucky's financial foundation. We are just getting started. (2/2)", "2019-07-11T17:27:37.000Z": "This is the kind of positive, incremental growth that will sustain the Commonwealth and allow us to continue providing vital public services, while meeting our obligations to state employees by fully funding our pension systems. (1/2)", "2019-07-11T17:27:00.000Z": "Today we announced a budget surplus in FY19...Our strong finish this fiscal year shows that KY's forward-thinking economic policies are working FOR Kentuckians. \n\nExcess General Funds will be allocated to\nRetired Teachers Health Plan, Pension System > > > https:// kentucky.gov/Pages/Activity-stream.aspx?n=KentuckyGovernor&prId=979 ", "2019-07-10T22:00:00.000Z": "#ICYMI : $9 million federal grant was awarded for construction at the new airport in Sparta in Gallatin County > > > $9 Million Awarded for Construction of New Airport in Sparta A $9 million federal grant was awarded for construction at the new airport in Sparta in Gallatin County. rcnky.com", "2019-07-10T17:39:43.000Z": "Kentucky is grateful for @POTUS  @realdonaldtrump 's leadership in modernizing NAFTA\n\nThe #USMCA will strengthen our economy and help American families\n\nThe sooner it is ratified, the sooner we can march into a brighter future with our North American neighbors #USMCANow", "2019-07-10T15:30:29.000Z": "The 39th annual @PVA1946 National Veterans Wheelchair Games begins tomorrow in Louisville at @KYConvention ...Good luck to all the participants! #NVWG  https:// publicnewsservice.org/2019-07-03/dis abilities/veterans-head-to-louisville-from-across-u-s-for-wheelchair-games/a66969-1 ", "2019-07-09T17:30:27.000Z": "Kentucky is becoming THE most military-friendly state in America... Learn more about eight pro-military bills we recently signed into law, here: Kentucky: Becoming the Most Military-Friendly State in America Honored to ceremonially sign eight new laws positively impacting military personnel and military families, who make tremendous sacrifices serving our... facebook.com", "2019-07-09T17:29:20.000Z": "We recently signed legislation into law expanding veterans' preference for state jobs to include military spouses.\n\nHear firsthand from a current state employee/military spouse how this legislation will benefit Kentucky's military families > > > #WeAreKY Guest Opinion: Expanding veterans' preference in Ky. Gov. Bevin recently signed legislation into law expanding veterans' preference for state jobs to include military spouses. The opportunities that this preference presents, which will aide in the... dailyindependent.com", "2019-07-09T14:30:51.000Z": "America has lost one of the greatest business minds, political influencers and generous philanthropists of our lifetimes... Not many people who have ever lived in America, have affected the trajectory of our history as much as Ross Perot, Sr... Ross Perot, Billionaire Who Sought Presidency, Dies at 89 Ross Perot, the Dallas billionaire who offered his business background and homespun wisdom to U.S. voters as a third-party candidate for president in 1992 and 1996, has died. He was 89. bloomberg.com", "2019-07-09T13:07:15.000Z": "Live now with Greg Dunker on @NewsTalk943 ...Join us! WKYX-FM - News Talk 94.3 FM radio stream - Listen online for free Listen to WKYX-FM - News Talk 94.3 FM internet radio online for free on radio.net. All radio streams and radio stations at one glance. Discover online now. radio.net", "2019-07-09T12:36:05.000Z": "Live now on @55KRC > > >", "2019-07-08T21:06:44.000Z": "Today, the Kentucky Labor Cabinet opened an investigation into Blackjewel LLC, following reports of unpaid wages for coal miners in Eastern Kentucky. \n\nRead more, here: https:// bit.ly/30mgJ41", "2019-07-08T14:04:19.000Z": "Thank you to @GovMattBevin for stopping by #NLSC19 this year and for supporting SkillsUSA! Quote Tweet Governor Matt Bevin (2015-2019) @GovMattBevin . @SkillsUSA is a transformative program, and we are grateful for all it does to empower the next generation of highly skilled American workers. #WeAreKY", "2019-07-07T19:33:43.000Z": "Grateful for the men and women who stand in harm's way every day to protect and serve the rest of us...\n\nLet us always remember their daily sacrifices on our behalf... https:// wkyt.com/content/news/L exington-police-officer-injured-in-assault-512321082.html ", "2019-07-07T17:36:08.000Z": "Takigawa wanted to open their first United States-based facility in the best possible location, so of course they chose Kentucky! \n\nWe welcome Takigawa to their new Kentucky home, and wish them much success in the years to come. #WeAreKY", "2019-07-07T14:45:40.000Z": "#ICYMI : We are seeing INCREDIBLE changes for the children in our foster care and adoption system because we are standing UNITED to make a difference. Let's continue working together on this important issue > > > https:// nkytribune.com/2019/07/state- releases-its-one-year-progress-report-on-child-welfare-transformation-efforts-shows-some-progress/   #WeAreKY  #YOUniteKY  #AdoptKY  #FosterKY State releases its one-year Progress Report on child welfare transformation efforts, shows some... The Kentucky Department for Community Based Services (DCBS), part of the Cabinet for Health and Family Services, has released its one-year report for its Child Welfare Transformation (CWT) efforts, an nkytribune.com", "2019-07-06T23:50:29.000Z": "What's your favorite way to spend a summer night in Kentucky? #WeAreKY Having a cookout/BBQ 54.2% Boating on the lake 24.4% Camping 9.8% At a concert/other event", "2019-07-06T17:46:30.000Z": "Kentucky: We want you to have fun while you're out on the water this summerbut most importantly, we want you to stay safe. \n\nVisit http:// fw.ky.gov to learn more! #WeAreKY", "2019-07-06T14:06:04.000Z": "Looking for something fun to do with your family and friends? There are plenty of events to check out in Kentucky over the summer > > > https:// kentuckytourism.com/ky-events/", "2019-07-05T23:46:42.000Z": "As our population continues to grow, so does the need for IT professionals, electricians,  architectural managers and more. Text \"In Demand\" to 74700 for more info on KY's high demand career sectors! #WeAreKY  #KYinDemand", "2019-07-05T18:57:16.000Z": ". @SkillsUSA is a transformative program, and we are grateful for all it does to empower the next generation of highly skilled American workers. #WeAreKY", "2019-07-05T15:30:26.000Z": "Congratulations to top-ranked @loumalesoftball on an amazing, undefeated season! #WeAreKY", "2019-07-05T03:03:36.000Z": "America lost a great man today\n\nMy family is heartbroken at the loss of our dear friend, Chris Cline\n\nA brilliant businessman & one of the most generous people I have ever met\n\nHe came from humble beginnings & never forgot his roots\n\nHe loved America Billionaire West Virginia coal operator and philanthropist Chris Cline dies in helicopter crash -... Governor Justice among those paying tribute. wvmetronews.com", "2019-07-04T13:42:05.000Z": "On this #FourthOfJuly , may we all take time to remember how blessed we are to live in the land of the free...\n\nGod bless the USA, and God bless Kentucky. #WeAreKY Happy Fourth of July, Kentucky! Gov. Bevin wishes Kentuckians a happy Fourth of July holiday. youtube.com", "2019-07-03T17:24:34.000Z": "Thank you, Kentucky! \n\nWe are seeing INCREDIBLE changes for the children in our foster care and adoption system because we are standing UNITED to make a difference. #WeAreKY  #YOUniteKY  #AdoptKY  #FosterKY Read the report, here: https:// bit.ly/309AOdM", "2019-07-03T13:45:54.000Z": "It's a great day to save a life! Find an appointment for the @KYBloodCenter mobile drive, here > > > https:// bit.ly/2J7aRpy", "2019-07-03T13:06:30.000Z": "Our nation has lost a true  icon of the auto industry, a brilliant innovator and marketer, and a man who was the embodiment of the American Dream... \n\nMay he rest In peace... Icon of auto industry, father of Mustang and minivan, Lee Iacocca dies at 94 Iacocca was a top executive at two of America's largest car companies - Ford and Chrysler - for decades. He helped develop the Mustang and later rescued Chrysler from near-bankruptcy. apple.news", "2019-07-03T12:23:48.000Z": "Live now with Chad Young on @Talk104 > > > https:// radio.securenetsystems.net/cwa/index.cfm? stationCallSign=WKCT ", "2019-07-03T12:06:10.000Z": "Live now with @TomRoten on @800_WVHU > > > NewsRadio 800 WVHU - Huntington's Home for News Your home for the Tom Roten Morning Show, local news, and weather, NewsRadio 800 WVHU! Catch all your favorites in one place, including Glenn Beck, Rush Limbaugh and Sean Hannity!", "2019-07-02T22:30:00.000Z": "Ready to celebrate the #4thofJuly with your family and friends? Check out what's happening at our @KYStateParks > > > https:// parks.ky.gov/fourth-of-july/", "2019-07-02T20:23:31.000Z": "#ICYMI : Ring 1A is COMPLETE, and KentuckyWired can NOW begin expanding into eastern and western Kentucky! \n\nThe completion of this initial phase is a major step in extending high-speed internet access into each of our 120 counties. #WeAreKY  #KYWired  @RepHalRogers", "2019-07-02T15:27:00.000Z": "This group of @PaducahPoliceKY police detectives packed dozens of Nate's Wish Back Packs for children recently diagnosed with cancer...\n\nLearn more about this non-profit, here > > > http:// nateswish.com  #WeAreKY", "2019-07-01T20:17:46.000Z": "RETURN TO SENDER? Really? @KYDems in #KYGA , like @RepDonohue , are treating efforts to save KY's pension crisis like unwanted junk mail. \n\nThis is NOT a game. Kentuckians deserve better. \n\nRep. Donohuethe least you could do is read your mail. Return to Sender? While Democrats in Kentucky's General Assembly play political games, Gov. Bevin remains focused on saving local quasi-agencies in the midst of Kentucky's pen... youtube.com", "2019-07-01T16:33:44.000Z": "Great news for Bourbon County and great news for Central Motor Wheel of America! \n\nKentucky's automotive industry remains in high gear, and this expansion by CMWA is the latest example of a thriving industry... #WeAreKY Ky. auto parts facility expanding, adding 145 new jobs PARIS, Ky. (KT) -- A Bourbon County auto parts manufacturing facility has announced an expansion that will add 145 new jobs to its existing 550 employee workforce. kentuckytoday.com", "2019-06-30T18:36:56.000Z": "#ICYMI : Last week, the @WSJ featured a shortened version of my response to a recent article on the South's economy.\n\nRead my FULL, unedited response here: https:// m.facebook.com/story.php?stor y_fbid=2105890729710809&id=1499809130318975&sfnsn=mo ", "2019-06-30T14:49:17.000Z": "Considering adoption? It's so worth it...Visit http:// adopt.ky.gov today! #AdoptKY  #WeAreKY", "2019-06-29T18:00:34.000Z": "#ICYMI : The first portion of the #KYWired network, known as Ring 1A, is now complete > > > https:// lanereport.com/114652/2019/06 /gov-bevin-congressman-rogers-announce-completion-of-first-phase-of-kentuckywired-project/ ", "2019-06-29T14:45:53.000Z": "Beautify the Bluegrass Winners\n2017  > > > Paintsville\n2018  > > > Mt. Sterling\n2019  > > > ???\n\nRegistration is now closed for this year's #beautifyKY competition...\n\nLooking forward to seeing all of the submitted projects! #WeAreKY  http:// Kentuckyliving.com/beautify", "2019-06-28T21:30:36.000Z": "This vital infrastructure will create powerful opportunities for Kentuckians through enhanced job creation, economic investment, education, health care, and countless other public and private sector services. #WeAreKY", "2019-06-28T21:30:02.000Z": "Excited to join @RepHalRogers today as we announced a significant milestone in Kentucky's progress toward statewide rural broadband connectivity...\n\nCompletion of #KYWired 's initial phase is a MAJOR step in extending high-speed internet access into each of our 120 counties...", "2019-06-28T18:12:05.000Z": "HUGE PRO-LIFE VICTORY:\n\nThe 6th Circuit today announced it will not rehear arguments in the @ACLU 's lawsuit against Kentucky's ultrasound bill... \n\nThis bill will stand, and life will be preserved. #WeAreKY  #ProLife", "2019-06-28T15:21:13.000Z": "We are live now > > > http:// Facebook.com/govmattbevin Quote Tweet Governor Matt Bevin (2015-2019) @GovMattBevin Tune in to Facebook today at approx. 11:30 am ET for an exciting announcement about #KYWired !", "2019-06-28T14:07:36.000Z": "Tune in to Facebook today at approx. 11:30 am ET for an exciting announcement about #KYWired !", "2019-06-28T10:47:51.000Z": "Good morning, Kentucky!\n\nMorning comes to the Commonwealth...", "2019-06-28T01:46:55.000Z": "A number of new Kentucky laws went into effect today...\n\nCheck out this video to learn more about them and see how your government is working for you! #WeAreKY Legislative Update: June 27, 2019 Gov. Bevin updates Kentuckians on new laws that went into effect June 27, 2019. youtube.com", "2019-06-27T22:50:48.000Z": "LEGISLATIVE UPDATE: From today forward, Kentuckians do not need to pay for a license in order to conceal carry...\n\nConstitutional Carry is now the law of the land in Kentucky. Constitutional Carry Gov. Bevin gives a legislative update on Constitutional Carry in Kentucky. youtube.com", "2019-06-27T16:18:58.000Z": "Far from falling behind, the South's economy is just getting revved up.\n\nIn Kentucky, we are experiencing historic levels of economic development > > > Opinion | The Economy of the South Is Just Fine, Y'all Right-to-work states see increased economic growth, higher long-term wage growth and increased manufacturing employment than forced-union states. wsj.com", "2019-06-27T13:27:35.000Z": "Excited to be back at @SkillsUSA this morning...Grateful for everyone who makes this incredible event happen year after year and good luck to all the participants! Quote Tweet SkillsUSA @SkillsUSA @GovMattBevin , Deputy Secretary of Education Mick Zais, and CEO of @NCCER Donald Whyte joining us this morning at the Career Essentials Breakfast. #NLSC19", "2019-06-26T22:12:29.000Z": "Our administration is committed to serving those who serve us...\n\nWatch this video to learn more about an exciting announcement we made today and read more here: https:// kentucky.gov/Pages/Activity-stream.aspx?n=KentuckyGovernor&prId=971   #WeAreKY", "2019-06-26T19:54:17.000Z": "Takigawa is an incredible addition to the Nelson County community...", "2019-06-26T19:53:39.000Z": "Takigawa has had interest in a US operation for some time, and we are grateful for the state and local economic development leaders who have worked extensively with them over the past two years to make this exciting project a reality... #WeAreKY", "2019-06-26T17:18:09.000Z": "In just a couple of yrs, TWO int'l companies have completely transformed this empty field in Bardstown with their 1st US-based facilities \n\nWe are working diligently every day to ensure companies like Thai Summit & Takigawa will continue bringing 1000s of jobs to KY... #WeAreKY", "2019-06-26T14:12:10.000Z": "Excited to be back with Takigawa this morning for their grand opening celebration! #WeAreKY Quote Tweet Governor Matt Bevin (2015-2019) @GovMattBevin Today, Takigawa broke ground on its first factory in the US. This is another significant indication of our rapid progress toward creating the most favorable business climate in the country...we are grateful to Takigawa for their decision to locate in Kentucky. #KYMakes", "2019-06-25T20:00:17.000Z": "It is such an honor and pleasure to serve as your governor...\n\nI am so grateful for the hardworking men and women across Kentucky who are truly making this state shine... #WeAreKY", "2019-06-25T12:47:51.000Z": "LIVE now with Dale McKinney on WMDJ out of Floyd County. Listen here: http:// s5.viastreaming.net/8115/", "2019-06-25T12:30:27.000Z": "Live now with Alan Watts on @WKDZ ...Join us! WKDZ Online Web player player.prostreaming.net", "2019-06-24T21:45:00.000Z": "Don't forget: the deadline to submit your Beautify the Bluegrass project to @KentuckyLiving is June 28... #WeAreKY  #beautifyKY Help Beautify the Bluegrass - Kentucky Living [] kentuckyliving.com", "2019-06-24T19:02:50.000Z": "The aviation industry is growing in Kentucky, and with it, new opportunities for former coal miners, veterans and others looking to launch a new, exciting career...\n\nCheck out @eku 's new Appalachia Aviation Maintenance Technician Training Project > > > http:// eku.edu/flyky", "2019-06-24T15:35:29.000Z": "Kentucky is located at the center of a 34-state distribution area in the eastern United States, with an incredible logistics network...\n\nLearn more, here > > > http:// thinkkentucky.com  #WeAreKY  #KYMakes", "2019-06-23T22:15:53.000Z": "The Beautify the Bluegrass deadline is quickly approaching...\n\nSubmit your #beautifyKY project to @KentuckyLiving by June 28 for a chance to win! #WeAreKY", "2019-06-23T19:12:03.000Z": "\"Reading is the single most important thing a child can do.\" - Malcolm Mitchell, former Wide Receiver for the New England Patriots\n\nCheck out these highlights from this year's Early Childhood Institute in Louisville with @KYGOEC and @KyEdWorkforce ... #WeAreKY", "2019-06-23T14:48:23.000Z": "On Friday, the @kystatepolice held its annual memorial service for fallen KSP troopers, officers and highway patrolmen...We are so grateful for those who are willing to give all to protect and serve their communities. #WeAreKY 29 fallen troopers, 2 officers honored by Kentucky State Police Annual memorial held in Frankfort wlky.com", "2019-06-22T17:35:00.000Z": "\"In serving your country, you saved mine.\" - Guillaume Lacroix, Consul General of France to the Midwest\n\n75 yrs. after fighting in Normandy, Lawrenceburg native/ #WWII vet Alvin Perry was awarded the French Legion of Honor, France's highest distinction. WWII Hero Alvin Perry Receives France's Highest Distinction World War II veteran and Lawrenceburg native Alvin Perry receives the French Legion of Honor medal. youtube.com", "2019-06-22T14:44:06.000Z": "#ICYMI : Adoption is SO worth it! \n\nVisit http:// adopt.ky.gov to learn more. #WeAreKY  #YOUniteKY  #AdoptKY  #FosterKY", "2019-06-22T01:24:57.000Z": "As severe weather moves through the Commonwealth this evening, please be mindful...Stay safe, Kentucky. Tune in to your local media and check #kywx for weather updates... #WeAreKY", "2019-06-21T20:14:09.000Z": "Summer is just beginning, and there's no better place to be than Kentucky! Stay up to date on events around the state by visiting @KentuckyTourism ... #WeAreKY  https:// kentuckytourism.com/ky-events/", "2019-06-21T15:39:19.000Z": "Happy #FirstDayofSummer , Kentucky! #WeAreKY", "2019-06-20T22:41:21.000Z": "Agree completely that @USAmbCanada will provide strong leadership as Ambassador to the @UN Quote Tweet Senator Mitt Romney @SenatorRomney Strong leadership is needed from the U.S. Ambassador at the United Nations in helping confront global challenges. I've known @USAmbCanada Kelly Craft for many years and look forward to supporting her confirmation as U.S. Ambassador to the @UN .", "2019-06-20T20:34:29.000Z": "Obama's CPP was poised to shut down power plants, put coal out of business & cause devastating harm to state economies\n\nGrateful to @EPA for finalizing the Affordable Clean Energy Rule, which empowers states to innovate/modernize their own energy plans... Trump EPA rolls back Obama's coal crackdown Environmental Protection Agency Administrator Andrew Wheeler on Wednesday finalized the agency's plan for replacing Obama-era regulations on emissions from coal-fired power plants, part of a long-r... foxnews.com", "2019-06-20T18:03:24.000Z": "Creating a level playing field between the USA and our North American neighbors will bring untold, expanded opportunities to Kentucky families...\n\nProud to stand with @POTUS as he works with Congress to ratify the #USMCA ...", "2019-06-20T15:57:54.000Z": "Rails, rivers, roads and so much more...you couldn't recreate Kentucky's incredible logistics for any price!\n\nIf you want to engineer and manufacture quality products, Kentucky is the place to do it. #WeAreKY Read more, here: https:// bit.ly/2RsoWke", "2019-06-19T22:40:00.000Z": "We look forward to seeing fellow Kentuckian Kelly Knight Craft confirmed as the next U.S. Ambassador to the United Nations... #WeAreKY Hearing held on nomination of Kelly Knight Craft for U.S. Ambassador to the United Nations Kelly Craft has ties to Eastern Kentucky through her husband, Hazard native Joe Craft. wymt.com", "2019-06-19T19:47:56.000Z": "Congratulations to @BellarmineU , as the Knights make their move to @NCAA Division I...proudly representing the Commonwealth in the @ASUNsports Conference! #WeAreKY Quote Tweet Bellarmine University @bellarmineU Read about our plans to transition to @NCAA Division I over the next 12 months, becoming Kentucky's only private DI university.\nThe move will enhance the Bellarmine student experience and expand our reach and impact. https:// bellarmine.edu/bellarmine-ris ing    #SwordsUpBU  | #ASUNBuilt", "2019-06-19T16:16:57.000Z": "#ICYMI : Kentucky is the CENTER of excellence in engineering and manufacturing in America, with access to markets, workforce, resources and energy prices that you just don't find in other areas... #WeAreKY  @SelectUSA Gov. Bevin praises Kentucky manufacturing at SelectUSA Investment Summit Businesses and investors from around the world attended the summit. wymt.com", "2019-06-18T16:28:11.000Z": "CED is promoting KY as a top US location for biz at the @parisairshow - the largest air show & aerospace-industry exhibition event in the world. We enlisted the help of @KyDistillers in showcasing Ky.'s well-known bourbon brands with a daily tasting. #KyMakes  #KyInParis  #Bourbon", "2019-06-18T18:46:46.000Z": "When our family of seven became a family of eleven, our lives were enriched in more ways than we could possibly articulate in a single tweet...\n\nAdoption is SO worth it! \n\nStart your #adoption journey today at http:// adopt.ky.gov . #WeAreKY  #AdoptKY  #YOUniteKY", "2019-06-18T15:26:06.000Z": ". @BRElectricCorp : Looking forward to seeing the finished project! \n\nSubmit YOUR 2019 #beautifyky project idea, or completed project, to @KentuckyLiving by June 28! #WeAreKY Quote Tweet Big Rivers Electric @BRElectricCorp Let's get started! We're teaming up with Webster County for #BeautifytheBluegrass to create a new mural in downtown Sebree. Today, employees primed the wall for the first steps. #beautifyKY  #cooperative  @KentuckyLiving  @KyElectricCoops  #webstercounty  https:// facebook.com/bigriverselect ric/posts/2143985712574785 ", "2019-06-18T00:02:35.000Z": "Great news for the Campbell County community!\n\nI applaud CompMed's leadership and am grateful for their commitment not only to the commonwealth, but also to their staff and customers...We wish them continued success and growth in the years ahead > > > https:// kentucky.gov/Pages/Activity-stream.aspx?n=KentuckyGovernor&prId=968 ", "2019-06-17T20:21:49.000Z": "The Beautify the Bluegrass deadline is quickly approaching, but there's still time to get a project underway or submit one you've already completed! \n\nSubmit your #beautifyKY project to @KentuckyLiving by June 28 for a chance to win! #WeAreKY Help Beautify the Bluegrass - Kentucky Living [] kentuckyliving.com", "2019-06-17T16:25:52.000Z": "The fact that HB 5, a bill prohibiting abortions based on race/sex/disability, is controversial should shock us...Have we become that jaded to the sacredness of human life?\n\nI joined @JanJekielek on #AmericanThoughtLeaders to discuss #ProLife & more > > > What's America's Biggest Opportunity and Biggest Threat?-Kentucky... Over the past 35 years, Kentucky Governor Matt Bevin has enacted major changes in the state. President Trump has praised him for having done a \"tremendous jo... youtube.com", "2019-06-16T16:25:01.000Z": "Happy #FathersDay , Kentucky!\n\nStrong fathers who lead, instruct and encourage from a foundation of selfless love, though they may make mistakes, will not ultimately go wrong.\n\nRead more of my thoughts on fatherhood, here: https:// bit.ly/2wTUOEM  #WeAreKY", "2019-06-15T22:27:44.000Z": "It is a great honor and privilege to be a dad...\n\nIf you've ever considered fostering or adopting a child, please visit http:// foster.ky.gov or http:// adopt.ky.gov today... #WeAreKY  #FosterKY  #AdoptKY  #YOUniteKY Considering adoption? Visit adopt.ky.gov today! Special advisors to Gov. Bevin, Chris and Alicia Johnson, encourage Kentuckians to consider foster care and adoption. youtube.com", "2019-06-15T15:48:58.000Z": "#ICYMI : Kentucky RISE, a web-based portal aimed towards assisting transition-age foster youth, launches June 24... #WeAreKY Kentucky designs new web portal for foster care kids It is called Kentucky RISE, which stands for Resources for Independence, Success and Empowerment. wkyt.com", "2019-06-14T22:18:00.000Z": "For 242 years, the American flag has served as a beacon of hope and freedom to people around the world... #FlagDay2019", "2019-06-14T19:49:21.000Z": "Happy Birthday to our President...A great American and a great friend of Kentucky! @POTUS", "2019-06-14T17:05:13.000Z": "A federal court delivered a MAJOR #ProLife victory to Kentuckians in April...\n\nNow, a Louisville abortion clinic wants a \"do-over\" of the ruling on HB 2 (an ultrasound bill that passed with more than 87% support from Kentucky's General Assembly) > > > https:// bit.ly/2RefhNW", "2019-06-14T14:54:34.000Z": "For 244 years, the @USArmy has answered the call to defend and protect the United States of America...\n\nTo America's soldiers, past and present: thank you. #ArmyBday", "2019-06-13T16:49:36.000Z": "Read more, here: https:// kentucky.gov/Pages/Activity-stream.aspx?n=KentuckyGovernor&prId=963 ", "2019-06-13T16:49:09.000Z": "Official Statement from Gov. Matt Bevin Regarding Landmark Supreme Court Victory:", "2019-06-12T21:04:07.000Z": "How are we going to combat the #OpioidCrisis and transform our nation's foster/adoption care system?\n\nWith meaningful collaboration and partnerships at every level...\n\nGrateful for the opportunity to meet with @PartnersForGood today... #WeAreKY Quote Tweet HHSPartnershipCenter @PartnersforGood Thanks to @GovMattBevin for leading the effort to combat Kentucky's #opioidcrisis , as well as to speak up for those in the #fostercare and #adoption systems.", "2019-06-12T18:48:08.000Z": ". @kyoag is claiming that AHPs do not cover preexisting conditions, which is patently false (see graphic below)\n\nWe are standing with @POTUS in court to support AHPs/offer affordable health insurance for KY's small biz employees & families. #WeAreKY  https:// bit.ly/2F4zUHC", "2019-06-12T15:01:25.000Z": "COMING SOON: Kentucky RISE, a web-based portal aimed towards assisting transition-age foster youth, launches June 24... #WeAreKY Kentucky designs new web portal for foster care kids It is called Kentucky RISE, which stands for Resources for Independence, Success and Empowerment. wkyt.com", "2019-06-11T21:38:29.000Z": "Last week's reopening of the New Salem Circle Bridge in Nortonville is a testament to the importance of collaboration between local communities and state officials.\n\nWhen we work together, there is no limit to what we can accomplish...\n\nUnited We Stand. Divided We Fall. #WeAreKY", "2019-06-11T16:01:46.000Z": "Kentucky @GovMattBevin : \"When you come and invest in the center of America, you have access to markets, to the workforce, into resources, into energy prices that you just don't find in other areas.\" #SelectUSASummit", "2019-06-11T13:33:53.000Z": "Yesterday evening, a police officer was shot in the line of duty in Perry County...\n\nPlease join me in praying for the officer's speedy recovery.\n\nAbundantly grateful for the men and women who serve and protect our communities... #WeAreKY  #ThinBlueLine KSP: Officer shot in Perry County - ABC 36 News Kentucky State Police are investigating an officer-involved shooting that happened Monday night in Perry County. wtvq.com", "2019-06-10T23:35:00.000Z": "Kentucky continues to play a lead role in combatting the opioid epidemic...\n\nOur harm-reduction program allows KY to provide technical support & expertise to our local partners, who, in turn, establish programs best suited for their respective areas. States Pursue Strategies to Address Infectious Disease Related to the Opioid Epidemic - National... Priorities Include Expanding Access to Syringe Services Programs and Using Data to Target High-Risk Communities With viral infections attributable to injection drug use on the rise, the National... nga.org", "2019-06-10T19:42:21.000Z": "General Fund 6% YTD\n\nA strong fiscal foundation is built over time, and today's announcement is further proof that our pro-business policies are creating jobs, growing our economy, and working for Kentucky families. #WeAreKY  https:// lanereport.com/114038/2019/06 /general-fund-receipts-up-6-road-fund-receipts-up-3-7-over-last-year/ ", "2019-06-10T14:59:27.000Z": "They defended Old Glory during #WWII ...\n\nAnd last week, as we commemorated #DDay75thAnniversary , more than 100 Kentucky WWII veterans received a USA flag flown over @ArlingtonNatl and a Kentucky State Flag that was displayed atop the Kentucky State Capitol... #WeAreKY", "2019-06-10T00:13:02.000Z": "\"It's a small bridge in a small town, but there's nothing small about the Nortonville citizens' efforts to repair an integral facet of their community.\" - @MessengerOnline  https:// the-messenger.com/news/local/art icle_0e612a8d-52e1-5b09-a354-89a7fe0b3a15.html ", "2019-06-09T19:30:21.000Z": "#ICYMI : Honored to ceremonially sign HB 158 this week, which provides a Foster Child Bill of Rights... #WeAreKY", "2019-06-09T14:57:02.000Z": "#ICYMI : The importance of school-based health services is proven, and I am grateful that our state agencies are partnering to implement this amendment, which will benefit thousands of students across Kentucky > > > https:// kentucky.gov/Pages/Activity-stream.aspx?n=KentuckyGovernor&prId=954 ", "2019-06-08T21:15:11.000Z": "Congratulations to @LouisvilleBSB today, as they clinch their fifth trip to the #CollegeWorldSeries !  #WeAreKY Quote Tweet Louisville Baseball @LouisvilleBSB FINAL | No. 7 Louisville 12, No. 10 ECU 0\n \nFor the 5th time in school history, the Louisville Cardinals are OMAHA BOUND! #L1C4 Show this thread", "2019-06-08T20:18:48.000Z": "Congratulations to Estill County High School graduate Dakota Glasson on recieving this honor from the @kystatepolice ... #WeAreKY Estill County HS grad made honorary Kentucky State Trooper A big honor for an Estill County High School graduate as he took home more than a diploma at his graduating ceremony. wkyt.com", "2019-06-08T14:45:14.000Z": "Nearly $20 BILLION in NEW business investment, more than 52,000 announced jobs...Kentucky CONTINUES moving forward! #WeAreKY", "2019-06-08T00:44:26.000Z": "Great news for the manufacturers and consumers of America and great news with respect to securing our southern border! \n\nThankful for a @POTUS with the spine needed to make hard demands and not fold... Quote Tweet Donald J. Trump @realDonaldTrump I am pleased to inform you that The United States of America has reached a signed agreement with Mexico. The Tariffs scheduled to be implemented by the U.S. on Monday, against Mexico, are hereby indefinitely suspended. Mexico, in turn, has agreed to take strong measures to.... Show this thread", "2019-06-08T00:14:44.000Z": "Honored to ceremonially sign SB4 and HB254 this week, two examples of how Kentucky is moving forward...\n\nLearn more about these bills, here: https:// apps.legislature.ky.gov/record/19rs/re cord.html   #WeAreKY", "2019-06-07T19:57:38.000Z": "I am confident the BRIGHT program will help train up the next generation of leaders for Eastern/Southeastern Kentucky...\n\nThank you to @RepHalRogers , @ARCgov , @DLG_KY , the Whitaker Foundation, @LeadershipKY & other partners for supporting this program. $500,000 grant to create new leadership program in Eastern Kentucky The program is called BRIGHT Kentucky. wymt.com", "2019-06-07T14:56:53.000Z": "Happy Birthday to a good friend and a great American", "2019-06-07T00:14:56.000Z": "With legislation like HB 158, which provides a Foster Child Bill of Rights, Kentucky is becoming the gold standard across the nation for foster care and adoption reform... #WeAreKY  #KYGA19", "2019-06-06T18:32:40.000Z": "Citizen safety is an essential function of government, and this is a wonderful example of state and local officials working together to identify a need and find a viable solution to improve the quality of life for Kentuckians.", "2019-06-06T18:31:58.000Z": "We are pleased to join the Nortonville community in celebrating the reopening of the New Salem Circle Bridge, which connects more than 100 local homes and businesses and provides a vital link for service providers and first responders.", "2019-06-06T15:25:11.000Z": "Seventy-five years after D-Day, the world remains grateful for the sacrifices made by so many to turn the tide of #WWII ...\n\nIt is impossible to comprehend what the world would be like today if not for the Greatest Generation. #DDay75thAnniversary", "2019-06-06T13:07:47.000Z": "Live now with Greg Dunker on @NewsTalk943 ...Tune in! http:// v6.player.abacast.net/1046", "2019-06-06T12:40:25.000Z": "Live with @LelandShow ...Join us! http:// Wlap.iheart.com", "2019-06-06T12:19:11.000Z": "Live now with Alan Watts on @WKDZ ...Tune in! WKDZ Online Web player player.prostreaming.net", "2019-06-06T11:49:07.000Z": "Live now on @wkcb1071killerb ...Join us > > > http:// Wkcb.com", "2019-06-05T21:01:41.000Z": "Official Letter from @GovMattBevin to the #KYGA Regarding Special Session to Address Pension Crisis Facing Regional Universities and Quasi-Governmental Agencies > > > https:// bit.ly/2Z749Ff", "2019-06-05T17:53:00.000Z": "Productive meeting today with @KACo county judge/executives from Kentucky's coal counties...\n\nUnited we stand. Divided we fall. #WeAreKY", "2019-06-05T15:28:29.000Z": "HONORING HEROIC EDUCATORS\n\nThanks to quick, decisive action by Bullitt County Public School bus driver Michelle Crenshaw and Eastside Middle School Assistant Principal Kyle Buege, 12 yr. old Zoe Thomas' life was saved > > > https:// bit.ly/2XojwZw  #WeAreKY", "2019-06-04T20:09:27.000Z": "Kentucky is becoming the most military-friendly state in America... These eight bills, passed by the 2019 Kentucky General Assembly, demonstrate Kentucky's commitment to veterans, those currently serving and their family members. #WeAreKY", "2019-06-04T14:31:21.000Z": "Kentucky's iconic bourbon industry has been an economic powerhouse for generations \n\nCongratulations to Pennington Stave and Cooperage, as they create exciting opportunities for the workforce of South Central Kentucky > > > https:// bit.ly/2JP5iOa", "2019-06-04T00:19:22.000Z": "Two teenage daughters, one carton of ... @kyproudofficial  pimento cheese spread, 5 minutes...Mmmm, mmmm (almost) gone... #NationalDairyMonth", "2019-06-03T21:57:13.000Z": "Even as long-overdue trade negotiations continue b/w the US & our trading partners, I'm grateful to the 1000s of Kentuckians who work for @Ford , @GM & those who make the most American made cars (70%!) in the USA, the @Toyota Camry\n\nTime for the US Congress to ratify the #USMCA !", "2019-06-03T21:57:10.000Z": "Honored today to ceremonially sign 8 new laws positively impacting military personnel & families, who make tremendous sacrifices serving our nation.\n\nGrateful to legislative partners working alongside our administration to make KY the most military-friendly state in America!", "2019-06-03T18:44:10.000Z": "#DYK > > >  Kentucky's dairy cows annually produce more than 121 MILLION gallons of milk!\n\nWe kicked off #DairyMonth today by celebrating our rich dairy heritage...\n\nThankful for the dairy farmers and families who contribute so much to our communities and Commonwealth... #WeAreKY", "2019-06-03T14:36:02.000Z": "#ICYMI : True to its name, #PhoenixPaper was reborn just before midnight on May 28, producing its first reels of pulp\n\nOur pro-business policies are working FOR Kentucky families #WeAreKY Wickliffe Paper Mill Back In Operation A paper mill in western Kentucky is back in business after being closed for nearly three years. wkms.org", "2019-06-02T23:26:40.000Z": "Kentucky BOLDLY and UNAPOLOGETICALLY stands for the sanctity of human life... #WeAreKY  #ProLife", "2019-06-02T17:10:17.000Z": "There was much to celebrate in the Commonwealth this week\n\nTake a look at some of the people, policies and partnerships that are moving Kentucky forward! #WeAreKY", "2019-06-02T14:59:53.000Z": "Congratulations to the winners of this year's Governor's Ambassador Awards...\n\nThese public servants, like so many others across the Commonwealth, represent the very best of Kentucky. #WeAreKY  https:// personnel.ky.gov/Pages/Governor 's-Ambassador-Award-Winners.aspx ", "2019-06-01T18:06:00.000Z": "In light of recent news out of states like #Nevada and #Illinois , let's remember: \n\nHuman life is sacred, and the RIGHT to LIFE should NEVER be controversial. \n\nWe will continue to use every resource at our disposal to protect and defend it. #WeAreKY  #ProLife", "2019-06-01T16:32:05.000Z": "Still America's favorite pastime...\n\nAlthough the games drag on, it is fun watching young people learn to play baseball.", "2019-06-01T15:44:16.000Z": "", "2019-06-01T13:23:09.000Z": "On this day in 1792, Kentucky officially became the 15th state in the Union...\n\nHappy 227th, Kentucky! #WeAreKY", "2019-05-31T20:42:26.000Z": "Kentuckians stand united in support of Matt's family/friends/community as they mourn this tragic loss. To all who recognize the power & comfort that comes from Divine intercession, I ask you to pray for peace/healing to all affected by the untimely death of this hardworking man.", "2019-05-31T20:42:07.000Z": "We are heartbroken to learn of the passing of a Kentucky coal miner, Matt North, who was critically injured this week in an accident in Harlan County. Miner dies following accident at Eastern Kentucky mine Matt North had 12 years of experience as a mine operator. wymt.com", "2019-05-31T14:41:29.000Z": "In March 2017, I met with Asahi Forge Corp. leaders during a trade mission to Japan to discuss plans for a future, third Asahi plant in Richmond...\n\nYesterday, the company broke ground on that plant, which will create 50 full-time jobs when it opens in June 2021. #WeAreKY", "2019-05-30T21:31:33.000Z": "When SB70 passed, Kentucky became the 48th state to formally codify the crime of strangulation...\n\nOne voice speaking up led to a law that will benefit thousands of Kentuckians. \n\nYour voice and experience can make a PROFOUND difference... #WeAreKY", "2019-05-30T18:13:21.000Z": "We are deeply grateful to each of the brave men and women who put on a @kystatepolice uniform in service to our Commonwealth. \n\nToday, we were honored to recognize several KSP troopers and officers who have gone above and beyond the call of duty in their communities. #WeAreKY", "2019-05-30T15:31:36.000Z": "\"There is a role every person can play to provide a supportive environment. We're hoping everyone will find what they can do to really make a difference for kids and families.\" Chris Johnson, Uniting Kentucky #WeAreKY  #AdoptKY  #FosterKY  #YOUniteKY  https:// messenger-inquirer.com/news/local/uni ting-kentucky/article_f4b921f9-4d6e-5f26-879f-d73d061e4e55.html?fbclid=IwAR0-eIhtmloejmAvyKQkV1p-bNjtXvmn7SkzcX8P_jBFb4y-zbOHU1cBpA4 ", "2019-05-29T22:15:18.000Z": "Today, the @KYSHPO hosted its 40th Annual Ida Lee Willis Memorial Foundation Historic Preservation Awards...\n\nEnjoyed the opportunity to celebrate state and local efforts to make the Commonwealth's historic properties shine... #WeAreKY", "2019-05-29T19:14:07.000Z": "Great news for #PhoenixPaper , #WickliffeKY and the Commonwealth...Kentucky keeps moving forward! #WeAreKY Quote Tweet Cabinet for Econ Dev @CEDkygov Congrats on a landmark moment! #PhoenixPaper produced its first reels of pulp in #WickliffeKY just before midnight on May 28. The mill sat dormant for 2+ years before a Chinese paper company bought it last summer. Phoenix plans to hire 500 people. #WeAreKY  #Resurgence  #FDI", "2019-05-29T15:59:38.000Z": "Honored to join @SenateMajLdr and the @DeptofDefense , alongside state & local officials, for a historic day in Madison County as Blue Grass Army Depot begins work to safely eliminate our nation's chemical weapons stockpile. #WeAreKY", "2019-05-29T01:39:18.000Z": "BIG victory for life in the Supreme Court\n\nGrateful for Justice Thomas' support of anti-eugenics laws like HB 5 in KY & correctly recognizing that states have a \"compelling interest in preventing abortion from becoming a tool of modern-day eugenics.\" Governor Bevin on Fox News: Kentucky Stands for Life The more we know medically and scientifically, the more it is clear that we are killing human beings who do not have a voice. I joined Tucker Carlson... facebook.com", "2019-05-28T22:31:13.000Z": "Check out @KYEdWorkforce 's resources for parents to help children fight reading and math regression during summer break > > > Stride, Don't Slide! sites.google.com", "2019-05-28T17:54:58.000Z": "Grateful to all who made the @NatlGovsAssoc 's U.S.-China Governors Collaboration Summit possible, and to the many who came together to strengthen sub-national relationships between America and China.", "2019-05-28T15:10:57.000Z": "Congratulations to Casey County High School's William Short on being 1 of 150 @HQAFJROTC cadets across the nation to receive the opportunity to earn his private pilot's license and college credit this summer...He will soon leave for @KStatePolytech ! #WeAreKY", "2019-05-27T19:53:24.000Z": "So grateful for all who came out today to honor our fallen  veterans at the Memorial Day service at Zachary Taylor Military Cemetery We are so blessed to be Americans living in a free country May we never forget those who have given their lives during military service", "2019-05-27T13:17:16.000Z": "To the great men and women who have believed in the American ideal so much that they laid down their lives to secure and protect it...\n\nAnd to their families, who have paid that price as well...\n\nWe say thank you. #MemorialDay  #WeAreKY", "2019-05-26T21:58:33.000Z": "A great ...@ThinkKentucky \n( @uaw ... @chevrolet )product on proud display at the #Indy500 today\n\nRepresenting KY with class around the world\n\nHere's a KY built #corvette delivering ... @simonpagenaud  to the yard of brick for the ceremonial kiss after an epic victory!", "2019-05-26T21:26:44.000Z": "A bunch of young #Indy500 princesses and some dude in a red hat...", "2019-05-26T21:11:25.000Z": "Gotta love ... @POTUS  , ... @realDonaldTrump ...\n\nHe called ... @Team_Penske  owner (and great American) Roger Penske, to congratulate him on winning the #Indy500 at ... @IMS \n\nRoger then handed the phone to the winning driver, ... @simonpagenaud  \n\nGreat race!", "2019-05-26T17:36:18.000Z": "IMPRESSIVE\n\nSgt. Jordy Brewer, a Harlan County native and former college football player, out-performed all other National Guardsmen in the United States to earn the title, \"America's Best Warrior.\" #WeAreKY America's Best Warrior: Sgt. Jordy Brewer Gov. Bevin highlights Sgt. Jordy Brewer, the first Kentuckian to receive the National Guard's \"America's Best Warrior\" recognition. youtube.com", "2019-05-26T13:32:59.000Z": "New program from @KyEdWorkforce will help experienced military personnel/veterans become FAA certified > > > Program helps military personnel, veterans become FAA certified FRANKFORT, Ky. (KT) - A new program will help military personnel and veterans with aviation or power plant mechanics experience transfer those skills to become Federal Aviation Administration... kentuckytoday.com", "2019-05-25T22:57:35.000Z": "We are just under one month away from the deadline to submit your projects for the 2019 Beautify the Bluegrass competition! Check out project tips and information from @KentuckyLiving and get started today. #beautifyKY  #WeAreKY  http:// kentuckyliving.com/beautify", "2019-05-25T17:32:53.000Z": "Our pro-business polices are working FOR Kentucky families, opening more doors to opportunity than ever before #WeAreKY", "2019-05-25T13:51:15.000Z": "Find a #MemorialDay service near you, here: Memorial Day ceremonies at state veterans cemeteries and veterans centers - ABC 36 News Kentucky's five state veterans cemeteries, as well as veterans centers across the Commonwealth, will hold ceremonies this Memorial Day holiday, honoring those who have died in service to our country. wtvq.com", "2019-05-25T01:05:47.000Z": "Check out these before and after pictures...Last week @jacksonenergy spruced up their City of Mt. Vernon welcome signs, and the results are amazing! \n\nHelp us make #KYShine by joining the Beautify the Bluegrass challenge > > > https:// kentuckyliving.com/beautify  #beautifyKY  #WeAreKY", "2019-05-24T22:08:47.000Z": "Great day to be an American!", "2019-05-24T20:01:01.000Z": "Miss my talk with @TomRoten this week? Listen to the full interview, here: Bevin: Eventually those paying will be outnumbered by those taking | NewsRadio 800 WVHU | The Tom... On Primary Election Day, KY GOP Gov. Matt Bevin discusses his first term and what more he wants to do. He talks pension reform, welfare reform, gun rights, and more! Bevin has 3 primary opponents.", "2019-05-24T18:00:00.000Z": "This is the land of the free because of the brave\n\nAs we look forward to #MemorialDay weekend with our friends and family, please take time to remember and honor the 1.5 million Americans who have paid the ultimate price for our freedom. #WeAreKY Memorial Day 2019: Land of the Free because of the Brave During Memorial Day weekend, Gov. Bevin encourages Kentuckians to honor and remember those who have paid the ultimate price for America's freedom. youtube.com", "2019-05-24T15:35:37.000Z": "Wrapping up the @NatlGovsAssoc 's U.S.-China Governors Collaboration Summit today Grateful to all who made this event possible, and to the many who came together to strengthen sub-national relationships between America and China.", "2019-05-23T14:46:05.000Z": ". @GovMattBevin joined Chinese Ambassador Cui Tiankai and other guests at our summit in Kentucky. \"It is our responsibility - each of us, individually and as a group, that at the subnational level, we will establish relationships. We will establish friendships.\" #WeTheStates", "2019-05-23T19:43:33.000Z": "When America is strong, that's good for China. When China is strong, that's good for America.\n\nGrateful to Chinese Ambassador Cui Tiankai for taking part in conversations this week...Vibrant international partnerships will yield enduring results for generations to come. #WeAreKY", "2019-05-23T16:03:59.000Z": "I'm honored to partner with the @NatlGovsAssoc and @ThinkKentucky to host the U.S.-China Summit in Kentucky this year...\n\nKentucky has increasing business interest from China, and we are leading the way in developing positive relationships on the subnational level... #WeAreKY", "2019-05-22T22:31:00.000Z": "50+ NEW jobs are coming to the Bowling Green community...\n\nFor nearly 3 decades @GeorgiaPacific has served up opportunities for Kentuckians, and this latest announcement will provide our highly-skilled workforce with even more pathways to success. #WeAreKY", "2019-05-22T20:26:44.000Z": "Will be live with @TeamCavuto at approx. 4:30 pm ET on @FoxNews ...Tune in!", "2019-05-22T19:46:48.000Z": "No matter where you live in Kentucky, a child in YOUR community is waiting for a foster family...\n\nAre you willing to open your heart and home to a child in need? \n\nVisit http:// foster.ky.gov today! #WeAreKY  #NationalFosterCareMonth  #YOUniteKY National Foster Care Month Gov. Bevin encourages Kentuckians to consider being foster parents. youtube.com", "2019-05-22T14:31:51.000Z": "Approx. 10,000 Kentucky children are waiting for a family just like YOURS > > > http:// foster.ky.gov  #WeAreKY  #FosterKY", "2019-05-21T18:35:43.000Z": "It's not too late to join us at today's Woodford County community forum ... Looking forward to a great dialogue at the @KCTCS Systems Office in Versailles. #WeAreKY", "2019-05-21T17:57:06.000Z": "A lot to celebrate with @KAEDonline this afternoon, including: LOWEST RECORDED unemployment HIGHEST RECORDED workforce participation NEARLY $20B in NEW business investment MORE THAN 1,200 burdensome regulations either REPEALED or AMENDED", "2019-05-21T13:00:00.000Z": "Are you ready to vote? It's Primary #ElectionDay and polls close at 6 pm!\n\nA government of, by, and FOR the people can only work if \"We, the People\" take our responsibility seriously... #VoteKY  #WeAreKY", "2019-05-21T12:08:59.000Z": "Live now with @TomRoten on @800_WVHU ...Tune in! NewsRadio 800 WVHU - Huntington's Home for News Your home for the Tom Roten Morning Show, local news, and weather, NewsRadio 800 WVHU! Catch all your favorites in one place, including Glenn Beck, Rush Limbaugh and Sean Hannity!", "2019-05-20T22:30:00.000Z": "\"We joined the first #2A case heard by #SCOTUS in nearly a decade, w/out reservation, b/c Kentuckians have a vested interest in ensuring states like New York cannot infringe upon the right of Kentucky citizens to bear arms.\" -Steve Pitt, General Counsel Ky. joins 23 other states in supporting Second Amendment rights case FRANKFORT, Ky. (KT) - The administration of Gov. Matt Bevin has filed a friend of the court brief in support of a federal case involving Second Amendment rights. kentuckytoday.com", "2019-05-20T19:30:42.000Z": "We are so grateful that the fire at @ConleyBottomKy did not result in any injuries. Despite the loss of property for some business owners, the marina is expected to resume all rentals in time for #MemorialDay Weekend. Quote Tweet WKYT @WKYT Some Memorial Day weekend plans may be spoiled if you're heading to Lake Cumberland. Find out why in WKYT This Morning's top stories.", "2019-05-20T16:30:00.000Z": "It's #NationalFosterCareMonth !\n\nApprox. 10,000 Kentucky children are waiting for a family just like YOURS > > > http:// foster.ky.gov  #WeAreKY", "2019-05-20T14:31:45.000Z": "Looking forward to being in Woodford County tomorrow for a community forum...Hope you can join us! #WeAreKY", "2019-05-19T18:29:56.000Z": ". @OrphanAlliance Summit 2019: \n\nApproximately 2,500 children in Kentucky are ready and waiting to be adopted...\n\nWith 6,500 churches across the state, we are more than capable of finding forever families for each of them. #WeAreKY  #AdoptKY Christian Alliance for Orphans Summit Highlight: #AdoptKY Gov. Bevin and First Lady Glenna Bevin speak to participants of the Christian Alliance for Orphans (CAFO) Summit. youtube.com", "2019-05-19T12:31:00.000Z": "Happy 102nd birthday to William Mason, Jr. of Eminence! The Navy veteran was the first recipient of our Kentucky Centenarian Award.  \n\nWe met him for his 100th birthday...Watch this video to see how he & his wife, Sarah, have helped make KY shine. #WeAreKY William Mason: Kentucky Centenarian 2019 Gov. Bevin highlights the life of Kentucky Centenarian, William Mason. youtube.com", "2019-05-18T21:00:00.000Z": "#ICYMI : This week we broke ground on @Amazon 's $1 billion-plus Prime Air Shipping hub  #WeAreKY Work begins on Amazon air hub that could bring 2,000 jobs to Tri-State HEBRON, Ky. (WKRC) - CVG will soon be transformed as ground is broken on Amazon's Prime Air Hub. The 3-million-square-foot facility with parking for 100 planes will be a huge investment in the local... local12.com", "2019-05-18T19:30:00.000Z": "#ICYMI : 265 jobs coming to Eastern Kentucky > > > https:// hazard-herald.com/news/bevin-daj cor-aluminum-to-create-full-time-jobs-in-eastern/article_e414f07e-775d-11e9-864c-f701d6c705fc.html ", "2019-05-18T17:05:33.000Z": "GOING PRO...\n\nYesterday, 15 @Jefferson_JCTC students graduating in manufacturing-related fields officially 'signed' with the companies that are hiring them.\n\nThank you @KCTCS and @KyManufacturing for spotlighting these exceptional students who are launching in-demand careers!", "2019-05-18T14:30:00.000Z": "Congratulations to each and every one of this year's @KctcsSoutheast graduates ... You are TRULY overcomers, and we look forward to seeing how you will help make Kentucky the best version of itself.  #WeAreKY 2019 Graduation: Hard Work Pays Off During this year's graduation, we were honored to have our own students share their stories! Hard work really does pay off! #SKCTCStudentsFirst #SKCTCProud youtube.com", "2019-05-18T00:26:09.000Z": "Kentucky is boldly fighting to protect the sanctity of life. #WeAreKY  #ProLife Gov. Bevin: We Stand on the Side of Life We will continue FIGHTING for LIFE, and we will prevail because we stand on the side of right. We stand on the side of life. youtube.com", "2019-05-17T21:00:58.000Z": "The more we know medically and scientifically, the more it is clear that we are killing human beings who do not have a voice.\n\nI joined @TuckerCarlson on @FoxNews to talk about Kentucky's stand for lifeWatch the interview below. #WeAreKY  #ProLife Gov. Bevin on Fox News: Kentucky Stands for Life The more we know medically and scientifically, the more it is clear that we are killing human beings who do not have a voice. I joined Tucker Carlson on Fox ... youtube.com", "2019-05-17T18:09:44.000Z": "Kentucky unapologetically stands for life. #WeAreKY  #ProLife", "2019-05-17T14:44:49.000Z": "We have a moral obligation to protect human life...Watch my full interview with @EWTN , below. #WeAreKY  #ProLife Governor Matt Bevin on Pro-Life Leadership Multiple Democratic governors reject their states' versions of Born-Alive legislation - we speak with Kentucky Governor Matt Bevin about the important role g... youtube.com", "2019-05-17T00:04:24.000Z": "Tune in to @TuckerCarlson tonight on @FoxNews at approx. 8:20 pm EDT... #WeAreKY  #ProLife", "2019-05-16T18:25:40.000Z": "More incredible news for Kentucky's workforce...statewide unemployment is at its lowest in recorded history for March and April.\n\nEconomic opportunity continues to grow in the Commonwealth > > > https:// bit.ly/2VNfM7m  #WeAreKY", "2019-05-16T14:52:02.000Z": "Congratulations to @UPS on completing their transformative $310 million Centennial Ground hub expansion at @FlyLouisville ! \n\nWe are grateful for @UPS ' powerful impact upon the workforce, economy and community of the Louisville region > > > https:// bit.ly/2WKSV8E", "2019-05-15T20:30:00.000Z": "Wonderful news out of Magoffin County\n \nGrateful for the state/local law enforcement and community members who worked tirelessly in this search #WeAreKY Update: Missing Magoffin County toddler found dehydrated, but alive Moments ago we learned from rescue crews Kenneth Howard was found alive. wymt.com", "2019-05-15T18:11:34.000Z": "Law enforcement officers protect and serve the lives in their communities; they are often the heroes among us. \n\nWe are deeply grateful for those who have served and sacrificed so much on our behalf. #WeAreKY  #PeaceOfficersMemorialDay", "2019-05-15T15:43:26.000Z": "Yesterday, @NASA announced plans for Americans to land on the moon, once again, by 2024  And with a growing, thriving aerospace industry, Kentucky is perfectly poised to help us get there. #WeAreKY  #Moon2024 Quote Tweet NASA @NASA We are going to the Moon - to stay.\n\nWe will build sustainable infrastructure to support missions to Mars and beyond. This is what we're building. This is what we're training for. We are going. #Moon2024", "2019-05-14T20:35:57.000Z": "A barge loaded with black gold headed to market on the mighty Ohio River...\n\nIn a year when California is already warning of likely summer power outages, KY is blessed with abundant resources, incredible quality of life and cheap electricity... #CoalKeepsThe LightsOn #WeAreKY", "2019-05-14T20:28:11.000Z": "This massive project at the @CVGairport will be revolutionary for the region's workforce and for our state's overall economy. \n\nWe are grateful for @amazon 's long-term commitment to Kentucky, and we are proud to see this momentous new endeavor take flight. #WeAreKY", "2019-05-14T20:27:12.000Z": "Welcome to Kentucky, @JeffBezos ! \n\nWe are thrilled to celebrate this historic day, as @amazon officially breaks ground on its $1 billion-plus Prime Air shipping hub.", "2019-05-14T16:11:02.000Z": "31 years ago today, a horrific accident shocked Kentucky and our nation and resulted in positive changes to school bus construction that have saved countless lives through the years\n\nWe still grieve with those who grieve and we will never forget their loss Carrollton bus crash killed 24 kids, three adults in 1988 Drunken driver going wrong way on I-71 hit church bus returning from Kings Island on May 14, 1988. ◂ WCPO - 9 On Your Side brings you the latest trusted news... youtube.com", "2019-05-14T12:40:46.000Z": "Live now with @LelandShow on @NewsRadioWLAP...Tune in now: NewsRadio 630 WLAP - Lexington's News Talk Radio Lexington's News Talk Radio wlap.iheart.com", "2019-05-14T12:21:37.000Z": "Live now on WKYX with Greg Dunker...Join us! http:// v6.player.abacast.net/1046", "2019-05-13T22:15:00.000Z": "It's the perfect time to start your 'Beautify the Bluegrass' project! \n\nSubmit your projects, and before and after photos, to @KentuckyLiving > > > http:// kentuckyliving.com/beautify  #beautifyKY  #WeAreKY", "2019-05-13T18:41:56.000Z": "Read more in my op-ed with @IAGovernor , here: Opinion | Military spouses face added challenges while trying to find jobs. This could help. Too often they find themselves underemployed, with jobs few and far from the bases. washingtonpost.com", "2019-05-13T18:41:17.000Z": "I have seen firsthand how difficult it is for military spouses to find employment. \n\nListen to my interview with @hughhewitt in the video below to hear how Kentucky is leading the way in eliminating barriers for our military families. #WeAreKY Supporting Kentucky's Military Spouses Gov. Bevin on The Hugh Hewitt Show, May 2019 youtube.com"}