{"2020-03-14T19:09:54.000Z": "When Coach O speaks, we all listen.\n\nFor more information on how to prevent the spread of COVID-19, visit: http:// ldh.la.gov/Coronavirus/  @Coach_EdOrgeron  @LADeptHealth  #lagov  #lalege  #COVID19", "2020-07-30T17:15:06.000Z": "The @LADeptHealth reports 1,769 #COVID19 cases to the state today with 95 percent of cases from community spread. \n\nCOVID-19 is not done with Louisiana. #lagov", "2020-07-30T17:07:07.000Z": "The Louisiana Department of Health reports 1,769 #COVID19 cases reported to the state since July 29, 2020. The total number of cases reported to the state is 114,481.", "2020-07-30T15:30:02.000Z": "Be prepared this hurricane season. \n\nVisit the new http:// GetAGamePlan.org website for hurricane and emergency preparedness tips and information to protect you, your family and your business in the event of severe weather or the threat of a hurricane. #lagov  #lalege  #lawx", "2020-07-29T20:00:29.000Z": "When wearing a mask or face covering: Make sure it covers from the brim of your nose to underneath your chin Always wash your hands before and after touching your mask Don't touch the inside of the mask and adjust as little as possible #MaskUpLa  #lagov  #lalege", "2020-07-29T16:55:15.000Z": "", "2020-07-29T16:55:13.000Z": "The Louisiana Department of Health reports 1,735 #COVID19 cases reported to the state since July 28, 2020. The total number of cases reported to the state is 112,773.", "2020-07-29T16:34:03.000Z": "Louisiana is now first in the nation in per capita COVID-19 cases.\n\nJust one person's actions can stop the spread. If everybody would reduce the number of times they leave home, it would significantly diminish the impact of COVID-19 on our state and health care system. #lagov", "2020-07-28T22:54:59.000Z": "This assistance will give our workers the bridge they need to return to work, while ensuring that Louisiana businesses are able to focus their efforts on recovering safely from the COVID-19 pandemic. #lagov  #lalege", "2020-07-28T22:54:58.000Z": "If the trust fund falls below a balance of $100 million, Louisiana law mandates @LouisianaWorks to impose a surtax on businesses of up to 30% on taxable payroll. This would be a last resort but without intervention, it will almost certainly be necessary. #lagov  #lalege", "2020-07-28T22:54:57.000Z": "At our current trajectory, we will have to borrow from the federal government as early as September to replenish the fund to continue paying state unemployment benefits to Louisiana workers. #lagov  #lalege", "2020-07-28T22:54:56.000Z": "I have serious concerns about the solvency of the Trust Fund and the need for federal assistance to make sure Louisiana can continue to pay out unemployment benefits. Before the COVID-19 pandemic, our Unemployment Trust Fund was the 17th strongest in the nation. #lagov  #lalege", "2020-07-28T22:54:55.000Z": "Today, I sent a letter to Louisiana's congressional delegation asking them to consider funding the Unemployment Insurance Trust Fund in the current proposal for COVID-19 relief legislation as unemployment payments expire. #lagov  #lalege", "2020-07-28T21:45:17.000Z": ". @LouisianaGov ends his briefing, echoing Dr. Birx's message from today's teleconference, asking everyone to #MaskUp", "2020-07-28T21:38:21.000Z": ". @LouisianaGov : 'I don't think there's anybody out there trying to buy stocks and bonds with their unemployment benefit' #lagov  #COVID19", "2020-07-28T21:36:10.000Z": ". @LouisianaGov : I would encourage the federal government as they look at unemployment benefits that they would look at unemployment trust funds. It's critically important that we address this. @WAFB", "2020-07-28T21:29:15.000Z": "@LouisianaGov says we are going to have a busy hurricane season @wdsu", "2020-07-28T21:27:13.000Z": "46,265 people in Louisiana have been tested through the federally-sponsored surge sites statewide in July @LouisianaGov says", "2020-07-28T21:27:07.000Z": ". @LouisianaGov : Starting tomorrow we're bringing another surge site in NOLA in partnership with National Guard. With federal help, 46,265 Louisianians have been able to be tested in July. @WAFB", "2020-07-28T21:26:13.000Z": "No one should be getting multiple tests (to get a negative result) to go back to work - @LouisianaGov . @AlexBillioux also made this point in previous weeks as well", "2020-07-28T21:26:09.000Z": ". @LouisianaGov : We're working on getting those turnaround times down. The priority in testing needs to be for people with symptoms. If you are curious but are not showing symptoms we encourage you to go to a federally operated surge test site: http:// DoINeedACovid19test.com", "2020-07-28T21:25:28.000Z": "@LouisianaGov says do not get multiple tests to return to work. @wdsu", "2020-07-28T21:24:45.000Z": ". @LouisianaGov : Just like we're doing more testing here in Louisiana we've increased our testing here in Louisiana more than any other state in the nation. That has put a tremendous demand on labs. The turnaround time has gotten longer than we would have liked it to be. @WAFB", "2020-07-28T21:24:26.000Z": "@LouisianaGov We have done a tremendous amount of testing during the month of July - more than 500,000.", "2020-07-28T21:24:22.000Z": "On per capita basis, Louisiana has increased its testing more than any other state in July, @LouisianaGov says", "2020-07-28T21:23:43.000Z": ". @LouisianaGov says more than 500,000 COVID-19 tests done in July. State's monthly goal is 200,000. #lalege  #lagov", "2020-07-28T21:23:41.000Z": ". @LouisianaGov : We've conducted more than 500,000 tests in the month of July. 547,000 tests to be exact. Remember the goal is 200,000. @WAFB", "2020-07-28T21:23:12.000Z": ". @LouisianaGov on testing: More than 500k tests conducted in month of July", "2020-07-28T21:23:07.000Z": ". @LouisianaGov : If we want to go back to a Stay-at-Home order...bars were closed then too. So this is the best thing we can do for the economy overall and for public health. That doesn't make it easy. @WAFB", "2020-07-28T21:22:46.000Z": "\"There is no method for us to get to a transmission of less than 1 without mandatory mask orders and closing bars\" says @LouisianaGov \"This is the best thing we can do for the economy overall\"", "2020-07-28T21:22:28.000Z": ". @LouisianaGov : We wanted to allow them (bars) every opportunity to safely engage in business with respect to delivery, curbside pickup, that sort of thing. It's a tough restriction and I understand that and I apologize for that. But it's absolutely necessary. @WAFB", "2020-07-28T21:22:23.000Z": ". @LouisianaGov : 'There's nothing easy or painless about making decision to put restrictions on any business, but when have health emergency that is unprecedented have to take measures designed to promote safety and keep as much of the (economy) as possible open.' #lagov  #COVID19", "2020-07-28T21:22:20.000Z": "\"These are tough restrictions and I am aware of that. I apologize but they are absolutely necessary.\" @LouisianaGov", "2020-07-28T21:21:42.000Z": ". @LouisianaGov : I cannot allow so many people to get infected to reduce their ability to get access to adequate healthcare. @WAFB", "2020-07-28T21:12:43.000Z": ". @LAFIREMARSHAL Butch Browning now speaking about enforcement & Monday's news that four bars had their permits revoked (pending hearing) for not complying with @LouisianaGov restrictions", "2020-07-28T21:12:25.000Z": ". @LouisianaGov : We have had to suspend some alcohol permits after repeated warnings and continued to be non-compliant (on restrictions) #lagov  #COVID19", "2020-07-28T21:11:49.000Z": ". @LouisianaGov touts state Main Street #COVID fund for small biz. Grants up to $15K depending on impact #lagov  #lalege", "2020-07-28T21:09:53.000Z": ". @LouisianaGov says he's concerned that the state's unemployment trust fund is running out of money. If the state has to borrow money from the feds to replenish it, employers get hit with a new charge to help pay for it. He's asking Congress to provide aid #lalege  #lagov", "2020-07-28T21:09:25.000Z": ". @LouisianaGov : 'I am concerned with solvency of the (Louisiana) unemployment trust fund' #lagov  #COVID19", "2020-07-28T21:09:22.000Z": "We now on unemployment acknowledging this is the last week for PUA and the precarious solvency of the Louisiana Unemployment Trust. \n\nLaws in the state trigger higher taxes to get to financial solvency \n\n\"But this is not the time to raise taxes on employers\" says @LouisianaGov", "2020-07-28T21:09:21.000Z": ". @LouisianaGov : There are individuals concerned about unemployment benefits ($600/week). I know this is the last week of these federal benefits. Hopefully Congress will pass new legislation soon in order to have an additional period of time w/ an enhanced benefit for unemployed", "2020-07-28T21:08:43.000Z": ". @LouisianaGov : I know individuals concerned about (declining) unemployment benefits. Hopefully Congress pass new legislation soon for enhanced benefit #lagov", "2020-07-28T21:07:47.000Z": ". @LouisianaGov says \"everybody has a role to play.\" He reminds people to wear masks, social distance, stay home when you are sick, wash their hands, etc.\n\nIf everyone would cut their movements outside the home in half, we would greatly reduce the spread of #COVID19 .", "2020-07-28T21:07:43.000Z": "@LouisianaGov says we are hearing from our Regional Medical Directors that they are seeing increased adherence of masking - which is a great sign. We know wearing a mask and staying 6 feet from others work. We need to keep it up.", "2020-07-28T21:07:41.000Z": ". @LouisianaGov : 'If everybody would cut in half the number of times they leave their homes that would have a tremendous impact on reducing this disease' #lagov", "2020-07-28T21:07:28.000Z": "\"If everybody would cut in half how often they leave their homes it would significantly reduce the impact of this disease.\" @LouisianaGov", "2020-07-28T21:07:27.000Z": "If everybody would cut in half the number of times they leave the house, that would tremendously help cutdown on virus spreading, @LouisianaGov says", "2020-07-28T21:07:05.000Z": ". @LouisianaGov : Practically speaking - almost no asymptotic people are tested so they're not in these numbers. Even though they're not getting tested they're infectious. That's a real challenge for us and around the country. @WAFB", "2020-07-28T21:06:55.000Z": ". @LouisianaGov : 'No doubt more of this virus in Louisiana than any point so far' #COVID19  #lalege  #lagov", "2020-07-28T21:06:44.000Z": "25-40% of cases are asymptomatic.. \"Even though they are asymptomatic they are infected and they are infectious.\" @LouisianaGov", "2020-07-28T21:06:41.000Z": "@LouisianaGov If you take the number of cases and subtract the recoveries, you will see a 50k difference. 5 times higher than it was about six weeks ago in terms of active cases.", "2020-07-28T21:05:50.000Z": ". @LouisianaGov says COVID-19 hospitalization rates have been flat for six days, which he hopes is starting a trend. #lalege  #lagov", "2020-07-28T21:05:32.000Z": ". @LouisianaGov \"We're now number one in the country per capita in COVID-19 cases.\"", "2020-07-28T21:05:24.000Z": ". @LouisianaGov : Louisiana ranked No. 1 in per capita #COVID19 cases. 'Should be an alarm bell for everyone' #lagov  #lalege", "2020-07-28T21:05:21.000Z": ". @LouisianaGov : Louisiana is now ranked #1 for per capita cases across the United States. It puts us ahead of Arizona, New York, New Jersey. @WAFB", "2020-07-28T21:05:15.000Z": ". @LouisianaGov says Louisiana is No. 1 in cases per capita of COVID-19, ahead of Arizona at No. 2 and New York at No. 3. #lalege  #lagov", "2020-07-28T21:04:52.000Z": ". @LouisianaGov says over the last 6 days hospitalizations have been flat, and that is hopefully a good trend", "2020-07-28T21:04:50.000Z": "@LouisianaGov says over the past 6 days hospitalizations have been flat. @wdsu", "2020-07-28T21:04:43.000Z": ". @LouisianaGov : Hospitalizations declined: 'For me if any good news that number is it; first time happened in a long time and hopefully beginning of a trend' #lagov  #COVID19", "2020-07-28T21:03:49.000Z": ". @LouisianaGov : \"We are now two weeks out from the latest mitigation measures that were imposed, and I believe that we're starting to see an impact.\" #lalege  #lagov", "2020-07-28T21:03:41.000Z": ". @LouisianaGov : I believe we are starting to see an impact from the latest statewide mandate two weeks ago #coronavirus", "2020-07-28T21:03:29.000Z": ". @LouisianaGov : two weeks out since mask mandate/bar closures went into effect. Think we're seeing an impact, but too early too tell for certain", "2020-07-28T21:03:11.000Z": ". @LouisianaGov : Will dig deeper into the weeds Thursday (data) #lagov", "2020-07-28T21:02:59.000Z": "Edwards says \"We are seeing early signs of a plateauing of our cases which is obviously a good thing...But they're plateauing at a really high number of cases.\" #lalege  #lagov", "2020-07-28T21:02:51.000Z": "@LouisianaGov says we are seeing early signs of a plateau @wdsu", "2020-07-28T21:02:50.000Z": ". @LouisianaGov : 1,125 new #COVID19 cases - lowest single day number since July 6. 'Certainly a good thing but one day does not a trend make. Seeing early signs of plateauing of cases. That's good thing, but plateauing at high number #lagov", "2020-07-28T21:02:41.000Z": "@LouisianaGov says new mandates on bar closures and masks are working. The transmission rate appears to be going down.", "2020-07-28T21:02:26.000Z": "1,125 new cases reported Tuesday, lowest since July 6. @LouisianaGov says that is good news, but one day of data does not make a trend", "2020-07-28T21:02:25.000Z": "@LouisianaGov says 91% of cases are from community spread. @wdsu", "2020-07-28T21:01:39.000Z": ". @LouisianaGov is doing a covid briefing in a new bigger setting at GOHSEP. #lalege  #lagov", "2020-07-28T21:01:28.000Z": "We are live with @LouisianaGov from the @GOHSEP EOC. The Governor held a Unified Command Group briefing this morning and just finished a video conference with @VP and the White House Coronavirus Task force.", "2020-07-28T21:00:47.000Z": "NOW: @LouisianaGov is giving an update on the latest Coronavirus efforts in the state. Watch LIVE on @wdsu", "2020-07-28T21:00:09.000Z": "Afternoon from @GOHSEP ! @LouisianaGov here for his first scheduled #COVID19 briefing of the week", "2020-07-28T19:30:00.000Z": "Today, Gov. Edwards will provide an update on Louisiana's COVID-19 response at 4 p.m. : 4 pm : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov  #lagov  #lalege", "2020-07-28T17:12:36.000Z": "The @LADeptHealth is reporting 1,125 COVID-19 cases to the state since July 27. \n\n91% of the cases reported to the state today were community spread and 30% are of individuals aged 29 and under. #lagov  #lalege", "2020-07-28T16:57:06.000Z": "", "2020-07-28T16:57:05.000Z": "The Louisiana Department of Health reports 1,125 #COVID19 cases reported to the state since July 27, 2020. The total number of cases reported to the state is 111,038.", "2020-07-28T15:13:45.000Z": "Go to http:// DoINeedaCOVID19test.com to find one of the free COVID-19 testing sites operating throughout Louisiana. #lagov  #lalege Quote Tweet Louisiana Department of Health @LADeptHealth No-cost #COVID19 test sites are operating throughout Louisiana to stamp out community spread. For locations and to preregister, click here: https:// buff.ly/3g7KY73", "2020-07-27T20:47:25.000Z": "From Lafayette to Baton Rouge and New Orleans and across North Louisiana's I-20 Cyber Corridor, Louisiana is leading the way with cutting-edge tech firms creating quality jobs for our digital future. We are happy to welcome SchoolMint to our growing IT sector. #lagov  #lalege", "2020-07-27T20:47:24.000Z": "SchoolMint will create 178 new direct jobs with an average annual salary of more than $74,200, plus benefits. @LEDLouisiana estimates the project will result in another 219 new indirect jobs, for a total of 397 new jobs for Lafayette Parish and the Acadiana Region. #lagov  #lalege", "2020-07-27T20:47:23.000Z": "SchoolMint announced today the software company will consolidate its operations and transfer its headquarters from San Francisco to Lafayette. The company also will relocate offices from New York and Miami to Lafayette. #lagov  #lalege  : https:// gov.louisiana.gov/index.cfm/news room/detail/2615 ", "2020-07-27T17:21:35.000Z": "Today, @LADeptHealth is reporting 2,343 COVID-19 cases to the state since July 26. \n\nThe total number of cases reported to the state is 109,917. #lagov  #lalege", "2020-07-27T16:59:35.000Z": "The Louisiana Department of Health reports 2,343 #COVID19 cases reported to the state since July 26, 2020. The total number of cases reported to the state is 109,917.", "2020-07-27T16:33:26.000Z": "I'm deeply saddened to learn of the passing of Rep. Frank Howard. I had the pleasure of serving with Frankie in the House of Representatives, and his love for the people of our state and especially his district was evident every day. #lagov  #lalege", "2020-07-27T15:25:03.000Z": "COVID-19 is very prevalent throughout our state, and we are at a critical point in the fight to slow the spread in Louisiana. \n\nIt's on all of us to do our part and take the necessary precautions like wearing a mask and social distancing to keep Louisiana healthy. #lagov  #lalege", "2020-07-27T13:28:40.000Z": "No-cost #COVID19 test sites are operating throughout Louisiana to stamp out community spread. For locations and to preregister, click here: https:// buff.ly/2EpH4J1", "2020-07-26T23:30:00.000Z": "Masks or face-coverings are required in Louisiana for everyone 8 years of age or older. \n\nWearing a mask is the neighborly thing to do, and it's a simple way to keep Louisiana safe and healthy as we work together to reduce the spread of COVID-19 in our state. #MaskUpLa  #lagov", "2020-07-26T17:43:08.000Z": "Col. DePlysser was a long-time advocate of Barksdale Air Force Base and because of his dedication, commitment to volunteerism and his hard work to pass the Veterans Honor Medal Program, thousands of veterans and their family members are better off. #lagov  #lalege", "2020-07-26T17:43:07.000Z": "I count it a blessing to have known Col. DePlysser, it was truly an honor to celebrate his 100th birthday last year. His love for Shreveport- Bossier was infectious, and he served his community, state and nation with dignity and valor. #lagov  #lalege Col. Steven L. dePyssler, unofficial 'Mayor of Barksdale Air Force Base,' dies at 101 Retired Col. Steven L. dePyssler, affectionately known as the unofficial \"Mayor of Barksdale Air Force Base,'' died Saturday. amp.shreveporttimes.com", "2020-07-26T16:52:08.000Z": "The Louisiana Department of Health reports 3,840 #COVID19 cases reported to the state since July 24 (Friday). The total number of cases reported to the state is 107,574.", "2020-07-26T15:10:00.000Z": "Just one person's actions can help stop the spread of COVID-19 in Louisiana. \n\nBe a good neighbor and wear a mask, social distance, avoid congregating and stay home when possible. #lagov  #lalege", "2020-07-25T22:30:00.000Z": "Billions of dollars in funding are allocated to hospitals, public services, schools, and roads based on census data, and I urge everyone to do their part in shaping our communities by completing the 2020 Census today. #lagov  #LouisianaCounts Visit: http:// my2020census.gov", "2020-07-25T15:30:00.000Z": "If you need to talk to someone, you can get connected by texting REACHOUT to 741741 to reach a trained crisis counselor who will help de-escalate, identify coping strategies and use active listening techniques to support you. #lagov  #lalege", "2020-07-24T22:30:00.000Z": "Happy #FellowsFriday ! Today we're meeting Nicole Moore and Nicholas Hopkins. Nicole, a senior at @SouthernU_BR , is working with the community programs team in my office, and Nicholas, a senior at @NSULA , working with @GOHSEP  #lagov  #lalege", "2020-07-24T22:12:43.000Z": "I wish her well in her election and have every confidence in Acting Commissioner Legier's ability to continue successfully leading this agency. I look forward to working with him. #lagov  #lalege", "2020-07-24T22:12:42.000Z": "Louisiana Alcohol and Tobacco Control Commissioner Juana Lombard has resigned in order to run for Magistrate for the Orleans Parish Criminal District Court in the upcoming election, and I want to thank Commissioner Lombard for her dedicated service to our state. #lagov  #lalege", "2020-07-24T20:30:00.000Z": "Young people between the ages of 18-29 make up the majority of  COVID-19 cases in Louisiana, and they are not exempt from experiencing symptoms or spreading the virus.\n\nHear their stories. #MaskUpLa  #lagov", "2020-07-24T18:45:00.000Z": "There are several no-cost COVID-19 testing sites throughout the state of Louisiana that are open to anyone who needs a test. Though pre-registering is not required, it is encouraged. \n\nVisit http:// DoINeedACOVID19Test.com to find your location and pre-register. #lagov  #lalege", "2020-07-24T17:09:48.000Z": "Slowing the spread of #COVID19 is a bipartisan issue for Governors across the U.S. @LouisianaGov recently asked me why I wear a mask in #Ohio . The answer: To protect others & help Ohio's economic recovery. We're #InThisTogetherOhio ! @GovTimWalz , why do you #MaskUp in #Minnesota ? Quote Tweet John Bel Edwards @LouisianaGov 0:50 Thank you, @AsaHutchinson ! I wear a mask because we care about our neighbors in Louisiana. I also know that the more we #MaskUpLa , the sooner we can get back to crawfish boils, festivals and sports. \n\nWhy do you wear your mask up there in Ohio, @GovMikeDeWine ? #lagov  twitter.com/AsaHutchinson/", "2020-07-24T17:16:31.000Z": "Today, the @LADeptHealth is reporting 2,142 COVID-19 cases reported to the state since July 23. \n\n89% of today's cases are from community spread. #lagov  #lalege", "2020-07-24T15:00:09.000Z": "COVID-19 is very prevalent throughout our state, and it is more widespread than ever before. We are at a critical point, which is why everyone needs to take this virus seriously and continue all of the mitigation measures that we know will slow the spread. (7/8) #lagov  #lalege", "2020-07-24T15:00:08.000Z": "We've put in multiple redundant systems to scrub the data and to make sure it is accurate and timely. And we are sharing it with the public in a way that we can be as transparent as possible. (4/8) #lagov  #lalege", "2020-07-24T15:00:07.000Z": "For anyone out there minimizing the seriousness of the current COVID-19 situation across the state and deliberately spreading misinformation, you are doing yourself, your neighbor and Louisiana a terrible disservice. (1/8) #lagov  #lalege", "2020-07-23T21:52:11.000Z": "As Louisiana surpassed 100,000 known COVID-19 cases today, I have signed a renewal of the current proclamation extending Phase Two in the state, which includes the statewide mask mandate and additional restrictions, until August 7. : https:// gov.louisiana.gov/index.cfm/news room/detail/2609   #lagov  #lalege", "2020-07-23T20:12:06.000Z": ". @LouisianaGov on #COVID19 numbers: 'Nobody's cooking the books. It's grossly reckless and irresponsible' to spread rumors about state inflating numbers #lagov  #lalege", "2020-07-23T20:11:16.000Z": "On the \"misinformation campaign\" to undermine the state's coronavirus figures, Edwards says \"No one is out there cooking the books.\" He suggested if it was safe he would let people tour hospitals and see people who are on mechanical ventilators. #lalege  #lagov", "2020-07-23T20:10:03.000Z": "@LouisianaGov : \"If you want to be mad at me, be mad at me, but do it with a mask on.\"", "2020-07-23T20:08:45.000Z": "\"Even if for some strange reason that's totally incomprehensible to me you don't care about covid-19 you should care about that hospital capacity when you have an automobile accident,\" @LouisianaGov says. #lalege  #lagov", "2020-07-23T20:05:00.000Z": ". @LouisianaGov : my bigger concern in Louisiana today is about staffing #coronavirus It's hard to draw on staffing from other parts of the country, that's the bigger challenge right now", "2020-07-23T20:04:40.000Z": "@LouisianaGov bigger concern for staffing more than beds in hospitals", "2020-07-23T20:04:25.000Z": ". @LouisianaGov : My concern is not so much about hospital beds but about staffing #lagov  #lalege  #COVID19", "2020-07-23T19:58:32.000Z": ". @LouisianaGov : I'm encouraged today by the vast majority of biz, leaders and residents taking this seriously. We are at a critical point and everybody needs to do his or her part. I don't want to go back to Phase 1. It shouldn't be necessary #lagov  #COVID19", "2020-07-23T19:58:12.000Z": ". @LouisianaGov : we have serious numbers, but I am encouraged by the vast majority of people, business owners and leaders who are taking this seriously.\n\nWe are at a critical point. #coronavirus", "2020-07-23T19:57:08.000Z": "The governor also points out there is a \"misinformation campaign\" to undermine the state's data, saying they count each test as a new case (not how it works.) \"It is grossly irresponsible for people to be spreading misinformation\" about it, he says. #lalege  #lagov", "2020-07-23T19:57:01.000Z": "@LouisianaGov says, he don't want anyone to believe data is inaccurate because of rumors being spread about Covid-19 cases in the state. \n\nHe's also asking the people who are spreading the misinformation to stop.", "2020-07-23T19:56:59.000Z": ". @LouisianaGov says there's \"deliberate misinformation campaign\" suggesting Louisiana is double-counting cases for people who take multiple tests. Governor says that's not happening. \"Nobody should be paying attention to what any of those individuals are saying.\" #lalege  #lagov", "2020-07-23T19:56:46.000Z": ". @LouisianaGov : Unfortunately appears deliberate misinformation claim saying state inflating numbers by multiple positive tests on one person. 'Grossly irresponsible' People who test positive are only counted once #lagov  #COVID19", "2020-07-23T19:56:39.000Z": ". @LouisianaGov on claims of state reporting multiple positive cases from the same individuals: 'That is simply not the case' #coronavirus", "2020-07-23T19:55:01.000Z": ". @LouisianaGov says there is a free testing site for three days in downtown Baton Rouge at the Welcome Center. \n\nHe said he stopped by the site to get tested earlier in the day.", "2020-07-23T19:55:00.000Z": ". @LouisianaGov says he stopped at new surge center for test: 'It was easy; it was quick' #lagov  #COVID19", "2020-07-23T19:54:50.000Z": "There is also a new surge testing site -- for anyone, regardless of if they have symptoms -- at the welcome center downtown. @LouisianaGov says he got tested today and urged people who work downtown to go. it's here through Monday. #lalege  #lagov", "2020-07-23T19:54:30.000Z": ". @LouisianaGov : new surge testing site at the welcome center in downtown Baton Rouge....I encourage state workers to take advantage of this testing opportunity #coronavirus", "2020-07-23T19:54:27.000Z": ". @LouisianaGov : New surge testing site in BR at welcome center by Capitol. Open NOW #lagov  #COVID19", "2020-07-23T19:50:17.000Z": "Dr Henry Kaufman, of Our Lady of Lourdes, says \"Our hospital is full. Our icu is at or near capacity. This has significantly affected our normal operations.\" \n\nHe says they've pretty much stopped elective procedures--including stuff like heart bypasses--for 2 weeks #lalege  #lagov", "2020-07-23T19:46:47.000Z": ". @LouisianaGov joined by Lafayette area doctors talking about dangerous strain on hospital infrastructure. 'Our hospitals are full and our ICUs are full' Acadiana is hotspot for #COVID19  #lagov", "2020-07-23T19:46:44.000Z": "\"Our hospitals are full and our ICU is full,\" Logue says. \n\nShe says they don't have enough nurses to staff all their beds, because many have gotten sick #lalege  #lagov", "2020-07-23T19:44:42.000Z": "Dr. Amanda Logue, of Lafayette General, says in July the hospital has declined 87% of requests to transfer patients into their system because they're running out of space. They've transferred patients as far as Mississippi to clear space #lalege  #lagov", "2020-07-23T19:43:07.000Z": ". @LouisianaGov : Our Lady of the Lake Hospital in Baton Rouge will pause elective procedures that may require a person to take a bed in the hospital. #COVID19  #Coronavirus  @FOX8NOLA", "2020-07-23T19:42:29.000Z": "@LouisianaGov Hospitalizations are increasing statewide, but we're especially concerned about the Acadiana, Southwest and central regions because of the rate of the rise of cases and the constraints on hospitals in those areas.", "2020-07-23T19:40:58.000Z": ". @LouisianaGov says every Louisiana parish now reaches the high level of COVID-19 that the mask mandate is required. No parish can opt out. #lalege  #lagov", "2020-07-23T19:40:39.000Z": ". @LouisianaGov : There are no parishes that meet criteria to opt out of mask order #lagov  #lalege  #COVID19", "2020-07-23T19:40:35.000Z": "\"What worries me most is the toll this latest resurgence is taking on our capacity to deliver healthcare and the impact that is having on our health care professionals,\" Edwards says. #lalege  #lagov", "2020-07-23T19:40:29.000Z": ". @LouisianaGov says every parish in state now has high incidence of Covid-19.", "2020-07-23T19:40:23.000Z": ". @LouisianaGov says originally three parishes met the criteria to opt out of the mask mandate. \n\nAs of today, that is no longer correct. All parishes now have a \"high incidence\" of cases. The statewide mask mandate is in effect for the ENTIRE state of Louisiana.", "2020-07-23T19:39:39.000Z": ". @LouisianaGov : if we can get universal compliance with 'mitigation measures' then we can get back on top of the numbers and flatten the curve #coronavirus", "2020-07-23T19:39:38.000Z": ". @LouisianaGov : We have every reason to believe if we can get universal compliance with masking, social distancing, etc. that we can flatten the curve and get back on top of numbers without having to go back to Phase 1 #lagov  #Covid_19", "2020-07-23T19:39:18.000Z": ". @LouisianaGov : \"We are not where we want to be in Louisiana. We do not want to go back to 'Phase 1' or 'Phase 0'...We have every reason to believe if we can get universal compliance with masks, social distancing, etc...we can flatten the curve.\"", "2020-07-23T19:38:57.000Z": "@LouisianaGov COVID-19 is very prevalent throughout our state. That is why we are remaining in Phase 2. The new  proclamation that will be released today will become effective tomorrow and remain in place until Friday, August 7th.", "2020-07-23T19:38:55.000Z": "\"We don't want to go backwards in terms of going back to phase one or phase zero\" - @LouisianaGov", "2020-07-23T19:38:48.000Z": ". @LouisianaGov : we're certainly not where we want to be in Louisiana #coronavirus", "2020-07-23T19:38:36.000Z": ". @LouisianaGov signing new order today to continue statewide mask mandate, Phase 2, and bar closures through Aug. 4 at least #lagov  #COVID19", "2020-07-23T19:38:24.000Z": ". @LouisianaGov says he worries that people hear the COVID numbers day in and day out and become conllacement. He says hitting a milestone like surpassing 100k confirmed cases should be a \"reality check\" for people who seek to downplay the seriousness of this crisis.", "2020-07-23T19:38:02.000Z": ". @LouisianaGov : when you hit certain milestones, you hope people are taking this seriously and as a reality check #coronavirus", "2020-07-23T19:37:49.000Z": ". @LouisianaGov : One of fears I have people become accustomed to hearing numbers and stop paying attention but when hit milestones like 100K serves as reality check #COVID19  #lagov", "2020-07-23T19:36:52.000Z": "Louisiana has more than doubled its testing goal for the month of July. @LouisianaGov says we have dramatically expanded our testing capacity.", "2020-07-23T19:36:40.000Z": ". @LouisianaGov at his coronavirus briefing is joined by hospital officials from Lafayette, a hotspot for the surge in cases. #lalege  #lagov", "2020-07-23T19:36:27.000Z": ". @LouisianaGov : I will tell you know matter how you slice it death numbers very troubling #lagov  #lalege  #COVID19", "2020-07-23T19:35:55.000Z": ". @LouisianaGov starts by noting Louisiana has surpassed 100K COVID-19 cases: \"These are only the cases that we know about ... There are undoubtedly more.\" #lalege  #lagov", "2020-07-23T19:35:28.000Z": ". @LouisianaGov says State added 2,408 new Covid cases from yesterday. State now has over 101 thousand cases.", "2020-07-23T19:35:24.000Z": ". @LouisianaGov : \"The state has surpassed 100K cases...Of course, these are the cases we know about. There are undoubtedly more.\" ( @KSLA )", "2020-07-23T19:35:18.000Z": "2,408 new cases reported today, meaning state has surpassed 100k cases @LouisianaGov", "2020-07-23T19:35:10.000Z": "@LouisianaGov Today, we are reporting 2,408 new cases, which means that the state has now surpassed 100,00 total cases (101,650 to be exact). And of course, these are only the cases we know about.", "2020-07-23T19:35:08.000Z": ". @LouisianaGov begins presser: State surpassed 100K cases today #lagov  #lalege  #COVID19", "2020-07-23T19:33:51.000Z": ". @LouisianaGov starting his latest coronavirus briefing with medical officials on hand. #lalege  #lagov", "2020-07-23T19:31:11.000Z": "WATCH LIVE: @LouisianaGov is holding another briefing on the state's response to the #coronavirus pandemic as the number of #COVID19 19 cases confirmed since the beginning of the outbreak pushed past the 100,000-mark » https:// bit.ly/2OSOBBU  #lagov  #lanews", "2020-07-23T19:29:14.000Z": "WATCH LIVE: @LouisianaGov to hold coronavirus briefing at 2:30 p.m. #lagov  #lalege  @NBC6News WATCH LIVE: Gov. Edwards to hold coronavirus briefing at 2:30 p.m. Gov. John Bel Edwards will hold another briefing Thursday on the state's response to the coronavirus pandemic. arklatexhomepage.com", "2020-07-23T19:13:46.000Z": "Happening soon: @LouisianaGov will be joined by @JoeKanter from @LADeptHealth Dr. Amanda Logue, Senior Vice President/CMO of Lafayette General Hospital \n\nDr. Henry Kaufman, CMO of Our Lady of the Lourdes Quote Tweet John Bel Edwards @LouisianaGov Today, Gov. Edwards will provide an update on COVID-19 in Louisiana at 2:30 p.m. : 2:30 pm : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov  #lagov  #lalege", "2020-07-23T18:24:11.000Z": "WATCH LIVE - 7/23/20 - Gov. John Bel Edwards gives an update on COVID-19 (Coronavirus) at 2:30pm. https:// youtu.be/QUkE_H1oK-M  @LouisianaGov  #lalege  #lagov  #LPB", "2020-07-23T18:02:03.000Z": "Today, Gov. Edwards will provide an update on COVID-19 in Louisiana at 2:30 p.m. : 2:30 pm : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov  #lagov  #lalege", "2020-07-23T17:16:51.000Z": ". @LADeptHealth reports 2,408 COVID-19 cases to the state since July 22, 2020. The total number of cases reported to the state is 101,650.\n\n91% of the cases reported today were community spread. \n\nWear a mask. Practice social distancing. Avoid congregating. #lagov  #lalege", "2020-07-23T15:15:07.000Z": "Wearing a mask or face-covering in public is the neighborly thing to do. It's an easy way to protect one another and keeps Louisiana healthy and strong. #lagov  #MaskUpLa", "2020-07-22T23:30:00.000Z": "One person's actions can help stop the spread of COVID-19. Keep six feet of distance between yourself and others Wear a mask or face covering when out in public Stay home when possible Avoid touching your face Wash your hands frequently #lagov  #lalege", "2020-07-22T20:30:00.000Z": "It's up to all of us to do our part and stop the spread of COVID-19 in Louisiana by wearing masks when in public, practicing social distancing and washing our hands frequently. #lagov  #MaskUpLa", "2020-07-22T19:33:45.000Z": "Last week we inspected the Pass-A-Loutre WMA where work is underway to enhance five campgrounds & dredge five crevasses to improve public access to the property. This work is anticipated to be completed soon and is one of several Deepwater Horizon NRDA recreational use projects.", "2020-07-22T18:10:13.000Z": "Today, the @LADeptHealth reports 2,802 COVID-19 to the state since July 21, 2020. \n\n92% of the cases reported to the state today were community spread. \n\nCOVID-19 is not done with Louisiana. #lagov  #lalege", "2020-07-22T16:01:57.000Z": "UPDATE: The Department's daily COVID-19 update will be delayed until 1 p.m. today. http:// ldh.la.gov/coronavirus", "2020-07-22T15:04:44.000Z": "As we continue to monitor the tropical wave over the eastern Gulf of Mexico, now is the time to #GetAGamePlan . Southeastern Louisiana may experience wind and heavy rain starting Wednesday. \n\nVisit http:// GetAGamePlan.org to make sure your family is prepared. #lagov  #lawx", "2020-07-22T15:00:21.000Z": "I want to urge people to not get locked in on the forecast cone because the potential impacts could be felt outside of that. Please stay tuned for updates because any change in the current track or strength may deviate where the heaviest rain will be. #lagov  #lawx", "2020-07-21T21:30:16.000Z": "Please wear your face mask when you are in public, wash your hands frequently, stay 6 feet away from others and stay home when you are sick. Additionally, federal surge testing is going on in key areas of the state. #lagov  #lalege", "2020-07-21T21:30:15.000Z": "I will extend Louisiana's current Phase Two order, which also includes a statewide mask mandate, limits indoor social gatherings & prohibits on-premises consumption at bars, as new COVID-19 cases & hospitalizations continue to rise. : http:// gov.la.gov/PhaseTwoInfo  #lagov  #lalege", "2020-07-21T20:25:03.000Z": ". @LouisianaGov : it is my hope and my expectation that we will not have to go backwards but we'll do what we have to do to deliver life-saving care in our hospitals #coronavirus", "2020-07-21T20:24:00.000Z": "Asked repeatedly about schools, @LouisianaGov says @BESE_LA has set the regulations by phases, and school systems are deciding what's best for them. Governor says he has meetings planned with education stakeholders to discuss the school reopening plans. #lalege  #lagov  #laed", "2020-07-21T20:19:03.000Z": ". @LouisianaGov asked whether @AGJeffLandry is on the Unified Command Group calls/meetings. Governor said the attorney general has not been but the department has had a designee on the calls. #COVID19  #Coronavirus  @FOX8NOLA", "2020-07-21T20:17:11.000Z": ". @LouisianaGov discussing a tropical disturbance near Cuba which has the possibility to develop later this week. Reminds people that your \"game plan\" for a tropical system will be different this year. (NHC graphic as of 3pm, 07/21) #COVID19  #Coronavirus  @FOX8NOLA", "2020-07-21T20:15:38.000Z": "And @LouisianaGov closes by mentioning the potential for tropical weather - track takes the weather to Texas, but could be a rainmaker for parts of Louisiana. Visit http:// GetAGamePlan.org for preparedness info.", "2020-07-21T20:15:26.000Z": ". @LouisianaGov on tropical disturbance: expected to move into Gulf of Mexico later today. Southeastern Louisiana could start to feel effects as early as Wednesday", "2020-07-21T20:13:10.000Z": ". @LouisianaGov : The state is looking at additional federal Community Development Block Grants to add to the rental assistance program which was temporarily put on hold after tens of thousands applied. #COVID19  #Coronavirus  @FOX8NOLA  @LeeZurik", "2020-07-21T20:12:49.000Z": "189,000 or so applications submitted for Frontline worker compensation fund so far ($250) @LouisianaGov says. State has enough funds to pay 200k frontline workers through this program", "2020-07-21T20:11:26.000Z": ". @LouisianaGov : the initial $24 million for the rental assistance program will help around 7,500 people but we had more than 40,000 applications #coronavirus", "2020-07-21T20:11:11.000Z": ". @LouisianaGov \"You're safer at home than anywhere else. If everyone would decrease the number of times they're out, they'd decrease the likelihood they'd get infected and ultimately infect others as well.\"", "2020-07-21T20:10:16.000Z": ". @LouisianaGov : None of the decisions we've made have been made lightly #lagov  #lalege  #COVID19", "2020-07-21T20:12:27.000Z": ". @LouisianaGov : 189,000 applications for $250 hazard pay check for front-line individuals. Money for about 11,000 more before runs out #lagov  #lalege  #COVID19", "2020-07-21T20:09:57.000Z": ". @LouisianaGov says New Orleans convention center currently set up with 250 beds, has staffing for 60 beds and contract to boost staffing to 120 beds. 20 patients there today. #lalege  #lagov", "2020-07-21T20:09:30.000Z": ". @LouisianaGov will also extend his mask mandate and bar closures until that date. @BRProudNews  #lagov  #lalege Quote Tweet Harrison Golden @harrisongolden . @LouisianaGov extending Phase Two order another two weeks, until Friday, Aug. 7. @BRProudNews  #lagov  #lalege", "2020-07-21T20:09:20.000Z": ". @LouisianaGov : the good news is that White House modeling shows that we don't have to return to Phase 1 or 0 to flatten the curve #coronavirus But you do have to wear masks, close the bars and decrease crowd sizes", "2020-07-21T20:09:01.000Z": ". @LouisianaGov says that one week is not long enough to see if new mitigation measures are making an impact. @LouisianaGov 's mask mandate, bar restrictions and gathering size limitations have only been in place for 8 days. We need 14-21 days of data.", "2020-07-21T20:09:09.000Z": ". @LouisianaGov says he knows bar closures creating economic hardships, but believes it's essential #lagov  #lalege  #COVID19", "2020-07-21T20:04:07.000Z": ". @LouisianaGov : Mask usage is incredibly important (for schools to be able to open safely) #lagov  #lalege  #COVID19", "2020-07-21T20:03:56.000Z": ". @LouisianaGov : you're going to see a variety of approaches by our school districts with respect to when and how they open...but with the CDC guidelines to be as safe as we can #coronavirus", "2020-07-21T20:03:41.000Z": ". @LouisianaGov says schools will open in whatever phase state is in. That is how schools will operate.", "2020-07-21T20:03:06.000Z": ". @LouisianaGov : At end of day schools will open and whatever phase we're in will dictate how they operate. You're going to see a variety of approaches #lagov  #COVIDー19  #lalege", "2020-07-21T19:49:50.000Z": ". @LouisianaGov is also extending mask mandate and bars by two weeks #lagov  #lalege  #COVID", "2020-07-21T19:46:12.000Z": "@AlexBillioux says \"we have clearly turned a corner in the wrong direction\" as hospitalizations statewide climb.", "2020-07-21T19:42:31.000Z": ". @LouisianaGov will keep Louisiana in Phase 2 until August 7, extending the current restrictions that were slated to expire next week. @WAFB", "2020-07-21T19:42:29.000Z": ". @LouisianaGov says he's keeping current Phase 2 level restrictions in place in Louisiana for another two weeks, through Aug. 7. #lalege  #lagov", "2020-07-21T19:42:28.000Z": "BREAKING: @LouisianaGov extends #COVID19 phase two across #Louisiana until Friday, August 7. @wdsu", "2020-07-21T19:42:26.000Z": ". @LouisianaGov extends 'Phase 2' order for another two weeks. This will be signed on Friday and will last Aug. 7. (. @KSLA )", "2020-07-21T19:42:24.000Z": ". @LouisianaGov \"We still have a lot of COVID-19 in Louisiana. More than what we want and it's widespread across the state.\"", "2020-07-21T19:42:10.000Z": ". @LouisianaGov extends Phase 2 for additional 2 weeks \n\n\"still a lot of COVID in Louisiana....still widespread across the state\" @BRProudNews", "2020-07-21T19:42:09.000Z": "@LouisianaGov announces the extension of phase 2 for an additional two weeks", "2020-07-21T19:42:05.000Z": ". @LouisianaGov extending Phase Two order another two weeks, until Friday, Aug. 7. @BRProudNews  #lagov  #lalege", "2020-07-21T19:41:55.000Z": "@LouisianaGov announces that the Phase 2 order has been extended for 2 weeks through Aug. 7.", "2020-07-21T19:41:47.000Z": "JUST IN: @LouisianaGov extending Phase 2 another two weeks through August 7. Effective Friday", "2020-07-21T19:41:32.000Z": ". @LouisianaGov : We still have lot of #COVID19 COVID in Louisiana and is widespread across state #lagov  #lalege", "2020-07-21T19:41:28.000Z": "BREAKING: @LouisianaGov extends current Phase 2 order, with statewide mask mandate, crowd size limit of 50 and closure of bars to on-site consumption for another two weeks. Would have ended on Friday. Will now be extended until August 7.", "2020-07-21T19:41:01.000Z": ". @LouisianaGov says biggest concern is hospitalizations which have been going up over the past few weeks.", "2020-07-21T19:40:55.000Z": "Hospitalizations per capita in upwards trajectory in all nine @LADeptHealth regions across state @LouisianaGov says for last 14-day period", "2020-07-21T19:40:54.000Z": ". @LouisianaGov \"My biggest concern is hospitalizations per capita. Over the last 14 days there has been an upward trajectory, which is a concern because there's only so many beds.\"", "2020-07-21T19:40:30.000Z": ". @LouisianaGov : COVID-19 hospitalizations per capita \"is a particular concern... There are only so many beds, so many doctors and nurses and so forth.\" @BRProudNews  #lagov  #lalege", "2020-07-21T19:40:24.000Z": ". @LouisianaGov : my biggest concerns of hospitalizations per capita are at an upward trajectory across Louisiana #coronavirus", "2020-07-21T19:40:21.000Z": ". @LouisianaGov : My biggest concern hospitalizations per capita in upward surge throughout Louisiana - only so many beds, doctors, nurses available #lagov  #lalege  #COVID19", "2020-07-21T19:39:22.000Z": ". @LouisianaGov says officials are seeing positivity rates \"well in excess\" of 10% in several spots across Louisiana", "2020-07-21T19:39:14.000Z": ". @LouisianaGov : Seeing positivity factors exceeding 10%, which is above target baseline #lagov  #laleg  #COVID", "2020-07-21T19:39:07.000Z": ". @LouisianaGov : community spread is still a major problem in Louisiana....we're also seeing positivity factors well in excess of 10 percent #coronavirus", "2020-07-21T19:38:49.000Z": ". @LouisianaGov \"Community spread is still a major problem in Louisiana.\"", "2020-07-21T19:38:40.000Z": ". @LouisianaGov : Community spread is still a major problem in Louisiana and many of the cases we're seeing are coming from those younger than 29. #lalege  #lagov  #COVID19", "2020-07-21T19:38:36.000Z": ". @LouisianaGov standing next to a slide with numbers of COVID-19 tests, cases and deaths. @BRProudNews  #lagov  #lalege", "2020-07-21T19:37:43.000Z": "@LouisianaGov says, there's now a 5th site in Alexandria for surge testing.", "2020-07-21T19:37:32.000Z": ". @LouisianaGov says surge testing site open in Alexandria #lagov  #lalege  #COVID", "2020-07-21T19:36:56.000Z": ". @LouisianaGov says state has done more than 374,000 coronavirus tests in July. More than 33,000 tests done at the Baton Rouge surge sites set up with the federal government. #lalege  #lagov", "2020-07-21T19:36:38.000Z": "As of yesterday more than 33k people have been tested at surge sites, including 5 locations in capital area @LouisianaGov says.\n\nLast week JBE said some of those tests were heading to Acadiana/Lake Charles", "2020-07-21T19:36:30.000Z": ". @LouisianaGov says State has done a little  over 1.1 million tests since start of coronavirus.", "2020-07-21T19:36:04.000Z": ". @LouisianaGov : more than 1.1 million tests since the beginning of this public health emergency #coronavirus", "2020-07-21T19:35:56.000Z": "@LouisianaGov notes that over 1.1 million tests have been completed in Louisiana.", "2020-07-21T19:35:15.000Z": "Louisiana is now ranked 2 when it comes to Covid-19 cases per capita. \n\nToday, there are 1,737 news cases of #Covid19 in the state for a total of 96,583 according to @LouisianaGov", "2020-07-21T19:34:59.000Z": ". @LouisianaGov giving his COVID-19 response update from the State Capitol.\n\nThis comes days before the current version of his Phase Two order is set to expire. @BRProudNews  #lagov  #lalege", "2020-07-21T19:34:58.000Z": ". @LouisianaGov says state now No. 2 per capita in #COVID cases #lagov", "2020-07-21T19:34:39.000Z": ". @LouisianaGov : 2.08 percent of our Louisiana population has tested positive for #coronavirus , second highest per capita nationally", "2020-07-21T19:34:34.000Z": "@LouisianaGov says that just over 2% of Louisiana residents have tested COVID-positive, ranking Louisiana #2 in the nation per capita.", "2020-07-21T19:34:15.000Z": "Louisiana now 2nd per capita in #COVID19 cases in United States per @LouisianaGov", "2020-07-21T19:33:28.000Z": ". @LouisianaGov says there will now be two weekly briefings going forward. Plan is Tues/Thurs", "2020-07-21T19:32:57.000Z": "Afternoon everybody! @LouisianaGov has arrived for a Tuesday #COVID19 briefing. \n\nMore than 1700 new cases reported today while hospitalizations and ventilator usage We're anticipating news on state's next steps in reopening process", "2020-07-21T19:32:53.000Z": ". @LouisianaGov starting his latest coronavirus briefing. #lalege  #lagov", "2020-07-21T19:30:38.000Z": ". @LouisianaGov  #COVID presser set to start now #lagov  #lalege", "2020-07-21T19:31:57.000Z": ". @LouisianaGov 's press conference on #coronavirus is starting soon.... #lalege  #lagov", "2020-07-21T19:29:07.000Z": "WATCH LIVE: @LouisianaGov to give briefing on COVID-19 response at 2:30 p.m. #lagov  #lalege Gov. Edwards to extend Phase Two order for two more weeks Gov. John Bel Edwards announced Tuesday that he will be extending the current Phase Two emergency order another two weeks. arklatexhomepage.com", "2020-07-21T19:21:46.000Z": "Keep up with @LouisianaGov press conference updates here, y'all Watch: Gov. John Bel Edwards explains why Louisiana will remain in Phase 2 Gov. John Bel Edwards announced he will hold a press conference on Tuesday afternoon at 2:30 p.m. to address the state of the coronavirus pandemic even as Louisiana's Phase 2 theadvocate.com", "2020-07-21T19:26:59.000Z": "You can also watch today's update from @LouisianaGov on @BRProudNews  #FOX44  #NBCLocal33 and http:// brproud.com  #coronavirus Quote Tweet John Bel Edwards @LouisianaGov Today at 2:30 p.m., Gov. Edwards will provide an update on Louisiana's ongoing response to COVID-19. : 2:30 p.m. : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov  #lagov  #lalege", "2020-07-21T18:00:01.000Z": "Today at 2:30 p.m., Gov. Edwards will provide an update on Louisiana's ongoing response to COVID-19. : 2:30 p.m. : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov  #lagov  #lalege", "2020-07-21T17:28:23.000Z": "UL Lafayette is proud to be a part of the Acadiana Safe initiative, a community-wide campaign to reduce the spread of COVID-19 through mask-wearing, social distancing and good hygiene. The initiative was announced Monday at the Student Union. Read more: https:// louisiana.edu/news-events/ne ws/20200721/university-backs-acadiana-safe-campaign-reduce-covid-19 ", "2020-07-21T17:08:17.000Z": "Today, @LADeptHealth is reporting 1,737 new COVID-19 cases to the state since July 20. #lagov  #lalege", "2020-07-21T17:00:58.000Z": "The Louisiana Department of Health reports 1,737 #COVID19 cases reported to the state since July 20, 2020. The total number of cases reported to the state is 96,583.", "2020-07-21T15:00:02.000Z": "Text 'LAGOV' to 67283 to receive important updates and information from the Governor's Office directly to your phone. #lagov  #lalege", "2020-07-20T20:47:45.000Z": "@LouisianaGov announces construction is now underway on components of a permanent floodgate on Bayou Chene below Morgan City that will provide flood protection to over 100,000 residents in a six-parish region. Gov. Edwards Announces Construction is Underway on Permanent Floodgate at Bayou Chene in St. Mary... \"Thankfully, sinking barges has been successful, but it is a costly and short-term approach. This permanent structure will provide a reliable, long-term solution for the people and businesses in this... mailchi.mp", "2020-07-20T20:00:10.000Z": "We know this project is important and we are doing our best to compress the timeline to get this structure in place as soon as possible. #lagov  #lalege", "2020-07-20T20:00:09.000Z": "I am happy to announce that construction is now underway on components of a permanent floodgate on Bayou Chene below Morgan City that will provide flood protection for portions of six parishes. : http:// gov.louisiana.gov/index.cfm/news room/detail/2603   #lagov  #lalege", "2020-07-20T19:05:53.000Z": "When wearing a mask or face covering: Make sure it covers from the brim of your nose to underneath your chin Always wash your hands before and after touching your mask Don't touch the inside of the mask and adjust as little as possible #MaskUpLa  #lagov  #lalege", "2020-07-20T17:30:18.000Z": "SNAP Text Message Alerts\n\nDCFS is now sending SNAP applicants and recipients valuable program information to their mobile devices. Get more info at https:// bit.ly/3fyENIL . #COVID19  #coronavirus  #foodstamps", "2020-07-20T17:00:01.000Z": "", "2020-07-20T17:00:00.000Z": "The Louisiana Department of Health reports 3,187 #COVID19 cases reported to the state since July 19, 2020. The total number of cases reported to the state is 94,892.", "2020-07-20T16:30:14.000Z": "Big news! Stephenson Technologies Corp., @LSU 's applied research entity, has won a $25 million federal contract for groundbreaking work to protect Louisiana's energy infrastructure. #lagov  #lalege  : http:// gov.louisiana.gov/index.cfm/news room/detail/2602 ", "2020-07-20T15:16:02.000Z": "Be prepared this hurricane season. \n\nVisit the new http:// GetAGamePlan.org website for hurricane and emergency preparedness tips and information to protect you, your family and your business in the event of severe weather or the threat of a hurricane. #lagov  #lalege  #lawx", "2020-07-20T13:23:44.000Z": "If you are inclined, please join me, @FirstLadyOfLA and faith leaders from across Louisiana in prayerful reflection and fasting on these three days. I encourage and welcome people of all faiths and denominations to participate. #lagov  #lalege", "2020-07-20T13:23:43.000Z": "Starting today, I am beginning three days of fasting and prayer for our state through July 22. The people of Louisiana need our prayers right now. #lagov  #lalege", "2020-07-19T23:30:00.000Z": "When you wear a mask, you protect others. When others wear a mask, they protect you. #MaskUpLa  #lagov  #lalege", "2020-07-19T16:52:05.000Z": "", "2020-07-19T16:52:03.000Z": "The Louisiana Department of Health reports 3,119 #COVID19 cases reported to the state since July 17, 2020 (Friday). The total number of cases reported to the state is 91,706.", "2020-07-19T14:30:00.000Z": "COVID-19 is more rampant in Louisiana now than it has ever been. We now have a statewide epidemic, it is no longer one or two regions driving case growth.\n\nIt's on all of us to do better and wear masks in public, practice social distancing and avoid congregating. #lagov  #lalege", "2020-07-18T22:32:27.000Z": "Today, I issued an executive order that flags be flown at half-staff in honor of the life and legacy of Rep. John Lewis, civil rights pioneer and icon. #lagov  #lalege", "2020-07-18T21:30:00.000Z": "COVID-19 is not done with Louisiana. \n\nWear a mask. Practice social distancing. Wash your hands. Avoid congregating. #lagov  #lalege", "2020-07-18T15:55:18.000Z": "UPDATE: As of today, information on our #COVID19 dashboard will be updated at noon daily except on Saturdays. The next update will occur tomorrow (Sunday) at noon.", "2020-07-18T15:26:16.000Z": "Rep. John Lewis was a civil rights icon who challenged unfair systems and fought for equality. His passing is a great loss. #JohnLewis  #lagov", "2020-07-18T15:00:02.000Z": "If you need to talk to someone, you can get connected by texting REACHOUT to 741741 to reach a trained crisis counselor who will help de-escalate, identify coping strategies and use active listening techniques to support you. #lagov  #lalege", "2020-07-17T22:03:00.000Z": "It's #FellowsFriday ! Today, we're meeting Simone Craven, Patrick Riley, Revathi Menon and Zaige Willis. Simone is a senior at @SouthernU_BR working with the Resilient Louisiana Commission & Patrick is a junior at @CentenaryLA working with Alcohol & Tobacco Control. #lagov  #lalege", "2020-07-17T20:37:00.000Z": "Big news! This will allow us to reinvest back into flood protection and coastal restoration projects. We are grateful for the continued support of our federal partners as we work together to protect our coast and communities. @LouisianaCPRA  #lagov  #lalege House bill would allow renegotiation of Louisiana's $100 million annual Katrina levee debt Louisiana may significantly trim the $100 million annual bill it pays to cover its share of the $14.6 billion post-Katrina New Orleans area hurricane protection system if a gambit by nola.com", "2020-07-17T18:30:00.000Z": "Today, the @LADeptHealth reports 2,179 cases to the state. The total number of cases reported to the state is 88,590.\n\n96% of the cases reported to the state today were community spread. \n\n36% of the cases reported today are of individuals aged 29 and under. #lagov  #lalege", "2020-07-17T16:55:34.000Z": "@LouisianaGov asks @AGJeffLandry why he professes not to know what a \"face covering\" is when there's a sign outside the AG's office that reads, \"STOP -- Face Coverings MUST be worn in this building...\" https:// gov.louisiana.gov/index.cfm/news room/detail/2598 ", "2020-07-17T16:37:15.000Z": "It is regrettable that the Attorney General was unable to attend the meeting with the Vice President on Tuesday. Had he been present, I believe he would have received answers to the questions in his letter and some clarity on how precarious the situation is. #lagov  #lalege", "2020-07-17T16:37:14.000Z": "Since I have allowed facts, data, and experts to guide my decisions as we respond to this global pandemic, I felt it was important to provide @AGJeffLandry with the same in my response to his letter, which is not legally binding. : http:// gov.la.gov/TheFacts  #lagov  #lalege", "2020-07-16T19:24:10.000Z": "Work continues on the West Belle Headland, the first of three Terrebonne Barrier Islands being restored with dredged material from ship shoal. These islands provide critical protection to the coastal communities. @LouisianaGov  @NFWFnews", "2020-07-17T15:00:17.000Z": "ICYMI: Yesterday, Louisiana announced a new $24 million emergency rental assistance program for renters experiencing financial hardship as a result of the coronavirus pandemic. : http:// gov.louisiana.gov/index.cfm/news room/detail/2595   #lagov  #lalege", "2020-07-15T20:00:06.000Z": "My statement on the Attorney General's politically motivated opinion. #lagov  #lalege", "2020-07-15T19:54:02.000Z": ". @LouisianaGov responds to what he's calling a 'politically motivated' opinion by @AGJeffLandry on his state-wide mask mandate, and opinion on closing bars as well. @WAFB", "2020-07-15T19:43:53.000Z": ". @LouisianaGov says if there is enough compliance with mitigation measures he doesn't believe the state will have to impose more restrictions or retreat to Phase 2 #lagov  #lalege  #COVID19", "2020-07-15T19:42:57.000Z": "Restaurant Association exec estimates 25% of Louisiana restaurants won't survive, but says @LouisianaGov has been engaged with the industry #lagov  #lalege", "2020-07-15T19:40:31.000Z": ". @LouisianaGov : it's not reopening that has led to resurgence of #COVID19 in Louisiana, it's behavior.", "2020-07-15T19:37:46.000Z": ". @LouisianaGov : Universal mask wearing is critically important to safely reopening schools #lagov  #lalege  #COVID19", "2020-07-15T19:13:56.000Z": ". @LouisianaGov reacting to the opinion by @AGJeffLandry on his call-in show on WRKF: \"We know we're doing what's right. We know we're doing what's authorized by the law.\" #COVID19  #Coronavirus  @FOX8NOLA", "2020-07-15T19:13:05.000Z": ". @LouisianaGov : It's unfortunate ( @AGJeffLandry opinion), but we know what we're doing is right. Hope he would rescind opinion and get back to where he was with me three months ago #lagov  #lalege  #COVID", "2020-07-15T19:12:25.000Z": "On his radio show, @LouisianaGov defends his mask mandate as \"clearly within the authority I have.\" He says mandate is warranted by the circumstances. He notes that opinion does not carry force of law. #lalege  #lagov Quote Tweet Melinda Deslatte @MelindaDeslatte Louisiana Attorney General Jeff Landry says Gov. John Bel Edwards' statewide mask mandate likely illegal, unenforceable https:// apnews.com/58048c87bec97b 40bdd9ef7ea013f86b  (from @AP ) #lalege  #lagov", "2020-07-15T19:11:34.000Z": ". @LouisianaGov : On March 18 @AGJeffLandry stood with me and said he was united with me in protecting health of state #lagov  #lalege", "2020-07-15T19:11:17.000Z": ". @LouisianaGov reacting to the opinion by @AGJeffLandry on his call-in show on WRKF: \nThere's no doubt in my mind that what we did is warranted by COVID-19 and it's required. He said it is within his powers under the emergency orders. #COVID19  #Coronavirus  @FOX8NOLA", "2020-07-15T19:10:20.000Z": ". @LouisianaGov : @VP expressed complete support for actions we've taken here (while at LSU Tuesday) #lagov  #lalege  #COVID", "2020-07-15T19:09:40.000Z": ". @LouisianaGov addressing @AGJeffLandry opinion that governor's mask mandate illegal: There's no doubt in my mind what we did is not just warranted by circumstances, but required and clearly within legal authority I have #lagov  #lalege  #COVID", "2020-07-15T19:08:54.000Z": ". @LouisianaGov 's monthly radio show kicking off. \n\nHe's being joined by Tina Stefanski, Region 4 (Acadiana) Office of Public Health. Representative from Louisiana Restaurant Association will be joining JBE later", "2020-07-15T18:15:23.000Z": "Gov. Edwards will host his 52nd monthly statewide call-in radio show, Ask the Governor at 2 p.m. today on @WRKF . : 2 p.m. : 89.3 FM @WRKF  : http:// gov.la.gov  #lagov  #lalege", "2020-07-15T17:45:00.000Z": "Today, @LADeptHealth reports 2,095 cases reported to the state since July 14, 2020. The total number of cases reported to the state is 84,131.\n\n90% of the cases reported today were community spread. #lagov  #lalege", "2020-07-15T17:05:48.000Z": "While we know there are still issues related to the availability of testing supplies and some reports of test results being backlogged, I am hopeful that our continued push to test as many Louisianans as we can will result in reducing the spread of COVID-19 in our state. #lagov", "2020-07-15T17:05:47.000Z": "Louisiana surpassed a major testing milestone today, having now conducted more than 1 million COVID-19 tests since March. This would not be possible without our federal, state & local governments working together with health care providers. #lagov  : https:// gov.louisiana.gov/index.cfm/news room/detail/2593 ", "2020-07-15T16:54:38.000Z": "", "2020-07-15T16:54:37.000Z": "The Louisiana Department of Health reports 2,095 cases reported to the state since July 14, 2020. The total number of cases reported to the state is 84,131.", "2020-07-15T15:35:51.000Z": "@larevenue News Release: Network connectivity issues affecting LDR web applications http:// story.cd/AAOXjH", "2020-07-15T15:15:59.000Z": "Masks or face-coverings are now required in Louisiana for everyone 8 years of age or older. \n\nWearing a mask is the neighborly thing to do, and it's a simple way to keep Louisiana safe and healthy as we work together to reduce the spread of COVID-19 in our state. #MaskUpLa  #lagov", "2020-07-15T14:00:33.000Z": "No-cost #COVID19 test sites are operating throughout East Baton Rouge Parish to stamp out community spread. For locations and to preregister, click here: https:// buff.ly/3fx0hWQ", "2020-07-14T22:30:24.000Z": "I want to thank VP @Mike_Pence and the members of the White House Coronavirus Task Force for coming to Louisiana today as cases rise throughout the state. We are grateful to have the support of our federal partners as we continue to combat the spread COVID-19 in Louisiana. #lagov", "2020-07-14T20:43:11.000Z": "It's always a good idea to wear a mask - @VP says, when asked if he supports @LouisianaGov 's mask mandate. \n\nPence also says he supports measures and actions JBE has put in place across state", "2020-07-14T20:40:54.000Z": "Asked if he supports state mask mandates like the one @LouisianaGov implemented, Pence says the White House supports JBE's decisions and \"we encourage people to heed the advice.\" #lalege  #lagov", "2020-07-14T20:35:36.000Z": ". @LouisianaGov : \"We are going to open up our schools, lord willing, and we're going to do that in about a month from now.\" @BRProudNews  #lagov  #lalege", "2020-07-14T20:34:16.000Z": "\"Our plan is to open as many schools k-12 higher ed for in person instruction on campus as we can safely do,\" @LouisianaGov says. State education board is crafting rules today. #lalege  #lagov", "2020-07-14T20:18:22.000Z": "Dr. Birx now speaking are @LouisianaGov briefing says pandemic now different in Louisiana than a few months ago bc #COVID19 isn't focused in NOLA anymore, but statewide. Says wear your masks!", "2020-07-14T20:18:16.000Z": "\"I believe in prayer and I believe in work. And we do both here on Louisiana,\" @LouisianaGov says, noting that he is optimistic that Louisiana can turn things around. #lagov  #lalege", "2020-07-14T20:17:55.000Z": ". @LouisianaGov : \"I believe in prayer and I believe in work, and we're gonna do both here in Louisiana.\"", "2020-07-14T20:17:41.000Z": ". @LouisianaGov tells @VP that Louisiana is in better shape today because of the help of the White House Task Force #coronavirus", "2020-07-14T20:17:32.000Z": ". @LouisianaGov : \"I believe in prayer and I believe in work. We're going to continue to do both.\" @BRProudNews  #lalege  #lagov", "2020-07-14T20:16:40.000Z": ". @LouisianaGov : we're going to get back on top of this and flatten the curve, and we look forward to the day that we put this virus behind us #coronavirus", "2020-07-14T20:16:10.000Z": "@VP Mike Pence says: \"Wear a mask whenever state and local authorities say it's indicated\" ... \"We're all in this together.\" @LouisianaGov  @IlluminatorLA", "2020-07-14T20:16:09.000Z": "\"We don't want to go back to phase one or phase zero but to do that we have to wear masks and we have to social distance\" - @LouisianaGov", "2020-07-14T20:15:58.000Z": ". @LouisianaGov says we are going to do what we need to do to get back in front of the virus, to flatten the curve again and to protect the most vulnerable. #lagov  #lalege", "2020-07-14T20:15:51.000Z": ". @LouisianaGov : We are going to have to sure we wear masks, social distance and limit our gatherings. #lagov  #lalege", "2020-07-14T20:15:48.000Z": ". @LouisianaGov noted the state's massive testing effort: \"It wouldn't be possible without the support we've received from the White House Coronavirus Task Force.\" This week the state will surpass 1M tests since pandemic started, he said.", "2020-07-14T20:15:43.000Z": "We can continue in Phase 2, @LouisianaGov says but need to social distance, wear masks, limit social gatherings", "2020-07-14T20:15:32.000Z": ". @LouisianaGov : \"It's really pretty simple at this point. We don't want to go backwards.\" @BRProudNews  #lagov  #lalege", "2020-07-14T20:15:07.000Z": "This week we will exceed 1,000,000 tests since pandemic started - @LouisianaGov JBE says his commitment to @VP and the state's residents - we are going to do what's needed to get back in front of this virus", "2020-07-14T20:15:05.000Z": ". @LouisianaGov : We have more cases, we have rising positivity and rising hospitalizations. We're going to do what's required to get back in front of this virus and flatten the curve again #lagov  #lalege", "2020-07-14T20:14:51.000Z": ". @LouisianaGov : \"This week we will exceed one million tests\" as a state. @BRProudNews  #lagov  #lalege", "2020-07-14T20:14:36.000Z": ". @VP says he supports @LouisianaGov decision to pause further reopening of state. Pence also urges people to follow the guidance of state and local officials on wearing masks. #lalege  #lagov", "2020-07-14T20:14:29.000Z": "@LouisianaGov says this week state will exceed a million tests. @wdsu", "2020-07-14T20:13:21.000Z": "And @VP asks the people of Louisiana a to follow state and local orders on wearing a mask. He says the White House supports @LouisianaGov 's decision to \"pause\" reopening in Phase 2. #lagov  #lalege", "2020-07-14T20:13:20.000Z": "LIVE: @VP supports the mandates of @LouisianaGov : We all have a role to play. We want to encourage all residents of Louisiana to adhere to the guidance of state and local health officials. #COVID19", "2020-07-14T20:13:14.000Z": ". @VP says White House supports @LouisianaGov decision to pause reopening (kept state in Phase 2) #lagov  #lalege  #COVID19", "2020-07-14T20:12:31.000Z": ". @VP urges residents to follow guidance of @LouisianaGov and local officials to slow spread of #COVID19 again. \n\nPence specifically says wear a mask, especially when local/state government says to do so", "2020-07-14T20:05:10.000Z": ". @VP credits @LSU 's innovative ideas to reopen schools safely this fall. \n\nPence says he assured @LouisianaGov the feds will help supplying testing, ppe and other supplies to fight spread of #COVID19", "2020-07-14T20:03:44.000Z": "The @VP is thanking @LouisianaGov and others for a \"spirit of partnership\" in responding to Coronavirus. #lagov  #lalege", "2020-07-14T20:02:49.000Z": ". @VP : President Trump and I truly grateful for spirit of partnership with @LouisianaGov and elected representation in Washington #lagov  #lalege  #COVID19", "2020-07-14T20:01:26.000Z": "Grateful for partnership with @LouisianaGov over last four months - @VP", "2020-07-14T20:01:12.000Z": "Happening now  #lagov Quote Tweet John Bel Edwards @LouisianaGov After meeting with Louisiana's higher education leaders to discuss fall reopening plans, Gov. Edwards will join @VP for a news conference at 3 p.m. : 3 p.m. : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov  #lagov  #lalege", "2020-07-14T20:00:29.000Z": "Press briefing with @LouisianaGov and @VP underway from @LSU", "2020-07-14T19:56:06.000Z": "A few photos from @VP 's visit with @LouisianaGov and @Coach_EdOrgeron (among others) today at #LSU regarding reopening schools and fall sports in wake of the spread of #coronavirus . \n\nMore to come via @samkarlin and @theadvocatebr", "2020-07-14T19:39:36.000Z": "GOHSEP was honored to host a visit from Vice President Mike Pence and members of our Congressional delegation concerning the ongoing efforts to stop the spread of COVID-19 in Louisiana. @Mike_Pence  @LouisianaGov", "2020-07-14T19:13:36.000Z": "The @VP 's round table is underway now. He's seated between @LouisianaGov and @Coach_EdOrgeron . #LaLege  #LaGov  @WAFB", "2020-07-14T19:08:07.000Z": "After meeting with Louisiana's higher education leaders to discuss fall reopening plans, Gov. Edwards will join @VP for a news conference at 3 p.m. : 3 p.m. : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov  #lagov  #lalege", "2020-07-14T18:52:38.000Z": "Seated to the right of Mike Pence is @LouisianaGov . Seated to Pence's left is LSU football coach Ed Orgeron. LSU President Tom Galligan is many seats away. #lalege  #lagov", "2020-07-14T18:49:59.000Z": "NOW: @VP , @LouisianaGov leading COVID-19 roundtable meeting at Tiger Stadium.\n\nSome others at the table: @LSUpresident , @Coach_EdOrgeron , LSU AD Scott Woodward, @SenJohnKennedy , @BillCassidy , @BetsyDeVosED , @SteveScalise , @SUSprez , Dr. Deborah Birx, @KimHunterReed  #lagov  #lalege", "2020-07-14T18:48:03.000Z": ". @vp praises 'partnership forged with ... @LouisianaGov ' during #COVID19 pandemic #lalege  #lagov", "2020-07-14T18:46:46.000Z": ". @vp with @Coach_EdOrgeron , @LouisianaGov and others at #LSU Tiger Stadium. #lagov", "2020-07-14T18:47:27.000Z": "Vice President Mike Pence is at Tiger Stadium with ... @LouisianaGov  and higher education leaders #lalege  #lagov", "2020-07-14T18:46:28.000Z": ".... @LouisianaGov  welcomes ... @VP  to Tiger Stadium; thanks him for fed resources #lagov  #lalege  #COVID19", "2020-07-14T17:32:40.000Z": "Today, @LADeptHealth is reporting 2,187 new COVID-19 cases to the state since July 13. \n\n99 percent of the cases reported today were identified as community spread. \n\nWear a mask. Practice social distancing. Wash your hands. #lagov  #lalege", "2020-07-14T16:49:44.000Z": "Welcome back to Louisiana, @VP ! I'm looking forward to discussing Louisiana's ongoing response to COVID-19 and fall reopening plans for higher education institutions and university sports programs today. #lagov  #lalege", "2020-07-14T15:25:11.000Z": "Free COVID-19 testing for Louisiana residents in East Baton Rouge Parish is available at @LSU 's Alex Box Stadium and @SouthernU_BR 's FG Clark Center until July 18. \n\nGo to http:// DoINeedaCOVID19test.com to find a testing center location today and #GeauxGetTested . #lagov", "2020-07-14T14:40:33.000Z": "Heading to the great state of Louisiana for a briefing with @LouisianaGov , @SenBillCassidy and @SenJohnKennedy and to meet with @Coach_EdOrgeron and Louisiana Higher Education Leaders at @LSU ! See you soon!", "2020-07-13T21:30:39.000Z": "One person's actions can help stop the spread of COVID-19. Keep six feet of distance between yourself and others Wear a mask or face covering when out in public Stay home when possible Avoid touching your face Wash your hands frequently #lagov  #lalege", "2020-07-13T20:06:02.000Z": "It was great to have @FEMA_Pete in Baton Rouge today to talk about hurricane preparedness in the age of COVID-19. Louisiana is grateful for the support of our federal partners at @fema in preparing for and responding to severe weather and tropical weather systems. #lagov  #lalege", "2020-07-13T17:44:00.000Z": "The @LADeptHealth is reporting 1,710 new cases of COVID-19 to the state since July 12. \n\n94% of the cases reported to the state today were community spread and 35% are of individuals aged 29 and under.\n\nCOVID-19 is not done with Louisiana. #lagov  #lalege", "2020-07-13T16:38:13.000Z": ".... @LouisianaGov  and ... @FEMA_Pete  are set to speak at the Water Institute in Baton Rouge #lalege  #lagov", "2020-07-13T16:38:52.000Z": "Happening Now Quote Tweet John Bel Edwards @LouisianaGov Today, Gov. Edwards will join @FEMA_Pete to discuss hurricane preparedness and make an announcement about preparing the state's ports for the future. : 11:30 am : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov  #lagov  #lalege", "2020-07-13T15:55:21.000Z": "As we enter peak hurricane season, I am traveling to states along the Gulf Coast this week. This morning, I met with @LouisianaGov in Baton Rouge to discuss severe weather preparedness in a #COVID environment and @fema support on the ground.", "2020-07-13T16:09:07.000Z": "Today, Gov. Edwards will join @FEMA_Pete to discuss hurricane preparedness and make an announcement about preparing the state's ports for the future. : 11:30 am : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov  #lagov  #lalege", "2020-07-13T16:03:36.000Z": "The second portion of FEMA Administrator Pete Gaynor's stop in Baton Rouge is at The Water Institute of the Gulf for a tour and presentation. @LouisianaGov  @FEMARegion6  @FEMA_Pete  @fema", "2020-07-13T14:25:43.000Z": "What's new about Louisiana's updated COVID-19 guidelines that are now in effect? Masks are required for everyone ages 8 and older. All bars are closed to on-premises consumption. Indoor social gatherings are now limited to 50 people. #MaskUpLa  #lagov  #lalege", "2020-07-13T14:11:26.000Z": "Get A Game Plan! GOHSEP Director Jim Waskom welcomes @FEMA_Pete to Louisiana for a discussion on hurricane preparedness and the ongoing COVID-19 fight before a briefing with @LouisianaGov  @FEMARegion6  @fema  #lawx", "2020-07-12T17:04:43.000Z": "Today, @LADeptHealth reports 1,319 cases reported to the state since July 11, 2020. \n\n99% of the cases reported to the state today were community spread. \n\n36% of the cases reported today are of individuals aged 29 and under. #lagov  #lalege Quote Tweet Louisiana Department of Health @LADeptHealth The Louisiana Department of Health reports 1,319 cases reported to the state since July 11, 2020. The total number of cases reported to the state is 78,122. Show this thread", "2020-07-11T23:30:00.000Z": "If you don't like the mask mandate, then don't like it. But wear your mask anyway if you're going to be out in public. #MaskUpLa  #lagov", "2020-07-11T22:03:05.000Z": "These are reasonable expectations while we fight to reduce the spread of the illness in our state. This approach also gives us the best possible chance to again flatten the curve without moving back to Phase One. #lagov  #lalege", "2020-07-11T22:03:04.000Z": "This is why I am now mandating face coverings statewide and also closing all bars in Louisiana to on-premises consumption, in addition to putting in limits on the size of indoor gatherings. #lagov  #lalege", "2020-07-11T22:03:03.000Z": "While I had hoped to avoid going backward on restrictions, it is obvious that it is necessary to slow the spread of infection in our state, as COVID-19 has spread to every corner, at a level higher than we have previously seen. #lagov  #lalege", "2020-07-11T22:03:02.000Z": "More than two thousand new COVID infections reported each of these days and increased hospitalizations are signs that we continue to go in the wrong direction in our work to control COVID-19 in our state. #lagov  #lalege", "2020-07-11T22:03:01.000Z": "Today, I am announcing a mandatory mask requirement for Louisiana, ordering bars closed to on-premises consumption and limiting indoor social gatherings to 50 total people. The new order will go into effect Monday, July 13 at 12:01 am. #lagov  #lalege  : http:// gov.louisiana.gov/index.cfm/news room/detail/2591 ", "2020-07-11T20:30:40.000Z": "Edwards rips the petition by conservative Republican lawmakers to end all coronavirus restrictions in place in Louisiana. Calls it a \"silly, partisan petition\" that would threaten federal aid and a lot of other things. #lalege  #lagov", "2020-07-11T20:30:36.000Z": "As @LouisianaGov announces statewide mask mandate, St. Tammany Parish President Mike Cooper says he was planning to issue a mask mandate for his parish and will issue an executive order to do so. #lalege  #lagov", "2020-07-11T20:30:12.000Z": ". @LouisianaGov 's pop-up Saturday press conference wrapping up. To sum it up, here are changes effective Monday:\n\n- Bars with and without LDH food permits close. Can do curbside pickup \n- social gatherings limited to 50 people\n- mask mandate statewide ages 8+", "2020-07-11T20:24:45.000Z": "Asked why he's not doing more to enforce existing rules, @LouisianaGov says (voice rising): \"If the people of Louisiana are going to insist that we enforce our way through it, we're not going to be successful.\" Says he has faith in people of LA to be good neighbors #lalege  #lagov", "2020-07-11T20:24:12.000Z": "An animated @LouisianaGov says \"If you don't like the mask mandate, don't like it. But wear your mask anyway if you're going to be out in public. If you want to criticize me, criticize me.\" #lalege  #lagov", "2020-07-11T20:24:01.000Z": ". @LouisianaGov : \"If you don't like the mask mandate, don't like it. But wear the mask anyway.\" @BRProudNews  #lagov  #lalege", "2020-07-11T20:15:28.000Z": ". @LouisianaGov says as of now Office of Public Health has not advised him to ban elective surgeries statewide. Could eventually come to that, but some hospitals/areas have already started to limit what they will/can perform to keep space for growing #COVID19 hospitalizations", "2020-07-11T20:13:47.000Z": ". @LouisianaGov says if person is asked to wear a mask inside a business and does not comply, that will be considered trespassing.", "2020-07-11T20:12:10.000Z": ". @LouisianaGov : \"We're not going to be out there with a goal to write citations... If someone refuses to wear a mask, they should be asked to leave. If they refuse to leave, that's trespassing.\"\n\nMandate applies to churches, but it will not be enforced in churches. #lagov  #lalege", "2020-07-11T20:11:32.000Z": ". @LouisianaGov says businesses will be required to tell customers to wear masks #lagov  #lalege  #COVID19", "2020-07-11T20:11:14.000Z": "Mask mandate for outdoors and indoors says Governor. Says they are going to require businesses to tell people to wear a mask @LouisianaGov  @WAFB", "2020-07-11T20:11:12.000Z": ". @LouisianaGov on mask mandate: applies both indoors AND outdoors (when you can't social distance)\n\nOn enforcement: businesses must tell people they have to have masks on \n\n\"we're not going to be out there with a goal to write citations\" - JBE", "2020-07-11T20:11:09.000Z": ". @LouisianaGov says businesses are being told to tell people they must wear masks when entering.", "2020-07-11T20:10:58.000Z": ". @LouisianaGov says mask mandate taking effect Monday will be for indoor and outdoor locations whenever you cannot be physically distant from others outside your household. #lalege  #lagov", "2020-07-11T20:09:49.000Z": ". @LouisianaGov says mask mandate is indoor or outdoors when you can not Social distance from others.", "2020-07-11T20:02:00.000Z": "Medical professionals asking public to think closely about every interaction with others. Try to do it virtually, social distance and put your mask on  - Dr. O'Neal at @LouisianaGov briefing", "2020-07-11T20:00:10.000Z": "1/3 of #COVID19 patients in hospital are in ICU\n\nYoungest patient in ICU is in their 20s Dr. O'Neal says @LouisianaGov briefing", "2020-07-11T19:59:17.000Z": "What we weren't prepared for was steep increase in hospitalizations that started about 10 days ago - Dr. Catherine O'Neal of OLOL says @LouisianaGov briefing", "2020-07-11T19:54:55.000Z": "Dr. Kanter - Ages 18-29 still overwhelmingly the highest growing age group in new #covid19 cases\n\nAlso seeing more spread from younger patients to older people -- which is a big concern for @LouisianaGov and state officials", "2020-07-11T19:49:48.000Z": "Dr. Joe Kanter, Asst. State Health Officer going to give a data presentation now at @LouisianaGov presser \n\nCalled data \"wake up call\" yesterday", "2020-07-11T19:49:16.000Z": ". @LouisianaGov \"We cannot let this illness win. If you want to keep the economy open, not go back to phase one, open schools next month, these are minor prices to pay, especially those who don't like putting on a face cover.\"", "2020-07-11T19:48:56.000Z": "\"I know that what I'm announcing today is going to be challenging for some....  We can not let this illness win,\" said @LouisianaGov  @WAFB", "2020-07-11T19:48:45.000Z": "It (imposing new restrictions) is right thing to do, necessary  thing to do - @LouisianaGov Admits some will be unhappy but says if schools want to reopen, etc. this fall, these steps must be taken", "2020-07-11T19:48:28.000Z": ". @LouisianaGov says he didn't want to close bars, but says public health officials believe there's a greater risk of virus spread at bars. He says 36 outbreaks traced to bars, and it's likely many more. #lalege  #lagov", "2020-07-11T19:48:17.000Z": ". @LouisianaGov : \"We cannot let this illness win.\" @BRProudNews  #lagov  #lalege", "2020-07-11T19:47:46.000Z": ". @LouisianaGov says younger people are spreading Coronavirus to others.", "2020-07-11T19:47:35.000Z": "@LouisianaGov : A younger age group continues to be big driver of cases. Younger people are spreading it to older people.", "2020-07-11T19:47:06.000Z": ". @LouisianaGov says bars are proving to be hotspots for Coronavirus. Closing down bars is not a punishment. I want to thank all bar owners who have complied with mitigation measures.", "2020-07-11T19:46:36.000Z": ". @LouisianaGov \"None of the steps I announced are to punish bars, but is to help limit contact.\"", "2020-07-11T19:46:35.000Z": "Bars have proven to be hotspot for #COVID19 spread, @LouisianaGov says. Adds he's not trying to punish bar owners but at least 36 outbreaks (400+ cases) tracking back to bars statewide", "2020-07-11T19:46:32.000Z": "\"Obviously closing bars was not a step I wanted to take.\" @LouisianaGov says some bars across the state have been places where we've seen COVID hotspots come from... @WAFB", "2020-07-11T19:46:05.000Z": ". @LouisianaGov : \"We have no reason to believe the numbers we are seeing are going to get better. In fact, they're going to get worse.\"", "2020-07-11T19:46:01.000Z": ". @LouisianaGov : \"I have no reason today to believe the numbers we're reporting today will get any better\" for at least another few weeks. @BRProudNews  #lagov  #lalege", "2020-07-11T19:45:12.000Z": ". @LouisianaGov says all the steps I have taken today are not steps I wanted to take but are essential.", "2020-07-11T19:45:05.000Z": ". @LouisianaGov : \"None of the steps I'm announcing today are steps I wanted to take... but they are all essential.\" @BRProudNews  #lagov  #lalege", "2020-07-11T19:44:49.000Z": "@LouisianaGov : \"While I know that this will be controversial to some, we know that face masks work.\"", "2020-07-11T19:44:20.000Z": "\"If you can't wear a mask because of a medical condition then you have a medical condition that makes you vulnerable to covid-19\" - @LouisianaGov", "2020-07-11T19:43:29.000Z": "@louisianagov Grant, Red River and West Feliciana are the 3 parishes that can opt out of the face mask mandate.  \"But it is still strongly encouraged that everyone who can do so wear a face mask outside the home.\"", "2020-07-11T19:43:14.000Z": "Only 3 parishes are currently able to opt  out of the face mask requirement becuase they don't have high incidence of covid as defined by CDC: Grant, Red River and W. Feliciana parishes. Not yet clear if they will opt out. #lalege  #lagov", "2020-07-11T19:43:13.000Z": ". @LouisianaGov says 3 parishes (Grant, Red River and W. Feliciana) can opt out of face mask mandate.", "2020-07-11T19:43:05.000Z": "Grant, Red River and West Feliciana Parishes are only parishes that can currently opt out of mask mandate because of low #COVID19 incidences @LouisianaGov says\n\nJBE still encourages people in those parishes to #MaskUp", "2020-07-11T19:42:00.000Z": ". @LouisianaGov \"Indoor gatherings (social) will be limited to 50 people. Outdoor gatherings will have to comply with social distancing.\"", "2020-07-11T19:41:54.000Z": "Parishes and municipalities can opt out of mask mandate if low incident rates of COVID-19. @LouisianaGov says only three parishes meet the criteria to opt out. #lalege  #lagov Quote Tweet Melinda Deslatte @MelindaDeslatte . @LouisianaGov says effective Monday: statewide mask mandate for anyone age 8 and older; All bars with and without food permit will be closed to on-premise consumption, takeout only for drinks. #lalege  #lagov", "2020-07-11T19:40:58.000Z": ". @LouisianaGov \"All bars with and without a food permit will be closed, but can operate for curbside pickup.\"", "2020-07-11T19:40:53.000Z": "@LouisianaGov says \"We're following White House criteria.\"", "2020-07-11T19:40:35.000Z": "New orders from @LouisianaGov will take effect 12:01 a.m. Monday.", "2020-07-11T19:40:25.000Z": "\"We have been extremely patient\" @LouisianaGov says but data shows these new restrictions are necessary", "2020-07-11T19:40:09.000Z": "BREAKING: All bars will be closed for on-premise consumption in Louisiana. All drinks have to be to go. That includes those with food permits. @LouisianaGov  @WAFB", "2020-07-11T19:39:58.000Z": "Parishes that don't have high incidents of #COVID19 may opt out of mask mandate @LouisianaGov says. Only three parishes currently would be able to opt out right now. More on this soon", "2020-07-11T19:39:46.000Z": ". @LouisianaGov : \"What we have good reason to believe as a large contributor are informal backyard gatherings... birthday parties, wedding showers, baby showers...\n\n\"Many of your close relatives and close friends are going to have COVID.\" @BRProudNews  #lagov  #lalege", "2020-07-11T19:39:44.000Z": ". @LouisianaGov believes a large contributor to an increase in cases are informal \"backyard gatherings,\" such as BBQs, parties.", "2020-07-11T19:39:29.000Z": "@LouisianaGov says informal backyard gatherings have become a source of viral spread.", "2020-07-11T19:39:20.000Z": ". @LouisianaGov : Masks are now mandated statewide for age 8 and older. Parishes and cities may opt out if don't have high incidence rate (only three parishes). All bars will be closed to on-premise. Limiting gatherings 50 people indoors and outdoors must physical distance #lagov", "2020-07-11T19:38:54.000Z": "Occupancy limit will be reduced to 50 people (indoors) for social gatherings \n\nOutdoor gatherings will need to social distance @LouisianaGov says doesn't apply to essential businesses", "2020-07-11T19:37:50.000Z": ". @LouisianaGov : Starting Monday, Louisiana will mandate mask use statewide for everyone ages eight or older, unless someone has a medical condition that makes it difficult to wear a mask. @BRProudNews  #lagov  #lalege", "2020-07-11T19:37:46.000Z": "Today @LouisianaGov is announcing new #COVID19 restrictions:\n\n-- Statewide mask mandate for people 8 and older (with exceptions)\n-- Closure of all bars to on-premises consumption\n-- Gathering limit of 50 people indoors", "2020-07-11T19:37:38.000Z": "There it is: Louisiana mandating masks statewide for people ages 8+. Parishes can opt out if they don't have high incidence of COVID-19 (waiting more details on that metric.) Only 3 parishes in the state don't have that high incidence. #lalege  #lagov", "2020-07-11T19:37:34.000Z": "@LouisianaGov : Masks are now mandatory for everybody 8 and older unless they have a health condition that does not allow them to wear a mask", "2020-07-11T19:37:21.000Z": "It's official: . @LouisianaGov instituting a state-wide mask mandate after 2K more cases were announced today. This goes into effect Monday. Louisiana is #3 per capita in cases across the US.", "2020-07-11T19:37:17.000Z": ". @LouisianaGov : I've been extremely patient, but today have to move farther. Trying very hard not to revert to Phase 1 to balance health imperatives with economy and ability to open schools. We'll stay in Phase 2 at least until July 24 #lagov", "2020-07-11T19:37:13.000Z": "\"We are going to stay in Phase 2,\" says @LouisianaGov , but there are going to be changes. @WAFB", "2020-07-11T19:37:12.000Z": "Today @LouisianaGov announcing effective Monday:\n\n- Masks mandated statewide ages 8-older unless major health condition", "2020-07-11T19:37:04.000Z": "@LouisianaGov \"Today I'm going to announce that we're going to stay in Phase 2.\"", "2020-07-11T19:36:44.000Z": "@LouisianaGov JBE: \"You know that I've been extremely patient over the last few weeks. Today we're going to have to move a little further. We're trying very hard not to revert to Phase 1...\"", "2020-07-11T19:36:17.000Z": ". @LouisianaGov : \"You know I've been extremely patient... Today, we're going to move a bit further than that.\" @BRProudNews  #lagov  #lalege", "2020-07-11T19:36:04.000Z": "\"What we're facing is being experienced across the country, including our neighboring states,\" says @LouisianaGov  @WAFB", "2020-07-11T19:35:26.000Z": ". @LouisianaGov : We cannot risk losing our capacity to deliver hospital care #lagov  #lalege  #COVID19", "2020-07-11T19:35:10.000Z": ". @LouisianaGov says Louisiana ranks 3rd in the country in per capita cases. #lalege  #lagov", "2020-07-11T19:35:09.000Z": "\"We cannot risk losing our capacity to deliver life saving care.\" says @LouisianaGov  @WAFB", "2020-07-11T19:34:52.000Z": ". @LouisianaGov : \"Louisiana was tenth in the country in terms of per capita cases. Today, we're number three.\" @BRProudNews  #lagov  #lalege", "2020-07-11T19:34:51.000Z": ". @LouisianaGov : Louisiana is now No. 3 in per capita cases behind only NY and NJ #lagov", "2020-07-11T19:34:37.000Z": ". @LouisianaGov \"We are number three in the country behind New York and New Jersey.\"", "2020-07-11T19:34:25.000Z": "\"It is true that we are testing more people, and that is a good thing. A test doesn't create a case,\" says @LouisianaGov  @WAFB \"We have almost met our goal of 200,000 tests.\"", "2020-07-11T19:34:09.000Z": "Louisiana has tested more than 195,000 people in the 11 days of July so far. The state's monthly goal is 200,000. \n\nStill, the share of results coming back positive is increasing, meaning that can't explain away the increases in cases. #lalege  #lagov", "2020-07-11T19:33:45.000Z": "Over the last week, @LouisianaGov says that new tests coming back positive have been over 10 percent for most of the last week, which is a problem. We are testing more ... but he notes that a test does not \"create\" a new case. It just helps us identify it.", "2020-07-11T19:33:39.000Z": ". @LouisianaGov \"We are testing more people which is good and as a a result we are seeing more cases. We have almost met our monthly goal of 200,000 tests.\"", "2020-07-11T19:33:34.000Z": "@LouisianaGov says positivity rates over the past two days have both exceeded 10 percent. #COVID19", "2020-07-11T19:33:32.000Z": "11 days into month of July state has already reported 195,536 tests ... close to monthly 200k goal @LouisianaGov says", "2020-07-11T19:33:15.000Z": "\"A test doesn't create a case. It's going to tell you who are infected and contagious. \" - @LouisianaGov", "2020-07-11T19:33:07.000Z": ". @LouisianaGov : Yesterday reported highest number of new cases today; today announced more than 2K more; and positivity exceeded 10% #lagov  #COVID19", "2020-07-11T19:33:04.000Z": ". @LouisianaGov says: \"It's become clear to me after the numbers we saw yesterday that our current restrictions are not enough.\" #lalege  #lagov", "2020-07-11T19:32:51.000Z": "\"Yesterday we reported the highest new cases to date,\" says @LouisianaGov  @WAFB", "2020-07-11T19:32:00.000Z": "\"Our current restrictions are not enough\" - @LouisianaGov", "2020-07-11T19:31:52.000Z": ". @LouisianaGov : Clear to me after Friday's numbers that current measures aren't enough to stop spread", "2020-07-11T19:31:25.000Z": "Happening Now Quote Tweet John Bel Edwards @LouisianaGov Today at 2:30 pm, Gov. Edwards will make an announcement about Louisiana's response to COVID-19. As of July 10, there were 74,636 confirmed cases in Louisiana, with 3,272 deaths. : 2:30 pm : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov  #lagov  #lalege", "2020-07-11T19:31:04.000Z": ". @LouisianaGov making a COVID-related announcement at GOHSEP. LIVE: TODAY: Statewide mask mandate goes into effect Masks will be required for anyone 8 years-old and above fox8live.com", "2020-07-11T19:31:21.000Z": ".... @LouisianaGov  is announcing new coronavirus restrictions. Follow along! #lalege  #lagov", "2020-07-11T19:30:42.000Z": "HAPPENING NOW: @LouisianaGov holding a previously unscheduled #COVID19 briefing to discuss state's response to virus. Expecting some new measures after a recent statewide surge in cases, hospitalizations, etc", "2020-07-11T19:26:52.000Z": "LIVE NOW: @LouisianaGov is set to make an announcement on the state's response to #COVID19 as cases and hospitalizations continue to rise » https:// bit.ly/2WbajoW  #lagov  #lanews", "2020-07-11T19:27:03.000Z": "LIVE NOW: @LouisianaGov is set to make an announcement on the state's response to #COVID19 as cases and hospitalizations continue to rise » https:// bit.ly/303CAyT  #lagov  #lanews Gov. Edwards announces mask mandate, closes bars under updated COVID-19 emergency order BATON ROUGE, La. (KTAL/KMSS) - Gov. John Bel Edwards announced Saturday that he will be signing a new executive order expanding restrictions under the current Phase 2 order, including a statew arklatexhomepage.com", "2020-07-11T19:28:20.000Z": "WATCH LIVE - @LouisianaGov set to make announcement on COVID-19 response as cases, hospitalizations continue to rise - https:// bit.ly/325R0Ba  @NBC6News  #lagov  #lalege", "2020-07-11T19:29:06.000Z": ". @LouisianaGov announcement on COVID-19 response happening shortly. #lalege  #lagov", "2020-07-11T19:18:46.000Z": "@LouisianaGov John Bel Edwards is expected to hold a rare Saturday press conference in about 15 minutes. Watch it on #LPB -HD or online at https:// youtube.com/watch?v=L6K1Fe T5tdI&feature=youtu.be   #lagov  #lalege  #COVID19", "2020-07-11T16:46:37.000Z": "Today at 2:30 pm, Gov. Edwards will make an announcement about Louisiana's response to COVID-19. As of July 10, there were 74,636 confirmed cases in Louisiana, with 3,272 deaths. : 2:30 pm : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov  #lagov  #lalege", "2020-07-11T18:23:57.000Z": "The @LADeptHealth is reporting 2,166 new COVID-19 cases today. \n\n95% of the cases reported to the state today were community spread. \n\n35% of the cases reported today are of individuals aged 29 and under. #lagov  #lalege", "2020-07-11T16:58:44.000Z": "", "2020-07-11T16:58:43.000Z": "The Louisiana Department of Health reports 2,166 cases reported to the state since July 10, 2020. The total number of cases reported to the state is 76,803.", "2020-07-10T20:07:12.000Z": "Thank you, @AsaHutchinson ! I wear a mask because we care about our neighbors in Louisiana. I also know that the more we #MaskUpLa , the sooner we can get back to crawfish boils, festivals and sports. \n\nWhy do you wear your mask up there in Ohio, @GovMikeDeWine ? #lagov Quote Tweet Gov. Asa Hutchinson @AsaHutchinson 0:46 Thank you @GovernorVA ! I wear a mask because it's the right thing to do to care for my friends and family. What about our friends to the south, @LouisianaGov ? #MaskUpAmerica  twitter.com/GovernorVA/sta", "2020-07-10T17:58:50.000Z": "Stay safe today, Louisiana! Drink plenty of water and stay hydrated Wear light and loose-fitting clothing Limit your outdoor activities Take breaks in the air conditioning or shade Never leave children or pets in the car unattended #lagov  #lalege  #lawx", "2020-07-10T17:10:02.000Z": "Today, the @LADeptHealth is reporting 2,642 new COVID-19 cases. \n\nThis is the single largest daily increase in cases not attributable to a backlog since the beginning of the COVID-19 outbreak in Louisiana. #lagov  #lalege", "2020-07-10T16:56:57.000Z": "The Louisiana Department of Health reports 2,642 cases reported to the state since July 9, 2020. The total number of cases reported to the state is 74,636.\n\nThis is the single largest daily increase not attributable to a backlog since the beginning of the outbreak in Louisiana.", "2020-07-10T15:31:00.000Z": "Wearing a mask or face-covering in public is the neighborly thing to do. It's an easy way to protect one another and keeps Louisiana healthy and strong. #lagov  #MaskUpLa", "2020-07-10T13:00:53.000Z": "No-cost #COVID19 test sites are operating throughout East Baton Rouge Parish to stamp out community spread. Pre-registration is not required but highly encouraged: https:// buff.ly/2W53xRC Those who arrive pre-registered will be escorted to the express line.", "2020-07-09T23:30:00.000Z": "If you need to talk to someone, you can get connected by texting REACHOUT to 741741 to reach a trained crisis counselor who will help de-escalate, identify coping strategies and use active listening techniques to support you. #lagov  #lalege", "2020-07-09T21:01:19.000Z": "When you wear a mask, you protect others. When others wear a mask, they protect you. #MaskUpLa  #lagov", "2020-07-09T19:00:00.000Z": "Be prepared this hurricane season. \n\nVisit the new http:// GetAGamePlan.org website for hurricane and emergency preparedness tips and information to protect you, your family and your business in the event of severe weather or the threat of a hurricane. #lagov  #lalege", "2020-07-09T17:20:15.000Z": "Today, the @LADeptHealth reports 1,843 new COVID-19 cases to the state since July 8, 2020. \n\n97% of the cases reported today were community spread. 39% of the cases today are of individuals aged 29 and under.\n\nCOVID-19 is not done with Louisiana. #lagov  #lalege", "2020-07-09T16:58:36.000Z": "The Louisiana Department of Health reports 1,843 cases reported to the state since July 8, 2020. The total number of cases reported to the state is 71,994.", "2020-07-09T15:59:51.000Z": "Great news! Hood Container of Louisiana LLC announced today that the company's paper mill in West Feliciana Parish will complete a $50 million efficiency upgrade and capacity expansion. : https:// gov.louisiana.gov/index.cfm/news room/detail/2589   #lagov  #lalege", "2020-07-09T15:10:37.000Z": "@LouisianaGov on today's announcement: \"Today really is shining example of partnership and the benefits it can yield.\" \n\nGovernor also encouraging people to get tested for COVID-19 at one of the surge testing sites that have popped up in EBR and Ascension Parish", "2020-07-09T15:13:09.000Z": "\"Our residnets deserve more...that's what brings us here today.\" @LouisianaGov says. \"Want to challenge business to step up and get involved in reinvesting in North Baton Rouge.\"", "2020-07-09T14:55:31.000Z": "You can watch @LouisianaGov and @MayorBroome dedicate the New Era Medical Office Complex on her Facebook page: https:// facebook.com/MayorPresident SharonWestonBroome   #lalege  #lagov", "2020-07-09T14:45:08.000Z": "Today, Gov. Edwards will join East Baton Rouge Mayor-President @MayorBroome to dedicate the New Era Medical Office Complex in Baton Rouge. : 10 am : http:// gov.la.gov  #lagov  #lalege", "2020-07-08T23:30:00.000Z": "COVID-19 is more rampant in Louisiana now than it has ever been. We now have a statewide epidemic, it is no longer one or two regions driving case growth.\n\nIt's on all of us to do better and wear masks in public, practice social distancing and avoid congregating. #lagov  #lalege", "2020-07-08T21:34:15.000Z": "These dollars will not completely solve the digital divide but they will be a huge step in the right direction. #lagov  #lalege", "2020-07-08T21:34:14.000Z": "$50 million through the CARES Act for the Governor's Emergency Education Relief Fund (GEER) Fund is now available for K-12 schools and higher education in Louisiana. : https:// gov.louisiana.gov/index.cfm/news room/detail/2583   #lagov  #lalege", "2020-07-08T20:54:11.000Z": "I signed the state's budget for the FY 20-21 operating year today, preserving funding for critical health care and workforce and education services that are needed during the pandemic. #lagov  #lalege  : https:// gov.louisiana.gov/index.cfm/news room/detail/2582 ", "2020-07-08T20:20:22.000Z": ". @LouisianaGov : we want our kids back on our campuses, but we need to do it safely #coronavirus", "2020-07-08T20:19:41.000Z": ". @LouisianaGov : even if we have on campus learning, it won't look like it did pre-COVID #coronavirus", "2020-07-08T20:19:35.000Z": ". @LouisianaGov on whether schools with meet as they did before the pandemic: \"We are in a new normal. ... It's not going to be like it was before.\" #lalege  #lagov", "2020-07-08T20:19:30.000Z": "As he said 2 weeks ago during Phase 2 extension announcement @LouisianaGov still says he is focused on better compliance to current restrictions rather than more restrictions (closing bars, indoor dining capacity)\n\nDoes say however we could see tighter restrictions in future", "2020-07-08T20:16:18.000Z": "\"Everybody in Louisiana you have a role to play, let's be a good neighbor and wear our masks,\" said @LouisianaGov  @WBRZ", "2020-07-08T20:15:14.000Z": ". @LouisianaGov says he is going to look at potentially reducing the number of people that can be at a gathering. (The limit is currently 250 people.) #lalege  #lagov", "2020-07-08T20:14:25.000Z": ". @LouisianaGov : Whether we have a mask mandate or not can't be clearer in message about need to comply with mitigation measures #lagov  #lalege Quote Tweet Greg Hilburn @GregHilburn1 . @LouisianaGov : I'm not currently contemplating a statewide mask mandate #lagov  #lalege", "2020-07-08T20:13:58.000Z": "\"Whether we have a mandate or not, we can't be clearer in the messaging\" about wearing a mask. - @LouisianaGov  #lalege  #lagov \"You have an interest in wearing a mask.\"", "2020-07-08T20:09:09.000Z": "\"COVID-19 is probably more present and more rampant in Louisiana than it has ever been. We need Louisiana residents to step it up,\" says @LouisianaGov  @WAFB", "2020-07-08T20:09:06.000Z": ". @LouisianaGov : #COVID19 is probably more present/rampant in the state now than it has ever been", "2020-07-08T20:08:53.000Z": ". @LouisianaGov : As you can see a majority of outbreaks are associated with bars; biggest numbers food processing #lagov  #lalege", "2020-07-08T20:02:23.000Z": "Billioux says there are currently about 25,000 active cases of coronavirus in Louisiana. In mid-May, that number was around 10,000. #lalege  #lagov", "2020-07-08T19:59:46.000Z": "@AlexBillioux announcing at @LouisianaGov presser the top 5 places for #COVID19 outbreaks: \n\nBars\nIndustrial settings \nRestaurants \nFood processing \nCollege/Universities @BRProudNews", "2020-07-08T19:55:21.000Z": ". @AlexBillioux now presenting new data at @LouisianaGov presser that will be on @LADeptHealth  #COVID19 dashboard. Top 5 Outbreak Settings", "2020-07-08T19:48:26.000Z": ". @LouisianaGov \"We simply have to wear a mask.\"", "2020-07-08T19:48:03.000Z": ". @LouisianaGov : We simply have to wear a mask when we're outside of our homes. #lagov  #lalege", "2020-07-08T19:48:01.000Z": "\"We simply have to wear our masks\" - @LouisianaGov Heard this over and over again yesterday talking to an epidemiologist in New Orleans", "2020-07-08T19:47:56.000Z": "@LouisianaGov stressing again for folks to wear a mask. @WAFB", "2020-07-08T19:47:22.000Z": "This morning, hospital CEOs and CMOs told @LouisianaGov that they are having issues with staffing, testing and keeping access to therapeutic treatment like Remdesivir. \n\nAlso patients now skew more Male and White, they said, anecdotally.", "2020-07-08T19:46:51.000Z": "\"We're seeing a slight change in the demographics of patients, they skew a little whiter now and more male than was the case previously\" @LouisianaGov", "2020-07-08T19:46:33.000Z": ". @LouisianaGov : Also seeing slight change in demographics of hospital patients - skewing more white and male #lagov  #lalege", "2020-07-08T19:45:45.000Z": "Hospitals are dealing with staffing issues which are compounded by some nurses and other workers testing positive, Edwards said. #lalege  #lagov", "2020-07-08T19:45:37.000Z": ". @LouisianaGov : biggest challenges from healthcare community center around staffing, treatment and testing #coronavirus", "2020-07-08T19:44:28.000Z": ". @LouisianaGov : Hospital patients are younger and smaller percentage in ICU beds and on ventilators #lagov  #lalege", "2020-07-08T19:44:19.000Z": "According to @LouisianaGov , the two largest hospitals in Lafayette has the highest number of Covid19 in patients than they had at the height of the virus. The patients those hospitals are seeing are young people.", "2020-07-08T19:44:18.000Z": "Silver lining here: JBE says patients are on average younger, less severe illness, not staying as long and fewer are in ICU/on ventilators. #lalege  #lagov", "2020-07-08T19:43:46.000Z": ". @LouisianaGov : We do have some regions above hospitalizations during previous height - Lafayette is one #lagov  #lalege", "2020-07-08T19:43:42.000Z": ". @LouisianaGov : \"There are some people who continue to believe the State of Louisiana continues to do better. It is not the case.\" @BRProudNews  #lagov  #lalege", "2020-07-08T19:43:28.000Z": "\"We do have some regions that are actually above the hospitalization rates that they ever saw.\" - @LouisianaGov  #lalege  #lagov  #coronavirus", "2020-07-08T19:43:20.000Z": ". @LouisianaGov \"For anyone wanting to get register to get tested, you can visit http:// doineedacovid19test.com \"", "2020-07-08T19:43:08.000Z": ". @LouisianaGov : This morning had call with about 20 hospital CEOs across state. 'Nearly every CEO reported sustained increases in #COVID19 hospitalizations. Some people out there continue to believe state of La. doing better and that's not the case' #lagov  #lalege", "2020-07-08T19:42:51.000Z": ". @LouisianaGov says he had a phone call with 20 medical directors and hospital CEOS today. He said nearly all of them have had an increase in hospitalizations related to #coronavirus . #lalege  #lagov", "2020-07-08T19:42:32.000Z": "This morning @LouisianaGov spoke with nearly 2 dozen hospital directors from across the state to get a better idea of what's happening on the ground ...\n\nNearly everyone on call reported sustained increases on #COVID19 hospitalizations, JBE says", "2020-07-08T19:41:37.000Z": "@LouisianaGov 'Surge' testing in Baton Rouge: Goal is to test 5k people a day, above the baseline amt. Do not have to be a Baton Rouge resident.", "2020-07-08T19:41:12.000Z": "Baton Rouge recently got 4 federally-supported test sites to do 5,000 tests a day. Edwards said you can go get tested even if you don't have symptoms. #lalege  #lagov", "2020-07-08T19:40:46.000Z": ". @LouisianaGov says Baton Rouge was selected for surge testing, 1 of 3 sites across the country, working closely with White House Coronavirus Task Force.", "2020-07-08T19:40:35.000Z": "We do (have a serious situation) and ( #COVID19 spread) is getting worse - @LouisianaGov", "2020-07-08T19:40:19.000Z": ". @LouisianaGov : We have a serious situation and it's getting worse #lagov  #lalege", "2020-07-08T19:39:29.000Z": ". @LouisianaGov says state is seeing more delays in getting test results, because commercial labs are seeing shortages of item needed to process test results. #lalege  #lagov", "2020-07-08T19:39:15.000Z": ". @LouisianaGov : Want everybody to listen to this. If you've been in close contact with someone COVID positive you need to quarantine for 14 days even if you've tested negative #lagov  #lalege", "2020-07-08T19:39:12.000Z": ". @LouisianaGov : \"I want everyone to listen to this: if you have been in close contact with someone COVID positive, even if you test negative, you need to quarantine for 14 days.\"", "2020-07-08T19:39:10.000Z": "Edwards tells people that if they come into close contact with someone who is positive, they need to quarantine for 14 days regardless of whether they test negative #lalege  #lagov", "2020-07-08T19:39:09.000Z": "\"If you have been in close contact with someone who is COVID positive, even if you test Negative, you need to quarantine for 14 days,\" Says @LouisianaGov  @WAFB", "2020-07-08T19:39:01.000Z": ". @LouisianaGov says the state is aware that #coronavirus test results are taking longer to get. Someone people have to wait seven to 10 days...even longer. #lalege  #lagov", "2020-07-08T19:37:35.000Z": ". @LouisianaGov : Today limiting factor of testing is availability of reagent in commercial labs #lagov", "2020-07-08T19:37:00.000Z": ". @LouisianaGov : \"We have a statewide epidemic. It's no longer one region or two regions.\" #lalege  #lagov", "2020-07-08T19:36:46.000Z": ". @LouisianaGov : Now we're seeing more even increases in cases and hospitalizations throughout state. We have a statewide epidemic #lagov", "2020-07-08T19:36:44.000Z": ". @LouisianaGov says we are seeing more even hospitalizations across the state now than in the past. It's no longer one or two regions driving the numbers.", "2020-07-08T19:36:40.000Z": ". @LouisianaGov : We have a statewide epidemic.", "2020-07-08T19:36:32.000Z": ". @LouisianaGov : now we're seeing more even growth in cases/hospitalizations across the state than we did earlier this year when NOLA area was driving high numbers", "2020-07-08T19:36:23.000Z": ". @LouisianaGov : 2-in-a-half months ago we had really high numbers driven by New Orleans metro area. But now more even growth in hospitalizations across Louisiana.", "2020-07-08T19:36:13.000Z": "@LouisianaGov : Difference today and what seeing 2 1/2 months ago we had high numbers but driven by hotspot in NOLA area #lagov  #lalege", "2020-07-08T19:35:49.000Z": ". @LouisianaGov : 35-40% of new cases over the last several days are individuals under 39 #coronavirus", "2020-07-08T19:35:36.000Z": "1,022 hospitalized. Last time we saw numbers this high was in May. @LouisianaGov", "2020-07-08T19:35:31.000Z": ". @LouisianaGov : Our hospitalizations have almost doubled since June 13th #lagov", "2020-07-08T19:35:15.000Z": "Last time state had >1000 hospitalizations before now was May 19th - @LouisianaGov", "2020-07-08T19:34:53.000Z": ". @LouisianaGov : \"We have lost all the gains we made in June.\" @BRProudNews  #lagov  #lalege", "2020-07-08T19:34:48.000Z": "#BREAKING  @LouisianaGov announces 20 new Covid-19 deaths today.", "2020-07-08T19:34:37.000Z": ". @LouisianaGov says 95 percent of new cases he is talking about are community spread.", "2020-07-08T19:34:21.000Z": ". @LouisianaGov : 95% of today's cases are community spread #coronavirus", "2020-07-08T19:34:13.000Z": "@LouisianaGov we've had three weeks of going in the wrong direction. We have lost all of the gains made in June and now rival our peak in April.", "2020-07-08T19:34:05.000Z": ". @LouisianaGov is doing his weekly coronavirus briefing at the Capitol. \n\n\"We've had three weeks now of going in the wrong direction,\" he says. #lalege  #lagov", "2020-07-08T19:34:04.000Z": ". @LouisianaGov : we have lost all the gains from June. \n\nSome new data showing state is currently rivaling what it saw during peak earlier this year", "2020-07-08T19:33:31.000Z": ". @LouisianaGov says the state has been going in the \"wrong direction\" for three weeks.", "2020-07-08T19:33:27.000Z": ". @LouisianaGov : we've had three weeks now of going in the wrong direction #coronavirus", "2020-07-08T19:33:24.000Z": ". @LouisianaGov holding his weekly coronavirus briefing. Stsarts with: \"We've had three weeks now of going in the wrong direction\" on positive cases, hospitalizations. #lalege  #lagov", "2020-07-08T19:33:20.000Z": ". @LouisianaGov begins press conference: In short, we've had three weeks of going in wrong direction #lagov  #lalege", "2020-07-08T19:33:01.000Z": ". @LouisianaGov is here for the Covid-19 briefing. First one since July 4 holiday weekend. Streaming live on @WAFB and http:// WAFB.com", "2020-07-08T19:32:40.000Z": ". @LouisianaGov holding his weekly #COVID19 briefing now", "2020-07-08T18:42:59.000Z": "@LouisianaGov John Bel Edwards will provide us with an update on #COVID19 today around 2:30 on #LPB -3 - so as not to interrupt the ongoing #SummerSessions math learning modules taking place on #LPB -HD. \nYou can also watch the governor online here: https:// youtube.com/watch?v=KzdINg VeCu8&feature=youtu.be ", "2020-07-08T17:09:41.000Z": "Today, @LADeptHealth is reporting 1,891 new COVID-19 cases since July 7. The collection dates for most of these cases fall between July 1 & July 8. \n\n95% of the reported cases today were community spread. \n\n39% of cases reported today are of individuals aged 29 and under. #lagov", "2020-07-08T16:57:17.000Z": "", "2020-07-08T16:57:16.000Z": "The Louisiana Department of Health reports 1,891 cases reported to the state since July 7, 2020. The total number of cases reported to the state is 70,151.", "2020-07-08T15:30:00.000Z": "Text 'LAGOV' to 67283 to receive important updates and information from the Governor's Office directly to your phone. #lagov  #lalege", "2020-07-07T22:30:00.000Z": "COVID-19 is not done with Louisiana. \n\nWear a mask. Practice social distancing. Wash your hands. Avoid congregating. #lagov  #lalege", "2020-07-07T22:00:12.000Z": "Show Us Your Mask SWLA @LouisianaGov  @FirstLadyOfLA  @aliciakeys  @GRAMMYMuseum  @TheEllenShow  https:// youtu.be/ewMFF3IbdXs via @YouTube Show Us Your Mask SWLA Stop the spread of Covid-19 Wear a face mask. Show us your mask SWLA youtube.com", "2020-07-07T21:00:39.000Z": "It's on all of us, young and old, to stop the spread of COVID-19 in Louisiana. #lagov  #MaskUpLa  #BPCCproud Quote Tweet Bossier Parish Community College @BPCCCavs Help stop the spread of COVID-19 #theBPCCway ! A person can spread it to many people very quickly, including an older relative - someone who is more vulnerable and more at-risk for a serious illness. Wash your hands often, with soap and water, for at least 20 seconds each time.", "2020-07-07T20:13:18.000Z": "Cabot has a proud history of manufacturing in Louisiana, having launched its Ville Platte operations 77 years ago to support our nation's World War II effort. Just last year, Cabot earned one of Louisiana's Lantern Awards as a top manufacturer in our state. #lagov  #lalege", "2020-07-07T20:13:17.000Z": "Great news! Cabot Corporation will make a $90 million capital investment to enhance the performance of its plant in Ville Platte, Louisiana. The project will generate over 380 construction jobs. : https:// gov.louisiana.gov/index.cfm/news room/detail/2581   #lagov  #lalege", "2020-07-07T19:00:00.000Z": "Wearing a mask or face-covering in public to help slow the spread of COVID-19 in Louisiana is the neighborly thing to do.\n\nFor more information on the myths vs. facts of face-coverings, visit: http:// gov.louisiana.gov/page/mask-wear ing-myths-   #lagov  #lalege", "2020-07-07T17:09:46.000Z": "The @LADeptHealth is reporting 2,040 cases reported to the state today. The total number of cases reported to the state is 68,263.\n\n87% of the cases reported today were community spread. \n\n35% of the cases reported today are of individuals aged 29 and under. #lagov  #lalege", "2020-07-07T16:59:39.000Z": "The Louisiana Department of Health reports 2,040 cases reported to the state since July 6, 2020. The total number of cases reported to the state is 68,263.", "2020-07-07T15:36:41.000Z": "#GeauxGetTested ! We are offering 5,000 free tests a day for the next 12 days.\n\nYou can preregister at http:// DoINeedaCovid19Test.com or register on site. Bring the whole family! Anyone 5 years or older can get tested. #GeauxGetTested  #MaskUpEBR  #EBResilient", "2020-07-07T14:58:49.000Z": "Billions of dollars in funding are allocated to hospitals, public services, schools, and roads based on census data, and I urge everyone to do their part in shaping our communities by completing the 2020 Census today. #lagov  #lalege  #LouisianaCounts  : http:// my2020census.gov", "2020-07-06T22:38:10.000Z": "When you wear a mask, you protect others. When others wear a mask, they protect you. #MaskUpLa  #ForkEmDemons  #lagov Quote Tweet #MaskUpNSU @NSULA This is a time for us to come together to protect each other's safety, health, & well-being! #MaskUpLA", "2020-07-06T21:32:00.000Z": "Award-winning singer @Amanda_shaw wants you to #MaskUpLa ! Wearing a mask or face-covering in public helps keep all of us healthy and safe as we continue to see the number of COVID-19 cases rise throughout Acadiana and Louisiana. #lagov  #lalege", "2020-07-06T19:00:01.000Z": "When wearing a mask or face covering: Make sure it covers from the brim of your nose to underneath your chin Always wash your hands before and after touching your mask Don't touch the inside of the mask and adjust as little as possible #MaskUpLa  #lagov  #lalege", "2020-07-06T17:09:26.000Z": "Today, @LADeptHealth is reporting 1,161 cases reported to the state since July 5, 2020. \n\n98% of the cases reported to the state today were community spread. \n\n44% of the cases reported today are of individuals aged 29 and under. #lagov  #lalege", "2020-07-06T16:56:48.000Z": "", "2020-07-06T16:56:47.000Z": "The Louisiana Department of Health reports 1,161 cases reported to the state since July 5, 2020. The total number of cases reported to the state is 66,327.", "2020-07-06T15:00:06.000Z": "Continue to stay weather aware today, Louisiana. Monitor your local media outlets for the latest information throughout day and heed directions and warnings from your local officials. #lagov  #lawx Quote Tweet NWS New Orleans @NWSNewOrleans A FLASH FLOOD WATCH is now in effect for all of SE LA and S MS thru Tue afternoon. Heavy rainfall is once again expected each day. Some areas to see 4-6 inches, maybe more. Latest radar shows heavy rains in the River Parishes this morning. #lawx  #mswx GIF", "2020-07-05T17:21:36.000Z": "The @LADeptHealth is reporting 1,937 COVID-19 cases since 7/3, bringing the state's total to 65,226 cases. \n\nThe vast majority of these cases are connected to community spread. 40% of these cases are among people 29 years old & under. \n\nCOVID-19 is not done with Louisiana. #lagov", "2020-07-05T16:59:23.000Z": "In terms of timeline, 84.7% of these cases are from the last week (6/28-7/5). 14.7% are from the previous week (6/21-6/27) and only 0.7% date back to 5/9-6/17.", "2020-07-05T16:59:22.000Z": "The Louisiana Department of Health reports 1,937 #COVID19 cases reported to the state since 7/3, bringing the state's total to 65,226 cases.", "2020-07-04T14:46:00.000Z": "Happy #FourthOfJuly , Louisiana! As we celebrate our country's Independence Day today, may we do so safely and responsibly to protect our family and friends. May God continue to bless the United States of America and the Great State of Louisiana. #lagov  #lalege", "2020-07-03T23:30:00.000Z": "As a veteran, I can tell you patriotism is not about putting your own health or others' health at risk. We can honor and celebrate our country in many ways, and I cannot think of anything more patriotic than doing so in a way that protects our family, friends & neighbors. #lagov", "2020-07-03T22:00:01.000Z": "As part of our new normal, TV stations around Louisiana are offering virtual Fourth of July celebrations to safely and responsibly commemorate our country's independence. COVID-19 doesn't take holidays off and I urge everyone to stay healthy and safe this holiday weekend. #lagov", "2020-07-03T18:59:36.000Z": "We #WontBowDown . Take it from @Zionwilliamson , it's up to all of us to do our part and stop the spread of COVID-19 in Louisiana by wearing masks when in public, practicing social distancing and washing our hands frequently. #lagov  #lalege", "2020-07-03T13:02:00.000Z": "#MaskUpLSU  #MaskUpLa", "2020-07-03T17:45:54.000Z": "The @LADeptHealth is reporting 1,756 additional COVID-19 cases today. The vast majority of cases are from the past week and 98% of these cases are connected to spread in communities, rather than congregate settings like nursing homes. #lagov  #lalege", "2020-07-03T16:55:19.000Z": "Also, LDH will observe Independence Day and not update our #COVID19 dashboard on July 4. Reporting will resume July 5.", "2020-07-03T16:53:36.000Z": "", "2020-07-03T16:53:35.000Z": "The Louisiana Department of Health reports 1,756 additional #COVID19 cases reported to the state since 7/2.", "2020-07-03T14:42:43.000Z": "One person's actions can help stop the spread of COVID-19. Keep six feet of distance between yourself and others Wear a mask or face covering when out in public Stay home when possible Avoid touching your face Wash your hands frequently #lagov  #lalege", "2020-07-03T13:45:44.000Z": "More than 450 courtesy visits and complaint checks were completed across Louisiana Thursday. #COVID19  #lagov  #OneTeam MORE: https:// facebook.com/20752407933132 1/posts/3170116596405373/ ", "2020-07-03T13:40:01.000Z": "Wearing a mask not only protects you, it also protects others around you. Covid-19 doesn't take holidays. Be safe this holiday weekend and practice physical distancing. Help Louisiana slow the spread. @LouisianaGov  @SouthernU_BR  @ChandlerVidrine  #MaskUpLa  @SouthernUAlumni", "2020-07-02T20:30:47.000Z": "COVID-19 doesn't take holidays. \n\nIt's on all of us, young and old, to celebrate the Fourth of July safely and responsibly. #lagov  #lalege", "2020-07-02T19:24:47.000Z": "Here are some virtual 4th of July celebrations that you and your families can safely enjoy. #COVID19  #4thofJuly", "2020-07-02T18:14:41.000Z": "When you wear a mask, you protect others. When others wear a mask, they protect you. #MaskUpLa  #lagov", "2020-07-02T17:17:38.000Z": "Today, the @LADeptHealth reports 1,387 cases reported to the state since July 1, 2020. The collection dates for most of these cases fall between June 25, 2020 and July 2, 2020.\n\nCOVID-19 is not done with Louisiana. #lagov  #lalege", "2020-07-02T17:00:04.000Z": "The Louisiana Department of Health reports 1,387 cases reported to the state since July 1, 2020. The total number of cases reported to the state is 61,561.", "2020-07-02T15:32:05.000Z": "COVID-19 is alive and well in Louisiana, and all of the people of our state need to take this illness very seriously. Wear a mask when you are in public, stay home if you feel sick, wash your hands & keep 6 feet of social distance from other people when in public. #lagov  #lalege", "2020-07-02T15:32:04.000Z": "Throughout the COVID-19 crisis, I have pledged transparency with the public, which is why I am disclosing today that a member of my team, who works in the State Capitol, tested positive for the coronavirus on Wednesday. #lagov  #lalege  : https:// gov.louisiana.gov/index.cfm/news room/detail/2578 ", "2020-07-01T22:57:05.000Z": "We're working with @LouisianaGov to remind EVERYONE to wear your mask. A recent study found that if 80% of Americans wore masks, infections would plummet. When combined with physical distancing and hand washing, face coverings provide protection against #COVID19 . #MyDU", "2020-07-01T21:59:47.000Z": "Let's set the record straight on COVID-19.\n\nFor the myths vs. facts of COVID-19, visit: http:// gov.louisiana.gov/COVID19-myths  #lagov  #lalege", "2020-07-01T20:21:32.000Z": ". @LouisianaGov says we have made every effort to be transparent at the state level when it comes to the numbers. It is not currently mandated from White House at state level to have mandates on wearing a mask. But I think most people should wear a mask in public.", "2020-07-01T20:21:29.000Z": ". @LouisianaGov : \"It is not currently recommended that you have mandates on masks at the state level.\"\n\nSays that it is recommended to have mandates at the local government level. \n\n\"People should wear masks.\" @WBRZ", "2020-07-01T20:20:12.000Z": ". @LouisianaGov says the White House has recommended states not issue mask mandates, and instead those be done at the local level when warranted. Haven't seen this guidance before. #lalege  #lagov", "2020-07-01T20:13:12.000Z": "@LouisianaGov \"The surge we are seeing is not because we moved into phase two but because people are not behaving.\"", "2020-07-01T20:12:55.000Z": ". @LouisianaGov says at some point if trajectory isn't reversed he will install more restrictions. The trigger would be if state's hospital capacity is threatened #lagov  #lalege  #COVIDー19", "2020-07-01T20:12:54.000Z": ". @LouisianaGov : we are doubling down on communications from local leaders and business leaders #coronavirus", "2020-07-01T20:12:00.000Z": "\"What we are NOT going to do and let me make this very clear.. we are not going to threaten our ability to provide healthcare.\" @LouisianaGov", "2020-07-01T20:11:59.000Z": ". @LouisianaGov : we are NOT going to threaten our ability to deliver healthcare #coronavirus", "2020-07-01T20:11:14.000Z": "@LouisianaGov for the July 4th weekend: Remember these three things: Outdoors is better than indoors. Wearing a mask is better than not Avoid crowds", "2020-07-01T20:10:16.000Z": ". @LouisianaGov says that you have a role to play this July 4th weekend. Don't go into a large crowd. There is no safe large crowd period.", "2020-07-01T20:10:20.000Z": ". @LouisianaGov : We can't have a repeat of #MemorialDay on #July4th holiday this weekend. Governor says beginning of surge timed with Memorial Day holiday where compliance was lax #lagov  #lalege", "2020-07-01T20:09:00.000Z": ". @LouisianaGov : \"Everyone is mindful that Saturday is the 4th of July. With the numbers we talking about right now, we need people to be extremely careful.\"", "2020-07-01T20:08:59.000Z": "\"What we are seeing is from behavior on Memorial Day.\" @LouisianaGov", "2020-07-01T19:50:39.000Z": ". @LouisianaGov says all nursing homes completed their baseline virus testing by the June 30 deadline. He said a few residents and staff at individual nursing homes refused testing. #lalege  #lagov", "2020-07-01T19:49:51.000Z": "\"Young people with Covid are contagious and we need them to be more MINDFUL of not only their own health but we need them to be good neighbors and not spread to others especially those who are vulnerable.\" @LouisianaGov", "2020-07-01T19:48:59.000Z": "State monthly testing goal is 200,000. @LouisianaGov says state tested 385,000 people in June. But he says case growth is outpacing testing. #lalege  #lagov", "2020-07-01T19:48:28.000Z": ". @LouisianaGov says vast majority of spread of virus is coming from communities.", "2020-07-01T19:48:16.000Z": ". @LouisianaGov : Vast majority of case growth coming from community spread (98%) rather than congregant setting. Huge increase case growth age 18-29 #lagov  #lalege  #COVIDー19", "2020-07-01T19:47:42.000Z": ". @LouisianaGov : vast majority of spread is from the community, 98% of today's cases #coronavirus", "2020-07-01T19:47:35.000Z": "@LouisianaGov \"We know a vast majority of our cases are being caused by community spread.\" 98% are from community spread.", "2020-07-01T19:46:48.000Z": ". @LouisianaGov : Statewide positivity rate 9.7%, up about 4% (10% or lower is barometer to know you're where you need to be) #lagov  #lalege  #COVIDー19", "2020-07-01T19:46:42.000Z": ". @LouisianaGov : in June we tested 385K people, almost twice our goal #coronavirus", "2020-07-01T19:44:56.000Z": ". @LouisianaGov : We haven't reported more than 2,000 cases in single day since April. We have 799 patient in hospital - highest since May 7 #lagov  #lalege  #COVIDー19", "2020-07-01T19:44:43.000Z": "#BREAKING  @LouisianaGov Says the state is reporting 2,083 NEW Covid-19 cases today. \"We should all be concerned.\"", "2020-07-01T19:44:39.000Z": ". @LouisianaGov says reporting 2,083 new cases today. Most reported cases in a day since April.", "2020-07-01T19:44:29.000Z": ". @LouisianaGov : about 900 of today's cases were backlogged, dated from 6/16-6/29 but there's still an awful lot of #COVID new cases in one day #coronavirus", "2020-07-01T19:43:42.000Z": ". @LouisianaGov : Today 2,083 cases: 'You heard me right' #lagov  #lalege  #COVIDー19", "2020-07-01T19:43:11.000Z": "Edwards says the state is going to \"increase enforcement\" of rules. \"Because we don't want to go back to reduced occupancy if we can avoid it.\" #lalege  #lagov", "2020-07-01T19:43:10.000Z": ". @LouisianaGov : We are going to be more robust with enforcement. Also asking public not to patronize businesses that aren't complying #lagov  #lalege  #COVIDー19", "2020-07-01T19:43:06.000Z": "@LouisianaGov is encouraging customers to patronize businesses who are \"concerned for your health.\"", "2020-07-01T19:43:03.000Z": ". @LouisianaGov : don't patronize businesses that are not complying #coronavirus", "2020-07-01T19:42:55.000Z": ". @LouisianaGov says he's going to be boosting enforcement efforts of the current restrictions on businesses. #lalege  #lagov", "2020-07-01T19:41:58.000Z": ". @LouisianaGov : we are going to increase enforcement #coronavirus", "2020-07-01T19:41:32.000Z": ". @LouisianaGov : We are going to everything we can to get more compliance with restrictions we currently have in place in Phase 2 and with mitigation measures for general public #lagov  #lalege  #COVIDー19", "2020-07-01T19:40:54.000Z": ". @LouisianaGov : I am NOT today announcing additional restrictions for Louisiana #lagov  #lalege  #COVIDー19", "2020-07-01T19:40:45.000Z": ". @LouisianaGov said he's not announcing new restrictions despite the case spike. #lalege  #lagov", "2020-07-01T19:40:44.000Z": ". @LouisianaGov said he supports mask mandates from @MayorBroome , @mayorcantrell and @CynthiaLeeSheng in EBR, Orleans and Jefferson parish. #covid19  #lalege  #lagov", "2020-07-01T19:40:41.000Z": "@LouisianaGov \"I am NOT announcing additional restrictions for Louisiana.\"", "2020-07-01T19:40:03.000Z": ". @LouisianaGov says he supports @MayorBroome 's new mask mandate. He says he supports the similar requirements in New Orleans and Jefferson Parish. #lalege  #lagov", "2020-07-01T19:39:57.000Z": "@LouisianaGov : Mayor Broome has announced a mask mandate. \"I appreciate that decision on her part, I support it. I also support mask mandates in New Orleans and Jefferson Parish.", "2020-07-01T19:39:52.000Z": ". @LouisianaGov on EBR mask mandate: I appreciate that decision and support it #coronavirus", "2020-07-01T19:39:31.000Z": "Baton Rouge will be one of three sites in the country to have a new federally-supported testing site that will be able to test 5,000 people per day. JBE says it'll start Tuesday. #lalege  #lagov", "2020-07-01T19:39:19.000Z": ". @LouisianaGov says the state, HHS and federal partner will stand up new testing sites in Baton Rouge to tests an additional 5000 tests a day. This is one of three such similar efforts happening nationwide.", "2020-07-01T19:39:17.000Z": ". @LouisianaGov : We're on course by Tuesday hope to have number of testing sites in BR for 5K tests a day to help us get on top of this situation - one of three such efforts in country #lagov  #lagov", "2020-07-01T19:39:09.000Z": ". @LouisianaGov \"EBR Parish is becoming a hot spot again.\"", "2020-07-01T19:38:44.000Z": ". @LouisianaGov \"The situation isn't as rosy as we'd like it to be.\"", "2020-07-01T19:38:42.000Z": ". @LouisianaGov says the White House Coronavirus Task Force is now concerned about the rising virus cases in Louisiana. He says Baton Rouge is becoming a hot spot again. #lalege  #lagov", "2020-07-01T19:38:29.000Z": ". @LouisianaGov : E.Baton Rouge becoming hot spot again. Caused Dr. Birx to give me a call #lagov  #lalege", "2020-07-01T19:38:05.000Z": ". @LouisianaGov : EBR Parish is becoming a hot spot again #coronavirus", "2020-07-01T19:37:43.000Z": ". @LouisianaGov : Spoke to Dr. Birx (White House) yesterday, who said biggest concern increase in percentage of positive tests #lagov  #lalege  #COVIDー19", "2020-07-01T19:37:34.000Z": ". @LouisianaGov \"Over the second half of June, we've lost all the progress we had in terms of hospitalizations.\"", "2020-07-01T19:37:33.000Z": ". @LouisianaGov says he had a long conversation with Dr. Birx from the White House Coronavirus Task Force. Louisiana is firmly on the White House's radar because of increasing positive cases. #lalege  #lagov", "2020-07-01T19:37:27.000Z": ". @LouisianaGov : Louisiana is now back on the radar of the White House coronavirus task force, they're concerned about an increase in test positivity. @WBRZ", "2020-07-01T19:37:18.000Z": "Edwards said Louisiana is now back on the radar of federal officials. He spoke with Dr. Birx yesterday and says she was concerned with the rise in positive rate in cases. #lalege  #lagov", "2020-07-01T19:37:04.000Z": "\"We lost all of the progress we made in the month of June.\" - @LouisianaGov says as it relates to where the state stands when it comes to #Covid19", "2020-07-01T19:37:00.000Z": ". @LouisianaGov : Big concern is increase in positivity across the state #coronavirus", "2020-07-01T19:36:48.000Z": "@LouisianaGov \"Over the month of June we lost all of the progress we made as far as hospitalizations.\"", "2020-07-01T19:36:42.000Z": ". @LouisianaGov : After many weeks of moving in right direction we are now seeing sustained increased in cases. I will tell you over second half of June lost all of progress made in June in terms of hospitalizations. Cases back to highest point ever been. #lagov  #lalege  #COVIDー19", "2020-07-01T19:36:22.000Z": ". @LouisianaGov says we are now seeing a sustained increase in Covid-19 cases.", "2020-07-01T19:36:08.000Z": "\"After many weeks of moving in the right direction,\" Edwards said. \"We are now seeing a sustained increase in cases.\" #lalege  #lagov", "2020-07-01T19:36:01.000Z": ". @LouisianaGov : we are now seeing a sustained increase in cases #coronavirus", "2020-07-01T19:35:56.000Z": ". @MayorBroome joins @LouisianaGov for his weekly coronavirus briefing. #lalege  #lagov", "2020-07-01T19:34:50.000Z": ". @LouisianaGov and @MayorBroome are doing a coronavirus press conference momentarily. Broome announced a mandatory mask policy in BR businesses today, and the state has seen surging cases. #lalege  #lagov", "2020-07-01T19:31:44.000Z": ". @LouisianaGov set to begin presser after the largest single-day number of new Louisiana #COVIDー19 cases in almost three months. #lagov  #lalege", "2020-07-01T19:31:38.000Z": "WATCH LIVE: @LouisianaGov COVID-19  briefing at 2:30 p.m. #lagov  #lalege Gov. Edwards on COVID-19 in Louisiana: Trajectory doesn't look good BATON ROUGE, La. (KTAL/KLFY) - As Louisiana sees one of the worst days for new COVID-19 cases and rising positivity rates, Gov. John Bel Edwards is warning that the state is on a path for things to arklatexhomepage.com", "2020-07-01T19:00:00.000Z": "@LouisianaGov John Bel Edwards will provide an update to #Louisiana citizens on the state's response to #COVID19 at around 2:30pm. You can watch on LPB -HD or online at: https:// youtube.com/watch?v=JR5Kw8 uDXV0&feature=youtu.be   #InItTogether", "2020-07-01T17:17:36.000Z": "The @LADeptHealth is reporting 2,083 cases reported to the state since June 30, 2020. The collection dates for these cases fall between June 13 and July 1.\n\nGov. Edwards will provide an update on COVID-19 today at 2:30 p.m. : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov", "2020-07-01T16:59:14.000Z": "Since yesterday, 23,577 new tests have been reported to the state. That brings the total number of tests to 752,088. \n\n98% of the cases reported to the state today were community spread.\n\n49% of these cases are among people aged 29 and under.", "2020-07-01T16:59:13.000Z": "The Louisiana Department of Health reports 2,083 cases reported to the state since June 30, 2020. The total number of cases reported to the state is 60,178. The collection dates for these cases fall between June 13, 2020 and July 1, 2020.", "2020-07-01T16:57:41.000Z": "July 1 #COVID19 Numbers In Louisiana: 2,083 new cases, 60,178 total 17 new deaths, 3,130 total 799 hospitalized, 84 on vents 752,088 tests completed  @LouisianaGov media briefing today at 2:30 pm CDT; watch at http:// gov.louisiana.gov", "2020-07-01T14:45:00.000Z": "The Louisiana Department of Veterans Affairs is asking Louisianans to show love and support to the more than 600 veterans living in state-run homes by writing letters. Project LOVE asks Louisianans to write to state veterans The Louisiana Department of Veterans Affairs is asking Louisianans to show love and support to the more than 600 veterans living in state-run homes by writing letters. katc.com", "2020-07-01T14:46:52.000Z": "As a part of the @LaVetAffairs Project LOVE initiative, I'm asking all Louisianans to write to the veterans who live in Louisiana's state-run nursing homes as a token of our gratitude for their service & sacrifice.\n\nFor more info, visit: http:// vetaffairs.la.gov . #lagov  #lalege", "2020-06-30T23:32:55.000Z": "We are grateful to #lalege and @LouisianaGov  #lagov for efforts to minimize cuts to institutions, fully fund #TOPS and increase need-based aid...Full statement is below.", "2020-06-30T23:13:06.000Z": ". @LouisianaGov says he'll have much more information about possible new restrictions to stem surge of #COVIDー19 at tomorrow's 2:30 p.m. presser #lagov  #lalege", "2020-06-30T23:03:53.000Z": "Speaking about possibly requiring masks in public, . @LouisianaGov says they're looking at all options to get the state off its trajectory. He says that masks are strongly encouraged and some jurisdictions in the state have made them mandatory in certain settings. @WBRZ", "2020-06-30T23:03:18.000Z": ". @LouisianaGov says: \"I do intend to sign the bill.\" #lalege  #lagov Quote Tweet Melinda Deslatte @MelindaDeslatte . @LouisianaGov says of the deal brokered on the civil litigation system changes (tort reform): \"I think it represents a real compromise.\" #lalege  #lagov", "2020-06-30T23:00:43.000Z": "WILL @LouisianaGov REQUIRE MASKS: We are going to be looking at a number of measures. We do know masks are important. \"At the end of the day we need people to do a better job at wearing masks.\"", "2020-06-30T23:00:35.000Z": ". @LouisianaGov says he will look at everything need to do to get control of #COVIDー19 numbers. 'We're going to be looking at a number of measures (like requiring masks for general public). Guidance from White House considering mandatory mask uses (regionally)' #lagov  #lalege", "2020-06-30T22:59:10.000Z": ". @LouisianaGov on tax breaks passed for biz: 'I can appreciate giving help to biz, but at same time have to understand those are tax expenditures. Am I concerned? I am. I'm not going to make specific comments on any one of those bills' #lagov  #lalege", "2020-06-30T22:58:46.000Z": ". @LouisianaGov makes no commitments on tax break bills, says will be reviewing them all. #lalege  #lagov", "2020-06-30T22:58:40.000Z": "Speaking about today's COVID-19 numbers, . @LouisianaGov says that young people, age 18-29, continue to see the largest spike in cases. Today, that group made up more than 20% of new daily cases, yesterday it was nearly 50%.", "2020-06-30T22:57:37.000Z": "Before going to media questions, @LouisianaGov recaps today's #COVID19 numbers (up 1000 today) and reminds everyone that his next Coronavirus media briefing is tomorrow at 2:30 pm CDT. #lalege  #lagov", "2020-06-30T22:57:14.000Z": ". @LouisianaGov : 27% of new cases today ages 18-29. 'That's driving the increase in Louisiana' #lagov  #lalege  #COVIDー19", "2020-06-30T22:57:12.000Z": ". @LouisianaGov endorses task force set up by the Legislature to study policing. He says the examination is not just about policing but also about race and racial injustice. Some House Republicans had said the task force to improve policing should not be about race. #lalege", "2020-06-30T22:56:51.000Z": "@LouisianaGov will have a full Covid-19 presser tomorrow.", "2020-06-30T22:56:17.000Z": "@LouisianaGov is proud the legislature passed House Bill 70 which will allow frontline workers who worked through Covid-19 to apply for a $250 stimulus check.", "2020-06-30T22:56:12.000Z": ". @LouisianaGov : I want to point out full #COVIDー19 briefing scheduled at 2:30 p.m. Wednesday #lagov  #lalege", "2020-06-30T22:55:43.000Z": "Talking about auto insurance tort reform that passed both the house and senate today, . @LouisianaGov says it's \"much more balanced\" than bills in the past. @WBRZ", "2020-06-30T22:55:20.000Z": ". @LouisianaGov on tort reform (House Bill 57 by Speaker): 'Much more balanced approach than other bills floating around. Represents real compromise.' Thanks speaker and others. He will sign #lagov  #lalege", "2020-06-30T22:55:10.000Z": ". @LouisianaGov says of the deal brokered on the civil litigation system changes (tort reform): \"I think it represents a real compromise.\" #lalege  #lagov", "2020-06-30T22:53:51.000Z": ". @LouisianaGov says he supports @realCleoFields legislation creating task force to study policing issues. \"This task force is an important step.\" #lalege  #lagov", "2020-06-30T22:53:48.000Z": ". @LouisianaGov says appreciates lawmakers raising issue of racial injustice. 'I believe we can do better' #lagov  #lalege", "2020-06-30T22:53:42.000Z": ". @LouisianaGov praises HB 70, which allows front line workers to apply for $250 of hazard pay for working during the stay at home order.\n\n\"You can't put a price tag\" on how these individuals have helped during this time, he said. @WBRZ", "2020-06-30T22:53:33.000Z": ". @LouisianaGov says $50 million for payments to essential workers in Louisiana is a way of acknowledging the work of so many who have supported us throughout the #COVID19 pandemic. #lagov  #lalege", "2020-06-30T22:53:04.000Z": "@LouisianaGov says raises they are entitled to receive. Quote Tweet Greg Hilburn @GregHilburn1 . @LouisianaGov : Disappointed in Legislature's postponement of state workers' pay raise #lagov  #lalege  #COVID19", "2020-06-30T22:52:57.000Z": ". @LouisianaGov : Also commends Sen. Cleo Fields resolution to study police practices across Louisiana; about policing and race #lagov  #lalege", "2020-06-30T22:52:40.000Z": ". @LouisianaGov says he supports the $250 one-time check for front-line workers who stayed on the job in the early day of the coronavirus pandemic. #lalege  #lagov", "2020-06-30T22:51:43.000Z": ". @LouisianaGov says other measures did focus on workers; praises House Bill 70 by Rep. Sam Jenkins to provide $250 hazard payments to frontline workers who stayed on job during #COVIDー19  #lagov  #lalege", "2020-06-30T22:51:40.000Z": ". @LouisianaGov calls the budget for upcoming year \"workable,\" but says he's not pleased with the Legislature's effort to stall planned pay raises for state workers. #lalege  #lagov", "2020-06-30T22:50:45.000Z": ". @LouisianaGov : Disappointed in Legislature's postponement of state workers' pay raise #lagov  #lalege  #COVID19", "2020-06-30T22:50:11.000Z": ". @LouisianaGov : Cuts to higher ed and health care not ideal. But federal help allowed us to pass a workable budget and consistent (with our plan) #lagov  #lalege", "2020-06-30T22:50:09.000Z": ". @LouisianaGov : \"The budget passed was not the budget we envisioned at the start of the regular session. The economy was good, COVID hadn't hit yet.\" @WBRZ", "2020-06-30T22:49:55.000Z": ". @LouisianaGov says that we are here today, with a workable budget, thanks to the CARES Act funding. #lalege  #lagov", "2020-06-30T22:49:30.000Z": ". @LouisianaGov in presser: Budget passed not what we envisioned at start of regular session in March. At that time economy doing extremely well. #COVID hadn't hit La. in a meaningful way. #lagov  #lalege", "2020-06-30T22:47:59.000Z": "\"I want to express that I am thankful for the legislature for working through Covid-19. It's been eventful.\" @BRProudNews  @LouisianaGov", "2020-06-30T22:46:56.000Z": "Now ... @LouisianaGov  is holding a post-session presser. #lalege  #lagov", "2020-06-30T22:45:53.000Z": "Happening Now Quote Tweet John Bel Edwards @LouisianaGov Today, Gov. Edwards will deliver remarks on the adjournment of the 2020 Special Legislative Session. #lagov  #lalege  : 5:30 pm : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov", "2020-06-30T22:35:45.000Z": "WATCH LIVE: Gov. @LouisianaGov to speak on outcomes of Special 2020 Session - https:// bit.ly/3ig554H  #lagov  #lalege  @NBC6News", "2020-06-30T22:11:43.000Z": "Today, Gov. Edwards will deliver remarks on the adjournment of the 2020 Special Legislative Session. #lagov  #lalege  : 5:30 pm : http:// Facebook.com/LouisianaGov  : http:// gov.la.gov", "2020-06-30T20:14:41.000Z": "Mask up, Bulldogs Let's all do our part now, so we can be together again soon. #CultureOfCaring", "2020-06-30T17:08:57.000Z": "Today, @LADeptHealth is reporting 1,014 new COVID-19 cases, with 90 percent of cases coming from the community. \n\nSome of you may be done with COVID-19, but COVID-19 is not done with Louisiana. #lagov  #lalege", "2020-06-30T16:58:36.000Z": "The Louisiana Department of Health reports 1,014 cases reported to the state since June 29, 2020. The total number of cases reported to the state is 58,095.", "2020-06-30T15:31:19.000Z": "Lack of cooling at night and elevated heat indices during the day have prompted our office to issue a Heat Advisory. Heat indices of 104 to 108 are expected this afternoon across the advised area. Many areas have struggled to fall below 80 last two mornings. #lawx  #mswx", "2020-06-30T16:13:19.000Z": "Just one person's actions can help stop the spread of COVID-19. \n\nIt's on all of us to do our part and take the necessary precautions to keep Louisiana healthy and safe. #MaskUpLa  #lagov Quote Tweet University of New Orleans @UofNO Please remember the pandemic is not over. Louisiana cases are increasing and the fastest growth is among young adults 18 to 29 years old. \n\nLet's all do our part, Privateers! #MaskUpUNO  #UNOproud", "2020-06-30T14:35:02.000Z": "Stay safe today, Louisiana! Drink plenty of water and stay hydrated Wear light and loose-fitting clothing Limit your outdoor activities Take breaks in the air conditioning or shade Never leave children or pets in the car unattended #lagov  #lalege  #lawx Quote Tweet NWS New Orleans @NWSNewOrleans What can you do during this period of very hot and muggy conditions? Wear light, loose-fitting clothing Drink water often. Don't wait until you are thirsty.\nAvoid unnecessary hard work or other activities outdoors. Take extra breaks. #lawx  #mswx", "2020-06-30T13:09:17.000Z": "With heat index readings above 100 in many areas, please remember to look before you lock-", "2020-06-30T01:02:02.000Z": ". @LouisianaGov decision to invest $32 million into our schools means more children will have the technology to access online learning. #LouisianaBelieves Quote Tweet Will Sentell @WillSentell Computers, internet access key targets  of federal aid under governor's control https:// theadvocate.com/baton_rouge/ne ws/education/article_16dfbbe4-ba18-11ea-8d5c-e3c15513511d.html?utm_medium=social&utm_source=twitter&utm_campaign=user-share  via @theadvocatebr", "2020-06-29T23:52:38.000Z": "Big news! ... @La_DOTD  has made the long-overdue Comite River Diversion Canal Project a top priority. With ... @onevisionary 's signature today, we are one step closer to providing flood protection to residents near the Comite. #lagov  #lalege DOTD signs contract with construction company to build bridges for Comite Diversion Canal project The Louisiana Department of Transportation and Development (DOTD) has officially entered into a Construction Management at Risk (CMAR) contract with the company the state agency has selected to build... wafb.com", "2020-06-29T21:45:22.000Z": "Wear a mask so we can #TakeFlight once again. #MaskUpLa Quote Tweet New Orleans Pelicans @PelicansNBA Defend home court!  #MaskUpNOLA", "2020-06-29T20:50:15.000Z": "Be prepared this hurricane season. Put together an emergency supplies kit Make preparations for you and your family, including a personal evacuation plan Stay informed and heed directions from local officials Visit http:// GetAGamePlan.org  #lagov  #lawx", "2020-06-29T19:22:16.000Z": "My statement on today's U.S. Supreme Court ruling on Louisiana's abortion law. #lagov  #lalege", "2020-06-29T18:34:01.000Z": "Don't miss this call. Wear a mask, y'all. #MaskUpLa Quote Tweet New Orleans Saints @Saints Do Your Job  #MaskUpNOLA", "2020-06-29T17:16:03.000Z": "Today, the @LADeptHealth is reporting 845 new COVID-19 cases in Louisiana, with 96 percent of cases being attributed to community spread. \n\nWear a mask. Practice social distancing. Avoid congregating. #lagov  #lalege", "2020-06-29T17:00:15.000Z": "The statewide positivity rate has risen to 9.9%. The federal benchmark for positivity rate is 10%.", "2020-06-29T17:00:14.000Z": "The Louisiana Department of Health reports 845 cases reported to the state since June 28, 2020. The total number of cases reported to the state is 57,081.", "2020-06-28T17:15:59.000Z": "96 percent of today's reported cases are associated with community spread, rather than congregate settings. \n\n43 percent of today's cases are from people 29 years old or younger.\n\nIt's on all of us to stop the spread of COVID-19 in Louisiana. #lagov  #lalege Quote Tweet Louisiana Department of Health @LADeptHealth The Louisiana Department of Health reports 1,467 #COVID19 cases reported to the state. The total number of cases reported to the state to date is 56,236. Show this thread", "2020-06-28T16:54:36.000Z": "Today's update includes cases that would have been reported yesterday had we not experienced a power outage.", "2020-06-28T14:30:00.000Z": "COVID-19 is not done with Louisiana. \n\nWear a mask. Practice social distancing. Wash your hands. Avoid congregating. #lagov  #lalege", "2020-06-27T21:30:00.000Z": "I want to call on the young people of our state to take COVID-19 seriously. 18-29 year-olds are the fastest-growing age group for positive cases in Louisiana.  \n\nIt's on all of us, young and old, to do our part and stop the spread of COVID-19 in Louisiana. #lagov  #lalege", "2020-06-27T14:30:00.000Z": "When you wear a mask, you protect others. When others wear a mask, they protect you. #MaskUpLA  #lagov  #lalege", "2020-06-26T22:00:00.000Z": "This #FellowsFriday , we're meeting Sydney Veazie and Tyson Lee. Sydney is a rising junior at @FordhamNYC working with the governor's policy team and Tyson is a rising senior at @LSU_Shreveport working with @LA_Regents . #lagov  #lalege", "2020-06-26T20:30:23.000Z": "When you wear a mask, you protect others. When others wear a mask, they protect you. #MaskUpLa  #GeauxTigers  #lagov Quote Tweet LSU @LSU #MaskUpLSU , for yourself and your fellow Tigers.", "2020-06-26T19:52:15.000Z": "His vision, enthusiasm, and pioneering spirit transformed Carnival into an unforgettable and uniquely Louisiana experience that attracts people from all around the world to our great state every year. #lagov  #lalege", "2020-06-26T19:52:14.000Z": "To say that Blaine Kern revolutionized Mardi Gras would be an understatement. Blaine made Louisiana synonymous with Mardi Gras, and he will always be remembered for his contributions to Carnival and our state. #lagov  #lalege Blaine Kern Sr., New Orleans' 'Mr. Mardi Gras,' dies at 93 NEW ORLEANS (AP) - Blaine Kern Sr., a float builder who was often credited with helping expand New Orleans' Mardi Gras celebration into a giant event known worldwide, has died. News outlets... apnews.com", "2020-06-26T18:50:20.000Z": "Let's be on the winning team in the fight against COVID-19. #MaskUpLa  #GeauxCajuns  #lagov Quote Tweet Louisiana Ragin' Cajuns® Football @RaginCajunsFB Join our team. \nWear your mask.", "2020-06-26T17:18:55.000Z": ". @LADeptHealth is reporting 1,354 cases reported to the state since June 25. The total number of cases reported to the state is 54,769.\n\n92% of the cases reported to the state today were community spread.\n\nWear a mask. Social distance. Avoid congregating. #lagov  #lalege", "2020-06-26T17:02:00.000Z": "Due to a planned power outage on Saturday, June 27, 2020, the Louisiana Department of Health will not update its dashboard on Saturday. Updates will resume on Sunday, June 28, 2020. http:// ldh.la.gov/coronavirus .", "2020-06-26T16:58:09.000Z": "Since yesterday, 17,341 new tests have been reported to the state. The majority of these tests were collected between June 19 and June 26. That brings the total number of tests to 678,006. \n\n92% of the cases reported to the state today were community spread.", "2020-06-26T16:58:08.000Z": "The Louisiana Department of Health reports 1,354 cases reported to the state since June 25, 2020. The total number of cases reported to the state is 54,769.", "2020-06-26T15:33:04.000Z": ". @LouisianaGov says he reviewed school opening guidelines with Superintendent @cadebrumley . Lot of contingencies and phased guidelines. 'We needed to get information out to local systems and principals. Appreciate work of Dr. Brumley.' #lagov  #lalege  #coronavirus", "2020-06-26T15:22:07.000Z": ". @LouisianaGov : Fact of matter is we're not getting better getting worse. Before it gets out of control we have to get better compliance #lagov  #lalege  #coronavirus", "2020-06-26T15:22:02.000Z": "\"We've got some work to do\".... @LouisianaGov says.  \"People got complacent.\" Urging people to wear masks, be smart about social distancing. @WBRZ", "2020-06-26T15:21:20.000Z": ". @LouisianaGov : I don't want to shut down a single business. But I will do that before we have to go backward in a phase. #lagov  #lalege  #coronavirus", "2020-06-26T15:20:26.000Z": ". @LouisianaGov : We're going to do a more robust job of responding to complaints about lack of compliance in businesses and make courtesy visits. We're not going to allow the bad actors to cause the state to go backward #lagov  #lalege", "2020-06-26T15:19:23.000Z": ". @LouisianaGov : Even if a young person isn't going to have (serious issues) they're going to go home and give to mom and pop and grandma and grandpa. #lagov  #lalege  #coronavirus", "2020-06-26T15:18:40.000Z": "Young people: 18-21 are the biggest concern b/c they don't appear to be following any social distancing recommendations, @LouisianaGov says in Zoom meeting: https:// youtube.com/watch?v=5yX4XG pbV6c   @WBRZ", "2020-06-26T15:18:22.000Z": ". @LouisianaGov : One of most disturbing trends we've seen is age group contracting disease in biggest amounts 18-29. #lagov  #lalege", "2020-06-26T15:18:04.000Z": "Points @LouisianaGov makes on #COVID19 in Louisiana: Percent of tests that are positive is going up Basically back to where we were in May on hospitalizations Louisiana has exceeded testing goals for June 18-29 age group has fastest rate of COVID growth #lalege  #lagov", "2020-06-26T15:16:06.000Z": "\"As of yesterday, we gave up all the gains in hospitalizations that we'd made over the course of June. We're now back to where we were at the end of May.\" - @LouisianaGov  @WAFB", "2020-06-26T15:16:14.000Z": ". @LouisianaGov : We're still not currently close to exceeding our ability to deliver healthcare, but we're heading in that direction #lagov  #lalege  #coronavirus", "2020-06-26T15:16:16.000Z": "Discussion about if LA will be in dire hospital service issues:\n\n\"Wer'e not there yet,\" @LouisianaGov says about running out of room in hospitals to treat coronavirus patients.", "2020-06-26T15:17:06.000Z": "\"[People are not complying] with mitigation measures,\" resulting in surge in COVID-19 cases. @LouisianaGov not blaming re-opening... says it's the general public not doing things like wearing a mask.", "2020-06-26T15:15:23.000Z": ". @LouisianaGov : If look at places around country see spiking in Arizona, Texas, Fla. In Texas, @GovAbbott closing bars. I've decided not to go backward, but pause where we are and try to get more compliance #lagov  #lalege  #coronavirus", "2020-06-26T15:14:23.000Z": ". @LouisianaGov : I know it's disappointing we're not moving to Phase 3, but we don't meet the criteria #lagov  #lalege  #coronavirus", "2020-06-26T15:14:12.000Z": "\"The number of people testing positive now exceeds the number that we're presuming recovered.\" - @LouisianaGov", "2020-06-26T15:14:08.000Z": ". @LouisianaGov says it's \"erroneous and foolish\" to say that if we stop testing for coronavirus we won't have any more cases. He's speaking to his covid task force. #lalege  #lagov", "2020-06-26T15:13:41.000Z": ". @LouisianaGov : Our testing is robust and that's incredibly important. #lagov  #lalege  #coronavirus", "2020-06-26T15:12:27.000Z": ". @LouisianaGov says percentage of positive tests growing. #lagov  #lalege  #coronavirus", "2020-06-26T15:09:28.000Z": ". @LouisianaGov : Yesterday 938 new cases ... that means as of today well over 53K cases. One of things you should know for number of weeks number of recovered was greater than number testing positive. That is no longer the case #lagov  #lalege  #coronavirus", "2020-06-26T15:07:31.000Z": ". @LouisianaGov : About every 7 days or so take hard look at data and if situation allows we could move into Phase 3 before the 28-day order expires #lagov  #lalege", "2020-06-26T15:06:43.000Z": ". @LouisianaGov : I just thought it time to give you all an update and to ask for additional assistance. Significant events and numbers since last we spoke. On Monday announced won't move to Phase 3 #lagov  #lalege  #coronavirus", "2020-06-26T14:40:13.000Z": "Billions of dollars in funding are allocated to hospitals, public services, schools & roads based on census data. I urge everyone to do their part in shaping our communities and our state and fill out the 2020 Census today. #lagov  #LouisianaCounts  : http:// my2020census.gov", "2020-06-25T21:32:50.000Z": "Update: @LouisianaGov officially drops order extending Phase 2 by 28 days #lagov  #lalege  #coronavirus Quote Tweet Greg Hilburn @GregHilburn1 . @LouisianaGov Chief of Staff Mark Cooper calls some GOP House members actions to overturn emergency order 'reckless,' putting lives, return to schools and federal funding at risk #lalege  #lagov  #coronavirus  https:// thenewsstar.com/story/news/202 0/06/25/louisiana-governor-pauses-reopening-coronavirus-spike-continues/3258587001/  via @thenewsstar", "2020-06-25T21:34:08.000Z": ". @LouisianaGov has signed the extension of Phase 2 for another 28 days. The only significant change it appears is adding a 250-person limit on indoor gatherings. https:// gov.louisiana.gov/assets/Proclam ations/2020/83-JBE-2020-State-of-Emergency-COVID-19-Resilient-Louisiana-Phase-2.pdf   #lalege  #lagov", "2020-06-25T21:27:17.000Z": "We have watched with concern as cases continue to rise in Louisiana, which is why we are pausing the state in Phase Two for now. Data from the last three days makes it crystal clear that Louisiana is not ready to move to Phase Three just yet. #lagov  #lalege", "2020-06-25T21:27:16.000Z": "Today, I formally extended Phase Two of reopening in Louisiana for another 28 days, as new COVID-19 cases and hospitalizations increase across the state. Since Monday, we have added 3,637 new positive cases. #lagov  #lalege  : https:// gov.louisiana.gov/index.cfm/news room/detail/2573 ", "2020-06-25T19:30:00.000Z": "As a result of increased cases of COVID-19 in Louisiana, we will remain in Phase Two for the next few weeks. COVID-19 is alive and well in Louisiana, and we must continue to be good neighbors and wear masks, social distance and practice good hygiene. #lagov  #lalege", "2020-06-25T17:06:54.000Z": "As of 12 p.m. today, @LADeptHealth is reporting 938 new cases of COVID-19 in Louisiana with 93 percent of cases coming from the community. \n\nWear a mask. Practice Social Distancing. Avoid Congregating. #lagov  #lalege", "2020-06-25T16:59:32.000Z": "The Louisiana Department of Health reports 938 cases reported to the state since June 24, 2020. The total number of cases reported to the state is 53,415.", "2020-06-25T15:35:48.000Z": "I joined @La_DOTD today to announce that the new I-20/Tarbutton Road interchange in Ruston is fully open to traffic. This type of investment is indicative of our continual efforts to make smart decisions with transportation funding. #lagov  #lalege  : https:// gov.louisiana.gov/index.cfm/news room/detail/2570 ", "2020-06-25T00:40:23.000Z": "Earlier today @LouisianaGov led a discussion with @GovernorBullock and @GovernorGordon on \"Public Private Partnerships: Keys to Success\" along with @Macquarie 's David Agnew and @IFM_Investors Tom Osborne. Watch the complete session at: https:// nga.org/infrastructure success/ ", "2020-06-25T00:02:47.000Z": ". @LouisianaGov & @FirstLadyOfLA Donna Edwards urge #Louisiana residents to take precautions against #COVID19  #lagov  #lalege Gov. Edwards & Donna Edwards urge Louisiana residents to take precautions against COVID-19 BATON ROUGE, La. (KTAL/KMSS) - Governor John Bel Edwards and his wife, Donna Edwards, are urging the people of Louisiana to remain vigilant and take the necessary precautions to protect themselves  arklatexhomepage.com"}