{"2020-07-30T16:42:57.000Z": "Andy Serafini has been a longtime champion for the people of Washington County, a valued leader in the Senate, and a good friend. My full statement on his resignation:", "2020-07-30T00:33:35.000Z": "Great #StillStanding event tonight. Thank you to my good friend @GovChristie for joining us to share a few old stories! \n\nSign up for more events at http:// Stillstandingbook.com/#cta", "2020-07-30T00:19:17.000Z": "Tomorrow the IOP welcomes Maryland Gov. @LarryHogan to the Fast Forum with IOP Resident Fellow F'15 @DougHeye  Thu., July 30 6pm ET\nRSVP to join the conversation  http:// bit.ly/2WdF5gO", "2020-07-29T19:50:25.000Z": "Chatted with Governor @LarryHogan on how high taxes and business crushing policies led to traditionally blue Maryland elect him and turn the state red: https:// youtube.com/watch?v=GqSpn6 uymNM&list=PLEbhOtC9klbCr0iN2ANJbaV477B0eSpc6&index=2&t=0s ", "2020-07-29T19:35:13.000Z": "Watch today's press conference live: Press Conference - July 29, 2020 youtube.com", "2020-07-27T15:39:00.000Z": "This week the IOP welcomes Maryland's @LarryHogan , author of \"Still Standing: Surviving Cancer, Riots, a Global Pandemic and the Toxic Politics that Divide America,\" to the Fast Forum with IOP Resident Fellow F'15 @DougHeye . Thu., July 30 6pm ET  http:// bit.ly/2WdF5gO", "2020-07-29T13:16:47.000Z": "Today at 3:30 p.m., I will provide an update on Maryland's ongoing #COVID19 response and recovery efforts. \n\nWatch live on Twitter, Facebook ( @GovLarryHogan ), or YouTube (live captioning available): https:// bit.ly/3bvczfj", "2020-07-29T01:39:48.000Z": "Absolutely heartbroken by the passing of Mo Gaba, a bright light who brought joy to all who knew him and hope to everyone who heard his story. Our prayers go out to his family and loved ones. #MoStrong", "2020-07-28T23:00:10.000Z": "I have ordered Maryland flags to be lowered to half-staff to honor the life and memory of Bob Culver, County Executive for Wicomico County. It will be raised to full-staff at sunset on the day of his interment. We continue to keep his loved ones in our prayers.", "2020-07-28T00:09:20.000Z": "\"I'm hoping we can put aside whatever partisan differences there are and find some kind of common sense, bipartisan solution in Congress,\" @GovLarryHogan says, \"to come up with some type of extension of these benefits\" amid the coronavirus pandemic. http:// abcn.ws/30RUy7N", "2020-07-27T16:51:26.000Z": "I am honored that The @RonaldReagan Presidential Foundation and Institute will be hosting an event with us tomorrow at 7:00 PM Eastern/4:00 PM Pacific. This event is free and open to the public. Join us and watch live here: https:// youtube.com/reaganfoundati on  . ReaganFoundation The Ronald Reagan Presidential Foundation and Institute is the non-profit organization created by President Reagan himself and specifically charged by him wi... youtube.com", "2020-07-26T16:00:43.000Z": "Deeply saddened by the passing of my friend Wicomico County Executive Bob Culver, a lifelong Marylander who fought a tremendous battle against liver cancer. The First Lady and I ask that you join us in keeping Bob's family and loved ones in your prayers.", "2020-07-26T13:07:39.000Z": "As we recognize the importance of ensuring inclusive environments for Marylanders with disabilities, we encourage all of our citizens to celebrate their rights and abilities. Read the proclamation: https:// governor.maryland.gov/2020/07/26/gov ernor-hogan-honors-30th-anniversary-of-the-americans-with-disabilities-act/ ", "2020-07-26T13:07:14.000Z": "I have proclaimed July 26, 2020 as a day of observance of the progress made in the 30 years since the passing of the Americans with Disabilities Act. #ADA30", "2020-07-25T21:43:02.000Z": "Larry Hogan On The Parallels Of Fighting Cancer And Maryland's Coronavirus Outbreak Larry Hogan On The Parallels Of Fighting Cancer And Maryland's Coronavirus Outbreak NPR's Michel Martin speaks with Maryland Gov. Larry Hogan about his new book Still Standing: Surviving Cancer, Riots, a Global Pandemic, and the Toxic Politics That Divide America. npr.org", "2020-07-25T17:55:58.000Z": "Tomorrow on #CNNSOTU w/ @jaketapper :  @HHS_ASH Admiral Brett Giroir Governor @LarryHogan   @RepKarenBass   @larry_kudlow   @ChicagosMayor Lori Lightfoot\n\nTune in on  @CNN ,  @CNNi ,  @tunein , @SIRIUSXM Ch. 116 &  http:// cnn.com/GO !", "2020-07-24T19:15:00.000Z": "LIVE: Governor @LarryHogan joins @jaketapper this Sunday on #CNNSOTU . Tune in!", "2020-07-24T14:12:58.000Z": "Maryland saw another significant day for #COVID19 testing yesterday with 24,220 tests reported. The statewide positivity rate is now 4.69%.", "2020-07-24T14:12:59.000Z": "I want to commend Queen Anne's County on becoming the 22nd jurisdiction to meet the state's goal of testing 10% of its population. \n \nFind a site near you at http:// covidtest.maryland.gov .", "2020-07-23T19:30:45.000Z": "This morning, I spoke with @GovernorVA and @MayorBowser to discuss our ongoing regional response to #COVID19 . We are closely monitoring the data, and continue to urge residents to help us slow the spread by wearing masks, practicing physical distancing, and avoiding crowds.", "2020-07-22T21:08:20.000Z": "Watch today's press conference live: Press Conference - July 22, 2020 youtube.com", "2020-07-21T18:26:24.000Z": "ICYMI | @ScottGottliebMD sat down with @GovLarryHogan this morning for a discussion on the steps that Maryland has taken to combat the spread of COVID-19 and strategies for protecting against continued risk. Watch their full conversation here: Webinar - Gov. Larry Hogan and Scott Gottlieb: Maryland's COVID-19... Many states continue to grapple with widespread community transmission of COVID-19. In Maryland, cases are down, following aggressive steps to reduce spread ... youtube.com", "2020-07-21T12:03:16.000Z": "I'll be interviewing Maryland Governor Larry Hogan today at 9:30AM on Covid, his new book, leadership, and Maryland's response to the public health crisis. Please send me your questions for the Governor #TheHoganInterview  @AEI Webinar - Road map to recovery: Gov. Larry Hogan and Scott Gottlieb on Maryland's COVID-19 response... Join AEI Resident Fellow Scott Gottlieb and Maryland Gov. Larry Hogan as they discuss how Maryland is confronting COVID-19 and what we can do to prepare for continued risks. aei.org", "2020-07-20T22:30:00.000Z": "Wearing a mask is a simple step we can all take to slow the spread of COVID-19. Our health and economic recovery depends on each and every one of us doing our part. #MasksOnMaryland", "2020-07-20T16:15:09.000Z": "Webinar: Join @ScottGottliebMD tomorrow as he and Gov. @LarryHogan discuss how Maryland is confronting the epidemic and what we can do to better prepare for its continued risks. Webinar - Road map to recovery: Gov. Larry Hogan and Scott Gottlieb on Maryland's COVID-19 response... Join AEI Resident Fellow Scott Gottlieb and Maryland Gov. Larry Hogan as they discuss how Maryland is confronting COVID-19 and what we can do to prepare for continued risks. aei.org", "2020-07-20T13:45:09.000Z": "THIS MORNING: Maryland Gov. @LarryHogan joins us LIVE to discuss the latest headlines and more.", "2020-07-20T11:55:15.000Z": "Hogan: Governors like me rely on experts for COVID facts. Dr. Fauci has never let me down. https:// usatoday.com/story/opinion/ 2020/07/20/trump-downplayed-coronavirus-fauci-gave-governors-facts-column/5467859002/  via @usatoday Hogan: Governors like me rely on experts for COVID facts. Dr. Fauci has never let me down. As Trump downplayed COVID, Fauci offered clear-eyed views of the evidence and what we faced. I shudder to think where our country would be without him. usatoday.com", "2020-07-19T09:25:26.000Z": "A Heat Advisory is in effect today from Noon until 8PM as well above normal temperatures and high humidity is expected. Be sure to practice #heat safety if spending anytime outdoors. Details: https:// bit.ly/2Csu9oP , Safety Tips: http:// weather.gov/heat  #dcwx  #mdwx  #vawx  #wvwx", "2020-07-17T17:39:54.000Z": "SUNDAY: We get the latest on Maryland's efforts to combat #COVID19 and how residents can find relief from #coronavirus -related economic impacts with @LarryHogan  On TV, radio, and streaming online at https:// cbsn.ws/2OMQQqF , don't miss @FaceTheNation  https:// cbsn.ws/32sOyol", "2020-07-18T21:22:24.000Z": "This weekend, tune in to @SXMPOTUS (tonight at 8 pm!) for my interview with @LarryHogan about his new book Still Standing, his battle with non-Hodgkins lymphoma, his vision for the GOP, and our shared opposition to the Miami Hurricanes. (He's a Seminole but we kept things civil.)", "2020-07-18T16:10:01.000Z": "John Lewis represented the very best of our nation-a selfless public servant and moral leader who transcended the ideological divide. He spent the greater part of his life fighting for equality and justice, and he leaves an indelible mark on American history. It is a sad day.", "2020-07-17T23:28:02.000Z": "Now more than ever, we must continue to support our local farmers, growers, watermen, and producers, who have remained committed to making sure we all have food on the table. I encourage all Marylanders to join me in celebrating Maryland Buy Local Week. #MDBuyLocal2020 Quote Tweet Maryland Agriculture @MdAgDept MARK YOUR CALENDARS! @GovLarryHogan officially named July 18-26 \"Maryland Buy Local Week\" to support Maryland farms and seafood operations that continue to provide Marylanders with fresh, local products. \n\nMore info: http:// bit.ly/3eyU6Ab  #MDBuyLocal2020", "2020-07-17T16:11:33.000Z": "Our economy is open, recovering, and doing better than many other states, but only the people of Maryland can keep our state open for business by continuing to follow public health guidance. https:// governor.maryland.gov/2020/07/17/mar ylands-economic-recovery-continues-state-adds-68300-jobs-in-june-unemployment-rate-drops-to-8/ ", "2020-07-17T11:59:44.000Z": "... @LarryHogan  says when he was diagnosed with cancer he was more worried about his family.  From my ... @postlive  interview w the Md Gov. #chasingcancer Md. Gov. Larry Hogan says when he was diagnosed with cancer he was more worried about his family Maryland Gov. Larry Hogan was diagnosed with an advanced, aggressive form of cancer just months into his first term. Looking back on that time in his life, Hogan says he was more worried about his... washingtonpost.com", "2020-07-16T15:40:48.000Z": "In his new book, Md. Gov. @LarryHogan talks about his experience with cancer. He shares what it was like to be diagnosed with an aggressive form of cancer, just months into his first term. https:// youtu.be/qgzsVwseo5M", "2020-07-15T21:23:48.000Z": ". @MD_Labor is coordinating with federal authorities to shed light on related fraudulent criminal activity in other states across the country. We will do whatever it takes to ensure the perpetrators are apprehended and prosecuted to the fullest extent of the law.", "2020-07-15T21:23:47.000Z": "The State of Maryland has uncovered a massive and sophisticated criminal enterprise involving more than 47,500 fraudulent unemployment insurance claims in Maryland and totaling over $501 million. \n\nDetails: https:// governor.maryland.gov/2020/07/15/hog an-administration-uncovers-massive-criminal-fraud-scheme/ ", "2020-07-15T20:02:10.000Z": "Watch today's press conference live here: Press Conference - July 15, 2020 youtube.com", "2020-07-14T15:40:32.000Z": "Today I pressed county leaders to enforce public health requirements in bars and restaurants. We cannot allow a small segment of willful violators to squander our collective efforts and jeopardize our state's recovery. Read the letter: https:// governor.maryland.gov/wp-content/upl oads/2020/07/July-14-Letter-Bars-and-Restaurants.pdf ", "2020-07-14T14:01:03.000Z": "This morning, the state is reporting a seven-day positivity rate of 4.64%, with 415 current total hospitalizations for #COVID19 . It is absolutely imperative that Marylanders remain cautious and vigilant: wear face coverings, practice physical distancing, and avoid gatherings.", "2020-07-13T22:14:35.000Z": "On today's call with the @WhiteHouse and my fellow governors, I continued to stress the urgent need to include relief for state and local governments in the next stimulus bill. Failure to do so will only worsen this unprecedented economic crisis. Maryland Governor Says State Needs More Federal Help Maryland Governor Larry Hogan, a Republican, says the states and local governments need to be included in the next federal stimulus package. He says the aid package is needed to prevent his economy... bloomberg.com", "2020-07-13T17:17:25.000Z": ". @LarryHogan , chairman of the @NatlGovsAssoc and author of \"Still Standing: Surviving Cancer, Riots, a Global Pandemic and the Toxic Politics that Divide America,\" joins a conversation with IOP Resident Fellow F'15 @DougHeye . Thu., July 30 6pm ET http:// bit.ly/2WdF5gO", "2020-07-13T14:00:37.000Z": "While a number of states continue to see alarming #COVID19 spikes and outbreaks, the encouraging trends in Maryland's key metrics are holding steady. 818,993 tests have now been completed, our statewide positivity rate is 4.63%, and ICU bed usage is at its lowest since March 29.", "2020-07-12T13:52:39.000Z": "WATCH: Gov. Larry Hogan (R-Md.) says like many Americans he is \"frustrated that this is the best we could come up with on both sides of the aisle\" for the 2020 election. @GovLarryHogan : \"Most people would like to see something different. Maybe we'll figure that out in 2024.\"", "2020-07-12T14:20:49.000Z": "Maryland has now surpassed 800,000 #COVID19 tests, with a record 21,140 tests reported in the last 24 hours. The statewide positivity rate is 4.45%, and the state is reporting 392 total hospitalizations.", "2020-07-11T18:19:51.000Z": "THIS SUNDAY ON #MTP : Debates over testing, contact tracing, and reopening schools continue as states see a surge in cases. @HHS_ASH Admiral Brett Giroir of the Coronavirus Task Force and @MiamiSup Alberto Carvalho join. Plus, an exclusive one-on-one with @GovLarryHogan (R-Md.)", "2020-07-09T14:26:43.000Z": "I am disgusted by the vile remarks about removing the public memorial saluting Baltimore's fallen police officers, which was funded and championed by their family members. My full statement:", "2020-07-08T22:18:24.000Z": "The nation's governors recently held a productive discussion with @VP Pence and @CDCDirector Redfield to discuss safe guidelines for reopening schools. We all want to get our kids back to school, but we're going to do so safely and listen to the experts.", "2020-07-08T17:08:24.000Z": "The nation's governors are calling upon the Trump Administration to renew the Public Health Emergency for #COVID19 , set to expire July 25. This crisis is far from over, and the federal government must ensure that we continue to have all the tools necessary to respond. Quote Tweet NGA @NatlGovsAssoc #WeTheStates are calling on @WhiteHouse to formally renew the Public Health Emergency declaration for #COVID19 , which otherwise would expire July 25. States need every tool available to combat this deadly #pandemic . https:// nga.org/news/press-rel eases/governors-call-on-the-administration-to-renew-the-public-health-emergency/ ", "2020-07-08T15:32:22.000Z": "I am directing the State Board of Elections to follow existing state law and conduct the November general election with enhanced voting options in light of the #COVID19 pandemic. This approach will maximize participation while minimizing confusion & risk: https:// governor.maryland.gov/2020/07/08/gov ernor-hogan-directs-state-board-of-elections-to-conduct-november-general-election-with-enhanced-voting-options/ ", "2020-07-07T14:52:46.000Z": "I want to congratulate @Novavax of Gaithersburg for receiving the largest Operation Warp Speed grant yet to accelerate development of a #COVID19 vaccine. Since day one, I've said that Maryland's biohealth institutions would lead the charge to develop treatments and vaccines. Quote Tweet Reuters @Reuters The U.S. government has awarded Novavax $1.6 billion to cover testing, commercialization and manufacturing of a potential coronavirus vaccine in the United States https:// reut.rs/3e8MBzC", "2020-07-07T13:48:02.000Z": "Today, I am excited to announce the release of our upcoming book, Still Standing: Surviving Cancer, Riots, a Global Pandemic, and the Toxic Politics that Divide America.", "2020-07-06T14:31:02.000Z": "I want to congratulate Baltimore County on becoming the 11th jurisdiction to meet the statewide goal of testing 10% of their population. Testing is now available to Marylanders at more than 220 sites across the state: https:// coronavirus.maryland.gov/pages/symptoms -testing  .", "2020-07-06T14:31:01.000Z": "Maryland's key #COVID19 metrics continue to trend in a positive direction as the statewide positivity rate reaches a new low of 4.51%. Total current hospitalizations have fallen to 403, and the state is reporting three new confirmed deaths, the lowest number since March 31.", "2020-07-05T17:02:27.000Z": "Today I issued the following statement on events in Baltimore City. City leaders need to regain control of their own streets and immediately start making them safer.", "2020-07-05T15:00:15.000Z": "While we welcome peaceful protests and constructive dialogue on whether and how to put certain monuments in context or move them to museums through a legal process, lawlessness, vandalism, and destruction of public property is completely unacceptable. Christopher Columbus statue toppled in Baltimore, thrown into harbor Protesters tore down a statue of Christopher Columbus and threw it the Inner Harbor Saturday in Baltimore. wbaltv.com", "2020-07-03T20:26:21.000Z": "This week, BPW approved painful, but necessary budget cuts to save thousands of state jobs. However, $205M in items have been deferred-the equivalent of 3,157 more jobs. Funding everything and cutting nothing is not an option, and I'm going to fight to keep people in their jobs.", "2020-07-01T18:18:30.000Z": "Today, in a bipartisan vote, the Board of Public Works approved painful, but necessary budget cuts to save the jobs of thousands of state workers. When faced with the decision to cut spending or to cut people, I am going to fight to keep people in their jobs.", "2020-07-01T13:45:55.000Z": "During this morning's Board of Public Works meeting, I will provide an update on Maryland's #COVID19 response. Watch live at 10 AM: https:// governor.maryland.gov/board-of-publi c-works-meetings/ ", "2020-07-01T12:35:56.000Z": "Today, the #USMCA goes into effect, providing a significant boost to vital trade relationships that will benefit consumers, workers, farmers, and manufacturers in every state. Was pleased to push for this critical agreement on behalf of my fellow governors.", "2020-06-30T13:45:04.000Z": "I have extended the emergency order prohibiting utility providers from shutting off or charging late fees for residential services, including electricity, water, phone, and internet, through August 1. \n\nRead the order: https:// governor.maryland.gov/wp-content/upl oads/2020/06/Utility-Shutoffs-and-Late-Fees-3d-Amended-6.29.20.pdf ", "2020-06-29T19:06:21.000Z": "On today's White House call with the nation's governors, I continued to stress the urgent need for federal action to help states address budgetary shortfalls caused by #COVID19 . Congress should not take any kind of August recess without providing this urgent fiscal relief.", "2020-06-29T17:21:15.000Z": ". @WMAR2News | Gov. Hogan, State Superintendent announce $210 million in additional funding to help Maryland schools Gov. Hogan, State Superintendent announce $210 million in additional funding to help Maryland... Governor Larry Hogan and State Superintendent Karen Salmon announced $210 million in additional funding to help Maryland schools and students most affected by the COVID-19 pandemic. wmar2news.com", "2020-06-28T14:29:58.000Z": "We continue to see positive trends in Maryland's key #COVID19 health metrics, including our total current hospitalizations, which have now fallen below 450. Baltimore City has become the seventh jurisdiction to meet the goal of testing 10% of the population in every jurisdiction.", "2020-06-27T12:00:00.000Z": "As we continue to see positive trends in key health metrics, we recognize the critical role our health care heroes have played in our state's recovery, as well as our ongoing obligation to remain vigilant and exercise personal responsibility. #MarylandStrong", "2020-06-26T15:48:00.000Z": "While our eviction moratorium has helped families remain in safe and stable housing throughout the pandemic, we are committing $30 million in new funding to prevent evictions and help Marylanders affected by COVID-19. \n\nLearn more: https:// governor.maryland.gov/2020/06/26/gov ernor-hogan-announces-30-million-in-funding-for-eviction-prevention-assistance/ ", "2020-06-25T22:44:05.000Z": "Our health and economic recovery depends on all of us continuing to exercise personal responsibility in order to keep ourselves, our family members, and our neighbors safe. #MasksOnMaryland GIF", "2020-06-25T20:08:36.000Z": "Today, First Lady Yumi Hogan attended the 70th Korean War Commemorative Ceremony in Washington, D.C. More than 15,000 Marylanders served during the Korean War, including 531 who made the ultimate sacrifice. We owe each and every one of them an incredible debt of gratitude.", "2020-06-25T14:31:47.000Z": "While we still have miles to go on our road to recovery, I have no doubt that the people of our great state will continue setting an example for the rest of the nation. \n\nRead my full #COVID19 update: https:// governor.maryland.gov/2020/06/25/upd ate-from-governor-hogan-on-covid-19-we-must-all-continue-to-remain-vigilant/ ", "2020-06-24T20:15:20.000Z": "Was pleased to lead another productive infrastructure summit today as chair of the @NatlGovsAssoc . While COVID-19 has certainly dominated our focus in recent months, we haven't lost sight of the importance of modern infrastructure to support jobs & quality of life as we recover.", "2020-06-24T17:32:30.000Z": ". @WMAR2News | Gov. Hogan announces over $45 million in education funding to help students affected by COVID-19 pandemic Gov. Hogan announces over $45 million in education funding to help students affected by COVID-19... Governor Larry Hogan announced the commitment of more than $45.6 million in additional education funding for K-12 technology improvements, community college workforce development programs, rural... wmar2news.com", "2020-06-24T16:07:48.000Z": "While many states have already seen significant cuts and layoffs, in Maryland, we are committed to doing everything possible to level-fund education. We will continue to maximize federal resources to provide critical funding for the students & communities that need help the most.", "2020-06-24T16:07:47.000Z": "We are committing $45.6 million in additional education funding for K-12 technology improvements, community college workforce development programs, rural broadband initiatives, and other priorities in every jurisdiction in Maryland: https:// governor.maryland.gov/2020/06/24/gov ernor-hogan-announces-over-45-million-in-education-funding-to-help-students-affected-by-covid-19-pandemic/ ", "2020-06-23T16:49:41.000Z": "The Baltimore Convention Center will host free COVID-19 testing on Wednesday (6/24) and Friday (6/26) from 8am-2pm. Appointments are strongly encouraged but walk-in testing will be offered as availability permits. Learn more here: https:// coronavirus.maryland.gov", "2020-06-24T14:26:35.000Z": "Today, Allegany County became the sixth jurisdiction to reach our goal of testing 10% of its population. We have now tested more than 8% of our population statewide for #COVID19 as counties continue to expand access for Marylanders.", "2020-06-23T20:58:20.000Z": ". @wjz | Maryland has now distributed more than 50 million units of personal protective equipment to hospitals, state agencies, local health departments and front line workers, Governor Larry Hogan announced Tuesday. Maryland Has Distributed More Than 50M Units Of PPE, Gov. Hogan Says Maryland has now distributed more than 50 million units of personal protective equipment to hospitals, state agencies, local health departments and front line workers, Governor Larry Hogan announced... baltimore.cbslocal.com", "2020-06-23T19:22:33.000Z": "Marylanders who have recovered from #COVID19 can join the fight against this deadly virus by donating plasma.\n\nLearn more from @US_FDA : https:// fda.gov/emergency-prep aredness-and-response/coronavirus-disease-2019-covid-19/donate-covid-19-plasma  Join the CovidCONNECT platform to access resources for recovered Marylanders: https:// health.maryland.gov/covidconnect/P ages/Home.aspx  Donate COVID-19 Plasma If you have fully recovered from COVID-19, you may be able to help patients currently fighting the infection by donating your plasma. fda.gov", "2020-06-22T18:25:42.000Z": ". @FOXBaltimore | Gov. Hogan says over 200 companies contributed to COVID-19 Relief Efforts in MD Over 200 companies contribute to COVID-19 Relief Efforts ANNAPOLIS, Md. (WBFF) -- On Monday, Governor Larry Hogan announced that more than 200 Maryland companies and nonprofit organizations across the state have supported their communities' response to the... foxbaltimore.com", "2020-06-22T12:48:27.000Z": "Happy Birthday, Monica! The following media includes potentially sensitive content. Change settings View", "null": "", "2020-06-21T14:41:39.000Z": "My dad was my hero and will always be the man that I am most proud of. For Larry Hogan, Sr., no challenge was too big and nothing ever seemed impossible. He stood up and fought for what was right, even when the odds were stacked against him. Congressman Larry Hogan Sr. - Watergate Testimony youtube.com", "2020-06-21T14:00:00.000Z": "Maryland has now conducted 565,298 #COVID19 tests. The statewide positivity rate has dropped to 5.03%, down more than 81% from its April 17 peak. Current total hospitalizations have fallen to 608.", "2020-06-21T12:26:26.000Z": "Missing my dad on this #FathersDay . Larry Hogan, Sr. always stood up for what was right, regardless of political affiliation or his own personal interests. He was my hero, and will always be the man that I am most proud of.", "2020-06-20T14:15:52.000Z": "Maryland has now conducted 555,874 #COVID19 tests, including 11,802 in the past 24 hours. The statewide positivity rate has dropped to 5.19%, down more than 80% from its April 17 peak, and current total hospitalizations have fallen to 644.", "2020-06-19T14:00:13.000Z": "Maryland has now conducted 544,072 #COVID19 tests. The statewide positivity rate has dropped to 5.41% and total hospitalizations have fallen to 648. Free testing is taking place today at the Baltimore Convention Center and @SixFlagsDC , as well as nearly 170 other sites statewide.", "2020-06-19T00:41:45.000Z": "Deeply saddened by the passing of Spc. Josean J. Osoria, whose admirable service to the State of Maryland included support of the @MDNG 's COVID-19 response, for which he was awarded the Maryland Commendation Medal. Our prayers are with his family, friends, and all who loved him. Quote Tweet MD National Guard @MDNG Today, we mourn the passing of Spc. Josean J. Osoria, @MDNG , 1-175th Inf. Regt.\n\nHe served as a combat medic & human resources specialist. He was awarded the Maryland Commendation Medal for his support during the COVID-19 pandemic.\n\nRest easy, brother. https:// wbaltv.com/article/maryla nd-national-guard-soldier-josean-j-osoria-dies-in-an-off-duty-accident/32898636?fbclid=IwAR3So5RQxlkzTW6OYiXrqduyD4wpaVe7DSs62zKO3cEN4ag_stNbTLQIJv8 ", "2020-06-18T21:46:40.000Z": "Congratulations, Larry! Quote Tweet Governor Larry Hogan @GovLarryHogan Five years ago today, I was diagnosed with a very advanced, very aggressive cancer that had rapidly spread throughout my body. Today, I had my final, five-year anniversary PET scan at UMMS, which confirmed that I am still 100 percent cancer free! Show this thread", "2020-06-18T19:49:32.000Z": "This critical milestone in my cancer journey is an opportunity to reflect on how incredibly blessed I've been-by the unwavering love of my family, the dedication of the doctors and nurses who treated me, and the support shown to me by the people of Maryland.", "2020-06-18T19:49:31.000Z": "Five years ago today, I was diagnosed with a very advanced, very aggressive cancer that had rapidly spread throughout my body. Today, I had my final, five-year anniversary PET scan at UMMS, which confirmed that I am still 100 percent cancer free!", "2020-06-17T21:07:24.000Z": "Thanks to the incredible sacrifices of Marylanders, our state is making huge strides on the road to recovery. @MDBiz is providing detailed resources to support our business community's efforts to reopen safely. Learn more at http:// open.maryland.gov/backtobusiness . Quote Tweet Maryland Commerce @MDBiz . @GovLarryHogan is dedicated to keeping Marylanders healthy and getting the state's economy back on track. Businesses can find tips for reopening safely at https:// open.maryland.gov/backtobusiness/", "2020-06-17T14:55:38.000Z": ". @MDHealthDept is offering FREE #COVID19 testing at the Baltimore Convention Center today, 6/17, and Friday, 6/19, from 8am - 2pm Walk-in testing will be offered as availability permits. Appointments are encouraged.\n\nTo schedule a test at this site, visit: https:// coronavirus.maryland.gov/pages/symptoms -testing ", "2020-06-17T12:47:30.000Z": ". @wjz | New Free COVID-19 Testing Site Opening At Baltimore Convention Center New Free COVID-19 Testing Site Opening At Baltimore Convention Center Gov. Larry Hogan announced Tuesday that the Maryland Department of Health will begin operating a free COVID-19 testing site at the Baltimore Convention Center starting Wednesday, June 17. baltimore.cbslocal.com", "2020-06-16T18:30:12.000Z": "As chairman of the @NatlGovsAssoc , I've led a yearlong initiative focused on rebuilding America's crumbling infrastructure. Now more than ever, we need this action at the federal level in order to create jobs and support our nation's economic recovery. It's finally time to spend money on infrastructure In 2016, investors thought there would be a major focus on rebuilding the nation's infrastructure from the next president. Four years later, we're still waiting. edition.cnn.com", "2020-06-16T13:35:42.000Z": "Governor Larry Hogan announced today that the Maryland Department of Health (MDH) will begin operating a free COVID-19 testing site at the Baltimore Convention Center beginning Wednesday, June 17.", "2020-06-16T13:47:42.000Z": ". @FOXBaltimore | Free COVID-19 Testing Begins At Baltimore Convention Center Tomorrow Free COVID-19 Testing Starts At Baltimore Convention Center Tomorrow ANNAPOLIS, Md. (WBFF) -- On Tuesday, Governor Larry Hogan announced that the Maryland Department of Health will begin free COVID-19 testing at the Baltimore Convention Center beginning Wednesday,... foxbaltimore.com", "2020-06-16T13:24:00.000Z": ". @MDHealthDept will begin operating a free #COVID19 testing site at the Baltimore Convention Center beginning Wed., June 17, from 8 a.m. to 2 p.m. Appointments are encouraged-to schedule a test at this site or to find a test site near you, visit https:// coronavirus.maryland.gov/pages/symptoms -testing  .", "2020-06-15T22:38:01.000Z": "Last fall, I had the privilege of spending time with Ravens superfan Mo Gaba, the first person ever to announce an NFL draft pick in Braille. I join the @Ravens in asking Marylanders to send prayers and encouragement his way. Quote Tweet Baltimore Ravens @Ravens Asking everyone to pray for our No. 1 fan and beautiful person, Mo Gaba in his fight with cancer.", "2020-06-15T14:27:27.000Z": "As Marylanders are beginning to interact with larger numbers of people, testing will become even more critical than ever. We continue to encourage Marylanders to get tested for COVID-19, with more than 150 testing sites now open across the state.", "2020-06-15T14:27:26.000Z": "THREAD: Today marks one month since we began Stage One of our safe, gradual, and effective roadmap to recovery, and all of our key health metrics continue to trend in a positive direction.", "2020-06-14T14:50:00.000Z": "Today and every day, we salute the Star-Spangled Banner and the many freedoms it represents. #FlagDay", "2020-06-14T14:00:53.000Z": "Maryland has now completed 492,305 #COVID19 tests, and the statewide positivity rate has dropped to 6.72%. Total current hospitalizations have fallen by more than 200 over the last four days, and are now at their lowest level in 10 weeks.", "2020-06-14T12:29:44.000Z": ". @WJZ | New COVID-19 Testing Site To Open In Prince George's County New COVID-19 Testing Site To Open In Prince George's County Starting Monday, there will a new place to get tested for COVID-19 in Prince George's County. baltimore.cbslocal.com", "2020-06-13T14:00:01.000Z": "Maryland has now completed 483,826 #COVID19 tests, including 10,555 in the past 24 hours. The statewide positivity rate has dropped to 6.77%. Total current hospitalizations have fallen below 800 for the first time since April 6.", "2020-06-12T14:00:22.000Z": "Maryland has now completed 473,271 #COVID19 tests, including 9,748 in the past 24 hours. The statewide positivity rate has dropped to 6.94%. Total current hospitalizations have fallen by more than 100 over the last two days, and are now at their lowest level in 66 days.", "2020-06-11T11:52:01.000Z": "Republican Larry Hogan, America's most popular governor, has some advice for Trump https:// rol.st/2BRnIuR", "2020-06-12T12:10:52.000Z": ". @wjz | CVS Announces 33 Additional Drive-Thru Coronavirus Testing Locations - CBS Baltimore CVS Announces 33 Additional Drive-Thru Coronavirus Testing Locations Starting on Friday, you'll be able to get tested for COVID-19 at more CVS locations across Maryland. baltimore.cbslocal.com", "2020-06-11T18:35:05.000Z": "Maryland @GovLarryHogan says defunding police departments is a \"terrible idea\" #TIME100Talks Maryland Gov. Larry Hogan Says Defunding Police Departments Is a 'Terrible Idea' Maryland Gov. Larry Hogan told journalist Katie Couric that he believes calls to defund the police are \"a terrible idea.\" time.com", "2020-06-11T20:36:26.000Z": "Today, I issued an emergency order allowing local liquor boards to waive fees for liquor licenses. This will especially help local restaurants in Baltimore City expand outdoor dining, which we are strongly encouraging.\n\nRead the order: https:// governor.maryland.gov/wp-content/upl oads/2020/06/Liquor-License-Fees-6.11.20.pdf ", "2020-06-11T15:11:54.000Z": "Since we announced the creation of CovidCONNECT, an online forum for recovered #COVID19 patients, over 1,600 participants have registered. This platform allows users to share their stories and access resources, including information about clinical trials & virtual support groups. Quote Tweet Governor Larry Hogan @GovLarryHogan Today we also launched COVIDConnect, a new registry for Marylanders who have recovered from #COVID19 . Each of these brave individuals has a key role to play in our efforts to save lives and slow the spread of this virus, and can register at http:// health.maryland.gov/COVIDconnect . Show this thread", "2020-06-11T12:47:15.000Z": "Tune in today at 1 p.m. for my conversation with @KatieCouric and @TIME for #TIME100Talks . Register here: http:// time.com/time100talks", "2020-06-11T00:02:42.000Z": "Governor Hogan Announces Next Stage Two Reopenings, Including Indoor Dining and Outdoor Amusements Governor Hogan Announces Next Stage Two Reopenings, Including Indoor Dining and Outdoor Amusements With key statewide health metrics continuing to trend in a positive direction, Governor Larry Hogan today announced additional safe and phased reopenings through Stage Two of the 'Maryland Strong:... larryhogan.com", "2020-06-10T22:59:22.000Z": "The fight against this virus is far from over, and we must all continue to remain vigilant. Our health and economic recovery depend on all of us continuing to exercise personal responsibility in order to keep ourselves, our family members, our neighbors, and our coworkers safe.", "2020-06-10T22:59:21.000Z": "Effective this Friday, June 12 at 5:00 p.m., indoor dining will be able to resume at restaurants across the state at 50% capacity with distancing and strict public health requirements.", "2020-06-10T22:59:20.000Z": "Because of the early and aggressive actions taken, we have not only flattened the curve-we have actually crushed the curve in Maryland. After continued improvement in key metrics, we are in position to continue with additional Stage Two reopenings: https:// governor.maryland.gov/2020/06/10/gov ernor-hogan-announces-next-stage-two-reopenings-including-indoor-dining-and-outdoor-amusements/ ", "2020-06-10T21:19:01.000Z": "Governor Hogan announces that effective Friday at 5:00 p.m. indoor dining can resume at 50% capacity with distancing. Malls, casinos to open June 19. The following media includes potentially sensitive content. Change settings View", "2020-06-10T21:20:10.000Z": "Gov Hogan: While we are continuing to battle this deadly virus, we are also fighting to protect and improve the health of suffering Marylanders and small businesses...that's why we're continuing to push to safely reopen more and more of our economy.", "2020-06-10T21:23:06.000Z": "Hogan:\"Because of the early and aggressive actions taken, we have not only flattened the curve, we have actually crushed the curve in MD. Every one of the important metrics in our state has continued to drop across the board in every single jurisdiction.\" https:// foxbaltimore.com/watch", "2020-06-10T21:23:46.000Z": "Starting June 19 at 5 p.m.:\n\n Indoor fitness, gyms, martial arts, dance, and other studio-type activities, limited to 50% capacity\n Casinos, arcades, malls can reopen with public health protective measures\n\nDetails Maryland to allow indoor dining, gyms, casinos and more as Hogan lifts more coronavirus restrictions Gov. Larry Hogan on Wednesday pushed Maryland further into reopening, laying out a timeline for indoor dining, outdoor amusements, indoor gyms, casinos, malls and daycare centers to resume with... baltimoresun.com", "2020-06-10T21:04:37.000Z": "Watch today's announcement live: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: Roadmap to Recovery Update - June 10, 2020\n\nLive captioning is available on YouTube. https:// pscp.tv/w/ca_wOjFheWpW Z3hwdmJlRXB8MU95S0FnUFBXZERKYrbA6QgU6Bpz4mhFt0XofNhi4wJ88lodPPz9FRzwkI9r ", "2020-06-10T21:03:24.000Z": "Joining @GovLarryHogan this afternoon for an update on Maryland's Roadmap to Recovery. Watch here: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: Roadmap to Recovery Update - June 10, 2020\n\nLive captioning is available on YouTube. https:// pscp.tv/w/ca_wOjFheWpW Z3hwdmJlRXB8MU95S0FnUFBXZERKYrbA6QgU6Bpz4mhFt0XofNhi4wJ88lodPPz9FRzwkI9r ", "2020-06-10T19:30:00.000Z": "Today at 5:00 PM, I will hold a press conference to provide an update on the reopening of our economy and Stage Two of the #MarylandStrong Roadmap to Recovery.\n\nWatch live here on Twitter, Facebook, or YouTube (live captioning available): https:// bit.ly/3bvczfj", "2020-06-10T15:50:39.000Z": ". @wbaltv11 | Gov. Hogan to update Stage Two of coronavirus recovery plan Indoor dining can resume Friday; gyms, malls, casinos open next week Maryland Gov. Larry Hogan said the state can proceed with more Stage Two reopening plans, which includes opening restaurants for indoor dining and opening gyms, casinos and malls next week. wbaltv.com", "2020-06-09T14:00:41.000Z": "Maryland has now completed 443,478 #COVID19 tests, and the statewide positivity rate has fallen to 7.15%, down more than 73% from its peak on April 17. Total current hospitalizations have fallen to 970.", "2020-06-07T14:41:27.000Z": "Maryland Gov. Larry Hogan has shown politicians and community and business leaders how to effectively deal with and communicate during a crisis.\n\nThere's no flash or polish. He just puts his head down and works. How does a governor get sweeping approval from the opposing party CNN political commentator Douglas Heye writes about Gov. Larry Hogan's success among Democratic-leaning voters for his response to the Covid-19 pandemic and the recent protests sparked by the killing... cnn.com", "2020-06-07T17:00:49.000Z": "I was proud to proclaim June 7, 2020 a special day of tribute to the brave members of the fire, rescue, and EMS community who have lost their lives in the line of duty. The Maryland Fire-Rescue Services Memorial Foundation held a beautiful ceremony today in their honor.", "2020-06-07T15:29:21.000Z": ". @BaltimoreSun | Maryland coronavirus hospitalizations decline to lowest level in eight weeks, health officials say Maryland coronavirus hospitalizations decline to lowest level in eight weeks, health officials say As Maryland enters the second phase of reopening the economy, state officials reported Sunday that the number of COVID-19 hospitalizations here dropped to its lowest number in eight weeks. baltimoresun.com", "2020-06-07T14:00:40.000Z": "Maryland has now completed 427,155 #COVID19 tests, including 9,251 in the last 24 hours, and the statewide positivity rate has fallen to 7.63%, down over 71% from its peak on April 17. Total current hospitalizations have fallen to 1,003, the lowest level in more than eight weeks.", "2020-06-06T11:15:00.000Z": "On June 6, 1944, thousands of American and Allied troops stormed the beaches of Normandy to begin the liberation of Europe. On the 76th anniversary of D-Day, we honor the valor of the Greatest Generation and the sacrifices made by countless heroes for the freedoms we hold dear.", "2020-06-06T14:30:18.000Z": "The State of Maryland has now completed 417,904 #COVID19 tests, including 12,490 in the past 24 hours. Our positivity rate has dropped to 8%, more than a 70% drop from its April 17 peak, and current total hospitalizations have fallen to 1,059.", "2020-06-05T20:49:54.000Z": "Today at 5 p.m., most jurisdictions in Maryland are moving forward with Stage Two of our #MarylandStrong Roadmap to Recovery, which includes a safe and gradual reopening of workplaces, businesses, and additional personal services. Learn more at http:// governor.maryland.gov/recovery .", "2020-06-05T16:06:10.000Z": ". @47abc | Md. surpasses 400,000 COVID-19 tests, positivity rate drops to 8.4% Md. surpasses 400,000 COVID-19 tests, positivity rate drops to 8.4% - 47abc ANNAPOLIS, Md. - Governor Larry Hogan announced on Friday that the state has surpassed the milestone of 400,000 COVID-19 tests. In addition, the state's positivity rate has dropped to 8.4%, and total... wmdt.com", "2020-06-05T14:00:54.000Z": "We are and will continue to be much better positioned than most states when it comes to testing, and our strategic stockpile of tests and our successful long-term strategy will ensure that we have a strong and fully functioning supply of tests until there is a vaccine.", "2020-06-05T14:00:53.000Z": "Maryland has surpassed the milestone of 400,000 #COVID19 tests, and as we prepare to enter Stage Two of reopening, our positivity rate has dropped to 8.4%. Total current hospitalizations have fallen to their lowest level since April 13.", "2020-06-05T01:23:13.000Z": ". @frednewspost | Hospitalizations, positivity rate continue to fall Hospitalizations, positivity rate continue to fall Hospitalizations and the positivity rate for COVID-19 continued their steady decline Thursday across Maryland. fredericknewspost.com", "2020-06-04T18:28:03.000Z": "MEMA ALERT: Severe Thunderstorm Watch for Allegany, Anne Arundel, Baltimore, Carroll, Frederick, Harford, Howard, Montgomery, Prince Georges, Washington and Baltimore City in MD until 10:00pm. #mdwx", "2020-06-04T18:25:49.000Z": "Tomorrow from 10 a.m. to 2 p.m., Marylanders will have access to #COVID19 testing at @SixFlagsDC at no out-of-pocket cost.\n\nNo appointment or doctor's order will be required.", "2020-06-04T18:00:00.000Z": ". @wbalradio | Gov. Hogan: Maryland Ready For Second Phase Of Reopening Gov. Hogan: Maryland Ready For Second Phase Of Reopening Non-essential businesses, including nail salons and tanning salons, will be able to reopen. Customer-facing state agencies will be able to take appointments. wbal.com", "2020-06-04T16:32:24.000Z": ". @FOXBaltimore | COVID-19 IN MD: Positivity rate 8.91%, 27 more deaths, hospitalizations are down COVID-19 IN MD: Positivity rate 8.91%, 27 more deaths, hospitalizations are down BALTIMORE, Md. (WBFF) - The Maryland Department of Health is now reporting 55,858 confirmed cases of COVID-19 in Maryland. The state has conducted a total of 392,240 tests. The statewide positivity... foxbaltimore.com", "2020-06-04T13:19:16.000Z": "There is a possibility of late-day showers & thunderstorms, some of which could be severe. #MdWx Stay #WeatherAware , especially through the afternoon & into the evening. \n\n- Charge devices ahead of time.\n\n- Follow your regional @NWS account for latest forecasts.", "2020-06-04T15:30:00.000Z": ". @BaltBizOnline | Gov. Hogan moves Maryland into Stage 2 of reopening Gov. Hogan moves Maryland into Stage 2 of reopening The governor also advised anyone who participated in protests or was in close proximity to others to get one of the free Covid-19 tests offered by the state. bizjournals.com", "2020-06-04T14:02:10.000Z": "Maryland has now completed 392,240 #COVID19 tests, including 11,524 in the last 24 hours. The statewide positivity rate has dropped to 8.91%-a drop of more than two-thirds since its April 17 peak. Total current hospitalizations have declined to 1,096, the lowest since April 14.", "2020-06-04T14:05:05.000Z": "Starting tomorrow, @GovLarryHogan will lift the order requiring the closure of non-essential businesses. \n\nRead more: http:// ow.ly/nK9z50zYfNm Find closures and regulations: http:// ow.ly/Rqev50zYfMP", "2020-06-04T13:00:00.000Z": ". @ABC7News | Governor Hogan: Phase Two of Maryland's re-opening begins Friday Governor Hogan: Phase Two of Maryland's re-opening begins Friday Phase Two of Maryland's re-opening will begin Friday at 5 p. m. , Governor Larry Hogan announced Wednesday. Effective at that time on that day, Maryland will lift the order requiring the closure of... wjla.com", "2020-06-03T20:06:20.000Z": "Watch today's announcement live: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: Roadmap to Recovery Update - June 3, 2020 https:// pscp.tv/w/caaofTFheWpW Z3hwdmJlRXB8MUx5R0JOWE9hb1BHTj_TlY3cfV3XsNDgVpkzYeyOhmii6EIzwcP7E_VsQDqS?t=1s ", "2020-06-03T15:32:26.000Z": ". @wjz | Coronavirus In Maryland: Hospitalizations At Lowest Rate In 50 Days As Total Cases Near 55K Coronavirus In Maryland: Hospitalizations At Lowest Rate In 50 Days As Total Cases Near 55K The number of confirmed coronavirus cases in Maryland is just under 55,000, and the number of people currently hospitalized continues to decline, state numbers released Wednesday morning show. baltimore.cbslocal.com", "2020-06-03T14:05:00.000Z": "Maryland's #COVID19 positivity rate has dropped to 9.5%-below 10% for the first time since late March-and total current hospitalizations have fallen to their lowest level since April 14. Maryland has now conducted 380,716 COVID-19 tests, including 14,385 over the last 24 hours.", "2020-06-02T23:19:30.000Z": ". @nbcnews | Five years after Freddie Gray unrest, Baltimore sets an example for peaceful protests Five years after Freddie Gray unrest, Baltimore sets an example for peaceful protests \"I'm proud that Baltimore is showing the nation how we can begin to build a more perfect union,\" Gov. Larry Hogan wrote. nbcnews.com", "2020-06-02T16:10:29.000Z": "I couldn't be more proud of the efforts of allied law enforcement agencies and community organizers to ensure safe, peaceful demonstrations in Baltimore City. \n\nListen to my full interview with the @C4Show : Governor Larry Hogan Joins the C4 Show youtube.com", "2020-06-02T14:01:14.000Z": "Maryland has now conducted 366,331 #COVID19 tests, and our COVID-19 positivity rate has dropped to 10.5%-down nearly 61% from its peak on April 17. Current total hospitalizations have dropped to their lowest level in seven weeks.", "2020-06-02T13:50:29.000Z": "This morning at 10:06,  I'll be joining the @C4Show on @wbalradio . Listen live: WBAL 1090/FM 101.5 WBAL 1090/FM 101.5 player.listenlive.co", "2020-06-02T13:12:58.000Z": "Yesterday, Baltimore set an example for our nation. Thousands of young people and community leaders expressed their frustrations peacefully, while working with police to stand up to a handful of extremists with a violent agenda. This is how real, positive change happens.", "2020-06-02T00:37:14.000Z": "\"Teachers, law enforcement officers and emergency medical service workers are not asking for handouts. They're on the front lines of this crisis doing the essential work that's keeping our nation afloat,\" writes @LarryHogan . Opinion | The Virus Could Cost States Like Mine Billions of Dollars We need support while the economy gets back on its feet. nytimes.com", "2020-06-01T18:27:10.000Z": "It's time for all of us, no matter race, age, gender, creed, to look within ourselves & acknowledge the work that's yet to be done-that must be done-so that our nation may finally live up to the ideals of our founding & ensure liberty & justice for every American, once & for all.", "2020-06-01T18:25:30.000Z": "In so many ways, we are at a turning point in our nation unlike any we have experienced before.", "2020-06-01T18:25:14.000Z": "I stand with every man and woman who has condemned the tragic and indefensible murder of George Floyd and any innocent person lost at the hands of injustice.", "2020-06-01T18:25:03.000Z": "...and making good on the promissory note signed by our founders that all of us are guaranteed the unalienable rights of life, liberty, and the pursuit of happiness.", "2020-06-01T18:24:53.000Z": "However, instead of tearing down those ideals, I believe it is up to all of us, regardless of race, to do the hard work of living up to the best versions of ourselves...", "2020-06-01T18:23:19.000Z": "I was born in Washington, DC-only three years after the Brown and Bolling decisions-so I am no stranger to racism, discrimination, and examples of our nation failing to live up to its founding ideals.", "2020-06-01T18:23:04.000Z": "The same cannot be said for the violent rioters and looters who have used this time for their own opportunism and overshadowed the legitimate, peaceful protests by communities who for far too long have been denied their fundamental rights.", "2020-06-01T18:22:54.000Z": "I have the utmost respect for the honorable men and women who go to work every day to serve and protect our communities as law enforcement officers. Unfortunately, the actions of a few overshadow the positive work done by the many across the country.", "2020-06-01T18:22:40.000Z": "Like the rest of America, I watched over the course of this past weekend as thousands of people came together across the country to protest racism and the senseless murder of yet another unarmed black man at the hands of a police officer.", "2020-06-01T21:01:38.000Z": "We will overcome this virus and get our economy back on track. But it's going to take the full might of the American people - mobilizing every part of our economic engine - to do it. Opinion | The Virus Could Cost States Like Mine Billions of Dollars We need support while the economy gets back on its feet. nytimes.com", "2020-06-01T19:00:43.000Z": "Thank you to the Baltimore community and police for working together to keep protests peaceful last night. We must continue working together to make sure that fringe groups trying to incite violence and destruction across our country have no place in Baltimore.", "2020-06-01T18:10:50.000Z": ". @wbaltv11 | Coronavirus testing at Six Flags America expanded to two days a week Coronavirus testing at Six Flags America expanded to two days a week The state is expanding its coronavirus testing site at Six Flags America in Prince George's County to two days a week, the governor's office announced Monday. wbaltv.com", "2020-06-01T17:30:00.000Z": ". @WMAR2News | Maryland COVID-19 positivity rate reaches new low as testing increases Maryland COVID-19 positivity rate reaches new low as testing increases Governor Larry Hogan on Monday reported 228,305 people were tested for COVID-19 in May, a 117% increase from April. wmar2news.com", "2020-06-01T17:19:15.000Z": "With 100 testing sites across the state and growing private sector partnerships, we encourage Marylanders to get tested-even if you don't have symptoms or suspect that you've been exposed-so that we can continue our safe, gradual, and effective recovery efforts.", "2020-06-01T17:19:14.000Z": "As part of our state's long-term testing strategy, and after the record volume of #COVID19 testing completed Friday at @SixFlagsAmerica , the state is expanding the site's availability to conduct no-cost, no-appointment testing from 10 a.m. to 2 p.m. on Wednesdays and Fridays.", "2020-06-01T15:42:28.000Z": ". @WJZ | Maryland COVID-19 Positivity Rate Dropped By 60% From Peak As More Than 357K Tests Taken Across State Maryland COVID-19 Positivity Rate Dropped By 60% From Peak As More Than 357K Tests Taken Across... Maryland's COVID-19 positivity rate has dropped 60% from its peak and the state increased testing by 117% in May, according to statistics released by the governor's office. baltimore.cbslocal.com", "2020-06-01T14:14:45.000Z": "The State of Maryland has now conducted 357,545 #COVID19 tests statewide and saw a 117% increase in testing in the month of May. Our statewide positivity rate has dropped to 10.8%.", "2020-05-31T15:06:25.000Z": "When violence broke out in Baltimore City in 2015, our primary focus was to lower the temperature, to protect the residents of Baltimore, and to put a stop to the violence while enabling people to protest peacefully. Watch my full interview with @CNNSOTU :", "2020-05-31T14:13:56.000Z": "Maryland coronavirus hospitalizations are at their lowest level since April 15, the state says, as over 700 new cases added since Saturday. Maryland Coronavirus Hospitalizations Have Dropped To Lowest Level Since April 15, State Says Hospitalizations of coronavirus patients in Maryland continue to decline, and the state reports the statewide positivity rate is now 10.9 percent as of Sunday morning. baltimore.cbslocal.com", "2020-05-31T14:25:49.000Z": "Maryland's COVID-19 positivity rate has dropped to 10.9%, and current total hospitalizations have fallen to their lowest level since April 15. COVID-19| Hospitalizations at lowest level since April 15 As of Sunday morning, Maryland has 52,778 confirmed cases of the coronavirus. Governor Larry Hogan announced that Maryland's COVID-19 positivity rate has dropped to 10. 9%, and current total hospit... foxbaltimore.com", "2020-05-31T14:00:53.000Z": "Maryland's #COVID19 positivity rate has dropped to 10.9%, down 54.49% from its peak on April 17. Our state's current total COVID-19 hospitalizations-one of the state's key recovery metrics-have dropped to 1,183, their lowest level since April 15.", "2020-05-30T15:19:45.000Z": "EXCLUSIVE: @GovLarryHogan joins @jaketapper on #CNNSOTU .", "2020-05-30T14:08:01.000Z": "At 11.6%, Maryland's #COVID19 positivity rate has dropped to its lowest level since March 29. \n\nAt 1239, Maryland's #COVID19 hospitalizations have dropped to their lowest level since April 17. Quote Tweet Kata D. Hall @katadhall UPDATE: The @MDHealthDept is now reporting 52,015 confirmed cases of #COVIDー19 in Maryland. The state has conducted a total of 339,361 tests.\n\nThe statewide positivity rate is now 11.6%.\n\nNumber of persons tested negative: 241,931\nNumber of confirmed deaths: 2,390 Show this thread", "2020-05-29T20:35:41.000Z": "This evening, many of Maryland's jurisdictions will move forward with additional reopenings as part of our #MarylandStrong Roadmap to Recovery. Marylanders should stay tuned to local leaders for detailed guidance in their county. View the interactive map: http:// governor.maryland.gov/recovery", "2020-05-29T12:50:06.000Z": "This morning, a major appointment-free #COVID19 testing site will open at @SixFlagsDC . The site was created in partnership with @MDHealthDept and @MDDGS , which quickly stood up these modular tents to facilitate safe testing for patients and staff.", "2020-05-28T13:00:00.000Z": ". @FOXBaltimore | Governor Hogan Announces New COVID-19 Testing Site at Six Flags America Governor Hogan Announces New COVID-19 Testing Site at Six Flags America ANNAPOLIS, Md. (WBFF) -- Governor Larry Hogan just announced a new free COVID-19 testing site at Six Flags America will open on Friday, May 29. \"There are now more COVID-19 testing options for... foxbaltimore.com", "2020-05-28T11:00:00.000Z": ". @Fox5DC | Governor Larry Hogan says Maryland is ready to complete phase one of recovery at state level Governor Larry Hogan says Maryland is ready to complete phase one of recovery at state level fox5dc.com", "2020-05-28T01:00:00.000Z": ". @BaltBizOnline | Hogan to move forward with Maryland reopening, allow outdoor dining Hogan to move forward with Maryland reopening, allow outdoor dining Restaurants may reopen for outdoor dining while outdoor pools can reopen at 25% capacity. bizjournals.com", "2020-05-28T00:00:00.000Z": ". @WJZ | Maryland Reaches Goal Of 10K COVID-19 Tests Conducted Per Day; Rate Of Positive Results Drops By More Than Half, Hogan Says Maryland Reaches Goal Of 10K COVID-19 Tests Conducted Per Day; Rate Of Positive Results Drops By... As the number of coronavirus cases and tests in Maryland continues to grow, the rate of people testing positive for the virus has dropped by more than half, Gov. Larry Hogan said Wednesday. baltimore.cbslocal.com", "2020-05-27T21:03:38.000Z": "Watch today's announcement live: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: Roadmap to Recovery Update - May 27, 2020\n\nLive captioning is available on YouTube. https:// pscp.tv/w/cZ17dTFheWpW Z3hwdmJlRXB8MVlxeG9RdlJBbE5HdtveXaK2cwuCt0PNHBvGpFg-osh-XOrS3NbNbu1XUWUE ", "2020-05-27T19:03:00.000Z": "I want to thank my NGA vice-chair, @NYGovCuomo , for highlighting the importance of infrastructure. Since last July, when I launched my @NatlGovsAssoc infrastructure initiative, we have worked closely with the White House and Congress, and we continue to push for federal action. Quote Tweet Andrew Cuomo @NYGovCuomo Now is the time for government to stimulate the economy by investing in infrastructure.\n\nWe have projects in NY ready to go but we need to do it together with the fed gov't & with other states.\n\nThis is long overdue. Let's do it now.", "2020-05-27T18:30:00.000Z": "Today at 5:00 PM, I will provide an update regarding our #MarylandStrong : Roadmap to Recovery.\n\nWatch live here on Twitter, Facebook, or YouTube (live captioning available): https:// bit.ly/3bvczfj", "2020-05-27T15:14:39.000Z": "We are deeply disturbed by the senseless shooting of a police officer last night in Federal Hill. Fortunately, the officer is in good condition, and state law enforcement stands ready to assist the investigation.", "2020-05-27T14:18:59.000Z": ". @WJZ | Gov. Larry Hogan Will Address Marylanders At 5:00 PM Wednesday Reopening Maryland: Restaurants, VFWs, Elks Lodge Can Offer Outdoor Dining Starting Friday Gov. Larry Hogan announced Wednesday that starting at 5 p.m. on Friday, May 29, Maryland restaurants and social organizations will be able to safely reopen for outdoor dining, following strict public... baltimore.cbslocal.com", "2020-05-26T17:30:00.000Z": ". @WJZ | Maryland Hospital First In Nation With New ICU Inpatient Wing To Care For COVID-19, Critical Patients, Gov. Hogan Announces Maryland Hospital First In Nation With New ICU Inpatient Wing To Care For COVID-19, Critical... Twelve modules were installed adjacent to the hospital and offer 16 private ICU rooms with isolation and adequate support space. baltimore.cbslocal.com", "2020-05-26T16:23:19.000Z": ". @WBALTV11 | Hogan: Maryland hospital is first in nation to install STAAT Mod TM units Hogan: Maryland hospital is first in nation to install STAAT Mod TM units A Prince George's County hospital is the first in the nation to install STAAT Mod TM units to care for coronavirus and other critically ill patients, the governor announced Tuesday. wbaltv.com", "2020-05-26T15:33:57.000Z": "With the help of @MDDGS , @AdventistHC Fort Washington Medical Center in Prince George's County today became the first hospital in the nation to install STAAT Mod TM modular units to care for #COVID19 and other critically ill patients. \n\nLearn more: https:// governor.maryland.gov/2020/05/26/gov ernor-hogan-and-adventist-healthcare-fort-washington-medical-center-announce-new-icu-inpatient-wing-to-care-for-covid-19-and-critical-patients/ ", "2020-05-25T12:22:23.000Z": "This year, more than ever, we're grateful for the brave men & women who made the ultimate sacrifice in service to our nation. Don't forget to take a few moments to remember the reason we recognize this day &those who have given their lives to protect our country & our way of life The following media includes potentially sensitive content. Change settings View", "2020-05-25T11:33:37.000Z": "If these last few difficult months have reminded us of anything, it is that life is so fragile. On this #MemorialDay , I ask Marylanders to reflect on the American heroes who sacrificed their lives for our freedom.", "2020-05-24T15:17:44.000Z": ". @WTOP | @MDHealthDept has introduced a new tool that allows residents to find their nearest coronavirus testing site. New interactive map shows coronavirus testing sites in Maryland | WTOP The Maryland Health Department has introduced a new tool that allows residents to find their nearest coronavirus testing site. wtop.com", "2020-05-24T13:59:06.000Z": "#COVID hospitalizations and ICU beds in Maryland--the state's key data-driven metrics for recovery--are now at their lowest level in five weeks. Quote Tweet Kata D. Hall @katadhall HOSPITALIZATIONS:\n\nCurrently hospitalized: 1,290\nAcute care: 787\nIntensive care: 503\nEver hospitalized: 7,939 Show this thread", "2020-05-23T16:47:55.000Z": "A new, interactive map of #COVID19 testing sites is now available from the @MDHealthDept . Users can find nearby testing locations and learn more about their hours and appointment policies. More sites will be added in the weeks to come.\n\nLearn more: https:// coronavirus.maryland.gov/pages/symptoms -testing ", "2020-05-22T19:04:06.000Z": ". @WJZ | Maryland Coronavirus Hospitalizations At Lowest Level Since April 19, State Says - CBS Baltimore Maryland Coronavirus Hospitalizations At Lowest Level Since April 19, State Says Maryland health officials report there are a total of 44,424 coronavirus cases confirmed in the state, and 2,092 people have died of the virus with another 115 who probably died from the virus. baltimore.cbslocal.com", "2020-05-22T18:44:41.000Z": "Congratulations to the United States @NavalAcademy Class of 2020! I had the opportunity to address these exceptional men and women for today's virtual graduation. #USNA2020 Watch the ceremony live: https:// watchstadium.com/live/us-naval- academy-graduation/ ", "2020-05-22T18:33:34.000Z": ". @GovLarryHogan Leads @NoLabelsOrg Bicameral Virtual Meeting With Bipartisan @ProbSolveCaucus  https:// anamericaunited.org/news/governor- hogan-leads-no-labels-bicameral-virtual-meeting-with-bipartisan-problem-solvers-caucus/ ", "2020-05-22T17:12:06.000Z": ". @GovLarryHogan joins our honored guests to congratulate the Class of 2020 during our Virtual #UMDgrad Ceremony!", "2020-05-22T13:55:11.000Z": "Pleased to announce the opening of additional #COVID19 test sites at @Walmart stores in MD. As we continue expanding testing availability, we are excited to be forging new partnerships with private sector companies like Walmart, @RiteAid , and @CVSHealth : https:// governor.maryland.gov/2020/05/22/gov ernor-hogan-and-walmart-announce-additional-covid-19-test-sites-in-maryland/ ", "2020-05-22T12:59:24.000Z": "The United States and Maryland flags are lowered today through sundown on May 24 as a mark of solemn respect for the victims of the coronavirus pandemic. The @NavalAcademy flag also flies over the State House this morning to honor the graduates of the USNA Class of 2020.", "2020-05-21T21:30:57.000Z": ". @BaltimoreSun | Maryland coronavirus hospitalizations drop below 1,400 for first time since April 20 Maryland expands contact tracing as coronavirus hospitalizations drop below 1,400 for first time... Maryland's count of patients currently hospitalized because of the coronavirus declined for a fifth straight day Thursday, dropping below 1,400 for the first time in more than a month. baltimoresun.com", "2020-05-21T21:00:00.000Z": ". @FOXBaltimore | CVS Health Announces 17 New Drive-Thru COVID-19 Testing Sites in Maryland CVS Health Announces 17 New Drive-Thru COVID-19 Testing Sites in Maryland ANNAPOLIS, Md. (WBFF) -- Governor Larry Hogan and CVS Health announced 17 new COVID-19 test sites at select CVS Pharmacy drive-thru locations across Maryland. The opening of additional test sites... foxbaltimore.com", "2020-05-21T18:39:31.000Z": ". @WMAR | @GovLarryHogan announces launch of contact tracing operation to support local health departments Gov. Hogan announces launch of contact tracing operation to support local health departments Governor Larry Hogan announced that Maryland's statewide contact tracing operation across all 24 of the state's jurisdictions will be fully operational next week. wmar2news.com", "2020-05-21T17:46:04.000Z": ". @MarylandDoIT and @MDHealthDept partnered to develop COVID Link, a state-of-the-art data management platform, to facilitate the state's contact tracing partnership with local officials. We will have the capacity to track 1,000 cases and 10,000 contacts on a daily basis.", "2020-05-21T17:46:03.000Z": "Maryland is launching a robust contact tracing operation that will be fully operational across all 24 jurisdictions next week. We have more than quintupled our disease investigation capacity, and will now have more than 1400 case investigators statewide: https:// governor.maryland.gov/2020/05/21/gov ernor-hogan-announces-launch-of-robust-contact-tracing-operation-to-support-local-health-departments/ ", "2020-05-21T15:15:00.000Z": ". @WBALRadio | @GovLarryHogan , @CVSHealth Announce 17 New Drive-Thru Coronavirus Test Sites In Maryland Gov. Hogan, CVS Health Announce 17 New Drive-Thru Coronavirus Test Sites In Maryland Gov. Hogan and CVS Health officials announced Thursday 17 new drive-thru coronavirus testing sites at CVS pharmacies throughout Maryland starting Friday. wbal.com", "2020-05-21T13:50:39.000Z": "Two days after authorizing the state's 1,200 pharmacies to order and administer #COVID19 tests, I'm pleased to announce that @CVSHealth will be offering 17 new test sites at select CVS Pharmacy drive-thru locations across Maryland: https:// governor.maryland.gov/2020/05/21/gov ernor-hogan-and-cvs-health-announce-17-new-drive-thru-covid-19-testing-sites-in-maryland/ ", "2020-05-20T19:30:00.000Z": ". @WJZ | Coronavirus Testing Capacity Increases Across Maryland Including Universal Testing At Correctional, Juvenile Facilities Coronavirus Testing Capacity Increases Across Maryland Including Universal Testing At Correctional,... Gov. Larry Hogan announced significant progress to Maryland's coronavirus testing capacity Wednesday. baltimore.cbslocal.com", "2020-05-20T19:15:51.000Z": "While this support will cover costs of the emergency response, states haven't received any relief for unprecedented revenue shortfalls. I continue to urge Congress to act to prevent cuts that would devastate the recovery. It's time to put partisanship aside and get this done.", "2020-05-20T19:15:50.000Z": "I want to thank the President for granting my request on behalf of the nation's governors to allow states to use federal funding to cover the full cost of @FEMA 's response. This a key step for states facing catastrophic fiscal crises from this pandemic. WSJ News Exclusive | Trump Can Choose Which States Get Coronavirus Payback From FEMA After spending an estimated $45 billion fighting the pandemic, states are expected to ask the federal government for reimbursement, with President Trump likely to decide whether their costs will be... wsj.com", "2020-05-20T15:33:08.000Z": "Yesterday, we announced major steps in our state's long-term #COVID19 testing strategy that dramatically expand access for Marylanders statewide.\n\nLearn more: https:// governor.maryland.gov/2020/05/19/gov ernor-hogan-announces-critical-milestone-in-covid-19-testing-strategy-as-state-broadens-criteria-for-testing-dramatically-expands-testing-availability-statewide/ ", "2020-05-20T17:21:05.000Z": "To overcome global supply chain challenges, scientists at the @MDHealthDept Laboratories Administration have begun making up to 10,000 tubes of viral transport media weekly at @MDHLaboratories .", "2020-05-20T17:20:47.000Z": "The state is distributing up to 3,000 tests per day and 20,000+ tests per week to nursing homes. Distribution of tests to the state's 227 nursing home facilities is on track to be completed by the end of next week.", "2020-05-20T17:19:15.000Z": "As part of Maryland's long-term #COVID19 testing strategy, we will begin universal testing at all state-run correctional and juvenile facilities: https:// governor.maryland.gov/2020/05/20/gov ernor-hogan-announces-universal-covid-19-testing-for-marylands-correctional-and-juvenile-facilities/ ", "2020-05-20T16:53:22.000Z": ". @TheHill | Bipartisan Senate group offers new help to state, local governments Bipartisan Senate group offers new help to state, local governments A bipartisan group of senators are introducing a bill on Monday to provide hundreds of billions in new funding to state and local governments that have been hit hard by the spread of the coronavirus. thehill.com", "2020-05-20T13:30:01.000Z": "Appointment-Free Coronavirus Testing To Begin Thursday At Some Locations In Maryland https:// baltimore.cbslocal.com/2020/05/19/cor onavirus-testing-maryland-latest/?taid=5ec530d8fd929f0001f0d263&utm_campaign=trueAnthem%3A+Trending+Content&utm_medium=trueAnthem&utm_source=twitter ", "2020-05-20T01:21:51.000Z": "Maryland to begin new testing sites for symptomatic and asymptomatic screening, no appointment needed. Broad screening, including asymptomatic screening for at risk individuals, is key to controlling spread as @GovLarryHogan implements state's reopen plan Larry Hogan says Maryland can begin testing for COVID-19 without appoi Maryland Gov. Larry Hogan announced that the state will begin offering drive-thru coronavirus testing that will not require appointments or a show of symptoms. m.washingtontimes.com", "2020-05-19T23:34:10.000Z": "Had the incredible opportunity of wishing a happy 83rd birthday to @Orioles legend Brooks Robinson last night! I've been a fan of his ever since I was a kid, and it was a pleasure to join so many great Marylanders for this virtual celebration. Quote Tweet Baltimore Orioles @Orioles A night we'll remember forever. HBD Brooks!", "2020-05-19T23:30:00.000Z": "A night we'll remember forever. HBD Brooks!", "2020-05-19T23:16:14.000Z": ". @Newsweek | Fed Chair Warns Economic Recovery Could Be Hampered Without More State Aid From Congress Fed chair warns economic recovery could be hampered without more state aid from Congress \"What Congress has done to date has been remarkably timely and forceful,\" Jerome Powell told senators. \"I do think we need to take a step back and ask over time: Is it enough?\" newsweek.com", "2020-05-19T22:23:34.000Z": ". @WBOC | Md. Governor Announces Critical Milestone in COVID-19 Testing Strategy Md. Governor Announces Critical Milestone in COVID-19 Testing Strategy Maryland Gov. Larry Hogan announced Tuesday that the state has reached a critical milestone in its long-term COVID-19 testing strategy, surpassing 200,000 tests and completing testing of 3.5 percent wboc.com", "2020-05-19T18:26:15.000Z": ". @FoxBaltimore | Hogan: State to begin testing people with no symptoms; MD Surpasses 200,000 tests Hogan: State to begin testing people with no symptoms; MD Surpasses 200,000 tests ANNAPOLIS, Md. (WBFF) -- Governor Larry Hogan announced that the state has reached a critical milestone in its long-term COVID-19 testing strategy, surpassing 200,000 tests and completing testing of... foxbaltimore.com", "2020-05-19T17:00:25.000Z": "Beginning this week, we are able to offer appointment-free #COVID19 testing across the state, including for those who do not have symptoms, marking a critical milestone in Maryland's long-term testing strategy.\n\nLearn more: https:// governor.maryland.gov/2020/05/19/gov ernor-hogan-announces-critical-milestone-in-covid-19-testing-strategy-as-state-broadens-criteria-for-testing-dramatically-expands-testing-availability-statewide/ ", "2020-05-18T15:57:59.000Z": ". @wbaltv11 | Caregiver Services Corps launched to help Maryland's seniors Caregiver Services Corps launched to help Maryland's seniors Maryland has launched the Caregiver Services Corps to support seniors who affected by the coronavirus pandemic, Gov. Larry Hogan announced Monday. wbaltv.com", "2020-05-18T15:34:59.000Z": "We are launching the Caregiver Services Corps, a program to support Maryland seniors whose caregivers become temporarily unavailable due to #COVID19 exposure, illness, or other challenges.\n\nLearn more: https:// governor.maryland.gov/2020/05/18/gov ernor-hogan-announces-caregiver-services-corps-to-help-marylands-seniors/ ", "2020-05-18T14:36:12.000Z": "The State of Maryland has now conducted over 200,000 #COVID19 tests. Expanding our testing capacity is one of our critical building blocks to recovery, and we continue to increase testing efforts at community-based sites and in response to high-priority outbreaks and clusters.", "2020-05-17T16:00:34.000Z": "No matter the uniform you wear. No matter the part you play in this fight against #COVID19 . We are #InThisTogether", "2020-05-17T14:03:54.000Z": "This morning, a drive-thru #COVID19 testing site is open at the Carroll County Agriculture Center in Westminster-one of dozens of testing sites operating across the state.", "2020-05-16T15:00:24.000Z": "For most counties in Maryland, it's the first full day of Stage One of recovery- and a gorgeous day to practice social distancing. @routeoneapparel", "2020-05-16T22:09:14.000Z": "Today I was pleased to announce that the 145th @PreaknessStakes will be held at @PimlicoRC on October 3. This is wonderful news for the State of Maryland and our historic racing industry.", "2020-05-16T17:45:34.000Z": "As I've said repeatedly, this is not the time for partisan politics or finger pointing. I appreciate the praise, but campaign ads politicizing the coronavirus response are not constructive towards the urgent goal of bringing everyone together to fight our common enemy: the virus. Quote Tweet Amy McGrath @AmyMcGrathKY Just like when I was in combat, we can see our leaders on the front lines, only this time it's in our states. Democratic and Republican governors are all showing us what REAL leadership is - and political party has nothing to do with it.", "2020-05-15T15:58:58.000Z": "Today I joined @IvankaTrump and @SecretarySonny for a tour of @Coastal_Sunbelt in Laurel and the launch of the Farmers to Families Food Box Program, which is providing much-needed assistance to farmers, suppliers, food banks, and families. \n\nMy remarks: https:// cs.pn/2LzNxBa", "2020-05-15T14:44:26.000Z": "Just outside DC, I visited @Coastal_Sunbelt w/ @IvankaTrump & @GovLarryHogan to see @USDA 's innovative food boxes being assembled to be sent to those in need. We're sending fresh produce, meat and dairy direct from farmers to families.", "2020-05-15T21:11:46.000Z": "This is a proud moment for America - it's actually the best of what we do in bringing folks together to help feed people in need while at the same time supporting our producers and suppliers. \nCc: @Coastal_Sunbelt , @IvankaTrump , @GovLarryHogan", "2020-05-15T18:00:00.000Z": ". @FoxNews : Larry Hogan's Big Idea: Let states take the wheel on infrastructure https:// fxn.ws/3dOEOHD  #FoxNews Larry Hogan's Big Idea: Let states take the wheel on infrastructure The Big Idea is a series that asks top lawmakers and officials to discuss their moonshot - what's the one proposal, if politics and polls and even price tag were not an issue, they'd implement to... foxnews.com", "2020-05-14T22:18:17.000Z": "Every decision we make is based on the facts and extensive consultation with the experts. We remain ready to quickly and decisively respond to any changes in the facts on the ground, and we will continue to attack this virus with every tool at our disposal.", "2020-05-14T16:25:34.000Z": "The nation's governors are counting on our leaders in Washington to put partisanship aside and deliver urgent fiscal relief for the states. Read my joint statement with @NYGovCuomo : https:// bit.ly/3btJK2Z", "2020-05-14T11:35:37.000Z": "Maryland continuing to make progress on gradual, phased plan. After 14 days of declining hospitalizations, @GovLarryHogan amended stay-at home-order into a safer-at-home advisory; certain businesses can now reopen with limited capacity, health precautions Larry Hogan eases Maryland coronavirus restrictions Maryland Gov. Larry Hogan said Wednesday the state is ready to begin its phased reopening this Friday. washingtontimes.com", "2020-05-13T21:09:24.000Z": "", "2020-05-13T21:08:44.000Z": "", "2020-05-13T21:03:06.000Z": "Watch today's announcement live: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: Roadmap to Recovery Update - May 13, 2020\n\nLive captioning is available on YouTube. https:// pscp.tv/w/cYsGNzFheWpW Z3hwdmJlRXB8MWxEeExnTFZkandKbQVUUBopYBJWk2W4QBIFKCSBN7sDkNIDf8hI78rENu1t ", "2020-05-13T17:00:00.000Z": "New Drive-Thru COVID-19 Testing Site at Carroll County Agriculture Center New Drive-Thru COVID-19 Testing Site at Carroll County Agriculture Center CARROLL COUNTY, Md. (WBFF) -- On Wednesday, Governor Larry Hogan announced that the state will further expand its drive-thru COVID-19 testing program by opening a new site on Thursday, May 14 at the... foxbaltimore.com", "2020-05-13T16:30:00.000Z": "Governors warn COVID-19 relief is becoming a 'political football' Governors warn COVID-19 relief is becoming a 'political football' The bipartisan chairs of the National Governors Association on Wednesday urged Congress to pass more economic relief efforts to help assuage the damage caused by the coronavirus pandemic, warning thehill.com", "2020-05-13T14:46:40.000Z": "Delivering urgent state fiscal relief must be a top priority for our leaders in Washington. As chairman of the @NatlGovsAssoc , I issued a statement with vice chair @NYGovCuomo today calling on Congress to put partisanship aside and get this done for the American people:", "2020-05-13T16:00:10.000Z": "Today at 5:00 PM, I will provide an update regarding Stage One of our #MarylandStrong Roadmap to Recovery. \n\nWatch live here on Twitter, Facebook, or YouTube (live captioning available): https:// bit.ly/3bvczfj", "2020-05-10T23:47:02.000Z": "Due to the coronavirus cookouts are strongly discouraged. Please stay safe. #coronavirusbalt", "2020-05-11T20:24:07.000Z": "Normal is going to have to wait a while longer, Maryland Gov. @LarryHogan writes Opinion | Larry Hogan: Recovery doesn't mean going back to normal Normal is going to have to wait a while longer. washingtonpost.com", "2020-05-11T17:01:02.000Z": "As we continue to celebrate our #HealthcareHeroes , I'm proud to issue a proclamation that officially recognizes #NationalHospitalWeek in Maryland.", "2020-05-11T15:15:56.000Z": "On behalf of a grateful state, I'd like to sincerely thank @CocaColaCo , @CokeCCBCC , @MDBiz , @MDMEMA , MakersRespond, and K&W Finishing, Inc. for partnering to manufacture and deliver 25,000 face shields for healthcare heroes at local hospitals & health departments. #MarylandUnites", "2020-05-11T13:24:54.000Z": "Every single day, I am moved by the selflessness, the unwavering loyalty, and the dedication of Maryland's law enforcement family.", "2020-05-10T16:03:34.000Z": "Wishing a very happy #MothersDay to all the incredible moms across our great state!", "2020-05-08T20:17:01.000Z": "Recovery doesn't mean going back to normal, Maryland Gov. @LarryHogan writes in an op-ed Opinion | Larry Hogan: Recovery doesn't mean going back to normal Normal is going to have to wait a while longer. washingtonpost.com", "2020-05-08T20:08:11.000Z": "This crisis has revealed our nation's true character. We trust facts and science. We show remarkable courage in the face of grave threats. We make extraordinary sacrifices for one another. Opinion | Larry Hogan: Recovery doesn't mean going back to normal Normal is going to have to wait a while longer. washingtonpost.com", "2020-05-08T01:54:06.000Z": "Maryland Governor @GovLarryHogan , Chair of @NatlGovsAssoc , will join our   #StrongerTogether broadcast this Saturday at 10am EST.  https:// facebook.com/events/2482764 582033869/   #HomeWithEU  #EuropeDay", "2020-05-08T14:27:01.000Z": "On #ChildCareProviderDay , we celebrate the dedicated providers who are going above and beyond to care for the children of essential personnel, and recognize those who are separated from the students they love. Thank you for all that you do on behalf of Maryland's families.", "2020-05-07T18:27:30.000Z": "You asked and we delivered! Here's the flight path for tomorrow's @175thWing A-10 flyover!\n\nTo all of those fighting on the frontlines of #COVID19 , we salute you! #AirForceSalutes  #MDUnitesFlyover  https:// news.maryland.gov/ng/2020/05/06/ mdng-salutes-essential-workers-with-flyover/ ", "2020-05-07T16:42:02.000Z": "Today I joined @RiggsBarstool to discuss Maryland's #COVID19 response, our ongoing collaboration with the federal government, and the outlook on sports here in our state. @BarstoolSports Quote Tweet Barstool Sports @barstoolsports Maryland Governor Larry Hogan Discusses Handling The Coronavirus Pandemic With @RiggsBarstool Watch the full video here: https:// barstoolsports.com/video/2407010/ maryland-governor-larry-hogan-discusses-handling-the-coronavirus-pandemic-with-riggs   @BarstoolNewsN", "2020-05-06T22:15:24.000Z": "As Maryland continues preparations to begin Stage One of the ' #MarylandStrong : Roadmap to Recovery,' @GovLarryHogan today announced the resumption of elective medical procedures and the broadening of permitted outdoor activities: https:// larryhogan.com/news/governor- hogan-announces-resumption-of-elective-medical-procedures-broadening-of-outdoor-activities/ ", "2020-05-06T20:46:57.000Z": "Maryland has put forward a sensible, staged plan for re-opening their economy that maximizes safety and recognizes the need to restore economic health. Starting with opening of outdoor activities, it's based on sound science and aligns with consensus plans Maryland eases some coronavirus restrictions on outdoor recreation, allowing golf, boating and more Maryland remains under a stay-at-home order with schools and many businesses closed, but Gov. Larry Hogan on Wednesday announced a slight easing of restrictions on outdoor recreation and non-emerge... baltimoresun.com", "2020-05-06T20:45:06.000Z": "Starting tomorrow, Marylanders can partake in outdoor activities, such as golf, tennis, boating, fishing & camping. To assist biz in safe reopening, guidelines are being developed for specific industry sectors, starting w/ marinas & golf courses. http:// ow.ly/wbtj50zyZai", "2020-05-06T20:41:07.000Z": "We are indeed flattening the curve, and we are preparing to launch our #MarylandStrong reopening plan in order to safely get people back to work, to safely get our small businesses back open again, and to get our economy back on track.", "2020-05-06T20:41:06.000Z": "At my direction, the @MDHealthDept has issued guidelines, effective immediately, to allow for elective procedures to resume at the discretion of local hospitals and health care providers. Details: https:// bit.ly/2WEjIF4", "2020-05-06T20:41:05.000Z": "Today I provided several updates on Maryland's #COVID19 response and recovery plan, including the resumption of elective medical procedures and the broadening of permitted outdoor activities. Watch today's press conference: https:// youtu.be/1zdUc2ekN38", "2020-05-06T19:03:39.000Z": "Watch today's announcement live: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: COVID-19 Update - May 6, 2020\n\nLive captioning is available on YouTube. https:// pscp.tv/w/cYGvyTFheWpW Z3hwdmJlRXB8MW1yeG1RRVFFV1p4eQTmJjV0T3LM7YPmEO78mc_CzFwTYBWXJELgDkxIpAZp ", "2020-05-06T18:08:32.000Z": "Today at approximately 3:00 PM, I'll update Marylanders on the most recent developments in our #COVID19 response and recovery plan. Tune in and watch live: https:// bit.ly/2JlXv8q", "2020-05-05T21:27:52.000Z": "Today I visited @BWI_Airport to express my support and gratitude for more than 130 members of the @MDNG as they prepared for deployment to the Middle East. These brave soldiers will provide intelligence capabilities in support of Operation Inherent Resolve.", "2020-05-05T21:40:41.000Z": "Earlier today, @GovLarryHogan visited BWI Marshall Airport to acknowledge and thank about 130 @MDNG soldiers that are deploying overseas in support of Operation Inherent Resolve. #SceneAtBWI  #MDOTscenes", "2020-05-04T15:20:53.000Z": "With the tests we recently acquired from South Korea, Maryland continues to implement an expanded #COVID19 testing strategy. Tomorrow, a new drive-thru testing site will open at the VEIP station in Hagerstown. Details: https:// governor.maryland.gov/2020/05/04/gov ernor-hogan-announces-continued-expansion-of-covid-19-testing-at-vehicle-emissions-inspection-program-stations/ ", "2020-05-04T17:12:41.000Z": ". @FOXBaltimore : Governor Hogan Announces New #COVID19 Drive-Thru Testing Site in Hagerstown Governor Hogan Announces New COVID-19 Testing Site in Hagerstown ANNAPOLIS, Md. (WBFF) - Governor Larry Hogan announced that the state will continue to expand its COVID-19 testing program by opening a new drive-thru site on Tuesday, May 5 at the Vehicle Emissions... foxbaltimore.com", "2020-05-04T12:06:16.000Z": ". @WashingtonPost : Maryland plays an outsized role in worldwide hunt for a coronavirus vaccine Maryland plays an outsized role in worldwide hunt for a coronavirus vaccine State's biotech companies, federal labs and universities are leaders in battling the disease. washingtonpost.com", "2020-05-04T03:17:33.000Z": "MEMA ALERT: Severe Thunderstorm Warning for Calvert, Charles, and St. Marys County in MD until 12:00am. #mdwx", "2020-05-03T21:20:34.000Z": "Tune in tonight: Quote Tweet Governor Larry Hogan @GovLarryHogan Tonight at approx 7 p.m., I'll join the @FoxNews 'America Together: Returning to Work' special to discuss our #MarylandStrong Roadmap to Recovery.", "2020-05-03T14:05:53.000Z": "As states prepare for a safe reopening, it's critical to continue responding to the facts on the ground and deliver aid to American families and businesses. As I said on @CNNSotu , we've got to put aside divisiveness and partisanship to help our nation weather this storm.", "2020-05-02T17:39:00.000Z": ". @GovLarryHogan has named today \"Healthcare Heroes Day\" in Maryland and tonight we will light up M&T Bank Stadium in blue to honor our heroes", "2020-05-02T13:08:51.000Z": "Philip Wolowicz serves as a firefighter and paramedic with the Montgomery County Fire and Rescue Service. He's a loving husband and father to three little girls. Thank you, Philip. @mcfrs  #HealthcareHeroesDay", "2020-05-02T13:04:17.000Z": "Governor Larry Hogan proclaims today, Saturday, May 2, as \"Health Care Heroes Day\" in Maryland. Today and every day, we say thank you!", "2020-05-02T12:54:02.000Z": "Gov. @LarryHogan has declared today as Health Care Heroes Day. To salute the workers on the front lines of this pandemic, we are lighting our hospital in blue tonight. Join us in this effort to honor their bravery by illuminating Maryland blue. We are all in this together.", "2020-05-02T09:30:04.000Z": "The Navy's Blue Angels and the Air Force's Thunderbirds are scheduled to fly over Baltimore Saturday at 11:30 a.m. to honor the frontline healthcare heroes. If you can't see the show from home, you can watch it on http:// wjz.com ! https:// cbsloc.al/2YCgDbd", "2020-05-02T11:02:01.000Z": ". @GovLarryHogan proclaims Saturday, May 2, as \"Health Care Heroes Day\" in Maryland.", "2020-05-01T23:48:05.000Z": "Wishing a very happy anniversary to my beautiful wife, Yumi! You are an incredible partner, mother, grandmother, and First Lady. I am so blessed to have you by my side every day - you truly are my better half.", "2020-05-01T20:39:46.000Z": "I just got off the phone with @Orioles first baseman @TreyMancini , who began undergoing chemotherapy for Stage III colon cancer on April 13. I Am So Lucky | By Trey Mancini If baseball returns in 2020, it will probably be without me. theplayerstribune.com", "2020-05-01T20:15:04.000Z": "Without this funding, cities and municipalities will be forced to lay off workers and cut essential services. Fire, police, sanitation are all critical if we are to fully reopen our economy. Opinion | Republican senator: Yes, Congress should send money to state and local governments Timidity and half measures will not restart our economy. washingtonpost.com", "2020-05-01T20:12:14.000Z": ". @SenBillCassidy : Yes, Congress should send money to state and local governments Opinion | Republican senator: Yes, Congress should send money to state and local governments Timidity and half measures will not restart our economy. washingtonpost.com", "2020-05-01T17:17:30.000Z": "Hogan announces steps to protect poultry workers from coronavirus Hogan announces steps to protect poultry workers from coronavirus Wicomico County, home of Purdue Farms, now has the fourth-highest rate of positive cases in the state. wbaltv.com", "2020-05-01T02:03:42.000Z": "We are all in this together, and to keep healthy and safe we need to just Stay (Home) A Little Longer. We will get through this and come back stronger. #MarylandStrong Quote Tweet Brothers Osborne @brothersosborne So proud of the work @LarryHogan has been doing. Making us Marylanders proud . Also we need a pair of those Maryland flag face masks", "2020-04-30T10:52:56.000Z": "Trump told America's governors they were on their own. So Maryland's Larry Hogan is taking charge Trump Told America's Governors They Were On Their Own. So Maryland's Larry Hogan Is Taking Charge Hogan is dealing with a crisis for which there is no playbook time.com", "2020-04-30T16:00:53.000Z": "I have ordered the Maryland flag lowered in honor of the more than 1,000 Marylanders who have lost their lives to #COVID19 . Flags will remain lowered through the weekend in honor of our fallen heroes and frontline healthcare workers. My full statement:", "2020-04-30T03:48:02.000Z": "Full interview with @GovLarryHogan : Gov. Larry Hogan - Getting Tests & Plans for Reopening Maryland | The... Maryland Governor and Chair of the National Governors Association Larry Hogan discusses his decision to obtain coronavirus tests from South Korea and shares ... youtube.com", "2020-04-29T19:05:06.000Z": "Watch today's announcement live: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: COVID-19 Update - April 29, 2020\n\nLive captioning is available on YouTube. https:// pscp.tv/w/cXh1cTFheWpW Z3hwdmJlRXB8MWxER0xnZ1dlb3ZLbbnR3uV1apxzCKZTOjPJgLll8xR6duGFaIxrjY9tTdWx ", "2020-04-28T14:34:15.000Z": "Maryland mounted an aggressive campaign against a very large epidemic of covid spread it suffered and is now advancing prudent, public-health-minded, staged plan to start reopening economic activity and restore normal life for residents. States can succeed Maryland is on the Road to Recovery Less than two months ago, as COVID-19 began its spread throughout our state, I received a horrifying, almost unthinkable warning from some of our nation's top public health experts. Without fredericknewspost.com", "2020-04-28T13:35:29.000Z": ". @GovLarryHogan : Maryland is on the Road to Recovery https:// fredericknewspost.com/opinion/letter _to_editor/maryland-is-on-the-road-to-recovery/article_926922d4-d0b1-5c1e-a572-c8b7d3610aba.html?utm_medium=social&utm_source=twitter&utm_campaign=user-share  via @frednewspost Maryland is on the Road to Recovery Less than two months ago, as COVID-19 began its spread throughout our state, I received a horrifying, almost unthinkable warning from some of our nation's top public health experts. Without fredericknewspost.com", "2020-04-27T13:02:14.000Z": "The best way we can continue to flatten the curve is to stay home and stay safe. Thanks to @RouteOneApparel for the great #WFH outfit-and remember to support your local businesses, hon.", "2020-04-26T13:46:55.000Z": "Today on @ThisWeekABC , I joined @GStephanopoulos to discuss our #MarylandStrong Roadmap to Recovery and the continued need for a responsible, fact-based response to this pandemic.", "2020-04-26T12:59:05.000Z": "Maryland Governor @GovLarryHogan has unveiled a prudent, staged plan to re-open Maryland as public health conditions improve. The plan's three-phases are timed against measurable milestones of progress on the gradual path toward restoring people's safety. Five takeaways from Gov. Larry Hogan's plan to reopen Maryland Here are five key takeaways from Gov. Larry Hogan's plan that balances reopening Maryland's economy while taking precautions against the continued spread of the virus. baltimoresun.com", "2020-04-24T16:20:54.000Z": "SUNDAY: We get the latest on Maryland's efforts to stop the spread of #coronavirus with @GovLarryHogan  On TV, radio, and streaming online at https:// cbsn.ws/2Kvm03F , don't miss @FaceTheNation this Sunday", "2020-04-24T19:05:08.000Z": "Watch @GovLarryHogan 's #MarylandStrong : Roadmap to Recovery announcement live: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: COVID-19 Update - April 24, 2020\n\nLive captioning is available on YouTube. https:// pscp.tv/w/cXHd1DFheWpW Z3hwdmJlRXB8MWpNS2dRdmtYV2tKTLdDuCRVf5kUpAx_xExMsBjPdq-hwzS6Xjv2a1YZQfAJ ", "2020-04-24T15:00:01.000Z": "Today at approximately 3:00 PM, I will be introducing our Maryland Strong: Roadmap to Recovery.\n\nWatch live here on Twitter, Facebook ( @GovLarryHogan ), or YouTube (live captioning available): https:// bit.ly/2JlXv8q", "2020-04-23T21:31:35.000Z": "The @NatlGovsAssoc remains committed to supporting governors' #COVID19 response and recovery efforts. These resources are an excellent starting point, and tomorrow we will unveil our recovery plan for Maryland. Quote Tweet Scott Gottlieb, MD @ScottGottliebMD The National Governors Association, under the chairmanship of @GovLarryHogan , has released a comprehensive, staged road map for the nation's governors to responsibly re-start economic activity as they lead their states toward safety and recovery. https:// nga.org/wp-content/upl oads/2020/04/NGA-Report.pdf ", "2020-04-23T17:29:05.000Z": "This morning, I joined @JakeSherman and @apalmerdc live for a virtual @POLITICO Playbook interview, where we discussed Maryland's #COVID19 response, the ongoing federal-state collaboration, and our state's recovery plan. Watch the full interview: Governor Hogan Discusses COVID-19 Response and Reopening in Virtual... youtube.com", "2020-04-23T16:23:29.000Z": ". @MayorBowser , @GovernorVA & I have sent a joint regional letter to the Trump administration urging the continuation of telework for federal employees. Extending this policy will help ensure the safety of our region's 360,000 federal workers as we continue fighting this pandemic.", "2020-04-22T15:10:07.000Z": "We're interviewing @GovLarryHogan about the behind-the-scenes efforts that secured 500K coronavirus testing kits for Maryland, what it'll take to reopen the state and how governors are trying to work with the White House on the crisis response. Watch live: https:// politicoplaybook423.splashthat.com/twitter", "2020-04-22T19:03:00.000Z": "LIVE: COVID-19 Update - April 22, 2020\n\nLive captioning is available on YouTube. Governor Larry Hogan @GovLarryHogan COVID-19 Update - April 22, 2020 pscp.tv", "2020-04-22T11:56:08.000Z": "Special thanks to @AlexGaskarth of @AllTimeLow for this #StayHomeMaryland message- we've all got to do our part in order to flatten the curve.", "2020-04-21T19:06:12.000Z": "Thank you to my @NatlGovsAssoc Vice Chairman @NYGovCuomo for these kind words. Maryland is with you and the people of New York every step of the way as you lead through this horrible tragedy. Quote Tweet CBS News @CBSNews NY Gov Cuomo praises MD Gov. Larry Hogan for \"thinking outside the box\" when buying coronavirus test kits from South Korea but pushes the federal government to figure out international supply issues rather than have 50 states fending for themselves https:// cbsn.ws/3cvtcbM", "2020-04-21T13:22:59.000Z": "WATCH: @LarryHogan tells @SandraSmithFox how Maryland managed to obtain 500,000 coronavirus tests from South Korea #nine2noon", "2020-04-21T12:16:00.000Z": "Yesterday I announced unprecedented measures our state has taken to secure critical resources in our fight against #COVID19 . Today I'll discuss Maryland's coordinated response and recovery efforts on @Morning_Joe at 8:35, @AmericaNewsroon at 9:05, and @TheView at 11:20.", "2020-04-21T11:45:27.000Z": "Marylanders should feel confident in knowing that we have done everything in our power, gone to every length, and used every tool and every resource at our disposal to defeat this deadly virus.", "2020-04-21T01:13:07.000Z": "I'm grateful to President Trump for sending us a list of federal labs and generously offering Maryland use of them for #COVID19 testing. Accessing these federal labs will be critical for utilizing the 500,000 tests we have acquired from South Korea.", "2020-04-20T18:04:51.000Z": "Archbishop William Lori joined other faith leaders today to bless the Baltimore Convention Center, which is now acting as a field hospital amid the coronavirus pandemic. Earlier this month, other hospitals, including Mercy Medical Center, received blessings. #baltimoreprays", "2020-04-20T18:04:42.000Z": "The most critical building block of our recovery plan for Maryland is the ability to do widespread testing. The incredible success of this operation has not only put us on track to achieve that goal, but it will literally help save the lives of thousands of Marylanders.", "2020-04-20T18:04:41.000Z": "Each part of this international collaboration was unprecedented, and required an amazing team effort. I want to sincerely thank our South Korean partners for assisting us in our fight against this common, hidden enemy.", "2020-04-20T18:04:40.000Z": "On Saturday, First Lady Yumi Hogan and I stood on the tarmac at @BWI_Airport to welcome the first ever Korean Air passenger plane, carrying a very important payload of LabGun #COVID19 test kits which will give MD the capability of performing half a million coronavirus tests.", "2020-04-20T19:44:02.000Z": "\"She truly is a champion of this operation,\" @GovLarryHogan said: https:// on.wbaltv.com/3bkMTmu", "2020-04-20T18:03:46.000Z": "Watch Live Now: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: COVID-19 Update - April 20, 2020\n\nLive captioning is available on YouTube. https:// pscp.tv/w/cWyJlTFheWpW Z3hwdmJlRXB8MW5BS0VkeXBuTll4TDuC1hAChEPU6bQ_ZRY-LfGR3DJGbY289_9tRIOu ", "2020-04-20T15:06:10.000Z": "Today at approximately 2:00 p.m., I will make a major announcement regarding COVID-19 testing in Maryland.\n\nWatch live here on Twitter, Facebook, ( @GovLarryHogan ), or YouTube (live captioning available): https:// bit.ly/2JlXv8q", "2020-04-19T21:07:09.000Z": "Small businesses all across the country are hurting and desperately need relief as we continue to confront this global pandemic. The nation's governors continue to push for critical funding for the states to help protect essential services and get the economic recovery moving.", "2020-04-19T15:30:46.000Z": "Lack of testing is probably the number one problem in America and has been since the beginning of the #COVID19 crisis. As I said today on @CNNSotu , every governor has been fighting to get more tests from the federal government, from private labs, and from all across the world.", "2020-04-17T18:33:20.000Z": "LIVE: COVID-19 Update - April 17, 2020\n\nLive captions available on YouTube. 0:01 Governor Larry Hogan @GovLarryHogan COVID-19 Update - April 17, 2020 pscp.tv", "2020-04-17T14:00:43.000Z": "Today at approximately 2:30 p.m., I will provide an update on Maryland's #COVID19 response and recovery efforts. Marylanders will also hear from top cabinet officials, including @MdPublicSchools Superintendent Dr. Karen Salmon.", "2020-04-16T14:04:09.000Z": "We're facing twin battles: our fight against the spread of #COVID19 , and the economic challenges that have emerged as a result. This morning on the @TODAYshow , I discussed the gradual recovery plan we are developing which will get people back to work without endangering lives.", "2020-04-15T23:48:50.000Z": ". @fox5dc : Maryland @GovLarryHogan honors ASL interpreter Jimmy Beldon Maryland Governor Larry Hogan honors ASL interpreter Jimmy Beldon Governor Larry Hogan honored American Sign Language interpreter Jimmy Beldon Wednesday with the Governor's Citation for his important work translating the governor's press conferences during this... fox5dc.com", "2020-04-15T18:52:52.000Z": "What a cool moment! @GovLarryHogan recognizes ASL interpreter with citation, as Jimmy continues to interpret the recognition!", "2020-04-15T18:41:52.000Z": "#BREAKING  @GovLarryHogan says there are reasons for \"cautious optimism\" and says it is time to start early planning for recovery phase @ABC7News", "2020-04-15T18:38:36.000Z": "Tune in LIVE now to watch @GovLarryHogan 's COVID-19 update: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: COVID-19 Update - April 15, 2020\n\nLive captions are available on YouTube. https:// pscp.tv/w/cWX6DjFheWpW Z3hwdmJlRXB8MWxEeExnWFJxQndKbbPs9qRTKFlM7q21sNB-JvXBUZIMUqoNtpd7q3vxyyU3?t=2s ", "2020-04-14T23:41:18.000Z": "This week, we honor the 911 dispatchers and other professionals who serve as critical lifelines between the public and the first responders on the ground. We thank them for their tireless efforts to keep our communities safe, now more than ever. #NPSTW", "2020-04-13T17:47:30.000Z": "The nation's governors are urging Congress to immediately approve critical funding for the states. We are asking the administration to weigh in so we can break this logjam in the Senate and get this done for the American people. \n\nMy full statement:", "2020-04-13T17:47:29.000Z": "Today, on behalf of the nation's governors, I led another teleconference with the @VP and the White House regarding our coordinated response to #COVID19 .", "2020-04-13T17:41:03.000Z": "A line of severe t'storms is tracking east 35 mph. Stay alert in Frederick, Carroll, Howard, and Baltimore Counties. #mdwx", "2020-04-13T15:34:29.000Z": "The @NWS has issued a Tornado Watch for Allegany, Anne Arundel, Baltimore, Calvert, Caroline, Carroll, Cecil, Charles, Frederick, Harford, Howard, Kent, Montgomery, Prince Georges, Queen Anne's, St. Marys, Talbot, Washington & Baltimore City in MD until 6:00pm. #MdWx", "2020-04-13T12:59:33.000Z": ". @WJZ : Over 23,000 Meals Distributed In Baltimore County With Help From @MDNG Over 23K Meals Distributed In Baltimore County With Help From Maryland National Guard Last weekend Baltimore County had 11 Saturday food pick-up sites. baltimore.cbslocal.com", "2020-04-13T12:12:47.000Z": "With severe weather possible throughout the day for much of the state, this is a reminder to stay home and off the roads if necessary. If you must be on the road, be aware of the possibility of rushing water. #TurnAroundDontDrown Quote Tweet Maryland Emergency Management Agency (MDMEMA) @MDMEMA As storms continue to pass through Maryland, remember:\n\nFollow your local forecast on multiple platforms (Social Media, TV, Radio) Charge your mobile devices in case of a power outage Heed all warnings. If possible, stay home & off the roads during storms.  #MdWx", "2020-04-13T11:55:38.000Z": "As storms continue to pass through Maryland, remember:\n\nFollow your local forecast on multiple platforms (Social Media, TV, Radio) Charge your mobile devices in case of a power outage Heed all warnings. If possible, stay home & off the roads during storms.  #MdWx", "2020-04-12T16:43:50.000Z": "This morning, I addressed the Baltimore-Washington corridor's designation as an emerging #COVID19 hotspot on @ThisWeekABC . While this pandemic is affecting every corner of our state, we are focusing critical resources towards our hardest-hit communities.", "2020-04-12T14:05:17.000Z": "The ZIP codes with the most #COVID19 cases are: \n21215, Arlington, Baltimore City/Baltimore County (137)\n20904, Silver Spring, Montgomery (132)\n20906, Silver Spring, Montgomery (126)\n20902, Silver Spring, Montgomery (125)\n20744, Fort Washington, Prince George's (122)", "2020-04-12T14:05:16.000Z": "Beginning today, we are posting #COVID19 cases by ZIP code on http:// coronavirus.maryland.gov . We are being as proactive as anyone in the country on this so that Marylanders can better understand the spread of this deadly virus.", "2020-04-11T13:53:58.000Z": "On Behalf of Nation's Governors, @GovLarryHogan , @NYGovCuomo Urge Federal Leaders to Provide Immediate Fiscal Relief for States ​ https:// anamericaunited.org/news/on-behalf -of-nation-s-governors-hogan-cuomo-urge-federal-leaders-to-provide-immediate-fiscal-relief-for-states/ ", "2020-04-10T16:47:27.000Z": "In a light hearted moment, @GovLarryHogan declares the Easter Bunny an \"essential worker\" that may deliver eggs and candy on Sunday", "2020-04-10T16:34:23.000Z": "Tune in LIVE now to watch @GovLarryHogan 's update: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: COVID-19 Update - April 10, 2020 https:// pscp.tv/w/cV9FgDFheWpW Z3hwdmJlRXB8MW5BS0VkV3BFWnZ4TPQlwPQGUmT6bPMC9q8TPW9bnLpxhfGl3pXJ4LGpxbz5?t=2s ", "2020-04-10T14:07:32.000Z": "Tune in live at 12:30 PM: Quote Tweet Governor Larry Hogan @GovLarryHogan Today at approximately 12:30 p.m., I will provide updates on Maryland's aggressive, coordinated response to the #COVID19 pandemic.\n\nWatch live here on Twitter, Facebook ( @GovLarryHogan ), or YouTube (live captioning available): https:// bit.ly/2JlXv8q .", "2020-04-10T02:01:11.000Z": "Tonight we #LightItBlue in support of our healthcare workers, first responders, essential workers, and everyone on the front lines.", "2020-04-10T01:26:21.000Z": "We're joining in to #LightItBlue in honor of our health care professionals and essential workers on the front lines.\n\nThank you for all you do", "2020-04-10T01:28:18.000Z": "#LightItBlue Quote Tweet Governor Larry Hogan @GovLarryHogan Tonight, Government House is taking part in the #LightItBlue campaign to express our gratitude for the health care heroes and essential personnel on the front lines of the #COVID19 pandemic. May God bless each and every one of them.", "2020-04-09T17:10:00.000Z": "SEND US YOUR QUESTIONS| Governor Larry Hogan will be joining FOX45 for a Virtual Town Hall on Facebook, Today, April 9 at 4 pm. #HoganTownHall", "2020-04-09T14:35:37.000Z": "On Tuesday, I directed @MDHealthDept to begin publishing everything that is available on racial and ethnic breakdowns on #COVID19 cases, with updates as more data becomes available.", "2020-04-08T20:02:31.000Z": "I want to sincerely thank the @MDNRPolice and all of the agencies and dedicated personnel who worked around the clock to support this recovery mission.", "2020-04-08T20:02:30.000Z": "The daughter and grandson of former Maryland Lt. Governor Kathleen Kennedy Townsend, Maeve and Gideon McKean, have now both been found. Please continue to keep their family in your prayers as they mourn this devastating loss.", "2020-04-08T18:13:01.000Z": "Our state will make it through this together, and we will come back stronger and better than ever. The following media includes potentially sensitive content. Change settings View", "2020-04-08T14:16:21.000Z": "Today's numbers reflect a tripling of the tests reported since yesterday. We are seeing commercial labs begin to clear their backlog of tests. More than 30% of the new cases reported today are for testing that was completed in March.", "2020-04-08T14:16:20.000Z": "As of this morning, Maryland has 5,529 confirmed cases of #COVID19 , an increase of 1,158 cases since yesterday. This virus continues to spread in every jurisdiction, and as I have been saying for weeks, the Baltimore-Washington corridor has become an emerging hotspot.", "2020-04-08T13:06:41.000Z": ". @NPR : Hogan Announces 'Strike Teams' To Target Coronavirus At Nursing Homes Hogan Announces 'Strike Teams' To Target Coronavirus At Nursing Homes Gov. Larry Hogan announced on Tuesday the creation of new statewide \"strike teams\" to help nursing homes that have been overwhelmed with cases of COVID-19. wypr.org", "2020-04-08T00:43:57.000Z": "Thank you, Governor. Marylanders are truly grateful for the generosity of our friends on the West Coast. We are all in this together. Quote Tweet Gavin Newsom @GavinNewsom CA's 500 ventilators will begin to ship out today:\n100->NY\n100->NJ\n100->IL\n50->MD\n50->DC\n50->DE\n50->NV\n\nCommitted to the health of every Californian. Practicing our duty as Americans to take care of one another. I know other states would do the same.", "2020-04-07T18:38:20.000Z": ". @BaltimoreSun : @GovLarryHogan announces first-in-nation 'strike teams' for responding to coronavirus outbreaks at nursing homes Hogan announces 'strike teams' for responding to coronavirus outbreaks at nursing homes Maryland Gov. Larry Hogan on Tuesday announced the creation of new healthcare and logistics \"strike teams\" to provide immediate support to nursing homes experiencing outbreaks of coronavirus cases... baltimoresun.com", "2020-04-07T17:30:44.000Z": "LIVE: COVID-19 Update - April 7, 2020\n\nLive captioning is available on YouTube. Governor Larry Hogan @GovLarryHogan COVID-19 Update - April 7, 2020 pscp.tv", "2020-04-07T17:20:39.000Z": ". @GovLarryHogan gets close up look at new \"field hospital\" in #Baltimore Convention Center; 250 beds for possible cases of coronavirus. @FOXBaltimore", "2020-04-07T16:30:33.000Z": "At his 1:30pm press conference, @GovLarryHogan will address:\n\n-Hospital surge efforts\n-Outlook for Baltimore-Washington corridor\n-Support for Baltimore City\n-New actions to protect nursing homes\n-Businesses/construction sites that fail to comply with social distancing guidelines", "2020-04-07T15:05:59.000Z": "Gottlieb joining Maryland governor's coronavirus response team Gottlieb joining Maryland governor's coronavirus response team Former Food and Drug Administration head Scott Gottlieb will join Maryland Gov. thehill.com", "2020-04-07T12:06:03.000Z": "Thrilled to have @ScottGottliebMD join our coronavirus response team alongside some of the top public health experts in the country. Dr. Gottlieb is widely respected on both sides of the aisle, and his expertise will be invaluable to Maryland's #COVID19 response. Quote Tweet Scott Gottlieb, MD @ScottGottliebMD Honored to be working with @GovLarryHogan and his dedicated team as they lead Maryland through these challenging times. As a former resident of the state I know the strength of its people and it's public health infrastructure to set a national standard in this effort. twitter.com/riccimike/stat", "2020-04-07T11:32:15.000Z": "Quote Tweet POLITICO Playbook @playbookplus SCOTT GOTTLIEB -- a former FDA commissioner under the Trump administration -- has become one of the most trusted public voices on the virus, and Gov. LARRY HOGAN has been roundly praised for his candor in leading Maryland. The latest in Playbook: https:// politico.com/newsletters/pl aybook/2020/04/07/scoop-trumps-shadow-coronavirus-czar-will-now-advise-larry-hogan-488823 ", "2020-04-06T13:47:54.000Z": ". @GovLarryHogan has announced new mandates for Maryland's nursing homes as officials try to blunt the spread of the coronavirus. New safety restrictions issued for Maryland's nursing homes Gov. Larry Hogan has announced new mandates for Maryland's nursing homes as officials try to blunt the spread of the coronavirus. wtop.com", "2020-04-05T21:38:12.000Z": "The First Lady and I enjoyed some social distancing family time today with our grandkids and the first pups. #StayHomeMaryland", "2020-04-05T18:34:46.000Z": "Today I enacted an emergency order to protect residents and staff at Maryland nursing home facilities, and bolster the state's mitigation and suppression efforts amid outbreaks of #COVID19 .\n\nDetails here: https:// governor.maryland.gov/2020/04/05/gov ernor-hogan-takes-aggressive-action-to-protect-nursing-home-residents-and-staff-amid-covid-19-outbreaks/ ", "2020-04-05T12:34:32.000Z": "Unafraid to call out Trump, Hogan emerges as lead GOP voice for urgent action on pandemic Unafraid to call out Trump, Hogan emerges as lead GOP voice for urgent action on pandemic The Maryland governor made an early call for social distancing, and warns the D.C. region could be the next New York. washingtonpost.com", "2020-04-04T00:38:29.000Z": "Stronger together.\n\nRed, white and blue to honor our front line workers", "2020-04-03T17:30:59.000Z": "Maryland @GovLarryHogan is calling for a moment of prayer and reflection at noon on Sunday April 5. Let us pray for essential workers -- such as doctors, nurses and first responders -- as well as the victims of COVID-19 and their families.", "2020-04-03T18:18:53.000Z": "Watch @GovLarryHogan 's COVID-19 Update Live: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: COVID-19 Update - April 3, 2020 https:// pscp.tv/w/cVYjsTFheWpW Z3hwdmJlRXB8MWVhS2JRWXpZWnZ4WCscCmRDPMBCDVIrkEfoBRVfoW1bkdOJwNSVmDWGQq9V?t=10s ", "2020-04-03T13:07:32.000Z": "\"We are all in this together\"| Governor Larry Hogan issued a video to encourage Maryland residents Friday. He's set to give an update this afternoon at 2:15pm. FOX45 will carry it LIVE on-air and online. https:// foxbaltimore.com/news/coronavir us/governorwe-are-all-in-this-together-hogan-set-to-give-update-friday-afternoon ", "2020-04-02T00:34:06.000Z": "We are heartbroken to learn of the passing of another brave Marylander, U.S. Army Sgt. 1st Class John Hilty, who lost his life this week while serving in Iraq. We ask Marylanders to join us in praying for all who loved him and all who fought beside him. Army soldier dies in Iraq, identified as Maryland native An Army soldier originally from Prince George's County, Md. , died Monday in Erbil, Iraq, according to the Department of Defense. Sgt. 1st Class John David Randolph Hilty, 44, from Bowie, Md. , died... wjla.com", "2020-04-01T20:12:13.000Z": "Earlier this week, I lost a good friend, fellow Marylander, and all-around great guy, Jerry Manley, to COVID-19. Jerry led a 33-year career in law enforcement serving Prince George's County, and was a dedicated advocate for @SPOlympicsMD and @ChildrensNatl Hospital.", "2020-04-01T13:50:00.000Z": "SOME GREAT NEWS: The Bay Bridge is reopened a year ahead of schedule, all lanes are reopened as of Wednesday morning! Bay Bridge Construction Completed More Than A Year Ahead Of Schedule, Gov. Hogan Says Gov. Larry Hogan announced Wednesday the Bay Bridge westbound right lane deck rehabilitation project is 100 percent complete and is now open to all drivers- more than a year ahead of schedule. baltimore.cbslocal.com", "2020-04-01T16:48:02.000Z": "Wishing a very #HappyBirthday to the best Lt. Governor in the country, @BoydKRutherford !", "2020-04-01T13:23:30.000Z": "Good news this morning: the Bay Bridge westbound right lane deck rehabilitation is 100% complete and open to all motorists-more than a year ahead of schedule. Learn more: https:// governor.maryland.gov/2020/04/01/gov ernor-hogan-announces-bay-bridge-westbound-right-lane-reopened-today-more-than-a-year-ahead-of-schedule/ ", "2020-04-01T00:52:16.000Z": "As I reiterated to @AC360 tonight, none of the states have all the resources we need, but the bottom line is that everyone has to work together right now and make critical decisions so that we can avoid an overwhelming spike in #COVID19 cases.", "2020-03-31T18:06:51.000Z": "Olympic gold medalist @KatieLedecky knows a little something about perseverance. Thanks Katie- let's continue cheering one another on. #StayHomeMaryland  #MarylandUnites", "2020-03-31T13:40:12.000Z": "We're incredibly proud to see @UnderArmour manufacturing essential equipment for our frontline health care professionals. This Maryland-grown business is setting an example for how private industry can join our all-hands-on-deck efforts to save thousands of lives. #MarylandUnites Quote Tweet Under Armour @UnderArmour We will get #ThroughThisTogether . UA has begun to manufacture and assemble face masks, face shields and specially equipped fanny packs for the 28,000 health care providers and staff at @umms . https:// undrarmr.co/2JENovH", "2020-03-31T11:10:23.000Z": "As we begin our first full day of Maryland's Stay at Home order, I'm joining @CNN  @NewDay at approx. 7:30 to discuss what this critical turning point means for Marylanders and our efforts to #flattenthecurve . #StayHomeMaryland", "2020-03-31T00:30:00.000Z": "\"There simply aren't enough test kits, medical supplies and other lifesaving equipment to meet the scope of this pandemic.\" https:// washingtonpost.com/opinions/2020/ 03/30/larry-hogan-gretchen-whitmer-what-governors-need-washington-during-this-health-emergency/ ", "2020-03-30T23:35:31.000Z": ". @GovLarryHogan and @GovWhitmer : What governors need from Washington during this health emergency Opinion | Larry Hogan and Gretchen Whitmer: What governors need from Washington during this health... The coronavirus doesn't distinguish between red states and blue states, and neither can we. washingtonpost.com", "2020-03-30T22:13:49.000Z": "Our nation is going to continue seeing exponential growth in #COVID19 cases, and the National Capital Region has seen a very rapid escalation in recent days. As I told @WolfBlitzer on @CNNSitRoom , we must continue taking aggressive action to stop this virus in its tracks.", "2020-03-30T20:47:45.000Z": "Today during the 5:00 hour, I'll join @WolfBlitzer on @CNNSitRoom to discuss the Stay at Home order I issued today as Maryland continues taking aggressive actions to respond to #COVID19 .", "2020-03-30T20:18:48.000Z": "Maryland Governor says state, D.C. area looks like New York did a few weeks ago https:// fxn.ws/2WYFCo3", "2020-03-30T19:41:39.000Z": "RELEASE: Maryland State Police have charged a man with violating the Governor's Executive Order and providing alcohol to teens during a party he hosted yesterday at a Carroll County hotel.", "2020-03-30T15:20:34.000Z": "NEW: Maryland Gov. Larry Hogan:  \"We have reached a critical turning point in the fight to stop the spread of the COVID-19 pandemic here in Maryland\" and in the region. https:// abcn.ws/3awDisn", "2020-03-30T14:46:29.000Z": "LIVE: COVID-19 Update - March 30, 2020 Governor Larry Hogan @GovLarryHogan COVID-19 Update - March 30, 2020 pscp.tv", "2020-03-30T12:53:34.000Z": "This morning, I'll be joining @FoxNews  @AmericaNewsroom to discuss the unprecedented actions we are taking to keep Marylanders safe. Tune in at the top of the 9 a.m. hour.", "2020-03-29T19:00:45.000Z": "A Charles County man has been arrested after repeatedly violating the executive order banning large gatherings and hosting a bonfire party with 60 guests. I cannot begin to express my disgust towards such irresponsible, reckless behavior. Maryland Man Arrested for Having 60 People Over for Bonfire, Violating Social Distancing Orders A Charles County, Maryland, man who threw a party at his house has unintentionally social-distanced himself from everyone after authorities say he was arrested for refusing to comply with the... nbcwashington.com", "2020-03-29T12:33:25.000Z": "Today on @CBSSunday , I'll provide an update on our efforts to leverage the full arsenal of public health and government to address #COVID19 and keep Marylanders safe. Quote Tweet WJZ | CBS Baltimore @wjz COMING UP AT 9 A.M. | Gov. Larry Hogan will make an appearance on CBS Sunday Morning. You can watch it right here on WJZ. https:// baltimore.cbslocal.com/2020/03/27/gov ernor-larry-hogan-cbs-sunday-morning-coronavirus-pandemic/ ", "2020-03-29T11:57:53.000Z": "Our nation is facing an unprecedented challenge, and in Maryland we're taking some of the most aggressive steps to slow the spread of #COVID19 . Today I'll be joining @FoxNewsSunday with Chris Wallace to discuss how governors are responding to this crisis on the front lines. Quote Tweet FoxNewsSunday @FoxNewsSunday THIS SUNDAY: Chris Wallace will be joined by Maryland Governor Larry Hogan as states battle to meet the needs of their residents. Check your local listings. #FNS  #FoxNews", "2020-03-28T19:04:22.000Z": "This morning, @FEMA delivered 250 beds to the field hospital site at the Baltimore Convention Center. I'd like to thank @FEMA , the @MDNG , @MDDGS , @MDHealthDept , @UMMS , @HopkinsMedicine , and all of our partners working around the clock to coordinate these lifesaving resources.", "2020-03-28T15:42:23.000Z": "Our state has seen another dramatic increase in COVID-19 cases overnight, bringing Maryland to 992 confirmed cases. We now have more than 1,900 cases in the National Capital Region. Coronavirus - Maryland Department of Health Visit the Maryland Department of Health's official resource for the Coronavirus Disease 2019 (COVID-19) outbreak. coronavirus.maryland.gov", "2020-03-27T22:37:56.000Z": "Leaders in Washington have finally come together to enact a #COVID19 relief plan. As chairman of the @NatlGovsAssoc , I'd like to thank @stevenmnuchin1 , @VP , @POTUS , and Congressional leaders for agreeing to critical aid for the states.", "2020-03-27T19:58:50.000Z": "Thanks Bill. The nation's governors truly are on the front lines of this crisis- we're all in this together. Quote Tweet Bill Gates @BillGates I've been impressed by governors across the country including @JayInslee , @NYGovCuomo , @GavinNewsom , @GovMikeDeWine , @GovLarryHogan , and the many others who are guiding their communities through this challenge and providing a model for us all to follow.", "2020-03-27T13:09:09.000Z": "We need each and every Marylander to help us slow the spread of #COVID19 , and I'm committed to sharing that message with as many people as possible. Listen:\n\nMIX 106.5: http:// radio.com/mix1065baltimo re/listen  WTOP: http:// bit.ly/2xx9Nb6 98 ROCK: http:// player.listenlive.co/35541", "2020-03-27T00:36:22.000Z": "We are pleased that our federal partners have answered our calls for action and swiftly granted Maryland's request for a Major Disaster Declaration: https:// governor.maryland.gov/2020/03/26/mar yland-receives-major-disaster-declaration-from-federal-administration-for-covid-19/ ", "2020-03-26T23:16:39.000Z": "In just a few moments, I'll be joining @ABC to discuss the latest in Maryland's coordinated COVID-19 response: Quote Tweet ABC News @ABC On @ABCNewsLive , we have the latest on the novel coronavirus pandemic as a third of the world's population is on lockdown. We speak with Maryland Gov. Hogan. Plus, we hear from Americans across the country about how they are impacted. https:// pscp.tv/w/cUvZyzM3Mzg2 fDFuQUtFZE1ubkxWeEwfVsKkC3pV0GXz2OSu0ciKx25DEpdwazcDar7mPyfD4g== ", "2020-03-26T20:57:43.000Z": "The Blood Bank of Delmarva, which serves Maryland's Eastern Shore, is in desperate need of blood donors. \n\nMake an appointment with @DelmarvaBlood : http:// delmarvablood.org Make an appointment with the @RedCross : http:// redcross.org Quote Tweet Blood Bank Delmarva @DelmarvaBlood Due to coronavirus concerns, people are working from and staying at home, therefore we are experiencing critically low blood and platelet appointments. This makes it difficult to meet patient needs and hospital demand.\n\nYour help is URGENTLY needed: http:// smarturl.it/BBD_CVTW", "2020-03-26T19:40:24.000Z": "Update from @MdPublicSchools regarding Child Care.", "2020-03-26T14:05:52.000Z": "Today, we are also seeing an unprecedented increase in the number of Marylanders filing for unemployment. We are going to do everything we can to help people and small businesses get back on their feet.", "2020-03-26T14:05:51.000Z": "The State of Maryland now has 580 confirmed cases of #COVID19 -an increase of 157 new cases, which is by far the largest one-day increase to date. There are more than 1,200 confirmed cases in the National Capital Region-in Maryland, Washington, D.C., and Virginia.", "2020-03-26T13:24:42.000Z": "I applaud the Senate for unanimously passing a bipartisan coronavirus aid bill. I urge the House to quickly follow suit because we do not have any time to waste. We are all Americans. And we are all in this together. House leaders seek to expedite emergency aid package amid uncertainty about GOP lawmaker delaying... Pelosi and McCarthy want the $2 trillion bill to pass by voice vote Friday, but Rep. Thomas Massie (R-Ky.) could push for a roll-call vote by the majority of the House. washingtonpost.com", "2020-03-26T00:52:36.000Z": "America's governors are taking decisive action to protect our citizens from #COVID19 , and as I explained tonight on @allinwithchris , we're committed to making informed decisions based on the facts on the ground.", "2020-03-25T23:59:38.000Z": "Here in Maryland, we are taking some of the most aggressive steps in the nation to slow the spread of #COVID19 . I'll discuss this and more on @MSNBC  @allinwithchris - tune in tonight at 8.", "2020-03-25T19:34:47.000Z": "I have requested a Presidential Disaster Declaration for the State of Maryland, which will provide essential emergency response funding for the state and for local governments and nonprofits.", "2020-03-25T19:34:46.000Z": ". @MdPublicSchools Superintendent Dr. Karen Salmon announced that the closure of all public schools in Maryland will be extended for an additional four weeks through April 24, 2020. Read Dr. Salmon's message: http:// marylandpublicschools.org/Pages/default. aspx ", "2020-03-25T19:34:45.000Z": "Today I provided updates on Maryland's aggressive, ongoing response to slow the spread of COVID-19 in Maryland. A comprehensive overview of these announcements can be found here: https:// governor.maryland.gov/2020/03/25/mar yland-public-schools-to-remain-closed-through-april-24-governor-hogan-requests-presidential-disaster-declaration-for-maryland/ ", "2020-03-25T20:40:57.000Z": "We're in it together- let's win it together. Thanks, Coach. #MarylandUnites  @Ravens", "2020-03-24T12:02:12.000Z": "Tune in to @NewDay on @CNN this morning at approx. 8:10, where I'll provide updates on Maryland's ongoing efforts to flatten the curve and slow the spread of #COVID19 .", "2020-03-23T15:10:59.000Z": "LIVE: COVID-19 Update - March 23, 2020 Governor Larry Hogan @GovLarryHogan COVID-19 Update - March 23, 2020 pscp.tv", "2020-03-23T00:28:33.000Z": "Governors are leading on the front lines of this crisis, and we need Congress to work together to support our efforts. This is no time for partisan dysfunction- it's going to take all of us working together in order to save thousands of lives. Coronavirus stimulus bill fails in key Senate procedural vote Democratic leaders warned that the bill did too much to bail out companies and not enough to help workers. cnbc.com", "2020-03-22T13:27:17.000Z": "WATCH: @GovLarryHogan says the progress to battle coronavirus is \"not nearly enough, it's not fast enough.\" #MTP  #IfItsSunday Gov. Hogan: \"Failures were made ... but I just want to focus on where we go from here.\"", "2020-03-21T19:00:27.000Z": ". @MDBiz and @MD_Labor have compiled resources for businesses whose daily operations are impacted by the COVID-19 pandemic at https:// businessexpress.maryland.gov/coronavirus . Home govstatus.egov.com", "2020-03-21T19:00:26.000Z": "The @MDFoodBank is requesting donations, food, and volunteers as they assemble \"Back Up Boxes\" of shelf-stable, nutritious foods for families in need. Learn more at http:// mdfoodbank.org . Maryland Food Bank - A Hunger Relief Non-Profit | Donate Now Together we can diminish the immediate effects of hunger through access to nutritious food, while helping Marylanders build long-term paths to self-sufficiency. mdfoodbank.org", "2020-03-21T19:00:25.000Z": "The @RedCross is in desperate need of blood donations-if you are healthy, please consider making an appointment to give at http:// redcross.org . American Red Cross Every 8 minutes the American Red Cross responds to an emergency. Support the Red Cross. Join us today by making a donation. redcross.org", "2020-03-21T19:00:24.000Z": "Marylanders are encouraged to sign up for the Maryland Responds Reserve Medical Corps- now recruiting active and retired health care professionals, medical students, and other interested volunteers. Link: https:// mdresponds.health.maryland.gov", "2020-03-21T19:00:23.000Z": "We are hearing from Marylanders across the state who want to help with our response to #COVID19 . Thank you for the outpouring of support, and here are some ways you can help:", "2020-03-21T16:18:10.000Z": "In the coming days and weeks, Marylanders may notice the @MDNG at work in their communities. Though this may be an unusual sight, Marylanders should feel confident that these brave soldiers and airmen are here to help keep residents safe and healthy. #MarylandUnites Quote Tweet MD National Guard @MDNG . @175thWing Airmen are working hard with state partners to ensure critical med. supplies are being shipped to local health dept. & hospitals so they can safely perform their job!\n\nThese @MDNG service members are dedicated to serving our communities through the #Covid_19 pandemic!", "2020-03-20T23:55:11.000Z": "A second Marylander has lost his life as a result of the coronavirus pandemic. On behalf of our entire state, we send our heartfelt condolences to his family and to all those who loved him:", "2020-03-20T00:46:34.000Z": "Today on @TheStoryFNC with @MarthaMacCallum , I discussed our ongoing response to COVID-19 and the unprecedented steps we are taking to keep Marylanders safe. It's going to take everybody working together to overcome this crisis and save thousands of lives.", "2020-03-19T14:08:29.000Z": "LIVE: COVID-19 Update - March 19, 2020 Governor Larry Hogan @GovLarryHogan COVID-19 Update - March 19, 2020 pscp.tv", "2020-03-19T13:32:32.000Z": "Today at 10 a.m., I will provide updates and announce additional measures to combat COVID-19 in Maryland. These announcements will be streamed live here on Twitter, as well as on Facebook ( @GovLarryHogan ) and Youtube (Governor Larry Hogan).", "2020-03-19T00:29:57.000Z": "It is with profound sadness that I announce the first death in Maryland as a result of the coronavirus pandemic. I ask all Marylanders to join me in praying for his family and loved ones during this difficult time:", "2020-03-18T18:04:47.000Z": "In a few minutes, I'll be joining @DanaPerino on the @dailybriefing to provide an update on Maryland's efforts to combat #COVID19 , and to discuss how the nation's governors are addressing this pandemic on the front lines.", "2020-03-18T15:18:19.000Z": "Although we are in uncertain times, the Hogan-Rutherford administration remains committed to working hard on behalf of all Marylanders and ensuring state government remains transparent and productive. #mdpolitics  #coronavirus  #COVID19", "2020-03-18T15:17:08.000Z": ". @MarylandBPW mtgs, usually held in the Governor's Reception Room on the second floor of the State House, typically attract dozens if not hundreds of visitors to advocate for state procurement projects, worth millions of taxpayer dollars. #mdpolitics", "2020-03-18T15:15:36.000Z": "As @GovLarryHogan continues leading MD's #COVID19 response thru bold & decisive action, I was called on to lead the @MarylandBPW .\n\nI've chaired many BPW mtgs in the past, but this is the 1st time in history that it's been held virtually as we cont to practice #socialdistancing .", "2020-03-18T11:43:27.000Z": "Tune in to @Morning_Joe at approx. 8:20, where I'll be discussing our state's aggressive, ongoing efforts to stop the spread of #COVID19 .", "2020-03-17T20:36:27.000Z": "LISTEN LIVE: @GovLarryHogan on @NPR All Things Considered. http:// wamu.org", "2020-03-17T20:22:35.000Z": "At approx. 4:35 today, I'll join @npratc to discuss the decisive actions we are taking in Maryland to address COVID-19. Listen live: WAMU | American University Radio WAMU 88.5 is Washington's NPR station, featuring local news on education, transportation, politics, and more as well as programs like 1A. wamu.org", "2020-03-17T19:04:18.000Z": ". @GovLarryHogan Issues Proclamation to Postpone April 28 Primary, Implement Vote-By-Mail System To Fill 7th Congressional District Seat https:// governor.maryland.gov/2020/03/17/gov ernor-hogan-issues-proclamation-to-postpone-april-28-primary-implement-vote-by-mail-system-to-fill-7th-congressional-district-seat/ ", "2020-03-17T16:58:40.000Z": "The First Lady and I are deeply saddened by the passing of Joan Pinsky after a hard-fought battle with cancer. @PaulPinsky , we are keeping you and your family in our prayers during this difficult time.", "2020-03-17T16:44:37.000Z": "We're all in this together, and it will take every one of us working together to keep people healthy and to save lives.", "2020-03-17T15:04:29.000Z": "LIVE: COVID-19 Announcement - March 17, 2020 Governor Larry Hogan @GovLarryHogan COVID-19 Announcement - March 17, 2020 pscp.tv", "2020-03-17T14:46:07.000Z": "Today at 11 a.m., I will be making announcements regarding additional actions to combat COVID-19 in Maryland. These announcements will be streamed live here on Twitter, as well as on Facebook ( @GovLarryHogan ) and Youtube (Governor Larry Hogan).", "2020-03-17T11:42:20.000Z": "We will get through this together, and everybody at every level is trying to do everything we possibly can to try to save lives and keep people safe.\n\nFor a comprehensive list of our actions, visit: https:// governor.maryland.gov/2020/03/16/gov ernor-hogan-orders-closure-of-bars-and-restaurants-announces-unprecedented-public-health-surge-to-combat-covid-19-crisis/  For health resources, visit http:// coronavirus.maryland.gov . Coronavirus - Maryland Department of Health Visit the Maryland Department of Health's official resource for the Coronavirus Disease 2019 (COVID-19) outbreak. coronavirus.maryland.gov", "2020-03-17T11:42:19.000Z": "Decision-makers at the federal, state and local levels are going to have to take drastic actions right now that may seem scary and may sound extreme. They will be terribly disruptive, but they are also absolutely necessary to save the lives of hundreds of thousands of Americans.", "2020-03-17T00:41:05.000Z": "On PBS @NewsHour , I provided an update on Maryland's ongoing, coordinated response to the COVID-19 pandemic. This unprecedented crisis is going to challenge and tax every resource we have, but I just want people to understand that we will get through this together.", "2020-03-16T23:12:19.000Z": "We cannot afford to wait to take action. While these measures may seem extreme, if we don't take them now, it could be too late.\n\nI will make whatever decisions and take whatever actions are necessary to save the lives of thousands of Marylanders.", "2020-03-16T21:34:49.000Z": "This evening, I'm joining @CNNSitRoom at approx. 6:05 and PBS @NewsHour at approx. 6:20 to discuss the unprecedented actions we are taking to combat the COVID-19 pandemic in Maryland.", "2020-03-16T17:50:54.000Z": "At the direction of Major General Timothy Gowen, as of Monday, 1,000 @MDNG soldiers and airmen are fully activated and another 1,200 guardsmen are currently in a state of enhanced readiness.", "2020-03-16T17:50:53.000Z": "Effective immediately, gatherings of more than 50 people, including social, community, spiritual, religious, recreational, leisure, and sporting gatherings, are prohibited at all locations and venues. These emergency orders carry the full force of law & will be strictly enforced.", "2020-03-16T17:50:52.000Z": "Today I announced additional actions to prevent the spread of COVID-19 in Maryland. They may sound extreme, and they will be terribly disruptive, but they are also absolutely necessary to save the lives of hundreds of thousands of people. Details here: https:// governor.maryland.gov/2020/03/16/gov ernor-hogan-orders-closure-of-bars-and-restaurants-announces-unprecedented-public-health-surge-to-combat-covid-19-crisis/ ", "2020-03-16T16:22:39.000Z": "Coronavirus Update: @GovLarryHogan Prohibits Evictions, Service Shutoffs During State Of Emergency Coronavirus Update: Gov. Hogan Prohibits Evictions, Service Shutoffs During State Of Emergency Gov. Larry Hogan announced a slew of measures to keep Marylanders afloat as the COVID-19 pandemic continues to spread across the state. baltimore.cbslocal.com", "2020-03-16T15:10:21.000Z": ". @GovLarryHogan prohibits evictions and service shutoffs during the state of emegency", "2020-03-16T15:07:19.000Z": ". @GovLarryHogan orders all bars, restaurants, movie theatres and gyms closed starting at 5 pm today. Carry out and drive-thrus can stay open", "2020-03-16T15:06:22.000Z": "2. Limiting gatherings to FIFTY people. Consistent with CDC guidelines for social distancing. #COVIDー19", "2020-03-16T15:05:50.000Z": "", "2020-03-16T15:04:56.000Z": "As we speak, @GovLarryHogan is announcing another series of major actions:", "2020-03-16T15:06:11.000Z": "WATCH LIVE: Maryland @GovLarryHogan holds a news conference to update the coronavirus situation in the state. https:// wjla.com/news/coronavir us/national-guard-at-maryland-state-house ", "2020-03-16T15:05:04.000Z": "#BREAKING  @GovLarryHogan speaking now at a news conference: \"We can expect the number of cases to dramatically and rapidly rise\" @wmar2news  #coronavirus  #COVID19", "2020-03-16T15:04:54.000Z": ". @GovLarryHogan : \"we have never faced anything like his before.\" Predicts the virus will be \"much worse\" than people currently understand", "2020-03-16T15:02:56.000Z": "LIVE: COVID-19 Announcement - March 16, 2020 Governor Larry Hogan @GovLarryHogan COVID-19 Announcement - March 16, 2020 pscp.tv", "2020-03-16T15:03:35.000Z": "Listen live: @GovLarryHogan announces new public health actions to prevent #COVID19 spread. WBAL 1090/FM 101.5 WBAL 1090/FM 101.5 player.listenlive.co", "2020-03-16T13:07:29.000Z": "Today at 11 a.m., I will be making announcements regarding additional actions to combat COVID-19 in Maryland. To maintain social distancing, it will be held on the lawn of Government House before a limited number of media.", "2020-03-15T18:30:54.000Z": "Maryland Democrats plow ahead with expensive education bill as legislative session may end early due to coronavirus https:// fxn.ws/2wbq6dr  #FoxNews Maryland lawmakers to end legislative session early due to coronavirus Maryland state lawmakers on Sunday announced that its legislative session will end Wednesday due to concerns about the coronavirus, and resume the last week of May for a special session. foxnews.com", "2020-03-15T17:06:24.000Z": "Anyone who hosts or is part of the crowds in bars this weekend is jeopardizing the health of others and must avoid any contact with family members or friends over the age of 60 or those with underlying health conditions.", "2020-03-15T17:06:23.000Z": "It is critical to public health and safety that bars, restaurants, and other businesses across the state comply with the law.", "2020-03-15T16:05:34.000Z": "It is critical to public health and safety that bars, restaurants, and other non-essential businesses across the state comply with the executive order prohibiting mass gatherings. Failure to follow this order is a crime, and will be enforced if businesses fail to comply.", "2020-03-15T16:02:05.000Z": "**NEWS** @GovLarryHogan is closing CASINOS, race tracks, simulcast betting facilities to prevent the spread of #COVID19 . https:// governor.maryland.gov/2020/03/15/gov ernor-hogan-issues-emergency-order-to-close-all-maryland-casinos-racetracks-and-simulcast-betting-facilities-to-prevent-the-spread-of-covid-19/ ", "2020-03-15T14:59:14.000Z": "The nation's top infectious disease expert doesn't rule out supporting a temporary US lockdown, saying he'd like to see a \"dramatic\" reduction in activity https:// cnn.it/2QheOLE", "2020-03-15T03:45:49.000Z": "It's becoming clearer that spread of #COVID19 by people who are asymptomatic or mildly symptomatic may be responsible for more transmission than previously thought; making control of the virus more difficult. Infected people without symptoms might be driving the spread of coronavirus more than we realized New studies in several countries and a large coronavirus outbreak in Massachusetts bring into question reassuring assertions by US officials about the way the novel virus spreads. cnn.com", "2020-03-15T14:04:30.000Z": "NOTICE: The @MDHealthDept 's COVID-19 resource page, http:// health.maryland.gov/coronavirus , has been upgraded to ensure accessibility and ease of use. It remains the State of Maryland's foremost resource for health information, including case counts and clinician guidance.", "2020-03-14T23:06:11.000Z": "#Breaking : Archbishop William E Lori has determined that to safeguard the well-being the faithful of the Archdiocese of Baltimore and to prevent further community spread of the virus, all public Masses are canceled until further notice. Full statement:", "2020-03-14T21:00:00.000Z": "\"We are all in this together, and we cannot stop the spread of this virus without each and every one of you doing your part. But I want you all to know that we will get through this together.\" - @GovLarryHogan", "2020-03-14T19:28:37.000Z": "\"This is going to be the most important challenge of our lives, but this will also be the most important thing we ever do.\" \n- @GovLarryHogan to the leaders of all Maryland Counties and Baltimore City at the COVID-19 Coronavirus Update Meeting", "2020-03-14T17:36:55.000Z": ". @GovLarryHogan enacts emergency order to expand child care access for critical personnel during state of emergency Hogan enacts emergency order to expand child care access for critical personnel during state of... Governor Larry Hogan has enacted an emergency order to expand child care access for critical personnel during the state of emergency. wmar2news.com", "2020-03-14T17:17:12.000Z": "Today I enacted an emergency order to ensure that child care services are available for providers of health care, emergency medical services, and law enforcement personnel while schools are closed to prevent the spread of COVID-19. Learn more: https:// governor.maryland.gov/2020/03/14/gov ernor-hogan-enacts-emergency-order-to-expand-access-to-child-care-during-covid-19-state-of-emergency/ ", "2020-03-14T17:17:11.000Z": "Our state has taken major and unprecedented actions to protect the health, the safety, and the welfare of the people of Maryland. As we continue to operate under a state of emergency, we are committed to doing everything in our power to maintain our essential services.", "2020-03-13T23:38:00.000Z": "Tonight, I appeared live on @CNN to discuss Maryland's ongoing response to COVID-19. In a time of crisis like this, there can't be any Republicans or Democrats. We're all Americans and we've all got to act with one voice and take the actions that are necessary.", "2020-03-13T21:01:21.000Z": "With Maryland in a state of emergency due to the COVID-19 pandemic, the legislature's sole focus should be those measures immediately necessary to protect the public health and safety of Marylanders. The General Assembly must take these three actions no later than Tuesday:", "2020-03-13T18:59:52.000Z": "Comptroller @PeterFranchot Says Focus Should Be On Coronavirus, Not Tax Increase In Annapolis #MDGA20 Franchot Says Focus Should Be On Coronavirus, Not Tax Increase In Annapolis Maryland Comptroller Peter Franchot said the focus in Annapolis should be the public health concern and not a tax increase to fund the Kirwan Commission's recommendations. wbal.com", "2020-03-13T18:24:01.000Z": "Gov. Hogan is live now on @MSNBC talking to @KatyTurNBC about Maryland's ongoing response to #COVIDー19 .", "2020-03-13T17:49:41.000Z": "At approximately 2:15 today, I'll appear live on @MSNBC with @KatyTurNBC to discuss the latest developments in our ongoing response to COVID-19.", "2020-03-13T16:41:11.000Z": "Today I convened a call with county leaders to provide updates and guidance on the statewide response to COVID-19. We are going to continue working closely with all levels of government as we take a comprehensive, collaborative approach to this public health emergency.", "2020-03-13T16:18:11.000Z": "\"Democrat Comptroller Peter Franchot: Tax Hikes Are 'The Last Thing' Maryland Needs During Crisis\" https:// changemaryland.org/news/democrat- comptroller-peter-franchot-tax-hikes-are-the-last-thing-maryland-needs-during-crisis/ ", "2020-03-12T20:53:44.000Z": "Here is the full release the State Superintendent will put out shortly.", "2020-03-12T20:24:49.000Z": "#COVIDー19 : State Superintendent Karen Salmon is directing that all public schools across Maryland will be closed effective MONDAY 3/16 to FRIDAY 3/27.", "2020-03-12T20:15:32.000Z": "Watch @GovLarryHogan 's Press Conference Live: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: COVID-19 Announcement - March 12, 2020 https:// pscp.tv/w/cTk-SzFheWpW Z3hwdmJlRXB8MXlvS01hTE55TnBLUbNIi9zAnzJo3iuobeWlcdAujfnrj93NfzxAwOgCt4pt?t=44s ", "2020-03-12T16:52:13.000Z": "#BREAKING : Maryland has its first case of COVID-19 community transmission, according to Gov. Larry Hogan's office.", "2020-03-12T16:46:20.000Z": "Maryland has its first case of #COVIDー19 community transmission. We are in a new phase now. Governor Hogan will announce major actions to protect public health at 4p. Quote Tweet Mike Ricci @riccimike #COVD19 update from Annapolis: @GovLarryHogan will have a release out shortly and will speak at the State House later today.", "2020-03-12T16:45:10.000Z": "Today at approximately 4 p.m., I will be announcing to Marylanders major actions we are taking to protect public health and safety. The event will be streamed live here on Twitter as well as on Facebook ( @GovLarryHogan ) and Youtube (Governor Larry Hogan).", "2020-03-12T16:45:09.000Z": "Today we are announcing the first case of community transmission of COVID-19 in Maryland. The patient, whose case was first announced last night, is a Prince George's County resident who had no known exposure to coronavirus through travel or an infected individual.", "2020-03-12T16:41:36.000Z": "#COVD19 update from Annapolis: @GovLarryHogan will have a release out shortly and will speak at the State House later today.", "2020-03-12T15:19:52.000Z": "Gov. Hogan is currently meeting with the Maryland Coronavirus Response Team. We expect to make additional announcements today.", "2020-03-12T00:07:30.000Z": "Today I announced a number of new actions taken by state agencies to help mitigate the potential spread of this virus, including limiting foot traffic at the @MD_MVA and reducing visitation at correctional facilities. Details here: https:// governor.maryland.gov/2020/03/11/upd ate-governor-hogan-announces-new-cases-of-covid-19-in-maryland-additional-actions/ ", "2020-03-12T00:07:29.000Z": "We have confirmed three additional cases of COVID-19 in Maryland, and @MDHealthDept has begun thorough investigations. The State of Maryland now has 12 confirmed cases of novel coronavirus. Learn more: https:// governor.maryland.gov/2020/03/11/upd ate-governor-hogan-announces-new-cases-of-covid-19-in-maryland-additional-actions/ ", "2020-03-11T20:03:04.000Z": "LIVE COVID-19 Update - March 11, 2020 Governor Larry Hogan @GovLarryHogan COVID-19 Update - March 11, 2020 pscp.tv", "2020-03-11T19:36:09.000Z": "Today at approximately 4 p.m., I will give an update on Maryland's coronavirus response at the CHART Statewide Operations Center. It will be streamed live here on Twitter as well as on Facebook ( @GovLarryHogan ) and Youtube (Governor Larry Hogan).", "2020-03-11T17:05:04.000Z": "Once we became aware of this case, we acted swiftly to coordinate with officials both here in Anne Arundel County and in Montana, and I have contacted @GovernorBullock . At this time, Maryland has nine positive confirmed cases of COVID-19.", "2020-03-11T17:05:03.000Z": "Officials have confirmed that a Montana resident visiting Anne Arundel Co. has tested positive for COVID-19. ***While this will be classified as a Montana case***, @MDHealth and @AAHealth will take the lead on the investigation.", "2020-03-11T00:30:07.000Z": "We are deeply saddened to learn of the passing of Capt. Moises A. Navas, a Special Operations officer from Germantown. A Purple Heart recipient, Captain Navas was one of our true heroes and perfectly embodied the mission of the United States Marine Corps.", "2020-03-10T21:45:41.000Z": "This afternoon, I met with leaders from Maryland's long-term care community. The state is taking every precaution to protect seniors and retirees, and today we announced new guidance for long-term care facilities to help protect older people: https:// governor.maryland.gov/2020/03/10/gov ernor-hogan-announces-ninth-positive-case-of-covid-19-in-maryland-issues-new-guidance-for-long-term-care-facilities/ ", "2020-03-10T21:41:53.000Z": "State officials have confirmed the 9th positive case of COVID-19 in Maryland. It is a Montgomery County resident-a woman in her 60s-who contracted the virus while traveling overseas. This case is connected to the same Egyptian cruise as 5 of the state's previous positive cases.", "2020-03-10T21:41:52.000Z": "Today I convened an emergency meeting of my Cabinet to review the state's ongoing response to COVID-19. This problem continues to evolve and escalate rapidly, and I am fully committed to being transparent, providing the facts, and keeping Marylanders informed.", "2020-03-10T01:43:19.000Z": "As chair of the @NatlGovsAssoc , today I visited the @WhiteHouse Situation Room for a call with 48 governors for updates on COVID-19. I want to again thank @VP & federal officials for their thorough communication to governors, who are facing this issue on the front lines.", "2020-03-10T00:44:09.000Z": "State officials have identified Maryland's sixth confirmed case of COVID-19, a PG County resident who contracted the virus during out-of-state travel. There appear to be no major concerns over exposure risk to the community & no connection to the previous positive cases.", "2020-03-09T19:41:11.000Z": "LIVE: COVID-19 Update - March 9, 2020 0:01 Governor Larry Hogan @GovLarryHogan COVID-19 Update - March 9, 2020 pscp.tv", "2020-03-09T19:30:25.000Z": "Gov. Hogan's press conference coming up shortly will include updates on #COVID19 cases, announcements re: additional steps we are taking, and guidance for people over 60.\n\nThere will be a good amount of information. He'll be joined by General Assembly leaders and county execs.", "2020-03-09T16:31:24.000Z": "Today I joined @CNN to provide an update on Maryland's response to COVID-19. As chairman of the @NatlGovsAssoc , I'm focused on making sure we all speak with one voice and make decisions based on the facts on the ground.", "2020-03-09T13:56:11.000Z": "I'll deliver a brief COVID-19 update at the beginning of my remarks at the #IAFFLegCon . Watch live at 10:05: IAFF 2020 Legislative Conference (Full) youtube.com", "2020-03-08T21:15:01.000Z": "State officials have identified two additional positive cases of novel coronavirus in Maryland. Our state now has five total confirmed cases, and 62 negative tests for COVID-19. I will hold a press conference tomorrow at 3:30 p.m. to provide an update to Marylanders.", "2020-03-08T16:06:22.000Z": "This morning, I joined @MeetThePress to discuss Maryland's ongoing response to COVID-19, the novel coronavirus. We have some of the best health operations in the world located in our state, and we have the necessary resources to keep Marylanders safe.", "2020-03-08T14:15:25.000Z": "Here's @GovLarryHogan on @MeetThePress talking about the response to the #coronavirus  #COVID19 . Quote Tweet Meet the Press @MeetThePress Full Hogan: 'This thing is escalating so rapidly' as coronavirus spreads https:// nbcnews.to/2vPHXq7", "2020-03-08T13:12:30.000Z": "Tune in this morning to @MeetThePress , where I provided updates on Maryland's preparedness, mobilization, and response to COVID-19.", "2020-03-08T12:00:02.000Z": "This morning I'm joining @MeetThePress to discuss Maryland's ongoing response to COVID-19. Check your local listings for details: https:// nbcnews.com/meet-the-press /watch-nbc-s-meet-press-chuck-todd-your-area-n961866  Quote Tweet Meet the Press @MeetThePress THIS SUNDAY: @GovLarryHogan on Maryland's state of emergency after three people test positive for coronavirus. #MTP", "2020-03-07T13:38:00.000Z": "I have issued a directive requiring all state health insurers to waive costs associated with testing for COVID-19. Our highest priority is keeping our residents safe. Learn more: https:// governor.maryland.gov/2020/03/06/cor onavirus-update-governor-hogan-announces-new-directive-requiring-state-insurers-to-waive-costs-for-testing-provides-additional-details-on-confirmed-cases/ ", "2020-03-07T00:30:08.000Z": "THIS SUNDAY: @GovLarryHogan on Maryland's state of emergency after three people test positive for coronavirus. #MTP", "2020-03-06T23:21:00.000Z": ". @GovLarryHogan COVID-19 Update - March 6, 2020 Governor Larry Hogan @GovLarryHogan COVID-19 Update - March 6, 2020 pscp.tv", "2020-03-06T20:09:08.000Z": "I especially want to thank @SpeakerAJones and @SenBillFerg for their leadership on this matter. As our state faces a new and evolving challenge, its leaders must stand shoulder to shoulder in our efforts to keep Marylanders safe.", "2020-03-06T20:09:07.000Z": "I want to commend the General Assembly's swift action on our emergency legislation to access rainy day funds to address COVID-19. These funds will be essential as we continue to mobilize and respond to this ongoing public health event.", "2020-03-05T23:55:30.000Z": "We have been actively preparing for this situation over the last several weeks across all levels of government. I encourage all Marylanders not to panic, but to take this seriously and to stay informed as we continue to provide updates.", "2020-03-05T23:55:29.000Z": "The state's Public Health Laboratory in Baltimore has confirmed the first three positive cases of novel coronavirus in Maryland. The patients, who contracted the virus while traveling overseas, are in good condition.", "2020-03-05T19:18:51.000Z": ". @GovLarryHogan Leads @NoLabelsOrg Bicameral Meeting With @ProbSolveCaucus : https:// anamericaunited.org/news/030520/", "2020-03-03T15:26:37.000Z": "Governor @LarryHogan Fights For Hardworking Marylanders As Democrats Revive Failed Policies Of Tax King Martin O'Malley => https:// rga.org/hogan-fights-h ardworking-marylanders-democrats-revive-failed-policies-tax-king-martin-omalley/   #MDPolitics Hogan Fights For Hardworking Marylanders As Democrats Revive Failed Policies Of Tax King Martin... Democrats in the Maryland General Assembly are clearly nostalgic for the days of tax-and-spend liberal Martin O'Malley, but Governor Larry Hogan and the people of Maryland are fighting back. O'Mall... rga.org", "2020-03-03T14:55:37.000Z": "Today only, for the first time in history, Marylanders can visit Francis Scott Key's original manuscript of \"The Star-Spangled Banner\" alongside George Washington's 1783 resignation speech here at the Maryland State House.", "2020-03-03T15:01:39.000Z": "5,000 emails in three hours: Blast of opposition to Md. bill expanding sales tax #MDPolitics  #MDGA20 5,000 emails in three hours: Blast of opposition to Md. bill expanding sales tax The Democratic House bill would tax most professional services, raising billions for education. washingtonpost.com", "2020-03-02T19:15:46.000Z": "On behalf of all my colleagues, I want to thank @POTUS for putting @VP in charge of the federal response. It's good to have a former governor running this coordinated response as state and local officials lead our preparedness efforts on the front lines.", "2020-03-02T19:15:45.000Z": "I just left the White House Situation Room, where @VP led a teleconference with top federal officials and the nation's governors regarding the coordinated federal-state response to COVID-19.", "2020-02-28T21:16:26.000Z": "If those out-of-touch politicians get their way, it will be the largest tax hike in Maryland history - more than all 43 of O'Malley's tax hikes combined.", "2020-02-28T21:16:25.000Z": "Over the past five years, we've had one of the greatest economic turnarounds in the country. However, legislators are trying to pass a massive $2.6 billion tax hike that would reverse all of it.", "2020-02-28T18:01:18.000Z": "People are being shot on the streets of Baltimore City every single day - yet legislators are deliberately ignoring solutions backed by 9 out of 10 Marylanders.", "2020-02-28T01:08:15.000Z": "Thank you @GovLarryHogan , appreciate your leadership & support. While the threat of Coronavirus to the American public remains low, we will continue to bring the full resources of the federal government & work closely with state & local leaders to respond to this virus in the US. Quote Tweet Governor Larry Hogan @GovLarryHogan Prior to today's press conference on Maryland's preparedness measures, I spoke to @VP Pence, who is leading the federal response to coronavirus. As a former governor, he understands the importance of a coordinated response & we agreed to keep in close contact in the weeks ahead.", "2020-02-27T23:52:18.000Z": "Prior to today's press conference on Maryland's preparedness measures, I spoke to @VP Pence, who is leading the federal response to coronavirus. As a former governor, he understands the importance of a coordinated response & we agreed to keep in close contact in the weeks ahead.", "2020-02-27T21:18:12.000Z": "LIVE on #Periscope : Public Health Announcement - February 27, 2020 Governor Larry Hogan @GovLarryHogan Public Health Announcement - February 27, 2020 pscp.tv", "2020-02-27T20:45:30.000Z": "At 4 p.m., I will hold a press conference at @MDMEMA headquarters to provide an update on Maryland's preparedness for COVID-19, novel coronavirus.", "2020-02-25T15:49:49.000Z": "Getting a haircut this morning before the legislature passes the haircut tax!", "2020-02-20T20:30:44.000Z": "Hogan reintroducing crime bills as emergency legislation #MDGA20  #MDPolitics Hogan reintroducing crime bills as emergency legislation Gov. Larry Hogan is pushing his crime package and chastises the General Assembly for not getting his four bills passed. wbaltv.com", "2020-02-20T16:30:12.000Z": "Chart unveiled by @GovLarryHogan urging state legislators to enact his crime bills before end of 2020 session in April. #mdpolitics  @FOXBaltimore", "2020-02-20T18:03:42.000Z": "We don't want to hear any more excuses. There cannot be any more delays. We need to stop playing politics. Pass these bills and get them to my desk so we can begin to stop the killings and get these violent shooters and murderers off the streets.", "2020-02-20T18:03:41.000Z": "This morning, we are redesignating our violent crime reduction package as emergency legislation, allowing the legislature to act on these bills immediately, so that they can be signed into law immediately, and so that they can take effect immediately: https:// governor.maryland.gov/2020/02/20/gov ernor-hogan-redesignates-violent-crime-bills-as-emergency-legislation-calls-on-lawmakers-to-take-immediate-action/ ", "2020-02-20T18:04:19.000Z": "'There Has Been No Action' | @GovLarryHogan Calls Out Maryland Legislators Lack Of Action On Proposed Crime Bills #MDGA20  #MDPolitics Gov. Larry Hogan Calls Out Maryland Legislators Lack Of Action On Proposed Crime Bills Gov. Larry Hogan called out Maryland legislators Thursday morning for a lack of action on passing several bills he believes will help address violent crime in Baltimore and around the state. baltimore.cbslocal.com", "2020-02-20T16:44:04.000Z": "In his news conference @GovLarryHogan criticizes lawmakers for failing to address his crime bills \"People are being shot every single day and every single night in Baltimore City.\"", "2020-02-20T16:43:34.000Z": "\"People are being shot every single day and every single night in Baltimore\" says @GovLarryHogan who expresses frustration with lawmakers on movement on his #crime bill", "2020-02-20T16:40:02.000Z": "WATCH LIVE | Gov. Larry Hogan holding a press conference to discuss new laws to combat violent crime https:// cbsloc.al/39Rhpn0", "2020-02-20T16:40:10.000Z": "LIVE: Crime Announcement - February 20, 2020 Governor Larry Hogan @GovLarryHogan Crime Announcement - February 20, 2020 pscp.tv", "2020-02-18T22:20:24.000Z": "Today I welcomed over a dozen therapy dogs and their handlers to the State House to express my strong support for bipartisan legislation to provide therapy dogs for children testifying in Maryland courts: https:// governor.maryland.gov/2020/02/18/pho to-release-governor-hogan-hosts-therapy-dogs-at-state-house-in-support-of-court-dog-and-child-witness-programs/ ", "2020-02-18T15:38:16.000Z": "An overwhelming majority of Marylanders and residents of Baltimore City strongly support our legislation. Why are city leaders and legislators continually failing to take these critical, life-saving actions? The time for action is now.", "2020-02-18T15:38:15.000Z": "Baltimore Mayor Jack Young yesterday described passing the recommendations of the Kirwan Tax Hike Commission \"a matter of life and death.\" What really is a matter of life and death is passing our crime bills to get the violent criminals off the streets. 'A matter of life and death': Maryland lawmakers tackle Kirwan education funding bill with marathon... Maryland lawmakers have begun their official review of a bill that would revamp the state's public schools with expensive additional programs. baltimoresun.com", "2020-02-13T13:00:00.000Z": "An overwhelming majority of Marylanders strongly support our plan for tougher sentences for violent offenders. Shockingly, even with more than 300 murders every year, city leaders and lawmakers in Annapolis have continually failed to take these actions. #MDGA20  #MDPolitics", "2020-02-12T19:53:21.000Z": "My statement on today's shooting in Northeast Baltimore:", "2020-02-12T16:39:27.000Z": "The most important legislation of this session are our bills to hold violent criminals more accountable so we can stop the shootings and murders in Baltimore City. There can be no more excuses and no more delays by the legislature. #MDPolitics  #MDGA20", "2020-02-12T14:29:24.000Z": "Ever woken up on a beautiful sunny morning & thought to yourself, \"I wonder what the State House Dome looks like right now?\" @MDDGS now has you covered with this live stream: https:// dgs.maryland.gov/Pages/videojs_ test_video.html?fbclid=IwAR3pnVuE5p5CrHbdj9b7Fbe5nV4Wkisv9rX8D4AIuwMkZ-bKEjLRl-_0joQ ", "2020-02-11T20:30:00.000Z": ". @GovLarryHogan : \"This is an urgent crisis. If the legislature does nothing else over the next 55 days, they must pass our proposals to finally put an end to the bloodshed in our streets. There can be no more excuses and no more delays.\" #MDGA20 Governor Hogan responds to recent violence in Baltimore (WBFF) -- On Tuesday morning, Maryland Governor Larry Hogan tweeted about the impact of the recent violence in Baltimore City. \"Even as city residents are pleading for a ceasefire, the out-of-control... foxbaltimore.com", "2020-02-11T03:03:51.000Z": "It was my immense honor to dedicate statues of Harriet Tubman and Frederick Douglass in our historic state house this evening, ensuring that the lives & legacies of two of Maryland's most influential leaders are permanently & formally enshrined in the history of our great state.", "2020-02-10T22:36:58.000Z": "My statement on the Trump administration's proposed cuts to Chesapeake Bay funding:", "2020-02-10T20:39:16.000Z": "\"Governors are working together in a bipartisan way...making progress and finding solutions to the serious problems that are facing us.\" - NGA Chair Maryland @GovLarryHogan  #WeTheStates", "2020-02-10T21:37:02.000Z": ". @GovLarryHogan Leads Successful Bipartisan Meeting of Nation's Governors in Washington https:// anamericaunited.org/news/021020/", "2020-02-09T11:52:21.000Z": "Getting ready for Day 2 of the #WeTheStates Winter Meeting with a quick look back at Day 1. Here NGA Chair and Maryland @GovLarryHogan talks about applying the power of governors to fixing American's #infrastructure .", "2020-02-09T23:30:56.000Z": "Sincere thanks to officials from @CDCgov and @HHSgov for today's briefing on the novel coronavirus outbreak. The nation's governors are taking this matter very seriously, and states stand ready to respond to this pressing public health concern. #WeTheStates", "2020-02-09T20:11:54.000Z": "All of our states have struggled to meet the challenges posed by disasters that impact our nation. At our third @NatlGovsAssoc plenary, we shared strategies to meet those challenges head-on and prepare our citizens for the resiliency challenges of the future. #WeTheStates", "2020-02-09T21:16:05.000Z": "Governors throughout the nation have identified workforce development as a top priority. In the fourth and final plenary of our @NatlGovsAssoc Winter Meeting, we discussed their creative strategies to identify, train, and employ the next wave of talent. #WeTheStates", "2020-02-09T14:43:15.000Z": "During #WeTheStates Day 1, MD First Lady Yumi Hogan hosted governors' spouses in Annapolis. @UMMC Dr. Steven Czinn spoke on art therapy's benefits for pediatric patients.", "2020-02-08T20:50:31.000Z": "It was an honor to welcome our nation's chief diplomat, Secretary of State Mike Pompeo, to deliver the keynote address to our nation's governors this afternoon. #WeTheStates", "2020-02-08T19:41:14.000Z": "At the first plenary session of our @NatlGovsAssoc Winter Meeting, we explored domestic and international innovations for modernizing America's infrastructure. #WeTheStates", "2020-02-08T18:03:05.000Z": "The goal of our initiative is not only to highlight the great work that the governors are doing in their states, but also to bring together thought leaders from government, business, non-profits, and academia", "2020-02-08T18:01:18.000Z": "My fellow governors are upgrading roads, bridges, and mass transit systems-they're improving airports and ports, fixing aging water systems, and making real progress. #WeTheStates", "2020-02-08T17:47:41.000Z": "Today at 1 p.m., I'll lead the first plenary session of our @NatlGovsAssoc Winter Meeting to discuss my national initiative to fix America's crumbling infrastructure. Watch live: National Governors Association 2020 Winter Meeting - February 8, 2020... #WeTheStates - Live Saturday, February 8, at 1pm ET. The NGA Winter Meeting provides a forum for governors and other state leaders to discuss policy successe... youtube.com", "2020-02-08T15:56:15.000Z": "Great to meet with Governor @PanchDominguez and Governor @cmendozadavis of Baja California Sur, along with representatives from the Conferencia Nacional de Gobernadores- Mexico's counterpart to our @NatlGovsAssoc . #WeTheStates", "2020-02-08T14:00:01.000Z": "More than 100 new jobs are coming to the Eastern Shore with @ChoptankTrans in Easton! https:// open.maryland.gov/blog/choptank- transport-plans-major-expansion-eastern-shore/?fbclid=IwAR0-SJ78O1_VbTDl_qBOepilQ4QYKSuCdtJVKYD_xljX25IBWZY2OgXi0WI  via @MDBiz Choptank Transport plans major expansion on Eastern Shore Local logistics provider Choptank Transport is expanding its footprint in Maryland and adding more than a hundred new jobs on the Eastern Shore. open.maryland.gov", "2020-02-07T22:32:07.000Z": "This afternoon, I met with top Canadian leaders, including Ontario Premier @FordNation , New Brunswick Premier Blaine Higgs, and Deputy Prime Minister of Canada @cafreeland . More than 205k Maryland jobs depend on trade and investment with Canada, which is our top export partner.", "2020-02-07T20:05:01.000Z": "Pleased to join Maryland's @GovLarryHogan for a meeting in Washington D.C. with @VictorFedeli . This April in Toronto, Governor Hogan and I will be hosting a @NatlGovsAssoc infrastructure study tour on Public-Private Partnerships.", "2020-02-07T21:04:45.000Z": "Aujourd'hui à Washington, D.C., la vice-première ministre Chrystia Freeland a rencontré le gouverneur Larry Hogan, président de la National Governors Association.", "2020-02-07T13:53:24.000Z": "Watch my interview at the @politico 10th Annual State Solutions Conference live at 9 a.m.: 10th Annual State Solutions politico.com", "2020-02-06T17:00:00.000Z": "It is time for the General Assembly to stop ignoring the overwhelming majority of its citizens and bring our nonpartisan redistricting bill to the floor of the House and Senate for an up or down vote. #FairMaps  #MDGA20", "2020-02-06T15:22:57.000Z": "We have absolutely no tolerance for the violence committed against two Anne Arundel County Police detectives last night. These brave officers are now in stable condition, and all Marylanders are praying for their full and speedy recovery.", "2020-02-05T22:02:12.000Z": ". @GovLarryHogan uses State of the State address to focus on crime in Baltimore, partisanship Hogan uses State of the State address to focus on crime in Baltimore, partisanship Republican governor urges cooperation in contrast with the rancor consuming Washington. washingtonpost.com", "2020-02-05T17:32:37.000Z": "And so today, with confidence in the inherent wisdom and good judgment of the people of Maryland & the people of our nation, I ask you, my partners in this legislature on both sides of the aisle, to continue forward with me on this path. #MDSotS", "2020-02-05T17:28:17.000Z": "People are being shot every single day in Baltimore City. This is an urgent crisis, and we have an obligation to do something about it right now. There can be no more excuses and no more delays. #MDSotS", "2020-02-05T17:26:36.000Z": "Every issue I have talked about here today is important and worthy of debate and discussion. But none of them are nearly as important as addressing the out-of-control violent crime, the shootings and murders that are destroying Baltimore City. #MDSotS", "2020-02-05T17:24:28.000Z": "\"Our state has the unfortunate distinction of having the most #gerrymandered districts in America... when it comes to free and fair elections we are failing to live up to that legacy.\" says @LarryHogan  @GovLarryHogan", "2020-02-05T17:25:03.000Z": "On redistricting reform, @GovLarryHogan says, 'American democracy literally began right here in this very place. And yet when it comes to free and fair elections, we are failing to live up to that proud legacy.'", "2020-02-05T17:24:12.000Z": "In this highly partisan time in America, the General Assembly has a chance to do the right thing-to strike a win for democracy, fairness, & decency by finally, after 5 years, bringing the nonpartisan redistricting bill to the floor of this body for an up or down vote. #MDSotS", "2020-02-05T17:22:31.000Z": "To ensure that public officials are worthy of the trust that the people have placed in them, we introduced the \"Ethics and Accountability in Government Act\" to strengthen and toughen state ethics laws. #MDSotS", "2020-02-05T17:22:13.000Z": "Maryland has made historic progress in Bay restoration, but we cannot and should not have to do it alone. I intend to keep pushing our upstream neighbors and federal partners to ensure that they are doing their fair share to protect this national treasure. #MDSotS", "2020-02-05T17:20:39.000Z": "We have taken a balanced and inclusive approach to infrastructure. #MDSotS", "2020-02-05T17:18:52.000Z": "I stand here today ready and willing to continue working alongside you to ensure that every single child in our state has access to a great education, regardless of what neighborhood they happen to grow up in. #MDSotS", "2020-02-05T17:15:06.000Z": "We proposed the \"Retirement Tax Reduction Act of 2020,\" which will provide more than $1 billion in tax relief over five years. #MDSotS", "2020-02-05T17:14:10.000Z": "More businesses are now open and more people are working than ever before in the history of our state. We ushered in the largest decline in unemployment ever recorded and had one of the greatest economic turnarounds in America. #MDSotS", "2020-02-05T17:13:09.000Z": "The people of Maryland, regardless of their party affiliation, are overwhelmingly pleased with the job that we have been doing. Maryland has indeed been setting a shining example for the rest of America. #MDSotS", "2020-02-05T17:12:26.000Z": "As we gather here once again in this historic place to take the first steps of this new decade, we do so with optimism and confidence in our collective ability to continue changing Maryland for the better. #MDSotS", "2020-02-05T17:12:07.000Z": "Governor Hogan notes he is the first Maryland governor to start a State of the State speech by saying: \"Madame Speaker\" -- a line that gets cheers and applause.\n\nHe also recognizes the late Speaker Mike Busch and Senate President Emeritus Mike Miller, who is battling cancer.", "2020-02-05T17:06:40.000Z": "LIVE: State of the State Address 2020 Governor Larry Hogan @GovLarryHogan State of the State Address 2020 pscp.tv", "2020-02-05T17:07:31.000Z": "As we come together once again for this time-honored tradition, it is my distinct privilege to be the first Maryland governor to begin a State of the State address by saying: Madam Speaker. #MDSotS", "2020-02-05T13:59:47.000Z": "Governor Larry Hogan will deliver his 2020 State of the State Address to the Maryland General Assembly today at 12pm, you can watch it on-air on MPT or anywhere via https:// mpt.org/stateofthestat e/  Governor Hogan's address will re-air tonight at 7 on MPT.", "2020-02-04T22:21:43.000Z": "Tomorrow I will deliver my sixth State of the State Address, which will be broadcast live at noon on my Facebook and Twitter accounts and on @marylandpubtv . #MDSotS", "2020-02-03T20:47:37.000Z": "Pleased to be joined by @SpeakerAJones and @SenBillFerg for the first bill signing of 2020, to enact SB 251.", "2020-02-03T15:28:54.000Z": "This morning, I joined local leaders for breakfast at the Broadway Diner in Baltimore City for a productive discussion on crime and economic development.", "2020-02-02T21:00:00.000Z": "This Super Bowl Sunday, we're throwing the flag on out-of-touch politicians in Annapolis who have repeatedly failed to bring our redistricting reform bill to the floor for an up or down vote.\n\nVoters should be able to choose their representatives, not the other way around.", "2020-01-31T14:46:22.000Z": "MUST READ: Harvard Pollster Shows \"Americans Wanting\" For \"Independent\" Leadership​ ​ https:// anamericaunited.org/news/independe nt-leadership-volpe/ ", "2020-01-29T16:46:49.000Z": "As @NatlGovsAssoc chairman, I worked to bring America's governors together to support #USMCA . By creating jobs and a more level playing field, #USMCA will help ensure future prosperity for Maryland and the nation. This is momentous news for our workers and manufacturers.", "2020-01-29T15:56:02.000Z": "It's time for the General Assembly to listen to the overwhelming majority of Marylanders and repeal their misguided legislation. Quote Tweet Governor Larry Hogan @GovLarryHogan Today we introduced the Universal School Start Act of 2020 which will repeal the legislature's misguided 2019 bill, and return our state to what the citizens actually want, and have been demanding for years: the return of the school start to after Labor Day. Show this thread", "2020-01-29T15:14:21.000Z": "Today, @GovLarryHogan is announcing the Universal School Start Act of 2020, to return the start of school to after Labor Day.", "2020-01-29T15:08:46.000Z": "LIVE: Board of Public Works Meeting - January 29, 2020 Governor Larry Hogan @GovLarryHogan Board of Public Works Meeting - January 29, 2020 pscp.tv", "2020-01-29T13:20:16.000Z": ". @GovLarryHogan announced that the ongoing Bay Bridge Construction project is set to be completed one-year ahead of schedule Bay Bridge Project to be completed ahead of schedule; All lanes to open by summer 2020 Maryland Governor Larry Hogan announced Tuesday that the ongoing Bay Bridge Construction project is set to be completed one-year ahead of schedule. All lanes projected to be in operation just in time... wjla.com", "2020-01-28T21:24:04.000Z": "Thank you, @DNC Chairman @TomPerez , for your endorsement of nonpartisan redistricting! I hope you'll work with us to fix the worst gerrymandering in America right here in your home state of Maryland. Quote Tweet Tom Perez @TomPerez Thank you, governor. If we want fair elections we must start with fair maps. twitter.com/GovEvers/statu", "2020-01-24T12:30:00.000Z": "\"Mr. Hogan has championed major transit improvements in the Washington suburbs, including increased Metro funding and building the Purple Line light transit rail project.\" Opinion | Maryland commuters want less traffic. So why are Democrats opposing Hogan's plan? The governor is on the side of the silent majority. washingtonpost.com", "2020-01-23T23:05:10.000Z": ". @WashingtonPost Editorial: Maryland commuters want less traffic. So why are Democrats opposing Hogan's plan? Opinion | Maryland commuters want less traffic. So why are Democrats opposing Hogan's plan? The governor is on the side of the silent majority. washingtonpost.com", "2020-01-23T21:21:12.000Z": ". @WJZ : New @kroger Fulfillment Center In Frederick County To Create More Than 400 Jobs New Kroger Fulfillment Center In Frederick County To Create More Than 400 Jobs The automatic facility will be equipped with robots to help assemble orders. baltimore.cbslocal.com", "2020-01-23T14:30:42.000Z": ". @KrogerNews , partnering with @Ocado , has announced plans to construct a 350,000 square ft Customer Fulfillment Center in Frederick County, bringing hundreds of jobs to the region. Maryland truly is open for business! http:// governor.maryland.gov/2020/01/23/kro ger-ocado-select-maryland-for-new-high-tech-fulfillment-center/ ", "2020-01-23T16:42:54.000Z": ". @GovLarryHogan led our #infrastructure summit in San Francisco this week: \"My goal is to harness that strength and come up with all the best ideas to tackle the infrastructure issue that is so fundamental to our economy, environment, and our way of life.\" https:// governor.maryland.gov/2020/01/23/gov ernor-hogan-leads-san-francisco-summit-focused-on-eliminating-red-tape-and-integrating-smart-technology/ ", "2020-01-23T16:52:44.000Z": "This week we were joined by representatives from 22 states as part of my @NatlGovsAssoc infrastructure initiative to discuss ways to more quickly and effectively deliver essential infrastructure projects and integrate smart technologies. http:// governor.maryland.gov/2020/01/23/gov ernor-hogan-leads-san-francisco-summit-focused-on-eliminating-red-tape-and-integrating-smart-technology/ ", "2020-01-23T16:18:11.000Z": "Vox: . @GovLarryHogan 's Bipartisan Health Care Success Provides \"Answer to America's Health Care Cost Problem\" https:// anamericaunited.org/news/012320/", "2020-01-22T16:45:56.000Z": "I am absolutely heartbroken to learn that one of my personal heroes, Hall of Fame high school basketball coach Morgan Wootten, passed away yesterday. My full statement: https:// governor.maryland.gov/2020/01/22/sta tement-on-the-passing-of-coach-morgan-wootten/ ", "2020-01-21T13:04:45.000Z": "I am calling on leaders at every level of government to join our efforts to impose tougher sentences for those who repeatedly commit these violent crimes.", "2020-01-21T13:04:44.000Z": "An overwhelming majority of Marylanders strongly support our plan for tougher sentences for violent offenders. Shockingly, even with more than 300 murders every year, city leaders and lawmakers in Annapolis have continually failed to take these actions.", "2020-01-20T19:34:45.000Z": "We will continue to pursue and prosecute every individual who assaulted this officer to the fullest extent of the law. This disgusting incident is yet another example of the violence that has become far too common in Baltimore City. FIRST ON FOX: Suspect arrested for assault on officer has a history of violence (WBFF) -- One of the men arrested for assaulting a Baltimore police officer on Friday night has a history of violence. In 2016, at the age of 16 police arrested Donnell Burgess in connection to a... foxbaltimore.com", "2020-01-19T00:34:30.000Z": "I am appalled and disgusted by the vile attack on a Baltimore City Police sergeant. We absolutely will not tolerate assault of any kind on any member of law enforcement. My full statement:", "2020-01-18T15:01:02.000Z": "\"Maryland has some of the kindest and most compassionate citizens in the nation, and we champion those who light the way in our quest to serve others,\" said Governor Hogan http:// ow.ly/ghey50xYPrC", "2020-01-18T15:00:01.000Z": "We are moving forward on the Howard Street Tunnel project, which will break a major East Coast bottleneck, dramatically transform the Port of Baltimore, stimulate economic growth across the state, and create thousands of Maryland jobs.", "2020-01-17T23:30:00.000Z": "NEW POLL: Majority of America's Most Popular Governors Are in Opposing Party States ​ https:// anamericaunited.org/news/011720/", "2020-01-17T12:48:19.000Z": "Hogan announces $1 billion+ in tax relief, biggest tax reduction in more than two decades #MDGA20 Hogan announces $1 billion+ in tax relief, biggest tax reduction in more than two decades There's an effort to make it more affordable for retirees to stay in Maryland. wmar2news.com", "2020-01-16T18:39:21.000Z": ". @GovLarryHogan unveils Retirement Reduction Act; $1 billion in tax relief for retirees impacting 230,000 Marylanders. @FOXBaltimore", "2020-01-16T18:38:32.000Z": "Joining @GovLarryHogan to announce our legislation to provide tax relief to Maryland retirees. Watch here: #mdpolitics  #MDGA2020 Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: Announcement - January 16, 2020 https:// pscp.tv/w/cPCkfzFheWpW Z3hwdmJlRXB8MU95S0FlWnlBUkRLYnw_PoVlREVYOxKh5VCFVOo742jv88126XPyC89YOcP1?t=1s ", "2020-01-16T18:38:08.000Z": "Gov Hogan announces he's introducing the retirement tax reduction act. It could mean more than a billion dollars in tax relief for retirees.", "2020-01-16T18:36:42.000Z": "Gov. Hogan is announcing the biggest tax cut in Maryland in more than two decades: Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE: Announcement - January 16, 2020 https:// pscp.tv/w/cPCkfzFheWpW Z3hwdmJlRXB8MU95S0FlWnlBUkRLYnw_PoVlREVYOxKh5VCFVOo742jv88126XPyC89YOcP1?t=1s ", "2020-01-16T18:36:00.000Z": "LIVE: Announcement - January 16, 2020 0:01 Governor Larry Hogan @GovLarryHogan Announcement - January 16, 2020 pscp.tv", "2020-01-16T17:15:21.000Z": "My statement applauding the ratification of the #USMCA :", "2020-01-16T01:02:57.000Z": "Our brave men and women in uniform have given more than most of us can ever fully know. There are no words adequate enough to express our sincere gratitude, our respect, and our deepest appreciation to all those currently serving and to all of our military veterans.", "2020-01-15T22:57:28.000Z": "This afternoon, Lt. Governor @BoydKRutherford and I had the privilege of welcoming home the @MDNG", "2020-01-15T18:13:54.000Z": "And we are again introducing legislation to finally, once and for all, ensure that no matter your age, all military retirement will be 100% exempt from state tax. Learn more: https:// governor.maryland.gov/2020/01/15/pho to-release-governor-hogan-announces-military-initiatives-at-national-guard-armory/ ", "2020-01-15T18:13:52.000Z": "We are introducing legislation to allow members of the military, their spouses, and veterans to have occupational licenses earned in other states be recognized here in Maryland, without making them start all over again.", "2020-01-15T18:13:51.000Z": "We will be expanding the Maryland National Guard State Tuition Assistance Reimbursement program in order to provide up to 100% of the cost of in-state tuition for undergrad and grad courses, as well as professional, vo-tech, or trade courses to all active members of the @MDNG .", "2020-01-15T18:13:49.000Z": "Today, at the historic Joint Force Headquarters, Fifth Regiment Armory, we introduced legislation which will continue to demonstrate our strong support for our military retirees, active duty military personnel and their families, and for our @MDNG soldiers and airmen.", "2020-01-15T16:20:54.000Z": "LIVE: Military Announcement - January 15, 2020 Governor Larry Hogan youtube.com", "2020-01-14T17:04:35.000Z": "Our FY21 'Accountability Budget' reflects the most urgent priorities of Marylanders-crime, education, transportation, and the environment⁠-while keeping our commitment to bring fiscal restraint to Annapolis and to hold the line on unaffordable spending. https:// governor.maryland.gov/2020/01/14/acc ountability-budget-governor-hogan-announces-fy21-budget-focused-on-violent-crime-education-and-economic-development/ ", "2020-01-14T18:25:56.000Z": "Education, Combating Crime Among Big Ticket Items In @GovLarryHogan 's State Budget Proposal #MDGA20 At Least 5 Shot In Baltimore As Governor Hogan Announces Millions In Funding To Combat Crime Four people were shot within a five-hour period in Baltimore on Tuesday. baltimore.cbslocal.com", "2020-01-14T16:10:37.000Z": ". @GovLarryHogan unveils what he calls \"accountability budget\" for FY 2021 w/ focus on crime, education, transportation & environment. #mdpolitics  @FOXBaltimore", "2020-01-14T16:09:07.000Z": "LIVE: Announcement https:// youtu.be/L1Kl-Gskb68", "2020-01-13T22:05:45.000Z": "Another weekend of bloodshed in Baltimore- thoughts and prayers are not enough. We need action. I urge lawmakers to work with us to finally address the violent crime in our streets: https:// governor.maryland.gov/session2020-cr ime/  12 Shot, 5 Killed In Multiple Incidents In Baltimore Saturday There were twelve people shot and five killed on Saturday in Baltimore City, according to Baltimore City police. wbal.com", "2020-01-12T23:30:00.000Z": "Our top priority is keeping our citizens safe, and it is essential that our police officers and first responders have the tools they need to do their jobs effectively and efficiently. Passing our crime package absolutely must be job number one for the legislature.", "2020-01-12T12:00:00.000Z": "I have ordered the Maryland flag to be lowered to half-staff to honor the memory of former state Senator Ulysses Currie - an Army veteran and tireless advocate for Prince George's County - on the day of his interment. May he rest in peace.", "2020-01-12T00:58:16.000Z": "Let's go @Ravens !! #RavensFlock Quote Tweet Governor Larry Hogan @GovLarryHogan It's great to be here to cheer on the @Ravens with so many fellow fans! #RavensFlock", "2020-01-10T23:52:41.000Z": "Happy #PurpleFriday , Maryland!", "2020-01-10T20:19:31.000Z": "Gov. Larry Hogan and Tennessee Gov. Bill Lee wager hometown goods in Ravens playoff game http:// wusa9.com/article/sports /governor-larry-hogan-invites-tennessee-governor-titans-vs-baltimore/65-1c9a7a7e-7b22-43ce-82a8-fd310b5fb9d2  via @WUSA9 Gov. Larry Hogan and Tennessee Gov. Bill Lee wager hometown goods in Ravens playoff game The two governors make a friendly wager of Maryland crab cakes and Nashville hot chicken. wusa9.com", "2020-01-10T19:18:08.000Z": "Let's go @Ravens ! #RavensFlock Quote Tweet Governor Larry Hogan @GovLarryHogan Looking forward to hosting Tennessee @GovBillLee as the @Ravens take on the @Titans tomorrow, but that's where our good hospitality will end, because I have 'big truss' in our Ravens! We've made a friendly wager of Maryland crab cakes and Nashville hot chicken.", "2020-01-10T13:00:20.000Z": "Hogan cracks down on crime and criminals https:// washingtontimes.com/news/2020/jan/ 9/maryland-gov-larry-hogan-cracks-down-on-crime-and-/  via @washtimes  #MDGA20 Maryland Gov. Larry Hogan cracks down on crime and criminals A poll released this week suggests that Maryland Gov. Larry Hogan is targeting the bull's-eye by proposing to crack down on crime and criminals. washingtontimes.com", "2020-01-09T18:46:35.000Z": "Thread. Anne Arundel County Police Department officers saluted the escort carrying the remains of U.S. Army Sgt. 1st Class Michael J. Goble today.\n\nSgt. 1st Class Michael J. Goble, 33, of Washington Township, New Jersey, died Dec. 23, 2019, as a result of injuries sustained while", "2020-01-09T15:22:13.000Z": "I'd like to extend my heartfelt congratulations to @GovernorKayIvey on joining the cancer-free club! The First Lady and I are praying for your continued good health.", "2020-01-08T21:01:06.000Z": "To protect the Chesapeake Bay, I am directing Attorney General Brian Frosh to pursue legal actions against the EPA and the Commonwealth of Pennsylvania. Learn more: https:// governor.maryland.gov/2020/01/08/to- protect-chesapeake-bay-governor-hogan-directs-attorney-general-to-pursue-legal-actions-against-pennsylvania-and-epa/ ", "2020-01-08T17:55:50.000Z": "With this vote, we will be moving forward on a bipartisan, common sense, interstate agreement that has eluded elected leaders throughout the region for many decades. Learn more: https:// governor.maryland.gov/2020/01/08/mon umental-and-historic-achievement-board-of-public-works-votes-to-advance-transformative-traffic-relief-plan/ ", "2020-01-08T17:55:49.000Z": "Today we advanced our transformative traffic relief plan, which will finally address the second-worst traffic congestion in America and begin to solve what has been the number one problem in the Washington Capital Region for decades.", "2020-01-08T15:19:01.000Z": "LIVE on #Periscope : Board of Public Works - January 8, 2020 Governor Larry Hogan @GovLarryHogan Board of Public Works - January 8, 2020 pscp.tv", "2020-01-08T14:04:29.000Z": "Joining the Larry Young Morning Show live in @wolbbaltimore to talk about the first day of #MDGA2020 and our legislative priorities! Tune in now to AM 1010 or listen online at http:// wolbbaltimore.com  #mdpolitics WOLB Talk 1010 Baltimore, Maryland, News, Talk, Radio wolbbaltimore.com", "2020-01-07T20:02:34.000Z": "Thank you for your continued support - let's keep changing Maryland for the better! Quote Tweet Governor Larry Hogan @GovLarryHogan I promised to be a governor for all Marylanders, and according to the latest Gonzales poll, an overwhelming majority of Marylanders, regardless of party, approve of the job we are doing!", "2020-01-07T16:50:54.000Z": "I'm introducing the Ethics and Accountability in Government Act of 2020, which will strengthen and toughen ethics laws in an effort to help restore the public's trust & to bring further transparency, accountability, and honesty to Annapolis.\n\nLearn more: https:// governor.maryland.gov/2020/01/07/acc ountability-session-governor-hogan-proposes-tough-new-ethics-reform-for-public-officials-urges-lawmakers-to-pass-crime-package/ ", "2020-01-07T17:08:00.000Z": "Accountability Session: @GovLarryHogan Proposes Tough New Ethics Reform for Public Officials, Urges Lawmakers to Pass Crime Package: https:// governor.maryland.gov/2020/01/07/acc ountability-session-governor-hogan-proposes-tough-new-ethics-reform-for-public-officials-urges-lawmakers-to-pass-crime-package   #mdpolitics  #MDGA20", "2020-01-07T16:15:52.000Z": "#WJZ Hogan says getting violent criminals off the street is top priority in 2020 session which starts tomorrow", "2020-01-07T16:13:19.000Z": "Getting violent criminals off our streets is priority #1.  -Governor Larry Hogan", "2020-01-07T16:11:16.000Z": "Maryland @GovLarryHogan submits bill to punish corruption, including increased fines and loss of pensions for state employees and elected officials.", "2020-01-07T16:07:17.000Z": "Hogan says the theme of the session should be accountability, holding schools, violent criminals and elected officials accountable Quote Tweet Danielle E. Gaines @DanielleEGaines Preview of Gov. Larry Hogan's forthcoming press conference:", "2020-01-07T16:07:04.000Z": "At State House news conference, @GovLarryHogan said the theme of the upcoming legislative session should be 'more accountability' -- for criminals, for school systems and for public officials.", "2020-01-07T16:05:36.000Z": "Maryland @GovLarryHogan laying out his priority for \"increasing accountability\" in government.", "2020-01-07T16:04:00.000Z": "LIVE on #Periscope : Announcement - January 7, 2019 Governor Larry Hogan @GovLarryHogan Announcement - January 7, 2019 pscp.tv", "2020-01-03T18:15:11.000Z": "My statement on our major bipartisan agreement to advance traffic relief in the Washington Capital Region:", "2020-01-01T17:01:57.000Z": "We are heartbroken to learn of the loss of another member of the Maryland Army National Guard's 175th Infantry Regiment, Specialist Jerry J. Eley. The First Lady and I ask Marylanders to join us in praying for his friends, family, and all who loved him. Quote Tweet MD National Guard @MDNG We regretfully announce the passing of Spc. Jerry J. Eley. of the @MDNG 231st Chem. Co. He served as a chemical specialist & medic. \n\nThank you for your service to our country & our deepest condolences go to your loved ones. Rest easy, Soldier. https:// baltimore.cbslocal.com/2019/12/31/man -killed-in-reisterstown-shooting-identified-as-maryland-national-guard-member/ ", "2019-12-31T19:50:59.000Z": "Australians begin the new year dealing with devastating wildfires that have already claimed lives, burned more than 12M acres, and forced thousands to flee. Our thoughts are with all those affected and the heroic firefighters in harm's way. Deadly Australian wildfires prompt mass evacuations Massive wildfires continue to burn out of control in Australia, where at least 12 people have died and thousands have fled their homes. Volunteers are battling to save local wildlife, including... today.com", "2019-12-31T18:00:17.000Z": "I have ordered the Maryland flag lowered to half-staff in honor of Cecil County firefighter Otis L. Isaacs, who tragically passed away in the line of duty. A former president and chief of the North East Fire Co., Otis was inducted into the Harford-Cecil Hall of Fame in 2003.", "2019-12-30T14:47:04.000Z": "Our places of worship must never become places of fear. These anti-Semitic attacks cut at the very heart of our values as Americans and human beings. In this battle between good and evil, there is only one side to stand on, and that is for love and goodness, justice and unity. Quote Tweet Andrew Cuomo @NYGovCuomo I am horrified by the stabbing of multiple people at a synagogue in Rockland County tonight.\n\nWe have zero tolerance for anti-Semitism in NY and we will hold the attacker accountable to the fullest extent of the law.\n\nNY stands with the Jewish community.", "2019-12-26T14:09:09.000Z": "Sending our warmest wishes to Maryland National Guard U.S. Army Maj. Analiza Harry, currently deployed to Kabul, Afghanistan, and to all of our brave servicemen and women who are spending this holiday season away from home. Quote Tweet MD National Guard @MDNG @MDNG Maj. Analiza Harry, currently deployed to Kabul, Afghanistan, wishes her loved ones a very Happy Holidays.\n\nLet's keep all of our deployed service members in our deepest thoughts throughout this holiday season.\n\nThank you for your dedication & service to our state & nation!", "2019-12-25T17:31:32.000Z": "Wishing a very happy birthday to my better half, my beautiful wife, Yumi. Every single day I am amazed by what an incredible wife, mother, grandmother, and first lady she is, and I don't know where I'd be without her love and support.", "2019-12-20T15:02:42.000Z": "Maryland has added 32,000 jobs since August and is experiencing the strongest stretch in employment growth since 2010, and the lowest unemployment rate since 2008. More businesses are open and more people are working than ever before in Maryland history!", "2019-12-19T19:00:38.000Z": "For the second year in a row, we have led a successful bipartisan effort to protect federal funding for Chesapeake Bay restoration. Maryland is home to countless natural assets, but for us, none is more important than the Chesapeake Bay. Learn more: https:// governor.maryland.gov/2019/12/19/gov ernor-hogan-applauds-successful-effort-to-boost-federal-funding-for-chesapeake-bay/ ", "2019-12-17T17:15:20.000Z": "On the first day of the 2020 legislative session, we are submitting a cleaner, smarter, cheaper energy strategy that keeps jobs here in Maryland. Our Clean and Renewable Energy Standard (CARES) sets us on a path to 100% clean electricity by 2040: https:// governor.maryland.gov/2019/12/17/gov ernor-hogan-unveils-bold-energy-legislation/ ", "2019-12-16T22:17:21.000Z": "Only 14% strongly oppose our traffic relief plan. After 30 years of no solutions and 3.5 years of delays, nearly 70% of all Montgomery and Prince George's voters support it and want action now.", "2019-12-11T22:11:10.000Z": ". @GovLarryHogan unveils funding and initiatives to fight violent crime Washington Post: Breaking News, World, US, DC News & Analysis Breaking news and analysis on politics, business, world national news, entertainment more. In-depth DC, Virginia, Maryland news coverage including traffic, weather, crime, education, restaurant... washingtonpost.com", "2019-12-11T17:04:59.000Z": "BREAKING: Governor Hogan announces the State of Maryland is committing $21M in additional state funding to Baltimore for crime fighting efforts. http:// foxbaltimore.com/news/local/liv e-governor-hogan-holds-a-press-conference-in-baltimore-city ", "2019-12-11T16:11:26.000Z": ". @GovLarryHogan announcing new crime measures to help #Baltimore City - says state will fund 25 new staffers to prosecute cases with the State AG - says violence is out of control - will be City specific @wbalradio", "2019-12-11T16:17:33.000Z": "Hogan introducing legislation for \"truth ins  sentencing\" to require those convicted fo violent crimes to serve longer and serve them consecutively.", "2019-12-10T14:09:45.000Z": "LIVE on #Periscope : Blue Ribbon Schools - December 10, 2019 Governor Larry Hogan @GovLarryHogan Blue Ribbon Schools - December 10, 2019 pscp.tv", "2019-12-09T20:03:55.000Z": "I have appointed Gregory Slater to serve as secretary of the Maryland Dept. of Transportation. With his decades of experience, Greg is sure to build on our balanced approach to infrastructure, including record investment in transit, as leader of @MDOTNews . https:// governor.maryland.gov/2019/12/09/gov ernor-hogan-announces-cabinet-appointment/ ", "2019-12-05T17:14:52.000Z": "Joining @GovLarryHogan to announce our education legislation package for the upcoming #MDGA20 legislative session. Watch here: #MDPolitics Quote Tweet Governor Larry Hogan @GovLarryHogan LIVE on #Periscope : Announcement - December 5, 2019 https:// pscp.tv/w/cLkv5TFheWpW Z3hwdmJlRXB8MWxQSnFlZFJMbUVKYp9qYiw9UnnBhaoj8HytYpTDDcEHmaBuvQno1hFjLeks?t=1s ", "2019-12-05T17:03:50.000Z": "LIVE on #Periscope : Announcement - December 5, 2019 Governor Larry Hogan @GovLarryHogan Announcement - December 5, 2019 pscp.tv", "2019-12-01T21:37:03.000Z": "Winter Storm Warnings (pink on the map), Winter Weather Advisories (purple), and Coastal Flood Advisories (light green) are in effect for our region over the next 24 hours. Stay weather aware by checking http:// weather.gov/lwx frequently.", "2019-11-28T13:01:09.000Z": "Wishing a happy and blessed Thanksgiving to Marylanders far and near! Thanksgiving is one of my favorite holidays, and this year I have so much to be grateful for:", "2019-11-22T18:00:51.000Z": "Our hearts go out to the people of West Baltimore after the devastating fire at the historic Edmondson Village Shopping Center. We are deeply grateful to all of the first responders for their swift action & our prayers are with all who have been affected. Fire guts West Baltimore's Edmondson Village Shopping Center, damaging 10 businesses The fire had spread to multiple businesses at Baltimore's Edmondson Village Shopping Center. baltimoresun.com", "2019-11-21T20:30:09.000Z": "My statement on today's vote on education spending:", "2019-11-21T16:01:03.000Z": "We are proud to announce more than $30 million in FY20 neighborhood revitalization program awards that will support 181 projects in 23 jurisdictions across Maryland, including community initiatives, business development, and homeownership programs: https:// governor.maryland.gov/2019/11/21/gov ernor-hogan-awards-more-than-30-million-in-neighborhood-revitalization-funds/ ", "2019-11-16T17:02:23.000Z": "I told Tim that his song was an inspiration to me, and in his final performance of the night, he dedicated the song to me.\n\nI feel so thankful and blessed to be 100% cancer-free, and for the incredible support during my cancer battle.", "2019-11-16T17:02:22.000Z": "When I was going through the worst part of my cancer battle, there was one song I found truly inspiring: \"Live Like You Were Dying\" by @TheTimMcGraw .", "2019-11-16T17:02:21.000Z": "Exactly three years ago today, after months of chemotherapy treatments, my doctors informed me that I was 100% cancer-free and in complete remission from non-Hodgkin's lymphoma!", "2019-11-12T14:47:43.000Z": "We are proud to announce that Maryland and Virginia have reached an historic, bipartisan 'Capital Beltway Accord' which will finally address the gridlock on the Capital Beltway. Learn more: https:// governor.maryland.gov/2019/11/12/gov ernors-of-maryland-and-virginia-announce-historic-capital-beltway-accord/ ", "2019-11-12T14:11:38.000Z": "The governors of Maryland & Virginia are about to make a major announcement. https:// youtube.com/watch?v=MexHQz CEqXI  Quote Tweet ABC 7 News - WJLA @ABC7News NEW: A major announcement related to transportation is expected from Maryland Gov. Larry Hogan and Virginia Gov. Ralph Northam.  The announcement from the governors is scheduled for 9 a.m. today: http:// bit.ly/2XgYNb3", "2019-11-12T14:11:41.000Z": "LIVE on #Periscope : Transportation Announcement - November 12, 2019 0:42 Governor Larry Hogan @GovLarryHogan Transportation Announcement - November 12, 2019 pscp.tv", "2019-11-11T13:10:00.000Z": "On this #VeteransDay , I ask each and every Marylander to set aside time to honor our veterans and their families. Raise the flag from your porch, ask a local hero about the story of their service, or simply just say thank you.", "2019-11-08T00:30:38.000Z": "Tonight, Government House is participating in the #AFALightTheWorldInTeal campaign to raise awareness of Alzheimer's disease and the importance of early detection. Visit http:// alzfdn.org to learn more. #AFA30DaysOfTeal", "2019-11-07T14:28:36.000Z": "Before Governor Hogan and I took office, a Gallup poll found that nearly half of Marylanders said they would leave the state if they could. Fast forward to today and #Maryland has been named the 7th best state to live in the nation! https:// cbsloc.al/36KhMiz#.XcQp_ dPxTFs.twitter  via @wjz Maryland Named 7th Best U.S. State To Live In By 24/7 Wall St. Financial news site 24/7 Wall St. has named Maryland the seventh-best U.S. state in which to live. baltimore.cbslocal.com", "2019-11-03T20:51:42.000Z": "We are proud to hang these Thin Blue Line flags in Government House to honor our brave law enforcement officers. A local elected official prohibiting police from displaying a flag given to them by a grateful child is disgraceful.", "2019-11-03T15:34:22.000Z": "I have attended the funerals of fallen law enforcement officers across our state, and I take time to thank them every day for their dedicated service and sacrifice.", "2019-11-03T15:34:21.000Z": "I'm offended and disgusted that County Executive Marc Elrich has prohibited Montgomery County Police officers from displaying a \"thin blue line\" American flag that was made for them by a father & his young son in honor of National First Responders Day. Maryland county executive demands 'Thin Blue Line' flag be removed from police station GERMANTOWN, Md. (ABC7) - What was meant to be a show of support for first responders has turned into a political feud putting Montgomery County cops and politicians at even further odds. On Monday,... wjla.com", "2019-10-31T17:18:34.000Z": "Our plebe pups are ready for Howl-oween! #DontGiveUptheShip", "2019-10-31T13:12:54.000Z": "Thanks to the efforts of partisan politicians, Maryland's congressional districts are pretty frightening. I plan to once again introduce legislation to put the drawing of districts in the hands of a balanced, fair and nonpartisan commission. #RedistrictingReform GIF", "2019-10-28T15:48:31.000Z": "I have ordered a special election to fill the 7th Congressional District vacancy created by the passing of Congressman Elijah Cummings. We encourage the citizens of the 7th District to take part and let their voices be heard. https:// governor.maryland.gov/2019/10/28/gov ernor-hogan-orders-special-election-for-marylands-7th-congressional-district/ ", "2019-10-24T16:30:42.000Z": "My statement on Senate President Mike Miller's announcement:", "2019-10-21T01:24:19.000Z": "Another incredible win! Congratulations to the Baltimore @Ravens on a huge victory on the road! #RavensFlock Quote Tweet Baltimore Ravens @Ravens Headed home with a DUB.  #RavensFlock", "2019-10-20T15:33:59.000Z": "\"Even a 10% increase in the state income tax, which would cost most Marylanders several hundred dollars more annually, would cover perhaps half the state's portion of the total bill - and it's doubtful a majority of voters would tolerate such an increase.\" https:// washingtonpost.com/opinions/there s-good-reason-for-jitters-about-marylands-massive-school-spending-plan/2019/10/18/6f1f6d6e-f10e-11e9-b648-76bcf86eb67e_story.html ", "2019-10-20T12:00:01.000Z": ". @WashingtonPost Editorial Board: There's good reason for jitters about Maryland's massive school spending plan Opinion | There's good reason for jitters about Maryland's massive school spending plan No doubt, public schools in many parts of the state need improvement. Paying for it is the issue. washingtonpost.com", "2019-10-18T14:04:37.000Z": "PRESS RELEASE: Maryland added 10,100 jobs in September, which is the largest single month gain since May 2015. MD's unemployment rate has decreased to 3.7%, matching the lowest level of unemployment MD has experienced in the past decade. Learn more at http:// bit.ly/31uDgvM .", "2019-10-17T15:00:01.000Z": "According to the latest @MorningConsult poll, an overwhelming majority of Marylanders, regardless of party affiliation, strongly approve of the job we are doing! I am truly humbled and honored by the incredible support from all across our great state. Thank you, Maryland!", "2019-10-17T13:30:07.000Z": "I have ordered Maryland flags to fly at half-staff to honor the life and legacy of Congressman Elijah Cummings. We extend our deepest sympathies to his friends, family, and colleagues.", "2019-10-17T12:46:12.000Z": "My wife Monica and I, and our entire family, join with many others in praying for Rep. Cummings' friends and family, especially his wife Maya, that they find comfort in his legacy during this difficult time. May he Rest In Peace.", "2019-10-17T12:46:05.000Z": "It is times like these that we put politics aside and remember a man who deeply cared for the City of Baltimore and the State of Maryland.", "2019-10-17T12:45:19.000Z": "Congressman Elijah Cummings was a dedicated public servant for 36 years, a trailblazer who was unafraid to speak up for what he believed in & the people he represented. His passing will undoubtedly be felt by the people of Baltimore and by people all across our state & nation. Quote Tweet The Baltimore Sun @baltimoresun Breaking: U.S. Rep. Elijah Cummings, a longtime Baltimore Democrat, has died. http:// bit.ly/2IXKOAF Show this thread", "2019-10-17T12:24:57.000Z": "My statement on the passing of Congressman Elijah Cummings:", "2019-10-16T16:24:55.000Z": "Delaying maintenance on the Bay Bridge has caused tremendous safety problems. As you can see, the surface of the right lane of the westbound span is severely deteriorated area has reached the end of its service life. In one section, 75% of the area is patched and deteriorated.", "2019-10-16T15:04:15.000Z": "Delaying maintenance on the Bay Bridge for more than a decade has caused tremendous safety problems. Engineers say that the deck surface of the westbound span is severely deteriorated-well beyond the end of its service life-and has a number of very major safety risks.", "2019-10-16T14:40:59.000Z": "People across the state are frustrated and angry over the sometimes unbearable backups at the Bay Bridge. I want you to know that I am too. I am taking action to demand that every effort be taken to complete the project as soon as possible.", "2019-10-16T14:01:34.000Z": "In a few minutes, @GovLarryHogan will announce a series of actions on the #BayBridgeWork project. Watch live: https:// governor.maryland.gov/board-of-publi c-works-meetings/ ", "2019-10-15T18:44:09.000Z": "Even after more than three years of meetings, there is still no clear plan whatsoever for how either the state or the counties will pay this massive price tag.", "2019-10-15T18:44:08.000Z": "The Kirwan Tax Hike Commission is hellbent on spending billions more than we can afford, and legislators are refusing to come clean about where the money is going to come from.", "2019-10-14T00:28:05.000Z": "Learn more about breast cancer, especially early detection and screening, at http:// nationalbreastcancer.org .", "2019-10-14T00:28:04.000Z": "October is #BreastCancerAwareness Month, and today is #MetastaticBreastCancerAwareness Day. Government House is lit pink in support of the nearly 3.1 million breast cancer survivors across the nation and the over 5,000 Marylanders expected to be diagnosed this year.", "2019-09-26T18:24:38.000Z": "Maryland is proud to be a national leader when it comes to clean and renewable energy, climate change, and the promotion of electric vehicles. This fully-converted, gas-to-electric charging station-first of its kind in the country-is a prime example. https:// governor.maryland.gov/2019/09/26/mar yland-opens-first-fully-converted-gas-to-electric-refueling-station-in-the-united-states/ ", "2019-09-18T23:30:53.000Z": "Hogan directs AG Frosh to prosecute more violent crime cases in Baltimore https:// wbaltv.com/article/hogan- directs-frosh-to-prosecute-more-violent-crime-case-in-baltimore/29114107?utm_campaign=WBALTV&utm_content=5d82be04bfe09900016a9a59&utm_medium=twitter&utm_source=trueAnthem%3A+New+Content+%28Feed%29 ", "2019-09-18T23:25:00.000Z": "NEW: Gov. Larry Hogan announced two new initiatives to fight violent crime during a visit to west Baltimore Wednesday evening Hogan Calls On AG To Prosecute More Baltimore Violent Crime Cases Gov. Larry Hogan Wednesday announced two new initiatives designed to reduce violent crime in Baltimore. baltimore.cbslocal.com", "2019-09-18T23:22:43.000Z": ". @GovLarryHogan calls on Attorney General Frosh to prosecute more Baltimore criminal cases, slams city prosecutors Gov. Hogan calls on Attorney General Frosh to prosecute more Baltimore criminal cases, slams city... Arguing that Baltimore prosecutors are too quick to drop cases, Gov. Larry Hogan says he's directing state Attorney General Brian Frosh to prosecute more criminal cases in the city. baltimoresun.com", "2019-09-18T23:13:16.000Z": ". @GovLarryHogan says one of the suspects in the shooting of Sgt. Isaac Carrington had multiple murder and gun charges, \"and yet he was walking the streets and was able to shoot a police officer in the back.\" #WBAL", "2019-09-18T23:11:18.000Z": "Hogan is also directing AG Brian Frosh to start prosecuting more violent crime cases in Baltimore. He says, \"far too often in Baltimore City, violent offenders get a slap on the wrist and are released back out onto the streets to commit yet another violent offense.\" #WBAL", "2019-09-18T23:08:39.000Z": "NEW: Governor Larry Hogan says 10 @MDSP are now patrolling the air over Baltimore. Hogan says that if they detect criminal activity they will share the information with @BaltimorePolice  #WBAL", "2019-09-18T22:18:54.000Z": "RIGHT NOW: @GovLarryHogan is at @UmarBoxing in Northwest Baltimore.  I've seen first hand the amazing things Umar and the No Hooks Before Books afterschool program does for the kids in this community.  Talking violence & what Umar needs to keep battling it. @WMAR2News"}