{"2020-07-24T15:26:07.000Z": "Every traveler coming to Massachusetts, no matter from where, has a responsibility to help keep #COVID19MA out of the Commonwealth.\n\nToday we announced a new travel order that will take effect on August 1st. Learn more at http:// mass.gov/matraveler", "2020-07-30T18:11:03.000Z": "Massachusetts has always been a leader in innovation and we're lucky to have some of the best and brightest minds in research + medicine in our backyard.\n\nToday @MassLtGov + I returned to @pfizer 's Andover campus to learn about their work to develop a COVID-19 vaccine candidate.", "2020-07-30T14:31:18.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live?n", "2020-07-29T15:37:13.000Z": "REMINDER: Effective 8/1, new #COVID19MA travel order is in place for those coming to Massachusetts. Requirements for those not arriving from lower-risk states or who meet exemptions: Complete MA travel form upon arrival Self-quarantine for 14 days  http:// mass.gov/MAtraveler", "2020-07-28T17:46:38.000Z": "Heat Safety Tips: \n Never leave children or pets alone in a closed vehicle  Recognize & respond to heat-related illnesses  Stay hydrated  Check on neighbors, elderly & those at risk More #BeatTheHeat tips: http:// mass.gov/mema/heat Quote Tweet NWS Boston @NWSBoston We've upgraded the Heat Advisory to an Excessive Heat Warning for Bristol County & Plymouth County in Massachusetts and for the state of Rhode Island (excluding Block Island) until 8pm. Dangerously hot conditions are possible with heat index values up to 105°F #MAwx  #RIwx", "2020-07-27T17:17:39.000Z": "Continued access to #COVID19MA testing enables us to stop further transmission.\n\nToday we're expanding our #StopTheSpread initiative to 8 additional communities: Agawam, Brockton, Methuen, Randolph, Revere, Springfield, Taunton and Worcester. Learn more http:// mass.gov/stopthespread", "2020-07-27T16:29:59.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-07-26T13:00:00.000Z": "Today marks the 30th anniversary of the Americans with Disabilities Act. Thanks to the commitment and input of our riders, the MBTA is more accessible than ever. To celebrate, we're spotlighting their experiences, hopes for the future, and what #ADA30 and #TAccess mean to them.", "2020-07-26T15:57:32.000Z": "Today as we mark the 30th anniversary of the enactment of the Americans with Disabilities Act, we reaffirm our commitment to the work of ensuring inclusion for all people.\n\nI was honored to provide a message for the #ADA30Boston celebration hosted by @BostonCIL earlier this week.", "2020-07-25T00:52:47.000Z": "The @RedSox are back! #OpeningDay Quote Tweet NESN @NESN Robert Lewis Jr. was joined by Charlie Baker and Marty Walsh to throw out the ceremonial first pitch tonight... @MassGovernor | @marty_walsh | @RedSox", "2020-07-24T20:29:29.000Z": "Looking forward to joining the @RedSox and Mayor @marty_walsh tonight at @fenwaypark for #OpeningDay ! #RedSoxNation is ready to kick off the 2020 season! Quote Tweet Red Sox @RedSox Do you hear that? \nThat's baseball. #OpeningDay", "2020-07-24T19:56:13.000Z": "Today, @MassDCR is reminding the public to follow important health and safety rules when visiting state-managed parks and beaches. Continue to practice social distancing Wear a face covering Practice good hygiene More: https:// mass.gov/news/state-off icials-remind-public-to-follow-health-and-safety-rules-at-state-managed-beaches-and ", "2020-07-24T16:21:25.000Z": "Today I signed a supplemental budget bill that authorizes #COVID19MA spending and also establishes #Juneteenth Independence Day as an annual state holiday on June 19 in order to recognize the continued need to ensure racial freedom and equality. READ: https:// bit.ly/2WTlzqb", "2020-07-24T15:10:44.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-07-23T22:59:15.000Z": "The health + safety guidance released by @MASchoolsK12 is grounded in pediatric medical experts' guidance and aims to support students' safe return to the classroom, to enable them to grow and learn best.\n\nLearn more Quote Tweet Massachusetts K-12 @MASchoolsK12 Our FAQ answers many of questions about fall reopening plans and our health & safety guidance: http:// doe.mass.edu/covid19/on-des ktop/2020-0710fall-reopening-faq.docx   #MAEdu  #COVID19MA  #Fall2020", "2020-07-23T20:44:16.000Z": "To stop the spread of #COVID19MA , remember to wear a face-covering in public, especially in places where you are unable to socially distance.\n\nRead about the order + guidance from @MassDPH : http:// mass.gov/coveryourface", "2020-07-23T17:40:32.000Z": "SEVERE THUNDERSTORM WATCH until 8PM for all parts of MA except Berkshire county. \n\nA watch means thunderstorms are possible - be prepared. \nStorms may bring heavy rain, high winds, hail and lightning. \n\nSafety tips: https:// mass.gov/mema/thunderst orms  Quote Tweet NWS Boston @NWSBoston A severe thunderstorm watch has been issued for parts of CT, ME, MA, NH, RI until 8 PM EDT", "2020-07-22T19:44:43.000Z": "We announced the first round of grant recipients in our $36 million Food Security Infrastructure Grant Program We also announced the first round of new vendors for the Healthy Incentives Program, funded through an additional $5 million. DETAILS: https:// bit.ly/39k1xdr", "2020-07-22T19:44:42.000Z": "At today's visit, @MassLtGov and I were joined by @EEASecretary Theoharides and @MassHHS Secretary Sudders to announce the latest progress in distributing our $56 million investment to combat food insecurity, which implements the recommendations of our Food Security Task Force.", "2020-07-22T19:44:41.000Z": "#COVID19MA has created major challenges around food security for residents and families. \n\nThe Commonwealth is lucky to have a partner like @SalvationArmyMA , which has stepped up in a big way and this week is marking the distribution of 8 million meals since the pandemic began.", "2020-07-22T15:45:46.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-07-22T13:10:51.000Z": "Wearing a face-covering in public, especially when its not possible to maintain social distance, is an important way we can all stop the spread of #COVID19MA and keep people safe + healthy. Learn more via @MassDPH : http:// mass.gov/coveryourface", "2020-07-21T17:45:36.000Z": "We remain committed to supporting Massachusetts manufacturers who are shifting their production operations to produce PPE and other crucial supplies through our Manufacturing Emergency Response Team. #COVID19MA Quote Tweet Commonwealth Corp. @CommCorp_MA M-ERT grant lead by the Baker-Polito Admin will help launch a second manufacturing line that will double their N95 mask production to a weekly capacity of 330,000 by the end of August, then up to 450,000 a week by end of September: http:// ow.ly/AVnT30qZM4I  @MassGovernor  @MassLtGov", "2020-07-21T15:48:02.000Z": "Today I extended the pause on evictions and foreclosures for 60 days until October 17.\n\nThis extension provides residents continued housing security as businesses cautiously re-open, more people return to work and we move toward a new normal. Details: https:// bit.ly/3hrlbqH", "2020-07-20T22:20:25.000Z": "We are proud to continue this program which was launched by our Administration in 2015.\n\nThis year, Summer Nights will provide urban youth with socially distant programming at Massachusetts state parks and other locations starting today and continuing through Friday, August 21.", "2020-07-20T22:20:23.000Z": "While @MassDCR 's Summer Nights program looks a little different this year due to #COVID19MA , we look forward to offering safe educational and recreational activities for kids and students to enjoy at state parks in locations across Massachusetts. MORE: https:// bit.ly/2WH6Aj0", "2020-07-20T21:44:35.000Z": "As the Commonwealth moves through its phased #COVID19MA reopening plan, the @MBTA is adjusting service and protocols, while continuing to implement health and cleaning protocols to keep people safe. Quote Tweet MBTA @MBTA Effective 7/20, front-door boarding & fare collection resumes on buses, Green Line, Mattapan Line. We continue to:\n-Require face masks\n-Disinfect high-contact areas in stations\n-Disinfect vehicles daily + sanitize touch-points midday\n-Promote social distancing\n-Open station doors Show this thread", "2020-07-20T17:15:48.000Z": "To date, @MassEMA & @MassDPH have supplied over 19.3 Million pieces of Personal Protective Equipment (PPE) to hospitals, first responders, nursing homes, state agencies, & others through a massive logistics effort & assistance from @TheNationsFirst & other agencies. #COVID19MA Quote Tweet NorthSuffolk @NorthSuffolkOrg Big shoutout to the National Guard for delivering some much needed PPE to us today! Thanks @MANationalGuard  @MassEMA  #covid19MA  #HealthcareHeroes  #NotAllHeroesWearCapes  #ThankfulThursday", "2020-07-20T15:36:59.000Z": "#StoptheSpread continues this week with free testing sites open in Chelsea, Everett, Fall River, Lawrence, Lowell, Lynn, Marlborough and New Bedford, communities which will benefit from increased testing, including for asymptomatic people. Find a site: http:// mass.gov/stopthespread", "2020-07-18T14:59:49.000Z": "Deeply saddened to hear of the loss of Congressman John Lewis, a civil rights icon and an enduring advocate for justice and equality for decades. We pray for his family as we all mourn his passing.", "2020-07-17T21:02:58.000Z": "The Assawompsett Pond region is a critical natural resource for Southeastern MA, offering valuable habitat, drinking water and recreational opportunities. This partnership will ensure the region is prepared for climate change while protecting public safety and wildlife habitat.", "2020-07-17T21:02:57.000Z": "Today @MassLtGov , @EEASecretary and I joined legislators + local officials to tour the Assawompset Pond region and discuss a project led by a state, regional and local partnership to reduce flooding, increase resilience to climate change and restore habitat for fish and wildlife.", "2020-07-17T17:38:59.000Z": "Watch today's update: Tune in LIVE: http:// mass.gov/governor-updat es ", "2020-07-16T21:08:54.000Z": "Pediatric medical experts are offering thoughtful contributions about getting students back in classrooms so they can grow + learn best. @MASchoolsK12 released guidance endorsed by @AmerAcadPeds ' MA chapter that enables students to safely return to school The case for reopening schools in Massachusetts (Guest viewpoint) We have done a great job in Massachusetts, heeding the call for distancing to get our transmission rates down. We believe a return to school in this setting and with mitigation strategies is safe,... masslive.com", "2020-07-16T17:52:44.000Z": "We're committed to supporting municipalities and local economies affected by #COVID19MA Today we announced @MA_DHCD is awarding nearly $20 million in federal Community Development Block Grants for social services, job-training + small businesses. MORE: https:// bit.ly/3fNXFnL", "2020-07-16T16:10:40.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-07-16T13:44:40.000Z": "As we proceed through our #COVID19MA reopening process, @MBTA service continues to be adjusted to accommodate riders.\n\nAnd through its #RideSafer efforts, the T will continue enhanced cleaning protocols and face-covering + social distancing requirements. Quote Tweet MBTA @MBTA With Massachusetts now in Phase 3 of reopening, many services & activities are changing. What hasn't changed since the beginning is our pledge to protect public health on the T so we can all #RideSafer - including cleaning & disinfecting vehicles daily. http:// mbta.com/RideSafer", "2020-07-15T19:46:23.000Z": "Early this month, our administration highlighted early preparedness efforts for mosquito-borne illnesses like EEE, including surveillance testing, public health reminders and our bill to allow for a coordinated, statewide approach: http:// bit.ly/31RXK5p Quote Tweet Mass. Public Health @MassDPH Mosquito & tick bites can cause serious illnesses like EEE & Lyme disease. When outdoors, use EPA approved repellent, applied slowly & evenly to face, neck, arms, & legs. Rub the spray carefully onto kids w/your hands. Wear full-length protective clothing. http:// mass.gov/mosquitoesandt icks ", "2020-07-15T17:54:25.000Z": "REMINDER: All travelers to Massachusetts are instructed to self-quarantine for 14 days, except those arriving from New England, NY and NJ.\n\nMore details and key resources available at:  http:// mass.gov/covidtravel", "2020-07-14T17:31:18.000Z": "Our #StoptheSpread initiative is up and running: Free testing sites are open in Chelsea, Everett, Fall River, Lawrence, Lowell, Lynn, Marlborough and New Bedford, communities which will benefit from increased testing, including for asymptomatic people.  http:// mass.gov/stopthespread", "2020-07-14T16:30:14.000Z": "This #HurricanePreparednessWeek , be sure to check in with @MassEMA , @NWSBoston and other partners for tips on how to prepare for storms and steps the Commonwealth and others are taking, especially during #COVID19MA Quote Tweet MEMA @MassEMA Welcome to Hurricane Preparedness Week! \n\nHear from MEMA Director Sam Phillips about why now is a great time to prepare and learn more about the information we'll be sharing all week. https:// youtu.be/qtwNaW6KjMo via @YouTube", "2020-07-13T22:31:18.000Z": "Passing the word along from our friends at @MassDPH !\n\nCOVID-19 Testing Available Quote Tweet Mass. Public Health @MassDPH Help us stop the spread of COVID-19 by getting tested. Residents of these 8 communities with high rates of COVID-19 can get tested from July 10 - Aug 14 at no cost to you - even with no symptoms. All results are confidential. Learn more: http:// mass.gov/StopTheSpread  #covid19MA", "2020-07-13T23:05:37.000Z": "We're glad thousands of businesses are doing their part to implement #COVID19MA health + safety standards.\n\nBut in cases where people believe safety protocols are not being observed, the public + employees can use this site help ensure compliance: MORE: http:// mass.gov/covidcompliance", "2020-07-13T20:56:01.000Z": "Special education residential schools do terrific work serving students with special needs.\n\nDuring the pandemic, these facilities remained open, adapting quickly to maintain a safe environment for staff and students in their care. We're glad to support them with these resources.", "2020-07-13T20:56:00.000Z": "I was pleased today to join @MassLtGov and @MassHHS Sec. Sudders to visit @NECCforautism and announce $16.1 million in relief for 32 special education residential school providers to support costs related to #COVID19MA . MORE: https:// bit.ly/2Zncesw", "2020-07-13T17:20:01.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-07-13T15:17:36.000Z": "It's time to work together to make these consensus reforms happen. Read the letter: https:// bit.ly/3eiCSa1", "2020-07-13T15:17:35.000Z": "I was proud to stand with @MA_BLLC Chair Rep. Carlos González when we filed our bill to address police accountability and transparency.\n\nI agree with his recent statement to me framing the opportunity before us and the key elements we need to enact to address this urgent issue.", "2020-07-10T20:34:06.000Z": "Main threats from Tropical Storm #Fay for much of southern New England is flash flooding tonight into early Saturday across western MA & CT. Anticipating 1-2 in with locally higher amounts. Isolated wind damage or short lived tornado cannot be ruled out.", "2020-07-10T17:55:33.000Z": "REMINDER: All travelers to Massachusetts are instructed to self-quarantine for 14 days, except those arriving from New England, NY and NJ.\n\nMore details and key resources available at: http:// mass.gov/covidtravel", "2020-07-09T20:10:29.000Z": "Recently, a number of fatal crashes involved occupants not wearing seatbelts. @NHTSA research has shown a 45% reduction in the risk of fatal injury to front-seat car occupants when seat belts are used. #Seatbelts save lives, #BuckleUp every trip, every time. #DriveSafe", "2020-07-09T20:29:53.000Z": "Learn more from @MassDPH about key #COVID19MA testing resources. You can be tested if you show any symptoms of COVID-19 or are a close contact of someone who has tested positive. You can find a testing site near you using our site map. Learn more: http:// mass.gov/gettested", "2020-07-08T21:47:06.000Z": "The Commonwealth continues to prioritize getting PPE to those who need it, including childcare providers. Thanks to @TheNationsFirst for their distribution efforts and to @MassEarlyEdCare and the entire childcare community for the work you do. #COVID19MA Quote Tweet Massachusetts EEC @MassEarlyEdCare A heartfelt thank you to the @TheNationsFirst and all building security personnel from all of us across the EEC regional offices. These folks carry hundreds of boxes of PPE that is critical for reopening child care, keeping children families safe & local economies safely running.", "2020-07-08T18:51:27.000Z": "The #COVID19MA positive rate remains low statewide but many communities haven't seen the same decline.\n\nToday we announced our Stop The Spread initiative. Free testing sites will open in Chelsea, Everett, Fall River, Lawrence, Lowell, Lynn, Marlborough and New Bedford on Friday.", "2020-07-08T16:09:18.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-07-07T18:18:11.000Z": "Today, @EEASecretary joined @MassGovernor , @MassLtGov & @MassDPH Commissioner Bharel in Plymouth to highlight steps the Commonwealth is taking to prepare for the EEE season, including increased surveillance testing, larvicide and spraying. More: https:// mass.gov/news/baker-pol ito-administration-highlights-eee-preparedness-measures ", "2020-07-07T21:23:24.000Z": "The bridges over the Cape Cod Canal are some the most important transportation structures in the Commonwealth and we're glad this agreement puts us on a path to replace both. This MOU will ensure the current bridges will be maintained while steps proceed to build two new bridges.", "2020-07-07T21:23:23.000Z": "Pleased to virtually join @MassDOT Sec. Pollack, @CorpsNewEngland Cmdr. Col. William Conde, @SenWarren , @SenMarkey and @USRepKeating to mark the signing of a Memorandum of Understanding that puts us on a path to replace the Bourne and Sagamore bridges. https:// bit.ly/3iDIaQU", "2020-07-07T19:18:16.000Z": "Regional Mosquito Control Districts like the one in Plymouth are also doing great work on early mitigation + spraying but not every community belongs to a local district.\n\nThat's why we've filed legislation to facilitate a coordinated, statewide approach: https:// bit.ly/2O0OHHi", "2020-07-07T19:18:15.000Z": "While we continue to fight #COVID19 , we haven't stopped monitoring for other public health threats, including EEE. \n\nAfter last year's significant and deadly outbreak, our administration has been working on early preparedness measures for months. MORE: https:// bit.ly/31RXK5p", "2020-07-07T14:10:25.000Z": "Watch today's update: Tune in LIVE: http:// mass.gov/covid19live", "2020-07-06T17:43:34.000Z": "Today we move to Phase 3 of our reopening plan. More businesses + activities are opening.\n\nThe phased approach is driven by public health metrics and relies on businesses, workers, communities and the Commonwealth to keep workplaces + activities safe.  http:// mass.gov/reopening", "2020-07-04T15:18:24.000Z": "Wishing everyone across Massachusetts a safe and happy #IndependenceDay ! The #FourthofJuly may look different this year, but as always, today is an opportunity to celebrate our nation and its enduring values and ideals.", "2020-07-03T19:29:38.000Z": "To help visitors plan their next trip to a state parks property, @MassDCR has created a new Find a Park webpage. \n\nThe new page offers a parks search feature and highlights park amenities, activities, trail maps, and more. Find a @MassDCR Park: https:// rb.gy/pduitu", "2020-07-02T19:54:21.000Z": "Phase 3 of our reopening plan allows professional sports teams, under the authority of league-wide rules, to hold games without spectators here in the Commonwealth. @MassLtGov and I were glad to mark this progress with the @RedSox and Mayor @marty_walsh at @fenwaypark today.", "2020-07-02T16:22:26.000Z": "Massachusetts continues to make progress on stopping the spread of #COVID19MA , per key public health metrics.\n\nAs a result, we're able to announce today that Phase 3 of our reopening plan will begin this coming Monday, July 6. More at http:// mass.gov/reopening", "2020-07-02T16:03:46.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-07-02T13:16:39.000Z": "Massachusetts has dramatically increased access to #COVID19MA testing, with hundreds of sites open across the Commonwealth. With our new site, you can find a testing site near you and learn more about testing criteria. Learn more: http:// mass.gov/gettested", "2020-07-01T21:02:04.000Z": "Since March, the RIDE has seen a drop in ridership as many of the service's users are staying home. As a result, the T was able to work with these partners to ensure these vehicles can provide a secondary service to the community by delivering groceries to food-insecure people.", "2020-07-01T21:02:03.000Z": "Addressing food insecurity remains one of our most important priorities during #COVID19 , and we were pleased today to spotlight an innovative approach today with our great partners at the @MBTA , @CityOfBoston , @YMCA_Boston , and @Gr8BosFoodBank . More: https:// bit.ly/3dKjeDK", "2020-07-01T16:17:05.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-06-30T16:21:26.000Z": "MA is reopening safely, but we want to ensure out-of-state travelers take appropriate precautions\n\nEffective July 1, all travelers arriving to Massachusetts are instructed to self-quarantine for 14 days, except travelers from RI, CT, VT, NH, ME, NY + NJ https:// bit.ly/3eNLeaS", "2020-06-30T16:13:08.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-06-30T14:42:31.000Z": "We released guidance to enable kids to get back in school this fall to support continued growth\n\nWe're grateful the MA chapter of @AmerAcadPeds endorsed those plans and to the parents, students and educators who've stepped up during these challenging times U.S. Pediatricians Call For In-Person School This Fall The dangers of social isolation outweigh the risks of in-person classes for most children, says the American Academy of Pediatrics. wbur.org", "2020-06-29T20:02:26.000Z": "The #CollaborativeWorkspace grants announced today by @MassEOHED and @MassDev will allow these co-working spaces to comply with mandatory workplace safety standards that are part of our #COVID19MA reopening plan. Quote Tweet MA EOHED @MassEOHED As Massachusetts continues to move through the reopening process on a path to recovery, #coworking spaces will remain important parts of the #MAbiz landscape. Today the Administration + @MassDev announced the opening of the latest round of the #CollaborativeWorkspace Program. Show this thread GIF", "2020-06-26T19:37:44.000Z": "We look forward to working with our legislative partners to advance this bill and give communities, especially those most in need, the tools and support they require to move forward. #COVID19MA  More details: https:// bit.ly/3dDg0BK  Today's update: https:// youtu.be/f8lY8dUUdds", "2020-06-26T19:37:43.000Z": "Today we outlined a #COVID19MA economic recovery package to generate economic growth during these challenging times. \n\nThis $275 million package, designed to promote equity across the Commonwealth, is an update to our economic development legislation we filed earlier this year.", "2020-06-26T15:31:06.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-06-25T16:28:21.000Z": "Today, @MASchoolsK12 released initial guidance for school reopening this fall that prioritizes getting students safely back to school in person, following a comprehensive set of health and safety requirements. Read more: https:// bit.ly/3dBlFZ4  #COVID19MA", "2020-06-25T16:25:12.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-06-24T18:29:09.000Z": "The @MBTA continues work to accelerate investments to improve service, supported by necessary diversions and our $8 billion funding plan to make upgrades across the system. Quote Tweet MBTA @MBTA Earlier this year, we announced a plan to close the Green Line C Branch for a month to expedite work for better, safer, more reliable service. We remain committed to #BuildingABetterT , so from 8:45pm on July 5-August 1, we'll bus Cleveland Circle-Kenmore. http:// ow.ly/znRd50AgJS7", "2020-06-24T17:15:53.000Z": "I called for an independent investigation into the tragic events at the Holyoke Soldiers' Home to get to the bottom of what happened and take immediate action. This report lays out in heartbreaking detail the failures that unfolded there, and the tragic outcomes that followed.", "2020-06-24T16:01:26.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-06-23T18:00:20.000Z": "By working collaboratively with the community and selecting a developer with a strong minority and women-owned business commitment, we are helping increase housing options and community accommodations while promoting economic opportunity in #Mattapan . https:// bit.ly/2VbsHNW", "2020-06-23T18:00:19.000Z": "The redevelopment of the final parcel of the former Boston State Hospital in #Mattapan is a chance for us to invest in the community + support minority-owned firms.\n\nPleased to join @DCAMM_MA Comm. Gladstone, @VoteRussell and the developer, Primary Corp. to mark this new project.", "2020-06-23T15:10:53.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-06-23T13:57:20.000Z": "We're pleased to announce that the annual #TaxFreeWeekend will take place August 29-30.\n\nThe #SalesTaxHoliday is a great way to support consumers and small businesses. This year it's a great way to support our economy that's been impacted by #COVID19MA   https:// bit.ly/31l6RLZ", "2020-06-22T15:25:53.000Z": "As the @MBTA continues to welcome back more riders, the focus remains on keeping people safe + healthy.\n\nPlease remember to: Wear a face covering Maintain a healthy distance Practice good hygiene http:// mbta.com/ridesafer  #RideSafer  #COVID19MA Quote Tweet MBTA @MBTA As service increases and more riders return to taking the T, we all must share the responsibility of protecting public health on public transportation. Together, our riders and employees can make this new world we're traveling in a safer one. #RideSafer  http:// mbta.com/RideSafer", "2020-06-20T13:33:55.000Z": "Our administration has launched a revamped #COVID19MA testing website, a convenient resource where you can find a testing site near you and learn about whether you should be tested. Visit the site: http:// mass.gov/gettested  MORE via @MassHHS : https:// bit.ly/2YVUym6", "2020-06-19T15:04:36.000Z": "#ZakimBridge  #Boston & #BurnsBridge  #Worcester will shine Green, Red & Yellow tonight, June 19th. #Juneteenth", "2020-06-19T16:45:15.000Z": "#COVID19MA public health metrics continue to improve. As a result, today we announced that under Phase 2 of our reopening plan, additional businesses + activities may reopen Monday June 22 including indoor dining, additional personal services and more.  https:// bit.ly/2BktK76", "2020-06-19T16:23:31.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-06-19T14:49:40.000Z": "Today I was honored to issue a proclamation declaring June 19, 2020 as Juneteenth in Massachusetts. #Juneteenth2020 is an opportunity to recommit ourselves to the goal of creating a more equal and just society. Read more: https:// bit.ly/3hHFpgY", "2020-06-19T00:11:08.000Z": "For a decade, @TeamProject351 has built a community for young people across the Commonwealth focused on giving back.\n\nAt this year's virtual Leadership Reunion, First Lady Lauren Baker and I were honored to mark 10 years of this great organization. #35ONE Quote Tweet Project 351 @TeamProject351 A big thank you to @MassGovernor  @CharlieBakerMA and First Lady Lauren Baker for your support of Project 351. You are always there for us and we couldn't be more grateful. #35ONE Hear the Governor's and Mrs. Baker's message: https:// vimeo.com/430054766", "2020-06-18T20:20:28.000Z": "Food security remains an important priority during #COVID19MA and organizations like @Gr8BosFoodBank are a big part of how the Commonwealth can support families who need help. Thanks to @RaytheonTech for stepping up and supporting this important work. Quote Tweet The Greater Boston Food Bank @Gr8BosFoodBank Food banks need support from the community now more than ever. We appreciate @RaytheonTech for their commitment to fighting hunger in Eastern Massachusetts. Their donation will help to provide more meals to people in need.", "2020-06-18T18:03:45.000Z": "Our statement on today's Supreme Court ruling:", "2020-06-18T13:53:15.000Z": "REMINDER: Today is the second of two days where over 50 free #COVID19MA testing sites are open to anyone who has attended a large gathering.\n\nThanks to the many health care partners who worked with @MassHHS + @MassDPH on this effort. Find a testing site http:// mass.gov/gettested", "2020-06-17T21:23:42.000Z": "We are grateful for the Black and Latino Caucus' and public safety officials' collaboration on this legislation, and look forward to working with the Legislature to get it passed. More details: https:// bit.ly/3fws3lS  Read the bill: https:// bit.ly/30Q4lwG", "2020-06-17T21:23:41.000Z": "Today @MassLtGov , @EOPSS Sec. Turco and I joined  members of the @MA_BLLC to announce a bill creating a framework for certifying Massachusetts law enforcement officers, supporting accountability + access to records, and promoting training so officers can better serve communities.", "2020-06-17T16:10:58.000Z": "Watch today's update: Tune in LIVE: http:// bit.ly/3e5Vafs", "2020-06-17T16:00:38.000Z": "Today our administration released our FY21 Capital Investment Plan. This responsible plan sustains existing investments + provides flexibility as we continue to confront #COVID19MA and associated challenges. Details: https:// bit.ly/3earQ7L  Full plan: http:// mass.gov/capital", "2020-06-16T18:47:34.000Z": "Last week, we joined @WGBH and special guests to congratulate and celebrate the #MAClassof2020 , a resilient group of graduates. I was honored to share some words of advice in a commencement message.\n\nWatch the message: http:// mass.gov/commencement20 20  Full special: http:// wgbh.org/commencement20 20 ", "2020-06-16T17:06:22.000Z": "#COVID19MA | Advancing MA PPE Production\n\nFrom East Longmeadow to Lawrence we've had the chance to spotlight work by Massachusetts manufacturers to shift operations to produce PPE Learn more about our Manufacturing Emergency Response Team via @Mass_Tech  https:// bit.ly/M-ERT", "2020-06-15T17:26:13.000Z": "By working with a wide range of health care partners, our Administration is helping provide over 50 pop-up #COVID19MA testing sites for people who have attended large gatherings.\n\nGet tested at no cost to you on 6/17 or 6/18. Find a site near you at http:// mass.gov/gettested", "2020-06-15T16:07:53.000Z": "Watch today's #COVID19MA update:\n\nTune in LIVE: http:// mass.gov/covid19live", "2020-06-12T20:07:44.000Z": "Glad to visit @BIDMChealth with @SecAzar to tour COVID-19 test kit assembly areas and primary care practice.\n\nMassachusetts' response to #COVID19MA has been driven by our world class health care system, anchored by institutions like Beth Israel. WATCH: https:// youtu.be/1RxGya8dYjM", "2020-06-12T16:11:38.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-06-11T19:35:27.000Z": "We're also investing $5 million more in the Healthy Incentives Program.\n\nTogether these investments will be important tools to address food supply chain needs and support vulnerable populations who are food-insecure, during the pandemic and beyond. More https:// bit.ly/3cURdce", "2020-06-11T19:35:26.000Z": "In May, we committed $56 million to implement recommendations of our Food Security Task Force.\n\nToday @MassLtGov and I joined @MassHHS Sec. Sudders and @EEASecretary Theoharides to announce that applications are open for the $36 million Food Security Infrastructure Grant Program.", "2020-06-11T19:35:25.000Z": "Food security has long been a priority for our administration. But this emergency has only heightened the importance of this issue, and of the vital work done by leaders in this space like the @Gr8BosFoodBank .\n\nGreat to tour GBFB's facility and spotlight their incredible work.", "2020-06-11T15:53:28.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-06-11T13:47:17.000Z": "Great to have the chance to share some thoughts with the #MAClassof2020 as part of @WGBH 's commencement special. Congratulations and good luck to this resilient group of high school graduates! Full address: http:// mass.gov/commencement20 20   Watch the special: http:// wgbh.org/commencement20 20 ", "2020-06-10T19:49:22.000Z": "Grateful for partners like @SalvationArmyMA working with @MassEMA to deliver on food security priorities during #COVID19MA . Quote Tweet Salvation Army of MA @SalvationArmyMA Since the #COVID19 pandemic began @SalvationArmyUS has been fighting food insecurity. Thanks to @MassEMA  @SamPhillipsPHL for touring our emergency feeding hub yesterday. @MassGovernor 's commitment to feeding will bring an additional 25K food boxes to #Massachusetts each month.", "2020-06-10T00:03:32.000Z": "A few words of wisdom from @MassGovernor to the graduating #MAClassof2020 as part of tonight's virtual commencement ceremony.\n\nWATCH HERE → http:// bit.ly/MAClassof2020", "2020-06-09T21:16:42.000Z": "New Balance has an important manufacturing footprint here in the Commonwealth, and we are glad that our Administration's Manufacturing Emergency Response Team helped support the company's pivot to PPE production. MORE: https:// bit.ly/3h5BHxv  PHOTOS: https:// bit.ly/2MH5y1h", "2020-06-09T21:16:41.000Z": "Today @MassLtGov and I toured @newbalance 's Lawrence factory, a facility that has helped the company produce more than 1 million masks. The tour highlighted a new mask model being rolled out to consumers in the coming weeks, and a new surgical mask model for front-line workers.", "2020-06-09T18:47:31.000Z": "Looking forward to @WGBH 's \"Massachusetts Commencement 2020\" special tonight.\n\nGlad to have the opportunity to share some thoughts with the #MAClassof2020 as they reflect on their high school careers and look to the future. Watch here tonight at 7:30PM: http:// bit.ly/MAClassof2020", "2020-06-09T18:00:05.000Z": "As businesses and activities continue opening in Phase 2 of our #COVID19MA reopening process, remember you can visit our Reopening Massachusetts site for: Sector-specific protocols Timeline for when businesses can reopen Overall safety guidance http:// mass.gov/reopening", "2020-06-09T15:01:40.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-06-08T20:10:57.000Z": "Glad to partner with @WGBH and some special guests to celebrate the terrific #MAClassof2020 , who proved how resilient they are by navigating a senior spring with some truly unexpected challenges. Join us tomorrow at 7:30PM! MORE: http:// bit.ly/MAClassof2020 Quote Tweet WGBH @wgbh TMRW: Celebrate the #MAClassof2020 with us, @MassGovernor and some very special guests! Our virtual commencement ceremony kicks off Tuesday at 7:30pm ET on WGBH-2 and is available for streaming right here → http:// bit.ly/MAClassof2020", "2020-06-08T19:31:05.000Z": "Today we move to Phase 2 of our reopening plan, with more businesses + activities opening.\n\nThe phased approach is driven by public health metrics and relies on businesses, workers, communities and the Commonwealth to keep workplaces + activities safe.  http:// mass.gov/reopening", "2020-06-06T18:47:32.000Z": "This next step will allow more businesses + activities to resume operations, subject to both universal mandatory safety standards and sector-specific protocols.\n\nCertain health care services that were suspended may also resume. More details from today: https:// bit.ly/2MCQjWW", "2020-06-06T17:13:41.000Z": "Public health metrics for #COVID19MA continue to move in the right direction.\n\nAs a result, Phase 2 will begin Monday June 8, meaning retail, outdoor dining, hotels/lodging + more can open with certain restrictions. Full list + sector-specific protocols http:// mass.gov/reopening", "2020-06-06T17:07:16.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-06-06T14:04:52.000Z": "Yesterday, @MassLtGov and I had the chance to spotlight workplace safety standards for laboratories and hear about research work being done to push back against #COVID19MA . Thanks to @labcentral in Cambridge for hosting us. WATCH yesterday's update: https:// youtu.be/Fvf7cWIpmbc", "2020-06-05T21:33:06.000Z": "via @BostonGlobe : \"MBTA and community groups unite to bring thousands of food deliveries to vulnerable citizens during pandemic\"\n\nThanks to the @MBTA , @CityofBoston , @YMCA_Boston , and @Gr8BosFoodBank for this innovative effort to address food insecurity. MBTA and community groups unite to bring thousands of food deliveries to vulnerable citizens during... A partnership between the MBTA, the City of Boston, the YMCA of Greater Boston, and the Greater Boston Food Bank help provide the city's most vulnerable residents with food through the RIDE paratra... bostonglobe.com", "2020-06-05T18:33:16.000Z": "Watch today's #COVID19MA update, live from @labcentral in Cambridge as we spotlight workplace safety standards and work to push back on the virus. Tune in LIVE: http:// mass.gov/covid19live", "2020-06-05T16:34:21.000Z": "As the Commonwealth marks the beginning of #PrideMonth , I was grateful for the chance to share some thoughts for the @CityofBoston 's virtual flag-raising, marking @bostonpride 's 50th anniversary.\n\nThanks for all you've done to advance equality + dignity here in MA and everywhere.", "2020-06-05T15:35:38.000Z": "Our nation-leading contact tracing initiative with @PIH continues to connect with #COVID19MA confirmed cases and their close contact to collect crucial data that enables us to continue to push back on the virus. Answer the call from the MA COVID Team: http:// mass.gov/MAtracingteam", "2020-06-04T19:37:22.000Z": "This afternoon at 3:45 PM, while meeting with the @MA_BLLC , we are joining the @NAACP and people across the country for a moment of silence to honor the life of George Floyd. Please join us in spending 8 minutes and 46 seconds to remember him and reflect on this moment.", "2020-06-04T17:09:52.000Z": "Terrific partnership with the @MBTA  @CityOfBoston  @YMCA_Boston + @Gr8BosFoodBank to use the RIDE's vehicles to distribute food to vulnerable people. With experience serving at-risk populations, the RIDE is well-positioned to support this food access effort Quote Tweet MBTA @MBTA In partnership with @CityOfBoston , @YMCA_Boston , & @Gr8BosFoodBank , The RIDE has been using its vehicles to deliver food to residents. We're pleased to share resources & complete over 3,185 deliveries, totaling 5,129 grocery bags & 24,000 school meals. http:// ow.ly/iGdt50zYVof", "2020-06-03T19:56:05.000Z": "More #COVID19MA details from today's briefing: New guidance for childcare providers and summer camps via @MassEarlyEdCare : http:// bit.ly/36Yld5t  More on our new long-term testing plan via @MassHHS  http:// bit.ly/2XrgJkM  WATCH today's update: https:// youtu.be/W0UOs7YYvjE", "2020-06-03T19:56:04.000Z": "Today, we outlined details around several key announcements we made Monday related to #COVID19MA reopening, testing and other priorities. More details on Phase 2 planning, including new guidance and the executive order I issued on Monday via @MassEOHED : http:// bit.ly/2XTLyh5", "2020-06-03T16:10:48.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-06-02T21:38:26.000Z": "Please keep doing your part to prevent the spread of COVID-19 - together. Massachusetts continues to push back on this virus. \n\nAnd if you choose to exercise your rights to free speech, please do so peacefully. Thank you to those who marched peacefully.", "2020-06-02T20:46:59.000Z": "With $374 million in federal funds, MA plans to: Boost lab capacity to 45,000 by July Ensure on-demand access to testing for symptomatic individuals, close contacts + high-risk populations Prepare for surges in testing Sustain our nation-leading contact tracing effort", "2020-06-02T20:46:58.000Z": "Over the weekend, our #COVID19MA Response Command Center submitted a plan to the federal government that supports our long-term strategy for continued and expanded testing and tracing. More via @MassHHS : https:// bit.ly/2XrgJkM", "2020-06-02T17:07:31.000Z": "Yesterday @MassEarlyEdCare released guidance for the reopening of childcare, recreational summer camps and youth programs.\n\nThese programs can open in Phase 2 after submitting specific plans to meet protocols around cleaning, food safety and more. MORE: https:// bit.ly/36Yld5t", "2020-06-02T00:47:05.000Z": "Earlier today, I shared some thoughts about this weekend's events.\n\nBy an order of magnitude I can't add up, the number of people that want to build on progress and do well for one another dwarfs those who want to do the opposite. Read more: https:// bit.ly/2ZXEDpN", "2020-06-01T20:56:14.000Z": "Today I issued an executive order providing further detail about Phase 2, as we continue to plan for a safe and responsible reopening.\n\nThe order permits Phase 2 businesses + activities to begin preparing for their eventual opening. MORE via @MassEOHED : https:// bit.ly/2XTLyh5", "2020-06-01T19:36:26.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-06-01T03:48:26.000Z": "...from the individuals whose violent actions, looting and property destruction was criminal and cowardly - and distracted from the powerful statement made today by thousands of Massachusetts residents.", "2020-06-01T03:48:25.000Z": "The murder of George Floyd at the hands of police was a horrible tragedy - one of countless tragedies to befall people of color across the United States. The vast majority of protesters today did so peacefully, toward a common goal of promoting justice and equality.", "2020-05-29T18:22:00.000Z": "As part of our planning for a safe transition to Phase 2, we are releasing restaurant + lodging guidance today.\n\nOn Monday I will issue an executive order with further detail that will also enable professional sports teams to begin practice. #COVID19MA  http:// mass.gov/reopening", "2020-05-29T18:09:43.000Z": "Watch today's #COVID19MA update:\n\nTune in LIVE: http:// mass.gov/covid19live", "2020-05-29T15:48:32.000Z": "Last week, to honor our fallen heroes on #MemorialDayMA weekend, our administration participated in virtual ceremonies throughout the Commonwealth.\n\nWe are forever grateful for the service and sacrifice of those brave men + women More available at http:// mass.gov/MemorialDay .", "2020-05-28T23:24:38.000Z": "As part of our overall investments supporting Massachusetts' manufacturing sector in PPE production, the Fabric Discovery Center was recently awarded a grant for high-volume testing equipment.\n\nWe're glad to partner with the Center to help frontline workers get the PPE they need.", "2020-05-28T23:24:37.000Z": ". @UMassLowell 's Fabric Discovery Center is a key partner of our Manufacturing Emergency Response Team's efforts to increase Massachusetts' supply of personal protective equipment + other supplies\n\nThis innovative @UMLResearch facility tests + screens PPE before it is distributed.", "2020-05-28T20:27:01.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-28T16:34:07.000Z": "This year, high school graduations look different due to #COVID19MA .\n\nTo celebrate Massachusetts' #Classof2020 , we're teaming up with @WGBH and special guests like @SteveCarell , @McCourtyTwins , @RedSox , @celtics + more for a special ceremony on June 9.  http:// bit.ly/2XC3L2C", "2020-05-27T23:19:03.000Z": "More activities are reopening this week as part of Phase 1 of our #COVID19MA reopening plan.\n\nReopening is driven by public health metrics and relies on a shared effort by businesses, workers, communities and the Commonwealth to keep workplaces safe.  http:// mass.gov/reopening", "2020-05-27T20:18:07.000Z": "At today's #COVID19MA briefing, @MassDOT Sec. Pollack and @MBTA GM Poftak outlined ongoing measures implemented by the T to keep riders + workers safe and healthy.\n\nFace coverings are required, and capacity on shuttle buses is limited to 20 passengers. https:// bit.ly/3cbyKHQ", "2020-05-27T20:18:06.000Z": "Accelerated infrastructure work on the Blue Line will help provide improved flood resilience within the harbor tunnel and faster more reliable service for riders.\n\nToday I had the chance to tour these ongoing upgrades alongside @SpeakerDeLeo , Sen. @joeboncore and other officials.", "2020-05-27T15:31:35.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-27T13:29:46.000Z": "Massachusetts has dramatically increased testing capacity and remains a national leader in per-capita testing.\n\nTo make #COVID19MA testing more accessible, we are working with partners to grow our network of 260+ testing sites. Find a site near you: http:// mass.gov/covidtestmap", "2020-05-26T19:21:33.000Z": "Today @MassLtGov and I joined @EEASecretary Theoharides and @MassHHS Secretary Sudders to discuss our recent investments in food security during #COVID19MA .\n\nThis $56 million in investments includes support across the food supply chain, from farmers and fishers to food banks.", "2020-05-26T16:13:12.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-25T19:26:37.000Z": "For more virtual #MemorialDayMA ceremonies from the @ChelseaSOHO + @HolyokeSOHO , a full list of buildings + structures across MA illuminated in honor of #GoldStarFamilies , or to find where the program will air or stream near you, please visit: http:// mass.gov/MemorialDay . Massachusetts Memorial Day 2020 The Baker-Polito Administration will recognize Memorial Day this year in a virtual format, enabling the Commonwealth to continue to honor members of the military who have sacrificed for our country. mass.gov", "2020-05-25T19:18:38.000Z": "Today, we reflect on the service and sacrifice made by the men + women in uniform who gave their lives to protect our freedom.\n\nThis #MemorialDayMA , we joined @MassHHS , @MassDVS and legislative leaders to host a virtual ceremony to honor our heroes. : Massachusetts Memorial Day 2020: A Virtual Ceremony to Honor our... Join us for our Virtual Memorial Day Ceremony with speakers and musical performers from across the Commonwealth, remarks by Governor Baker and Lt. Governor P... youtube.com", "2020-05-25T16:25:48.000Z": "The State House #MemorialDayMA ceremony looked different this year but it was still a solemn opportunity to honor fallen heroes. I joined @TheNationsFirst to lay the wreath and pay tribute to those we've lost.\n\nWatch the ceremony later this afternoon at http:// mass.gov/MemorialDay", "2020-05-25T12:58:08.000Z": "Each year, @MaMilHeroes ' #HeroesFlagGarden is a powerful tribute to the men and women who paid the ultimate sacrifice in service to their country, and to their families.\n\nWhile the dedication looked much different this year, the commitment to honoring and remembering remains.", "2020-05-24T18:27:30.000Z": "This weekend, we honor and remember the heroes who paid the ultimate sacrifice to protect our freedoms. We are forever grateful for their service.\n\nJoin us tomorrow for a virtual #MemorialDayMA ceremony at http:// mass.gov/MemorialDay .", "2020-05-24T14:44:09.000Z": "Tonight, be on the lookout for buildings, bridges, flags & parks across the Commonwealth that will be illuminated in gold to honor #GoldStarFamilies . \n\nTake a photo of the gold lights & post w #MemorialDayMA so we can honor our heroes together, even if we are physically apart. GIF", "2020-05-22T20:44:30.000Z": "This site can test up to 1,000 Lawrence residents per day and is the result of a partnership between the City, @LawrenceGenHosp , @GLFHC + others.\n\nOur testing plan will scale up capacity. Sites like these will help increase access. Find a site near you: http:// mass.gov/covidtestmap", "2020-05-22T20:44:29.000Z": "As we begin a phased reopening, #COVID19MA testing remains one key tool in our work to keep people safe.\n\nToday @MassLtGov , @MassHHS Sec. Sudders and I were glad to join Lawrence Mayor @DanRivera01843 at a new testing site launched recently thanks to a $1M investment by the City.", "2020-05-22T17:58:57.000Z": "Memorial Day is a time to pause, honor and remember. Thank you, @MassGovernor , Mayor @marty_walsh , @MassAGO , @AdjutantGenMA & all who are honoring our families this uniquely difficult weekend. Please share this & share your safe-at-home tributes at #HeroesFlagGarden", "2020-05-22T17:07:57.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-22T15:29:32.000Z": "Our first-in-the-nation Community Tracing Collaborative with @PIH is doing important work to connect with confirmed #COVID19MA cases and their closes contacts to help them with next steps + collect crucial data Answer the call from the MA COVID Team  http:// mass.gov/MAtracingteam", "2020-05-19T17:34:36.000Z": "Tune in to our Facebook page this Thursday 5/21 at 5:00PM for our special Virtual Memorial Day observance: https:// facebook.com/watch/?v=44619 91510493084 ", "2020-05-20T23:06:22.000Z": "Glad to virtually join the #ConvoyofChampions today at #FenwayPark to recognize #NationalEMSWeek .\n\nThese courageous first responders continue to serve as heroes on the front-lines of #COVID19MA , and we are grateful for their service and bravery. \n\nThank you, EMS workers!", "2020-05-20T20:38:17.000Z": ". @MassLtGov and I were glad to be at Symmons Industries today to spotlight the implementation of the #COVID19MA workplace safety standards part of our reopening plan. Symmons is ensuring workplace safety as they scale manufacturing operations back up. : https:// bit.ly/3bM8ELh", "2020-05-19T19:58:28.000Z": "As we begin a phased reopening, @MassDPH has issued an updated Safer At Home Advisory. Seniors + those at risk should stay home if they can Others should go out only for essential + reopened activities Wear a face-covering if you can't distance  http:// mass.gov/saferathome", "2020-05-19T18:38:15.000Z": "Our phased reopening is driven by our ability to meet public health metrics that show we are pushing back on #COVID19MA .\n\nIt also relies on a shared effort by businesses, workers, communities and the Commonwealth to keep workplaces and activities safe.  https:// bit.ly/reopeningphases", "2020-05-19T16:50:34.000Z": "Businesses opening in Phase I must follow mandatory workplace standards + sector-specific protocols: Construction Manufacturing Office space Barber shops + hair salons Laboratories Car washes Pet grooming\n\nRead the protocols: http:// mass.gov/reopening  #COVID19MA", "2020-05-18T15:21:14.000Z": "@MassDPH is also releasing a new \"Safer At Home\" Advisory, which instructs residents to stay at home unless engaging with newly opened activities, as a way to continue limiting the spread of COVID-19. Read that advisory here: Safer-at-Home Advisory Safer-at-Home People over the age of 65 and people who have underlying health conditions - who are at high risk for COVID-19 - should continue to stay home except for essential errands such as going... mass.gov", "2020-05-18T15:21:13.000Z": "Today, we're releasing \"Reopening Massachusetts,\" the report of our Reopening Advisory Board. \n\nThe report details a four-phased strategy to responsibly reopen businesses and activities while continuing to fight #COVID19MA  More about reopening: http:// mass.gov/reopening", "2020-05-18T15:03:20.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-16T16:36:13.000Z": "Our first-in-the-nation Community Tracing Collaborative with @PIH is doing important work to connect with confirmed #COVID19MA cases and their closes contacts to help them with next steps + collect crucial data. Answer the call from the MA COVID Team http:// mass.gov/MAtracingteam", "2020-05-16T13:15:00.000Z": "While @MassDCR state parks remain open and available for all to enjoy, we face masks or coverings are required to protect yourselves, other visitors, and aid in the prevention of spreading #COVID19 . https:// bit.ly/2xgvQDy", "2020-05-15T18:35:15.000Z": "We thank these employers for their commitment to keeping workers safe amidst #COVID19MA Grateful to @MassCompetes , @MABizRoundtable , @AIMBusinessNews , @MAHighTech , @MassBio + @kendallnow for polling members to produce this list of employers representing around 150,000 employees.", "2020-05-15T18:31:10.000Z": "Yesterday we announced our long-term plan for #COVID19MA testing, including more capacity and a continued expansion of testing in hotspots + other key areas.\n\nToday we're launching a website with a map of testing sites so you can find a site near you.  http:// mass.gov/covidtestmap", "2020-05-15T18:26:31.000Z": "Some of the largest employers in Massachusetts are now committing to continue work-from-home policies for the foreseeable future.\n\nWe are amazed by the ingenuity + toughness that the people of MA are displaying. These employers are taking the right steps to balance work + health.", "2020-05-15T18:13:05.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-15T14:29:24.000Z": "May is #MentalHealthAwarenessMonth and @MassHHS is highlighting resources to help residents cope during #COVID19MA . It's incumbent on all of us to remember to reach out. Ask. Listen. Encourage. Check in. Learn more: http:// mass.gov/CopingDuringCO VID  Quote Tweet Mass. HHS @MassHHS During #MentalHealthAwarenessMonth , we're launching new resources to help #Massachusetts residents cope during #COVID19MA , championed jointly by @MA_Senate Pres @KarenSpilka & @MassHHS Secretary @MLSudders with @MassDPH & @MassDMH   https:// youtube.com/watch?v=_-yigN jsnQY&feature=youtu.be   #CopingDuringCOVID Show this thread", "2020-05-14T23:37:16.000Z": "Our administration is preparing to distribute up to $502 million from the federal Coronavirus Relief Fund to cities + towns for #COVID19MA response costs.\n\nWe'll distribute guidance to municipalities on the formal process to maximize federal resources.  https:// bit.ly/2T5y7Jm", "2020-05-14T19:18:31.000Z": "Today we also highlighted the arrival of 7.5 million pieces of PPE delivered to Massachusetts across 6 flights.\n\nGrateful for the support of Chinese Consul General Huang Ping + many others who worked with our Administration to make this happen. WATCH: COVID-19 Update: Testing Expansion Plan, CVS Testing Sites, New PPE... Today, the Baker-Polito Administration announced expanded COVID-19 testing capacity and strategy, and provided an update on personal protective equipment (PP... youtube.com", "2020-05-14T19:18:30.000Z": "By building capacity we've laid groundwork for the future of #COVID19MA testing. Today we outlined our long-term plan: Boost capacity to 45,000 daily tests by July Focus on hotspots + areas with low availability Improve turnaround time Randomized testing for surveillance", "2020-05-14T16:08:54.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-13T20:29:17.000Z": "Building on our testing ramp-up we have conducted over 400,000 tests. Staffed with nearly 1,600 tracers, our Community Tracing Collaborative with @PIH has reached nearly 18,000 confirmed cases + over 14,000 of their contacts. WATCH today's update: COVID-19 Update: Testing Criteria Expansion, Tracing Update at Fall... Today, Governor Charlie Baker visited a drive-through testing site at Stanley Street Treatment and Resources (SSTAR) in Fall River, one of 18 community healt... youtube.com", "2020-05-13T20:29:16.000Z": "Key testing + tracing takeaways: Expanded testing eligibility: @MassDPH guidance now recommends testing for all symptomatic individuals AND individuals identified as close contacts through contact tracing.\n\nRead the guidance: https:// bit.ly/3dBFsrM", "2020-05-13T20:29:15.000Z": "Glad to tour the drive-through testing site at @sstarinc , a community health center in Fall River that's also participating in our expansion of testing at these facilities.\n\nToday's #COVID19MA briefing was an update on our testing and tracing initiatives. https:// bit.ly/3cu9DkL", "2020-05-13T16:24:22.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-13T16:24:02.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-13T15:02:36.000Z": "If you would like to volunteer during the COVID-19 public health emergency, the Commonwealth is seeking people from both medical and non-medical professions. Sign up here: https:// maresponds.org  #covid19MA", "2020-05-13T14:31:47.000Z": "The Community Tracing Collaborative is connecting with confirmed cases of #COVID19MA and their close contacts. \n\nThese connections inform next steps for people and give us crucial data as we fight this virus. Answer the call from the MA COVID Team!  http:// mass.gov/matracingteam", "2020-05-13T01:13:31.000Z": "Mat-Tek's transition from the manufacture of cell culture media to the production of viral transport media was streamlined with support from M-ERT experts.\n\nMat-Tek has also pivoted labs and staff into producing hand sanitizer, another key supply line during #COVID19MA .", "2020-05-13T01:13:30.000Z": "Earlier today, I joined Senate President @KarenSpilka to tour @MatTekLifeSci , an Ashland company participating in our Manufacturing Emergency Response Team which supports MA manufacturers' efforts to shift operations to produce PPE and other supplies. : https:// bit.ly/2WPlhjs", "2020-05-12T18:29:57.000Z": "Today I filed a supplemental budget to authorize $1 billion in spending necessary to cover incurred + expected costs during #COVID19MA . We expect that this spending will result in no net cost to the Commonwealth after anticipated federal reimbursement.  https:// bit.ly/2SZ1Wvb", "2020-05-12T17:38:01.000Z": "Watch today's #COVID19MA update:\n\nTune in LIVE: http:// mass.gov/covid19live", "2020-05-12T15:13:37.000Z": "UPDATE: As of yesterday's PPE distribution report, our Administration has now distributed over 10 million pieces of personal protective equipment to hospitals, first responders, long-term care facilities and others on the front lines of #COVID19MA . Quote Tweet MEMA @MassEMA To date, @MassEMA & @MassDPH have supplied over 9 Million pieces of Personal Protective Equipment (PPE) to hospitals, first responders, nursing homes, state agencies, & others through a massive logistics effort & assistance from @TheNationsFirst & other agencies. #COVID19MA", "2020-05-12T14:09:38.000Z": "Every person can play a part in reducing the spread of #COVID19 by wearing a face mask when you need to go out in public. #StopTheSpread  #COVID19MA Quote Tweet Charlie Baker @MassGovernor As of last week, all residents are required to wear a face-covering in public places where it's not possible to maintain a safe social distance.\n\nMasks can help reduce the spread of #COVID19MA , protecting both you and those around you.\n\nLearn more: http:// mass.gov/coveryourface", "2020-05-12T13:27:01.000Z": "As of last week, all residents are required to wear a face-covering in public places where it's not possible to maintain a safe social distance.\n\nMasks can help reduce the spread of #COVID19MA , protecting both you and those around you.\n\nLearn more: http:// mass.gov/coveryourface", "2020-05-11T19:12:27.000Z": "Today we announced a four-phase approach to reopening the economy and published mandatory workplace safety standards that will apply across all sectors and industries when reopening begins. Phased approach: https:// bit.ly/3bnmMKP  Workplace standards: https:// bit.ly/2AdSjly", "2020-05-11T17:19:39.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-11T15:41:57.000Z": "I sat down with @CBSThisMorning to talk about MA's first-in-the-nation contact tracing program.\n\nThe program enables us to connect with #COVID19MA positive cases and close contacts to help them with their next steps and inform our knowledge so we can continue to fight this virus.", "2020-05-11T14:17:18.000Z": "Please remember: If you feel sick with #COVID19MA symptoms, you should #stayhome and connect with telemedicine options via @buoyhealth 's online symptom checker. Find it at http:// mass.gov/covid19 or http:// buoy.com/mass", "2020-05-09T14:33:12.000Z": "We are grateful for our partnership with community health centers through the @MassLeague . These facilities are deeply rooted in the neighborhoods they serve, and are playing a key role in testing and tracing. Details: https:// bit.ly/3fBaVfM  Watch: COVID-19 Update: Community Health Centers' Awareness Campaign In partnership with the Mass League of Community Health Centers, the Baker-Polito Administration today announced an upcoming new COVID-19 public awareness ca... youtube.com", "2020-05-09T14:33:11.000Z": "The work done by community health centers has been crucial to our #COVID19MA response, building on the work they do every day to care for residents.\n\nThese facilities are open and ready to support patients. Glad to announce a campaign reminding people to seek the care they need.", "2020-05-08T18:39:57.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-08T14:25:38.000Z": "Pleased to join our partners from @PIH and the local public health community to provide an update yesterday on our first-in-the-nation contact tracing initiative.\n\nRamping up this effort is crucial to tracking and slowing the spread of this virus. MORE: https:// bit.ly/3dwdFsZ", "2020-05-07T19:20:16.000Z": "To date, @MassEMA & @MassDPH have supplied over 9 Million pieces of Personal Protective Equipment (PPE) to hospitals, first responders, nursing homes, state agencies, & others through a massive logistics effort & assistance from @TheNationsFirst & other agencies. #COVID19MA", "2020-05-07T16:47:40.000Z": "Our Community Tracing Collaborative with @PIH has over 1,600 people making calls. Since the effort launched, they've connected with nearly 14,000 confirmed cases and reached out to more than 7,500 of their contacts.\n\nHelp us trace #COVID19MA : Pick up when the MA COVID Team calls!", "2020-05-07T16:19:33.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-07T13:36:37.000Z": "Last week we expanded our initiative to boost testing in community health centers, in partnership with the @MassLeague + @QuestDX .\n\nThese crucial facilities are deeply rooted in their communities and play a key role in our work to expand testing, especially in high-density areas.", "2020-05-06T20:26:08.000Z": "Thanks to the Krafts + @GilletteStadium for hosting this swearing-in that's crucial to getting these new troopers into our communities to protect and serve during the #COVID19MA crisis\n\nAnd thank you to the new troopers who are stepping up to serve during these challenging times.", "2020-05-06T20:26:07.000Z": "The 240 trainees of the 85th @MassStatePolice Recruit Training Troop became troopers under unprecedented circumstances and their swearing-in reflected that fact.\n\nToday's socially-distanced swearing-in was not open to audience members, but family + friends watched via livestream.", "2020-05-06T16:30:39.000Z": "Members of the 85th Recruit Training Troop Swearing-in Ceremony @GilletteStadium", "2020-05-06T16:38:50.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-06T15:20:50.000Z": "This #NationalNursesDay we should all recognize the heroic work of nurses across Massachusetts - both during this crisis and every single day. \n\nWe are so grateful for the work you do and the care you provide. THANK YOU!", "2020-05-06T14:09:28.000Z": "Thanks to the @104FighterWing for saluting our front-line heroes with an F-15 flyover over health care facilities across the Commonwealth today. @TheNationsFirst   #MassSalutes  #AirForceSalutes  #AFFlyover Quote Tweet 104th Fighter Wing @104fighterwing To help you catch the flyover our F-15s are scheduled to perform this afternoon here is a map of the planned flight path and approximate times. \n\nWe invite everyone to take pictures and post them with the hashtags below. #MassSalutes  #AirForceSalutes  #AFFlyover", "2020-05-05T21:12:13.000Z": "REMINDER: Effective tomorrow, residents are required to wear a mask or face-covering in public places where social distancing is not possible.\n\nMasks can help prevent the spread of #COVID19MA for you and other people.\n\nLearn more from @MassDPH :  http:// mass.gov/coveryourface", "2020-05-05T20:21:32.000Z": "Our Manufacturing Emergency Response Team is leading the effort to support the Commonwealth's manufacturers looking to produce PPE and other supplies. Merrow is a prime example of the importance of this initiative. More: https:// bit.ly/3de6e9s  Watch: https:// youtu.be/HXPo_Rg1Hso", "2020-05-05T20:21:31.000Z": "Massachusetts' manufacturers have stepped up to support PPE production so we can protect front-line workers during #COVID19MA Great to tour #FallRiver 's Merrow Manufacturing, an 8th-generation family-owned firm that has shifted production to manufacture medical isolation gowns.", "2020-05-05T18:04:27.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-05T15:41:57.000Z": "Our Community Tracing Collaborative with @PIH is a nation-leading effort to trace and track #COVID19MA so we can further push back against this virus.\n\nHelp out by answering the phone when the MA COVID Team calls from an 833 or 857 number. Learn more: http:// mass.gov/MAtracingteam", "2020-05-05T14:32:57.000Z": "This #TeacherAppreciationWeek , we say THANK YOU to the educators who've worked so hard in recent weeks to ensure students continue to learn and grow during this period of remote learning.\n\nGrateful for everything you do to support Massachusetts' national leadership in education.", "2020-05-04T19:07:35.000Z": "With the rate of roadway fatalities up over last year @MassDOT and @EOPSS are reminding everyone that even with significantly lower volume on the roads, drivers still need to exercise caution, wear a seatbelt and observe the hands-free law. Quote Tweet Mass. Transportation @MassDOT . @MassDOT reports 28 deaths in #MAtraffic crashes, April 2020, despite less traffic. Safety reminders: slow down, stay within posted speed limit, wear seatbelt, drive sober. http:// blog.mass.gov/transportation /massdot-highway/massdot-on-april-roadway-fatal-crashes-drivers-urged-to-slow-down/ ", "2020-05-04T16:45:15.000Z": "In the coming days, the Board will continue its work, meeting with more groups and reviewing other input.\n\nWe won't flip a switch on May 18. But we do hope that certain types of businesses can implement appropriate health guidelines and begin resuming operations. #COVID19MA", "2020-05-04T16:45:14.000Z": "We're planning for a responsible reopening and our Reopening Advisory Board has hit the ground running\n\nUnder the leadership of @MassLtGov + @MassEOHED Sec. Kennealy, the Board engaged with 23 industry associations + community coalitions over the last week and through the weekend", "2020-05-04T15:15:14.000Z": "#COVID19MA | Massachusetts' incredible health care workforce has stepped up to support expanded capacity for COVID-19. Learn more about opportunities for health and human services professionals to support temporary care sites across the Commonwealth: Make A Difference:Work in Nursing Homes & Long-Term Care Facilities Jobs available in nursing homes and other long-term care facilities. mass.gov", "2020-05-04T13:48:49.000Z": "REMINDER: Effective Wednesday, residents are required to wear face masks or cloth face coverings in public places where social distancing is not possible.\n\nLearn more about the order and @MassDPH guidance on how to safely cover your face: http:// mass.gov/coveryourface  #COVID19MA", "2020-05-03T16:34:57.000Z": "Stay connected with key resources during the pandemic: Stay informed: http:// mass.gov/covid19  Ask questions: Call @Mass_211  Text \"COVIDMA\" to 888-777 Envíe \"COVIDMAESP\" al 888-777 #COVID19MA GIF", "2020-05-01T18:37:50.000Z": "Today we are requiring all residents to wear a mask in public places when it is not possible to maintain proper social distance.\n\nThis applies to workers and customers of essential businesses like groceries and pharmacies. #COVID19MA  Full Details: https:// bit.ly/3bTsR2I", "2020-05-01T17:42:57.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-05-01T16:17:23.000Z": "> @TheNationsFirst and @MassEMA continue to work with a wide range of partners to get PPE distributed to front-line workers who need them, including with @MassEarlyEdCare to support workers at our emergency child care programs. Thank you! #COVID19MA Quote Tweet Massachusetts EEC @MassEarlyEdCare Thank you @MassEMA and the #massachusetts national guard @TheNationsFirst for delivering #PPE that will be distributed to our emergency child care providers #childcare  #COVID19  #InThisTogether", "2020-05-01T15:13:12.000Z": "Thank you to NJ @GovMurphy and our friends in New Jersey for lending Massachusetts 50 ventilators to support the Commonwealth's hospital system. #COVID19MA", "2020-05-01T13:37:17.000Z": "Our contact tracing effort with @PIH has already made contact with over 5,000 contacts of #COVID19MA cases.\n\nPlease pick up the phone if the MA COVID Team calls. You'll help us fight COVID-19 and you'll get information about next steps you should take. http:// mass.gov/MAtracingteam", "2020-04-30T20:03:22.000Z": "We'll continue to keep the public informed on our ongoing response, and remember to stay connected: Visit http:// mass.gov/covid19  Call @Mass_211  Text \"COVIDMA\" to 888-777 Envíe \"COVIDMAESP\" al 888-777 WATCH today's update: COVID-19 Update: Contact Tracing & Reopening Advisory Board Updates,... Governor Charlie Baker, Lt. Governor Karyn Polito and HHS Secretary Marylou Sudders provided an update on the Commonwealth's response to COVID-19, including ... youtube.com", "2020-04-30T20:03:21.000Z": "At today's #COVID19MA briefing, we offered several updates: Our Community Tracing Collaborative with @PIH has hired and started training over 1,000 people who have already contacted over 5,000 people. Reflective of social distancing, positive cases average 2 contacts per case.", "2020-04-30T13:40:12.000Z": "Thanks to the religious leaders with @GBinterfaith for delivering this important message of hope during these uncertain times. As everyone continues to #StayHome and practice social distancing, the guidance of faith leaders remains crucial. #BoundInLove Quote Tweet GBIO @GBinterfaith \"In these times, may we all be bound in love, public love, which is justice for all,\" \nsaid Rev. Lydia Shiu, Associate Pastor @ReservoirFaith  #BoundInLove  #mapoli  #bospoli Check this video of a clergy message to the people of MA. #COVIDー19  https:// youtu.be/u3FNQyCPk3U", "2020-04-29T19:57:34.000Z": "Learn more from @MassDPH about why it's important to cover your face when out in public, to help slow the spread of #COVID19MA .\n\nMORE: http:// mass.gov/coveryourface", "2020-04-29T18:00:01.000Z": "Get the latest updates about #COVID19 on our website: http:// mass.gov/covid19  #covid19MA", "2020-04-29T16:13:01.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-04-28T18:49:04.000Z": "Command Sgt Maj Greg C. Widberg and I visited soldiers and airmen from the @TheNationsFirst who are providing support and #covid19 testing to nursing facilities across the Commonwealth. #inthistogether", "2020-04-28T22:51:13.000Z": "As we sustain #COVID19MA social distancing we're also launching an aggressive contact tracing effort with our colleagues @PIH .\n\nI spoke with @NPRKelly on @npratc about how this initiative will help inform both current efforts and our reopening strategy. Massachusetts Is Developing A Contact Tracing Program To Ensure Safe Reopening Governments worldwide are tracing people with COVID-19 to stop the spread of the virus. NPR's Mary Louise Kelly talks with Massachusetts Gov. Charlie Baker about the state's contact tracing efforts. npr.org", "2020-04-28T19:03:47.000Z": "Continuing these measures will make sure we can push back against the surge and ensure our health care system can respond as needed.\n\nBut with this Advisory Board, we're also beginning to plan quickly and hear from all voices about safely reopening. : https:// bit.ly/3cZeM4a", "2020-04-28T16:22:25.000Z": "Today, we're sustaining measures to fight #COVID19MA : Extending limit on gatherings and closure of non-essential businesses until May 18 Stay-At-Home Advisory remains in effect Launching Economic Reopening Advisory Board to help us plan for a safe + responsible reopening", "2020-04-28T16:19:55.000Z": "UPDATED \n\nWatch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-04-28T16:10:16.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-04-28T14:10:30.000Z": "To fight #COVID19MA , its crucial residents #StayHome  If you have symptoms + don't need emergency care, use @buoyhealth : http:// buoy.com/mass  If you must go out for essential activities like buying groceries, wear a mask: http:// mass.gov/coveryourface  http:// mass.gov/stayhome", "2020-04-27T19:53:03.000Z": "The @SBAgov has begun accepting applications from lenders for the federal Paycheck Protection Program. Small businesses impacted by #COVID19MA can work with their lender to apply and @MassEOHED has compiled resources to help navigate this federal program Quote Tweet MA EOHED @MassEOHED REMINDER >>> The @SBAgov will accept PPP applications from lenders beginning Monday, April 27th at 10:30 am. It is critically important that small businesses impacted by #COVID19MA work with their lender to apply for the Paycheck Protection Program as soon as possible. Show this thread", "2020-04-27T18:08:47.000Z": "#COVID19MA | Today we announced further actions to continue to address COVID-19 in nursing homes: Another $130 million for nursing homes to pay for more staff, infection control + PPE Expanded staffing resources building on work by @TheNationsFirst + clinical response teams", "2020-04-27T16:20:15.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-04-26T20:57:42.000Z": "REMINDER >>> The @SBAgov will accept PPP applications from lenders beginning Monday, April 27th at 10:30 am. It is critically important that small businesses impacted by #COVID19MA work with their lender to apply for the Paycheck Protection Program as soon as possible.", "2020-04-25T19:43:08.000Z": "Manufacturers are shifting their operations to support PPE production, including @Hasbro and its partner factory run by Cartamundi in East Longmeadow. @MassLtGov and I joined Chairman @RepRichardNeal to tour this facility, which is producing face shields for front-line workers.", "2020-04-25T17:41:52.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-04-24T22:48:59.000Z": "Wednesday: Expanding our partnership with community health centers, we worked to get them thousands of test kits: https:// bit.ly/2xTfn8i  Thursday: We joined hospital leaders to make clear: Our system is handling the surge and can care for patients with other medical needs.", "2020-04-24T22:48:58.000Z": "THIS WEEK: Our #COVID19 response continued: Monday: #PatriotsDay looked different but the spirit of resilience that defines that day is evident to anyone watching MA today Tuesday: We extended the closure of schools + non-emergency childcare centers: https:// bit.ly/2RVh8ZG", "2020-04-24T20:51:19.000Z": "Thanks to the athletes and coaches from Boston's pro sports teams for reminding everyone to stay home, and for helping us express our gratitude to the incredible heroes on the front-lines.\n\nWe will get through this together, Massachusetts. #StayHome  #NEstrong  #COVID19MA", "2020-04-24T20:07:22.000Z": "PPE from MEMA's warehouse being delivered by @TheNationsFirst to first responders in #Northampton today. #Teamwork  #COVID19MA", "2020-04-24T20:11:36.000Z": "At today's #COVID19MA update, we were thrilled to welcome back @MassDPH Commissioner Dr. Bharel.\n\nWe filed a new waiver request to give @MassHealth added flexibility and gave an update on the successful implementation of Pandemic Unemployment Assistance: https:// bit.ly/3bBK4xn", "2020-04-24T18:08:18.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19live", "2020-04-24T15:07:30.000Z": "Community health centers are part of the fabric of the neighborhoods they serve, making them valuable partners for testing + tracing\n\nA new partnership with @MassLeague + @QuestDX will ship thousands of test kits to community health centers. #COVID19MA  https:// bit.ly/2xTfn8i", "2020-04-23T21:49:52.000Z": "Massachusetts benefits enormously from our world-class hospitals. Unlike some places that have seen a surge, our health care system isn't forced to turn people away - far from it.\n\nWe'll continue to do everything possible to support hospitals across MA. COVID-19 Update: Health Care Leaders Discuss Available Hospital... Governor Charlie Baker, Lt. Governor Karyn Polito and HHS Secretary Marylou Sudders joined Dr. Michael Apkon, MD PhD, CEO of Tufts Medical Center, Dr. Gregg ... youtube.com", "2020-04-23T21:49:51.000Z": "Thanks to leaders from @TuftsMedicalCtr , @newtonwellesley and @Baystate_Health for joining us today to outline the preparation we've done with our hospitals to ensure they're ready for COVID-19. That work has enabled hospitals to be in a position to continue to care for patients.", "2020-04-23T18:53:28.000Z": ". @MassLtGov and I extend our deepest sympathies to @SenWarren following the loss of her brother. We will keep you and your family in our prayers and continue to do everything we can to confront this pandemic together.", "2020-04-23T17:40:30.000Z": "Today we joined leaders from the Commonwealth's health care system to make clear: Thanks to our shared work to prepare and build capacity, MA's hospitals are well-positioned to care for both the uptick in COVID-19 patients and people who have other medical problems. #COVID19MA", "2020-04-23T16:05:09.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-update s?n ", "2020-04-23T15:14:53.000Z": "To support remote learning, teleworking and other important activities during this pandemic, we're redoubling our efforts to deliver high-speed internet access to all of Massachusetts' communities.\n\nLearn more about this announcement Quote Tweet Karyn Polito @MassLtGov While schools and businesses remain closed to mitigate the spread of #COVID19MA , access to high speed internet is essential.\n\nTo support impacted students and families in unserved communities, WiFi hotspots are now available free of charge.\n\nLearn more  http:// bit.ly/2xTfn8i", "2020-04-22T22:00:49.000Z": "Today, @EEASecretary issued the formal determination letter establishing net zero greenhouse gas (GHG) emissions as the Commonwealth's new legal emissions limit for 2050. Formal Determination Letter: https:// mass.gov/doc/final-sign ed-letter-of-determination-for-2050-emissions-limit   Press Release: https:// mass.gov/news/baker-pol ito-administration-issues-letter-establishing-net-zero-emissions-target ", "2020-04-22T19:15:08.000Z": "This program builds on our partnership with community health centers in the Community Tracing Collaborative launched by the Commonwealth and @PIH , which has enabled some centers to re-hire furloughed staff. Read more https:// bit.ly/2xTfn8i  #COVID19MA COVID-19 Update: Boosting Community Health Center Testing Capacity The Baker-Polito Administration today announced an initiative to expand COVID-19 testing at Community Health Centers throughout the Commonwealth. The Adminis... youtube.com", "2020-04-22T19:15:07.000Z": "Community health centers are deeply rooted in the neighborhoods they serve and are well-positioned to help test, trace and push back against COVID-19.\n\nPleased to announce a partnership whereby @QuestDX is shipping thousands of test kits to an initial 12 community health centers.", "2020-04-22T17:46:42.000Z": "On this 50th #EarthDay , we reflect on our commitment to protecting our planet and our Commonwealth's incredible natural resources, even as we work together to confront COVID-19 and keep our residents safe and healthy.", "2020-04-22T16:13:16.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-update s?n ", "2020-04-22T15:13:59.000Z": "Massachusetts' remarkable health care workforce is making a huge difference as we confront #COVID19MA Health professionals can join the effort by volunteering or applying for jobs at field hospitals Apply for jobs: http:// mass.gov/joincovidteam  Volunteer: http:// mass.gov/covid-hhek", "2020-04-22T12:59:14.000Z": "During this crisis, we're committed to supporting students paying back loans, which is why the Division of Banks is joining this multi-state effort: https:// bit.ly/2wZGRJd  It's also why @MassDHE is deferring loan repayments: https:// bit.ly/2RVh8ZG Quote Tweet MA EOHED @MassEOHED The Division of Banks has joined a multi-state initiative to secure payment relief options with 15 private student loan servicers to expand on protections the federal government granted to federal student loan borrowers, with over 182k residents standing to benefit. #COVID19MA Show this thread", "2020-04-22T00:42:22.000Z": "#COVID19MA | Stay up to date: Stay informed: http:// mass.gov/covid19  Ask questions: Call @Mass_211  Text \"COVIDMA\" to 888-777 Envíe \"COVIDMAESP\" al 888-777 Watch updates: http:// mass.gov/covid19-updates GIF", "2020-04-21T19:46:49.000Z": "@MassEarlyEdCare is partnering with @CareDotCom to offer families + child care workers free 90-day premium memberships\n\nWe're committed to ensuring students' safety and continued learning through this crisis. #COVID19MA  More: https:// bit.ly/2RVh8ZG COVID-19 Update: Extension of School Closures, Additional Steps To... The Baker-Polito Administration today announced new actions to support the ongoing COVID-19 response, including extending the closure of all public and priva... youtube.com", "2020-04-21T19:46:48.000Z": "@MassLtGov announced expanded STEM resources, the result of a partnership between the STEM Advisory Council and regional networks: http:// doe.mass.edu/covid19/stem/  @MassLtGov also announced that @MassDHE is deferring scheduled repayments for its no-interest loan program for 4 months", "2020-04-21T19:46:47.000Z": "We also announced several actions to better support students, families and educators: @MASchoolsK12 Commissioner Riley has launched a Remote Learning Essentials Initiative to give districts the tools they need, and will be issuing updated guidance for districts this week.", "2020-04-21T16:17:34.000Z": "Today we extended the closure of K-12 schools and non-emergency childcare programs through the end of the school year.\n\nRemote learning will continue and @MASchoolsK12 is taking additional steps to boost remote learning to ensure we're doing everything we can to support students.", "2020-04-21T16:08:01.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-update s?n ", "2020-04-21T13:51:59.000Z": "Yesterday I signed legislation pausing evictions and foreclosures, to provide additional relief and protections for homeowners and renters during this time when many residents are facing economic hardship. We thank our legislative colleagues for their careful work on this bill.", "2020-04-20T21:54:23.000Z": "via @nytimes : \"An Army of Coronavirus Tracers Takes Shape in Massachusetts\" https:// nyti.ms/34SrAGH  Learn more about our contact tracing partnership with @PIH , which will enable us to better understand and push back against COVID-19: http:// mass.gov/MAtracingteam  #COVID19MA", "2020-04-20T17:22:07.000Z": "Grateful to @NYGovCuomo and our neighbors in New York for lending 400 ventilators to support Massachusetts' health care system during COVID-19. We look forward to distributing these devices to health care facilities soon. #COVID19MA", "2020-04-20T16:45:50.000Z": "This #PatriotsDay , we join the @CityOfBoston , @johnhancockusa and others in telling all our front-line workers: \"You are essential. We are grateful.\"\n\nTHANK YOU to the health care workers, first responders, grocery workers and so many others who serve us today and every day.", "2020-04-20T14:00:09.000Z": "Today, we announced that CARES Act unemployment benefits for the self-employed, gig economy workers and others who don't qualify for traditional unemployment are now available. #COVID19MA  Full details: https:// bit.ly/3eBEEo7  Learn more and apply: http:// mass.gov/pua", "2020-04-20T13:01:18.000Z": "We've seen before #PatriotsDay + Marathon Monday showcase the resilience of the people of MA.\n\nThere's no race today but this year is no different.\n\nJust like in 2013, first responders, health care workers and others are rising to the challenge. We will get through this together.", "2020-04-20T11:07:27.000Z": "To the Doctors,\nNurses,\nPharmacists,\nDentists,\nMedical personnel,\nEMTs,\nPolice officers,\nFirefighters,\nGrocery store workers,\nCustodians,\nPostal workers,\nDelivery drivers,\nBus drivers,\nTrain conductors: \n\nWe'll wait to start\nUntil you reach the finish.", "2020-04-19T23:46:47.000Z": "This morning, I joined @FaceTheNation and spoke with @margbrennan about our Administration's work to build a comprehensive contact tracing program for Massachusetts with @PIH and our collaboration with neighboring states on our regional response to COVID-19. #COVID19MA", "2020-04-19T22:15:00.000Z": "Have you or a family member been directed by a health care provider to quarantine or self-monitor at home? Follow these 10 tips. Learn more: https:// mass.gov/info-details/c ovid-19-printable-fact-sheets#at-home-quarantine-or-self-monitoring- ", "2020-04-19T15:48:50.000Z": "Rigorous contract tracing programs, like the one Massachusetts is launching with the team of experts at @PIH , are crucial not only as we seek to understand COVID-19 and slow its spread, but also as we eventually start thinking about re-opening. #COVID19MA Quote Tweet Face The Nation @FaceTheNation . @MassGovernor tells @margbrennan that the group Massachusetts retained to spearhead a contract tracing effort in his state has previous experience doing so in past infectious disease outbreaks such as #Ebola and #Zika", "2020-04-19T12:32:01.000Z": "TODAY: We get insight into ongoing #contacttracing efforts in Massachusetts and plans to reopen the state with @MassGovernor Charlie Baker On TV, radio, and streaming online at https:// cbsn.ws/34Mk4Nr , don't miss @FaceTheNation this morning", "2020-04-18T18:18:59.000Z": "\"Massachusetts is strong, we are resilient and we can run any marathon anyone wants us to run. We will get through this crisis and we will get through it together.\" - @MassGovernor at the #BostonHope Medical Center.", "2020-04-18T19:29:25.000Z": "Thanks to the @CityOfBoston , @MassConvention , @MassEMA and @PartnersNews, which is leading the clinical effort here.\n\nThis facility is prepared to augment the incredible work of Boston's hospital system in caring for COVID-19 patients. #COVID19MA   http:// partners.org/bostonhope", "2020-04-18T19:29:24.000Z": "The #BostonHope field hospital at the Boston Convention Center is an example of how partnerships between a wide range of players is ensuring MA is well-equipped to confront COVID-19.\n\nGlad to join @USArmy Chief of Staff Gen. James C. McConville, a Quincy native, on a tour today.", "2020-04-18T17:41:20.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-update s?n ", "2020-04-18T13:58:51.000Z": "The best thing you can do to stop COVID-19 is #StayHome  If you must go out for essential activities, wear a mask: http:// mass.gov/coveryourface  If you feel symptoms, stay home and use @buoyhealth to connect with telemedicine: http:// buoy.com/mass   http:// mass.gov/stayhome", "2020-04-17T22:13:04.000Z": "To facilitate quick distribution of these masks, we are employing a regional point of distribution (POD) model and today alone have already distributed more than 150,000 masks to first responders. #COVID19MA Quote Tweet Charlie Baker @MassGovernor Today we announced that @MassEMA is distributing 200,000 respirator masks to ALL of Massachusetts' emergency responders to help keep them safe as they serve our communities on the front lines, augmenting our PPE distribution to health care workers. : https:// bit.ly/2VGj49i", "2020-04-17T12:10:55.000Z": "Crews placing flowers in front of the Boston Hope field hospital. These are flowers that would have lined the Boston Marathon route but will now line the entrance/exit for front line workers #WCVB", "2020-04-17T21:46:52.000Z": "Today we announced that @MassEMA is distributing 200,000 respirator masks to ALL of Massachusetts' emergency responders to help keep them safe as they serve our communities on the front lines, augmenting our PPE distribution to health care workers. : https:// bit.ly/2VGj49i", "2020-04-17T21:01:01.000Z": "More #COVID19MA homelessness actions: Supporting families in emergency assistance and domestic violence shelters Expediting PPE distribution to shelters Technical assistance to organizations and municipalities seeking FEMA funding Full Details: https:// bit.ly/3etkPPP", "2020-04-17T21:01:00.000Z": "#COVID19MA : At today's briefing, we outlined our ongoing steps to address homelessness during this pandemic: 5 isolation/recovery sites plus medical capacity at Boston Hope field hospital and Newton Pavilion Deploying supplies to support local quarantine solutions", "2020-04-17T18:43:35.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-update s?n ", "2020-04-17T14:56:09.000Z": "Stay Informed | Manténgase Informado: Text COVIDMA to 888-777 Envíe COVIDMAESP al 888-777 #COVID19MA", "2020-04-16T20:49:44.000Z": "We'll continue to prioritize efforts to chase down PPE in order to support our front-line workers. PPE Donation and Procurement Portal: http:// mass.gov/covid-ppxy  PPE Request Information: http:// mass.gov/covid19-ppe Watch today's briefing: COVID-19 Update: Testing, Capacity, PPE Update Governor Charlie Baker, Lt. Governor Karyn Polito and Health and Human Services Secretary Marylou Sudders provided an update on the Commonwealth's response t... youtube.com", "2020-04-16T20:49:43.000Z": "At today's #COVID19MA briefing, we gave updates on testing, hospital capacity and our contact tracing initiative.\n\nWe also shared an update on PPE distribution: 2.2 million gloves Over 850,000 masks Over 180,000 gowns", "2020-04-16T19:40:57.000Z": "The most important thing you can do to slow the spread of COVID-19 is to #StayHome . @MassDPH 's stay-at-home advisory remains in effect. Residents should avoid leaving their homes except for essential things like going to the grocery store or pharmacy. http:// mass.gov/stayhome", "2020-04-16T19:01:46.000Z": "Today we join transit agencies across the country and #SoundTheHorn to say 'thank you' to all public transportation workers. Thank you to our essential workforce who keep essential service moving & support our communities day in & day out during this crisis.", "2020-04-16T16:39:08.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-update s?n ", "2020-04-16T13:58:32.000Z": "Contact tracing is crucial to our #COVID19MA response, both now as we aim to understand and slow this virus, and in the future as we make decisions about returning to a new normal.\n\nOur unique partnership with @PIH makes MA a national leader in tracing. An Army of Virus Tracers Takes Shape in Massachusetts Asian countries have invested heavily in digital contact tracing, which uses technology to warn people when they have been exposed to the coronavirus. Massachusetts is using an old-fashioned means:... nytimes.com", "2020-04-15T23:33:27.000Z": "More than 70,000 people have used the @buoyhealth online symptom-checker since it launched.\n\nIt's a crucial way for people who may have symptoms to #StayHome while connecting with telemedicine options. #COVID19MA  Find it at http:// buoy.com/mass or http:// mass.gov/covid19", "2020-04-15T22:47:45.000Z": "On #OneBostonDay we remember how we responded to the tragic events of the 2013 Marathon.\n\nThe heroic  work of our first responders and health care workers. Neighbors holding each other up. Our city and Commonwealth rising to the occasion.\n\nWe've done it before, and we will again.", "2020-04-15T21:01:33.000Z": "More #COVID19MA steps to support long-term care facilities: Distribution nearly 1.3 million masks, almost 200,000 gowns and over 2 million gloves Deployment of rapid-response clinical teams\n\n...and more. Details: https:// bit.ly/3cfbusW  Watch: COVID-19 Update: Nursing Home Resources, Support Update The Baker-Polito Administration today outlined ongoing steps to support long-term care facilities, including $130 million in new funding, expanded testing, P... youtube.com", "2020-04-15T21:01:32.000Z": "At today's #COVID19MA update, @MassHHS Sec. Sudders and I outlined comprehensive steps our administration is taking to support nursing homes, which as we know are at higher risk for an outbreak of COVID-19.\n\nThese include: $130 million in new funding Expanded mobile testing", "2020-04-15T18:15:36.000Z": "Today is #OneBostonDay , the 7th anniversary of the 2013 Boston Marathon. The lives we lost that day are never far from our thoughts.\n\nBut we also remember the spirit of resilience that our people showed, something that looks very familiar to anyone watching our current situation.", "2020-04-15T15:18:50.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-update s?n ", "2020-04-15T12:26:45.000Z": "Covering your face when outside can help prevent the spread of COVID-19.\n\nLearn more about wearing a mask or a face-covering: : http:// mass.gov/coveryourface  #COVID19MA", "2020-04-14T20:47:57.000Z": "Field Medical Stations like this one are a crucial part of our work to ensure MA has the hospital capacity we need ahead of an uptick in COVID-19 cases.\n\nOur COVID-19 Command Center continues to monitor hospital capacity and will provide regular updates at http:// mass.gov/covid19", "2020-04-14T20:47:56.000Z": "Today, @MassLtGov and I joined @TheNationsFirst , @MassEMA and the team at @CapeCodHealth to tour the new Field Medical Station being stood up at Joint Base Cape Cod in Bourne. #COVID19MA  Read More: https:// bit.ly/2K2gqp2", "2020-04-14T18:22:57.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-update s?n ", "2020-04-14T17:44:11.000Z": "Contact tracing is a crucial piece of the necessary response to any pandemic, which is why we launched an innovative partnership with the team of experts @PIH .\n\nThis effort will help us collect more data to help slow the spread of COVID-19. #COVID19MA  http:// mass.gov/matracingteam", "2020-04-14T16:30:22.000Z": "Health care & human services professionals are needed to staff temporary healthcare sites for COVID-19 patients across the state. Make a difference by providing aid and comfort to those in need. Employment opportunities for a variety of roles: http:// ow.ly/6PkO50zamfB  #covid19MA", "2020-04-14T16:11:36.000Z": "Last week we announced an expansion of our testing program for front-line workers: \n\nGrocery store workers can now schedule an appointment to be tested at the sites located at @PatriotPlace or @TheBigEFair site in West Springfield. #COVID19MA  MORE: https:// bit.ly/3b10Ohu", "2020-04-13T22:37:09.000Z": "This effort is a partnership between a wide range of stakeholders and will harness the innovative spirit and capacity of Massachusetts' manufacturing sector to support front-line workers.\n\nMore: https:// bit.ly/2RyS622 Apply: http:// masstech.org/M-ERT Watch: https:// youtu.be/rCZim8-Duuk", "2020-04-13T22:37:08.000Z": "Today, we announced the launch of a Manufacturing Emergency Response Team, alongside over $10 million in funding, all to support manufacturers' efforts to shift production operations to crucial supplies like personal protective equipment, ventilators and more. #COVID19MA", "2020-04-13T17:13:32.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-update s?n ", "2020-04-13T15:01:49.000Z": "Get the latest updates on the COVID-19 response in Massachusetts. \nStay informed: http:// mass.gov/covid19 Ask questions: call 2-1-1\nGet alerts: text COVIDMA to 888-777\nWatch updates: http:// YouTube.com/massgovernor", "2020-04-13T12:37:26.000Z": "As @MassEMA monitors the current weather forecast, with potential for high wind, rain and outages Monday, it is important to take extra care to stay safe during the #COVID19 emergency. Power Outage Safety Tips: https:// mass.gov/info-details/p ower-outage-safety-tips   Outage Map: http:// mema.mapsonline.net/phone.html", "2020-04-12T16:18:59.000Z": "For our friends celebrating Easter and Passover, this week is about beating cruelty with love. \n\nWe remember how to confront fear with faith. \n\nAnd regardless of whether you celebrate a holiday this week or not, we've all been doing a lot of that for the past few weeks.", "2020-04-12T13:24:37.000Z": "Wishing you and your family a #HappyEaster ! The celebrations may look different this year, but they are still an opportunity for us to reflect on faith and family, which are more important now than ever.", "2020-04-11T22:33:00.000Z": "#COVID19MA | Stay Informed:\n\nOur COVID-19 website is recently redesigned to help you find the information you need as we navigate this outbreak together. Get quick access to important updates and key state services. http:// mass.gov/covid19", "2020-04-11T19:02:20.000Z": "If you think you feel COVID-19 symptoms, you should stay home to avoid exposing others.\n\nBut you can check your symptoms online + connect with telemedicine with @buoyhealth 's tool, free for MA residents. #COVID19MA  Find it at http:// buoy.com/mass or http:// mass.gov/covid19", "2020-04-11T18:22:09.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-updates", "2020-04-11T17:09:43.000Z": "New #COVID19MA actions: Advising people to wear face coverings or masks in situations where social distancing isn't possible: http:// mass.gov/coveryourface  Expanding priority testing to grocery workers Activated 3,000 more @TheNationsFirst personnel https:// bit.ly/3b10Ohu", "2020-04-11T16:44:52.000Z": "Today, our administration announced a new Spanish-language form for unemployment assistance, part of our commitment to ensure COVID-19 resources and services are available to all communities. More details: https:// bit.ly/2Vk8tAS  #COVID19MA Quote Tweet MassLWD @MassLWD Para satisfacer mejor las necesidades de nuestros contribuyentes, hemos lanzado una aplicación para solicitar el seguro de desempleo en español adaptada para el móvil. Acceda a la aplicación y otros recursos en español aquí: http:// mass.gov/desempleo", "2020-04-09T13:37:53.000Z": "Thinking about applying to become a contact tracer, resource coordinator, or case investigator with the Massachusetts #COVID19 Community Tracing Collaborative? We'll be updating this list with answers to your FAQs around the CTC hiring process: FAQs: Hiring, Process Behind PIH's Efforts in MA COVID Response | Partners In Health PIH teams respond to questions about job eligibility, the hiring process, contact tracing, and more, regarding the new Community Tracing Collaborative. pih.org", "2020-04-11T14:35:25.000Z": "Stay Informed | Manténgase Informado: Text COVIDMA to 888-777 Envíe COVIDMAESP al 888-777 #COVID19MA", "2020-04-10T20:41:54.000Z": "Many of us usually spend this weekend celebrating faith + family. This year this weekend will be tough.\n\nNow is the time to remember that we must confront these challenges with love for one another and faith that what we do today will make tomorrow better. COVID-19 Update: Hospital Surge Capacity Today, the Baker-Polito Administration provided an update on the Commonwealth's hospital capacity and efforts to add more beds to the system to meet the expe... youtube.com", "2020-04-10T20:41:53.000Z": "Today our administration provided an update on hospital capacity in Massachusetts, as we prepare for a surge in cases.\n\nOur health care system has been consistently adding acute and ICU beds, which we are augmenting with Field Medical Stations. DETAILS: https:// bit.ly/3aYbsp6", "2020-04-10T18:42:38.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-updates", "2020-04-10T17:37:34.000Z": "Yesterday, @MassLtGov announced the expansion of SafeLink, the Commonwealth's 24/7 confidential domestic violence hotline to include services for survivors of sexual assault.\n\nIf you require #SADV resources and support, call 877-785-2020. #COVID19MA Quote Tweet Karyn Polito @MassLtGov While necessary, precautionary social distancing measures during #COVID19MA can leave survivors of sexual assault and domestic violence vulnerable and at increased risk.\n\nOur administration is committed to providing continued support + resources for survivors statewide. #SAAM Show this thread", "2020-04-10T17:08:01.000Z": "A key message from the @MBTA : Thank you to the riding public for limiting trips on the T to essential travel only. The T will continue to work hard to protect the health + safety of front-line workers who do use the system. MORE http:// mbta.com/covid19 Quote Tweet MBTA @MBTA We want to thank our riders for doing their part & limiting travel to only essential trips. We continue to expand our efforts & enhance our protocols to better protect our employees & riders. As always, we will update you with messages from GM @spoftak & welcome your comments.", "2020-04-10T15:19:55.000Z": "Staying home is the best way that we can slow the spread of COVID-19 and save lives.\n\nResidents should stay home and avoid going outside except for essential activities, like going to the grocery store or pharmacy. MORE: http:// mass.gov/stayhome", "2020-04-10T14:19:27.000Z": "At yesterday's #COVID19MA briefing, @MassHHS Sec. Marylou Sudders announced a new portal on @MassGov that will enable health + medical workers to connect with jobs and opportunities to support the Commonwealth's COVID-19 response. Learn more and apply: Apply for jobs at COVID-19 temporary case sites Massachusetts needs health care professionals to staff new health care sites to care for the additional residents that will need treatment for COVID-19. mass.gov", "2020-04-09T19:47:10.000Z": "Today we were joined by @PartnersNews CEO Dr. Anne Klibanski and @CityOfBoston to announce that the clinical effort at the Field Medical Station at the Boston Convention and Exhibition Center will be led by Partners Health Care in a collaboration called Boston HOPE. #COVID19MA", "2020-04-09T17:13:04.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-updates", "2020-04-08T23:14:30.000Z": "Additional updates: New grocery store restrictions: Stores must remain at 40% occupancy Earlier today, we filed legislation providing liability protections for health workers on the front lines. #COVID19MA  MORE: https:// bit.ly/2UUfMjS  WATCH: COVID-19 Update: Testing Site Expansion, Grocery Store Restrictions,... The Baker-Polito Administration today announced an expansion of COVID-19 testing sites for public safety personnel, new Crisis Standards of Care documentatio... youtube.com", "2020-04-08T23:14:29.000Z": "At today's #COVID19MA update we announced: A new rapid drive-thru testing site at @TheBigEFair site in West Springfield for emergency responders New crisis standards of care resulting from a partnership between @MassDPH + health care leaders MORE: https:// bit.ly/34lnjLu", "2020-04-08T20:09:00.000Z": "Massachusetts grocery store workers are doing a tremendous job on the front lines every day, serving customers + making sure residents have the food they need.\n\nThis crucial work does not go unnoticed. On behalf of the Commonwealth, THANK YOU for all your work during this crisis.", "2020-04-08T19:41:29.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-updates", "2020-04-08T14:29:02.000Z": "Thank you @jimmykimmellive for spotlighting a #Massachusetts  #HealthCareHero and the critical importance of emergency child care! https:// youtube.com/watch?v=NKy17R r6yfo   #JimmyKimmelLiveFromHisHouse  #earlyyears  #COVID19  #childcare Jimmy Kimmel Pays Tribute to ICU Nurse During the quarantine, we're paying tribute to those who are on the frontlines of the crisis. Tonight's #HealthCareHero is Taylor Chase-Meyers, an incredible... youtube.com", "2020-04-08T16:24:44.000Z": "This evening marks the beginning of #Passover , where we honor the strength and resiliency of the Jewish people. Although celebrations may look different this year, the spirit of #Passover remains unchanged.\n\nWishing all those who celebrate a peaceful + joyful Seder. #ChagSameach", "2020-04-08T15:15:49.000Z": "PPE distribution continues in #Mansfield Our warehouse continues to coordinate PPE and supplies with deliveries by @TheNationsFirst & others. This equipment is headed across the state to public health & safety agencies and organizations #Teamwork  #COVID19MA", "2020-04-07T21:00:28.000Z": "Through April 21, we're joining @BAA , @johnhancockusa , @MassDOT , @MassGovernor and @marty_walsh to honor essential workers during this public health crisis. Government Center station will be lit blue to thank our and all front-line staff to say \"You're Essential. We're Grateful.\"", "2020-04-07T21:07:30.000Z": "Staying home will help you keep you and your loved ones safe and healthy.\n\nAll residents should stay home and avoid going out except for essential activities like going to the grocery store or pharmacy. MORE: http:// mass.gov/stayhome", "2020-04-07T18:25:09.000Z": "Personal Protective Equipment (PPE) on arrival in #Dedham  #teamwork  #COVID19MA Quote Tweet Chief Bill Spillane @chiefspillane Thank you to @TheNationsFirst  @MassEMA  @MassGovernor  @robertkraft0  @Patriots for supplying @DedhamFire with much needed PPE. #TogetherWeAreStrong  #StayHomeSaveLives", "2020-04-07T19:21:24.000Z": "At today's #COVID19MA update, we announced: An additional $800 million at MassHealth in critical stabilization funding to support health care providers impacted by and responding to COVID-19 A nursing home mobile testing program supported by @MassDPH and @TheNationsFirst", "2020-04-07T18:39:31.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-updates", "2020-04-07T17:07:59.000Z": "We're committed to keeping you informed and up-to-date as we confront COVID-19 together: Stay informed: http:// mass.gov/covid19  Ask questions: Call @Mass_211  Get alerts: Text \"COVIDMA\" to 888-777 Watch updates: http:// mass.gov/covid19-updates  #COVID19MA GIF", "2020-04-07T16:09:54.000Z": "On this #WorldHealthDay , we say THANK YOU to Massachusetts' incredible health care workforce. \n\nThese front-line heroes are working tirelessly to serve and protect our communities during the COVID-19 outbreak and they deserve our gratitude - today, and every day. #COVID19MA", "2020-04-07T13:42:19.000Z": "State parks across MA are open to the public, but visitors are reminded to avoid crowding in groups at all times.\n \nIf a park is too crowded, consider leaving to visit a different park, or return at a later time or date.  @MassDCR  #COVID19 Updates: https:// mass.gov/info-details/m assachusetts-state-parks-covid-19-update ", "2020-04-07T11:00:00.000Z": "Get the latest updates about #COVID19 on our website: http:// mass.gov/covid19  #covid19MA", "2020-04-07T11:32:35.000Z": "News | CVS Health expands rapid COVID-19 drive-through testing sites into Massachusetts https:// cvs.co/2UNgJdE", "2020-04-07T12:21:54.000Z": "Today our administration and @CVSHealth announced the launch of a new CVS rapid testing site in Lowell, which will enable on-the-spot COVID-19 testing and results at no cost. The new Lowell site will be able to test up to 1,000 patients per day. More: https:// bit.ly/3aSltnF", "2020-04-06T22:38:42.000Z": "Remember to stay home if you feel COVID-19 symptoms (fever, cough, shortness of breath).\n\nWith @buoyhealth 's online symptom checker, MA residents can connect with the appropriate health care resources.\n\nFind it at http:// mass.gov/covid19 or at http:// buoy.com/mass . #COVID19MA", "2020-04-05T19:23:21.000Z": "Our warehouse continues to coordinate and inventory  incoming donations & procured supplies, supported by @TheNationsFirst  @MassDFS  @MassDCR & others.\n\nTo date, MEMA has coordinated approximately 500 orders of PPE to public safety & health agencies and organizations. #COVID19MA", "2020-04-06T20:55:18.000Z": "I was glad to join First Lady Lauren Baker today to announce the launch of the Massachusetts COVID-19 Relief Fund, to support the communities and people most impacted by this public health crisis. @MACovid19Relief  #COVID19MA Learn more: https:// macovid19relieffund.org", "2020-04-06T19:52:02.000Z": "Watch today's #COVID19MA update: Tune in LIVE: http:// mass.gov/covid19-updates", "2020-04-06T18:57:01.000Z": "Our brave health care workers are the ones who deserve our gratitude and thanks. The Commonwealth is grateful for everything you do! Quote Tweet WCVB-TV Boston @WCVB THIS! Lahey Clinic #Burlington staff (in their #Patriots OR caps) shared this message of thanks for @MassGovernor and Robert Kraft for going \"above and beyond\" securing masks for front line hospital workers treating #coronavirus patients. ( Lynne Currier)", "2020-04-06T18:17:00.000Z": "Our administration is working hard to secure personal protective equipment to support the front-line workers serving the Commonwealth every day.\n\nBusinesses + individuals can access our portal to provide PPE by clicking here: http:// mass.gov/covid-ppxy  #COVID19MA", "2020-04-06T16:14:47.000Z": "It's crucial residents continue to practice social distancing. \n\nWe've closed schools + non-essential businesses, and @MassDPH has issued a stay-at-home advisory. Everyone has a role to play in slowing the spread of COVID-19.\n\nStay Informed: http:// mass.gov/covid19  #COVID19MA", "2020-04-06T14:28:46.000Z": "We're grateful for the thousands of health professionals across the Commonwealth who have signed up to support the COVID-19 response effort. \n\nMA is lucky to have a deeply committed health care workforce as we confront this outbreak. #COVID19MA Sign Up: http:// mass.gov/covid-pxlj", "2020-04-05T18:49:20.000Z": "This site builds on our efforts to increase COVID-19 testing in MA. As of yesterday, we've tested 68,800 individuals, with over 5,800 tests conducted yesterday alone, thanks to our partnership with commercial + academic labs.\n\nLearn more about testing at http:// mass.gov/covid19", "2020-04-05T18:49:19.000Z": ". @MassLtGov + I had the chance to tour the COVID-19 testing site at @PatriotPlace in Foxboro that will perform up to 200 tests per day for symptomatic public safety workers.\n\nGrateful for the partners who worked together to launch this site to support first responders. #COVID19MA", "2020-04-03T21:45:28.000Z": "We are committed to ensuring the Commonwealth is a strong partner for cities and towns as we work together in the fight against COVID-19.\n\nToday, I signed legislation to provide administrative relief to state and local government entities impacted by the  outbreak. #COVID19MA", "2020-04-03T18:03:52.000Z": "Enhanced contact tracing is a  powerful public health tool in the battle against COVID-19.\n\nThis first-of-its-kind initiative will support better tracing of contacts of positive cases + support those in quarantine. #COVID19MA  : https:// bit.ly/3aS0Bxb Quote Tweet Partners In Health @PIH Massachusetts Governor Charlie Baker announces the creation of the COVID-19 Community Tracing Collaborative, which will be a partnership between @MassGov , @PIH , @MassDPH , and @HealthConnector .\n\nWatch @MassGovernor 's announcement live: https:// mass.gov/covid19-updates Show this thread", "2020-04-03T18:03:51.000Z": "Massachusetts has dramatically boosted COVID-19 testing capacity + output. As that effort continues, its crucial that we sustain our commitment to tracing.\n\nToday we joined the terrific team at @PIH to announce a Community Tracing Collaborative to mitigate the spread of COVID-19.", "2020-04-03T17:18:16.000Z": "Please tune in to today's live #COVID19 update from @MassGov  @MassGovernor at 1:30 p.m. EDT: http:// mass.gov/covid19-updates", "2020-04-03T17:44:10.000Z": "Tune in LIVE for today's #COVID19MA update: Click here to watch: http:// mass.gov/covid19-updates", "2020-04-03T13:15:38.000Z": "Great work by @Mass_211 who in partnership with @MassDPH have taken over 30,000 #COVID19MA calls!\n\nDial 2-1-1 for non-emergency #COVID19 questions. It's available 24/7 w/operators fluent in Spanish & interpreter services for more than 150 other languages. http:// mass.gov/covid19", "2020-04-03T14:51:58.000Z": "A true team effort.\n\nThe story of how this week's Patriotic mission for PPE unfolded: https:// bit.ly/2xKgXJu A Patriotic Mission: Team plane completes humanitarian flight to China www.patriots.com", "2020-04-03T15:15:09.000Z": "If you would like to volunteer during the COVID-19 public health emergency, the Commonwealth is seeking people from both medical and non-medical professions. Sign up here: https:// maresponds.org  #covid19MA", "2020-04-03T00:38:18.000Z": "Many thanks to the Kraft family and all our partners in this effort. @TheNationsFirst , @MassEMA and @MassDPH will now work with our Command Center and local + health care partners to distribute these masks out to the heroes working on the front-lines. #COVID19MA", "2020-04-03T00:38:17.000Z": "Tonight's arrival of a major shipment of N95 masks on the @Patriots ' plane was a significant step in our work to get front-line workers the equipment they need.\n\nAnd its an example of how collaboration and partnership can lead to real solutions during these challenging times.", "2020-04-02T22:33:05.000Z": "Tune in LIVE as we provide an update from @BostonLogan after the @Patriots plane carrying over one million N95 masks for our front-line workers battling #COVID19 landed here in Massachusetts. Click here to watch: https:// youtu.be/foDplOHefVs", "2020-04-02T20:37:56.000Z": "Based on our projections, we are working with the Commonwealth's academic medical centers to double ICU capacity.\n\nBut we need to do more, which is why we're aiming to find or build an additional 750-1000 beds. #COVID19MA  : https:// bit.ly/3bINCxC  : COVID-19 Update: Administration Outlines Surge Modeling, Response... The Baker-Polito Administration's COVID-19 Response Command Center today outlined projections related to the anticipated surge of COVID-19 cases in the Commo... youtube.com", "2020-04-02T20:37:55.000Z": "In recent weeks we've implemented social distancing measures, closed nonessential businesses + worked to expand hospital capacity as we aim to #FlattenTheCurve But we've always expected a surge. Today we outlined our projections based on the modeling work of top medical experts.", "2020-04-02T18:23:41.000Z": "Thanks as well to our partners in this effort: the team on the ground Tencent, Ambassador Huang Ping, Dr. Jason Li, Gene Hartigan and many others.\n\nOur administration will continue to do whatever we can to secure critical equipment for the Commonwealth's front-line workers.", "2020-04-02T17:08:18.000Z": "Tune in LIVE for today's #COVID19MA update: Click here to watch: http:// mass.gov/covid19-updates", "2020-04-02T11:23:03.000Z": "No days off. Thanks to some serious teamwork, Massachusetts is set to receive over 1 million N95 masks for our front-line workers. Huge thanks to the Krafts and several dedicated partners for making this happen.", "2020-04-01T22:02:39.000Z": "@MassLtGov and I were glad to tour the facility today with @MassEMA and @TheNationsFirst who are working to stand this facility up. \n\nThe Commonwealth will work with @umassmemorial , @TweetWorcester and other local partners to administer this important medical facility.", "2020-04-01T22:02:37.000Z": "The new Field Medical Station that we are launching at the @DCUCenter will be able to accommodate as many as 250 beds and will help us build out health care surge capacity as we confront the outbreak of COVID-19. MORE: https:// bit.ly/344u2cD", "2020-04-01T19:52:27.000Z": "Tune in LIVE for today's #COVID19MA update from @DCUCenter , where a new field medical station is being stood up. Click here to watch: http:// mass.gov/covid19-updates", "2020-04-01T00:10:19.000Z": "As part of MEMA's coordinated donations collection, warehousing and distribution efforts, today @TheNationsFirst delivered needed PPE to the Turners Falls Fire Department (pictured) and other first responders. #COVID19MA  #Teamwork", "2020-04-01T13:39:25.000Z": "Yesterday, I addressed 135 @UMassMedical MD students graduating a few months early at a \"virtual commencement.\" Many will now step up to support surge health care capacity.\n\nMy message to them + their colleagues in the medical profession: Thank you. And we will get through this.", "2020-03-31T20:55:44.000Z": "And to support older adults, we are implementing a pilot project for safe, on-site testing of symptomatic residents of nursing and rest homes with a quick turnaround. Today's announcements: https:// bit.ly/2JpVVT0  Watch today's update: COVID-19 Update: Non-Essential Business Closures Extended, Stay-At-... Today, the Baker-Polito Administration announced several updates related to the COVID-19 outbreak including extending the non-essential business emergency or... youtube.com", "2020-03-31T20:55:43.000Z": "Additional updates from today's #COVID19MA briefing: We are extending guidance for Executive Branch employees to work remotely until May 4, while ensuring we sustain core services We are launching a 250-bed Field Medical Station at the @DCUCenter , managed by @umassmemorial", "2020-03-31T18:37:20.000Z": "Today, we're taking further steps to ensure the Commonwealth continues the social distancing needed to slow the spread of COVID-19: We are extending the closure of non-essential businesses until May 4 @MassDPH 's Stay At Home Advisory remains in effect #COVID19MA", "2020-03-31T18:07:07.000Z": "Tune in LIVE for today's #COVID19MA update: Click here to watch: http:// mass.gov/covid19-updates", "2020-03-31T17:01:51.000Z": "Help prevent #COVID19 with #social  #distancing :\nCall/Facetime/online chat with friends & family.\nStay home as much as you can.\nIf you must go out:\nDon't gather in groups\nStay 6 feet away from others\nDon't shake hands or hug\n& please continue to wash your hands frequently.", "2020-03-31T15:55:02.000Z": "We're committed to getting Massachusetts' health care workers the personal protective equipment they need as our system confronts the continued COVID-19 outbreak. Businesses + individuals looking to donate or sell PPE can use our online tool http:// mass.gov/covid-ppxy  #COVID19MA", "2020-03-30T18:25:11.000Z": "MEMA continues to support a coordinated process to collect donations of medical supplies in the Commonwealth's response to #COVID19MA with logistical assistance from @TheNationsFirst to get critical PPE to first responders.\n\nSee: https:// mass.gov/forms/covid-19 -donation-program  for info on how to donate. Quote Tweet Medway Police @medwaypolice Thank you to the #MassachusettsNationalGuard and @MassEMA for the deliveries (Saturday & today) of Personal Protective Equipment (PPE). We can't thank you enough!", "2020-03-31T02:24:40.000Z": "Massachusetts National Guard members continued to support the Commonwealth's #COVID19 response. @USNationalGuard  @ChiefNGB  @AdjutantGenMA  @MassGovernor", "2020-03-31T01:24:41.000Z": "Public health experts are at the @HolyokeSOHO conducting a thorough review of the health status of staff and residents to plan appropriate next steps. #COVID19MA", "2020-03-31T01:24:40.000Z": "As someone who has visited the Holyoke Soldiers' Home on many occasions to catch up with staff and residents, I am heartbroken by today's news. The loss of these residents to COVID-19 is a shuddering loss for us all.", "2020-03-30T20:51:01.000Z": "On #NationalDoctorsDay , the Commonwealth is profoundly grateful for the selfless service of the medical professionals on the front-lines of the COVID-19 crisis.\n\nMassachusetts is proud of our world-class health professionals, especially during these challenging times. Thank you.", "2020-03-30T20:15:03.000Z": "More from today's #COVID19MA update: Building on past actions, we're supporting on-demand licensing for a wide range of health professionals licensed in other states or retired in the past 10 years Boosting care capacity by establishing dedicated skilled nursing facilities", "2020-03-30T20:15:02.000Z": "Expanding the health care workforce is a crucial priority during COVID-19. Today we announced: Our volunteer portal for health care professionals has already seen over 1,800 signups: http:// mass.gov/covid-hhek  We're expediting onboarding for these volunteers with a new order", "2020-03-30T17:15:56.000Z": "Tune in LIVE for today's #COVID19 update: Click here to watch: http:// mass.gov/covid19-updates", "2020-03-29T15:37:36.000Z": "Today, our administration announced an online portal where individuals and companies can easily donate or sell personal protective equipment and volunteer to support the COVID-19 outbreak here in the Commonwealth. Details: https:// bit.ly/39r6C23", "2020-03-28T19:54:17.000Z": "This week, I formally requested federal disaster assistance from the federal government and today we heard that the White House + FEMA issued a Major Disaster Declaration for the Commonwealth, making additional resources available for Massachusetts. : https:// bit.ly/2WOeM1N", "2020-03-28T19:12:39.000Z": "Thanks to @RedCrossMA for welcoming First Lady Lauren Baker and I to the blood donation center in Dedham today. \n\nHealth care facilities across the Commonwealth have a need for blood donations, and these donation centers are taking steps to protect donors + workers. #COVID19MA", "2020-03-28T16:20:40.000Z": "In an @nytimes op-ed, @GovMurphy and I make clear that our states are committed to the fight against COVID-19, and that we need more from Washington. #COVID19MA Opinion | We Need More From Washington This crisis transcends party. Our states need support. nytimes.com", "2020-03-27T17:56:35.000Z": "Other updates from today's #COVID19 briefing: Emergency medical licenses for medical school graduates to support health care capacity Greater flexibility for nurse practitioners WATCH today's update: COVID-19 Update: Travel Guidelines and New Health Care Resources Today, the Baker-Polito Administration announced new COVID-19 public health emergency responses issuing new guidelines on travel and transportation, and offe... youtube.com", "2020-03-27T17:56:34.000Z": ". @MassHHS Sec. Sudders also announced: We partnered with @MassMedical to recruit + match health care professionals with volunteer opportunities. More: http:// MAResponds.org  @buoyhealth launched an online symptom checker for MA residents: https:// buoy.com/mass", "2020-03-27T17:56:33.000Z": "Starting today all travelers arriving to Massachusetts are instructed to self-quarantine for 14 days. Guidance will be displayed on posters at service plazas and distributed as flyers at transportation hubs. Designated essential workers are exempt. MORE https:// bit.ly/2wIlpYP", "2020-03-27T15:04:07.000Z": "Tune in LIVE for today's #COVID19 update: Click here to watch: https:// mass.gov/covid19-updates", "2020-03-27T14:15:40.000Z": "Grateful for the work of @SpeakerDeLeo , Senate President @KarenSpilka and @MassANF on this issue.\n\nWe are committed to providing this flexibility to taxpayers in a way that protects our strong fiscal footing that we have all worked hard to develop over the past several years.", "2020-03-27T14:15:39.000Z": "Massachusetts will move the state personal income tax filing and payment deadline to July 15, consistent with the federal government, in order to provide additional flexibility to filers during this crisis. #COVID19MA  Read More: https:// bit.ly/2Jkr4aw", "2020-03-26T22:50:54.000Z": "#COVID19MA Update - per the Emergency Order announced by @MassGovernor today, permits issued by @MassEEA agencies, including water resources, solid waste and recycling permits, will not expire or lapse during the State of Emergency. Details: https:// mass.gov/news/baker-pol ito-administration-announces-federal-disaster-request-and-other-covid-19-response ", "2020-03-26T22:51:48.000Z": "As we continue to urge residents to stay at home, it's important to support individuals who don't have a place to call home. We continue to take steps to protect higher-risk populations like older adults and those experiencing homelessness. #COVID19MA  : https:// bit.ly/2Uphrh7", "2020-03-26T20:40:05.000Z": "Today I sent a letter to the federal government requesting a Major Disaster declaration to provide the Commonwealth additional federal assistance as we confront COVID-19.\n\nAt today's update, we detailed that announcement + several others. #COVID19MA  : https:// bit.ly/2Ji1Qtc", "2020-03-26T17:20:33.000Z": "Tune in for today's COVID-19 update, live at 2:00PM: WATCH: https:// mass.gov/covid19-updates  #COVID19MA", "2020-03-26T00:34:16.000Z": "At today's COVID-19 update, @MassLtGov and I joined @MASchoolsK12 Commissioner Riley to announce the extension of school closures for K-12 schools and non-emergency early education programs until May 4. #COVID19MA  READ: https:// bit.ly/2UjYWuo  WATCH: https:// youtu.be/yVAnenJcM2c", "2020-03-25T22:38:36.000Z": "To support our ongoing efforts to combat #COVID19MA , the Baker-Polito Administration today issued further guidance for grocery stores + pharmacies to protect both vulnerable customers and employees as they provide essential services to communities. : http:// bit.ly/3amwUDZ", "2020-03-25T19:35:29.000Z": "WATCH today's COVID-19 update live: : https:// mass.gov/covid19-updates", "2020-03-25T17:12:39.000Z": "Our administration's COVID-19 Response Command Center has announced a new advisory board made up of medical experts and infectious disease specialists to guide the Center's work as we continue to confront this outbreak. MORE: https:// bit.ly/3ak2D8U", "2020-03-25T16:17:31.000Z": "Everyone has a role to play in slowing the spread of COVID-19. \n\nWe've ordered non-essential businesses to close in-person operations, and all residents need to practice social distancing to slow the spread and protect loved ones. MORE from @MassDPH :", "2020-03-24T22:16:43.000Z": "@MassDPH has made 89 deliveries of Strategic National Stockpile assets to health care facilities across the state.\n\nOver 750,000 masks, face shields, gowns + pairs of gloves have been delivered to MA from the national stockpile. FULL UPDATE from today https:// youtu.be/DOw-FOoRkX8", "2020-03-24T20:36:32.000Z": "Stay connected with the Commonwealth's ongoing updates to confront the COVID-19 outbreak: Stay informed, learn about the next update: http:// mass.gov/covid19  Ask questions: Call @Mass_211  Get alerts: Text COVIDMA to 888-777 Watch updates: http:// youtube.com/massgovernor", "2020-03-24T19:42:36.000Z": "We also filed a bill to help cities + towns address challenges related to #COVID19 .\n\nLocal officials are on the front lines of our shared efforts to address this outbreak and as always, we're committed to supporting them. : https:// bit.ly/2QK8ZXh  : COVID-19 Update: Administration Files Municipal Legislation, Launches... On March 24, the Baker-Polito Administration filed An Act to Further Address Challenges Faced by Municipalities and School Districts Resulting from COVID-19,... youtube.com", "2020-03-24T19:42:35.000Z": "At today's #COVID19 update, we launched a new text-message alert system, so you can get the latest updates sent straight to your phone.\n\nWe're committed to keeping residents up-to-date throughout the outbreak. Text \"COVIDMA\" to 888-777 to subscribe : http:// mass.gov/covid-hske", "2020-03-24T16:20:35.000Z": "Today we're introducing another way that you can stay connected and informed during the #COVID19 outbreak. Text \"COVIDMA\" to 888-777 to receive COVID-19 text message alerts straight to your phone and stay up to date with the latest news + updates from the Commonwealth.", "2020-03-24T16:11:45.000Z": "LIVE COVID-19 update: Charlie Baker @MassGovernor LIVE COVID-19 update: pscp.tv", "2020-03-24T12:11:03.000Z": "We're taking significant steps to ensure social distancing and slow the spread of COVID-19.\n\nEffective today at noon, all non-essential businesses are ordered to close in-person operations. Read more: http:// bit.ly/2QziBnN", "2020-03-24T11:30:09.000Z": "Learn more about the Governor's emergency order requiring all non-essential businesses to close their physical workplaces to workers, customers and the public as of 3/24: http:// ow.ly/8V7u50yTEhd See the full list of what's considered essential: http:// ow.ly/4C5f50yTEhe", "2020-03-23T23:33:06.000Z": "Today's #COVID19 update: Issued an order requiring non-essential businesses + organizations to close physical workspaces + facilities Detailed guidance for \"essential #COVID19 services\" Announced @MassDPH will issue a Stay-At-Home advisory WATCH: COVID-19 Update: Governor Baker Orders All Non-Essential Businesses... On March 23, Governor Charlie Baker issued an emergency order requiring all businesses and organizations that do not provide \"COVID-19 Essential Services\" to... youtube.com", "2020-03-23T14:27:56.000Z": "I also directed @MassDPH to issue a stay-at-home advisory outlining self-isolation and social distancing protocols.\n \nResidents are advised to stay home and avoid unnecessary travel and other unnecessary activities.", "2020-03-23T14:27:55.000Z": "Today I issued an emergency order requiring all businesses and organizations that do not provide #COVID19 essential services to close their physical workplaces and facilities to workers, customers and the public. FULL DETAILS: https:// bit.ly/2QziBnN", "2020-03-23T14:05:35.000Z": "LIVE COVID-19 update: Charlie Baker @MassGovernor LIVE COVID-19 update: pscp.tv", "2020-03-22T20:35:11.000Z": "People should continue to practice social distancing but also to take advantage of online + other tools to stay connected with one another + their communities VIDEO courtesy @TENewtonMA : https:// bit.ly/Emanuel320  PHOTOS from Morningstar Baptist Church: Governor Baker Visits Morningstar Baptist Church On March 22, Governor Baker visited Morningstar Baptist Church in Mattapan. With social distancing in effect, the Governor spoke to the congregation via live-stream in a largely empty church building. flickr.com", "2020-03-22T20:35:10.000Z": "As we observe social distancing, faith communities remain a crucial way for people to stay connected during these challenging times. \n\nHonored this weekend to speak via live-stream to congregations at Temple Emanuel in Newton and Morningstar Baptist Church in Mattapan.", "2020-03-22T15:31:00.000Z": "Help prevent #COVID19 with #social  #distancing :\nCall/Facetime/online chat with friends & family.\nStay home as much as you can.\nIf you must go out:\nDon't gather in groups\nStay 6 feet away from others\nDon't shake hands or hug\n& please continue to wash your hands frequently. https:// twitter.com/MassDPH/status /1241749224074534912/video/1 ", "2020-03-22T00:03:57.000Z": "We remain committed to keeping the public informed as we all work together to slow the spread of #COVID19 .\n \nStay informed:  http:// mass.gov/covid19  @Mass_211  WATCH today's briefing: https:// youtu.be/DmCBWA8R79s COVID-19 Updates and Information Everything you need to know about COVID-19 in Massachusetts. mass.gov", "2020-03-22T00:03:56.000Z": "At today's #COVID19 briefing, I outlined initial conversations with the @USACEHQ around expanding health care capacity.\n \nWe also provided an update on testing capacity, which continues to significantly increase through the efforts of the State Lab, partner labs and clinicians.", "2020-03-21T21:21:12.000Z": "Our #COVID19 Command Center continues to prioritize efforts to ensure the health care system has the resources it needs. Yesterday we announced a $200 million infusion in cash @MassHealth for critical, acute care and safety-net health care providers. : https:// bit.ly/COVID_320", "2020-03-21T19:09:00.000Z": "This week, I ordered the closure of all early childhood education programs, but we recognize that health workers, first responders, grocery employees + others on the front-line need access to child care.\n\nToday, we posted a list of emergency programs: : https:// sforce.co/2UcjPrn", "2020-03-21T18:31:55.000Z": "LIVE COVID-19 update: Charlie Baker @MassGovernor LIVE COVID-19 update: pscp.tv", "2020-03-20T23:41:44.000Z": "WATCH today's #COVID19 update: I joined @MassLtGov , @MassHHS Sec. Sudders, @MassDPH Commissioner Bharel + @MassBIO CEO @BobCoughlin to highlight new actions to support our health care system, expedite new supplies and provide relief to small businesses. COVID-19 Update: New Health Care Resources, Small Business Relief,... The Baker-Polito Administration announced new actions to support the ongoing COVID-19 response, including new financial support for health care providers, ex... youtube.com", "2020-03-20T22:58:54.000Z": "I extend my heartfelt sympathies to the family and friends who lost their loved one. We are living in uncertain and challenging times, and our administration is bringing every available resource to bear in the fight against this disease. Quote Tweet Mass. Public Health @MassDPH Massachusetts Department of Public Health reports state's first death from COVID-19: http:// ow.ly/hOUY50yRqrJ", "2020-03-20T21:23:15.000Z": "Our top priority remains the health + safety of the Commonwealth's residents and we will continue to update the public on the steps we're taking with partners to respond to this outbreak.\n\nToday's updates: https:// bit.ly/COVID_320 Stay informed on #COVID19 : http:// mass.gov/covid19", "2020-03-20T21:23:14.000Z": "This afternoon, our administration announced a series of new actions that strengthen our response to #COVID19 : Financial support for health care providers New drive-through testing site @MassHealth waiver request for more flexibility Expanded small business relief", "2020-03-20T19:32:03.000Z": "Update -> The Baker-Polito Administration today announced @MassRevenue will waive all penalties for late-file or late-pay of meals and room occupancy taxes until June in order to assist local restaurants and hotels impacted by the COVID-19 outbreak: TIR 20-2: Late-File and Late- Pay Penalty Relief for Certain Business Taxpayers Affected by the... This Technical Information Release (\"TIR\") announces that the Department of Revenue (\"Department\") will waive any late-file or late-pay penalties imposed under G.L. c. 62C, § 33 for returns and... mass.gov", "2020-03-20T18:16:47.000Z": "LIVE COVID-19 update: Charlie Baker @MassGovernor LIVE COVID-19 update: pscp.tv", "2020-03-20T15:57:43.000Z": "As schools remain closed statewide to mitigate the spread of #COVID19 , our administration is grateful to @MASchoolsK12 + @WGBH for this important partnership to provide students with educational and cultural opportunities to continue learning + exploring outside the classroom. Quote Tweet MassEducation @MassEducation . @MASchoolsK12 has partnered with @wgbh to provide students with learning opportunities while schools are closed due to #COVID19  @MassEducation  @MassGovernor twitter.com/wgbh/status/12", "2020-03-20T13:28:13.000Z": "We are focused on expanding medical care capacity in Massachusetts, as we respond to the #COVID19 emergency. That's why we made changes making it easier for physicians who are recently retired or licensed in another state to support efforts in MA. MORE: https:// bit.ly/2WrGrFA", "2020-03-19T21:50:29.000Z": "Activating @TheNationsFirst will support our efforts to keep residents safe + secure during the #COVID19 outbreak. The expertise of the National Guard will benefit our communities with logistical support as we continue to respond to this crisis DETAILS: http:// bit.ly/MANGcovid", "2020-03-19T19:38:07.000Z": "We are glad that Quest recently received approval to conduct this important testing, and we look forward to their ongoing work that will enable us to continue to ramp up testing capacity here in the Commonwealth. Get the latest via @MassDPH at: COVID-19 Updates and Information Everything you need to know about COVID-19 in Massachusetts. mass.gov", "2020-03-19T19:38:06.000Z": "Earlier today, @MassLtGov , @MassHHS Sec. Sudders and I were at @QuestDX in Marlborough, where we joined CEO Steve Rusckowski and his team for a tour of their laboratory facility.\n\nQuest is one of two labs now completing #COVID19 testing and sending results to @MassDPH .", "2020-03-19T13:34:46.000Z": "This approval from @SBAgov will allow small businesses throughout Massachusetts that have suffered substantial economic injury as a result of #COVID19 to seek low-interest, federal disaster loans to provide them with working capital.\n\nApply online : http:// bit.ly/2QtuVG4 Quote Tweet Karyn Polito @MassLtGov ICYMI: @SBAgov approved our administration's request for a declaration of economic injury in Massachusetts to assist businesses impacted by the #COVID19 public health emergency.\n\nBusinesses can now apply for low-interest federal disaster loans.\n\nMORE: http:// bit.ly/2xT8cgf", "2020-03-19T00:23:51.000Z": "New: @SBAgov Approves Massachusetts Disaster Declaration Following Request by @MassGovernor  #MAbiz can apply now for low-interest federal disaster loans for working capital: https:// disasterloan.sba.gov/ela", "2020-03-18T21:53:46.000Z": "Today's actions will provide families, residents and businesses with the resources + support necessary to keep themselves, their children and their employees safe during the #COVID19 public health emergency.\n\nVisit http:// mass.gov/COVID19 for guidance and information.", "2020-03-18T21:53:45.000Z": "To support the continued response to #COVID19 , we have announced new measures, including adapting childcare operations, enhancing MA's healthcare system's capacity, assisting small businesses and support for unemployment benefits.\n\nLearn more : http:// bit.ly/2UjjqC1", "2020-03-18T19:01:37.000Z": "LIVE COVID-19 update: Charlie Baker @MassGovernor LIVE COVID-19 update: pscp.tv", "2020-03-18T15:10:00.000Z": "Get the latest updates about #COVID19 on our website: http:// mass.gov/2019coronavirus  #coronavirus  #massachusetts  https:// twitter.com/MassDPH/status /1240294387826831360/video/1  COVID-19 Updates and Information Everything you need to know about COVID-19 in Massachusetts. mass.gov", "2020-03-18T00:22:35.000Z": "WATCH today's #COVID19 update:\n\nI joined @MassHHS Secretary Sudders + @MassDPH Commissioner Bharel to announce changes that will expedite medical licensing to boost health care capacity and better support local boards of public health + small businesses. COVID-19 Update: Expediting Medical Licensing, Supporting Local... The Baker-Polito Administration has announced further actions to support residents, health care providers, and small businesses during the COVID-19 outbreak.... youtube.com", "2020-03-17T19:31:24.000Z": "Second, we announced the distribution of an initial $5 million in emergency funds for local boards of health. Third, I formally requested @SBAgov issue a declaration of economic injury for Massachusetts to make it possible for small businesses to obtain low-interest loans.", "2020-03-17T19:31:23.000Z": "Today we took several new actions to support our ongoing response to #COVID19 : First, we announced several emergency orders that will in part support expedited licensing for medical professionals, including physicians licensed in other states. MORE: http:// bit.ly/3b1g912", "2020-03-17T17:12:48.000Z": "LIVE COVID-19 update: Charlie Baker @MassGovernor LIVE COVID-19 update: pscp.tv", "2020-03-17T15:42:17.000Z": "#COVID19 RESPONSE: I ordered a 3-week suspension of school operations for all K-12 schools in the Commonwealth, effective today.\n\nWe recognize that measures like this cause disruptions but we are committed to mitigating the spread of COVID-19. DETAILS: http:// bit.ly/2w97pqV", "2020-03-17T00:30:10.000Z": "MA businesses looking for #COVID19 resources can find updates on the EOHED website. Our team will be updating the site as additional tools become available. Continue following @MassGovernor , @MassDPH , @MassEMA , and @Mass_211 for updates. #MAbiz  : http:// ow.ly/UroX30qqhIQ", "2020-03-17T00:01:33.000Z": "Earlier, I joined @SpeakerDeLeo , Senate President @KarenSpilka and other legislative leaders for our weekly meeting. After, I gave an update on the Commonwealth's response to the #COVID19 outbreak. MORE: http:// mass.gov/covid19  WATCH today's update: COVID-19 Update: $10 Million Small Business Recovery Loan Fund... The Baker-Polito Administration announced economic support for small businesses with a $10 million loan fund to provide financial relief to those that have b... youtube.com", "2020-03-16T22:43:58.000Z": "As we continue to take steps to protect the health + safety of residents, we recognize the hardships facing the Commonwealth's small business community.\n\nToday, we announced the creation of a $10 million Small Business Recovery Loan Fund capitalized + administered by @MassGCC .", "2020-03-16T20:15:57.000Z": "LIVE COVID-19 update: Charlie Baker @MassGovernor LIVE COVID-19 update: pscp.tv", "2020-03-16T19:55:07.000Z": "As we continue to implement steps to mitigate the spread of COVID-19, including limiting gatherings and school closures, people should remember to take these important steps to protect themselves. VIDEO via @MassDPH  MORE: http:// mass.gov/covid19 Quote Tweet Mass. Public Health @MassDPH Get the latest updates about #COVID19 on our website: http:// mass.gov/2019coronavirus  #coronavirus  #massachusetts  https:// twitter.com/MassDPH/status /1239629758310297601/video/1 ", "2020-03-16T16:26:18.000Z": "Beginning Tuesday, March 17: Subway: Saturday schedule Bus: Saturday schedule. Express Routes 325, 326, 351, 352, 354, & 501 will run regular weekday service @MBTA_CR : Reduced service Ferry: No service, visit http:// mbta.com/trip-planner  The RIDE: Service available", "2020-03-16T00:50:09.000Z": "We know that a lot of the measures we are putting into place, including mandatory school closures and prohibiting gatherings of 25 people or more, will cause disruption in people's day-to-day lives.", "2020-03-16T00:50:08.000Z": "Our administration is taking rapid steps to protect residents' health + safety and mitigate the spread of COVID-19: Suspending schools for 3 weeks Limiting most gatherings to 25 people Unemployment changes to assist workers\n\n...and more. DETAILS: http:// bit.ly/2w97pqV", "2020-03-15T22:01:17.000Z": "LIVE COVID-19 Update: Charlie Baker @MassGovernor LIVE COVID-19 Update: pscp.tv", "2020-03-15T17:41:15.000Z": "I thank the House of Representatives for quickly passing HR 6021, the Families First Coronavirus Response Act, and urge the Senate to pass the legislation. This will bring crucial resources to Massachusetts as we respond to COVID-19.", "2020-03-15T16:40:04.000Z": "Everyone has a role to play to mitigate the spread of COVID-19, and it's important we take precautions to keep older adults and those with health conditions safe.\n\nThis week, we issued new policies restricting visitors to nursing homes + rest homes. : http:// bit.ly/38QSLlv", "2020-03-15T13:38:26.000Z": "We have activated @Mass_211 to support residents throughout the ongoing response to COVID-19.\n\nMassachusetts residents can call at any time for real-time COVID-19 information, resources and referrals in multiple languages. MORE via @MassDPH : http:// bit.ly/COVID211", "2020-03-14T22:15:10.000Z": "We are ready to answer #COVID19 questions. We also provide information & referrals today & every day for social services & other programs in MA to anyone who calls (childcare, mental health programs, food programs, housing, utilities, etc). Dial 2-1-1 from any phone to reach us. Quote Tweet Town of Sandwich MA @TownofSandwich The Massachusetts Department of Public Health announces the launch of 2-1-1 to provide COVID-19 information and referrals 24/7. Massachusetts 2-1-1 will now provide real-time COVID-19 information, resources, and referrals in multiple languages. http:// sandwichmass.org/CivicAlerts.as px?AID=201 ", "2020-03-14T20:47:40.000Z": "Please visit http:// mass.gov ( http:// bit.ly/39MAh6V ) for Massachusetts #coronavirus resources and updates.  Or visit http:// nga.org/coronavirus for a list of state/territory resources pages.", "2020-03-14T19:55:05.000Z": "Earlier, we made several announcements related to our COVID-19 response: Launched new COVID-19 Response Command Center led by @MassHHS Sec. Sudders: http:// bit.ly/COVIDcenter  Announced new clinical testing protocols: http:// bit.ly/2U5B5xd  VIDEO: COVID-19 Update: Administration Launches COVID-19 Response Command... The Baker-Polito Administration announced the creation of a new COVID-19 Response Command Center. Governor Charlie Baker has asked Health and Human Services ... youtube.com", "2020-03-14T19:21:48.000Z": "We are committed to serving the needs of residents as we address the COVID-19 outbreak.  That's why I directed @MassHHS to issue guidance so @MassHealth members can access the services they need to be tested + treated for COVID-19. http:// bit.ly/2WdMi1s  http:// bit.ly/3d35Ewf", "2020-03-14T16:44:53.000Z": "Our administration has been working for weeks to address the outbreak of COVID-19, and with today's launch of a new Response Command Center, we are taking an important step in our continuing planning and preparedness efforts. MORE: http:// bit.ly/COVIDcenter", "2020-03-13T18:14:37.000Z": "The State Emergency Operations Center (SEOC) is activated with representatives from state agencies and response partners to coordinate the state's response to COVID-19 #COVID19", "2020-03-13T21:19:42.000Z": "Today I joined @MassLtGov + @MassHHS Sec. Sudders for an update on our COVID-19 response: Prohibited most gatherings of 250+ people: http:// bit.ly/COVIDgatherings  Issued new school guidance: http:// bit.ly/COVIDschool  Activated 211: http:// bit.ly/COVID211 COVID-19 Update: Governor Baker Issues Order Limiting Large Gatheri... On March 13, 2020, Governor Baker joined Lt. Governor Polito and Secretary Marylou Sudders to provide an update on COVID-19 preparedness and planning. Govern... youtube.com", "2020-03-13T19:47:49.000Z": "Today I ordered the Department of Public Utilities to protect ratepayers and prevent utilities from shutting off residents' power during this state of emergency, as we continue to take comprehensive action to respond to COVID-19.\n\nMORE: http:// bit.ly/38N19CC", "2020-03-13T17:30:09.000Z": "Today I issued an emergency order prohibiting most gatherings of over 250 people in an effort to limit the spread of COVID-19. Everyone has a role to play in stopping the spread of the Coronavirus and with this new order, we further efforts to mitigate the spread of this disease.", "2020-03-13T15:34:38.000Z": "Postponing the Marathon is an incredibly difficult thing to do, but we have seen before that the Boston Marathon and this city define \"resilient.\"\n\nWe will continue to take steps to keep our communities and Commonwealth safe as we address COVID-19. Quote Tweet Mayor Marty Walsh @marty_walsh The 2020 @Bostonmarathon is postponed until September 14, 2020.\n\nMy top priority is to make sure all @CityofBoston residents and visitors are healthy and safe from the #coronavirus . Thank you, @MassGovernor , @BAA , @johnhancockusa for all your support. Show this thread", "2020-03-13T14:38:24.000Z": "From @MassDPH : Take steps to prevent the spread of COVID-19 and other respiratory diseases: Wash your hands often Clean surfaces that are frequently touched Stay at home if you're sick Plan ahead for caring for yourself + loved ones : http:// mass.gov/covid19", "2020-03-12T20:06:08.000Z": "We continue to support local communities as the Commonwealth works together to address the COVID-19 outbreak.\n\nToday @MassLtGov and I met with Pittsfield's @MayorTyer + area legislators to discuss our shared response in the Berkshires. MORE via @MassDPH  http:// mass.gov/covid19", "2020-03-11T19:41:23.000Z": "We continue to monitor and respond to the COVID-19 outbreak. Today I spoke with our Cabinet about steps our agencies are taking to keep the Commonwealth safe and healthy. And I spoke with @UMass leaders and nursing home operators about guidance to protect students + older adults.", "2020-03-10T21:58:54.000Z": "I urge employers + other organizations to follow our example and limit or eliminate nonessential travel, limit or eliminate large events and explore telework where possible + appropriate. We are also urging older adults and those with health issues to avoid large crowds + events.", "2020-03-10T21:58:53.000Z": "Today, I have declared a state of emergency in Massachusetts to further support our response to COVID-19. We will continue planning and preparing to mitigate the spread of this disease, and have issued new guidance for Executive Branch employees. MORE: http:// bit.ly/COVIDEmergency", "2020-03-09T20:50:47.000Z": "Massachusetts Department of Public Health Updates New COVID-19 Cases in New Online Dashboard http:// ow.ly/L4Tk50yHb5b", "2020-03-08T16:00:00.000Z": "On #InternationalWomensDay , the Baker-Polito Administration is proud to recognize the achievements and accomplishments of women and girls across the globe who make our communities a better place each and every day. #WomensHistoryMonth", "2020-03-06T23:29:33.000Z": "While the risk in Massachusetts remains low, we continue to take all necessary steps to keep residents of the Commonwealth safe and healthy.\n\nResidents can continue to visit @MassDPH 's website for updates and important information: : http:// mass.gov/2019coronavirus", "2020-03-06T23:29:32.000Z": "Joined Mayor @marty_walsh , @MassHHS Sec. Sudders, @MassDPH Commissioner Bharel and other officials today at Boston City Hall to provide an update on the ongoing steps being taken to ensure Boston and Massachusetts remain prepared for the Coronavirus.", "2020-03-06T18:05:04.000Z": "Find the latest updates on #COVID19 - including guidance, recommendations, prevention tips, frequently asked questions and more - all on our website: http:// mass.gov/covid19  #coronavirus", "2020-03-05T20:42:12.000Z": "Honored to recognize the 13th Annual #WhiteRibbonDay Campaign Launch and present a proclamation declaring today as White Ribbon Day in Massachusetts as we continue our work to promote safe and healthy relationships among youth, and end gender-based violence. #ReimagineManhood", "2020-03-05T21:18:24.000Z": "Today @skennedysox & @davidortiz participated in @GraniteTelecom 's #SavingByShaving with their CEO Rob Hale, @MassGovernor Charlie Baker, and many others!\n\nThe group collectively raised $7 million in donations for @BostonChildrens !", "2020-03-05T20:08:29.000Z": "Each year, @GraniteTelecom 's \"Saving By Shaving\" raises awareness and support for the incredible cancer research done by @BostonChildrens .\n\nHad a great time as always; thanks to @skennedysox , @davidortiz , @OfficialTyLaw , @drewbrees + more for joining to support this great cause!", "2020-03-05T16:58:38.000Z": "We care deeply about the health & safety of our riders & employees. Beyond regular cleaning, we're taking proactive, system-wide steps to curb the potential spread of coronavirus: Disinfecting high-contact areas Disinfecting vehicles Installing hand sanitizers", "2020-03-05T16:15:27.000Z": "Looking forward to participating in @GraniteTelecom 's annual \"Saving by Shaving\" event, where I'll join @davidortiz , @skennedysox , @drewbrees and others to support cancer research at @BostonChildrens ! Tune in live NOW: https:// instagram.com/massgovernor/", "2020-03-04T23:04:39.000Z": "Building on the success of our two previous economic development bills, #PartnershipsForGrowth invests in further housing development and supports small businesses and innovative companies throughout the Commonwealth. Quote Tweet Karyn Polito @MassLtGov Proud to join @MassGovernor , @MassEOHED and stakeholders to celebrate the filing of our administration's $240M #MAEconDev bill, An Act Enabling Partnerships for Growth, which builds on our #HousingChoice legislation and input from regional economic development listening sessions. Show this thread", "2020-03-04T19:39:51.000Z": "Today @MassGovernor said he and @MassHHS are urging colleges, universities, and high schools to cancel upcoming international trips at this time, as a precaution. Read updates on coronavirus from @MassDPH : Governor Baker and State Health Officials Discuss Community Preparedness With Health Care, Infect... Today, the Baker-Polito Administration convened a meeting with front-line leaders representing hospitals, local public health boards, emergency response, long-term care, and higher education to... mass.gov", "2020-03-04T17:31:06.000Z": "Today, our administration met with medical experts, first responders, school officials, local public health leaders and other stakeholders to discuss our shared, ongoing preparedness planning for the Coronavirus. Read More: http:// bit.ly/32Omjic", "2020-03-03T21:33:05.000Z": "The caregiver registry established in Nicky's Law will provide an additional safeguard against abuse and further improve the safety + quality of services provided to some of our most vulnerable residents.\n\nGrateful to the many families who told their stories during this process.", "2020-03-03T21:33:04.000Z": "Protecting individuals with intellectual and developmental disabilities is vitally important, and it was an honor to celebrate the enactment of Nicky's Law today with the many advocates, legislators and families who advanced this important bill. MORE: http:// bit.ly/2PJuR4C", "2020-03-02T22:27:58.000Z": "Massachusetts remains low-risk and has had one confirmed case of Coronavirus to date, and state officials continue to coordinate with @CDCgov and implement CDC guidance. @MassDPH 's website is a resource for important information for all residents.  : http:// mass.gov/2019coronavirus", "2020-03-02T22:27:57.000Z": "Joined @MassHHS Sec. Marylou Sudders + @MassDPH Commissioner Monica Bharel to provide an update on the state's preparedness planning regarding Coronavirus.\n\nWe outlined steps that have already been taken and what resources are available to keep the public prepared and informed.", "2020-03-02T16:09:35.000Z": "On what would have been his 116th birthday, we celebrate Massachusetts' own Dr. Seuss with #ReadAcrossAmericaDay .\n\nGlad to read \"The Sneetches\" to 3rd graders at Revere's Beachmont School. Thanks to the students for asking great questions - and the staff for terrific costumes!", "2020-02-29T15:01:22.000Z": "While risk in Massachusetts for #COVID19 remains low, our website includes resources such as a preparedness checklist to help you and your family plan ahead: Know Plan Prepare You and your family can be ready for emergencies. We can help you be informed, plan ahead, and be prepared. mass.gov", "2020-02-28T22:11:45.000Z": "Our #HousingChoice bill will empower communities to meet local housing demand and plan for future growth, and we are proud of the broad and diverse level of support it has earned, including legislators and local officials here in #Springfield . MORE: http:// bit.ly/2whPyhm", "2020-02-28T20:54:38.000Z": "Congrats to @HolyokeCC on the grand opening of your new campus center. Pleased that through @DCAMM_MA , our administration was able to fund this important project that has resulted in a valuable new resource for students, staff, and visitors. Quote Tweet Holyoke Comm College @HolyokeCC Welcome @MassGovernor Charlie Baker!", "2020-02-28T19:44:43.000Z": "The newly renovated Campus Center is officially open!  @HCCPrez  @MassGovernor", "2020-02-28T19:22:02.000Z": "The Gateways Housing Rehabilitation Program is the result of the collaboration between our administration and the Legislature to pass the state's largest housing bond bill in 2018, making critical resources available to communities like Pittsfield.\n\nMORE: http:// bit.ly/39fqKVS", "2020-02-28T19:22:01.000Z": "Glad to be in Pittsfield to announce new funding to address aging housing in cities across the state. With $2.1 million, nine communities will rehabilitate 75 units and make them available to low + middle-income households through the new Gateways Housing Rehabilitation Program.", "2020-02-28T18:53:44.000Z": "Our administration has been proud to make a nearly $12.5 million commitment to BIC's development and leverage key partnerships to make this facility a reality as it enables and accelerates growth of small and medium-sized companies. via @MassEOHED : http:// bit.ly/32Lx6Kd", "2020-02-28T18:53:43.000Z": "Facilities like the Berkshire Innovation Center are what sets Massachusetts apart, ensuring that cities and towns across the Commonwealth experience the benefits of our thriving life sciences and innovation sectors.\n\nThrilled to celebrate @BerkInnovation 's ribbon-cutting today.", "2020-02-27T20:18:03.000Z": "We are committed to increasing opportunities for minorities and women across Massachusetts and strengthening the relationship between the Commonwealth and its diverse business community. MORE: http:// bit.ly/2wcD3Do", "2020-02-27T20:18:02.000Z": "Pleased today to join members of our Black + Latino Advisory Commissions and the @MA_BLLC to announce new legislation and administrative changes aimed at promoting greater participation of minority- and women-owned businesses in public construction, including small businesses.", "2020-02-26T19:53:29.000Z": "#SkillsCapital Grants on today's @GDTnews front page\n\n\"Work for a new generation: GMGI wins $940K grant for biomanufacturing lab at academy\"\n\nMore on how the grant will enhance #GMGI 's \"visionary academic element\" alongside its cutting-edge research: http:// ow.ly/R21m30ql0ja GIF", "2020-02-25T22:41:35.000Z": "#SkillsCapital Grants, and this inaugural round of multi-year funding, preserve the state's talent pipeline by funding expanded enrollment + updating industry-standard equipment to provide students with hands-on, in-demand skills sought by employers. : http:// bit.ly/2VkI5bG", "2020-02-25T22:41:34.000Z": "Glad to join members of the Workforce Skills Cabinet, local officials and legislators today in #Gloucester to announce $14.6 million in #SkillsCapital Grant awards to 54 educational institutions across MA to upgrade equipment + expand enrollment in career education programs.", "2020-02-25T18:20:00.000Z": "The @WestEndHouseBGC  #LightofDawnn Awards celebrate the life of Dawnn Jaffier, her commitment to her community and her compassion for others.\n\nCongratulations to today's scholarship recipients + award winners, each of whom exemplify Dawnn's service, leadership and kindness.", "2020-02-24T16:48:45.000Z": "Honored to join @UNCF , legislators and local leaders this morning to celebrate #BlackHistoryMonth and Historically Black Colleges and Universities.\n\nOur administration is grateful for this continued, shared commitment to supporting equity and inclusion for students throughout MA.", "2020-02-21T21:28:08.000Z": "Our administration is committed to partnering with local leaders and community organizations that are on the ground in urban neighborhoods to encourage collaborative, high-impact projects that directly support the quality of life and access to opportunity of residents. Quote Tweet City of Boston @CityOfBoston @marty_walsh , @MassGovernor and @MassLtGov joined members of the community at Black Market in Roxbury for the announcement of the Urban Agenda Grants program. http:// ow.ly/JDem50ysTrJ", "2020-02-20T17:36:26.000Z": "Signed in November, this law intends to reduce the number of people injured or killed due to distracted driving + levies penalties that will be enforced by local + state police. We urge all drivers to pay attention when they are behind the wheel. : http:// bit.ly/39LZrly", "2020-02-20T17:36:25.000Z": "Beginning this Sunday, February 23rd, our administration's #HandsFree Law will take effect for drivers throughout the Commonwealth. This law holds drivers accountable for keeping their focus on the road while being aware of the vehicles, pedestrians and bicyclists around them.", "2020-02-20T16:21:47.000Z": "Pleased to join @MassLtGov , @MassEOHED and local officials this morning to announce #MassWorks Infrastructure Grant Program funding for the City of #Newton , which will support improvements and upgrades in safety + ease of travel for residents. : http:// bit.ly/39R4a5w", "2020-02-19T23:13:05.000Z": "Our administration was glad to join @marty_walsh , city and local officials this afternoon in #Roxbury to announce $2M in Urban Agenda Grant Program funding to 23 projects in 21 cities throughout the Commonwealth to support workforce, community + economic development.", "2020-02-19T21:40:21.000Z": "Honored to join veterans, members of the military, and their families to commemorate the 75th Anniversary of the Battle of Iwo Jima.\n\nIwo Jima Day represents an important reminder of the courage and sacrifice of our service men and women, and our Commonwealth is forever grateful.", "2020-02-18T22:50:36.000Z": "ICYMI, via @enterprisenews : \"Bridgewater firefighter training facility puts 'full services within reach'\"\n\nOur FY21 budget plan builds on proposed + enacted investments to build out this key training facility that expands fire training for southeastern MA. Bridgewater firefighter training facility puts 'full services within reach' As plans shape up to develop the former treatment center, a class of recruits from southeastern Massachusetts has begun training enterprisenews.com", "2020-02-18T16:09:42.000Z": "Check out this great video about the Baker-Polito administration's Career Techincal Initiative, which has the potential to provide middle-class career pathways to thousands of youth and adults in the Commonwealth. Skills Capital - 60 Second High School Students - Draft V1 - DO NOT... youtube.com", "2020-02-14T17:42:31.000Z": "This week, we continued to spotlight #CareerTech by hearing about the value of being connected with vocational skills that are key for today's economy.\n\nGreat to hear these stories from students at @Official_GLTS , where @MassLtGov and I joined partners to launch this initiative.", "2020-02-14T16:29:41.000Z": "Thanks @AAAnortheast for partnering with public safety and transportation officials in our administration to educate drivers about the new hands-free law taking effect in the coming weeks. Learn More: http:// mass.gov/handsfree Quote Tweet Mass. Transportation @MassDOT #Rockland : Highway Administrator Gulliver joins @aaanortheast , @MassStatePolice , to highlight Hands Free driving law- takes effect February 23.", "2020-02-14T16:04:39.000Z": "Great to join students and teachers at Oak Middle School in #Shrewsbury this morning to celebrate #ValentinesDay with messages and valentines from the #RESPECTfullyMA public awareness campaign.\n\nHealthy relationship culture starts with us! : http:// bit.ly/RESPECTfully", "2020-02-13T22:28:59.000Z": "This week, as we solemnly mark the two-year anniversary of the tragedy in Parkland, @stophandguns and other advocates are promoting a new initiative that will enable business to show their support for commonsense gun laws. Quote Tweet Crystal Haynes @crystalhaynes - @stophandguns hold a news conference with the parents of Parkland shooting victim Joaquin Oliver urging businesses to shoe support for universal background checks for gun owners. \n\nThe symbol to be displayed is an image of Joaquin and reads \"gun safety certified\" @boston25 Show this thread", "2020-02-13T16:25:27.000Z": "The #CareerTech Initiative aims to promote skills training + education for adult learners + students across the state, and we were proud to highlight its importance at @WooTechLife . via @Specnews1worc : http:// bit.ly/2uHJxdd  via @telegramdotcom : Worcester Tech's 'three-shift' model garners praise WORCESTER - Gov. Charlie Baker toured a \"three-shift\" vocational program at Worcester Technical High School Wednesday night that he and his administration are waging could be a solution to the... telegram.com", "2020-02-13T15:51:57.000Z": "ICYMI via @southcoasttoday : Last week, we traveled to #NewBedford to announce $11.6 million in grants to help cities + towns prepare for #climatechange impacts. Now 82% of the Commonwealth's communities are participating in the MVP program through @MassEEA Baker announces climate change grants in New Bedford NEW BEDFORD - Governor Charlie Baker announced $11.6 million in grants to cities and towns through the Municipal Vulnerability Preparedness (MVP) Program, while he was at the City Pier on Wednesday... southcoasttoday.com", "2020-02-12T18:32:20.000Z": "Massachusetts Opioid-Related Overdose Deaths in Massachusetts Fall 5 Percent Since Peak in 2016 http:// ow.ly/Vqkw50ykLfl", "2020-02-13T01:39:07.000Z": "A key part of our #CareerTech Initiative is expanding evening curriculum so more adults can connect with valuable skill-building opportunities.\n\nGlad to spotlight this approach at @WooTechLife , which has already pursued this model with success, as we heard from students tonight", "2020-02-12T20:50:02.000Z": "More about #CareerTech  READ: http:// bit.ly/CareerTechInit iative   PHOTOS: http:// bit.ly/2Soo0iN  via @EagleTrib : http:// bit.ly/37GnMbV", "2020-02-12T20:50:00.000Z": "Our Career Tech Initiative aims to \"turbocharge\" our vocational schools so they can connect more students + workers with the skills they need for today's economy.\n\nWe launched #CareerTech last month at @Official_GLTS and tonight we'll continue to spotlight it at @WooTechLife .", "2020-02-11T20:41:56.000Z": "In the latest #CornerOfficeConnect :  #MASOTC lays out 2020 priorities  #CareerTech aims to expand skill-building Key investments in #BakerPolitoFY21 plan Accelerating @MBTA upgrades  @MassLtGov details evidence kit tracking system Read More http:// bit.ly/2UJoYYD", "2020-02-11T18:30:34.000Z": ". @MassLtGov and I are appreciative of our collaborative relationship and ongoing partnership with the @MA_BLLC , as we work together on key issues like housing, education, workforce development and more.", "2020-02-11T18:30:31.000Z": "Grateful to join our friends in the Black and Latino Legislative Caucus to mark #BlackHistoryMonth with \"Black Excellence On The Hill,\" honoring not only the leaders of the past, but community members who make a difference on behalf of their neighbors every single day.", "2020-02-10T23:01:19.000Z": "Through the #M2I2 program, we can support innovative advanced manufacturing projects that sustain the Commonwealth's innovative edge and solve real-world problems. Glad to see partners like @Mass_Tech + @UMassLowell join with @MassLtGov for today's event. Quote Tweet Karyn Polito @MassLtGov Great to visit @saintgobain in #Northborough this afternoon to witness the MA Manufacturing Innovation Initiative (M2I2) grant funding program in action.\n\nThis M2I2-funded project partners with @UMassLowell to embed sensors into textiles to help monitor critical infrastructure.", "2020-02-10T18:23:09.000Z": "Governors across the country are solving problems for their residents by working across the aisle to produce solutions that work.\n\nGrateful for the chance to convene with partners from other states at this winter's @NatlGovsAssoc meeting. #WeTheStates", "2020-02-10T16:31:44.000Z": "ICYMI, Adams & Mohawk Trail Woodlands Partnership receive $1.5m grant for climate resiliency improvements and a forest management study, part of @MassGovernor announcement of $11.6 million in #climatechange adaptation grants. via @masslivenews : Adams & Mohawk Trail woodlands Partnership gets $1.5 million grant for climate resiliency projects In total, 52 cities and towns received climate change resiliency grants from the state as part of the Municipal Vulnerability Preparedness program. masslive.com", "2020-02-06T19:56:04.000Z": "The @MBTA started these projects in 2019 and will continue a vigorous schedule of construction and repairs aimed to build a system that will move more people from point to point in less time, while minimizing necessary disruptions. #BuildingABetterT Quote Tweet MBTA @MBTA #BuildingABetterT is our commitment to make the T a better, safer, and more reliable public transit system - one befitting of our riders and the communities we serve. Building on the work and lessons learned in 2019, we've outlined the scope of work we aim to accomplish in 2020. Show this thread", "2020-02-06T19:56:03.000Z": "Our administration is dedicated to building a better @MBTA for our riders that is safer and more reliable, and the 2020 Infrastructure Acceleration Plan will help to achieve this goal faster. Pleased to announce details today at Reservoir Station. MORE: http:// mbta.com/BBT2020", "2020-02-05T22:26:36.000Z": "The MVP program is providing a glimpse at the monumental scale of this challenge, which is why I filed the #ResilientMA legislation, which would provide a new and sustained funding source for climate resilience projects. MORE via @MassEEA : Baker-Polito Administration Awards $11.6 Million in Climate Change Funding to Cities and Towns The Baker-Polito Administration today announced $11.6 million in grants to cities and towns through the Municipal Vulnerability Preparedness (MVP) Program. mass.gov", "2020-02-05T22:26:35.000Z": "Our administration is committed to working with local communities to build long-term resilience for critical infrastructure and ensure they have the resources they need to prepare for the challenge of climate change. Quote Tweet MAEnergy Environment @MassEEA . @MassGovernor announces over $11 million in funding to more than 80 cities and towns throughout the Commonwealth to support #climate resilience projects through the Municipal Vulnerability Preparedness program.", "2020-02-05T21:25:03.000Z": "Yesterday, in addition to announcing more affordable housing investments, we made clear that we need to do more to address the housing crisis. #HousingChoice will give communities flexibility to approve new projects to support 135,000 new units by 2025. Charlie Baker touts affordable housing, zoning bill Gov. Charlie Baker announced a big chunk of state cash to build 143 new income-restricted housing units in Boston and hundreds more elsewhere - and he took the opportunity to tout again his stalled bostonherald.com", "2020-02-05T18:47:19.000Z": "ICYMI: Grateful for the chance to testify on our comprehensive bill designed to prepare the health care system for the future via @BosBizJournal : \"Legislators largely back Baker's health care plan in joint committee hearing\" http:// bit.ly/31cgKJD  : Governor Baker, Secretary Sudders Testify on Administration's... On Tuesday, January 28, 2020 Governor Charlie Baker and Health and Human Services Secretary Marylou Sudders testified in support of the Baker-Polito Administ... youtube.com", "2020-02-05T18:11:22.000Z": "DPH is working closely w/ @CDCgov to monitor the novel #Coronavirus originating in Wuhan, China. To date, there has been 1 confirmed case in MA; risk to residents remains low. Latest info from DPH including new printable fact sheets in multiple languages: http:// mass.gov/2019coronavirus", "2020-02-04T20:54:44.000Z": "Glad to have made this announcement at @EBNHC , close to the site of one of the projects funded today. \n\nWe are grateful for our partnership with communities to advance this new production, but we know it's crucial to do more to promote growth, including our #HousingChoice bill.", "2020-02-04T20:54:41.000Z": ". @MassLtGov and I were pleased to be in #EastBoston today to announce affordable housing awards supporting 11 projects across the Commonwealth, advancing the development of 587 new rental units, including 443 units affordable for low-income households : http:// bit.ly/2RVOiJ0", "2020-02-04T13:56:28.000Z": "We continue to work to advance our #HousingChoice bill. We're grateful for the broad coalition that continues to support this legislation which would give communities tools to promote new housing production and look forward to working with legislative colleagues on this bill.", "2020-02-04T13:50:34.000Z": "Late last month, @MassLtGov and I were at Greater Lawrence Technical School to launch our #CareerTech Initiative. This program aims to leverage the investments we've made in vocational schools and connect workers with important skill-building programming. Quote Tweet Charlie Baker @MassGovernor This new initiative, developed by our Workforce Skills Cabinet, leverages existing resources at vocational schools to expand access to #CareerTech training, building on major investments we've made in recent years to support these great institutions. : http:// bit.ly/CareerTechInit iative  Show this thread", "2020-02-04T13:45:55.000Z": "We continue to confront transportation challenges by investing more in the system. We're continuing our efforts to deliver on our $8 billion capital plan for the @MBTA and look forward to working collaboratively with the Legislature on our $18 billion transportation bond bill.", "2020-02-04T13:36:45.000Z": "This year, we're focused on major health care reform legislation we filed this past fall. It aims to prepare the system for the future by increasing access to care, among other key goals. \n\nGrateful for the chance to testify on our bill last week: Governor Baker, Secretary Sudders Testify on Administration's... On Tuesday, January 28, 2020 Governor Charlie Baker and Health and Human Services Secretary Marylou Sudders testified in support of the Baker-Polito Administ... youtube.com", "2020-02-04T13:29:04.000Z": "In November, I was proud to sign education reform legislation investing more in school districts across the Commonwealth and providing new tools to ensure students in all schools have the chance to succeed. We look forward to delivering on these reforms. Governor Baker Signs Education Funding Bill Investing In Public... Governor Charlie Baker was joined by Lt. Governor Karyn Polito, Speaker of the House Robert DeLeo, Senate President Karen E. Spilka, Representative Alice Pei... youtube.com", "2020-02-04T13:15:15.000Z": "It's an honor to address the @bostonchamber on our administration's priorities + agenda. @MassLtGov and I look forward to continuing to collaborate with you + all employers as we strengthen the Commonwealth's economy + tackle major challenges. via @NECN  https:// bit.ly/36VDxL3", "2020-02-01T18:26:10.000Z": "People should take the same precautions they do to prevent the spread of the cold and flu, and @MassDPH will continue to work with medical professionals across the Commonwealth.", "2020-02-01T18:26:09.000Z": "Protecting public health is a top priority for our administration and while the risk remains low for Massachusetts, state public health officials are working hand-in-hand with @CDCgov , local boards of health and other local partners. Quote Tweet Mass. Public Health @MassDPH Man returning from Wuhan, China is first case of 2019 Novel Coronavirus confirmed in Massachusetts: http:// ow.ly/MDXF50yaX9f", "2020-01-31T23:15:31.000Z": "Massachusetts state health officials announce Coronavirus preparation measures: http:// ow.ly/Rnnb50yaDJJ", "2020-01-31T19:18:11.000Z": "And we are glad to join advocates in pursuing greater prioritization of mental health. via @masslivenews : \"'Like any other kind of health issue': Advocates see Gov. Charlie Baker's bill as step forward for mental health services in Massachusetts\" 'Like any other kind of health issue': Advocates see Gov. Charlie Baker's bill as step forward for... About half of psychiatrists and psychologists in Massachusetts don't accept insurance, said Health and Human Services Secretary MaryLou Sudders. masslive.com", "2020-01-31T19:18:10.000Z": "We continue to build a broad coalition for this legislation which aims to improve outcomes for patients, increase access to care and drive down costs. via @BosBizJournal : \"Legislators largely back Baker's health care plan in joint committee hearing\" Legislators largely back Baker's health care plan in committee hearing Legislators overall seemed to like the message of Gov. Baker's health care bill - that the state needs to bolster investment in primary care and behavioral health care. bizjournals.com", "2020-01-31T19:16:25.000Z": "RECAP: This week @MassHHS Sec. Sudders and I testified on our administration's comprehensive health care legislation. @WCVB covered our recent visit to @HarvardSNHC to spotlight the bill's focus on boosting access to behavioral health care + support for community health centers.", "2020-01-31T16:49:16.000Z": "#BakerPolitoFY21 | Economic, Workforce Development:\n\nThis budget builds on our efforts to strengthen our economy + workforce, from initial funding for our #CareerTech Initiative to support for small businesses and advanced manufacturing training. : http:// bit.ly/FY21MA", "2020-01-30T21:26:46.000Z": "At my #MASOTC address last week I detailed our administration's progress on key priorities like economic growth, climate change, transportation + education.\n\nThanks to our collaborative work on these and other issues, I'm proud to say that the state of our Commonwealth is strong.", "2020-01-30T19:26:17.000Z": "DPH is working closely with the @CDCgov to monitor the novel #Coronavirus originating in Wuhan, China. To date, there are no MA cases and risk to residents is low. For the latest, visit https:// mass.gov/2019coronavirus", "2020-01-30T18:15:22.000Z": "Since taking office, our administration has prioritized building broadband connectivity in all of the Commonwealth's communities. @MassLtGov and I were in #Princeton today to celebrate the completion of the town's new broadband network, supported by a nearly $1M Last Mile grant.", "2020-01-30T17:19:22.000Z": "Great to be in #Worcester to spotlight energy efficiency improvements at @PolarBeverages . \n\nThese upgrades showcase another way that the Commonwealth maintains national energy efficiency leadership through public + private efforts. via @telegramdotcom : http:// bit.ly/36HkjbY", "2020-01-30T16:06:17.000Z": "> @EagleTrib editorial notes vocational schools are positioned to provide skill-building programming to address workforce gaps but \"the missing piece is instruction.\n\n\"Fortunately the state is taking encouraging steps to fill the void\" with #CareerTech .  http:// bit.ly/37GnMbV", "2020-01-29T22:30:30.000Z": "This tracking system is an important tool that Massachusetts can now provide to survivors of sexual assault and the network of public health and safety agencies who support them.\n\nThanks @MassLtGov and members of our team for providing this overview today. Quote Tweet Karyn Polito @MassLtGov Proud to join state officials, members of the Governor's Council to Address Sexual Assault and Domestic Violence and advocates this afternoon to announce the launch and implementation of our Commonwealth's sexual assault evidence collection kit (SAECK) tracking system. Show this thread", "2020-01-29T21:36:08.000Z": "#USMCA was enacted today - this bipartisan, commonsense agreement enables Massachusetts and other states to engage and prosper in global trade markets as we continue to strengthen our longstanding partnerships with Canada and Mexico.", "2020-01-28T20:09:30.000Z": "By boosting investments in primary and behavioral care, taking steps to protect consumers from unexpected costs, and improving quality and access to care, we can prepare our health care system to meet new challenges in the future. Read the testimony: http:// bit.ly/VALUEHealthCare", "2020-01-28T20:09:09.000Z": "Today, @MassHHS Sec. Marylou Sudders and I testified before the Joint Committee on Health Care Financing Committee on our administration's comprehensive health care legislation, designed to improve outcomes for patients, increase access to care and bring down costs.", "2020-01-27T23:13:03.000Z": "On #HolocaustRemembranceDay and the 75th anniversary of the liberation of Auschwitz, #WeRemember the tragedy and destruction endured by millions of Jews and countless others, and we honor the continued, unwavering bravery and strength of the Jewish people.", "2020-01-27T18:12:36.000Z": "#BakerPolitoFY21 | Tackling The Addiction Crisis:\n\nIncluding our Fiscal Year 2021 budget proposal, our administration has boosted support for substance misuse programming by $209 million or 175% since taking office. MORE: http:// bit.ly/FY21MA", "2020-01-27T16:41:14.000Z": "This @usedgov recognition affirms the Little School community's work to create a thriving school where students master challenging content.\n\nWe remain proud of the Commonwealth's strong education system and look forward to utilizing new tools to ensure students everywhere succeed", "2020-01-27T16:41:12.000Z": "An honor to join educators and students this morning to mark the selection of the E. Ethel Little Elementary School in #NorthReading as a @NatlBlueRibbon School, one of six from Massachusetts recognized in 2019. #NBRS2019", "2020-01-25T15:34:22.000Z": "Collaboration with the Commonwealth's cities and towns has been a hallmark of our administration.\n\nGlad to address @massmunicipal 's annual meeting and outline how our ongoing agenda and #BakerPolitoFY21 budget proposal continue to support communities.", "2020-01-24T22:48:39.000Z": "Pleased today to join @RepRichardNeal , Mayor Domenic Sarno, Rep. Bud Williams and other partners to celebrate the completion of Platform C, which will significantly improve customers' experience at Union Station, an important hub for the vitality of Springfield and the region.", "2020-01-24T19:28:49.000Z": "#BakerPolitoFY21 | Historic Support For Communities:\n\nOur budget plan continues to fulfill our promise to invest in cities and towns, boosting unrestricted local aid to $1.1 billion, another increase equal to the rate of consensus revenue growth. MORE: http:// bit.ly/FY21MA", "2020-01-24T18:57:08.000Z": "\"We need to diversify our workforce. We all know technology has changed our world. It's changed how we communicate. How we consume. How we learn.\"\n\nMore on how we are encouraging + supporting diversity in #STEM  via @masslivenews  : Tech Foundry in Springfield, Boston's Hack.Diversity celebrate state funding STEM jobs are growing mostly in a few Boston-area communities - making a compelling argument, business boosters heard Thursday, for increasing training and outreach in Western Massachusetts to boost... masslive.com", "2020-01-23T22:51:19.000Z": "This new initiative, developed by our Workforce Skills Cabinet, leverages existing resources at vocational schools to expand access to #CareerTech training, building on major investments we've made in recent years to support these great institutions. : http:// bit.ly/CareerTechInit iative ", "2020-01-23T22:51:15.000Z": "Since taking office, we've been committed to providing the opportunities and resources for students and adult learners throughout the Commonwealth to develop the skills and education necessary to set them on a path to success. #CareerTech", "2020-01-23T22:51:13.000Z": "At @Official_GLTS today, we launched our administration's Career Technical Initiative, which I outlined in this week's #MASOTC address. #CareerTech aims to train an additional 20,000 skilled workers over the next 4 years to help close skills gaps and meet the needs of employers.", "2020-01-23T21:41:35.000Z": "#BakerPolitoFY21 | Investing in Students:\n\nOur Fiscal Year 2021 budget proposal includes $355 million in new spending related to the landmark education reform law enacted last year, including new chapter 70 resources for local school districts. MORE: http:// bit.ly/FY21MA", "2020-01-23T21:10:35.000Z": "Today our office was pleased to swear in @BCLAW Dean Vincent D. Rougeau to serve on the Commission to Select the Director of the Office of Political Campaign and Finance.\n\nWe look forward to Dean Rougeau's contributions to the Commission as it selects a new @OCPFReports director.", "2020-01-23T18:18:23.000Z": "The Brownfields Redevelopment Fund breathes life into vacant or underused properties where redevelopment may be complicated by environmental contamination.\n\nPleased today to announce over $2.6M in awards from this fund to support the environmental assessment + cleanup of 16 sites", "2020-01-23T15:42:46.000Z": "....... @MassGovernor  budget proposal expands early college, which is a focus of the Administration that we will continue to push ... @MassEducation  ... @therenniecenter  #conditionofeducation", "2020-01-22T19:22:44.000Z": "This balanced budget will result the in the Rainy Day Fund reaching a historic balance of $3.5 billion and includes a new tax credit to support individuals with disabilities seeking employment.\n \nRead the full proposal: https:// bit.ly/2RKYVgi  #BakerPolitoFY21", "2020-01-22T19:22:42.000Z": "Today, with the filing of our Fiscal Year 2021 budget proposal, a fiscally responsible plan that makes key investments to support our residents ranging from education to the Commonwealth's transportation system.\n\nMore on the proposal: http:// bit.ly/BakerPolitoFY21  #BakerPolitoFY21", "2020-01-22T00:44:04.000Z": "We've demonstrated time and again that we can find common purpose. That we can focus on progress and build on what we have.\n\nThat we can lead and represent the very special people of this very special place we call home.\n\nLet's make them and each other proud.\n\nThank you. #MASOTC", "2020-01-22T00:40:11.000Z": "As I look back over the past 5 years, I can't help but be gratified by the opportunity to serve and humbled by the people I've met.\n\nI've witnessed the faith and resilience of the Frates family, who turned a terrible twist of faith into an opportunity to change the world. #MASOTC", "2020-01-22T00:38:09.000Z": "Last fall, we enacted another major education reform.\n\nThis year, we'll focus on funding this new law and implementing proven strategies that change the game for kids in every school.\n\nLet's embrace this chance to give every kid the opportunity they deserve to be great. #MASOTC", "2020-01-22T00:34:33.000Z": "We're also pursuing an initiative to address the persistent skills gap between people working their way up the ladder + the needs of our employers.\n\nWe're launching a $15 million partnership with vocational schools to give thousands of people valuable #CareerTech skills #MASOTC", "2020-01-22T00:33:08.000Z": "As we work together to keep our economy strong, @MassLtGov spent a year touring the Commonwealth, hearing from stakeholders as we drafted our economic development plan.\n\nWe look forward to filing legislation on the final report, #PartnershipsForGrowth next month. #MASOTC", "2020-01-22T00:32:06.000Z": "We've enacted the largest housing bond bill in state history and we're better supporting homeless families.\n\nBut demand is outpacing supply and our current zoning laws aren't working.\n\nFor the sake of our young people, seniors + families, let's get #HousingChoice done. #MASOTC", "2020-01-22T00:29:24.000Z": "To build on these improvements, we filed an $18 billion transportation bond bill last year, the largest ever.\n\nIt includes $11 billion for road + bridge improvements and $7 billion for transit.\n\nOur 2021 budget will include a $135 million boost in @MBTA operating funds. #MASOTC", "2020-01-22T00:28:31.000Z": "We rescued the $2 billion Green Line Extension and expanded commuter rail service.\n\nWe've funded and begun building the decades-delayed South Coast Rail project.\n\nWe've replaced a third of the bus fleet and are boosting dedicated bus lanes.\n\nBut we have much more to do. #MASOTC", "2020-01-22T00:27:51.000Z": "Since 2015, we've been addressing transportation challenges: Years of under investment in the T and skyrocketing workforce growth.\n\nAt the @MBTA , our administration is the first ever to invest more than $1 billion per year and fund a 5-year, $8 billion upgrade program. #MASOTC", "2020-01-22T00:24:40.000Z": "With two major affordably priced #offshorewind projects, we're leading on renewable energy, but we must continue to take bold action.\n\nThat's why tonight, I'm committing the Commonwealth to achieving an ambitious climate goal: net zero greenhouse gas emissions by 2050. #MASOTC", "2020-01-22T00:23:24.000Z": "Despite significant steps backward in DC, Massachusetts continues to lead on climate change.\n\nMore than 285 communities have joined our Municipal Vulnerability Program and we've proposed creating a trust to generate $130 million a year to protect crucial infrastructure. #MASOTC", "2020-01-22T00:21:33.000Z": "We filed a major health care reform bill last fall. It's all about nudging caregivers and health plans to put more resources into primary and behavioral care while limiting overall cost increases.\n\nMassachusetts has always led the nation on health care. Let's do it again. #MASOTC", "2020-01-22T00:17:23.000Z": "We've been able to do all of this by finding common ground and putting the people of our Commonwealth first.\n\nThat's why I can stand before you tonight and say without a doubt: The state of our Commonwealth is strong. #MASOTC", "2020-01-22T00:16:52.000Z": "Finally, we've taken bold action to tackle the opioid crisis, and have shown the rest of the nation the way forward. \n\nWorking together, we nearly tripled state spending on prevention and treatment, and what was a public policy catastrophe now offers hope for families. #MASOTC", "2020-01-22T00:16:05.000Z": "Our economy is booming: Unemployment is below 3%.\n\nThanks to strong fiscal management + growth, the Rainy Day Fund balance is $3.5B - the highest ever.\n\nWe cut taxes for working families + delivered on a promise made to voters 20 years ago to reduce the income tax to 5%. #MASOTC", "2020-01-22T00:15:17.000Z": "When we took office many communities in Western Mass had no plan for installing high speed internet.\n\nBut later this month, after 4 years of work and great support from the Legislature, all those communities will either have high speed service or a plan to make it happen. #MASOTC", "2020-01-22T00:14:44.000Z": "Last January, we proposed to expand the Medicare Savings Program. Starting this month, 40,000 low-income seniors will save thousands of dollars on their out of pocket drug costs. #MASOTC", "2020-01-22T00:14:01.000Z": "Last year, we led the nation in responding to the growing body of evidence around vaping. As the warning signs of sudden illness + death became clear, we acted.\n\nToday we have the most comprehensive framework in the country to regulate this potentially dangerous activity. #MASOTC", "2020-01-22T00:12:57.000Z": "To my fellow citizens, thank you for this opportunity to serve.\n\nAnd thank you for your insights, high fives, fist bumps and obvious commitment to your communities, your friends and family and one another. Your kindness and generosity are like oxygen for the rest of us. #MASOTC", "2020-01-22T00:12:20.000Z": "It's an honor to be here tonight to update the people of Massachusetts on our ongoing work to strengthen this Commonwealth from one end to the other. \n\nJoin us NOW on http:// Mass.Gov for the #MASOTC .", "2020-01-21T20:04:09.000Z": "I look forward to sharing an update with you tonight on the state of our Commonwealth.\n\nJoin us for #MASOTC this evening, streaming live on http:// Mass.Gov .", "2020-01-20T14:55:19.000Z": "Honored to attend Boston's 50th annual Martin Luther King Memorial Breakfast.\n\nJoined @marty_walsh , @RepPressley and @SenMarkey for an important #MLKDay conversation about re-committing ourselves to Dr. King's values as we face today's challenges.", "2020-01-19T18:20:04.000Z": "On Tuesday, January 21st - watch Governor Baker's 2020 State of the Commonwealth address streamed live on the http:// Mass.gov homepage. #MASOTC", "2020-01-18T14:22:44.000Z": ". @CharlieBakerMA is here to kick-off our #LaunchDay of service! #IHaveADream  #GoodTrouble", "2020-01-18T17:23:06.000Z": "First Lady Lauren Baker, @MassLtGov and I were honored to be with @TeamProject351 earlier to help them kick-off their special Launch Day of service on #MLKWeekend . Thank you for your inspiring work to promote service today and every day.", "2020-01-17T22:10:46.000Z": "Join us next week for #MASOTC , as I share an update about our administration's ongoing work to strengthen our Commonwealth. Tue, Jan. 21, 2020 7:00 PM Watch live on http:// Mass.Gov", "2020-01-16T21:48:44.000Z": "#FY20BudgetMA included a key section that authorized expanded eligibility for the Medicare Savings Program which will significantly reduce health care costs for tens of thousands of individuals + promote economic security. MORE: http:// bit.ly/2kPGJWz Quote Tweet Mass. Executive Office of Elder Affairs @Mass_EOEA @MassHHS  @MLSudders explaining the Administration's leadership on #Medicare Savings Programs said \"As people age, we should be taking worries off of them.\" These programs can help relieve worries of health costs for #olderadults & people with disabilities. https:// mass.gov/service-detail s/help-paying-medicare-costs  Show this thread", "2020-01-16T19:42:20.000Z": "We also addressed the 85th Recruit Training Troop - believed to be the largest and most diverse pool of trooper candidates in State Police history.\n\nColonel Mason has been working hard on key reforms, and his ongoing work + this bill will continue to move the Department forward.", "2020-01-16T19:42:17.000Z": "In New Braintree today, I joined @MassStatePolice Colonel Christopher Mason + @EOPSS Sec. Turco to update the public on the progress of key reforms and announce a bill to improve + modernize State Police hiring, promotions, accountability + discipline : http:// bit.ly/2FSAsAp", "2020-01-15T23:15:36.000Z": "Great to join my colleagues in the Legislature in welcoming Division 5 Champions Swampscott High School to the State House this afternoon to celebrate their Super Bowl win Congratulations, @SportsBigBlue !", "2020-01-14T19:05:45.000Z": "Our administration is providing important resources that build on our commitment to ensuring access to clean drinking water for schools and early education and care facilities across the Commonwealth. MORE via @MassEEA : http:// bit.ly/2RkT6Ga Quote Tweet Kathleen Theoharides @EEASecretary Ensuring all MA residents have access to safe, clean drinking water is a priority for @MassGovernor 's administration, and these great programs will help the schools and facilities caring for our children both test for lead in their water and provide clean water to their students. twitter.com/MassEEA/status", "2020-01-13T22:00:21.000Z": "We're working to make CharlieCards more easily available to more people. Thanks to our partnership with @bgcboston , free no-balance CharlieCards will now be distributed at Boys & Girls Clubs in Boston Clubhouses allowing more riders access to lower fares. http:// ow.ly/9Usp50xReLR", "2020-01-14T15:37:03.000Z": "> @EagleTrib editorial notes the urgency of addressing housing needs to ensure the Commonwealth can support continued job growth.\n\nIn the Merrimack Valley last week, @MassLtGov spoke to local officials about the importance of our #HousingChoice bill. : http:// bit.ly/3874r3G", "2020-01-10T20:30:55.000Z": "In November, I joined legislators + higher ed leaders to sign a law clarifying + enhancing @MassDHE 's authority to monitor the financial health of Massachusetts' colleges + universities and protect students from sudden closures : http:// bit.ly/2CL3NuZ Quote Tweet MA Dept of Higher Ed @MassDHE Now: BHE members prepare to vote on regulations to protect students from sudden college closures. Feb: BHE votes on implementation, plan to work with accreditor on financial monitoring.", "2020-01-10T18:08:46.000Z": "Since taking office, our administration has prioritized making connections with local officials to ensure the Commonwealth remains a true partner to cities and towns. Thanks @MassLtGov for connecting with our colleagues in #MerrimackValley this morning. Quote Tweet Karyn Polito @MassLtGov Glad to join state + local officials and community leaders this morning in #Andover for the #MerrimackValley Mayors and Managers Forum.\n\nOur administration is grateful to our partners at the local level for their continued collaboration + partnership in the #MerrimackValley !", "2020-01-09T15:13:51.000Z": "Through @MassEOHED , our administration is leveraging #MassWorks funding to make important investments that help communities of all sizes move forward on priorities related to housing, transportation, and economic growth. Quote Tweet MA EOHED @MassEOHED This morning, Secretary Kennealy traveled to Hopedale to announce three #MassWorks small town assistance grants totaling $2.8 million for road and bridge improvements in Hopedale, Gosnold, and West Newbury. He was joined by @RyanFattman , @LennyMirra , and Representative Murray. Show this thread", "2020-01-08T22:39:45.000Z": "As former municipal leaders, @MassGovernor and I know firsthand the value of flexible grant programs like #MassWorks , which help communities make targeted enhancements and provide critical opportunities for economic development.\n\nCongratulations to today's award recipient! Quote Tweet MA EOHED @MassEOHED Sec. Kennealy was in @Framingham_MA this morning with @KarenSpilka , @CarmineLGentile , and @Mayor_Spicer to announce a $3.4M #MassWorks award that will alleviate congestion, improve road safety & empower the city to activate long vacant & underutilized properties. Show this thread", "2020-01-08T00:45:03.000Z": "\"I'd like to thank the Legislature for passing a landmark law that benefits communities across the Commonwealth. And I'd like to thank @MassGovernor for signing it at The English High School here in Boston.\" @Marty_Walsh  @BostonSchools  #SOTC2020", "2020-01-08T01:57:09.000Z": "Glad to have the chance to join @MassLtGov and other state + city leaders at at Mayor @marty_walsh 's State of the City address tonight. Our administration is grateful for the opportunity to partner with the @CityOfBoston to move Boston and our Commonwealth forward. #SOTC2020 Quote Tweet Mayor Marty Walsh @marty_walsh We believe in our young people. We believe in working people. We believe in our elders. We believe in our veterans and first responders. We believe in immigrants. We believe in second chances. We believe in each other. We believe in Boston. #SOTC2020  #BelieveInBoston", "2020-01-07T18:28:09.000Z": "This security funding for religious + community institutions sends a message that MA supports these organizations so they can carry out their work safely + open their doors to all. Thanks to legislators, faith leaders + advocates for joining us yesterday. State sets aside $1m for grants to help keep houses of worship safe - The Boston Globe Nonprofit groups may apply to the Commonwealth Nonprofit Safety Grant Program to receive state funds. bostonglobe.com", "2020-01-07T15:34:25.000Z": "Our comprehensive approach to addressing housing needs in the Commonwealth pairs our #HousingChoice legislation with tools in our #PartnershipsForGrowth economic development plan to spur smart, community-driven housing growth. Quote Tweet MA EOHED @MassEOHED Housing prices & production are statewide issues that can only be solved in partnership with municipalities & communities. #PartnershipsForGrowth prioritizes effective & actionable solutions to this crisis by acknowledging regional differences. #MAEconDev  http:// ow.ly/moUj30q7adR Show this thread GIF", "2020-01-06T21:36:43.000Z": "We are pleased to make these important Chapter 90 investments, which represent our continued commitment to supporting cities and towns across the Commonwealth as they address the maintenance and modernization of local infrastructure. Quote Tweet Mass. Transportation @MassDOT . @MassGovernor Baker @MassLtGov Polito Administration announce additional $20 million in FY20 for #MA Cities, Towns for local road construction, #transportation improvement projects: http:// ow.ly/qQXj30q7cXS", "2020-01-06T20:22:46.000Z": "Thank you to @MassGovernor  @KarenSpilka  @SpeakerDeLeo  @EricLesser  @RepRuthBalser  @SenMikeMoore and all of our legislative partners for recognizing and responding to the dire need for vital security enhancements for the Jewish community and other targeted communities.", "2020-01-06T20:46:44.000Z": "Massachusetts is a welcoming community that embraces people of all faiths, and it's important that people across the Commonwealth have the opportunity to come together with neighbors and worship without fear. PHOTOS: http:// bit.ly/37F724p", "2020-01-06T20:46:41.000Z": "Pleased today to join legislators, faith leaders and advocates to celebrate the enactment of $1M in security funding to help houses of worship and other nonprofit + community groups enhance their security against hate crimes and terrorist attacks. MORE: https:// bit.ly/35vSoee", "2020-01-06T17:07:01.000Z": ". @telegramdotcom highlights the great work done by recovery coaches in communities like #Webster .\n\nFollowing up on major opioid legislation, our health care reform bill would establish a framework for recovery coaches to continue their valuable work. Post-overdose programs in Worcester, Webster lead opioid addicts toward recovery The pain in the Rev. Richard Gonzalez's voice was evident last week as he spoke about a woman who had relapsed while staying in Worcester's triage center, a homeless shelter at 25 Queen St. The woman... telegram.com", "2020-01-06T16:24:02.000Z": "Massachusetts Open Enrollment is still happening now. If you need health insurance that starts February 1, the deadline to enroll is January 23. Get started today at http:// MAhealthconnector.org . #OE2020", "2020-01-05T14:40:00.000Z": "2020 marks the 400th anniversary of the founding of Plymouth. Check out all the events going on throughout the year. https:// plymouth400inc.org  @Plymouth_400", "2020-01-03T20:59:32.000Z": "This important legislation will provide additional resources to enhance the safety of MBTA infrastructure, improve local schools across the Commonwealth and support the testing for PFAS contamination in drinking water supplies.\n\nLearn more : Baker-Polito Administration Files $74.2 Million Budget Bill to Address Transportation, Infrastruc... The Baker-Polito Administration today filed a $74.2 million supplemental budget bill to address ongoing critical funding needs, including $18 million to support MBTA infrastructure and safety... mass.gov", "2020-01-03T20:59:31.000Z": "Pleased today to file a $74.2 million supplemental budget bill to address ongoing critical funding needs, including $18 million to support MBTA infrastructure and safety investments, $10 million for school improvements and $4.2 million for investments in clean drinking water.", "2020-01-02T18:04:43.000Z": "#BakerPolito2019 | Pursuing Broadband Connections:\n \nThrough the Last Mile program, our administration is completing important infrastructure work that's necessary to bring broadband to #WesternMA communities that don't currently have access to high-speed internet.", "2020-01-01T21:44:53.000Z": "#BakerPolito2019 | Income Tax Cut:\n \nFinally implementing the will of the voters, we announced in December that the income tax will drop to 5% effective TODAY, 1/1/2020.\n \nThanks to sound fiscal management + a strong economy, we have completed the statutory tax reduction process.", "2019-12-31T18:15:48.000Z": "#BakerPolito2019 | Advancing Housing Growth:\n \nWe refiled our #HousingChoice legislation and partnered with advocates, local officials + business leaders to promote the bill. We look forward to working collaboratively with our legislative colleagues on this issue in the new year.", "2019-12-30T13:55:37.000Z": "The power outage tool is a great resource on a day like today. Find it here: http:// mema.mapsonline.net/public.html  #MAready  #MAsnow  #WinterWeather", "2019-12-30T14:17:11.000Z": "#BakerPolito2019 | Addressing #ClimateChange , Building Resiliency:\n\nThrough the Municipal Vulnerability Preparedness program, we are delivering grants like a $1M award for Milbury from July. Our #ResilientMA bill would provide a sustainable funding source for future investments.", "2019-12-30T11:08:06.000Z": "#MAtraffic : 750 #MAsnow crews at 6am are treating state roadways for any icy pavements. Check conditions and #TakeItSlow as necessary today.", "2019-12-30T11:40:29.000Z": "MA State EOC activated at 0500 to monitor storm and associated impacts. The Western Regional EOC in Agawam is also activated to support communities with greatest potential for significant ice accretion. #MAReady  #MAsnow  #WinterStorm", "2019-12-29T20:17:51.000Z": "#MAtraffic : Check expected #Winter conditions, plan ahead before you travel tonight, Monday. #MAsnow crews will pretreat roadways as necessary. http:// blog.mass.gov/transportation /massdot-highway/massdot-winter-travel-advisory/ ", "2019-12-29T16:50:43.000Z": "Icing begins in western MA this evening and will move east. @NWSBoston 's animation can help motorists know when to be safely off the roads. #MAwx  #WinterStorm Quote Tweet NWS Boston @NWSBoston [1130 AM] Here's an animation showing how the upcoming #winter storm may unfold. Most prolonged & significant ice accretion in the Berkshires East Slopes & north-central MA, mainly from tonight through tomorrow evening. Be sure to stay updated with the forecast. #MAwx  #CTwx  #RIwx GIF", "2019-12-29T16:13:41.000Z": "#BakerPolito2019 | Transportation Bond Bill:\n\nIn July, we filed our $18 billion transportation bond bill that would give the Commonwealth more tools to build and modernize a transportation system that meets the needs of residents, businesses and cities and towns statewide.", "2019-12-29T09:32:56.000Z": "[Winter Weather Update] #Ice Storm Warning (greater than 0.50 inches ice accretion) for western #MA . Significant icing for northern #Worcester county too. Power outages possible higher terrain. Sleet/ice pellets & freezing rain arrive this evening in #CT  #RI & MA, continuing Mon", "2019-12-27T22:08:48.000Z": "#BakerPolito2019 | Landmark Education Reform: @MassLtGov and I joined a broad coalition of stakeholders to sign education finance reform that boosts investments in our schools + includes accountability measures to support students in every community. : https:// youtu.be/FBf1CDLjLsM", "2019-12-26T22:54:19.000Z": "#BakerPolito2019 | Comprehensive Health Care Bill:\n\nThis fall, we introduced wide-ranging legislation to improve outcomes for patients, increase access to care and bring down costs. The bill would prioritize primary and behavioral care, support community health centers and more.", "2019-12-25T14:13:42.000Z": "From our families to yours, wishing you a Merry #Christmas !", "2019-12-23T16:52:45.000Z": "#BakerPolito2019 | Advancing Affordable + Workforce Housing:\n\nOur administration took a number of steps to advance access to quality, affordable housing. Over the summer, we recapitalized the Workforce Housing Initiative and announced the 2019 Affordable Rental Housing Awards.", "2019-12-22T22:54:31.000Z": "Wishing all who celebrate a happy #Hanukkah !", "2019-12-22T18:28:43.000Z": "#BakerPolito2019 | South Coast Rail Breaks Ground:\n \nIn July, we marked a key milestone as South Coast Rail officially broke ground. We are proud to advance this project further than it's ever been as part of our administration's $8 billion MBTA infrastructure investment plan.", "2019-12-20T20:47:55.000Z": "As 2019 comes to a close, we're looking back with #BakerPolito2019 First up: Sustaining MA's #CleanEnergy Leadership:\n\nIn October, a new project was selected to advance more wind energy, and we visited the nation's first #offshorewind crew transfer training facility in Bourne.", "2019-12-19T19:56:01.000Z": "In the latest #CornerOfficeConnect : Landmark education reform signed An income tax cut implements voters' will  #MassWorks awards support community-driven growth Spotlighting health care bill's focus on behavioral care\n\n...and more. READ: http:// bit.ly/34FpMz1", "2019-12-18T21:00:26.000Z": "An arctic blast is coming our way. Be prepared: Follow us and @MBTA_CR on Twitter Subscribe to T-Alerts at http:// mbta.com/signup  Visit http:// mbta.com/winter for a Winter Travel Guide \n\nAs always, stay safe & look out for your fellow riders. #MAsnow", "2019-12-18T21:54:50.000Z": "[4:50pm Special Weather Statement] A snow squall is going to impact Northern #RI and much of Bristol County, #MA in the next hour. Heavy snow rates can result in  very poor visibility. Consider delaying travel until the #snow squall passes. Use extreme caution if driving.", "2019-12-18T21:15:49.000Z": ". @HarvardSNHC was a great place to highlight key parts of our health care bill that: Prioritize behavioral health care Boost support for community health centers Enable clinicians like nurse practitioners to do more for patients via @DotNews : http:// bit.ly/36Pjr5r", "2019-12-18T19:52:44.000Z": "\"Talent is evenly distributed. What's not evenly distributed is opportunity.\" Last month, I signed major education finance reform that includes important new resources + accountability measures, a major step toward ensuring students across MA have the opportunity to succeed.", "2019-12-18T18:32:12.000Z": "The Emergency Management Program is a key framework that guides the Commonwealth's preparation, recovery + response efforts for hazards of all types. Thanks @MassEMA for working to make MA more resilient + meeting the high standards for this accreditation. Quote Tweet MEMA @MassEMA Massachusetts' Emergency Management Program has received full reaccreditation by the Emergency Management Accreditation Program (EMAP), signifying that the Commonwealth's Program, led by MEMA, meets or exceeds national standards for emergency management. http:// bit.ly/2s2IIdw", "2019-12-17T23:16:29.000Z": "> @MassEOHED Sec. Kennealy today connected with communities in Western MA to celebrate #MassWorks grants that will advance infrastructure improvements + unlock new development.\n\nThis flexible program enables us to facilitate growth across the Commonwealth. Quote Tweet MA EOHED @MassEOHED #MassWorks brings us to snowy #WMass today. Secretary Kennealy is in Franklin County delivering a $2.1M grant to Montague. Bridge restoration, pedestrian upgrades, and water & sewer connections will facilitate development at old mills in the Turner Falls Canal District. Show this thread", "2019-12-17T22:02:17.000Z": "Glad to spend time earlier today at a ribbon cutting celebrating @communityserv 's renovation and expansion, which will enable this organization to augment its crucial work of providing medically tailored meals for people with complex medical needs. Quote Tweet Mayor Marty Walsh @marty_walsh . @communityserv does incredible work and is a helping hand and beacon of hope during the most difficult time in people's lives. Their expansion will allow both volunteer programs and job training programs to grow, representing Boston's values & what we stand for. Congratulations!", "2019-12-17T20:42:30.000Z": "By prioritizing investments in primary + behavioral health care services and better supporting the great work done by community health centers, we can ensure the health care system meets the challenges of the future. : http:// bit.ly/2Eu3VQo  : http:// bit.ly/2S37gh6", "2019-12-17T20:42:18.000Z": "The health care legislation we filed this fall will help address an evolving patient population + challenges in the health care system.\n\nGreat to spotlight the bill's focus on access to behavioral health + support for community health centers today at @HarvardSNHC in Dorchester.", "2019-12-17T15:12:01.000Z": "#MAsnow crews now total 1,400 treating, clearing state roads. Roads are wet to slush, snow covered and icy some locations. Travel with caution.", "2019-12-16T22:41:25.000Z": "The Bartlett Station and Nawn Factory projects will create true community by providing much needed housing across all incomes and by restoring one of Roxbury's historic sites. We are pleased to contribute to our capital city's continued growth. : http:// bit.ly/35o3Olb", "2019-12-16T22:41:24.000Z": ". @MassLtGov , @MassEOHED and I were glad to join Mayor @marty_walsh and other leaders to celebrate two #MassWorks grants for the @CityOfBoston totaling $3.7 million.\n\nThe grants will support development at Roxbury's Bartlett Station and Dudley Square's Owen Nawn Factory site.", "2019-12-16T18:50:16.000Z": "Thanks @MassGovernor for your kind words of respect and thanks to all our Performance Award recipients. #publicservice  #leadership", "2019-12-13T22:25:50.000Z": "Over the past five years, MA has achieved enviable growth, and our new economic development plan lays out a strategy for addressing opportunities + challenges around housing, business and workforce.\n\nThanks to our planning council for their input and work. Quote Tweet Karyn Polito @MassLtGov Proud to join @MassGovernor , @MassEOHED , legislators and members of the Economic Development Planning Council this afternoon to sign the Commonwealth's economic development plan, \"Partnerships for Growth: A plan to enable the Commonwealth's regions to build, connect and lead.\" Show this thread", "2019-12-13T19:29:07.000Z": "Starting in January, the income tax rate will be the lowest it has been in decades, allowing MA taxpayers to keep more of their hard-earned money.\n\nWith this reduction, the statutory income tax lowering process is completed, as we return $88 million to the taxpayers in FY 2020.", "2019-12-13T17:11:12.000Z": "Our hearts today are with the Frates family as we remember Pete and the incredible impact he had on so many. Quote Tweet Boston 25 News @boston25 With garments from @stjohnsprep and @BostonCollege draped over his casket, Pete Frates' former teammates carry him into the St. Ignatius of Loyola Parrish where his family and friends will say their final goodbyes to the hero. http:// boston25.com/2PFyfMZ  #boston25  #PeteFrates", "2019-12-12T19:29:59.000Z": "Massachusetts is thrilled to welcome the 111th #NAACPNationalConvention to Boston next year. We are proud that the @NAACP 's Boston branch has a long history of championing equality and are grateful to be able to partner with you on a wide range of issues. Quote Tweet NAACP @NAACP We are excited to announce that the 111th #NAACPNationalConvention will be held in the great city of #Boston . #2020", "2019-12-12T15:15:35.000Z": ". @MassLtGov , @EEASecretary , @Steph_Pollack and I were grateful for the chance to connect with business leaders on the Transportation Climate Initiative, a bipartisan, multi-state approach to reducing emissions + investing in a cleaner transportation system Baker talks up his transportation-funding approach - CommonWealth Magazine GOV. CHARLIE BAKER on Wednesday outlined for the business community a proposal to address climate change and raise money for transportation in a way that he believes is far superior to other tax and... commonwealthmagazine.org", "2019-12-11T21:14:04.000Z": "We're pleased to see this vacant site transformed into a housing community, green space and a public harborwalk, and our administration is proud to be a partner through two critical infrastructure grants. MORE via @MassEOHED : http:// bit.ly/2rsJXCQ", "2019-12-11T21:13:53.000Z": "This morning, it was great to join local officials, legislators and other stakeholders to break ground on Breakwater, a 331-unit apartment community to be built on #Lynn 's North Harbor and celebrate the years-long work of the Lynn Economic Advancement and Development (LEAD) team.", "2019-12-11T19:18:05.000Z": "Public Health Council Approves Regulations Restricting Access to Vaping and Tobacco Products: http:// ow.ly/yj9u50xxK01", "2019-12-10T20:33:15.000Z": "These grants will help departments purchase critical gear to support firefighters as they put themselves in harm's way. Helping to protect them from the physical and occupational hazards of the job is a key way we can show our appreciation for the service of our first responders.", "2019-12-10T20:33:13.000Z": "Glad to be in #Marlborough today to announce $920,000 in grant awards to 174 Massachusetts fire departments for gear and equipment that will reduce firefighters' exposure to cancer-causing chemicals on the job. MORE via @EOPSS : http:// bit.ly/2RCH8JW", "2019-12-10T18:22:39.000Z": "This project, driven by @HolyokeCity housing + development leaders, will result in 66 rental units and 24 home ownership opportunities, in line with our goal to prioritize housing projects as part of this year's #MassWorks rounds. via @MassEOHED : http:// bit.ly/35aNzHU", "2019-12-10T18:22:38.000Z": "As one of our most flexible economic development tools, #MassWorks enables us to spur community-driven growth in coordination with other programming.\n\nPleased to be able to pair Urban Agenda funding with #Holyoke 's MassWorks award to support new housing around Carlos Vega Park.", "2019-12-10T16:24:16.000Z": "VIDEO: @MassLtGov + I joined a broad coalition including @marty_walsh , @KarenSpilka , @SpeakerDeLeo , @SenJasonLewis , @RepAlicePeisch , educators + terrific @TheEnglishHS students to sign education reform including new resources + accountability measures to support all our schools", "2019-12-09T19:07:15.000Z": ". @PeteFrates3 was one the most courageous and inspirational people I have ever met.  He and his family changed the world for ALS patients & their families. Rest In Peace Pete. You earned it. #alschampion", "2019-12-05T21:19:04.000Z": "During today's ceremony, we also announced a new #MassWorks grant for Brockton for new roadways and streetscape improvements. The project will support planned housing and future mixed-use development in downtown Brockton. via @MassEOHED : http:// bit.ly/33MPEsg", "2019-12-05T21:19:00.000Z": "This year's #Brockton  #MassWorks award gave us an opportunity to highlight a previously-funded project that resulted in a new parking facility, which was dedicated today in honor of the late Mayor Bill Carpenter. \n\nGrateful for the chance to honor Mayor Carpenter's legacy today.", "2019-12-05T16:28:33.000Z": "With our comprehensive health care bill, our administration is prioritizing investments in primary + behavioral care services.\n\nGreat to address primary care clinicians earlier at @PriMedCME 's #PriMedEast conference about our bill + ongoing efforts to combat the addiction crisis.", "2019-12-04T23:25:45.000Z": "Each year, it's an honor for First Lady Lauren Baker and I to join several Massachusetts Gold Star families for the annual Gold Star Tree dedication. This ceremony reminds us that as we celebrate this holiday season, we must recognize + remember our fallen heroes + their families", "2019-12-04T19:39:11.000Z": "This #MassWorks round put particular emphasis on housing production, and we are proud to partner with @SomervilleCity and their partners to address both local and statewide housing challenges through the creation of housing for residents across all income levels.", "2019-12-04T19:39:10.000Z": "Glad to be with legislators, local officials + community partners at Somerville City Hall earlier to announce a $4.4 million #MassWorks grant supporting the redevelopment of the Clarendon Hill complex + construction of new housing units. via @MassEOHED : http:// bit.ly/2rU5W5h", "2019-12-04T18:54:37.000Z": "Great to join the team at @WBZ to kick off the season at the Faneuil Hall Christmas tree lighting last night! Quote Tweet WBZ | CBS Boston News @wbz Christmas Tree Lighting Kicks Off Holiday Season At Faneuil Hall https:// boston.cbslocal.com/2019/12/03/chr istmas-tree-lighting-faneuil-hall-boston/ ", "2019-12-04T17:58:32.000Z": "Yesterday, public safety leaders from our administration testified on our legislation to strengthen penalties for child predators and reform the civil commitment process for sex offenders. via @salemnews : http:// bit.ly/2PcR5Lh  MORE on the bill: Governor Baker Re-Files Legislation to Increase Penalties for Child Predators Today, Governor Charlie Baker re-filed legislation to strengthen penalties for child predators and reform the civil commitment process for sex offenders. First filed in June 2018, the legislation... mass.gov", "2019-12-03T22:01:45.000Z": "ICYMI: Last week, @MassLtGov and I joined a broad coalition of legislators, local officials, advocates, business leaders, and the terrific students at @TheEnglishHS to sign legislation reforming education finance and investing in local schools. PHOTOS: http:// bit.ly/2YaNykM", "2019-12-03T20:44:46.000Z": "Pleased to join local law enforcement officials and public safety advocates this afternoon to testify before the Joint Committee on the Judiciary in support of our administration's legislation, An Act Relative to the Harmful Distribution of Sexually Explicit Visual Materials.", "2019-12-03T11:00:53.000Z": "Drivers are encouraged to stay off the road if they can.\n\nIf you must travel during #MAsnow today, clear snow off your vehicle, maintain a safe distance, take it slow, give yourself extra time & #DontCrowdThePlow . \n\nSafe Winter Driving Tips: http:// bit.ly/2hlV7Ql", "2019-12-03T04:17:21.000Z": "Due to the current weather situation, we are announcing a 10:00AM delayed start time on Tuesday, Dec. 3 for all non-emergency state executive branch employees.\n\nAs crews continue to respond overnight, we encourage everyone to plan ahead + use public transportation where possible.", "2019-12-02T23:38:58.000Z": "During periods of heavy snowfall, people should avoid driving if they can. For those commuting in eastern MA tomorrow, build in extra time + consider public transportation.\n\nCrews from @MassDOT and the @MBTA will be out throughout the night to clear roads, sidewalks + platforms.", "2019-12-02T23:38:56.000Z": "Joined @MassDOT Highway Administrator Jonathan Gulliver, @MBTA GM @spoftak and @MassEMA Director Samantha Phillips for an update on the winter weather expected to continue into tonight and tomorrow, and our response to its impacts across the transportation system. #MAsnow", "2019-12-02T17:52:27.000Z": "This project will support continued growth in key districts of Lynn that have seen impressive housing and retail development in recent years, and will serve as a catalyst for future mixed-use projects near the city's waterfront, downtown and public transportation.", "2019-12-02T17:52:25.000Z": "This year's #MassWorks awards are underway, and it was great to be at #Lynn City Hall today to announce a $1.6 million grant for the reconstruction of Washington St.\n\nProud to build on our previous partnerships with the city to support future growth. : http:// bit.ly/2RbBuOE", "2019-12-02T11:00:48.000Z": "If you must travel during #MAsnow today, clear snow off your vehicle, maintain a safe distance, take it slow, give yourself extra time & #DontCrowdThePlow . \n\nSafe Winter Driving Tips: http:// bit.ly/2hlV7Ql", "2019-12-01T23:08:57.000Z": ". @MassGovernor Baker with @MassLtGov Polito, Secretary Pollack, @MBTA GM Poftak at Highway Operations Center. Governor says allow extra time for Monday commute. #MAsnow", "2019-12-01T20:28:04.000Z": "[Snow Accum Forecast] Accumulating snow will come in 2 parts. First part through just after midnight tonight, heaviest N of the Pike; Second part Mon night/Tue AM, heaviest eastern MA. This is total accum into Tue morning", "2019-12-01T14:21:54.000Z": "Heading home after Thanksgiving? @MassGovernor Charlie Baker told @NickGNews and @AnnaMeiler that drivers should get home and off the roads early before the snow arrives this afternoon. Gov. Baker Urges Drivers To Get Home Before Snow Arrives Massachusetts Gov. Charlie Baker joined WBZ-TV to discuss preparations for a major winter storm. boston.cbslocal.com", "2019-12-01T13:50:56.000Z": "@MassGovernor Charlie Baker called in and talked about how the state is preparing the roads and public transportation for the impending #snowstorm that will dump up to a foot of snow in Central and Western Massachusetts. Second round of snow moving through, hundreds of schools canceled A burst of heavy snow is blanketing Massachusetts with significant impacts to the Tuesday morning commute. boston25news.com", "2019-11-30T16:14:43.000Z": "With significant winter weather expected starting Sunday, please follow travel advisories and adjust plans to allow yourself time to get home safely. #MAsnow Follow @MassDOT and @MassEMA for updates. Quote Tweet Mass. Transportation @MassDOT #MAtraffic : @MassDOT  #MAsnow crews ready. Highway Administrator Gulliver: \"We encourage motorists traveling home from the #Thanksgiving holiday to leave early and leave enough time to safely get to their destination.\" http:// blog.mass.gov/transportation /massdot-highway/massdot-weekend-travel-advisory/ ", "2019-11-28T14:39:58.000Z": "Wishing everyone across the Commonwealth a very happy #Thanksgiving !", "2019-11-27T19:49:18.000Z": "Great to spend time at Friends of Metro Boston's annual Thanksgiving Dinner in partnership with @MassDMH , serving hundreds of DMH clients here at Florian Hall. Thanks to @BostonFire members for volunteering their time to support this terrific event.", "2019-11-27T18:45:25.000Z": "Today, as we sign legislation implementing new restrictions on vaping and tobacco products passed by our legislative colleagues, we are also keeping our temporary ban in place as @MassDPH develops permanent regulations in this area. MORE: https:// bit.ly/33lRYWN", "2019-11-27T18:43:48.000Z": "In light of the growing health crisis associated with vaping, our administration implemented a temporary ban on the sale of vaping products to provide time for legislative and regulatory bodies to better understand what's making people sick and act to protect the public health. Quote Tweet Mass. HHS @MassHHS Today @MassGovernor signed An Act Modernizing Tobacco Control into law, which promotes public health by restricting the sale of nicotine vaping products and flavored tobacco products. The ban on the sale of vaping devices remains in effect until December 11. Show this thread", "2019-11-26T19:44:53.000Z": "This funding builds on the over half a billion dollars in new Chapter 70 funding our administration has supported since 2015. We thank our legislative partners for their hard work and we look forward to implementing this legislation for every child in every school district in MA.", "2019-11-26T19:44:51.000Z": "Pleased today to sign legislation aimed at providing students across the Commonwealth with the opportunities and resources they need to succeed including accountability measures that are essential to supporting under-performing schools. MORE: http:// bit.ly/34nyfrj", "2019-11-26T17:32:44.000Z": "An honor to recognize firefighters from communities across the Commonwealth at the Firefighter of the Year Award Ceremony. This year's event was especially poignant with tributes to fallen heroes like @WorcesterFD 's Christopher Roy + Jason Menard. @MassDFS Quote Tweet Rep. Tim Whelan @TRWhelan With @MassGovernor and @MassLtGov , and a number of my colleagues in elective office, at the 30th annual Fire Fighter of the Year Awards this morning In @TweetWorcester honoring one of the Commonwealth's bravest.  Stay safe.", "2019-11-26T15:31:35.000Z": "Glad to have joined so many passionate advocates and families yesterday to sign legislation that will make a meaningful difference in making Commonwealth's network of roads safe for all users. A @salemnews editorial speaks to the importance of this law: http:// bit.ly/2KXCVMJ", "2019-11-26T00:08:25.000Z": "via @WCVB : This weekend, track + station upgrades continued on the Red Line, part of the @MBTA 's weekend diversion program, enabling more work to get done faster.\n\nOur visit this weekend spotlighted that progress, part of our $8 billion capital plan. : Gov. Baker on MBTA shutdowns: 'This would would be really hard to... MBTA weekend construction has been a huge inconvenince to riders, but Governor Baker says there is too much work to do to improve reliability and safety to w... youtube.com", "2019-11-25T22:55:34.000Z": "As we continue the long-term work to address the opioid epidemic, we are gratified to see reductions in overdose deaths.\n\nThere's much more left to do, but we remain committed to working with all stakeholders to make progress in addressing this crisis. Quote Tweet Mass. Public Health @MassDPH Massachusetts opioid-related overdose deaths fall 6 percent in the first nine months of 2019 compared to 2018: http:// ow.ly/6LbZ50xk9n9", "2019-11-25T21:53:00.000Z": "This bill is a major step in our ongoing work to keep the our roads safe.\n\nWe are especially grateful for the many advocates and families who passionately fought for this bill. We look forward to working with our legislative colleagues to make more progress in this area soon.", "2019-11-25T21:52:57.000Z": "An honor to join with so many families, advocates, law enforcement leaders and legislators as I signed important legislation stipulating that no motor vehicle operator may use electronic devices while driving unless the technology is used hands-free. : http:// bit.ly/34oIBqM", "2019-11-23T19:51:00.000Z": "Today @MassGovernor Baker & MBTA GM @SPoftak went to Downtown Crossing to observe Red Line diversion work progress. Thanks to these weekend closures, work at Downtown Crossing and Park St will be completed 11 & 4 months earlier than planned respectively. http:// mbta.com/RLWork Quote Tweet Charlie Baker @MassGovernor Spotlighting Red Line work on the 2nd of 4 weekend diversions this fall. At Downtown Crossing, crews have more time to complete track work + station upgrades. These necessary diversions, combined with our $8 billion capital plan allow the @MBTA to work quickly to improve service.", "2019-11-23T19:49:30.000Z": "Always great to spend time with the kids + volunteers involved with the No Books No Ball program, which makes a big difference in the lives of so many young people. Glad to be part of the annual turkey giveaway here at Orchard Gardens School, supporting over 1500 families in need", "2019-11-23T18:44:00.000Z": "Spotlighting Red Line work on the 2nd of 4 weekend diversions this fall. At Downtown Crossing, crews have more time to complete track work + station upgrades. These necessary diversions, combined with our $8 billion capital plan allow the @MBTA to work quickly to improve service.", "2019-11-21T18:00:10.000Z": "Can we get a retweet? We're hoping to reach 100,000 followers by the end of the year & we're only 300 followers away.\n\nWe use @Twitter to provide info before, during, and after emergencies & disasters and is one of the many ways we provide important information. #SMEM", "2019-11-22T15:28:49.000Z": "Great to see @MassHHS + @Mass_DCF join First Lady Lauren Baker to celebrate #NationalAdoptionDay in #Worcester ! Through these agencies, our administration is committed to working with a variety of partners to support vulnerable children + promote adoption. Quote Tweet Mass. HHS @MassHHS 2019 marks the 17th National Adoption Day celebrated in Massachusetts, and it is being recognized in six courts across the Commonwealth. Special thanks to First Lady Lauren Baker for joining us in #Worcester for #nationaladoptionday !", "2019-11-21T21:54:10.000Z": "Honored to swear in @MassStatePolice 's next Colonel and Superintendent, Col. Christopher Mason, who continues an impressive career serving + protecting the Commonwealth's communities.\n\nOur administration looks forward to his work to build on ongoing efforts to improve the agency.", "2019-11-21T19:15:05.000Z": "Today we join @MassGovernor & @MassLtGov to announce GE Foundation's $2.5 million grant to provide job training in advanced manufacturing to high school students & adults on the #MA North Shore. Together we'll work to close the manufacturing skills gap. https:// bit.ly/35lbvIq", "2019-11-21T19:00:00.000Z": "Today, November 21, is World Pancreatic Cancer Day.  I hope you'll join @MassLtGov and I in wearing purple today to show support and raise awareness @PanCANBoston  @ACSCANMA  #WPCD  #InItTogether  #WageHope  #DemandBetter  #PANCaware", "2019-11-21T18:31:55.000Z": "Our administration has made expanding workforce training and career education a priority through the efforts of our Workforce Skills Cabinet and we are pleased our $2M investment in Lynn Tech is amplified by a complementary $2.5M from @GE_Foundation . : http:// bit.ly/2s68pd4", "2019-11-21T18:31:49.000Z": "Great to join federal, state + local partners at Lynn Tech to announce a shared investment between our administration and @GE_Foundation to support the creation of an advanced manufacturing training program to help close the skills gap + fill workforce needs on the #NorthShore .", "2019-11-20T20:44:32.000Z": "@MassGovernor , @MassDEP award $2M in grants for the installation of 195 #ElectricVehicle charging stations that will provide #EV charging access to the motoring public across the Commonwealth Baker-Polito Administration Awards $2 Million in Grants to Support Public Access Charging for... Baker-Polito Administration Awards $2 Million in Grants to Support Public Access Charging for Electric Vehicles mass.gov", "2019-11-20T16:43:12.000Z": "Last week, I joined higher ed leaders, legislators +  advocates to sign legislation strengthening financial oversight of the Commonwealth's higher education institutions + protecting students from sudden closures via @usnews : http:// bit.ly/2CZPIKd  : http:// bit.ly/2XvwVQt", "2019-11-19T17:04:55.000Z": "Thrilled to announce $1.2M in #MassWorks Infrastructure Program grant funding to support the Town of Truro's Cloverleaf Public Water + Infrastructure Project, which will provide water service to a future housing development to address the community's need for affordable housing.", "2019-11-18T18:39:24.000Z": "Today, @MassLtGov + I join the Menard family, the @WorcesterFD team and the #Worcester community in mourning the loss of Lt. Jason Menard in last week's fire.\n\nWe are ever mindful that first responders put their lives on the line to protect us every day. Quote Tweet telegramdotcom @telegramdotcom Photos: Funeral of #Worcester fire Lt. Jason Menard https:// buff.ly/2qoyjbs  @ChrisPetersonTG  @agreenphotog  @RickCinclair  @WorcesterFD", "2019-11-18T17:35:11.000Z": "The @MBTA 's historic investments through our $8 billion 5-year capital plan continued this weekend on the Red Line, with the first of several planned weekend diversions to give crews time + space to complete major upgrades for stations + tracks. Quote Tweet MBTA @MBTA Over the weekend was the first Red Line shutdown for acceleration work. We replaced 460 ft of track at Downtown Crossing for safer operations & more reliable service, and completed station renewal work at Park St & South Station.\n\nVisit: http:// mbta.com/RLwork  #BuildingABetterT Show this thread", "2019-11-18T15:14:32.000Z": "From last week: @MassHHS Sec. @MLSudders talked with @bloombergbaybiz about our comprehensive health care legislation that seeks to address key challenges in the system around cost, access and patient outcomes. MORE on the bill: http:// bit.ly/2pAVu1C Quote Tweet Mass. HHS @MassHHS Secretary @MLSudders joined @bloombergbaybiz to discuss the Baker-Polito administration's health care bill that would improve outcomes for patients, increase access to behavioral health and primary care services, and bring down costs. Listen here: http:// ow.ly/X7Pd30pTy96", "2019-11-15T20:13:54.000Z": "ICYMI, via @BostonGlobe : On Monday of this week, we honored #VeteransDay at the State House by reflecting on the sacrifice of our servicemen and women, and our enduring commitment to doing all we can to meet their needs when they return home. Governor Baker urges public to honor veterans for their sacrifice and bravery - The Boston Globe \"There is no democracy without the sacrifice of our servicemen and women and their families,\" Baker told spectators in his Veterans Day address at a State House ceremony. bostonglobe.com", "2019-11-14T21:29:22.000Z": "It was great to be with so many engaged students, along with businesses + trade organizations at the MA #GirlsInTrades Career Fair yesterday. @MassLtGov continues to lead our efforts to expand #STEM pathways for women + girls. : http:// bit.ly/2Ql9R5e  https:// twitter.com/MassLWD/status /1195057470164684800  Quote Tweet MassLWD @MassLWD Grateful for all the support that @MassGovernor and @MassLtGov gave to the Girls In Trade event hosted by @IBEW103 and dedicated to increasing access to these great paying jobs #NAW2019  https:// bit.ly/2qVZr1y", "2019-11-14T20:46:58.000Z": "Update: a hard frost has now occurred in all communities across the state. People are no longer at risk of mosquito-borne illness in #Massachusetts in 2019. More info: http:// ow.ly/nd4Y50xbiqj  #EEE  #WNV", "2019-11-14T20:14:19.000Z": "Deeply saddened by reports of a horrific school shooting in Santa Clarita, resulting in a tragic loss of life and multiple injuries. Grateful for law enforcement's work to apprehend a suspect.\n\nMassachusetts joins the nation in mourning the victims and praying for their families.", "2019-11-14T15:19:46.000Z": "We are very pleased to have worked alongside the Legislature to sign this important bill into law that will protect students and families, while also guaranteeing those institutions confidentiality as @MassDHE works with them to understand their financial status.", "2019-11-14T15:19:45.000Z": "Pleased today to sign legislation that will clarify and enhance the Board of Higher Education's authority to monitor the financial health of Massachusetts' colleges and universities and protect students and families from sudden college closures. : http:// bit.ly/2CL3NuZ", "2019-11-14T11:00:00.000Z": "With the 2019 Orange Line core diversions now complete, and weekend shutdowns on the Red Line beginning Friday evening, we wanted to give our riders an update on what has been accomplished and what to expect as we continue #BuildingABetterT", "2019-11-13T23:16:59.000Z": "#USMCA represents a significant opportunity for Massachusetts and states across the nation to engage and prosper in international trade while continuing our longstanding partnerships with Canada and Mexico. Glad to support this commonsense agreement. Quote Tweet Governor Larry Hogan @GovLarryHogan By creating jobs, strengthening economic ties, and establishing a more level playing field for American workers and businesses, strategic trade agreements like the USMCA are essential to ensuring future prosperity for the State of Maryland and for our nation. #USMCAnow", "2019-11-13T19:26:23.000Z": "Great to join students, businesses and trades organizations from across the state in #Dorchester at the Massachusetts #GirlsinTrades Conference + Career Fair to highlight our administration's commitment to engaging women + girls in opportunities for #STEM education and careers.", "2019-11-13T19:40:06.000Z": "#BurnsBridge in #Worcester  #Shrewsbury and #ZakimBridge will shine Red tonight, November 13th, for @WorcesterFD Lt. Jason Menard.", "2019-11-13T16:50:44.000Z": "Drawing on his years of experience, we are confident Colonel Mason will lay out a vision for the Department's future that will bring meaningful reform and restored public trust to the Commonwealth. : http:// bit.ly/2O4suaY", "2019-11-13T16:50:42.000Z": "At a pivotal time for the @MassStatePolice , Chris Mason has the experience and vision to lead the Department forward with reforms and innovation.\n \nWe are grateful for the changes put in motion under Col. Gilpin, and support Col. Mason as he completes these critical reforms.", "2019-11-13T13:48:24.000Z": "Lt. Menard was not only a dedicated member of @WorcesterFD , but a husband and father of three. Our hearts break for his family, loved ones and the entire community. Fire Lt. Jason Menard mourned in Worcester WORCESTER - Lt. Jason Menard became the ninth Worcester firefighter in two decades to die in the line of duty, losing his life while battling a blaze on Stockholm Street early Wednesday morning. The... telegram.com", "2019-11-13T13:48:23.000Z": "This morning, I'm deeply saddened to learn of the tragic passing of Worcester Fire Lt. Jason Menard, who lost his life battling last night's fire on Stockholm Street, and the injury of 3 other brave firefighters.", "2019-11-12T22:59:59.000Z": "We're always mindful of military families' service, especially this week\n\nPleased to file legislation today to ensure military spouses are not denied unemployment benefits because of a relocation, along with other important changes to the UI system : http:// bit.ly/36ZM8xv", "2019-11-12T20:40:51.000Z": "Happy 244th Birthday to the @USMC ! Honored to attend this year's Marine Corps Birthday Luncheon to celebrate the Corps' history and to honor the sacrifice of those who have served throughout the years. Grateful to join leaders including @secnav76 for today's event.", "2019-11-11T15:36:03.000Z": "\"We don't get the chance to be a part of this great democracy...if not for the sacrifice of our servicemen and women.\"\n\nWe remain committed to building on our never-ending work to meet the needs of our returning heroes.", "2019-11-11T15:35:47.000Z": "Honored to take part in the Commonwealth's #VeteransDay ceremony organized by @MassDVS and to share a few thoughts about the importance of our enduring commitment to the heroes who have protected our nation. It's crucial that we're constantly reminded of the sacrifices they made.", "2019-11-10T11:51:29.000Z": "Founded on November 10, 1775 \n\nTo all who have earned the title of United States Marine, a very Happy Birthday! #SemperFidelis  #Marines  Bicentennial Park; Fall River, MA", "2019-11-08T21:45:35.000Z": "Pleased to join state, local + military officials today to announce $2.4M in Massachusetts Dredging Program grant funding to Gloucester for its Annisquam River Dredging Project, which will benefit public safety + regional maritime economy. : http:// bit.ly/2NWXlWX", "2019-11-08T16:57:21.000Z": "In this month's #CornerOfficeConnect : Health care legislation earns broad support  #MassSTEMWeek 2019 recap Sustaining MA's #offshorewind leadership  @MBTA advances upgrades for key infrastructure Investing in school safety resources READ: http:// bit.ly/36MqkW0", "2019-11-08T13:55:52.000Z": "\"I think one of the things we don't appreciate as much as we should is that the past 20 years this organization has been all about giving young woman and other women the chance to see it so they can be it.\" @MassGovernor Charlie Baker opening remarks at #TCITop100", "2019-11-07T21:14:22.000Z": "As the public safety landscape evolves amidst the implementation of adult use of marijuana, our impaired driving legislation would give law enforcement officers the tools they need to keep roads safe for communities + families. via @statehousenews : http:// bit.ly/2NpC9cU", "2019-11-07T20:09:59.000Z": "\"We clearly need to solve some of these gaps in care, coverage and service and if we do, I think the system will do a better job of serving the people of the Commonwealth.\"\n\nOur health care bill addresses key challenges in the system. AUDIO - @wgbhnews : http:// bit.ly/2PwnuhK", "2019-11-07T18:56:01.000Z": "In honor of Veterans Day, the Baker-Polito Administration will once again waive parking fees for all visitors on Monday, November 11, 2019 at all @MassDCR state parks. Interpretive programming will also be offered. For details: https:// bit.ly/33vMl9u  #VeteransDay", "2019-11-07T18:54:31.000Z": "VIDEO via @WCVB : A look inside the @MBTA 's new Red Line cars, currently at a test facility. These new cars, paired with our upgrades to infrastructure in our $8 billion investment plan, will boost reliability + capacity for riders. First tour of new MBTA Red Line cars The new Red Line cars are expected to enter service in spring 2020, after several months of testing. Subscribe to WCVB on YouTube now for more: http://bit.ly... youtube.com", "2019-11-07T16:25:16.000Z": "Having fun helping our community at #ChainOfGiving !  \n\nSpotted: @MattOMalley  @Mayor_Spicer  @MassTreasury  @MassLtGov  @MassGovernor  @marty_walsh  @AnnissaForBos  @MartyMartinez  @OceanSprayInc & many, many more!! #MApoli  #BOSpoli", "2019-11-07T16:23:01.000Z": "Thanks @Gr8BosFoodBank for the work you do to address hunger in our communities every single day, and congratulations on another successful #ChainOfGiving event. Quote Tweet The Greater Boston Food Bank @Gr8BosFoodBank It takes public-private partnerships to #EndHungerHere  @MassGovernor listens to @marty_walsh 's remarks at #ChainOfGiving  #MApoli  #BOSpoli", "2019-11-07T13:34:31.000Z": "Thanks @ncmchamber for having me in to talk about our administration's ongoing priorities around economic development, housing, transportation and more. Thanks @montytech for sponsoring this morning and for your partnership around investments in skill-building and STEM education.", "2019-11-06T19:08:04.000Z": "Through a variety of state entities, our administration is prioritizing the production of resilient and sustainable housing opportunities, to address the dual challenges of #climatechange and our housing crisis. Quote Tweet MACleanEnergyCenter @MassCEC Energy efficient #building design will be critical to helping the Commonwealth meet its #climate goals. Our own Steve Pike - \" #PassiveHouse is without a doubt the future of building design and that's what we're helping to demonstrate here at Old Colony.\"", "2019-11-05T22:54:14.000Z": "Our impaired driving legislation would strengthen the Commonwealth's laws to respond to the ongoing roll-out of the adult use of marijuana.\n\nToday, officials from our administration joined public safety leaders to testify on this crucial legislation. : http:// bit.ly/338FRNd", "2019-11-05T19:22:45.000Z": "HAPPENING NOW > Secretary Kennealy and @MassLtGov are testifying before the Joint Committee on Economic Development and Emerging Technologies on the #MAEconDev strategy and plan, \"Partnerships for Growth: A plan to enable the Commonwealth's regions to build, connect, and lead.\"", "2019-11-05T17:15:19.000Z": "Massachusetts continues to advance its national leadership in the emerging #offshorewind economy, as a hub for development and testing for crucial infrastructure. Quote Tweet MACleanEnergyCenter @MassCEC \"I'm thrilled to be here at @MassCEC ' Wind Technology Testing Center. This is like a movie, but we know it's real.\" @MassLtGov Karyn Polito. Only facility of its kind in North America that can provide needed testing for large scale #wind turbine blades.", "2019-11-05T01:21:53.000Z": "Secretary @MLSudders spoke to 800+ members of @GBinterfaith about how @MassGovernor 's health care legislation will support consumers by investing in primary care and behavioral health, reigning in drug costs, and reducing cost drivers. Get the details at http:// mass.gov/InvestingInVal ue ", "2019-11-04T17:59:14.000Z": "Thanks to the resources in our $8 billion capital investment plan, along with necessary time due to weekend diversions, @MBTA crews were able to make significant progress that will improve service, stations and accessibility for Orange Line riders. Quote Tweet MBTA @MBTA Over the weekend, we closed parts of the Orange Line to replace 427 ft of track at Haymarket & continue station renewal at Chinatown for safer, more reliable service. We also repaired fare gates, tunnels, & elevators.\n\nVisit http:// mbta.com/OLwork for details. #BuildingABetterT Show this thread", "2019-11-04T16:34:45.000Z": "ICYMI: The @HealthConnector began Open Enrollment last Friday, and rolled out new improvements that build on our administration's record of improving the agency's ability to facilitate access to insurance for the Commonwealth's individuals and families. Quote Tweet Massachusetts Health Connector @HealthConnector #PressRelease : Open Enrollment begins through Massachusetts Health Connector --> https:// bit.ly/2N5EycH", "2019-10-31T19:08:35.000Z": "THIS WEEK: A second major project was selected to provide 804MW of offshore wind to Massachusetts as part of the energy procurement authorized by energy diversity legislation signed in 2016. via @southcoasttoday : http:// bit.ly/2PBSZH4  via @MassEEA : http:// bit.ly/36ly1lS"}