{"2020-07-30T18:04:26.000Z": "The Big Sky State is vast and diverse, but it's also a small town with long roads. Montanans are in this together, and each of our actions have a direct result on others - no matter if we live in a county with 5 cases or 500. #MaskUpMT Montana seeks ways to slow spread in hot spots The state is working with local health officials to examine hot spots for the novel coronavirus in Montana and evaluate whether additional measures are necessary to slow the spread of helenair.com", "2020-07-30T15:38:12.000Z": "As William Perry Pendley continues to serve unlawfully as the Bureau of Land Management's acting director, Montana's public lands continue to be at risk of inadequate protection. New BLM plans designate Montana recreation areas, over state objections The U.S. Bureau of Land Management has approved several new Backcountry Conservation Areas, including three in the Missoula area, as part of its revised Resource Management Plans for large parts missoulian.com", "2020-07-30T00:22:59.000Z": "The rate of COVID-19 infection in younger Montanans, especially those 20-39 years old who are more likely to attend social gatherings, is drastically increasing. This virus can impact anyone and no matter our age, it's up to all of us to do our part to slow the spread.", "2020-07-30T00:21:54.000Z": "Today I am thankful to Caty, who shared her COVID-19 story with her fellow Montanans. Before COVID, Caty was a 23 year old in robust health. Three weeks into recovery, she continues to experience challenging symptoms. \n\nHer message: \"Please don't take this lightly.\"", "2020-07-29T20:22:04.000Z": "We are carefully reviewing the cases in these counties, and we will be working with local communities to determine what additional resources and measures they need to tackle their situations. We are a vast and diverse state, but we are still all in this together.", "2020-07-29T20:20:28.000Z": "We have nine counties in the state we consider hot spots, together comprising 80% of all cases reported in June and July. Those counties are: Flathead, Lake, Missoula, Lewis & Clark, Cascade, Madison, Gallatin, Yellowstone, and Big Horn.", "2020-07-29T17:44:26.000Z": "When you wear a mask, you protect more than yourself. You protect your community, your Main Street businesses, your local schools, and your most vulnerable neighbors. #MaskUpMT", "2020-07-28T20:28:55.000Z": "By masking up, social distancing, and staying home when you are sick, you play a critical role in helping Montana control COVID-19.", "2020-07-28T20:28:20.000Z": "With over 50 deaths in the state due to COVID-19, these losses weigh heavily on our hearts. While our seniors remain the most vulnerable, immunocompromised and even otherwise healthy Montanans experience life-altering - and sometimes deadly - outcomes when they face this virus.", "2020-07-28T16:40:27.000Z": "#MaskUpMT - because we're in this together, and if we do our part to keep each other safe, we can keep moving forward.", "2020-07-27T21:37:59.000Z": "Today I got to see where the science happens. Thank you to MSU for the tour of the lab, where we are gearing up to perform surveillance COVID-19 testing for our state. Your partnership is invaluable to Montana's fight against this virus.", "2020-07-27T17:16:45.000Z": "Large gatherings continue to spread COVID-19. As much as we all want to be with family and friends to celebrate life events, these decisions can have long reaching effects. Please protect your loved ones by taking the proper precautions, like social distancing and wearing a mask.", "2020-07-26T15:54:21.000Z": "Today we also honor the dedication and perseverance of self-advocates and their allies, without whom we would not have the ADA. This Act serves as a testament to the resiliency and persistence of these champions for equity, who inspire me every day to make Montana more inclusive. Quote Tweet Steve Bullock @GovernorBullock Everyone should be able to hold a job, attend school, ride the bus, and eat a meal in a restaurant. The #ADA , enacted 30 years ago today, was and is a crucial tool to ensure that Montanans with disabilities can enjoy being active members in their communities.", "2020-07-26T15:53:35.000Z": "Everyone should be able to hold a job, attend school, ride the bus, and eat a meal in a restaurant. The #ADA , enacted 30 years ago today, was and is a crucial tool to ensure that Montanans with disabilities can enjoy being active members in their communities.", "2020-07-25T18:26:54.000Z": "Across the state, Montanans are proving they value the health of their neighbors and the well-being of their communities by masking up. #MaskUpMT Businesses say most customers abiding by mask mandate Aside from a few hiccups, local businesses seem to be adjusting smoothly to Gov. Steve Bullock's mandate requiring face coverings in public places throughout the state. dailyinterlake.com", "2020-07-24T20:52:11.000Z": "Using a business adaptability grant, @BillingsDepot made modifications to ensure the safety of their employees, customers and community, and keep business running during COVID-19. Thanks for the visit! \n\nBusinesses can apply for this grant and others at http:// covidrelief.mt.gov .", "2020-07-24T15:58:47.000Z": "It was great to meet with business leaders in Billings yesterday and hear how the mask requirement is keeping businesses and their customers safe. I look forward to a continued partnership as we work to protect our small businesses. Yellowstone County Recovery Team and Governor Steve Bullock hold round table to discuss the... BILLINGS, Mt. - A round table was held today with the Yellowstone County Economic Recovery Team and Governor Steve Bullock to discuss what's happening within the Yellowstone County economy. kulr8.com", "2020-07-23T19:01:08.000Z": "On behalf of all Montanans, I would like to express gratitude to President Cruzado and @montanastate for stepping up to the plate to increase testing capacity in Montana. We will continue our fight against COVID-19 together.", "2020-07-23T14:22:32.000Z": "We're building long-term, sustainable solutions to testing right here at home in Montana. MSU to process coronavirus tests soon Montana State University will soon process tests for the novel coronavirus at a laboratory on its Bozeman campus. helenair.com", "2020-07-23T00:52:33.000Z": "Through the Coronavirus Relief Fund, we've been providing immediate relief to Montanans and small businesses who need it most, while also making sure we will be able to meet long-term economic needs as we continue to weather this pandemic.", "2020-07-22T21:26:18.000Z": "I refuse to let the shortcomings from a lack of a national testing strategy harm the progress we have made together as Montanans. Working with @montanastate we have found a Montana solution to ensure we can again increase our testing capacity. Governor says Montana will expand surveillance COVID-19 testing Bullock said that MSU researchers will begin the surveillance testing next week, with a capability of testing 500 people per day krtv.com", "2020-07-22T17:41:46.000Z": "Wearing is caring. #MaskUpMT", "2020-07-21T18:02:44.000Z": "It's important we stand together in masking up to stop the spread of this virus. This is about being a Montanan and being supportive of those around us: our grandparents, our small business owners, and our immunocompromised neighbors are relying on us to #MaskUpMT", "2020-07-20T23:51:21.000Z": "I'm taking this action today not just to block William Perry Pendley's further illegitimate oversight of BLM, but also to ensure that this unconstitutional abuse of executive powers does not become commonplace under any administration in the future. Bullock sues BLM; acting director Pendley serving in 'violation of federal law' ~ Missoula Current Gov. Steve Bullock on Monday filed suit against the Bureau of Land Management and its acting director William Pendley, claiming he was violating federal statute by continuing to make key land-use... missoulacurrent.com", "2020-07-20T16:07:02.000Z": "We must make good hygiene, social distancing, and wearing masks habits as we continue to live with COVID-19. If we remain vigilant with our prevention efforts, we can stop the spread and save lives.", "2020-07-19T15:24:54.000Z": "Masks protect you and your community best when they cover your nose and mouth. #MaskUpMT", "2020-07-18T18:10:29.000Z": "Honored to lower the flags for Representative John Lewis. His life of public service stands witness to America's highest ideals.", "2020-07-17T21:16:48.000Z": "Need a mask? Your fellow Montanans have your back. Find a list of Montana companies making masks, hand sanitizer, and other products to keep us all safe and healthy here: Governor Bullock Praises Montana Businesses for Stepping up in Response to COVID-19 Pandemic MONTANA - Governor Steve Bullock today praised Montana companies for pivoting their normal operations to produce cloth face masks, 3D-printed face masks, face shields, surgical gowns and... commerce.mt.gov", "2020-07-17T16:59:49.000Z": "Mom and pop shops in Montana often have two employees: Mom and Pop themselves. If they get COVID-19, they can't keep their business running. By wearing a mask, you protect our vibrant small business community. #MaskUpMT", "2020-07-16T19:24:34.000Z": "It was a pleasure to visit with @FHNourish earlier this week and see how they've used COVID-19 relief funds and a @nokidhungry grant to provide fresh, nutritious produce and bolster food security for Montanans during these challenging times.", "2020-07-16T17:22:14.000Z": "Wearing a mask is easy: you put it on before you walk into the grocery store and take it off when you leave - like how you put a seatbelt on when you get in the car, and unbuckle it when you need to get out.", "2020-07-16T00:37:09.000Z": "This is about being a Montanan and being supportive of those around us.  \n\nWe are going to team up, #MaskUpMT , and slow the spread of COVID-19.", "2020-07-15T20:46:50.000Z": "Effective immediately, face coverings will be required n certain indoor spaces and for certain organized outdoor activities in counties currently experiencing four or more active cases of COVID-19 to slow the spread of the virus in Montana. Bullock orders statewide mask use The mandate comes as Montana again set a record for the number of cases added in a single day, with 145 new cases reported Wednesday. billingsgazette.com", "2020-07-15T20:45:55.000Z": "Many Montanans answered the call to mask up - a call that came from our hospitals, nurses, and doctors, our vibrant small business community, our frontline workers, and our high-risk neighbors. But we need even more Montanans, and the visitors who come here, to mask up.", "2020-07-14T20:34:10.000Z": "As more lives are lost in Billings from COVID-19 and we stand with the community and comfort the loved ones, we cannot become complacent.\n\nWearing a mask promotes kindness and respect towards others. That's part of what it means to be a Montanan. Be a Montanan and #MaskUpMT", "2020-07-14T15:24:55.000Z": "These flags will be a symbol of respect and understanding, and a recognition that the State Capitol belongs to all those who call Montana home. Construction begins on Tribal Flag Plaza on the Montana Capitol grounds Construction began Monday on a Tribal Flag Plaza on the Montana State Capitol grounds. helenair.com", "2020-07-14T01:05:01.000Z": "Montana can come out the other side if we act as a team and battle this virus together.", "2020-07-14T01:04:36.000Z": "We cannot let our guard down. We must heed the warnings and advice of public health experts, and we must socially distance, wear masks in public spaces, and stay home when we are sick.", "2020-07-14T01:03:47.000Z": "The situation unfolding at Canyon Creek Memory Care is a tragic reminder of the devastation COVID-19 can inflict on Montanans, particularly those most vulnerable. My thoughts are with the families of those we lost this weekend. 7 now dead from COVID-19 outbreak at Canyon Creek Memory Care in Billings Two more of the Canyon Creek Memory Care residents have died from COVID-19. In all, seven residents of the Billings memory care facility have now died in a week. billingsgazette.com", "2020-07-13T15:58:52.000Z": "Small businesses make Montana vibrant, and we have grants available to help yours weather this unprecedented situation. \n\nApply at http:// covidrelief.mt.gov for grants to offset the cost of COVID-19 adaptations for your business. Grants available for all Montana businesses adapting to COVID In addition to a drop in customers, the cost of safety precautions like masks and hand sanitizer can be a burden on organizations. ktvh.com", "2020-07-12T18:59:04.000Z": "Montana's doctors and nurses are committed to combatting this virus. Show your appreciation for our healthcare professionals and #MaskUpMT .", "2020-07-11T21:09:32.000Z": "Montana's history on the vanguard of sex equality is something significant - and Montana is proud of it - but it is not nearly enough. It is time for the formal inclusion of the Equal Rights Amendment in the United States Constitution. Governor Steve Bullock files amicus brief in support lawsuit seeking to adopt Equal Rights Amendment HELENA- Governor Steve Bullock filed an amicus brief in support of a lawsuit filed in the U.S. District Court for the District of Columbia seeking to adopt the Equal Rights montanarightnow.com", "2020-07-11T18:30:48.000Z": "Masks protect from fires, fumes, sawdust - and yes - COVID-19. #MaskUpMT", "2020-07-10T17:01:15.000Z": "I know Montanans are tired of four months of COVID-19, but we can't let that fatigue allow us to let our guard down.", "2020-07-10T17:01:00.000Z": "We need to have a healthy workforce and a public that feels safe for the economy to do well and for a successful reopening. Montanans need to avoid large gatherings and wear a mask while in public. Many of these cases are preventable if this guidance is followed.", "2020-07-10T17:00:15.000Z": "The new daily highs in COVID-19 cases concern me deeply. Contact tracing, testing, adequate hospital capacity & supplies allow us to manage the virus at its current level - but if this trend continues, I will seriously consider reimplementing some public health restrictions.", "2020-07-09T21:55:19.000Z": "Whether you're a Griz or a Cat, we can all agree we want to keep Montanans safe and healthy. #MaskUpMT Quote Tweet Health406 @health406 We've got this! #Health406  #MaskUpMT", "2020-07-09T17:41:12.000Z": "I extend my sympathy to all of the loved ones impacted by these deaths, and I know that everyone in our state will be keeping them in our thoughts.", "2020-07-09T17:40:15.000Z": "This news is a heartbreaking reminder of the threat this virus presents to vulnerable Montanans. The Montana way has always been about taking care of our neighbors - and we must strive to continue keeping the health of our neighbors in mind. 3 deaths since Monday from Canyon Creek Memory Care COVID-19 outbreak in Billings The COVID-19 outbreak at Canyon Creek Memory Care in Billings has led to three deaths since Monday, according to the Yellowstone County Health Department. billingsgazette.com", "2020-07-09T15:59:00.000Z": "Eastern Montana will soon have more public access to fish on the Yellowstone River thanks to @MontanaFWP and @USDA . Thank you Secretary Perdue and FWP for your work on this important issue.", "2020-07-08T19:50:16.000Z": "Pandemics know no bounds. Whether at a rural hospital or a clinic in a city, securing accessible, affordable health care for Montanans is crucial to the well-being of our communities always, but especially during this unprecedented time. Bullock, health care leaders say pandemic reinforces need for Medicaid expansion Gov. Steve Bullock and local health care leaders spoke about the importance of Medicaid expansion on Tuesday, saying the COVID-19 public health crisis has only reinforced the need for the bozemandailychronicle.com", "2020-07-08T16:21:45.000Z": "Robust testing efforts are underway in Montana. Last week we not only met, but surpassed, our testing goal of 15,000 tests/week with nearly 18,000 tests performed. Find upcoming, free community testing events for all Montanans at https:// covid19.mt.gov/Montanas-Testi ng-Information  .", "2020-07-07T21:20:46.000Z": "It is our duty to protect our legacy Montanans. They carried our state and our nation through difficult times, and we must carry them in turn.", "2020-07-07T21:19:53.000Z": "While many facilities are already engaging in testing of staff and residents, with guaranteeing that testing is being conducted on a regular basis, we can ensure that any evidence of the virus in a facility is caught early on and mitigated before it spreads further.", "2020-07-07T21:19:28.000Z": "I have asked the Department of Public Health and Human Services to issue an emergency rule to require that all nursing homes and assisted living facilities participate in surveillance testing of staff and residents as a condition of visitation, to protect high risk Montanans.", "2020-07-07T21:18:56.000Z": "Today, as Montanans, we received some of the most solemn news that we have over the past few months. We know of 58 positive cases at an assisted living facility in Billings. I join Montanans across the state in being deeply concerned about this situation.", "2020-07-06T21:52:58.000Z": "The health of our economy relies on the health of Montanans.\n\nWear a mask. Gov. Bullock, biz leader urge Montanans to wear masks in public On a day when Montana hit another daily record for new reported Covid-19 cases, Gov. Steve Bullock said Thursday the worst may not be over - and urged Montanans to take precautions and wear face-ma... ktvh.com", "2020-07-06T16:06:23.000Z": "Mask wearing, good hygiene, and social distancing are crucial to preventing new infections in Montana. Montanans must take seriously our role - as individuals and as a team - to ensure our state can keep moving forward instead of taking steps back.", "2020-07-04T16:07:55.000Z": "Stay safe by celebrating this Independence Day with your family or small groups. Let us not forget that this day is about working together through challenging times. Let us again unify as Montanans and Americans to overcome all that we face currently. Happy 4th, Montana", "2020-07-03T22:16:55.000Z": "There's no need to play fast and Moose with disease. Keep you, and everyone you hold Deer, and your fellow Montanans Beary safe by wearing a mask. #MaskUpMT", "2020-07-03T15:12:35.000Z": "We don't have to take steps backwards if we again raise our guard - and one of the most important ways we can raise that guard is to make wearing a mask a habit and normalized. Governor, businesses encourage Montanans to wear masks Gov. Steve Bullock didn't issue an order requiring Montanans to wear masks in public Thursday, but he reiterated their importance as confirmed COVID-19 cases rise in the state. billingsgazette.com", "2020-07-02T22:14:44.000Z": "Montanans are independent, but we care about our neighbors, our grandparents, and our Main Street businesses. I am hopeful that Montanans will take seriously the recommendations of all those on the frontlines so that we don't have to get to the point of a mandate on masks.", "2020-07-02T22:14:19.000Z": "I'm heartened that this week several associations representing our businesses, restaurants, taverns, breweries, and hospitality have called on Montanans to wear masks when social distancing is not possible. Businesses have stepped up and Montanans can too.", "2020-07-02T22:13:56.000Z": "As we head into the 4th of July weekend, we must act to get our hands around this virus. We need Montanans to stay away from large crowds, wear a mask when in crowds and indoors, and still be cautious when outside. Now is not the time for massive backyard BBQs.", "2020-07-02T22:12:23.000Z": "I want to be clear that we are going to see more cases into next week as additional contact tracing and testing is conducted on the cases we are already aware of. Montanans should be prepared to continue to see high daily numbers.", "2020-07-02T22:12:01.000Z": "As Montanans are mingling in large groups, without social distancing and without wearing a mask, we are seeing more and more outbreaks from group settings, such as at wedding events, at bars, or in the workplace.", "2020-07-02T22:10:52.000Z": "Today I held a press conference regarding our increasing COVID-19 cases, and Montana's business community joined in calling on Montanans to mask up to keep our state healthy and open. Watch the full press conference here: Governor Bullock to Host Press Call to Provide Update on COVID-19 LIVE: Today (7/2) at 1:00 PM, Governor Steve Bullock will host a press conference to provide updates on new cases, will join the business community to... facebook.com", "2020-07-02T14:49:21.000Z": "Montanans, choose your favorite adventure - and pass it on.", "2020-07-01T18:33:58.000Z": "Let's use this day as a reminder that how we act can mitigate further spread. Let's commit to taking extra precautions and wearing masks when indoors and in crowds. Let's recommit to taking care of our neighbors so we can move forward together, not take any steps backwards.", "2020-07-01T18:32:50.000Z": "We always knew that as we opened things up and provided for greater testing, we'd see additional cases - and on the one hand, we still have the lowest per capita positives and deaths in the lower 48, but on the other hand, it's evident Montanans have let their guard down.", "2020-07-01T18:32:29.000Z": "Today Montana topped over 1,000 cases of COVID-19 since the start of this virus. This is not a milestone to be celebrated, it's one that showcases the virus hasn't gone away.", "2020-07-01T15:51:52.000Z": "Part of our testing goal is ensuring folks can participate in a community snapshot testing event if they want a test. You can find an upcoming testing event near you at https:// covid19.mt.gov/Montanas-Testi ng-Information  If you have any symptoms, don't wait - contact your provider and get a test.", "2020-06-30T21:32:46.000Z": "Other Montana organizations recieved grants to fund efforts to support our Native American veterans, launch universal PTSD and suicide screenings, integrate behavioral and physical health, and more. By increasing accessibility to these services, we can save lives. Quote Tweet Steve Bullock @GovernorBullock Today I met with healthcare providers in Billings to talk about preventing veterans' suicide. By directing $250K in Governor's Challenge grants towards efforts like Dog Tag Buddies, we (and some very good puppers) can support our military members, veterans, and their families.", "2020-06-30T21:31:47.000Z": "Today I met with healthcare providers in Billings to talk about preventing veterans' suicide. By directing $250K in Governor's Challenge grants towards efforts like Dog Tag Buddies, we (and some very good puppers) can support our military members, veterans, and their families.", "2020-06-30T19:04:07.000Z": "When I wear a mask, it protects you. When you wear a mask, it protects others. #MaskUpMT", "2020-06-29T22:10:49.000Z": "As cases continue to increase across the state, we must do more to protect one another - or else we may end up putting ourselves in a position where we have to move backwards. \n\nThe virus is still with us and we must act like it. #MaskUpMT", "2020-06-28T15:39:26.000Z": "If we want to keep the Big Sky State open, we have to keep our guard up. Maintain social distancing where you can, wear a mask when you can't, and stay home and call your provider if you have any symptoms of COVID-19.", "2020-06-26T22:30:29.000Z": "Please don't wear a mask. It interferes with our facial recognition software. \n\n(JUST KIDDING...thought I'd try a little reverse psychology. Please do wear a mask) #MaskUpMT", "2020-06-26T18:24:38.000Z": "Make sure to stay safe in our new normal when you enjoy the outdoors this weekend: Wear appropriate footwear Bring water Brush up on how to handle a wildlife encounter Choose a trail that isn't crowded Socially distance from folks outside your household", "2020-06-25T22:41:08.000Z": "Wearing a mask where social distancing is difficult decreases the spread of COVID-19. If we don't do things right in Montana, this virus can quickly get out of hand. Let's continue to be an example for the rest of the nation, as we did in our initial response to this virus.", "2020-06-25T22:40:24.000Z": "Folks, it's simple: we aren't asking you to wear a mask while enjoying public lands or when you're at home. Do so at the grocery store, the pharmacy, grabbing a coffee. That fifteen minutes of inconvenience can make all the difference between one case turning into a dozen more.", "2020-06-25T20:23:50.000Z": "Living in our new normal means adapting how we work and play to ensure the safety of our colleagues, our families, and ourselves. I ask folks to exercise caution in the workplace and elsewhere and avoid actions that have led to COVID-19 clusters. New COVID clusters tied to work, group settings \"If we don't get things right in Montana, this virus can quickly get out of hand.\" helenair.com", "2020-06-25T00:27:03.000Z": "We need to dedicate ourselves to taking actions that protect our friends and neighbors from this virus. As Dr. Greg Holzman, our State Chief Medical Officer, said: \"You may be a Griz, you may be a Bobcat, but right now, you just gotta be a Montanan.\" Bullock urges vigilance as COVID-19 cases spike in Montana HELENA, Mont. (AP) - Gov. Steve Bullock and state health officials urged Montanans not to let their guard down when it comes to preventing the spread of the coronavirus after the state reported... apnews.com", "2020-06-24T18:48:07.000Z": "During this difficult time we can't forget that nutritious food is the foundation to it all - a basic need that must be prioritized. Grants awarded to six local organizations to help with emergency food services HELENA- Montana No Kid Hungry and Governor Steve Bullock announced $108,550 in grants to six organizations to continue operating emergency food services in response to COVID-19. kulr8.com", "2020-06-23T22:29:54.000Z": "Our fight against COVID-19 isn't over. Let's work together and keep the 406 - and our family, friends, and neighbors - healthy. Quote Tweet DPHHS @DPHHSMT Thank you Montana for continuing to take the right steps to fight the spread of COVID-19 and for Protecting Public Health in the 406!", "2020-06-23T17:12:35.000Z": "Thank you for hosting me today in Bozeman, Cafe M. I appreciate that through a business stabilization grant from the state, you've been able to reopen and do so safely for your employees and customers in our new normal.", "2020-06-22T22:19:09.000Z": "Montanans appreciate our public lands, especially in the time of COVID-19. There's still time left to register for the @PPLTHelena 's Don't Fence Me In Trail Run to support our trails - this year, virtually and socially distanced.", "2020-06-22T19:28:48.000Z": "Each loss of a Montanan to COVID-19 weighs heavily on our communities. While we send our condolences to the loved ones impacted, we must all continue to remember we are in this together and it's up to us to keep our friends and neighbors safe. Montana reports 21st COVID-19 death in the state BILLINGS - Yellowstone County health officials are reporting a death related to COVID-19 Monday, marking 21 deaths in the state and 4 deaths in Yellowstone county. kulr8.com", "2020-06-22T15:11:46.000Z": "The safety of Montanans, from this virus and from wildfires, is my priority. Thanks to heightened collaboration, we are ready to tackle the complexities of this year's fire season. 'Above Average' Fire Season Predicted as Officials Prepare for COVID-19 Mitigation - Flathead Beacon As parts of Montana continue a warm and dry trend this spring, officials are predicting an \"above-average\" fire season this summer along with navigating complicated firefighting operations due to... flatheadbeacon.com", "2020-06-20T21:54:10.000Z": ". @GuardMontana is always here for us. From helping fight COVID-19 to responding to natural disasters here or abroad, our citizen soldiers are eager to serve. If you share their desire to help our community, consider joining the Montana National Guard today.", "2020-06-20T14:46:16.000Z": "Free fishing in Montana this weekend for Father's Day. Get out, enjoy some sunshine, and - hopefully - catch some fish.", "2020-06-19T17:11:51.000Z": "As Governor, I join Montanans across our state in celebrating Juneteenth, and I call on all Montanans to rededicate ourselves to the cause of equality and freedom for all, no matter who we are or how we look.", "2020-06-19T14:52:28.000Z": "Access to health care is fundamental to the physical, emotional, and economic well-being of Montanans - especially now. Bullock in Missoula: Medicaid expansion bridging healthcare, inequities during pandemic ~ Missoula... Saying that a pandemic leaves nothing hidden, local health officials joined Gov. Steve Bullock in Missoula on Thursday to laud the role Medicaid expansion in Montana has played during the COVID-19... missoulacurrent.com", "2020-06-18T19:18:09.000Z": "We continue to work towards reaching our testing target of 15,000 tests/week, or 60,000/month. From June 6-12, we performed 11,229 - an increase of 50% from the week before.", "2020-06-18T19:16:44.000Z": "The virus is still here with us and as we learn to live in a new normal with social distancing and continued precautions, enhanced testing is an important tool in helping us find new cases early to limit the spread.", "2020-06-18T19:14:10.000Z": "All 8 of Montana's Tribal Nations have completed first rounds of community testing events. Thank you to the Confederated Salish and Kootenai Tribes for making testing available this week - and I'm grateful to all of our tribes and partners for their work fighting COVID-19.", "2020-06-18T01:43:45.000Z": "Today I announced a new program to help businesses across the Big Sky State: the Montana Loan Deferment program. With this program, dollars will go a long way to help support local, Montana businesses. Montana continuing to test for COVID-19, offering loan deferment for businesses Editor's note: This story has been corrected to clarify that it is the state's Department of Revenue and Board of Investments that will begin accepting applications for the loan deferment billingsgazette.com", "2020-06-17T21:15:43.000Z": "It is only if we all work together that we can keep Montana healthy - physically, mentally, and economically.", "2020-06-17T21:15:20.000Z": "In addition to social distancing, washing hands, and disinfecting, let's make mask wearing a norm in Montana where social distancing isn't feasible. Studies show that widespread mask wearing can significantly reduce the spread of coronavirus cases.", "2020-06-17T21:14:39.000Z": "We still have the lowest positives, the lowest hospitalizations, and the lowest deaths per capita in the lower 48. But we don't want to take any steps backward after how far we have come in successfully maintaining the lowest number of cases in the nation.", "2020-06-17T21:14:12.000Z": "I know the increase in the number of cases we've seen over the past couple of weeks is on the minds of all Montanans - it's certainly on mine. We all have to commit to doing more to slow the spread over the coming months.", "2020-06-17T02:02:59.000Z": "I'm saddened to learn of another death in Big Horn County due to COVID-19 and mourn with the community as they face another loss. I urge all Montanans to continue taking the precautions they've taken all along the way to protect one another from this virus.", "2020-06-16T20:05:27.000Z": "From east to west, Montanans have shown that when we work together and care for our neighbors, we get more done. Working together is our key to success this wildfire season.", "2020-06-16T20:05:00.000Z": "We are prepared to manage two crises at the same time if we are confronted with a challenging fire season. The heightened levels of interagency collaboration and communication give me confidence that we are ready to protect the Big Sky State's communities and firefighters.", "2020-06-16T20:04:22.000Z": "Today I'm hosting the 2020 Wildfire Season Briefing. While this year's briefing looks a lot different via Zoom than in-person, we will continue to work to protect lives and communities across Montana, and our mission now includes protecting firefighters against COVID-19.", "2020-06-15T23:21:58.000Z": "We are seeing an increase in the number of COVID-19 cases, as expected through enhanced testing, contact tracing efforts, and further reopening. We must learn to live in a new normal and that includes remaining cautious and  wearing a mask where social distancing isn't possible.", "2020-06-15T16:38:25.000Z": "No one should have to live in fear of losing their job for who they love. Today we celebrate a victory in the fight for equality, and tomorrow we continue to work towards advancing a more equal and just society.", "2020-06-15T02:13:51.000Z": "I'm pleased to see Montanans continue to make their voices heard in demanding justice and pursuing progress - doing so peacefully and safely in communities all throughout our state.", "2020-06-13T23:24:37.000Z": "We are currently responding to the fire west of Clancy and I am being kept apprised of the situation. Impacted Montanans should heed evacuation advice and take precautions to stay safe. UPDATE: Clancy area fire estimated to be 1800 acres, evacuations ordered A late update puts the fire at an estimated 1,800 acres ktvh.com", "2020-06-13T18:44:37.000Z": "With another tragic loss of life to COVID-19, we are again reminded that we are all neighbors and we have the responsibility to look out for one another. The virus is still here with us and we must act with the safety of our parents and grandparents in mind.", "2020-06-12T15:38:42.000Z": "Our early actions suppressed the virus and prepared us to be one of the first states to reopen. But, to continue this path, we all must remain committed. Bullock warns against COVID complacency, state on track for testing goal Gov. Steve Bullock said Thursday that expecting the state to fully reopen into Phase 3 anytime soon is unlikely. billingsgazette.com", "2020-06-10T23:22:10.000Z": "Montana's Tribal Nations continue to stand up community testing events in partnership with public health and the National Guard. Thank you to the Northern Cheyenne Tribe for having me today and for ensuring accessible testing to help us keep folks healthy and safe.", "2020-06-10T15:07:01.000Z": "This marks a significant milestone in our efforts to secure a final cleanup for America's largest Superfund site. Butte Hill cleanup plan filed in federal district court A sweeping mine-pollution cleanup plan for the Butte Hill has been filed in U.S. District Court, a move that Gov. Steve Bullock called a \"significant milestone.\" mtstandard.com", "2020-06-09T21:39:59.000Z": "Glacier National Park is one of our greatest treasures - and we must all do our part to ensure Glacier can remain safe for all of us. Travelers should be aware that the east side remains closed in accordance with the Blackfeet Nation travel restrictions. Glacier National Park partially reopens amid pandemic The western side of Glacier National Park has reopened to visitors after being closed since late March to prevent the spread of the coronavirus. helenair.com", "2020-06-09T16:28:40.000Z": "As we continue with reopening, I ask that Montanans and any travelers into our state honor the restrictions in our tribal communities. They have our full support as they determine what is best to keep their communities safe and healthy from COVID-19.", "2020-06-08T19:04:05.000Z": "Masks help stop the spread of COVID-19. I ask that Montanans join me in masking up when it is hard to maintain social distancing.", "2020-06-06T17:24:38.000Z": "Dance like no one is watching... #gobengals", "2020-06-06T16:27:01.000Z": "Caroline, I know this isn't the way you expected your senior year of high school to end. You have handled the disruption with grace, just as your peers across Montana have. Congratulations, we celebrate you! Thank you for giving me the most important job I have: being a dad.", "2020-06-06T03:51:58.000Z": "Happy Trails. #gobengals Quote Tweet Steve Thennis @thennis_steve Class of 2020 out! #gobengals", "2020-06-05T19:14:34.000Z": "As Montanans continue to exercise their right to demonstrate enshrined in our Constitution, care for yourself and your fellow Montanans by wearing a mask, distancing yourself as much as possible, and finding another way to help if you are symptomatic.", "2020-06-05T17:07:45.000Z": "We have lost another Montanan to COVID-19. All of Montana stands with the family and friends of this person as they grieve. I ask that Montanans remain cautious and continue to act with the health and safety of their neighbors in mind.", "2020-06-04T22:32:31.000Z": "These grants will help Montana businesses put more Montana meat onto more shelves - and bolster our state's food security, making us stronger in response to the pandemic, as well as long into the future.", "2020-06-04T22:31:54.000Z": "Despite the trying times this pandemic has posed, Montana's farmers and ranchers are pressing on. We want to make sure we are doing everything possible to see to it that there are viable markets.", "2020-06-04T22:31:33.000Z": "Today I announced the Montana Meat Processing Infrastructure Grant program, available immediately to help small and medium-sized meat processors respond to COVID-19 supply distributions and boost processing and storage capacity. Bullock announces additional funding to support local meat processors, small businesses, local... HELENA- Governor Steve Bullock announced additional CARES Act funding that will go towards supporting local meat processors, small businesses and local governments across Montana. kulr8.com", "2020-06-03T19:31:14.000Z": "I visited the Fort Peck Assiniboine and Sioux Tribes community testing event today. Thank you for partnering with the state to combat COVID-19 in your community and all of Montana. It is efforts like these that help to keep the virus contained.", "2020-06-02T20:51:18.000Z": "Time and again, dark money groups have tried to attack Montana's campaign finance laws - because those laws work. I'm pleased by the Supreme Court's decision and will keep fighting to ensure that our elections belong to the people, not special interests. U.S. Supreme Court won't hear challenge to MT campaign finance law The case in Montana was filed by the National Association of Gun Rights in 2016. billingsgazette.com", "2020-06-02T16:40:07.000Z": "As we further ramp up testing, excel at contact tracing to ensure new cases are isolated, and remain committed to social distancing, we can continue to keep cases low in Montana. We're all in this together as we move into the next phase of our reopening. Montana sees 'cluster' outbreaks, but low COVID-19 case growth otherwise Montana has fared better than similar states when it comes to growth in cases of the novel coronavirus. helenair.com", "2020-06-01T20:19:19.000Z": "Montanans are known for pulling together to help our neighbors. As we enter Phase Two starting today, I'm asking you to keep being neighborly in this new normal by continuing with the social distancing efforts that have helped to flatten the curve in Montana.", "2020-05-31T21:38:06.000Z": "The pain we are seeing in Montana and across the country is real and devastating. As Montanans make their voices heard, we must continue to demand accountability, seek justice, and pursue progress peacefully.", "2020-05-29T23:29:40.000Z": "I was saddened to hear about the Amtrak train crash in Roosevelt County, Montana and am being kept apprised of the situation. My thoughts are with the family members and loved ones of the life lost.", "2020-05-29T21:18:40.000Z": "Partnering with Tribal Nations is crucial as we ramp up testing across the state. Thank you to the Chippewa Cree Tribe for having me at Rocky Boy's Indian Reservation to check out their drive thru testing, which will help to stop the spread of COVID-19.", "2020-05-28T22:13:50.000Z": "While cases remain low and testing ramps up, we're not out the woods - and we won't be until we see a vaccine. I again remind Montanans that as we create another new normal, our success in continuing to combat this virus is dependent on all of our actions.", "2020-05-28T22:13:30.000Z": "Montana National Guard Members currently on Title 32 orders have been directed to take an online course and obtain a contact tracing certificate, adding an additional 150 contract tracers to our existing resources if needed.", "2020-05-28T22:12:58.000Z": "Our plan also includes implementing community snapshot testing for frontline workers in tourism communities and providing resources for community testing to develop an early warning system for identifying new cases.", "2020-05-28T22:12:38.000Z": "Additionally, we will implement an informational campaign for responsible travel. The Department of Commerce and DPHHS will work with local tourism partners to inform and educate visitors - before they arrive, and once they're here.", "2020-05-28T22:12:26.000Z": "The Montana Business Adaptation Grant program will provide reimbursement for COVID-19 expenses related to keeping staff and businesses safe. Businesses can apply starting on Monday for up to $5,000 at http:// covidrelief.mt.gov .", "2020-05-28T22:12:04.000Z": "Today I announced additional support for destination communities and small businesses. We must all continue to work together to ensure that we can move forward together. Bullock announces support for tourism towns Governor Bullock announced on Thursday further support for communities heading into \"Phase Two of the Reopening the Big Sky Plan on June 1, including additional resources for community testing and... nbcmontana.com", "2020-05-28T22:11:44.000Z": "As we move into Phase Two on June 1, we ask the same of our visitors as we do of Montanans. Heed state, local, and tribal restrictions. Engage in the same precautions we do, and exercise patience as tourism communities gradually welcome you back.", "2020-05-28T22:11:18.000Z": "The precautions Montanans are taking mean our state has one of the lowest rates of COVID-19 in the nation, and we must remain fully committed to social distancing. We have to keep at it, for the sake of the people and the state we love.", "2020-05-28T18:41:45.000Z": "I'm pleased the administration listened to the concerns of governors - that I expressed on a call with the Vice President this week - and will extend Title 32 orders. Our Montana guardsmen and women have been keeping our communities safe and their necessary work will continue.", "2020-05-27T19:24:07.000Z": "I enjoyed the opportunity to visit Crow Agency and see their drive thru testing this afternoon. Thank you to our Tribal Nations for their continued partnerships as we continue to boost our testing efforts across Montana.", "2020-05-27T16:27:49.000Z": "In 2018, I sued the IRS over its decision to abandon disclosure requirements for major donors to dark money groups - and won that lawsuit. \n\nNow, the IRS is moving forward with this threat to our democracy. It's not only disappointing, it's unacceptable. 'Dark money' groups dodge reporting requirement in new regulations The rules, which have been in the works for several years, will affect groups organized under 501(c)(4) of the tax code. politico.com", "2020-05-26T19:57:43.000Z": "By acting early, we flattened the curve of COVID-19 in Montana and saved lives. Montanans must continue to do our part and be vigilant with social distancing so the curve stays flat and Montana stays open. University of Montana researchers say Montana's response to COVID-19 likely saved lives \"Until we have a vaccine, the new normal is any increase in activity is somewhat risky,\" said Brandon Cooper, a UM faculty member. missoulian.com", "2020-05-26T16:35:57.000Z": "Today Montana mourns another loss due to COVID-19. I ask that Montanans continue to commit ourselves to fighting the spread of this virus and take seriously our responsibility to protect our loved ones and neighbors from this disease. Montana again adds no new COVID-19 cases, Yellowstone Co. reports death Montana added no new cases of COVID-19, but a woman in her 80s died in Yellowstone County Monday, marking the state's 17th death from COVID-19. billingsgazette.com", "2020-05-25T15:23:05.000Z": "By committing ourselves to living the values for which our service men and women gave their lives, we pay respect to their memory and carry on their legacy.", "2020-05-25T15:22:28.000Z": "This Memorial Day let us honor our fallen heroes by supporting the families and comrades they left behind and pledging to enhance the physical and mental health care, educational opportunities, and economic livelihoods of the heroes still among us.", "2020-05-24T18:50:47.000Z": "I've ordered flags to be displayed at half-staff tomorrow to honor those who have made the ultimate sacrifice, with flags raised to full-staff at noon to honor the heroes still among us and symbolize that we are a resilient nation when faced with loss.", "2020-05-22T21:20:53.000Z": "I've order flags lowered to half-staff through Sunday as we honor our neighbors nationwide who lost their lives to COVID-19. Our hearts go out especially to the 16 Montanans we have lost and to their families and friends.", "2020-05-22T16:13:56.000Z": "At five years old, Hunter understands that social distancing is important to keep us all safe - and that super speed is a big deal. Let's follow Hunter's lead, especially as we prepare to enter Phase Two.", "2020-05-22T01:18:52.000Z": "While Montanans keep doing their part to social distance, this is part of our focus to prepare and take extra precautions. Together, we can keep the curve flat so that extra hospital space is never needed. Governor Bullock tours Alternate Care Facility in Kalispell The facility is under construction on the vacant third floor of Montana Children's Hospital. kpax.com", "2020-05-21T19:12:58.000Z": "As we ramp up testing, we are partnering with Tribal Nations to test both symptomatic and asymptomatic individuals, which will allow us to quickly isolate new cases. It was great to visit the Blackfeet Nation today and see their drive thru testing program.", "2020-05-21T01:25:53.000Z": "Montana rainstorms...", "2020-05-20T17:25:24.000Z": "Looking forward to it, @SenatorTester ! Quote Tweet Senator Jon Tester @SenatorTester Got questions? @GovernorBullock and I have answers. We'll be teaming up today at 12:30pm MT for a live Q&A. Tune in for an update on Montana's next steps in navigating the COVID-19 pandemic. https:// facebook.com/senatortester", "2020-05-20T15:33:50.000Z": "National Guard soldiers have been working hard at our supply warehouse to put together testing supply packages that are then distributed to nursing homes. Their work is critical to helping us reach our testing targets and keeping the virus mitigated.", "2020-05-19T22:51:33.000Z": "As we continue with the next phase of our reopening on June 1, our goal together as Montanans for the foreseeable future is to mitigate the virus.", "2020-05-19T22:51:16.000Z": "We will also continue to ramp up our testing capacity. Increased testing continues with efforts in nursing homes and assisted living facilities, testing events in tribal areas, and drive thru testing in some areas of the state.", "2020-05-19T22:48:54.000Z": "All along the way, we will continue to ensure health care workers have the supplies they need to treat COVID-19 and non-COVID-19 patients. We will ramp up even further our ability to contact and trace, which has been effective in mitigating the spread of the virus.", "2020-05-19T22:46:41.000Z": "We can continue to be that example if we continue to take seriously our responsibility to protect others. Social distancing, wear a cloth mask, washing your hands are all part of our new normal. If not for you, do it for others.", "2020-05-19T22:46:20.000Z": "Montana has been an example for the rest of the nation in our response to this global pandemic. Our quick and early actions allow Montana to move into Phase Two on June 1st. We need every Montanan to follow these guidelines, so read the full plan here  http:// COVID19.MT.GOV", "2020-05-19T18:04:24.000Z": "Today I visited our state supply warehouse to thank the public servants who work to ensure Montana has what we need, where we need it, to fight this virus - a monumental task as you can see from the 500K N95 masks pictured here, which arrived from FEMA yesterday.", "2020-05-18T19:04:29.000Z": "Got a question for me or @SenatorTester ? Join us on Facebook LIVE on Wednesday at 12:30pm and submit your questions here: https:// facebook.com/events/6032233 93651289/  Quote Tweet Senator Jon Tester @SenatorTester Since day one, @GovernorBullock and I have been working to ensure Montana makes it safely to the other side of the COVID-19 crisis. As MT's phased reopening begins, we know folks have a lot of questions-we're here to help. Join us Wednesday, May 20 at 12:30MT for a live Q&A. Show this thread", "2020-05-18T15:41:32.000Z": "The 500,000 N95 masks we secured today will ensure our health care workers, who are the backbone of the fight against COVID-19, have what they need to safely do their jobs. Governor secures 500k N95 masks for health care workers - Bitterroot Star May 18, 2020 Governor Steve Bullock today announced that Montana received a shipment of 500,000 N95 masks from FEMA to the state's warehouse. \"I'm grateful that FEMA and our federal partners assisted... bitterrootstar.com", "2020-05-17T18:52:18.000Z": "Part of my testing framework includes testing symptomatic and asymptomatic individuals. By doing so, we can get a better sense of the virus and quickly isolate when we find new cases. Fort Belknap holds 2-day surveillance testing Friday was the first of two days of enhanced drive-thru surveillance testing for the coronavirus on the Fort Belknap reservation. helenair.com", "2020-05-16T19:54:09.000Z": "Yesterday I had the honor of speaking with Great Falls High's AP Government Class via Zoom. Because of the vision and hard work of these students and their peers, I know Montana will emerge from our current challenges even stronger than before.", "2020-05-15T23:07:33.000Z": "Today and tomorrow the Ft. Belknap Indian Community is conducting drive thru testing for anyone who wants to be tested. Expanding testing efforts in tribal communities is an essential part of our continued approach to mitigating the virus.", "2020-05-15T18:50:25.000Z": "Thank you to our peace officers for their dedication to Montanans. We are grateful that they continue to serve their communities during unprecedented times like these. And we honor the officers we lost in the line of duty.", "2020-05-15T15:34:02.000Z": "While we're not immune to the problems facing so many states, we're in better shape than most, and we are taking steps to save on expenditures, offset revenue declines, and avoid a future that would lead to drastic cuts. Bullock: Montana in better financial shape than other states Gov. Steve Bullock laid out welcome news on the state budget Wednesday. But while he says we're in better financial shape than other states right now, he cautions we're not immune to an economic blow... nbcmontana.com", "2020-05-14T21:41:36.000Z": "Montana families shouldn't have to choose between putting food on the table and paying their utility bill. This funding is critical to keeping families afloat and providing peace of mind. Governor Bullock Extends Energy Assistance for Thousands of Montanans Impacted by COVID-19 Governor Steve Bullock today announced he is directing $5 million in federal CARES Act funds to expand assistance to thousands of Montanans struggling to afford their home energy needs due to... governor.mt.gov", "2020-05-14T15:26:35.000Z": "We will handle Montana's budget just like we've handled our response to COVID-19: based on science and data and by responsibly handling the day-to-day changes. We won't handle it based on politics. Bullock says state budget in good shape The governor says calls to cut the state's budget are premature and his office projects to have $113 million in general fund reserves at the end of July 2021. billingsgazette.com", "2020-05-13T23:16:38.000Z": "With a responsible budget, a rainy day fund, and a fire fund, Montana is in a stronger financial position than most other states during the pandemic. Bullock discusses state budget status amid COVID-19 storm A Yellowstone County woman in her 60s was the state's sole confirmed report of COVID-19, officials said early Wednesday greatfallstribune.com", "2020-05-12T17:39:20.000Z": "Stay the course like @TheJeffBridges : Stay home as much as possible, maintain a six foot distance from folks outside your household, and wear a mask. These simple actions protect vulnerable Montanans. Quote Tweet Montana Hospital Assoc. @MHA_Montana Montana, keep up that social distancing when you go out, wear a mask. We've flattened the curve, let's not go backwards. STAYING THE COURSE will save lives and stop the spread. Check out our new PSA with @TheJeffBridges ... Click here for more: https:// staythecoursemontana.com  #mtnews", "2020-05-11T21:56:35.000Z": "To continue to contain the virus in Montana, it's critical we identify new cases and ambitiously contact trace to remove chains of transmission. I will continue to ensure we receive the consistent supply chain we need to reach our testing targets. Montana receives 19,500 swabs to help reach Governor's COVID-19 testing goal Gov. Steve Bullock announced Monday that Montana has received 19,500 swabs and 9,000 viral transport medium from the federal government to bolster testing for COVID-19 in the state. kbzk.com", "2020-05-11T15:51:22.000Z": "Thank you to these nurses, and those all across the state, who demonstrate the wide range of specialties needed to keep our communities healthy at every level. Because of your knowledge and caring hearts, Montanans are in good hands. Recognizing 10 outstanding nurses who make the Helena area a better place In honor of National Nurses Week, the Independent Record is recognizing 10 nurses for their contributions to our community. helenair.com", "2020-05-10T18:43:24.000Z": "Happy Mother's Day to my wife Lisa. Thank you for being my partner in all things, but especially in raising three remarkable kids.", "2020-05-09T19:38:50.000Z": "As Montanans enjoy the weekend, let's continue to do our part to keep the virus contained. Pay attention to policies of open businesses, wash your hands, and wear a cloth mask where social distancing is difficult to maintain. We want to stay safe and to keep businesses open.", "2020-05-08T16:58:38.000Z": "Montana's families need access to sustainable and safe childcare options. This funding will provide much-needed financial assistance to providers, as well as support Montana families. Bullock announces $10M available for child care facilities Governor Steve Bullock announced Wednesday that $10 million in federal CARES Act funding is available for childcare providers around Montana in response to COVID-19. \"We know many Montana families... nbcmontana.com", "2020-05-07T22:05:11.000Z": "Montanans must remain diligent: wear non-medical masks, wash your hands frequently, and stay home if you are high risk or sick.", "2020-05-07T22:04:26.000Z": "In consultation with public health officials, we have determined that these businesses can carefully reopen under strict capacity, social distancing, and sanitation guidelines on May 15. Gov: Gyms, theaters, museums can open May 15 Gov. Steve Bullock said Thursday that gyms, theaters and museums can soon begin to operate with social distancing measures in place. helenair.com", "2020-05-07T17:32:08.000Z": "Took a tour of the Battelle Critical Care Decontamination System today, which can sanitize up to 80K N95 masks each day so our health care workers can stay safe on the front lines. To sign up for this free service, Montana health care workers should visit http:// battelle.org/decon", "2020-05-07T01:19:15.000Z": "Tomorrow the application portal will open for the first round of grants to ensure small businesses can responsibly reopen, homeowners can stay in their homes, Montanans most in-need have access to services, and more. Learn more at http:// COVIDRELIEF.MT.GOV WATCH: State offers $123 million in grants to support biz, homeowners, renters The state will make $123 million in funding from the federal CARES Act available to small businesses, nonprofits, renters and homeowners in the first round of emergency grants it is helenair.com", "2020-05-06T17:24:17.000Z": "Nightly howls, donated meals, a Montana Air National Guard flyover: these are just a few of the ways folks in Montana are showing their appreciation for our dedicated first responders. It's things like this that remind us we will get through this together.", "2020-05-06T14:51:31.000Z": "Today is #NationalNursesDay . Their knowledge, compassion, and bravery make nurses the backbone of Montana's fight against COVID-19. I know I speak for Montanans when I say that we are grateful to nurses for their tireless dedication to their fellow citizens.", "2020-05-05T21:14:52.000Z": "Here's just some of what Montana's doing with the first round of emergency grants: Grants for small businesses Emergency Housing Assistance Grants for local health and tribal health centers Assistance to food banks and pantries", "2020-05-05T21:13:47.000Z": "Montanans have been hit hard by COVID-19, but Montanans also look out for each other. So today we announced $123 million in grants to provide economic relief.\n \nIndividuals and businesses can start applying for grants on May 7th. Learn more here: http:// COVIDRELIEF.MT.GOV", "2020-05-05T17:40:29.000Z": "Today and every day, let us remember the lives lost, such as Hanna Harris, Ashley Loring Heavy Runner and others. Let us honor their memory through our commitment to fighting for justice for indigenous women and girls, and to preventing these tragedies. #MMIW  #NotInvisible Quote Tweet Steve Bullock @GovernorBullock As we are living through challenging times with COVID-19, we must not forget the other important issues we face today. Today I call on Montanans to stand with the tireless families and advocates who fight to end the epidemic of Missing and Murdered Indigenous Women and Girls.", "2020-05-05T17:39:31.000Z": "As we are living through challenging times with COVID-19, we must not forget the other important issues we face today. Today I call on Montanans to stand with the tireless families and advocates who fight to end the epidemic of Missing and Murdered Indigenous Women and Girls.", "2020-05-04T23:08:15.000Z": "Older adults and those with compromised immune systems should continue to stay home. Washing your hands, staying home when sick, and wearing non-medical masks out in public are also part of Montana's new normal.", "2020-05-04T23:07:20.000Z": "While additional businesses open today under strict social distancing protocols, they will look different than before the virus. We must remain vigilant and adhere to social distancing measures to ensure Montana stays open and progresses to the next phase of the reopening plan.", "2020-05-04T17:53:59.000Z": "Unless the Force is strong with you, you use your hands to open doors, push grocery carts, press buttons, pilot a pre-Empire Razor Crest, and more. \n\nMake sure to wash your hands. #MayThe4th", "2020-05-03T17:46:25.000Z": "I continue to be humbled by the thoughtfulness, generosity and compassion of Montanans in response to COVID-19. \n\nFree and confidential help is available during this time. Visit this link for more Governor Bullock recognizes mental health providers Governor Bullock recognized mental health providers for their response to COVID-19. ktvh.com", "2020-05-02T20:32:22.000Z": "If you're going out in public, please wear a cloth mask! It's a simple step we can all take to keep our neighbors safe.", "2020-05-01T20:17:46.000Z": "We're grateful for this system that can decontaminate 80,000 N95 masks a day. This new technology will make sure those on the frontline don't go a single day without the equipment they need to protect themselves and their patients. Governor Bullock Announces System to Sanitize N95 Respirators for Health Care Workers MONTANA - Governor Steve Bullock today announced the state received a Battelle Critical Care Decontamination System to begin cleaning and disinfecting used N95 respirators to ensure health... governor.mt.gov", "2020-05-01T16:28:13.000Z": "We're working every day to ramp up our testing capacity and ensure that anyone who needs a test can get a test at no cost.", "2020-04-30T23:26:33.000Z": "As we gradually and responsibly reopen our state, we need to keep the virus suppressed - and ramping up our testing capacity is critical. Watch this: State to test all nursing home residents; sets monthly testing target Montana will establish a target of 60,000 tests for COVID-19 each month, Gov. Steve Bullock said Wednesday, adding that it's a goal the state will need to work up to helenair.com", "2020-04-30T16:26:59.000Z": "If any Montanan has any COVID-19 symptom - including chills, repeated shaking with chills, muscle pain, headache, sore throat, new loss of taste or smell, fever, cough, and shortness of breath - I'm asking you to get tested and I'm asking providers to do the test.", "2020-04-29T20:03:17.000Z": "Over the past ten days, we have received 25,000 swabs to help with ramping up testing and we will continue to work toward a consistent supply chain. Our ability to reach testing targets is based on the availability of these supplies.", "2020-04-29T20:02:50.000Z": "As more testing becomes available, the state will begin partnering with community health centers for testing frontline workers and engaging in general population surveillance testing.", "2020-04-29T20:02:22.000Z": "We will be testing residents and employees in nursing homes and assisted living facilities over the next month and will continue surveillance at those facilities. We will also conduct surveillance testing in Montana's tribal communities.", "2020-04-29T20:02:00.000Z": "We continue to ask providers to test any Montana with one or more symptoms of COVID-19, including the CDC's recent expanded list of symptoms.", "2020-04-29T20:01:32.000Z": "I am establishing a testing target of 60,000 tests/month. This is a long-term goal that we will be working towards in our continued response to COVID-19.", "2020-04-29T20:00:06.000Z": "As we enter phase one, we are committed to further ramping up our testing capacity in the state to help keep the virus suppressed in Montana. Today I announced our framework to do so. Governor provides update on ramping up COVID-19 testing in Montana Bullock said that he has established five \"strike teams\" made up of a certified nurse and National Guard members krtv.com", "2020-04-29T17:17:06.000Z": "Join me this evening for another virtual town hall. I look forward to hearing from Montanans as I outline this afternoon a framework to ramp up testing capacity in Montana.", "2020-04-28T22:46:17.000Z": "Congressman Ron Marlenee led a towering career in public service. My heart goes out to Congressman Marlenee's family and friends as we remember his life, career, and passion. Former Montana GOP Congressman Marlenee dead at 84 Former Montana congressman Ron Marlenee, a Republican who served for eight terms representing the state's old eastern district, died Sunday in Bozeman. He was 84. kpax.com", "2020-04-28T20:12:00.000Z": "I strongly encourage Montanans to wear a non-medical face covering when in public, especially in grocery stores or other places where social distancing isn't practical. By continuing to take precautions during Phase One, we can protect our neighbors.", "2020-04-28T15:39:31.000Z": "No Montanan should ever have to worry about where their kid's next meal will come from, especially now. Lisa and I are grateful to groups like @NoKidHungry going the extra mile to keep food on the table. Grants totaling $135K to address food gaps for Montana's kids Gov. Steve Bullock, First Lady Lisa Bullock and Montana No Kid Hungry announced grants to seven Montana communities totaling more than $135,000 to help address food access gaps around the mtstandard.com", "2020-04-27T23:02:15.000Z": "Each loss of life in Montana serves as a reminder of just how serious this disease is, particularly for those most vulnerable. As our hearts go out to the family & friends of this Montanan, we must reaffirm our continued vigilance in keeping our fellow Montanans healthy and safe. Quote Tweet Bozeman Daily Chronicle @bozchron Gallatin County sees first coronavirus death #mtnews  https:// bozemandailychronicle.com/coronavirus/ga llatin-county-sees-first-coronavirus-death/article_bae5de2f-41a8-5e7a-995a-e2845c50c015.html#utm_campaign=blox&utm_source=twitter&utm_medium=social ", "2020-04-27T19:43:19.000Z": "Together, we flattened the curve in Montana. Now it's up to all of us to make sure it stays flat. So please:\n\n- Keep washing your hands often and practice good hygiene\n- Stay home if you feel sick or are vulnerable\n- Continue social distancing", "2020-04-27T17:43:04.000Z": "We've officially started Phase One of Montana's gradual reopening. But let me be clear: we could be in this first phase for a long time. We will not move out of Phase One if the curve doesn't remain flat. Bullock asks Montanans to continue precautions as state begins phased reopening Gov. Steve Bullock says Montana's early actions to \"flatten the curve\" of COVID-19 cases have been successful, bringing the state to a place where restrictions can start to be relaxed. ktvh.com", "2020-04-26T15:52:42.000Z": "This isn't the time for a celebratory barbecue or going out to the breweries and bars several nights a week. For a lot of Montanans, including our most vulnerable, this phase should be substantially similar to the stay at home period. A responsible path to reopening Over the past several weeks, Montanans have faced unprecedented challenges. Our way of life has changed rapidly. Like every corner of our country, our once thriving economy is ailing. We've helenair.com", "2020-04-25T18:11:01.000Z": "As we begin to gradually reopen Montana starting tomorrow, Montanans must continue to be vigilant. We may be in Phase One for a long time, and when we get out of this phase depends on the individual actions taken by every person in our state.", "2020-04-24T21:14:28.000Z": "Montanans have stood together in the face of this crisis. And even as we start the process of reopening, we must keep protecting one another, looking out for our neighbors who need it the most, and being vigilant in every step we take.", "2020-04-23T19:37:11.000Z": "During this crisis, Montanans have made incredible sacrifices. Our actions have saved lives and flattened the curve.\n\nBut we are not out of the woods yet - and as we start to reopen our state, I ask every Montanan to keep looking out for each other. Bullock announces phased approach to reopen Montana Montana's churches will be allowed to hold services on Sunday and some businesses can re-open Monday under Gov. Steve Bullock's plan to ease coronavirus restrictions. Restaurants, bars and casinos... nbcmontana.com", "2020-04-22T20:17:46.000Z": "We aren't able to be together in person, but I still want to hear from you! Join me this afternoon for another virtual town hall to hear about Montana's gradual and phased plan for reopening.", "2020-04-22T19:33:50.000Z": "You can read our full plan to reopen Montana here. We will have to adapt to a new normal - but we will keep getting through this together. http:// covid19.mt.gov", "2020-04-22T19:33:27.000Z": "While there is reason for optimism, this is not a time for celebration. The virus has not left Montana.\n\nWe must continue to protect one another, look out for our neighbors, and be vigilant in every step we take.", "2020-04-22T19:32:55.000Z": "But this is not a time to declare victory. We are not in the clear yet - and we're still relying on support from the federal government. I will keep fighting medical supplies for our first responders and supplies to increase our testing capacity. Governor Bullock Secures Additional PPE from Private Market for Montana Health Care Workers Governor Steve Bullock announced Tuesday he has secured hundreds of thousands of face masks, shields and gloves from private market distributors to protect Montana health care workers on the front kulr8.com", "2020-04-22T19:31:34.000Z": "Finally, the travel quarantine will remain in effect. Out-of-state travelers and Montana residents arriving from another state or country to Montana for non-work-related purposes will still need to undergo a 14-day self-quarantine.", "2020-04-22T19:31:17.000Z": "I so appreciate the teachers, administrators, the food service staff, all school district staff and the parents who have been doing their best to serve Montana's kids through this extremely difficult time.", "2020-04-22T19:29:59.000Z": "On May 7, schools will have the option to return to in-classroom learning. Locally elected school boards will make the decision to resume classes or continue with remote learning.", "2020-04-22T19:28:58.000Z": "On Monday, May 4th, restaurants, breweries, distilleries and bars can reopen with reduced capacity. \n\nThere has to be plenty of space between tables - and no more than 6 people at a table. You won't be able to sit at the bar to drink and patrons must leave all bars by 11:30 pm.", "2020-04-22T19:27:56.000Z": "Other businesses where groups gather often without the ability to create distance between customers - like movie theaters and gyms - will remain closed for now.", "2020-04-22T19:27:00.000Z": "On Monday, April 27, main street and retail businesses can reopen. But that doesn't mean things should look like they did before this virus. \n\nJust like we're now used to the markings on the floor of grocery stores, retail stores must be able to maintain physical distancing.", "2020-04-22T19:26:03.000Z": "On Sunday, April 26 places of worship may choose to reopen for services with reduced capacity and must maintain strict physical distancing protocols.\n\nFamilies can sit together, but for the safety of the parish or congregation, there has to be sufficient room between families.", "2020-04-22T19:23:47.000Z": "First things first: I'm still asking Montanans to take precautions to prevent the spread of the virus. Because once we begin to reopen, we want to be able to stay open.", "2020-04-22T19:22:40.000Z": "Starting this Sunday, the stay at home order will be lifted and we will begin PHASE ONE of our plan to reopen the Big Sky.", "2020-04-22T19:20:53.000Z": "From the start of this crisis, Montanans have come together to take care of our neighbors. This time hasn't been easy, but our actions have gotten us to where we are today: the beginning of a phased reopening.\n\nRead my plan to reopen the Big Sky: http:// covid19.mt.gov", "2020-04-21T19:05:46.000Z": "I have secured hundreds of thousands of face masks, shields and gloves from private market distributors to protect Montana health care workers on the front lines of the response to COVID-19. This is something I will continue to fight for every single day. Governor Bullock Secures Additional PPE from Private Market for Montana Health Care Workers Governor Steve Bullock today announced he has secured hundreds of thousands of face masks, shields and gloves from private market distributors to protect Montana health care workers on the front... governor.mt.gov", "2020-04-21T00:28:36.000Z": "Today we learned of two more deaths in Montana due to COVID-19. Each one is a reminder of the danger of the virus to our most vulnerable and as a community, we meet these losses with heavy hearts. We must continue to take care of each other through our actions to slow the spread.", "2020-04-20T18:30:38.000Z": "Just days ago I joined Republican & Democrat governors in voicing concerns about a shortage of testing supplies. I'm pleased to report these swabs arrived today. I will continue to push for additional supplies to ensure we have adequate testing capacity. Governor Bullock Secures 5,000 Swabs for Testing from FEMA Governor Steve Bullock announced that today 5,000 nasal swabs arrived to the state's DPHHS warehouse from FEMA. The state will distribute the swabs to providers throughout Montana to be used... governor.mt.gov", "2020-04-20T15:07:11.000Z": "Grocery store workers are heroes. Pass it on. 'New respect': Grocery store workers carry on during pandemic Rachel Franz was in only her second week as a cashier at the South 11th Avenue Town and Country Foods. When she arrived at work on March 26 she heard bozemandailychronicle.com", "2020-04-19T18:16:20.000Z": "Access to nutritious meals for families is critical throughout the year and especially during this difficult time. I thank all the schools and communities across the state that are stepping up to meet the needs of our children. Kalispell Public Schools Food Service Program receives $15,000 grant Gov. Steve Bullock and First Lady Lisa Bullock awarded a $15,000 grant to Kalispell Public Schools Food Service Program on Thursday. kpax.com", "2020-04-18T16:09:11.000Z": "Great to see my friend @TheJeffBridges ! I look forward to when we get to catch up in person and not through a screen, but until then let's all keep doing our part to save lives.", "2020-04-18T01:13:59.000Z": "While there are reasons for optimism, today is another sober reminder that this virus can impact any community. Today we learned of two more losses of life due to COVID-19 in two Montana counties where it is their first death. My family, like all Montana families, are with you.", "2020-04-17T22:09:57.000Z": "Montana's stay at home directive will stay in effect through April 24. After that, we will move forward with a phased reopening. We all need to understand this will be a gradual process. Because once we begin to reopen, we want to be able to stay open. Quote Tweet Steve Bullock @GovernorBullock I want to open things up as much as any Montanan. We will do it in a way that will protect Montanans' lives and the recovery of our economy. Read about my plan for Montana here. https:// medium.com/@stevebullock/ reopening-the-montana-way-protecting-lives-and-the-recovery-of-our-economy-1eae06f2b342 ", "2020-04-17T21:58:39.000Z": "I want to open things up as much as any Montanan. We will do it in a way that will protect Montanans' lives and the recovery of our economy. Read about my plan for Montana here. Reopening the Montana Way - Protecting Lives and the Recovery of our Economy When COVID-19 first came to Montana, we took quick and aggressive measures to slow the spread and keep Montanans home during this critical medium.com", "2020-04-17T16:07:08.000Z": "In Montana, we look out for each other. I'm grateful to former governor Marc Racicot for sharing his story and encouraging us all to continue doing our part to flatten the curve. #MontanaAtHome", "2020-04-17T00:52:07.000Z": "My heart aches for the community, which has been particularly impacted, and the family members of this Montanan. As we see how COVID-19 can inundate our smaller communities, I urge all Montanans to continue doing their part to protect our most vulnerable. Toole County reports fourth COVID-19 death Public health officials in Shelby say a fourth person has died due to COVID-19 in Toole County, bringing the state total to eight. krtv.com", "2020-04-16T22:35:24.000Z": "While we continue to prioritize the health and safety of Montanans, we know many residents are financially impacted by this crisis. This Task Force will provide guidance on how to quickly put Montana on a path toward economic recovery. Governor announces creation of Coronavirus Relief Fund Task Force Press release HELENA - Governor Steve Bullock announced Wednesday the establishment of the Coronavirus Relief Fund Task Force to provide guidance and advice on how to best use $1.25 billion appropr... havredailynews.com", "2020-04-15T20:25:54.000Z": "When Montana calls for help, our National Guard answers. From fires to COVID-19, our citizen soldiers are there for their neighbors and communities. Thank you for protecting Montanans during this time.", "2020-04-15T15:55:55.000Z": "Someone asked me the other day to explain the severity of this virus to those who don't understand it.\n\nTo me, Montana is one large community of neighbors. Just like you care about your neighbor, we all stay home for our neighbors across the state.", "2020-04-14T23:01:07.000Z": "It is Montanans just like Betty who daily remind me that we will get through this together. Quote Tweet Lt. Governor Mike Cooney @LtGovMikeCooney Betty of Lewistown started making masks for her friends and neighbors, and now makes them for distribution among high-risk populations -- for free. To date she has made 112, and she's still going. Montanans like Betty prove that we can work together even while staying separate.", "2020-04-14T18:03:37.000Z": "Elaine, Donna and their colleagues at Montana's State Public Health Lab are crucial to our state's fight against COVID-19. They have worked tirelessly to perform tests to diagnose Montanans and protect our communities. Their work helps Montana to slow the spread. Thank you.", "2020-04-13T23:44:35.000Z": "For Montana families that can't make their housing payment right now because they've lost income due to COVID-19, this will help prevent a months-long rent backlog from coming due all at once. Bullock to provide rental assistance for families Governor Bullock issued a directive on Monday to provide emergency rental assistance to help families with limited financial resources in order to help during the economic situation caused by... nbcmontana.com", "2020-04-13T16:52:54.000Z": "As governor, I've always enjoyed visiting Montanans in their communities. While that's not possible at this time, it's especially important that I can hear from Montanans directly and answer their health and economic concerns related to COVID-19. Join us today!", "2020-04-13T15:31:49.000Z": "I am saddened to hear of another death due to COVID-19 in Montana and am thinking of the family and friends who are grieving the loss of this fellow Montanan. We must take all precautions to protect our family, friends, and Montana's most vulnerable during this difficult time.", "2020-04-12T18:39:48.000Z": "Happy Easter to all those celebrating, with loved ones at home or from afar. I'm reminded of hope, renewal, and resiliency on this day.", "2020-04-11T14:09:49.000Z": "Thanks, Mr. Thennis. Our dedicated principals, teachers and staff across Montana are missing their students.  Looking forward to the dance off! #gobengals Quote Tweet Steve Thennis @thennis_steve Spirit day competition/closure week #3. #gobengals", "2020-04-10T18:21:05.000Z": "Yesterday I visited Shelby, Montana for briefings of the on-the-ground situation as COVID-19 impacts the rural community. Thank you to all of the healthcare heroes and experts working hard to prevent further spread of the virus. Keep on keeping on Shelby.", "2020-04-09T23:16:16.000Z": "I recognize this is a difficult time for families across Montana and believe it's especially important we remember to find ways to bring joy into our homes. That's why I have deemed the Easter Bunny, Tooth Fairy, and other magical creatures as essential.", "2020-04-09T19:11:23.000Z": "Local and county governments are integral to the response to COVID-19. This directive ensures Montana taxpayers won't be forced to pay a penalty to access federal aid to respond to the unprecedented economic situation caused by COVID-19. Governor Bullock Issues Waiver to Help Local and County Governments Access Federal Emergency Relief... Governor Steve Bullock today issued a Directive to waive the current requirement that local and county governments implement a 2 mill emergency levy in order to access new funding coming to the... governor.mt.gov", "2020-04-08T21:23:58.000Z": "Montanans across the state have been relying on first responders and we're incredibly grateful for everything they've done to fight COVID-19. This measure ensures first responders can safely do their jobs during this emergency. Governor Bullock Announces Measure to Protect First Responders Governor Steve Bullock today announced a measure that will allow first responders to be notified in advance of potential exposure to COVID-19 and ensure they can take appropriate measures to... governor.mt.gov", "2020-04-08T17:19:43.000Z": "We sold bonds at a historically low interest rate to move forward with planning infrastructure projects across Montana. We are ensuring that when the time comes, we can immediately boost our economy by putting shovels to dirt and creating jobs. Bullock extends stay-at-home order; announces sale of bonds for economic recovery Gov. Bullock announced measures geared toward economic recovery, including the sale of bonds to prepare cities and towns for future infrastructure work. kpax.com", "2020-04-08T00:35:22.000Z": "It's also important to know that while cloth masks do help protect those around you, they should not be used as a replacement to social distancing or other protective measures such as washing your hands.", "2020-04-08T00:34:52.000Z": "Please use cloth face coverings and not surgical masks or N95 masks which are needed by our health care workers and first responders.", "2020-04-08T00:34:00.000Z": "I encourage Montanans to wear a cloth mask or face covering, consistent with CDC guidelines, in public settings where other social distancing measures are difficult to maintain, such as at grocery stores or pharmacies. https:// cdc.gov/coronavirus/20 19-ncov/prevent-getting-sick/diy-cloth-face-coverings.html ", "2020-04-07T22:03:04.000Z": "As we all work together to slow the spread of COVID-19, I'm daily reminded we are in this together. And we will get through it together. Thank you to all Montanans for your diligence and sacrifice during this time.", "2020-04-07T22:02:36.000Z": "Managing this public health crisis now will help to prevent long-term consequences that could upend our economy for a longer duration and with a worse outcome.", "2020-04-07T22:02:20.000Z": "We also stay home so that we can more quickly rebuild to a thriving economy. It is not a choice between a healthy population and a healthy economy - the two go hand in hand.", "2020-04-07T22:01:23.000Z": "We stay home to protect Montanans in our rural communities and our rural health care workers who face long distances to access care. Though many Central and Eastern Montana counties don't have a case yet, an outbreak in a rural community could overrun a local health care facility", "2020-04-07T22:00:36.000Z": "We stay at home to ensure that our health care workers and first responders have adequate time to receive the supplies to keep them, their patients, and their families safe.", "2020-04-07T22:00:18.000Z": "We must do this for our frontline healthcare workers, our rural communities, and our economy. That is why I am extending the Stay At Home directive and related directives until April 24.", "2020-04-07T21:59:55.000Z": "We know that staying home will help flatten the curve. For every person we take out of the chain of transmission, the more likely our health care facilities can handle the capacity to respond. The more likely we beat back this virus sooner not later.", "2020-04-07T15:20:07.000Z": "A good reminder I passed by on my morning run. We are in this together.  And we'll get through it!", "2020-04-06T15:25:59.000Z": "No matter what challenges we face this year, Montanans will prevail. Our spirit and sense of community will carry us through. Happy #406Day to all Montanans.", "2020-04-05T21:33:26.000Z": "As we continue to do everything possible to protect Montanans from the spread of this virus, making sure children and families in our state don't go hungry is a crucial priority. Bullock announces actions to bolster food security for Montana families during COVID-19 pandemic kbzk.com", "2020-04-04T21:04:35.000Z": "We stay at home to slow the spread and save lives, and to protect frontline health care workers in both urban and rural communities.", "2020-04-04T21:03:32.000Z": "Today we solemnly learned of another death in Montana from COVID-19. My heart goes out to the loved ones of this fellow Montanan. Each loss of life impacts another community and another family - and indeed, all of us through our shared bond as Montanans.", "2020-04-03T22:12:00.000Z": "Thank you, Montanans, for everything you're doing to play your part in slowing the spread of this virus.", "2020-04-02T20:33:43.000Z": "I'm calling for an extension to the Census deadline to accommodate COVID-19 health and safety measures. In Montana, we must ensure that everyone is counted. Our schools, hospitals, highways, communities and families depend on it.", "2020-04-01T21:33:54.000Z": "Today is #CensusDay2020 and @LtGovMikeCooney and I are asking all Montanans to fill our their 2020 Census form. In fact, you can do so while staying at home to slow the spread of COVID-19.", "2020-04-01T18:21:16.000Z": "Our rural and urban hospitals serve on the frontlines of this crisis and they need our support to continue providing lifesaving care across the state. Governor Bullock Announces Measure to Keep Smaller Hospitals Open Governor Steve Bullock today announced a Directive that allows Montana hospitals and related facilities to receive financing to remain open and acquire the supplies needed to respond to... governor.mt.gov", "2020-03-31T23:09:41.000Z": "So long as this virus forces Montanans to stay home to save lives, Montanans need a home to stay in. This order ensures that a loss of income won't lead to Montanans losing their homes or having their heat turned off. Bullock suspends evictions, foreclosures, utility shutoffs Along with his order, Bullock also announced a fifth death from COVID-19, though did not say where. billingsgazette.com", "2020-03-30T23:56:53.000Z": "Read the full directive here: Governor Bullock Directs 14-Day Quarantine for Travelers Arriving in Montana From Another State or... Governor Steve Bullock today directed that travelers arriving from another state or country to Montana for non-work-related purposes undergo a 14-day self-quarantine. The Directive follows the... governor.mt.gov", "2020-03-30T23:53:59.000Z": "While we love our visitors, we would ask that you not come visit while Montanans are watching out for one another by staying at home. Today I directed that travelers arriving from another state or country to Montana for non-work-related purposes undergo a 14-day self-quarantine.", "2020-03-30T20:05:58.000Z": "Whether they work in a three bed rural clinic or our largest healthcare system, Montana's doctors are against a lot these days. And they have risen to every challenge. Join me in thanking Montana's doctors on this #NationalDoctors Day.", "2020-03-30T17:29:25.000Z": "We lost two more Montanans, a total of four, to COVID-19. This is a blow to our statewide community and a heartbreaking reminder to us all that we must continue to do everything we can to slow the spread of this disease.", "2020-03-29T23:46:24.000Z": "I'm saddened that a 2nd Montanan has died from COVID-19. No matter in which community we live, the impact of each loss of life has a ripple effect throughout the state and serves as a reminder of how serious this disease is. Our hearts go out to the loved ones of this Montanan.", "2020-03-29T20:53:41.000Z": "Thank you to:\nThe grocery store employees who work tirelessly \nThe truck drivers who keep shelves stocked \nThe emergency responders on duty\nThe teachers who are providing high quality education in creative ways\n\nWe're cheering for all those on the frontlines of COVID-19.", "2020-03-28T20:56:46.000Z": "During the Stay at Home order, Montanans are still able and encouraged to responsibly enjoy our public lands. Follow social distancing requirements, avoid crowded trailheads, and recreate near the communities you live. It's up to all of us to slow the spread of COVID-19.", "2020-03-27T22:31:20.000Z": "Thank you to Montana's health workers - doctors, nurses, CNAs, pharmacists and pharmacy techs, custodians, receptionists, and more - who fight COVID-19, while ensuring Montanans can access other essential medical care to stay healthy. Your work is the backbone of this battle.", "2020-03-27T02:37:55.000Z": "I'm heartbroken to learn of Montana's first death due to COVID-19. Montana truly is one big small town - this news hits us hard, but we're in this together. My family and I send our love and support to the family, friends, and community of our fellow Montanan.", "2020-03-26T23:56:34.000Z": "We are all in this together. We can get out in front of this together. And when the time comes again, we will rebuild a stronger community.", "2020-03-26T23:56:05.000Z": "In order to have a healthy economy we need a healthy population. We cannot rebuild our economic strength without doing everything we can now to flatten the curve and slow the spread of this virus.", "2020-03-26T23:55:47.000Z": "I am taking these measures today because we need to stay in front of this pandemic and slow the growth of infections.", "2020-03-26T23:55:03.000Z": "There's no doubt that COVID-19 is causing a lot of hardship for Montana families. It's also causing incredible hardships for our front line doctors, nurses and other hospital staff across the country.", "2020-03-26T23:53:51.000Z": "Businesses and operations can find out if they are deemed essential in the directive at this link: https:// covid19.mt.gov/Portals/223/Do cuments/Stay%20at%20Home%20Directive.pdf?ver=2020-03-26-173332-177 ", "2020-03-26T23:53:03.000Z": "In consultation with public health and emergency management experts, I have determined that to protect public health and human safety, it is essential, to the maximum extent possible, individuals stay at home or at their place of residence.", "2020-03-25T21:48:22.000Z": "Locally elected officials best understand the voting needs of their communities. We can protect both the public's health at a time we face unprecedented challenges with COVID-19 and the right to vote with this direction. Gov: Counties can choose all-mail primary; 68 COVID-19 cases in Montana Gov. Steve Bullock told counties on Wednesday they can choose to conduct an all-mail election in June. He also expanded early voting. helenair.com", "2020-03-25T17:05:15.000Z": "These hardworking ER doctors are right - time is a valuable resource to fight COVID-19. Staying home slows the spread of this virus and buys us time. Thank you to all the Montanans doing their part. Billings emergency docs need your help: Stay home Editor's note: This plea was written by the leaders of the St. Vincent Healthcare and Billings Clinic Emergency Departments, on behalf of all the emergency-room health care providers. We believe billingsgazette.com", "2020-03-24T17:25:36.000Z": "Here are the 2020 @BengalsHigh Basketball Seniors! Enjoy! @Hayden24Ferg  @logan32291235 Ayden Fasbender @c_g_bullock  @emilyfeller22  @mckaylakloker  @abby_marcille  @rileythennis and @mariahbt12  #mtscores Helena High Basketball 2020 Seniors youtube.com", "2020-03-24T22:22:35.000Z": "We must take COVID-19 seriously, and we must prepare for the curve to go up. But with a continued focus on working together as Montanans, our state can get out in front of this.", "2020-03-24T22:22:08.000Z": "At the same time we are extending closures, we are also preparing for a potential increase of patients at our hospitals. We are doing everything we can as a state to prepare to take care of critically ill patients and ensure there is hospital space and supplies to respond.", "2020-03-24T22:21:31.000Z": "Stay at home, if you can. Don't hang out in big groups. Stay six feet part from others, when you can. Don't go to the grocery store every single day, plan ahead to limit your contact with others.", "2020-03-24T22:21:03.000Z": "Montanans have an obligation to slow the spread of this virus. Our fellow Montanans can all continue to set a good example for each other in adhering to social distancing directives - and know that it will save lives.", "2020-03-24T22:20:39.000Z": "It is the actions we are taking today - and actions businesses, individuals and each of us take today and in the immediate future that will lessen the spread in Montana.", "2020-03-24T22:20:14.000Z": "I am prohibiting non-essential social and recreational gatherings of individuals outside of a home or place of residence of greater than ten people, if a distance of at least six feet between individuals cannot be maintained.", "2020-03-24T22:19:48.000Z": "Today I announced the extension of closures of public schools and dine-in food service, alcoholic beverage businesses and other entities through April 10 and mandated social distancing measures to slow the spread of COVID-19 in Montana.", "2020-03-24T14:13:12.000Z": "Don't forget to look for the peace and goodness in every day", "2020-03-23T23:13:29.000Z": "Social distancing is paramount to slowing the spread of COVID-19, but we also must prepare for a potential surge in critically ill patients. Today's actions ensure we can focus on providing urgently needed quality care without delay. Gov. Bullock announces plan to boost capacity at hospitals Gov. Steve Bullock has announced measures to ensure the state can swiftly acquire the hospital space and medical supplies needed to rapidly respond to a potential surge in COVID-19 cases. kpax.com", "2020-03-23T17:37:49.000Z": "On the 10th anniversary of the Affordable Care Act, I'm reminded of how far we've come to expand coverage through Medicaid expansion and to those with preexisting conditions. Now is the time to do more to improve access and affordability to care, not strip it away.", "2020-03-23T17:36:54.000Z": "Access to health care is more important than ever as we face the COVID-19 pandemic.", "2020-03-23T04:01:52.000Z": "Our hospitals and front line providers cannot be forgotten. They need the resources and support to do their incredibly difficult jobs, among mounting challenges.", "2020-03-23T04:00:50.000Z": "The package should also include an increase in SNAP benefits for families struggling to keep food on their tables during these unprecedented times, as well as protections for workers who are facing tough challenges such as unemployment and evictions.", "2020-03-23T03:59:59.000Z": "Increasing the Federal Medical Assistance Percentage to 6% is not enough. It must be increased to 12% so that states can continue to rapidly respond to the impacts on our healthcare system.", "2020-03-23T03:58:56.000Z": "We - Democrat and Republican Governors - have asked for at least $150 billion in direct aid to states, giving governors the flexibility to direct this money to where we need it most in our communities during this time.", "2020-03-23T03:57:32.000Z": "Governors are on the front lines of the fight against COVID-19. The Senate must give us the resources we need to help our states.", "2020-03-22T15:27:13.000Z": "Montanans have always rallied together in times of crisis. It's time that we do so again. Gov. Steve Bullock: Rallying together during crisis Montanans are no strangers to challenging and unprecedented times. billingsgazette.com", "2020-03-22T00:25:11.000Z": "Montanans across the state have been impacted by COVID-19 and extending the deadline gives taxpayers breathing room without having to worry about interest or penalties. Governor Bullock extends Montana's tax filing deadline kpax.com", "2020-03-21T16:49:10.000Z": "As the Senate deliberates an economic stimulus package, governors are pushing for the inclusion of unrestricted fiscal support. States are on the forefront of this fight - we must be able to address the economic needs of our citizens during this crisis. Governors' Request for Third Congressional Supplemental Bill - National Governors Association nga.org", "2020-03-20T16:17:42.000Z": "We face further extraordinary health, economic, and social risks if we do not act now. I do not take this decision lightly and it was done so in consultation with public health professionals. Montanans, too, need to take this seriously. It's up to all of us to stop the spread.", "2020-03-20T16:16:22.000Z": "Montanans young and old, in urban and rural communities, have tested positive for coronavirus. This virus impacts us all, and these actions are imperative to protecting our friends and neighbors. Governor Bullock Announces Closure of Dine-In Food Service and Alcoholic Beverage Businesses, and... To curtail the spread of the COVID-19 pandemic in Montana, Governor Steve Bullock today announced measures to close dine-in food service and alcoholic beverage businesses and other activities that... governor.mt.gov", "2020-03-19T22:25:18.000Z": "Today I issued a travel advisory recommending all Montanans who return from international travel to self-quarantine for 14 days. By staying home after traveling, Montanans can play a key role in preventing COVID-19 spread in their community.", "2020-03-19T20:37:34.000Z": "Help them help you - stay home to  flatten the curve so our healthcare facilities aren't overwhelmed and our health workers minimize their exposure to COVID-19. Quote Tweet Montana DES @MontanaDES Montana's #PublicHealthHeroes are on the front lines. A moment of gratitude & thanks to all of our #PublicHealthHeroes across the state. We're all in this together. Please do you part to slow the spread. #FlattenTheCurve  #MontanansHelpingMontanans  #TogetherMT  @StPetersHelena", "2020-03-18T22:10:31.000Z": "I'd like to thank providers across the state who are on the front lines, balancing routine care with the new volume created by COVID-19. We truly couldn't do this without you, and I admire your fearless dedication to Montanans.", "2020-03-18T22:09:01.000Z": "Expanding telemedicine will provide the physical, mental, and substance use care Montanans need without overwhelming health care facilities responding to COVID-19 or risking unnecessary exposure. Montana Medicaid Expands Telemedicine Access - Flathead Beacon Gov. Steve Bullock expanded telemedicine service access for Montana Medicaid patients to prevent unnecessary coronavirus, or COVID-19, exposure in healthcare facilities. On Friday, March 20, several... flatheadbeacon.com", "2020-03-18T17:16:44.000Z": "This is a significant step in containing the spread of coronavirus. We know that the lack of health insurance often results in the delay of seeing a doctor or being turned away, which could further fuel this pandemic and put other Montanans at risk. Gov. Bullock: Uninsured Montanans to receive coverage for COVID-19 testing If confirmed positive for COVID-19, funds will be used to cover treatment costs. kpax.com", "2020-03-18T00:06:05.000Z": "These rules will ensure that workers impacted by COVID-19, whether it's because they've been laid off, are quarantined, or need to take care of a family member, can do so without worrying about how they will make ends meet during these difficult times. Governor Bullock Announces Emergency Rules to Streamline Unemployment Benefits for Workers Impacted... Governor Steve Bullock today announced emergency rules to make unemployment benefits accessible to workers laid off due to COVID-19 and waive the typical one week waiting period before receiving... governor.mt.gov", "2020-03-17T14:37:56.000Z": "I praise the leadership of local communities for enacting social distancing orders. The ability to slow new infections is in our hands and our friends and neighbors are counting on us to do the right thing. Montana Closures, Quarantines Add up Over Coronavirus Disruptions of day-to-day life in Montana are adding up as part of ongoing efforts to slow the spread of the new coronavirus. usnews.com", "2020-03-16T22:42:34.000Z": "Yesterday I announced several measures to slow the spread of COVID-19 in Montana, including closing public K-12 schools and recommending limiting all gatherings. It's going to take all of us working together to overcome these challenging and dynamic times.", "2020-03-15T23:32:41.000Z": "My top priority is protecting the health and safety of Montanans, particularly our most vulnerable, at a time when we face the potential for extraordinary health risks from coronavirus in our state.", "2020-03-15T23:31:55.000Z": "Social distancing is a primary protective measure to flatten the curve of this virus. I cannot underscore the seriousness of following these measures to help our neighbors, friends, and families.", "2020-03-15T23:31:33.000Z": "I encourage businesses to do everything they can to support Montana families as well.", "2020-03-15T23:31:12.000Z": "I recognize that our schools often serve as a lifeline for families and that this decision is going to have disruption on Montanans over the coming weeks. I'm committed to working with schools, communities and public health to minimize the impact.", "2020-03-15T23:30:32.000Z": "Today I announced measures to slow the spread of COVID-19 and protect vulnerable Montanans, including closing public K-12 schools for two weeks, strongly recommending social distancing measures, and limiting visitation at nursing home facilities. Governor Bullock Directs the Closure of Public K-12 Schools for Two Weeks; Strongly Recommends... Governor Steve Bullock today announced a set of directives and guidance to slow the spread of COVID-19 and protect vulnerable Montanans, including closing of public K-12 schools, social distancing... governor.mt.gov", "2020-03-14T21:14:14.000Z": "As Montanans, I trust we will do everything we can to help our fellow citizens. We have been planning and preparing for these days to come to Montana. In the coming days and weeks, we will continue to make decisions in the best interest of the public's health.", "2020-03-14T21:13:11.000Z": "The small sacrifices we make now - missing out on a cancelled event, avoiding crowds and enjoying time with small groups of healthy family and friends, and staying home if you feel sick - means keeping more folks healthy in the long run.", "2020-03-14T21:12:48.000Z": "I can't stress enough the importance of the role of the public in helping us mitigate the impact of this virus. The person ahead of you in line at the grocery store could be among those most at risk of falling ill to the virus.", "2020-03-14T21:12:01.000Z": "I amended Montana's state of emergency to align the effective timeframe with the federal state of emergency announced by the President. This means that our state's emergency response will be in effect as long as necessary to allow us to continue to mobilize state resources.", "2020-03-14T21:10:29.000Z": "The state lab is performing testing and disclosing results today and will be performing testing 7 days a week starting Monday.", "2020-03-14T21:10:15.000Z": "Today I hosted a call with Montana press to provide an update on Montana's four positive COVID-19 cases and share additional response efforts. I'm pleased to report that all four patients are at home and recovering.", "2020-03-14T01:12:44.000Z": "As our public health officials work relentlessly to prevent further spread, I urge all Montanans to continue efforts to plan and follow public health recommendations to take the proper precautions.", "2020-03-14T01:11:34.000Z": "Four people in Montana have tested positive for COVID-19. We've been monitoring this rapidly evolving situation and vigorously preparing for this virus to reach Montana, making today's news unsurprising. Governor Bullock Confirms Four Presumptively Positive Coronavirus Cases in Montana MONTANA - Governor Steve Bullock today confirmed four presumptively positive cases of coronavirus, or COVID-19, in Montana. There are four positive cases in the counties of Gallatin,... governor.mt.gov", "2020-03-12T23:26:23.000Z": "Our state is preparing for coronavirus to come to Montana and we will be prepared to respond all along the way.", "2020-03-12T23:26:04.000Z": "Declaring a state of emergency means I can mobilize all available state resources to mitigate the impact of COVID-19 on Montanans. That's why I'm doing so now, before we have a confirmed case in our state. Bullock declares state of emergency in Montana over coronavirus Montana Gov. Steve Bullock on Thursday said he signed an executive order declaring a state of emergency in Montana in response to the coronavirus. helenair.com", "2020-03-12T19:02:42.000Z": "I agree with this approach that takes the necessary precautions to keep students safe and healthy. I have no doubt the Montana University System will continue to provide a quality education to students during this time, while prioritizing the public's health. Quote Tweet Billings Gazette @billingsgazette The entire Montana University System will cancel in-person classes and transition to remote teaching following spring break to prevent the coronavirus spread. https:// billingsgazette.com/news/state-and -regional/mus-all-campuses-to-teach-remotely/article_75cd38e2-03e7-5ac2-bfd9-8702960f261e.html?utm_medium=social&utm_source=twitter_billingsgazette ", "2020-03-11T23:07:10.000Z": "We will continue to monitor the patient in Maryland and remain committed to preparing for coronavirus to reach Montana.", "2020-03-11T23:06:45.000Z": "Earlier today it was announced a Montanan visiting Maryland tested presumptive positive for COVID-19. We can now confirm the patient did not have coronavirus while she was in Montana and has not been in the state since November of last year.", "2020-03-11T19:44:46.000Z": "Lisa and I are sending all our good thoughts and love to the patient.", "2020-03-11T19:43:56.000Z": "Public health officials are working closely with Maryland to confirm case details on when this individual was last in Montana. We are committed to providing Montanans with accurate, transparent information and are working to ensure details will be provided as soon as possible. Quote Tweet Governor Larry Hogan @GovLarryHogan Officials have confirmed that a Montana resident visiting Anne Arundel Co. has tested positive for COVID-19. ***While this will be classified as a Montana case***, @MDHealth and @AAHealth will take the lead on the investigation. Show this thread", "2020-03-11T14:40:31.000Z": "Every student deserves an equal shot at an education. Dual enrollment helps to make that possible, while saving families money on tuition costs. Montana high schoolers can continue to get two free college-credit courses A program that lets high schoolers take two courses that could earn them free college credits will be more than a one-time deal. billingsgazette.com", "2020-03-10T22:45:05.000Z": "The Montana Boy Scouts presented me with their annual Eagle Scout report today. The journey Eagle Scouts take represent one of the core values we share as Montanans: commitment to service. \n\nI have no doubt their great work will benefit this state for generations to come.", "2020-03-08T19:38:01.000Z": "Today is about recognizing the women trailblazers who came before and the many still to come as we fight to ensure equal rights. On #InternationalWomensDay , I'm grateful to all of you and to the most important women in my life.", "2020-03-06T19:11:57.000Z": "Since 2014, Lisa and I have partnered with @nokidhungry to increase access to school breakfast, ensuring that 61% (up from 46%) of Montana's food insecure students have what they need to learn. As #NSBW2020 draws to a close, I'd like to thank the folks who work to make that 100%.", "2020-03-05T16:33:45.000Z": "Our firefighters put their long-term health on the line each day in service to Montanans. I stopped by @Local521 this week to discuss the presumptive illness protections we passed last session and see how firefighters are taking extra steps to stay safe and healthy. @mtproff", "2020-03-04T16:43:59.000Z": "Each year, we participate in the Doorsteps to Kid Packs food drive in Helena. You can help by placing kid-friendly food items on your doorstep today, to be collected by @AmeriCorps members. Thanks for your commitment to ending childhood hunger!\n- The Bullock Family", "2020-03-03T21:47:27.000Z": "Above all, use the same public health prevention measures that are used to prevent influenza. Wash your hands, avoid touching your eyes/nose/mouth, stay home if you are sick, cover your cough/sneeze, and clean and disinfect frequently touched objects and surfaces.", "2020-03-03T21:46:33.000Z": "I urge Montanans to listen to their local public health officials and use reputable sources for information, such as the state's health department website: https:// dphhs.mt.gov", "2020-03-03T21:45:09.000Z": "This is the public health event that Montana practices for. We've conducted similar responses in the past. Looking out for our family, friends and neighbors is what we do. We've been preparing and will continue to address this evolving situation.", "2020-03-03T21:43:10.000Z": "While there are no current diagnosed cases of coronavirus in Montana, we're taking steps to prepare and respond in the event the outbreak reaches our state. Today, I announced the activation of the Governor's Coronavirus Task Force.", "2020-03-03T16:17:29.000Z": "It's National School Breakfast Week! Students who eat school breakfast have increased attentiveness, improved behavior, and higher attendance. It was great to kick off the week helping students in Billings start their day off right.", "2020-03-02T17:48:34.000Z": "Law enforcement is often the first on the scene when responding to a patient in cardiac arrest. We are grateful to the Helmsley Charitable Trust for investing in Montana to help save lives. https:// google.com/amp/s/helenair .com/news/state-and-regional/govt-and-politics/montana-gets-million-to-put-defibrillators-around-the-state/article_3dfacc82-20ec-561c-aca8-6ba16a22063e.amp.html ", "2020-02-28T17:38:05.000Z": "Over a century ago Theodore Roosevelt gave us \"the great central task of leaving this land an even better land.\" In this age of political polarization, our return to shared values and our work to conserve public lands is what we need to chart that path. Protecting public lands: our \"great central task\" Montanans have a special appreciation for our public lands. We know they are our heritage and our birthright. They are also one of our medium.com", "2020-02-27T21:32:02.000Z": "I joined Little Shell Tribe leaders today to discuss the Census. After becoming federally recognized, the Tribe is eligible to be accurately counted for the first time ever and have access to federal dollars for education, health care, and community planning.", "2020-02-27T17:43:42.000Z": "Montana is making progress, thanks to the tireless dedication of professionals and communities, and every life saved makes a difference. We cannot stop until even more lives are saved and until we ensure every Montanan has the support they need. Montana no longer Top 3 in suicides The American Association of Suicidology released its latest report on suicides. Montana seems to be making progress against the public health issue. kxlh.com", "2020-02-26T22:45:44.000Z": "Thanks to the folks @RockiesProject and @WstrnPriorities for being part of the force to protect our public lands, one of America's greatest ideas and greatest treasures (and for inviting me to Colorado to brag about Montana) Quote Tweet Western Priorities @WstrnPriorities NEW PODCAST! An all-star conservation lineup from the @RockiesProject symposium at @ColoradoCollege . https:// westernpriorities.org/2020/02/26/10- years-of-the-conservation-in-the-west-poll/  Show this thread", "2020-02-26T18:44:33.000Z": "We announced the continuation of the One-Two-Free initiative which allows high school students to complete college courses tuition-free & get a jumpstart on their college education. Free dual enrollment courses have already saved families more than $24 million in tuition.", "2020-02-24T20:50:12.000Z": "It couldn't be clearer that the President is choosing to fund his border wall over keeping our citizen soldiers and Airmen safe. I won't stand idly by until Montana's National Guard members are given what they are owed.", "2020-02-24T20:49:36.000Z": "As Commander in Chief of the Montana National Guard, the decision to send our Soldiers and Airmen anywhere is one of the most difficult decisions I make. It's unacceptable to me that we are doing so with outdated aircraft.", "2020-02-24T20:49:12.000Z": "Montana Air National Guard members are currently operating a fleet from 1974, using technology no longer used by airlines. In order to pay for the border wall, the President has announced he is shifting funds that will further delay the modernization of this C-130 aircraft.", "2020-02-21T20:39:27.000Z": "Books or movies? Yes.", "2020-02-21T16:29:08.000Z": "We can also agree that our public lands are under attack by Washington D.C. - facing some of the greatest threats I have seen in my lifetime. We must recommit ourselves to doing everything we can to protect, preserve, and promote our national treasures.", "2020-02-21T16:27:15.000Z": "While we come from all walks of life, we can agree on one thing: America's greatest idea is indeed worth protecting.", "2020-02-21T16:26:24.000Z": "Folks out West have a special appreciation for our public lands, and we know our public lands are our heritage, our birthright, and our great equalizer. Poll: Public land conservation, climate change top Western concerns ~ Missoula Current On Thursday, the Colorado College State of the Rockies Project released the results of its 10th Conservation in the West poll showing that some of the policies of the Trump administration don't align... missoulacurrent.com", "2020-02-19T15:57:11.000Z": "Strong government-to-government relationships benefit Indian Country and all of Montana. Thanks to Little Shell Tribe Chairman Gerald Gray and National Congress of American Indians @PresFawnSharp for joining us for the Tribal Relations Training.", "2020-02-18T16:25:18.000Z": "Kalispell's remarkable RoboScouts are headed to Houston in April to compete in @firstlegoleague . I was so impressed with their skills, and I can't wait to see what they do this year and in twenty years.", "2020-02-14T17:08:28.000Z": "Grateful for my Valentine, today and each and every day.", "2020-02-13T20:42:20.000Z": "I enjoyed a visit to Flathead Valley Community College to chat with students at their Brewing Academy. Montana is a leader in the industry and the college is responding to growing demands to find workers with the right skills. I even got to sample the hazy IPA - I was impressed!", "2020-02-13T15:35:58.000Z": "This tax credit will benefit nearly 75,000 working Montanans and help them provide basics for their families such as groceries and gas, while also investing dollars in our communities to support local economies. State earned income tax credit available for first time Gov. Steve Bullock said Wednesday that nearly 75,000 low- and middle-income Montanans are now eligible for a state earned income tax credit greatfallstribune.com", "2020-02-12T17:55:14.000Z": "We are excited to share the early recommendations of my Montana Climate Solutions Council and encourage the engagement of all Montanans. Our state's efforts to craft home grown solutions will be critical to addressing climate change. Council makes recommendations to address climate change HELENA, Mont. (AP) - A council appointed by Montana Gov. Steve Bullock has released a list of draft recommendations for the state to address climate change, reduce greenhouse gases and take... apnews.com", "2020-02-11T23:08:27.000Z": "These Girl Scouts sure know how to drive a hard bargain. They each had a solid pitch, which means I'm going home with way too many boxes of Thin Mints and Tagalongs.", "2020-02-11T18:25:02.000Z": "I don't want my three kids or yours to be saddled with this Administration's mistakes. Billionaires don't need a tax break, especially when it's bankrolled by the hardworking people of our state and country.", "2020-02-11T18:24:00.000Z": "Cutting farm assistance programs, obliterating health coverage, robbing elderly and disabled Americans of crucial services, sidelining rural America, and slashing the Land and Water Conservation Fund is the opposite of what the President calls \"A Budget for America's Future.\"", "2020-02-11T18:22:38.000Z": "Every budget - from the statehouse to the White House - ought to be a reflection of our values. The President is showing he doesn't share Montana's values by proposing to cut the services that build up our economy and make our state great - all to give his pals a tax break.", "2020-02-08T19:18:58.000Z": "Sarah Rhoads, head of Amazon Air, former fighter pilot and Butte, Montana native, participated in @GovLarryHogan 's panel on modernizing America's infrastructure during @NatlGovsAssoc Winter Meeting. Another example of an incredible Montanan making a profound difference.", "2020-02-07T19:44:09.000Z": "It's always an honor to join other governors in making sure military leaders in Washington give support to citizen soldiers. As the longest serving member on the Council of Governors, I always insist on decisions in the best interest of National Guard members and their families.", "2020-02-07T15:12:58.000Z": "Where I come from, 18 holes is not the same as sleeping under the stars. With Trump's latest attack on our national monuments, he ought to reconsider leaving the comforts of his golf courses to come out west. Opinion | President Trump, come see what makes America great Trump is planning the largest elimination of protected land in our history. washingtonpost.com", "2020-02-06T17:52:20.000Z": "Welcome back @Astro_Christina and congratulations on your record setting flight. Your contributions will support the U.S. in future expeditions and will inspire our future leaders, especially young girls, for generations to come. Way to make Montana proud. Quote Tweet NPR @NPR After setting a record for the longest space flight by a woman, astronaut Christina Koch returned to Earth this morning.\n\nDuring her 328 days at the International Space Station, she contributed to research that will help the U.S. in future expeditions to the moon and Mars.", "2020-02-04T20:29:40.000Z": "I had the honor of swearing in @AmeriCorps members who will serve with Montana Conservation Corps and work to protect our outdoor spaces. Thank you for your spirit and for choosing to serve the Big Sky State.", "2020-02-03T22:00:08.000Z": "In order to solve the many other problems our country faces, we must break the stronghold money in politics has on our democratic institutions. Today, I shared with our future leaders how we can keep fighting for more disclosure and hold elected officials accountable.", "2020-02-02T17:29:53.000Z": "No matter which side you're on - or whether you're just watching for the snacks and commercials - we can all agree that the strength and determination of Montana's Mike Person is something to cheer on and be proud of today. Super Bowl-bound: Glendive's Mike Person, a former Montana State standout, on way to big game with... Person helped the 49ers beat the Packers 37-20 in the NFC Championship game Sunday in Santa Clara, California.", "2020-02-01T19:50:04.000Z": "I am thankful Montana's farmers will be able to access the critical resources they need following a difficult harvest season. 17 counties get natural disaster declaration The U.S. Department of Agriculture granted a secretarial natural disaster designation to 17 counties that requested federal aid after incurring losses caused by multiple disasters during the 2019... greatfallstribune.com", "2020-01-31T21:48:02.000Z": "Democrats should not be connecting the ability to be heard to money. Period.     \n\nDNC did that in setting debate requirements & in removing them. You link money & politics, process gets corrupted. Dems should be rejecting money's influence, not letting it guide our primary.", "2020-01-30T18:52:04.000Z": "Make no mistake, this is just another effort by the Trump administration to gut coverage, drive up costs, and discriminate against patients with costly medical conditions. In Montana, we will keep working to enhance health care, not strip it away. Trump Administration Unveils a Major Shift in Medicaid States will be able to cap a portion of spending for the safety-net program, a change likely to diminish the number of people receiving health benefits through it. nytimes.com", "2020-01-29T21:26:02.000Z": "I'm saddened to hear of the passing of Rep. Dale Mortensen. Lisa and I are sending our thoughts to his colleagues and family. Billings Heights lawmaker Dale Mortensen dies Billings lawmaker Rep. Dale Mortensen has died. billingsgazette.com", "2020-01-27T21:16:30.000Z": "On #HolocaustMemorialDay , we honor both the tragedy of the lives lost and the hope of the lives saved. I ask that we as Montanans stand against antisemitism and other prejudices and commit ourselves to creating a future that holds dignity and respect for all people. #NeverAgain", "2020-01-27T20:08:30.000Z": "I had the honor of speaking to school principals from across Montana on ways we can make an immediate difference in a child's life, including eliminating the academic barrier of hunger by making breakfast more accessible during the school day.", "2020-01-26T01:09:36.000Z": "It's a story that reminds all leaders - current and future - to keep fighting, to get back on our feet and demand better. It reminds us that hope and optimism triumph over defeat, and that what may seem improbable is always achievable.", "2020-01-26T01:08:57.000Z": "The story told of this historic day to the generations that follow us will also be one of tirelessness, of determination, and of a long overdue correction of history.", "2020-01-26T01:07:43.000Z": "There's no better way to start off 2020 than celebrating the victorious end of a 157-year long fight as the Little Shell Tribe finally received federal recognition.", "2020-01-24T16:16:13.000Z": "Service members and their families already sacrifice so much and Lt. Col. Ian McBeth took his call of duty even further. Lisa and I send our condolences to the family and we will always be grateful for Ian's service to our state, our nation and the world. Montana pilot dies in plane crash fighting Australian wildfires A Great Falls pilot died in a plane crash while fighting wildfires in Australia on Wednesday. billingsgazette.com", "2020-01-23T17:27:51.000Z": "Today is a day of mourning and remembrance, but it is also a day of hope. Hope that we can come together to correct the wrongs of the past and create a future that holds dignity and respect for all people. Baker Massacre tragedy remembered 150 years later It was a brutally cold winter 150 years ago when one of the most tragic events in Montana history took place, a tragedy linked to Bozeman. bozemandailychronicle.com", "2020-01-22T18:12:25.000Z": "The U.S Supreme Court just finished hearing arguments in a case that attacks Montana's constitution. Our state was there today to defend public education and the First Amendment - and we will always be there to stand up against attempts to undermine our values as Montanans.", "2020-01-22T16:43:49.000Z": "Less well known about the court's reasoning justifying new corporate spending: It would be accompanied by a vigorous system of campaign finance disclosure. \n\nAmerica's experience since Citizens United has been the opposite. Gov. Steve Bullock: The broken promises of Citizens United 10 years later Few Supreme Court decisions are better known, and less fully understood, than Citizens United. billingsgazette.com", "2020-01-21T15:27:59.000Z": "On the 10th anniversary of Citizens United, we know more than ever that outside spending has been cancerous to our representative democracy. In Montana, we've spent the past decade working to cure the sickness that has plagued politics. Ten Years On, The Broken Promise of Citizens United Few Supreme Court decisions are better known, and less fully understood, than Citizens United. medium.com", "2020-01-21T00:10:57.000Z": "This tragedy impacts the lives of countless others and communities throughout the state. For Selena, we must keep fighting for justice. Body of Selena Not Afraid found within mile of rest stop where she was last seen The body of missing teen Selena Not Afraid was found Monday morning within a mile of the I-90 rest area where she was reported last seen, according to Big Horn billingsgazette.com", "2020-01-20T23:19:03.000Z": "Federal authorities must take this issue seriously and at the state we will continue to work with all partners to bring justice for indigenous women. Quote Tweet Steve Bullock @GovernorBullock More must be done to ensure Native women are safe and our Native communities are listened to. The five bills I signed into law last session addresses, but does not end, this epidemic. https:// nytimes.com/2020/01/20/us/ selena-not-afraid-missing-montana.html?smid=nytcore-ios-share ", "2020-01-20T23:17:58.000Z": "More must be done to ensure Native women are safe and our Native communities are listened to. The five bills I signed into law last session addresses, but does not end, this epidemic. Rural Montana Had Already Lost Too Many Native Women. Then Selena Disappeared. For decades, with little public notice, Native women have gone missing or been found murdered. The search for Selena Not Afraid showed how much things had changed. nytimes.com", "2020-01-20T16:39:20.000Z": "Dr. King embarked on a quest to compel America to live up to the principles of equality & freedom it was founded on by fighting for social & racial justice. It is imperative we recommit to building the community he believed was possible - one of respect, acceptance, compassion.", "2020-01-18T19:08:40.000Z": "To all those who march today, the call to action led by women will continue to uplift the lives of all people. While there are many more hills to climb, celebrate the progress made and continue marching for a tomorrow better than today #WomensMarch2020", "2020-01-16T21:18:39.000Z": "Montana's craft beer industry is thriving. Our growers produce some of the highest quality grain in the world. The new Montana Craft Malt facility in Butte will capitalize on both strengths - putting made in Montana seed to pint glass locally and internationally.", "2020-01-15T23:12:25.000Z": "Livingston is in the top 5 of America's small towns. Visit this link and be sure to vote for #mylivingston until January 21. https:// smallbusinessrevolution.org/small-business -revolution/main-street/livingston-mt/ ", "2020-01-15T23:11:26.000Z": "Where Thomas McGuane puts pen to paper. And as we all know, where Jeff Bridges truly abides.", "2020-01-15T23:11:03.000Z": "Anthony Bourdain described it as \"one of the world's truly great towns in one of its most beautiful places.\"", "2020-01-15T23:10:53.000Z": "It's not just Jimmy Buffett who knows that it's \"rocking and a rolling on a Livingston Saturday night.\"", "2020-01-14T21:40:20.000Z": "As we remember Dr. King's relentless commitment to fostering a community built on justice and equal opportunity, I participated in @AmeriCorps Read for Peace to share with students how they too can make a lasting difference. Thank you Hawthorne Elementary School!", "2020-01-11T16:35:47.000Z": "Iowans and the nation are better off for his decades of meaningful work in ensuring a vibrant democracy, bridging divides in communities, and standing up for rural America. Thank you, Tom.", "2020-01-11T16:34:53.000Z": "Tom has been a hero of mine since I was in my 30's. As I was first shaping my path in public service as an assistant attorney general for the state of Montana, his efforts fighting for consumer protections for the people of Iowa inspired me.", "2020-01-11T16:34:07.000Z": "Today my longtime friend and mentor @AGIowa Tom Miller becomes the longest serving attorney general in the history of the country.", "2020-01-08T19:26:58.000Z": "Montana has a bright future ahead, as evidenced by a visit with our state's future leaders this morning. We had a great discussion on civility in politics, getting dark money out of our elections, and how Montana can continue to be a shining example for the rest of the nation.", "2020-01-07T21:06:46.000Z": "Encouraging the growth of Native American-owned and operated businesses boosts not only the businesses themselves, but also helps strengthen local economies in tribal communities across Montana. Native American businesses in Montana to get $320,000 from grant Funding will support business growth in tribal nations across Montana, including newly federally recognized Little Shell Chippewa Tribe greatfallstribune.com", "2020-01-07T15:21:12.000Z": "Our very own Montanans are answering the call to serve our friends in Australia with bravery and dedication. It is ordinary people doing extraordinary things that keep Montana the Last Best Place and we're all thankful. Firefighters from Montana deploy to help fight wildfires in Australia Nine Montana wildfire personnel are among 44 around the United States that departed on December 30 to help fight the massive Australian wildfires. krtv.com", "2020-01-02T22:19:34.000Z": "This decision is another chapter in Montana's proud, successful history of standing up to out-of-state dark money groups that want to buy our elections. I'll always keep fighting to keep secret, special interests from interfering in our elections. Judge dismisses lawsuit against Bullock A lawsuit over one of Gov. Steve Bullock's hallmark messages on dark money in elections has been dismissed. However, the judge did give the advocacy group the chance to re-file. helenair.com", "2020-01-01T18:32:15.000Z": "Wishing a Happy New Year to all Montanans and good times spent with family and friends - or if you're a dad like me, with teenage kids!", "2019-12-28T17:54:07.000Z": "Congratulations to Christina Koch. We're all cheering you on from back home. Montana astronaut sets record for longest space flight by woman A Livingston resident set a record Saturday for the longest single space flight by a woman. greatfallstribune.com", "2019-12-27T16:34:39.000Z": "As 2019 comes to an end, we're sharing highlights with our fellow Montanans. From strengthening the economy, to investing in education, to improving access to health care, and protecting our lands, it's been a year of getting things done. \n\nCheck it out. 2019 Year in Review Governor Steve Bullock's staff here. As 2019 comes to an end, we wanted to share with our fellow Montanans some of the highlights from the medium.com", "2019-12-25T17:50:57.000Z": "Merry Christmas from the Bullock family, to you and yours.", "2019-12-23T22:36:47.000Z": "There is no excuse for kids to go hungry, yet it happens - every day, in every community. That's why my wife and I continue to partner with schools across Montana to ensure students have access to a healthy breakfast to help them thrive. Governor, First Lady Bullock announce $28,000 in Breakfast After the Bell grants Gov. Steve Bullock and First Lady Lisa Bullock today announced nearly $28,000 in private grant funding to implement the Breakfast After the Bell program in an additional eight Montana schools. sidneyherald.com", "2019-12-23T21:12:21.000Z": "My wife Lisa and I wish everyone celebrating a warm and joyous Chanukah. Thank you for sharing the Festival of Lights with your fellow Montanans. Quote Tweet Lt. Governor Mike Cooney @LtGovMikeCooney The miraculous light has illuminated the way for everyone who fights for what's right, for justice and equality. Happy Chanukah to all those celebrating in Montana.", "2019-12-22T18:43:26.000Z": "As Montanans, public access is our way of life. I'm pleased to see the commitment remains to keeping these lands available for public recreation and we will continue to ask for accountability to ensure it remains that way. Weyerhaeuser Buyer Pledges to Maintain Public Access - Flathead Beacon This week's announcement that Washington-based timber giant Weyerhaeuser was selling its Montana timber portfolio to an undisclosed buyer raised a host of concerns about how the new owner would... flatheadbeacon.com", "2019-12-21T20:00:23.000Z": "Great season, hoping for a great win today #GoCatsGo", "2019-12-21T18:21:41.000Z": "Had a chance to visit the Gibson Guitar factory in Bozeman this week. It was incredible to see the handmade innovation and attention to detail that goes into making each instrument, right here in the great state of Montana.", "2019-12-20T22:52:35.000Z": "Thank you, @SenatorTester , for being here today and every day along the way.", "2019-12-20T22:51:42.000Z": "The flag of the Little Shell Tribe will fly at the Montana State Capitol through tomorrow in honor of the long overdue and hard fought federal recognition. May all Montanans recognize today for the strength, endurance, and tenacity of the Little Shell people.", "2019-12-19T18:36:35.000Z": "A Montana without America's favorite pastime is foul. Quote Tweet Phil Drake @GFTrib_PDrake Governor goes to bat to keep Minor League baseball in Montana. http:// bit.ly/35FvGRW", "2019-12-19T16:21:12.000Z": "Political attacks to undermine health care have real consequences on real lives. This Republican lawsuit jeopardizes care and protections for millions of Americans. It's critical we recognize what is at stake and continue to fight. Individual mandate ruled unconstitutional, ACA in limbo The decision leaves the fate of the rest of the law in limbo, catapulting questions about insurance coverage and consumer protections to the forefront of the 2020 races. washingtonpost.com", "2019-12-18T16:27:02.000Z": "It's no secret Montana is an incredible place to live, work, play and raise a family. The quality of life our state offers is second to none and this plan will address how we can enhance the outdoor recreation assets that sustain our livelihoods. Governor releases plan to preserve, develop outdoor recreation in Montana Gov. Steve Bullock's office released a new plan Tuesday to encourage the protection and development of outdoor recreation in Montana while also retaining the state's eligibility for federal money. bozemandailychronicle.com", "2019-12-17T18:43:04.000Z": "Multiple generations of Little Shell Tribe members have relentlessly advocated for this day and their hard work will finally be realized.", "2019-12-17T18:42:49.000Z": "Federal recognition will provide an opportunity for the Little Shell to strengthen as a sovereign government, uphold its constitutional duties to its members, and continue to foster relationships with the state.", "2019-12-17T18:42:27.000Z": "After a generations-long fight, I join many across our state in celebrating this monumental time as legislation to federally recognize the Little Shell Tribe heads to the President's desk.", "2019-12-16T21:41:13.000Z": "Shopping local keeps dollars in our communities and contributes to vibrant main streets. Thanks to the local, Native-owned Sage & Oats Trading Post for helping me with some of my holiday gift buying.", "2019-12-15T16:14:01.000Z": "Congrats Ty and Haven! Glad to see your hard work and determination pay off. You make Montana proud. National Finals Rodeo: Helena's Ty Erickson, Miles City's Haven Meged win world titles Two Montanans won world titles Saturday night at the National Finals Rodeo. helenair.com", "2019-12-13T23:13:48.000Z": "Western governors sure know how to put partisanship aside and get things done. We had a great meeting today discussing issues ranging from supporting rural communities, to highlighting energy innovations, to educating the workforce of the future.", "2019-12-12T21:46:54.000Z": "Montanans deserve a space that thoroughly exhibits our rich history. I couldn't be more pleased we are closer than ever to a Heritage Center worthy of our heritage. Site chosen in Helena for Montana Heritage Center The new Montana Heritage Center will be built on state-owned land within the Capitol complex at a site long eyed by the project's backers. helenair.com", "2019-12-12T15:48:28.000Z": "The Little Shell Tribe's history and culture is a fabric of our state and their federal recognition is deserving and long-overdue. Thanks, @SenatorTester , for never giving up the fight and seeing this through. Montana tribe's quest for recognition advances in Congress Congress is on the cusp of approving legislation to recognize the state's Little Shell Tribe of Chippewa Indians, Montana's congressional delegation said. helenair.com", "2019-12-10T17:36:34.000Z": "Montana's farmers got dealt a bad hand this harvest with early season storms. I've asked the U.S. Secretary of Agriculture for a prompt review of our disaster designation to help protect the livelihoods of our farmers and rural communities. Governor asks for USDA disaster designation for 11 Montana counties with crop losses Gov. Steve Bullock has now requested a secretarial disaster designation from U.S. Agriculture Secretary Sonny Perdue for 11 Montana counties that reported significant weather-related crop losses in... billingsgazette.com", "2019-12-09T21:15:24.000Z": "There are 120,000 Montanans who attended a Montana University System institution but left before attaining a degree. The Become an Alum initiative is aimed at helping those Montanans to finalize that degree and fill in-demand jobs. Missoula man: Program aimed at college dropouts worked wonders \"There are 120,000 Montanans who attended a Montana University System institution but left before attaining a degree or credential,\" Gov. Steve Bullock said. missoulian.com", "2019-12-08T20:38:05.000Z": "Grateful to spend time with family today on our annual Christmas tree hunt. It's a special time of year in Montana's winter wonderland!", "2019-12-02T11:35:12.000Z": "Today, I'm suspending my campaign for President.\n\nThank you for your belief, your trust, and your support. Read my full statement here: https:// medium.com/@stevebullock/ thank-you-e5c6926bc208 ", "2019-12-01T20:55:38.000Z": "If we can kick Dark Money out of Montana's elections, we can do it across the country. Join us: Steve Bullock for U.S. Senate Join the team → stevebullock.com", "2019-12-01T18:56:12.000Z": "The President and his administration have awarded giant tax giveaways to billionaires, while working to deny food to hungry children and families. Trump's proposed SNAP changes could mean millions lose food stamp access \"SNAP is related to hunger and getting people the nutrition they need,\" one food bank representative said. \"Food shouldn't be a luxury.\" nbcnews.com", "2019-12-01T17:00:58.000Z": "This #WorldAIDSDay we stand with people at home and abroad in the fight against HIV, and to those we've unfortunately lost far too soon. \n\nWe commit ourselves to preventing new infections, treating those with HIV, and working toward a future without AIDS.", "2019-12-01T04:12:01.000Z": "Trump's trade war is costing American jobs. It has to end. Deere workers grapple with fallout from Trump's trade war Devin Spencer has been on edge ever since Deere & Co. laid off dozens of his colleagues at its Harvester Works plant in western Illinois due to dwindling demand for farm combines. reuters.com", "2019-11-30T22:21:00.000Z": "As President, I'll pass a bold new plan that invests in our nation's infrastructure to create jobs, fight climate change, and spur economic growth and opportunity for Americans in every community. Bullock unveils national plans on workers, infrastructure Gov. Steve Bullock unveiled two plans this week; one focusing on infrastructure and the other was one he said would increase rights for working Americans. greatfallstribune.com", "2019-11-30T19:30:00.000Z": "As President, I will propose a 28th amendment to the Constitution to reverse Citizens United.", "2019-11-30T16:57:47.000Z": "Elections are the foundation of our democracy. It's far past time for us to invest in new equipment, poll worker training, and protections for our election systems from both physical and cyber threats. A Pennsylvania County's Election Day Nightmare Underscores Voting Machine Concerns How \"everything went wrong\" in Northampton County. nytimes.com", "2019-11-30T01:53:17.000Z": "It's time we get back to governing and address the challenges Americans face in the here and now. https:// stevebullock.com/fair-shot-agen da/ ", "2019-11-29T20:38:41.000Z": "This election is about more than just Donald Trump.\n\nIt's about the seventh generation farmer who isn't sure if his son can be the eighth. After 240 Years and 7 Generations, Forced to Sell the Family Farm The aging owners of a Catskills farm say it \"has to close so we can survive.\" nytimes.com", "2019-11-29T18:14:54.000Z": "Black Friday sale 25% off all Bullock gear! \n\nBONUS: extra 40% off if you use the code: BLACKFRIDAY http:// stevebullock.com/store", "2019-11-29T03:10:00.000Z": "Talk about an early Black Friday special? \n\nOn our campaign donations up to $250 will be MATCHED - dollar for dollar. Don't miss your chance to double your impact. Chip in now: Donate now → Help Steve Bullock Steve Bullock needs your help to win the Democratic nomination and defeat Donald Trump. secure.actblue.com", "2019-11-28T22:54:00.000Z": "Who is ready for some Thanksgiving Dad Jokes?", "2019-11-28T17:09:00.000Z": "Some news to be thankful for today: 9 charts to be thankful for this Thanksgiving It's not all bad news - life expectancy and literacy are up, and global poverty is down. vox.com", "2019-11-28T15:46:36.000Z": "Happy Thanksgiving! What's the best song to listen to while cooking a Turkey? \n\nWatch to find out!", "2019-11-28T05:11:00.000Z": "It's time we make sure every American gets a fair shot at a better life. Chip in a buck: http:// SteveBullock.com/donate", "2019-11-28T03:35:00.000Z": "A lot to be grateful for this Thanksgiving! Thanks to God's Love Shelter in Helena for serving up some meals today.", "2019-11-28T02:10:00.000Z": "Here's my plan: Double federal investment in K-12 Oppose vouchers and the privatization of public schools Remove Betsy DeVos How Steve Bullock would boost K-12 school spending and make community college free He proposed giving tax credits to employers who help their employees pay off student debt. politico.com", "2019-11-28T00:03:00.000Z": "Getting Dark Money out of politics is the fight of our time. I've made it the fight of my career. You bet I'll make it the defining issue of my Presidency.", "2019-11-27T22:31:00.000Z": "Americans shouldn't have to decide between life-saving drugs or a pile of debt. It's time we treat healthcare as a right, not a privilege. 1 in 8 Americans can't afford their heart disease drugs High costs and inadequate insurance are stopping millions from taking their medication, American Heart Association says. cbsnews.com", "2019-11-27T20:45:00.000Z": "Our public lands belong to us.", "2019-11-27T19:04:00.000Z": "It's time we have a leader who will work for all Americans no matter who you are or who you love. Federal Workers Are \"Afraid\" After Trump's Anti-LGBTQ Crusade At The Supreme Court LGBTQ workers at the Justice Department fear they'll get fired, they said in a recent letter to Attorney General Bill Barr. buzzfeednews.com", "2019-11-27T17:16:00.000Z": "Whether at the ballot box or after the impeachment process, we must move forward, restore integrity to the Oval Office, and heal the divisions across our country.", "2019-11-27T15:02:00.000Z": "We don't have time to wait. We must take immediate and durable steps to address climate change. In bleak report, U.N. says drastic action is only way to avoid worst effects of climate change washingtonpost.com", "2019-11-27T11:54:47.000Z": "We can't ignore the warning signs. If we don't win back the places we lost, then Trump will win. \n\nAs the only candidate who's actually won a Trump state, I can tell you we need to connect w/ these voters if we're ever going to win back the White House. They Voted Democratic. Now They Support Trump. Two-thirds of battleground state voters who chose Trump in 2016 but selected Democrats in the midterms say they will return to the president next year. nytimes.com", "2019-11-27T04:45:00.000Z": "We don't accept a dime from PACs, because our campaign isn't about them. It's about you. http:// SteveBullock.com/donate", "2019-11-27T02:33:00.000Z": "\"Mexico is going to pay for the wall.\" \n\n\"China is going to pay for the tariffs.\"\n\nWhen it's all said and done, Trump is sticking us with the bill. Americans, not Chinese, pay Trump tariffs: NY Fed study When the Trump administration imposed tariffs on Chinese imports last year, officials insisted China would pay the cost - implying Chinese firms would have to cut their prices to absorb import... reuters.com", "2019-11-26T22:29:00.000Z": "This election is about more than just Donald Trump.\n\nIt's about the sixth generation farmer who told me he wasn't sure if his son should be the seventh.", "2019-11-26T20:45:00.000Z": "We're going to make Donald Trump a one-term President. \n\nJoin us: http:// stevebullock.com/donate", "2019-11-26T19:26:00.000Z": "This is the most important election of our lifetime.", "2019-11-26T18:35:00.000Z": "I'm running for President to get stuff done - and I have a plan and the progressive record to do it.", "2019-11-26T17:17:23.000Z": "If we want a strong middle class, we need strong unions. I've spent my whole career fighting for workers' rights and I'll do the same as President. http:// stevebullock.com/labor-rights/", "2019-11-26T16:00:01.000Z": "We're kicking off our Black Friday sale early: \n\n25% off all gear! https:// stevebullock.com/store", "2019-11-26T15:03:49.000Z": "If Lindsey Graham wants to carry Trump's baggage, let's make him do it as his caddie, not a Senator.", "2019-11-26T04:30:00.000Z": "Together we can kick Dark Money out of our elections once and for all. The biggest threat to Citizens United The Montana AG explains why his state\\'s challenge to the controversial decision could hold up in the Supreme Court salon.com", "2019-11-26T02:30:00.000Z": "Dark Money.\nBig Money. \nSuperPACs.\n\nHere's how we get rid of them: http:// SteveBullock.com/democracy", "2019-11-26T01:15:00.000Z": "We need to take immediate and durable steps to tackle climate change. Here's how: http:// SteveBullock.com/climate-change", "2019-11-26T00:40:08.000Z": "\"An attack on public lands anywhere is an attack on public lands everywhere, and it flies in the face of who we are as a nation.\" @GovernorBullock  #AFTvotes Opinion | President Trump, come see what makes America great Trump is planning the largest elimination of protected land in our history. washingtonpost.com", "2019-11-26T00:45:00.000Z": "It's time we make sure every child has access to Pre-K. https:// stevebullock.com/public-educati on/ ", "2019-11-26T00:31:23.000Z": "If Democrats are serious about winning, we should listen to @JohnBelforLA and @AndyBeshearKY : \n\nGo everywhere, speak with everyone, and focus on real solutions - not pie-in-the-sky plans. Opinion | How Democrats can win, everywhere We urge Democrats to focus on, care about and invest more in state races, and to see our victories as blueprints for winning across the country. washingtonpost.com", "2019-11-25T21:45:00.000Z": "Farmers are filing for bankruptcy while Donald Trump gives tax breaks to the wealthy and corporations. Farm bankruptcies jump to highest level since 2011 as Trump's tariffs bite A tit-for-tat tariff dispute between the Trump administration and China has piled on pressure in an already strained Farm Belt. Between January ... markets.businessinsider.com", "2019-11-25T20:45:00.000Z": "Let's keep public lands public. https:// stevebullock.com/public-lands/", "2019-11-25T19:56:00.000Z": "No SuperPACS, just people. \n\nJoin us: http:// SteveBullock.com/donate", "2019-11-25T18:40:00.000Z": "Here's how we make sure Rural America doesn't just get by, but thrives: https:// bit.ly/2QOVoyT", "2019-11-25T17:00:40.000Z": "Good education.\nGood job.\nGood salary.\nGood benefits. \nA dignified retirement. \n\nWe don't need pie in the sky ideas, we just need to make sure everyone gets a fair shot at achieving the American Dream. https:// stevebullock.com/fair-shot-agen da/ ", "2019-11-25T14:48:33.000Z": "Homes are underwater and we still can't get GOP leaders to admit that climate change is real. 82 Days Underwater: The Tide Is High, but They're Holding On A brutal \"king tides\" season made worse by climate change has flooded the streets of a Florida Keys community for nearly three months. nytimes.com", "2019-11-25T04:15:00.000Z": "No SuperPACs.\nNo Big Money.\nNo Billionaires. \n\nJust us. http:// SteveBullock.com/donate", "2019-11-25T02:33:00.000Z": "I'm a progressive - emphasis on progress. I'm in this fight to make sure everyone has a fair shot at a better life.", "2019-11-24T23:39:25.000Z": "I've been fortunate to have so many Bullock supporters help me with phone calls and doorknocking, but this is a whole new level of excitement @GovernorBullock in Iowa! Tastes as good as it looks! #TeamBullock", "2019-11-25T01:33:00.000Z": "Our democracy shouldn't work for PACs or Putin.\n\nIt should work for us. http:// SteveBullock.com/democracy", "2019-11-24T23:27:00.000Z": "The use of torture harms our reputation for upholding human rights around the globe and fails to keep us safe. \n\nAs President, I will defend American values and oppose torture. Dem Candidates Should Commit to Act on Torture Report | RealClearPolitics Nearly five years after the world learned in brutal detail how our nation tortured detainees, the candidates for president have an opportunity to do what Donald Trump, Barack Obama, and George W.... realclearpolitics.com", "2019-11-24T22:08:00.000Z": "Farmers don't want another bailout - they want their markets back\n\nThis President is decimating American pocketbooks with no plan to fix it. Trump's farm bailout has cost taxpayers more than double the auto bailout The U.S. government has been making direct payments to farmers for a long time. But the size of those payments is growing rapidly. freep.com", "2019-11-24T20:07:00.000Z": "Our public lands make our country great and, unlike @realDonaldTrump , I'll fight to protect them for future generations. Opinion | President Trump, come see what makes America great Trump is planning the largest elimination of protected land in our history. washingtonpost.com", "2019-11-24T19:45:00.000Z": "I'm the only sitting Governor in the race and the only candidate who's won a Trump state.\n\nIf you believe that perspective should be in this race, donate now: https:// stevebullock.com/donate", "2019-11-24T18:45:00.000Z": "FYI:\n\n50k vs. 1 Million vs. 1 Billion vs. Bloomberg", "2019-11-24T18:11:08.000Z": "Let me tell you what we don't need: another billionaire buying his way into this election.", "2019-11-24T16:47:00.000Z": "Get your sticker here: https:// bit.ly/2XFUpm1", "2019-11-24T14:19:00.000Z": "Every year, over 40 million American adults will experience a mental illness, yet over half of those who have an illness don't receive treatment. That's unacceptable. We must do better. http:// SteveBullock.com/mental-health", "2019-11-24T13:05:00.000Z": "Before we can seriously address any of the big issues we face - from healthcare to income inequality - we have to take on Big Money in our politics. \n\nAnd that means reversing Citizens United.", "2019-11-24T01:15:07.000Z": "Change starts with showing up. Join us: http:// SteveBullock.com/donate", "2019-11-23T23:10:08.000Z": "Fighting Dark Money has been the fight of my career, via @POTUSPressPool .", "2019-11-23T18:11:14.000Z": "Less than an hour until the the big game! Who do you got? Cats 38.6% Griz", "2019-11-23T15:45:57.000Z": "One of the most pristine areas on the planet could be practically gifted to energy companies. New Trump administration plan could boost oil drilling on remote Alaska reserve One scenario would allow development on lake that shelters tens of thousands of migrating caribou and birds. washingtonpost.com", "2019-11-23T02:38:00.000Z": "We must get rid of Big Money.", "2019-11-23T00:02:37.000Z": "\"We've already seen a billionaire buy his way onto the debate stage. Now, an even bigger billionaire wants to buy his way to the nomination by completely ignoring voters in the first primaries and caucuses,\" @GovernorBullock says in email. \"The Democratic primary isn't for sale.\"", "2019-11-22T22:37:00.000Z": "What did we find out while making our voter guide on the presidential candidates? @GovernorBullock says \"we need to say that this is a climate crisis, but let's actually create this as a climate opportunity\"", "2019-11-22T22:21:16.000Z": "We pay more for healthcare than any other industrialized nation - with nothing to show for it. \n\nIf we're going to take on the biggest crises of our time, we have to tackle the corrupting influence of money in politics head-on. https:// stevebullock.com/healthcare/", "2019-11-22T20:21:00.000Z": "It's time we have a 28th amendment to the Constitution:\n\nReverse Citizens United.", "2019-11-22T19:00:00.000Z": "\"I am a Southern rural Democrat You would be Donald Trump's worst nightmare.\" - Miller from Tennessee, via @POTUSPressPool", "2019-11-22T17:15:00.000Z": "Countless families are living in trailers outside of their homes, damaged by historic floods.\nGenerations of farming communities are at risk - and the Trump administration is only making things worse. A Wet Year Causes Farm Woes Far Beyond the Floodplains Last year was the wettest on record for the United States and flooded towns got much attention in the spring, but farm statistics show longer-lasting effects. nytimes.com", "2019-11-22T16:43:55.000Z": "Swell. Another Billionaire who thinks the Democratic nomination is for sale. Mike Bloomberg Aiming to Launch TV Ads on Monday (EXCLUSIVE) Mike Bloomberg's team is in the process of reserving ad time in the Super Tuesday states. variety.com", "2019-11-22T15:58:30.000Z": ". @realDonaldTrump 's border wall would cost nearly $70 billion.\n\nFor that same cost we could bring high-speed internet to every school, hospital, and community in rural America.\n\nLet's build 21st century bridges, not 18th century walls.", "2019-11-22T01:17:00.000Z": "The @NRA doesn't just own Congress. \n\nThey own the White House. \n\nOn Election Day, we take it all back.", "2019-11-22T00:06:17.000Z": "It's far past time we:", "2019-11-21T20:54:07.000Z": "Health care is a right not a privilege and as President I will treat it as one. https:// stevebullock.com/healthcare", "2019-11-21T19:27:37.000Z": "Donald Trump is still profiting off the presidency... and we're paying for it. Quote Tweet David Fahrenthold @Fahrenthold NEW: The Secret Service spent $250K at @realdonaldtrump 's properties in his first 5 months in office -- paying POTUS's business ***$2,000 a day*** in taxpayer funds, new documents show. https:// washingtonpost.com/politics/secre t-service-spent-quarter-of-a-million-dollars-at-trumps-properties-in-first-five-months-of-his-term-records-show/2019/11/21/ea66d588-0c80-11ea-8397-a955cd542d00_story.html ", "2019-11-21T18:30:45.000Z": "I didn't enter the race until I was able to guarantee Medicaid expansion to one and ten Montanans. \n\nThis is why we need to treat health care as a right. Florida's refusal to expand Medicaid cost 2,800 deaths, report says According to a report by the Center on Budget and Policy Priorities, Florida likely suffered the second-highest total of deaths in that time period - 2,776 - attributed to not expanding Medicaid,... tampabay.com", "2019-11-21T16:55:35.000Z": "A company worth $900 billion shouldn't obstruct their employee's ability to make a living wage. Google Hires Firm Known for Anti-Union Efforts After nearly two years of unrest, the company appears to be cracking down on employee activism. nytimes.com", "2019-11-21T05:30:00.000Z": "Here's my pitch:", "2019-11-21T04:59:18.000Z": "Missing from tonight's #DemDebate was any meaningful discussion on how we're going to win back the places we lost in '16. In the last two weeks, our Party has won big races in deep-red states by going everywhere & focusing on serious solutions that impact Americans' daily lives.", "2019-11-21T03:16:22.000Z": "On my first call with Vladimir Putin I'd say: \"There's a new sheriff in town.\" #DemDebate", "2019-11-20T16:48:08.000Z": "New @GovernorBullock ad: \"As a sitting president, Donald Trump can't be prosecuted. And the truth is, if he's re-elected he never will be...I won't promise to lock up my opponent, but...after I beat Trump I'll empower prosecutors the follow the evidence all the way to the top.\"", "2019-11-21T01:45:44.000Z": "Over the last two weeks, Democrats have achieved major victories in deep red states by sticking to the playbook that won us 40 House seats in 2018 - show up everywhere and focus on serious solutions to the problems people face in their daily lives. #DemDebate", "2019-11-21T01:45:43.000Z": "While candidates bicker on stage about pie in the sky ideas, I will continue taking my case directly to voters on the ground. That's how I've been elected 3 times in a state Trump won by 20. We can't lose sight of political reality, otherwise we'll never beat Trump. #DemDebate", "2019-11-21T00:30:00.000Z": "For the sake of our nation, this inquiry has to move forward swiftly and judiciously. Montana Governor Says Impeachment Inquiry Must Go Forward Montana Governor Steve Bullock, a Democrat and 2020 presidential candidate, talks about the race. He also talks about health care and the impeachment inquiry of President Donald Trump. He appears on... bloomberg.com", "2019-11-20T23:39:00.000Z": "Whether he's removed by ballot box or impeachment, we have to bridge divides, stop the chaos, and get this country back on track.", "2019-11-20T22:45:00.000Z": "This race is going to be decided by you, the voters - not the Big Money donors and party bosses.", "2019-11-20T21:58:57.000Z": "After hearing from EU Ambassador Sondland this morning it's clear: the President and his cabinet tried to extort a foreign leader into investigating a political opponent. \n\nThe House must move swiftly and judiciously.", "2019-11-20T21:26:29.000Z": "As the only candidate who's actually won a Trump state, I can tell you we need to connect with these voters if we're ever going to win back the White House. 2/2", "2019-11-20T21:26:28.000Z": "We can't ignore the warning signs any longer. Democrats can run up the score all we want in places like Massachusetts and California. But if we don't win back the places we lost, then Trump will win. 1/2 Quote Tweet The Hill @thehill NEW POLL: Trump leads Biden, Sanders, Warren and Buttigieg in Wisconsin http:// hill.cm/xhFN1oL", "2019-11-20T20:59:34.000Z": "Give me a break. This President doesn't care about corruption in his administration. He doesn't care about corruption abroad. \n\nHe only cares about himself and his bottom line. Trump Defenders Portray Him As A Corruption Fighter, Only  He's Not If anything, Trump has increased corruption because his self-dealing makes it impossible for the U.S. to demand clean government overseas, critics say. huffpost.com", "2019-11-20T20:30:00.000Z": "This week we celebrate the transgender community and recommit ourselves to ensuring that no one faces violence or discrimination because of who they are. #TransWeek  #TDOR", "2019-11-20T20:06:00.000Z": "We empower the President to speak on our behalf to foreign countries - you can't use that for your own personal gain.", "2019-11-20T19:30:00.000Z": "I believe that health care is a right for all, and the best way to achieve that is to build on the progress of Obamacare - not dismantle it.", "2019-11-20T18:46:48.000Z": "The Art of the Deal: Quid Pro Quo Edition", "2019-11-20T17:22:29.000Z": "You bet! Fact Checker: Is Steve Bullock the only Democratic presidential candidate to have won in a Trump... Montana Gov. Steve Bullock, a Democratic presidential candidate, on Nov. 6 announced two new TV ads running in Iowa. In the 30-second 'Responsibility' ad, Iowa Attorney General Tom Miller says he's... thegazette.com", "2019-11-20T14:07:22.000Z": "Diversity makes us stronger, and I will never stop fighting for those who embody the best of our American values. Together we can bridge our divides and get our country back on track. The Divide in Yakima Is the Divide in America What the changing demographics of this country look like up close. nytimes.com", "2019-11-20T01:39:00.000Z": "As Democrats, we win when we offer something better. When we show up, listen, and focus on the challenges Americans face everyday. Presidential Candidate Steve Bullock Wraps up 16th Trip to Iowa DES MOINES, Iowa - Presidential candidate Steve Bullock was back in Des Moines for his 16th trip to Iowa. The Montana governor spoke at a packed house party hosted by Suzette Jensen, the co-chair o who13.com", "2019-11-20T00:03:00.000Z": "Let's not forget that Trump ran a fraudulent for-profit \"university\" that stole millions from students. \n\nNow his administration continues to put private profit over our kids' futures. Betsy DeVos And The High-Stakes Standoff Over Student Loan Forgiveness The Education Department narrowly avoids a subpoena in a fight with House Democrats over forgiving the loans of defrauded student borrowers. npr.org", "2019-11-19T22:47:00.000Z": "For those keeping score at home. \n\nGet your t-shirt now: https:// shop.stevebullock.com/collections/ap parel/products/mueller-t-shirt ", "2019-11-19T20:15:00.000Z": "A few of the benefits billionaires get when you donate to President Trump and his allies:\n\n1. Access\n2. Tweets\n3. Tax breaks\n4. Cabinet positions\n5. Ambassadorships\n\nThis President is swamping the drain, not draining the swamp. Possible pay-to-play scheme for ambassador role in Trump administration uncovered by CBS News Emails obtained by CBS News show Trump's nominee for ambassador to the Bahamas was asked by the RNC to donate half a million dollars as his confirmation in the Senate hung in the balance cbsnews.com", "2019-11-19T18:45:44.000Z": "You either think it's OK that the President used his office to try to bribe a foreign leader into investigating a political opponent, or you don't.", "2019-11-19T18:08:46.000Z": "Emmetsburg's cellulosic ethanol plant was the first-of-its-kind and sprung an entire community to new heights. Now, all that could be over - because Trump puts his priorities first.\n\nIowans aren't pieces in a political game. It's time they have a President who fights for them. Quote Tweet donnelle eller @DonnelleE Poet will 'pause production' at its Iowa plant that makes ethanol from corn cobs, husks https:// desmoinesregister.com/story/money/ag riculture/2019/11/19/poet-pauses-production-ethanol-made-corn-cobs-husks-iowa/4233586002/  via @DMRegister", "2019-11-19T17:48:00.000Z": "Jefferson County flipped from Obama to Trump by 17% in 2016.\n\nIf we don't win these places back we won't win this election. Governor Bullock visits Fairfield for Meet and Greet Montana governor and democratic candidate for the 2020 presidential election Steve Bullock stopped in Fairfield, Iowa, on Monday for a meet and greet. One point of emphasis was that he believes he... ktvo.com", "2019-11-19T16:47:00.000Z": "When we bring forward meaningful, progressive solutions to the challenges in peoples' daily lives, we win - and Donald Trump knows it. Bullock: U.S. can get affordable health care, college education without 'pie in the sky' ideas Bullock: U.S. can get affordable health care, college education without 'pie in the sky' ideas desmoinesregister.com", "2019-11-19T15:45:26.000Z": "The victories for @JohnBelforLA & @AndyBeshearKY over the last two weeks prove that when we focus on serious solutions to the challenges that families face, not pie-in-the-sky proposals, we win.\n\nIt's a clear path forward - and a warning to Democrats. John Bel Edwards' win in Louisiana shows Democrats the way forward | Steve C Bullock Red-state Democrats like me, Edwards and Andy Beshear know that defeating Trump requires serious policy solutions, not pie-in-the-sky proposals theguardian.com", "2019-11-19T14:45:00.000Z": "I won three elections in a red state by showing up, listening, and making sure everyone gets a fair shot at a better life. That's the type of leadership I'll bring to the White House. Presidential Candidate Steve Bullock Wraps up 16th Trip to Iowa DES MOINES, Iowa - Presidential candidate Steve Bullock was back in Des Moines for his 16th trip to Iowa. The Montana governor spoke at a packed house party hosted by Suzette Jensen, the co-chair o who13.com", "2019-11-19T13:09:00.000Z": "It's not rocket science:", "2019-11-19T10:59:00.000Z": "Today we're releasing a new TV ad to remind everyone that no one - including the President of the United States - is above the law.", "2019-11-19T04:32:00.000Z": "This is what happens when we have an incompetent mobster in the Oval Office. Trump Is Fighting So Many Legal Battles, It's Hard to Keep Track President Trump faces perhaps more significant challenges with more consequences to his presidency than any modern occupant of the Oval Office has confronted at one time. nytimes.com", "2019-11-19T03:16:00.000Z": "I'm a pro-choice, pro-union, populist Democrat who's won three elections in a red state - not by compromising our values - but by fighting like hell to deliver results.\n\nSo you bet I stand by this statement.", "2019-11-19T01:45:00.000Z": "Thank you Fort Madison! Together we'll win back the places we lost and get our country back on track. Join us: http:// SteveBullock.com", "2019-11-19T00:48:00.000Z": "The stigma around mental health has discouraged too many from seeking help, while a lack of access to quality care has blocked too many more from the treatment they need.\n\nIt's time for that to change. Here's how we can do it: http:// SteveBullock.com/mental-health", "2019-11-18T23:25:00.000Z": "It's time for us to treat mental health care for what it is: healthcare. \n\nAs President, I'll make sure mental health options are available to every American. http:// SteveBullock.com/mental-health", "2019-11-18T22:23:00.000Z": "Where I come from, 18 holes might be relaxing, but it's not the same as sleeping under the stars, watching a herd of elk at 5:30am, or feeling the tug of a trout on your line.\n\nThat's why we're going to keep #publiclands in public hands. Opinion | President Trump, come see what makes America great Trump is planning the largest elimination of protected land in our history. washingtonpost.com", "2019-11-18T16:36:18.000Z": "Presidential candidate Steve Bullock was back in Des Moines for his 16th trip to Iowa.​ Presidential Candidate Steve Bullock Wraps up 16th Trip to Iowa DES MOINES, Iowa - Presidential candidate Steve Bullock was back in Des Moines for his 16th trip to Iowa. The Montana governor spoke at a packed house party hosted by Suzette Jensen, the co-chair o who13.com", "2019-11-18T21:17:00.000Z": "This is what we're fighting for:", "2019-11-18T19:44:35.000Z": "Public health isn't partisan. No poll should ever dictate whether we act to save lives. Quote Tweet The New York Times @nytimes President Trump has reversed course on his plan to ban most flavored e-cigarettes, delaying a policy that was meant to curb vaping by teenagers after warnings from political advisors and lobbyists that it could hurt his popularity with supporters https:// nyti.ms/2qsyzpV", "2019-11-18T18:24:39.000Z": "Thanks for the welcome Fairfield! \n\nTogether we can win this election and give everyone a fair shot at a better life. #IACaucus", "2019-11-18T16:55:26.000Z": "The Donald Trump economy:\n\nGreat for the wealthy and corporations. \nBad for everyone else. How FedEx Cut Its Tax Bill to $0 The company, like much of corporate America, has not made good on its promised investment surge from President Trump's 2017 tax cuts. nytimes.com", "2019-11-18T14:40:04.000Z": "Every year, over 40 million American adults will experience a mental illness. \n\nBut over half of those who have an illness don't receive treatment. \n\nThat's unacceptable and we must do better.", "2019-11-18T03:07:00.000Z": "We fought Dark Money - and we won. If we can do that in Montana, we can do that nationwide.", "2019-11-18T00:45:00.000Z": "When mass shootings have become a common occurrence- it's past time for action. \n\nIt's time we take on the @NRA .", "2019-11-17T21:35:00.000Z": "One of the GOP's top strategists said that our campaign gives \"Republican campaign managers the biggest heart attack.\"", "2019-11-17T20:13:00.000Z": "If we don't take back the places we lost in 2016, Trump will win. We can't lose sight of that. That's why we're gathering in Fort Madison tomorrow, part of a county that voted Obama-Obama-Trump.\n\nJoin us and help take it back! https:// mobilize.us/bullock/event/ 152812/ ", "2019-11-17T19:05:00.000Z": "Never forget that when we talk about expanding healthcare, we're talking about the lives of real folks across our country. Why Democrats are winning on health care Democratic candidates won in Kentucky and Virginia because they made health care a centerpiece of their campaigns. thehill.com", "2019-11-17T16:45:00.000Z": "Expanded healthcare to nearly one in ten Montanans Passed the most progressive anti-Dark Money law in the country Record investments in public education\n\nIf we can do it in Montana, we can do it everywhere.", "2019-11-17T14:50:00.000Z": "When we talk about issues that matter to Americans' everyday lives, we win - and Donald Trump knows it. Join us tomorrow in Fairfield and let's get it done: https:// mobilize.us/bullock/event/ 152807/ ", "2019-11-17T13:30:00.000Z": "See you on the road! #IACaucus Steve Bullock to tour SE Iowa Presidential candidate Steve Bullock will visit southeast Iowa Monday for his \"State of the White House\" tour. Bullock, who has served as governor of Montana 2013 and is the only presidential... thehawkeye.com", "2019-11-17T04:00:03.000Z": "Democrats have won huge elections in the last two weeks by focusing on the challenges that people face in their daily lives. If we ignore these lessons, we're going to lose in 2020, and Donald Trump will get four more years in the Oval Office. 2/3", "2019-11-17T04:00:02.000Z": "Congratulations to @JohnBelforLA and Louisiana Democrats on their victory. \n\nTonight's win is proof that we don't have to just be a party of the coasts. If we work hard and show up - we can win everywhere. 1/3 Quote Tweet The Associated Press @AP BREAKING: Louisiana's John Bel Edwards stuns GOP, wins reelection to a second term as the Deep South's only Democratic governor.", "2019-11-17T03:07:00.000Z": "This isn't just about defeating Donald Trump - it's about returning to the task of building that more perfect union. \n\nWe have to bridge divides not only to win, but to govern. 2020 candidate Steve Bullock: I am running to beat Donald Trump and... Montana Gov. Steve Bullock met recently with USA TODAY's Editorial Board to discuss his 2020 campaign, impeachment and the Democratic debates. news.yahoo.com", "2019-11-17T01:25:00.000Z": "Washington is broken - and it's going to stay that way until we get Dark Money and SuperPACs out of our politics.\n\nLINK: https:// stevebullock.com/democracy/", "2019-11-16T23:58:22.000Z": "Together we can build on the progress of Barack Obama, not tear it down. Obama Says Average American Doesn't Want to 'Tear Down System' Former President Barack Obama, in an address to liberal donors, warned candidates not to go too far left and sought to calm those who were concerned about the state of the Democratic primary. nytimes.com", "2019-11-16T23:30:00.000Z": "We know how to win the election.\nWe just have to show up, listen, and fight for our shared values. That's how we win back places we lost. Join us tomorrow in Grinnell at 5:30pm CT: https:// mobilize.us/bullock/event/ 152804/   #IACaucus", "2019-11-16T22:01:00.000Z": "Donald Trump's political team:", "2019-11-16T20:52:00.000Z": "No SuperPACs. Just people. \n\nJoin us: Steve Bullock for U.S. Senate Join the team → stevebullock.com", "2019-11-16T19:45:00.000Z": "This President degrades our diplomats abroad.\nThis President isolates us from our allies.\nThis President erodes our credibility. \nThis President makes us less safe. Yovanovitch gives dire warning of the degradation of the State Department under Trump During Friday's public impeachment hearing, former U.S. Amb. Marie Yovanovitch warns that the US State Department and U.S. diplomats are being undermined from within, and the State Department... msnbc.com", "2019-11-16T18:41:09.000Z": "After losing their first match, Helena High clawed back over four matches to make it all the way to the State Championship game. \n\nSuper proud of @c_g_bullock and the entire team! #GoBengals", "2019-11-16T18:30:31.000Z": "It's time we make sure that everyone gets a fair shot at a better life, no matter where you are or where you come from. \n\nJoin us tomorrow for a Meet & Greet in Des Moines at 3pm CT! https:// mobilize.us/bullock/event/ 152801/   #IACaucus", "2019-11-16T16:31:00.000Z": "When you show up and listen, it's easy to realize that there's more that unites us than divides us.", "2019-11-16T14:12:05.000Z": "It's been two weeks. Still true: Bullock says Giuliani should be 'behind bars' Montana Gov. Steve Bullock (D), a 2020 presidential candidate, said Wednesday that President Trump's personal lawyer Rudy Giuliani should be \"behind bars\" over his dealings with Ukraine. thehill.com", "2019-11-16T02:43:00.000Z": "We empower the President to speak on our behalf to foreign countries - you can't use that for your own personal gain.", "2019-11-16T00:25:00.000Z": "\"I'm supporting Gov. Bullock because of the bipartisan success he has achieved as a Democratic Governor in a red state.\" Eric Van Lancker, Clinton County Advisor. https:// bit.ly/33NrXRk", "2019-11-15T22:45:00.000Z": "Trump. \n\nPence. \n\nNo matter who is on the ballot come November 2020, let's make sure we keep them to one-term.", "2019-11-15T21:22:25.000Z": "What we heard today makes it more clear that the President abused his office and jeopardized our national security for his own personal gain. \n\nOur democracy is at stake.", "2019-11-15T19:26:11.000Z": "Look good for your perp walk: https:// shop.stevebullock.com/collections/ap parel/products/mueller-t-shirt ", "2019-11-15T19:09:24.000Z": "Good. Now do Rudy. Quote Tweet MSNBC @MSNBC BREAKING: Former Trump adviser Roger Stone found guilty on all 7 counts. https:// on.msnbc.com/354Fhkv Show this thread", "2019-11-15T18:33:00.000Z": "We have to take immediate and durable action to combat climate change- and that starts with taking on the corrupting influence of money in our elections. Quote Tweet EDF Action @EDFaction Do you know what @GovernorBullock favorite national park is or outside escape? Well as part of our presidential candidate voter guide we found out!", "2019-11-15T18:02:40.000Z": "If Trump pardons Roger Stone, it should be considered as another count in the impeachment proceedings. Abuse of power cannot provide shelter for lawlessness.", "2019-11-15T17:45:00.000Z": "Take a break from impeachment to just remember that this administration gives tax breaks to millionaires and rips away food from hungry children. Activists Protest USDA Changes That Threaten Free School Lunch Activists delivered a petition with 1.5 million signatures to the agency in an effort to stop a rule change that would end automatic enrollment in free school lunch for nearly 1 million kids. npr.org", "2019-11-15T16:04:10.000Z": "Now that the RNC is buying up rooms at a Trump resort, here's a throwback to the time the White House chief of staff went on national TV to promote Trump's business.", "2019-11-15T13:35:09.000Z": "As President, I will protect patient privacy and keep Big Tech in check. Quote Tweet CNN Breaking News @cnnbrk A federal inquiry has been opened into Google's efforts to collect health data on millions of Americans through its \"Project Nightingale\" program, officials announce https:// cnn.it/36Wfhtz", "2019-11-15T12:41:00.000Z": "Let's get rid of Dark Money.", "2019-11-15T04:26:00.000Z": "We can get Big Money out of politics.", "2019-11-15T02:45:00.000Z": "Trump has spent his presidency laser focused on helping the wealthy and big corporations. \n\nNot working families.", "2019-11-15T01:38:00.000Z": "Our nation is founded on the basic idea that every voice matters. Yet too often it's those who cut the biggest checks who wield the most influence. Together, we can change that. \n\nJoin us: Steve Bullock for U.S. Senate Join the team → stevebullock.com", "2019-11-15T01:06:16.000Z": "Release. Your. Tax. Returns. Quote Tweet The New York Times @nytimes Breaking News: President Trump asked the U.S. Supreme Court to bar the release of his tax returns. The case could yield a major ruling on presidential immunity. https:// nyti.ms/3504a0K", "2019-11-15T00:37:00.000Z": "Together we can boot Trump all the way back to Mar-a-Lago.", "2019-11-14T21:30:29.000Z": "Three months ago, after a weekend of violence and tragedy, Trump promised he'd release a plan to reduce gun violence.\n\nHe never did.\n\nHe promised the same thing to me after Parkland.\n\nWe need a President who will take action to guarantee our children's safety. #EnoughIsEnough", "2019-11-14T19:30:33.000Z": "I'm heartbroken for the entire Santa Clarita community - and for our country.\n\nI'll say it again: we cannot continue to confront gun violence with empty words.\n\nNo one should fear for their safety when they're in a classroom, a concert, or a theater.\n\nEnough.", "2019-11-14T18:01:19.000Z": "If you think campaigns should be powered by people - not SuperPACs - donate here: https:// stevebullock.com/support", "2019-11-14T18:01:18.000Z": "We need to get Big Money out of our elections... not put more in. Quote Tweet Nicole Sganga @NicoleSganga NOW: Deval Patrick says that he does not see how he'll be able to run for a successful campaign without putting some sort of PAC together. #nhpolitics  #FITN Show this thread", "2019-11-14T17:31:00.000Z": "This is unacceptable. \n\nHealthcare access should not depend on the size of your paycheck. \n\nIt should be a right for all. \n\nWe can fix this with a strong public option, lowering drug prices, and building on the success of Obamacare, not dismantling it. Millions in U.S. Lost Someone Who Couldn't Afford Treatment Thirty-four million U.S. adults report knowing someone who has died in the past five years who did not receive needed treatment due to their inability to pay for it. news.gallup.com", "2019-11-14T15:53:07.000Z": "Dear Republican Members of Congress,\n\nHere's the deal:\n\nEither you think it's OK that the President used the power of his office to extort a foreign leader into investigating a political opponent, or you don't.\n\nP.S. There is only one right answer here.", "2019-11-14T13:18:03.000Z": "Welcome to the race @DevalPatrick ! Governors know how to get things done, like getting Big Money out of our elections. We need more of that in DC. \n\nSpeaking of which, I've pledged to reject support from corporate PACs, Dark Money groups, and SuperPACs. I hope you'll join me.", "2019-11-14T05:15:00.000Z": "Let's give Big Money the boot.", "2019-11-14T02:59:00.000Z": "You bet I'm a single issue voter in this election - and that single issue is beating Donald Trump.", "2019-11-14T01:15:00.000Z": "I'm fortunate to have had a couple of different titles in my life, but my favorite one is Dad. Whether campaigning or in the athletic arena, Caroline Bullock is anything but typical HELENA -- Caroline Bullock isn't your typical high school student. helenair.com", "2019-11-13T23:45:00.000Z": "We need to make sure that Americans who work can take time to care for a loved one or address serious medical needs without fear of losing their source of income. \n\nGlad to join @plusactionfund in this fight. Quote Tweet PL+US Action @plusactionfund Voters care about #PaidFamilyandMedicalLeave and the candidates are listening. Our scorecard started out with a single A, and now we have seven! Find out who is a paid leave leader at http:// plusaction.us/scorecard", "2019-11-13T22:39:03.000Z": "President Trump.\n\nIn the Oval Office.\n\nWith the extortion. #ImpeachmentHearings", "2019-11-13T21:50:00.000Z": "Whether Trump's removed at the ballot box or by impeachment, our task is to bridge our divides, stop the chaos, and get our country back on track.", "2019-11-13T20:46:09.000Z": "Let's be clear: if the President used the power of his office to extort a foreign leader into investigating a political opponent, then the House needs to impeach him.", "2019-11-13T19:48:16.000Z": "This hearing is about one thing: Congress upholding their responsibility to judiciously investigate these allegations.", "2019-11-13T17:45:22.000Z": "I stand with Israel as terrorists backed by Iran fire rockets targeting innocent civilians.\n\nI support Israel's right to defend its citizens from these heinous and cowardly attacks.", "2019-11-13T16:51:28.000Z": "Winter is coming. It's time to gear up! https:// shop.stevebullock.com/collections/ap parel/products/knit-beanie ", "2019-11-13T15:31:00.000Z": "As President, I'll make it a priority to pass comprehensive immigration reform, end family separation, secure our border, and ensure #DREAMers have a fair shot at achieving the American Dream. https:// stevebullock.com/immigration-po licy/ ", "2019-11-13T14:00:00.000Z": "If we can't win back the places we lost, we're going to lose this election.\n\nBut I know we can do it - because I've done it before. 2020 candidate Steve Bullock: I am running to beat Donald Trump and to bridge divides Montana Gov. Steve Bullock met recently with USA TODAY's Editorial Board to discuss his 2020 campaign, impeachment and the Democratic debates. usatoday.com", "2019-11-13T12:01:00.000Z": "From vindictively targeting #DREAMers to spewing racist rhetoric, the biggest problem with our immigration system is Donald Trump. \n\nBut once he's gone, we still have a lot of work to fix our broken immigration system. Here's my plan: https:// stevebullock.com/immigration-po licy/ ", "2019-11-13T01:30:00.000Z": "We don't have to choose between beating Donald Trump or defending our values. We win when no one is left behind - no matter where they live, how they got there, or who they voted for in the past.", "2019-11-13T00:40:52.000Z": "#DREAMers made history today at the Supreme Court. They work hard every day out of love for our country -- and they deserve a fair shot at the American Dream. #HomeIsHere Quote Tweet MSNBC @MSNBC WATCH: DACA supporters chant \"Home is here!\" on the steps of the US Supreme Court on Tuesday after justices hear arguments on Trump admin.'s push to end the federal program. http:// nbcnews.to/2qLVpbM", "2019-11-12T23:53:14.000Z": "I know it was only a few days ago that the President said he \"would love to go\" to a military parade hosted by Vladimir Putin.\n\nFor the record: I wouldn't.", "2019-11-12T21:45:00.000Z": "This is the most important election of our lifetime. \n\nNo, I'm not just saying that.", "2019-11-12T21:27:57.000Z": "Any day you get a cannoli on the campaign trail is a good day in my book!", "2019-11-12T20:30:00.000Z": "It's not hard: listen to scientists. Quote Tweet The New York Times @nytimes Breaking News: A Trump administration plan would make it harder for the EPA to enact clean air and water rules by limiting the scientific and medical research it can use https:// nyti.ms/32zK6Rm", "2019-11-12T18:28:24.000Z": "When my son got back from his first day of school I asked what he had learned.\n\nHe said: \"Where to go if there's an active shooter.\"\n\nWhen our kids are focused on surviving a day at school, it's not just traumatic - it's unacceptable. Quote Tweet NPR @NPR One expert says school drills that simulate active shooter situations have the potential to traumatize students rather than prepare them. \n\n\"We don't light a fire in the hallway to practice fire drills,\" she says. https:// n.pr/34WrX1H", "2019-11-12T17:30:00.000Z": "We deserve a President who fights against a corrupt system ⁠- not one who makes it worse. Republicans used to ignore Trump's resorts. Now they're spending millions. After Trump launched his presidential campaign, GOP spending at his businesses has soared. politico.com", "2019-11-12T16:53:10.000Z": "Montana Governor Stephen C. Bullock today filed his candidacy in New Hampshire on the desk of Stephen A. Bullock, the legislator who in 1913 proposed legislation creating the first-in-the-nation primary in New Hampshire.", "2019-11-12T16:55:23.000Z": "They're our friends.\nThey're our neighbors.\nThey're our family.\nThey're people who only know this country as home. \n\nWe stand with DREAMers.", "2019-11-12T15:59:39.000Z": "I grew up delivering newspapers to the Governor's house. Now I'm raising my kids there.\n\nIt's a testament to the American Dream that you can go from a paper route to running for the Presidency.\n\nToday I did just that by filing to officially be on the ballot for the NH primary.", "2019-11-12T14:28:58.000Z": ". @GovernorBullock files to officially be on the ballot for the New Hampshire primary", "2019-11-12T14:22:43.000Z": "Worlds colliding at the Secretary of State's office this morning: @GovernorBullock is filing his #FITN candidacy paperwork on a desk belonging to former Rep. Stephen Bullock, who wrote the law that created the N.H. primary. http:// bit.ly/34VnvA9", "2019-11-12T14:17:57.000Z": "Happening now: ... @GovernorBullock  is in the NH Secretary of State's office and is meeting the great-granddaughter of Stephen A. Bullock - the man who wrote the legislation that established the NH Primary https:// abcnews.go.com/Politics/2020- presidential-candidates-eyeing-hampshires-nation-primary/story?id=66585160 ", "2019-11-12T14:19:16.000Z": "Tune in as we officially file for the 2020 New Hampshire primary! Quote Tweet WMUR TV @WMUR9 Montana @GovernorBullock , a Democrat running for president, is filing for the 2020 New Hampshire primary right now at the State House: https:// bit.ly/2X6VhQh", "2019-11-12T05:02:50.000Z": "We deserve better than Dark Money, Citizens United, and Big Money corrupting our democracy.", "2019-11-12T01:36:02.000Z": "Here's how we win: you show up, you listen, and you recognize that no matter who you vote for, folks generally want the same things in life. \n\nTogether we can take our country back.", "2019-11-12T00:48:00.000Z": "Rural America sends more sons and daughters into the military than anyplace else. Yet too often, veterans in rural communities face greater challenges with access to healthcare and jobs. Let's fix that. http:// SteveBullock.com/veterans", "2019-11-11T23:47:52.000Z": "Just a reminder that Donald Trump has been President for 1,025 days. \n\nAnd he still hasn't released his tax returns.", "2019-11-11T21:58:12.000Z": "The men and women who fight for and defend our country sacrifice so much. In turn, we must uphold our commitment to them when they return to civilian life. Bullock's veterans' plan addresses health care, jobs, education, housing Among several Democratic presidential candidates to roll out plans to help those who have served in the military on this Veterans Day was Montana Gov. Steve Bullock, who shared his plan exclusively... wmur.com", "2019-11-11T20:39:05.000Z": "Rick Perry wanted to eliminate the Department of Energy until he realized he could use it to score foreign contracts for his millionaire backers. #oops After boost from Perry, backers got huge gas deal in Ukraine KYIV, Ukraine (AP) - Two political supporters of U.S. Energy Secretary Rick Perry secured a potentially lucrative oil and gas exploration deal from the Ukrainian government soon after Perry... apnews.com", "2019-11-11T18:18:40.000Z": "Access to healthcare should not depend on the size of your paycheck. \n\nIt should be a right for all.\n\nDespite what some folks say, we can do it by building on the success of Obamacare, not dismantling it. https:// stevebullock.com/healthcare/", "2019-11-11T16:06:32.000Z": "Thankful today, and every day. #VeteransDay", "2019-11-11T01:30:00.000Z": "I'm running for President because it's time Washington started working for working folks. Not the other way around.", "2019-11-11T00:00:00.000Z": "This is not that hard. On Day 1 of my campaign, I made 14 years of my tax returns public.\n\nTrump is the first President in the modern era to not release his tax returns. Let's make sure he's the last. Trump Taxes: Appeals Court Rules President Must Turn Over 8 Years of Tax Returns A three-judge appeals panel said Mr. Trump's accounting firm had to comply with a subpoena from the Manhattan district attorney, Cyrus R. Vance, Jr. nytimes.com", "2019-11-10T23:15:00.000Z": "After last week's elections it's clear that voters aren't looking for campaigns driven by Twitter and more empty promises from Washington; they're looking for leaders who have serious solutions to their everyday challenges. Column: A wake up call for Democrats Tuesday's election results are a wake-up call for national Democrats, but perhaps not in the way most people think. qctimes.com", "2019-11-10T22:00:00.000Z": "When you see the effects of climate change firsthand, you see that inaction is no longer an option. \n\nThat's why as Governor I led on expanding clean energy solutions, quadrupling our solar and doubling wind generation. Earth just experienced its hottest-ever October October follows the hottest-ever September and a record-setting summer cbsnews.com", "2019-11-10T20:59:44.000Z": "Here's how it works: \n\nTrump tweets Farmers lose money America suffers. \n\nWe need a real trade policy - not negotiations by tweet.", "2019-11-10T18:40:10.000Z": "Here's my plan to make sure rural America thrives: https:// bit.ly/32zasTB", "2019-11-10T18:40:09.000Z": "Black farmers make significantly less than their white counterparts - with few to no resources to fight back. \n\nThat's wrong, and it's exactly why I have a plan to invest in our rural communities and farmers of color. Surviving Droughts, Tornadoes and Racism An African-American family has established a farming dynasty in Alabama. The trade war is just the latest challenge. nytimes.com", "2019-11-10T17:30:00.000Z": "When we talk about issues that matter to Americans' everyday lives, we win - and Donald Trump knows it.", "2019-11-10T16:38:50.000Z": "Tuesday's election results are a wake-up call for Democrats. \n\nThe path to winning back the places we've lost isn't through more empty promises from Washington - it's by focusing on solving problems in the here and now. \n\nThat's how we win again in 2020. Column: A wake up call for Democrats Tuesday's election results are a wake-up call for national Democrats, but perhaps not in the way most people think. qctimes.com", "2019-11-10T13:55:00.000Z": "We are going to go everywhere, call everyone, and knock on every door we can find - and with friends like Jan Bauer on the team, I like our odds. Jan Bauer: Steve Bullock Will Repair Our Broken Politics, Make Lasting Change | Iowa Starting Line Longtime Story County Democratic leader Jan Bauer explains why she's backing Montana Governor Steve Bullock in the Iowa Caucus. iowastartingline.com", "2019-11-10T01:34:08.000Z": "ICYMI: We're on Bullock releases first TV campaign ads in Iowa Montana Gov. Steve Bullock (D) unveiled his first two television ads in Iowa Wednesday as the White House hopeful seeks to gin up support for his presidential bid in the first-in-the-nation caucus thehill.com", "2019-11-09T22:26:48.000Z": "Our top priority has to be kicking unaccountable Dark Money out of politics and restoring our democracy. Steve Bullock's Long Crusade Against Dark Money | Iowa Starting Line Voters say they despise dark money and corruption in politics. Steve Bullock has a long record on fighting it. Will it pay off? iowastartingline.com", "2019-11-09T17:59:26.000Z": "I stand with DREAMers. Quote Tweet The New York Times @nytimes Some 700,000 young undocumented immigrants, known as Dreamers, have built lives in the U.S. through the DACA program, which President Trump wants to end. \n\nNext week the Supreme Court will hear arguments on whether he can. https:// nyti.ms/2K0HOUH", "2019-11-09T16:33:38.000Z": "I don't care if you're a Democrat. \nI don't care if you're an Independent. \nI don't care if you're a Republican. \n\nWe need to get Big Money out of politics.", "2019-11-09T04:42:01.000Z": "For folks who tuned into @RealTimers with @BillMaher watch more on Overtime! https:// youtube.com/watch?v=Q-VwFS Ukzrc ", "2019-11-09T03:04:35.000Z": "Thanks for having me on @BillMaher . Tune in now!", "2019-11-08T23:28:05.000Z": "Let's win it back! Quote Tweet John Thurston @ARSecofState Steve Bullock (D) files for U.S. President. #ARvote", "2019-11-08T20:30:00.000Z": "Whether he's removed by ballot box or impeachment, we have to focus on bridging our divides, stopping the chaos, and getting this country back on track.", "2019-11-08T19:29:21.000Z": "Excited to join @BillMaher tonight! Tune in. Quote Tweet Real Time with Bill Maher @RealTimers TONIGHT: Join @BillMaher LIVE with @JudgeJudy  @JuddApatow  @GovernorBullock  @RahmEmanuel + @SteveSchmidtSES on #RealTime  @HBO ! Ask a question for #RTOvertime : http:// bit.ly/Nov8Guests", "2019-11-08T18:30:00.000Z": "Even as we see record floods and longer fire seasons, the GOP remains the only major political party in the world that denies climate change is human caused. After The Water: Flash Floods Pose Existential Threat To Towns Across U.S. When a flash flood ripped through Old Ellicott City in Maryland, residents thought it was a freak occurrence. Then, less than two years later, it happened again. apps.npr.org", "2019-11-08T17:10:15.000Z": "It's time we have a President who will get things done for our rural communities. Glad to have David Weaver from Greene County on our team. #IAcaucus  https:// bit.ly/34FMNlJ", "2019-11-08T14:21:28.000Z": "Healthcare is a right not a privilege, let's treat it as such. Steve Bullock: 2020 Democratic presidential candidate shares his views on current issues We asked presidential candidates questions about issues facing the country. Here's what Steve Bullock had to say about climate change, gun control, health care and other issues. usatoday.com", "2019-11-08T04:45:00.000Z": "Don't kid yourself, this election demands more than squeaking out a narrow victory. \n\nWe need a nominee strong enough to boot Trump all the way back to Trump Tower.", "2019-11-08T01:45:00.000Z": "The government should not be in the business of keeping foster kids away from a loving home and community. They certainly should not be discriminating against foster families based on who they are or who they love. A new Trump administration rule could hurt LGBTQ youth in foster care The proposal is part of a bigger pattern. vox.com", "2019-11-07T23:43:48.000Z": "Swell. \n\nAnother billionaire thinking that the Democratic nomination is for sale.", "2019-11-07T23:19:54.000Z": "Here's the problem with Big Money in politics. It just never stops. Quote Tweet Alex Burns @alexburnsNYT BLOOMBERG is filing to run for president https:// nytimes.com/2019/11/07/us/ politics/michael-bloomberg-president-2020.html ", "2019-11-07T23:09:02.000Z": "We don't need another billionaire buying his way into this election. Quote Tweet The New York Times @nytimes Breaking News: Michael Bloomberg, the former New York City mayor and billionaire businessman, is expected to file to be on Alabama's presidential primary ballot, an adviser said, though he has not yet decided to run https:// nyti.ms/33tZboH", "2019-11-07T21:35:00.000Z": "5 years and this crisis still hasn't been solved. Quote Tweet NYT Politics @nytpolitics 5 years after the water crisis in Flint began, schools are overwhelmed with demands to help children with high lead exposure https:// nyti.ms/2pQgL7Q", "2019-11-07T20:02:00.000Z": "With all the news going on it's sometimes hard to remember that the President of the United States literally used his \"charity\" as his own piggy bank. Quote Tweet The Associated Press @AP BREAKING: A judge in New York orders President Donald Trump to pay $2 million for misusing his charitable foundation. Show this thread", "2019-11-07T19:42:32.000Z": ". @GovernorBullock weighs in on reports that a @TomSteyer campaign staffer offered campaign contributions to elected officials in exchange for endorsements.\nBullock says Steyer's campaign is just another reason \"to get Big Money out of our elections.\"", "2019-11-07T19:33:39.000Z": "Bullock seizes on the Steyer story, saying, \"First he buys his way onto the debate stage and now Tom Steyer's trying to buy endorsements.\"\n\nSteyer, Bullock argues, \"proves why it's so important to get Big Money out of our elections.\"\n\nHere is the story: AP Exclusive: Steyer aide offered money for endorsements DES MOINES, Iowa (AP) - A top aide to Democratic presidential candidate Tom Steyer in Iowa privately offered campaign contributions to local politicians in exchange for endorsing his White House... apnews.com", "2019-11-07T19:30:24.000Z": ". @GovernorBullock taking his campaign finance reform message to @TomSteyer : \n\n\"First he buys his way onto the debate stage and now Tom Steyer's trying to buy endorsements. These repeated efforts to undermine our democratic process are unacceptable.\"", "2019-11-07T19:12:50.000Z": "You can't do this. AP Exclusive: Steyer aide offered money for endorsements DES MOINES, Iowa (AP) - A top aide to Democratic presidential candidate Tom Steyer in Iowa privately offered campaign contributions to local politicians in exchange for endorsing his White House... apnews.com", "2019-11-07T18:45:40.000Z": "#TBT CC: @TomSteyer Quote Tweet Newsweek @Newsweek Former aide to @RonPaul convicted in case of secret payments for endorsement http:// bit.ly/1LPtyt1", "2019-11-07T18:38:02.000Z": "You buy your way to the debate stage.\nYou try to buy your endorsements. @TomSteyer , we won't be bought. Quote Tweet Alexandra Jaffe @ajjaffe New: A top aide to Tom Steyer in Iowa has privately offered local politicians campaign contributions in exchange for endorsing his White House bid. Multiple current & former lawmakers told me Pat Murphy, Steyer's IA sr adviser, made the offer. https:// apnews.com/4f024bbad09c4e 0f97005376f0614377 ", "2019-11-07T17:45:00.000Z": "\"If Democrats want to win they should nominate Montana Governor Steve Bullock\" - Larry Sabato. If Democrats Aren't Panicking, They Aren't Paying Attention As Warren has surged, polls still show Biden as the Democrat best positioned to beat Trump. thedailybeast.com", "2019-11-07T16:54:02.000Z": "I'm a progressive - emphasis on progress. Together we can win back the places we lost and give Trump the boot! Bullock releases first TV campaign ads in Iowa Montana Gov. Steve Bullock (D) unveiled his first two television ads in Iowa Wednesday as the White House hopeful seeks to gin up support for his presidential bid in the first-in-the-nation caucus thehill.com", "2019-11-07T14:30:10.000Z": "TV Ad in Iowa As the only Democrat in the race who's won a Trump state, I know winning starts by going everywhere, not retreating to our corners.\n\nWe don't need to compromise our progressive values to win back the places we lost.\n\nSee you at the #IACaucus in 88 days!", "2019-11-07T05:00:00.000Z": "Let's ban Dark Money.", "2019-11-07T01:14:19.000Z": "I stand with the courageous @RWDSU members standing up for fair wages and benefits. It's time for @GeneralMills to honor their hardworking employees. Quote Tweet RWDSU @RWDSU BREAKING: RWDSU members at the @GeneralMills plant in Cedar Rapids, Iowa, have overwhelmingly voted to reject the company's contract proposal. #FairGMContractNOW Read more: https:// rwdsu.info/99_percent_of_ workers_vote_down_general_mills_contract_proposal  Show this thread", "2019-11-06T21:11:35.000Z": "\"If we're gonna win, it's not just about running up votes on the coasts. We have to be able win back places like Michigan, Wisconsin and Pennsylvania.\" - @GovernorBullock", "2019-11-06T23:28:31.000Z": "We know how to win the election. \n\nWe just have to show up, listen, and fight for our progressive values. \n\nThat's how we win back places we lost. That's how we give Trump the boot!", "2019-11-06T21:57:04.000Z": "Seems like a good time to re-up this: http:// DonaldTrumpUkraine.com", "2019-11-06T20:24:00.000Z": "As a Governor, I don't have the luxury of only going to pockets of blue or making plans just for the sake of press releases. It's time we have a President who can get things done again.", "2019-11-06T14:47:00.000Z": ". @GovernorBullock has 2 Iowa ads. The half million dollar buy will last a few weeks & air in several markets, including Des Moines & Cedar Rapids. In one, Iowa AG Tom Miller, who endorsed Bullock, talks about Iowans sorting through a crowded field https:// youtube.com/watch?v=Zm_WPb MfCOs ", "2019-11-06T14:44:05.000Z": ". @GovernorBullock launches two new TV ads in Iowa, both featuring AG Tom Miller\n\n\"The ad buy demonstrates the campaign's commitment in Iowa and supplements its strong ground operation and growing list of local endorsements,\" his campaign says https:// youtube.com/watch?v=6RryiY sb6_w ", "2019-11-06T17:37:04.000Z": "If we want to take our democracy back, we first have to take back the places we lost in 2016. Quote Tweet MSNBC @MSNBC WATCH: Gov. Bullock talks to #MTPDaily about his 2020 presidential campaign. https:// on.msnbc.com/2pBhFVP", "2019-11-06T16:51:02.000Z": "We're pushing to get 2,020 individual donations today to not only pay for our new ad, but showcase our momentum behind our campaign. Join us: http:// SteveBullock.com/donate", "2019-11-06T14:33:36.000Z": "Today I'm launching my first ad.\n\nAfter last night's election victories, it's clear we need a nominee who can compete everywhere.\n\nAs the only one in the race who's won a Trump state, I know we can do it -  without compromising our progressive values.", "2019-11-06T12:00:01.000Z": "Win the red states.\nWin the purple states.\nWin the blue states.", "2019-11-06T04:16:43.000Z": "Tonight: Kentucky.\n\nNovember 3, 2020: We finish the job and give Trump the boot.", "2019-11-06T03:14:17.000Z": "Do you like how tonight feels when a Democrat wins a Trump state? \n\nWe can do the same thing across the country in 2020. Join us: http:// SteveBullock.com/donate .", "2019-11-06T02:58:44.000Z": "That's how I've won three elections in a red state and it's why tonight we can congratulate Governor-Elect @AndyBeshearKY .", "2019-11-06T02:58:43.000Z": "Tonight's results are a wake-up call for national Democrats. The path to winning back the places we've lost isn't through impractical proposals or the latest Beltway obsessions - it's by focusing on solving problems in the here and now.", "2019-11-06T02:38:11.000Z": "Welcome to the club, @AndyBeshearKY ! Quote Tweet Vox @voxdotcom BREAKING: Attorney General Andy Beshear (D) has unseated incumbent Gov. Matt Bevin (R) in the Kentucky governor race. \n\nThe race shows a Democrat can win in a deep-red state despite President Trump's overwhelming popularity. https:// bit.ly/2NLfnLv Show this thread", "2019-11-06T01:15:00.000Z": "Our democracy shouldn't work for PACs or Putin.\n\nIt should work for the American people. https:// stevebullock.com/democracy/", "2019-11-06T00:15:00.000Z": "As a Governor, I don't have the luxury of only going to pockets of blue or making plans just for the sake of press releases. It's time we have a President who can get things done again.", "2019-11-05T23:51:28.000Z": "I've won in a Trump state and bridged divides to pass progressive policies. \n\nThat's what we need to not just beat Donald Trump in 2020, but to get our democracy back on track.", "2019-11-05T23:03:29.000Z": ". @GovernorBullock : \"We need to have a national party that can connect in red and purple states as much as the blue states. ... Because if we run up the votes by another 2 million in California, it's not going to make a difference.\" #MTPDaily", "2019-11-05T22:39:22.000Z": "Tune in to #MTPDaily with @ChuckTodd at 5:45 pm ET for some exciting news about our fight to win back the places we lost. Together we're going to ensure  every American gets a fair shot at a better life.", "2019-11-05T21:57:36.000Z": "For him, it's not America first. It's Donald Trump first.", "2019-11-05T20:35:00.000Z": "The biggest problem with our immigration system is Donald Trump.", "2019-11-05T18:10:22.000Z": "Election Day should be a national holiday.", "2019-11-05T16:43:19.000Z": "There are many requirements to be a good US Ambassador. Sucking up on Twitter isn't one of them. Ousted Ukraine ambassador Yovanovitch says she was told to tweet praise of Trump to save her job The three House committees leading the Trump impeachment inquiry released two transcripts of the behind-closed-doors interviews they have conducted so far. nbcnews.com", "2019-11-05T14:18:28.000Z": "VOTE.", "2019-11-05T10:00:00.000Z": "National parks are not amusement parks, no matter what Donald Trump thinks. \n\nWe save our national parks by investing in infrastructure and expanding access, not by unleashing Amazon drones and barring seniors at the gate. Trump administration mulls privatizing national park campgrounds Our national parks may be set for a major overhaul that's much broader than just electric bikes on trails. axios.com", "2019-11-05T04:35:00.000Z": "This is voter suppression, plain and simple. \n\nThere is an easy solution: prevent states from needlessly purging voter rolls. \n \nAs President, I'll do just that. Georgia to purge over 300,000 voters ahead of 2020 election A planned purge of 300,000 names from voting rolls in Georgia has advocates concerned that efforts to slash access to the ballot could re-emerge as a major issue heading into 2020. The purge was independent.co.uk", "2019-11-05T02:30:19.000Z": "We will not privatize our parks. Trump team has a plan for national parks: Amazon, food trucks and no senior discounts The Trump administration is mulling proposals to further privatize national parks and limit the use of senior passes there, setting off an angry backlash from conservation groups and retirees. latimes.com", "2019-11-05T00:27:00.000Z": "The White House should not be run by a failed businessman on Twitter. In Trump's Twitter Feed: Conspiracy-Mongers, Racists and Spies Inside the alternate reality of the president's Twitter account, where he absorbs and amplifies a noxious stream of disinformation. nytimes.com", "2019-11-04T23:17:18.000Z": "How Trump sees our public lands:", "2019-11-04T22:34:06.000Z": "Here are the countries that won't be in the Paris agreement: Here are the countries that will be in the Paris agreement: Trump is truly turning America First into America Alone.", "2019-11-04T21:47:39.000Z": "Trump is putting polluters above people. This is the wrong move. When I'm President, we're rejoining the Paris agreement. Day 1. Quote Tweet Juliet Eilperin @eilperin NEW: Trump makes it official, withdrawing the US from the Paris climate accord. The move, which could take effect the day after the 2020 election, would make the U.S. the only nation to abandon the global effort to combat climate change. @brady_dennis  https:// washingtonpost.com/climate-enviro nment/2019/11/04/trump-makes-it-official-us-will-withdraw-paris-climate-accord/ ", "2019-11-04T21:01:00.000Z": "\"Steve has the strength of character to put our nation back on track. I'm proud to endorse Steve Bullock for President, and I look forward to sharing his vision over the next four months as we head into the Caucus.\" Staci Appel, Ackworth, Iowa. Bullock will beat Trump and protect democracy Donald Trump has put the foundation of our country at stake. He's undermined even though most uncontroversial and time-honored institutions of the presidency: upholding the constitution, protecting... thegazette.com", "2019-11-04T19:45:00.000Z": "I won with Trump on the ballot. \n\nI won with Romney on the ballot.\n\nI won with McCain on the ballot.\n\nI won without compromising our progressive values.\n\nI won by fighting like hell to deliver results.\n\nThat's the way we win back the White House. Join us: http:// SteveBullock.com Quote Tweet Jonathan Chait @jonathanchait The Democratic presidential primary has taken place in a world pretty far removed from the actual places they need to win to beat Trump http:// nymag.com/intelligencer/ 2019/11/poll-trump-beats-democrats-swing-state-biden-warren-sanders.html ", "2019-11-04T18:40:51.000Z": "Donald Trump's priorities:\n1. Helping his family profit off the Presidency.\n2. Tweeting.\n3. Golf. Quote Tweet Donald J. Trump @realDonaldTrump My son, @DonaldJTrumpJr is coming out with a new book, \"Triggered: How the Left Thrives on Hate and Wants to Silence Us\" - available tomorrow, November 5th! A great new book that I highly recommend for ALL to read. Go order it today!", "2019-11-04T17:35:00.000Z": "Donald Trump is willing to put homes, property, and the lives of Americans at risk for political retribution. Trump vows 'no more' federal aid to California as devastating wildfi Donald Trump has threatened to cut off emergency funding to California as wildfires rage across the state, telling governor Gavin Newsom to \"get his act together\". independent.co.uk", "2019-11-04T16:35:16.000Z": "A budget is a statement of priorities - and if we want to make progress on the major challenges of our time, the first thing we need to do is restore faith & participation in our democracy. \n\nAs President, I'll refuse to support any budget that doesn't reform our democracy first.", "2019-11-04T00:22:00.000Z": "Our economy is more than GDP and yield curves. It's over 300 million Americans making decisions every day around their kitchen tables.\n\nIt's time we make sure that everyone has the opportunity at a good paying job and a fulfilling career. Lots of Job Hunting, but No Job, Despite Low Unemployment Even with the strongest labor market in half a century, getting work after losing it can still be a challenge. nytimes.com", "2019-11-03T23:04:00.000Z": "Let's make it happen. Join us: http:// SteveBullock.com", "2019-11-03T20:57:00.000Z": "November 2020:", "2019-11-03T19:29:33.000Z": "We're going to go everywhere and speak with everyone.\n\nThat's how we're going to win back the places we lost.\n\nOne year from today, that's how Democrats are going to win. #OneYearOneTeam", "2019-11-03T16:34:00.000Z": "All while the GOP is the only major political party in the world that won't acknowledge climate change is human caused. After years of improvement, US air quality has gotten worse since 2016, report suggests Researchers identified three possible contributing factors: more wildfires, more economic growth and less enforcement of federal regulations. usatoday.com", "2019-11-03T13:30:00.000Z": "Even when we don't agree on every detail, as Democrats we stand for our shared values and shared principles. \n\nThat's why in one year we're gonna give Trump the boot!", "2019-11-02T22:45:00.000Z": "I won three elections in a red state by showing up, listening, and making folks know that the government can work for us. \n\nThat's the type of leadership I'll bring to the White House.", "2019-11-02T20:30:00.000Z": "It doesn't matter if you wear boots or wingtips, whether you live in a big city or a small town, we know it takes more than your own bootstraps to make it in America.", "2019-11-02T15:14:04.000Z": "I had the pleasure of meeting Governor Bullock last week. His impressive record of making divided government in MT work CAN  be replicated in DC. He has my support. He came into the race late but he has what it takes. Quote Tweet Steve Bullock @GovernorBullock I'm running for President to win back the places we lost and get progressive things done. \n\nThat's what I've done in Montana, and that's what we're gonna do across the country. #LJ19", "2019-11-02T18:45:00.000Z": "This President is profiting off of the Presidency, and we're paying the cost. \n\nIn November 2020, we're gonna give Trump the boot. How Trump Corrupted the American Presidency in Every Imaginable Way The highest office in America has turned into a giant cesspool of corruption. gq.com", "2019-11-02T17:16:17.000Z": "Getting Dark Money out of politics is the fight of our time. \n\nI've made it the fight of my career. \n\nYou bet I'll make it the defining issue of my Presidency.", "2019-11-02T16:02:19.000Z": "I may be the underdog in this race, but that's nothing new.\n\nAs a child raised in a single-parent household.\n\nAs a lawyer who took on Citizens United & kicked Dark Money out of our state's elections.\n\nAs a Democrat in a place like Montana.\n\nI've been the underdog before.", "2019-11-02T11:00:00.000Z": "In November 2020, we're going to give Trump the boot. \n\nJoin us: http:// SteveBullock.com  #LJ", "2019-11-02T06:14:51.000Z": "I'm running for President to win back the places we lost and get progressive things done. \n\nThat's what I've done in Montana, and that's what we're gonna do across the country. #LJ19", "2019-11-02T04:16:12.000Z": ". @GovernorBullock may have drawn the last speaking slot tonight, but guess who did in 2007? @BarackObama . Iowa Democrats who left early might have been wise to stick around, because he offered a stern lesson for how to win in Trump country.", "2019-11-02T04:26:22.000Z": "#1 fan was ALL for giving Trump the boot!", "2019-11-02T04:18:59.000Z": "\"We've got to be able to connect with people who wear boots, not just wing tips,\" Bullock says. He also says it's time to give Trump the boot as his supporters wave orange boot signs.", "2019-11-02T04:13:30.000Z": "Supporters for @GovernorBullock holding up a \"Give Trump the Boot\" sign. \n\nBullock wears boots made of alligator skin and is the last speaker of the night. \n\nOr as Bullock said \"the keynote speaker\"", "2019-11-02T04:24:57.000Z": "I'm in this campaign to beat Donald Trump, to bridge the divides, and to make our economy and Washington work for us again\n\nAnd I'm asking you to join me at the Caucus because, together, we can Boot Trump! #LJ19", "2019-11-02T04:22:34.000Z": "I'm a pro-choice, pro-union, populist Democrat who's won three elections in a red state. \n\nI've won with Trump on the ballot.\n\nI've won with Romney on the ballot.\n\nAnd I've won with McCain on the ballot.\n\nDon't tell me we can't win back the places we lost. #LJ19", "2019-11-02T04:21:39.000Z": "If we can kick the Kochs out of Montana - we can kick them out of Iowa, out of Washington, and all across the country.  We can make Washington work for us again!\n\nThat's how we take back our democracy, and give Trump the boot! #LJ19", "2019-11-02T04:21:15.000Z": "Taking on dark money has been the fight of my career and it's the challenge of our time. We can win this fight.  With a legislature more republican than yours in Iowa, I took on the Koch Brothers and banned dark money groups from our elections. #LJ19", "2019-11-02T04:19:54.000Z": "As a former union side labor lawyer, as someone that recognizes blue collar families live and work in places that aren't always blue on the election maps, that's how we bring back working folks & families and retirees in Iowa and across the Midwest and give Trump the boot! #LJ19", "2019-11-02T04:16:45.000Z": "First, we have to show up. We can't write off parts of this country, just because it's tough or because some party boss says it's a waste of time.   It's more than just showing up. It's listening, its understanding, its respecting perspectives that are different than ours. #LJ19", "2019-11-02T04:14:20.000Z": "", "2019-11-02T04:13:16.000Z": "Since getting into this race 5 ½ months ago, I've put some miles on these boots. #LJ19", "2019-11-02T02:59:02.000Z": "It's boot season. Quote Tweet Edward-Isaac Dovere @IsaacDovere . @GovernorBullock props tonight", "2019-11-02T01:48:58.000Z": "Stay tuned... Quote Tweet Iowa Starting Line @IAStartingLine Steve Bullock's section has \"Give Trump The Boot\" hand things. May be a line we hear in his speech", "2019-11-02T01:01:06.000Z": "Iowa Attorney General Tom Miller is a legendary public servant and a good friend. I'm honored that he'll be in my corner (literally!) on caucus night. Join us: http:// SteveBullock.com", "2019-11-02T00:32:00.000Z": "Steve Bullock's section has \"Give Trump The Boot\" hand things. May be a line we hear in his speech", "2019-11-02T00:50:22.000Z": "Join us: http:// SteveBullock.com Quote Tweet Iowa Starting Line @IAStartingLine Steve Bullock's team is doing caucus volunteer training ahead of the governor's arrival #LJ19", "2019-11-02T00:05:19.000Z": "Team Bullock is READY for tonight's Liberty & Justice Celebration! #LJ19  #IACaucus", "2019-11-01T23:15:15.000Z": "Thanks to @BetoORourke , his staff, and his supporters for working your hearts out for a cause you believed in. Democrats are going to need that passion more than ever over the next year. Let's keep up the fight!", "2019-11-01T21:30:00.000Z": "Here's the secret formula for winning three elections in a red state: \n\nShow up.\nListen. \nRespect other perspectives. \n\nThat's how we win back places we lost.", "2019-11-01T19:45:00.000Z": "This should never be a headline. Trump lures GOP senators on impeachment with cold cash The president is tapping his vast donor network to buck up lawmakers whose support he badly needs - but who also need him. politico.com", "2019-11-01T18:40:00.000Z": "This Administration puts its own interests above those of the American people.", "2019-11-01T17:13:07.000Z": "I know a lot of folks are busy, but please take a moment out of your day to realize that President Trump's attacks on Obamacare are causing a nationwide loss of children's healthcare - after promising he'd protect it.\n\nWe're talking about the lives of American children. Quote Tweet CNN @CNN The number of uninsured children grew by more than 400,000 between 2016 and 2018, an unprecedented decline in health coverage for the youngest Americans, a new study has found https:// cnn.it/331sC1k", "2019-11-01T15:48:28.000Z": "I'm running for President to get stuff done - and I have a plan and the progressive record to do it.", "2019-11-01T13:52:18.000Z": "It seems like the only way @realDonaldTrump will pay attention to Iowa's farms is if you tell him that's where the dirt is on a political opponent. U.S. Farm Bankruptcies Surge 24% on Strain From Trump Trade War U.S. farm bankruptcies in September surged 24% to the highest since 2011 amid strains from President Donald Trump's trade war with China and a year of wild weather. bloomberg.com", "2019-11-01T01:38:00.000Z": "Here's what is on the line:\n\nWomen's rights\nWorkers' rights\nCivil rights\nCitizens United\n\nDonald Trump is filling the courts with judges that will have a dangerous impact on the direction of our country. It's time we put a leader in the White House who will fight for our values. Quote Tweet Rebecca R. Ruiz @RebeccaRuiz President Trump is one judicial appointee away from having installed a full quarter of the federal appeals court. https:// nytimes.com/2019/10/30/us/ trump-appeals-court-nominees.html ", "2019-11-01T00:24:46.000Z": "Happy Halloween from the BOO-lock family to yours!", "2019-10-31T22:45:02.000Z": "Anthony Scaramucci and Steve Bullock trade jabs over Cameo stunt Anthony Scaramucci and Steve Bullock trade jabs over prank endorsement The Montana governor and long-shot presidential candidate paid $100 for the Cameo spot to point up \"dark money\" in politics. politico.com", "2019-10-31T22:34:47.000Z": "Got him, @GovernorBullock . Quote Tweet Steve Bullock @GovernorBullock Mr. Scaramucci didn't know the source of the $100, but he allowed it to enter his wallet despite the potential consequences - just like how our broken campaign finance system allows Dark Money to enter our elections & influence our politics. \n\nA frightening tale indeed! Show this thread", "2019-10-31T20:29:05.000Z": "Steve Bullock gets Anthony Scaramucci to unknowingly tape an endorsement for $100 https:// cnn.it/34bi1B0", "2019-10-31T21:45:00.000Z": "Boo", "2019-10-31T20:12:00.000Z": "We win this election by going everywhere, even places that haven't heard from a Democrat in a while. Everything starts with showing up. \n\nGlad to have folks from Newton like Laura on the team! https:// bit.ly/2piYH62", "2019-10-31T19:47:17.000Z": "\"For our republic, this inquiry has to go forward.\"\n\n2020 candidate Gov. Steve Bullock tells @devindwyer he was \"reluctant to get into impeachment,\" but President Trump's call with the Ukrainian president \"crosses the line.\" http:// abcn.ws/2JCZjds", "2019-10-31T18:45:00.000Z": "It should scare us all that we still have Dark Money influencing our election.\n\nThe GOP is terrified to tell us where the money is coming from. So, we've unmasked it for them. GIF", "2019-10-31T17:40:00.000Z": "As a former Attorney General, I know criminal activity when I see it. Quote Tweet The Hill @thehill Steve Bullock calls for putting Giuliani \"behind bars\" http:// hill.cm/8P1FSti", "2019-10-31T17:38:48.000Z": "Thanks for your contribution. Grassroots donors like you make this possible. Quote Tweet Anthony Scaramucci @Scaramucci Governor I am working with @BookCameo to return the $100 to you from your very \"Un-Presidential\" stunt. You will have it shortly. I will put an extra $200 in the charity kitty on your behalf as a thank you for raising the awareness of @BookCameo appearance. Sir, you lack judgment twitter.com/GovernorBulloc", "2019-10-31T15:44:50.000Z": "\"I'm behind you 100 percent,\" said Anthony Scaramucci in a recent Cameo video he unknowingly recorded for Democratic presidential candidate Steve Bullock Scaramucci Unknowingly Records Ad for Democrat Steve Bullock The Montana governor used Cameo to get the Mooch to send a message of support. nymag.com", "2019-10-31T16:00:01.000Z": "It's time to end the Trump Administration's attacks on equal opportunity. As President, I'll make it a priority to empower women, strengthen our communities, and ensure everyone is afforded equal opportunity to succeed. https:// stevebullock.com/womens-equalit y/ ", "2019-10-31T13:18:34.000Z": "Mr. Scaramucci didn't know the source of the $100, but he allowed it to enter his wallet despite the potential consequences - just like how our broken campaign finance system allows Dark Money to enter our elections & influence our politics. \n\nA frightening tale indeed!", "2019-10-31T12:59:27.000Z": "You know what's really spooky this Halloween?\n\nThe fact that a former Trump White House Communications Director will say anything you ask him to for $100.", "2019-10-31T11:00:00.000Z": "As a former Attorney General, I know criminal activity when I see it. \n\nRudy Giuliani should be behind bars.", "2019-10-31T03:07:27.000Z": "The challenges we face are too great to solve alone - we've got to go everywhere and speak with everyone to win back the White House. \n\nTune in to @CNNTonight with @DonLemon at 9:20pm MT to hear how we can do just that.", "2019-10-31T01:15:00.000Z": "As Attorney General, I fought to ban payday lenders from Montana. As President, Trump offers payday lenders the Lincoln Bedroom. Payday lenders discussed raising money for Trump's campaign to fend off regulation, audio reveals The recording offers a surprisingly frank insight into the payday lending industry's strategy for advocating for weaker government regulations by forging a tight relationship with the Trump adminis... washingtonpost.com", "2019-10-30T22:55:41.000Z": "This election isn't up to party bosses or donors. It's up to voters.", "2019-10-30T21:45:00.000Z": "Despite the Trump administrations fearmongering and hateful policies, we know that diversity makes us strong. \n\nIn Montana and across this country, we will never stop fighting for those who embody the best of our American values. Quote Tweet NYT Politics @nytpolitics President Trump in the coming days will finalize the lowest annual refugee cap in the refugee program's history. In Missoula, Congolese refugees are already facing the repercussions. https:// nyti.ms/2Jy3aIN", "2019-10-30T20:17:48.000Z": "Good. Your turn, Facebook. Quote Tweet jack @jack We've made the decision to stop all political advertising on Twitter globally. We believe political message reach should be earned, not bought. Why? A few reasons Show this thread", "2019-10-30T18:45:00.000Z": "Welcome news from North Carolina, but it's time we end gerrymandering once & for all. \n\nAs President, I'll work to require every state to establish independent redistricting commissions. Voters should choose their representatives, not the other way around. Court throws out North Carolina's Republican-drawn congressional district maps The ruling said that the boundaries were \"drawn in violation of our North Carolina Constitution.\" nbcnews.com", "2019-10-30T17:49:02.000Z": "We aren't just going to beat Donald Trump. We're going to build a government that actually works again. \n\nGlad to have Fmr. Iowa Senate Assistant Majority Leader Staci Appel on our team. https:// bit.ly/36lGmWP", "2019-10-30T15:30:00.000Z": "Here's a guarantee: \n\nThere won't be any of this intolerance coming out of my administration. HUD Secretary Ben Carson makes dismissive comments about transgender people, angering agency staff During his visit to San Francisco this week, the Housing and Urban Development Secretary also lamented that society no longer seemed to know the difference between men and women, according to three... washingtonpost.com", "2019-10-30T12:00:01.000Z": "People with disabilities have the same right to equal opportunity & freedom from discrimination as everyone. When we ensure that Americans with disabilities are represented, we can take on prejudice & build a more equitable world.\n\nHere's how we can do it: http:// SteveBullock.com/accessibility", "2019-10-30T03:27:59.000Z": "Like his casinos, The Apprentice, and his \"university,\" it's time we put Trump's Presidency in the past.", "2019-10-30T02:27:00.000Z": "We are witnessing an unprecedented attack on a woman's right to make her own healthcare decisions.\n\nAs Governor of Montana, I stopped every attack on a woman's right to make those decisions.\n\nIt's time for a leader in the White House who will do the same. Missouri begins hearing over state's lone abortion clinic If the embattled Planned Parenthood of the St. Louis Region is forced to close, Missouri would become the only state in the country without an abortion clinic. nbcnews.com", "2019-10-30T01:05:00.000Z": "As President, I'll bring top climate scientists into our government, not force them out. Trump administration's war on science has hit 'crisis point', experts warn Nonpartisan taskforce of ex-government officials reports 'almost weekly violations' of norms meant to safeguard objective research theguardian.com", "2019-10-29T23:35:00.000Z": "Quid pro quo isn't just a term they use in Ukraine. Quote Tweet Jenna Johnson @wpjenna Trump fundraiser to payday lenders: \"She's been able to call over to the White House and say, 'Hey, we have one of our large givers. They need an audience.  They need to be heard and you need to listen to them.'\" @renaemerle reports: https:// washingtonpost.com/business/2019/ 10/29/payday-lenders-discussed-raising-money-trumps-campaign-fend-off-regulation-audio-reveals/?outputType=amp#click=https://t.co/YAwb4vNjo6 ", "2019-10-29T22:42:16.000Z": "As long as SuperPACs and Dark Money groups are able to flood our elections with millions of dollars, we won't make progress on the big issues facing our country. Quote Tweet The Hill @thehill Bullock blasts Biden for being open to super PAC funding http:// hill.cm/AJDEtSS", "2019-10-29T21:38:40.000Z": "Payday lenders know an easy target when they see one. And they see one sitting in the White House. Payday lenders discussed raising money for Trump's campaign to fend off regulation, audio reveals The recording offers a surprisingly frank insight into the payday lending industry's strategy for advocating for weaker government regulations by forging a tight relationship with the Trump adminis... washingtonpost.com", "2019-10-29T21:04:58.000Z": "My full statement on Joe Biden's decision to invite help from SuperPACs.", "2019-10-29T20:17:03.000Z": "I'll oppose: Vouchers For-profit charter schools Privatization\n\nI'll fight for: Doubled investments in K-12 Pre-k for all Free community college Rural schools http:// SteveBullock.com/public-educati on ", "2019-10-29T19:15:00.000Z": "We are building a team in Iowa that knows first hand the fair shot every community deserves.\n\nI'm running for President to win back the places we lost & get progressive things done. That's what I've done in Montana and, with this team, we're gonna do the same thing across the US. Quote Tweet Iowa Starting Line @IAStartingLine New guest piece: Five Montanans working for Steve Bullock describe why they moved to Iowa to help send their Governor to the White House https:// iowastartingline.com/2019/10/28/why -we-moved-1000-miles-to-elect-gov-steve-bullock/ ", "2019-10-29T18:23:10.000Z": "Thankful for our brave firefighters who are helping Californians combat their dangerous wildfires. Quote Tweet Independent Record @helenaironline Two city of Helena fire crews are deploying to southern California today to help with wildfire suppression efforts. https:// helenair.com/news/local/hel ena-fire-crews-deploying-to-california/article_36859b74-453e-5b59-be2e-1f3f404402a1.html#utm_campaign=blox&utm_source=twitter&utm_medium=social ", "2019-10-29T16:37:00.000Z": "We have work to do to make sure that LGBTQ+ Americans have equal rights & opportunity. Here's our plan: Ban conversion therapy Pass the Equality Act Honor & support transgender Americans who serve in our military End healthcare discrimination http:// stevebullock.com/LGBTQ-Equality", "2019-10-29T15:32:12.000Z": "Things that are needed to win an election: Dark coffee and dark chocolate.\n\nThings that should never be needed to win an election: Dark Money and Super PACs.", "2019-10-29T13:15:00.000Z": "I was the first Governor of Montana to officiate a same-sex ceremony. But let's be clear: marriage equality is just the first step.\n\nTogether, we can work to ensure freedom from bigotry and intolerance, and guarantee equal rights and opportunity for all. http:// SteveBullock.com/LGBTQ-Equality", "2019-10-29T12:00:07.000Z": "Every American deserves a fair shot at success. But for LGBTQ+ Americans, our work did not end with marriage equality. \n\nAs President, I'll continue the fight for equal rights and opportunity for every American. http:// SteveBullock.com/LGBTQ-Equality", "2019-10-29T03:39:00.000Z": "We have to do more than just win this election - we have to make Washington work for us. \n\nNot for Big Money, not for the special interests, but for each one of us in the communities we call home.", "2019-10-29T01:03:00.000Z": "It shouldn't take physically blocking train tracks for a company to pay workers what they're due. \n\nWay to take a stand and get what you earned. Blackjewel Coal Miners to Get Millions in Back Pay After Train Blockade Blackjewel went bankrupt in July and about 1,100 workers in central Appalachia lost several weeks of pay. In protest, coal miners blocked a train full of coal for months. nytimes.com", "2019-10-29T00:10:00.000Z": "It's time we end gerrymandering. https:// stevebullock.com/democracy/", "2019-10-28T23:01:00.000Z": "Despite how much they try, this democracy isn't for the special interests, Big Money, or Dark Money billionaires. \n\nIt's for us.", "2019-10-28T22:36:04.000Z": "Pre-K for all.", "2019-10-28T20:21:00.000Z": "Missing and murdered Native women, their families, and their communities deserve justice. There is a long road ahead of us, but Hanna's Act is the first step toward addressing this epidemic. Quote Tweet Al Jazeera English @AJEnglish In 2019, Montana Governor Steve Bullock signed Hanna's Act.\n\nThe law requires the Department of Justice to investigate missing & murdered indigenous people, oversee data collection, liaise with families & work with other state & federal agencies https:// aje.io/cka3a Show this thread", "2019-10-28T19:30:00.000Z": "I stand by my progressive record. \n\nAs President, I'll stand with you.", "2019-10-28T18:45:00.000Z": "It's time we regain America's competitive education advantage. How Steve Bullock would boost K-12 school spending and make community college free He proposed giving tax credits to employers who help their employees pay off student debt. politico.com", "2019-10-28T17:55:52.000Z": "My heart goes out to the family of Sen. Kay Hagan. As a passionate fighter for North Carolinians, the strength of her leadership improved opportunity for every American. Quote Tweet TIME @TIME Former North Carolina Senator Kay Hagan dies at 66 https:// ti.me/31TuojJ", "2019-10-28T17:27:08.000Z": "You should be able to register to vote on the day you vote.", "2019-10-28T16:04:20.000Z": "Imagine living in a country where some of the wealthiest people on the planet spend millions to influence an election-and don't have to disclose it. \n\nIf it sounds familiar it's because that's what happens in the US. At Least 20 Billionaires Behind 'Dark Money' Group That Opposed Obama A nonprofit group with a bland name, Americans for Job Security, spent $15 million denouncing former President Obama in the 2012 election, but until this week, the group never had to file disclosures... forbes.com", "2019-10-28T14:30:00.000Z": "I was able to pass Medicaid expansion through a Republican legislature. It saved healthcare for nearly 100,000 folks. It's a stark contrast to this President who uses his power to rip healthcare away from vulnerable Americans. This is why I'm in this fight. Lives are on the line.", "2019-10-28T13:42:10.000Z": "Our brave troops put themselves in danger every day to keep us safe. I'm grateful for our special forces who risked their lives and dealt a significant blow to ISIS. ISIS leader dead after U.S. commandos stage dramatic raid in Syria As U.S. forces and dogs approached him, al-Baghdadi detonated a suicide vest, killing himself and a group of children cbsnews.com", "2019-10-28T03:35:00.000Z": "The economy isn't working for most folks, and until we break Dark Money's stranglehold on our politics, it's not going to. Steve Bullock Vows To Disentangle 'Dark Money' From Politics The Montana governor, one of the last Democratic candidates to join the presidential race, is focused on bringing \"sunshine and transparency\" to campaign finance. npr.org", "2019-10-28T01:31:00.000Z": "If we don't win back the places we lost, we won't beat Donald Trump. It's that simple. Steve Bullock Talks Trump, Winning the Midwest, the Economy Democratic presidential hopeful Steve Bullock tackled Donald Trump, the country's apparent division and climate change during his speech Friday at a \"Politics & Eggs\" event in New Hampshire. \"From my... nbcboston.com", "2019-10-28T00:04:39.000Z": "Congressman John Conyers was a passionate leader and a lifelong champion for justice. He fought for civil rights, for voting rights, and for the basic notion that everyone - in every community - deserves a fair shot at a better life.", "2019-10-27T23:01:00.000Z": "Trump is doing literally nothing for rural America.", "2019-10-27T22:48:49.000Z": "Happy #Diwali ! Our family hopes all who are celebrating have a wonderful Festival of Lights.", "2019-10-27T20:29:47.000Z": "\"Our Democratic Party needs a candidate at the top who brings a proven track record and the exceptional qualities to unite our country. That candidate is Montana Gov. Steve Bullock.\" - Dave Muhlbauer, Crawford County Supervisor. https:// bit.ly/31TIKAm", "2019-10-27T19:03:52.000Z": "End the filibuster.", "2019-10-27T17:01:40.000Z": "Nothing like a little bit of snow to start hunting season in Montana. \n\nStay safe and warm out there!", "2019-10-27T16:30:00.000Z": "Too often, Washington politicians only pay lip service to rural communities. \n\nNo more. https:// bit.ly/2JkkVLN", "2019-10-27T15:15:00.000Z": "This administration isn't draining the swamp, they're swamping the drain.", "2019-10-27T12:45:00.000Z": "It's been 1 year since 11 innocent people lost their lives to gun violence at the Tree of Life Synagogue in Pittsburgh. \n\nIt was true then and it's true now: anti-Semitism, hate, and violence have no place in America.", "2019-10-27T03:47:00.000Z": "Fighting against the toxic influence of money in politics has been the fight of my career. \n\nAnd I'm just getting started.", "2019-10-27T00:32:00.000Z": "If you're a:\n\nTeacher\nFirefighter\nJanitor\nPlumber\nConstruction worker\n\nYou pay more in taxes than the 400 wealthiest families in America. \n\nThat's not a problem. \n\nIt's THE problem. America's richest 400 families now pay a lower tax rate than the middle class For the first time in a century, the ultra-wealthy contribute a smaller share of their income than most other Americans cbsnews.com", "2019-10-26T22:46:00.000Z": "You bet I'm going to keep #publiclands in public hands. Here's my plan to do just that: https:// stevebullock.com/public-lands/", "2019-10-26T20:32:00.000Z": "It's time we get stuff done for the folks Washington left behind. Glad to have Don Ruby, Former Warren County Democratic Party Chair in this fight with us! https:// bit.ly/36aT22G", "2019-10-26T19:19:18.000Z": "Election Day should be a national holiday.", "2019-10-26T18:07:00.000Z": "The way I win and the way I govern are largely the same. \n\nIt's about listening more than you talk and  going everywhere, even places that haven't heard from a Democrat in a while. \n\nEverything starts with showing up.", "2019-10-26T16:37:44.000Z": "As a former union-side labor lawyer, and as someone who stood on the picket line with @UAW , I've seen how much these agreements mean for workers and their families.\n\nThis is about securing better wages, benefits, and job security. It's about a fair shot at a better life. Quote Tweet UAW @UAW UAW General Motors members ratified the 2019 Collective Bargaining Agreement this evening ending the longest automotive strike in 50 years. https:// bit.ly/2pWcf7f", "2019-10-26T15:30:00.000Z": "Trump's tax giveaway to big corporations is exploding our deficit and making future generations pick up the tab. The U.S. deficit hit $984 billion in 2019, soaring during Trump era Budget experts say it is unprecedented for America's deficit to expand this much during relatively good economic times. washingtonpost.com", "2019-10-26T13:00:00.000Z": "14 trips to Iowa 16 Iowa political endorsements 24 slices of @caseysgenstore breakfast pizza 45 Meet & Greets  days left until the #IACaucus Join us: http:// SteveBullock.com", "2019-10-26T03:15:00.000Z": "This President hands out tax breaks to millionaires and rips away food from hungry children. Half a million kids could lose free school lunches under new Trump administration rule The proposal would tighten access to food stamps, and tens of thousands of children would lose automatic eligibility for free meals cbsnews.com", "2019-10-26T02:21:13.000Z": "It ain't the World Series but it's a heck of a game! #GoBengals", "2019-10-26T00:35:00.000Z": "I'm a progressive - emphasis on progress.\n\nI'm running for President to get stuff done for all those Americans Washington has left behind. Quote Tweet POLITICO Magazine @POLITICOMag Steve Bullock was supposed to be the key to unlocking Trump voters. Here's why he thinks he still has a chance: http:// bit.ly/2pcHfQB", "2019-10-25T22:30:00.000Z": "I'm running for President to get stuff done - and I have the plans and the record to do it. https:// stevebullock.com/fair-shot-agen da/ ", "2019-10-25T21:06:48.000Z": "\"... @GovernorBullock 's dilemma-start running for president or pass Medicaid expansion-is the billboard case for the absurdity of how the DNC debate rules warp the primary process.\" by ... @RyanLizza ", "2019-10-25T21:04:36.000Z": "$15 an hour. \n\nMinimum.", "2019-10-25T20:00:00.000Z": "I won three elections in a red state, and never once compromised on: Workers' rights Civil rights Women's rights\n\nWe can win back the places we lost and still get progressive things done.", "2019-10-25T18:21:13.000Z": "As a former Attorney General let me make this clear: no one is above the law. Quote Tweet POLITICO @politico Education Secretary Betsy DeVos was held in contempt of court after violating a court order to stop collecting on loans from students who attended a now-defunct for-profit college http:// bit.ly/2N6eo8w", "2019-10-25T17:30:00.000Z": "I don't have the luxury of only going to pockets of blue or making plans for the sake of press releases - I have to get things done.\n\nSo when I say we're going to show up everywhere, listen more than we talk, and deliver on our plans, I mean it. Montana hopeful stops in Little Rock, says boot Trump Montana Gov. Steve Bullock, taking a break from a Democratic presidential campaign largely centered in Iowa, held a luncheon fundraiser in Little Rock on Thursday, where he laid out his pitch as a... arkansasonline.com", "2019-10-25T16:56:04.000Z": "Thank you for making Arkansas a priority on your Presidential campaign Governor Bullock ( @GovernorBullock )! #arpx Quote Tweet John Moritz @JohnMoritz18 Montana Gov. Steve Bullock, a \"pro-choice, pro-union, populist Democrat,\" running for president made a fundraising stop in Little Rock yesterday: https:// arkansasonline.com/news/2019/oct/ 25/montana-hopeful-stops-in-lr-says-boot-t/?news-arkansas ", "2019-10-25T16:20:09.000Z": "You don't get to claim you care about corruption when your budget cuts programs to combat corruption. Trump administration sought billions of dollars in cuts to programs aimed at fighting corruption in... White House officials have said President Trump's phone call with the president of Ukraine, in which he sought an investigation of Joe Biden, as part of a focus on corruption in that country. But... washingtonpost.com"}