{"2020-07-30T17:57:02.000Z": "Thank you, @repjohnlewis , for remembering & honoring those who were attacked & killed in Las Vegas during #1October .\n\nEven in death, Rep Lewis inspires us to do more for our fellow Americans & to, as he says, \"let the spirit of peace & the power of everlasting love\" be our guide. Quote Tweet New York Times Opinion @nytopinion \"I want you to know that in the last days and hours of my life you inspired me,\" wrote Representative John Lewis, who penned this essay shortly before his death on July 17. We are publishing it today, on the day of his funeral. https:// nyti.ms/2DnprJ2 Show this thread", "2020-07-30T16:32:07.000Z": "Nevada is widely recognized as being a leader in election administration, and we will continue to support the safest, most accessible election possible under these unprecedented circumstances. Nevada will hold its election as required by law on November 3. Quote Tweet Donald J. Trump @realDonaldTrump With Universal Mail-In Voting (not Absentee Voting, which is good), 2020 will be the most INACCURATE & FRAUDULENT Election in history. It will be a great embarrassment to the USA. Delay the Election until people can properly, securely and safely vote???", "2020-07-30T16:26:19.000Z": "Wearing a face covering helps slow the spread of #COVID19", "2020-07-30T16:19:55.000Z": "Congratulations, @KateMarshallNV and @YvannaCancela ! Proud to have you both representing the Silver State. Quote Tweet Kate Marshall @KateMarshallNV Honored to be named an officer of the 2020 Democratic National Convention alongside some of our country's best - like NV's own @YvannaCancela and my fellow Lt. Governors @LGMandelaBarnes and @LtGovGilchrist .\n\nWe have an amazing slate of events - make sure to join us Aug 17-20! twitter.com/DemConvention/", "2020-07-29T22:08:36.000Z": "Kathy and I were heartbroken to hear the news of Lt. Erik Lloyd's death. Our hearts go out to his wife, family and entire @LVMPD community for their loss. May he Rest In Peace. Quote Tweet LVMPD @LVMPD The LVMPD mourns the passing of Lieutenant Erik Lloyd.", "2020-07-29T20:05:19.000Z": "Thank you to @repdinatitus and the entire Nevada delegation for working to extend these waivers and streamline the SNAP application process for Nevadans. Quote Tweet Dina Titus @repdinatitus I'm proud to have led this effort to help struggling Nevadans quickly put food on the table. SNAP is a critical lifeline for children and families in the midst of this recession. https:// thenevadaindependent.com/article/as-dem and-ramps-up-simplified-food-stamp-application-process-will-stay-in-place-for-at-least-another-month ", "2020-07-28T19:31:04.000Z": "Thank you to @NevadaDMV for taking this action to help Nevadan access these services online and by mail. Read more details below: Quote Tweet KRNV @KRNV Beginning this fall, most Nevadans will be allowed to renew their driver's license or ID cards online and by mail. https:// bit.ly/3hWvovV", "2020-07-28T19:06:43.000Z": "Please see this important information from @NVAgriculture  Quote Tweet Nevada Agriculture @NVAgriculture (1/5) We have received reports of people getting seeds in the mail from China, often labeled as jewelry, that they did not order. Unsolicited seeds could be invasive, introduce diseases to local plants, or be harmful to livestock. Show this thread", "2020-07-28T18:30:23.000Z": "Just as I have taken aggressive steps to help protect the health and safety of Nevadans from this virus, I respect the decision of CES to protect the health and safety of their employees, attendees and exhibitors in this global pandemic.", "2020-07-28T18:30:22.000Z": "I understand the difficult decision @CES organizers had to make, weighing the current conditions of COVID-19 in the United States and the world at large.", "2020-07-28T18:15:10.000Z": "Thank you to the Nevadans who are bravely sharing their personal experiences with this virus. I am glad to hear their stories of recovery. This virus is not \"just the flu\" and we must continue to take all precautions to protect ourselves and one another. #MaskUpNV Quote Tweet @NVHealthResponse @NVHealthRespon1 Laurie MacAfee, a medic in the Nevada Army National Guard, says her symptoms reached their worst levels on the 11th day of her COVID-19 diagnosis. She felt dizzy, worried she'd pass out and nearly went to the emergency room. Symptoms lasted another week. #NVCovidStory", "2020-07-28T16:46:03.000Z": "I am proud to proclaim today Buffalo Soldiers Day in Nevada, thanks to legislation brought forward by @DallasHarrisNV and supported by the Legislature. Learn more about the history of Buffalo Soldiers Day through this proclamation and this short video. https:// youtube.com/watch?v=mg6k_n _dOR8&t=1s ", "2020-07-28T00:14:31.000Z": "I believe this plan will help us achieve two important goals:\n1: With this new plan, no business, local govt or individual should be surprised by future actions, as the trends, good and bad, will be announced regularly and the resulting actions will be clear.", "2020-07-28T00:13:44.000Z": "That's why I wanted to let Nevadans know tonight that over this next week, the Nevada Health Response Team is working to finalize a long term mitigation strategy for the state of Nevada, that I will be rolling out next Monday.", "2020-07-28T00:13:22.000Z": "Over the last 5 months, we have learned a lot about how best to analyze this data and tackle this disease. For example, in the last 2 weeks while reviewing data using this criteria, we saw several smaller counties frequently move on and off the list. We need more consistency...", "2020-07-28T00:12:18.000Z": "Based on our two-week review of the data, the list has shrunk to four counties:  Clark, Elko, Nye and Washoe. At this time, those four counties will stay with these mitigation measures for the next week.", "2020-07-28T00:12:17.000Z": "Seven counties that met two or more of the criteria were considered at risk and needed to take the additional mitigation efforts of closing bars, pubs, taverns and wineries to slow the spread of COVID-19....", "2020-07-28T00:10:50.000Z": "While these are encouraging signs, it is too soon to know if the state is experiencing an ongoing trend or if our recent numbers are just a small blip.  Either way, the reality is that in our current situation, Nevada still has a high prevalence of COVID-19.", "2020-07-28T00:09:45.000Z": "Today, Nevada's \"R effective,\" dipped under 1.0 slightly to 0.98, which is a good sign. This measures the average number of people who become infected by a person who has COVID-19. When the \"R effective\" is under 1, it means the virus is not spreading as much.", "2020-07-28T00:09:27.000Z": "Recently, we've started to see some positive signs in our data, including a potential slow & gradual flattening out in both cases and hospitalizations. We believe this progress is a result of the previous mitigation measures we have put in place, like mandatory face coverings", "2020-07-28T00:07:52.000Z": "Like so many other states, Nevada has been severely challenged since the outbreak of COVID-19, and in the month of July our case count, hospitalizations and sadly, fatalities, have all been on the rise.", "2020-07-28T00:07:35.000Z": "It's a balancing act- walking a tightrope between the health of our residents & the financial stability of your families and our State. Protecting lives & livelihoods is like dancing on the head of a pin, & it requires daily monitoring, adjustments and enforcement.", "2020-07-28T00:06:24.000Z": "As your Governor, I've been immersed in the fight against COVID for nearly 5 months, along with all of you. Day after long day, along w/ leaders from around the State, I've sought solution after solution to keep Nevadans safer, businesses operating & workers on the job", "2020-07-28T00:05:26.000Z": "Good evening, Nevada. Thanks for joining me tonight. Follow along with my press conference here...", "2020-07-27T19:47:04.000Z": "Tonight at 5 p.m., I will hold a press conference to provide Nevadans an update on our #COVID19 response efforts. The press conference will be streamed online at http:// leg.state.nv.us . Please tune in.", "2020-07-27T17:32:37.000Z": "Significant funds are still available for renters who have been financially impacted by the #COVID19 pandemic, according to Treasurer @ZConine . To begin the application process, visit http:// housing.nv.gov . Quote Tweet Nevada Independent @TheNVIndy More than 3,000 applicants seek help paying past due rent in first week of tenant assistance program, but funds remain\n\nVia @MichelleRindels : https:// thenevadaindependent.com/article/more-t han-3000-applicants-seek-help-paying-past-due-rent-in-first-week-of-tenant-assistance-program-but-funds-remain ", "2020-07-27T15:40:42.000Z": "Spread the love, not the virus. #MaskUpNV Quote Tweet @NVHealthResponse @NVHealthRespon1 Many people are missing human touch during this pandemic, but virtual hugs are the next best thing. Send a virtual hug to a friend or a loved one and help #StopTheSpread . #SocialDistance", "2020-07-25T15:57:59.000Z": "Thank you, Ms. Julia Peek, for sharing this important information about how contact tracing helps slow the spread of #COVID19 and protect Nevadans. Quote Tweet @NVHealthResponse @NVHealthRespon1 Contact tracing is very important to State of Nevada efforts to contain the spread of COVID-19. Julia Peek, deputy administrator with the NV Dept. of Health and Human Services explains the importance of contact tracing in this PSA: https:// youtu.be/PC6gIZsdm9Q", "2020-07-25T03:02:42.000Z": "Everyone who knows @MayorSchieve knows her unending love and commitment to her family. I can't imagine the pain she and her family feel right now. The First Lady and I - and the State of Nevada - will hold you in our thoughts and prayers. Quote Tweet Mayor Hillary Schieve @MayorSchieve I do want to apologize since many have asked. It's always hard to share such personal news. Sadly my beautiful sister just passed away. \nMy family is trying to manage unbearable broken hearts. I want to thank everyone for your patience & kindness during this difficult time. twitter.com/meemerreno/sta", "2020-07-24T19:50:16.000Z": "I appreciate the hard work of @ClarkCountyNV Commissioner @MichaelNaft and his efforts to bring high-speed rail between Clark County and Southern California. Clark County commissioners give approval for high-speed rail line to SoCal An ambitious plan for a high-speed passenger train from Las Vegas to Southern California moved another step closer to reality today following a vote by ... lasvegassun.com", "2020-07-24T17:52:13.000Z": "Today, Board of Finance approved up to $950 million in bonds to assist in the construction of a rail project connecting Las Vegas & Victorville. This long-term infrastructure project will create new jobs and help sustain Nevada's economy for years to come. Quote Tweet Las Vegas Review-Journal @reviewjournal After being docked for over 10 years the long-talked about high-speed rail line between Las Vegas and southern California appears ready to leave the station https:// reviewjournal.com/news/politics- and-government/nevada/nevada-oks-200m-in-bonds-for-vegas-to-so-cal-high-speed-train-2080514/ ", "2020-07-24T16:46:32.000Z": "The State is aware unemployment fraud is a significant issue. \n\nThis fraud is a felony under NRS. Nevada will be investigating fraudulent claims up to & including prosecution & other civil penalties. \n\nCompanies & individuals can report suspected fraud at https:// detr.nv.gov/Page/DETR_Unemployment_Insurance_Fraud_Reporting_Form ", "2020-07-23T23:42:13.000Z": "Thank you to Dr. Fauci for showing the nation how to wear a face mask and get in some physical activity! Quote Tweet ESPN @espn Dr. Anthony Fauci threw out the first pitch before the Nationals-Yankees game.", "2020-07-23T19:39:34.000Z": "Thank you to all our Nevada businesses who are taking extra measures to prevent the spread of #COVID19 . Quote Tweet @NVHealthResponse @NVHealthRespon1 The McAdoos are native Nevadans and grew up in the Elko area. The team at McAdoo's restaurant has a passion for hospitality and are committed to the safety of their community. Thank you, McAdoo's, for keeping safe to stay open! #BattleBornBiz", "2020-07-23T02:16:17.000Z": "Thank you for taking the time to discuss important issues facing Nevada at this time. We appreciate any additional support the federal government can provide. Quote Tweet Mike Pence @Mike_Pence Good speaking with @GovSisolak this morning. I appreciate the open line of communication we've maintained to ensure Nevadans are safe and healthy. We will make sure Nevada has the support it needs to continue to fight the virus.", "2020-07-22T21:30:00.000Z": "Thank you to @NVSupt and others in this partnership for always keeping children at the forefront. We know that having high-quality access to the Internet should not be based on zip code. Quote Tweet Mike Sievert @MikeSievert Replying to @AaronDFordNV The digital divide is a huge detriment to equality across America. Our team appreciates the opportunity to work with you to help bridge it. We'll continue to focus on it in Nevada and beyond!", "2020-07-23T00:58:05.000Z": "I wanted to take a moment to remind Nevadans that #COVID19 is still spreading rapidly in our communities, & we must continue to take every precaution against this virus. Nevada's confirmed cases continue to rise, & right now, we have lost more than 700 Nevadans to this virus.", "2020-07-22T19:11:42.000Z": "Today, Carson City Health and Human Services released an August calendar for community based testing through the Quad Counties. As a reminder, a map of all testing locations can be found online at http:// NVHealthResponse.nv.gov", "2020-07-22T17:13:12.000Z": "Thank you, @NVHealthLink , for proactively expanding the open enrollment period for Nevadans. Open enrollment begins Nov 1 and will run for 75 days, giving Nevadans ample time to enroll in a comprehensive health care plan. Quote Tweet Nevada Health Link @NVHealthLink  For Plan Year 2021, the Silver State Health Insurance Exchange Open Enrollment Period (OEP) will be extended by 30 days, running Nov. 1-Jan. 15! Consumers will now have total 75 days to enroll in a plan! Read our latest press release for more: https:// bit.ly/2OSu4gJ", "2020-07-22T16:07:00.000Z": "Happy birthday to @LGKateMarshall ! Thank you for your service to our great State!", "2020-07-22T15:51:42.000Z": "Thank you to our latest #BattleBornBusiness for helping employees and customers take precautions against #COVID19 . Nominate a Battle Born Business by emailing battlebornbizNV@gmail.com Quote Tweet @NVHealthResponse @NVHealthRespon1 It's how they roll! RTC of Washoe County says the health and safety of its employees and customers are top priorities. By mid-July, the agency installed mask dispensers in all its buses, helping riders comply with the state's mandatory mask-wearing policy. #BattleBornBiz", "2020-07-22T01:01:05.000Z": "We are actively monitoring the #RockFarm fire. Please follow instructions from local agencies and officials. Quote Tweet Truckee Meadows Fire & Rescue @TMFPD Media staging for #RockFarm Fire is at TMFR Station 36, 13500 Thomas Creek Rd. @washoecounty  @WashoeSheriff", "2020-07-21T23:34:20.000Z": "Nevada is proud to join with other @USClimate states urging Congress to consider a stimulus supporting economic recovery, community resilience, reduced greenhouse gas emissions, and public health. Diversifying NV's economic base is key to a vibrant future. #NevClimateAction Quote Tweet US Climate Alliance @USClimate The current economic crisis demands a comprehensive, strategic, & equitable response. Today, @USClimate Alliance governors outline how to do this in a way that puts us on a path to economic recovery and addresses the ever-growing #ClimateCrisis : http:// usclimatealliance.org/usca-stimulus- recommendations ", "2020-07-21T22:22:01.000Z": "Thank you for your support and for wearing a mask. #MaskUpNV Quote Tweet Jose Hernandez @Astro_Jose Though this public service announcement was filmed at the request of Commissioner Jim Gibson for @ClarkCountyNV , this advice to wear your mask in public places apply to us all!  Stay safe! #MasksSavesLives", "2020-07-21T21:38:12.000Z": "Small businesses are the backbone of Nevada's economy and supporting their expansion into foreign markets will help them grow. Quote Tweet GOED @DiversifyNevada In support of @GovSisolak 's priority to help small businesses, our agency has awarded $150,000 in federal grants to 30 #Nevada small businesses to succeed in the international marketplace: http:// ow.ly/aPTE50AEx26 . @SBA  @SBA_Nevada  @NevadaDBI  @USCommercialSvc  #NevadaGlobal", "2020-07-21T15:57:33.000Z": "http:// Nevada211.org is a free and easy way to locate resources near you including, housing, food, transportation, childcare and more. Call, visit the website or download the app. Learn more here:", "2020-07-20T22:12:18.000Z": "Thank you to the King for reminding folks to #MaskUpNV Quote Tweet Dina Titus @repdinatitus Elvis says, \"Wear a mask!\" #MaskUpNV", "2020-07-20T16:52:52.000Z": "Nevadans who need rental assistance can apply online starting today at http:// housing.nv.gov . Thank you to Treasurer @ZConine and all the other partners who were critical in setting up this program. Information is available in English and Spanish. Quote Tweet Zach Conine @ZConine Nevada's $30MM Rental Assistance Program is NOW LIVE\nVisit http:// housing.nv.gov to be directed to the regional assistance program for your county. Show this thread", "2020-07-20T16:31:06.000Z": "Please listen to the following message from Dr. Stephanie Wooddard at @DhhsNevada about resources available to help manage stress, isolation and anxiety during this time. Text \"care\" to 839863", "2020-07-20T02:13:58.000Z": "As Gov, I have been faced with these difficult decisions since this pandemic hit Nevada a little over 4 months ago. I know our lawmakers have seen the impacts in their districts & in this session they have weighed the magnitude of this situation & its impacts on our State.", "2020-07-20T02:13:57.000Z": "Today, I released the following statement after the Nevada Legislature adjourned the 31st Special Session to fill the historic $1.2 billion budget shortfall caused by the COVID-19 pandemic. As the final bills are transmitted to me for signature, I will sign them into law.", "2020-07-20T00:53:27.000Z": "Thank you to #NVLeg for taking the time to recognize the @NVNationalGuard , @DhhsNevada and many other executive branch and LCB staff who helped make this special session possible. Quote Tweet Megan Messerly @meganmesserly The Senate is now discussing Senate Concurrent Resolution 1, which thanks a variety of people for their assistance during the special session, including the state epidemiologist, the Nevada National Guard, the Division of Emergency Management, the Carson City HHS, etc. Show this thread", "2020-07-19T21:27:32.000Z": "Today, I issued the following statement regarding the second special session of the Nevada Legislature. I convened the current session, which is on it's 12th day, to have lawmakers take necessary legislative actions to address the historic budget shortfall caused by #COVID19", "2020-07-19T20:05:45.000Z": "Today, I issued the following statement in regards to the plan to create a $50 million for a new education grant program funded by the CARES Act to help students most impacted by the loss of in-person instruction due to the #COVID19 pandemic.", "2020-07-18T23:18:45.000Z": "John Fudenberg is a true professional, leading the Clark County Coroner's Office with a deep sense of professionalism and compassion, especially after #1October . His retirement leaves behind a big loss and I wish him nothing the best in his future endeavors. Quote Tweet RJ Politics @RJpolitics Clark County coroner John Fudenberg retiring in August https:// reviewjournal.com/news/politics- and-government/clark-county/clark-county-coroner-john-fudenberg-retiring-in-august-2076574/?utm_campaign=snd-autopilot ", "2020-07-18T22:03:04.000Z": "In case anyone is looking for another reason to wear a mask and practice social distancing... 85 infants under age 1 have tested positive for coronavirus in one Texas county since March Eighty-five babies under age 1 have tested positive for coronavirus in one Texas county since mid-March. And local officials are imploring residents to help stop its spread as the state becomes one... cnn.com", "2020-07-18T20:05:36.000Z": "I was honored to attend a virtual memorial ceremony today for my friend John Cummings. He was a true fighter for education and I miss him every day. Seeing these photos and hearing stories from others who knew him was a perfect tribute to a great man.", "2020-07-18T17:38:00.000Z": "Thank you to all these businesses, and many more, who are making sure staff and customers are taking precautions to slow the spread of #COVID19 . Quote Tweet 8 News NOW @8NewsNow NO MASK NO SERVICE: Here's a list of some local Las Vegas stores that are now requiring you wear a #mask  #8NN", "2020-07-18T03:53:10.000Z": "Our country is a better place because of John Lewis. Rest In Peace, Congressman. Quote Tweet Connor Ennis @EnnisNYT A giant. \"John Lewis, a son of sharecroppers and an apostle of nonviolence who was bloodied at Selma and across the Jim Crow South in the historic struggle for racial equality & who then carried a mantle of moral authority into Congress, died on Friday.\" https:// nytimes.com/2020/07/17/us/ john-lewis-dead.html?smid=tw-share ", "2020-07-17T21:10:04.000Z": "Today, the Nevada Division of Insurance offered tips on how Nevadans can protect their assets from wildfires. See more below:", "2020-07-17T17:03:24.000Z": "OPPORTUNITY ALERT Nevada providers may be eligible for these funds. Please see the information below on how to apply. Quote Tweet NevadaDHHS @DhhsNevada Attention Nevada Providers: Federal HHS has announced the opportunity to apply for provider relief funds for eligible Medicaid and CHIP providers under the CARES Act. Deadline to apply is July 20. \n\nMore information here: https:// hhs.gov/sites/default/ files/provider-relief-fund-medicaid-chip-factsheet.pdf ", "2020-07-17T16:02:02.000Z": "Contact tracing helps slow the spread of #COVID19 . Please, answer the call or return the voicemail. Quote Tweet @NVHealthResponse @NVHealthRespon1 Pro tip: Contact tracers will leave a voice message on your phone if you're unable to answer, so please return their call. Your health, and the health of your family, neighbors, and fellow Nevadans, is on the line. Thank you for your support!", "2020-07-16T16:18:30.000Z": "Wearing your mask helps stop the spread of #COVID19 and protects others.", "2020-07-16T02:14:59.000Z": "On Friday and Saturday, @InterNevada will host a free community based testing event for urban Indians and the general public. Please see more details below:", "2020-07-16T00:35:45.000Z": "Kathy and I are sending our best wishes to @GovStitt and wishing him a very speedy recovery.", "2020-07-15T19:35:05.000Z": "Attention Nevada Providers: Federal HHS has announced the opportunity to apply for provider relief funds for eligible Medicaid and CHIP providers under the CARES Act. Deadline to apply is July 20. \n\nMore information here: https:// hhs.gov/sites/default/ files/provider-relief-fund-medicaid-chip-factsheet.pdf ", "2020-07-15T20:53:47.000Z": "Glad to see Lady Liberty got the message. Wearing a mask helps keep us all safe. #MaskUpNV Quote Tweet John Katsilometes @johnnykats Up! @NYNYVegas  @MGMResortsIntl adds face cover to Lady Liberty ... #Vegas  #Strip  #MaskUp4NV  @reviewjournal", "2020-07-15T16:30:50.000Z": "Private Pipkins was the first presumptive positive case of COVID19 in Nevada, back in March. He has a message for Nevadans: follow the CDC guidelines to stop the spread and wear a mask in public. #MaskUpNV", "2020-07-14T22:46:15.000Z": "Without additional federal assistance, a slow recovery, or one in which Nevada lags behind the nation, the current economic & fiscal crises facing the State will be exacerbated. The time for flexible federal funding that can be used to replace billions in lost revenue is NOW.", "2020-07-14T22:46:14.000Z": "Due to COVID-19, state & local governments need robust & direct federal funding to help rebuild the economy & maintain essential services. I stand with #nvleg in their efforts to urge POTUS & Congressional Leadership to provide flexible funding to help fill our budget shortfall", "2020-07-14T18:18:38.000Z": "Being superintendent of one of the largest school districts in the nation requires leadership - especially in a crisis. And leadership requires honesty. Unfortunately, that is not what we get from Superintendent Jara. Clark County students, staff and families deserve better.", "2020-07-14T18:18:37.000Z": "During a pandemic & #NVLEG special session to address a historic budget shortfall, we are focused on how to solve the challenges facing Nevada. But I cannot sit back & remain silent as Supt Jara tries to wrongfully place blame rather than taking responsibility. Enough is enough.", "2020-07-14T18:18:36.000Z": "Today, I issued a statement with @NVSupt regarding AB2, and CCSD Superintendent Jara's statement that the item stemmed from a request from @NevadaReady .", "2020-07-13T19:20:27.000Z": "Keep it up, Nevada! If you're contacted by a contact tracer, please answer the call to help slow the spread of #COVID19 Quote Tweet Megan Messerly @meganmesserly Some contact tracing numbers from today's state COVID-19 press call:\n\nBetween July 6-12, contact tracers logged 6,094 calls. Deloitte's SMS efforts resulted in 6,508 text messages sent. The average response rate is 70% from unique contacts.", "2020-07-13T16:44:35.000Z": "Answer the call to help protect yourself and others from #COVID19 . Our contact tracers will walk you through all the steps you need to take if you've been exposed and can connect you to additional resources. Quote Tweet @NVHealthResponse @NVHealthRespon1 Contact tracing works! Please answer the phone if a contract tracing rep contacts you to help us #slowthespread of #COVID19 .", "2020-07-12T20:15:32.000Z": "#MiMotivoNV  #ShareYourWhy Quote Tweet Maria C. Davis @mcdtranslations #MiMotivo Nuestra Comunidad ... @Covid19Washoe  ... @WashoeHealth ", "2020-07-12T18:53:17.000Z": "Thank you Dr. Ponce from @DhhsNevada for this important PSA to our Spanish-speaking community.", "2020-07-10T20:05:41.000Z": "Additional guidance, county-by-county information, and the directive can be found at Coronavirus (COVID-19) in Nevada | Nevada Health Response Get the latest information and resources on the current status of the Coronavirus (COVID-19) and its impact within Nevada from the Nevada Governor's Office. nvhealthresponse.nv.gov", "2020-07-10T20:04:27.000Z": "Today, in conjunction with @DhhsNevada , I announced the counties considered to be at elevated transmission risk for #COVID19 and will be subject to restrictions as laid out last night. More on the criteria below:", "2020-07-10T02:38:26.000Z": "In addition to the rollback on bars in certain counties, I am also adding new statewide restrictions: all restaurants and food establishments, like pubs, breweries, distilleries, & wineries may not seat parties larger than six people -- indoors or outdoors.", "2020-07-10T02:38:25.000Z": "I have been pleased to see State and local officials working with businesses and communities to enforce these important measures. Nevadans, by and large, continue to heed the call to protect themselves, each other and our State.", "2020-07-10T02:38:24.000Z": "This evening, I updated Nevadans on our response to the COVID-19 outbreak, and the latest actions we are taking as a State to help slow the spread. We can't forget we are still in the midst of a highly contagious and deadly pandemic, and that many areas are experiencing a spike.", "2020-07-09T00:40:25.000Z": "I'll forever be grateful for their service, leadership, long hours, and unending commitment to the people of Nevada during this unimaginable time.", "2020-07-09T00:40:24.000Z": "Taking a moment to thank all of NV's agency directors & staff for their hard work & commitment throughout this historic pandemic & fiscal crisis. In the last four months, they've dedicated themselves to providing services & helping us navigate an unprecedented situation.", "2020-07-09T00:24:18.000Z": "The testing site locator map at http:// NVHealthResponse.nv.gov is updated frequently for Nevadans who are looking to get tested for #COVID19 . If you think you may have been exposed, you can get a test. Coronavirus (COVID-19) in Nevada | Nevada Health Response Get the latest information and resources on the current status of the Coronavirus (COVID-19) and its impact within Nevada from the Nevada Governor's Office. nvhealthresponse.nv.gov", "2020-07-08T18:02:49.000Z": "A livestream of the memorial service for Sgt. Jenkins is available here. I know his memory will live on in those that he meant so much to. Quote Tweet Las Vegas Review-Journal @reviewjournal WATCH LIVE: A memorial service is being held in Elko for Nevada Highway Patrol Sgt. Ben Jenkins, more than three months after he was shot and killed by a motorist north of Ely https:// reviewjournal.com/crime/homicide s/memorial-service-for-nhp-sergeant-watch-live-2069786/ ", "2020-07-08T17:33:47.000Z": "Congratulations to Kasina Douglass-Boone on officially being sworn into the Nevada Assembly. Quote Tweet Colton Lochhead @ColtonLochhead Swearing in, social distance style. \n\nSupreme Court Justice James Hardesty swearing in newly appointed assemblywoman Kasina Douglass-Boone. Show this thread", "2020-07-08T16:00:44.000Z": "Today marks the start of the 31st #NVLEG special session. I appreciate our lawmakers willingness to work together on the undertaking to address this historic budget shortfall. Please practice social distancing and wear a mask so we can all stay safe and get through this together.", "2020-07-08T14:02:12.000Z": "Today, I ordered the flags at half-staff in remembrance of NHP Sgt. Ben Jenkins, whose funeral is being held today in Elko. The First Lady & I are just as heartbroken today as when we first got the news but we know his memory lives on through his family and loved ones.", "2020-07-08T00:30:00.000Z": "Nevada is experiencing a rise in COVID-19 cases in rural and urban communities. Practice the three W's so you can protect others and #StoptheSpread . Thanks @OregonGovBrown for the reminder. \n\n*Wear a face covering\n*Wash your hands\n*Watch your distance", "2020-07-07T18:06:03.000Z": "Congratulations to Kasina Douglass-Boone! Quote Tweet Clark County Nevada @ClarkCountyNV The #ClarkCounty Commission voted today to appoint Kasina Douglass-Boone to the Nevada Assembly. She will fill the seat previously held by Tyrone Thompson, who passed away. #Vegas", "2020-07-07T15:58:03.000Z": "We are actively monitoring the #NumbersFire and encouraging residents to follow local news and emergency officials for the latest updated. Please see below for the latest evacuation information below. Quote Tweet Bureau of Land Management- Nevada @blmnv The #NumbersFire is burning in the Pine View area of Gardnerville, NV, is 4,500 acres and 0% contained. For current evacuation information, visit https:// douglascountynv.gov/government/dep artments/emergency_management/current_emergencies/numbers_fire   The #WillowsFire , West of Eureka on Hwy 50, was 100% contained at 1.7 acres.", "2020-07-07T00:00:34.000Z": "The world looks incredibly different since when I first approved our State's biennial budget back in June 2019. The difficult decisions for Fiscal Year 2021 now lay ahead of us. My proposal preserves as much funding as possible for health, education and the state workforce.", "2020-07-07T00:00:33.000Z": "Today, I am releasing a COVID19 Fiscal Report, which includes details of the Fiscal Year 2021 budget ahead of the Nevada Legislative Special Session planned for Wednesday. None of us could have predicted a pandemic of this magnitude and the global economic crisis that followed.", "2020-07-06T21:00:00.000Z": "#ContactTracing is proven to help #slowthespread of COVID-19. Please answer the call, and thank you for your support!", "2020-07-05T20:14:24.000Z": "While this loss is tragic, Irwin's influence will live on in Nevada for years to come through the various projects he helped develop and the significant impacts of his philanthropic efforts throughout the Las Vegas Valley.", "2020-07-05T20:14:23.000Z": "Irwin Molasky was a great friend and an extremely influential figure in the Las Vegas community.", "2020-07-04T16:43:55.000Z": "Thank you @cityoflasvegas for helping ensure businesses and customers are staying safe this holiday weekend. Quote Tweet City of Las Vegas @CityOfLasVegas Our license officers will be out all weekend to enforce @GovSisolak 's mask directive. twitter.com/GovSisolak/sta", "2020-07-03T21:48:28.000Z": "Thank you @DeanHeller , Gov. Sandoval and @Hutch4Nevada for reminding Nevadans that wearing a mask isn't political, it's a way to protect Nevada's family, jobs and economy. Together, we will get through this. https:// twitter.com/DStewartAppeal s/status/1279165807302291456  This Tweet is unavailable.", "null": "", "2020-07-03T18:36:31.000Z": "Today, I issued the following statement on the latest statewide report on #COVID19 directive compliance.", "2020-07-03T16:40:00.000Z": "Thank you @nevadadcnr for reminding Nevadans and visitors how to #recreateresponsibly this holiday weekend. Nevada State Parks Responsible Recreation Let's work together to stay safe and healthy by practicing responsible recreation while exploring the great outdoors. youtube.com", "2020-07-02T22:44:27.000Z": "Congratulations to these hardworking and bright @ClarkCountySch students. You make Nevada proud! Quote Tweet Las Vegas Review-Journal @reviewjournal Six Las Vegas high school students were named this week as winners in the 2020 9th Circuit U.S. Court of Appeals civics contest https:// reviewjournal.com/local/local-la s-vegas/6-las-vegas-students-win-9th-circuit-civics-contest-2066533/ ", "2020-07-02T21:47:01.000Z": "Today, I sent a letter to the @WhiteHouse , urging the President to reverse his suspension of the J-1 Visa program for educators. This Proclamation would negatively impact 95 teachers, 88 of whom were recruited to fill critical special education vacancies in our State.", "2020-07-02T21:05:13.000Z": "Yesterday, more than 10,000 COVID-19 test samples were collected, with the majority in Southern Nevada. Getting a test is simple and easy. If you think you've been exposed or just want peace of mind, there's a testing site locator map at Coronavirus (COVID-19) in Nevada | Nevada Health Response Get the latest information and resources on the current status of the Coronavirus (COVID-19) and its impact within Nevada from the Nevada Governor's Office. nvhealthresponse.nv.gov", "2020-07-02T16:05:41.000Z": "Thank you @nateschmidt29 of the @GoldenKnights for this reminder to wear a face covering. #MaskUpNV", "2020-07-01T23:43:42.000Z": "These projects are possible thanks to CARES Act relief funding to address food insecurity and challenges of providing food & nutrition assistance safely during the pandemic. Thank you @NVAgriculture & all the organizations committed to addressing this. http:// agri.nv.gov/News/2020/13_o rganizations_to_receive_CARES_Act_funding_to_address_pandemic_food_insecurity_in_Nevada/ ", "2020-07-01T20:12:23.000Z": "Today, I announced I am planning to begin a special session to address the State's Fiscal Year 2021 budget on Wednesday, July 8. The planned date of the session was determined after coordinating with legislative leadership.", "2020-07-01T17:23:59.000Z": "Since Friday, the Division of Industrial Relations has done 259 COVID-related field observations in the state - in addition to local efforts - and has found 85.3% of businesses in compliance. To learn more about Nevada's reopening guidelines, please visit http:// nvhealthresponse.nv.gov", "2020-07-01T16:57:08.000Z": "I am proud to see the partnership between the Reno VA Hospital and the Northern Nevada State Veterans Home to make sure our veterans - even those who are asymptomatic get the around-the-clock care they need to fight #COVID19 . Together, we will get through this.", "2020-07-01T16:22:42.000Z": "Today, the @nevadaCCB officially launched and takes over regulations for the state's cannabis industry. This Board will play a vital role in both supporting the cannabis industry and holding it to the highest standard.", "2020-07-01T16:05:20.000Z": "Members of the @GoldenKnights want to remind Nevadans and visitors to wear a face covering and to #StaySafeStayOpen . First up, a reminder from @reavo7five", "2020-07-01T02:07:23.000Z": "As #PrideMonth draws to a close, I want to reiterate my strong support for our LGBTQ community. As Governor, I'll continue to work with our partners to build on the progress we've made so far in our great State.\n\n(Photos from October '19 Pride Parade Flag photo by @reviewjournal )", "2020-06-30T20:42:24.000Z": "Here's a reminder from Reno Dr. Eric Nielsen on the importance of wearing a face covering when you leave your house.", "2020-06-30T15:50:30.000Z": "Good morning. Today's reminder: Wear a mask. #MaskUpNV", "2020-06-29T22:14:52.000Z": "Today, I signed a directive extending Phase 2 of Nevada's reopening plan until the end of July, consistent with my announcement last week. The extension is necessary due to trends in our #COVID19 data. Please, remember to wear a face covering and practice social distancing.", "2020-06-29T22:14:53.000Z": "If statewide trends do not improve or get worse, I will not hesitate to take any action necessary to protect the public, including reinstituting previous  restrictions. I am currently reviewing all the data to determine potential next steps.", "2020-06-29T17:09:15.000Z": "This morning, I was grateful for the opportunity to join the White House #COVID19 taskforce call with other Governors to talk about our ongoing response efforts to battle this virus.", "2020-06-29T00:42:53.000Z": "State officials are monitoring the #MahoganyFire . Please, avoid the area and monitor local media outlets and emergency response agencies for the latest updates. Quote Tweet Humboldt Toiyabe NF @HumboldtToiyabe Resources are responding to a new start on the #SMNRA near Mahogany Grove off Deer Creek. The #MahoganyFire is estimated at 15 acres.", "2020-06-28T18:45:29.000Z": "Sadly, today marks the 500th loss of life in Nevada due to #COVID19 . These Nevadans were our mothers, fathers, brothers, sisters, aunts, uncles and friends, and Kathy and I mourn this unimaginable loss. We owe it to their memories to do all we can help slow the spread.", "2020-06-28T16:49:21.000Z": "Don't forget: Wear your mask. #MaskUpNV Quote Tweet @NVHealthResponse @NVHealthRespon1 When you wear a face covering, you help protect those around you from #COVID19 . Help keep each other safe by continuing to properly wear cloth face coverings every time, the entire time you're in public. #StoptheSpread  #KeepNVSafe  #MyHealthNV", "2020-06-27T23:28:58.000Z": "State officials, including the Nevada Division of Forestry, continue to monitor and assist with the #PoevilleFire . Please, monitor local media outlets and local emergency response agencies, like @tmfpd and @washoesheriff Quote Tweet Truckee Meadows Fire & Rescue @TMFPD #PoevilleFire currently est. at 250 acres.", "2020-06-26T22:40:51.000Z": "This settlement is a significant victory in our State's effort to keep weapons grade material out of our State. Thank you to the @AaronDFordNV , @SenCortezMasto , @repdinatitus and the rest of the federal delegation for your support. Quote Tweet Aaron D. Ford @AaronDFordNV State of Nevada agrees to settlement with Department of Energy over plutonium shipments https:// mynews4.com/news/local/sta te-of-nevada-agrees-to-settlement-with-department-of-energy-over-plutonium-shipments ", "2020-06-26T20:30:29.000Z": "Today is the first day of the statewide face covering mandate. I encourage all businesses to post signage reminding Nevadans and visitors of these new rules to help us all stay safe and healthy. Posters are available online at http:// NVHealthResponse.nv.gov  #MaskUpNV", "2020-06-26T17:24:32.000Z": "Make sure to wear your face covering! Your face covering should fit snugly around your nose and your mouth and cover from your nose to your chin. #MaskUpNV Quote Tweet @NVHealthResponse @NVHealthRespon1 Wearing is caring! Evidence shows that masks/face coverings are critical in slowing the spread of COVID-19. Wear your mask as a badge of honor to help protect your friends, neighbors, loved ones, and fellow Nevadans. Thank you for helping Nevada #StaySafeToStayOpen .", "2020-06-26T15:28:24.000Z": "Thank you, Batuhan Zadeh, for taking steps to ensure we stay safe and stay open. \n\nSubmit a business for Battle Born Business of the Day by emailing battlebornbiznv@gmail.com Quote Tweet @NVHealthResponse @NVHealthRespon1 Batuhan Zadeh, owner of @HookavaLounge in downtown #Reno , established cleaning stations with UV lights, limited the lounge's capacity to 20 percent, instituted disposable hookah mouthpieces and performs temperature checks at the entrance. #BattleBornBusiness", "2020-06-26T00:41:17.000Z": "Thank you for your support @NevadaAG ! Quote Tweet NV Attorney General @NevadaAG SHARE | Governor Sisolak announced gradual lift to eviction\nmoratorium, announces rental assistance program. \nRead More Here: https:// bit.ly/31eC82Z", "2020-06-26T00:40:24.000Z": "Thank you for your support @bbuckleyad8 Quote Tweet barbara buckley @bbuckleyad8 Thank you @GovSisolak for developing a thoughtful, gradual approach for residential evictions. This gives time for families to figure out next steps, apply for new rental assistance programs, and get the help they need. If any tenants need help, call 702-671-3976 or 702-386-1070. twitter.com/BaileyBortolin", "2020-06-26T00:20:23.000Z": "Thank you @unevadareno for your support. #MaskUpNV Quote Tweet Univ. of Nevada Reno @unevadareno Don't forget to wear your mask! Wearing a mask will help stop the spread of COVID-19, keeping yourself and others you know safe. Stay safe and healthy, Wolf Pack!", "2020-06-26T00:36:19.000Z": "Today, I announced a gradual lift on the evictions moratorium in the State. Thank you to @aarondfordnv , @ZConine and our community partners for collaborating on this important effort.", "2020-06-26T01:04:20.000Z": "Thank you for all your hard work and support, @ZConine ! Quote Tweet Zach Conine @ZConine Thanks to the leadership of @GovSisolak and his staff, the dedication of @AaronDFordNV and the @NevadaAG 's office and extensive input from community parters (tenants and landlords) we can provide both certainty and help to Nevadans who desperately need it. 1/2 twitter.com/GovSisolak/sta Show this thread", "2020-06-25T21:52:50.000Z": "Thank you @lvchamber for your support in wearing face coverings. #MaskUpNV Quote Tweet Vegas Chamber @lvchamber In conversation with Vegas Chamber president @MBSewald & chairman Tom Burns, Governor @SteveSisolak stressed the importance of wearing a #facemask not just for yourself but for everyone. Watch the full episode of Like Nobody's Business here: https:// youtu.be/ZZsg_oWHHEk  #facecoverings", "2020-06-25T18:07:18.000Z": "Thank you to the Nevada State Medical Association for your support! #MaskUpNV Quote Tweet Megan Messerly @meganmesserly The Nevada State Medical Association, which represents docs/PAs, releases a statement supporting @GovSisolak 's mask directive:\n\n\"Wearing masks or appropriate face coverings is an important step to add to our daily routines that will slow the spread of the virus and save lives.\"", "2020-06-25T17:06:13.000Z": "I am pleased to see this new company formed with support of @diversifyNevada 's Knowledge Fund to focus on solutions in agriculture. Quote Tweet GOED @DiversifyNevada The Desert Research Institute ( @DRIScience ) has successfully spun out its first research-based company, Tu Biomics, focused on innovative solutions in agriculture with support from the Governor's Office of Economic Development Knowledge Fund: http:// ow.ly/s6NQ50AhM0J", "2020-06-25T03:17:28.000Z": "Thank you for the support, @LouRuvoCenter ! #MaskUpNV Quote Tweet Lou Ruvo Center @LouRuvoCenter We fully support @GovSisolak 's mandate. When worn properly while practicing physical distancing & hand washing, masks decrease the possibility that anyone who is unaware of being infected with #COVID19 will expose others. Universal masking is consistent w/ guidance from @CDCgov twitter.com/GovSisolak/sta", "2020-06-25T02:45:47.000Z": "Thank you @ZConine ! #MaskUpNV Quote Tweet Zach Conine @ZConine Nevadans take care of their neighbors.  Take care of yours and wear your mask. #maskupnv twitter.com/GovSisolak/sta", "2020-06-25T02:26:55.000Z": "#MaskUpNV Quote Tweet Washoe County Health @WashoeHealth", "2020-06-25T02:26:08.000Z": "Thank you, @UNLVpubhealth ! #MaskUpNV Quote Tweet UNLV School of Public Health @UNLVpubhealth Announced by @GovSisolak today: \n\nMasks in public spaces in Nevada are now mandatory starting Friday. Let's all do our part to stop the spread of #COVID19  Learn more in the tweet below: twitter.com/NVHealthRespon", "2020-06-25T01:59:22.000Z": "Thank you @MBSewald and @lvchamber ! #MaskUpNV Quote Tweet Vegas Chamber @lvchamber @GovSisolak requires #facemasks in public spaces. Vegas Chamber President & CEO @MBSewald wears her #facecovering doing her part helping Nevada #StaySafeStayOpen  #WearYourMask", "2020-06-25T02:21:46.000Z": "Thank you, @nevadadot ! #MaskUpNV Quote Tweet Nevada DOT @nevadadot Safety first. That is why we proudly join @GovSisolak in this: #MaskUpNV . #StaySafeStayOpen", "2020-06-25T01:41:39.000Z": "Thank you, @repdinatitus ! #maskupNV Quote Tweet Dina Titus @repdinatitus Face coverings are key to stopping the spread of COVID-19. @GovSisolak 's leadership will save lives and help bring about Nevada's economic recovery. #MaskUpNV", "2020-06-25T01:43:52.000Z": "Thank you @SenJackyRosen ! Quote Tweet Senator Jacky Rosen @SenJackyRosen Wear your mask", "2020-06-25T01:51:29.000Z": "Thank you @sandra4nv ! #maskupNV Quote Tweet Sandra Jauregui @sandra4nv Have I left mine at home before, yes.  Have I taken it off at a restaurant, yes. Will I follow the Governor's directive, yes! I'm sticking masks in all my bags and car so that I do my part to keep NV safe. #MaskUpNV  twitter.com/GovSisolak/sta", "2020-06-25T01:51:59.000Z": "#MaskUpNV Quote Tweet Selena Torres @selenatorresnv #WearAMask", "2020-06-25T01:55:53.000Z": "Thank you, @votereese ! Quote Tweet Devon Reese @votereese Thank you @GovSisolak", "2020-06-25T01:57:34.000Z": "Thank you for your support! #maskupNV Quote Tweet Silver State Voices @SSV_NV Thank you @GovSisolak for protecting Nevadans during this difficult time!", "2020-06-25T01:49:26.000Z": "Thank you, @EdgarFloresNV ! #maskupNV Quote Tweet Edgar Flores @EdgarFloresNV El @GovSisolak firmó una directiva con un nuevo requisito; todo nevadense y visitante debe usar una máscara o cubreboca, cuando estén en un espacio público. Esta directiva es efectiva el viernes 26 de junio de 2020. #NevadaStrong", "2020-06-25T01:40:39.000Z": "Thank you @MayorJohnLee for your support. #maskupNV Quote Tweet John Lee @MayorJohnLee We need to support @GovSisolak to keep Nevadans safe and our economy open! #choosetheright twitter.com/GovSisolak/sta", "2020-06-25T01:34:05.000Z": "Thank you @RepSusieLee ! #maskupNV Quote Tweet Rep. Susie Lee @RepSusieLee We can't put this pandemic behind us unless we take responsibility for our public and individual health. If we don't, more people will get sick, and more people can die. \n\nMasks in public should be mandatory. This is the right move by @GovSisolak . twitter.com/GovSisolak/sta", "2020-06-25T01:30:58.000Z": "Great looking masks. Thank you for your support, @NeomaJardon ! #MaskUpNV  https:// twitter.com/NeomaJardon/st atus/1275964225404338177  This Tweet is unavailable.", "2020-06-25T01:33:39.000Z": "Thank you for your support, @RepHorsford ! #maskupNV Quote Tweet Rep. Steven Horsford @RepHorsford Wear a mask! Thank you for your leadership, @GovSisolak !", "2020-06-25T01:30:30.000Z": "Thank you for your support @aarpnv ! #maskupNV The following media includes potentially sensitive content. Change settings View", "2020-06-25T01:24:35.000Z": "Protect Nevada's most vulnerable population - the aging - by helping #MaskUpNV . The following media includes potentially sensitive content. Change settings View", "2020-06-25T01:13:28.000Z": "Thank you, @CityOfLasVegas ! #maskupNV Quote Tweet City of Las Vegas @CityOfLasVegas Stay safe. Wear a mask #StaySafeStayOpen", "2020-06-25T01:16:11.000Z": "Thank you @Nevada_ONA ! #MaskUpNV Quote Tweet Governor's Office for New Americans @Nevada_ONA Nevadans: #COVID19 is still here.\n\nFace coverings will now be required when we are out in public esp. when social distancing is not possible. You can make one using a scarf, a bandana, or an old t-shirt!\n\nWe *MUST* do our part to #StopTheSpread More: http:// nvhealthresponse.nv.gov", "2020-06-25T01:12:17.000Z": "Thank you @MKNVspeaks ! #maskupNV Quote Tweet Marilyn Kirkpatrick @MKNVspeaks In order keep our economy open and moving forward we need to #MaskUpNV . Do it for your fellow Nevadans. #StaySafe#StayOpen", "2020-06-25T01:12:35.000Z": "Thank you, @LASairport ! #maskupNV Quote Tweet McCarran Airport @LASairport Heads up if you're flying to or from Las Vegas  The governor of Nevada announced today that face coverings in public spaces will be required effective 11:59 p.m. Thursday, June 25. Be sure to follow the house rules and #MaskUp at LAS!  #AllinLAS", "2020-06-25T01:10:17.000Z": "Thank you, @MichaelNaft ! #MaskUpNV Quote Tweet Michael Naft @MichaelNaft Mask up #NV ! No shirt. No shoes. No mask. No service. #StaySafeStayOpen", "2020-06-25T01:08:57.000Z": "Thank you, @BrittMiller4AD5 ! #MaskUpNV Quote Tweet Assemblywoman Brittney Miller @BrittMiller4AD5 #WearADamnMask  #WearAMask  #MaskUpNevada", "2020-06-25T01:06:46.000Z": "Thank you, @JoyceWoodhouse , for your support! #maskupNV Quote Tweet Joyce Woodhouse @JoyceWoodhouse Everyone:  Please wear your mask.  Doing so will save lives!  Thank you. twitter.com/NVHealthRespon", "2020-06-25T01:08:12.000Z": "Thank you, @lvlcc , for your support! #MaskUpNV Quote Tweet Latin Chamber of NV @lvlcc No Shirt...No Shoes...No Mask...No Service! @govsisolak  #StrongerTogetherMasked", "2020-06-25T01:05:41.000Z": "Thank you, @NelsonAraujoNV ! Quote Tweet Nelson Araujo @NelsonAraujoNV Let's do this together, Nevada.  #WearAMask", "2020-06-25T01:04:37.000Z": "Thank you, @NVEnergy , for your support! #MaskUpNV Quote Tweet NV Energy @NVEnergy NV Energy supports Governor Sisolak's important directive that face coverings be worn in public areas. Wearing a face covering will have a major impact on protecting the health of Nevadans as we continue on the path toward economic recovery.", "2020-06-25T01:02:14.000Z": "Thank you, @JustinJonesNV ! #MaskUpNV Quote Tweet Justin Jones @JustinJonesNV No shirt. No shoes. No mask. No service. #StaySafeStayOpen", "2020-06-25T01:01:30.000Z": "Thank you, @Raiders ! #MaskUpNV Quote Tweet Las Vegas Raiders @Raiders Wear a mask. Do your part. #StayOpenStaySafe", "2020-06-25T01:01:00.000Z": "Thank you for wearing a mask, @Astrid_NV ! #MaskUpNV Quote Tweet Astrid Silva @Astrid_NV Gracias @GovSisolak for mandating folks to wear masks in Nevada! \n\nYou can support your fav immigrant organization @dreambignv AND keep yourself and those you love safe by donating $10 or more at http:// DreamBigNV.org  if you gotta wear it, make it fashion ! #DreamBigNV", "2020-06-25T01:00:20.000Z": "Thank you for your support, @billhornbuckle ! #MaskUpNV Quote Tweet Bill Hornbuckle @billhornbuckle Given the public health situation and the reports of new cases, @MGMResortsIntl supports the Governor's decision to require masks in indoor public places.", "2020-06-25T00:59:03.000Z": "Thank you @BrianforLV ! #maskupNV Quote Tweet Brian Knudsen @BrianforLV . @GovSisolak has made it very clear: Wear a mask. \n\nWe all know that facial coverings can help stop the #coronavirus . Let's work together and do our part to end this terrible pandemic. @CityOfLasVegas", "2020-06-25T00:58:38.000Z": "Thank you @LGKateMarshall ! #maskupNV Quote Tweet Lt. Governor Kate Marshall @LGKateMarshall We can all do our part by wearing a mask   Help us #StaySafeStayOpen ! twitter.com/GovSisolak/sta", "2020-06-25T00:58:08.000Z": "Thank you, @YvannaCancela  #maskupNV Quote Tweet Yvanna Cancela @YvannaCancela Everybody. Wear. A. Mask. Period. twitter.com/GovSisolak/sta", "2020-06-25T00:57:35.000Z": "Thank you for your support, @MayorSchieve ! #maskupNV Quote Tweet Mayor Hillary Schieve @MayorSchieve", "2020-06-25T00:10:19.000Z": "I encourage all businesses to prominently post signage to alert customers and help ensure this directive is followed. I know there are some businesses who have already required face coverings for customers and I thank you for this strong and helpful stance.", "2020-06-25T00:12:06.000Z": "To be clear, due to the data and time needed for evaluation of contact tracing and impacts of this new face covering directive, any discussion of entering Phase 3 will be tabled. The pandemic is not over, we are still in the middle of the first wave of COVID.", "2020-06-25T00:11:12.000Z": "But it's not just on the businesses or state and local government - it's on all of us. I am asking individuals throughout Nevada to take this seriously and understand the risk you are posing on yourself and others by not wearing a face covering.", "2020-06-25T00:07:43.000Z": "This especially applies to indoor activities in which you are near other people, including grocery stores, retail businesses, malls and gaming properties. Detailed guidance is available online at http:// NVHealthResponse.nv.gov . Coronavirus (COVID-19) in Nevada | Nevada Health Response Get the latest information and resources on the current status of the Coronavirus (COVID-19) and its impact within Nevada from the Nevada Governor's Office. nvhealthresponse.nv.gov", "2020-06-25T00:07:44.000Z": "There are exceptions, including those with medical conditions that make it difficult to breathe, those with a disability that prevents them from wearing a face covering, and young children between the ages of two and nine. The full list is outlined in the guidance online.", "2020-06-25T00:06:46.000Z": "My fellow Nevadans: I'm offering us all another opportunity to limit our risk for exposure and infection, and to keep our businesses open and our economy moving. For Nevada to stay safe and stay open, we must make face coverings a routine part of our daily life.", "2020-06-25T00:06:45.000Z": "We owe it to each other to accept the fact that wearing face coverings saves lives. We owe it to the many workers, health care professionals, retail clerks, restaurant workers, grocery store employees to accept that fact. We owe it to Nevada's many businesses to accept that fact.", "2020-06-25T00:05:18.000Z": "We are still watching the continued increase in our confirmed and suspected COVID-19 hospitalizations as well. Recently, that number reached 439 cases in Nevada's hospitals statewide, however, patients requiring ICU beds and ventilators continues to hold steady.", "2020-06-25T00:05:20.000Z": "Clearly for many, the excitement and enthusiasm for escaping our confinement and finally being able to enjoy dinner out with our families, buy new clothes or get a haircut, overshadowed the good judgement we practiced in the previous months.", "2020-06-25T00:05:19.000Z": "At that time, I mandated Nevada businesses and employees who interact with the public wear face coverings and continued to strongly encourage members of the public to wear face coverings as well. Unfortunately, as you can see from the data, we have taken some steps backwards.", "2020-06-24T23:51:48.000Z": "Here is a link to watch tonight's press conference, which will begin promptly at 5 p.m. Governor's Press Conference sg001-harmony.sliq.net", "2020-06-24T21:34:33.000Z": "Welcome to the @NevadaCCB ! This board will help ensure this critical part of our State's economy is positioned to become the gold standard for the nation. Quote Tweet Nevada Cannabis Compliance Board @NevadaCCB Allow us to reintroduce ourselves.", "2020-06-23T19:55:30.000Z": "Please tune in tomorrow at 5 p.m. for an important update on Nevada's ongoing response to COVID19.", "2020-06-23T19:27:00.000Z": "Thank you @KlondexIR & Estill Ranches for partnering with @NevDCNR to help protect critical sage-grouse habitat while ensuring environmentally sensitive mineral exploration. The partnership ensures protection & enhancement of 346 acres of sage-grouse habitat in @WashoeCounty .", "2020-06-23T18:41:29.000Z": "Today, First Lady Kathy Sisolak stopped by @UMCSN to accept a generous donation of PPE from the Chinese People's Association. These supplies will now go to the @NVNationalGuard to help distribute to areas of greatest need in Nevada.", "2020-06-23T02:13:56.000Z": "Thank you to the Nevada State Public Health Lab and Dr. Mark Pandori for all of your hard work on behalf of Nevadans during the #COVID19 pandemic. Quote Tweet @NVHealthResponse @NVHealthRespon1 For our 50th Hero of the Day, we'd like to honor Nevada State Public Health Lab @unrmed . The medical professionals at the lab have processed nearly 60K #COVID19 tests since Feb, ramping up to perform as many as 2K tests a day. Thank you, NSPHL, for your work during the pandemic.", "2020-06-22T17:17:54.000Z": "I am pleased to announce I am appointing Tammy Cordova to the Public Utilities Commission of Nevada. She currently serves as chief counsel for the PUC Regulatory Operations Staff attorneys and will bring more than two decades of experience to the role.", "2020-06-22T18:10:26.000Z": "I'm proud to announce @NevDCNR is developing a #CleanCarsNevada regulation to provide Nevadans w/more choices for purchasing low/zero emission vehicles. #CleanCarsNevada is critical to advance a healthy, resilient, climate-friendly future #NevClimateAction", "2020-06-22T17:32:48.000Z": "Today, on a COVID19 call with @VP Pence and governors, I asked the administration to confirm there is NO federal mandate to slow down testing. Testing is a critical component of monitoring COVID19's spread. Find Nevada's testing locator map & more at http:// nvhealthresponse.nv.gov", "2020-06-21T18:09:40.000Z": "On this Father's Day, please take a few minutes to watch this special Dad's  message to his son and all of us about the importance of mental health.  Thank you, Frank, and God bless you for sharing with us all. Tackling Mental Health Head On You don't have to struggle through mental health issues alone. Watch the video to hear Vice President Frank Hawk's personal experience with suicide and see w... youtube.com", "2020-06-21T15:07:41.000Z": "Happy Father's Day to all of the fathers, grandfathers, godfathers and father figures. I lost my Dad sixteen years ago. Not a day goes by when I don't think of him and miss him. Love you, Dad.", "2020-06-20T17:36:02.000Z": "The State has resources available to help you take care of your mental health now and even after the pandemic is over. See the information below: Quote Tweet @NVHealthResponse @NVHealthRespon1 Happy #SelfCareSaturday , Nevada! While #socialdistancing , it's just as important to take steps to protect ourselves from the harmful effects of stress, anxiety and isolation during this pandemic. Here are some helpful tips.", "2020-06-20T01:03:21.000Z": "I was proud to join a Black Lives Matter Juneteenth march outside of the Capitol today. Juneteenth is a perfect opportunity for reflection and advancement toward true freedom.", "2020-06-20T00:44:34.000Z": "In addition to today's proclamation for Juneteenth, I also signed an executive order lowering the State flags to half staff in honor of those who lost their lives to slavery. Quote Tweet Governor Sisolak @GovSisolak Today, I proclaimed June 19 as Juneteenth Day in Nevada, honoring this day in 1865 when the last slaves in America were freed in Texas, nearly two and a half years after President Lincoln issued the Emancipation Proclamation. Show this thread", "2020-06-19T23:42:35.000Z": "Thank you to Director Korbulic for your steadfast work in helping connect eligible Nevadans to their benefits. Launching a brand new system is no small task and I am grateful to Director Korbulic and her team for their hard work.", "2020-06-19T23:24:05.000Z": "In addition to the Juneteenth proclamation, I wanted to speak directly to Nevadans about the significance of this day during this moment in time. https:// youtu.be/RWs0gGaVHYg Quote Tweet Governor Sisolak @GovSisolak Today, I proclaimed June 19 as Juneteenth Day in Nevada, honoring this day in 1865 when the last slaves in America were freed in Texas, nearly two and a half years after President Lincoln issued the Emancipation Proclamation. Show this thread", "2020-06-19T21:02:35.000Z": "Sarann Knight Preddy was the first Black woman to receive a NV gaming license. Known for her business acumen, Preddy owned and operated clubs and gaming established in central and southern Nevada. She championed civil and women's right. Learn more here: http:// onlinenevada.org/articles/saran n-knight-preddy-entrepreneur ", "2020-06-19T21:02:34.000Z": "Dr. William H. \"Bob\" Bailey, was a devoted civil rights leader and advocate for equality, minority businesses, and education in NV. He would often say, \"Education is the light that blinds ignorance.\"  Learn more here: https:// obits.reviewjournal.com/obituaries/lvr j/obituary.aspx?n=william-h-bailey-bob&pid=171141491&fhid=12179 ", "2020-06-19T21:02:33.000Z": "We have achieved great things in this country and in this State. However, there is still much work to be done in the fight for equality. Life, liberty, and the pursuit of happiness are universal maxims granted to all Americans upon their birth.", "2020-06-19T21:02:32.000Z": "Today, I proclaimed June 19 as Juneteenth Day in Nevada, honoring this day in 1865 when the last slaves in America were freed in Texas, nearly two and a half years after President Lincoln issued the Emancipation Proclamation.", "2020-06-19T17:26:07.000Z": "Nevada Health Response has repeatedly urged the use of face coverings when out in public as one of the strongest methods of mitigating the spread of COVID-19, and directives I've signed mandate the use of face coverings by employees who interact with the public.", "2020-06-19T03:22:38.000Z": "It was a pleasure to have @mariolopezviva stop by the Nevada Governor's Mansion tonight. He is filming a movie in Carson City. I look forward to seeing familiar parts of town in the final product later this year, & I'm proud to see so many Nevadans employed with this project.", "2020-06-18T23:23:54.000Z": "I stand in support of the Supreme Court decision on DACA and the Governor's Office for New Americans. I'm proud to have created this Office last session which helps promote opportunities for immigrants, refugees and aspiring Americans, including DREAMers. Quote Tweet Governor's Office for New Americans @Nevada_ONA . @GovSisolak & ONA applaud the Supreme Court's decision to rule in favor of thousands of DREAMers. Over 14,000 DREAMers are part of our community & have made invaluable contributions to our State. The Court's decision amplifies what we have always known: DREAMers are #HereToStay .", "2020-06-18T21:10:18.000Z": "It was a pleasure to speak this morning with leaders from many of Nevada's 27 tribes during the @InterNevada Executive Board Meeting. I'm grateful for their leadership throughout the COVID-19 pandemic.", "2020-06-18T18:57:24.000Z": "This morning, I joined the Nevada Association of School Superintendents to thank them for their tireless work during the COVID19 pandemic. There's a lot more work ahead and I am grateful to leaders at @NevadaReady and local districts for their commitment to our children.", "2020-06-18T17:18:12.000Z": "An outbreak of this size is troubling to see. I am glad Nevada's faith leaders are taking proactive steps to keep congregants safe during COVID19. I know how difficult it has been, but we must remain vigilant, continue social distancing & other measures to mitigate the spread. Quote Tweet Ed Komenda @ejkomenda A church in rural Oregon is the epicenter of the state's largest coronavirus outbreak, as 236 people tested positive. https:// apnews.com/b2d7a8af05e862 dc3e1d1c3d0cf0afd0 ", "2020-06-18T16:45:48.000Z": "ICYMI: Yesterday, the Nevada State Board of Pardons Commissioners passed a resolution to pardon those who have been previously convicted of minor marijuana offenses. This is a great step forward for Nevada, and this work wasn't done alone.", "2020-06-18T14:29:53.000Z": "DREAMers are Nevadans. They're our neighbors, teachers & friends. They deserve to live and work in our state & country without the constant fear of deportation, and I'm thrilled and grateful that #SCOTUS agrees. DACA is the law! #HomeIsHere Quote Tweet SCOTUSblog @SCOTUSblog #SCOTUS rules against Trump administration in challenge to decision to end #DACA program, which allowed noncitizens brought to this country illegally as children to apply for protection from deportation, holding decision was arbitrary and capricious", "2020-06-17T18:20:56.000Z": "Today, we honor and remember the 9 men and women who were killed 5 years ago in a shooting at Emanuel AME Church in Charleston. Kathy and I are thinking of the families and loved ones affected by this tragedy. We must work to confront and end this senseless violence.", "2020-06-17T19:04:37.000Z": "Today, the Nevada State Board of Pardons Commissioners unanimously passed a resolution I put forward to pardon those convicted of minor marijuana offenses, which are now legal.", "2020-06-17T16:15:07.000Z": "Follow along with today's Board of Pardons Commissioners meeting here. Quote Tweet FOX5 Las Vegas @FOX5Vegas LIVESTREAM: Board of Pardons Commissioners meet to discuss @GovSisolak 's resolution to grant pardons to persons previously convicted of minor marijuana possession.\n\nWATCH LIVE: https:// bit.ly/2YIj76f", "2020-06-16T23:33:24.000Z": "I was able to talk to @nevadadps Trooper Rafael Rodriguez today after he helped a pedestrian who was in distress return to safety. I appreciate Trooper Rodriguez going above and beyond in this scary situation to help a fellow Nevadan. https:// news3lv.com/news/local/its -not-too-late-nhp-officer-recounts-helping-distressed-woman-from-freeway-overpass ", "2020-06-16T17:32:00.000Z": "This morning, I joined a virtual @JAGnational meeting, chaired by @LouisianaGov & provided an update on how @j4ngnv is helping assist more than 3,600 students during COVID19. Our specialists are in weekly contact with students. We know JAG will be more important now than ever.", "2020-06-16T16:10:48.000Z": "Thank you to @therenophil for this beautiful rendition of \"Home Means Nevada.\" This video features more than 80 members of the orchestra and chorus. Reno Phil's Virtual Performance \"Home Means Nevada\" Music finds a way! The Reno Phil Orchestra and Chorus is proud to have put together a virtual performance of Home Means Nevada. As part of the Home Means Nev... youtube.com", "2020-06-16T00:05:36.000Z": "We had the expectation as a result of reopening & an increase in testing, our positive cases were likely to increase. We have seen an increase in positive cases, & that has yet to negatively impact the capacity of hospitals. We are taking this seriously, as we have all along.", "2020-06-16T00:09:14.000Z": "We know from the latest recommendations from the CDC that large gatherings carry a greater risk & that wearing a face covering in gatherings helps reduce the risk. Please, also try to maintain at least 6 feet of social distancing & practice proper hand hygiene.", "2020-06-16T00:09:13.000Z": "This well-established, public health strategy of early detection, tracing and investigating positive cases, along with the data on cases and hospitalizations, will help inform us and empower us to act in ways that protect the public from this virus.", "2020-06-16T00:10:02.000Z": "I want to remind these local leaders: you may use the existing authority set forth in my reopening emergency directives to implement stricter standards than have been set forth by the State if you feel that's in the best interest of your area.", "2020-06-16T00:07:23.000Z": "We were able to enter Phases 1 & 2 because Nevadans were staying home as much as possible, generally wearing face coverings, washing hands frequently & maintaining 6 feet of social distancing. Now is the time to double down on them. We can only stay open if we stay safe.", "2020-06-16T00:05:16.000Z": "This indicates that the increased number of cases in the community has not manifested into serious disease at this point that requires hospitalization, however, this must be closely monitored. There's a lot of info out there and a lot of numbers, so it's best to summarize:", "2020-06-16T00:05:15.000Z": "Our testing has increased, and our cumulative positivity rate is holding steady or continues to decline -- with today's positivity rate at 5.2% . The 7-day average percentage of positive results is increasing.", "2020-06-16T00:05:14.000Z": "Today, I wanted to update Nevadans on our progress and status under Phase 2 of our phased reopening plans in response to COVID-19, as set forth in Nevada United: Roadmap to Recovery.", "2020-06-15T23:21:22.000Z": "Congratulations @nicole4nevada for being named a rising star. Please make sure to cast your vote for Nicole today. Quote Tweet EMILY's List @emilyslist ANNOUNCING: Our 2020 Gabrielle Giffords Rising Star Nominees Cast your vote for which of these six fantastic state leaders you think should be this years' winner: https:// bit.ly/2AmeW85 Show this thread", "2020-06-15T18:59:16.000Z": "Today at 5 p.m., I will hold a press conference to update Nevadans on Phase 2 of the Nevada United: Roadmap to Recovery plan. Please watch online at http:// leg.state.nv.us .", "2020-06-15T16:47:54.000Z": "Today is the first day of phased-in in-person services for @nevadadmv . Remember, many of these services can be done online from the comfort of your own home. Please, check services online before heading to the DMV. Quote Tweet Nevada DMV @NevadaDMV Our @NevadaDMV is open to serve you. But if you can legally drive, please don't visit for the first 30 days.  We need to serve those with no license/ID, no plates, the elderly, disabled and military first.  Visit http:// dmvnv.com for details and online services.", "2020-06-15T14:23:28.000Z": "Great news from the Supreme Court this morning. No one should have to live in fear of discrimination. Quote Tweet The Associated Press @AP BREAKING: Supreme Court rules gay and lesbian people can sue for workplace bias under landmark civil rights law. http:// apne.ws/R8kvRKR Show this thread", "2020-06-14T21:12:18.000Z": "Ditto. Quote Tweet Senator Jacky Rosen @SenJackyRosen Wear a mask.", "2020-06-14T17:13:03.000Z": "Practice social distancing and wear a face covering when you go out in public. It's that simple. Quote Tweet @NVHealthResponse @NVHealthRespon1 When you are out and about remember to practice social distance! #StaySafetoStayOpen", "2020-06-13T00:10:42.000Z": "Today we honor and remember the 49 lives lost during a senseless act of violence at the Pulse nightclub shooting in Orlando four years ago. Kathy and I are thinking of the family and loved ones still in mourning. We cannot and will not let hate win. #PulseRemembranceDay", "2020-06-12T17:41:30.000Z": "The best way for claimants to find information on their claim is to log into their account online. DETR continues to work on refining guidance, and working closely with IT staff to explore technology solutions. I want to thank DETR for their continued hard work to help Nevadans.", "2020-06-12T17:41:29.000Z": "Also, thanks to the implementation of a cloud based phone system, additional staff, & the resolution of issues with phone service providers, DETR's standard UI phone lines are staying open for longer periods of time resulting in more calls getting through to claims staff.", "2020-06-12T17:41:27.000Z": "DETR's PUA vendor is actively recruiting, hiring and training call center representatives and adjudicators to assist with the volume of claims they are currently receiving.", "2020-06-12T17:41:25.000Z": "Additionally, DETR has been made aware of robocallers that have been jamming phone lines. DETR and the vendor have deployed technology to prevent robocallers with the hope that this allows many more calls to be connected to a customer service representative.", "2020-06-12T17:41:23.000Z": "Many individuals and organizations have reached out with concerns about both PUA and standard UI fraud - If you suspect fraud, please file a report with DETR's fraud unit by visiting http:// Detr.nv.gov", "2020-06-12T17:41:21.000Z": "Many of the PUA claims have been identified as potentially fraudulent. DETR has implemented measures to proactively freeze payment and investigate both known and suspected fraud. Nevada is coordinating with other states and entities to stop fraudulent claims prior to payment.", "2020-06-12T17:41:19.000Z": "Adjudicating wages on the back end of a claim is not an option in standard UI, but the CARES Act does allow for this flexibility in PUA and the department is utilizing this option.", "2020-06-12T17:41:17.000Z": "According to the CARES Act, DETR must ensure that PUA claimants are not eligible for standard UI before making PUA payments. Once DETR has determined that a claimant is eligible for PUA payment, it pays on the self-attested wages and will adjudicate the precise wages after.", "2020-06-12T17:41:15.000Z": "Of the remaining eligible unpaid PUA claims many have eligibility issues that are being resolved and payments are processed daily. DETR is finding ways to batch process these claims and release payment to as many people as possible.", "2020-06-12T17:41:13.000Z": "Of the more than 80,000 eligible PUA claims, DETR has paid 47,582 individual claims for a total $355.8 million in PUA and PUA Federal Pandemic Unemployment Compensation dollars.", "2020-06-12T17:41:11.000Z": "DETR has a glossary of terms to help those filing for PUA found at http:// detr.nv.gov/PUA . As of today, there have been 116,996 initial  claims and 1,058,447 claims weeks filed. An estimated 35,600 claimants have not filed weekly claims - around 30 percent.", "2020-06-12T17:41:09.000Z": "Some of those claims filed for standard UI are not eligible -  some did not file a claim for the week and others are pending because federal law requires DETR adjudicate the claim. So far, DETR has paid out over $3 billion in unemployment benefits.", "2020-06-12T17:41:07.000Z": "As of May 30, 529,646 total claims have been filed for standard UI. Of those eligible filers who filed weekly claims - 276,418, or 88% of eligible claims were successfully paid.", "2020-06-12T17:41:03.000Z": "[THREAD] This morning, @DETRNevada provided its weekly update on NV's unemployment insurance (UI) and Pandemic Unemployment Assistance (PUA) numbers.  I wanted to take a moment to highlight these figures & the hard work being done by DETR staff.", "2020-06-12T01:15:02.000Z": "A Regional Public Health Director to support frontier counties\n\nA State COVID Lead Analyst\n\nA COVID Community Health Program Manager \n\nA Disease Investigation Oversight and Planning Lead\n\nAnd a Minority Health and Equity Specialist. \n\nThe folks will supplement our ongoing work.", "2020-06-12T01:15:01.000Z": "We've also made great progress with the @NSHE institutions to develop a system for online training. strategy to hire and oversee paid contact tracers to support our local, tribal, and state public health departments.", "2020-06-12T01:15:00.000Z": "As Mr. Cage shared, we are doing great work across the state with community partners to increase our testing, including tribal partners. Our lab capacity continues to grow every day, as well, so that we can process more tests.", "2020-06-12T01:14:59.000Z": "[THREAD] This morning, COVID-19 response director Caleb Cage & Julia Peek, a deputy administrator in the Community Health Services department of @DHHSNevada provided an update on our ongoing response. I wanted to highlight some of these updates.", "2020-06-11T23:29:24.000Z": "Thank you, @NSHE , for honoring Sam Lieberman in this way. Sam was a champion of higher education and a fighter for the most vulnerable in our society. Quote Tweet NSHE @NSHE The @NSHE Board of Regents honored the memory of deceased Regent Sam Lieberman by awarding him a Distinguished Nevadan Award, renaming a scholarship to the Sam Lieberman Regents' Award for Student Scholarship, and @UNLV will award himan honorary doctorate. https:// nshe.nevada.edu/2020/06/board- of-regents-honor-deceased-regent-sam-lieberman/ ", "2020-06-11T18:36:29.000Z": "Today, I notified State employees of my proposed plans to address the projected Fiscal Year 2021 budget shortfall. Preliminary estimates indicate an approximate $900 million shortfall. When combined with the Distributive School Account the shortfall increases up to $1.3 billion.", "2020-06-11T18:36:30.000Z": "My Office and the Governor's Finance Office continue to work closely with legislative leadership & staff to review & finalize budgetary proposals to address the shortfall & coordinate timing for an upcoming special session to finalize proposals before July 1.", "2020-06-11T23:01:21.000Z": "Today, I am proud to announce the State will distribute $148 million in CARES Act funds to local governments in Nevada to help with unanticipated expenditures related to the pandemic. COVID19 has spared no corner of our State and this money will help the financial recovery.", "2020-06-11T14:29:21.000Z": "If approved, this resolution will clear the slate for thousands of people who bear the stigma of a conviction for actions that have now been decriminalized.", "2020-06-11T14:29:20.000Z": "Today, I announced I am placing a resolution on the Board of Pardons Commissioners agenda next week to provide relief to tens of thousands of Nevadans previously convicted for possession of small amounts of marijuana, which is no longer a crime in the State.", "2020-06-11T01:44:08.000Z": "Today, @NVhealthrespon1 issued guidance for contactless outdoor youth practice during Phase 2 of our Nevada United: Roadmap to Recovery. The full guidance documents can be found online at Coronavirus (COVID-19) in Nevada | Nevada Health Response Get the latest information and resources on the current status of the Coronavirus (COVID-19) and its impact within Nevada from the Nevada Governor's Office. nvhealthresponse.nv.gov", "2020-06-10T22:29:50.000Z": "Thank you @MitchMossRadio for reminding Nevadans and visitors of the precautions we have taken statewide to help keep people safe. We know that social distancing, frequent hand washing and face coverings help mitigate the spread of COVID19. #StaySafeStayOpen Quote Tweet VSiN @VSiNLive Las Vegas is back!! @MitchMossRadio is here to remind you that employees and locals have taken a lot of measures to ensure public safety. Many of us will be wearing masks. Don't be afraid to wear one yourself. Come on out, have a lot of fun, and be safe. #StaySafeStayOpen", "2020-06-10T17:20:04.000Z": "It was a beautiful day in Carson City for a socially distanced @NevadaDPS graduation ceremony for Academy 88. Six of the graduates will go on to become highway patrol troopers and two others will go on to be parole and probation officers.", "2020-06-09T23:49:37.000Z": "The face coverings will be distributed by United Way of Southern Nevada and United Way of Northern Nevada and the Sierra. Remember, wearing a face covering is a simple way to protect yourself and more importantly, to help protect others.", "2020-06-09T23:49:36.000Z": "Today, I wore my new Battle Born face covering made by Las Vegas company Eagle Promotions. The company worked with the Nevada COVID-19 Response, Relief and Recovery Task Force to proclaims 250,000 face coverings for Nevadans who may lack access.", "2020-06-09T20:42:11.000Z": "Today, I signed an emergency directive developed by @nevadaready allowing schools to reopen for learning & activities while implementing protocols aimed at keeping students, & staff safe.\n\nThis allows schools to return to a sense of normalcy while keeping health at the forefront.", "2020-06-09T19:40:20.000Z": "Today's the day! Ballots for the 2020 Nevada Primary must be postmarked today. If you can't make it to a post office, each county has a drop off location for ballots. Visit http:// nvsos.gov for more information.", "2020-06-09T19:04:53.000Z": "There is no place for this in Nevada or anywhere else. Quote Tweet Miles Buergin @milesjbuergin WATCH:\nAt the BLM protest in Fallon, two unidentified protesters dressed in white hats, similar to the Klu Klux Klan, showed up after demonstrators on both sides were dispersing. Both walked away from the demonstration but were followed by Fallon police.\n\nVideo: Desire Lynn", "2020-06-09T15:08:27.000Z": "COVID19 is still among us and you could be infected with the virus without showing symptoms. If you were at or near a protest, medical experts recommend you get a COVID19 test six or seven days after the event. Find testing locations at Coronavirus (COVID-19) in Nevada | Nevada Health Response Get the latest information and resources on the current status of the Coronavirus (COVID-19) and its impact within Nevada from the Nevada Governor's Office. nvhealthresponse.nv.gov", "2020-06-08T23:23:57.000Z": "Today, Kathy and I are thinking of the families and loved ones who are still grieving this senseless loss of life six years later. Quote Tweet LVMPD @LVMPD Today we remember LVMPD Police Officers Alyn Beck and Igor Soldo, murdered six years ago in an ambush attack during their lunch break. We also honor #LasVegas resident Joseph Wilcox, who died when he heroically tried to intervene to stop the killers. #LVMPD  #NeverForget  #RIP", "2020-06-08T21:18:10.000Z": "Today, the @nevadaDMV announced they will reopen all branch offices for services starting on June 15. Nevadans should continue to access online services where possible and can visit http:// dmvnv.com for more information about in-person services.", "2020-06-08T17:48:05.000Z": "Thank you, @aarondfordnv , for this reminder. Primary election ballots must be postmarked on or before June 9! You can also find drop off locations by visiting http:// NVSOS.gov Quote Tweet Aaron D. Ford @AaronDFordNV Nevadans, you can still #VoteByMail today and tomorrow. Drop you ballots in the mailbox and have your voices heard.", "2020-06-08T16:47:27.000Z": "Today, @dhhsNevada announced a federal grant to provide crisis counselors in community programs. In addition to direct counseling, the $654,640 in funding will help provide information on other resources available to bring awareness on healthy ways to cope and manage stress.", "2020-06-08T16:20:42.000Z": "Thank you to Coeur Mining & Crawford Ranch for partnering to help protect critical sagebrush habitat in Nevada while ensuring continued environmentally sensitive & sustainable mining practices. Coeur is providing funds to preserve & enhance 3,000 acres of sage-grouse habitat. Quote Tweet Nevada DCNR @NevDCNR The Nevada Sagebrush Ecosystem Program's \"Conservation Credit System\" underscores how environmental conservation and a thriving economy go hand-in-hand. @CoeurMining and @Crawford Ranch have entered into a first-of-its kind habitat protection agreement!", "2020-06-08T15:23:02.000Z": "This weekend, Nevada passed 200,000 tests statewide. Increased testing is an important component as we move forward with our phased-in reopening. To find out more about the State's reopening plan and to find a testing site near you, visit Coronavirus (COVID-19) in Nevada | Nevada Health Response Get the latest information and resources on the current status of the Coronavirus (COVID-19) and its impact within Nevada from the Nevada Governor's Office. nvhealthresponse.nv.gov", "2020-06-06T22:14:22.000Z": "Thank you for having me at the first \"I Can't Breathe - A Time for Healing Event\" at Ty's Place. The youth shared how recent experiences have affected them personally. It was a tough conversation to hear, but I'm so grateful I was there. We owe it to them to do this together.", "2020-06-06T21:23:46.000Z": "On this day 76 years ago, more than 160,000 troops landed on the beach in Normandy, France, to fight Nazi Germany. Today and everyday, we honor and remember their service and sacrifice. #DDay2020 Quote Tweet U.S. Army @USArmy Today is #DDay .  A day to honor our heroes. \n\nMore than 160,000 brave Allied troops landed along a 50-mile stretch of heavily-fortified French coastline to fight Nazi Germany on the beaches of Normandy, France, June 6, 1944.", "2020-06-06T15:30:02.000Z": "Thank you, @KateMarshallNV and @ded_renosparks for helping deliver 10,000 meals to those in need. Together, we will get through this. Quote Tweet Kate Marshall @KateMarshallNV As of this week @dwd_renosparks has delivered 10,000 meals in the Reno Sparks area!! So proud of our community. #StrongerTogether twitter.com/dwd_renosparks", "2020-06-06T01:07:00.000Z": "Thank you to @WillMcCurdyII for joining me to visit a few businesses on the Historic Westside. These local businesses are owned by our neighbors and friends and like many of us, they've weathered a lot the last few months. I am glad to see them reopening and doing well.", "2020-06-05T20:55:19.000Z": "CARES Act funding is now available to help non-profit community organizations and government agencies implement much-needed projects to address food insecurity caused by the COVID-19 pandemic. Apply with @NVAgriculture by June 17: http:// agri.nv.gov/News/2020/$2_8 8_million_in_CARES_Act_funds_available_for_food_insecurity_initiatives_in_Nevada/  Quote Tweet Nevada Agriculture @NVAgriculture We are pleased to announce $2.88 million in CARES Act funds have been earmarked to address food insecurity in Nevada.\n\n**The DEADLINE for nonprofit communnity organizations and government agencies to apply is June 17!** http:// agri.nv.gov/News/2020/$2_8 8_million_in_CARES_Act_funds_available_for_food_insecurity_initiatives_in_Nevada/?fbclid=IwAR1Ct9_5wKMZ5lM49a1LlzkgoL34Kh3roHzyxvSz9X3SK7HF6OVsd_Bop8A  Show this thread", "2020-06-05T20:16:31.000Z": "Glad to see Nevada Division of Forestry working with our federal partners to get ahead of what will be an above average wildfire threat this season. Now is the time to visit http:// livingwithfire.com to keep your home and community safe. Quote Tweet Sam Metz @metzsam On @USFS 2020 Fire Season Outlook phone presser, @ChiefDave_RFD says Nevada firefighters will all be symptom-checked before being deployed to fight fires. They're going to restrict fire camp travel and quarantine modules of firefighters to limit # of exposures and maintain force. Show this thread", "2020-06-05T19:43:30.000Z": "If you are traveling to Nevada, we're excited to welcome you! Come and enjoy all we have to offer and please remember to wear a face covering, wash your hands often and practice social distancing.", "2020-06-05T19:43:05.000Z": "Nevada, particularly the Las Vegas Strip, has always been a warm and welcoming spot for visitors. The Gaming Control Board is working closely with casino properties to make sure they maintain compliance to help keep people safe. So far, there have been very few issues.", "2020-06-05T18:58:35.000Z": "Thank you to @SDougMorg for your hard work with the Gaming Control Board to make sure our casino properties statewide are following strict protocols to help protect the health and safety of Nevada's workers and visitors.", "2020-06-05T18:58:20.000Z": "This morning, I visited a few properties on the Las Vegas Strip to see how reopening of casinos is going. I'm so pleased to see lots of face coverings, hand sanitizer and social distancing.", "2020-06-05T18:11:43.000Z": "I'm grateful for their leadership, guidance, and voices every day, but especially during this critical time in our State. I am committed to seizing this moment and taking the time to listen and take action. We can do this, but only if we do it together as Nevadans.", "2020-06-05T18:11:42.000Z": "I want to thank Attorney General @AaronDFordNV , Speaker @JasonFrierson & Assemblywoman @Daniele4NV for joining me today to discuss the recent protests over the senseless killing of #GeorgeFloyd & the systemic injustices facing Black Americans.", "2020-06-05T14:38:05.000Z": "Thank you to @AaronDFordNV , @JasonFrierson and @Daniele4NV for joining me today.", "2020-06-05T14:37:41.000Z": "This morning, I will be joined by elected leaders to make brief statements & answer press questions addressing recent protests over the senseless killing of George Floyd & the systematic racism & injustice Black and minority communities face. Media must RVSP to press@gov.nv.gov", "2020-06-05T01:39:40.000Z": "We have to challenge ourselves to not get defensive & to really listen.  \n \nI call on all Nevadans to seize this moment to ask themselves, \"what can we do to fully respect and understand the very deep and very real emotional harm that's been done to our Black community members?\"", "2020-06-05T01:39:07.000Z": "To our law enforcement officers, I ask that you be patient, compassionate, & sympathetic.   \n \nLaw enforcement needs to play a critical role in helping our community heal & forging stronger partnerships with those you serve & for those of you who have already begun, thank you.", "2020-06-05T01:38:19.000Z": "For those who will be out on our streets asking to be seen and heard, I thank you. Please do so safely and lawfully.  We know that in at least a few instances, outside agitators have coopted your events to advance their own agendas.  Know that we are aware of this.", "2020-06-05T01:38:10.000Z": "I look forward to meaningful dialogue that leads to real change.  I also look forward to signing legislation next session that comes from these conversations.", "2020-06-05T01:37:40.000Z": "Here's what I can commit to you.  I will no longer be party to a system that dictates how minority communities should express their First Amendment right to protest, or their human right to grieve.", "2020-06-05T01:37:15.000Z": "As Governor of Nevada, it is my duty to speak out on behalf of all Nevadans, but particularly those who may not otherwise have a voice that is being heard.", "2020-06-05T01:36:53.000Z": "The statement that Black Lives Matter should not be controversial.  It should not be subject to debate.  It should not invite any connotation that the fact that Black Lives Matter diminishes the value of any other lives.   \n\nThis declaration is true in the absolute.  Period.", "2020-06-05T01:36:29.000Z": "George Floyd died because the officers who were arresting him did not listen to his cries that he could not breathe.   \n \nAnd because Mr. Floyd can no longer speak for himself, protesters are speaking for him. I am asking all Nevadans to listen to our neighbors who are crying out", "2020-06-05T01:35:54.000Z": "The protests over the past few days were ignited by the deaths of George Floyd & Breonna Taylor.  But the anger & grief behind these protests grew out of a longer history of these incidents.  The list is too long to name them all, but many of these names are recognizable to you.", "2020-06-05T01:34:56.000Z": "Today, I wanted to address Nevadans about the crisis we are facing that has emerged due to events in the last couple of weeks, but stem from generations of inequality.", "2020-06-05T01:34:30.000Z": "And lastly, we are facing a crisis of faith in our criminal and social justice system. It is safe to say that we have never before been so greatly challenged over such a short period of time. \n \nOur lives and our state will forever be changed as a result of the last 90 days.", "2020-06-05T01:34:17.000Z": "Secondly, that health crisis has resulted in an unprecedented economic crisis - with record unemployment in a global recession, and a budget shortfall that will lead to more difficult decisions on how to recover.", "2020-06-05T01:34:04.000Z": "It left us with incredibly difficult decision to shutdown the majority of our economy in order to save thousands of lives and protect the health of the public.", "2020-06-05T01:33:47.000Z": "We are living in historically trying times. Over the past few months, Nevada has been faced with three major crises.\n\nFirst, we are facing a public health crisis as a result of the COVID-19 global pandemic - something that we haven't experienced in over 100 years.", "2020-06-05T01:33:13.000Z": "My fellow Nevadans,   \n\nI want to start by joining the rest of our State in extending my prayers to @LVMPD Officer Mikalonis.  \n\n Earlier this week, I had the opportunity to visit him at UMC. Kathy and I are praying for his recovery.", "2020-06-05T01:40:17.000Z": "Let's love one another, as we work through these hard times. There is no doubt that if we do that, we will come out stronger.  \n\nThank you!", "2020-06-05T01:40:10.000Z": "For me, it will start with listening and will end with action. But it will take all of us.  \n \nNevadans come together when we need each other most.  We band together to mourn with each other, support each other, and cheer for each other.", "2020-06-05T01:30:23.000Z": "Today, I released a message to Nevadans addressing the recent protests over the senseless killing of George Floyd & the systematic racism & injustice Black & minority communities face, which stem from generations of inequality. \n\nYou can watch it here: Governor Sisolak's June 4th Address youtube.com", "2020-06-04T22:10:34.000Z": "For the first time since the pandemic began, Centennial Hills Hospital, a member of the @valleyhealthLV system, reported no confirmed COVID19 hospitalizations. This is great news! Thank you to the doctors, nurses & other professionals for your diligent work in treating patients.", "2020-06-04T18:16:12.000Z": "Kim, Kalen, and Jeff have been diligently helping Nevada's deaf and hard of hearing community stay informed during the #COVID19 pandemic and it's been my pleasure to work alongside them. Quote Tweet @NVHealthResponse @NVHealthRespon1 Kalen Beck, Jeff Jaech and Kim Johnson have worked a lot of overtime as interpreters during the COVID-19 pandemic to provide Nevada's deaf & hard of hearing community the most up to date information from elected and community leaders across the state. Thank you Jeff, Kalen & Kim!", "2020-06-04T16:52:33.000Z": "GOAL 5: Protect vulnerable populations. Nevada is one of four states identified this week by the Centers for Medicare & Medicaid Services as having inspected all nursing homes to make sure they're meeting federal infection control standards.", "2020-06-04T16:52:32.000Z": "GOAL 3: Testing expansion. In the month of May, Nevada increased our daily testing by 500 percent and Nevada is now able to test all patients, regardless of whether they are experiencing symptoms or not. We also recently launched a testing locator map at @NVHealthRespon1", "2020-06-04T16:52:31.000Z": "This data reflects the hard work &dedication of Nevadans through State who have taken the threat of this virus seriously, banded together as a community & have taken proactive, measured & necessary steps to flatten the curve, protect our healthcare system and allow us to reopen.", "2020-06-04T16:52:30.000Z": "Good morning! Just over a month ago, I announced the Nevada United: Roadmap to Recover plan, where I laid out five criteria State officials would be monitoring as we began a gradual, phased in reopening progress. This morning, I'd like to share some updates.", "2020-06-04T02:05:33.000Z": "Please take a survey of your surroundings for any damage to report to authorities, prepare for potential aftershocks and keep an eye on local media for updates. Quote Tweet KTNV Action News @KTNV UPDATE: US Geological Service has recorded a 5.5 earthquake 17km south of Searles Valley, CA at 6:32 p.m. https:// ktnv.com/news/earthquak e-in-southern-california-felt-in-las-vegas ", "2020-06-04T01:34:55.000Z": "I am thankful to the @USAO_NV for their diligent work so far in this case, which has results in the arrest of three men seeking to exploit peaceful protests for their own agenda. There is no place for this in Nevada. Quote Tweet US Attorney Nevada @USAO_NV Joint Terrorism Task Force Charges Three Men Who Allegedly Sought to Exploit Protests in Las Vegas & Incite Violence @LasVegasDA  @FBILasVegas  @LVMPD  https:// go.usa.gov/xwWKK", "2020-06-04T00:06:49.000Z": "Thank you @SDougMorg for helping inform Nevadans, the nation, & the world, about reopening gaming in Nevada. From day one, the Gaming Control Board & I have committed that reopening must be done in manner aimed at protecting the public health of Nevadans and visitors. Quote Tweet Zach Conine @ZConine Great to see the best gaming regulator in the country, @SDougMorg on @CNBC talking about the reasoned and thoughtful approach to reopening gaming in Nevada.", "2020-06-03T22:44:42.000Z": "Today, we released a comprehensive plan covering our disease outbreak management strategy and concept of operations. Read the full plan here: https:// nvhealthresponse.nv.gov/wp-content/upl oads/2020/06/COVID-19-Disease-Outbreak-Management.pdf  Quote Tweet Nevada Independent @TheNVIndy State to acquire 200,000 test kits, 600 contact tracers, 60-day supply of personal protective equipment under new COVID-19 response plan\nBy @meganmesserly  https:// thenevadaindependent.com/article/state- to-acquire-200000-test-kits-600-contact-tracers-60-day-supply-of-personal-protective-equipment-under-new-covid-19-response-plan ", "2020-06-03T18:54:32.000Z": "Getting a COVID19 test is quick and easy. To find a testing site near you, visit the testing locator map on the @NVHealthRespon1 website. New sites are added daily. Find COVID-19 Testing in Nevada | Nevada Health Response Now more than ever, testing for COVID-19 is critical. In Nevada, health officials and professionals are working hard to ensure that anyone who needs a test can get one. It's the only way we'll know... nvhealthresponse.nv.gov", "2020-06-03T18:04:47.000Z": "Please tune in now to hear exciting updates on Nevada's COVID19 testing and contact tracing plan. Quote Tweet Las Vegas Review-Journal @reviewjournal WATCH LIVE: Nevada COVID-19 Response provides an update on on testing, contact tracing, and funding plan https:// reviewjournal.com/news/politics- and-government/nevada/nevada-officials-to-brief-on-testing-contact-tracing-plans-livestream-2044042/ ", "2020-06-03T16:35:22.000Z": "I am so pleased to see the U.S.S. Reno flag is safe and has been returned to City Hall. As indicated in the article, the crew of the U.S.S. Reno were credited with shooting down 5 enemy airplanes & assisted in downing at least 2 more during World War II's Battle of Iwo Jima. Quote Tweet Kenzie Margiott @kenzie_bales I am speechless. \n\nA box with my name written in Sharpie was anonymously delivered to the station this afternoon. Inside, the flag from the U.S.S. Reno that went missing from city hall during Saturday's riots. I'm so thankful. \n\nMy story: https:// bit.ly/2ZZB6Hu", "2020-06-02T23:03:59.000Z": "The Guard will not be on the front lines, making arrests or doing crowd control. Their mission is to act as support personnel & they will focus on protecting critical facilities, preserving public safety & allowing individually to exercise their rights to peacefully demonstrate.", "2020-06-02T23:03:45.000Z": "Today, in response to a local request in Southern Nevada, I activated additional members of the @NVNationalGuard to provide support for State and local law enforcement.", "2020-06-02T20:16:21.000Z": "I ask everyone to pray for the officer's family, for the victims of violence and for peace and justice in our community. I am committed to working with community leaders & all those interested in solutions that lead to real social justice reform and unity. Quote Tweet Governor Sisolak @GovSisolak Today, I released the following statement on the shooting of a Las Vegas Metropolitan Police Officer.", "2020-06-02T20:12:22.000Z": "Today, I released the following statement on the shooting of a Las Vegas Metropolitan Police Officer.", "2020-06-02T08:02:10.000Z": "My Office has been notified that the Las Vegas Metropolitan Police Department is currently working two separate incidents in Las Vegas. The State is in contact with local law enforcement and continues to monitor the situation.", "2020-06-02T02:42:12.000Z": "Today, I released the following statement in response to President Donald Trump \"strongly recommending\" that all Governors \"deploy the national guard in sufficient numbers that we dominate the streets.\"", "2020-06-01T19:44:02.000Z": "Today, @unlv and @dhhsnevada announced a new confidential call line with resources and support for health care workers across our State. The call line is supported by grant funding and is available Monday through Friday 8 am to 8 pm.", "2020-06-01T02:13:10.000Z": "During this critical time, there is no place for those who seek to cause destruction in our cities & neighborhoods, resulting in the drowning out of voices that deserve to be heard. As I've said before, we must not rest until everyone in our communities feels safe & respected.", "2020-06-01T02:12:51.000Z": "I urge all Nevadans to listen to your fellow community members who are peacefully protesting systemic racism and injustice tonight. The agony and repeated frustration in these pleas for change are real and should serve as a collective call to action.", "2020-06-01T00:19:38.000Z": "Thank you @NevadaAG for hosting this important panel discussion on George Floyd & related protests. Communities throughout our State are better served because of your continued leadership as our top law enforcement official. Quote Tweet NV Attorney General @NevadaAG Thank you for tuning in today to our panel discussion on George Floyd and related protests. We appreciate your patience with our technical difficulties. We have recorded the video and appreciate you being a part of this important discussion. https:// youtu.be/0AVtqrKTWmQ", "2020-05-31T20:12:43.000Z": "We went down to Virginia Street to see more of the clean-up efforts at City Hall and local businesses. I am so proud of these communities who came together today. This is what Nevada is truly about.", "2020-05-31T17:38:40.000Z": "My Fellow Journalists, Please don't let all of the rioting stop you from covering the stories of the people who are Marching for justice. Their voices matter & there are so many other stories in that crowd, don't just cover what's obvious. Find the stories & the humanity.", "2020-05-31T18:59:34.000Z": "Thank you to all the volunteers for your help in your community. There's a fresh coat of paint going up at @renopolice .", "2020-05-31T18:43:45.000Z": "This morning, the First Lady and I joined @mayorschieve and others in clean-up efforts in downtown Reno. I am so proud of those who came out to help pick up the pieces of our community. This is the Nevada we know & love.", "2020-05-31T04:04:53.000Z": "Based on circumstances going on in Reno and at the request of local leaders, I have activated members of the @nvnationalguard to secure government buildings.", "2020-05-31T03:26:06.000Z": "Effective immediately we will be placing Washoe County under an Immediate curfew until 7am Sunday morning. I have been in contact with @GovSisolak and @WashoeSheriff to make sure we ensure the safety of our entire region.  Please be safe and stay home.", "2020-05-31T03:28:52.000Z": "In addition to the @CityofReno , EFFECTIVE IMMEDIATELY, Washoe County is also under curfew until 7am tomorrow morning.", "2020-05-31T03:14:28.000Z": "I know our communities are reeling from the injustice and heartbreak. As I said today, we respect and defend the right to protest, but we need people to express themselves peacefully. @cityofreno has issued a curfew for the city. Please stay home and avoid downtown. Quote Tweet City of Reno @CityofReno The City of Reno has issued a mandatory curfew for tonight, May 30, effective immediately. Residents are asked to please avoid the downtown area, and to adhere to the curfew to help protect the safety of our community. \n\nMore: https:// reno.gov/Home/Component s/News/News/19502/576 ", "2020-05-30T22:02:03.000Z": "When I say we hear you, it's from life lessons. Compton raised, my childhood included excessive interaction w police. It meant I had special rules as a black boy that I now teach my son. I need to show him model cops too. Moving fwd we can't let George Floyd's death be in vain. Quote Tweet Governor Sisolak @GovSisolak Today, I released the following joint statement with @aarondfordnv and @jasonfrierson in response to the Friday evening protests in Las Vegas. \n\n\"George Floyd was killed by a despicable and loathsome Minneapolis police officer. Show this thread", "2020-05-30T20:49:57.000Z": "And, be assured we will not rest till everyone in our community feels safe and respected.\"", "2020-05-30T20:49:47.000Z": "To the protesters...we hear you and we are listening, and more importantly, we invite you to be part of a constructive solution, and the healing our community desperately needs. We respect and defend your right to protest, but please express yourselves peacefully.", "2020-05-30T20:49:36.000Z": "Despite those proud accomplishments there is so much more we must do to ensure social justice, equal opportunity, better education, and the overall eradication of all forms of racism in our communities and our State.", "2020-05-30T20:49:27.000Z": "In just the past few years, Nevadans have elected the first African American Supreme Court Justice, Speaker of the Assembly, Attorney General, Congressman and the first Latina to the United States Senate.", "2020-05-30T20:49:16.000Z": "In the last 20 years, community, law enforcement, and government leaders have been working together in efforts to address the issues that divide us and the tragic consequences of bigotry.", "2020-05-30T20:49:04.000Z": "Here in Nevada, while racial, social, & cultural divides still exist, we have made significant strides in confronting these schisms.", "2020-05-30T20:48:51.000Z": "He & the other officers who watched, & didn't come to Mr. Floyd's aid, should be prosecuted to the fullest extent of the law. Of that, we have no doubt.", "2020-05-30T20:48:38.000Z": "Today, I released the following joint statement with @aarondfordnv and @jasonfrierson in response to the Friday evening protests in Las Vegas. \n\n\"George Floyd was killed by a despicable and loathsome Minneapolis police officer.", "2020-05-29T22:59:15.000Z": "Today, @NVHealthRespon1 launched a new testing locator map on its website, http:// nvhealthresponse.nv.gov . Nevadans can use this new tool to find a testing site nearby. The tests are quick, easy and in some cases, you can stay in your car!", "2020-05-29T19:32:32.000Z": "I look forward to @Lisa_c_levine serving Nevada's higher education community as an @NSHE regent. She brings a wealth of experience. \n\nWe miss Regent Lieberman every day and I am confident Lisa will continue his work as a champion for higher education. Quote Tweet NSHE @NSHE @NSHE Welcomes Regent @Lisa_C_Levine who was appointed by @GovSisolak . https:// nshe.nevada.edu/2020/05/nshe-w elcomes-new-regent/ ", "2020-05-29T18:40:14.000Z": "Thank you, @nevadaready , for this wonderful resource to help keep our children busy reading this summer! Learn more about how to stay engaged here Quote Tweet Nevada Ready! @NevadaReady You have more choices than ever before to keep reading all summer long! Check out this video outlining our partnerships with READ Nevada with myON and our State Library and local libraries: https:// bit.ly/READNevada  #SummerReading  #COVID19  #READNevada  #NevadaReady", "2020-05-29T16:45:51.000Z": "Thank you, Lindsay and Zoey, for continuing your important work for Nevadan during this pandemic! Quote Tweet @NVHealthResponse @NVHealthRespon1 Since the end of March, Lindsay Wheeler and Zoey Cornelius, 16, founders of @ProjectDotLove , have delivered 1,200 feminine hygiene kits to partners including @SpreadtheWordNV , @SHAREVillageLV , the @CityOfLasVegas and COVID-19 temporary shelters. #NationalMenstrualHygieneDay", "2020-05-29T16:54:26.000Z": "This morning, @detrnevada shared that both initial & weekly claims fell for the week ending May 23. Of the weekly claims filed ending week May 16, the latest data available, 84% of eligible claims were paid. More than 37,000 initial PUA claims were filed in the first full week.", "2020-05-29T01:40:53.000Z": "Thank you to our local law enforcement professionals, including @sheriff_lvmpd , @sheriffbalaam , @chiefjasonsoto and others, for your statement of support and your leadership.", "2020-05-29T01:30:13.000Z": "For too long, our county has shown apathy and indifference to the racism faced by black Americans. This must change. We can no longer be silent in the face of the systematic racism that black people experience and we must take actions to stop the violence.", "2020-05-29T01:29:58.000Z": "What happened to men like George Floyd - and to the many others whose experiences we may not see go viral on social media - is unacceptable. George Floyd should be alive today.", "2020-05-28T22:52:58.000Z": ". @catherineforNV is a true fighter on behalf of all Nevadans. I am proud she represents the Silver State. During the COVID19 pandemic, she has proven to be a true partner in Washington and Nevada is grateful for her continued work.", "2020-05-28T20:56:55.000Z": "Today, Nevada's DHHS launched a new 211 app to help more Nevadans connect with the resources they need, including COVID19 resources.", "2020-05-28T16:28:52.000Z": "Thank you, Stephanie, for your work helping your neighbors and your community during the pandemic. Quote Tweet @NVHealthResponse @NVHealthRespon1 Stephanie Otteson began leading 10 Tonopah Volunteer Ambulance Service members \"In the heart of the (COVID-19) nightmare,\" ensuring her volunteers had proper PPE. With Tonopah's remote @nyecounty location, the nearest hospital is more than 100 miles away. Thank you, Stephanie!", "2020-05-28T04:00:11.000Z": "Thank you, @repdinatitus , for wearing your face covering and representing Nevada! Quote Tweet Dina Titus @repdinatitus Tune into @CSPAN after 5:00pm PST. I will be presiding over the House in my NV Tartan mask. Thank you to the mother of @LVchrisbrooks for making it!", "2020-05-28T01:47:18.000Z": "Today, I learned that the COVID19 swab test I took last night came back negative. The test collection was quick, easy and painless. I urge Nevadans to take advantage of our expanded testing capacity if they think they may be exposed.", "2020-05-27T21:55:09.000Z": "The First Lady and I think of these grieving families often, and we keep them in our thoughts and prayers.", "2020-05-27T21:55:03.000Z": "The United States is approaching 100,000 deaths from the coronavirus, with almost 400 deaths in Nevada alone. The sheer volume is difficult to imagine. Each of these deaths have caused heartache and devastation to families across the United States and in Nevada.", "2020-05-27T01:56:24.000Z": "As Nevada continues on the road to recovery, please do your part to #StaySafeToStayOpen .", "2020-05-27T16:06:05.000Z": "In case you missed it: Last night I announced Nevada is ready to begin Phase 2 on Friday. Read more in the thread below Quote Tweet Governor Sisolak @GovSisolak Good evening. I just wrapped a productive press call with both local and national media. At this time, I want to share some highlights of  Nevada's Phase 2 reopening. A full copy of my remarks can be found here: https:// nvhealthresponse.nv.gov/wp-content/upl oads/2020/05/5.26-post-presser-release.pdf  Show this thread", "2020-05-27T04:33:50.000Z": "So, please, put on your face covering when you leave your house. Help protect your fellow Nevadans. Wear your face covering like a badge of honor.  \n\nThank you!", "2020-05-27T04:33:37.000Z": "Our actions now will determine what actions we can take in the future. It's our personal responsibility to stay safe for ourselves, and others, and to work together through this process.", "2020-05-27T04:33:25.000Z": "We know from the medical experts, until there is cure or vaccine, social distancing is the most powerful response we have to slow the spread of COVID-19.  It's simple - when you are out in public, wear a mask or face covering, practice social distancing, and wash your hands.", "2020-05-27T04:33:15.000Z": "We cannot do this without each of you accepting the personal responsibility to follow the social distancing guidelines in professional and personal decisions.", "2020-05-27T04:33:07.000Z": "As always, I encourage Nevadans to stay vigilant and protect themselves against this virus.  Our goal is to prevent a surge in cases that our health care system cannot handle.", "2020-05-27T04:32:56.000Z": "The Board will issue an industry notice tomorrow setting forth requirements for the resumption of gaming operations in the State of Nevada.", "2020-05-27T04:32:47.000Z": "I know the Gaming Control Board remains resolute in ensuring that gaming operations in this State do not compromise the health and safety of Nevadans, our employees and our visitors.", "2020-05-27T04:32:30.000Z": "It is critical to put the health & safety of employees, residents & visitors first through proactive measures, coupled with the Health & Safety Policies issued by the Gaming Control Board. This is what will help ensure that Nevada can safely reopen its gaming industry on June 4.", "2020-05-27T04:32:04.000Z": "The Board was briefed on how these various entities have worked with the gaming industry to ensure that there is a comprehensive plan in place to respond to and mitigate the effects of positive cases of COVID-19 that present themselves in the State's resort corridors.", "2020-05-27T04:31:55.000Z": "I want to thank Chairwoman Sandra Douglass Morgan and the Board for holding its informational workshop this morning, during which the Board received testimony from the state's COVID-19 Response Director, public health experts, and leaders of our emergency response departments.", "2020-05-27T04:31:34.000Z": "Last week, I set a target reopening date of Thursday, June 4, for our gaming industry. Based on the meeting today and the positive trends in our data, I have informed the Chair of the Gaming Control Board that I feel confident in the June 4th target date.", "2020-05-27T04:31:24.000Z": "Places of worship may reopen their doors for gatherings with a maximum of 50 people attending a service at a time and strict social distancing of at least six feet. This aligns with our new guidance on all public and private gatherings.", "2020-05-27T04:31:02.000Z": "I strongly urge places of worship continue to provide online or virtual services as much as possible to protect those they serve, especially those who are among our vulnerable populations.", "2020-05-27T04:30:53.000Z": "Our medical experts advise that bringing together people from different households in a confined space for extended periods of time greatly increases the likelihood of spreading COVID-19.", "2020-05-27T04:30:31.000Z": "For so many Nevadans, restricting faith-based gatherings has been especially difficult.     \nAcross the country we have seen houses of worship become hotspots for COVID-19 transmission.", "2020-05-27T04:30:14.000Z": "Again, specific industry guidance for all these industries is being finalized with my Office and the Local Empowerment Advisory Panel and will be posted online and distributed this week, but I wanted to make this announcement to allow our Nevada businesses to make preparations.", "2020-05-27T04:29:52.000Z": "We've asked for recommendations, from local youth sports associations, the LEAP and national organizations. There are a lot of considerations at play here and for our youth, we want to make sure we have a strong, safe plan in place.", "2020-05-27T04:29:45.000Z": "Finally, we anticipate that youth sports and recreation will be able to open at some point in Phase 2. I know youth sports are important.", "2020-05-27T04:29:33.000Z": "For those that don't fall within the jurisdiction of the Nevada Athletic Commission or the Gaming Control Board, they will be approved by the Nevada Department of Business & Industry", "2020-05-27T04:29:21.000Z": "For example, the Gaming Control Board will approve these events on gaming properties, and the Nevada Athletic Commission will approve these events for any athletic competitions that it regulates.", "2020-05-27T04:29:10.000Z": "To hold a closed or spectator-less event,  an Event Operator shall submit an Operation Plan to the appropriate state authority with jurisdiction over the event.", "2020-05-27T04:28:47.000Z": "This may include sporting events, concerts, theater performances, or other entertainment type events.  There will be also be protocols for other spectator less events that won't be filmed or broadcasted.", "2020-05-27T04:28:38.000Z": "In Phase 2, events with live performances and live performers will not be allowed WITH spectators.  However, certain events will be allowed under specific restrictions for the purpose of broadcasting or live streaming - but they will NOT include a live audience or any spectators.", "2020-05-27T04:28:26.000Z": "There will be similar restrictions for outdoor venues like mini golf and amusement parks.", "2020-05-27T04:28:15.000Z": "Each individual retail store within an indoor mall will be subject to the same 50% capacity mandate and social distancing requirements. Food courts must adhere to the same restrictions as restaurants.", "2020-05-27T04:28:06.000Z": "Indoor venues, like movie theaters, bowling alleys & indoor malls may reopen, again with occupancy restrictions and must allow for six feet of social distancing. Malls must prohibit areas where people congregate, including restricting seating or benches in hallways or open areas", "2020-05-27T04:27:42.000Z": "Museums, art galleries, zoos and aquariums may reopen in Phase 2, at no more than 50 percent of capacity and must maintain at least six feet of social distancing. Interactive and hands-on exhibits must remain closed during this phase.", "2020-05-27T04:27:31.000Z": "Water parks will also be able to reopen, at 50 percent capacity with strict social distancing requirements.", "2020-05-27T04:27:20.000Z": "Aquatic facilities and swimming pools may reopen. During Phase 2, locker rooms will not be allow to reopen and these facilities will be limited to 50 percent of capacity. Face coverings should NOT be worn in the water.", "2020-05-27T04:27:04.000Z": "Body art and piercing establishments may reopen in Phase 2, with strict guidelines and by appointment only. During Phase 2, no body art or piercings may be done around the nose or mouth so that face coverings can be worn at all times.", "2020-05-27T04:26:54.000Z": "Massage services may also reopen under similar conditions, including by appointment only.  Face coverings must be worn at all times by employees, including the masseuse", "2020-05-27T04:26:44.000Z": "Day and overnight spas may reopen to offer these services but may NOT open steam rooms, saunas, hot tubs or other communal facilities.", "2020-05-27T04:26:32.000Z": "Salons and/or other businesses that provide aesthetic or other skin services may open under strict protocols and guidelines as recommended by LEAP and the Cosmetology Board.  \n\nThese include facials, hair removal, tanning, eyelash services, eyebrow threading, and other services.", "2020-05-27T04:26:06.000Z": "Patrons will NOT be allowed to walk up and order at the bars, but they may sit and be served at a bar top if appropriately distanced from one another - 6 feet apart. No congregating.", "2020-05-27T04:25:58.000Z": "All of the same restrictions on restaurants and food establishments are continued in Phase 2, but bar areas in restaurants may reopen, and bars and taverns that DO NOT serve food may reopen under the same restrictions - 50% maximum capacity and strict social distancing.", "2020-05-27T04:25:42.000Z": "Larger gyms are capped at 50% of occupancy per fire code and must also adhere to the strict social distancing requirements. Additionally, equipment must be regulated to ensure six feet of social distancing.", "2020-05-27T04:25:21.000Z": "Gyms, fitness facilities and other studios may reopen in Phase 2.  If a smaller gym or studio can only accommodate 10 or less people, they may only do so if they can adhere to the social distancing requirements and keep 6 feet of distance between all individuals.", "2020-05-27T04:24:54.000Z": "In Phase 2, state offices may begin to resume some services where necessary, although online services are still available and encouraged.  My office is finalizing plans with our agency directors on offices to reopen initially and will be making announcements on a rolling basis.", "2020-05-27T04:24:24.000Z": "During Phase 2, additional businesses and entities will be able to open. More specific guidance will be issued by my office and the Local Empowerment Advisory Panel (LEAP) but I wanted to go over the toplines of this new directive, which will be issued and signed tomorrow.", "2020-05-27T04:23:59.000Z": "All businesses opened in Phase 1 must maintain all the same restrictions and guidelines as we continue to evaluate the impact and slowly lift restrictions on other activities.", "2020-05-27T04:23:26.000Z": "Businesses that remain closed in Phase 2 include: \n\nAdult entertainment establishments \n\nBrothels  \n\nNightclubs and day clubs  \n\nLive sporting event venues and live performance venues WITH spectators.", "2020-05-27T04:23:15.000Z": "There are some businesses that will remain closed in Phase 2. Similar to Phase 1, Phase 2 will last 2-3 weeks as we monitor the data and evaluate trends and progress.", "2020-05-27T04:22:48.000Z": "In Phase 2, employees will continue to be required to wear a face covering. All businesses who are operating in Phase 2 must also abide by measures set forth by OSHA and other regulatory authorities.", "2020-05-27T04:22:17.000Z": "In Phase 2, we can increase public and private gatherings from no more than 10 people to no more than 50 people, while continuing to follow social distancing. \n\nNevada's vulnerable populations should continue to shelter in place.", "2020-05-27T04:22:01.000Z": "During Phase 2, I cannot emphasize enough the importance of continuing to wear face coverings in public and maintaining at least six feet of social distancing when you are out in public and around people from other households.", "2020-05-27T04:21:41.000Z": "And per my direction, DHHS is also working with the Nevada Department of Corrections on an effort to test all inmates and facility staff. Together, they are creating testing plans for each facility and I continue to express that this is a priority.", "2020-05-27T04:21:18.000Z": "Finally, we must make sure we have a sustained ability to protect our vulnerable populations & minimize outbreaks in special settings. \n \nDHHS has been steadfast in this goal, working with communities across the State to help minimize outbreak and provide assistance where needed", "2020-05-27T04:20:49.000Z": "Our State COVID-19 Response Director, Caleb Cage, has been working with Nevada DHHS, DEM, the Nevada State Public Health Lab, and our local government partners, and more details on the statewide testing and contact tracing plans will be provided later this week.", "2020-05-27T04:20:25.000Z": "We are finalizing action plans for a more robust statewide contact tracing system that will expand our ability to trace this virus in a more coordinated and cohesive way.", "2020-05-27T04:19:59.000Z": "Our public labs in Nevada have increased their ability to analyze samples exponentially over the last two months, and that will continue to increase.  \n\nAs we enter into Phase 2, community-based testing will be essential to our efforts to fully reopen and sustain the reopening.", "2020-05-27T04:19:44.000Z": "Third, we continue to increase our testing and lab capacity in the state to administer and process tests. \n\nOn most days, we are surpassing our goal of 4,000 tests a day and just yesterday, labs in the state reported more than 9,325 test results.", "2020-05-27T04:19:32.000Z": "When it comes to confirmed COVID hospitalizations, we are in a 35-day downward trend.\n \nThe Hospital Association asked me to remind Nevadans that it is safe for you to visit your doctor or your hospital. Make an appointment today or seek urgent care when you are sick or injured.", "2020-05-27T04:19:01.000Z": "Our cumulative test positivity rate - which is the number of people testing positive against the total number of tests - has declined to 6.5 percent. We have been in a downward trend for 31 days - a full month.", "2020-05-27T04:18:39.000Z": "So far, during Phase 1, we continue to see a consistent and sustainable downward trajectory of percentage of positive COVID-19 cases and a decrease in the trend of COVID-19 hospitalizations.", "2020-05-27T04:18:15.000Z": "First, we are on track to begin Phase 2 reopening on Friday, May 29. To be clear, businesses can take more time to prepare and get ready to reopen if they want.", "2020-05-27T04:17:26.000Z": "Good evening. I just wrapped a productive press call with both local and national media. At this time, I want to share some highlights of  Nevada's Phase 2 reopening. A full copy of my remarks can be found here: https:// nvhealthresponse.nv.gov/wp-content/upl oads/2020/05/5.26-post-presser-release.pdf ", "2020-05-27T02:57:04.000Z": "Due to technical difficulties and our team currently in quarantine, we will no longer be releasing the video, but will instead release the prepared remarks and some Phase 2 guidance very shortly tonight. I know you're eager to hear about Phase 2...thank you for your patience.", "2020-05-26T23:25:00.000Z": "I am scheduled to take a COVID19 test on Wednesday and I will inform Nevadans of these results. At no point since the potential exposure have I experienced any symptoms.", "2020-05-26T23:24:51.000Z": "My office has taken immediate and responsible actions to limit my exposure. Canceling this press conference is out of an abundance of caution.", "2020-05-26T23:24:38.000Z": "Late last week, I visited a work place where an employee, who was not in the building at time, has since reported testing positive for COVID19. My Office learned of the positive test result on Tuesday.", "2020-05-26T23:24:16.000Z": "Today, I am canceling my in-person press conference scheduled for 5:30 pm today after learning of a possible COVID19 exposure. I still plan to provide Nevadans an update tonight via recorded video.", "2020-05-26T15:56:23.000Z": "Thank you to all the volunteers helping their neighbors and communities during this pandemic. Quote Tweet @NVHealthResponse @NVHealthRespon1 A re-share from @ChurchillCounty ! THANK YOU to all volunteers and businesses giving a helping hand during the COVID-19 pandemic. #StayHomeForNevada  #ShareYourStory  #ChurchillCounty", "2020-05-26T17:37:26.000Z": "Please join me tonight at 5:30 p.m. where I will update Nevadans on the next phase of our reopening plan. Quote Tweet @NVHealthResponse @NVHealthRespon1 TUNE IN: Today at 5:30 p.m., @GovSisolak will hold a press conference to update Nevadans on the next phase of Nevada's reopening plan. twitter.com/GovSisolak/sta", "2020-05-25T18:12:07.000Z": "Finally, we visited the @LVMPD", "2020-05-25T17:51:11.000Z": "Next, the First Lady and I stopped by @UMCSN to thank the hardworking men and women there who have been on the frontlines caring for those affected by the virus.", "2020-05-25T16:48:25.000Z": "The First Lady & I also visited Basic High School to thank the @clarkcountysch workers packing up meals to distribute to students and families. This is a perfect example of how our communities have come together to fill vital needs during this time. Thank you for all you do!", "2020-05-25T16:39:10.000Z": "This morning, the First Lady & I attended a small wreath laying ceremony at the Southern Nevada Veterans Memorial Cemetery in Boulder City in honor of our fallen soldiers. Thank you to all who attended & practiced social distancing & wore face coverings to protect one another.", "2020-05-25T16:00:52.000Z": "Today, we honor the brave men and women who lost their lives serving our country. The Nevada Department of Veterans Services made these beautiful videos to mark the solemn occasion. https:// youtu.be/eLiPQfOikuo State of Nevada Memorial Day 2020 Virtual Memorial Day Ceremony... The State of Nevada honors those who served and sacrificed with two virtual Memorial Day ceremonies. The videos feature Nevada Governor Sisolak and veterans ... youtube.com", "2020-05-24T16:59:27.000Z": "Here are some helpful reminders to enjoy the Memorial Day weekend. Remember, always practice social distancing, practice good hygiene by washing your hands frequently and wear a face covering. Quote Tweet @NVHealthResponse @NVHealthRespon1 Happy #MemorialDay weekend! Heading outdoors? Please remember to #RecreateResponsibly and #StaySafeToStayOpen by following these guidelines. Thank you! http:// bit.ly/2XgXB7L", "2020-05-23T19:28:19.000Z": "Thank you, @detrnevada staff, for working through the night to launch the weekly claim system for PUA filers. The system is live now on http:// employnv.gov . Staff tell me that 2,000 claimants have filed 9,500 weekly certification in 45 minutes", "2020-05-23T17:42:10.000Z": "Thank you, Meghan, for helping connect your community to resources during this COVID19 pandemic. Quote Tweet @NVHealthResponse @NVHealthRespon1 Meghan Simons started the \"Reno/Sparks Mutual Aid\" Facebook group to connect people during the COVID-19 pandemic. More than 4,500 have joined since. Meghan said the group generates up to 20 posts a week that result in donation of food, supplies and other assistance. #MutualAid", "2020-05-23T02:56:41.000Z": "On Monday, United States and State of Nevada flags will be flown at half-staff at the State Capitol and state public buildings and grounds in honor of the brave individuals who have died serving out great State and Nation.", "2020-05-23T02:55:33.000Z": "Today, I issued an executive order ordering the flags of the United States and the State of Nevada to be flown at half-staff at the State Capitol and state public buildings and grounds until sunset on Sunday, May 24, as a mark of respect for the victims of the COVID-19 pandemic.", "2020-05-23T01:42:41.000Z": "While I'm sure Montana is nice this time of year & it would be great to say hi to my friend @GovernorBullock , I'm right here in Nevada staying safe to stay open.", "2020-05-22T22:41:00.000Z": "Over this holiday weekend, I want to remind Nevadans to stay safe by staying home, wearing face coverings if in public, avoiding large gatherings of ten or more and practicing aggressive social distancing by staying at least six feet away from other people.", "2020-05-22T22:40:44.000Z": "Additionally, the Gaming Control Board will meet Tuesday & will consider any action necessary with regard to reopening. Pending the evaluation of trends in our data and results of this meeting, I have set  a target date of June 4, 2020, for reopening Nevada's gaming industry.", "2020-05-22T22:40:36.000Z": "Ahead of the holiday weekend, I wanted to announce to all Nevadans that I will be holding a press conference on Tuesday, May 26, to discuss the next phase in Nevada's reopening plan. As long as our data stays consistent, I expect to announce a Phase 2 date for reopening.", "2020-05-22T20:37:51.000Z": "Thank you, @detrnevada , for providing this information update to Nevadans this morning. Quote Tweet DETR Nevada @DetrNevada You can now view the press briefing video featuring DETR Director Heather Korbulic and Chief Economist David Schmidt to hear updates on Nevada's unemployment rate, insurance, and claims. https:// youtu.be/eYcYbwtPLZI", "2020-05-22T20:16:10.000Z": "Thank you to the Nevada Department of Veterans Service for inviting me to participate in this virtual Memorial Day ceremony honoring fallen U.S military personnel. \n\nThe memorial videos can be found here: https:// youtu.be/eLiPQfOikuo and here: State of Nevada Memorial Day 2020 Virtual Memorial Day Ceremony... The State of Nevada honors those who served and sacrificed with two virtual Memorial Day ceremonies. The videos feature Nevada Governor Sisolak and veterans ... youtube.com", "2020-05-22T17:06:02.000Z": "I agree, Gov Cuomo. Wear your face covering as a sign of respect. Wear it for someone you love. Quote Tweet Andrew Cuomo @NYGovCuomo I'll keep saying it for as long as it's necessary to say it: Wearing a mask is about RESPECT.", "2020-05-22T15:27:02.000Z": "Today, @DetrNevada announced the April unemployment numbers for Nevada. Overall, employment in Nevada is down 244,800 jobs over the month and the unemployment rate rose to 28.2 percent.", "2020-05-22T15:04:08.000Z": "Thank you, Jeff, for your service to Nevada's elderly population during this pandemic! Quote Tweet @NVHealthResponse @NVHealthRespon1 Jeff Klein, CEO of Nevada Senior Services, collaborated with the Nevada Aging and Disability Services Division to launch Delivering with Dignity in Las Vegas, which helps send restaurant meals to elderly citizens. A similar site is also in Reno. #deliverwdignity  #dwd_renosparks", "2020-05-22T00:31:13.000Z": "Today, I signed an emergency directive to allow for the continuation of parole hearings during the COVID19 pandemic while State facilities are closed to the general public for the health and safety of all Nevadans.", "2020-05-22T00:26:57.000Z": "Today, I declared a state of emergency in response to the 6.5 magnitude earthquake last week. This helps the State access Federal Highway Administration Emergency Response funding for long-term repairs.", "2020-05-21T23:37:07.000Z": ". @detrnevada has established a specific email address to help with password resets with PUA claims. Please see more below Quote Tweet DETR Nevada @DetrNevada PUA UPDATE:  A new email account has been established to assist with PUA email, specifically password resets. The new address is: DETRPUASupport@detr.nv.gov.", "2020-05-21T23:17:19.000Z": "This partnership between @FoodBankNN , @threesquareLV & @NVAgriculture will help provide more than 2 million pounds of fresh food of Nevadan families. Through this program, Three Square has the potential to double its food distribution http:// agri.nv.gov/News/2020/USDA _Farmers_to_Families_Food_Box_program_begins_in_Nevada/ ", "2020-05-21T19:02:03.000Z": "Thank you, Governor Sandoval and First Lady Lauralyn McCarthy Sandoval, for reminding Nevadans that voting by mail is safe and easy! #mailitinNevada  @NVSOS Quote Tweet NV Sec of State @NVSOS Hear from Brian Sandoval, former Nevada Governor, 2011-2019, and Lauralyn McCarthy Sandoval, former First Lady, on why they'll be voting by mail in this year's primary election. #MailItInNevada To learn more, visit http:// MailItInNevada.com .", "2020-05-21T18:31:51.000Z": "Nevada's COVID-19 dashboard found at http:// NVHealthResponse.nv.gov does not mix viral and antibody tests. The data on Nevada's site includes only viral testing. https:// theatlantic.com/health/archive /2020/05/cdc-and-states-are-misreporting-covid-19-test-data-pennsylvania-georgia-texas/611935/ ", "2020-05-21T16:42:31.000Z": "Today, I was pleased to visit the @DetrNevada call center to thank the hardworking employees connecting Nevadans to unemployment insurance benefits. The latest data shows Nevada has paid more than 80 percent of eligible claims week over week, one of the highest rates in the US.", "2020-05-21T15:32:12.000Z": "This work will bolster ongoing efforts in the State's response to COVID19. I look forward to seeing the PPC's recommendations to help strengthen and sustain our health care system.", "2020-05-21T15:32:02.000Z": "With limited resources and a collective will, our State's healthcare system has responded in extraordinary ways, but this challenge has highlighted many of our health care challenges that promoted the creation of the Commission originally.", "2020-05-21T15:31:48.000Z": "This week, I requested Nevada's Patient Protection Commission assistance in our long-term recovery from COVID-19. I'm asking the Commission members to focus their collective expertise and experience on making recommendations to strengthen the public health system in our State.", "2020-05-21T02:15:15.000Z": "It was my pleasure to join the Asian American & Pacific Islander Democratic Caucus virtual meeting tonight to celebrate APAHM month. In Nevada, we know diversity is our strength. Thank you for having me!", "2020-05-20T20:13:08.000Z": "Thank you to the Nevada Chinese Association for your donation of face masks and other PPE to a Nevada. Thank you for your support.", "2020-05-20T18:42:16.000Z": "Even though school buildings are closed, @clarkcountysch nurse Linda Kalekas kept working through the COVID19 pandemic to help coordinate testing with local agencies. Thank you, Linda, for all you've done. Quote Tweet @NVHealthResponse @NVHealthRespon1 Linda Kalekas, a Clark County School District nurse, coordinated with multiple agencies in the Las Vegas Valley during the COVID-19 response. She is also coordinating @ClarkCountySch nurses to help with COVID-19 testing at @NLVFireDept , Clark County Fire & more. Thanks, Linda!", "2020-05-20T18:17:56.000Z": "Thank you to @clarkcountynv , @unlv and @orleanscasino for this collaborative work to help more Southern Nevadans have access to COVID19 testing. Quote Tweet UNLV @unlv Starting Wed. 5/27, @ClarkCountyNV will be offering drive-thru COVID-19 testing at UNLV's Tropicana Parking Garage near @ThomasAndMack . The county is transitioning its testing site to UNLV from @orleanscasino . Last day for testing at Orleans is Fri. 5/22 https:// buff.ly/2XdkgSl Show this thread", "2020-05-20T17:10:45.000Z": "Nevada is widely recognized as being a national leader in election administration, and we will continue to support the safest, most accessible election possible under these unprecedented circumstances.", "2020-05-20T17:10:54.000Z": "For the President to threaten federal funding in the midst of a pandemic over a state exercising its authority to run elections in a safe and legal manner is inappropriate and outrageous.", "2020-05-20T01:12:43.000Z": "He was a pillar in the community and his commitment to spreading the word of God and leading efforts to bring about civic and social change will be sorely missed.", "2020-05-19T22:40:29.000Z": "Today, we learned that Nevada received $88 million in grant funding from @CDCgov to be used for advanced testing and contact tracing in Nevada. Thank you to @senjackyrosen and @sencortezmasto for supporting these efforts.", "2020-05-19T20:25:49.000Z": "Private Pipkins was the 1st positive case of COVID-19 identified in NV. He spent about a month in a coma & has been recovering since. Please, think of Private Pipkins & other COVID patients. Wear a face covering, keep your distance & stay home if you can. COVID-19 Public Service Announcement: Ronald Pipkins Ronald Pipkins, a resident of Las Vegas, Marine Corps veteran and Nevada's first diagnosed patient with COVID-19, encourages his fellow residents to take ste... youtube.com", "2020-05-19T19:06:52.000Z": "I am pleased to see that so many Nevadans took advantage of the limited-time special enrollment period to get comprehensive, qualified health insurance through the Silver State Health Insurance Exchange.", "2020-05-19T18:06:57.000Z": "Thank you, Eric Nielsen, for this reminder that wearing face coverings right now is part of our civic duty to help protect our communities. Reno ER doctor: Wearing a mask is a sacrifice we all need to take to help end this crisis Reno emergency room doctor Eric Nielsen says why wearing a mask is an important step everyone needs to take to help curb the spread of COVID-19. rgj.com", "2020-05-19T15:16:18.000Z": "Thank you, Gaby, for making sure Nye residents have access to testing! Quote Tweet @NVHealthResponse @NVHealthRespon1 Gaby Cruz owns Serenity Health, which provides health services to Nye County jails. Gaby has led the drive for county employee and public testing throughout rural @nyecounty administering 1,200+ tests at a time  when rural counties had limited access to testing. Thanks, Gaby!", "2020-05-18T21:54:52.000Z": "Today, flags in Nevada are at half-staff in honor of Roy Horn. Roy was a wonderful entertainer and will be greatly missed. Quote Tweet Las Vegas Review-Journal @reviewjournal Flags will be flying at half-staff today to honor Roy Horn, whose kindness was on full display in 2015 https:// reviewjournal.com/entertainment/ entertainment-columns/kats/the-story-of-why-i-have-roy-horns-sarmoti-tie-2030515/ ", "2020-05-18T20:04:14.000Z": ". @detrnevada has put together helpful information for those filing using the new PUA system. See more here Quote Tweet DETR Nevada @DetrNevada PUA RESOURCE UPDATE:\n\nA PUA Claimant Guide and List of Accepted File Types for Uploading can be viewed at: https:// detr.nv.gov/page/Pandemic_ Unemployment_Assistance(PUA)  Claimant Guide: https:// cms.detr.nv.gov/Content/Media/ Pandemic_Unemployment_Assistance_(PUA)_New_Claimants_Guide_v2.pdf  File Types: https:// cms.detr.nv.gov/Content/Media/ VOS_acceptable_file_types.pdf ", "2020-05-18T19:26:57.000Z": "Today, I joined House Speaker Nancy Pelosi and other governors across the country on a call to discuss the the HEROES Act and the possibility of federal support for state and local governments.", "2020-05-18T15:10:10.000Z": "This virus is still among us, so we must remain vigilant and take precautions like washing our hands often, practicing social distancing and wearing a face covering to help protect ourselves and others. Quote Tweet @NVHealthResponse @NVHealthRespon1 Now more than ever, we need to remain patient, so we don't become a patient. #StaySafeStayOpen  #MotivationMonday", "2020-05-17T20:38:41.000Z": "Wearing a face covering helps protect Nevadans. It's that simple. It's on each of us to look out for one another by wearing a face covering if you have to leave your home. #StaySafeStayOpen Quote Tweet @NVHealthResponse @NVHealthRespon1 \"Wear it for one of our thousands of front line health care workers. Wear it for the person at the grocery store. Wear it for someone you know that (has an underlying health condition) that you care about. Wear it as a sign of respect.\" -- @GovSisolak", "2020-05-16T18:40:41.000Z": "Thank you, Ambassador. Couldn't of said it better! Quote Tweet Joseph Cella @USAmbSuva Replying to @GovSisolak @NVNationalGuard is exemplary in their leadership and respected for it. Displayed in their fight against the virus, on display in the State Partnerships when in the IndoPacific, and on display in one of our defense attaches detailed from that great team. @ondralberry  @ChiefNGB", "2020-05-16T16:38:44.000Z": "This morning, I visited the Reno-Sparks Livestock Events Center to see some of the #COVID19 testing in action. It's truly a team effort from county officials, medical professionals and our Nevada National Guard.", "2020-05-15T22:22:14.000Z": "We will continue to actively monitor the progress in Phase 1. Our data is promising so far, but it's too early to make any new determinations as it does not yet reflect any impacts of our initial reopening. We must stay the course and remain vigilant.", "2020-05-15T22:21:44.000Z": "We know this virus is not gone, so it's up to us to take care of ourselves and one other and follow the rules, regulations & guidelines.  We are still monitoring results from this first phase, but we know if we stay safe, we can stay open.", "2020-05-15T22:13:26.000Z": "While the majority of our businesses are doing a great job, we all know there are some that are not in compliance right now. Local governments, OSHA & regulatory authorities are monitoring reopenings, investigating noncompliance complaints and taking action where necessary.", "2020-05-15T22:10:41.000Z": "TY to all the businesses and employers who are taking this seriously by reducing the number of people in their businesses at once, finding creating solutions so staff can practice social distancing and for adhering to the requirement that your staff wear face coverings.", "2020-05-15T22:09:14.000Z": "Next, I want to talk a little bit more about what we've seen so far in Phase 1. The NV Division of Industrial Relations is reporting that the majority of businesses are in general compliance with the rules. TY to the counties who are ensuring local businesses are in compliance.", "2020-05-15T22:07:37.000Z": "We continue to expand our testing capacity thanks to the @NVNationalGuard , the LEAP, local leaders, health authorities, and private sector partners. We're also moving forward w/ plans to increase our contract tracing resources statewide.", "2020-05-15T22:05:35.000Z": "According to the @NVHospitals , #COVID19 hospitalizations have continued to drop over the past 14 day period, & that the total number of COVID-19 hospitalizations are not significantly impacting the Nevada hospital system at this time.", "2020-05-15T22:04:33.000Z": "Now let's do a current data update: \nWe are currently on day 20 of a downward trajectory of our cumulative percentage of people testing positive.  Right now, about 9% of people who we have been tested in the NV have tested positive.", "2020-05-15T22:03:47.000Z": "We've been in Phase 1 for less than week. We are continuing to monitor our data, but as I mentioned last week, it will take a minimum of 2 weeks for the data to reflect any impacts of the Phase 1 reopening... Quote Tweet Governor Sisolak @GovSisolak Here is the link to watch today's press conference, which begins at 3 p.m. http:// nvleg.granicus.com/MediaPlayer.ph p?event_id=25394 ", "2020-05-15T19:56:31.000Z": "Thank you to 8-year-old Monica for this letter! The State of Nevada is working hard to keep our Nevada families safe. I read letters and messages from constituents office, and this one was certainly a highlight. Please keep up the social distancing and wear a face covering!", "2020-05-15T18:06:45.000Z": "This afternoon, I will hold a press conference to provide updates as to our Phase 1 reopening in Nevada. Please tune in at 3 pm. You can watch online at http:// leg.state.nv.us", "2020-05-15T16:38:51.000Z": "Happy 115th birthday to the City of Las Vegas! You don't look a day over 100 to me. Quote Tweet City of Las Vegas @CityOfLasVegas We're 115 today  #HappyBirthdayVegas (credit: Julie Bergonz) We're taking a walk through history today to celebrate so stay tuned", "2020-05-15T16:10:15.000Z": "Today, I issued an executive order to lower flags to half-staff in honor of entertainer Roy Horn, who passed away due to complications from coronavirus last week. Roy had an uncanny ability to entertain and mesmerize audiences. We will miss him greatly.", "2020-05-15T15:41:43.000Z": "The Governor's Office is closely monitoring the situation from this morning.  Please follow guidance from your local law enforcement agency. Quote Tweet Nevada Earthquakes @NVEarthquakes Magnitude 4.3 #earthquake , 29.6 km S of Mina, NV http:// seismo.unr.edu/Events/main.ph p?evid=725296 ", "2020-05-15T15:30:54.000Z": "Today is the last day for Nevadans to enroll in the @NVHealthLink Exceptional Circumstance Special Enrollment. Quote Tweet Nevada Health Link @NVHealthLink Friday, May 15, is the last day to enroll in Exceptional Circumstance Special Enrollment. For assistance applying for health coverage, call 1-800-547-2927 today! We're here to help you. #MyHealthNV", "2020-05-15T15:13:16.000Z": "Thank you, Emily, for your service in finding emergency foster homes - that turned into forever homes - for 52 pets! Quote Tweet @NVHealthResponse @NVHealthRespon1 As the pandemic entered Nevada in March, Emily Lancione, dog care manager @NVHumaneSociety in #Reno , helped 52 pets find emergency foster homes. All 52 pets were adopted, successfully finding their \"forever homes.\" Thank you, Emily, for valuing the needs of our community's pets.", "2020-05-14T23:08:17.000Z": "As always, I want to thank our partners in the NV Legislature, particularly @jasonfrierson and @nicole4nevada . They've been a tremendous help to my office through this pandemic and we will continue working with them as we move forward.", "2020-05-14T23:08:02.000Z": "I also signed a directive this week that will allow @detrNevada to hire non-merit staff to help process the volume of claims. This move came after DETR had already nearly tripled their merit staff from 75 to 200 employees.", "2020-05-14T23:07:54.000Z": "I also announced the extension of the job-search waiver until further notice. Nevada is beginning the slow and gradual process of reopening so waiving this requirement is a good step to help keep Nevadans safe during this process.", "2020-05-14T23:07:46.000Z": "As always, we will continue to look for ways to improve the unemployment insurance system. Earlier this week, @detrNevada was able to implement the PEUC, which provides an extra 13 weeks of benefits for Nevadans who have exhausted their traditional employment benefits.", "2020-05-14T23:07:39.000Z": "This pandemic has not been easy for anyone. As your Governor, I know how difficult this has been for families. My father lost his job when I was a child. Every day was difficult and I know what it is like to worry about making ends meet.", "2020-05-14T23:07:31.000Z": "Few states were set up to begin launching this program while tackling the increased volumes in traditional claims and I am appreciative of  the employees at @detrNevada who are working day in and day out to stand up these systems and help Nevadans during these trying times.", "2020-05-14T23:07:24.000Z": "Nevada is in line with other states in launching this new program. According to the U.S. Department of Labor, six states are beginning to accept claims this week. I know this does not take away from Nevadans who need money now, but it helps explain the scope of this problem.", "2020-05-14T23:07:15.000Z": "Filers can go online to http:// employnv.gov beginning Saturday morning to file a claim and can call 1-800-603-9681 on Saturday for questions and help. @detrNevada tells me the first payments will come about a week after that.", "2020-05-14T23:06:59.000Z": "BIG NEWS. Today, @detrNevada announced that the pandemic unemployment assistance system will launch on Saturday to provide benefits to Nevada's self-employed, independent contractors and gig workers. Quote Tweet FOX5 Las Vegas @FOX5Vegas LIVESTREAM: Nevada DETR holds a teleconference to discuss Pandemic Unemployment Assistance.\nWATCH LIVE: https:// bit.ly/2z119D5", "2020-05-14T19:17:23.000Z": "If you're a Nevada homeowner and you've been affected by #COVID19 , the Nevada Affordable Housing Assistance Corporation might be able to help with mortgage assistance. Quote Tweet Nevada Department of Business & Industry @NevadaDBI NAHAC has relaunched the Unemployment Mortgage Assistance Program, offering mortgage assistance up to $3,000/month for those with job loss due to the pandemic and are receiving unemployment insurance benefits. Visit http:// nahac.org for program information and eligibility.", "2020-05-14T17:30:00.000Z": "Thank you for sharing, @zconine . PPP loans are still available for Nevada businesses. Quote Tweet Zach Conine @ZConine ALERT FOR Nevada Businesses:  \nWe've been having conversations with our banking community, and PPP dollars are still available.  If you're having trouble accessing the program, please reach out to our office at ask@NevadaTreasurer.gov and we'll point you in the right direction.", "2020-05-14T16:48:47.000Z": "Surround yourself with the best people \nNever take your health and safety for granted\nTake pride in where you live.", "2020-05-14T16:48:16.000Z": "Today, I joined @jasonfrierson , @nicole4nevada and a bright group of @clarkcountysch students to talk about how Nevada is working together to make sure we get through this #COVID19 pandemic. I was also able to share some life lessons with these students including:", "2020-05-14T15:20:34.000Z": "Thank you, Dr. Stringham, for taking care of our Humboldt County residents during #COVID19 ! Quote Tweet @NVHealthResponse @NVHealthRespon1 Humboldt County Health Officer Dr. Charles Stringham has worked as a Winnemucca physician for 25+ years. He led the Humboldt County COVID-19 task force, working to educate the public, begin a contact tracing program and ensuring citizens' needs were met. #HumboldtCountyNV", "2020-05-14T01:19:42.000Z": "Please share this information with homebound seniors. Together, we will get through this. Quote Tweet @NVHealthResponse @NVHealthRespon1 Attention homebound seniors! The Nevada COVID-19 Aging Network (Nevada CAN) can help you get access to medications while you are staying at home to self-isolate! Contact Nevada CAN for assistance.", "2020-05-13T23:30:59.000Z": "What a well-deserved honor for late State Senator Debbie Smith! Sen. Smith was a respected leader who valued education and always fought to put Nevada's schools first. Debbie Smith High is the first high school in district to be named for a woman The Washoe County School Board voted to name Hug High for the late State Sen. Debbie Smith, who spearheaded education legislation. rgj.com", "2020-05-13T15:50:30.000Z": "Congratulations to the Class of 2020! I am so proud of your achievements so far - even though the last few months haven't gone as according to plan. Keep up the good work and keep making Nevada proud! Quote Tweet Zero Fatalities NV @DriveSafeNV Class of 2020, even in the midst of these hard and uncertain times, you did it! We are so proud of you and can't wait to see what your futures hold. @NVTeenDriver  https:// youtu.be/VnG0JYzPg7c Show this thread", "2020-05-13T15:23:00.000Z": "ICYMI: Janine Hansen was named Hero of the Day. Thank you, Janine, for your work helping those in need! Quote Tweet @NVHealthResponse @NVHealthRespon1 Janine Hansen is a nurse at Prominence Health Plan. During the height of the COVID-19, she successfully eradicated a chronic bed bug infestation for a high-risk man living in a Reno motel. Janine worked  to help the elderly man move into new housing. #ProminenceHealthPlan", "2020-05-13T03:03:50.000Z": "Thank you to Nevada Department of Wildlife Warden Sean Flynn, other NDOW wardens and National Park Service rangers for their swift actions to save lives this weekend when a boat capsized on Lake Mead. Quote Tweet FOX5 Las Vegas @FOX5Vegas Great job, NDOW wardens!  https:// bit.ly/2zuotZI", "2020-05-13T01:04:53.000Z": "Today, I announced with @detrjobconnect that Nevada will be extending the job search waiver until further notice.", "2020-05-12T20:23:28.000Z": "Pictured are Airman Nicholas Taylor, Staff Sergeant Antonio Deese, Director Montooth, Staff Sergeant Robert Pape and Master Sergeant Chadwick Jennings.", "2020-05-12T20:23:10.000Z": "Members of the 152nd Airlift Wing, Reno, pose with Stacey Montooth, Executive Director Nevada Indian Commission, after helping deliver and distribute test kits & food supplies to several tribal communities in Elko, NV, on Monday, May 11.", "2020-05-12T18:06:53.000Z": "Today, First Lady Kathy Sisolak presented a certificate of recognition to members of the Taipei and Economic Cultural Office for their generous donation of masks for Nevada's healthcare providers. Kathy and I send our thanks to the Taiwanese Government!", "2020-05-12T15:16:14.000Z": "Thank you, Raynell, for your dedication to helping the tribal communities in Nevada! Quote Tweet @NVHealthResponse @NVHealthRespon1 Raynell Miller is the director of the Inter-Tribal Council of Nevada Admin's Aging Elder's Program. During the COVID-19 pandemic, Raynell has delivered food, paper goods & supplies to Tribal communities in Nevada. Thanks, Raynell, for all you do for Tribal members in our state.", "2020-05-12T03:03:06.000Z": "Don't forget! Friday is the last day to enroll in the exceptional circumstance special enrollment. Quote Tweet Nevada Health Link @NVHealthLink Friday, May 15, is the last day to enroll in Exceptional Circumstance Special Enrollment. For assistance applying for health coverage, call 1-800-547-2927 today! We're here to help you. #MyHealthNV", "2020-05-11T19:48:44.000Z": "Today, I joined with other states in the Western States Pact to urgently request $1 trillion in relief to state & local governments. I am pleased to be joined in this effort by @jasonfrierson and @nicole4nevada", "2020-05-11T17:43:28.000Z": "With the closure of Nevada businesses, including the gaming industry, the drop in revenue is not unexpected and it is significant. I will continue to work with our partners in the legislative branch to bring all options to the table to address the extraordinary budget shortfalls.", "2020-05-11T17:43:01.000Z": "Today, I declared a state of fiscal emergency for the State of Nevada due to the strain the COVID-19 pandemic has put on public services in the State of Nevada. This declaration gives the State the necessary flexibility we need to quickly redirect resources to cover shortfalls.", "2020-05-11T15:34:27.000Z": "My staff and DETR Director Heather Korbulic will continue to look for ways to bring unemployment benefits to Nevadans in need.", "2020-05-11T15:34:03.000Z": "Today, I am pleased to announce I signed a new directive to give @DETRJobConnect more flexibility to hire non-merit staff to help process claims. DETR has nearly tripled its staff in the unemployment department already & this directive will allow them to onboard more staff faster", "2020-05-10T20:05:05.000Z": "To all the moms in our lives - whether they're mothers, stepmothers, grandmothers, godmothers, aunts or others - thank you for all you do. Happy Mother's Day! Quote Tweet @NVHealthResponse @NVHealthRespon1 Although things look a little different this year, how are you celebrating your mom today? Tag us in your photos!\n\nHappy Mother's Day! #StayHomeForNevada  #ShareYourStory", "2020-05-09T20:42:14.000Z": "Increasing testing in Nevada is part of our long-term reopening plan. I was pleased to visit a drive-thru testing location at @orleanscasino . Thank you to the @nvnationalguard for helping with the set-up and logistics!", "2020-05-09T20:07:32.000Z": "As we begin to reopen in Nevada, it's important to still take precautions against #COVID19 . @NVHealthRespon1 has guidance posted for individuals and businesses. Learn more here: Coronavirus (COVID-19) in Nevada | Nevada Health Response Get the latest information and resources on the current status of the Coronavirus (COVID-19) and its impact within Nevada from the Nevada Governor's Office. nvhealthresponse.nv.gov", "2020-05-08T22:46:44.000Z": "This just in: industry-specific guidance is now available on the @NVHealthRespon1 website at http:// nvhealthresponse.nv.gov . Thank you to members of the LEAP for helping developing this Phase 1 reopening guidance. #StaySafeStayOpen  https:// nvhealthresponse.nv.gov/wp-content/upl oads/2020/05/Industry-specific-Guidance-Documents-1.pdf  Coronavirus (COVID-19) in Nevada | Nevada Health Response Get the latest information and resources on the current status of the Coronavirus (COVID-19) and its impact within Nevada from the Nevada Governor's Office. nvhealthresponse.nv.gov", "2020-05-09T00:16:15.000Z": "I declared this week Nevada State Employee Appreciation Week. I am grateful everyday to the hardworking employees who help keep our great State running smoothly, and I am even more appreciative for their work during this pandemic. THANK YOU for all you do for Nevada.", "2020-05-09T01:40:58.000Z": "Thank you, Roy, for your years of entertainment to Nevadans and visitors. May you Rest In Peace. My thoughts and prayers go out to Roy's family and loved ones at this difficult time.", "2020-05-08T22:06:05.000Z": "Here are some ways to show your loved ones you care this Mother's Day. Quote Tweet Carson City Health @CCHealthEd Mother's Day celebrations are going to look a little different this year due to #COVID19 , but that does not mean we can't show mom we care. Here are a few ways to celebrate #MothersDay while continuing to practice social distancing.", "2020-05-08T19:02:42.000Z": "ICYMI: Nevada will begin phased-in reopening tomorrow. To stay open, we need to do our part to stay safe.", "2020-05-08T14:48:54.000Z": "Yesterday, I signed a proclamation in honor of Law Enforcement Memorial Day, in honor of the dedicated men and women who have lost their lives while protecting their communities. I spent a few minutes at the memorial outside the Capitol as well.", "2020-05-07T23:35:45.000Z": "This excludes law enforcement, public safety, first responders, public works, and essential government employees.", "2020-05-07T23:35:44.000Z": "For clarification: State offices currently closed to the public will remain closed to the public during Phase 1. Local governments have the authority to determine the timeline for reopening offices currently closed to the public. Quote Tweet Michelle Rindels @MichelleRindels All county, state and local offices are remaining closed during Phase 1. Show this thread", "2020-05-07T23:07:11.000Z": "Hot off the press! Following this afternoon's press conference, @GovSisolak issued the following \"Roadmap to Recovery: Phase 1 Guidelines and Protocols for Individuals and Businesses\" document. Check it out: https:// bit.ly/2zlv74i  #StaySafeToStayOpen", "2020-05-07T22:52:49.000Z": "I encourage Nevadans to stay vigilant and protect themselves against this virus as we enter Phase 1. We must stay safe so we can stay open. #StaySafeStayOpen", "2020-05-07T22:40:26.000Z": "If you are a member of a vulnerable populations, you must continue to shelter in place. Members of households with vulnerable residents should be aware that by returning to work or other environments where you cannot social distance, you may carry the virus back home", "2020-05-07T22:40:25.000Z": "During Phase 1, individuals are also encouraged to continue to stay home unless you need to leave for essential activities and all large public gatherings, or gatherings over ten are still prohibited.", "2020-05-07T22:30:27.000Z": "BARBER SHOPS, HAIR SALONS & NAIL SALONS: \n- Partitions/walls between each work station are strongly encouraged. If not, must only use every other chair or ensure they are 6 ft apart. \n- Services must be provided through appointment ONLY. No walk-ins.\n- Face coverings required", "2020-05-07T22:24:04.000Z": "RESTAURANTS cont...Reservations should be required. Tables/booths must be spaced 6 ft apart. Bar tops/bar areas within restaurants remain CLOSED. If waiting to be seated, patron must wait outside.", "2020-05-07T22:09:12.000Z": "Our cumulative test positivity rate reached 12.2 percent on April 24 and has since decreased to 11.2 percent as of yesterday. When it comes to confirmed COVID hospitalizations, we've seen an overall decreasing trend since April 21, a total of more than 14 days.", "2020-05-07T22:16:44.000Z": "Now I'd like to go through what Nevada's Phase 1 of our Roadmap to Recovery will look like. First off: businesses that will be reopening with strict social distancing requirements...", "2020-05-07T22:12:30.000Z": "Last week I mentioned that we are able to test symptomatic patients, & we continue to make progress toward our testing expansion. There are new drive-thru testing sites popping up across NV and I'm proud of these efforts. We have more to do, but we are on our way.", "2020-05-07T22:05:56.000Z": "I want to thank the incredible Local Empowerment Advisory Panel (LEAP), including Chair @MKNVspeaks , Chair JJ Goicoechea, @NVNACO rep Dagny Stapleton, Directors Michael Brown & Terry Reynolds, & those who worked with them day after day to develop sector-specific guidance", "2020-05-07T22:03:51.000Z": "I know Nevadans are eager to hear about when we are reopening, so I will cut right to the chase. I am pleased to announce we are on track with our reopening criteria and we will enter Phase 1 on Saturday, May 9, before the current Stay at Home directive expires on May 15.", "2020-05-07T16:41:42.000Z": "This morning, I had the honor of joining the @NVNationalGuard to wish a safe deployment to the elite 238 MEDEVAC unit during a special ceremony that followed social distancing protocols. The State of Nevada is grateful every day to the men & women in service. #BattleBorn", "2020-05-07T21:39:50.000Z": "Here is the link to watch the press conference at 3 p.m. today: http:// nvleg.granicus.com/MediaPlayer.ph p?event_id=25378 ", "2020-05-07T14:40:39.000Z": "This afternoon, I will hold a press conference to announce plans and a date for Nevada's Phase 1 reopening. Please tune in at http:// leg.state.nv.us at 3 p.m.", "2020-05-07T04:22:15.000Z": "Happy birthday to Evelyn Mount, a pillar in the Reno community and founder of the Evelyn Mount Community Outreach. Thank you, @RenoPolice , for doing a drive by celebration to help commemorate the day!", "2020-05-07T03:41:48.000Z": "Our battle against #COVID19 has been strengthened because of @nvnationalguard . Thank you for all your support. #Battleborn Quote Tweet Dr. Mark T. Esper @EsperDoD The @DeptofDefense stands with the people of #Nevada . Thank you for the call @GovSisolak .", "2020-05-06T21:04:12.000Z": "Thank you to all our hardworking nurses who are caring for Nevadans during the #COVID19 pandemic. Today, and everyday, we appreciate your service. Quote Tweet Renown Health @renownhealth Happy #NursesWeek ! This beautiful artwork in our general surgical unit was created by Renown nurses, CNAs, unit clerks, supervisors and family members.", "2020-05-07T01:56:56.000Z": "I am pleased that @UNLV , @CSNCoyote , @NevadaState , @WNCNevada and @gbcNevada will be able to use these funds to make the necessary transition to distance learning platforms to continue education curriculums during this pandemic", "2020-05-07T01:56:51.000Z": "5 of our @NSHE schools - deemed as Minority-Serving Institutions - were awarded CARES Act funds to help cover attendance for eligible students & other items. Thank you @SenJackyRosen , @SenCortezMasto , @repdinatitus , @RepHosford @RepSusieLee & @MarkAmodeiNV2 for this work.", "2020-05-06T16:45:13.000Z": "Teachers, we can't thank you enough for your dedication during these challenging times by using your talents online! #TeacherAppreciationWeek  #NevadaReady  #Teachers  #TeacherAppreciation Quote Tweet @NVHealthResponse @NVHealthRespon1 Thank you for everything you do! #TeacherAppreciationWeek  #StayHomeForNevada  #ShareYourStory", "2020-05-05T18:51:46.000Z": "Nevadans still have 10 days left to utilize the special enrollment period. Don't delay! Quote Tweet Nevada Health Link @NVHealthLink If you or someone you know doesn't have health coverage, we can help. The Exceptional Circumstance Special Enrollment Period is available until May 15. Call us at 1-800-547-2927 for more information or click the link below. https:// nevadahealthlink.com/sep/", "2020-05-05T17:32:54.000Z": "These rural providers, including rural acute care general hospitals and rural community health centers, are critical to the well-being of Nevadans. Thank you to our Nevada federal delegation for your work on this matter on behalf of the Silver State!", "2020-05-05T17:30:04.000Z": "I was pleased to learn that 21 Nevadan rural healthcare providers are receiving approximately $51 million from the U.S. Department of Health and Human Services to help these providers keep their doors open.", "2020-05-05T01:08:20.000Z": "Good evening. I wanted to provide a quick update to Nevadans about our Nevada United: Roadmap to Recovery plan. Gov. Sisolak May 4, 2020 update Nevada Governor Steve Sisolak provided Nevadans an update on Monday, May 4, 2020 as to the state's progress toward reopening. youtube.com", "2020-05-05T00:00:13.000Z": "Thank you, Lieutenant Gov! Quote Tweet Lt. Governor Kate Marshall @LGKateMarshall Excited to launch this incredible program here in Reno-Sparks. We are delivering nearly 400 meals today! Couldn't have done it without @uwnns , Liberty Food and Wine, the non-profit community, business leaders, and generous supporters.\n\nLearn more at https:// deliveringwithdignityrenosparks.org/contact-us", "2020-05-04T23:09:27.000Z": "I was saddened to hear about the death of Greg Zanis today. When our State needed healing, Greg's crosses memorializing the victims of 1 October were able to bring some comfort to family and friends. My thoughts and prayers go out to Greg's family at this difficult time. Quote Tweet Las Vegas Review-Journal @reviewjournal Greg Zanis, the man who built and installed the crosses after the 2017 Route 91 Harvest festival shooting on the Strip, has died https:// reviewjournal.com/local/local-la s-vegas/greg-zanis-who-memorialized-oct-1-victims-with-crosses-dies-2020808/ ", "2020-05-04T22:23:50.000Z": "Here are the rose bushes we planted in honor of Assemblyman Thompson last year.", "2020-05-04T22:08:06.000Z": "Today, I am thinking about Assemblyman Tyrone Thompson, who died one year ago. Assemblyman Thompson spent his career in service of others, including the most vulnerable in our community. I think about him often and miss him very much.", "2020-05-04T16:00:35.000Z": "It's #TeacherAppreciationWeek ! Every teacher has the power to change the world. Their work makes a difference. Thank you for all you do. @nevadaready  #teachersrock", "2020-05-03T20:23:36.000Z": "Thank you, Jeff Yarr, for this important message from the front lines of #COVID19 . Please, Nevadans, continue to stay  home so registered nurses, like Jeff, and other healthcare professionals can provide life-saving care. Registered nurse in Reno: Stay home, save lives Stay home, wear a mask and wash your hands - if not for yourself, do it for the health care providers that are there for you no matter what. rgj.com", "2020-05-02T18:01:47.000Z": "Thank you, Francis, for your hard work on the front lines of this virus! Thank you to all our medical professionals helping battle #COVID19 Quote Tweet @NVHealthResponse @NVHealthRespon1 #NevadaHero Alert! Francis is a certified nurse assistant and mother of two. Through the #COVID19 pandemic, Francis has put in many hard hours and volunteered for overtime. We appreciate the CNAs on the front lines supporting staff and caring for patients. We salute you, Francis!", "2020-05-03T17:22:23.000Z": "Thank you to all our Nevadans who continue to practice aggressive social distancing. Together, we will get through this. Quote Tweet COVID19Washoe @Covid19Washoe Reminder that social distancing guidelines remain in effect. @washoecounty  @CityofReno  @cityofsparks  @WashoeHealth  @WashoeSheriff", "2020-05-03T18:57:22.000Z": "Thank you, Congresswoman! And a special thank you to Senator @LVchrisbrooks 's Mom, who made this Nevada tartan mask! Quote Tweet Dina Titus @dinatitus US House candidate, NV-1 I see @GovSisolak is wearing a beautiful plaid mask. My bill in 2001 designated this pattern as the official Nevada tartan with Tahoe blue, snowy silver and white, and red from our desert rock formations. \n\nBe smart. Wear a mask when you go out.", "2020-05-02T00:00:13.000Z": "Here's the latest look from Google that shows how well we are doing at staying home for Nevada. Thank you to all Nevadans for this important work!", "2020-05-01T23:00:06.000Z": "Thank you to all Nevadans for practicing social distancing. While we prepare for phase 1 and beyond, social distancing will still be a key factor in preventing the spread. Quote Tweet @NVHealthResponse @NVHealthRespon1 Social distancing is working! Keep up the great work, Nevada. Together (but separately) we are #flatteningthecurve of #COVID19 .", "2020-05-01T02:59:45.000Z": "Congratulations to Nicole, our Nevada Hero of the Day! Thank you for all your hard work and dedication to Nevadans. Quote Tweet @NVHealthResponse @NVHealthRespon1 Today's #NevadaHero is Nicole Lamboley, president/CEO of @FoodBankNN , working with WCSD to distribute meals for kids in @washoecounty . They partnered with many including Reno Sparks Conv Ctr to pack/distribute emergency food boxes and expand food distribution. Thank you Nicole!", "2020-05-01T02:57:35.000Z": "If you missed today's press conference, you can watch the whole event here: Nevada United : Road to Recovery On Livestream livestream.com", "2020-05-01T00:25:50.000Z": "And, we have a long road ahead... with still many great challenges to face, difficulties to overcome, and many friends and neighbors will need our help, I know we are an unbeatable team. We are, in fact, Nevada United.", "2020-05-01T00:25:49.000Z": "Our medical teams, our first responders, local government officials, neighbors, Nevada businesses,, our entire Congressional delegation, our Senators, the out of work Nevadans who are giving their time to food banks and other great causes, and this is a partial list, THANK YOU", "2020-05-01T00:25:47.000Z": "I know my remarks have been long, but I find it important to summarize: the next 15 days will be our active transition to a safe and methodical reopening of our economy.", "2020-05-01T00:22:18.000Z": "There's much more info in the Nevada United: Roadmap to Recovery Plan, which can be found online. This plan provides more information on what our phases will look like, including potential duration, goals and expectations - all that will lead us to our eventual new normal.", "2020-05-01T00:22:17.000Z": "After each phase of reopenings, state public health officials will review the numbers of new COVID-19 daily case counts, hospitalizations, & deaths carefully. According to John Hopkins, \"the results of reopening decisions will take 2 to 3 weeks to be reflected in those numbers.\"", "2020-05-01T00:19:11.000Z": "I am happy to announce the formation of the Local Empowerment Advisory Panel, or \"LEAP,\" a group of Nevada stakeholders who will serve as a resource for counties as they work through the requirements to reopen and share best practices and guidelines for local communities.", "2020-05-01T00:19:10.000Z": "Our response efforts should reflect our regional differences, while still operating under our shared, statewide goal of keeping Nevadans safe and restarting our economy.", "2020-05-01T00:16:16.000Z": "If you've lost the live feed, please follow along on my YouTube page: Governor Sisolak Live Stream youtube.com", "2020-05-01T00:15:15.000Z": "We will consider the gradual reopening of dine-in restaurants and personal care services, but with strict guidelines to protect the health and safety of the workers and the customers.  These will be thoroughly reviewed to ensure Nevadans can remain safe.", "2020-05-01T00:15:14.000Z": "The virus remains among us, and people infected with the virus will spread it to others when strong social distancing measures are not in use. It's critical that Nevadans continue wearing improvised face coverings, or \"non-medical\" masks, whenever they leave their home.", "2020-05-01T00:15:13.000Z": "In the next couple of weeks, our focus will be on meeting the criteria & moving into Phase 1 on or before May 15. I'd like to walk through an overview of what you can expect in Phase 1, or as we will call it, our \"Battle Born Beginning.\"", "2020-04-30T23:52:04.000Z": "Please tune in at 5 p.m., as I discuss Nevada United: Roadmap to Recovery. You can watch the stream here: https:// livestream.com/ndemmedia/gove rnorsisolak043020  And you can see the plan online here: https:// nvhealthresponse.nv.gov/wp-content/upl oads/2020/04/NEVADA-UNITED-ROADMAP-TO-RECOVERY.pdf  Nevada United : Road to Recovery On Livestream livestream.com", "2020-05-01T00:08:53.000Z": "Third, we want to have the expanded ability for healthcare providers to administer tests for symptomatic patients and sufficient laboratory testing capacity to process COVID-19 testing samples.", "2020-05-01T00:08:27.000Z": "Second, we want to ensure our healthcare system is able to handle potential new surges in patients, along with non-COVID-19 related services. The hospital system is continuing to indicate surge capacity for all-cause or COVID-19 patient influxes. This is a good sign.", "2020-05-01T00:10:14.000Z": "Fourth, we need sufficient public health workforce capacity in health departments to conduct case contact tracing. These efforts continue to ramp up to scale. We feel very positive & are exploring many ways to expand this workforce & be ready for Phase 1.", "2020-05-01T00:09:50.000Z": "We know long term we will need more. We will be building our capacity to test asymptomatic Nevadans as well, which is one of the primary goals of our response efforts.", "2020-05-01T00:01:42.000Z": "Good evening! Tonight, I am pleased to present to Nevadans our State-specific plan for reopening, Nevada United: Roadmap to Recovery. A copy of the full plan can be found online at http:// NVHealthResponse.nv.gov . Coronavirus (COVID-19) in Nevada | Nevada Health Response Get the latest information and resources on the current status of the Coronavirus (COVID-19) and its impact within Nevada from the Nevada Governor's Office. nvhealthresponse.nv.gov", "2020-04-30T17:37:46.000Z": "At 5 pm tonight, I will unveil Nevada United: Roadmap to Recovery, our State's plan to reopen the economy while continuing to safeguard Nevadans again COVID19. You'll be able to follow along here: Nevada United : Road to Recovery On Livestream livestream.com", "2020-04-30T17:20:06.000Z": "Tune in to hear @nvsupt present the Nevada Department of Education Path Forward plan Quote Tweet NV Superintendent of Public Instruction @NVSupt I will be discussing our Path Forward Plan - Responding to COVID-19 at today's State Board of Education meeting. Watch live by clicking here: http:// doe.nv.gov/State_Board_of _Education/   @NevadaReady  #nevadaready", "2020-04-30T03:33:18.000Z": "Congrats, Aiyana, for being Nevada's Hero of the Day! Thank you for all you are doing to help Nevada beat #COVID19 Quote Tweet @NVHealthResponse @NVHealthRespon1 11 year-old \"Miss Nevada in Action\" Aiyana is today's #NevadaHero ! We are happy to recognize her hard work as a #volunteer , where she makes a difference at @RMHCLasVegas , @Candle_Lighters and local food banks! \nNominate your hero at NevadaHero@gmail.com.", "2020-04-30T02:17:19.000Z": "You can see the full @nevadaready plan here: http:// doe.nv.gov/NewsMedia/Pr ess_Releases/2020/Nevada_Department_of_Education_Releases_Path_Forward_Plan_-_Responding_to_COVID-19/ ", "2020-04-30T02:17:04.000Z": "Along with our economic recovery plans, the Path Forward Plan will rely on the advice of experts to provide support to each district and charter school in developing and implementing a safe approach to re-opening our school buildings for the next school year.", "2020-04-30T02:16:52.000Z": "This Path Forward Plan include establishing a Re-Opening of Schools Committee, which will help develop guidance for schools to create and implement safe, efficient and equitable plans for returning to school buildings in the next school year.", "2020-04-30T02:16:44.000Z": "ICYMI, @nevadaready released its Path Forward Plan today, part of the State's long-term strategy to reopening. I am thankful to @NVsupt and all our local education leaders who are undertaking this important work.", "2020-04-30T01:17:32.000Z": "Tune in at 6:30. I look forward to hearing from @nickcarter and more! Quote Tweet Nick Carter @nickcarter Join me and my fellow #OnlyVegas headliners for #iHeartNews3ForNV benefitting @umcsn and #SalvationArmyNV this Wednesday, 4/29 at 6:30PM PT on @News3LV and streaming on all @iHeartRadio  #LasVegas stations and websites!", "2020-04-30T01:07:18.000Z": "I will present Nevada United: Roadmap to Recovery during a press conference on Thursday, where I will outline the projected phases and structure for how Nevada and local partners will navigate our way through this public health crisis.", "2020-04-30T01:07:07.000Z": "Nevadans have done an incredible job at staying home for our state, & as we work diligently to meet the reopening criteria, I wanted to begin some incremental changes to make our full transition into Phase 1 smoother & positively impact our communities and small businesses.", "2020-04-30T01:04:54.000Z": "Today, I announced that I signed a directive extending a majority of the Stay at Home measures through mid-May, but will be easing some restrictions starting on May 1, 2020. Tomorrow, I will unveil the Nevada United: Roadmap to Recovery plan.", "2020-04-29T13:13:09.000Z": "Good morning Nevadans! Just got word this segment with @GMA will air around noon local time. Thank you for tuning in! Quote Tweet Governor Sisolak @GovSisolak I am excited to join @GMA tomorrow with Amy Robach for a \"Pandemic: What You Need to Know,\" special about Nevada's response to #COVID19 . Please tune in around 6:45 a.m. PST", "2020-04-29T15:27:45.000Z": "ICYMI: Yesterday's Hero of the Day was Jesse Katsaris, the technology director for Pershing County schools. Jesse has worked hard to make sure students in the county have access to the right technology to continue learning online. Thank you, Jesse! Quote Tweet @NVHealthResponse @NVHealthRespon1 Today's #NevadaHero is Jesse Katsaris, tech director at Pershing Co Schools. Jesse ensured all students are equipped w/ devices for online learning during #COVID19 . Jesse manages N. NV Internet Services, giving #FREE internet service to 70 low-income homes with school children!", "2020-04-29T01:14:15.000Z": "It was my pleasure to speak to more than 700 members of the Reno + Sparks Chamber of Commerce earlier today. These small businesses are an important part of the Nevada economy and I was glad to answer some of their questions.", "2020-04-29T02:16:00.000Z": "I was excited to see that Carson has emerged from brumation! The State of Nevada is a little different than when he left it, but Carson and I are so proud of Nevadans who are staying home for Nevada. Quote Tweet Carson the Tortoise @CarsonTortoise Happy Spring! I have officially emerged out of brumation! While practicing social distancing, @GovSisolak had a dandelion ready for me to eat!", "2020-04-29T03:16:15.000Z": "I am excited to join @GMA tomorrow with Amy Robach for a \"Pandemic: What You Need to Know,\" special about Nevada's response to #COVID19 . Please tune in around 6:45 a.m. PST", "2020-04-29T00:56:24.000Z": "While states are now rolling back restrictions, NV never had to restrict surgeries by an emergency directive because our communities took it on themselves. Nevada's Medical Advisory Team also supports the phased-in approach to resume limited procedures under strict guidelines.", "2020-04-29T00:56:13.000Z": "While the State has been focused on battling this public health crisis, I know many of our hospitals, medical practices and dentist offices proactively paused medically necessary services to help flatten the curve and preserve personal protective equipment.", "2020-04-29T00:56:03.000Z": "I am pleased to announce the Nevada Hospital Association is preparing to resume medically necessary procedures for care that has been delayed after the hospitals began to cease such procedures to support COVID-19.", "2020-04-28T22:07:40.000Z": "I will be presenting this plan on Thursday, but there will be many more announcements between now and then. I look forward to this next phase in the battle against COVID19 -- one that will be federally supported, state managed, & locally executed", "2020-04-28T22:07:32.000Z": "I am able to make announcements this week because so many of you have stayed home for Nevada and helped flatten the curve against #COVID19 . I am so proud and grateful to all those who have helped prepare our state for this Roadmap to Recovery.", "2020-04-28T22:07:25.000Z": "On Monday, we joined the Western States compact. Every day this week, I will have big announcements for Nevadans as we finalize our Nevada United: Roadmap to Recovery.", "2020-04-28T19:28:39.000Z": "I am so pleased the Nevada Rural Housing Authority will be providing one-time funding to rural Nevadans experiencing financial hardships. The NRHA is one of 52 organizations in 27 states that have received grant money from National Low Income Housing Coalition. Quote Tweet nvbizmag @nvbizmag Nevada Rural Housing Authority Announces COVID-19 Emergency Assistance Program https:// nevadabusiness.com/2020/04/nevada -rural-housing-authority-announces-covid-19-emergency-assistance-program/ ", "2020-04-28T18:15:19.000Z": "Thank you, Dr. Tiffany Tyler-Garner for your service to the State. I know your leadership & commitment to our communities will continue positively impacting NV & we wish you continued success!", "2020-04-28T18:15:12.000Z": "Heather will bring a wealth of knowledge and expertise in coordinated project management and strategic problem-solving to the Department.", "2020-04-28T18:14:46.000Z": "Today, I am pleased to announce the appointment of Heather Korbulic as the interim director of the Nevada Department of Employment, Training and Rehabilitation.", "2020-04-28T15:15:12.000Z": "Great job, Nevadans! Keep up the good work. You can fill out the Census online or call 1-844-330-2020 Quote Tweet Nevada Census 2020 @NVCensus2020 This is cause for celebration, Nevadans! We've achieved a 53.3% statewide response rate and rank #26 nationwide. If you haven't already, make sure you complete the #NVCensus2020 online or call us at 1-844-330-2020 \n\nPara español, llame 1-844-468-2020", "2020-04-28T00:48:55.000Z": "Congratulations, Michael, for being our Nevada Hero of the Day! Quote Tweet @NVHealthResponse @NVHealthRespon1 Our #NevadaHero is Michael Calamia! Michael is a manager at an Albertson's grocery store in Las Vegas. He works 6 days a week to help members of his community purchase essential items. Thank you, Michael, for supporting the health and well-being of Nevadans.", "2020-04-27T23:03:07.000Z": "@GovofCO and Nevada Governor @SteveSisolak today announced their states are joining CA, OR and WA in the @westcoastpact -a working group of Western state governors with a shared vision for modifying stay at home and fighting #COVID19 . Read the news at https:// colorado.gov/governor/news/ colorado-nevada-join-california-oregon-washington-western-states-pact ", "2020-04-27T23:08:28.000Z": "During this #Ramadan , I want to wish all those in our Nevada Muslim community a blessed month of prayer, reflection, and fasting. Ramadan Mubarak!", "2020-04-27T16:33:03.000Z": "Thank you, Sen. Bryan, Gov. Gibbons, Gov. List, Gov. Miller, Gov. Sandoval and First Lady Guinn for your words of hope and your support for protecting Nevadans health and safety as we plan the reopening of our economy. Former governors: As Nevada returns to normalcy, remain diligent All Nevadans share a responsibility to protect each other and be safe. rgj.com", "2020-04-27T16:02:20.000Z": "Millions of visitors from our fellow Western states travel to NV every year & this partnership will be vital to our immediate recovery & long-term economic comeback. I look forward to continued conversations with @GavinNewsom , @OregonGovBrown , @GovInslee & @GovofCO", "2020-04-27T16:01:56.000Z": "With that in mind, there are four main goals. No. 1: Protect the vulnerable. No. 2: Ensure care for the sick. No. 3: Mitigate the non-direct impacts on our communities. No. 4: Protect the public by ensuring an lifting of restrictions include a system to test, track and isolate.", "2020-04-27T16:01:47.000Z": "We share three major principles in this agreement. No 1: The health & safety of residents comes first. No. 2: Health outcomes & science - not politics - will guide decision making. And No. 3: Our states will only be effective when working together against #COVID19 .", "2020-04-27T16:01:35.000Z": "Today, Nevada is joining California, Colorado, Oregon & Washington in the Western States Pact. I believe sharing information & best practices on how to mitigate the spread, protect the health & safety of our residents,& reopen responsibly  will be invaluable.", "2020-04-26T23:40:19.000Z": "Thank you, Access to Healthcare Network, for providing this valuable resource to vulnerable seniors during this pandemic. Quote Tweet Neoma Jardon @NeomaJardon Are you 60 or older and need grocery delivery? Call 877-385-2345.  Access to Healthcare Network has been awarded emergency food delivery and purchase for seniors who are unable to leave their home during this pandemic. \n1/3 Show this thread", "2020-04-26T04:13:12.000Z": "My thoughts and prayers go out to Greg Zanis and his family. In the middle of our State's darkest days after the 1 October incident, Greg's crosses memorializing those who perished brought comfort to those in mourning. Quote Tweet FOX5 Las Vegas @FOX5Vegas Zanis brought 58 of the markers to Las Vegas in the aftermath of the October 1, 2017 mass shooting https:// bit.ly/3aCtbl1", "2020-04-26T00:15:42.000Z": "Thank you, David and Mason, for lighting up Black Mountain in Henderson and bringing some joy to the night sky while we Stay Home for Nevada! Father, son light up Henderson mountainside to lift spirits Attorney David Koch and his 18-year-old son, Mason, hiked up Black Mountain in Henderson to place lights as a show of support for their community during the pandemic. reviewjournal.com", "2020-04-25T19:42:05.000Z": "Thank you, Steven, for making sure the handicapped, disabled and elderly have access to transportation! Quote Tweet @NVHealthResponse @NVHealthRespon1 Steven Kooser is today's #NevadaHero ! Steven works as a para-transit bus driver for the @RTCSNV . Steven provides transportation for a variety of people, including the handicapped, disabled and elderly. Without his service, members of Clark Co. would be denied basic transportation", "2020-04-24T17:20:47.000Z": "Check out our Nevada National Guard in action. They're playing a key role in our #COVID19 response and I'm grateful for their service. Quote Tweet Briana Erickson @ByBrianaE Yesterday, Guardsmen delivered PPE to local nursing homes. Now they're doing maintenance for the next mission. Show this thread", "2020-04-24T15:44:15.000Z": "This is a great step forward for our gaming small businesses. I am proud that the Nevada delegation worked hard to secure this aid for our Silver State! Quote Tweet Senator Cortez Masto @SenCortezMasto Nevadans, good news: @SBAgov will include gaming small businesses in #COVID19 relief. This is a win for our gaming industry and the entire state of Nevada. I'm proud to have worked with @SenJackyRosen and the entire Nevada Delegation to secure this win for the Silver State.", "2020-04-24T14:15:50.000Z": "Tune into the @TODAYshow around  7:30 am to hear my conversation with @PattersonNBC about Nevada's framework for reopening.", "2020-04-24T01:26:34.000Z": "Watch here for more on my interview with @allinwithChris Quote Tweet All In with Chris Hayes @allinwithchris Gov. Sisolak responds to mayor's calls to open Las Vegas and for its people to be a \"control:\"\n\n\"The mayor doesn't speak for the state of Nevada...There is no way I will allow the mayor to use our citizens or our workers as a petri dish.\" https:// on.msnbc.com/2VXlS2d  #inners", "2020-04-24T01:14:42.000Z": "Check on your loved ones who may be struggling at this time. Find resources here Quote Tweet @NVHealthResponse @NVHealthRespon1 #HopeMeansNevada : Isolation can be harmful for anyone, but especially those with preexisting mental/physical illness. Crisis line: 1-800-283-8255 or text \"care\" to 839863. twitter.com/reviewjournal/", "2020-04-23T22:50:57.000Z": "To all of our Nevada DREAMers: make sure to renew your #DACA today! \n\nThank you, @dreambignv ! Quote Tweet Astrid Silva @Astrid_NV @dreambignv : \n\nDREAMers, renew your DACA! Thank you @GovSisolak for caring about all our Nevada families! \n\n¡Gracias al Gobernador Steve Sisolak por importarle todas nuestras familias Nevadenses! DREAMers, renueven su DACA #Dreamers  #RenewYourDACA  #DACA  #HomeIsHere", "2020-04-23T22:39:17.000Z": "Sorry we missed you today, Wolf, look forward to connecting soon! Quote Tweet Governor Sisolak @GovSisolak I look forward to joining @WolfBlitzer on @CNN today to discuss Nevada's responsible state-specific reopening framework. Please tune in around 3 p.m. to hear my updates.", "2020-04-23T21:28:22.000Z": "I look forward to joining @WolfBlitzer on @CNN today to discuss Nevada's responsible state-specific reopening framework. Please tune in around 3 p.m. to hear my updates.", "2020-04-23T18:17:55.000Z": "Thank you to all the men and women in service helping Nevada battle #COVID19 . Your commitment is  unmatched. Quote Tweet Nevada Guard @NVNationalGuard RECORD ASSISTANCE: There are more than 1100 @NVNationalGuard Soldiers and Airmen across Nev today supporting the COVID-19 health response. This is a record number of Guardsmen called up for a state activation. Vital tasks include testing support and hospital shelter assistance.", "2020-04-23T15:57:28.000Z": "This week, @NevadaDPS got a letter from a young man in Massachusetts, thanking our officers during during the COVID-19 pandemic. He sent messages to departments across the country. Thank you Alexander Britt, for your kind words to our men & women in service!", "2020-04-23T02:45:29.000Z": "Thank you, Ashley and Colby, for helping create hand sanitizer to keep Nevadans safe. Quote Tweet @NVHealthResponse @NVHealthRespon1 Our next #NevadaHero : The Freys, of Frey Ranch Distillery in Fallon! They've donated and distributed gallons of distillery-made hand sanitizer to local first responders at @BannerHealth Churchill Community Hospital,@HawthorneArmyDepot and the @NevadaTrucking Association,", "2020-04-23T02:14:59.000Z": "Watch here for more on my interview with Anderson Cooper Quote Tweet Anderson Cooper 360° @AC360 Nevada Gov. Steve Sisolak: \"I'm not going to allow our workers to be put in position that they have to decide between their job and their paycheck and their life. That's not a fair position to put them in. I will not allow that to happen.\" https:// cnn.it/3cLuWOt", "2020-04-23T01:07:46.000Z": "\"We are clearly not ready to open.\"\n\nNevada Gov. Steve Sisolak responds to Las Vegas Mayor Carolyn Goodman's call for the city's businesses to reopen amid the coronavirus pandemic. \"I will not allow the citizens of Nevada, our Nevadans to be used as a control group.\"", "2020-04-23T01:13:15.000Z": "Nevada Gov. Steve Sisolak: \"I'm not going to allow our workers to be put in position that they have to decide between their job and their paycheck and their life. That's not a fair position to put them in. I will not allow that to happen.\" https:// cnn.it/3cLuWOt", "2020-04-23T01:15:48.000Z": "Nevada Gov. Steve Sisolak: \"I'm not going to allow our workers to be put in position that they have to decide between their job and their paycheck and their life. That's not a fair position to put them in. I will not allow that to happen.\" http:// cnn.it/3cLuWOt From Anderson Cooper 360°", "2020-04-22T18:09:39.000Z": "I am thinking about former Reno Mayor Bob Cashell, who would have turned 82 today. Bob was a great champion for Reno, and helped usher in a period of tremendous growth for the city during his time as mayor. My thoughts are with his wife, Nancy, and his children & grandchildren.", "2020-04-22T23:44:29.000Z": "To those around the country & world who can't wait to visit Las Vegas & other parts of Nevada again: the State of Nevada is committed to protecting our residents & welcoming back visitors to a safe environment when the time is right. We take this seriously.", "2020-04-23T01:16:25.000Z": "Thank you, @andersoncooper , for allowing me to assure Nevadans - and tourists worldwide - that Nevada is taking deliberate, responsible steps toward reopening. I am grateful to Nevadans who are staying home & I look forward to getting back to business as soon as it's safe.", "2020-04-23T00:06:33.000Z": "I look forward to joining @andersoncooper on @CNN tonight to discuss Nevada's responsible state-specific reopening framework. Please tune in around 5:30 p.m. to hear my updates.", "2020-04-22T18:56:40.000Z": "Thank you Bradley, Kristen and David for this important piece on the 50th anniversary of Earth Day. I look forward to reviewing the State Climate Strategy devised by this team to create a more climate friendly future for all Nevadans. Follow @NevClimate for more Quote Tweet Nevada Climate Initiative @NevClimate Happy #EarthDay2020 ! The theme is \"Climate Action.\" Now more than ever, strong climate action in NV will benefit the health of our most vulnerable populations while establishing a stronger, more resilient economy for all Nevadans. https:// bit.ly/34Vm1qV  #NevClimateAction", "2020-04-22T03:46:23.000Z": "So, this is the start of our plan. Based on the guidance of Nevada experts and federal government criteria, we will focus on making sure we are prepared for Phase One. Once our re-opening criteria are satisfied we move into Phase One as laid out by the federal government.", "2020-04-22T03:46:14.000Z": "We will continue our efforts to support teachers, staff, students and families throughout this academic year and I am grateful for Superintendent Ebert's leadership and coordination with our superintendents to provide innovative resources across the state", "2020-04-22T03:40:59.000Z": "Thank you to all who tuned in tonight for my press conference laying out our Nevada state-specific plan when it comes to getting back to business. You can watch the full press conference here: Governor Sisolak Press Conference 4-21-2020 youtube.com", "2020-04-21T23:54:26.000Z": "Here is the live link to tonight's 5 p.m. press conference: Governor Sisolak Press Conference 4-21-2020 youtube.com", "2020-04-21T20:12:40.000Z": "Today, at 5 p.m., I will hold a press conference to update Nevadans on our re-opening framework. I will joined by a team of Nevada experts to lay out the State's criteria to begin re-opening. Please tune in on my YouTube page here: Governor Sisolak youtube.com", "2020-04-21T22:21:01.000Z": "Thank you, Chair! We are always stronger together and I appreciate your leadership throughout this pandemic. #NevadaUnited Quote Tweet FOX5 Las Vegas @FOX5Vegas . @MKNVspeaks says they support @GovSisolak 100%. Emphasizes that no one wants to open up and then have to close again in 30 days.\n\n\"Be patient. We're going to do this together... We're going to rebound together.\" \n\nWATCH LIVE: https:// bit.ly/32bpv6a", "2020-04-21T18:52:05.000Z": "On this Holocaust Remembrance Day, I join all Jewish people to mourn the 6 million Jewish victims of the Holocaust. I am thankful to all those who help keep this tragedy alive by honoring the lives lost. Quote Tweet US Holocaust Museum @HolocaustMuseum Join us today in remembrance of the stories of persecution, of survival, and of resilience as #WeRemember the Holocaust. By reading one story, saying one name, sharing one person's legacy, you keep a memory alive.", "2020-04-20T03:42:30.000Z": "Here is a recap of all our Heroes of the Day last week. From the bottom of my heart, thank you to all these Nevadans who are helping us #StayHomeForNevada . Quote Tweet @NVHealthResponse @NVHealthRespon1 Here's to our Nevada Heroes over the past week! Thank you all for going above and beyond to support Nevada's communities during these most trying times. You are setting the bar, being the example, and giving us all hope. We are so grateful for all you do! https:// bit.ly/2XQEtQ6", "2020-04-20T00:53:59.000Z": "The First Lady helped me with an important task: a haircut. We found some online tutorials to help. I am so grateful to all who are Staying Home for Nevada during this #COVID19 pandemic and finding creative solutions for things like haircuts. Thank you, Kathy, you're the best!", "2020-04-19T23:21:28.000Z": "Thank you, Nevada National Guard for helping control the flow of traffic at the drive-thru testing center at the Reno Livestock Events Center. Quote Tweet @NVHealthResponse @NVHealthRespon1 Nevada National Guard providing medical support, food bank and warehouse logistics, transportation of supplies and set up of alternate care facilities for communities around the state. Thank you!", "2020-04-19T19:52:27.000Z": "To all Orthodox Christians celebrating across Nevada, I wish you a Happy Easter! Quote Tweet Dina Titus @repdinatitus From my family to yours, #HappyGreekEaster to everyone celebrating today. Kalo Pascha!", "2020-04-18T23:20:40.000Z": "Nevada heroes live among us- they're our neighbors. They make our communities stronger and they represent what makes our State so resilient and special. Thank you. Mrs. Fairless! Quote Tweet @NVHealthResponse @NVHealthRespon1 Our hero of the day is Renee Fairless, principal at Mater Academy Mountain Vista in Las Vegas. After school's food provider halted deliveries, many kids were left without food options. Mrs. Fairless reached out to Casinos, which supplied donated food for families in need.", "2020-04-18T21:47:14.000Z": "Today, I had a briefing with my team of medical and emergency response experts. We're reviewing the recommendations from the White House and making considerations for our state-specific re-opening plan. I look forward to presenting these updates to Nevadans soon.", "2020-04-17T16:39:27.000Z": "Regarding the election lawsuit filed yesterday, I believe voting needs to be done in a way that ensures every eligible Nevadan is given the opportunity to cast their vote & in a way that prioritizes their wellbeing. Accessibility & safety are the keys to a successful June primary", "2020-04-17T18:13:10.000Z": "Congrats to yesterday's Hero of the Day! I am so proud of what Autumn is doing to keep her tribal elders safe. Quote Tweet @NVHealthResponse @NVHealthRespon1 Autumn Harry is our #NevadaHero today! She's using her fishing skills to help put ancestral foods on the table for elders of her tribal community. She also launched an effort to encourage Natives to take an oath to implement safety protocols within families and communities", "2020-04-17T19:55:36.000Z": "Thank you to Specialist Ricky Wade and all our Nevada National Guard members for helping make sure critical supplies of PPE are distributed across our great State.", "2020-04-17T22:30:42.000Z": "Today, I talked to Ron Pipkins, a 55-year-old retired Marine private and the first presumptive positive #COVID19 case in Nevada. After a long battle, Ron is on the mend and preparing to leave the VA soon and head to a rehab facility. Talking to him was the highlight of my day.", "2020-04-17T21:46:05.000Z": "The Carson City Library staff put their 3D printers to good use by making face shields for front-line workers and for sharing info with libraries across the State to do the same. Together, we will get through this. Carson City Library finds customers for face shields in pandemic Face shields produced by Carson City Library staff have found a couple of customers. Soon after the library closed due to the coronavirus outbreak, staff began working with the library's 3D printers... nevadaappeal.com", "2020-04-16T21:10:10.000Z": "Today, I joined a call with the White House COVID-19 taskforce, where they shared guidance on opening up America agin. My medical and emergency response teams, in addition to my Office, will be reviewing these materials as we continue to develop Nevada's state specific plan.", "2020-04-17T00:05:42.000Z": "As soon as we finalize our state-specific approach to gradually getting back to our normal lives, I will be right here, telling you exactly how we are going to do it. I have been honest with the public all along and that's not going to change.", "2020-04-17T00:02:52.000Z": "Thanks for tuning in tonight! For those of you watching, make sure to check out today's Daily Situation Report on the @NVHealthRespon1 website to get the latest updates: Situation Reports | Nevada Health Response COVID-19 Pandemic Situation Reports 7/23/2020 Situation Report 7/16/2020 Situation Report 7/09/2020 Situation Report 7/02/2020 Situation Report 6/25/2020: Situation Report 6/18/2020: Situation Report... nvhealthresponse.nv.gov", "2020-04-17T00:27:34.000Z": "These folks are working around the clock to expand testing volume and research innovative approaches. I receive daily briefings from Dr. Pandori & other medical experts, and I look forward to updating Nevadans on their work.", "2020-04-17T00:22:19.000Z": "Like every other state, we still don't have enough testing, but thanks to the hard work of Dr. Pandori and others across the State, we are developing plans...", "2020-04-17T00:10:09.000Z": "Tonight I'm joined by Dr. Mark Pandori from the Nevada State Public Health Laboratory to give an update on our testing situation. Dr. Pandori has a PhD in Biomedical Science with an emphasis in virology. He's a really smart guy.", "2020-04-16T21:49:51.000Z": "This is great news for the State of Nevada. Quote Tweet Senator Jacky Rosen @SenJackyRosen Today, I announced I've been appointed to serve on a White House Task Force on re-opening the economy in the wake of COVID-19. Show this thread", "2020-04-16T01:46:06.000Z": "Thank you, Alexis, for all you've done so far! Alexis has made more than 220 masks so far and I'm so proud she is the #NevadaHero today. Nominate a hero by emailing nevadahero@gmail.com or by calling 775-687-0437 Quote Tweet @NVHealthResponse @NVHealthRespon1 Our #NevadaHero of the day is 14-year-old Alexis Scott! This daughter of a @NVNationalGuard soldier worked 40 hours cutting patterns and sewing for patients, first responders, hospitals and Guardsmen!  Thank you, Alexis, for supporting those on the front lines against #COVID19 !", "2020-04-15T19:07:16.000Z": "Thank you, Marc-Andre Fleury for staying home and staying safe for Nevada. We are all in this together and we look forward to seeing all our @GoldenKnights back on the ice as soon as it is safe! #StayHomeForNevada Quote Tweet y-Vegas Golden Knights @GoldenKnights Stay home & stay safe  #VegasBorn | #StayHomeForNevada", "2020-04-15T18:02:56.000Z": "Today, @detrjobconnect launched its toll-free hotline mentioned last night. This hotline can help answer general unemployment questions and will help free up the DETR phone lines for specific claims. Learn more here Quote Tweet DETR NVJobConnect @DETRJobConnect The new call center is now answering a newly established general question toll-free hotline: (800) 603-9671.  Operation hours are of M-F, 8 a.m. to 8 p.m. Staff will assist claimants with general questions related to the unemployment insurance filing process.", "2020-04-15T00:06:23.000Z": "Here's the latest hospitalization data received from @NVHospitals . One of our goals is to ensure our medical system can withstand a surge from #COVID19 . The best way to do that? #StayHomeforNevada", "2020-04-15T00:05:14.000Z": "So far the State has distributed 1.9 million pieces of PPE. @NVEmergencyMgmt disperses PPE through the regional distribution formula based on requests from cities/counties. It then goes to local health districts or counties and they distribute at the local level.", "2020-04-15T00:05:12.000Z": "Thanks for tuning in tonight! For those of you watching, make sure to check out today's Daily Situation Report on the @NVHealthRespon1 website to get the latest updates: Situation Reports | Nevada Health Response COVID-19 Pandemic Situation Reports 7/23/2020 Situation Report 7/16/2020 Situation Report 7/09/2020 Situation Report 7/02/2020 Situation Report 6/25/2020: Situation Report 6/18/2020: Situation Report... nvhealthresponse.nv.gov", "2020-04-15T00:11:15.000Z": "In the weeks between March 14th and April 4th, Nevada saw the three highest numbers of initial weekly unemployment insurance claims on record for our state.", "2020-04-15T00:11:16.000Z": "In the week ending on April 4th, over 79,000 Nevadans filed initial unemployment insurance claims. That is nearly nine times as many initial weekly claims as the highest week in the Great Recession, which was 8,900 in January 2009.", "2020-04-15T00:11:18.000Z": "I say all this to demonstrate the magnitude of what we are facing right now. And we're not alone. All across the country, states are facing record-breaking job losses and unemployment claims", "2020-04-15T00:34:29.000Z": "Finally, DETR is rolling out a new staggered filing calendar. They'll have more info coming out soon, but here's a snapshot:", "2020-04-15T00:27:53.000Z": "Also from Kimberly: For those that are self-employed and gig workers. I know you are also hurting. We are doing our very best to fast track the system necessary for you to apply. The state has identified a vendor to get this new module done.", "2020-04-15T00:13:59.000Z": "I ask my staff to bring me your messages every night. Many have said they can't get through on the phones, even after calling all day. Others have expressed frustration with password resets or that the website is too slow to file. These are real concerns and I hear them.", "2020-04-15T01:25:51.000Z": "Let me be clear: Due to the decrease in federal funding (Unemployment Administration Insurance Grant), &  the inability to use Penalties & Interest funding to support the UI program, strategic eliminations to DETR were made in previous sessions. This is NOT the fault of #nvleg ...", "2020-04-15T01:37:28.000Z": "Thank you to @DETRJobConnect for joining me to provide an update to Nevadans on unemployment concerns. There's so much hard work being done by @ttyler72 and her team, including Kimberly Gaa, who was with me today. Together, we will get through this.", "2020-04-14T20:42:37.000Z": "I am so glad to have the help and expertise of Nevada's National Guard in battling this pandemic Quote Tweet Nevada Guard @NVNationalGuard HISTORIC BATTLE: About 700 @NVNationalGuard Soldiers and Airmen will enter the fight against COVID-19 this week said @GovSisolak today. They will join the 100 already on orders and bring the state's COVID-19 response total to about 800, the largest state activation in history.", "2020-04-14T23:54:41.000Z": "Here is the live link for tonight: https:// youtube.com/channel/UC3DFs 2YeOMbAbY7XPqsereQ  Quote Tweet Governor Sisolak @GovSisolak Today, at 5 p.m., I will hold a press conference to update Nevadans on Unemployment Insurance. Please tune in on my YouTube page here: https:// youtube.com/channel/UC3DFs 2YeOMbAbY7XPqsereQ ", "2020-04-14T18:52:42.000Z": "Thank you for visiting the State Emergency Operations Center and the Joint Operations Center yesterday! #StayHomeForNevada Quote Tweet Governor Sisolak @GovSisolak Today, I met w/ Nevadans working in the State Emergency Operations Center & Joint Operations Center to thank them for their service to our State. These folks are working around the clock to help NV manage this unprecedented public health crisis. I am so grateful for their work.", "2020-04-14T03:03:18.000Z": "Thank you, Kristen, for your commitment to the Silver State! You and your fellow registered nurses are a critical component to making sure we battle this virus. You truly are a #NevadaHero Quote Tweet @NVHealthResponse @NVHealthRespon1 Kristen Gohr is the #NevadaHero of the day! Kristen is a lifelong Nevadan, serving her community as a registered nurse at University Medical Center. She's working tirelessly to provide lifesaving care amid #COVID19 crisis. A very heartfelt thank you for your  compassion & support", "2020-04-14T00:49:59.000Z": "I view this challenge as a great opportunity & will work w/ my fellow Western regional Governors, leaders from around the country, & local governments across Nevada to ensure our residents & future visitors know there is a strong plan in place when we reopen for business. (4/4)", "2020-04-14T00:49:49.000Z": "I understand that because of Nevada's position as one of the leading tourism hubs in the world, our State has the unique challenge of enacting the highest safety standards possible. (3/4)", "2020-04-14T00:49:42.000Z": "in addition to the millions of visitors we welcome every year as the premier domestic and international travel destination. (2/4)", "2020-04-14T00:49:35.000Z": "Nevada's state-specific plan to phase out the current Stay at Home directives and reopen our economy will be driven by the advice of medical experts to ensure the health and safety of our residents, (1/4)", "2020-04-13T18:12:21.000Z": "This morning I had a productive briefing call with Vice President Pence and other Governors across the country. We received an update on FEMA and discussed operationalizing COVID-19 testing at the state level.", "2020-04-13T16:04:48.000Z": "Thank you to the Dispatch team for all your hard work, you are absolutely critical to making sure Nevada's DPS operations run smoothly. Thank you for all you do for our State! Quote Tweet Nevada DPS @NevadaDPS #NationalPublicSafetyTelecommunicatorsWeek Thank you to our Nevada DPS Dispatch team, and all public safety telecommunicators, for your service and dedication. We appreciate you. #heroes  #NevadaDPS  #dispatch  #Nevada", "2020-04-12T19:27:54.000Z": "Thank you to the Reaves family for reminding our Nevada family that we're all in this together! #StayHomeforNevada Quote Tweet y-Vegas Golden Knights @GoldenKnights The Reaves family checking in to remind everyone stay home & stay safe  #StayHomeForNevada", "2020-04-12T16:48:59.000Z": "Celebrations look different this year, but unwavering faith remains the same. To those who are celebrating, Kathy and I wish you a blessed and peaceful Easter.", "2020-04-12T00:16:20.000Z": "Today, I was briefed on some great news out of the Battle Born Medical Corps. More than 751 individuals have signed up to volunteer. Thank you to all those who are heeding the call. Together, we will get through this.", "2020-04-11T22:05:40.000Z": "Thank you @NellisAFB and the @AFThunderbirds for this salute to our healthcare professionals! Remember, by staying home for Nevada, you help our healthcare worker provide life-saving care.", "2020-04-11T20:52:57.000Z": "Thank you, @burningman , for making this responsible and difficult decision. I look forward to seeing your return to the playa next year. Quote Tweet Burning Man Project @burningman In the interest of the health & wellbeing of our community, we have decided not to build Black Rock City this year. Burning Man, however, is alive & well, and we look forward to seeing you in the Multiverse. Read more in the Burning Man Journal. https:// journal.burningman.org/2020/04/news/o fficial-announcements/brc-2020-update/  Show this thread", "2020-04-11T19:36:05.000Z": "Less than 2 hours until the Air Force Thunderbirds take off over Las Vegas in honor of our healthcare workers! Don't miss it! Quote Tweet Susie Lee @SusieLeeNV US House candidate, NV-3 Looking forward to watching the Air Force Thunderbirds at 2:30 pm today as they honor our health care workers. They'll take off with 16 U.S. and fly by the 16 major hospitals in the valley. #StayHomeForNevada  https:// ktnv.com/news/coronavir us/thunderbirds-to-thank-frontline-workers-with-vegas-hospitals-flyover ", "2020-04-11T18:28:32.000Z": "A big thank you to Assemblyman @SteveYeagerNV & all of the NV legislators who have gone above & beyond to support our communities & frontline workers! If you're looking for some inspiration, check out Steve's twitter feed  #lookforthehelpers Quote Tweet Steve Yeager @SteveYeagerNV By the end of this week we will have delivered over 2,400 meals, 23 dozen donuts, and 6 cases of ginger ale to our frontline workers in Las Vegas. A sincere thank you to all who have donated and assisted with the deliveries! Help us keep it going here: https:// gofundme.com/f/las-vegas-fr ontline-food-fund ", "2020-04-11T18:20:39.000Z": "Thank you Chair Athar Hasseebullah, Rev Clayton Moore, Pastor Jason Hall, President Rahan Zed & Pastor Robert Fowler for participating in an interfaith zoom call today. These leaders, & others, have taken proactive measures to #StayHomeForNevada . I'm grateful for their guidance.", "2020-04-11T02:45:54.000Z": "\"The U.S. Air Force Air Demonstration Squadron 'Thunderbirds' will show their support for frontline COVID-19 responders with a flyover the Las Vegas Valley on Saturday.\" #StayHomeforNevada Thunderbirds honor COVID-19 responders with Las Vegas flyover -- VIDEO The U.S. Air Force Air Demonstration Squadron \"Thunderbirds\" will show their support for frontline COVID-19 responders with a flyover the Las Vegas Valley on Saturday. fox5vegas.com", "2020-04-11T01:49:59.000Z": "Unfortunately, today our State surpassed 100 deaths from #COVID19 . My thoughts & prayers are with the victims and their loved ones. \n\nI promise that I will keep doing everything I can to continue fighting this virus. #StayHomeForNevada", "2020-04-10T17:46:19.000Z": "Our healthcare pros go to work fo you, so please stay home for them. #BattleBornMedicalCorps  #StayHomeForNevada", "2020-04-07T00:10:01.000Z": "If you've lost your job (and with it, your health insurance) due to the COVID-19 closures, you may qualify for a special enrollment period. Visit our website to learn more. #MyHealthNV Special Enrollment Period - Nevada Health Link - Official Website nevadahealthlink.com", "2020-04-10T19:01:50.000Z": "Dean Larson and her fellow #COVID19 Medical Advisory Team members have been invaluable to our State as we navigate this difficult situation. I'm incredibly grateful for their expertise and guidance. #StayHomeforNevada Quote Tweet Univ. of Nevada Reno @unevadareno Dean of the @unevadareno School of Community Health Sciences Trudy Larson has been 1 of 5 members recently selected for the state's new Medical Advisory Team by @GovSisolak . #PackPride  #StayHomeForNevada  https:// bit.ly/2JWji72", "2020-04-10T19:14:18.000Z": "Check out this useful flyer from @AaronDFordNV for more info on the eviction moratorium. Tenants & landlords are encouraged to work together on any rent issues & other contractual obligations.\n\nAdd'l guidance: \nEnglish: https:// nvhealthresponse.nv.gov/wp-content/upl oads/2020/03/Gov.-Sisolak-Guidance-Directive-008-Evictions-Updated-on-3-30.pdf  Spanish: https:// nvhealthresponse.nv.gov/wp-content/upl oads/2020/03/Gobernador-Sisolak-Directiva-008-%E2%80%93-Desalojos-de-Viviendas-Master.pdf  Quote Tweet KTNV Action News @KTNV EVICTION INFO: @AaronDFordNV 's office also released this flyer to help #tenants and #landlords understand their rights. You can download your own copy linked in the story: http:// bit.ly/39NEkPH", "2020-04-10T17:49:56.000Z": "On #GoodFriday , Christians around the world join in celebration, reflection, & rememberance of the sacrifices made for them. Faith has always been an important part of my life, & it's something that I know will help guide many of us through these challenging times.", "2020-04-10T02:41:50.000Z": "Nevada proud! Quote Tweet UNR Med @unrmed We're so proud of Dr. Pandori's team and the collaborative testing efforts across the state. And thank you, @GovSisolak , for all that you're doing to keep Nevada safe and healthy. We're all in this together! twitter.com/GovSisolak/sta", "2020-04-10T00:39:29.000Z": "Today I joined @DETRJobConnect to announce the selection of a vendor to provide at least 100 full-time operators to boost unemployment insurance call center capacity at a time of historic demand. Call center expected to open next week & follows staffing bump from 75 to over 200.", "2020-04-10T00:05:38.000Z": "Nevada is one of 2 states with an A grade on the @Unacast social distancing scoreboard! I'm so proud of our state. Keep up the great work, NV! #StayHomeforNevada Covid-19 Social Distancing Scoreboard - Unacast Social distancing is seen as the most effective way of slowing the spread of the virus causing COVID-19, and is strongly advised by the World Health Organization and the CDC. At Unacast, we wanted to... unacast.com", "2020-04-09T23:25:38.000Z": "Even through these difficult times, our educators are sending messages of support to Nevada's students and families  #StayHomeforNevada Quote Tweet Eva G. Simmons Elementary @SimmonsSquad We hope you are having a great spring break and that you are staying  safe and healthy! We miss our Simmons Squad!! #stayhome4nv  #simmonsstrong  @ClarkCountySch  @CCSD_Trustees  @GovSisolak  @SuptJaraCCSD", "2020-04-09T21:36:46.000Z": "Just wrapped up a briefing where I got an update from Dr. Mark Pandori, Director of the Nevada State Public Health Lab, where he shared the great news that Nevada is above the national average of tests per 100,000 residents: \n\nNevada: 725 \nU.S. Average: 596", "2020-04-09T19:26:45.000Z": "Looking for all the most up-to-date NV #COVID19 information, incl. guidance & Q&As on emergency directives & regulations? Visit the NV Health Response Center ( @NVHealthRespon1 ) here: http:// nvhealthresponse.nv.gov And follow them here: http:// facebook.com/NVHealthRespon se   http:// instagram.com/nvhealthrespon se  Coronavirus (COVID-19) in Nevada | Nevada Health Response Get the latest information and resources on the current status of the Coronavirus (COVID-19) and its impact within Nevada from the Nevada Governor's Office. nvhealthresponse.nv.gov", "2020-04-09T19:03:47.000Z": "Great news for all of the Nevadans battling #COVID19 on the front lines! Thank you to @LasVegasSands for your incredible commitment to bringing PPE to the Silver State! #StayHomeForNevada Quote Tweet Las Vegas Sands @LasVegasSands Plane with #onemillionmasks for first responders begins unloading in Vegas Show this thread", "2020-04-09T17:17:40.000Z": "As of yesterday, 475 doctors, nurses, EMTs, med students & more have responded to our call for medical professionals to join the #BattleBornMedicalCorps . We need all the help we can get to fight #COVID19 , & I'm so proud of these Nevadans. Sign up at http:// servnv.org . Quote Tweet 8 News NOW @8NewsNow Battle Born Medical Corps Update: 475 Nevadans have signed up to serve from a variety of fields. They will provide much-needed assistance to other medical professionals. #8NN  #BeInformedVegas", "2020-04-09T02:56:49.000Z": "Thank you, @bryceharper3 , for supporting your home town. \n\nWe're #AllInThisTogether . Quote Tweet @NVHealthResponse @NVHealthRespon1 A big shout-out to Nevada's own, @bryceharper3 for his huge donation to our #LasVegas community during the COVID-19 pandemic. #StayHomeForNevada  http:// ow.ly/MYFs50z8Pl6", "2020-04-09T01:33:24.000Z": "This was not an easy ask of Nevadans. I've attended Catholic services my entire life. I fully appreciate the power of in-person services. Hearing a sermon. Speaking with a pastor, rabbi, imam, or other religious leader. Being surrounded by a community of spiritual followers. 3/4", "2020-04-09T01:33:23.000Z": "Finally, after a lot of thoughtful discussion & guidance from my Medical Advisory Team, my legal team, & faith leaders from across our State, I have decided to place new limitations on participation in in-person worship services. 1/4", "2020-04-09T01:33:22.000Z": "(5) licensed barbers & stylists are prohibited from offering in-home beauty services other than to those in household;\n\nBarbers & hair stylists are not essential. Going to someone's home doesn't change that fact. I haven't had a haircut in over 6 weeks. I've adjusted. So can you.", "2020-04-09T01:33:21.000Z": "(3) operating businesses must provide adequate protections for their workers & adopt sanitation protocols that minimize risk of spread;\n\nThis is a common-sense measure to ensure businesses are operating safely.", "2020-04-09T01:33:20.000Z": "We know that essential businesses can do better, too.\n\nAnd while I encourage outdoor activity as much as possible, some activities have unnecessarily become high-risk due to people circumventing the intent of our social distancing directives.", "2020-04-09T01:33:19.000Z": "There are lessons we've learned from other states-some have allowed religious services to continue without restriction, which has been followed by a spike in new infections. We can't let that happen in NV. And our businesses can do a better implementing social distancing.", "2020-04-09T01:33:18.000Z": "From the start, I've been clear about my goal: mitigate the spread of #COVID19 to save lives & protect our health care system from being overwhelmed, which could lead to disastrous results. What the data shows is that strict social distancing is the only way to beat this virus.", "2020-04-08T23:41:06.000Z": "Tune in to my YouTube page at 5pm for an update on COVID-19 in Nevada: Governor Sisolak youtube.com", "2020-04-08T18:57:43.000Z": "Great news! Personal Protective Equipment (PPE) supplies are making their way to Southern Nevada with the help of our own @NVNationalGuard ! Nevadans across the state are working tirelessly to protect our communities and save lives. Help them help you & please #StayHomeForNevada .", "2020-04-08T19:00:37.000Z": "Shout out to the ASL interpreters doing public health messaging for @GovSisolak and @cityofhenderson and @ anyone else I have missed.", "2020-04-08T18:08:47.000Z": "The more you #StayHomeForNevada now, the sooner these sluggers can get back on the field! Thanks for helping spread the message! Quote Tweet Rob R @rosie21680 My boys and I miss baseball!! @LittleLeague  @Nationals  @ClarkCountyNV  @GovSisolak", "2020-04-08T17:42:28.000Z": "I am thankful for Dr. Tony Alamo's 12yrs of service on the NV Gaming Commission, 7yrs on the Athletic Commission (1st person to chair both), 14yrs of @LVMPD volunteer service, & community health care work in NV. I fully support his commitment to responding to the #COVID19 crisis. Quote Tweet Las Vegas Review-Journal @reviewjournal Nevada Gaming Commission Chairman Tony Alamo, a physician who has served as a gaming regulator for 12 years, is resigning before the end of his third term to devote more time to battling the COVID-19 outbreak. https:// reviewjournal.com/business/casin os-gaming/nevada-gaming-regulator-chairman-alamo-resigns-2001579/ ", "2020-04-08T14:02:21.000Z": "This is absolutely devastating. My thoughts are with Vianna's family, friends, & co-workers. \n\nOur frontline health care workers are putting themselves in harms way every single day to save lives. Their bravery knows no bounds. This is why we must continue to #StayHomeForNevada . Quote Tweet Anjeanette Damon @AnjeanetteDamon Reno nurse dies of coronavirus in the same hospital where she had been caring for patients the last seven years. So heartbreaking. https:// rgj.com/story/news/202 0/04/07/covid-19-reno-nurse-dies-va-hospital-where-she-cared-patients/2966935001/ ", "2020-04-08T01:38:01.000Z": "Reminder: you can enroll in health insurance at http:// nevadahealthlink.com until April 15th. Subsidies available for those who qualify. Enroll now! Quote Tweet @NVHealthResponse @NVHealthRespon1 If you need health insurance, @NVHealthLink has opened a special enrollment period until April 15th. For more information and to apply for coverage call: 1-800-547-2927 or visit http:// nevadahealthlink.com/coronavirus .", "2020-04-07T21:21:24.000Z": "This is a beautiful way to show respect for our frontline health care workers, first responders, and all those doing whatever it takes to #flattenthecurve . Thank you for everything you do. #StayHomeForNevada Quote Tweet Vegas @Vegas Las Vegas proudly supports the courageous efforts of health care workers, first responders and others on the front lines. Today, #VegasGoesBlue for you. #StayHomeForNevada", "2020-04-07T17:57:48.000Z": "Today, I attended the virtual service for NV Board of Regents member Sam Lieberman. It is without question that Sam had a tremendous impact on education, his community, & everyone around him. Thank you to all those who shared their kind words and stories about this inspiring man.", "2020-04-07T15:49:37.000Z": "On #WorldHealthDay , we recognize and salute our dedicated doctors, nurses, and other medical professionals who are tirelessly working to protect our health. Let's help them stay safe by staying home and keeping 6ft of social distance when we do have to leave. #StayHomeForNevada", "2020-04-06T21:00:00.000Z": "Let's stay home for our families. Let's stay home for our neighbors. Let's stay home for our children. Let's stay home for our siblings. Let's stay home for our community. Together we will get through this. Who are you staying home for? #StayHomeForNevada  http:// ona.nv.gov/home/features/ Staying_Home_4/ ", "2020-04-07T01:44:14.000Z": "We are currently investigating whether all 12 of these deaths occurred today, or if there was a lag in timely reporting over the weekend. If so, I will work to make sure this is fixed.", "2020-04-07T01:44:13.000Z": "In the short amount of time since my press conference ended, new reports to the State show another 12 deaths as a result of #COVID19 , bringing our statewide total to 58. My thoughts & prayers are with the families of the victims. We must continue to stay vigilant. Quote Tweet Governor Sisolak @GovSisolak So far, we've lost 46 Nevadans to #COVID19 . From yesterday to today, we didn't lose a single life. We will continue monitoring the numbers closely to identify patterns. Show this thread", "2020-04-07T00:18:12.000Z": "Ventilator use had increased slightly and is now at 44%. We have submitted an order to FEMA for 450 ventilators & have been told to expect delivery 72 hours before our surge. We continue to work with FEMA to monitor usage across the state and the potential surge date.", "2020-04-07T00:14:49.000Z": "According to @NVHospitals , 282 COVID-19 patients are in Nevada hospitals statewide. Review additional hospitalization data below.", "2020-04-07T00:34:08.000Z": "Major General @ondralberry joined me to share our 5 goals:\n1-Minimize Deaths & Mitigate Spread\n2-Obtain PPE to Protect Safety Workers\n3-Expand Testing to Inform Decision-Making\n4-Efficient & Coordinated State Information Flow\n5-Inform Public on Medical Expert-Endorsed Strategy", "2020-04-07T00:35:04.000Z": "I want to thank all who tuned in. I look forward to providing more updates throughout the week. And remember: #StayHomeForNevada", "2020-04-07T00:23:00.000Z": "We know we need more PPE, and we continue our aggressive efforts to attain and distribute more. We won't stop fighting for more PPE for Nevada.", "2020-04-06T23:54:34.000Z": "Tune in to my YouTube page at 5pm for an update on COVID-19 in Nevada: Governor Sisolak youtube.com", "2020-04-07T00:03:49.000Z": "Tune in NOW: https:// youtu.be/jns_T8XdPew Quote Tweet Governor Sisolak @GovSisolak Tune in to my YouTube page at 5pm for an update on COVID-19 in Nevada: https:// youtube.com/channel/UC3DFs 2YeOMbAbY7XPqsereQ ", "2020-04-07T00:12:32.000Z": "So far, we've lost 46 Nevadans to #COVID19 . From yesterday to today, we didn't lose a single life. We will continue monitoring the numbers closely to identify patterns.", "2020-04-07T00:12:31.000Z": "As of today, we have 117 new positive cases. Our total positive cases have steadily increased since end of March, to a total of 1,953.", "2020-04-07T00:05:40.000Z": "To date, NV has received 3k reagent kits for testing & 4K test swabs from the federal government. We appreciate the testing components we've received, but the reagents provided are not nearly enough needed to perform the desired amount of testing.", "2020-04-07T00:04:25.000Z": "To start, I want to thank all those who continue to #StayHomeForNevada . You're doing your part and the State appreciates it.", "2020-04-06T20:16:03.000Z": "Thank you to @RTCSNV and @threesquareLV for all you're doing to help our seniors in need. Quote Tweet RTC Southern Nevada @RTCSNV We're teaming up with @threesquareLV to deliver food to seniors in the community, in an effort to ensure those who are unable to leave their homes can receive the essential goods through the food bank's Senior Hunger Program. https:// bit.ly/3aFsKr5  #StayHomeForNevada", "2020-04-06T19:01:46.000Z": "I had a productive 2-hour phone call this morning with Vice President Pence's Task Force. I'm fighting for Nevada every day with the goal of getting the resources we need to mitigate the spread of #COVID19 .", "2020-04-06T01:32:16.000Z": "Nevadans all across the state are taking action in shaping our future.\n\nWant to join them? Get counted now!\n\nVisit http:// census.nv.gov , and fill out the quick and easy #NVCensus2020 questionnaire or call us at (844) 330-2020. #CensusWeek  #BeCountedNVAtHome", "2020-04-05T21:00:31.000Z": "We're all in this together! Thank you, William Neal! #StayHomeForNevada  @reviewjournal  http:// ow.ly/SQSy50z5kWA"}