{"2020-07-03T15:17:16.000Z": "Everyone must stay committed to protecting themselves and others. We all have a responsibility to continue to practice social distancing, wash our hands regularly, and wear a mask in public. Be responsible, be kind and we'll get through this. #AllTogetherNM  #ProtectNM  #MaskUp", "2020-07-30T18:39:48.000Z": "Need childcare? We need to know. Complete this survey to help NM develop the right programs in the right places for families of children up to 12yo. #BackToSchoolNM  https:// bit.ly/NMchildcare", "2020-07-30T18:58:37.000Z": "For a lot of folks across New Mexico -  and the nation - there are no other options if the #PostalService goes under. 600k workers out of work & a reliable system to vote by mail are at risk. Add your name to the petition & demand Congress take action. Add your name: Demand Congress save the U.S. Postal Service! petitions.signforgood.com", "2020-07-30T15:20:12.000Z": "I'll be joined by state officials at 3 PM this afternoon to give an update on New Mexico's #COVID19 efforts and the public health emergency order.\n\nPlease tune in at http:// facebook.com/GovMLG En español: https:// youtube.com/c/GovMLG", "2020-07-29T20:56:50.000Z": "I'll continue to commit to New Mexico's energy future - creating green jobs, combating climate change, and putting cash back in the pockets of hard-working New Mexican families. Quote Tweet Climate Power @ClimatePower \"Trump's climate denial is a war on New Mexican workers.\" @GovMLG is building a clean energy economy in New Mexico to protect the state's workers and create good-paying, sustainable jobs.\n \nThis is what it looks like to lead on science. Show this thread", "2020-07-29T14:35:07.000Z": "My administration is supporting workers whose employers demonstrate a blatant disregard for the safety of their staff, their customers, and their community.\n\nIt is unacceptable to be maintaining an unsafe workplace amid the ongoing pandemic. Unemployment benefits offered to workers at New Mexico restaurants defying COVID-19 closures Workers at nine New Mexico restaurants were offered unemployment benefits if they resigned due to safety concerns related to the coronavirus pandemic. currentargus.com", "2020-07-28T18:10:02.000Z": "More than 175,000 New Mexicans have benefited from the $600 boost throughout the pandemic. It's a literal lifeline.\n\nCutting these funds is an unconscionable step backward in our fight to both provide help to affected workers & to help sustain our economy. Senate GOP moves to cut $600 weekly jobless benefit by two-thirds The emerging details represent a counteroffer to Democrats, who blasted the proposal and have pushed to extend the full $600 payment. nbcnews.com", "2020-07-28T17:14:10.000Z": "Did the #Census slip your mind? You're not alone but you've gotta act fast! It's your last chance to answer before census takers start going door-to-door to interview the homes that are missing. Get your home counted online, by phone, or at http:// 2020census.gov  #TrueForYou", "2020-07-28T14:52:38.000Z": "I am taking quick action to distribute critical CARES Act funding across New Mexico: $50 million for grants to small businesses that have been impacted by the COVID-19 pandemic Tens of millions of dollars for local and tribal governments NM using federal funds to launch $50M small business grant program SANTA FE -- Gov. Michelle Lujan Grisham said Monday her administration will earmark $50 million in federal funds to set up a grant program for New Mexico small businesses hit hard by the coronavirus... abqjournal.com", "2020-07-26T13:55:19.000Z": "Asked if she'd work with the federal government on Operation Legend, NM Gov. Michelle Lujan Grisham says \"if we are cooperatively working to address violent crime and gun violence, absolutely. If we're gonna try to incentivize unrest, then that's something altogether different.\"", "2020-07-26T14:08:31.000Z": "Pressed by @gstephanopoulos whether it's time for further measures with COVID cases rising, NM Gov Lujan Grisham blasts the federal response: \"It is the worst abdication of a national response and responsibility to protect Americans I've ever seen.\" https:// abcn.ws/30NTfGT", "2020-07-27T15:32:33.000Z": "With less than 100 days until the #election , 100 New Mexicans share the reasons why they & I support @benraylujan for US Senate. 100 Days and 100 Reasons to Vote for Ben Ray! In honor of the 100-day mark from Election Day, we asked 100 New Mexicans to share why they're voting for Ben Ray. medium.com", "2020-07-24T18:10:12.000Z": "NMDOH seeks full and part-time Contact Tracers. Locations are available statewide. This is a temporary 180-day position. Posting end date: 07/25/2020. Apply online at the State Personnel Office website. http:// ow.ly/Qzgt50AGfDb", "2020-07-24T15:49:35.000Z": "This is a heartbreakingly hard decision. But I will always put the health and safety and students, families and educators first.\n\nWe broke a record for COVID-19 cases in New Mexico yesterday. We're just not ready. https:// abqjournal.com/1478892/lujan- grisham-to-address-school-plans.html ", "2020-07-23T21:22:06.000Z": "Join us for live updates here and follow #BackToSchoolNM", "2020-07-23T15:21:52.000Z": "I'll be joined by state officials this afternoon to give an update on New Mexico's #COVID19 efforts, safe learning environments for New Mexico students this fall and more.\n\nPlease tune in at http:// facebook.com/GovMLG . \n\nEn español: https:// youtube.com/channel/UCWVWb eIUHc2nl-SQgTMczNA ", "2020-07-23T13:14:52.000Z": "\"If you're headed toward the edge of the cliff, and you manage to stop the car, that's a positive thing. But you still have to back up.\"\n\nWe're not there yet, New Mexico. Please keep up the fight. \n\nYou know the virus won't back down. We can't either. NM virus growth may be reaching new plateau Officials encouraged as spread rate falls to 1.0 amid case surge abqjournal.com", "2020-07-22T19:00:26.000Z": "The @NewMexicoOAG and I will actively monitor for potential civil rights violations if and when the federal government sends officers to our state. We would welcome a genuine conversation about community public safety work and fighting violent crime. I hope that is the case.", "2020-07-22T15:12:24.000Z": "When you wear a mask, you show support and respect for others. You're doing your part. \n\nThank you. Thank you. Thank you.\n\nNew Mexico appreciates you. #MaskUpNM  #ProtectNM  #AllTogetherNM", "2020-07-21T17:19:05.000Z": "Strong economic plan by @joebiden with his 3rd pillar announcement: Free universal preschool Increased pay & benefits for early childhood instructors 150k additional healthcare workers in the neediest communities #BuildBackBetter Biden promises 3 million new jobs in caregiving, early education in 3rd pillar of his economic plan Former Vice President Joe Biden rolled out the third pillar of his \"Build Back Better\" economic policy in a speech in New Castle, Delaware, Tuesday. abcnews.go.com", "2020-07-21T14:47:40.000Z": "\"States that reopened early didn't fare better economically, and they fared markedly worse in terms of public health.\"\n\nIn New Mexico, we are: Fighting this virus with all we've got Providing meaningful relief to workers & families #AllTogetherNM Analysis | As Arizona struggles, neighboring New Mexico found a more cautious path to sustained... Compared to its aggressive neighbor in the desert Southwest, New Mexico pursued a slow-and-steady approach to containing the novel coronavirus. washingtonpost.com", "2020-07-21T14:32:34.000Z": "We're going to continue to be a leader in reducing harmful emissions. This was a Day One priority for me. It will never change. New Mexico rolls out draft rules to cut methane emissions SANTA FE, N.M. (AP) - New Mexico regulators on Monday rolled out proposed rules aimed at reducing methane and other emissions from the oil and gas industry. The draft rules released by the... apnews.com", "2020-07-20T21:06:52.000Z": "thanks for wearing a mask, mr. president. better late than never... #LeadershipMatters  #maskup Quote Tweet Donald J. Trump @realDonaldTrump We are United in our effort to defeat the Invisible China Virus, and many people say that it is Patriotic to wear a face mask when you can't socially distance. There is nobody more Patriotic than me, your favorite President!", "2020-07-20T18:38:56.000Z": "This virus is tough, but New Mexico is tougher! Thank you @LtGovMorales and to tribal leaders across the state who are doing everything in their power to protect New Mexico communities. #AllTogetherNM Quote Tweet Lt. Governor Howie Morales @LtGovMorales The #MescaleroApache Tribe is making strong efforts to keep residents & visitors safe during #COVID19 by conducting widespread testing, contact tracing, food distribution, quarantining the infected, prep for restarting schools, and other key support. #nmleg Show this thread", "2020-07-20T17:52:56.000Z": "Friendly Monday reminders!\n\nWear a mask! Avoid groups and close contact with others! Limit outings from home! Every one of us can help slow the spread, save lives and protect New Mexico's economy by making the right individual decisions. #ProtectNM  #MaskUp", "2020-07-20T15:00:46.000Z": ". @NMMagazine is recognizing local New Mexican heroes who are going above and beyond to serve their communities. Know someone who deserves recognition as a 2020 New Mexico Magazine True Hero? Nominate them here! #NewMexicoTrue  https:// bit.ly/32nf02Q", "2020-07-18T04:10:20.000Z": "John Lewis was a beacon of light & justice & good in a world in which they are too often lacking.\n\nHis perseverance was a foundation of hope for all those who came after him. Serving in Congress alongside him was one of the great honors of my career.\n\nRest in power. #JohnLewis", "2020-07-17T17:15:04.000Z": "New Mexicans are clear about the need for critical regulatory protections for our air, water & land.\n\nWhile the federal administration continues to look backward on climate, New Mexico will continue to develop responsible safeguards for methane mitigation. Oil and gas methane regulations upheld in federal court after New Mexico challenges repeal In the ruling, the Court pointed to a lack of analysis from the BLM in both statutory and environmental impacts to justify the repeal. currentargus.com", "2020-07-16T19:29:15.000Z": "Congratulations to the twenty recipients of filmmaking grants from the Senator John Pinto Memorial Fund!\n\nThe late senator was an ardent champion of Native American filmmakers - these grants will enable Indigenous artists to tell their own stories. 20 Native filmmakers receive Sen. John Pinto grants The $5,000 grants were awarded to film students and filmmakers living and working in New Mexico abqjournal.com", "2020-07-16T16:55:26.000Z": "In order for New Mexico's economy to rebound, we have to control the virus. There is no one without the other.\n\nSafely getting back to work and safely reopening schools depends on one thing: slowing the spread of COVID-19. #MaskUp  #ProtectNM Experts: Virus is likely to inflict prolonged economic pain on NM Doubts have been expressed that the state's oil and gas industry will recover quickly abqjournal.com", "2020-07-15T17:10:27.000Z": "Not only are young people NOT IMMUNE to COVID-19, they can easily contribute to the rapid spread of the virus throughout a community.\n\nWe are still in the midst of a deadly pandemic.\n\nIt is not safe to gather in groups - including hanging out with friends. New Mexico virus cases begin to skew younger Officials warn of long-term damage to COVID survivors abqjournal.com", "2020-07-14T15:00:47.000Z": "Explore the incredible Chaco Canyon from home in TRUE 360! Click and drag the screen for different views and angles throughout the video! #NewMexicoTrue  https:// bit.ly/37ftRgl", "2020-07-14T16:37:41.000Z": "COVID-19 can be spread by someone who doesn't yet know that they have the virus, even before they have any symptoms.\n\nIt could be spread by you. It could be spread by someone to you.\n\nWear a mask. Slow the spread. Save lives. #MaskUp  #ProtectNM If everyone wears a mask, 58% of Covid-19 deaths could be prevented by fall, study says A new projection from the University of Washington found that at the current rate, the U.S. could reach 100,000 Covid-19 infections a day by late September, topping out at nearly 168,000 projected... cnbc.com", "2020-07-13T20:05:46.000Z": "We count on them, now they're counting on you!  Get counted in the #2020Census so our teachers and classrooms have sufficient funding to provide a quality education! Get counted online ( https:// my2020census.gov ), by phone (844-330-2020), or by mail.", "2020-07-10T19:45:32.000Z": "Good news: @NMDWS has extended the eligibility period for state unemployment benefits.\n\nWhile it's critical that the federal govt. continue the funding for additional pandemic unemployment payments, we will keep doing everything we can to help New Mexicans in this time of need.", "2020-07-09T23:30:22.000Z": "The state is working with the NMAA and  I'm optimistic that we can get to a place where it's safe to have these student athletes return to the field this year.\n\nFirst things first: We've got to contain this virus and make sure our schools can safely reopen this fall. Quote Tweet NMAA @_NMAA", "2020-07-09T23:06:39.000Z": "#NMED is looking to fill nearly 30 positions ASAP to help our #OSHA team protect #NewMexico 's workforce from #COVID19 . For more info and to apply, visit https:// spo.state.nm.us and join us and @NMDWS for a virtual info meeting at 2 p.m. Fri. Register at https:// us02web.zoom.us/webinar/regist er/WN_O60jRTvNSHewloqXto0-Sw ", "2020-07-09T14:55:10.000Z": "The president's administration has abandoned states nationwide to fend for themselves amid the COVID-19 pandemic - now it seems he will do the same for students and educators and families across the country, yet another example of his punitive approach. Trump Threatens to Cut Funding if Schools Do Not Fully Reopen Disregarding the advice of his own health experts, President Trump also attacked the C.D.C.'s reopening guidelines as onerous and expensive. nytimes.com", "2020-07-09T14:10:31.000Z": "I'll be joined by state officials this afternoon to give an update on New Mexico's #COVID19 efforts and the public health emergency order.\n\nTune in to http:// facebook.com/GovMLG at 4 PM - you don't have to have an account to watch. #MaskUp  #ProtectNM", "2020-07-08T17:40:53.000Z": "The federal government cannot abandon the people of New Mexico and our country.\n\nCOVID-19 hasn't gone anywhere. Every state needs a United States government that will help us in this fight. Quote Tweet NGA @NatlGovsAssoc #WeTheStates are calling on @WhiteHouse to formally renew the Public Health Emergency declaration for #COVID19 , which otherwise would expire July 25. States need every tool available to combat this deadly #pandemic . https:// nga.org/news/press-rel eases/governors-call-on-the-administration-to-renew-the-public-health-emergency/ ", "2020-07-08T17:07:38.000Z": "New Mexico continues to step up to help small businesses and workers survive the economic fallout of the COVID-19 pandemic.\n\nWe will get through this together. #AllTogetherNM Quote Tweet KOB 4 @KOB4 NEW: @GovMLG has signed the Small Business Recovery Act of 2020. Nearly half a billion dollars will be made available to help New Mexico small businesses recover financially from COVID-19. https:// kob.com/albuquerque-ne ws/nm-small-businesses-to-receive-400m-in-covid-19-relief-loans-/5785104/#.XwTPqbTF7Hg.twitter ", "2020-07-08T15:10:15.000Z": "I will fight for New Mexico small businesses and their recovery every single day.\n\nThe Small Business Recovery Act of 2020 is the first step, putting our state's wealth to work in getting them back on their feet with $400 million for NM small businesses. Governor signs small-business recovery bill The Small Business Recovery Act of 2020 draws $400 million for businesses and $50 million for local governments from the state's $5 billion Severance Tax Permanent Fund. santafenewmexican.com", "2020-07-07T19:25:36.000Z": "Great news for New Mexico children and families from @NMHSD : $67 million in Pandemic EBT cards will be issued to households with children this week, keeping kids fed across the state. Quote Tweet NM Human Services @NMHSD $67 million in Pandemic EBT Cards will issued this week. \nThe benefits will be issued on Pandemic Electronic Benefit Transfer cards in the name of the oldest child in each household and mailed out this week. More information at: https:// bit.ly/2ADm28f  #HSD  #ISD  #PEBT", "2020-07-07T15:45:03.000Z": "Getting tested is important. Then we can identify people who carry the virus - even if you don't have symptoms.\n\nThe sooner positive cases are identified and isolated at home, the better we'll do as a state in slowing the spread of COVID-19.\n\nGet tested: https:// cvprovider.nmhealth.org/directory.html", "2020-07-06T19:04:42.000Z": "Secretary Stewart and @NMPED are committed to protecting the safety of students, families, educators and school staff amidst the ongoing pandemic.\n\nSafely reopening schools requires every New Mexican to do their part to slow the spread of COVID-19. #MaskUp OPINION | Full school schedule is goal; phased approach needed OPINION | We face a public health crisis that has fundamentally changed our lives and our communities in unpre ... abqjournal.com", "2020-07-04T17:53:33.000Z": "COVID-19 doesn't take a holiday. Cases continue to rise across New Mexico - don't let this weekend make it worse.\n\nPlease celebrate a happy and safe Fourth of July at home, avoiding groups, and wearing a mask if you must go out in public. #MaskUp  #ProtectNM", "2020-07-02T22:45:23.000Z": "Young New Mexicans - you are NOT IMMUNE.\n\n60% of COVID-19 cases reported since Sunday are New Mexicans under the age of 40.\n\nAct right. Do not gather in groups. Wear a mask. Quote Tweet Michelle Lujan Grisham @GovMLG Today's #COVID19 update is not good news:\n\n- 248 new COVID-19 cases, totaling 12,520 cases statewide\n\n- Three additional deaths, bringing the total to 503 deaths statewide\n\n- 127 individuals currently hospitalized with COVID-19 statewide\n\nMore info here: https:// bit.ly/3eZV2yA Show this thread", "2020-07-02T19:03:28.000Z": "Yesterday's update marked a grim milestone: 500 New Mexicans have now died because of this terrible virus.\n\nPlease take responsibility to slow the spread of COVID-19: wear a face mask, avoid groups at all costs, and don't patron businesses that aren't using COVID-safe practices.", "2020-07-02T17:20:57.000Z": "COVID-19 cases are skyrocketing nationwide & in states directly surrounding us.\n\nAny further reopenings in New Mexico remain on hold.\n\nAll restrictions and occupancy limits remain in place.\n\nMandatory face-coverings in public will be aggressively enforced. New Mexico governor issues new public health order ahead of holiday weekend As the state prepares for the Fourth of July weekend, out-of-state visitors will now be required to quarantine for 14 days upon arrival. Police also will begin fining people for santafenewmexican.com", "2020-07-02T15:33:57.000Z": "It's true New Mexico is testing more. But that's not why cases are rising.\n\nIf someone tells you \"more tests = more cases,\" they just want to minimize the risk of this contagious and lethal virus. It's not accurate.\n\nMore info", "2020-07-01T19:29:14.000Z": "Special Supreme Court rules are still in place that allow you to stay in your home during #COVID19 , even if you cannot afford rent. More info about those rules & what to do if you if your landlord tries to evict you available in Spanish & Arabic: http:// nmpovertylaw.org/housing-and-ut ilities/ ", "2020-07-01T17:50:03.000Z": "While preserving critical state reserves, yesterday I vetoed budget cuts to education, restoring critical funding to public school support, culturally & linguistically relevant instructional materials, and the Opportunity Scholarship, among other areas. Governor signs budget solvency fix, vetoes some cuts Lujan Grisham spares public education programs, scholarships abqjournal.com", "2020-07-01T14:25:19.000Z": "This afternoon I will give an update on New Mexico's #COVID19 efforts and the public health emergency order.\n\nTune in to http:// facebook.com/GovMLG at 3:30 PM - you don't have to have an account to watch. #MaskUp  #ProtectNM", "2020-06-30T23:11:55.000Z": "Important news from @NMHSD regarding additional SNAP funds extended through the month of July: Quote Tweet NM Human Services @NMHSD New Mexico households receiving Supplemental Nutrition Assistance Program (SNAP) benefits will again receive the maximum amount for their household size for the month of July. More information at: https:// bit.ly/2ZsbQYm", "2020-06-30T19:35:36.000Z": "I'm deeply saddened to hear of the death of Rudolfo Anaya, one of New Mexico's greatest artists.\n\nWhile his passing is a great loss for New Mexico, his life & his work was an incredible gift, not just to New Mexico but to the world. His words & stories will be treasured forever.", "2020-06-30T16:25:27.000Z": "I was glad to sign HB 6 into law yesterday to support New Mexico taxpayers and businesses.\n\nThe financial pain caused by #COVID19 is real, and this legislation will help New Mexicans who through no fault of their own were unable to pay their taxes on time. Lujan Grisham signs tax relief bill into law House Bill 6 waives interest and penalties on unpaid levies abqjournal.com", "2020-06-30T15:40:09.000Z": "As #PrideMonth draws to a close, it's important to me that every LGBTQ+ New Mexican knows that here in New Mexico, they are valued and protected.\n\nMy administration will always work to welcome and support those of all sexual orientations and gender identities.", "2020-06-29T17:54:05.000Z": "Thank you @SFCCNM and @WCKitchen for your incredible work serving 50,000 meals to New Mexicans in need! #AllTogetherNM Quote Tweet robert egger @robertegger 50,000th meal served today as we wind down the @WCKitchen  @SFCCNM kitchen partnership. The best part, students got credit hours, we sourced local & we focused on tradional NM meals. It was an honor to serve the community & work with such pros!!!!!", "2020-06-29T15:40:18.000Z": "Access to abortion is access to health care. Period. Quote Tweet The Washington Post @washingtonpost Breaking: Supreme Court strikes down restrictive Louisiana abortion law that would have closed clinics.\n\nChief Justice John Roberts joined the court's liberal justices in the ruling. https:// wapo.st/3eK3guv", "2020-06-28T21:05:07.000Z": "Face coverings are critical to slowing the spread of COVID-19 and living in a COVID-positive world.\n\nSo many New Mexicans submitted incredible pictures of their masks for New Mexico's Mask Madness competition.\n\nYour votes are in, and the winner is: Andrew Garmon of Santa Fe!", "2020-06-28T18:45:47.000Z": "New Mexico: face masks are still required in any and all public settings.\n\nWearing a mask is not a political statement - it's proof that you value the life & health of your loved ones and your community.\n\nFace coverings significantly reduce the spread of COVID-19 - do your part.", "2020-06-27T17:04:24.000Z": "I know New Mexicans are disappointed that the state fair is canceled - I am too. We didn't ask for this virus, but we've got it, and we've got to beat it - and that means avoiding large groups and events. I'm confident that the state fair will be back next year, better than ever.", "2020-06-27T14:13:06.000Z": "This Tuesday join NMPED and @LtGovMorales for a virtual Educator Town Hall, moderated by New Mexico's 2020 Teacher of the Year @manditorrez . Questions may be submitted in advance when you register. Please help us spread the word: https:// bit.ly/EducatorTownHa ll   #BackToSchoolNM", "2020-06-26T16:30:27.000Z": "New Mexico's COVID-19 transmission rate is rising again.\n\nThe states around us are seeing record numbers of daily new cases.\n\nYour health and safety, and that of your community, is the number one priority. Lujan Grisham delays phase 2 of New Mexico reopening Officials will wait at least an additional week before making changes to public health orders originally scheduled for July 1. santafenewmexican.com", "2020-06-26T16:40:08.000Z": "Whether it's young volunteers calling seniors to help keep them connected or helping children learn to read virtually, New Mexicans are stepping up to support one another.  Volunteering is a great way to make a difference. Find local opportunities at  https:// volunteermatch.org/covid19", "2020-06-25T23:35:23.000Z": "Anyone traveling into New Mexico by car should absolutely self-isolate for 14 days upon arrival.\n\nCOVID-19 spread due to travel continues to remain a problem. Do not place yourself or your community at risk. Do not travel unless absolutely essential. Quote Tweet Busy Being @Busy_Being_ Can anyone give me info on the 14-day travel quarantine for out-of-state people who drive (not fly) to NM? I want to safely & correctly advice folks. Help please @GovMLG  @NMDOH  @DailyLobo  @RepDebHaaland  @NMtourism  @MayorKeller  @cityofabq or anyone else? #WearAMask  Show this thread", "2020-06-25T23:30:07.000Z": "COVID-19 has not gone anywhere.\n\nAll around us, cases are increasing. As of Wednesday, 26 U.S. states are seeing a higher rate of new cases compared to last week.\n\nWe are still in the throws of the pandemic.", "2020-06-25T15:19:09.000Z": "La Guía de Reingreso de NMPED proporciona consideraciones, recomendaciones, y mejores prácticas para fomentar un año escolar seguro y exitoso. Aquí pueden revisar los requisitos minimos: https:// webnew.ped.state.nm.us/wp-content/upl oads/2020/06/20NMPED_ReentryRequirements_1Page_SPANISH.pdf ", "2020-06-25T15:32:10.000Z": "The Reentry Guidance provides considerations, recommendations, and best practices to encourage a safe and successful school year. #BackToSchoolNM You can review a summary of the requirements here: https:// webnew.ped.state.nm.us/wp-content/upl oads/2020/06/20NMPED_ReentryRequirements_1Page.pdf ", "2020-06-25T15:10:02.000Z": "I'll be joined by state officials this afternoon to give an update on New Mexico's #COVID19 efforts and the public health emergency order.\n\nTune in to http:// facebook.com/GovMLG at 3 PM - you don't have to have an account to watch. #MaskUp  #AllTogetherNM", "2020-06-24T15:46:51.000Z": "In one week, @NewMexicoECECD marks its official launch. Today, Secretary @Egroginsky has an op-ed in the @thenewmexican about what this means for children and families across our state. Early childhood department is ready to launch New Mexico will join just three other states that have created Cabinet-level early childhood departments. santafenewmexican.com", "2020-06-24T16:50:57.000Z": "Yesterday @NMPED announced their School Reentry Plan for New Mexico students & educators, beginning with a hybrid model ensuring distancing & safety for students, families & educators.\n\nSee the full plan here: http:// bit.ly/SchoolReentryNM", "2020-06-24T15:39:57.000Z": "The work of rebuilding our state economy has only begun, but we will, I have no doubt, construct a more robust and inclusive economy than ever before as we continue to fight the COVID-19 pandemic with everything we've got. #AllTogetherNM Historic session over, with 7 bills passed Measures address budget, police cameras, small-business loans abqjournal.com", "2020-06-23T18:26:12.000Z": "You're Welcome Quote Tweet New Mexico GOP @NewMexicoGOP New Mexico is beating COVID-19, it's time to fully reopen our state. https:// santafenewmexican.com/news/coronavir us/fewer-new-mexicans-are-being-hospitalized-for-covid-19/article_3a830c70-b0b0-11ea-bf4b-5310434e5cbf.html ", "2020-06-23T16:28:49.000Z": "I am absolutely heartbroken and disgusted by this racist attack. I spoke to Mr. Singh this morning and let him know that our community is with him. We will not stand for such hatred in New Mexico. Downtown Restaurant Vandalized with White Supremacist Messages sfreporter.com", "2020-06-22T22:27:44.000Z": "Senate Bill 8, mandating body cameras and a big step toward ensuring law enforcement accountability, has passed the Legislature. My thanks to the lawmakers who recognize we must keep up this effort and ensure a safe and just New Mexico for all. #nmpol  #nmleg", "2020-06-22T19:55:09.000Z": "New Mexico can avoid this fate. We don't have to be like these other states. But only you can decide that.\n\nOnly you can make the decision to protect our communities and ultimately save lives.\n\nAvoid groups. Get tested if you've been around others. Wear a mask. #ProtectNM Quote Tweet Reuters @Reuters As coronavirus infections continue to surge in Texas, Florida and Arizona, former Food and Drug Administration Commissioner Scott Gottlieb said these states could begin to see cases rise exponentially this coming week", "2020-06-22T15:36:09.000Z": "With most @NMStateParks open for day-use, we're excited to welcome visitors back to our beautiful parks. However, recreating responsibly keeps our parks safe and protects them for future generations. Make sure to keep our outdoor spaces clean: Visit, but don't trash state parks In the past few months, New Mexicans have adjusted to a new world. In order to slow the spread of COVID-19, on March 15 the governor directed all state parks, santafenewmexican.com", "2020-06-22T15:30:18.000Z": "New Mexico: the pandemic has not let up.\n\nYou are still required to wear a mask or face covering in public.\n\nWearing a mask significantly reduces the spread of COVID-19 - do your part to protect your community & ensure that others are protecting your health. #MaskUp  #ProtectNM", "2020-06-21T18:00:20.000Z": "Wishing a very safe and happy Father's Day to the first Manny and to every dad and father figure today!\n\nWhile we may not be able to hug our dads like we're used to this year, the love and appreciation we have for our fathers and those who fill that role never changes.", "2020-06-19T19:45:15.000Z": "Join us tomorrow for a statewide virtual #Juneteenth celebration!\n\nThe New Mexico Office of African American Affairs is proud to join many wonderful partners in sponsoring this event celebrating New Mexico's Black community.\n\nTune in live at noon - http:// youtu.be/F01gVXL5Ecw", "2020-06-19T18:22:11.000Z": "NOW: \"America's problem with race has deep roots. This year's #Juneteenth celebration comes at a moment of deep reckoning demanding both individuals and institutions commit themselves to reject racisim in all its forms.\" - @RepSheryl  #NMLeg  #NMPol", "2020-06-19T16:44:19.000Z": "This #JUNETEENTH2020 marks 155 years since slavery was fully abolished in the U.S. As we celebrate & reflect today, remember the fight for true freedom & justice is far from over. Let us all open our eyes, ears, & hearts to one another & commit to the promise of equality for ALL!", "2020-06-19T00:02:18.000Z": "Today I announced that I've ordered all state flags to fly at half staff from sundown today through sundown Saturday in observance of Juneteenth. Governor: New Mexico Flags To Be Lowered To Commemorate Juneteenth FROM THE OFFICE OF THE GOVERNOR State observes anniversary of slavery's ultimate end, honors victims of racism and hate Gov. Michelle Lujan Grisham has ordered state flags to half-staff in observan losalamosreporter.com", "2020-06-18T20:15:12.000Z": "- Watch online at http:// nmlegis.gov - Submit public comment on the \"What's Happening\" tab of http:// nmlegis.gov - go to committee agendas, which have instructions for how to participate\n\n- Follow along by supporting local New Mexico journalism", "2020-06-18T17:49:20.000Z": "In order to: Protect Dreamers Pass American Dream and Promise Act We must elect Joe Biden #HereToStay  #HomeIsHere Supreme Court blocks Trump from ending DACA in big win for Dreamers Chief Justice John Roberts was the swing vote in the 5-4 decision, dealing a big legal defeat to President Trump on the issue of immigration. nbcnews.com", "2020-06-18T15:42:08.000Z": "DACA recipients are our neighbors, our coworkers, and our friends, working to build lives for themselves in the only country they have ever known.\n\nThey are an essential part of the very fabric of our community, and I will never stop fighting for them. #HereToStay  #HomeIsHere Quote Tweet CNN @CNN The Supreme Court blocked the Trump administration's attempt to end DACA, an Obama-era program that protects hundreds of thousands of immigrants brought to the US as children from deportation https:// cnn.it/3efpoN0", "2020-06-17T20:40:12.000Z": "New Mexico wildfire season is well underway. Approximately 75% of New Mexico is currently abnormally dry, and we must take every precaution.\n\nI am strongly urging local governments to be fire-safe amid droughts this summer. Gov. Lujan Grisham urges cities to consider banning sale of fireworks Citing worsening drought conditions, Gov. Michelle Lujan Grisham signed an executive order Tuesday, urging cities to consider banning the retail sale of fireworks. kob.com", "2020-06-17T18:45:03.000Z": "Tomorrow the state Legislature will be called into a special session to address the state budget hole created by the economic effects of the COVID-19 pandemic.\n\nI've also asked the Legislature to take up:\n\nBusiness & tax relief\nPublic safety reform\nElection changes\n\nMore info", "2020-06-17T16:01:05.000Z": "Attention New Mexico small businesses!\n\nThere's still time to apply for the @SBAgov Paycheck Protection Program, which offers a forgivable loan to help your business through this economic crisis. Over 20,000 New Mexico businesses have already received relief through this program.", "2020-06-16T04:35:35.000Z": "My statement on the \"militia\" and violence in Albuquerque tonight:", "2020-06-15T18:20:13.000Z": "New Mexico's multiculturalism is its strength. Understanding our complicated history - and acknowledging the imbalanced power structures within it - is a process, and this is a step in the right direction. County Takes Down Oñate Monument On Monday afternoon in Alcalde, atop the pedestal where hours before a monument to the Spanish colonizer Don Juan de Oñate had stood, Than Tsídéh, a man from Dixon and riograndesun.com", "2020-06-15T16:50:10.000Z": "Wonderful news today from the U.S. Supreme Court, affirming what we all already know to be true: discrimination against anyone for their sexual orientation or gender identity is unacceptable & a violation of basic human rights & dignity.\n\nNew Mexico stands up for LGBTQ+ rights. Quote Tweet NPR @NPR BREAKING: The Supreme Court has delivered a historic victory for LGBTQ people - ruling that the federal law that bars sex discrimination in employment does apply to LGBTQ employees. Show this thread", "2020-06-15T14:30:06.000Z": "The Advisory Council for Racial Justice will help steer my office's conversation on justice & structural reform in New Mexico.\n\nAll those interested in serving on the Council & providing ideas for consideration are welcome.\n\nPlease apply here by June 19: http:// bit.ly/3eYGcYF", "2020-06-15T15:43:37.000Z": "Testing for COVID-19 is available to every New Mexican regardless of whether you have insurance or not. It is free, quick, and easy. Find more information at https:// cv.nmhealth.org", "2020-06-14T20:34:21.000Z": "This Census Week of Action is coming up! The Census is so important, especially for New Mexico. Be sure to fill out the #2020Census so our communities have the resources we need in the next decade! #ShapeYourFuture  https:// my2020census.gov", "2020-06-13T02:37:54.000Z": "Tonight we saw that Democrats up-and-down the ballot are committed to working together and keeping our state blue. Be a part of this movement by signing up to volunteer with Team DPNM https:// secure.ngpvan.com/wojwBJva0UuDNF xUChLalQ2 ", "2020-06-12T19:53:55.000Z": "Virtual Unity Rally Tonight at 6p!\n\nJoin me, @NMDEMS , and other Democratic leaders from across New Mexico as we discuss voting, our shared principles, and how to get involved in the most consequential election this November.\n \nRSVP > https:// facebook.com/events/8806897 82442165/ ", "2020-06-12T15:30:14.000Z": "ICYMI: Good news, New Mexico! Breweries will be able to operate at 50% of capacity on the patio as of today & may begin indoor service on Monday.\n\nCOVID-safe practices MUST be abided by in order to prevent the spread of the virus & keep New Mexicans safe. Good news on tap: NM breweries can reopen Governor concerned as coronavirus cases climb in Texas, Arizona abqjournal.com", "2020-06-11T18:16:41.000Z": "Press conference with COVID-19 updates from @GovMLG will have Spanish language interpretation today (June 11) at 3:00 PM. Check it out here: http:// youtube.com/c/GovMLG  #nmpol  #nmleg", "2020-06-11T16:15:15.000Z": "I'll be joined by state officials this afternoon to give an update on New Mexico's #COVID19 efforts and the public health order.\n\nTune in to http:// facebook.com/GovMLG at 3 PM - you don't have to have an account to watch. #MaskUp  #ProtectNM", "2020-06-11T15:54:48.000Z": "If you work at a restaurant, grocery store, farmer's market or food manufacturing facility, you can get tested for #COVID19 for free during specially designated times at @NMDOH offices around NM. Getting tested protects your coworkers and your customers! Make an appt today.", "2020-06-11T16:43:32.000Z": "Friday at 6p join me, @NMDEMS , and other Democratic leaders from across New Mexico for a virtual Unity Rally. We'll talk voting, our shared principles, and how to get involved in the most consequential election this November.   \n\nRSVP https:// facebook.com/events/8806897 82442165/ ", "2020-06-10T15:41:17.000Z": "Become a Post-Primary Elector and help choose who represents New Mexico at the Democratic National Convention this August! The deadline to apply is: June 11, so don't wait!\nVisit https:// nmdemocrats.org/delegate-selec tion/  for more information", "2020-06-09T17:29:35.000Z": "A reminder that wearing a face mask can: Slow the spread of the coronavirus. Help you avoid getting sick. Protect those you encounter when you must leave home.\n\nHere are some tips for wearing your mask properly  https:// bit.ly/2WFjpti", "2020-06-09T12:03:04.000Z": "Gov. Michelle Lujan Grisham discusses getting out in front of the pandemic, police brutality protests, and dealing with the Trump administration https:// rol.st/30n4jw2", "2020-06-09T16:02:12.000Z": "Now more than ever, local businesses need our support. Visit Buy NM Local to find a business you can support near you to order food, retail or anything else you might need for pickup, delivery or servicing! #buylocal  #shopNM  #AllTogetherNM Home | Buy NM Local A hub for shoppers looking to buy gift cards and shop online with New Mexican businesses during the Covid-19 panedmic. buynmlocal.com", "2020-06-08T16:18:28.000Z": "Thank you to Cathryn McGill, founder and director of the New Mexico Black Leadership Council, for these suggestions as to how New Mexicans can support their black neighbors and make this a movement, not a moment. The Executive's Desk: NM: Make this a movement, not a moment I met a young man a few years ago who impressed me so much with his determination and his entreprene ... abqjournal.com", "2020-06-06T19:43:26.000Z": "Thank you @bcom_nm ! #MaskUp  #ProtectNM Quote Tweet BCOM @bcom_nm The Burrell College of Osteopathic Medicine is #maskingup ! We stand with @GovMLG , the @NMDOH and the @NMHSD in wearing a mask or face covering to help slow the spread of #COVID19 and keep New Mexicans safe. #MaskUp  #ProtectNM", "2020-06-06T17:43:08.000Z": "New Mexicans step up. Black ABQ business owners are seeing an outpouring of support Lists of black-owned businesses circulating in the city have given them exposure and abqjournal.com", "2020-06-05T16:40:20.000Z": "We must seize this moment to have an essential discussion about racism and inequality and our inability to reckon with institutional racism, to acknowledge that those divides have never been brought together. Governor appoints leaders to Council for Racial Justice Move comes after killing of unarmed black man spurred protests against police brutality around world. santafenewmexican.com", "2020-06-04T23:40:20.000Z": "Today I was humbled to have the opportunity to initiate an important & overdue conversation about racism in our state. I am committed to appointing a Council for Racial Justice to hold the state accountable, and to centering justice & equity in my administration going forward.", "2020-06-04T16:10:27.000Z": "I'll be joined by black community leaders today for a live conversation and press conference on racism and injustice in New Mexico and across the country.\n\nTune in to http:// facebook.com/GovMLG at 3 PM this afternoon. #BlackLivesMatter", "2020-06-03T16:50:34.000Z": "Due to the unprecedented number absentee votes, the following counties will have delays reporting results & will give an update later today: Bernalillo, Doña Ana, McKinley, Santa Fe, Rio Arriba, Taos, Valencia.\n\nUnofficial results: https:// electionresults.sos.state.nm.us  #nmpol  #TrustedInfo2020", "2020-06-02T23:05:51.000Z": "It's been a long week. I know it's only Tuesday. The protests across our country are a reminder of the work we must do in addressing the systemic racism and injustice of our society - and in rebuilding from this ongoing pandemic. We have a long way to go - together.", "2020-06-02T19:46:27.000Z": "332,721 New Mexicans have voted in the 2020 Primary Election as of 1pm today! If you still have your absentee ballot, be sure to drop it off at a polling location before polls close at 7pm. County Clerk contact info here: https:// sos.state.nm.us/voting-and-ele ctions/voter-information/county-clerk-information/   #nmpol  #TrustedInfo2020", "2020-06-02T18:10:15.000Z": "This is a moment for listening, coming together & committing to the process of healing the wounds of racism & injustice in this country. Everyone has a right to protest peacefully - everyone. I am absolutely committed to working toward meaningful change. Gov.: Call for show of force 'tone deaf' Lujan Grisham says lack of injuries shows how far NM has come abqjournal.com", "2020-06-02T15:42:50.000Z": "It's finally here! Polls open until 7pm. Still have your absentee ballot? Drop it off at a polling location before polls close. Contact info for county clerks, track the status of your ballot, see election results (after 7pm), and more: https:// sos.state.nm.us  #nmpol  #BeAVoter", "2020-06-02T15:32:11.000Z": "To find your polling location visit http:// nmvote.org", "2020-06-02T15:28:00.000Z": "It's election day New Mexico! \nThe polls are open until 7p. If you're going to vote in person, be sure to #maskup . Your safety & health is a priority. You can still return your absentee ballot to any voting location. Make your voice heard! #NMPrimary  #BeTheVote", "2020-06-01T19:38:58.000Z": "I issued the following statement today regarding Albuquerque's exemplary peaceful protest last night, the small group who chose to damage local businesses, and the president's dangerous and inflammatory comments on a call with myself and other governors this morning:", "2020-06-01T15:16:00.000Z": "COVID-19 UPDATE Today a new public health order goes into effect, continuing New Mexico's Phase One reopening progress.\n\nFind the full text here: https:// bit.ly/303dZvP See COVID-safe practices for businesses, employees and customers here: https:// adobe.ly/3grPM7W", "2020-06-01T14:30:00.000Z": "NM #StateParks are opening more parks today for day use only: Hyde Memorial, Rio Grande Nature Center, Navajo Lake, Elephant Butte Lake, and Pecos Canyon State Parks. #RecreateResponsibly  #NoCampfires  #RespectPublicLands", "2020-05-31T17:50:11.000Z": "These are difficult times for many of us, including for our mental health.\n\nPlease know that you are not alone - here are a number of resources available to help and support you\n\nIf you are in crisis, call 1-855-NMCRISIS (1-855-662-7474). NM Crisis Line - New Mexico Crisis and Access Line nmcrisisline.com", "2020-05-30T18:45:24.000Z": "I was glad to have the opportunity earlier this week to thank volunteers with @NewMexicoAging & join them to pack food boxes for New Mexico seniors and disabled adults. Thank you to the Church of Jesus Christ of Latter-day Saints for the volunteers & generous donation of food!", "2020-05-29T16:20:50.000Z": "COVID-19 UPDATE: Yesterday I announced a new public health order, effective June 1, continuing New Mexico's Phase One reopening progress.\n\nFind more info here: https:// bit.ly/2yKoN6B See COVID-safe practices for businesses, employees and customers here: https:// adobe.ly/3grPM7W", "2020-05-28T20:20:15.000Z": "Mayor Tim Keller and @cabq know the importance of wearing a mask or face covering to protect your community and slow the spread of COVID-19.\n\nDo your part to respect and protect your fellow New Mexicans by wearing a mask when in public. Thanks @MayorKeller ! #MaskUp  #ProtectNM", "2020-05-28T18:00:02.000Z": "I'll be joined by state officials this afternoon to give an update on New Mexico's #COVID19 efforts and the public health emergency order.\n\nTune in to http:// facebook.com/GovMLG at 3 PM - you don't have to have an account to watch. #MaskUp  #AllTogetherNM", "2020-05-28T16:08:48.000Z": "New Mexico Mask Madness voting is now open!\n\nYou can cast a vote for your favorite mask once a day. Seeding-round voting will be open through Wednesday, June 3 - the top vote-getters will be seeded into brackets.\n\nCheck out these amazing masks - vote here: https:// woobox.com/frns4p", "2020-05-28T15:33:55.000Z": "New Mexico today is the last day to request your absentee ballot. Avoid waiting in long lines on #election day. Stay safe, vote absentee! \nRequest your absentee ballot online today - https:// portal.sos.state.nm.us/OVR/WebPages/A bsenteeApplication.aspx ", "2020-05-27T17:47:24.000Z": "Several #NewMexico agencies & businesses along with countless #volunteers help deliver much needed #food and water to the #NavajoNation . #ThankYou to all those who gave their time and donations to #Help those in need. Read the details here: https:// facebook.com/operationbanda nanewmexico/videos/3234808939870693/ ", "2020-05-27T18:27:58.000Z": "Dottie Montoya was a true pillar of the Northern NM community. A dedicated & tireless health care provider, she was the godmother of New Mexico's school-based health centers and a champion for reproductive rights. She truly left New Mexico a better place. 'Legendary' NM nurse Dorotea Montoya dies at 86 Dorotea Montoya, a pioneering pediatric nurse practitioner who was the mother of Espa& ... abqjournal.com", "2020-05-27T16:10:39.000Z": "Beginning today, restaurants in most of the state can provide limited outdoor or patio services.\n\nOur priority throughout this public health crisis has been and will continue to be the safety and health and well-being of New Mexicans. Lujan Grisham reopens dining in outdoor seating areas in most of state Indoor restaurant dining remains on target to reopen Monday, the Governor's Office said in a news release. santafenewmexican.com", "2020-05-26T22:40:47.000Z": "COVID-19 UPDATE We continue to see progress in our fight against #COVID19 , which is a credit to New Mexicans. \n\nBeginning tomorrow, restaurants in most of the state will be allowed to provide limited outdoor or patio services at up to 50% of their outdoor occupancy level.", "2020-05-26T15:25:29.000Z": "Time's running out to request/return your absentee ballot for the June 2 Primary!\n\nRequest your absentee ballot: https:// portal.sos.state.nm.us/OVR/WebPages/A bsenteeApplication.aspx  Absentee voting FAQ: https:// sos.state.nm.us/voting-and-ele ctions/voting-faqs/absentee-voting-by-mail/  Contact info for County Clerks: https:// sos.state.nm.us/voting-and-ele ctions/voter-information/county-clerk-information/   #nmpol  #BeAVoter  #TrustedInfo2020", "2020-05-26T16:04:43.000Z": "Why is contact tracing important? It ensures that we can identify potential outbreaks and limit the spread of #COVID19 .\n\nContact tracing helps keep New Mexicans safe and saves lives.\n\nApply today to join the @NMDOH team: http:// bit.ly/2TwjIWO Quote Tweet Michelle Lujan Grisham @GovMLG New Mexico has been conducting contact tracing since #COVID19 first arrived in the state, ahead of the national curve, and we're continuing to expand that effort. @NMDOH is filling hundreds of new contact tracer positions as the fight against COVID-19 moves into the next phase. Show this thread", "2020-05-25T15:40:37.000Z": "Today, we pause to honor the men and women who courageously gave their lives in service for our nation. May we never forget the sacrifices they made for us. \n\nForever our heroes. #MemorialDay", "2020-05-23T19:49:39.000Z": "A message from Dr. David Scrase to southern New Mexico:\n\nWe are seeing an alarming increase in #COVID19 cases in the southern part of the state, particularly along the TX/NM border.\n\nEspecially this holiday weekend, please slow the spread - stay home and don't gather with others.", "2020-05-22T21:55:21.000Z": "In honor of & in mourning for the New Mexico victims of #COVID19 & their families, and in recognition of Memorial Day & the military personnel who gave their lives protecting our nation, I've ordered all state flags to fly at half staff from sundown today through sundown Monday.", "2020-05-22T16:22:23.000Z": "Like so many New Mexicans, Sacheen Smith has truly gone above and beyond to support others in need during the #COVID19 public health crisis.\n\nSacheen, thank you for the incredible work you're doing to care for your community during these trying times. Local woman, who has blindness, makes masks for Navajo Nation Her uncle and aunt live on the reservation, and are positive for COVID-19 koat.com", "2020-05-22T15:50:08.000Z": "If you enjoy one of New Mexico's beautiful state parks this holiday weekend, remember that social distancing must continue - don't gather in groups. Be safe, and don't let #COVID19 while you enjoy your weekend. Quote Tweet EMNRD @EmnrdNM Great tips for a socially distant Memorial Day. Remember some @NMStateParks are currently open for day-use. Make sure to check our website before you go and follow all safety protocols: https:// lcsun-news.com/story/entertai nment/2020/05/21/new-mexico-coronavirus-covid-19-memorial-day-2020/5225210002/ ", "2020-05-21T18:15:03.000Z": "Mayor Mike Morris of Clovis understands the risk of spreading #COVID19 to others, even if you don't have any symptoms.\n\nWearing a face covering protects others, and others wearing a face covering protects you.\n\nWe're all in this together - so #MaskUp to slow the spread.", "2020-05-21T20:18:17.000Z": "Absentee ballot complete! I hope everyone will join me in voting #absentee for the upcoming New Mexico election on June 2. It's the safest & easiest way to make your voice heard while keeping yourself & others safe. Still time to request an absentee ballot http:// nmvote.org", "2020-05-21T15:50:31.000Z": "COVID-safe practices MUST be in place in order for any business or house of worship to operate.\n\nThe Economic Recovery Council and @NMDOH have developed specific COVID-safe practices (CSPs) for a wide variety of employers - see your required CSPs here: https:// adobe.ly/2AzwdKs", "2020-05-20T22:40:50.000Z": "Updates from today's press conference on #COVID19 in New Mexico:\n\n- 134 new cases of COVID-19 announced  today, currently totaling 6,317 positive tests statewide\n\n- 7 additional COVID-19 deaths, bringing the total to 283\n\n- 206 individuals currently hospitalized #MaskUp", "2020-05-20T19:05:20.000Z": "Mayor Sam Cobb of Hobbs understands that the sooner we slow the spread of COVID-19, the sooner more New Mexicans can get back to work - and that wearing face coverings are key to slowing the spread.\n\nMask up. Slow the spread. Save lives. #AllTogetherNM", "2020-05-20T17:20:02.000Z": "I'll be joined by state officials this afternoon to give an update on New Mexico's #COVID19 efforts and the status of the public health emergency order.\n\nTune in to http:// facebook.com/GovMLG at 4 PM - you don't have to have an account to watch. #StayHomeSaveLives  #AllTogetherNM", "2020-05-19T22:45:30.000Z": "Today's #COVID19 update:\n\n- 104 new cases, totaling 6,192 positive tests statewide\n\n- 6 new COVID-19 deaths, bringing the total to 276\n\n- 204 individuals currently hospitalized\n\nWear a mask. Slow the spread. Save lives. #AllTogetherNM More info here: https:// bit.ly/2zdeLLA", "2020-05-19T18:40:43.000Z": "New Mexico: testing for #COVID19 is available statewide.\n\nThe more New Mexicans get tested, the better understanding we have of the pandemic in our state.\n\nHelp us keep New Mexico safe: get tested and slow the spread.\n\nSee statewide testing sites here: https:// cvprovider.nmhealth.org/directory.html", "2020-05-19T20:02:40.000Z": "Have you received your Absentee ballot? \nIt could be sitting in your mailbox. Fill it out, mail it back (free postage), and make your voice heard. If you have not yet requested your absentee ballot, you have until May 28th. You can do it online here  https:// portal.sos.state.nm.us/OVR/WebPages/A bsenteeApplication.aspx?type=RA ", "2020-05-19T16:30:09.000Z": "Mayor Crawford of Ruidoso knows that face masks are an essential step to slowing the spread of #COVID19 and saving lives, and that the more we do so, the sooner New Mexico's economy can continue to reopen. Thank you Mayor!\n\nMask up. Slow the spread. Save lives. #AllTogetherNM", "2020-05-18T22:50:37.000Z": "Today's #COVID19 update:\n\n- 165 new cases, totaling 6,096 positive tests statewide\n\n- 5 new COVID-19 deaths, bringing the total to 270\n\n- 213 individuals currently hospitalized\n\nWear a mask. Slow the spread. Save lives. #AllTogetherNM More info here: https:// bit.ly/36hDcn9", "2020-05-18T19:52:12.000Z": "ICYMI: Last week @EmnrdNM announced additional @NMStateParks now open for day-use.\n\nRemember, you must continue social distancing and wear a face mask while enjoying New Mexico's great outdoors.", "2020-05-18T17:27:20.000Z": "Complete the #2020Census today! The Census Bureau has extended the deadline to self-respond to the end of October. Reapond online, over the phone or by mail, all from the safety of home. For more information, visit http:// icountnm.gov . #CompleteCountNM  #ICountNM", "2020-05-18T15:35:50.000Z": "COVID-safe practices MUST be in place in order for any business or organization to operate.\n\nThe state Economic Recovery Council and @NMDOH have developed specific COVID-safe practices (CSPs) for a wide variety of employers - see your required CSPs here: https:// adobe.ly/2AzwdKs", "2020-05-17T17:50:27.000Z": "As we slowly and safely balance our fight against #COVID19 with learning to live in a COVID-positive world, we must continue to take every possible precaution - that means COVID-safe practices like wearing masks in public, as required statewide. #MaskUp New Mexico's new norm: Wear a mask in public Governor's face-covering mandate is trade-off for starting to reopen abqjournal.com", "2020-05-16T19:45:22.000Z": "Don't have a mask? Easily make one yourself by following this tutorial: https:// cv.nmhealth.org/about-covid-19/ OR request a mask from the state - click the red \"Request a Mask\" button at https:// cv.nmhealth.org  #AllTogetherNM  #MaskUp", "2020-05-15T21:30:37.000Z": "UPDATES from today's press conference on #COVID19 in New Mexico:\n\n- 164 new cases of COVID-19 announced today, currently totaling 5,662 positive tests statewide\n\n- 11 additional COVID-19 deaths, bringing the total to 253\n\n- 223 individuals currently hospitalized", "2020-05-15T19:41:26.000Z": "Representative Lente is absolutely right - we all depend on one another. \n\nThank you for keeping yourself and your community safe. #MaskUp  #SlowTheSpread  #AllTogetherNM Quote Tweet NM House Democrats @NMHouseDems \"Wearing a face mask at the farm? You bet.\" Rep. Derrick Lente of Sandia Pueblos is an essential farmer with thousands who rely on his product. Protecting himself to stay healthy allows him to keep producing. \n\n\"We all depend on one another.\" #AllTogetherNM  #NMLeg  #NMPol", "2020-05-15T17:40:08.000Z": "I'll be joined by state health and elections officials this afternoon to give an update on New Mexico's #COVID19 efforts.\n\nTune in to http:// facebook.com/GovMLG at 3 PM - you don't have to have an account to watch. #StayHomeSaveLives  #AllTogetherNM", "2020-05-15T17:37:19.000Z": "We all need to do our part to continue to stop the spread of COVID-19, you can do yours by #votingabsentee . It's the safest way to make your voice heard this year.\nIt's more convenient than waiting in long lines on #election day and protects yourself and your fellow New Mexicans.", "2020-05-15T15:15:18.000Z": "ICYMI: Get tested, New Mexico!\n\n44% of COVID-19 cases are contracted from someone showing no symptoms.\n\nMore testing enables more people who are COVID-positive to self-isolate, reducing the spread of the virus and saving lives across the state. All New Mexicans can now get virus testing People can be tested regardless of whether they have symptoms abqjournal.com", "2020-05-15T02:47:46.000Z": "I am proud to endorse this group of talented and dedicated leaders who have been - or will be - partners in building a stronger, safer, and more prosperous New Mexico!", "2020-05-14T20:10:17.000Z": "Thanks for spreading the word about the #2020Census  @SFCCNM ! \n\nEvery New Mexican should ensure their community receives adequate federal funding by filling out the Census and getting counted. Quote Tweet SFCC @SFCCNM Have you filled out your information for the census yet?  We encourage all SFCC students and members of our community to register if you haven't already.  To register please visit: https://", "2020-05-14T18:57:05.000Z": "Thanks @UNM ! I'd never turn down a chance to wear the cherry and silver.\n\nWhile we're all wearing masks to protect our community, why not show some school pride - whadya say @WNMU and @enmu ? Quote Tweet Univ. of New Mexico @UNM Nice to see Pistol Pete #maskup to #ProtectNM . We were happy to start seeing these on UNM essential staff last week. We would love to send you one @GovMLG ! Thanks, @UNMLOBOS for keeping Lobos safe. twitter.com/GovMLG/status/ Show this thread", "2020-05-14T18:31:27.000Z": "State government employees are working tirelessly to make sure New Mexico seniors stay safe & healthy with food & essential supplies.\n\nI'm grateful every day for the compassion & dedication of New Mexicans statewide stepping up to help in so many ways. State workers key to helping seniors Volunteers have delivered about 29,000 boxes of groceries abqjournal.com", "2020-05-14T16:25:04.000Z": "Thanks Pistol Pete! Way to mask up, @nmsu . \n\nOkay @UNM , Aggies have the lead! Are you going to let that slide? Quote Tweet New Mexico State @nmsu #NM Governor @GovMLG announced yesterday that everyone must wear a mask while in public. Pistol Pete is ready, are you? #MaskUp  #StillNMSU  #mask  #covid -19 #staysafe  #NMSU", "2020-05-14T16:10:39.000Z": "Nine additional @NMStateParks will open for day-use only on May 15th. They are: Oasis, Oliver Lee, Clayton Lake & Dinosaur Trackways, Pancho Villa, Mesilla Valley Bosque, Living Desert Zoo and Gardens, Coyote Creek, City of Rocks & Rockhound State Parks. http:// emnrd.state.nm.us/ADMIN/document s/ParksDayUseAnnouncementPhase2Final.pdf ", "2020-05-14T14:40:03.000Z": "Effective Saturday, May 16th, masks will be required of everyone in public places.\n\nIt is your civic duty to protect your fellow New Mexicans, just as you want them to protect you.\n\nDon't have a mask? No problem, you can easily make your own.\n\nWear a mask and slow the spread. The following media includes potentially sensitive content. Change settings View", "null": "", "2020-05-13T15:30:04.000Z": "I'll be joined by state officials this afternoon to give an update on New Mexico's #COVID19 efforts and the status of the public health emergency order.\n\nTune in to http:// facebook.com/GovMLG at 4 PM - you don't have to have an account to watch. #StayHomeSaveLives  #AllTogetherNM", "2020-05-13T16:50:35.000Z": "Voting by mail is the way to go!\n1. Check your mail for an absentee ballot application (or request a ballot online @ http:// nmvote.org )\n2. Fill out & return your absentee ballot app \n3. Your absentee ballot will arrive in a few days\n4. Cast your vote & mail your ballot", "2020-05-12T23:30:03.000Z": "Today's #COVID19 update:\n\n- 143 new cases, totaling 5,212 positive tests statewide\n\n- 11 new COVID-19 deaths, bringing the total to 219\n\n- 199 individuals currently hospitalized\n\nStay home. Don't gather with people. Wear a mask.\n\nMore info here: https:// bit.ly/3fItZbR", "2020-05-12T19:45:10.000Z": "Reopening must be guided by the public health data.\n\nWe have to learn to live in a #COVID19 world until there is a vaccine, but that doesn't mean we knowingly put anybody, including our health care workers, at risk. Coronavirus cases are on the rise in Texas and other states that reopened early, former FDA chief... Other states, such as Georgia, which has one of the most ambitious and earliest reopening plans, have yet to report an uptick in cases. cnbc.com", "2020-05-12T17:35:05.000Z": "New Mexico: If you're currently working, we want you to get tested for #COVID19 .\n\nGrocery & pharmacy employees, retail workers, utility employees, service industry workers, government employees - if you're a worker, you can & should get tested, whether or not you're symptomatic.", "2020-05-11T23:08:46.000Z": "Today we've crossed the threshold of 5,000 #COVID19 cases in New Mexico, as well as over 200 devastating deaths.\n\nCases continue to rise. The virus continues to spread.\n\nEvery New Mexican must do their part in practicing social distancing and slowing the spread of the virus.", "2020-05-11T19:16:01.000Z": "The New Mexico State Police have a thankless job even in the best of times. Amid this pandemic @NMStatePolice officers have been asked to go above & beyond to keep New Mexicans safe - and they have met the call with utmost professionalism. I am grateful to them every single day.", "2020-05-11T18:17:07.000Z": "This pandemic is awful. It has forced individuals, families, & state institutions alike to make impossibly difficult decisions in the name of public health. I commend the @santafeopera for having the courage to make this terrible but necessary choice to protect workers & patrons. Quote Tweet Santa Fe Opera @santafeopera (1) A message from Robert K. Meya, General Director\nDear Friends,\nIt is with profound sadness that I announce today that the Santa Fe Opera has been forced to cancel its 2020 Season as a result of the COVID-19 pandemic. Show this thread", "2020-05-11T19:43:57.000Z": "The New Mexico Primary is right around the corner! Are you voting on June 2? Make your voice heard! For more information on how to vote by absentee ballot go to  https:// sos.state.nm.us/voting-and-ele ctions/voter-information/ ", "2020-05-11T18:01:33.000Z": "Thank you to the education personnel and volunteers statewide who have made this incredible milestone a reality! #AllTogetherNM Quote Tweet New Mexico PED @NMPED New Mexico Public Schools just passed the five-million meal mark. Since the school closure period began in mid-March, our schools have served 5,003,683 meals to students and young New Mexicans, removing one burden from their families during this uncertain time. Show this thread", "2020-05-11T17:38:13.000Z": "The state of New Mexico continues to invest in our health care resources during this public health crisis, supporting health care providers and ensuring that New Mexicans have access to the services they need. #AllTogetherNM NM hospitals get $66 million lifeline Temporary 50% increase in Medicaid rate approved abqjournal.com", "2020-05-10T16:04:38.000Z": "Today let's celebrate the women who support, guide, and love us unconditionally! Please continue to practice social distancing to keep mom and our loved ones safe today. #HappyMothersDay", "2020-05-09T19:10:36.000Z": "This Mother's Day, show your mom how much you care - from a safe physical distance.\n\nBeing apart is hard, but it's the best way to demonstrate our love for one another right now. Keep your loved ones safe by keeping your distance. #StayHomeSaveLives  #AllTogetherNM", "2020-05-09T17:45:22.000Z": "The state of New Mexico is committed to supporting indigenous nations, tribes and pueblos as we face the COVID-19 pandemic together.\n\nThank you to our partners and the individual donors who continue to come together to show their support during this critical time. #AllTogetherNM Quote Tweet New Mexico Indian Affairs Department @NewMexicoIAD The New Mexico Indian Affairs Department has partnered with the @indianpueblo Pueblo Relief Fund, and The Setter Group to procure and deliver essential supplies to our Nations, Tribes, and Pueblos. Thank you to all who contributed! #AllTogetherNM", "2020-05-08T22:32:27.000Z": "Today's #COVID19 update:\n\n- 181 new cases, totaling 4,673 positive tests statewide\n\n- 9 new COVID-19 deaths, bringing the total to 181\n\n- 201 individuals currently hospitalized in New Mexico for COVID-19\n\nMore info here: https:// bit.ly/2LeZdcK", "2020-05-08T19:33:48.000Z": "Yesterday I highlighted some positive stories from around New Mexico - like the incredible dedication of school personnel in Peñasco, working to ensure that kids throughout their community are fed.\n\nIf you missed the good news, you can watch again here: https:// facebook.com/GovMLG/videos/ 3197789833585480/ ", "2020-05-08T17:00:04.000Z": "Now, more than ever, teachers need to know that their work is absolutely essential and unequivocally valued.\n\nThank you, New Mexico educators, for all that you do for all of us!\n\nAs #TeacherAppreciationWeek comes to a close, is there a New Mexico educator you'd like to thank?", "2020-05-08T15:46:06.000Z": "Tonight: National stars are coming together to raise #COVID19 relief funds for New Mexico! \n\nTune in at 8PM to Virtual LemonAid, benefiting the All Together New Mexico Fund to address immediate needs of New Mexicans affected by the COVID-19 crisis. Buffy Sainte-Marie, David Byrne Lead Virtual LemonAid Lineup for COVID-19 Relief Buffy Sainte-Marie and David Byrne are among the artists who will appear during the Virtual LemonAid festival for COVID-19 relief. rollingstone.com", "2020-05-08T00:25:09.000Z": "Virtual LemonAid! Tomorrow at 8p a talented group of artists will band together raising funds to directly help New Mexicans on the frontlines of COVID-19. I'm so proud to support such a uniquely New Mexican effort. Donate & support our fellow New Mexicans! Home : Virtual LemonAid Northern New Mexico's Festival for COVID-19 Relief. Tune in to the broadcast on Friday May 8th at 8:00 PM MDT on various broadcasting channels and platforms! virtuallemonaid.com", "2020-05-07T22:15:58.000Z": "Today's #COVID19 update:\n\n- 204 new cases, totaling 4,493 positive tests statewide\n\n- Three new COVID-19 deaths, bringing the total to 172\n\n- 197 individuals currently hospitalized in New Mexico for COVID-19\n\n- 1,125 New Mexico COVID-19 cases designated as having recovered", "2020-05-07T21:52:11.000Z": "Great news from @NMHSD today - New Mexicans receiving food assistance will soon be able to use SNAP benefits to purchase groceries online, minimizing person-to-person contact  and slowing the spread of #COVID19 . \n\nMore info here: https:// bit.ly/2znPkq8 Quote Tweet NM Human Services @NMHSD New Mexico families receiving food assistance through the Supplemental Nutrition Assistance Program (SNAP) will soon be able to use benefits to buy food online. More information at: https:// hsd.state.nm.us/uploads/PressR elease/2f473c14ee654f868b5a25b3cfd15a6d/5_7_20_SNAP_online_PR.pdf   #HSD  #AllTogetherNM", "2020-05-07T20:01:30.000Z": "Hey New Mexico - we could all use a little good news these days! So I'm jumping on Facebook live around 3pm this afternoon to highlight some positive stories from around the state.\n\nYou don't have to have a Facebook account to watch - tune in here at 3: http:// facebook.com/GovMLG/", "2020-05-07T17:30:19.000Z": "COVID-19 UPDATE The emergency declaration temporarily locking down the city of Gallup will be extended through May 10th, per the mayor's request.\n\nMore info here: https:// bit.ly/2Weo2M5", "2020-05-07T16:00:17.000Z": "Mark, I got your message. Elephant Butte is not one of the state parks that is safe to open for day-use at this time.\n\nWe are keeping our guard up - to protect your community and your veterans home. Thank you for your service. #StayHomeSaveLives  #AllTogetherNM", "2020-05-07T15:31:10.000Z": "Know before you go! 8 @NMStateParks are now open for day-use only, including Brantley Lake. Restrictions are in effect, please enjoy the outdoors responsibly: New Mexico State parks and lakes to reopen in phases Eight state parks are now open during the daytime. Overnight camping and any planned events through the month of May are still banned. currentargus.com", "2020-05-06T21:35:09.000Z": "Think twice before traveling out of state. https:// cv.nmhealth.org", "2020-05-07T14:35:33.000Z": "We continue to distribute food all over the state of New Mexico, and we couldn't do it without the wonderful volunteers Thank you @berncounty Ben. E. Keith Food  Ben E Keith Foods Distributor and Swift Trucking \nYesterday they loaded 42 pallets of food (2,011 boxes)", "2020-05-06T23:06:31.000Z": "To all the nurses across New Mexico and the nation, keeping us safe and healthy each and every day...we are sending our support, our love and our gratitude! #NationalNursesDay", "2020-05-06T18:49:10.000Z": "Listen to Secretary Stewart remember his 9th grade English Teacher as someone who made literature come alive for her students. #NMLovesTeachers  #TeacherAppreciationWeek2020 Quote Tweet ESPN Albuquerque 101.7FM The TEAM @1017theteam Thank you @rstew42 and @NMPED for supporting #TEAMUpForTeachers ! Nominate a favorite teacher in a short video post using #TEAMUpForTeachers . You could win $50 to @DionsPizza and your teacher can win $100 for their class. #TeacherAppreciationDay  @ABQschools", "2020-05-06T16:39:27.000Z": "Today at 3 PM I'll go Live from Home to talk economic recovery with members from @GovMLG Economic  Recovery Council.  Submit your questions, share, and watch Live on Facebook at: https:// bit.ly/3bbDBZg  #AllTogetherNM  #NMLeg  #NMPol", "2020-05-06T18:03:10.000Z": "Thank you @UNMHospital ! We are so grateful to every single incredible nurse working within your walls. #NationalNursesDay Quote Tweet UNM Hospital @UNMHospital Replying to @GovMLG We would like to give a shoutout to all of our nurses!", "2020-05-06T15:38:25.000Z": "Effective TODAY, all eateries and essential businesses operating as a retail space with a footprint greater than 50,000 square feet are required to have employees wear face-coverings.\n\nMy mask protects you, your mask protects me.\n\nWe're all in this together. Mask up. Quote Tweet Michelle Lujan Grisham @GovMLG COVID-19 UPDATE Effective tomorrow, May 6:\n\nEmployees at restaurants and essential businesses operating as a retail space with footprint greater than 50,000 square feet will be REQUIRED to wear face-coverings. Show this thread", "2020-05-05T23:30:50.000Z": "COVID-19 UPDATE Effective tomorrow, May 6:\n\nEmployees at restaurants and essential businesses operating as a retail space with footprint greater than 50,000 square feet will be REQUIRED to wear face-coverings.", "2020-05-05T22:45:06.000Z": "State health officials have announced today 107 additional cases of #COVID19 in New Mexico, currently totaling 4,138 positive tests statewide.\n\nSadly, @NMDOH also announced six new deaths related to COVID-19, bringing the total to 162.\n\nMore info here: https:// bit.ly/3dnOsRs", "2020-05-05T21:00:36.000Z": "Starting soon! Tune in now at http:// facebook.com/GovMLG En español: http:// youtube.com/c/GovMLG/live Quote Tweet Michelle Lujan Grisham @GovMLG I'll be joined by state officials later today to give an update on New Mexico's #COVID19 efforts and the details of the extended public health order.\n\nTune in to http:// facebook.com/GovMLG this afternoon at 3 PM. #StayHomeSaveLives  #AllTogetherNM", "2020-05-04T23:55:12.000Z": "Attention New Mexico farmers & ranchers!\n\nApplications are now open for agricultural businesses to apply for @SBAgov Economic Injury Disaster Loans.\n\nNo lender is necessary - New Mexico farmers and ranchers in need are encouraged to apply directly here: https:// bit.ly/3c7CT0c", "2020-05-04T22:54:59.000Z": "Thank you to the state for working with us on making testing more accessible in the South Valley. Sign up for an appointment tomorrow! #OneAlbuquerque  #AllTogetherNM", "2020-05-04T22:30:14.000Z": "State health officials have announced today 186 additional cases of #COVID19 in New Mexico, currently totaling 4,031 positive tests statewide.\n\nSadly, @NMDOH also announced five new deaths related to COVID-19, bringing the total to 156.\n\nMore info here: https:// bit.ly/2YvcWnz", "2020-05-04T17:00:00.000Z": "NEW: SBA is now accepting #COVID19 Economic Injury Disaster Loan and Advance applications for agricultural small businesses on a limited basis. More details: https:// sba.gov/about-sba/sba- newsroom/press-releases-media-advisories/sba-make-economic-injury-disaster-loans-available-us-agricultural-businesses-impacted-covid-19   Apply here: https:// sba.gov/disaster Apply for disaster assistance www.sba.gov", "2020-05-04T17:07:05.000Z": "The timeline for reopening New Mexico depends upon New Mexicans.\n\nGathering with people and failing to stay home will worsen the spread of this virus. It will lead to more illness and death.\n\nWe cannot win this fight if we let our collective guard down. #StayHomeSaveLives", "2020-05-04T15:24:25.000Z": "#ICYMI  @GovMLG 's order last week re: polling sites for the Primary means election-related facilities can operate subject to certain requirements to protect public health. However, the safest way to vote is still from home by absentee ballot. https:// sos.state.nm.us/2020/05/01/pub lic-health-emergency-order-clarifying-that-polling-places-shall-be-open-as-required-in-the-election-code-and-imposing-certain-social-distancing-restrictions-on-polling-places/   #nmpol", "2020-05-04T15:20:04.000Z": "COVID-19 UPDATE The emergency declaration temporarily locking down the city of Gallup will be extended through May 7th, per the mayor's request.\n\nAll roads into Gallup remain closed. Essential businesses will close from 8pm - 5am. Residents should shelter in place. Quote Tweet Michelle Lujan Grisham @GovMLG COVID-19 UPDATE Effective noon today I am enacting further temporary restrictions to slow the spread of #COVID19 , temporarily locking down the city of Gallup at the mayor's request. Show this thread", "2020-05-02T19:30:04.000Z": "Testing for the coronavirus is widely available across New Mexico.\n\nIf you have symptoms, or you've been in contact with someone who tested positive, or you're an essential worker - don't be afraid, get tested!\n\nFind testing statewide testing sites here: https:// bit.ly/2UNYiEo", "2020-05-01T23:45:10.000Z": "Dr. Josiah Child knows the realities of the #COVID19 pandemic, treating patients as a physician and experiencing the terrifying, life-threatening symptoms himself as a COVID survivor.\n\nHe's on the frontline of the COVID-19 crisis - his message to you? You DON'T want to be there.", "2020-05-02T16:16:03.000Z": "New Mexico lenders are still able to help businesses with loan applications for the @SBAgov Paycheck Protection Program.\n\nFunds remain available, but they will go quickly! Contact a lender today to get your application in and go to http:// SBA.gov for more info.", "2020-05-01T20:45:03.000Z": "Don't have a mask? No problem, you can make your own.\n\nWear it when you go to the grocery store, when you go to the pharmacy, when you go inside the gas station.\n\nWear a mask and help slow the spread of #COVID19 . The following media includes potentially sensitive content. Change settings View", "2020-05-01T20:42:47.000Z": "WEAR A FACE MASK WHEN YOU ARE IN PUBLIC I wear a mask to protect you, and you wear a mask to protect me.\n\nWe're all in this together. Mask up. Period. #StayHomeSaveLives  #AllTogetherNM  #WearAFaceMaskSeriouslyJustDoIt", "2020-05-01T15:34:13.000Z": "Cimarron Canyon, Ute Lake, Brantley Lake, Sumner Lake, Caballo Lake, Cerrillos Hills, Storrie Lake, and Villanueva are now open for day-use access. Additional restrictions are in effect, please check specific park websites before visiting a State Park: http:// emnrd.state.nm.us/ADMIN/document s/ParksDayUseAnnouncementFinal.pdf ", "2020-05-01T19:19:08.000Z": "Today @NMHSD announced $46.2 million in new Medicaid payments to nursing facilities to help them mitigate the spread of #COVID19 among employees & residents.\n\nWe continue to take every available opportunity to slow the spread of COVID-19.\n\nMore info here: https:// bit.ly/3aRcsL3", "2020-05-01T17:00:57.000Z": "COVID-19 UPDATE Effective noon today I am enacting further temporary restrictions to slow the spread of #COVID19 , temporarily locking down the city of Gallup at the mayor's request.", "2020-05-01T16:17:55.000Z": "Today a modified public health order goes into effect for much of New Mexico.\n\nThe instruction to stay at home except for essential outings DOES NOT CHANGE. It remains in place for all individuals.\n\nMass gatherings continue to be prohibited. We MUST continue to slow the spread.", "2020-04-30T21:37:57.000Z": "UPDATES FROM TODAY'S PRESS CONFERENCE:\n\n- 198 new cases of #COVID19 announced today, currently totaling 3,411 positive tests statewide\n\n- 11 new deaths related to COVID-19 announced today, bringing the total to 123 - our deadliest day yet\n\nMore info here: https:// bit.ly/35kHJER", "2020-04-30T17:10:54.000Z": "I'll be joined by health officials later today to give an update on New Mexico's #COVID19 efforts and the details of the extended public health order.\n\nTune in to http:// facebook.com/GovMLG this afternoon at 3 PM. #StayHomeSaveLives  #AllTogetherNM", "2020-04-29T22:20:22.000Z": "Today we've seen the biggest single-day spike in New Mexico #COVID19 cases so far.\n\nWhile McKinley and San Juan counties are clearly experiencing a dramatic continued spread of the virus, what is happening there could happen ANYWHERE in New Mexico. Quote Tweet Michelle Lujan Grisham @GovMLG State health officials have announced today 239 additional cases of #COVID19 in New Mexico, currently totaling 3,213 positive tests statewide.\n\nSadly, @NMDOH also announced two new deaths related to COVID-19, bringing the total to 112.\n\nMore info here: https:// bit.ly/3bQ3DSP", "2020-04-29T21:04:38.000Z": "Just in case you missed this thread yesterday, some important information... Quote Tweet New Mexico MVD @NM_MVD Good afternoon New Mexico. We've got some great news this afternoon for those of you whose licenses have expired since the beginning of the public health emergency. Show this thread", "2020-04-29T18:30:06.000Z": "There is only one you. We can - and will - sustain & rebuild our economy & workforce throughout and after this pandemic.\n\nBut we cannot replace YOU - if this disease is allowed to spread, we will lose more New Mexican lives. I cannot & will not abide that. A mom and a nurse: New Mexicans tell their COVID-19 stories from the frontlines At 93 years old, Carolyn Sandberg's mother was healthy and cheerful. Sandberg's mother was the sixth person in New Mexico to die from the virus. koat.com", "2020-04-29T16:30:03.000Z": "Christopher Sandberg's small business is struggling right now. No one wants that. But it's the only way to slow the spread of COVID-19.\n\nHe would know - he's a #COVID19 survivor himself. He's on the frontline of this pandemic, and you do NOT want to be there with him.", "2020-04-28T22:30:05.000Z": "As of today, there are 157 individuals hospitalized in New Mexico for #COVID19 & 705 COVID-19 cases designated as having recovered.\n\nThis virus continues to spread. If we protect ourselves & our loved ones, more of us will live. We cannot underestimate COVID-19.", "2020-04-28T19:00:29.000Z": "\"They were world travelers & blue-collar workers.\n\nMentors & trailblazers. A high school basketball coach & a classroom grandmother.\"\n\nJust 35 days after NM's first #COVID19 death, over 100 New Mexicans have died.\n\nStay home. Save lives - maybe your own. PORTRAITS OF LIVES LOST Families remember some of the New Mexicans taken by COVID-19 abqjournal.com", "2020-04-28T17:00:03.000Z": "Kristin McGrath is a critical care nurse at San Juan Regional Medical Center.\n\nShe sees firsthand how COVID-19 can destroy a person's body. \n\nShe's on the frontline of the #COVID19 crisis, and she does NOT want you to be there with her. #FromTheFrontline  #StayHomeSaveLives", "2020-04-27T22:30:06.000Z": "Remember - the public health emergency order will be extended through at least May 15th.\n\nNew Mexico is not out of the woods yet. We must continue to stay home and slow the spread of #COVID19 - the more we continue to do so, the sooner the state can fully reopen. #AllTogetherNM Quote Tweet Michelle Lujan Grisham @GovMLG State health officials have announced today 101 additional cases of #COVID19 in New Mexico, currently totaling 2,823 positive tests statewide.\n\nSadly, @NMDOH also announced five new deaths related to COVID-19, bringing the total to 104.\n\nMore info here: https:// bit.ly/2VIcArZ", "2020-04-27T18:05:57.000Z": "Carolyn Sandberg lost her mother to #COVID19 .\n\nBecause of COVID-19, she wasn't able to be with her mother as she passed.\n\nShe herself then contracted COVID-19, as did her husband.\n\nListen to her message: you do NOT want to be where she is. #FromTheFrontline  #StayHomeSaveLives", "2020-04-27T15:04:32.000Z": "From sunrise to sunset, we never get tired of looking up at New Mexico's bold, beautiful skies!  #NewMexicoTrue", "2020-04-27T15:00:07.000Z": "Attention New Mexico small businesses:\n\nThe next round of federal Paycheck Protection Program money is now available!\n\nThe funds will go quickly - submit your application as soon as you can and and visit http:// sba.gov for more information from @SBAgov .", "2020-04-26T22:15:05.000Z": "State health officials have announced today 66 additional cases of #COVID19 in New Mexico, currently totaling 2,726 positive tests statewide.\n\nSadly, @NMDOH also announced six new deaths related to COVID-19, bringing the total to 99.\n\nMore info here: https:// bit.ly/2xafJqS", "2020-04-26T15:01:03.000Z": "Answers to common questions on Unemployment Insurance and Pandemic Unemployment Assistance are available at https:// dws.state.nm.us/COVID-19-Info", "2020-04-26T18:47:00.000Z": "New Mexico: the application for Pandemic Unemployment Assistance opens online today at http:// jobs.state.nm.us See this thread for more information about how to begin your application: Quote Tweet Michelle Lujan Grisham @GovMLG The application for Pandemic Unemployment Assistance opens tomorrow, Sunday, April 26. These are unemployment funds for the self-employed, independent contractors, and gig economy workers.\n\nNote - everyone applying for PUA must start the process by first applying for standard UI. Show this thread", "2020-04-26T17:30:16.000Z": "More than 3,700 medical professionals have volunteered w/ the New Mexico Medical Reserve Corps to help test & care for New Mexicans during the #COVID19 pandemic, just some of the many New Mexicans making a difference for their communities during this time. New Mexico Magazine True Heroes From the Future Forge Makerspace creating protective gear for critical workers to Socorro bus drivers shuttling meals to students, these New Mexicans make a difference. newmexico.org", "2020-04-26T17:01:02.000Z": "Brighten your spirits at home with cherished reminders of the Land of Enchantment! Many New Mexico businesses are ready to deliver their incredible products right to your doorstep. #NewMexicoTrue New Mexico True Certified Online Catalog Amidst health crisis and economic shutdown, New Mexico growers and artists have returned to what they know best: cultivating and creating. Isolation brings introspection, inspiration, new food and... newmexico.org", "2020-04-25T19:45:07.000Z": "Attention New Mexico small businesses!\n\nThe next round of federal Paycheck Protection Program money will become available at 8:30 a.m. on Monday via @SBAgov Work with your lenders now to prepare your application - and visit http:// sba.gov for more information!", "2020-04-25T15:50:04.000Z": "Hundreds of lives have been saved because of the actions that New Mexicans have taken.\n\nNew Mexico is winning the fight against #COVID19 - which is why we can't let up before we've won.\n\nStay the course. Stay home. Save lives. #AllTogetherNM How New Mexico, One of the Poorest States, Averted a Steep Death Toll New Mexico showed how a state can fight the coronavirus with aggressive social distancing, free testing and scientific expertise. But contagion threats are building. nytimes.com", "2020-04-24T23:06:35.000Z": "If you're struggling with your mental health, especially during this particularly difficult and stressful time, the state of New Mexico is here for you.\n\nYou are not alone, and we are here to support you.\n\nDownload the NMConnect app to access 24-hour crisis & non-crisis support.", "2020-04-24T22:30:41.000Z": "State health officials have announced today 153 additional cases of #COVID19 in New Mexico, currently totaling 2,521 positive tests statewide.\n\nSadly, @NMDOH also announced six new deaths related to COVID-19, bringing the total to 84.\n\nMore info here: https:// bit.ly/3cMNqy0", "2020-04-24T20:36:17.000Z": "I'll be joined by state officials at 4 PM today to provide an update on New Mexico's #COVID19 efforts, including unemployment.\n\nWatch live at http:// facebook.com/GovMLG/ A simultaneous interpretation in Spanish will be streamed at http:// youtube.com/c/GovMLG  #StayHomeSaveLives", "2020-04-24T15:30:38.000Z": "We must have a health-first focus if we're ultimately going to come back economically. People will not return if they do not feel safe. And it is not yet safe. Stay the course. #StayHomeSaveLives  #AllTogetherNM Governor: 'Be hopeful' - but not complacent in battle against coronavirus New Mexico is slowing the spread of the virus, officials say, but cases are still surging in the state's northwest. santafenewmexican.com", "2020-04-23T22:15:17.000Z": "Today's update: New Mexico's largest single-day case total yet.\n\n169 new #COVID19 cases, totaling 2,379 positive tests statewide.\n\n7 new deaths, bringing the total to 78.\n\nStay home. Slow the spread. Save lives. Period.\n\nMore info here: https:// bit.ly/2S29LPX", "2020-04-23T19:30:09.000Z": "Not quite: New Mexico initiated #COVID19 testing criteria for asymptomatic people three weeks ago.\n\nBut hey, we're glad to see other states following our lead! Quote Tweet CNN @CNN California the first state in the US to broaden its guidelines for coronavirus testing to include asymptomatic people, state health officials say. Health officials are now recommending testing for asymptomatic people who live or work in high-risk settings. https:// cnn.it/2VJlunI", "2020-04-23T19:00:58.000Z": "We're clear that the economic pain that has been caused by the #COVID19 pandemic is a reality we must address & address immediately. We are launching our statewide effort to map out the road back, for a staged reopening of the economy - a beginning of the return to a new normal.", "2020-04-23T18:18:53.000Z": "Over 3.3 MILLION meals have been distributed to New Mexico children, free of cost, since the #COVID19 school closure period began.\n\nI am so grateful to every teacher, cafeteria worker, and school staff member who has made this monumental effort possible. #AllTogetherNM Quote Tweet New Mexico PED @NMPED Yesterday, we shared the total number of meals New Mexico Public Schools served last week and asked you to guess the total number of meals that have been served during the school closure period. As of last Friday, the grand total was at more than 3.3 million meals! #AllTogetherNM", "2020-04-23T16:06:02.000Z": "Did you miss yesterday's live #COVID19 update?\nYou can watch it here: https:// facebook.com/GovMLG/videos/ 2663571173969028/  The information graphics presented at yesterday's update can be found here: https:// governor.state.nm.us/april-22nd-cov id-19-press-conference-graphics/  COVID-19 Update - April 22, 2020 Governor Michelle Lujan Grisham was live. facebook.com", "2020-04-23T15:05:19.000Z": "Here's the deal: We're not ready to ease up. New Mexico will be extending its public health orders through at least May 15th.\n\nDoes that mean we haven't made progress? No. If you are staying home, your actions have saved countless - truly countless - lives, & will save many more.", "2020-04-22T22:28:19.000Z": "If you are a healthcare worker or first responder in need of emotional or mental health support, you can contact the New Mexico Healthcare Worker and First Responder Support Line at 855-507-5509. You are not alone. #AllTogetherNM", "2020-04-22T19:14:16.000Z": "Hoy a las 3:00 de la tarde habrá una actualización sobre los esfuerzos de Nuevo México frente a la pandemia del COVID-19.\n \nUna interpretación simultánea en español será transmitida en vivo en http:// youtube.com/c/GovMLG", "2020-04-22T18:15:39.000Z": "I'll be joined by state officials at 3 PM today to provide an update on New Mexico's #COVID19 efforts.\n\nTune in and watch live at http:// facebook.com/GovMLG/ A simultaneous translation in Spanish will be streamed live at http:// youtube.com/c/GovMLG  #StayHomeSaveLives  #AllTogetherNM", "2020-04-22T17:39:44.000Z": "Happy Earth Day everyone! Now more then ever we must work together to create a cleaner, healthier, and more prosperous planet. Not only for ourselves but for the generations to come. #ProtectOurHome  #HappyEarthDay", "2020-04-21T22:00:02.000Z": "As of today, there are 119 individuals hospitalized in New Mexico for #COVID19 & 529 COVID-19 cases designated as having recovered by @NMDOH .\n\nWe have not won this fight yet. Every New Mexican must work to slow the spread of COVID-19. Stay home. #StayHomeSaveLives  #AllTogetherNM", "2020-04-21T19:33:09.000Z": "You must fill out this form by 10 AM tomorrow morning, Wednesday, April 22nd, to get your full Economic Impact Payment, including payments for dependents.\n\nIf this applies to you, act now and do not delay! Please share this information widely. Non-Filers: Enter Payment Info Here | Internal Revenue Service Do NOT use this tool if you will be filing a 2019 return. Using the tool instead of filing your 2019 return will slow down processing of your tax return and receiving any tax refund. irs.gov", "2020-04-21T17:37:09.000Z": "Are you in need of cash assistance? Apply online for Temporary Assistance for Needy families (TANF). The TANF program provides a monthly cash benefit used to meet basic family needs such as housing, utilities, and clothing. You can apply online at http:// yes.state.nm.us  #HSD", "2020-04-21T17:36:56.000Z": "THREAD: I know that self-employed New Mexicans have been waiting anxiously for the additional Pandemic Unemployment Assistance to be available, and I understand that it has been an incredibly painful wait.", "2020-04-21T15:45:53.000Z": "Schools may be closed, but learning is still in session.\n\nThank you to the incredible educators and education personnel across the state who are working tirelessly to ensure that New Mexico students continue to get the support they need! #AllTogetherNM Quote Tweet NM Teacher of the Year 2020, Mandi Torrez @manditorrez My daughter is doing her math this morning with @HomeWithAPS and Ms. B! @nmped  @ABQschools  #AllTogetherNM", "2020-04-20T22:15:27.000Z": "State health officials have announced today 126 additional cases of #COVID19 in New Mexico, currently totaling 1,971 positive tests statewide.\n\nSadly, @NMDOH also announced three new deaths related to COVID-19, bringing the total to 58.\n\nMore info here: https:// bit.ly/3apECwm", "2020-04-20T17:50:06.000Z": "It takes less than ten minutes to fill out the #2020Census , and your community is counting on you to get counted!\n\nDon't be the reason New Mexico misses out on critical federal funding for our schools, health care, and roads - get counted today! New Mexico lags behind other states in Census response A lot of New Mexicans have not returned their 2020 Census forms. kob.com", "2020-04-19T20:37:13.000Z": "The #2020Census determines BILLIONS of $$$ in federal funding for kids programs. NM WIC receives $45,670,000 alone! Encourage your friends, family, neighbors, EVERYONE in NM to get counted. It takes 15 min. & you can do it online at: https:// my2020census.gov  #WeGotThisNM  #icountnm", "2020-04-19T22:15:16.000Z": "State health officials have announced today 47 additional cases of #COVID19 in New Mexico, currently totaling 1,845 positive tests statewide.\n\nSadly, @NMDOH also announced two new deaths related to COVID-19, bringing the total to 55.\n\nMore info here: https:// bit.ly/2wRordz", "2020-04-19T19:15:04.000Z": "Just like me, New Mexico mayors know our small businesses are hurting.\n\nBut they understand we must be safe before we can relent in our fight against the virus. They know we need more tests; they know we need more safeguards. We will get there - together. Mayors support governor's actions We write this letter to express our support for the actions Gov. Michelle Lujan Grisham has taken to fight COVID-19 in the great state of New Mexico and to declare santafenewmexican.com", "2020-04-17T22:20:31.000Z": "State health officials have announced today 115 additional cases of #COVID19 in New Mexico, currently totaling 1,711 positive tests statewide.\n\nSadly, @NMDOH also announced seven new deaths related to COVID-19, bringing the total to 51.\n\nMore info here: https:// bit.ly/34JP8xf", "2020-04-17T20:30:05.000Z": "We've added a new layer to New Mexico's #COVID19 data dashboard, listing the concentrations of cases in the state by zip code and ensuring important pandemic data is available for the general public while protecting patient privacy.\n\nSee it here: NMDOH COVID-19 Public Dashboard The data dashboard currently includes county-by-county breakdowns of positive cases by age, gender and ethnicity. The portal also includes reporting about testing by county. cvprovider.nmhealth.org", "2020-04-17T18:51:33.000Z": "What does #COVID19 surveillance & contact tracing mean? It means getting thorough information from New Mexico's COVID-19 patients, increased testing of people they've had contact with, & doing everything we can to ensure the health & safety of New Mexicans during this pandemic.", "2020-04-17T17:00:20.000Z": "The best thing to do while staying home to slow the spread of #COVID19 ?\n\nEat more New Mexico chile, duh. #StayHomeSaveLives  #AllTogetherNM  #NewMexicoTrue Quote Tweet Visit New Mexico @NewMexico Red or green? #NewMexicoTrue", "2020-04-17T15:54:25.000Z": "As we head into the weekend, another reminder that @NMStateParks are closed to slow the spread of #COVID19 . Please continue to stay safe at home! New Mexico state parks will begin to enforce closure violations New Mexico state parks will begin to enforce closure violations demingheadlight.com", "2020-04-17T15:54:50.000Z": "Are you concerned about voting during these unprecedented times? Sign up to receive an absentee ballot. It will ensure you have access to your vote and can continue to practice social distancing. Get one today New Mexico https:// portal.sos.state.nm.us/OVR/WebPages/A bsenteeApplication.aspx ", "2020-04-16T22:30:06.000Z": "State health officials have announced today 116 additional cases of #COVID19 in New Mexico, currently totaling 1,597 positive tests statewide.\n\nSadly, @NMDOH also announced eight new deaths related to COVID-19, bringing the total to 44.\n\nMore info here: https:// bit.ly/3bfN7vl", "2020-04-16T21:00:12.000Z": "This week we unveiled a new app for behavioral health support, especially important during these straining & socially-distant times in the face of #COVID19 .\n\nThe NMConnect app provides free 24-hour crisis & non-crisis support & access to behavioral health professionals.", "2020-04-16T17:04:51.000Z": "Los Alamos County is leading the nation in its #2020Census rate - but what about the rest of us, New Mexico?\n\nThe Census is critical to ensure that New Mexico receives necessary federal funding. Make sure you get counted! #icountnm Quote Tweet ICountNM @ICountNM ATTENTION!!! Los Alamos County takes the lead NATIONWIDE in #2020Census response rate! Way to go!!! Come on New Mexico! Let's get everyone counted. You can respond online, by phone, or by mail. #icountnm  @NMCounties33  @GovMLG", "2020-04-16T16:18:02.000Z": "Join the Indian Affairs Department for Tribal Communities & COVID-19 - A Virtual Town Hall on NMPBS, Sunday, April 19 @ 6:00 PM! Submit your questions to TribalTownHall@gmail.com #AllTogetherNM  #NewMexico  #TribalTownHall  #TribalCommunities", "2020-04-16T15:50:38.000Z": "New Mexico: what you're doing is making a difference.\n\nThat is not permission to ease up. It's an encouragement: Keep going. Keep on.\n\nWe are in position to get through this public health emergency fast and safe and healthy - but you have to keep it up. Gov.: Social distancing is slowing spread But Lujan Grisham says the state still has a 'long way to go' abqjournal.com", "2020-04-15T22:30:09.000Z": "The state of New Mexico is doing everything in its power to support the sovereign tribes & pueblos of this state during this pandemic.\n\nToday @NewMexicoIAD announced incredible success in partnering with the Navajo Nation & numerous pueblos to deliver food to tribal communities.", "2020-04-15T17:00:53.000Z": "I'll be joined by state officials at 2 PM this afternoon to provide an update on New Mexico's efforts in the face of the #COVID19 pandemic.\n\nYou can tune in and watch live at http:// facebook.com/GovMLG/ - you don't have to have an account to watch. #StayHomeSaveLives  #AllTogetherNM", "2020-04-15T15:30:14.000Z": "In-person voting poses a grave threat of heightened transmission of #COVID19 . I remain confident NM's primary election can be conducted almost entirely if not entirely through mail to ensure the safest possible exercise of New Mexicans' right to vote. NM high court rejects petition for mail election Justices order county clerks to send absentee ballot applications abqjournal.com", "2020-04-14T23:00:57.000Z": "State health officials have announced today 62 additional cases of #COVID19 in New Mexico, currently totaling 1,407 positive tests statewide.\n\nSadly, @NMDOH has also announced five new deaths related to COVID-19, bringing the total to 36.\n\nMore info here: https:// bit.ly/3cely5m", "2020-04-14T19:15:12.000Z": "When we talk about #COVID19 , we talk a lot about PPE - what is it, how does it work, & why is it so important?\n\nWe teamed up with @PresHealth , @UNMHSC , & @LovelaceHealth to explain it for you.\n\nHelp us ensure that healthcare workers have enough PPE to stay safe: STAY HOME.", "2020-04-14T17:16:18.000Z": "Today we've launched a new online portal from @NMDOH with additional #COVID19 data for New Mexico, including county-by-county breakdowns of positive cases by age, gender & ethnicity, as well as reporting on testing by county.\n\nSee it here: NMDOH COVID-19 Public Dashboard The data dashboard currently includes county-by-county breakdowns of positive cases by age, gender and ethnicity. The portal also includes reporting about testing by county. cvprovider.nmhealth.org", "2020-04-14T15:18:56.000Z": "No one wants to reopen our state more than I do. But we're in an extraordinary situation, facing a deadly virus that's spread worldwide.\n\nWe can't be guided by gut feelings - we have to listen to scientists and public health experts. We have to stay home. OPINION | Gov: Health vs. economy a false choice OPINION | Right now, America faces greater economic pain than at any time since the Great Depression. Tens of ... abqjournal.com", "2020-04-13T21:26:19.000Z": "New Mexicans around the state are rising to the occasion to support their communities and protect health care workers on the frontlines of #COVID19 . I couldn't be more proud - thank you @nmsu and @NMSU_engineer !\n\nWe are #AllTogetherNM . Quote Tweet NMSU Engineering @NMSU_engineer The Aggie Innovation Space at @NMSU has been in high gear as students and staff work to produce face shields for healthcare workers. #NMSUengineering Show this thread", "2020-04-13T21:03:48.000Z": "UNEMPLOYMENT UPDATE  @NMDWS has announced today that New Mexicans receiving unemployment insurance will begin receiving an additional $600 per week of #COVID19 relief beginning the week of April 20th.", "2020-04-13T16:10:49.000Z": "As we reached the one-month anniversary of New Mexico's first COVID-19 case this weekend, it remains more important than ever that New Mexicans stay home.\n\nThe painful truth is that we cannot fully reopen the state before the federal government establishes widespread testing.", "2020-04-13T15:14:37.000Z": "How does the 2020 census affect your community?\nNew Mexico receives over 7 billion dollars every year\nthrough federal programs based on Census information. \nWe all benefit from a complete and accurate Census.\nComplete your Census online - Quick and easy!  https:// my2020census.gov", "2020-04-12T22:00:05.000Z": "State health officials have announced today 74 additional cases of #COVID19 in New Mexico, currently totaling 1,245 positive tests statewide.\n\nSadly, @NMDOH has also announced six new deaths related to COVID-19, bringing the total to 26.\n\nMore info here: https:// bit.ly/2xo79oA", "2020-04-12T20:30:04.000Z": "Thanks to @jaketapper & @CNNSotu for having me on this morning to talk about New Mexico's fight against the virus. I have done and will continue to do everything in my power to keep our state as healthy and as safe as we can be. Quote Tweet CNN Politics @CNNPolitics \"I'll do what's best for New Mexico,\" Gov. Michelle Lujan Grisham says when asked about reopening the state https:// cnn.it/3cdS3ko", "2020-04-12T14:52:45.000Z": "Happy Easter New Mexico! Wishing everyone a fun, safe, and healthy holiday...while we all celebrate from home. #HappyEasterSunday", "2020-04-11T23:15:05.000Z": "Today, New Mexico's public health order banning mass gatherings has been amended to include houses of worship.\n\nThe risk is simply too great. In-person services risk spreading #COVID19 , potentially affecting thousands.\n\nThis year, home is holy. Please, you MUST stay home.", "2020-04-11T22:07:38.000Z": "State health officials have announced today 86 additional cases of #COVID19 in New Mexico, currently totaling 1,174 positive tests statewide.\n\nSadly, @NMDOH has also announced one new death related to COVID-19, bringing the total to 20.\n\nMore info here: https:// bit.ly/2VoS4v1", "2020-04-11T18:20:18.000Z": "This Easter, home is the holy place. I expect all New Mexicans to stay safe by staying home to celebrate, not gathering with friends and family.\n\nTogether, we will have a safe and happy Easter - by staying apart.\n\nBUT tell the kids not to worry: the Easter Bunny is essential!", "2020-04-11T18:04:20.000Z": "Thank you @NNPrezNez for hosting this special event for the Navajo Nation!\n\nStay home, tune in, and stay safe. #StayHomeSaveLives Quote Tweet Navajo Nation President Jonathan Nez @NNPrezNez CALLING ALL HEROES TO PROTECT THE SACRED\n\nJoin us this evening as Navajo Nation President Jonathan Nez, Mark Ruffalo, Paul Rudd, Radmilla Cody, Allie Young, and Take Waititi go Facebook live at 6:00 p.m. (MDT) to help stop the spread of Dikos Nstaaígíí-19 (COVID-19).", "2020-04-10T22:22:18.000Z": "Today we have crossed the threshold of 1,000 #COVID19 cases in New Mexico. That's a scary number - it means that it is more important than EVER to strictly observe social distancing rules. #StayHomeSaveLives  #EvenOnEaster Quote Tweet Michelle Lujan Grisham @GovMLG State health officials have announced today 106 additional cases of #COVID19 in New Mexico, currently totaling 1,091 positive tests statewide.\n\nSadly, @NMDOH has also announced two new deaths related to COVID-19, bringing the total to 19.\n\nMore info here: https:// bit.ly/2VcQ4pm", "2020-04-10T20:59:34.000Z": "I know how hard it is to be uprooted from our traditions, especially our faith traditions, during this pandemic. But my THANKS to New Mexicans who are heeding the imperative to STAY HOME and make home your holy place this weekend. #StayHomeSaveLives  #AllTogetherNM  https:// twitter.com/robbrow/status /1248675342681690112  This Tweet is unavailable.", "2020-04-10T19:49:39.000Z": "News today: @NMHSD will be providing additional SNAP benefits to New Mexico households, doing everything in its power to ensure that New Mexicans do not go hungry while facing the challenges of the #COVID19 pandemic.\n\nMore information here: https:// bit.ly/2JXDaq6", "2020-04-10T17:37:36.000Z": "New Mexico: please join me in wishing World War II veteran and fellow New Mexican Ralph Wendorf a happy 100th birthday tomorrow!\n\nMake sure he feels the love on this special day by sending him your own happy birthday messages with #Happy100thRalph", "2020-04-10T16:06:18.000Z": "Did you miss the livestreamed #COVID19 update yesterday? You can watch it here: https:// facebook.com/GovMLG/videos/ 227159625191512/  The information graphics presented at yesterday's update can be found here: https:// governor.state.nm.us/april-9th-covi d-19-press-conference-graphics/   #StayHomeSaveLives  #AllTogetherNM COVID-19 Update - April 9, 2020 Governor Michelle Lujan Grisham was live. facebook.com", "2020-04-10T15:22:37.000Z": "Are you practicing social distancing but still want to participate in the upcoming NM primary? \nA great resource below: Check your voter status Sign up for an absentee ballot Receive a mail-in ballot Important deadlines Voting in the time of COVID-19 *UPDATED* In the midst of this unprecedented time, we wanted to provide a place for everyone to find out what resources were available to continue participating in our democracy to the best of your ability.  A... progressnownm.org", "2020-04-09T23:52:06.000Z": "Flattening the curve means we take a potential mountain and make it into a mesa. Let's #FlattenTheCurve and #MakeaMesa New Mexico!\n\nWhen you #StayHome you help slow the spread of #COVID19 and #SaveLives . GIF", "2020-04-10T00:18:38.000Z": "You can find the information graphics from today's #COVID19 update here: https:// governor.state.nm.us/april-9th-covi d-19-press-conference-graphics/  Quote Tweet Michelle Lujan Grisham @GovMLG I'll be joined by state officials at 4 PM this afternoon to provide an update on New Mexico's efforts in the face of the #COVID19 pandemic.\n\nYou can tune in and watch live at http:// facebook.com/GovMLG/ - you don't have to have an account to watch. #StayHomeSaveLives  #AllTogetherNM", "2020-04-09T19:00:56.000Z": "I'll be joined by state officials at 4 PM this afternoon to provide an update on New Mexico's efforts in the face of the #COVID19 pandemic.\n\nYou can tune in and watch live at http:// facebook.com/GovMLG/ - you don't have to have an account to watch. #StayHomeSaveLives  #AllTogetherNM", "2020-04-08T22:15:05.000Z": "State health officials have announced today 72 additional cases of #COVID19 in New Mexico, currently totaling 865 positive tests statewide.\n\nSadly, @NMDOH has also announced three new deaths related to COVID-19, bringing the total to 16.\n\nMore info here: https:// bit.ly/2Xm8l6E", "2020-04-08T21:14:55.000Z": "UPDATE for the self-employed from @NMDWS  NOTE: This is not the same as Pandemic Unemployment Assistance for the self-employed, contactors, & gig workers - New Mexico is still waiting to receive those funds from the federal government. We hope to have it in the next few weeks. Quote Tweet NMDWS @NMDWS NMDWS is offering a one-time $750 stimulus payment to self-employed New Mexicans affected by COVID-19, for the first 2,000 qualified applicants. Apply by creating an individual account at https:// bit.ly/3bThXtt and clicking the SESP link on your homepage. https:// bit.ly/2xcyXMs", "2020-04-08T17:52:01.000Z": "The more we stay home, the sooner we slow the spread of this virus, the sooner we get through this public health emergency. We are all feeling the burden of this pandemic - but we will get through it together. #StayHome  #AllTogetherNM", "2020-04-07T22:11:26.000Z": "State health officials have announced today 109 additional cases of #COVID19 in New Mexico, currently totaling 794 positive tests statewide.\n\nSadly, @NMDOH has also announced one new death related to COVID-19, bringing the total to 13.\n\nMore info here: https:// bit.ly/34hQD5s", "2020-04-07T20:47:55.000Z": "I'm grateful to announce today that the Stanley E. Fulton Family Foundation of Sunland Park​ has contributed $2 million to the #AllTogetherNM fund, the statewide philanthropic effort we've launched that is dedicated to COVID-19 response & relief efforts. http:// alltogethernm.org", "2020-04-07T18:21:43.000Z": "Thank you to our incredible New Mexico Teachers of the Year for putting together this message of support and solidarity. \"Though we cannot reach out with a hug or a high five right now, our mission as educators remains the same.\" https:// youtu.be/jvm3MEFmYHs  #AllTogetherNM A message from the NMTOYs ... Past and present New Mexico Teachers of the Year support our communities during this transition to distance learning. youtube.com", "2020-04-07T19:33:17.000Z": "Updates from @NMDWS regarding Unemployment Insurance:\n\nThe state has heard the concerns from workers affected by COVID-19 and is implementing the following changes to increase access for New Mexicans applying for benefits:", "2020-04-07T17:26:19.000Z": "The latest @CDCgov guidance is that cloth face coverings may provide some additional benefit and are encouraged - but do not replace aggressive social distancing, which remains the most effective method of slowing the spread of #COVID19 .\n\nHow to make a mask: The following media includes potentially sensitive content. Change settings View", "2020-04-07T15:37:25.000Z": "Questions about the updated emergency public health order?\n\nCheck the Frequently Asked Questions here: https:// cv.nmhealth.org/stay-at-home-f aqs/  The overall message remains: Stay home. Do not gather with people. Practice social distancing. #StayHomeSaveLives  #AllTogetherNM", "2020-04-07T13:59:54.000Z": "What can you do to slow/stop the spread of the Coronavirus? Minimize person-to-person contact and stay home. Protect each other, save lives and we will get through this together. #AllTogetherNM", "2020-04-06T23:00:36.000Z": "Today I finalized an emergency order extending the stay-at-home instruction and all #COVID19 public health orders through April 30th.\n\nThe order includes additional restrictions for essential businesses, including limiting the number of customers allowed in retail spaces.", "2020-04-06T22:00:59.000Z": "State health officials have announced today 62 additional cases of #COVID19 in New Mexico, currently totaling 686 positive tests statewide.\n\nMore info here: https:// bit.ly/2ULdJhU New Mexico: please, stay home. Stay vigilant. Slow the spread of COVID-19. #StayHomeSaveLives", "2020-04-06T20:52:03.000Z": "Request an absentee ballot online today! Practice social distancing while exercising your civic duty. https:// portal.sos.state.nm.us/OVR/WebPages/A bsenteeApplication.aspx   #nmpol  #BeAVoter  #2020elections  #TrustedInfo2020", "2020-04-06T19:56:41.000Z": "When we talk about #COVID19 , we talk a lot about ventilators - what are they, how do they work, and why are they so important?\n\nWe teamed up with @PresHealth , @UNMHSC , and @LovelaceHealth to explain it for you.\n\nHelp us ensure that we have enough ventilators: STAY HOME.", "2020-04-06T16:44:32.000Z": "Did you know in the last census, over 1 million kids were not counted? When you count your kids, you guarantee funding towards the education and health centers that they need to thrive. Count them today! Online, by phone or by mail. https:// bit.ly/34jxosu  #icountnm All kids need to be counted in #Census2020! Our kids look to us to protect their future. If very young Latino children are not counted in Census 2020, the right amount of funding won't reach schools, h... youtube.com", "2020-04-06T16:41:01.000Z": "While saving lives remains priority number one, we know that New Mexico businesses are feeling the effects of the #COVID19 crisis particularly hard. @NMecondev has created a way for New Mexicans to continue to support our small businesses: Buy for Tomorrow Today.", "2020-04-06T15:32:02.000Z": "La salud y la seguridad de tu comunidad depende de ti, incluidos los trabajadores de salud, tus vecinos y tu familia.\n \nQuédate en casa para protegerte y proteger a otros.\n \nQuédate en casa para mitigar la propagación del virus #COVID19 .", "2020-04-05T22:10:45.000Z": "State health officials have announced today 81 additional cases of #COVID19 in New Mexico, currently totaling 624 positive tests statewide.\n\nSadly, @NMDOH has also announced one new death related to COVID-19, bringing the total to twelve.\n\nMore info here: https:// bit.ly/2xNiheH", "2020-04-05T00:01:20.000Z": "A positive note: as of today, there are currently 54 people in New Mexico designated as having recovered from #COVID19 .\n\nEvery person fighting this terrible virus is in my prayers, as are the loved ones of those we have lost to the illness. #AllTogetherNM", "2020-04-04T23:20:06.000Z": "The state is encouraging New Mexico small businesses in financial distress due to the #COVID19 crisis to apply for loans made available by the federal stimulus bill as soon as possible.\n\nThe funds for small businesses allocated by the stimulus bill are first-come, first serve.", "2020-04-04T22:47:52.000Z": "Today's announced cases include additional positive tests from the La Vida Llena long-term care facility in Albuquerque, where 5 additional residents and 8 additional staff members have now tested positive for #COVID19 .", "2020-04-04T18:45:27.000Z": "Wondering about masks or face coverings?\n\nThe latest @CDCgov guidance is that cloth face coverings may provide some additional benefit and are encouraged - but do not replace aggressive social distancing, which remains the most effective method of slowing the spread of #COVID19 .", "2020-04-04T17:23:53.000Z": "What a wonderful message from @UNMHSC - I couldn't agree more.\n\nPlease, stay home, and do your part to ensure that New Mexico's hardworking health care staff can stay safe at work and continue to save lives.\n\nNew Mexicans will get through this together. #AllTogetherNM Quote Tweet UNM HSC @UNMHSC New Mexico's greatest strength is it's people - uncommon in our diversity, and yet proud and protective of our common identity. \n\nYou might feel vulnerable or uncertain, but you need only take one big step forward. We are resilient. We care for others. We are New Mexicans.", "2020-04-04T17:19:29.000Z": "Helpful #COVID19 information from @PresHealth  Quote Tweet Presbyterian @PresHealth If you have coronavirus symptoms which include fever and dry cough - Presbyterian is providing free screenings to everyone through Video Visits and Online Visits. To get screened, visit http:// phs.org/COVID-19 . https:// youtube.com/watch?v=HjcDrd Cp4Lk#action=share ", "2020-04-04T00:15:38.000Z": "Today @NMDOH and @cabq announced a COVID-19 outbreak and related deaths at the La Vida Llena long-term care facility in Albuquerque. While we've been preparing for such an incident, the news still comes as a shock. Let me assure you that NMDOH is taking immediate measures.", "2020-04-03T23:01:55.000Z": "State health officials have announced today 92 additional cases of COVID-19 in New Mexico, currently totaling 495 positive tests statewide. @NMDOH has also announced three additional deaths related to COVID-19, bringing the total to ten.\n\nMore info here: https:// bit.ly/2wRX0jX", "2020-04-03T18:30:03.000Z": "I'll be joined by state officials at 3 PM this afternoon to provide an update on New Mexico's efforts in the face of the COVID-19 pandemic.\n\nYou can tune in and watch live at http:// facebook.com/GovMLG/ - you don't have to have an account to watch. #StayHomeSaveLives  #AllTogetherNM", "2020-04-02T22:03:25.000Z": "State health officials have announced today 40 additional cases of COVID-19 in New Mexico, currently totaling 403 positive tests statewide. @NMDOH has also announced one additional death related to COVID-19, bringing the total to seven. \n\nMore info here: https:// bit.ly/2UDJfhG", "2020-04-02T20:21:08.000Z": "In case you missed it you can see answers to today's Q&A questions tagged w/ #AskGovMLG .\n\nYou can find information about COVID-19 here: https:// cv.nmhealth.org You can find information about resources for New Mexicans here: https:// newmexico.gov  #StayHomeSaveLives", "2020-04-02T14:45:25.000Z": "New Mexico: do you have questions about #COVID19 ?\n\nI'm participating in a nationwide #AsktheGov Twitter Q&A today at noon.\n \nReply below or tweet your question with #AskGovMLG", "2020-04-01T22:11:31.000Z": "State health officials have announced today 48 additional cases of COVID-19 in New Mexico, currently totaling 363 positive tests statewide. @NMDOH has also announced one additional death related to COVID-19, bringing the total to six.\n\nMore info here: https:// bit.ly/2UAGiyo", "2020-04-01T19:00:24.000Z": "UPDATE: Thanks to increased statewide testing capacity, @NMDOH has announced expanded testing criteria for COVID-19.\n\nTesting criteria will expand to include asymptomatic people who are:\n- Close contacts of positive cases\n- In nursing homes\n- In congregant living settings", "2020-04-01T18:17:34.000Z": "This is true New Mexico spirit: stepping up to help families in need.\n\nI am profoundly grateful to everyone all across the state, in the film & TV industry and well beyond, who is chipping in and helping our neighbors in need during this crisis. 'Stranger Things' star donates 20,000 meals to The Food Depot in Santa Fe Communities far and wide continue to come together during the COVID-19 pandemic. ... abqjournal.com", "2020-04-01T17:40:38.000Z": "New Mexico: do you have questions about #COVID19 ?\n\nI'll be participating in a nationwide #AsktheGov Twitter Q&A tomorrow, Thursday, April 2 at noon.\n \nReply below or tweet your question with #AskGovMLG", "2020-03-31T21:23:55.000Z": "New Mexico: Let's ensure that every child is counted. Have you completed your #2020Census yet? #ICountNM", "2020-04-01T16:42:54.000Z": "Did you miss our New Mexico COVID-19 update yesterday? You can watch it here: https:// bit.ly/3dLuIYG The main takeaway? Social distancing is the most meaningful tool we have. The less transmission of COVID-19, the more lives we'll save.\n\nStay home. Save lives. #AllTogetherNM", "2020-04-01T15:36:46.000Z": "It's #CensusDay New Mexico!\n\nTaking 10 minutes to complete the #2020Census is one of the most important things you can do for your community - it ensures federal funding across New Mexico for things like roads, schools, and health care.\n\nGet counted today! http:// 2020census.gov Quote Tweet ICountNM @ICountNM What do New Mexicans think of filling out the #2020Census ? \"Easy Peasy\". Take 15 minutes to complete your #2020Census online TODAY! It's fast, it's safe, it's important! Your community is depending on you. Get counted today! https:// 2020census.gov  @GovMLG", "2020-04-01T14:04:46.000Z": "Remember this is a marathon, not a sprint New Mexico. Let's continue to practice all of the safety guidelines and protect each other everyday. We'll get through this together. #AllTogetherNM  #StayHomeSaveLives New Mexico got aggressive start on testing for virus State lags behind only those with serious outbreaks abqjournal.com", "2020-03-31T19:05:32.000Z": "I'll be joined by state officials this afternoon to provide an update on New Mexico's efforts in the face of the COVID-19 pandemic.\n\nYou can tune in and watch live at http:// facebook.com/GovMLG/ - you don't need to have a Facebook account to watch. #StayHomeSaveLives  #AllTogetherNM", "2020-03-31T15:31:33.000Z": "It's great news that more New Mexicans will soon be eligible for Pandemic Unemployment Assistance - but those funds have not yet come through from the federal government. Announcements will be made when benefits are available in a few weeks.\n\nMore info: http:// jobs.state.nm.us Quote Tweet NMDWS @NMDWS The stimulus bill expands UI benefits, and we are setting up our system to process these Pandemic Unemployment Assistances (PUA) claims. There is no need to call the UI Operations Center at this time as the Department will announce when PUA claims can be filed. #AllTogetherNM", "2020-03-30T22:19:24.000Z": "State health officials have announced today 44 additional cases of COVID-19 in New Mexico, currently totaling 281 positive tests statewide. @NMDOH has also announced two additional deaths related to COVID-19, bringing the total to four.\n\nMore info here: https:// bit.ly/2UsAcjC", "2020-03-30T20:24:39.000Z": "Today I received a wonderful and helpful message from a New Mexican that I'd like to share:\n\n\"Today I am very proud to be from New Mexico. Last Monday I woke up sick as a dog with symptoms that, as they played out over the week, were scaring me.\" (1/4)", "2020-03-30T18:12:45.000Z": "New Mexicans across the state have risen to the occasion, stepping up to meet the needs of their communities in these uncertain times. I'm certainly not surprised, and I am so proud of the wonderful people that call this great state home. #AllTogetherNM NM businesses step up in tough times Grants for aid groups, meals for idled workers abqjournal.com", "2020-03-30T18:06:26.000Z": "To each and every doctor and medical professional putting his or her life at risk to save the lives of others, we thank you and we pray for you now more than ever.\nJoin us and #ThankADoctor today! #NationalDoctorsDay", "2020-03-28T21:38:23.000Z": "State health officials have announced today 17 additional cases of COVID-19 in New Mexico, currently totaling 208 positive tests statewide. \n\nThey have also announced one additional death related to COVID-19, bringing the total to two.\n\nMore info here: https:// bit.ly/2QPSGII", "2020-03-28T18:10:21.000Z": "Since school closure started, New Mexico public schools have served more than one million free meals to young New Mexicans AND WE WILL KEEP GOING! #AllTogetherNM", "2020-03-28T19:40:07.000Z": "The only way to save lives & not overwhelm our healthcare system is by slowing the spread of COVID-19.\n\nThe only way to slow the spread of COVID-19 is by staying home & minimizing person-to-person contact.\n\nNew Mexicans are instructed to stay home unless absolutely essential.", "2020-03-28T17:25:51.000Z": "Important information from @NMDWS today to streamline the filing system for unemployment insurance:\n\nPLEASE start by filing online at http:// jobs.state.nm.us if you are able. This ensures that those who can't get online can still access their resources via the phone lines.", "2020-03-28T16:08:38.000Z": "Did you miss my update yesterday evening? No worries - you can watch it right here: https:// facebook.com/GovMLG/videos/ 877285956090614/  Quote Tweet Michelle Lujan Grisham @GovMLG Hey New Mexico - I'm jumping on Facebook live around 5pm tonight to talk directly to you about the changes we've seen in the past few days and the state's response to COVID-19. You don't have to have a Facebook account to watch - tune in here: http:// facebook.com/GovMLG/", "2020-03-27T21:00:09.000Z": "Today I issued an executive order requiring anyone traveling into New Mexico by plane to self-isolate for at least 14 days in order to help combat the spread of COVID-19. Those who fail to voluntarily self-isolate will be subject to forced isolation or quarantine by @NMDOH .", "2020-03-27T16:31:52.000Z": "We know this has tremendous implications for families & students statewide. This is part of a two-pronged plan my admin. is crafting to protect New Mexicans from COVID-19 & ensure that children are protected, fed & educated & that families are supported through this crisis.", "2020-03-26T22:08:50.000Z": "State health officials have announced today 24 additional cases of COVID-19 in New Mexico, currently totaling 136 positive tests statewide.\n\nMore information here: https:// bit.ly/3dzRdzE All New Mexicans are instructed to stay home unless absolutely essential. #AllTogetherNM", "2020-03-26T21:02:33.000Z": "I'm thrilled to announce today a new statewide fund established by the New Mexico Coalition of Community Foundations to help New Mexicans respond to and eventually recover from the COVID-19 pandemic: the #AllTogetherNM Fund.", "2020-03-26T19:30:01.000Z": "It is critical that New Mexicans understand that the only way to slow the spread of COVID-19 is to stay home. \n\nThis virus affects everyone, both young & old. Every New Mexican is susceptible.\n\nProtect yourself & your community by staying home. #AllTogetherNM  #StayHomeSaveLives", "2020-03-26T15:56:04.000Z": "In times of crisis, it's important to maintain social connections. Physical distance doesn't mean isolation. Reach out to friends and family. If you need someone to talk to, call toll-free anytime: 1-855-NMCRISIS. That's 1-855- 662-7474. We are #AllTogetherNM", "2020-03-26T18:21:08.000Z": "New Mexico continues to work to increase testing capacities statewide - I am grateful to our partners in that effort.\n\nI will not stop advocating for additional resources & supplies from the federal government to expand testing across the state. Lab announces increased COVID-19 testing capacity TriCore Reference Laboratories announced the addition of a new machine that will double the private labs' COVID-19 testing capacity. The release from the City of Albuquerque's Emergency Management  nmpoliticalreport.com", "2020-03-26T15:30:09.000Z": "I am glad there has been progress on stimulus legislation in Congress; the funding provided in this bill is critical to our efforts to immediately and proactively respond to this virus. #AllTogetherNM  #COVID19 Bipartisan Stimulus Agreement Contains Significant Funds for States The emerging bipartisan agreement on the Senate's economic emergency legislation contains very significant new resources to help states address their massive, immediate budget problems due to cbpp.org", "2020-03-25T23:17:26.000Z": "The hardworking state employees of the @NMDOH State Laboratory are working around the clock - literally, they are working 24/7 - to process as many COVID-19 tests as possible and get New Mexicans the essential health information they need. Please join me in thanking them!", "2020-03-25T22:23:20.000Z": "State health officials have announced today 13 additional cases of COVID-19. More information here: https:// bit.ly/2UkjYsP All New Mexicans are instructed to stay home unless essentially necessary. Stay home. Save lives. #AllTogetherNM", "2020-03-25T20:02:07.000Z": "The threat of COVID-19 is real.\n\nThe only thing we can do to slow the spread is to stay home.\n\nProtect yourself and your fellow New Mexicans: STAY HOME.\n\nWe will get through this together. #AllTogetherNM", "2020-03-25T18:03:30.000Z": "In an effort to reach as many New Mexicans as possible with essential COVID-19 info, we will be using the statewide emergency alert system. The first message will go out at 12:30 p.m. today. The system is being used to get information out widely and is not a cause for alarm.", "2020-03-25T17:57:26.000Z": "Important information from the Supreme Court regarding the temporary moratorium on evictions: \n\nTenants will need to provide the court with evidence of their current inability to pay rent by participating in a hearing set by the judge.\n\nMore info here: https:// nmcourts.gov/news.aspx Quote Tweet Michelle Lujan Grisham @GovMLG The state will not abandon New Mexicans during this trying time. Evictions for inability to pay rent have been temporarily halted statewide during the COVID-19 public health emergency. #AllTogetherNM twitter.com/nmcourts/statu", "2020-03-25T16:05:12.000Z": "It brings me great sorrow to tell you that we have lost a New Mexican to COVID-19. My thoughts and prayers are with the family and friends who are grieving this sudden loss.", "2020-03-24T22:11:30.000Z": "State health officials have announced today 17 additional cases of COVID-19 in New Mexico, currently totaling 100 positive tests statewide.\n\nMore information here: https:// bit.ly/2Uy5V1E Do your part to protect yourself and your community: STAY HOME. #AllTogetherNM", "2020-03-24T19:17:08.000Z": "Today I joined the State Investment Council in voting unanimously to create a $100 million dollar New Mexico Recovery Fund, providing accessible, short-term loans to New Mexico businesses affected by the ongoing COVID-19 emergency. #AllTogetherNM SIC approves creation of $100M recovery fund Initiative to provide discounted, short-term loans to struggling NM businesses abqjournal.com", "2020-03-24T18:42:32.000Z": "The state will not abandon New Mexicans during this trying time. Evictions for inability to pay rent have been temporarily halted statewide during the COVID-19 public health emergency. #AllTogetherNM Quote Tweet New Mexico Courts @nmcourts The New Mexico Supreme Court orders a temporary moratorium on evictions for inability to pay rent during the COVID-19 public health emergency. https:// bit.ly/2WFby0B  #nmcourts  #newmexico", "2020-03-24T18:23:55.000Z": "What Other States Can Learn From New Mexico's Coronavirus Response |... New Mexico Gov. Michelle Lujan Grisham explains why, despite the low number of confirmed coronavirus cases in her states, she's taking aggressive action incl... youtube.com", "2020-03-24T17:10:04.000Z": "Effective this morning, New Mexico is under a statewide stay-at-home instruction. All New Mexicans are instructed to stay at home except for outings essential to health, safety, and welfare.\n\nStay home. Save lives. #AllTogetherNM Gov. issues 'stay at home' order All 'nonessential' businesses statewide ordered to close abqjournal.com", "2020-03-24T17:00:21.000Z": "Essential voting information from the @NMSecOfState  Quote Tweet New Mexico Secretary of State @NMSecOfState Update your voter registration: https:// voterportal.servis.sos.state.nm.us/WhereToVote.as px  Request an absentee ballot: https:// portal.sos.state.nm.us/OVR/WebPages/A bsenteeApplication.aspx  Contact your County Clerk: https:// sos.state.nm.us/voting-and-ele ctions/voter-information/county-clerk-information/   #nmpol  #TrustedInfo2020", "2020-03-24T13:52:37.000Z": "Guidance for child care providers amidst @GovMLG 's \"stay at home\" order: https:// cyfd.org/news-events/ne ws/ececd-offers-guidance-for-child-care-providers-amidst-stay-at-home-order ", "2020-03-24T15:39:09.000Z": "The \"stay-at-home\" rules ordered by @GovMLG are the most effective way for us to reduce the spread of the coronavirus and protect the health of our friends, our neighbors, and our family members.", "2020-03-23T21:50:09.000Z": "Today I am announcing that effective tomorrow at 8 AM, New Mexico will be under a statewide stay-at-home instruction. All New Mexicans are instructed to stay at home except for outings essential to health, safety, and welfare. #AllTogetherNM  #coronavirus", "2020-03-23T18:25:34.000Z": "Today at 3 PM I will be joined by state officials to give a public update on the state's response to COVID-19 and to make an announcement regarding a statewide stay-at-home instruction. #AllTogetherNM", "2020-03-23T15:30:03.000Z": "While students across the state are home from school today, cafeteria workers, education personnel, & childcare providers statewide have mobilized to ensure that New Mexico children continue to be fed. Join me in thanking them & every New Mexican who has stepped up for NM kids!", "2020-03-23T15:31:20.000Z": "As New Mexican families adjust to keeping our kids productive at home, there are some great free online educational materials from the Smithsonian Museum. Learn, explore and have fun! For Kids and Teens Learn more about Fun Stuff for Kids and Teens si.edu", "2020-03-22T23:47:46.000Z": "State health officials have announced today eight additional cases of COVID-19 in New Mexico, currently totaling 65 positive tests statewide. More information here: https:// bit.ly/2UagWqK Do your part to protect yourself & your community -STAY HOME unless absolutely necessary.", "2020-03-22T17:06:23.000Z": "An easy and important thing to do while you're staying at home to protect your community: fill out the #2020Census ! An accurate count is essential for adequate federal funding for New Mexico. Do your part and get counted at http:// my2020census.gov  #icountnm  #AllTogetherNM Quote Tweet ICountNM @ICountNM Are you stuck at home looking for something to do? Get Counted! You can respond online and it take about 10 minutes! It's easy. It's online. It's important. Let's do this New Mexico! https:// my2020census.gov  #icountnm  #completecountnm  @GovMLG", "2020-03-21T21:21:59.000Z": "New Mexico: it is absolutely essential that we all stay home in order to slow the spread of COVID-19.\n\nThe health of your community depends on the actions you take. It's as simple and as serious as that.\n\nPlease stay home when at all possible. Together, we will get through this.", "2020-03-21T20:38:43.000Z": "If your employment has been affected by COVID-19, you may be eligible for unemployment insurance. Follow this step-by-step video from @NMDWS that guides you through the process of applying online. #AllTogetherNM Quote Tweet NMDWS @NMDWS @NMDWS has created an easy to follow step-by-step guide on setting up your new account on http:// jobs.state.nm.us , and how to access the UI to file an inital claim for benefits. https:// youtu.be/ckVseXSDNCA  #AllTogetherNM  #UIBenefits  #NewMexico  #MYUI  #COVID19", "2020-03-21T20:15:16.000Z": "State health officials have announced today fourteen additional cases of COVID-19 in New Mexico, currently totaling 57 positive tests statewide. More information here: https:// bit.ly/3bdMrGc", "2020-03-21T17:46:50.000Z": "Statewide Senior Shopping Hours:\n\nSmith's for Seniors:\nMonday, Wednesday, & Friday\n7:00 AM - 8:00 AM\n\nAlbertson's for Seniors:\nMonday and Thursday\n7:00 AM - 9:00 AM\n\nDo you know of other grocery stores with senior hours? Share their info below ↓ #AllTogetherNM", "2020-03-21T17:20:47.000Z": "Looking for ways to keep busy while you're staying home to help slow the spread of COVID-19? There are many wonderful resources for both adults and children to fight boredom, including from state agencies! Check here for more tips: https:// bit.ly/398QqSX", "2020-03-21T15:44:16.000Z": "Thanks @LtGovMorales ! Filling out the #2020Census will ensure that New Mexico continues to receive critical federal funding for our roads, schools, & health care. While you're staying home to slow the spread of COVID-19, make sure to fill out your Census! http:// icountnm.gov Quote Tweet Lt. Governor Howie Morales @LtGovMorales I received the #2020Census in my mailbox this week & filled it out online in less than 10 minutes. Since we're all staying inside to stop the spread of #coronavirus , it's a great time to complete the #Census now. Everyone in #NewMexico deserves to be counted. Fill it out today!", "2020-03-20T19:54:00.000Z": "I'd like to thank New Mexico's congressional delegation for advocating on behalf of the state and pushing the federal government to release New Mexico's full allotment of personal protective equipment from the national stockpile, critical to ensuring adequate supplies.", "2020-03-20T19:18:32.000Z": "Yesterday alone, @NMPED & school districts across the state distributed nearly 120,000 breakfasts & lunches to kids. THANK YOU to the cafeteria workers, educators, & school personnel who are working together to ensure that New Mexico children continue to be fed! #AllTogetherNM", "2020-03-20T17:30:06.000Z": "New Mexico - please join me in thanking those New Mexicans on the frontlines of the COVID-19 pandemic: health care workers, child care providers, first responders, grocery store workers, school personnel, state & local government employees, & corrections officers. #AllTogetherNM", "2020-03-20T15:53:08.000Z": "Announced today: New Mexicans will have an extra 90 days to file and pay their 2019 personal income taxes due to the ongoing COVID-19 public health emergency. State income, as well as state payroll taxes, will now be due July 15. More info: https:// newmexico.gov/2020/03/20/new -mexico-extends-income-and-payroll-tax-deadlines/ ", "2020-03-19T21:13:39.000Z": "New Mexico: We are depending on YOU to slow the spread of COVID-19. \n\nThe more we do on the front end, the sooner we get through it.\n\nThe safer you are, the better we'll be and the more ready we'll be to stand up our small businesses and our economy again. #AllTogetherNM", "2020-03-19T19:26:17.000Z": "State health officials have announced today that seven more people in New Mexico have tested positive for COVID-19, currently totaling 35 positive tests statewide. More information here: http:// bit.ly/2U3yVPJ", "2020-03-19T16:37:55.000Z": "Need some tips to keep the kids busy and learning at home? The key is...routines! Find out more below. The Secret to Keeping Kids Happy, Busy and Learning at Home School closures due to coronavirus have parents wondering what they're going to do all day time.com", "2020-03-19T00:18:05.000Z": "UPDATE Today @NMDOH Secretary Kathy Kunkel has strengthened previously issued public health order to include additional mandatory closures and guidelines to stem the spread of COVID-19 in New Mexico. : http:// bit.ly/3aZT6no", "2020-03-18T19:55:03.000Z": "State health officials @NMDOH have announced today that five more people in New Mexico have tested positive for COVID-19, currently totaling 28 positive tests statewide.\nMore information here: http:// bit.ly/3b7WsF0  #coronavirus", "2020-03-18T16:24:15.000Z": "#ICYMI We've gotten a lot of questions re: absentee voting in NM. Check out the FAQ below. NOTE: Requesting an abs ballot online is not yet available for the June primary but will be ASAP in light of the public health emergency. https:// sos.state.nm.us/2020/03/16/faq -absentee-voting-for-the-2020-primary-election/   #nmpol  #TrustedInfo2020", "2020-03-18T16:25:20.000Z": "Important public health guidelines:\n\n- Only get tested for COVID-19 if you are currently exhibiting symptoms (fever, cough, shortness of breath)\n\n- Only enter emergency departments if you have emergent symptoms\n\n- Self-isolate for 14 days if you travel into NM from out of state", "2020-03-18T18:23:50.000Z": "Live now: http:// sg001-harmony.sliq.net/00293/Harmony/ en/PowerBrowser/PowerBrowserV2/20200318/-1/66410  Quote Tweet Michelle Lujan Grisham @GovMLG Today at noon I will be joined by state officials to give the public an update on New Mexico's response to COVID-19.\n\nIt will be streamed live on my Facebook page at http:// facebook.com/GovMLG and on the http:// nmlegis.gov website -> click the \"webcast\" tab. #AllTogetherNM", "2020-03-17T22:20:04.000Z": "Attention New Mexico businesses: my administration has secured @SBAgov Disaster Loan Assistance for businesses affected by the COVID-19 pandemic. New Mexico moved quickly to ensure support for local businesses and is one of the first states to secure this loan program statewide.", "2020-03-17T20:03:13.000Z": "Need information about the absentee ballot process in New Mexico for the upcoming primary election? We have you covered with this FAQ. https:// sos.state.nm.us/2020/03/16/faq -absentee-voting-for-the-2020-primary-election/   #nmpol  #TrustedInfo2020", "2020-03-17T18:42:13.000Z": "Many New Mexicans are asking how they can help during the COVID-19 pandemic. We're going to get through this together - here are some suggestions on how you can help: http:// bit.ly/38XA5jV  #AllTogetherNM", "2020-03-17T16:44:07.000Z": "La página de inicio dedicada a @NMDOH COVID-19 ahora está disponible en español. Es fundamental que todos tengan esta información para protegerse y proteger a sus seres queridos - comparte con todas las comunidades hispanohablantes a través del estado: https:// cv.nmhealth.org/spanish/", "2020-03-17T16:39:39.000Z": "The dedicated @NMDOH COVID-19 home page is now available in Spanish. It's critical that all New Mexicans have this information in order to protect themselves and their loved ones - please share with all Spanish-speaking communities around the state: https:// cv.nmhealth.org/spanish/", "2020-03-17T16:25:30.000Z": "New Mexico state health officials @NMDOH have announced this morning that two more people in New Mexico have tested positive for COVID-19, currently totaling 23 positive tests statewide. More information: http:// bit.ly/38Wga58  #coronavirus", "2020-03-17T13:13:30.000Z": "Please share far and wide! http:// newmexico.gov now has a dedicated Early Childhood page, with resources for both families and providers. Please continue sending your questions, and we will do our best to provide answers as quickly as possible. https:// newmexico.gov/early-childhoo d/ ", "2020-03-17T13:55:53.000Z": "", "2020-03-16T21:23:52.000Z": "New Mexico state health officials @NMDOH have announced today four more New Mexico residents who have tested positive for COVID-19, bringing the state's total positive tests for the novel coronavirus to 21. https:// cv.nmhealth.org", "2020-03-16T20:23:11.000Z": "New Mexico: We are in this together. Please remember we are in a public health emergency. Please stay home as much as possible. Please buy only what you need at the store. We will do everything we can to weather the storm. #AllTogetherNM", "2020-03-16T18:01:42.000Z": "Usted puede detener la propagación de gérmenes.", "2020-03-16T15:38:20.000Z": "ATTN: Parents and guardians who need child care, please read and share this information about what the state is doing & making available as we respond to COVID-19. #AllTogetherNM  https:// cyfd.org/news-events/ne ws/new-mexico-expands-child-care-eligibility-guarantees-payments-for-child-care-providers-during-public-health-emergency ", "2020-03-16T01:55:55.000Z": "Attention New Mexico families! Check here for all the information you need about how to access meal sites for children while classes are canceled, starting tomorrow, Monday, March 16: https:// newmexico.gov/education/", "2020-03-15T23:24:02.000Z": "Tomorrow, @NMDOH Secretary Kunkel will be amending the existing public health order regarding public gatherings, adding new restrictions to limit COVID-19 spread. Beginning tomorrow morning at 9 AM, eateries & bars shall operate at no greater than 50% of their maximum occupancy.", "2020-03-14T21:45:08.000Z": "Together we can stop the spread of germs.\n\nDisinfect frequently used items and surfaces,\nWear a mask if you are sick.\nCover your mouth when you cough and sneeze.\nWash your hands (20 seconds) or use an alcohol-based rub.", "2020-03-14T21:46:20.000Z": "State health officials @NMDOH have announced three more New Mexico residents who tested presumptive positive for COVID-19.\n\nThere have currently been:\n- 6 cases in Bernalillo Co.\n- 2 cases in Sandoval Co.\n- 3 cases in Santa Fe Co.\n- 2 cases in Socorro Co. http:// bit.ly/2IK2jUI", "2020-03-13T23:59:04.000Z": "APS has identified 89 sites where students will be able to pick up Grab & Go Meals during the school closure. Thank you @ABQschools for springing into action to ensure our students have meal continuity! Summer Grab and Go Meals Beginning June 1, meal distribution will take place through the city and county in partnership with Albuquerque Public Schools. aps.edu", "2020-03-14T01:32:21.000Z": "New Mexico, we've had a hard week - but we're resilient, are we're getting through it together. I want to ask you to please consider your fellow New Mexicans, your neighbors, when you're going out to shop - please buy only what you need. Thank you for your compassion & kindness.", "2020-03-13T21:00:32.000Z": "Beginning Monday, March 16, New Mexico K-12 public schools will close for three weeks to mitigate the risk of community spread of COVID-19. While the closing is currently effective through April 3, it may be extended as conditions warrant. #NMgov  #NMed  #coronavirus", "2020-03-13T18:21:21.000Z": "Thank you Tessa. To clarify: this hotline will be up and running in a matter of hours. The state is moving quickly as the COVID-19 situation continues to change. #coronavirus Quote Tweet Tessa Mentus @TessaMentus PLEASE SHARE #NewMexico 1-833-551-0518 is number to call for help with child care, food, supplies or loss of income due to #COVID19 closures. 1-855-600-3453 is number to call for health info or if you believe you have COVID19. @KOB4", "2020-03-13T17:57:22.000Z": "New Mexico state health officials @NMDOH have announced this morning four more New Mexico residents who tested presumptive positive for COVID-19, adding to the six presumptive positive tests earlier this week.\nMore information: http:// bit.ly/2TNFIwV  #coronavirus", "2020-03-13T16:03:40.000Z": "Tune in for our 10 AM press conference on the closing of New Mexico schools and an update in COVID-19 in the state. Michelle Lujan Grisham @GovMLG ‪Tune in for our 10 AM press conference on the closing of New Mexico schools and an update in COVID-19 in the state.‬ pscp.tv", "2020-03-13T00:24:34.000Z": "Tomorrow we will be announcing that New Mexico K-12 public schools will close for three weeks beginning Monday. Please tune in to our news conference at 10 AM tomorrow morning, which will be streamed live here. #NMgov  #NMed  #coronavirus  : http:// bit.ly/2wPTzK0", "2020-03-12T21:30:38.000Z": "I'm glad to announce that @TriCoreLabs is now able to test for COVID-19, the novel #coronavirus . @NMDOH and TriCore have worked together tirelessly to get their testing started, which will significantly increase testing capacity in New Mexico. https:// governor.state.nm.us/2020/03/12/new -mexico-announces-expanded-testing-for-covid-19/ ", "2020-03-12T16:32:05.000Z": "Today @NMDOH Secretary Kathy Kunkel has issued a public health order suspending gatherings of 100 or more people in a single space, solidifying the guidance I gave yesterday as to large events and ensuring that New Mexicans are prepared and proactive. #coronavirus", "2020-03-12T00:55:04.000Z": "Today @NMDOH and I issued stronger precautionary steps New Mexicans should take in the face of the novel #coronavirus . This is a rapidly evolving situation, and New Mexicans should follow best practices to minimize the risk of community exposure. Don't panic, but prepare.", "2020-03-08T22:16:40.000Z": "Happy International Women's Day!!! Keep paving the road and continue to inspire present and future generations of all women. #IWD2020", "2020-03-08T16:01:41.000Z": "With spring break approaching I encourage everyone to enjoy the beautiful landscapes, cultures and cuisine that New Mexico has to offer! New Mexico is the ideal family spring break road trip - Lonely Planet New Mexico - the Land of Enchantment - offers surreal landscapes, vibrant cultures, ancient sites and adventurous cuisine, making it a perfect family road lonelyplanet.com", "2020-03-07T01:50:04.000Z": "How to stop the spread of germs: avoid contact with people who are sick; cover your cough or sneeze with a tissue (and throw it away); wash your hands for 20 seconds; stay home when sick (except to get medical care); clean and disinfect frequently used items.", "2020-03-06T21:11:07.000Z": "I'm proud to continue the support ensuring the 2020 New Mexico Census is a success! Allocating an additional $8 million to provide partners and communities with the resources they need to achieve a complete and accurate count of New Mexico. #nmcounts2020  https:// ladailypost.com/governor-signs -senate-bill-4-delivering-additional-8-million-to-new-mexico-census-efforts/ ", "2020-02-28T16:09:08.000Z": "We're funding the future! I am incredibly proud to have signed legislation creating the New Mexico Early Childhood Trust Fund into law. Investments in our earliest learners will transform our public education system. The time is now! TUES: Governor Signs Bill Creating Early Childhood Trust Fund, + More New Mexico OK's Trust Fund For Early Childhood Initiatives - Associated Press New Mexico Gov. Michelle Lujan Grisham has signed legislation that she says kunm.org", "2020-01-20T18:36:05.000Z": "Such an honor to join so many incredible community leaders at the 24th annual Dr. Martin Luther King Jr. commemorative breakfast in Albuquerque, honoring and reflecting on a once-in-a-generation man and his fight to end poverty and see justice for all. #MLKDay  #NMgov", "2019-12-31T22:30:07.000Z": "2020 is sure to bring more good news for New Mexico - I can't wait to keep working to improve the lives of New Mexicans all across the state. It's the privilege of a lifetime to get to work for you, New Mexico. Thank you for an incredible first year in office! #NMgov", "2019-12-24T23:35:38.000Z": "Whether you call them luminarias or farolitos, I'm wishing you a warm and safe Christmas Eve!", "2019-12-23T01:00:03.000Z": "#HappyHanukkah to all those beginning their celebrations tonight!", "2019-12-11T15:13:03.000Z": "New Mexico's Outdoor Recreation Division promotes our picturesque mountains, rivers & trails by supporting entrepreneurs with great ideas on how to expand our outdoor economy. #InternationalMountainDay  https:// abqjournal.com/1397158/new-gr ants-aim-to-build-outdoor-companies-in-nm.html?utm_source=abqjournal.com&utm_medium=sidebar+-+post+list+-+balloons&utm_campaign=post+list ", "2019-12-10T23:12:03.000Z": "Interested in working for the state of New Mexico? Explore job openings at state agencies when you attend our 4-day rapid-hire event at Tingley Coliseum, Expo New Mexico, Albuquerque, from Dec. 11-14, 2019. https:// abqjournal.com/1397604/govern or-announces-multi-day-job-fair-to-fill-state-vacancies.html?utm_source=abqjournal.com&utm_medium=sidebar+-+post+list+-+balloons&utm_campaign=post+list ", "2019-12-10T15:13:04.000Z": "We stand up for human rights. That means we work to end racism, hate speech, bullying, discrimination, & climate change -- not just on #HumanRightsDay , but every day. #StandUp4HumanRights", "2019-12-08T19:10:01.000Z": "Community members are doing great work rebuilding mental health services in Bernalillo County with a hopeful Behavioral Health Initiative. They have launched 20+ life-saving mental health programs so far. The progress they've made is truly honorable. OPINION | County is fixing its behavioral health system OPINION | Reigniting a regional behavioral health system that was gutted in 2013 is challenging. For that, I e ... abqjournal.com", "2019-12-05T02:50:02.000Z": "A new shared stewardship agreement with the @forestservice will enable us to more effectively fight wildfire & preserve our forests, better protecting New Mexico residents and safeguarding our wildlife. https:// santafenewmexican.com/news/local_new s/new-mexico-forest-service-team-up-on-stewardship/article_61663faa-e736-5a83-b6ac-f9cdaa0c1828.html ", "2019-12-03T19:10:01.000Z": "Tourism fosters community & economic growth. That's why it's so exciting to read that the industry in New Mexico grew 7% in 2018 over previous years. Come visit our beautiful state! https:// abqjournal.com/1394857/gatewa y-to-growth.html   #newmexicotrue", "2019-12-01T23:12:02.000Z": "Are you wondering how we will reduce New Mexico's greenhouse gas emissions by 45% in the next 21 years? Get up to date about our Climate Change Task Force's 2019 Climate Strategy Report: https:// climateaction.state.nm.us  #NMActOnClimate", "2019-11-29T15:13:03.000Z": "New Mexico is proud to be home to unique Native heritage and culture. Celebrate the culmination of #NativeAmericanHeritageMonth at these historic New Mexico sites. https:// newmexico.org/native-america n-heritage-month/ ", "2019-11-28T15:13:02.000Z": "I hope you have a joyful Thanksgiving surrounded by those you love. I'm grateful for the opportunity to serve as your Governor. Thank you, New Mexico.", "2019-11-27T17:25:05.000Z": "We all lose if we don't each get counted in the 2020 Census. New Mexico is at the highest risk of an undercount, which would mean losing out on hundreds of millions of dollars of federal funds for health care, education & food assistance. Quote Tweet ICountNM @ICountNM #NewMexicoSeniors count! #2020Census data is used to fund programs like Medicaid, Medicare Part B, Supplemental Nutrition Assistance Program (SNAP), & Section 8 Housing Choice Vouchers. Let's make sure every #NMSenior is counted! #icountnm  #completecountnm", "2019-11-21T23:12:01.000Z": "Health matters. That's why we're working to bring more doctors to rural areas. By raising Medicaid provider rates, we can increase access to care for 22% of New Mexicans. https:// krwg.org/post/new-mexic o-governor-announces-plan-increase-payments-medicaid-providers   #NationalRuralHealthDay New Mexico Governor Announces Plan To Increase Payments To Medicaid Providers Santa Fe, N.M. - The Human Services Department (HSD) announced Friday the next step in Gov. Michelle Lujan Grisham's multi-phase strategy addressing New krwg.org", "2019-11-20T15:13:01.000Z": "We're the fifth state in the U.S. to include a gender-neutral sex designation on birth certificates. Read about why this is such an important step for so many New Mexicans: Law lets people change gender on birth certificate Wyatt Day, a youth case worker at the Transgender Resource Center of New Mexico, said the change was \"more important to me than anything.\" santafenewmexican.com", "2019-11-18T23:12:00.000Z": "ICE must be held accountable for inhumane conditions in their facilities. This is why I called for a federal investigation into a privately-managed processing center here in New Mexico: NM governor urges probe of immigrant processing center SANTA FE, N.M. (AP) - New Mexico's governor is urging federal immigration authorities to open an investigation of conditions at a privately-managed processing center where Cuban migrants... apnews.com", "2019-11-16T15:13:02.000Z": "In an effort to preserve the heritage of the Navajo & Pueblo peoples & our public lands, I'm pleased that the U.S. House passed a law to protect Chaco Canyon National Historical Park & surrounding areas from oil and gas development. https:// buff.ly/357Uwtd", "2019-11-15T19:10:07.000Z": "When women run, women win! Female candidates swept the Las Cruces district elections. https:// buff.ly/2q8UrX9  @clcgov", "2019-11-13T19:10:02.000Z": "We're making our communities safer by targeting violent fugitives in New Mexico through the new Fugitive Apprehension Unit. Find out more about it: New Mexico governor creates special unit to arrest fugitives SANTA FE, N.M. (AP) - The governor of New Mexico has created a special law enforcement unit to arrest hundreds of fugitives across the state. Democratic Gov. Michelle Lujan Grisham announced... apnews.com", "2019-11-11T16:00:08.000Z": "I am so grateful to veterans across N.M. and around the country who have selflessly served their nation, & for the sacrifice made by their families & loved ones. I will always fight for those who have given so much for us. From the bottom of my heart, thank you. #VeteransDay2019", "2019-11-06T04:08:55.000Z": "Congratulations Governor-Elect @AndyBeshearKY ! Quote Tweet Democratic Governors @DemGovs Congratulations to Governor-Elect @AndyBeshearKY for his hard-fought victory tonight! His victory proves that strong Democrats running smart campaigns can win anywhere. #KYGov Show this thread", "2019-11-05T15:50:00.000Z": "Get out there and vote, New Mexico! #ElectionDay2019", "2019-11-05T14:00:00.000Z": "It's Election Day, New Mexico! Voting is one of the most important civil duties we have. Polls around the state are open all day - make sure you get out and vote! Check with your county clerk for local voting information or see here: https:// sos.state.nm.us/voting-and-ele ctions/voter-information/   #ElectionDay2019", "2019-10-31T22:12:01.000Z": "Wishing you a wonderfully spooky Halloween! #happyhalloween", "2019-10-28T14:13:01.000Z": "New Mexico was one of the first states to pass legislation to require businesses and public facilities to have single-occupancy restrooms marked as gender-neutral. The law will help people who identify as transgender or nonbinary feel safer. @GLSEN  #NationalLGBTQHistoryMonth", "2019-10-26T16:10:00.000Z": "Celebrate Mexican culture and honor your ancestors at these Dia de los Muertos events in New Mexico: Dia de los Muertos newmexico.org", "2019-10-24T18:10:02.000Z": "Thanks to our efforts to increase the Working Families Tax Credit, 70% of New Mexico families with children will get a break on their 2019 state personal income taxes.  Read the analysis by @ITEP & @NMVoices : https:// buff.ly/2pLR9bQ  #EITC  #WFTC Analysis: 70% of NM Families with Children Will See State Income Tax Cut Commentary: Most New Mexico families with children - 70% - will get a break on their state personal income taxes when they file their 2019 tax returns, krwg.org", "2019-10-18T16:01:26.000Z": "We're drawing more film & television projects to our state -  like @BiggestLoser . Production companies know New Mexico is THE place to film. Next season of 'The Biggest Loser' to be shot in New Mexico The NBC staple show will be shooting 10 episodes in and around Santa Fe on the USA network in 2020. lcsun-news.com", "2019-10-16T14:13:01.000Z": "Fighting the opioid crisis requires life-saving solutions. A map by the New Mexico Human Services Department will show where you can access naloxone, a drug that can reverse a deadly overdose. Smith's Pharmacies In Los Alamos And White Rock On New State Map For Naloxone Availability NMHSD NEWS The New Mexico Human Services Department (HSD) has announced a new map that is being made available to the public showing which pharmacies across New Mexico carry naloxone - the medicati losalamosreporter.com", "2019-10-14T22:12:00.000Z": "During #NationalLGBTQHistoryMonth , we celebrate trailblazers who put their lives on the line for the LBGTQ community. Learn more about activist heroes from New Mexico at @LCmuseums Voices of Change exhibition: https:// buff.ly/2MfDFxZ", "2019-10-11T01:50:01.000Z": "Physicians like Dr. Conejo support my plan to increase Medicaid reimbursement rates because they know it's necessary to retain quality care providers, especially for those living in rural areas. Read why here. https:// buff.ly/2M4K6n9", "2019-10-06T16:10:00.000Z": "I care about you and your mental health. That's why I'm working to rebuild accessible & high-quality behavioral health systems in New Mexico. #NationalMentalIllnessAwarenessWeek", "2019-10-05T18:10:00.000Z": "We're doing incredible things in New Mexico. The state's employment has increased 2.6% since last year. I'm proud to say that we're on track to add 20K jobs by the end of 2019.", "2019-10-03T22:12:02.000Z": "New Mexico is home to 5 national forests, 1 national park & 35 state parks. Axie Navas, the new head of the Office of Outdoor Recreation, will help us enjoy all of that nature respectfully and joyfully! #happytrails ! https:// buff.ly/2luyL5l", "2019-09-30T14:13:01.000Z": "From 9/15-10/15, we honor the rich Hispanic roots & cultures of New Mexico for #HispanicHeritageMonth . Trace your roots at @NHCCNM & explore historical sites in celebration of our past & future: Hispanic Heritage Month newmexico.org", "2019-09-29T18:10:00.000Z": "I'm inspired by the bravery of the youths who speak truth to power to protect our planet from #climatechange , like @GretaThunberg & Autumn Peltier #Waterwarrior1 . We're working hard in New Mexico to reflect that commitment in all we do.", "2019-09-28T14:13:00.000Z": "Get some fresh air & show Mother Earth some love this #NationalPublicLandsDay . Visit a national park for free & find a local volunteer event aimed at protecting our public lands. https:// buff.ly/2Zer3u0  #ClimateChange NPLD Event Locator neefusa.org", "2019-09-27T18:10:03.000Z": "We all have a right to access quality higher education. That's why I've announced a plan to make college tuition-free for New Mexico residents at our state schools. Read more about it here: https:// buff.ly/2nc0icx", "2019-09-24T19:00:48.000Z": "Our voices are key to a thriving democracy. Raise yours and help others do the same this #NationalVoterRegistrationDay by registering to vote or helping others register. Just click on this link: https:// buff.ly/2lgQxJx", "2019-09-24T14:13:02.000Z": "In NM 93% of our waterways are seasonal & provide much of our drinking water. They are under threat of pollution once the EPA rolls back the #CleanWaterAct . We will continue to fight for our planet through smart policies & ask the fed gov't to do the same. https:// buff.ly/2mRM9B4", "2019-09-22T01:50:00.000Z": "Happy #TapIntoCraft month! Each September, we celebrate efforts by @MarbleBrewery , @LescombesBistro & @SantaFeSpirits to benefit @RoadrunnerFdBnk . Cheers to giving back! Visit https:// buff.ly/30fidBP .", "2019-09-21T14:13:00.000Z": "Happy #WorldGratitudeDay ! Every day, I am grateful to have the opportunity to serve my beautiful state. I'm also thankful for all of the inspiring New Mexicans I meet that do the same.", "2019-09-14T15:00:36.000Z": "Head to the @NMStateFair for rodeo, culture, music & so much more. As they say, Love is in the Fair! New Mexico State Fair statefair.exponm.com", "2019-09-12T18:15:05.000Z": "NM is on its way to becoming a national leader in clean energy production! I'm honored to have received the @wradv Leadership in Conservation Award for my efforts to ensure NM has a carbon-free electricity grid by 2045. N.M. governor presented award from Colorado environmental champs New Mexico Gov. Michelle Lujan Grisham received Western Resource Advocates' Leadership in Conservation Award Thursday night at the Denver Botanic Gardens. coloradopolitics.com", "2019-09-02T18:18:17.000Z": "Thanks to the strength & commitment of generations of laborers, many of us are able to enjoy time off today. We continue to strive for better conditions for all workers. I hope you and your family have a relaxing and happy Labor Day.", "2019-09-01T21:05:23.000Z": "My heart sinks every time we hear of yet another horrible mass shooting. New Mexicans are grieving with our neighbors in Midland & Odessa. There is no question - we need real action from federal leadership on common sense gun reform legislation. The country is waiting for change.", "2019-08-31T22:12:02.000Z": "Great news! Skyrocketing oil production has given NM a much bigger budget than expected this past FY. That money will support critical investments in schools, infrastructure, & diversify our economy to improve the lives of all New Mexicans. https:// buff.ly/2MGwkZC", "2019-08-29T14:13:00.000Z": "We know that childcare is very important for parents. It can also be expensive and hard to find. That's why we'd like you to see if you qualify for a #childcare subsidy in NM. Just visit this site: https:// buff.ly/2HvxnHv", "2019-08-28T18:10:00.000Z": "Each of us counts. We're making sure everyone in NM gets counted so that critical federal programs like health care, transportation, education, jobs & housing are properly funded. Learn more: https:// buff.ly/2zsZRgM", "2019-08-26T14:15:01.000Z": "Teachers, we're working to support you and your classrooms by increasing funding for education by nearly half a billion dollars & by bringing leaders & communities together to find ways to curb gun violence in NM. #neveragain", "2019-08-23T16:30:14.000Z": "Our 1st 'Cabinet in Your Community' event was a great success! We connected New Mexicans with state departments to get them the services they need to thrive. From vaccinations to info on #healthcare , it's our job to help you live a better life. Governor holds first 'Cabinet in Your Community' event Every state department was present to answer questions. kob.com", "2019-08-22T19:00:51.000Z": "Have you met NM's new Secretary of Public Education, Dr. Ryan Stewart? He's going to do a wonderful job bringing students & schools the transformation they deserve. https:// buff.ly/326hyPF", "2019-08-17T18:10:02.000Z": "What an amazing event. Thank you @emilyslist for inviting me to speak and letting me share a day with these incredible women.", "2019-08-13T18:10:05.000Z": "During the hottest July on record, with the massive ice melt in Greenland, it's impossible to deny that #ClimateChangeIsReal . That's why NM is committed to a climate-conscious future that includes reducing CO2 by 45% in the next 11 years. https:// buff.ly/2YNSU92", "2019-08-10T14:13:00.000Z": "We are grieving with those who lost family and friends in the horrific shootings in nearby El Paso and in Dayton. We know the pain of gun violence. In response, NM is leading a summit on domestic terrorism this month. We cannot stand idly by. #NeverAgain", "2019-05-07T23:29:49.000Z": "Wishing @latinovictoryus the happiest 5th anniversary!  I celebrate your hard work and success in lifting Latino voices throughout our country and it is my honor to have the opportunity to work with an organization like yours. Sí se puede!", "2019-04-14T23:09:22.000Z": "Congratulations to George R.R. Martin on another exciting premiere of Game of Thrones! You make New Mexico proud!", "2019-02-28T21:47:09.000Z": "Have you heard about the Energy Transition Act? #SB489 paves the way for a clean energy future & green economic opportunities right here in NM! Let's get it done", "2019-02-06T03:30:03.000Z": "All of this talk about walls tonight... #SOTU", "2019-01-17T02:44:00.000Z": ". @Michelle4NM is focused on making 2019 the year New Mexico invests in its future - in both the success of its students and the safety of its communities and families.", "2019-01-03T17:20:06.000Z": "Please join me as I work for New Mexico as the 32nd Governor at @GovMLG  #nmpol", "2019-01-01T20:03:44.000Z": "The unlimited promise of this magnificent state is ours to achieve. It is time for us to thrive. Viva New Mexico! #nmpol  #ImagineAThrivingNM", "2019-01-01T20:01:52.000Z": "We're not here to celebrate a political victory but to remind ourselves a victory is only as good as the work ethic of the victors. We're not here as members of a winning party but as New Mexicans with our sleeves rolled up. #nmpol  #ImagineAThrivingNM", "2019-01-01T19:58:29.000Z": "That means not just raising the cap, but eliminating it and paying the backlog promptly. We will send a clear signal that we are open for business and will double film and television production in coming years. #nmpol  #ImagineAThrivingNM", "2019-01-01T19:58:08.000Z": "With @netflix in Albuquerque and moviemakers in California recognizing our world-class crew base and brilliantly talented homegrown writers, performers and filmmakers, we will take off the shackles and let it rip - and in the process we will put New Mexicans to work. #nmpol", "2019-01-01T19:57:38.000Z": "Our film industry can be the greatest and most lucrative state media business in the entire country. #nmpol  #ImagineAThrivingNM", "2019-01-01T19:52:26.000Z": "On the campaign trail, you might've heard us talk about a moonshot - a moonshot for our state's public education. Well, there's only one way there.\n\nAim high. #nmpol  #ImagineAThrivingNM", "2019-01-01T19:36:32.000Z": "Together we will find the courage to create the promise of that tomorrow for our children and their children. We will have the core strength to stay the course and stand as one when our resolve is challenged. We will go big. Really big. Together. #nmpol  #ImagineAThrivingNM", "2019-01-01T19:34:32.000Z": "And, most importantly, I want to thank you all. Standing before you today is an honor and a privilege so far beyond what any one person can articulate. #nmpol  #ImagineAThrivingNM", "2019-01-01T19:33:40.000Z": "I am humbled to be in the presence of so many incredible leaders, who have chosen to join me on stage today. #nmpol  #ImagineAThrivingNM", "2019-01-01T19:17:45.000Z": "Can't make it to the Santa Fe Community Convention Center? Join us live for the inaugural ceremony now: https:// youtube.com/watch?v=yeXMVF _YvdY   #nmpol  #ImagineAThrivingNM", "2018-12-19T05:06:06.000Z": "Congratulations @officialchevel ! New Mexico is very proud of you and we can't wait to see what's next. Quote Tweet The Voice @NBCTheVoice SPOILER AlERT: congratulations to #TheVoice !!! RETWEET to send our winner big love! GIF", "2018-12-12T16:26:03.000Z": "The inauguration is less than 3 weeks away and we need YOUR help to ensure it's a success! Sign up to volunteer: http:// bit.ly/2RARGq5  #imagineathrivingnm  #nmpol VOLUNTEER SIGN UP FORM: Thank you for your interest in volunteering with the Lujan Grisham Inaugural Committee! We appreciate your help - we can't do this without you. Please fill out this form no later than Friday,... docs.google.com", "2018-11-29T20:22:53.000Z": "I'm working hard to build a state government that works for all our families and I need experienced New Mexicans to help me achieve that goal. If you're interested in serving on a board or commission, please apply here: http:// bit.ly/2ranHtv  #nmpol", "2018-11-22T17:36:44.000Z": "As your next Governor, I'm so thankful to have the support of such a wonderful community. Together, we are going to build a stronger New Mexico. #nmpol", "2018-11-22T17:36:31.000Z": "This #Thanksgiving , I am so grateful to have my family, friends, good health, and a strong community of people like you across our incredible state. Your hard work and dedication to making New Mexico a better place for future generations inspires me everyday. #nmpol", "2018-11-18T15:52:38.000Z": "On November 6th, New Mexicans - and Americans - made it clear that it's time to fight climate change and invest in clean energy. Read more in @USATODAY : http:// bit.ly/2DrJLXM  #nmpol Gov.-elect: I climbed a wind turbine and won. Voters across US chose climate leaders. The wildfires devastating California are a sign that we need to confront climate change and embrace clean energy. Midterms show US voters are ready. usatoday.com", "2018-11-11T19:02:46.000Z": "Today, I reflect on the many generations of New Mexicans who have fought to protect our families. I hope you'll join me in taking time to thank the many men and women who have made the ultimate sacrifice to defend our freedom. I am so grateful for your service.", "2018-11-10T19:18:12.000Z": "I'll be live on @MSNBC with @KeirSimmons at 12:50 MT today talking about our historic election and my top priorities as governor. #nmpol", "2018-11-09T17:52:00.000Z": "In case you missed it: This morning I talked to @MSNBC  @Morning_Joe about my plans to reform our public education system, boost our economy, and leverage our national resources to build an outdoor economy. https:// on.msnbc.com/2RNxAss  #nmpol New Mexico's gov.-elect pushes back against a wall Michelle Lujan Grisham, Democratic governor-elect for New Mexico, discusses how education reform and the economy helped her win in the state and why she says a border wall isn't the answer. msnbc.com", "2018-11-08T02:34:26.000Z": "So proud to be building a stronger New Mexico with these incredible @NMDEMS . #nmpol Quote Tweet New Mexico for All @NMDEMS 11 for 11. Show this thread", "2018-11-07T20:26:48.000Z": ". @Morales4LtGovNM and I are ready to get to work! #nmpol", "2018-11-07T03:28:45.000Z": "Educators in New Mexico just worked to help elect a governor who will fight for public education! Congrats to @Michelle4NM ! #AFTVotes  #Midterms2018  #NMGov", "2018-11-07T05:17:26.000Z": "No words. Congrats to @Michelle4NM - we did it! #nmpol", "2018-11-07T03:36:09.000Z": "Congrats to @Michelle4NM on winning her election and becoming the first Democratic Hispanic woman governor in the United States!", "2018-11-07T03:37:44.000Z": "Congrats @Michelle4NM ! So proud to see you win. Quote Tweet EMILY's List @emilyslist Congrats to @Michelle4NM on winning her election and becoming the first Democratic Hispanic woman governor in the United States!", "2018-11-07T03:37:58.000Z": "New Mexico just elected the first Democratic Latina governor in the nation! Pro-choice champion Michelle Lujan Grisham has led the fight against repeated GOP attacks on women's health, and we know we can always count on her! Congratulations, @Michelle4NM ! #ElectionNight", "2018-11-07T03:39:46.000Z": "Congrats to my colleague @Michelle4NM , the next Governor of New Mexico!", "2018-11-07T03:44:38.000Z": " @Michelle4NM just became the first Democratic Latina Governor ever! New Mexico is lucky to have such a strong leader in Michelle Lujan Grisham!", "2018-11-07T03:55:15.000Z": "BIG WIN FOR GUN SENSE! New Mexico voters just chose Moms Demand Action Gun Sense Candidate @Michelle4NM as their next governor!\n\nCongratulations, Governor-elect Lujan Grisham! #ElectionNight", "2018-11-07T03:52:39.000Z": "There's a new day on the horizon for New Mexico - Congrats to @Michelle4NM and @Morales4LtGovNM on the big win. #nmleg  #nmpol  #NM4All", "2018-11-07T04:01:13.000Z": "Congratulations @Michelle4NM ! We can't wait to work with you on creating new jobs in New Mexico!", "2018-11-07T04:01:45.000Z": "Happy to congratulate @Michelle4NM , New Mexico's next governor I saw firsthand the work @NEANewMexico put in to elect this champion of public education who plans to raise wages for teachers and provide universal pre-K to 3- and 4-year-olds across the state  #Vote4Ed GIF", "2018-11-07T04:08:43.000Z": "Congratulations @Michelle4NM !!!! Thank you for standing for MY New Mexico values!!! Congratulations on being our first Democrat female governor!!!", "2018-11-07T04:09:46.000Z": "BREAKING: New Mexico voters have flipped their governorship blue!\n\nCongratulations to the next governor of New Mexico, and the United States' first Democratic Hispanic woman elected governor, @Michelle4NM !", "2018-11-07T04:19:21.000Z": "Congrats to @Michelle4NM my new governor of the NM State! (first Democratic Hispanic woman governor in the United States!)", "2018-11-07T04:32:58.000Z": "Feeling good and looking great NM!!! Inspired and energized @Michelle4NM  @Deb4CongressNM two amazing leaders who will ensure ALL students and families are served well. #BlueWave  #vision", "2018-11-07T04:53:38.000Z": "Good job @Michelle4NM ! Congratulations Governor-elect!", "2018-11-07T05:11:22.000Z": "I can't wait to your next Lieutenant Governor, New Mexico! I'm proud to stand alongside @Michelle4NM as we build a stronger New Mexico for our families. #nmpol", "2018-11-07T05:10:52.000Z": "Thank you, New Mexico. I'm honored to be your next governor. #nmpol", "2018-11-07T01:30:00.000Z": "30 more minutes until polls close, New Mexico! If you're in line at 7pm, you can still vote. If you have any issues, call (505) 304-1244. #nmpol", "2018-11-07T00:59:00.000Z": "Only 1 more hour until polls close! Find your closest polling place at http:// NMVote.org and go cast your vote! #nmpol", "2018-11-07T00:00:01.000Z": "In just 2 hours the polls close! I can't do this without you - find your closest polling location at http:// NMVote.org ! #nmpol", "2018-11-06T23:12:14.000Z": "My family and I just voted! Have you voted yet? The polls are open until 7pm! #nmpol", "2018-11-06T23:00:00.000Z": "Have you voted yet? You have 3 more hours to get to the polls and cast your ballot for change! More info: http:// NMVote.org  #nmpol", "2018-11-06T22:02:00.000Z": "4 more hours, New Mexico! I need your help to build a stronger New Mexico for our children. Find your polling location at http:// NMVote.org ! #nmpol", "2018-11-06T21:02:04.000Z": "Have you voted yet, New Mexico? I took my kids to the polls this morning to cast my ballot for @Michelle4NM , @XochforCongress , and of course, myself! You can still vote until 7pm so please get out and make your voice heard! #nmpol", "2018-11-06T20:42:13.000Z": "Nothing quite like a bowl of red chile and talking to supporters at @Barelas_Coffee_ on Election Day! If you haven't voted yet, the polls are open for 5 more hours: http:// NMVote.org . #nmpol", "2018-11-06T19:24:32.000Z": "Folks at Cocina Azul are fired up about electing @NMDEMS today! #nmpol", "2018-11-06T18:44:51.000Z": ". @Michelle4NM has been a career champion for LGBTQ+ New Mexicans. From supporting marriage equality to pushing for stronger anti-discrimination policies for the LGBTQ+ community, she's always had our back. She's our #EqualityChampion for #NMGov .  http:// nmvote.org", "2018-11-06T18:52:12.000Z": "Great artwork by Lindsay Mound showing the excitement across the state for change! Thanks for sharing, Lindsay! #nmpol", "2018-11-06T18:23:21.000Z": "Be like Coach @GregJacksonMMA and get out the vote, New Mexico! #nmpol", "2018-11-06T18:00:01.000Z": "Only 8 more hours to cast your vote, New Mexico! Make sure your voice is heard: http:// NMVote.org . #nmpol", "2018-11-06T15:54:20.000Z": "Folks are excited about getting out the vote this morning at our ABQ west side office! Our volunteers are ready to turn out voters from Rio Bravo to Alameda! #nmpol", "2018-11-06T15:43:51.000Z": "Albuquerque Area Fire Fighters-County Steward Julian Tovar and County VP Robert Sanchez-are out supporting @Michelle4NM today. Go #vote !", "2018-11-06T15:04:00.000Z": "You have the right to vote. If you see or have any issues at the polls, please call (505) 304-1244! #nmpol", "2018-11-06T14:01:20.000Z": "Today is Election Day, NM! I want the Land of Enchantment to become the land of opportunity - but I need your help. Please, go out and vote today, so we can build a brighter tomorrow for all New Mexicans. Polls are open through 7pm - more info at http:// NMVote.org . #nmpol", "2018-11-06T03:54:58.000Z": "We were thrilled to meet with @Michelle4NM tonight before #ElectionDay to get the word out to vote! With her plans to fund universal #PreK and #EarlyEd ,\nwe know she's the one for #NMgov ! #NMpol  #Vote4Kids", "2018-11-06T02:41:14.000Z": ". @NMDEMS couldn't be more excited to get out the vote tomorrow! If you haven't voted already, polls will be open from 7am until 7pm. Find the location closest to you at http:// NMVote.org ! #nmpol", "2018-11-05T23:59:49.000Z": "If we believe that our children are our future, then they must be our number one priority. As governor, I'll work with the legislature to fully fund universal pre-k and ensure every New Mexico child receives the education they deserve. #nmpol", "2018-11-05T23:15:31.000Z": "Investing in childhood education is critical for New Mexico's future. We're in Santa Fe with @Michelle4NM to talk about how we can deliver for the next generation of New Mexicans. #DemsTourNM", "2018-11-05T18:25:48.000Z": "This is it! Join Martin and @Michelle4NM tonight at the Alamosa Community Center in Albuquerque for our final rally of the campaign. Let's head into Election Day with as much energy as possible! #DemsTourNM", "2018-11-05T17:40:23.000Z": "I hope you'll join me, Senator @TeamHeinrich , @Morales4LtGovNM , and so many other incredible @NMDEMS candidates tonight at 6pm at the Alamosa Community Center! More info: http:// bit.ly/2zyesHw  #nmpol", "2018-11-05T16:58:52.000Z": "Vice President @JoeBiden is right: this election is too important to sit out. Tomorrow is Election Day and I need YOUR help to build a stronger, more prosperous New Mexico for all our families. Please visit http:// newmexicansformichelle.com/vote for more information. #nmpol", "2018-11-05T02:06:17.000Z": "It's time to rebuild our behavioral health system in New Mexico. I'll ensure we have parity in our behavioral health services by investing the full amount of Medicaid and holding our insurance companies accountable. #nmpol", "2018-11-05T01:51:49.000Z": "#NotGiGi but #Governor  @Michelle4NM is ready to get to work to lift up New Mexicans. We can do it, but only if we do it together. Watch her in Las Vegas now! http:// bit.ly/2JDL2MB", "2018-11-05T01:48:23.000Z": ". @Michelle4NM is absolutely right, \"We can't let our foot off the gas this cycle!\" That's why it's so important to sign up to volunteer #nmpol  #DemsTourNM I just signed up to elect Democrats! Join me in volunteering with the Democratic Party of New Mexico! secure.ngpvan.com", "2018-11-05T01:23:25.000Z": "The #DemsTourNM has rolled into Las Vegas - if you're interested in #nmpol , you can watch @Michelle4NM , @TeamHeinrich , and all our other candidates by clicking here: http:// bit.ly/2JDL2MB", "2018-11-05T01:24:50.000Z": "Getting out the vote for @XochforCongress , @Michelle4NM and @TeamHeinrich ! #NMPol", "2018-11-05T00:52:57.000Z": "Can't make it to Las Vegas for our rally tonight? Look for our livestream on our Facebook page, starting soon! https:// m.facebook.com/TeamHeinrich/  #DemsTourNM", "2018-11-05T00:03:02.000Z": "#DemsTourNM is visiting communities across the state because every New Mexican deserves to be heard. But @Michelle4NM and @TeamHeinrich can't talk to everyone by themselves. Will you help them out → http:// bit.ly/2KYtkn2", "2018-11-04T23:55:09.000Z": "Packed house in Española on our 4th stop of #DemsTourNM today! It's not too late to help us get out the vote - sign up here: http:// bit.ly/2Nb2Gw7  #nmpol", "2018-11-04T20:54:03.000Z": "Everywhere @Michelle4NM and @TeamHeinrich go on their #DemsTourNM the room is filled with Democrats fired up to bring real change to New Mexico - Taos was no different! Onward to Española! #nmpol", "2018-11-04T21:40:25.000Z": "Taos is fired up about electing @NMDEMS up and down the ballot on Tuesday! Thank you to everyone for their excitement and commitment to building a stronger New Mexico together! #nmpol  #DemsTourNM", "2018-11-04T19:25:27.000Z": "Getting pumped up here in Farmington! It's not too late to help us elect Democrats across the state - sign up for a canvass or phone bank at https:// goo.gl/KftfCS ! #DemsTourNM", "2018-11-04T18:56:23.000Z": ". @Michelle4NM and I are honored to have the support of my hometown newspaper, the Silver City Daily Press! Election Day is only 2 days away - get your family and friends together to go vote! #nmpol", "2018-11-04T18:50:32.000Z": "Thank you to Thelma Domenici for her trust in my ability to work across the aisle to build a stronger New Mexico for our families. I'm honored to have her support. #nmpol", "2018-11-04T18:08:52.000Z": "Thank you to Jen and Lloyd, dedicated public school teachers who love the outdoors, for saying hi this morning! I'll be a governor who fights to give New Mexico educators the raise they deserve and protect our public lands. #nmpol  #DemsTourNM", "2018-11-04T17:48:11.000Z": "Starting day 3 of #DemsTourNM in Gallup with @Michelle4NM , @peopleforben, and a great group of volunteers ready to knock on doors and turn out voters!", "2018-11-04T17:38:13.000Z": "It was great to meet Vesta and Randall, lifelong Republicans from Gallup, who put state over party and voted for @NMDEMS to improve our public education system and increase access to high-quality care for our veterans. I'm honored to have their trust! #DemsTourNM  #nmpol", "2018-11-04T15:41:33.000Z": "Just two days until Election Day, New Mexico! @TeamHeinrich , @peopleforben, and I are getting out the vote today all across northern New Mexico. Find the event closest to you here: http:// bit.ly/2zmbpC6  #nmpol  #DemsTourNM", "2018-11-03T23:53:23.000Z": "Huge chants of \"MLG\" as @Michelle4NM takes the stage! A real fighter, Michelle is standing up for every New Mexican! #DemsTourNM  #nmpol  https:// facebook.com/mlujangrisham/ videos/2074723049458015/ ", "2018-11-03T22:13:41.000Z": "Great to see so many folks excited about building a stronger New Mexico in Silver City this afternoon! #DemsTourNM", "2018-11-03T19:22:18.000Z": " @TeamHeinrich   @Michelle4NM  @PeopleForBen  @XochforCongress Now that's a winning combination! Our #DemsTourNM is already a huge success and it's not even half over! Come join us: https:// goo.gl/LSkp36  #nmpol", "2018-11-03T19:37:13.000Z": "A blue wave starts with a strong wind and we sure felt it at our #DemsTourNM Socorro matanza this afternoon! Great to see so many folks excited about electing @NMDEMS up and down the ballot! #nmpol", "2018-11-03T18:08:47.000Z": "Yum - save me some! #DemsTourNM Quote Tweet New Mexico for All @NMDEMS . @TeamHeinrich and @Michelle4NM are on their way to Socorro - let's hope there's food left when they get there! Huge crowds! It's not too late to join them as #DemsTourNM : https:// goo.gl/LSkp36", "2018-11-03T17:49:34.000Z": "Beautiful morning to go out and vote for @NMDEMS , Grants! Today is the last day of early voting - find your polling location at http:// NMVote.org ! #nmpol  #DemsTourNM", "2018-11-03T17:23:14.000Z": "NEA-Belen is getting out the educator vote! #nmpol  @NEAToday  @SGR4NM  @Michelle4NM", "2018-11-03T16:53:06.000Z": "Kicked off day 2 of #DemsTourNM with a canvass launch in Los Lunas. We had a great crowd ready to knock on doors, talk to voters, and get as many Democrats to the polls as we can on the last day of #EarlyVote in NM!", "2018-11-03T15:42:23.000Z": "Los Lunas is ready to elect Democrats who will fight for our values! @TeamHeinrich and @Michelle4NM are heading to their next stop - it's not too late to join them: https:// nmdemocrats.org/martin-michell e-are-going-on-tour/ ", "2018-11-03T14:15:01.000Z": "Today is the LAST DAY of early voting in New Mexico! Make sure your voice is heard and help us build a New Mexico that works for all of us. Find your nearest polling location here (and remind your friends to vote too!) → https:// goo.gl/4TCHKs  #NM4All GIF", "2018-11-03T14:40:49.000Z": "Just 3 days until Election Day on November 6th and I'm excited for day 2 of #DemsTourNM ! Senator @TeamHeinrich and I will be joined today by great @NMDEMS from all over New Mexico - find the closest event to you here: http:// bit.ly/2zmbpC6  #nmpol", "2018-11-02T20:43:55.000Z": "Alamogordo is ready to elect our next governor, @Michelle4NM and re-elect @TeamHeinrich - by knocking on doors and making calls today! #nmpol  #GOTV", "2018-11-03T01:22:36.000Z": "Wow! Could not have asked for a better crowd to cap off day 1 of our tour! Thanks to everyone who came out to knock doors, cheer on Dems, and make today such a success (and so much fun!). Now let's go vote! #DemsTourNM", "2018-11-03T01:25:47.000Z": "No better way to end the first day of #DemsTourNM than at Meow Wolf with hundreds of friends and supporters! Thank you to everyone who came out tonight ready to take New Mexico in a new direction. #nmpol", "2018-11-03T00:13:37.000Z": "Can't make it to @MeowWolf ? Tune in live at http:// m.facebook.com/TeamHeinrich in a few minutes! #DemsTourNM  #nmpol Quote Tweet Martin Heinrich @TeamHeinrich Standing room only at our GOTV rally at Meow Wolf! Head over to our Facebook page for a livestream starting soon! https:// m.facebook.com/TeamHeinrich/  #DemsTourNM", "2018-11-02T20:14:54.000Z": "Mulder and Scully have nothing on Martin and Michelle! #DemsTourNM is leaving Roswell and heading to their next stop. It's not too late to join them! #nmpol  https:// goo.gl/TnA4KZ", "2018-11-02T19:02:27.000Z": "She needed to stand on a box to see everyone in Roswell, but she is standing up for all of us! Thanks to everyone who is turning out for @TeamHeinrich and @Michelle4NM 's #DemsTourNM !", "2018-11-02T19:22:47.000Z": "Keeping the energy going here in Roswell! No UFOs but lots and lots of fired up volunteers ready to take back our country on Tuesday! #DemsTourNM", "2018-11-02T19:20:05.000Z": "Roswell brought the energy today at our canvass kickoff with @TeamHeinrich & @NMDems ! Next stop of #DemsTourNM : Clovis! #nmpol", "2018-11-02T19:00:36.000Z": "As governor, I'll work with all of New Mexico's governors to ensure that we are making the best investments possible to help our sovereign nations and all our communities here in New Mexico. #nmpol", "2018-11-02T17:10:27.000Z": "Alamogordo really turned out strong for the #DemsTourNM ! @Michelle4NM and @TeamHeinrich are going into every community and earning every vote. It's not too late to join them #nmpol  https:// nmdemocrats.org/martin-michell e-are-going-on-tour/ ", "2018-11-02T17:11:05.000Z": "In Alamogordo kicking off our statewide tour with @Michelle4NM - thanks to all the volunteers who came out to knock doors and help us start this tour off right! Next stop: Roswell! #DemsTourNM  #GOTV", "2018-11-02T17:21:12.000Z": "Great energy at our first stop of #DemsTourNM in Alamogordo with @TeamHeinrich ! We need YOUR help to get out the vote - sign up here: http:// bit.ly/2Nb2Gw7  #nmpol", "2018-11-02T15:49:52.000Z": "In a few minutes @TeamHeinrich and @Michelle4NM will arrive in Alamogordo, their first tour stop! Follow along using #DemsTourNM and then find your nearest event and join us! #nmpol Martin & Michelle Are Going On Tour! - New Mexico Democrats Martin Heinrich and Michelle Lujan Grisham are going on tour! In what some are calling the best team up since burgers and green chile, the two candidates at the top of our ticket are going on tour to... nmdemocrats.org", "2018-11-02T14:46:52.000Z": "All month long, we've been rallying for leaders like @Michelle4NM . She's made #EarlyEd her top priority because she knows universal #PreK is the best way for children to build a bright future. Vote for Michelle Lujan Grisham on November 6! #NMGov  #NMpol  #Vote4Kids", "2018-11-02T14:49:30.000Z": "Only 4 days until Election Day on November 6th, New Mexico! Today, @TeamHeinrich , myself, and other incredible @NMDEMS are traveling the state to get out the vote. Find the closest event near you here: http:// bit.ly/2zmbpC6  #nmpol", "2018-11-02T01:39:10.000Z": "As governor, I'll raise the cap on medical cannabis plants and increase access to licenses for producers so every patient has the access to medical cannabis they need. #nmpol", "2018-11-02T00:15:00.000Z": "Reminder: Our statewide tour with @Michelle4NM kicks off tomorrow in Alamogordo! For a full list of events, head on over to https:// goo.gl/cE3egA . See you on the road! #DemsTourNM", "2018-11-01T23:38:33.000Z": "The next generation of New Mexicans could decide our state's future by simply casting their vote for change. Thank you to @UNMDemocrats and Julisa for having me, @Deb4CongressNM & @TeamHeinrich this afternoon! #nmpol", "2018-11-01T21:08:40.000Z": "Just 5 days until Election Day on November 6th, New Mexico! Early voting is happening through Saturday - find your polling location at http:// NMVote.org ! #nmpol", "2018-11-01T18:55:58.000Z": "I had a great time sharing @Michelle4NM 's plans to boost the economy and create good-paying jobs in Roosevelt County this morning! Thank you to everyone for coming out. #nmpol", "2018-11-01T20:19:39.000Z": "Thank you to the Navajo Council for having me today. As governor, I will ensure tribal sovereignty, public education, and infrastructure are top priorities to build a stronger New Mexico. #nmpol", "2018-11-01T17:55:10.000Z": "Just picked up some delicious @NMPinonCoffee to fuel me through the final 5 days of this election! If you haven't voted yet, you have through Saturday to cast your vote early! More info at http:// NMVote.org . #nmpol", "2018-11-01T16:48:51.000Z": "On #LatinaEqualPayDay , I renew my pledge to keep fighting until we build a system that is equal for all New Mexicans - where all are paid the same for their work and given equal opportunity, regardless of their gender, race, or ethnicity. #nmpol", "2018-11-01T14:27:13.000Z": "I'm live right now on @94rock with Swami Rob, Skyler and Mahoney! Tune in now or at https:// 94rock.iheart.com ! #nmpol", "2018-10-31T22:32:33.000Z": "New Mexicans deserve access to high-quality, affordable healthcare which is why, as governor, I'll make sure there is a Patient Navigator to help New Mexico families in navigating our healthcare system. #nmpol", "2018-10-31T19:49:18.000Z": "Proud to have the support of the @FortSillApache Tribe. Thank you Chairman @JeffHaozous for your kind words and recognition of the my commitment to work tirelessly on behalf of every New Mexico family and protect tribal sovereignty. #nmpol", "2018-10-31T19:00:57.000Z": "#HappyHalloween , New Mexico! #nmpol", "2018-10-31T16:52:46.000Z": "I'm proud to fight for access to high-quality, affordable healthcare for all New Mexicans - even the littlest ones. #nmpol", "2018-10-31T01:00:13.000Z": "I'll be ready on day 1 to boost and diversify our economy. As governor, I'll ensure that every department adopts proactive collective bargaining to build new productive relationships focused on investing in state workers and develop a skilled workforce for the future.", "2018-10-31T00:10:04.000Z": "Let's make @newmexicotech a cybersecurity Center of Excellence to drive our economy and create good-paying jobs for future generations of New Mexicans. Thank you to Julian and the Student Government Association for having me today! #nmpol", "2018-10-30T21:38:14.000Z": "Only 7 days until Election Day on November 6th, New Mexico! Early voting is going on now through Saturday! Find your polling location at http:// NMVote.org ! #nmpol", "2018-10-30T17:19:52.000Z": "As governor, I'll ensure no community is overlooked by our state government and that meaningful government to government relationships are restored with our tribes and pueblos. #nmpol", "2018-10-30T17:19:24.000Z": "I am honored to have the support of the Mescalero Apache Tribe and look forward to continuing to work with them and our sovereign nations to create opportunities for our families. #nmpol", "2018-10-30T17:05:16.000Z": "New Mexico's Professional Fire Fighters are proud to stand with @Michelle4NM #TeamMichelle", "2018-10-30T15:32:45.000Z": "This election is about building a brighter future for our children and grandchildren. As governor, I'll work every single day to deliver a world-class public education to every student across New Mexico. #nmpol", "2018-10-30T01:03:54.000Z": "As governor, I will seek a supports services waiver to help provide some temporary relief to families on the DD waiver waiting list. #nmpol", "2018-10-30T01:03:39.000Z": "4,500 New Mexicans with developmental disabilities and their families currently have to wait more than a decade to receive services through the Developmental Disabilities (DD) waiver program. #nmpol", "2018-10-29T22:59:56.000Z": "By working together, we can avoid crisis and ensure everyone has access to the safe, reliable water today, and in the future. Read my plan: http:// bit.ly/2qj82Yi  #nmpol", "2018-10-29T22:59:47.000Z": "New Mexico's future depends on a reliable supply of water.  As governor, water management will become a priority for our state's agriculture, families and economic development. #nmpol", "2018-10-29T21:38:45.000Z": ". @Michelle4NM and I are counting on YOU to vote to build a stronger New Mexico. If you haven't voted yet, find your nearest polling location at http:// NMVote.org ! #nmpol", "2018-10-29T21:10:45.000Z": "It renewed my hope that in this election and beyond, all New Mexicans will come together to and fight to build stronger communities for our children and grandchildren. Thank you for joining me in this fight, Lucille. #nmpol", "2018-10-29T21:10:24.000Z": "This weekend, I was joined on the campaign trail by my friend @RepRoybalAllard , whose great-grandfather built La Iglesia de San Antonio in Pecos. As we stopped to visit, I was reminded of how lucky we are to have such rich history here in New Mexico. #nmpol", "2018-10-29T18:04:51.000Z": "Great energy in Pecos this weekend about creating good-paying jobs, improving our education system, and increasing access to high-quality, affordable healthcare! We only have 8 days until Election Day on November 6th - make sure you get out and vote, New Mexico! #nmpol", "2018-10-29T16:30:00.000Z": "Eighteen events in sixteen cities in four days - @TeamHeinrich and @Michelle4NM are going on tour this weekend to help get out the vote. Find your nearest event and we'll see you there! #nmpol Martin & Michelle Are Going On Tour! - New Mexico Democrats Martin Heinrich and Michelle Lujan Grisham are going on tour! In what some are calling the best team up since burgers and green chile, the two candidates at the top of our ticket are going on tour to... nmdemocrats.org", "2018-10-28T23:31:12.000Z": "Being multicultural in New Mexico is one of our greatest strengths. As governor, I'll appoint a task force to make sure we promote multiculturalism and grow respect and acceptance in our communities. #nmpol", "2018-10-28T22:35:05.000Z": "People are excited to vote for change in Abiquiu! Thank you to everyone who came out today to help get out the vote with @TeamHeinrich , @peopleforben and me. #nmpol", "2018-10-28T19:01:51.000Z": "Just finished up some delicious lunch at the Owl Cafe. Thank you to Ski, the owner, for saying hello! #nmpol", "2018-10-28T17:13:08.000Z": "Thank you to the @nmasianfamily for having me today to share my vision for building a NM that has good-paying jobs for our families, a great public education system for our children, & high-quality, affordable healthcare for all. It was great to meet with all of you! #nmpol", "2018-10-28T02:13:33.000Z": "We must take action to stop the senseless violence that continues to plague our communities. As governor, I'll instruct the Department of Health to conduct a study of gun violence as a public health epidemic. #nmpol", "2018-10-27T23:15:06.000Z": "With just 10 days to go until Election Day on November 6th, Santa Fe is fired up about creating change in our incredible state! Thank you to all of the volunteers who are working tirelessly to get out the vote and build a stronger, more prosperous NM for our families. #nmpol", "2018-10-27T22:05:40.000Z": "Thank you to @NEANewMexico for having me today and thank you to every single educator across this state who is working hard to build a brighter future for our children and grandchildren. #nmpol", "2018-10-27T22:03:42.000Z": "New Mexico can lead in public education but we must invest back into our schools and give our educators the raise they deserve. #nmpol", "2018-10-27T20:48:55.000Z": "If you haven't voted yet, you can find your voting information at http:// NMVote.org ! #nmpol", "2018-10-27T20:48:22.000Z": "What a great way to start the final 10 days of this election with @RepRoybalAllard & a packed house excited to talk to voters about our vision for a stronger NM! Thank you to everyone who is helping ensure that we turn out as many voters as possible in these next 10 days. #nmpol", "2018-10-27T19:35:42.000Z": "These horrific acts of domestic terrorism, like the one in Pittsburgh this morning, have got to stop. It's time to stop the divisive rhetoric and come together as a community. My thoughts and prayers are with the victims, their families, and the first responders on the scene.", "2018-10-27T01:29:38.000Z": "What a great night to be with so many supporters and friends in Mora! Thank you to everyone who came out tonight, excited about taking our state in a new direction. #nmpol", "2018-10-26T23:55:27.000Z": "Lots more work to do tonight, so luckily I have my favorite @Michelle4NM cheerleaders, Madison & Maisey, by my side! #nmpol", "2018-10-26T21:03:11.000Z": "I'm live now with @RepRoybalAllard on @KSWVradio talking about my plans to build a stronger New Mexico for all our families! Tune in to 99.9 or at http:// quesuaveradio.com . #nmpol", "2018-10-26T20:37:42.000Z": "I'm committed to eliminating the rape kit backlog and ensuring that we hold those individuals who perpetuated those crimes accountable. As governor, I'll work with the Department of Public Safety and the state crime lab to address the backlog and process the evidence. #nmpol", "2018-10-26T14:14:45.000Z": "Thank you, Trish, for being such an incredible educator and community leader who is always fighting for NM families. As gov, I'll work to make sure our children receive the education they deserve, NM working families have good-paying jobs, and our communities are safe. #nmpol", "2018-10-25T22:50:57.000Z": "I'm committed to making New Mexico a clean energy leader and saving taxpayers money. As governor, I'll install rooftop solar, smart energy technology, and convert certain buildings to total renewable energy to start building a greener economy here in New Mexico. #nmpol", "2018-10-25T20:30:53.000Z": "Today, @Michelle4NM & I made it clear that we will fight for public employees to have access to good-paying jobs with meaningful raises, a secure retirement, & better working conditions. Thank you to everyone who came out to hear more about our vision for a stronger NM! #nmpol", "2018-10-25T19:54:11.000Z": "Our public servants are ready for a governor who will help them better serve the citizens of NM. I'll be that gov who fights for their fair treatment, invests in their careers & retirement, & makes sure they have the resources & tools needed to best serve all New Mexicans. #nmpol", "2018-10-25T16:09:31.000Z": "Stopped by @Barelas_Coffee_ on this beautiful NM morning for some red chile & chicharrones. Thank you to everyone for saying hi & for your kind words about last night's debate! If you haven't voted yet, visit http:// NMVote.org to find your closest polling location. #nmpol", "2018-10-25T02:20:11.000Z": "We must fight for those who have sacrificed everything for us. As governor, I'll ensure that every department and agency in state government prioritizes hiring New Mexico veterans. #nmpol", "2018-10-25T01:59:18.000Z": "I want my two grandchildren, Avery and Mason, to grow up in a state with unlimited opportunities. We have a choice to make - an urgent one, that will decide our future. That's why I'm asking for your vote. #nmpol  #NMGovDebate", "2018-10-25T01:58:24.000Z": "I've got a real record of success, an ability to get things done, & a vision to realize New Mexico's full potential. I will be the governor who's working with you everyday to build a strong, vibrant New Mexico where our children & grandchildren will thrive. #nmpol  #NMGovDebate", "2018-10-25T01:57:12.000Z": "New Mexico voters deserve transparency. That's why I released five years of complete tax returns months ago: http:// bit.ly/2q9ehhl  #nmpol  #NMGovDebate", "2018-10-25T01:49:48.000Z": "I will work with the legislature to legalize recreational cannabis in a productive way that brings in revenues while protecting medical cannabis patients, ensuring public safety, and protecting children. http:// bit.ly/2MOcNBV  #nmpol  #NMGovDebate", "2018-10-25T01:43:53.000Z": "Making sure our communities are safe will be a top priority of mine as governor which is why I'm proud to have the endorsement of 50 current and former public safety leaders: http:// bit.ly/2D1W1z5  #nmpol  #NMGovDebate", "2018-10-25T01:39:43.000Z": "CYFD has been failing children like Marissa. As governor, I'll consult those who have gone through the foster care system so we can build a system that values our children and their futures. http:// bit.ly/MLG_CYFD  #nmpol  #NMGovDebate OPINION | Shaping up CYFD is important for everyone OPINION | Staffing levels, accountability and support services must be improved to protect our kids abqjournal.com", "2018-10-25T01:39:13.000Z": "We have a responsibility to invest in New Mexico and as governor that's exactly what I'll do. #nmpol  #NMGovDebate", "2018-10-25T01:25:38.000Z": "As governor, I'll rebuild our behavioral health system, protect and strengthen Medicaid, and expand access to affordable healthcare for all New Mexicans. http:// bit.ly/MLG_Healthcare  #nmpol  #NMGovDebate", "2018-10-25T01:24:41.000Z": "I'm proud to fight for access to healthcare for all New Mexicans, even the littlest ones: http:// bit.ly/MLG_Zander  #nmpol  #NMGovDebate Albuquerque newborn getting lifesaving surgery Zander Gurule was flown to Boston with the help of a U.S. representative koat.com", "2018-10-25T01:22:31.000Z": "New Mexico families deserve a raise. As governor, I'll immediately raise the minimum wage to $10 and then to $12 over four years. Read my plan: http:// bit.ly/MLG_Jumpstart  #nmpol  #NMGovDebate", "2018-10-25T01:19:16.000Z": "It's time to give our children the education that prepares them for the jobs of the future and allows them to reach their full potential. Read my plan: http:// bit.ly/MLG_Education  #nmpol  #NMGovDebate", "2018-10-25T01:17:37.000Z": "Our children deserve to be safe in their schools, homes and communities. I have a detailed plan to combat gun violence in New Mexico and keep our families safe: http:// bit.ly/MLG_GunViolence  #nmpol  #NMGovDebate", "2018-10-25T01:13:08.000Z": "Boosting our economy must be a top priority for our next governor. I want to start creating good-paying jobs and diversifying our economy on day 1, which is why I already have 5 comprehensive plans. http:// newmexicansformichelle.com/policy  #nmpol  #NMGovDebate", "2018-10-25T01:10:47.000Z": "I would not appeal the Yazzie-Martinez decision as governor. We have failed to put enough resources right into the classroom and adequately support our educators. #nmpol  #NMGovDebate", "2018-10-25T01:09:34.000Z": "I worked across the aisle in Congress to develop the USA Act, legislation that would protect #DREAMers while also securing our borders using 21st Century technology that would truly make a difference in our immigration system. #nmpol  #NMGovDebate", "2018-10-25T01:05:42.000Z": "For the last two years, I've been traveling the state and talking with thousands of New Mexicans about their hopes, dreams, and our shared beliefs, values, and vision for this state. One thing is clear: New Mexico has far more opportunities than challenges. #nmpol  #NMGovDebate", "2018-10-25T00:50:35.000Z": "We'll be live in 10 minutes at the final Gubernatorial Debate on KOAT or on https:// koat.com ! I hope you'll tune in to learn more about my vision for a stronger, more prosperous New Mexico for all our families. #nmpol", "2018-10-24T23:15:00.000Z": "Our choice isn't that 'tough' - @Michelle4NM wants to build an all-of-the-above economy that won't keep us dependent on the price of crude oil. We just have to make the right investments. #nmpol  https:// goo.gl/2fVgEw", "2018-10-24T22:53:00.000Z": "Our next governor must have the experience and vision to lead New Mexico in a new direction. I'm proud that @thenewmexican , @taosnews , and @CrucesSunNews see those qualities in me and I'm honored to be their choice for Governor of New Mexico. #nmpol", "2018-10-24T21:38:02.000Z": "With less than 2 weeks to go until Election Day on November 6th, I hope you'll tune in at 7pm on @koat7news for the final gubernatorial debate to learn more about my vision for a stronger, more prosperous New Mexico. #nmpol", "2018-10-24T18:46:02.000Z": "New Mexico voters, @Michelle4NM is the real deal. She cares about every single resident in NM and will do everything to protect them. #AFTVotes  #NMGov Quote Tweet MichelleLujanGrisham @Michelle4NM We need to invest in our healthcare system & make it easier to navigate so that New Mexico families receive the high-quality care they deserve. That's why, as governor, I'll appoint a Healthcare Innovation Director to make a real difference for patients & their families. #nmpol", "2018-10-24T19:53:17.000Z": "It's an honor to have the support of Robert Shilling, the former Chief of NM State Police. I'll be a gov who works hard to keep families safe in their homes, schools, & communities while ensuring our law enforcement officers stay out of harm's way. #nmpol", "2018-10-24T18:43:00.000Z": "I hope you'll tune in tonight at 5 on @KFOX14 before Game 2 to hear a little bit more about why I'm running for governor and my plans to create good-paying jobs in New Mexico! #nmpol", "2018-10-24T17:46:49.000Z": "As governor, I'll ensure that our veterans have the financial, housing, and healthcare resources they deserve. Read my plan: http:// bit.ly/2AqdlLy  #nmpol", "2018-10-24T17:46:15.000Z": "It's time for the state to lead in serving and protecting those who have sacrificed so much for our freedom and way of life. I'm proud of my record of fighting for veterans throughout my entire career. #nmpol", "2018-10-24T16:23:20.000Z": "ICYMI! On Saturday morning, our candidate for Governor, @Michelle4NM kicked off the first day of early voting alongside union members, their families, and labor endorsed candidates! #TeamMichelle  #GOTV  @AFLCIO  @AFTNM  @AFTunion  @NMDEMS", "2018-10-24T16:03:46.000Z": "Today is Michelle's birthday! Will you chip in to make it Michelle's best birthday yet? https:// secure.actblue.com/donate/hbdmlg  #nmpol", "2018-10-24T01:27:43.000Z": "I would be incredibly proud to be elected the first Democratic Latina governor and work alongside the first Native American congresswoman, @Deb4CongressNM , to build a stronger and more prosperous New Mexico for our families. http:// time.com/5395686/histor ic-candidates-midterms-2018/   #nmpol These Candidates Made History in the 2018 Midterms Including Jared Polis, Marsha Blackburn and Michelle Lujan Grisham time.com", "2018-10-24T01:27:07.000Z": "Diversity in our elected officials is crucial to getting a well-rounded set of experiences and opinions to contribute to our democracy. #nmpol", "2018-10-23T23:03:36.000Z": "Healthcare should be a right, not a privilege. As gov, I will immediately bring stakeholders to the table to build a healthcare system that delivers accessible, high-quality, and affordable healthcare to all New Mexicans. Read my action plan: http:// bit.ly/2ywxWfX  #nmpol", "2018-10-23T21:50:06.000Z": "We need to invest in our healthcare system & make it easier to navigate so that New Mexico families receive the high-quality care they deserve. That's why, as governor, I'll appoint a Healthcare Innovation Director to make a real difference for patients & their families. #nmpol", "2018-10-23T18:08:37.000Z": "With only 2 weeks until Election Day on 11/6, I'm proud to have @elizabethforma support. I'll be a gov who fights for good-paying jobs & high-quality public education for every NM family, but I need YOUR vote! Find your closest polling location at http:// NMVote.org . #nmpol", "2018-10-23T17:35:46.000Z": "SANTA FE: I hope you'll join me tomorrow night to watch @Michelle4NM share her vision for a stronger New Mexico in the final gubernatorial debate on @koat7news at 6:30pm at the Progress & Justice Center! #nmpol  #NMGovDebate", "2018-10-23T14:30:12.000Z": "Thank you to Officer Romero for speaking up about an important issue that affects communities across NM. As gov, I'll make sure that our families are safer by keeping our most dangerous criminals off the street & increasing funding for the hiring & training of more police. #nmpol", "2018-10-22T22:57:21.000Z": "I pledge to immediately restore the Children's Cabinet to improve child wellbeing across New Mexico. The Children's Cabinet will bring together leaders from state government to build brighter futures for New Mexico children. #nmpol", "2018-10-22T14:59:31.000Z": "There are no silver bullets for New Mexico 's problems - from opioids to early childhood education to environmental protection, only @Michelle4NM has a plan to get us back on track! #nmpol Democrat Lujan Grisham asks voters to look upward \"We are on the edge of being able to transform every single thing we do,\" the congressswoman from Albuquerque said in a recent interview. santafenewmexican.com", "2018-10-22T16:55:34.000Z": "Stopped by Casa de Benavidez for some breakfast chile to fuel up for full day of talking to voters on the campaign trail! #nmpol", "2018-10-22T14:22:09.000Z": "Folks were fired up about building a stronger New Mexico last night at our Get Out the Vote Event with @repcleaver ! Have YOU voted yet? Find your nearest polling location at http:// NMVote.org ! #nmpol", "2018-10-21T23:50:25.000Z": "You could feel the electricity in the air today at our matanza - Rio Arriba is ready for change! Thank you to @peopleforben, Sen. Martinez, Joseph Sanchez, & Susan Herrera for bringing the community together to move NM forward toward better jobs & public education. #nmpol", "2018-10-21T21:23:46.000Z": "It was great to visit with folks at New Hope, God's House, and Grant Chapel AME this morning with @repcleaver ! Thank you to the pastors and congregations for the enthusiastic welcome and fulfilling worship. #nmpol", "2018-10-21T14:40:45.000Z": "NM has incredible potential - to be the clean energy state, to lead in public education, & to have a diverse, booming economy. I'll be a gov who creates a NM with brighter futures for our children. Thank you to @thenewmexican for their endorsement. http:// bit.ly/2J9BqZz  #nmpol For governor, Michelle Lujan Grisham New Mexico deserves a governor with management ability, an understanding of how to develop policy and pass laws, one who is optimistic, pragmatic and visionary. santafenewmexican.com", "2018-10-21T00:38:22.000Z": "Too many New Mexicans are finding it difficult, if not impossible, to get the personal identification they need. As governor, I'll create an ID system that works for all New Mexicans by making MVD customer friendly and implementing a renewal-by-mail system. #nmpol", "2018-10-20T23:41:44.000Z": "Thanks for coming to New Mexico, Randi, and thanks for always being an incredible advocate for public education! #nmpol  @AFTunion  @AFTNM Quote Tweet Randi Weingarten @rweingarten After our rally, hundreds of union members marched to vote early. I was proud to lead the march with @TeamHeinrich and @Michelle4NM . #AFTVotes", "2018-10-20T23:39:20.000Z": "Being in the South Valley always reminds me of the importance of coming together as a community to create change. As gov, I'll make sure all our communities have a seat at the table. Thank you for a beautiful afternoon of good music, delicious menudo, & friends! #nmpol", "2018-10-20T19:26:01.000Z": "Sandoval County is fired up and ready to take our state in a new direction! I'll be a governor who boosts the economy, improves our schools, and makes our communities safer. #nmpol", "2018-10-20T18:14:09.000Z": "Beautiful morning to canvass with Rep. @rjferrary53 and get out the vote on the first day of expanded early voting! @Michelle4NM and I want YOU to vote - find your closest polling location at http:// NMVote.org ! #nmpol", "2018-10-20T15:56:21.000Z": "If we elect @Michelle4NM , New Mexico can go from an anti-public ed state to a pro-public ed state. - @rweingarten  #AFTvotes  #NMGov", "2018-10-20T18:00:24.000Z": "Proud to partner with @AFTNM today in support of @Michelle4NM , @Deb4CongressNM , and @TeamHeinrich . Early voting is now open. Go vote! @NMPFFA", "2018-10-20T16:19:41.000Z": "It's time to give our children the public education they deserve - one that prepares them for their bright futures. I'm proud to stand with @AFTNM and so many incredible educators and candidates at today's Early Voting Rally! Go vote, New Mexico! #nmpol", "2018-10-20T16:16:25.000Z": "No kidding, @TeamHeinrich ! #BeAVoter  #nmpol Quote Tweet Martin Heinrich @TeamHeinrich Time flies when you're on your way to early vote! #BeAVoter  #VoteEarly  #AFTvotes  #nmpol", "2018-10-20T14:58:13.000Z": "From the looks of last night's game, we're going to have a great season, @UNMLOBOS ! #nmpol", "2018-10-20T14:57:52.000Z": "It was great to take my granddaughter, Avery, to see the @UNMLoboMBB Cherry & Silver Game last night. College athletics are an important piece of our Cool Cities Initiative to grow the economy and keep talented young people in NM. #nmpol", "2018-10-19T23:30:55.000Z": "Making sure New Mexico seniors are taken care of has always been a priority of mine. It was great to see so many old and new friends at Barelas Senior Center this afternoon! As governor, I'll continue to fight for quality care and public services for our seniors. #nmpol", "2018-10-19T19:28:14.000Z": "Tackling our opioid problems will be no easy task but I will bring experienced leaders together to develop a strategy to stop this horrible health crisis from tearing apart our families. #nmpol", "2018-10-19T19:28:05.000Z": "I'm proud to announce my plans as governor to create an Opioid Recovery Task Force consisting of state and local government officials, tribal leaders, and healthcare providers to address the opioid epidemic across New Mexico. #nmpol", "2018-10-19T17:15:00.000Z": "Early vote starts this Saturday - what better way to celebrate than with @TeamHeinrich , @Michelle4NM , @Deb4CongressNM , and @LaborFed4NM: https:// goo.gl/77ZEhV", "2018-10-19T16:30:13.000Z": "Nothing like a Northern New Mexico tradition - una marcha! Thank you to everyone for coming out. I promise to be a governor who fights to create good-paying jobs for San Miguel County, improve our schools, and make sure our seniors are taken care of. #nmpol", "2018-10-18T22:58:55.000Z": "It's always great to talk to norteños about my plans to create good-paying jobs and improve our education system - and even better when I run into my friend @TomUdall ! #nmpol", "2018-10-18T22:25:39.000Z": "Awesome to welcome @Michelle4NM to Suave Radio @KSWVradio discussing her plans for #NewMexico ! #NMpol", "2018-10-18T22:31:30.000Z": "I'm live on @KSWVradio Que Suave right now! Tune into 99.9FM or at http:// kswvradio.com . #nmpol", "2018-10-18T21:49:46.000Z": "One of my top priorities as governor will be to create more good-paying jobs for New Mexicans. To do that, I'll create an Entrepreneurial Development Council and a Commerce Cabinet to boost and diversify our economy. #nmpol", "2018-10-18T19:54:53.000Z": "Joscelyn knows that you can't let size determine your power. She's already a two-time national boxing champion and she's just getting started. @Morales4LtGovNM and I are proud to cheer on Jos the Boss! #nmpol", "2018-10-17T23:53:42.000Z": "Great day at the Lea County Women's Health Fair yesterday! @Michelle4NM has fought hard for access to high-quality, affordable healthcare for all New Mexico women, children and families, and will continue that fight as governor. #nmpol", "2018-10-18T19:00:03.000Z": "I'm proud to stand up against bullying today on #SpiritDay and every day. I hope you'll join me in sending a message to our young people that it's okay to be who you are. #nmpol", "2018-10-18T17:15:00.000Z": "With the help of @TeamHeinrich , @Michelle4NM , @Deb4CongressNM , and @LaborFed4NM we are hosting a rally and march to celebrate the start of early voting on Saturday! https:// goo.gl/77ZEhV", "2018-10-18T01:21:02.000Z": "US House candidate, NM-1 I do not believe that we need to ban people from our country according to the country they come from, the religion they practice, or the color of their skin. We do not need a wall, and that money should be used on infrastructure here. #nmpol  #NM01  #BeFierce  #KOATDebate", "2018-10-18T01:14:19.000Z": "US House candidate, NM-1 I believe Dr. Blasey Ford. #nmpol  #NM01  #BeFierce  #KOATdebate", "2018-10-18T01:48:59.000Z": "I know @Deb4CongressNM will fight for New Mexico children and families in Congress and I'm proud to stand with her. #nmpol Quote Tweet Deb Haaland @Deb4CongressNM US House candidate, NM-1 Congress has never heard a voice like mine. #nmpol  #NM01  #BeFierce  #KOATdebate", "2018-10-17T23:53:23.000Z": "Protecting and preserving New Mexico's water depends on understanding the land we live on. That's why I will appoint a steward from the land grant and acequia communities to protect and preserve our water and way of life. #nmpol", "2018-10-17T17:24:15.000Z": "Just stopped at @VillaMyriamCafe for a cup of coffee on this cold New Mexico morning. Not only can they brew a delicious cup of coffee, but they're also an example of a great New Mexico #smallbiz . As governor, I'll invest in growing our small businesses across the state. #nmpol", "2018-10-17T15:57:29.000Z": "Did you catch last night's #NMGovDebate ? @Michelle4NM proved - once again - that she'll be a champion for all New Mexicans! #nmpol  Watch: Lujan Grisham, Pearce highlight differences in KOB 4 gubernatorial debate Gubernatorial candidates Michelle Lujan Grisham (D) and Steve Pearce (R) debated for nearly 60 minutes on KOB 4. kob.com", "2018-10-17T01:03:05.000Z": ". @Michelle4NM demonstrated *once again* she will be the champion we need to stand with our communities & protect access to care. Proud to stand with MLG in the #midterms2018 . #NMGovDebate", "2018-10-17T00:57:27.000Z": "If you remember one thing from tonight, remember this: I'll be the governor who will get things done; who has integrity, who's honest, and who will work with you to improve the lives of every New Mexican. #nmpol  #NMGovDebate", "2018-10-17T00:56:50.000Z": "We can be the clean energy state, give every child universal pre-k, and ensure that every New Mexican has a good-paying job. I want my two grandchildren, Avery and Mason, to grow up in a state with unlimited opportunities. #nmpol  #NMGovDebate", "2018-10-17T00:56:05.000Z": "Our next governor must boost New Mexico's economy. That's why I have 5 comprehensive plans to build a stronger, more prosperous New Mexico for all our families: http:// newmexicansformichelle.com/policy  #nmpol  #NMGovDebate", "2018-10-17T00:53:31.000Z": "It's time that New Mexico invests in water innovation and water conservation for not just the current generation, but generations to come. #nmpol  #NMGovDebate", "2018-10-17T00:50:18.000Z": "Among the first things I'll do as governor to jumpstart the economy are raising the minimum wage, investing in #NMsmallbiz , and stopping millions in contracts from going out of state. Read the plan: http:// bit.ly/MLG_Jumpstart  #nmpol  #NMGovDebate", "2018-10-17T00:46:54.000Z": "I want a professional, dedicated, experienced workforce serving in our state agencies. I'm committed to making sure our state workers are getting the support they need so we have a strong state government. #nmpol  #NMGovDebate", "2018-10-17T00:43:43.000Z": "I will work with the legislature to legalize recreational cannabis in a productive way that brings in revenues, protects medical cannabis patients, ensures public safety, and protects children. http:// bit.ly/2MOcNBV  #nmpol  #NMGovDebate", "2018-10-17T00:35:54.000Z": "New Mexico has over $6 billion in unmet infrastructure needs - it's time we change that. I have a 5 step plan to address those needs and invest in infrastructure statewide: http:// bit.ly/MLG_Infrastruc ture   #nmpol  #NMGovDebate", "2018-10-17T00:35:01.000Z": "In Congress, I've fought to protect #DREAMers , even when it meant standing up to President Trump. #nmpol  #NMGovDebate", "2018-10-17T00:30:07.000Z": "As governor, I will prioritize reforming CYFD so that all New Mexico children have brighter futures. #nmpol  #NMGovDebate", "2018-10-17T00:26:15.000Z": "Throughout my time in public service, I've fought to make our communities safer. I'll continue to make a difference as governor. My plan: http:// bit.ly/MLG_Crime  #nmpol  #NMGovDebate", "2018-10-17T00:23:56.000Z": "As governor, I'll ensure that our families are safe in their schools, homes, and communities by giving our law enforcement the resources to recruit and retain the police officers our communities need. Read my plan: http:// bit.ly/MLG_Crime  #nmpol  #NMGovDebate", "2018-10-17T00:17:06.000Z": "We must build systems - from infrastructure to professional capacity - that prepare the state for the inevitable shocks of an unpredictable future and manage our water in a way that meets our basic notions of fairness. #nmpol  #NMGovDebate", "2018-10-17T00:16:19.000Z": "I will support a coordinated statewide water plan that's focused on the long term, the next 50 and 100 years, not just the next five or ten. #nmpol  #NMGovDebate", "2018-10-17T00:13:52.000Z": "We have a behavioral health system in New Mexico that leaves behind the most vulnerable, and doesn't contend with the most difficult cases. We need to build systems of behavioral healthcare, housing, and support that don't let people fall through the cracks. #nmpol  #NMGovDebate", "2018-10-17T00:12:30.000Z": "#nmpol  #NMGovDebate", "2018-10-17T00:09:51.000Z": "As governor, I'll stop the appeal of Yazzie/Martinez and put more money in our classrooms directed to the programs that support at-risk students. #nmpol  #NMGovDebate", "2018-10-17T00:06:38.000Z": "Building a brighter future for our children will be my top priority as governor. I'll invest back into our classrooms, make Pre-K accessible for all our families, and make sure that our students have the tools they need. http:// bit.ly/MLG_Education  #nmpol  #NMGovDebate", "2018-10-17T00:03:33.000Z": "New Mexico has incredible opportunities: renewable energy, a strong small business community, awe-inspiring landscapes, and the most resilient people who are ready to work to realize New Mexico's full potential. #nmpol  #NMGovDebate", "2018-10-16T23:55:15.000Z": "We're 5 minutes away from tonight's KOB Gubernatorial Debate! Tune into @KOB4 or watch online at https:// kob.com to hear more about my plans to create good-paying jobs and build a stronger New Mexico for all our families. #nmpol", "2018-10-16T20:58:26.000Z": "It was great to be at Hobbs HS this morning talking to students about their goals and aspirations. With @Michelle4NM as governor, our children will receive better public educations, have increased access to apprenticeships and jobs training, and reach their full potential. #nmpol", "2018-10-16T21:00:29.000Z": "As governor, I'll immediately halt the appeal of the landmark Yazzie-Martinez case and fully fund our public education system so all of our children receive the education they deserve. #nmpol", "2018-10-16T15:45:00.000Z": "Congratulations to @TeamHeinrich , @Michelle4NM  @XochForCongress , @Deb4CongressNM , @SGR4NM and all of the other candidates who earned the @RioGrandeSierra endorsement! #nmpol 2018 Rio Grande Chapter Endorsements: Federal, N.M. Statewide Read the Rio Grande Sierra Club endorsements for the 2018 statewide New Mexico races. riograndesierraclub.org", "2018-10-16T15:24:26.000Z": "With only 3 weeks until Election Day on November 6th, I hope you'll tune in tonight at 6pm to the @KOB4 Gubernatorial Debate to hear more about my plans to create good-paying jobs for our families and give our children the public education they deserve. #nmpol", "2018-10-16T02:19:02.000Z": "Early voting starts this Saturday! We're kicking it off at an early vote rally with @AFTNM , @Michelle4NM , @Deb4CongressNM , @NMDEMS and more - join us! https:// goo.gl/QT9L4n", "2018-10-16T00:41:17.000Z": "US House candidate, NM-1 I'll fight to protect and expand the Affordable Care Act and I will never vote to allow insurance companies to deny coverage to people with preexisting conditions. #nmpol  #nm01  #KOBdebate  #BeFierce", "2018-10-16T00:32:57.000Z": "As governor, I'll immediately appoint an infrastructure czar to work on critical needs projects so we begin to see safety improvements & job growth in our communities. #nmpol", "2018-10-16T00:31:55.000Z": "We can begin to overcome so many challenges across our state if we build our infrastructure and invest in our schools, roads, broadband and water systems. #nmpol", "2018-10-15T19:41:13.000Z": "It was great to run into Ann Lerner at Barelas Coffee House this morning. Ann has played a critical role in bringing film to New Mexico and as governor, I'll build on her legacy by lifting the cap on the Film Tax Credit and doubling production capability. #nmpol", "2018-10-15T17:29:21.000Z": "My prayers are with Diego's family and loved ones during this incredibly difficult time.", "2018-10-15T01:59:31.000Z": "You could feel the excitement about building a stronger, more prosperous NM for all our families at our Mesquite matanza tonight! Thank you to everyone who came out to hear more from @Morales4LtGovNM and myself about our plans to create good-paying jobs in southern NM. #nmpol", "2018-10-14T20:05:13.000Z": "I always love it when local elected officials help us out. Just like them, you can join us at the Las Cruces @NMDEMS HQ at 230 S Water Street to knock doors, make calls and help us #electnmdems such as @XochforCongress  @Michelle4NM  @TeamHeinrich and many others this November!", "2018-10-14T18:03:16.000Z": "It's time to fight harder to protect our natural environment and preserve our planet for generations to come. As governor, I'll immediately join @USClimate and invest in renewable energy to make New Mexico a leader in clean energy technology. #nmpol", "2018-10-14T16:41:40.000Z": "I'll be a governor who fights to build a brighter future for all our families, including creating good-paying jobs in southern New Mexico. Thank you to the @CrucesSunNews for their endorsement. http:// bit.ly/2pR3Mir  #nmpol Lujan Grisham is best choice to be next governor We need a leader who can bring people together and find pragmatic solutions that will last for the long term. We believe Lujan Grisham is that leader. lcsun-news.com", "2018-10-14T01:05:00.000Z": "It was a busy day at the @DemocraticTaos Office! Thank you to all of the volunteers across New Mexico who are working to ensure that voters get to the polls this year! If you're interested in helping during these final 3 weeks, sign up here: https:// nmdemocrats.org/get-involved/v olunteer/   #nmpol", "2018-10-13T21:04:49.000Z": ". @Michelle4NM walks the Northern New Mexico rancher talk today in TA. 14th gen sheep ranchers.\n\nShe's one of us.", "2018-10-13T23:28:03.000Z": "I stopped by the Art Car Show at the Vagrant Heart in Taos this afternoon to check out the incredible work of so many local artists - on their cars! Community art is such an important aspect of NM culture that I will highlight & invest in as gov to grow our arts economy. #nmpol", "2018-10-13T20:49:40.000Z": "Great energy at today's event in Tierra Amarilla about creating good-paying jobs and investing back in rural New Mexico! I'll be a governor who fights for improved infrastructure, access to water and economic investments for our ranching and farming communities. #nmpol", "2018-10-13T20:18:27.000Z": "Replying to @Michelle4NM The outdoor recreation industry is $9.9 Billion dollar industry in NM. This Office will create new jobs and tourism across NM. Thank you @Michelle4NM", "2018-10-13T19:13:07.000Z": "Nearly 1 in every 5 New Mexicans live in poverty. As governor, I'll create a ladder out of poverty by removing the cliff effect and ensuring families aren't putting their benefits at risk as they work toward a brighter financial future. #nmpol", "2018-10-13T17:26:46.000Z": "It was great to say hi to all of the Vikings & Ravens last night at the Valley vs. Rio Grande football game! Sports aren't only a key economic driver that I would leverage to build a stronger economy as gov - they're also an important outlet for students & young people. #nmpol", "2018-10-13T15:16:53.000Z": "The @balloonfiesta brings together families, not only from across New Mexico but from across the world, to experience its magic. I'm so glad I got to take my own family to see the Balloon Glow last night.", "2018-10-13T01:58:18.000Z": "Martin's priorities are New Mexico's priorities: an economy that works for everyone, affordable health care, keeping our promises to our veterans, making college affordable, and bringing more opportunity to our state. #NMSen", "2018-10-12T21:15:34.000Z": "We're incredibly lucky here in New Mexico to have so many beautiful public lands and diverse landscapes. As governor, I'll establish an Office of Outdoor Recreation to create high-paying, green jobs that boost our outdoor economy. #nmpol", "2018-10-12T19:38:05.000Z": "Thank you to @OLENewMexico for all the work that you are doing to increase community engagement and participation in our elections. By working together, we can build a stronger, more prosperous New Mexico for all our children and families. #nmpol", "2018-10-12T16:47:58.000Z": "Farming is a vital part of NM's economy and culture. It has been my honor to fight for NM's farming & ranching communities on the Agriculture Committee in Congress, & I will continue to ensure that our farmers have the resources they need as governor. #NationalFarmersDay  #nmpol", "2018-10-12T00:48:00.000Z": "On #NationalComingOutDay , I'm honored to have the support of more than 100 LGBTQ+ leaders across New Mexico. I've proudly stood with LGBTQ+ New Mexicans my entire career and as governor, I'll continue to fight for equality for all. http:// bit.ly/2EcIHt6  #nmpol", "2018-10-11T23:21:43.000Z": "One of my top priorities as gov will be to invest back into NM businesses to grow our economy. I'll request that the State Investment Council invests the full 9% of the Severance Tax Permanent Fund so we have 100s of millions of $ more to invest in our local businesses. #nmpol", "2018-10-11T20:15:00.000Z": "We need to do more to elect leaders who look like the communities they represent, but we're proud of @Michelle4NM for being one of only three Latino gubernatorial nominees this year. #nmpol  https:// goo.gl/xN98xu", "2018-10-11T20:57:06.000Z": "I'm proud to be from a long line of strong women and to have two resilient daughters and one fierce granddaughter, Avery. On #DayoftheGirl , I'm reminded of why I'm running for governor: to build a stronger economy and brighter futures for Avery and all the girls across NM. #nmpol", "2018-10-11T17:50:34.000Z": "Happy #NationalComingOutDay , New Mexico! Everyone should be proud of who they are. I promise to keep fighting for equality and acceptance for all.", "2018-10-11T15:00:01.000Z": "It's time we stopped sending taxpayer dollars across state lines - @Michelle4NM wants to use state contracts to support local businesses, creating good paying jobs right here in New Mexico! #nmpol Lujan Grisham calls for bipartisan tax commission ALBUQUERQUE, N.M. -In a speech to hundreds of business leaders Wednesday, U.S. Rep. Michelle Lujan Grisham promised to work across party lines if she's elected governor and to champion New Mexico as... abqjournal.com", "2018-10-11T14:40:54.000Z": "I'm on the Erica Viking Show right now talking about my plans to build a stronger New Mexico! Tune into @Coyote1025 or listen here: http:// coyote1025.com  #nmpol", "2018-10-10T19:26:20.000Z": "For too long, New Mexico businesses have lost contracts to out-of-state firms. As governor, I'll implement a procurement code that favors New Mexico businesses to grow our economy and create good-paying jobs for our families. #nmpol", "2018-10-10T17:48:29.000Z": "Representative Lorenzo Larrañaga will be missed. My prayers are with his family as they go through this incredibly difficult time.", "2018-10-09T22:21:15.000Z": "Opioid addiction is an epidemic that is tearing New Mexico families apart. As my third Leadership in Action Initiative, I will immediately direct the Department of Health to add opioid addiction as a condition to qualify for medical cannabis treatment. #nmpol", "2018-10-09T20:00:41.000Z": "This election is about building a stronger, more prosperous New Mexico for all our families. I'm so glad I got to spend some time with my mother, Sonja, and my new grandson, Mason, this morning. #nmpol", "2018-10-09T19:34:09.000Z": "Today is the LAST DAY to register to vote and the first day of absentee early voting! Learn more about how you can vote in this important election at http:// NMVote.org ! #nmpol", "2018-10-09T17:55:07.000Z": "Today is the first day of absentee early voting and the LAST DAY to register to vote, New Mexico! This morning, #TeamMichelle & @NMDEMS voted to take NM in a new direction with a strong economy & good-paying jobs. Find out more at http:// NMVote.org ! #nmpol  #BeAVoter", "2018-10-09T16:09:25.000Z": "It's time we diversify New Mexico's economy and make our state the world's clean energy leader. I'll be a governor who fights to achieve that goal and leads New Mexico into a new era of job creation and economic prosperity. #nmpol", "2018-10-09T00:17:00.000Z": "I'm overwhelmed by your enthusiasm for my plans to take New Mexico in a new direction. I need your help to make those plans a reality - make sure you're registered to vote at http:// NMVote.org . #nmpol", "2018-10-08T21:31:21.000Z": "Now streaming: thousands of jobs and millions of dollars into NM. Welcome to New Mexico, @Netflix ! This will be a big boost to NM's economy and as governor, I'll double the number of productions in NM and increase the tax credit cap to continue creating good-paying jobs. #nmpol Quote Tweet Mayor Tim Keller @MayorKeller Welcome to Albuquerque, @netflix ! Show this thread", "2018-10-08T20:24:42.000Z": "Netflix and chile. Quote Tweet Albuquerque Journal @ABQJournal Breaking: Netflix to buy ABQ Studios http:// bit.ly/2Ryg9wx", "2018-10-08T19:44:48.000Z": "Our sovereign nations have been shut out of the conversation for too long and as governor, I'll partner with all of New Mexico's governors to strengthen our economy and build infrastructure. #nmpol", "2018-10-08T19:44:33.000Z": "On #IndigenousPeoplesDay2018 and Day 2 of my Leadership in Action Initiatives, I'm proud to announce that once elected, I will convene a tribal summit to discuss the issues impacting New Mexico's tribes and pueblos. #nmpol", "2018-10-08T19:30:00.000Z": "Voter registration ends TOMORROW - if you want your voice heard in November, you have to register before the deadline closes. Visit http:// NMVote.org immediately and register today! #nmpol Tuesday last day to register to vote for Nov. 6 election ALBUQUERQUE, N.M. (Associated Press) -- Tuesday is the last day to register to vote for New Mexico's Nov. 6 general election. Voters can register in person at county clerks' offices and certain other... abqjournal.com", "2018-10-08T17:36:45.000Z": "Happy #IndigenousPeoplesDay2018 , New Mexico! I spent this morning at the Pueblo of Zia talking with Governor Delgarito and Lt. Governor Salas about the important contributions New Mexico's tribes and pueblos have made to our state. Thank you for the warm welcome! #nmpol", "2018-10-07T22:13:07.000Z": "On day one of my administration, I'll sign an executive order immediately instructing PED to cease the use of the PARCC exam and partner with educators, parents and students to develop a new type of evaluation system. #nmpol", "2018-10-07T22:11:00.000Z": "In just 30 days, New Mexico will go to the polls and elect a new governor of our state. Today, I am launching my 30 Leadership in Action Initiatives so New Mexicans have a better idea of just how ready I am to take our state in a new direction. #nmpol", "2018-10-07T15:52:41.000Z": "With just 30 days to go until Election Day on November 6th, I hope you'll tune in to @newmexicopbs tonight at 6pm to learn more about my plans to invest back into our schools, diversify the economy with clean energy and create good-paying jobs for our working families. #nmpol", "2018-10-07T01:54:20.000Z": "Thank you to everyone for giving this Lobo a warm welcome tonight at the @NMStateAggies ' Homecoming! As governor, I'll fight to diversify our economy in southern New Mexico by investing in clean energy and building our infrastructure. #nmpol  #AggieUp", "2018-10-06T23:00:30.000Z": "I'm excited to be at @NMStateAggies ' Homecoming Football Game with @NMSU Athletic Director @MarioMocciaNMSU ! Sports at the collegiate level are such important drivers of our local economies & I'm looking forward to creating good-paying jobs by highlighting our great teams. #nmpol", "2018-10-06T19:27:52.000Z": "Thank you to everyone for the warm welcome this morning at the Northern Navajo Shiprock Parade! As governor, I'll partner with Navajo leaders and all our tribes and pueblos to boost our economy, build NM's infrastructure and create good-paying jobs for all our families. #nmpol", "2018-10-06T01:12:42.000Z": "It was great to see everyone tonight in support of @CVNMVerdeVoters . As governor, @Michelle4NM will diversify and grow our economy by investing in clean energy. Read our plan here: http:// bit.ly/CleanEnergyLea der   #nmpol", "2018-10-06T01:13:26.000Z": "Thank you to everyone who came out to our Navajo Nation Meet & Greet in Shiprock this evening to learn more about my plans to partner with Navajo leadership to create jobs and build infrastructure in NW NM. I'm looking forward to seeing you all tomorrow at the parade! #nmpol", "2018-10-05T21:46:01.000Z": "This unthinkable tragedy took place just as he began a new job at Los Alamos National Labs and while he was working hard for change in his community. He was a remarkable young man who touched countless lives and who will not be forgotten.", "2018-10-05T21:45:39.000Z": "My heart is broken hearing about the murder of Cameron Martinez. My prayers are with his parents, Urban and Valerie, his family, and the entire community of Española.", "2018-10-05T20:43:45.000Z": "Happy #WorldTeachersDay ! I'll be a governor who invests back into our classrooms, gives New Mexico teachers a raise and makes pre-k a reality for all our families. Read my plan to take our public schools in a new direction: http:// bit.ly/ANewDirection4 NMSchools   #nmpol", "2018-10-05T17:05:50.000Z": "US House candidate, NM-1 We've all faced struggles that made us fierce. I want to be a champion for our schools and our kids. Affordable healthcare that serves everyone is fundamental. A clean energy future will build opportunity. #WhyIRun Quote Tweet EMILY's List @emilyslist There's a lot we're sad, angry, and frustrated about. And surprisingly, there's also a lot to be hopeful for. So today we're asking our pro-choice Democratic women to tell us: Why are you running for office? What are you fighting for? #WhyIRun", "2018-10-05T17:27:32.000Z": "I'm running to build a stronger New Mexico and create brighter futures for my grandchildren, Avery and Mason. #WhyIRun  #nmpol Quote Tweet EMILY's List @emilyslist There's a lot we're sad, angry, and frustrated about. And surprisingly, there's also a lot to be hopeful for. So today we're asking our pro-choice Democratic women to tell us: Why are you running for office? What are you fighting for? #WhyIRun", "2018-10-05T00:00:01.000Z": "Michelle Lujan Grisham's newest grandchild was born last night at 11:52pm! Sign our digital card and send your well-wishes to baby Mason and the entire family! #nmpol Congratulations Michelle! - New Mexico Democrats Last night Congresswoman Michelle Lujan Grisham became a grandmotheragain! Mason Gray Stewart is 6lbs and 13oz and was born at 11:52pm last night. The family couldn't be happier! Sign our digital... nmdemocrats.org", "2018-10-04T20:04:22.000Z": "Sunland Park is fired up about electing Democrats up & down the ballot in November! Thank you to everyone who joined me & @XochforCongress at the @NMDEMS office opening last night to hear more about @Michelle4NM 's plans to create jobs & strengthen southern NM's economy. #nmpol", "2018-10-04T17:42:12.000Z": "My family and I are excited to announce the birth of my grandson, Mason Gray Stewart, born last night at 11:52pm weighing 6 lbs, 13 oz.", "2018-10-03T23:40:43.000Z": "Together, we can create opportunities for our families. As governor, I will invest back into New Mexico businesses to grow the economy and create new and better-paying jobs. Read my plan: http:// bit.ly/2HHP70u  #nmpol", "2018-10-03T19:43:53.000Z": "Thank you for all your hard work, Jackson! Together, we're building a #NM4All . #nmpol Quote Tweet tear down all confederate statues @jacks_faulkner The view from the office was pretty nice today. Proud to be canvassing for a #NM4All to protect New Mexico's public lands. Thank you @TeamHeinrich , @Michelle4NM , and @Deb4CongressNM , for standing up for our natural heritage. @NMDEMS  #nmpol", "2018-10-03T18:24:07.000Z": "I hope you'll join me and @XochforCongress tonight at 6pm for our @NMDEMS Office Opening! RSVP: https:// facebook.com/events/3900388 08197194/   #nmpol", "2018-10-03T18:25:11.000Z": "I'm honored to be fighting alongside @Deb4CongressNM to build a New Mexico with a strong economy and good-paying jobs. With 34 days to go until Election Day, we need your help! Volunteer to elect all of the incredible @NMDEMS across New Mexico: http:// bit.ly/2Nb2Gw7  #nmpol", "2018-10-02T19:33:28.000Z": "Yesterday, @Morales4LtGovNM & I were honored to receive President @BarackObama 's endorsement for Gov & Lt Gov of NM! I'll be a governor who invests back into #smallbiz , strengthens our economy, & creates good-paying jobs for all NM families. http:// bit.ly/2DRtai1  #nmpol President Obama endorses Lujan Grisham, Morales kob.com", "2018-10-02T16:31:44.000Z": "Shoutout to @TeamHeinrich for steadfast support for #LWCF . Your work today with Senate @EnergyDems & @EnergyGOP to #SaveLWCF will hopefully go a long way toward getting LWCF reauthorized and fully funded asap. #nmpol Quote Tweet Martin Heinrich @TeamHeinrich \"We believe that the essential component of stewardship is leaving our state and our lands better than we received them. In order to do that we must permanently reauthorize the Land and Water Conservation Fund.\" https:// goo.gl/hi8dNj", "2018-10-02T16:29:45.000Z": "As governor, there will be no forgotten communities. I'll fight for good-paying jobs, a strong economy, and access to updated infrastructure for all New Mexico children and families. @HectorBalderas  @Morales4LtGovNM  #nmpol", "2018-10-01T23:21:46.000Z": "I felt the enthusiasm for @Michelle4NM this morning at the Eastern New Mexico State Fair Parade! I'm looking forward to spending more time in eastern New Mexico talking to voters about our plans to create good-paying jobs and strengthen our economy. #nmpol", "2018-10-01T20:48:31.000Z": "US House candidate, NM-1 Congratulations! @Michelle4NM , @Morales4LtGovNM , @ANewDayForNM, Abbas Akhil, @MelanieforNM , Karen Bash #nmpol  #befierce Quote Tweet Barack Obama @BarackObama Today, I'm proud to endorse even more Democratic candidates who aren't just running against something, but for something-to expand opportunity for all of us and to restore dignity, honor, and compassion to public service. They deserve your vote:", "2018-10-01T21:00:00.000Z": "From boosting the minimum wage and supporting our film industry to expanding rural broadband and championing alternative energy, @Michelle4NM has a plan to grow New Mexico's economy. #nmpol Lujan Grisham: 'I don't rubber-stamp anything' Candidate for governor runs as a nonpartisan problem-solver abqjournal.com", "2018-10-01T21:44:11.000Z": "The excitement for creating jobs and boosting our economy is overwhelming! As we head into the final 5 weeks until Election Day on November 6th, let's keep up the momentum! #nmpol", "2018-10-01T18:17:51.000Z": "I'm honored to receive the endorsement of President @BarackObama . With his support, I'll work alongside @Michelle4NM to create jobs, fix our broken public education system, and improve access to health care in rural New Mexico. Read more: http:// bit.ly/2NeRlq0  #nmpol", "2018-10-01T17:31:17.000Z": "Thanks, @BarackObama ! We agree, @Michelle4NM and @GinaRaimondo are passionate leaders who will make a positive difference for their communities! #High5forKids Quote Tweet Barack Obama @BarackObama Today, I'm proud to endorse even more Democratic candidates who aren't just running against something, but for something-to expand opportunity for all of us and to restore dignity, honor, and compassion to public service. They deserve your vote:", "2018-10-01T17:18:45.000Z": "That's why I'm so honored to have Pres @BarackObama 's support and trust as we work every day to protect and build on his legacy in New Mexico and create real opportunities for families across the state. Read more: http:// bit.ly/2NeRlq0  #nmpol", "2018-10-01T17:18:25.000Z": "This election is about bringing energy, vision, and experienced leadership to Santa Fe to build a stronger economy, expand health care access, and create a better future for our kids. #nmpol", "2018-10-01T16:46:18.000Z": "Today, I'm proud to endorse even more Democratic candidates who aren't just running against something, but for something-to expand opportunity for all of us and to restore dignity, honor, and compassion to public service. They deserve your vote:", "2018-10-01T01:20:40.000Z": "Thank you to everyone who came out this afternoon for our rally in SW ABQ! I'll be a governor who invests back into small businesses, creates good-paying jobs, and boosts our economy for all our families. #nmpol", "2018-09-30T22:40:43.000Z": "So glad I got to talk to the voice of the @UNMLOBOS last night at the @UNMLoboFB Homecoming Game about the importance of sports in our local economies and keeping our young people in New Mexico. Thanks for saying hi, @dylanhstorm ! #nmpol"}