{"2020-07-30T20:09:33.000Z": "The COVID-19 pandemic has presented challenges to not just our physical health, but our emotional and financial health as well. @ncdhhs has shared these important tips on how North Carolinians can take of their mental wellbeing during this stressful time.", "2020-07-30T19:03:51.000Z": "Our country has held free elections during crises throughout our history and this year will be no different. North Carolinians will choose their leaders safely and securely on November 3rd and rally together to defeat this pandemic. - RC", "2020-07-30T14:45:41.000Z": "NCDHHS Secretary Mandy Cohen, M.D. and members of the Coronavirus Task Force will be available today at 2 p.m. for a dial-in media briefing regarding #COVID19NC .\n\nThe live stream will be online at http:// ncdps.gov/news-conference .", "2020-07-30T14:30:45.000Z": "Do you have a hurricane preparedness plan in place? NC Emergency Management Director Mike Sprayberry shares some steps you can take to keep you and your family safe during hurricane season. #ReadyNC  #NCPrep  #severewx", "2020-07-29T19:26:41.000Z": "Many families have been relying on federal unemployment benefits to pay bills and put food on the table. Congress needs to do more to support the millions who are out of work through no fault of their own. With weekly $600 gone, NC unemployment benefits alone are not enough, workers say North Carolina unemployment benefits ranked low, even before the pandemic. newsobserver.com", "2020-07-28T22:54:31.000Z": "Actions to slow the spread of COVID-19 are starting to have an impact, but we need to double down. Stopping alcohol sales at 11 pm is a targeted strategy that can help move us in the right direction. North Carolina Gov. Cooper announces statewide curfew on alcohol sales at restaurants RALEIGH, N.C. (WNCN) - Gov. Roy Cooper announced a statewide curfew on alcohol sales at restaurants will go into effect on Friday. Restraurants will be unable to sell alcohol after 11 p.m. The gove wavy.com", "2020-07-28T20:13:52.000Z": "For now, let's stick together and do what we know works to prevent disease spread while supporting each other. And that is how we will make it through.", "2020-07-28T20:13:37.000Z": "COVID-19 has made life difficult for families across our state, but it won't be this hard forever. We are encouraged that vaccine development is showing promise and that we can win this fight against the pandemic.", "2020-07-28T20:13:21.000Z": "My administration is putting in place an effort to help people with their rent and utility bills. We're putting together a plan using funding from the CARES Act, and we will be announcing this soon.", "2020-07-28T20:13:09.000Z": "Our state legislature needs to do better when it comes to unemployment during a pandemic. Payments are too low for too short of a time. The state legislature also turned away legislation to create a statewide fund to help support people who are hurting because of this pandemic.", "2020-07-28T20:12:42.000Z": "I continue urging North Carolina's congressional delegation and all of Congress to put politics aside and do what is right as this pandemic still rages on. The $200 a week supplement the Senate proposed is not enough and Congress and the President need to do more.", "2020-07-28T20:12:20.000Z": "As the end of this month approaches, I know many families are concerned about rent and utility payments coming due. This is especially difficult now that federal unemployment benefits that were helping to cover those bills will be cut off abruptly due to inaction in Washington.", "2020-07-28T20:11:52.000Z": "This will be particularly important as colleges and universities are scheduled to start, bringing people all over the country to our state. We've seen case numbers increase among younger people, and prevention is critical to slowing the spread of the virus.", "2020-07-28T20:11:36.000Z": "Several local governments have already taken this step. Their orders will remain in place, as long as they are as strict or more strict, and our statewide order will go into effect anywhere that does not already have such a curfew already.", "2020-07-28T20:11:13.000Z": "Public health experts and examples from other states show that bars & other places where people gather closely together are a high-transmission setting. We want to prevent restaurants from turning into bars after hours. We're hopeful that this new rule can help drive down cases.", "2020-07-28T20:10:51.000Z": "To drive down numbers and continue our trends moving in the right direction, we're announcing today a statewide curfew on the sale of alcohol at restaurants. Effective this Friday, July 31, restaurants must stop selling alcoholic drinks after 11 pm. Bars will remain closed.", "2020-07-28T20:10:22.000Z": "Stable is good, but decreasing is better. Slowing the spread of this virus requires targeted strategies that help lower the risk of transmission.", "2020-07-28T20:10:10.000Z": "Other states have had to go backward when they saw sharp increases in their case numbers that overwhelmed hospitals. Fortunately, we've avoided that. And it's because we have mandated masks and eased restrictions carefully, in modest phases. We do not want to go backward.", "2020-07-28T20:09:57.000Z": "It's encouraging to see our numbers are stabilizing, particularly when other states are seeing spikes. But the numbers are still too high. In order to start a downward trend, we have to double down on actions that slow the spread of the virus.", "2020-07-28T20:02:37.000Z": "As of today we have more than 116,000 lab-confirmed cases; 1,749 new cases since yesterday; 1,244 people in the hospital; and, sadly, 1,820 people who have died. Our thoughts are with everyone battling this virus, recovering from it or mourning a loved one.", "2020-07-28T20:01:52.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will be sharing updates on COVID-19 at 4 PM. Watch live here: https:// twitter.com/i/broadcasts/1 YqxoRwYNyAJv ", "2020-07-28T19:53:33.000Z": "Gov. Cooper and members of the Coronavirus Task Force will be sharing updates on COVID-19 at 4 PM. Watch live here: Governor Roy Cooper @NC_Governor Gov. Cooper COVID-19 Briefing -July 28, 2020", "2020-07-28T14:37:52.000Z": "Governor Roy Cooper and members of the Coronavirus Task Force will share updates on #COVID19NC today at 4 p.m.\n\nView live stream here: https:// ncdps.gov/storm-update", "2020-07-27T19:39:15.000Z": ". @NCDHHS is continuing to expand access to free COVID-19 testing with 39 upcoming events in underserved communities. If you have symptoms, work in a high-risk setting, or may have been exposed to the virus, find a testing event near you here: Upcoming NCDHHS COVID-19 community testing events scheduled RALEIGH, N.C. (WNCT) The North Carolina Department of Health and Human Services (NCDHHS) has 39 upcoming community testing events scheduled in Bladen, Duplin, Johnston, Edgecombe, Henderson, Hertfo wnct.com", "2020-07-27T15:52:52.000Z": "There are many ways to support our state during the COVID-19 pandemic. @VolunteerNC lists several statewide and regional volunteer opportunities on their website - including ways to volunteer from home! Learn more: https:// nc.gov/volunteer", "2020-07-27T14:32:03.000Z": "It's #MaskUpMonday !\n\nWATCH: Dr. @betseytilson , State Health Director & Chief Medical Officer for NCDHHS, shows you how to properly wear, handle & care for your cloth face covering. When leaving home remember to practice all 3 W's: WEAR, WAIT, & WASH. #COVID19NC  #StayStrongNC", "2020-07-26T17:00:57.000Z": "Secretary Sanders brings eastern North Carolina common sense and a can-do attitude to tackling some of our state's toughest issues. Her leadership has made North Carolina a more inclusive place, and you can always count on her to get the job done. Machelle Sanders has a passion for amplifying the voices of those who need to be heard Machelle Sanders, Secretary of NC's Department of Administration, draws upon her small-town upbringing to foster inclusiveness and promote diversity in whatever role she takes. She's The News &... newsobserver.com", "2020-07-24T18:14:11.000Z": ". @NC_Governor Roy Cooper today ordered all US and NC flags at state facilities to be lowered to half-staff beginning today until sunset on July 28 in honor of Fort Bragg Paratrooper, Sgt. Bryan Cooper Mount. Read more here: https:// bit.ly/2EgTi6G", "2020-07-24T17:48:52.000Z": "Since this pandemic started, the @NCNationalGuard has been delivering PPE, food and other critical supplies to our communities. As they wind down their COVID-19 relief efforts today, I want to thank these brave service members for helping us during this unprecedented crisis. - RC", "2020-07-23T15:56:40.000Z": "NCDHHS Secretary Mandy Cohen, M.D. and members of the Coronavirus Task Force will be available today at 2 p.m. for a dial-in media briefing regarding #COVID19NC .\n\nThe live stream will be online at http:// ncdps.gov/news-conference .", "2020-07-23T15:11:00.000Z": "It's not safe for some people to go back to work and many don't have jobs to return to yet. If federal unemployment benefits are cut off at the end of this week, it will hurt thousands of North Carolina families as well as our local economies. Congress Needs to Act Now and Extend Unemployment Benefits for Struggling Workers Next week, thousands of North Carolinians who are out of work due to COVID-19 will see a drastic reduction in their unemployment benefits medium.com", "2020-07-22T14:30:45.000Z": "Prepare for hurricane season by updating your family's evacuation plan. Make plans with family or friends in case you need to evacuate your home during a storm. Shelters may be sparse or look different this year due to the COVID-19 pandemic. More info at https:// readync.org/plan-and-prepa re/hurricane-season-during-covid-19-pandemic  .", "2020-07-21T23:02:27.000Z": "Farmers have been working hard to keep food in our grocery stores and on our tables as our state battles COVID-19. This PPE will be distributed across North Carolina to help our farmworkers protect themselves and their families. N.C. Announces Delivery of Personal Protection Equipment To Farmers NCDHHS is delivering infection control supplies to farmers. spectrumlocalnews.com", "2020-07-21T21:50:47.000Z": "Wear a mask.", "2020-07-21T18:08:09.000Z": "Remember, this funding has a multiplier effect, going from families' pockets back into our local communities, helping small businesses and our economy stay afloat. This assistance will expire at the end of the week. The clock is ticking and all eyes are on Washington right now.", "2020-07-21T18:07:44.000Z": "While legislators were in session the last few months, they refused to do anything to help.  When the legislature returns, I urge them to re-evaluate North Carolina's own unemployment compensation to support people who find themselves sidelined because of this virus.", "2020-07-21T18:07:23.000Z": "This extra $600 has been especially important here in North Carolina, where the legislature several years ago slashed unemployment insurance benefits to among the lowest in the nation and made them available for only 12 weeks.", "2020-07-21T18:07:05.000Z": "We've seen the dire consequences of re-opening too early in places around the country. Their hospitals and ICU beds are full and the virus is worse than it was in March and April. Many people cannot safely go back to their jobs, and many don't have jobs to return to.", "2020-07-21T18:06:46.000Z": "Though we right now are adding jobs back to our economy, folks are struggling and many are still out of work. So far, we've paid over 815,000 North Carolinians more than $6.2 billion dollars. It'll hurt these people and our economy if their benefits are drastically reduced.", "2020-07-21T18:06:12.000Z": "This program has been a lifeline for families and their communities, giving people the ability to pay their rent or utilities, to put food on the table and to make ends meet. I am urging Congress to act quickly to extend this benefit.", "2020-07-21T18:05:56.000Z": "Many North Carolinians who are out of work are worried about the upcoming reduction in their unemployment benefits. The Federal Pandemic Unemployment Compensation program offers an additional $600 a week to unemployed workers who've been out of work through no fault of their own.", "2020-07-21T18:05:24.000Z": "Meanwhile, North Carolina continues to focus on ways to make testing more accessible and more available to communities that need it. @NCDHHS has expanded free COVID-19 testing to underserved communities that currently have limited testing sites.", "2020-07-21T18:05:04.000Z": "Not only is wearing a mask the decent, neighborly thing to do, it's the best way to boost our economy.", "2020-07-21T18:04:55.000Z": "For those who continue to defy basic decency and common sense because they refuse to wear a mask - either wear one or don't go in the store. The refusal to wear a mask is selfish. It infringes on the life and liberty of everyone else in the store.", "2020-07-21T18:04:34.000Z": "I want to thank major retailers like Walmart, Costco, Fresh Market and Lowes and so many other businesses which are requiring face masks in their stores. This type of leadership by example shows the public that these retailers truly care about their customers and their employees.", "2020-07-21T18:04:07.000Z": "We must keep food in our grocery stores and on our tables. To do that, we must help protect farmers and their families from this virus. I appreciate the collaboration that makes this delivery of equipment possible.", "2020-07-21T18:04:00.000Z": "The 31 counties that are home to three-fourths of our state's farm workers will receive the first delivery. This effort is a partnership among NCDHHS, NC Cooperative Extension, the state Department of Agriculture, the state Department of Labor and the NC Agromedicine Institute.", "2020-07-21T18:03:26.000Z": "Agriculture is vital to our economy and our food supply, and it's a tough job you can't do from home. This personal protective equipment will be delivered this week to North Carolina Cooperative Extension centers across the state and then be distributed to our farmers.", "2020-07-21T18:03:08.000Z": "As we continue fighting COVID-19 on many fronts, I'm glad to announce today that North Carolina is delivering over 900,000 masks and other supplies to farm workers across our state.", "2020-07-21T18:02:51.000Z": "Since our last update we have passed the 100,000 mark of confirmed cases. This is a somber, serious benchmark. We pray for those who've lost loved ones to this virus.", "2020-07-21T18:02:09.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will share updates on COVID-19 at 2 PM. Watch live here: https:// twitter.com/i/broadcasts/1 ynJOqrkDyQKR ", "2020-07-21T17:51:25.000Z": "Gov. Cooper and members of the Coronavirus Task Force will share updates on COVID-19 at 2 PM. Watch live here: Governor Roy Cooper @NC_Governor Gov. Cooper COVID-19 Briefing -July 21, 2020", "2020-07-21T14:25:47.000Z": ". @NC_Governor and members of the Coronavirus Task Force will give an update on #COVID19NC at 2 P.M.\n\nView live stream here: https:// ncdps.gov/storm-update", "2020-07-20T20:31:10.000Z": "Proud of the @Canes and the example they're setting for their fans. Hurricanes' team photo this year has a new look: everyone wearing a mask Canes coach Rod Brind'Amour: \"We know we have to do this to give us a chance\" to slow the spread of the coronavirus. newsobserver.com", "2020-07-20T17:38:44.000Z": "New testing sites are being added across North Carolina every day. \n\nIf you've been in a crowd or have any symptoms, find a place to get tested here: https:// covid19.ncdhhs.gov/about-covid-19 /testing/find-my-testing-place/pop-testing-sites  From NCDHHS", "2020-07-19T21:01:48.000Z": "Happy Birthday to my love, Kristin, an amazing First Lady. - RC", "2020-07-18T16:42:14.000Z": "My beloved @Canes - the toughest guys around - know the importance of wearing the mask to protect people around them. Go Canes! - RC", "2020-07-18T14:58:12.000Z": "Congressman John Lewis was a hero whose lessons will echo for generations to come. Let's all honor him by working to live up to his example. - RC", "2020-07-17T18:44:02.000Z": "Governor Cooper has laid out his priorities for the help still needed from Washington to battle COVID-19, protect people's health and support an economic recovery. https:// governor.nc.gov/news/governor- cooper-urges-congress-pass-additional-state-support-coronavirus-response ", "2020-07-17T15:30:43.000Z": "Governor Roy Cooper announced North Carolina will continue to stay paused in Safer at Home Phase 2 when the current Executive Order expires today. The order will be extended for three weeks until Aug. 7. \n\nRead more: https:// nc.gov/covid-19/stayi ng-ahead-curve ", "2020-07-16T15:35:21.000Z": "Ana Lucia Divins and Irania Patterson of @ccmangosauce join us today on #AtHomeWithFLONC ! The Charlotte-based group introduces the Spanish language and Latin culture to children through bilingual performances and storytelling. Visit our Facebook page for the full video!", "2020-07-16T19:11:06.000Z": "Our Latinx community has been disproportionately affected by COVID-19. @NCDHHS has launched the Spanish language symptom checker to fight this disparate impact and give people reliable information about symptoms and testing resources in their communities. Governor Cooper announces NCDHHS Spanish language website and tools to check for COVID-19 symptoms RALEIGH, N.C. (WNCT) Governor Roy Cooper announced that the North Carolina Department of Health and Human Services launched a new online tools to help Spanish-speaking North Carolinians to determin wnct.com", "2020-07-16T16:51:02.000Z": "It's graph day - Dr. Cohen will be going through our state's data and trends today at 2 PM. Quote Tweet NCDHHS @ncdhhs NCDHHS Secretary Mandy Cohen, M.D. along with the members of the Coronavirus Task Force will be available today at 2 p.m. for a dial-in media briefing regarding #COVID19 .\n\nThe live stream will be online at http:// ncdps.gov/news-conference .", "2020-07-16T14:43:32.000Z": "COVID-19 has highlighted the longstanding disparities in our health care and economic systems. The members of this task force will work with communities to address and fix these inequities as we recover from this pandemic. https:// governor.nc.gov/news/governor- cooper-names-members-andrea-harris-social-economic-environmental-and-health-equity ", "2020-07-15T20:32:56.000Z": "Gov. Cooper announced yesterday that we will stay in Safer At Home Phase 2 for another three weeks:\n\n\"Our re-opening priority is the school building doors, and in order for that to happen we have to work to stabilize our virus trends.\" https:// governor.nc.gov/news/north-car olina-k-12-public-schools-require-key-safety-measures-allow-person-instruction ", "2020-07-15T12:28:24.000Z": "Throughout this pandemic, the most important opening in our state has been that of our classroom doors. Yesterday, Gov. Cooper announced that North Carolina schools will be opening this fall for both in-person and remote learning.", "2020-07-14T19:11:28.000Z": "CDC Director Robert Redfield said that if everyone could wear a face covering over the next six weeks, we could drive this virus into the ground. Let's do that for our children, if nothing else.", "2020-07-14T19:11:12.000Z": "We want to be done with this pandemic, but it's not done with us. We'll continue toward the school year & work together with everyone's safety in mind. The easiest & most effective way we can ensure our children go to school in August and ease economic restrictions: wear a mask.", "2020-07-14T19:10:13.000Z": "Easing restrictions now to allow more high-transmission activities could cause a spike that would threaten our ability to open schools. The most important opening is that of our classroom doors.", "2020-07-14T19:09:58.000Z": "Our virus trends are not spiking like some other states. We have hospital capacity and our percent positive is still high but it's steady. However, our numbers are still troubling and they could jump higher in the blink of an eye.", "2020-07-14T19:09:40.000Z": "Today, I also announce that when the current executive order expires this Friday, July 17, North Carolina will continue to stay paused in Safer at Home Phase 2 for three weeks.", "2020-07-14T19:09:29.000Z": "Ensuring that this plan protects not just students, but teachers and staff, too, is the top priority. I strongly encourage all superintendents and principals to listen to teachers and staff as they shape their plans. This will be challenging, but I have faith in our teachers.", "2020-07-14T19:08:56.000Z": "In March, our teachers and school staff dove head first into the challenge of remote learning and meal distribution. They rose to the occasion, and now we're asking them to rise even higher and dig even deeper. So we must move ahead with the resources needed to protect them.", "2020-07-14T19:08:45.000Z": "My mom was a teacher. I've spent time with teachers in every corner of our state. It didn't take a pandemic for me to understand that teachers are some of our most essential employees - pulling from their own pockets to buy supplies and getting in early just to stay late.", "2020-07-14T19:08:35.000Z": "We know that schools provide much more than academic lessons. They support children's social, emotional & physical development. They're reliable sources of good meals. And they're a critical line of defense when a student has a troubled home life including abuse, hunger & more.", "2020-07-14T19:07:47.000Z": "We know there will always be some risk with in-person learning and we are doing a lot to reduce that risk. But as pediatricians and other health experts tell us, there is much risk in not going back to in-person school.", "2020-07-14T19:07:30.000Z": "There are no decisions more important than the ones about our children and our schools. This announcement is the result of careful, collaborative and painstaking work. As with many choices during this pandemic, we are working with the best information and science we have today.", "2020-07-14T19:07:09.000Z": "The start of school is a month away for most of our children & we know a lot can happen with the virus during that time. If trends spike and in-person school cannot be done safely with these safety protocols, then we will need to move to all remote learning like we did in March.", "2020-07-14T19:06:55.000Z": "Plan B is a baseline for our state. However, as I said earlier, districts can choose plan C - which requires all remote learning - if they determine that is best for those children, parents and teachers in that area.", "2020-07-14T19:06:44.000Z": "Schools will look a lot different this year in order to be safe and effective. Public health experts and school leaders developed these rules to protect students, teachers and families. They also have detailed procedures for what'll happen if a student or teacher tests positive.", "2020-07-14T19:06:29.000Z": "Schools are also recommended to implement other safety precautions such as: one-way hallways & entrances; keeping students in small groups; eating lunch in the classroom if the cafeteria won't allow for social distancing; and suspending large group activities like assemblies.", "2020-07-14T19:06:12.000Z": "Teachers will work to limit sharing of personal items and classroom materials. Nonessential visitors and activities involving outside organizations will be limited.", "2020-07-14T19:05:26.000Z": "Schools must create a way to isolate students who have symptoms and ensure they can get home safely. Schedules must allow time for frequent hand washing and schools will regularly clean classrooms, bathrooms, buses and equipment.", "2020-07-14T19:05:16.000Z": "Districts and schools can use a plan that works for them - whether it's alternating days or weeks or some other strategy. Symptom screenings, including temperature checks, will take place daily before children enter the school buildings.", "2020-07-14T19:04:50.000Z": "To help, the state will be providing at least 5 reusable face coverings for every student, teacher and staff member. And we have already delivered a two-month supply of thermometers and medical-grade equipment for school nurses.", "2020-07-14T19:04:22.000Z": "Face coverings will be required for every teacher, staff and student from kindergarten through high school. The studies have shown overwhelmingly that face coverings reduce disease transmission.", "2020-07-14T19:04:07.000Z": "I know parents, students and teachers have questions about what school might look like if they attend in person. I want to share more information about some of the requirements for schools under this plan.", "2020-07-14T19:03:50.000Z": "As a part of this plan, we want local school districts to provide a remote learning option for any child who chooses it. In addition, school districts will have the option of Plan C - all remote learning - if that's best for them.", "2020-07-14T19:03:32.000Z": "It's a measured approach that will allow children to attend but provide important safety protocols like fewer children in the classroom, social distancing, face coverings, cleaning and more.", "2020-07-14T19:03:17.000Z": "Today, we announce that North Carolina schools will open for both in-person and remote learning with key safety precautions to protect the health of our students, teachers, staff and families. This is the Plan B that we asked schools to prepare.", "2020-07-14T19:02:54.000Z": "After working with health experts, school superintendents, teachers and more, we plan to put those protections in place and open our schools in a careful way.", "2020-07-14T19:02:43.000Z": "The reality is that the disease continues to spread throughout the country, and some states are seeing their hospitals fill up. But the good news is we now know more about how to slow the spread and how to protect ourselves.", "2020-07-14T19:02:27.000Z": "March feels like a long time ago, given everything we've been through. And that was just the beginning of a series of tough decisions to slow the spread of COVID-19 that have helped our state cope and prevented our hospitals from being overwhelmed.", "2020-07-14T19:02:12.000Z": "I know many children and parents are talking every day about what will happen with schools this year. In the spring, when this pandemic first broke out, we made the difficult but necessary decision to close in-person learning at K-12 schools and move to remote learning.", "2020-07-14T19:01:51.000Z": "As of today we have 89,484 lab-confirmed cases; 1,956 new cases reported today; 1,109 people in the hospital; and, sadly, 1,552 people who have died. The loss of a loved one from COVID-19 can be a difficult and lonely journey, and our prayers are with all of you.", "2020-07-14T19:01:41.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor At 3 PM, Gov. Cooper will be giving an update on COVID-19 and K-12 public schools. Watch live here: https:// twitter.com/i/broadcasts/1 BdGYnbyPMZJX ", "2020-07-14T18:56:24.000Z": "At 3 PM, Gov. Cooper will be giving an update on COVID-19 and K-12 public schools. Watch live here: Governor Roy Cooper @NC_Governor Gov. Cooper COVID-19 Briefing -July 14, 2020", "2020-07-14T16:29:24.000Z": "Gov. Cooper will be sharing an update on COVID-19 and making an announcement on the plan for K-12 public schools this fall at 3 PM today.", "2020-07-13T18:38:00.000Z": "Many of the people risking their own safety to support our children right now can't afford health care. That's unacceptable. We need to expand Medicaid so that we can get our childcare workers out of the coverage gap and make our state a healthier place. 1 in 5 Childcare Workers Lack Health Insurance, Heightening Their Fears Of COVID-19 COVID-19 outbreaks are springing up at a handful of childcare centers across North Carolina, threatening a vulnerable workforce of women who are largely wunc.org", "2020-07-13T14:23:33.000Z": "The risk of #COVID19 transmission is lower when you wear a cloth covering over your nose and mouth. \n\nRemember, people in North Carolina must wear face coverings when in public places where physical distancing is not possible: https:// governor.nc.gov/news/north-car olina-pauses-safer-home-phase-2-adds-statewide-requirement-%EF%BB%BF-face-coverings  .", "2020-07-11T20:35:01.000Z": "Our friend Nancy Gulledge Rorie did so much for her community and our state and we are deeply saddened to lose her to COVID-19. Our prayers are with her family and friends. - RC", "2020-07-10T19:50:37.000Z": "We know that COVID-19 doesn't just impact our physical health. These Community Health Workers will connect North Carolinians with both the medical and social support they need to beat this virus. Quote Tweet NCDHHS @ncdhhs NCDHHS is beginning an initiative that will send up to 250 Community Health Workers to areas hit hard by #COVID19 . \n\nThey will work closely w/ local health departments & contact tracers & connect North Carolinians to medical & social support resources: http:// ncdhhs.gov/news/press-rel eases/ncdhhs-send-community-health-workers-underserved-covid-19-hot-spots ", "2020-07-09T20:05:40.000Z": "Nice! Thank you @SpectrumCenter for spreading the word about the 3W's. #WearWaitWash", "2020-07-09T19:00:06.000Z": "The NC COVID-19 Student Response Corps is matching our college students to virtual public service internships. This initiative will prepare students for the workforce and help local governments and nonprofits continue responding to this pandemic. NC Gov. Cooper: NC College Students Help Local Governments, Nonprofits with COVID-19 Response An effort by Governor Roy Cooper's administration is matching North Carolina college students in need of work experience with local governments and nonprofits seeking additional help to support... governor.nc.gov", "2020-07-09T18:14:52.000Z": "As summer continues on, please continue to treat this virus like the deadly threat it is. Find safe ways to connect with friends and family. Wear a face covering in public when you're around others. And treat each other with kindness as we work to do our part to fight this virus.", "2020-07-09T18:14:32.000Z": "Just take a look at some states where an uptick in cases quickly caused hospitals to fill up. We do not want that to happen here.", "2020-07-09T18:14:18.000Z": "Our trends are not where we want them to be right now. It's good that we still have hospital and ICU bed capacity, but we're watching closely and paying particular attention to hospitals in the Charlotte area.", "2020-07-09T18:06:59.000Z": "This effort is a part of my administration's NC Job Ready initiative to make sure students are prepared for the jobs of today and tomorrow. Job readiness may be even more important during a pandemic. Interested students can find more information on our website later today.", "2020-07-09T18:06:31.000Z": "We're pleased to announce the Student Response Corps Initiative, a new virtual public service internship program aimed at matching students in need of work experience with local governments and nonprofits needing additional support for COVID-19 response efforts.", "2020-07-09T18:06:04.000Z": "This includes testing, primary care, mental health services and helping people find a safe location to isolate if they test positive. We've seen cases surge within communities as entire families become sick because of an inability to isolate a positive family member.", "2020-07-09T18:05:45.000Z": ". @NCDHHS is beginning an initiative that will send up to 250 Community Health Workers to areas with high COVID-19 caseloads. They will work closely with local health departments and contact tracers and be responsible for connecting people to medical and social support resources.", "2020-07-09T18:05:15.000Z": "This pandemic is hitting historically marginalized populations hard. Longstanding inequities have left these communities more vulnerable to COVID-19, and this major addition of free testing sites will help us save lives.", "2020-07-09T18:04:58.000Z": "We're also deploying up to 300 new, no-cost testing sites concentrated in our underserved communities that currently have limited testing options. These free sites will increase capacity in more than 100 zip code areas across our state.", "2020-07-09T18:04:37.000Z": "With these additions, we have more than 1,500 people in our state working on contact tracing. We know we need more - every state needs more. Please know that if you get a call from a contact tracer, work with them. It's important for your health and the health of your family.", "2020-07-09T18:04:16.000Z": "Contact tracers help us notify people who may have been exposed, and we're hiring more of them. We had planned to hire 250 new contact tracers, but it's gone beyond that. We now have hired more than 480, half of whom are bilingual with a focus on Spanish speakers.", "2020-07-09T18:03:49.000Z": "We're experiencing new delays in getting COVID test results back. It's tough when a person gets a test and sometimes has to wait almost a week to get results. Labs here and across the country are slowing down, partly due to a nationwide shortage of important testing supplies.", "2020-07-09T18:03:36.000Z": "We want our children back in school safely, and we will have an official announcement next week. We'll also have an announcement next week about the Executive Order that ends on July 17.", "2020-07-09T18:03:20.000Z": "There are critical decisions ahead on how we reopen schools and whether we continue to ease restrictions on certain businesses. On schools, we continue to get excellent input from teachers, superintendents and health officials.", "2020-07-09T18:02:56.000Z": "It's good that we still have hospital and ICU bed capacity. But what we know is this: The disease continues to spread, and though North Carolina isn't a surging hotspot like some other states, we could be if we don't stay strong in our fight.", "2020-07-09T18:02:40.000Z": "We are continuing to watch with concern as COVID cases and hospitalizations increase. Today is our highest day of hospitalizations and our second highest day of cases.", "2020-07-09T18:02:17.000Z": "As of today, we have 79,349 lab-confirmed cases; 2,039 new cases reported since yesterday; 1,034 people in the hospital and sadly 1,461 people who have died. We continue to pray for the victims and their families.", "2020-07-09T18:01:42.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update on COVID-19 at 2 PM. Watch live here: https:// twitter.com/i/broadcasts/1 dRJZZvLYldJB ", "2020-07-09T17:54:16.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update on COVID-19 at 2 PM. Watch live here: Governor Roy Cooper @NC_Governor Gov. Cooper COVID-19 Briefing - July 9, 2020", "2020-07-09T17:27:21.000Z": ". @NC_Governor and members of the Coronavirus Task Force will be available today for a dial-in media briefing at 2 p.m. regarding #COVID19 .\n\nView the live stream here: http:// ncdps.gov/storm-update .", "2020-07-09T13:52:05.000Z": "The state is taking action to lower barriers to COVID-19 testing so that more North Carolinians can get tested and slow the spread of this virus. North Carolina announces statewide COVID-19 test standing order, requires reporting of all test... RALEIGH, N.C. (WNCT) The North Carolina Department of Health and Human Services took action on Tuesday to decrease barriers to COVID-19 testing by issuing a Statewide Standing Order for COVID-19 di wnct.com", "2020-07-08T17:06:34.000Z": ". @NC_Governor Roy Cooper today ordered all NC flags at state facilities to be lowered to half-staff beginning Wed., July 8, 2020 until sunset on Fri., July 10, 2020 in honor of former State Senator and NC DOA Secretary Katie G. Dorsett. Read more here: https:// bit.ly/2DnEPFy", "2020-07-08T15:04:13.000Z": "Welcome home, Janaria! Thank you for the great sacrifices you've made treating others throughout this pandemic, and we're glad to have you safely back in our state. Mint Hill nurse returns home after 103-day deployment in NYC A Mint Hill woman recently returned home after spending 103-days on the frontlines of the coronavirus pandemic in New York. wbtv.com", "2020-07-07T18:03:11.000Z": "Katie Dorsett was a dedicated public servant and inspiration as the first African American woman to hold a cabinet position in North Carolina. Her work in the state senate and Department of Administration paved the way for future leaders, and she'll be deeply missed. -RC", "2020-07-07T12:35:11.000Z": "If you've tested positive for #COVID19 or been near someone with COVID-19, a member of the #COVID19NC Community Team will reach out to help. Look for NC OUTREACH (844-628-7223) or your local health department on your caller ID. #SlowtheSpread  #AnswertheCall", "2020-07-07T15:40:00.000Z": "NCDHHS Secretary Mandy Cohen, M.D., will be available today at 2 p.m. for a dial-in media briefing regarding #COVID19 .\n\nThe live stream will be online at http:// ncdps.gov/news-conference .", "2020-07-06T17:11:10.000Z": "Now is the time to prepare for hurricane season. Are you #ReadyNC ? Quote Tweet Readygov @Readygov Now is the time to #BeReady for hurricane season: Pack your emergency kit with face coverings & cleaning supplies If someone in your home has a disability, identify if they will need extra help during an emergency Have portable chargers\n\nMore: http:// ready.gov/hurricanes", "2020-07-06T19:21:41.000Z": "Today there are 982 people hospitalized with COVID-19, a concerning new high for our state. \n\nThis virus can be deadly, and we must take it seriously - wearing our masks, washing our hands & waiting 6 ft. apart - so we don't overwhelm our hospitals. We don't want to go backward.", "2020-07-06T16:06:20.000Z": "The evidence is growing each week - face coverings are the best tool we have right now to fight COVID-19. But we can only stop the spread if we all work together and wear our masks. Quote Tweet NCDHHS @ncdhhs Covering your face is a state requirement that helps others. WEAR a cloth covering over your nose and mouth. By covering your face when you go out for essential reasons, you are being a good neighbor and community member. #StayStrongNC", "2020-07-04T16:03:32.000Z": "We live in a great country that has been a beacon for freedom in the world. There is much work ahead to unlock the promise of prosperity for ALL Americans, so let's keep at it. Happy Independence Day!", "2020-07-03T17:38:24.000Z": "A little goes a long way.  Please do your part. #WearAMask  #FaceMasks4FallSports", "2020-07-03T17:44:59.000Z": "ALERT: North Carolina just reported 2,099 new cases today - a concerning new record.\n\nAs we begin the holiday weekend, please remember to celebrate responsibly - wear a mask and practice the 3W's.", "2020-07-03T14:52:27.000Z": "Wear a mask, save lives. And go @canes .", "2020-07-02T18:49:15.000Z": "This Fourth of July will look different than years past. But we can still celebrate our country's independence while following the three Ws and protecting our communities from this virus. (3/3)", "2020-07-02T18:49:14.000Z": "We're doing more testing and contact tracing, which is a good thing, but that isn't the only factor in North Carolina's increase in cases. We need to keep an eye on these metrics so our hospitals don't get overwhelmed. (2/3)", "2020-07-02T18:49:13.000Z": "Going into the holiday weekend, it's important to remember this virus doesn't take a vacation. Many North Carolinians are wearing their masks and practicing social distancing to slow the spread of COVID-19, but our trends aren't where we want them to be. (1/3)", "2020-07-02T14:38:38.000Z": "NCDHHS Sec. Mandy Cohen and NCEM Director Mike Sprayberry will give an update on #COVID19NC at 2 pm today. Watch the live stream at https:// ncdps.gov/news-conference", "2020-07-01T21:58:58.000Z": "COVID-19 has highlighted inequalities rural communities face in health care and internet access. Hometown Strong will continue working with local leaders and provide resources to help North Carolina's 80 rural counties fight this pandemic. Hometown Strong: Cooper announces effort to help rural NC with COVID-19, economy The effort will focus on ways to improve health care access, economic planning for business revitalization, and remote learning support for students and workers. wfmynews2.com", "2020-07-01T20:25:14.000Z": "Getting students back in the classroom safely is a top priority. To help schools continue plans for reopening, the state has distributed PPE Starter Packs to school nurses and staff who provide health care to students across North Carolina. https:// governor.nc.gov/news/north-car olina-continue-working-toward-getting-students-back-classroom ", "2020-07-01T19:08:22.000Z": "Sticking to these safety rules now will help get schools back open safely. It will help stabilize our numbers, keep our hospitals from being overwhelmed and at the end of the day - it will help save lives. We have the power, and we can do this together.", "2020-07-01T19:07:54.000Z": "To meet that goal, we need everyone to do what works, the three Ws - wear a face covering over your mouth and nose, wash your hands, and wait six feet apart. Especially the face covering part, which we learn every day to be more and more important to this process.", "2020-07-01T19:07:27.000Z": "A few schools are scheduled to start in July, and we ask that those schools conduct remote learning until the decision is made for in-person learning. Our goal remains getting children back in classroom for in-person instruction that's safe for students and their teachers.", "2020-07-01T19:07:05.000Z": "As you all know, my mom was a teacher. I know our educators make many sacrifices during normal times, and now, we're in extraordinary times. As school restarts in August, it's vital that we look out for the well-being of teachers and other school workers, as well as students.", "2020-07-01T19:06:44.000Z": "When we had to close schools for in-person instruction in March, our teachers and school support staff, like bus drivers and cafeteria workers, geared up for remote learning. I'm thankful for their work to keep the lessons, the meals, and the support for their students going.", "2020-07-01T19:06:33.000Z": "We've also given school districts access to statewide contracts so they can more easily purchase for their staff and students other health and hygiene supplies like cloth face coverings and hand sanitizer. We'll need to do more & we're committed to working to make schools safe.", "2020-07-01T19:06:14.000Z": "Work to prepare schools is already underway. This week, our Emergency Management & public health staff began delivering a two-month supply of medical-grade protective wear to schools across NC. These supplies will go to school nurses & staff who provide health care to children.", "2020-07-01T19:05:27.000Z": "My number one opening priority is classroom doors. So we encourage our public schools to continue that planning, with a special focus on how teachers, staff, and students can best be protected - especially those who are high-risk.", "2020-07-01T19:05:05.000Z": "We are not issuing a statewide directive today on how schools should be open in the fall. But we will soon. We want to get our students back in the classroom, and we want to make sure we get this right.", "2020-07-01T19:04:52.000Z": "School is where children learn academics, but it's also how they build the social skills, get reliable meals, stay physically fit and really become tomorrow's leaders.", "2020-07-01T19:04:37.000Z": "Let me be clear: We want our schools open for in-person instruction in August. The classroom is the best place for children to learn. Recent reports recommend it, and I know many parents and children agree.", "2020-07-01T19:04:21.000Z": "District and school administrators are still working on ways to implement those plans, and we're asking them to keep using this time to work with teachers, staff, parents and public health officials to make sure that our schools are opening in the safest possible way.", "2020-07-01T19:04:02.000Z": "Schools were asked to prepare three plans:  The first plan is in-person learning with key health and safety rules in place. The second plan is the same as the first plan, but with fewer children in the classroom at one time. And the third plan is remote learning for all students.", "2020-07-01T19:03:41.000Z": "Today we'd like to give you an update on discussions about reopening public schools for the 2020-21 school year. In early June, we released the Strong Schools NC Public Health Toolkit that laid out essential health practices for schools to re-open safely.", "2020-07-01T19:03:10.000Z": "As we go into the holiday weekend, we must keep our guard up. I know we want to gather with family and friends, but we have to remember that a large gathering, especially without masks and social distancing, is one of the most likely places for COVID-19 to spread.", "2020-07-01T19:02:48.000Z": "North Carolina continues its pause in Safer at Home Phase 2, and of course we have added the requirement for face coverings when in public. Since that took effect Friday, we're encouraged to see more people wearing their face coverings when they are out and about.", "2020-07-01T19:02:28.000Z": "As of today we have over 65,500 lab-confirmed cases; 1,843  new cases reported today; 901 people in the hospital; and 1,373 people who have died. Today is our highest day of confirmed cases. We send prayers to those who are fighting COVID or struggling after the death of a loved.", "2020-07-01T19:01:29.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update on COVID-19 at 3 PM. Watch live here: https:// twitter.com/i/broadcasts/1 mnxelbgQVLJX ", "2020-07-01T18:52:40.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update on COVID-19 at 3 PM. Watch live here: Governor Roy Cooper @NC_Governor Gov. Cooper COVID-19 Media Briefing - July 1, 2020", "2020-07-01T16:20:04.000Z": "Thanks to our resilient economy, strong workforce and welcoming communities, forward-thinking businesses continue to invest in North Carolina. \n\nToday, Gov. Cooper announced that @Centene will bring more than 3,000 new jobs to our state. Insurance giant to bring over 3,200 jobs to Charlotte, with up to $450M in incentives Centene will build a campus in the University City area, and spend $1.3 billion on the project. charlotteobserver.com", "2020-07-01T16:07:53.000Z": "JOBS ANNOUNCEMENT Yes, it may look a bit different - but today @NC_Governor (virtually) joined @CLTgov and @MeckCounty to announce that @Centene is developing a major regional HQ in CLT. \n\nThis will bring 3,237 new jobs to NC, totaling an investment of over $1 billion...", "2020-07-01T15:27:59.000Z": ". @NC_Governor will share an update on #COVID19 today at 3 p.m. Today's press conference will not include an announcement on how statewide K-12 public schools will open this coming school year.\n\nView live stream here: https:// ncdps.gov/storm-update", "2020-07-01T13:50:04.000Z": "Congrats to Oklahoma for passing Medicaid expansion! Over 200,000 people could be covered. Expanding Medicaid means access to care and security for families and another tool to fight COVID-19.   NC - it's well past time to expand Medicaid here.  Let's follow OK's lead. Quote Tweet Andy Slavitt @ @ASlavitt BREAKING: Oklahoma passes Medicaid expansion by ballot initiative! Show this thread", "2020-07-01T13:14:45.000Z": "The people of the red state of Oklahoma know that Medicaid Expansion insures working families and saves lives. Past time for legislators to make NC the 39th state to do this. - RC Oklahoma voters approve Medicaid expansion as coronavirus cases climb The state is the first to expand Medicaid during the pandemic. politico.com", "2020-06-30T18:30:30.000Z": "During today's #COVID19 press briefing, @SecMandyCohen talked about the responsibility we all have in slowing the spread of #COVID19", "2020-06-30T16:06:20.000Z": "It's on all of us to stop the spread of this virus. Putting on a mask when you leave the house and following the three Ws are easy, effective ways to protect yourself and your loved ones. Quote Tweet NCDHHS @ncdhhs WEARING a cloth face covering doesn't take the place of the other Ws. We need all three to #SlowtheSpread of #COVID19 .\n\nWEAR a cloth covering over your nose and mouth, WAIT 6 feet from others and WASH your hands to protect you, your loved ones and neighbors.", "2020-06-30T15:53:24.000Z": "NCDHHS Secretary Mandy Cohen, M.D., and Director of NC Emergency Management Mike Sprayberry will be available today at 2 p.m. for a dial-in media briefing regarding COVID-19.\n\nThe live stream will be online at http:// ncdps.gov/news-conference .", "2020-06-29T20:03:00.000Z": "As a young, Black, female scientist, @KizzyPhD has become the example she never saw when she was growing up.\n\nThe #UNC alumna is leading the NIH's search for a COVID-19 vaccine and is the @newsobserver 's Tar Heel of the Month This young, Black, female scientist from NC leads efforts to find a COVID-19 vaccine Kizzmekia Corbett, Tar Heel of the Month, \"represents a generation of young people and African-American scientists who need a seat at the table.\" newsobserver.com", "2020-06-29T15:59:51.000Z": "Brittany D. Hunt, the author of \"Whoz Ya People,\" joins us today on #AtHomeWithFLONC ! Hunt is a member of the Lumbee Tribe of North Carolina, and her book centers around Lumbee culture. Watch the full video on our Facebook page.", "2020-06-27T21:06:09.000Z": "If we wear our masks during this pause and not open everything immediately like the Legislature wants, it will be easier to move our economy forward. Texas is having to go backward. https:// ktsa.com/gov-greg-abbot t-expresses-regret-over-reopening-texas-bars-during-coronavirus/ ", "2020-06-26T21:06:20.000Z": "It's 5 PM. Face coverings are now required in North Carolina. \n\nWe can stop the spread of this virus, but we need your help. Wear a mask, save lives.", "2020-06-26T17:36:09.000Z": "Beginning at 5 p.m. today, people in NC must wear cloth face coverings in public settings - both indoors and outdoors - where staying 6 feet apart from those who are not part of their household is impossible.\n\nLearn more & help #SlowtheSpread of #COVID19 : https:// governor.nc.gov/news/north-car olina-pauses-safer-home-phase-2-adds-statewide-requirement-%EF%BB%BF-face-coverings ", "2020-06-26T15:18:44.000Z": "NCDHHS Secretary Mandy Cohen, M.D. will be joined by diverse leaders from our Hispanic/LatinX community today at 2 p.m. for a dial-in media briefing regarding COVID-19.\n\nIf you would like to view the media availability, the live stream will be online at http:// ncdps.gov/news-conference .", "2020-06-26T15:15:58.000Z": "North Carolina's face covering requirement starts at 5 PM today.\n\nIf we all work together and wear our masks, we can get trends going back in the right direction, protect our loved ones and get more North Carolinians back to work and school.", "2020-06-25T19:09:28.000Z": "The science is overwhelming - face coverings significantly reduce the spread of COVID-19. \n\nWe're thankful to have the business community helping us lead this charge to keep North Carolinians safe. Atrium Health and Business Leaders Across North Carolina Commit to 1 Million Masks As State enacts masking requirements, largest employers ensure underserved communities have access to masks atriumhealth.org", "2020-06-25T18:47:32.000Z": "As schools have made the switch to remote learning, this pandemic has shown just how critical having access to technology at home is to our students. Thank you to the @Panthers and @Lenovo for helping us bridge the digital divide in our state. Carolina Panthers, Lenovo team up to donate Chromebooks to Columbus County Schools The Carolina Panthers Player Impact Committee and Lenovo announced they have partnered with the North Carolina Department of Public Instruction to help schools in need. wect.com", "2020-06-25T15:01:06.000Z": "\"As a North Carolinian, I like to think that we look out for each other. That's why I follow the 3 W's: I wash my hands, I wait 6 feet from other people, and I wear a mask.\" - @chefandthef Vivian Howard.", "2020-06-24T22:32:52.000Z": "North Carolinians - we need you! Best thing we can all do to open our economy - simply wear a mask when you are out. Easy. Low cost. Together we can slow the spread of this pandemic, protect our loved ones, and get back to work and school.", "2020-06-24T21:25:02.000Z": "NEWS: Today @NC_Governor announced a new statewide masking requirement to slow the spread of COVID-19. We, along with business leaders across the state, have committed to collectively donating 1 million masks to make sure this policy is effective. More: Atrium Health and Business Leaders Across North Carolina Commit to 1 Million Masks As State enacts masking requirements, largest employers ensure underserved communities have access to masks atriumhealth.org", "2020-06-24T20:20:01.000Z": "Right now, the data is showing that we need to hit the pause button on reopening. But if we all work together and wear face coverings, we can protect our loved ones and get our trends back in the right direction to restore our economy and beat this virus. https:// governor.nc.gov/news/north-car olina-pauses-safer-home-phase-2-adds-statewide-requirement-%EF%BB%BF-face-coverings ", "2020-06-24T19:24:54.000Z": "Our state appreciates everything that @AtriumHealth and other hospitals and medical systems are doing right now to reach our communities and provide the care they need day in and day out.", "2020-06-24T19:19:35.000Z": "Thank you to Dennis Taylor, President of @NCNA , and all of the nurses across our state. You are heroes every day, but what you're doing right now is above and beyond. We are grateful to have you on the front lines.", "2020-06-24T19:14:19.000Z": "Already, North Carolinians have come together to get us through this. Supporting health care workers, small business owners, front line workers. Reaching out to those most in need of a helping hand. Looking out for our neighbors who may be having a hard time right now.", "2020-06-24T19:13:55.000Z": "As we watch the trends during this pause, we hope to be able to ease restrictions on playgrounds, museums and gyms on July 17, when this order expires. I know this virus has been very difficult for business owners who are anxious to open their doors. We want them to open safely.", "2020-06-24T19:13:30.000Z": "I urge everyone to be a leader in wearing face coverings. I encourage businesses to be strong in enforcing it. Slowing the spread helps our economy, and these face coverings do that.", "2020-06-24T19:13:19.000Z": "We're adding this new requirement because we don't want to go backward. We want to stabilize our numbers so we can continue to safely ease restrictions, and most importantly, get our children back in school.", "2020-06-24T19:13:07.000Z": "One important point here. Required face coverings not only cause zero harm to our economy - they in fact help our economy by making it safer to shop, do business, and keep our small businesses running.", "2020-06-24T19:12:59.000Z": "Overwhelming evidence that is growing by the week shows that wearing a face covering can greatly reduce the spread of COVID-19, especially from people who have it and don't know it yet. This is a simple way to control this virus while we protect ourselves & the people around us.", "2020-06-24T19:12:19.000Z": "There are exceptions including people with medical conditions and children under 11, people who are at home and people who are walking or otherwise exercising outside when not within six feet of others.", "2020-06-24T19:12:05.000Z": "They will be required for all employees and customers of retail businesses and restaurants as well as workers in manufacturing, construction, meat processing and agriculture settings.", "2020-06-24T19:11:51.000Z": "The other important decision is requiring face coverings when people are out in public. People must wear face coverings when in public places, indoors or outdoors, where physical distancing of 6 feet from other people who aren't in the same household or residence isn't possible.", "2020-06-24T19:11:31.000Z": "This is not where we planned to be, or wanted to be. But it is one of two important decisions that we need to make to effectively fight this disease.", "2020-06-24T19:11:19.000Z": "It's clear that our numbers will keep us from moving ahead into the next phase of easing restrictions. So today, I'm announcing that North Carolina will pause and continue our Safer At Home Phase 2 for another three weeks.", "2020-06-24T19:11:00.000Z": "The numbers we see are a stark warning, and I'm concerned. As we have watched and studied and dissected these numbers in recent weeks, that concern has grown. Since the beginning of this pandemic, I've been clear that data and science would lead the way.", "2020-06-24T19:04:36.000Z": "Dr. Fauci cautioned that leaders in our state have to act to blunt the surge of cases. He also testified that the next couple of weeks are critical for our country in our fight against COVID-19.", "2020-06-24T19:04:29.000Z": "Testifying before Congress yesterday, Dr. Anthony Fauci said that North Carolina could see a \"insidious increase in community spread, which will be much more difficult to contain as the community spread amplifies itself.\"", "2020-06-24T19:03:51.000Z": "Doctors and health care experts have warned that hospital capacity can be overwhelmed in the blink of an eye. And once we see that capacity is gone, it can be too late to reverse the tide.", "2020-06-24T19:03:38.000Z": "Daily case counts have gone up. The percent of tests returning positive has stayed high. Since May 19, the number of people hospitalized has increased 56%, from being in the 500s to now over 900 in just a little over a month.", "2020-06-24T19:03:21.000Z": "Our cautious approach is like a dimmer switch, rather than an on/off switch. Over the past weeks and months, even as we've slowly turned the dimmer switch up and eased restrictions, we've seen community spread of the virus increase in North Carolina.", "2020-06-24T19:03:04.000Z": "North Carolina has been careful in lifting COVID restrictions. And it's because public health experts warn that removing restrictions too fast or all at once can cause a dangerous spike in the virus that would overwhelm our medical system.", "2020-06-24T19:02:36.000Z": "As of today, we have 1,721 new cases reported and 906 people in the hospital - and today is the second highest day in both of those categories since the pandemic started. We also have 1,271 people who have died, and we continue to pray for those we've lost and their families.", "2020-06-24T19:01:44.000Z": "Updates on Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper, members of the Coronavirus Task Force and North Carolina health care leaders will give an update on COVID-19 at 3 PM. Watch live here: https:// twitter.com/i/broadcasts/1 BRKjYDjZqRxw ", "2020-06-24T18:54:22.000Z": "Gov. Cooper, members of the Coronavirus Task Force and North Carolina health care leaders will give an update on COVID-19 at 3 PM. Watch live here: Governor Roy Cooper @NC_Governor Gov. Cooper COVID-19 Briefing -June 24, 2020", "2020-06-24T12:55:19.000Z": ". @NC_Governor and members of the Coronavirus Task Force will give an update on #COVID19 today at 3 PM.\n\nView live stream here: https:// ncdps.gov/storm-update", "2020-06-23T20:05:10.000Z": "So many factors affect our health, and NCCARE360 makes it possible for North Carolinians to look after all aspects of their well-being. This innovative program will help our state continue to address the devastating impact COVID-19 has had on our communities. Quote Tweet NCDHHS @ncdhhs NCCARE360 links health care providers & individuals to organizations that address non-medical drivers that have a huge impact on health, such as transportation, food, housing, employment and personal safety.\n\nCall 2-1-1 or visit https:// nccare360.org", "2020-06-23T15:20:45.000Z": "An update to todays #ncwx forecast from @NWS . #ReadyNC Quote Tweet NWS Raleigh @NWSRaleigh The Storm Prediction Center has upgraded all of central NC into a Marginal Risk for severe storms today. The largest threat with storms that develop will be damaging winds. Stay tuned for further updates. #WhenThunderRoarsGoIndoors  #NCwx", "2020-06-22T17:43:20.000Z": "The first statewide program of its kind, NCCARE360 brings the government and private sector together to help North Carolinians facing COVID-19 or any other health issue find resources in their communities. Homepage nccare360.org", "2020-06-22T16:00:14.000Z": "North Carolina Department of Health and Human Services Secretary Mandy Cohen, M.D. and Director of NC Emergency Management Mike Sprayberry will be available today at 2 p.m. for a dial-in media briefing regarding #COVID19 .\n\nWatch the livestream at http:// ncdps.gov/news-conference", "2020-06-21T13:52:38.000Z": "Happy Father's Day, @NC_Governor ! We are so proud to be your daughters, and we love you more than we can say. - Hilary, Natalie, and Claire", "2020-06-20T18:42:59.000Z": "Monuments to white supremacy don't belong in places of allegiance, and it's past time that these painful memorials be moved in a legal, safe way. (3/3) - RC.", "2020-06-20T18:42:58.000Z": "I have ordered the Confederate monuments on the Capitol grounds be moved to protect public safety. I am concerned about the dangerous efforts to pull down and carry off large, heavy statues and the strong potential for violent clashes at the site. (1/3)", "2020-06-19T20:25:27.000Z": "Gov. Cooper's statement on vetoing House Bill 594:", "2020-06-19T19:08:31.000Z": "Along with impacting our physical health, COVID-19 has placed a burden on the mental well-being of many North Carolinians. This grant will help @ncdhhs expand its Hope4NC program and provide crisis counseling for communities most affected by this pandemic. NCDHHS awarded $1.5 million to expand mental health supports through statewide Crisis Counseling... RALEIGH, N.C. (WNCT) The North Carolina Department of Health and Human Services has been awarded $1.5 million to support and expand the Hope4NC program, which connects North Carolinians to mental h wnct.com", "2020-06-19T16:45:52.000Z": "Happy birthday and happy album release day to Jaki Shelton Green, NC's first African-American Poet Laureate!  We're lucky to have such a talented poet representing our state and inspiring young writers and community leaders across North Carolina. A Poet's Commemoration of Juneteenth For poet Jaki Shelton Green, June 19 is a day layered with meaning. This year, she'll mark the occasion with a new album, \"The River Speaks of Thirst.\" nextavenue.org", "2020-06-19T13:35:41.000Z": "\"This is a day to celebrate Black liberation, freedom and independence. But it's also time to recognize our country's history, the accomplishments of Black people and the necessary progress that still must come.\" #Juneteenth", "2020-06-18T18:05:29.000Z": "As we continue our activation here at the Emergency Operations Center, I want to thank Dr. Mandy Cohen and Director Mike Sprayberry and their teams for their tireless work fighting this pandemic. You have both led by example since Day 1, and our state is fortunate to have you.", "2020-06-18T18:04:55.000Z": "No, it's not the most comfortable thing, but you get used to it. It's a piece of protection like gloves in the winter or a hat in the summer - an extra thing you put on that keeps you healthy. And this piece of protection may even save your life or the lives of your loved ones.", "2020-06-18T18:04:38.000Z": "This is a low-cost, low-tech way to protect ourselves and our communities. It's an important way to slow the spread of the virus without hurting the economy. We wear them here at the Emergency Operations Center.", "2020-06-18T18:04:26.000Z": "We're examining the issues surrounding a statewide requirement of face masks & some local governments have put requirements into effect already. Regardless of whether it's a law or store requirement, wearing a face covering when you're around others slows the spread of the virus.", "2020-06-18T18:04:14.000Z": "I want to talk about strong proven methods to slow the spread of COVID-19 - face coverings & social distancing. Guidance from the CDC and other health experts is clear: these work. We're looking at ways to increase the use of face coverings & I applaud businesses requiring them.", "2020-06-18T18:03:05.000Z": "Over the weekend, I personally asked Vice President Pence for federal assistance in setting up even more testing locations in our state. That's going to be especially important as health directors identify hotspots for virus spread, which we have across our state.", "2020-06-18T18:02:46.000Z": "In the past week, we've averaged about 16,800 tests per day, a significant increase from where we were a month ago when we averaged around 7,500 tests per day. There are now more than 500 testing locations across our state that you can find on the state's interactive website.", "2020-06-18T18:02:17.000Z": "As of today, we have 48,188 lab-confirmed cases; 1,333 new cases reported today; 857 people in the hospital; and 1,175 people who have died. These numbers continue to concern us, and our prayers are with everyone fighting this virus and those who are grieving a loved one.", "2020-06-18T18:01:35.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update at 2 PM. Watch it live here: https:// twitter.com/i/broadcasts/1 YqKDpWkZYDKV ", "2020-06-18T17:52:31.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update at 2 PM. Watch it live here: Governor Roy Cooper @NC_Governor Gov. Cooper COVID-19 Briefing - June 18, 2020", "2020-06-18T16:15:17.000Z": "Governor Cooper and members of the Coronavirus Task Force will give an update on COVID-19 at 2 p.m. today. Watch the live stream at https:// ncdps.gov/news-conference .", "2020-06-17T21:47:34.000Z": "Don't worry! The photo here was taken before COVID-19. North Carolinians now should be wearing face coverings and practicing social distancing when they're out.", "2020-06-17T19:34:02.000Z": "Despite this pandemic, our Office of Recovery and Resiliency is working hard to help hurricane survivors rebuild. North Carolinians whose homes were damaged by Hurricane Florence or Matthew can apply for assistance with the Homeowner Recovery Program here: https:// rebuild.nc.gov/homeowners-and -landlords/homeowner-recovery-program?utm_medium=Social&utm_source=Owned&utm_campaign=Homeowner_Recovery_2020 ", "2020-06-17T18:25:28.000Z": "#ICYMI Since June 1st, @NC_Governor has announced over 992 new jobs for #NorthCarolina ! Last week, Grifols Therapeutics and beverage co-packing company, Prime Beverage Group, announced their plans to open new facilities in @jocogovNC and @CabarrusCounty . https:// nccommerce.com/news/press-rel eases?field_press_release_terms_tid=57 ", "2020-06-17T17:25:06.000Z": "Calling all @TheNCCourage / @NWSL fans! 3x World Cup Champion Jessica McDonald and her son join us on #AtHomeWithFLONC ! They read \"Fossils\" by June Edelstein. Visit our Facebook page for the full story! @J_Mac1422", "2020-06-17T15:16:50.000Z": "Our local health departments are doing critical work in the fight against this pandemic. This funding will help departments across the state expand their testing, contact tracing and other COVID-19 response efforts. Local health departments receive federal funding to help in COVID-19 response The N.C. Department of Health and Human Services announced Tuesday that it has allocated $35 million in federal funding to local health departments to support the COVID-19 response. wect.com", "2020-06-16T21:29:57.000Z": "NC #PrideMonth history was made last year when we hosted the first Pride Month reception at the NC Executive Mansion. When we say the People's House, we mean it. Happy Pride Month!  - KC", "2020-06-16T18:58:17.000Z": "Pride Month is a time to celebrate our progress towards LGBTQ equality and recommit our efforts to making North Carolina a welcoming and inclusive place to live and work. Governor Cooper proclaims June pride month RALEIGH, N.C. (WNCT) Governor Roy Cooper has declared the month of June, LGBTQ Pride Month in North Carolina to honor the state's LGBTQ+ communities and their fight for equality. \"Pride Month wnct.com", "2020-06-15T18:09:20.000Z": "Applications are being accepted for the Homeowner Recovery Program! This program helps homeowners whose homes were damaged by Hurricane Florence or Matthew. Visit https:// rebuild.nc.gov/HurricaneRecov ery  to apply online. #ReBuildNC  #NCORR  @NCEmergency  @NCPublicSafety", "2020-06-15T20:28:05.000Z": "Today, we recognize the sacrifices our healthcare professionals have made throughout this pandemic and every day. We are so grateful for the North Carolinians who have answered the call to help others in our hospitals, nursing facilities and communities. https:// governor.nc.gov/news/governor- cooper-proclaims-healthcare-heroes-day-2020%EF%BB%BF ", "2020-06-15T18:13:15.000Z": "Thank you to the NCORR team for the hard work and the long hours that you've put in making sure this money can move as fast as the federal government will let us. Especially as we've battled COVID-19, it's good to know that we can press ahead on these other critical missions.", "2020-06-15T18:09:01.000Z": "We know help can never come fast enough if you've been devastated by disaster. But NCORR's diligent work to act quickly will mean recovery money getting in the hands of people who need it sooner.", "2020-06-15T18:08:50.000Z": "But when it was time, North Carolina was on it and turned in an action plan within 24 hours and was the first state to receive approval of our plan.", "2020-06-15T18:08:43.000Z": "The program starting today took the federal government  almost two years--500 days-- after Florence made landfall to publish the register laying out the requirements of how this money can be invested.", "2020-06-15T18:08:29.000Z": "Much work already has been done. To date, North Carolina has provided more than $3.5 billion in state and federal funding for Hurricane Matthew and Florence recovery. Already, the recovery office has identified and approved more than 1,300 homes for CDBG funding.", "2020-06-15T18:08:19.000Z": "Despite the virus, the work of hurricane recovery continues, and today, the state opens a new application process for homeowners seeking federal housing funding for Florence repairs.", "2020-06-15T18:08:02.000Z": "Some North Carolinians and their communities are still recovering from the devastation of Hurricanes Matthew and Florence. These families are dealing with the threat of COVID-19 while they are trying to rebuild their homes and businesses.", "2020-06-15T18:07:34.000Z": "As our Emergency Operations Center stays activated for our COVID-19 response, a dedicated team at the North Carolina Office of Recovery and Resiliency (NCORR) remains focused on another response - recovery from hurricanes.", "2020-06-15T18:03:39.000Z": "Over the weekend, I talked to Vice President Pence about North Carolina's concerning numbers. I asked him to help us with increasing our testing capabilities, especially in these counties. Another focus will be testing all nursing home residents & staff. This testing is ongoing.", "2020-06-15T18:03:21.000Z": "Our @NCDHHS team is pushing assistance to local health departments, especially in the counties experiencing the highest growth - Alamance, Duplin, Durham, Forsyth, Guilford, Johnston, Lee, Mecklenburg and Wake are of particular concern.", "2020-06-15T18:02:57.000Z": "We're watching these numbers closely to monitor for hospital bed & ICU bed capacity. Right now, our hospitals do have bed capacity, and that's good. But that can change quickly. As we see North Carolina's upward trends, we must redouble our work detecting & isolating this virus.", "2020-06-15T18:02:34.000Z": "Even during a weekend when the actual reporting of cases and hospitalizations slows down a bit, we continued to see record-high case counts. And we continue to be concerned with our percentage of positive tests and our hospitalizations.", "2020-06-15T18:02:21.000Z": "As of today, North Carolina has 45,102 lab-confirmed cases; 983 new cases reported today; 797 people in the hospital; and sadly, 1,118 people who have died. We continue to pray for those who've lost loved ones, and for those who are still hospitalized.", "2020-06-15T18:01:51.000Z": "Updates from Gov. Cooper's media briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper will give an update on COVID-19 and Hurricane Florence recovery efforts at 2 PM today. Watch live here: https:// twitter.com/i/broadcasts/1 mnGelMDmyWKX ", "2020-06-15T17:56:22.000Z": "Gov. Cooper will give an update on COVID-19 and Hurricane Florence recovery efforts at 2 PM today. Watch live here: Governor Roy Cooper @NC_Governor Gov. Cooper Media Briefing - June 15, 2020", "2020-06-15T16:36:30.000Z": "The U.S. Supreme Court got it right today prohibiting LGBTQ discrimination in the workplace. Now comes the hard work of turning these legal protections into a reality of equality. - RC", "2020-06-15T16:19:38.000Z": "Building a more equitable North Carolina means taking deliberate action. Hire North Carolina is creating critical economic opportunities for women and minority-owned businesses so that all communities can take part in our state's growth and success. Quote Tweet Duke Energy @DukeEnergy Duke Energy rolls out 'Hire North Carolina' program for major construction projects. Learn more: http:// spr.ly/6014GJkuA .", "2020-06-15T15:45:27.000Z": "A media briefing on COVID-19 and Hurricane Florence recovery efforts will be held at 2 p.m. today. View the live stream at http:// ncdps.gov/news-conference .", "2020-06-15T13:53:17.000Z": "Albert Whiting made a lasting impact on thousands of students and played a critical role in shaping NCCU into the school it is today. North Carolina's education system is better because of Dr. Whiting's work, and our prayers are with his loved ones. Former NC Central University president and chancellor dies at age 102 Albert Whiting was known as a \"builder\" of NC Central University. newsobserver.com", "2020-06-14T17:56:59.000Z": "For 245 years, the United States Army has protected our country and our freedom. Thank you to the brave men and women who have made tremendous sacrifices and answered the call to serve. #ArmyBDay", "2020-06-14T16:52:48.000Z": "Today is #WorldBloodDonorDay ! Blood donors make lifesaving differences in North Carolina and around the country. @FLONC and her daughter recently donated and are gearing up to give again. To learn more and make your appointment, visit: https:// redcrossblood.org/give.html/find -drive ", "2020-06-14T14:24:36.000Z": "Today is #WorldBloodDonorDay , and we're so grateful for the everyday heroes making a difference in patients' lives across the country. If you can, help make your community a healthier place by rolling up your sleeve and making an appointment to give today. Upcoming blood drive. Help save lives. Here's information about our upcoming American Red Cross blood drive. Schedule an appointment. redcrossblood.org", "2020-06-14T14:01:15.000Z": "Governor Roy Cooper proclaimed June 14, 2020 as Flag Day. This national day of observance recognizes the adoption of the flag of the United States in 1777. We celebrate our nation's symbol of democracy & freedom that serves as a beacon for all Americans. https:// files.nc.gov/governor/docum ents/files/Flag-Day.pdf ", "2020-06-12T20:17:08.000Z": "Congratulations to our Class of 2020! We know this isn't the graduation you expected, but we are so proud of the resilience North Carolina's students and teachers have shown during this pandemic. With graduations canceled, the Class of 2020 shared these senior speeches virtually Adapting to a coronavirus pandemic that caused students to miss proms and deal with altered graduations, these high school seniors instead offered virtual commencement speeches. charlotteobserver.com", "2020-06-12T18:17:20.000Z": "Our numbers aren't where we want them to be, but it doesn't have to stay that way. It's going to take all of us doing our part - but North Carolinians know how to work together to defeat it.", "2020-06-12T18:17:00.000Z": "I know people are tired of this virus. It's been hard on everyone. But it is still deadly, and we cannot let our guard down. Slowing the spread is up to every one of us, every time we leave home - so practice the Three Ws.", "2020-06-12T18:16:51.000Z": "The most important reopening is schools. Even as we celebrate graduates this week, I expect to have kids back in the classroom in just a few months. The hard work we do now will make that happen safely.", "2020-06-12T18:16:41.000Z": "This increase in cases doesn't mean we've made a decision about going into Phase 2.5 or 3. Following strategies that reduce transmission, like washing hands, wearing a face covering, waiting 6 feet from people & tracing the virus to its sources will help us make these decisions.", "2020-06-12T18:15:07.000Z": "We'll continue to use caution in easing restrictions, keeping people's health foremost while also strengthening the state's economy. Easing restrictions gradually has kept the disease from overwhelming our hospitals, and we must keep that as a priority in our decision making.", "2020-06-12T18:14:50.000Z": "Everyone should remember that North Carolina is still under a \"Safer At Home\" recommendation. Just because we can leave home doesn't mean we always should. And to the places that have opened with new safety rules, thank you for the extra work you're doing for your customers.", "2020-06-12T18:14:40.000Z": "I understand that people are anxious to get back to normal, especially as school ends and the summer begins. And with more stores, restaurants and businesses open, people are leaving home and getting out more.", "2020-06-12T18:04:05.000Z": "We know that when you've been in a crowd, your risk of contracting COVID-19 increases. This is particularly true when many aren't wearing face coverings & there's little social distancing. We recommend that anyone who has been in a crowd get tested, even if you have no symptoms.", "2020-06-12T18:03:43.000Z": "In the last week, we've done an average of over 15,000 tests a day. This high number is good - but we know we still need to do more. Testing is available all over the state, but we are specifically targeting historically marginalized communities and other high-risk populations.", "2020-06-12T18:03:24.000Z": "Today is North Carolina's highest day of new cases since this pandemic started. It was also our highest day of testing at over 21,000 tests reported. But the high number of new cases is not just related to more testing. These numbers show the disease is spreading.", "2020-06-12T18:03:04.000Z": "Today our concern is growing about the increase in cases and hospitalizations in North Carolina. While our hospitals still have capacity, we know this can change quickly. So we are working with hospitals and tracking hospitalizations and ICU beds closely.", "2020-06-12T18:02:41.000Z": "As of today we have 41,249 lab-confirmed cases; 1,768 new cases reported today, a new high; 760 people in the hospital; and sadly, 1,092 deaths. Dying from COVID-19 or mourning a loved one right now can be isolating and difficult. We're praying for all those suffering right now.", "2020-06-12T18:02:02.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update at 2 PM. Watch live here: https:// twitter.com/i/broadcasts/1 BRKjYpEokZxw ", "2020-06-12T17:54:34.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update at 2 PM. Watch live here: Governor Roy Cooper @NC_Governor Gov. Cooper COVID-19 Briefing -June 12, 2020", "2020-06-12T15:02:50.000Z": ". @NC_Governor and members of the Coronavirus Task Force will hold a media briefing on COVID-19 at 2 p.m. today. View the live stream at https:// ncdps.gov/news-conference .", "2020-06-11T18:12:54.000Z": "My COVID-19 test results have come back negative, and I have had no symptoms. I encourage anyone who has been in a crowd to get tested even if you have no symptoms. You can find a site here. - RC https:// covid19.ncdhhs.gov/about-covid-19 /testing/find-my-testing-place ", "2020-06-11T16:05:32.000Z": "Hurricane season is officially here, and it's critical that you and your family are prepared for potential storms. Tune in at 1 PM to hear @NCPublicSafety Secretary Erik Hooks and @NCEmergency Director Mike Sprayberry discuss evacuation plans for our coastal communities. Quote Tweet NC Emergency Managem @NCEmergency Join us today at 1 pm to hear about plans for evacuating North Carolina's coastal communities when storms threaten. View the live stream at http:// ncdps.gov/news-conference . #KnowYourZoneNC  #HurricaneSeason", "2020-06-10T15:02:30.000Z": "This task force sets a path to eliminate the systemic racial bias in the criminal justice system. They will look at the best ways to fix that bias and then focus on implementing those strategies. Gov. Cooper establishes a Task Force For Racial Equity In Criminal Justice Governor Roy Cooper signed Executive Order No. 145 on Tuesday, June 9, 2020, forming the North Carolina Task Force for Racial Equity in Criminal Justice. The task force will recommend solutions to... wlos.com", "2020-06-09T19:10:32.000Z": "It will require listening to some hard truths to better understand each other and a commitment to work together in good faith. I pledge all of these and look forward working with the task force to get things done.", "2020-06-09T19:09:48.000Z": "As we listen to the cries of our fellow North Carolinians and work to better know their pain, we have to work together to rebuild systems that better strive to eliminate racism and bias.", "2020-06-09T19:09:25.000Z": "They know that for our law enforcement and criminal justice systems to work, people must have faith and trust in them. And they realize that too many do not. I'm hearing the same things from people who work in our court system who know that changes must be made there as well.", "2020-06-09T19:09:02.000Z": "It's critical that our state law enforcement be leaders in repairing this breach. They have a tough job and I'm grateful for so many of them who are doing their best to protect and serve with fairness. Many are now acknowledging that systemic and cultural changes must be made.", "2020-06-09T19:08:32.000Z": "This review along with recommendations of the Task Force can determine changes that need to be made to ensure that our state law enforcement agencies are providing equitable, high-quality service while prioritizing the safety of all North Carolinians.", "2020-06-09T19:08:14.000Z": "He has also directed those agencies to review their existing policies. Those include arrest procedures, what kind of interactions require use of force, and more importantly, which don't. How to prioritize de-escalation, so they calm a situation rather than accelerate it.", "2020-06-09T19:07:57.000Z": "To begin taking action in state government, @NCPublicSafety Secretary Erik Hooks has directed all state law enforcement agencies under the department to ensure they have a clear duty-to-intervene policy. That means if they see a fellow officer doing wrong, they must step in.", "2020-06-09T19:07:38.000Z": "Taking on issues of race & discrimination is difficult and often uncomfortable. That's why we need everyone - local governments, police departments, sheriffs, judges, prosecutors, civil rights leaders, legislators & community members- to weigh in and be committed to real change.", "2020-06-09T19:07:28.000Z": "Part of the job of the Task Force will be tailoring research and ideas to North Carolina and developing a strategy on how to get their proposals implemented. The task force is just the beginning, and I'm committed to making sure we see real progress.", "2020-06-09T19:06:56.000Z": "Their work will examine law enforcement and criminal justice practices, make concrete recommendations for how to make real improvements, and then submit a report to me by December 1.", "2020-06-09T19:06:43.000Z": "They will convene a wide range of stakeholders including: community policing advocates, state & local law enforcement agencies, people who have gone through and been affected by the justice system, judicial branch representatives, people from marginalized populations and more.", "2020-06-09T19:06:28.000Z": "Today I signed Executive Order 145 to establish the North Carolina Task Force for Racial Equity in Criminal Justice. Led by @Anita_Earls & @NCAGO , the task force will develop & help implement strategies & policies to help eliminate systemic racism in our criminal justice system.", "2020-06-09T19:05:38.000Z": "These numbers are stark. They tell a story that Black Americans have been living & telling us every day - even when there's no spotlight. It's important to recognize these numbers and identify the disparities. But it's even more important and challenging to do something about it.", "2020-06-09T19:05:12.000Z": "When convicted of the same crime, Black men receive a prison sentence that is 20 percent longer than white men. Black women are imprisoned at twice the rate as white women and are one and a half times more likely to be killed by law enforcement.", "2020-06-09T19:04:53.000Z": "Black adults are almost six times more likely to be incarcerated than white adults and Black men are two and a half times more likely to be killed by law enforcement. Hispanic adults are three times more likely to be incarcerated than white adults.", "2020-06-09T19:04:36.000Z": "Data shows that nationwide, communities of color are disproportionately affected at all stages of the criminal justice system.", "2020-06-09T19:04:29.000Z": "For Black people, the past several weeks have again ripped open scars created by generations of historical trauma. Too often, that trauma was inflicted by a criminal justice system that should protect them, but instead treats them unfairly.", "2020-06-09T19:04:08.000Z": "George Floyd was not the first victim of excessive force. Too many other people of color have been harassed, harmed, injured or killed. Added together, their lives and their stories have made this spotlight too bright to ignore.", "2020-06-09T19:03:53.000Z": "Last week, we talked about how COVID-19 is shining a bright light on longstanding racial inequities in everything from health care to housing. The protests re-ignited by the murder of George Floyd are shining yet another light on inequities in our criminal justice system.", "2020-06-09T19:02:31.000Z": "Updates from Gov. Cooper's briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper, Attorney General Josh Stein, North Carolina Supreme Court Justice Anita Earls and members of the Coronavirus Task Force will give an update at 3pm. Watch live here: https:// twitter.com/i/broadcasts/1 ZkKzmMenVLxv ", "2020-06-09T18:56:29.000Z": "Gov. Cooper, Attorney General Josh Stein, North Carolina Supreme Court Justice Anita Earls and members of the Coronavirus Task Force will give an update at 3pm. Watch live here: Governor Roy Cooper @NC_Governor Gov. Cooper Briefing -June 9, 2020", "2020-06-09T16:59:30.000Z": "At 3PM, I will join @NC_Governor for an announcement about our efforts to seek racial equity in criminal justice in North Carolina. \n\nYou can watch live here: https:// ncdps.gov/storm-update", "2020-06-09T15:40:39.000Z": "North Carolina businesses like Kitsbow have stepped up in the face of this pandemic and used their resources to create much-needed PPE. Proud to see this innovative and generous spirit from our Western North Carolina business owners. Kitsbow, other WNC outdoor gear makers still hiring as they increase PPE production WNC outdoor gear makers of tents, packs and athletic apparel have been busy throughout the pandemic, pivoting to manufacture personal protective equipment. citizen-times.com", "2020-06-08T21:57:52.000Z": "Getting children back to school safely in the fall is a high priority for North Carolina. Today, state education & health leaders released a set of guidelines for public schools to follow to lower the risk of COVID-19 spread for students, staff & families. https:// governor.nc.gov/news/dhhs-shar es-health-guidance-re-open-public-schools ", "2020-06-08T19:10:09.000Z": "As we remain laser-focused on getting kids back to school safely, we have to tap into that resiliency. Let's lead by example and do everything we can to create safe, healthy environments in the school buildings we all miss so much.", "2020-06-08T19:09:58.000Z": "This virus has created hardships for students, their families, educators & school employees. But I've seen the teacher parades, school cafeteria workers going the extra mile and the socially distanced birthday celebrations. These boost spirits and remind us of our resiliency.", "2020-06-08T19:08:55.000Z": "If we are careless now, if we ignore the 3 Ws, if we violate the mass gathering rules, we don't just risk our own health. We risk the ability to get our students back in the classroom. Learning in person with their teachers. Socializing safely with their friends.", "2020-06-08T19:08:27.000Z": "Our important mission of opening school buildings on time could be affected by a failure to slow the spread. We do not want that to happen.", "2020-06-08T19:08:14.000Z": "In recent weeks, much attention has been paid to the current Phase 2 and what's allowed to be open. We are weighing these decisions carefully but we are concerned that a number of our virus metrics are trending upward.", "2020-06-08T19:07:57.000Z": "We'll all need patience as the plans for each school come together in the coming months. This guidance is an important first step, and now the hard work will be done by local school boards, superintendents, principals and  nurses to tailor the plans to their particular schools.", "2020-06-08T19:07:22.000Z": "We know this coming school year will be like no other. Students and staff will be screened for illness before they enter the school. Children will be asked to stay distant from their classmates. They won't be sharing pencils or textbooks. And there will be a lot of cleaning.", "2020-06-08T19:07:05.000Z": "One important note is that opening schools will depend on our health metrics. We very much want school buildings open. But we won't be reckless with such an important decision.", "2020-06-08T19:06:24.000Z": "Today, as we mark the last week of the traditional school year, we are pushing forward to get schools open again this fall. Staff from @ncdhhs , Department of Public Instruction, State Board of Education and education leaders across the state are working on a reopening plan.", "2020-06-08T19:06:04.000Z": "It was a tough call because we know the hardship caused not only to students and teachers, but to families as well. Schools are vital to learning, physical fitness and social interaction. For many students, it's a place for healthy meals, safe environments, stability & routine.", "2020-06-08T19:05:37.000Z": "Slowing the spread of this virus is especially important as we work toward one of the most important dates on our calendars, reopening schools to in-person instruction. Nearly 3 months ago, we made the difficult decision to close K-12 public schools for in-person instruction.", "2020-06-08T19:05:07.000Z": "Sports heroes, entertainers, civil rights leaders, preachers, CEOs, legislators, all should demonstrate that wearing a mask and standing apart is a sign of strength and caring. Your followers are watching you. And their lives may depend on your example.", "2020-06-08T19:04:39.000Z": "If you have been in any kind of crowd, please go get tested. When you're around people, wear your masks and try to keep six feet away from others. Especially if you are a leader, set a good example.", "2020-06-08T19:04:23.000Z": "With all the challenges we face opening schools, boosting our economy & tackling racism head on, we must remember this virus is still with us & can be deadly. In our jobs, in our protests and in our everyday lives, we must protect ourselves, our families and the people around us.", "2020-06-08T19:04:07.000Z": "Today marks our highest day of people hospitalized for COVID-19 since this pandemic began. Over the weekend we saw our single highest day of new cases reported. We are seeing more viral spread, and these numbers are concerning.", "2020-06-08T19:03:33.000Z": "As of today, we have had 36,484 confirmed cases; 938 new cases reported today; 739 people in the hospital; and sadly, 1,006 people who have died. As we officially cross the 1,000 deaths mark, we continue to pray for those we have lost and for their families.", "2020-06-08T19:02:57.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update at 3pm. Watch it live here: https:// twitter.com/i/broadcasts/1 YqKDpPLnXaKV ", "2020-06-08T18:54:52.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update at 3pm. Watch it live here: Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Update - June 8, 2020", "2020-06-08T16:30:22.000Z": ". @NC_Governor and members of the Coronavirus Task Force will hold a media briefing on COVID-19 at 3 p.m. today. View the live stream at https:// ncdps.gov/news-conference .", "2020-06-06T21:25:08.000Z": "Today, we honor the brave soldiers who stormed the beaches of Normandy for our freedom 76 years ago. We are grateful for the sacrifices they, and all of the men and women in our armed forces, have made for our country. #DDay", "2020-06-06T16:28:46.000Z": "George Floyd should be alive today. We can't bring him back but we can work for justice in his name. It's up to all of us to fight racism on every front. Hundreds pay their respects to George Floyd, NC native, at his Hoke County memorial A memorial for George Floyd is taking place in Hoke County, North Carolina, near where he grew up. Much of his large family still calls North Carolina home. newsobserver.com", "2020-06-05T20:51:12.000Z": ". @NC_Governor Cooper today ordered all NC flags at state facilities to be lowered to half-staff from sunrise to sunset on June 6, 2020 in honor of Mr. George Floyd, a native North Carolinian killed while in police custody in Minnesota. Read more here: https:// bit.ly/3dy0sjA", "2020-06-05T20:43:41.000Z": "Gov. Cooper's statement on vetoing House Bill 536:", "2020-06-05T16:47:11.000Z": "COVID-19 is taking advantage of inequalities that communities of color face, and we're taking action to bring more health care and economic opportunities. North Carolina Gov. Cooper announces executive order addressing disproportionate impact of COVID-19... Gov. Roy Cooper announced a new executive order to address the impact of the coronavirus on communities of color Thursday. wxii12.com", "2020-06-04T21:33:42.000Z": "COVID-19 is shining a light on existing disparities in our healthcare and economic institutions for communities of color. This Executive Order addresses those disparities and improves access to resources and opportunities as we recover from the pandemic. https:// governor.nc.gov/news/governor- cooper-signs-executive-order-address-disproportionate-impact-%EF%BB%BF-covid-19-communities ", "2020-06-04T20:48:48.000Z": "I want to thank our dedicated men and women operating our 2-1-1 resource assistance phone line. They've marked 50,000 calls processed since the start of this pandemic, helping people get connected with community & social service resources. We are really grateful for your efforts.", "2020-06-04T20:37:47.000Z": "My administration is committed to eliminating disparities. We will keep listening. We will continue to work with communities all across our state to address systemic injustice.", "2020-06-04T20:37:31.000Z": "I know that those marching and protesting right now are lifting up their voices for more than just health disparities. We hear you. And there's more to come. Today, we are taking steps to help reverse the impacts of long-standing inequality, made worse by this pandemic.", "2020-06-04T20:37:16.000Z": "We know the best thing we can do to improve the health of everyone in our state is to expand Medicaid. North Carolina should've done this years ago & I will keep fighting to close the health care gap. Going to a doctor shouldn't be a luxury - whether or not there's a pandemic.", "2020-06-04T20:36:52.000Z": "To help all communities have access to health care, my order directs @ncdhhs , along with community health centers, local health departments, rural health centers and free & charitable clinics, to provide COVID-19 testing and related healthcare to uninsured North Carolinians.", "2020-06-04T20:36:19.000Z": "We know minority and marginalized communities are more likely to suffer from chronic health conditions including diabetes, kidney disease, obesity and asthma. The data shows these underlying health conditions significantly increase a person's risk for a severe COVID-19 infection.", "2020-06-04T20:35:57.000Z": "My order directs the North Carolina Pandemic Recovery Office to ensure that COVID-19 relief funds are fairly distributed. It also expands the capacity of our North Carolina Historically Underutilized Business Office to provide those businesses access to opportunities & resources.", "2020-06-04T20:35:35.000Z": "As the task force examines long-term opportunities, there are meaningful things we can do right now to lessen disparities. We know that black and minority-owned businesses are often overlooked & under-resourced. Too many of these businesses have been excluded from COVID-19 funds.", "2020-06-04T20:35:03.000Z": "Our Department of Administration Secretary Machelle Sanders will lead the group. Secretary Sanders is a strong leader, an accomplished businesswoman and a fierce advocate for all North Carolinians. I am excited she is going to take this on.", "2020-06-04T20:34:45.000Z": "The task force will focus on five areas: access to health care; patient engagement in health care settings; economic opportunities in business development and employment; environmental justice and inclusion; and education.", "2020-06-04T20:34:31.000Z": "We lost Andrea a few weeks ago, and our state will miss her advocacy and her action. Naming this task force in her honor is a way to carry on her mission.", "2020-06-04T20:34:16.000Z": "First, it creates the Andrea Harris Social, Economic, Environmental and Health Equity Task Force to address long-term disparities. Andrea Harris dedicated her life to eliminating disparities in North Carolina. She fought for social, economic and racial equity.", "2020-06-04T20:33:52.000Z": "Today I'm proud to have signed Executive Order No. 143 to address disparities in communities of color that are being highlighted and intensified by this pandemic. This Order moves our state forward in several areas.", "2020-06-04T20:33:34.000Z": "The disparity is because people of color have historically had less access to healthcare, housing, economic opportunity and more. This virus is exploiting those inequalities and it's up to us to do something about it.", "2020-06-04T20:33:15.000Z": "I want to be clear - there is nothing inherent to black or brown people that makes them more susceptible to severe COVID-19 illness. The data should not be used to further racism or fear.", "2020-06-04T20:33:01.000Z": "LatinX people are just 10 percent of the population, yet they make up 39 percent of COVID-19 confirmed cases. These statistics are alarming, and they are not acceptable.", "2020-06-04T20:32:47.000Z": "In North Carolina, African Americans make up approximately 22 percent of the population. But as of June 1, they account for 30 percent of the confirmed COVID-19 cases and 34 percent of COVID-19 deaths.", "2020-06-04T20:32:32.000Z": "Before the murder of George Floyd, and before the country heard yet again the cries for racial equity and justice, we already knew that COVID-19 was disproportionately impacting communities of color.", "2020-06-04T20:32:18.000Z": "As of today, our state has 31,966 confirmed cases; 659 people are in the hospital; and 960 people have died from COVID-19. I want to thank you for joining me for the national day of mourning on Monday, and we continue to pray for those who have lost loved ones to this virus.", "2020-06-04T20:31:41.000Z": "Updates from Gov. Cooper's briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update at 4:30pm. Watch it live here. https:// twitter.com/i/broadcasts/1 BRJjQgXqMaGw ", "2020-06-04T20:25:44.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update at 4:30pm. Watch it live here. Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Update - June 4, 2020", "2020-06-04T13:15:00.000Z": "North Carolina Poet Laureate Jaki Shelton Green shares insight on building community, persevering through tough times and adhering to necessary public health protocols during #COVID19NC .", "2020-06-04T16:30:23.000Z": ". @NC_Governor will hold a media briefing on COVID-19 and recent events at 4:30 p.m. today. Watch the live stream at https:// ncdps.gov/news-conference .", "2020-06-03T13:02:09.000Z": "The North Carolina African American Heritage Commission has put together a list of museums, historic sites, landmarks and more that share and promote African American history and culture in North Carolina. \n\nLearn more here: https:// aahc.nc.gov/places Image: @HBGanttCenter", "2020-06-03T01:59:41.000Z": "We have been committed to a safe RNC convention in North Carolina and it's unfortunate they never agreed to scale down and make changes to keep people safe. Protecting public health and safety during this pandemic is a priority.", "2020-06-02T20:37:57.000Z": "Right now we need leaders of strength who can be peacemakers.", "2020-06-02T18:15:18.000Z": "As difficult as it is, we must not let complacency or frustration or any of these activities that we're engaged in break down our defenses against the virus. We can keep this up if we stay focused and we keep taking care of each other.", "2020-06-02T18:14:58.000Z": "As we do all these things, we must remember that this virus is still circulating and it's still deadly. People are able to do more and that's good. But it must be done safely and following the Three Ws - wear a face covering, wash your hands, wait 6 feet apart from other people.", "2020-06-02T18:14:29.000Z": "As the weather warms, more people are getting out. They are running, reopening, or repairing businesses. They are demonstrating and making their voices heard. They are working in their every day jobs feeding us, caring for us, delivering goods & mail, protecting us, rescuing us.", "2020-06-02T18:13:53.000Z": "We know this virus has been a blow to our economy too. And as we work to get our businesses growing again, we're still recruiting more good-paying jobs for North Carolina. Just in the past 2 weeks, we've announced over 1,000 new jobs in urban & rural communities across our state.", "2020-06-02T18:06:14.000Z": "To combat the rising case counts & deaths, we're continuing to increase testing & tracing. We have 32 labs analyzing testing samples in our state & more than 400 verified sites collecting those samples. Go to our interactive map on @ncdhhs website to find a place to get tested.", "2020-06-02T18:05:44.000Z": "Today in North Carolina, we have 29,889 confirmed cases; 716 people in the hospital; and 921 people who have died. Yesterday, North Carolina marked a Day of Mourning for the more than 100,000 Americans who we've lost to COVID-19. It's a somber benchmark.", "2020-06-02T18:05:22.000Z": "Another is decades of blatant and subtle racism in housing practices has left too many Black Americans without a safe place to live. A systemic injustice. As we fight these injustices, we also fight a pandemic.", "2020-06-02T18:05:04.000Z": "We know one reason is the gap in health care that many black North Carolinians face. A systemic injustice. Another reason is that many people of color are working frontline jobs that are now are labeled as a necessity, when they have been all along. A systemic injustice.", "2020-06-02T18:04:39.000Z": "We can't lose sight of another backdrop behind all of this, which is COVID-19. A cruel virus that threatens all of us but has disproportionately struck black people in our state and people of color in our country.", "2020-06-02T18:04:15.000Z": "But I say again, as I did over the weekend, we can't lose sight of the reason nonviolent protestors are in the streets. They are calling out the systemic injustices that black people and communities of color have endured for generations. We have to listen to what they are saying.", "2020-06-02T18:03:50.000Z": "Many places did not see violence carry over from the weekend, and that's good. But some did, and we are continuing to provide state support as requested.", "2020-06-02T18:03:38.000Z": "George Floyd's brother visited the site of the murder and spoke yesterday. He had a powerful message to those working in his brother's name. Stop the violence. End the destruction. \"Let's do this another way,\" he said.", "2020-06-02T18:03:21.000Z": "Before we discuss COVID-19, I want to first address the protests in our state and our country after the recent killing of George Floyd. To those lifting up their voices, I want to say - I hear you. I am listening.  And I want to help make the changes that we need.", "2020-06-02T18:02:40.000Z": "Updates from Gov. Cooper's briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give a live update at 2pm. Watch it live here. https:// twitter.com/i/broadcasts/1 MYxNklvDryKw ", "2020-06-02T17:55:36.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give a live update at 2pm. Watch it live here. Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Task Force Update - June 2, 2020", "2020-06-02T16:57:33.000Z": "Today Gov. Cooper shared a letter with RNC officials to continue the conversation about the convention in Charlotte.", "2020-06-02T15:30:18.000Z": ". @NC_Governor will hold a media briefing on COVID-19 and recent events at 2 p.m. today. Watch the live stream at https:// ncdps.gov/news-conference .", "2020-06-02T14:30:52.000Z": "\"Climate change impacts the health, safety, and financial stability of North Carolinians, and we must take it head on. A resilient North Carolina is a stronger and more competitive North Carolina,\" - Gov. Cooper. https:// deq.nc.gov/news/press-rel eases/2020/06/02/state-climate-risk-assessment-and-resilience-plan-lays-groundwork ", "2020-06-02T14:01:36.000Z": "Atlantic hurricane season has officially started. The east coast has already seen two named storms this year. Take the time this week to map out a severe weather plan and build an emergency kit.\n\nLearn more at https:// files.nc.gov/readync/docume nts/files/Hurricane-Guide.pdf  .", "2020-06-02T01:39:52.000Z": "Watch the full remarks here: Gov. Cooper Remarks - May 31, 2020 I am here today to talk about the call being sounded right now across our state and country to stamp out the persistent and ugly flames of racism. The unjust... youtube.com", "2020-06-02T00:21:10.000Z": "\"We have to constructively channel our anger, frustration and sadness to force accountability and action.\" - Gov. Cooper.", "2020-06-01T19:37:51.000Z": "This is a painful moment for our country and our state. Read Governor Cooper's remarks to the state: Gov. Cooper Remarks - May 31, 2020 I am here today to talk about the call being sounded right now across our state and country to stamp out the persistent and ugly flames of medium.com", "2020-06-01T13:57:37.000Z": "Today's moment of silence at noon is an opportunity to honor those we have lost to COVID-19 and remind ourselves that this death count is not just a number - it represents people, communities and families in mourning. NC DHHS looking to work more with minorities North Carolina Department of Health and Human Services is looking to partner with minority owned businesses to ramp up testing and tracing efforts for COVID-19. wcnc.com", "2020-06-01T13:18:16.000Z": ". @NC_Governor Cooper has ordered all North Carolina flags at state facilities to be lowered to half-staff beginning today, Monday, June 1, 2020 through sunset for a Day of Mourning to honor those who passed away from the novel coronavirus. Read more here: https:// bit.ly/3gHjgyW", "2020-05-31T23:45:25.000Z": "NC Gov. Cooper: 'Black lives do matter.' National Guard activated for Raleigh, Charlotte Gov. Roy Cooper, a day after rioting and looting in several North Carolina cities, said people are more important than property. newsobserver.com", "2020-05-31T20:09:17.000Z": "We have to constructively channel our anger, frustration & sadness to force accountability & action. If we don't, we haven't learned anything. We have to have these conversations & then move beyond them to do the work of fighting racism & building safe communities for everyone.", "2020-05-31T20:08:28.000Z": "George Floyd's sister, Bridgette, lives in Hoke County, North Carolina. I spoke to her yesterday by phone. While I cannot bring her brother back, I can work for justice in his name. I assured her that's what we would do.", "2020-05-31T20:08:17.000Z": "Racism. Excessive use of police force. Health disparities. Poverty. White supremacy. These are wrong. They are ugly, but they are present. We must deal with them. We will deal with them.", "2020-05-31T20:08:07.000Z": "I want to remind everyone of something vitally important. We cannot focus so much on the property damage that we forget why people are in the streets.", "2020-05-31T20:07:50.000Z": "I've urged mayors to work closely with their police departments to prioritize de-escalating tensions. I've encouraged them to meet with the protest organizers in their cities to continue the dialogues they're having and open dialogues with others they haven't talked with yet.", "2020-05-31T20:07:13.000Z": "I have spoken with the mayors of Raleigh, Charlotte, Greensboro, and Fayetteville. Their requests for state support in the form of state highway patrol, SBI and National Guard soldiers are being fulfilled.", "2020-05-31T20:07:03.000Z": "We are fortunate, however, that none of these demonstrations resulted in death or critical injury. And I'm thankful for those who have worked so hard to keep the peace.", "2020-05-31T20:06:47.000Z": "I am thankful for those who passionately demonstrated and for the EMS workers, law enforcement officers and municipal officials who provided a space for voices to be heard. It was an exhausting night for some of them.", "2020-05-31T20:06:23.000Z": "In many ways, those actions undermine peaceful pleas for justice.", "2020-05-31T20:05:59.000Z": "The International Civil Rights Center and Museum in Greensboro, NC- the site of the 1960 Woolworth's sit in - was damaged. And for a short time, major highways were shut down.", "2020-05-31T20:05:49.000Z": "Storefront windows & government buildings were damaged. Retail stores were looted. Small businesses already struggling under COVID-19 were damaged. I communicated with some of them today and people were out there helping them today. Fires burned.", "2020-05-31T20:05:23.000Z": "Across the state, we saw a pattern in some of our cities. Protests and demonstrations held earlier in the day remained focused, powerful and nonviolent. Then as the night set in, a different crowd shifted to a more aggressive, more disruptive display.", "2020-05-31T20:05:05.000Z": "Throughout this weekend I have been briefed by Emergency Management and Public Safety officials. State resources have been provided to support the response.", "2020-05-31T20:04:56.000Z": "Let me be clear about one thing: People are more important than property. Black Lives do Matter.", "2020-05-31T20:04:41.000Z": "Unfortunately, today the headlines are not about those protestors and their calls for serious, meaningful change. They are more about riots, and tear gas, and broken windows, and stolen property. I fear the cry of the people is being drowned out by the noise of riots.", "2020-05-31T20:04:28.000Z": "In cities across our state, protestors gathered to seek justice for them, for themselves and their children. To call for changes to the systemic problems that have allowed racism to endure. Many brought their children with them to show the importance of calling for action.", "2020-05-31T20:03:37.000Z": "They are stark instructions from parents to children about how to stay safe in their own neighborhoods, and how to stay safe during encounters with law enforcement. They are heartbreaking memorials for people who should not be dead.", "2020-05-31T20:03:11.000Z": "For people of color, these are not just cable news headlines, though. They're life and death warnings.", "2020-05-31T20:03:02.000Z": "We've had moments of heightened awareness, some right here in our own state. But they've faded from the headlines too fast. We've made some progress, but when you see George Floyd on the ground begging for air, you realize that we have so much more work to do.", "2020-05-31T20:02:37.000Z": "These scars mark generations of trauma that black people and other communities of color continue to suffer. Trauma that has too often gone unrecognized in our country.", "2020-05-31T20:02:21.000Z": "I'm here today to talk about the call being sounded right now across our state and country to stamp out the persistent and ugly flames of racism. The unjust killing of George Floyd less than a week ago combined with many other recent and distant events broke open painful wounds.", "2020-05-31T20:01:42.000Z": "Updates from Gov. Cooper's briefing: Quote Tweet Governor Roy Cooper @NC_Governor At 4:00 pm, Gov. Cooper will give an update on recent events. Watch it live here. https:// twitter.com/i/broadcasts/1 zqKVljEmvPJB ", "2020-05-31T19:54:56.000Z": "At 4:00 pm, Gov. Cooper will give an update on recent events. Watch it live here. Governor Roy Cooper @NC_Governor Gov. Cooper Update - May 31, 2020", "2020-05-31T19:24:08.000Z": "@NC_Governor Cooper and @NCPublicSafety Secretary Hooks will brief on recent events at 4pm today", "2020-05-31T04:29:45.000Z": "I am in continuing contact with Emergency Management leaders about violence occurring in some of our cities. Frustrating that planned peaceful protests about real systemic racism are marred. I am grateful for those seeking justice peacefully. - RC", "2020-05-30T18:51:34.000Z": "\"George Floyd and so many others should be alive right now. People are angry, frustrated and sad, and I am too. If we don't force our communities toward accountability and action then we haven't learned anything.\" (1/2)", "2020-05-30T17:08:42.000Z": "Gov. Cooper has signed an Executive Order that extends the prohibition of utility shut-offs and pauses evictions to help North Carolinians make ends meet during this pandemic. https:// governor.nc.gov/news/governor- cooper-extends-moratorium-utility-cut-offs-and-implements-evictions-moratorium ", "2020-05-29T17:28:32.000Z": "This $6 million federal grant will support North Carolinians who've lost their jobs due to COVID-19 and help us rebuild our state's economy in a safe way. https:// governor.nc.gov/news/north-car olina-receives-federal-covid-19-employment-and-training-grant ", "2020-05-29T15:38:30.000Z": "Today, North Carolina shared a letter responding to the RNC.", "2020-05-28T19:57:34.000Z": "This pandemic has cancelled plans and caused disappointment, but it's also brought out the best in our communities. Great to see North Carolinians like this young man stepping up and finding innovative ways to celebrate their loved ones. The following media includes potentially sensitive content. Change settings View", "null": "", "2020-05-28T18:07:11.000Z": "Remember the 3 Ws - wear a face covering, wash your hands, wait 6 feet apart. Yes, you've heard these basic safety steps a lot, but they are mighty tools that each of us has to fight this virus. Never underestimate their importance. And let's not let our guard down.", "2020-05-28T18:06:42.000Z": "As we are now six days into Safer At Home Phase 2, please continue to look out for each other. Show respect for those workers still trying to navigate this pandemic to keep their customers safe and keep their businesses open. Be courteous to one another when you're out and about.", "2020-05-28T18:06:18.000Z": "This $6 million grant will help our Commerce Department set up these programs and the state of North Carolina will continue to carry the torch forward as we focus on helping people get back on their feet.", "2020-05-28T18:06:08.000Z": "People are eligible to participate if they have been laid off due to COVID-19. The funds can help pay for on-the-job training, temporary positions focused on COVID-19, or short-term training for workers to learn new skills that are now in demand.", "2020-05-28T18:05:50.000Z": "Our Commerce Department's Division of Workforce Solutions requested the funds and they will partner with local workforce development boards throughout North Carolina.", "2020-05-28T18:05:34.000Z": "Across the globe, our country and our state, we know that this virus has hurt the economy. Today, I'm pleased to announce that North Carolina has received a federal grant from the US Department of Labor to support job training and temporary employment opportunities.", "2020-05-28T18:05:14.000Z": "Contact tracing is more effective when that workforce is diverse and representative of the people they serve, and these new hirings show that. This is critical work that'll help people know if they've been exposed to the virus and whether to monitor for symptoms or quarantine.", "2020-05-28T18:04:42.000Z": "It's important to keep this gap in mind both for the location of testing sites but also in contact tracing. Community Cares of North Carolina now has hired almost all of the 250 staff members that we need to get more contact tracing help in our local health departments.", "2020-05-28T18:04:26.000Z": "African American and Hispanic communities make up a disproportionate number of our state's lab-confirmed cases and deaths compared with their percentage of the population. And we must focus on how we can identify these disparities, and most importantly, work to fix them.", "2020-05-28T18:04:14.000Z": "COVID-19 is shining a bright light on longstanding inequalities in health care. Yesterday, our Department of Health and Human Services launched a radio and video campaign to share important messages about COVID-19 to historically marginalized populations.", "2020-05-28T18:04:06.000Z": "Today, another private partner, CVS, has announced 55 new drive through testing locations all across North Carolina. We're glad to have another retail store that offers testing, especially as we work to make testing available to historically underserved communities.", "2020-05-28T18:03:21.000Z": "The @ncdhhs COVID-19 website now has an interactive tool to find a testing site in your area. It includes more than 300 places where you can go and get tested. And we have more than 30 private companies and hospitals doing the lab work on the samples to get COVID-19 results.", "2020-05-28T18:02:58.000Z": "In North Carolina, our case count has continued to go up. We know that one reason for this is increased testing, which is critical to reigniting our economy and keeping people safe. We've increased our testing significantly.", "2020-05-28T18:02:42.000Z": "Nationwide, we have passed a grim benchmark with more than 100,000 lost to COVID-19. We continue to pray for the families left behind in the wake of this cruel virus. And we remind ourselves that these aren't just numbers, they are people who have died.", "2020-05-28T18:02:21.000Z": "As of today, we have 25,412 confirmed cases, 708 people in the hospital and 827 people who have died. Today is one of our state's highest days of reported deaths and hospitalizations since this crisis began.", "2020-05-28T18:01:57.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update at 2:00pm. Watch it live here. https:// twitter.com/i/broadcasts/1 DXxyedWvLZxM ", "2020-05-28T17:56:06.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update at 2:00pm. Watch it live here. Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Update - May 28, 2020", "2020-05-28T16:21:24.000Z": "North Carolina is fortunate to have a leader as diligent and dedicated to the people of our state as Mike Sprayberry. North Carolina's new uncle Mike Sprayberry is a calming presence in troubling times North Carolina's emergency management director Mike Sprayberry has won fans with his folksy wisdom. newsobserver.com", "2020-05-28T15:45:13.000Z": ". @NC_Governor and members of the Coronavirus Task Force will hold a press conference on COVID-19 updates at 2 pm today. Watch the live stream at https:// ncdps.gov/news-conference .", "2020-05-27T20:28:35.000Z": ". @TownofCary Council Member @YaLiuCary and her children join us today on #AtHomeWithFLONC ! She reads \"The Wonderful Things You Will Be\" by Emily Winfield Martin. Visit our Facebook page for the full video!", "2020-05-27T16:25:48.000Z": "Thank you @NC_Governor and @FLONC for your incredible support of school nutrition staff and all others working to keep kids healthy in North Carolina! #ThankAHungerHero  #NCSchoolNutritionHeroes", "2020-05-26T22:56:44.000Z": "This week, $85.4 million in federal funds will be disbursed to counties across North Carolina to help local governments pay for testing, personal protective equipment and more critical services needed to respond to COVID-19. Gov. Cooper announces COVID-19 funds disbursed to counties for public health, essential services RALEIGH, N.C. (WNCT) Governor Roy Cooper announced that $85.4 million in federal funds provided for COVID-19 relief to counties will be disbursed this week. Three large counties, Guilford, Mecklenb wnct.com", "2020-05-26T19:06:39.000Z": "By wearing a face covering, washing your hands, waiting 6 feet apart and following other safety rules, we are saving lives and protecting each other. Let's keep at it.", "2020-05-26T19:06:00.000Z": "I want to thank everyone who made safe decisions this past holiday weekend. I know it's hard when annual traditions have to be changed or made virtual. But I encourage everyone to continue taking this virus seriously and follow the 3 Ws.", "2020-05-26T19:05:33.000Z": "As we continue in Safer At Home Phase 2, we need to stay alert. Over the weekend we saw our highest one-day increase in positive cases and our highest day of hospitalizations yet. This virus remains a serious threat, and we cannot let our guard down.", "2020-05-26T19:05:19.000Z": "Governors across the country - from both parties - are clear that Congress needs to do more to help stabilize state and local governments. I will keep working with North Carolina's Congressional delegation to help make that happen.", "2020-05-26T19:05:03.000Z": "In conversations with our Congressional Delegation, the President & Vice President, I've shared that our state needs more help and more flexibility in how that money is invested. State & local governments are losing revenue that support schools, EMS & other critical services.", "2020-05-26T19:04:22.000Z": "This team will offer technical assistance for governments and groups which receive relief funds and oversight for how the money is allocated. And this office will also assist with boosting our state's strategic economic recovery as we rebuild from this pandemic.", "2020-05-26T19:04:10.000Z": "The quick distribution of this money is thanks to our Office of State Budget & Management and our new North Carolina Pandemic Recovery Office. This new office was created to oversee the distribution of state and federal money in response to COVID-19.", "2020-05-26T19:03:58.000Z": "We are pleased to announce that by the end of this week, we will have processed payments for 59 counties for a total of $85 million, and we expect more counties to submit requests soon. This is crucial for local governments to pay for health officials, telemedicine, PPE and more.", "2020-05-26T19:03:49.000Z": "Although the state wasn't required to, my COVID-19 budget proposal recommended $300 million go directly to local governments. The unanimous bipartisan budget I signed included $150 million for counties, which they have the flexibility share with their towns & cities.", "2020-05-26T19:02:49.000Z": "Since this pandemic emerged, Congress passed legislation setting up the Coronavirus Relief Fund for state governments. North Carolina is slated to receive $3.56 billion from that fund.", "2020-05-26T19:02:37.000Z": "As we ease restrictions in Safer At Home Phase 2 and people are out and traveling more, I'd ask that you think about families in mourning and those who are sick. Your actions to wear a face covering, wait 6 feet from others and wash your hands can prevent more sickness and death.", "2020-05-26T19:01:47.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update at 3:00pm. Watch it live here. https:// twitter.com/i/broadcasts/1 rmxPAoPAdZKN ", "2020-05-26T18:56:30.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update at 3:00pm. Watch it live here. Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Update - May 26, 2020", "2020-05-26T16:00:44.000Z": ". @NC_Governor and members of the Coronavirus Task Force will hold a briefing on COVID-19 updates at 3 pm today. Watch the live stream at https:// ncdps.gov/news-conference .", "2020-05-26T15:32:34.000Z": "A face covering signifies strength and compassion for others. Wearing one shows that you actually care about other people's health.", "2020-05-25T18:39:48.000Z": ". @NC_Governor has ordered all North Carolina state flags to fly at half-mast in remembrance of our fallen soldiers and their heroic sacrifice to our nation. May we continue to honor their legacy by supporting their families and loved ones. #MemorialDay2020", "2020-05-25T17:29:38.000Z": "We owe a solemn debt of gratitude to our soldiers who gave their lives and to their families. Today, we #GoSilent to honor their sacrifices. - RC Quote Tweet IAVA @iava Join the movement. Share the story. Take action to honor the fallen. At 3:00 PM local time on #MemorialDay , join #IAVA and #GoSilent to remember what Memorial Day is all about. http:// iava.org/go-silent", "2020-05-25T16:52:05.000Z": "Last year, PFC William \"Hoover\" Jones' remains were finally returned home to North Carolina. Today on Memorial Day, let's all pause to honor the men and women in uniform who have made the ultimate sacrifice for our country.", "2020-05-25T14:42:11.000Z": "Statement from Gov. Cooper's spokesperson on today's comments about the Republican National Convention:", "2020-05-23T17:15:06.000Z": "NC moved into Phase 2 of lifting #COVID19 restrictions at 5 p.m. Friday, May 22. Phase 2 runs through at least Friday, June 26, unless changed or canceled. For a quick reference guide about the differences in Phases 1 and 2 go to: http:// files.nc.gov/covid/document s/Phases-List.pdf   #StayStrongNC", "2020-05-22T19:10:05.000Z": "Red wolf pupdate on our litter born on April 21st! The puppies are growing very quickly, each one has gained about 3 lbs. All of the puppies' eyes are open & starting to venture outside of the den box a little. They are also starting to get their distinct red wolf colors!", "2020-05-22T20:40:55.000Z": "People need to have confidence in their safety for us to reignite our economy. Count on Me NC is an innovative partnership that will help restaurants and businesses protect their customers and employees from COVID-19. Count On Me NC Count On Me NC is a mutual pledge and public health initiative that empowers guests and businesses to help keep everyone safe and protected. countonmenc.org", "2020-05-22T18:12:41.000Z": "The Count On Me campaign is really a testament to the collaboration going on all across our state as we fight COVID-19. And I know we will continue to partner with you and others to provide this type of helpful information and training.", "2020-05-22T18:05:56.000Z": "This innovative effort is possible because of the strong and longstanding partnerships we have with industry and our universities. As far as we know, it's among the first of its kind in the country. I'm proud that North Carolina is leading the way on safety and best practices.", "2020-05-22T18:05:40.000Z": "So far, over 3,500 individuals representing over 1,800 businesses have completed the training with more signing up every day. You can learn more at http:// CountOnMeNC.org and find a list of businesses in your area that have already completed the training. Count On Me NC Count On Me NC is a mutual pledge and public health initiative that empowers guests and businesses to help keep everyone safe and protected. countonmenc.org", "2020-05-22T18:05:28.000Z": "When completing the course, restaurants and businesses will have a sign in the window and a logo for the website to show their commitment to using new safety protocols. You may see your server wearing a Count on Me pin or nametag if you go into a restaurant this weekend.", "2020-05-22T18:04:53.000Z": "Count on Me is a free online training. It's focused on advanced cleaning, disinfection, social distancing and hygiene practices to better protect the public and employees from exposure to COVID-19.", "2020-05-22T18:04:37.000Z": "To help this effort, @ncdhhs has been working with @NCRLA , @NCExtension and @VisitNC to develop an online curriculum for owners, managers and employees of restaurants, hotels and other businesses. It's called Count on Me NC.", "2020-05-22T18:04:11.000Z": "Restaurants are a major part of our economy, and this virus has been tough on them. As we enter Phase 2, I appreciate that restaurant owners across the state are focused on how to keep customers and employees safe. They know that strong safety precautions will be good business.", "2020-05-22T18:03:49.000Z": "Starting today at 5 pm, restaurants can open for in-person dining at 50% capacity and will use enhanced cleaning and health screening.", "2020-05-22T18:03:30.000Z": "I urge all North Carolinians to take the COVID-19 restrictions and safety rules seriously. Keep gatherings to under 10 people indoors or 25 people outdoors. And remember the Three Ws - wear a face covering, wait six feet apart from other people and wash your hands frequently.", "2020-05-22T18:03:10.000Z": "I know it's also a popular weekend for cookouts and parties. Especially this year when we've been more socially isolated, the desire to gather with friends and family is really strong. I want you to have a great time, but continue using caution.", "2020-05-22T18:02:51.000Z": "This is Memorial Day Weekend, and it's an important opportunity to honor our men & women in uniform who made the ultimate sacrifice. It's time to reflect on their contributions & show gratitude to their families. I'm grateful for these heroes who gave everything for our country.", "2020-05-22T18:02:26.000Z": "Today at 5 pm, North Carolina enters Safer At Home Phase 2. As laid out, this is a cautious step forward that eases certain restrictions and keeps important safety measures in place.", "2020-05-22T18:01:47.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update at 2pm. Watch it live here: https:// twitter.com/i/broadcasts/1 dRJZQEAjAgGB ", "2020-05-22T17:56:35.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update at 2pm. Watch it live here: Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Briefing - May 22, 2020", "2020-05-22T15:02:04.000Z": ". @NC_Governor and members of the Coronavirus Task Force to hold a briefing on COVID-19 updates at 2 p.m. regarding COVID-19. Watch the English and Spanish live stream at http:// ncdps.gov/news-conference .", "2020-05-22T00:39:02.000Z": "Day made! #WeAreAllInThisTogether Burlington man writes song thanking DHHS Secretary Dr. Mandy Cohen amid pandemic Burlington man writes song thanking DHHS Secretary Dr. Mandy Cohen amid pandemic BURLINGTON, N.C. - A Burlington man is using music to thank N.C. Department of Health and Human Services Secretary Dr. Mandy Cohen amid the coronavirus pandemic. Scot Buffington wrote the tri myfox8.com", "2020-05-21T14:39:35.000Z": "Gov. Cooper's statement on the passing of Andrea Harris:", "2020-05-21T14:20:08.000Z": "Safer at Home Phase 2 - Friday May 22 at 5pm", "2020-05-20T23:59:03.000Z": "Read the full order: https:// files.nc.gov/governor/docum ents/files/EO141-Phase-2.pdf ", "2020-05-20T23:46:49.000Z": "Today, Gov. Cooper and @SecMandyCohen announced that North Carolina will move into 𝐒𝐚𝐟𝐞𝐫 𝐀𝐭 𝐇𝐨𝐦𝐞 𝐏𝐡𝐚𝐬𝐞 𝟐 on Friday, May 22 at 5 pm. Here's what that means:", "2020-05-20T21:16:11.000Z": "Let's keep looking out for our neighbors. Thanking our frontline workers. Getting some fresh air when we can. And working together to defeat this virus.", "2020-05-20T21:15:59.000Z": "Not every restaurant & salon will be able to open Friday evening and some may choose not to open at all. Show them the courtesy of patience as they weigh how best to serve their customers and stay safe. We owe that to them.", "2020-05-20T21:15:39.000Z": "Finally, I'd ask us all to be patient and understanding of the frontline heroes who are running cash registers, driving delivery routes, and helping customers. Especially those businesses that will just be opening this weekend.", "2020-05-20T21:15:23.000Z": "A face covering signifies strength & compassion for others. Wearing one shows that you care about other people's health. And I'm proud every day here at the Emergency Operations Center when I see our brave National Guard Soldiers and tough Marine Mike Sprayberry using them.", "2020-05-20T21:15:04.000Z": "In Safer At Home Phase 2, the three Ws are even more important. Wash your hands frequently, wait 6 feet apart from other people and wear a face covering. The face covering is more about protecting other people from your germs in case you have the virus and just don't know it yet.", "2020-05-20T21:14:38.000Z": "I know this virus has upended life for many North Carolinians, especially those who've lost their incomes. I've directed the Division of Employment Security to improve the efficiency and customer service of the unemployment benefit process.", "2020-05-20T21:14:24.000Z": "This next phase can help boost our economy. But we can only help our economy when people have confidence in their own safety, which is why it's important to ease restrictions carefully and use data in deciding when to do it.", "2020-05-20T21:14:14.000Z": "As with previous Orders, these restrictions are a floor. Local governments may enact more strict rules if health officials and local leaders believe it's in the best interest of their communities.", "2020-05-20T21:13:43.000Z": "Swimming pools will be able to open at 50% capacity, and overnight & day camps can open with safety rules. Childcare facilities remain open and are now able to enroll all children. I want to thank our childcare centers that have been open and providing this critical service.", "2020-05-20T21:13:17.000Z": "Personal care businesses like salons and barbers can also re-open at 50% capacity. These businesses will have face covering and cleaning requirements while also reducing the number of people in the waiting areas.", "2020-05-20T21:12:59.000Z": "Certain businesses will be open at limited capacity with other requirements. Restaurants can re-open for dine-in customers at mostly a 50% capacity, with distancing and cleaning requirements.", "2020-05-20T21:12:36.000Z": "The mass gathering limits in Phase 2 will be no more than 10 people indoors or 25 people outdoors. This applies to event venues; conference centers; stadiums and sports arenas; amphitheaters; and groups at parks or beaches.", "2020-05-20T21:12:24.000Z": "Some businesses & places will remain closed in Phase 2 including: bars; night clubs; gyms and indoor fitness facilities; indoor entertainment venues such as movie theaters, bowling alleys; and public playgrounds. This is because the spread of COVID-19 can be significant there.", "2020-05-20T21:11:37.000Z": "While I am lifting the Stay At Home order, we are shifting to a Safer At Home recommendation. And that's especially important for vulnerable people who are at risk for more severe illness. Teleworking when possible is also highly recommended.", "2020-05-20T21:11:15.000Z": "Phase 2 is another careful step forward. Since we announced Phase 1, the state's overall key indicators remain stable. However, the increases in COVID-19 cases signal a need to take a more modest step forward in Phase 2 than originally envisioned.", "2020-05-20T21:10:58.000Z": "Two weeks after we announced Phase 1, North Carolina's combination of trends and indicators remain stable overall. Because the data shows that we can, North Carolina will move into Safer At Home Phase 2 on Friday, May 22 at 5 pm.", "2020-05-20T21:03:09.000Z": "We have been closely watching and reporting North Carolina data on a daily basis, but it's important to watch the trend lines over a 14 day period to determine if our metrics are increasing, decreasing or stable over time.", "2020-05-20T21:02:54.000Z": "Last month, we laid out a phased approach to easing restrictions in our state that relied on data, science & facts. Two weeks ago, we announced we were entering Phase 1. Today, we're announcing another gradual, cautious step while still keeping health & safety measures in place.", "2020-05-20T21:02:42.000Z": "This virus is still a serious threat. But North Carolinians have made changes and sacrifices in their daily lives and that has helped to flatten the curve here. That means hospitals & the medical system can serve patients effectively for all kinds of illnesses including COVID-19.", "2020-05-20T21:01:42.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update at 5pm. Watch it live here. https:// twitter.com/i/broadcasts/1 vAGRBvZMbzGl ", "2020-05-20T20:55:40.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update at 5pm. Watch it live here. Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Update - May 20, 2020", "2020-05-20T19:22:57.000Z": "Gov. Cooper will be making an announcement about what's next for North Carolina. Tune in live at 5 PM.", "2020-05-20T15:25:04.000Z": ". @NC_Governor and members of the Coronavirus Task Force to hold a briefing on COVID-19 updates at 5 p.m. Watch the English and Spanish live stream at http:// ncdps.gov/news-conference .", "2020-05-20T15:02:55.000Z": "The state of North Carolina is providing personal protective equipment to long-term care facilities and the @NCNationalGuard has stepped up to help distribute. Thank you for your dedicated service to our state. Quote Tweet NC Emergency Managem @NCEmergency More than 3,800 long term care homes across NC are receiving PPE in order to protect their residents and staff from the spread of COVID-19. Care homes are picking up supplies at drive-thru locations in Greensboro & Mecklenburg County. @NCNationalGuard is staffing these sites.", "2020-05-20T14:00:00.000Z": ": Kids Q&A\n\nGov. Cooper and Dr. Cohen spend a lot of time answering questions from the media during press briefings. Today, we wanted to do something a little bit different.", "2020-05-20T13:01:28.000Z": "Today at 10 AM! Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and Dr. Cohen spend a lot of time answering questions from the media during press briefings. This time, we wanted to do something a little bit different. Tune in tomorrow at 10AM here and on Facebook for a Kids Q&A.", "2020-05-19T23:47:17.000Z": "Gov. Cooper and Dr. Cohen spend a lot of time answering questions from the media during press briefings. This time, we wanted to do something a little bit different. Tune in tomorrow at 10AM here and on Facebook for a Kids Q&A.", "2020-05-19T21:30:31.000Z": "We've had wonderful guests join us so far on #AtHomeWithFLONC ! Today, @FLONC takes the stage and reads \"The Best Present\" by Holly Keller. Mrs. Cooper read this book to her daughter Hilary whenever she missed her grandmother.", "2020-05-19T20:02:24.000Z": "\"Given the disproportionate impact this pandemic has had on minority communities, it is more vital than ever for us to ensure that all North Carolina businesses have equal access to these funds,\" - Gov. Cooper Gov. Cooper requests minority-owned businesses receive equal access to COVID-19 funding RALEIGH, N.C. (WNCN) - With woman-and-minority-owned businesses accounting for approximately half of all businesses in North Carolina, Gov. Roy Cooper has requested that those establishments  cbs17.com", "2020-05-19T19:07:45.000Z": "Thank you to the 40,000 men and women in our Emergency Medical Services who work day and night responding to North Carolinians in crisis. #EMSWeek", "2020-05-19T14:32:49.000Z": "Flash flooding can happen with little warning. Have a plan and know the difference between a watch and a warning:\n\nWarning: Flooding is happening or will happen soon. Get to high ground!\n\nWatch: Stay tuned to weather alerts and be ready.", "2020-05-18T20:53:42.000Z": "North Carolina museums tell the stories of our state, nation, and beyond. @ncculture made a helpful guide that lists many ways to enjoy our museums from home! #InternationalMuseumDay Learn more Quote Tweet NC DNCR @ncculture In case you didn't know, it's #InternationalMuseumDay ! To help celebrate, we've compiled a list of 10 ways that you can engage from home with some of the wonderful institutions in North Carolina. https:// medium.com/@NCDNCR/10-way s-to-engage-online-with-north-carolina-museums-79b734457f15 ", "2020-05-18T20:01:51.000Z": "\"This is Law Enforcement Officers Month in North Carolina, and I wanted to take a minute to say thank you to the thousands of men and women who have answered the call to serve our state and its people,\" - Gov. Cooper", "2020-05-18T18:07:24.000Z": "Show your appreciation for these workers by doing what's right - wear a face covering, wait 6 feet apart, and remember that a simple thank you can sometimes be exactly what someone needs to hear during a tough time.", "2020-05-18T18:07:02.000Z": "Grocery store workers, delivery drivers, restaurant workers, shop owners - they're on the front lines and taking important safety precautions to protect their customers.", "2020-05-18T18:06:31.000Z": "I know that a quick trip to the store can be more stressful these days, with social distancing, face coverings, and being mindful of everything you touch. But it's critical to do all these things to slow the spread of the virus and to protect others as well as yourself.", "2020-05-18T18:06:11.000Z": "We know that life will look a little different for a while as we ease restrictions. As we all adjust, remember that patience and compassion will get us farther than hostility.", "2020-05-18T18:05:48.000Z": "Approximately 275 testing sites are on the DHHS website. In the last 7 days, we've tested an average of about 7,500 people per day. With expanded guidance to health care providers on who ought to be tested and more sites available, we expect daily testing to continue to increase.", "2020-05-18T18:05:07.000Z": "As we watch and examine the trends, we are working with public health and the private sector to determine how we can reduce the risk of spread in the next phase. Remember - we have flattened the curve, but the threat of COVID-19 is still here.", "2020-05-18T18:04:52.000Z": "Our Phase 1 Executive Order runs through this Friday, but as I've said - we are continuing to monitor the data and the metrics that we've laid out for our state. We will ease restrictions and move to Phase 2 only if we are headed in the right direction with our data.", "2020-05-18T18:04:36.000Z": "We are sending to them a two-week supply of face shields, procedure masks, gloves, shoe covers and hand sanitizer. I'm proud of and thankful for the emergency managers and National Guard members who are getting this critical gear to where it's needed.", "2020-05-18T18:04:12.000Z": "We are able to do this, in part, because of local manufacturers who have worked with the state to shift their production to make personal protective equipment. With their help, we are now able to share the equipment to where it is needed.", "2020-05-18T18:03:54.000Z": "This week we are continuing a comprehensive push to distribute personal protective equipment to more than 3,800 licensed care facilities across the state, including nursing homes, adult care homes and more.", "2020-05-18T18:03:39.000Z": "Since the start of this pandemic, we've worked hard to protect long-term care facilities like nursing homes. We know that in addition to having many residents who are at-risk for severe illness, the nature of these facilities makes the virus spread easier from person to person.", "2020-05-18T18:02:47.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force to provide an update at 2:00pm. Watch it live here: https:// twitter.com/i/broadcasts/1 BdxYQyRabyxX ", "2020-05-18T17:58:15.000Z": "Gov. Cooper and members of the Coronavirus Task Force to provide an update at 2:00pm. Watch it live here: Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Update - May 18, 2020", "2020-05-18T15:45:07.000Z": "@NC_Governor and members of the Coronavirus Task Force to hold a briefing on COVID-19 updates  at 2 p.m. regarding COVID-19. Watch the English and Spanish live stream at http:// ncdps.gov/news-conference .", "2020-05-18T13:20:08.000Z": "TS Arthur will generate dangerous rip currents and heavy surf as it tracks east of the NC coast today. Use extreme caution around the water today. #ReadyNC", "2020-05-18T13:57:46.000Z": "North Carolinians in coastal communities should be cautious of Tropical Storm Arthur approaching our coast today. Pay close attention to local forecasts and avoid dangerous surf conditions. Gov. Cooper urges caution as Tropical Storm Arthur approaches NC coast Governor Roy Cooper is urging people along the North Carolina coast to pay close attention to Tropical Storm Arthur, the first named storm of the year. \"Everyone in our coastal areas should remain  myfox8.com", "2020-05-16T19:23:39.000Z": "Statement from Gov. Cooper's spokesperson on today's court ruling on religious services:", "2020-05-16T14:33:11.000Z": "Army Staff Sgt. Ronald J. Shurer II was a hero. We are deeply grateful for his service, and our sympathies go out his family, friends and all who knew him at Fort Bragg. 'We are heartbroken.' Fort Bragg mourns the loss of Medal of Honor recipient \"We are heartbroken by the passing of one of our own,\" the 3rd Special Forces Group of Fort Bragg said. newsobserver.com", "2020-05-15T20:46:23.000Z": "Andrew and Emily of @Mandolin_Orange perform their song \"Little Worlds\" for us today! The renowned folk duo joined us for Music at the Mansion back in 2019. It's a pleasure to host them again!  #AtHomeWithFLONC", "2020-05-15T19:54:48.000Z": ". @NC_Governor Cooper ordered all US and NC flags at state facilities to remain lowered to half-staff through sunrise May 18, 2020 in honor of PFC Tyler Knight Cox, who passed away during training on April 29, in Jacksonville, NC. Read more here: https:// bit.ly/2Z5ntGg", "2020-05-15T19:26:40.000Z": "Former Representative Larry Womble spent his life advocating for racial justice and education equality in North Carolina. Our prayers are with his family, loved ones and the Winston-Salem community. 'Larry would fight injustice where he saw it ...' Former NC Rep., city councilman Larry Womble dies... Larry Womble, an educator and advocate for minorities who held elected positions in Winston-Salem and Raleigh, has died at the age of 78. He had been in declining health for journalnow.com", "2020-05-15T16:49:00.000Z": "NC Department of Health and Human Services Secretary Mandy Cohen on the 3 Ws: Wear a face covering. Wait six feet apart. Wash your hands.", "2020-05-15T14:10:35.000Z": "Appreciate North Carolinians being safe and flattening the curve even if it means getting a little shaggy. Yes, it's been almost 2 months since my last haircut and it's beginning to look like my college picture with more wrinkles. - RC Quote Tweet Joe Bruno @JoeBrunoWSOC9 Side note- I don't get the conspiracy that people think Governor Roy Cooper is getting haircuts illegally. With all due respect, if he is he needs to fire his illegal hairdresser. Way too long on the top and he has a mullet thing going on in the back Show this thread", "2020-05-15T12:11:01.000Z": "Getting more North Carolinians tested for COVID-19 is a key factor in being ready to eventually move into Phase 2. Find out where the closest testing site in your community is here: Here's where you can get a coronavirus test in NC The North Carolina Department of Health and Humans Services on Thursday debuted a list of public sites for coronavirus testing. wral.com", "2020-05-14T19:13:04.000Z": "I know it's difficult. People are making sacrifices on every front to help keep this virus under control. I see those sacrifices and I appreciate them. We can only beat COVID-19 if we work together to do our part.", "2020-05-14T19:12:47.000Z": "We need North Carolinians to keep doing what they know protects them from this pandemic. Stay at home when you can. Telework if possible. Practice the three Ws if you are out - wear a face covering, wash your hands, wait 6 feet apart from other people.", "2020-05-14T19:12:22.000Z": "Regardless of executive orders, I would urge every congregation to pause and consider whether indoor services are the right thing to do right now for their members. We must care for and show love to one another.", "2020-05-14T19:12:01.000Z": "Ask any of the congregations who have experienced outbreaks and deaths due to this virus. And I appreciate the many houses of worship that have transitioned to doing outdoor or virtual services in order to keep their members safe.", "2020-05-14T19:11:44.000Z": "One fundamental tenet of faith is to care for and love one another. When doing these things together, sitting or standing indoors for more than 10 minutes, we greatly increase the chances of passing to each other a virus that can be deadly.", "2020-05-14T19:11:22.000Z": "When we physically gather together, shake hands, hug, sing, preach, take communion, we bond in our faith. I've really missed that, as have millions of North Carolinians.", "2020-05-14T19:11:06.000Z": "Let me talk a minute about faith. Our faith can sometimes mean even more to us during a time of crisis. I'm a church elder and was a Sunday school teacher for more than 20 years. I'm so grateful for my church family. There's a real sense of belonging and a sense of community.", "2020-05-14T19:10:42.000Z": "Phase 1, which still includes a modified Stay at Home order, is in place through Friday, May 22. Our COVID-19 decisions are guided by the data & science. We'll use the time in this phase to keep a careful eye on the indicators before we are ready to announce the start of Phase 2.", "2020-05-14T19:04:11.000Z": "We are increasing testing and tracing. And the supply chain of protective equipment has improved since this outbreak started, thanks in part to many North Carolina-based companies and the hard work of @NCEmergency and @ncdhhs .", "2020-05-14T19:04:02.000Z": "We are also deploying more protective gear to arm our frontline workers. For example, our emergency management is sending personal protective equipment to every one of the 3800 long-term care facilities in the state.", "2020-05-14T19:03:51.000Z": "Those testing sites include doctor's office's, local health clinics, hospitals, retail pharmacies and other sites. We hope to add more locations every week.", "2020-05-14T19:03:36.000Z": "Our state has a number of testing sites across the state that are up and running to help meet this goal and some of them are free to the person getting tested. Today, @ncdhhs has identified these locations at http:// covid19.ncdhhs.gov to help people know where they can get tested.", "2020-05-14T19:03:05.000Z": "A key factor in our readiness to move to Phase 2 is testing. Statewide, we've doubled the number of tests in recent weeks, which is good, but we need to do more. Testing has to be widely available at low cost or free if we're going to keep people safe & reignite our economy.", "2020-05-14T19:02:26.000Z": "North Carolina is making progress in our fight against COVID-19. We're currently in Phase 1. It's a careful, cautious first step. It's important to remember that this virus is still a threat. We know COVID-19 is circulating in our state, and we don't yet have a vaccine or a cure.", "2020-05-14T19:01:40.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update at 3pm. Watch it live here: https:// twitter.com/i/broadcasts/1 ZkKzLbNjkDJv ", "2020-05-14T18:55:04.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update at 3pm. Watch it live here: Governor Roy Cooper @NC_Governor NC Gov. Cooper Coronavirus Update - May 14, 2020", "2020-05-14T16:40:20.000Z": "North Carolina companies are stepping up and finding innovative ways to fight COVID-19. Honeywell's efforts are critical to helping us protect our frontline workers. Charlotte-based Honeywell to deliver 100,000 N95 masks to N.C. monthly through August 2021 North Carolina has secured a contract with Charlotte-based Honeywell for a monthly delivery of 100,000 N95 respirator masks through August of 2021, for a total of 4.2 million masks. wbtv.com", "2020-05-14T16:30:23.000Z": ". @NC_Governor and members of the Coronavirus Task Force to hold a briefing on COVID-19 updates at 3 p.m. Watch the English and Spanish live stream at https:// ncdps.gov/news-conference .", "2020-05-14T15:20:41.000Z": ". @NC_Governor Cooper today ordered all US and North Carolina flags at state facilities be lowered to half-staff from sunrise to sunset on Friday, May 15, 2020 in observance of National Peace Officers Memorial Day. Read more here: https:// bit.ly/2LuPtLA", "2020-05-14T14:32:56.000Z": "Great news for North Carolina! Excited to bring golf's finest players back to our state. 'The kind of thing you dream about:' PGA Championship will return to Charlotte in 2025 The PGA Championship, played in Charlotte in 2017, will return to the city in 2025 charlotteobserver.com", "2020-05-13T19:39:12.000Z": "Michelle Lanier is the director of @NCHistoricSites and author of \"My N.C. from A to Z\" - a children's book that celebrates North Carolina's rich African American heritage. Today, she joins #AtHomeWithFLONC to read and discuss her book! Learn more: https:// statelibrary.ncdcr.libguides.com/myncfromatoz", "2020-05-13T18:22:23.000Z": "\"There is no right or wrong way to feel. If you need to talk to someone or need help, please call Hope4NC at 1-855-587-3463 or visit http:// covid19.ncdhhs.gov/hope .\" #MentalHealthAwarenessMonth", "2020-05-13T15:45:06.000Z": ". @ncdhhs Secretary Mandy Cohen, M.D. and Director of @NCEmergency Mike Sprayberry will hold a press briefing at 2 p.m. regarding COVID-19. Watch the English and Spanish live stream at http:// ncdps.gov/news-conference .", "2020-05-12T22:54:30.000Z": "North Carolina's Task Force for Emergency Repurposing of Manufacturing is working with more than 300 companies across the state to produce critical PPE such as face shields, hand sanitizer and gowns for our frontline workers. https:// governor.nc.gov/news/north-car olina-working-local-manufacturers-make-critical-supplies ", "2020-05-12T18:07:33.000Z": "Thank you to the people working at these companies and the many others who are pitching in, donating equipment or finding other ways for their workers to help in this fight. This is exactly what I mean when I say North Carolina will get through this pandemic by working together.", "2020-05-12T18:06:59.000Z": "We also have three firms - including ASI Signage of Holly Springs, Gilero of Pittsboro, and Bright View Technologies of Durham - now producing face shields. We have already received several shipments from some of these companies with more expected in the coming weeks.", "2020-05-12T18:06:46.000Z": "Saab Barracuda in Lillington usually produces camouflage netting for the military, and Apple Rock, headquartered in Greensboro, specializes in trade show displays. Now they're both making isolation gowns. This is a critical piece of medical equipment that's been in short supply.", "2020-05-12T18:06:14.000Z": "Our state has a rich history as a leader in manufacturing and innovation, and I'm proud that businesses in our state are leading the way to make this personal protective equipment right here at home. I want to take a moment to recognize them.", "2020-05-12T18:06:05.000Z": "We've been fighting for more PPE and our manufacturing task force is identifying North Carolina businesses that can help. Several local manufacturers have shifted their production lines to make this important equipment.", "2020-05-12T18:05:47.000Z": "An essential part of beating this virus is giving health care workers and first responders the personal protective equipment they need. More PPE is also important in our ability to do more testing as lab techs & nurses need PPE to collect the sample from people being tested.", "2020-05-12T18:05:14.000Z": "More testing at hospital systems and doctors' offices is coming online every day. In order to help North Carolinians know where to get tested, @ncdhhs will begin posting a list of testing locations on the COVID website later this week.", "2020-05-12T18:04:35.000Z": "We need it to be easy and safe to get tested. We have many retail partners, including Walgreens, Walmart and Harris Teeter that are opening up testing sites for the public. Because these sites are federally funded, it doesn't cost the person to get tested there.", "2020-05-12T18:04:15.000Z": "Successful tracing builds on itself and obviously requires many more tests to be performed. To enter Phase 1 as we did last week, we doubled our testing to between 5,000 and 7,000 tests a day. But we have to keep pushing for more.", "2020-05-12T18:03:56.000Z": "Testing goes hand in hand with tracing. When someone comes up positive, our enhanced tracing workforce will find known contacts so those people can be tested. And if they have COVID-19, they should isolate. If they don't, they still need to be on the lookout for any symptoms.", "2020-05-12T18:03:29.000Z": "I want to talk today about how we are expanding testing in North Carolina. As we laid out last month, more testing is a critical part of our ability to ease restrictions and still keep people protected.", "2020-05-12T18:03:01.000Z": "The virus is likely to be with us for a while. In each phase, we need to remember the importance of the Three Ws. Wear a face covering. Wash your hands. Wait 6 feet apart from others. Face coverings are important to prevent spread of the virus to other people in case you have it.", "2020-05-12T18:02:32.000Z": "North Carolina has been in Phase 1 since Friday. Our state has seen more stores & businesses open as long as they meet rules for cleaning and screening employees. More people got out this past weekend, but most North Carolinians kept their distance, with some exceptions.", "2020-05-12T18:01:32.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update at 2:00pm. Watch it live here: https:// twitter.com/i/broadcasts/1 gqGvElmyygKB ", "2020-05-12T17:55:31.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update at 2:00pm. Watch it live here: Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Update - 5/12/20", "2020-05-12T15:30:23.000Z": ". @NC_Governor and members of the Coronavirus Task Force will hold a press conference on COVID-19 updates at 2 p.m. today. View the English and Spanish live stream at https:// ncdps.gov/news-conference . Closed captioning can be turned on in the live stream window.", "2020-05-12T11:30:16.000Z": "Questions on Phase 1? While the governor's stay-at-home order is STILL in place, and social distancing still recommended, there ARE some changes. Find answers to your frequently asked questions, visit https:// files.nc.gov/governor/docum ents/files/FAQs-for-Phase-1-EO-FINAL.pdf ", "2020-05-11T19:48:21.000Z": "North Carolina has been granted a federal disaster declaration for storms, tornadoes and flooding that hit the state in February. This declaration will help 18 counties that suffered damages continue to recover and make repairs. NC receives federal disaster declaration for February storms, tornadoes and flooding RALEIGH, N.C. (WNCT) The White House and FEMA have granted Governor Roy Cooper's April 9 request for a federal disaster declaration for eighteen counties that suffered damages from severe storms, f wnct.com", "2020-05-11T15:33:20.000Z": ". @ncdhhs Secretary Mandy Cohen, M.D. and Director of @NCEmergency Mike Sprayberry will hold a media briefing at 2:30 p.m. today regarding COVID-19.  Watch the English and Spanish live stream at http:// ncdps.gov/news-conference . You can enable closed captioning on the live stream window.", "2020-05-11T13:57:19.000Z": "Congratulations to the paramedics graduating from @abtech_cc and all of our graduating future healthcare workers. We are so proud of your hard work and your service to our state as we fight this pandemic. Graduating paramedics honored in unofficial ceremony Graduates of A-B Tech's EMS program were honored by their classmates and teachers after their pinning ceremony was canceled due to COVID-19. citizen-times.com", "2020-05-10T12:49:59.000Z": "Happy Mother's Day! We're taking over Mom's Instagram/ Facebook today! Stay tuned for our messages to our Mom.  - Hilary, Natalie, and Claire", "2020-05-10T15:06:41.000Z": "Our moms are always there for us and we honor them today. Even though I lost my mom more than 6 years ago, she's with me every day. I'm so grateful for my wife, Kristin and the amazing mom she is to our 3 daughters. Happy Mother's Day, dear! - RC", "2020-05-09T18:25:16.000Z": "I know it's hard for many of you not to be able to walk across the stage in front of a crowd to get your degree. But don't let this crisis crush your dreams. You're resilient. You're ready. And your state needs you to do great things. - RC", "2020-05-09T14:35:23.000Z": "Celebrating our moms will look different this year, and that can be especially tough for people who can't be with their families this weekend. We're grateful for companies like @Lowes that are helping make Mother's Day brighter for moms across the country. Lowe's sending $1 million worth of flowers to moms isolated because of the coronavirus Mooresville-based Lowe's is donating flower baskets to more than 500 long-term care and senior living centers. That's nearly 25,000 flowers charlotteobserver.com", "2020-05-08T20:36:36.000Z": "Don't lose sight of the people behind the numbers. Officer Bud is one of many North Carolinians we've lost who brightened the lives of people around him, and he will be deeply missed. 'A super hero.' Gov. Cooper speaks about N.C. sheriff's deputy who died from COVID-19 Affectionately known as \"Deputy Bud\" in the community, he served as a Sheriff's Deputy and School Resource Officer in Montgomery County for 14 years. wbtv.com", "2020-05-08T18:15:32.000Z": "We are grateful for them - and all of our first responders and frontline workers. They are showing us how team work, dedication and sacrifice will get our state to the other side of the pandemic.", "2020-05-08T18:15:15.000Z": "This week marked special recognition for several important groups of people. Nurses, law enforcement officers, correctional officers and teachers all share the same appreciation week. This pandemic has taught us how truly valuable the people who work in these jobs are.", "2020-05-08T18:14:19.000Z": "As we go out more, we must all get used to the Three Ws - wearing a face covering, waiting 6 feet apart from others and washing our hands frequently.", "2020-05-08T18:14:04.000Z": "We still need to keep certain businesses closed or limited during this phase. Public health experts have explained that any place people sit or stand still for more than 10 minutes, especially indoors, greatly increases the risk of spreading this virus.", "2020-05-08T18:13:45.000Z": "Phase 1 is a careful, modest step to re-igniting our economy while keeping important safety rules in place. The gathering limit of 10 people remains in effect, but more businesses can open with important safety rules in place. State parks will be open too.", "2020-05-08T18:13:24.000Z": "We can enter Phase 1 because the indicators we laid out two weeks ago - the data and the science - show that we can.", "2020-05-08T18:13:15.000Z": "And even though today at 5 pm, North Carolina moves into Phase 1, know that the Stay at Home order is still in effect. It's still better to stay home if you can. However, in Phase 1 there are more allowable reasons to leave home, including to help give the economy a boost.", "2020-05-08T18:12:44.000Z": "But what we've learned in their deaths and from research is how to limit the spread of the virus. And I urge everyone to do what we know works, and to stay vigilant.", "2020-05-08T18:12:33.000Z": "As we make decisions and debate issues surrounding this virus, we must realize that each number represents the death of a real person. COVID-19 is a lethal threat. Separating people from their loved ones at the darkest of hours. And taking our everyday heroes away from us.", "2020-05-08T18:10:34.000Z": "At every briefing since our state's first death, I've shared the number of fatalities due to COVID-19. As NC moves into Phase 1 today, I want everyone to remember what those numbers mean. Every time our state counts another death, a family and a community descend into mourning.", "2020-05-08T18:08:40.000Z": "Live updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update at 2:00pm. Watch it live here: https:// twitter.com/i/broadcasts/1 kvJpXowlELJE ", "2020-05-08T17:55:31.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update at 2:00pm. Watch it live here: Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Update - May 8, 2020", "2020-05-08T14:35:11.000Z": "Calling all Caniacs! Jaccob Slavin from the @Canes and his daughter join us for storytime! Today, they read \"Goodnight, Ark\" by Laura Sassi. #AtHomeWithFLONC  #GoCanes The following media includes potentially sensitive content. Change settings View", "2020-05-07T23:22:47.000Z": "El viernes, el 8 de mayo a la 5 de la tarde, Carolina del Norte entrará en Fase Uno. La siguiente grafica muestra lo que significa Fase Uno para nuestro estado:", "2020-05-07T19:44:18.000Z": "Today is Peace Officers Memorial Day in North Carolina. While we can never properly thank the brave officers who lost their lives in the line of duty, we can honor their lives and memories by pausing to reflect on their contributions.", "2020-05-07T16:46:03.000Z": "Thanks to the @NCNationalGuard for honoring our frontline health care workers. North Carolinians are resilient - we'll get through this together. Quote Tweet WakePA @WakeForest_PA Aircrews from the North Carolina National Guard's 145th Airlift Wing fly over Wake Forest Baptist Health to salute health care and medical research workers who are helping to combat COVID-19.", "2020-05-07T15:30:23.000Z": "Members of the Coronavirus Task Force will hold a briefing on #COVID19NC updates at 2 p.m. today.\n\nWatch the live stream: http:// ncdps.gov/news-conference .", "2020-05-07T14:25:48.000Z": "Thanks to donations from @ATT , @Google & @DukeEnergy , more than 280 school buses will bring Wi-Fi to communities across NC. This will help students without home internet access get connected as we continue remote learning for the rest of the school year. https:// governor.nc.gov/news/school-bu ses-serve-wi-fi-hot-spots-remote-learning ", "2020-05-06T15:31:24.000Z": "Happy Nurses Week from @NC_Governor ! #NursingForward ® #HappyNursesWeek  #NursesWeek  #NationalNursesWeek  #ThankYouNurses", "2020-05-06T18:40:46.000Z": "As one of many @DurhamBulls fans, I think it's only right to have the Dinos as our adopted quaran-team. - RC Quote Tweet NC 다이노스 @NCdinos_fan Replying to @DurhamBulls @DurhamBulls Destiny.... It was meant to be, come on North Carolina! #ncdinos  #KBO  #NorthCarolina  #NC", "2020-05-06T17:34:01.000Z": "\"It takes so much strength, patience and compassion to be a nurse, and you should be proud of the difference you're making in people's lives.\" #NursesWeek", "2020-05-06T16:05:06.000Z": "Members of the Coronavirus Task Force will hold a briefing on #COVID19NC updates at 2 p.m. today.\n\nWatch the live stream: http:// ncdps.gov/news-conference .", "2020-05-06T15:49:30.000Z": "Representative Sydney Batch has made over 120 face masks for first responders and frontline workers in North Carolina! Today, she joins us to teach a tutorial on making your own face mask. Visit our Facebook page for the full video! #AtHomeWithFLONC  @friendsforbatch", "2020-05-06T12:52:06.000Z": "Thank you to @NCNationalGuard for honoring our Healthcare, Food Bank, first responder and frontline heroes today with C-17 flyover as part of Operation: American Resolve. We appreciate you! Quote Tweet NC National Guard @NCNationalGuard The @NCAirGuard 's 145th Airlift Wing will be conducting a C-17 flyover of various N.C. cities, hospitals, and food banks on Thurs., May 7, as part of Operation: American Resolve. For more info. and route of flight see below. @USNationalGuard  @NCPublicSafety  @NCEmergency  @ncdhhs", "2020-05-05T22:09:31.000Z": "North Carolina will move into Phase One at 5 PM on Friday, May 8. Learn more about what this means for you and your family below.", "2020-05-05T21:52:00.000Z": "One clarification from today's press conference: Overnight camps may not operate under Phase 1. North Carolina is awaiting national guidance from the Centers for Disease Control and Prevention and American Camp Association to determine if they may open in Phase 2.", "2020-05-05T21:17:30.000Z": "I have seen countless stories of North Carolinians looking out for each other as we work to make it through day by day. Whenever you stay home, sanitize a grocery cart, go out wearing a face covering and stay physically distant, you are looking out for your neighbor.", "2020-05-05T21:16:38.000Z": "Phase 1 is designed to be a limited easing of restrictions that can give people safe opportunities to socialize & boost parts of our economy while keeping safety restrictions in place. And we can only boost our economy when people have confidence in their safety.", "2020-05-05T21:15:59.000Z": "This order is set to expire on May 22, but if our indicators are not in the right place, we'll extend Phase 1 longer than two weeks. We are easing restrictions in a data-driven way.", "2020-05-05T21:15:07.000Z": "We'll continue the Stay At Home order because it's still best for people to stay at home. And when people do leave home, we want folks to remember the three W's: Wear a face covering, Wait 6 feet apart from other people and Wash your hands.", "2020-05-05T21:14:37.000Z": "We are paying attention to First Amendment rights such as protesting & worship services. Under this order these activities are allowed outdoors with more than 10 people as long as there is social distancing.", "2020-05-05T21:13:53.000Z": "As certain businesses come back online, we know the need for childcare will increase. And Phase 1 will allow child care centers to re-enroll children whose parents are back at work or looking for work, as long as the centers follow strict cleaning requirements.", "2020-05-05T21:13:31.000Z": "Gatherings in this order are still limited to 10 people, but people will be able to socialize with friends as long as they are outdoors and they are socially distanced. In Phase 1, people are still encouraged to telework when possible.", "2020-05-05T21:13:14.000Z": "Businesses that were specifically closed in the last order will remain closed such as salons, barbers, theaters, bars, gyms & pools. Restaurants will continue to be open for takeout or delivery only. These businesses will have the opportunity to open and do more in Phase 2.", "2020-05-05T21:12:39.000Z": "Phase 1 removes the designations of essential and non-essential businesses. Retail stores can increase to 50 percent capacity as long as they implement social distancing. The order allows people to leave home to visit open businesses and it encourages parks & trails to re-open.", "2020-05-05T21:12:01.000Z": "I want to be clear - North Carolina's Stay At Home order will remain in place. But it will be modified to allow for more reasons for people to leave home and to allow for more commercial activity.", "2020-05-05T21:11:44.000Z": "Because the combination of our indicators tell us that our trends are mostly decreasing or leveling, I have signed an Executive Order to move North Carolina into Phase 1 of easing restrictions. This order begins this Friday, May 8, at 5 pm.", "2020-05-05T21:03:19.000Z": "We must be cautious and methodical with plans to ease restrictions. Removing them all at once would cause a surge in new cases, more people in the hospital & more North Carolinians dying. We have to keep taking precautions to keep people safe, but we can't stay at home forever.", "2020-05-05T21:02:53.000Z": "North Carolinians have done hard work, staying at home, social distancing & wearing face coverings. The good news is your work has prevented an overwhelming spike in infections. The harder news is that there's no cure or vaccine for COVID-19, and the virus continues to circulate.", "2020-05-05T21:01:48.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the North Carolina Coronavirus Task Force will give an update at 5:00pm. Watch it live here. https:// twitter.com/i/broadcasts/1 yoKMaXpLQoKQ ", "2020-05-05T20:56:15.000Z": "Gov. Cooper and members of the North Carolina Coronavirus Task Force will give an update at 5:00pm. Watch it live here. Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Update - 5pm, May 5, 2020", "2020-05-05T20:31:21.000Z": "It's Teacher Appreciation Day / Week! Teachers go above and beyond for students and families throughout our 100 counties -- especially during these trying times. Roy and I are so thankful. - KC #TeacherAppreciationDay  #TeacherAppreciationWeek", "2020-05-05T18:30:58.000Z": "\"Teachers go the extra mile for their students under normal circumstances, and now during this pandemic they are running a marathon to educate and support their students in these unprecedented times.\" #TeacherAppreciationDay Governor Cooper announces Teacher Appreciation Week May 4-8 In recognition of the significant impact teachers have on our children, Governor Roy Cooper has proclaimed May 4-8 Teacher Appreciation Week in North Carolina. wect.com", "2020-05-05T15:44:41.000Z": "Thank you to our correctional officers and correctional employees for keeping our state safe and working tirelessly in the face of COVID-19.", "2020-05-05T14:30:27.000Z": "@NC_Governor and members of the Coronavirus Task Force will hold a briefing on #COVID19NC updates at 5 p.m. today.\n\nWatch the live stream: https:// ncdps.gov/news-conference .", "2020-05-04T21:11:28.000Z": "State officials have already made plans to be ready for a potential hurricane while still protecting people from COVID-19. Gov. Cooper encourages people to take time during Hurricane Preparedness Week to discuss emergency plans with their families. https:// governor.nc.gov/news/governor- proclaims-may-3-9-hurricane-preparedness-week ", "2020-05-04T14:20:57.000Z": "We're excited to announce the winning name of the youngest Southern white rhino calf born at the @NCZoo this year! Thanks to everyone who submitted a vote! \n- KC Quote Tweet North Carolina Zoo @NCZoo We sent a special package to @FLONC so she could deliver the great news! We have a winning name for our youngest Southern white rhino calf. Check out the video to learn her name: https:// bit.ly/RhinoCalfNameR eveal  Show this thread", "2020-05-04T17:34:04.000Z": "Today, Gov. Cooper signed two bipartisan COVID-19 relief bills into law. These bills include nearly $1.6 billion in assistance for North Carolina families, schools, hospitals and small businesses as we continue fighting COVID-19. https:// governor.nc.gov/news/governor- cooper-signs-covid-19-relief-bills-law ", "2020-05-04T15:25:40.000Z": "Gov. Cooper and legislative leaders give an update on North Carolina's COVID-19 response. Watch live at 11:30: Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Update - May 4, 2020", "2020-05-04T13:30:18.000Z": ". @NC_Governor and members of the Coronavirus Task Force will hold a briefing on #COVID19NC updates at 11:30 a.m. today.\n\nWatch the live stream: http:// ncdps.gov/news-conference .", "2020-05-04T00:57:03.000Z": "Through every emergency, Director Sprayberry is a dedicated and thoughtful leader. Grateful for the work he does every day to keep North Carolinians safe. In the eye of the storms: NC emergency leader, Charlotte grad faces his latest challenge North Carolina's emergency management director has been through a lot of storms. Here's what he says keeps him up at night. charlotteobserver.com", "2020-05-02T15:33:23.000Z": "A Message from President George W. Bush @TheCalltoUnite", "2020-05-02T19:06:24.000Z": "Gov. Cooper's statement on the legislature passing two COVID-19 relief bills:", "2020-05-02T14:45:55.000Z": "Laurel Harris and Rob Marnell are both North Carolina natives and Broadway actors! Today, they join us to sing \"Wagon Wheel\" by Old Crow Medicine Show.  #AtHomeWithFLONC The following media includes potentially sensitive content. Change settings View", "2020-05-01T20:35:41.000Z": ". @NC_Governor Cooper today ordered all US and NC flags at state facilities to be lowered to half-staff beginning Fri, May 1, 2020 until sunset on Mon, May 4, 2020 in honor of former NC State Senator and Senate Majority Leader Tony Rand...Read more here: https:// bit.ly/3b1iWqQ", "2020-05-01T15:45:05.000Z": "Members of the Coronavirus Task Force will hold a briefing on #COVID19NC updates at 2 p.m. today.\n\nWatch the live stream: https:// ncdps.gov/news-conference .", "2020-05-01T16:55:14.000Z": "\"Happy Ramadan to all who celebrate. I hope that this holy month brings you an opportunity for reflection and renewal,\" - Gov. Cooper", "2020-05-01T15:45:40.000Z": "Gov. Cooper's statement on the passing of former North Carolina Senate Majority Leader Tony Rand:", "2020-05-01T03:32:50.000Z": "Shut it all down. \n\nThe staff at West Craven High School (NC) visited every single 2020 senior - all 220 of them - to deliver personalized yard signs as schools remain closed due to COVID-19 pandemic. \n\nLeadership. Humanity. From EducationNC", "2020-04-30T22:25:36.000Z": "\"North Carolinians have made tremendous sacrifices and it is making a difference. We remain hopeful that the trends will be stable enough to move into Phase 1 next week.\" - Gov. Cooper.", "2020-04-30T22:25:35.000Z": "Today, Gov. Cooper and @ncdhhs Sec. Cohen shared an update on where North Carolina stands in the fight against COVID-19 and urged North Carolinians not to let their guard down.", "2020-04-30T20:58:15.000Z": "North Carolinians can call 2-1-1 if they need help or resources in response to COVID-19. Please leave 9-1-1 lines open for emergencies only. Non-emergency calls to 9-1-1 can delay emergency response to someone in need.", "2020-04-30T20:37:11.000Z": "\"Many North Carolina families are still struggling from the devastation caused by Hurricane Florence, and even in the midst of a pandemic we're the first state in the country to receive approval on a plan to start drawing down these funds,\" - Gov. Cooper HUD approves NC plan for spending Hurricane Florence recovery funds RALEIGH, N.C. (WNCT) The U.S. Department of Housing and Urban Development has approved North Carolina's action plan for spending $542 million in Community Development Block Grant-Disaster Recovery  wnct.com", "2020-04-30T19:17:13.000Z": "This plan is based on data, science and facts. It prioritizes the health and safety of our communities while focusing on ways to jumpstart our economy safely. Doing it the right way will give people confidence in institutions and each other that it is safe to move forward.", "2020-04-30T19:16:48.000Z": "Learning about new drugs and vaccine development is encouraging. But they will take time. Our job is to do what we know works right now. Keep our physical distance, sanitize, stay at home. I know this is a difficult time for many people, but there is hope and there is a plan.", "2020-04-30T19:16:33.000Z": "Though our lives have been forever changed, there are signs of hope. An experimental drug tested at @UNC shows promise of easing COVID-19 symptoms. I want to thank the researchers for their work. It shows the importance of strong research and science at our state universities.", "2020-04-30T19:05:21.000Z": "That's why we're looking at facts & science to guide the way. That's why we're asking businesses to take precautions for their employees and customers. We must get the economy running better, but we need working people to trust that they will feel safe as we move forward.", "2020-04-30T19:05:07.000Z": "Even as we ease restrictions, if you the people don't feel safe, it won't work. In order for the people to be with us, there has to be trust and a knowledge that they can feel safe when they work, shop and eat out.", "2020-04-30T19:04:30.000Z": "The three-phase plan is like a dimmer switch, letting us gradually lift restrictions so that we can get moving again without a dangerous spike in infections. This approach and the indicators we're watching follow the guidance of the President's Coronavirus Task Force.", "2020-04-30T19:04:09.000Z": "My message today is to stay vigilant. Right now, we need people to continue following the Stay At Home order so that we can move into the phases of easing restrictions. Complacency could risk lives and undo these plans.", "2020-04-30T19:03:55.000Z": "Last week we shared details on key indicators we're watching to ensure data & facts guide our decisions. Those graphs are updated daily on the Case Count Dashboard at http:// nc.gov/covid19 . We remain optimistic the trends will be stable enough to move us into Phase 1 next week.", "2020-04-30T19:03:09.000Z": "Last week, we shared our three-phase plan to ease restrictions & how we'll measure progress. Some are on track but there are potential warning signs ahead. But, you've made tremendous sacrifices & it's working. By looking out for your health & others, you're making a difference.", "2020-04-30T19:01:49.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update at 3:00pm. Watch live here. https:// twitter.com/i/broadcasts/1 lDGLggeZmQKm ", "2020-04-30T18:55:15.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update at 3:00pm. Watch live here. Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Update 4/30/20", "2020-04-30T17:20:06.000Z": ". @NC_Governor and members of the Coronavirus Task Force will hold a press conference at 3 pm today to provide updates on COVID-19 in NC. Watch the live stream at https:// ncdps.gov/news-conference .", "2020-04-30T17:01:43.000Z": "Congrats to our Class of 2020! Thank you to our dedicated principals, teachers and school staff for finding innovative ways to celebrate our seniors. Quote Tweet EducationNC @EducationNC The staff at West Craven High School visited every single 2020 senior - all 220 of them - to deliver personalized yard signs as schools remain closed due to COVID-19. @TabariWallace  @cravencoschools  https:// ednc.org/west-craven-hi gh-school-senior-suprise/ ", "2020-04-30T13:25:07.000Z": "\"I know it's difficult not to be together on campus, especially today. But while we're physically apart, our bonds are tighter than ever,\" - Gov. Cooper. #CharlotteStrong  #NinerNation", "2020-04-29T19:42:55.000Z": "Gov. Cooper spokesman Ford Porter's statement on Gaston County:", "2020-04-29T15:07:51.000Z": "We're joined today by the Honorable Chief Justice of the North Carolina Supreme Court! Join us as @JusticeCBeasley reads \"Dream Big, Little One\" by Vashti Harrison. Visit our Facebook page for the full story! #AtHomeWithFLONC", "2020-04-28T19:22:56.000Z": "North Carolina is celebrating over 37 years of the Guardian ad Litem (GAL) program! GAL volunteers are advocating for North Carolina children throughout our 100 counties, and coming from a fellow GAL volunteer, we couldn't be more thankful.    \n- KC", "2020-04-28T18:07:42.000Z": "We can do this. I know it's hard, but it is saving lives. As one Charlotte teacher said she would virtually write in her students' yearbooks, \"Rise up. Move on. You can do it.\" We can do this, North Carolina.", "2020-04-28T18:07:21.000Z": "We've grabbed hold of the opportunity to save lives in North Carolina. We have done that together, through our own actions. We continue to plan for the days ahead when we ease restrictions and work our way back to a new normal. But for now, stick with it.", "2020-04-28T18:07:01.000Z": "As we enter another week of staying at home, I want to thank North Carolinians everywhere for following the restrictions. And I want to remind everyone that we can't let our guard down just yet.", "2020-04-28T18:06:42.000Z": "These are just some examples of the work of our National Guard. I am proud of them. I am grateful for them. And I can rest just a little bit easier knowing they are Always Ready when we need them.", "2020-04-28T18:06:28.000Z": "And we have Army and Air Guard medical personnel ready to assist in the event we need to use Sandhills Regional Medical Center as an overflow medical facility.", "2020-04-28T18:06:16.000Z": "General Allen Boyette is leading our Food Supply Chain Work Group, which meets daily. They are ensuring our grocery stores remain stocked and our food supply remains strong. They're also working with our food banks, delivering over 40,000 meals to school nutrition sites.", "2020-04-28T18:06:01.000Z": "One of the National Guard's first tasks is supporting warehouse logistics. They've conducted 242 missions, traveling over 45,000 miles to 77 counties delivering personal protective equipment to hospitals, medical sites and other facilities in need.", "2020-04-28T18:05:21.000Z": "Yesterday the head of our National Guard General Todd Hunt and I had a call with US Secretary of Defense Mark Esper, and we got to thank him for the tremendous partnership we have in our state, and for the essential work the National Guard is providing in food supply & logistics.", "2020-04-28T18:05:02.000Z": "I also want to thank another of our key partners today for their work - the @NCNationalGuard . Without missing a beat, these 939 men and women that I have activated have been there when we need them. \"Always Ready,\" as their mission explains.", "2020-04-28T18:04:41.000Z": "That's an essential step to containing and isolating those who may carry the disease. The collaborative has already started recruiting for the 250 positions they will need to fill. Time is of the essence, and I appreciate their quick work to stand up this partnership.", "2020-04-28T18:04:27.000Z": "Contact tracing is critical to our ability to safely ease restrictions. Think of it like detective work helping track down anyone who may have been exposed to a person who tests positive.", "2020-04-28T18:04:14.000Z": "We're enacting our battle plan. Yesterday, @ncdhhs signed a key partnership to advance our efforts to fight COVID-19.  The Carolina Community Tracing Collaborative brings 2 trusted groups together that have long-standing experience in health care to bring on more contact tracers.", "2020-04-28T18:03:39.000Z": "Last week, I told you about the budget proposal we made to the legislature. Today, the session starts & they'll work on ways to direct federal dollars to help our state. If done right, we can get more testing, increased equipment, unemployment assistance, and other vital help.", "2020-04-28T18:03:15.000Z": "We're seeing some leveling and hope to see more. We know what helps push down these numbers: social distancing, careful cleaning and staying home. If we keep working at these, we'll get to where we need to be.", "2020-04-28T18:02:56.000Z": "We've set out in detail the benchmarks we want to hit as we move toward the phases that will help spur the economy while keeping us safe. I invite you go to http:// nc.gov/covid19 & visit the case count dashboard to see how we're doing in our fight to slow this disease.", "2020-04-28T18:01:58.000Z": "Updates from Gov. Cooper's COVID-19 briefing: Quote Tweet Governor Roy Cooper @NC_Governor Gov. Cooper and members of the Coronavirus Task Force will give an update at 2pm. Watch it live here: https:// twitter.com/i/broadcasts/1 jMKgQwLjPkJL ", "2020-04-28T17:59:19.000Z": "Gov. Cooper and members of the Coronavirus Task Force will give an update at 2pm. Watch it live here: Governor Roy Cooper @NC_Governor Gov. Cooper Coronavirus Update 4/28/20", "2020-04-28T16:22:31.000Z": ". @NC_Governor and members of the Coronavirus Task Force will hold a briefing on #COVID19NC updates at 2 p.m. today.\n\nWatch the live stream: https:// ncdps.gov/news-conference .", "2020-04-27T22:11:58.000Z": "The North Carolina Executive Mansion is a part of the national program \"Plant A Row for the Hungry,\" which aims to support local food banks and shuttles with fresh produce. We just delivered the latest picks at Logan's Garden Shop / the Inter-Faith Food Shuttle.", "2020-04-27T21:52:34.000Z": "Contact tracing is a key part of Gov. Cooper's three-phase plan to start lifting restrictions. The Carolina Community Tracing Collaborative will play a critical role in helping local health departments stop the spread of COVID-19 in our communities. Quote Tweet NCDHHS @ncdhhs . @ncdhhs is partnering w/ @communitycarenc & @ncahec to launch a tracing effort to identify people who have come in contact w/ someone who has tested positive for #COVID19 . This is part of @NC_Governor 's initiative to slowly lift restrictions. https:// ncdhhs.gov/news/press-rel eases/ncdhhs-announces-carolina-community-tracing-collaborative ", "2020-04-27T16:01:38.000Z": "Members of the Coronavirus Task Force will hold a briefing on #COVID19NC updates at 3 p.m. today.\n\nWatch the live stream: https:// ncdps.gov/news-conference .", "2020-04-27T14:02:02.000Z": "New Moms: please visit http:// NewMomHealth.com to access information on postpartum health and wellness - including information related to COVID-19. @PCANC  #BeAConnection during #COVID19NC .", "2020-04-27T13:36:36.000Z": "North Carolina self-employed workers and independent contractors who are out of work because of COVID-19 can now apply for Pandemic Unemployment Assistance. \n\nLearn more about how to apply for benefits here: North Carolinians can apply for Pandemic Unemployment Assistance beginning April 24 RALEIGH, N.C. (WNCT) North Carolina independent contractors and self-employed workers out of work due to COVID-19 can apply for federal Pandemic Unemployment Assistance beginning this Friday, April wnct.com", "2020-04-26T16:31:26.000Z": "To North Carolina's school nutrition and transportation personnel -- thank you for being the heroes we need in this fight.", "2020-04-25T19:46:49.000Z": "School buildings may be closed for the rest of the academic year, but the learning is not over. \n\nRead more about how the state is supporting students who need WiFi & meals as they continue remote learning here: https:// governor.nc.gov/news/governor- cooper-state-education-leaders-remote-learning-continue-through-end-2019-2020-school ", "2020-04-24T21:31:40.000Z": "\"We're not going to risk the health of our people or our hospital system by opening too early.\" \n\nGov. Cooper spoke with @JakeTapper about North Carolina's response to COVID-19.", "2020-04-24T20:30:35.000Z": ". @NC_Governor will be speaking with @jaketapper on @TheLeadCNN in a few minutes. Tune in!", "2020-04-24T18:26:09.000Z": "Lots of things in North Carolina aren't the same as they were two months ago. But we are the same people, strong and resilient, and we are doing right by protecting ourselves & our communities. By safeguarding our education and health, we will build our state back effectively.", "2020-04-24T18:18:19.000Z": "Those who have followed my past budget recommendations know that this proposal does not contain everything I want, but I present it after consultation with General Assembly members in both parties in the spirit of consensus and compromise.", "2020-04-24T18:18:03.000Z": "I'm recommending strong investments to respond to this unprecedented crisis. We know people are hurting, businesses are struggling & governments are facing severe shortages because of this virus. That's why we must act now to get resources distributed in a smart, efficient way.", "2020-04-24T18:17:41.000Z": "The budget package is intended to fund immediate needs in three main areas: public health and safety, continuity of operations for education and other state government services, and assistance to small businesses and local governments.", "2020-04-24T18:17:25.000Z": "We do have some more news to share today. I am releasing a proposed budget for our state that directs $1.4 billion in federal money to help our state from the CARES Act Coronavirus Relief Fund to help our state.", "2020-04-24T18:07:12.000Z": "The opening of schools in summer and fall, and the availability of summer camps, are going to depend on meeting health guidelines."}