{"2020-06-26T21:37:29.000Z": "\"Wear a mask. Wear a mask. Wear a mask.\"", "2020-07-30T16:35:48.000Z": "Today we broke ground on Amazing Grace Park, The Clementa Pinckney Memorial in Marion. It is a great tribute to a man who had a large impact on our state, a perfect example of the heritage and culture of South Carolina.", "2020-07-29T20:59:18.000Z": "These limited restrictions are temporary, they are measured, and they are targeted towards what we know works. They give us the best chance to slow the spread of the virus without shutting down the state's economy - which we cannot and will not do - as many continue to call for. Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Takes Additional Action to Slow Virus Spread |  Additional Restrictions on Restaurants, Government Buildings, Limits Crowd Sizes, Calls on Local Governments to Pass Ordinances https:// governor.sc.gov/news/2020-07/g ov-henry-mcmaster-takes-additional-action-slow-virus-spread ", "2020-07-29T13:12:43.000Z": "While virtual school will be a great solution for many families, for others, especially single parents, that will simply not be an option. We must offer the choice of in person instruction for every family who needs it. What do you think? Quote Tweet The Post and Courier @postandcourier In South Carolina, 41% of children are growing up in single-parent families. https:// bit.ly/33213rh", "2020-07-28T14:14:13.000Z": "South Carolina has the best National Guard in the United States. Thank you General McCarty and all of the men and women of the @SCNationalGuard for the invaluable service you have provided during the COVID-19 pandemic. Quote Tweet SC National Guard @SCNationalGuard A message from The Adjutant General for SC, MG Van McCarty thanking the Soldiers, Airmen, and employees of the @SCMilitaryDept who have been activated and continue to respond to missions in the state in support of #COVID19 response efforts: https:// youtu.be/opHm3mGr1aE  #InThisTogether", "2020-07-23T21:20:44.000Z": "Thank you for fighting for South Carolina's students, @SenatorTimScott ! Quote Tweet Tim Scott @SenatorTimScott It's an honor to partner with @SenAlexander on the School Choice Now Act. When parents have a choice, kids have a better chance of success! Education is the key to the American dream.", "2020-07-23T19:58:34.000Z": "To be eligible, a student must be from a household with an adjusted gross income of 300% or less of the federal poverty level.\n(4/)", "2020-07-23T19:58:33.000Z": "What are Safe Access to Flexible Education (SAFE) Grants?\n\nOn July 20, we announced the creation of the Safe Access to Flexible Education (SAFE) Grants in South Carolina.\n(1/)", "2020-07-23T19:38:19.000Z": "The Fourth Circuit correctly affirmed that the approach used by South Carolina and 47 other states to appoint presidential electors does not violate the Constitution or the Voting Rights Act.  \n\n(1/2) Quote Tweet SC Governor Press @scgovernorpress Statement from Gov. Henry McMaster on U.S. Court of Appeals Electoral College Ruling https:// governor.sc.gov/news/2020-07/s tatement-gov-henry-mcmaster-us-court-appeals-electoral-college-ruling ", "2020-07-23T15:47:33.000Z": "Please join us in remembering the life and service of Captain Durham, and keep his family and loved ones in your prayers. Quote Tweet SC Governor Press @scgovernorpress Governor Henry McMaster orders that the flags on\nall state buildings be lowered to half-staff from sunrise until sunset on Thursday, July 23, 2020, in tribute to Captain John Durham, Jr. of the Winnsboro Department of Public Safety, who died in the line of duty. Show this thread", "2020-07-21T19:32:38.000Z": "We were proud to welcome @Mike_Pence back to the Palmetto State. We had great discussions on the response efforts to COVID-19 and the need to get our children back to school in the fall.", "2020-07-20T16:47:23.000Z": "Walmart has proven to be an exemplary partner that is committed to South Carolina and our citizens. We couldn't be prouder that such an important and successful company has decided to invest in our people and create even more jobs for hardworking South Carolinians. (1/2) Quote Tweet SC Governor Press @scgovernorpress Walmart Selects Dorchester County as Site for New Distribution Center | $220 Million Investment Creating More Than 1,000 New Jobs https:// governor.sc.gov/news/2020-07/w almart-selects-dorchester-county-site-new-distribution-center ", "2020-07-18T20:22:17.000Z": "John Lewis lived a life of dedication to public service that serves as an example to all, and he left a legacy that has impacted us all. Our prayers are with his loved ones. Quote Tweet SC Governor Press @scgovernorpress As a mark of respect for the memory and longstanding service of  Representative John Lewis, of Georgia, the President has issued a proclamation ordering that the flag of the United States be flown at half-staff until sunset on July 18, 2020.\n(1/2) Show this thread", "2020-07-17T13:32:35.000Z": "We must maintain this momentum by continuing to get South Carolinians back to work in the safest way possible because we must ensure the future economic health of our state and our people. (2/2)", "2020-07-17T13:32:22.000Z": "This news shows that South Carolina is leading the way in our economic recovery efforts and that we can, and will, overcome any challenge by working together, being smart, and showing compassion for our neighbors. (1/) Quote Tweet SC Governor Press @scgovernorpress Statement from Gov. Henry McMaster on June Employment Situation https:// governor.sc.gov/news/2020-07/s tatement-gov-henry-mcmaster-june-employment-situation ", "2020-07-17T11:00:00.000Z": "Please take a moment today to remember former Adjutant General Stanhope S. Spears, Sr., and keep his family in your prayers. General Spears served his country and state honorably for decades, and he will be missed. Quote Tweet SC Governor Press @scgovernorpress Governor Henry McMaster orders that the flags atop the State Capitol Building be lowered to half-staff from sunrise until sunset on Friday, July 17, 2020, (1/2) Show this thread", "2020-07-15T19:06:34.000Z": "We must give parents the choice in how they want their children educated. Whether that is sending them back to school for in-person learning, or keeping them home for virtual learning, they should be able to make that choice with confidence.", "2020-07-14T15:04:07.000Z": "You may never know whose lives you save by wearing a mask and social distancing, but each of them has a family and friends who can be spared the pain of loss if you do. #WearItSC  #FightTheSpread  #stayhealthysc Quote Tweet SCDHEC @scdhec \"I don't want anyone to have to experience the loss that my family and I have.\" -Dr. Brannon Traxler on losing her grandmother to COVID-19. #FightTheSpread Learn more at http:// scdhec.gov/COVID19 .", "2020-07-10T20:43:49.000Z": "Our summer interns had a message they wanted to share with you today. #WearItSC", "2020-07-10T16:05:41.000Z": "This measured, carefully tailored approach will lessen the opportunity for South Carolinians to put themselves and their loved ones in harm's way.\n\n(2/2)", "2020-07-10T16:04:25.000Z": "We know that young adults who are rapidly contracting the virus and spreading it into our communities frequently congregate in late-night atmospheres which simply are not conducive to stopping its continued transmission. \n\n(1/) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Prohibits Alcohol Sales at Bars and Restaurants After 11 PM https:// governor.sc.gov/news/2020-07/g ov-henry-mcmaster-prohibits-alcohol-sales-bars-and-restaurants-after-11-pm ", "2020-07-09T19:08:03.000Z": "This new investment of more than $215 million creating 380 new jobs in Lexington County is a great win for Team South Carolina.\n\n(2/2)", "2020-07-09T19:07:49.000Z": "We are proud to have Nephron Pharmaceuticals in South Carolina. Since coming here they have become an integral part of the community, and recently have been vital in the fight against COVID-19. \n\n(1/2) Quote Tweet SC Governor Press @scgovernorpress Nephron Pharmaceuticals Corporation Expanding Operations in Lexington County | $215.8 Million Investment Will Create 380 New Jobs https:// governor.sc.gov/news/2020-07/n ephron-pharmaceuticals-corporation-expanding-operations-lexington-county-0 ", "2020-07-09T16:34:51.000Z": "These funds will be used to upgrade the capabilities of these institutions to serve students with online learning.\n\n(2/2)", "2020-07-09T16:34:40.000Z": "I am pleased to announce this investment in our HBCUs. This spring when learning went from in-person to online, the faculty and students at our HBCUs faced significant technology challenges. \n\n(1/2) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Invests $2.4 Million in Historically Black Colleges and Universities https:// governor.sc.gov/news/2020-07/g ov-henry-mcmaster-invests-24-million-historically-black-colleges-and-universities ", "2020-07-08T14:40:49.000Z": "Wear your mask now so our children can return to school in the fall. #WearItSC", "2020-07-08T14:06:09.000Z": "We must ensure that our children can return to school safely this fall. Commentary: SC children need to be back in school; we have to make it happen As a pediatrician and member of the MUSC Board of Trustees, I concur with the advice and guidance issued last week by the American Academy of Pediatrics: We must reopen postandcourier.com", "2020-07-07T16:17:05.000Z": "King Dixon's service and dedication on behalf of his nation and state are quite remarkable. His contributions to the Laurens community changed the lives of many. Peggy and I are praying for his wife, Augusta, and the Dixon family.", "2020-07-04T12:49:22.000Z": "Each of us can help slow the spread of #COVID19 this holiday weekend. Governor @henrymcmaster shares why he wears a mask. #SlowTheSpreadSC", "2020-07-04T11:04:05.000Z": "Today is a good opportunity for every American to take a moment and read the Declaration of Independence. To get reacquainted with a vision so bold and profound that a nation was born from it... (1/2)", "2020-07-03T21:00:00.000Z": "We want everyone to have a safe and happy Independence Day weekend, and to ensure that as many people as possible live to celebrate Independence Day next year too. \n\nWear a mask. #WearItSC", "2020-07-03T19:06:00.000Z": "Our economy depends on it. Wear a mask. #WearItSC", "2020-07-03T17:04:00.000Z": "Wear a mask for our hospitality and tourism workers. #WearItSC", "2020-07-03T15:24:00.000Z": "Jobs depend on it. Wear a mask. #WearItSC", "2020-07-03T13:01:00.000Z": "Wear a mask to stop the spread of the virus. #WearItSC", "2020-07-02T23:00:00.000Z": "Wear a mask for your family and friends. #WearItSC", "2020-07-02T20:43:32.000Z": "Today I have directed DHEC to postpone releasing their guidelines for allowing limited visitation at our state's nursing homes and assisted living facilities. We must protect the lives of our elderly and at-risk citizens...\n \n(1/3)", "2020-07-02T19:39:06.000Z": "Wear a mask to save lives. #WearItSC", "2020-07-01T21:44:13.000Z": "Let me make it very clear. Wear a mask and social distance now so we can enjoy high school and college football in South Carolina this fall.", "2020-07-01T16:22:16.000Z": "#BREAKING : Gov. @henrymcmaster will be joined by state public health officials for a media briefing to update the state's response to #COVID19 today at 4:30 p.m. #SCETV & @SCPublicRadio will provide live coverage on air & online via our various social media platforms. #SCTweets", "2020-06-26T16:55:03.000Z": "BREAKING: Gov. @henrymcmaster will be joined by state public health officials for a media briefing re: the state's response to #COVID19 today at 4 p.m. #SCETV & @SCPublicRadio will provide live coverage on air & online via our various social media platforms. #sctweets GIF", "2020-06-23T22:40:04.000Z": "-all employees must wear masks\n-additional safety training\n-sanitation procedures between customers\n-and more, all of which can be read on http:// palmettopriority.com (2/2) Palmetto Priority Palmetto Priority is a formal commitment made by South Carolina restauranteurs to provide a clean and safe environment for their staff and customers to demonstrate real precautions that they are... palmettopriority.com", "2020-06-23T22:40:03.000Z": "Today we announced #PalmettoPriority , a restaurant safety initiative in collaboration with @SCPRT , @SCRLA , and @SCDHEC . \n\nIn order to display the #PalmettoPriority emblem restaurants must pledge to take strict safety measures including: (1/2)", "2020-06-22T21:24:08.000Z": "Proud to stand by Senator Tim Scott today with law enforcement leadership to support his JUSTICE Act, which will provide additional funding and accountability for our criminal justice system.", "2020-06-18T22:16:58.000Z": "Thank you, Mr. President! Quote Tweet Donald J. Trump @realDonaldTrump . @SCDOTPress will have $34.6M headed its way for a new interchange on I-77 in Rock Hill! This will facilitate access to a 234-acre development site at Exit 81. HUGE innovation and development coming to the area! @RockHillSCCity  @YorkCountySC  @YorkCountySCGov", "2020-06-17T19:19:48.000Z": "Senator Tim Scott has provided a great service to the country with his Justice Act. I am confident that the law enforcement officers in South Carolina, which are the finest in the United States,\n\n(1/2) Quote Tweet Tim Scott @SenatorTimScott The #JUSTICEAct works to restore the broken trust between communities and color and law enforcement through three essential pieces: reform, accountability, and transparency.\n\nThe time to act is now!\n\nWe hear you America, and the JUSTICE Act provides solutions!", "2020-06-17T12:34:31.000Z": "Five years ago, we lost nine beautiful souls at Mother Emanuel and our state was shaken by an unspeakable act of hatred and ignorance. But evil did not win the day. Love, compassion, strength, and faith - exemplified by the families of the Emanuel 9 - reigned supreme.", "2020-06-16T16:08:30.000Z": "We are always thrilled to see one of our existing businesses grow its presence in South Carolina. We celebrate Ross Stores, Inc.'s decision to expand and create 700 new jobs in our state. #SCjobs Quote Tweet SC Governor Press @scgovernorpress Ross Stores, Inc. Expanding Distribution Operations in York County | $68 Million Investment to Create 700 New Jobs https:// governor.sc.gov/news/2020-06/r oss-stores-inc-expanding-distribution-operations-york-county ", "2020-06-10T21:32:46.000Z": "We cannot stop our economy indefinitely. We slowed it in South Carolina enough to arm ourseleves with the information to keep us safe, and now we must practice what we have learned.", "2020-06-06T18:26:04.000Z": "The flags on the State House are at half-staff in honor of  First Lieutenant Trevarius Ravon Bowman who sadly lost his life while serving in Afghanistan. Quote Tweet SC Governor Press @scgovernorpress Governor Henry McMaster orders that the flags which are flown atop the State Capitol Building be lowered to half-staff from sunrise until sunset on Saturday, June 6, 2020, (1/2) Show this thread", "2020-06-05T20:41:46.000Z": "Thank you @SecretaryRoss for visiting South Carolina's beautiful Upstate today to meet with local business and civic leaders, and tour one of our innovative companies, Fibertex, that is expanding to produce PPE.", "2020-06-04T15:59:47.000Z": "Our annual hurricane preparedness coastal tour is a little different this year. We are meeting virtually with emergency managers in all of our coastal counties, and we will give a public media briefing at 4pm today, streamed live by @SCETV .", "2020-06-01T23:04:59.000Z": "Hurricane season doesn't take a break for a pandemic. Now is the time to prepare-get your 2020 South Carolina Hurricane Guide and review your plan for when the next hurricane hits us. Quote Tweet SCEMD @SCEMD It's here. #HurricaneSeason . Along with it comes the 20th annual edition of the official South Carolina Hurricane Guide. Updated for 2020, know what to do before, during and after a major hurricane. Get it now: https:// scemd.org/stay-informed/ publications/hurricane-guide/   #sctweets  #scwx  #HurricanePrep  #COVID19 Show this thread", "2020-05-31T14:38:05.000Z": "Governor Henry McMaster will hold a media briefing with law enforcement officials today, Sunday, May 31, at 1:00 PM.", "2020-05-31T01:22:46.000Z": "It was moving to see so many South Carolinians gather at the Statehouse today. They peacefully channeled their anger into song by asking for God's grace. Unfortunately, outside agitators have descended on our state to take advantage of this situation by inciting violence. Quote Tweet Miranda Parnell WIS @miranda_parnell Take in this moment. \n\nColumbia, SC. #GeorgeFloyd  @wis10", "2020-05-30T00:29:23.000Z": "South Carolinians are well within their rights to publicly and peacefully express anger over the inexcusable taking of George Floyd's life.  We should all be angry.  There is no excuse for this.", "2020-05-28T22:44:49.000Z": "We enjoyed reading all of the wonderful and kind birthday messages @henrymcmaster . Thank you SC!", "2020-05-28T20:31:26.000Z": "Thank you @realDonaldTrump ! South Carolina will continue to be a good steward of all federal assistance you provide throughout this pandemic, and we will be prudent in our efforts to manage our response, including use of National Guard assets, efficiently. Quote Tweet Donald J. Trump @realDonaldTrump The men and women of the National Guard have been doing a great job fighting the CoronaVirus. This week, I will extend their Title 32 orders through mid-August, so they can continue to help States succeed in their response and recovery efforts.", "2020-05-26T20:15:32.000Z": "I'm proud to sign this professional and occupational licensing reform bill to allow military spouses to do the jobs that we know they are qualified to do.", "2020-05-26T20:15:31.000Z": "S.C. is the most military-friendly state in the country because we're always looking for ways to enhance our support of members of the military and their families. If we can cut through red tape to help our military families achieve financial security, we will do it every time.", "2020-05-25T13:47:19.000Z": "This virus has taught us that we too often take things for granted. This Memorial Day, as we pause to remember the men and women who gave their lives for this country, we are filled with an extra measure of gratitude, and say a heartfelt \"Thank you\" to them for their sacrifices.", "2020-05-22T18:10:21.000Z": "Our state's faith leaders have done a great job safely providing spiritual guidance while following health officials guidance.", "2020-05-22T18:10:10.000Z": "South Carolina never restricted services at Churches, Synagogues or Houses of Worship. President @realdonaldtrump is right.  Prayer and worship is healthy and constitutionally protected, pandemic or not.", "2020-05-22T15:13:12.000Z": "We are grateful for our EMS workers every day, but especially during the COVID-19 crisis we have had a stark reminder of how vital they are to our communities. I'm proud to proclaim this week \"Emergency Medical Services Week,\" and encourage everyone to join me in thanking them.", "2020-05-20T20:21:26.000Z": "Gov. Henry McMaster Lifts Restrictions on Attractions Effective Friday, May 22 | Governor Also Lifts Restrictions on Youth and Adult Recreational Sports Effective May 30 https:// governor.sc.gov/news/2020-05/g ov-henry-mcmaster-lifts-restrictions-attractions-effective-friday-may-22 ", "2020-05-18T20:17:44.000Z": "...institutions of higher education - to be done quickly but carefully to get them back on their feet. Time is of the essence and deadlines are approaching. \n\n(2/2)", "2020-05-18T20:17:23.000Z": "The sole purpose of the CARES Act is the reimbursement of legitimate COVID-19 expenses incurred by state agencies, local governments, first responders, hospitals, school districts and... (1/) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Signs Continuing Resolution, Issues Signing Statement Urging Swift Action https:// governor.sc.gov/news/2020-05/g ov-henry-mcmaster-signs-continuing-resolution-issues-signing-statement-urging-swift ", "2020-05-14T17:30:23.000Z": "Thank you Lizard's Thicket for providing a safe, indoor dining experience. Happy to be back!", "2020-05-14T13:47:51.000Z": "From representation in Congress to receiving disaster relief funds, making sure every South Carolinian is counted is vital. Please take a moment to watch the new #CountMeIn video and then fill out the #2020Census if you haven't already. Quote Tweet Pamela Evette @PamelaEvette JUST LAUNCHED: #CountMeIn video promoting #2020Census completion featuring @dariusrucker ​, @ClemsonFB Coach Swinney, @TheEdwinMcCain , @dawnstaley , @SenatorTimScott ​, @LindseyGrahamSC ​ & many more! Thanks @TCAatUSC ​for making this video a reality. https:// youtu.be/-3JPO3eP_lo Show this thread", "2020-05-13T19:14:51.000Z": "I've signed the bill making it possible for anyone in SC to vote absentee for the June 9 primaries and their runoffs. Every eligible SC voter can request an absentee ballot to stay safe while exercising the precious right of voting. Absentee ballots can be requested via @scvotes .", "2020-05-12T21:58:22.000Z": "This is welcome news as we continue to support those who are recovering from the tornadoes that ripped through our state last month. #TeamSC Quote Tweet SCEMD @SCEMD At the request of Governor Henry McMaster, @fema has amended its disaster declaration for the April 13 severe storm to make residents in Barnwell and Berkeley counties eligible to apply for the Individual Assistance program. #scnews  #sctweets  http:// scemd.org/news/barnwell- berkeley-counties-now-eligible-to-apply-for-fema-aid/ ", "2020-05-11T20:50:51.000Z": "We have an opportunity to set an example for the rest of the world by reinvigorating our economy while staying safe, but we can only do that if South Carolinians continue to follow the advice and recommendations of our public health experts. (2/)", "2020-05-11T20:50:38.000Z": "With our increased capacity for testing the people of our state, it is time to responsibly and gradually get these small businesses back up and running. (1/) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Announces that Additional Businesses, Gyms, Pools are Able to Open Monday, May 18 https:// governor.sc.gov/news/2020-05/g ov-henry-mcmaster-announces-additional-businesses-gyms-pools-are-able-open-monday-may ", "2020-05-11T16:58:13.000Z": "South Carolina is like a big family, and @weareboeingsc is a great family member. Thank you for mobilizing an unprecedented three Dreamlifters at once to deliver critical PPE for @MUSChealth ! #TeamSC  #accelerateSC", "2020-05-11T16:09:51.000Z": "Thank you, @Benefitfocus ! We are proud of our South Carolina companies stepping up to answer the call. #TeamSC  #accelerateSC Quote Tweet Benefitfocus @Benefitfocus Announcing our new initiative 'For You SC' which offers an online selection of benefits options to SC residents impacted by the economic downturn with proceeds going to @CCCFtweets  https:// okt.to/bcjUna", "2020-05-08T20:29:58.000Z": "This virus still presents a serious threat to South Carolinians, but I have faith in the people of our state and their ability to act responsibly and in the best interest of the communities they live in. (2/)", "2020-05-08T20:29:00.000Z": "As we gradually and methodically lift restrictions aimed at combating the coronavirus, it is incumbent upon South Carolinians to follow to the guidance and recommendations provided by our public health experts to keep themselves and their loved ones safe. (1/) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster: Restaurants Are Able to Open for Limited Dine-in Services Monday, May 11 | Governor Also Lifts Boating Restrictions Statewide, Effective Immediately https:// governor.sc.gov/news/2020-05/g ov-henry-mcmaster-restaurants-are-able-open-limited-dine-services-monday-may-11 ", "2020-05-08T17:20:48.000Z": "Governor Henry McMaster will be joined by state public health officials for a media briefing today, Friday, May 8, at 4:00 PM. The press conference will be streamed live on @SCETV 's website, http:// scetv.org . South Carolina ETV SCETV is South Carolina's public broadcasting, storytelling, and education network. scetv.org", "2020-05-07T18:10:47.000Z": "The Response component of accelerateSC will hold a virtual meeting today at 3:00 p.m. and can be streamed live at https:// scetv.org/live/accelerat esc  . #TeamSc", "2020-05-06T16:59:07.000Z": "Governor Henry McMaster will be joined by state public health officials for a media briefing to update the public on the state's response to the 2019 Novel Coronavirus today, Wednesday, May 6, at 4:00 PM. @SCETV will stream it live on http:// scetv.org . South Carolina ETV SCETV is South Carolina's public broadcasting, storytelling, and education network. scetv.org", "2020-05-06T12:15:00.000Z": "Today is Public Servant Recognition Day, part of Public Servant Recognition Week in South Carolina. This year especially please take a moment to thank the public servants who have worked tirelessly through this pandemic to maintain vital services on which we rely. #TeamSC", "2020-05-05T21:24:57.000Z": "Thank you to #TeamSC for working quickly to develop http:// accelerate.sc.gov , a one-stop-shop for South Carolinians to get help and information related to #COVID19 . We will be continually updating it as the situation and our response to it evolve. Quote Tweet SCETV @SCETV #BREAKING : Governor @henrymcmaster today announced the launch of the initial phase of http:// accelerate.sc.gov . Designed to provide citizens centralized access to easily connect with #COVID19 related information. #accelerateSC  #SCTweets", "2020-05-02T21:35:27.000Z": "I have proclaimed tomorrow a statewide day of prayer in South Carolina-for those who have lost loved ones, for our frontline workers, and for all of us as we work to recover from this pandemic.", "2020-05-02T20:33:27.000Z": "This is welcome news for the communities affected by the tornadoes. Thank you @realDonaldTrump for the disaster declaration. Quote Tweet SCEMD @SCEMD Residents who suffered damage in seven counties due to severe storms on April 13, 2020 are now eligible to apply for FEMA disaster assistance. Visit http:// disasterassistance.gov and http:// scemd.org for details. #sctweets  #scwx  #Tornado", "2020-05-01T20:19:42.000Z": "South Carolinians, now more than ever, should be vigilant in protecting themselves, their loved ones, and their communities by practicing social distancing and continuing to follow the advice and recommendations from our public health experts. Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster to Lift \"Work-or-Home\" Order May 4th | Outdoor Dining Service for Restaurants to Start May 4th https:// governor.sc.gov/news/2020-05/g ov-henry-mcmaster-lift-work-or-home-order-may-4th ", "2020-05-01T14:03:28.000Z": "If you haven't already, please take the time to fill out the #2020Census questionnaire  to make sure every South Carolinian is counted. https:// my2020census.gov Quote Tweet Pamela Evette @PamelaEvette Did you know census data drives disaster relief funding, classroom technology, broadband & more? With @uscensusbureau workers unable to reach South Carolinians at home due to #COVID19 , #2020Census self-response has stalled & SC ranks 40th in the nation. https:// youtu.be/iFmgSSyqPqg Show this thread", "2020-04-30T19:42:48.000Z": "Team South Carolina stands ready to help NASCAR restart the season at Darlington Raceway with three races next month that can be enjoyed by fans from home on television, radio, and online. (2/2)", "2020-04-30T19:42:47.000Z": "As our nation restarts, I can think of no better place for NASCAR to drop the green flag than at Darlington Raceway in South Carolina. (1/2) Quote Tweet Darlington Raceway @TooToughToTame The Lady in Black hasn't seen a race in the Spring since 2014 - in 17 days, that's changing. \n\nSunday, May 17 / 3:30 pm ET / @NASCARONFOX INFO  http:// bit.ly/2KPUPAt", "2020-04-29T14:57:14.000Z": "Thank you! Quote Tweet BCBSSC @bcbssc BlueCross BlueShield of South Carolina and @BCBSSC Foundation together are committing nearly $1.6 million to the @SeniorRes_SC  #COVID19 Disaster Relief Fund. Donation will expand its emergency senior nutrition program and provide 245,000 meals for seniors: https:// bit.ly/2VNiZSL", "2020-04-27T14:56:53.000Z": "Governor Henry McMaster and Lt. Governor Pamela S. Evette will participate in the first meeting of the \"Governance\" component of AccelerateSC today at the University of South Carolina Alumni Center today at 2:00 PM. The event will be streamed live on accelerateSC About accelerateSC Organized April 20, 2020, accelerateSC serves as the coordinated COVID-19 advisory team to consider and recommend economic revitalization plans for South Carolina. scetv.org", "2020-04-27T00:02:40.000Z": "A million thanks to @Boeing , Discommon, Prisma Health, and everyone else who made today's delivery of 1,500,000 masks for our frontline workers possible-another stellar example of communication, cooperation, and collaboration in South Carolina.", "2020-04-23T23:01:25.000Z": "Today we held our first meeting of #accelerateSC , a superb group of healthcare professionals, business leaders, public officials, and educators that is working on the plan to get South Carolina back up and running at full speed as soon as it is safe to do so.", "2020-04-23T18:05:37.000Z": "Governor @henrymcmaster  #accelerateSC meeting [Do not Use] Accelerate SC Accelerate SC cdnapisec.kaltura.com", "2020-04-22T16:56:11.000Z": "Thank you to our great teachers who have worked hard to adapt in these trying times to continue to provide an education to our students. We are indescribably grateful for your commitment and passion.\n\n(2/)", "2020-04-22T16:56:10.000Z": "South Carolina's public K-12 will remain closed for the rest of this school year. \n\nI am asking all schools to make special accommodations to ensure that our graduating seniors are able to have a form of commencement ceremony or recognition.\n\n(1/) Quote Tweet SC Governor Press @scgovernorpress Video: Gov. Henry McMaster, Superintendent Molly Spearman: Public K-12 Schools to Remain Closed for Remainder of the Year https:// youtu.be/ks0MoeQqRjA", "2020-04-20T21:15:54.000Z": "I've restored public beach access, allowing locals to use their discretion. I've also allowed some retailers that were previously closed to open, but they must follow strict social distancing measures. \n\nPlease stay safe and follow all recommendations from public health experts. Quote Tweet SC Governor Press @scgovernorpress Executive Order 2020-28 Modification of Restrictions for Public Beaches & Waters & Incremental Modification of Non-Essential Business Closures https:// governor.sc.gov/sites/default/ files/Documents/Executive-Orders/2020-04-20%20eFILED%20Executive%20Order%20No.%202020-28%20-%20Modification%20of%20Restrictions%20for%20Public%20Beaches%20%26%20Waters%20%26%20Incremental%20Modification%20of%20Non-Essential%20Business%20Closures.pdf ", "2020-04-20T18:08:42.000Z": "This morning I joined governors of all 50 states on a COVID-19 video briefing with @WhiteHouse officials lead by the @VP . Thank you @realDonaldTrump and @Mike_Pence for your constant support. We are working together to beat this virus and reopen our economy safely.", "2020-04-20T16:41:48.000Z": "Governor Henry McMaster will be joined by state public health officials for a media briefing to update the public on the state's response to the 2019 Novel Coronavirus today, Monday, April 20 at 4:00 PM. @SCETV will stream live.", "2020-04-19T21:03:20.000Z": "The @NWS is warning that South Carolina should expect severe weather again this evening and into tomorrow morning. Please be sure to prepare now, have a plan, and be ready in case you get an emergency alert. Quote Tweet SCEMD @SCEMD More severe weather on the way. Have several ways to get emergency alerts & warnings. Some include: NOAA Weather Radio; Wireless Emergency Alerts; CodeRED notifications via phone call, text or email (register at http:// scemd.org ); local broadcast TV & radio. #sctweets", "2020-04-18T20:30:14.000Z": "Very productive call this afternoon with southeastern governors @GovKemp  @GovernorKayIvey  @TateReeves  @GovRonDeSantis  @GovBillLee We discussed each state's plans to safely get folks back into the workplace.  Told them South Carolina was ready. #accelerateSC", "2020-04-18T17:03:28.000Z": "Today we've lowered our flags in honor of Charleston County Sheriff's Deputy Jeremy C. LaDue who tragically lost his life in the line of duty this week. Please keep his family and community in your prayers. Quote Tweet SC Governor Press @scgovernorpress Executive Order 2020-27 -Lowering Flags for Deputy LaDue of Charleston County Sheriff's Office https:// governor.sc.gov/sites/default/ files/Documents/Executive-Orders/2020-04-17%20FILED%20Executive%20Order%20No.%202020-27%20-%20Lowering%20Flags%20for%20Deputy%20LaDue%20of%20Charleston%20Cty.%20Sheriff's%20Office.pdf ", "2020-04-16T16:48:27.000Z": "Governor Henry McMaster will be joined by state public health officials for a media briefing to update the public on the state's response to the 2019 Novel Coronavirus today, Thursday, April 16 at 4:30 PM. @SCETV will stream it live.", "2020-04-15T19:06:17.000Z": "Gov. Henry McMaster Declares State of Emergency for Monday's Severe Weather Event https:// governor.sc.gov/news/2020-04/g ov-henry-mcmaster-declares-state-emergency-mondays-severe-weather-event ", "2020-04-15T00:24:33.000Z": "The greatness of the devastation we witnessed in Hampton County was matched only by the spirit of resilience and resolve of the people we saw. SC is a big family, and we're going to take care of each other. The worst nature can throw at us will only bring out the best in us.", "2020-04-13T23:50:11.000Z": "They left in their wake utter destruction, but the one thing they could not destroy is the spirit of our people. We will rebuild after these storms just as we do after hurricanes and how we are battling the Coronavirus-together. (2/2)", "2020-04-13T23:50:10.000Z": "We saw more tragedy in the midst of what is already one of the most trying times our state has endured. We lost at least 9 precious lives across South Carolina last night to the tornadoes that swept through our state. (1/2)", "2020-04-12T14:13:19.000Z": "Easter Sunday gives us the opportunity to reflect on the sacrifice made for us and to celebrate the precious blessing that is life. Stay home, stay safe, and make sure your loved ones know what they mean to you.", "2020-04-11T20:46:48.000Z": "Today @SCEMD received a generous donation of 100,000 N95 masks from @Apple They will be distributed to South Carolina's health care professionals and first responders. Thank you and welcome to #TeamSC", "2020-04-08T22:14:05.000Z": "There appears to be no tactic or action too deceitful or reckless for the leaders of Santee Cooper to employ. This includes exploiting the pandemic to maintain the status quo with today's five-hour Senate filibuster.\n\n(1/2)", "2020-04-08T20:28:20.000Z": "Every day, our primary objective is to protect South Carolinians, but we also must act to protect the state's economy. This order does both. It allows our businesses to take care of their employees as best as they can & will help our economy recover from this unprecedented time. Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Orders that Furloughed Employees Qualify for Unemployment Benefits https:// governor.sc.gov/news/2020-04/g ov-henry-mcmaster-orders-furloughed-employees-qualify-unemployment-benefits ", "2020-04-06T21:56:24.000Z": "I have issued a Home or Work order. All South Carolinians must remain at home or work unless visiting family, exercising, or obtaining essential goods or services. \n\n(1/) Quote Tweet SC Governor Press @scgovernorpress Executive Order 2020-21 https:// governor.sc.gov/sites/default/ files/Documents/Executive-Orders/2020-04-06%20eFILED%20Executive%20Order%20No.%202020-21%20-%20Stay%20at%20Home%20or%20Work%20Order.pdf ", "2020-04-06T17:50:24.000Z": "Governor Henry McMaster will be joined by state public health officials for a media briefing to update the public on the state's response to the 2019 Novel Coronavirus today, Monday, April 6 at 4:00 PM. @SCETV will stream the event live.", "2020-04-03T22:00:32.000Z": "Jewelry Stores\nLuggage and Leather Goods Stores\nDepartment Stores\nFlorists\nSporting Goods Stores\nBook Stores\nCraft and Music Stores\n\n(2/)", "2020-04-03T22:00:31.000Z": "Unfortunately, due to reports of non-compliance we are expanding the list of non-essential business closures in South Carolina. \n\nNew closures include:\nFurniture Stores\nHome Furnishing Stores\nClothing\nShoe and Clothing Accessory Stores\n\n(1/)", "2020-04-03T16:39:14.000Z": "Governor Henry McMaster will be joined by state public health officials for a media briefing to update the public on the state's response to the 2019 Novel Coronavirus today, Friday, April 3 at 4:30 PM.", "2020-04-03T12:30:41.000Z": "Providing this non-identifying information violates no state or federal privacy laws and is in the public's interest.  It is my hope this disclosure will reinforce to South Carolinians the seriousness and dire necessity of staying home to prevent the spread of #covid19 (2/2)", "2020-04-03T12:30:36.000Z": "Starting today, I have directed @scdhec to publicly disclose the up-to-date numbers of confirmed #covid19 cases by local zip code.  In addition they will provide the estimated number of residents who are likely infected and untested within that same zip code.\n \n(1/2)", "2020-04-02T15:49:00.000Z": "Director Farr and her team recognized a need, acted quickly to address it, and South Carolinians are better off because of their work. (2/2)", "2020-04-02T15:48:23.000Z": "We recognize the toll that this virus is taking on South Carolinians, and we are committed to doing all that we can to support them during these challenging times.  (1/2) Quote Tweet SC Governor Press @scgovernorpress S.C. LLR Extends Renewal Deadlines During Health Emergency https:// governor.sc.gov/news/2020-04/s c-llr-extends-renewal-deadlines-during-health-emergency ", "2020-04-02T15:36:20.000Z": "Thank you @harveypeeler and @schousespeaker for making a very tough call. Your leadership will ensure that state government continues providing South Carolinians with essential services during and after this COVID-19 crisis. Quote Tweet The Post and Courier @postandcourier State lawmakers will reconvene next week to hold a brief session to extend current spending levels for state government. https:// bit.ly/2UCrZcx", "2020-03-31T21:51:17.000Z": "The Non-Essential Business listing and the Business Clarification Form can be found at https:// sccommerce.com/covid-19-non-e ssential-business-guidelines  . #TeamSC Quote Tweet Gov. Henry McMaster @henrymcmaster If a business has a question as to whether they qualify as essential, they should complete the Essential Business Clarification form located on the @SCcommerce website, which will be easily accessible on the South Carolina Department of Commerce's website. \n\n(2/) Show this thread", "2020-03-31T21:37:27.000Z": "If a business has a question as to whether they qualify as essential, they should complete the Essential Business Clarification form located on the @SCcommerce website, which will be easily accessible on the South Carolina Department of Commerce's website. \n\n(2/)", "2020-03-31T21:37:26.000Z": "I have ordered the closure of non-essential businesses, as defined by Executive Order 2020-17, throughout the state in order to combat the spread of the COVID-19 virus. https:// governor.sc.gov/news/2020-03/g ov-henry-mcmaster-orders-non-essential-businesses-closed-throughout-sc  (1/)", "2020-03-31T17:05:20.000Z": "Governor Henry McMaster will be joined by state public health officials for a media briefing to update the public on the state's response to the 2019 Novel Coronavirus today, Tuesday, March 31 at 4:00 PM. @SCETV will stream the briefing live.", "2020-03-30T22:24:31.000Z": "This is unfortunate for those who chose to responsibly follow the instructions of our public health officials, but a necessary action to prevent the spread of the COVID 19 virus. (2/)", "2020-03-30T22:24:13.000Z": "As a result of behavior observed this past weekend by the Department of Natural Resources and SLED, it has become necessary to close public access to our state's beaches, and close boat ramps and landings on our state's lakes, rivers and waterways. (1/) Quote Tweet SC Governor Press @scgovernorpress Executive Order 2020-16 Emergency Access Restrictions for Public Beaches & Waters Due to COVID-19 Pandemic https:// governor.sc.gov/sites/default/ files/Documents/Executive-Orders/2020-03-30%20eFILED%20Executive%20Order%20No.%202020-16%20-%20Emergency%20Access%20Restrictions%20for%20Public%20Beaches%20%26%20Waters%20Due%20to%20COVID-19%20Pandemic.pdf ", "2020-03-29T15:24:26.000Z": "These challenging times provide opportunity for reflection, and I ask that you take a moment to reflect on, and appreciate, the honorable service of our Vietnam War Veterans. (2/2)", "2020-03-29T15:24:04.000Z": "America is the greatest country in the world because of the strength and sacrifice of men and women like those that we honor on Vietnam War Veterans Day. They answered the call to serve when it was most difficult, and they served us well. (1/) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Declares Vietnam War Veterans Day in South Carolina https:// governor.sc.gov/news/2020-03/g ov-henry-mcmaster-declares-vietnam-war-veterans-day-south-carolina ", "2020-03-28T21:39:08.000Z": "Executive Order 2020-15 State of Emergency Due to COVID-19 Pandemic https:// governor.sc.gov/sites/default/ files/Documents/Executive-Orders/2020-03-28%20eFILED%20Executive%20Order%20No.%202020-15%20-%20State%20of%20Emergency%20Due%20to%20COVID-19%20Pandemic.pdf ", "2020-03-27T21:22:57.000Z": "I have ordered that all visitors coming to South Carolina from the COVID-19 hotspots of New York, Connecticut, New Jersey, or New Orleans must quarantine for 14 days. Quote Tweet SC Governor Press @scgovernorpress Executive Order 2020-14 Self-Quarantine for Individuals from High-Risk Areas https:// governor.sc.gov/sites/default/ files/Documents/Executive-Orders/2020-03-27%20eFILED%20Executive%20Order%20No.%202020-14%20-%20Self-Quarantine%20for%20Individuals%20from%20High-Risk%20Areas.pdf ", "2020-03-26T17:11:57.000Z": "In response to the challenges of COVID-19, our return and payment due dates have changed: July 15: Income Taxes originally due April 15 June 1: All other taxes administered by or filed with SCDOR originally due April 1 - June 1 Learn more at http:// dor.sc.gov/emergencies", "2020-03-27T17:14:07.000Z": "The #SCDMV recognizes the current state of everyday life has altered due to #COVID19 . If you have a driver's license, permit or vehicle registration about to expire between March 2020 and June 2020, it should be treated valid until July 1, 2020. Here's the guidelines.", "2020-03-27T16:38:49.000Z": "Governor Henry McMaster will be joined by Senator Lindsey Graham, Senator Tim Scott and state public health officials for a media briefing to update the public on the state's response to the 2019 Novel Coronavirus today, Friday, March 27 at 4:00 PM. @SCETV will stream it live.", "2020-03-26T18:15:32.000Z": "Governor Henry McMaster will be joined by state public health officials for a media briefing to update the public on the state's response to the 2019 Novel Coronavirus today, Thursday, March 26 at 4:30 PM. @SCETV will stream it live.", "2020-03-25T17:56:39.000Z": "Today I am requesting all out of state visitors to South Carolina planning a stay of two or more nights self quarantine for two weeks immediately upon arrival.", "2020-03-24T19:04:21.000Z": "\"At this time, students, parents, and families should plan for South Carolina's schools to remain closed through the month of April. Our dedicated teachers and school administrators have done a tremendous job in making it possible for our students to learn at home. (1/3) Quote Tweet SC Governor Press @scgovernorpress Joint Statement from Gov. Henry McMaster, S.C. Superintendent of Education Molly Spearman https:// governor.sc.gov/news/2020-03/j oint-statement-gov-henry-mcmaster-sc-superintendent-education-molly-spearman ", "2020-03-23T21:47:53.000Z": "It does not apply to private businesses nor to responsible South Carolinians continuing to make the best out of this situation. (4/)", "2020-03-23T21:47:52.000Z": "This weekend, we saw large crowds gathered on beaches, on sandbars, and in parking lots.  We are facing a dangerous and deadly enemy and this type of behavior is both irresponsible and selfish.  (1/)", "2020-03-23T17:39:14.000Z": "Governor Henry McMaster will be joined by state public health officials for a media briefing to update the public on the state's response to the 2019 Novel Coronavirus today, Monday, March 23 at 4:00 PM. @SCETV will carry it live on South Carolina ETV SCETV is South Carolina's public broadcasting, storytelling, and education network. scetv.org", "2020-03-21T19:32:20.000Z": "I have also directed @SCDOR to conform the state's income tax deadline to July 15th, which is the new federal income tax deadline. Other state taxes will remain delayed until June 1st, as previously ordered.\n \n(3/)", "2020-03-21T19:32:19.000Z": "I am asking that construction contractors & others in the skilled trade industry to donate whatever personal protective equipment they can spare to healthcare professionals and state agencies in the greatest need, including respirator masks commonly used in construction.\n\n(1/)", "2020-03-21T16:25:26.000Z": "At this time, ordering South Carolinians to shelter in place is not under consideration. If we all work together, act responsibly, and take necessary precautions, lives can be saved now. Quote Tweet Gov. Henry McMaster @henrymcmaster I'd like to remind all South Carolinians that we should listen to official sources of information like @scdhec , @CDCgov , and reputable media sites. \n\nHearsay and rumors create confusion and anxiety, and can be dangerous. This will help us win this fight against this COVID-19.", "2020-03-20T23:40:59.000Z": "The time is now for everyone to take this situation seriously and to follow the instructions of national and state officials. Voluntary action and precaution NOW will save the lives of many. http:// scdhec.gov (2/2)", "2020-03-20T23:40:58.000Z": "Tonight, two more South Carolinians have succumbed to COVID-19.  Please join me in praying for their families and for their communities for their losses.  (1/2)", "2020-03-20T22:17:04.000Z": "I'd like to remind all South Carolinians that we should listen to official sources of information like @scdhec , @CDCgov , and reputable media sites. \n\nHearsay and rumors create confusion and anxiety, and can be dangerous. This will help us win this fight against this COVID-19.", "2020-03-20T18:16:24.000Z": "A state of emergency exists in South Carolina to prevent the spread of the deadly COVID-19 virus.  To save lives, I have directed SLED and local law enforcement to disperse crowds gathered on our state's beaches. \n\n(1/)", "2020-03-20T13:23:43.000Z": "SBA Approves Gov. Henry McMaster's Request for Disaster Assistance https:// governor.sc.gov/news/2020-03/s ba-approves-gov-henry-mcmasters-request-disaster-assistance ", "2020-03-19T22:43:02.000Z": "-Waived Department of Employment and Workforce regulations to allow unemployment claims to be expedited by at least one week\n\n-Unemployment insurance payments are suspended for employers until June 1st, allowing business owners to have additional capital on hand \n\n(3/)", "2020-03-19T22:43:01.000Z": "I have taken additional actions in my latest executive order in our efforts to fight COVID-19: https:// bit.ly/2UlrZfF (1/)", "2020-03-19T21:05:16.000Z": "Executive Order No. 2020-11 - Additional Emergency Measures & Regulatory Relief Regarding COVID-19 https:// governor.sc.gov/sites/default/ files/Documents/Executive-Orders/2020-03-19%20FILED%20Executive%20Order%20No.%202020-11%20-%20Additional%20Emergency%20Measures%20%26%20Regulatory%20Relief%20re%20COVID-19.pdf ", "2020-03-19T18:42:28.000Z": "I applaud the General Assembly for moving swiftly to pass emergency funding to @scdhec for COVID-19 response efforts. I signed it immediately.", "2020-03-19T17:13:07.000Z": "Governor Henry McMaster will be joined by state public health officials for a media briefing to update the public on the state's response to the 2019 Novel Coronavirus today, Thursday, March 19 at 4:30 PM. @SCETV will carry the briefing live.", "2020-03-19T14:21:20.000Z": "Thank you to the many local restaurants that are keeping our communities fed and their workers employed through this crisis, and to the neighbors who support them. I picked up my @LizardsThicket to-go this morning to begin another day of working with #TeamSC .", "2020-03-18T01:23:52.000Z": "A copy of my executive order can be read here: https:// bit.ly/2x6OZXO (4/)", "2020-03-17T23:52:49.000Z": "- @scdhec will waive regulations so hospitals may use medical and nursing school students to help with COVID-19  response needs\n\n(3/)", "2020-03-17T23:52:48.000Z": "I have directed that:\n\n-State agencies waive any regulation they need to address the coronavirus crisis\n\n-ALL state taxes are delayed until June 1st\n\n-Restaurants and bars must close their dine-in service starting tomorrow https:// youtu.be/xxw_g_b-gcU (1/) Gov McMaster Gives COVID 19 Update March 17 youtube.com", "2020-03-17T19:10:18.000Z": "Governor Henry McMaster will be joined by state public health officials for a media briefing to update the public on the state's response to the 2019 Novel Coronavirus today, Tuesday, March 17 at 4:00 PM. @SCETV will stream the event.", "2020-03-16T22:02:21.000Z": "As neighbors continue to help neighbors in South Carolina in response to COVID-19 please remember our food banks. @HarvestHopeFB , @LCFoodBank , @ghfbEndHunger , & @SecondHarvestFB provide  services across our state and have critical needs listed on their websites.", "2020-03-16T17:29:11.000Z": "Grab-n-Go Meal Sites are up and running across South Carolina in response to #COVID19 school closures. We have developed a map that is rapidly being updated as new sites are added. Visit http:// ed.sc.gov/covid19 This Tweet is unavailable.", "null": "", "2020-03-16T15:41:52.000Z": "We are saddened by the news of the first death in South Carolina due to COVID-19. Our hearts and prayers are with the family and the community.  (1/2)", "2020-03-16T00:02:42.000Z": "Hey #Gamecocks , @dawnstaley has some #COVID19 prevention tips for you. \n\nBe smart & take precautions.", "2020-03-15T21:43:53.000Z": "We understand that school closings are inconvenient for working parents, for families, and for employers. But the decisions we have made are made to save lives. (3/)", "2020-03-15T21:43:52.000Z": "I have directed that all schools in South Carolina, including K-12 and universities, colleges, and technical colleges be closed for students and non-essential personnel through the end of this month. https:// bit.ly/39Uz0eb (1/)", "2020-03-15T15:15:13.000Z": "Governor Henry McMaster will be joined by state public health officials for a media briefing to update the public on the state's response to the 2019 Novel Coronavirus today, Sunday, March 15 at 4:00 PM.", "2020-03-14T22:00:17.000Z": "I have requested that all utilities in South Carolina not suspend or disconnect any essential services for nonpayment for the duration of the current State of Emergency. https:// governor.sc.gov/sites/default/ files/Documents/newsroom/2020-03-14%20Gov.%20McMaster%20to%20ORS%20Dir.%20Edwards%20re%20Utility%20Suspension.pdf ", "2020-03-14T21:18:44.000Z": "Today I have granted state agency leaders maximum flexibility to protect their older \"at risk\" employees by allowing work from home. Additionally all non-essential work related travel by state employees is now prohibited. https:// governor.sc.gov/sites/default/ files/Documents/Executive-Orders/Telework%20Memo.pdf ", "2020-03-14T19:07:45.000Z": "South Carolina Medical and Nursing Boards to Issue Emergency Licenses https:// governor.sc.gov/news/2020-03/s outh-carolina-medical-and-nursing-boards-issue-emergency-licenses ", "2020-03-13T20:51:52.000Z": "-All state government offices shall remain open for operation during their normal business hours -Visitation at state and local correctional facilities in all 46 counties shall be suspended immediately\n\n(2/3)", "2020-03-13T20:51:51.000Z": "I have declared a state of emergency in South Carolina in response to COVID-19. \n-Schools in Lancaster and Kershaw Counties shall be closed for a period of 14 days https:// governor.sc.gov/sites/default/ files/Documents/Executive-Orders/2020-03-13%20FINAL%20Executive%20Order%20No.%202020-08%20-%20State%20of%20Emergency%20Due%20to%20Coronavirus.pdf  (1/3)", "2020-03-13T18:31:00.000Z": "Gov. Henry McMaster to Declare State of Emergency, Order Lancaster, Kershaw County Schools to Close |  Governor to Hold Media Availability with Public Health Officials at 5:00 PM https:// governor.sc.gov/news/2020-03/g ov-henry-mcmaster-declare-state-emergency-order-lancaster-kershaw-county-schools ", "2020-03-12T18:55:57.000Z": "I have requested that the General Assembly pass a joint resolution making $45 million from the 2019-20 Contingency Reserve Fund immediately available to @scdhec for its coordination of the state's public health response to the COVID-19 virus. http:// governor.sc.gov/news/2020-03/g ov-henry-mcmaster-requests-surplus-funds-be-made-immediately-available-scdhec-covid ", "2020-03-10T14:26:17.000Z": "This morning legislative leadership received a coronavirus briefing at @SCEMD from @scdhec , the SC Department on Aging, and other state agencies.", "2020-03-08T21:12:11.000Z": "Or from your home, you can consult with a doctor for free with MUSC's online web site at: http:// MUSC.care . South Carolinians should continue to follow recommendations and information provided by official sources. (3/3)", "2020-03-08T21:10:33.000Z": "It's important to remember that each individual is responsible for their own actions and personal hygiene. If you feel sick, stay home and contact your doctor. (2/)", "2020-03-08T21:09:42.000Z": "Healthcare authorities in South Carolina are following established protocols and procedures in addressing the 2019 Novel Coronavirus. There is no cause for public alarm or speculation. (1/) Quote Tweet SC Governor Press @scgovernorpress Statement from Gov. Henry McMaster on Additional Possible Cases of the 2019 Novel Coronavirus in South Carolina https:// governor.sc.gov/news/2020-03/s tatement-gov-henry-mcmaster-additional-possible-cases-2019-novel-coronavirus-south ", "2020-03-07T18:12:26.000Z": "MUSC Health is providing FREE telehealth coronavirus screening to ALL South Carolinians. If you are experiencing symptoms you can visit http:// MUSC.care and be screened without having to leave your home. Quote Tweet MUSC Health @MUSChealth If you experience symptoms of Coronavirus, COVID-19. MUSC Health encourages you to do a free virtual visit.\n\nJust enter promo code COVID19. https:// campaigns.muschealth.org/virtual-care/i ndex.html ", "2020-03-07T17:21:11.000Z": "Video: Gov. Henry McMaster, State Public Health Officials Hold Briefing on 2019 Novel Coronavirus in South Carolina Governor McMaster 2019 Novel Coronavirus in South Carolina youtube.com", "2020-03-07T00:23:45.000Z": "Healthcare authorities in S.C. have been preparing for this eventuality and there is no reason for public alarm. DHEC is working with the CDC on confirmation for these cases. South Carolinians should continue to follow recommendations and information provided by official sources. Quote Tweet The Post and Courier @postandcourier BREAKING: The first presumptive cases of coronavirus have been reported in South Carolina.\n\nOne case is located in Charleston County. http:// bit.ly/2v1HvVB Show this thread", "2020-03-06T21:55:40.000Z": "South Carolina's Congressional delegation received an update on the coronavirus from @SCDHEC this afternoon at @SCEMD . #TeamSC is prepared. (1/2)", "2020-03-05T20:48:41.000Z": "Thank you Senate. Today, South Carolina is one step closer to meaningful education reform.  Administrators and school board members will be held accountable for performance and results.  (1/2)", "2020-03-05T20:12:18.000Z": "Happy to welcome the State House Doctors of the Day to the office to recognize #ColonCancerAwarenessMonth .", "2020-03-04T20:33:46.000Z": "It will help state government address agency workforce shortages.  Employees can focus on their new children instead of worrying about them from the workplace.  And valuable trained employees will be more likely to return to the workforce afterward.  (2/3)", "2020-03-04T20:33:45.000Z": "In South Carolina we believe in family friendly public policy. Providing state employees with 12 weeks of paid leave following the birth or adoption of a child helps keep families healthy and strong. (1/3)", "2020-03-03T21:16:27.000Z": "When she's not winning championships, @dawnstaley is making a difference in children's lives through @innersoleorg . Her work will be recognized tonight when she receives the @MultiplyingGood Jefferson Award for Outstanding Public Service. Congratulations, Coach Staley!", "2020-03-02T21:16:17.000Z": "This morning we convened #TeamSC to discuss our preparedness for Coronavirus. There have been zero confirmed cases in South Carolina, but @scdhec has been monitoring the situation and has information on what each of us can do to best protect ourselves and others.", "2020-02-28T19:49:01.000Z": "Here's another good reminder of why South Carolina is #TrumpCountry .", "2020-02-28T12:40:44.000Z": "I had a good time chatting with South Carolina native @ainsleyearhardt on Fox & Friends this morning about how excited we are to welcome @realDonaldTrump back to our state. Governor Henry McMaster (R-SC) on the President's rally tonight in... \"We've never seen anything like the enthusiasm and actual love people have for Donald Trump.\" Governor Henry McMaster (R-SC) on the President's rally... facebook.com", "2020-02-27T15:36:57.000Z": "Excellent choice by @realDonaldTrump to nominate @petermccoyforsc for U.S. Attorney. Peter is a man of character, respected by his colleagues and community, who will make South Carolina proud. President Donald J. Trump Announces Judicial Nominees, a United States Attorney Nominee, and a... Today, President Donald J. Trump announced his intent to nominate: J. Philip Calabrese of Ohio, to serve as Judge on the United States District Court for t whitehouse.gov", "2020-02-26T17:51:16.000Z": "Thank you to @schousespeaker and the S.C.  House of Representatives for unanimously passing business license reform. Streamlining the process across the state is key to maintaining South Carolina's superior business-friendly climate. #SCWinning  #SCjobs", "2020-02-26T02:25:01.000Z": "South Carolina is winning! Three years - 30,000 new jobs, over $10 billion in new capital investment.   Bi-partisan collaboration on teacher pay,  unleashing free market in early childhood education, rural infrastructure, taxpayer relief & supporting law enforcement.", "2020-02-25T21:04:31.000Z": "Our hearts are saddened once again by senseless violence that has taken the life of one of our law enforcement officers. Please keep the Sumter County Sheriff's Office and the whole Sumter community in your prayers today as we mourn the loss of Cpl. Andrew Gillette.", "2020-02-21T14:11:40.000Z": "Thrilled to welcome @realDonaldTrump back to South Carolina. Looking forward to seeing you, Mr. President! Quote Tweet SC Republican Party @SCGOP President Trump is coming to South Carolina. Make sure you sign up below to come rally with President Trump in Charleston.  https:// donaldjtrump.com/events/north-c harleston-sc-feb-28-2020?fbclid=IwAR0sVjep2ue-m70kZqoVqaEGH0Eup9umYuifipq4tW3jBSQsncNCs9oEvfo ", "2020-02-20T19:55:20.000Z": "...unleashes the free market in early childhood education, freezes college tuition, puts more troopers on the road and makes our prisons safer. #SCWinning (2/2)", "2020-02-20T19:55:03.000Z": "Thank you @schousespeaker , Chairman @murrellsmith and House Ways & Means committee for a budget that returns money to taxpayers, ranks SC in TOP 25 for teacher pay... (1/2)", "2020-02-19T22:03:18.000Z": "The House has passed a comprehensive education reform bill, and the Senate is currently debating their version.  I ask that these two versions be reconciled and sent to my desk as soon as possible so I can sign it into law, and we can get to work. (2/2)", "2020-02-19T22:03:17.000Z": "The way we fund education is confusing, not working, and is no longer sustainable. Education reform means accountability, efficiency, and transparency for local school boards and administrators. We must have a new path forward. (1/2)", "2020-02-18T21:07:45.000Z": "In an economy where we have jobs looking for people, there's no reason anyone who CAN work not to be working. That's why we're requiring able-bodied individuals who are not primary caregivers to complete 80 hours per month of work, education, or volunteering to receive Medicaid.", "2020-02-18T16:42:51.000Z": "I spoke with Governor Reeves this morning and assured him that South Carolina is ready and willing to help. We know first-hand the devastating effects that flooding can have, and our thoughts and prayers are with them during this time. Quote Tweet Tate Reeves @tatereeves It's been a long weekend for MS as floodwaters continued to rise. A weekend that would've felt much longer if not for the hard work of @MSEMA , all state agencies involved, and our state and local law enforcement. With an expected crest of 36.8 ft, a much needed end is in sight.", "2020-02-14T15:48:43.000Z": "For the third year in a row I'm asking that the General Assembly honor the men in women who serve in uniform-first responders, law enforcement, and military veterans-by ELIMINATING taxes on their retirement pay. We have no excuses not to do it.", "2020-02-13T17:51:33.000Z": "Welcome to South Carolina, @VP ! Quote Tweet Mike Pence @Mike_Pence Just landed here in the Palmetto State with @RepJoeWilson and Governor @henrymcmaster ! It was a pleasure meeting so many Americans benefitting from our America FIRST Agenda!", "2020-02-12T22:02:20.000Z": "Animal cruelty is a scourge that we want to eliminate from South Carolina. I was proud to join the @HumaneSociety to recognize one of our own,  Lance Corporal Misty Gore of the Horry County PD, as the recipient of the 2019 Humane Law Enforcement Award.", "2020-02-12T15:46:44.000Z": "As we look forward to the next decade, we will continue to work hard to ensure that the Palmetto State remains the best place to do business.  (2/2)", "2020-02-12T15:46:13.000Z": "South Carolina's economy is booming, and  the news of yet another record-setting year for exports is further confirmation that our global reputation for excellence is hard-earned and well-deserved. (1/2) Quote Tweet SC Dept. of Commerce @SCcommerce For the 10th consecutive year, South Carolina achieved record export sales, totaling $41.5 billion in 2019! #TeamSC  #SCJustRightForBusiness  http:// bit.ly/377s2A6", "2020-02-11T22:08:44.000Z": "Major General Grimsley has demonstrated commitment, excellence, determination, and success, and I am honored that he has accepted the call to serve as South Carolina's first Secretary of Veterans' Affairs for the great people of South Carolina. https:// governor.sc.gov/news/2020-02/g ov-henry-mcmaster-announces-major-general-ret-william-f-grimsley-south-carolinas ", "2020-02-10T20:40:15.000Z": "I ask that the General Assembly join me in providing every lower-income, four-year-old child in South Carolina the opportunity to attend full-day kindergarten at the public, private, parochial, or religious institution of their parents' choosing.", "2020-02-07T20:38:53.000Z": "Planning to visit the State House in the next week? Please consider bringing an item to put in one of the @HarvestHopeFB collection boxes on the first floor.\n\nTop needs:\nCanned vegetables & meats\nDiapers\nToiletries\nPaper/plastic Bags\nPeanut Butter\nDetergent\nDry Goods\nBeans", "2020-02-07T20:05:31.000Z": "The path to prosperity goes straight through the classroom. This year our continued investment in education must be the most significant ever.", "2020-02-06T16:03:33.000Z": "Stay alert and stay safe. Please follow @SCEMD and your local officials for the latest updates. Quote Tweet SCEMD @SCEMD Pay attention to changing weather forecasts throughout the day. Rain, strong winds, localized flooding, even isolated tornadoes are possible throughout much of the state. Know what to do if forecasters issue a weather warning for your area: https:// scemd.org/prepare/types- of-disasters/thunderstorms/   #scwx  #sctweets", "2020-02-05T22:08:03.000Z": "This year we have a $1.8 billion surplus. If we don't cut taxes and send money back to the people then shame on us.", "2020-02-05T03:29:49.000Z": "Tonight the world knows that America is winning again!  And South Carolina is winning!  Thanks to President @realDonaldTrump our nation is stronger, our people's resolve is unmatched and our enemies are destined for failure. #FourMoreYears", "2020-02-04T21:42:11.000Z": "We are roaring into the twenties with a vibrant economy and a growing population.  Since I've taken office, we have announced an unprecedented $10 billion in new capital investment and almost 35,000 jobs. #SCWinning", "2020-01-30T15:38:42.000Z": "Director Farmer is an embodiment of public service who makes South Carolina proud every day. Quote Tweet SC Dept of Insurance @scdoi Tuesday, Governor @henrymcmaster hosted a reception honoring SCDOI Director Ray Farmer on his recent election as President of the @naic . Director Farmer was joined by his family, NAIC CEO @mikeconsedine , past & present co-workers, peers, friends & industry leaders. #SCtweets", "2020-01-29T21:29:30.000Z": "We've had an education-centric day at the State House today, meeting with visitors from Youth Corps, @UofSC student body governments, and @SCforEd .", "2020-01-28T17:46:29.000Z": "As we commemorate the 75th anniversary of the liberation of Auschwitz, it is incumbent upon us to ensure that the events of the Holocaust not become distant nor the stories of the people who suffered its horrors be forgotten.", "2020-01-27T22:19:07.000Z": "Today we announced the 2020 class of South Carolina's Chef Ambassadors. They'll proudly represent the culinary diversity and homegrown care of the Palmetto State for the next year. Read more about each chef here: https:// governor.sc.gov/sites/default/ files/Documents/newsroom/2020%20Chef%20Ambassadors.pdf ", "2020-01-24T21:29:00.000Z": "Last year we took a dramatic step by freezing college tuition for in-state students. I urge the General Assembly to do it again this year by providing a 5% funding increase for each institution that does not raise tuition.", "2020-01-24T17:26:00.000Z": "I ask that we invest at least $100 million dollars toward making our prisons safer and more secure, both inside and outside the fence, by replacing and repairing existing infrastructure, facilities and control systems. https:// governor.sc.gov/sites/default/ files/Documents/Executive-Budget/FY21%20Executive%20Budget.pdf ", "2020-01-24T14:25:00.000Z": "Last year we took bold steps in education reform to empower the next generation's workforce.  We invested in our classroom teachers, in rural schools, in keeping our children safe and secure.  \n\nThis year our continued investment must be the most significant ever.", "2020-01-24T12:24:00.000Z": "I ask that we dedicate at least $60 million in new dollars to law enforcement, public safety and first response agencies for recruitment and retention. https:// governor.sc.gov/sites/default/ files/Documents/Executive-Budget/FY21%20Executive%20Budget.pdf ", "2020-01-23T23:21:00.000Z": "More people are working in South Carolina than ever before, unemployment is at a record low, and personal income growth is the highest ever.  We are consistently rated as one of the best places in the country to live, work and raise a family.", "2020-01-23T21:00:21.000Z": "Shame on us if we spend all of the $1.8 billion surplus and don't send any money back to the taxpayers. My executive budget calls for returning a quarter of every dollar through tax cuts and rebates. https:// governor.sc.gov/sites/default/ files/Documents/Executive-Budget/FY21%20Executive%20Budget.pdf ", "2020-01-23T16:50:27.000Z": "This year, let us roar into the twenties with renewed purpose.  Let us be bold.  Let us act on behalf of the sons and daughters of South Carolina, so that they may receive a state as bright with promise as that which we were blessed to inherit.", "2020-01-23T01:56:49.000Z": "During the State of the State tonight I was proud to recognize people from across the state who work every day to make South Carolina a better place-business leaders, law enforcement, military, and educators.  Thank you for all you do.", "2020-01-22T23:15:24.000Z": "Thanks for dropping by, sorry I couldn't chat longer. Big night tonight. Quote Tweet Scott Walker @ScottWalker Happy to see my friend Gov @henrymcmaster before his State of the State address with @GovMikeHuckabee", "2020-01-22T21:41:57.000Z": "Since I took office in 2017 South Carolina has announced 35,000 jobs and $10 billion in new capital investment. We accomplished this with a concerted effort to implement business-friendly policies, and my executive budget aims to continue this progress. https:// governor.sc.gov/sites/default/ files/Documents/Executive-Budget/FY21%20Executive%20Budget.pdf ", "2020-01-21T22:09:00.000Z": "South Carolina's economy and population are growing because we have worked hard to make our state the best place to live, work, and raise a family. My executive budget aims to continue this by funding our priorities and returning money to the taxpayers. https:// governor.sc.gov/sites/default/ files/Documents/Executive-Budget/FY21%20Executive%20Budget.pdf ", "2020-01-21T19:32:59.000Z": "South Carolina is a proudly pro-life state, and any pro-life legislation that makes it to my desk will be signed immediately.", "2020-01-20T15:47:52.000Z": "Let Dr. King's words serve as a reminder to us that all of us have the ability to serve one another, and that no act of service is insignificant. Let us renew our commitment to #ServeSC and continue to make our state the best place to live for all.", "2020-01-19T15:47:42.000Z": "Full Day 4k with CHOICE- private, parochial and church schools join public schools and private day care centers- to give parents free market choices.", "2020-01-16T18:00:10.000Z": "With our economy booming, South Carolina has a $1.8 billion surplus. My executive budget shows that we can fund all of our priorities AND return nearly a quarter of every surplus dollar to the taxpayers in the form of lower rates and rebate checks. https:// governor.sc.gov/news/2020-01/g ov-henry-mcmaster-unveils-fiscal-year-2020-21-executive-budget ", "2020-01-16T00:43:36.000Z": "#MadeInSC Quote Tweet BMWUSA GovAffairs @BMWUSgovaffairs During its 25th year of production, BMW Plant Spartanburg set a new record with 411,620 X models produced in 2019. This confirms the #SC plant will remain the largest plant by volume in the BMW Group's global production network: http:// bit.ly/36WTpOe  #SCJustRight  #BMWintheUS", "2020-01-15T17:44:56.000Z": "I applaud the House for passing the Heartbeat Bill and urge the Senate to do so as well. As soon as the bill reaches my desk I will sign it. Quote Tweet SC Governor Press @scgovernorpress Video: Gov. Henry McMaster, legislators, and pro-life leaders speak in support of the Heartbeat Bill https:// youtu.be/upRcNrzOeuM", "2020-01-15T17:40:35.000Z": "I applaud @realDonaldTrump 's hard work to finalize the #USChinaTradeDeal . This deal is a win for South Carolina, and all of America. It will be another shot in the arm for the US economy, American manufacturers, service providers, farmers, and more. #SCwinning  #USAwinning", "2020-01-15T14:07:44.000Z": "We can never thank our veterans enough. My executive budget calls for eliminating taxes on military retirement pay. https:// governor.sc.gov/news/2020-01/g ov-henry-mcmaster-unveils-fiscal-year-2020-21-executive-budget ", "2020-01-14T16:20:54.000Z": "My executive budget calls for beginning a reduction of our personal income tax over the next five years to keep us competitive with neighboring states that are lowering theirs, and allowing taxpayers to keep $2.5 billion of their own money.", "2020-01-13T21:21:02.000Z": "My executive budget calls for tax cuts and rebates totaling $425 million, returning about a quarter of every surplus dollar back to the taxpayers. Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Unveils Fiscal Year 2020-21 Executive Budget https:// governor.sc.gov/news/2020-01/g ov-henry-mcmaster-unveils-fiscal-year-2020-21-executive-budget ", "2020-01-12T17:26:17.000Z": "I have spoken with Principal Branham, Superintendent Robbins, and Senator Sheheen to offer assistance. It's a blessing that no one was on the North Central High campus last night. We can replace buildings and buses but not lives. Quote Tweet WIS News 10 @wis10 BREAKING: Kershaw County high school hit hard by severe weather, see pictures of damage >> http:// bit.ly/3a5k3WS The NWS will survey the damage to see if this was caused by a tornado.", "2020-01-11T03:06:05.000Z": "I was proud to stand in front of a packed room at the Proudly Pro-Life Dinner to say \"If the General Assembly sends the heartbeat bill to my desk I will sign it in seconds.\"", "2020-01-09T23:15:00.000Z": "It's time to modernize #NEPA to ensure that unnecessary red tape doesn't hold us back from prosperity. Quote Tweet The White House @WhiteHouse \"The United States will not be able to compete and prosper in the 21st century if we continue to allow a broken and outdated bureaucratic system to hold us back.\"", "2020-01-09T19:02:52.000Z": "Telemedicine brings your doctor as close as your phone. Today we announced a new tool, the @MUSChealth Virtual Urgent Care web app, that is available for FREE to over half a million state employees and family members. It's available immediately at http:// musc.care", "2020-01-09T11:45:00.000Z": "As the sun rises today it shines on flags at half-staff in remembrance of Officer Jackson R. Winkeler. Please take a moment to keep Officer Winkeler's family, friends, coworkers, and the community of Florence in your prayers at this sad time. Quote Tweet SC Governor Press @scgovernorpress Governor Henry McMaster orders that the flags on all state buildings be lowered to half-staff from sunrise until sunset on Thursday, January 9, 2020,\nin tribute to Officer Jackson R. Winkeler (1/2) Show this thread", "2020-01-08T03:38:40.000Z": "Tonight #TeamSC is leaning forward.  I have directed state government IT leaders to redouble efforts to aggressively search out, identify and repel any potential cyber attacks or malicious technological intrusions into our state agencies. Quote Tweet ABC13 Houston @abc13houston Governor Greg Abbott said there have been up to 10,000 attempted attacks per minute by Iran over a span of 48 hours and is urging Texans to be vigilant. https:// abc13.co/2N4bLVC", "2020-01-07T14:38:44.000Z": "South Carolina Governor @henrymcmaster is leading on early childhood education: \n\n\"We must get these children in those classrooms at 4-years-old so they can be part of the American dream. There's no place more obvious than South Carolina.\" https:// wrdw.com/content/news/S C-governor-to-unveil-plan-to-expand-4K-in-state-566756561.html   #scgov SC governor to unveil plan to expand 4K in state Some widespread changes could be coming to early childhood education all thanks to a plan set to be introduced by Gov. Henry McMaster next week. wrdw.com", "2020-01-07T02:54:58.000Z": "My full-day 4K plan will unleash the free market on education, and unleash the talents and abilities of the young people who are the future of our state. Quote Tweet WIS News 10 @wis10 Governor Henry McMaster (R-South Carolina) said, \"This will allow those young people at those precious ages to move on up in education and to unleash their talents.\" https:// wistv.com/2020/01/07/sc- governor-set-propose-plan-expand-full-day-pre-kindergarten-statewide/ ", "2020-01-05T18:30:20.000Z": "Parents can choose the education provider that best suits their 4 yr old child's needs. \n\nPublic schools, day care centers, private & parochial schools will all be eligible to participate.  \n\nMy plan cuts burdensome regulations to unleash a new vibrant Pre-K free market in SC. Quote Tweet The Post and Courier @postandcourier Gov. @henrymcmaster wants to expand state-funded, full-day pre-kindergarten to every South Carolina school district. http:// bit.ly/2SR1qju", "2020-01-04T21:50:10.000Z": "The time to be bold is now. \n\nIf we don't step up & act - our state will fall behind economically- businesses will go to states who have better prepared their workforce. \n\nPrivate, parochial & church schools will provide new opportunities & choices for SC parents. #SCWinning Quote Tweet The Post and Courier @postandcourier Gov. @henrymcmaster wants to expand state-funded, full-day pre-kindergarten to every South Carolina school district. http:// bit.ly/2SR1qju", "2019-12-25T14:12:15.000Z": "Merry Christmas, y'all.", "2019-12-22T18:12:27.000Z": "South Carolina drivers - heavy rainfall in the next 24 hours may create very hazardous driving conditions.  Before you drive, check conditions at http:// 511sc.org Everyone should enjoy a Merry Christmas in the Palmetto State! Quote Tweet SCDOT @SCDOTPress SCDOT is urging motorists all across South Carolina to use extreme caution as heavy rain is predicted for Sunday and Monday. Flooding and downed trees could occur. \nMotorists should not attempt to drive through standing water. Please \"Turn around, don't drown!\"", "2019-12-19T19:13:42.000Z": "Mr. Cohn's experience and success in business and his dedication to public service will provide SCETV with the kind of leadership needed to continue providing quality educational television and radio programming to future generations of South Carolinians. Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Appoints New Chairman of SCETV Commission |\nColumbia Businessman Richard Cohn, Sr. to Serve as Chairman https:// governor.sc.gov/news/2019-12/g ov-henry-mcmaster-appoints-new-chairman-scetv-commission ", "2019-12-19T14:07:07.000Z": "Today is a very important vote in the U.S. House of Representatives.   We urge Congress to do the right thing to ensure freer and fairer international trade and pass #USMCAnow !", "2019-12-13T13:00:00.000Z": "Thank you for visiting South Carolina @SeemaCMS , and thank you for working with us to strengthen @scmedicaid and help   all able-bodied South Carolinians participate in our booming economy. Quote Tweet Administrator Seema Verma @SeemaCMS Thank you Governor @henrymcmaster and his team for their efforts in today's two approved #Medicaid demonstrations to help build a bridge out of poverty for South Carolinians! Learn about the demonstrations here: https:// medicaid.gov/medicaid/secti on-1115-demo/demonstration-and-waiver-list/?entry=51634   https:// medicaid.gov/medicaid/secti on-1115-demo/demonstration-and-waiver-list/?entry=53611 ", "2019-12-11T20:57:21.000Z": "Colonel Bobby Cox was an Army Ranger with a highly decorated military career, and he is a real leader, a man of the highest moral integrity and character. I am proud to nominate him to be South Carolina's first Secretary of Veterans' Affairs.", "2019-12-10T21:51:06.000Z": "We are taking bold steps in education reform in South Carolina. Recruiting and retaining the best educators in the nation is critical to our state's future. A $3,000 raise for all teachers in SC will put us into the top 25 nationally. Quote Tweet The Post and Courier @postandcourier South Carolina's public school teachers would see a $3,000 pay boost under a proposal announced today by Gov. Henry McMaster. http:// bit.ly/2PDJOoa", "2019-12-10T14:30:25.000Z": "Peggy and I enjoyed welcoming all of the families who came to our home for the open house last night. If you missed it there are still opportunities to go on a tour while it is decorated for Christmas. Details here: https:// governor.sc.gov/news/2019-12/g overnors-mansion-christmas-open-house-scheduled-december-9 ", "2019-12-05T19:26:39.000Z": "We lost a great man last week. As the longtime leader of the S.C. Division of Veterans Affairs, Howard Metcalf touched the lives of countless veterans and their families. He will be sorely missed, but never forgotten. Thank you for your service, Howard.", "2019-12-04T14:30:30.000Z": "Our annual Christmas open house at the mansion is on Monday, December 9. Peggy and I hope to see you there. We're asking people to bring a food item to be donated to @HarvestHopeFB . The event is free and open to the public, more details here: https:// governor.sc.gov/news/2019-12/g overnors-mansion-christmas-open-house-scheduled-december-9 ", "2019-12-03T14:34:30.000Z": "We're excited to kick off the Christmas season at the mansion. The Columbia Garden Club is hard at work preparing for our open house. (Stay tuned for more details) Quote Tweet First Lady Peggy McMaster @1stLadySC And so it begins! Thank you to Bryan Price of Price's Christmas Tree Farm, @NationalFFA  @LexTechCenter , & the Columbia Garden Club for delivering these beautiful trees and poinsettias to kick off the season of joy and hope. Come to the free Open House 12/9, 5:30-7:30 PM.", "2019-11-30T13:52:57.000Z": "Good riddance! Quote Tweet SCEMD @SCEMD Today is the official end of #hurricane season! https:// noaa.gov/media-release/ active-2019-atlantic-hurricane-season-comes-to-end ", "2019-11-28T14:12:00.000Z": "Peggy, Mac, and I hope that you and your family have a wonderful Thanksgiving!", "2019-11-26T16:27:34.000Z": "I was proud to be the first statewide elected official in America to endorse @realDonaldTrump for President in 2016, and I'm honored to serve as co-chairman of his 2020 re-election campaign in here South Carolina.", "2019-11-22T14:32:14.000Z": "It's beginning to feel a lot like Christmas at the State House. Peggy and I would love it if y'all could join us this Sunday, November 24, at 6PM for the 53rd Annual Governor's Carolighting.", "2019-11-22T01:05:09.000Z": "I'm honored to serve alongside fellow Republican governors from all across our great nation on @The_RGA Executive Committee for the next year. Thank you. Quote Tweet The RGA @The_RGA The RGA 2020 Executive Committee will include Governors @KimReynoldsIA  @LarryHogan  @CharlieBakerMA  @henrymcmaster  @KristiNoem  @GovBillLee  @GovRicketts  @GovHolcomb & @DougBurgum . twitter.com/The_RGA/status", "2019-11-19T22:26:37.000Z": "Today we had Gold Star Families join us outside my office to light \"A Tree for the Fallen\" with the names of fallen soldiers on each of the more than 300 stars that adorn it. We'll proudly display this tree the entire holiday season.", "2019-11-18T20:51:04.000Z": "Dylan Emery's life on this earth was far too short, but through the pain that his family endured emerges hope for other families. With the signing of Dylan's Law today, every baby born in South Carolina will be tested for Krabbe disease. #TeamDylan", "2019-11-18T14:54:08.000Z": "Not even rain can stop @SCDOTPress from their statewide litter pickup. Drivers, please use extra caution when traveling on SC roads.  #SCDOTFallCleanup  #GrabABagSC  #ServeSC Quote Tweet SCDOT @SCDOTPress SCDOT Richland Maintenance Sign and Vegetation Crews with help from Headquarters employees are cleaning up litter on I-20 near Fairfield Road in Richland County. SCDOT employees agency wide are picking up litter across the state throughout the day. #SCDOTFallCleanup  #GrabABag Show this thread", "2019-11-15T20:14:33.000Z": "Recycling is a $13 billion industry in our state, employing 22,000 South Carolinians, not to mention it helps protect the natural beauty of our state and quality of life for our residents and tourists alike. #SCRecyclesDay  #PalmettoPride Quote Tweet SC Dept. of Commerce @SCcommerce @henrymcmaster has declared November 15 #SCRecyclesDay to coincide with #AmericaRecyclesDay ! Recycling not only protects our environment, but also boosts our economy. #SCRecycles  #SCJustRightForRecycling", "2019-11-13T17:39:12.000Z": "This is great news!  We will always stand strong and defend South Carolinians' constitutionally protected religious freedom. Quote Tweet SC Governor Press @scgovernorpress U.S. District Judge Dismisses Miracle Hill Lawsuit https:// governor.sc.gov/sites/default/ files/Documents/Floodwater%20Commission/2019-11-13%20%5B68%5D%20Order%20Granting%20Motion%20to%20Dismiss.pdf ", "2019-11-13T14:18:00.000Z": "From farming to manufacturing the USMCA that @realDonaldTrump negotiated will be a win for South Carolina and all of America.  It's time for congress to pass #USMCAnow .", "2019-11-13T14:17:00.000Z": "New report: Forestry has an economic impact of more than $21 BILLION and supports nearly 100,000 jobs! Just another reason that we love our trees in South Carolina. Forestry generates $21.2 billion impact on SC\\'s economy metrocolumbiaceo.com", "2019-11-11T15:02:14.000Z": "South Carolina has a proud military heritage that goes back centuries. Today, even more so than every other day, we want to thank the men and women who don the uniform to serve our country. #VeteransDay", "2019-11-08T22:34:18.000Z": "What an amazing night having Governor @henrymcmaster and Speaker @schousespeaker join me in Lancaster County. The fundraiser was a huge success raising over $20,000. Thank you to the Hosts, Sponsors, Donors and volunteers who made last night a success! #newtonforhouse  #district45", "2019-11-09T19:45:43.000Z": "\"The great nonpartisan work on criminal justice reform stems from a mutual understanding that the parties' interests fall far behind the principal best interest of the citizens,\" @RepAlanClemmons writes.\n\nPutting Americans first on justice reform: First Step Act: A start towards criminal justice reform The First Step Act passed last December has already made good on the promise of opportunity -- and of forgiveness -- for people who have paid their debt to society. washingtontimes.com", "2019-11-09T02:49:20.000Z": "Update: The culprit has been identified Quote Tweet ABC News 4 @ABCNews4 He knows! He knows! https:// ift.tt/2Ki3IDl", "2019-11-08T18:29:22.000Z": "That is what I intend to do with my Executive Budget in January. \n\n[Statement Re: Board of Economic Advisors FY 2020-21 Revenue Forecast]\n(3/3)", "2019-11-08T18:29:21.000Z": "Prosperity requires fiscal restraint and conservative stewardship of taxpayer dollars.  As I have said before, a surplus means prioritizing and funding the state's most critical needs, then returning the rest to the taxpayers or cutting taxes. (2/3)", "2019-11-08T18:29:20.000Z": "South Carolina's income and employment growth rates continue to outpace the nation, fueled by a reputation as a great state for business, families or vacation. We are winning and our future remains bright. (1/3)", "2019-11-08T15:45:39.000Z": "Speaking of Horry County, we are in the Independent Republic today. Quote Tweet Horry County PD @horrycountypd HORRY COUNTY CLEAN-UP Employees and community members are working across Conway, Bucksport, Socastee, Loris, and Longs for #HCServiceDay ! Look out-you may see members of the Governor's S.C. Floodwater Commission, @HorryCounty_Gov , @CofConway , and @of_loris milling about.", "2019-11-08T13:36:23.000Z": "Who made this?", "2019-11-07T21:07:05.000Z": "I was honored to give some welcoming remarks at the @ColaUrbanLeague 's Equal Opportunity Dinner last and thank a packed room for their collaborative efforts to promote education, wellbeing, and empowerment in communities across the Midlands.", "2019-11-07T18:12:32.000Z": "Today we announced a 34% rate cut of unemployment insurance tax, representing more than $69 million in savings for businesses across SC, AND announced that the unemployment insurance trust fund is solvent for the first time since 2003. More here: https:// governor.sc.gov/news/2019-11/g ov-henry-mcmaster-sc-department-employment-workforce-executive-director-dan-ellzey ", "2019-11-06T20:28:11.000Z": "A loving home can make all the difference to a child's future. Our state is filled with caring, and compassionate people who want the best for their neighbors, and I ask that everyone consider whether adoption is an option for your family. Quote Tweet SC Social Services @SC_DSS It's National Adoption Month-  Find out more information @SC_DSS  https:// wistv.com/2019/08/27/fam ily-life-happy-howells/   @wis10 Introduces the Howells.", "2019-11-06T20:24:25.000Z": "This is great news for Charleston! Proud of #TeamSouthCarolina working together to get this done, and can't wait to see the finished product. Quote Tweet The Post and Courier @postandcourier NEW: The U.S. Department of Transportation has awarded Charleston an $18.1 million grant for a stand-alone bicycle and pedestrian bridge.\n\nIt would be built just south of the twin U.S. Highway 17 drawbridges. http:// bit.ly/32qaVam", "2019-11-06T14:35:27.000Z": "Congratulations Tie & Timber Technologies! We now make train ties, planes, and automobiles in South Carolina. Quote Tweet SC Dept. of Commerce @SCcommerce Congratulations to Tie & Timber Technologies LLC, for establishing railroad tie manufacturing operations in Marion County! http:// bit.ly/34pOeVk  #TeamSC  #SCJustRight", "2019-11-05T16:11:55.000Z": "Congratulations @Citadel1842 on this amazing opportunity. We'll be watching y'all proudly from this side of the pond. \n\nPS, if you run into any McMasters over there tell them their Cousin Henry says hello. Quote Tweet SCPRT @SCPRT The Citadel Regimental Band and Pipes will represent the US at a military event in Scotland. https:// charlestoncurrents.com/2019/11/focus- citadel-military-band-to-represent-u-s-at-edinburgh-tattoo/ ", "2019-11-01T17:31:34.000Z": "Don't worry, Mac made sure to welcome him to the state with superior football programs. (And more peaches) Quote Tweet Maayan Schechter @MaayanSchechter Assuming Kemp did not say 'Go Dawgs' before this picture was taken. twitter.com/henrymcmaster/", "2019-11-01T17:19:42.000Z": "Collaboration, communication, and cooperation doesn't stop at our border. Thank you @BrianKempGA for stopping by for a visit and to discuss how we can continue to work together to improve the lives of people living on both sides of the state line.", "2019-11-01T14:03:34.000Z": "We hope you'll join us one week from today on 11/8 for our next cleanup day in conjunction with the S.C. Floodwater Commission's meeting in Horry County. Sign up here: https:// horrycounty.org/serviceday  #TeamSouthCarolina  #ServeSC  #TeamSC Quote Tweet Gov. Henry McMaster @henrymcmaster On Friday, November 8 #TeamSouthCarolina will be holding another cleanup day in conjunction with the S.C. Floodwater Commission's meeting in Horry County.  Once again we're calling on people from across the state to answer the call to #ServeSC . Details: https:// horrycounty.org/serviceday", "2019-11-01T13:40:11.000Z": "The American Revolution may have begun in Boston and ended in    Yorktown, but it was won in South Carolina, home to more battles than any other state. We're proud to unveil plans for the #LibertyTrail in the lead up to the 250th anniversary of the war. Quote Tweet SCPRT @SCPRT New Liberty Trail to link RevWar sites in South Carolina, celebrating the war's sestercentennial. https:// columbiabusinessreport.com/news/hospitali ty-and-tourism/77406/ ", "2019-11-01T13:04:03.000Z": "On Friday, November 8 #TeamSouthCarolina will be holding another cleanup day in conjunction with the S.C. Floodwater Commission's meeting in Horry County.  Once again we're calling on people from across the state to answer the call to #ServeSC . Details: https:// horrycounty.org/serviceday", "2019-10-31T20:25:24.000Z": "God bless our @SCNationalGuard troops serving in Syria. South Carolina stands behind all of you, and we are praying for your safe return. Quote Tweet OIR Spokesman Col. Myles B. Caggins III @OIRSpox . @USArmy troops in 4-118th Infantry Regiment, @30thabct , @NCNationalGuard attached to the 218th Maneuver Enhancement Brigade, @SCNationalGuard , load M2A2 Bradley Fighting Vehicles to support the @CJTFOIR mission in Deir ez Zor, Syria. #DefeatDaesh Show this thread", "2019-10-31T20:10:00.000Z": "*Planes, automobiles, and terminal tractors! Quote Tweet Duncan Pindar @dmpindar And terminal tractors! twitter.com/henrymcmaster/", "2019-10-31T18:41:33.000Z": "We don't build trains in South Carolina, but we do build planes and automobiles (and a whole lot more.) I enjoyed speaking to a packed room of representatives from companies all over the Palmetto State at the SC Manufacturing Conference and Expo.", "2019-10-30T20:56:51.000Z": "We congratulate Sapience Automation on its decision to establish operations in Berkeley County, and look forward to watching the company continue to grow here for a long time. Quote Tweet SC Dept. of Commerce @SCcommerce Congratulations to Sapience Automation, a full-service integrator of robot systems, for establishing operations in @BerkeleySCGov ! http:// bit.ly/2NmG4pM  #TeamSC  #SCJustRight", "2019-10-29T01:40:00.000Z": "Happy 10 years, @weareboeingsc !", "2019-10-25T20:53:11.000Z": "Thank you for visiting, Mr. President. We always enjoy having you in South Carolina. Come back soon! Quote Tweet Donald J. Trump @realDonaldTrump It was my great honor to deliver the keynote address at the 2019 Second Step Presidential Justice Forum hosted by the 20/20 Bipartisan Justice Center in South Carolina, and my true honor to receive the Bipartisan Justice Award, thank you! https:// pscp.tv/w/cINHzzFvTlFs TFJub1dwUXd8MU1ueG5FbmdhcW9KT99pFYaYe1C4ArvQ2DE-0gWmhGZ56k58_gydacO3TnKQ?t=1s ", "2019-10-25T20:48:43.000Z": "The only bad truth is a half truth, and the International African American Museum is going to tell the whole truth-a story of the strength and determination of those who came to our shores in chains-and will be a source of pride for all South Carolinians.", "2019-10-23T20:14:20.000Z": "Serving South Carolina is an old tradition in our state, and we need more of it. I was proud to stand with leaders from across the state-representing @scwomenlead , @CityYear , @BenedictEDU , & more-to call on all South Carolinians to find a way to #ServeSC . https:// governor.sc.gov/news/2019-10/g ov-henry-mcmaster-lt-gov-pamela-evette-joined-civic-groups-business-leaders-encourage ", "2019-10-23T13:45:39.000Z": "Thank you, Ambassador. We look forward to welcoming you to the Palmetto State any time. Quote Tweet Japan Embassy DC @JapanEmbDC South Carolina Governor @HenryMcMaster , thank you for talking with me during SEUS-Japan joint meetings yesterday and today. As discussed, investments by Japanese companies have made an important impact in SC, & I will definitely visit your state soon. -Ambassador Sugiyama", "2019-10-22T16:08:57.000Z": "Thank you @realDonaldTrump and @SecretarySonny for continuing to invest in our rural communities. For everything from education to healthcare, reliable broadband internet access is a vital resource for people across our state. Quote Tweet Rural Development @usdaRD The ReConnect rollout continues! Today, @SecretarySonny is in Orangeburg, SC to announce @USDA has invested $9,750,000 in high-speed broadband infrastructure that will create or improve rural e-Connectivity for 3,911 rural homes in the state! #ReConnectUSA  https:// usda.gov/media/press-re leases/2019/10/22/usda-invests-975-million-rural-broadband-south-carolina-families  Show this thread", "2019-10-22T14:24:32.000Z": "This investment proves that our state is an ideal destination for companies of all types, and by working together, we can maintain our competitive business environment and ensure the future success of companies in all corners of our state. Quote Tweet SC Dept. of Commerce @SCcommerce Congratulations to Sumter Casket Company, a manufacturer and distributor of caskets, for expanding the company's operations to Clarendon County! http:// bit.ly/2p3ulUX  #TeamSC  #SCJustRight  @Central_SC", "2019-10-22T13:22:54.000Z": "Thank you @BrianKempGA for hosting us in Savannah for SEUS-Japan. It's a great opportunity to hear from our neighbors and trading partners from the other side of the world.", "2019-10-21T20:59:29.000Z": "We are thankful for a President who knows the hurdles that  regulations can present to businesses. Thank you @realDonaldTrump for putting @mike_pence in charge of this important initiative; as a former governor who knows how to get stuff done he's the best man for the job. Quote Tweet Vice President Mike Pence @VP Productive cabinet meeting today at the @WhiteHouse with President @realDonaldTrump . Since the start of our Administration, President @realDonaldTrump has led HISTORIC deregulation efforts resulting in more than 6 million new jobs, rising wages, and low unemployment!", "2019-10-15T19:29:52.000Z": "More great news in South Carolina - @SpartanMotors is creating 300 new jobs in Charleston County. Welcome to #TeamSC ! #SCWinning", "2019-10-12T19:49:30.000Z": "#GoCocks !   What a great win for the State of South Carolina!", "2019-10-08T14:20:48.000Z": "Not only do we have everything we need to make high-quality products in South Carolina, but we also have the resources to move those products all over the globe. Congratulations to A&R Logistics, Inc. for establishing operations here in the South Carolina. Quote Tweet SC Dept. of Commerce @SCcommerce Congratulations to A&R Logistics, Inc., a leading supply chain services company providing, for establishing a new facility in @BerkeleySCGov ! http:// bit.ly/2APCHC1  #TeamSC  #SCJustRight", "2019-10-08T02:16:09.000Z": "When the sun rises in the morning the flags will be lowered to half-staff in honor of Fire Engineer Paul Quattlebaum. Please take a moment to remember Paul and keep his family in your prayers. Quote Tweet The State Newspaper @thestate Funeral arrangements set for Lexington County firefighter killed in the line of duty https:// trib.al/JSAeiVF", "2019-10-07T16:01:20.000Z": "I enjoyed speaking to young people across the state last week to celebrate South Carolina Manufacturing Week and discussing the benefits of pursuing a career in which they can work with their hands and their brains. #MadeInSC", "2019-10-04T16:59:42.000Z": "In South Carolina we may not all know each other by name, but we know each other. While we knew Terrence Carraway and Farrah Turner by different names-father, daughter, neighbor, and friend-we all remember them today as patriots and heroes.", "2019-10-02T18:43:35.000Z": "BMW has been a part of the South Carolina family for a quarter of a century now. We're proud of the work they do and the impact that they have had across our state the past 25 years, and wish them many more years of success here.", "2019-10-01T15:29:31.000Z": "In South Carolina we manufacture automobiles, airplanes, and so much more. This wouldn't be possible without great business partners and well-trained workforce we have in the Palmetto State. Please join me in celebrating manufacturers across the state this week.", "2019-09-29T04:43:37.000Z": "Family forever", "2019-09-29T16:48:44.000Z": "SC Senator Margie Bright-Matthews' daughter Matti is doing amazing things @UVA Congratulations! Quote Tweet Virginia Volleyball @UVAVolleyball S1 | Matti Matthews with a kill to spark a 4-0 run!\n\nHoos lead 11-10! #GoHoos Show this thread", "2019-09-27T14:21:30.000Z": "South Carolina has the #1 business incentives program in the country according to @AreaDevelopment .", "2019-09-26T16:42:46.000Z": "South Carolina continues to be among the most business friendly states in the nation. Area Development Magazine ranked us in the top three states for overall cost of doing business. https:// areadevelopment.com/Top-States-for -Doing-Business/ ", "2019-09-25T19:03:45.000Z": "The Freedom From Religion Foundation has accused Gov. Henry McMaster of violating the U.S. Constitution with prayer at official government press conferences. Gov. Henry McMaster accused by national organization of violating Constitution with prayer The Freedom From Religion Foundation has accused Gov. Henry McMaster of violating the Constitution with prayer at official press conferences. greenvilleonline.com", "2019-09-24T13:33:24.000Z": "Thank you @OfficialStedman for stopping by and discussing the Great work that Academy of Hope is doing with inmates at @SCDCNews .", "2019-09-20T21:33:24.000Z": "I have ordered flags throughout South Carolina to be flown at half-staff on Monday in honor of Dr. Emily England Clyburn. Please keep the Clyburn family in your prayers during this time and remember her many contributions to our state when you see a lowered flag on Monday.", "2019-09-20T15:47:46.000Z": "The secret is out: South Carolina is open for business. More people are working in the Palmetto State than ever before. Quote Tweet SCDEW @SCDEWinfo The numbers are in! South Carolina's unemployment rate is low and the number of people working is at a record high of 2,304,835! #employment  #sc  #southcarolina  #record  #august", "2019-09-20T15:34:22.000Z": "Looking forward to celebrating next Spring in #yeahthatgreenville . Quote Tweet Dana Griffin @DanaGriffinWYFF Had the honor of introducing @henrymcmaster as the 2020 #GREENvillestpatricksdayparade Grand Marshal . He and the First Lady were so nice. The parade & festival is Saturday, March 14. Hope to see you there!", "2019-09-19T20:55:49.000Z": "Sadly, we have lost another great South Carolina public servant today. Georgetown County Sheriff A. Lane Cribb passed away today after serving as sheriff for 27 years. Peggy and I ask that all South Carolinians keep the Cribb family and their friends in their prayers.", "2019-09-19T15:19:58.000Z": "I ask that South Carolinians keep Jim Clyburn and the Clyburn family in their hearts and lift them up through prayer today. Peggy and I are saddened by the passing of Ms. Emily, but are heartened that she has left a legacy of love, joy, and strength with the Clyburn family.", "2019-09-17T20:38:14.000Z": "My condolences; it's always a sad day to lose a dog, especially a bulldog. #RIPG2 Quote Tweet The Citadel @Citadel1842 We're heartbroken to report that General Robert P. Carson, affectionately known as General or G2, has passed away. He was 8 years old. https:// bit.ly/34Qpt5s", "2019-09-17T14:15:59.000Z": "The future continues to shine bright for solar power in South Carolina. Welcome to the Palmetto State, NARENCO! Quote Tweet SC Dept. of Commerce @SCcommerce Congratulations to National Renewable Energy Corporation (NARENCO), a leading renewable energy independent power producer, for announcing the development of Cardinal Solar LLC, a new solar power operation in Marion County. http:// bit.ly/2mhkpW4  #TeamSC  #SCJustRight", "2019-09-16T16:09:36.000Z": "You can say that again. Quote Tweet SC Public Radio @SCPublicRadio #Humberto Best. \nHurricane. \nEver.", "2019-09-14T01:10:29.000Z": "We're living in paradise, and we don't want to squander what the good Lord gave us. Republican or Democrat, Lowcountry or Upstate, Gamecock or Tiger-we do not want offshore drilling or seismic testing in South Carolina! Quote Tweet The Post and Courier @postandcourier The visual alone was staggering.\n\nHere was SC Gov. @henrymcmaster standing with Democratic Congressman @JoeCunninghamSC at a seafood restaurant on a sweltering Friday afternoon. http:// bit.ly/31jDmqJ", "2019-09-12T21:26:23.000Z": "Proud of the work Director Stirling is doing to rehabilitate inmates, reintroduce them to society, and reduce recidivism. Quote Tweet SC Dept. Corrections @SCDCNews SCDC opened its reentry center for maximum-security offenders at Lieber CI today.  Offenders will spend their final 2 years in this program, learning job and interpersonal skills, both of which are crucial to their success in reentering society. #WeAreCorrections @ASCALeadership Show this thread", "2019-09-12T20:53:24.000Z": "I had a great time at @clt_alliance chatting with @RoyCooperNC about the booming, bi-state Charlotte region. The state line is growing more invisible, and competitors have become collaborators. \n\n(ps, Roy, let's chat more about expanding light rail to @RockHillSCCity )", "2019-09-11T20:08:45.000Z": "This morning we gathered in Columbia as in many communities across South Carolina and the United States to remember those who perished eighteen years ago today. #NeverForget", "2019-09-10T14:14:39.000Z": "We hear this same sentiment all over the state from business leaders from around the globe-it's the people that set South Carolina apart. Congratulations DC Machine on your expansion! Quote Tweet SC Dept. of Commerce @SCcommerce Congratulations to DC Machine, an industrial design and machining center, for expanding its existing operations in @DorchesterSCGov ! The investment will create 63 new jobs! http:// bit.ly/2m4ckE1  #TeamSC  #SCJustRight", "2019-09-10T00:59:11.000Z": "This is great news. We have wonderful companies like Boeing in South Carolina that have good, direct relationships with their employees. We don't need unions coming in and ruining that. Quote Tweet We Are Boeing SC @weareboeingsc JUST IN: The @NLRB announced today that it agrees with Boeing's appeal--that the IAM's petition to unionize Boeing South Carolina's flight line teammates is illegal. MORE: https:// weareboeingsc.com/national-labor -relations-board-rules-favor-boeing-micro-unit-challenge/ ", "2019-09-09T21:39:08.000Z": "US Senate candidate, SC Just had a great call with President @realDonaldTrump and Governor McMaster regarding Hurricane Dorian. \n\nI appreciate President Trump's determination and commitment to always helping the people of South Carolina.", "2019-09-09T21:34:41.000Z": "Speaking to Governor @HenryMcMaster of South Carolina on my way to North Carolina for a big rally for Dan Bishop ( @jdanbishop ) running for Congress. Vote tomorrow! #NC09", "2019-09-06T18:12:10.000Z": "\"The coast is clear!\" - Gov. McMaster @henrymcmaster visited the EOC to express his thanks for the many individuals and agencies that responded to the threat of Hurricane #Dorian .\n\nHe was joined by @RepTomRice , @SCDOTPress Sec. Hall, & @HorryCounty_Gov and municipal leaders.", "2019-09-06T15:31:41.000Z": "Gov. Henry McMaster's Schedule: Friday, September 6, 2019", "2019-09-06T14:00:01.000Z": "Evacuation Orders Lifted for All Previously Evacuated Counties https:// governor.sc.gov/news/2019-09/e vacuation-orders-lifted-all-previously-evacuated-counties ", "2019-09-05T23:43:33.000Z": "President @realDonaldTrump just called to check in on #HurricaneDorian and to offer South Carolina any assistance needed.  I thanked him and told him his Administrator @FEMA_Pete and @USACEHQ Commander MG @DianaMHolland were w/ me on the ground working with #TeamSC at @SCEMD .", "2019-09-05T18:52:31.000Z": "As South Carolina continues to experience heavy rains along the coast, be very cautious of moving water on the roadway as it may be washed out. TURN AROUND, DONT DROWN #Dorian  #SCTweets  #scwx", "2019-09-05T19:07:45.000Z": "By order of the Governor, schools and county governments in Dorchester, Charleston, Berkeley, Horry and Georgetown counties will remain closed tomorrow, September 6, 2019. #Dorian  #sctweets", "2019-09-05T18:39:55.000Z": "Evacuation Orders Lifted for Beaufort, Jasper, and Colleton Counties at 3:00 PM Today |\nEvacuation Orders Remain in Effect for all Zones in Charleston, Dorchester, Berkeley, Georgetown, and Horry Counties https:// governor.sc.gov/news/2019-09/e vacuation-orders-lifted-beaufort-jasper-and-colleton-counties-300-pm-today ", "2019-09-05T15:21:22.000Z": "Governor Henry McMaster will hold a media briefing with state emergency response officials today, Thursday, September 5 at 1:30 PM. \n\nNote: The press conference will be streamed live on SCETV's website at South Carolina ETV SCETV is South Carolina's public broadcasting, storytelling, and education network. scetv.org", "2019-09-04T20:09:16.000Z": "Governor @henrymcmaster spoke with the #TeamSC at the State Emergency Operations Center. Personnel from state, federal, and local agencies are coordinating disaster evacuation and recovery efforts at the @SCEMD - #Hurricane  #Dorian  #hurricanedorian  #scwx  #scstrong  #scnews", "2019-09-04T20:09:12.000Z": "Video: Gov. McMaster gives 2PM September 4 Hurricane Dorian  Update Gov. McMaster gives 2PM September 4 Hurricane Dorian Update youtube.com", "2019-09-04T16:31:57.000Z": "Governor Henry McMaster will hold a media briefing with state emergency response officials today, Wednesday, September\n4 at 2:00 PM.\n\nNote: The press conference will be streamed live on SCETV's website at Governor's Storm Update Live press events may begin slightly later than scheduled. South Carolina Governor Henry McMaster and state officials will hold a media briefing Thursday, September 5 at 1:30 PM. For more information scetv.org", "2019-09-04T16:29:48.000Z": "We are still seeing high volumes of evacuees leaving Charleston. I have directed @SCDOTPress and @SCDPS_PIO to keep the reversed lanes open for an additional 2 hours. Quote Tweet Gavin Jackson @GavinJackson I-26 lanes will remain reversed for an additional two hours-until 2 p.m.-to accommodate high traffic volumes, according to Gov. @henrymcmaster 's office. #Dorian twitter.com/GavinJackson/s", "2019-09-04T00:07:19.000Z": "There is no more time for hesitation. If you are in an evacuation zone you need to evacuate now. Quote Tweet SCEMD @SCEMD ALERT: RESIDENTS IN EVACUATED ZONES MUST LEAVE NOW DUE TO THE INCREASING THREAT FROM HURRICANE #DORIAN : https:// scemd.org/news/residents -must-leave-now/   #SCTweets  #SCWX  #alert", "2019-09-03T19:33:06.000Z": "VIDEO: Gov. McMaster Hurricane Dorian Update 2PM September 3, 2019 Gov. McMaster Hurricane Dorian Update 2PM September 3, 2019 youtube.com", "2019-09-03T16:13:06.000Z": "Gov. Henry McMaster, State Officials to Hold Briefing on Hurricane Dorian\n\nWHEN: Today, Tuesday, September 3 at 2:00 PM\n\nNote: The press conference will be streamed live on SCETV's website at Governor's Storm Update Live press events may begin slightly later than scheduled. South Carolina Governor Henry McMaster and state officials will hold a media briefing Thursday, September 5 at 1:30 PM. For more information scetv.org", "2019-09-03T07:58:32.000Z": "Here are two important telephone numbers to keep handy as #HurricaneDorian approaches our coast. Both are staffed 24/7. \n\nPublic Information Phone System (PIPS)-SCEMD \n1-866-246-0133\n\nSCDOT\n1-855-467-2368", "2019-09-03T13:26:57.000Z": "Please remember to use SCDOT's 511 system for current South Carolina traffic information, streaming cameras & more. https:// 511sc.org & download the free app! #Dorian", "2019-09-02T16:12:45.000Z": "The SCHP flush cars have arrived back in Columbia, SC and the reversal is complete for the noon evacuation order. #Dorian  #scwx  #sctweets", "2019-09-02T16:11:21.000Z": "Gov. Henry McMaster, State Officials to Hold Briefing on Hurricane Dorian today, Monday, September 2 at 2:00 PM\nThe press conference will be streamed live on @SCETV 's website at Governor's Storm Update Live press events may begin slightly later than scheduled. South Carolina Governor Henry McMaster and state officials will hold a media briefing Thursday, September 5 at 1:30 PM. For more information scetv.org", "2019-09-02T15:21:37.000Z": "Thanks to the hard work of the crews at @SCDPS_PIO and @SCDOTPress the I-26 lane reversal from Charleston to Columbia is open and flowing ahead of schedule.", "2019-09-02T14:40:33.000Z": "Thank you to @realDonaldTrump for your timely attention to South Carolina's request for a federal disaster declaration. The President has offered his administration's full support, and he's delivering.", "2019-09-02T14:33:03.000Z": "Information is available in English, Spanish, and Video Relay Service (VRS) for persons with hearing or speech disabilities.\n\nInformación está disponible en Ingles, Español, y retransmisión de vídeo (VRS) para personas con discapacidades auditivas o del habla. Quote Tweet SCEMD @SCEMD The Public Information Phone System is taking calls. Give us a call if you need help. We're here 24/7. 1-866-246-0133 #Dorian  #HurricaneDorian", "2019-09-01T23:52:06.000Z": "Please take a moment to read this  see if you are in one of the zones being evacuated tomorrow, Monday, September 2 at 12:00 noon. #HurricaneDorian Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Orders Mandatory Evacuations for Coastal Counties Effective Tomorrow, September 2 at Noon\n| Governor Also Ordered School and State Government Office Closures in Coastal Counties https:// governor.sc.gov/news/2019-09/g ov-henry-mcmaster-orders-mandatory-evacuations-coastal-counties-effective-tomorrow ", "2019-09-01T21:14:24.000Z": "Gov. Henry McMaster, State Officials to Hold Briefing on Hurricane Dorian today Sunday September 1, 2019 at 6:30PM. @SCETV will stream the briefing live at Governor's Storm Update Live press events may begin slightly later than scheduled. South Carolina Governor Henry McMaster and state officials will hold a media briefing Thursday, September 5 at 1:30 PM. For more information scetv.org", "2019-09-01T19:40:39.000Z": "The SCDOT Call Center has been activated to provide road information #HurricaneDorian2019", "2019-09-01T19:35:02.000Z": "Gov. Henry McMaster Requests Federal Disaster Declaration in Advance of Hurricane Dorian's Potential Impact to the State https:// governor.sc.gov/news/2019-09/g ov-henry-mcmaster-requests-federal-disaster-declaration-advance-hurricane-dorians ", "2019-09-01T18:38:37.000Z": "VIDEO: Gov. McMaster, state officials give Hurricane Dorian update 2 PM September 1, 2019 Gov. McMaster, state officials give Hurricane Dorian update 2 PM... youtube.com", "2019-09-01T16:13:36.000Z": "Gov. Henry McMaster, State Officials to Hold Briefing on Hurricane Dorian today, Sunday, September 1 at 2:00 PM\n\nNote: The press conference will be streamed live on SCETV's website at http:// scetv.org . South Carolina ETV SCETV is South Carolina's public broadcasting, storytelling, and education network. scetv.org", "2019-08-31T17:07:09.000Z": "Both our website, http:// scemd.org , and the SC Emergency Manager app now in \"Emergency Mode\". All Hurricane #Dorian information up front & easy to access. Get the app in App Store: https:// itunes.apple.com/us/app/sc-emer gency-manager/id1378105431?mt=8  - & on Google Play: https:// play.google.com/store/apps/det ails?id=org.scemd.app   #SCTweets  #SCWX", "2019-08-31T16:28:05.000Z": "Given the strength and unpredictability of the storm, we must prepare for every possible scenario. State assets are being mobilized now and Team South Carolina is working around the clock to be ready, if necessary. (1/2)", "2019-08-30T13:29:50.000Z": "This is a great day for the residents of Berkeley County, the team at Volvo, and all of the future businesses and workers that will be locating in the new business park off of the interchange. Quote Tweet SCDOT @SCDOTPress SCDOT and its partners, the South Carolina Department of Commerce and Berkeley County have ceremonially opened the new Volvo Interchange on I-26 with a ribbon-cutting ceremony on Thursday, Aug. 29, 2019. SCDOT will open the interchange to traffic on Friday morning Aug. 30, 2019. Show this thread", "2019-08-30T12:45:51.000Z": "Enjoyed the opportunity to check out the dredging operation that is working to help make the Port of Charleston one of the deepest on the East Coast.", "2019-08-29T23:33:42.000Z": "Based on the smiles on the employees faces, @Trane seems like a pretty cool place to work. This week's ribbon cutting of their new expansion means 750 more smiling faces will join them. #SCjobs", "2019-08-28T17:03:19.000Z": "Please join me in wishing a happy birthday to the best Lt. Governor in America, @PamelaEvette .", "2019-08-27T18:30:44.000Z": "As September approaches it's a good time to double check your hurricane plans. Follow @SCEMD , @SCDOTPress , and your local emergency management agency for the latest, most accurate information during an emergency. Check out SCEMD's website for more: https:// scemd.org/stay-informed/ publications/hurricane-guide/ ", "2019-08-27T00:20:02.000Z": "Ceremonial Handshake for #HandsAcrosstheBorder at the GA/SC State line on US 17 near Jasper County.  Law enforcement officers remind the public of traveling safely as we approach the busy Labor Day holiday. We want everyone to be safe - no matter what state you are traveling in.", "2019-08-27T15:01:02.000Z": "In every corner of the state, it's always great to see our home grown businesses expand. Congratulations @SaltMarshBrewSC . Quote Tweet SC Dept. of Commerce @SCcommerce Congratulations to @SaltMarshBrewSC , a local, craft brewery, on expanding their operations in Beaufort County. The investment is creating approximately 43 new jobs. http:// bit.ly/2zm2twZ  #TeamSC  #SCJustRight  @bftcountysc  @scalliance", "2019-08-27T14:39:37.000Z": "Thank you @vp for visiting South Carolina yesterday. We had a great time promoting the #USMCA to support American workers, and joining @RepJeffDuncan at his annual #FaithandFreedomBBQ . Looking forward to great things in 2020.", "2019-08-26T20:48:32.000Z": "Welcome back to the Palmetto State, Mr. Vice President! Quote Tweet Vice President Mike Pence @VP Great to be back in South Carolina with @henrymcmaster , @PatPizzellaDOL , @LindseyGrahamSC , Members of Congress, former Administrator Linda McMahon, @SeanSpicer , Pastor Mark Burns, Tim Hayden & all the hard-working men & women of Sargent Metal!", "2019-08-25T19:11:23.000Z": "Great news for our farmers. Quote Tweet The White House @WhiteHouse JUST NOW: President @realDonaldTrump and Prime Minister @AbeShinzo announced a trade deal. \n\n\"This is a tremendous deal for the United States. It's a really tremendous deal for our farmers.\"", "2019-08-23T14:33:20.000Z": "DJJ Unveils New Logo and Website - https:// mailchi.mp/d672f9f35348/d jj-unveils-new-logo-and-website   #sctweets  #scmedia", "2019-08-23T14:35:54.000Z": "Register NOW for the Governor's Opioid Summit! https:// carolinaeventconsultants.wufoo.com/forms/z1jepf76 1qnq9ph/ ", "2019-08-23T14:39:36.000Z": "If you haven't yet, please take a few minutes to fill out the @SCDOTPress survey to help inform their long term planning for South Carolina's transportation needs. Quote Tweet SCDOT @SCDOTPress SCDOT is updating the Long Range Statewide Multimodal Transportation Plan (MTP) to address South Carolina's growing transportation needs. \n\nThe survey ends August 31, 2019!! \n\nTake the Survey and view our video here: https:// scdot.org/MTP2040Survey. aspx   #Driveourfuture", "2019-08-22T14:12:45.000Z": "Keep up the great work Deputy Cass! Quote Tweet ABC News 4 @ABCNews4 This is terrific! Dorchester County Deputy Robb Cass, an SRO at Williams Memorial Elementary in St. George, dances in the rain while directing after-school traffic Wednesday!", "2019-08-20T20:58:11.000Z": "\"Project Lifeline\" was absolutely vital to maintaining emergency access to the coast during Hurricane Florence. Congratulations @SCDOTPress for this well-deserved recognition of an impressive operation. Quote Tweet SCDOT @SCDOTPress SCDOT - \"Project Lifeline\" (Operations Excellence - Small category) \n\nWhen Hurricane Florence slammed into the coastline of the Carolinas in Sept. 2018, SCDOT jumped into action to identify locations that would help keep transportation flowing. Show this thread", "2019-08-19T18:46:57.000Z": "Thank you @ustravel for recognizing what we've known in South Carolina for a while-that Duane Parrish is the best tourism director in the whole country. Congratulations Duane! Quote Tweet SCPRT @SCPRT SCPRT's Duane Parrish was named the national 2019 State Travel Director of the Year by @USTravel at @USTravelESTO ! https:// scprt.com/articles/us-tr avel-association-names-scpr-ts-duane-parrish-as-2019-state-travel-director-of-the-year ", "2019-08-16T18:29:16.000Z": "Gov @henrymcmaster & Commissioner @HughWeathers selling South Carolina today @TysonFoods world headquarters.  Nice truck. #agribusiness", "2019-08-08T20:20:06.000Z": "Thank you to all of the people who worked hard to get the Animal Cruelty and Care Act to my desk for me to sign. And special thanks to this beautiful pup, Ruby, for joining us for the signing ceremony today.", "2019-08-07T17:59:26.000Z": "It was an exciting morning at the @SCStatehouse as Gov. @henrymcmaster acknowledged the wonderful interns we have here @SCDCNews  @ColaUrbanLeague", "2019-08-07T19:16:10.000Z": "It was a delight to welcome the interns at the Department of Corrections to the State House. Quote Tweet SC Dept. Corrections @SCDCNews What a great looking group Show this thread", "2019-07-31T16:53:56.000Z": "USC and the State of South Carolina have been made better by the service of Dr. Pastides. We will miss him and his wife Patricia and wish them well in whatever life brings them next. #ThankYouPastides  #ForeverToThee", "2019-07-30T19:21:21.000Z": "78 propane school busses 1 CNG bus for City of Anderson transit 2 @Proterra_Inc electric busses for @BCDCoG transit", "2019-07-30T19:21:20.000Z": "Today I joined @scdoi Dir. Ray Farmer, @EducationSC Superintendent Molly Spearman, and more to announce the first payments, more than $9 million, of the @VW settlement towards 81 new, safer, cleaner busses across the state.", "2019-07-27T14:26:10.000Z": "Please join me and Peggy as we mourn the loss of and pray for the families of Cecil Morgan and Joseph Sibbick. May their tragic and avoidable deaths serve as a grim reminder to drive safely and attentively, especially in work zones. Quote Tweet SCDOT @SCDOTPress Today, we mourn the loss of 2 of our SCDOT family members. Horry Co. Highway Maintenance Workers, Cecil Andrew Morgan & David Joseph Sibbick, were killed in Horry Co. Thursday. They were patching a pothole on US 501 between Aynor & Conway when a driver struck and killed both men. Show this thread", "2019-07-24T19:48:47.000Z": "We had the opportunity to welcome @SenatorTimScott 's summer interns at the State House recently.", "2019-07-19T17:42:23.000Z": "I am confident that every student, alumnus, faculty member and citizen of this state will benefit from his superior leadership, vision and direction, which he has demonstrated throughout his remarkable career. (2/2)", "2019-07-19T17:42:22.000Z": "The selection of General Robert Caslen as the next president of the University of South Carolina is a positive and transformative step forward for the future of the university and the state.  (1/2)", "2019-07-12T14:11:19.000Z": "When Hurricane Florence brought record amounts of water to South Carolina last year @LAFIREMARSHAL provided invaluable assistance to #TeamSouthCarolina . Now it is our turn to help them in a time of need. Godspeed to the @SCStateFire team heading down to Louisiana. Quote Tweet SC State Fire Marshal @SCStateFM @SCStateFire Palmetto Incident Support Team deploying to Louisiana to assist with the planning and coordination of Search and Rescue Operations, in response to the potential impacts of TS Barry. #louisianastrong  @LAFIREMARSHAL  @SCDLLR  https:// facebook.com/SCStateFire/po sts/2246242168758051 ", "2019-07-08T14:11:30.000Z": "Newly crowned Miss SC and Clemson grad Morgan Nichols stopped by our office the other day. With a new genetics degree, Morgan was passionate about the importance of STEM education and how she hopes to use her platform to help raise awareness about the dangers of opioid abuse.", "2019-07-03T15:29:41.000Z": "South Carolina's #SaluteFromTheShore is a fun, patriotic, #IndependenceDay tradition. If you're going to be near any part of our coast tomorrow I encourage you and your family to join mine to look at the schedule and make sure you see it. Quote Tweet SalutefromtheShore @July4Salute We've finalized this year's detailed flight schedule for the 10th Anniversary Salute from the Shore! Check out here: https:// salutefromtheshore.org/2019-flyover-s chedule ", "2019-06-28T20:51:30.000Z": "We can't give enough thanks to the men and women who don firefighter uniforms and run towards danger to keep us safe. I was grateful for the opportunity to address the @scfirefighters at their annual convention.", "2019-06-27T14:14:15.000Z": "Nucor Steel has been an integral part of the community in Darlington for 50 years. It was an honor to be there with them to celebrate. We're looking forward to 50 more years!", "2019-06-25T18:38:57.000Z": "It was my honor to welcome Dr. Vanila Singh from @HHSGov , an expert on pain management, and hear her testimony in front of the House Opioid Abuse Prevention Study Committee as we continue to work towards the best solutions for fighting the silent hurricane of opioid addiction.", "2019-06-24T20:42:00.000Z": "SC Gov. @henrymcmaster signed the first ever \"Children's Internet Safety Governor's Pledge\" last week. Thank you again, Gov. McMaster! SC Governor Signs Pledge Making Children's Internet Safety 'Top Priority' cbn.com", "2019-06-20T20:02:34.000Z": "Today I issued an executive order directing every cabinet agency to conduct a thorough review of their open records policies, practices, and procedures utilizing the inspector general's findings and recommendations to make any necessary amendments or adjustments. Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster, S.C. Inspector General Release Study on State Agency Open Records Practices | Gov. McMaster Issues Executive Order Directing all Cabinet Agencies to Adopt Best Practices Based on Study https:// governor.sc.gov/news/2019-06/g ov-henry-mcmaster-sc-inspector-general-release-study-state-agency-open-records ", "2019-06-20T13:08:02.000Z": "Today I'm standing with governors across the United States to urge Congress to pass the USMCA, a much needed modernization of trade policy with our neighbors. Quote Tweet The RGA @The_RGA Breaking: Republican Governors Unanimously Urge Congress To Pass #USMCA => https:// rga.org/republican-gov ernors-unanimously-urge-congress-to-pass-usmca/ ", "2019-06-19T18:08:37.000Z": "Meeting of the South Carolina Public Service Authority Advisory Board SC Governor Press @scgovernorpress Meeting of the South Carolina Public Service Authority Advisory Board", "2019-06-19T16:51:15.000Z": "The Children's Internet Safety Governor's Pledge shows that Team South Carolina is committed to redoubling our efforts to protect our young people and vulnerable adults. Read more about it here: https:// governor.sc.gov/news/2019-06/g ov-henry-mcmaster-announces-and-signs-childrens-internet-safety-governors-pledge  (2/2)", "2019-06-19T16:51:13.000Z": "Internet safety is one of our biggest concerns when it comes to protecting the health and well-being of our children. Despite years of efforts, the increasing use of the Internet has enabled offenders to reach and abuse children online, and in many cases, avoid detection. (1/2)", "2019-06-19T16:28:12.000Z": "This meeting will be streamed live via this twitter account. Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster, South Carolina Public Service Authority Advisory Board to Hold Public Meeting https:// governor.sc.gov/news/2019-06/g ov-henry-mcmaster-south-carolina-public-service-authority-advisory-board-hold-public ", "2019-06-17T14:59:00.000Z": "Proud to see almost 300 South Carolinians come together for the Governor's Floodwater Commission cleanup day this past weekend -- removing debris, clearing ditches & making efforts for erosion control. SC continues to show the world that our people make the difference. #TeamSC", "2019-06-17T19:11:12.000Z": "We were proud to join Gov. @henrymcmaster 's SC Floodwater Commission, Lt. Gov. @PamelaEvette , @SCDOTPress , @state_guard , @ForestryCommish & volunteers to help w/ cleanup efforts in the Town of Nichols. Volunteers worked all day clearing debris from previous floods. #TeamSC", "2019-06-18T00:37:50.000Z": "Four years ago this evening we lost 9 live at Mother Emanuel. The days that followed that darkest of nights showed the world that South Carolina is a different place with special people.", "2019-06-17T19:42:42.000Z": "Thank you to the hundreds of volunteers who answered the call to help our neighbors in Nichols this weekend. Your work not only helped clean up debris from previous flooding, but will also help mitigate future flooding, something we aim to replicate across South Carolina.", "2019-06-14T17:15:00.000Z": "Thank you to everyone who has signed up to volunteer at the S.C. Floodwater Commission Nichols Cleanup Day tomorrow. We still have a few slots open if you are available to come and help us. http:// bit.ly/NicholsCleanup", "2019-06-14T13:15:05.000Z": "Show you care about others affected by floods in Nichols @SCLeaders help lend a hand @henrymcmaster  #nicholscleanup Quote Tweet Gov. Henry McMaster @henrymcmaster This Saturday's Nichols cleanup volunteer day will serve as a model to be replicated around the state. If you are able to volunteer this week please click here and sign up for a slot  http:// bit.ly/NicholsCleanup", "2019-06-13T18:22:01.000Z": "As we dream of and work towards a world without Alzheimer's, it is important to recognize, thank, and support those around us who are caring for family members and developing a cure. That's why I'm proclaiming June as \"Alzheimer's and Brain Awareness Month\" in SC. #endALZ", "2019-06-13T17:10:00.000Z": "This Saturday's Nichols cleanup volunteer day will serve as a model to be replicated around the state. If you are able to volunteer this week please click here and sign up for a slot  http:// bit.ly/NicholsCleanup", "2019-06-12T17:05:00.000Z": "#TeamSouthCarolina always responds to disasters, such as flooding, by making sure we help our neighbors in need. This Saturday we are going to be serving our neighbors in Nichols who have been affected by multiple floods. \n\nVolunteer signup  http:// bit.ly/NicholsCleanup", "2019-06-11T17:01:00.000Z": "This Saturday our volunteer day in Nichols will not only help clean up debris from previous floods, but also mitigate some flooding issues for future events. We are still in need of volunteers, especially heavy duty workers. Please click here to sign up: http:// bit.ly/NicholsCleanup", "2019-06-11T14:01:27.000Z": "I had the honor of welcoming leaders from the @SecretService National Threat Assessment Center to South Carolina as they share their expertise used to detect threats and protect the President with law enforcement officers who are protecting the children in our schools.", "2019-06-10T17:51:00.000Z": "The small town of Nichols has been impacted by devastating flooding twice in the last three years. Please join me, the South Carolina Floodwater Commission, and others in signing up to volunteer this Saturday. Click to view our needs: http:// bit.ly/NicholsCleanup", "2019-06-06T23:09:02.000Z": "", "2019-06-05T17:56:17.000Z": "#TwoStatesOneTeam Quote Tweet Carolina Panthers @Panthers Inked and official for @RockHillSCCity", "2019-06-05T17:54:33.000Z": "Thank you to everyone who came out to celebrate the @Panthers with us in @RockHillSCCity ! We are excited about the plans that Mr. Tepper and his team have in store for South Carolina and couldn't be happier to work with them. #TwoStateOneTeam  #KeepPounding", "2019-05-31T15:50:58.000Z": "We hope you can join us next Wednesday morning at Fountain Park in @RockHillSCCity .", "2019-05-31T14:58:07.000Z": "Gov @henrymcmaster & the SC Floodwater Commission are collaborating on a cleanup day in the Town of #Nichols on June 15. The intent is to clear debris from past storms & mitigate future flood risks. Join the effort today  http:// bit.ly/2HJYqj1  #TeamSC  #SCTweets", "2019-05-28T22:20:39.000Z": "It isn't every day that you get to meet a best-selling author, especially one who hasn't even started middle school yet. Jakayla Green, student at Bethel-Hanberry Elementary School and author of \"Daddy's Girl\" was one of the 2019 Young Entrepreneur Award winners.", "2019-05-28T13:52:30.000Z": "I had the privilege of welcoming judge advocates from the S.C. National Guard and the Colombian military during part of their #StatePartnershipProgram activities.", "2019-05-27T14:21:52.000Z": "This #MemorialDay please take a moment in your day to remember and be thankful for those who gave their lives in service of our country.", "2019-05-24T19:19:59.000Z": "Please help me say thank you to a great SC company, @USPatriotTac , for their generous donation of an active shooter vest kit for every district in the state. It is vital that we do everything we can to protect our SROs as they protect our most precious asset-our children.", "2019-05-23T18:08:54.000Z": "Sheriff Lott, Gov. @HenryMcMaster and @USPatriotTac announce the donation of dozens of active shooter vest kits for all school districts of South Carolina", "2019-05-22T16:10:38.000Z": "This week as we welcome @CASA_Army to SC, I had the honor of hosting them at the Governor's Mansion. My cabinet directors and I wanted to use this opportunity to renew our commitment to those who serve in our agencies and in uniform by signing the @ESGR Statement of Support.", "2019-05-21T20:23:15.000Z": "I was proud today to sign the South Carolina Energy Freedom Act to unleash our growing solar industry. Thank you to @petermccoyforsc , @senatortomdavis , and everyone else who worked hard to make this day possible.", "2019-05-19T15:57:57.000Z": "Aiken County has lost one of its most loyal and beloved public servants.  Representative Ronnie Young's mortal body could not keep pace with his indomitable spirit and tireless service. In his honor, Statehouse flags will be lowered half-staff on the day of his funeral.", "2019-05-16T15:57:45.000Z": "I recently had the privilege of visiting Academic Magnet High School in North Charleston to discuss with Principal Catherine Spencer what makes her School different. They were named the #1 high school in America by @usnews and are a shining example of which we are very proud.", "2019-05-15T18:52:52.000Z": "South Carolina has worked for several years to develop a comprehensive framework to protect our shared coastal resources. It would be unwise to hastily enact a special exemption to the Beachfront Management Act. Quote Tweet SC Governor Press @scgovernorpress Veto Message: H. 3700 Georgetown County Beachfront Management Act Exemption https:// governor.sc.gov/sites/default/ files/Documents/Veto-Messages/2019-05-15%20H.%203700%20Veto%20Message.pdf ", "2019-05-14T15:29:14.000Z": "This week we celebrated the groundbreaking of @LonzaGroup 's $46 million expansion in Greenwood.", "2019-05-09T18:28:29.000Z": "This vote sends a resounding message to the world that South Carolina is committed to creating the most competitive business environment in the world so that South Carolinians can benefit from jobs created by great organizations like the @Panthers . #SCStrong  #KeepPounding Quote Tweet Avery Wilks @AveryGWilks NEW: SC Senate votes 27-15 to offer $115 million in tax breaks to bring the @panthers 's HQ and practice facilities to South Carolina. Bill is very close to becoming law https:// thestate.com/news/politics- government/article230080214.html ", "2019-05-09T14:24:51.000Z": "Thank you Governor @henrymcmaster for proclaiming May as NF Awareness Month in #SouthCarolina ! #endnf", "2019-05-08T14:17:42.000Z": "May is \"Military Spouse Appreciation Month\" in South Carolina, a special time to remember and thank those who serve alongside and support our men and women in uniform.", "2019-05-08T13:50:38.000Z": "With Director Ellzey's experienced leadership, I'm confident that DEW and the statewide SC Works system will continue to connect these heroes with potential employers. (2/2)", "2019-05-08T13:50:37.000Z": "There is no state more committed to the men and women who sacrificed everything to serve in the line of duty than South Carolina. The fact that they are benefiting from our state's growing economy, along with the rest of our citizens, is news that we can all celebrate. (1/2) Quote Tweet SC Governor Press @scgovernorpress South Carolina's Veteran Unemployment Rate Dropped Significantly in 2018 https:// governor.sc.gov/news/2019-05/s outh-carolinas-veteran-unemployment-rate-dropped-significantly-2018 ", "2019-05-07T14:45:54.000Z": "I'm proud to proclaim this week \"Correctional Officers' Week\" in South Carolina to recognize the hard work of all of the men and women who serve in our Department of Corrections.", "2019-05-06T20:39:13.000Z": "Ms. Whittle's broad professional legal experience, as well as her leadership roles on the state and local level, make her uniquely qualified to serve in this position protecting our state's children. (2/2)", "2019-05-06T20:39:12.000Z": "Last year, I was honored to sign into law legislation that created the Department of Children's Advocacy, and today, I'm proud to nominate Amanda Whittle to serve as South Carolina's first State Child Advocate. (1/2) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Announces South Carolina's First State Child Advocate |\nAmanda F. Whittle to Lead the New S.C. Department of Children's Advocacy https:// governor.sc.gov/news/2019-05/g ov-henry-mcmaster-announces-south-carolinas-first-state-child-advocate-0 ", "2019-05-02T22:02:09.000Z": "Director Sara Goldsby and her @scDAODAS team are doing a phenomenal job in educating the public. Following an aggressive #JustPlainKillers campaign they saw a record smashing amount of expired prescription drugs on last week's national #TakeBackDay .", "2019-05-01T19:05:17.000Z": "My message to the General Assembly on education reform hasn't changed. #SCforEd", "2019-04-30T15:21:03.000Z": "I want to thank Army Ranger and S.C. State Rep. @BobbyCoxSC and S.C. Sen. @KatrinaShealy for their leadership in the House and Senate respectively in getting this bill through their chambers and to my desk.", "2019-04-30T15:18:47.000Z": "Today I signed a bill to elevate the South Carolina Department of Veterans Affairs to a cabinet level agency. We have a strong military tradition in our state and this change better reflects how we value those who have served.", "2019-04-26T18:53:58.000Z": "Today I had the privilege of welcoming 100-year-old WWII veteran Sidney Walton to the Governor's Mansion as part of his nationwide No Regrets Tour.", "2019-04-25T19:03:45.000Z": "Great news! #SCwinning Quote Tweet The Hill @thehill JUST IN: Trump officials halt controversial plans to expand offshore drilling in the Atlantic http:// hill.cm/KSzyHsP", "2019-04-23T21:22:13.000Z": "South Carolina's strong military spirit and aerospace manufacturing excellence meet together at Lockheed-Martin in Greenville. Today we cut the ribbon on their new F-16 production facility, where they will be making one of the most advanced fighter jets in the world.", "2019-04-19T21:10:28.000Z": "Good idea. Let's go further and review 6 more years for a full 16 year review of job creation numbers at @SCcommerce Quote Tweet The Post and Courier @postandcourier The bipartisan group of lawmakers requested an audit of 10 years worth of incentive packages the state regularly extends to corporations to get them to relocate here. http:// bit.ly/2KT6RvR", "2019-04-19T14:54:18.000Z": "Be on the lookout for severe weather today. It's important to stay aware. #scwx  #sctweets   Sign up for CodeRed alerts at http:// scemd.org . Stay tuned to local weather. Follow @NWSColumbia , @NWSCharlestonSC , @NWSGSP and @NWSWilmingtonNC .", "2019-04-17T17:14:16.000Z": "There are many reasons, from our pristine marshes to our fishing industry to tourism, that South Carolina does not need and does not want seismic testing or drilling along our coastline. I fully support @SenatorCampsen 's budget proviso to ban their permitting in our state.", "2019-04-15T16:21:55.000Z": "NOTE: Monday, April 15, 5:00 PM:  Gov. McMaster and First Lady Peggy McMaster will participate in the departure ceremony of Sen. Ernest F. \"Fritz\" Hollings from the State House, Southside steps, Columbia, S.C. Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster and Lt. Gov. Pamela S. Evette's Weekly Schedule: April 15, 2019 https:// governor.sc.gov/news/2019-04/g ov-henry-mcmaster-and-lt-gov-pamela-s-evettes-weekly-schedule-april-15-2019 ", "2019-04-15T14:24:22.000Z": "Today we pay our respects to Sen. Hollings. The flags atop the State House are flying at half staff as he lies in state under the dome. South Carolina is a better place because of him, and he will be missed.", "2019-04-14T21:13:55.000Z": "Good people like Captain Bryant are the ones who make South Carolina proud. We're all happy that Rocky now has a forever home. 14/10 a heartwarming story. Quote Tweet ABC News @ABC \"This is meant to be. He's my dog, and he's coming home with me.\" A South Carolina firefighter reunites with a puppy he rescued trapped beneath a pile of rocks, and gives his new best friend-Rocky-a forever home. https:// abcn.ws/2Kq5eFB", "2019-04-13T13:37:58.000Z": "The ability to pardon students for absence from school when they come to the office for an official visit is one of the lesser known powers of the Governor.", "2019-04-12T21:20:37.000Z": "Thanks to @keselowski and @TooToughToTame for coming by the mansion yesterday to celebrate #DarlingtonDay . We're excited about the @Bojangles1977  #Southern500 coming up on Labor Day weekend again this year.", "2019-04-11T16:03:28.000Z": "Thank you Governor @govhenrymcmaster for having our outstanding ROTC cadets meet with you at the State House! Quote Tweet Gov. Henry McMaster @henrymcmaster Thank you to the cadets from @SCSTATE1896 ROTC for taking the time to grab a quick photo during your State House visit-it was an honor!", "2019-04-11T20:12:53.000Z": "Maj. Gen. Van McCarty, @TAGSCUSA, joined SC Gov. @henrymcmaster at the State House April 11, for the proclamation reading recognizing April as the Month of the Military Child in South Carolina ( by Capt. Jessica Donnelly) #TeamSC  #SCGuard  #MOMC  #MonthOfTheMilitaryChild", "2019-04-11T20:56:59.000Z": "Thanks @keselowski for visiting Columbia, SC today to support Darlington Raceway and the #BojanglesSo500 ! We had a great time with @henrymcmaster at the SC Governor's Mansion.", "2019-04-12T14:34:15.000Z": "Little Mac didn't want to miss the excitement as we celebrated Darlington Day at the mansion. Mark your calendars, the Bojangles Southern 500 returns to the Lady in Black this Labor Day weekend.", "2019-04-11T14:50:25.000Z": "Thank you to the cadets from @SCSTATE1896 ROTC for taking the time to grab a quick photo during your State House visit-it was an honor!", "2019-04-10T20:59:36.000Z": "Hemp is a crop with many uses across a wide array of industries. Today I signed a bill expanding South Carolina's hemp program, removing the limits on the number of farmers who can grow it and the number of acres each of them can grow.", "2019-04-10T18:55:19.000Z": "The Department of Employment and Workforce is uniquely situated between the state's workforce and its businesses seeking qualified employees and is one of the many reasons South Carolina is considered one of the best places in the world to do business. (2/3)", "2019-04-10T18:55:18.000Z": "Dan Ellzey is widely recognized as one of the most experienced and accomplished employment and labor attorneys in South Carolina and is eminently qualified to lead this critically important state agency. (1/3) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Names the Next Director of the S.C. Department of Employment and Workforce https:// governor.sc.gov/news/2019-04/g ov-henry-mcmaster-names-next-director-sc-department-employment-and-workforce ", "2019-04-09T16:17:28.000Z": "This past Friday, the @SCcommerce international team had the honor of meeting Gov. @henrymcmaster as part of 2019 #InternationalWeek . Our global team members work hard to promote South Carolina on the international stage as 'Just right' for business! #TeamSC", "2019-04-08T17:24:27.000Z": "South Carolina's great military tradition, anchored in no small part by the Citadel, is one of the things that sets us apart from other states. I was honored to speak at the inauguration of Gen. Glenn Waters, the 20th president of the Military College of South Carolina.", "2019-04-08T17:13:40.000Z": "South Carolina is proud to host the largest women's-only tennis tournament in the world, the @VolvoCarOpen on Daniel Island. Congratulations to singles winner Madison Keys and doubles winners Anna-Lena Grönefeld and Alicja Rosolska.", "2019-04-06T14:03:34.000Z": "The greatness and success of this state has benefited from the hand of his leadership. Peggy and I are heartened at his reunion with Peatsy and offer our prayers and condolences to the family. (2/2)", "2019-04-06T14:03:33.000Z": "One of South Carolina's greatest lions roars no more. Fierce, bold, and robust - the sounds of Fritz Hollings' vision and drive for the Palmetto State will continue to be heard by generations. (1/2)", "2019-04-04T19:46:31.000Z": "BMW doesn't only create jobs at their manufacturing plant, but they also spur job creation across the state and region via their suppliers. I enjoyed speaking at their suppliers conference today about South Carolina's commitment to excellence and business friendliness.", "2019-04-01T20:11:45.000Z": "Our children are a gift from God and no child should ever be threatened, abused or victimized. I was honored to stand with our governor, @ChildrensTrustS , and other child advocates during this morning's Child Abuse Prevention Month press conference. #ChildAbusePreventionMonth", "2019-04-01T18:18:31.000Z": "Gov. @henrymcmaster proclaimed April as Child Abuse Prevention Month. It stated the seriousness of child abuse as a public health issue and promoted the importance of statewide & community prevention programs as the best way to reduce abuse. Read here: https:// bit.ly/2Vc5KYO", "2019-04-01T20:25:06.000Z": "Thank you, Gov. @henrymcmaster , for your support of Children Abuse Prevention Month. #GreatChildhoods  #Good4SCkids", "2019-04-01T19:56:37.000Z": "Proud to stand with @ChildrensTrustS and proclaim April \"Child Abuse Prevention Month.\" We need to have a full assault of education, information, collaboration, cooperation, sympathy, and understanding in order to eradicate the scourge of child abuse in South Carolina.", "2019-03-30T23:39:15.000Z": "I ask every South Carolinian to join us in praying for the Josephson family. \n\nLet us also pray for the men and women of law enforcement as they fight to bring evil to justice. (2/2)", "2019-03-30T23:38:59.000Z": "Peggy and I are devastated and crushed over the Josephson family losing their beautiful daughter Samantha. She was one of the brightest young stars at @uofsc . (1/2)", "2019-03-29T19:46:23.000Z": "Vietnam War Veterans Day gives us all the opportunity to say \"Thank you\" and \"Welcome home\" to all of the men and women who served in our armed forces in Vietnam.", "2019-03-29T13:18:29.000Z": "It's no surprise that a company that is built upon the values of faith and family with a commitment to precision and excellence is thriving. I was thrilled to visit Nutramax to celebrate the groundbreaking for their expansion that will create more than 200 new jobs in Lancaster.", "2019-03-28T18:58:47.000Z": "We will be holding a commemoration event to honor our Vietnam veterans in South Carolina tomorrow on the north steps of the State House at 11 AM. I encourage everyone to who can attend to join us. Quote Tweet VietnamWar50th @vietnamwar50th Major General Jim Jackson, U.S. Army (RET), Director of The United States of America Vietnam War Commemoration, delivers a message for\nNational Vietnam War Veterans Day 2019. https:// vietnamwar50th.com/videos/nationa l_vietnam_war_veterans_day_2019directors_message/ ", "2019-03-27T20:25:45.000Z": "Happy to recognize the good work that Nora and other Brain Injury Specialists do across our state! Quote Tweet REACHProgram @REACHProgram Did you know March is National Brain Injury Awareness Month? And did you know our freshman coordinator, Nora Krasowski, is a certified Brain Injury Specialist? Thank you SC Governor @henrymcmaster for recognizing Nora's valuable contributions to the lives of our students!", "2019-03-27T17:57:25.000Z": "and has faced, while striving to deliver positive solutions to many not so positive situations. I am proud to nominate  Michael Leach to be the next director of the South Carolina DSS. (2/2)", "2019-03-27T17:57:24.000Z": "This is a very important day. It is clear that transformative leadership is required in South Carolina to resolve the daunting and frustrating issues that the Department of Social Services faces, (1/2/)", "2019-03-27T13:46:39.000Z": "We're proud that tech innovators like @Benefitfocus call South Carolina home. I was happy to speak at their #OnePlace conference and welcome people from all across the country to Charleston.", "2019-03-26T21:12:50.000Z": "Gov. Henry McMaster to Make a Cabinet Announcement", "2019-03-26T21:08:47.000Z": "Sometimes you gotta keep the young bucks up to date on the latest tech. I'm happy to report that Cody know how to use @Shazam now.", "2019-03-25T16:13:49.000Z": "I even had the opportunity to stop by a @CATSRideTransit Lynx station on the way back to South Carolina, and look forward to working with leaders on both sides of the state line to extend light rail to Rock Hill, a key transportation solution as the region grows.", "2019-03-25T16:13:48.000Z": "Thank you @PartnersSouth for allowing me to speak on the importance of collaboration, communication, and cooperation in the future prosperity of the Charlotte-Rock Hill region, one of the fastest growing in the US.", "2019-03-22T14:21:41.000Z": "We're excited to welcome #MarchMadness to South Carolina today. Thanks to @JayPhilips1075 for having me on @1075thegame to chat about hosting the tournament here in our capital. You can check out the full interview here: https:// omny.fm/shows/halftime /3-20-governor-henry-mcmaster ", "2019-03-21T15:52:46.000Z": "In the last twenty-four hours, the General Assembly has made historic progress toward protecting South Carolina ratepayers and taxpayers. Speaker Lucas has shown tremendous leadership and... (1/2) Quote Tweet Avery Wilks @AveryGWilks NEW: A day after Senate President @harveypeeler called for the sale of Santee Cooper, top House leaders have filed their own proposal that would work toward the sale of the state-owned utility https:// thestate.com/news/politics- government/article228195634.html ", "2019-03-20T16:34:07.000Z": "Jonathan Green is a world-renowned artist from our own back yard known for his work that showcases and seeks to preserve Gullah culture for generations to come. I'm honored to have the opportunity to confer upon him the Order of the Palmetto on behalf of a very proud state.", "2019-03-20T16:16:51.000Z": "We've known all along that the one thing we can't afford is inaction. This bold and necessary step moves us closer to the resolution of one of the state's most pressing and impactful issues.", "2019-03-20T16:16:50.000Z": "By introducing this legislation, President Peeler is showing clear and decisive leadership in response to a thoughtful, deliberate, and ongoing process to determine the value of Santee Cooper and the best way to protect South Carolina's ratepayers. Quote Tweet Andy Shain @AndyShain BREAKING: New legislation would let Gov. @henrymcmaster sell Santee Cooper #scpol  https:// postandcourier.com/politics/legis lation-would-let-gov-mcmaster-decide-whether-to-sell-santee/article_dd690738-4b11-11e9-9459-879c4b358239.html ", "2019-03-14T18:55:34.000Z": "Thank you @SCDOTPress for getting out there and helping to keep our state clean! Great thread of photos from all across South Carolina. Quote Tweet SCDOT @SCDOTPress Please use caution as necessary as SCDOT employees across the state will be doing their part today in cleaning up litter along South Carolina highways. It's our annual #SpringSpruceUp twitter.com/SCDOTPress/sta Show this thread", "2019-03-13T20:34:57.000Z": "An open, accountable, and accessible government and a well-informed public are vital to a thriving democratic society. I'm proud to proclaim this week as \"Sunshine Week\" in South Carolina.", "2019-03-12T21:17:21.000Z": ". @realDonaldTrump 's continued commitment to seeing @SCPorts Charleston reach its full potential will help facilitate unprecedented economic growth in South Carolina. (1/2) Quote Tweet The Post and Courier @postandcourier Digging Charleston Harbor to a 52-foot depth is necessary to accommodate bigger ships carrying more cargo to and from the region. http:// bit.ly/2F0F1Yf", "2019-03-12T18:24:54.000Z": "It was my pleasure to meet with the Girl Scouts serving as House pages during budget week. I was proud to show them the photos of the women of the General Assembly who have served as role models of public service and leadership.", "2019-03-11T20:30:51.000Z": "Today I had the pleasure of shaking the hand of Yula Mae Cummings of Florence and wishing her a happy 104th birthday!", "2019-03-08T22:24:47.000Z": "Today the flags are flying at half staff to honor an American hero- WWII veteran former Sen. Billy C. Coleman. Quote Tweet SC Governor Press @scgovernorpress Governor Henry McMaster orders that the flags atop the State Capitol Building be lowered to half-staff from sunrise until sunset on Friday, March 8, 2019, (1/2) Show this thread", "2019-03-07T15:12:21.000Z": "This week marked our first cabinet meeting at which the Lt. Governor and Adjutant General have had a seat at the table. Welcome to the team Lt. Governor Evette and General McCarty!", "2019-03-06T14:41:55.000Z": "Today the SC House will take the first bold step toward transforming our K-12 education system. I stand with @schousespeaker - the time to act is now.  Passing this comprehensive reform will keep South Carolina competitive for jobs, talent, and investment. #SCWinning", "2019-02-28T14:41:43.000Z": "We are forever grateful for the work @HarvestHopeFB does during natural disasters to help keep our families fed, and thank the many donors and community partners that enable them to do so much good.", "2019-02-26T21:28:54.000Z": "Celebrating excellence today with Clemson Day at the State House. I was honored to present Coach Dabo Swinney with the flag that flew above the dome to celebrate the Tigers' national championship win.", "2019-02-22T17:23:53.000Z": "General Van McCarty is a great man and soldier, and I was honored to have the opportunity to pass the flag of command to him to lead our National Guard troops as the new Adjutant General of South Carolina.", "2019-02-20T16:29:33.000Z": "This is a great example of the work Director Freddie Pough is doing at the Department of Juvenile Justice to help young people who have been incarcerated find a new, productive path forward in their lives. Quote Tweet SCDJJ @SCDJJPIO DJJ, @Michelin Partner to Put Youth to Work in @CountyLex - https:// mailchi.mp/91cd173aaccc/d jj-michelin-partner-to-put-youth-to-work   @MichelinUSA  #scjobs  #empoweringyouth", "2019-02-19T19:00:59.000Z": "It is important that our veterans, through a cabinet agency, have the status, attention, and focus they have earned through their service to our state and country. (2/2)", "2019-02-19T19:00:58.000Z": "\"Our history in South Carolina is all about the military. It is time to pass this legislation. This is one of those things we don't need to study any longer. It is important to the Pentagon. It is important to our defense. (1/2) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster, Veterans, Members of S.C. General Assembly Call for Cabinet-level Division of Veterans Affairs https:// governor.sc.gov/news/2019-02/g ov-henry-mcmaster-veterans-members-sc-general-assembly-call-cabinet-level-division ", "2019-02-15T20:01:26.000Z": "Happy 10 year anniversary to Google in South Carolina. Think big, think positive, and South Carolina will go straight to the top!", "2019-02-14T21:16:55.000Z": "To regain and maintain Richland County voters' confidence at the ballot box, the entire board must be replaced with new leadership. (2/2)", "2019-02-14T21:10:22.000Z": "South Carolinians' confidence in the lawful and professional oversight of elections must never be jeopardized. The repeated actions and behavior of these officials are wholly unacceptable and cannot be tolerated. (1/2) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Removes Entire Richland County Election Board https:// governor.sc.gov/news/2019-02/g ov-henry-mcmaster-removes-entire-richland-county-election-board ", "2019-02-14T16:42:30.000Z": "Thank you @RepJeffDuncan , @RepRalphNorman , @RepJoeWilson , @RepTomRice , and @reptimmons for your support! Quote Tweet Rep. Jeff Duncan @RepJeffDuncan Recently sent a letter to CMS w/ Members of the SC delegation in the House to show support for Governor McMaster's request for a waiver to exclude abortion providers from Medicaid. Thank you to @RepRalphNorman , @RepJoeWilson , @RepTomRice , & @reptimmons for signing on!", "2019-02-13T22:26:15.000Z": "There are few things that can compare to the unconditional love of a dog. That's why Peggy and I were proud to join Pawmetto Lifeline and veteran groups this morning to announce \"Boots In Service\" a program to help house and care for veterans' dogs while they are (1/2)", "2019-02-12T20:13:00.000Z": "Drunk driving is a preventable and deadly crime. Interlocks are proven to reduce repeat DUI offenses and save lives. (1/2)", "2019-02-11T20:16:40.000Z": "We had another great meeting last week and had an opportunity to tour Charleston's drainage project. Thank you @JohnTecklenburg ! (2/2) Governor McMaster Tours Charleston Floodwater Tunnel youtube.com", "2019-02-11T20:16:39.000Z": "We created the S.C. Floodwater Commission because we know how important it is to address flooding across the state in a comprehensive and collaborative way. (1/2)", "2019-02-06T03:29:57.000Z": "Tonight, @realDonaldTrump once again asked Congress to work with him to achieve great things for America. It's time to put partisan politics aside to ensure our national security, protect American workers, and to overhaul our broken immigration system.", "2019-02-05T14:37:40.000Z": "As you look up and see the flags at half staff today please take a moment to remember Rep. Irene Krugman Rudnick, who served our state in various capacities for decades, most notably as the first Jewish woman in the General Assembly. Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster orders that the flags atop the State Capitol Building be lowered to half-staff from sunrise until sunset on Tuesday, February 5, 2019, in honor of former Rep. Irene Krugman Rudnick. http:// adminapps.sc.gov/GS/GS-flags-st atus.phtm?AutoID=497 ", "2019-02-01T23:55:28.000Z": "This is a historic moment. There is no longer any significant reason to delay action needed to solve the Santee Cooper crisis. (1/2) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster, Co-Chairmen of Santee Cooper Study Committee Release Report on Initial Offers to Purchase Santee Cooper https:// governor.sc.gov/news/2019-02/g ov-henry-mcmaster-co-chairmen-santee-cooper-study-committee-release-report-initial ", "2019-01-31T18:02:34.000Z": "The collaboration that has gone into creating and updating South Carolina's Opioid Emergency Response Plan is a tremendous example of what Team South Carolina can do when we work together. (1/2) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Releases Opioid Emergency Response Plan Progress Report |\nS.C. Opioid Emergency Response Team Completes First Update to Comprehensive Report https:// governor.sc.gov/news/2019-01/g ov-henry-mcmaster-releases-opioid-emergency-response-plan-progress-report ", "2019-01-30T16:25:21.000Z": "I enjoyed the opportunity to meet with student body presidents from USC campuses across the state here for Carolina Day at the State House.", "2019-01-28T15:55:10.000Z": "I was happy to join our own Tim Scott to discuss the impact that his Opportunity Zones  legislation will have on South Carolina. Opportunity Zones are designed to spur investment in our most impoverished communities. Quote Tweet SC Governor Press @scgovernorpress Video: Governor McMaster Speaks at Opportunity Zones Summit https:// youtube.com/watch?v=7VumFP ZVCtQ ", "2019-01-24T01:04:07.000Z": "All of us do not wear the same jersey, but we are still on the same team. We'll work together to ensure that future generations of South Carolinians are able to keep winning and prospering.\n\nNow is the time to be bold, not bashful. Now is the time to act together. This year. Now. Quote Tweet SC Governor Press @scgovernorpress State of the State Address\nAs Prepared for Delivery https:// governor.sc.gov/news/2019-01/s tate-state-address-prepared-delivery ", "2019-01-22T21:23:32.000Z": "Kevin Shwedo knows the importance of customer service at the Department of Motor Vehicles and has a passion for making sure each and every South Carolinian who walks in the door has a productive and efficient experience. Quote Tweet SC Governor Press @scgovernorpress Kevin Shwedo to Continue Leading S.C. Department of Motor Vehicles https:// governor.sc.gov/news/2019-01/k evin-shwedo-continue-leading-sc-department-motor-vehicles ", "2019-01-21T15:45:58.000Z": "As we celebrate what would have been Dr. King's 90th birthday let us remember his vision of treating all people equally, with respect and dignity, and renew our commitment to realizing that vision.", "2019-01-18T19:59:10.000Z": "Because of Director Adger's innovative thinking, SCDPPPS has carried out its mission of  protecting the public, rehabilitating those under its supervision, and serving victims more effectively than ever before - all while saving taxpayer money. (2/2)", "2019-01-18T19:59:09.000Z": "Jerry Adger's leadership has been the linchpin in transforming South Carolina's Department of Probation, Parole and Pardon Services into one of the most widely respected probation agencies in the country. (1/2) Quote Tweet SC Governor Press @scgovernorpress Director Jerry Adger to Continue Leading S.C. Department of Probation, Parole and Pardon Services https:// governor.sc.gov/news/2019-01/d irector-jerry-adger-continue-leading-sc-department-probation-parole-and-pardon ", "2019-01-18T17:26:09.000Z": "Proud to display a recognition of all of the women who have served our state in the General Assembly for all of the visitors who come into my office.", "2019-01-17T20:24:57.000Z": "I appreciate deeply the help and guidance I received from General Livingston in making this selection. After a thorough search, it is clear that the man to lead our National Guard at this time is General McCarty. (2/2)", "2019-01-17T20:24:49.000Z": "General McCarty is quite a man and quite a soldier. He's been overseas in combat. He's served our country well. He serves our state well. (1/2) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Announces South Carolina's Next Adjutant General https:// governor.sc.gov/news/2019-01/g ov-henry-mcmaster-announces-south-carolinas-next-adjutant-general ", "2019-01-17T14:41:04.000Z": "Proposals to offer more spending flexibility to school districts merit consideration. (2/2)", "2019-01-17T14:40:56.000Z": "Reforming the education funding formula is a necessary step to ensure more equitable distribution of dollars to South Carolina's school districts. The formula must meet the requirements of the 21st century economy and a 21st century education. (1/2) Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster, Senate President Harvey Peeler, House Speaker Jay Lucas Request State Agency to Develop New Education Funding Formula https:// governor.sc.gov/news/2019-01/g ov-henry-mcmaster-senate-president-harvey-peeler-house-speaker-jay-lucas-request ", "2019-01-16T20:05:44.000Z": "The Department of Revenue is in the customer service business, and it has never served South Carolinians better or more efficiently than it has under Hartley Powell. Quote Tweet SC Governor Press @scgovernorpress Director Hartley Powell to Continue Leading S.C. Department of Revenue https:// governor.sc.gov/news/2019-01/d irector-hartley-powell-continue-leading-sc-department-revenue ", "2019-01-16T16:27:00.000Z": "Please help us welcome our 2019 SC Chef Ambassadors: \nBrandon Carter, @FarmBluffton (Bluffton)\nMarc Collins, @Circa1886 (Charleston)\nTania Harris, @thelazygoat (Greenville)\nJessica Shillato, @Spottedsalama (Columbia)\nKelly Vogelheim, @TownHallFlo (Florence) #SCCA19", "2019-01-16T16:50:42.000Z": "I was happy to join @SCPRT and @SCDAgriculture to announce our new class of South Carolina Chef Ambassadors. We are proud of the work that the ambassadors to to spread the knowledge of our wonderful, diverse cuisine around the world. Quote Tweet Certified South Carolina @Certified_SC Please help us welcome our 2019 SC Chef Ambassadors: \nBrandon Carter, @FarmBluffton (Bluffton)\nMarc Collins, @Circa1886 (Charleston)\nTania Harris, @thelazygoat (Greenville)\nJessica Shillato, @Spottedsalama (Columbia)\nKelly Vogelheim, @TownHallFlo (Florence) #SCCA19", "2019-01-15T22:02:39.000Z": "I've asked the legislature to invest in education, economic development, our environment, the taxpayers themselves in the form of a rebate, and more. Please take a few minutes to read more on these proposals. Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Unveils Fiscal Year 2019-20 Executive Budget https:// governor.sc.gov/news/2019-01/g ov-henry-mcmaster-unveils-fiscal-year-2019-20-executive-budget ", "2019-01-10T18:39:58.000Z": "This is great news not only for the Lowcountry, but for all of South Carolina. It is a perfect example of what we can do when we open lines of communication and (1/2) Quote Tweet The Post and Courier @postandcourier NEW: State bank approves new deal to complete Interstate 526 over James and Johns islands\n\nStory: http:// bit.ly/2TKtnXz  #chsnews  #scpol", "2019-01-09T17:57:51.000Z": "Words cannot express the pride and joy I have to be the governor of the great state of South Carolina. It is exhilarating and humbling. An honor and a privilege. My family and I thank you.", "2019-01-08T14:53:17.000Z": "The excellence of South Carolina was on full display last night. Congratulations to Coach Dabo Swinney and the Clemson Tigers on bringing another national championship home to the Palmetto State.", "2019-01-04T16:35:32.000Z": "Moffatt Burriss is one of the finest leaders our state and nation has ever produced. His family is one of the finest families I have ever known. He delivered freedom to people around the world and made the lives of those he touched better and safer. (1/2)", "2019-01-04T16:08:40.000Z": "Bryan Stirling is the most innovative and effective director ever to lead our state corrections system, and his passion and relentlessness is recognized across the nation. (1/2) Quote Tweet SC Governor Press @scgovernorpress Director Bryan Stirling to Continue Leading S.C. Department of Corrections http:// bit.ly/2R5SnLK", "2018-12-27T21:05:06.000Z": "Emily Farr's focus on fire safety has resulted in a more unified and effective approach than our state has ever seen among its firefighting community, and her passion for making it easier to do business in South Carolina... (1/2) Quote Tweet SC Governor Press @scgovernorpress Director Emily H. Farr to Continue Leading S.C. Department of Labor, Licensing, and Regulation https:// bit.ly/2Q8sIge", "2018-12-25T15:30:24.000Z": "Merry Christmas from our family to yours.", "2018-12-21T15:20:32.000Z": "Santee Cooper's ratepayers are already bearing the burden and consequences of errors and failings by others in decisions in which they played no part. These same ratepayers should not also be forced to finance the defense of individuals involved in the resulting investigations. Quote Tweet Avery Wilks @AveryGWilks NEW: Gov. @henrymcmaster has called on Santee Cooper to stop charging its ratepayers for the criminal defense attorneys of top executives. ($850K last year). He's also demanded S/C  turn over a trove of documents related to their hiring https:// thestate.com/news/politics- government/article223368240.html ", "2018-12-20T23:29:56.000Z": "Proud to stand with other coastal governors to protect our precious natural resources. We do not want any seismic testing or offshore drilling in South Carolina. https:// bit.ly/2LrrcF8", "2018-12-20T21:24:47.000Z": "We had a great first meeting of the South Carolina Floodwater Commission today. I look forward to the great work this team is going to do to formulate a multi-faceted approach to dealing with flooding in our state in the future. Read more on our website: http:// bit.ly/2QFLRLu", "2018-12-20T15:30:02.000Z": "South Carolina Floodwater Commission Meeting Gov. Henry McMaster @henrymcmaster South Carolina Floodwater Commission Meeting pscp.tv", "2018-12-19T19:24:10.000Z": "Those South Carolinians struggling with drug abuse and addiction are well-served by Director Goldsby's innovative leadership, and the people of our state are fortunate to have her serving at the Department of Alcohol and Other Drug Abuse Services. (2/2)", "2018-12-19T19:24:09.000Z": "The opioid epidemic is a silent hurricane that is affecting families across the country, but Sara Goldsby has become a leading voice in fighting this scourge on our citizens. (1/2) Quote Tweet SC Governor Press @scgovernorpress Director Sara Goldsby to Continue Leading S.C. Department of Alcohol and Other Drug Abuse Services https:// bit.ly/2EGn4Rp", "2018-12-17T20:39:31.000Z": "Josh Baker has done an excellent job leading the largest, most complex agency in state government. Many South Carolinians are unaware that SCDHHS alone accounts for almost one third of the entire state budget. Quote Tweet SC Governor Press @scgovernorpress Director Josh Baker to Continue Leading S.C. Department of Health and Human Services http:// bit.ly/2EAD6fd", "2018-12-14T20:49:22.000Z": "Since we learned of SCANA and Santee Cooper's decision to abandon the VC Summer Project, my goal has been to ensure that the customers bear no burden for the failings of others. (1/3)", "2018-12-12T19:33:27.000Z": "Because of his expertise and his unimpeachable reputation within the insurance industry, Director Farmer has been recognized by his peers across the country as one of the best in the business. (1/2) Quote Tweet SC Governor Press @scgovernorpress Director Raymond G. Farmer to Continue to Lead S.C. Department of Insurance http:// bit.ly/2C8QN2L", "2018-12-11T20:36:34.000Z": "and with the acquisition of St. Phillips Island, generations of South Carolinians and her visitors will have open access to one of the nation's last undeveloped pristine barrier islands. (2/2)", "2018-12-11T20:36:33.000Z": "Duane Parrish's world-wide marketing and branding campaigns have taken South Carolina's tourism industry to levels of growth and success never before achieved. His leadership has transformed our state park system into the jewel of the southeast, (1/2) Quote Tweet SC Governor Press @scgovernorpress Director Duane Parrish to Continue to Lead S.C. Department of Parks, Recreation and Tourism http:// bit.ly/2rz14iF", "2018-12-11T14:42:35.000Z": "Director Pough's vision for how to best achieve that mission is one that combines the boldness, innovation, and compassion that I believe are necessary to do the job. (2/3)", "2018-12-11T14:42:34.000Z": "Nearly two years ago, Director Pough took on a tremendous challenge when he agreed to become the next director of DJJ and he has led with one goal in mind - fulfilling the agency's mission of rehabilitating and providing opportunities for the juveniles in its care. (1/3) Quote Tweet SC Governor Press @scgovernorpress Director Freddie B. Pough to Continue to Lead S.C. Department of Juvenile Justice http:// bit.ly/2C4aN6F", "2018-12-10T22:04:06.000Z": "I want to wish all of our Jewish neighbors in South Carolina a #HappyHannukah . Thank you to @bethbernsteinsc for inviting me to be a part of this year's menorah lighting at the State House.", "2018-12-10T21:44:40.000Z": "I am proud to call Director Adams my partner, and I'm confident that the Department of Administration, and South Carolina taxpayer dollars, are in good hands because of her leadership. (2/2)", "2018-12-10T21:44:29.000Z": "As the first director of the Department of Administration, Marcia Adams accepted the daunting challenge of streamlining a patchwork of independent offices and departments into a single, cohesive support agency for all of state government, and she has delivered. (1/2) Quote Tweet SC Governor Press @scgovernorpress Executive Director Marcia S. Adams to Continue to Lead S.C. Department of Administration http:// bit.ly/2B6qIQg", "2018-12-06T19:55:24.000Z": "Every job we're able to announce makes a difference in someone's life, and that will always motivate Secretary Hitt and I to work every day to bring companies, big and small, to our state and take care of them when they get here so they can thrive and grow here. Quote Tweet SC Governor Press @scgovernorpress Secretary of Commerce Bobby Hitt to Continue to Lead S.C. Department of Commerce http:// bit.ly/2PoYcOT", "2018-12-04T23:44:49.000Z": "Peggy and I enjoyed welcoming everyone who came to the open house at the mansion last night. We want to thank all of the volunteers who made it possible, especially the A.C. Moore Bobcat Chorus with their angelic voices. #MerryChristmas", "2018-12-04T00:01:14.000Z": "Pretty cool moment at the Governor's mansion when @henrymcmaster took the press on an impromptu tour upstairs to see a letter President George H. W. Bush sent after his stay there in 1994.", "2018-12-01T15:46:41.000Z": "The greatness of President Bush's generation has been defined by their selfless humility and dedication to public service, our nation, and to the fight for freedom around the world.  He fought in World War II and helped to end the Cold War. (1/2)", "2018-11-27T18:54:32.000Z": "The inauguration is an historic and treasured event, and @1stLadySC and I invite everyone to join us for this unique opportunity to celebrate all of the things that make South Carolina great. SC Gov. McMaster's inauguration taking shape. And it has a hometown Columbia feel S.C. Gov. Henry McMaster released details Tuesday of his upcoming Jan. 9 inauguration, featuring a Columbia twist. thestate.com", "2018-11-19T18:58:25.000Z": "The Carolighting is a wonderful tradition to kick off the Christmas season in South Carolina. Peggy and I hope you and your family can join us this year. Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster and the First Family Announce 52nd Annual Governor's Carolighting \n| WIS Anchor Mary King will Emcee Event http:// bit.ly/2BiapRu", "2018-11-11T21:33:51.000Z": "Today we pause to remember and thank those veterans among us for selflessly protecting this great country and her people.", "2018-11-11T21:33:50.000Z": "One hundred years ago we celebrated the end of the war to end all wars. Sadly there has been much conflict around the globe in the ensuing century, but thankfully the men and women of the American armed forces continue to answer the call to service of country above self.", "2018-11-07T23:34:53.000Z": "Lieutenant Governor-Elect @PamelaEvette and I will work every day to deliver on our promise of cutting taxes, removing burdensome regulations, enhancing education and learning at all levels, keeping people and their properties safe from harm, and protecting our environment.", "2018-11-07T23:34:52.000Z": "Yesterday, with the help of your vote and thousands of South Carolinians, we WON!\n \nIt is an honor to serve as your governor. Today I stand a little taller knowing that I have the privilege of representing you for the next four years.", "2018-11-06T17:26:57.000Z": "I voted today-make sure you do too! Polls don't close until 7pm, so vote at lunch or on your way home from work. Together we will keep South Carolina moving in the right direction!", "2018-11-06T13:48:29.000Z": "US House candidate, SC-3 Let your voice be heard! #VOTE", "2018-11-06T12:38:00.000Z": "Get to the polls today and VOTE Henry McMaster for Governor to ensure 4 more years of conservative reforms, more good-paying jobs, and economic growth!", "2018-11-05T22:43:45.000Z": "Thank you to @TomRiceSC7 , @RepJeffDuncan , and the rest of our winning team for joining us at our final campaign stops. \n\nThere is a lot at stake in this election, so it's important everyone gets out to vote tomorrow to keep strong, conservative leadership in place!", "2018-11-05T20:32:53.000Z": "The #SCWinning bus tour concluded after 5 days, 16 stops, and meeting with thousands of voters. With the future of South Carolina at stake, make sure you get out and vote tomorrow for four more years of conservative leadership.", "2018-11-05T18:39:49.000Z": "Tomorrow is Election Day and Pamela and I are asking for your vote. Support proven conservative leaders by voting McMaster-Evette tomorrow!\n \nFind your polling location here: https:// info.scvotes.sc.gov/eng/voterinqui ry/VoterInformationRequest.aspx?PageMode=VoterInfo ", "2018-11-05T17:18:42.000Z": "With more than 24,000 new jobs and & $8 billion in new investment, South Carolina is booming! We are taking our message to voters one last time before the election tomorrow. Thank you to Columbia & Charleston for a great morning.", "2018-11-05T00:38:25.000Z": "Thank you to our friends in Aiken & Columbia for a wonderful final leg of the #SCWinning Bus Tour! We hit 16 cities in 5 days, met hundreds of enthusiastic voters, & ate plenty of BBQ. Tomorrow we fly around the state one last time to get out the vote before Tuesday.", "2018-11-04T19:54:42.000Z": "Proud to have the @postandcourier 's endorsement in this race! https:// postandcourier.com/opinion/editor ials/vote-to-keep-mcmaster-as-governor/article_6c938848-ded4-11e8-93a7-0f4dcfc81e83.html   #SCWinning", "2018-11-04T12:16:58.000Z": "From the .... @postandcourier  Editorial Board: .... @henrymcmaster  \"has the skills and vision to build on the gains of the past two years. South Carolina voters should return him to office Tuesday.\" Editorial: Vote to keep McMaster as governor Henry McMaster has done a good job as South Carolina's governor since taking over for Nikki Haley two years ago. postandcourier.com", "2018-11-04T00:05:58.000Z": "We're feeling the momentum after a huge turnout at our final Upstate rally before Tuesday's election! Thank you for the support, Greenville. #SCWinning", "2018-11-03T18:47:56.000Z": "US Senate candidate, SC Awesome day in #DeathValley with friends watching dominating performance by ... @ClemsonFB  #GoTigers ... @henrymcmaster  ... @SenatorTimScott  ... @nikkihaley  ... @RepJeffDuncan  ... @PamelaEvette  ... @ClemsonPrez ", "2018-11-03T17:32:12.000Z": "Beautiful Saturday for football with #TeamSC !", "2018-11-03T15:19:27.000Z": "Dabo's face when he realized it was the governor  #AllIn  #SCWinning  #TigersBackHenryMac", "2018-11-03T01:56:50.000Z": "And thank you to the members of the press corps who joined us on the road today. We enjoyed your company and questions...even the tough ones!", "2018-11-03T00:39:13.000Z": "Last stop of the day: Spartanburg! Thank you to everyone for coming out to support our campaign today. #SCWinning", "2018-11-02T22:17:31.000Z": "Gaffney has been so good to us for years. We just finished up our Agriculture rally with @HughWeathers and @harveypeeler , recognizing one of our state's largest industries. #SCWinning", "2018-11-02T20:16:08.000Z": "We also talked with several small business owners in downtown Fort Mill who support our campaign and know that I have their backs. I am proud to have the endorsement of the @nfib_sc . Don't be fooled by the picture-I didn't eat the Carolina Reaper pepper.", "2018-11-02T17:24:57.000Z": "Hey @mike_pence , your biggest fans are in South Carolina! #SCWinning", "2018-11-02T17:00:44.000Z": "The good people of Camden showed up big for the winning team today. Thank you for the support! #SCWinning", "2018-11-02T13:45:00.000Z": "Day 3 of our #SCWinning bus tour has begun with a great breakfast in Florence! @PamelaEvette has a special message for our friends in Camden, York County, and the Upstate:", "2018-11-02T02:02:02.000Z": "Ended Day 2 of our #SCWinning bus tour with a huge rally in Horry County! Thanks to everyone who came out!", "2018-11-02T00:17:39.000Z": "Wow... what an incredible outpouring of support at the Georgetown Rally and in Horry County. Governor @henrymcmaster and I could feel your enthusiasm for SC! Day 2 of the #SCWinning bus tour is a wrap. Join us in Florence, Camden, Fort Mill, Gaffney or Spartanburg tomorrow!", "2018-11-02T00:55:48.000Z": "\"SC is #1!\" @henrymcmaster addresses an overflow crowd tonight of energized Horry County Republicans! #SCwinning  @HorryCountyGOP  @SCGOP  @mcmaster", "2018-11-01T20:51:57.000Z": "South Carolina's strong military tradition is unlike any other state. We support our veterans and will continue working to ensure they are taken care of and honored. I am grateful for their support.", "2018-11-01T18:46:54.000Z": "Great time in Mt. Pleasant, SC for the Charleston Luncheon & Rally! Thank you to the elected officials and everyone who came out to support us and cheer us on. Headed on down the road to Georgetown... see you there! #McMasterEvette  #SCgov", "2018-11-01T18:40:53.000Z": "Great turnout for our Get-Out-The-Vote rally in Mt. Pleasant! Our team is fired up to vote on Tuesday to keep SC red! #SCWinning", "2018-11-01T18:05:39.000Z": "With more than 23,000 new jobs and $8 billion in economic investment, we are taking South Carolina to even greater heights. I'm proud of South Carolina, and I'm asking for your vote on Tuesday so we can continue working for our great state.", "2018-11-01T14:12:36.000Z": "Good morning, Bluffton! The #SCWinning bus tour is now headed to Mt. Pleasant, Georgetown, and Conway today. Hope you can join us! Details are here: https:// henrymcmaster.com/scwinning-bus- tour-stops/ ", "2018-10-31T23:47:15.000Z": "Great to have @SenatorTimScott and many of our other local elected officials join us for our Tri-county bus tour swing! #SCWinning", "2018-10-31T19:03:07.000Z": "Our students deserve to have a Superintendent of Education with a seat in the cabinet working in lock step with the entire executive branch on a unified vision for education excellence in South Carolina. Quote Tweet SC Chamber of Commerce @scchamber Nikki Haley and education leaders agree: On November 6th vote YES on Amendment 1 to prioritize education. https:// youtu.be/FoF1sy-g7Oc", "2018-10-31T18:19:20.000Z": "Just kicked off our #SCWinning bus tour in Cayce! Join us for one of our stops today through Sunday: https:// henrymcmaster.com/scwinning-bus- tour-stops/   @PamelaEvette", "2018-10-30T01:14:11.000Z": "Tonight @PamelaEvette showed the people of SC that she has the leadership, vision, & ideas to move our state forward-I am proud to have her by my side. With 8 days left in this election, we need you to help make our plans possible by getting the word out & voting on Nov. 6!", "2018-10-29T22:48:12.000Z": "I have the best running mate, and I look forward to @PamelaEvette representing our ticket tonight! Tune in: https:// scetv.org/live/lt-govern or-debate  Quote Tweet Pamela Evette @PamelaEvette Gearing up for tonight's debate. Thank you to our fantastic McMaster-Evette supporters who greeted us with excitement & cheers at the @SCETV studio in Columbia! #SCGov  #SCdebate", "2018-10-27T17:36:36.000Z": "", "2018-10-26T15:29:44.000Z": "As a mother of 3, I've always been invested in our education system. Gov @henrymcmaster and I are proud to stand w/ SC educators, leaders and Superintendent of Education @Molly_Spearman - working hand-in-hand on education throughout our state. #SCeducation  https:// henrymcmaster.com/mcmaster-gover nor-campaign-announces-statewide-educators-coalition/ ", "2018-10-26T01:06:45.000Z": "Thank you to our Upstate friends and supporters for coming out to celebrate a strong debate victory tonight! 11 more days until we keep #SCWinning", "2018-10-25T22:09:47.000Z": "What happened with the nuclear plant was a disaster, which is why I forced the release of secret reports, removed incompetent management, and demanded that ratepayers get their money back. I promise to never stop fighting for you.", "2018-10-25T18:16:59.000Z": "Proud to have the backing of educators and leaders from across our state, including State Superintendent Molly Spearman. This group represents so many of the great ideas, hopes, dreams, accomplishments, and successes for education in South Carolina. https:// henrymcmaster.com/mcmaster-gover nor-campaign-announces-statewide-educators-coalition/ ", "2018-10-24T20:35:24.000Z": "We were proud to be represented at the White House today by @SCDOADAS Director Sara Goldsby and are thankful for the work she and her team are doing to lead a coalition of public and private entities across the state to address the problem. (2/2)", "2018-10-24T20:32:47.000Z": "Thank you @realDonaldTrump for signing federal legislation that will complement the work we are doing in South Carolina to reduce the scourge of the opioid crisis. (1/2)", "2018-10-23T20:23:20.000Z": "I ordered that flags be flown at half-staff beginning at dawn today until the day of her interment.", "2018-10-23T17:29:03.000Z": "My opponent, James Smith, supports abortion on demand and fought against a bill to ban dismemberment abortions. James Smith is too extreme for South Carolina.", "2018-10-23T01:26:10.000Z": "Please join me and Peggy in praying for her family and loved ones through this difficult hour.", "2018-10-23T01:26:09.000Z": "We are heartbroken tonight to lose another officer as a result of the horrific shooting in Florence. Investigator Farrah B. Turner passed away from her injuries after fighting for her life for more than two weeks.", "2018-10-21T15:47:13.000Z": "Please join Peggy and me in praying for @RepMikePitts , who suffered from a heart attack this weekend. Mike, South Carolina is rooting for your full and immediate recovery.", "2018-10-20T21:30:15.000Z": "Peggy and I had a great time celebrating @ClemsonUniv homecoming with President Clements today! GIF", "2018-10-20T19:08:24.000Z": "While he hits the road to the Upstate, Gov. @henrymcmaster called in to @SCGOP HQ to thank one of the many groups of volunteers hitting doors today to talk to voters about why we need 4 more years of strong Republican leadership in South Carolina! #SCWinning  #17days", "2018-10-20T15:54:59.000Z": "Joined the American Legion Post No. 3 to share Gov @henrymcmaster 's commitment to veterans, including a push elimination of retirement income taxes for veterans and making the Dept of Veterans Affairs a cabinet level agency. Vets support #McMasterEvette ! https:// henrymcmaster.com/mcmaster-gover nor-announces-veterans-coalition/ ", "2018-10-19T20:19:56.000Z": "Gov. Henry McMaster Announces Horry/Georgetown Team South Carolina Day | State and Federal Officials, Non-Profits will Offer Residents Disaster Relief Assistance http:// bit.ly/2EwHE7p", "2018-10-19T19:40:43.000Z": "Inland Port Greer opened on this day in 2013. Nearly half a million lifts later the port is operating at 62% above their five year projection! They also paved the way for Inland Port Dillon, spreading @SCPorts ' economic impact across the entire state.", "2018-10-18T21:27:24.000Z": "South Carolina keeps pumping out great pro-taxpayer leaders. Quote Tweet Cato Institute @CatoInstitute South Carolina's @henrymcmaster is off to a fiscally conservative start as governor by offering a restrained budget this year, supporting pension reforms, vetoing tax increases, and proposing income tax reforms. http:// j.mp/2ObOGTv  #GovReportCard", "2018-10-18T20:33:48.000Z": "Big news: @RSLC just added @PamelaEvette to their \"18 in '18 Races to Watch\" list of rising stars in the Republican Party! \n\nPamela will make an excellent lieutenant governor for SC, & I look forward to having her on my team as we work for you every day. RSLC Adds Pamela Evette to 18 in '18: Races to Watch - Henry McMaster for Governor COLUMBIA - Today, the Republican State Leadership Committee (RSLC)  announced that lieutenant governor nominee Pamela Evette has been added to their \"18 in '18: Races to Watch\" list, comprised of... henrymcmaster.com", "2018-10-18T18:40:22.000Z": "This is exciting news for both economic development and tourism throughout South Carolina! Quote Tweet SC Dept. of Commerce @SCcommerce It's official: @British_Airways will operate non-stop air service from @iflyCHS to London's @HeathrowAirport !", "2018-10-17T23:17:26.000Z": "FACT CHECK: We have more people working than ever before.\n\nJan. 2017 employed in SC: 2,199,535\nAug. 2018 employed in SC: 2,227,867", "2018-10-17T22:59:47.000Z": "Peggy and I are excited for the debate. Make sure to tune in here, happening now: https:// scetv.org/live/gubernato rial-debates ", "2018-10-17T20:31:16.000Z": "My opponent, James Smith, has been courting big-name Democrat socialists like Bernie Sanders and Cory Booker. Who will he pursue next? https:// jamessmithbaggage.com", "2018-10-16T16:12:50.000Z": "I spent this morning in a place filled with fantasy & imagination - fun to know it's somewhere folks in the Upstate go to work every day! Many thanks to CEO Sharon Webber & @SuperDuperPub team for giving me a tour of your offices & peek into your world. It was simply magical!!", "2018-10-16T14:10:28.000Z": "Dillon Team South Carolina Day is today! If you need help recovering from Hurricane Florence, stop by 536 Radford Boulevard to speak with agencies that are ready to work for you! Great partners like @HarvestHopeFB  @RedCross  @sacarolinas and others are also there to help. #TeamSC", "2018-10-14T21:59:25.000Z": "Thank you for your hard work! #SCWinning  #23Days Quote Tweet Micah Rea @1pilotman Hope I made myself clear by saying you would be seeing tons of signs up.... even in the rural areas of SC! @SCGOP  @TreasurerLoftis  @henrymcmaster  @PamelaEvette  #victory2018  #scpol", "2018-10-13T20:28:02.000Z": "Go Gamecocks!", "2018-10-12T20:19:21.000Z": "Thank you to @SCEDA for an excellent candidate forum this morning. South Carolina's economy is booming, and I enjoyed the opportunity to share my vision to build on that momentum through workforce development, tax reform, revitalizing our rural communities, and more!", "2018-10-12T13:47:07.000Z": "Thank you @sundarpichai and @googleorg ! Quote Tweet Sundar Pichai @sundarpichai It's been a tough hurricane season for the Southeastern US. We're thinking of those affected by #HurricaneMichael : donating $1M from @Googleorg & Googlers and supporting the efforts of @FLGovScott @GovernorDeal  @GovernorKayIvey  @henrymcmaster  @NC_Governor to help those impacted", "2018-10-12T01:00:36.000Z": "Enjoyed being with our friends in Florence tonight for a great event! There's a lot at stake this election, and we need you to get out and vote on Nov. 6 as we work to take South Carolina to even greater heights. #SCWinning", "2018-10-11T19:02:00.000Z": "I have been fighting to protect taxpayers, grow our economy, and bring more good-paying jobs to South Carolina. I am proud of what we've accomplished so far and promise to continue these pro-growth policies. https:// cato.org/publications/w hite-paper/fiscal-policy-report-card-americas-governors-2018 ", "2018-10-11T17:06:49.000Z": "James Smith said he supports Bernie Sanders' $32 TRILLION government-run health care plan, but refuses to say how we'd pay for it. Now, Bernie is coming to South Carolina to help James' campaign. South Carolinians can't afford James Smith's costly liberal agenda.", "2018-10-11T12:10:01.000Z": "Continuing to track Tropical Storm #Michael as it moves into South Carolina. The State Emergency Operations Center is activated at OPCON 3, ready to respond as request. #sctweets", "2018-10-10T17:55:33.000Z": "It is an honor to have the backing of so many great veterans from across our state. We will continue to work together on the priorities we've laid out to make South Carolina the best place for veterans to live, get a job, and raise a family. https:// henrymcmaster.com/mcmaster-gover nor-announces-veterans-coalition/ ", "2018-10-09T14:02:53.000Z": "From higher taxes to $32 trillion government-run health care, James Smith has embraced the most radical ideas of the Bernie Sanders wing of the Democrat Party. We must reject these failed socialist ideas.", "2018-10-06T18:43:36.000Z": "#GoCocks ... @henrymcmaster ", "2018-10-05T20:19:17.000Z": "No child should EVER be unsafe at school. South Carolina will have a trained, certified law enforcement officer in every school, in every county, all day, every day. That is my promise to you. https:// thestate.com/news/politics- government/article219557190.html ", "2018-10-04T23:04:01.000Z": "Awesome turnout tonight in Rock Hill thanks to the good people of the York County Delegation! \n\nThank you for a great rally and hosting @henrymcmaster and @PamelaEvette . Safe to say #YorkCountyBacksHenryMac  #Victory2018", "2018-10-04T21:13:18.000Z": "Thank you @TreasurerLoftis for your quick response to our request for funding for mosquito abatement in the aftermath of Florence flooding!", "2018-10-04T13:58:44.000Z": "Today, I have ordered that flags across South Carolina will be lowered to half-staff as a mark of respect for the law enforcement officers who were senselessly shot in Florence yesterday. Please, take this opportunity to reflect on what their sacrifice means to you. #SCStrong", "2018-10-03T22:34:43.000Z": "Peggy and I ask that you pray for them, pray for their recovery, pray for their families, and pray for all of Florence. (2/2)", "2018-10-03T22:34:34.000Z": "This is simply devastating news from Florence. The selfless acts of bravery from the men and women in law enforcement is real, just like the power of prayer is real. (1/2)", "2018-10-03T21:57:13.000Z": "It took bipartisan leadership in both the House and the Senate to get the extremely important tax conformity bill to my desk and I'm proud to have just signed it into law. This is good news for every South Carolina taxpayer and business. #SCWinning", "2018-10-03T16:18:14.000Z": "His enthusiasm is infectious, his vision bright and bold, his passion and energy transformative, and his heart as big as the horseshoe. Carolina stands taller than ever on the national and worldwide stage because of Harris Pastides.", "2018-10-03T16:18:13.000Z": "Under Harris Pastides' leadership, the University of South Carolina has achieved 217 years worth of \"firsts\" in just one decade. It has been an era of unparalleled success.", "2018-10-02T20:49:25.000Z": "Gov. Henry McMaster to Host Chesterfield Team South Carolina Day | State and Federal Officials, Non-Profits will Offer Residents Disaster Relief Assistance​ http:// bit.ly/2zMyOOc", "2018-10-02T20:44:37.000Z": "Florence and Darlington County Residents Eligible for FEMA Individual Assistance http:// bit.ly/2zMvtie", "2018-10-02T20:00:40.000Z": "S.C. businesses and taxpayers have been well served by action taken today by the Senate, and the leadership shown by the House earlier this year, on tax conformity. I ask the House to concur with the Senate so that I can sign this bill into law before the end of this week.", "2018-10-01T19:38:09.000Z": "It is an honor to receive the endorsement from @NFIB . With hundreds of thousands of South Carolinians employed by small businesses, we must have leaders that understand low taxes, less regulation, and more innovation are what we need to be successful and accelerate growth.", "2018-09-29T20:22:15.000Z": "A great day at the Irmo Okra Strut Parade! We enjoyed seeing so many friendly faces. #38days  #Victory2018", "2018-09-27T20:38:33.000Z": "One in five people deals with dyslexia, and we know that with proper identification and education they can lead successful lives. I'm proud to sign H. 4434 to help us identify dyslexia among our school children and provide them the help that they need.", "2018-09-27T20:26:31.000Z": "Thank you for having me! Quote Tweet SC Chamber of Commerce @scchamber @henrymcmaster came to LeadSC today to talk to the young professionals! #SCChamber", "2018-09-27T18:42:49.000Z": "I'm proud that South Carolina is a leading state in the country for manufacturing. The team we have in place is unstoppable, and with your support, we can continue to do the great work that will keep our economy booming! http:// globaltrademag.com/site-selection /state-spotlight/best-states-for-manufacturing?gtd=3850&scn=state-spotlight ", "2018-09-25T20:37:27.000Z": "Governor Henry McMaster and FEMA Director Brock Long will hold a media briefing tomorrow, Wednesday, September 26 at 10:30 AM. They will discuss recovery efforts in the aftermath of Hurricane Florence and the ensuing flooding event.", "2018-09-25T19:07:20.000Z": "Chesterfield County Residents Eligible for FEMA Individual Assistance Program http:// bit.ly/2N1TBAP", "2018-09-24T20:59:48.000Z": "Disaster Unemployment Assistance Available for Four Counties Affected by Hurricane Florence http:// bit.ly/2IddGDo", "2018-09-24T18:05:19.000Z": "As the people of the Pee Dee continue to experience historic flooding this week, please take a moment to watch this and consider making a donation at http:// onescfund.org . 100% of your donation will go towards #Florence relief efforts.", "2018-09-23T22:13:14.000Z": "It was a great day to enjoy the @ColasGreekFest ! Thank you for the good food and fellowship.", "2018-09-23T01:57:05.000Z": "Every asset in the state is being directed towards this region as they are bracing for and experiencing historic flooding. If you and your family would like to help victims of Florence please visit http:// onescfund.org to make a donation; 100% goes towards relief efforts.", "2018-09-23T01:57:04.000Z": "Today I toured Nichols with Mayor Lawson Battle, Sen. Kent Williams, and other local officials. The town, devastated by Matthew, has flooded even worse from Florence. Please remember them and the rest of the Pee Dee in your prayers as they continue to suffer from this storm.", "2018-09-22T21:26:39.000Z": "Thank you to all the @SCGOP executive committee members who gathered today in preparation for the final stretch. \n\n45 days to Victory!", "2018-09-21T22:33:19.000Z": "South Carolina Approved for $8 million of Federal Highway Administration \"Quick Release\" Emergency Funds https:// bit.ly/2NvX3sN", "2018-09-21T22:30:37.000Z": "Four South Carolina Counties Approved for Individual Assistance Program | Dillon, Horry, Marion, and Marlboro Individual Assistance Eligibility Added to S.C. Disaster Declaration https:// bit.ly/2PYcCpS", "2018-09-21T17:53:06.000Z": "I know we sound redundant, but it bears repeating: Turn around, don't drown! #Florence  #PalmettoStrong  #TeamSC  #Sctweets", "2018-09-21T17:05:31.000Z": "This is the worst of times for many of our friends and families in the Pee Dee, so it's always wonderful when people and companies like @UnitedHealthGrp come forward to help. Thank you for your generous $500,000 donation to the #OneSCFund . https:// bit.ly/2Dk6jLH", "2018-09-21T15:38:33.000Z": "Interested in donating or volunteering to help? https:// scemd.org/recover/volunt eer-and-donate/   #Florence  #TeamSC  #PalmettoStrong  #sctweets", "2018-09-20T16:37:38.000Z": "Gov. Henry McMaster Pens Letter to S.C. Congressional Delegation, Requests Federal Support for Hurricane Florence Recovery http:// bit.ly/2MPMBXL", "2018-09-20T13:40:51.000Z": "Rivers in the Pee Dee region are expected to rise through the weekend. Please don't become a victim. #HurricaneFlorence  #Florence Quote Tweet SCEMD @SCEMD Turn Around...Don't Drown! #HurricaneFlorence ¡Dé la vuelta... No se ahogue!", "2018-09-20T13:31:18.000Z": "Thank you also for the assistance your administration has offered throughout the storm and their commitment to ongoing support as we continue to deal with the second phase of it. (2/2)", "2018-09-20T13:30:39.000Z": "Thank you President Trump for coming to South Carolina to see the impact of Hurricane Florence and to talk with some of those most affected. (1/2)", "2018-09-19T16:18:47.000Z": "Gov. Henry McMaster Suspends Fifth Circuit Solicitor Dan Johnson\n| Governor Appoints S.C. Deputy Attorney General to Serve as Solicitor https:// bit.ly/2xpoJ8F", "2018-09-19T05:36:16.000Z": "Replying to @ChefMikeNoble President Trump declared that a major disaster exists in SC and approved federal reimbursement through FEMA for emergency, life-safety actions during Hurricane Florence. Please call our PIPS line at 1-866-246-0133. Let us know how we can help you.", "2018-09-16T20:35:46.000Z": "The following locations will be open tomorrow and accepting donations through this weekend. We especially need: Cleaning supplies Clean clothes (new or used) Personal hygiene items Nonperishable food Bottled water\n\nCheck out all of our sites at http:// ColumbiaRelief.org", "2018-09-18T16:32:42.000Z": "Governor Henry McMaster will hold a media briefing with state emergency response officials today, Tuesday, September 18 at 2:30 PM. The governor will update the public on Florence's ongoing impact to South Carolina.   Watch live via @SCETV .", "2018-09-18T14:36:20.000Z": "One team one fight! With South Carolina Gov. @henrymcmaster , @SCNationalGuard , @Norad_Northcom and more today seeing how @DeptofDefense teamwork is supporting civil authorities responding to #HurricanceFlorence . Very proud of #NationalGuard contributions!", "2018-09-18T14:46:18.000Z": "State Fire Marshal Chief H. \"Butch\" Browning met with S.C. Gov. @henrymcmaster this A.M.\n\nThe gov. offered a sincere thanks to LA for its help responding to #Florence .  He also spoke w/ @Chief_Browning about Monday's rescue that he watched LA swift water teams answer successfully!", "2018-09-17T23:00:50.000Z": "Thank you for the flawless teamwork of the South Carolina National Guard, Chesterfield County Sheriff's Office, and Louisiana Swift Water team to save these men's lives! Your governor and the people of South Carolina are proud of you. Quote Tweet Louisiana Office of State Fire Marshal @LAFIREMARSHAL Louisiana's Swift Water teams just rescued two older men from the top of a vehicle swept away by flood waters in Bennettsville after they were spotted by S.C. Gov. @henrymcmaster during his helicopter tour of the flooding and had the rescue order dispatched out. #LouisianaProud Show this thread", "2018-09-17T15:46:18.000Z": "Seriously. Don't drive around barricades. You have no idea what's lurking down the road. #HurricaneFlorence  #Florence", "2018-09-17T15:42:12.000Z": "#USAirForce Security Forces personnel, @theSCANG work as teams to assist local residents evacuate from neighborhood in the Black Creek area of Florence #SC . Approximately 3,400 Soldiers & Airmen have been mobilized to support #TeamSC for #HurricaneFlorence recovery efforts.", "2018-09-17T14:04:45.000Z": "President Donald J. Trump Declares Disaster for State of South Carolina and Eight Counties https:// bit.ly/2QCyCaU", "2018-09-17T13:15:23.000Z": "Secretary Christy Hall on site of flood barrier construction US 501 Bypass in Horry County.  The flood barrier is being built to ensure that there is at least one safe way to travel into Myrtle beach.", "2018-09-16T22:36:02.000Z": "UPDATE: Florence County has issued a mandatory evacuation for residents of Black Creek. #HurricaneFlorence  #Florence", "2018-09-16T20:35:53.000Z": "Thank you to our sign language interpreters Holly and Josie for standing beside me throughout Hurricane Florence to keep our hearing impaired community in South Carolina informed and safe.", "2018-09-16T20:23:46.000Z": "Video: Governor McMaster, State Officials Give Florence Update September 16 Governor McMaster, State Officials Give Florence Update September 16 youtube.com", "2018-09-16T19:56:53.000Z": "Returning residents should prepare for extended travel times and congestion. For real-time traffic information, visit http:// 511sc.org . #HurricaneFlorence  #Florence", "2018-09-16T16:23:17.000Z": "Governor Henry McMaster will hold a media briefing with state emergency response officials today, Sunday, September 16 at 2:30 PM. The governor will update the public on Florence's ongoing impact to South Carolina. Watch live via @SCETV .", "2018-09-16T13:41:23.000Z": "STAY ALERT-flash flooding may occur on roads across the Pee Dee. Don't drive around barricades or into standing water. Roads are closed for your safety. Don't unnecessarily put yourself in harm's way. If you live in an area that's prone to flooding, shelters are open for you.", "2018-09-16T13:23:55.000Z": "Call 1-866-246-0133 if you have any questions about #Florence Quote Tweet Brian Symmes @BrianSymmes Evacuations have been lifted, but danger remains on some roadways. BE PATIENT, don't rush, and be on the lookout for fallen trees and unexpected flash flooding.", "2018-09-15T21:38:36.000Z": "Evacuation Orders Lifted for Horry and Georgetown Counties Tomorrow at 9AM | At 9AM Tomorrow Morning, All Evacuations Orders will be Lifted https:// bit.ly/2paTzxh", "2018-09-15T20:43:14.000Z": "Video: Governor McMaster, State Officials Give Tropical Storm Florence Update September 15 Governor McMaster, State Officials Give Tropical Storm Florence... youtube.com", "2018-09-15T20:27:46.000Z": "This sweet pup is named Callie. She came by @SCEMD today and lifted the spirits of the men and women working hard around the clock to keep South Carolina safe during Hurricane Florence.", "2018-09-15T16:00:01.000Z": "Governor Henry McMaster will hold a media briefing with state emergency response officials today, Saturday, September 15 at 2:30 PM. The governor will update the public on Hurricane Florence's potential impact to South Carolina. Watch live via @SCETV .", "2018-09-15T15:08:26.000Z": "Evacuation Orders Lifted for Charleston, Dorchester, Berkeley, and Colleton Counties | Evacuation Orders Remain in Effect for all Zones in Georgetown and Horry Counties https:// bit.ly/2NQYHog", "2018-09-14T21:46:56.000Z": "Video: Governor Henry McMaster Hurricane Florence Update September 14 Governor McMaster Gives Hurricane Florence Update September 14 youtube.com", "2018-09-14T21:39:23.000Z": "Team South Carolina Prepares for Tropical Storm Florence https:// bit.ly/2p7Qqy0", "2018-09-14T01:18:31.000Z": "Tonight I spoke w/ Mayor of Nichols, Marion County officials, fmr Rep Jim Battle and Rep Lucas Atkinson. Unfortunately they know from Hurricane Matthew how dire the flooding situation is with Hurricane Florence. #TeamSouthCarolina has their back.", "2018-09-13T21:28:18.000Z": "Video: Gov. Henry McMaster, State Officials Hold Hurricane Florence Briefing Governor Henry McMaster Gives Hurricane Florence Briefing September 13 youtube.com", "2018-09-13T18:30:18.000Z": "Looking for a way to volunteer or contribute to #HurricaneFlorence relief efforts? Find answers to your questions here: https:// bit.ly/2p6kf1U  #Florence  #Hurricane  #SCWX  #SCtweets", "2018-09-13T16:45:25.000Z": "Governor Henry McMaster will hold a media briefing with state emergency response officials today, Thursday, September 13 at 2:30 PM. The governor will update the public on Hurricane Florence's potential impact to South Carolina. Watch live via @SCETV .", "2018-09-13T00:48:04.000Z": "RESIDENTS MUST EVACUATE FROM THE FOLLOWING ZONES DUE TO #HURRICANEFLORENCE :  HORRY & GEORGETOWN EVACUATION ZONES A, B, C; CHARLESTON, DORCHESTER & BERKELEY COUNTY EVACUATION  ZONES A, B, C, D, E, F, G,H, & I; ALONG WITH EDISTO BEACH #SCTWEETS  #alert", "2018-09-12T20:54:10.000Z": "Video: Gov. Henry McMaster, State Officials Hold Hurricane Florence Briefing Wednesday, September 12, 2:30 PM https:// youtu.be/sz5IJbOrUhYhtt ps://youtu.be/sz5IJbOrUhY ", "2018-09-12T16:25:51.000Z": "Governor Henry McMaster will hold a media briefing with state emergency response officials today, Wednesday, September 12 at 2:30 PM. The governor will update the public on Hurricane Florence's potential impact to South Carolina. Watch live via @SCETV ( http:// scetv.org ) South Carolina ETV SCETV is South Carolina's public broadcasting, storytelling, and education network. scetv.org", "2018-09-11T20:10:13.000Z": "As we diligently prepare for Hurricane Florence, please take a moment to pause and remember the lives we lost 17 years ago today. We honor the legacy of the American heroes who ran toward danger, exhibiting the utmost bravery and patriotism. We will #NeverForget", "2018-09-11T15:52:17.000Z": "(All evacuation routes and zones are detailed in the 2018 S.C. Hurricane Guide). Residents can all the state's emergency hotline at 1-866-246-0133 if they have questions about the ongoing preparations for Hurricane Florence.", "2018-09-11T15:51:31.000Z": "I have also announced that the lane reversal on I-26 will begin immediately and ahead of schedule, due to the swift work by DOT and DPS personnel. All other lane reversals will begin as previously indicated at 12 noon.", "2018-09-11T15:51:05.000Z": "People who live in the following coastal areas must evacuate beginning noon today. Residents who do not know their zones can visit SCEMD's website ( http:// scemd.org ) where they can enter their address and be given their precise zones and view detailed maps of the zones.", "2018-09-11T15:50:24.000Z": "Individuals and families should plan to board pets with veterinarians, kennels, or other facilities in non-vulnerable areas. Pets are not allowed inside Red Cross evacuation shelters.", "2018-09-11T15:50:10.000Z": "Residents going to evacuation shelters should bring their own blankets, pillows, cots, and special food items if they are on restricted diets.", "2018-09-11T15:50:01.000Z": "Evacuees should pack the following essential items in anticipation of a potentially prolonged evacuation period: required medications, adequate clothing, and essential personal items.", "2018-09-11T15:49:32.000Z": "Evacuation shelter locations for those evacuating from the state's northern and central coastal counties will be available on http:// scemd.org and in the SC Emergency Manager mobile app as soon as they are opened.", "2018-09-11T15:49:13.000Z": "Additionally, I have ordered that schools and state offices in the following counties will be open beginning tomorrow, Wednesday, September 12: Aiken, Allendale, Bamberg, Beaufort, Barnwell, Colleton, Hampton, and Jasper.", "2018-09-11T15:48:46.000Z": "The mandatory evacuation executive order remains in effect for all zones in Horry, Georgetown, Charleston, Berkeley, and Dorchester counties and for Edisto Beach.", "2018-09-11T15:48:30.000Z": "I have lifted the mandatory evacuation order for zones in Beaufort, Colleton, and Jasper counties, with the exception of Edisto Beach. Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Lifts Mandatory Evacuations for Southern Coastal Counties \n| Evacuation Order Remains in Effect for Edisto Beach and all Central and Northern Coastal Counties https:// bit.ly/2NCSsUE", "2018-09-11T15:25:52.000Z": "1-866-246-0133 is @SCEMD information. #HurricaneFlorence", "2018-09-11T14:23:56.000Z": "Governor Henry McMaster will hold a media briefing with state emergency response officials today, Tuesday, September 11 at 11:00 AM. The governor will update the public on Hurricane Florence's potential impact to South Carolina.", "2018-09-10T20:02:43.000Z": "Some schools in the inland counties will be used as shelters, some school busses will be needed to assist in evacuation efforts, and we want to keep the roads as clear as possible for the one million evacuees we are expecting.", "2018-09-10T20:01:15.000Z": "Dorchester, Florence, Georgetown, Hampton, Horry, Jasper, Lexington, Lee, Marion, Marlboro, Orangeburg, Richland, Sumter, and Williamsburg.", "2018-09-10T20:01:03.000Z": "Public schools and state offices will be closed beginning tomorrow until further notice in twenty six counties: Aiken, Allendale, Bamberg, Beaufort, Barnwell, Berkeley, Calhoun, Charleston, Colleton, Clarendon, Darlington, Dillon, (cont.)", "2018-09-10T19:53:12.000Z": "I have ordered a full coastal evacuation effective noon tomorrow, Tuesday, September 11. If you are unsure if you are in an evacuation zone please check here: https:// scemd.org/prepare/know-y our-zone/  Quote Tweet SC Governor Press @scgovernorpress Gov. Henry McMaster Orders Mandatory Evacuations for Coastal Counties Effective Tomorrow, September 11 at Noon \n| Governor Also Issues Executive Order Closing Specific Schools and State Government Offices to Ease Traffic https:// bit.ly/2O8GsqX", "2018-09-10T11:56:20.000Z": "As we all keep an eye on Hurricane #Florence , now is the time to prepare. #KnowYourZone . Have a plan. Make it personal. You can do all this with the SC Emergency Manager mobile app: Apple App Store: https:// itunes.apple.com/us/app/sc-emer gency-manager/id1378105431?mt=8  Google Play: https:// play.google.com/store/apps/det ails?id=org.scemd.app   #SCTweets", "2018-09-10T15:47:45.000Z": "Governor Henry McMaster will hold a media briefing with state emergency response officials today, Monday, September 10 at 2:30 PM. The governor will update the public on Hurricane Florence's potential impact to South Carolina.", "2018-09-10T14:35:06.000Z": "If you have pets, make sure to include them in your emergency planning. They are family, too!", "2018-09-09T19:25:54.000Z": "Video: Gov. Henry McMaster, State Officials Hold Hurricane Florence Briefing Sunday, September 9, 2PM Governor Henry McMaster Gives Hurricane Florence Update September 9,... youtube.com", "2018-09-09T19:19:10.000Z": "Gov. Henry McMaster Requests Federal Disaster Declaration in Advance of Hurricane Florence's Potential Impact to the State https:// bit.ly/2wV5oMc", "2018-09-09T16:40:12.000Z": "Governor Henry McMaster will hold a media briefing with state emergency response officials today, Sunday, September 9 at 2:00 PM. The governor will update the public on Hurricane Florence's potential impact to South Carolina. Watch live on @SCETV .", "2018-09-08T20:09:00.000Z": "Governor McMaster Issues Executive Order 2018-27 - Suspending Certain Motor Vehicle Regulations Due to Emergency https:// bit.ly/2CAwhKJ", "2018-09-08T19:04:03.000Z": "With this order government agencies will begin to mobilize in anticipation of a hurricane. Now is the time for your family also to prepare and stay tuned for more updates. Plan for the worst, pray for the best. Quote Tweet SC Governor Press @scgovernorpress Governor McMaster issues executive order declaring a state of emergency.", "2018-09-08T17:50:18.000Z": "If you missed @henrymcmaster  #FLORENCE update, see it here - Governor's Storm Update Live press events may begin slightly later than scheduled. South Carolina Governor Henry McMaster and state officials will hold a media briefing Thursday, September 5 at 1:30 PM. For more information scetv.org", "2018-09-08T16:38:56.000Z": "Governor Henry McMaster will hold a media briefing with state emergency response officials today, Saturday, September 8 at 1:15 PM. The governor will update the public on Tropical Storm Florence's potential impact to South Carolina. @SCETV will carry it live.", "2018-09-07T19:26:21.000Z": "We just wrapped up our first conference call with emergency response leaders from across the state. Team South Carolina is ready to respond, please make sure you and your family take steps to be prepared as well. Visit http:// scemd.org for the latest.", "2018-09-07T18:11:37.000Z": "Please don't wait until the last minute to start preparing. Make sure you have a plan now. It's better to be prepared for a storm that misses us than to be caught without plan. Download the @SCEMD app or visit http:// SCEMD.org for the latest updates https:// youtube.com/watch?v=Fx4OHP 1vlrk ", "2018-09-06T21:09:31.000Z": "and the General Assembly passed nine bills that I happily signed to bolster our efforts to fight this scourge. (3/4)", "2018-09-06T21:09:30.000Z": "I signed an executive order creating the S.C. Opioid Response Team, which developed our state Opioid Response Plan; my executive budget included $10 million for treatment, education, and prevention, which was approved by the General Assembly; (2/4)", "2018-09-06T21:09:29.000Z": "The 2018 Governor's Opioid Summit gave us the opportunity not only to discuss solutions to the issues still facing us, but also to celebrate the progress that has been made in the past year. (1/4)", "2018-09-06T20:03:14.000Z": "Thanks to Gov. @HenryMcMaster for recognizing our efforts to fight the state's #opioid crisis.\n\nWe've saved a number of lives by administering #Narcan to those affected by an opioid overdose. #LESM  #LCSDnews", "2018-09-06T16:33:10.000Z": "Governor @henrymcmaster talking about the joint efforts to end the opioid epidemic in South Carolina at the 2018 SC Governor's Opioid Summit.", "2018-09-05T22:04:48.000Z": "20,000 Sprinter vans proudly made by South Carolinians in North Charleston. #TeamSouthCarolina  #SCJobs  #SCWinning Quote Tweet Dave Clark @davehclark Great day in South Carolina with the @MercedesBenz team and Governor @henrymcmaster ! Can't wait to get these into the hands of our Delivery Service Partners!", "2018-09-05T22:02:13.000Z": "We couldn't be more excited that Mercedes-Benz Vans has chosen to expand operations and start manufacturing their all-new Sprinter van right here in South Carolina. #TeamSouthCarolina  #SCWinning", "2018-09-03T13:31:00.000Z": "About to get started at the Chapin Labor Day Parade. What a great team! @henrymcmaster  @scgop  #victory2018", "2018-09-03T13:26:23.000Z": "Ready to roll! #ChapinLaborDayParade", "2018-09-02T22:19:51.000Z": "The \"King\" Richard Petty @RPMotorsports will have his iconic @OriginalSTP 43 colors on @BubbaWallace car tonight @TooToughToTame  #SCWinning", "2018-09-02T17:44:13.000Z": "A great day in South Carolina for #BojanglesSouthern500  @TooToughToTame - Track President @Kerry_Tharp is nation's top sports marketing pro. #SCWinning", "2018-09-01T14:02:38.000Z": "Today we are remembering the life of John McCain. Sailor, Senator, father, husband, hero, and friend. Please take a moment to remember his legacy and all that he meant to our country when you look up and see the flags at half staff today.", "2018-08-30T22:03:29.000Z": "James Smith believes that raising your taxes is the \"right thing to do.\" But I want to cut your taxes & keep your hard-earned money in your wallet where it belongs."}