{"2020-07-30T18:23:26.000Z": "As we go down this road full of unknowns, our effort remains to save lives and livelihoods. It is certain we will face daunting new challenges in the coming months, but my confidence remains strong in the people of Utah to step up and beat this virus.", "2020-07-30T18:14:00.000Z": "Yesterday, I also met with education and legislative leaders and heard candid opinions from the UEA, school board representatives, state superintendents, and more. We all are united in our gratitude for our teachers.", "2020-07-30T17:59:34.000Z": "Since the start of the pandemic, as your state government we have been clear about what we know and don't know about the coronavirus. #COVID19", "2020-07-27T20:32:24.000Z": "I appreciate receiving your nomination, @GovernorLittle . I wear a mask to keep my family and friends safe and to show gratitude to our healthcare professionals and essential workers. Now, I nominate @GovSisolak to tell us why he wears a mask. #MaskUpAmerica  #MaskUpUtah Quote Tweet Brad Little @GovernorLittle 0:18 Thanks to @GovernorGordon of Wyoming for the nomination. I nominate @GovHerbert to share why he wears a mask in Utah! #MaskUpIdaho  #MaskUpAmerica  #OneIdaho  #MaskUpUtah", "2020-07-24T15:05:07.000Z": "This Pioneer Day I join Utahns across the state in honoring the extraordinary men and women who helped make Utah a great place to live, work and raise a family. May we not only remember these remarkable pioneers, but also reflect on what we can do to follow in their footsteps.", "2020-07-23T18:38:47.000Z": "My prayers are with Sgt. Mount's family and friends today. A life of kindness, love and friendship is one well-lived no matter the length of time. As Utahns we extend our heartfelt gratitude toward his willing service. His unique and compassionate spirit will be sorely missed.", "2020-07-22T18:01:25.000Z": "Our effort from the beginning has been to save lives and livelihoods. While Utah has one of the lowest mortality rates as a state, that doesn't mean much to the families who have lost loved ones. For them, the mortality rate feels like 100%. #utahcovid19", "2020-07-22T15:31:56.000Z": "Some actions we've already taken include: implementing implicit bias training for my cabinet; banning the use of chokeholds by law enforcement; launching a Racial Equity and Inclusion Fund replete with $1 million in funding to support multicultural organizations\n(2/4)", "2020-07-22T15:31:55.000Z": "Last week I had the privilege of meeting with members of our Multicultural and Martin Luther King Jr. Commissions to discuss racial equity in Utah. I appreciate the voices shared at these meetings and am encouraged by the initial steps that have begun.\n(1/4)", "2020-07-21T20:38:11.000Z": "I am deeply saddened to hear of Judge Kwan's passing today. He served the citizens of Utah well. My thoughts are with Judge Kwan's family and friends as they mourn his passing.", "2020-07-20T20:34:30.000Z": "Very appreciative of @ChrisEvans giving me the opportunity to participate in this project. @ASP enables people to hear directly from their elected leaders on important issues and gives the electorate greater capacity to make informed decisions. Quote Tweet A Starting Point @ASP Thank you @GovHerbert for your time & contribution to #AStartingPoint  https:// astartingpoint.com/contributors/g ary-herbert_cPUolpKWN ", "2020-07-20T15:00:31.000Z": "Roughly 50% of Utahns have a condition that puts them at higher risk for serious illness from COVID-19. Check the guidelines to make sure you know how to keep yourself and your family safe and healthy. https:// coronavirus.utah.gov/protecting-hig h-risk-individuals/ ", "2020-07-18T23:04:55.000Z": "Rep. Lewis was a luminary activist whose courage and resilience helped form a better America. His venerable leadership in congress will be sorely missed. Flags have been lowered to half-staff on all public buildings throughout Utah until sunset today to honor his life and service", "2020-07-17T16:54:38.000Z": "Though many Utahns still need work, the latest unemployment data for June is cause for much optimism. Utah has established itself as one of the best states in the nation for economic recovery. I am confident we can protect public health while continuing to re-engage our economy.", "2020-07-16T18:14:10.000Z": "We can turn this tide! Let us all show we love and care for our neighbors by practicing physical distancing and mask-wearing. This will only succeed if we work together.", "2020-07-16T18:03:04.000Z": "Let me be clear. This modification does not require districts to open, but gives them permission to do so with a reopening plan.\n\nWe have seen many districts wisely planning this reopening. Many have incorporated elements of distance learning along with in-person instruction.", "2020-07-16T18:03:03.000Z": "Some exceptions to the mandate: when you are maintaining a distance of 6+ feet, when eating lunch, and when children younger than 3 are on school campuses. Deaf and hard of hearing students and educators should use clear face shields, as they need to see facial expressions.", "2020-07-16T17:54:56.000Z": "Last week, I issued a challenge to Utahns to get us a 7-day rolling average below 500 cases. That challenge still stands, and I believe we can get there. #UtahCOVID", "2020-07-14T00:45:02.000Z": "As we learn more about this virus, we are better able to protect ourselves, our families and our community. Wearing a mask is essential to protection. You might not have symptoms and still be spreading COVID-19 to others. For more information visit https:// coronavirus.utah.gov/mask-faq/", "2020-07-10T21:22:07.000Z": "I agree. Thanks to @danmccay for encouraging us to wear masks to protect our lives and liberties. As leaders from our churches, hospitals, and businesses have reiterated, all we ask is wear a mask! #MaskUpUtah Quote Tweet Spencer Cox @SpencerJCox If you haven't read this brilliant piece by Senator @danmccay please do. And PLEASE wear a mask anytime you are unable to socially distance. https:// deseret.com/opinion/2020/7 /8/21315315/dan-mccay-life-liberty-masks-covid-19-pandemic-utah-divisive-politics-public-health ", "2020-07-10T18:23:36.000Z": "Thank you to @WhiteHouse & @FEMA for approving Utah's Disaster Declaration. This will provide individuals in Davis and Salt Lake counties with federal funding to help recover from earthquakes this spring. More info at https:// disasterassistance.gov", "2020-07-09T18:49:25.000Z": "I believe in you, Utah. So let us all wash our hands, wear our masks, and put our shoulder to the wheel to get this done.", "2020-07-09T18:44:37.000Z": "Yesterday was our highest case count day with 722 new cases. But our rolling 7-day average as of yesterday was 576.  So I have a challenge for you, Utah. We need to get our 7-day rolling average below 500 by August 1.", "2020-07-09T18:44:36.000Z": "Today I want to reiterate the importance of protecting both lives and livelihoods. We need to stay safe and stay open. #coronavirus", "2020-07-06T17:47:26.000Z": "I'm happy to see the Annie E Casey Foundation ranked Utah 4th in America for overall child well-being. Thank you to all of the parents, educators, and community members dedicating their time to make Utah a great place to raise children. #utpol 2020 KIDS COUNT Data Book Interactive - The Annie E. Casey Foundation The Casey Foundation tracks overall child well-being in the United States along four domains. Find out how states rank and perform on 16 key indicators now. aecf.org", "2020-07-04T14:22:46.000Z": "It's an honorable act to sacrifice some personal comfort or family traditions this year as we face the largest pandemic of our lifetimes. All we ask is wear a mask!", "2020-07-04T14:22:45.000Z": "In the Declaration of Independence, our founders pledged to one another their lives, their fortunes and their sacred honor. As Americans and Utahns, we can take the same pledge, to protect one another from COVID. #4thofJuly", "2020-07-03T01:33:26.000Z": "While we celebrate this weekend, let's do so safely. COVID-19 has changed how we interact & celebrate. Gather in smaller groups, hold events outside, practice physical distancing, and use masks. Be especially careful around older family members and those at higher risk.", "2020-07-02T22:01:13.000Z": "As we go into this holiday weekend, it will be critical for Utahns to practice responsible fireworks use. Understanding when and where you can use fireworks safely will help to ensure we all can enjoy the outdoors during these summer months. Quote Tweet Utah Public Safety @UtahDPS Fireworks Safety Tip:\nBe Aware\nIf your 4th of July celebrations will include fireworks, make sure you celebrate safely.\nFind info & tips to keep your 4th safe here: https:// dpsnews.utah.gov/?p=3851", "2020-07-02T17:58:14.000Z": "Tomorrow, the flag of the United States of America and the flag of the State of Utah will be lowered to half-staff in honor of @usairforce", "2020-07-01T16:47:22.000Z": "Thanks to our partners who helped procure and deliver 500k masks for students and teachers across Utah. These will be critical in getting kids back to school next month. I greatly appreciate @Boeing for delivering these masks free of cost.", "2020-06-29T20:05:34.000Z": "I am grateful for the diligent work of our State Board of Education to address the upcoming school year. It is imperative we implement a plan which allows for a safe return to school for students, instructors and administrators. Quote Tweet K-12: Utah Public Schools @UTPublicEd . @GovHerbert has approved USBE's Reopening Schools State Requirements and Recommendations.\n\nDistricts and charters will use these requirements as a basis for their unique local plans to return students to in-person instruction this fall.\n\nDetails: https:// tinyurl.com/ycb75erk", "2020-06-29T02:07:54.000Z": "Very proud of our heroic firefighters who are saving lives and property under extreme conditions. Quote Tweet Spencer Cox @SpencerJCox We had to leave this neighborhood because of thick smoke and intense flames-convinced that many homes would be lost. But these heroes from every jurisdiction jumped in and held things off until the wind shifted. Somehow they saved every single one. #KnollsFire", "2020-06-29T01:35:57.000Z": "We also are carefully monitoring the fire in Saratoga Springs and are concerned for those in the area. All Utahns in the vicinity of the fires are asked to follow direction from local public safety officers.", "2020-06-29T01:32:27.000Z": "I greatly appreciate the diligent work of first responders in combating the #TraverseFire and #KnollsFire . Visiting with the response team in Lehi, I was impressed by their preparedness and composure despite the challenge of containment.", "2020-06-28T16:04:11.000Z": "Most of Utah is under a #RedFlagWarning for fire today. High temps, high winds, low humidity & drought conditions mean a small spark could become a catastrophe. Let's all exercise extreme caution and stay safe.", "2020-06-28T16:03:58.000Z": "Heartfelt gratitude to rapid, heroic work by fire crews pushing back wildfire on steep terrain in dark & windy conditions to protect life & property. #lehifire", "2020-06-27T00:08:24.000Z": "As we welcome home @USAirForce", "2020-06-25T02:11:30.000Z": "I wholeheartedly agree with Utah's faith leaders. If you love your neighbor, you ought to do what you can to protect them. Please wear face coverings when out in public and follow common sense health guidelines. The following media includes potentially sensitive content. Change settings View", "null": "", "2020-06-24T17:51:01.000Z": "I don't enjoy wearing a mask, but I do it to protect my family, friends and coworkers. Although it may feel like an \"inconvenience\", we must come together for the common good and follow the health precautions. With our loved ones at stake, this can't become political. #MaskUpUtah", "2020-06-24T22:44:34.000Z": "In many respects, Utah has done very well. From the beginning of this crisis we have emphasized that we cannot eliminate all health risks. We have emphasized that we are trying to protect lives and livelihoods. Our ultimate outcome in this respect is among the best in the nation.", "2020-06-24T22:25:13.000Z": "Additionally, due to the increase of cases, we will not be considering applications for relaxation of our color coded guidance for the next two weeks.", "2020-06-24T22:25:12.000Z": "All Utahns should be very concerned about the recent increases in infections and how that could impact our hospital capacity. We mourn with those who have lost loved ones.", "2020-06-23T02:36:13.000Z": "Dr. Dunn's internal memo raises alarm about the increasing COVID-19 cases in Utah. I appreciate her analysis and share many of her concerns. We will work to stem this tide, but I have no plans to shut down Utah's economy.", "2020-06-20T20:22:50.000Z": "As we see COVID-19 cases spike, I urge all Utahns to use face coverings. I wear face masks every day. I know it can look and feel a little different. But data shows it slows the spread of this pernicious virus. #StayStrong Utah. https:// governor.utah.gov/2020/06/12/why -utahns-should-wear-a-facemask/ ", "2020-06-20T17:49:10.000Z": "This #WorldRefugeeDay , I am grateful for the 65,000 refugees who call Utah home. Refugees help enrich our state through their unique heritage and experiences, and we are proud to call them our friends and neighbors.", "2020-06-19T22:21:51.000Z": "The counties that moved to Green today cover a lot of Utah's landmass, but only 3% of our population. They have low case counts and are sparsely populated. No area is completely free from risk, but these rural regions meet the criteria to move from Yellow to Green. Quote Tweet Gov. Gary Herbert @GovHerbert Today, I have issued an executive order moving sections of rural Utah to Green Health Risk Status. For more information please visit https:// governor.utah.gov/2020/06/19/mov ing-rural-utah-to-green/ ", "2020-06-19T22:21:18.000Z": "Utah's case counts concern me.  We are monitoring hospital capacity in our densely populated counties. Their risk status has not changed. #StayStrong Utah! Let's continue to keep safe by wearing face coverings, keeping our distance and practicing excellent hygiene.", "2020-06-19T21:53:40.000Z": "I am very grateful for the decisive and substantive work we are witnessing from the Legislature this special session. Addressing pressing budgetary, fiscal and social concerns is vital to helping our state navigate the many new challenges we face. #utpol", "2020-06-19T19:57:31.000Z": "Today, I have issued an executive order moving sections of rural Utah to Green Health Risk Status. For more information please visit https:// governor.utah.gov/2020/06/19/mov ing-rural-utah-to-green/ ", "2020-06-19T18:24:50.000Z": "#Juneteenthday commemorates a momentous chapter in our nation's history for liberty. Although we are working to make positive strides, much can still be done to achieve greater equity and inclusion. I look forward to engaging with all Utahns in pursuit of racial justice.", "2020-06-19T17:08:30.000Z": "According to May's employment data, Utah has posted some of the best unemployment and job numbers in the country during the pandemic. While these data are encouraging, numerous Utahns remain unemployed. We must continue to make getting everyone back to work safely a priority. Quote Tweet Jon S. Pierpont @JonSPierpont You can find all the details about the May 2020 employment report, and listen to Chief Economist Mark Knold's summary analysis, here: https:// jobs.utah.gov/blog/post/2020 /06/19/utah-s-employment-summary-may-2020  | #utpol  #UTecon  #utbiz", "2020-06-17T19:59:25.000Z": "As we now grow out of this downturn, it remains imperative for Utahns to continue to take personal responsibility to follow public health guidance.", "2020-06-17T19:59:24.000Z": "Our immediate need is to see that Utahns who lost employment are re-employed as soon as possible. Volume 4 also emphasizes investment in construction-ready infrastructure projects that will have a very high multiplier effect for immediate economic growth.", "2020-06-17T19:56:12.000Z": "Keeping Utah on the path to recovery, I am pleased to showcase Utah Leads Together Volume 4 today. Volume 4 lays the foundation for recovery and has us consider what is most important in the next 100 days, 250 days and 500 days.", "2020-06-17T19:52:49.000Z": "Due to the COVID-related economic downturn, our consensus revenue numbers for fiscal years 2020 and 2021 show a deficit of $93 million in one-time funding and a deficit of $757 million in ongoing funding in the general and education funds.", "2020-06-16T17:27:16.000Z": "My heart goes out to the family of Air Force 1st Lt. Kenneth Allen. He was a Utahn dedicated to making a difference in the world, and kept his virtue through both triumph and disaster. His truly unique and altruistic spirit will be greatly missed.", "2020-06-15T17:07:12.000Z": "Reducing the spread of coronavirus is a community effort. An easy way to play your part is by wearing a mask when physical distancing is not possible. https:// governor.utah.gov/2020/06/12/why -utahns-should-wear-a-facemask/ ", "2020-06-14T16:29:00.000Z": "As I see the flag of the United States displayed across Utah today, I am grateful for our nation and freedoms. On this #flagday , may we honor the memory of those who have served the country by making a commitment to do better by our fellow man.", "2020-06-12T21:46:46.000Z": "This Great Outdoors Month, I hope all Utahns take the chance to enjoy the numerous outdoor treasures Utah offers. As you venture outside, please remember to practice #ResponsibleRecreation  https:// stateparks.utah.gov/2020/04/02/wha t-is-responsiblerecreation/ ", "2020-06-11T19:12:10.000Z": "However, the Southwest Utah Health Department has requested Kane County be moved to green. Because Kane County has very few cases, zero ICU bed use for the past 14 days, and low community transmission, we are comfortable allowing the move to green tomorrow at 10 am.", "2020-06-11T19:12:09.000Z": "For those with questions about the state's health risk guidance, most of the state is currently in Low Risk, or Yellow. Importantly, under the Yellow risk status, there are no economic activities that are categorically prohibited if common-sense precautions are in place.", "2020-06-11T18:54:42.000Z": "Regarding Utah's budget outlook, I plan to call a Special Session of the legislature next week. Because the economic downturn has decreased state revenue, the legislature needs to meet before we begin out next fiscal year in July to address potential budgetary modifications.", "2020-06-11T18:53:00.000Z": "Utah was founded as a place of refuge for those seeking escape from hatred and persecution. We can do better to live up to that ideal in our daily actions and in our policies that we create.", "2020-06-11T18:52:29.000Z": "I will meet again with these groups early next month to continue our discussions and review actions we have taken. However, here are things we are doing right now to make a difference:", "2020-06-11T18:52:28.000Z": "Last Tuesday, I gathered with members of our Martin Luther King Jr. Commission and Multicultural Commission for an emergency joint meeting. It was sobering to be reminded that far too many within our multicultural communities continue to experience discrimination.", "2020-06-08T03:47:14.000Z": "Their return marks the end of the Utah National Guard's support to assure the safety of peaceful protestors in DC and Salt Lake City. National Guard units called to augment civil authorities in Salt Lake and at the Utah State Capitol began demobilizing first thing Sunday morning.", "2020-06-08T03:47:13.000Z": "Soldiers from the Utah National Guard returned this evening after five days in Washington D.C. I am grateful for their professional service protecting national monuments, assisting cleanup efforts, and augmenting civil authorities in Washington, D.C. amid civil unrest.", "2020-06-06T18:40:07.000Z": "Utah offers its deepest condolences to the family of Officer Lyday and the Ogden community. I am grateful for his heroism, love, and service. Now more than ever, we need law enforcement like Nathan; capable of empathy, courage, and understanding as they do their difficult jobs.", "2020-06-06T14:51:17.000Z": "76 years ago today, thousands of brave soldiers stormed the beaches of Normandy in a heroic effort to fight tyranny and preserve freedom. I am ever-grateful for their sacrifice #DDay .", "2020-06-05T23:09:27.000Z": "We call on @slcpd and @UPDSL (as lead investigator) to be thorough, transparent, swift and just in their review of Bernardo Palacios-Carbajal's unfortunate death.", "2020-06-04T23:06:08.000Z": "I'm thrilled the Utah Navajo Water Rights Settlement Act passed the U.S. Senate and look forward to House consideration. It creates clean drinking water projects for our Navajo friends and certainty for Utah's future water needs. My sincere thanks to @SenatorRomney and @NNPrezNez Quote Tweet Senator Mitt Romney @SenatorRomney The Navajo Utah Water Rights Settlement Act has unanimously passed the Senate! #COVID19 has disproportionately impacted the Navajo Nation in our state, and the shortage of running water in nearly half of the homes is contributing to the spread. https:// romney.senate.gov/senate-passes- romney-bill-settle-water-rights-navajo-nation-utah  Show this thread", "2020-06-03T22:46:07.000Z": "I was grateful to meet WWII Veteran Sidney Walton yesterday. His selfless service and message of hope as he travels across the country are a reminder to us all to be unwavering in our kindness.", "2020-06-02T01:35:15.000Z": "I have issued an executive order temporarily closing the State Capitol Complex to the public.", "2020-05-31T22:53:51.000Z": ". @BenWinslow was on the hill late last night covering protests - and he was back again this afternoon. He's a great example of dedicated journalism in Salt Lake (and a great example of mask wearing!). Quote Tweet Ben Winslow @BenWinslow \"Certainly there are issues that need to be discussed. And we need to make sure we understand the underlying issues there and see what we can do to make it better,\" @GovHerbert says of the motive for the demonstrations: https:// fox13now.com/governor-says- utah-national-guard-will-remain-on-standby-after-slc-curfew-ends   @fox13  #utpol  #Utah Show this thread", "2020-05-31T20:32:56.000Z": "Overwhelmed and grateful to meet with people who helped care for and clean the people's house after last night's protests. People are stepping up right and left - cleaning in the hot sun, offering cool water, and dropping off pizza.", "2020-05-31T04:43:51.000Z": "We were deeply saddened to see the defacement of our beautiful Capitol building by this weekend's protesters. We are heartened by the many individuals wanting to help clean its stone walls and grounds.", "2020-05-30T23:11:53.000Z": "We condemn violence and looting. I have activated the National Guard to help control the escalating situation in downtown Salt Lake City. I once again call on all who are protesting to do so peacefully.", "2020-05-30T22:56:56.000Z": "We call upon the good people of Utah to engage civilly and to act peaceably as they seek to exercise their First Amendment rights.", "2020-05-30T22:56:07.000Z": "We are grateful for the swift actions taken by the state of Minnesota to hold those responsible for his death accountable. We can not, however, condone violence, defacement of public buildings, and destruction of property.", "2020-05-30T22:55:24.000Z": "We are in close contact with our department of public safety and receiving regular updates. Our hearts break for the family of George Floyd and for his unnecessary death.", "2020-05-29T21:24:34.000Z": "To graduating seniors, congratulations on your achievements! Though we are unable to celebrate this milestone in typical fashion, it does not diminish all your hard work. I have been amazed by the determination you have shown and am proud to have you as part of our state.", "2020-05-29T02:49:18.000Z": "I am heartbroken to hear the news from Ogden this evening. Standing tall in the line of duty is a brave and noble act, and my prayers are with the fallen officer's family and friends. Tonight, the whole state mourns with @OGDEN_POLICE", "2020-05-28T17:15:14.000Z": "I have appreciated the opportunity to collaborate with @NNPrezNez and @UT_Indian on efforts to combat the coronavirus.", "2020-05-28T17:11:42.000Z": "Recent data has indicated that as of Tuesday, the Navajo Nation, which has a population of just under 175,000, has experienced 158 deaths. To put that in perspective, Utah, with a population of over 3 million, has had just over 100 deaths total.", "2020-05-26T19:32:17.000Z": "A key part of the Utah Leads Together 3.0 plan is protecting Utah's high-risk populations. As we move to different risk phases, it is still important for high-risk individuals to adhere to recommended guidelines. You can find more at: https:// coronavirus.utah.gov/protecting-hig h-risk-individuals ", "2020-05-25T14:57:41.000Z": "This Memorial Day, I am calling upon all Utahns to observe a day of prayer for permanent peace, and ask that we all come together for a shared moment of silence at 3 p.m. to honor and reflect on those who died protecting our freedoms.", "2020-05-25T14:57:40.000Z": "Memorial Day is a time for Americans to unite and solemnly honor the men and women who marched, flew and sailed in defense of the nation, never to return home. In these uncertain times, it is our responsibility to honor those who have given their lives to ensure our freedoms.", "2020-05-24T14:33:18.000Z": "This morning, the flag of the United States of America and the flag of the State of Utah have been lowered to half-staff. We join with the entire country in paying our respects to those who have lost their lives in this pandemic. Flags will remain lowered until sunset tonight.", "2020-05-23T16:26:12.000Z": "The Navajo Nation offers their appreciation to Gov. Herbert's team for their outreach to assist our Navajo citizens in Utah. Our Office treasure Deputy Chief of Staff, Mike Mower, and he's been a friend to NNOPVP. Ahé'hee! Quote Tweet Gov. Gary Herbert @GovHerbert Today my Deputy Chief of Staff @MikeLMower traveled to Blanding with representatives from the Utah Department of Agriculture and @UtahFarmBureau to help deliver 18,000 pounds of lamb to Blanding's food pantry to assist the Navajo Nation. Show this thread", "2020-05-22T20:21:05.000Z": "I am very grateful for the hard work of @JobsUT over the past several weeks. We know this is a trying time for many Utahns, but are hopeful Utah will be able to minimize coronavirus' economic impact on families. Quote Tweet Jon S. Pierpont @JonSPierpont I'm humbled to see the depth of impact the COVID-19 pandemic has had on our state and workforce. At @JobsUT , we're committed to continue serving the many individuals & families in our communities who are still struggling through this global crisis. #UTecon  #utpol  #utbiz  #OneUtah", "2020-05-22T19:20:52.000Z": "Mobile testing gives Utah officials advantages, clearer picture of outbreak Decision allowing anyone and everyone to be tested paints more accurate assessment of San Juan outbreak deseret.com", "2020-05-22T19:20:51.000Z": "Today my Deputy Chief of Staff @MikeLMower traveled to Blanding with representatives from the Utah Department of Agriculture and @UtahFarmBureau to help deliver 18,000 pounds of lamb to Blanding's food pantry to assist the Navajo Nation.", "2020-05-22T18:02:13.000Z": "Thanks to my friend Jeff Robbins for sending this picture to me. Jerry was old school, a legend, and will be greatly missed. #TakeNote", "2020-05-22T16:32:41.000Z": "Jerry Sloan was a fierce competitor and disciplinarian - and he was the heart and soul of the Utah Jazz for years. His emphasis on defense and team play got the most raw talent out of the players. Our prayers are with Jerry Sloan's family and friends as they mourn his passing. Quote Tweet utahjazz @utahjazz Rest easy, Coach » https:// on.nba.com/3cV2c6f", "2020-05-20T22:35:35.000Z": "I was saddened to hear of the passing of Representative Howard Nielson this morning. He was a tremendous example of compassionate leadership, a tireless worker, and a brilliant statistician. Our thoughts and prayers are with his family at this time.", "2020-05-20T20:01:50.000Z": "Today I am excited to share with you Version 3 of our Utah Leads Together Plan. This builds upon Versions 1 and 2 to plant the seeds for statewide recovery.", "2020-05-20T18:14:25.000Z": "Today I am pleased to announce the appointment of Ron Allen to the Utah Public Service Commission. Ron's prior experience in the Utah State Senate and on the Public Service Commission will prove to be a valuable asset.", "2020-05-18T23:58:43.000Z": "The Utah Senate has confirmed the following Governors appointments to the newly-formed Utah Board of Higher Education. #utpol", "2020-05-18T21:07:01.000Z": "Today the First Lady and I were able to join President Donald Trump and First Lady Melania Trump as well as  governors and first spouses on a call focused on improving mental health. #utpol", "2020-05-15T21:59:16.000Z": "We can all support Utah agriculture and businesses. Shop local, and wear a mask!", "2020-05-15T18:59:23.000Z": "This morning, members of Utah's Incident Command met with minority party leadership in the House and Senate. Grateful to all of our legislators for their commitment and partnership in the fight against COVID-19. #utcovid19", "2020-05-14T21:33:45.000Z": "Clarification to today's press conference and earlier social media posts: Team sports is youth or club sports; this does not include sanctioned @UHSAAinfo school sports and activities.", "2020-05-14T19:16:15.000Z": "Grateful to thousands of Utah volunteers and to ProjectProtect for donating medical-grade masks to caregivers in our communities. Healthcare facilities interested in receiving these clinical masks can contact their local Health Department.", "2020-05-14T19:09:02.000Z": "Utah's decision to move its health guidance from Moderate Risk (Orange) to Low Risk (Yellow) in Southeastern Utah does not apply to the current situation on Navajo Nation lands located in Utah, as these are sovereign lands.", "2020-05-14T18:26:00.000Z": "Don't wear a mask for yourself - wear it for everyone around you. #utcovid19 The Real Reason to Wear a Mask Much of the confusion around masks stems from the conflation of two very different uses. theatlantic.com", "2020-05-14T18:19:45.000Z": ". @CDCgov recommends wearing face masks in public, particularly because asymptomatic spread of COVID-19 can occur. https:// cdc.gov/coronavirus/20 19-ncov/prevent-getting-sick/cloth-face-cover.html ", "2020-05-14T18:10:37.000Z": "Do you understand Utahs color-coded health guidance system? Learn more here: https:// coronavirus.utah.gov/utahs-health-g uidance-system/ ", "2020-05-14T17:39:12.000Z": "What changes Saturday morning at 12:01 a.m. for counties moving to yellow?\n-Although schools will remain closed, we will be opening up opportunities for drivers education.\n-You are no longer asked to leave home infrequently.", "2020-05-14T17:34:02.000Z": "Individuals in high-risk categories, including older adults and those who are immunocompromised (and those who care for them) need to continue to follow \"high risk\" protocols, regardless of whether their community is under an orange or yellow designation. #utcovid19", "2020-05-14T17:31:38.000Z": "Studies show that wearing masks - even homemade ones - dramatically decreases the spread of COVID-19. Wear a mask when around others to prevent spreading any germs you might have. #utcovid19 If you don't have a mask, you can order one for free here: https:// coronavirus.utah.gov/mask/", "2020-05-14T17:28:49.000Z": "Utah's K-12 schools will remain closed through the end of the school year. We are grateful to teachers, parents, and students for the extra effort they continue to put into learning from home.", "2020-05-14T17:27:12.000Z": "We have been tracking data across Utah, and working closely with local health departments to understand how COVID-19 is impacting our communities. Saturday morning at 12:01, much of the state will transition to low-risk, or yellow. #utcovid19 Guidelines for individuals here:", "2020-05-13T17:00:23.000Z": "Contact tracing is an important part of stopping disease outbreaks. Find out how contact tracing works: https:// coronavirus-download.utah.gov/Health/COVID_C ontact_Tracing_English.pdf ", "2020-05-13T04:40:30.000Z": "Great read. I couldn't be more proud of our team and they way they organized and ramped up under impossible and unprecedented conditions. Utah has spent over $108 million in COVID-19 response Despite 'nefarious' market, state officials say they've spent taxpayer dollars wisely amid health crisis deseret.com", "2020-05-13T00:25:00.000Z": "We are deeply saddened to hear of the tragic incident that happened in Little Wildhorse Canyon. Our thoughts and prayers are with the family at this time.", "2020-05-11T23:24:16.000Z": "We're actively monitoring the situation in slot canyons near Goblin Valley State Park through @UtahDPS . More information will be provided as it becomes available.", "2020-05-10T22:07:03.000Z": "Photo from 2019.", "2020-05-10T21:57:20.000Z": "Happy Mother's Day to the First Lady, Jeanette and all the amazing mothers of Utah. Today, I hope we will recognize the importance of mothers and family especially at this unprecedented time.", "2020-05-07T18:39:09.000Z": "The farmers and ranchers of Utah are the bedrock of our state. This campaign is a true example of a win-win, and I encourage people who can to visit http:// FarmersFeedingUtah.org to see how they can help. Quote Tweet Spencer Cox @SpencerJCox Big announcement today-an opportunity for all of us to help struggling farmers AND our neighbors experiencing food insecurity. This really is the best of Utah. Please donate here: https:// farmersfeedingutah.org", "2020-05-07T17:40:30.000Z": "We're working to gather more information on how COVID-19 is spreading in Utah, and @UofUHealth 's new randomized antibody testing will help give us a better understanding of how the virus has impacted our communities.", "2020-05-07T17:37:02.000Z": "The transmission of COVID-19 in Utah is currently less than 1:1, and our hospital capacity is in good shape. Our supplies of PPE are now robust, where they were once in short supply. #utcovid19", "2020-05-06T19:01:43.000Z": "Thank you Secretary Bernhardt. We know Utahns look forward to enjoying this beautiful park again - as they do so, we remind all to socially distance, and adhere to any specific guidance given by the park. Quote Tweet Secretary David Bernhardt @SecBernhardt Incredible view today from Bryce Point @BryceCanyonNPS . The park is no longer closed and is accessible to the public again! https:// nps.gov/brca/planyourv isit/bryce-canyon-national-park-public-health-update.htm ", "2020-05-04T21:23:34.000Z": "This recommendation continues all the way through the yellow, low-risk phase.", "2020-05-04T21:21:29.000Z": "In Utah's moderate risk phase, we encourage employers to have employees telework wherever possible. This will help keep our communities and workplaces safe and healthy. #utcovid19", "2020-05-04T21:03:30.000Z": "Conducting interviews this week to replace Jordan White, who recently resigned from the Utah Public Service Commission.  Finalists for this position (which must be filled by an Unaffiliated or Democratic individual) are:", "2020-05-02T15:33:23.000Z": "A Message from President George W. Bush @TheCalltoUnite", "2020-05-01T03:15:02.000Z": "There are still precautions in place going from a red category (high risk) to an orange category (moderate risk). Continue to maintain strict hygiene, wear masks in public and stick to only essential travel.", "2020-05-01T13:30:05.000Z": "Starting today, Utah is moving to the orange (moderate risk) phase of COVID-19. This brings a few adjustments, but it's important to always wear a mask in public and maintain 6 ft. of distance from others. Learn more: https:// coronavirus.utah.gov/utahs-moderate -risk-phase/ ", "2020-05-01T15:43:51.000Z": "Today is the first day of Utah's moderate risk phase in our fight against COVID-19. Read more about what this means for your family, friends, workplace, or business here: https:// coronavirus.utah.gov/utahs-moderate -risk-phase/   #utcovid19  #TogetherUtah", "2020-04-30T20:32:33.000Z": "I hope you had the chance to see the \"Salute to Utah\" flyover from Ogden to St. George taking place this afternoon led by our F-35A team.\n\nWe are grateful for the hard work of our healthcare workers, first responders, other essential employees and all Utahns during this time.", "2020-04-30T19:48:30.000Z": "We are watching data very closely as we enter the orange phase. If necessary, we will quickly transition back to red. Please exercise caution as we loosen restrictions this weekend. #utcovid19", "2020-04-30T19:45:41.000Z": "Doing the little things makes a difference. All of us working together to take precautions can make a big difference in slowing the spread of COVID-19.", "2020-04-30T19:44:07.000Z": "Previously closed businesses, including restaurants, bars, personal care facilities, salons, and gyms, can reopen when they exercise strict precautions. \n\nDine-in options can resume, where eating establishments exercise strict precautions.", "2020-04-30T19:44:06.000Z": "Wear a mask in public. Practice social distancing. Wash your hands as frequently as feasible. We are moving to orange, but now is not the time to relax.", "2020-04-30T19:40:00.000Z": "At 12:01 tonight, Utah will transition from high risk to moderate risk - red to orange. There is reason for us all to be optimistic, as we implement our plan and exercise caution.", "2020-04-30T19:38:12.000Z": "Register for an appointment at http:// dmv.utah.gov .", "2020-04-30T19:37:51.000Z": "A few quick observations - we are aware of crowing issues at our DMVs. For that reason. I have suspended enforcement on expiring vehicle registrations through May 15. This order is effective immediately.", "2020-04-29T23:20:56.000Z": "The State of Utah has received a full refund on the  $800,000 purchase of chloroquine/hydroxychloroquine. We have determined that all involved acted proactively, preemptively and prudently during an emergency in an effort to save lives, and everyone acted in good faith.", "2020-04-28T20:07:24.000Z": "Funding for this program comes from the CARES Act. \n\nThe program is designed to get a mask into the hands of everyone, especially those who do not have access to them. They are being made by Utah manufacturing companies. \n\nThis is a one-time program to create 2 million masks.", "2020-04-28T20:06:39.000Z": "A Mask for Every Utahn will provide 2 million masks to Utahns, free of charge. \n\nRequest a mask here: https:// coronavirus.utah.gov/mask/ Please request only one mask per person - and only request a mask if you do not already have one. #utcovid19  #masks  #UtahMask", "2020-04-28T20:02:00.000Z": "We are beginning to enter a stabilization phase. We need you to take ALL precautions seriously. Moving forward into MODERATE RISK, or orange, and continuing our positive trends, is wholly dependent on you continuing to take precautions seriously.", "2020-04-28T19:59:36.000Z": "Those who are vulnerable (or who interact with vulnerable individuals), should continue to exercise the most strict precautions.", "2020-04-28T19:58:54.000Z": "Starting Friday, May 1, you will be able to: \n- Gather with small groups of friends or family outside your immediate household, as long as everyone participating has been following distancing and hygiene guidelines. #utcovid19", "2020-04-28T19:54:34.000Z": "- You should still shop infrequently - make one large grocery shopping trip instead of many small ones.\n- Carryout and delivery services at restaurants are still strongly encouraged,\n- But dine-in services can resume IF restaurants meet strict distancing and hygiene requirements.", "2020-04-28T19:54:33.000Z": "Our actions as individuals should not change much going from red to orange: \n\n- Take extreme precautions generally. \n- Stay 6 feet away from others when outside the home, unless not possible.", "2020-04-28T19:50:12.000Z": "Utah is in a HIGH RISK, or RED phase. Today I am announcing, in coordination with @UtahDepOfHealth , that Utah will transition to MODERATE RISK, or ORANGE phase, on Friday, May 1.", "2020-04-28T19:47:29.000Z": "We identify which level of risk our communities are facing by analyzing a data dashboard, which compares data on hospitalizations, hospital capacity, and testing, to name a few key metrics.", "2020-04-28T19:47:28.000Z": "We are diligently following the Utah Leads Together plan. It is directed by medical science and data. It contains a color code -", "2020-04-28T19:45:11.000Z": "We have procured over 5 million N95 or KN95 masks, over 4 million surgical gowns, and over half a million face shields. We are continuing to build up these supplies.", "2020-04-28T19:45:10.000Z": "We have set up 62 different testing sites around the state, and three mobile test collection units that work with vulnerable populations around the state.", "2020-04-28T19:45:09.000Z": "I'm grateful to the people of Utah for following instructions to #StaySafeStayHome . This has allowed us to build up capacity in our healthcare systems, and to stay within our hospital capacity.", "2020-04-24T22:46:44.000Z": "Very best wishes to all the Utahns celebrating #Ramadan . May you all be blessed at this time. #UtahRamadan2020  @CivicUtah", "2020-04-24T21:16:34.000Z": "Whenever someone tests positive for COVID-19, experts at @UtahDepOfHealth contact them to help identify other people they may have infected, so we can reach out to close contacts.", "2020-04-24T21:07:54.000Z": "Testing is crucial to identifying where COVID-19 is spreading, and how much spread we have in our communities. Download the Healthy Together app to assess your symptoms and locate testing centers.", "2020-04-24T21:01:37.000Z": "We can control our destiny and protect our loved ones. Maintaining our strong trajectory depends on you and your continued efforts to stay safe and stay home. Stay strong. There is a glimmer of light at the end of this tunnel.", "2020-04-24T20:55:41.000Z": "Public health officials are doing case investigations, and notification of close contacts. This involves interviewing all newly identified positive cases, determining who they have been in contact with, determining which of those contacts are considered to be \"close\" contacts.", "2020-04-24T20:55:40.000Z": "", "2020-04-24T20:55:39.000Z": "I have asked the commission to come back to me with specific recommendations on 1) caring for high-risk populations and 2) geographic areas of concern. \n\nIt is possible that not all areas of the state will move to orange at the same time.", "2020-04-24T20:55:38.000Z": "I am still reviewing recommendations from the Public Health and Economic Emergency Commission to transition Utah to an Orange phase. Good trends in data show that we could make that transition as early as the end of next week.", "2020-04-24T20:46:12.000Z": "", "2020-04-24T20:46:11.000Z": "No matter what phase we are in - red, orange, yellow, or green  - the following principles will always apply: \n1. Exercise extreme caution in caring for high-risk populations - those over 65 and those with underlying conditions. \n2. Stay informed.", "2020-04-24T20:43:09.000Z": "Our Utah Leads Together plan includes four color-coded levels of risk. We are still in red, indicating a high risk. Each color places us all under specific responsibilities. \n\nYou can read more about the color-coded guidelines here: https:// coronavirus-download.utah.gov/Health/Phased% 20Health%20Guidelines%20V3.pdf ", "2020-04-24T20:33:36.000Z": "#Utahcovid19 update from @DrAngelaCDunn Total positive cases: 3,782 (+170)   \n\nLab Tests: 84,697 total tests (+4,070)   \n\nHospitalizations: 315 (Cumulative)  \n\nEstimated recovered: 1,252 (Cumulative)  \n\nDeaths: 39 deaths (+4)", "2020-04-24T17:42:29.000Z": "Thank you Utah teachers! Quote Tweet State of Utah COVID-19 Response @UtahCoronavirus For Utah's teachers, it's not just about education. It's about caring. Creativity and innovation are overcoming isolation every day. It hasn't been easy, but it's working. Let's continue to encourage each other. Stay strong, Utah. @DavisSchools  @teachindavis  @UTBoardofEd", "2020-04-24T16:28:52.000Z": "This @washingtonpost article is misleading. Utah's medical supply teams and hospital systems were integral to the decision to resume elective procedures. Utah is prepared for a surge with the amount of PPE that has been procured by the state. https:// twitter.com/entitled2life/ status/1253686931927392257  This Tweet is unavailable.", "2020-04-23T19:47:38.000Z": "We are currently translating critical public health information into 18 languages, with five more soon to come.", "2020-04-23T19:42:24.000Z": "The subcommittee will also include partners from government and business, leaders of faith-based organizations, and community advocates. \n\nThe co-chairs will be Zee Min Xiao, who is on the Utah Multicultural Commission, and Byron Russell, co-chair of the Multicultural Commission.", "2020-04-23T19:40:25.000Z": "This included important guidance about prevention, stay-at-home guidelines, job and housing protections and employment assistance.", "2020-04-23T19:40:24.000Z": "Today I am announcing the formation of the Utah Multicultural Task Force Subcommittee, which will serve as part of Utah's COVID-19 Community Task Force. #utcovid19", "2020-04-22T20:09:33.000Z": "Want to see a test drive of the Healthy Together app?", "2020-04-22T20:06:00.000Z": "What does Healthy Together do? \n-It helps you track symptoms\n-It connects you with COVID-19 testing\n-It can help public health identify potential cases by providing additional information to enhance contact tracing efforts #utcovid19  #togetherutah", "2020-04-22T19:55:40.000Z": ". @GovHerbert just announced a new app, Healthy Together, utilizing location information to identify and isolate COVID-19. Info: https:// healthytogetherutah.com Is privacy a concern? See our thoughts here: https:// libertasutah.org/limited-and-op en-government/utah-looks-to-private-sector-for-help-against-covid-19/   #utpol", "2020-04-22T20:00:35.000Z": "You can download the Healthy Together beta app today to track symptoms, and connect easily with COVID-19 testing throughout the state. Location data gathered through this app will also help @UtahDepOfHealth identify where COVID-19 is spreading.", "2020-04-22T19:56:11.000Z": "I hope that you and your loved ones will begin to make use of this app, even in its beta form. Be a part of the solution to create better tools for identifying outbreaks so that we can be more targeted in our response moving forward.", "2020-04-22T19:56:00.000Z": "Combining our robust testing and contact tracing with insights from the Healthy Together app is like giving us binoculars to begin to see the virus more clearly from a distance.", "2020-04-22T19:55:50.000Z": "Aggressive testing and tracing is one way of taking the blindfold off. \n\nIt can help us see better where the virus may be active.", "2020-04-22T19:55:49.000Z": "By participating in Healthy Together, you can play an active and critical role in protecting the people close to you, and everyone in our community. \n\nBecause the virus is invisible, it feels like we have been battling it awhile blindfolded.", "2020-04-22T19:55:26.000Z": "We care about the privacy and security of Utahns' data, which is why: \n- Use of the app is strictly opt-in and voluntary\n-Users own their data and can delete their data at any time. \n-Only data that is required to combat COVID-19 will be shared with public health officials.", "2020-04-22T19:53:45.000Z": "The app will help you assess your symptoms and connect to the abundant testing resources we've worked so hard to expand.", "2020-04-22T19:52:24.000Z": "Today I am announcing a new tool for Utahns - the Healthy Together App. This mobile app will help you and your loved ones track symptoms, and connect easily with COVID-19 testing throughout the state. https:// coronavirus.utah.gov/healthy-togeth er-app/ ", "2020-04-22T19:42:26.000Z": "Re: Reactivating the economy, we have tried to find the right balance. Our decisions have been guided by data, and they will continue to be guided by data. #utcovid19", "2020-04-22T19:36:28.000Z": "You can view the full, updated public health order here: https:// coronavirus-download.utah.gov/Health/state%2 0public%20health%20order.20.04.21.pdf ", "2020-04-22T19:34:45.000Z": "We are making significant headway in the battle against COVID-19 thanks to Utahns working together and following directions from @UtahDepOfHealth . I feel cautiously optimistic about the trends we are observing.", "2020-04-22T00:34:13.000Z": "Today, @UtahDepOfHealth issued an updated public health order allowing medical providers to resume some elective procedures. #utcovid19", "2020-04-21T20:42:54.000Z": "This afternoon I issued a proclamation calling @UtahSenate and @utahreps into a special session. #utpol", "2020-04-17T18:51:31.000Z": "We are tracking our testing and contagion rates. Right now, we are still in the red, urgent phase, of Utah's coordinated response. As we continue to #StaySafeStayHome , we can contain Utah's outbreak, and hopefully transition to the orange phase soon. #utcovid19", "2020-04-17T18:48:15.000Z": "Staying focused on health is a crucial part of Utah's plan to get people back to work. These will be our guiding principles. #utcovid19  #TogetherUtah", "2020-04-17T18:44:54.000Z": "We will base the reactivation of Utah's economy on data. We can simultaneously address health issues and support our economy, as we employ strong testing and hygiene measures to make public spaces safer.", "2020-04-17T18:22:25.000Z": "Getting started shortly with today's briefing by @GovHerbert  @SpencerJCox  @JStuartAdams  @BradWilsonGOP  @saltlakechamber and other leaders.\n\nToday, we are announcing Utah Leads Together 2.0", "2020-04-17T18:38:48.000Z": "I'm hopeful that we can resume some in-house dining, and some elective surgeries by the first part of May. I'm also hopeful that we will be able to reopen gyms. All of this depends on continued adherence to the #StaySafeStayHome directive.", "2020-04-17T18:38:47.000Z": "Utah Leads Together 2.0 gives a pathway forward to stabilize. A lot will depend on what we do individually over the next few weeks. As we continue to slow spread over the coming weeks, we will be able to respond appropriately.", "2020-04-17T18:32:50.000Z": "Utah's plan is the most comprehensive plan of any state in America. That plan is underway.", "2020-04-17T18:30:36.000Z": "As we plan to reactivate the economy and enter the stabilization phase, strong social distancing measures, and the wearing of masks, will help us return to normal activities while preserving health.", "2020-04-17T18:24:47.000Z": "The Utah Leads Together Plan has three phases - an urgent phase, a stabilization phase, and a recovery phase. Today, we announce Utah Leads Together 2.0, which contains more details on our plans to reactivate our economy.", "2020-04-15T23:51:56.000Z": "Coronavirus has disrupted our lives, but if you're staying home, you're helping. This hasn't been easy, but it's working. Stay strong, Utah.", "2020-04-15T20:19:00.000Z": "Inspiring to see our state come together to fight COVID-19. Thank you to @joshjames and the team of people at @siliconslopes who came together to bring 8 million pieces of PPE to Utah. #TogetherUtah", "2020-04-14T20:18:16.000Z": "We are encouraged by the COVID-19 data we are seeing so far, and we are making plans for how and when we will lift some restrictions. But Utah is still in an urgent response phase, and we will be for some time. Continue to follow guidance to #StaySafeStayHome . #utcovid19", "2020-04-14T19:44:29.000Z": "In consultation with the Utah State Board of Education, I have determined that we need to extend the soft closure of our public and charter schools through the remainder of the school year. #utcovid19", "2020-04-14T19:40:41.000Z": "In-house dining at restaurants will be prohibited through the end of the month, but take out and delivery options are still available.", "2020-04-14T19:38:50.000Z": "Please wear homemade masks when you are in public places where you may encounter other people -- like grocery stores and other shops. This will help prevent the spread of disease. #utcovid19", "2020-04-14T19:37:01.000Z": "We are tracking COVID-19 data closely in Utah and we are encouraged by the trends we see so far. We will continue making data-driven decisions to #FlattenTheCurve and save lives.", "2020-04-14T16:23:16.000Z": "Hey friends, we need your help. If you have a symptom of COVID-19 but have been turned away from testing in the last 2 days, can you please email me the name/location of the facility that told you not to get tested? We would like to reach out directly. Email: coronavirus@utah.gov", "2020-04-13T22:33:59.000Z": "Just visited with Navajo Nation @NNPrezNez and @NNVPLizer2019 on their efforts to fight COVID-19.  Utah is committed to working with the Tribe to assist our Navajo Tribal Members who live in Utah (w/ @SpencerJCox ).", "2020-04-13T19:34:12.000Z": "We have adjusted requirements to test for COVID-19. As of today, if you have any of the following six symptoms, you should seek testing: \n1) fever\n2) cough\n3) shortness of breath\n4) sore throat\n5) muscle aches\n6) loss of taste or smell", "2020-04-10T21:26:35.000Z": "You don't need to have all of the symptoms of COVID-19 to get tested. If you have any of these symptoms, call your doctor or visit http:// testutah.com . #utcovid19 This Tweet is unavailable.", "2020-04-10T20:14:06.000Z": "At 12:37 p.m. today, we activated a geotargeted electronic alert at Utah's borders. When motorists cross the border, they will receive a text message asking them to fill out a COVID-19 declaration.", "2020-04-10T17:18:34.000Z": "Today my family and I are participating in a worldwide fast in hope that the world may be healed from the COVID-19 pandemic. Whether or not you are religious, let us all join together in a united effort as we look for miracles in the face of this pandemic.", "2020-04-09T23:46:52.000Z": "Thank you @Tim_Cook , for sending some of these much-needed masks to Utah! Quote Tweet Tim Cook @tim_cook Proud to share we've been able to source 10M masks for the US and millions more for the hardest hit regions in Europe. Our ops teams are helping to find and purchase masks from our supply chain in coordination with governments around the world.", "2020-04-09T22:55:41.000Z": "Tomorrow my family and I will participate in a worldwide day of fasting and prayer for relief from the coronavirus pandemic. We invite all to join us. #utcovid19  #OneUtah  #TogetherUtah Quote Tweet Navajo Nation President Jonathan Nez @NNPrezNez Navajo Nation Family Prayer Weekend declared to help fight the spread of COVID-19", "2020-04-09T20:00:45.000Z": "These are anxious times. @Intermountain has established an emotional health relief hotline you can call if you are feeling worried, stressed, or saddened. The hotline is free and available to everyone.", "2020-04-09T19:56:32.000Z": "All of Utah's National Parks are now closed to the public to prevent the spread of COVID-19 in neighboring communities.", "2020-04-09T19:55:49.000Z": "We're grateful to everyone who is following the state #StaySafe  #StayHome Directive. We are seeing promising results from your efforts to stay home and eliminate unnecessary travel. I'm announcing today that this directive will remain in place through the end of the month.", "2020-04-08T20:20:16.000Z": "Wearing masks in public is a good way to help slow the spread of COVID-19, particularly in situations where it can be difficult to maintain appropriate social distancing, like at the grocery store. Quote Tweet State of Utah COVID-19 Response @UtahCoronavirus People with coronavirus may lack symptoms, or transmit the virus before showing symptoms. CDC advises wearing face masks in public. https:// bit.ly/2Ravt42  #COVID19", "2020-04-08T20:07:41.000Z": "Do you have symptoms of COVID-19? Take the assessment at http:// testutah.com to find out if you need to seek testing. The more people get tested, the better we can control our outbreak. Quote Tweet State of Utah COVID-19 Response @UtahCoronavirus As more Utahns are tested for COVID-19, we'll be better informed to #flattenthecurve . https:// coronavirus.utah.gov/testing-locati ons  or http:// testutah.com", "2020-04-08T19:52:22.000Z": "See this thread for more details on Utah's required COVID-19 travel declaration for those entering the state. Quote Tweet State of Utah COVID-19 Response @UtahCoronavirus Now, @CarlosUDOT executive director of @UtahDOT touts our partnerships and explains that \nmotorists will receive a wireless emergency alert upon driving into Utah. \n\n9 locations will be geotargeted with an alert. As motorists stop driving they can go to http:// entry.utah.gov Show this thread", "2020-04-08T19:34:21.000Z": "What does essential travel mean? #utahcovid19", "2020-04-08T19:42:20.000Z": "I am issuing an order this week in advance of Easter weekend requiring all individuals who are 18 years or older to complete a COVID-19 travel declaration form when entering our state. This will be required at the airport, and on our roadways. #utcovid19  #StaySafe  #StayHome", "2020-04-08T19:38:19.000Z": "Individuals eligible for unemployment insurance benefits will now receive an additional $600 from the federal government as part of their weekly benefits payment through the last week in July. You can apply for unemployment through @JobsUT .", "2020-04-08T19:37:24.000Z": "Utah's comprehensive plan for responding to COVID-19 is based on data. We're grateful to all who are contributing to that data, and helping us process it to make wise decisions for the state. We are still in the urgent phase of our response. #utcovid19", "2020-04-08T14:40:35.000Z": "Just finished a productive visit with Dr. Anthony Fauci about the actions and results from Utah's Stay Safe Stay Home directive to slow the spread of the COVID-19 virus. Fauci expressed how favorably impressed he was with Utah's comprehensive response.", "2020-04-07T19:32:18.000Z": "Awaiting the start of @GovHerbert 's media briefing for April 7, 2020.\n\nit will be streamed live on Facebook at http:// facebook.com/govgaryherbert and en español at http:// facebook.com/marcomunoz", "2020-04-06T01:42:40.000Z": "The State has not taken over distribution of hydroxychloroquine, though high demand may be creating shortages. You can see @UtahDepOfHealth 's recommendations for COVID-19 patients here: https:// bit.ly/2V4lLBd Quote Tweet DrBill @DrBill_MD_ I am a licensed physician in Utah. I tried to prescribe hydroxychloroquine but the pharmacist said the state had taken over the distribution of the drug. Even though I'm licensed, I cannot prescribe it. This is WRONG!", "2020-04-06T01:42:13.000Z": "This is not true. The State of Utah has not taken over distribution of hydroxychloroquine, though high demand may be creating shortages. You can see @UtahDepOfHealth 's recommendations for COVID-19 patients here: https:// bit.ly/2V4lLBd This Tweet is unavailable.", "2020-04-03T23:33:05.000Z": "Hey friends, first some good news: Utah is now 5th in the nation in testing per capita! Unfortunately like many states we are starting to run low on swabs and transport medium. We don't want to lose ground, so If you have access to these supplies please email benhart@utah.gov.", "2020-04-03T20:06:34.000Z": "This will be effective immediately. Those who are currently in @ZionNational will have the rest of today to leave, and the park will be closed starting tomorrow morning.", "2020-04-03T20:05:54.000Z": "Do not travel except for essential services.\n\nDo not hang out in groups, inside or outside.\n\nOnly leave home if you have to, and do so as little as possible.", "2020-04-03T20:05:53.000Z": "To slow the spread of the pandemic, we MUST live differently. Many are carefully complying with the #StaySafe , #StayHome directive. Many others, however, might believe that they are obeying the directive, while making convenient exceptions here and there.", "2020-04-02T23:18:35.000Z": "If you have COVID-19 concerns or think you need a test, first, stay home. Use online resources or call 800-456-7707. For moderate to severe symptoms, find a testing facility in your community. Visit http:// coronavirus.utah.gov for more info. #StayHome", "2020-04-02T23:18:34.000Z": "We're grateful to have #TestUtah up and running. Visit http:// testutah.com to take an assessment to see if you should be tested for COVID-19. We hope to have tests for everyone who wants them soon - but right now, we are focusing on testing those who are symptomatic.", "2020-04-02T23:08:29.000Z": "Think you need to be tested for COVID-19? Visit http:// testutah.com for a new way to be tested. Together, we can #testutah , and we will get through this together. Next up, I challenge @PostMalone  @UtahCoachWhitt  @SenMikeLee & @TraegerGrills .", "2020-04-02T22:49:50.000Z": "Over the last few weeks, I have been so impressed with our #Utah media. Utahns are staying informed because of how you are covering COVID-19. You are another example of #OneUtah leading together. @DeseretNews  @sltrib  @kslnewsradio  @fox13  @KUTV2News  @abc4utah  @pbsutah  @KUER", "2020-04-02T18:59:44.000Z": "I am so grateful to the many Utahns and Utah companies, like @OCtanner , who have stepped up to help fight COVID-19. #UtahLeadsTogether From high-end jewelry to high-demand medical gear: O.C. Tanner revamps to help fight COVID-19 Utah's O.C. Tanner has joined the fight against COVID-19, converting space at its Salt Lake City headquarters into a manufacturing area for critically needed personal protective equipment and medical... deseret.com", "2020-04-02T19:56:32.000Z": "Today, we are announcing a public-private partnership between @Utahgov and @siliconslopes to bring more testing capability to Utah. \n\nIt will be the largest health assessment that has been done in the state. Two testing centers are set up in Utah County.", "2020-04-02T19:55:49.000Z": "We have an important update on testing. The State is coming together with @siliconslopes to greatly increase testing. Have symptoms? You can take an assessment at https:// testutah.com .", "2020-04-02T18:38:31.000Z": "Grateful to our friends at @UBusiness for putting together this free seminar. Utah is still in the urgent phase of responding to COVID-19, but together, we can adapt, innovate, and overcome. #TogetherUtah Quote Tweet Eccles School @UBusiness Join us for the free event TOMORROW, April 3, 2020. Get actionable tips and resources that will help you guide your business through the COVID-19 crisis. Register at http:// Eccles.link/MikeLeavitt .", "2020-04-02T00:21:53.000Z": "There's a lot going on - but today is also #CensusDay2020 . Take a minute to fill out the census by visiting http:// my2020census.gov , or call 1-844-330-2020.", "2020-04-01T22:14:28.000Z": "To be clear: This is only a temporary moratorium on residential evictions for tenants directly impacted by COVID-19. People who can pay their rent now should do so immediately. Those who cannot pay now will be required to pay current and back rent when the order expires. Quote Tweet Gov. Gary Herbert @GovHerbert I will issue an Executive Order allowing tenants to defer rental payments, and freezing evictions until May 15. We are working with the federal government to secure additional relief for Utah residents.", "2020-04-01T21:09:48.000Z": "This deferral applies specifically to people who experience financial losses tied to COVID-19. Quote Tweet Gov. Gary Herbert @GovHerbert I will issue an Executive Order allowing tenants to defer rental payments, and freezing evictions until May 15. We are working with the federal government to secure additional relief for Utah residents.", "2020-04-01T20:44:26.000Z": "I will issue an Executive Order allowing tenants to defer rental payments, and freezing evictions until May 15. We are working with the federal government to secure additional relief for Utah residents.", "2020-04-01T19:43:38.000Z": "Today's media briefing by @GovHerbert for Wednesday, April 1, 2020, is starting soon.", "2020-04-01T17:40:09.000Z": "Now is not the time for irresponsible April Fools' Day jokes. I am tremendously grateful to our teachers for their tireless efforts to continue educating Utah students - and I'm impressed by the dedication of our students who are learning from home. Quote Tweet Tami Pyfer @tpyfer I've never enjoyed April Fool's Day jokes (ever), but this one is particularly unfortunate. Know your audience people. To be clear - THIS IS NOT TRUE. #uted  #utpol", "2020-04-01T17:12:34.000Z": "We continue to focus on increasing Utah's testing capacity. You do not need to have a known exposure to COVID-19, or to have traveled recently to get tested. You only need to have symptoms. Learn more about testing locations here: Quote Tweet State of Utah COVID-19 Response @UtahCoronavirus If you have mild to moderate symptoms of COVID-19, like a fever, cough, or trouble breathing, you may need to be tested. To find out more about testing: https:// coronavirus.utah.gov/testing-locati ons/ ", "2020-03-31T18:01:44.000Z": "Even though many state employees are telecommuting and the rest carefully following state safety guidelines, Utah's government is still operating. @GovHerbert has signed 459 bills into law from this year's legislative session. This link: https:// bit.ly/3ay2I8R . #utpol  #utleg", "2020-03-31T17:30:49.000Z": ". @andersonljess says we will be requesting a major disaster declaration from @POTUS . \n\nWorking together in the State EOC gives us the flexibility to use all state resources needed in COVID response.", "2020-03-31T17:23:24.000Z": "I want to thank our leaders, says @GovHerbert , including: @SpencerJCox and @UtahDepOfHealth Director Joseph Miner. \n\nDr. Miner is having some health issues that are keeping him at home. \n\nI've appointed former Maj. Gen. Jefferson Burton to lead @UtahDepOfHealth COVID response", "2020-03-31T17:10:16.000Z": "Getting started shortly with a briefing by @GovHerbert for March 31, 2020\n\nIt will be live on Facebook at http:// Facebook.com/govgaryherbert .", "2020-03-30T20:42:33.000Z": "This #NationalDoctorsDay , our medical providers are on the front lines of the fight against coronavirus. Help keep them safe, and #StayHome .", "2020-03-30T16:50:59.000Z": "Utah is staying home for two weeks to prevent the spread of COVID-19.  Learn more about what the Stay Safe, Stay Home directive means for you and your family: Gov. Gary Herbert: What 'Stay Safe, Stay Home' means and what it doesn't The two-week duration of the Stay Safe, Stay Home directive is critical. deseret.com", "2020-03-29T22:42:26.000Z": "Our prayers are with his wife Kathi and the Garff Family, and all the families that have suffered and are suffering at this time.", "2020-03-29T22:41:47.000Z": "We have lost a really great man. Bob Garff touched countless lives and gave so much service to our state, and its people. He was such a positive example to all of us. He leaves a hole in our heart and in the community.", "2020-03-28T23:36:56.000Z": "Grateful for all who are doing their part to emphasize that this is the time to #StaySafe  #StayHome Be bold. Be a hero. Stay home. The time is now, be bold, be a hero, stay home. You can save lives. youtube.com", "2020-03-27T23:24:14.000Z": "Questions about what's okay under Utah's Stay Safe, Stay Home directive? Read it here: https:// coronavirus.utah.gov/full-text-gove rnors-stay-home-stay-safe-directive/ ", "2020-03-27T22:50:43.000Z": "Our decisions are data-driven, and I expect all Utahns to follow our Stay Safe, Stay Home directive.  By uniting behind these instructions as if our lives depended upon them, we will, in fact, save many lives. #FlattenTheCurve  #togetherutah", "2020-03-27T22:45:47.000Z": "Data from @UtahDepOfHealth suggests that social distancing measures implemented earlier are making a difference. Still, we need to do more, which is why I'm issuing this directive. We are closely monitoring data to assess what future measures may be necessary. #staysafe  #stayhome", "2020-03-27T22:36:27.000Z": "Employers: DO NOT require doctor's notes from your employees. If they call in sick with symptoms, or have a family member sick with symptoms, make accommodations for them to stay home. #togetherutah", "2020-03-27T22:31:06.000Z": "State parks are only available to residents of the county where the park is located.", "2020-03-27T22:26:23.000Z": "You can go outside to exercise and get fresh air - but do not congregate at trailheads or at parks. Maintain cautious social distancing, even when you are outside.", "2020-03-27T22:25:46.000Z": "Stay safe. Stay home. This will slow the spread of coronavirus in our communities and save lives.", "2020-03-27T22:24:22.000Z": "Livestream here: https:// facebook.com/GovGaryHerbert /?ref=bookmarks ", "2020-03-27T22:23:34.000Z": "At-risk individuals (those who are 60 or older, or have a serious underlying condition) should take special care to leave home as little as possible.", "2020-03-27T22:23:33.000Z": "Do not visit friends or family, or hold group gatherings (except for people living in the same household).", "2020-03-27T22:23:32.000Z": "We are all in this together. I expect all Utahns to do this part to slow the spread of coronavirus. This means staying home whenever possible.", "2020-03-27T22:17:19.000Z": "We are in the throes of a very challenging time. All of us are making difficult adjustments, some big, and some small, to our daily lives. Today I'm issuing a \"Stay Safe, Stay Home\" directive to all Utahns.", "2020-03-26T23:02:37.000Z": "Governor Herbert has issued an Executive Order suspending sections of Utah statute regarding candidate signature gathering.\n\nRead the full press release for more details: https:// elections.utah.gov/Media/Default/ 2020%20Election/Notice.pdf   #utpol", "2020-03-26T15:02:31.000Z": "Scammers are taking advantage of fears surrounding the Coronavirus.\n1 way to avoid COVID19 scams:\nHang up on robocalls. \nDon't press any numbers. Scammers are using illegal robocalls to pitch everything from scam COVID19 treatments to work-at-home schemes. https:// consumer.ftc.gov/features/coronavirus-scams-what-ftc-doing ", "2020-03-24T21:25:13.000Z": "Utah has prepared a comprehensive economic plan to accompany our public health response to COVID-19. We're working to protect lives and livelihoods. You can view the plan at https:// bit.ly/UTleadtogether . #OneUtah", "2020-03-24T17:48:56.000Z": "Effective tomorrow, March 25, @UtahDepOfHealth is restricting nonessential medical, dental, and veterinary procedures to conserve protective equipment needed by doctors treating patients with COVID-19. Visit https:// bit.ly/donateppe to learn more about donating PPE.", "2020-03-24T17:16:11.000Z": "If you missed it last night, today is a big day. For 10 days you've heard me talk about the need to TEST, TEST, TEST. Last week we finally got to 500/day. Today we plan to test 2,500+...with many more drive through options available AND reducing requirements for who gets tested.", "2020-03-23T21:33:06.000Z": "Picking up a @Ch_JesusChrist missionary at @slcairport ? Congrats! NOTE: Remain in vehicle One vehicle allowed per missionary Park on 2nd level of short-term garage Airport staff will direct missionaries to parking area and security will monitor adherence to guidelines", "2020-03-23T22:55:35.000Z": "After careful review, we have decided to extend Utah's K-12 dismissal to help slow the spread of COVID-19. Instructors will continue teaching remotely through May 1st.", "2020-03-23T04:24:55.000Z": "As missionaries return home due to the spread of COVID-19 across the globe, they should not be met by big groups of family or friends. Large welcome parties are dangerous and could greatly increase the spread of coronavirus in our state.", "2020-03-22T18:48:03.000Z": "First and foremost, Jeanette and I want to express our deepest sympathies to the family and friends of this individual. The pain this family must be feeling right now puts into perspective the sacrifices we are all making to keep one another safe and healthy. Quote Tweet Utah Dept. of Health @UtahDepOfHealth Press conf to announce 1st COVID-19 death in UT today, Sunday 3/22/2020 at 1:45 p.m. at UDOH. Details at https:// bit.ly/3dhSn2O", "2020-03-21T21:42:25.000Z": "The @UtahDepOfHealth has clarified the state's recommendations on mass gatherings. We recommend you avoid gatherings larger than 10 - individuals over 60 and those who are immunocompromised should avoid contact with others.", "2020-03-21T00:18:53.000Z": "I've declared a State of Emergency to support repair efforts following the magnitude 5.7 earthquake that struck on Wednesday, March 18. You can view it here.", "2020-03-20T23:07:35.000Z": "Utah is taking quick action to adjust tax filing and payment deadlines in response to the COVID-19 outbreak. More details to come. #utpol Quote Tweet Utah State Tax Commission @UtahStateTax The Utah State Tax Commission intends to follow the federal government's tax filing and payment actions in response to the COVID-19 outbreak.  We are waiting to review the official instructions from the IRS to make certain that we align properly with the federal requirements.", "2020-03-20T22:58:25.000Z": "Update on instructions re: mass gatherings - we strongly recommend that people avoid large group gatherings (10+), but the State does not intend to threaten residents with criminal prosecution, which is why we are amending recently issued orders.", "2020-03-20T22:37:31.000Z": "I invite all to participate in a Weekend of Prayer and Service in Utah, March 20-22. We also encourage acts of service to happen in ways that will decrease risk of contagion. Whether or not you are religious, I hope you find peace or guidance this weekend.", "2020-03-20T03:31:35.000Z": "We call upon all people to act rationally and with the good faith and commonsense that has defined our state and her people since its beginning.", "2020-03-20T03:31:34.000Z": "The State of Utah was not consulted on the new orders issued by the Salt Lake and Utah County Departments of Health. The Utah Department of Health has directed these orders be repealed immediately.", "2020-03-19T18:26:06.000Z": "Last night I shared the following message with Utahns. You can watch it here. Governor Gary R. Herbert Sends Message to Utahns Governor Herbert sends a message to Utahns on the coronavirus outbreak and 5.7 magnitude earthquake. youtube.com", "2020-03-19T01:40:17.000Z": "Wishing @RepBenMcAdams a quick and full recovery (and glad to see him exercising proper precautions - isolating at the sign of COVID-19 symptoms and calling his doctor before visiting a clinic). Quote Tweet Deseret News @DeseretNews . @RepBenMcAdams has tested positive for the #coronavirus and is isolating himself at home after returning from Washington, D.C., this past weekend. https:// deseret.com/utah/2020/3/18 /21186182/coronavirus-covid19-ben-mcadams-congress-positive?utm_source=twitter&utm_medium=deseretnews&utm_campaign=twitter ", "2020-03-18T23:46:42.000Z": "Today is the first time Utah's emergency operation center has been at a level 1 since it opened. \nThank you to the many dedicated people who are working tirelessly to ensure the safety of all Utahns.", "2020-03-18T23:26:57.000Z": "TONIGHT at 6 p.m. tune into a virtual town hall with COVID-19 experts including our own state epidemiologist, Dr. Angela Dunn.\n\nYou can watch the broadcast on KUED, KSL, KUTV or FOX13.", "2020-03-18T22:33:46.000Z": "Tune in tonight to hear experts answer your questions about COVID-19, and to hear my message to Utahns at this time. #utahcoronavirus  #utahearthquake Quote Tweet PBS Utah @pbsutah Do you have questions about COVID-19 in Utah?\n\nTomorrow at 6 p.m. we will be hosting and broadcasting a virtual town hall with health officials and state leaders, who will answer your questions about the virus.\n\nTweet us the questions @pbsutah and they may be answered tomorrow.", "2020-03-18T22:17:13.000Z": "Utah's refineries are still functioning after this morning's earthquake and the resulting aftershocks. We have NO concerns about our gasoline supply. Quote Tweet Utah Division of Emergency Management (Utah DEM) @UtahEmergency Rumor control\n\nFACT: All Utah refineries are up and functioning. There's no need to run out and buy gas. #RumorStop", "2020-03-18T22:12:56.000Z": "This morning's earthquake put our Utah Public Health Laboratory out of commission for a while. It has been cleared to resume operations. Quote Tweet Utah Dept. of Health @UtahDepOfHealth The Utah Public Health Laboratory has been inspected and cleared to resume operations. #COVID19 testing will resume at the lab tomorrow morning.", "2020-03-18T21:53:59.000Z": ". @slcairport is up and running again. Quote Tweet SaltLakeCityAirport @slcairport First flight has departed from SLC to DFW at 2:54 p.m. Flights that were diverted will be arriving soon. Check with your airline regarding possible cancellations or delays.", "2020-03-18T19:22:42.000Z": "The aftershock moments ago registered as a magnitude 4.6. As of 1:20 pm there have been 59 aftershocks. #utahearthquake", "2020-03-18T19:21:55.000Z": "Update, that latest aftershock was  a 4.6: https:// earthquake.usgs.gov/earthquakes/ev entpage/uu60364832/executive  Quote Tweet Utah Division of Emergency Management (Utah DEM) @UtahEmergency That latest earthquake was a magnitude 3.9. Thanks @UUSSquake and @USGS , for the information. https:// earthquake.usgs.gov/earthquakes/ev entpage/uu60364827/executive ", "2020-03-18T18:57:35.000Z": "Latest #utahcovid19 case counts are updated here: https:// coronavirus.utah.gov/latest/ See statement for other relevant information.", "2020-03-18T17:39:57.000Z": "Utah isn't sheltering in place right now, but it's helpful if you can stay home today. This will help first responders complete their damage assessments. Quote Tweet Utah Division of Emergency Management (Utah DEM) @UtahEmergency Clarification...\nThe shelter in place information from @SLCoEmerMngt that went out as an alert to your cell phones this morning is just a recommendation. \n\nPlease avoid driving around. There are some gas leaks and first responders are responding. We need to keep roads clear.", "2020-03-18T15:48:20.000Z": "Do not immediate turn off your gas unless you have obvious damage to your gas lines and can either hear gas or smell gas escaping. #utquake", "2020-03-18T17:24:59.000Z": "Reports that we are predicting a larger earthquake today are FALSE. Earthquakes cannot be predicted - but while there have been many aftershocks, @utahgeological reports that there is a 95% chance that this morning's 5.7 earthquake was the largest in the sequence.", "2020-03-18T17:22:23.000Z": "Briefing the press on the situation following this morning's 5.7 magnitude earthquake. @UtahDPS is reporting no major injuries as a result of this quake and is actively assessing property damage.", "2020-03-18T14:52:02.000Z": "The airport is not currently operational. The FAA tower, terminals and concourses have been evacuated. The road to the airport has been opened, so that passengers can be picked-up.", "2020-03-18T15:35:58.000Z": "#Rumorstop There are rumors out there that earthquakes can be predicted.\n\nThey cannot be predicted, however, we expect that the earthquake we felt today was the largest one of the sequence. That is true in 95% of earthquakes. #utquake", "2020-03-18T15:49:35.000Z": "A temporary COVID-19 Information Line is available at 1-844-442-5224. Please use this number if you have questions about COVID-19 until further notice.", "2020-03-18T15:25:42.000Z": "Reminder:\n\nIt is always better to\nDrop \nCover\nand Hold on\nduring an earthquake\n\nA doorway provides no extra protection to you #utquake", "2020-03-18T13:50:45.000Z": "What you can do today to start preparing for earthquakes:\n Follow @BeReadyUtah  start keeping a flashlight and shoes by your bed\n finally start making those earthquake preparedness plans\n plan to strap your water heater to the studs #utquake", "2020-03-18T13:31:45.000Z": "Here's the shaking intensity map for this earthquake. As you can see, the stronger shaking is felt around the magna area and less intense shaking radiates outward. #Utquake", "2020-03-18T14:11:52.000Z": "The @UtahDepOfHealth state lab is assessing damage and currently down. The poison control center has been evacuated and the @UtahCoronavirus hotline is down.", "2020-03-18T13:57:52.000Z": "Please stay away from the downtown area while crews assess damage. Unless you work in public safety, or are an essential employee, remain at home or telework.", "2020-03-18T13:36:15.000Z": "We had a 5.7 earthquake out of Magna this morning - felt across much of the state. Follow proper safety measures in the event of any additional aftershocks or quakes.", "2020-03-18T03:00:51.000Z": "Bookside chat: A coronavirus update #OneUtah Spencer Cox @SpencerJCox Bookside chat: A coronavirus update #OneUtah pscp.tv", "2020-03-18T00:09:25.000Z": "Our goal is to slow the spread of coronavirus. I'm grateful for the steps each of you take to help this effort, and to take care of each other. We will get through this together. #OneUtah", "2020-03-18T00:09:24.000Z": "The order also issues additional instructions to restaurants - to add sanitation precautions and check employees for symptoms of COVID-19 at the beginning of each shift.", "2020-03-18T00:09:23.000Z": "In making these decisions, we still strongly recommend that Utahns buy local, eat local, and support local businesses at this time, in whatever way they can, and within these guidelines. Our local restaurants are great sources of nutritious, secure, and delicious meals.", "2020-03-18T00:09:22.000Z": "This afternoon the State of Utah issued an order to all restaurants, bars, and food service establishments to suspend dine-in operations for two weeks. #utahcovid19", "2020-03-17T21:14:38.000Z": "Good news for Utah business owners impacted by COVID-19 - loans are now available to help you. Visit http:// sba.gov/disaster and https:// coronavirus.utah.gov/business/ to learn more. Disaster assistance The SBA provides low-interest disaster loans to help businesses and homeowners recover from declared disasters. sba.gov", "2020-03-16T20:41:14.000Z": "Please know that for @GovHerbert and me, our ultimate goal is the safety and well-being of our community.  There are a lot of unknowns, but working together is in Utah's DNA and we will get through this. #utpol  #slc  #FlattenTheCurve", "2020-03-16T16:25:48.000Z": "Press conference to address COVID-19 Business Resources coming up at 11 a.m. Derek Miller of the @saltlakechamber and @DowntownSLC , @govherbert and leaders of #slc 's businesses community and I will discuss steps we're taking to address economic impacts. #utpol  #flattenthecurve", "2020-03-16T15:49:59.000Z": "This morning's #COVID19 briefing call with the White House and governors from across the nation. Stay tuned later today for further announcements on steps Utah is taking to slow the spread of novel coronavirus.", "2020-03-15T03:33:10.000Z": "#OneUtah Update Spencer Cox @SpencerJCox #OneUtah Update pscp.tv", "2020-03-15T01:55:12.000Z": "Quick clarification on K-12 school dismissals - school campuses will still be open, but they will not provide childcare. Schools will provide meal options, and districts and charters will provide more information to parents on other services available.", "2020-03-14T20:16:11.000Z": "Happy Birthday to my wonderful wife, Jeanette. She is an example of peace and love and shows kindness to all. Thank you for being an extraordinary wife, mother, grandma and First Lady to the state of Utah.", "2020-03-14T15:28:25.000Z": "While we have anticipated that community transmission has been happening, this is a significant reminder that the steps we've taken this week are more critical than ever. Most importantly, if you have any symptoms (even if it feels like just a cold) PLEASE stay away from others. Quote Tweet Utah Dept. of Health @UtahDepOfHealth MEDIA ALERT: First case of #COVID19 community transmission in #Utah . Details here https:// bit.ly/39QgBiH Media briefing at 10 a.m. #utahcovid19", "2020-03-14T15:24:44.000Z": "We now have a known case of community spread of COVID-19. Following the social distancing procedures we introduced this week will help slow viral spread - so will practicing good hygiene and staying home when you are sick. Use common sense, and take care of each other. Quote Tweet Utah Dept. of Health @UtahDepOfHealth MEDIA ALERT: First case of #COVID19 community transmission in #Utah . Details here https:// bit.ly/39QgBiH Media briefing at 10 a.m. #utahcovid19", "2020-03-13T23:12:56.000Z": "Effective Monday, Utah's public schools will take a two week hiatus from in-person instruction. Teachers will begin remote instruction by Wednesday. Look for more information from your school district or charter to learn how this will affect your students.", "2020-03-13T07:23:54.000Z": "Tonight we closed the 2020 Legislative Session. Thank you to the @utahsenate and the @utahreps for a successful and productive session.", "2020-03-12T19:29:57.000Z": "These recommendations will remain in effect for two weeks. We will continue assessing to determine whether we should continue these measures, expand on them, or pull back after the end of the two-week period.", "2020-03-12T19:29:56.000Z": "Everyone over the age of 60 should avoid large gatherings with more than 20 people. Everyone who is immunocompromised should avoid large gatherings with more than 20 people.", "2020-03-12T19:29:55.000Z": "In conjunction with the Utah COVID-19 Community Task Force, and Local Departments of Health we recommend the following measures to help slow the spread of COVID-19:", "2020-03-12T18:04:02.000Z": "Tune in now at https:// facebook.com/GovGaryHerbert /videos/2324041271230085/  to hear the USHE and k-12 press announcement. Governor Gary Herbert on Facebook Watch USHE and K-12 press conference facebook.com", "2020-03-12T16:17:44.000Z": "Hey friends, we will be hosting a press conference at noon to give the latest updates and recommendations re the coronavirus. You should be able to watch on the Governor's Facebook page. https:// m.facebook.com/GovGaryHerbert/", "2020-03-12T16:07:23.000Z": "The original 10am press conference has now been moved to 12pm. We appreciate your patience.", "2020-03-12T15:33:57.000Z": ". @GovHerbert 's & @UtahGov 's press conference at 10a will be streamed at @UtahCoronavirus .", "2020-03-12T02:34:55.000Z": "We have confirmed that a member of the @utahjazz tested positive for COVID-19 while in Oklahoma City. Statement from gov. and lt. gov here: https:// coronavirus.utah.gov/gov-gary-r-her bert-and-lt-governor-spencer-j-cox-statement-on-positive-case-of-covid-19-on-the-utah-jazz/ ", "2020-03-11T21:03:55.000Z": "Utah's third confirmed case was tested when they called their clinician, who identified they were at-risk for COVID-19. They were then tested curbside using an ARUP test. Testing capacity is increasing and streamlining in Utah -- more details on that soon. Quote Tweet Utah Dept. of Health @UtahDepOfHealth 3rd COVID-19 case announced in UT; media briefing TODAY at 4 p.m. at UDOH room 129. More info: https:// bit.ly/3cSzu6b", "2020-03-11T17:32:21.000Z": ". @SpencerJCox and I have released the following statement on the @Ch_JesusChrist 's announcements this morning. #utahcovid19", "2020-03-10T13:50:28.000Z": "We wish this patient and their family the very best. Our @UtahDepofHealth is already engaging with high-risk contacts that this patient may have exposed to the virus. Quote Tweet Utah Dept. of Health @UtahDepOfHealth #Utah has confirmed its 2nd case of #COVID -19. Details here https:// bit.ly/38HbZtA  #utahcovid19", "2020-03-07T04:21:59.000Z": "\"Home isolation of confirmed cases who aren't sick enough to be hospitalized WILL help limit the spread of disease. We need the public to understand this, as isolating these types of cases at home will become more routine as we identify additional cases.\" \n- Dr. Angela Dunn Quote Tweet Utah Dept. of Health @UtahDepOfHealth BREAKING NEWS - Utah health officials to announce 1st case of COVID-19; press briefing tonight at 9 p.m. https:// health.utah.gov/featured-news/ utah-health-officials-announce-first-case-of-covid-19 ", "2020-03-07T03:27:26.000Z": "Live stream of press briefing to announce 1st case of COVID-19 in Utah on our Facebook page https:// facebook.com/UtahDepOfHealt h/ ", "2020-03-07T03:26:41.000Z": "BREAKING NEWS - Utah health officials to announce 1st case of COVID-19; press briefing tonight at 9 p.m. https:// health.utah.gov/featured-news/ utah-health-officials-announce-first-case-of-covid-19 ", "2020-03-07T02:25:21.000Z": "Earlier this afternoon, I declared a state of emergency to help Utah prepare for diagnoses of COVID-19 in our state. This means we are in a state of readiness. Watch this video to learn more. #utahcovid19", "2020-03-06T23:31:54.000Z": "I just signed an Executive Order declaring a state of emergency to help Utah prepare for potential diagnoses of COVID-19. We are in a state of readiness. #utahcovid19", "2020-03-05T17:10:03.000Z": "Utah doesn't have a confirmed case of COVID-19, but you can watch this video for an update on testing in Utah, and to learn what to do if you think you might have coronavirus. #utahcovid19", "2020-03-04T20:10:12.000Z": "Yesterday I had the opportunity to meet with dozens of leaders from Utah's eight recognized Native American Tribes.  We discussed everything from education to transportation, economic development and preparing for coronavirus.", "2020-03-03T23:28:06.000Z": "If you're worried about whether you may have #COVID19 , please call our Utah Coronavirus Information Line at 1-800-456-7707. #utahcovid19 Thank you @utahpoison for making this happen.", "2020-03-03T15:50:36.000Z": "Presidential Primary Election Day is here! Vote at a polling location (7am - 8pm) Drop your ballot in a curbside/in-office dropbox Drop off your ballot at a polling location Same day registration available at polling locations\n\nLearn more at http:// vote.utah.gov", "2020-03-03T00:08:41.000Z": "", "2020-03-03T00:08:40.000Z": ". @UDOH announced today that our state lab is ready to begin testing for COVID-19, beginning with patients who are at a high risk for infection.", "2020-03-03T00:08:39.000Z": "The risk for infection is still low, but we are working together on all levels to ensure Utah is prepared.", "2020-03-03T00:08:38.000Z": "This afternoon I called together a roundtable meeting of leaders spanning state and local government, education, health, business, and community organizations, to discuss Utah's efforts to prepare for coronavirus.", "2020-03-02T18:45:52.000Z": "I appreciated the chance to talk this morning with @VP Mike Pence, my fellow governors, and officials from @CDCgov and @HHSGov . They updated us on federal actions on novel coronavirus and solicited our help and input. As always, wash your hands and stay home if you're sick.", "2020-02-28T21:42:48.000Z": "Today I signed SB121. This bill makes needed adjustments and clarifications to Utah's medical cannabis law. These changes will help us ensure that Utah patients have the best possible access to cannabis products as our new program rolls out on Monday, March 2. #utpol", "2020-02-27T19:08:37.000Z": "I am taking live calls from constituents on KSL for the next hour. Join us from 12pm-1pm for \"Let Me Speak to the Governor.\" Call in with questions at 801-575-8255, text us at 57500 or write a question here.", "2020-02-27T17:23:57.000Z": "On Super Tuesday vote: \"President Trump has done some really good things. Sometimes we don't like his style....but it is hard to overlook the successes that he has had.\" @GovHerbert  #utpol", "2020-02-27T17:05:06.000Z": ". @GovHerbert begins with a statement on coronavirus.\n\n\"A little bit of uncertainty out here,\" he says.\n\nHe says @UtahDepOfHealth is prepared and watching for it.. \n\n\"We have no confirmed cases of the virus in Utah.\" @fox13  #utpol  #utleg", "2020-02-27T17:01:34.000Z": "The Governor's Monthly News Conference is about to begin. Tune in live on our Facebook page, or at http:// pbsutah.org/governor  #utpol  @GovHerbert Governor's Monthly News Conference The Governor's Monthly News Conference, an unedited exchange between reporters and Governor Gary Herbert. pbsutah.org", "2020-02-26T22:42:06.000Z": "I loved my time with students from @USUAggies 's Government Relations Council. Thank you for visiting the Capitol today and for being involved. Also, thank you for the famous Aggie ice cream.", "2020-02-26T17:35:21.000Z": "I encourage all Utahns who can to consider donating at least $2 to the Pamela Atkinson Homeless Trust Fund on their state tax form this year. Quote Tweet Jon S. Pierpont @JonSPierpont @GovHerbert says we can each be a pebble in a pond to make a difference in our community. Every dollar donated to the Pamela Atkinson Homeless Trust Fund makes a difference. #utpol  #homeless  #donate  http:// jobs.utah.gov/htf", "2020-02-25T17:07:16.000Z": "Today I appointed Robert Lund to the First District Court. This is my 100th judicial appointment. Making appointments to the bench is a great responsibility, and one I do not take lightly. I am grateful to the many people who are willing to serve the citizens of Utah as judges.", "2020-02-21T21:59:15.000Z": "During the session, I appreciate when I have the opportunity to meet with various school groups who visit our State Capitol. Meeting with Skylar was the highlight of my day.", "2020-02-14T22:29:31.000Z": "Today @GovHerbert , Pres. @JStuartAdams , and I met with the officials from the USOPC to discuss next steps in Utah's bid for the winter @Olympics . What an amazing opportunity where we can once again welcome the world. #utpol", "2020-02-14T21:25:19.000Z": "Today I had the opportunity to visit and deliver valentines to the Salt Lake City Veterans Hospital. We support you and thank you for your dedicated service to our country. Happy Valentine's Day!", "2020-02-14T16:40:19.000Z": "Today we celebrate 150 years since Seraph Young became the first woman in the nation to vote - and we celebrate all the women who have been, and continue to be trailblazers in our state. @BetterDays2020 Quote Tweet UTAH STATE CAPITOL @UTStateCapitol This painting, featured on the north wall of the House of Representatives, celebrates Utah's victory in women's suffrage by having the first female to vote legally in the United States. Seraph Young, depicted in the yellow dress, cast this historic vote on February 14, 1870.", "2020-02-13T22:33:00.000Z": "Today we had the privilege of honoring the families of our Utah fallen service members. Words can't describe the appreciation and respect we have for their sacrifices.", "2020-02-13T00:02:36.000Z": "As part of today's event, I ceremonially signed HJR12, Joint Resolution Celebrating Women's Suffrage in Utah. You can read the full resolution text here: https:// le.utah.gov/~2020/bills/st atic/HJR012.html ", "2020-02-13T00:02:35.000Z": "Today I was pleased to join state legislators, @BetterDays2020 , @UTHeritageArts and others in celebrating the 150th anniversary of the Utah Territorial Legislature granting women the right to vote.", "2020-02-12T23:12:13.000Z": "Thank you @Chevron for investing in your Salt Lake refinery to produce and sell Tier 3 fuels in Utah. For a full list of where you can find Tier 3 fuels, visit http:// tier3gas.org .", "2020-02-12T18:03:32.000Z": "This morning I joined state and city leaders in announcing the formation of a committee to represent Salt Lake City in bidding for a future Winter Olympics. #utpol", "2020-02-12T17:08:57.000Z": "150 years ago today, women in Utah Territory received the right to vote. Today we celebrate the many trailblazing women in Utah who fought for suffrage - and got it. #utpol", "2020-02-12T16:57:22.000Z": "Today we celebrate the birthday of our Nation's 16th President, Abraham Lincoln. His wisdom was paramount and the strength of his leadership had an unforgettable impact on our country and its people.", "2020-02-11T21:31:12.000Z": "While in D.C., I had the chance to talk with @ChrisEvans about workforce development and college affordability as part of his exciting new project #astartingpoint .", "2020-02-07T13:50:19.000Z": "I'm at the @CatoInstitute in D.C. this morning speaking with @RepJohnCurtis about the concept of state-based immigration visas. #utpol", "2020-02-06T22:18:46.000Z": "Fred was a genius. He truly was the visionary behind the Utah Shakespeare Festival, which is beloved by both our state and our nation. Fred was one of a kind, and he will be sorely missed.  We join with all Utahns in expressing condolences to his family.", "2020-02-05T05:08:12.000Z": "I very much appreciate that my friend @SenatorRomney invited me to join him this evening for the State of the Union Address. Quote Tweet Senator Mitt Romney @SenatorRomney I'll be joined by my friend and Utah Governor @GovHerbert for tonight's #SOTU . I have admired and appreciated his leadership in our state and his dedication to serving Utahns. Honored to have him as my guest this evening.", "2020-02-04T23:27:33.000Z": "I've been urging @GOP and @DNC to move to a rotating regional primary for the last 15 years. Our current primary system is not working - and a rotating primary would correct the inequities that plague the current system.", "2020-02-03T23:41:36.000Z": "This week I declared School Counseling Week in Utah. School counselors help students reach their full potential. We recognize the importance for school counseling programs and are grateful for the many great school counselors in our state. #utpol", "2020-02-03T13:51:11.000Z": "Just a rough morning everywhere. Be safe and if you can avoid the roads please do.", "2020-02-03T05:47:08.000Z": "Congratulations to Andy Reid! This was a great win for a great coach and a great guy. Quote Tweet Deseret News @DeseretNews Former @BYUfootball lineman Andy Reid finally has won a #SuperBowl . https:// deseret.com/2020/2/2/21119 346/super-bowl-liv-live-darwin-thompson-jackson-barton-kansas-city-chiefs-san-francisco-49ers?fbclid=IwAR0bDtcGOyLyAkQEAgyLFmzFYVEIuYtzK3ozbwRCM5RoeN-oexdql-wv4QA ", "2020-02-03T04:32:14.000Z": "Due to an expected heavy winter storm tomorrow, we are delaying the opening of state offices by four hours. State employees should arrive by 12:00 pm. Please drive safely!", "2020-02-02T16:42:01.000Z": "#Utah  @GovHerbert joins us on #InsideUtahPolitics to break down his final State of the State Address. #utpol  #utleg  @abc4utah Governor Herbert on his final State of the State Address Salt Lake City, Utah- (ABC4 News) - Governor Gary Herbert delivered his 11th and final State of the State Address on Wednesday night. \"To say that the State of our State is excellent would be a gro abc4.com", "2020-02-01T21:20:57.000Z": "Today marks the first day of Black History Month. As I look back at this nation's history, I have great admiration for those who fought through extreme adversity to obtain their God-given rights.", "2020-01-31T23:35:17.000Z": "Refugees embody the same pioneering spirit that has defined us since 1847. I was grateful to have a group of representatives from our refugee community attend my State of the State Address as special guests this year.", "2020-01-31T17:10:43.000Z": "This announcement is welcome news, and signals @CMSGov 's ongoing commitment to state flexibility. I have often asserted that states are best positioned to develop customized solutions to their unique challenges. Quote Tweet Administrator Seema Verma @SeemaCMS Today, we at CMS are excited to announce the new Healthy Adult Opportunity - an optional #Medicaid demonstration that gives states a full array of tools to design accountable health coverage programs tailored to the unique needs of adult beneficiaries. https:// cms.gov/newsroom/press -releases/trump-administration-announces-transformative-medicaid-healthy-adult-opportunity ", "2020-01-30T01:59:14.000Z": "There are many others - including our children - following after us in search of a great life and new opportunities. Let's prepare the way for them. God bless the state of Utah!", "2020-01-30T01:55:26.000Z": "If we want to plan for future growth, we must invest directly in the people who will lead Utah in the future - our children. This year I recommend investing $4.9 million in Utah's K-12 schools.", "2020-01-30T01:52:26.000Z": "It's time to consider making our land use zoning laws, and building codes more responsive to our growing population and market needs when it comes to housing affordability.", "2020-01-30T01:50:22.000Z": "We need to boldly reimagine our roads to safely accommodate cars, mass transit, bikes and pedestrians. We should make commuting by transit as easy as commuting by car.", "2020-01-30T01:48:17.000Z": "As our population grows, so does the potential for increased pollution and crowding. We must ensure our children have safe places to play, clean air to breathe and good water to drink.", "2020-01-30T01:45:43.000Z": "We're on track to create more than 25,000 new jobs in rural Utah by the end of this year -- but we won't rest until all of our 249 cities and towns are thriving economically.", "2020-01-30T01:44:36.000Z": "We have the healthiest and most diverse economy in the nation - by continuing to rely on sound economic principles, we can ensure that this success will continue for decades to come.", "2020-01-30T01:41:37.000Z": "Growth is coming to the state of Utah - we must plan for that growth, we must and proactively prepare the way for those who are coming.", "2020-01-30T01:35:54.000Z": "Utah is thriving - and we are in the best position economically that we have ever been in our state's history. It's time to plan to ensure a good quality of life for all Utahns in the future.", "2020-01-29T23:35:03.000Z": "Tonight I deliver my 11th and my final State of the State address -- which will focus on planning for Utah's growth. Tune in at 6:30 p.m.", "2020-01-29T00:13:14.000Z": "Tonight I signed House Bill 185, which repeals the tax bill passed in special session. I commend the many legislators and people of Utah who participated so fully in this process.", "2020-01-27T21:07:36.000Z": "Today we commemorate the 75th anniversary of the liberation of Auschwitz. We promise to never forget those lost in the horrific and evil acts of the Holocaust -- and we will stand together to ensure that nothing like it will ever happen again. #neverforget", "2020-01-27T19:19:19.000Z": "I look forward to working with our local legislators during the 2020 Legislative General Session. Welcome to everyone. #utpol", "2020-01-27T02:17:59.000Z": "What a tragic story we have encountered today. We are heartbroken and devastated to hear of Kobe Bryant and his daughter Gianna's passing. Jeanette and I send our sincerest condolences to his family at this time.", "2020-01-24T19:31:30.000Z": "Jeanette and I were saddened to hear of Clayton Christensen's passing. His family is in our prayers today.", "2020-01-24T15:37:06.000Z": "Get all the details about the December '19 employment report here: https:// jobs.utah.gov/blog/post/2020 /01/24/utah-s-employment-summary-december-2019  | #utpol  #UTecon  #utbiz", "2020-01-24T17:01:04.000Z": "Utah has consistently been recognized by thought leaders and publications as the best state for business in the nation.  Today we are number one for total job growth and unemployment rate. Thank you, Utahns for making this state the place to work, live and raise a family. #utpol", "2020-01-23T19:15:06.000Z": "I am taking live calls from constituents on KSL for the next hour. Join us from 12pm-1pm for Let Me Speak to the Governor. Call in with questions at 801-575-8255, text us at 57500 or write a question here.", "2020-01-23T17:14:18.000Z": "The Governor's Monthly News Conference is taking place now. Watch live on http:// facebook.com/pbsutah or http:// pbsutah.org/governors . Governor's Monthly News Conference The Governor's Monthly News Conference, an unedited exchange between reporters and Governor Gary Herbert. pbsutah.org", "2020-01-20T15:45:59.000Z": "Remembering the example and the wise words of Dr. Martin Luther King Jr. today. May we always strive to serve together to improve our communities and our world.", "2020-01-18T05:26:03.000Z": "Parents and grandparents, secure your firearms! Everyone, hug your loved ones tight. And remember love, not hate, will heal broken individuals and families.", "2020-01-18T05:26:02.000Z": "Our hearts are broken by the horrible news coming out Grantsville tonight. We mourn over the loss of innocent lives.", "2020-01-16T23:56:01.000Z": "Due to an expected heavy winter storm tomorrow, we are delaying the opening of state offices by two hours. State employees should arrive by 10:00 am. Drive safely!", "2020-01-15T17:09:55.000Z": "I commend the JJS staff working tirelessly each day to help youth successfully navigate their programming and ultimately become productive members of society. \nThis work not only changes lives, it also improves the safety of our communities, and strengthens families. Quote Tweet Utah GOMB @UtahGOMB Juvenile Justice Services Youth speaking to @GovHerbert about their experience at Decker Lake: \"This place has changed me. Everyone that is involved in this whole thing, I don't think they know how they change lives.\"", "2020-01-13T18:56:38.000Z": "This morning I had the opportunity to tour the @neuroworx facility and learn about the remarkable progress they are making in treating patients who experience paralysis from spinal cord injuries, brain injuries, strokes and other neurological conditions. Thank you for all you do.", "2020-01-09T20:36:03.000Z": "I'm grateful for @realDonaldTrump 's efforts to streamline NEPA. Environmental Protection is crucial, and a simpler, faster, and more certain process is a win for everyone. Taxpayers and the environment will both benefit from these changes.", "2020-01-09T14:06:00.000Z": "To our brave men & women in law enforcement- thank you. Thank you for doing your job not because you \"have\" to, but because you \"want\" to - it's your calling. On Law Enforcement Appreciation Day, take a moment to thank an officer. #keepingutahsafe", "2020-01-08T18:44:10.000Z": "You can view the full recommendations here: https:// gomb.utah.gov/current-budget/", "2020-01-08T18:40:52.000Z": "In 1847, Brigham Young, who would be the first governor of Utah, arrived in this valley. He said \"This is the right place. Drive on.\" Utah is still the right place: the best place in the nation to live, work, and raise a family. Together, let's invest in our future and drive on.", "2020-01-08T18:23:12.000Z": "As exciting as many of these investments are, much of the real work of setting the state budget is not in spending the money, but in saving it. We have increased efficiency in state government by 27% and are looking to increase efficiency by another 25% in the coming years.", "2020-01-08T18:17:38.000Z": "We must provide better mental health resources to Utahns in crisis. This budget devotes $30.5 million of new ongoing funding toward bolstering mental health services.", "2020-01-08T18:08:22.000Z": "Improving our air quality is critical to our health and our quality of life. That's why I am recommending the legislature invest $100 million in air quality this year.", "2020-01-08T17:59:29.000Z": "My #1 budget priority is education. This year I recommend the legislature fund a 4.5% increase in the weighted pupil unit and put $292 million of new, ongoing funding into K-12 education, for a total of $4.9 billion. The budget also invests $1.5 billion in higher education.", "2020-01-08T17:34:05.000Z": "This morning I am announcing my budget recommendations for FY2021. I recommend that the legislature make strategic investments to plan for growth and ensure quality of life for all Utahns. #utpol", "2020-01-07T21:31:59.000Z": "Congratulations to Brad Mortensen on his inauguration today. I have no doubt that he will excel as the 13th president of Weber State University.", "2020-01-07T15:29:46.000Z": "Speaking to the @UtahTaxpayers Association this morning as we prepare for the upcoming general legislative session at the end of this month. #utpol", "2020-01-06T21:05:39.000Z": "Congratulations to @slcmayor Erin Mendenhall on your inauguration. I look forward to working with you! #utpol", "2020-01-04T14:53:47.000Z": "Happy birthday Utah! A few things have changed since 1896-but we are better because of the sacrifices and foresight of those who went before us. May we have the wisdom, humility and selflessness to pave the way for the next 124 years.", "2020-01-03T22:41:08.000Z": "If you are looking for ways to do your part in helping Utah's air quality this new year, apply for this grant program to convert your operation wood-burning fireplaces to cleaner-burning natural gas or electric. More information can be found here: https:// deq.utah.gov/air-quality/wo od-stove-conversion-assistance-program#   #utpol Wood Stove and Fireplace Conversion Assistance Program - Utah Department of Environmental Quality The Utah Division of Air Quality (DAQ), through a grant from the U.S. Environmental Protection Agency, has developed a wood smoke reduction incentive program for homeowners to reduce wintertime... deq.utah.gov", "2020-01-01T15:18:14.000Z": "As we celebrate the year coming to an end we look forward to the future. An acclaimed scholar and writer C.S. Lewis wrote, \"You are never too old to set another goal or to dream a new dream.\" There is always more work to do. Here's to 2020. Happy New Year!", "2019-12-30T04:41:00.000Z": "As we all know, there is no place for hate in the Beehive State.  Honored to represent @GovHerbert & @SpencerJCox as @UtahRabbi lit the menorah on the final night of Chanukah.", "2019-12-23T21:24:19.000Z": "Thank you to @crossroadsurban center for their yearly tradition of feeding families all over Salt Lake. I was grateful to have helped this morning. I hope we may all feel the spirit of giving at this special time. Happy Holidays!", "2019-12-20T22:37:21.000Z": "Congratulations to Ryan and Genevieve Benally on their marriage today. I wish you a lifetime of happiness together.", "2019-12-20T15:38:26.000Z": "Labor rankings and statistics are in for the month of November, and Utah's economy is thriving. We're 1st in the nation with a job growth rate of 3.7% in the private sector, 3.3% overall - and we have the 2nd lowest unemployment rate in the nation, at 2.4%. #utpol", "2019-12-20T04:36:46.000Z": "I signed SB 2001, the tax bill passed during special session, into law this morning. This bill will stabilize our tax base, and reduce the overall tax burden for Utahns.", "2019-12-19T18:59:02.000Z": "I'm taking live calls from constituents on KSL for the next hour. Join us from 12pm-1pm for Let Me Speak to the Governor. Call in with questions at 801-575-8255, text us at 57500 or write a question here.", "2019-12-19T16:24:17.000Z": "Today: The Governor's Monthly News Conference is taking place at 10 a.m. Watch live on http:// facebook.com/pbsutah or http:// pbsutah.org/governors . #utpol  @GovHerbert", "2019-12-16T16:43:45.000Z": "If you have questions about why Utah needed tax reform, or why the bill passed last week was necessary, please take a few minutes to read this: Gov. Gary Herbert: Why Utah needed tax reform Utah governance is defined not only by our thriving and diverse economy, but also by our willingness to look down the road and tackle tough issues before they become a crisis. Reforming tax... deseret.com", "2019-12-13T22:46:12.000Z": "Remembering the legacy of Utah King of Swing, Joe McQueen. We will miss him.", "2019-12-13T05:06:00.000Z": "The Special Session of the Legislature has concluded. I commend them for their forward thinking in passing the tax bill this evening. #utpol", "2019-12-11T23:29:10.000Z": "The Lt. Governor and I enjoyed meeting with various tech companies yesterday. They are a tremendous part of our success. Thank you for all you do. Quote Tweet Ryan Smith @RyanQualtrics Great having @GovHerbert and @SpencerJCox come visit Qualtrics yesterday. They're always in the details and willing to jump in and help. That's why the state is growing so much and doing so well.", "2019-12-11T19:01:35.000Z": "Utah's refugees are doing great things. Stopped by Halab's Jasmine Kitchen on Main Street for a delicious lunch today.", "2019-12-11T01:35:54.000Z": "", "2019-12-11T01:34:55.000Z": "", "2019-12-11T01:33:42.000Z": "Tonight I have called a special session of the Utah State Legislature for this Thursday, Dec. 12, 2019 at 5:00 p.m. discussing tax reform.", "2019-12-09T17:32:27.000Z": "Today I announced my intent to put $10.2 million toward computer science education in my upcoming budget recommendations. This funding will ensure every K-12 student in the state of Utah has access to computer science education.", "2019-12-07T17:10:22.000Z": "Utah excels year after year thanks to policies that keep government out of the way, so individuals can succeed. Good read from the Wall Street Journal this morning. #utpol Opinion | Why Utah Has Become America's Economic Star From taxes to education to the business climate, the Beehive State has its house in order. wsj.com", "2019-12-07T15:49:36.000Z": "On this day, we look back with humility and gratitude, and remember the countless sacrifices of the Greatest Generation, who rose at every occasion and gave of themselves at every turn, so that our nation might emerge victorious from the Second World War. May we never forget.", "2019-12-07T15:49:35.000Z": "Flags are flying at half-staff today in remembrance of the attack on Pearl Harbor 78 years ago. \n\nOn that dark day, our nation lost over 2,400 service members, and nearly 1,200 were wounded.", "2019-12-03T21:18:45.000Z": "Today I was delighted to have the fourth graders from Deerfield Elementary come and decorate our Christmas tree at the mansion. Thanks for helping us feel the Christmas spirit.", "2019-12-03T20:01:55.000Z": "Hyrum and Gail Smith have done so much for Utah.  Here we were when Dixie State joined the WAC.  Hyrum's skills and talents blessed many lives.", "2019-12-03T18:55:34.000Z": "Thinking of the Hyrum and Gail Smith family today. Hyrum was a good friend, a strong leader, and a generous person. He cared deeply about his fellowmen and gave graciously to his community. He will be deeply missed.", "2019-12-01T16:15:55.000Z": "Congratulations to @Utah_Football on a spectacular win last night. Good luck in the Pac-12 Championship Game! Quote Tweet Utah Football @Utah_Football S O U T H  C H A M P S", "2019-11-28T16:08:50.000Z": "Happy Thanksgiving everyone. We have so many rich blessings here in Utah, but even the act of being grateful is a blessing in and of itself. May our hearts be filled with gratitude today and always. Have a safe and enjoyable holiday.", "2019-11-27T20:28:29.000Z": "Serving at the Rescue Mission has become a treasured tradition for my family. I'm grateful to Pamela Atkinson for her example of service, and for giving us this opportunity each year. Happy Thanksgiving! Quote Tweet Ben Winslow @BenWinslow . @GovHerbert serving those in need this morning at the Rescue Mission alongside @SpencerJCox , their families and staffers in the Governor's office. @fox13  #utpol Show this thread", "2019-11-27T15:15:49.000Z": "Much of Utah is under a winter storm warning, with heavy snow expected. If you are driving today, please buckle up, slow down, and increase your following distance. Plan for extreme driving conditions.", "2019-11-27T02:38:59.000Z": "(A previous version of this tweet contained our press contact information, which we usually remove for twitter. Otherwise, the releases pictured are identical.)", "2019-11-27T02:29:38.000Z": "Breaking news out of my office tonight as we have reached an agreement with multiple stakeholders on a rule that will ban conversion therapy on minors in the state of Utah. #utpol", "2019-11-26T19:58:53.000Z": "Agriculture production is at the heart of Utah's values, culture, and heritage. It represents a substantial part of Utah's economy. Wonderful to spend some time at Lincoln Elementary School today talking about agriculture and harvest. Happy Harvest Gratitude Day in Utah. #utpol", "2019-11-26T03:30:01.000Z": "Wet roads and freezing conditions have set up black ice conditions across the Wasatch Front. If you are on the freeways, we really need you to slow down, and expect extremely slick conditions. Please help our troopers get crashes safely off the road. Quote Tweet Utah Highway Patrol @UTHighwayPatrol We've had two Troopers hit while investigating separate crashes, one Trooper was hit twice in the same spot. They both appear to be okay. Statewide we've jumped to 215 crashes today. And we are backlogged another 30-40. If you can avoid driving for the moment, please do.", "2019-11-25T23:14:18.000Z": "You can visit any one of the 26 Speedway stations to fill up on Tier 3 gas starting on Jan 1, 2020. #utpol", "2019-11-25T23:13:35.000Z": "Did you know that by switching to Tier 3 gasoline, you can decrease your car's emissions by up to 80 percent? Today I was pleased to join @MarathonPetroCo and the new @Speedway gas station as we celebrated Marathon's Utah Refinery converting to Tier 3 fuel production. #utpol", "2019-11-24T00:23:24.000Z": "So moving to see so many lining Utah Highway 61 to honor a soldier who died 76 years ago. #TechSgtMaxLower .", "2019-11-23T21:43:27.000Z": "Welcome home, Tech Sgt. Max Lower. Quote Tweet Michael Mower @MikeLMower The entire town of Lewiston, Utah showed their respect for Tech Sgt. Max Lower who was laid to rest today after being killed in Operation Tital Wave on August 1, 1943.  John 15:13.", "2019-11-19T23:56:02.000Z": "Utah takes great pride in being one of the top states every year in employment. I am proud to say that Utah has the 2nd lowest unemployment rate in the nation, and is ranked #1 in both total and private job growth. http:// jobs.utah.gov/blog/post/2019 /11/15/utah-s-employment-summary-october-2019 ", "2019-11-18T23:00:01.000Z": "Utah ranks #1 as the best state for the middle class. I am grateful for those who help make Utah such a desirable place to live. Best States for the Middle Class - 2019 Edition - SmartAsset smartasset.com", "2019-11-15T17:32:15.000Z": "I am proud to see the hard work of Utahns drive our economy. #utpol Quote Tweet Jon S. Pierpont @JonSPierpont It just keeps getting better: 3.3% job growth and 2.5% unemployment! This combo is a \"sweet spot\" for Utah's economy going into the winter and holiday season. #utpol  #UTecon  #utbiz", "2019-11-14T20:20:25.000Z": "Congratulations to @GovHerbert for this well-deserved recognition. Quote Tweet Moneyball 4 Gov @Moneyball4Gov Today we're thrilled to announce our newest #Moneyball4Gov All-Stars! @GovofCO  @GovLarryHogan  @GovTimWalz  @NC_Governor & @GovHerbert join our #bipartisan roster of leaders committed outcomes for their residents by investing in #whatworks ! #StatesLeading  http:// moneyballforgov.com", "2019-11-13T21:59:57.000Z": "Grateful to our congressional delegation for their continued support of the USMCA. Guest opinion: How the new trade pact with Mexico and Canada benefits Utah The evidence in favor of free trade is clear and overwhelming. Trade that is free and reciprocal lowers prices for consumers, improves the quality of goods, spurs innovation and creates wealth for... deseret.com", "2019-11-11T16:41:34.000Z": "On this Veterans Day, let us more fully appreciate the freedoms we enjoy as Americans and express our gratitude for those who have served, fought, and died to protect them. We salute and remember all of our nation's veterans. Thank you for dedication and sacrifice.", "2019-11-07T23:05:28.000Z": "Today I was honored to have participated in Major General Jeff Burton's retirement and relinquish command of the Utah National Guard to Brigadier General Michael Turley. We recognize these outstanding soldiers and leaders for their service. @UTNationalGuard", "2019-11-06T17:18:38.000Z": "It was an honor to recognize seventeen of our thirty-one Utah Centenarian Veterans yesterday. On behalf of all Utahns across the state, I thank you. We are forever indebted for your service and sacrifice. God bless you all.", "2019-11-05T18:26:27.000Z": "Devastated to hear of the cold-blooded attacks in Mexico. I am heartsick for the victims and their families. Together, we must find a way to end the callous and cruel violence cartels inflict on innocent victims.", "2019-11-05T16:25:57.000Z": "Happy Election Day, Utah! \n\nTrack your ballot, learn about the candidates/issues, find a Voting Center or ballot drop box, and more at http:// vote.utah.gov .\n\n***You can still register to vote and cast a ballot at a Voting Center today***", "2019-11-04T03:07:28.000Z": "Congratulations to Calvary Baptist Church on 127 years in the Salt Lake Valley. It was good to be with Pastor France Davis and his congregation today.", "2019-11-01T16:18:23.000Z": "Utah was settled by refugees fleeing religious persecution. We will continue to open our arms to individuals and families fleeing persecution and war - and hoping for a better life. #utpol Gov. Gary Herbert wants more refugees to resettle in Utah Utah Gov. Gary Herbert wrote a letter to President Donald Trump asking that more refugees be sent to Utah to resettle, saying there is plenty of room and resources for those in need. sltrib.com", "2019-10-31T21:12:00.000Z": "Happy Halloween! I was happy to have trick-or-treaters come by the Capitol this morning. I hope everyone has a safe and enjoyable day.", "2019-10-31T16:54:30.000Z": "Every year I look forward to the Faith Leaders Luncheon. It was an honor visiting with religious leaders from numerous different faiths earlier this week.", "2019-10-31T15:05:00.000Z": "No one who seeks shelter in Salt Lake will be turned away into the cold. Read this thread to learn more about the plan to help those experiencing homelessness find long-term housing. #utpol Quote Tweet Spencer Cox @SpencerJCox First, and most importantly, my colleagues and I stated multiple times that NO ONE will be turned away and left in the cold. Period. There will be a place for everyone. We will also continue to walk the streets every night and help people into shelter. 2/ Show this thread", "2019-10-29T20:29:16.000Z": "Grateful to all our Utah firefighters headed to California to help fight wildfires. We wish them well and pray for their safe return. Quote Tweet Utah Division of Emergency Management (Utah DEM) @UtahEmergency Thanks to everyone who helped with coordination behind the scenes for this #CaliforniaWildfires deployment: @SLCoEmerMngt , @jmhscs , and @Layton_Fire . #EMAC EMAC is the Emergency Management Assistance Compact, a system of state-to-State mutual aid coordinated by @NEMA_web Show this thread", "2019-10-28T20:16:46.000Z": "We can all make small changes in our daily routines that have a big impact on air quality. Take a look at these recommendations from @UtahDEQ to learn what you can do to improve our air quality this winter. Quote Tweet Utah DEQ @UtahDEQ This morning's temps was a reminder that winter, and inversion season, is right around the corner. Here are a few tips to get ready and help you reduce your emissions this year.", "2019-10-25T18:35:05.000Z": "Thanks to @lisamurkowski and @RepGosar for visiting Utah and learning first hand from @SenMikeLee , @RepRobBishop , @RepChrisStewart and rural Utahns about the challenges and blessings that come from being a public lands state.", "2019-10-25T01:49:43.000Z": "Congratulations to the 2019 Titan Award Winners: @NickRimando ; @Gochnour & @GovHerbert !  All three have done so much for Utah! . #SouthValleyChamber .", "2019-10-24T20:38:09.000Z": "Saturday is the great time to get rid of your unused medications. Details about the Utah #TakeBackDay can be found at http:// utahtakeback.org .", "2019-10-24T18:06:49.000Z": "I'm taking live calls from constituents on KSL for the next hour. Join us from 12pm-1pm for Let Me Speak to the Governor. Call in with questions at 801-575-8255, text us at 57500 or write a question here.", "2019-10-24T16:12:09.000Z": ". @GovHerbert begins his monthly news conference by encouraging everyone to vote in the upcoming municipal elections. He says local government \"really is where the rubber meets the road\" and says it's sad these very important races get low turnout. @fox13  #utpol", "2019-10-24T15:48:32.000Z": "@GovHerbert 's monthly news conference is taking place this morning at 10. Tune in for the livestream on our Facebook page or at https:// kued.org/whatson/govern ors-monthly-news-conference  . #utpol Governor's Monthly News Conference The Governor's Monthly News Conference, an unedited exchange between reporters and Governor Gary Herbert. pbsutah.org", "2019-10-23T21:36:34.000Z": "We look forward to hosting the All-Star Game in 2023. Quote Tweet utahjazz @utahjazz All-Star is coming back to SLC in 2023 Show this thread", "2019-10-22T20:43:26.000Z": "Spending quality time learning about innovative educational ideas from @JebBush and @GovHerbert thanks to the @SutherlandInst .", "2019-10-18T15:58:51.000Z": "Find all the details about September's jobs report here: https:// jobs.utah.gov/blog/post/2019 /10/18/utah-s-employment-summary-september-2019  | #utpol  #UTecon  #utbiz", "2019-10-12T17:53:38.000Z": "Mac Christensen was a true gentleman and a successful entrepreneur.  He loved and cared about everyone and everyone loved him in return. He was a living legend here in Utah and beyond.  He was known for his kindness, service and charitable giving. Mac will be sorely missed.", "2019-10-11T16:38:37.000Z": "I am delighted the Commission on Presidential Debates has selected the @UUtah as the host of the 2020 vice presidential debate. What an opportunity for us to showcase our state and for our students to experience this vital part of the political process. @Debates  #UtahDebate2020", "2019-10-11T19:05:47.000Z": "Today I was pleased to help announce that the University of Utah has been selected to host the Vice Presidential Debate in 2020. Thanks to all who helped make this possible. #utpol  #UtahDebate2020  @UUtah", "2019-10-10T19:55:00.000Z": "Congratulations to David Damschen for receiving the Jesse M. Unruh Award. David has been a fantastic treasurer for our state and we are grateful for his hard work. https:// treasurer.utah.gov/2019/10/09/tre asurer-damschen-recognized-for-outstanding-service-to-national-association-of-state-treasurers/ ", "2019-10-09T20:38:42.000Z": "I was happy to have the opportunity to say a few words at the annual Hunstman World Senior Games opening ceremony last night. An amazing event that brings people from all over the world to compete in a variety of games. Best of luck to all those who are competing this year.", "2019-10-09T14:44:32.000Z": "I thank @Delta for this opportunity given to young women for Girls in Aviation Day. I am appreciative of the work that is being done to raise equality. Quote Tweet Delta News Hub @DeltaNewsHub Today @Delta celebrated International Girls in Aviation Day with our annual WING Flight - \"Women Inspiring our Next Generation\" - carrying 120 girls from Salt Lake City to NASA in Houston.", "2019-10-07T22:49:37.000Z": "I am happy to have attended the Multicultural Youth Leadership Summit today. Pursuing leadership and education are important things for our youth to desire. The more we can become educated, the brighter our future can be. @SaltLakeCC", "2019-10-03T17:13:19.000Z": "Today as we celebrate the 100th anniversary of Utah ratifying the 19th amendment, I am grateful for the leadership and involvement of women in Utah - now, and throughout our state's history. #utpol Quote Tweet BetterDays2020 @BetterDays2020 Utah ratified the 19th Amendment 100 years ago today, on October 3, 1919. Unlike women elsewhere, Utah women had already been voting for 40 years, and in fact, four female lawmakers led the way for Utah to ratify the amendment extending women's voting rights across the country. Show this thread", "2019-10-02T20:30:18.000Z": "About 1 in 8 women born today in the United States will be diagnosed with breast cancer at some point in their lives. Fortunately, if found early most women can survive it. May we all help raise awareness this month towards combating this disease.", "2019-09-23T22:59:39.000Z": "This week we welcome over 19,000 attendees to Solar Power International as we celebrate North America Smart Energy Week. As energy plays a key role in Utah's successful economic formula we look forward to their work and new solutions during the conference. About | North America Smart Energy Week It's not just a solar show anymore. SPI, ESI & North America Smart Energy Week is the largest event in North America for the renewable energy industry, including solar, storage, smart energy, wind,... solarpowerinternational.com", "2019-09-23T22:08:54.000Z": "Trade is critical to Utah's future. Last year Utah businesses exported $14.4 billion worth of goods to the rest of the world. I am hopeful that Congress will ratify the USMCA. #utpol Guest opinion: How the new trade pact with Mexico and Canada benefits Utah The evidence in favor of free trade is clear and overwhelming. Trade that is free and reciprocal lowers prices for consumers, improves the quality of goods, spurs innovation and creates wealth for... deseret.com", "2019-09-23T18:09:04.000Z": "Listening to @SpencerJCox - - So nice to see so many gathered to stop the scourge of suicide. There is hope and help - call (800) 273-TALK (8255).", "2019-09-21T00:01:41.000Z": "During the trade mission in Japan, I was able to meet with Japan's most prominent business associations. We learned best practices for expanding in the Japanese market, to help promote Utah as a competitive location for Japanese business's. #utpol", "2019-09-20T20:52:03.000Z": "My heart sank when I heard the news that a tour bus crashed near Bryce Canyon. I grieve with all who lost loved ones in this crash and I'm grateful for the quick work of first responders, as well as all those who are volunteering to act as translators. Tour bus crash near Bryce Canyon National Park leaves 4 Chinese tourists dead, 27 others injured Robert Driedonks' voice broke as he described what he saw Friday along State Road 12, after a tour bus carrying Chinese-speaking tourists crashed next to his business. sltrib.com", "2019-09-20T15:58:25.000Z": "According to the U.S. Bureau of Labor Statistics, Utah had the best job growth in the nation last month. #utpol", "2019-09-16T19:53:01.000Z": ". @GovHerbert , commander in chief of the @utnationalguard , and adjutant general, Maj. Gen. Jeff Burton, salute at during the 65th annual Governor's Day.(Photo by @DeseretNews )", "2019-09-12T21:30:06.000Z": "Saddened to hear of the passing of a good friend, Tom Guinney. He not only prepared delicious food but also put real effort into helping us create good policy and a strong community.", "2019-09-11T14:01:00.000Z": "May we always remember those who were lost in these senseless acts of terrorism, and the first responders and everyday heroes who risked and gave their lives on behalf of others. May we never forget.", "2019-09-11T14:00:59.000Z": "Eighteen years ago, we faced the deadliest attack to ever take place on United States soil. In spite of the great tragedy that took place that day, we came together as a country -- in love, in hope, and in resilience.", "2019-09-11T01:53:06.000Z": "Congratulations to 11 year old Bill Martinez and his mom Hope! Their Potato Chip Chocolate Chip Marshmallow Cookie took first place in @GovHerbert 's Favorite Cookie Contest at the @utahstatefair .", "2019-09-11T02:17:31.000Z": "It was a delight for Jeanette and I to help judge this year's cookie contest at the @utahstatefair . Thank you to all our Utah cookie makers who participated.", "2019-09-10T22:15:21.000Z": "Ratifying the United States-Mexico-Canada Agreement is critical to ensuring a good flow of trade with our neighbors to the north and to the south. I'm hopeful Congress will approve it swiftly. #utpol", "2019-09-10T21:26:44.000Z": "Today is #WorldSuicidePreventionDay . If you are concerned about someone you know, you can reach out and help. These simple tips can save lives. \n\nIf you are suffering yourself, please remember: You are important. You are loved. Call these numbers for help or use the SafeUT app. https:// twitter.com/SaltLakeHealth /status/1171531495808176128  This Tweet is unavailable.", "2019-09-06T22:39:02.000Z": "I invite everyone of all faiths to join together this weekend as we pray for those who are in a moment of emotional, physical or mental crisis. I hope we will use the power of our collective faith and prayers to bring about miracles in the lives of those around us.", "2019-09-05T21:47:50.000Z": "I have called a special session of the @utahsenate and @UtahReps to address the distribution of medical cannabis. Removing the requirement for a state central fill pharmacy will provide efficient and timely distribution of this substance for those who need it.", "2019-09-04T18:06:08.000Z": "Glad to join @SpencerJCox in visiting with students at the @leavittcenter at @SUUtbirds this afternoon. #utpol", "2019-09-04T17:05:55.000Z": "Excited to hear from @GovHerbert and this amazing panel on innovation through entrepreneurism and partnership. #UtahRuralSummit", "2019-09-04T16:06:46.000Z": "Wishing Utah's Task Force 1 the best as they travel to North Carolina to help hurricane victims. Their training and expertise will aid many. Utah's Task Force One deploys to assist Hurricane Dorian victims Equipped with rescue boats and K-9 units, 45 members of Utah's Task Force 1, a federally funded emergency disaster team, are expected to arrive in North Carolina Thursday morning. deseret.com", "2019-09-04T15:51:31.000Z": "This morning I'm judging a speed pitch competition at @SUUtbirds as part of the rural economic summit.", "2019-09-03T22:02:09.000Z": "Today I joined @tonyhawk and @StateofSport in announcing the opening of a new Olympic-level skate park. The new park is located at the Utah State Fairgrounds and will host @vansparkseries World Championships.", "2019-09-03T16:09:08.000Z": "I am saddened to hear of yet another fire #SnoqualmieFire . I appreciate our first responders for acting quickly and ensuring no homes have been affected at this time. Our prayers go out to the city of #Layton and those who have been impacted by this fire.", "2019-09-03T14:48:34.000Z": "#uwcnf  #Snoqualmiefire located east of Fernwood picnic area, Salt Lake Ranger District, Davis County. Approx 117 acres 0% contained. Resources on scene 2 crews, 1 helicopter, multiple city and county structure engines and firefighters. Fernwood picnic area is closed.", "2019-08-30T22:04:37.000Z": "This afternoon I toured the damage of the #GunRangeFire and received a full briefing from fire officials. I'm grateful for the quick and professional work of our first responders, and to the community for helping our evacuees. Evacuation orders will remain in place overnight.", "2019-08-30T16:04:46.000Z": "I will visit the incident command center and evacuation shelter in Bountiful this afternoon to learn more about the #GunRangeFire and monitor the situation on the ground.", "2019-08-30T14:16:36.000Z": "Thinking of the many families displaced from their homes this morning as over 400 homes are under mandatory evacuation after the #GunRangeFire broke out overnight above Bountiful. Numerous fire departments are on the scene working to contain the blaze. Quote Tweet FOX 13 News Utah @fox13 Evacuee describes overnight flight from home near Gun Range Fire in Bountiful. City officials said the evacuations will be reassessed at 9 a.m. http:// via.fox13now.com/hv2Gk", "2019-08-22T20:28:53.000Z": "#GoosePointFire is now 60% contained. Dozers continue to build fire line around the base of the mountain. Crews continue to burn out from the dozer lines.", "2019-08-22T18:44:27.000Z": "Today I joined @VP Mike Pence in expressing my support for the United States-Mexico-Canada Trade Agreement. Securing good trade connections with our neighbors is vital. Last year alone Utah exported $2.3 billion in goods to Canada and Mexico. #utpol", "2019-08-22T04:36:33.000Z": "This evening I welcomed my good friend @VP Mike Pence to Utah. We hope you enjoy your time in the Beehive State. #utpol", "2019-08-21T17:57:34.000Z": "I'm taking live calls from constituents on KSL for the next hour. Join us from 12pm-1pm for Let Me Speak to the Governor. Call in with questions at 801-575-8255, text us at 57500 or write a question here.", "2019-08-21T16:17:48.000Z": "@GovHerbert says discussions statewide on bolstering school safety have taken on an intensity since the Marjorie Stoneman shooting in Florida. \"All things ought to be on the table for discussion.\" @KUED #utpol", "2019-08-21T16:14:25.000Z": "@GovHerbert says he appreciates everyone who works at schools, encourages students to be kind and avoid bullying. Herbert says Utah has helped \"enhance\" students' educational experiences. #utpol  #GovKUED", "2019-08-21T16:00:10.000Z": ". @GovHerbert is holding his monthly news conference, where he's expected to talk about tax reform, gun control and more. Watch live here: Mitt Romney says states should take lead on new gun laws. Gov. Herbert agrees time for action may... In the wake of recent mass shootings, U.S. Sen. Mitt Romney said that states are the most likely place for effective new gun laws, but he is likely to get behind federal legislation requiring... sltrib.com", "2019-08-21T15:51:23.000Z": "I will be taking questions from reporters live at 10am. Tune in to our Monthly News Conference with @KUED https:// kued.org/whatson/govern ors-monthly-news-conference   #utpol  #GovKUED Governor's Monthly News Conference The Governor's Monthly News Conference, an unedited exchange between reporters and Governor Gary Herbert. pbsutah.org", "2019-08-19T21:27:41.000Z": "We are so happy to partner with Stadler Rail, @SaltLakeCC , and the Governor's Office of Economic Development to create a unique apprenticeship program. 15 @slcschools seniors will study in school and work with technicians at Stadler Rail. #SLCSD  #uted", "2019-08-19T23:53:20.000Z": "Today I am pleased to announce the launch of Utah's new program, Talent Ready Apprenticeship Connection. Working with Stadler Rail, and @SaltLakeCC to implement their youth apprenticeship model in the State of Utah. 15 Students were selected today to begin the program. #utpol", "2019-08-16T13:56:41.000Z": "Good news from this morning's job report. Utah's job market has grown 3.6 percent over the last year, and our economy continues to lead the nation. #utpol Quote Tweet Workforce Services @JobsUT Utah's fastest growing sectors in July 2019:\n Information - 6.4%\n Education and Health Services - 6.3%\n Construction - 6.0% #UTecon  #utpol  #utbiz Show this thread", "2019-08-15T21:16:56.000Z": "Good luck to all the teachers, students and administrators who are heading back to school this week. Educating our youth as well as our young adults is one of the most important things we can do for our great state. We are grateful for your hard work.", "2019-08-13T19:46:10.000Z": "Today I'm meeting with county commissioners from ten rural counties to discuss local issues. #utpol", "2019-08-13T04:15:07.000Z": "If you were near the #utahstatecapitol tonight you may have seen some crazy lights in the sky! Three @redbull skydivers jumped out of a plane and made the Capitol's South lawn their landing spot to kick of the #nitroworldgames that are being held in Utah this year! #utleg  #utpol", "2019-08-13T03:18:58.000Z": "Tonight we kicked off this year's 2019 #NitroWorldGames with the world-renowned Red Bull Air-Force team and @TravisPastrana . We welcome competitors as they return to compete at the Utah Motorsports Campus. We are pleased to have such an exciting event here in Utah.", "2019-08-08T19:03:23.000Z": "Offering all Utah students the opportunities to learn cutting edge computer science is crucial to helping them prepare for bright futures in today's world. #uted Thanks to everyone leading out on this. Quote Tweet Aaron Skonnard @skonnard Proud of Utah for building a 4-year computer science strategy for all youth and teachers. TY @GovHerbert  @DicksonSyd  @SpencerJCox , and the Talent Ready Board. Together, we are ensuring equality through access #CS4Utah  #siliconslopes  @USBE  https:// plrsig.ht/2yKCv5T", "2019-08-06T21:50:49.000Z": "Grateful for all the work going on at @HAFB . I enjoyed visiting earlier today. @UchtdorfDF  @Utah_DVMA", "2019-08-04T14:21:23.000Z": "It's devastating to wake up to news of another shooting - this one in Dayton, Ohio. Our hearts are with the people of Ohio and all affected by this senseless and sickening violence.", "2019-08-03T22:22:37.000Z": "My heart is heavy today at the news coming out of El Paso, Texas. This shooting is a tragedy beyond belief, and I send my deepest sympathies to @GovAbbott , the wounded, the families that lost loved ones today, and all the good people of Texas.", "2019-08-02T16:49:03.000Z": "Looking back at last week, we express our gratitude to all who participated, attended, and volunteered. Thanks again to @NGA for putting on such a successful Summer Meeting and to @donnyosmond and @marieosmond for a memorable final event. #WeTheStates  #NGAinSLC Quote Tweet NGA @NatlGovsAssoc Thank you, Salt Lake City, for hosting the nation's governors last week. #WeTheStates had an unforgettable time learning and getting to know one another, capped by a reception at The Grand America Hotel and a performance by Utah's own @donnyosmond and @marieosmond . #NGAinSLC", "2019-07-27T13:34:13.000Z": "The @NatlGovsAssoc gives governors from across the nation an opportunity to build relationships across party lines and learn from each other about innovative ways to move our states forward.", "2019-08-01T02:27:32.000Z": "Tonight the seats are filled with 3,100 students who participated in this year's Summer Reading Challenge. Congratulations to all for your reading achievements. Thanks @SaltLakeBees for a great game! @kslreadtoday  #readingchallenge", "2019-07-31T18:00:54.000Z": "Thanks for all you do. It's not an easy assignment. We have every evil that there is in the world in Utah. But we have so many good people we represent, says @GovHerbert \"The safety of the people shall be the highest law\" -  quoting Marcus Cicero at #safetysummit19", "2019-07-31T22:57:45.000Z": ". @GovHerbert outlines a path forward for #Medicaid expansion. UDOH has submitted the \"Per Capita Cap\" waiver, and will start working on the \"Fallback\" plan. Full details: https:// bit.ly/2MvSLzM", "2019-07-31T21:42:05.000Z": "I was pleased to have attended the 2019 Public Safety Summit. We express our gratitude for those who maintain both the rule of law and public order -- as they are essential to a civil society. Public safety is a priority for all of us. #safetysummit19  @UtahDPS", "2019-07-30T18:42:20.000Z": "Thank you to the 165 students of this year's 2019 Freedom Academy who came to visit the Capitol. Their purpose is to teach young student leaders the importance of all aspects of freedom-to ensure freedom is here for generations to come. #UTFA2019 @UtahNationalGuard", "2019-07-29T22:55:18.000Z": "We are saddened to hear of the passing of former First Lady, Norma Matheson. Norma was an impassioned leader. She led many great causes that made Utah a better place. She was a tremendous mother, advocate, and person. The Matheson family is in our prayers at this time.", "2019-07-26T17:08:43.000Z": "This morning I'm moderating a panel at the @NatlGovsAssoc conference on creating innovative strategies for success in our rural communities. #WeTheStates", "2019-07-26T03:55:50.000Z": "Amazing performance by the Emmy Award-winning Tabernacle Choir at Temple Square to wrap up a productive day at the @NatlGovsAssoc  #NGAinSLC  #WeTheStates", "2019-07-25T16:27:15.000Z": "The @NatlGovsAssoc Summer Meeting is officially underway in Salt Lake City. I look forward to learning from my fellow governors. #utpol  #WeTheStates Quote Tweet NGA @NatlGovsAssoc . @GovernorBullock officially opens up the Summer Meeting and wraps up his year-long Chair's Initiative \"Good Jobs for All Americans\" with a session featuring @Cognizant 's @Malcolm_M_Frank and @jamiemerisotis of @LuminaFound  #NGAinSLC Show this thread", "2019-07-24T18:22:49.000Z": "Happy Pioneer Day! As we remember those who arrived in the Salt Lake Valley in 1847, I am grateful for pioneers then - and pioneers now - who have helped build a state of courage, industry, and hope.", "2019-07-23T20:28:35.000Z": "I look forward to meeting with our nation's governors this week here in Salt Lake City. @NatlGovsAssoc Quote Tweet The Salt Lake Tribune @sltrib Ahead of the annual meeting of the National Governors Association, @GovHerbert says he looks forward to discussing \"ways to combat human trafficking, how to spur economic development in rural areas and how to invest thoughtfully in infrastructure\" https:// trib.al/8FfYfiS", "2019-07-22T19:21:00.000Z": "If your plans include celebrating with fireworks, please make sure you celebrate safely.\nFind info and tips to prevent fires & injuries here: https:// dpsnews.utah.gov/celebrating-wi th-fireworks-make-sure-you-celebrate-safely/ ", "2019-07-19T17:33:02.000Z": "The hard work of Utahns continues to drive our economy, which is one of the strongest in the nation. #utpol Quote Tweet Jon S. Pierpont @JonSPierpont Wow! Utah's economy is still making BIG waves with strong job growth at 3.0% and low, low unemployment at 2.8%. #utpol  #UTecon  #utbiz", "2019-07-16T22:57:30.000Z": "As we celebrate the 50th anniversary of the Apollo 11 launch, I remember the countless men and women who worked to make it possible. The moonshot reminds us what humankind can accomplish working side by side. I'm grateful this collaborative spirit lives on in Utah. Quote Tweet NASA Moon @NASAMoon 50 years ago #OTD , three men launched on a Saturn V rocket to the Moon, about to make history and go where no one had gone before. #Apollo50th", "2019-07-16T21:08:54.000Z": "In May, @GovHerbert and I signed Utah's shared stewardship agreement. Today we announced the projects we are beginning to implement, continuing our strong partnership between Utah and the @ForestService  https:// usda.gov/media/press-re leases/2019/07/16/usda-forest-service-and-state-utah-invest-utahs-future-through ", "2019-07-16T17:32:15.000Z": "This morning I was pleased to announce $20 million in funding for projects supporting Utah's Shared Stewardship Agreement with @USDA . These projects will protect watersheds and prevent wildfires. #utpol", "2019-07-16T17:20:04.000Z": "This morning we kicked off Rodeo Week in Utah with a cattle drive. @Daysof47Rodeo Quote Tweet Michael Mower @MikeLMower Yee haw!  It isn't every day they move cattle by the Capitol. #Daysof47 .", "2019-07-11T17:52:53.000Z": "Happy Birthday @SpencerJCox ! I hope you get a second to relax, but maybe not at my desk this time.", "2019-07-11T16:55:51.000Z": "Grateful to meet with leaders of Native American Nations this morning at our annual summit. We are working together to improve outcomes and lives. #utpol", "2019-07-11T16:24:11.000Z": "I appreciate @SenMikeLee 's strong voice for fiscal responsibility in Congress. https:// utahpolicy.com/index.php/feat ures/today-at-utah-policy/20975-watch-sen-mike-lee-warns-national-debt-is-a-ticking-time-bomb ", "2019-07-10T02:24:39.000Z": "I call on all public officials and candidates for Salt Lake City Mayor to condemn today's protests at the Chamber of Commerce. This was not just a protest; this was borderline terrorism. This was bullying, intimidation, and violence, and will not be tolerated. #utpol", "2019-07-09T22:44:48.000Z": "Congratulations to the Utah Sports Commission @StateofSport on bringing the @supercross FIM World Championships Finale to Salt Lake City. Looking forward to this great event in 2020. Quote Tweet Utah Sports Commission @StateofSport \"The season finale will be one of the biggest sporting events ever held in Utah..\" - Jeff Robbins, CEO & Pres. Utah Sports Commission \n\nRead more about the @supercross FIM World Championships  https:// supercrosslive.com/news/Supercros s-2020-Schedule-Announced ", "2019-07-09T16:21:36.000Z": "It was also good to see @NNVPLizer2019 yesterday. I look forward to continuing to work with the Nez-Lizer administration.", "2019-07-08T20:33:42.000Z": "I was grateful to meet with @NNPrezNez , his administration, the Navajo Nation Council @24thnnc, and other Navajo leaders today. Thank you for hosting us and for your strong leadership. #utpol", "2019-07-04T17:10:09.000Z": "Happy Independence Day from the Freedom Festival Parade in Provo. May we remember the grand significance of this day. Have fun and stay safe.", "2019-07-02T18:34:37.000Z": "As we approach Independence Day, I encourage everyone planning to celebrate with fireworks to be cautious. Please review fire safety strategies and tips before lighting fireworks. https:// dpsnews.utah.gov/celebrating-wi th-fireworks-make-sure-you-celebrate-safely/  Quote Tweet Utah Public Safety @UtahDPS Fireworks safety tips:\n* Soak both spent and unused fireworks in water for a few hours before discarding\n\n* Keep a bucket of water nearby to fully extinguish fireworks that don't go off or in case of fire\n\nFind more info & safety tips here: https:// dpsnews.utah.gov/celebrating-wi th-fireworks-make-sure-you-celebrate-safely/ ", "2019-07-01T17:40:43.000Z": "It is legal to light fireworks in certain areas from July 2-July 5. If you choose to celebrate with fireworks, please exercise every caution and take care not to light near vegetation that could easily catch fire. Quote Tweet Utah Public Safety @UtahDPS Fireworks start an average of 18,500 fires per year, causing an average of three deaths, 40 civilian injuries, and an average of $43 million in direct property damage. Find information and tips to celebrate with fireworks SAFELY here: https:// dpsnews.utah.gov/celebrating-wi th-fireworks-make-sure-you-celebrate-safely/ ", "2019-07-01T16:34:03.000Z": "I was deeply saddened to hear of the death of Sergeant First Class Elliott J. Robbins this morning.  I am grateful to him for the service he gave his country. Jeanette and I extend our sincere condolences to his parents, his wife and son at this difficult time.", "2019-06-29T22:09:56.000Z": "Utah is thrilled to receive the GLS youth suicide prevention 5-yr grant from SAMHSA. This will help us do better prevention in targeted schools, enhance support for youth after a suicide attempt or other crisis, and promote healthy life skills for all young people.", "2019-06-28T22:13:16.000Z": ". @LOVELOUDfest cultivates a more accepting and inclusive culture through the universal power of music, which is why I have declared June 29, 2019 as LOVELOUD Day in Utah. Read the full declaration here.", "2019-06-28T22:13:15.000Z": "Cultivating a culture of hope, unconditional love, understanding, respect, acceptance & inclusion for LGBTQ+ youth helps them grow up knowing they are appreciated for who they are, decreasing the isolation and depression that can lead to self-destructive behavior. #TurnUpTheLove", "2019-06-28T18:13:47.000Z": "Our hearts go out to the family and friends of Mackenzie Lueck at this very difficult time. I was horrified and sickened by today's news. I appreciate the work of our public safety officials and their professional and timely efforts as they work this case to its conclusion. Quote Tweet SLC Police Dept. @slcpd Chief Mike Brown confirms the arrest and charges filed in the homicide of Mackenzie Lueck. #MackenzieLueck", "2019-06-27T18:04:31.000Z": "I'm taking live calls from constituents on KSL for the next hour. Join us from 12pm-1pm for Let Me Speak to the Governor. Call in with questions at 801-575-8255, text us at 57500 or write a question here.", "2019-06-27T16:34:20.000Z": "On gerrymandering, @GovHerbert says there should be state guidelines around how voting maps are drawn, and he expects the next round of redistricting will generally follow the concepts of Prop 4. #utpol", "2019-06-27T16:30:24.000Z": "He wants a discussion by experts that can be looked at by the public based on sound science. #KUED  @KUER  @GovHerbert It does not mean there will not be future legislation #utpol", "2019-06-27T16:24:55.000Z": "\"I hope whoever is elected understands they need to work with the governor, with the legislature,\" @GovHerbert - we ought to come together. Looking forward to better cooperation. He says Erin Mendenhall did good job in role at inland port and Luz Escamilla well respected #utpol", "2019-06-27T16:23:52.000Z": "My conversation with the Pope was a highlight of the trade mission for me. Quote Tweet PBS Utah @pbsutah @GovHerbert says Pope Francis asked him to \"pray for me,\" which surprised him. Herbert said in a time of differing views and opinions, people should come together and help each other. #GovKUED", "2019-06-27T16:21:19.000Z": "As I come home to Utah from my trade mission to Europe, I am reminded of and am grateful for the great quality of life we have living here in Utah and in our nation. I hope we remember how blessed we are to live here and for the blessings we have.", "2019-06-27T15:54:19.000Z": "I will be taking questions from reporters live at 10am. Tune in to our Monthly News Conference with @KUED. https:// kued.org/whatson/govern ors-monthly-news-conference   #UTpol  #GovKUED Governor's Monthly News Conference The Governor's Monthly News Conference, an unedited exchange between reporters and Governor Gary Herbert. pbsutah.org", "2019-06-21T14:57:34.000Z": "Find all the latest details about Utah's labor market for May 2019 right here: https:// jobs.utah.gov/blog/post/2019 /06/21/utah-s-employment-summary-may-2019  | #utpol  #UTecon  #utbiz", "2019-06-21T14:33:26.000Z": "Very uplifted by today's visit with Cardinal Pietro Parolin at the #Vatican as we discussed our shared concern for protecting the dignity, worth and freedom of every person of every faith.", "2019-06-20T21:34:24.000Z": "Trade is the lifeblood of Utah's economy and I was pleased to join my fellow governors in asking Congress to approve the #USMCA . It's an important update to the North American Free Trade Agreement that has produced extraordinary benefits for Utah. Quote Tweet The RGA @The_RGA . @thehill : Republican governors press Congress to pass NAFTA replacement https:// thehill.com/policy/finance /trade/449466-republican-governors-press-congress-to-pass-nafta-replacement   #USMCA", "2019-06-19T18:58:56.000Z": "Today we stand together as we commemorate June 19,1865, the emancipation of enslaved African Americans. As we celebrate the victories and history of this crucial day, may we continue to push for equality daily. Happy #Juneteenth .", "2019-06-19T15:26:52.000Z": "Took a break from economic development meetings in Rome today to pay our respects to the Holy Father @Pontifex . Grateful for his strong moral leadership.", "2019-06-18T22:30:09.000Z": "Aerospace is an important part of our economy, and creates opportunities for more Utahns to thrive. Today, at the #ParisAirShow I met with some of the top executives from aerospace companies. We reminded them why Utah is an ideal place to locate and expand their businesses.", "2019-06-17T21:53:49.000Z": "A team of pilots representing @HAFB and the @usairforce is flying F-35s at the #ParisAirShow . It was great to get to meet them earlier today.", "2019-06-14T18:10:54.000Z": "Today we show respect for the U.S. flag and what it symbolizes to us: to come together with united hearts and stand for equality, justice, and liberty for all. #NationalFlagDay", "2019-06-13T16:11:45.000Z": "I am leading a trade delegation of Utah companies and organizations to Europe. While on the trade mission, this delegation will work to boost trade and attract foreign investment to the state. Keep an eye out for updates as we take Utah to the world.", "2019-06-11T19:19:10.000Z": "This seminar seeks to improve the quality of civic education in Utah schools. Our participants today gained valuable knowledge and insight into current events happening in American politics. Thanks to everyone who joined. Quote Tweet Tami Pyfer @tpyfer . @GovHerbert speaking about the importance of civics education with Utah teachers. This is the second civics conference I've been to since school's been out - and I've seen some of the same teachers both times. #WhatIDidOnMySummerVacationTeacherEdition", "2019-06-10T22:04:05.000Z": "It's a pleasure to spend time with my friends and fellow Western Governors of both parties. On a host of western issues, we share lessons learned, find a common ground, and show the federal government what bi-partisan collaboration looks like. #utpol", "2019-06-07T20:07:04.000Z": "Show me who loves chocolate ice cream more than @MikeLMower .\nHappy National Chocolate Ice Cream Day!", "2019-06-07T03:02:26.000Z": "The first question that should always be asked is - \"Would this be better handled at the state level?\" I'm here to tell you states are solving problems. Glad to speak at @E2Summit this evening. #utpol", "2019-06-06T14:18:16.000Z": "\"This operation is not being planned with any alternatives. This operation is planned as a victory, and that's the way it's going to be.\" -- Gen. Dwight D. Eisenhower, Operation: Overlord, June 6, 1944 #DDay75thAnniversary", "2019-06-06T14:03:00.000Z": "On the 75th anniversary of June 6, 1944, that indelible day in history, we recognize and remember our D-Day veterans for their valiant service to our country.", "2019-06-05T18:49:18.000Z": "Junior Achievement of Utah was established in 1956 with hands on programs to educate Utah's students in work readiness, entrepreneurship, and financial literacy. Today we recognize Utah's top business leadership who have funded these programs reaching over 95,000 schools. Quote Tweet Tami Pyfer @tpyfer . @GovHerbert recognizing the success of Junior Achievement - thousands of volunteer hours and nearly 100,000 Utah students impacted by JA. #JAGovernorsBreakfast", "2019-06-04T20:10:22.000Z": "We appreciate the many contributions that members of the Muslim faith make to our Utah family. I invite you to join me in celebrating Eid al-Fitr today.", "2019-06-03T21:30:30.000Z": "Today I was pleased to meet with with @tonyfinaugolf as he partners with the Utah Championship Golf Tournament for hosting his annual Tony Finau Golf Foundation Classic. We are lucky to have Tony represent Utah to help grow the golf community. @UTChampionship", "2019-06-03T19:43:28.000Z": "Happy Great Outdoors Month!\n\nUtah is home to five national parks, seven national monuments, one national historical site, and over 40 state parks.", "2019-05-31T20:33:51.000Z": "I hope all refugees who settle in Utah know that you are as much a part of this state as anyone born here. This is your home. We welcome you to our Utah family and are grateful for the many contributions you make to our communities. Quote Tweet Jon S. Pierpont @JonSPierpont Utah is a shining city on the hill ... @GovHerbert receiving a lifetime achievement award from the refugee community in Utah. #utah  #UTPol", "2019-05-30T15:26:15.000Z": "More good news out of today's #energysummit - @enelgreenpower will deploy state-of-the-art tech at its Cove Fort power plant, which will become the world's first large scale facility to combine geothermal and hydropower tech.", "2019-05-30T15:21:55.000Z": "Rural Utah will soon be home to the largest utility scale #energystorage project in the world thanks to an agreement between Mitsubishi Hitachi and Magnum Development that will create 1,000 megawatts of renewable energy storage.", "2019-05-27T15:37:44.000Z": "On this Memorial Day, I feel humbled and grateful for the sacrifice and service of those who devote their lives to protecting us. I am grateful to all who serve, and all who have served our great state and nation.", "2019-05-23T16:29:58.000Z": "There is no state in America right now more successful than the state of Utah. #utpol", "2019-05-23T16:20:00.000Z": "@GovHerbert says more authority should be given to states, rather than the Federal Government. #GovKUED", "2019-05-23T16:16:48.000Z": ". @GovHerbert concerned about hyper-partisanship dividing country. Says he's conservative in principle but moderate in tone. 'I can only deal with Utah really. In Utah we're good at coming together' #utpol  #GovKUED", "2019-05-23T16:14:53.000Z": "@GovHerbert says he is \"ready willing and able\" to work with anyone in Washington D.C., on both sides of the political aisle. #GovKUED", "2019-05-23T16:12:48.000Z": "@GovHerbert says he thinks the 2020 election will be \"interesting for a variety of reasons.\" He says he likes what President Trump is doing, and the fact that the administration respects state's role in government. #GovKUED", "2019-05-23T16:07:38.000Z": ". @GovHerbert begins by announcing @pewtrusts moved Utah from 45th to 13th in the nation in active voter turnout in the 2018 election.\n\n\"That's good news,\" he says. @fox13  #utpol", "2019-05-23T16:09:34.000Z": "Regarding voter turnout, Utah jumped from 45th in the nation to 13th from 2014-2018. We hope to continue this trend and encourage civic responsibility in Utah.", "2019-05-23T15:44:17.000Z": "The Governor's Monthly News Conference is happening today at 10 a.m. Watch on our Facebook page, or stream on http:// kued.org/governor . #govkued Governor's Monthly News Conference The Governor's Monthly News Conference, an unedited exchange between reporters and Governor Gary Herbert. pbsutah.org", "2019-05-22T16:10:35.000Z": "Just joined @SecretarySonny in signing a shared stewardship agreement that will help us care for and protect our public lands. Working together in partnership, we can do more to preserve our watersheds and our forests. @forestservice", "2019-05-21T19:09:52.000Z": "This morning @UtahDEQ opened a new technical support center. You can read more about how the center will help DEQ care for our environment here: https:// deq.utah.gov/communication/ news/new-deq-tech-support-center-open   #utpol", "2019-05-17T18:22:33.000Z": "At the Governor's Economic Summit, @GovHerbert touts the strongest Utah economy since 2008 - including today's new unemployment rate of 2.9%. #UES19  #UES2019", "2019-05-16T22:06:36.000Z": "I hope all Utah residents and policy and business leaders will join me in pledging to prevent human-caused wildfires, which made up more than half of Utah's wildfires last year. Let us #SparkChange together by taking Utah's wildfire prevention pledge here: Prevent wildfires, take the Pledge at SparkChange.Utah.gov Utah's human-caused wildfires cost tens of millions last year. surveymonkey.com", "2019-05-15T20:35:22.000Z": "Flags are half-staff today in honor of our Peace Officers, who give so very much to keep us safe. God bless all our men and women in uniform. #utpol", "2019-05-12T23:25:49.000Z": "I'm so grateful for my grandmothers, my mother, and for my dear wife, Jeanette - the mother of our six children and a wonderful grandmother. \n\nMothers, thank you for your love, and for all you give. Happy Mother's Day.", "2019-05-10T22:38:00.000Z": "As Utah and the nation celebrate the 150th anniversary of the completion of the Transcontinental Railroad, Native Americans hope we also remember and honor an often forgotten legacy of progress. Spike 150 Celebrations Honor Native American Culture and Legacy As Utah and the nation celebrate the 150th anniversary of the completion of the Transcontinental Railroad, Native Americans hope we also remember and honor an often forgotten legacy of progress. ksltv.com", "2019-05-10T21:50:57.000Z": "We must never forget the sacrifice and backbreaking work of the outcasts and immigrants who physically brought our nation together by constructing the railroad - with @DanMulhall , Ambassador of Ireland.", "2019-05-10T21:36:11.000Z": "Grateful to celebrate the tremendous effort made by thousands of Chinese workers whose labor was essential to the completion of the Transcontinental Railroad. #Done  #Spike150", "2019-05-10T17:55:20.000Z": "As we celebrate the 150th anniversary of the completion of the Transcontinental Railroad, we remember what is possible when we come together from all backgrounds, and work side by side from sun-up to sun-down. #Done  #Spike150", "2019-05-10T15:24:38.000Z": "I am grateful to all of the teachers who dedicate their time, energy, and talents to build up the next generation. Happy #TeacherAppreciationWeek !", "2019-05-09T21:16:14.000Z": "This week we're commemorating the 150th anniversary of the completion of the Transcontinental Railroad and the hard work of those who built it. #Done  #Spike150 Quote Tweet Michael Mower @MikeLMower Big Boy has arrived in Ogden! #Spike150  #utpol", "2019-05-02T21:36:43.000Z": "Good to meet with @RepJohnCurtis  @RepRobBishop  @RepChrisStewart  @RepBenMcAdams  @SenatorRomney and @SenMikeLee today. I appreciate their strong leadership for our state. #utpol Quote Tweet Rep. John Curtis @RepJohnCurtis It was great to meet as a delegation this morning with @GovHerbert in DC to discuss issues that are important to all of our constituents. #utpol", "2019-05-02T20:34:00.000Z": "Today we celebrate the 68th observance of the National Day of Prayer. We are privileged as Americans to practice and affirm our spiritual heritage and the principles upon which our nation was founded.", "2019-05-02T20:12:31.000Z": "I am deeply disturbed by the rise of targeted acts of violence founded in anti-Semitism, racism, and ethnic intolerance. We remember the Holocaust as a warning of what can happen when hate goes unchallenged. We solemnly observe, with you, today as a Day of Remembrance.", "2019-04-24T20:31:24.000Z": "These bills create a new scholarship program, provide funding for computer science courses and implement policies designed to make schools safe, healthy and encouraging learning environments for all Utah students. #UTED", "2019-04-24T20:31:23.000Z": "This morning I ceremonially signed five significant education bills from this legislative session at a groundbreaking for a new elementary school in @jordandistrict .", "2019-04-23T22:33:41.000Z": "Utah is now one of the least burdensome states in the nation when it comes to occupational licensing - good news for Utah workers. #utpol  @UtahCommerce Updates - Institute for Justice This page provides updates and corrections to occupational licensing data presented in the second edition of License to Work, published in November 2017, including revised tables affected by the... ij.org", "2019-04-22T22:07:18.000Z": "This year, the Utah Legislature put $29 million toward improving our air quality. On this Earth Day, I was glad to ceremonially sign 15 bills that will make real progress toward cleaning up our air. #utpol  @utahsenate  @UtahReps  @UtahDEQ", "2019-04-22T17:24:34.000Z": "Today on Earth Day, @GovHerbert will ceremonially sign clean air legislation and recognize the legislature's unprecedented investment in Utah's air quality during the 2019 General Legislative Session.\n\nState Capitol Complex, North Plaza\n2 p.m.", "2019-04-19T15:03:29.000Z": "Good to see another month of strong job numbers for Utah. Quote Tweet Jon S. Pierpont @JonSPierpont Optimism in the #UTecon is strong w/ 3.0% job growth & 3.0% unemployment. This steady continuation of opportunities for Utah's residents is good news - especially for those about to graduate from our local colleges & universities. #utpol  #utbiz Show this thread", "2019-04-18T17:18:48.000Z": "Great day for Utah as @CivicaRx opens its doors with the goal of bringing affordable medication to patients in our state. Grateful for marketplace innovations like this one. @Intermountain", "2019-04-18T16:18:13.000Z": "Had a wonderful time reading with bright students at Franklin Elementary this morning. #uted", "2019-04-18T14:15:15.000Z": "2 hours until the Great Utah #ShakeOut earthquake drill. Register at http:// ShakeOut.org/Utah so you can be informed about next year's drill.\n\nToday, make a plan to get to know your neighbors and build a strong sense of community. It will help in a disaster. #PrepareAndShare", "2019-04-17T21:16:56.000Z": "Wonderful to celebrate the groundbreaking for Pamela's Place, which will provide 100 units of supportive housing. Grateful for a good team dedicated to helping those experiencing homelessness. #utpol", "2019-04-17T19:42:28.000Z": "Great to officially welcome @amazon to Utah today. They are a good addition to our state and we look forward to having them as part of our community for years to come.", "2019-04-15T23:48:20.000Z": "\"Architecture has recorded the greatest ideas of the human race. Not only every religious symbol but every human thought has its page in that vast book.\"--Victor Hugo.", "2019-04-03T16:45:05.000Z": "\"We are sending a message that every person, every individual in our society is worthy of dignity, respect and love.\" - @GovHerbert signs a bill strengthening Utah's hate crimes laws. http:// ow.ly/EoaC30ojrdh  #WeTheStates", "2019-04-02T22:26:59.000Z": "Everybody, every person, every individual in our society, is worthy of dignity, respect and love. Today I signed S.B. 103, which will protect Utahns of all races, creeds, religions, and orientations from hate crimes. Let there be peace on Earth, and let it begin with us. #utpol", "2019-04-01T23:15:51.000Z": "I look forward to signing S.B. 103, Victim Targeting Penalty Enhancements at 12 noon in the rotunda tomorrow. We look forward to celebrating with all Utahns and invite all to witness this historic occasion. #utpol", "2019-03-29T23:56:19.000Z": "Today marks 46 years since the last American troops left South Vietnam. Grateful to join @UTNationalGuard , @RepChrisStewart & @Utah_DVMA to honor Vietnam Veterans today. #utpol", "2019-03-29T23:33:43.000Z": "Thanks UT Legislature for your big down payment toward better air quality! Honored to sign HB353, HB357S01, HB139S01, HB107S03, HB 411S02, HCR3S01 with @RepBriscoe , @StephenHandyUT & @RepAngelaRomero . @UtahReps  @UTLEGtracker  @UCAIR_UT  #utpol", "2019-03-28T22:35:41.000Z": "Thanks to bill sponsor Rep. @steveeliason , Stephenie Larsen & Brian Garrett ( @encircle2gether ), Becky Pickle ( @chickbpick ), Barbara Young (Forever Young Fdn), @KPete801 & @tpyfer for joining me as these bills became law.", "2019-03-28T22:35:39.000Z": "Unprecedented expansion of school counseling, improvements to crisis response, increased psychiatric care, amplified awareness regarding the importance of family acceptance for questioning and LGBTQ+ youth, and improved firearm safety. #utpol", "2019-03-28T22:32:49.000Z": "Capstone day for Utah's impressive legislative session on mental health and suicide prevention as I signed into law HB17, HB174, HB373 and HB393. #utpol", "2019-03-27T23:13:00.000Z": "Congratulations to Dave Rose on a well-earned retirement. You will be missed. https:// twitter.com/BYUbasketball/ status/1110642519455531008  This Tweet is unavailable.", "2019-03-27T19:52:40.000Z": "It was an honor to celebrate @uvu_president Astrid Tuminez at her inauguration. Her exceptional accomplishments, breadth of experience, and unquenchable energy prepared her to be a strong leader. #uted", "2019-03-20T17:35:26.000Z": "Good to see @UVU and Mountainland Technical College take steps to help students get meaningful certification quickly. UVU, Mountainland Technical College pen agreement for 'seamless educational pathways' Utah Valley University and Mountainland Technical College have signed a series of agreements to create \"seamless educational pathways\" from the technical college to the university. ksl.com", "2019-03-20T14:51:22.000Z": "Jeanette and I are so grateful to hear that these volunteers have finally been released from a three-week detainment in Russia. We wish them well as they continue to serve and return home. Quote Tweet Deseret News @DeseretNews UPDATE: \"While we still have questions about the reason for our son's detention,\" the Gaag family said in its statement, \"we are so thankful for his release. We look forward to understanding more in the coming weeks.\" https:// deseretnews.com/article/900061 355/russia-releases-two-latter-day-saint-volunteers-after-nearly-three-weeks-in-jail.html ", "2019-03-15T18:16:17.000Z": "Thank you, Gail, for standing for civility. Quote Tweet utahjazz @utahjazz Gail Miller addressed tonight's crowd ahead of tip-off", "2019-03-15T17:44:45.000Z": "Today I mourn with the people of Christchurch, New Zealand and with our Muslim community. Read my full statement here:", "2019-03-15T04:00:42.000Z": "Happy Birthday to our wonderful First Lady, who has spent her special day at the capitol counting down to the end of the legislative session. #utpol", "2019-03-13T03:05:12.000Z": "I appreciate the great work of the legislature on SB103, which will serve as a powerful tool in providing critical protections to Utah residents. I look forward to it landing on my desk and signing it into law. #utpol  @SenThatcher", "2019-03-12T22:21:04.000Z": "Happy Birthday, Senator @MittRomney . Thank you for representing our state with dedication, intelligence and wisdom.", "2019-03-12T22:03:39.000Z": "Grateful to @POTUS for his support and signature on a public lands package that will greatly benefit Utah and its public lands. Great work from @RepRobBishop  @RepChrisStewart and @RepJohnCurtis getting this through Congress.", "2019-03-08T23:37:45.000Z": "And here's a behind the scenes look. (Thanks Holly Langton for taking one for the team and taking this  photo from the stairs.)", "2019-03-08T22:40:22.000Z": "On #InternationalWomensDay , I have been thinking with gratitude about the many women who serve in our administration. Thank you, women of Team Utah, for all you do for our state and its citizens. #utpol", "2019-03-07T22:59:07.000Z": "Relying on the same old tax code and fiscal constraints to invest in our future won't cut it. We no longer have the luxury of time if we hope to ensure our state's economic stability. We will continue to work on modernizing our tax code. #utpol", "2019-03-05T00:43:00.000Z": "Wondering why tax reform is necessary? Learn more here: https:// house.utah.gov/tax-modernizat ion/   #utpol Tax Modernization - Utah House of Representatives house.utah.gov", "2019-03-05T00:41:50.000Z": "Utah's tax code needs to keep up with our modern economy, which is why we need to reform our tax system this session. https:// vimeo.com/246828020  #utpol Utah Tax Modernization This is \"Utah Tax Modernization\" by Utah Media Group on Vimeo, the home for high quality videos and the people who love them. vimeo.com", "2019-03-02T05:56:47.000Z": "The hefty tax overhaul bill is headed to the House floor after getting strong support from members of a legislative panel Friday afternoon State's big tax reform bill roars out of a legislative committee. Next stop: the chamber floor. A hefty tax overhaul bill is headed to the Utah House floor after receiving strong support from members of a legislative panel Friday afternoon. sltrib.com", "2019-03-01T21:37:51.000Z": "Today's job numbers mark a great milestone for Utah -- our unemployment rate has been below 4% for five years in a row. #utpol  @JobsUT", "2019-02-28T15:50:07.000Z": ". @AScottAnderson : Pro-growth tax reform is a generational opportunity: https:// deseretnews.com/article/900057 914/a-scott-anderson-pro-growth-tax-reform-is-a-generational-opportunity.html   #utpol  #utleg  #taxreform A. Scott Anderson: Pro-growth tax reform is a generational opportunity It is the almost-universal nature of government to postpone thorny problems until a major crisis forces action. deseret.com", "2019-03-01T16:14:57.000Z": "Utah's January job growth numbers are strong, with 3.2% growth and unemployment dropping down to 3.1%. @JobsUT  #utpol Where the Jobs Are A look at the 10 hottest and coldest labor markets in the U.S. wsj.com", "2019-02-28T19:06:22.000Z": "Tune in with us from 12-1 for Let Me Speak to the Governor on KSL. Call in at with questions at 801-575-8255, text us at 57500 or write a question here.", "2019-02-28T17:48:49.000Z": ". @BenWinslow asks, can you guarantee that the average Utahn will see a tax break after this bill goes through? @GovHerbert says \"Yes.\" #GovKUED  #utpol", "2019-02-28T17:55:29.000Z": "On the bill to bring higher-strength beer to Utah grocery stores, @GovHerbert says \"we have to reflect the market,\" does not specify whether he would sign the bill should it pass. #GovKUED  #utpol  #utleg", "2019-02-28T17:56:56.000Z": "On #LGBTQ conversion therapy ban bill, @GovHerbert says some conversion therapy methods are \"barbaric.\" \n\nOn hate crimes, he says he gets the concept and is OK with it. But he'll take a look at the bill and whether he supports it or not. @fox13  #utpol  #GovKUED", "2019-02-28T17:46:33.000Z": "We should be concerned about what the equitable tax policy should be that will be fair and easy to administrate. #utpol", "2019-02-28T15:40:00.000Z": "Thursday at 10:30AM, it's The Governor's Monthly News Conference with @GovHerbert . Watch live on Facebook or stream via the link below. #GovKUED  #utpol Governor's Monthly News Conference The Governor's Monthly News Conference, an unedited exchange between reporters and Governor Gary Herbert. pbsutah.org", "2019-02-27T00:43:19.000Z": "I am thrilled to see Congress pass a bill that has enormous benefits for Utah and especially for several parts of rural Utah. Thank you @RepRobBishop for your leadership on this. #utpol", "2019-02-26T22:14:03.000Z": "This bill stabilizes Utah's General Fund. That, in turn, protects Utah's Education Fund for Utah's children.", "2019-02-26T22:14:02.000Z": "I am very proud of our legislators for their foresight on behalf of Utah's middle class. Today's monumental tax reform bill will make Utah's tax system more fair and stable, keeping Utah on the path of economic prosperity.", "2019-02-26T22:14:01.000Z": "I am grateful to @JStuartAdams , @BradWilsonGOP , @LincolnFillmore , @RepTimQuinn and @SpendloveRobert for leading out on important tax reform legislation. #utpol", "2019-02-18T16:36:07.000Z": "On this #PresidentsDay , I feel grateful for the great leaders who have built and guided our nation. #utpol", "2019-02-16T00:55:54.000Z": ". @sandycityutah is notifying those affected and sharing appropriate precautions. This issue is not valley wide. Quote Tweet Utah DEQ @UtahDEQ BREAKING: High levels of lead and fluoride are present in Sandy City municipal drinking water in the aftermath of last week's storm. Efforts are being taken to mitigate the situation. For media contact @deqdonna . Show this thread", "2019-02-15T19:15:56.000Z": "This morning's quakes in Bluffdale were a good wake up call - we need to be prepared for #earthquakes . Please take a moment to review your emergency preparedness plans. You can learn more here: Quote Tweet Be Ready Utah @BeReadyUtah #Prepare for an #earthquake . Many felt it this morning, but now most of us have at least heard about it. This information is about earthquake activity in Utah and what we can do to Be Ready: http:// ow.ly/OKv730hk8OK  #MakeAPlan  #GetAKit  #BeInformed  #GetInvolved", "2019-02-13T21:47:10.000Z": "I was proud to nominate president of Utah-based @wgu  @Pulsipher_WGU to serve on American Workforce Policy Advisory Board. His appointment today will bring a valuable perspective to help better align education with workforce needs.", "2019-02-13T20:07:18.000Z": "**NEW EPISODE*** @GovHerbert calls in to @TribTalk to pitch his $200M+ tax cut and reform proposal, his number-one priority for the 2019 session. \n\n'Trib Talk': Utah Gov. Gary Herbert wants a big tax cut, and bigger tax reform, via @sltrib  #uted  #utpol  https:// sltrib.com/news/politics/ 2019/02/13/trib-talk-utah-gov-gary ", "2019-02-13T00:13:38.000Z": "Had a good conversation with Willie Grayeyes and Kenneth Maryboy, the new county commissioners for San Juan County. I look forward to working with them.", "2019-02-12T14:00:01.000Z": "My thanks to @RepRobBishop , @RepJohnCurtis , Senator @MittRomney , and @RepChrisStewart for helping advance a public lands bill that will bring over $100 million to Utah's students. Excited to see it pass the Senate today. Sen. Mitt Romney: Rural lands package reflects Utah priorities Utah is, and will always be, a public lands state. As such, we must look for more public lands solutions that come from the bottom up and not the top down. deseret.com", "2019-02-11T23:10:05.000Z": "Moments ago, I signed S.B. 96 into law. This bill balances Utah's sense of compassion and frugality. It provides quality coverage to the same population covered by Proposition 3 in a meaningful, humane and sustainable way. #utpol", "2019-02-08T23:48:27.000Z": "Congratulations to @encircle2gether on dedicating the new Encircle House in Salt Lake City today. Thank you for supporting LGBTQ+ youth and their families. I'm grateful to Stephenie Larsen and team for their passion and service.", "2019-02-08T23:18:46.000Z": "I'm encouraged to see the @UtahSenate and @UtahReps approving compassionate and sustainable solutions to get healthcare to our most vulnerable Utahns. Read my thoughts on #SB96 here: https:// governor.utah.gov/2019/02/08/how -i-see-s-b-96-sustainable-medicaid-expansion/   #utpol", "2019-02-07T16:53:31.000Z": "Running into this 4th grade class from Emerson Elementary School has been one of the highlights of my day. The future of Utah is in great hands.", "2019-02-07T01:24:34.000Z": "Very grateful to @UTHighwayPatrol , @UtahDPS and @UDOTTRAFFIC for all their work to keep our roads clear and safe during today's extreme weather conditions. Stay safe and warm out there.", "2019-02-06T13:54:11.000Z": "Due to snow, all nonessential state workers should plan to arrive at work by 12:00 p.m. today. Stay safe out there. We're grateful to @UDOTTRAFFIC , @UtahDPS , and @UTHighwayPatrol for all they are doing to make our roads safe.", "2019-02-05T17:22:17.000Z": "Speaking at Multicultural Youth Leadership Day at the @UTStateCapitol about the importance of education. Wonderful to be in this room full of future leaders. #utpol  #uted", "2019-02-04T21:18:22.000Z": "Grateful to join @UtahAG , @UTHumanServices and DCFS in signing an IGA to commit to keep Utah Navajo children with their kin and families when child welfare services are needed. #utpol", "2019-02-04T01:13:31.000Z": "Congratulations to Johnny Miller on his retirement. He brought much to the world of golf and will be missed.", "2019-02-01T22:25:29.000Z": "\"My life has been children.\" Mignon Barker Richmond used that simple phrase to describe an extraordinary life as a community organizer and volunteer who changed Utah. This Black History Month, let's remember her story -- and many others. #BlackHistoryMonth", "2019-02-01T21:10:29.000Z": "In recognition of #Spike150 I just declared 2019 the Year of the Train. We are the crossroads of the west - and here's to another 150 years of bringing the country together. @UTHeritageArts  @UTHistory", "2019-02-01T14:57:40.000Z": "Utah is the most fiscally stable state in the nation. Thank you, @utahsenate and @UtahReps for your dedication to keeping our state budget balanced. #utpol These U.S. States Are the Most Fiscally Stable How fiscally stable is your state? usnews.com", "2019-01-31T01:54:30.000Z": "This is the year to stand together to create a fairer, a simpler and a more sustainable tax code, by broadening the base, cutting the rates and giving low and middle income families their biggest tax cut in Utah's history.", "2019-01-31T01:51:34.000Z": "This legislative session, we should do more to protect the nameless, the outcast and the vulnerable; remember we can accomplish great things despite division and discord; and work together to lay a foundation for our future prosperity.", "2019-01-31T01:51:33.000Z": "As we celebrate #Spike150 , let's honor the nameless and the outcast whose backbreaking work unified our nation in this great undertaking. #utpol"}