{"2020-07-30T17:16:34.000Z": "Sadly, I learned today that we've lost another Vermonter to COVID-19, for the first time since June 16. It is a sobering reminder that this virus is still among us, and it's up to all of us to do our part to keep our friends, family and neighbors safe and healthy.", "2020-07-29T16:14:56.000Z": "Vermont is so fortunate to have Dr. Mark Levine as ... @healthvermont  commissioner. He and his entire team have been nothing short of remarkable throughout these trying times and we'll continue to rely on their guidance in the weeks and months to come. Health Commissioner Mark Levine Takes Off His Mask At least twice a week, in a room full of television cameras, state Health Commissioner Dr. Mark Levine steps up to a podium, removes his... sevendaysvt.com", "2020-07-29T13:53:03.000Z": "I'm sorry to hear about the loss of @BruceZeman 's faithful companion Hobbes. I and many others are going to miss seeing Hobbes at events throughout Vermont, where he inspired many. (1/2) In Memoriam: Hobbes, Canine Host of the \"Bruce & Hobbes\" Radio Show Hobbes has gone home for good - and animal lovers throughout Vermont are mourning his death. Though diminutive in stature, the tiny, brown, short-haired Dachshund... m.sevendaysvt.com", "2020-07-28T23:40:45.000Z": ". @VTAgencyofAg : Several Vermonters have received unsolicited packages containing seeds that appear to have originated from China. Unsolicited seeds could be invasive species, could introduce diseases to local plants, or could be harmful to livestock. Do not plant. Read more Quote Tweet VTAgencyofAg @VTAgencyofAg What to do if you receive unsolicited seeds in the mail in Vermont. Visit https:// agriculture.vermont.gov/agency-agricul ture-food-markets-news/reports-unsolicited-packages-seeds-vermont   @VTAgencyofAg  #VT", "2020-07-28T23:19:31.000Z": "Thank you @SOVT for your tenacity and creativity, and congratulations to all of the wonderful athletes for their hard work and accomplishments! Quote Tweet Special Olympics VT @SOVT Thank you to Governor Phil Scott for his kind words during our SummerFest kickoff on July 10th! @GovPhilScott", "2020-07-28T15:32:17.000Z": "While this pandemic has created countless challenges and obstacles, we owe it to our kids and their parents to provide them with the best possible education, preferably in-person, or a hybrid system that allows them to easily toggle between the two. 18/", "2020-07-28T15:32:16.000Z": "Fortunately, VT is in a much better position that most other states. In fact, we're probably in a better position than any other state to return to school - an opportunity to do what's right for our kids & families, because of how successful we've been in limiting the spread. 17/", "2020-07-28T15:32:15.000Z": "Now, I want to be clear: None of this is ideal, but it's our reality, and I know anxiety is high, even while the health data and experts clearly support in-person instruction. And I can assure you, we will not hesitate to act to protect our students and school employees. 16/", "2020-07-28T15:32:14.000Z": "With that in mind, I'll issue an Executive Order later this week, setting Tuesday, 9/8 as a universal start date for students. We'll also work with the legislature to change the requirements of the school calendar to give districts greater flexibility. 14/", "2020-07-28T15:32:13.000Z": "While Vermont's data, the science, and the expert advice would allow for more in-person instruction than many schools are currently planning, I understand the need for caution and the need for school staff, parents and children to ease into this to gain confidence.  11/", "2020-07-28T15:32:12.000Z": "We also know there is not a \"one-size-fits-all\" plan for our hundreds of schools because each are a bit different. As well, due to our state school structure, we must also respect the local decision-making process. 8/", "2020-07-28T15:32:11.000Z": "With this knowledge, they continue to recommend kids be in school in areas, like VT, with a low number of cases, and who have the ability to quickly contain outbreaks when they occur. Dr. Fauci has recognized the importance of opening schools in areas with low positivity rates.6/", "2020-07-28T15:32:10.000Z": "At the same time, we recognized how unpredictable this pandemic is, and the anxiety it can and has caused. So, our planning included remote learning and hybrid models, as alternatives.  2/", "2020-07-28T15:32:09.000Z": "Seven weeks ago, Dr. Levine, Secretary French and I spoke at a press conference and set a clear goal: To return to in-person instruction for our kids in the Fall. 1/", "2020-07-25T18:46:21.000Z": "Here's a link to the Executive Order: https:// governor.vermont.gov/content/addend um-2-amended-and-restated-executive-order-no-01-20  And here's the science: https:// cdc.gov/media/releases /2020/p0714-americans-to-wear-masks.html ", "2020-07-25T18:46:20.000Z": "Actually, effective next week, it is the law. I get it, you don't want to wear a mask, but wearing one is a sign of strength. And if everyone did, we'd get back to normal quicker. Wearing a mask will keep your friends and family safer. The science is clear... do the right thing. Quote Tweet #nomask @lee_3po Hey @GovPhilScott , just a reminder that myself and many others I know aren't wearing the mask.\nMandate all you want.\nIt isn't written and agreed upon law to force the wearing of masks.\nStop being a tyrant. #NoMask Show this thread", "2020-07-25T14:07:01.000Z": "Yesterday my team presented Vermont's latest data & modeling. We're fortunate to have among the lowest positivity rates, hospitalizations and new cases in the nation. But, as we see across the country, things can change fast. That's why it's more important than ever to #MaskOnVT", "2020-07-24T20:30:57.000Z": "Go @RedSox ! #OpeningNight Quote Tweet Charlie Baker @MassGovernor Looking forward to joining the @RedSox and Mayor @marty_walsh tonight at @fenwaypark for #OpeningDay ! #RedSoxNation is ready to kick off the 2020 season! https:// twitter.com/RedSox/status/ 1286654870926299143 ", "2020-07-24T16:20:14.000Z": "I applaud the science-based, data-driven decision by @GovPhilScott to implement a mask mandate in VT for inside and outside where social distancing cannot be maintained. We're all in this together. It's the #VermontWay  #MaskOn Quote Tweet Governor Phil Scott @GovPhilScott Today, to help protect the progress we've made combating COVID-19 and stay one of the healthiest states in the nation, I signed an Order that will require masks to be worn in public spaces, both indoor and outdoor, where physical distancing is not possible. #MaskOnVT 1/ Show this thread", "2020-07-24T15:14:07.000Z": "For those Vermonters who don't fall into this category but have resisted wearing a mask, I'm ASKING you to look at the data, the REAL data, not just something you see on Facebook. The science is real and wearing a mask will help your family, friends and neighbors stay healthy. 6/", "2020-07-24T15:14:06.000Z": "Because Vermonters have followed @healthvermont guidance and cared for one another, our positivity rate is frequently the lowest in the country, and right now, we have fewer cases than any other state. Importantly, we haven't lost a Vermonter to this virus in over a month. 2/", "2020-07-24T15:14:05.000Z": "Today, to help protect the progress we've made combating COVID-19 and stay one of the healthiest states in the nation, I signed an Order that will require masks to be worn in public spaces, both indoor and outdoor, where physical distancing is not possible. #MaskOnVT", "2020-07-22T21:44:50.000Z": "WATCH: @HealthVermont Commissioner Mark Levine, M.D., discussing Vermont's experience with the pandemic on @CNN . \n\n\"The tiny but mighty Northeasten state of Vermont\" - @BeckyCNN Quote Tweet Connect the World @CNNConnect Vermont has the lowest number of #covid19 cases across the United States. How're they doing it? @BeckyCNN speaks to the state's Health Commissioner @healthvermont to find out.", "2020-07-22T17:57:06.000Z": "In February I had the chance to sit down with @ChrisEvans for his latest project, @ASP , which launched this month. \n\nThis is a great initiative which aims to help Americans connect with their representatives and bring more civility back to our politics. https:// people.com/movies/chris-e vans-new-website-is-here-what-to-know-about-a-starting-point/ ", "2020-07-22T00:10:24.000Z": "The Health Department is working with the Centers for Disease Control and Prevention about the tests and our investigation to help determine why there were so many false-positives at this non-Health Department facility, which used antigen tests. 3/3 Coronavirus (COVID-19) healthvermont.gov", "2020-07-22T00:10:23.000Z": "As @healthvermont Commissioner Mark Levine, M.D., reported today - in response to the reports of 65 positive antigen tests from a private facility in Manchester - 1,613 people were tested through various sites in the area last week by the state. All but 5 were negative. 1/3", "2020-07-21T16:23:00.000Z": "Hey, @GovPhilScott !  We hope you like #Brattleboro 's wear a mask campaign!  We #Vermont so we're trying to do our part! #lovebrattleborovt", "2020-07-21T16:20:07.000Z": "NEW: In addition, @healtvermont says PCR testing of 1,613 people at two sites in Manchester & Londonderry last week found only 5 positives, a rate equal to rest of #vt -- means *no cluster or community spread* Levine said. #vtpoli", "2020-07-21T15:13:06.000Z": "Vermonters have done a great job protecting each other, and made tremendous sacrifices. But I know many are tired of doing so, and just want things back to normal. \n\nBut, the fact is, this virus is going to be with us for a while, and will be until a vaccine is in place. 7/", "2020-07-21T15:13:05.000Z": "We're always keeping a close eye on what's going on around the country and the numbers we're seeing are concerning. Our trends in VT have held pretty steady. And while, as expected, we've seen more cases as we've methodically opened back up, we still have a lot to be proud of. 1/", "2020-07-19T12:21:39.000Z": "Reminder: Today marks four months since Vermont's first confirmed fatality from COVID-19. In honor of the Vermonters we have lost to this terrible disease, I have ordered the U.S. and Vermont State flags to fly at half-staff on the 19th of every month for the rest of 2020.", "2020-07-17T22:35:49.000Z": "Although this is good news, we must remain vigilant. That means following @healthvermont guidelines. It's up to all of us to keep these trends going. \n\n\"Vermont goes 30 days with no COVID-19 deaths\" Vermont becomes the only state in the nation without a death from COVID-19 in the past 30 days Compared to neighboring states, Vermont has a much smaller population. Still, its deaths per capita are substantially lower than those states. burlingtonfreepress.com", "2020-07-18T03:46:08.000Z": "John Lewis was an American hero among us, a lodestar who drew us closer to our ideals. He was a dear friend and mentor to me on civil rights and so much else. I felt honored when he called me his brother and when he came to Vermont last year. Marcelle and I are in tears.", "2020-07-16T15:46:38.000Z": "Vermont's dairy sector has experienced steep declines in milk prices along with market disruption and increased operating costs due to COVID-19. Tomorrow, the application for our $25 million Agriculture Assistance Grant Program goes live.\n\nDetails  https:// governor.vermont.gov/press-release/governor-phil-scott-announces-25-million-relief-grants-vermont-dairy-farmers-and ", "2020-07-16T02:21:23.000Z": "Vermonters: Completing the Census is a constitutional responsibility of all Americans. Please help our state and take 5 minutes to fill out your response http:// 2020census.gov . Quote Tweet VT Commission Women @VTWomen #VT 's Census response rate is just 55.4%, compared to the national rate of 62%, meaning Vermonters could leave billions of dollars of federal funding on the table. \n\nTake 5 minutes to fill out the #census2020 so our state gets the funding we deserve at http:// 2020census.gov !", "2020-07-15T18:35:41.000Z": "It was great speaking with you all. Thank you for stepping up and serving on the front lines. Quote Tweet Matthew Siket @SiketMD Thank you @GovPhilScott  @healthvermont for taking the time to meet today with the EM residents @UVMEmergencyMed . We are honored to practice emergency medicine and grateful for Vermonters and our state leaders for keeping us safe and healthy! @UVMLarnerMed  @UVMMedCenter", "2020-07-15T14:21:37.000Z": "On Monday, I signed into law S.342, An Act Relating to Temporary Workers' Compensation Amendments Related to COVID-19. During these unprecedented times, it's vital we do all we can to ensure Vermonters returning to work do so under the safest possible conditions.\nSigning letter", "2020-07-14T13:59:13.000Z": "The other states signing the MOU are California, Connecticut, Colorado, Hawaii, Maine, Maryland, Massachusetts, New Jersey, New York, North Carolina, Oregon, Pennsylvania, Rhode Island, Vermont and Washington. 3/3", "2020-07-14T13:59:12.000Z": "Today I joined 15 states in signing an MOU to accelerate electrification of the medium and heavy duty bus and truck market. This is an important step forward in our ongoing commitment to increase the number of electric vehicles on the road in Vermont. 1/ https:// governor.vermont.gov/press-release/governor-phil-scott-signs-multi-state-agreement-electrify-trucks-and-buses ", "2020-07-13T21:44:42.000Z": "Gorgeous state....gorgeous and creative photography by Vermont's own Caleb Kenna. Quote Tweet Governor Phil Scott @GovPhilScott Today the @NYTimes featured our beautiful state as part of their series, \"The World Through a Lens.\" \n\nWe're fortunate to live in such an incredible place. \n\nCheck it out  https:// nytimes.com/2020/07/13/tra vel/vermont-drone-photographs.amp.html?referringSource=articleShare#click=https://t.co/eI8dkOVIX1 ", "2020-07-13T21:43:50.000Z": "Tragically, this is something we have seen far too many times. But this time Americans from all walks of life have come together to say, 'enough is enough.' And while Vermont has committed to fair and impartial policing for years, there is clearly more work to be done. 2/", "2020-07-13T21:43:49.000Z": "Today, I signed into law S.219, An act relating to addressing racial bias and excessive use of force by law enforcement. Exactly 8 weeks ago today, this country watched the murder of George Floyd under the knee of an officer who was supposed to serve and protect all people. 1/", "2020-07-13T18:18:19.000Z": "Today the @NYTimes featured our beautiful state as part of their series, \"The World Through a Lens.\" \n\nWe're fortunate to live in such an incredible place. \n\nCheck it out Behold Vermont, From Above These aerial images, stunning in their abstraction, evoke a powerful sense of transcendence and tranquillity. nytimes.com", "2020-07-11T14:12:00.000Z": "Yesterday, Commissioner @MSPieciak presented VT's updated COVID-19 modeling and data. Our seven-day test positivity average is just 0.5% -- the lowest in the United States.\n\nTo keep it up, we must remain vigilant. That means wearing a mask when you can't be physically distanced.", "2020-07-10T19:43:00.000Z": "Today I announced $30 million in housing assistance to those affected by COVID-19. \n\nRenters, homeowners and those experiencing homelessness have all been impacted by this virus and need help, which is why we've worked with the Leg. to provide this relief. https:// governor.vermont.gov/press-release/governor-phil-scott-announces-housing-assistance-programs ", "2020-07-10T16:36:15.000Z": "#FreePressFriday Quote Tweet Society of Professional Journalists @spj_tweets \"We're fortunate to live in a country where free speech and the freedom of the press are constitutional rights, not privileges given to us by any one person or any government. It's a fundamental part of who we are as Americans.\" - Phil Scott #FreePressFriday", "2020-07-10T15:03:33.000Z": "Our great teams at ... @healthvermont , ... @VTNationalGuard  and other partners have worked hard to build a robust testing program in Vermont. We remain a leader in testing in the United States. https:// healthvermont.gov/response/coronavirus-covid-19/testing-covid-19  Is Your State Doing Enough Coronavirus Testing? The number of daily coronavirus tests conducted in the United States is only 36 percent of the level necessary to mitigate the spread of the virus, according to estimates by researchers at the... nytimes.com", "2020-07-08T13:34:08.000Z": "Many have had to cancel travel plans this year, but as VT continues to trend well, it's a great opportunity for 'staycations' - Vermonters exploring Vermont. I encourage folks to support local businesses & spend time discovering all our state has to offer. Introducing 'Staytripper,' the Road Map to Rediscovering Vermont Vermont is known around the world as a playground for hardy tourists. Nearly 13 million out-of-staters visit these Green Mountains in a typical year, seeking... sevendaysvt.com", "2020-07-07T13:52:30.000Z": "Vermont employers can learn more about how to apply for Emergency Economic Recovery Grants by clicking here: https:// accd.vermont.gov/covid-19/econo mic-recovery-grants  Quote Tweet VTDigger @vtdigger Thousands of Vermonters were ready to go with their documents on Monday morning, when the first-come, first-served emergency grant applications opened. https:// vtdigger.org/2020/07/06/a-s mooth-start-for-vermonts-emergency-business-grants-program/ ", "2020-07-06T15:22:51.000Z": "Getting kids back to school safely is critical for the development and well-being of Vermont students, which is why @VTEducation has been planning with health experts and education stakeholders for months. You can read that group's initial guidance here: https:// education.vermont.gov/sites/aoe/file s/documents/edu-vdh-guidance-strong-healthy-start-school-health-rev-20200617.pdf ", "2020-07-04T18:21:01.000Z": "There's no denying this year's celebrations are different. But just as it was when we declared our independence, our ability to unite around a common cause - regardless of our differences - remains essential to our success as a nation. I wish all Vermonters a safe and happy 4th.", "2020-07-03T12:35:39.000Z": "Vermont has not had a COVID-19-positive patient in the ICU since May 24. \n\nKeeping physically distanced, wearing masks, washing your hands and following other @healthvermont guidelines are easy ways to show your continued commitment to the health and safety of fellow Vermonters.", "2020-07-03T12:16:37.000Z": "And we're all working hard in Vermont and Washington and on the Senate Appropriations Committee to keep it that way... Quote Tweet Governor Phil Scott @GovPhilScott As we see concerning outbreaks across parts of the United States, we are fortunate the Northeast continues to move in the right direction. \n\nHere in Vermont, between June 26 and July 1, our seven-day average test positivity was 0.4 percent, the lowest in the United States.", "2020-07-02T18:51:42.000Z": "As we see concerning outbreaks across parts of the United States, we are fortunate the Northeast continues to move in the right direction. \n\nHere in Vermont, between June 26 and July 1, our seven-day average test positivity was 0.4 percent, the lowest in the United States.", "2020-07-02T17:11:52.000Z": "NEW: A new law will make #Vt more affordable & grow the economy. The bill signed into law by @GovPhilScott will allow Vermonters to better promote food grown & or processed in VT. The law allow shoppers to better understand what they are buying. MORE https:// facebook.com/122396850343/posts/10163909066800344/  The following media includes potentially sensitive content. Change settings View", "null": "", "2020-07-01T21:54:46.000Z": "It's up to all Vermonters to keep this up. Please continue to be smart, stay safe and follow @healthvermont guidelines! Quote Tweet VT Dept of Health @healthvermont A new report says that #Vermont is one of only 4 states doing enough to suppress the spread of #COVID -19. This means we are reducing new infections and keeping them low enough to safely open public life again. http:// ow.ly/Kway50Anj6v  #VermontStrong", "2020-07-01T20:11:39.000Z": "More information on how Vermont businesses can access Economic Recovery Grants here: https:// accd.vermont.gov/covid-19/econo mic-recovery-grants  Quote Tweet Vermont Agency of Commerce & Community Development @VTEconDev Attention Vermont Businesses: Please join ACCD for a free webinar July 2, 2020 at 3:00PM for a presentation on the Emergency Recovery Grants; available for businesses to apply for on July 6, 2020. https:// accd.vermont.gov/content/emerge ncy-recovery-grants-overview-webinar ", "2020-07-01T15:11:03.000Z": "The USMCA goes into effect today. The agreement will help grow the New England economy and expand our trading relationships with key partners like Canada. Here's what @GovChrisSununu and I had to say about it last year: https:// governor.vermont.gov/governor-scotts-blog/governors-scott-and-sununu-usmca-trade-deal-good-new-england-economy  Quote Tweet Québec Government office in Boston @QuebecBoston Today begins a new chapter in the #NorthAmerican cross border relationship - the #USMCA enters in to force: improving competitiveness, stimulating innovation, creating millions of jobs, and reducing costs  #FriendsPartnersAllies", "2020-06-30T19:36:52.000Z": "Wearing a mask to protect others shows strength, not weakness. \n\nPlease continue to follow guidance from @healthvermont to help slow the spread. We're still fighting this pandemic, and it takes all of us working together and caring for one another. Quote Tweet VT Dept of Health @healthvermont People who don't have any symptoms can still spread #COVID -19. Help protect your family and friends - bring a #mask when leaving your house and stay 6 feet away from others. Together we can help stop the spread of COVID-19 and start getting back to normal. #MasksOnVT  #Vermont  #VT", "2020-06-30T16:20:12.000Z": "People who don't have any symptoms can still spread #COVID -19. Help protect your family and friends - bring a #mask when leaving your house and stay 6 feet away from others. Together we can help stop the spread of COVID-19 and start getting back to normal. #MasksOnVT  #Vermont  #VT", "2020-06-29T17:54:37.000Z": "As the Northeast continues to see positive trends like Vermont, last week we expanded the number of states covered under our county-by-county quarantine-free travel policy, which allows direct travel from designated counties without a quarantine. https:// governor.vermont.gov/press-release/governor-phil-scott-expands-trusted-travel-policy ", "2020-06-27T20:43:23.000Z": "Thank you to ... @vermont_united  for sending a strong message of unity and community. \n\nWe're all in this together and that means we need to help each other - wearing masks, distancing, washing our hands and following ... @healthvermont  guidelines. Vermont mask spreads message of unity in face of pandemic What started as a way to show \"we're all in this together,\" has now become somewhat of a pandemic slogan for Vermont. wcax.com", "2020-06-27T14:17:55.000Z": "It only takes 5 minutes! https:// my2020census.gov Quote Tweet VT Dept of Health @healthvermont There's still time to fill out your census! About half of all Vermonters have responded so far. If we don't fill out the census #VT will lose federal funds needed for infrastructure, school lunches, hospitals and more. Call 844-330-2020 or go to the Census website. #Census2020", "2020-06-26T15:32:36.000Z": "Vermont's 7-day positivity rate of COVID-19 tests sits at 1.28% - among the lowest in the nation. \n\nThere are also zero COVID-19 patients in ICUs in the entire state of Vermont. \n\nThis is good news, but we must remain vigilant and continue following @healthvermont guidelines.", "2020-06-27T01:56:35.000Z": "Stay safe, stay healthy, stay united!! Quote Tweet Channel 3 News @wcax #Vt mask spreads message of unity in face of pandemic. @WCAX_Darren explains https:// wcax.com/content/news/V ermont-mask-spreads-message-of-unity-in-the-face-of-pandemic-571508901.html ", "2020-06-26T01:25:47.000Z": "It was great to help introduce tonight's concert in support of this effort to help Vermonters in need - while supporting our farmers and local food systems. \n\nYou can watch talented artists like Dave Matthews, Grace Potter and many more live right now at http:// hugyourfarmer.com Quote Tweet dave matthews band @davematthewsbnd Dave Matthews will perform on Thursday, June 25th at 9PM ET at a @hugyourfarmer music benefit livestream to support local food systems and provide nourishing meals for those in need: http:// hugyourfarmer.com . 100% of donations received will go directly to Shift Meals.", "2020-06-25T23:56:20.000Z": "Tonight is the night. Amazing line up for tonight's virtual concert. Hug. Your. Farmer. @GovPhilScott with a cameo. MORE", "2020-06-25T13:15:24.000Z": "#HealthEquity exists when all people have a fair and just opportunity to be healthy. Health disparities can result from historical and current unequal distribution of social, political, economic, and environmental resources. http:// ow.ly/jVA150Ah7c2  http:// ow.ly/ReZ550Ah7c1  #VT", "2020-06-25T21:15:12.000Z": "Scientists from around the world are working on a #COVID -19 vaccine. Learn more about the research being done to develop an effective vaccine that will someday protect all of us from this virus. http:// ow.ly/MlZo50Ai2wO  #Vermont  #VermontStrong  #VT", "2020-06-25T16:08:30.000Z": "I know some are tired of hearing us repeat this, but we're still fighting a pandemic and we must continue taking precautions to slow the spread. Vermonters are good by nature and doing these simple things don't just protect you - they keep others safe. https:// healthvermont.gov/response/coronavirus-covid-19/about-coronavirus-disease-covid-19#prevention ", "2020-06-24T19:27:52.000Z": "Wearing a mask to protect others shows strength, not weakness. \n\nPlease continue to follow guidance from @healthvermont to help slow the spread. We're still fighting this pandemic, and it takes all of us working together and caring for one another. Quote Tweet VT Dept of Health @healthvermont Don't let up on #COVID19 prevention. We must continue to follow four rules of thumb: stay home if you're sick, wash your hands like crazy, physically distance from others, and wear face coverings if you can. #VT  http:// healthvermont.gov/covid-19", "2020-06-24T14:36:18.000Z": "https:// my2020census.gov Quote Tweet Governor Phil Scott @GovPhilScott The Census helps determine how much federal funding states receive for infrastructure projects, school lunch programs, disaster relief & so much more. VT currently has one of the lowest response rates in the US. If you haven't responded, please do so ASAP. It only takes 10 min!", "2020-06-24T14:29:56.000Z": "The Census helps determine how much federal funding states receive for infrastructure projects, school lunch programs, disaster relief & so much more. VT currently has one of the lowest response rates in the US. If you haven't responded, please do so ASAP. It only takes 10 min!", "2020-06-23T17:53:03.000Z": "Effective July 1, we'll be increasing the maximum weekly benefit amount for Unemployment Insurance claimants, while cutting UI tax rates for employers. We will continue to pull every lever we can to help workers and employers recover from this pandemic. https:// governor.vermont.gov/press-release/governor-phil-scott-announces-unemployment-insurance-tax-relief-vermont-employers ", "2020-06-23T17:13:20.000Z": "Are you planning to return to Vermont or visit from another state? If so, please make sure to visit the @healthvermont website for up-to-date travel guidance and to see if you need to quarantine when you arrive. Returning to Vermont youtube.com", "2020-06-23T13:35:55.000Z": "Just because the weather is warmer doesn't mean the pandemic is over. We must remain vigilant. It's just as important now as ever to continue regularly washing your hands, physically distance and wear a mask. We must continue to be smart and stay safe. Quote Tweet VT Dept of Health @healthvermont Because Vermonters changed their behavior & quarantined for the past few months, many businesses are re-opening & people are reconnecting. It's hard, but we still need to practice physical distancing, wear face covering & wash hands frequently http:// ow.ly/O2sT50AeOVm  #COVID -19VT", "2020-06-19T19:38:09.000Z": "Our data continues to show Vermont trending in the right direction. In fact, as of today we had the lowest percent-positivity rate in the USA - fewer than 1% of COVID-19 tests were positive this week. We'll continue to take a safe and methodical approach. https:// dfr.vermont.gov/sites/finreg/files/doc_library/dfr-covid19-modeling-061920.pdf ", "2020-06-19T14:15:11.000Z": "Today I proclaimed #JuneteenthDay in VT. We must do more as a nation - in our communities, in our schools and in our homes - to teach the significance of Juneteenth and recommit to the work of finally achieving equal rights, equal opportunity and equal justice for all Americans.", "2020-06-18T15:04:28.000Z": "Vermont's expanded testing and enhanced contact tracing efforts are critical to our methodical reopening process. It means, as we discover cases, our great team at @healthvermont can work to box them in, so we don't have to take the same mitigation measures we had to early on. Quote Tweet Mitch Wertlieb @mwertlieb #VT is one of just 8 states currently meeting the per capita estimated need for adequate contact tracing for #COVID19 . Check the status of your state here: https:// npr.org/sections/healt h-shots/2020/06/18/879787448/as-states-reopen-do-they-have-the-workforce-they-need-to-stop-coronavirus-outbre ", "2020-06-18T12:28:45.000Z": "Reminder: Tomorrow marks three months since Vermont's first confirmed fatality from COVID-19. In honor of the Vermonters we have lost to this terrible disease, I have ordered the U.S. and Vermont State flags to fly at half-staff on the 19th of every month for the rest of 2020.", "2020-06-17T20:04:54.000Z": "While we are easing restrictions for our older Vermonters, we encourage this group and all Vermonters to continue to 'be smart and stay safe.' 5/5 https:// governor.vermont.gov/press-release/governor-phil-scott-announces-easing-restrictions-older-and-vulnerable-vermonters ", "2020-06-17T20:04:53.000Z": "Today I announced measures to gradually ease restrictions on Vermonters in long-term care facilities, hospitals and those over the age of 65. 1/5 https:// governor.vermont.gov/press-release/governor-phil-scott-announces-easing-restrictions-older-and-vulnerable-vermonters ", "2020-06-17T13:48:54.000Z": "To save hundreds of jobs and small businesses, my economic relief proposal includes $195 million in Restart VT Emergency Action Grants, using funds we received from the Federal CARES Act. This is why Congress gave states this money. We must act fast to save jobs and livelihoods.", "2020-06-17T01:36:55.000Z": "My $50 million proposal to support dairy farmers and cheesemakers will help save family farms, the jobs they support, and preserve local food systems. \n\nVermont's award-winning dairy farmers are known around the world. They're  part of our state's DNA. We must act fast to help. Quote Tweet Anson Tebbetts @anson_ag Our rural areas need our support. @GovPhilScott has proposed a $50 million dollar stimulus package for dairy farmers & cheesemakers because of COVID-19. We hope the legislature will endorse this proposal so #Vt can save family farms and those who make a living off the land. twitter.com/VTAgencyofAg/s", "2020-06-17T00:41:27.000Z": "Critical that legislature pass the @GovPhilScott $50 million dollar package to help dairy. @GraftonCheese is legacy cheesemaker & needs our support along with dozens of others that are facing same challenges. Now is the time. Quote Tweet VTDigger @vtdigger Facing high costs, lower demand, Grafton Village Cheese Company considers consolidation https:// vtdigger.org/2020/06/16/fac ing-high-costs-lower-demand-grafton-village-cheese-considers-consolidation/ ", "2020-06-16T18:03:51.000Z": "Here's a helpful video from @healthvermont about what you can expect when you get a test: From VT Dept of Health Quote Tweet VT Dept of Health @healthvermont To date, there have been no lab-confirmed cases of #COVID19 associated with having attended any of the recent public protests. We encourage anyone who is participating in a public action to get tested for COVID-19: http:// humanresources.vermont.gov/popups  #VT", "2020-06-16T13:10:06.000Z": "As a result of the pandemic, many Vermonters are struggling to pay their mortgages. Phase II of my Economic Recovery Package would include 3 months of emergency mortgage assistance to low & moderate income Vermonters to help prevent foreclosures and keep families in their homes.", "2020-06-15T13:41:40.000Z": "With more Vermonters working remotely and kids learning from home, the need to expand access to broadband is even more critical. That's why my Economic Recovery Package includes major investments to expand connectivity and bridge the affordability gap. https:// accd.vermont.gov/sites/accdnew/ files/documents/Vermont%20Economic%20Recovery%20Package%20-%20Phase%20II%20-%202020-06-12.pdf ", "2020-06-14T15:14:42.000Z": "I've directed the Vermont State Police and the Department of Buildings and General Services to assist the Montpelier Police Department in the investigation. 3/3", "2020-06-14T15:14:41.000Z": "Early this morning, in an effort to fuel hate and division, the Black Lives Matter painting in front of the State House was vandalized. This painting serves as an important reminder to make equity a priority and use this movement to drive real action and long overdue change. 1/3", "2020-06-13T12:00:17.000Z": "Any Vermonter who wants a COVID-19 test can get a test. It's free and easy. Here's a video from our great team at @healthvermont about what you can expect if you get one. \n\nYou can learn more and  sign up here: https:// humanresources.vermont.gov/popups", "2020-06-12T19:08:20.000Z": "Regulatory Modernization: Enhance economic recovery by modernizing VT's regulatory programs and permitting tools. These investments will accelerate the transition of program administration from paper-based to web-based and changes to support more efficient permit processing. 5/5", "2020-06-12T19:08:19.000Z": "Broadband Expansion: Broadband program to connect the last mile, bridge the affordability gap, and streamline the processing licensing applications to ensure that families and businesses have continue access necessary to adapt to this new way of life. ($20 million) #vtpoli", "2020-06-12T19:08:18.000Z": "Phase II of my proposal includes the following investments, using Federal CARES Act money that Congress and the President approved for states to use for these purposes:", "2020-06-12T18:22:26.000Z": "Today, my team and I presented the second phase of my $400 million Economic Relief & Recovery proposal, including substantial investments in broadband. This money will be critical, not only to provide relief, but help us build a better foundation to thrive in the future. #vtpoli Quote Tweet Vermont Agency of Commerce & Community Development @VTEconDev The @GovPhilScott Administration announced Phase 2 of the $400 million dollar economic relief and recovery package today, intended to provide financial resources to help Vermonters and Vermont businesses thrive. Full details: https:// accd.vermont.gov/covid-19/vermont-economic-recovery-and-relief-package ", "2020-06-12T16:18:48.000Z": "That's why -- three weeks ago -- I proposed phase one of a $400 million-dollar package using Federal CARES Act money, to address the immediate cash needs of businesses. https:// governor.vermont.gov/press-release/governor-phil-scott-announces-first-economic-relief-and-recovery-package ", "2020-06-12T16:18:47.000Z": "At the start of this pandemic, we needed to act fast to protect the health and safety of Vermonters. \n\nVermonters responded, and as a result, hundreds of lives have been saved. But, COVID-19 also created an economic crisis. We must act with the same sense of urgency to help. 1/6", "2020-06-12T00:47:53.000Z": "I support the City's move to paint the Black Lives Matter message on State Street because I think it will be a necessary reminder that we must make equity a priority and use this movement to drive real action that will benefit all of Vermont. Quote Tweet VTDigger @vtdigger Montpelier plans to paint \"Black Lives Matter\" on State Street https:// vtdigger.org/2020/06/11/mon tpelier-plans-to-paint-black-lives-matter-on-state-street/ ", "2020-06-11T18:13:36.000Z": "We should take this time to reflect on what role each of us can play to end hate, racism and bigotry.  \n\nAnd for those of us who are white, who aren't typically the victim of it, we need to take a very close look because the reality is, it's everywhere, even here.\n8/10", "2020-06-11T18:13:35.000Z": "- Create and adopt a statewide use-of-force policy\n\n- Modernize training of law enforcement personnel\n\n- Implement one or more means of providing community oversight of police\n\n4/10", "2020-06-11T18:13:34.000Z": "I've been inspired by peaceful #BlackLivesMatter protests we've seen across the country and in Vermont, crying out for long overdue change. It's not enough to simply NOT be racist, we must be ANTI-racist and work to address systemic injustices in all aspects of our society. \n1/10", "2020-06-11T16:18:28.000Z": "Vermont Schools are planning to open in August, and precautions will be in place to keep children, teachers, and school staff safe. @VTEducation  #Vermont  #Fall2020 Quote Tweet Governor Phil Scott @GovPhilScott We've been hearing from a lot of Vermonters wondering what schools will look like this fall, so I wanted to provide an update at my briefing today. \n\nAs we've said in the past, we fully expect schools to open and we're working on guidance to make sure we can do so safely. 1/8 Show this thread", "2020-06-10T17:54:38.000Z": "We have a lot of work to do to build a more equitable Vermont and nation. We as a state, and we as individuals, all have a role to play. It is not enough anymore to just say we are not racist. We must be ANTI-racist, and take action as a nation that is long overdue.", "2020-06-10T15:33:06.000Z": "Thank you, @McClureVtFdn , for your commitment to our state and to the #Classof2020 Quote Tweet McClure Foundation @McClureVtFdn Congratulations, #VTED high school #Classof2020 ! We want to celebrate you. We're gifting every graduate in your class one free course of your choosing at @CCV_VT this fall. We want it to be easy for you to continue learning and exploring your interests. https:// bit.ly/3ffd4MP", "2020-06-10T15:17:55.000Z": ". @VTEducation and @HealthVermont will be issuing this guidance jointly next week. We anticipate some legislative changes will be needed, including to the school calendar, attendance policies and others -- and we know some funding may be required to help make this work. 7/8", "2020-06-10T15:17:54.000Z": "That said, for students and teachers alike, it's going to look a little different in the fall than it did before COVID-19. But we need to work through these issues together, because we know how vital it is for our kids and their development to move forward and reopen. 3/8", "2020-06-10T15:17:53.000Z": "We've been hearing from a lot of Vermonters wondering what schools will look like this fall, so I wanted to provide an update at my briefing today. \n\nAs we've said in the past, we fully expect schools to open and we're working on guidance to make sure we can do so safely. 1/8", "2020-06-09T18:31:57.000Z": "As a result of their hard work and preparation, our @healthvermont epidemiology team has the capacity to trace up to 900 new cases per week.  3/5 Resources Looking for guidance about isolation or quarantine? Need poster reminders about hand-washing? Find many COVID-19 resources here. healthvermont.gov", "2020-06-09T18:31:56.000Z": "We've significantly increased our testing capacity over the past several weeks, including for anyone without symptoms who'd like a test.\n\nAs a result, we'll find cases, especially asymptomatic ones, that might not have been identified just weeks ago. 1/5 https:// healthvermont.gov/response/coronavirus-covid-19/resources  Quote Tweet VT Dept of Health @healthvermont Free #COVID -19 testing this week in Burlington and Winooski! People who don't have symptoms can register in advance or walk up to the testing site in #BTV @ ONE Community Center or #Winooski @ the O'Brien Community Center. http:// ow.ly/ihMX50A2giV . #Vermont", "2020-06-09T14:20:08.000Z": "Last week I signed an Executive Order creating a Racial Equity Task Force. Those interested in serving as a public member can submit an application until this Friday, June 12. \n\nMore information and the application can be found at the link below. https:// governor.vermont.gov/press-release/governor-phil-scott-opens-application-public-member-appointment-racial-equity-task ", "2020-06-08T18:34:24.000Z": "A full list of the health and safety guidelines can be found at the link below. 11/11 https:// accd.vermont.gov/news/update-ne w-work-safe-additions-be-smart-stay-safe-order ", "2020-06-08T18:34:23.000Z": "Teams will need to work to keep 6 feet between players, coaches and spectators whenever possible, and facial coverings are encouraged when participants are close together between play. There are also strict hygiene and equipment cleaning requirements. 9/11", "2020-06-08T18:34:22.000Z": "Crowd sizes should be kept as small as possible, and can't exceed the gathering size limit of 25, either.  6/11", "2020-06-08T18:34:21.000Z": "To be clear: these guidelines are meant for rec. sports, not for professional or college-level leagues and teams. Activities will not include more than 25 to meet our gathering size limit. This includes players, coaches and officials. 5/11", "2020-06-08T18:34:20.000Z": "Kids have been cooped up and away from friends for months. Knowing the benefits to our mental and physical health, we've been working on guidance for certain recreational activities, that keep kids and adults safe, while reducing the risk of spread. 3/11", "2020-06-08T18:34:19.000Z": "For those who could't tune in to my briefing today, I wanted to start by recognizing the protests over the weekend and commend the participants for standing up for racial justice, as well keeping public health in mind by taking steps like wearing masks. 1/11", "2020-06-06T12:42:02.000Z": "I will always be grateful he made it back. But, we must all honor and remember the thousands of brave American and Allied Forces who lost their lives on those beaches. \n\nTheir actions and heroism literally saved the world, and we must never forget them. \n3/3", "2020-06-06T12:42:01.000Z": "He lost both his legs and spent two years recovering at Walter Reed before returning home to Vermont and starting our family. 2/3", "2020-06-06T12:41:59.000Z": "My father was part of the #DDay invasion, 76 years ago today. He was a truck driver by trade, so naturally he became tank operator in the Army. Shortly after the invasion, his tank hit a land mine while liberating a village in France.  1/3", "2020-06-05T17:27:40.000Z": "The fact is, outbreaks are going to continue, but that's exactly why we've built up our capacity to box them in, so we can restart our economy, while also keeping people safe. 6/7", "2020-06-05T17:27:39.000Z": "As many of you have already heard, we're now considering the situation in Winooski an \"outbreak\" with a few dozen cases of COVID-19 over the last week. Our epidemiology team has been on top of this situation, using our enhanced tracing and testing to keep this contained. 1/7", "2020-06-04T18:56:42.000Z": "Today @VTAttorneyGen and I issued a statement on VT's peaceful protests. Protests have been an important part of our democracy, driving needed change. This is a critical moment in our history, and it is our responsibility, as public servants, to listen. https:// governor.vermont.gov/press-release/governor-scott-and-attorney-general-donovan-come-together-issue-statements-vermont%E2%80%99s ", "2020-06-03T15:22:15.000Z": "This pandemic has forced all of us in state government to be nimble and move quickly in many areas to protect public health. It's also created an economic crisis that requires an equal sense of urgency. We must act quickly on my Economic Relief Package. https:// governor.vermont.gov/press-release/governor-phil-scott-announces-first-economic-relief-and-recovery-package ", "2020-06-02T14:36:17.000Z": "I've signed an Order establishing a Racial Equity Task Force as part of a broader state effort to promote equity. The fact is, hate, ignorance and the inequality we see is a far greater risk to the long term health of our nation than even COVID-19. https:// governor.vermont.gov/press-release/governor-phil-scott-establishes-racial-equity-task-force ", "2020-06-01T15:12:04.000Z": "THREAD: I wanted to start my briefing today by addressing the tragic death of George Floyd in Minnesota, the reactions, and justifiable outrage it's sparked across the nation. 1/20", "2020-06-01T15:12:12.000Z": "The good news is, we can fix this without waiting for a vaccine, or other solutions out of our control -- it just takes us uniting, to make this a better country for everyone, because like the coronavirus, this is literally in our hands. 20/20", "2020-06-01T15:12:11.000Z": "It will review current state and federal law on hate speech and contemplate ways to encourage Vermonters from a range of racial and ethnic groups to run and serve in public office, at all levels. 17/20", "2020-06-01T15:12:10.000Z": "We must also remember we're not immune to this in Vermont, which is why we've been working on a Racial Equity Task Force in recent months, and it will be launched today. 15/20", "2020-06-01T15:12:09.000Z": "I know many Vermonters are seeking to have their voices heard as well and I respect those who are doing so. My only ask is you do so peacefully and safely, especially considering the public health crisis we're facing. But I assure you, we're listening. 12/20", "2020-06-01T15:12:08.000Z": "For those who see the national protests and feel disdain, instead of sympathy, just know, the reactions we're seeing in cities around the country are the result of decades -- actually centuries -- of calls for help that went unheard. 9/20", "2020-06-01T15:12:07.000Z": "In the greatest country in the world, no one should stand for this, no one should make excuses for this, and no one should ignore this. We must ALL make clear: enough is enough. 7/20", "2020-06-01T15:12:06.000Z": "My heart goes out to his family and the Minneapolis community, which is suffering deeply right now. Further, my heart goes out to all people of color across the nation, who, even if they live in different cities, carry this trauma every time something like this happens. 4/20", "2020-06-01T15:12:05.000Z": "Mr. Floyd's death is a heartbreaking tragedy and a painful reminder that if you believe, as do I, that everyone is created equal in the eyes of God and according to the founding principles of our nation, we have much more work to do, to be a better country and better people. 3/20", "2020-06-01T13:46:34.000Z": "@GovPhilScott & members of the administration hold a media briefing today (Monday, June 1) at 11:00 am to update on the #VT response to #COVID19 . Most #Vermont TV & radio stations broadcast the briefings or stream here: http:// ow.ly/Wbko50zVxlC  #BeSmartStaySafe", "2020-05-31T19:45:06.000Z": "Why do you wear a mask? http:// ow.ly/Bcfo50zURMB  #BeSmartStaySafe  #VT  #VermontStrong", "2020-05-29T21:56:58.000Z": "Mr. Floyd's death is a heartbreaking tragedy. My heart goes out to his family and the Minneapolis community, which is suffering greatly right now. I hope to see justice served and that we can move toward healing as a nation. Quote Tweet Vermont State Police @VTStatePolice Members of Vermont State Police, joined by @GovPhilScott & Public Safety Commissioner Michael Schirling, unequivocally condemn actions of police officers in Minneapolis that led to the death of #GeorgeFloyd . Full statement: https:// bit.ly/2AkCSbu  #btv  #vt  #vtpoli Show this thread", "2020-05-29T20:42:50.000Z": "The good news is, we're beginning to see positive trends among our neighbors, as well. So, we'll continue closely monitor the data as we consider easing travel restrictions in the future. 6/X", "2020-05-29T20:42:49.000Z": "As you know, we've also had a lot of questions about when we'll be able to welcome out of state visitors without a quarantine requirement. This continues to be a challenge and it's why we need to focus on the regional data, as well.  4/7 https:// dfr.vermont.gov/sites/finreg/files/doc_library/dfr-covid19-modeling-0502920.pdf ", "2020-05-29T20:42:48.000Z": "As our modeling continues to show a low number of COVID-19 cases in Vermont, and with recommendations from @healthvermont , today we announced it's safe to turn the economic spigot a bit more. 1/7 https:// governor.vermont.gov/press-release/governor-phil-scott-announces-opening-additional-business-operations-increased-social ", "2020-05-28T17:45:29.000Z": "Today @VermontDFR and I announced the approval of a premium relief plan submitted by Northeast Delta Dental. In total, $2.89 million in premium relief will be provided to approximately 70,000 Vermonters.\n\nYou can read more here: https:// governor.vermont.gov/press-release/dfr-approves-plan-provide-nearly-3-million-dental-insurance-premium-relief ", "2020-05-27T11:49:31.000Z": "The @GovPhilScott administration included $50 million in housing assistance as part of the proposed $400 million Covid-19 economic relief and recovery package. https:// accd.vermont.gov/covid-19/vermont-economic-recovery-and-relief-package ", "2020-05-26T13:30:38.000Z": ". @VTEconDev is hosting a series of webinars to help explain my $400 million Economic Recovery and Relief Package and how it will help save jobs and support sectors that have been hit hard by this pandemic.   \n\nYou can learn more here: https:// accd.vermont.gov/covid-19/vermont-economic-recovery-and-relief-package#webinars ", "2020-05-26T00:35:01.000Z": "Today on #MemorialDay I visited my father and two uncles, who served in World War II, as well as my cousin, who served in Vietnam. They are resting peacefully in Washington, Vermont. They each put their lives on the line to protect our way of life and to preserve our freedom.", "2020-05-25T13:56:54.000Z": "On Memorial Day, we honor those who gave their lives in defense of our people, our values and our nation. Those who stood to fight so the rest of us can live in the safety of a free world. Those who sacrificed and died so others may live. We must always remember their sacrifice.", "2020-05-23T13:59:15.000Z": "Small businesses and their employees drive our economy. We must step up and act quickly to help them survive this emergency and go on to thrive in the future.  \n\nThat's why I've proposed a $400 million Economic Relief and Recovery Package. \n\nRead more  https:// governor.vermont.gov/press-release/governor-phil-scott-announces-first-economic-relief-and-recovery-package ", "2020-05-22T19:54:35.000Z": "As more Vermonters get back to work and there are more places to visit and meet with others, it is more important than ever to stay vigilant about your health and the health of others. 7/7 https:// governor.vermont.gov/press-release/governor-phil-scott-announces-limited-reopening-restaurants-hair-salons-additional ", "2020-05-22T19:54:34.000Z": "Effective today, May 22, restaurants and bars may reopen for limited outdoor seating. Other health and safety  protocols can be found by clicking below. 3/7 https:// accd.vermont.gov/news/update-ne w-work-safe-additions-be-smart-stay-safe-order ", "2020-05-22T19:54:33.000Z": "As our data continues to trend in the right direction, today I announced the resumption of additional business operations, including outdoor seating at restaurants and bars, hair salons and barber shops and additional health services. 2/7 https:// governor.vermont.gov/press-release/governor-phil-scott-announces-limited-reopening-restaurants-hair-salons-additional ", "2020-05-22T18:56:28.000Z": "As we methodically reopen our economy, Vermont continues to have one of the lowest COVID-19 growth rates in the U.S., and it's still slowing. \n\nWe must stay vigilant, but our data-driven approach is working as Vermonters continue to do the right thing. https:// dfr.vermont.gov/about-us/covid -19/modeling ", "2020-05-21T16:13:27.000Z": "Here is a more detailed map with approximate times and locations of the route. #InThisTogether  #AmericaStrong  #AirForceSalutes", "2020-05-21T15:52:25.000Z": "Dairy is part of our DNA. Our farmers are known around the world for their products. They produce the food we need to feed our families. Like many sectors, they've been hit hard by this crisis. That's why my Economic Recovery proposal dedicates $50M to help them get through this.", "2020-05-21T15:33:00.000Z": "Join us TODAY AT 3 PM for a webinar to explain the Economic Recovery & Relief Package and how it will support various sectors throughout the Vermont economy. Links & call-in info here: https:// accd.vermont.gov/covid-19/vermont-economic-recovery-and-relief-package  .", "2020-05-21T13:11:24.000Z": "As part of Operation America Strong, a @USAirforce effort to salute healthcare workers across the country, the @158FighterWing will honor Vermont's front line COVID-19 responders and essential workers with a flyover on Friday, May 22, 2020. #AirForceSalutes  #AmericaStrong", "2020-05-20T18:33:44.000Z": "We will get through this, by staying united as Vermonters.\n\nTo read more about my proposal, please click the link below. 13/13 https:// governor.vermont.gov/press-release/governor-phil-scott-announces-first-economic-relief-and-recovery-package ", "2020-05-20T18:33:43.000Z": "", "2020-05-20T18:33:42.000Z": "", "2020-05-20T18:33:41.000Z": "These businesses and their employees drive our economy, put food on the tables of Vermonters and help fund critical needs for families, public schools and so much more. We must step up and act quickly to help them survive and thrive into the future. 4/13", "2020-05-20T18:33:40.000Z": "Today, I proposed a major $400 million economic relief and recovery package, using funds the state received from the CARES Act. This package takes bold action to bring support to Vermonters in need, as we continue to manage this public health crisis and reopen the economy. 1/13", "2020-05-20T14:26:15.000Z": "At 11:00 AM, I will propose a major $400 million economic relief and recovery package. The package takes bold action to bring support to Vermonters in need, as we continue to manage this public health crisis and reopen the economy. #vtpoli Watch live: https:// youtube.com/playlist?list= PL-xsDpLCa0iRMj4dQrqum7uoXaQmqeGvT ", "2020-05-18T17:48:24.000Z": "Reminder: Tomorrow marks two months since Vermont's first fatality as a result of COVID-19. In honor of the Vermonters we have lost to this terrible disease, I have ordered the U.S. and Vermont State flags to fly at half-staff on the 19th of every month for the remainder of 2020.", "2020-05-18T15:09:31.000Z": "I know this has been difficult for everyone, and in some ways the restart process is even more trying than the closings were. But your sacrifices have made a huge difference. My team is committed to helping businesses and families recover from this once-in-a-century crisis. 5/6", "2020-05-18T15:09:30.000Z": "Over the last month, with strict health and safety protections, we've opened retail, outdoor services, recreation, manufacturing and construction, as well as campgrounds and lodging at 25% capacity. Vermonters can also safely visit with small groups of family and friends. 2/6", "2020-05-18T15:09:29.000Z": "Thanks to the work of Vermonters, and even as we've slowly restarted the economy over the last 4 weeks, we're still moving in the right direction. The data shows we can continue to methodically put more back to work, while easing some restrictions. 1/6 https:// dfr.vermont.gov/sites/finreg/files/doc_library/dfr-covid19-modeling-0501520.pdf ", "2020-05-18T13:29:31.000Z": "@GovPhilScott and members of the administration hold a media briefing today (Monday, May 18) at 11:00am to provide an update on the State's continued response to #COVID19 . Most #VT TV and radio stations live broadcast the briefings. http:// ow.ly/7and50zrndu", "2020-05-16T16:55:12.000Z": "We're so proud of our nursing students Check out the @uvmcnhs virtual pinning ceremony below, and jump to minute 42 for remarks from @SVGarimella , @UVMPattyPrelock , @GovPhilScott , @SenatorLeahy , and many other special guests. Quote Tweet UVM Nursing & Health @uvmcnhs The Department of Nursing is pleased to present the Class of 2020 Professional Nursing virtual pinning ceremony! Watch with us: https:// youtu.be/AdIVLcuD0TE  #uvmgrad  #uvm2020", "2020-05-16T21:21:12.000Z": "Vermont has the lowest COVID-19 growth rate in the country, thanks to the efforts of Vermonters. As we methodically reopen our economy, it's important we remain vigilant and continue to follow @healthvermont and CDC guidelines. Quote Tweet Mike Pieciak @MikePieciak Today w/ @GovPhilScott we announced #vermont has the lowest 3-day #COVID19 growth rate in the country & our cases are not expected to double again for 40+ weeks. We are one of the very few states in a position to reopen safely all due to VTers sacrifices & efforts - great job!", "2020-05-15T20:17:42.000Z": "Vermont is grateful for the efforts of @SenatorLeahy , @SenSanders and Congressman @PeterWelch to secure this critical funding to support our testing and tracing program. As we methodically restart Vermont's economy, enhanced testing and tracing is key. Quote Tweet Sen. Patrick Leahy @SenatorLeahy Leahy, @SenSanders , @PeterWelch And @GovPhilScott : Vermont To Receive $55 Million For COVID-19 Testing Efforts https:// leahy.senate.gov/press/leahy-sa nders-welch-and-scott-vermont-to-receive-55-million-for-covid-19-testing-efforts ", "2020-05-15T19:23:08.000Z": "If the data continues in the right direction, we'll continue to slowly turn the economic spigot. In the weeks ahead, you can expect us to address close contact businesses like hair salons, indoor professional services and steps for restaurants to open with outdoor dining. 5/5", "2020-05-15T19:23:07.000Z": "The important thing to remember is that the smarter we are about our individual actions, and the more disciplined everyone can be during each step forward, the more steps we'll be able to take to safely restart Vermont. 3/5", "2020-05-15T19:23:06.000Z": "So, today I signed a Be Smart/Stay Safe order to extend the State of Emergency to June 15 and update previous emergency orders to reflect the re-openings and eased restrictions I've announced in recent weeks. 2/5 https:// governor.vermont.gov/sites/scott/fi les/documents/ADDENDUM%2014%20TO%20EXECUTIVE%20ORDER%2001-20.pdf ", "2020-05-15T19:23:05.000Z": "Vermonters have stepped up in a time of crisis, following guidance from the beginning to quickly slow the spread. These efforts have saved hundreds of lives and given us time to build the testing & tracing capacity we need to contain future outbreaks. 1/5 https:// governor.vermont.gov/press-release/governor-phil-scott-extends-state-emergency-data-driven-restart-continues ", "2020-05-14T18:22:26.000Z": "Today, I signed into law S.333, which codifies the current status of suspending pending and new eviction and foreclosure actions for the duration of the emergency period. Thank you to the Legislature and others for you work. https:// legislature.vermont.gov/bill/status/20 20/S.333 ", "2020-05-13T15:09:22.000Z": "We're all in this together, and human decency will help get us through this challenging time. Let's remember, our common enemy is the virus, not each other. And we should use every ounce of energy to defeat it.  7/7", "2020-05-13T15:09:21.000Z": "Making this situation in Hartford even more disturbing was the racial undertone used during the exchange with the individual, who is a person of color. So, let me be very clear: This IS NOT acceptable and can't be tolerated. There is NO excuse for it. 5/7", "2020-05-13T15:09:20.000Z": "I learned of a family in Hartford - who had New York plates on their car, even though they became Vermonters a few months ago - who were pulling out of their driveway when, among other things, were told they weren't welcome here. 2/7", "2020-05-13T15:09:19.000Z": "THREAD: We know we can't let our guard down while fighting this virus, but we also can't ease up on our commitment to civility and unity, either. I bring this up because on Monday, I was made aware of a disturbing incident that happened here in Vermont. 1/7", "2020-05-10T14:21:30.000Z": "My mom has been an inspiration my entire life. I wouldn't be the person I am today without her love and support. I want to wish her, Diana and all moms across Vermont a very happy Mother's Day.", "2020-05-09T14:10:47.000Z": "I know snow on May 9th isn't a welcome sight for many Vermonters, just as we're cautiously allowing outdoor recreation to get going again - but this is just a snapshot in time. Just like better weather is ahead, better days will come, as well. We will get through this, together.", "2020-05-08T22:49:07.000Z": "This is a time when supporting each other and thinking creatively about how we serve are essential to restoring our economy and helping families in need. Quote Tweet Sen. Patrick Leahy @SenatorLeahy Leahy, @SenSanders , @PeterWelch and @GovPhilScott Announce Two Vermont Contracts For New Food Box Delivery Program https:// leahy.senate.gov/press/leahy-sa nders-welch-and-scott-announce-two-vermont-contracts-for-new-food-box-delivery-program ", "2020-05-08T20:06:06.000Z": "As we cautiously put more Vermonters back to work, access to child care is critical. As our models and data continue to point in the right direction, I am happy to announce child care programs can reopen by June 1 - if they can meet strict health and safety requirements. 1/2", "2020-05-08T11:17:45.000Z": "Replying to @GovPhilScott Wonderful job Sophia @Vermont_United .\n\nHere are some images of the masks you delivered.", "2020-05-07T20:30:22.000Z": "As we work to triple our testing, @healthvermont is  partnering with EMS units around the state to meet our goals. The Department is training these units to collect specimens, supplementing what Health teams are already doing. \n\nRead more about our plans: https:// governor.vermont.gov/press-release/governor-phil-scott-announces-enhanced-testing-and-contact-tracing-programs ", "2020-05-07T16:10:05.000Z": "Yesterday @GovPhilScott outlined new guidance that will allow Vermonters to safely connect with friends & family. Safe is staying home if sick, keeping 6 feet apart, wearing face covering, washing hands frequently. Details under Stay Home, Stay Safe: http:// ow.ly/varP50zzRxS  #VT GIF", "2020-05-07T15:06:13.000Z": "Thanks to a special delivery from 8 year old Sophia, yesterday my team wore these facial coverings at my press conference. Ver ont United is a grassroots effort designed to bring folks together, united in strength during this time of physical separation. https:// facebook.com/VermontLoveUni ted ", "2020-05-06T18:44:17.000Z": "We must remain vigilant so we don't lose ground as we continue, slowly and safely, reopening Vermont in a way that puts public health first. I will continue to make decisions cautiously, based on the science and data, and with advice from experts. 5/5 https:// governor.vermont.gov/press-release/governor-phil-scott-announces-re-opening-some-outdoor-recreation-and-limited-social ", "2020-05-06T18:44:16.000Z": "Outdoor recreation and outdoor fitness activities with low or no direct physical contact may begin tomorrow. These include but are not limited to state and municipal parks, recreation associations, trail networks, golf courses, big game check stations and guided expeditions. 3/5", "2020-05-06T18:44:15.000Z": "Today, with @healthvermont Commissioner Mark Levine, MD, I announced outdoor recreation and limited social interactions may resume under strict health and safety precautions, as state modeling continues to indicate a slow in the spread of COVID-19. 1/5 https:// governor.vermont.gov/press-release/governor-phil-scott-announces-re-opening-some-outdoor-recreation-and-limited-social ", "2020-05-06T16:55:05.000Z": "#NurseApprecationDay has special meaning this year. On behalf of all Vermonters, thank you to all nurses for your unwavering commitment to service and for keeping us safe through these unprecedented times. You truly are are heroes.", "2020-05-06T12:00:58.000Z": "@GovPhilScott and members of the administration hold a media briefing today (Wednesday, May 6) at 11:00am to provide an update on the State's continued response to #COVID19 . Most #VT TV and radio stations live broadcast the briefings. http:// ow.ly/7and50zrndu", "2020-05-05T15:19:05.000Z": "Thank you to all of Vermont's teachers for your flexibility and creative spirit during these unprecedented times. We're fortunate to have such dedicated public servants. #ThankATeacher Quote Tweet Vermont Agency of Education @VTEducation This Teacher Appreciation Day our team at @VTEducation was especially eager to recognize Vermont's amazing educators. We've compiled our messages of thanks on our website: https:// education.vermont.gov/news/teacher-a ppreciation-day-messages  So grateful for you all today and every day! #vted  #ThankATeacher", "2020-05-04T18:49:11.000Z": "Today I announced limited elective procedures can resume, which had previously been put on hold as we focused on preparing for, and responding to, COVID-19. While postponing these was necessary, we know they're important to Vermonters' overall health. https:// governor.vermont.gov/press-release/governor-phil-scott-announces-some-elective-health-care-procedures-resume ", "2020-05-02T21:52:07.000Z": "Wishing my good friend Congressman @PeterWelch a very happy birthday. It's your 29th, right? #throwback  #vtpoli", "2020-05-02T14:50:01.000Z": "Congratulations to the @uvmvermont class of 2020 nursing students who graduated early to join the workforce in our country's time of need. Thank you for your service and choosing this path. We're in good hands. #UVM2020 Quote Tweet University of Vermont @uvmvermont Today, the world gains 95 new nurses.\n\nJoin us in applauding the nursing students in UVM's Class of 2020, who chose to graduate early today to enter the workforce and support the front lines. #UVMProud | #UVMgrad  @uvmcnhs", "2020-05-01T21:49:20.000Z": "Green Up Day represents what's so great about Vermont. While it's been postponed and won't take place this weekend as usual, I ask Vermonters who may be out on a walk or hike to take a bag or two with them and help keep Vermont green, in honor of this tradition.", "2020-04-30T18:55:28.000Z": "We have a strong and effective testing and contact tracing program in Vermont, but as we work to keep Vermonters healthy, and slowly and safely restart our economy, doing even more is critical. With our expansion plan, we'll be able to triple the amount of tests we do per week.", "2020-04-30T14:27:31.000Z": "Today at 4:00 PM I'll be participating in a telephone town hall hosted by @AARPVT . I'll be joined by @SenatorLeahy , @SenSanders , Rep. @PeterWelch & @healthvermont commissioner, Dr. Mark Levine. You can listen in by calling 833-380-0683. I look forward to hearing from you. #vtpoli", "2020-04-29T21:38:59.000Z": "This expansion of testing and tracing will help make sure that as we slowly ease public health restrictions and put more people back to work, we're able to identify cases quickly and better contain the virus so we don't lose ground on our progress. (2/2) https:// governor.vermont.gov/press-release/governor-phil-scott-announces-enhanced-testing-and-contact-tracing-programs ", "2020-04-29T21:38:58.000Z": "Today @healthvermont and I announced Vermont is significantly increasing and strengthening our testing and contact tracing programs in order to quickly identify, contain and suppress outbreaks of COVID-19. (1/2) https:// governor.vermont.gov/press-release/governor-phil-scott-announces-enhanced-testing-and-contact-tracing-programs ", "2020-04-29T20:21:01.000Z": "Thank you @GovPhilScott for sending us this proclamation for @Israel 's 72nd Birthday. Thank you #Vermont for your friendship & support. \n\nThank you New England for celebrating with us.", "2020-04-27T18:57:38.000Z": "Vermont ranked 3rd in the nation for usage of the @SBAgov Paycheck Protection Program. Congress recently added over $300 billion to the program, but funds are issued on a first come, first served basis. Vermont businesses who can benefit should apply ASAP. https:// accd.vermont.gov/covid-19/busin ess ", "2020-04-23T14:27:58.000Z": "Later today I'll be joining @SenatorLeahy , @SenSanders & Rep. @PeterWelch for a telephone town hall to update Vermonters on our response to the coronavirus pandemic. You can join us at 5:00 PM at the link below. We look forward to hearing from you. #vtpoli  https:// leahy.senate.gov/telephone-town -hall ", "2020-04-22T22:52:46.000Z": "Vermont is now among the first states to launch the new Pandemic Unemployment Assistance program, allowing self-employed workers, independent contractors and others who aren't eligible for traditional unemployment insurance to receive benefits. Read more: https:// labor.vermont.gov/pua", "2020-04-22T18:13:02.000Z": "More good news from @VermontDFR : We just announced they have approved plans from more than forty auto insurance companies to return premiums or reduce their rates for Vermont policyholders. This means over $14.6 million in savings for Vermonters to date. https:// governor.vermont.gov/press-release/department-financial-regulation-approves-additional-plans-refund-auto-insurance ", "2020-04-22T13:31:19.000Z": "Moving forward, to call more attention to good deeds happening throughout Vermont, and the good people making them happen, I will be recognizing acts of kindness, selfless service and goodwill happening throughout our state. (2/3) https:// governor.vermont.gov/acts-of-kindne ss ", "2020-04-22T13:31:18.000Z": "As our state confronts this once-in-a-century challenge, sometimes it's the little things - those simple, random, everyday acts of kindness and goodwill - that can make all the difference.  (1/3) https:// governor.vermont.gov/acts-of-kindne ss ", "2020-04-21T20:13:18.000Z": "This virus knows no state borders. I am grateful to my fellow governors for their coordination and partnership as we work together to protect the health and safety of our people. Quote Tweet Governor Phil Scott @GovPhilScott I just got off the phone with my fellow New England governors, @GovNedLamont , @GovRaimondo , @MassGovernor , @GovChrisSununu and @GovJanetMills . \n\nEvery state is facing this challenge, and we're stronger when we work together. #vtpoli", "2020-04-21T19:18:26.000Z": "I just got off the phone with my fellow New England governors, @GovNedLamont , @GovRaimondo , @MassGovernor , @GovChrisSununu and @GovJanetMills . \n\nEvery state is facing this challenge, and we're stronger when we work together. #vtpoli", "2020-04-21T17:56:16.000Z": "Today I announced a joint initiative with the states of California, Colorado, Conn., Illinois, Mass., New Jersey, Virginia and Washington to secure student loan relief options for thousands of Vermonters with privately held student loans. \n\nMore info  https:// governor.vermont.gov/press-release/student-loan-relief-secured-borrowers-not-covered-federal-cares-act ", "2020-04-20T11:10:38.000Z": "This is still not enough but with the work of @VTLabor and @VermontADS to clear 32,000 issues over the last few days, these Vermonters can also start collecting their benefits. I'll have an update at my press conference at 11:00. 2/ 2", "2020-04-20T11:10:37.000Z": "After hard work yesterday from the Treasurer's office and the Finance Dept., I dropped off over 8,300 checks in the mail this AM. These are $1,200 for those whose UI issues couldn't be cleared by Saturday. Thank you to the BGS mail center and the USPS for all your hard work. 1/2", "2020-04-19T22:45:28.000Z": "I want to thank Treasurer Pearce, Dep. Treas. Clasen & their team for coming in on a Sunday to cut checks for those whose unemployment claim issues weren't resolved yet. @VTLabor cleared nearly 32,000 claim issues. I'll be dropping off about 8,300 checks in the mail tomorrow AM.", "2020-04-19T17:28:09.000Z": "\"There's a far better, more positive path forward - including for the communities that rely on state college campuses to sustain their local economies - if we are creative and committed to the hard work ahead.\"\n\nMy statement on the VT State College System: https:// governor.vermont.gov/press-release/statement-governor-phil-scott-future-vermont-state-college-system ", "2020-04-18T20:57:47.000Z": "The coronavirus has caused anxiety and stress for many Vermonters. Now more than ever we need to take care of our mental health and check in on our friends, family and neighbors.  Remember, professional help is available. You can text VT to 741741, or dial 211 to ask for support.", "2020-04-18T17:17:05.000Z": "Today the @USNavy commissioned USS Vermont. I want to congratulate all who helped make this happen & thank its entire crew as they honor VT with their service & maintain America's undersea superiority. In these uncertain times this is a proud day for VT. USS Vermont becomes latest Virginia-class fast-attack submarine in ser The U.S. Navy commissioned USS Vermont (SSN 792), the 19th Virginia-class attack submarine, today, April 18, 2020. defense.gov", "2020-04-18T13:03:58.000Z": "Thank you, @KillingtonMtn . This is what makes Vermont strong. Vermonters all across the state are stepping up to help each other out during this time of need. Quote Tweet Killington Resort @KillingtonMtn When we realized farmers were dumping milk because demand was low, we saw a need and wanted to fill it.\n\nSo we bought fresh groceries, including milk and cheese, to package up for the community. Details below. @VTFarmstead", "2020-04-17T20:43:06.000Z": "This Sunday, April 19 marks one month since Vermont's first fatality as a result of COVID-19. In honor of all the Vermonters we've lost to this terrible disease, I'm ordering the US and Vermont State flags to fly at half-staff on the 19th of every month for the remainder of 2020.", "2020-04-17T19:29:48.000Z": "Per Addendum 10 to @GovPhilScott 's Stay Home, Stay Safe Order, there is new guidance for the limited reopening of certain business sectors in strict accordance with mandatory health and safety requirements. Takes effect Monday, April 20th. Full guidance: https:// accd.vermont.gov/news/update-ne w-work-safe-additions-stay-home-stay-safe-order ", "2020-04-17T17:06:08.000Z": "I have instructed the Department of Labor to clear the backlog of eligible unemployment claims by tomorrow night. For any that are not cleared, I have authorized the state treasury to issue $1,200 checks to those who remain unpaid. #vtpoli", "2020-04-17T13:10:17.000Z": "@GovPhilScott & members of the administration will hold a media briefing Friday, April 17th at 11 am to provide an update on the State's continued response to #COVID -19. Most #VT radio & TV stations live broadcast the briefings. Or stream http:// ow.ly/bdxb50zgTUi  #AloneTogetherVt Press Conference LIVE youtube.com", "2020-04-16T21:58:29.000Z": "Broadband remains a critical resource for Vermonters in rural areas to stay connected and work and learn remotely during our Stay Home period. We're grateful to our partners at Microsoft, RTO Wireless and Up And Running I.T. for their assistance providing this important service. Quote Tweet Vermont Agency of Commerce & Community Development @VTEconDev Broadband is a critical resource for Vermonters during these times. @GovPhilScott has teamed up with @Microsoft , RTO Wireless and Up and Running IT to ensure that dozens of rural towns are connected via public Wi-Fi hotspots. https:// governor.vermont.gov/press-release/businesses-partnering-state-vermont-address-rural-broadband-gap ", "2020-04-15T18:36:11.000Z": "Today I announced an emergency regulation requiring commercial insurers to waive cost-sharing requirements, such as co-payments, coinsurance or deductible requirements, for the diagnosis and treatment of COVID-19. 1/2 https:// governor.vermont.gov/press-release/vermont-department-financial-regulation-requires-insurers-cover-covid-19-diagnosis-and ", "2020-04-15T13:00:55.000Z": "Today (April 15) at 11:00am, @GovPhilScott will highlight non-gov orgs supporting VT's COVID-19 response. @uvmvermont President Suresh Garimella & @burtonsnowboard Owner Donna Carpenter, will speak to efforts . Press Conference LIVE youtube.com", "2020-04-15T00:30:56.000Z": "Thank you, @cabotcheese ! It's because of acts of kindness like this - and all Vermonters stepping up and going the extra mile to help those in need - that I'm confident we will get through this, and emerge stronger than ever before. Quote Tweet Stewart Ledbetter @StewartMyNBC5 Hundreds of #vt care packages full of @cabotcheese shipping today to individual (& unsuspecting) #COVID19  #FirstResponders . \nNice!", "2020-04-14T21:26:52.000Z": "I want to thank these individuals for rolling up their sleeves and lending their vast expertise and skill to increase the capacity of our state response as we take on the significant challenge of restarting our economy in the weeks and months ahead. 2/2 https:// governor.vermont.gov/press-release/agency-commerce-and-community-development-establishes-economic-mitigation-recovery ", "2020-04-14T21:26:51.000Z": "Today I established an Economic Mitigation & Recovery Task Force charged with providing assistance & expertise to mitigate the devastating short-term economic impacts of the COVID-19 pandemic, and develop strategies designed to speed long-term business and community recovery. 1/2", "2020-04-13T21:01:19.000Z": "There comes a time in everyone's life when roles are reversed and your kids start taking care of you... I just didn't think it would be this soon! Love you Erica!", "2020-04-13T17:04:22.000Z": "Many Americans before us, like those who served in World War II, sacrificed for future generations. Now, it's our turn to sacrifice for our fellow Vermonters and keep up our social distancing efforts - which are saving many lives. It's important we don't let off the gas just yet.", "2020-04-13T13:31:03.000Z": "Good morning Vermont. @GovPhilScott will provide an update on the State's continued response to #COVID -19. Most #Vermont TV & radio stations live broadcast the briefings or stream through ORCA Media's youtube channel http:// ow.ly/Mkz550zcwD5  #stayhomestaysafe Press Conference LIVE youtube.com", "2020-04-13T10:55:54.000Z": "This morning at sunrise, on behalf of all legislators who served with him, and the friends and family who admired him, I lowered the Vermont State Flag to half-staff in memory of former Representative Bernie Juskiewicz. Vermont is strong because of citizen-servants like Bernie.", "2020-04-12T15:37:02.000Z": "I took this picture this morning in my backyard. They blossomed overnight. It reminded me that spring is coming, and there are better days ahead.", "2020-04-12T15:36:15.000Z": "Although this Easter is unlike any we've experienced, it is still important to reach out and connect with family and friends, even as we must be physically apart. To all Vermonters who are celebrating, Diana and I wish you a happy and healthy Easter. #vtpoli", "2020-04-11T15:29:16.000Z": "While most of us have been asked to stay home during this crisis, those who work in hospitals and clinics throughout the state are on the front lines, working harder than ever to fight this virus. \n\nOn behalf of all Vermonters, thank you to these health care heroes. #vtpoli", "2020-04-10T22:06:21.000Z": "Today I announced that the deadline for April vehicle inspections has been extended by 60 days. You can also now renew your license online for the first time through @VTDMV . \n\nYou can find more information at the link, below. https:// governor.vermont.gov/press-release/vermont-dmv-launches-online-license-renewals ", "2020-04-10T19:21:11.000Z": "This terrible virus becomes even more real when it affects someone we know. Wishing you well, Christine. I hope you feel better soon. - Phil Quote Tweet Christine Hallquist @christine4world I just got the call from the nurse. I was tested last Sunday for COVID-19. Today, I received confirmation that the test came back positive. I do have the virus. It has been a brutal week. I think I may be through the worst of it. This is my first day fever-free in a week. ￼￼", "2020-04-10T14:30:22.000Z": "Today, I'm extending VT's State of Emergency and all corresponding orders and directives until May 15. These are incredibly difficult times, and I know this extension is disappointing news for many. But the fact is, Vermonters are saving hundreds of lives by staying home. 1/3", "2020-04-09T23:12:30.000Z": "So proud of @VTNationalGuard for their work supporting VTers and being great partners to @vemvt during this response! Quote Tweet Governor Phil Scott @GovPhilScott Earlier this week I visited the @cv_expo in Essex Junction where the @VTNationalGuard has constructed a medical surge site in case hospitals exceed their capacity as a result of COVID-19. I want to once again thank the Guard for their hard work and dedication as Vermont prepares.", "2020-04-09T18:26:59.000Z": "Earlier this week I visited the @cv_expo in Essex Junction where the @VTNationalGuard has constructed a medical surge site in case hospitals exceed their capacity as a result of COVID-19. I want to once again thank the Guard for their hard work and dedication as Vermont prepares.", "2020-04-09T15:12:52.000Z": "I'll be joining @SenSanders , @SenatorLeahy and @PeterWelch for a telephone town hall on our efforts to combat COVID-19. You can join us by calling 1-888-480-3635.\n\nI continue to work closely with our congressional delegation to find ways to support Vermonters through this crisis.", "2020-04-09T12:11:02.000Z": "Bernie Juskiewicz served his constituents with distinction in the House of Representatives. \n\nAlthough this terrible new disease took him from us, the impact of his service will live on. \n\nI have ordered the Vermont State Flag to fly at half-staff this Monday in his honor.", "2020-04-08T23:55:43.000Z": "@GovPhilScott stopped by the Alternate Healthcare Facility at the Champlain Valley Exposition. This facility will treat low acuity patients and allow our hospitals to focus resources on higher levels of care, including #COVID19 . We are #InThisTogether", "2020-04-08T12:53:15.000Z": "Today at 11:00 a.m. I'll be holding another briefing with my team to provide an update on Vermont's ongoing response to COVID-19. You can watch live on most local TV news stations, stream online at the link below, or tune in on VPR. https:// youtube.com/playlist?list= PL-xsDpLCa0iRMj4dQrqum7uoXaQmqeGvT ", "2020-04-07T16:31:06.000Z": "We are encouraging other insurers to follow suit.  \"Every insurer should begin developing plans to make certain that Vermonters are not overpaying when it comes to their auto insurance.\" - @VermontDFR Commissioner @mspieciak (2/2)", "2020-04-07T16:13:03.000Z": "Today, @VermontDFR announced the approval of a plan submitted by Allstate and its affiliates to reduce auto insurance premiums for Vermont policyholders by about 15% during my Stay Home/Stay Safe Order. This means over $500,000 in savings for Vermonters. https:// dfr.vermont.gov/press-release/dfr-approves-allstates-plan-refund-auto-insurance-premiums-during-stay-home-stay-safe ", "2020-04-07T13:50:15.000Z": "I've written to @POTUS requesting a federal disaster declaration to assist VT in its response to COVID-19. I'm incredibly proud of the heroic efforts of Vermonters as we face this pandemic, but federal help is necessary to ensure our health and safety. https:// governor.vermont.gov/press-release/governor-phil-scott-submits-requests-federal-disaster-declaration ", "2020-04-06T21:00:38.000Z": "Educators and parents are working hard to achieve these goals, and this initiative will help support their work. I am grateful to Vermont PBS as this partnership will give those already doing so much another tool to reach and educate students. (3/3)", "2020-04-06T21:00:37.000Z": "Today I announced a partnership with @VermontPBS to provide educational content to supplement remote learning for Vermont students and school districts during the COVID-19 outbreak. (1/3) #vtpoli  https:// governor.vermont.gov/press-release/scott-administration-announces-partnership-vermont-pbs-provide-educational-programming ", "2020-04-06T12:11:51.000Z": "Today at 11:00 a.m. I'll be holding another briefing with my team to provide an update on Vermont's ongoing response to COVID-19. You can watch live on most local TV news stations, stream online at the link below, or tune in on VPR. https:// youtube.com/playlist?list= PL-xsDpLCa0iRMj4dQrqum7uoXaQmqeGvT ", "2020-04-05T20:48:59.000Z": "On behalf of all Vermonters, thank you to the incredible members of the @VTNationalGuard for your tireless service as we fight this virus. Your efforts inspire us all. #VermontStrong Quote Tweet Vermont National Guard @VTNationalGuard Brig. Gen. Greg Knight, Adjutant General of Vermont, visited Soldiers and Airmen building the Alternate Healthcare Facility (AHF) at the Champlain Valley Exposition in Essex Junction on Sunday. We continue to support VT COVID-19 response! @ChiefNGB  @USNationalGuard  #COVID", "2020-04-05T19:14:14.000Z": "It is critical for Vermonters to know the resources available during these trying times. If you are an individual or business looking for help, please visit our COVID-19 Economic Recovery Resource Center page, below. We know there is much more work to do. https:// accd.vermont.gov/covid-19", "2020-04-04T17:17:32.000Z": "Vermonters go the extra mile, help each other out and care for one another. It's in our DNA. It's what makes us who we are.\n \nNow, I'm calling Vermonters into service once again to support the state's response to COVID-19.\n \nYou can learn more & sign up at http:// vermont.gov/volunteer", "2020-04-03T22:01:28.000Z": "I want to make clear - this is NOT a substitute for staying home & it isn't an excuse to mingle with others. Please continue to follow the measures we've put in place. Social distancing is the most effective tool we have to reduce spread & ensure we don't overwhelm our hospitals. Quote Tweet VT Dept of Health @healthvermont As of today, Commissioner Mark Levine recommends Vermonters wear cloth facial masks or coverings if they need to leave their homes. It's still critical to reserve medical-grade masks for healthcare workers. Social distancing & handwashing most effective ways to slow spread. #VT", "2020-04-03T14:10:52.000Z": "I'll be holding a press conference this morning at 11:00 to provide an update on Vermont's ongoing response to COVID-19.\n\nYou can watch live at the link, below. https:// youtube.com/watch?v=g5M47l Yewaw ", "2020-04-02T23:53:11.000Z": "We continue to expand our medical surge capacity to be prepared for what could be a significant increase in medical need in VT in the coming weeks. I want to thank @VTNationalGuard and everyone involved for stepping up in this extraordinary time of service https:// governor.vermont.gov/press-release/governor-phil-scott-announces-additional-medical-surge-locations ", "2020-04-02T15:29:07.000Z": "Yesterday, my team and Rep. @PeterWelch outlined some of the latest economic relief resources available to individual Vermonters and Vermont businesses affected by COVID-19. For more info, visit http:// accd.vermont.gov/covid-19 & watch the full press conference at http:// rb.gy/eig8dz", "2020-04-01T16:58:37.000Z": "If you are a Vermont veteran wondering about the @VeteransHealth and @DeptVetAffairs response to COVID-19 and what it means for you, please visit http:// va.gov/coronavirus", "2020-04-01T14:09:07.000Z": "At 11:00 a.m. I'll be holding another press briefing with my team to provide an update on Vermont's ongoing response to COVID-19. You can watch live on most local TV news stations, stream online on their websites, or tune in on VPR. https:// governor.vermont.gov/covid19response", "2020-04-01T00:00:02.000Z": "Support your local Food Bank:\nDonate online at http:// vtfoodbank.org or you can text GIVEHEALTH to 85511. If you're in need of help, click below. 14/15 http:// vtfoodbank.org/gethelp . Home ENSURING ALL ARE FED DURING THE CORONAVIRUS Additional Ways To Help: Volunteer Opportunities - Corporate Food Donation - Virtual Food Drive COVID-19 UPDATE The Vermont Foodbank is focusing on how we... vtfoodbank.org", "2020-04-01T00:00:01.000Z": "Other individuals who do not have medical or healthcare backgrounds but are willing to volunteer their time in Vermont's response effort can register through the state's volunteer web portal and indicate their expertise and availability. 9/15 https:// vermont.gov/volunteer", "2020-04-01T00:00:00.000Z": "The Vermont Medical Reserve Corps is seeking these qualified and experienced volunteers, including: 6/15", "2020-03-31T23:59:58.000Z": "Those with medical experience or other health care backgrounds and the ability to volunteer are needed to bolster the ranks of Vermont's current health care workforce. 3/15 https:// vermont.gov/volunteer", "2020-03-31T23:59:57.000Z": "THREAD: Today, I'm calling all Vermonters into service with the launch of a new website allowing people to sign up for volunteer assistance to support our response to COVID-19. I'm asking every Vermonter to dig deep and find a way to help. #vtpoli 1/15 https:// vermont.gov/volunteer .", "2020-03-30T19:19:24.000Z": "I just signed both of these bills into law and once again want to thank the legislature, @VermontSOS and others for their hard work on these measures as part of our response to COVID-19. Quote Tweet Governor Phil Scott @GovPhilScott The Senate and House have moved quickly to pass the first of what will likely be many measures in response to the COVID-19 public health crisis. I am grateful for their work, collaboration and partnership and will sign them as soon as they reach my desk. https:// vermontbiz.com/news/2020/marc h/25/vermont-house-passes-covid-19-relief-package-remote-voting-provisions ", "2020-03-30T14:38:59.000Z": "In light of the significant risk posed by the further spread of COVID-19 I have just signed an Order that requires any person coming from outside the state to Vermont, for anything other than an essential purpose, to home-quarantine for 14 days.\nRead more: http:// governor.vermont.gov/addendum7pr", "2020-03-30T13:25:11.000Z": "This morning at 11:00 a.m. I'll be holding another briefing with my team to provide an update on Vermont's ongoing response to COVID-19. You can watch live on most local TV news stations, stream online on their websites, or listen in on the radio on VPR.", "2020-03-29T14:25:15.000Z": "Like many in business, trusted news organizations are being hit hard by this pandemic. If you can, please consider subscribing to your local paper or contributing to a VT news organization. You deserve transparency and the truth, and they work hard to keep you informed. #vtpoli", "2020-03-28T18:12:46.000Z": "This is the first weekend since I issued the Stay Home/Stay Safe Order. This, and other mitigation efforts, are all about slowing the spread of COVID-19. We must all stay home as much as possible. Doing so will save lives. \n\nHere's a reminder from @vemvt on what it means for you.", "2020-03-27T22:40:51.000Z": "Earlier today, I wrote to @POTUS asking him to invoke the Defense Production Act to support states get the supplies we need to fight this pandemic. We urgently need more ventilators and other essential equipment, which will require federal assistance. #vtpoli", "2020-03-26T22:08:58.000Z": "Today, I directed schools to remain dismissed through the end of the 2019-2020 school year. This decision was made in consultation with @healthvermont and @VTEducation in the continued effort to slow the spread of COVID-19. Read my full statement here: https:// governor.vermont.gov/press-release/governor-phil-scott-dismisses-schools-person-instruction-remainder-2019-2020-school ", "2020-03-25T23:51:31.000Z": "The Senate and House have moved quickly to pass the first of what will likely be many measures in response to the COVID-19 public health crisis. I am grateful for their work, collaboration and partnership and will sign them as soon as they reach my desk. Vermont House passes COVID-19 relief package, remote voting provisions Vermont Business Magazine Today the Vermont House gave final approval to H.681 and H.742, the legislature's COVID-19 relief package. H.681 contains several updates to our elections and open meeting... vermontbiz.com", "2020-03-25T18:14:59.000Z": "Commercial entities, non-profits, employers and others with questions about acceptable continuation of business operations should contact the Agency of Commerce and Community Development via the online form, below. (2/2) https:// bit.ly/covid-vt-busin ess-operations  .", "2020-03-25T18:14:58.000Z": "As you know, I issued a Stay Home/Stay Safe Order. Remember, you should leave your home only for essential reasons, and importantly, to get fresh air. But if you do, please follow CDC social distancing guidelines. \nTo read the full Order click below. (1/2) https:// governor.vermont.gov/content/addend um-6-executive-order-01-20 ", "2020-03-25T00:25:08.000Z": "Now is a moment of service for all of us. It's our turn to face a once-in-a-century challenge.\n \nBut I know Vermonters are up for it. \n\nWe are #VermontStrong We will get through this, and we'll do it, together. #vtpoli", "2020-03-24T21:20:12.000Z": "I've just signed a stay-at-home order and directed the closure of in-person operations for all non-essential businesses. \n\nVermonters: you must stay home. You must stay home to save lives. \n\nWe are all in this together - and we'll get through it, together. https:// governor.vermont.gov/press-release/governor-phil-scott-issues-%E2%80%9Cstay-home-stay-safe%E2%80%9D-order-directs-additional-closures ", "2020-03-24T13:47:30.000Z": "Thank you to my friend Rep. @PeterWelch for giving my team an update on Congress's COVID-19 relief package. The American people and our states need Washington's help to get through this, and Vermonters appreciate your hard work. #vtpoli", "2020-03-23T20:22:13.000Z": "I have directed the Commissioner of Taxes to provide relief to Vermont businesses who owe Meals and Rooms Tax or Sales and Use Tax until further notice.\n\nMany of our local businesses find themselves unable to meet the filing deadlines due to our necessary mitigation steps. (1/2)", "2020-03-23T00:08:18.000Z": "I know we're going to get through this, not because of any one person or any one action, but because of each of us doing our part. We must stand as Vermonters, united. (2/2)", "2020-03-23T00:06:58.000Z": "This challenge is an opportunity for each of us to step up, even as we must be physically apart. We can unite in our efforts to help those in need. Just like we need to take bold actions to defeat this pandemic, we also need small everyday acts of kindness and goodwill. (1/2)", "2020-03-22T20:15:37.000Z": "On behalf of all Vermonters, I want to extend my deep appreciation to custodial workers across the state who are working overtime to keep our spaces clean and safe. Thank you for helping us slow the spread of COVID-19.", "2020-03-21T16:27:03.000Z": "Vermont's educators are as critical to our COVID-19 response as anyone. I am incredibly proud of the selflessness of these public servants at this time of need. Thank you for you flexibility, creativity and spirit as Vermonters manage this evolving challenge, together. #vtpoli", "2020-03-20T16:11:20.000Z": "Feeling cooped up? #Socialdistancing does NOT mean you have to stay inside all the time. If you feel well & haven't been told to self-isolate, go outside, walk your dog & get fresh air. These types of activities can also relieve stress and anxiety. http:// healthvermont.gov  #VT", "2020-03-21T13:30:20.000Z": "In consultation with @healthvermont , I'm ordering in-person operations at close-contact businesses, meaning those unable to comply with guidelines for social distancing, to close. Other businesses must work to implement CDC & VDH guidance on COVID-19. https:// governor.vermont.gov/press-release/governor-phil-scott-announces-new-covid-19-community-mitigation-measures-directs ", "2020-03-20T22:28:34.000Z": "Last night I had the privilege of thanking talented members of the @healthvermont team in Burlington - many working second and third shift -  on behalf of all Vermonters. I was inspired by their sense of duty, commitment to public health and tireless work to keep us safe. #vtpoli", "2020-03-20T19:57:30.000Z": "(2/3) I want every Vermonter to know I understand the economic and emotional toll COVID-19 is having on each of us. People are hurting and businesses are at risk. Let me assure you, we will pull every lever and turn every dial we can to support folks through this time. #vtpoli", "2020-03-20T19:57:29.000Z": "(1/3) Today, @SBAgov approved my disaster declaration request due to COVID-19. \n\nVermont businesses can now apply for Economic Injury Disaster Loans, which offer up to $2 million in assistance, providing help to overcome temporary loss of revenue. #vtpoli  https:// governor.vermont.gov/press-release/governor-phil-scott-announces-economic-injury-disaster-loans-available-small ", "2020-03-20T18:37:10.000Z": "Grocery & food supply workers are critical to our COVID-19 response. To all of you working long & stressful hours, thank you for your hard work. Keeping food & other essentials accessible is critical & your tenacity is appreciated. With your help, we will get through this #vtpoli", "2020-03-20T01:46:29.000Z": "I know all VTers join me in sending our deepest sympathies to the loved ones of the two VTers we sadly lost today. During this difficult time I know some are feeling scared, worried & overwhelmed, but I want you to know we will get through this because we're all in this together.", "2020-03-19T18:08:30.000Z": "I just signed a directive allowing delivery & take-out of alcoholic beverages - including spirit-based drinks - by restaurants, bars & other establishments. If you can, please help them out by ordering take-out or delivery for you & your family! #buylocal  https:// governor.vermont.gov/content/direct ive-4-delivery-and-take-out-beverage-alcohol-department-liquor-and-lottery-pursuant-eo ", "2020-03-19T13:36:10.000Z": "Thank you, George! We are all in this together. Thank you for your service to Vermonters during this time of need. #VermontStrong Quote Tweet Garry Scott @VSP_Garry #COVID19 This is George, a dedicated @AOTVermont employee, and he is delivering medical supplies as part of Emergency Operation to help Vermonters. @VTStatePolice  @healthvermont all working together. #WeAreInThisTogether  #vermontstrong", "2020-03-19T12:59:23.000Z": "First, I want to thank heath care workers & our public health officials at @healthvermont for working day and night to keep Vermonters safe and healthy. We owe them a debt of gratitude. We will get through this pandemic, largely thanks to their commitment & sense of duty. #vtpoli", "2020-03-19T12:59:22.000Z": "THREAD: As we face unprecedented challenges & experience disruptions due to COVID-19, I'll be highlighting Vermonters for their hard work & the sacrifices they're making to help us get through these tough times. We will get through this, but it'll take all of us doing our part.", "2020-03-18T16:45:10.000Z": "During these challenging times I have instructed @VTLabor to launch an online form for unemployment insurance claims and we're expanding the number of people in our call center to help. \nTo file, visit the link below or call 1-877-214-3330 (1/2) #vtpoli  https:// appengine.egov.com/apps/vt/dol/un employmentinsuranceclaim ", "2020-03-17T23:47:35.000Z": "Teachers, childcare providers and school support staff are going to be as critical to our response as our doctors, nurses and healthcare support staff. (3/5)", "2020-03-17T23:47:34.000Z": "I'm directing childcare centers across the state to close normal operations, but encourage continued operation exclusively where needed to provide services for workers who are essential to Vermont's ongoing effort in community mitigation of COVID-19. (1/5) https:// governor.vermont.gov/press-release/governor-phil-scott-orders-implementation-child-care-system-personnel-essential-covid ", "2020-03-16T21:49:45.000Z": "I want Vermonters to know we're continuously evaluating other mitigation steps and we'll continue to communicate those as they are put into place. \n\nWe will get through this, but it'll take all of us doing our part. \n\nFor the latest guidance, visit http:// healthvermont.gov/covid19 (2/2) Coronavirus (COVID-19) healthvermont.gov", "2020-03-16T21:49:42.000Z": "In response to the COVID-19 pandemic, effective Tuesday, March 17 at 2:00 p.m. I am ordering the closure of all bars and restaurants statewide. Establishments may continue to offer food for take-out and by delivery. (1/2) #vtpoli  https:// governor.vermont.gov/press-release/governor-phil-scott-announces-new-guidance-covid-19-community-mitigation-measures ", "2020-03-15T22:21:27.000Z": "In times of crisis, we all need to make sacrifices. But Vermonters, and all Americans, have risen to the challenges before, and this time will be no different. We will get through this. And we'll do it, together. \n \nFor guidance on #coronavirus , visit http:// healthvermont.gov . 2/2", "2020-03-15T22:17:46.000Z": "The orderly dismissal of schools is essential to support both the State's response to COVID-19 and the needs of children and families across VT. We must ensure children are safe, nourished, and still learning even as the traditional structure of school is disrupted. 1/2 #vtpoli", "2020-03-15T19:30:00.000Z": "In response to the COVID-19 pandemic, I'm announcing a Continuity of Education Plan for the orderly dismissal of all schools, and cancellation of all school related activities, no later than Wednesday, March 18. More details here: https:// governor.vermont.gov/press-release/gov-scott-orders-orderly-closure-vermont-prek-12-schools-week ", "2020-03-14T19:38:40.000Z": "(3/3) For the latest guidance on #coronavirus , visit http:// healthvermont.gov .", "2020-03-14T19:36:10.000Z": "(2/3) For additional details read my executive order declaring a State of Emergency here: https:// governor.vermont.gov/content/declar ation-state-emergency-response-covid-19-and-national-guard-call-out-executive-order-01 ", "2020-03-14T19:33:25.000Z": "(1/3) Every single one of us has a role to play confronting COVID-19 and protecting those who are most vulnerable to it - the very ill and elderly. We're all in this together. We're going to act together, and we're going to get through this, together.", "2020-03-13T19:49:44.000Z": "You can watch my press conference live on television on @WCAX , @WVNYWFFF and @MyNBC5 , as well as online on @VermontPBS at https:// vermontpbs.org/live/ Quote Tweet Governor Phil Scott @GovPhilScott Today at 5:30 I'll be joined by public health officials & members of my cabinet to provide an update on VT's response to COVID-19 & detail new & additional mitigation steps VT is taking to address the spread of the virus. More details on where you can watch live will be provided.", "2020-03-13T13:46:25.000Z": "Today at 5:30 I'll be joined by public health officials & members of my cabinet to provide an update on VT's response to COVID-19 & detail new & additional mitigation steps VT is taking to address the spread of the virus. More details on where you can watch live will be provided.", "2020-03-11T15:06:49.000Z": "Congratulations to the Caps for winning the CVSA U14 state championship. Good luck in regionals!", "2020-03-10T15:43:48.000Z": "Today I had the privilege of welcoming a group of inspiring New Americans and refugees in process of obtaining citizenship to my office in the State House. Vermont is proud to welcome refugees and immigrants to our state.", "2020-03-10T13:36:23.000Z": "Today I ordered the activation of the State Emergency Operations Center to further support our COVID-19 response. The health operations center has been activated since early February. For the latest guidance on #coronavirus visit http:// healthvermont.gov/covid", "2020-03-08T03:45:09.000Z": "The Vermont Dept. of Health has announced Vermont's first case of COVID-19. View my statement below:", "2020-03-07T14:01:30.000Z": "My administration has issued a directive to health insurers so that Vermonters will not be billed for medically necessary COVID-19 testing. And for the latest guidance on #coronavirus , visit http:// healthvermont.gov/covid Quote Tweet Vermont Department of Financial Regulation @VermontDFR @VermontDFR issued Insurance Bulletin # 209 - Access to COVID-19 Testing\n\nThe bulletin instructs all health insurers providers in #VT to cover any medically necessary #COVID19 testing w/ no co-payment, coinsurance, or deductible. https:// dfr.vermont.gov/reg-bul-ord/ac cess-covid-19-testing   @healthvermont", "2020-03-05T19:29:29.000Z": "Thank you, @SenatorLeahy , for your hard work on the appropriations bill that will provide the funding and flexibility we need to respond. I appreciate you, as well as Rep. @PeterWelch , taking the time to update me on Congress's progress over the past week. Quote Tweet Sen. Patrick Leahy @SenatorLeahy Proud to support @GovPhilScott and #VT agencies' coordinated efforts in responding to #Coronavirus . The Senate is poised to pass our $8.3B emergency #Approprations bill I worked on to help states like ours face this challenge. VT will receive $4.9m in grants from #CDC alone.", "2020-03-04T16:56:38.000Z": "On this day 229 years ago, Vermont was formally admitted to the Union, becoming the 14th state. America is stronger because of the contributions of the Green Mountain State & its people. Stella quarta decima fulgeat (May the fourteenth star shine bright). Happy Birthday, Vermont!", "2020-03-01T20:46:44.000Z": "Enjoyed a beautiful afternoon in the 802 cross country skiing @TrappFamily Lodge in Stowe.  Great conditions on the first day of March - in like a lion, out like a lamb! Enjoy the snow while it lasts! #ThinkVT", "2020-02-29T16:20:08.000Z": "It's officially @girlscouts Cookie Weekend in VT. Vermonters can stock up on these treats and support the largest entrepreneurship program for girls in the world. See the Girl Scout Weekend proclamation here: https:// bit.ly/2I8XDY5 , and don't forget to support your local troop!", "2020-02-28T21:12:39.000Z": "Lucy Terry's ballad, \"Bars Fight,\" is considered the oldest known work of poetry by an African American. After settling in Guilford, VT, Lucy - a former slave - successfully argued her family's land theft case before the Vermont Supreme Court in 1785. #BlackHistoryMonth", "2020-02-28T17:17:33.000Z": "Today at 1 p.m., my team at @healthvermont & @vemvt will provide an update on Coronavirus (COVID-19). While there are currently no cases of people with COVID-19 in Vermont, this team will detail our preparations for, and response to, COVID-19. Watch at: https:// facebook.com/vermontemergen cymanagement/ ", "2020-02-28T15:36:29.000Z": "It was a pleasure to be with Mary again today to sign a proclamation naming Feb. 29 Rare Disease Day in Vermont, raising awareness of the nearly 7,000 @NIH designated rare diseases and conditions that affect Vermonters and Americans. Thank you for you tireless advocacy, Mary! Quote Tweet Governor Phil Scott @GovPhilScott This morning during open door coffee, I had the privilege of meeting Mary Nadon and learning more about Friedreich's ataxia and her work with @CureFA_org to raise public awareness and find a cure for this debilitating disorder. #CureFA", "2020-02-27T01:58:59.000Z": "Last year, 69 Vermont senior athletes competed in the National Senior Games in New Mexico. 34 were podium finishers, collectively winning 14 gold, 8 silver and 12 bronze medals. Today I had the honor of welcoming them to the State House and congratulate them for making VT proud.", "2020-02-26T19:39:03.000Z": "Today I met with young author, Carter Somaini, a 4th grader from Barre whose book, \"The Boy and the Bat,\" shows kids with dyslexia that they can do anything they set their mind to. Thanks to Carter and his family for joining me this morning!", "2020-02-25T01:20:52.000Z": "Glad to end our Essex County #VTCapitol4aDay at the Essex House and Tavern in Island Pond. This community is leveraging outdoor recreation to support its economy and showing what a great asset our natural resources and recreation can be.", "2020-02-25T00:23:44.000Z": "It's incredibly helpful to hear from those on the ground about the benefits of better integration, helping patients navigate the system and growing the healthcare workforce. #VTCapitol4aDay", "2020-02-25T00:23:41.000Z": "Community based healthcare helps us deliver vital services in rural areas where access is especially challenging. Pleased to learn more about unique needs & strategies - including coordinated care - in Essex County from the professionals at the Island Pond Health & Dental Center.", "2020-02-24T20:42:20.000Z": "#VTCapitol4aDay brought us to Sweet Tree Holdings ( @themapleguild ) in Island Pond. This impressive, innovative operation is producing quality organic syrup, sold around the world.", "2020-02-24T18:22:36.000Z": "If you're in the area, make sure to stop by April's Maple", "2020-02-24T18:12:56.000Z": "Thank you to April's Maple for hosting my team & members of @NCChamberofC for a great lunch as part of #VTCapitol4aDay . Great to chat w/ these employers about workforce challenges and economic opportunities, and to learn more about April's success here in Essex County.", "2020-02-24T16:43:31.000Z": "My team is working to strengthen and increase investment in tech centers like this because they are so important to filling critical workforce needs, including nursing, emergency services, manufacturing, agriculture, carpentry, welding and more. #VTCapitol4aDay", "2020-02-24T16:43:27.000Z": "The Canaan Career Technical Center offers five college and career pathways to its students, helping train our future workforce and provide greater opportunities for kids from both Vermont and New Hampshire. #VTCapitol4aDay", "2020-02-24T15:40:55.000Z": "Next stop for #VTCapitol4aDay was to Ethan Allen Sawmill in Beecher Falls. The company provides hundreds of jobs in the Northeast Kingdom, and builds custom furniture sold around the globe.", "2020-02-24T13:54:49.000Z": ". @VTLabor Acting Commissioner Michael Harrington provided details on Essex County's workforce, which illustrates the two Vermonts that exist and the challenges our rural areas face. #VTCapitol4aDay", "2020-02-24T13:54:37.000Z": "Dept. of Forests, Parks & Rec Deputy Commissioner Sam Lincoln shared how last year's visit to Essex County has helped in our work to support the logging industry, which is critical to the region's economy. #VTCapitol4aDay", "2020-02-24T13:54:26.000Z": "Great to be in Beecher Falls to kick off our Essex County #VTCapitol4aDay ! Thanks to Beecher Falls Volunteer Fire Department for hosting our cabinet meeting this morning and for all you do to serve and protect this area.", "2020-02-21T21:50:27.000Z": "When I was in the Senate, I was honored to serve with Sen. Julius Canns, who fought for the recognition of Abenaki tribes & advocated for veterans. He was also the first African American to serve in the Vermont Senate. He was a great colleague & public servant. #BlackHistoryMonth", "2020-02-20T17:20:53.000Z": "Our Office of Professional Regulation is working w/ @GovPhilScott and members of the Senate/House Gov't Operations Committees to break down barriers to licensing for #VT professionals. Our goal is to cut red tape & roll back unnecessary regulation to grow our workforce. #VTPoli", "2020-02-18T20:30:03.000Z": "Today, I proclaimed it Engineers Week in VT. Engineers play a critical role in our communities, economy & so much of our daily lives - and we need more of them. The good news is there're many engineering jobs in our state available right now. Learn more @ http:// vermontjoblink.com", "2020-02-18T14:46:27.000Z": "Born in Corinth, VT, Alexander Twilight was the first African American man to earn a bachelor's degree from an American college. In 1836, he became the first African American man elected to a state legislature, representing Brownington in the VT House of Reps. #BlackHistoryMonth", "2020-02-14T20:07:56.000Z": "Thanks to @scoutingvermont for having me at their Eagle Scout Recognition Day to celebrate 27 of the 65 scouts who've earned that rank in the last year. Congratulations to these young leaders who do so much to serve others in their communities!", "2020-02-14T18:09:48.000Z": "Eliza Healy (later know as Sister Mary Magdalen) was born into slavery in Georgia and, in 1903, became the first African American mother superior of a Catholic convent when she assumed leadership of the Villa Barlow convent and school in St. Albans, VT. #BlackHistoryMonth", "2020-02-12T19:18:14.000Z": "To learn more about their experiences and important contributions, a good place to start is the Vermont African American Heritage Trail to visit historical sites and hear these stories. #BlackHistoryMonth  #ThinkVT  http:// bit.ly/37mtChR", "2020-02-12T19:17:53.000Z": "Our shared values as Vermonters have been shaped by those who came before us. The history of African American Vermonters is woven into the story of our state and we honor this legacy as we celebrate #BlackHistoryMonth", "2020-02-10T16:31:11.000Z": "When combined with decreases from 2017-2019, VT employers will pay an average of 30% less in workers' comp. premiums than before I took office. These savings will help employers of all sizes hire more workers, increase salaries and expand their operations in our state. (2/2)", "2020-02-10T16:31:09.000Z": "As we work to grow the economy, addressing the high cost of doing business in Vermont is critical. This year, I'm happy to announce the largest workers' compensation insurance rate decrease in decades - without reducing benefits to workers. (1/2)", "2020-02-09T14:21:31.000Z": "Productive meeting this morning with fellow New England governors @GovNedLamont , @GovJanetMills and @MassGovernor Charlie Baker, discussing clean energy, infrastructure and other ways we can work together as a region.", "2020-02-08T22:08:22.000Z": "I'm in D.C. for the @NatlGovsAssoc , working with colleagues to find solutions to issues that face all our states. It's great to join @MassGovernor , Gov. @DougDucey and others for @GovLarryHogan 's Chair Initiative roundtable on modernizing America's infrastructure. #WeTheStates", "2020-02-08T18:15:17.000Z": "Yesterday with Loki, and today with Captain America @ChrisEvans to be interviewed for his new project, A Starting Point, which aims to help Americans bridge the gap of political rhetoric and better understand the issues that impact them and their families. Quote Tweet Governor Phil Scott @GovPhilScott Great to meet @VTStatePolice 's newest recruit, Loki, who showed me around the State House yesterday.", "2020-02-08T16:20:54.000Z": "Great to meet @VTStatePolice 's newest recruit, Loki, who showed me around the State House yesterday.", "2020-02-05T00:27:00.000Z": "Last week, I vetoed a $29 million payroll tax on VTers & outlined the next steps of my plan to provide a voluntary paid leave program without a tax hike or new bureaucracy. If you agree, contact your reps at 802-828-2228 and ask them to sustain my veto. https:// facebook.com/12554190512038 93/posts/2768860103193106/?vh=e&d=n ", "2020-01-31T22:07:18.000Z": "Today, I vetoed a new mandatory $29 million payroll tax on working Vermonters, and outlined the next steps of my plan to provide an affordable paid family and medical leave program without a tax increase or new bureaucracy. Read my statement here: #vtpoli  https:// governor.vermont.gov/press-release/governor-phil-scott-announces-action-h107-details-progress-towards-voluntary-paid ", "2020-01-30T16:50:51.000Z": "#USMCA", "2020-01-30T15:39:28.000Z": "Ratification of the #USMCA is great news for workers, small businesses, manufacturers, innovators and farmers in Vermont and all across the North American economy. I appreciate the work of President Trump and his administration on this impactful trade deal...(1/2)", "2020-01-29T19:02:47.000Z": "Welcome to @VTStatePolice 's newest officer! Quote Tweet Adam Silverman @Wej12 Meet Loki, the @VTStatePolice 's first hound dog on the force in more than 30 years! After training, she will specialize in tracking down missing people and fugitives. Learn more: https:// bit.ly/2U8Me1M  #btv  #vt Show this thread", "2020-01-29T14:48:54.000Z": "This morning during open door coffee, I had the privilege of meeting Mary Nadon and learning more about Friedreich's ataxia and her work with @CureFA_org to raise public awareness and find a cure for this debilitating disorder. #CureFA", "2020-01-27T18:19:44.000Z": "A Statement from Governor Phil Scott on Holocaust Remembrance Day: http:// bit.ly/30Yt67U", "2020-01-24T22:17:50.000Z": "It was an honor to recognize Vermont World War II veterans today in Stowe. We can never fully repay our debt to members of the Greatest Generation who served. Their bravery, heroism and sacrifice saved the world, and we can never thank them enough.", "2020-01-24T19:39:50.000Z": "Voting is critical to our democracy and it's important for all Vermonters to participate. Join @VermontSOS and community partners in Burlington and Winooski for New American voting events to learn more about registering to vote and using new translated ballots!", "2020-01-21T19:48:27.000Z": "If we accept the challenge, set clear objectives, have the discipline to commit to solutions and follow through, we can reverse these trends. We can restore economic vitality to every corner of our state. We can make Vermont more affordable for every family & business. #VTBudget", "2020-01-21T19:47:18.000Z": "The issues we face are significant but none greater than the demographic crisis and the economic challenges it brings... Confronting this crisis now is the only way to preserve our ability to solve problems in the future. #VTBudget", "2020-01-21T19:46:41.000Z": "My $3.15M Clean Grid Modernization Package will encourage companies to start & expand here by making R&D work eligible for a tax credit and will provide $2M in capital & technical assistance... and I propose we eliminate the corporate income tax on these job creators. #VTBudget", "2020-01-21T19:45:39.000Z": "(2/2) While we wait for Congress to work on a national solution, electric utilities have introduced EV-specific rates and will recommend a pilot program for the collection of revenue from EV charging stations to support long-term transportation maintenance. #VTBudget", "2020-01-21T19:44:59.000Z": "(1/2) My budget proposes to invest $3 million to address [obstacles to EV purchases] and help meet our climate & energy goals... We'll increase funding for incentives, consumer education and support services and more charging stations on our highways & our workplaces. #VTBudget", "2020-01-21T19:43:20.000Z": "On top of everything we're already doing & everything I'm proposing... I propose committing 25% of all future end-of-year budget surpluses for additional investments that address climate change, specifically for initiatives that support weatherization or electrification. #VTBudget", "2020-01-21T19:40:24.000Z": "To create an incentive for military vets to return to VT & join our workforce, I'm again proposing to exempt military retirement pay from the income tax... I hope you'll join me this year in eliminating the tax on those who devoted their lives in service to our nation. #VTBudget", "2020-01-21T19:39:21.000Z": "(4/4) That America is still a land of opportunity for all who seek freedom from oppression, security for their families or, in some cases, just a fresh start. As long as I'm governor, they'll be welcome right here in Vermont. #VTBudget", "2020-01-21T19:38:57.000Z": "(3/4) These efforts not only benefit our state, they also signal we're committed to the values this nation was built on. #VTBudget", "2020-01-21T19:38:32.000Z": "(2/4) This includes funding to @VTLabor that will help communities plan for and explore refugee resettlement and opportunities to welcome more New Americans to Vermont. #VTBudget", "2020-01-21T19:38:20.000Z": "(1/4) We'll continue to advocate for more legal immigration as a way to bring more hardworking people to Vermont to contribute to our economy and grow our workforce. #VTBudget", "2020-01-21T19:38:07.000Z": "We'll also continue our efforts to recruit more people to live and work here. This includes increased funding for @VTLabor 's VT Relocation Assistance Program to ensure folks interested in moving here have the info they need about jobs, housing & opportunities available. #VTBudget", "2020-01-21T19:37:37.000Z": "We hear about our growing labor shortage in every sector on a daily basis... I ask you to work with me on a $1M incentive to keep graduates from our registered nurse and licensed practical nurse programs right here... filling positions desperately needed by employers. #VTBudget", "2020-01-21T19:36:43.000Z": "(2/2) If you're willing to look at things differently and move with urgency, we can have a unified, statewide training program next year. #VTBudget", "2020-01-21T19:36:24.000Z": "(1/2) I've also asked @VTLabor and @VTEducation to work with @VSC_edu to align our Adult Ed and Adult CTE system with @CCV_VT , @vttech , our tech centers and regional stakeholders. This will create a seamless pathway from school to training to work. #VTBudget", "2020-01-21T19:35:52.000Z": "(3/3) That's why I've directed @VTLabor to work with @VSC_edu and tech centers throughout the state to double the number of apprentices by 2023. #VTBudget", "2020-01-21T19:35:39.000Z": "(2/3) Apprenticeships are great opportunities for Vermonters to earn while they learn... These programs are industry-driven, allowing employers to recruit for good jobs they have available. But there's an opportunity and need to do more. #VTBudget", "2020-01-21T19:35:14.000Z": "(1/3) Over the last four years, we've added more than 700 apprentices to our workforce, which includes a 36% increase in the number of women in these important programs. #VTBudget", "2020-01-21T19:33:50.000Z": "(2/2) Let's build on this success with an additional $3 million for childcare assistance, and let's also expand the lottery and commit these new revenues to this initiative each year moving forward. #VTBudget", "2020-01-21T19:33:37.000Z": "(1/2) We know the benefits of accessible, affordable childcare for parents, kids and our economy, which is why we've worked together to increase funding by 30%-about $10 million-over the last three years, and these investments are working. #VTBudget", "2020-01-21T19:33:01.000Z": "To recognize the incredible importance of our larger anchor employers... I propose a $3M VT Capital Investment Incentive Program which encourages these companies to make new upgrades at local facilities & in exchange... they'll commit to maintain certain payroll levels. #VTBudget", "2020-01-21T19:32:39.000Z": "To support more small business growth, I'm proposing a $1 million incentive program through the Vermont Economic Development Authority (VEDA) to provide low-cost loans that convert to no-cost grants after meeting expansion and payroll goals. #VTBudget", "2020-01-21T19:32:25.000Z": "(2/2) And when they're successful, we'll provide a match to the federal grant to help them grow and create jobs. #VTBudget", "2020-01-21T19:32:14.000Z": "(1/2) We'll also support our small technology businesses with an investment of $1M to help them secure federal Small Business Innovation grants for groundbreaking work done right here in Vermont and to tap into the research capabilities at our colleges and universities. #VTBudget", "2020-01-21T19:31:55.000Z": "Let's make it easier to start, register and operate a business here. Working with @VermontSOS , my budget includes $1 million for a streamlined and online business portal which will make it much easier for them to navigate state government. #VTBudget", "2020-01-21T19:31:06.000Z": "As another part of my Community Investment Package, my budget includes $1M for incentives to rehabilitate old homes into decent, affordable, energy efficient rental properties [and] reforms to the Renter Rebate Program... resulting in about $800K more in rebates. #VTBudget", "2020-01-21T19:30:01.000Z": "(2/2) Let's couple the most beautiful state in the nation with an increased investment to remind the 70 million people who live within a six-hour drive that we're not only a great place to visit but also to live, work, play and, hopefully, invest in. #VTBudget", "2020-01-21T19:29:32.000Z": "(1/2) Tourism is a top contributor to our economy. But we're investing far less than every other state in the region & we compete with them for visitors every single day. My budget includes an additional $1M investment in tourism, economic dev & outdoor rec marketing. #VTBudget", "2020-01-21T19:29:03.000Z": "To further strengthen Vermont's small towns, agriculture and other businesses, I've budgeted $750,000 for the Working Lands initiative which will help expand production of quality food, forest products and jobs. #VTBudget", "2020-01-21T19:28:49.000Z": "I also propose a $2.8M investment that will leverage another $11.3M in federal funds to complete the Lamoille Valley Rail Trail.... When complete, the activity it will create-along with cross promotion-will strengthen businesses, economies & the quality of life. #VTBudget", "2020-01-21T19:27:39.000Z": "The City of Newport is now poised for a once-in-a-generation redevelopment... The capital bill now includes $1.5M to begin the process of helping to revitalize Main St... bring[ing] public & private investment together to implement a larger vision for Newport & the NEK. #VTBudget", "2020-01-21T19:26:41.000Z": "Tax Increment Financing [districts] not only create economic growth but also empower communities to shape their own future... I'll continue to support expanding them across Vermont, including a proposal to make them available to smaller communities. #VTBudget", "2020-01-21T19:25:48.000Z": "Today, I propose increasing the downtown & village center tax credits to $4 million-a $1.4 million increase. These dollars support important projects like Springfield's Woolson Block & Bennington's Putnam Block that are often the first step in community revitalization. #VTBudget", "2020-01-21T19:24:48.000Z": "To put all Vermonters on a better path, we must increase economic opportunity in each of our 14 counties. That's why this budget includes more investments in downtowns and regional economic centers, and tools to help employers survive and create more good paying jobs. #VTBudget", "2020-01-21T19:24:14.000Z": "We're one of only 4 states moving forward with a prescription importation program Our estimates show this could save millions My budget includes resources to continue this important effort, because lowering the costs of prescription drugs is the right thing to do. #VTBudget", "2020-01-21T19:23:26.000Z": "(2/2) I recommend we continue to support this work by asking you to authorize the $5.7M for delivery system reforms proposed in budget adjustment on the condition the ACO operate as a non-profit or meet those same transparency standards. #VTBudget", "2020-01-21T19:21:55.000Z": "(1/2) In 2018, the providers the state paid through the ACO reduced the amount of money spent on healthcare services by $7.7M. In the same year, providers who were not paid through the ACO spent $1.5M more than expected. Early results for 2019 show a similar pattern. #VTBudget", "2020-01-21T19:20:21.000Z": "We'll be able to triple the number of barracks where we embed [social workers], which will reduce the volume of emergency calls, hospitalizations and court involvement for some of our most vulnerable Vermonters, all within existing resources. #VTBudget", "2020-01-21T19:19:43.000Z": "I'd like to pilot a new mental health Mobile Response Unit. In other states, this model has reduced emergency room visits and hospital admissions, saved many hours of law enforcement time and helped foster kids find stability. #VTBudget", "2020-01-21T19:19:14.000Z": "Tragically, suicide is a growing risk around the country, and we know all too well Vermont is not immune. Our approach must focus on early intervention for those at risk. That's why my budget invests over $1 million more in suicide prevention & mental health services. #VTBudget", "2020-01-21T19:18:31.000Z": "(3/3) Coupled with the universal afterschool network I proposed in the State of the State and expanding mental health services in schools, we can prevent serious problems before they develop and give every child the hope and opportunity they need and deserve. #VTBudget", "2020-01-21T19:18:13.000Z": "(2/3) ...reduced costs of child protection, special education, substance abuse and criminal justice services down the road and put families on a path to economic self-sufficiency. #VTBudget", "2020-01-21T19:17:59.000Z": "(1/3) By investing $1M more in our newborn home visiting program, we can cover roughly 1/4 of all the babies born each year, giving these parents the support they need to build a better foundation for their kids. This model has improved the health of babies and moms... #VTBudget", "2020-01-21T19:17:31.000Z": "My budget prioritizes spending to prevent root causes rather than just treat consequences... to find efficiencies, make structural changes & create savings in order to reinvest in areas that prevent problems in the first place which will further reduce costs over time. #VTBudget", "2020-01-21T19:16:07.000Z": "Our demographic crisis is without question the greatest challenge we face as a state... But here's the thing: We can fix it, so long as we resist the temptation to ignore it, get distracted by politics or become deterred by hard work. #VTBudget", "2020-01-21T19:14:54.000Z": "(2/2) And even with consistent revenue growth, each year we've had to make difficult decisions with reductions to agencies, departments, programs and services. #VTBudget", "2020-01-21T19:14:39.000Z": "(1/2) The General Fund budget I'm presenting spends $1.7 billion, which is an increase of 2.8% or $46 million over the current year. Here's the frustrating part: Even with organic revenue growth, we still started building our General Fund budget with a $70 million gap. #VTBudget", "2020-01-21T19:14:14.000Z": "(2/2) ...student performance and the number of kids continue to decrease. Since Act 60 was passed, we've lost 26,000 students from our K-12 public schools while education spending has more than doubled. #VTBudget", "2020-01-21T19:13:58.000Z": "(1/2) In the Education Fund... we project spending to total over $1.8 billion, an $87 million, 5% increase over the current year. Unfortunately, we're seeing spending, property taxes, as well as inequity, continue to increase while educational opportunities... #VTBudget", "2020-01-21T19:13:29.000Z": "We're now in the second year of the $124 million capital bill. I'll propose a few changes... but we remain on target in most areas. #VTBudget", "2020-01-21T19:13:15.000Z": "(2/2) This includes $100M for roads and paving, major projects like the new draw bridge in Grand Isle & our rail project in Middlebury... It provides for 158 new park and ride spaces, investments in bike and ped projects and so much more. #VTBudget", "2020-01-21T19:12:43.000Z": "(1/2) The transportation budget includes $276.7M in state funds... leveraging another $335.6M in federal funds. This amounts to a $25.5M increase... the largest transportation budget since the Irene recovery, without raising additional taxes or fees. #VTBudget", "2020-01-21T19:12:14.000Z": "This is the approach we took, and in the upcoming fiscal year, across all funds, our budget totals $6.3 billion. With $4.2 billion of state revenue sources and $2.1 billion in federal dollars, this is an increase of about 2% over the current year. #VTBudget", "2020-01-21T19:11:53.000Z": "With each budget proposal, I've focused on our fiscal fundamentals, to balance what we want with what we need and to set us on a path where our capacity to solve problems and help people grows while the burden on taxpayers shrinks. #VTBudget", "2020-01-21T19:10:40.000Z": "It's my belief the state budget should not grow any faster than people's paychecks. Our goal should be to do our work in ways that help Vermonters keep more of what they earn, making it easier-not harder-for every family to live a secure and stable life. #VTBudget", "2020-01-21T17:56:48.000Z": "My team will be live tweeting my FY21 Budget Address this afternoon. Follow along with #VTBudget and on my Facebook live stream: http:// bit.ly/2Rclc7L", "2020-01-20T21:16:31.000Z": "", "2020-01-19T19:03:27.000Z": "My proclamation for Martin Luther King, Jr. Appreciation Day tomorrow, January 20:", "2020-01-18T19:12:15.000Z": "Dr. King continues to inspire us. His dream remains in progress, but his life shows we can all help shape our future, transform our nation and set an example for our kids. Let's recommit to his vision, working toward something bigger than ourselves. #MLK", "2020-01-17T19:39:03.000Z": "As we begin this holiday weekend in honor of Dr. Martin Luther King Jr., let's draw inspiration from his example and his words: \"Darkness cannot drive out darkness; only light can do that. Hate cannot drive out hate; only love can do that.\" #MLK", "2020-01-16T20:20:48.000Z": "If we focus on the fundamentals: a better, more modern government, a stronger fiscal foundation and policy that's truly equitable, then our communities will be stronger and more resilient than ever before. #VTSOTS", "2020-01-16T14:43:26.000Z": "I also recognized the Ludlow Fire Dept, who went above & beyond the call of duty on Thanksgiving when a family's stove caught fire, destroying their turkey. Firefighters extinguished the flame & went back to the firehouse to cook the family's dinner, saving their holiday. #VTSOTS", "2020-01-16T03:15:33.000Z": "The work Vermont's fire fighters do every day is an inspiration for us all. Not only do they save lives, but livelihoods, homes, property & so much more. It was great to join so many farmiliar faces at the Addison County Fire Fighters Association dinner tonight for my 10th year.", "2020-01-15T21:31:29.000Z": "The fact is, where we are as a state and where we go from here is in the hands of every Vermonter. #VTSOTS", "2020-01-14T23:10:19.000Z": "In my #VTSOTS I also highlighted Gloria Powers. Gloria has provided a home for nearly 400 foster children over 25 yrs. She spends hours each week at the Glover Senior Center, providing meals for members of her community. She wakes up every day wondering how she can help others.", "2020-01-13T21:23:01.000Z": "Vermonters of the Greatest Generation who served during WWII, like my dad, stepped up to protect democracy for their generation and those of us who followed. Thank you to the vets of the Barre American Legion Post and the POWs who attended my #VTSOTS - and to all who served.", "2020-01-13T21:22:57.000Z": "Where we are as a state, and where we go from here, is in the hands of every Vermonter. It's the people of Vermont, doing all they can to lift each other up, who will shape our future. They define who we are and all we can be. #VTSOTS", "2020-01-10T22:06:02.000Z": "Duchess Meghan and Prince Harry, what about checking out a smaller Kingdom.... Vermont's Northeast Kingdom! It's a great place to live, work and play. And it's even close to Canada! #ThinkVermont Quote Tweet BBC Breaking News @BBCBreaking Prince Harry and Meghan to step back as \"senior\" royals and divide time between UK and North America, palace says https:// bbc.in/39KXSFz", "2020-01-09T20:00:23.000Z": "If our sense of service and duty is strong; if our commitment to our neighbors is unwavering; and if we remember that we are all part of something bigger than ourselves, then the state of the state, our future and our people will be stronger than ever before. #VTSOTS", "2020-01-09T19:54:47.000Z": "When [difficult] moments come, I think of the people who inspire me to be part of something bigger, of what they've endured with courage and resolve, and how they show that in the face of incredible adversity, we're all capable of great things. #VTSOTS", "2020-01-09T19:53:32.000Z": "Over the next few months, the way we go about our work will not only determine the results we're able to deliver but also the strength of our institutions, the faith Vermonters have in us and the example we set for our kids. #VTSOTS", "2020-01-09T19:52:45.000Z": "I'll also propose a package of criminal justice reforms that we've shared with the comms. of jurisdiction As we continue to create a more effective criminal justice system, we must remember that justice for victims & accountability for criminals must be top priorities. #VTSOTS", "2020-01-09T19:50:20.000Z": "Many of you, alongside the Agency of Human Services, have worked diligently to improve our mental health system. This includes adding inpatient capacity, which is critical to getting people the care they need, when they need it. #VTSOTS", "2020-01-09T19:50:02.000Z": "We took significant steps over the last year to protect kids: passing legislation to address the vaping epidemic and to ensure drinking water at every school and child care center will be tested for lead. And this work will continue. #VTSOTS", "2020-01-09T19:49:34.000Z": "(3/3) ...as well as expanding our battery and renewable energy storage sectors and the jobs they can create. And I'll propose giving small co-ops and municipal utilities more flexibility in order to innovate. #VTSOTS", "2020-01-09T19:49:16.000Z": "(2/3) As we look even further ahead, I strongly believe it's incentives, not penalties, which will help us transition more quickly... My budget will propose more incentives and a greater focus on affordable, clean energy... #VTSOTS", "2020-01-09T19:45:59.000Z": "(1/3) We know about half of the emissions that contribute to climate change come from transportation. That's why we've also worked together to make it more affordable to purchase electric vehicles. #VTSOTS", "2020-01-09T19:45:29.000Z": "(2/2) And, when paired with my proposed investments in housing & economic development, will support more vibrant, walkable & livable downtowns & villages which, as the Speaker has said, supports economic growth & is a critical piece of our work to combat climate change. #VTSOTS", "2020-01-09T19:45:11.000Z": "(1/2) I also appreciate the sense of urgency Speaker Johnson and others have placed on modernizing Act 250 The balanced approach we're working on would enable concentrated development where people want to live & work. #VTSOTS", "2020-01-09T19:44:40.000Z": "Because of the economic imbalance from region to region, I still hear about the difficulty of finding an affordable place to live. That's why my budget will include a package to revitalize existing homes and build more of them, targeted to the places that need it most. #VTSOTS", "2020-01-09T19:41:28.000Z": "I propose to you today that we begin creating a universal afterschool network that ensures every child has access to enrichment opportunities outside of current classroom time, and to align the students' day with the length of the workday. #VTSOTS", "2020-01-09T19:39:28.000Z": "(2/2) Because, ultimately, we need to help people in all parts of the state move up the economic ladder, and the best way to do this is to level the economic playing field and make Vermont more affordable for all families and every business. #VTSOTS", "2020-01-09T19:39:09.000Z": "(1/2) Overall tax and fee burden is still growing far too fast, especially property taxes, and you can expect additional targeted tax relief in my budget. #VTSOTS", "2020-01-09T19:38:20.000Z": "(3/3) my budget will include additional investments in training, with an emphasis on the trades and more incentives for young adults and working-age families to stay or move here. #VTSOTS", "2020-01-09T19:38:05.000Z": "(2/3) And we're helping those in recovery or with other barriers to employment find and keep good jobs... In partnership with @VermontSOS let's further reduce hurdles and costs for licensed professionals so we can bring more of them into the workforce. #VTSOTS", "2020-01-09T19:37:46.000Z": "(1/3) We're strengthening training, internship & apprenticeship programs for VTers. We established a first-in-the-nation approach to make it easy for veterans to transition to civilian careers. #VTSOTS", "2020-01-09T19:37:29.000Z": "(2/2) We know this isn't the only answer, but this program is a small step towards growing our way out of the demographic crisis facing our state and the affordability crisis facing our families. #VTSOTS  @VTEconDev", "2020-01-09T19:36:13.000Z": "(1/2) Since [the launch of the remote worker incentive], we've received worldwide attention, more than $7 million in free advertising, thousands of inquiries and relocated 371 people to more than 68 communities across 13 counties. #VTSOTS  @VTEconDev", "2020-01-09T19:35:40.000Z": "(3/3) ...then our businesses and economy will grow, putting more kids in our schools and broadening our tax base, making our communities stronger and more resilient than ever before. #VTSOTS", "2020-01-09T19:35:25.000Z": "(2/3) ...if we focus on the fundamentals: a better, more modern government, a stronger fiscal foundation and policy that's truly equitable... #VTSOTS", "2020-01-09T19:35:13.000Z": "(1/3) If we're willing to focus on doing the work, on caring more about the details than we do the talking points; if we can build consensus and trust and avoid national political agendas deliberately designed to divide us... #VTSOTS", "2020-01-09T19:34:24.000Z": "Sustainable, economic growth has become too hard & too rare in too many areas. It's hurting people. It's regressive. It's creating regional inequity. And it's by far the biggest & most immediate challenge to our state & the ability of government to help shape the future. #VTSOTS", "2020-01-09T19:33:43.000Z": "This is what a demographic crisis looks like. In too many places, and in the lives of too many Vermonters, I see and feel the emotional and financial toll of policies built for a few areas in the state that can afford them when the rest of the state cannot. #VTSOTS", "2020-01-09T19:33:04.000Z": "From county to county, there's a huge gap between median home values, median household income, average wage & so much more... across the state, we're feeling the negative impacts in everything from our homes, schools & colleges to our hospitals & nursing homes. #VTSOTS", "2020-01-09T19:32:26.000Z": "Of the five towns that have seen the most growth in recent years, four of them are in Chittenden County. And in the past 12 years, only three counties have added workers. The other 11 have lost a total of about 18,000. #VTSOTS", "2020-01-09T19:31:56.000Z": "Today in Vermont, there are about 55,000 fewer people under the age of 45 and 44,000 more over the age of 65 than there were in the year 2000. For years, we had more deaths than births, and have seen more people move out of Vermont than in. #VTSOTS", "2020-01-09T19:31:10.000Z": "(2/2) So, even as we face major challenges, these Vermonters show that in the hands of our people, doing all they can every day, the state of the state is strong. #VTSOTS", "2020-01-09T19:30:52.000Z": "(1/2) These people and thousands more-those we hear about and those we don't-remind us that we are all part of something bigger, and that it's in our pursuit of purpose and in service to others that we find the best of ourselves, our communities, our state and our nation. #VTSOTS", "2020-01-09T19:28:16.000Z": "The state of the state, our values and identity are guided by-but have never been defined by-what happens in this building. It's the people of Vermont, doing all they can to lift each other up, who will shape our future. They define who we are and all we can be. #VTSOTS", "2020-01-09T19:27:33.000Z": "While good things are happening and progress is being made, too many of our counties, communities and families remain at a critical crossroad. The fact is, where we are as a state, and where we go from here, is in the hands of every Vermonter. #VTSOTS", "2020-01-09T19:26:51.000Z": "This, my fellow Vermonters, is how we rise above partisanship, how we reject polarization, how we work toward something bigger than ourselves and how we-all of us in this room-can best lead our nation forward. #VTSOTS", "2020-01-09T19:25:57.000Z": "In state houses and town halls across America, it's up to us to show that people from different backgrounds, with different points of view, can unite around our core values and our common humanity. #VTSOTS", "2020-01-09T19:05:11.000Z": "As elected officials, it's our duty to distinguish what must be done from what we might like to do, and to work together, pulling in the same direction, to make a difference for those we serve. #VTSOTS", "2020-01-09T17:56:03.000Z": "My team will be live tweeting my State of the State address this afternoon. Follow along with #VTSOTS and on my Facebook live stream: http:// bit.ly/2QUli2z", "2020-01-07T14:03:23.000Z": "It's not the start of the legislative session until Senator Mazza delivers coffee.", "2020-01-02T16:42:08.000Z": "Thank you to @TimesArgus for reminding us of all the ways (big and small) we can be better neighbors and role models as we enter the New Year. Be nicer The following editorial appeared one year ago today. With one adjustment, we allow the message to speak for itself - again. timesargus.com", "2020-01-01T13:47:16.000Z": "Happy New Year, Vermont!", "2019-12-31T18:52:53.000Z": "Congrats to Vermonter Ryan Cochran-Siegle on his career best performance in the men's Alpine Combined this week in Bormio, Italy! Quote Tweet Vermont Agency of Commerce & Community Development @VTEconDev Vermont native Ryan Cochran-Siegle skied to a career-best result by placing fifth during Sunday's alpine combined World Cup skiing event. https:// bit.ly/36cnglc", "2019-12-30T18:38:56.000Z": "As the inclement weather continues into tomorrow, it's important for Vermonters to use caution on roadways and prepare for possible power outages. Follow @vemvt for updates and safety tips. http:// bit.ly/36bwe2g", "2019-12-30T15:16:55.000Z": "With all this fresh snow, it's a great time to get out on Vermont's amazing snowmobile trails! Thanks to @VTVast for helping riders enjoy this season safely! Quote Tweet Vermont Tourism @VermontTourism Over 5,000 miles of trails await in Vermont. Check out how Vermont Association of Snow Travelers gets their trails ready for snowmobiling, then find your next snowmobiling spot. #findyourpeakvt  #thisisvt", "2019-12-27T18:09:57.000Z": "I often say the way we treat each other matters because our kids are watching. But kids like Justin, who raised $900 to help pay off his classmates' school lunch debt, remind us they also have a thing or two to teach us about caring for our fellow VTers. Colchester boy's Christmas gift to classmates: Paying off their lunch debt \"Receiving, I don't think, is as good as giving to people.\" mychamplainvalley.com", "2019-12-26T19:09:55.000Z": "To those Vermonters celebrating the first day of Kwanzaa today, I wish you a joyous holiday filled with friends and family.", "2019-12-25T16:14:38.000Z": "Wishing all Vermonters a very Merry Christmas!", "2019-12-24T00:32:05.000Z": "Happy Hanukkah! https:// governor.vermont.gov/press-release/governor-phil-scott-wishes-vermonters-happy-hanukkah ", "2019-12-22T14:56:26.000Z": "(1/3) The holiday season is an important time to pause & spend time with family and friends.  As I've noted before, at a time when our country feels so divided, it's important to reflect on what unites us - and the role that this unity plays in making our state a better place.", "2019-12-18T20:22:34.000Z": "Today I issued the following statement in appreciation of @SenatorLeahy 's work on the bipartisan, bicameral funding agreement reached in the U.S. Congress:", "2019-12-18T19:04:32.000Z": "Read my statement following the Trump Administration's notice of public rulemaking on the safe importation of prescription drugs here:", "2019-12-17T21:49:38.000Z": "Finishing off our Chittenden County #VTCapitol4aDay a mental health and public safety roundtable. I'm grateful for @HowardCenterVT & local law enforcement and first response agencies for their work to protect our most vulnerable through prevention and keep our communities safe.", "2019-12-17T20:54:05.000Z": "Growing our workforce/making VT more affordable requires us to confront housing availability needs head on. Our work to modernize permit procedures/support market-driven development, projects like Williston's Finney Crossing allow more families to live/work in VT #VTCapitol4aDay", "2019-12-17T19:41:57.000Z": "Burlington Tech Center's Aviation & Aerospace Technology program gets students out of the classroom & into a real hanger at @BTVAirport to learn industry skills & earn an FAA Mechanic Certificate, preparing them for exciting careers w/ great employers here in VT! #VTCapitol4aDay", "2019-12-17T18:43:28.000Z": "A great lunchtime round table discussion with young VTers on vaping & substance use prevention. Thanks to all the students, public health/education professionals & government agencies who participated in the conversation! @healthvermont  @VTEducation  #VTCapitol4aDay", "2019-12-17T16:58:36.000Z": "Burlington's McNeil Generating Station uses wood chips to provide sustainable electrical energy to residents and support green collar jobs throughout Vermont's forestry and logging sector. Thanks to @BurlingtonElec for the tour! #VTCapitol4aDay", "2019-12-17T15:26:25.000Z": "Infrastructure projects like Exit 17 in Colchester are important to VTers safe, daily transportation needs. Streamlining permitting procedures will help combat rising costs and extended timelines for critical public construction and protect VT's natural beauty. #VTCapitol4aDay", "2019-12-17T15:11:49.000Z": "Our Chittenden County Capitol for a Day is off to a great start! Thanks to Vermont SportsCar for hosting our cabinet meeting at their Milton shop! #VTCapitol4aDay", "2019-12-17T14:21:54.000Z": "Great to be on Marcus and Kurt on @NewsTalkWVMT bright and early this morning, joined by Education Secretary @danfrench and Administration Secretary Susanne Young for our Chittenden County #VTCapitol4aDay . Quote Tweet Newstalk WVMT @NewsTalkWVMT @GovPhilScott is our guest this morning after the 7am news.", "2019-12-15T14:33:59.000Z": "Always a pleasure to attend the annual Pomerleau Family Holiday Party at the Eastside Restaurant & Pub in Newport. This event welcomes over 300 people and supports families in need. Thanks to the Pomerleau family and all who make this event possible each year.", "2019-12-13T22:03:20.000Z": "Redevelopment of unusable commercial sites like the former Robertson Paper Co. in Bellows Falls provides new homes for companies to expand or relocate & boosts local economies. Thanks to all the Brownfield Economic Revitalization Alliance partners who made this project a reality!", "2019-12-13T20:08:18.000Z": "General stores are hubs of many VT communities & thanks to hardworking W. Windsor residents, the once closed Brownsville General Store found new life in the 2018 opening of Brownsville Butcher & Pantry w/ the help of state tax credits/grants. Pleased to celebrate w/ them today!", "2019-12-13T12:23:53.000Z": "When Union Elementary second graders visited my office, and stopped to read our sign about civility, it was an important reminder that our kids are watching, and we must set a good example!", "2019-12-11T19:51:38.000Z": "Suicide is a public health issue that affects too many of our veterans. My team, @VTNationalGuard & @WRJ_VAMC are reaching out to vets, service members & families about resources available to help. For 24/7 support: 800-273-8255 or http:// veteranscrisisline.net . New coordinated push to help veterans at risk of suicide Gov. Scott: \"There is hope and there is help\" mynbc5.com", "2019-12-10T16:37:23.000Z": "Flu season is upon us and the best way to prevent it is getting your flu shot! Find out where to get a flu shot near you: http:// bit.ly/36oEStI  #FightFlu", "2019-12-10T13:58:48.000Z": "I was touched by the story of retired trooper, Kurt Wagenbach, during yesterday's First Responder Wellness Conference. These heroes often suffer physical & mental trauma as a result of serving our communities & we must work together to support them in getting the help they need.", "2019-12-08T20:30:00.000Z": "Some little elves from Union Elementary School helped us decorate our office Christmas tree on Friday. Thank you to Ms. Reed, Ms. Quinn and their second graders for visiting, and for talking to me about kindness as well as listing a few of our favorite things.", "2019-12-08T17:09:30.000Z": "Thomas Paine from Paine's Christmas Trees says, \"It's nice to slow down to make memories.\" I couldn't agree more, and Vermont's tree farms offer a great opportunity to do just that during the holiday season. Quote Tweet Vermont Tourism @VermontTourism It's not going in the yard, Russ. It's going in the living room. Go virtual Christmas tree cutting with @GovPhilScott and Tom Paine of Paine's Christmas Trees, then grab your family and find your own tree to trim at any of Vermont's 70 tree farms. #thisisvt  #findyourpeakvt", "2019-12-07T15:26:31.000Z": "#PearlHarborRemembranceDay", "2019-12-05T01:44:42.000Z": "Today I joined Barre City officials to welcome @AOTVermont workers to their new HQ. Thanks to the VTrans employees who take time away from their family and friends during the holidays to help VTers travel safely & thanks to the Barre community for welcoming VTrans with open arms! Quote Tweet Vermont Agency of Transportation @AOTVermont Thanks to The Barre Partnership, the Barre Area Development Corp, and City of Barre, VT - City Government for such a warm reception and welcoming to the community.\n\nAnd a special thanks to Delicate Decadence for the treats! Show this thread", "2019-12-03T19:50:00.000Z": "Today is #GivingTuesday ! The holiday season reminds us of what's important: our family, friends and neighbors. While we don't have to wait for a special time of year to give back to others, this is a great reminder for us to embrace the Vermont spirit of service and community.", "2019-12-02T23:38:05.000Z": "Thanks to all who put on this important summit, as we work to eliminate barriers to employment for all.", "2019-12-02T23:38:01.000Z": "Today I had the opportunity to hear Travis Roy ( @TROY1424 ) tell his incredible story of triumph over tragedy at the Summit on the Employment of People with Disabilities. His hope, optimism and courage are an inspiration for all of us.", "2019-12-01T19:36:53.000Z": "...and celebrating the Light the Lights ceremony at the Joseph Smith Birthplace Memorial in South Royalton.", "2019-12-01T19:36:46.000Z": "...joining the festivities at Church Street's Annual Tree Lighting in Burlington", "2019-12-01T19:36:41.000Z": "...including cutting Christmas trees for my office and home at Werner Tree Farm in Middlebury...", "2019-12-01T19:36:11.000Z": "The holiday season is a time of year to take note of the good and unite around the true meaning behind each of the season's traditions: togetherness, community and hope.\n\nIt was great to join in a number of celebrations this weekend...", "2019-11-30T22:16:45.000Z": "What a perfect day in Killington for the Women's Ski World Cup. Great to meet @mikaelashiffrin , who attended Burke Mountain Academy. If you couldn't make it today, don't worry - there are events tomorrow too! Quote Tweet FIS Alpine @fisalpine 0:53 KillingtonMtn has had the largest crowd on the World Cup in 2019, is it going to be as successful as last year or even more? One day to go so rev your engines, guys! #beast365  #fisalpine", "2019-11-30T13:21:48.000Z": "I've signed a proclamation making today Small Business Appreciation Day in Vermont. Buying local is a great way for Vermonters to support Vermonters. By shopping local this holiday season, together, we can help strengthen our small businesses and communities. #thinkVT  #shopsmall", "2019-11-29T20:47:05.000Z": "Special thanks to Ludlow Fire Dept. which helped save Thanksgiving for a local family. They went above & beyond the call of duty. Thanks for being a great example of neighbors helping neighbors. That's the VT way #VtActsOfKindness  #VtPartOfSomethingBigger Ludlow firefighters save Thanksgiving for one family A Ludlow family gets to enjoy Thanksgiving thanks to their local fire department. wcax.com", "2019-11-28T13:47:58.000Z": "", "2019-11-28T13:47:57.000Z": "", "2019-11-28T13:47:56.000Z": "", "2019-11-28T13:47:55.000Z": "I want to wish all Vermonters a happy and safe Thanksgiving Day and holiday weekend. View my full statement here: https:// bit.ly/2DvgU3z and see thread:", "2019-11-27T18:56:08.000Z": "As @VTAgencyofAg Secretary @anson_ag shares in his article below, farmers help keep Vermont running. As we enjoy our Thanksgiving meals tomorrow, it's a great time to stop and appreciate the Vermont farmers who help produce food throughout the year. Quote Tweet VTAgencyofAg @VTAgencyofAg Secretary Tebbetts Op-Ed: Giving Thanks For Vermont Farmers, Friends and Food. https:// agriculture.vermont.gov/agency-agricul ture-food-markets-news/giving-thanks-vermont-farmers-friends-and-food   #VT  #ThinkVT", "2019-11-26T22:24:17.000Z": "My statement on the passing of Jim Reardon, a true public servant.", "2019-11-25T02:50:28.000Z": "I had the pleasure of flying from Dulles w/ this WWII Vet from Stowe. There was confusion about how he was getting home from the airport. But he knew Rep @HeidiSVT so I called her & together we sorted it out. As I told him, we weren't going to leave him behind #GreatestGeneration", "2019-11-19T15:00:19.000Z": "Wish you lived in VT? Us too. Get ready for the next round of Stay to Stay weekends featuring @NewportVT , @ChamberofBenn , @BrattleboroONE and @downtownrutland , with time @jaypeakresort , @BromleyMountain , @mountsnow and @KillingtonMtn . More: https:// bit.ly/2KMiXCL . #thisisvt", "2019-11-21T19:04:24.000Z": "My statement on the passing of Jake Burton Carpenter. #RideonJake", "2019-11-19T18:29:03.000Z": "Anyone who has worked on the 5th floor over the last 13 years knows Cheryl Prevost, and can understand why we'll all miss her after she retires this week. Thank you, Cheryl, for your years of service, your sense of humor and your hard work. Congratulations on your retirement.", "2019-11-18T22:00:55.000Z": "#VTCapitol4aDay allows us to see so many unique and impressive Vermont businesses. Today it brought us to Boundbrook Farm - a rice farm with 5.5 acres of irrigated rice paddies in Vergennes.", "2019-11-18T21:51:42.000Z": "Good work being done at the Addison County Solid Waste District Transfer Station, where we heard about the region's successful recycling efforts for #VTCapitol4aDay", "2019-11-18T19:46:13.000Z": "Thank you to the @addyindy for sitting down with my team to discuss education, healthcare, downtown development and housing, clean water, dairy farms and more. #VTCapitol4aDay", "2019-11-18T18:12:19.000Z": "It's always so helpful to hear from small business owners during #VTCapitol4aDay . Thanks to @CommunityBarn , @acedc1 , @ACCOCVT , and all who participated. Small businesses are the backbone of Vermont's economy and are important employers driving economic opportunity for Vermonters", "2019-11-18T16:57:40.000Z": "It's hunting season, so no #VTCapitol4aDay visit would be complete without a visit to a local checking station. Thanks to Rack 'N Reel for also letting me test out a crossbow.", "2019-11-18T15:48:17.000Z": "Most importantly, I want to thank the @hubteencenter and the students who shared their perspective and experience. #VTCapitol4aDay", "2019-11-18T15:48:14.000Z": "Prevention is so important when it comes to substance misuse and it's an area of focus for my administration. Thanks to @healthvermont , @unitedway_AC and many other community partners for this informative discussion as part of #VTCapitol4aDay .", "2019-11-18T13:57:49.000Z": "We've kicked off our Addison County #VTCapitol4aDay at Bristol Works! Great to see their commitment to a project that will provide economic opportunity, smart growth, jobs, housing and community services in the region, and learn what the state can do to support this work.", "2019-11-16T20:03:42.000Z": "Great to join George Woodard, Bill Torrey, Dana Jewell and others to kick off hunting season at ABCD deer camp in Duxbury. Wishing everyone a safe and successful season.", "2019-11-16T16:09:12.000Z": "The #USMCA will help VT businesses and farmers - who already export more than $1.3B to Canada and Mexico - cut red tape, better tap into foreign markets, protect IP and get better prices. Congress should ratify the #USMCAnow", "2019-11-13T17:49:13.000Z": "What a great day in Middlebury for our 8th Regional Workforce Development Summit! These events are bringing together Vermonters who are speaking up with real solutions to our workforce crisis.", "2019-11-11T17:24:57.000Z": "Our veterans have answered the nation's call to protect freedom and liberty here at home and around the world. Their commitment to our values and way of life serves as the greatest example of what it means to be American. It was an honor to recognize their service today in Barre.", "2019-11-11T13:00:00.000Z": "Today, and every day, I say thank you to all our veterans. Full statement:", "2019-11-08T16:53:02.000Z": "With Veterans' Day approaching, Ludlow Elementary School set a great example, holding an assembly for students to give thanks to those who served, and remember those who didn't make it home. It was an honor to be there and share my gratitude for our veterans.", "2019-11-06T20:47:00.000Z": "Great to attend our 7th Regional Workforce Development Summit in Washington County at @Sugarbush_VT today. Workforce development is economic development. #GrowTheWorkforce", "2019-11-05T21:13:53.000Z": "It's not every day you get to meet an American hero like Sidney, a 100 year old WWII veteran who's made it his mission to share the story and sacrifice of his generation with younger Americans on his No Regrets Tour. Learn more about Sidney's journey at http:// gosidneygo.com", "2019-11-05T19:10:23.000Z": "Nurse practitioners play a vital role on the front lines of our health care system and, like many professionals, we need more of them in our state. I'm happy to recognize their hard work and contributions by proclaiming November 10-16 as Nurse Practitioners Week in Vermont.", "2019-11-02T22:26:49.000Z": "I want to thank all the state and local public safety, road and utility crews who are out working hard to recover from this storm and keep Vermonters safe. Follow @vemvt and @AOTVermont for updates.", "2019-11-02T22:24:58.000Z": "And our final stop was in Bakersfield, where we saw some major road damage.", "2019-11-02T20:03:12.000Z": "The river is running very strong in Enosburgh", "2019-11-02T18:27:20.000Z": "At the Richford temporary bridge installation.", "2019-11-02T17:10:49.000Z": "Now in Montgomery, you can see it was hard-hit.", "2019-11-02T16:51:08.000Z": "We're on to Paronto Road in Eden as we survey the damage from Thursday's storm.", "2019-11-02T14:52:24.000Z": "A warming center has been opened at the First Baptist Church, 62 Crescent Street, South Londonderry. Open NOW until 5PM, 11/2/2019. Open to the general public. Contact number to the warming center is 802-824-6046.", "2019-11-02T12:29:20.000Z": "Flood Warnings persist on the Missisquoi River at East Berkshire, Lamoille River at Jeffersonville, Barton River near Coventry. Don't drive on a flooded or closed roads, respect all detours!", "2019-11-02T16:11:39.000Z": "First stop in Johnson to see the Scribner Bridge.", "2019-11-02T16:07:15.000Z": "As we recover from this week's storm, I'll be touring some of the damage around the state with @vemvt , @AOTVermont and local officials. We're visiting Johnson, Eden, Montgomery, Berkshire, Richford, Enosburgh, Bakersfield, Cambridge and Stowe to see response and recovery efforts.", "2019-10-31T18:12:02.000Z": "Trick or treating in bad weather can present some safety concerns. We have some tips to stay safe, on Halloween night. #VTWXSafety", "2019-10-31T12:28:02.000Z": "Happy Birthday to my dog Tucker. He's a Halloween pup and is \"unlucky\" 13 this year, but I feel pretty lucky to have him as one of my most faithful friends for all these years.", "2019-10-31T12:08:41.000Z": "Happy Halloween . We've already started celebrating here in the office.", "2019-10-29T23:55:06.000Z": "A tour of the world-famous @hillfarmstead - a North Greensboro-based business with global recognition for its craft brews - was a great way to cap off our Orleans County #VTCapitol4aDay .", "2019-10-29T23:12:11.000Z": "Pleased to present a 2019 Spirit of the ADA Award to EM Brown & Son to celebrate their commitment to hiring & supporting employees with disabilities. #VTCapitol4aDay", "2019-10-29T19:16:32.000Z": "Coventry Village School boasts the best school lunch in Vermont and I might have to agree. Thanks to my tour guides for showing off their school and to all the teachers, students and staff for hosting us. #VTCapitol4aDay", "2019-10-29T14:23:54.000Z": "The Newport Early Childhood Center shows us what's possible when local partners come together and think outside the box. Not only will the new center provide early care & learning for 70+ kids, it also provides job training for women with barriers to employment #VTCapitol4aDay", "2019-10-29T12:40:00.000Z": "A unique venue for our cabinet meeting to kick off Orleans County #VTCapitol4aDay ! Thanks to the Memphremagog Community Maritime and @VTLakeCruises for hosting us on the Northern Star!", "2019-10-25T19:01:13.000Z": "Great to kick off the @FBLAVT & @VermontDECA Fall Leadership Conference this morning at the State House! Proud to have this group of young leaders representing our state and carrying on the Vermont tradition of innovation and entrepreneurship.", "2019-10-24T22:18:59.000Z": "These tires are @VTDMV inspected, approved, and ready to serve YOU! \nIf you have tires hanging out at your house, you can put them to (very) good use by donating them to Wheels for Warmth tomorrow and Saturday: http:// wheelsforwarmth.org  #VT  #btv  #ThisIsVT  #giveback", "2019-10-24T18:45:34.000Z": "Hunting & fishing are important to our culture and economy. Thanks to @VTFishWildlife , store owners, hunting & angling groups and other supporters of outdoor recreation for joining me today to highlight and encourage participation in these activities https:// bit.ly/2qIm5u3", "2019-10-23T20:32:39.000Z": "Happy to welcome Japanese students to the State House today as a part our Vermont-Tottori sister state partnership! Thanks to Green Across the World and all who have helped make this cultural exchange possible.", "2019-10-20T16:37:42.000Z": "Happy #NCW everyone! As we also celebrate 150 years of the periodic table, @AmerChemSociety 's Green Mountain Local Section thanks @GovPhilScott for a #iypt2019 proclamation IYPT and Government - American Chemical Society American Chemical Society: Chemistry for Life. acs.org", "2019-10-18T18:52:23.000Z": "Today I joined NVDA, @VTLabor & @VT_WFDBoard at the Lyndon Regional Workforce Dev. Summit to talk w/ local employers, educators & service providers about actionable strategies to meet our state's current & future workforce needs. Learn more: http:// bit.ly/2MPheP4", "2019-10-16T20:59:11.000Z": "Partners like @UCSVT & Head Start in Bennington do great work serving kids/families. Pleased to celebrate the expansion of Bennington Recreation Ctr w them today. Affordable care is so important & we've prioritized it: increasing investment in childcare assistance programs by 30%", "2019-10-14T14:35:00.000Z": "I'm proud to proclaim Oct. as Careers in Construction Month. Trade and construction professions are important to our economy, and are yet another sector of our workforce we must grow. That's why we've invested in trades training & career & technical education centers across VT.", "2019-10-12T13:04:10.000Z": "Yesterday I visited a hidden gem in Milton for the ribbon cutting of a new Subaru Motorsports USA HQ right here in Vermont. Thanks @subarums_usa for a great visit and I enjoyed meeting motorsports legend @TravisPastrana . @ Matthew Stryker", "2019-10-10T17:55:37.000Z": "Since 2016, we've seen a 25% drop in workers' comp rates in the logging industry. The VT Logger Safety & Workers' Comp Insurance Program builds on that success, offering a 15% premium credit to logging employers who improve & maintain job site safety. http:// bit.ly/33fezVq", "2019-10-09T16:36:21.000Z": "Want to learn more about smart financial investing during #FinancialPlanningMonth ? Join @VermontDFR and the @FINRAFoundation tomorrow, October 10 at the Delta Hotel in South Burlington for a free Investor Forum and dinner. Register now: http:// bit.ly/2p8DNpW", "2019-10-08T02:25:31.000Z": "Yes, that was me at the Cowboys game with George W. Bush over the weekend. Here's the whole story.", "2019-10-07T20:57:33.000Z": "Today, we opened the East Richford-Sutton International Bridge. Local crossings like this benefit rural communities, allowing for cross border commerce, shared services & access to outdoor rec. This is important to strengthening our relationship w/Quebec https:// governor.vermont.gov/press-release/governor-phil-scott-and-quebec-officials-attend-historic-east-richford-sutton ", "2019-10-05T14:00:01.000Z": "", "2019-10-03T19:49:24.000Z": ". @UVMVermont has a $1.3B economic impact for VT and supports over 11,000 jobs, while playing a critical role in training and educating our future workforce. This positive impact will continue to grow under Pres. @SVGarimella and it was great to be a part of his installation today", "2019-10-03T16:23:21.000Z": "It's always a good day when we can welcome a new business to Vermont. Yesterday, we celebrated MITI Manufacturing's new St. Johnsbury facility, which brings new jobs to the area and adds to Vermont's strong manufacturing sector https:// governor.vermont.gov/press-release/governor-phil-scott-welcomes-canadian-company-miti-manufacturing-vermont ", "2019-10-02T20:22:41.000Z": "Today I joined recipients of the 2019 Downtown & Village Center Tax Credits in St. Johnsbury. These credits will help 14 Vermont communities fund 24 projects to revitalize historic hubs, create housing to attract working families and help businesses expand and create jobs.", "2019-10-02T14:02:47.000Z": "Yesterday, @VTAttorneyGen & I teamed up w/ @AARPVT to get the word out to our fellow VTers about phone fraud & scam prevention. Thanks to the volunteers helping protect VT's most vulnerable & remember: never give out personal/financial info over the phone. Gov. Scott and AG Donovan join forces to warn AARP members of scammers AARP holds call-a-thon mynbc5.com", "2019-09-27T19:41:14.000Z": "The RDCs of VT (in partnership with @VTLabor & @VT_WFDBoard ) are hosting 12 Regional Workforce Development Summits this fall to develop strategies for better serving all VT workers and employers. Learn more and register at Home | VT Workforce Summits vermontworkforce.com", "2019-09-25T00:48:28.000Z": "We rounded out a great Bennington County #VTCapitol4aDay with the Vermont ATV Sportsman's Association and an ATV ride in Woodford. Outdoor recreation sets Vermont apart, and we are working to leverage these assets to bring more working families, visitors and jobs to the state.", "2019-09-24T19:54:24.000Z": "Property taxes are a major expense for Vermonters. Thanks to Bennington community members who came out to hear from @VTDeptTaxes & @VTEducation about the factors that drive these costs, including local school budget votes. #VTCapitol4aDay", "2019-09-24T18:42:04.000Z": "I consistently hear about a need for housing that's affordable for working Vermonters, which is why we made the largest investment in housing in state history. I'm so pleased to see Lake Paran Village, funded in part through our housing bond, break ground today #VTCapitol4aDay", "2019-09-24T16:56:23.000Z": "Thanks to @UCSVT , @healthvermont , Dept. of Mental Health, regional providers and loss survivors for an incredibly important discussion about ways to work together on suicide prevention and access to mental health services in Bennington County and across the state. #VTCapitol4aDay", "2019-09-24T14:59:03.000Z": "Thanks to the @banner_news and @ManJourn for sitting down with me and my team during our Bennington County #VTCapitol4aDay . I appreciate the opportunity to talk about our work and the regional challenges surrounding workforce, higher education, housing and the environment.", "2019-09-24T13:24:34.000Z": "Thanks to Representatives Browning, James, Sibilia, and Pajala for joining us this morning.", "2019-09-24T13:24:33.000Z": "And we even got some fly fishing in", "2019-09-24T13:24:22.000Z": "Thanks to the Orvis team for a tour of their facility, where they handcraft Vermont-made fly fishing rods", "2019-09-24T13:24:16.000Z": ". @OrvisFlyfishing and @TheOrvisCompany employ 62 people in its Manchester manufacturing facility and 350 statewide, making it a great place to start our Bennington County #VTCapitol4aDay", "2019-09-23T17:01:28.000Z": "Had a great time on Vermont Day at @TheBigEFair this weekend! Proud of all the Vermonters representing the best of our state's agricultural products and traditions.", "2019-09-21T15:29:53.000Z": "Norwich University is a leader in providing higher education for members of our military and civilian students, and I was so honored to celebrate #Norwich200 last night with faculty, alumni, students and families. Quote Tweet Norwich University @norwichnews Gov. Scott: Norwich diploma is more than a degree. It's an experience. Creating people of integrity. #Norwich200  #NUHomecoming", "2019-09-20T21:52:38.000Z": "Today I joined veterans and their families at Camp Johnson to mark POW/MIA Recognition Day, honoring nearly 140,000 Prisoners of War and remembering the many Americans still missing. They have my deepest respect and gratitude.", "2019-09-19T18:57:23.000Z": "Creating greater opportunities for all Vermonters means understanding the impact of policies on all Vermonters. Thanks to our Executive Director of Racial Equity Xusana Davis for the first of many conversations on how we can expand equity in Vermont.", "2019-09-19T18:49:40.000Z": "Today we saw the arrival of F-35s in Vermont - an important mission for the @158FighterWing , which benefits Vermont's economy and our nation's security. See my full statement:", "2019-09-18T15:50:30.000Z": "This grant will help sustain/enhance VT's dairy farms & help farm families innovate as the industry evolves. I appreciate our congressional delegation's continued support of VT's dairy sector/farms & look forward to working together to strengthen VT dairy statewide @VTAgencyofAg Quote Tweet Sen. Patrick Leahy @SenatorLeahy BREAKING - Leahy: #Vermont Tapped To Receive Grant To Create A #Dairy Business Innovation Initiative https:// leahy.senate.gov/press/leahy-ve rmont-tapped-to-receive-grant-to-create-a-dairy-business-innovation-initiative ", "2019-09-14T00:13:56.000Z": "September 14-22 is #NationalDriveElectricWeek ! We're working to make EVs and charging stations more affordable and accessible for Vermonters and reduce our greenhouse gas emissions. Visit http:// driveelectricweek.org for more info and to find events near you!", "2019-09-13T15:41:05.000Z": "VT companies are seeking new ways to recruit/train employees. @vttech & @CCV_VT partner w/ employers like @GLOBALFOUNDRIES  @GWPlasticsInc  @UVMHealth_CVMC  @McDonalds to develop/offer tailored training programs that provide good jobs/opportunity to VTers. Governor Phil Scott on Facebook Watch WATCH NOW: Governor Scott's Weekly Press Conference facebook.com", "2019-09-11T20:45:28.000Z": "", "2019-09-09T15:01:18.000Z": "On Sat., we dedicated the Memorial Walkway at the VT Veterans Memorial Cemetery to BG Mike Heston. He cared so much about this place & was key in securing its expansion- yet another example of how he always went above & beyond the call of duty to look out for his fellow soldiers.", "2019-09-08T17:54:35.000Z": "Thanks to those across state government - including @VTEducation , @vermontlib , @vtlabor , @healthvermont , @vtstatepolice , agencies of human services and administration, and dept. of public safety - for joining. #vtpride", "2019-09-08T17:54:32.000Z": "Diana and I had a great time walking in the #PrideVT Parade today. Vermont and the Scott Administration support LQBTQ+ rights and accept all in the Green Mountain State.", "2019-09-06T19:45:01.000Z": "Congratulations to all of the @VTStatePolice officers who were recognized at today's awards ceremony! Thank you for the sacrifices you make every day to protect and serve Vermonters.", "2019-09-06T17:08:10.000Z": "I was honored to attend the 52nd reunion of the 321st Transportation Co who served in Vietnam. Thank you for your bravery & service, & special thanks to their late commander, 1LT F. John Lake of South Hero, who invited me to be a part of this special gathering before his passing.", "2019-09-04T17:56:48.000Z": "With the basing of a new division in Essex, @BlodgettOvenCo is bringing dozens of new jobs to Vermont. This is a great success story, which shows Vermont is open for business! https:// essexreporter.com/blodgett-ovens -parent-company-to-bring-new-division-to-essex/ ", "2019-09-04T16:25:15.000Z": "Thanks to the @BlodgettOvenCo team for showing me around their amazing facility in Essex Jct! The VT Employment Growth Incentive (VEGI) program helps manufacturers like Blodgett expand their operations and create good jobs for Vermonters. Learn more at http:// bit.ly/2lBHouU", "2019-08-28T16:33:34.000Z": "See my statement on the 8th anniversary of Tropical Storm Irene #VTStronger", "2019-08-28T13:07:06.000Z": "The Boston @RedSox have brought the 2018 World Series Championship trophy to Vermont! For all the loyal Vermont fans out there, you can stop by to see the trophy at several locations today and tomorrow. #GoSox", "2019-08-25T14:21:36.000Z": "As we mark the anniversary of Senator John McCain's death, his family has asked we honor him through #ActsOfCivility . I reflected on his legacy of civility upon his death, which I'm reposting now because it's just as relevant today. https:// governor.vermont.gov/governor-scotts-blog/its-time-come-together-and-rise-above-it ", "2019-08-20T21:21:48.000Z": "OK last one, I promise: A little fishing at Knight Point State Park to wrap up a reel-y great Grand Isle #VTCapitol4aDay ! @VTStateParks", "2019-08-20T21:21:44.000Z": "Here's another one: A little fishing at Knight Point State Park to wrap up our fin-tastic Grand Isle #VTCapitol4aDay ! @VTStateParks", "2019-08-20T21:21:40.000Z": "O-fish-ally wrapping up our Grand Isle #VTCapitol4aDay with some fun at Knight Point State Park. @VTStateParks", "2019-08-20T19:09:40.000Z": "In North Hero we discussed taxes, Act 250 & economic development. We heard about the need for relief to spur growth. This year, we rolled back Land Gains Tax & boosted Downtown Tax Credits to do just that. I've also proposed modernizing Act 250 to foster growth. #VTCapitol4aDay", "2019-08-20T17:29:39.000Z": "Thanks to the team at the Grand Isle Emergency Operations Center for all you do to protect the Vermonters in your community! And, of course, thanks for the #VTCapitol4aDay tour and lunch!", "2019-08-20T16:04:46.000Z": "And kudos to the community for donating clothes and toiletries to support their neighbors in need.", "2019-08-20T16:04:38.000Z": "Next stop for #VTCapitol4aDay : Alburgh Community Education Center, which will offer childcare. My administration has prioritized expanding access to, and affordability of, early care & learning to set kids up for success as we strengthen a cradle to career education system", "2019-08-20T15:11:05.000Z": "Thanks to farm owners Roger Rainville and Heather Darby (and her son, Flint!) for having us.", "2019-08-20T15:10:53.000Z": "Borderview is also doing impressive work with milkweed - an untapped resource with tremendous benefits.", "2019-08-20T15:10:48.000Z": "Interesting #VTCapitol4aDay tour of the Borderview Research Farm, a biodiesel production and research facility in Alburgh. This team is conducting research important to our agriculture economy, including on oilseed crops, perennial grasses, hops, small grains and more.", "2019-08-20T12:55:57.000Z": "Off to a great start on our #VTCapitol4aDay in Grand Isle County! We started this meeting with a review of county-specific economic and workforce data by our @VTLabor economist. Thanks to Worthen Library & @VermontLib for hosting our cabinet meeting!", "2019-08-20T12:10:11.000Z": "I got to officially kick off our 2nd Grand Isle #VTCapitol4aDay with Marcus and Kurt on @NewsTalkWVMT - a great way to start the day. Now heading to my cabinet meeting at Worthen Library.", "2019-08-19T13:50:38.000Z": "I had a great time in Bennington yesterday at the Battle Day Parade, celebrating an important victory during the Revolutionary War. The Green Mountain Boys played a decisive role in the battle, and it was a major turning point in our fight for independence. #BattleOfBennington", "2019-08-15T17:46:09.000Z": "Find your local @VTLabor Career Resource Center here: http:// bit.ly/2OWHzPy", "2019-08-14T18:28:14.000Z": "Proud of all the Vermonters who serve/have served our communities as AmeriCorps volunteers! Quote Tweet SerVermont @VermontCorps Breaking news! Vermonters love to serve in AmeriCorps! Congratulations to all the top states and cities! twitter.com/AmeriCorps/sta", "2019-08-09T13:20:50.000Z": "Excited to hear that Senator @CoreyParent will be joining us for the @RiseVT Prevention Ride for the ENTIRE 35 mile bike ride around Franklin County. Get some rest Senator, you're going to need it! See you tomorrow!", "2019-08-07T21:03:45.000Z": "The Putnam Block project is one of the most important economic development initiatives underway in VT. Regional hubs like Bennington need game-changing projects that support economic growth & long-term security. Congrats to the community & the Bennington Redevelopment Group!", "2019-08-07T13:06:27.000Z": "So honored to attend a naturalization ceremony yesterday to celebrate 35 of our nation's newest citizens. The courage & perseverance that brought you to this moment remind us what citizenship is truly about. As Governor & as your neighbor: welcome home. @VTNationalGuard  @USCIS", "2019-08-05T19:20:26.000Z": "Vermont has another driver permit holder! Congrats to Garett, a brave patient at @UVMMedCenter , who passed his learner's permit test last Friday. And thanks to the @VTDMV for helping to make this possible!", "2019-08-04T18:01:35.000Z": "My statement on the tragedies in El Paso and Dayton", "2019-08-02T19:44:15.000Z": "Governors know how important good trade agreements are to keeping good jobs in our states & expanding opportunity for families. Many thanks to my @natlGovsAssoc colleague @GovLauraKelly (D-KS) for putting progress first & sharing her support for the #USMCA Governor urges support for USMCA Agreement - Governor of the State of Kansas governor.kansas.gov", "2019-08-02T17:23:55.000Z": "As we work together to grow our labor force & economy, supporting separating services members in relocating to VT and connecting with employers & training programs is one of the best tools in our toolkit! #vt  #jobsinvt  #thinkvt Quote Tweet Mark Perkins @VSP_Mark Today we visited Fort Drum for a Career Fair. Also attending were members of the VT National Guard, VT Air National Guard, VT Department of Labor and St. Albans PD. @VTStatePolice  #802VSP  #BeTheDifference  @drum10thmtn  @ARNGCSFL  @VTNationalGuard  @158FighterWing", "2019-07-31T10:53:58.000Z": "After the press conference, I had the chance to meet with some young campers, and a day-old calf. Thank you Billings Farm, for hosting us.", "2019-07-30T22:49:20.000Z": "No better way to end our Windsor County #Capitol4aDay than by mountain biking at Suicide Six Recreation Area with Woodstock Area Mountain Bike Association - WAMBA and RASTA!", "2019-07-30T19:27:00.000Z": "Today I joined @healthvermont Commissioner Levine & @VTAgencyofAg Secretary @anson_ag at Billings Farm & Museum in Woodstock to discuss our tick surveillance program. With tickborne illnesses on the rise, it's important to be tick smart. https:// governor.vermont.gov/press-release/governor-phil-scott-state-agencies-join-forces-around-systematic-tick-surveillance   #vtCapitol4aDay", "2019-07-30T17:37:26.000Z": "Thanks to the Scotland House in Quechee for having us at your adult day health center, and for all you do to support the Vermonters in your community! #VTCapitol4aDay", "2019-07-30T16:14:41.000Z": "Great panel in White River Junction where we discussed tax changes, Act 250 & economic development. This year, we rolled back the Land Gains Tax & boosted Downtown Tax Credits to spur economic growth. I've also proposed to modernize Act 250 to foster development. #VTCapitol4aDay", "2019-07-30T15:53:13.000Z": "Appreciate the opportunity to visit the Southern State Correctional Facility in Springfield, along with Representatives Emmons and Harrison, and members of my cabinet. We met with Department of Corrections staff, as well as offenders, as we toured the facility for #VTCapitol4aDay", "2019-07-30T12:41:05.000Z": "Kicking off our second round of #VTCapitol4aDay in Windsor County at the beautiful @FullertonInn in Chester! Thanks to my cabinet, as well as Sen. Nitka and Reps. Bock and Harrison, for joining this morning.", "2019-07-29T17:27:29.000Z": "The USMCA will help grow the New England economy and expand our trading relationships with key partners like Canada. Read more in my op-ed with New Hampshire @GovChrisSununu here: Govs. Chris Sununu and Phil Scott: The need for ratifying the US Mexico Canada Agreement America's governors and Canada's premiers work closely together to advance shared priorities and address issues of concern. Over the last two years, we have watched closely as our federal governments unionleader.com", "2019-07-27T20:48:37.000Z": "Had a fun time at the Barre Heritage Parade today!", "2019-07-26T17:51:21.000Z": "I was excited to join with my fellow governors at the @NatlGovsAssoc meeting this week to launch the Outdoor Recreation Learning Network, an effort to promote economic growth through outdoor industry. Read more: https:// governor.vermont.gov/press-release/governor-phil-scott-joins-nation%E2%80%99s-governors-launch-outdoor-recreation-learning ", "2019-07-24T21:54:37.000Z": "Thank you @GovHerbert for convening and @NatlGovsAssoc for launching the outdoor recreation learning network. Looking forward to learning about what other states are doing to promote outdoor recreation. #NGAinSLC  #vtpoli", "2019-07-20T17:37:52.000Z": "On the 50th Anniversary of the moon landing, let's remember what America is capable of when we unite for a common purpose. See my full statement below", "2019-07-19T18:04:05.000Z": "Honored to be in Bakersfield for the dedication of the Lucas James Williams Memorial Youth Fund Pavilion. LCpl Williams lost his life Kuwait 20 yrs ago while serving as a Marine. The Fund has since benefitted thousands of kids/communities. Learn more: http:// bit.ly/2Y0FJfJ", "2019-07-15T17:47:55.000Z": "Pleased to announce an additional $1.5 million in funding for school safety and security across Vermont. This new round of funding is in addition to the $4 million we made available for school security last year. Learn more here: https:// governor.vermont.gov/press-release/governor-phil-scott-announces-15-million-new-funding-available-school-safety   #vt  #vtpoli", "2019-07-15T15:29:45.000Z": "I was honored to stand with Greg & Dawn Tatro last month as we signed legislation to help address substance abuse in VT. It's great to hear of the progress they've since made with Jenna's Promise in Johnson toward building a strong & supportive community. 'Jenna's House' looks to be new community safe haven The Tatros recently founded the nonprofit, Jenna's Promise. They named the organization after their daughter who died of an overdose in February. wcax.com", "2019-07-14T00:05:52.000Z": "It was my honor to attend the change of responsibility ceremony for the Vermont National Guard, where Command Sergeant Major Toby Quick transferred responsibilities to CSM Nathan Chipman. Thank you both for your service to our state and nation!", "2019-07-11T20:23:49.000Z": "As part of our efforts to electrify the transportation sector, reduce emissions, and grow our economy, this year's budget makes important investments to increase incentives for low and middle-income Vermonters purchasing electric vehicles. Read more: https:// governor.vermont.gov/press-release/governor-phil-scott-details-initiatives-increase-electric-vehicles-vermont ", "2019-07-05T14:31:05.000Z": "With action to address PFOA contamination, implement lead testing at our schools & child care centers, and secure long-term funding for clean water, we're continuing our work to provide safe & clean water to VTers. Thanks to legislators & stakeholders for their important efforts.", "2019-07-04T15:03:51.000Z": "I hope all Vermonters have a safe and happy Independence Day! https:// governor.vermont.gov/press-release/statement-governor-phil-scott-independence-day ", "2019-07-02T14:57:59.000Z": "Expanding our workforce is crucial to grow our economy & build our tax base so that we can make key investments. Every new taxpayer provides relief to someone who's already here. Thanks to all the legislators who helped advance workforce development initiatives in our new budget.", "2019-07-01T13:14:31.000Z": "So glad to see the LACiNg up for Cancer walk was such a success this year, raising over $200,000! Very proud to see my daughter, Erica, following in my Aunt Mary's footsteps, who co-founded the Lamoille Area Cancer Network years ago. https:// stowetoday.com/news_and_citiz en/news/local_news/cancer-network-raises/article_9e6d3d0a-98ec-11e9-aa02-df6d44bd33f9.html   #vt Cancer network raises more than $210K Saturday's all-day annual LACiNg up for Cancer walkathon was a blue-sky reminder that what goes around comes around again, as hundreds of people made lap after lap to raise more vtcng.com", "2019-06-29T17:22:53.000Z": "Our new budget will help protect the most vulnerable Vermonters through additional investments in mental health, child protection, and more. Thanks to legislators who helped pass these initiatives. Read more: #vtpoli  #vt", "2019-06-28T16:13:00.000Z": "With investments in both child care & higher education affordability-as well as support for alternative learning paths-we're building on our work to foster a strong cradle-to career education system. Thanks to all legislators who played a role in these efforts. Read more: #vtpoli", "2019-06-28T12:47:19.000Z": "ICYMI: On Tuesday, we took the next step forward in consolidating different prevention initiatives to use the dollars we have more effectively. Thanks to Jenna's Promise & so many other partners in our efforts to address the opioid crisis. https:// mychamplainvalley.com/news/local-new s/gov-scott-signs-new-legislation-aimed-at-fighting-opioid-crisis/   #vt  #vtpoli Scott signs legislation to consolidate addiction prevention efforts The legislation is aimed at uniting partners in the fight against drug abuse. mychamplainvalley.com", "2019-06-27T19:53:27.000Z": "Today we unveiled a new aeration system to improve water quality and curb cyanobacteria blooms in Lake Carmi. This system is part of our broader effort to restore the Lake. Thanks to all the stakeholders who helped make this occasion possible. https:// bit.ly/2xfRKTB  #vtpoli  #vt", "2019-06-25T12:32:04.000Z": "The new revenue bill provides real tax relief and tax incentives to Vermonters, and is an important step toward making Vermont more affordable. Thanks to all the lawmakers who worked on these significant initiatives. Read more here: #vt  #vtpoli", "2019-06-24T18:54:05.000Z": "Thanks to @VermontDFR and stakeholder groups for their work on this important clarification. #vtpoli  #vt Quote Tweet Vermont Department of Financial Regulation @VermontDFR @VermontDFR recently clarified that Vermont insurers are prohibited from making coverage determinations for medically necessary gender-affirming care based solely on age. Read the full press release: https:// dfr.vermont.gov/press-release/dfr-clarifies-healthcare-rights-transgender-youth   @outrightvermont  @PrideCenterVT  @GovPhilScott  #pride", "2019-06-24T14:17:57.000Z": "The new budget includes additional resources to help support rural economic growth in all 14 counties. Thanks to legislators and stakeholders who helped make these investments a reality. #vtpoli  #vt", "2019-06-21T20:11:16.000Z": "Congratulations to Xusana Davis, who will serve as our first Executive Director of Racial Equality. Xusana's work will be crucial toward ensuring state government is fully committed to equal opportunity and treatment for all Vermonters. https:// governor.vermont.gov/press-release/governor-phil-scott-appoints-xusana-davis-vermont%E2%80%99s-first-racial-equity-executive   #vt  #vtpoli", "2019-06-21T13:25:33.000Z": "Yesterday, I signed into law H.513, which will expand broadband access to rural and underserved areas of Vermont. Learn more here: https:// governor.vermont.gov/press-release/governor-phil-scott-signs-bill-expand-connectivity-rural-communities   #vt  #vtpoli", "2019-06-20T17:35:10.000Z": "Today I was in Dover to sign into law H.513, an act relating broadband deployment throughout Vermont, which expands access to broadband, targeting rural and underserved communities. Thanks to the lawmakers who partnered with us on this important initiative. #vt  #vtpoli", "2019-06-18T16:19:26.000Z": "Proud to sign into law a new state budget which lives within our means, pays down our liabilities, invests in economic growth and affordability, preserves our natural resources, and protects the most vulnerable. Thanks to the budget team, my cabinet, and lawmakers for joining me.", "2019-06-17T00:18:37.000Z": "Thanks @GovPhilScott for handing me the pen you used to sign the Transportation Bills on Thursday. It made the perfect Father's Day gift for my Dad- the man who made me interested in our transportation system to begin with! #FathersDay2019", "2019-06-17T19:37:17.000Z": "Today, I signed into law S.40, which will govern lead testing and remediation at all of Vermont's schools and child care facilities. The State will fund all testing efforts and help reimburse remediation costs. Read more here: https:// governor.vermont.gov/press-release/governor-phil-scott-signs-lead-testing-remediation-bill-law   #vtpoli", "2019-06-17T16:54:41.000Z": "Pleased to sign S.111 into law today. This bill will help our servicemen & women who have been harmed by toxins in burn pits while serving their country. Thank you to the Legislature & all those who made this bill a reality, as well as those who have served our nation. #vtpoli", "2019-06-17T13:19:02.000Z": "A major disaster declaration has been approved for 6 VT counties impacted by storm & flood damage on April 15. This declaration will allow communities to receive 75% federal reimbursement for storm response & recovery--from road repairs to debris removal. https:// governor.vermont.gov/press-release/disaster-declaration-approved-six-vermont-counties ", "2019-06-16T13:05:42.000Z": "Proud to be a dad to these two amazing women. Happy Father's Day to all the dads across Vermont and those, like mine, no longer with us.", "2019-06-14T18:40:11.000Z": "Pleased to join with bipartisan legislators to sign into law the transportation bill and DMV bill. These pieces of legislation invest in paving & roadway projects, reduce greenhouse gas emissions, streamline the licensing process for new Vermonters & more. https:// governor.vermont.gov/press-release/governor-phil-scott-signs-2019-transportation-and-department-motor-vehicle-bills ", "2019-06-14T18:34:45.000Z": "Great to see @lcsenecal take on this leadership role with @VTWomen ! Quote Tweet VT Commission Women @VTWomen . @lcsenecal of Stowe is now Chair of the Vermont Commission on Women (VCW), an independent non-partisan state government commission dedicated to advancing rights and opportunities for women and girls. https:// women.vermont.gov/Senecal_Electe d_VCW_Chair   #VT  #VTPoli  #VTWomen", "2019-06-10T14:29:05.000Z": "Federal Infrastructure Minister @FP_Champagne with #Vermont Transportation Secretary Joe Flynn prior to announcement of extending A-35 to near the U.S. border. Still 4 Km short. @vermontgov  #Cdnpol The following media includes potentially sensitive content. Change settings View", "2019-06-06T18:58:11.000Z": "\"Today, we remember when free people stood to fight oppression, when free nations stood together to preserve liberty, and secure peace in Europe that remains today.\" Read more here: https:// governor.vermont.gov/governor-scotts-blog/governor-scott-75th-anniversary-d-day-invasion ", "2019-06-05T14:16:53.000Z": "Enjoyed kicking off the Downtown and Historic Preservation Conference with state and community leaders. This year, we expanded the Downtown and Village Center Tax Credit program to $2.6 million in order to support economic growth in communities across Vermont. #vtpoli", "2019-06-04T18:03:10.000Z": "Thanks to the members of the @VTVAB for hosting me at your #vabconference2019 today, and thanks for all you do as employers and in ensuring a strong and independent press in Vermont.", "2019-06-04T16:12:32.000Z": "Congratulations to @VTFishWildlife Warden Tim Carey for receiving the Game Warden of the Year award! Special thanks to Reading Elementary School students for stopping by the ceremony.", "2019-06-03T21:20:21.000Z": "Glad to announce $2.5 million in funding for community development across Vermont--from supporting affordable housing to investing in business growth and infrastructure improvements. Read more here: https:// governor.vermont.gov/press-release/governor-phil-scott-announces-25-million-grants-support-new-housing-infrastructure-and   #vtpoli", "2019-06-03T17:27:42.000Z": "David Ainsworth was a committed public servant, a dedicated farmer, and a true Vermonter in every since of the word. He will be greatly missed. My thoughts are with his family during this difficult time. https:// governor.vermont.gov/press-release/statement-governor-phil-scott-passing-representative-david-ainsworth ", "2019-06-01T18:23:42.000Z": "I had a great time attending @CCV_VT 's graduation ceremony today. Exciting to see graduates from all walks of life receive their diplomas. Pictured are the military veterans who graduated today. Congratulations to all!", "2019-05-31T16:35:58.000Z": "This week, I signed into law H.330 & H.511. These measures will change the statute of limitations for serious violent and sex crimes, giving victims a greater opportunity to seek justice. Thanks to tri-partisan legislators for passing these initiatives. https:// bit.ly/2XqX81u", "2019-05-31T15:51:47.000Z": "Congrats to @VTDMV for receiving the @AAMVAConnection \"Donate Life America Silver Award\" for 2nd highest organ donation registration rates in our region! Thanks to all the VTers who have generously chosen to become donors. For more info/to register, visit http:// donatelifevt.org", "2019-05-31T11:01:22.000Z": "A true sign of summer as we join @GovPhilScott and @VTStateParks in officially welcoming in the 2019 park season. With 55 state parks, there is sure to be one to fit your interests. Learn more: https:// vtstateparks.com/index.html  #ThisIsVT", "2019-05-30T18:12:26.000Z": "I have requested a Major Disaster Declaration to acquire federal funds to assist \nBennington, Essex, Orange, Rutland, Washington, and Windsor counties in repairing public infrastructure damaged in floods on April 15. https:// governor.vermont.gov/press-release/vermont-requests-federal-disaster-declaration-3 ", "2019-05-30T14:55:09.000Z": "Expanding investment in higher ed, as well as early care & learning, is crucial to building a strong education system. I appreciate the Legislature's support for my proposal to increase funds to the @VSC_edu , as well as @VSC_edu for dedicating those funds toward tuition costs."}