{"2019-01-09T16:44:07.000Z": "I'll be delivering my first State of the State address today at 10:00 a.m.! Watch online at https:// youtube.com/watch?v=mMZfQX SdEWg&feature=youtu.be   #wyleg  #govgordon 2019 Wyoming State of the State Address The 2019 Wyoming State of the State Address. Wyoming Governor Mark Gordon gives his first State of the State Address as the Governor for the State of Wyoming... youtube.com", "2019-01-07T17:25:46.000Z": "Beautiful Prayer Service at  St. Mark's Episcopal Church this morning! #wyo2019  #govgordon", "2019-01-07T16:35:04.000Z": "The 2019 Wyoming Inaugural Ceremony will begin at 10:30 a.m. I'm proud to be taking the oath of office with @EdBuchananWyo , Auditor Racines, Treasurer Meier and @jillian4supt . Watch online at https:// youtu.be/3gK6YaoqUdk . #wyo2019  #govgordon 2019 Wyoming Inauguration - Swearing in Ceremony Wyoming Inauguration. January 7, 2019. The swearing in ceremony is being held at the Cheyenne Civic Center. Swearing in Ceremony for: Governor-elect Mark Gor... youtube.com", "2019-01-07T13:40:52.000Z": "I was honored to be sworn in this morning at the Wyoming State Capitol, currently under construction. This is the 'People's House' and it means a great deal to me to begin my tenure here. I look forward to the Inaugural Ceremony today at 10:30 am! #wyo2019  #govgordon", "2019-01-07T03:58:33.000Z": "As I prepared for tomorrow's Inaugural Ceremony, I was blessed with a tremendous surprise from my son Spencer who built a custom podium for me to use. Tune in tomorrow at 10:30 a.m. to watch the ceremony live at https:// youtu.be/3gK6YaoqUdk", "2019-01-03T04:16:13.000Z": "I was pleased to announce two additions to my Administration today. Rachel Girt will serve as my Communications Director and Erin Ostrin Johnson as my Health and Human Services Policy Advisor. More announcements in the days to come! https:// bit.ly/2s4dTSn", "2018-12-10T19:05:46.000Z": "It was 149 years ago today when John Campbell, Governor of the Wyoming Territory, approved the first law in the U.S. granting women the right to vote. Jennie and I are excited to mark the 150th anniversary of this momentous event next year! Wyoming Places - December 10 places.wyo.gov", "2018-12-04T17:36:25.000Z": "It was great to join K2TV this morning for \"Report to Wyoming.\" Tune in this month to hear me discuss the upcoming legislative session as well as some of the most important issues facing our state!", "2018-12-01T18:41:53.000Z": "The world lost a true statesman and devoted public servant. From WWII Veteran to Congressman, UN Ambassador to U.S. President, George H.W. Bush defined for a generation what it means to put country above self. Jennie and I send our thoughts and prayers to the entire Bush family.", "2018-11-11T15:38:12.000Z": "Jennie and I would like to thank the incredible men and women who have served in our nation's armed forces, protecting our freedoms and values at home and abroad. It's because of their sacrifice that we're able to live free. Happy #VeteransDay !", "2018-11-06T18:50:06.000Z": "It's time for lunch in Wyoming, but it's also a great time to cast your ballot in this crucial election. Find your polling place now, and vote during your break! #GordonForGovernor  http:// bit.ly/2SlJc71", "2018-11-06T14:00:16.000Z": "The polls are open and it's officially election day in Wyoming! I'm counting on your support, so find your polling place and go vote! #GordonForGovernor  http:// bit.ly/2SlJc71", "2018-11-05T22:21:12.000Z": "Thrilled to earn the support of the @CSTribune 's editorial board: \"[Gordon] has a diverse background in all of Wyoming's key industries - energy, agriculture and tourism... His in-depth understanding of economic policy will be crucial in the coming years.\" Editorial board: Next governor should be pragmatic and thoughtful The four candidates competing for Wyoming's top political office all have a different plan for the future of the state. And each would bring their own unique style of governing. trib.com", "2018-11-05T18:00:19.000Z": "Terrific weekend in Laramie watching the @UWyonews Cowboys take on San Joe State. We also had a terrific time at the home of Gary & Lois Crumb with WY Superintendent of Public Instruction Jillian Balow. A special thanks to our hosts and all the folks from Laramie who joined us.", "2018-11-05T15:14:26.000Z": "Tomorrow is the big day! Polls will open at 7 a.m., and I'm counting on your support. Find your polling place now and be ready to cast your ballot. #GordonForGovernor  http:// bit.ly/2SlJc71", "2018-11-05T01:00:58.000Z": "I am ready to lead Wyoming and make it the best run, lowest taxed, most efficient, least regulated, and most opportunity prone state in the county. With your vote on Tuesday, we can do just that. #GordonForGovernor", "2018-11-04T19:00:08.000Z": "We're just TWO days away from the November 6th election. Do you know where your polling place is? Find out now and cast your vote for Governor on Tuesday. #GordonForGovernor  http:// bit.ly/2SlJc71", "2018-11-03T16:25:59.000Z": "Our campaign for Governor of Wyoming has been a grassroots movement from the very start, driven by volunteers, showing up to community events, and door-to-door outreach. This Tuesday, I'm counting on your support to help us finish strong with a big win. #GordonForGovernor", "2018-11-03T15:00:07.000Z": "After all of our hard work, the election is finally upon us. On Tuesday, I'm counting on you to make your voice heard in this race for Governor of Wyoming. Find your polling place now! #GordonForGovernor  http:// bit.ly/2SlJc71", "2018-11-02T19:15:40.000Z": "WY's Blockchain Task Force is drafting legislation that will develop a better business climate for blockchain tech in our state. Thanks to Rep. @Tyler_Lindholm , Rep. @JaredSOlsen and @SenatorDriskill for their leadership on this important issue! https:// goo.gl/B4eztA", "2018-11-02T14:20:26.000Z": "As your Governor, my priorities will include keeping our budget in order, improving schools, protecting jobs, and protecting our liberty. I'll clear a path for you to chart your own course here. This upcoming Tuesday, I ask for your vote. #GordonForGovernor", "2018-11-01T19:56:19.000Z": "\"Now more than ever Wyoming needs principled leadership. Mark Gordon is the candidate Wyoming can count on to uphold the values that make our state great. I urge voters to join me in making Mark our next governor.\" #GordonForGovernor Harvey: Mark Gordon is a tried and true conservative Editor: trib.com", "2018-10-31T18:43:19.000Z": "It's an honor to have the support of former Wyoming Governor Jim Geringer, as well as business leader Peter Wold! As State Treasurer, I developed a strong record of accomplishments. I know how to get things done for the people of Wyoming. #GordonForGovernor", "2018-10-30T21:37:55.000Z": "With one week to go, we're in the homestretch! I've been focused on Wyoming's future, and I look forward to leading it as your next Governor. But I need your help to get there - RT this message now, and be prepared to vote November 6. #GordonForGovernor  http:// bit.ly/2SlJc71", "2018-10-30T16:21:08.000Z": "Honored to have the support of the Wyoming Contractors Association and the Wyoming Mining Association! Wyoming miners and contractors are the backbone of our state and local economies, keeping the lights on and our infrastructure reliable and safe. #GordonForGovernor", "2018-10-30T15:00:21.000Z": "I joined residents and local leaders in Bondurant to survey the devastation in Hoback Ranches from the recent fires. Thank you to Andrea Sramek and the community for welcoming me. I will do everything I can to ensure this community has the support and resources they need.", "2018-10-29T18:01:04.000Z": "As a lifelong conservative, I've always believed government closest to the people governs best. As Governor, I'll work to ensure our local communities have the resources and support they need to do more for themselves. #GordonForGovernor", "2018-10-28T22:24:44.000Z": "Jennie and I had a wonderful time at the Republican Rally to Victory event in Gillette on Saturday night. Thanks to the Wyoming Republican Party and Campbell County Republican Party for bringing Republicans from all across the state together. #GordonForGovernor", "2018-10-26T22:00:03.000Z": "In case you missed it: State Auditor nominee Kristi Racines and I are committed to financial transparency in Wyoming's government. We've brought together an incredible team to develop accountability and more access. #GordonForGovernor Front sheridanmedia.com", "2018-10-26T19:18:14.000Z": "Thanks to former Representative Cynthia Lummis, Senate President Eli Bebout and former Wyoming Republican Chair Diemer True for your support.", "2018-10-26T16:37:04.000Z": "Good schools are critical to Wyoming's future, and an important part of the Governor's job is to help improve them. Having served on the school board in Johnson County, I understand the challenges facing education, and I pledge to do right by your kids. #GordonForGovernor", "2018-10-26T16:04:20.000Z": "I appreciate @UWyonews for hosting last night's gubernatorial debate and allowing me the opportunity to share my vision for Wyoming's future. I enjoyed meeting everyone who came out to support us, too - thank you! #GordonForGovernor", "2018-10-25T16:44:01.000Z": "TONIGHT, at the @UWyonews College of Arts and Sciences auditorium, come on out to the Wyoming gubernatorial debate from 5:15-6:45 p.m! Team Gordon is counting on you to show your support! #GordonForGovernor  https:// goo.gl/4qA1uP", "2018-10-24T16:18:53.000Z": "Honored to be endorsed by Wyoming Senator Mike Enzi! For years, Sen. Enzi has fought for our shared values in the Senate, and I'm glad to have him onboard our campaign as we head into the final two weeks of the race for governor! #GordonForGovernor", "2018-10-24T13:30:05.000Z": "Another great event in Rock Springs last night! A special thanks to hosts Fred & Susie Von Ahrens, Margaret Parry, Bonnie Cannon and Ron Wild. I know we're going to create a better future for Wyoming, starting in just a few weeks! #GordonForGovernor", "2018-10-23T18:58:36.000Z": "Ensuring transparency in our government is essential. I'm thrilled to join Kristi Racines, our Republican nominee for Auditor, in announcing that we've enlisted four longtime residents and local leaders to serve on a financial transparency working group. http:// bit.ly/2q8FO2C", "2018-10-23T15:18:04.000Z": "It was wonderful meeting everyone at the Berry Ranch potluck dinner in Cheyenne! Thank you to Dave Berry for hosting this fantastic event at his ranch. #GordonForGovernor", "2018-10-23T15:15:05.000Z": "Thank you for these kind words, Jim and Terry! \"Mark is a common sense conservative, Wyoming native, a rancher, a Johnson county leader and a leader in our state  He is one of us.\" #GordonForGovernor Mark Gordon is one of us In the August primaries, we proudly cast our ballot for Mark Gordon for governor of Wyoming. Mark is a common sense conservative, Wyoming native, a rancher, a Johnson county leader gillettenewsrecord.com", "2018-10-22T03:40:26.000Z": "There's no better place to be on a Saturday in the fall than Laramie to watch a Cowboys game.\n\nOur Cowboys and Cowgirls are more than just sports. If elected Governor, I'll be a strong advocate for the University of Wyoming and our community college network across the state.", "2018-10-22T00:34:30.000Z": "Jennie and I had a great time at the Booklovers' Bash in Cheyenne! Hearing from author John Rosemond, whose columns appear in the Wyoming Tribune Eagle, was easily a highlight of the night. Thanks to all who came out!", "2018-10-18T22:16:45.000Z": "Thank you to everyone who joined us earlier this week at the Cheyenne Botanic Gardens for our fundraiser! As we head into the final weeks of this campaign, I'm encouraged by the support we're feeling all over the state. Let's finish strong! #GordonForGovernor", "2018-10-17T16:25:47.000Z": "I want to make sure it's easier and more efficient to do business in WY than anywhere else in the country. I also want to make certain that our local communities & our counties have the resources that they need. Watch my interview now! #GordonForGovernor Governor Candidate Overview for Mark Gordon Gubernatorial candidate, Mark Gordon, is currently the state treasurer. One of Gordon's top priorities, if elected, is making business more efficient in Wyoming. wyomingnewsnow.tv", "2018-10-16T20:00:03.000Z": "I appreciate your support, Glenn!  \"Mr. Gordon's experience in state government serving on numerous boards as one of the five elected officials has given him detailed insight into the running of the executive branch.\" #GordonForGovernor  https:// goo.gl/Nc1bqt", "2018-10-16T18:30:13.000Z": "It was wonderful seeing so many of my friends in Cody. Thank you, Senator Al & Ann Simpson, Steven and Dana Cranfill, Jim Nielson & Anne Young, Quintin, Ted, & Judie Blair, Howard & Cathy Thompson, and Dick & Jeanne Nelson! #GordonForGovernor", "2018-10-16T17:30:21.000Z": "Jennie and I had a great time attending the Cody Country Chamber of Commerce Candidate forum! I'm proud to support all of the hard-working small businesses and entrepreneurs on the main street here. #GordonForGovernor", "2018-10-15T01:30:17.000Z": "I was pleased to spend Saturday visiting with folks in Thermopolis, Worland, and Ten Sleep. A special thanks to Washakie County Republican Women and Ten Sleep Brewery for being such terrific hosts. #GordonForGovernor", "2018-10-15T00:53:29.000Z": "Jennie and I enjoyed a great morning at the Sheridan County Republican Party Open House! Sheridan is fortunate to have great Republican leaders at the local and state level and we are proud to support them! #GordonForGovernor", "2018-10-14T19:38:56.000Z": "Should I be fortunate enough to be elected to serve as Governor, I look forward to working hand-in-hand with Senator Bebout to move our great state forward. #GordonForGovernor", "2018-10-14T19:38:54.000Z": "It was a privilege to join @GovMattMead, former Senate President Phil Nicholas and former Vice-President Dick Cheney in honoring Senate President Eli Bebout. Senator Bebout has been a tremendous champion for Wyoming families, businesses and our shared conservative values.", "2018-10-12T20:45:00.000Z": "I'm not running for governor to fix Wyoming. I simply want to use my background in energy, agriculture, and small business to manage our state government, and keep local decisions in local hands. Watch my new ad now! #GordonforGovernor", "2018-10-12T16:00:12.000Z": "Enjoyed visiting with tourism industry leaders & small business owners in Laramie. Tourism is a critical part of our state and local economies. As Gov., I'll work with industry leaders to ensure we have adequate funding for promotion & policies that support growth of the sector.", "2018-10-12T15:31:02.000Z": "Wishing all Wyoming producers a Happy National Farmer's Day! As a lifelong rancher, I know how vital agriculture is for our state & nation. And as Governor of the Cowboy State, I'll continue to represent our farming community by working to expand the industry. #GordonForGovernor", "2018-10-10T19:00:06.000Z": "Honored to announce that our campaign for Governor has been endorsed by the Wyoming Association of Realtors! \"Your energy, thoughtfulness and passion for Wyoming shows through all of your work.\" #GordonForGovernor", "2018-10-09T21:00:05.000Z": "Congratulations to WYDOT's Ali Ragan for earning the the Vanguard Award from the American Association of State Highway and Transportation Officials! Her efforts have improved WY highway safety for motorists by using new technologies. #GordonForGovernor  https:// goo.gl/vz14xb", "2018-10-09T19:00:05.000Z": "#GordonForGovernor signs are going up in Laramie. Contact us today at mark@gordonforwyoming.com to get yours!", "2018-10-09T17:00:11.000Z": "Fundraiser in Casper hosted by Susie McMurry and Judy Catchpole. Natrona County has unique challenges and opportunities and I look forward to working with the community up there in the weeks and months to come!", "2018-10-09T15:00:08.000Z": "I'm honored to be endorsed by @WTEnews ! \"Gordon also would bring his experience working in agriculture, tourism and the oil industry with him to the governor's office...\" Read the full endorsement here: https:// bit.ly/2RBtsfF  #GordonForGovernor", "2018-10-09T00:00:14.000Z": "Terrific time at the Gordon for Governor Glendo Shindig! Always great to be in Platte county. Thanks to our hosts: Bob and Lynn Budd, Robin and Scott Haynes, Gennelle and Mike Petsch, Penny and Brian Nesvick, and Misha and Darin Westby. #GordonForGovernor", "2018-10-08T20:02:49.000Z": "Had a wonderful time at the Wheatland picnic this weekend. Special thanks to Judy & Greg Horton; Chuck & Katie Brown; Joni & Juan Reyes; Sherilyn & Alden Prosser; Jason Reyes; Jennifer Reyes-Burr & Mike Burr; and Jerry & Sherman Cundall for hosting this event! #GordonForGovernor", "2018-10-06T22:00:08.000Z": "Jennie and I had a great time visiting with friends, old and new, in Cheyenne this week. Thank you so much to our wonderful hosts, Barbara and Bill Stafford, for putting this great event together. Our momentum is strong moving into the general election! #GordonForGovernor", "2018-10-06T18:37:43.000Z": "Nothing better than a night in Torrington listening to folks talk about the issues most important to THEM in Goshen County and across Wyoming. A huge thank you to our friend Chuck Kenyon for bringing it all together. #GordonForGovernor", "2018-10-05T16:45:49.000Z": "Recently, I joined KTWO to discuss my vision for Wyoming. As Governor, I will work to grow and expand our economy so we can secure Wyoming's future by keeping our young people in the state. Watch the video now! #GordonForGovernor RTW Mark Gordon on the General Election Campaign youtube.com", "2018-10-04T18:30:34.000Z": "There are only a few weeks until the November 6 election! Sign up now to join Team Gordon and volunteer with us as we spread our positive vision for Wyoming's Future across the state! #GordonForGovernor  https:// goo.gl/TsqqkQ", "2018-10-04T14:30:04.000Z": "Team Gordon just got a brand new shipment of #GordonForGovernor signs, and we're ready to get them posted up all over Wyoming! Email Marie at marie@gordonforwyoming.com to reserve yours today!", "2018-10-03T23:00:04.000Z": "I'm proud to support efforts to expand and encourage the technology industry in our state, including Blockchain. We can be leaders in this kind of innovation, and as Governor, I'll help us do just that. #GordonForGovernor Wyoming Mulls Launching Blockchain-Friendly Bank to Lure Bitcoin Firms The state of Wyoming is mulling legislation that could allow the creation of a bitcoin-friendly bank intended to lure crypto startups to the region. ccn.com", "2018-10-03T20:47:40.000Z": "On Sunday, October 14, from 3-4 p.m., join me at the Sheridan County Republican Headquarters for a meet & greet event! I'm looking forward to seeing you there! #GordonForGovernor", "2018-10-03T16:20:24.000Z": "My friend Rep. @Liz_Cheney and I are asking for your vote. With Early Voting, you can cast your ballot at your County Clerk's office right now and avoid the crowds on November 6.\n\nFind out all the details here: https:// goo.gl/4sXljg  #GordonForGovernor", "2018-10-02T16:00:24.000Z": "Had a great time joining our wonderful members of Congress, @barrassoforwyo and Representative @Liz_Cheney , at the University of Wyoming football game on Saturday to cheer on the Pokes! #GordonForGovernor", "2018-10-02T15:00:07.000Z": "As a small business owner, I'm honored to be endorsed by the NFIB Wyoming PAC. As Governor, I'll be a champion for the entrepreneurs who create economic growth in our state and I'll work to keep burdensome government regulations out of the way. #GordonForGovernor", "2018-10-01T16:00:10.000Z": "Nothing says Fall like... door-to-door! I had a fantastic time visiting with folks in Sheridan - aided by some of our best volunteers! #GordonForGovernor", "2018-09-28T22:56:00.000Z": "Volunteers and staff busy at work in our Cheyenne office. We are so fortunate to have the best team in Wyoming! Interested in joining us? Visit our website at gordonforwyoming,com to sign up to volunteer today! https:// gordonforwyoming.com/join-us/", "2018-09-28T15:51:33.000Z": "I sat down with the @WTEnews editorial board to discuss my campaign and vision for Wyoming's future. I want to provide opportunity for families and businesses so that we can diversify our economy and grow our state's potential. Watch now! https:// goo.gl/ofWLqa", "2018-09-27T16:06:03.000Z": "Did you know absentee ballot voting is currently ongoing? I need your vote if we're going to build a better future for Wyoming. Visit the Wyoming Secretary of State website to learn how to request your ballot now! #GordonForGovernor  https:// goo.gl/dKywHG", "2018-09-25T18:29:42.000Z": "Disappointed that activist litigation has succeeded in superseding the work of developing a conservative policy to keep the grizzly pop. healthy & reduce human conflicts. Our decision to reinstate a limited hunt was based in science & sound local planning. https:// bit.ly/2Q4Kmlq", "2018-09-25T15:55:58.000Z": "My amazing wife Jennie is participating in the Wyoming L.E.A.D. program this year, an agriculture and rural leadership program that started in 1984. The class is in Germany this week where they visited a John Deere factory in Mannheim - and proudly represented Wyoming.", "2018-09-24T18:10:25.000Z": "\"Wyoming Ranks Third in Nation for Fiscal Health\" - @CasperStarTribune As Governor, I'll work to help stabilize our reserve accounts and ensure they're used for their intended purpose. #GordonForGovernor Wyoming ranks third in nation for fiscal health Wyoming has topped the rankings of yet another fiscal study, coming in third in the nation in the 2018 Fiscal State of the States study, a yearly review of state-level trib.com", "2018-09-21T14:09:38.000Z": "Absentee voting in Wyoming begins TODAY! It's important that you make your voice heard in the race for governor! Please request your ballot now, and avoid the long lines on Election Day. #GordonForGovernor  https:// goo.gl/dKywHG", "2018-09-19T20:36:22.000Z": "With less than 50 days until the November election, Team Gordon is pushing hard each and every day. Sign up now to volunteer with us! #GordonForGovernor  https:// goo.gl/TsqqkQ", "2018-09-18T15:30:14.000Z": "ICYMI: Republican nominee for auditor Kristi Racines and I have announced a plan to launch a working group to increase transparency in Wyoming's finances, providing better access and solutions for the people of our state. #GordonForGovernor  https:// goo.gl/HzJuh3", "2018-09-17T16:00:05.000Z": "Happy Constitution Day! On September 17, 1787, patriots signed their names to our nation's most precious document. As Governor of Wyoming, my promise is to defend our constitution and protect our way of life for future generations. #GordonForGovernor", "2018-09-17T00:59:18.000Z": "Jennie and I had a fantastic weekend cheering on the @UniversityofWyoming Cowboys as they took on the Wofford Terriers on Saturday. Thanks to all who joined us for a terrific tailgate prior to the Cowboys victory! #gordonforgovernor  #gopokes", "2018-09-14T21:53:28.000Z": "It's critical for WY citizens to know where their money is going and how it is being managed and spent. As Gov., I pledge to work hand-in-hand with Kristi Racines as State Auditor to improve access & transparency to our state finances. #GordonForGovernor  https:// bit.ly/2NdORNG", "2018-09-14T15:37:10.000Z": "Terrific evening at the WY Alliance Forum in Cheyenne. Addressing the issues that impact many of our most vulnerable citizens is critical. I enjoyed having the opportunity to discuss everything from healthcare to education to important safety net programs. #GordonForGovernor", "2018-09-13T21:23:41.000Z": "I've been having an inspiring week attending a number of important events in Casper. I had a great time meeting everyone at the Wyoming Oil & Gas Fair, as well as the Casper Chamber of Commerce Candidate Forum. Thanks for coming out! #GordonForGovernor", "2018-09-12T21:21:42.000Z": "Thank you so much to the Casper Area Chamber of Commerce for hosting today's Candidate Forum. I always appreciate having the opportunity to visit with citizens and business owners in Natrona County. #GordonForGovernor", "2018-09-12T16:53:57.000Z": "Wyoming is leading the way for the rest of the nation with blockchain, and it's inspiring businesses to come here. Thrilled to see companies like Overstock and ActiveAether will be opening offices in the Cowboy State. #GordonForGovernor Tech companies promise Wyoming investment at 'Hackathon' LARAMIE - The University of Wyoming hosted during the weekend the state's first WyoHackathon, which was billed by blockchain entrepreneurs as a \"thank-you\" to the state for the five blockchain-related trib.com", "2018-09-11T15:01:55.000Z": "Seventeen years ago today, our nation was attacked by terrorists who wanted to destroy our way of life. We honor the memory of those who died, as well as the firefighters, police officers, and first responders who risked it all to save their fellow Americans. #NeverForget", "2018-09-10T17:13:23.000Z": "I'm tremendously proud of the great strides our state has made in just the past ten months to not only position Wyoming to be a national leader in this growing economy, but to really blaze a trail for virtual currencies and Blockchain technology. #GordonForGovernor", "2018-09-07T14:28:59.000Z": "With last month's primary victory, Team Gordon is sprinting all the way to November. Volunteer by joining our team now and help spread our vision all over Wyoming! #GordonForGovernor  https:// goo.gl/TsqqkQ", "2018-09-07T00:30:58.000Z": "The Wy Dept. of Health is launching a new awareness campaign on the dangers of opioid abuse, an issue of growing concern. Addiction strikes at the very heart of our families & communities and we have a responsibility to be proactive in protecting citizens. Wyoming Department of Health to launch opioid awareness ad campaign Advertisements telling the \"real stories\" of people affected by opioid abuse will begin appearing across Wyoming media outlets as part of an awareness campaign run by the state Department of trib.com", "2018-09-05T17:22:39.000Z": "Hunting season in Wyoming is starting soon! A new Wyoming law means that you can now choose between fluorescent pink or fluorescent orange clothing when out in the field. Be safe this season! #GordonForGovernor Hey hunters: Pink is just peachy, orange you glad you asked? - Buckrail - Jackson Hole, news WYOMING - Crisp mornings mean hunting season is right around the corner. In fact, for some, it's on now. Changes to state law have some sportswomen and some sportsmen wondering what exactly are the... buckrail.com", "2018-09-03T22:23:04.000Z": "I'm disappointed a federal judge intervened in this way. As Governor, I will work to change the misguided narrative that Wyoming decisions belong anywhere but in Wyoming hands. #GordonForGovernor Reaction to grizzly hunt decision U.S. District Court Judge Dana Christensen issued a temporary restraining order on grizzly bear hunts Thursday. wyomingnewsnow.tv", "2018-09-03T17:32:37.000Z": "Happy Labor Day, Wyoming! Today we honor our state's workforce, and thank them for all the hard work they do to advance our local economies.", "2018-08-31T15:13:44.000Z": "I'm proud to have the support of the WY GOP and fellow conservative candidates for Governor who joined me in signing a \"Unity Pledge.\" After a tough primary, Republicans up and down the ticket stand united and ready to continue working hard. #GordonForGovernor", "2018-08-31T14:35:56.000Z": "Congratulations to Mark Foos, and members of the 1987 University of Wyoming Cowboy football team, on their induction into UW's Athletic Hall of Fame! Go Pokes! Foos honored to enter Wyoming Athletic Hall of Fame As the current University of Wyoming Cowboy football team heads into the locker room at halftime of its home opener against Washington State on Saturday, members of the 1987 team starherald.com", "2018-08-29T15:49:11.000Z": "I believe in an all-of-the-above approach to energy. Wyoming's natural resources are an important part of our state's economy and this 3,500-well natural gas project in Sublette County could generate up to $17 billion in four decades! #GordonForGovernor Feds approve 3,500-well gas project in western Wyoming With a nod from federal regulators Tuesday, Jonah Energy's 3,500-well natural gas project in Sublette County took a leap forward. trib.com", "2018-08-23T20:09:15.000Z": "It's deeply humbling to be your Republican candidate for governor of Wyoming. We're getting ready for the general election, and we could use your help. Become a volunteer today! #GordonForGovernor  http:// bit.ly/2MJxVgJ", "2018-08-22T13:30:06.000Z": "The show of support we've received on the campaign trail over the past several months has been incredibly inspirational. From the Gordon family to yours, thank you for standing with us. #GordonForGovernor", "2018-08-22T01:08:16.000Z": "The polls have closed and we're so thankful for all the volunteers who knocked on doors, made phone calls, put up yard signs, and hosted events. Thank you for all of your efforts and support! #GordonForGovernor", "2018-08-21T22:00:09.000Z": "There are only a few more hours until polls close at 7 PM, and it's vital that you make your voice heard! #GordonForGovernor", "2018-08-21T17:55:09.000Z": "It's lunchtime - have you voted in the primary election for governor of Wyoming yet? Please take a moment during your break and visit your local polling place. Every vote counts! #GordonForGovernor  https:// goo.gl/4sXljg", "2018-08-21T16:58:18.000Z": "Mark and Jennie cast their ballots in Buffalo this morning before heading to Sheridan. #TeamGordon supporters all across the state are out holding signs and showing their support.", "2018-08-21T15:00:30.000Z": "Mark and Jennie going door to door with our incredible volunteers in Bar Nunn. We're working hard to the very end. #GordonForGovernor", "2018-08-21T13:00:30.000Z": "It's officially Election Day in the Cowboy State! The big day has finally arrived. Let's get government out of the way so you can write your own chapter in Wyoming's book! Head to your polling location now, and cast your ballot! #GordonForGovernor  https:// goo.gl/4sXljg", "2018-08-20T22:00:08.000Z": "I am honored to have the support of so many current and former Wyoming conservative leaders! There's strength in numbers, and we need your help if we're going to be successful this Tuesday. Like and share to spread the word. #GordonForGovernor", "2018-08-20T20:40:33.000Z": "Get ready to vote tomorrow, August 21, in the Wyoming primary election! I'm thankful for all the hard work my kids have put into this campaign. Let's get across the finish line! https:// goo.gl/4sXljg  #GordonForGovernor", "2018-08-20T20:00:07.000Z": "The campaign trail brings us to some fun places! Had a great time with my wife Jennie, daughter Anne, and #TeamGordon at the Wyoming State Fair in Douglas this weekend.", "2018-08-20T18:00:06.000Z": "I'm encouraged by the outpouring of support I've seen over the course of this campaign. As we head into Tuesday's primary election, I'm focused on spreading my vision for Wyoming and working to earn your vote. http:// bit.ly/2N4qUEt", "2018-08-20T14:00:30.000Z": "Tomorrow, August 21, is Election Day in Wyoming. I need you to make your voice heard in the race for governor if we're going to win. Please find your polling place and develop a plan to go vote - let's do this! #GordonForGovernor  https:// goo.gl/4sXljg", "2018-08-19T22:05:52.000Z": "It means so much to hear these words of support from my kids and our kids, Spencer, Aaron, Bea, and Anne. Thank you for all of your hard work on the campaign trail! Get ready to vote on Tuesday, August 21! #GordonForGovernor", "2018-08-19T20:39:33.000Z": "Come rain or shine, #TeamGordon volunteers are out in full force this weekend knocking on doors across the state! A special thanks to our Campbell County crew for braving the rain!", "2018-08-19T18:00:06.000Z": "There are less than 48 hours to go until the Tuesday, August 21, primary election! Find your polling location now, and make sure your friends and family members know where to go too! #GordonForGovernor  https:// goo.gl/4sXljg", "2018-08-18T18:29:26.000Z": "How do you choose who to vote for? I have experience. I've delivered results for our community, in business, and in our government. Check out our new ad now, and please vote for #GordonForGovernor on Tuesday, August 21!", "2018-08-17T20:08:24.000Z": "\"Don't forget, the word of the day is 'governor' as in 'governing.\"' Who can do it? Who has done it? Who is good at it? The answer to those questions, only one guy - Mark Gordon.\" #GordonForGovernor  http:// bit.ly/2nLB816", "2018-08-17T15:00:42.000Z": "Nothing is more important to Jennie and I than our family. We're incredibly proud of the family we've built and the amazing kids we have been blessed with. #TeamGordon", "2018-08-17T01:00:04.000Z": "Honored to have the endorsement of the Mountain West Credit Union Association! Thank you for joining Team Gordon as we head towards the primary election next week on August 21! #GordonForGovernor Mountain West Credit Union Association formally endorses Mark Gordon for Governor of Wyoming -... The Mountain West Credit Union Association (MWCUA), which represents 21 of Wyoming's federal credit unions, as well as credit unions in Colorado and Arizona, announces it is endorsing Republican Mark... cuinsight.com", "2018-08-16T22:00:02.000Z": "\"While my opponents are trying to buy a title, I'm applying to do the job my life's work in Wyoming has prepared me to do.\" Read my latest in @WTEnews and vote on August 21st! http:// bit.ly/2MuGjk1", "2018-08-16T20:15:24.000Z": "Jennie and I had a terrific visit to Wright. We had a great time visiting the Bloomings Bakery, Cafe and Florist, Wright Town Hall, Wright Senior Center and downtown businesses. #GordonForGovernor", "2018-08-16T18:38:16.000Z": "As State Treasurer, I delivered record investment returns to Wyoming. I know what it takes to work with our State Legislature and get things done. On Day One, I'll be ready to hit the ground running as your Governor. Watch our new ad now! #GordonForGovernor", "2018-08-16T17:20:04.000Z": "Thanks for the support Senator Mike Enzi! Sen. Enzi has been a tremendous champion of Wyoming's energy resources and understands the important role they place in our state and local economies. #GordonForGovernor  https:// goo.gl/jmyVbX", "2018-08-16T14:00:04.000Z": "\"Mark's commitment to WY agricultural, energy and recreational bases is total and he brings thoughtfulness, education, character and collaboration to the table at a time when negativity and stubborn confrontation seem to rule the day.\" #GordonforGovernor Pallister: Mark Gordon is ready to be Governor Editor: trib.com", "2018-08-15T18:30:21.000Z": "\"Mark has the qualities that will make him an effective governor, and I can say something about these qualities, having worked with four Wyoming governors and legislatures in a variety of appointed and advisory capacities.\" #GordonForGovernor Doelger: Mark Gordon is the right choice for governor Editor: trib.com", "2018-08-15T14:56:24.000Z": "My daughter Anne and Marie Geringer representing #TeamGordon at the Guernsey Candidate Meet & Greet sponsored by the Eastern Wyoming College Guernsey Outreach Center!", "2018-08-15T14:00:03.000Z": "As Governor, I'll work to position WY as the leader in advanced energy technologies, including Carbon Capture and Storage (CCS), Enhanced Oil Recovery (EOR), and new carbon-to-product markets. We're seeing promising research every day! #GordonForGovernor  https:// goo.gl/RuxUYx", "2018-08-14T22:00:02.000Z": "\"Mark Gordon's humility and soft-spoken approach to problem solving is impressive, and makes him stand head and shoulders above this crowd.\"  - Thank you for this great letter, Mark! I appreciate your support. #GordonForGovernor  https:// goo.gl/JXA8HM", "2018-08-14T20:58:07.000Z": "The world needs more cowboys, and more lemonade stands.\n\nSo grateful to our youngest supporters and members of #TeamGordon .", "2018-08-14T18:30:03.000Z": "\"What other candidate has returned $5 billion to the State?  That is like the sole reason there's no state income tax in the State of Wyoming during those hard economic times.\" Thank you for the endorsement, @tyler_lindholm ! #GordonForGovernor  https:// goo.gl/dFJVAi", "2018-08-14T14:59:45.000Z": "Jennie and I were honored to join the Tyrell family at the Mark Alan Doherty Scholarship Golf Tournament and Dinner. This annual event raises thousands of dollars every year for scholarships for Laramie County students.", "2018-08-13T22:25:39.000Z": "I'm beyond blessed to have my daughters Bea and Anne out on the campaign trail with me. They've been all across this state, meeting with folks and representing #TeamGordon .", "2018-08-13T21:34:47.000Z": "\"Mark Gordon raised the state coffers by billions of dollars by smart investing. And because of that, the state is no longer talking about an income tax.\" - Thank you for this endorsement, for governor of Wyoming, Mary Meyer! #GordonForGovernor", "2018-08-13T19:08:44.000Z": "Thanks to Bruce and Diane Asay, Bill Whipple, and Larry Barrtlebort for hosting our Veterans for Mark Gordon event. I believe strongly that the brave men and women who have served our country, as well as their families, deserve much more than our gratitude. #GordonForGovernor", "2018-08-12T22:30:07.000Z": "I had a wonderful visit to Rock Springs this week. A special thanks to Bonnie Cannon and John Hay for arranging a great lunch at Coyote Creek Steakhouse & Saloon. Of course, we had to make a quick pit stop at Cowboy Donuts for a little snack for the road. #gordonforgovernor", "2018-08-12T19:00:18.000Z": "Team Gordon was proud to participate in Wyoming Pink Ribbon Runs in Casper and Cheyenne to raise money and awareness for breast cancer. #teamgordon  #cowboyswearpink", "2018-08-12T18:30:21.000Z": "Fun night at the Lander Bar & Grill visiting with friends old and new. We also stopped by @Mavenbuilt , a terrific Wyoming company that creates quality products for outdoorsmen! #GordonForGovernor", "2018-08-12T17:44:58.000Z": "One the best things about Wyoming? Running into old friends and neighbors like Krisinda Wilcox from Kaycee. Krisinda is one of the owners of Metro Coffee in Casper - a terrific place for an afternoon pick-me-up!", "2018-08-12T14:58:53.000Z": "As you've likely seen, my opponents are trying to bring Washington, DC-style campaign tactics to Wyoming. To set the record straight, we've created a website, http:// rightforwyoming.com , addressing the mistruths and outright lies being spread about me -> http:// bit.ly/2w0Ta3d", "2018-08-11T16:40:19.000Z": "\"He's the only candidate who has been elected as a Republican... Wyoming's already chosen him as a conservative leader.\" - Anne Gordon. As your Governor, I'll help promote and protect our shared conservative values. #GordonForGovernor", "2018-08-10T21:46:36.000Z": "Bank of the West needs to hear this - if they do not support Wyoming, our economy and our working families, then I don't support them. I'm proud to be leading the charge to make Wyoming funds 'Closed for Business' to the Bank of the West. http:// bit.ly/2vBcWTI", "2018-08-10T19:54:51.000Z": "This campaign is a family affair for the Gordons! My daughter Anne & nephew Ross have been campaigning in Alpine, Freedom, Star Valley Ranch, Thayne, Bedford, Turnerville and Afton. My wife Jennie was proud to represent #TeamGordon at the Platte County Fair & rodeo.", "2018-08-10T14:28:45.000Z": "Honored to be joined by more than 100 state employees yesterday to discuss the challenges & opportunities they face in our state government. I am committed to ensuring WY's public employees have the resources they need & policies in place to be successful. #gordonforgovernor", "2018-08-09T16:56:24.000Z": "Also an inspiring visit to the Thermopolis Fire Hall Community Open House and Picnic following the parade. I'm grateful to the brave firefighters who risk their lives every day to save others. #GordonForGovernor", "2018-08-09T16:56:23.000Z": "Had an excellent time attending the Annual Gift of the Waters Parade in downtown Thermopolis, which was hosted by the Thermopolis-Hot Springs Chamber of Commerce. Thank you to everyone who came out to show their support! #GordonForGovernor", "2018-08-09T14:00:05.000Z": "U.S. District Judge Brian Morris' ruling only serves to further halt and delay any expansion of coal, oil or natural gas exploration in the Powder River Basin. This decision adds unjustified burdens to Wyoming. #GordonForGovernor Gordon criticizes climate change ruling affecting Wyoming fossil fuels Governor-hopeful Mark Gordon criticized a recent court ruling on Monday that requires the Bureau of Land Management to weigh the impact on climate change from any new oil, gas or trib.com", "2018-08-09T00:00:04.000Z": "\"Mark Gordon is a good man with a big Wyoming heart. He cares about people, their needs and their dreams. Mark's track record proves he is a trustworthy and capable leader who should be the next governor of the great State of Wyoming.\" #GordonForGovernor  https:// goo.gl/xVbxgL", "2018-08-08T15:46:03.000Z": "Great time visiting businesses in Lovell this past week. Main Street businesses are the backbone of our local economies. As Gov., I'll streamline resources and ensure we have trained workforces. Thanks to former Rep. Elaine Harvey for showing us around town! #GordonForGovernor", "2018-08-08T14:07:06.000Z": "\"Mark Gordon understands rural economics, small business, payroll and wages. Like most Wyoming citizens, he believes that energy, agriculture and responsible stewardship go hand-in-hand.\" - Mark Eisele, Wyoming Rancher #GordonForGovernor Agriculture, energy and responsible stewardship go hand-in-hand I'm a lifelong Wyoming rancher. I grew up on a ranch and together with my wife and family, we run a cow-calf-yearling operation in Laramie County. I'm a former president trib.com", "2018-08-07T23:30:03.000Z": "I had a great time at the Wold Energy Partners 5th Annual Gusher Get-Together last week in Casper. Wold Energy Partners is a great example of a Wyoming company who has helped to unleash our natural resource potential for decades. #gordonforgovernor", "2018-08-07T21:29:41.000Z": "I'm a lifelong sportsman. As a habitat provider myself, I'm an active advocate for landowners, sportsmen and wildlife. It's critical to me that we enhance access to our public land and protect private property rights. #GordonForGovernor", "2018-08-06T16:13:53.000Z": "Proud to be the only candidate in the race for Governor of Wyoming with an \"A\" rating from the @NRA ! As Governor, I will always defend and protect our Second Amendment rights. #GordonForGovernor", "2018-08-06T14:11:57.000Z": "This ruling not only adds unjustified burdens to industries only just recovering, but also puts thousands of jobs & the region's economy at risk. As Gov., I will work to push back on rulings & regulations that stall energy production. http:// bit.ly/2vGCHBi", "2018-08-05T01:05:12.000Z": "Team Gordon well represented today in my hometown of Buffalo! The Johnson County Fair & Rodeo has always been one of my very favorite Wyoming events. So many terrific memories with Jennie and the kids! #GordonForGovernor", "2018-08-05T00:07:04.000Z": "Honored to have the support of Susan Thomas, the wife of the late Sen. Craig Thomas, in the race for Wyoming governor. Sen. Thomas was a true conservative voice for the people of our state, and I appreciate Susan's kind words! #GordonForGovernor", "2018-08-04T17:30:05.000Z": "\"This is not a time for Wyoming to elect a 'newbie' to office. There are too many critical issues that Wyoming is facing, and on-the-job training is not an option.\" I know how to work with our lawmakers, and I'll do it as Governor #GordonForGovernor  http:// bit.ly/2M2kFDw", "2018-08-04T00:16:49.000Z": "Recently my opponents have been attacking me for working to promote energy development and responsible stewardship of our natural resources. We can, and should, do both. #GordonForGovernor", "2018-08-03T20:44:34.000Z": "\"One of the things that I've known Mark always to be is just a kind and generous person.\" - Rebekah Fitzgerald. In this campaign, I believe voters are looking for someone who can lead humbly and honestly. That's what I'll do as Governor. #GordonForGovernor", "2018-08-03T14:59:20.000Z": "\"There is no candidate for WY governor that is more qualified than Mark Gordon. He has the smarts, the work ethic, the integrity & the experience to lead WY to a great future!\" Honored to be endorsed by the Buffalo Bulletin! #GordonForGovernor  https:// goo.gl/mQvgDZ", "2018-08-02T17:57:09.000Z": "Last night, I showed that I'm the only candidate in this race ready to hit the ground running on day one. Watch the @CSTribune and @WYPublicRadio debate now to see why! #GordonForGovernor Casper Star-Tribune on Facebook Watch 2018 Wyoming Debates facebook.com", "2018-08-01T20:00:05.000Z": "Developing our natural resources and being responsible stewards of our land are not mutually exclusive. As governor, I'll protect & promote our energy industry while pushing back on federal overreach. Thank you for your support, Wendy! #GordonForGovernor  http:// bit.ly/2OyGrgN", "2018-08-01T17:07:29.000Z": "TONIGHT: at 6:30 p.m., join Team Gordon at the Wyoming Public Radio and the Casper Star Tribune's Republican Gubernatorial Candidate Debate at Wheeler Concert Hall in the Music Building at Casper College! Show your support for Mark and keep him motivated!", "2018-07-31T20:55:00.000Z": "Many of you have seen false and misleading attacks on me in your inboxes and mailboxes. While other candidates will keep attacking, I'll keep working for the state of Wyoming. I have a proven record of results, and I need your support. #GordonForGovernor", "2018-07-31T14:00:04.000Z": "Great visit to Gillette, where I discussed a number of my policies for Wyoming. By protecting & promoting natural resources, encouraging innovation, & getting government out of the way, we can create jobs and grow our local economies! #GordonForGovernor Mark Gordon Talks Energy Platform at The Local in Gillette | County 17 Gordon's policy plan builds infrastructure, localizes decision-making and drives innovation. (Gillette, Wyo.) This morning, Treasurer Mark Gordon spoke with Gillette locals at The Local on Gillet county17.com", "2018-07-30T18:00:19.000Z": "Thanks to the Campbell County Chamber of Commerce for hosting a great opportunity for locals to come visit with their candidates. There's never a bad reason for an ice cream social in Gillette during the summer! #GordonForGovernor", "2018-07-30T15:00:37.000Z": "I had a terrific visit to the Campbell Co. Senior Center in Gillette. Ensuring access to affordable, quality healthcare is one of the most important things we can do to support seniors. #GordonForGovernor", "2018-07-29T21:54:28.000Z": "Thanks to Mike Hays and his grandsons for representing #TeamGordon at the Fremont County Fair Parade!", "2018-07-29T15:25:56.000Z": "Between the parade, street dance, and pig wrestling, I had a lot of fun at the Crook County Fair today, where I got to serve as the spotter for the auction. Thank you to everyone who showed up! #GordonForGovernor", "2018-07-27T20:38:20.000Z": "Jennie and I are sending prayers to everyone in Lovell impacted by yesterday's storms. http:// kulr8.com/story/38750293 /its-kinda-like-a-bomb-went-off-lovell-residents-describe-storm ", "2018-07-27T16:30:05.000Z": "Thank you, Allison, for this inspiring letter. As Wyoming State Treasurer, I have experience working with our legislature, and know what it takes to get bills passed. I'll work hard to expand our energy industry as governor. #GordonForGovernor Gordon has my vote for governor \"When you throw mud  you get dirty\" - Adlai Stevenson. gillettenewsrecord.com", "2018-07-27T15:00:11.000Z": "I had a great time visiting the main streets of Greybull and Worland this week! Wyoming's small businesses are critical to our local economies and in keeping our communities unique. A special thanks to Ron Harvey and Becky Lindsey for showing me around. #GordonForGovernor", "2018-07-27T00:30:08.000Z": "Thanks to the Big Horn County Republican Party for hosting a terrific candidate forum on Tuesday in Basin! Jennie, Anne & I had a wonderful time visiting with folks from across Big Horn County & hearing about the issues impacting their local communities. #GordonForGovernor", "2018-07-26T21:41:00.000Z": "Nothing like a Cheyenne Frontier Days parade to kick-off the day! #GordonForGovernor", "2018-07-26T14:30:18.000Z": "I went on a tour of the Wyoming Rescue Mission in Casper, which began ministering to the homeless back in 1978. It is so important that organizations like these throughout Wyoming keep supporting our most vulnerable citizens. #GordonForGovernor", "2018-07-25T20:30:13.000Z": "Jennie and Anne Gordon had a wonderful time with #GordonForGovernor campaign supporters and volunteers in Thermopolis. The entire crew went door-to-door to share Mark's vision for a better, brighter Wyoming future. Thank you to everyone who came out!", "2018-07-25T17:00:06.000Z": "150 years ago, Wyoming Territory was officially incorporated into the United States. This moment in history put us on the pathway to statehood, a very special time for our part of the country. #GordonForGovernor", "2018-07-24T20:00:05.000Z": "Blockchain is an emerging technology that will propel Wyoming into the future of agriculture. I was proud to attend the Blockchain Task Force meeting in Laramie back in May. As governor, I'll promote efforts like this. #GordonForGovernor Where's the Beef With Blockchain? Wyoming Ranch owners are using blockchain to prove the quality of their cattle as the state passes laws to attract cryptocurrency startups. ozy.com", "2018-07-24T15:00:21.000Z": "I visited Mesa Natural Gas Solutions, an innovative Wyoming company that distributes natural gas generators powered off of well-head gas. What's more, they are committed to hiring and supporting veterans. #GordonForGovernor", "2018-07-23T19:47:55.000Z": "On the Wyoming Gun Owners candidate survey, I received a score of 100% for my pro-gun answers. I'm committed to upholding Wyo's Constitutional Carry law & oppose efforts to take gun ownership rights away from 18-20 year olds. As governor, I'll fight to protect our #2A rights!", "2018-07-20T19:45:03.000Z": "Thank you, Joe, for these encouraging words. As Wyoming State Treasurer, I brought investments here to improve the lives of our people. As governor, I'll remain focused on strengthening our economy. #GordonForGovernor  https:// goo.gl/LfngK5", "2018-07-20T19:00:13.000Z": "Thank you to the volunteers across the state who represented #TeamGordon in Pinedale, Byron, Riverton, Albin, Lingle, Laramie, Lusk, Newcastle, Sundance, Aladdin, Sheridan and Green River - Because of you, we're going to win this race! #GordonForGovernor", "2018-07-20T15:27:38.000Z": "\"It's not political experience people are looking for, it's government experience. He can govern... There is no question about what he can do because he has proven what he has done.\" - Senator Al Simpson. #GordonForGovernor", "2018-07-20T15:00:05.000Z": "WY's outdoor recreation economy generates approx. $5.6B in consumer spending & $1.6B in wages/salaries annually. I'll work to grow our recreation economy by driving new & innovative ways to connect communities, vacation destinations, and points of interest. #GordonForGovernor", "2018-07-19T20:50:18.000Z": "Mark Gordon is my true partner and a great father. I trust him because I've learned that when he says he'll do something, you know it will get done. I know he'll take that approach as governor. - Jennie Gordon", "2018-07-19T19:00:44.000Z": "Rodeo is an important part of my family's history & Wyoming's culture. Fun time at the WYO Rodeo this weekend in Sheridan. Thank you to everyone who came out, as well as the volunteers who made it all happen. Jennie and I can't wait to be back in Sheridan. #GordonForGovernor", "2018-07-19T15:00:06.000Z": "A skilled workforce is absolutely critical to the future of both hospitality & tourism in Wyoming. As Gov., I'll work with industry & our community and technical colleges to better align programming with the needs of tourism and recreation industries. #GordonForGovernor", "2018-07-18T19:00:05.000Z": "The #GordonForGovernor Team was represented well over the weekend in Pinedale, Byron, Riverton, Albin, Lingle, Laramie, Lusk, Newcastle, Sundance, Aladdin, Sheridan and Green River. We're going to win this race door-to-door, person-by-person and neighbor-by-neighbor!", "2018-07-18T15:00:08.000Z": "Nearly 75% of WY residents participate in outdoor recreation every year. And the outdoor recreation economy supports approx. 50K jobs. As Gov., I'll work to keep lands in public hands while fighting to ensure local stakeholders have a voice in land management. #GordonForGovernor", "2018-07-18T00:00:05.000Z": "Thank you to Kevin and Polly Scott for hosting our #GordonForGovernor team in Cheyenne this weekend. We continue to cross that state, sharing our vision for the future of Wyoming, and I always enjoy doing that in Cheyenne.", "2018-07-17T22:00:09.000Z": "A beautiful weekend in Downtown Rawlins with the Espy family for the 2018 SummerFest. Thank you for inviting us out and giving us the chance to meet so many great folks! #GordonForGovernor", "2018-07-17T20:00:17.000Z": "Wyoming is blessed with so many exceptional entrepreneurs! I'm grateful to all of the small businesses, such as Minuteman Press, who are helping promote my #GordonForGovernor message all across the state. Thank you for your incredible support!", "2018-07-17T18:00:07.000Z": "We need leaders committed to making hospitality, travel, and tourism a top priority. As Governor, I will be a relentless champion for the tourism industry, and work with them to develop a plan for sustainable funding into the future. #GordonForGovernor", "2018-07-17T14:35:50.000Z": "The #GordonForGovernor team had a great time in Laramie on Saturday, celebrating Wyoming's statehood at the Laramie Jubilee Days. Started in 1940, this 78th annual event is known as Wyoming's Hometown Celebration. Thanks to everyone who came out and celebrated with us!", "2018-07-13T21:14:32.000Z": "Impressive turnout for the Casper Area Chamber of Commerce Picnic & Politics at the Park. It's always great to connect with small business owners, entrepreneurs, & business leaders of Wyoming. As Governor, I'll work with them to grow & diversify our economy. #GordonForGovernor", "2018-07-13T20:00:06.000Z": "Thanks for the motivation, Robert! I grew up on a ranch in Johnson County - Wyoming is my home. For decades, my wife Jennie and I have managed our own ranch here too. As governor, I'll support farmers, ranchers, and small business owners. https:// goo.gl/4m1Y5C", "2018-07-13T19:38:45.000Z": "A little preview of the 1976 MG #TeamGordon will be using in the Legend of the Rawhide parade in Lusk tomorrow! A special thanks to Joan & Gene Lenz for decking out their beautiful car. Looking forward to seeing you all in Lusk! #GordonForGovernor", "2018-07-12T20:00:06.000Z": "Thank you, Carrie, for these encouraging words. As State Treasurer, I improved Wyoming investments and insisted our government follow the Constitution. As governor, I'll protect and defend your rights! #GordonForGovernor  https:// goo.gl/vKcG2w", "2018-07-12T16:58:30.000Z": "My thoughts go out to everyone affected by the wildfires in Northern Wyoming. I'm grateful for all of the brave firefighters, first responders, and county resources battling the blazes here and all around the West. Northern Wyoming wildfire rages for third day, containment expected to increase A lightning-caused wildfire in northern Wyoming blazed for a third full day Wednesday, while containment was expected to continue past the 60 percent achieved Tuesday night. trib.com", "2018-07-12T15:51:26.000Z": "Had a fantastic time attending the Converse County Republican Party 2nd Annual Family Picnic in Glenrock! It was wonderful meeting with everyone and discussing how we can work together to improve Wyoming. #GordonForGovernor", "2018-07-12T14:30:13.000Z": "Two great looking flags flying over the Happy Jack recreational area in Laramie! Thank you, John Passehl, for proudly displaying your support for our campaign. #GordonForGovernor", "2018-07-11T20:52:00.000Z": "Incredible energy and crowd at the Central Wyoming Fair Parade. Thank you so much for the support, Casper! I enjoyed meeting with everyone who attended. #GordonForGovernor", "2018-07-11T18:45:30.000Z": "\"He is what Wyoming is about. He's a rancher, he's a father, everything before a politician.\" For decades, I've ranched in Wyoming with my family, as well as served in our community. Let's bring our state into the modern era. #GordonForGovernor", "2018-07-11T14:00:08.000Z": "REMINDER: Early and absentee voting is going on now. Any registered voter can request an absentee ballot or vote in-person at their County Clerks' office at any time before the August 21st election. Learn more: https:// bit.ly/1nziHcP  #GordonForGovernor", "2018-07-10T21:45:24.000Z": "Judge Kavanaugh is a strong choice to serve our nation in upholding the laws of our land. His impressive credentials, distinguished record, and conservative ideology make him a solid pick to replace Justice Kennedy. #GordonForGovernor Trump Nominates Judge Brett Kavanaugh for Supreme Court President Trump has chosen federal appeals-court judge Brett Kavanaugh to succeed retiring Justice Anthony Kennedy on the Supreme Court. nationalreview.com", "2018-07-10T20:00:06.000Z": "On this day in 1890, the Wyoming Territory officially became the 44th state in our Union! Today we celebrate all the best parts of our beautiful state, including the freedom, open space, and independent spirit we enjoy to this day. #GordonForGovernor", "2018-07-10T18:26:55.000Z": "This Thursday, come out to the Wyoming Republican Primary Gubernatorial debate in Cheyenne and show your support for Mark as he shares his vision for our state. Doors for the event open at 6:15 p.m. Can't make it to Cheyenne? Watch on @WyomingPBS - Team Gordon #GordonForGovernor", "2018-07-10T13:19:35.000Z": "Jennie and I had a great time at our Meet & Greet Brunch in Cheyenne! Thank you to Dave Berry, and Doug and Susan Samuelson, for hosting such an incredible event. #GordonForGovernor", "2018-07-09T23:42:13.000Z": "Wyoming's natural resources are second to none. As Governor, I will work to smartly leverage our state resources to grow our natural resources economy and drive new energy technology industries right here in Wyoming. #GordonForGovernor", "2018-07-09T20:38:18.000Z": "At the Fourth of July Parade in Saratoga, John and Diana Espy caught everyone's eye with their 1957 John Deere 620 and 1947 Farmall M! Thanks for representing #GordonForGovernor .", "2018-07-08T22:00:05.000Z": "As Governor, I'll fight rules such as Waters of the United States (WOTUS) that would expand federal authority over both surface and underground water quality. I'll defend Wyoming's rights under our interstate compacts. Water belongs to our state. #GordonForGovernor", "2018-07-08T21:56:46.000Z": "Jennie and I had a fantastic time serving up lunch and visiting with folks at the Senior Center of Jackson Hole on Friday.  A special thanks to Jackie Montgomery, Mark Barron and Cornelius Kinsey!", "2018-07-08T18:19:21.000Z": "Wyoming is leading the way with innovations in technology from blockchain to vertical gardens to new ways to control weeds. As Governor, I'll encourage the adoption of transformative and emerging technologies in agriculture. #GordonForGovernor", "2018-07-08T14:00:05.000Z": "Neighboring states, like Idaho, have seen tremendous success in marketing their agricultural products to places like Taiwan, Vietnam, and China. As Governor, I'll make expanding the overseas market for our products a high priority. #GordonForGovernor", "2018-07-08T01:00:06.000Z": "Entrepreneurialism is alive and well across WY with crops like gluten-free oats, hops, custom barleys, sugar beets, spelt, organic wheats, hays & alfalfas. I'll support Ag Innovation Summits & cohesive agriculture policies throughout state government. #GordonForGovernor", "2018-07-07T23:30:04.000Z": "Proposed changes to the H-2A visa program and the associated outlandish OSHA requirements jeopardize the future of many sheep operations. I'll work with WY's congressional delegation in fixing these regulations that simply don't make any sense. #GordonForGovernor", "2018-07-06T23:00:06.000Z": "The advent of Electronic Logging Devices (ELDs) as mandated by the federal government has the potential to disrupt trucking in WY. I'll fight back against these burdensome regulations and suggest meaningful solutions that ensure safety. #GordonForGovernor", "2018-07-06T20:00:05.000Z": "Wyoming citizens are affected every day by a blizzard of delaying, complicated and burdensome federal regulations. I'll lead the way in reforming regulatory structures so they are implemented in a common sense and locally accountable manner. #GordonForGovernor", "2018-07-06T18:10:47.000Z": "Absentee Ballots have been mailed out today, so check your mailbox and make your voice heard. If you haven't requested one, there's still time! Any registered voter can request an absentee ballot at any time before the election. http:// gordonforwyoming.com/voter-informat ion/   #GordonForGovernor", "2018-07-06T16:03:36.000Z": "When our livestock are being preyed upon by bears, wolves or other predators, WY must assure that producers have all the tools they need to manage wildlife when it harms their livelihoods. I'll ensure our wildlife is managed by WY, not the Federal Government! #GordonForGovernor", "2018-07-06T13:59:27.000Z": "The mudslinging has begun. And we knew it would. Mark's opponents have been twisting the facts, spinning half-truths and telling flat out lies. Have a question about Mark's record or history? Email us at mark@gordonforwyoming.com & we'll set the record straight.", "2018-07-05T22:00:07.000Z": "Thanks to my friends Jim Nielson and Anne Young for hosting a terrific night in Cody! Always a treat to be in Cody and visit with folks in Park County! #GordonForGovernor", "2018-07-05T21:11:53.000Z": "\"Mark did a great job as State Treasurer. He was an innovator... and I think that he will definitely bring that over to the governor's office.\" - Kari Hartman, U of Wyoming student. Thank you, Kari. As Governor, I'll continue to look for ways that WY can lead! #GordonForGovernor", "2018-07-05T18:36:48.000Z": "Wyoming producers are entitled to all the protections enshrined within our Wyoming Constitution, which includes safeguards to keep our livestock healthy and viable. As Governor, I will continue protecting your Constitutional rights! #GordonForGovernor", "2018-07-05T16:47:53.000Z": "Team Gordon celebrated Independence Day all across the great state of Wyoming! Thank you so much to our tremendous volunteers who represented #GordonforGovernor in Cody, Dubois, Fort Bridger, Lander, Guernsey, Evanston, Casper, Pavillion, and Gillette!", "2018-07-04T15:00:09.000Z": "On this 4th of July, we celebrate the land of the free & the home of the brave. Our Founding Fathers fought for independence, and the important values of liberty & freedom are something we continue to celebrate every day in Wyoming. #GordonForGovernor", "2018-07-04T00:48:16.000Z": "We have to make sure we get the best returns for our investments. As State Treasurer, I've made changes to Wyoming's portfolio to set us up for even better returns in the future. And as Gov., I'll continue this trajectory #GordonForGovernor", "2018-07-03T18:00:05.000Z": "There are approximately 80 meat plants in Wyoming, yet only two of them are federally inspected and the majority only process game animals in the fall. We need greater processing capacity. As Governor, I'll seek to expand opportunities for WY producers. #GordonForGovernor", "2018-07-03T13:54:59.000Z": "The Spillman family worked incredibly hard over this past weekend in Cheyenne to knock on doors, pound the pavement, and deliver signs for our campaign for governor. I appreciate their dedication and that of all our amazing volunteers across the state! #GordonForGovernor", "2018-07-03T00:33:40.000Z": "It was great visiting the Sheridan Senior Center. Wyoming seniors should have access to the best care and services. As Governor, I'll look towards innovative private sector solutions that can make healthcare more accessible and affordable. #GordonForGovernor", "2018-07-02T21:29:41.000Z": "In WY, beef generates more than a billion dollars in revenue each year. As Governor, I will work with producers and the Legislature to tailor policies to support the branding and marketing of our high-quality agricultural products as 'Born and Raised Wyo'! #GordonForGovernor", "2018-07-02T19:36:27.000Z": "Jennie and I are saddened to learn of Tom Kinnison's passing. As a state legislator and public servant, he was a champion of Wyoming. Our prayers and condolences go out to his family during this difficult time. http:// thesheridanpress.com/90431/kinnison -leaves-legacy-of-service/ ", "2018-07-01T22:39:01.000Z": "\"Mark just kept the focus on students, no matter what the issue, or topic that came up. He was always very focused on student outcomes.\" - Rich Hall, served on Johnson Co. School Board w/ Mark. As Gov. I'll prioritize education & ensure our kids are prepared. #GordonForGovernor", "2018-06-29T20:00:15.000Z": "We have a strong tradition of supporting rodeo throughout Wyoming. My dad competed at Cheyenne Frontier Days, and my daughter Bea competed in rodeo events growing up. Looking forward to enjoying Wyoming rodeos on the campaign trail this summer! #GordonForGovernor", "2018-06-29T17:00:03.000Z": "Last week, I had a fantastic visit to the Gold Buckle Grill in Cokeville. I enjoyed hearing your thoughts on how Wyoming can do better, and how we can work together to improve our state. #GordonForGovernor  https:// goo.gl/UuT4h6", "2018-06-29T15:00:21.000Z": "Wyoming's ranchers and agricultural community are part of the special fabric of our state's culture. Had a wonderful time attending the Wyoming Stock Growers Association Environmental Stewardship Program honoring the Cundall Ranch this week. #GordonForGovernor", "2018-06-29T00:00:14.000Z": "Thanks to Susan Thomas for her friendship and support. We had a great time visiting with folks in Casper this week and talking about the economy, energy, and education! #GordonForGovernor", "2018-06-28T16:36:44.000Z": "Had a great time at the Millennials for Mark event in Casper last night! I appreciated having the opportunity to visit with so many young people about YOUR ideas for the future of Wyoming! #GordonForGovernor", "2018-06-27T20:36:27.000Z": "Did you watch the Wyoming Gubernatorial Debate at Sheridan College last night? I shared my economic vision for our state and how we can expand on opportunities for growth. Check out the debate now! #GordonForGovernor The Sheridan Press 2018 Wyoming Gubernatorial Debate at Sheridan... Live stream of the Sheridan Press 2018 Wyoming Gubernatorial Debate at Sheridan College Whitney Center for the Arts, Sheridan College, WY. Sponsored by the S... youtube.com", "2018-06-27T15:00:05.000Z": "Agriculture is such a crucial part of Wyoming's economy - a new report estimates it contributes $4.2B. As a rancher, I know how important it is to promote our WY products both at home & abroad. As Governor, I will work to do just that. #GordonForGovernor  https:// goo.gl/uBui4w", "2018-06-27T01:43:53.000Z": "You know it's election season when it's time for the Pine Bluffs Pie Social!\n \nThanks to the Pine Bluffs community for hosting candidates from across the state and honoring the event founder, the late Lawrence Anderson.", "2018-06-26T20:58:18.000Z": "Had a great discussion with the @wtenews editorial board about our campaign for Governor. As State Treasurer, I've seen firsthand what we need to do for the future: live within our means. Watch the full interview now! #GordonForGovernor  https:// goo.gl/MXo1qL", "2018-06-25T20:42:15.000Z": "My daughter Anne and I spent the morning with supporters knocking on doors all over Laramie County. We heard a lot of great messages and insights from the people of Wyoming! #GordonForGovernor", "2018-06-24T21:12:10.000Z": "Door-to-door is happening now! Thanks to the Legerski family for hitting the pavement in Cheyenne this weekend. #TeamGordon  #GordonForGovernor", "2018-06-24T15:00:13.000Z": "Great time meeting folks at the Gold Buckle Grill in Cokeville on Friday. The Gordon for Governor team is growing every day. Join us by signing up at https:// bit.ly/2LrVLKy", "2018-06-22T23:00:31.000Z": "Thank you to my friends C.J. Box - Wyoming's #1 New York Times bestselling author of 24 novels - and his wife Laurie for your support and for hosting a great evening in Saratoga, a wonderful town that has the Best Tasting Drinking Water in Wyoming! #GordonForGovernor", "2018-06-22T20:30:04.000Z": "Terrific night at the Evanston Chamber of Commerce Candidate Forum. There is enormous potential in Uinta County to grow and diversify the local economy. I appreciated having the opportunity to discuss issues important to southwest Wyoming! Watch it here: https:// bit.ly/2tl4sPx", "2018-06-22T17:45:22.000Z": "Thank you to everyone who attended the forum in Torrington. As State Treasurer, I know how to work with Wyoming's legislature to get things accomplished. Let's take this experience to the governor's office. #GordonForGovernor  https:// goo.gl/z4as7b", "2018-06-22T16:07:32.000Z": "\"I believe that Mark will give us the opportunity to find a way to provide opportunities to not only my children, but my grandchildren.\" - Bruce Asay, Veteran. I'm focused on making WY a state in which our children will want to work and live in. #GordonForGovernor", "2018-06-21T19:45:31.000Z": "Terrific night in Laramie this week meeting with folks from throughout Albany County. A special thanks to our host Julie Bandemer for opening up her home to our team and supporters! #GordonForGovernor", "2018-06-20T22:52:34.000Z": "\"There's a lot of people who don't understand agriculture. I think he would do a good job helping people understand why agriculture is important.\" - Amanda Kaufmann, Rancher. As a lifelong rancher, I understand Wyoming agriculture & appreciate the value it provides to our state.", "2018-06-20T21:05:07.000Z": "Wyoming ranchers are using blockchain as a tool to modernize beef production. This is a great example of how we can use technology to advance our state's core industries like agriculture. #GordonForGovernor  https:// goo.gl/ZE5Qs6", "2018-06-20T14:00:09.000Z": "Rodeos are such a vibrant and fun part of our Wyoming culture. Enjoyed attending the College National Finals Rodeo (CNFR) in Casper. Congratulations to all the winners! #GordonForGovernor", "2018-06-19T23:00:16.000Z": "Had a fantastic campaign event in Casper hosted by Susan Stubson. It was wonderful meeting everyone and listening to your thoughts about the future of Wyoming. #GordonForGovernor", "2018-06-19T13:00:05.000Z": "Wyoming has been ranked #1 in the entire country for road-tripping! We also have the best ranking for costs and lowest price of camping. I'm glad to see more Americans are discovering what we all know & love about Wyoming. #GordonForGovernor  https:// goo.gl/2Hgikp", "2018-06-18T22:00:56.000Z": "Nothing says 'Gordon for Governor' like a 1957 John Deere 620. Thanks to our Carbon County Campaign Chair John Espy for representing #TeamGordon in the Encampment Woodchoppers Parade. Thank you for the incredible support! #GordonForGovernor", "2018-06-18T17:30:11.000Z": "We need to reduce government spending and pay more attention to costs. Our state needs a fiscally-responsible executive. As State Treasurer, I've been just that and, as Governor, I'll continue to wrangle in spending. Listen to my new interview now! Candidate For Governor Mark Gordon Says The State Needs To Live Within Its Means Wyoming State Treasurer Mark Gordon is looking for a promotion. Gordon is among those who are seeking the Republican nomination for governor. wyomingpublicmedia.org", "2018-06-17T23:00:06.000Z": "A fantastic time joining friends in Dubois last week for coffee. Hearing their thoughts about how Wyoming can do better further encouraged me. As Governor, I'll make Wyoming even better. #GordonForGovernor", "2018-06-17T18:00:04.000Z": "Be it oil, gas, coal, uranium, or wind, when it comes to natural resources, WY has it all! I believe the market should pick winners & losers, not government. My plan includes fewer regulations, more energy freedom, and an 'all-of-the-above' energy plan. #GordonForGovernor", "2018-06-17T14:00:13.000Z": "My husband Mark is a wonderful father to our children. He works so hard for our family and fights for our values every day. I hope you have a special Father's Day today, Mark, and a Happy Father's day to all Wyoming dads! -Jennie #GordonForGovernor", "2018-06-16T20:00:08.000Z": "An exciting trip last week to the Wyoming Fire Academy in Riverton. I went on a tour of the facility, which provides training to help keep WY citizens safe during fires and natural disasters. I'm in awe of our brave firefighters who risk their lives every day. #GordonForGovernor", "2018-06-16T15:30:06.000Z": "To fix the cumbersome regulations & restrictions we face, we must strengthen relationships with federal agencies like the Bureau of Land Management. As Governor, I'll fight against federal overreach and bring decision-making back to Wyoming! #GordonForGovernor", "2018-06-16T14:02:32.000Z": "Team Gordon had a fantastic event in Laramie celebrating Flag Day and all that the Star-Spangled Banner stands for. #GordonForGovernor", "2018-06-15T20:18:23.000Z": "I was proud to attend a special dedication ceremony to honor former Treasurer Joe Meyer's stewardship of Wyoming's State Trust Lands. Joe was a friend and a champion for the state of Wyoming. A wonderful day for a wonderful man! #GordonForGovernor", "2018-06-15T15:15:06.000Z": "Did you know the Wyoming Administrative Code contains 99,566 restrictions and 5.4 million words? That would take seven weeks to read in full! It's time to change that, and I'll work to slash stifling energy regulations & unleash the power of the free market. #GordonForGovernor", "2018-06-14T22:00:05.000Z": "There are big opportunities in WY for our natural resources. We just need to get government out of the way & allow the free market to solve problems. With 99,000 regulations in our state, this is incredibly inefficient and unsustainable! #GordonForGovernor  https:// goo.gl/CZriTQ", "2018-06-14T18:41:45.000Z": "\"Mark knows how to protect and promote Wyoming's energy industry.\" - Peter Wold, Pres. of Wold Energy Partners. As Gov, I'll use my experience in the energy industry & as Treasurer to push for better collaboration between the federal govt, state agencies, and the private sector.", "2018-06-14T15:00:07.000Z": "Wyoming has a proud history of leading U.S. coal production. We can continue that leadership by establishing public-private partnerships to invest in advanced technology like Carbon Capture and Storage and new carbon-to-product markets. #GordonForGovernor", "2018-06-13T19:30:13.000Z": "Had a great time at the Millennials for Mark event in Cheyenne! I'm proud to have the support of their generation & loved having the opp. to hear their ideas for the future of Wyoming. These great minds will help propel our state forward in the 21st century. #GordonForGovernor", "2018-06-13T16:00:05.000Z": "I'm committed to doing more with less by streamlining and better aligning Wyoming's energy agencies & resources to better serve taxpayers, energy producers, and innovators in our state. This will inevitably add even more value! #GordonForGovernor", "2018-06-12T20:00:06.000Z": "To advance Wyoming's energy economy, we have to explore alternative ways to export our resources. As Governor, I'll work alongside the private sector to build the infrastructure necessary to export Wyoming's high-quality minerals. #GordonForGovernor", "2018-06-12T16:45:06.000Z": "This week, I'm excited to share with you my plan for Wyoming's energy industry. With my experience in oil & gas and as State Treasurer, I have what it takes to protect and promote our state's vast resources to grow our economy & create jobs. Stay tuned! #GordonForGovernor", "2018-06-12T14:45:30.000Z": "\"I'm supporting Mark Gordon because I think Mark Gordon is the best candidate for Governor, plain and simple.\" - WY Rep. Landon Brown #GordonForGovernor", "2018-06-12T02:07:51.000Z": "As State Treasurer, I've spent a tremendous amount of time traveling the state meeting with folks & listening to their concerns. As Governor, I'll work to reduce the size of government & ensure The Equality State is fiscally responsible. #GordonForGovernor  https:// goo.gl/gCqKSo", "2018-06-10T01:30:08.000Z": "Ready for the Fremont County Republican Women's debate in Lander! Tune into the Wyoming PBS livestream at 7:00 pm to watch live. #gordonforgovernor  https:// youtu.be/qm4wC0IwenU", "2018-06-08T21:00:13.000Z": "Jennie hit the campaign trail in Fort Bridger, Mountain View, and Lonetree, where she met up with her LEADs buddy Marisa Taylor, her husband Zac Schofield, and Marissa's parents Dr. Robert and Maggie Taylor!", "2018-06-07T22:59:58.000Z": "Hard work. Integrity. Finishing what you start.\n\nThese are shared Wyoming values that have guided Mark through ranching, working in the energy industry, running small businesses, and serving as Wyoming Treasurer. #GordonForGovernor", "2018-06-07T20:09:35.000Z": "The 63rd Annual Convention of the Wyoming Mining Association is this week! Mining is a major contributor to Wyoming's energy industry. As Governor, I'll use my energy industry experience to make our state the leader in advanced energy technologies. #GordonForGovernor", "2018-06-07T14:30:06.000Z": "Jennie attended the Renewal Ball in Uinta County. Funds from the event have gone and continue to go toward the revitalization of the historic business district and Depot Square, currently stabilizing some unfinished parts of the Evanston Roundhouse and Railyards Complex.", "2018-06-06T21:00:05.000Z": "On June 6, 1944, brave Allied Forces stormed the beaches at Normandy in an incredible military effort that led to the defeat of the Nazis. Today, we remember those that lost their lives, and the tremendous courage shown by our American heroes. https:// goo.gl/5ky2K2", "2018-06-06T14:40:09.000Z": "Campaigning is a family affair in the Gordon household! Thanks to Jennie & Bea for taking to the road this past week! Bea & I attended the Campbell County Pink Elephant Ball in Gillette where she helped with the auction. And rest assured that she knows how to use the gun too!", "2018-06-05T18:30:04.000Z": "There are tremendous opportunities for WY minerals and natural resources abroad. With continual roadblocks coming up with terminals on the West Coast of the U.S., WY needs to look at alternative options to export our energy resources. #GordonForGovernor Pruitt calls for selling Wyoming coal to Asia The head of the Environmental Protection Agency hasn't forgotten his recent trip to Wyoming and thinks the largest coal producing state in the country should be exporting overseas. trib.com", "2018-06-04T23:46:58.000Z": "I'm crisscrossing the state, spreading our vision for Wyoming, and I need your help! Sign up to become a part of Team Gordon today, and we can get our message out even further! #GordonForGovernor  https:// goo.gl/TsqqkQ", "2018-06-03T19:20:37.000Z": "Big news for energy and economic development in Wyoming! Congratulations Atlas Carbon. @The_News_Record  https:// bit.ly/2LWKxOf", "2018-06-01T21:52:03.000Z": "Had a wonderful time w/ 2018 Elementary STEM Educator OTY, Heather Gibson of Prairie Wind Elementary. STEM is a critical piece of the puzzle in teaching our kids & making them excited about career opportunities available. Congrats Heather! #GordonForGovernor", "2018-05-29T21:47:09.000Z": "As Wyoming State Treasurer, I cut costs and helped taxpayers by improving returns on our investments. Watch my new ad now to learn how my experience will carry forward into the governor's office! #GordonForGovernor", "2018-05-28T16:15:07.000Z": "The brave warriors who fought and died for our country shall always be remembered. On #MemorialDay , we are grateful for their incredible sacrifice for us.", "2018-05-26T17:00:08.000Z": "I am honored to be joined by an incredible team of community leaders from every single county in Wyoming. My Statewide Campaign committee will help with outreach and education and provide advice on the issues most important to their communities. https:// goo.gl/E8rNwu", "2018-05-26T00:28:50.000Z": "At the Blockchain Task Force meeting in Laramie, I commended our lawmakers for their efforts to bring this industry to WY. Our state is now not only positioned to be a national leader in this growing economy, but to really blaze a trail for virtual currencies. #GordonForGovernor", "2018-05-25T17:03:59.000Z": "It's official! Yesterday, I filed to run for governor of Wyoming. With your support, we can push back against federal overreach, embrace limited government, and create real opportunity for our families. Join our team: https:// bit.ly/2LrVLKy  #GordonForGovernor", "2018-05-24T19:34:30.000Z": "It was my honor to attend the official opening of the new Wyoming Women's Suffrage Pathway section of Highway 28. The Equality State has a rich history of women's rights dating back to 1869. #GordonForGovernor  https:// goo.gl/gKBZc5", "2018-05-24T00:36:24.000Z": "As a lifelong Wyoming sportsman & rancher, I applaud the Wyoming Game and Fish Commissioners for their decision today. A terrific example of why decisions about Wyoming lands & wildlife belong in Wyoming hands. As Governor, I will fight to keep it that way Amid debate, Wyoming approves grizzly hunt A debate over whether the Yellowstone ecosystem's grizzly bear population can thrive while being hunted will be put to the test this fall after Wyoming officials on Wednesday approved the trib.com", "2018-05-23T17:40:14.000Z": "Thank you to the @WYOBA for providing a terrific opportunity for candidates to discuss their ideas to support Wyoming's business community. I appreciate their tremendous work in propelling Wyoming industries forward. #GordonForGovernor", "2018-05-22T17:52:43.000Z": "Thank you to Mayor Doug Frank for hosting our event in Glenrock last Friday. What a great opportunity to meet with incredible community members. #GordonForGovernor", "2018-05-22T01:03:21.000Z": "Had a fantastic visit to the Pathways Innovation Center in Casper on Friday. They're training Wyoming kids for the jobs of today and opportunities of tomorrow. It's a really tremendous facility, and is definitely an important part of the education puzzle. #GordonForGovernor", "2018-05-19T18:00:02.000Z": "The Wyoming ITC is a terrific example of our state's leadership and commitment to market-driven solutions. When we talk about growing and diversifying our economy, energy will continue to be an important piece of the puzzle. ITC is good to go To the untrained eye, the 226,000 square feet of leveled ground with intermittent pipe couplings looks like a big, empty space. gillettenewsrecord.com", "2018-05-18T23:00:02.000Z": "University of Wyoming's Class of 2018 has shown great entrepreneurial spirit! Congrats to Kennan Oyen & Claire Ratcliffe, who won the John P. Ellbogen $50K Entrepreneurship Competition and will receive major investments in their business plans. https:// goo.gl/WezLqf", "2018-05-17T18:05:04.000Z": "Team Gordon needs you! I'm fighting for our shared Wyoming values, and it would be great if you could help us spread the word by signing up to join us! Fill out the form at the following link and RT to help spread the word! #GordonForGovernor  https:// goo.gl/TsqqkQ", "2018-05-16T01:00:04.000Z": "As State Treasurer, I've been proud to help grow and improve the WYO-STAR program that allows local governments to pool their money together to increase their investment returns. These funds are essential for infrastructure projects. #GordonForGovernor  #InfrastructureWeek", "2018-05-15T20:15:06.000Z": "My thoughts and prayers are with the @FLOTUS as she recovers from her kidney procedure. We're all hopeful that you're back to 100% very soon! #GordonforGovernor", "2018-05-15T16:05:14.000Z": "I joined the Republican Women of Sheridan County last week for lunch and to discuss our campaign for Governor. They do a great job of promoting conservative priorities in Sheridan County. #gordonforgovernor", "2018-05-15T01:15:06.000Z": "Today kicks off the sixth annual Infrastructure Week! Repairing, upgrading, and investing in Wyoming's infrastructure is one of the best ways to spur economic growth and to ensure we're ready for the future. #GordonForGovernor  #InfrastructureWeek", "2018-05-14T21:00:30.000Z": "Great turnout at the Platte County Republican Party forum last Thursday in Wheatland! We are lucky to live in a state with so many passionate citizens who want the very best for Wyoming. #gordonforgovernor", "2018-05-11T19:00:04.000Z": "Honored to have the support of Peter Wold, one of Wyoming's most accomplished businessmen. He understands what it takes to grow our economy & create quality jobs for folks across Wyoming. Great to have him on the team, and to have him serving as our Statewide Campaign Chair.", "2018-05-11T14:25:07.000Z": "Enjoyed attending the monthly meeting of the Casper Chapter of the Patriot Guard Riders, an incredible organization whose members attend the funerals of members of the U.S. military and first responders at the invitation of a decedent's family.", "2018-05-11T01:15:17.000Z": "Tyler Reed Miller, who runs Earth Works Solutions, was named Wyoming's Small Businessman of the Year last week by the U.S. Small Business Administration. Jennie and I met with him last week and checked out his company. Congratulations, Tyler!", "2018-05-10T18:25:26.000Z": "Would you like to show your support for my campaign? We have a everything from t-shirts to bumper stickers to yard signs and more! Email mark@gordonforwyoming.com to get your Gordon for Governor swag today. Please SHARE with your friends to help us spread the word!", "2018-05-10T16:10:13.000Z": "A great night at the Friends of the @NRA banquet in Gillette. I am a lifelong member of the NRA and believe the right to bear arms is absolute. Growing up on a ranch, owning guns is part of our way of life. I will continue to be a staunch defender of the Second Amendment.", "2018-05-10T02:00:24.000Z": "The Old West Invitational Turkey Shoot was held this weekend in Hulett. This annual event promotes wildlife conservation in Wyoming and raises money for the Wyoming Wildlife Foundation (WWF) and the Greater Hulett Community Center (GHCC).", "2018-05-09T16:44:03.000Z": "Opioid abuse across Wyoming is increasing on pace with the national trend. Our legislature took action by establishing an Opioid Addiction Task Force to bring together different stakeholders to look at solutions. But this must continue to be a priority! Carbon County files lawsuit against more than 15 opioid manufacturers, distributors Carbon County filed a federal lawsuit Tuesday against more than 15 opioid manufacturers and distributors - including giants Purdue Pharma and Johnson & Johnson - for \"alleged misrepresentation about... trib.com", "2018-05-08T21:45:15.000Z": "Jennie and I had a great visit to my hometown of Kaycee last week, visiting local businesses and hosting a lunch with friends old and new. It's inspiring to see the success of our Wyoming entrepreneurs!", "2018-05-08T18:56:01.000Z": "Please join me in celebrating the wonderful teachers and educators who go above and beyond every day to prepare Wyoming's future leaders for success. We can't thank them enough for all of their hard work and effort on this #TeacherAppreciationDay , and always!", "2018-05-08T14:35:03.000Z": "Wonderful talking with County 17 about my vision for WY. I've worked in agriculture, energy, and tourism, in addition to being State Treasurer for 6 years. I'll be ready on day one to take on the responsibilities of governor. Watch the full interview now! Full Interview With Mark Gordon | County 17 State Treasurer Mark Gordon announced his bid for governor of Wyoming in February, gunning for the Republican ticket. He's running on three principles: balanced budget, minimizing the impact of f county17.com", "2018-05-08T02:00:03.000Z": "Had an excellent time meeting with folks at the Prime Rib Restaurant in Gillette. As governor of Wyoming, I'll focus on balancing the budget, decreasing the impact of federal government regulations, and strengthening our education system. Mark Gordon Holds Meet and Greet in Gillette | County 17 (Gillette, Wyo.) State Treasurer Mark Gordon announced his bid for governor of Wyoming in February, gunning for the Republican ticket. He's running on three principles: balanced budget, minimizin county17.com", "2018-05-07T20:06:03.000Z": "Thank you to everyone who attended our Business After Hours event last Thursday in Buffalo! We had a great turnout, and I'm always happy to visit with so many family, friends, and neighbors. Thanks for joining us!", "2018-05-04T14:15:05.000Z": "I think this might be the best campaign slogan I've seen yet! I'm smart enough to know my wife Jennie is the real all-star on this campaign, and I know she'll make a tremendous First Lady for our state. Glad to see so many voters clearly agree!", "2018-05-04T02:01:33.000Z": "It's branding time at our family ranch outside Kaycee! A big thank you to the friends, family and crew - young and old - who pitched in to get the job done. And thanks to Sonya Boom-Atwell and Jennie for the great photos!", "2018-05-04T02:01:02.000Z": "It's branding time at our family ranch outside Kaycee! A big thank you to the friends, family and crew - young and old - who pitched in to get the job done. And thanks to Sonya Boom-Atwell and Jennie for the great photos!", "2018-05-03T20:25:27.000Z": "Enjoyed being in Natrona County last night to support the local Republican Party at their event with Navy Seal Commander, and author of \"Act of Valor\", @rorkedenver . Truly great time with friends, fellow conservatives, and an American hero!", "2018-05-02T15:00:03.000Z": "Tomorrow, from 5-7 p.m., my wife Jennie and I are hosting a Business After Hours event at our Buffalo headquarters. Come on out, and bring your questions on how we can improve Wyoming. Don't forget to tell your family and friends! #GordonForGovernor Front sheridanmedia.com", "2018-05-01T20:48:17.000Z": "Humbled to receive these encouraging words from Doug & Charlene Camblin, who are doing a wonderful job representing Campbell Co as proud Republicans. As Wyo's governor, I'll work hard every day to improve life across the Cowboy State. http:// gordonforwyoming.com/2018/05/01/mar k-gordon-is-best-person-for-governor/   #GordonForGovernor", "2018-04-30T15:30:04.000Z": "I have three top priorities for Wyoming: 1) reduce the size of government 2) reduce government regulations and 3) strengthen our education system. As governor, I'll increase efficiencies and and bring new businesses to our state. https:// goo.gl/x6MCYY", "2018-04-28T16:45:04.000Z": "As Wyoming State Treasurer, I'm intimately familiar with our energy, tourism, and agriculture sectors. I want to hear from everyone about the unique challenges they face, so that we can grow our state and be prepared for the future. https:// goo.gl/wymuXS", "2018-04-27T22:00:18.000Z": "While I was in Sheridan this past week, I had the chance to speak to @Vol_of_America Northern Rockies. I proudly serve on the board of this organization which is committed to supporting veterans, families, young people, the homeless, and so many others in times of crisis & need.", "2018-04-27T18:40:04.000Z": "Traveling all across Wyoming is one of the best parts of my job! As Treasurer, I've worked hard to safeguard our state's resources & protect the Constitution. I strengthened our economy through investments, and as Governor, I'll keep it strong for you. Mark Gordon Campaigns in Wyoming Cody - Wyoming's Treasurer, Mark Gordon, said thinking out of the box allowed him to help Wyoming make a billion dollars more income on the state's investments. kulr8.com", "2018-04-27T15:45:07.000Z": "I am running for Governor because I want to clear the way for YOU, your friends, your children, and grandchildren to write your own chapter in Wyoming's book. This means having the opportunity to pursue your passions right here in Wyoming. In rural Wyoming, economic diversification is more of a challenge When the recent population figures for Wyoming were released earlier this spring, they showed a dramatic drop - more than 8,000 people had left the state in total during the trib.com", "2018-04-26T01:35:21.000Z": "My wife Jennie & I really enjoyed attending the Wyoming Congressional Award Recognition Ceremony this past weekend. The awards are given out to young men and women with achievements in community service, and personal growth. Really impressed by the young people who were honored!", "2018-04-25T02:00:11.000Z": "Had the opportunity to speak at Superior Livestock events in Casper & Buffalo last week. My wife Jennie and I run cattle at our ranch in Johnson County and know firsthand what goes into this auction process and how important it is for Wyoming ranchers. Appreciate you having us!", "2018-04-24T15:15:08.000Z": "If you ever had doubts, I can assure you Wyoming's future is in great hands. University of Wyoming students presented to the State Loan and Investment Board last week, and did a remarkable job. Their class manages a $1 million portfolio for the University Permanent Land Fund.", "2018-04-23T14:30:08.000Z": "Thanks to Jim and Terry Wilson for hosting us during our meet and greet event in Thermopolis. Super turnout and thoughtful questions from engaged citizens.", "2018-04-21T14:30:06.000Z": "Big thank you to the @WYGOP for hosting a great dinner and auction last night. Enjoyed spending time with so many friends, and fellow Republicans like Representative @Liz_Cheney , Senator @barrassoforwyo and his wife Bobbi, and @SenatorEnzi . Great night!", "2018-04-20T17:33:06.000Z": "Enjoyed speaking this past Wednesday at the Wyoming Association of Rural Water Systems Regional Water Finance Forum. We discussed important infrastructure projects as well as the state's financial picture. We're working together to protect Wyoming water!", "2018-04-18T15:19:33.000Z": "Have you heard the story about how our cowboy campaign logo came to be? It was created by my friend, Big Horn artist Joel Ostlind. It reminds me so much of Wyoming - rodeo, work, the place we live, and the things we love to do. #GordonForGovernor Logo of gubernatorial candidate based on local artwork BIG HORN - Local artist Joel Ostlind didn't set out to have his work seen around the state for a political campaign. But when a friend [] thesheridanpress.com", "2018-04-18T15:00:03.000Z": "Thanks to the Washakie County Republican Party for hosting a fantastic Lincoln Day Dinner. Jennie and I enjoyed having the opportunity to visit with the hard working men and women who support local and state Republican candidates.", "2018-04-17T14:30:04.000Z": "Once again, a spring storm shows how passionate Wyoming people are about tackling the challenges that face our state. Thanks to everyone who braved slick roads to join us in Greybull!", "2018-04-16T16:54:24.000Z": "Looks like I've finally made it to the big leagues! Guess who appears as a character in @cjboxauthor 's newest book, \"The Disappeared\"? As usual, his latest literary installment doesn't disappoint. #TheDisappeared", "2018-04-16T14:00:07.000Z": "We enjoyed our quick stop in Emblem as we crisscrossed Wyoming last week.", "2018-04-15T13:00:04.000Z": "Jennie and I stopped in Frannie during our tour of Northwest Wyoming last week. It's the only town in our state to be in parts of two counties, earning its \"Biggest Little Town In Wyoming\" slogan.", "2018-04-14T15:00:06.000Z": "Deaver Mayor William Camp and I visited the site of a SLIB-funded project to replace aging pipeline. We need to continue to support our local communities and ensure they have the adequate infrastructure they need to thrive.", "2018-04-13T14:30:06.000Z": "It's always a treat to visit with friends - old and new - in Cody. It was a pleasure to speak with the engaged citizens of Park County!", "2018-04-12T14:00:07.000Z": "A good group came out to our meet and greet in Meeteetse, and asked thoughtful questions about Wyoming's future. Thanks for attending!", "2018-04-11T13:30:05.000Z": "Saw Kenli Bauer play soccer in Worland this weekend on the way to the Washakie County Lincoln Day Dinner. I used to coach Buffalo Blast Soccer & it was great to cheer the Bison Girls on. I miss it. Kenli's parents helped get the Merlin Ranch started back in 1988. Go Bison!", "2018-04-10T14:50:14.000Z": "Today, Jennie and I completed our first full swing through all 23 Wyoming counties since announcing our campaign for governor on March 14. A big thank you to the people of Wyoming for all of their support! Full Swing! Today, Jennie and I completed our first full swing through all 23 Wyoming counties since announcing our campaign for governor on March 14. A big thank you to... youtube.com", "2018-04-07T16:00:05.000Z": "Never too busy to stop and take a moment to revel in Wyoming's spectacular scenery. I was inspired to pull over on the way to Thermopolis this week to capture the beauty of our state.", "2018-04-06T16:00:09.000Z": "My favorite gun was crafted and engraved by Wyoming Arms, a terrific Wyoming company that manufactures these incredible firearms in Cody. I'm proud to add this guy to my collection and proud to support local businesses in our state.", "2018-04-05T16:16:28.000Z": "Look at this sweet babe! This young one is the granddaughter of Steve and Dana Cranfill who I met in Cody. The campaign trail has been wonderful to us and I'm enjoying meeting some of our newest soon to be Wyoming voters.", "2018-04-04T18:13:09.000Z": "Tourism is the second-largest industry in Wyoming, and UW just added a new major focused on it. With hunting, fishing, hiking and other outdoors activities, combined with rich history and beautiful wildlife, our state has so much to offer. UW offers new outdoor recreation and tourism degree LARAMIE, Wyo. - The University of Wyoming will offer a new degree in outdoor recreation and tourism management. billingsgazette.com", "2018-04-03T18:13:29.000Z": "This week, I'm traveling all over Northwest Wyoming to learn what matters to you! If you're around, please stop by one of our campaign events this week in Meeteetse, Cody, Greybull, Basin, and Thermopolis! https:// goo.gl/fuK5jW", "2018-04-03T01:04:18.000Z": "In spite of a spring storm & school closings, republicans braved the weather to come out for Campbell County Republican Women's lunch last week. We even saw our dear friend Marjorie Rainwater who was chauffeured to lunch by another friend, Nick Kasperik. Thanks for joining us!", "2018-04-01T14:00:12.000Z": "Happy Easter from the entire Gordon family! We hope you are enjoying this day with your friends, family members, and loved ones.", "2018-03-31T13:30:06.000Z": "Another great stop on the campaign trail in Spotted Horse. Jennie and I got to meet Coleen Eisele and enjoy the best hamburgers in town. #gordonforgovernor", "2018-03-30T21:00:05.000Z": "I joined Wyoming State Auditor Cynthia Cloud in hosting a lunch for the Wyoming Cowboy Challenge Academy in Cheyenne earlier this month. I enjoyed visiting with cadets from across Wyoming. This great program helps educate and train Wyoming's youth! https:// goo.gl/rRBksz", "2018-03-30T16:00:08.000Z": "Thanks for attending our meet and greets in Cheyenne, Douglas, and Green River! It's great to hear so much passion for our state and what Wyoming can do better.", "2018-03-29T18:35:12.000Z": "Jennie and I are traveling across Wyoming to learn what matters most to you. We stopped in Hartville, our state's oldest incorporated town still in existence. It was established in 1884!", "2018-03-29T16:00:12.000Z": "It was wonderful meeting everyone at our events in Laramie, Buffalo, and Rawlins. Your enthusiasm for Wyoming is inspirational. I appreciated hearing your thoughts on how we can improve our state, together.", "2018-03-28T16:30:11.000Z": "Thanks to everyone who joined us for the meet and greets in Evanston, Glenrock, and Kemmerer! We received an incredibly warm welcome from each and every one of you. I loved learning what issues matter most to you. Thanks for coming out & sharing your concerns with our campaign!", "2018-03-27T21:00:11.000Z": "I was proud to join citizens from across our state today in Gillette to urge the EPA to repeal this wrongheaded, community-killing, wreck of a rule.", "2018-03-27T17:44:40.000Z": "I'm in Gillette today calling on the Environment Protection Agency to immediately repeal the Clean Power Plan. This wrongheaded rule has had devastating impacts on Wyoming families, communities as well as our state and local economies.", "2018-03-24T14:00:15.000Z": "Jennie and I enjoyed seeing everyone at the 11th annual Sheridan Empty Bowl, hosted by Volunteers of America. This fantastic organization provides awareness and services to those in our community who need help. Thanks @GailSymons for the photos!", "2018-03-22T16:28:22.000Z": "My wife Jennie and I are proud ranchers. More than 11,000 ranches operate in our state, and cattle is the largest aspect of the Wyoming agriculture industry. This is a wonderful tribute to all of the hardworking farmers and ranchers here. Salute to agriculture They are up with the sun. They work in the snow, the wind and the heat. buffalobulletin.com", "2018-03-21T19:01:44.000Z": "KTWO provided great coverage of our campaign announcement last week. As Wyoming State Treasurer, I know what it takes to right our fiscal ship. Check out this video! https:// goo.gl/9KYLbM", "2018-03-20T21:12:11.000Z": "Celebrate #NationalAgDay by honoring the Wyoming ranchers and farmers who work hard to put food on the tables of families all across the country. Your dedication to our agriculture industry contributes so much to our economy. #ProudRancher  #GordonForGovernor", "2018-03-20T14:00:12.000Z": "I was really impressed by 18-year-old Autumn Zulauf from Torrington, who attended our event last Friday. She asked some smart and thoughtful questions for her school paper. Looking forward to meeting many more future leaders in Wyoming like Autumn as I travel the state!", "2018-03-19T14:30:07.000Z": "Thank you for these kind words, Al & Ann Simpson! \"Mark is the only candidate in this race who has the experience, values, savvy and grit to get crackin' and get the job done from day one ... He's tough. He's tested. He's 'saddled up' to lead our great state forward.\"", "2018-03-17T16:12:37.000Z": "Please stand with our campaign for governor of Wyoming! Chip in a donation to help us generate momentum, and get to the hard work of winning this election. https:// secure.anedot.com/1fomg8/launch", "2018-03-16T20:00:07.000Z": "In Buffalo, we had a fantastic campaign announcement celebration.  Wyoming is the best state in the country to raise a family and start a business, and as your governor, I'll reduce the size of government to keep our economy on track for growth. #GordonForGovernor", "2018-03-16T15:38:25.000Z": "It was thrilling to announce our campaign for governor this week. I'm ready to get the federal government out of our way. It's time for the people of Wyoming to thrive without interference from D.C. #GordonForGovernor", "2018-03-16T01:00:06.000Z": "All of your kind words and support today has been deeply encouraging. Thank you for stepping up! I'll be traveling across Wyoming to learn from people like you, and hear your thoughts and suggestions.", "2018-03-15T19:00:06.000Z": "As Wyoming's State Treasurer, I transformed the office, improving returns on state investments and creating better protection of state savings. I can't wait to get to work for all Wyoming people as our next governor. Sign up to join our team now! http:// gordonforwyoming.com/join-us/", "2018-03-15T16:30:17.000Z": "It's official: I'm running for Governor because I love Wyoming. I want to serve Wyoming. I want to grow Wyoming. Let's help bring the American dream to every citizen living in our beautiful state.", "2018-03-13T18:25:24.000Z": "The ag industry is constantly growing and evolving as we progress into the 21st century. New tech brings efficiencies to farming. As a rancher, I've seen many changes over the years and know WY is well positioned to drive and grow these new technologies. https:// goo.gl/84df4L", "2018-03-12T17:25:04.000Z": "Shelley Simonton's passion for the outdoors led to the passage of \"Shelley's bill,\" helping to secure the future of the WY Women's Foundation Antelope Hunt. Jennie & I have been proud to support this tradition providing opps for women hunters in WY! 'Shelley's bill' secures future of women's antelope hunt Shelley Simonton would have been smiling Friday afternoon as Gov. Matt Mead signed a bill that will secure the future of the Wyoming Women's Foundation Antelope Hunt, a program Simonton jhnewsandguide.com", "2018-03-09T18:14:33.000Z": "When big government is kept out of the way, our economy is capable of immense growth. And that's what happened last month: our country added the most jobs since 2016, wages increased, and the unemployment rate is at a 17-year low. https:// goo.gl/K19uQu", "2018-03-08T17:31:02.000Z": "It was great to join the @r2rpcast to talk about Wyoming public lands and wildlife issues. We must protect our way of life from bureaucrats in D.C. https:// goo.gl/pKDVxL", "2018-03-07T17:00:07.000Z": "Happy 307 Day! Today we celebrate everything that makes Wyoming great - the people, the mountains, and our incredible spirit. What do you love about Wyoming? #FlyYourWY", "2018-03-02T15:00:08.000Z": "Thank you to State Superintendent of Public Instruction Jillian Balow for the opportunity to join the 2018 S5S Policy Summit. As a former Johnson County K-12 #1 School Board Member, I enjoyed having the opportunity to discuss the importance of financial literacy.", "2018-03-01T16:00:06.000Z": "I had a wonderful time attending the Wyoming Taxpayers Association Toast & Taxes Breakfast. This organization does great work protecting Wyoming taxpayers and ensuring our dollars go further and work harder in Cheyenne.", "2018-02-28T16:30:14.000Z": "Ranch days are the best days. I got to help Jennie and crew out on the ranch this weekend, checking out the new lambs, feeding cows and rolling hay.", "2018-02-27T17:00:06.000Z": "My wife Jennie was featured for her work managing our ranch near Buffalo- she does it all! We're very thankful for the great crew we have at Merlin Ranch -- Kevin, Becky, Konnor, Peyton and Kalob. Gordon Family Mark and Jennie Gordon are Wyoming Ranchers. wybeef.com", "2018-02-26T16:00:05.000Z": "I took this photo of a coal train, oil well, and that wonderful Wyoming vista on my way back from an annual meeting of the Thunder Basin Prairie Ecosystem Association in Bill, WY. It summed up for me what we all love about this place: industry, energy, and wide-open spaces.", "2018-02-23T17:00:03.000Z": "I've always enjoyed ascending many of Wyoming's magnificent peaks across our great state. Hats off to these brave climbers at the Cody Ice Festival, who scaled vertical ice and frozen waterfalls. Wow! https:// goo.gl/dKdnHT", "2018-02-22T15:30:05.000Z": "I enjoyed visiting with the High Plains FFA Chapter from Central High School in Cheyenne. The agriculture education and leadership training FFA Chapters across the state provide to Wyoming's young people is invaluable. The future of Wyoming will be in good hands.", "2018-02-21T16:30:09.000Z": "I had a fun time attending the Natrona County Republican Party Lincoln Day Dinner on Sunday evening, where past and current chairs were honored. Thanks to the Natrona County Republican Party and the hard-working volunteers who support Republicans!", "2018-02-20T17:00:08.000Z": "Jennie and I attended the 11th Annual Cheyenne Frontier Days Crisis Fund Dinner & Auction. This organization provides emergency assistance to a Cheyenne Frontier Days family when they are faced w/ a tragic loss. Special thanks to Joe Lopez & the CFD Crisis Fund team!", "2018-02-19T21:30:06.000Z": "Have a wonderful President's Day! Have you visited the Abraham Lincoln Memorial Monument in Laramie? What's your favorite local park in Wyoming named after one of our Presidents?", "2018-02-19T17:22:15.000Z": "Last week, I visited Casper to speak with Frank Chapman, @SloanDickey , and Dallas Laird on K2TV. We discussed the important work of the Treasurer's office, the ongoing legislative session, and the state's budget. Stay tuned for when this interview airs!", "2018-02-16T17:13:53.000Z": "It's currently Random Acts of Kindness Week in Wyoming. Last year, more than 30,000 acts were recorded in this effort. Given the warmth and generosity of the people of our state, I bet we'll surpass that number for 2018. https:// goo.gl/rWVyq8", "2018-02-15T16:00:05.000Z": "Jennie and I are excited to attend the National Finals Rodeo, a trip we bid on at Lariats-n-Lace during the LCCC Rodeo Team Scholarship Benefit Auction. A special thanks to nine-time NFR qualifier KC & Gayle Jones for donating the tickets!", "2018-02-14T19:07:48.000Z": "Had a great time at the Torrington Volunteer Fire Department Awards Banquet, with my wife Jennie. It was great visiting with Cindy and Chuck Kenyon, Betty Law, and Bill Law, who is celebrating his 55th year of volunteering! Thank you for your dedication.", "2018-02-09T19:04:42.000Z": "It's official: The Winter @Olympic Games are back! I'm ready to see @TeamUSA rack up the gold medals, especially our Wyoming athletes, Breezy Johnson, Resi Stiegler, and Jaelin Kauf. What's your favorite Olympic sport to watch?", "2018-02-08T16:50:04.000Z": "Had a great time at the Sweetwater Memorial Hospital Foundation Red Tie Gala with Larry Lloyd and Fred Von Ahrens. Since 2006, they've raised $6 million to finance new equipment, better beds, and laboratory supplies that are helping Wyoming patients.", "2018-02-06T18:42:29.000Z": "I enjoyed visiting Sweetwater Regional Cancer Center, where I met with Dr. Zachary Nicholas, a radiology oncology physician. This incredible facility provides many different types of care to patients.", "2018-02-05T17:52:49.000Z": "In case you missed my appearance on @WyomingPBS 's Capitol Outlook on Friday night, the full episode is online for streaming. Check it out now! https:// goo.gl/99WWXn", "2018-02-02T15:41:25.000Z": "I'm looking forward to appearing on Capitol Outlook on Wyoming PBS this evening. I'll be discussing the strength of Wyoming's economy, financial improvements to our state, and the importance of government transparency. Tune in at 7:30 p.m. tonight! Quote Tweet Wyoming PBS @WyomingPBS WyomingPBS kicks off its Capitol Outlook season with an exclusive interview with Wyo Treasurer Mark Gordon. We ask whether Wyo's fiscal strength is strong, his thoughts on Wyo economy and about transparency improvements he's made in his office. Fri 7:30 p.m. #wyleg", "2018-02-01T21:17:20.000Z": "I'm honored to be recognized by my friend, Buffalo Mayor Mike Johnson. Smart investments yield real impacts for our local communities. As State Treasurer, ensuring success of WYO-STAR is a top priority. Front sheridanmedia.com", "2017-11-16T14:56:02.000Z": "#tbt earlier this year WIA's Exec Dir shared how WY is depoliticizing carbon w/ innovative projects like @WyomingITC  https:// buff.ly/2hg1pFo", "2017-11-17T21:42:47.000Z": "The mess we are in is our own fault. Until we stop demanding that government give us more, they'll never stop taking more.", "2017-11-14T17:06:28.000Z": "Great Wyoming family,wonderful legacy! Quote Tweet Rep. Liz Cheney @RepLizCheney Great interview from Heidi Merritt, the daughter of Hyde Merritt, a Cheyenne native who will be inducted into The National Rodeo Hall of Fame. What an incredible and well-deserved honor. http:// trib.com/news/state-and -regional/wyoming-rancher-to-be-inducted-into-national-rodeo-hall-of/article_6a059ec1-917e-5fe6-86fc-b7495e7ade6e.html ", "2017-11-03T18:25:47.000Z": "Just finished touring all 40 airports in Wyoming with Saratoga! Wyoming, you are a massive state. Quote Tweet Wyoming Aeronautics @flywyo Saratoga and Airport stakeholders including Mayor Glode. Thanks for a great visit!", "2017-11-02T23:35:13.000Z": "My statement on the House Republican tax reform plan, the Tax Cuts and Jobs Act: https:// goo.gl/ytGxGK", "2017-11-03T19:25:28.000Z": "Gross Receipts to the Treasury this month are the strongest in four and a half years. https:// ok.gov/triton/modules /newsroom/newsroom_article.php?id=222&article_id=37494 ", "2017-10-01T00:08:03.000Z": "Joe Tiller was a great coach and a better man. @wyo_football was better for him and reaped the benefits of his legacy. What a guy!", "2017-09-27T21:41:02.000Z": "Barrasso presses DOE nominee on committment to coal research https:// buff.ly/2wWLbCS via @cstribune  #carboncapture  @WyomingITC Barrasso presses DOE nominee on committment to coal research Sen. John Barrasso pressed a Trump nominee Tuesday on the agency's commitment to one of Wyoming's key aims in recent years: capturing carbon dioxide from coal-burning power plants and using trib.com", "2017-09-27T18:17:07.000Z": "Three years ago today - and we are still smiling! Happy Anniversary @JimmyOrr .", "2017-09-16T15:12:36.000Z": "@ESPN  @CollegeGameDay thanks for the love. #Wyoming  @wyo_football", "2017-09-12T18:22:58.000Z": "We must end status quo that is damaging our land, resources & livestock and is inhumane for the horses. Quote Tweet Casper Star-Tribune @CSTribune Cheney votes against slaughter ban as wild horse herds grow https:// buff.ly/2gYYMDy", "2017-09-13T17:27:22.000Z": "Well spoken sentiments indeed @TimStubson Quote Tweet Tim Stubson @TimStubson Robert McKim resigned his seat in the Wyoming House. I want to recognize Robert for his steady hand and his many kindnesses over the years.", "2017-09-03T23:29:10.000Z": "@cjandersonb22 looks like Broncos backfield and O Line have a nastiness about them they didn't have last year. It's gonna be fun! #BRONCOS", "2017-08-29T18:01:36.000Z": "Centennial Farm and Ranch Family 20165: Panno Ranch", "2017-08-27T12:58:18.000Z": "Prayers for TX.", "2017-08-27T15:40:49.000Z": "Here are your 2017 captains! #BuildingSomethingSpecial  #RideForTheBrand  #OneWyoming", "2017-08-21T21:02:11.000Z": "The eclipse is over and everybody is stuck in traffic. Which never happens in Wyoming. Tens of thousands flock to Wyoming for eclipse, jam highways heading out of state The lines of traffic that snarled eclipse viewers heading north into Casper on Monday morning are snaking their way back down south. trib.com", "2017-08-21T21:41:01.000Z": "Trump rolls out executive order to speed infrastructure permitting, approval https:// buff.ly/2v7oYBL via @UtilityDive Trump rolls out executive order to speed infrastructure permitting, approval President Donald Trump's executive order fulfills campaign promises to streamline permitting and approval processes for major infrastructure projects. utilitydive.com", "2017-08-21T17:50:43.000Z": "And there it is! #eclispe2017  #thatswy", "2017-08-21T17:47:28.000Z": "There it is!  Total eclipse. #ThatsWY", "2017-08-21T16:35:30.000Z": "And so the eclipse begins...", "2017-08-21T16:19:32.000Z": "Ready for first Contact!", "2017-08-21T15:33:17.000Z": "Thoughts are with our @USNavy sailors aboard the #USSJohnSMcCain as search & rescue operation continues. Stricken destroyer John S. McCain arrives in Singapore, 10 crew still missing The accident occurred near the Strait of Malacca. navytimes.com", "2017-08-21T14:57:39.000Z": "Grateful to Rabbi Zalman & Raizy  Mendelsohn for honor of meeting & interviewing Auschwitz survivor Eva Schloss. All should learn her story.", "2017-08-21T13:04:15.000Z": "Wow! Things are crazy here! #SolarEclipse Quote Tweet NWS Cheyenne @NWSCheyenne Holy moly! Traffic at 4:30 AM on I-25 at WyoHill?  Must be Eclipse Day!   Drive safely out there this morning. #wywx  #eclipse2017", "2017-08-21T01:44:14.000Z": "Our prayers are with these heroes. Quote Tweet The Hill @thehill Navy destroyer collides with merchant ship near Singapore http:// hill.cm/N5dypAT", "2017-08-20T18:15:27.000Z": "Traffic is flowing smoothly into #Wyoming from #Colorado . Here's the latest webcam view. #ThatsWY  #WYEclipse", "2017-08-20T05:07:18.000Z": "Eclipse Offers Economic Opportunity to Goshen County http:// bit.ly/2wZ8Vav", "2017-08-16T23:36:49.000Z": "The grand opening of David Street Station, a great new jewel for Casper, WY.", "2017-08-16T14:31:59.000Z": "Travels with Cynthia: went to the most remote place in the lower 48 and wound up with my pic in the paper http:// jhnewsandguide.com/news/features/ years-in-lummis-sees-the-wild/article_fa244baf-6a36-595e-9e81-c441388801c4.html ", "2017-08-19T18:51:48.000Z": "", "2017-08-19T18:07:30.000Z": "Great celebration of Wyoming Centennial Ranches. Thanks to you all for all you do. #LongliveAg", "2017-08-11T15:32:23.000Z": "Enjoyed being in Afton for the Lincoln County Fair parade this past weekend.", "2017-08-11T18:48:36.000Z": "That's a view we can get used to! Now introducing Mustang Vision... #HorsePower  #MustangVision  #HighDefHighlights", "2017-08-10T11:43:26.000Z": "Just back from an inspection of one of Wyoming's most precious assets, Gannett Peak. Things are simple up here. Basic lessons to be learned.", "2017-08-07T23:28:05.000Z": "At the Boston Garden w/ hundreds of fellow legislators. Hope we're better at  legislating than we are at the NBA 3 point arc! #ncsl2017", "2017-08-09T16:38:16.000Z": "Basin, Green River, Jackson, Laramie, Riverton and Washakie among the farmers markets tonight. https:// wyomingfarmersmarkets.org  #farmersmarketweek", "2017-07-25T18:44:42.000Z": "WIA ED testifies before the Senate on developing and deploying clean energy technologies. @SenJohnBarrasso  http:// bit.ly/2vXIm4q", "2017-07-24T15:24:38.000Z": "Proposed Brook Mine Receives Federal Grant To Research Coal-Based Carbon Fiber Proposed Brook Mine Receives Federal Grant To Research Coal-Based Carbon Fiber A press release from Ramaco, a Kentucky-based coal company, says the Department of Energy has awarded it a $7 million grant. The grant is geared towards wyomingpublicmedia.org", "2017-07-20T01:45:02.000Z": "Our family's prayers go out to Senator John McCain and his family.", "2017-07-20T22:20:08.000Z": "This looks a lot like the people flooding into town for @CheFrontierDays ! Be safe and have fun out there folks! #TBT", "2017-07-17T23:41:49.000Z": "Even With Food Freedom Act, Wyoming Ranchers Struggle To Get Beef On Plates Even With Food Freedom Act, Wyoming Ranchers Struggle To Get Beef On Plates In 2015, Wyoming passed the Food Freedom Act , giving the state the most lenient local food regulations in the country. It allows Wyoming farmers to sell wyomingpublicmedia.org", "2017-07-12T18:00:56.000Z": "Swan Land and Cattle Company was one of the several well-known foreign stock companies which operated in the U.S. http:// wyoshpo.state.wy.us/NationalRegist er/Site.aspx?ID=345 ", "2017-07-12T00:06:48.000Z": "Interesting collaboration agreement on the Thunder Basin National grassland. Ranchers, energy & Feds came together. Protects 8 species.", "2017-07-09T13:47:35.000Z": "Great time in Buffalo this weekend!  Longmire Days, Big Horn Music Festival.  We got it all goin' on #Longmire", "2017-07-03T16:29:26.000Z": "Honored to be in the Cody Stampede Parade today with the best VP ever. #Happy4thofJuly  #GODBLESSTHEUSA", "2017-06-29T20:50:13.000Z": "It's here! Hot off the press, Cheyenne A Sesquicentennial History by Rick Ewig", "2017-06-25T02:43:05.000Z": "WPR won 2 firsts and a 2nd place award at the Public Radio News Awards banquet in Miami.  A https:// instagram.com/p/BVvwS63jc9F/", "2017-06-07T15:08:14.000Z": "Glad to be in Buffalo for the Stockgrowers Soil Health workshop at the Cloud Peak Center and on the ground on the Merlin Ranch", "2017-06-06T04:52:37.000Z": "Cheyenne's newest Bishop, Steven Biegler, says coming to Cheyenne felt like the right thing to do. Cheyenne officially has a new bishop After a Mass of Ordination, Steven R. Biegler is now the ninth Bishop of the Diocese of Cheyenne. wyomingnewsnow.tv", "2017-04-16T15:53:14.000Z": "Some celebrate the Savior's resurrection with a bunny, we have Clarence the Easter Turkey.", "2017-04-08T18:59:52.000Z": "Cowboy up! Scrimmage day! #RideForTheBrand", "2017-04-03T20:08:52.000Z": "Welcome Home Wyoming Veterans http:// fb.me/WVm2Zz7L", "2017-03-24T02:34:26.000Z": "Thank you", "2017-03-23T21:45:01.000Z": "Thanks to our opening panel for a great first session this morning! @EnergyUW  @Mark_Gordon_WY  @xprize  #blackhillsenergy  #WYEnergyTech", "2017-03-18T17:14:43.000Z": "Don't these nachos look amazing? http:// fb.me/7XNE4SdRj", "2017-03-18T17:54:04.000Z": "Great crowd out for Fly Fishing Expo at Lions Park @CheyenneCityWY next demo at 1. Secrets of Good Casting @WGFD", "2017-03-17T02:03:57.000Z": "Full day. Thanks to SOS Murray, Super Balow, Chair Nicholas, Reps Burkhart and Wilson for their help. Hard work. Ready for April 6 SLIB!", "2017-03-16T12:13:35.000Z": "Looking forward to 8:30 to 5 PM today working with SLIB on how to invest to fund education, Hathaway etc.  Not so easy, there are trade-offs", "2017-03-16T03:40:23.000Z": "Day 2 of SLIB annual asset allocation/investment policy review.  Open to all.  $20B & 1/5th of WY income. Come by STO 3/16 @ 2020 Carey 3 fl", "2017-03-05T19:16:12.000Z": "What a beautiful day in the neighborhood.", "2017-02-13T15:23:44.000Z": "Great discussion on how the 2017 general election will impact the economy & monetary policy led by @Mark_Gordon_WY", "2017-02-14T16:19:39.000Z": "Great meeting this a.m. w/ @SpeakerRyan and @RonEstesKS , @Mark_Gordon_WY , @TreasurerPearce of @StateTreasurers .", "2017-01-21T02:34:14.000Z": "Tune into @WyomingPBS to learn about the Sovereign Wealth Fund panel I hosted this fall!", "2016-12-14T00:12:06.000Z": "News Release: TransWest Express Transmission Project, Gateway South Project Each Receives a BLM Record of Decision http:// eepurl.com/ctjMeb", "2016-11-17T17:12:17.000Z": "Some of the most influential senators in the upcoming Congress? That would be these three coal state lawmakers CONGRESS: Coal in control as Wyo. senators ascend to top slots Coal-state senators are poised to assume several of the most prominent leadership positions in Congress, promising to roll back a series of environmental regulations and offering a modicum of support... eenews.net", "2016-11-17T23:36:16.000Z": "Saudi Wealth Fund May Be World's Least Transparent  -- whereas Wyoming is 3rd most transparent - best of the US! Saudi Wealth Fund May Be World's Least Transparent A Saudi Arabian sovereign-wealth fund being prepared to take ownership of state-owned oil giant Saudi Arabian Oil Co. is less transparent than a fund belonging to Equatorial Guinea that currently... wsj.com", "2016-11-04T14:43:05.000Z": "Local editorial: Voters in #Cheyenne should support 2 of 3 ballot measures. #WyLeg  #WyPol  @Mark_Gordon_WY  http:// buff.ly/2f2FCh6", "2016-11-04T20:46:24.000Z": "It is critical to maintain oversight of the federal government especially agencies that have big impacts on #Wyoming Cattle Call: Oversight in the Fight for Wyoming Under eight years of President Obama, congressional oversight has been a crucial tool in the fight for Wyoming. As part of this effort, the Oversight and Gov... youtube.com", "2016-11-04T20:44:59.000Z": "Pushed @deptoflabour to change a visa worker rulemaking that could have put #Wyoming family ranches out of business Cattle Call: Oversight in the Fight for Wyoming Under eight years of President Obama, congressional oversight has been a crucial tool in the fight for Wyoming. As part of this effort, the Oversight and Gov... youtube.com", "2016-11-04T15:04:08.000Z": "One last one for the road.. Before it closes that is. Thanks to @ynplodges for this reminder https:// instagram.com/p/BMZIBs_Dnbq/", "2016-11-03T14:44:03.000Z": "Local editorial from @WTEOpinion : Voters here should support 2 of 3 ballot measures. #WyLeg  @Mark_Gordon_WY  http:// buff.ly/2fosDrG", "2016-10-30T02:34:10.000Z": "Another unbeaten goes down!\n\nWyoming snaps a 22-game losing streak against AP ranked opponents by beating No. 13 Boise State.", "2016-10-30T02:34:08.000Z": "Wyoming wins!", "2016-07-23T02:56:00.000Z": "Maddie and Tae killed it Cheyenne Frontier Days #cheyennefrontierdays  @cfd2016  @sfagin  @Mark_Gordon_WY  @MaddieTaemusic", "2016-07-21T22:59:18.000Z": "@GovMattMead came to visit the #WYGOP at #RNCinCLE !", "2016-07-21T18:21:16.000Z": "Superintendent Balow got to enjoy the National High School Finals Rodeo last night w/Frontier FFA advisor Joe Allen", "2016-07-21T14:01:54.000Z": "Morning update at the hotel from Ambassador John Bolton #RNCinCLE", "2016-07-21T14:01:00.000Z": "Morning talk with John Bolton and the Wyoming Republican Party Delegation in Cleveland. #MakeAmericaGreatAgain", "2016-03-27T15:37:16.000Z": "The Economist | Business in America: The problem with profits http:// economist.com/news/leaders/2 1695392-big-firms-united-states-have-never-had-it-so-good-time-more-competition-problem?frsc=dg%7Ca  via @TheEconomist The problem with profits Big firms in the United States have never had it so good. Time for more competition economist.com", "2016-02-18T00:13:51.000Z": ". @jillian4supt with @Mark_Gordon_WY at a Fire Engine open house in Cheyenne.", "2015-11-16T02:47:21.000Z": "Congrats to Sheridan against a good team. Sheridan victory over Gillette was an 'offensive showdown' http:// trib.com/sports/high-sc hool/football/sheridan-victory-over-gillette-was-an-offensive-showdown/article_4e69debf-26de-5cd6-a79b-64f9b8bb716e.html?utm_medium=social&utm_source=twitter&utm_campaign=user-share  via cstribune Sheridan victory over Gillette was an 'offensive showdown' The two best football teams in the state put on an offensive display in Saturday's Class 4A state championship game. trib.com", "2015-11-15T23:39:52.000Z": "I love Wyoming & it is an incredible responsibility & honor to be integrally involved in Wyoming's financial health Wyoming Treasurer earns worldwide recognition Wyoming Treasurer Mark Gordon named in the \"Top 100 Most Significant and Impactful Asset Owner and Public Executives of 2015.\" wyomingnewsnow.tv", "2015-11-14T19:39:05.000Z": "State 1A 6 Man Football Championship Bracket http:// whsaa.org/stateevents/fo otball/1a-6man/bracket.asp ", "2015-11-14T19:20:12.000Z": "Allons enfants del la Patrie...  Contre nous de la tyrannie, L'étendard sanglant est lévee ...  We are with you amis  Aux armes, citoyens!", "2015-11-14T13:19:07.000Z": "Our thoughts and prayers are with the citizens of France.", "2015-11-11T22:41:21.000Z": "Happy Veterans Day! Today, and every day, thank you for your service and dedication to our country. #VeteransDay", "2015-10-27T01:08:55.000Z": "Excited Patrick is on board.  He is already making an impact. http:// trib.com/business/flemi ng-named-wyoming-cio/article_f1f6d383-24b7-5987-b351-c90ba46145b9.html#.Vi7OVa53rxc.twitter ", "2015-10-23T03:17:20.000Z": "finished The Missing Semester by Gene Natali Jr. and Matt Kabala and gave it 5 stars http:// amzn.to/1PKfliC", "2015-05-19T14:38:24.000Z": ". @Mark_Gordon_WY speaking in support of our proposal to invest county funds with the treasurer. #wyleg", "2014-11-17T17:36:06.000Z": "Wyoming's world-class savings: A state legislative committee was told recently that with some $19 billion in t... http:// bit.ly/11dRoKV", "2014-11-12T03:22:12.000Z": "Happy Veterans Day to all who have served and to those who are still serving our great nation.", "2014-11-09T18:15:24.000Z": "\"In my view the best use from an investment standpoint is to be able to diversify prudently and thoughtfully\" http:// po.st/RYDR9p", "2014-11-05T19:48:41.000Z": "Glad I was able to stop by the Thunder Basin Grasslands Prairie Ecosystem Association meeting in Bill, WY. Great working being done!", "2014-11-05T15:43:39.000Z": "Thank you all so much for your support. I'm honored to continue to serve as your State Treasurer!", "2014-11-04T14:23:41.000Z": "Happy to pull the lever today for @MeadforGovernor , @jillian4supt , @EdMurrayforWyo , @Mark_Gordon_WY , and @Cloud4auditor  #wypol", "2014-10-24T20:05:12.000Z": "Johnson County ranchers celebrated for greater sage grouse conservation http:// buffalobulletin.com/news/article_3 6bd11a0-5b8c-11e4-b438-0017a43b2370.html#.VEqwGFBP1os.twitter  via @townnews", "2014-10-23T20:37:46.000Z": "\"I feel that we have agreed to give up a significant footprint of the offices\" Cloud said \nA tight fit: http:// bit.ly/1se6shf via @cstribune", "2014-10-22T19:04:07.000Z": "Great weekend celebrating UW Homecoming with my fellow Republicans!", "2014-10-13T15:21:01.000Z": "Fremont County - I'll be on KOVE's Coffee Time with Joe Kenney in 15 minutes. Tune in to hear what is new with the State Treasurer's office!", "2014-10-11T17:19:32.000Z": "Congratulations to my wife and thank you to the Wyoming Women's Antelope Hunt for another successful http:// instagram.com/p/uBTWy9KJu2/", "2014-10-06T19:36:02.000Z": "I was honored to be able to officiate my nephew Ryan's wedding this weekend in Missoula. http:// instagram.com/p/t0rAMiKJvc/", "2014-09-29T18:28:23.000Z": "I will be speaking on Cheyenne Today in just 5 minutes! Tune in now to @KFBCRadio to hear what is new in the State Treasurer's office.", "2014-09-25T14:06:18.000Z": "Today is the first day of early voting in Wyoming! Contact your County Clerk to request an absentee ballot. http:// bit.ly/1qNWUgk", "2014-09-14T16:59:13.000Z": "Your 2014 Republican slate. It's a great year to vote the ticket from to to bottom!", "2014-08-19T16:43:08.000Z": "Today's the day! Get out & VOTE! Need to find your polling place? Check the Secretary of State's website. http:// bit.ly/1ld1NzK", "2014-08-19T13:45:20.000Z": "Invest in Wyoming's future, pull the lever for @Mark_Gordon_WY  #VOTE2014", "2014-08-10T14:34:10.000Z": "Thank you @WTEOpinion for your endorsement! \"Gordon is right choice for treasurer\" http:// WyomingNews.com : http:// wyomingnews.com/articles/2014/ 08/10/opinion/staff_editorials/column121.txt#.U-d88mEMIic.twitter ", "2014-08-07T19:12:16.000Z": "Honored to receive this endorsement from CST \"Editorial board: Gordon clear GOP choice to re-elect as treasurer:\" http:// bit.ly/V1uQKa", "2014-08-05T22:13:27.000Z": "Learn abt the good work @Mark_Gordon_WY has been doing for WY & the vision he has for the future of Treasurers Office http:// trib.com/news/state-and -regional/govt-and-politics/video-mark-gordon-candidate-for-wyoming-treasurer/youtube_92314c58-2a75-5ea8-ad11-4551f785d137.html ", "2014-07-19T16:10:13.000Z": "Having a great morning at the Cheyenne Frontier Days parade! #CFD2014  http:// instagram.com/p/qo4pmhKJt_/", "2014-07-11T16:04:14.000Z": "I'm excited to be riding in the Sheridan WYO parade this morning! http:// instagram.com/p/qURmvwqJlN/", "2014-07-10T15:25:56.000Z": "Thrilled to serve this beautiful state on her 124th birthday. We've come a long way Wyoming! http:// instagram.com/p/qRobYOKJuD/", "2014-07-08T23:23:27.000Z": "I'm honored to receive endorsements from four well respected organizations! http:// markgordon4wyoming.com/2014/07/state- treasurer-receives-endorsements-for-2014-campaign/ ", "2014-06-19T15:32:56.000Z": "Thank you to my friend and neighbor Mike Gill for hosting a great Meet and Greet last night for http:// instagram.com/p/pbkiPjqJud/", "2014-06-12T14:59:28.000Z": ". @Mark_Gordon_WY shows command of the issues at WAM #WYTres14  @WYGOP", "2014-06-10T19:44:04.000Z": "Thank you KFBC and Kari Eakins for having me on Cheyenne Today this afternoon! http:// instagram.com/p/pE2HqtKJhF/", "2014-06-08T02:33:02.000Z": "Thank you to the Hot Springs GOP for hosting a wonderful Reagan Day dinner and a BIG thank you to my http:// instagram.com/p/o92iZiqJse/", "2014-06-07T00:55:58.000Z": "Great to see @Mark_Gordon_WY supporting the #NCGOP  @wygop  #Vote2014", "2014-06-06T20:00:20.000Z": "As a 2nd generation stock grower, I was particularly honored that I was given the opportunity to speak http:// instagram.com/p/o6kzZNqJmF/", "2014-06-03T15:19:08.000Z": "Signs are going up all over Wyoming. Let us know if you would like one! http:// markgordon4wyoming.com/contact-us", "2014-06-01T22:17:32.000Z": "The view that always brings me back to all that is good about growing up in Wyoming. http:// instagram.com/p/otnkzgKJsp/", "2014-05-30T15:12:57.000Z": "Tune in to KROE right now, as I co-host Public Pulse with Kim Love! http:// instagram.com/p/ooCWa6KJoG/", "2014-05-30T01:45:04.000Z": "Full day in Sheridan tomorrow! I'll be co-hosting KROE at 9am, lunch at Sheridan Senior Center, & then touring Ptolemy Data Systems!", "2014-05-20T14:41:25.000Z": "Know how #energy supports Wyoming? Listen to last week's Open Spaces: http:// bit.ly/1jRHoNT", "2014-05-16T23:05:44.000Z": "Made it official and filed for State Treasurer with the Secretary of State's office today! #election2014  http:// instagram.com/p/oE1U5PqJmQ/", "2014-05-16T15:42:53.000Z": "Last night with @lelandchris59, Hon. Nancy Guthrie, & Mary Flitner at @SaraFlitner 's Jackson mayoral announcement", "2014-05-15T23:09:47.000Z": "Back in #Wyoming after 3 great days meeting with fellow state treasurers at the National Association of State Treasurers conference!", "2014-05-08T18:13:37.000Z": "Wyoming ranked No. 1 for taxpayer return on investment! http:// shar.es/SjJV9", "2014-05-04T02:12:24.000Z": "Replying to @Mark_Gordon_WY . @Mark_Gordon_WY there with you in spirit!  Wyoming is blessed to have Mark Gordon. #WYTreasurer  #Vote", "2014-05-04T00:55:46.000Z": "So blessed to have my whole family join me at the #WYGOP convention!", "2014-05-03T21:42:05.000Z": "@Mark_Gordon_WY : \"our family believes politicians should come from the private sector and return to it once theyre' done.\"", "2014-05-01T14:21:20.000Z": "Boothing at the Wyoming Republican convention, stop by and see us! http:// instagram.com/p/ndRY75qJjt/", "2014-04-28T16:44:55.000Z": "Honored to attend the \"Light of Hope\" breakfast in Sheridan this past Friday to promote #childadvocacy  http:// bit.ly/1fpOcSk", "2014-04-18T20:17:30.000Z": "Three full days of #FinancialLiteracy presentations across Wyoming schools. The future is bright for our great state!", "2014-04-17T18:51:48.000Z": "Be aware of scams regarding your unclaimed funds, info is FREE from the Unclaimed Property Division in my office http:// bit.ly/1nsKabK", "2014-04-12T21:23:44.000Z": "Nice to be home helping at Buffalo Middle School Track meet. Go Bandits", "2014-03-27T00:30:03.000Z": "Big thanks to @SweetwaterGOP for coming out to the Young at Heart Senior Center today!", "2014-03-26T18:46:53.000Z": "Treasurer Gordon and Sweetwater County Republican chair, Jon Aimone in Rock Springs. http:// fb.me/2OeEbDw0e", "2014-03-26T12:16:47.000Z": "Thank you to everyone who came out to campaign kick-off events over the last two days! http:// markgordon4wyoming.com", "2014-03-22T19:40:28.000Z": "Treasurer's office campaign unites people with $300,000 in unclaimed funds http:// greenfieldreporter.com/view/story/596 59b9826824dc39364fb2bb3d475ec/WY--Unclaimed-Funds#.Uy3m3xsnhew.twitter ", "2014-03-10T19:25:34.000Z": "Renovate the Capitol but keep it the \"people's house\" http:// trib.com/opinion/column s/gordon-renovate-the-capitol-but-keep-it-the-people-s/article_7edaaf90-1844-511e-808a-f7f14910c317.html ", "2014-02-28T22:35:35.000Z": "Miss the Future of Coal forum on Wednesday? It's airing now on @WYPublicMedia Open Spaces http:// wyomingpublicmedia.org/programs/open- spaces-wyoming-public-radio ", "2014-02-06T20:01:31.000Z": "Check & see if you have unclaimed property http:// kgwn.tv/home/headlines /Wyoming-Trying-to-Give-Back-Millions-to-its-Citizens-243853881.html ", "2014-02-04T18:00:20.000Z": "State of Wyoming receives $69.5M from 2013 private equity investments http:// bit.ly/1fY2xRD", "2014-02-01T15:58:44.000Z": "News Release: State Seeks Owners of Unclaimed Funds http:// treasurer.state.wy.us/pdf/pressrelea sepreadv013114.pdf ", "2014-01-20T18:26:58.000Z": "Heading to the MLK Jr. Day march in downtown Cheyenne \"Life's most persistent and urgent question is, 'What are you doing for others?'\" #MLK", "2014-01-15T16:35:26.000Z": "Wyoming's investment income benefits big from record-breaking year on Wall Street: http:// bit.ly/1eDy9v3 via @cstribune", "2013-12-15T16:45:18.000Z": "Thank you to everyone in Goshen County for another fabulous 2 Shot Goose Hunt.  Great day, good hunting and fellowship!", "2013-10-28T21:26:36.000Z": "Wyoming invests $34 million in bonds supporting Sweetwater County uranium mine - Daily Journal http:// dailyjournal.net/view/story/9b2 0ae79a3ef42b8854a53894919baa1/WY--Uranium-Mine/#.Um7A64yRjEQ.twitter ", "2013-09-17T17:46:34.000Z": "Excited to be speaking at the Buffalo Rotary today!", "2013-09-14T22:14:58.000Z": "There is a storm brewing in Laramie pokes up 21 to zip GO POKES!", "2013-09-04T16:34:06.000Z": "Watched the rockers Gooding play music and talk about financial literacy at two schools in Cheyenne. Good stuff!  Great timely message.", "2013-08-27T04:29:37.000Z": "Good news today: Wyoming is going to get back some of the royalties the Feds withheld (sequestered) for 2013 in 2014, but sequester remains.", "2013-08-26T00:05:12.000Z": "Dad is 96 today. What a life!  What a man!  Happy Birthday.", "2013-08-25T14:49:10.000Z": "Spent the day yesterday in Emblem, WY at Big Horn Basin Tea Party event. Good folks and learned lots. Beautiful day in Wyoming. Thank you.", "2013-08-17T20:40:07.000Z": "Just coming away from the State Fair: parades, conferences, kids, rodeo, and pies -- oh the pies. Congrats to all the Centennial Ranches", "2013-08-10T19:27:40.000Z": "Happy 100 Years Kaycee!  Best darn town in the West.", "2013-08-03T21:44:39.000Z": "Had a great time in the JCF&R parade this morning!", "2013-07-10T22:50:13.000Z": "Happy 123rd Birthday Wyoming! We are blessed to live in such a wonderful state.", "2013-07-08T13:21:21.000Z": "Wyoming wins big in 2013 stock market http:// bit.ly/156KfrC", "2013-07-04T21:44:29.000Z": "Cody 4th of July!  What a great community.  Saw my friend Tim Wade at North Fork Anglers -- busy busy time for fishermen in Wyoming.", "2013-06-21T15:18:55.000Z": "Slib Approves More Than $18 Million In grant & loan requests http:// wyomingbusiness.org/news/article/s lib-approves-more-than-2418-million-in-/7601#.UcRuUcXvQ_s.twitter ", "2013-06-14T01:31:51.000Z": "Wyoming lost a champion this week. Thyra Thomson, you will be missed and your contributions and dedication remembered.", "2013-05-22T02:32:35.000Z": "Congratulations to the Fremont County Library system on receiving a $50K donation!", "2013-05-20T02:27:36.000Z": "Had a great time in New York celebrating my daughter Anne's graduation from Pace University!", "2013-04-12T23:52:57.000Z": "New law allows state board to collect restitution from people who damage Wyoming public lands http:// therepublic.com/view/story/3fc ae7c21d6145d6870e750ab976cd90/WY--Damaged-Land#.UWieA3xcpBk.twitter ", "2013-04-08T00:27:03.000Z": "Just toured UR-Energy site. Thanks Wayne and Steve for showing me what you have been working on.", "2013-04-07T13:06:57.000Z": "Beautiful spring days with moisture falling from the sky... It will make for some grass anyway.  Spring Turkey Season is here.", "2013-04-07T12:31:39.000Z": "Travelled to Buffalo Friday for Wyoming Republican Central Committee Reception then to Evanston for Uinta County Reagan Supper. Great days.", "2013-03-30T03:53:40.000Z": "Big scare today.  Jennie got bucked off.  Played her Corb Lund song about being a cowboy and made her supper.  Love that woman I do!", "2013-03-29T01:34:26.000Z": "Sat down with Robert Geha this morning http:// kgwn.tv/story/21817811 /state-secretary-mark-gordon-talks-mineral-payment-cuts ", "2013-03-27T03:56:52.000Z": "It is just amazing that the Federal Government thinks the way to comply with sequester is to welch on your obligation to pay the states.", "2013-03-27T01:01:43.000Z": "\"We are using every means necessary to make sure our state is made whole.\" http:// content.govdelivery.com/bulletins/gd/W YGOV-73167f ", "2013-03-16T15:55:09.000Z": "It was wonderful to tour Lovell and I was honored to give the keynote address: http:// lovellchronicle.com/2013/03/annual -chamber-banquet-includes-awards-and-wyoming-state-treasurer-mark-gordon/ ", "2013-03-13T18:46:10.000Z": "I had a great visit to FMC to tour the trona mine!", "2013-02-13T03:24:34.000Z": "The #SOTU was tonight, but #wyleg was hard at work as well. Stay up to date with the status of this year's bills: http:// legisweb.state.wy.us/lsoweb/session /BillsInfo.aspx ", "2012-12-02T13:56:18.000Z": "Mr. President:  Is that what you call leadership? After you narrowly won reelection, you are making lists of who is naughty or nice?!?", "2012-11-22T16:06:27.000Z": "Proud as punch of our Wyoming Marching Band!", "2012-11-22T00:50:39.000Z": "Happy Thanksgiving. We live in a wonderful country. God Bless Wyoming and keep her free.", "2012-11-15T02:29:50.000Z": "#wallopfund forum.fascinating", "2012-09-07T02:50:59.000Z": "Please let's get real not just promise", "2012-09-07T02:49:28.000Z": "The same administration that set in motion the public protection of private risk.", "2012-09-07T02:47:34.000Z": "What are you doing to help community banks?  Suffocating them with regulation?", "2011-10-06T09:53:00.000Z": "Jobs...Steve made them happen. Hope we can remember his entrepreneurial spirit and emulate it more.", "2011-09-15T03:11:33.000Z": "Wyoming and the nation lost a courageous and and loyal leader today with the passing of Senator Malcolm Wallop.  Godspeed my friend!", "2011-07-07T04:50:25.000Z": "finished Three Cups of Tea by Greg Mortenson et al. http://amzn.to/gGO5vD #Kindle", "2011-05-02T04:19:41.000Z": "It's a comma. Significant yes but a comma none the less. Elated sure but let's not lose focus as we have before. Thank you Armed Forces", "2011-04-18T14:28:25.000Z": "Check Casper Star-Trib George Will column today about Tom Hoenig", "2011-04-13T18:40:17.000Z": "Another wonderful but deeply disturbing speech from our president. I struggle with Government by fairytale.", "2011-04-03T13:17:11.000Z": "Windy day here in Wyoming!  Calves are coming a lot faster this year... We aren't even really supposed to be starting till tomorrow.", "2011-03-14T15:18:02.000Z": "Horray for the Buffalo Bison.  State Champs", "2011-03-13T00:39:33.000Z": "finished Delivering on the Promise: The Education Revolution by Barbara B. Gaddy Carrio http://amzn.to/eZkTtX #Kindle", "2011-03-13T00:34:33.000Z": "finished The Death and Life of the Great American School System by Diane Ravitch http://amzn.to/h15yyY #Kindle", "2009-08-21T16:25:53.000Z": "Getting ready for a family reunion.  Yesterday I had a wonderful lunch with former Senator Malcolm Wallop and his wife -- Discussed economy.", "2009-08-05T15:03:55.000Z": "After a long time, the ranch is performing well with new capacities occasioned by water and fence plus mostly planning.", "2009-04-27T12:00:53.000Z": "Early morning at the ranch, nice morning"}